{"title": "Is it going to help Tesla to dominate the reduced margin?", "selftext": "", "id": "1571bpx", "created_utc": 1690075644.0, "score": 470, "upvote_ratio": 0.91, "num_comments": 218, "comments": [{"body": "10 year loans next", "score": 266, "replies": [{"body": "Amazed they aren’t that long already considering you can get a boat loan for that long.", "score": 94, "replies": [{"body": "Boats dont often put on 150000-200000 miles on the motor and drive train", "score": 64, "replies": [{"body": "No, but they often live in salt water, and when they run they're close to full throttle the majority of the time. New diesel boat engines are expected to last 10 years of non-commercial use. Obviously less time for commercial use. Gas outboards (up to ~300hp or so) have a shorter lifespan.", "score": 55, "replies": [{"body": "Don’t tell the Navy that.", "score": -4, "replies": [{"body": "You mean the Navy with almost unlimited funding and full time mechanics? I don’t think they’re taking out personal loans for their engines. Just a hunch, but I bet they're also not buying consumer grade or sized engines either.", "score": 19, "replies": []}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Pretty much every inboard sailboat is diesel.", "score": 4, "replies": []}]}]}, {"body": "That’s because they go by hours not miles.. Most outboards have a lifespan of 1,500 hours or 7 to 8 years", "score": 3, "replies": []}, {"body": "EVs have much less problems with that.", "score": -2, "replies": [{"body": "You don’t park your EV in salt water?!", "score": 15, "replies": [{"body": "That's how you marinate them to perfection", "score": 5, "replies": []}, {"body": "You can't park there mate.", "score": 3, "replies": []}, {"body": "Less problems with more miles, your trying to be obtuse and everyone else is joining in, Reddit as usual.", "score": -2, "replies": []}]}, {"body": "Yeah, until the battery just needs to be replaced. No problems at all until you need a new car!", "score": 1, "replies": [{"body": "Battery in quality EV last longer than most ICE transmissions or engines.", "score": -4, "replies": []}]}]}]}, {"body": "Boats last a lot longer than cars though.", "score": -5, "replies": [{"body": "Sorry, what? How exactly did you arrive at this conclusion?", "score": 24, "replies": [{"body": "On Grandpa's kayak, of course", "score": 32, "replies": []}, {"body": "Fiberglass or wooden hull which has the main obstacle of water. It is worthwild to repair or replace the engine if it dies due to high cost of the product. Life of decades typically regardless of use. \n\nCar drivers are regularly in close proximity to other vehicles. The odds are better than not that at least one accident will occure over a decade. Boats are rarely in accidents. Average mileage gives most vehicles a life of two decades. At that point the annual repair costs can be more than the vehicle is worth.", "score": 8, "replies": [{"body": "Full coverage auto insurance is required by the lender if you have loan.. Many newer vehicles hold their value well these days. A 5-6 year old truck specially a diesel can def be well above 50% of its original purchase price. RVs for example give out 15-20 year loans and they tank in resale value really quick. Not saying I want 10-15 year loans on vehicles but for price tags of 60-80k on many I have no idea how the majority afford them.", "score": 0, "replies": [{"body": "I believe the numbers are about 35% depreciation over 5 years for good cars, and about 55% depreciation over 5 years on the worse end. I am would not be surprised if a diesel truck had even less than 35% depreciation over 5 years. Those things are awesome and age well. \n\nI am fairly certain it's not about affordability and more about people being willing to take in huge amounts of debt for a nice vehicle. So many people are bad with money. It takes a lot of self control when you can easily afford a luxury car to not buy a luxury car. It is also a constant mental battle.", "score": 0, "replies": []}]}, {"body": "Do you have any idea of what it takes to operate and maintain a boat? Do you want to guess what happens to boats in storms? Jesus.", "score": -19, "replies": [{"body": "How often is a boat in a storm?", "score": 10, "replies": [{"body": "We just tow it out of the environment.", "score": 6, "replies": [{"body": "But where does it go?", "score": 1, "replies": []}]}]}, {"body": "Operating a boat is easier than operating a car. The water is fairly open and other boats keep their distance. Boats are very well known to be expensive to maintain. More so than a car. Yes, not mainting a boat or a car reduces the lifespan. A boat is more likely to be refurbished than a car due to the value of the hull. \n\nSome boats are docked. Unless the storm is in a hurricane there is rarely an issue. Docked boats are sometimes raised or brought on land during bad storms. If the boat is not docked then it is usually on a trailer and covered. Unless a tree falls on the boat or 6 feet of water carries it away, the boat is unlikely to experience any damage. \n\nI am not sure what Jesus has to do with this. Did he like boats?", "score": 3, "replies": [{"body": "I want to interject with smart ass answer and says Jesus loves boats and so good at it he can calm the storm. Dude makes boats safe.", "score": 2, "replies": []}]}]}]}]}, {"body": "Definitely the opposite is true", "score": 0, "replies": []}, {"body": "Only the steel bull lasts\nLonger than a car", "score": 0, "replies": []}]}]}, {"body": "30 yrs. Home + Car combo in one loan if needed.", "score": 15, "replies": [{"body": "This is called a HELOC", "score": 1, "replies": []}]}, {"body": "I would actually keep car that long.", "score": 3, "replies": []}, {"body": "No money down, 10 year loan", "score": 2, "replies": []}, {"body": "In my country (Turkey) you go 10 years loans since my childhood . Sometimes 20", "score": 2, "replies": [{"body": "Given the history of Turkey's currency, I'd imagine people want to make loan terms as long as possible.", "score": 2, "replies": []}]}, {"body": "30 year loans exist: they’re called mortgages. Imagine paying a car off as long as a house 😬", "score": 3, "replies": []}, {"body": "I bet they go with a subscription option. They already offer insurance and sell features that way. It doesn't seem like a big leap for them to start just doing a monthly rental service for the whole car. I bet a lot of people, perhaps foolishly, would jump at the chance to roll maintenance, insurance, and their car into a monthly payment. Especially if they got a new one every so many years. \n\nPeople already lease, which is often not the best decision.", "score": 1, "replies": [{"body": "Foolishly? Sounds genius. Enjoy the car for maybe a year and not be stressed about it’s care, price or shelf life.", "score": 1, "replies": []}]}, {"body": "Can you get the loan and then stop paying Tesla after a couple of years because you don't feel like paying your debts?  In the spirit of Elon.", "score": 1, "replies": []}]}, {"body": "How will that help dominate reduced margins? Is Tesla actually running there own financing?", "score": 60, "replies": [{"body": "I think it implies more volume as they make it easier to pay for, which is what is needed to make up for the lower margins", "score": 33, "replies": [{"body": "Fair enough! Sales would be up but the margin per unit would stay the same. I was just thinking if Tesla was also in the finance game then they would also make interest on the loans.", "score": 8, "replies": [{"body": "This guy gets it.", "score": -2, "replies": []}]}]}, {"body": "I believe most major automakers have their own financing options.", "score": 9, "replies": [{"body": "Yea like Toyota Bank And Volkswagen finances. Those are called holdings.", "score": 1, "replies": []}, {"body": "Ya threw banks. If you go to dodge and buy a pickup your loan they give you is threw a bank. The dealership doesn’t make any money off of the interest you pay. The bank pays dodge for the vehicle, you pay the bank back with interest.", "score": -10, "replies": [{"body": "Not exactly. All major auto brands own their own finance branches. For a Dodge truck in your example (all Dodge trucks are actually a separate brand now, they’re just called Ram) you’d be using an in house company called Stellantis Financial. Stellantis Financial is 100% owned and operated by Stellantis, which is the company that makes the Ram truck. So they absolutely make money on the truck and the loan. \n\nDealerships can also make money directly by holding points on the rate and getting a kickback from the bank, whoever it may be. Obviously Tesla doesn’t have dealerships so that does not apply.", "score": 14, "replies": []}, {"body": "Most I've seen go through banks and have this kind of financial structure as well. And the added sales volume this may create surely doesn't make up for the smaller margin which is what's supposed to drive Tesla's insane valuation. My guess is Tesla is trying to compensate for the margin issue with higher sales to satisfy shareholders. Is this a reason to buy more shares or sell?", "score": 1, "replies": [{"body": "Ya I’ve financed a few vehicles and motor cycles over the yrs and it’s always been financed threw a bank from the dealer ship. Unless you go to a we approve anyone dealer.", "score": -2, "replies": [{"body": "Yes it‘s through a bank. But more often than not that’s the Brand‘s own bank. Like the BMW Bank, the Volkswagen Bank, Mercedes Bank or Stellantis Financials. I‘d be extremely surprised if GM, Ford etc don‘t have their own banks.", "score": 3, "replies": [{"body": "Maybe it’s different in Canada. We don’t have a shit ton of different banks like the US does. We have like 5-6 big banks and that’s pretty much it. Cuz everything I’ve financed over the yrs is either td, cibc ext. always one of our big Canadian banks", "score": 1, "replies": [{"body": "Interesting. Typical Canadia government protecting you from exorbitant rates.. live a little!", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Scale", "score": 2, "replies": []}, {"body": "People who couldn’t afford one on a 5 year loan but can on a 7 year loan with smaller payments might buy a Tesla.", "score": 2, "replies": [{"body": "I really hope not. If you can’t afford a 5 year loan you shouldn’t be buying a new Tesla.", "score": 1, "replies": [{"body": "You’re paying more up front for longer term savings in maintenance and gas. So i can see why people may want to stretch to buy it.", "score": 1, "replies": []}]}]}, {"body": "Longer the loan more the number of payments , maybe they are trying to cover their margins", "score": 2, "replies": [{"body": "What? What does how someone pays for a product have to do with the manufacturers margins of said products?", "score": 8, "replies": [{"body": "Easier to afford -> more volume -> can still profit with lower margins", "score": 3, "replies": [{"body": "You're talking net profit, not margin.", "score": 1, "replies": [{"body": "I'm describing the model 3 as a low-margin product which I think is more fitting than net profit", "score": 1, "replies": []}]}]}]}]}, {"body": "Even if they offer 0% apr which they definitely aren’t, given market conditions would that even be an advantage?", "score": 1, "replies": [{"body": "If they ran there own financing they would make money on the interest, no?", "score": 2, "replies": [{"body": "Yes, but that's the premium for default risk. Also most car companies already offer in-house financing, so this isn't a new concept in the least.", "score": 2, "replies": []}, {"body": "It depends on what “run your own financing” means.", "score": 1, "replies": []}]}]}, {"body": "Most car companies run their own financing actually. Captive Automotive Financing Units are pretty big", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I have a few things financed and all the loans threw the different dealers are with big banks.", "score": 0, "replies": []}]}]}, {"body": "Keep people car poor", "score": 61, "replies": [{"body": "Take personal responsibility for your own choices", "score": 5, "replies": []}, {"body": "The future of EV’s is replaceable batteries, 15 year loans and 20 year warranties. One day we’ll own our cars like our houses; potentially for life.", "score": 1, "replies": [{"body": "If self-driving cars become common we might not need to own cars at all. You can just call a car to take you to places.", "score": 2, "replies": []}]}, {"body": "You use a horse to get around Im guessing?", "score": -27, "replies": [{"body": "If you need a car, but  can’t afford 60 month payment terms on $38000, you buy one on of these: [cheapest new cars](https://www.caranddriver.com/features/g39175084/10-cheapest-new-cars-in-2022/?utm_source=google&utm_medium=cpc&utm_campaign=dda_ga_cd_md_bm_prog_org_us_g39175084&gclid=Cj0KCQjw_O2lBhCFARIsAB0E8B_1rV4gbNirxgftf6XIGGrVLORHvBu3wgirlEi9Egd-N8SKV2Q-W0MaAjA_EALw_wcB) not a electric car with poor build quality and terrible depreciation.", "score": 19, "replies": [{"body": "You are aware you don’t need to buy a new car, right?", "score": 4, "replies": [{"body": "In the USA it's very common to need a car just to get food.", "score": 0, "replies": [{"body": "So buy a used car instead of a new one?", "score": 3, "replies": [{"body": "Ironically, it's harder to get a loan for a used car when you're already poor lol", "score": 3, "replies": []}]}]}, {"body": "Yes, but used cars a couple years old are still often more expensive. The world has gone crazy.", "score": 1, "replies": []}]}, {"body": "Those all come with stealership markups that make them more expensive than a base Model 3, particularly after considering federal and state tax incentives.", "score": -3, "replies": []}]}, {"body": "Bicycle and public transportation", "score": 3, "replies": [{"body": "Unless you only use bus and metro you’re sort of right… But you could’ve bought a car already and you know… Arrive everywhere faster and not smelling like a sewer if you had a car. I lived in London for 3 years, ao yeah using the underground and buses is cool and all, but when I lived in the US and Mexico, you can’t beat having a car. I guess it just depends where you live.", "score": 1, "replies": [{"body": "100% where you live. A car in NYC is a burden. But in South NJ it’s a necessity", "score": 4, "replies": [{"body": "i agree, honestly where I live in Mexico everything is a 15 min trip away, groceries, movie theater, family… We cab do just fine with public transport honestly. It’s a lot cheaper on gas too.", "score": 1, "replies": []}]}, {"body": "The main issue is even in our very car dependent society, there’s no need for cars to be costing what they are. *especially* since we don’t have a viable alternative in 99% of the country like other places do.", "score": 1, "replies": []}]}]}, {"body": "Your car doesn’t need to be a Tesla. A Toyota will save you a lot of money", "score": 2, "replies": []}]}]}, {"body": "Can’t wait to mortgage my car. Hopping onto the car ladder 🕺🕺🕺🕺🕺🕺", "score": 11, "replies": []}, {"body": "84 month loans are a sign of desperation. All Teslas need to drop by 10k and maintain the rebated from the fed. I am a long term stock holder and even I can see this coming.", "score": 98, "replies": [{"body": "[deleted]", "score": 30, "replies": [{"body": "Very, very surprised they either haven’t dropped the model 3 price tag and cut costs however they can on it, or introduced a cheaper car just to get new customers rolling in.\n\nThere is a thing about capturing the market even if it’s not the most profitable sector. Since customer loyalty in this sector can really drive (no pun intended) future sales. I.e. capture that share however you can and make the profit back in the future when they go to eventually upgrade the car", "score": 6, "replies": [{"body": "[deleted]", "score": 24, "replies": [{"body": "Hm, TIL. I am admittedly a bit dated on the pricing then. Last I checked it was around that 48k figure.\n\nSo that is better then", "score": 4, "replies": []}, {"body": "It can drop to under $30k depending on your state.", "score": 1, "replies": []}]}, {"body": "I'm curious about this as well. A no frills tesla. Motor, 4 okay-ish seats. Lower hp for a smaller battery/motor combo. Sell it for mid 20k's. They'd be able to flood the market with lower cost cars. I'd buy one for my teenage kid..", "score": 9, "replies": [{"body": "They announced the exact model you're describing like 6 months ago. Will be built in upcoming Giga factory Mexico with first deliveries expected to be somewhere during 2025.", "score": 3, "replies": [{"body": "And in “2025” they will MSRP For $60,000!", "score": 3, "replies": [{"body": "So their compact car will sell for nearly more than double the Model 3 price, makes sense.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "They made more profits in Q2 than they were making in the entire year 4 years ago. Record profits, record revenues and margins that destroy any other EVs in the marketplaces. They have the best selling car in the world right now, not the best selling EV. They have no debt and $24B cash. \n\nDesperation? Can’t believe people agree with you and can’t believe a long time holder would have this logic", "score": 2, "replies": [{"body": "You can look at todays reported metrics and invest the way you want.\n\nHowever, Teslas value is its long term production and we are coming to a saturation curve where financially it is not viable for lower-middle class citizens, unless they lower production costs and encourage a continued increase in demand by lower product initial costs. This is known and required for continued production growth. Tesla’s current profit reports are encouraging but those monies are needed for continued R&D and production ramp. There is also massive real competition on the horizon with BYD. BYD will be the Honda of the late 80s, first shunned by US consumers but the price value is compelling enough for sales.\n\nThere is the concept of not owning a vehicle which will eventually happen but cannot be forced on a population. The populous needs time for FSD to be a real thing and time for a company (possibly Tesla) to gain the trust of consumers for when they need a vehicle it will be there and it will be inexpensive and of good quality. This rosy future is possible and probable but is further out in time beyond Teslas real production ramp problems.\n\nAs a long term investor I am not selling, the company has legs and is continuing its marathon run. I am a fan of their products and of their purpose.", "score": 1, "replies": [{"body": "That’s a very logical comment I just don’t see the same saturation you do. EVs make up maybe 7% of  vehicles on the road. 93% untapped market and Tesla holds 60% of the US market and most the global market too, by a lot. Go around and ask people if they plan to buy another gas car or will buy an EV for the next car and understand that this market is expanding exponentially. I feel like you’re thinking of it in terms, as if it stayed the same 7% of all vehicles.", "score": -2, "replies": [{"body": "The saturation point is of the middle-upper class, not of the total possible market. There are millions more in the lower-middle class that want a Tesla but can’t afford more than a $400/month payment. Wages just aren’t keeping up with inflation enough for Tesla to maintain the same pricing.", "score": 2, "replies": []}, {"body": ">93% untapped market and **Tesla holds 60%**\n\nThis *is* the saturation. 60% market share means there's only 40% more market share to capture. And 100% market share is not possible. So even if they maintain that 60% market share, their growth is limited to the growth of the market. Which is great, but also unrealistic.\n\nYou also have to consider that Tesla's target consumer is not the entire car-driving population. They make performance sedans, all priced at or above median for the type of vehicle. You don't get a Tesla to transport your obnoxiously large family, go offroading in the mountains, or tow your boat.\n\nSo the questions are, will their current demographic grow? Will they try to reach new demographics? What is the competition landscape in those scenarios?", "score": 0, "replies": [{"body": "Tesla holds 60% of the 6% and that 6% is EXPLODING. It’ll be 10% very soon and that’s millions and millions more units required to even get to 10. Have you even seen the trajectory of EV purchases? We were at 2% EVs a few years ago and it’s 6-7% already. Very few people near cities are ever going to buy a gas vehicle ever again. \n\nSo will their demographic grow? Lol seriously? Ask yourself if EVs will phase out gas cars eventually. If you answered no then you are in for a surprise. If you answered yes then you answered your own question. \n\nTesla will have a $25k new EV soon as well. CT is a more capable truck than almost any truck on the road, that cream will easily rise to the top and it’s already the most popular vehicle ever to be released in our history. I’m not sure you understand their plans or the massive market share that sits on the horizon very well \n\nWhy do you think every single legacy maker is getting dragged thru the mud with their mouths open to get solidified in the EV marketplace? Gas car sales are plummeting left and right. \n\nLegacy needs to redo their entire production lines, facilities for battery’s, all new engineers, new supply chain and production management… new everything. It’s massive what they need to do to even pretend compete. As a CSCP and supply chain director the writing is clearly written on the wall for Tesla. You either can see or you can’t I guess but I saw it a long time ago and have been extremely happy with the results. They are right on schedule.\n\nEdit: you can make the most simple explanation for some people and they still don’t get it. These are the same ppl who said Tesla is looking terrible in 2017 😂 you can’t downvote your way to enlightenment that’s for sure.", "score": -1, "replies": [{"body": ">So will their demographic grow?\n\nI think you're misreading my statement - yes, the number of people in their current target demographic will increase, but what I'm asking is whether they will try to capture *other* consumer demographics in terms of lifestyle, income, or geography. Not everyone who wants an EV is looking for a $40-$100k performance sedan.\n\nAnd let's be honest: Tesla has a \\*terrible\\* track record when it comes to getting new products and features. Maybe new production will change that, but I think a 'believe it when I see it' attitude is warranted.\n\nUnless they think their current lineup will sustain them indefinitely, releasing new products in a timely manner that appeal to different consumers will be essential to long term competition. People looking for a budget EV or truck won't hold out forever, especially with other manufacturers rapidly filling those particular market gaps already.\n\nWhat I see here, and why I personally hesitate to invest directly, is a company that has a popular product and does very well financially, but has a history of significant overpromising and missing the mark on basics like product releases and steady stream of meaningful new features, which have already put them behind competitors in those markets. The stock's history of overvaluation causes me to ask whether the value is sustainable if the as-yet-unreleased products don't actually happen (or are released late into a crowded market).", "score": 1, "replies": [{"body": "Why do we have to depend on their current lineup when we know they are coming out with a very competitive truck and low cost car in addition to upgrading their models across the board? \n\nAnd yes even if this was their lineup for the next 5 years it would still do extremely well, but good thing they are tapping into other markets and lower cost options across the board. That’s what their global factory upgrades are doing, increasing volume and cutting costs. They are the number 1 EV seller in almost every country in the world which they are being sold in. I don’t think people understand that position they are in vs other makers right now. \n\nBesides the model 3 is already well under the average cost of a new car in the US. \n\nI can totally see your point if you are not in the supply chain profession and are just going at it from purely a “these are the numbers today and today alone and I don’t expect them to get any better” standpoint but again, look at the growth yoy and mom and we already know they are massively ramping up and demand is very very strong. They will not have enough production in Q3 due to factory upgrades, that’s the biggest issue they have.", "score": 1, "replies": [{"body": ">Why do we have to depend on their current lineup when we know they are coming out with a very competitive truck and low cost car in addition to upgrading their models across the board?\n\nBecause we *don't* know that these are going to happen for sure, or when. They have been \"coming soon\" for 6 years, and the only such item that has materialized, the Semi, was late by 3 years. \n\nLate launches matter because this is a very competitive space, and it can cost a lot of market share. Since Tesla first announced - and delayed - the CyberTruck, pretty much every other car maker has come out with an electric truck. Including an EV version of the most popular truck in the country, the F-150. The budget EV space is rapidly filling, as well. \n\nThe Tesla solar/battery/car full home integration idea is all but dead, and that was the grand vision to really lock people into the Tesla brand. Does the valuation reflect the abandonment of this strategy?\n\nThese issues reveal potential headwinds in a competitive environment. Especially with compressing margins, their ability to hit major targets on time and without wasting money has a huge impact on the bottom line.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "There's this age old saying about past performance...\n\nCompany growth is always a curve that trends to flat. Tesla's has been steep for several years, and is starting to run into the things that cause growth to slow, and they will inevitably shift strategy to revenue stability by capturing a higher market share, sacrificing margin.", "score": 0, "replies": [{"body": "Have you seen a chart of their profits or production over the years? They are still climbing ~50% yoy. \n\nThey are absolutely sacrificing margin though because they can still make billions with an 18.2% margin, while no one else is even making a profit and they know getting people into their cars makes customers for life, which is more valuable than continuing to make an outlandish margin at the cost of giving up market share. Once most ppl drive a Tesla they will never go back to a normal car. \n\n\nEven with that sacrifice in a tough macro, they are still making record profits Q after Q, no debt, $24B in cash and massive investments into growth, other makes are literally losing money just trying to making EVs in general.", "score": 0, "replies": [{"body": "What is your point here? The growth curve always flattens. I don't know *when* it's going to happen for Tesla, but factors like reduced margins and increased competition are part of that process, and their valuation will suffer if they continue to miss financial and production targets.\n\nTesla has had a great run, and may well continue to do great for a while, but they are not a start up anymore, and investors need to consider potential red flags of slowing growth.", "score": 1, "replies": [{"body": "They don’t have slowed growth though. Quite the opposite. Legacy has a massive problem on their hands and it’s getting worse", "score": 1, "replies": [{"body": "Their competition are century-old companies with century-long outlooks. They care about market share, and will happily run their EV operations in the red for quite a while to undercut competitors. As great as Tesla's financials have been, you simply cannot assume that nothing will change. Growth is just one phase of a company's life.\n\nMissing major product releases is a problem. They only have 4 models, so yes, failing to release the truck on time put a huge dent in potential future earnings. \n\nThe EV market is increasingly made up of people who are purchasing for need rather than lifestyle, and Tesla is getting closer to the point where it needs to commit to either broad consumer appeal or specialization.", "score": 1, "replies": [{"body": "A truck like CT would never be released on time thru a pandemic though. People need to be realistic and even better understand that it’s not just some truck. We don’t even know the full extent of the features yet.\n\nThe CT is going to make the Lightning look comically overpriced and very lacking in range and tech. Not to mention they are barely selling any and CTs will literally explode past their numbers in no time at all even if 80% of the preorders cancelled", "score": 1, "replies": [{"body": "I mean, this sounds like pure hopium. I'm not going to try and compare speculative features, but the Lightning is for sale, and the CyberTruck is not. I'm also \\*very\\* doubtful the original $40k price point will be intact if/when it's available.\n\nThe pandemic excuses some delays, but every other car maker got their EV trucks out despite that, and without blowing their own announced deadlines. That's an unforced error, and I feel that lot of people like to overlook how significant such a gap in their product lineup is.\n\nYou have to remember, customers aren't investors. What does the company look like from the standpoint of someone who just needs a new car? What conclusions do you draw from actual side-by-side comparisons? If you were buying a new car right now, would it be a Tesla?", "score": 1, "replies": [{"body": "All decent considerations. I think you underestimate the demand for Teslas though, and how many countries as becoming Tesla hungry, and how many people are going to carry through with their CT order even if it’s $55k instead of 40. \n\nTime will tell!", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Curious on your thoughts of 480 month bonds on Meta?", "score": -11, "replies": []}]}, {"body": "Dang, people really that desperate to have a Tesla that they would pay 6-plus % interest over 7 years?\n\nTesla fanatics are really crazy. Not just Elon.", "score": 28, "replies": [{"body": "Not just Tesla, lots of people buying cars are trying longer leases to reduce their monthly payment on premium cars\n\nI don’t think it’s the best idea with current interest rates….", "score": 9, "replies": []}, {"body": "Why are people in this sub acting like 84 month loans are something special/specific to Tesla???????????????????\n\nI took an 84 month loan on a Tahoe. Just to not be **obligated** or locked-in at the higher payment. Made financial sense at the time.\n\nAny google search of 84 month auto loans will return results on almost any random lender....\n\n[https://providentcu.org/products/auto-loans/rates](https://providentcu.org/products/auto-loans/rates)", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Fair. That last sentence might have been overboard. Just a quick response to how crazy it is seeing people get a high interest loan for so long (7 years) to buy a depreciating asset.", "score": 3, "replies": []}]}, {"body": "Yes. If you need a car and can afford payments why not get the car that will cost less- fuel, maintenance, etc... And it holds its resell value. Its the smart play- again if you are actually buying a financed car which is another conversation.", "score": -2, "replies": [{"body": "It is the smart play. Not sure why you got downvoted", "score": 2, "replies": [{"body": "Its Reddit, the IQ in general is very low. The bitch, complain, provide nothing of substance is very high.", "score": 1, "replies": [{"body": "Really does feel like the worst complainers some times", "score": 2, "replies": [{"body": "A few years ago you could have a conversation. Now its seems like its just \"I'm right because of this statement!\" Then I go. Ok, please help me understand your point.\n\nDownvoted like crazy and maybe throw in an insult or 2. haha", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Jokes on them\n\nWhen the car goes FSD I'm going to pay it off by having my car work as an Uber driver for 24 hours a day", "score": 22, "replies": [{"body": "I really, really wonder what will happen with FSD and Uber-like services.\n\nWithout another person there you know a certain percentage of people are going to treat the cars like shit.  Make a mess, damage things.", "score": 7, "replies": [{"body": "There will be cameras in the vehicule so if you damage the car you'll be sued...", "score": 0, "replies": []}]}, {"body": "The robo taxi thing doesn’t make sense. If everyone has a robo taxi, no one has a robo taxi. It will make money for the first people to do it, but eventually fares will cost nothing because your own car will do it.", "score": 14, "replies": [{"body": "Yes. I was being sarcastic.\n\nOnce FSD comes, you'll see the economics shift dramatically and you will potentially see a significant number of cars repossessed.", "score": 9, "replies": [{"body": "Or, like everything else lately, nobody will actually own one and everyone will be paying a subsription monthly to use the service.", "score": 9, "replies": [{"body": "Yup, this.", "score": 1, "replies": [{"body": "They're already slithering their way their with subscription based features.\n\nWhat a time to be alive.", "score": 3, "replies": [{"body": "Literally blame the stock market. And it’s perpetual need to beat the last Q’s numbers.", "score": 1, "replies": [{"body": "Those are rookie numbers", "score": 1, "replies": []}]}]}]}]}]}, {"body": "There will be a nash equilibrium somewhere", "score": 1, "replies": []}]}, {"body": "When the road is swamped with Tesla FSD taxis, can I just drive like an asshole and they will brake/swerve to avoid me", "score": 5, "replies": [{"body": "They will have a Road Rage mode.", "score": 2, "replies": [{"body": "Will it malfunctioning like mine?", "score": 2, "replies": []}]}]}]}, {"body": "Okay that’s the term, what’s the interest rate? And what do you mean by dominate? Are you implying that 84 month financing provides an advantage that other auto makers entering the market cannot match with their superior technology and lower prices?", "score": 8, "replies": [{"body": "6.99%", "score": 2, "replies": [{"body": "And is Tesla directly financing these loans with the 1B decrease in their cash flow from previous earnings report last week?", "score": 2, "replies": [{"body": "I’m not sure 🤔 I just saw the rate was 6.99%", "score": 1, "replies": []}]}]}]}, {"body": "Is that means less and less people can afford a Tesla and then Musk see the sales slowing down ?", "score": 8, "replies": [{"body": "And less and less people WANT a tesla.", "score": 18, "replies": [{"body": "Sales were up 36% yoy last quarter, and continue to trend up. This growth is unheard of in auto manufacturers. A day might come when demand wanes for Teslas, but we are a long way from that day.", "score": 0, "replies": [{"body": "Yeah, last year when shanghai was in lockdown. Their growth has ready been slowing (check que QoQ growth), margins shrinking, smaller backlog, 84 month credit offering, shrinking market share.", "score": -1, "replies": [{"body": "> Yeah, last year when shanghai was in lockdown. Their growth has ready been slowing (check que QoQ growth)\n\nIt's not just last quarter. [Their output is parabolic.](https://www.statista.com/statistics/502208/tesla-quarterly-vehicle-deliveries/) They're not just up YoY, they're even up QoQ. In other words, their Q1 2023, which is typically the slowest auto sales period, just beat Q4 2022, which is typically the highest volume period. Their most recent market announcement shows 466,140 deliveries; up from 422,875 in Q1. That's 9% QoQ *for an auto company.*\n\nMargins *are* down, but [they command by far the largest EV margins.](https://www.visualcapitalist.com/charted-teslas-unrivaled-profit-margins/) It's not even close. In the auto space, margins are the reason one buys Tesla. It's certainly not a black mark. Quite the opposite. You could make a case against the entire auto industry right now due to the pandemic hangover, but certainly not against Tesla specifically.\n\nAs for market share, [they continue to increase globally.](https://www.goodcarbadcar.net/tesla-us-sales-figures/) They now command 4.46% of the entire US auto market. *An EV company.* Not only is their total auto market share increasing, [but their EV market share is increasing as well.](https://www.counterpointresearch.com/global-electric-vehicle-market-share/) This despite almost every major auto manufacturer entering the market with a century of auto making experience, and the supply chains to match.\n\nSmaller backlog means lower inventory cost.\n\n84 month loans mean even more people are able to afford Teslas. How is that anything other than bullish?\n\nI'm surprised you didn't know any of this. It was a really quick google.", "score": -1, "replies": []}]}]}]}]}, {"body": "I think Tesla is already the brand with the highest rate of owner debt. People want these cars so bad they are willing to do some financially very stupid things to get one. A big part of it might be because of Elon and his often not so true statements about the cars and what to expect from them in the future. But whatever. Not my money and not my right to judge what fools are doing with their money. As long as it doesn't lead to a big financial debt crisis or whatever", "score": 10, "replies": [{"body": "Crises usually occur after you give money to someone that can't pay back. I don't see this going tits up.", "score": 2, "replies": [{"body": "They're giving brand new cars (that greatly depreciate) to people who can barly afford them and might stop paying at any time. Not purely a Tesla problem. Some Americans start financing a new car before the old one is paid off. To me that seems pretty risky, especially if used car prices will go down at some point. If that happens the automakers and banks will sit on tons of impounded cars not nearly as valuable as they thought they would be.", "score": 2, "replies": [{"body": "I need to work harder on my sarcasm.", "score": 2, "replies": []}]}]}]}, {"body": "I will buy new home when they start 100 year mortgage. Tesla will be with 30 YR fixed.", "score": 3, "replies": []}, {"body": "Welcome to the third world America", "score": 10, "replies": [{"body": "Would love for you to see a third world country", "score": 1, "replies": [{"body": "Bro I'm from Argentina. We have 12 installments with no interest IN PESOS. (100% inflation)", "score": 2, "replies": []}]}, {"body": "It is indeed. I learnt it from after I needed to experience the healthcare.", "score": 2, "replies": []}]}, {"body": "Where do I sign up?", "score": 2, "replies": []}, {"body": "Well once Elon \"owns the libs\" for good he will be king of the world!!! \n\nImagine being so stupid you alienate your entire buyer pool by buying a social media company for far more than it's worth and turning it into a Nazi hell hole. \n\nThe styling of Tesla cars is so outdated.  They are built like Stevie Wonder is the lead QA. If a new Tesla was 10k I'd pass.", "score": 2, "replies": []}, {"body": "To be more upside down on a asset thats it tanking", "score": 2, "replies": []}, {"body": "Quite a few banks offer 7 year loans on vehicles.", "score": 2, "replies": []}, {"body": "I was going to get a Tesla but waited because of the FSD issues. Glad I did. Now I wouldn't take a Tesla for free. I'd feel like a tool driving around. \n\nAnyone buying a car on a high interest 7 year loan.... nevermind. Go for it!", "score": 11, "replies": [{"body": "Why wouldn't you take a Tesla for free? My friend has one and I actually like it.  He had it for more than an year, it's simplistic, quiet, lots of power, futuristic. He never has to service it, and great for driving.  It's totally made in the USA, so lots of American jobs.", "score": 13, "replies": [{"body": "I drove one for an extended road trip and hated the software. \n\nI would take one if I could literally take out all the self driving and self Doing shit. I hate it. \n\nI don’t need a car to turn off and on headlights… \n\nI just want cruise control that ONLY controls the speed. \n\nPhantom breaking is scary as fuck on I-95", "score": 2, "replies": []}, {"body": "because he's a pawn to what others think", "score": 2, "replies": []}, {"body": "There are many reasons. In my case it's been bad QC and the FSD not only never worked, they lied about it.\n\nHere's more.\n\nhttps://www.reddit.com/r/stocks/comments/15b4qg7/source\\_tesla\\_rigged\\_the\\_dashboard\\_to\\_overstate/", "score": 1, "replies": []}]}]}, {"body": "Since plenty of people are forced to live in their cars due to abject greed, why not just go 30 year?!", "score": 4, "replies": []}, {"body": "Ahhhh, to be forever in debt for a car. I thought this only applied to student loans.", "score": 3, "replies": []}, {"body": "I had planned to buy one at some point but after the whole Twitter thing and finding out who Elon is, I don't have much confidence in him. Nor do I really want to give him my money. For now I will just buy keep using fuel efficient cars until the market changes. The competition will catch up and Tesla will just be another name in the pile eventually.", "score": 6, "replies": [{"body": "no one cares", "score": -9, "replies": [{"body": "I mean, this sentiment is not shared by only this poster… if you are a Tesla investor you should care", "score": 4, "replies": []}]}, {"body": "The competition will catch up by licensing Tesla's hardware and software.", "score": 1, "replies": [{"body": "Maybe. I doubt the entire future of electric cars is going to depend on Tesla's technology. There are plenty of smart and innovative developers out there. If so, then some people will make a lot of money. I wont be one of them.    \n\n\nWe may not even be using electric/battery operated cars in 20 years, who knows with the way technology is almost certainly going to leapfrog with quantum computers and AI advances.", "score": 1, "replies": [{"body": "I mean it's already happening with some manufacturers. Like all tech it's prone to being outdated easily. If big tech has shown us anything it's that once you're at the top it's hard for anyone to overtake you.  No doubt there will be competition, but Tesla will buy most of it up. \n\nThe source of power for these vehicles doesn't matter as much as the software that drives it. This is like saying why buy a vehicle now when in 20 years we will be able to teleport... people have been saying the leap frog thing about quantum computing for over a decade.", "score": 1, "replies": []}]}]}]}, {"body": "im never buying one until solid state batteries are the norm. and honestly you should to. when that happens you wont even be able to sell your old tesla to anyone.\n\nssb's charge 10x as fast and last 5x as long. no one will drive these in 5 years.", "score": 5, "replies": [{"body": "> ssb's charge 10x as fast and last 5x as long. no one will drive these in 5 years.\n\nYou missed a “can charge”. EV are currently charging at arounf 500A, 10x current means 100x more heat and losses. Not saying it’s impossible but you won’t see it for commercial/public at least for a while.\n\nWhy you want 5x long? Even on ICEs who keeps cara for more than 15-20 years? EV currently hold well for 10 years (unless you do crazy anual mileage)", "score": 2, "replies": []}]}, {"body": "Loooool. What’s next? Everyone on TANF gets a Tesla? Looks like Musket relied too much on increased consumer demand and is getting stiffer competition than expected.", "score": 2, "replies": []}, {"body": "[removed]", "score": 4, "replies": [{"body": "What does that have to do with the stock?", "score": 0, "replies": [{"body": "Displays it might be unsustainable. \n\nBefore EV’s were a new investor plaything, vehicles manufacturers have long been understood to be a heavily cyclical industry. \n\nThis could be signalling that a down cycle is about to begin as Tesla has been dropping prices rapidly and increasing loan lengths to keep their sales numbers propped up. So, was this to plan to undercut competitors, or is this in reaction to dropping sales and they are about to enter a period of overproduction (and rapid margin loss)", "score": -1, "replies": []}]}]}, {"body": "Can we talk about how the license plate is wrapped over in this picture?", "score": 2, "replies": [{"body": "There is no license plate…just the holder. Why would a brand new, wrapped car at a Tesla dealership have a plate on it?", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Yea but isn’t that the point? It’s not meant to stay it’s just protection until someone buys the car or whatever", "score": 2, "replies": []}]}]}]}, {"body": "Keep seeing the same face for years boredom \n\nSucking longer with 84 month stuck with it.", "score": 1, "replies": []}, {"body": "Ugh. I hate what America is becoming. The land of own nothing.", "score": 1, "replies": []}, {"body": "Thats practically taking out a mortgage", "score": 1, "replies": []}, {"body": "Next question:\n\nWould you buy a house or a tesla which batterie you can dump in 10-15 years?", "score": -1, "replies": []}, {"body": "Why not offer longer loans at increased rates to maintain payments and profitability prior to cutting pricing again?\n\nThey cut pricing to maintain market share and force losses on late entry as they have built up a huge first mover advantage, an advantage that won't last forever.\n\nDid you all get caught in shorts during the Tesla squeezes or something?", "score": 1, "replies": [{"body": "They cut prices because they see a recession coming. The goal is to to milk out as much as possible before the recession is officially announced. \n\nIf you read 'recession started' in the newspaper you don't buy a car and pospone large investments because of 'fear' and uncertainty.", "score": 1, "replies": [{"body": "There is no recession coming", "score": 1, "replies": []}, {"body": "It's literally interest rates have made the average monthly payment more, so a longer term returns the monthly payment back to what a low interest rate would have been, albeit for more months...", "score": 1, "replies": []}]}]}, {"body": "This is not their plan to make up for the margin. It’ll sell more cars and make more money though. Their plan is upgrade their factories to make more for less costs, bolster training to license AI software and continue building the energy business which has seen its margin increase greatly. They are just going to stay the course", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "I don’t give a shit about Elon. I’m a supply chain director and just leveraging my profession \n\nRonald McDonald could be running Tesla and I’d still be investing accordingly to the plan they are laying out. Tesla will be a 2T dollar company in not very long. I’m so glad people outside of supply chain can’t see it.", "score": 0, "replies": [{"body": "Yet you call him \"elon\" like he's your childhood buddy.", "score": 0, "replies": [{"body": "Who hurt you? \n\nGo get outside and enjoy some fresh air. Life ain’t so bad", "score": 0, "replies": []}]}]}]}]}, {"body": "The average intelligence level of a user in this subreddit hovers around the 7th grade.", "score": 0, "replies": [{"body": "I'm hardly not illiterate.", "score": 1, "replies": []}]}, {"body": "So what’s my monthly payment here?", "score": 1, "replies": []}, {"body": "i would say im surprised but i read somewhere that 10 year car loans have already been happening for a few years.", "score": 1, "replies": []}, {"body": "In my country 9 year loan is the norm", "score": 1, "replies": []}, {"body": "a WHAT!?", "score": 1, "replies": []}, {"body": "No", "score": 1, "replies": []}, {"body": "Like housing, 25 year mortgages are a normal thing now…. Not good", "score": 1, "replies": []}, {"body": "I'm sure you'd need some damn good credit to get that loan, but if they pull this off well I'll be even more happy I bought some shares while they were \"on sale\" XD", "score": 1, "replies": []}, {"body": "Hilarious.  They should offer 30 years if they believed they are so reliable.", "score": 1, "replies": []}, {"body": "Why is no one talking about the fucked up wrap on  the car", "score": 1, "replies": []}, {"body": "Leasing with more steps.", "score": 1, "replies": []}, {"body": "30 year fixed rate sounds good to me.", "score": 1, "replies": []}, {"body": "People are dumb", "score": 1, "replies": []}, {"body": "Meanwhile, here I am struggling to maintain with my fully paid off 2014 Camry LE. I'll just admire from a distance. See one of these beauties on the road and be like: nice Car..... \n\npayments.\n\n&#x200B;\n\nAs I slowly cruise into the sunset. Slow, cus, Camry.", "score": 1, "replies": []}, {"body": "84 months!?!?", "score": 1, "replies": []}, {"body": "Lolol so you’ll be half way through loan by time you gotta take another loan to replace batteries?", "score": 1, "replies": []}, {"body": "I hope Tesla doesn't hold the notes on these 84 month loans", "score": 1, "replies": []}, {"body": "It’s advantageous to be a bank that’s why", "score": 1, "replies": []}, {"body": "Not sure what life expectancy on EVs are but I’ve seen post with teslas at 500k miles which could mean a 10year loan might be worth it to some especially with a warranty to match I don’t see why not?", "score": 1, "replies": []}, {"body": "30 yr next", "score": 1, "replies": []}, {"body": "This is good for banks. I don't think Tesla finances in house .", "score": 1, "replies": []}, {"body": "I would buy a Lambo if I can get a 30 year car loan", "score": 1, "replies": []}]}
{"title": "Tesla Starts Offering 84-Month Loans as Interest Rates Rise", "selftext": "Tesla Inc. has started offering consumers 84-month auto loans after Elon Musk said the carmaker would “have to do something” about rising interest rates. The company now includes seven-year loans as an option on its US order pages, after previously offering loans as long as 72 months. While extending loan terms can lower car buyers’ monthly payments, consumers tend to pay more in interest and face greater risk of owing more than their vehicle is worth.\n\nTesla’s chief executive officer has been a frequent critic of the Federal Reserve. Musk tweeted in November that the central bank’s rate increases were “massively amplifying the probability of a severe recession.” His predictions of impending deflation haven’t yet panned out.“When interest rates rise dramatically, we actually have to reduce the price of the car, because the interest payments increase the price of the car,” Musk said during Tesla’s July 19 earnings call. “So we have to do something about that.”\n\nWhile 84-month auto loans have been gaining in popularity, the trend slowed early this year, according to credit-reporting company Experian. Roughly 34% of new vehicles loans in the first quarter were longer than six years, down from about 38% a year ago. Tesla delivered a record 466,140 vehicles during the three months that ended in June but has sold fewer cars than it’s produced each of the last five quarters. The shares plunged after Musk said on this week’s call that the company will have to keep lowering prices if interest rates continue to rise.\n\nhttps://www.bloomberg.com/news/articles/2023-07-22/tesla-starts-offering-84-month-loans-as-interest-rates-rise?srnd=premium#xj4y7vzkg", "id": "1575prt", "created_utc": 1690089204.0, "score": 296, "upvote_ratio": 0.9, "num_comments": 293, "comments": [{"body": "100 year home loans incoming.", "score": 537, "replies": [{"body": "I know you are joking but 40 yr loan is not out of the question within the next few years if rates keep climbing.", "score": 178, "replies": [{"body": "40 yr loan will jack up housing prices making them accessible primarily through inheritance", "score": 127, "replies": [{"body": "Read somewhere that properties in Asia were setup that way.", "score": 33, "replies": [{"body": "For example in lebanon, there is no longer a mortgaging process for home purchases. They have to bought in full cash, for stupid prices that the working class could never afford. So people just wait for inherited land or buildings", "score": 25, "replies": [{"body": "And look how well Lebanon is working /s", "score": 19, "replies": []}, {"body": "sharia economics not working well, what a surprise.", "score": 0, "replies": [{"body": "North American economics not working well, shut up.", "score": -8, "replies": []}, {"body": "It has nothing with any of that and everything to do with the Lebanese economy and the banking sector imploding.", "score": 0, "replies": []}]}]}]}, {"body": "Classic Reddit reductionist argument \n\nIt’s not that simple", "score": 10, "replies": []}, {"body": "Classic r/latestagecapitalism", "score": 28, "replies": [{"body": "Like the monopoly board is full, and if you didn't claim your land...  You just keep paying out lol.  When you pass go to 200 bucks you almost start to question 'why am I doing this? '", "score": 31, "replies": [{"body": "There is tons of cheap land in the US though. People just want to live in a small fraction of it.", "score": 16, "replies": [{"body": "This is why remote work will win. We have to spread out.", "score": 8, "replies": []}, {"body": "like 60% of it", "score": 1, "replies": []}]}, {"body": "Fuck, that's a depressingly accurate analogy.", "score": 1, "replies": []}]}, {"body": "Get that poor people sub outta /r/stocks", "score": -11, "replies": [{"body": "This place has so much anti-capitalist garbage lately. Reddit is fucking exhausting.", "score": 5, "replies": [{"body": "Good, more money for us", "score": 4, "replies": []}, {"body": "The brigading increases as election years draw near makes this reddit suck.", "score": 3, "replies": []}]}]}]}, {"body": "Whats the difference compared to today 🤷‍♂️", "score": 1, "replies": []}, {"body": "Everyone in Portugal, literally everyone (99%) that buys an house/apartment use 40 yr loans.\n\nAnd it has been like that for the last 2/3 decades", "score": 1, "replies": []}]}, {"body": "According to the National Association of Realtors, the average age of a first-time home buyer in the U.S. is now 36 years old.  So for that reason, I feel like 40 year loans are less likely, simply because people won't be working long enough to pay it off, or at least not in large enough numbers to make a popular option.  It seems like it would also be an increased risk for banks, which would increase the interest rate they might offer for it.\n\nBut it will be interesting to see if it ends up becoming a reality anyway.", "score": 30, "replies": [{"body": "In Japan they solved that by introducing multi generational mortgages. \n\nGee, thanks grandma. .", "score": 45, "replies": [{"body": "ya but the house grandma bought for 100k is probably worth 1-2 million since no inventory.  If you sell, sure you get money but where do you go?", "score": 10, "replies": [{"body": "Weird thing is, they usually build houses for 20 years use, knock em down and build again. Its the land that's more important.", "score": 18, "replies": [{"body": "With how earthquake prone their country is, it makes sense.", "score": 1, "replies": []}]}]}]}, {"body": "You're not the one who's meant to pay it off. It's actually your third or fourth generation.", "score": 51, "replies": [{"body": "Dystopia planner, now there's the civil servant job of the future.  We may be descending to hell, but that's no excuse for not putting in hand rails.", "score": 15, "replies": []}, {"body": "I wonder what the rate of buy-once homeowners there are. Like, are people not buying in on what they can afford, making improvements, accruing some equity, selling and upgrading? \n\nI’m almost 40 and only know one person whose first house is the house they plan to live and die in. Even then, it’s the second house her husband owned.", "score": 4, "replies": [{"body": "That's not possible anymore in a lot of places. I bought a house in 2020 and my house has gone up significantly since then, but guess what, so has every other house. So if I sell my house now, I'll just be putting all of that equity into an over priced house that will end up being roughly the same as the one I have now with an interest rate that is double what I locked in (3%) during the covid years. I'm never selling this house, if financially burdened I'll just rent it out and move somewhere else.", "score": 2, "replies": [{"body": "Hey, that’s awesome! \n\nIt’s nothing against anyone that does buy and plan on staying in the first home they ever buy, I’m just curious what the percentage of people is that do that.", "score": 2, "replies": [{"body": "That's fair. You made me curious so I did some googling and found this.\n\nhttps://www.thezebra.com/resources/home/average-length-of-homeownership", "score": 2, "replies": [{"body": ">California homeowners stay in their homes the longest.\n\nTo your point. I guess it really would depend on the market and desirability of an area.", "score": 1, "replies": []}]}]}]}, {"body": "If you have to get a loan, you can't afford it.", "score": 1, "replies": []}]}, {"body": "Well shit, so much for me not having kids then.", "score": 0, "replies": []}]}, {"body": "It may be that you never buy it. Instead at retirement you simply move into a reverse mortgage and get some of your principal value back. Then your heirs get what’s left, if anything, then they themselves get a loan to buy out the remaining debt. If nothing is left then the bank simply takes all of it and sells it to someone else. \n\nThis all works in the banks favor because it gets 30 plus years of interest and then a house at presumably a good price during reverse mortgage negotiations and whatever profits from the sale and potentially interest again if the new buyer uses them for the loan.", "score": 10, "replies": []}, {"body": "Most people buying their first home have no intention of paying off a home loan. It’s just get the payments to what you can afford. Live in it for 5-7 years and sell making enough on the raise in home value for the down payment on a bigger home.  Over 30 years you build some wealth.  How it’s been for decades. \n\nThose that buy during a bubble get screwed and have to live there for 10-15 years to break even, but this works for most people. Even then it’s still usually better than renting because you lock in a monthly payment for the long term and a small percentage of it goes to principal.", "score": 8, "replies": [{"body": "Yep, don’t worry about trying to time the market or avoid bubbles. If you have the means to enter the market, enter the freaking market! Had some friends that missed out on a bunch of gains because they were “waiting for the market to cool” lol", "score": 3, "replies": []}]}, {"body": "lol you don’t have to pay it off, they probably prefer you don’t, the NAR just wants the transaction fees $$$.", "score": 4, "replies": []}, {"body": "Eh... If you get a loan at 36 and retire at typical retirement age after 30 more years of inflation, your monthly payment will be a joke anyway.", "score": 10, "replies": []}, {"body": "Let’s say you pay 30 years of the 40 because you die, the bank has collected nearly all of the interest in the first 30 years and will get paid out the outstanding principle at that point so they’re cool with that.", "score": 3, "replies": []}, {"body": "Your children will pay it off. And by that point houses will be so expensive that it might take more than two generations to.", "score": 3, "replies": []}, {"body": "Eh, don't worry, with the rise in value of your home you will be able to pawn it off in 25 years to some nice family that takes out a 50 year loan on it. What could possibly go wrong? Everyone's a winner!", "score": 1, "replies": []}, {"body": "> simply because people won't be working long enough to pay it off\n\nThat doesn't matter to the bank. Even with a 30 year mortgage, they expect you to sell the house long before 30 years.", "score": 1, "replies": []}]}, {"body": "Japan has 35 year loans. If the government wills it, it can happen. The unaffordability crisis is getting worse. If it does not get better, the voters are going to want change.", "score": 13, "replies": [{"body": "After a certain point, you’re basically renting the house.", "score": 11, "replies": [{"body": "As it should be. In Japan, housing is essentially disposable after one’s lifetime. Interest rates are also extremely low and essentially no real interest. A house is not worth anything and only the land retains value. Other countries where housing is treated like consumption rather than an investment tends to have a stronger middle class.", "score": 9, "replies": [{"body": "That sounds nice actually", "score": 3, "replies": [{"body": "The houses aren’t like the US. They’re not 2500+ sq ft and made of brick.", "score": 9, "replies": [{"body": "Aren't they both made of wood?", "score": 4, "replies": [{"body": "Many are made of wood, and many are made of concrete. They are also engineered to be disposable after 30-50 years. They have earthquakes often and the building techniques/technology is always improving. So, old homes are not desirable and when an old home becomes available, it is often torn down and a new one built. They also have a highly efficient and skilled workforce with local governments highly in favor of rebuilding and development. Their spaces are small but at the middle class range of let’s say rent from $2000-$3500 a month in a HCOL US city, you can get a much nicer apartment in Tokyo.", "score": 2, "replies": []}]}]}]}]}, {"body": "Honestly with fixed rate mortgages, that may still be a win...  The cost per month between buying and renting tends to cross over around year 15 of a 30 year loan.  So on the back half, you're paying less than rent would be.", "score": 1, "replies": []}]}]}, {"body": "Last year a company announced a 40 year mortgage that has interest only payments for 10 years then converts to a 30 year pay down.\n\nhttps://www.newrez.com/press-news/newrez-gives-buyers-more-purchasing-power-with-launch-of-40-year-fixed-rate-interest-only-non-qm-option/", "score": 6, "replies": []}, {"body": "UK already has these.", "score": 2, "replies": []}, {"body": "I think Canada already has these.", "score": 2, "replies": []}, {"body": "What do you mean “not out of the question?”. They already exist, the FHA already approved them and some banks are allowing you to modify a loan to 40 year now (chase for instance).", "score": 1, "replies": []}, {"body": "FHA already approved 40 yr fixed rate. If they haven't rolled out yet it it's just around the corner.\n\nEdit: So I didn't fully understand the program. They have approved 40 year loan modifications for struggling borrowers. So it's a tool to lower payments for those struggling to make their payments on an existing FHA loan:\n\nhttps://www.hud.gov/press/press_releases_media_advisories/hud_no_22_070", "score": 1, "replies": []}, {"body": "Boat loans are typically up to 20 years...", "score": 1, "replies": [{"body": "Idk what that has to do with mortgagees, but okay.", "score": 7, "replies": [{"body": "House boat duh", "score": 18, "replies": []}]}]}, {"body": "My mortgage is 40 years…  it’s a thing for young home owners", "score": 1, "replies": []}, {"body": "I don't think so.  The rates are still very low.  People just got used to cheap money and businesses got used to having great profit margins.  Big corporations love super low interest because they made out like bandits and could buy back stock like crazy.\n\nWhen I was a kid in the 80s the interest rate was much higher. Up to 20% at one point.  Average of around 12% I think.  You actually made good money with a saving account.  My parents got the the loan for building their house during that time, as did millions of other Americans.  The real problem with housing is going to be private equity firms buying up everything.  If they own large swatches of places they can control prices.  Its pretty bad. I own a couple rental houses and get letters every week from big firms that want to buy them so they can rent them.   The ultra rich are getting richer, that is for sure. \n\nNow I'm not for high interest rates.  I think the fed is being stupid. They say that unemployment is way too low and that millions of people need to lose their jobs.  I don't see that as a good thing.  But what Elon says really rubs me the wrong way.  He is pretty much saying that \"we were able to make lots of extra profit by charging extra when interest rates were so low. Now that they are going back to normal we are going to have to think of a new way to make money from them\"", "score": 1, "replies": []}, {"body": "Already here in the UK", "score": 1, "replies": []}, {"body": "Already happened", "score": 1, "replies": []}, {"body": "Its not just the rates. Its the damn principal cost of a home. My dad bought his first home in LA at like 11% interest but the principal cost of the home was under $13,000.\n\nWe live in a complete corporate captured world now. Housing prices have not fallen even though rates are double or more from their low. This can only be explained by a huge lack of supply.", "score": 1, "replies": []}]}, {"body": "Sweden already has 60yo loans🙃🙃", "score": 15, "replies": [{"body": "What, where? As a swede our mortages have a 30 year plan but you only get to loxk interest for (usually) - 5 years, 10 years is unheard of.\n\n\n\nSo no, qe are very jealous of americans who cab lock in 1% rates for 30 years while we get (st best), 1,5% for 3 years or 2, 5 for 5 years (befor the rate hikes)", "score": 1, "replies": [{"body": "A friend of mine in Stockholm has a 50yo mortgage. Most of my friends in Finland had negative interest rate on their mortgages for the last 10-15 years due to QE and euribor being at -0,5 for long periods.", "score": 1, "replies": []}]}]}, {"body": "Multigenerational loans are coming, mom and dad sign papers, and the kids pay it off.", "score": 4, "replies": [{"body": "They kind of always have been here... Upon death of parents, you may take over the payments or you may sell the house, pay off the balance, and pocket the rest.  Both happen all the time.", "score": 10, "replies": []}]}, {"body": "500 year is where its at, lock your future generations into an appreciating asset.", "score": 3, "replies": []}, {"body": "ahhh...the legacy mortgage", "score": 3, "replies": []}, {"body": "There's little practical difference between a 40 year loan and an interest only loan at these rates.", "score": 2, "replies": []}, {"body": "Would this be bullish for banks?  In effect, they would basically be leasing it to the \"owners\".", "score": 1, "replies": []}, {"body": "Welcome to Sweden?", "score": 1, "replies": []}]}, {"body": "Soon we're going to reach 25yr mortgages just to own a vehicle...", "score": 122, "replies": [{"body": "There's a serious case of diminishing returns there... You can slim down the amount of principle per payment to something approaching zero, but the interest portion of the payment is still there.  \n\nThat's also why dropping a few grand extra money on a 30 year mortgage can sometimes lop years off the length of the loan, especially when rates are higher.", "score": 27, "replies": [{"body": "True.  I bought my first house at 30 year 3% during covid. So payments are okay ish due to the low, but price is obviously high.\n\nI looked into putting some extra cash toward it but it's' basically pointless with the low rate.", "score": 6, "replies": [{"body": "Save up that extra cash anyhow and throw it at the market.  Over 30 years, it's almost certainly going to beat the pants off any interest savings you'd get from paying down the home loan.\n\nI started out throwing some money at my mortgage... like when I refi'd, I somehow ended up with a couple grand extra, so I just gave it back, and rounded some payments up to the next hundred dollars, etc.  I knocked about 2 years off the end of the loan, but that was stupid in hindsight.\n\nStill, sometimes I think if I paid a bit more extra, the end of the loan would drop to where it was before the refi.  I know it's dumb but for some reason, it's so attractive...", "score": 8, "replies": [{"body": "Over 5% in treasuries. No one knows for sure what the market will do, but free money risk free is hard to turn down.", "score": 11, "replies": [{"body": "That's fine too!  I don't know that they'll continue paying more than the loan, but make hay while the sun shines I guess.  :-)", "score": 1, "replies": [{"body": "Yeah, eventually the yield curve will un-invert and we will have to go longer on the curve to get any worthwhile return. Now is a special opportunity that doesn't come around too often.", "score": 1, "replies": []}]}]}, {"body": "This is interesting because I remember a podcast saying that a home with 10 years left on the mortgage isn't an asset; it's a liability until it's paid off. The argument being that anything can happen in 10 years and if you don't account for a backup plan to continue to make payments, then you're still beholden to the bank in a financial emergency. \n\nThat being said, in an idealized world where you never have such an emergency, then sure it may seem suboptimal, but because the real world is constantly changing and variables ever-shifting, there's a trade-off of peace of mind when your home is truly *yours*.", "score": 1, "replies": [{"body": "All I was looking at was rent prices vs mortgage payments.  To start, rent tends to run quite a bit cheaper, especially when accounting for home insurance, property taxes, maintenance, etc.  Especially if you didn't do a 20% down payment.  But over time, rent payments increase and the mortgage stays flat, so 15 years in, you're paying more for rent than a mortgage (plus property taxes, home insurance, maintenance, etc).\n\nI think the rough number I got was renting for 30 years lets you accumulate about 1.7x the future home price, assuming you had 20% down, and you actually saved and invested the difference each month for the first 15 years, then paid the difference out of that fund for the remaining 15 years.", "score": 1, "replies": []}]}]}]}, {"body": "Right. Even something like paying an extra $100 of principle per month on your mortgage will decrease the loan period by a few years and tens of thousands of dollars in interest, depending on loan amount and rates. \n\nTo give an idea, using my numbers, an extra $100 a month would save me about 5 years of payments and $32,000 *in interest*. (Googling a loan amortization calculator will give you these figures for your own situation.) That's a huge amount. But only because the loan term is so dang long.", "score": 1, "replies": [{"body": "Now do $100/mo into investments for 30 years ;-)", "score": 1, "replies": [{"body": "Right? No kidding, that's a lot of money at the end.\n\nBut people here are talking about mortgage rates at about 6.5%. The overall market returns have an average real return of about 7% in the long run. That half a percent difference over 30 years, at a rate of $100/month, is about $2,800 by the end.\n\nPersonal finance is personal, but at that point, I wonder which is better- earning an extra $2,800 over 30 years or being mortgage free 5 years sooner? On top of that, reallocate all that mortgage money for those 5 years into a brokerage account, and there's a much higher return (-;", "score": 1, "replies": [{"body": "> The overall market returns have an average real return of about 7% in the long run. \n\nReal return is the wrong metric -- You don't adjust your interest rate down for inflation, so you shouldn't be adjusting your returns down for inflation either.  So nominal returns, somewhere just north of 10%.  Or alternatively, adjust both numbers and your real interest rate ends up more like 3% interest rate vs 7% real market returns.\n\n> earning an extra $2,800 over 30 years or being mortgage free 5 years sooner? On top of that, reallocate all that mortgage money for those 5 years into a brokerage account, and there's a much higher return\n\n$100/mo for 30 years, even at 0.5% interest, would be over $100,000, not $2,800. So your take is still a little off.\n\nLet's run the numbers!\n\n$100/mo for 25 years at 10% nominal annualized return -- about $124,000.  Now we'd owe a bit less than $20k in capital gains if we liquidated, but that still leaves us north of $100,000 in cash-money we could use to pay off the mortgage in one lump sum.... and we'd have money left over.\n\nIt'll come out even better if you just stop paying the mortgage from income and start slowly liquidating that invested money to cover the mortgage for the next 5 years, because the majority of the money would still be sitting there making more than the interest.  \n\nSo *with the assumption that nominal returns on the stock market stay around 10% a year*, investing it is still a huge,  huge winner over paying it off early.  It's a bit of a scary assumption to make, but then again, the assumption that you can never refi to lower the interest rate over the next 3 decades is also scary.", "score": 1, "replies": [{"body": ">Real return is the wrong metric -- You don't adjust your interest rate down for inflation, so you shouldn't be adjusting your returns down for inflation either.\n\nGood point. Since we're not buying anything new, just paying toward an old purchase, inflation doesn't need to be considered. Good good point.\n\nIn that case, a 10% market return beats a 6.5% pay-off return, for sure.\n\n>It's a bit of a scary assumption to make, but then again, the assumption that you can never refi to lower the interest rate over the next 3 decades is also scary.\n\nDefinitely. But that 6.5% rate we've been using is kind of low, considering. [Mortgage rates over the decades:](https://time.com/personal-finance/article/historical-mortgage-rates/#:~:text=The%20highest%20mortgage%20rates%20in%20history%20were%20in%20the%201980s,inflation%20following%20the%20OPEC%20embargo.)\n\n- The 1970s saw rates between 7.5 and 12% for the decade.\n\n- The 1980s saw rates ranging between 12.8 toward the beginning of the decade to 10% toward the end, reaching 18 and 19% at one point (Yikes!).\n\n-The 1990s saw rates drop from 10% to 8%.\n\n- The 2000s - 2020s saw rates drop to 5%, then 4%, 3%, some people saw 2.6 or so, and now it's back up to 6.5%\n\nAnyway, as market returns and mortgage rates approach each other, I think there's a point where less/no debt might beat a technically slightly better market return.\n\n$100/mo for 30 years at 0.5% is $38,800 in the account. But $36,000 of that was paid in ($100 x 12 months x 30 years), leaving *a profit* of $2,800. [Compound interest calculator.](https://www.investor.gov/financial-tools-calculators/calculators/compound-interest-calculator)(Whole numbers on the interest in the calculator. 1 = 1%)\n\nThat half a percent is technically better if the goal is to earn more money, you're right. But my argument is that peace of mind might be worth the opportunity cost there.", "score": 1, "replies": [{"body": ">I think there's a point where less/no debt might beat a technically slightly better market return.\n\nYeah... ignoring CG tax and mortgage interest deductions, it's when the interest rate and the rate of return are equal.  But since you're shouldering some risk with investments, I think the return would have to be a bit higher to compensate.  But over mortgage timespans, I don't think the risk is that huge -- probably less than the risk of your house devaluing because your neighborhood became a ghetto or your town started shrinking.\n\nAnd I agree -- paying down your mortgage is generally a conservative move, but conservative moves aren't the same as bad moves, particularly if you're at or approaching retirement.  Though right now if you've got a sub-3% mortgage and you can get safe returns around 5%, it's just a straight-up bad move. :-)", "score": 1, "replies": [{"body": "Yeah, I agree. With the timespan we're looking at, there's less risk of anything deviating too far from the mean and remaining uncorrected. And also enough time for a 2+% positive difference in return rates to absolutely be worth it.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "A tesla? He'll no lol", "score": 3, "replies": []}, {"body": "Clearly the sarcasm went over your head.", "score": 1, "replies": []}]}, {"body": "Got news for you bud that 30 year home loan is all the rage right now", "score": 1, "replies": [{"body": "Is this not normal? I'm from the Netherlands and a mortgage is *normally* 10, 20 or 30 years here.\n\nNormally you pay of your house in 30 years. So even if you take a mortgage for 10 years (which usually is a loooot cheaper because of lower interest rates) you still have 20 years to go, so you renew your mortgage. If that makes sense...", "score": 6, "replies": [{"body": "30 years is almost more than the norm here, he just mentioned 25 and I’m like what rock you been living under my guy 😂\n\nHell we starting to get more and more 40 year loans as well.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "You get to choose. So if you buy a house for 30k (*very* unlikely, lol) you can get a mortgage for 1-30 years. The shorter the mortgage, the lower your interest rate but you will always pay off the house in 30 years as that is what the banks here demand. So you will need to renew you mortgage every few years at whatever the interest at that time may be.\n\nThe downside for such a short mortgage is that you really don't know what the interest rate might be in a few years. So most people play is safe and go for a 20+ year mortgage at a reasonable interest rate.", "score": 1, "replies": []}]}]}]}, {"body": "I went to look at boats the other day and they are doing 20 year financing at 6.99%", "score": 1, "replies": [{"body": "No choice when a fucking fishing boat can cost over 100k.", "score": 1, "replies": []}]}]}, {"body": "If you need 84 months to pay off our car, you can't afford that car.", "score": 156, "replies": [{"body": "If they wanted to offer me super low rates on an 84 month loan, I'd happily take it even if I have the ability to buy the car with cash.\n\nWith current rates?  Yeah, no thank you.", "score": 67, "replies": [{"body": "Hopefully ZIRP never returns", "score": 12, "replies": [{"body": "It probably will.  But regardless, car dealerships used to offer low rate financing sometimes to try and boost sales.", "score": 7, "replies": [{"body": "Yeah I used to work in auto finance \n\nIt’s usually foreboding. \n\nI like old cars paid in cash.", "score": 1, "replies": []}]}, {"body": "What is ZIRP?", "score": 3, "replies": [{"body": "Zero Interest Rate Policy \n\nEra of free money", "score": 2, "replies": []}]}]}, {"body": "Exactly. My 800++ credit scores allows me to get sweetheart rates which I happily take when buying my cars.", "score": 1, "replies": []}, {"body": "Yeah, the guy you responded to thinks he knows how money works but doesn’t lol", "score": 1, "replies": [{"body": "I think the emphasis in the first comment was on the word \"need.\" If you can pay a car off in cash, you don't *need* an 84-month loan. There is a big difference between exercising a long-term, low-interest loan because it makes financial sense and relying on a long-term loan to qualify for a purchase.", "score": 1, "replies": [{"body": "Sure", "score": 0, "replies": []}]}]}, {"body": "Oh they will give you super low rates and overcharge you on the principal and fees.\n\nThe 0% financing trap is very popular.", "score": 1, "replies": [{"body": "I know how much the car should cost.  \n\nWhat I think happens more often is they say something like \"for qualified applicants\" and they make sure most applications don't qualify for it.", "score": 1, "replies": []}]}]}, {"body": "Banks knew people couldn't afford their cars when they were offering credit balances higher than the car's sticker price. Now they're starting to limit credit to people who might possibly be able to make the first 3 payments. RIP Nissan sales", "score": 5, "replies": [{"body": "Trucks have been sitting on lots for awhile now. Greedy dealers marked up those stickers in the shortages of 2021-22. Now they are paying 11% to Ford for holding them. \n\n#FUCK CAR DEALERS.", "score": 9, "replies": []}]}, {"body": "Not necessarily true. People take 30 year loans for a house- does that mean they can’t afford a house because they don’t have the cash on hand?", "score": 1, "replies": [{"body": "House is an appreciating asset though, cars aren’t", "score": 4, "replies": []}, {"body": "60% of people own a home though.  So many more people can afford a car than a house. \n\nI paid cash for my cars and house.", "score": 0, "replies": []}]}, {"body": "Normally that's true, but if it allows you to buy a car that's much cheaper to own like an EV while you let inflation eat away at your debt, it makes a lot of financial sense.", "score": -6, "replies": [{"body": "Cars are a depreciating asset though. It's not an investment. Taking on debt for a depreciating asset is a great way to stay poor.", "score": 2, "replies": [{"body": "That's an oversimplification. Most people need a car, so if you can take on debt to buy a car that's cheaper in the long term when you include interest, that's a great financial decision.", "score": 2, "replies": []}]}]}, {"body": "Elon will find a way to rip people off", "score": -5, "replies": []}]}, {"body": "Imagine taking out a 7-year loan on a car model that’s already six to eight years old…yikes", "score": 151, "replies": [{"body": "I mean you’re forgetting the crucial bit.\n\nIT’S AN EV!!! The batteries aren’t going to last forever and degrade every year. Tesla only issues 8 year warranties on its batteries anyway, so a 7 year payment plan will mean your car will likely be worthless when you sell it.", "score": 68, "replies": [{"body": "Battery tech is also still rapidly developing for function, capacity, quickness of charge, along with charging stations developing. It'll be worthless because of the battery degrading AND the developments in the meantime. It's like selling an 8 year old desktop", "score": 32, "replies": [{"body": "But my eMachine says it’ll never be obsolete!", "score": 16, "replies": [{"body": "If you go at it like the Ship of Theseus, they might have a point... :-D", "score": 8, "replies": []}, {"body": "533 MHz celeron boiiii", "score": 6, "replies": []}, {"body": "1gb hd?\n\nNo way I’ll EVER fill that up!\n\nCDRs are like freaking 650mb!", "score": 3, "replies": []}, {"body": "Whoa. Blast from the past.", "score": 1, "replies": []}]}, {"body": "Oh yea. That’s a really great point.\n\nThe new tech would probably push the price down further than the battery degradation issues.", "score": 3, "replies": []}]}, {"body": "Why are you assuming people will sell it as soon as the warranty is up? \n\nWouldn’t this criticism be true for all EVs and has nothing to do with the financing terms?", "score": 15, "replies": [{"body": "Lithium degrades from use and are very expensive. So yes? Owning an ev  out of battery warranty, particularly when you still owe, is an issue. \n\nTesla batteries are big and increasingly unable to be repaired. Perhaps a tesla fan can opine on the structural batteries can even be replaced. \n\nBeing faced was a 15-20k repair on a 7 year old car is a big issue.  Or worse, a 6 year old car that already hit its mileage, but you still owe 8k.", "score": 3, "replies": [{"body": "Thank god my gas car doesn't degrade with use", "score": 13, "replies": [{"body": "You don’t go from 300 miles on a tank of gas to 240 miles over 6 years. And given the amount of time it takes to recharge and the distance between chargers, it’s quite a bit issue.", "score": 1, "replies": []}]}, {"body": "> Lithium degrades from use and are very expensive. \n\nOn the flip side, with the battery prices going down fast, in 5 years you may be able to buy the very same battery for 1/2 the price. Given that there are fewer things to go wrong with an EV, I can see some people extending their life more than they would if they had an ICE.", "score": 2, "replies": []}, {"body": "[deleted]", "score": -4, "replies": [{"body": "In storage. If you leave it in ideal Fondation and do nothing it'll maybe last for 10 years if you never drive it", "score": 1, "replies": [{"body": "Model S came out 10 years ago and I still see plenty of them on the roads. Poor argument", "score": 0, "replies": []}]}]}, {"body": "But but but they are so cool!!! /s", "score": 0, "replies": []}]}]}, {"body": "The batteries don't degrade to zero, a 10+ year Tesla is still drivable, although yes the resale value is very low.", "score": 19, "replies": [{"body": "What 10 year old vehicle doesn't have very low resale value compared to it's original sticker price? If a 10 year old vehicle is retaining a lot of it's resale value than that probably says more about the state of the auto market and economy than the car itself.", "score": 4, "replies": [{"body": "Hondas and Toyotas and sports cars like Porsche 911 or Ferraris.", "score": 1, "replies": []}]}, {"body": "Yes, drivable, but would you be able to drive across state or on a road trip or something? I think you’ll find yourself having to rely on having a second car.", "score": -1, "replies": [{"body": "You don't need to own a second car for longer distances, rent a car for a road trip. There's certainly annoyances with having a low range EV, mine still has 150 miles so I haven't experienced them yet, but people get so hung up on things that you very rarely do.", "score": 2, "replies": [{"body": "I guess you do have a point about using rentals for longer distances.", "score": 3, "replies": [{"body": "What a pain tho. Nice having a car that can drive distance 😂", "score": 5, "replies": [{"body": "My car is old, but fully paid off. \n\nIt is *substantially* cheaper to periodically rent a car for long-haul trips than it is to get a new car that could reliably handle the distance (my current car can do it, I just don’t want to add the extra mileage). \n\nI drove across the country last year in a rental. Like, coast to coast and back. Rental + fuel cost me just shy of $800. Which is right about what the *monthly* cost of getting a new Tesla is.", "score": 5, "replies": []}, {"body": "How often do you drive 100 miles in a day? If it's every week then yes a EV isn't right for you. But most people rarely drive that far.", "score": 1, "replies": [{"body": "We take lots of trips", "score": 1, "replies": []}]}]}]}, {"body": "Imaging having a car on a 7 year loan and still having to get a rental for a longer trip hahaha", "score": 1, "replies": [{"body": "I mean yeah, I would recommend everyone always buy a used car.", "score": 1, "replies": []}]}]}]}]}, {"body": "But if you pay $30 extra/monthly, you can extend the warranty on your battery for two years.", "score": 2, "replies": []}, {"body": "Seeing comments like yours and /u/IncomeFundManager 's makes me confident Tesla is still a great investment. If there are still such insane misunderstandings about Tesla's cars and EVs in general, we are clearly still in the early stages of EV adoption.\n\nTesla's models are far from 7 years old. They get updated EVERY DAY. Unlike other OEMs, Tesla puts changes onto their cars as soon as they're proven to be an improvement, up to 60 changes per day, instead of only once every 1-2 years and only 50-100 changes per model refresh.\n\nAs for batteries, they last for decades. Even J.D. Power, which is traditionally negative on Tesla and EVs because they sponsored by legacy OEMs [says they last 10-20 years.](https://www.jdpower.com/cars/shopping-guides/how-long-do-electric-car-batteries-last#:~:text=Generally%2C%20EV%20car%20batteries%20last,management%20systems%20and%20charging%20restrictions.) Realistically, they degrade quite fast the first 50,000 miles and then taper off. Most batteries can last up to a few hundred thousand miles with extremes even up to a million miles. So for the average driver with 13,500 miles per year, that's forever.\n\nThat's also why good EVs (Teslas, Audis, Mercedes, etc.) have much lower price depreciation than ICE cars. Not higher.", "score": -2, "replies": [{"body": "Model 3 was introduced 6 years ago. And looks almost exactly the same as it did year 1. Model x is 7-8 years old and looks exactly the same.  Most people would be hard pressed to tell a 2013 model s from a 2023. \n\nConsidering how secretive tesla is (and how militant tesla fans/marketers are about trying tamp down on negative information), it’s too soon to tell about grandiose claims of mileage on batteries.  As a general rule, companies are only going to warranty things they think have a good chance of not breaking. \n\nAn ICE car isn’t going to go from a 200 mile range to a 150 range in 7 years, but it’s highly possible for that to happen in an EV (and won’t trigger a 30% replacement under warranty), which I would consider a significant downside.\n\nThe average car on the road is 12 years old. There’s plenty of cars that hit the 15-20 year mark.  A battery replacement would cause any of these cars to get junked and seems pretty likely to me.", "score": 4, "replies": [{"body": "Again, you have no clue what you're talking about. The outside might look very similar because it's close to the ideal shape in terms of achieving low drag, but  from the inside there's not a single part that's the same as 6 years ago. Most parts have been changed tens of times.", "score": 0, "replies": [{"body": "Lol", "score": 0, "replies": []}, {"body": "My 2016 model X has the same interior as a 22. That’s six years.", "score": 1, "replies": [{"body": "That's simply a lie. There are barely any shared parts between the interior of a 2016 Model X and a 2022 Model X. Just the chairs alone have undergone hundreds if not thousands of changes. And that's despite naturally the most changes being in the actual car and not the interior.", "score": 1, "replies": []}]}]}, {"body": "Stop bringing logic and facts to the argument! This is Tesla we’re talking about!!!", "score": 0, "replies": []}]}, {"body": "This is your brain on Elon", "score": -1, "replies": []}]}]}, {"body": "Imagine your economy being powered by that! Yikes!", "score": 4, "replies": []}, {"body": "They can drive them until the bumpers fall off. Just avoid puddles for seven years.", "score": 1, "replies": []}, {"body": "The Big Altima Energy of the 2030s will be Big Model 3 Energy, I'm calling it now", "score": 1, "replies": []}]}, {"body": "34% of new car loans are 7+ years? What? That’s a shocking statistic.", "score": 36, "replies": [{"body": "Did you really think most people can afford $40K+ cars? Guys I work with that make maybe $60K a year have $60K trucks. It’s madness. \n\nPeople are buying way above their range now.", "score": 25, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Haha wow. Good trade", "score": 2, "replies": []}]}]}, {"body": "They go longer than 84 months, too", "score": 7, "replies": []}]}, {"body": "Yes! Let’s pay the high interest longer!", "score": 9, "replies": []}, {"body": "i don’t think that’s a good sign for the economy… bnpl, extended loans…", "score": 9, "replies": [{"body": "I’ve never seen so many Affirm logos than I have in the last 6 months…", "score": 7, "replies": [{"body": "I was booking a hostel at SF for $40/night and one of the payment options was affirm lmao.", "score": 1, "replies": []}]}]}, {"body": "Fuck it. Let idiots make idiot mistakes.", "score": 52, "replies": [{"body": "This is why we have $100k trucks", "score": 24, "replies": [{"body": "100K trucks? There's car dealers on YouTube who talk about how some other dealerships were selling cars for 100K over MSRP during the COVID shortages, and there's people who paid those outrageous prices.", "score": 2, "replies": []}]}, {"body": "The problem is those idiots set the standard. In order to compete, you’ll have to conform and take out 7 year loans too.\n\nEdit: the responses I’m seeing only goes to show how people don’t realize the effect of loan duration on asset pricing.  Y’all are/will be getting (more) fucked.", "score": 15, "replies": [{"body": "Why are you forced to conform and take out a 7 year loan?", "score": 46, "replies": [{"body": "You’re not, but these loans of increasing length tend to increase the price of the asset", "score": 21, "replies": []}, {"body": "well Margot Robbie only date men with Tesla", "score": 9, "replies": []}, {"body": "The issue is more complicated than that.\n\nIt doesn't force you to take out 7 year loans, but it does drive up the price on vehicles because it creates more demand from people who otherwise couldn't afford it which means if it becomes the norm, vehicles will be priced based on the 7 year loans rather than what a cash buyer or 5 year loan could afford.\n\nSame reason college prices started skyrocketing when the loans couldn't be defaulted on and were backed by the government.", "score": 20, "replies": [{"body": "If the market won't support ~$30k new vehicles then responsible buyers will buy used vehicles. Something tells me that some automaker will always fill that market, it just might not be a 5,000 pound AWD pedestrian destroyer.", "score": 1, "replies": []}]}]}, {"body": "Fact. When this no repossession plus banks financing for $10k shit started, that's when prices went through the roof. People don't pay what a car is worth, they will pay the max limit of what they can get financing for. And then they set the market price for everyone.\n\nIf you got cash, the best thing that can happen to you is a tightening credit environment. You'll be practically the last buyer left.", "score": 7, "replies": [{"body": "Exactly. The banks salivate at the thought people willing to increase loan duration.\nThey get paid out more in the end loaning out the same amount of money. While the consumer base gets raw dogged; especially the financially prudent.", "score": 2, "replies": []}]}, {"body": "Ridiculous response. Shorter loan terms have always been an option. You can easily take a 15 year mortgage despite the fact almost everybody takes 30.", "score": 5, "replies": [{"body": "Right, but because everybody takes out a 30 year mortgage that ends up increasing the price of the asset making shorter term loan prohibitively expensive.", "score": 21, "replies": []}]}, {"body": "You don't; just buy what you can afford. I have never had an auto loan. I always pay cash for a second hand.", "score": 2, "replies": []}, {"body": "Nah, you wait for the wipeout recession to pick up assets on the cheap.  May take years is the problem, but patience is the solution. Getting paid 5% a year to wait now at least.", "score": 0, "replies": []}]}]}, {"body": "In the future you will own nothing.", "score": 7, "replies": []}, {"body": "At the price point for a S model, they’re going to have to take an unconventional approach. The market of potential consumers is very small at the price points for the S and X. I don’t remember the figures exactly, but when I looked at who buys the S/X models, it was household incomes > $500k (for new). Given the median household income in the US is a fraction of this, they’ll quickly chew through their potential customers if they don’t do something to lower payments.", "score": 9, "replies": [{"body": "The luxury segment is bigger than you’re imagining. Think of all the mercedes, bmw, audis, cadillacs out there. They’re competing in that overall higher income market.", "score": 2, "replies": [{"body": "True, but the majority of sales at MB are not S550s, they’re C and E class. Tesla doesn’t have the product selection to compete between the price points of the Model S and Model 3.", "score": 1, "replies": []}, {"body": "Ehh... Both BMW and Benz moved towards making entry level luxury vehicles in the last decade. Both have products in the mid-30s. And in the past, BMW incentives for leasing have been very generous... often setting residuals that are detached from reality (Thus, they are essentially subsidizing the lease vehicles). \n\nTo me, that is an indication that there really isn't that many people that can afford/buy true luxury vehicles. But there is a whole lot of people wanting to appear wealthy.", "score": 1, "replies": []}]}]}, {"body": "Idiots taking out massive loans for a car like this.", "score": 17, "replies": [{"body": "Gotta make it look like you have money.", "score": 9, "replies": [{"body": "I'm a rideshare driver... The amount of times I get rides in and our of trailer parks, where, next to some rusted piece of shit 80/90s trailer, theres a new benz or maserati or audi... \n\ngreat car to pick up chicks and then bring em back.... to the park...", "score": 7, "replies": []}]}]}, {"body": "If he’s so concerned about the interest rates nothing says he can offer low rate financing on Tesla cars.   They don’t have to follow the fed.   At some point ford eat Al are going to have to both cut the price and offer low rate financing to sell what will soon be last years model $60,000+ trucks no one is buying.", "score": 21, "replies": [{"body": "I went into a lot last week just to look at newer models.\n\n$65 to $70k average.\n\nFor a truck.\n\nInsane.", "score": 9, "replies": [{"body": "$75k Toyota Sienna in Virginia, come get it", "score": 3, "replies": []}]}, {"body": "That isn’t a realistic solution because Tesla isn’t the financier on every car they sell. Same for the dealer networks the automakers sell to. They have to charge that rate if their competitors are or their shareholders would consider them imprudent.", "score": 9, "replies": [{"body": "They can charge whatever rate they want regardless of the shareholders, because they also control the price of the car. Lower the rate, then raise the price of the car. They could even offer 0% 10y financing, because the total interest on what would have otherwise been a 5% loan was already added into the sticker price.\n\nBut, that’s not the direction they’ve chosen to go. Because consumers are used to seeing higher rates these days, Tesla is of course following that trend and raising their own rates, while dropping the prices of the cars.", "score": 3, "replies": [{"body": "Of course they can offer 0% APR for a limited time. But very likely only if you finance through Tesla. They can only do that for so long because the risk that the credit quality of their financing arm goes into the toilet if they offer that deal for more than say 6 months is very high. They certainly couldn’t do it from now until interest rates to start falling again. They also won’t realistically ever offer a 10-year loan. The expected useful life of the vehicle isn’t even that long and it’s not a widespread industry practice.", "score": 4, "replies": []}]}]}]}, {"body": "Not long until next generations inherits debt", "score": 8, "replies": [{"body": "You can turn down an inheritance if you want, like if it's an estate with more liabilities than assets. The only exception being if you already signed some paperwork agreeing to be liable for the debt.", "score": 1, "replies": [{"body": "I'd is an estate with more liabilities best believe that's getting insurances jobbied 🔥", "score": 1, "replies": []}]}]}, {"body": "How about 84 year mortgage and 84 month car loan.", "score": 3, "replies": []}, {"body": "mfers gonna be underwater for 79 of those 84 months considering normal depreciation plus the rate that Tesla new MSRP has been dropping.", "score": 4, "replies": []}, {"body": "- Do you smell that?\n\n- Opportunity?\n\n- No, desperation.", "score": 14, "replies": []}, {"body": "Why would anyone buy $TSLA? It's all \"It's so much more than a car company\" until profit margins on selling cars shrinks and the stock tanks.", "score": 10, "replies": [{"body": "This is already happening real time… Tesla bros are just shoving their head in the sand", "score": 3, "replies": [{"body": "Yep, and I'm a fan of Tesla. It's a neat car, but in the end, it's going to end up being seen and evaluated as what it is, a car company. No matter how many times you say FSD or Dojo.", "score": 1, "replies": []}]}, {"body": "Why wouldn't you buy $TSLA? Margins go down with scale. It's tough still having the highest margins in the industry. Ford just discounted the Lightning truck by another $10k and is expecting to lose $3B this year on it's EV products.", "score": -11, "replies": [{"body": "Operating margin is supposed to go up with scale...that's literally the entire point of scaling", "score": 3, "replies": [{"body": "Isn't the point of scaling to bring in more revenue? Even if operating margin goes down, you're getting a smaller slice of a larger pie so it works out better.\n\nObviously if you can grow margins then great, but there's more than one way to go about it I would think.", "score": 2, "replies": [{"body": "Not to mention allowing more vehicles to take advantage of EV incentives", "score": 1, "replies": []}]}]}, {"body": "Everything is priced in.", "score": -3, "replies": [{"body": "A robotaxi network would be worth trillions in market cap. Anyone who did the math on them knows that.\n\nYou can say Tesla's never gonna achieve autonomy, but you can't argue it's priced in. That just shows you're clueless about either valuations or the earnings autonomous cars would generate.", "score": -2, "replies": [{"body": "Anyone who did the math on that and got to trillions in market cap is doing made up math. \n\nGlobal market share for taxi services is barely even worth 200 bil in market cap. Tesla isn't going to just be able to use all the cars they've built for free. In Elon's interview with Faber he couldn't even quote how much they would have to pay back customers to use said robotaxis that only live in the imagination of Tesla investors. People aren't going to want to lease out their brand new cars en masse to let strangers drive around in them while they sleep without being paid a premium.\n\nEven if Elon is able to convince people to do this he'd have to pay a premium to even use the cars he's already sold to customers to be able to use them as taxis. Then he'd have to break into the taxi and ride sharing markets that are already oversaturated just to get some of that 200 bil market share. Projections for 2030 are roughly 500 bil for taxi services. Nowhere near trillions.", "score": 6, "replies": [{"body": "Ah but you see, everyone is super excited to ride around unmanned taxis. After all, it’s been proven that without supervision people would never junk up or break something they don’t own.", "score": 1, "replies": []}, {"body": "> Global market share for taxi services is barely even worth 200 bil in market cap.\n\nThis is quite possibly the dumbest example of reasoning by analogy I have ever seen. It's like saying \"How are people ever going to drive 10.000+ miles a year on average in cars when people only drive a few hundred miles a year on average with their horses?!\"\n\nAn EV robotaxi without a paid driver would cost just a fraction of what a regular taxi costs per mile. How can you expect comparable use?", "score": 1, "replies": [{"body": "Show the math then. Why would it cost less also if it does cost less that just means it will be less than the current taxi market cap. Not \"trillions\" with an s. The fact you can sit and say trillions and call anything else dumb is beyond me. Arrogant as hell my dude.", "score": 0, "replies": [{"body": "You're showing zero willingness to listen, so why would I waste time on explaining something you're just gonna ignore? You'll find out in 5-10 years.", "score": 0, "replies": [{"body": "I'm clearly listening you came out of the gate calling me dumb claiming robotaxis would add \"trillions\" in market cap, saying if people had just done the math they would understand. I understand what this made up fantasy Elon has been able to sell retail investors is. I'm not buying it but good luck.", "score": 0, "replies": [{"body": "Was gonna leave a remindme, but I only just noticed you're probably some 2-month old throwaway account trolling people. My bad.", "score": 0, "replies": [{"body": "Lol if anyone is trolling it's gotta be you for saying the market cap for Teslas taxi service that doesn't exist is going to be worth trillions, when, like we've already acknowledged the current global taxi service market cap isn't even over 250 bil and isn't projected to even reach a trillion much less trillions. You're using funny numbers, all made up to justify an irrational stock price. You know it's made up too that's why you won't respond with numbers. Feel free to call me dumb again though if it makes you feel superior about your stock pick. Doesn't bother me at all.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}, {"body": "I guess TSLA having high margins compare to other manufacturers even after cutting prices isn't popular", "score": 1, "replies": []}]}]}, {"body": "You all do realize that 60 year home loans used to be a thing in the US?", "score": 1, "replies": [{"body": "Appreciating asset vs depreciating asset", "score": 1, "replies": []}]}, {"body": "84 isn’t new.", "score": -2, "replies": [{"body": "For tesla it is", "score": 10, "replies": [{"body": "Especially when the battery's at $25k, will only last 10 years.", "score": -2, "replies": [{"body": "Is that true?", "score": 2, "replies": [{"body": "They're about 25k+ yes. How long they last, who knows.  Teslas aren't 10 years old yet. Be surprised if its much more than that. Depending on usage I guess. How long do phone batteries last until they are shit...3, 4 years? \nCharge up full, drive until empty, charge up full again, is probably best but how many do that?\n\nEdit; there are 10 year old teslas and the battery replacement is already about the same as the car price. Model s and x are old, not surprised they have high margins when they've been selling the same models for a decade +.. didn't know they were so old.", "score": 0, "replies": [{"body": "There certainly are 10 year old Teslas. Battery degradation varies, but the worst I’ve found for 10 years was 20%, which isn’t bad given the starting range. Who knows if/when the battery will fully give out, maybe in 20 years?", "score": 4, "replies": [{"body": "Still, resale on the vehicles at 10 years will be hugely reduced value because the new buyer won’t know the quality of the battery’s range.  \n\nAre you really shelling out for a battery that might be 10% off original range, or 35%?\n\nJust going to rip it for a test run for 200km?  This is a huge problem for the secondary market, and the value of these vehicles in a decade.  They may be near worthless", "score": 2, "replies": [{"body": "What's a ten year old model S worth? About the same as a new battery... \n\nExcluding all the other stuff that'll be wrong with it..\n\nYou can't buy parts from another supplier either or reconditioned battery packs I don't think..  like you could buy a reconditioned engine or gearbox or get a local garage to fix it... not that normally a car would need a new engine at 10 years.", "score": 1, "replies": [{"body": "Many model S and X models are more than 50% off new, which well exceeds battery cost. Model 3 has slimmer margins, but some nice examples for 30% off.", "score": 1, "replies": []}]}]}, {"body": "Damn, you're right, they're still making the S from 2012 and the X from 2015. You'd think a 'tech' company would bring out new stuff. Holy shit. That's like having a Samsung S3 or an iPhone 5 lol. Homeless people have newer phones.", "score": 0, "replies": []}, {"body": "Battery degradation aren't linear. Once they go, they go quick", "score": 1, "replies": []}]}]}, {"body": "How do you think the first people who bought PC’s felt after they spent $4k on it?", "score": 1, "replies": []}]}, {"body": "More like 18-20k", "score": 1, "replies": [{"body": "Bargain lol.", "score": 2, "replies": []}]}]}]}, {"body": "Should have done 69 month.", "score": 1, "replies": []}]}, {"body": "With EVs likely to last far longer than ICE cars...why not? People keep complaining that the up-front cost of an EV is too large. If you cannot save up and only do monthly payments then that's an option.", "score": -3, "replies": [{"body": "Yeah, it makes perfect sense. You'll save way more money than the added interest on the lower cost of ownership and price depreciation, and that's only getting more extreme. In a few year it'll be financial suicide to buy an ICE car.", "score": -1, "replies": [{"body": "It's quite possible that as OEMs gradually stop servicing the ICE market used ICE prices are supported much more than historical norms. Meanwhile early gen EVs are almost certain to tank in value as better and cheaper EVs inevitably come to market.\n\nWe got parts of America with no fucking internet 30 years in, EV infrastructure won't be universal anytime soon.", "score": 2, "replies": [{"body": "You may me right about the early gen EVs, at least the very crappy EVs like the Leaf.\n\nBut if OEMs stop servicing ICE markets their residual value will fall off a cliff, as it'll become impossible or way too expensive to repair these cars. OEMs have already seen suppliers go bankrupt after discontinuing cars with annual volumes in the thousands, go figure what happens when Toyota stops producing the Corolla.", "score": 2, "replies": []}]}]}]}, {"body": "Bullish!   Like high rates are GOOD for home builders and tech companies!", "score": 0, "replies": []}, {"body": "So you might have to replace the battery before the car is even paid off? Pass", "score": 0, "replies": []}, {"body": "Pay more interest over a longer period of time for a piece of shit. I think not.", "score": 0, "replies": []}, {"body": "Don't compute. DNR", "score": 0, "replies": []}, {"body": "Tesla mortgages \n\nThis is the bad kind of debt", "score": 0, "replies": []}, {"body": "Imagine being so broke you want to pay off a car for 7 years", "score": 0, "replies": []}, {"body": "Imagine taking a 7 year loan for a Tesla. I mean if it was a Camry or a Civic I would understand but Tesla? Lol.", "score": 0, "replies": []}, {"body": "[deleted]", "score": -6, "replies": [{"body": "What's your interest rate and what rate were you quoted for shorter terms? Generally 84 months is going to carry a higher rate.", "score": 5, "replies": []}, {"body": "Because you will always be upside down on that car. \n\nBetter carry Gap insurance.", "score": 5, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "You’ll always owe way more than the vehicle is worth. So, if you want to sell/trade in-you’ll still most likely have a funding gap you’ll be responsible for in order to pay off the loan. \n\nAnyone who has any type of vehicle loan should have Gap insurance-otherwise you are stuck with paying off a loan on a totaled vehicle for much the same reason as above.", "score": 3, "replies": [{"body": "I think maybe if you're considering taking out insurance on a bad financial decision, it'd make more sense to not make the bad financial decision in the first place.", "score": 2, "replies": [{"body": "Exactly. At least Gap insurance is cheap.", "score": 1, "replies": []}]}, {"body": "Bad financial advice.\n\nQuite happy I did not purchase GAP. I have about as much equity in my car as payments I've made. Probability GAP will be useful isn't high enough for a lot of cars.", "score": 0, "replies": [{"body": "Gap is really inexpensive and quite literally covers the gap between what you are paid for a total loss and what you owe on your vehicle. \n\nIf you are dumb enough to stretch yourself on payments to the point where you are constantly\nupside down on what you owe vs the value of the asset-then Gap is the one smart decision you could make.", "score": 1, "replies": [{"body": "Yeah so if you're a dumbass or a shitty driver, GAP is useful. So not \"anyone who has any type of vehicle loan\". GAP would have been throwing money away from day 1 for me.", "score": 0, "replies": []}]}]}]}, {"body": "The 'lower monthly rate' argument is a classic car sales grift. You'll end up paying more in interest since you pay for the car longer and in the end you'll overpay for the car. Also since you don't own the car you will have to pay more for insurance and for longer as well. Finally, of you could afford to pay more monthly payment, DON'T PUT IT TOWARDS A CAR LOAN ffs put it in the stock market", "score": 2, "replies": [{"body": "Your... insurance rates change for a paid-off car?  I'm pretty sure mine never have.  They might go down because the car is worth less over time, but the majority of the cost is liability insurance and the damage you can do doesn't decrease.", "score": 1, "replies": [{"body": "You usually have to pay collision until you pay off the car", "score": 1, "replies": [{"body": "Mmm, maybe I just never dropped collision then?  Interesting, I should look.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Is it the same interest rate as 48 months? You are hiding how expensive this car is, getting used to cheap debt is a slippery slope.", "score": 3, "replies": []}, {"body": "You make 90k a year and just ordered a 85k car with a 84 month loan? Oh boy", "score": 2, "replies": []}, {"body": "At what interest rate?\n\nI think the case for longer loans from a finance perspective is arbitrage -- I can throw that money I'm not spending in car payments in an index fund, and it'll make more money than the interest is costing me.  So if it were 2% interest, I'm right there with you.  If it's 7% interest, not interested.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah, definitely not interested in a 7 year loan at those rates :-)  Then again, my car was $21,600 brand new in 2016 and I aim to get another decade out of it if I can.  I'm not a spend-on-cars sort of guy :-D", "score": 2, "replies": []}]}]}, {"body": "You don’t make enough to own a model 3p. \n\nBut it’s nice that you put your poor financial decisions out there.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Still living with mommy?", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You just bought a car that costs 1/2 your salary. Poor financial decision making.", "score": 2, "replies": []}]}]}]}]}, {"body": "Great financial decision. Inflation will eat away at your debt, and you'll easily be able to compensate for the rent through investing, never mind the much lower cost of ownership compared to an ICE vehicle. Well done.", "score": -2, "replies": []}]}, {"body": "This started after 2008 financial crisis.", "score": -2, "replies": [{"body": "Not even close. A car payment pales in comparison to a mortgage.", "score": 2, "replies": []}]}, {"body": "Yes a step closer to the 360 month auto mortgage.", "score": 1, "replies": []}, {"body": "When can we expect the born into debt payments to start...", "score": 1, "replies": [{"body": "FED : Hold my beer…", "score": 2, "replies": []}]}, {"body": "At 84 months - why not just lease?", "score": 1, "replies": []}, {"body": "Wcgw", "score": 1, "replies": []}, {"body": "If I die before loans is paid can I get buried in it?", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": " why do you think this is a joke? is there really a lot of different between 5 year vs 7 year's car loan?", "score": 0, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Lol", "score": 0, "replies": []}]}]}]}, {"body": "Tesla and the fed deserve each other.", "score": 1, "replies": []}]}
{"title": "I was down 55% on my portfolio headed into January 2023 and have now broke even thanks to the advice of r/stocks", "selftext": "[deleted]", "id": "157f857", "created_utc": 1690119869.0, "score": 684, "upvote_ratio": 0.85, "num_comments": 171, "comments": [{"body": "I completely forgot how many suicide posts there was in December 2022 on this sub. There was a joke that anytime you start seeing people want to kill themselves you know you are near a bottom.", "score": 557, "replies": [{"body": "that's exactly it. sentiment is a lagging indicator.", "score": 118, "replies": []}, {"body": "JFC the Dow was only down 20% in December 2022.  Any marys threatening to kill themselves should have witnessed the carnage of the dot com crash or the bottom of 2008.", "score": 102, "replies": [{"body": "I wish this sub's flair was the person's age and how long they've been investing. It'd help so much", "score": 87, "replies": [{"body": "My first stock purchase was 2001!  Has been a wild ride, but so glad I invested early and often", "score": 14, "replies": []}, {"body": "I guarantee you 99% of this sub have not been investing for even 10 years. I haven't either, I'm only just closing in on that, but I also work in industry and have put 1000s of hours into it on my own time. \n\nFor most people I think this is basically just a hobby", "score": 6, "replies": [{"body": "Started a year ago, got a bit more serious in January. Was down 12% at my lowest point and I'm currently up 27%. It's definitely a feel good swing.", "score": 2, "replies": [{"body": "Down 27% at my lowest. From 147830 Aug 12 2022 to 107734 October 20,2022 to 127411 Nov 14 and up to 137,300 Jan 20,2023 down  to 121k the end of March up to 128 April 3 back down to 122 May 22nd and back up to 133087 July 31 to 123897.45 Aug 22nd to 130,015 September 1 and back down to 128,207,excluding roughly 16k  in cash withdrawals \n I'll never let myself drop that much again. I exercise risk management  now and since I withdraw an avg of 2k/month, it's going to take me a good 15 to 20% month to make myself whole or it could take another year. Still beats working a 9 to 5.  If I was working I would've recuperated everything. My only issue is I've made 20% this year but spent like 14.5% of it as I sit roughly 19% above my October low. From Oct 20 to Jan 20, I recuperated 30k out of 40k just to drop back down 16k by the end of March. I was underweight tech.  I have another 19,130 to go as I've given back 4800 of my recent gains during the August correction", "score": 1, "replies": []}]}]}, {"body": "You made realize that I invest since 2017. It's not that much, there's people here with decades of investing and trading but it didn't feel that long ago to me.", "score": 4, "replies": []}]}, {"body": "These folks don't own Dow\nstocks they owned tech stocks, which some were down 70%.", "score": 44, "replies": [{"body": "My company's stock was 300 when I joined. Now it gives around 50\n\nSo -83%\n\nIf someone took a 83% hit to their net worth, I can easily see some dark thoughts", "score": 11, "replies": []}, {"body": "Exactly.  Furthermore, Reddit skews tech industry workers which also may have been feeling a little bit of job insecurity too.", "score": 16, "replies": []}]}, {"body": "Most of tech was down 60%, some as much as 90-95%. \n\n\nYou picked the most useless index (due to price weighting) and compared it to individual stocks. On top of that, indexes are nearly always going to be way stronger than individual stocks during big downturns. To make it worse, options became mainstream at the time. Add to the pile that brokerage accounts reached unprecedented numbers of new people, most of which had no clue what they were doing.\n\n\n\nThese people weren't smart with their decision making, but there were probably way more people financially ruined during that bear market than in 08 (specifically from equities, that would change if you included housing crash and unemployment obviously).", "score": 14, "replies": []}, {"body": "I’m guessing those people made poor stock picks and were down considerably more than the DOW", "score": 4, "replies": []}, {"body": "A lot of inexperienced young folks trying to learn investing from Reddit were all in on things like ARKK, so they went through more significant pain than a 20% correction. lol", "score": 2, "replies": []}, {"body": "What makes you think people here were invested in the dow? Plenty of stocks lost over 50% in 2022", "score": 2, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "[removed]", "score": 0, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "[removed]", "score": 1, "replies": []}]}]}]}, {"body": "[removed]", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Well since I shifted my income portfolio to  trading 1.5x to 2x leveraged Etracs income etns, my performance has improved. I realized I could be wiped out if there was a covid crash but now I won't let myself drop further than -15%. I'm recovering from a 27% loss..managed to recuperate 3/4ths in 3 months but 2023 was largely nice to tech and if you were underweight tech things only started moving in Jan and May to July. \n\nI've also withdrawn roughly 16k from the portfolio over the last 8 months..From 147830 to 107734 to 137300 to 121k to 128 to 122 to 130k to 123895 to 130k to 128207,excluding 16k in withdrawals. \n\nIts made me a better investor/trader. Buy and hold only gets you so far-when it's time to sell its time to sell whether it's risk management or taking profits", "score": 1, "replies": []}]}, {"body": "i watched it and participated in it.\n\nwhat i cant stand is this growing blind sentiment from reddit and newer people is:\n\n1) the market always goes up\n\n2) dont trade, invest - which the action is the same thing, just different time frames...is one more risky? it depends.\n\n3) that you should always lump sum, because #1. when in reality, it depends when you get into the market and how much cash you have coming in to reduce cost basis.", "score": 2, "replies": []}, {"body": "No one here was buying the dow though.. it was all GameStop and Tesla", "score": 1, "replies": []}, {"body": "My portfolio was 80% NVDA in Dec so I was definitely down around 60+%....I think quite a few ppl here are heavily into tech but that kinda skews what normal non reddit ppl do with their investments...", "score": 1, "replies": []}]}, {"body": "damn, thats fucked up\n\nsooo….sell time", "score": 13, "replies": []}, {"body": "I don't think I saw a single one of those posts? I know this is a popular comment in r/Cryptocurrency though", "score": 3, "replies": []}, {"body": "Yes. Also keep in mind this sub blew up during the bull run after Covid. \n\n\nMany of the users here never experienced a downturn. Their only investment experience was making easy money.", "score": 5, "replies": []}, {"body": "Sentiment is a contrarian indicator.", "score": 9, "replies": [{"body": "So. OP is happy now. We sell.", "score": 14, "replies": []}]}, {"body": "Lol you’re not wrong. It’s one of the signs I play to go long on tech", "score": 7, "replies": []}, {"body": "So what’s the opposite to know when the top is", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "yeah my dad told me to buy oil the other day so I made sure not to", "score": 1, "replies": []}]}]}, {"body": "Everyone now thinking they are in an AI mania, lambos all over again", "score": 1, "replies": []}, {"body": "I am still suicidal when I see my PYPL :(((", "score": 1, "replies": []}]}, {"body": "lol so you got lucky and learned nothing?", "score": 310, "replies": [{"body": "Yup. Now all he has to do is repeatedly get it right with stabs in the dark and he’ll be rich!", "score": 88, "replies": [{"body": "Sounds easy to me!", "score": 6, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "what no Spam? I can't eat it without green onions,Spam and a egg on top", "score": 1, "replies": []}]}]}, {"body": "Better lucky than good", "score": 11, "replies": []}, {"body": "so lucky, he might as well buy 0dte options!\n\nhe'll be FILTHY RICH", "score": 3, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "It’s about the long game. 90% of investors fail to out perform the index on a 10 year time horizon. Something tells me OP isn’t in that top 10% lol", "score": 9, "replies": []}]}]}, {"body": "Idk, but I feel that part of it seems like luck is on your side. \n\nBut what do I know, I am new to investing in stocks.", "score": 117, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "I get your joke 😁", "score": 2, "replies": []}, {"body": "Meta no. NVDA at 141 still had a PE in the 80s as blockchain was dying. Carvana is a scam that should still be bankrupt. Palantir was overvalued even then. \n  \nHe got results but he was still lucky", "score": 1, "replies": []}]}, {"body": "I'll take luck any day. 😆", "score": 1, "replies": [{"body": "Tis better to be poor and wise, than rich and lucky.", "score": 4, "replies": []}]}]}, {"body": "Hmm, I don't buy it.\n\nIt's **you** that decided that it was a good idea to buy in december (in hindsight, it was), and it was **you** to cherry pick compelling arguments about some stocks instead of compelling arguments about other stocks.\n\n/r/stocks is noise, you decided to follow *some* of it at a particular time. It's your losses, and it's **your** gains.", "score": 114, "replies": [{"body": "Just sounds like OP got incredible lucky with Nvidia tbh", "score": 53, "replies": [{"body": "PLTR popped too", "score": 18, "replies": [{"body": "So did CVNA.", "score": 7, "replies": [{"body": "So did Meta", "score": 0, "replies": []}]}]}, {"body": "And unless OP sells today could be down the same amount again on those names. \n\nLike, hurrah you broke even over two years (during 6% annual inflation).\n\nMeanwhile if you had bought McDonalds two years back initially it’s an even better decision than lucking into buying the dip", "score": 12, "replies": [{"body": "A lot of you sound miserable that someone has done what literally everyone tries to do.. OP timed the market and did well. No harm done whether it was luck or not.", "score": 1, "replies": [{"body": "What literally everyone tries to do?\n\nFilter Reddit stock picks by most controversial and invest in them after you have already had 30% downturns?\n\nHonestly, maybe 2% of investors do that.  Most of us don’t try and time the market", "score": 7, "replies": [{"body": "Yeah sure, use the exact methodology of filtering reddit comments by controversial. That's definitely what I was getting at.", "score": 1, "replies": []}]}, {"body": "OP timed the market and.... Is right back to where he was before he lost 55%. Is that really such an achievement? Congrats you're back to 0% meanwhile the S&P is ripping and inflation is at 6% so you're real return is still negative.", "score": 2, "replies": [{"body": "Okay, NVDIA posted like 100+% returns since then.. the S&P has not returned that. He's in a better position than if he soley held in an index", "score": 1, "replies": [{"body": "I'm talking about if OP didn't pick random stocks in the first place from this Reddit, he'd be up and not breaking even. Nvidia is at all time.highsnover AI frenzy, OP is not in a better place, he made himself whole again. If you can't understand that algo traders must love you.", "score": 2, "replies": []}]}]}, {"body": "[removed]", "score": 0, "replies": [{"body": "See my above comment where I said it doesn't matter if it's luck. If you got into a stock before it pumped you timed it. How is that so hard to comprehend?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Now I'd sell and take the W. Then move into more conservative long-term positions.", "score": 28, "replies": [{"body": "This is the read advice. Sell into strength and now put it into the broader market. Op got lucky with individual stocks.", "score": 3, "replies": [{"body": "I think having some individual stocks can be pretty good, I'm about 50/50 at the moment, but I think one should make a majority of their individuals kinda boring, or if not then make them a smaller piece of one's world than some broader indexes or dividend growth funds or something.\n\nThis is also about timing too, tbh. This last fall and at the beginning of the year, there was some real blood in the water and so buying up growth stocks was a good move. But now that one's already ridden that recovery, it's going to be important to ease off enough to be careful to preserve those gains just in case things go tits up. Because multiples have gotten kinda high, and so it's not nearly as clear there's a good ride in front of us now. So I'm buying value instead.", "score": 1, "replies": [{"body": "This was my sentiment as well.", "score": 2, "replies": []}]}]}]}, {"body": "Those are some good stocks to invest in for sure.\n\nI’d still argue your best bet at long term\nSuccess is to have the majority of your investments in index funds though and DCA every paycheck if possible.\nDon’t think cause you timed the market perfect this time it will happen again\n\nI started investing when I graduated in 2016. Im averaging a 8% return per year; nothing crazy but it’s stable and in the long run should work out", "score": 55, "replies": [{"body": "8% in the last couple years, compared to your Bank giving you 0.0005% savings account \n\nNot bad at all", "score": 16, "replies": []}, {"body": "> Those are some good stocks to invest in for sure.\n\nSome of them yes, but Carvana?", "score": 4, "replies": [{"body": "Yeah he gambled big but it ran 1600% YTD. Eff it lol.", "score": 6, "replies": [{"body": "Yeah it went bonkers. I even looked at carvana and though I don't mind some risk I stayed away lol", "score": 5, "replies": []}]}]}, {"body": ">Don’t think cause you timed the market perfect this time it will happen again\n\nBut where’s the fun in that!", "score": 2, "replies": []}, {"body": "🧠", "score": 1, "replies": []}]}, {"body": "Has nothing to do with Reddit . Market crashed and then had a bull run . Literally didn't matter what you bought you would've recovered . Nobody knew nasdaq would go up 30% especially in this horrible economy but it sold off so much probably wasn't gonna crash much lower .", "score": 79, "replies": [{"body": "Noooooo it was the MaGiC oF rEdDiT", "score": 22, "replies": []}, {"body": "This isn't true. If u look at utilities, healthecare and staples ( xlu , xlv, xlp ) they are flat ytd meanwhile tech and discretionaries ( xlk , xly) are up 40 and 30%.", "score": 6, "replies": [{"body": "Yea obv tech sold off the most . A lot of stuff was down over 80% eventually the index was gonna recover . Even bad tech companies that will never be profitable rode the wave back up that's how it works . It was a good time to buy seeing as inflation had stabilized and interest rates have stopped rising and growth stocks most that aren't even close to being profitable companies had bottomed out . They all move together some a little some a little less . You could've closed your eyes and just picked anything would all be the same , sorry to break it to you lol", "score": 3, "replies": []}]}, {"body": "Missed out on 150% and 400% gains, didn't ya. ![gif](emote|free_emotes_pack|sunglasses)", "score": -3, "replies": []}]}, {"body": "As my finance professor said “anyone can beat the market just take on more risk”", "score": 21, "replies": [{"body": "I like that quote. Risk is the chance of losing here, so it also reads anyone can beat the market, just take on more chances that you’ll lose to the market", "score": 3, "replies": []}]}, {"body": "Congrats? You continued to gamble? Now would be a good time to go all in on VOO and stop gambling", "score": 8, "replies": []}, {"body": "I’ve broken even by doing literally nothing.", "score": 7, "replies": []}, {"body": "Congrats! I think part of the moral of this story is beta. High beta can work for and against you, depending on which direction the market is moving.", "score": 12, "replies": []}, {"body": "Given that you got lucky once and you got your advice from Reddit without any DD. I think its time to throw everything at VOO now that you recovered your losses.", "score": 12, "replies": []}, {"body": "Not Reddit, entire market has gone up remarkably since Dec 22", "score": 3, "replies": []}, {"body": "So you took the bad advice that just happened to work out, congrats on being lucky now take the good advice.", "score": 12, "replies": [{"body": "Zero chance OP heeds good advice. They're in the clouds right now, and they think they are genius.", "score": 2, "replies": []}]}, {"body": "Good job, consider having a swing account along with your long picks, that will help to bring your average down!", "score": 3, "replies": []}, {"body": "I don’t remember these comments.  Most were saying to sell", "score": 3, "replies": []}, {"body": "Best advice I can give: don’t start thinking you are Superman and keep taking risk after risk until you find yourself down massively again. It’s just luck you didn’t go from making big mistakes to warren buffet just because of Reddit advice. Take the money and put it into a broad market etf before the law of averages kicks in again. Not trying to be rude or rain on your parade, good job turning a bad situation around.", "score": 3, "replies": []}, {"body": "That's great but you're gonna lose it back if you don't change your approach", "score": 3, "replies": []}, {"body": "Expected “comedy” flare to be honest", "score": 3, "replies": []}, {"body": "TIL... people are actually still buying PLTR...", "score": 3, "replies": []}, {"body": "now sell everything before the dead cat bounce fucks you in the ass", "score": 9, "replies": [{"body": "*proceeds to bend over and spread both cheeks*", "score": 2, "replies": []}]}, {"body": "Def time to sell and wait ........ Market Is way over bought in this economy  . There are no more positive indicators at this point . Inflation has slowed but won't go down anymore at this point . Real estate market is still fucked and won't get any better any time soon .", "score": 8, "replies": []}, {"body": "It was all you. You made the decision.\n\nPeople are odd creatures. I've read comments that want you to stick to SP500, or their idea of \"safe\" investments. There are comments that also don't like it when others successfully get rich quick, even though we all want that.\n\nI'm curious about how many people would like your post if you framed one about making triple digit returns rather than breaking even. I think it's where the 'congrats and fuck you' replies come from.", "score": 3, "replies": []}, {"body": "It is a real shame that money/loss of money can drive people to contemplating suicide. Understandable to a degree but a shame.", "score": 2, "replies": []}, {"body": "Don't confuse performance with process. Just because you drove home drunk and happened to make it, doesn't mean it was a good idea. You're gambling, not investing--understand the difference.", "score": 2, "replies": []}, {"body": "Everyone here will recommend holding, and when the market drops 50% from current levels you will be right back to wishing you *didn't* listen.\n\nHigher policy rates impact the economy on a large lag, the market has completely overstepped it's biggest driver [(net liquidity/net banking reserves)](https://twitter.com/TimmerFidelity/status/1682385272061698049/photo/1). The latter is a huge deal and will continue to move lower over the next several years as the Fed resumes QT.\n\nTake your breakeven and get out", "score": 2, "replies": []}, {"body": "you basically did the Warren Buffet strategy, buying when everyone else sold off.\n\nDecember is when most people sell off for taxes and buy back their positions at the bottom 30 days later (if you ever notice the stocks seem to hit their lowest in the first weeks of january..) so they can declare losses on their taxes then buy back after the wash.", "score": 2, "replies": []}, {"body": "Congratulations. Keep being critical and do your DD and eventually you’ll turn in steady profits.\n\nI remember last year that I said somewhere in summer I’d keep buying the dip and some User used a remind me for December and asked how I was doing and I told him I had just again invested all of my Christmas bonus - he was shaking his head.\n\nI am doing pretty well YTD and 12mz", "score": 2, "replies": []}, {"body": "I am still down 30% so you really did make out well! Congrats on not selling any of those growth stocks on the way up too. Holding on when the pressure rises is much harder and holding when the pressure decreases.", "score": 2, "replies": []}, {"body": "Rug pull incoming", "score": 4, "replies": []}, {"body": "Contraians have an edge. CVNA especially has done well.", "score": 3, "replies": [{"body": "I would not hold\nCVNA long", "score": 11, "replies": []}, {"body": "Could have easily gone bk as well", "score": 3, "replies": []}]}, {"body": "When you feel like bragging it’s time to sell, if it’s good enough to screenshot it’s good enough to sell", "score": 2, "replies": []}, {"body": "Luck! Hopefully we aren’t seeing top indicators with this kind of talk. I started dumping my portfolio last week to take a breather. \n\nI don’t touch meme level stocks. But glad it worked out for you.", "score": 1, "replies": []}, {"body": "Where are you finding these recommendations?", "score": 1, "replies": []}, {"body": "Nice! I'm sure a few of us are in that \"recovered for the most part\" boat. I pulled the trigger on AMD contrary to my usual strategy my DCA is about $88 and that's a nice boost. Not sure it's a long term stick for me without a dividend though. I trimmed some buckets on my 401k brokerage at the peak but didn't wait long enough for the trough so my new investments haven't panned out so well. It's ok though. I'm 2 years from retiring plenty of time. 😆 \n\nOn a side note I always roll my eyes when I see those posts or articles stating, \"if you had bought Microsoft or Amazon at x date, you'd be a millionaire. Sure you would but the crash of 99 was brutal. I don't know a lot of people that didn't get tech burned. My tech mutual fund vanished and closed overnight. My brother was heavily invested in Cisco and was beaten down by his losses. I for one was not interested in anything that wasn't S&P 500 for a long time after, even though I've held a drip in Intel since, couldn't face the losses and its ok now until it wasn't just recently. Market is a fickle bitch somedays, but the long haul usually pays off.", "score": 1, "replies": []}, {"body": "Time to start shorting ........ Inflation may have slowed , but we still went through almost 2 years of massive inflation thats never going away . Wages haven't even come close to keeping pace . Real estate market has no buyers . Interest rates aren't changing any time soon if ever . Worst economically minded president we've ever seen . Weakening relations with middle east oil producers and most of Asia in general . We are still patching up holes with duct tape(with massive spending and continuing to devalue our dollar) eventually we will actually feel the pain from our massive mistakes as a country , duct tape can't hold forever but maybe for a little longer lol . Overzealous sec . No positive indicators on horizon and real potential for massive downturn .", "score": -7, "replies": [{"body": "This sounds like a Fox News rant.\n\nYou really need to decouple yourself from politics if you want to invest, otherwise you'll miss great investment opportunities. \n\nIf you hate Trump it's okay to make money buying during his administration if you hate Biden it's okay to make money buying during his administration. Always shorting the one you hate doesn't make any sense", "score": 10, "replies": [{"body": "Am I wrong lol ........ I guess you can be an eternal optimist but good luck with that . Explain to me what you disagree with . \n\nI'm sorry if I insulted Biden , but I just don't see where his \"team\" has shown any economical sensibility . I mean you can tell the public you've created the inflation reduction act by spending 1.3 trillion and people may not understand that if you keep dilluting the supply you will devalue your product but eventually this is going to crash maybe not in the next year idk but it will happen especially with briccs and strained relations with the east . \n\nYou can tell people your going to change infastructure by going solar and wind power to appease your base , but it is fair from economically sound . Would cost trillions and we lose efficiency by going off oil when every other producing country will continue to run off oil and even coal and continue to outpace us . This hurts our economy and thus out stock market . \n\nOur money is only propped up holding the reserve currency thus forcing countries into needing our dollar to exchange goods thus creating a demand . Now if the east goes into this briccs agreement and bypasses our dollar it will at some point and yes I don't know when will collapse the dollar because the only reason we can continue to dilute our money and get away with it is because it is propped by other countries needing but now when they don't this is what happens . \n\nHousing and rent is outpacing wages , inflation may have slowed but 2 years of 7-8%(it's actually higher but there able to smudge the numbers to make it look better) is cooked in and will never go away . Wages may have gone up a minor fraction of that in meantime . \n\nSo please explain to me why we should be optimistic after market just ran up 25-30% in a couple of months .", "score": -2, "replies": [{"body": "Well let's look at the Middle East oil producers relationships since you keep talking about oil, Trump was able to get the Middle East to produce more oil thereby lowering the oil prices, great right!\n\nBut I will use a term that you used, that policy was held together by duct tape and glue.  Those lower oil prices drove many American companies to go bankrupt or reduce drilling because they cannot compete with low Saudi oil.\n\nSo what happened? As soon as the economy recovered (and it would have recovered whether Biden or Trump won), the American oil companies were found with their pants down unable to supply enough oil to meet demand.  So prices soared. \n\nAmerican shale wells decline very swiftly so you have to do constant drilling just to maintain output, the lack of constant drilling due to low oil prices resulted in underproduction until say this year. \n\nYou need a very stable fairly high price in oil to keep American companies healthy and drilling. Unfortunately that's the cold hard facts, Middle Eastern countries can be profitable at $10 oil we need 70 to $80 oil.\n\nOf course at any time the Middle East could cut production so we're kind of at their mercy.\n\nThe only way out of this mess, I'm sorry you don't want to hear it, but it's renewables. Now Biden pretends to be Pro Renewables when he talks but he's actually Pro oil and Renewables in his actions. Quietly multiple pipelines were constructed this year. Thousands of new federal oil leases were issued. This is not an anti oil president. \n\nOur oil production will be the highest ever this year, and we are energy independent again according to the eia.\n\nAnyway Biden has been a disaster in other respects but I don't let that stop me from investing", "score": 3, "replies": []}]}]}]}, {"body": "Those all have doubled in value today. How are you just breaking even? I was down just like you in January and have recovered and made 55% in profit by last week.", "score": -4, "replies": [{"body": "Someone who is down 55% needs a 122% return to break even.", "score": 1, "replies": []}]}, {"body": "My 20 year investment portfolio was down 50 percent last year, but I’ve gotten 75 percent back this year.   So still down quite a bit from the high…..but I’ve actually sold some shares in the high flyers recently to lock in some gains….\n\nIt’s always harder to sell than buy.", "score": 1, "replies": []}, {"body": "Enjoy your volatility", "score": 1, "replies": []}, {"body": "You ended up gambling in the right stocks. Congrats! I’d buy a lotto ticket if I were you.", "score": 1, "replies": []}, {"body": "Grow up and invest in s and p 500, why do you kids just love throwing your money away to billionaires?", "score": 1, "replies": []}, {"body": "I was down 25% but still down 12.5% because of weak usd v euro. :(\n\nI didn't invest more in 2023 because I'm saving up for something.", "score": 1, "replies": []}, {"body": "Time to sell thanks", "score": 1, "replies": []}, {"body": "I can get on board with that . As I'm far from  not an expert on oil and we have to rely on the media for a lot of our information which regardless will not always be precise . \n\nAs far as supply being low in Saudi . We will never know , it's business and politics wrapped in one , they could've cut supply because of a number of reason least of all being the actual supply and doesn't seem like the Biden administration has great relations with oil producing countries at this point . \n\nNow I know we have a massive reserve here in the United States and capacity to produce the most oil in world(I could be wrong on this but I know we have a large capacity) and was under impression Biden had cut production to appease his base , or maybe this was just portrayed in media and they continued production . Irregardless gas prices skyrocketed under his regime and stabilized but our now back on the rise .\n\nHonestly in my opinion oil is the least of my worries with economy . \n\nMiddle class has really been decimated , small businesses are hurting badly , savings our very low and wages aren't enough at this point for people to invest . Equals less money moving into market . Most people are trying to survive and our heavily in debt and it's not turning around fast .\n\nA lot of companies are under water and having a hard time borrowing to stay afloat . There are a lot of people still barely holding on and theres more pain to come .\n\nHousing market will not recover anytime soon as people won't sell because there not going to go from paying a 3% to an 8% . so market will remain under supplied thus driving prices higher . Buyers have less savings for down payments and aren't going to take on 2-3k mortgages when they are barely able to keep up there current bills .\n\nMany companies especially in tech are extremely overvalued now with this recent run . \n\nSec seems hell bent on stopping innovation and stifling crypto market(new technology) because it is a threat to us dollar global dependence(makes it to easy to move money internationally while side stepping dollar) .\n\nI just don't see any direction from administration and feels more like they either don't know what the fuck there doing or they are furthering the agenda of massive transfer of wealth from middle class to the top 1%\n\nI won't even touch on proxy war in Ukraine , but we can you want to go there lol", "score": 1, "replies": []}, {"body": "I would sell my position and move on to something safer and less stressful", "score": 1, "replies": [{"body": "I’ve learned my lesson", "score": 1, "replies": []}]}, {"body": "if you just invested in SPY you would be up 20% now", "score": 1, "replies": [{"body": "I invested in three startup/penny stocks I read about beginning of June in this subreddit and I'm up 45% on average now on those three.", "score": 1, "replies": [{"body": "congrats on getting lucky", "score": 1, "replies": [{"body": "Thanks and I agree on the luck part.", "score": 1, "replies": []}]}]}]}, {"body": "This is definitely gonna age well", "score": 1, "replies": []}, {"body": "Exactly, just DCA and you will always make it out.  Never has anyone gone broke by holding !", "score": 1, "replies": []}, {"body": "Sounds like you are holding a bunch of stocks that could easily tank you 55% again. Overvalued and volatile.", "score": 1, "replies": []}, {"body": "Now everyone is bandwagonjng jumping on CVNA good time to go short", "score": 1, "replies": []}, {"body": "Great, keep following random redditors into trades while doing no research; I’m sure it will keep working out for you.", "score": 1, "replies": []}, {"body": "Now would actually be a good time to sell everything and just buy SPY", "score": 1, "replies": []}, {"body": "Sounds like luck. Market was pricing in about 65% probability of a recession and we didn't get it, so now the market priced out all the recession risks. Had we actually entered a recession, market would price in 100% recession risk, you would have been down even more and some crap stocks like carvana might have gone bankrupt", "score": 1, "replies": []}, {"body": "Take care not to ride the roller coaster down again!", "score": 1, "replies": []}, {"body": "Frankly I don't know why people recommending Spy etc even bother coming on this sub.\n\nSuppose they are better than pump and dumpers but what even is the point.", "score": 1, "replies": []}, {"body": "Dumb question, not sure if I will get an answer here or not but don't think it is worth a new post. Is there any real difference between VOO, VTI, and SPY? All of their holdings seem fairly similar. VOO and SPY are even similar in price. I could be wrong, but if the all have the same holdings it seems like VTI would be the best bet going forward as they are half the price so you can buy 2x as much? Again, sorry if that is a dumb question. But like I said, they all seem almost identical.", "score": 1, "replies": [{"body": "VOO = investing \nSPY = trading \n\nVOO is within VTI \n\nVOO/VTI has 85% overlap. \n\nI chose VOO. It’s up to you if you want to invest in the SP500 and exclude small cap or invest in the total market and include small cap", "score": 1, "replies": []}]}, {"body": "Wow thank goodness for r/stocks which allowed you to break even after 2 years and thinking you'd lost half your money forever. If you'd gone completely crazy by investing in VOO or SPY in January 2021, you'd only be up 15-20%. Let us know when to sell and keep fighting the good fight!", "score": 1, "replies": []}, {"body": "In investing you have no idea about if a process is working or not for years. You got on the good side of the markets sentiment and irrationality. You do this long enough and soon you’ll find yourself on the other end again.\n\nIt does seem like the best financial advice for you is VOO/VTI.", "score": 1, "replies": []}, {"body": "I'm at a 2% positive... \n\n\nI'll take it.. I was red for so long.", "score": 1, "replies": []}, {"body": "> DKNG\n\nDonkey Kong?", "score": 1, "replies": []}, {"body": "Some people are probably fuming reading this post. Especially those who only invest in ETFs are now foaming at their mouths.", "score": 1, "replies": []}, {"body": "Not advice, but some great ideas got me nicely to the plus side. OK, I was also lucky with timing. SCHW and INTC, of all the bets... Would be to the moon already if I had not sold PLTR just days before it skyrocketed. But I was so fed up with it and had small + already.", "score": 1, "replies": []}, {"body": "Well, Meta and Nvidia were sure good picks around that time. Those were explosive runs, absolutely insane outliers.", "score": 1, "replies": []}, {"body": "You've taken a  lot of risk just to break even. You should consider moving some money into multisector index funds, such as VTI. Taking the slow diversified approach will mitigate losses so you dont feel suicidal every few years when there's a tech correction.", "score": 1, "replies": []}, {"body": "This post tells me the market is overvalued....", "score": 1, "replies": []}, {"body": "I am glad you were able invest almost at the bottom late last year and make up for the losses. But that collection of stocks does not inspire any confidence for long term returns. its just tech, has companies with horrible financials (CVNA, DKNG, PLTR) or companies riding the AI Hype(NVDA). I hope you will diversify or see the some of the gainers lose steam very quickly.", "score": 1, "replies": []}, {"body": "You're lucky. I dropped 27% a month after leaving my job. Thats a 40k drop. I managed to recuperate 30k out of 40k in 3 months from Oct 20 to Jan 20) but then dropped 11% by the end of March,bringing me back to 17% from the high. \n\nI made it back to 10% from my all time high by July 31 for the 3rd time. Currently 13.5% from the high.  I've also withdrawn at least 16k-20k from the portfolio this year as I sit 19% above my low.\n\nJust one month like Oct 20 to Nov 14 2022 or Jan 1 to Jan 20 would make me whole again. \n\nIt's hard to recuperate 40k while withdrawing 24k-30k/year. I guess you could say I've recuperated all of my losses at some portfolio values or most of my losses at other values. The only issue is that I've spent most of what I recuperated. I was underweight  tech until May when the Yieldmax funds came out. I sure wish I had saved the first 7 months of dividends when I was working. I would be 3 to 4% from my high. In the meantime, every day I keep grinding it out, setting myself up to bounce high during the next rally. \nFrom 147830 to 107734 to 137300 to 121k to 128k to 122 to 133087 back down to 123897.45 back up to 130,015 and back down to 128150, excluding roughly 16k in withdrawals.  \n\nSince I withdraw 1.3% sometimes up to 1.8% of the value monthly-I realize it could take me another year unless I have a 10-20% month, which happens 3 times a year to me. Its a leveraged income etn portfolio. \n\nI've been measuring the volatility of various assets..I dropped 6.9% from my July high and by simply replacing some positions with a larger,more volatile position, I was able to jump 4.9% off my Aug 22 low by September 1 after monthly withdrawals. \n\nIt's difficult but I'll keep plugging away until I get there.", "score": 1, "replies": []}]}
{"title": "‘Barbie’ Opens to Record-Setting $155 Million, ‘Oppenheimer’ Shatters Expectations With $80 Million Debut", "selftext": "https://variety.com/2023/film/box-office/box-office-barbie-oppenheimer-opening-weekend-shatter-records-1235677601/\n\n>“Barbenheimer” is more than just a meme. It’s a full-fledged box office phenomenon. Over the weekend, moviegoers turned out in force for Greta Gerwig’s neon-coated fantasy comedy “Barbie,” which smashed expectations with $155 million to land the biggest debut of the year. But they also showed up to see Christopher Nolan’s R-rated historical drama “Oppenheimer,” which collected a remarkable $80.5 million in its opening weekend.\n\n>Hundreds of thousands of ticket buyers refused to choose between the seemingly different blockbusters with twin release dates. So they opted to attend same-day viewings of “Barbie” and “Oppenheimer,” turning the box office battle into a double feature for the ages. The craze known as “Barbenheimer” worked together to fuel the biggest collective box office weekend of the pandemic era, as well as the fourth-biggest overall weekend in history. It’s worth noting the top three weekends were led by the debuts of sequels in massive franchises, “Avengers: Endgame,” “Avengers: Infinity War” and “Star Wars: The Force Awakens.”\n\n\nHow do you think this will effect the media stocks? Specific companies involved with both films would be WBD produced Barbie. CMCSA produced Oppenheimer.  Following Netflix earnings and the actors strike sentiment around the sector became negative. Will this help with the narrative that the box office is back?", "id": "157hxt5", "created_utc": 1690126659.0, "score": 1416, "upvote_ratio": 0.93, "num_comments": 363, "comments": [{"body": "\n>Barbenheimer” is more than just a meme. It’s a full-fledged box office phenomenon.\n\nThis is the kind of thinking that gets you to put morbius back in theaters.", "score": 324, "replies": [{"body": "ITS MORBIN TIME", "score": 86, "replies": [{"body": "It's Oppenheim", "score": 22, "replies": [{"body": "Oppenteim", "score": 1, "replies": []}]}, {"body": "Barbin' time 💅🏻", "score": 23, "replies": []}, {"body": "Another meme reference which got popularised by the social media", "score": 3, "replies": [{"body": "What if I told you that you were on the social media right now", "score": 1, "replies": []}]}]}, {"body": "Morbius was a good movie. I watched it -2 times. They should put it back in theaters so I can convince my friend to not watch it again", "score": 21, "replies": [{"body": "Sony completely misunderstanding the meme and re-releasing Morbius is one of the funniest things ever to happen with movies.", "score": 8, "replies": []}, {"body": "I remember people saying this thing when the movie was released, and Sony corporation thought that it is a genuine complement by the audience. They completely failed to realise that it is a joke", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -9, "replies": [{"body": "If you do not like the movie then it is completely your personal opinion", "score": 2, "replies": []}]}, {"body": "They actually should for a third time. Last time I wanted to see it but had to walk my dog. I swear I'll go see it the third time!", "score": 1, "replies": []}, {"body": "Memes are the only reason why this movie has been performing so much better on box office", "score": 1, "replies": []}, {"body": "It’s a meme made by old executives to convince Zoomers to spend money", "score": 1, "replies": []}]}, {"body": "Buy shares of Ryan Gosling", "score": 875, "replies": [{"body": "always thought it would be cool to buy stock in celebrities… missed out on some underground musicians who are huge now", "score": 190, "replies": [{"body": "With some companies you kinda are buying stock in the CEO so that's kind of a \"celebrity\" stock. See: TSLA", "score": 69, "replies": [{"body": "That’s the only one I can think of..  what other stock would people buy or not buy because of the CEO, Jensen Huang? Tim Apple? (Jobs before he passed for sure), Lorenco Concalves is a character", "score": 25, "replies": [{"body": "Berkshire", "score": 50, "replies": [{"body": "Yep. Buffett is probably the number 1 example of this. Despite BRK not changing their portfolio at all you know when Buffett dies it’s gonna drop a ridiculous amount for no reason. I say no reason because he has a whole team that decides the portfolio at this point, he probably doesn’t make the majority of trade decisions anymore.", "score": 34, "replies": [{"body": "I've got money set aside for when that happens, because you're absolutely right.", "score": 22, "replies": [{"body": "$20?", "score": 10, "replies": [{"body": "Woah, big spender. I was saving two buffalo nickels.", "score": 10, "replies": [{"body": "I think he means he's waiting for it to sell off to $20 per share before buying in 😄", "score": 2, "replies": []}]}, {"body": "You would require much greater amount of money to have any stake in that", "score": 1, "replies": []}]}, {"body": "I would be saving my money for this in future, if it really happens", "score": 2, "replies": []}]}, {"body": "This is what people expect to happen. It might soar when he dies as investors might expect positive changes", "score": 11, "replies": [{"body": "Agreed. It’s priced in. Look what happened when Jobs died - Apple soared.", "score": 5, "replies": []}]}, {"body": "It will be short term. Look at Apple Jobs gone but still chilling.", "score": 3, "replies": [{"body": "If I am getting a decent amount of profit in short term , then what is wrong", "score": 4, "replies": []}]}, {"body": "I think he'd be stupid to since he's so old.", "score": 1, "replies": []}, {"body": "Meh, BRK will increase not decrease imo when Buffet dies.  \n\nWhy?  Potential changes to sell off or restructure the business to help show its value better.  Right now it’s a bit of a mystery box in how all the divisions are contributing.  \n\nSo, there could be spin offs, new investment, etc.  All from someone in charge who isn’t in the diaper wearing part of their life (all respect to Buffet, but most 80+ year old people are barely active enough to concentrate through conversation through a meal let alone run a corporation)", "score": 1, "replies": []}, {"body": "The kind of people who are invested in BRK.A aren't the one who is going to sell as soon as he dies.", "score": 1, "replies": []}, {"body": "They are probably more examples of this if you try to find it", "score": 1, "replies": []}]}]}, {"body": "I love how you dropped Tim Apple in there and no one noticed and or said anything.", "score": 5, "replies": [{"body": "Everyone know that Apple have a lot of potential left in there company", "score": 4, "replies": []}, {"body": "His little hands typed it by accident.", "score": 2, "replies": []}]}, {"body": "JPMorgan ?", "score": 4, "replies": [{"body": "It is already a joint corporation which is out of danger always", "score": 1, "replies": []}]}, {"body": "Nike and Virgin CEOs were celebrities for a while.", "score": 3, "replies": [{"body": "They are trying to hire some new celebrities in order to increase their popularity", "score": 3, "replies": []}]}, {"body": "Dimon JP Morgan \n\nIger Disney", "score": 3, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": ">META\n\n??!!", "score": 1, "replies": [{"body": "Say what you want about the moral direction of social media and Zuck’s role in that, but there’s absolutely no denying he’s a fantastic CEO and business mind.", "score": 1, "replies": [{"body": "“And business mind” is missing the /s", "score": -4, "replies": [{"body": "Only a fool would think that.", "score": 1, "replies": []}]}, {"body": "Maybe... I see it as a risk that he owns so much of the company.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Mascot CEO would be more accurate", "score": 1, "replies": []}, {"body": "Who’s married to Kim Jong Un", "score": 1, "replies": []}]}]}]}, {"body": "There is nothing wrong in investing your money on someone you trust", "score": 2, "replies": [{"body": "Indeed", "score": 1, "replies": []}]}, {"body": "If you bought $1000 of Apple around Jobs's return in 1997, when everyone was predicting the company's demise, you could have bought it at a split-adjusted 14 cents a share. Today that investment would be worth about $1.4 million. Although you would have had to resist the urge to sell it when it was worth, say, $10K.", "score": 1, "replies": []}]}, {"body": "No actually I also thought that it would be a great idea", "score": 5, "replies": []}, {"body": "A yes, buying hot air!", "score": 1, "replies": []}]}, {"body": "didn't people try to do that with nft and alt coins? 😅", "score": 6, "replies": [{"body": "fantex before that", "score": 2, "replies": []}, {"body": "NFT coins where already out dated and had no future", "score": 1, "replies": []}]}, {"body": "Closest proxy is trading cards which is far more prevalent with athletes. People that bought Ohtani or Mahomes cards years ago have done extremely well.", "score": 5, "replies": [{"body": "Nowadays people have started to put their money in betting on sports", "score": 2, "replies": []}]}, {"body": "As usual, [David Bowie was way ahead of everyone else and did this in 1997.](https://www.investopedia.com/terms/b/bowie-bond.asp)", "score": 2, "replies": []}, {"body": "If you could buy stock of certain celebrities, then gatekeepers would become multibillionaires (if they aren't already).", "score": 2, "replies": []}, {"body": "You’re joking but that’s actually possible: https://humanipo.app/", "score": 2, "replies": [{"body": "Looks like a scam. A real share would mean that I 'own' a piece of that person which would be ludicrous.", "score": 24, "replies": [{"body": "Even I don't know if it is a scam or a genuine scheme", "score": 7, "replies": []}, {"body": "It looks like a rehash of this: https://www.theguardian.com/sport/2021/mar/28/football-index-how-stock-market-ended-up-costing-customers-millions\n\nWhen it all went tits up it turned out there were mugs who used it for their savings and had thousands invested who \"thought it was safe\".", "score": 2, "replies": []}]}]}, {"body": "There are some crypto projects that are trying to do this. Idk if it will ever take off but it’s an interesting idea.", "score": -3, "replies": [{"body": "That would just not make any sense at all, it would just be a scam", "score": 7, "replies": [{"body": "There is a slight probability that it would be a scam, but we don't know right now. We cannot clearly say anything until we have solid evidence regarding this, and if without evidence we declare it is a scam than it would be unfair", "score": 0, "replies": [{"body": "How would an actor sell part of themselves? I seriously doubt any actor would sign away their future earnings away?", "score": 1, "replies": []}]}, {"body": "He already said they were crypto projects, no need to be redundant.", "score": 1, "replies": []}]}, {"body": "Many people have already lost their trust in cryptocurrency", "score": 1, "replies": []}]}, {"body": "https://www.cnbc.com/2015/11/23/fantex-pulls-ipo-whats-next.html", "score": 1, "replies": []}, {"body": "BBC had a show about it\n\nhttps://www.celebdaq.co.uk/", "score": 1, "replies": []}, {"body": "I would have lost my ass on some EDM artists. Probably would have made a buttload on some meme rappers though. Only if I sold at the peak.", "score": 1, "replies": []}, {"body": "Man I'd be rich over night", "score": 1, "replies": []}, {"body": "I'd buy the hell out of Jenna Ortega.  That girls gonna be one famous actress in the coming years.", "score": 1, "replies": []}, {"body": "It would actually be interesting idea to invest in the celebrities. Imagine getting a lot of return on your investment, if the recently launched movie of your celebrity performs well on the box office", "score": 1, "replies": []}]}, {"body": "Why? He's just... Ken", "score": 13, "replies": [{"body": "And he’s kenough", "score": 7, "replies": []}]}, {"body": "He is not a public property and his manager would not allow you to do that", "score": 4, "replies": []}, {"body": "So hot right now.", "score": 2, "replies": []}, {"body": "Buying /RG futures.  Got it", "score": 0, "replies": []}, {"body": "I hate beer.", "score": 0, "replies": []}, {"body": "Shit I bought into SJP!", "score": 0, "replies": []}]}, {"body": "Not entirely surprising, although they've blown even the upper end of their projections completely out of the water. When booking my tickets last week almost every single screening was almost completely sold out here in the UK. I can't even see Oppenheimer until next week in Imax.\n\nDon't be mistaken though. Mattel ain't gonna be able to replicate this success when it comes to the *checks notes* 45 other projects they have planned.\n\nBarbie is a world known IP being directed by a world class filmmaker, and the release of Christopher Nolan's potentially best film yet, almost completely juxtaposed to it in style has managed to create the meme that we're all aware of. There ain't gonna be another Barbenheimer effect and extrapolating anything from this other than *people will go out to see good movies with excellent writing* is useless. There's not theatre fatigue or superhero fatigue. It's mediocrity fatigue.\n\nBuild it (and have an excellent marketing campaign), and they will come.", "score": 451, "replies": [{"body": "I work in the film industry, IATSE member of the costume department (I'm a costume builder). I completely agree with you on the phrase \"mediocrity fatigue.\"\n\nPeople always ask why did that TV show or film, which has so much potential, shit themselves? Usually studio executive meddling.\n\nI once worked on a feature film where I spent an entire week working on a very high level couture looking pair of shorts. Very cool design, it had gone through approvals. And then the head of Paramount said in the last minute they actually didn't like it.\n\nI spent 2 days working extra over time to change it to the most basic ass mini skirt ever. It was going to camera in 2 days.\n\nThen that entire scene got cut from the film anyways. We never see that costume except for a glimpse in the trailer. It was a horrible film anyways which was disappointing, the costumes were really gorgeous. We worked hard on them.\n\nThese people are just fucking around, wasting money and time. This isn't the only story I have. I've been paid tons of over time (double and triple time) to cater to their whims.\n\nThat film I worked on blew up to 110 million dollars on crap compared to John Wick which spent up to 30 million. Could have made 4 John Wick films instead of one steaming pile of shit which did poorly at the box office. \n\nThe system needs a rework. Less mediocrity.", "score": 157, "replies": [{"body": "Studio Execs and CEOs are in the same class of: the good ones we never hear about and the the ones who’s names are always in emails or even worse headlines? They’re actively making the company worse.\n\nExcept Lisa Su. She can’t stay.", "score": 30, "replies": [{"body": "> She can't stay\n\nWhy do you want Lisa Su to be dumped?", "score": 5, "replies": [{"body": "they had some relationship problems, which they would never discuss in public", "score": 4, "replies": []}, {"body": "Can*", "score": 1, "replies": []}]}, {"body": "Both studio and production house has done a excellent job", "score": 1, "replies": []}]}, {"body": "Sounds like tech. Notes from who? Why does this person’s input even matter? Things get so watered down it’s soul crushing after a while.", "score": 7, "replies": [{"body": "In every relationship there is slightly argument between the couples", "score": 1, "replies": []}]}, {"body": "No one would be complaining about the costumes which have been used in this movie", "score": 8, "replies": []}, {"body": "Which movie did you say it was again", "score": 4, "replies": [{"body": "Even I am not able to recall the name of that movie from past", "score": 4, "replies": []}, {"body": "Mortal Engines", "score": 1, "replies": []}]}, {"body": "> Less mediocrity.\n\nif you take away the mediocrity, what are the families of the CEOs gonna do? get an actual job?", "score": 2, "replies": []}]}, {"body": "> There's not theatre fatigue or superhero fatigue. It's mediocrity fatigue.\n\nI'm getting fatigue just having to comment this in /r/movies, every time there's a \"ARE SUPERHERO MOVIES DEAD\" post", "score": 32, "replies": [{"body": "People have lost their interest in superheroes movie because of the over saturation. Most of the superhero movies are not doing well on box office because of the Marvel and Disney production", "score": 9, "replies": []}, {"body": "Lol yeah same. Most people in that sub have no fucking clue about the movie industry tbh.", "score": 12, "replies": [{"body": "And that is completely a normal thing because everyone cannot have knowledge about everything", "score": 1, "replies": [{"body": "Sure, but the certainty with which they post is astounding. Just like the people parroting that 'go woke go broke' nonsense in investing subs.", "score": 1, "replies": []}]}]}, {"body": "I would happily still bd going to Marvel movies if they had maintained the same quality post-Endgame, but they haven’t and I only have so much money/time, so I stopped after the third or fourth boring disappointment. I went to GOTG when it actually got good reviews and feedback but won’t be going to others unless they also have good reviews and feedback from people who have seen them.", "score": 3, "replies": [{"body": "I would still blame Marvel movies for the oversaturation of superhero movies in the box office. Marvel has released some of the worst superhero web series recently and because of them people have lost their interest", "score": 4, "replies": []}]}]}, {"body": "Yeah they have a Uno movie coming....", "score": 6, "replies": [{"body": "I am sure that no one would be interested in watching that movie", "score": 8, "replies": []}, {"body": "But why?", "score": 1, "replies": []}]}, {"body": "There are not of positive sides of this movie if you observe", "score": 6, "replies": []}, {"body": "And that's why you gotta pay your writers and actors.", "score": 2, "replies": [{"body": "So they can write more shitty sequels!", "score": 8, "replies": [{"body": "Sequels can be good if they hier good story writer, and work on their direction", "score": 6, "replies": []}, {"body": "No. So they can write more shitty remakes.", "score": 5, "replies": [{"body": "I know, Let’s race swap the characters", "score": 4, "replies": []}]}]}, {"body": "Production houses are not ready to pay a decent amount of money to story writers", "score": 1, "replies": []}]}, {"body": "Oppenheimer may have been his worst and I haven’t even seen tenet. It was more unbearable than Dunkirk. An hour too long and centered around politics rather than the science. Very poor route chosen by Nolan.", "score": -7, "replies": [{"body": "Nolan is the most over rated director. His plots are convoluted, audio sucks, not good at directing action, dialog is not that great, I could go on. Not saying his movies are bad, he's just no Kubrick.", "score": 1, "replies": [{"body": "He has been overrated by the audience who cannot understand basic physics", "score": 4, "replies": []}, {"body": "His audio has been bad. And he’s said he prefers background effects to be louder. It’s very obvious on surround sound systems where dialog is completely drowned out, both Dark Knight and Inception come to mind. \n\nI think he’s lost it. Dark Knight Rises and Dunkirk were the fall. How do you mess up taking Dark Knight formula, imo the greatest comic book film of all time, and then create complete garbage on follow up. And how do you make a war movie boring? \n\nI didn’t bother seeing tenet in theaters and only reason I thought to here was all the hype around 70mm imax, which baffles me because he managed to make the first nuclear explosion feel completely underwhelming and anticlimatic.", "score": 0, "replies": [{"body": "I think his audio choices work great when it's in a nice theater blasting your balls off but at home its just obnoxious less you turn it up extremely loud.\n\nAlso I thought dkr was forgettable but I fucking loved interstellar and Dunkirk. Tenet sucked asshole.", "score": -1, "replies": [{"body": "No interstellar is one of his best and one of my most cherished imax experiences. Along with Dark Knight and Inception. \n\nBut those are not his latest work. I really did not like Dunkirk. The pacing was terrible and nothing really happened during the movie except strafe runs of the beach and the sinking of a ship.", "score": 5, "replies": []}, {"body": "He has worked with some of the best sound directors in industry", "score": 1, "replies": []}]}, {"body": "The only good thing in his movies are the soundtrack and story", "score": 1, "replies": []}]}]}]}, {"body": "Are my $MAT shares finally going to break even?!", "score": 1, "replies": []}]}, {"body": "The real winner is the theater selling $7 drinks and $10 popcorn.  The movie ticket was only $8.50.", "score": 441, "replies": [{"body": "Where are you find movie tickets that cheap? Even with matinee it came well over $10 + tax", "score": 192, "replies": [{"body": "Stillwater, OK.  It was matinee rates.  I went with wife and young daughters plus thier aunts.  Tickets cost less than concessions for the group.  This was the first movie I went to in about 6 years.  I'm 42(m) and I thought it was funny and entertaining movie.  I really didn't know what to expect but I enjoyed it.", "score": 40, "replies": [{"body": "Does Stillwater still just have the one theater off north Perkins? Go Pokes! I miss Stilly a lot.", "score": 16, "replies": [{"body": "Yes.  If it's been a while since you've been there they now have all recliners.", "score": 4, "replies": [{"body": "You would find a lot of cinema halls where you would find cheap tickets", "score": 1, "replies": []}]}]}, {"body": "My 70mm imax Oppenheimer tix were like 27 bucks each, and it will be worth it haha", "score": 8, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "I don’t want to, it’s just how much they are. Wanna try 70mm imax", "score": 1, "replies": [{"body": "What did you think? I was so shocked at how many scenes weren’t in focus.  I kept thinking “pull the focus to the eyes, pull it to the eyes….PULL IT!” I kept thinking how much more noticeable it would have been in an imax theater.", "score": 1, "replies": [{"body": "Haven’t seen it yet! So few theatres doing 70mm imax and I bought the tickets last minute…they’re for mid august lol. Didn’t want the front row", "score": 1, "replies": [{"body": "Well when you do watch it, see if the out of focus shots drive you as crazy as they did me.  I asked my friend about it after we saw it together and he said the same thing.  We are both photographers but I have to believe the average person can see it too.  I counted no less than 10 shots where the eyes and mouth are out of focus but the ears are in focus.  Not sure if it’s the imax cameras or I just noticed becuase the screen was so large but I figured Nolan wouldn’t have kept those takes but I guess he did.", "score": 1, "replies": []}, {"body": "I just discovered this article after I wondered about the shallow depth of field.  Pretty interesting.  https://ymcinema.com/2023/07/25/the-lenses-behind-oppenheimer-modified-panavision-and-an-imax-snorkel-lens/", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Tulsa matinee at Cinemark was $8.50", "score": 6, "replies": []}, {"body": "I am literally just about to go there!", "score": 1, "replies": []}, {"body": "There are lots of third world countries where watching movie is not even expensive as compared to American standard. For example you can watch movie in India in less than $10.", "score": 1, "replies": []}]}, {"body": "I go to a local non-profit theater\n\nTickets are 8$, they sell beer, and the popcorn is 10/10", "score": 4, "replies": [{"body": "There are lots of movie theatres which serve free popcorn along with ticket", "score": 5, "replies": []}, {"body": "A non-profit movie theater?  That's interesting.  Could you send a link to their website, I'd like to learn more.", "score": 1, "replies": [{"body": "https://www.grandintheatre.com/about", "score": 1, "replies": [{"body": "Thanks.  We have a place like that here but they don't do movies as much and are largely touring productions but also rent it out for weddings and events, plus do live bands.  For some reason I thought you were referring to a place that does new movie releases, not just classics like many do.", "score": 1, "replies": [{"body": "They do new movie releases! They did Oppenheimer and Barbie this weekend, and I’ve gone to see most block busters there.\n\nThey only screen big block busters on the weekends though, Thursday-Sunday", "score": 1, "replies": []}]}]}]}]}, {"body": "Where the fuck you finding a tub of popcorn for $8?", "score": 2, "replies": [{"body": "You would have to search for cheap restaurants which would be able to serve you popcorn", "score": 2, "replies": []}]}, {"body": "I saw Oppenheimer for $5 this morning in LA at a theater with discounted matinees on Sunday. You can always find a good deal!", "score": 1, "replies": []}, {"body": "Puerto Rico! $7.50 for the ticket and $9 for a huge popcorn and soft drink.  iMax was $10 but sold out", "score": 1, "replies": []}]}, {"body": "Oppenheimer IMAX 70mm is almost $30 per ticket. Worth it though.", "score": 49, "replies": [{"body": "I got mine for 20 bucks each. Indianapolis.", "score": 5, "replies": [{"body": "It is still expensive if you compare it to other third world countries", "score": 5, "replies": [{"body": "It was $10 in Puerto Rico this week but was sold out.", "score": 1, "replies": []}]}, {"body": "Saw Barbie at Tibbs for pretty cheap as well", "score": 3, "replies": [{"body": "I would decide to make my own home a theatre, that would provide me more personalised experience. And in long run I would be able to save a lot of money for sure", "score": 1, "replies": []}]}]}, {"body": "$14 for Oppenheimer in 70mm here in Portland (ordered online so there was a $2 fee). Reasonably priced concessions, too. I love my local theater.", "score": 3, "replies": [{"body": "Which theater did you see it at, I was curious which ones had screens 70mm besides Bridgeport?", "score": 3, "replies": [{"body": "The Hollywood. They have regular showings of 70mm films. I saw Hateful Eight there when it came out.", "score": 2, "replies": [{"body": "There are lots of cinema multiplexes in Hollywood which are operating", "score": 2, "replies": [{"body": "In case you're misunderstanding me:  https://hollywoodtheatre.org/", "score": 1, "replies": []}]}]}, {"body": "Sounds like Hollywood theatre", "score": 1, "replies": []}]}, {"body": "Recently in India, I watched Barbie in a theatre in less than $8", "score": 3, "replies": []}]}, {"body": "AMC A List is cheaper than that and you can get way more free movies per month. Best investment for cinema enjoyers.", "score": 6, "replies": [{"body": "I would completely aggree with it, my brother recently purchased it", "score": 5, "replies": []}]}, {"body": "$23 here in NJ, ~14 with the Tuesday discount, which is the first time I could get good seats", "score": 2, "replies": [{"body": "Even with discount it is still expensive, rather than paying that much amount of money I would wait for it to come on Netflix. My budget does not allow me to spend half of my money on theatres", "score": 2, "replies": []}]}, {"body": "No I am completely fine bro \n\nIam not ready to spend that much money on movie", "score": 2, "replies": []}, {"body": "Portlands Hollywood theatre had it in 70mm non imax for 12 bucks. Fantastic experience seeing it there", "score": 1, "replies": []}]}, {"body": "I’m a big sucker for movie theater popcorn, but I’ll sneak my own water in.", "score": 11, "replies": [{"body": "I’ve gone to AMC theatres and I just carry my huge hydroflask out in the open, no one cares. I really don’t think you have to sneak in water.", "score": 7, "replies": [{"body": "For some reasons the security guard does not even allow you to bring a bottle", "score": 6, "replies": []}, {"body": "For some reason I pictured a camelbak. For a second I thought that was a brilliant idea to stay hydrated during the film.", "score": 5, "replies": [{"body": "It is very necessary to be hydrated while watching something in theatre", "score": 5, "replies": []}]}, {"body": "I live/work at a remote camp and people always brag about sneaking out hot lunch to go during the work day. I ask for packaged sealed seconds to go. You don’t have to sneak lol", "score": 1, "replies": []}]}, {"body": "The security guards of the theatre would not allow you to bring anything", "score": 1, "replies": []}]}, {"body": "I have no love of theatres, or especially theatre companies by any stretch. But I recognise that the theatres make almost no money on the movie tickets, and nearly all of their money on concessions. So despite numbers being way higher than what seems reasonable, the prices don't bother me as much when I consider that.\n\n(I do have a major issue with a certain movie theatre company charging to buy tickets online in advance, though.)", "score": 10, "replies": [{"body": "I feel very congested while sitting among people in theatre. I don't understand how does people feel comfortable in such a small place and sitting with strangers", "score": 1, "replies": [{"body": "Our theatres have big recliner seating, and the theatre is usually half-full or less. I don't really notice other people beyond who I went with.", "score": 1, "replies": []}]}]}, {"body": "Jesus. Tickets cost me £5 each in the UK and I bring my own drinks/food", "score": 4, "replies": []}, {"body": "My 2 tickets cost 50 bucks and 40 bucks for popcorn and drinks", "score": 2, "replies": [{"body": "Even without buying popcorn It would still be over my budget", "score": 1, "replies": []}]}, {"body": "€16,50 in the Netherlands", "score": 2, "replies": [{"body": "+ 5-6 for popcorn +4 for soda & 30 minutes of ads and trailers before the movie starts. For the first time I also\nsaw an ad in between the trailers", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "How do you not make money on $7 drinks and $10 popcorn?  The profit margin on these are insane.", "score": 23, "replies": [{"body": "[deleted]", "score": 3, "replies": []}, {"body": "They make money on the concessions. The problem is that they don't make money on the tickets. The vast majority of the ticket cost goes to the studios.", "score": 1, "replies": []}]}, {"body": "AMC, CNK", "score": 8, "replies": [{"body": "Both money pits, mostly the first one. Any short term boost will not fix trends and long-term profitability.", "score": 6, "replies": [{"body": "Yeah. I really can't see theaters staying afloat with how expensive it is now. Keep in mind that younger generations are just *sooooo* used to streaming stuff. I can't see many being enthusiastic on shelling out 10-15 bucks to see one movie when that's about a month's subscription to an entire streaming service.\n\nAnd that's before we get into the snack prices.", "score": 4, "replies": []}, {"body": "I always like to buy dying stocks when they hit a short-term high point due to a one-off windfall. Always buy high and sell low!", "score": 2, "replies": []}]}]}]}, {"body": "Movie theaters are not winning lol. Unless this is a AMC meme in which case I apologize for not catching it.", "score": 3, "replies": [{"body": "How can you not be bullish on AMC after this", "score": -2, "replies": []}]}, {"body": "This is why my son grabs his backpack and we head to the gas station first!", "score": 2, "replies": [{"body": "You're allowed to take a backpack into a theater?", "score": 1, "replies": [{"body": "Oh yah or my wife will bring her big purse if she’s coming lol. They never ask to search anymore. Not sure they can.", "score": 0, "replies": []}]}]}, {"body": "I exited my CNK position earlier this year up over 100% it was fun seeing lots of movies while holding their stock", "score": 2, "replies": []}, {"body": "Buying movie theater snacks in 2023. \n\nJust sneak $2 candy in your pocket like the rest of the us.", "score": -4, "replies": []}, {"body": "Call me crazy, but I was both shocked and thrilled for $10 large popcorn!", "score": 1, "replies": []}, {"body": "Concession prices suck but that's how cinemas make $", "score": 1, "replies": []}, {"body": "i paid $15 for a single ticket last week for mission impossible. it's crazy", "score": 1, "replies": []}, {"body": "It is always the theatre owner who earns maximum profit in such case", "score": 1, "replies": []}]}, {"body": "My strategy to buy black and pink ETFs is paying off", "score": 75, "replies": [{"body": "Crap, I thought it was a gold and blue one that would explode this time.", "score": 8, "replies": []}, {"body": "What are these ETFs?", "score": 0, "replies": []}]}, {"body": "Surprised Oppenheimer has gotten so much buzz and good feedback. I didn’t think the public would have appetite for this genre", "score": 131, "replies": [{"body": "I don't think it's necessarily the genre but more so Nolan's track record of great movies.", "score": 196, "replies": []}, {"body": "It’s Nolan’s name", "score": 90, "replies": []}, {"body": "Nolan’s brand name carries a lot of weight, especially outside US. It’s a huge hit in UK, south-east Asia and the Indian subcontinent.", "score": 54, "replies": []}, {"body": "People watched Shindler's List", "score": 38, "replies": [{"body": "[deleted]", "score": 22, "replies": [{"body": "Imagine how much it would've made if it had Spielberg's name on it.", "score": 19, "replies": [{"body": "[deleted]", "score": -3, "replies": [{"body": "He was making fun of them spelling the name wrong.", "score": 2, "replies": []}]}, {"body": "Fixed. It seems I was so excited to buy a vowel that I went and grabbed the wrong one.", "score": 1, "replies": []}]}]}]}, {"body": "Nolan is like Wes Anderson, where the director’s name is more of draw at this point that the leading actors, plot or genre.", "score": 8, "replies": []}, {"body": "The only reason why this movie is performing well is because of actress", "score": 6, "replies": []}, {"body": "Opening on the same week as Barbie is a stroke of genius. People will credit Nolan (I'm from his alma mater no hate) but the Barbie v Oppenheimer contrast marketing helped the biopic get more visibility.", "score": 9, "replies": [{"body": "Good story, but it actually transpired completely opposite to that.\n\nNolan burned bridges demanding no competing major films to be released on the same day as his.  \n\nOppenheimer set their release date, and as a bit of a jibe, the studio deliberately counter-programmed Barbie to release against it.", "score": 6, "replies": []}, {"body": "Oppenheimer previews during every single movie I saw in the past 9 months probably didn’t hurt, either. (Though to be fair, many folks don’t go to the movies too often… but I assume they marketed it hard in every other avenue. I didn’t even know about the Barbie movie until this week.)", "score": 3, "replies": [{"body": "no way you never saw Barbie ads anywhere", "score": 1, "replies": [{"body": "We live in a fragmented media landscape.", "score": 1, "replies": []}]}]}]}, {"body": "I think morbid curiosity is at the highest it has ever been.", "score": 6, "replies": []}, {"body": "Thats because Hollywood has made you forget that people have an appetite for this genre.", "score": 1, "replies": []}, {"body": "Bro it's a Nolan film, lol....", "score": 1, "replies": []}]}, {"body": "Uranium stocks?", "score": 65, "replies": [{"body": "/u/3STmotivation, now's your chance.", "score": 10, "replies": [{"body": "Of all the catalysts, watch it be this one.", "score": 2, "replies": []}]}, {"body": "Does anyone know where I can get some plutonium", "score": 1, "replies": []}]}, {"body": "Once you account for theater split (50%) movie budget, and marketing, there isn't enough profit to be made off one movie to really move the stock price.  Barbie will probably make a couple hundred million in profit over its lifetime.  \n\nIn 2019, Disney had 9 movies cross a billion in the box office, their studios made over $13 billion in revenue, but only took home $3.4 billion in profit.", "score": 77, "replies": [{"body": "The question is whether or not the moves the needle for Mattel.", "score": 34, "replies": [{"body": "Here's your answer\n\nhttps://youtu.be/yQ_I4bP_1bw", "score": 5, "replies": []}, {"body": "Correct.  MAT has had a big move since fending off rumors of their demise.  But this is about whether they can surge out of the existing range.  \n\nThey've spiked twice in the last 20 years.  If hype and anticipation can do hit those levels again, it would be a triple.", "score": 1, "replies": []}]}, {"body": "Because these movies were mostly terrible? Really high budgets, extremely costly marketing and not that many people went to see them.", "score": -13, "replies": [{"body": "What does \"I didn't like the films\" have to do with it?", "score": 18, "replies": [{"body": "They probably didn't even see the movies because their parents wouldn't drive them to the movie theater", "score": 3, "replies": [{"body": "\"This film is not directly targeted to  all of my interests and cultural references as a 25 year old white suburban american NEET who reads anime comics therefore it sucks and Disney will go bankrupt in\n2̶0̶1̶6̶ 2̶0̶1̶7̶ 2̶0̶1̶8̶ 2̶0̶1̶9̶ 2̶0̶2̶0̶ 2̶0̶2̶1̶ 2̶0̶2̶2̶ 2023", "score": 9, "replies": []}]}]}]}]}, {"body": "Buy shares of Mattel? They got other movies in pipeline which will hopefully get more traction once the strike issues resolve", "score": 19, "replies": [{"body": "The time to buy was a couple of months ago if you thought this movie was going to smash. You’ve missed the boat.", "score": 60, "replies": [{"body": "Bought two weeks ago, just in hopes that Barbie toys and other merchandise sales moving towards the holidays push the stock up too. Let’s see", "score": 16, "replies": []}, {"body": "The stock didn't actually move all that much in the last few months. It was basically at the same level back in february.", "score": 2, "replies": [{"body": "It dipped big in the spring but is up 18% in the past month.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "They got a new CEO back in 2018 and if I’m not wrong, they were actively talking about He-man, Hot wheels & Barney. Wouldn’t be surprised if they green light or make a spin off on Barbie too", "score": 11, "replies": [{"body": "Hollywood has a great influence on the other cinema industries. For example Bollywood of India has been usually influenced by the of culture of Hollywood", "score": 4, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "They are doing it as a promotion activity to attract customers", "score": 1, "replies": []}]}, {"body": "Have you seen the barbie movie? It's a feminist movie targeted at mothers not kids. They're trying to do the bluey effect (very successful Australian kids show) but unfortunately American culture and script writing does not translate well to foreign audiences (the pursuit of authenticity often feels fake). \n\nAs a non American I thought the barbie movie was really poor. You can get a message across without explicitly writing it. Script was poor which was a shame as Ryan Gosling did a great job. \n\nMovie was very much ranty. It's marketing did not indicate how it would be. I'm a mother so I should have enjoyed it. \n\nI know American women seem to enjoy it, but I seriously doubt this will translate for foreign audiences. Not every country is a patriarchal hell scape. \n\nAmerican cinema spoon feeds its audience the exact meaning it's going for and it just comes across fake. Despite the attempt at authenticity, swing and a miss for me.", "score": -3, "replies": [{"body": "American cinema is evolving itself with the duration of time", "score": 1, "replies": []}]}]}, {"body": "I bought $MAT in 2015-2016... what a crappy stock!", "score": 1, "replies": []}, {"body": "They have the rights of transformer and other fantasy movies", "score": 1, "replies": []}]}, {"body": "Get ready for a Mattel Cinematic Universe.", "score": 7, "replies": []}, {"body": "Already priced in", "score": 4, "replies": []}, {"body": ">Merchandising, merchandising, merchandising!\n\n-Yoghurt", "score": 2, "replies": []}, {"body": "I'm skeptical lightning will strike twice, but it is an interesting possibility.", "score": 2, "replies": [{"body": "There is a possibility that lighting would strick twice, but there is no possibility of this happening", "score": 3, "replies": [{"body": "Lol.  touché.", "score": 1, "replies": [{"body": "Though I would be interested to see what a funny creative director could bring to a reboot of Masters of the Universe.", "score": 1, "replies": []}]}]}]}, {"body": "Are you seriously considering investing in them because of a Hot Wheels movie with actors NOT in the Fast and Furious?", "score": 1, "replies": []}]}, {"body": "Should be a good day for CNK and AMC tomorrow. CNK is in a far better position long-term though. Holding mine through Q3 earnings and hoping the strike is resolved soon.", "score": 6, "replies": [{"body": "Both of the shareholders of this company would have been very happy", "score": 3, "replies": []}]}, {"body": "It reminds me of the surprising statistic, where if you have a vending machine selling Coca-Cola, you'll make $100, but if you have two vending machines with one selling Coca-Cola and one selling Pepsi, they'll both make $200 each. \n\nIt's because passerby's go from thinking \"should I get a drink?\" to \"should I get a Pepsi or a Coca-Cola?\"\n\nMaybe that's what happened here. People had the choice so they had fun making it.", "score": 15, "replies": [{"body": "A surprising statistic which you just made up.", "score": 22, "replies": []}, {"body": "Those made up numbers are wildly exaggerated.  But tapping into tribalism can provide a boost, as described.", "score": 2, "replies": []}]}, {"body": "It’s insane Hollywood puts out to original big time movies and people flock to the theaters. Imagine if they staggered release something each month ? Last time I seen a movie in a theater it was top gun, ( well worth it !). Now we are going to see Oppenheimer today .", "score": 13, "replies": [{"body": "I get what you’re saying, but neither of these are technically original. Oppenheimer is a biopic and Barbie is based on an existing line of toys", "score": 8, "replies": [{"body": "Feynman next in the nuclear weapon cinematic universe?", "score": 8, "replies": [{"body": "That would be amazing ngl", "score": 2, "replies": []}]}]}]}, {"body": "Literally reading this as I’m waiting for Oppenheimer to start after my girlfriend and I just saw Barbie", "score": 7, "replies": []}, {"body": "I am shorting Mattel.\nThe Barbie sales in Q4 for holidays will be a disappointment.", "score": 8, "replies": [{"body": "Wouldn’t a huge movie hit like this (which has been described as a huge commercial) increase Barbie sales especially for Christmas? Let alone the licensing fees for anyone wanting to jump on the hype? Shorting a hype seems risky", "score": 10, "replies": [{"body": "No because many underestimate the power mothers wield on Christmas shopping. They do all of it.,\nMany are not pleased after taking their daughters who wanted to see the movie.\nThis is why I took my position. \n\nYes, indeed risky. But I feel this will backfire.", "score": -14, "replies": [{"body": "I see. I feel they will watch it themselves and nostalgia will exactly prompt them to buy a Barbie for their kids.", "score": 8, "replies": [{"body": "Nostalgia is not what you think.", "score": -3, "replies": [{"body": "Tell that to the hordes of adults buying Lego…", "score": 5, "replies": [{"body": "I agree with your sentiment on Legos. \nBut they are not a publicly traded stock. Much different than Barbies. \nI still have my Barbies, but this movie holds nothing for me. \nMy kiddo grew up watching the Barbie cartoon movies. Far better entertainment for kids.", "score": 1, "replies": [{"body": "In afraid you let your personal disappointment of the film guide your trading decision. Many others won’t feel the same way and if it’s truly a new hype then I don’t think your puts will print.", "score": 2, "replies": [{"body": "They’ll print. \nHave you seen the movie? 😆", "score": 1, "replies": [{"body": "Nope certainly haven’t and don’t think it’s for me. But it’s being received pretty well it seems, 7,5 IMDB isn’t bad and 89% rotten tomatoes.\n\nJust like marvel boosted sales for Hasbro by quite a lot and I find most of those movies painfully dull. I think Mattel will milk this, especially if it becomes some sort of trend. \n\nI’m just saying that a thesis that’s build on extrapolation of a personal dislike of the movie to the general public doesn’t seem very convincing. Especially when it’s breaking box-office records.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Betonline posted a fun bet o/u for the opening weekend at like 50 mil. Safe to say that was a no brainier.", "score": 2, "replies": []}, {"body": "This has nothing to do with their debt, so it wont help at all.", "score": 2, "replies": []}, {"body": "Weird times", "score": 2, "replies": []}, {"body": "The marketing for Barbie was insane and they spent a lot. Let’s see if the momentum carries.", "score": 2, "replies": []}, {"body": "You can see Barbie in any theatre but most people want to see oppenheimer in 70mm so they have to wait until the saloons aren’t full. Meanwhile they go and watch Barbie.", "score": 2, "replies": []}, {"body": "With all the creative Hollywood accounting those movies will show actual loss in the books of 2023.", "score": 2, "replies": []}, {"body": "Glad to hear about the box office success of both", "score": 2, "replies": []}, {"body": "This while barbenheimer thing is peak modern society. I hate it.", "score": 1, "replies": []}, {"body": "My neighbor: \"I saw Barbie twice! It was so good.\"\n\nMe: \"Leave planet, when?\"", "score": -13, "replies": []}, {"body": "I loved Barbie. I know I’m not the common stock poster here, but it was super entertaining and had thoughtful moments that are pretty feminine in nature. So what? It’s a fantastic call to tap a massive audience. I also can’t wait to see Oppenheimer so I’m glad theaters are finding ways to come back.", "score": 1, "replies": []}, {"body": "I really don’t understand why there is so much hype in the Barbie movie? Is it just teenage girls or nostalgia or am I missing something?", "score": -7, "replies": [{"body": "Do you know who Greta Gerwig is", "score": 3, "replies": []}, {"body": "Nostalgia + great writing + culturally relevant + big actors + big director + all around entertaining (funny, charming, sad, music, etc.) + a bit of a Rocky Horror Picture Show feel with all the dressing up and the barbenheimer meme. It definitely a movie for all ages (maybe \"PG\"+) and genders.\n\nIt's just an all around great movie, that is thought and emotion invoking while being a lot of fun.", "score": 1, "replies": [{"body": "Lmao", "score": 1, "replies": []}]}, {"body": "Marvel for chicks", "score": -1, "replies": []}]}, {"body": "I’d never go watch Barbie, but sounds like people were expecting a fun kids movie but apparently it was full with misandry. Puts on Disney", "score": -8, "replies": [{"body": ">Puts on Disney\n\nYou realize Disney had nothing to do with Barbie right?", "score": 3, "replies": [{"body": "Lol I’m aware.  I forgot this was on the Stocks sub and not WSB.", "score": 2, "replies": []}]}, {"body": "Only idiots expected a kid’s movie.", "score": 8, "replies": []}, {"body": "A \"G\" movie? No. \"PG\" was pretty appropriate. I would not say it was full of \"misandry\" - I'd say that's someone who misunderstood the movie a bit. \"Girl power\" would be more fitting, but even then I'd say anyone trying to say it was for or against one gender specifically is somewhat missing the point still. I'd say the theme is just... \"Humanity\".", "score": 1, "replies": []}]}, {"body": "Barbie movie really? Brainwashing the masses", "score": -4, "replies": []}, {"body": "I saw Oppenheimer. Wasn’t really a fan. All the time jumps in the first 30 minutes made it super confusing to understand what was going on", "score": -7, "replies": [{"body": "It just felt like a Cillian Murphy acting showcase. He did very well and will get an Oscar nomination by virtue of it being a Christopher Nolan movie, but I had no connection to any of the characters.", "score": 2, "replies": []}]}, {"body": "I suspect it will have a big drop off, as most women do not like watching/paying for a film more than once.\n\nOppenheimer however, has repeat value, so, over a longer period (and with IMAX takings) it will make more money.\n\nI will say this: congrats to the producers of Barbie, just like the plastic toy has manipulated and exploited young girls for decades via Mattel, the movie is doing the same, just for older women in their 30's who are not married.\n\nWell done, you have succeeded in making tonnes of money by doing the very thing you are suggesting men have done.\n\nI hope women everywhere do not realise this, because then they will flay you, figuratively speaking\n\n♥", "score": -13, "replies": [{"body": ">I suspect it will have a big drop off, as most women do not like watching/paying for a film more than once.\n\n\n?????? Very weird thing to say, and two of the longest tail movies I can think of are Titanic and Mamma Mia!", "score": 4, "replies": [{"body": "wtf is a 'tail' movie?\n\nRun some numbers, and tell me which films women will pay money for, versus have someone else pay for them, like, their partner or date.\n\nSometimes they go dutch, but most women will not go on a date and be the one who pays for the movie tickets and the meal, and, the cab ride home, and, the drinks, and, the pop corn, and, the candy, and, the hot dog, and, the nachos.\n\nWhen they are not on a date, they will not dig deep into the purse to pay more than once, unless there really is nothing else to do, or other exceptional circumstances.", "score": 0, "replies": [{"body": "By long tail I mean movies that are in theaters for a long time because people see them over and over, like Titanic, Mama Mia, Avatar, or Top Gun Maverick. Your ideas about women are very weird.", "score": 2, "replies": [{"body": "Right, but, why 'tail' ?", "score": 1, "replies": [{"body": "https://en.m.wikipedia.org/wiki/Long_tail", "score": 1, "replies": [{"body": "Never known that to be used for a movie ticket sales tracking.\n\nThanks for the clarification.\n\nMovie's normally are listed as having a 'run' or 'release' as they have contracts for specific periods of time; 'runs'.\n\nSo, back to your point about Titanic & Mama Mia - are you suggesting the tickets sold were predominately females re-watching the movie?", "score": 0, "replies": []}]}]}]}]}]}, {"body": "How do Barbie dolls exploit young girls? I only ever saw them as a positive toy ( aside from the materialistic aspect of having to buy endless outfits and mcmansions to house them)- telling girls they can be anything they want. \n\nI havent seen a barbie doll in decades,  so maybe they changed from when I was younger? Just curious if I have missed something blatant.", "score": 3, "replies": [{"body": "Well, if you watch the recent behind the scenes/making of promotional videos of the film, you will see and hear the directors and actresses talk about \"When they were young girls\" and, seeing Barbie products behind plastic sleeves, inside boxes, and, how they desired them.\n\nThey KNEW exactly how to manipulate and exploit the sensibilities of young girls, and now, 30+ unmarried women.\n\nBarbie toys are no different than G.I. Joe, or, Star Wars figures with different outfits for snow, forests, underwater, deserts etc.\n\nThose toys exploit the sensibilities of young children - and for $15, Barbie is doing it for adult women.\n\nGo watch the videos of them talking about this - and to be clear again, I am congratulating the producers in their money-making exploits, but will argue that some will not like the anti 'mommy-making' messaging caged within.\n\nThis movie is just about making cash, and WOW, they are bringing in the money, so again: congrats to them, and hope it brings them happiness.\n\nThe opening scene of young girls DESTROYING toys which are babies versus Barbie in a 'stolen' scene from 2001: A Space Odyssey, with HEAVY implication that once young girls do this and EMBRACE Barbie as the defacto standard model of life, then the young girls will have EVOLVED.\n\nKinda undoes the message, but, if you are going to steal a scene from another movie, go ahead.\n\nTelling girls they can be anything they want is one thing: telling girls they can anything they want, except a mother with children is another thing.", "score": -1, "replies": []}]}]}, {"body": "Fuck stocks go buy the collectible toys …", "score": -1, "replies": [{"body": "Toys and action figure has always been the best for studio to earn money", "score": 1, "replies": []}]}, {"body": "Oppenheimer glossed over some very important elements. I was very disappointed.", "score": -8, "replies": [{"body": "Which ones specifically?", "score": 4, "replies": [{"body": "The Rosenbergs.", "score": 2, "replies": []}]}, {"body": "Most of the are finding it as a boring movie because of it's documentation and production style. Most of the movie has been recorded in gray scales, which people is not fan of", "score": 1, "replies": []}]}, {"body": "panem et circenses", "score": 0, "replies": []}, {"body": "It will help the Disney is dead narrative", "score": 0, "replies": []}, {"body": "Is Dead Reckoning getting snubbed?", "score": 0, "replies": [{"body": "Why are you spamming the comment section with a same statement over and over", "score": 2, "replies": [{"body": "Yikes, that was a mistake. Thanks for the heads up.", "score": 1, "replies": []}]}]}, {"body": "Actress famous for opening her legs without panties beats movie about some of the most iconic moments of human history which may put some common sense with a generation hell bent on provoking a nuclear war.\n\nHumanity is really a collection of pussies and dicks .. with the occasional Genuis.. honestly monkeys with mobile phones.", "score": 0, "replies": [{"body": "She is the same actress who did a nude scene in movie with Leonardo", "score": 1, "replies": []}]}, {"body": "Couldn’t pay me to watch either of these movies in theater", "score": -13, "replies": [{"body": "I stocked up on Oppenheimer action figures, going to make a killing", "score": 15, "replies": [{"body": "Oppenheimer has been popular only in third world countries", "score": 4, "replies": []}]}, {"body": "I am sure that you would be ready to watch this movie if someone really pays you", "score": 1, "replies": []}]}, {"body": "And people can’t afford house but willing to spend money on b.S movie, and they complain they don’t have any money…", "score": -37, "replies": [{"body": "Because those people does not want to have long term plans. They just want temporary happiness and their life and that is why they are spending money on movies", "score": 1, "replies": []}]}, {"body": "Not a fan of either movie. I saw them as my wife really wanted to see so I had no choice. \n\nbtw Im not a fan of going to theater to see a movie. germ infested, dirty, un-comfy place to see a movie packed with a bunch of strangers shoving down pop corns and pepsi is something of yesterday's routine. I can wait for a month until these movies become available for streaming and I will watch them at the comfort of my home", "score": -17, "replies": [{"body": "Movie theatre is really dirty place, filled with strangers and is overrated place", "score": 1, "replies": []}]}, {"body": "Not interested in watching either. Rather watch movies made by AI", "score": -3, "replies": []}, {"body": "Sunday is still an estimate", "score": 1, "replies": []}, {"body": "So all the memeing that it was hoped would make Morbius a hit worked for Barbenheimer.", "score": 1, "replies": []}, {"body": "Its gotta be a little easier since movie tickets are like 17 bucks now", "score": 1, "replies": []}, {"body": "Barbenheimer kicked ass, Barbie ended up being darker than Oppenheimer.", "score": 1, "replies": []}, {"body": "Wow….", "score": 1, "replies": []}, {"body": "What record was shattered?", "score": 1, "replies": []}, {"body": "Just a cinematic visualization of data.\n\nBrains ![gif](emote|free_emotes_pack|downvote) ≠ Stocks ![gif](emote|free_emotes_pack|upvote)\n\n[IQ Scores In The US Have Recently Dropped For First Time This Century](https://www.iflscience.com/iq-scores-in-the-us-have-recently-dropped-for-first-time-this-century-67907)\n\n(The biggest drop was found among younger people aged 18 to 22)", "score": 1, "replies": []}, {"body": "I need somebody to explain to me how to profit off this like Margot Robbie in the Big Short", "score": 1, "replies": []}, {"body": "The media hoopla around these 2 movies has been soooo manufactured.", "score": 1, "replies": []}, {"body": "Do guys think that would help AMC?", "score": 1, "replies": []}]}
