{"title": "Microsoft at E3 calls?", "selftext": "I just read Sony isn’t going to be present at E3 for the first time, this means Microsoft is basically is gonna have zero competition, with over 20 titles to announce and the possibility of a new console, this  this would be a good time for calls Ez monies\n\nEDIT: MODS UNPIN THIS SHIT WTF THIS DD WAS POSTED OVER 100 DAYS AGO U GAY RETARDS", "id": "bxwxu6", "created_utc": 1559926502.0, "score": 28, "upvote_ratio": 0.83, "num_comments": 62, "comments": [{"body": "How about AMD though, read something that they may partner with MSFT and that would be disclosed at E3......is this true?", "score": 21, "replies": [{"body": "I’m hoping so.. wouldn’t be a surprised with their tech being in both next generation of consoles that’s for sure, I’ll be holding both for a swing into  week hoping to bounce back from my fat Ls", "score": 5, "replies": []}, {"body": "My calls are hoping for extra tendies", "score": 3, "replies": []}]}, {"body": "$msft has already jumped $10 this week.  I think they have another $10 to go, but not sure if it will happen that soon.", "score": 21, "replies": [{"body": "That next jump will be the JEDI contract in july", "score": 15, "replies": [{"body": "Can’t find the ticker or company what is it? Does it have good volume?", "score": 4, "replies": [{"body": "JEDI is the name for the pentagon's cloud project. if that's what you are asking.", "score": 7, "replies": [{"body": "Thank you but I’m confused is there a ticker for it cause he mention the July contract?", "score": 0, "replies": [{"body": "the JEDI contract is either going to AWS or MSFT so OP is saying MSFT gonna jump because he think MSFT will get the contract so the ticker will be MSFT", "score": 2, "replies": [{"body": "Thank you it all makes sense now I just read a report on it thanks for your help, I’ll keep an eye those July calls then next after E3", "score": 2, "replies": []}]}]}]}]}, {"body": "My thoughts as well.  But if their game streaming service seems like a possible big hit I would also expect a bump.", "score": 0, "replies": []}]}, {"body": "Their showcase is this Sunday, hoping at least couple more dollars jump after that. In going in for the swing fuck it, wish me more than luck wish me prosperity and freedom of abundance baby.", "score": 8, "replies": [{"body": "maybe condor it.... either people are excited and it jumps... or they blizzard the show and it dumps", "score": 1, "replies": [{"body": "Dead ass thought about it bro before I locked it but I don’t know my instinct and gut feeling just told me lock in calls. They’re saying this E3 is gonna be Xbox’s best one yet. Will find out Monday though just bear with me brotha I can’t lose anymore than I did on that shitty company zumiez earnings", "score": 4, "replies": [{"body": "Microsoft is under a lot of pressure to do something that doesn’t suck. They have been repositioning their gaming stance over the past two years and I think they will definitely have something good to show for it. We are heading into next console gen territory and Microsoft has been pushing integration a lot with both Nintendo and PC. I think they are set up for some pretty sweet gains.", "score": 2, "replies": []}]}]}]}]}, {"body": "I need this I lost 1.5k on fucking zumiez on there unexpected ER", "score": 6, "replies": []}, {"body": "Have you looked at prior moves by MSFT around E3? I wouldn’t expect much as I don’t think gaming is a huge profit center for them", "score": 4, "replies": [{"body": "Are you kidding?? You know how much Xbox  rakes in money for them?? And exactly I have but this E3 is different Sony isn’t showing up, that’s a first time ever, and even if that’s considered priced in already their is still a possibility of an advantage", "score": -6, "replies": [{"body": "Gaming is just under 10% of their total revenue. They didn’t get to be a $1T company because of gaming. Sony is overall much more dependent on PS revenue than MS is on Xbox so I’m not sure the comparison is right when it comes to each company’s stock response to gaming related news.\n\nLet us know how it goes - I’m happy to be proven wrong here", "score": 6, "replies": [{"body": "I understand that 1T part, and that was cause of how bad the launch of Xbox was the first 2 years, sales weren’t great and PlayStation overall chewed them up and was till the announcement of the S and an Xbox without Kinect they started to recover. My point in this post is all I’m trying to say is I hope their Announcements are good to the point it moves the stock up a BIT, not sky rocket, for gains on calls that’s it, and thank you I’m hoping I’ll be able to prove you wrong hopefully.", "score": 1, "replies": [{"body": "MSFT is a great long no matter what, really. One of the strongest, most resilient stocks in the entire market (if not THE most)\n\nLook at this week - below 120 and back to a new ATH 4 days later. Look at the Q4 selloff - it got hit but not NEARLY as hard as other tech, and was again back chewing through new highs before almost anything else was. I actually have shares (shh don’t tell anyone) - that’s how much I like it.", "score": 5, "replies": []}]}]}]}]}, {"body": "I already got calls 😎", "score": 4, "replies": [{"body": "Got mine locked when I made this post brotha, let’s get this coin 💰💯", "score": 3, "replies": [{"body": "Hell yea!", "score": 2, "replies": []}]}]}, {"body": "Good observation might look into it", "score": 3, "replies": []}, {"body": "You just read Sony wasnt gonna be there? That's been out for a while my guy", "score": 3, "replies": [{"body": "Okay what difference does it make?", "score": 1, "replies": [{"body": "Means it's been priced in for a while", "score": 3, "replies": [{"body": "Still doesn’t change the fact they haven’t had their conference yet and we can expect big things from them", "score": 4, "replies": [{"body": "Yeah but that's not dependent on whether or not Sony would be there, so I dont exactly get the point you're trying to make", "score": 1, "replies": [{"body": "Point is in the post, Microsoft is gonna have zero competition when it comes time to their showcase, announcing quite a lot of games, features and the possibility of a new console means it’s a good time for calls", "score": 5, "replies": [{"body": "I thought they weren’t announcing the new console till next year", "score": 0, "replies": [{"body": "Keyword possibility** they’ll probably tease something and I wouldn’t be surprised since Sony already showed off the capability of the PlayStation 5", "score": 2, "replies": []}]}, {"body": "All the hype from E3 has been priced in, that includes the possibility of a new console, and all the games, etc. Which means if they dont release the expected products, it's not gonna move much/lower. The fact Sony isnt gonna be there, is not only old news, but is irrelevant. \n\n\nBy that logic, any time apple has a conference, they should skyrocket because Samsung and Google aren't there", "score": 0, "replies": [{"body": "I mean I guess, even if it’s priced in, this the first time Sony ever not showing up at E3 so there’s still hope with my logic, it’s not really irrelevant, we’re talking about the gaming industry and event here not apple or google products.", "score": 1, "replies": [{"body": "I’m pretty sure Sony is having their own conference.\n\nEdit: Nvm. Haven’t checked news in a while.", "score": 2, "replies": [{"body": "Was about to say link please?! Scared me there g", "score": 1, "replies": []}]}, {"body": "Yeah, apple and Google products which are much bigger and more volatile to news. \n\nSony has all but announced the ps5", "score": 1, "replies": []}]}, {"body": "And I never said skyrocket you moron I said move  a few bucks meaning 1-3$ dollars, profit is profit and you can never go wrong from that", "score": 1, "replies": [{"body": "I mean still, Apple has moved downward after announcements", "score": 1, "replies": [{"body": "Again we’re talking about a gaming event and company showcasing gaming products , where do you see apple and google dominating the gaming industry? Which products please tell me?", "score": 1, "replies": [{"body": "Well I mean apple and Google are like hardcoring going into the gaming industry (specifically cloud based gaming, ex the reason Sony and Microsoft just partnered up), and have been for a while. Based on the incompetence you just displayed in your comment it seems you're really not worth my time lol\n\nAlso the fact you couldn't get the point I was trying to make with Google and apple shows a level of stupidity too high, even this sub", "score": 1, "replies": [{"body": "Then get the fuck off my thread idiot, obviously stupider than me to say you’re not worth my time and still respond back", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Good DD but my concern is that all of this news is already priced in. You may get lucky though depending how the market reacts to their new announcements.", "score": 6, "replies": [{"body": "Yeah that’s why I’m not giving my hopes up, I’m hoping these new announcements that haven’t been announced yet won’t be considered priced in and will least bump it up 1-3$ dollars coming Monday", "score": 1, "replies": []}]}, {"body": "Why is this thread showing up as 114 days old.", "score": 2, "replies": []}, {"body": "Fucking nerd", "score": 1, "replies": [{"body": "Guarantee I’ll fuck your bitch", "score": 7, "replies": []}, {"body": "This nerd making money bitch fuck you and you’re ugly ass personality, little dick energy you got", "score": 7, "replies": []}]}, {"body": "Dumb to introduce new consoles. Cloud is the future as google as shown. Microsoft had their own server to show off Azure. So they’ll likely make the next gen of gaming run on their servers as well rather than relying on physical consumer hardware. Subscription based future.", "score": 2, "replies": [{"body": "/u/nwordcountbot /u/horselesshorseman", "score": 4, "replies": [{"body": "Thank you for the request, comrade.\n\nhorselesshorseman has not said the N-word yet.", "score": 4, "replies": [{"body": "Then I don't trust his opinion on xbox", "score": 3, "replies": [{"body": "Lmao", "score": 3, "replies": []}]}]}]}, {"body": "I don't think consoles are going anywhere anytime soon. I don't see Google stadia making a dent in the market. I agree that streaming will be the future, but not in the near future.", "score": 3, "replies": []}, {"body": "Lol cloud definitely is not the future of gaming.  It's the current hype only. The Scadia offering is pathetic and Google will cancel the service in 2 years guaranteed.", "score": 3, "replies": []}, {"body": "Think you’re right but there’s still a lot money to be made from physical products, think this is the last generation we will see for sure with consoles. One more rodeo and that’s it, note the cycle is only 4 years so it’s not that much. Cloud based gaming is only beginning to be introduced, people and consumers are still on the fence about it, but it will be the future.", "score": 2, "replies": []}]}, {"body": "Pinned huh? Alright! Welp, cya later!", "score": 1, "replies": [{"body": "I didn’t pin shit you fkin autist I don’t know why this shit is showing up now when it was post over 100 days ago", "score": 1, "replies": [{"body": "My comment was towards the mods not you.", "score": 1, "replies": []}]}]}, {"body": "I got calls too but just because they dipped on Friday and they're a reliable company", "score": 1, "replies": []}]}
