{"title": "Credit Suisse initiates Tesla coverage, sees 15% downside amid competition", "selftext": "", "id": "c5yjj7", "created_utc": 1561595184.0, "score": 11, "upvote_ratio": 0.69, "num_comments": 58, "comments": [{"body": ">Tesla will have to “settle as a niche automaker”\n\nWhile I'd listen to an argument about low profitability, there is no way in hell Tesla is settling to be a niche automaker by volume.", "score": 40, "replies": [{"body": "What. Ever. Did any of these analysts pay attention to the [Sandy Munro breakdown of a Model 3](https://youtu.be/bYZBCaOzjY8) ? It’s like Elon went to Mars and brought back an alien vehicle. The Model 3 has so little in common with the Chevy Bolt, because the Bolt follows Detroit’s philosophy on making vehicles.\n\nTesla is so completely Apple here, and Detroit is so totally locked in the Innovator’s Dilemma. Just go watch the radical difference in how the car‘s guts are designed.\n\nThen go learn about the ways they are reducing costs while delivering the same high quality product. Niche? Hard to believe.", "score": 15, "replies": [{"body": "Sandy Munro is a Tesla shill. He knows nothing about this stuff. Mark Spiegel on the other hand, is knowledgeable and unbiased source of information. He says the Chevy Bolt will destroy Tesla.\n/s", "score": 7, "replies": []}]}, {"body": "And Tesla is absolutely crushing the competition with EV sales without even investing in marketing.\n\nSo saying they are niche comes down to saying EVs are irrelevant. Just like BMW said in the same day... What a coincidence.", "score": 2, "replies": [{"body": "> And Tesla is absolutely crushing the competition with EV sales without even investing in marketing.\n\nThis is not quite true. They incurred $70 million in marketing, promotional and advertising costs last year. This is much less than what other auto manufacturers spend, but not zero.", "score": 2, "replies": []}, {"body": "Yeah, the BMW news today is outrageous. I guess virtually everyone else is wrong and BMW will lead the future.", "score": 1, "replies": []}]}]}, {"body": "Be patient, for next week shall be the week of upgrades.", "score": 20, "replies": [{"body": "Elon will deliver tendies to the faithful.", "score": 11, "replies": [{"body": "Elon will deliver cars to the brethren", "score": 5, "replies": []}]}, {"body": "Amen", "score": 3, "replies": []}]}, {"body": "\"Levy pointed to VW's going  \"all in\" on electric cars and commitments to  launch 70 new battery electric vehicle cars in the next decade and  invest more than $34 billion around vehicle electrification, he said \"\n\n&#x200B;\n\nDecade!? We're seriously waiting another 10 years for VW to do shit? Good god!", "score": 17, "replies": [{"body": "[The analysts of Credit Suisse Group have rated Volkswagen (VW) vz with a Outperform rating. The price target was set to 201.00 €. (Feb 2019)](https://markets.businessinsider.com/analysts-opinions/volkswagen-vw-ag-vz--outperform-665874) \n\nCurrent VW Stock Price 149.75 €", "score": 7, "replies": [{"body": "That tells me Credit Suisse will be hit on both of their positions: long VW and short TSLA.\n\nIf they think Tesla will remain a niche automaker, either they have no clue, or they are just lying.\n\nRead Tesla's Master Plan and Master Plan 2, they have been doing exactly what they described in the plans. Their goal is certainly not to become a niche automaker.", "score": 4, "replies": []}]}, {"body": "If over the next 10 years Tesla continues at the growth rate it has had for the last 10 years, Tesla would have revenues of something like 20T/year.", "score": 8, "replies": [{"body": "Not sure about 20T... I can certainly envision how Tesla reaches revenue of 2T a year. At least they have a plan to get there.", "score": 2, "replies": [{"body": "Entire grid runs on solar + tesla batteries \n\nEvery new car is a tesla \n\nTesla has 90% of the ride share market \n\nAutonomous Tesla semi does all land transportation, \n\n$2.75 trillion in automotive \n\nPower production is like $1 trillion per year \n\nRide share and taxi is around $140 billion globally\n\nTransportation is like $5.1 trillion, but that includes all types of transportation. \n\nNot saying Tesla actually can dominate all of these markets, but it's just interesting to see how big a market Tesla has access to.", "score": 5, "replies": []}]}]}, {"body": "They're already doing it, they will just continue to be doing it within the next decade.\n\nThose numbers are by no means anything to scoff at.\n\nTeslas great but this sub refuses to believe that any sort of negative circumstances exist.", "score": 4, "replies": [{"body": "The numbers? Nothing to scoff at. VW's promises + tech, on the other hand, ......", "score": 3, "replies": []}, {"body": "Maybe invest in a pair of glasses?", "score": 1, "replies": [{"body": "what", "score": 1, "replies": []}]}]}, {"body": "Note that VW was forced to do this as a settlement to killing hundreds of folks via air pollution from their dieselgate scandal in the United States.", "score": 1, "replies": []}]}, {"body": "You’d almost think they were all reading from the same talking points:\n\n[Tesla more likely to end up a ‘niche’ car maker, analysts say (Marketwatch, 5/30/2019)](https://www.marketwatch.com/story/tesla-more-likely-to-end-up-a-niche-car-maker-analysts-say-2019-05-30) \n\n[Can Tesla Ever Be More Than a Niche Automaker? Wall St. Increasingly Thinks No. (NY Times, 6/3/2019)](https://www.nytimes.com/2019/06/03/business/dealbook/tesla-stock-price.html) \n\n[Tesla wants everyone to drive an electric car. Now it risks becoming a niche brand. (WaPost, 6/14/2019)](https://www.washingtonpost.com/technology/2019/06/14/tesla-wants-everyone-drive-an-electric-car-now-it-risks-becoming-niche-brand/)", "score": 8, "replies": [{"body": "It's like (TV)media in the US. One script for all news.", "score": 3, "replies": []}]}, {"body": "Ah so Credit Suisse also wants cheap shares before deliveries. Niche automaker with 100% YoY growth, alllllllrighty then.  \n\n\nEDIT: Also anyone saying Tesla's competition is other electric cars literally doesn't understand how market-share works.", "score": 22, "replies": [{"body": "Everyday people buy 200,000 new gasoline/diesel vehicles. That's the market Tesla is aiming to replace. Elon Musk said Tesla will not stop until every car in the world is electric. That means the world need to produce 2 billion EVs just to replace the existing vehicles, and they also need to produce 80 million a year to replace vehicles that reach end of life.\n\nThe EV competition is all about autonomous technology and batteries. Tesla is leading in both, how come Credit Suisse thinks VW will magically beat Tesla is beyond me.", "score": 5, "replies": []}, {"body": "> automaker with 100% YoY growth\n\nThose days will be over forever next quarter.  They'll only hit 100% growth in number of deliveries in Q2 because last year they put 12,500 vehicles in inventory or in transit at the end of the quarter to avoid tripping the 200k cap for federal subsidies.  Next quarter they will likely see revenue fall YoY, with deliveries up something like 20%.", "score": 0, "replies": [{"body": "Giga3 would like a word with you next year if it lives up to the hype", "score": 1, "replies": [{"body": "> if it lives up to the hype\n\nNarrator: It won't.  \n\nYou think they are going to produce 7k Model 3s a week there next year?", "score": 0, "replies": [{"body": "They're not going to be 100% every year, but to act like they won't keep growing very quickly is ridiculous.", "score": 2, "replies": []}, {"body": "Phase one of GF3 is 150k per year, roughly 3k per week. Who knows when it will be upgraded beyond phase one", "score": 1, "replies": [{"body": "Exactly, current plan is to only expand productive capacity by ~30-40% next year.  No way they will come even close to doubling deliveries.", "score": 3, "replies": []}]}]}]}]}]}, {"body": "Who?", "score": 7, "replies": [{"body": "The 2012 ETron", "score": 4, "replies": []}]}, {"body": "I dont know why exactly they make so much fuzz out of competition to tesla, but the EV in general is a \"race to the top technology evolution\" unlike a stagnant combustion engine technology which has been sitting on same tech for years. With this fact in mind there will always be a leader in the EV market segment which in my opinion will be tesla for the next decade. We will see many advancements like maxwell for example in the next few years and as long as tesla is innovating on all fronts ( battery, design, production, software etc.) At a pace they have been, there wont be anyone else catching up in the forseeable future.", "score": 3, "replies": [{"body": "When VW out innovates tesla on batteries I will consider them competition.  Until then I say bring it on, every “tesla killer” is also an ICE killer.", "score": 1, "replies": []}]}, {"body": "If all this supposed competition is coming for tesla, and tesla already exceeds every ICE car in its class on both specs and sales, they must be very bearish on oil companies right?", "score": 3, "replies": []}, {"body": "They'll be producing a million cars a year with FSD capabilities at an affordable price, but they'll be a \"niche\" automaker... Yeah right. Talk about denial.\n\nMy god these analysts are just either retarded or manipulative scums.", "score": 4, "replies": [{"body": "They could be both.", "score": 1, "replies": [{"body": "I wouldn't say a million vehicles a year is niche at that point.", "score": 1, "replies": [{"body": "I meant to say: they could be both - retarded and manipulative scums.", "score": 1, "replies": []}]}]}]}, {"body": "Baha now the “Tesla competitor” is VW huh? They’re for some reason gonna do a better job than GM, Jaguar, Audi, Hyundai, and Porsche? \n\nThis bear thesis is terrible, the legacy car makers are years behind, don’t want to spend the money to catch up - especially in regards to a charging network - and fall farther behind every month.\n\nEven if they were serious competition that’s not a bad thing, Tesla won’t be able to make enough cars to have all the market share obviously, but if EVs are mainstream and they’re the Apple of that market, that’s great.\n\nThey need to give this tired idea a rest, get a new thesis, like profitability, which may last 1-4 more months then onto the next.", "score": 2, "replies": [{"body": "While the cars might not match Tesla's specs, at least VW is starting off going for the mid segment, which will help get more people used to driving EVs.", "score": 2, "replies": [{"body": "They are aggressively marketing the ID.3 here in Germany (huge Billboard campaign, prime time TV ads). I even got targeted a few times on twitch.\n\nAnd they are going for a different market segment than Tesla.", "score": 4, "replies": [{"body": "What's the VW profit margin on their EVs? Will they even make a profit from them?", "score": 2, "replies": [{"body": "I don't know, but I would be very surprised if the margins are super bad. \n\nMy (unfounded) opinion is that their (net) margins come out to a wash if they sell decent numbers. If they sell great VW will be making some small profit.\n\nThey did not bet the farm on this, but they did bet the barn,l.", "score": 2, "replies": []}, {"body": "They'll sell them at whatever price it takes, because they have to in order to avoid fines. If they have to subsidize them from ICEV sells, I fear it could hurt Tesla. On the up side, making ICEV more expensive to make EV cheaper will help the land slide towards electric.", "score": 1, "replies": []}]}, {"body": "That’s honestly great, let’s go EVs, my point was in regards to Credit Suisse seeing this negatively affect Tesla.\n\nHow will VW addressing a different market hurt Tesla’s sales or revenue?", "score": 1, "replies": []}]}, {"body": "Sure, that’s a good thing, this idea that another company is going to hurt Tesla’s sales at some point in the near future and turn them into a “niche” carmaker is dumb though.", "score": 1, "replies": []}]}, {"body": "Don't underestimate brand loyalty, especially in Europe, as well as the power of brute force. VW Group is a giant. Even if many of their models fail it only takes a few to be successful, or a middle of the road number to be moderately successful in order to compete with Tesla.\n\nNow, whether and especially when that might come to pass is anyone's guess and impossible to predict reliably. But it's not inconceivable.", "score": 1, "replies": []}]}, {"body": "Bull shit", "score": 1, "replies": []}, {"body": "Articles like this send such a strong long term buy signal to me. I'm waiting for the stock to go down on earnings and I'm buying more.", "score": 1, "replies": []}, {"body": "Another clueless analysis based on knowledge of a dying business model of legacy auto. No one comes even close to making as many EVs as Tesla does per day, week, month, and year. Mass EV production is fundamentally different, even though there are many similarities with ICE vehicle production. Mass Tesla EV production is even more fundamentally different with the amount of vertical integration in both the hardware and software design and engineering. Put another way, Tesla is building an orbital class rocket that can go to the Moon and Mars while legacy auto is building a sub-orbital rocket that can put you in space for a few minutes before dropping back to terra firma.", "score": 1, "replies": []}, {"body": "After so much hope this morning, this does not look good to end the week", "score": -3, "replies": [{"body": "Is the competition from the Audi e-tron lol?", "score": 11, "replies": []}, {"body": "If you play weekly options, you are at the mercy of these market manipulators. Actually, they have no mercy. If you just sit on shares paid with cash, they can't do much.", "score": 2, "replies": []}, {"body": "Every talked about stock is far too easily manipulated. Whether it's every tech stock, Tesla, or BYND.", "score": 1, "replies": []}, {"body": "The prospects of what exactly doesn't look good and why? The way your comment is now, it invites people to read things into it that you might not have intended at all.", "score": 1, "replies": []}]}]}
{"title": "BYND Short Borrow Rates from today", "selftext": "I posted this earlier this morning and mods took it down. Not sure why?\n\n&#x200B;\n\nStill nothing from S3 in terms of the amount of shares that are shorted (they didn't report yesterday either). But in calling around, I got short borrow rates at 282% at IB, up from 230% yesterday, with no available shares to borrow. Fidelity reported 99% borrow rate (with no available shares) but that is the max rate they charge. I believe Schwab does that as well (capping short borrow rates at 99%).\n\nOther factors that I find encouraging:\n\n1. Forced ETF buying due to Russell 1000 inclusion. Tracking funds might try to buy before the June 28th inclusion date, but they will essentially be forced buyers AFTER June 28th as well. The article below assumes about 2.6m shares will have to be bought. That is essentially 4% of the outstanding shares, but MORE IMPORTANTLY 24% of the entire float of 11m shares due to the lock-up which expires in October.\n\n[https://seekingalpha.com/article/4271912-etf-effect-beyond-meat-enters-strong-flows](https://seekingalpha.com/article/4271912-etf-effect-beyond-meat-enters-strong-flows)\n\n2) BYND is still on the \"fail to deliver\" threshold list at Nasdaq due to Regulation SHO. Many firms that shorted shares in BYND assumed that their PBs would be able to find shares to borrow. This is not always the case. My understanding is that a PB has 13 days to locate shares to deliver to their clients who are short the stock, otherwise they are forced to make their clients cover the shares. They first appeared on the list 12 days ago and hence day 13 SHOULD be June 28th.\n\n3) Short Interest remains about 50% of the float with borrow rights trending higher. They move around day to day, but in my (admittedly) small sample size of calling around brokers, they seem to be trending higher with no available shares to borrow. This is a good thing.\n\nSo as of right now I am still holding my August 16th calls of $100, $140, and $200s due to the potential of a short squeeze. But I have a very high risk tolerance and I MAY BE WRONG. If you are buying calls or shares, please know that this is a super over valued stock in a bad business long term. This WILL crash and burn at some point. Please be aware of that and only risk what you assume you will lose.\n\nI will update when S3 posts borrow rates (if they do)", "id": "c67jqu", "created_utc": 1561652523.0, "score": 45, "upvote_ratio": 0.87, "num_comments": 52, "comments": [{"body": "These updates are very important to my well-being this week.", "score": 17, "replies": [{"body": "See this is one of those rare moments were you are right however everyone is retarded. And if you can't beat em, join them. \n\n\nBynd to 170. All in.", "score": 1, "replies": []}]}, {"body": "Solid post. Nice work. Can’t wait for all the bitter shitposts if it short squeeze doesn’t happen by Friday", "score": 8, "replies": [{"body": "Probably won’t but If one were to happen I’d be very surprised if it didn’t happen by the end of next week (please god let it squeeze to 270+ tomorrow I’ll have something to show my family)", "score": 3, "replies": []}]}, {"body": "Good DD. \n\nThanks guy!", "score": 7, "replies": [{"body": "No problem", "score": 7, "replies": []}]}, {"body": "They got some good news out too, it may be old news i dont know. \n\n [https://finance.yahoo.com/m/528155f9-2aa1-3212-8a89-2b8b8e4ad6d0/beyond-meat-heading-to.html](https://finance.yahoo.com/m/528155f9-2aa1-3212-8a89-2b8b8e4ad6d0/beyond-meat-heading-to.html)   \n [https://finance.yahoo.com/m/e9d37fcb-aa8e-3ec9-beff-dd64388ab8c5/beyond-meat-stock-climbs.html](https://finance.yahoo.com/m/e9d37fcb-aa8e-3ec9-beff-dd64388ab8c5/beyond-meat-stock-climbs.html)   \n still holding my 7/19 $200C. dont be greedy dude, that 100c should be very good looking now", "score": 7, "replies": [{"body": "I think you are correct that it is new news- but probably not that impactful. Just 45 stores. Thanks for posting it, though!", "score": 2, "replies": []}]}, {"body": "You doing gods work mike.\n\nBeen looking at the level 2 market data, and the ask side looks unusually shallow", "score": 7, "replies": [{"body": "What kind of data are you looking at? Calls or shares?", "score": 5, "replies": []}, {"body": "Can you share it?", "score": 1, "replies": []}]}, {"body": "Thank you! Hopefully the damn useless mods dont remove your diligence", "score": 6, "replies": []}, {"body": "I have $167.5 calls expiring tomorrow, bought it when it was $165, at one point I was up a few hundred but BYND crashed hard. If tomorrow it goes back up $167.5... what are the odds of me being able to break even? Way I’m lookking at it right now is that it’ll hopefully come close to 50% theta is a mistress lol. Bought them for $12.5", "score": 6, "replies": [{"body": "To be totally honest, it’s looking grim for $167.5 tomorrow, but what do I know? Good luck bud!", "score": 3, "replies": []}, {"body": "Lol you ded. \n\nSell at open on the pop. The best I think you're going to be able to get is $3 if it jumps to 167.50 in the first hour.", "score": 3, "replies": []}]}, {"body": "Lol those $100 and $140 calls must be nice right now regardless", "score": 5, "replies": [{"body": "Hoping they get nicer", "score": 9, "replies": [{"body": "I got some 6/28s send help lol but I honestly don’t mind rolling some into next week, ps how do short borrow fees work I thought they capped at like 100% but I don’t know much about shorts", "score": 2, "replies": [{"body": "As with anything, the borrow rate is determined by supply and demand. Lots of people looking to short, but a tiny float and voila: high borrow fees.\n\nFor the second question: Depends on the relationship with your broker- some cap at 99-100% but then recall your shares of it goes over (so they can resell to larger hedge funds and make a profit). Others will just charge you whatever the rate is.", "score": 2, "replies": []}]}]}]}, {"body": "Index funds track an index directly. It is passive, not active. So a index fund won't front run the index inclusion. It will rebalance based upon the new index constitutes when it is official.", "score": 5, "replies": [{"body": "I've heard the argument that some funds do try to front run the event, in order to eliminate arbitrage opportunities and limit volatility.", "score": 3, "replies": []}]}, {"body": "Irrelevant autist question... what's S3? you've mentioned it a lot I tried googling but keep getting amazon cloud products.", "score": 6, "replies": [{"body": "Financial Data analytics firm. They actually post the data on heavily shorted/meme stocks in order to try to get people to sign up as clients. I believe the data they tweet out is a bit delayed compared to the data that their paying clients see, but I’m ok with that.", "score": 5, "replies": []}]}, {"body": "Good shit, Mike. I bought a few ITM BYND calls @ 143, and I've already used the profits to fund some OTM July calls, of which I had a few already. Pretty pleased with the results so far. A short squeeze is looking increasingly likely. If we wake up one day and the stock is up 100% like Tilray was that one time, I'll blow everyone in this subreddit. But a slow climb is more likely (if 6-10% per day can be considered a slow climb), and so I'll cash out some of my calls as we continue going up.", "score": 8, "replies": [{"body": "Please don’t make bets that a good portion of this sub will hold you too. Instead, you can always promise to eat a cardboard box ;)\n\nAlso: what happens if we go down 100%?", "score": 5, "replies": [{"body": "The whole sub will have to blow *him*.\n\nI said it, it's official. No backing out now bois!", "score": 3, "replies": [{"body": "Its almost like you want it to go down.... you a mod?", "score": 3, "replies": []}]}, {"body": "See, this is why buying calls is so much less retarded than buying puts. Puts have a massive premium compared to calls right now, and the amount of money you can make from them is limited, while calls are theoretically unlimited. Tilray went from $150 to $300 in a day. If it had dropped to $0 that same day (impossible), the most you could've made from one put would've been like 12k. Instead, it *actually* went up to $300 and it was genuinely possible to net yourself around 15k for one call, and for a much lower buy-in than the put.\n\ntl;dr: I'm only risking 100% of what I put in, but I can gain much more than 100%. If I lose, I lose the $3k I already made from calls I've bought and sold on the stock.", "score": 2, "replies": []}, {"body": "Or like that dude who eat far too many bananas lol.", "score": 1, "replies": []}]}, {"body": "Dont forget with tilray the squeeze didn’t start at open it actually dropped considerably at open if I remember correctly before absolutely rocketing", "score": 2, "replies": [{"body": "Premarket it was up like 50%. It may have dipped a bit, but I remembered a \"slow\" climb to 300. I'll have to check today", "score": 2, "replies": [{"body": "I have a question tho, didn’t tlray come back a lot by eod or am I dumb? Like I’ve got some options expiring tomorrow on Rh and I’ve never held an option to expiry before but I’ve got a few bynd otm 6/28 calls that I picked up way back when ranging between 200 and 275 but if bynd were to hit 300 tomorrow midday it wouldn’t really matter would it because the option exercises eod right? So if bynd were to come back to like 199 eod those options would be bust?if that’s the case then seems like the best way to make money on the squeeze is day trading calls for the next expiry", "score": 1, "replies": [{"body": "yikes.\n\nYou need to learn more about options.", "score": 1, "replies": [{"body": "I just never let them expire lol", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Well done as always my friend", "score": 3, "replies": [{"body": "Thanks buddy", "score": 3, "replies": []}]}, {"body": "Best way to play this is Friday cheap OTM calls. Cut your profits to 50%, play again next Friday. Simple, works looking at each historical Friday on the stock.", "score": 3, "replies": [{"body": "Noobie here, what do you mean by play? Buy today or buy early and in the week and hold till friday?", "score": 2, "replies": [{"body": "He means that you should go outside and play. It's Friday, come on!", "score": 2, "replies": []}]}]}, {"body": "They don’t have to begin the inclusion all at once. A lot of people thinking that all those shares will be bought tomorrow.\n\nTryna save some people’s money lol", "score": 3, "replies": [{"body": "Yeah but it puts a bid under the stock, at least.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "It's not really news though, is it? It's a buying event that will push the stock higher. Especially when there's so many people shorting it.", "score": 5, "replies": [{"body": "Yep 🤑", "score": 1, "replies": []}]}]}, {"body": "This post was flaired as DD so it's on the DD list. [Click Here to read fresh WSB DD.](https://new.reddit.com/r/wallstreetbets/search?sort=new&amp;restrict_sr=on&amp;q=flair%3ADD).\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "deleted", "score": 1, "replies": [{"body": "What was deleted? Today’s post?", "score": 1, "replies": [{"body": "Haha, no. i posted at your wrong old post, so i deleted my sentence. my comments are in your new post", "score": 1, "replies": []}]}]}, {"body": "I don't think 50% of the float is short. That doesn't sound right. I think 50% of the daily volume is shares sold short.", "score": 1, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "We only get official data from nasdaq once every 2 weeks, but S3 does a pretty good job of analyzing to see the interim daily amounts. Too bad they haven’t posted in a couple of days :(", "score": 5, "replies": [{"body": "Ihor may be on vacation?  Seems that they have not reported on any other companies since Tuesday.", "score": 4, "replies": []}]}]}]}]}
