{"title": "Welp... I tried to be a 🏳️‍🌈🐻 and failed... I thought NVDA would drop post splt. These losses don't even include a few rolls from early July...", "selftext": "", "id": "opn1dd", "created_utc": 1626987769.0, "score": 79, "upvote_ratio": 0.8, "num_comments": 79, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|5 months ago\n**Total Comments**|78|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Don't fuck with nvda bro. Shitzz a beast.", "score": 66, "replies": []}, {"body": "I bought calls after the split. I feel a different emotion. . .", "score": 26, "replies": [{"body": "Haha,  jealous!", "score": 3, "replies": [{"body": "Did ya learn that a stock split is a good thing for bulls?", "score": 14, "replies": [{"body": "moo?", "score": 1, "replies": []}]}]}]}, {"body": "It's NVDA. Every nerd that wanted to invest in them but didn't because \"it's too expensive\" can actually buy now.  Source: I am one of those nerds.", "score": 46, "replies": [{"body": "yeah I bought one too lol", "score": 14, "replies": [{"body": "bought some and sold a put", "score": 3, "replies": []}]}, {"body": "Same.  Bought a 7/23 weekly 195c for 58 bucks on Tuesday", "score": 4, "replies": [{"body": "I want to know how that ends up for ya!", "score": 3, "replies": []}]}, {"body": "Quality DD right here", "score": 2, "replies": []}, {"body": "I am the nerd that bought at $17 and sold at $300 pre split. i am hurt. i am sad.", "score": 2, "replies": []}]}, {"body": "Seems like stocks go up after a split more often than not", "score": 24, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Not less often than not", "score": 6, "replies": []}]}, {"body": "on bigger companies yes.", "score": 1, "replies": []}]}, {"body": "Why would any person be a gay bear when it comes to NVDA..? They will be worth 1 trilly in a year. bet.", "score": 9, "replies": [{"body": "Agreed sir. On the name and the comment", "score": 7, "replies": []}]}, {"body": "NVDA is not a company you want to bet against. It’s a Wall Street darling right now like SHOP or CMG and any weakness will be gobbled up.", "score": 30, "replies": []}, {"body": "You’ve lost everything sir, please leave the casino", "score": 12, "replies": [{"body": "Oh my gourd! \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}]}, {"body": "Gotta try harder. Yolo on SPY puts.", "score": 7, "replies": []}, {"body": "Buying puts for these securities should be a form of disability evidence:\n\nAAPL, SPY, NVDA, AMZN, GOOG, MSFT, and QQQ", "score": 6, "replies": []}, {"body": "Damn man. I thought NVDA would drop as well, but NVDA really only go up in reality.", "score": 6, "replies": [{"body": "it did technically drop, but bounced back", "score": 1, "replies": []}]}, {"body": "Never puts. Call spreads next time", "score": 3, "replies": []}, {"body": "Stocks usually go up 10% after split then drop after", "score": 4, "replies": []}, {"body": "Well, it did fall. The first day.\nI got a nice 20% in the morning. But 2nd day it's back up", "score": 4, "replies": []}, {"body": "Yeah NVDA was a tough one to be bearish on in recent weeks, there was that one dip but other than that a lot of gains. Better luck next time.", "score": 3, "replies": [{"body": "I think the reason for the dip was because people forgot they did a 4:1 split and thought the stock just tanked out of nowhere", "score": 5, "replies": [{"body": "Just tanked 700 pts overnight lol 3/4 of market cap shaved off at open.  Their ceo could be convicted of child rape and also war crimes,  with the video on YouTube,  and it wouldn't tank that much lol", "score": 4, "replies": [{"body": "How dare you speak of the god Jensen this way", "score": 2, "replies": []}]}, {"body": "It dipped before the split. Profit takers from the incredible run-up it had. Also I think a lot thought it would dip more than it did post split and some have bought back in.", "score": 1, "replies": []}]}, {"body": "Thanks.  Time to go long...", "score": 1, "replies": []}]}, {"body": "You fool. Only take small positions being gay. \nSmall and tight is the way to go.", "score": 3, "replies": []}, {"body": "Name checks out. NVDA is gold right now bro. Until news of the ARM deal failing breaks, I wouldn’t dare buy puts or go short", "score": 3, "replies": []}, {"body": "I must say this whole process is very cathartic. Ty wsb 💛.  It's nice to see I followed in the footsteps of a few other degenerates and am not alone.\n\nAnd to all of you who knew this was a dumb ass idea -- tell me before I lose it all next time ![gif](emote|free_emotes_pack|wink).\n\nThe day job stays for now.  I need to go get more chips for the casino.", "score": 3, "replies": []}, {"body": "Right there with you man. Down about the same amount now, cuz I'm so persistent. Still own some puts and rolled to next week.\n\nI just don't understand bulls.\nPE ratios and all that stuff tells me this stock is overvalued.\n\n\nGah, what is wrong with me. There's something about he market that I'm oblivious to. Like I can't see it. All I see is high valuations and being a gay bear.", "score": 3, "replies": [{"body": "Can’t even spell GUH properly, start with that boyo", "score": 1, "replies": []}]}, {"body": "Stonks only go up🤷‍♂️", "score": 2, "replies": []}, {"body": "Bro, nice try", "score": 2, "replies": []}, {"body": "the formula worked for tsla and aapl, not sure what you were thinking here", "score": 2, "replies": [{"body": "I thought it would work the same lol", "score": 1, "replies": []}]}, {"body": "Wow. You re betting against while Nvidia has a super strong momentum![gif](emote|free_emotes_pack|scream)", "score": 2, "replies": []}, {"body": "After this loss, the only Rolls he’ll be eating is from the dumpster behind Wendy’s 🥖", "score": 2, "replies": []}, {"body": "Nvidia is a hold for decades type stock. Don't be a fool.", "score": 2, "replies": []}, {"body": "Why do we buy puts on good companies and calls on shit ones??", "score": 2, "replies": []}, {"body": "Since when do stocks drop post split?", "score": 2, "replies": []}, {"body": "That’s what you get for going bear gang", "score": 2, "replies": [{"body": "Learned that lesson the hard way...", "score": 2, "replies": []}]}, {"body": "All i see is 93% charged whats the issue?", "score": 1, "replies": [{"body": "I recognize I'm not a true ape with only 2% battery.  Need to work on that!", "score": 1, "replies": []}]}, {"body": "Too soon.  Wait for AMD/Xilnex merger.  AMD go up, NVDA go down...", "score": -2, "replies": [{"body": "Maybe, if the nVidia/ARM deal falls through, but even then... doubtful.", "score": 4, "replies": []}]}, {"body": "This is a bull market you moron", "score": -1, "replies": []}, {"body": "They usually do", "score": 1, "replies": []}, {"body": "Don't worry I did the same thing, first day post split I was in green but second right after market opened and it went up I knew what was going to happend so I ended shorting with small loss but brought right away so it covered it 🤷‍♂️", "score": 1, "replies": [{"body": "Better play than my bag holding!", "score": 1, "replies": []}]}, {"body": "I took it in the can too OP. \n\nOn the bright side, NVDA could drop 10% tomorrow, right?\n\nRight?\n\n\n…righ…", "score": 1, "replies": [{"body": "Lol. 🤞🤞🙏🙏", "score": 0, "replies": []}, {"body": "Right!", "score": 1, "replies": []}]}, {"body": "Splits usually signal strong momentum and access from broader shareholder base. Why did you think it would tank?", "score": 1, "replies": [{"body": "Looking at similar stocks like TSLA and AAPL.  Their valuation is way out of proportion. I love the company but just thought people would take profits at the top and it would return to the mean.  🤦‍♂️", "score": 1, "replies": []}]}, {"body": "Why would it drop? People buy the 50% dip", "score": 1, "replies": []}, {"body": "It could go down next month. Chip shortage is an issue with many technology companies. But NVDA is a solid company. I wouldn’t bet against it in the long run.", "score": 1, "replies": []}, {"body": "Bought 10 at 405 loving it right now", "score": 1, "replies": []}, {"body": "everyone isn't budging until we hear news about the ARM acquisition.   You'd be an idiot to leave prior to that.", "score": 1, "replies": []}, {"body": "What happened to the guy that heavily shorted Virgin Galactic because he thought the launch would be a failure? I’ll bet he’s not going so well..", "score": 1, "replies": []}]}
