{"title": "The 6 stages of a market bubble", "selftext": "", "id": "ouvz3d", "created_utc": 1627686236.0, "score": 1237, "upvote_ratio": 0.97, "num_comments": 87, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|45|**First Seen In WSB**|1 year ago\n**Total Comments**|3453|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "“No meaningful profit can be derived in the absence of an asset bubble” - said me", "score": 86, "replies": [{"body": "For you to win, someone else must lose\n\nYou homewrecker", "score": 24, "replies": [{"body": "As long as it’s theta gang or bear gang, I am ok with this. 😉", "score": 13, "replies": [{"body": "Dearth to all bulls?", "score": 2, "replies": []}, {"body": "it's more like a delicate balance... theta gang is there to buy the underlying and sell us calls, so that when we hit that 10% and make millions they dont lose too badly.\n\nTheta gang to WSB is kind of like farming... WSB farms the plants (Thetagang) and after enough time passes... we fuck the plant. Yeah, nailed that metaphor.", "score": 2, "replies": [{"body": "Love it.", "score": 1, "replies": []}]}]}]}, {"body": "I like it!", "score": 11, "replies": []}, {"body": "Expect in this BTFD bubble", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 91, "replies": [{"body": "Bubbles are very profitable.", "score": 41, "replies": [{"body": "Don't short a bubble unless you're the one poppin it.", "score": 21, "replies": [{"body": "I like popping things. Bullish on $BUBB.", "score": 10, "replies": []}]}]}]}, {"body": "godammit i'm in…", "score": 13, "replies": [{"body": "I just don’t see how it could go tits up 🧐", "score": 10, "replies": [{"body": "logic is unassailable", "score": 5, "replies": []}]}]}, {"body": "Step 6 is new and tbh may be delaying the inevitable market correction.", "score": 16, "replies": [{"body": "yeah but if you can delay it for 50 years, you'll be dead when it busts so nothing of value is lost.\n\non an other note:\n\n[\"the problem with todays society, is that we don't plant trees for our grandchildren\"](https://pics.me.me/a-society-grows-great-when-old-men-plant-trees-whose-10980469.png)", "score": 6, "replies": []}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "If there’s a smarter or safer investment (gambling) vehicle, i don’t know it!", "score": 6, "replies": [{"body": "Leaps… can’t get margin called if you only hold leaps… avg down when it crashes and just hold on to dear life… JPow won’t let any downturn to last for more than one year 😉", "score": 4, "replies": [{"body": "Tell that to the $DIS and $AAPL leaps I picked up in January. \n\nApple hit an all time high and I has still down 25%.\n\n*fuckkkkkkkk*\n\n*keeps telling himself he still has six months*", "score": 3, "replies": [{"body": "AAPL essentially went sideways for 6 months while those bloodsucker theta bois sucked all that juicy premium up 🥵", "score": 6, "replies": [{"body": "Yeah.\n\nSimilar with Disney except it grinds up by inches and then dives off a cliff when something bad happens.\n\nDisney's Greeks are fucked compared to when I bought.", "score": 2, "replies": []}]}, {"body": "Jan was ATH everywhere, especially tech sector", "score": 2, "replies": []}]}, {"body": "Lol very good point but I was joking.", "score": 2, "replies": []}]}]}]}, {"body": "We're living through the MOAB (Mother of all Bubbles), who dares pop it?", "score": 7, "replies": []}, {"body": "“It’s not another bubble, it’s different this time!”\n\n - Lehman Brothers employee of the month, September 2008", "score": 11, "replies": [{"body": "Calls on Lehman Brothers are literally free money. Cannot go tits up. \n\n— WSB 2008", "score": 8, "replies": [{"body": "Even I know this will go tits up", "score": 3, "replies": []}]}, {"body": "my roommate had an offer from Lehman and it crashed to the ground right before his joining date. Luckily for him Barclays took over Lehman and kept his offer alive!", "score": 5, "replies": []}]}, {"body": "There's something wrong with your pokemon, they got all these words and shit...", "score": 4, "replies": []}, {"body": "You can find me in the club, bottle full of $bubb\n\nDecoding song lyrics for stock picks.\n\nAlso buy $BIZKIT is hot right now but", "score": 4, "replies": [{"body": "Lol", "score": 1, "replies": []}]}, {"body": "Too many steps. I’ll go straight to step 6 and buy the dip of any falling company", "score": 6, "replies": []}, {"body": "Love you WSB!", "score": 3, "replies": []}, {"body": "Best of all bubbles are free! You just need to blow to make it big! Head to your Wendy's today!", "score": 3, "replies": []}, {"body": "Son of a bitch, I’m in.", "score": 3, "replies": []}, {"body": "Stage 7, spray champagne bubbles on non WSB friends", "score": 3, "replies": []}, {"body": "Profit taking is happening did you see the insiders selling fb and all the insider selling happening recently, eviction immunity denied, position:DEC BAC PUTS", "score": 3, "replies": [{"body": "I like the BAC puts. Thinking XLF also.", "score": 3, "replies": [{"body": "Ooh nice might have to pick me up some either I'm Michael Barry or the lady behind the Wendy's dumpster", "score": 2, "replies": [{"body": "I caught the initial dump a month ago but I think that’s just the tip of the iceberg. Financials are still up more than big tech YTD (I think…lol)", "score": 1, "replies": []}]}]}]}, {"body": "Me like tendies", "score": 6, "replies": []}, {"body": "Infinite tendies 💯", "score": 4, "replies": []}, {"body": "This is fucking brilliant!", "score": 2, "replies": [{"body": "☺️", "score": 1, "replies": []}]}, {"body": "You missed \"Apocalypse\" when you wake up and realise there's no more outs. Happened once to me, never again.", "score": 2, "replies": []}, {"body": "Small prick", "score": 2, "replies": []}, {"body": "I like this one a lot... Thank you Sir! 🦍🐵🦧", "score": 2, "replies": []}, {"body": "We are in Stage 7.", "score": 2, "replies": [{"body": "Purgatory?", "score": 1, "replies": []}]}, {"body": "When the market crashed on Tuesday -2% SPY for delta worries, then rises 2% Thursday because, well nothing actualy", "score": 2, "replies": []}, {"body": "Haha that’s seems to be the new model.", "score": 2, "replies": []}, {"body": "We're in a bubble economy now. Everything's \"overvalued\", so nothing is.\n\nBears can keep crying about it tho.", "score": 1, "replies": [{"body": "I have a retarded question. Why do analysts say a stock is over priced or over valued, if the company has two things that my retarded ass deems it necessary to put my $30/Hr job wages in. The company has cash on hand, debts that don't exceed that cash on hand, and has a profit margin of at least 10 cents for every dollar.\n\n5 10 15 25 50 even 100 dollars isn't a lot of money anymore. Why spend 100 dollars on yet another item for my 800sqft apartment I can barely fit shit in? Instead I can use that 100 and buy a share of AMD or two shares KO, or fractional shares of the very same shit that my 401k fund is buying. The broad index funds. At least I don't feel remorse after buying the shares, versus when I spend 100 dollars on some other dumb plastic item, clothing article, or dinner at a restaurant I don't like to get a chance at getting laid for the night.", "score": 2, "replies": [{"body": "So I agree with you, but index funds are not remorse free.\n\nMy dad and my grandparents got screwed by the 1970s and early 1980s.\n\nImagine the 2020 collapse, or the 2008 collapse, or the 2002 collapse, but instead of recovering in one, two, or three years, the market is flat for 15 years.\n\nI'm approaching early retirement. If 1970 happened today, my portfolio would tank, and I'd be stuck working for another 15 years.\n\nI'd be filled with remorse.", "score": 1, "replies": [{"body": "Hm. Good point. However, timing of the market is one of those things that is always mentioned to not do. So would drawing a portion of your portfolio out yearly be the best if you felt you'd be stuck in that flat 15 year market?   \n\n\nIn my case, since I am 27, I would see a scenario like that as benefit, even with the 15 year flat market. My investment budget wouldn't go anywhere assuming my income is the same, I'd be buying a market that at some point will rally into my early 50s or late 40s.  \n\n\nHowever, it would be different if this scenario happens 10 years after when I am 37. But, wouldn't that be followed by a long bull run?", "score": 2, "replies": [{"body": "It depends. Right now, the stock market has more than made up for the dip caused by covid. If you've been investing for the last year, you've been buying at bargain prices.\n\nThat doesn't always happen (and current prices could always crash). If everyone in the world is stalled out, no regrets -- it's the best you could do. But if real estate keeps up with inflation while the stock market tanks, or if the euro gets stronger while the dollar weakens, then maybe you made the wrong investment.\n\nBasically, this can happen to your country.\n\nhttps://en.wikipedia.org/wiki/Lost_Decades_(Japan)\n\nhttps://en.wikipedia.org/wiki/Hyperinflation_in_the_Weimar_Republic\n\nIn these situations, some people (mostly those with access to international markets) make out fine, while others stagnate or lose out.\n\nThat's less of a problem today -- it's much easier for me, as an individual, to invest in foreign stocks/currencies/etc. And I hope no one with modern monetary practices is going to pull a post-WWI Germany move.\n\nBut Japan shows that we aren't completely immune to concerns of this nature.", "score": 2, "replies": []}]}]}]}, {"body": "Prices of everything are at all time highs!  Inflation remains low", "score": 0, "replies": []}]}, {"body": "Part 6 is a game changer lol", "score": 1, "replies": []}, {"body": "I like the ending", "score": 1, "replies": []}, {"body": "stock BEKE is in phase Panic, let's buy the dip together.", "score": 0, "replies": []}, {"body": "Bubble is just a word people use when they lack imagination", "score": 0, "replies": [{"body": "What other word would you use then? Go on tell me, you clearly are full of imagination so enlighten me", "score": 1, "replies": []}]}, {"body": "It’s ‘heeding’, you imbecile", "score": 0, "replies": [{"body": "Shit, it’s the typo police 👮‍♀️ \n\nLigma ballz! 👅", "score": 1, "replies": []}, {"body": "Also, comma goes inside the quotes, retard. 😉", "score": 1, "replies": []}]}, {"body": "Amazon for me describes the last pictures! I bought the dip! Big!", "score": 1, "replies": []}, {"body": "Amazon for me describes the last pictures! I bought the dip! Big!", "score": 1, "replies": [{"body": "3 day rule! You’re supposed to wait 3 days to let the sellers finish selling!", "score": 4, "replies": []}]}, {"body": "Wow you give yourself way too much credit lol", "score": 1, "replies": [{"body": "Imagine thinking wallstreetbets doesn’t move markets. Lmao", "score": 1, "replies": []}]}, {"body": "Stage 7: wife leaves you", "score": 1, "replies": []}]}
