{"title": "Pubmatic ($PUBM) - Trade for Justice, or for Profit", "selftext": "Thank you to: u/caseywh, u/sectorpotential2083, u/FatAspirations, u/JayAreW, u/JeffAmazon, u/drop-o-matic, u/uberkikz11 for guidance and assistance in writing this report.\n\nPUBM has been a name that has been floating around for a few weeks now, usually in the context of its high short interest. As we dug into the name further, we were pleasantly surprised to find out that this company is not dog-shit, is not failing, nor is it in a dying industry (as most of the other short interest plays that will remain unnamed), but a thriving company in an accelerating industry. This post will guide you through how we stumbled on the name, the company and its financials, the industry, the short-interest, and the plan. There are several angles of attack here, enough for everyone to get their grubby little hands dirty: traders, investors and gamblers. A summary:\n\n&#x200B;\n\n* Clean financials, with earnings beat and raised guidance\n* Undervalued compared to peers\n* Secular tailwinds as digital advertising expands\n* Dual class share structure which disincentivize insider selling\n* High short interest (anywhere from 20%-50% as of 6/24)\n* High institutional ownership (74%)\n* Small float with tight liquidity\n* Bottoming chart pattern with reversal\n* Options chain initiation on 6/25 - with more strikes to be added imminently\n\nPlan: Shares for the conservative players. Options - the chain is limited because options were just introduced - pound any and all strikes - with focus on the longer-dated.\n\nDisclaimer: Multiple people have contributed to this report, and most have shares in the $30 range when the idea of this play was first conceived.\n\n**The Origins and Chart Analysis**\n\nWhat caught our interest originally, was a volume scan. After market close on 6/7, $PUBM showed up on a scanner looking for relative volume increases. This is a scan I use a lot, as it’s a good way to follow the whales as they tip their hand when scaling into a position. When you see big volume moves (over the relative average), but little price movement, it’s usually a sign of institutional accumulation. The big players piece into positions slowly as not to price themselves out with a massive market order. In the case of $PUBM, despite a 3x volume spike, price only increased a modest 5%. These moves are often signs of trend reversals when an institution slams its wizard staff into the ground and says, “You shall not pass!”. The last three weeks have seen the most shares traded in $PUBM’s history - even more than when $PUBM IPO’d in December of 2020.\n\nIn addition to accumulation volume, the PUBM chart is a perfect example of both types of head and shoulder patterns (topping H & S, and bottoming inverse H & S) - see Chart 1. The original H & S called out the top, and now we see an inverse head and shoulders formed, which is typically a signal of a bottoming, reversal pattern. The breakout was rejected at the original “neckline” of the topping pattern, and retested the breakout point on 7/2/21 - and has held. This is the beginning of a text-book trend-reversal breakout. The chart setup is a buy.  But what is it we’re buying?\n\n&#x200B;\n\nhttps://preview.redd.it/dvxgqryh4l971.png?width=694&format=png&auto=webp&s=c5eb3169a68bc1f3b007a499fde379b8bef0c0f1\n\n**So What Exactly is Pubmatic?**\n\nIn short, Pubmatic is an advertising technology company. For most of human history, business owners have been using ads to sell their products, inform their customers of a value proposition, or build brands. With the advent of the internet, “adtech” companies like Google have grown rich and powerful by allowing advertisers to communicate with any type of customer they want, virtually instantaneously, as much as they want. No other form of advertising offers these features and as such, the digital advertising market has become *extremely* complex with hundreds of billions of dollars on the line every year. This trend toward digital advertising is expected to continue (figure 1):\n\nFigure 1 - Digital ad spending worldwide\n\n&#x200B;\n\nhttps://preview.redd.it/e5zfu5zk4l971.png?width=520&format=png&auto=webp&s=9cd713dbe7aad803d15b4b88c393138caede80a9\n\nPubmatic operates and competes in this space, specifically programmatic advertising. Before programmatic, digital ads were bought and sold by teams of people on either side of the equation, which was slow and cumbersome. Now there are scores of companies that have built software and infrastructure that allows digital ad space to be traded programmatically. The market share of programmatic advertising as part of all digital advertising has been on the rise (figure 2):\n\nFigure 2 - market share of programmatic advertising\n\n&#x200B;\n\nhttps://preview.redd.it/bh073a1m4l971.png?width=624&format=png&auto=webp&s=9444f4c9a7635ea35bfcd5b0cd76bdaef28c397c\n\nSince Pubmatic is a programmatic ad company – it is benefiting from these two tailwinds: more ads are becoming digital and more digital ads are becoming programmatic.\n\nProgrammatic channels primarily have two sides to them: the buy side and the sell side. At a basic level, publishers generate revenue by selling digital ad space on their content, and advertisers/marketing agencies will purchase this ad space to place an ad in front of a potential customer.\n\nPubmatic is an SSP or supply side platform. Publishers will integrate and configure Pubmatic’s software to allow for the transactions to take place. Publishers want the best outcomes possible for their ad slots, so more often than not, they’ll integrate with multiple SSPs in an effort to increase their overall yield. I can’t stress this enough: the programmatic ad market is so complex, I would be willing to bet that a single person couldn’t wrap their head around the whole thing. It is mountainous in size. **Trillions and trillions** of programmatic ads are served up across advertising verticals, across global markets, and across billions of devices every month. Any sizable publisher that wants to efficiently sell their inventory at scale must work with an SSP and compete in the broader programmatic ad market.\n\nNeedless to say, most digital channels continued to grow as people spent more time inside and on their devices. Pubmatic’s revenue continued to grow YoY as overall advertising spend took a big hit (due to COVID). The most exciting part about this is that global ad spend is projected to return to its normal growth pattern – you can see this already taking place in figure 3.\n\nFigure 3 - Global Advertising Forecast\n\n&#x200B;\n\nhttps://preview.redd.it/fxd9zrum4l971.png?width=624&format=png&auto=webp&s=bd922d833a0f3c6224f29144a3f9d59a3699e434\n\nSo not only did Pubmatic gain a greater share of the total advertising dollars in 2020, the overall advertising pie is going to grow as well. This rebound in ad spend is yet another tailwind for Pubmatic. If you’re keeping count – that makes three so far:\n\n1. More ads are becoming digital\n2. More digital ads are becoming programmatic\n3. More overall ad spend in the future\n\n**Shut up and talk about the short interest!**\n\nSince short interest is what all the kids talk about these days, that was where we headed to next. In addition to looking at squeeze probability, it is good to know if a company is highly shorted. Most short-sellers know their stuff (except maybe Melvin), and if a company is highly shorted, it’s usually for a reason. $PUBM has short interest that is estimated as high as 50% in some places. We actually believe this to be an inflation due to a quirk in the public float involving share types, which the aggregators such as Bloomberg and others haven’t caught on to yet (will explain later). There is a chance we are incorrect about this, but according to our calculations, the short interest is closer to the 20% mark - which of course, is still very high. Price peaked at $77 during the first week in March, and shorts have hammered it ever since. The question is, why?\n\n**The insider lockup**\n\nLike most newly IPO’d companies, there was an insider share lockup. These insider shares were mostly of the class B variety; these were shares awarded to VC firms and investors that have been with the company since its inception in 2008. PUBM announced during the Spring that those insiders with class B shares (of which there are 40+ million of), were free to sell as of 6/1. While we don’t know if this is what short-sellers had in mind, it is probably a safe bet. A similar situation happened to PLTR a few months back when they had their own insider lockup expiration. So the next question is…\n\n**Did the insiders sell?**\n\nSome did, but not many. It is estimated that roughly 4-6M class B insider shares have been sold - only one firm has liquidated, the other big players are still in. Why are they still in the game? $PUBM has an interesting quirk in their share and voting structure where class B shareholders hold a 10:1 voting advantage over the class A (public float) holders. Their one class B share gets 10 votes per share, vs our 1 vote per class A share. If you want to still retain voting power within the company, you really do not want to sell your class B shares. Furthermore, if class B shareholders sell, it consolidates the voting power of the remaining class B shareholders. Why this is important is because everytime a class B share is sold, it converts to a class A public share; this is what is missing when everyone talks about the short interest. Some of these class B holders have sold, converting their shares into class A and thus increasing the public float, and diluting the short interest. However, most insiders have held - and will most likely continue to hold if they still want a voting stake within the company. Worth noting is that two of the biggest holders, VC firms Nexus India Capital and August Capital, both have seats on the Board of Directors - so it is unlikely that they will sell a meaningful amount any time soon. So the lockup has come and gone without too much damage - share price bottomed out and has now increased. Why else would someone be short?\n\n**The privacy wave**\n\nConsumer data has been called the oil of our generation. All of the data that is generated on your devices is sold, recorded, and analyzed. Companies do this in order to serve you targeted ads based on your spending habits and characteristics. In the past, all of this has been done without the full knowledge or consent of the end user (you). Once people started to realize just how far the tracking had gone, governments and individuals started to demand better privacy from adtech companies. Apple has been leading this effort across the board since privacy has become part of their brand image. Agencies and advertisers have become drunk off of readily available third party consumer data and as the privacy wave makes its way across the world, we’re going to see less third party data available to advertisers.\n\nLast year, Google said they would start phasing out browsers from accepting the third-party cookies that help advertisers, publishers and data brokers profile you to help advertisers target ads toward you. The change would prevent an adtech company  (PUBM) that recorded your visit to a trading website from later showing you ads for that stupid day trader guy with long red hair and a beard (I know you’ve seen those ads before). This in effect would hinder all adtech companies from doing what they do.\n\nBut this dropped two days ago (6/23)\n\n[https://www.cnet.com/news/google-delays-chromes-cookie-blocking-privacy-plan-by-nearly-2-years/](https://www.cnet.com/news/google-delays-chromes-cookie-blocking-privacy-plan-by-nearly-2-years/)\n\nGoogle delayed this cookie phasing out until 2023 so the show goes on (Leo trading gif).\n\n**But cookies ARE eventually going away, right?**\n\nThe adtech industry is addressing this with the use of identifiers, typically in the form of hashed email addresses or phone numbers that are collected upfront from the end users. Pubmatic has been working vigorously on getting these identifiers put in place through the use of their identity hub product, which is identifier agnostic. There is a lot of speculation surrounding which of these identifiers will end up winning, but since Pubmatic can integrate with any of them, they don’t much care which one wins out in the end. Pubmatic’s management will need to keep a close eye on the privacy developments as they move forward, because the sunset of the third party cookie won’t be the only problem. That said, the adtech industry is notoriously finicky, and Pubmatic has been able to keep up with the times. Management has repeatedly said that they take a long term approach toward their investments, and I expect them to continue to be able to deliver value to publishers and agencies as these investments like Identity Hub pay out. While the privacy wave is a headwind, Pubmatic has been working on addressing it for years now. In aggregate, Pubmatic has a lot more going for it than against it. Next stop… financials.\n\n**Financials.**\n\n*Revenue acceleration* (% are YoY growth rates - from right to left) :\n\n&#x200B;\n\nhttps://preview.redd.it/xatm11bo4l971.png?width=624&format=png&auto=webp&s=7309e0ed0a96f48232d5cdf267a3105088e86241\n\nI’ve seen this sort of thing in the past (Etsy, Livongo, The Trade Desk for example) where a company finds its stride. This revenue growth is twice that of the larger industry, so we can assume that Pubmatic has indeed found its stride and is gaining market share. Management has echoed this sentiment.\n\nOne important risk to note is that Verizon Media accounts for 20% of their total revenue (taken from their first quarter prepared remarks):\n\n&#x200B;\n\nhttps://preview.redd.it/ykm8t4at4l971.png?width=624&format=png&auto=webp&s=08551f2ffad273a1601db701fe558a671e050064\n\nIt’s good that this percentage has been coming down as they gain market share, but we’ll want to keep an eye on that over time to make sure it continues to trend in the right direction. Also the partnership is growing over time - this is an example of SSP consolidation.\n\n*Gross Profit:*\n\nPubmatic operates with a high gross margin, as you would expect from a cloud-based software company. Their gross profit has also been trending upwards, so they are gaining more efficiency as they develop. Their long term gross margin target is 70%, which has already been achieved.\n\n&#x200B;\n\nhttps://preview.redd.it/dc70fn7s4l971.png?width=624&format=png&auto=webp&s=83f35e2160b8e1fe72a6a7265dddf7c7c16258bb\n\n*Net Income:*\n\nWhat’s more, their 2020 net profit fell in line with a highly efficient cloud computing company.\n\nWall Street analysts aren’t predicting their profitability properly. If we assume a 20% net margin on $200 million in revenue for 2021, earnings per share is going to be 81 cents based on 49 million outstanding. Current estimates are only showing a high estimate of 38 cents per share, much lower than what should be achievable for Pubmatic. They’ve already handily beat earnings for Q1 so they are well on their way toward the \\~80 cents figure. If they can hit these numbers, **their PEG stands at .63** at the time of writing.\n\n&#x200B;\n\nhttps://preview.redd.it/7m4j82nu4l971.png?width=624&format=png&auto=webp&s=2cd86187230bf538302d98f4b3c5dd9f86de06a3\n\n*Financial summary:*\n\nPubmatic is a highly profitable company, in a growth industry, that is stealing market share, and has **no debt**. Wall Street is underestimating them, while trading at a lower valuation than competitors ([https://twitter.com/HsSajwani/status/1403342066445283330/photo/1](https://twitter.com/HsSajwani/status/1403342066445283330/photo/1)).\n\n&#x200B;\n\nhttps://preview.redd.it/a77fasyv4l971.png?width=480&format=png&auto=webp&s=e6d27426fbe56a2787b39f66e2a8abd6f56e184e\n\n**In closing**\n\nWe don’t know why anyone would be short this company. Maybe there is something under the hood that we are not privy to, but we only know what’s publicly available, and everything looks really clean. I suspect shorts are closing - there’s no reason not to. But the beauty of this potential play is you can attack this from multiple angles. Want to play the short squeeze? Go ahead - it’s a possibility. Want to play the value investor? That works too - Pubmatic is undervalued compared to its peers. How about growth? The digital advertising industry is accelerating, and PUBM is still trading at levels below its valuation.  How about a market mechanics liquidity play (see the bonus section)? Want to play the chart? Easy reversal pattern and ride that trend with the accompanying volume.\n\nBottom line is, most trading opportunities offer one or two avenues for profitability - PUBM has lots of different pathways for success - pick a path that suits your risk tolerance and hope the market doesn’t shit itself.\n\nA wise trader once told me,\n\n“You can either trade for justice, or for profit, but not both”.\n\nPubmatic may just offer the rare opportunity to trade for both.\n\n**The plan**\n\nShares and the limited calls are what’s recommended for now. As some of you may have noticed, PUBM did not have an options chain up until 6/25. Some limited strike prices have been added, but still not enough. Pound ‘em and make our friendly brokerages add more. PUBM managed to get to $77 without the aid of options leverage so I see no reason why a revisit of that price is unattainable by summer’s end with the company and industry tailwinds. Considering that any case for shorting PUBM has been removed, it appears a new trend is starting. Where things may get a little spicy is in the bonus section - and it is in regards to the restricted liquidity.\n\n**Bonus section - “if it ain’t tight, it ain’t right”**\n\nThe liquidity for PUBM is very, very tight. If you’ve been watching the intraday movements at all, you’ll notice a barren orderbook, with share bid/ask spreads routinely above $.50, and sometimes even in the dollar range. Exacerbating the already restricted float is the high institutional ownership - which currently sits at 74%. With most of the shares sitting in the coffers of big players, there aren’t many shares exchanging hands on a day-to-day basis - which makes for wild price swings.  What makes this interesting is that as mentioned in the paragraph above - options were just introduced as of 2 weeks ago. This is very unusual for a $1.5B market cap company that has been traded for over 6 months. Only minimal strike prices and dates have been added thus far, with more additions anticipated. The more strikes that get added, and the more OTM call bombs that people lob PUBM’s way, the more interesting and volatile things can get. I say again, PUBM accelerated into the 70’s after IPO, without the aid of options dynamite. With the company and industry headwinds dulled for now, sprinkle in the FD leverage and anyone short should probably pack up their bag, cash in their tickets, and GTFO.\n\nTrade responsibly and good luck!\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/8olrsoq1rm971.png?width=1005&format=png&auto=webp&s=496de8a06415a846c65dabea972059a3bcee866e", "id": "oettyj", "created_utc": 1625574176.0, "score": 379, "upvote_ratio": 0.9, "num_comments": 89, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|1 month ago\n**Total Comments**|17|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/nh8f2j/pubm_dd_1/) \n**Account Age**|1 month|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": [{"body": "Positions screenshot u/sectorpotential2083", "score": 2, "replies": []}]}, {"body": "Wow. Allstar cast for this DD", "score": 60, "replies": [{"body": "Pretty much hop in whatever uber mentions he is in at this point haha.\n\n500 shares and slowly adding", "score": 20, "replies": []}]}, {"body": "The options prices have started to stabilize since they created the chain. I'll look for calls this week in addition to the shares I just bought.", "score": 34, "replies": []}, {"body": "Now THIS is a DD I can get behind! I’m in", "score": 36, "replies": []}, {"body": "I first read 'Pubematic' and I gotta say... it sounded way more interesting.", "score": 28, "replies": []}, {"body": "Great DD. All in!!", "score": 26, "replies": []}, {"body": "Didn't even read anything, I'm in!", "score": 21, "replies": []}, {"body": "lots of words and pics im in", "score": 21, "replies": []}, {"body": "Great DD! I am in.", "score": 20, "replies": []}, {"body": "All in let’s moon🚀🚀🚀", "score": 15, "replies": []}, {"body": "I've been in PUBM since IPO, glad some others are picking it up!", "score": 17, "replies": []}, {"body": "Awesome DD", "score": 18, "replies": []}, {"body": "Low liquidity and high institutional ownership? Man, I'm sold.", "score": 28, "replies": []}, {"body": "Cheers pal! Good read and summarization of the notes to the SFP. This is the type of DD that makes my heart warm", "score": 21, "replies": []}, {"body": "Be fucking careful.\n\nI worked in adtech for a long time.  That's how I made my money.\n\nThere are a million SSPs out there.  The margins tend to be shit.  The reason is that anyone can build an SSP (it's not hard) and it's basically printing money.  So you get ridiculous margin compression -- it's a race to the bottom on prices.\n\nThe only way to succeed is to have a platform (for something other than ads) that has a lot of users,  allows you to collect maasive amounts of data, and use that data to serve better ads.  Eg: Google, Facebook.  Both have very successful SSPs because they use their user data to pick better ads to show.\n\nTo make matters worse the big guys can set their own rules and people will play by them.  For example Facebook does self-attribution.  That means that if you see an ad from FAN and you later install the app, FB will charge the advertiser for it.  This is true even if you later (but before installation) saw a different ad from the same app and a third-party attribution provider attributes the install to a different SSP -- in this case the advertiser gets double-charged (Facebook does not participate in 3rd-party attribution).  If the advertiser doesn't like these rules they are free not to advertise on FAN... but of course almost no one does that.\n\nI would generally recommend against a pure SSP play.  They are fighting an uphill battle against the big platforms.  This war is won and lost with data, and they will never have as much or as relevant data as the big guys.\n\nSo, yeah, be fucking careful.  The shorts are short for a reason.", "score": 21, "replies": [{"body": "You are correct that Pubmatic is not as big as the the other players you mentioned (Google, FB), but Pubmatic isnt small either and they've been seeing consolidation of spend onto their platform. It's one of their growth drivers. They also have a scale large enough now that their profits margins are in line with the best adtech companies - Google and FB including. Pubmatic is decently well diversified and they've been working on their relationships with agencies/advertisers for some time now. They also have a good cash pile that they can use to make a strategic M&A, which could help them further diversify. \n\nRight now their revenue is accelerating and their margins are expanding. It'll be important to watch this trend to make sure it doesn't reverse. \n\nOverall I think you've highlighted the primary risk with PUBM, but I must say - the management team knows and is working diligently to address it. They have been quite successful so far by every measure.", "score": 19, "replies": [{"body": "Agree. Tough model to make work without something unique. Better to invest in ad tech that’s native to a community eg ETSY and AMZN. They aren’t at the whims of the platforms like Apple GooG and FB that can change their minds on what ads are allowed. Too much risk for me, given all the privacy policy coming.", "score": 1, "replies": []}]}, {"body": "I think you just saved me from a bad investment.", "score": 3, "replies": [{"body": "Personally I think that the risks are manageable and that their growth will continue. Management team has a long term growth target of 20%. If they can manage these risks, I don't see any reason why they won't hit that target. Good luck to you", "score": 5, "replies": []}]}, {"body": "Very interesting", "score": 2, "replies": []}, {"body": "You’re 100% right, I would not invest in this", "score": -4, "replies": [{"body": "You must hate money?", "score": 2, "replies": [{"body": "I’m in the industry and I know how these 3rd party programmatic networks are struggling.  Also this DD is way too well put together, it’s suspicious", "score": 2, "replies": [{"body": "There are a lot of struggling players right now, but Pubmatic isn't one of them. Somehow through it all they've managed to build a company with very strong profitable growth. \n\nThere are changes on the horizon for adtech, and that's the risk here, but every investment involves risk. Given Pubmatic's strong history, it seems to be one of the good adtech companies and not one of the poorly run ones.", "score": 5, "replies": []}]}]}]}]}, {"body": "Good DD! Why did you thank yourself in the beginning though?", "score": 12, "replies": [{"body": "just extra thankful", "score": 9, "replies": []}, {"body": "Everyone that made a contribution was credited, including myself.", "score": 2, "replies": []}]}, {"body": "Bought 2 $35 October contracts to start. Playing it safe. Surprised this hasn’t received more attention. Similar set up to NEGG. I like this play.", "score": 10, "replies": []}, {"body": "To the moon! 🚀", "score": 7, "replies": []}, {"body": "So I skimmed through... what's your estimate of the float? Can you bound it to within a range for us to get a better idea?", "score": 8, "replies": [{"body": "It's tough to say, but the public float (Class A shares) is somewhere between 8 -13 million shares", "score": 10, "replies": [{"body": "Thanks! I'm in", "score": 7, "replies": [{"body": "We're positive it's being underreported at 9. Closer to 13-14M. Aggregators won't pick this up until the company publishes it's next quarterly report. Still really fucking small though", "score": 6, "replies": [{"body": "thanks for the update! Great DD", "score": 3, "replies": []}]}]}]}]}, {"body": "Didn't even read the DD.  I'm all in.", "score": 8, "replies": []}, {"body": "lots of c0ck and b4lls in the charts. this thing is going to m00n.", "score": 7, "replies": []}, {"body": "I’m in deep balls", "score": 8, "replies": []}, {"body": "Seems like this is a great example of a *quality*/*legit* company that also has some of the characteristics that have led to parabolic runs on other tickers. Thanks for posting!", "score": 6, "replies": []}, {"body": "I just bought some", "score": 7, "replies": []}, {"body": "it took a while to scroll all the way to the bottom it must be good, im in!", "score": 7, "replies": []}, {"body": "Fun read from the 6 sentences I understood. Thank you all for writing it and ill definitely keep an eye on it!", "score": 6, "replies": []}, {"body": "Wow this is such good DD! Thank you 🙏", "score": 7, "replies": []}, {"body": "This could actually squeeze hard small float + high short interest it the ingredients for it🚀🚀🚀", "score": 15, "replies": []}, {"body": "I have this and MGNI.", "score": 4, "replies": []}, {"body": "would july calls be a good call?", "score": 6, "replies": []}, {"body": "I like this. Here is my trade. I will buy the equivalent of $20,000 in calls and do a PMCC. So at $25, that is 571 shares or five calls:\n\nBuy 5 Jan 21, 2022 25 Calls and Sell 5 Aug 20, 2021 45 Calls for a total debit of $11.55. I will wait until market opens to confirm this price is still accurate!\n\nLet's Hope for the best!\n\nEdit: Since PUBM did not hold today, I did not enter this trade. I will wait until price hits $30, then re-assess!", "score": 5, "replies": [{"body": "It's not hitting $30. Took off after hours today.", "score": 5, "replies": [{"body": "I couldn't try to enter yesterday. My trading platform was bigger down and couldn't try. I may try again, but may have also missed my opportunity since it did not hit $30!", "score": 3, "replies": []}]}]}, {"body": "I have been keep buying this one, hope to see the squeeze soon. Most of their people are in India , that is why they get their cost down,  I do see it as a long term growth.\n\nI have put 600 shares at cost of 33, hope it stop dipping", "score": 4, "replies": [{"body": "Lucky you, stock has taken off. Might be $60 tomorrow.", "score": 4, "replies": []}]}, {"body": "Damn, I didn't see this until right now. Looks like I missed another pump. Fuck.", "score": 3, "replies": [{"body": "This isn't a P&D at all. PUBM is legit. Check out analysts ratings, financials, etc...has bonus moon potential and the dumpers did their thing at open and it is back on sale again!", "score": 8, "replies": []}]}, {"body": "“You can’t trade for justice and profit” \n\nMeme-that-shall-not-be-named  has entered the chat \n\n\nOk on a serious note, I sincerely applaud the beautiful write up andhard work that you have put into creating this thesis, thank you for that and as usual while it’s not financial advice IM ALL IN", "score": 4, "replies": []}, {"body": "I don’t hold a position here. Short interest and PA looks to me similar to PIPE investors in SPACs. Short the spike then sell after the lockup.  Seems like an okay company with good financials but this isn’t a purely price dislocation play imo- it’s a growth bet.", "score": 9, "replies": [{"body": "\\*yet :D", "score": 10, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Ladies and gentleman.... we got em", "score": 7, "replies": []}, {"body": "If we get a gamma squeeze going and hype up a short squeeze these thing could go up bigly.", "score": 3, "replies": [{"body": "This thing isn't going to gamma squeeze lol. Look at the options chain; very low volume and OI.", "score": 1, "replies": [{"body": "That's why we gotta pump it. For good reasons or bad. But mostly good I hope.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "why not play all of adtech then? im surprised there's no mention of $DV in here", "score": 5, "replies": [{"body": "No problems with that - PUBM just has some extra frills that makes the play interesting", "score": 9, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "How come the short squeeze score is only 80 with such high short interest? Days to cover seems low too...", "score": 2, "replies": []}]}, {"body": "I called this one at around $29 but sold when it hit $40.  Company has solid financials but with options starting to trade the gamma squeeze already happened, will need a catalyst to get it back over 40.", "score": 3, "replies": [{"body": "Gamma squeeze definitely did not happen.", "score": 16, "replies": [{"body": "Agree. Yet…..", "score": 6, "replies": []}]}]}, {"body": "Hey guys. What are your thoughts on the technical picture a week down the line on PUBM?\n\nTo me, it looks like the inverse H&S has failed, and the attempt to close back above the neck line has failed. The most recent RH also appears to fall along the primary downtrend line.\n\nMACD crossed below a few days ago and EMA13/MA20 isn't looking happy either.\n\nAs much as I'd love my PUBM position to work I'm not seeing an immediate turnaround :(\n\nhttps://imgur.com/a/Tv5FSU7", "score": 2, "replies": []}, {"body": "This stock currently isn’t at a 52 wk high so this dd is garbage", "score": -8, "replies": []}, {"body": "[deleted]", "score": -14, "replies": []}, {"body": "GME & AMC only. Sorry", "score": -8, "replies": [{"body": "No one cares. You can own more than 2 stocks. I own those and 15 more.", "score": 2, "replies": [{"body": "Wasn’t asking you to care PB", "score": 1, "replies": []}]}]}, {"body": "Need shorts to feel pain!", "score": 1, "replies": []}]}
{"title": "When You Paperhand Amzn and it jumps up another 6K.", "selftext": "", "id": "of559d", "created_utc": 1625608832.0, "score": 278, "upvote_ratio": 0.86, "num_comments": 83, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|4 weeks ago\n**Total Comments**|2|**Previous DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Wife has been getting on me to sell my old work Amazon shares for years now and been ignoring her for all these years. We ended up getting a financial advisor and he told me to sell. Ignored him to. \n\nNow I’m the financial advisor.", "score": 308, "replies": [{"body": "Good shit. Amazon stocks are mint", "score": 46, "replies": []}, {"body": "Look at him. He is the financial captain now.", "score": 32, "replies": []}, {"body": "Yeah they're both dumb and you're smart.  Amazon hasn't even begun yet.  The day they flip the switch and are handling all the packing, sorting, and delivery purely by robots AMZN will easily be a $10T company.   When they remove the human element this stock goes parabolic.  I give it 5-10 years.", "score": 16, "replies": [{"body": "Most of their revenue is from aws not their online retail fyi. Not saying there's not more room for growth just they retail is a small portion", "score": 5, "replies": [{"body": "Most of their *profit* is from AWS. Most of their revenue is still from selling shit on their website", "score": 4, "replies": []}, {"body": "False.  https://images.app.goo.gl/tM7JYT8eVHeKqXQ37", "score": 2, "replies": [{"body": "That looks like a wonderful source.....", "score": 0, "replies": [{"body": "Prove it wrong.  I make trades based on data, not redditors.", "score": 1, "replies": [{"body": "I dont need to prove anything. Definitely not to a redditor either. What's happening at the eyes of the SEC level is not what the bis is actually doing. That picture and data would look much different and more numbers behind the decimal. If I have to file something there is always am amount of plausible deniability in the result I provide to whomever. Filing takes time if someone's job is to manage that part of a biz time then there is a moment for Error there always is. Sometimes that can mean alot. If you make financial decisions based on your quality of data that's your choice. As is mine, to choose not to believe a screenshot or Google images link  as a visual aid as the one you chose. \n\nMinds all work differently and perspective is only  a way to see something. There are other senses to consider when thinking out loud.  -JT", "score": 3, "replies": [{"body": "So you're saying that amazon is somehow hiding from the SEC that in fact the majority of their business comes from AWS and not retail?  Oookkaaayy.  That's a new one.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Why the fuck would you ever sell out of Amazon? It's the greatest compounder with guaranteed 20+% growth every year.", "score": 21, "replies": []}, {"body": "What about wifes boyfriend? Did he at least take your side for an even 2-on-2?", "score": 7, "replies": []}, {"body": "Rough ride. They tore it up until mid 2018, sat flat for nearly two years until COVID, rocked straight up by a third, then spent another year treading water. I'm overweight (morbidly obese if you ask my doc) but if it weren't for my aversion to paying taxes my hands might be a bit weaker.", "score": 5, "replies": [{"body": "Lol are you me? \n\nSAme. Biggest reason I don’t wanna sell is because of the huge swinging hammer of capital gains. 15% of something that has tripled/quadrupled is a shit fest. \n\nI don’t need the money in my bank account and the rate of return still out paces anything else on The market. So it sits. Like a happy little fat bird. Just eating and shitting without a care in the world.", "score": 3, "replies": []}]}, {"body": "Mad tho, even at all time highs amazon has a long long future good call!", "score": 2, "replies": []}]}, {"body": "I sold Biontech Knockout calls at 160$ for 14000$.\nThey would be 70000$ now. \nI also sold AMC at a loss at 10$. \nI also sold GME at a 10k loss at 60$ and sold again at a loss at 170$. \nSo don't call yourself paperhand please.", "score": 136, "replies": [{"body": "Yup. Name checks out.", "score": 58, "replies": []}, {"body": "Whats your next stock you're planning on selling im going all in.", "score": 15, "replies": [{"body": "Wish ;) Not selling soon though. Maybe I will make a post when I sell, to let you know.", "score": 8, "replies": []}, {"body": "I’m doing amd calls, Google calls, and tsla calls", "score": 7, "replies": []}]}, {"body": "Your hands are so paper I bet you don’t even need toilet paper!", "score": 5, "replies": [{"body": "Hey, atleast I can save some bucks there", "score": 5, "replies": [{"body": "Can’t disagree with the math.", "score": 3, "replies": []}]}]}, {"body": "You obviously hate money 🤣", "score": 2, "replies": [{"body": "No, the money hates me! 🤧", "score": 4, "replies": [{"body": "Hold something longer than a freaking month or 2 and you'll have better results.", "score": 3, "replies": []}]}]}, {"body": "I sold GME with a 15K loss at $11 :-D", "score": 2, "replies": []}, {"body": "what are knockout calls", "score": 1, "replies": [{"body": "For example: I bought 17000$ worth of Biontech Knockout short warrants at a share price of 203$ with a 50x leverage on May 2nd. The Knockout Price was about 208 USD. When the stock kept rising and it reached the 208$ all my money was gone immediately. Only took about 20 minutes from purchase to total loss.\n\nKnockout Call would be the opposite direction.\nSo the Biontech calls I had back in April had an Knockout Price of 152$. I bought in at a share price of ~ 157$ and I paperhanded when the stock was 160$.", "score": 2, "replies": [{"body": "50x leverage…bruh, where did you even get that?", "score": 3, "replies": [{"body": "Flatex", "score": 1, "replies": [{"body": "True retard", "score": 3, "replies": []}]}]}]}]}, {"body": "r/usernamechecksout", "score": 1, "replies": []}]}, {"body": "i held ages when its red and sold once they broke even 🤡🤡🤡🤡🤡", "score": 22, "replies": []}, {"body": "Better to cry over gains than losses but rip none the less.", "score": 22, "replies": [{"body": "I take every dollar I aint make as a dollar I lost.", "score": -31, "replies": [{"body": "Do that with brain cells", "score": 28, "replies": []}, {"body": "Well then you’re fucking broke :[", "score": 13, "replies": [{"body": "Ma’am, this is a Wendy’s.", "score": 6, "replies": []}]}]}]}, {"body": "I sold my 7/9 3500 call at open at 3530 🤡\n\n[regret](https://imgur.com/a/V6aRYSe)", "score": 9, "replies": [{"body": "thank you for this mannnnnnnnn!!!!!", "score": 2, "replies": []}]}, {"body": "Good job retard 👏", "score": 8, "replies": [{"body": "Who thought it would break an all time high. I did but my balls weren't big enough.", "score": 3, "replies": [{"body": "The only reason it went up is because you sold", "score": 13, "replies": []}]}]}, {"body": "Hindsight is always 20/20", "score": 6, "replies": []}, {"body": "I just started working there, looks like the investors found the move bullish to say the least…", "score": 5, "replies": []}, {"body": "I find it funny that people are yoloing on the stocks they do and then we have this guy who paper handed amazon. I'll admit that I know jack shit about stocks but that was a dumb play even by a newbies standard.", "score": 4, "replies": [{"body": "To be fair I’m 18", "score": 1, "replies": [{"body": "I'm not that much older, I just got into the stock market recently myself. To me Amazon is just a pretty obvious play when you zoom out to like a 5 year chart. Not financial advice btw.", "score": 1, "replies": []}]}]}, {"body": "Hindsight is always 20/20", "score": 3, "replies": []}, {"body": "Happens all the time. Nobody squeezes every $ out of a trade. All you can do in these situations is roll up to a higher strike so you’re still in the trade but your position is paid for with profits. \n\nThere good chance for re-entry today on that pullback near 3600 as well. Don’t beat yourself up just take note on what you could’ve done differently. There is always another opportunity coming.", "score": 2, "replies": []}, {"body": "Sold 3400 put on 6/22. Up nearly 11k. Feeling mighty smart. Obviously it’ll crater later. 😁", "score": 2, "replies": []}, {"body": "What does green mean? Not familiar", "score": 2, "replies": []}, {"body": "I Am SURE it's been said but why does it seem like this just so happen to line up good for a idk Nancy Pelosi. She just dumped massive money and it goes up. Other APES do that and it goes down?  I see a trend. Cant we expose the hell out of that? I want to know who processed that money? I want transparency that shows all players of the casino. They claim its a fair market...prove it.. How crazy would the reddit power be to see her name blasted as the most talked about name for abuse  of power and manipulation, any news outlet to say her name has been most discussed. Talk about untouchable why is she?. If she goes then so do many. One day the power will be strong enough to make such a change we are the people all see it.... Don't talk about it be about it.", "score": 2, "replies": []}, {"body": "Sold at 2.2K fuck my life", "score": 5, "replies": []}, {"body": "Huh? Option closed lower than in screenshot. If you sold for $80/share ur good.", "score": 1, "replies": []}, {"body": "Mrin just released options today. 168% short interest and cost to borrow around 330%. Free float around 10 million", "score": -1, "replies": []}, {"body": "Is it too late for calls in amzn yall think? Will this happen again tomorrow?", "score": 1, "replies": [{"body": "Buy dips, not momentum.", "score": 6, "replies": []}]}, {"body": "Grats doe", "score": 1, "replies": []}, {"body": "Sold amzn and bought CLOV lmao\nIm a Tard", "score": 1, "replies": []}, {"body": "Makes me wonder if I have any shares because I use to work for them. I never understood any of this until recently thanks to this sub btw and my wife and I bought our first shares last week in wish.", "score": 1, "replies": []}, {"body": "Amazon makes its workers shit in bags….boycott Amazon.", "score": 1, "replies": []}, {"body": "I mean it’s Amazon. Come on now.", "score": 1, "replies": []}]}
