{"title": "Microsoft beats earnings and revenue expectations as the company releases Q2 report", "selftext": "Microsoft released its fiscal fourth-quarter results on Tuesday.\n\nHere’s how the tech giant fared in the quarter relative to what analysts polled by Refinitiv expected:\n\nEarnings: $2.17 per share vs adjusted $1.92 per share expected\nRevenue: $46.15 billion vs. $44.24 billion forecast\n\nHere’s some more info from Microsoft’s own report:\n\nRevenue was $46.2 billion and increased 21%\n\n·        Operating income was $19.1 billion and increased 42%\n\n·        Net income was $16.5 billion and increased 47%\n\n·        Diluted earnings per share was $2.17 and increased 49%\n\n“We are innovating across the technology stack to help organizations drive new levels of tech intensity across their business,” said Satya Nadella, chairman and chief executive officer of Microsoft. “Our results show that when we execute well and meet customers’ needs in differentiated ways in large and growing markets, we generate growth, as we’ve seen in our commercial cloud – and in new franchises we’ve built, including gaming, security, and LinkedIn, all of which surpassed $10 billion in annual revenue over the past three years.”\n\n**Business Highlights**\n\nRevenue in Productivity and Business Processes was $14.7 billion and increased 25% (up 21% in constant currency), with the following business highlights:\n\n·        Office Commercial products and cloud services revenue increased 20% (up 15% in constant currency) driven by Office 365 Commercial revenue growth of 25% (up 20% in constant currency)\n\n·        Office Consumer products and cloud services revenue increased 18% (up 15% in constant currency) and Microsoft 365 Consumer subscribers increased to 51.9 million\n\n·        LinkedIn revenue increased 46% (up 42% in constant currency) driven by Marketing Solutions growth of 97% (up 91% in constant currency)\n\n·        Dynamics products and cloud services revenue increased 33% (up 26% in constant currency) driven by Dynamics 365 revenue growth of 49% (up 42% in constant currency)\n\nRevenue in Intelligent Cloud was $17.4 billion and increased 30% (up 26% in constant currency), with the following business highlights:\n\n·        Server products and cloud services revenue increased 34% (up 29% in constant currency) driven by Azure revenue growth of 51% (up 45% in constant currency)\n\nRevenue in More Personal Computing was $14.1 billion and increased 9% (up 6% in constant currency), with the following business highlights:\n\n·        Windows OEM revenue decreased 3%\n\n·        Windows Commercial products and cloud services revenue increased 20% (up 14% in constant currency)\n\n·        Xbox content and services revenue decreased 4% (down 7% in constant currency)\n\n·        Search advertising revenue excluding traffic acquisition costs increased 53% (up 49% in constant currency)\n\n·        Surface revenue decreased 20% (down 23% in constant currency)\n\nMicrosoft returned $10.4 billion to shareholders in the form of share repurchases and dividends in the fourth quarter of fiscal year 2021, an increase of 16% compared to the fourth quarter of fiscal year 2020.\n\n**Shares are down about 2% after hours** \n\nSo good beat by Microsoft. Nice to see the high growing areas line LinkedIn, Azure do well. Was surprised to see Xbox revenue decrease, but maybe we’ll hear more about that on the call.\n\nMicrosoft earnings are out – here are the numbers https://www.cnbc.com/2021/07/27/microsoft-msft-earnings-q4-2021.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard", "id": "osu6yl", "created_utc": 1627416530.0, "score": 252, "upvote_ratio": 0.96, "num_comments": 81, "comments": [{"body": "And as per tradition, MSFT shares drop in price.", "score": 143, "replies": [{"body": "[deleted]", "score": 71, "replies": [{"body": "that's just how it works.\n\n\\- MSFT starts to ramp quietly weeks in advance of earnings\n\n\\- late bulls buy calls two days in advance, expecting a 5% pop\n\n\\- MSFT goes red after hours, bears get excited. it's finally going down! they buy puts first thing in the morning\n\n\\- MSFT trades flat for weeks afterward, screwing both bears and bulls\n\n\\- Ken Griffin, CEO of Citadel pockets both their money and buys another summer house in the Hamptons\n\n \\- MSFT starts to ramp quietly weeks in advance of earnings", "score": 47, "replies": []}, {"body": "Everyone always saying \"it's already priced in\" is annoying as fuck, but I mean..... 😐", "score": 31, "replies": [{"body": "To be fair most of these tech companies have had a few weeks of run up. MSFT been going upward since the last dividend date. If your holding shares or long calls you really got nothing to worry in a week or two, will be back up. Really only options players trying to play earnings getting smoked and they (I) should know better.", "score": 16, "replies": []}, {"body": "The saying \"Buy the rumors, sell the news\" can't be truer.", "score": 3, "replies": [{"body": "Yeah but with these big tech it should be buy the rumours, buy the news. Buy the buy and then buy buy buy", "score": 6, "replies": [{"body": "Actually, I can't argue with that. Big Tech seems to be an exception.", "score": 2, "replies": []}]}]}, {"body": "After buying into the \"you can't time the market\" speech, no one wants to admit someone is timing the market...", "score": 2, "replies": [{"body": "“Regulars” can’t time the market. Institutions make the timing.", "score": 3, "replies": []}]}, {"body": "It is annoying, but it's also true. But what is even more annoying are the people going \"Great Earnings? Stock goes down roflmao\"", "score": 2, "replies": []}, {"body": "That's what happens when companies keep issuing guidance that is purposefully underestimated so that they can crush the estimates. It becomes expected.", "score": 1, "replies": [{"body": "It's not Microsoft, but Apple hasn't released guidance in the past six quarters", "score": 1, "replies": []}]}]}, {"body": "Except for CRM that I decided to sell before earning. You are all welcome!", "score": 2, "replies": []}, {"body": "Thing is, when the P/E is really high, even a great earnings beat likely won't push the stock higher, all that insane growth has already been priced in.", "score": 1, "replies": []}]}, {"body": "Whatever we all know MSFT will only go up long term", "score": 3, "replies": []}]}, {"body": "Can’t wait to buy the dip that’s coming to tech this week", "score": 37, "replies": [{"body": "QQQ baby", "score": 1, "replies": []}]}, {"body": "Msft getting slammed in AH\n\nedit: looks like it's up, thanks to those you replied. \n\nHope it'll stay green tmr!", "score": 43, "replies": [{"body": "It's back in the green now after good guidance...spiked up $10 in a few seconds.", "score": 17, "replies": [{"body": "It happened so fast it was confused AF", "score": 6, "replies": []}, {"body": "thanks!", "score": 2, "replies": []}, {"body": "Damn it... I was hoping to buy the dip tomorrow", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "thanks!", "score": 2, "replies": []}]}]}, {"body": "$MSFT is absolutely killing it; monster beat of already gigantic expectations. I'll be betting the house on it at open tomorrow, seeing this after hours drop. It will be $300+ by EOY, easily.", "score": 46, "replies": [{"body": "More like EOW, it already recovered", "score": 7, "replies": []}]}, {"body": "Buy the dip now or wait few days?!", "score": 14, "replies": [{"body": "Remember that MSFT is likely to go low in September/October, this is usually the worst time for the stock market. May be best to buy then", "score": 9, "replies": []}, {"body": "don't delay", "score": 3, "replies": []}, {"body": "Now.", "score": 2, "replies": []}, {"body": "I am buying some now and will buy some later if it dips more", "score": 1, "replies": []}]}, {"body": "Glad it dropped. Will be buying more 😎", "score": 16, "replies": []}, {"body": "What's with the AH drop? I also read they lost the $10bn DoJ contract. Is that the reason for the drop?", "score": 8, "replies": [{"body": "Microsoft always drops after good earnings.", "score": 25, "replies": [{"body": "It's also up massively the past three weeks", "score": 3, "replies": [{"body": "3 weeks up, 1 week down...it's ok", "score": 2, "replies": []}]}]}, {"body": "Besides what others have said, and from what I read, Microsoft is now in a joint contract with Amazon with the Doj, so they didn’t completely lose out on that contract.", "score": 5, "replies": [{"body": "Nope, JEDI is completely cancelled and back to the drawing board. What Microsoft has is a separate deal with the US Army $22 billion deal:\n\n[https://news.microsoft.com/transform/u-s-army-to-use-hololens-technology-in-high-tech-headsets-for-soldiers/](https://news.microsoft.com/transform/u-s-army-to-use-hololens-technology-in-high-tech-headsets-for-soldiers/)\n\nInteresting that nobody is talking about this! I wonder if Amazon will file a lawsuit about this, even though they have no AR product.", "score": 2, "replies": []}, {"body": "This is incorrect on multiple levels. The cancelled $10bn contract was with DoD and the contract’s successor hasn’t even been drafted and released yet. US Government is slow", "score": 0, "replies": [{"body": "[I guess you didn’t get the memo](https://about.bgov.com/news/microsoft-amazon-to-split-contract-as-10-billion-deal-canceled/)", "score": 1, "replies": [{"body": "I’ve worked in this space for about a decade so I very much did. A few things:\n\nThis is a bit basic but, the Department of Justice (DoJ) isn’t the same agency as Department of Defense (DoD). DoJ is the department-level agency for the FBI, Bureau of Prisons,\nATF etc etc. DoD is Army, Navy, Marines etc. DoJ and DoD have very distinct missions and massively different IT budgets. \n\nThe JWCC that will eventually replace JEDI hasn’t been released yet so neither AWS nor Microsoft have received a penny from it. From the very first sentence of your article: \n\n> The department **plans** to replace JEDI with the Joint Warfighter Cloud Capability.\n\nFederal procurement is notoriously slow. JWCC is a bridge contract until 2025 but both AWS and Microsoft already have multiple, large contracts with DoD components. I’d suspect they’ll continue to mostly use those to sell cloud services vs use this stopgap.", "score": 0, "replies": []}]}]}]}]}, {"body": "A solid earning report, just keep holding and it will be $300 soon.", "score": 6, "replies": []}, {"body": "Incredible earnings, Azure is a beast and doesn't show any signs of slowing down.\n\nThe Xbox revenue decrease is unsurprising--they had *mammoth* revenues last year because of Covid, and with their move to Games-as-a-service through Game Pass some short term decreases are to be expected until more Xbox owners start using the service (upfront hardware revenues from consumers buying the console vs. sustained subscriptions).", "score": 13, "replies": [{"body": "I have a feeling game pass will be a huge boost in the coming years", "score": 3, "replies": []}, {"body": "Thoughts about the decline in Windows OEM?\n\nAlso thought the 25% Office 365 was a little less than expected.", "score": 1, "replies": []}]}, {"body": "Just scooped up that nice dip", "score": 5, "replies": []}, {"body": "Haters just don't want to give boring Buffet types credit for investing and profiting in Apple, Microsoft, Amazon etc. But it is the best play and I proudly own stocks in all three. Wallstreetbets image graf coming soon ---]\n\nThose earnings are not human!", "score": 5, "replies": []}, {"body": "well there go my 8/13 285C profits", "score": 2, "replies": [{"body": "Wrong", "score": 1, "replies": []}]}, {"body": "I expect Xbox revenue to keep declining until they really perfect game pass. Right now they've been spending a ton of money on promotions and the games themselves but I think costs will get better for them as time goes on.", "score": 2, "replies": [{"body": "They also are and will need to spend a fortune on upgrading infrastructure.   So far xCloud has scaled very poorly.", "score": 2, "replies": []}]}, {"body": "The absolutely most stonking stat for me is 35% of revenue was net income. That absolutely STOMPS all over everyone else including Apple & Google. The means if Microsoft increases revenue to $60 billion in quarter, net income is likely to be $21 billion.", "score": 2, "replies": []}, {"body": "Started buying this great company at $60.. buy and hold baby", "score": 3, "replies": []}, {"body": "I thought apple owned beats.", "score": 4, "replies": []}, {"body": "MSFT doing me proud as my ultimate tech play with diversification in software, cybersecurity, and gaming. Growth is guaranteed and the dividend will be a gift that will keep on giving. And of course, it dips! You know you've got stock in a good company when it sells on great news. Long on the stepchild of FAANG <3", "score": 2, "replies": [{"body": "Imagine if Surface ever takes off, they could easily become a $200 billion/year company.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "20 years? Wow, thats what i call goin long..\nEdit: Do you even care what we speak right now? A Month must be nothing to you..", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "So you mean, if something better comes you change?\nI just don't understand the term long term anymore..", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Microsoft stock right now...\n\n[https://media.giphy.com/media/d48u0tb9EoH2LtlK/giphy.gif](http://gph.is/2sQzwDy)", "score": 1, "replies": []}, {"body": "I honestly don't have a lot of MSFT stock - only 27 shares, but damn, it's just been chugging along the entire time I've been holding it (minus spring 2020 but that was literally everything, and only for two months). TTD has been my biggest gain since I invested in them back in 2019, then NIO in July 2020, then MSFT.", "score": 1, "replies": []}, {"body": "What your saying is my base cost of $19.00 is still safe.  The quarterly dividend reinvest  spread is read with a smile 😃.", "score": 1, "replies": []}, {"body": "> · Windows OEM revenue decreased 3%\n\nProjections have Chromebooks taking 20% sales share in 2021.  Then with Apple getting about 7-8% share with the Macs it means Microsoft Windows share will fall below 75% for the first time.\n\nhttps://www.techchannel.news/12/07/2021/global-laptop-shipments-to-increase-15-to-236m-this-year-fuelled-by-chromebook-sales/\n\nBut honestly it really is not going to matter a ton because of Azure.   Azure will continue to kill it.    Microsoft future growth is all around Azure which is a good thing.   The market opportunity is enormous.\n\nThe core problem was Microsoft giving up on mobile probably too quickly.  It really hurt them to not gain some share with mobile phones and Windows.   It was so important they probably should have tried harder and longer.", "score": 1, "replies": [{"body": "Doesn't it bother you a bit that Microsoft has never revealed an absolute Azure revenue #? AWS is $20 billion/year and we have no idea what Azure is. Most likely 50% of that.", "score": 0, "replies": [{"body": "I honestly never give it a ton of thought.   I think what is clear is the future of Microsoft is cloud and Azure.   Hard to see anything else driving growth and Azure is going to have to offset things like Window OEM declines.\n\nThey will continue and accelerate.", "score": 0, "replies": []}]}]}, {"body": "Xbox down after whole preparation of their package? On the paper I still like Xbox more. I don't understand why PS5 won early.", "score": 0, "replies": [{"body": ">\tI don’t understand why PS5 won early.\n\nBecause it has much better exclusive content and more players on its hardware after wrecking MS last generation.", "score": 2, "replies": []}, {"body": "No one gives a fuck about your worthless input. This was meant for the guy above me, not the OP.", "score": -22, "replies": [{"body": "Lol someone woke up on the wrong side of bed", "score": 2, "replies": [{"body": "I was relying to the clown above me, not the OP. He’s a clown.", "score": -1, "replies": []}, {"body": "he followed me from a penny stock subreddit :)", "score": 1, "replies": [{"body": "RR won’t be a penny stock when clowns like you stop being afraid of Covid.", "score": 1, "replies": []}, {"body": "How’s your triple mask? You still scared of Covid? Staying in your bubble?", "score": 1, "replies": []}]}]}]}]}, {"body": "I think part of hit here is them losing that JEDI government cloud contract when they had it in the bag and the stock seemed to be priced with that in mind.", "score": -8, "replies": [{"body": "The contract would have been *as much as* $10b over 10 years, or 1b a year on revenues of $17.38b for their cloud segment (Github, Azure, Windows server etc) *this quarter*, so it'd represent up to about 1/20th of a quarterly loss in current quarter, and less than 1/100th is current growth rate continues.\n\nA loss for sure, but relatively small.", "score": 5, "replies": []}, {"body": "This is what I'm thinking. $10 billion is a big number.", "score": -5, "replies": [{"body": "That was announced a while ago", "score": 0, "replies": []}]}, {"body": "That was announced a while ago", "score": 1, "replies": []}]}, {"body": "Yet stock is falling. These high flying tech stocks need to come to the ground.", "score": -5, "replies": []}, {"body": "My leaps are so gonna print. If EPS follows through next 2 quarters and the PE ratio doesn’t change we are looking at 315-320 price. Plus those buybacks will help out EPS. Very bullish on this one", "score": 1, "replies": []}, {"body": "Is MSFT a good buy?", "score": 1, "replies": [{"body": "All of these big tech stocks are good buys, but always put create a  bracket sell order after buying it. Take emotion out of it.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Exactly, the stock prices already had factored in blowout earnings prior TO the earnings report. Those of us who are investing veterans understand this. Idiotic fanboys don't get it and never will.", "score": 2, "replies": []}]}]}
{"title": "Why PIPEs won't sell off all their LCID shares upon lockup expiration", "selftext": "PIPE (private investment in public equities) invested aggregate $2.5B in Lucid Group at $15 per share and received 166M shares (\\~10.5% ownership). The PIPE offering was oversubscribed at the time of the offer (Since LCID was trading in $50s / $60s), meaning the number of interested parties and offered capital to invest in Lucid far exceeded what was needed at the time. Ultimately 7 large institutions together provided $2.5B and Saudi's PIF was one of those 7 institutions. Saudis were already a large shareholder of Lucid and they had the final word which institutions can finally take part in the PIPE offering. Meanwhile they also took part in the PIPE offering to increase their stake and assure the chosen institutions how sweet they believed $15 offering was. The 7 institutions are:\n\n\\- Blackrock\n\n\\- Fidelity\n\n\\- Saudi PIF ($200M)\n\n\\- Franklin Templeton\n\n\\- Neuberger Berman\n\n\\- Wellington Asset Management\n\n\\- Winslow Capital Management\n\nIn February after DA, Peter Rawlinson and head of PIF both emphasized that **PIPE investors have \"implied\" long-term capital commitment.** The definition of \"Long Term\" for them is not clear for us, but I doubt they would consider a few months as \"long term\". It appears they meant PIPE investors will **NOT** sell the shares and run away after a few month or even a year. Let's not forget these large institutions were \" privileged\" to be included in the $15 offering. I believe the Saudi's PIF criteria for choosing a handful of institutions to take part in the offering (among too many interested parties) should have been:\n\n**1- Relationship:** Wall St and the world of finance is all about relationship. The clients pick you due to the relatio0nship and if your client is a sovereign wealth fund (PIF) that controls $800B reserves, losing your relationship is the last thing you want. Many of these asset management firms earn fees by AUM. If your $800B client throws you a fish (PIPE opportunity at $15) and they expect your *\"long term capital commitment\"*, then you definitely ask their advice before selling shares after lockup expiration. Remember that every $1 this stock falls, the PIF loses $1B. If the PIPE sell off triggers a big meltdown, it severely damages their client (PIF). In Wall St, losing or souring your relationship with such a big client is the last thing you want. Being a go-to financial firm for such a large client (PIF) means earning hefty fees (Asset management fees, advisory fees, capital market fees) indefinitely into the future.\n\n**2- Size**  Most of these institutions are Wall St giants. Blackrock AUM is over $9T as of Q2'2021. Blackrock equates Wall St for many of the firms in the finance world. Larry Fink is seen as the strongest man on Wall St. Let's assume Blackrock, as one of the seven PIPE investors, invested $300M at $15 and by lockup expiration date the price is $45. They will have $600M gain. This gain looks huge for retail investors, but it is not huge enough for a company at the size of Blackrock, specifically if:\n\n\\- It leads to losing PIF or imposing loss on the PIF (Remember Lucid is Saudi PIF's most successful investment so far). Losing PIF means losing billions of dollars of fees that can be earned indefinitely in the future.\n\n\\- If Blackrock believes Lucid can grow even further in the future (+4 years)\n\n\\- If Blackrock requires higher ROI on their Lucid investment.\n\n**3- Strength:** The institutions chosen are among the strongest asset management firms on Wall St. They were  chosen and they won the competition, however that winning should have come with strings attached to it. Expectation of long-term capital commitment is one of those.\n\nConsidering all the factors above, we don't have an easy guess about the behavior of the PIPE investors after lockup expiration. Once the lock up expires, they gain the ability to sell, however will they dump all the shares and run away? **Likely not.**\n\nLast but not the least, the PIPE deal has put them in an \"enviable position\" among investors, since February many institutions and retail investors wish (and futilely wait) to buy LCID at $15 per share. Remember that many short squeeze scenarios have happened at lockup expirations due to massive bets against the stock leading to the lockup expiration date, due to the anticipated large sell-off, and the sell off not being materialized (i.e when investors don't sell upon lockup expiration).\n\n&#x200B;\n\n[Head of Saudi PIF standing next to Peter Rawlinson in Times Square. He ringed the Nasdaq opening bell on Monday July 26](https://preview.redd.it/tz2m3tsoqsd71.png?width=1188&format=png&auto=webp&s=4a00049478d9847b0c8c1304711c4340eb812497)", "id": "oss4my", "created_utc": 1627409695.0, "score": 305, "upvote_ratio": 0.9, "num_comments": 90, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|5 months ago\n**Total Comments**|21|**Previous DD**|\n**Account Age**|5 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Great DD bro! /leotardo", "score": 53, "replies": []}, {"body": "So THAT'S the guy who pressed the button to ring the bell before Rawlinson!", "score": 42, "replies": [{"body": "Yes!! He is a very strong guy. Is authorized by Saudi kingdom to expand Saudi's investments overseas.", "score": 27, "replies": [{"body": "Seems like a pretty petty thing to do even if he's heading up the PIF.", "score": 5, "replies": []}]}]}, {"body": "$LCID is the only spac where I feel the PIPE investors are in it for the long haul.  They won't be liquidating when lock-up period expires imo because the future potential is HUGE.", "score": 37, "replies": [{"body": "That also paid $5 above NAV. Some retail actually got in lower than the PIPE. To me that's fairly bullish.", "score": 12, "replies": []}, {"body": "Correct! This is the market makers stock! Elon burned the shorts with tesla  now the hedge funds are going to run this stock up and take away some value from Tesla. We are going to triple digits pretty soon.", "score": -1, "replies": []}]}, {"body": "Well I bought some LUCID at 25 cause I can afford their stonk but not their car", "score": 36, "replies": []}, {"body": "I pray you fuckers don’t try to ruin this stock hahaha I’ve been holding this stock for too long for the wsb boys to fuck it up", "score": 24, "replies": []}, {"body": "Best Strategy is if cars are out by the end of August, it will stir more interest to avoid the fear of a selloff when expiration lockup is close.", "score": 18, "replies": [{"body": "I believe any day they can announce with confidence when the first delivery will happen. They can announce now and do heavy marketing all August. This stock won't fall. February crash has carved a bitter memory on investors' minds. Lucid mgmt needs to erase that, and I believe they will.", "score": 20, "replies": [{"body": "Until they actually get to production who knows what delays there may be. Would not trust any timeline to be reliable.", "score": 2, "replies": []}, {"body": "I don't like how there is a like a billion shares in the float. That makes this like PLTR, or WISH. Any small change in the stock price equates to a large change in the companies valuation. Not seeing any large rocket here.", "score": -3, "replies": [{"body": "that is your problem. its good for long term investors like me to hold so there is no hard pump or dump unless there is serious volume.", "score": 8, "replies": []}]}]}]}, {"body": "He ringed the Nasdaq opening bell just like LCID ringed my portfolio", "score": 8, "replies": []}, {"body": "Would it be in the best interest for these big dogs to sell after lockup expiration? Lucid's tech, and the company's future growth potential prove to be a far superior long term gain.\n\n No one is hurting for cash, a quick buck seems foolish.", "score": 6, "replies": []}, {"body": "Head of Saudi Investment Fund is now an Ape :) and I mean that in the most flattering of ways possible", "score": 12, "replies": []}, {"body": "PIF, Blackrock, and Fidelity wont sell. Blackrock, and Fidelity would just rebuy it for their funds again eventually as they hold every large company.\n\nThe rest are just guesses, especially as they are up significantly at the moment.", "score": 3, "replies": [{"body": "All other Asset management firms named above are pretty well know. Winslow Capital Management is owned by Nuveen, just in case you haven't heard of them. All of these firms are pretty well known names on Wall St. I don't believe any of them sell and run away. If retail investors believe LCID is a 10-bagger in 5-6 years, I wonder why these firms should think otherwise at the moment.", "score": 6, "replies": []}]}, {"body": "Uhuh", "score": 5, "replies": [{"body": "op is 🤡", "score": 7, "replies": [{"body": "Lookin good for my poots", "score": 3, "replies": [{"body": "Gz!", "score": 2, "replies": [{"body": "Excellent DD of course, this is WSB so I inversed it and made out well on Lucid puts. Now looking to long and try to make money as retail panics and dumps their shares. And there WILL be more PIPE selling in the coming days", "score": 1, "replies": []}]}]}]}]}, {"body": "So basically greedy Wall Street firms love the Saudis so much they no longer care about making money.\n\nReal world, it is dog eat dog.\n\nGreat DD.", "score": 15, "replies": [{"body": "lol NO, It is an easy decision between \"one time small gain\" vs \"long term big recurring gains plus a large gain at a later date\". You choose the former, they choose the latter. Good Luck", "score": 5, "replies": [{"body": "You apparently have zero experience with people making investments with big money. The Saudi PIF is run by big boys who understand that once other investors are past their lock-up periods they will sell if they think it is in their best interest. That is why they have lock-up agreements in the first place so to give it some time before they can sell. Once that is up, all bets are off.\n\nIt is dog eat dog and if you are too dumb to understand that, you don't belong investing or giving investment advice.", "score": 13, "replies": [{"body": "When does the lockup end again? I'd like to pay attention and see how much selling there is that day.", "score": 3, "replies": [{"body": "Based on other stocks, very hard to know much by looking at selling volume then. Prior to lockup you might have funds short-selling (driving the price down) and after lock-up they cover, so depending on the imbalance it might even go up after lock-up end (as long as it stays below the price they shorted it at, when they cover they make money). This is similar to stock prices going up before earnings and collapsing afterwards regardless of how good the results were.", "score": 1, "replies": []}]}, {"body": "Remember when those big boys gave up early on Tesla? Yeah, those big boys also have pride.", "score": 4, "replies": [{"body": "That way of thinking has you lose money twice.", "score": 0, "replies": []}]}, {"body": ">Saudi PIF is run by big boys \n\nCorrect me if I'm wrong, but those big boys answer directly to a monarch. Said monarch displayed possession of literal death squad within last couple years. For all intents and purposes PIF \\*is\\* Saudi, and the US/Saudi romance goes back to FDR.\n\nI agree that each trade is zero-sum, but it feels like OP may be onto something suggesting these firms want a healthy relationship with PIF.", "score": 5, "replies": [{"body": "The whole premise is ridiculous. Blackrock has over 9T in AUM. Why would they care about the Saudi's feelings when the PIF is per this DD 800B... By the way the Saudis only put 200M into this which is 0.025% of the Saudi PIF's assets. While I am sure there might be a few people involved in managing such a large sum, in terms of the overall Saudi PIF it is a small thing and no one's feelings will be hurt if Blackrock or someone else decides to take profits.", "score": 3, "replies": [{"body": "Not being too big for my pajama britches: I admit that I did not know this. That's small for how big of a deal people are making out of it (200m out of 2.5b?). Might sell call for 9/17 to reduce cost basis. Still plenty of time before then for price discovery", "score": 1, "replies": [{"body": "As to short-term price movements and how you can benefit from them, no clue. Good luck.\n\nFYI, I think it  is 200M/800B which is 0.025%; this is using numbers from the DD (Online I saw the Saudi fund was 400B so that would be 0.050%. Still nothing major that anyone is losing much sleep about).", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Imagine thinking that those huge funds with that amount of capital won't sell after 50%+ gains in 6 months because of \"good faith\" or some goody-goody feelings with the Saudis, lol.\n\nI like the company but this DD is a pipe dream (no pun intended)\n\nAlso, take everything Rawlinson says with a grain of salt. \"Enviable position\" is a whole lot of horseshit jargon. The dude can sell ice to an eskimo, he is just that smooth. Hell, he sold me on Lucid!", "score": 1, "replies": [{"body": "Well you don't even know the difference between these firms and hedge funds, so I guess you need to spend less time commenting about thing you have no clue about, spend more time learning what these firms do and how they make money and then come here again and write something you wouldn't be ridiculed about.", "score": -2, "replies": [{"body": "Nice try. You sound smart, DD is almost convincing, even. Still gonna go with aka0007 and dog-eat-dog.", "score": 1, "replies": []}]}]}]}, {"body": "180 shares of lucid📈📈", "score": 5, "replies": []}, {"body": "Golf clap", "score": 2, "replies": []}, {"body": "Apart from PIPE, does anyone know when insider lock up expires? Do employees also sell starting 09/01 or there is a longer lock up. Does anyone know?", "score": 2, "replies": [{"body": "Churchill's lock-up is 18 months", "score": 4, "replies": [{"body": "Churchill won't be an issue. I only see PIPE or insiders/employees if they can sell", "score": 1, "replies": []}]}]}, {"body": "LFG", "score": 2, "replies": []}, {"body": "Great DD !!", "score": 2, "replies": []}, {"body": "Didn’t the pipe investors buy in at $15? With warrants doesn’t that make the profitability expand as if they had bought options? Based on the difference in price between warrants and shares, why do you think it’ll go up? In theory, wouldn’t shorting the stock and buying the warrant produce a positive net right now?", "score": 2, "replies": []}, {"body": "I love how people state shit with absolute certainty here....  Because this dude totally has supreme and one hundred percent knowledge on what SEVEN huge ass fucking holding firms are going to do with there assets.", "score": 1, "replies": []}, {"body": "Where do I buy puts?", "score": -4, "replies": [{"body": "Nobody tell him.", "score": 13, "replies": []}]}, {"body": "Watch SoFi prepare for red", "score": 0, "replies": []}, {"body": "No, this isn't going to stop then selling if they think the valuation is too high. And realistically, it is kind of absurd. But who knows! I made a few k on it before the merger and am happy to be out now", "score": -3, "replies": []}, {"body": "My strategy is buying a boat load of puts. Everyone and their mother knows this company is hilariously over valued. If I was a pipe investor I would be lining to get my dollars out and put them in a safe spot.", "score": -4, "replies": [{"body": "Well apparently this dude knows for sure what SEVEN huge funds are up to and he said they're not gonna sell....  His title sounds really confident...  Lmao...  For real.  They plan on manufacturing.... 500 cars in 2021.  500.  All year.  Some absolute total mobilization there buddy...  Production like that is how we won world war 2....  Bulls are ready to run!!!!!", "score": -5, "replies": [{"body": "Right? Cracks me up. I’ve been buying puts at 26-27 and selling them over and over. Made 10k today. I think I might buy 100k of puts tomorrow just to post on here if it runs back up. So many LCID jokers who have no idea how to value a stock. They say a $25 is a cheap stock.", "score": -3, "replies": []}]}]}, {"body": "This is a dump operation stay away or be quick about it.", "score": -3, "replies": [{"body": "Yea a SPAC probably bought a whole pump and dump scheme without anyone catching on.", "score": 0, "replies": []}]}, {"body": "Lucid is untested technology and its debut car, the lucid air dream, is not only more expensive than a Tesla model s plaid, but also slower. Why would I buy?", "score": -5, "replies": [{"body": "Is tested..and because they’re selling an actual luxury car as opposed to Tesla’s “worst in class trim and options for the price point” Model S.", "score": 3, "replies": []}]}, {"body": "It died", "score": 1, "replies": []}, {"body": "As you may know, a PIPE (private investment in public equity) is a popular way for companies to raise capital. Under a typical PIPE arrangement, insiders and other major shareholders agree to sell some of their shares to an investment fund at a discounted price. In return, the fund agrees to invest a certain amount of money in the company.\r  \n\r  \nOne key feature of PIPEs is that they often have a \"lockup\" period, during which the insider shareholders are not allowed to sell any more of their shares. For example, if a PIPE is issued with a one-year lockup period, the insiders who participated in the deal cannot sell any of their shares for at least one year.", "score": 1, "replies": []}]}
