{"title": "US pushes China decoupling, wiping billions off Apple and Boeing", "selftext": "", "id": "gktptp", "created_utc": 1589631429.0, "score": 241, "upvote_ratio": 0.91, "num_comments": 96, "comments": [{"body": "I'd buy some long calls on Qualcomm on the dip for sure.", "score": 87, "replies": [{"body": "Puts on TSMC\n\nAlso this shit will explode. Huawei is Chinas baby and the second largest phone maker.\n\nThis will make them go bankrupt.", "score": 25, "replies": [{"body": "Aren't they making a plant in US?", "score": 15, "replies": [{"body": "Is it operational? Will they still make it after they are no longer producing chips for the second largest phone producer in the world (Huawei)?", "score": 7, "replies": [{"body": "Markets looking forward.", "score": 3, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 98, "replies": [{"body": "Cum to $INDA we have bobs and veganas.", "score": 209, "replies": []}, {"body": "> Decoupling from China and into where?\n\nSerious question, Why not Africa? Cheap labor, stop Chinese influence there, stop migrations, easy to control regimes. Just need to build infrastructures there and are ready to profit.", "score": 47, "replies": []}, {"body": "India & Mexico.", "score": 38, "replies": [{"body": "[removed]", "score": 4, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 10, "replies": [{"body": "[removed]", "score": 10, "replies": [{"body": "LMAO not a chance", "score": 1, "replies": []}]}]}]}]}, {"body": "Lol India. As if we aren't already dependent on Indians for software, now you want to give them hardware too", "score": -15, "replies": []}]}, {"body": "TSMC is looking to open a chip foundry in the US in the next few years", "score": 3, "replies": [{"body": "You talking about TSMC?", "score": 5, "replies": [{"body": "Sorry yes. Autocorrect", "score": 2, "replies": [{"body": "Onshoring a 5nm Fab to the States is very seriously a big deal.", "score": 3, "replies": [{"body": "INTC lobbyists will make sure it doesnt happen. Currently INTC holds the monopoly on fabs in the US", "score": 7, "replies": []}]}]}]}]}, {"body": "ayy bro why Malaysia?", "score": 4, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "Nice, as a Malaysian myself, i'm proud of that", "score": 2, "replies": [{"body": "What's a Blueva Cum Pump?", "score": 10, "replies": []}]}]}]}]}, {"body": "Drinking spiked coffee because I’m a professional.", "score": 8, "replies": []}, {"body": "His friends much have had AAPL and BA OTM puts expiring soon.", "score": 7, "replies": []}, {"body": "[removed]", "score": 30, "replies": [{"body": "[removed]", "score": 23, "replies": [{"body": "[removed]", "score": -13, "replies": [{"body": "[removed]", "score": 14, "replies": [{"body": "[removed]", "score": 13, "replies": []}]}]}]}]}, {"body": "This is just a sensationalized headline meaning to stir up clicks. \n\nTruth is: the diversification from China has happened a long long time before the stable genius and his trade war. And because China controls the original supply chain, their network of suppliers and supporting businesses of these industries moving to other countries is also moving along with them.\n\nThe problem: most of the regions that are supposed to benefit from this diversification (South Asia, Southeast Asia and Latin America) have long experienced premature de-industrialization, specifically places like India, Indonesia, Mexico and the Philippines. So therefore, they lack supply chain on top of the non existence infrastructure and are fully reliant on China - depending on the industries, from material imports, suppliers to supporting businesses etc.\n\nhttps://www.piie.com/commentary/op-eds/india-must-reverse-its-deindustrialization\n\nhttps://ksr.hkspublications.org/2020/03/02/made-in-somewhere-else-how-premature-deindustrialization-undermines-the-development-of-indonesia-and-other-emerging-economies/\n\nhttps://www.vox.com/a/new-economy-future/premature-deindustrialization", "score": 20, "replies": [{"body": "The most important variable in business is time.\n\nChina can build a factory in weeks. In India, SA it could take years. That alone makes many of these efforts a non-starter", "score": 16, "replies": []}]}, {"body": "[removed]", "score": 13, "replies": [{"body": "[removed]", "score": -6, "replies": [{"body": "[removed]", "score": 23, "replies": [{"body": "[removed]", "score": 7, "replies": [{"body": "[removed]", "score": -5, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "You talk a lot about shoving things up butts.  Trying to come out with something?", "score": 1, "replies": []}]}]}]}]}, {"body": "[removed]", "score": -6, "replies": [{"body": "[removed]", "score": 11, "replies": [{"body": "This is America Bilbo. You may hate it, but I love it. Maybe we will all be eating out the back of FEMA trucks in a month but as long as they got tendies we shall be fine. \n\nYou got to enjoy the 1 good pandemic you get in your life and stop complaining about our Americana retards. You're watching the greatest movie of all time playing out in real life. Dont act like you dont want to enjoy some peanuts and cinnamon butter bread from Texas Roadhouse \"The walmart of steak houses\" right now. \n\nAnd fuck China!", "score": 4, "replies": []}, {"body": "[removed]", "score": 1, "replies": []}]}]}]}]}]}, {"body": "What is this the China propaganda network? If youre an emerging market try doing business without the U.S. tell me how that works out. Pretty sure thats why China is trying to steal our IP. Also we can manufacture in Mexico, Vietnam, Indonesia, India, Turkey...maybe not Turkey. Basically anywhere else.", "score": 55, "replies": [{"body": "Turkey... this dude ...", "score": 47, "replies": []}, {"body": "China doesn't steal IP, they buy it. \n\nNow a lot of it is not for sale because of new US and EU policies. So China is stuck with a bunch of trash US currency with no utility. Buy gold.", "score": -72, "replies": []}]}, {"body": "[deleted]", "score": 78, "replies": [{"body": "This.", "score": 8, "replies": []}]}, {"body": "[removed]", "score": 26, "replies": [{"body": "Have you forgotten about all the IP theft that china does? We dont do the same thing against Samsung and their is a reason for that. In order for trade to actually work in a globalist world you need to have transparency and understanding that it will be mutually beneficial to each party, otherwise it's not going to work well, as it is with China. \n\nThis isnt really like the real estate company analogy at all. This is like I built a new product and patent it and it sells very well in America and so I want a larger market so I release it into China which then buys some then steals the IP and starts selling it there and gaining wealth there.", "score": 19, "replies": [{"body": "IP Theft is natural part of a country's development. It's like how you can't learn to play an instrument without play other people's music at some point before learning to compose our own. The US did it too. Some level of IP protection is necessary but the US has weaponized it even suing Samsung for stealing Apple's rectangle with rounded corners. Which will go down in history as the prime example of IP protection run a muck in the US. As far as China goes IP protection, or lack of it, is a matter culture. It's not just US companies, the Chinese do it to themselves too and one of the driving forces in why Chinese tech is so much better and cheaper than US products. [Here is a Silicon Valley Engineer explaining the culture difference in ShenZhen.](https://www.youtube.com/watch?v=S39fhrGjr4U)", "score": -8, "replies": [{"body": "Yes IP should have its limits as to what should be acceptable as far as design and I'd agree with you on that. But ultimately China may end up shooting themselves in the foot. Last I saw Russia was upset that they reengineered their fighter planes so if more countries disassociate with China over their theft then their innovation will dry up.", "score": 0, "replies": []}]}]}, {"body": "Maybe but China/Huawei is also fucked.", "score": 8, "replies": [{"body": "In the short term yes as far as revenue. In the long term no. [China is very connected to the emerging markets](https://www.youtube.com/watch?v=wXnugmSf0qs) and they've done nothing to shake that trust so far. The US has become the country that shows up with guns and missiles. China is the country that shows up with wheel barrels full of money. Huawei will have plenty of places to sell their products to replace the US.", "score": 0, "replies": [{"body": "I agree. I was talking short term. \n\nI saw their influence and development leverage and exploitation first hand in Africa.\n\nI do think they will have issues with chip making long run. They can't just quickly build and operate a foundry.", "score": 6, "replies": [{"body": "China has a foundry called Semiconductor Manufacturing International Corporation(SMIC). Huawei has already moved the bulk of their Chip making there. They also have HiSilica as an in house foundry owned by Huawei. They only uses TMSC for the highest performance chips. But TSMC is in Taiwan.\n\nThe overall story is first the US attacked the chips themsleves by banning the use of US chips in Huawei products thinking that would cripple Huawei. But it didn't cause Huawei made their own chips to replace the US ones. Now they are saying foundries that use US manufacturing equipment can't make Huawei chips even if the chips are full designed and owned by Huawwei. So Huawei will shift to their own foundries using their own equipment. They will take a hit on the performance of their highest level chips though. But let's be real. TSMC is in Taiwan. It's not going to take long for TSMC engineers to find their way to SMIC and HiSilica with some cash to grease the wheels.", "score": 2, "replies": []}]}]}]}, {"body": "So your argument is something along the lines of, \"foreign countries won't want to trade with the US because it isn't letting China eclipse it\"? That's an absurd argument. Foreign countries will be happy to accept a flood of US dollars. It's been going on for a long time. Plus, foreign countries are also resentful of China's thuggish behavior as well.", "score": 9, "replies": [{"body": "No. Foreign countries don't wanna work with the US because the US competes by bullying and dirty tricks. If you want to be the best ice skater and you notice someone is catching to your level, the right thing to do is practice harder and get better to hold your top spot. It is not to pull a Tanya Harding and try everything you can to knee cap your competitor like arresting a CFO, blocking trade, raising tariffs, cutting off the VISA of Chinese journalists, starting rumors, etc. People will compete and work with you and even help you. Unless you're known to play dirty. Then everyone just wants you gone.", "score": -8, "replies": [{"body": "And in your opinion, China *doesn't* play dirty? \n\nTheir currency manipulation is A-Ok to other countries? Their IP theft is Ok? Their undercutting by violating labor and environmental standards is ok?\n\nYou're delusional if you think other people respect China's shitty practices.", "score": 11, "replies": []}]}]}, {"body": "Eh that’s not true at all, china and the us have had these conflicts over and over again. No European or rising nation (not backed by China) would go against the biggest consumer market in the world... not to mention if they had to pick China or us most countries would pick the us", "score": 4, "replies": [{"body": "[removed]", "score": -5, "replies": []}]}, {"body": "[removed]", "score": -2, "replies": [{"body": "[removed]", "score": 9, "replies": [{"body": "[removed]", "score": 7, "replies": []}]}]}]}, {"body": "Whoops.", "score": 9, "replies": [{"body": "Unintended consequences of pissing off the 2nd largest GDP and our biggest partner in global trade has unintended consequences.  Who knew?", "score": -6, "replies": [{"body": "Fun fact the eurozone GDP is the second largest in the world.  \n  \nThe eu27 + Norway + Switzerland would narrowly make \"Europe\" the largest GDP bloc in the world, but I admit this is a bit of a stretched definition and it depends on currency valuations etc. Americans usually get really angry when I post this, without refuting the math of it.  \nAnyway, I bring this up because trumpism is continuing to piss people off here too", "score": 41, "replies": [{"body": "But hey, we Europeans are gay and faggy, weak and decadent.", "score": 28, "replies": [{"body": "Sounds gret.", "score": 13, "replies": []}]}, {"body": "You guys should be tickled pink by this retarded president.  Like I said on another comment, *this is akin to brain drain in rural America* and the rest of the world is reaping the rewards.  Especially the EU.  This boob has pushed science and  innovation out of America, guaranteeing that more exciting companies are popping up everywhere but here.  But hey, we've still got Tesla...", "score": -10, "replies": [{"body": "We reap no reward from America's retarded foreign policies. At least under bush only a few countries got dragged into your wars, but we ended up with all the van attacks even as recently as last year. Obama is loved, but under orange man we gain almost nothing while being attacked on many sides by your administration (brexit, trade, climate, Eu, Angie, Russia, Iran, syria). Eventually it will be advantageous to abandon the whole failed American project and take our chances.", "score": 10, "replies": []}, {"body": "[deleted]", "score": 8, "replies": [{"body": "Dude, you haven't gotten it.  I live in a small city and grew up in a small town.  Rust belt retards bought into the idea of corporatization that killed their own economies and now, instead of blaming their own consumer choices of picking Wal Mart instead of the local chain that used to thrive in that area, they blame China.  It's  a blame game and it's poorly executed, but it's about the only thing Americans do anymore without outsourcing.", "score": 17, "replies": [{"body": "[deleted]", "score": -3, "replies": [{"body": "The coal industry was my favorite part about the last election because who honestly gives a fuck about coal miners strip mining mountains in Kentucky?  Nobody.  Talk about rust belt retards not adapting to the times.  Instead of pushing for innovation, rural America has remained stuck in their ways, voting against their best interests while simultaneously flexing their consumer muscles against their best interests.  Tell me how voting against Hillary helped their agenda while they pushed out small businesses from their communities under their own leadership for short term gains instead of long term prosperity.  \n\nYou bring up the shale industry, that's awesome.  What about fracking.  Or better yet, what about new legislation that allows mining companies to dump copper tailings in waterways under this administration.  How does this new legislation affect communities 10-30 years down the road?", "score": 10, "replies": [{"body": "[deleted]", "score": -6, "replies": [{"body": "Drug addictions and poverty because they didn't innovate and adapt because they chose short term gains over long term growth and prosperity.  Massive brain drains in those communities because they never thought to invest in their people and communities.\n\n  Shale thought it was the next big thing at $60/bbl, again, not innovating or adapting, simply spinning around on the hamster wheel.", "score": 10, "replies": []}]}]}]}]}]}]}]}, {"body": "PPP wise Chinese GDP is a lot bigger than US GDP. And PPP is what really matters.", "score": -7, "replies": [{"body": "I think Chinese pp size doesn't matter in terms of the absolute output.  Thick loads outta China.  Thin and watery loads out of America.", "score": 4, "replies": []}]}]}]}, {"body": "Locked. Way too much politics.", "score": 1, "replies": []}, {"body": "Oh no! What is China going to do without Uncle Sam's fun bucks?  All they'll have left are factories, workers, and the world's most productive industrial ecosystem, all under a state that can do nothing if the free market doesn't furnish the required demand.", "score": 9, "replies": [{"body": "When you try to commit murder you better get it right the first time. US tried to kill Huawei last year. China caved and bought a year of time . Huawei has used that year to build their own chip and OS. Now they can live without Qualcomm and Google. This time US is bringing a knife to a gunfight", "score": 17, "replies": [{"body": "[removed]", "score": -1, "replies": [{"body": "Qualcomm is shit. They have a few generic chips for all different types of devices. None of that shit is optimized to the OS/hardware. \n\nNotice how iphones have a 30% smaller battery size than most droids, yet similar battery life. All of those gainz are through design, optimization from doing everything in house. This is why samsumg watch and google watch failed.", "score": 15, "replies": []}, {"body": "Doesnt need to. Most US industry did not work as good as European manufacture at one time but given enough time and preferential market access ultimately the country with the larger market overtakes in tech.", "score": 9, "replies": []}]}]}, {"body": "China doesn’t just do business with the US lol. This is a typical American supremacy mentality", "score": -3, "replies": []}]}, {"body": "Is this one of those things that will get worse before it gets better? Buying puts on Chinese companies and semiconductors?", "score": 0, "replies": []}]}
