{"title": "Isn't it about time to buy 100 Calls on $AMD? anyone Thinking about doing this? I thought someone did before, but I can't remember. Seems like Now is around the time. Can these get any cheaper?", "selftext": "", "id": "8cf8ei", "created_utc": 1523800243.0, "score": 39, "upvote_ratio": 0.84, "num_comments": 70, "comments": [{"body": "I'll gladly sell you some OTM AMD options :)", "score": 18, "replies": [{"body": "When At $9, I'm in!", "score": -1, "replies": []}]}, {"body": "Twas me :( \n100 calls $11 May 18. Shitting the bed hard rn. ", "score": 31, "replies": [{"body": "i believe", "score": 1, "replies": []}, {"body": "Yeah, that's a killer, I think around now or even if it drops some more I'll add 20-30 more calls if it drops more Monday.\n\n", "score": 1, "replies": [{"body": "Yeah just need to move slightly and higher IV will help a lot. ", "score": 2, "replies": []}, {"body": "4/20? Why not like October expiry?", "score": 2, "replies": [{"body": "Magic number ", "score": 6, "replies": []}]}]}]}, {"body": "I have 1,000 contracts. Check my post history. I rolled them in 5/11, though. ", "score": 9, "replies": [{"body": "F", "score": 2, "replies": [{"body": "A", "score": 2, "replies": [{"body": "G", "score": 1, "replies": []}]}]}, {"body": "F", "score": 1, "replies": [{"body": "O", "score": 1, "replies": []}]}, {"body": "I like your thinking, but I'm concerned with the strike you chose.\n\nYou'll probably ok, but I can't wait to find out. I'm all for it. \n\nI'm thinking of doing 100-200 Calls Monday morning or when I see AMD dip more, cause I got a strong feeling it's going to dip more.", "score": 1, "replies": [{"body": "And AWAYYYYYYYY WE GOOOOOOO. ", "score": 1, "replies": [{"body": "Of course, because I got out of my calls it heads up right. ", "score": 2, "replies": [{"body": "my bad heh", "score": 1, "replies": []}, {"body": "It's starting to look like I was wrong about everything. Maybe the MMs are holding puts. Either way, I don't believe they have enough time to get this back to 11 by EOD 4/20... so a lot of puts are going to pay out, apparently. It might get pinned under 10.50... what a rollercoaster!", "score": 1, "replies": [{"body": "I'm seriously thinking of buying 38 Puts strike 12.5 today if I see another small rise in AMD, I think then it will stay up a bit or else I make money.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Theta gonna eat you alive on those 4/20s", "score": 12, "replies": [{"body": "I'll get out of them as soon as it makes any profit at all, I'm not holding these, I'll close them Monday if it even budges up..\n\n  \n\n\nI can always reopen Monday end of day\n\n  \n\n\n  \n", "score": 1, "replies": [{"body": "Idk I would consider rolling them, playing AMD is dumb tho lol. ", "score": 1, "replies": []}]}]}, {"body": "So my idea is, normal stock people generally buy options, not sell them. Selling carries more risk too. Most people buy and then sell the same contract.\n\nWhat this also means is that market makers write most option contracts. So this is why max pain is an indicator of what the stock price will likely do... because that's the lowest payout strike that the option writers will have to pay to the option buyers.\n\nIf you were a market maker and had to write 80% of the options on both sides, because most randoms generally buy instead of write options, then it is also to your advantage to pick a side. If you have to drive the price toward max pain anyway, then it makes sense to buy calls or puts from normies, depending on which way you will move the price.\n\nRight now on the TV and in many articles AMD is getting trashed. So that says to me that the general normie's sentiment is bearish. They also are too stupid to make the time to read reports, so they don't know AMD's future is bright.\n\nRight now for AMD's 4/20 expy, for the 6 to 14 strikes, the put cash payouts total $2.2 billion, and the calls $257 million. If the stock closes at the max pain $12 strike on 4/20, puts would payout $19.1 million and calls $20.9 million.\n\nSince the 12 strike is higher than the current stock price, I as a market maker would drive the price toward $12 by 4/20. But, as the price moves up the number of open calls and puts will change, so the maxpain might go a bit lower than 12 to 11.50 or 11 when all of the money is balanced EOW. Right now the $10 strike has 88.6m put payout and 2.1m call payout. As a market maker I'd rather payout 80% of 40m (at the $12) than 80% of 90m (at the $10).\n\nFor these reasons I expect AMD to close between 10.50 and 11.50 on 4/20. I might know more on the 19th.\n\nTL;DR I'm aware wsb is for memes. I never post here. I make posts like this one as comments because I like to share information, but only to people who want it. I also don't like criticism, and posting high-IQ content in a sub full of autists makes me feel better about myself. Go ahead and buy calls.", "score": 5, "replies": [{"body": "I like where your head is at, but thing is:\n\n1.)  To my understanding, when \"normies\" are bearish, they either don't buy or just sell what shares or options they have.  \n\n(in other words, the \"normies\" don't buy puts) I think so anyway.\n\nand \n\n2.)  >>- \"But, as the price moves up the number of open calls and puts will change,\"  \n\n Well, this exactly. Things will change to much and too fast, and I feel you have to just be in the moment and go with what happens. You have to be quick and just catch the opportunity if you are looking at it at the right time.\n\n We will see very soon as the 20th is coming up, and if your theory stands, I will make some ok profit if $AMD moves on up to $10.50 which I can't wait to see.  \n\nI personally don't believe it. But I do want it to happen. \n\nI Appreciate the comments. Definitely continue to add to the community here. (and probably be ousted for trying to mention anything remotely good for people)", "score": 2, "replies": [{"body": "They may also drive the price down first so calls become cheaper, then buy a lot on Wed or Thurs. So the run might not happen until later in the week.", "score": 1, "replies": [{"body": "Got 20 puts strike $9, they aint' going down too far now. haha.", "score": 2, "replies": [{"body": "Ah, but did you sell calls? Heh. Nope, that's what the bank is doing.\n\nI kinda think most options are profitable at some point, but people hold too long. I'd never hold to expy.\n\nThe way the market chops these days, maybe it's best to just buy one side and immediately sell at 5-10%?", "score": 1, "replies": [{"body": "That's all I'm about. I just bought 13 puts on SPY $268, lets see if it drops and I'm out in 10 minutes maybe ! hah lets see.", "score": 1, "replies": [{"body": "But did you also sell puts? 🤑", "score": 1, "replies": [{"body": "Nah,\n\nHere is what just happened a few minutes ago.  Closed them all out in the green!\n\nhttps://i.imgur.com/VJjC3OB.png", "score": 1, "replies": [{"body": "Hey, GrapeJelly33, just a quick heads-up:  \n**happend** is actually spelled **happened**. You can remember it by **ends with -ened**.  \nHave a nice day!\n\n^^^^The ^^^^parent ^^^^commenter ^^^^can ^^^^reply ^^^^with ^^^^'delete' ^^^^to ^^^^delete ^^^^this ^^^^comment.", "score": 1, "replies": [{"body": "oh you bitch bot, I was typing on my phone too fast. ", "score": 1, "replies": []}]}, {"body": "Nice. I'm expecting it to close around 10.0 today. The longer you hold options the closer you get to becoming a sucker.\n\nStill have a PT of 10.50 to 12 EOW. Maybe something a bit longer term could be held for a few days? I haven't studied Greeks so I just stay away from options. The only thing I know is the MMs try to make as many of them expire worthless as they can.", "score": 1, "replies": [{"body": "We need to be friends now, Right now.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "What app is that?", "score": 3, "replies": [{"body": "It's the absolute worst, to do anything but buy and sell at market, Called Robinhood Web.  On my laptop computer..\n\n", "score": 7, "replies": [{"body": "Main part of the screen is taken up by shitty news articles instead of the stocks you own too lol", "score": 2, "replies": []}]}]}, {"body": "Ha I sold those exact amd puts last week in a spread. See you at $0 faggot", "score": 4, "replies": [{"body": "I already missed a couple of opportunities to sell with profit. I think those will come again very soon. I can tell you this, I will not see $0. I will see profit and I'll post for you to prove it. \n\nfag.", "score": 3, "replies": [{"body": "RIP faggot", "score": 2, "replies": [{"body": "already out, I'll post up the result! it's not $0 faggot!\n\neat it.\n\nhttps://imgur.com/a/pC6Me", "score": 1, "replies": [{"body": "Lmao 70% loss and you're proud", "score": 2, "replies": [{"body": "Are you ok? \n\nSo between my Robinhood picture and this, I'm at a loss huh?\n\nhttps://imgur.com/a/YkrDH\n\nand\n\nhttps://imgur.com/a/daNrc", "score": 1, "replies": [{"body": "on the puts you fagtastic turd burgler", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Buy the stock!", "score": 4, "replies": [{"body": "Although I am always about that, It looks like everybody who yells at me for that is actually correct, It will cost me $99,305 to buy 10,000 shares of $AMD.\n\nThe only thing is  I would get out after 5 cents up only making me $490 for using up $99,000.. so in this case, the calls make more sense.\n\nI might as well just pay $5,000 for the calls, and sell out when It goes up between $0.05 - $0.10 cents.", "score": 1, "replies": [{"body": "Your scenario only works out in your fantasy example. ", "score": 6, "replies": [{"body": "Right, because $AMD moving up  .5 or .10 cents is a fantasy?\n\nIt will swing, even it if it's only .5 cents. ", "score": 6, "replies": [{"body": "Buy it, then sell Calls.", "score": 5, "replies": [{"body": "If youre a raging bull, what do you sell for? \n\nSome nuts here think it's going to 15 any minute now. So put up 100k at 16? Earning a penny per share, about $100 profit... You won't convince these raging lunatic bulls to sell calls.", "score": 3, "replies": []}]}]}]}, {"body": "Apparently buying stock is terrible advice. Who would have thought?", "score": 3, "replies": []}]}]}, {"body": "What the fuck kind of play is this? Buy the ITM FD calls but also the OTM puts for the week after?", "score": 1, "replies": [{"body": "I kinda timed it wrong, but I think it will still make money. The 10 calls were like $530, and all it has to do is offset the $100 puts! \n\nSo I'll sell out when profit is $200-300 and then sell the puts hopefully for something.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Totally agree there.", "score": 1, "replies": []}]}, {"body": "Like, I know I'm just supposed to type 'faggot' and then leave... but I'm actually on board. We'll be @$12 by 05/01/2018", "score": 1, "replies": [{"body": "I hope the best for you. I'm out and just don't feel it compared to what's about to happen with $SPY.. during earnings etc.\n\n  \n\n\nBut if I see AMD shoot up, you bet your butt I'm shorting it with actual shares.. Might do another $40,000 shirt like it did with Ford", "score": 1, "replies": []}]}, {"body": "I bought some 1/18/19 FD $15 @ .50, might add more.", "score": 0, "replies": [{"body": "Can they be FD if they’re expiring months from now?  I though by definition FD expired within a week of purchase...", "score": 13, "replies": [{"body": "I guess $15 strike makes those FDs for sure. AMD over 15? Haha", "score": 3, "replies": [{"body": "Even that faggot Joseph Moore upgraded amd to buy, this shit better go up to atleast $12.", "score": 3, "replies": []}]}]}]}, {"body": "I think you could get lucky on the puts since you have the week. It looks like it'll drop some more to me.", "score": 0, "replies": [{"body": "You think it's dropping lower!?\n\n Crap.\n\n - I actually played this way for the upswing, not the downswing! \n\n", "score": 1, "replies": [{"body": "Yeah I think it'll drop down again this week and then go back up over the next few after that.", "score": 0, "replies": []}]}]}, {"body": "AMD is a failure. Ryzen is 40% slower in some games than Intel for same money. I have 0 faith they can produce a powerful CPU.", "score": -5, "replies": [{"body": "This is the most relevant and useful info posted in this thread in regards to what may move this stock in the near term. ", "score": 3, "replies": []}, {"body": "Source? ", "score": 2, "replies": [{"body": "https://www.gamersnexus.net/images/media/2017/CPUs/7700k/144hz/dota2-1440p-144hz.png", "score": -5, "replies": []}]}, {"body": "If you wanted single core performance you wouldn’t have bought Ryzen to begin with. The point of Ryzen is that with 16 threads you can watch half a dozen pornhubs while getting that same DOTA2 FPS from the chart. Also, since when is 100+ FPS at Ultra/1440 at all bad?", "score": 1, "replies": []}]}]}
