{"title": "42 years this week, beta cuck Ronald Wayne sold 10% of Apple shares for a whopping $800.", "selftext": "[removed]", "id": "8d4wi1", "created_utc": 1524051013.0, "score": 230, "upvote_ratio": 0.92, "num_comments": 74, "comments": [{"body": "And 42 years ago you didn't buy them you fag.", "score": 248, "replies": [{"body": "[deleted]", "score": 110, "replies": [{"body": "grandpa*, OP is a dude.\n\nedit: I forgot autistic people don't grasp the concept of sarcasm. ", "score": -18, "replies": [{"body": "Swing and a miss", "score": 18, "replies": [{"body": "just when I thought this sub couldn't get any stupider. ", "score": -5, "replies": [{"body": "Only a fag would think that joke was fun", "score": 6, "replies": [{"body": "that's why you laughed while choking on my nubby dick. ", "score": 2, "replies": [{"body": "Not even an ant would get choked by that.", "score": 3, "replies": []}]}]}]}]}, {"body": "Imagine how much u suck if even autists like us downvote you :)", "score": 1, "replies": [{"body": "I think you're the only person who has openly identified as the typical wsb'er. Everyone typically criticizes in the third person like they're here-but-not-really. I'm glad you're so confident. ", "score": 1, "replies": [{"body": "I lost 85% on a penny stock after being 245% up, what can I say... I am a true WSB’er", "score": 1, "replies": [{"body": "Well done. \n\nI was up 2000% on weed stocks but only cashed in half, and now the remainder is only up 1000% -- so i technically lost 1000% cause that's how math works. \n\nMy people. \n\n", "score": 1, "replies": []}]}]}]}]}]}, {"body": "At least I have the excuse of not being alive 42 years ago. Old fags, what’s your excuse?", "score": 2, "replies": []}]}, {"body": "You guys laugh but if he put that into an ally savings account he probably has almost $1600 today. ", "score": 164, "replies": []}, {"body": "> Wayne has stated that he does not regret selling his share of the company as he made the \"best decision with the information available to me at the time\".[10] He also said he felt the Apple enterprise \"would be successful, but at the same time there would be significant bumps along the way and I couldn't risk it. I had already had a rather unfortunate business experience before. I was getting too old and those two were whirlwinds. It was like having a tiger by the tail and I couldn't keep up with these guys.\"[5]\n\n\nMoral of the story: don't be a limp wrist and instead hold out during bumpy rides and you might end up being in the top 10 richest people on Forbes.", "score": 69, "replies": [{"body": "\"I couldn't risk it\"...Risk what? $800?!! What a fag", "score": 51, "replies": [{"body": "back then 800 was more like 1550. bigly difference", "score": 24, "replies": [{"body": "Risking 1550 today isn't that much unless you only have 1550 to your name then you just need to work a second job at McDonald's and stop buying avocado toast, ya minge. \n\n", "score": 7, "replies": [{"body": "That same 800 invested in McDonald’s in 1976 would still be worth like 2.5 mil today. \n\n", "score": 5, "replies": []}]}, {"body": "thats my fucking play money", "score": 6, "replies": [{"body": "So far this year I have had gains of about 5.1 million and losses of close to 5 million. At one point I was net positive about a million. I need to get better at risk management. \n\nI pay more in interest fees everyday than this guy sold his appl shares for. ", "score": 6, "replies": [{"body": "yeah, but presumably you aren't investing in companies where $800 will buy you 10% of them\n\nIf you ARE, though, I just started a consulting firm..", "score": 7, "replies": [{"body": "Didn’t say I was, just that my daily fees surpass what was too much money to lose to this guy at the time. ", "score": 3, "replies": []}]}, {"body": "Man I'd love to have that much capital. I'm just a uni student trying to make side cash though.", "score": 1, "replies": [{"body": "My account only has 976 net liquid right now. Beginning of last year it was at 260. I just make a lot of trades.", "score": 1, "replies": [{"body": "Grand?", "score": 2, "replies": []}]}]}]}]}]}, {"body": "He panic sold. \n\n>He also said he felt the Apple enterprise \"would be successful, but at the same time there would be significant bumps along the way\"\n\n\nhey, I have 10% of a potentialy successful company. \n\nbut ... 800 bucks buys a lot of pant suits. ", "score": 10, "replies": [{"body": "It nearly went bankrupt in the late 90s so his weak hand would have sold it then.", "score": 7, "replies": [{"body": "but for more that 800.\n\nno wait, he would exchange it for a Cup Noodle, not even prepared. ", "score": 9, "replies": []}]}]}, {"body": "I read somewhere that his shares made him a founder and he would be reliable for whatever trouble jobs got into. ", "score": 2, "replies": [{"body": "That's not how corporations work", "score": 1, "replies": [{"body": "I'm not describing it well but he sold those shares so that he couldn't be responsible for whatever trouble apple got into. \n\nLook it up, nerd boy. ", "score": 2, "replies": []}]}]}, {"body": "Just sell half of it if you're so worried about pooping your pants and you still have 40b today. ", "score": 2, "replies": []}]}, {"body": "Top 3", "score": 15, "replies": []}, {"body": "Take that go getter attitude to the roulette table and you'll have even better odds than he did!", "score": 5, "replies": []}]}, {"body": "42 years ago your mom opted to fuck your dad instead of a blowjob and now you’re here.", "score": 132, "replies": [{"body": "you mean 17 years ago", "score": 46, "replies": [{"body": "You mean 13 years ago", "score": 68, "replies": [{"body": "13 years and 8 months", "score": 5, "replies": []}, {"body": "[removed]", "score": -5, "replies": [{"body": "Wrong sub Dreamkazper", "score": 4, "replies": []}]}]}]}]}, {"body": "I am just surprised he is still alive and hasn’t killed himself yet. ", "score": 55, "replies": [{"body": "Maybe here tried and failed at that too", "score": 35, "replies": []}]}, {"body": "He's a 3x leveraged beta cuck. \"In the early 1990s, Wayne sold the original Apple company agreement, signed in 1976 by Jobs, Wozniak and himself, for $500. In 2011, the contract was sold at auction for $1.6 million. Wayne has stated that it is the one thing he regrets about his involvement with Apple.\"", "score": 23, "replies": [{"body": "he is beyond autistic. \n\nthe definition of panic seller. \n\n\n Ronald \"Panic Sell\" Wayne \n\n", "score": 22, "replies": []}]}, {"body": "Hindsight is 20/20", "score": 23, "replies": [{"body": "Wrong.  Hindsight is 50/50.  Source:  Cam Newton.", "score": 18, "replies": [{"body": "I find it funny that beta males are talking about Cam Newton - Cam Newton", "score": 4, "replies": [{"body": "C a a a a a a a a m\n\nN e w t o o o o o o o o o n", "score": 2, "replies": []}]}, {"body": "Explain? ", "score": 1, "replies": [{"body": "https://www.youtube.com/watch?v=BBau6MRZSiE&app=desktop", "score": 3, "replies": [{"body": "whatever number it is, who cares, ya know\n\nxD", "score": 3, "replies": []}]}]}]}]}, {"body": "You never go broke taking profits!", "score": 22, "replies": [{"body": "[removed]", "score": 7, "replies": [{"body": "yea but the stamps cost one million dollars each", "score": 1, "replies": []}]}]}, {"body": "And a huy bought pizza with 12000 bitcons 7 years ago and has 0 left atm. ", "score": 14, "replies": [{"body": "When I think about the times I got fucked out of money and to think of this. Jesus fucking christ", "score": 11, "replies": []}]}, {"body": "\"Shortly after February 1974, Wayne came out as gay to Jobs, while both men were employees at Atari. Jobs later recalled, \"It was my first encounter with someone who I knew was gay.\" Wayne said in 2011 that, \"Nobody at Atari knew, and I could count on my toes and fingers the number of people I told in my whole life. But I guess it just felt right to tell him, that he would understand, and it didn't have any effect on our relationship.\"[19]", "score": 11, "replies": []}, {"body": "Ouch. Heard Walter White did the same thing. Periodically, I check my past trades. Glad I got out of JNJ when I did. Wish I would have stuck it out with Honeywell. We live and we learn. ", "score": 10, "replies": []}, {"body": "I remember reading an article about this guy, I think maybe around when the Steve Jobs bio by Isaacson came out. The gist is that the way Apple was set up at the time, the owners were joint and severally liable. So if Steve Jobs were to run some scam (sorry...\"reality distortion field\") and get into deep financial shit, the creditors could come after him as well. Ronnie boy was worried that Jobs would do just that, which is why he sold. He also felt that his contributions were nowhere near as big as the Steves'. He was basically the original \"adult supervision\", but those other two guys were the best engineer and the best salesman of their generation.", "score": 3, "replies": []}, {"body": ">In the early 1990s, Wayne sold the original Apple company agreement, signed in 1976 by Jobs, Wozniak and himself, for $500. In 2011, the contract was sold at auction for $1.6 million. \n\nYo Wayne if you're reading this can you sell me some baseball cards?", "score": 3, "replies": []}, {"body": "not only that,\n\n\"In the early 1990s, Wayne sold the original Apple company agreement, signed in 1976 by Jobs, Wozniak and himself, for $500. In 2011, the contract was sold at auction for $1.6 million.\"\n\nBut hey he's alive and Steve Jobs is dead, so who's the real winner?", "score": 3, "replies": []}, {"body": ">After leaving Apple, Wayne resisted Jobs' attempts to get him to return, remaining at Atari until 1978\n\nCuck me once shame on me, cuck me twice shame on me. ", "score": 3, "replies": []}, {"body": "Netflix was worth that much since last earnings. Did you sell your shares back then?", "score": 5, "replies": []}, {"body": "Sad that all those trillions hasn't made more billionairs", "score": 2, "replies": []}, {"body": "Wozniak isn't a billionaire either\n\nWhat happened to him?", "score": 2, "replies": []}, {"body": ">Wayne drew the first Apple logo, wrote the three men's original partnership agreement,[5] and wrote the Apple I manual.[4][6]\n\n>Legally, all members of a partnership are personally responsible for any debts incurred by any partner; unlike Jobs and Wozniak, then 21 and 25, Wayne had personal assets that potential creditors could seize.\n\nOuch. He wrote the original partnership document, and then pulled out because he was scared of the liability that a partnership gave him. If he had just done the paperwork to make it a C Corp in the first place, he wouldn't have had had to stress.", "score": 2, "replies": []}, {"body": "Who did he sell it to?", "score": 1, "replies": []}, {"body": "That's what she said. \n\nI'm ashamed of all of you for not seeing this sooner. ", "score": 1, "replies": []}, {"body": "Who longs anything? That $800 being tied up could have made him more", "score": 1, "replies": []}, {"body": "He had a second chance and STILL blew it:\n\n>In the early 1990s, Wayne sold the original Apple company agreement, signed in 1976 by Jobs, Wozniak and himself, for $500. In 2011, the contract was sold at auction for **$1.6 million**.", "score": 1, "replies": []}]}
