{"title": "TFW Investment Advisor drinks to the crash of the economy in front of you", "selftext": "", "id": "t6uenc", "created_utc": 1646432056.0, "score": 1370, "upvote_ratio": 0.98, "num_comments": 82, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|1 day ago\n**Total Comments**|1|**Previous DD**|\n**Account Age**|9 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=t6uenc)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=t6uenc)", "score": 1, "replies": []}, {"body": "Gulag an chill?", "score": 78, "replies": [{"body": "For russians only gulag in deep Siberia.", "score": 4, "replies": []}]}, {"body": "I got drilled in the r/unexpected sun for saying she was cute.  Fuck Putin, also.", "score": 170, "replies": [{"body": "I too think Russian Scully is cute.", "score": 113, "replies": [{"body": "Touché dear sir.\nI get the reference and this one is indeed hotter", "score": 20, "replies": [{"body": "Scully in the TV show the fall.  I'm a young man who really only knows of the x files from my mom. But older scully has still got it as far as I'm concerned.", "score": 6, "replies": []}]}]}, {"body": "Actually ladies in Russia are beautiful imo.", "score": 28, "replies": [{"body": "In the words of Peter Griffin: Women in Russia are either ones or tens.", "score": 27, "replies": []}]}, {"body": "I like how her face goes from shocked to smirking, almost as if she approves but cannot say so because she would be fired.", "score": 45, "replies": [{"body": "\"The cat was right, I should have bought the boat.\"", "score": 13, "replies": []}, {"body": "One of us, one of us, one of us.", "score": 5, "replies": []}, {"body": "“Fried”", "score": 1, "replies": []}]}, {"body": "Cause what does that have to do with anything about the post", "score": 1, "replies": [{"body": "It’s a post with a pretty face", "score": 1, "replies": []}]}, {"body": "She's a fox; I'm sure she'll do you and not the other way around, as she's a Rusky...and I'm quite ok with that...", "score": 1, "replies": []}]}, {"body": "[For context](https://imgur.com/gallery/MAvPqoQ)", "score": 32, "replies": []}, {"body": "For all the dudes in this thread saying she is cute, her name is  Elina Tikhonova. Thank me later.", "score": 30, "replies": [{"body": "not all heroes wear capes", "score": 6, "replies": []}, {"body": "r/Russiangirls thank me later", "score": 6, "replies": []}, {"body": "Her name is only bringing up stories related to this- nothing worth thanking you over.", "score": 8, "replies": []}]}, {"body": "I'd smash", "score": 112, "replies": [{"body": "Get in breadline comrade", "score": 51, "replies": [{"body": "What about cigarette line?", "score": 7, "replies": []}]}, {"body": "Id slap that ask", "score": 51, "replies": [{"body": "This needs more upvotes", "score": 9, "replies": [{"body": "![img](emote|t5_2th52|8881)", "score": 5, "replies": []}]}]}, {"body": "She's thinking of smashing that broker because he was so based.", "score": 9, "replies": [{"body": "Silly rabbit, chicks are into guys with money, and this guy just spent the last of his on a bottle of bottom-shelf vodka.", "score": 4, "replies": [{"body": "I'd take bottom shelf vodka over no vodka. If you gotta go, might as well go with a good buzz and a good fuck.", "score": 4, "replies": []}]}]}]}, {"body": "I didn’t realize how attractive Russian & Ukrainian women are.", "score": 61, "replies": [{"body": "I remember my first day on the internet. Went through a lot of lube. \n\nMan my ass was sore.", "score": 77, "replies": [{"body": "You know you don’t need your dad with you when you use the internet, right?", "score": 37, "replies": [{"body": "Am I missed a joke here?", "score": -8, "replies": [{"body": "No dad, calm down.", "score": 11, "replies": [{"body": "![img](emote|t5_2th52|4267)", "score": 10, "replies": []}]}]}]}, {"body": "![img](emote|t5_2th52|4271)", "score": 5, "replies": []}, {"body": "Try finger, but hole", "score": 3, "replies": [{"body": "someone played Elden Ring lmao", "score": 4, "replies": []}]}, {"body": "Rip dude. My first time internet was  like  shooting teletubbies as 8y old boi XD", "score": 1, "replies": []}]}]}, {"body": "\"We're gonna get gulag'd, but he's right.\"", "score": 14, "replies": [{"body": "\"I've made a huge mistake\"", "score": 1, "replies": []}]}, {"body": "People keep saying that he was drinking to the end of it, but that sounds like he was celebrating it. It was more like he was toasting in reverence for the death of a good friend.", "score": 13, "replies": [{"body": "Sometimes things are so shit that you can't help but laugh.", "score": 2, "replies": []}]}, {"body": "I think they will have to nationalize their companies.", "score": 8, "replies": [{"body": "Oh. So the Soviet Union is coming back after all?", "score": 12, "replies": [{"body": "The boyz on the bloc", "score": 10, "replies": []}]}]}, {"body": "She on Onlyfanskas?", "score": 25, "replies": [{"body": "You can buy a lifetime subscription for $0.5 usd right now", "score": 19, "replies": []}, {"body": "Sadly they are banned from monitonizing their art.", "score": 7, "replies": []}]}, {"body": "Tfw trying to hide an orgasm in your pants", "score": 6, "replies": []}, {"body": "She's pretty hot ngl", "score": 5, "replies": []}, {"body": "I’m not gonna comment because I don’t want to believe it", "score": 4, "replies": []}, {"body": "Must really suck to be living in Russia atm, even more than before.", "score": 5, "replies": [{"body": "Not really, that’s pretty fun and exciting. You are basically living in a movie rn", "score": -2, "replies": []}]}, {"body": "When you realize the investment advisor will “disappear” after this segment", "score": 3, "replies": []}, {"body": "Russian Taylor Riggs????", "score": 2, "replies": []}, {"body": "The face “WTF”  to “R.I.P”", "score": 2, "replies": []}, {"body": "you can tell, she'll hate fuck him later", "score": 2, "replies": []}, {"body": "yummy", "score": 2, "replies": []}, {"body": "I'd smash", "score": 2, "replies": []}, {"body": "😂😂😂", "score": -5, "replies": []}, {"body": "[removed]", "score": -15, "replies": [{"body": "Yes in fact I believe you can drink water", "score": 7, "replies": []}]}, {"body": "I feel like this is the look I get from you guys when I tell you to buy physical silver... Thankfully I don’t have to drink myself to death because it protects itself from inflation and protects its purchasing power. I’d advise people to go to Wall Street Silver and check it out. Putin is backing the rubble by gold. FYI commodities are skyrocketing", "score": -10, "replies": [{"body": "GORO better", "score": 2, "replies": []}, {"body": "So… buy oil?", "score": 2, "replies": [{"body": "No silver... physical", "score": 0, "replies": [{"body": "Ohhhh ok. Got it. Buy oil. Thanks.", "score": 6, "replies": [{"body": "Yea silver silver", "score": 0, "replies": [{"body": "Right. Silver. If it were liquid form, and black, and came in barrels extracted from the ground. Like oil. Buy oil.", "score": 4, "replies": [{"body": "Silver barrels filled with oil?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Bought July 25c DBC cause Merrill doesn’t offer WEAT. 👍", "score": 1, "replies": []}]}, {"body": "left should be added as wsb emoji", "score": 1, "replies": []}, {"body": "She probably realizes there will soon not be an economy in Russia. Why would they then need economic tv shows?", "score": 1, "replies": []}, {"body": "you have to admire her professionalism, i would have totally doubled over laughing", "score": 1, "replies": []}, {"body": "So WSB is no longer a stock frenzy huh", "score": 1, "replies": []}]}
{"title": "Russian economy is experiencing 'crack-up boom' now", "selftext": "Within a matter of week the Russian economy seems to have entered the disastrous inflationary stage that the Austrian economists described as the crack-up boom.\n\nThe crack-up boom occurs in the inflationary environment when the public opinion comes to the realization that the inflation will not be stopped and the purchasing power of their cash holdings will continue to decrease. In such a situation, people start to buy as much as they can and decrease their cash holding to a minimum. This, in its turn, increases the supply of money further more and decreases the demand for money, which accelerates price increases and fall in the purchasing power of money. The economy and the public enter a vicious cycle, and soon people become desperate to get rid of money and try to obtain what they consider “real good”. Thus, in a very short time, once widely used money becomes to be perceived as worthless, and soon there is no one left who wants to accept it in exchange of giving up “real goods”.\n\nInterestingly enough, the key is not the inflation itself, but the public’s anticipation of the inflation.\n\nThis is the reason why for a very long time the economy can stay in inflation and be reasonably stable, as, even though people may realize they are losing purchasing power, the mere fact that they anticipate the inflation to end and prices go down, will be enough for them to hold or even increase their cash holdings.\n\nThe Russian economy has been experiencing inflation for a very long time, however it was the moment when the war started and the sanctions were introduced when the Russian public realized their rubles will start to lose their purchasing power indefinitely and the Russian crack-up boom started within a few days.\n\nAnalyzing what happened to Russia is easy now. Everybody is watching Russia with close eyes, so close that it seems many missed J. Powell’s recent comments where he said he sees only 0,25% increase in the interest rates in March as appropriate, while the official American CPI number is expected to print above 8%…\n\nSo far the Fed has done a great job of convincing people that inflation is transitory and/or it is under the Fed’s control…But the question is when the American public will realize that the Fed cannot and does not want to fight inflation?", "id": "t6w2mv", "created_utc": 1646436883.0, "score": 88, "upvote_ratio": 0.84, "num_comments": 83, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|14|**First Seen In WSB**|1 year ago\n**Total Comments**|100|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=t6w2mv)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=t6w2mv)", "score": 1, "replies": []}, {"body": "I’m gonna wait for Cramer’s opinion.  Then I’ll know exactly what to do.", "score": 42, "replies": [{"body": "haha, two strategies that guarantee a win -  1. inverse Cramer 2. follow Pelosi", "score": 22, "replies": [{"body": "2. Follow Pelosi. Except when ARKK is involved.\n\n🪦 RBLX.", "score": 13, "replies": [{"body": "oh yes, Follow Pelosi but still inverse Cathy haha", "score": 14, "replies": [{"body": "I still wonder if Pelosi knows something and there is an M&A or buyout eventually that rescues her RBLX calls? The thing is I just don’t see it happening over $100 so I’m gonna assume that was a burner pick of hers to take some heat off her insider trading and also fleece retail.", "score": 8, "replies": [{"body": "could totally be her doing some intentionally stupid trades to decrease her fame as the greatest investing mind of our times", "score": 7, "replies": []}]}]}]}, {"body": "Pelosi got those google calls. We’re having a second peak before we crack down bang", "score": 3, "replies": [{"body": "Dates and strike prices please", "score": 2, "replies": []}]}]}]}, {"body": "Are my AMD calls going to crack up boom?", "score": 47, "replies": [{"body": "every crap is gonna crack up boom in dollar terms... except your AMD calls of course haha", "score": 25, "replies": [{"body": "You couldn't possibly time this war better to use it as an excuse to enter a bear market.", "score": 3, "replies": [{"body": "I thought war was good for stocks", "score": 4, "replies": []}]}]}]}, {"body": "The Fed does want to fight inflation. The only problem is that more businesses will become insolvent which in return wil higher the risk in the markets and therefore increase interests again. So their tactic is to postpone this downward cycle as much as they can but know very well its temporary else you get a coin like the one turkey has. No central bank will ever tell the truth because market stability is one of their core strategies. Telling ppl you expect high inflation is against that strategy", "score": 10, "replies": [{"body": "If the Fed wanted to fight inflation, it would have started it. Instead they mad Russia as the next excuse… There is too much debt in America. It is clear the Fed and the government decided to inflate that debt instead of defaulting. However comments like this prove that the American crack up boom has some time before happening.", "score": 8, "replies": [{"body": "In fighting inflation there is no choice to be made. Economics is a science and not acting accordingly will have consequences. So the fed has no choice. By postponing actions the risc that a low conjuncture will become a crisis increases. Delay of actions also results in a longer low conjuncture. Did you ever read some books about macro economics? If you’re interested in this it might help and I find it fun.", "score": 1, "replies": [{"body": "I have phd in economics and read books on economics every day. The Fed has a choice, the choice to inflate the US debt away or have the Great Depression 2.0. Seems it chose the first one.", "score": 2, "replies": [{"body": "Ok so help me understand. Money creation is done via the creation of debt they are not creating it and simply giving it away. How will the creation of more debt help inflate debt away?", "score": 1, "replies": []}]}]}, {"body": "With a supply side inflationary issue, ramping rates and taking capital out of the market will make it likely worse.\n\nWe need either demand to decrease (unlikely) or supply to increase (difficult).\n\nNot sure they're holding as much as, they are stuck. Any actions at this point likely drive further inflation. You have to bag hold this bitch until the scenario changes. Which it guaranteed will when we make a bunch of people poor again. The consensus seems to be the covid related stimulus pounded $$'s into the market at the exact wrong time, you need that to play out.", "score": 1, "replies": []}]}]}, {"body": "The stock market seemingly wants to be put out of its misery,but the FED keeps saying no. That’s why I bought the dip today and will buy the dip again next week.", "score": 14, "replies": [{"body": "get rid of dollars however u can, honestly. Heck, even investing in canned tuna is better than holding cash.", "score": 3, "replies": [{"body": "Man Im in Central Europe and will spend most of my salary on tuna and olives... hopefully wont starve.. maybe freeze to death next winter if gas is cut off from Russia... happy 2022", "score": 8, "replies": [{"body": "Uh buck up. Go cut some wood and season it over the summer. Us Canadians can do it, you can too", "score": 6, "replies": [{"body": " and light my apartment on fire? :D", "score": 1, "replies": [{"body": "Youuu dont neeeed an apartment.", "score": 1, "replies": []}]}]}, {"body": "happy 2022! remember all is solvable... except a nuke dropping on our heads", "score": 6, "replies": []}, {"body": "You need more sex to stay warm", "score": 2, "replies": [{"body": "First good advice on Reddit..ever", "score": 2, "replies": []}]}]}, {"body": "Ok.  Lost it all, mission done.", "score": 2, "replies": []}, {"body": "Man the dollar just keeps going up the more shit and uncertainty there is in the world. I have completely the opposite view than you. The dollar is the primary currency of the world, and it is not going anywhere. As a foreign holding USD and USD dividend stocks provides at very good return (as compared to our negative interest rates in my own currency ha ha)", "score": 0, "replies": []}]}]}, {"body": "As far as I understand purchasing boom in Russia is caused not only by expected inflation, but also (and maybe mostly) by expected total unavailability of stuff - already Apple sales suspended, Ikea closed, etc.", "score": 9, "replies": [{"body": "Hm good point", "score": 4, "replies": []}]}, {"body": "Did I just learn something on wallstreetbets?", "score": 6, "replies": []}, {"body": "They are so royally screwed it’s incredible. \n\nI honestly have never seen such a catastrophe in my lifetime, but this could very well be a complete collapse/dissemination of Russia as we know it.\n\nI could see them being broken into several countries, some more socialist vs others. We are witnessing history.\n\nAlso… if Cramer agrees with me do the opposite.", "score": 10, "replies": [{"body": "Can't know how things will play out but I agree. A lot of the debt in Russia is due in foreign currencies, and a lot of that is ultimately in dollars. \n\nIt makes me feel bad for the average Russian Joe (Vlad?).\n\nA few days ago his mortgage was 7500 Rubles and now it is 12500 Rubles. His job isn't paying more. In fact the product they make is being pulled off shelves in Western markets. If they don't find a North Korean buyer he's probably going to get fired. If he says publicly he doesn't like it, or the war that could very well kill his relatives in either country, he's facing 10-15 in the gulag.\n\nJust like here people will turn to alcohol, drugs, crime, and it's going to be awful.\n\nThe options for debtors in foreign currency are to default or for the government to somehow nullify the debt and fuck over the ability to interact with external financial systems even further. I have a feeling the poor will face default and homelessness while the wealthy will be protected.", "score": 4, "replies": [{"body": "Do you have a source about huge part of foreign debt in Russia?\nAs a Russian and having a bit of “insider” knowledge- that was the case in 2014, when rouble went from 35 per dollar to 70.\nThat’s not the case for current Russia.\n\nNot that the situation is not catastrophic without that debt part, it is, it’s just that debt in foreign currencies is not the main issue.", "score": 1, "replies": []}]}, {"body": "Hm, yea I think Russia is screwed now. Though I am not sure they won’t be able to recover. It maybe us who loses at the end tbh. After all Cramer is on your side, if your think", "score": 3, "replies": [{"body": "Yes, I’m curious what the law of unintended consequences is going to end up doing when the dust settles. \nI don’t think us in the West are going to come out of this scot free.", "score": 1, "replies": []}]}, {"body": "Putin might “win” the war, but he will also successfully turn Russia into a third world country\n\nIf the war carries on it is inevitably that the west will stop buying their gas and oil.. Another 50% of the economy gone.", "score": 2, "replies": []}]}, {"body": "I see what you did there.\n\nDamn, that was a fast code-switch!", "score": 3, "replies": [{"body": "calls it is ?", "score": 2, "replies": []}]}, {"body": "So I read that the Russians still haven’t opened their stock market, for like 5 days in a row now… can they just keep it closed indefinitely? Or until they take over Kyiv or something? Is that legal?", "score": 3, "replies": [{"body": "is it legal ? The government never cares what is legal and what not, they do what they want.   \nI think it will reopen, maybe after Russian government or the oligarchs scoop up all those companies behind the scenes.", "score": 3, "replies": [{"body": "Oh wow yea I just read that after 9-11 the US government shut down the market until the 17th to prevent a crash… huh.. I always thought the government could regulate it and what not but not really pull the plug like that", "score": 3, "replies": [{"body": "The government can do whatever it wants. Look at Trudeau freezing peoples accounts with a strike of a pen.", "score": 10, "replies": []}]}]}]}, {"body": "Was waiting for the comparison to the Fed at the end.\n\nYup, pretty soon we’ll see analysts from JPM go on CNBC toasting the death of wall street because Jpow decided to only hike 25bp instead of 50bp. Absolutely no other difference to the Russian economy.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Did u trade those Nokias?", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "And she, I suppose, licked your balls, so that’s a fair trade", "score": 1, "replies": []}]}]}]}, {"body": "Decrease my cash. Got it", "score": 2, "replies": [{"body": "I have decreased mine to minimal", "score": 2, "replies": [{"body": "What are you buying", "score": 2, "replies": [{"body": "Very unpopular things. Commodities", "score": 2, "replies": [{"body": "How does one get into commodities?\nI have some oil stocks bought at the beginning of the year, but that’s about it.", "score": 1, "replies": []}]}]}]}]}, {"body": "Interest will go up way higher than 0.25 in consecutive meetings. All economists believe interest rates and inflation inversely proportional. So I have no doubt there will be drastic interest rate increase of inflation doesn't go down. Fed can calm down the inflation. Only issue is with what cost. If the cost is mild recession, then they will do it. But the war complicated things. If it continues commodities like platinum Palladium will go through the roof.", "score": 1, "replies": [{"body": "The fed can calm inflation with some giant rate increases.  Doing so will shoot the legs out of the housing market\n\nSeems they are playing a draw rather to win, and it's not a good strategy", "score": 5, "replies": []}, {"body": "so why haven't the rates gone up yet ? Official inflation is around 8% for the second year already, and the real inflation must be well above 10%... If the Fed wanted or could stop the inflation, it would have done it already. The truth is Russia is another excuse to delay the American crack-up boom.", "score": 3, "replies": []}]}, {"body": "Bitcoin is the answer.", "score": 6, "replies": [{"body": "Dude I know a guy who bought all the used coffee machines on the east coast when the first panny dip happened. He already is a decamillionaire. I'm a crypto guy too but anything that moves is the answer right now.", "score": 5, "replies": [{"body": "Panny dip?", "score": 3, "replies": [{"body": "March 2020", "score": 5, "replies": []}]}]}, {"body": "No retard gold and silver is the answer. Now you will call me a shill and a dinosaur but we will see who has the last laugh.", "score": 2, "replies": [{"body": "Well, starting with calling me names is never a good way to try and convince anyone to your side of an argument. 🙄\n\nBut I agree, it is good practice to have some money invested in PHYSICAL precious metals.", "score": 6, "replies": []}, {"body": "Why not both?\n\nBitcoin is mobile and relatively easy to hide, while gold is a good insurance against \"shit hits the turbojet of a 747\"", "score": 2, "replies": []}]}, {"body": "This shit pisses me off, how is a correlated asset the answer? Oil, Gold & Silver have all been green when stocks dump while bitcoin been red YTD.", "score": 2, "replies": [{"body": "That’s because you’re only seeing Bitcoin as a share. It’s more than that. Do a bit of research on what bitcoins purpose is. Hint: it’s not about making you rich.", "score": 2, "replies": [{"body": "Nice \"buy BTC\" then \"do your own research\" when asked why.", "score": 1, "replies": [{"body": "Here you go:\n\nhttps://youtu.be/VYWc9dFqROI", "score": 1, "replies": []}]}]}]}]}, {"body": "The money is worthless to buy foreign shit. Foreign shit that they can't buy anyway. Your theory is flawed. Inflation will contain itself, there will be is misery and nothing to buy.", "score": 1, "replies": [{"body": "Plenty of foreign shit they can still buy, just going to cost them 2-3 x as much\n\nNot every country cut them off", "score": 3, "replies": [{"body": "What? China. They will be paying gas prices in exchange, don't fell bad for them.", "score": 1, "replies": []}]}, {"body": "How would inflation contain itself if nobody wants to hold rubles and deems rubles as worthless?", "score": 3, "replies": [{"body": "You deems that? You. Again if they can't buy shit from outside it doesn't really matter. And they don't need to import fuel or food. It will never be a Venezuela. \nAnd they will be trading gas for shit from China at gas prices not rubles.", "score": 3, "replies": []}]}]}, {"body": "Got it, have a  three some with Pelosi & Cathy while Cramer records it.", "score": 1, "replies": [{"body": "Put it on onlyfans I will pay to watch it.", "score": 2, "replies": []}]}, {"body": "You can see this shit unfold without a war on the last 20 years of argentina.\nIts like the scene for back to the future when marty says \"I've seen this one\" and they tell him \"this is brand new\"", "score": 1, "replies": []}, {"body": "Okay, just spoon feed me positions. Mods should ban the words, \"Austrian\" and \"economics\" from this place already. Makes me feel anxious.\n\nShould I buy long dated ITM SPY Puts like a year out?", "score": 1, "replies": []}, {"body": "CPI 8%… do you have data to back this up…?", "score": 1, "replies": []}, {"body": "So what's your point?", "score": 1, "replies": []}, {"body": "This is why I see crypto as a viable option. However I also understand that in a market crash it’s highly likely that people will see crypto as a risk asset and dump it. But my instinct is that long term fiat goes to zero. No matter what economy it is. So holding companies and other currencies (in this case crypto) as part of your portfolio can protect you. Let’s see what happens!", "score": 1, "replies": []}, {"body": "...So you're saying buy WISH? ![img](emote|t5_2th52|8883)", "score": 1, "replies": []}, {"body": "Naw USA will be like Japan when this bubble finally pops...deflationary", "score": 1, "replies": []}, {"body": "Crypto is the future, fuck the fed and there infinity money printing", "score": 1, "replies": []}]}
