{"title": "$AMD $12.5/$13 calls", "selftext": "[deleted]", "id": "8mn1e0", "created_utc": 1527477615.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 12, "comments": [{"body": "Do you want to trade options or gamble? go to r/wsb if you want to bet it all on red.", "score": 3, "replies": [{"body": "I've had these for a while, nor are they my only calls. I said that already. I have JD calls, worth a few thousand, calls on CAT, etc.\n\nYou're just not good enough for us over on r/wallstreetbets", "score": -1, "replies": [{"body": ">I'm up 100% & 55%. Sure, I should lock in some profit, but these were cheap calls. It's certainly my entire options portfolio\n", "score": 1, "replies": [{"body": "On 12.5 & 13. Not the 12, obviously. Intel $55 calls as well. ", "score": 1, "replies": []}]}]}, {"body": "Also snap and mu puts", "score": 0, "replies": []}]}, {"body": "I think AMD long term is good. I'm hoping it reaches ATH again soon.", "score": 1, "replies": [{"body": " It's definitely an iffy one, that's for damn sure. I hope it hits  $25 by my expiration date. ", "score": 1, "replies": [{"body": "Yeah, with your expiration, realistically probably could hit $16 if the market doesn't decide to have a sell off again.", "score": 1, "replies": [{"body": "It had the bullish stick there when i was looking. I'm just trying to see +500% lol. I think the only way that will happen is if bad news, or the new series of nvidia cards entirely ass rapes amds line. ", "score": 1, "replies": []}]}]}]}, {"body": "You would've made a lot more if you'd bought the $13.5 call instead. Seriously though, this is a speculative position, pretty much the same as holding the stock with leverage \\(except you have negative theta\\). If you think your fundamental analysis is tight, stick with it. Let's be frank \\- no one has a fucking clue where the stock will be when your calls expire. Personally, I have no interest in holding calls in the hope that the stock will moon.", "score": 1, "replies": [{"body": "Of course they don't. It was just a random question, to create a general conversation about the topic. Just fishing for others hypothesis', etc. \n\nI think I would be an idiot to sell them early, if at all. ", "score": 1, "replies": [{"body": "There's nothing wrong with placing low probability bets with potentially massive payoffs, as long as you understand the dynamics of the strategy.", "score": 1, "replies": []}]}]}]}
{"title": "DIS vs CMCSA", "selftext": "Do you believe the battle for Fox going to have an impact on their share price? If it does, would this be a good or bad time to invest in these undervalued companies?", "id": "8mqt0q", "created_utc": 1527520703.0, "score": 5, "upvote_ratio": 0.73, "num_comments": 9, "comments": [{"body": "I don't think Disney is going to let Comcast win. Comcast has a ton of debt and it could lower their credit status if they try to acquire with borrowed cash (which is what they are trying yo do). Meanwhile, Disney's offer is lower and made with stock. Disney's stock price has varied much less than most major companies in the past 36 months. So a stock offer from Disney makes sense because theoretically the stock price will likely remain around where it is now. \n\nAnyways, I predict Disney will end up paying more for the deal than they originally intended. Possibly this was Comcast's plan all along just so they can be a bunch of D-bags. I would love to hear what other people think. \n\nLong term I am thinking Disney is a good bet. I don't know about Comcast but as a (forced) customer of theirs, I hate them. ", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Hey, AhmedEbadKhan, just a quick heads-up:  \n**alot** is actually spelled **a lot**. You can remember it by **it is one lot, 'a lot'**.  \nHave a nice day!\n\n^^^^The ^^^^parent ^^^^commenter ^^^^can ^^^^reply ^^^^with ^^^^'delete' ^^^^to ^^^^delete ^^^^this ^^^^comment.", "score": 1, "replies": []}]}, {"body": "Just buy Netflix why mess around?", "score": -4, "replies": [{"body": "Lol.... ", "score": 2, "replies": []}, {"body": "sigh", "score": 1, "replies": []}, {"body": "I don't know why the Netflix comment got downvoted. Maybe because it doesn't have to do directly with what OP is asking, but either way...would you rather have Disney or Netflix? \n\nNetflix has killed Disney each of the last 4 years in terms of stock rise and continues to go up. Disney even stayed flat last year while the Dow it's in went up 20&#37;. Disney can't even rise after releasing multiple billion dollar movies. \n\nSure, Disney will go up in the future and it's not going anywhere, but I have no reason to believe that it will beat Netflix any time soon. ", "score": 1, "replies": [{"body": "When Netflix has its first “ESPN” moment we will see how strong it is. For now it’s all hype. It’s crazy to me that’s company that produces a couple of shows is valued more than the company that has IP such as Star Wars, marvel, classic disney, parks around the world, tv channels and a whole chain of merchandise and retail.", "score": 2, "replies": []}, {"body": "Those who can’t go beyond what they’ve learned in books can’t get behind Netflix. For me, it is the best company on the planet. There is no stopping it’s growth. I wouldn’t invest in Disney when all that people can get behind is that it hopes to compete with Netflix streaming in the future. Good luck with that. Netflix is already doing it and running so far away from the chance of there ever being any real competition. ", "score": 0, "replies": [{"body": "Downvoted because derails from op. \n\nBut with the acquisition DIS will have the majority stake in Hulu. Netflix is not doing anything DIS can’t, they’re first to market and faster. DIS content still blows Netflix out of the water and they always will because that is Disney’s core. \n\nDIS also has a leg to stand on with all their other assets generating revenue. Anyone can make a streaming platform. \n\n\nI say why not have both, at least until DIS shows what they can do. \n", "score": 2, "replies": []}]}]}]}]}
{"title": "[Question] Best stocks to look at/diversify portfolio with?", "selftext": "[deleted]", "id": "8mqt4x", "created_utc": 1527520736.0, "score": 1, "upvote_ratio": 0.55, "num_comments": 11, "comments": [{"body": "With limited funds you should just get an SP500 ETF. VOO and SPY are good options.", "score": 6, "replies": [{"body": "Why would that be best for someone with limited funds? Thanks for the reply as well! :) ", "score": 2, "replies": [{"body": "They give you more diversification and access to higher priced stocks with a low amount of funds. For example, an index fund following the S&P 500 gives you access to the growth of a company like Amazon, which you would have no exposure to buying individual stocks as the stock price is larger than your available funds ", "score": 5, "replies": []}, {"body": "You don't know what to buy and you are asking random strangers for ideas.  That is someone who belongs in an index fund until he/she knows what they are doing and doesn't need to get ideas from random strangers.\n\nAnd $1500 while a good start is not enough to buy an appreciable amount of stock.  It is a good start to say buy some T and add to it until you have $5k worth of it.  But most likely you will want to buy several stocks in which case you won't have enough of any of them to make an appreciable difference.  \n\nIt would be far better to buy an S&P 500 index fund and start educating yourself.  So that 3 or 5 years from now you know exactly what to buy.", "score": 2, "replies": [{"body": "I agree totally, but I am just asking for ideas because I want to know what others look for, not that I necessarily will be investing in what they say. Thanks for the help! ", "score": 1, "replies": []}, {"body": "no one ever \"knows\" what to buy..\n", "score": 1, "replies": []}]}]}]}, {"body": "I'm just going to be frank with you here, don't buy AMD (unless you're messing around with options)... It's extremely cyclical, has been trading between 10 and 13 for a while now, and with the sector it's in it is most likely not going to do well for at least a couple of years if not ever (both NVIDIA and Intel have strong holds on the market they're trying to compete it). This mixed with relatively poor guidance makes it kind of a joke for stocks. You can enjoy and appreciate the company and the products they give, but it doesn't necessarily mean they're a good investment (rule #1 of investing: don't let emotions get in the way).\n\nBack to your main question, I would take a look at pretty much any stock in the Semi-conductor market. Companies like AMAT, MU, QCOM are good bets, but just do research on companies before investing (obviously)\n\n\nEdit: forgot to put in a word that changed the whole sentenced", "score": 2, "replies": []}, {"body": "I agree with other comments suggesting you should buy ETF's. However, I believe that buying a whole market ETF is meaningless. You should buy ETF's specific to sectors that you believe can beat the market, this is extremely difficult but being able to beat the market shows your capability as an investor. For example, given your understanding if AMD, looking into semiconductor etfs would be good for you. Whole market ETF's are still good to hold as they will balance your beta but if you want to have more success than the average investor, incorporating specific sector etfs is the way to go. Also, im a 13 year old so you should probably take this with a few fists of salt.", "score": 1, "replies": []}, {"body": "$WM", "score": 1, "replies": []}, {"body": "With 1500$, if you wanted to play individual stocks to learn rather than putting it in an etf (much better and safer option, but you don’t learn as much)..I would pick five blue chip positions of different industries. 1500 isn’t risking a lot. Example: One to two tech (maybe one in software and one in hardware) One finance, One retail, one airline, one industrial, maybe one foreign etc.. some solid starter ones are Microsoft, Apple, Walmart, Visa, PayPal, Boeing, Facebook, Delta, 3m, Monsanto, Lowe’s...just do the research and see what you are comfortable with. \n\nIt helps starting out too if you pick a company you like because it adds to your motivation and personal interest in keeping up with these companies and can get you in a good habit when you do start to invest in other stocks. ", "score": 1, "replies": []}, {"body": "Buy oil.", "score": -1, "replies": []}]}
{"title": "Long allergan and Celgene as of friday.", "selftext": "What do you guys think about the recovery of undervalued overaold pharma stocks? Both are undervalued based off future cash flow and foward revenue. Do you think they show a good setup longterm from here?", "id": "8mpv0r", "created_utc": 1527512235.0, "score": 18, "upvote_ratio": 0.87, "num_comments": 14, "comments": [{"body": "Some newer Botox designs are coming, could eat up profits.", "score": 9, "replies": [{"body": "True but im hearing the quality of results is not up to par of botox,also doctors have good relationship with allergan. Also would you use a drug with years of use and positive results or a cheaper no track record drug for your face. Especially a rich face. ", "score": 3, "replies": [{"body": "meh, xeomin, botox, dysport. all the same shit, basically", "score": 1, "replies": []}]}]}, {"body": "Well celg is bio", "score": 3, "replies": [{"body": "The deal with Juno is gonna be a good one too, lots of money in boutique cancer treatments. ", "score": 2, "replies": []}, {"body": "Luspatercept data should be coming out in about 2 weeks. Accelerons biggest indication so if data is good this could bode well for CELG as they own 15% of the common stock. \n\nI got some 6/22 $85s", "score": 1, "replies": []}]}, {"body": "Allergan revenue base is durable — $5B in revenue going generic but rest (80% or so) has durable secular trends (aesthetics, ophthalmology, etc.). Plus, pipeline drugs get no credit (new migraine drugs, depression drug, and wet AMD drug).\n\nCelgene on the other hand is scary. Revlimid is 60% of revenue, is small molecule, and is likely going off patent in the early 2020s. Unless they secure a few settlements and are able to buy back a ton of stock or buy some miracle asset, hard to see them growing through the cliff.", "score": 3, "replies": [{"body": "You seem to know what you are talking about. How about biogen?", "score": 1, "replies": []}]}, {"body": "Biotech is a lot different to value. It may look undervalued but they could be valued correctly. This is because their valuations are based on what's happening now, they rarely account for drug patents running out. ", "score": 1, "replies": []}, {"body": "pharma stocks are too random", "score": 1, "replies": []}, {"body": "Juno should be the Miracle asset.\n\nOzanimod should also be going through in 2019.\n\nOtezla for psoriasis growing around 40% yoy.\n\nThey also upped the buyback program another $3 billion. It might be a good allocation of capital but they just really need something to hit big since Mongerson failed and Ozanimod is delayed. Hopefully JCAR017 data and Lustercept(sp?) data is good.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Fug micron. ", "score": -4, "replies": [{"body": "Boy, you must have done lost your damn mind. ", "score": 8, "replies": []}]}]}]}
{"title": "I'm the only one at my office. Anyone else think AIEQ will succeed?", "selftext": "[deleted]", "id": "8mq2f0", "created_utc": 1527514286.0, "score": 41, "upvote_ratio": 0.98, "num_comments": 14, "comments": [{"body": "> IBM's Watson\n\n\nThat's all I need to know to short it. IBM is years behind even open-source technology in the ML field. ", "score": 33, "replies": [{"body": "I keep telling everyone that. I'm a statistician at a hospital and the executives of the hospital want to use Watson, but I've easily been able to beat it in predictive accuracy by building a relatively simple model. For some reason, giving it a person's name, even though it doesn't really exist, is actually working on people who know nothing about ML.", "score": 21, "replies": [{"body": ">For some reason, giving it a person's name, even though it doesn't really exist, is actually working on people who know nothing about ML.\n\nAnd if you don't believe it, why don't you just ask Jeeves!\n\n", "score": 6, "replies": []}, {"body": "Even a horrendous AI could beat humans though and most are currently human.", "score": 3, "replies": []}, {"body": "IBM has stagnated from a great sales team, leading to poor engineering.", "score": 2, "replies": []}]}]}, {"body": "Probably not. It'll look great following some retarded strategy until it does something retarded and its dick flies off.\n\nPut it this way, 99&#37; chance profit, 1&#37; chance \"bullet to the head\" works until it doesn't.", "score": 12, "replies": [{"body": "Exactly, It’ll sell wing options when it starts playing with vol, until it can’t.", "score": 4, "replies": []}]}, {"body": "I agree w/ u, Im in with a small portion of my portfolio (up 10% since adding).  Just look at the fucks commenting on this thread, who will be back raving about it after the gravy train has left the station.  If AEIQ doesnt beat out all major indexes over the next 1-3 years, ill shove a full size carrot up my ass and then eat it.", "score": 5, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "I saw this it's dumb as fuck. Ibms Watson is dinosaur tech. Big ups on this etf's idea though. If it's successful they look smart and credible cuz their quants designed the algo. If it sucks they'll just blame the AI.", "score": 8, "replies": []}, {"body": "it's a piece of shit. Hasn't done anything for 6 months or however long it has been active.", "score": 3, "replies": []}, {"body": "as much as I want to call these guys retarded for using that meme enlightenment image:\n\nhttp://www.equbotetf.com/about-aieq/\n\nand for using IBM's watson instead of just hiring some stanford or berkeley ML devs (shit, even a lesser tier school's grad student would suffice)\n\nthey have the right idea. Eventually, models will be fully end to end. That is, after all, the goal of general AI anyway.", "score": 2, "replies": []}, {"body": "No AAPL, and no GS? I don't know how neither would end up there. ", "score": 1, "replies": []}]}
{"title": "Me when I see Tesla bulls and their insane thesis for the stock price in future", "selftext": "", "id": "8mqkxv", "created_utc": 1527518804.0, "score": 40, "upvote_ratio": 0.72, "num_comments": 19, "comments": [{"body": "You just don't understand. \n\nIf they can get to porsche's profit margins and toyota's production rate by next week, it's reasonably priced.", "score": 51, "replies": []}, {"body": "Put your money where your memes are and short it. I dare you", "score": 13, "replies": [{"body": "2020 Tesla puts all in, #YOLO", "score": 5, "replies": [{"body": "2020 Tesla calls all in, #YOLO", "score": 15, "replies": [{"body": "I could see 2020 TSLA puts and calls both being enormously profitable if sold at the right time\n", "score": 8, "replies": [{"body": "Who would've thought?  ", "score": 2, "replies": []}]}, {"body": "F.", "score": -3, "replies": []}]}, {"body": "I see your piehole flapping but am not seeing any of your money on the table.\n\nAlso what's with your obsession with Elon?\n\nDid he steal yo girl or something?\n", "score": 4, "replies": [{"body": "he stole my vegan salad and soy milk, I cant breathe. Need to inhale my own fart so that they dont cause global warming.\n\nGo Elon !", "score": -2, "replies": []}]}]}]}, {"body": "Calls on potassium cyanide and Kool-Aid because the way this is going, Elon's about to open up a commune", "score": 2, "replies": []}, {"body": "You have to understand, Elon is a profitable company. ", "score": 1, "replies": []}, {"body": "$TSLA \\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\> $600\n\n[https://www.youtube.com/watch?v=WG9EgxGsJuQ](https://www.youtube.com/watch?v=WG9EgxGsJuQ)", "score": -3, "replies": [{"body": "bruh I got a better video. $TSLA to $4000 soon.\n\nhttps://www.youtube.com/watch?v=j7oPJZG_boA&t=14s", "score": 11, "replies": [{"body": "Bruce Jenner runs a hedge fund?", "score": 9, "replies": [{"body": "You know you'd tap that Mr Jenner girl", "score": 5, "replies": []}]}, {"body": "> https://www.youtube.com/watch?v=j7oPJZG_boA&t=14s\n\n\"all cars will be automated with AI\" - Kevin O'Leary\n\nLol what", "score": 2, "replies": []}]}]}]}
{"title": "Salesforce ($CRM) earnings play", "selftext": "[deleted]", "id": "8mqtkm", "created_utc": 1527520832.0, "score": 19, "upvote_ratio": 0.89, "num_comments": 16, "comments": [{"body": "They report earnings after hours on Tuesday", "score": 12, "replies": []}, {"body": "The company I work for uses salesforce. Definitely a reason to short it.", "score": 9, "replies": []}, {"body": "[deleted]", "score": 9, "replies": [{"body": "My company uses Hubspot. Salesforce is way better and is the enterprise standard. \n\nMicrosoft Dynamics seems to be picking up traction in this space. Saw their ex-CMO promoting it on LinkedIn a few times. Executive initiative. ", "score": 3, "replies": [{"body": "I think both CRM and MSFT are basically cannibalizing SAP", "score": 4, "replies": []}]}]}, {"body": "Short term is hard to tell. Long term I'd buy in on that ER drop. Here in Germany Salesforce still has so many left opportunities", "score": 5, "replies": []}, {"body": "I wouldn't short it, too risky. If it goes down I'd buy the dip though. I had a 50% gain on HUBS calls after buying the dip.", "score": 5, "replies": []}, {"body": "Betting against Salesforce is a lot different than betting against any of the small companies you listed. I don't see much movement either way, beat or miss. If I wanted to tie up my capital, and if the IV were high enough, I'd sell stangles biased towards the upside. It's hard for me to imagine one of the largest and most followed names in tech, with ~50 analysts covering, will move more than an 8% jump at most... probably less than a 5% jump in reality. Someone at a bbg can look up past price reactions on earnings surprises to confirm/refute.", "score": 3, "replies": []}, {"body": "They have a huge customer base and are one of the most used sales software.  Retail is kinda weak right now, but industrials are moving some product.  The sales teams are most likely using Salesforce.  Do you think it still has a short possibility right now with the market powering forward?\n\nThere have to be some better plays right now.", "score": 2, "replies": []}, {"body": "I would not do this. SFDC has been crushing it, and I wouldn't compare them to the other companies you listed either.\n\nI am staying clear of this one, but I would buy calls if I had to choose. ", "score": 2, "replies": []}, {"body": "If you think Splunk and SalesForce are similar companies, then you're going to have a bad time.", "score": 4, "replies": [{"body": "Similar in the way that they are both operating in the same industry as cloud companies. For some reason the reaction to earnings this quarter has been negative to these types of companies. Also there is no doubt that it is a pretty high forecast despite not much changing from last quarter. ", "score": -3, "replies": [{"body": "I mean, Splunk is basically nothing more than a system log storage company that has a SaaS product with some additional bells and whistles. ", "score": 1, "replies": [{"body": "Their security offerings are supposed to be their strong suit", "score": -1, "replies": [{"body": "Thanks for playing.", "score": 0, "replies": []}]}]}]}]}, {"body": "I wouldnt sell puts, it may see a short loss on earnings but I don’t think it will have sustained long term losses.", "score": 1, "replies": []}, {"body": "That $SPLk drop is looking like a buying opp as would a $CRM drop.  I am probably selling it before earnings if I can tho. ", "score": 1, "replies": []}]}
{"title": "An EU commission is planning to ban plastic cutlery and straws. Looking for the right companies to Put for the crash. Any ideas?", "selftext": "", "id": "8msr9j", "created_utc": 1527536367.0, "score": 21, "upvote_ratio": 0.93, "num_comments": 17, "comments": [{"body": "Instead of shorting plastic companies you could long paper companies. Plastic will be replaced by paper packaging.", "score": 12, "replies": [{"body": "That’s not a bad thought, there are a whole bunch though, China I’m sure will be able to meet the demand, as there have been pushes towards bamboo and coated paper stuff for a while.", "score": 6, "replies": []}]}, {"body": "[deleted]", "score": 64, "replies": [{"body": "In EU, you get laid faster being PC than being rich. My theory.", "score": 29, "replies": [{"body": "It's just that the PC people that can't get any action, outnumber the people that actually do get some to such a degree that they actually have enough political power to outlaw things they see are getting other people laid, like making money, driving fast things, doing fun shit that makes you look cool. \n\nIf the activity might get someone laid, they are trying to ban it.\nIt's a fucking wonder they haven't made us all genderless by straight up outlawing having genitalia from both sexes yet. \n\nMy own country had Segways and Jetskies outlawed for several years ffs. ", "score": 7, "replies": [{"body": "What country? I want to make sure to avoid going there", "score": 6, "replies": [{"body": "Faggistan", "score": 7, "replies": []}]}]}]}]}, {"body": "Fuling Global Inc. (FORK)", "score": 7, "replies": [{"body": "I like where your heads at, but the US is its main customer. Looking for companies that are stuck in the EU for sales.", "score": 9, "replies": []}, {"body": "No options for it. I didn’t really look but under $5 I’m guessing this is a penny. Didn’t see the market cap though.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "no eu", "score": 6, "replies": []}]}, {"body": "deleted  ^^^^^^^^^^^^^^^^0.1668  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/70833)", "score": 3, "replies": [{"body": "Why would you care, you'll get your plastic cutlery back in a year or two when you finally get kicked out. ", "score": 5, "replies": [{"body": "Won't have the money to import it then...", "score": 1, "replies": []}]}, {"body": "eating fish and chips with your hands... like the boors you really are", "score": 1, "replies": []}]}, {"body": "BERY", "score": 2, "replies": []}, {"body": "Most plastic is getting sold to South America and Asia, so not too big an impact.", "score": 2, "replies": []}, {"body": "RPC Group took a beating today. ", "score": 1, "replies": []}]}
{"title": "Onset of the Musk Downfall, Short TSLA", "selftext": "", "id": "8mtpte", "created_utc": 1527544362.0, "score": 1, "upvote_ratio": 0.54, "num_comments": 10, "comments": [{"body": "Big Tiddy Goths \\> The Media", "score": 18, "replies": []}, {"body": "Are you kidding? Starting a war with journalists is going to generate billions in free advertising for him. \n\nAll in $TSLA", "score": 23, "replies": [{"body": "Does he need free advertising at this point?", "score": 3, "replies": [{"body": "surprisingly a handful of people have never heard of Elon or Tesla\n\n", "score": 2, "replies": [{"body": "You're right, those uncontacted indigenous tribes", "score": 1, "replies": [{"body": "AKA midwest America", "score": 1, "replies": []}]}]}]}]}, {"body": "I mean Trumps approval rating is going up....Elon's will now too with his erratic behavior people love that shit.", "score": 10, "replies": [{"body": "Not investors", "score": -2, "replies": []}]}, {"body": "Nothing falls anymore. Everything always goes up. Look at Venezuela", "score": 1, "replies": []}]}
