{"title": "Is It Time To Just Sell All Your Gold?", "selftext": "For those that follow me regularly, you will know that I have been tracking a set-up for the SPDR Gold Trust ETF (NYSEARCA:GLD), which I analyze as a proxy for the gold market. I also believe that gold can outperform the general equity market once we confirm a long-term break out has begun, and I still think we can see it in occur in 2018. This week, I will provide an update to GLD.\n\nWhile I have gone on record as to why I do not think GLD is a wise long-term investment hold, I still use it to track the market movements. For those that have not seen my webinar about why I don’t think the GLD is a wise long-term investment, feel free to review this link for my webinar on the matter:  https://www.elliottwavetrader.net/videos/201411131445.html\n\nNow, to answer the question I presented in the title to my article, I will simply say HECK NO! In fact, now is the time you want to be setting up your long positions, as we have a reasonably low-risk set up presented before us.\n\nOver a week ago, I wrote my most recent public article on GLD, wherein I presented my general perspective, which was outlined in much more detail to the members of my service, with specific charts:\n\n\"As long as the GLD remains below 126, I still see the potential for it to test the 122/123 region.\"\n\nThat support region was my ideal target for us to strike for the 5th wave of the c-wave of a 2nd wave that I believed we needed before the next rally began. But, when the GLD dropped down to around the 400% extension (around 122) in the 3rd wave of its 5th wave last week, it suggested that we will likely break below that 122 support level before this pullback completed. And, that is exactly what occurred overnight on Monday.\n\nEven when the GLD was hovering around the 125 region for several weeks, the apathy and indifference regarding gold within the overall market was quite palpable. Now that we have broken down below the 200DMA in gold, and have struck the lowest levels seen in the last six months, I am actually seeing posts of sincere hatred for the yellow metal. And, as always, such sentiment leads many analysts to again proclaim we are on our way below $1,000 in gold, which they back with many reasons and trend line breaks that support their perspective.\n\nAs an aside, those following trend lines in this market have been among the most whipsawed in the complex. This complex loves to break a trend line just before it reverses strongly in the opposite direction so as to shake out investors from the long side and leave the train station with the fewest on board as possible. And, we have seen it more times than I can count. Remember, trend lines and trend channels are the crudest form of linear analysis, which is not always helpful in a market that is clearly non-linear and overly emotional.\n\nAgain, I want to reiterate that am clearly not in the bearish camp. While I expected this pullback in the metal, as long as we remain over the 119 level I still believe this market is setting up in a strongly bullish pattern. You see, since the end of January, the GLD has been presenting us with an overlapping wave structure which is typical of a 2nd wave corrective pullback. Currently, we should be coming towards the end of the 5th wave in the c-wave of the a-b-c structure seen in a standard 2nd wave. And, it is quite typical to see sentiment turn deeply negative as that structure completes its downside corrective pattern.\n\nMoreover, as long as the 119 region is held as support, this pattern is pointing us towards the 145 region within a setup that suggests a strong move will likely take hold up towards that region. So, as I noted before, the market is presenting us with a low-risk bullish set up for those interested in the long side in the metals complex.\n\nDuring 2011-2015, I was taken to task by many who would read my articles as being too bearish. Yet, when we look back, it seems I was appropriately bearish. The members of my service then know just how uber-bullish I turned on this complex back towards the last part of 2015. In fact, we rolled out our EWT Miners Portfolio in September of 2015 because of the impending major bottom we correctly expected in the complex.\n\nThen, on December 30th, I issued a public advisory regarding my expectations in the complex:\n\n\"As we move into 2016, I believe there is a greater than 80% probability that we finally see a long term bottom formed in the metals and miners and the long term bull market resumes. Those that followed our advice in 2011, and moved out of this market for the correction we expected, are now moving back into this market as we approach the long term bottom. In 2011, before gold even topped, we set our ideal target for this correction in the $700-$1,000 region in gold. We are now reaching our ideal target region, and the pattern we have developed over the last 4 years is just about complete. . . For those interested in my advice, I would highly suggest you start moving back into this market with your long term money . . .\"\n\nAnd, interestingly, I am now being taken to task by a number of commenters to my public articles for supposedly being too bullish the complex. Isn’t it funny how sentiment works?\n\nYou see, I am neither perma-bull nor perma-bear in my market perspective. Rather, I strive to refrain from bias so that I may follow the objective clues that are presented before me by the market price action.\n\nSo, rather than being indifferent, apathetic or outright bearish due to the seemingly negative recent price action and overly bearish market sentiment being exhibited in the metals complex, I am here to tell those willing to listen that the market is now providing you with a low risk opportunity to climb aboard before a major break out may be seen in the coming months. You would simply be risking $3-4 dollars for the potential of over $20 in gains. Those are the types of risk/reward set ups you should be looking for in any market you follow.\n\nWhile I will never be able to tell you what a market will do with certainty, I can surely outline a low-risk set up. And, the GLD is presenting one to those willing to rise above the herd’s overly negative sentiment currently being displayed.", "id": "8lce1e", "created_utc": 1527014166.0, "score": 12, "upvote_ratio": 0.68, "num_comments": 15, "comments": [{"body": ">That support region was my ideal target for us to strike for the 5th wave of the c-wave of a 2nd wave that I believed we needed before the next rally began. But, when the GLD dropped down to around the 400% extension (around 122) in the 3rd wave of its 5th wave last week, it suggested that we will likely break below that 122 support level before this pullback completed. And, that is exactly what occurred overnight on Monday.\n\nk but what do the goat entrails say?\n\n", "score": 17, "replies": []}, {"body": "Do you have an analysis for the Silver?", "score": 5, "replies": [{"body": "Yes, will include silver in the next article on Thursday.", "score": 3, "replies": [{"body": "Remind me! 2 days", "score": 1, "replies": []}]}]}, {"body": "Commodity market are manipulated af", "score": 4, "replies": []}, {"body": "HODL GODL", "score": 4, "replies": []}, {"body": "Can someone make a TL;DR?", "score": 3, "replies": [{"body": "Gold went up, then down. Buy gold. Please buy as much as you can afford because I need to unload mine.", "score": 8, "replies": []}]}, {"body": "Well said. \n\nI sold all my gold and gold stocks when gold was 1800$ years ago and never looked back on them or on commodities in general but i agree the commodity trades are looking ready for a turnaround after years of underperformance. \n\nI think 1500$ gold is not out of the question. \n\nIn the small cap gold space i like semafo ($smf.ca) and in the juniors mawson resources ($maw.ca). I dont own either currently. \n\nGlta ", "score": 3, "replies": [{"body": "Gold 10k", "score": -1, "replies": []}]}, {"body": "I don't see how anyone can hold any resource commodity long. The history of almost all of them is decreasing price over time.  Gold and Silver have grown but mostly in rare spikes followed by years of loss.", "score": 2, "replies": []}, {"body": "I have zero plans to sell my gold and silver. Ever. I have it for extreme scenarios just in case. I consider it just a sunk cost at this point. my acquisition cost  is around $8,600 and my metals are currently worth about $7900. that represents about 2% of my net worth. I hope to be able to pass on all of it to my kids when I die. As for the rest of my worth, they can fuck off, i'm spending that shit on cruises and beer. \n\nI always just tell people Gold and silver isn't really an investment its more of an alternative insurance. You might get lucky and make good money on it as an investment but for me...it gives me a little piece of mind in case the dollar ever collapses or some other crazy shit happens. ", "score": 0, "replies": [{"body": "There is literally no real world scenario where gold and silver are useful.  Gold isn't even a good store of wealth anymore.\n\nLet the past die and these silly metals with it.", "score": 6, "replies": []}, {"body": "If dollar ever collapses, my bullets would be worth a lot more than gold.", "score": 7, "replies": [{"body": "Truth.", "score": 1, "replies": []}]}]}]}
{"title": "Aapl or Msft or V? advice pls?", "selftext": "Hi, I decided to invest 2k in either or all of these company, should i 33/33/33 or 50/50/0 or 100/0/0?\n\nAnd which one should I all in on? why? which one is more steady? which one is more safe?\n\nsorry I'm new, don't know how to analyze.\n\nEdit, I currently have no stocks holding nor experience. Just don't want my money sitting around and rust.", "id": "8l7gpl", "created_utc": 1526965562.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 12, "comments": [{"body": "all three stocks are excellent long term holds I own V and Msft. You can't go wrong with any of them.they are all a little bit high right now maybe if the market has a down day you could jump in or buy some shares now then wait and lower your cost average. ", "score": 3, "replies": []}, {"body": "I would split between AAPL and MSFT, then again, there are stocks I like better than either of them", "score": 3, "replies": [{"body": "Any suggestions better than them? Ty", "score": 1, "replies": [{"body": "If you are new young investors (myself included), you can make a more risky and growth oriented investment, and I recommend AMZN, NVDA, NFLX just be mindful that even though they are great growth stocks they are usually prone to more losses if the stock market goes bad or they can’t keep up their growth. That’s why you need to do some research and personally get to know the company before you put the money in.", "score": 2, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "Read through their financial statements balance sheets 10Ks and their SEC Files, some of them requires technical knowledge but a lot of them are also just simple English and numbers. ", "score": 2, "replies": [{"body": "As an auditor of large Corporations, private companies, and even large family owned businesses, my best advice is the old phrase that the devil is in the details. A lot of people looking to get into stocks or the the business world focus solely on the financial statements (Balance sheet, income statement, and statement of cash flows). However, the footnotes are extremely important and give the most insight into things like debt, lease obligations, large liabilities like pension, etc. Never ignore the footnotes!", "score": 2, "replies": []}, {"body": "Thank you", "score": 1, "replies": []}]}]}]}]}]}, {"body": "All three. ", "score": 2, "replies": [{"body": "How to split between tho and how long to hold?", "score": 1, "replies": [{"body": "You've got a lot to learn. However, I understand you are new. Anyways... the idea is to hold for many years from now, but that's all up to you.\n\nHow to split it? Hmm... I would say 40/40/20, with the 20% being Visa. Microsoft and Apple are larger and grow stronger, while Visa is a bit safer, but is an excellent addition to any portfolio. The reason I suggest 40% on Microsoft and Apple is because of their 1.72% and 1.56% dividends, respectively, as opposed to Visa's 0.64%.\n\nGood luck!!", "score": 2, "replies": [{"body": "Thank you vm ", "score": 2, "replies": []}]}]}]}, {"body": "MSFT and V. Personally I am bearish on AAPL. \n\nMSFT and V both had great last conference calls. V is my personal favorite. ", "score": 1, "replies": []}]}
{"title": "What should I diverse in besides 100% Tech", "selftext": "I am Tech heavy for investing 100&#37; in Tech in my portfolio. 45&#37; $MSFT, 45&#37; $AAPL, 10&#37; $V. Because I think tech have steady grow and have the biggest growth rate overall.\n\n1. What else would you guys suggest if I want to diverse my portfolio? Any examples?\n2. And Why do you think that the industry can compete with tech's growth rate?\n3. Should I invest in ETF like $VOO or $VTI so that i can At least keep some of my money safe?\n\nplease advice.", "id": "8ldl83", "created_utc": 1527022946.0, "score": 2, "upvote_ratio": 0.76, "num_comments": 18, "comments": [{"body": "Aerospace and defense\n\nBecause war and national security never ends.", "score": 4, "replies": [{"body": "But never ends doesn't mean it will grow right? since North Korea is chill now.", "score": 0, "replies": [{"body": "Was North Korea America's biggest concern? No. Have these stocks continued to grow? Yes.i bought  certain stocks on the north Korea peace dip and they rebounded immediately. Much like Facebook on their data leak. Which I also bought on discount.\n\n", "score": 3, "replies": [{"body": "carry me please senpai", "score": -3, "replies": [{"body": "Are you being sarcastic? I was just giving my opinion. Which you asked for.", "score": 1, "replies": []}]}]}, {"body": "Not all aerospace is defense.", "score": 2, "replies": [{"body": "And that's the fun part to invest in to me. Rockets and rockets parts! Next best thing to being able to buy some Space X, which by the way I'm glad has stayed private. ", "score": 1, "replies": []}]}, {"body": "There will always be a threat. Right now it is north korea. Five years from now it will be another country or probably still North Korea. I would definitely short \"world peace\" \nBreaking News guys : North Korea is \"chill\" now, we are going out for some drink later on tonight.", "score": 1, "replies": []}]}, {"body": "Is the irony of your username and your stock recommendation entirely lost on you?\n\nMilitary spending is entirely dependent on government spending. Let’s say, hypothetically speaking, Democrats take one or both houses of Congress. Do you think military spending will go up or down?", "score": -2, "replies": [{"body": "The military industrial complex will never die. If Dems are in power, do you realistically think they will cut off military spending? Cut off money that goes to Lockhead Martin, Boeing,  Raytheon, etc? Obama was in power for 8 yrs and those companies didn't exactly went bankrupt.\n\nThose companies have lobbying power. They also build their plants around the country where the employees will make their opinion be heard. \n\nWhat good for a few is not necessarily good for the many. What is good for the many is not necessarily good for the few.", "score": 2, "replies": [{"body": "I wish you didn’t create a straw man argument. My point is “military spending is a function of government spending. If Democrats are in power, less money will be spent on defense.” This is [easily verifiable](https://en.m.wikipedia.org/wiki/Military_budget_of_the_United_States). Look at the percent changes in budget.\n\nYou used emotionally charged words like “bankrupt”, “cut off”, and “die”. I just said less spending, which is a factual statement based on historical outcomes.", "score": 1, "replies": [{"body": "Yes the aerospace and defense stocks did horrible under Obama *eye roll*\n\nYou still haven't suggest anything", "score": 0, "replies": []}]}]}, {"body": "How about you recommend a stock for this person to diversify his 100 percent tech portfolio with?\n\nMy username is a joke to trigger people and has nothing to do with my recommendation. ", "score": 2, "replies": []}]}]}, {"body": "The easy answer is index funds.\n\nIf you’re sensibly worried about an economic downturn you’re looking for goods with inelastic demand. Utilities, pharma, and hospitals. But maybe not medical device manufacturers.\n\nYou can combine my two bits of advice and get focused ETFs like $XLU or $IHF.", "score": 2, "replies": []}, {"body": "Biotech is another rapidly growing area. Use ETFs like XBI or IBB, individual stock picking in this sector is suicide unless you're an expert.", "score": 2, "replies": []}, {"body": "1. Yes, other industries- energy, industrials, consumer staples, etc.\n\n2. Finance is probably a good one to look at, as well as consumer staples and energy, all which increase as tech and population increases.\n\n3. Yes, please don't put 100% of your portfolio in 3 individual stocks, you are going to have a heart attack at the next tech dowturn. Even putting in VGT is safer than individual tech stocks, especially the biggest names which already have probably a higher P/E based on people knowing their names. VGT, VWO to get some stuff outside of the US, VTI or VT, VOO, etc. are all good options to be more diversified and less reliant on the very specific industry you invested in which is basically 90% computer/phone/tablet tech, which is going to obviously keep growing but might have passed its main growth spurt in the US as the phones are not getting smaller and the more recent phones coming out are not looking that much more advanced than the ones from the past few years. ", "score": 2, "replies": []}, {"body": " industrial etf FIDU or XLI. ", "score": 1, "replies": []}, {"body": "Index funds are great and safe for long term play. You could invest some into pharma like JNJ. T is pretty good price right now was bit lower for while now it pays solid dividend.", "score": 1, "replies": []}]}
{"title": "What's with the slow decline of $WMT", "selftext": "The slow and steady sell off. It's trading below the earnings run-up now. \n\nI don't see any news? Is it time to buy calls?", "id": "8lbve7", "created_utc": 1527010513.0, "score": 2, "upvote_ratio": 0.6, "num_comments": 18, "comments": [{"body": "Hope that dude here with 450k worth of calls makes it. Other than that, Walmart is Target pretending to be Amazon for people with a BMI above 30 and they can go to hell for all I care.\n\nThey will never catch up in ecommerce with Amazon for the same reason people who shop at Whole Foods will never suddenly switch to Aldi.", "score": 21, "replies": [{"body": "That...is surprising accurate", "score": 5, "replies": []}, {"body": "To be fair, they could take market share even if people won't switch for the bulk of their online shopping.  Taking a quick look, household items like toilet paper, soap, etcetera, are all a fair bit cheaper from WMT than AMZN.  Amazon doesn't even give me free two day with my Prime sub because of where I live, but Walmart does.  Again, not saying they will beat out Amazon or anything, but competition is good. Amazon has gone uncontested for quite a while and it now it seems Walmart is beating them in a couple areas, like shitter essentials.", "score": 3, "replies": [{"body": "Where do you live? \nDoesn’t Amazon prime go to AK?\nI’m overseas using an APO and prime is awesome.", "score": 2, "replies": [{"body": "It goes to AK, but we're stuck with 3-5 day shipping.  They used to do 2-day for us, but they stopped it a couple years back now if memory serves.", "score": 1, "replies": [{"body": "Even in AK, that’s still a good deal, imo. \nUsed to live in AK. Shits expensive.", "score": 1, "replies": []}]}]}]}]}, {"body": "Unless you talking about $MU, we don’t wanna hear it. F-A-G", "score": 22, "replies": []}, {"body": "As someone who doesn't give a fuck about WMT, but saw a headline one time. I believe it's because they purchased some shitty company and shareholders aren't happy about it. Was it FlipKart maybe?", "score": 10, "replies": [{"body": "Ya acquisitions and reinvesting earnings into growth are only good things when its GOOG, MU, or AMZN doing it.", "score": 5, "replies": []}]}, {"body": "Maybe, my $85 strike are bleeding from the butt. Shit really doesnt trade in an exciting fashion between earnings tho so maybe lower? ", "score": 4, "replies": []}, {"body": "No idea but I keep averaging down. No clue where the bottom is.\n\nOwner of 6/15 84.5 Calls..\n\nFeels bad man", "score": 3, "replies": [{"body": "87.5 calls. 2000 calls @0.37. Bought at 1.8ish. ", "score": 4, "replies": [{"body": "In this together broski", "score": 1, "replies": []}]}]}, {"body": "My JNJ is suffering from the same fate. It's only like 4% of my portfolio, but it's been down around 15% from all time highs. I think consumer staples in general are not doing so hot right now.", "score": 2, "replies": []}, {"body": "I sold all my WMT shares today, just in case i need the cash to buy MU dip.", "score": 2, "replies": []}, {"body": "Amazon", "score": 1, "replies": []}, {"body": "AMZN", "score": 1, "replies": []}, {"body": "I have a 6/1 $85.5 call on $WMT. No reason for Walmart not to do better in the coming weeks. ", "score": 0, "replies": []}]}
{"title": "New $TSLA dd, no wonder $F has lower market cap", "selftext": "", "id": "8lc6iv", "created_utc": 1527012659.0, "score": 8, "upvote_ratio": 0.73, "num_comments": 11, "comments": [{"body": "Can't he tweet something a little better? I have 13k worth of Tesla calls expiring this week.", "score": 14, "replies": [{"body": "In a follow-up tweet, he noted that the \"Easter eggs\" will be actual solid gold eggs hidden in the dash. \n\nBut they are only accessible if your crash your whip and it bursts into flames.  ", "score": 9, "replies": [{"body": "Will they emerge as dragons?", "score": 5, "replies": [{"body": "Can you... Imagine... Dragons...\n\nI'm sorry. Down vote me if you must.", "score": -13, "replies": []}]}]}, {"body": "God damn, worst thing in my portfolio. I have September 330 calls that are down. Once I break even or just hit half done with TSLA calls. Shit is scaring me now. It used to have high swings before but now it seems to be extremely bearish.", "score": 1, "replies": []}]}, {"body": "How about a game where you drive a vehicle on a road and try not to crash while obeying the rules of the game.", "score": 25, "replies": []}, {"body": "How about a 1 touch all in $MU button. ", "score": 6, "replies": []}, {"body": "Is the game which part of the car will catch fire first?", "score": 4, "replies": []}, {"body": "I already tweeted at him \"How about you worry about producing more than 2,500 cars a week before your company collapses\"\n\nEveryone go do the same", "score": 7, "replies": []}, {"body": "already implemented. \n\nFirst fun game, which button unlocks the doors.", "score": 3, "replies": []}, {"body": "Blatant pump and dump going on here, someone call homeland security or some shit", "score": 0, "replies": []}]}
{"title": "Goddammit AMD why won’t you die", "selftext": "", "id": "8lcahu", "created_utc": 1527013458.0, "score": 2, "upvote_ratio": 1.0, "num_comments": 13, "comments": [{"body": "Something something past results doesn't indicate future results.", "score": 8, "replies": [{"body": "My past losses 100% predict my future losses though", "score": 2, "replies": []}]}, {"body": "Because you have puts", "score": 3, "replies": []}, {"body": "Try buying calls", "score": 3, "replies": []}, {"body": "Also have puts ", "score": 3, "replies": []}, {"body": "AMDEEEEEEEEEEZ NUTS!!!!!", "score": 2, "replies": []}, {"body": "lol been a solid 45 degree curve up since 10:30", "score": 2, "replies": []}, {"body": "We dont care about your $188 positions", "score": 2, "replies": [{"body": "he's trying to squeeze out $20 in the next week or so", "score": 2, "replies": []}, {"body": "You know what, yeah, I don’t have much. But I’m trying really hard to learn with what I do have, to do better and to start building on gains. Most people wouldn’t have the balls to drop $188 on options contracts when they only have $1,000 in their shitty little account. ", "score": 1, "replies": [{"body": "ok cool good for you. We dont need a entire post dedicated to your $188 position. ", "score": 2, "replies": []}]}]}, {"body": "rip", "score": 2, "replies": []}]}
{"title": "Let's start a WSB ETF", "selftext": "Consists of SQ, MU, NVDA, AMD, AMAT, BABA, FB, AMZN", "id": "8lchym", "created_utc": 1527014944.0, "score": 18, "upvote_ratio": 0.82, "num_comments": 18, "comments": [{"body": "$RTRD already exists", "score": 47, "replies": [{"body": "What happened to it's returns? There used to be weekly updates.", "score": 3, "replies": []}]}, {"body": "I've already said this here before. I want to create a leveraged ETF of leveraged ETFs. 3x x 3x x 3x = 27x ETF. Price moves 27% for each 1% of the underlying ETF. ", "score": 19, "replies": [{"body": "CFDs bro. 20-300x leverage comes as standard.", "score": 3, "replies": []}]}, {"body": "“Our goal is to print tendies”", "score": 15, "replies": []}, {"body": "Already been done my dude", "score": 8, "replies": [{"body": "I want 20,000 shares... Free... Pls", "score": -2, "replies": []}]}, {"body": "Don’t forget Elon Daddy, $TSLA. ", "score": 10, "replies": []}, {"body": "Signs of the top", "score": 3, "replies": []}, {"body": "WSB ETF will be TQQQ ,SOXL and FNGU. Best portfolio ever.", "score": 3, "replies": []}, {"body": "You forgot 10x leverage ", "score": 6, "replies": [{"body": "Ohh sheyat!!! This thing gonna swing!!!", "score": 1, "replies": []}]}, {"body": "add netflix in there", "score": 2, "replies": []}, {"body": "I’d buy it, but only if you triple leverage that shit.", "score": 2, "replies": []}, {"body": "No JNUG?  You're a fucking disgrace.", "score": 1, "replies": []}]}
{"title": "Beaten down swing trades?????", "selftext": "you faggolios know of some shit thats been beat down by a dickslap from wall street. Preferable shit that will rocket in a month or two? \nJD?\nWMT?\nAMAT?", "id": "8lcvai", "created_utc": 1527017629.0, "score": 2, "upvote_ratio": 0.75, "num_comments": 19, "comments": [{"body": "how hard is it to understand two fucking letters.\n\nMU.\n\nDone. Stop lollygagging in other stocks and just fucking hit buy you uncultured fuck.", "score": 20, "replies": [{"body": "ride to the highs dont buy at them", "score": 7, "replies": []}]}, {"body": "Yes, and you can gain access by subscribing to my newsletter.\n\nWe have an 85% hit rate.", "score": 8, "replies": [{"body": "subscribed", "score": 3, "replies": [{"body": "It's just a monthly newsletter talking about giving blowjob's", "score": 3, "replies": [{"body": "The newsletter is quarterly since the market isn't all that volatile, but the blowjobs are daily", "score": 1, "replies": []}]}]}]}, {"body": "Bidu ", "score": 1, "replies": [{"body": "The last two times it bottomed this year were closer to the 220-230 area though. ", "score": 1, "replies": [{"body": "Rip I have 240 calls am I fucked ", "score": 1, "replies": [{"body": "When do they expire? Should be fine if past this week, who knows what will happen tomorrow with trump trade talks etc.", "score": 2, "replies": [{"body": "Most of them mid June ", "score": 1, "replies": [{"body": "I’d be surprised if it wasn’t 240 plus sometime between now and then unless some crazy stuff happens with the US and China.", "score": 1, "replies": []}]}]}, {"body": "Ya your fucked , there's about another 10 pts of downside. $220-230 is when buyers showed up last time...don't see them showing up right now if china trade shit is keeping folks sidelines. ", "score": 1, "replies": [{"body": "Ya exactly, that’s my price range  for entering.", "score": 1, "replies": []}]}]}]}, {"body": "I was looking at it but I like to wait for knives to fall a bit before i cut off my hand catching them", "score": 1, "replies": []}]}, {"body": "Weibo. I just sold my calls at a loss, so it should moon now", "score": 1, "replies": [{"body": "hmmm might pick some up then", "score": 1, "replies": []}]}, {"body": "There jd if u like scrapping from the bottom of dumpsterfires ", "score": 1, "replies": []}]}
{"title": "Green Day tomorrow even with Trump trade talk?", "selftext": "Will the bull market continue!? Discuss fags", "id": "8lcxz2", "created_utc": 1527018171.0, "score": 4, "upvote_ratio": 0.65, "num_comments": 14, "comments": [{"body": "my SPY calls are down biggy today. Hopefully it'll be up tomorrow.", "score": 10, "replies": [{"body": "Same couldn’t top out today with the day trading limit for cleared funds... \n\nWent from 8k down to 5k right now god damn day trading regulations... hopefully it’ll pick back up atleast some tomorrow as my one call expires.\n\nPlease father Buffett make this work for us", "score": 2, "replies": [{"body": "I hate those fucking rules. I had to stay bent over so taht BIDU fucks me in the ass cuz i have 3 sales already. ", "score": 2, "replies": []}]}]}, {"body": "biggest up day ever, get your calls now", "score": 9, "replies": [{"body": "i am currently selling aftermarket spy calls. how many would you like?", "score": 2, "replies": []}, {"body": "Don't jinx it furboi", "score": 1, "replies": [{"body": "SPY to the Mooooon tomorrow!", "score": 2, "replies": []}]}]}, {"body": "My retarded calls don't feel like it's a bull market.", "score": 6, "replies": []}, {"body": "I expect red.  Fed minutes come out in the afternoon.  Powell speaks Friday.  I am watching for buyable pullback now into June. ", "score": 2, "replies": [{"body": "Me too... really hoping you’re wrong and there’s atleast alittle rally in the morning ", "score": 3, "replies": [{"body": "I am thinking there is a drop at the open that I am going to daytrade and buy but not hold into Fed minutes.   GL. ", "score": 3, "replies": []}]}]}, {"body": "oh god I sure hope so. I can't afford another red day", "score": 1, "replies": [{"body": "Me too [FDs](https://imgur.com/a/v2yyUHX) ", "score": 1, "replies": []}]}, {"body": "Thinking about long term spy puts .. ", "score": 1, "replies": []}]}
{"title": "Go all in on Bull plays until the bubble pops again?", "selftext": "https://finance.yahoo.com/news/trump-set-sign-bill-easing-214712402.html\n\nThey're getting rid of the rules again. Is it time to go all in on bull spy calls in the 6-12 month out range?", "id": "8ldzoq", "created_utc": 1527026123.0, "score": 14, "upvote_ratio": 0.9, "num_comments": 18, "comments": [{"body": "Are they just stalling this next recession to stuff their pockets as fat as they can now?", "score": 24, "replies": [{"body": "Im not certain, but if they are im gonna try to get some table scraps while i can", "score": 17, "replies": [{"body": "this guy $woofs", "score": 10, "replies": []}]}, {"body": "yes and theyve trained the good goy to purchase his weekly etfs", "score": 2, "replies": []}]}, {"body": "This isn’t s big deal - doesn’t make the regs disappear altogether. \n\nBasically there was some cap in place where if a bank is bigger than $50B it would get additional oversight, meaning banks near the cap had less of an incentive to grow through acquisitions. \n\nThey’re raising the cap to $250B so we may see some consolidation as those banks that were near the old cap can now grow without getting additional regulatory scrutiny.", "score": 11, "replies": [{"body": "This needs to be higher", "score": 2, "replies": []}]}, {"body": "I have some idea, but could someone less retarded than me explain the potential significance of this?", "score": 5, "replies": [{"body": "[deleted]", "score": 20, "replies": [{"body": "Only affects the smaller/medium sized banks. JPM WFC BAC just got more competition.", "score": 3, "replies": [{"body": "The people that can't pay back their loans get their loans from small banking institutions ....", "score": -1, "replies": [{"body": "You saying the big boys didn't participate in predatory loans and didnt have massive amounts of defaults? Lmao thats where you're wrong kiddo.", "score": 2, "replies": [{"body": "Hell, they insure themselves against that shit because they know they shouldn't be lending the money. And to top it off they, *convinced* the Feds to mandate that the responsible mortgage applicants pay for their fucking premiums. Christ, I forget how fucked we get as consumers sometimes. ", "score": 3, "replies": []}]}]}]}, {"body": "Pop", "score": 2, "replies": []}]}]}, {"body": "itm XLF calls?", "score": 3, "replies": []}, {"body": "Hmm, futures didn't react to it. There's little uncertainty regarding whether Trump will sign it. I kinda think that it's\n\nP R I C E D I N\n\nR\n\nI\n\nC\n\nE\n\nD\n\nI\n\nN", "score": 3, "replies": [{"body": "Q U A N T I T A T I V E  * E A S I N G\n\nU\n\nA\n\nN\n\nT\n\nI\n\nT\n\nA\n\nT\n\nI\n\nV\n\nE\n\n\nE\n\nA\n\nS\n\nI\n\nN\n\nG  ", "score": 2, "replies": [{"body": "F A G G O T S\n\nA\n\nG\n\nG\n\nO\n\nT\n\nS", "score": 7, "replies": []}]}]}, {"body": "XLF more about interest rates than this no? ", "score": 1, "replies": []}]}
{"title": "AMD Put it in that ass", "selftext": "", "id": "8le3si", "created_utc": 1527027016.0, "score": 3, "upvote_ratio": 0.71, "num_comments": 12, "comments": [{"body": "You’re poor.", "score": 7, "replies": [{"body": "I love poor people", "score": 2, "replies": []}, {"body": " Bout to be a whole lot poorer too.", "score": 2, "replies": []}, {"body": "Shut up.  My finances are none of your concern.", "score": -2, "replies": [{"body": "> My finances are none of your concern.\n\nSo why did you post about them?", "score": 2, "replies": []}, {"body": "Yeah /u/derekv4 stop being a little bitch. Just cause he's poor doesn't mean you have to call him out on it. ", "score": 3, "replies": []}]}]}, {"body": "I also bought AMD 12.50 puts, but mine are FDs for this Friday. B)", "score": 3, "replies": [{"body": "What is FDs?", "score": 1, "replies": [{"body": "Fancy dongers ", "score": 2, "replies": []}, {"body": "Financial Derby ", "score": 2, "replies": []}, {"body": "Finger Dildos", "score": 2, "replies": []}, {"body": "Financially Draining", "score": 1, "replies": []}]}]}]}
