{"title": "Suggestions for My Portfolio?", "selftext": "Hello!\n\nI'm relatively new to the stock market and I was just wondering if you guys had any suggestions for my portfolio. Any companies worth looking into? \n\n(edit) A little about me: I'm 24 going into medical school this summer. I've been using the past 6 months to learn as much about investing before I get crammed in my room studying all day :P\n\nTotal balance:$3500 \n\n25% BABA\n\n21% BOTZ\n\n9% FB\n\n22% NVDA\n\n23% VOO  \n", "id": "8gs1yp", "created_utc": 1525367935.0, "score": 2, "upvote_ratio": 0.67, "num_comments": 15, "comments": [{"body": "Not enough info.  Your age, account balance, investment objectives, purpose of these investments, etc. will be needed to give you any reasonably valuable suggestions . . .\n\nFirst glance you seem heavy in tech, but this may be the right thing based on what you're trying to do.", "score": 2, "replies": [{"body": "Ah I see.\n\nI'm 24 going into medical school this summer. I've been using the past 6 months to learn as much about investing before I get crammed in my room studying all day :P\n\nMy objective really is to learn to be a smart investor!", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Oh interesting. I'll look into those! ", "score": 1, "replies": [{"body": "PEP and JNJ both are a bit off 52 week highs, have nice dividends, and are in different sectors.", "score": 1, "replies": []}]}]}, {"body": "Honestly, with only $3500 I'd just buy VOO and let that grow. But if you want to buy single names, I like what you own but it's concentrated and will probably get creamed if we enter a bear market. I'd add one good stock from different sectors and go from there. ", "score": 2, "replies": []}, {"body": "You're majority tech and have a very concentrated portfolio that's going to get obliterated in a downturn. There are innovations occurring outside technology; look into healthcare, look into even a little bit of more stable/consistent companies. I don't like having more than 10% in a particular name - I'm not saying that you have to be massively diversified by any means, but I also really dislike being entirely reliant upon one sector or a name or two.", "score": 2, "replies": [{"body": "Yea I do agree that I am way too concentrated in my portfolio. I'm looking to sell my BOTZ ETF's as soon as I make even and allocate it to a non-tech company\n\nWhich healthcare-related companies do you recommend me looking into?", "score": 1, "replies": [{"body": "TMO, ILMN, BDX, EW, DHR, ZTS, IDXX, ABCZY, SYK, A, ABBV, etc. Most of these are life science/medical devices/med supplies (or in the case of IDXX/ZTS pet health), but I do like those areas more than pharma/biotech.", "score": 1, "replies": []}]}, {"body": "Hey, dvdmovie1, just a quick heads-up:  \n**occuring** is actually spelled **occurring**. You can remember it by **two cs, two rs**.  \nHave a nice day!\n\n^^^^The ^^^^parent ^^^^commenter ^^^^can ^^^^reply ^^^^with ^^^^'delete' ^^^^to ^^^^delete ^^^^this ^^^^comment.", "score": 2, "replies": []}]}, {"body": "Why not at some cannabis stock?", "score": 1, "replies": [{"body": "Hmm never considered it. Any specific ones you would recommend me looking into?", "score": 3, "replies": [{"body": "If you're going to get into cannabis, understand the risks and market forces behind it in terms of things like oversupply. I do think that it's an interesting theme worth getting some exposure to, but people are too much of the thought that legal = to the moon, which isn't necessarily the case, or at the very least there's more complexity to it than that.\n\nKeep in mind too that there's things like Constellation Brands (STZ), which owns 10% of Canopy. While obviously not a pure play, Constellation's a great company that gets you a bit of exposure. Or there's the ETFs. Again though, I do think that weed is a worthwhile theme to have exposure to but wouldn't go overboard on weed - too many people (not all, yes I know) have in these subs and many have gotten obliterated in recent months. The MJ etf is about 20% off January highs.", "score": 1, "replies": []}, {"body": "Look how Canntrust did today!", "score": 1, "replies": []}, {"body": "The top three, tgod had an IPO today. And I would say Canntrust is a safe bet. They sell medicinal mj for years have 50,000 current patients, hooked up with apotex and almost done there second. Much larger facility. ", "score": 1, "replies": []}]}]}, {"body": "Get some cryptocurrency in there.", "score": 1, "replies": []}]}
{"title": "What kind of bear is best?", "selftext": "[deleted]", "id": "8gmkxw", "created_utc": 1525310075.0, "score": 12, "upvote_ratio": 0.93, "num_comments": 11, "comments": [{"body": "Gay bears ofc", "score": 16, "replies": []}, {"body": "how can u tell the value of ur options after hours? robinhood doesnt update. ", "score": 4, "replies": [{"body": "Math \n", "score": 11, "replies": []}]}, {"body": "Chicago ", "score": 3, "replies": []}, {"body": "Its going to test $250 today.  Then Musk will tweet that he had a prescription mixup and it will vault back to 300. \n\nHold until 10:30 am, 12:30 at the latest.   The market seems to be the most open in the morning. ", "score": 1, "replies": []}, {"body": "How are your Puts so low I got 302.5 at 13 they’re 22 now ", "score": 1, "replies": [{"body": "I bought it when TSLA spiked to 305 today", "score": 1, "replies": [{"body": "Those puts should be like $20 right now", "score": 2, "replies": [{"body": "The thing is, TSLA is the kind of stock that could plummet lower, especially when they have that kind of earnings call", "score": 2, "replies": [{"body": "Holy shit it was bad. Loved every minute.", "score": 5, "replies": []}]}]}]}]}, {"body": "I wouldn’t be surprised if this opens at 300+. That’s the kind of autistic shit his investor base likes. ", "score": 1, "replies": []}]}
{"title": "Elon hates short sellers, because short sellers are piece of shits.", "selftext": "So Elon is going to call up Trump and tell Trump. Yo dawg... I know its been a while but what you said was right. Short sellers are piece of shits. This shit is not right dawg! You and me both know Tesla is a great ass company with a lot of room to grow. These short sellers though. They just want to destroy. I heard short sellers eat their own shit. They love it. Trump.... We have to make short selling illegal. ", "id": "8gndbu", "created_utc": 1525317779.0, "score": 0, "upvote_ratio": 0.39, "num_comments": 11, "comments": [{"body": "Sometimes it’s best to just keep thoughts on the inside. ", "score": 32, "replies": [{"body": "Hard to do when you like the taste of beer. Honestly, I think beer should be 1.7 percent alcohol per volume. Beer and wine are both made way too strong now days. You should be able to buy beer, drinking non-stop for half the day and then not have a hang over from it the next day. Beer should slowly build you up. Not slowly break your body down.", "score": -6, "replies": [{"body": "First part sounds super gay but I could get on board with drinking all day with no hangover. ", "score": 7, "replies": [{"body": "Alcohol is a damn poison lol and I feel like its gets stronger as we age. Weaker alcoholic beverages is what we need. The thing about beer is that its not about how much you drink. The rule of alcohol is that once you stop drinking, you will immediately feel worse. Thats why I can see having a beverage made for this sole reason. Low enough alcohol content to not do damage to the body and low enough that you can drink it all day long.", "score": 1, "replies": [{"body": "If you alternate between 1 cup of beer and 1 cup of water you can go through the entire day.  Your headache is just a lack of water, or so I've heard.", "score": 2, "replies": [{"body": "The headache... yeah, but the lack of energy the next day is real too. ", "score": 1, "replies": [{"body": "Immediately start drinking the next day. Repeat day after day. Where is the problem?", "score": 4, "replies": []}]}]}]}]}]}]}, {"body": "*Great ass-company\n\nFTFY", "score": 3, "replies": []}, {"body": "move to china then", "score": 2, "replies": []}]}
{"title": "My only profitable trade. Close it?", "selftext": "So over the past few weeks I've made some horrible options decisions.  Now my wife is pissed, and I'm breaking out with acne on my face and back from stress.  The one good decision I made was buying AMD Jan 2019 $10 strike leaps a few months ago.  That turned out well after earnings.  They are up a good amount, and I'm trying to decide if I should close them.  I want to know if WSB thinks I should take the profits and run, or ride it out a little longer.  Normally I'd ride it out, but riding it out has cost me considerably on SQ and MTCH.  ", "id": "8gndke", "created_utc": 1525317837.0, "score": 6, "upvote_ratio": 0.88, "num_comments": 15, "comments": [{"body": "Go on Craigslist and suck a man’s dick for $100. \n\nRepeat until you’re back itm. ", "score": 21, "replies": [{"body": "^This guy YOLOs", "score": 6, "replies": []}]}, {"body": "What’s your +/-? Are you up overall, or just bleeding less? NUMBERS, BOYEEEEEE", "score": 4, "replies": [{"body": "I'm up about 40% on AMD.  I'm down overall, so much so that I don't want to know the percentage overall. I'll just ignore it.  I'm holding these AMD calls, some V calls that are up a tiny bit, SQ calls that are shit, MTCH calls that are shit, BAC calls that are shit, and MU calls that are shit.  Yes I realize I need to learn about puts, but as the market keeps going down I just think discount. ", "score": 9, "replies": [{"body": "Cash out. Tell your wife how you’ve learned your lesson. Buy her some tendies, buy yourself a burner phone and trade on that. Sneak out of the house late at night and watch investment news at your sportsbar. Choke yourself with a belt in a motel 8 whilst watching bear market tickers.\n\nBut don’t bring that home, man. You’ll get acne and shit. It’ll mess you up. ", "score": 27, "replies": [{"body": "Don't skip the choking yourself part. You should see Buffet's neck...", "score": 3, "replies": []}]}, {"body": "whens your exp for SQ, MTCH, and BAC? and how much youre down on each?", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Hold out until $0.01 next week.", "score": 1, "replies": []}, {"body": "i would hold\n\nit seems like the spy wants to retouch the 200 dma and then bounce back up\n\ni donno, i mostly hold jan 19 calls (MTCH and LMT) at this point\n\nthis shit has to end at some point. im either gonna 6x or 0x", "score": 1, "replies": []}]}]}]}]}, {"body": "I think you need a different agreement upfront with your wife and it sounds like you have money invested that you can’t *afford* to lose. I started fucking around with RH with about $5K. I told my wife, look this could go either way — but I feel like the only way I’m going to learn how the market works is by trying. If I lose it, oh well — maybe time for a different hobby. It’s a non issue. I told her I lost $800 betting against Apple and she laughed at me. So just be more straightforward about risk / reward / goals. Or try anal", "score": 3, "replies": []}, {"body": "I think AMD can go to 12, and you do have time. But this is a negative market right now and you won't be hurting for other opportunities.\n\nSell half?", "score": 1, "replies": []}, {"body": "News just came out that Intel has another 8 security flaws (that so far) appear to be unique to them and not affecting AMD. Its only in the German press right now but if that's confirmed AMD should pop to 12. So I would wait a few days on selling those AMD calls.", "score": 1, "replies": []}, {"body": "I also like to sell my winners until my portfolio is full of nothing but losers. ¯\\\\\\_(ツ)_/¯      \n       \nEdit: downvoted for paraphrasing Shkreli. What has this sub even become?", "score": -2, "replies": [{"body": "I like to hold my winners long enough that they can turn into losers like the others. ", "score": 3, "replies": []}]}]}
{"title": "General Mills is Amazon's latest victim", "selftext": "General Mills issues $6 billion in Bonds to buy Blue Buffalo. Amazon responds buy introducing its newest brand: Wag. First offering is pet food.\n\nShort everything that isn't Amazon. All hail Lord Bezos.", "id": "8gnop5", "created_utc": 1525321186.0, "score": 4, "upvote_ratio": 0.75, "num_comments": 10, "comments": [{"body": "General Mills has been trash since before 3G/Heinz talked about acquiring them.", "score": 5, "replies": [{"body": "No argument here.", "score": 3, "replies": []}]}, {"body": "Once Bezos kicks the bucket, Amazon will become the next GE.", "score": 3, "replies": [{"body": "Bezos is immortal tho", "score": 4, "replies": [{"body": "No wonder Amazon, Berkshire, and JPM is doing that medical partnership.  They're working on an immortality thing for Bezos, Buffet, and Dimon.", "score": 4, "replies": []}]}, {"body": "Bezos is about to transcend and become the immortal chosen one.", "score": 3, "replies": []}]}, {"body": "Lord Bezos please fight Facebook", "score": 2, "replies": []}, {"body": "Amazon can burn in hell.", "score": -1, "replies": [{"body": "I have it on good authority that Amazon is actually looking to acquire hell.", "score": 17, "replies": [{"body": "HQ2? ", "score": 2, "replies": []}]}]}]}
{"title": "TSLA VS SPY: THE RACE TO $250", "selftext": "", "id": "8gqf0n", "created_utc": 1525354611.0, "score": 253, "upvote_ratio": 0.96, "num_comments": 19, "comments": [{"body": "I will get so hard if spy hits 250, got 5/07 270P up 50% right now", "score": 44, "replies": [{"body": "Seems like we are setting up to finally break through the 200 day. Hopefully it happens.", "score": 8, "replies": [{"body": "I'm bad at this. Why would that be good?", "score": 2, "replies": [{"body": "Easy money.", "score": 5, "replies": [{"body": "Ahhhh gotcha ", "score": 1, "replies": []}]}, {"body": "Puts make money when the stock price goes down, since puts allow you to sell at the strike price. So if put has strike of $50 and stock goes from say $55 to $45, would you rather sell your stock at $50 a share (put option strike) or $45 a share (current stock price)?", "score": 3, "replies": []}]}]}, {"body": "Same, except mine is for 16 May.", "score": 2, "replies": []}]}, {"body": "AMD will get there first ^^I ^^hope ", "score": 21, "replies": [{"body": "[Oh you poor thing](http://i.imgur.com/3F9gZuB.gifv)", "score": 8, "replies": [{"body": "I hope not...my covered calls max out my profit at $11", "score": 1, "replies": []}]}]}, {"body": "Whats Spy?", "score": 11, "replies": [{"body": "Spy is an etf that tracks he S&P500. ", "score": 9, "replies": []}]}, {"body": "China is gonna fold tomorrow, zero wage growth, SPY to 280. ", "score": 4, "replies": []}, {"body": "waiting till June 15th options expire worthless before expecting another -5% move", "score": 2, "replies": []}, {"body": "https://www.youtube.com/watch?v=vlz6qgahnYQ", "score": 1, "replies": []}, {"body": "holy shit i'm dead", "score": 1, "replies": []}, {"body": "can aapl join in?", "score": -1, "replies": []}]}
{"title": "Will $AAPL Apple go below $175 today? Stay-tuned. Whose got those puts. Lets see if the market isn't rigged and allows those to make money today.", "selftext": "", "id": "8gqoww", "created_utc": 1525356999.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 9, "comments": [{"body": "Downvote all conspiracy posts. Report all conspiracy posters", "score": 5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Make him post a selfie i wanna see if he looks like what i think he looks like", "score": 1, "replies": []}]}]}, {"body": "If it does then maybe you can admit that theory is completely out to lunch. We'll see though, this market looks pretty dead without any sort of catalyst to propel it. Q2 ER over, continue the bleedout. ", "score": 2, "replies": [{"body": "I did it more for the gap up fade play to $172. I would be pleased if it gets near there. ", "score": 1, "replies": []}, {"body": "Go ahead and buy the puts on Apple then easy money right?\n\nThe whole market will fall but will Apple drop below $175...?hmmm?", "score": 0, "replies": [{"body": "I don't think the whole market will fail. We'll probably see a selloff below the 200 sma followed by an afternoon rally for the ages to put us back above it. ", "score": 3, "replies": [{"body": "I will PM you.. something special...", "score": 1, "replies": []}]}]}]}, {"body": "I just sold my 167.5 5/25s . Now wishing i kept some to keep it running. Goodbye free money", "score": 2, "replies": []}, {"body": "Got some 5/17 171 puts. Praying for us both", "score": 1, "replies": []}]}
{"title": "$tsla calls", "selftext": "You kids better be buying those Sept TSLA calls for $280 while the price is hot!!\n", "id": "8grhp4", "created_utc": 1525363512.0, "score": 3, "upvote_ratio": 0.71, "num_comments": 17, "comments": [{"body": "Show your position first fool. Stop offloading your garbage to us gullible fags.", "score": 12, "replies": [{"body": "https://i.imgur.com/8ONqKrR.png\n\nI have 4 months to sit on this.. if you dont think they will go up past $280 you deserve Robin Hood.", "score": 4, "replies": [{"body": "It’ll be bankrupt by September. RIP\n\nEnron Musk ruined his chances of raising more capital, and they’ll need it $2 billion by July to continue operating through the year. ", "score": 4, "replies": [{"body": "I will exercise my option when it goes up more. every $1 the stock goes above $280 I make $1k", "score": 0, "replies": []}]}, {"body": "Holy shit, you really are holding onto garbage.", "score": 1, "replies": [{"body": "$294 🤔", "score": 1, "replies": []}]}]}]}, {"body": "TSLA options are probably the purest form of random gambling you can find. This stock makes literally 0 sense in what is already a volatile market in the middle of a correction. I realize this is WSB but idk how so many of you can stomach playing this", "score": 7, "replies": [{"body": "Some of us are so numb that $TSLA is the only way we can feel.", "score": 4, "replies": []}]}, {"body": "3k for 1 call, nty. FDs all day", "score": 6, "replies": []}, {"body": "Seriously this seems like the easiest money ever. Stock dropped because Elon was RUDE. It was green based on just the financials which do show exponential growth and capacity to meet his goals.", "score": 4, "replies": [{"body": "Exponential growth?  Auto revenue was flat Q/Q.", "score": 1, "replies": [{"body": "But they are producing batteries 8 times faster, they went from 500 to 2k per week in a month, and now with all that cash they “burned”, their infrastructure is set up for them to take off.", "score": 2, "replies": []}]}]}, {"body": "Tesla call are pretty entertaining ", "score": 2, "replies": []}, {"body": "BUY THE DIP", "score": 1, "replies": []}, {"body": "Nah I’m going $380 MAY4, they’re dirt cheap! ", "score": 1, "replies": []}]}
{"title": "NVDA starting that ER run up", "selftext": "Entire market pooping, this thing starting to go vertical. Get on it ya’ll\n\nBut srsly buy puts I’m retarded", "id": "8grshf", "created_utc": 1525365898.0, "score": 14, "upvote_ratio": 0.85, "num_comments": 11, "comments": [{"body": "Barclays upgrade today. If the market wasn't such a POS this would be up at least 5% already", "score": 9, "replies": []}, {"body": "Bought 2 days ago already up 50%", "score": 3, "replies": [{"body": "Sounds like you’re really short dated, I might roll those into longer dated options if you’re that ITM", "score": 2, "replies": [{"body": "If your date is after 5/10 you good", "score": 2, "replies": [{"body": "January 2019 I’m probably safe", "score": 2, "replies": [{"body": "Strike?", "score": 2, "replies": [{"body": "225 it’s in my post history", "score": 1, "replies": []}]}]}]}]}]}, {"body": "A lot of tech just got a boner. My ADBE and CRM calls are soaring", "score": 3, "replies": []}, {"body": "If I'm approved RH options before May 10 I'm buying puts. ", "score": 2, "replies": []}, {"body": "msft going up with it", "score": 1, "replies": []}]}
{"title": "How about that nvidia pump! Who’s long on NVDA?", "selftext": "[deleted]", "id": "8grz29", "created_utc": 1525367326.0, "score": 9, "upvote_ratio": 0.9, "num_comments": 19, "comments": [{"body": "Nvidia is a god.", "score": 5, "replies": []}, {"body": "21 @ 94, will hold this for a longgg time [proof](https://imgur.com/a/Kz6Ch0f)", "score": 4, "replies": [{"body": "That layout looks familiar, is Vanguard your broker?", "score": 1, "replies": []}]}, {"body": "Might be time to give SOXL a shot again. ", "score": 2, "replies": []}, {"body": "Close on day of earnings and go in shares only for day of earnings. Just a \"tip\".", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Ok good for you, catch the huge rip up after-hours earnings! that's what I'm gonna do.", "score": 2, "replies": []}]}]}, {"body": "49 @ 222", "score": 1, "replies": []}, {"body": "Just bought some 5/11 257.5 calls.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "With my track record since I got options, they wont.", "score": 2, "replies": []}]}]}, {"body": "44 @ 204", "score": 1, "replies": []}, {"body": "Not Andrew Left i hope he changed careers", "score": 1, "replies": []}, {"body": "I think nvidia has peaked. No new ground breaking card on the horizon", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "VR is a fad like motion controllers", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Kek", "score": 1, "replies": []}]}]}]}]}, {"body": "I'm partly long nvda since December drop but I have also been shorting the stock the couple months. I think it'll grow more before/on earning but I don't expect too much craziness. GPu prices dropped, less boughtby farmers. And yes I know nvda is a strong player in AI but for car driving is suspended and doesn't help for big earnings though", "score": 1, "replies": []}, {"body": "26 shares @154. been holding these bags for years", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I'm thinking far longer term than that. The bulk of my actual stocks is nvidia and then msft. I think they will both continue to get bigger and bigger over the next decade.", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": []}]}, {"body": "I think so too. They have been good to me so far and hasn't slowed down.", "score": 1, "replies": []}]}]}]}
{"title": "Can we all agree to that we're officially in bear market and its here to stay?", "selftext": "[deleted]", "id": "8gs3po", "created_utc": 1525368315.0, "score": 0, "upvote_ratio": 0.47, "num_comments": 12, "comments": [{"body": "We're 8% off all time highs. So not only is this a bear market, we're basically in the Great Depression 2.0. ", "score": 39, "replies": []}, {"body": "But as soon as I buy puts it goes up ", "score": 11, "replies": [{"body": "You too? I thought I was the only one.", "score": 3, "replies": []}]}, {"body": "more like a teddy bear market. my shit's still green.", "score": 11, "replies": []}, {"body": "Also, the sky is falling. Long umbrellas.", "score": 8, "replies": [{"body": "Only decent DD in this thread", "score": 2, "replies": []}]}, {"body": "That was like 4 hours ago. Jeez get with the program. ", "score": 2, "replies": []}, {"body": "Market is now flat for the day .  Settle down.", "score": 2, "replies": []}, {"body": "No", "score": 1, "replies": []}, {"body": "Buy OTM calls and puts, profit on either swing.", "score": 1, "replies": []}, {"body": "My heart says yes, indeed.", "score": 1, "replies": []}, {"body": "Ya I'm gonna wait to get out of this triangle before making a play.", "score": 1, "replies": []}]}
{"title": "Dow goes positive", "selftext": "", "id": "8gs8xn", "created_utc": 1525369462.0, "score": 118, "upvote_ratio": 0.93, "num_comments": 9, "comments": [{"body": "Definitely range bound for now. Did the same the thing. Qqq puts. Topped. Sold and bought calls. Decent day. Still haven’t made up for my irrational amazon exuberance to start the week but what ev. ", "score": 7, "replies": []}, {"body": "market was easy to predict today, bought amazon 5/4 call while they were down and sold when dow became positive. lmao easy money, only down a few hundred bucks this week now.", "score": 12, "replies": [{"body": "“Easy to predict” \n“easy money” \n*down a few hundred bucks* \n", "score": 62, "replies": [{"body": "You must have literally just read those words cause the next word was “today” ", "score": -9, "replies": [{"body": "Issa joke ", "score": 11, "replies": []}]}]}, {"body": "Same, with SPY calls a couple weeks out as it was crashing.  In and out today, for a quick 40% gain.  This week I'm finally outperforming my 401k for the year.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "The Show Billions", "score": 7, "replies": [{"body": "Does he become homeless", "score": 1, "replies": [{"body": "Watch the show, bitch. It’s good", "score": 2, "replies": []}]}]}]}]}
{"title": "Jim Chanos regarding Tesla's liquidity and credit strength: \"Tesla’s quick ratio dropped to 0.38 and their (Altman) z-score is approaching 1.0. Both are indicative of a company in financial distress.\"", "selftext": "", "id": "8gsubd", "created_utc": 1525374078.0, "score": 32, "upvote_ratio": 0.89, "num_comments": 10, "comments": [{"body": "aint nobody know what that means", "score": 20, "replies": [{"body": "http://www.businessinsider.com/the-altman-z-score-is-it-possible-to-predict-corporate-bankruptcy-using-a-formula-2011-4\n\n\"In subsequent tests over 31 years up until 1999, the model was found to be 80-90% accurate in predicting bankruptcy one year prior to the event.\"\n\n\nhttps://twitter.com/ElonBachman/status/992118617306255360", "score": 15, "replies": [{"body": "Ah so we have a 10-20% Elon pulls more shit out his ass and shorts get burned ", "score": 11, "replies": []}, {"body": "How do I long statistics?", "score": 1, "replies": [{"body": "buy shekels", "score": 2, "replies": []}]}]}]}, {"body": "Isn't Jim Chanos the guy who shorted BABA throughout 2017?", "score": 12, "replies": [{"body": "he is also the guy who shorted Enron and Valeant", "score": 18, "replies": []}, {"body": "He recently conceded his short on BABA and announced on CNN that he was wrong about BABA. \n\nEdit: he also was wrong about SCTY", "score": 5, "replies": []}]}, {"body": "Iirc he is short tsla since 2014\n\nHe’s not wrong tho", "score": 3, "replies": [{"body": "he said in CNBC interview that he started shorting 4 years ago. Interesting 4 years ago their stock was around $280. The stock hasn't moved since then.\n\nhttps://www.youtube.com/watch?v=Zv3YhMzS0z4", "score": 3, "replies": []}]}]}
{"title": "ATVI to resume trading at 330 pm est", "selftext": "", "id": "8gsyss", "created_utc": 1525375057.0, "score": 10, "upvote_ratio": 0.85, "num_comments": 8, "comments": [{"body": "God damn what a wild ride. Haven’t been able to get a single thing done at work in the past two hours", "score": 6, "replies": []}, {"body": "Already put my limit order in at 65. I'm fucking praying it fills through some glitch in the order book.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Nope. I didn't think there was much of a chance anyway.", "score": 1, "replies": []}]}]}, {"body": "Same. Did a limit order of $65.50 just in case", "score": 2, "replies": []}, {"body": "o shit where my popcorn", "score": 2, "replies": []}, {"body": "Shit stock is so wild rn I swear", "score": 2, "replies": []}, {"body": "Weird they open it up now given that reporting wouldn't have normally happened until after hours.", "score": 2, "replies": []}, {"body": "lol it's goin back down", "score": 1, "replies": []}]}
