{"title": "NIO v TSLA v The World", "selftext": "NIO $30 c 1/20/2023\n\n\"“In the short run, the market is a voting machine but in the long run it is a weighing machine.”\n\n- /u/ControlTheNarrative\"\n\n- Warren Buffett\n\nLook, we all know US and 'gyna have become ensnared in an economic cold war. \n\nWhat most people don't realize is that everything's gonna be alright. Mutually assured economic destruction is in our favor here.\n\nTwo stats you may find intriguing:\n\n>TSLA mkt cap: $2,857 per US citizen.\n\n>NIO mkt cap: $36 per Chinese citizen\n\n\nEveryone is asleep at the wheel here. Forget the fact that Elon Musk is the modern day equivalent of Thomas Edison on acid, a relatively lucid/sober Nikola Tesla, John Rockefeller, and the most autistic friend you have. NIO posted $5 billion in sales in 2021 for 187% YoY growth. The stock is trading at 10x revenues right now despite doubling sales two years in a row.\n\nhttps://www.macrotrends.net/stocks/charts/NIO/nio/revenue\n\n... and their EPS is only -$0.05/share. \n\n\nChina has 1.4 billion people. If just 5% of them own a Nio vehicle in 10 years, that will have been $2.8 Trillion in sales. Trillion.\n\ntl;dr buy TSLA always...\n\nBut also buy NIO, because this stock will 20x over the next 5 years. TSLA stock will not.", "id": "rhktot", "created_utc": 1639636939.0, "score": 63, "upvote_ratio": 0.83, "num_comments": 97, "comments": [{"body": "I think a lot of investors are just turned off by NIO being a chinese company and all of the dangers of the chinese stocks at the moment...I am not sure if NIO will be 20x like you said, but it should definetely be trading higher than it is now in my opinion.", "score": 42, "replies": [{"body": "No you are right, Nio is undervalued but no big investor is going to put money into it to move it into a good range for a long time. Next year we get a rate hike so stocks should fall and that means Nio shouldn't/won't see meaningful returns until Q3-Q4 of next year.", "score": 5, "replies": []}]}, {"body": "Bought more today! \nEven Alan Walker is with NIO!!", "score": 12, "replies": []}, {"body": "NIO looking real juicy rn", "score": 22, "replies": [{"body": "A Chinese 10 is a US 5-6 right now.", "score": 13, "replies": []}]}, {"body": "NIO are working hard to break into the European market right now. That could be huge. It will be interesting to see where they start.\n\nGot commons but maybe worth some LEAPS", "score": 18, "replies": [{"body": "The more important part is scaling up production and securing komponents. I dont think nio will run out of demand for a long time", "score": 1, "replies": []}]}, {"body": "ELON MUSK is Relatively Lucid Tesla!!! You WON THE PUN OF YEAR SIRRRRR![img](emote|t5_2th52|4271)", "score": 7, "replies": [{"body": "Don't forget about Nikola", "score": 4, "replies": []}]}, {"body": "Nia has made a deal with shell for swapping stationsin Europe  and I can say shell stations are Near everywhere here \nBasically just omv shell and some small ones but those are rare.\nMight get back into it.", "score": 3, "replies": []}, {"body": "Nio looks delicious but the ccp looks creepy to me", "score": 5, "replies": []}, {"body": "I went Nio sandwich with puts and calls. No way to know which way SP is going to go, but it’s going to go for sure", "score": 2, "replies": []}, {"body": "I'm with you, op. Holding long since feb2020. If it does half as well as you think in double the time,  I'll be able to retire lol", "score": 2, "replies": []}, {"body": "There's no guarantee cars (EV or otherwise) will still be around 10 years from now.", "score": 2, "replies": [{"body": "Care to wager?", "score": 3, "replies": []}]}, {"body": "I’m only adding more", "score": 2, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|24|**First Seen In WSB**|1 year ago\n**Total Comments**|101|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/mfi0dt/bill_hwangs_firm_just_went_tits_up_prime_brokers/) \n**Account Age**|10 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=rhktot)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=rhktot)\n    \nHey /u/lolfunctionspace, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 1, "replies": [{"body": "https://imgur.com/aytOZjL.jpg\n\n https://imgur.com/nMaBTfM.jpg", "score": 0, "replies": []}]}, {"body": "I haven't done any NIO DD but China gets too involved with their companies and your investment would be at the mercy of them. If you're looking for better valued EV companies, consider researching Polestar.", "score": 4, "replies": [{"body": "The only pole star I would invest in is called Destiny and she works at the club.  For a mere $100, I get VIP room, and she always know how to grow my “portfolio” which is a 25% return for me.", "score": 24, "replies": [{"body": "You either have a small penis or you run around 75% engorged all the time.", "score": 2, "replies": []}]}, {"body": "China's not gonna nationalize any company valued $36/citizen.\n\nNIO has a long, long way to run.", "score": 9, "replies": []}, {"body": "Haven’t done DD on Polestar, but as far as I know did Polestar not sell that many cars", "score": 3, "replies": [{"body": "Polestar sold more vehicles than Lucid and Rivian combined, and at a fraction of their valuation.", "score": 2, "replies": [{"body": "Haven’t done DD on Polestar, Lucid and Rivian, but as far as I know they did not sell that many cars\n\nBetter like this then?", "score": 1, "replies": []}]}, {"body": "They started with a premium model (like Tesla did and like Lucid are doing).\n\nThe Polestar 2 is far more affordable and a direct Model 3 competitor - and a serious one at that.\n\nA year ago if I saw a Polestar I'd stop and stare, if it was parked I'd go take a look.\n\nToday, if I see a Polestar I just think \"neat, a Polestar\". They're increasingly common.", "score": 1, "replies": [{"body": "I mean there is nothing huge about the company it’s just another EV car. It doesn’t have some new amazing stats or charging stations. I have a model S for a while now and the amount of charging stations are insane I can go everywhere I want since Tesla charging stations are all around the world. I just hop in my Tesla say where I want to go and I don’t have to think about my route. And NIO ofcourse has their battery swap system which is something new and innovating. Does Polestar have  something similar?\n\nNow if I’m traveling in a Polestar I can’t use their Polestar charging stations which are everywhere because they don’t have those.\n\nMaybe I’m missing something? But as far as I know the EV company doesn’t provide any new things", "score": 3, "replies": [{"body": "I'm not sure it has to so long as it provides quality, which it will as Volvo. Right now it has a tiny bit more of an 'exclusivity' feel than Tesla.\n\nKia don't offer anything new, less than Polestar, but I see numerous Kia EVs every day.\n\nEVs are becoming the norm and more and more they just need to be good vehicles. \n\nI'd add that, if I had a Tesla, I'd have little to no use for the charging network, so it wouldn't be a deal breaker.", "score": 2, "replies": [{"body": "How does it have a more exclusive feel?\n\nFirst of all if you see multiple Kia’s everyday that doesn’t mean the company is doing good. Also Kia started in 1944 not really fair to compare Polestar to a company like Kia.\n\nSo it’s a good car sure, but Tesla is also a good car for around the same price. Tesla and NIO also have more perks so most of the ev buyers are going for a Tesla or a NIO car. So why would I consider buying a Polestar instead of a Tesla or NIO?\n\nWhy do you have no use of the charging network?", "score": 2, "replies": [{"body": "1. because there are fewer of them right now. I see multiple Tesla's every day. I see a Polestar maybe once a week. As Polestar have only recently release their cheaper model it still has the association of it being pricier. I can see some people wanting to set themselves out agains the EV crowd.\n\n2. Whilst polestar are newer, they're part of Volvo. But that was more on the point that you can be successful without a charging network.\n\n3. It's just a different choice. People buy all sorts of cars and no one is best. Each have pros and cons and a lot if simple taste over anything else.\n\n4. I wouldn't need the charging network as I would rarely, if ever, be doing journeys that deplete charge to that extent. \n\nI'll possibly buy an EV in the next year. It's a 4-way tie right now between Model 3, Polestar 2, Mach-E and a Kia.", "score": 1, "replies": [{"body": "What are the pros of and Polestar compared to a Tesla?\n\nAgain I don’t know that much about Polestar just trying to figure out if it’s worth putting time into checking it out", "score": 1, "replies": [{"body": "To my knowledge, the only other place Tesla's are available in is China. Polestar's have multiple markets. They're trading in the $11 range as well, considering their merger with Guggenheim hasn't been completed yet. It's a blank check company, though the merger has already been announced.", "score": 0, "replies": [{"body": "Tesla is global. https://www.tesla.com/findus/list", "score": 3, "replies": [{"body": "![img](emote|t5_2th52|5957)", "score": 3, "replies": []}]}]}, {"body": "There are some good reviews on YouTube doing direct comparisons.\n\nIIRC the main points for those in favour were:\n\n1. Looks\n\n2. Better build quality (e.g. panel gap issue)\n\n3. More leg and headroom\n\n4. Prefer the ride feel - some people report it feels more stable and steering is better. Though others find Tesla more comfortable.\n\n5. More traditional interior. E.g speedometer\n\nMost reviewers seem to favour the Tesla, but enough favour the Polestar (e.g. BusinessInsidwr review) to make it worth checking out for me.", "score": 0, "replies": [{"body": "I have two Teslas, so we only have Teslas in our household now, no ICE backup. We drive a lot, both have jobs and kids with extracurricular activities etc.. I was able to make this switch with confidence because of how incredibly widespread and reliable the charging network is. As an owner let me assure you, you will give no fucks about a 1/16” panel gap or some other stupid shit when you’re flying around in a super safe muscle car and paying only pennies in fuel for doing so. Plus, every so often they add new features and your car just gets better without you doing anything. I just got a heated steering wheel and heated rear seats upgrade for free. Also since I’ve owned it I’ve gained the ability to use the car as a home security system since I can now view the entire exterior of my home through my cars’ cameras via the app while I’m in bed (one car is parked on each side of my house). There is not a better more convenient EV than a Tesla.", "score": 0, "replies": [{"body": "Fanboying _hard_", "score": 1, "replies": [{"body": "Yes, I am a big fan of the cars, I wouldn’t go back to an ICE vehicle.", "score": 1, "replies": []}]}]}, {"body": "I have not driven in a Polestar so maybe I should try it out some time", "score": 1, "replies": []}]}]}, {"body": "I've heard the Mach E has been plagued with issues", "score": 1, "replies": [{"body": "Interesting, thanks!\n\nWith it being their first proper EV I would have doubts.", "score": 1, "replies": []}]}, {"body": "I’d never buy a Polestar", "score": 1, "replies": [{"body": "I'd never buy a Nestle product. Doesn't mean they aren't successful.", "score": 1, "replies": []}]}]}]}, {"body": "For EVs to be considered a serious ICE vehicle replacement, they're gonna have to be just as convenient and then some. Numerous charging stations in addition to charging at home will help usher in the probability.", "score": 1, "replies": []}]}, {"body": "Polestar is global, unlike the others. They're set to build a plant in Charlottesville. With NIO, you have to think how practical is their battery swapping feature?  It seems cumbersome.", "score": 1, "replies": [{"body": "Not sure how swapping is cumbersome. I actually own a NIO car, you just drive up to the station and the car automatically pulls in and swaps the battery. 5 min later you leave with a full charge. Less cumbersome than getting out and plugging stuff in and potentially dealing with credit cards or QR codes or whatever else charging stations use. I know tesla chargers are just plug and play, but other ones aren’t.", "score": 3, "replies": [{"body": "I don't get this. Like how do they know the battery is good. How do you know you aren't playing hot potato with someone's old shitty battery?", "score": 1, "replies": [{"body": "They monitor the health of the battery and take out batteries in poor health… but even still if for some reason the battery was shit why not just swap again? It’s not mine. I don’t own the battery. Nio owns it.\n\nI’ve swapped like 20 ish times in the 9 months I’ve owned my car, no battery has shown any noticeable difference in performance.", "score": 2, "replies": []}]}]}, {"body": "Tesla isn’t global? \nNIO will soon be global\n\nHow are the battery swap stations not practical?", "score": 1, "replies": [{"body": "They're not as plentiful as charging stations. In addition, an EV owner can also charge from home. Not sure if you can with NIO. I've only ever heard the battery swapping being touted.", "score": 1, "replies": [{"body": "It’s the same thing with the Tesla charging stations at first there were slim to none stations and as the company got bigger the more charging stations they build. \n\nYou have NIO POWER HOME and with that service you can charge your car at home.\n\nHow is battery swap not appealing to you? Have you ever traveled long distances with an electric car? Because I have, and a few times a year I go from the Netherlands to the south of Spain which takes normally around 18 hours I it takes me around 22-24 hours because of the charging. If I had a NIO car I could just drive through the NIO swap station which takes 3 minutes and go on with my trip.", "score": 2, "replies": [{"body": "I can see the appeal in that scenario", "score": 2, "replies": []}]}]}, {"body": "Battery swapping is a default admission that the batteries aren't reliable.\n\nNissan should have gone this route.", "score": 1, "replies": []}]}]}]}, {"body": "Don't they only sell in China?", "score": 2, "replies": []}]}, {"body": "It sold 32,000 this year in china.", "score": 1, "replies": [{"body": "Can you link the sorcerer maybe? I can’t find anything", "score": 1, "replies": [{"body": "Chairman Xi Jinping said **Neo sold 32k units this year** (-30 off your social credit sore)", "score": 0, "replies": [{"body": "Yeah but the source everyone can type that", "score": 2, "replies": [{"body": "(-50 off your social credit socre)", "score": 1, "replies": [{"body": "With the source I mean a link to where I can see this information", "score": 2, "replies": [{"body": "(-120 off your social credit score)", "score": 2, "replies": []}, {"body": "(-80 off your social credit score)  We can do this all day long.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "A polestar is a volvo.  You over here telling people to invest in volvo.", "score": 1, "replies": [{"body": "Volvo is now Chinese; dedication to safety now in question.", "score": 1, "replies": []}]}, {"body": "Also a Chinese company.", "score": 1, "replies": []}]}, {"body": "What's your plan?", "score": 2, "replies": []}, {"body": "How comes that you guys always think all demand will be supplied by only two brands?\nThere are literally dozens of EV companies already, the German brands (which are a sign of wealth and class in china) have EVs too \n\nChinese people LOVE Daimler, BMW and VW they won't buy NIO just because it's Chinese. The Mercedes EQS will be the go to for Chinese wealthiest", "score": 2, "replies": [{"body": "I agree. I currently own Lucid and Polestar. It's a matter of who'll be able to effectively deliver while surviving the competition.", "score": 1, "replies": []}]}, {"body": "I'm adamantly again NIO investing. I've been against it since the big Chinese stock drop this year and have mentioned it multiple times on this sub. \n\nPros:\n\n1. Good company\n2. Undervalued (based on fundamentals).\n\nCons:\n\n1. Chinese (will not get major players backing it any time soon, has a chance to be delisted from US stock exchanges, has a chance of crashing on government decision to crash it at any time, has too much risk for everyday investors, only gambler investors will buy this company in hopes of a swing back to its glory day stock prices).\n2. It is unaffected by all EV/Green Energy programs that help drive EV stock prices in the US. \n3. The government of China killed some of their strongest stocks as a show of their power. Other than quick news swing plays, China value stocks will always have an inherently lower price than their equal counterpart in the US.\n4. They are experiencing a housing/stock meltdown.\n\nTLDR: Don't buy China until their whole market starts heading back up bigly. Then feel free to buy some of their power stocks. Buying Nio now means you'll be holding it for a year or more before you see any meaningful return.", "score": 2, "replies": [{"body": "Something something greedy, something something fearful.", "score": 1, "replies": []}, {"body": "I don't know why people see it being a chinese company as such a bad thing. Sure the delisting risk exists but it seems like it is getting solved. Apart from that it's more of a positive thing. The chinese government is pumping in billions of dollars into the ev market and have shown strong interest in having a key role in the worldwide market. Specifically nio is heavily backed by china. It is unlikely that the ccp would let nio go down and stupid to think that they would \"kill nio as a show of power\". You sound a bit uneducated and illogical.", "score": 1, "replies": []}]}, {"body": "Sorry NIO had to let you go at lost and YOLO on LCID.", "score": 2, "replies": [{"body": "Why don’t you like money?", "score": 1, "replies": []}]}, {"body": "And if NIO is told to delist from the US stock market? There's so much more to consider when looking at the big picture. Like has Nio saturated the China market and still can't turn a profit? Vs Tesla which highly profitable and runs its own factories?  \nIt'll be expensive for Nio to export overseas, so they have to take a huge gamble and build local factories in the US and EU, despite them still not making a profit. Nio cars are much more expensive than Teslas and all the traditional car players are getting into EVs at the same time. It's just a lot of risk. Sure TSLA isn't going to make you a 10x but isn't gaining 10% better than a loss?", "score": 1, "replies": []}, {"body": "Nio was $60 last year, now $30. There is no value in companies which grow backwards during bullmarket", "score": 1, "replies": [{"body": "The company didn’t grow backwards. The stock did.", "score": 2, "replies": [{"body": "Lol, well that’s correct. What I meant that valuation was way beyond organic growth of business and retailers as always got locked on hype with heavy bags on new highs.", "score": 1, "replies": []}]}]}, {"body": "Good luck with NIO. I'll hold on the TSLA like it's AMZN in 2000.  TSLA will grow profits faster than NIO can grow revenue, TSLA has a power business as well that will do great once 4680 production ramps, and NIO might get delisted because it's Chinese (if they can't provide fully audited books). I do wish them success, but too many unknowns for me.", "score": 1, "replies": []}, {"body": "I refuse to buy any Chinese stocks for multiple reasons, one being that the government can decide to take my money at any time.", "score": 1, "replies": [{"body": "you are right!", "score": 2, "replies": []}, {"body": "How can they take your money?", "score": 1, "replies": [{"body": "Not letting you sell whatsoever, or giving preferential treatment to Chinese accounts trying to sell during a crash.", "score": 1, "replies": [{"body": "Since its a chinese stock listed in ny china doesn't have that type of control. As long as you buy the adr it will have to undergo a delisting process for china to take control in any definitive way. They can make the company halt their trading for 10 days maximum which is the same for a us company.", "score": 1, "replies": []}]}]}]}, {"body": "**Guh**\n\n-u/controlthenarrative", "score": 0, "replies": []}, {"body": "LCID", "score": 0, "replies": []}, {"body": "None of my American money is going to support a Chinese company", "score": 0, "replies": [{"body": "IMO China is an authoritarian corporatocracy, and the US is a democratic corporatocracy. \n\nSo long as cap gains tax < income tax, there will be persistent wealth transfer from worker to shareholder.", "score": 1, "replies": []}]}, {"body": "> In the short run, the market is a voting machine but in the long run it is a weighing machine.\n\nIt's always a fucking voting machine, you morans... it's just sometimes it votes based on weight.  Buffett is such a retard.", "score": 1, "replies": []}, {"body": "technically, nio looks poised for a bounce but fundamentally, it's a chinese company, despite its international ambitions.  if you're willing to risk the china risk, this could be a good play but the same can be said of nearly all the chinese stocks.", "score": 1, "replies": []}, {"body": "Chyynaaaa", "score": 1, "replies": []}, {"body": "Elon is Steve Jobs and Li Bin is Bill Gates. Nio’s partnerships will eventually allow them to take over the world, much like Microsoft did.", "score": 1, "replies": []}]}
