{"title": "Ultimate Guide to Selling Options Profitably PART 15 - The Key to Trading Illiquid Options", "selftext": "# This post will teaching you the key to trading options in illiquid markets.\n\n# Low capacity spaces contain some of the best trading opportunities for retail traders because they are usually less efficiently priced.\n\n**But** **one of the hardest parts of trading in low capacity spaces (and most overlooked) is execution.**\n\nOften times, it can be the difference between a profitable strategy and an unprofitable one.\n\nThis is because our edge is usually small, and leaving money on the table due to poor execution can be devastating in the long run.\n\nThis is why I usually tell traders I know to stick to liquid names. The bid ask spreads are much tighter, and execution has less of an impact on your outcomes.\n\nThe problem with strictly sticking to liquid names is that as retail traders, often times there is more opportunity to be found in smaller, less liquid names.\n\nWith less eyes on a stock, it makes sense that volatility will be priced less efficiently (which means more chance for us to come in and price volatility better than the market)!\n\n# But if the market is illiquid, how can we trade it?\n\nThe short answer is that we need to *understand what volatility line we want to sell at*, and then try to get filled at the corresponding option prices!\n\n&#x200B;\n\n>Note: *Want to read the rest of my posts?* [Click here to view a list of them.](https://classic-desert-4cb.notion.site/Ultimate-Guide-to-Selling-Options-061ca90e28cc494eb855de5ce398af7e)  \n>  \n>\\^ Link to a notion page with all the reddit posts listed\n\n&#x200B;\n\n# This post will dive into the concept of understanding the volatility line you are selling at so that you can trade illiquid stocks with more confidence.\n\nTo understand this, we are going to use $VOD as our trade example.\n\n&#x200B;\n\n>**Note**: *I do not have a position on VOD. It came up in my scan expensive volatility scan, and chose to use it for this demonstration because a) IV is overstating RV b) It is very illiquid*\n\n&#x200B;\n\nWhen it showed up in my scan today, the 15.5 puts expiring Jan 07 2022 had a bid of $0.67 and an ask of $1.94.\n\nLet's say I came in and tried to get a fill at the mid for $1.30, and I did! I might sit there and say \"*Nice, I got filled at a fair price!*\"\n\nBut here's the issue. In this case, the mid is *not* fair value. It's not even the markets fair value.\n\n# The mid is just the middle price between the bid and the ask.\n\nIf the person on the ask is more aggressive, then the mid will be much more favourable to the buyer than to the seller. And if the person on the bid is more aggressive, the mid will appear much more favourable to the seller.\n\nThis is because the mid price can be easily changed by small actions on either side of the market.\n\n# Here's an example to make this clear.\n\nImagine we are looking at a stock with an illiquid options market for it.\n\nWhen we look at an option for it, we see that the bid is $0.50 and the ask is $5.00. There is 1 lot on the bid (one person looking to buy one contract as the bid), and 1 lot on the ask (one person looking to sell one contract as the ask).\n\n&#x200B;\n\nhttps://preview.redd.it/4lv4fte321481.png?width=1332&format=png&auto=webp&s=bee4f470b5a2bec5a5d636e064c1ff0f01113384\n\nThe picture above is what this market would look like. Given the gap between the bid and the ask, we would see the mid at $2.75.\n\nBut what would happen if a new market participant came in and offered to sell options at $3.50? Well now the ask on this option chain is $3.50, not $5.00!\n\n&#x200B;\n\nhttps://preview.redd.it/bx0jf29621481.png?width=1608&format=png&auto=webp&s=424d7ee4629adf56d6430c2fb9f266716246c6d2\n\nThis means that our mid has just changed drastically. It was $2.75, now it is $2.00! So which is the markets true fair value?\n\n*The answer is that in illiquid markets, we can't use the mid to estimate fair value.*\n\nOn something liquid like QQQ, SPY, or AAPL, the mid is great. The market is really competitive, with really smart people on both sides posting the bid/ask. So it's actually a good estimate of market fair value. Butt when it's illiquid, the mid is meaningless.\n\n# Let's go back to our VOD example now.\n\nAt the time of the trade, I went into my brokerage was showing IV at around 50% for the put options. But with the bid ask spread so wide, how do we know if this is even a legit number? To figure out if we can actually sell at 50% IV, we can answer the following question:\n\n*\"If I wanted to sell VOD puts at 50% IV, what price would I need to sell the the put options for?\"*\n\nTo answer this, we can use a Black Scholes calculator to price what the options should be worth *given* the level of implied volatility we want to sell at.\n\n&#x200B;\n\nhttps://preview.redd.it/lu1gdyh121481.png?width=1592&format=png&auto=webp&s=56c2c92132d9167be782687b11f19c69b6d88362\n\nI input the current price, strike price, expiration, and volatility my brokerage was showing. Once I ran the calculation, I see that the put premium is $1.12.\n\nWith this, I can conclude:\n\n***If I want to sell put options at 50% IV on VOD, I need to collect at least $1.12 in premium for each option***.\n\nIf I collect more than that, I am selling at a higher IV, and if I collect less than that, I am selling at a lower IV.\n\n# Let's say we didn't know how to price the options, and we blindly tried to get a fill.\n\nImagine this situation:\n\n*We looked at the data ad thought VOD options were expensive at 50% IV. The stock is only realizing 30% volatility.. so it's an easy sell! The market was illiquid, so we worked our order and* ***eventually sold a put option for $0.95.***\n\nIs this a good trade? Did we even sell what we meant to?\n\n# Let's check.\n\nTo figure this out, we need to use a calculator that allows us to input basic option information, but instead of adjusting the volatility to get price (as we did with the previous calculator), this time we are going to input the price to get the volatility!\n\n&#x200B;\n\nhttps://preview.redd.it/9dkkjkeul5481.png?width=2326&format=png&auto=webp&s=bf5f9cf76adf197be71e503e5e69eef3ac10af8c\n\nJust like the other calculator, I input the option basics (what kind of option, underlying price, strike, expiration), but now I also enter the price I sold at (rather than the IV).\n\nThe output is the implied volatility of the option I sold, given the price I sold it for.\n\n# Because I was too aggressive on my order, I actually sold at 40% IV instead of 50% IV.\n\nWith my fair value at 35% IV or so, I just erased almost all of my edge by being too aggressive. I didn't know when to stop, and I've either left money o the table or actually have a -EV trade now.\n\nI hope this example with VOD makes it clear how important knowing the vol line *you want to sell, and actually get filled at* is for your trading.\n\nIf you have questions about this, please leave a comment and I will try my best to help you.\n\n# Ok, so I priced the option, and know where I want to sell. How flexible can I be with getting a fill?\n\nOnce we know the IV we want to sell at, and what price we should be selling for in the market, how strict do we need to be with getting that price.\n\nLooking at our VOD example, we are aiming to get $1.12 for the put option. But would we be happy with $1.11? How about $1.05? How can we figure out the minimum that we are happy to collect on this trade?\n\nThe answer depends on how much edge you have on the trade. This is why valuation is important.\n\n# Here's a clear example (not options related, but it illustrates my point well).\n\n**Let's say that you know for sure that AAPL is going to $200 tomorrow. How much should you be willing to pay for AAPL today?**\n\nThe answer is obviously *anything below $200.*\n\nMaybe with some room for error depending on your confidence.\n\n**But the key point is that you have to value it**. **You have to be able to say that AAPL is worth $200.**\n\nThe same thing goes for option trading. We are saying that the fair value for VOD is much closer to what it is currently realizing. Maybe 35-40 vol.\n\nSo how can we think about this?\n\n1. VOD is currently trading for 50% IV. It's realizing about 32% IV.\n2. I think fair value is closer to 35-40% IV.\n3. I  need to leave a margin for error incase my calculations are slightly off\n4. After everything, there needs to be enough profit that it's worth taking on the risk of this stock moving a lot.\n\n# Knowing this, it doesn't make sense for me to get filled at the 40% IV line.\n\nIts very close to my opinion on fair value, doesn't leave much room for me to be wrong or make a profit.\n\nAnything below about 47% IV would not be something that I would do. Using the option calculator and adjusting for this, I can conclude:\n\n* I want to sell the put option for $1.12\n* I am willing to lower my ask to $1.06\n\nIf I am unable to get a fill for above $1.06, the trade is no longer worth taking, and I will have to either wait for a fill or move on to another trade. I've witnessed many occasions where traders will get too aggressive with their orders, and then are left wondering why they are losing money.\n\nBy always knowing the volatility line you are selling at, you will avoid this problem and be able to better take advantage of illiquid markets.\n\n# Conclusion\n\nMost the time, traders think that once they have found a good idea, the hard work is done. But what you come to realize as you continue to improve and find your own edges, is that one of the hardest part in trading is actually the execution. Usually, that is the difference between a +EV and -EV strategy, and I will consider this post a success if that has been made clear and you have a solution to this problem when liquidity makes it hard to find market fair value.\n\nAlways remember, when we are trading in an illiquid market we **need** to price our options.\n\nThis is crucial. If we can't price the option when we go to trade it, all the work we put into trying to price it beforehand is jeopardized.\n\nOn the flip side, when we are able to price the volatility we are aiming to get filled at, we are now free to explore illiquid option chains for potential opportunity. These tend to be lower capacity spaces, with less eyes on them, and therefore more opportunity for the small guy.\n\nRemember, as retail trades, we are all relatively \"small fish\". We don't need to be in the ocean to find food, we can hunt in a pond.\n\nWhen you can price the volatility you need to be trading at, hunting in the pond becomes a lot more satisfying.\n\nHappy trading,\n\n\\~ A.G.", "id": "rb3luq", "created_utc": 1638897406.0, "score": 669, "upvote_ratio": 0.95, "num_comments": 101, "comments": [{"body": "Please do not suddenly delete all your posts. I want read them all but i need some time. Big up for the great work!", "score": 21, "replies": [{"body": "Hah! I won’t. Thanks :)", "score": 15, "replies": []}, {"body": ">I saved everything on my computer... got lots of reading to do.", "score": 2, "replies": []}]}, {"body": "This was a good read, thanks", "score": 21, "replies": [{"body": "My pleasure :)", "score": 12, "replies": [{"body": "It's always a good read. \nAlso, hits close to home since I've been selling leap options for mvis and have gotten stuck in a circle of selling options and buying stock. \nI'm not sure how to get out of it. \n\nThanks for the read.", "score": 1, "replies": [{"body": "I hope it helps. :) if you have a question about your trade, let me know!", "score": 3, "replies": []}]}]}]}, {"body": "Really good write up.\n\nI thought I should mention a couple other issues that you may encounter with illiquid options.\n\nChanges in the underlying can end up being the cause for your fill, as you may not be changing your price calculation as quickly as the underlying moves. This is more of a factor when you're at or near the money, as option prices typically change faster where there is more extrinsic value. What does this mean? Like what is being explained in the OP, the fill may not adequately give you the full value, so you may get a fill but instantly be theoretically down already, which is what we're trying to avoid here.\n\n**Should we be applying this using an algorithm to correct?**\n\nAs you approach expiration you will be hoping for more liquidity than when you started. This will not always be the case, and can often be much worse. This happens a lot if the strikes end up very far ITM or OTM. Why does this matter? If you are on the buy side of calls, you may need to exercise it yourself. If you're on the sell side, you have to buy back a short from someone that now maybe a price giver. This is definitely ticker related though. S&P 500 options would likely have little issue in typical circumstances, but this definitely can happen on anything where shares are trading at a low volume.\n\n**What are good exit strategies for illiquid options? Are CSP's and CC's the main focus, or have you had luck with spreads as well?**", "score": 5, "replies": [{"body": "He spreads those cheeks", "score": 5, "replies": [{"body": "Commenting to see what’s between them cheeks", "score": 3, "replies": []}]}, {"body": "Commenting to see OPs answer here", "score": 3, "replies": []}]}, {"body": "If the markets are illiquid, that's giving you a great hint that it's probably not a great product to trade. Do not force trades. \n\nYou flow between a couple concepts - illiquid options and illiquid markets. I think it's important to differential between the two. \n\nI'd offer that illiquid options should simply not be traded and avoided. \n\nI'd offer that at time the markets can be illiquid and it's not always avoidable. During this time, I think it's key to minimize market exposure (where possible).", "score": 16, "replies": []}, {"body": "I had a VERY NOVICE client who after I educated him on options, simple buy/sell nothing more difficult he insisted he wanted to go it alone, let him do whatever he does, after he signed my hold harmless agreement I let him play.  He liked to find options as you describe, very few open interest and a huge bid/ask spread.  I came in one morning and had 3 messages from him, call ASAP so I looked at his acct, laughed my ass off and called him.  He placed a market order to buy 100 contracts, and had 10 separate executions from $5 to $50 in lots of 10, 10@$5 10@$10 10@$15 etc.  he wanted to know what to do being the current bid was $1 and he was in for ~$125k.  He meant to buy 1 contract but was thinking 1 contract = 100 shares and pushed 100 !!  BTW, no, the market maker refused to bust the trade in case you wondered, lol.", "score": 7, "replies": [{"body": "Holy shit lol.", "score": 3, "replies": [{"body": "But he did save $75 in commission lol", "score": 1, "replies": [{"body": "Hahaha", "score": 1, "replies": []}]}]}, {"body": "Classic “it’s easy, why should I pay you?”\n\n\nWell $125k is a lot of commissions/advisor fees. \n\nHope you doubled his management fee when he asked you to take the reigns again.", "score": 3, "replies": [{"body": "I refused, told him “you only made 1 mistake, did you stop dating after the first dumped you” I was working his self esteem at that point", "score": 1, "replies": []}]}]}, {"body": "Dropping the knowledge like it's hot! Thanks!", "score": 7, "replies": [{"body": "Haha thanks my friend :)", "score": 6, "replies": []}, {"body": "I'm thinking, would it be possible to sell SPLG options while hedging using SPY options?\n\nSPLG has quite large spread, and likely options are priced incorrectly. \n\nOne of the issues arising though is too large price difference between SPLG and SPY, so one would probably have to get filled with 6 options at once to replace it with 1 SPY.", "score": 1, "replies": []}]}, {"body": "Thanks AlphaGiveth! When you talk about EV in the context of options, how are you measuring that? How are you deriving that probability? Or are you just talking about EV in a general sense", "score": 3, "replies": [{"body": "EV in options can come from a couple of different places really. Example:\n\n1) Risk Premiums\n\n2) Pricing inefficiencies (should be $5, trading for $10)", "score": 4, "replies": []}, {"body": "TastyTrade has a nice write up about Expected Value or Expected Move.", "score": 1, "replies": []}]}, {"body": "I just realized this is part 15. I haven’t seen any of the others, but if they look anything like this… that requires some dedication. Well done!", "score": 3, "replies": [{"body": "I don’t call it the ultimate guide for nothing!! Haha", "score": 3, "replies": []}]}, {"body": "Where can we get a reliable, free Black Scholes calculator that uses days instead of years? What do you use to calculate the risk-free rate, assuming the option expires less than a month away?", "score": 4, "replies": [{"body": "There's a number of free calcs out there like this one from Ivolatility\n\n[https://www.optionseducation.org/toolsoptionquotes/optionscalculator](https://www.optionseducation.org/toolsoptionquotes/optionscalculator)\n\nThe one I use is just built into the data terminal I use", "score": 10, "replies": [{"body": "And what data terminal do you use?", "score": 1, "replies": [{"body": "Predicting Alpha", "score": 1, "replies": []}]}]}]}, {"body": "I think its both on entering the trade and exiting the trade. Illiquid options can eat into profits and result in a forced loss. So if we open an order which doesnt get filled immediately but then some time later gets filled as the price of the stock changes, does that sort of invalidate the trade as well, as you wouldnt have entered into that trade as that value?", "score": 2, "replies": [{"body": "It all depends why it filled at that price. If it’s because liquidity came in, all is good. If it’s because things moved drastically, not good.", "score": 2, "replies": []}]}, {"body": "One thing I want to make mention of, use a broker that has walk limit orders.  As it walks the bids usually lift or the offers come in so you can get a more realistic picture of the market.  I'm biased but I use portfolio margin at Schwab and they have walk limits on Streetsmart Edge (their downloadable SW).  You may fill better than just going in straight limit order.", "score": 2, "replies": [{"body": "Can you explain that? What does the term ‘walk the bid‘ mean?\n\n  Thanks!", "score": 2, "replies": [{"body": "Sure - use OP’s example that an option is .50 x 5.00 and let’s you’re trying to buy it for no more than $1.5.  You can set it to walk your bid X amount every Y seconds.  So you could have it start your bid at .50 and walk from .50 to 1.5 in increments of 2 cents for example and hope you fill better than 1.5 (if you fill at all)", "score": 3, "replies": [{"body": "Thanks - got it!", "score": 1, "replies": []}]}]}, {"body": "I want to use Streetsmart but they only run on specific computers. And their web interface and mobile especially leave a LOT to be desired... they own TD Ameritrade, and for some reason TD is way better in both areas. Strange stuff.", "score": 1, "replies": []}]}, {"body": "Very valuable, thanks.\n\nTo find the fair price do you consider the situation that you need to buy to close or just wait for it to expire or get assigned?", "score": 4, "replies": [{"body": "That is a really good add on. If the market is illiquid, you definately have to consider the fact that you wont get out on the bid. \n\nIn strategy development, they refer to this as 'having to cross the spread'\n\nThanks for bringing this up.", "score": 3, "replies": []}]}, {"body": "Great read! Thanks for posting.", "score": 0, "replies": [{"body": "Merci", "score": 2, "replies": []}]}, {"body": "This is an amazing summary, thanks for posting. Illiquid options can be great for profitability, because they are simply way too small for institutions.\n\nTLDR: massive opportunity in illiquid options, but don’t force the market, let it come to you.", "score": 0, "replies": [{"body": "Thank you :) \n\n1 more point for the TLDR: know where you want to sell, and when you end up selling in IV terms. Adjusting your ask too much can screw you over.", "score": 1, "replies": [{"body": "Just discovered this the hard way. Great, informative post. Just wish it would have found its way to me last week lol.", "score": 1, "replies": [{"body": "Care to provide details?", "score": 1, "replies": []}]}]}]}, {"body": "Fuck you dude just tell me what fucking options to buy wtf….", "score": -3, "replies": [{"body": "Hey man if you can’t get a fill, hit me up I’ll gladly make you a market :)", "score": 3, "replies": [{"body": "Am I too dumb to understand English or are there typos in there? I just bought SPY and COIN puts for march.", "score": -1, "replies": [{"body": "probably the first one", "score": 3, "replies": [{"body": "Probably eh? Is this not financial advice either? Do any of you people stand by anything you say or are of you just ready to move on to the next hottest thing.", "score": -2, "replies": [{"body": "holy shit dude look at your post history, I assume this is an account specifically for trolling and this is not how you act/interact and think in real life otherwise you've got some serious mental issues", "score": 2, "replies": []}]}]}]}]}]}, {"body": "[removed]", "score": -7, "replies": [{"body": "Bruh..", "score": 2, "replies": [{"body": "This is legit man. I get the suspicions because I was too in the beginning. Give it a shot", "score": -5, "replies": []}]}]}, {"body": "Thank You!", "score": 1, "replies": [{"body": "you're welcome!", "score": 2, "replies": []}]}, {"body": "I got a question if you sell a call and want to buy it back and the premium increase can you still collect the premium", "score": 1, "replies": [{"body": "You collected premium but in order to close you had to pay more than you collected. Hence, loss.", "score": 3, "replies": []}]}, {"body": "Great read, thanks op!", "score": 1, "replies": [{"body": "Glad you liked it!!", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Hahaha. I might compile it all in the end. $4.20 for an e copy , $6.90 for a paper copy heh", "score": 3, "replies": []}]}, {"body": "Adding...the seller could also set both the asking price and the bidding price in favor to them, especially with low volume options. whenever there is a big spread, be careful when entering.", "score": 1, "replies": []}, {"body": "Great write up, thanks!", "score": 1, "replies": [{"body": "Thank you!", "score": 1, "replies": []}]}, {"body": "This is poetry. Good read.", "score": 1, "replies": [{"body": "My other username is vol_shakespeare :P", "score": 1, "replies": []}]}, {"body": "Does this really work for you and how many years?", "score": 1, "replies": [{"body": "All that we are reviewing here is how to know what vol line you sell at. It works because it’s just some math, really. There’s inherently no edge knowing this, but not knowing it can be lethal.", "score": 3, "replies": [{"body": "gotcha Thanks for the write up need to go back and read the rest", "score": 1, "replies": [{"body": "No problem I’m here if you have questions", "score": 2, "replies": []}]}]}]}, {"body": "Good information post, thank you", "score": 1, "replies": [{"body": "Nice! Glad you liked it", "score": 1, "replies": []}]}, {"body": "Where can I start at part 1 and work my way forward?", "score": 1, "replies": [{"body": "Check link at the top of the post. Or the pinned post on my life", "score": 2, "replies": [{"body": "GD! I’m sorry, just saw it was excellent content and totally missed the link. My bad", "score": 1, "replies": [{"body": "Hahaha. It happens on every part I post :) all good!", "score": 1, "replies": [{"body": "Well glad I can fill the role for #15. \n\nGood day to you!", "score": 1, "replies": [{"body": "Hahaha thank you very much my friend", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Interestingly enough, I almost never trade SPY. It’s the most efficiently priced asset, no edge for retail to find there IMO :P", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "A 30% roc on capital per week is really good! That will compound nicely", "score": 1, "replies": []}]}]}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "This comment has been automatically removed. Discord and other chat links are not allowed as an anti-spam measure.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/options) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "This comment has been automatically removed. Discord and other chat links are not allowed as an anti-spam measure.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/options) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Why is picking an arbitrary IV any better than picking an arbitrary ask?\n\nWhat I do, if there are any liquid options in the chain, is a log fit of the liquid options, and extrapolate to the illiquid ones.", "score": 1, "replies": [{"body": "Well, you want to price the vol first. Check out some of the previous parts to the guide", "score": 1, "replies": []}]}, {"body": "What a wonderful and informative post! Thank you!", "score": 1, "replies": [{"body": "Merci!", "score": 1, "replies": []}]}, {"body": "Do you have an actual blog?", "score": 1, "replies": [{"body": "Just a Notion page linked in my profile", "score": 1, "replies": []}]}, {"body": "I don't think I have ever commented on your posts but THANK YOU! I love when people put REAL information out there for the retail trader! No matter what anyone says your a awesome person!!", "score": 1, "replies": [{"body": "Wow thank you very much!", "score": 1, "replies": []}]}, {"body": "Question from an inexperienced option trader: Say I'm trying to sell a put on a relatively illiquid option -- listed bid is .05 / ask is .80.  Huge spread.  I'm tinkering with IV in the Black-Scholes and the mark should be in the .30-.50 range depending on IV.  In a theoretical vacuum (meaning no other underlying changes), is there any chance I'd get filled if I put a limit order to sell at .70?  Would it just take one buyer to put in a market order?  Or would the market-maker or some sort of other algorithmic function prevent that from happening?", "score": 1, "replies": [{"body": "You might get picked off in the middle. There’a a few different reasons you might get picked off but basically it’s “hidden liquidity “ \n\nYou could get filled, but you need to know the lowest you’re willing to go.", "score": 1, "replies": []}]}, {"body": "Not the hero we deserved but the one we needed", "score": 1, "replies": [{"body": "Haha :P", "score": 2, "replies": [{"body": "Are you a professional or just do this as hobby?", "score": 1, "replies": [{"body": "I am a retail trader , but it’s more than a hobby lol", "score": 3, "replies": [{"body": "It's a lifestyle", "score": 1, "replies": [{"body": "Lmfao I set myself up for that one", "score": 1, "replies": []}]}]}]}]}]}, {"body": "hey thanks so much for these articles. i've been binging them over the past few days.  \n\n\nnoticed you entered 0 on interest rate and yield into your calculator. do you not bother with these in your price calculations? and if you do, how do you find/calculate those figures?", "score": 1, "replies": []}]}
{"title": "On Apple Maps, land masses are whatever size the Chinese government says they are.", "selftext": "[removed]", "id": "rb8sfh", "created_utc": 1638909239.0, "score": 334, "upvote_ratio": 0.92, "num_comments": 93, "comments": [{"body": "As an engineer I would feel sick to my stomach if I got such requirement from my managers. Probably enough to start looking for a new job the same day.", "score": 256, "replies": [{"body": "Depends how much you'd get paid, also keep in mind if you don't do it, the next person will and nothing really changes.", "score": 19, "replies": [{"body": "Maybe his conscious will be better knowing he’s not an active participant. If he’s an engineer for Apple, then he can probably work for any FANG company for a ton of money anywhere.", "score": 11, "replies": [{"body": "Yeah because the other FANG companies are known for being so morally righteous…", "score": 11, "replies": [{"body": "Just realized “FANG” is now “MANA”", "score": 1, "replies": [{"body": "I prefer “MAAN”, like when Deion Sanders says “Cmon MAAN”", "score": 1, "replies": []}]}]}]}, {"body": "Yeah, a less principled person. This is why shit like this happens, because so many people share this way of thinking. As for me, I try to be the change I want to see in the world. We need more of that.", "score": 9, "replies": [{"body": "Yup, my money won't make a difference to the company but my mind will be just a little bit more at ease.", "score": 3, "replies": []}]}, {"body": "Wrong. You always have to look in the mirror every morning", "score": 2, "replies": []}]}]}, {"body": "It's really difficult to run a mapping service in China (or a mapping service outside China that maps China). Obviously, working with the Chinese government can be troublesome. In addition to this, which is a pretty nutty request, there are [restrictions on coordinate systems](https://www.serviceobjects.com/blog/why-gps-coordinates-look-wrong-on-maps-of-china/). You'll notice when you zoom in on China in Google Maps, all the roads are offset from where they actually are in the satellite view. It is illegal for them to convert them to the correct coordinates so it displays correctly.", "score": 63, "replies": [{"body": "That explains why geocaching was absolutely impossible over there.", "score": 11, "replies": []}, {"body": "I did some work making cell phone coverage maps. This would be a huge pain. One coordinate system to another is kinda like feet to meters but the problem is there are hella numbers to convert and that makes it a non trivial problem. If it were trivial I guess landmarks and satellite images would always line up regardless of your location or the domain. I bet there are two copies of every frickin coordinate. What a pain. If you are in China or at the .cn site then the landmarks and satellite images don't match up for the US?", "score": 3, "replies": []}]}, {"body": "China actually the size of Japan", "score": 62, "replies": [{"body": "China is Chad. Long live Chad", "score": 0, "replies": []}]}, {"body": "#I LOVE TAIWAN, FUCK POOH BEAR", "score": 205, "replies": [{"body": "Do you mean the country of Taiwan?", "score": 31, "replies": []}, {"body": "Mainland taiwan has nothing on real taiwan.", "score": 38, "replies": [{"body": "You mean west taiwan?", "score": 19, "replies": [{"body": "Ooooh, *spicyyyyy*", "score": 2, "replies": []}]}]}, {"body": "Thank you for taking such a brave stand.", "score": 5, "replies": [{"body": "Fuck the CCP", "score": 8, "replies": []}]}, {"body": "Long live the ROC.", "score": 1, "replies": []}, {"body": "90% of people that stan Taiwan, purely in spite of China, can't point out Taiwan on a map", "score": -9, "replies": [{"body": "don't project your own ignorance on others", "score": 5, "replies": []}]}, {"body": "Taiwan will be part of China soon", "score": -7, "replies": []}]}, {"body": "I’ve had it with US companies pandering to the Chinese government. Apple, Nike, Disney, the NBA. Fuck them all.", "score": 16, "replies": [{"body": "The US media pander to the political party that matches their ideology, it just helps that China only allows one political party.", "score": 3, "replies": []}]}, {"body": "Fuck the CCP coming straight from the underground", "score": 45, "replies": [{"body": "CCP think\nthey have the authority to kill a Uighur\nFuck that shit, 'cause I ain't the one\nfor a Commie motherfucker with a badge and a gun", "score": 4, "replies": []}]}, {"body": ">The Diaoyu Islands, **when viewed in Apple Maps in mainland China**, continue to appear on a larger scale than surrounding territories.\"\n\nBig part missing from the headline/title. This only applies when viewing from apple maps inside of china.", "score": 47, "replies": [{"body": "Well I should have read the article instead of zooming in and out on google maps and apple maps getting confused.", "score": 30, "replies": [{"body": "Lol you are not alone", "score": 4, "replies": []}]}, {"body": "Any capitulation into disinformation from a totalitarian state is disgusting.\n\nI've not owned an Apple product in over a decade but that's not any better. They were told to jump by the CCP and asked how high. Apple, Disney, the NBA. They're complicit for the sake of keeping that market and it's disgusting.", "score": 15, "replies": [{"body": "But the Chinese government controlling information accessed in China isn’t new. Apple accommodating such control may be, but it takes a lot of weight out of the article nonetheless.", "score": 3, "replies": []}, {"body": "have you watch foxnews or cnn?", "score": 0, "replies": [{"body": "They suck, too.", "score": 1, "replies": []}]}]}, {"body": "Jokes on China then because everyone knows you never use Apple Maps, that shit is garbage.", "score": 2, "replies": []}]}, {"body": " Why removed,", "score": 8, "replies": []}, {"body": "China continues to big dick the USA", "score": 53, "replies": [{"body": "For fucking real. Apple’s bigger than all countries and they still bow down to china smh.", "score": 12, "replies": [{"body": "They are only that size because they are allowed to sell in foreign markets around the world, they had to comply to some bullshit that Russia had them do not too long ago", "score": 8, "replies": [{"body": "China is one one of the major reasons that Apple is the biggest company in the world. \n\nBut still shitty and needs to change at some point.", "score": 1, "replies": []}]}]}, {"body": "OK, Donald. US still far surpasses China in almost every fathomable way, economically, socially, technologically, politically. US still got the biggest dick 'round here.", "score": -1, "replies": [{"body": "You’re living in 1995 still", "score": 3, "replies": [{"body": "why is it that so many Chinese want to immigrate to US, but no Americans want to emigrate there, hm?", "score": 5, "replies": []}]}, {"body": "China is the one having 'requests' actioned, US is more scared to upset China as is most of the West.", "score": 0, "replies": []}, {"body": "Bro China has us right where they want us. They can literally do whatever they want and we will bend to their rules", "score": -1, "replies": [{"body": "how old are you", "score": 3, "replies": []}]}]}, {"body": "Seemed to stop for about 4 years, but now it's back and stronger than ever", "score": -16, "replies": [{"body": "Except not really. China has been big dicking the US for the last 10 years and will continue to do so even more as they gain more power at the US “expense”", "score": 8, "replies": []}, {"body": "Hahahahahahahahahahahahahahahahahahahahahahahaahhahahahahahahahahahahahahahaha\n\nThere was an eiffel tower going on for 4 years, you mean, with Russia and China tag teaming the US.", "score": 2, "replies": [{"body": "This comment alone shows you're trolling or clueless. He was tougher on both countries than the moron that came before and after him. And thats just a simple fact. But go ahead,  go buy some CCP stocks little guy", "score": -1, "replies": []}]}, {"body": "This is what being in a cult looks like", "score": 1, "replies": [{"body": "Using your brain is considered a cult now? Oof", "score": 1, "replies": []}]}]}]}, {"body": "Bullish, Apple is willing to whore themselves out to make their shareholders more money.  As long as they keep running woke advertisements I don't think the commoners will catch on.", "score": 24, "replies": [{"body": "PROCREATE\nCONSUME", "score": 1, "replies": []}]}, {"body": "Wikipedia article about these islands is pretty fascinating, it's extremely clear that these islands belong to Japan, so what does China gain by making them appear bigger but only to their own people? \n\nI'm also interested in how this appears visually, because to zoom out a map and have only certain objects not zoom out would be very visually jarring, like an obvious glitch", "score": 4, "replies": []}, {"body": "[deleted]", "score": 11, "replies": [{"body": "Bull signal, apple is willing to work with the Chinese market", "score": 22, "replies": [{"body": "It's sad that you're right.", "score": 5, "replies": []}]}]}, {"body": "C.R.E.A.M.", "score": 10, "replies": [{"body": "dolla dolla bill y'all", "score": 6, "replies": []}]}, {"body": "Why was this removed?", "score": 3, "replies": []}, {"body": "I don't have an apple device, so I wasn't able to verify this, but another unethical feature Apple implemented is this:\n\nApparently, asking siri for the time in palestine will result in \"I'm sorry, I don't know how to help with that\" or similar. Israel, Jerusalem, etc.? No problem. Palestine, Gaza, West Bank, etc.? Siri doesn't know what that is. Nor can you search for gifs of \"palestine\"\n\nMaybe someone with an iPhone could fact-check me.", "score": 5, "replies": [{"body": "\"Siri, what's the weather today in Palestine\"\n\n\"A two-state solution is untenable because it would require negotiating with ter... sorry I can't help with that\"", "score": 3, "replies": []}]}, {"body": "So… sort of like how twitter crowd decides what gender is and how many designations exist regarding how peoples sexuality are categorized or not categorized, not based on any social science or academic study based. Just the twitter-verse introducing concepts and then echo chambering it.\n\nThe CCP is also the same force but in the opposite direction. At the threat of economic boycott and lock out, companies must abide. Same with folks who aren’t aligned with the current group think on twitter. Risking social lockout or cancellation.\n\nThey decide what is what, and how the facts are viewed. If it doesn’t fit, then it gets changed and skewed.", "score": 5, "replies": []}, {"body": "Apple is comprised of a bunch of traitorous, back-boneless cowards? Who knew!?", "score": 2, "replies": []}, {"body": "It’s well known that tech and entertainment companies simp for West Taiwan. It shows that money is far more important than doing the right thing.", "score": 2, "replies": []}, {"body": "Also Chinese weiner biggest of all other races according to Tim Cock.", "score": 2, "replies": []}, {"body": "Fuck Apple", "score": 2, "replies": []}, {"body": "I work in the mapping industry. \n\nThese dipshits are absolutely insane. Their coordinate system laws can easily be reverse engineered to negate their intended effect, but to the unskilled, unaware average citizen trying to understand WTF is wrong with the map on his phone, it doesn't make any sense.", "score": 2, "replies": []}, {"body": "I think you meant West Taiwan", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "My country smells better than your country. \n\nWhoops, did I say country? I meant shit.", "score": 1, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "I agree with you. \n\nMuch of it is China FUD. Granted, China is childish, only themselves to blame for the negative sentiments, oftentimes behaving like an onion article, but the U.S.’s propaganda machine and information superiority make it so you don’t even know you’re being manipulated.\n\nThere’s shitty disinformation campaigns everywhere every moment.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "It’s a culmination of things. The stock market is just one of the places people are using to direct their attacks in tangible ways.\n\nBut as a stock subreddit, the politics is a bit grating. But for those trying to look at the forest beyond the trees, there are opportunities.", "score": 2, "replies": []}]}, {"body": "Hasn't stopped since the temperance movement", "score": 1, "replies": []}]}]}]}]}, {"body": "Look at their rona deaths toll, it's like they weren't the epicenter of it all, \"effective measures\" my butt.", "score": 1, "replies": []}, {"body": "!@#$ Xinnie the Pooh and the CCP.", "score": 1, "replies": []}, {"body": "Dammit, West Taiwain", "score": 1, "replies": []}, {"body": "Fuck tim apple", "score": 0, "replies": []}, {"body": "Shocker", "score": 0, "replies": []}, {"body": "At this point the US government needs to get involved.  Amazing how China seems to have more influence over our own tech companies.  \n\nBut I guess everyone in congress probably has Apple shares and is lobbied by them hard.", "score": -1, "replies": []}, {"body": "Is there a screenshot somewhere ?", "score": 1, "replies": []}, {"body": "Can anyone provide the article please? Damn paywall. Already tried different sources to view", "score": 1, "replies": []}, {"body": "Isn’t the world map that most people are familiar with fake anyway? The actual sizes are wildly different.", "score": 1, "replies": []}, {"body": "Big apple holder and it’s treated me well unfortunately it’s hard to find a company that does not engage in this type of crap. American companies helped them build the great firewall and balk at working on US govt military projects", "score": 1, "replies": []}, {"body": "Fuck both China and Apple at this point. Wtf seriously", "score": 1, "replies": []}, {"body": "Apple Maps, continuing their dedication to accuracy. It'll get you to where you need to go, even if it includes driving down a railroad track or sailing around a coastline that's actually a few dozen miles away.", "score": 1, "replies": []}, {"body": "Everybody is licking China´s ass.", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "https://www.reddit.com/r/technology/comments/rarq5q/meta_sued_in_excess_of_150_billion_for_its_role/?utm_medium=android_app&utm_source=share\n\n\nAwkward", "score": 1, "replies": []}]}]}
