{"title": "[deleted by user]", "selftext": "[removed]", "id": "rlj653", "created_utc": 1640106529.0, "score": 33, "upvote_ratio": 0.78, "num_comments": 97, "comments": [{"body": "My thoughts why inflation will go down:\n\n1) Baby Boomers and Gen X retiring. \n\n2) Tech is deflationary by nature. \n\n3) Increased productivity.\n\n4) Current inflationary trends are caused by supply issues not demand issues.", "score": 70, "replies": [{"body": "As someone with a bit inside knowledge in some areas, the initial inflation was in some products due to supply issues (container prices went up 10x) now it's just bullshit.\n\nCompanies are increasing their profit margins (maybe not in all areas but definitely happening in a lot of areas)", "score": 18, "replies": [{"body": "It most certainly is not bullshit. US consumption of durable goods is up like 44% since 2019.", "score": 19, "replies": [{"body": "I also did hear they couldnt hire enough truck drivers 6 months ago, due to wages.  Which sounds like inflation to me.\n\nLook at trucker shortages 6 months ago, they were predicting increased prices.  Nobody wants crap wages that cant even match cost of living.", "score": 1, "replies": [{"body": "Truckers have never made 'shit wages'", "score": 2, "replies": [{"body": "The shortage is what, because the wages are so good and have kept up with inflation?", "score": 0, "replies": [{"body": "Everyone on earth heard about how truckers were going to be automated.", "score": 2, "replies": []}]}]}]}]}, {"body": "This is what I see happening if it’s not across the board. Once a company is used to charging x there is very little incentive to drop the price back down to y. \n\nThat and make up for any potential lost rev during the first few months when everything was locked down", "score": -1, "replies": [{"body": "Depends on competition/substitutes.", "score": 1, "replies": []}]}, {"body": "Why are companies suddenly choosing to gouge consumers for greater profit margins? Explain the timing. Otherwise, I'm going to go with massive increased demand for durable goods, labor shortage, money printing, and global pandemic", "score": 1, "replies": []}]}, {"body": "Can you explain what you mean by tech is deflationary by nature?", "score": 2, "replies": [{"body": "Tech puts pressure on wages by increasing productivity. More productivity reduces labor demand.", "score": 18, "replies": [{"body": "I don't find that explanation fully convincing. Tech also literally invents new ways for consumers to spend money which didn't previously exist. And it increases the efficiency of existing consumerism.", "score": 4, "replies": []}]}]}, {"body": "1. That could mean they will start spending more and overall production will be reduced. Both feed inflation. Gen X are in their 50s so they are far from retirement. \n\n4. The supply issues are caused by record setti g levels of demand which supply is struggling to keep up with.", "score": 1, "replies": [{"body": "A majority of people in retirement will spend less than when they were in the labor force. This decreases the velocity of money. Production doesn't take a hit because technology makes everything more efficient. Everything feeds in to each other.\n\nAnd for your 2nd point, if you listen to any of the recent earnings calls (a good example is apple), most CEOs state that supply chain issues are what's bottle capping production. Demand is strong but it isn't surging enough to be the main driver of inflation. https://www.reuters.com/technology/apple-results-hit-by-supply-chain-woes-cook-says-holiday-quarter-impact-will-be-2021-10-28/", "score": 1, "replies": [{"body": "> A majority of people in retirement will spend less than when they were in the labor force. This decreases the velocity of money. Production doesn't take a hit because technology makes everything more efficient. Everything feeds in to each other.\n\nWhat kind of clown ass world are you living in where magic words like \"technology\" make up for the productive capacity of people retiring? People have retired, meaning they aren't producing shit and instead only consuming. That's inflationary. Demographics aren't on our side either with Baby Boomers set to exhaust the Social Security fund and eat up the savings of all generations. On top of that many of them have an unfunded pension fund to draw on. \n\n> And for your 2nd point, if you listen to any of the recent earnings calls (a good example is apple), most CEOs state that supply chain issues are what's bottle capping production. \n\nBecause supply is struggling to keep up with the increased demand. Every CEO is saying that they are seeing strong demand for their product and supply is struggling to keep up causing supply chain issues. \n\nPeople have a ton of money saved up and they can't spend it because the supply of everything is being bought up at inflated prices. As long as prices keep going up we won't find the bottom of the value of the dollar.", "score": 1, "replies": [{"body": "We can agree to disagree. This will be my last comment on it. \n\n1) Technological advancements increase a workers productivity multiple times greater than the loss of individuals in the work force due to retirement. An example: How much faster can we build cars now? What causes us to build a car so much faster now than the 1930's. Even if you account population growth (123M in the 1930's vs 331M in the 2020's). Its not like we only build a car 3x as fast. \n\n2) Supply constraints are the main driver of inflation. In normal times, business would be able to produce enough to meet demand. But due to covid, several factories have been shut down for a period of time (AAPL, NKE, TSLA, etc). That's not a demand problem, that's a supply problem.", "score": 3, "replies": [{"body": "1. Technological advancement take time, the money printer doesn't. It can double the money supply overnight. Musk tried to build a fully automated factory, he failed and had to hire workers. Technology isn't magically going to make up for a 4% drop in the labor force. \n\n2. Supply constraints for luxuries don't cause inflation on their own. The supply of iphones in Ghana is nonexistent and it doesn't impact inflation there at all. Inflation is caused by demand exceeding supply. The demand for iphones is high because US consumers are flush with cash.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Not sure if you tuned into the most recent FOMC but rates will be rising", "score": 25, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "I certainly haven't seen anything go back down. Cost more for less. Prices will never go down when there's opportunities to raise them!", "score": 2, "replies": []}]}, {"body": "Yeah...  Number 4.\n\nWhile I don't generally disagree with your premise, the increase in wages is an illusion. While some industries like fast food, retail,  and others at the low end of the scale appear to be paying more,  others are scaling back. \n\nIn the current political climate where thousands of immigrants are being allowed in those people will take low wage jobs and be happy to have them. Many skilled jobs in tech, like IT and engineering, are being taken by Indian and other\n immigrants for less than market wages. \n\nThe other side of the coin is the government spending money that doesn't exist at a rate that would embarrass a drunken sailor. With the current expansion in money supply I could see crazy inflation.  \n\nWhich wins?  I haven't a clue. I tend to come down on the inflation side though unless govt gets control of spending.", "score": 16, "replies": [{"body": "> Many skilled jobs in tech, like IT and engineering, are being taken by Indian and other immigrants for less than market wages.\n\nThere's still a shortage of skilled workers, though. There's a reason tech salaries have rocketed this year.", "score": 12, "replies": []}, {"body": "Demand for tech skills are as high as ever.  It's almost impossible to hire people - immigrant or no.  There've already been decades of high-skilled immigration - what would make your thesis any different than 10 or 20 years ago, when IT wages were relatively high (relative to rest of salaries)?", "score": 5, "replies": [{"body": "Been out of the hiring loop for a while and never was in it for IT but other tech like some engineering they just aren't paying.", "score": 1, "replies": [{"body": "Tech has been crazy last couple years. 200k plus is easy to find", "score": 2, "replies": []}]}]}, {"body": "The immigrant piece is why we’re so job constrained right now. They aren’t taking the low wage jobs and Americans don’t want them either. That of course will change but atm we need immigrants", "score": 3, "replies": []}]}, {"body": "This post seems a year late right now, would be more accurate to say what will happen with unemployment benefits &child tax credits ending, stimulus payments gone, interest rates rising, student loans restarting etc…\nAlso the ports are fully open again & I saw a headline recently about the semiconductor “glut” we’ll see next year (not sure if I believe that one). I know lumber has come down a lot since summer.", "score": 3, "replies": []}, {"body": "The things you are missing. \n\n1. Age demographics and how impacting growth.\n2. Other population growth rate factors such as immigration and natural births.\n3. All that savings erodes if not spend now.\n\n\nAt end of day, it is all inconsequential and a drop in the bucket compared to the risks in debt financing.  As long as the world values our debt the demographics still point at long term slow growth.  \n\nInflation will ebb as companies compete. Right now they are leaving crap tons of profit on the table because they can not get what they need to produce and sell.", "score": 2, "replies": [{"body": "Saw an interesting story yesterday that the past year the US had its lowest population growth (0.1%) ever in history. Covid deaths + nobody is having kids + slowing immigration = stagnant growth, rising wages, & help wanted signs. Seems like we’re heading toward a Europe/Japan kind of economy.", "score": 2, "replies": [{"body": "Almost flat, which is pretty amazing.  All the neo-gold bugs of course are pushing fiat collapse, however, not one can give a model that quantifies the amount of debt the US would have to put out for the world to abandon the $.\n\nMore likely we establish a new level of debt.  In the GWB era half a trillion.  The great recession got us to over $1T, which was back down the 1/2 trillion by end of Obama's term and the GOP brought back to $1T in 2019.  The pandemic then gets us in the $3T to $4T range. Little over $1T to $1.5 will be the new norm. Bowever, there was never a credit reset in the pandemic recession so a recession is a significant risk in next few years.\n\nIf  that happens we get the credit reset and the systemic low growth due to the demographics becomes the main narrative again.", "score": 3, "replies": []}]}]}, {"body": "The tracking of inflation is just comparing a bunch of prices to the level they were at a year ago. So even if prices leveled off right now, they will still report price inflation for another 10 months.\n\nGovernment statistics are behind reality. We the people have been feeling the effects of inflation all year. But it is just now being recognized as official news.\n\nI could argue with some of your stats and assumptions but it doesn't matter. Inflation numbers will look bad for at least one year. The winners in the stock market will be the ones who recognize when inflation ends before it becomes official news, and buy non-tech stocks when they are cheap.", "score": 2, "replies": []}, {"body": "A lot of the factors you listed have already been in place for years, or are temporary in nature, or not likely.  For examnple, the savings rate has dropped back down to more normal levels already.\n\nThe only unusual one that may drive inflation is a continued problem with getting labor, which could drive up salaries and inflation.  However, even with that part of the shortage is temporary as manufacturers are trying to get inventories back up, and when they get back up they will not need as much labor for manufacturing or logistics.", "score": 2, "replies": []}, {"body": "Margin debt at all time highs makes things a bit unstable, so if monetary/fiscal policy fails to prop things up, there could be a crash on certain asset classes that would translate to reduced rent & consumer prices. Quite uncertain though", "score": 3, "replies": [{"body": "Student loans are likely going to be the cause. People are not going to pay this back, and it’s a significant amount of debt", "score": 0, "replies": []}]}, {"body": "> 1. An increase in the currently record low velocity of money\n\nYou make this sound like it has to happen. Look at the velocity of money for the last 20 years, it's a constant downtrend. Now the trend could obviously switch, but you need to look at why it's happening. All of this new money is not going to the average consumer. If you compare the money supply increase and the velocity decrease you can understand why most economists point to supply chain issues rather than money supply issues.", "score": 3, "replies": []}, {"body": "You also listed a lot of temporary things. \n\nSince inflation is the increase in prices, I actually think we will drop back to a more reasonable level especially if the Fed increases interest rates. So even if we have higher wages, more disposable income, high oil prices, increase in public spending, shortages of goods today, that would have to increase from todays levels to cause more inflation.", "score": 2, "replies": [{"body": "Their increases are like 0.25%.  Its like putting a wet paper towel on a house fire.", "score": 1, "replies": []}]}, {"body": "Printing 35% of monetary supply did what? no way. that did not cause inflation. its not like Venezuela", "score": 2, "replies": []}, {"body": "I think your first point is the only one that matters. Interest rate returning to about 5%would kill inflation. You just gotta stop people spending.", "score": 1, "replies": []}, {"body": "Stagflation is indeed a worry.", "score": 0, "replies": [{"body": "Japanization", "score": 2, "replies": [{"body": "Japan has no inflation, and it kinda terrifies their government.", "score": 2, "replies": [{"body": "They are good with money.  They are clean, polite, and good with money, basically the opposite of most people.", "score": 3, "replies": []}]}]}, {"body": "The economy is booming , i am not worried about stagflation at all.", "score": 2, "replies": []}]}, {"body": "Global trade and flow of goods will, as it has for 20 years, capitalise in any price arbitrage across borders. Add productivity.", "score": 1, "replies": []}, {"body": "r/collapse", "score": 0, "replies": [{"body": "Technically correct. The best kind of correct.", "score": 2, "replies": []}]}, {"body": "About half of these are the same thing as a different number, of 99% just a result of a different number.\n\nAlso, almost all of these are perfectly fine reasons there is inflation right now, your only real reasoning for your premise of \"inflation will remain high for years\" is 'I don't see it going down soon'", "score": 0, "replies": []}, {"body": ">remain high for years\n\nMy response depends on what you mean by this. Do you mean inflation might exist for another 1-2 years? Or do you mean it's going to be like 5-10 years?\n\n1-2 years is definitely possible. Like look at your own car example. Are people suddenly going to need 4 or 5 cars? No. Once they get their car they're good for a few years. It's just pent up demand plus chip shortages. It's nothing permanent.", "score": 0, "replies": []}, {"body": "I’m sorry did you say low unemployment? Please stores and machine shops and manufacturers are going out of business. Hell even fast food places are about to close.", "score": -3, "replies": [{"body": "Realistically the country is at full employment. Who is about to go out of business?", "score": 2, "replies": [{"body": "My guy people have been going out of business. I’m Georgia alone the biggest supply chain for industrial vehicle parts just closed up. Every store is under staffed af and store hours have changed to where they’re barely open because there’s no one to work the hours. Drive throughs no longer support drive through and you have to walk inside because there’s only one person to work. Packages are coming extremely late via mail and back orders are not being fulfilled and expected to be filled in half a year just to be pushed again. It’s horrible and it’s impossible to say we at low unemployment.", "score": 0, "replies": [{"body": "Didn’t you just describe extremely low unemployment? There’s nobody left for these places to hire to replace all the “great resignation” early retirements…", "score": 3, "replies": [{"body": "… no I described really high unemployment. Government paying for peoples unemployment and having less open jobs because no one wants to work doesn’t mean low unemployment", "score": 1, "replies": [{"body": "Okay, it’s the complete opposite in MI. There are tons of open jobs here everywhere you look, and our state ended the unemployment subsidies about a year ago. We have historically low unemployment here now.", "score": 1, "replies": [{"body": "You have tons of open jobs. Meaning there’s a ton of people missing though that used to be there. Competition is rising in order to get people away from their homes. People who are collecting benefits. The I my way I can see the government claiming all time lows, is if they’re saying the people they pay are “hired” by the government. And it’s not far fetch as I formation form the government has historically been fudged from both republican and democrats .\n\nHere in Ga we are very very behind because not enough workers. I have to travel a lot across ga and call into Alabama and Tennessee quite often just to get work done because there’s not enough people to fill the usual demand.", "score": 1, "replies": [{"body": "The problem here is communication. The government publishes unemployment figures. There are multiple problems with their -definition- of unemployment.  First, if someone does not FILE for unemployment then they are not counted in the ranks of the unemployed, regardless of true status. Second, anyone who has filed for longer than 6 months is no longer included in the stats of the unemployed.\n\nDon't take my word for it, look it up for yourself.", "score": 1, "replies": [{"body": "Ah see that makes way more sense. I know first hand that there is less people working. But I do see how the communication being portrait makes it seem like there’s less unemployed. \n\nI’m just confused how people are not experiencing the shortages across the nation. It’s not any one particular industry . It’s people and supply and manufacturing.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Can you explain how you managed to not even list the one actual reason for all this? You can safely discard any of your points that suggest people have more money now.", "score": -1, "replies": [{"body": "Well, most of it is common sense if you read the news. Low interest rates, more tax credits for families, higher wages, high oil prices, shortages, a higher national deficit leading to more government interest payments and the \"crowding out\" effect, and let's not forget more natural disasters that continually get worse.", "score": 2, "replies": []}]}, {"body": "Meet Kevin says it’s gonna be the frugal decade", "score": -4, "replies": [{"body": "Wasn’t that the last decade?!?", "score": 7, "replies": []}, {"body": "Meet Kevin is an idiot getting rich off his bigger idiot followers.", "score": 7, "replies": [{"body": "Says u", "score": -4, "replies": [{"body": "Yes, that’s how comments work. Glad you figured it out.", "score": 10, "replies": [{"body": "Ur stupid bro stfu please", "score": -6, "replies": [{"body": "Hmm….\n\n\nNo.", "score": 9, "replies": [{"body": "Ur a fukin loser lmfao\n\nFind something more productive to do with your time", "score": -6, "replies": [{"body": "I’m fine with this.", "score": 7, "replies": []}]}]}]}]}]}]}]}, {"body": "+ The share of US dollar reserves held by central banks is  falling.  \n\nBasically due to reasons explained by op central banks of other countries are going to reduce share of USD.", "score": 1, "replies": []}, {"body": "One good economist in Fed chair and inflation deflates slowly in few years.", "score": 1, "replies": []}, {"body": "I’m not really an expert on this but my question is from 2010-2020 the fed tried to stimulate the economy which as you said is understood to cause inflation. However inflation never showed up till 2021… so what gives? Maybe the inflation triggers we’ve believed for 50 years aren’t right or something else is happening. I don’t have any good theories. What I do know is pent demand is about to get crushed because a good amount of people are worried about covid. Oil fell hard from the oct high retail sales down last week. It’s not a trend but feels like a switch from constrained to over supply. 100% just my opinion", "score": 1, "replies": [{"body": "What gives is they did an excellent job at controlling growth and keeping the US economy on track for a decade. COVID came along and fucked up the best laid plans of mice and men.", "score": 1, "replies": [{"body": "Maybe. I follow people who complain about both sides of this and each is convinced the other is wrong. So I’m assuming they’re all idiots but maybe someone figured it all out", "score": 1, "replies": []}]}]}, {"body": "Jesus everyone posting in this sub with minor macro knowledge thinks they’re the next federal reserve chairman", "score": 1, "replies": []}, {"body": "There’s nothing wrong with your analysis.    The problem, as always, is an assumption that low inflation is an objective.", "score": 1, "replies": []}]}
