{"title": "Will anyone buy snapchat?", "selftext": "I mean 200 million active users, a popular brand, a decent( lets be honest needs improvement app). If the stock continues to fall could a big player ($match) ($FB)(GOOGL) be willing to buy it. I mean google just shut down google plus and should be looking for something like snapchat to fill that void. After this stabilizes i would long for the buyout.", "id": "9muerz", "created_utc": 1539129169.0, "score": 30, "upvote_ratio": 0.92, "num_comments": 76, "comments": [{"body": "Pornhub should buy it and replace all the shitty news articles and semi-attractive thots with 10 second porn vids (aka time to finish twice)", "score": 42, "replies": []}, {"body": "I never see anyone ripping snap mention their explosive revenue growth over the last 2 years. They’re approaching a fair valuation after bringing in about $250m last quarter. They need to shitcan some employees to cut expenses. No way snap should have over 3k employees. ", "score": 40, "replies": [{"body": "I read somewhere they burn 1B a year", "score": 17, "replies": [{"body": "A lot of their net losses on the books the last 2 years were due to stock compensation to their fag executives. ", "score": 10, "replies": [{"body": "Doesn't that tell you anything about the company? ", "score": 17, "replies": [{"body": "Not sitting here saying snap is a great company. Just saying the revenue numbers are way up Q over Q. Take from it what you like. ", "score": 5, "replies": [{"body": "I get what your saying. Thanks for the input. Didn't mean to come off as an ass", "score": 5, "replies": []}, {"body": "Trend, though, is slowing.  Plus last Qs rev increase largely due to increase in ARPU for users in \"Rest of World\" - which, as conf call suggests, they weren't expecting.\n\nOne thing I took away from conf call transcript is that, despite saying repeatedly that they wouldn't issue guidance on MAUs for 3Q, they said that previous years had shown 3Q MAUs usually showed a decline.  Simple look at numbers shows this isn't true - so my belief is that they were trying to prep analysts with excuses for numbers they already knew were bad.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 30, "replies": [{"body": "It really comes down to how much the userbase is worth.", "score": 11, "replies": [{"body": "Does it, tho?    \n     \nFB didn't buy MySpace.    \n      \nAlso, many remaining SNAP users are the same people who don't want to support FB for \"moral\" reasons. Those people won't support a behemoth like GOOG, AAPL, MSFT or AMZN.     \n     \nI think Instagram will just keep poaching features and better implement them, and they'll slowly suck away SNAP users until it hits a tipping point when SNAP has so few users that the few remaining will just see it as pointless. <-- that's an Adderall-long sentence.", "score": 18, "replies": []}, {"body": ">ly comes down to how much the userbase \n\nya 200 million should be worth 3$ a share, +snapchats name", "score": 1, "replies": [{"body": "Ouch.  200m *$3 = $600m.  Plus brand name - assume $800m (goodwill + intangibles from 2017 BS - which is surely the most it can be).  Total = $1400m.  1.28bn shares outstanding means $1.09 share price.  Brutal.", "score": 3, "replies": [{"body": "From a book value perspective, we could also just wait for their cash & marketable securities balance to get below $1B", "score": 1, "replies": []}]}]}, {"body": "The DAU is dropping very fast already. Its depreciating in value every day. Thats not a user base you want and all those tech companies know this. ", "score": 1, "replies": []}]}, {"body": "What about customer/use acquisition? Yeah, Facebook and google can make it, but will their users use it? I won’t. I use Snapchat groups to talk to my college friends and send memes every day. We aren’t going to switch over to another platform and neither will a large part of the user base. \n\nThe value in buying SNAP is not their shitty app used to send nudes to each other. It’s the huge customer base they have. ", "score": 2, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "You’re absolutely right. But having a large tech company come in and make it better would bring some users back. But starting with millions and millions of users is better than starting with nothing. ", "score": 0, "replies": [{"body": "There is not guarantee users would come back. Users already left because of the recent crappy redesign. Even more change could be alienating to its current base and further decay its user base. ", "score": 1, "replies": []}, {"body": "This is not true at all. Show me a single instance where a company bought a platform similar to snap thats has DAU rapidly falling and fixed it. It never works. ", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "IGs is not growing. Read the news", "score": 0, "replies": [{"body": "Yes it is. You're the one that needs to read the news. \n\nhttps://www.google.com/amp/s/techcrunch.com/2018/06/20/instagram-1-billion-users/amp/\n\nArticle is from 4 months back but they added 200mil users from 2017. There has been no news since saying that it has stopped growing.", "score": 1, "replies": []}, {"body": "Lol yes it is. ", "score": 1, "replies": []}]}]}]}]}, {"body": "Facebook already gave them an offer and they turned it down, the CEO seems to be the kind of guy who feels the need to run the show. Possibly if the CEO were to put his ego in check they might, I think they would be a strong acquisition because of the audience they have the biggest problem Snapchat faces is monetization, nobody can figure out how to make money from it because it is a glorified text message app that uses pictures instead of text, once that problem is solved a buyout will be likely imo.", "score": 12, "replies": [{"body": ">ney from it because it is a glorified text message app that uses pictures instead of te\n\nI mean even wall street has a sigh saying follow us on snapchat. Its not worth 8 billion but the brand+userbase alone should be worth closer to 3-4 billion", "score": 1, "replies": []}]}, {"body": "I am more worried of a private equity fund/business coming out of fucking nowhere and offering to buy it. All it really takes is news or “leaked” whispers of a buyout for SNAP to pop up and put holders (including myself) to get fucked. But SNAP founder and CEO seems like the guy that would rather ride it into the ground while trying to save it slowly before he let’s someone buy it out if, if that ever happens. ", "score": 12, "replies": [{"body": ">d CEO seems like the guy that would rather ride it into the ground while trying to save it slowly before he let’s so\n\nStill the guy has a board, plus wsb are asking for puts and wsb is known to get fucked", "score": 3, "replies": []}]}, {"body": "They have no clear way of monetizing nor diversifying and the Zucc will want to make Evan Spiegel pay for his insolence. \n", "score": 7, "replies": [{"body": "still a huge database of faces, 200million (young) users, a brand name. if it falls more to 4 billion Zucc might do it to stay hip.(and maybe get those privacy investigations off peoples mind)", "score": 1, "replies": [{"body": "Zucc has instagram he doesn’t need snap to stay hip. He bought IG for $1billion you think he will spend 4times that on Snapchat? ", "score": 8, "replies": []}, {"body": "I only see Amazon as a potential buyer, if they decide to do the whole social media thing...which I see as dying and will probably be surpassed by something else new.", "score": 2, "replies": []}]}]}, {"body": "I honesty believe so, its literally the only competition to FB i dont know why google or apple wouldn't want it. Could be a replacement for Google plus.  ", "score": 9, "replies": [{"body": "Google was once rumored to of floated a 30 billion dollar offer. My bet is that FB or Google will buy this company at some point however. As most corporate giants do... If you say no to a good offer, they will make sure you pay for your mistake. With that being said, I think they will offer a buyout once the market cap reaches a 1/6 of Google's original offer. So a 5 billion dollar valuation. The saudi's are probably hoping for sooner rather than later. I am all in for roasting marshmallows on this company that just burns through cash. \n\nI was previously short Snapchat with a series of September October and November put options at $8 strikes. I purchased in late August. I have since closed my positions.\n\nI'm not an analyst so don't take my advice. This is just my views.", "score": 17, "replies": [{"body": "google is fucking retarded with investing capital in other companies\n\nthey overpaid for JD by a fucking mile.", "score": 10, "replies": [{"body": "Google owns jd.com??", "score": 2, "replies": [{"body": "Took a 500m cash investment in JD at like $40 something a share lol", "score": 4, "replies": [{"body": "They must have been crowd sourcing wsb before making that decision 😂", "score": 2, "replies": []}]}]}]}, {"body": "Since analysts usually suck, we will take your advice ", "score": 18, "replies": []}, {"body": "Nov and Jan $8 puts here. Closing my positions tomorrow morning. 180% is good enough for me. ", "score": 1, "replies": []}]}, {"body": "Fb tried and got rejected. Zuck is mad and that why he stolen every snap feature and made it better", "score": 8, "replies": [{"body": "Exactly, so thats why google or apple should want it for the name alone.  ", "score": 2, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "That time is soon my friend ", "score": 1, "replies": [{"body": "Or maybe in the near future when Snap is $2 and maybe after Q4 when the buyers have revenue to spare. \n\n", "score": 1, "replies": [{"body": "I bet $5.  Falling to $2 is too dangerous ", "score": 1, "replies": [{"body": "That's fine my puts will be over by then", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I mean WSB are autistically buying puts and shorts, so the only chance for r/wsb to get fucked is a buyout. So based on previous events its going to happen", "score": 14, "replies": [{"body": "With the amount of funding snap got from angel investors no way they let it fail.  ", "score": 5, "replies": [{"body": ">unding snap got from angel investors n\n\nAny details?\n\n&#x200B;", "score": 3, "replies": [{"body": "www.forbes.com/sites/alexkonrad/2017/02/02/snap-ipo-means-big-windfall-for-early-snapchat-investors/amp/\n\nThose dudes already made bank but im sure they want more ", "score": 2, "replies": [{"body": "Leaked reports also mentioned insiders have been selling their shares this past week according to some Twitter users. ", "score": 2, "replies": [{"body": "Can you find that link?", "score": 1, "replies": [{"body": "[I think this is what you're looking for.](https://www.youtube.com/watch?v=dQw4w9WgXcQ)", "score": 7, "replies": [{"body": "Wow can't believe you found it.  Thanks.", "score": 3, "replies": []}]}, {"body": "http://imgur.com/a/Y8kfInP\n\nThere's the supposed image / report going around ", "score": 5, "replies": []}]}]}]}]}]}, {"body": "This is what I am most worried about. Maybe I will close my puts tomorrow. 🤔 ", "score": 1, "replies": []}]}]}, {"body": "I doubt it’ll be google and FB doesn’t need it.", "score": 2, "replies": [{"body": "what about ($match) at my college its eccentrically a dating app already", "score": 1, "replies": [{"body": "I haven’t used tinder in forever but isn’t there stories now and has facebook and instagram integrated. That play would vastly fuck them.", "score": 2, "replies": [{"body": "Tinder had stories back in 2014, then shitcanned them for some reason.", "score": 1, "replies": []}]}]}]}, {"body": "What would they get from it? Noodz and a shitty app?", "score": 2, "replies": [{"body": "200 million users, brand, ", "score": -2, "replies": [{"body": "“Brand”, what do you think the sentiment of this brand is. Just look at its value from the time it IPOd", "score": 2, "replies": [{"body": "every teenager uses snapchat for one reason or another. all the girls use it so they don’t have to give guys their phone number and so guys can’t screenshot the nudes without them knowing. ", "score": 0, "replies": [{"body": "Right, so the whole company is relying on teenagers to make money. ", "score": 3, "replies": [{"body": "well now that you say that... i get it why they’re a dying company now. ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "No, because that number of DAU and MAU doesnt mean shit to me.  I think that even if people are still using it daily, its nowhere near the amount of time in the app that it was before. \n\nSnapchat is the next myplace. Once a better platform comes along, this thing is ding-dong-dead. ", "score": 1, "replies": [{"body": "MAU is gonna matter when next earnings we find out that their negative user growth is accelerating. The buyout risk for shorts is very real though, the app might be garbage but the brand has staying power.", "score": 1, "replies": []}]}, {"body": "Thinking of buying a leap just in case. ", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "Me after the Saudis sell", "score": 1, "replies": []}, {"body": "I picked up a Snap call for $7 Nov 16. It cost me $77 so fuck it. Earnings is gonna be nuts and if there is a hint of positivity, it will squeeze the shorts and moon! If not, at least I won’t have weak hands as it dies quickly.", "score": 1, "replies": []}, {"body": "What happens if you have options and the underlying gets bought out?", "score": 1, "replies": [{"body": "You lose everything", "score": 1, "replies": []}]}, {"body": "The app for Android is bad like it'll say sent for me for about 8 hours and all of a sudden it'll say opened 8 hours ago so I need to text them to ask if they received what I sent them, since most of the time it's making plans and stuff ", "score": 1, "replies": []}, {"body": "It doesn't have 200 mill users. It peaked at 191 and now its dropping. Last quarter it was 188 and I would expect it close to 185 at least in the next earnings. The only parts its popular for are the parts you can't monetize. If it is bought out it won't even be close to the current value. That would value it it still at 8 bill. At best they would be looking at a 500 mill valuation which puts the stock under a dollar. So going long on a buy out is a horrible idea. ", "score": 1, "replies": []}, {"body": "Lord Bezos will save the day and bring snap to life. LONG SNAP", "score": 1, "replies": [{"body": "#burn baby burn", "score": 1, "replies": []}]}, {"body": "With the way he structured the stock i dont see it happening, but i can see google buying it since they just shut down Google+", "score": 0, "replies": []}]}
