{"title": "TSLA beats Q3 delivery expectations", "selftext": "\"Tesla Inc. reported third-quarter deliveries of 83,500 vehicles, including the delivery of 55,840 Model 3 vehicles that beat the FactSet consensus of 55,600 vehicles.\"\n\nThe guidance for Q3 Model 3 deliveries was 50,000 - 55,000 and Electrek estimated Q3 deliveries at 53,000, so Tesla topped all of these.\n\n[https://www.marketwatch.com/story/tesla-beats-delivery-expectations-for-model-3-model-s-and-model-x-vehicles-2018-10-02?mod=newsviewer\\_click](https://www.marketwatch.com/story/tesla-beats-delivery-expectations-for-model-3-model-s-and-model-x-vehicles-2018-10-02?mod=newsviewer_click)", "id": "9kqgmc", "created_utc": 1538485790.0, "score": 184, "upvote_ratio": 0.93, "num_comments": 78, "comments": [{"body": "Yeah this makes sense my town has gone from a single model s to a combination of about 15. ", "score": 13, "replies": []}, {"body": "Lol, and WSJ writes a whole different story...\n\nhttps://www.wsj.com/articles/tesla-produced-80-142-vehicles-in-third-quarter-1538484764\n\nWhich one is right? \n\nImho Tesla did good this quarter, especially when MOST people didn’t think they can meet their goal. Still a rocky road ahead tho", "score": 43, "replies": [{"body": "It’s been rocky for Tesla the whole time. They have a fantastic product though and are improving in the right categories, like production. ", "score": 23, "replies": []}, {"body": "Yeah, I don’t get it.\n\nHere’s the source of all: http://ir.tesla.com/news-releases/news-release-details/tesla-q3-2018-vehicle-production-and-deliveries\n", "score": 2, "replies": [{"body": "tl;dr: WSJ editor had wrong facts and had an order to write a negative piece. He said Tesla did not deliver as expected, and then when he corrected himself (from 56 000 to 55600) he realised the paragraph (and maybe more) didn't make sense, and updated the article.\n\nThe correction details only have to mention the factual inconsistencies, and now the article sounds weird, as they did reach the company goal, and even the FactSet goal (which i don't understand why it matters what the \"analysts consensus\" has to do with it.)", "score": 6, "replies": []}]}, {"body": "Neither, no one really knows. ", "score": 1, "replies": []}, {"body": "I don't see any differences in numbers reported. I think you confused production and delivery numbers maybe?", "score": 1, "replies": [{"body": "The article has been corrected now:\n\n\"**Corrections & Amplifications**FactSet estimated Tesla would deliver 55,600 Model 3 sedans in the third quarter and 80,000 total vehicles. An earlier version of this article incorrectly used an early estimate from FactSet predicting deliveries of 56,000 Model 3s and 82,000 total. (Oct. 2, 2018)\"\n\n&#x200B;\n\nI just read the news and then saw this post, and noticed the discrepancy. Also, the article had a completely different tone, when he was saying that they have failed to reach the analyst forecast. So it was not only the number wrong, but the spin of the story. It was amusing that the article was negative while it said that Tesla failed to reach the goal set by some other analysts, while they reached their own projected goal.\n\n&#x200B;\n\nthis has been altered : \"Tesla delivered 55,849 Model 3s during the period, slightly above the latest analyst consensus forecast of 55,600, which was lowered recently from 56,000 ahead of the auto maker releasing its figures. \"\n\n&#x200B;\n\nBefore it was more like: \"tesla failed to deliver\" - Also, Tesla has delivered even more than they were saying that they will be making, but somehow WSJ still managed to give it a bad spin. \"analysts consensus\" - another lol, \"you have failed to reach the goal which someone else kinda estimated and then also changed. you have reached your own goal, but we're not gonna talk about that because the trendy thing is to shit on your company\"", "score": 9, "replies": [{"body": "I see, thanks for digging into this. Looks like a rather careful attempt at price manipulation, I'll give them that :).", "score": 3, "replies": [{"body": "It was a pretty confusing morning with these two conflicting news articles. And yes, initially I thought I'm mistaken and I went back and forth a bunch of times. ", "score": 2, "replies": []}]}]}]}]}, {"body": "Also the Electrek estimate for total Q3 deliveries was 80,000, so this one was topped as well.", "score": 11, "replies": []}, {"body": "q3 earnings should be significant, right?", "score": 3, "replies": [{"body": "Profitable Q3 might not be enough to move SP up significantly, but I think if both Q3 and Q4 are profitable, then it might have a chance to considerably weaken bearish thesis, drive SP up and cause a minor short squeeze.", "score": 1, "replies": []}]}, {"body": "I have a strong suspicion that Tesla cooking the books.. you don’t have 2 different CFOs resign within months, and then miraculously hit your numbers without some cooking", "score": 2, "replies": []}, {"body": "Supposedly they exited Q2 with a burst rate of 5k/M3’s per week, yet in Q3 they averaged just 4,095/week.\n\nTons of reports that deliveries keep getting rescheduled at last minute and that an abnormal % of vehicles require rework upon delivery. \n\nIMO they are pushing cars out the factory gate that are not ready to deliver. Instead of fixing on the line or before shipping, they are shipping them out and trying to get the work done remotely or after delivery. It’s a hot mess. \n\nCompany running about break even with high end ASP’s that will only come down as base model M3’s start being built. \n\nCompany is not in good shape and still deep in the woods. Their ability to turn the corner is very much in the hands of capital/debt markets. ", "score": 2, "replies": [{"body": "FYI Weekly rate was down due to switching all the lines to AWD (added complexity, double the amount of drive motors) towards the end of the quarter.\n\nI bet that move was made to max out profits per car to achieve promised profitability.", "score": 2, "replies": [{"body": "And then what? ASPs will fall as fast as margin gains from higher production rate. They can’t make money ", "score": -1, "replies": []}]}]}, {"body": "Cue the haters.\n\n“GM sells more cars”\n\n“But they’re not profitable”\n\n“Can’t wait for x company to come out with their electric car” \n\n“They have debt coming due”", "score": -19, "replies": [{"body": "These are super important points for people who actually should be posting in a sub called /r/stockmarket", "score": 40, "replies": [{"body": "[deleted]", "score": 24, "replies": [{"body": "[deleted]", "score": 20, "replies": [{"body": "Tesla is a young company. I suspect you have no clue of what you are talking about.\n\nIn another comment below you sound a bit emotional. Are you ok?", "score": -12, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "He does have a “gunslinger” attitude which is also part of his appeal to the masses. Very Smart people are likely to make dumb mistakes, and going forward he should learn from these moments.\n\nIt’s still a young company, even if it was started in 2003, it took a long time for tesla to bounce back and re-evaluate their strategy. I remember the wanted to just fix an electric engine on a Smart frame which sounds exactly like a bro-startup hustling their way in an industry they didn’t knew sh1ft about. Heck, even recently they had to learn that automation in the assembly line is not such an easy thing to do (computer scientists are always under estimating everything). But they learn fast, they adapt and they are honest and transparent.\n\nIt’s definitely more complex than just calling him a baby (which should actually be a compliment given the learning capacity that babies have :D ). And I called it an emotional response because in the same sentence you shown your disappointment to the current orange presiding the land of the free).\n\nBut thx for the explainer, it’s good to see not all internet discussions degenerate in rage wars :D and we can keep it civil and interesting.\n\n", "score": 0, "replies": [{"body": "Calling your comment interesting is a stretch.", "score": 0, "replies": [{"body": "Calling your comment unnecessary isn’t a stretch though(:", "score": 2, "replies": []}, {"body": "I’m calling the discussion interesting. Pay attention.", "score": 1, "replies": []}]}]}]}, {"body": "Bro, this about valuations.  Do you think a brand new company that is incredibly negative in cash flow should be valued as high as the largest auto producers in the world?", "score": 7, "replies": [{"body": "I agree, it is overvalued currently because of the marketing and sensationalist news cycles(which seem to have turned). Same as Apple, Amazon, Nvidia, Amd .... get my point? \n\nBtw:from today’s Pro Rata newsletter “Eighty-three percent of U.S. IPOs this year have involved unprofitable issuers, which represents an all-time high, according to data from University of Florida finance professor Jay Ritter (first reported by the WSJ).\n\nThat on its own isn't necessarily worrisome, until you realize the previous record was in 2000 (81%).”\n\nI am still trying to read and decide on the “does this look like a bubble” argumentation.\n\nBack to tsla:\n\nI do think it’s a high risk stock, and def bad as a short term investment. Long term I am confident that it will grow rapidly, especially after hearing how he talks about creating a product people love. It reminded me a lot of a young Steve Jobs, and even if he was a difficult dick, he still got results. ", "score": 1, "replies": []}]}]}]}, {"body": "It’s a new car company. Once production is in full swing it would be a more valid point to bring up.\n\nStarting a new car company and setting up a network of charging stations is a huge undertaking.\n\nGM selling more cars is another basic point that’s irrelevant. How many cars are they going to sell going forward and will it be more or less than today?", "score": -1, "replies": [{"body": "Listen, either GM is grossly undervalued or TSLA is grossly overvalued.  Both will exist in the future, but \"startup\" car companies don't warrant 50bil valuations, IMO.", "score": 5, "replies": []}]}]}, {"body": "Agree, it's important to carefully consider both bullish and bearish thesis when making investment decisions. For Tesla, however, being one of the top shorted stocks, any positive news are always met with a crowd of haters with comments completely unrelated to the topic being discussed, so /u/pregnanttrump's comment is valid.", "score": 2, "replies": [{"body": "Positive news for TSLA lately has been things like \"Elon settles with SEC\" and \"TSLA is meeting production goals\".\n\nThey need legitimately good news and they need it to be consistent.  One offs for a company of this valuation relative to its profit and revenue are just noise, imo - which is where the haters come from.\n\nPersonally, I think it's a terrible stock to invest in for financial gain, but it could be a winner if you want to support the future.  Elon, although he has many quirks, is moving the engineering needle in the right direction, for me.", "score": 11, "replies": []}]}, {"body": "Aside from the debt issue the first three are irrelevant when valuing Tesla.", "score": -1, "replies": [{"body": "“they’re not profitable” is not relevant?\n", "score": 5, "replies": [{"body": "No, it rarely is when a company is in a growth stage. The key is whether margins are profitable and if the business continues to scale will the company be profitable in the future.", "score": 1, "replies": [{"body": "Is Tesla is a 15 year old company.  Not profitable is a problem no matter how you dice it.  Google was profitable after 3 years, facebook was profitable after 5 years.  Not turning a profit after 15 years indicates lots of hidden problems.\n", "score": 5, "replies": [{"body": "You can’t compare a car company to a tech company. It’s much easier to scale in tech.\n\nTesla is now finally starting to scale. Questions of profitability will be answered soon one way or the other.", "score": 2, "replies": [{"body": ">You can't compare a car company to a tech company.\n\nWell then it shouldnt be valued like a tech company.... or calling it a tech company.... or you know, it's a car company that makes zero profit within an already lwo margin business....\n\n", "score": 3, "replies": [{"body": "I guess everybody on Wall st and institutional investors are all dumb fan boys giving Tesla an insane valuation that’s unattainable.", "score": 1, "replies": [{"body": "Just cuz you are an institutional investor or on Wall St does not mean you are right all the time. You know tons of of institutional investors and Wall St got Enron wrong too? There are tons of people on Wall St and in investment firms that are wrong. \n\nHere are the facts\n- \n\n1. Tesla is not profitable (thats not an opinion, it's literal fact, look up the [income statement](http://ir.tesla.com/node/18946/html)\n\n2. As of Q2, their main source of revenue (top line) is from their cars (Revenue of - 4B or 4,000 M; Automotive Sales - 3.1B or 3,100M). In an industry of car making which has low margins (as evidenced by COGS: Automotive Sales - 2.5B or 2,500 M, which means Tesla only makes 600 M before we even get to Operating expenses). Their Gross Profit (Total Revenues - COGS) is 618M, and their Operating Expenses are 1.24B or 1,240M of which 750M is from SGA expenses, and this is even before any of the other expenses (Interest, Taxes, Depreciation, Amortization). Net Profit was ((-0.742B) or (-742 M)). \n\n\nTrust me, I think Musk's vision is great, however, the company doesn't make shit. And when you're are publicly traded company, you need to show profit, and profit growth. Especially when your CEO thinks the company is valued at 70 Billion\n", "score": 2, "replies": [{"body": "Yes, those were last quarter’s numbers. The stock actually went up after those were released. Enron had fake numbers unless you’re calling Tesla’s numbers fake also.\n\nAnswer this. If Tesla continues to ramp up production and deliveries are they going to be profitable?\n\nThey produced 53k vehicles Q2. They just announced they produced over 80k vehicles Q3.", "score": 1, "replies": [{"body": "Dude, the margins man, it's not all about ramping up production numbers, they still have to find ways to lower costs of making their cars. Not only that, IDK if the rumors are true, but they've been getting free labor from volunteers. How are they going to solve that problem? Operating Expenses would go up (SGA especially) because people aren't going to work for free forever, they would have to replace them. There's more to running a car company than just production numbers, you have to think about the margins. How much is a battery? What is the progress of their planned Giga factory in 2020? \n\nAll you're telling me is production #s increasing will solve the problem, it won't. You vastly underestimate how the car industry works, and how Tesla as a company is run. ", "score": 1, "replies": [{"body": "What are you referring to when you’re talking about margins? They aren’t selling these cars at a loss.\n\nIt is about ramping up production numbers when they’re making money off each car.\n\nThere’s no free labor involved in the manufacture of the cars.", "score": 1, "replies": [{"body": "Dude. You dont even have fundamental knowledge in how businesses work and you're trying to argue with me? Yes they make money off each car, but it's about increasing the margins (as in increasing revenue from cars sold, while keeping cost of goods sold/COGS either constant or lower, aka increasing the profit  on each car sold). Now theres two basiv ways of doing this, either increase how much you make per car or decrease the amount it takes to build a car. It doesnt matter how much you get, when you're costs stay the same relative to the revenues you're making. Increasing the number of production also means you have to increase the # of workers which increases labor expenses for the company. They have to find a way to increase the margins on selling a car (which they havent).", "score": 1, "replies": [{"body": "I actually think you have no idea what you’re talking about.\n\nDo you understand how margins work?\n\nYou don’t need to increase margins on each car sold. As long as margins are healthy you just need to increase the number of cars sold. You said they make money off each car sold.\n\nA lot of what goes into setting up production of the cars is fixed overhead.\n\nAnd trust me, I probably have a much better understanding of how businesses work than you do.", "score": 1, "replies": [{"body": "Dude... if they need to increase production, how are they going to do it when they dont have enough workers to increase production? Or are the current employees somehow going to double the amount of cars theyre producing? You know what happens when you have to increase production? You need more workers, and do you know what happens when you increase the #of workers? You're expenses go up. ", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "What types of company would you compare it to then?  Other car companies?  When Ford was started it, it was almost instantly profitable.\n", "score": 1, "replies": [{"body": "Ford was a company started a long time ago when manufacturing in the US was much cheaper and easier.\n\nHe also didn’t have to develop an entire network of charging stations to make the product work seamlessly.\n\nIt’s hard to find another company to compare it to because starting an electric car company requires so much capital investment before you can scale up and see returns.", "score": 1, "replies": [{"body": "If you can't find a company to even compare to, makes it difficult to know if your valuation is right, doesn't it?  It's pretty much what happened to the tons of dotcom companies that sprang up back in 2000, nobody knew how to value them so they just say it's a different paradim and gave them crazy valuations.  Now 99% of them no longer exists.\n\nNot saying Tesla will fail, but lines of credit may not be infinite.\n", "score": 1, "replies": [{"body": "Tesla will be profitable when all is said and done. Anyone who can’t see this with the way production numbers and revenue are ramping up is missing the forest for the trees.\n\nThe question nobody knows is how much and what kind of multiple the market will assign to it.\n\nIn 2020 a $5 eps and a 50 p/e means it’s a $250 stock and overvalued today.", "score": 1, "replies": [{"body": "The question is not whether will Tesla be profitable, the question is when and how much.  Since multi-year projection in that department has never been remotely accurate, it's pretty useless.  Projection are based on past history and Tesla's history has been very unreliable.\n", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": -7, "replies": [{"body": "You are angry and irrational, yet you accuse someone of “not thinking” :)) gg", "score": 0, "replies": [{"body": "He calls people pedos, costs his company millions of dollars because he can't stop tweeting, and has attempted to attack the careers of people who criticize him or his company's performance. Yet I'm somehow angry or irrational for pointing that out?", "score": 6, "replies": []}]}]}]}, {"body": "Given the scale of fraud that the company's CEO is willing to commit for short-term bumps in stock value, why do we believe these numbers? \n\nThis is why Elon getting to stay on as CEO was such a bad deal for TSLA. He's a liability. He has zero credibility. ", "score": -8, "replies": [{"body": "You're too late man. Two weeks ago, you'd have been top comment. ", "score": 7, "replies": []}, {"body": "After the recent departure of their COA and Tesla’s track record of manipulating profits with zev credits, it doesn’t seem far fetched at all to think this could be fraudulent. Honestly I feel like it’s probable and Q1/Q2 will be the burst to this temporary bubble Tesla has created.", "score": 1, "replies": []}, {"body": "Well, the market seems to think otherwise :)\n\n“Given the scale of fraud” - I loled, compared to most corporate America this is nothing :))\n\nSmart people will think way ahead of everyone, and sometimes they will forget to tie their shoelaces. Mistakes happen, which is why his ongoing communication will he controlled. It’s an expensive lesson to learn, but he is still the most qualified individual to lead the company and this vision. \n\nI would say that you are the one with zero credibility, but so am I :D so no one might believe me. The market and the price tells a different story for Tesla. Onwards and upwards;)", "score": 1, "replies": [{"body": ">Mistakes happen \n\n\"Massive securities fraud happens.\" ", "score": 7, "replies": [{"body": "Massive in comparison to what?\n\n“Securities fraud” - a legal term which describes a tweet in this case.\n\nHe made a mistake, he’s paying for it. Where was the SEC during the banking bailout? How about with so many other red flags popping everywhere else. Anyway, a settlement has been reached, justice has been made (justice as defined bu the two involved parties)\n\nLet’s go back to figuring out how will Musk scale the company further. There will he so so so many other challenges more difficult than a tweet :D ", "score": -6, "replies": [{"body": ">Where was the SEC during the banking bailout? \n\nSince the SEC lacks the legislative purview to regulate banks either during the financial crisis or now, I'm really at a loss as to what you're looking for here. ", "score": 5, "replies": [{"body": "STOP SMOKING THE GANJA MAN!\n\n“The chairman of the Securities and Exchange Commission, a longtime proponent of deregulation, acknowledged on Friday that failures in a voluntary supervision program for Wall Street’s largest investment banks had contributed to the global financial crisis, and he abruptly shut the program down.\n\nThe S.E.C.’s oversight responsibilities will largely shift to the Federal Reserve, though the commission will continue to oversee the brokerage units of investment banks.”\n\nSauce: https://www.nytimes.com/2008/09/27/business/27sec.html", "score": -2, "replies": [{"body": "The SEC regulates broker-dealer relationships in commercial banking. Read the article and learn anything about the SEC. That's why the supervision program was voluntary - if it had been mandatory, it would have been outside the legislative authority of the SEC. \n\nBut while I'm here, is \"stop smoking the ganja man\" *really* the attitude that someone in [Elon Musk's](https://www.maxim.com/.image/t_share/MTU4MjgxOTAwNDA0Nzc4OTM0/elon-musk-weed-promo.jpg) cult should be taking? ", "score": 5, "replies": [{"body": "subprime mortgages, mortgage-backed securities, asset bubble\n\nIs this not the MAIN reason to have an SEC, to enforce securities laws?\n\nhttps://www.thebalance.com/mortgage-backed-securities-types-how-they-work-3305947\n\nanyway, we're splitting hairs. My point was that the SEC might have other bigger fish to fry, but I do agree with their swift reaction to punish this behaviour. It would be good if they were always this proactive :) that's all.", "score": 1, "replies": [{"body": "Learn more about the SEC. When a conman like Musk puts his fraud on the Internet for all to see, it's low-hanging fruit. It's a disservice to Tesla and its investors to let such a disreputable egomaniac serve as the face of their company. Musk should be on a streetcorner selling pencils out of a cup. ", "score": 0, "replies": []}]}]}]}]}]}]}]}]}, {"body": "What about all those cars in parking lots??", "score": 0, "replies": [{"body": "They are now in garages", "score": 1, "replies": []}]}, {"body": "Im new to stocks and bought at 300.50 i think i did pretty good", "score": -1, "replies": [{"body": "Do some proper analysis and research. [https://www.youtube.com/watch?v=5It3nHaOhZA](https://www.youtube.com/watch?v=5It3nHaOhZA)", "score": 3, "replies": [{"body": "Thank you", "score": 2, "replies": []}]}]}, {"body": "Well, Musk made everyone work overtime to meet the quota.  It’s not something that they can repeat.", "score": -10, "replies": [{"body": "Continue paying people to work overtime or hiring more people are two ways they could do this until the collapse of civilization.", "score": 10, "replies": [{"body": "But auto workers want to unionize and demand time and a half for overtime.", "score": -5, "replies": [{"body": "I am pretty sure Tesla is not exempt from labor laws and they are already getting time and an half for over time work.  No union is needed for something they already get by law.", "score": 3, "replies": []}]}]}, {"body": "He does it the same way it's done in software startups, because that's the world he came from. Set impossibly ambitious goals, ask employees to work 80 hour weeks while incentivizing them them ISOs. That's the world I am also from and personally I don't see it as a bad thing, so I don't know why it must be different for automotive startups.", "score": 1, "replies": [{"body": "This is not a software startup.  It’s manual labor and they are on their feet all day.", "score": -1, "replies": [{"body": ">feet\n\nSoftware development can also be tiring, even if you sit down. And as someone said above, there are labour laws in place.", "score": 1, "replies": []}, {"body": "Unfortunately this is not the first time I meet someone strongly convinced and stating it as obvious that manual labor is somehow harder than software engineering.", "score": -1, "replies": [{"body": "Not harder, just different.", "score": 1, "replies": []}]}]}]}]}, {"body": "Rejection at 50ma on \"good news\".  Great shot at a short term short position.", "score": -3, "replies": []}]}
