{"title": "$BILI - Earnings DD", "selftext": "Well I've been lurking here long enough and made some pennies, so here's some DD on a Chinese company that reports Monday and has been doing quite well.  Don't boo me just yet!\n\n**TL;DR: BILI 6/19 calls.  Personally I have 40c.  BILI's stake in online media in China, thanks to COVID, should see a nice increase, though as a company they are also fairly solid.**\n\n*Disclaimer: None of the following is financial advice.  Don't buy options just because some random tells you something; do the research and make an informed decision for yourself.  The reason I'm making this post is because I* ***think*** *there's something here, but I could also be dead fucking wrong or lying.  You see numbers, look em up yourself; you see news stories referenced, look em up yourself. Take responsibility for your financial decisions and make decisions based on your personal risk tolerance. No one is forcing you to buy or sell.*\n\nSo Bilibili.  It's a Chinese media company that operates the Bilibili video-sharing platform and produces mobile games for a Chinese audience.  They specifically focus on catering to Gen Z kids in China who play those \"officially licensed\" mobile games that are pay-to-win, and Bilibili the platform is primarily centered on gaming and animations, though it has expanded recently to include more areas of interest.  Think of it as Chinese Youtube, if Youtube wasn't the monopoly it is and was instead just the biggest fish in the pond.  Like Youtube, they also have a live-streaming component that allows people to donate to streamers while Bilibili takes a cut.\n\nI think you get where I'm going with this.  Same logic behind why gaming companies boosted; people are spending more time on their phones playing games and consuming content. That means more ads are being seen, more in-game purchases are being made, more people have more time to watch people doing something.\n\nBut its not all feeling.  Last month, [Sony bought a stake of BILI worth $400 M](https://finance.yahoo.com/news/sony-invests-400m-bilibili-seeks-145802160.html); no small purchase considering that BILI's market cap is  just above $10 B.  It's also a pretty solid vote of confidence, especially since the disaster of Luckin' Coffee, that a company like Sony would choose to invest that heavily in a Chinese media company. Since they went public, BILI has consistently posted annual revenue growth, with FY 2019 ending with revenue just under $1 B.  In the last quarter alone, [BILI had almost $300 M in revenue](https://finance.yahoo.com/quote/BILI/financials?p=BILI), one of their most successful quarters yet.  Furthermore, as revealed on [the 2019 SEC filing](https://www.bamsec.com/filing/119312520088657?cik=1723690), BILI has made continuous efforts to diversify their business and this effort has clearly paid off considering the rapid growth in BILI's other sectors.\n\nThe share price for BILI has responded accordingly.  This week, BILI reached an ATH of 31.17, and that's only two weeks after the COVID-19 crash in March brought it to a low of $25.  Since it's IPO at $9.80 in 2018, BILI has gone up 212% and looks intent on keeping that momentum up even despite 'rona bringing the markets down.  Even since January of 2020, BILI has gained $8 to hit $30 per share, and a positive earnings for this quarter could easily send it up further.\n\nUnfortunately BILI only has monthlies, so option action is limited BUT there should be a run up to earnings.  I'm bullish on BILI's future in the long term since I think they are well placed to corner the Chinese video-sharing market, so even taking long calls on BILI may be desirable.\n\nAt time of writing BILI is at $30.70 a share.  They report AH on Monday 5/18.  I've got my 6/19 40c and I honestly think it's worth checking out.\n\n&#x200B;\n\n[Edit: positions.  I have some stonks but they're down so who cares](https://preview.redd.it/w5fnecdg2sy41.png?width=275&format=png&auto=webp&s=e45c9b67c062e389608176c74b9c181c3fe6af1d)", "id": "gjrq65", "created_utc": 1589480036.0, "score": 56, "upvote_ratio": 0.93, "num_comments": 47, "comments": [{"body": "I'm a simple man, I see a long paragraph, a buy options. 6/19 35c!!!!", "score": 44, "replies": []}, {"body": "Are we really trusting a brand spanking new account on a super low volume ticker?", "score": 13, "replies": [{"body": "It's fair to doubt.  Looking at historical options volume data there's usually a spike around 2 days out from earnings where volume goes from the hundreds to the thousands or sometimes tens of thousands. Nothing I can say against the brand new account argument, but I did try my best on the DD and I feel confident in it. Everyone should do their own research and decide for themselves", "score": 8, "replies": [{"body": "DD is always appreciated, I'm tossing in a bit of skepticism because some people need it. Perhaps you are on the money and I hope you strike it big.", "score": 13, "replies": [{"body": "Something smells like $CSOD in here", "score": 6, "replies": []}, {"body": "So is this like r/wallstreetbets except people aren't complete morons here?", "score": 2, "replies": [{"body": "Let’s keep it that way lol\n\nBit more practical", "score": 1, "replies": []}]}]}, {"body": "This aged really well", "score": 1, "replies": []}]}, {"body": "YE OP, where the fuck have u been until now and why did u get banned or cancelled your previous accounts?\n\nplus the username doesnt inspire any confidence lol", "score": 1, "replies": []}]}, {"body": "man there’s no volume there", "score": 11, "replies": [{"body": "There’s enough volume though. You may have to just pay the ask", "score": 3, "replies": []}, {"body": "Thats because its a pump and dump", "score": 0, "replies": []}]}, {"body": "Any reason not to do 35c 6/19 instead of 40? The delta seems a lot higher. I’m still learning but why wouldn’t that be likely to profit more?\n\nI’m gonna do one of the two before close.", "score": 4, "replies": [{"body": "I can't afford the 35c, it's definitely better since it's closer to the money and more likely to be ITM.", "score": 6, "replies": [{"body": "Sorry, meant to respond to you but accidentally wrote a new comment.", "score": 2, "replies": []}]}]}, {"body": "I’m in for 4 contracts. 6/19 40c. Good DD, BILI to the moon", "score": 3, "replies": [{"body": "I don’t even see a 6/19 45c", "score": 1, "replies": [{"body": "Edited, meant 40c", "score": 2, "replies": []}]}]}, {"body": "You son of a bitch I’m in", "score": 3, "replies": []}, {"body": "Im in at 7 contracts. Don't fail me now", "score": 3, "replies": []}, {"body": "I am invested since 12/2018, up \\~100% wish I had had options access then,...  \nWill buy some atm long options. \n\nhere, take my upvote :)", "score": 2, "replies": []}, {"body": "Interesting - maybe a spread is ideal though considering the low volume", "score": 2, "replies": [{"body": "not if you wanna get locked in and watch your money come and go. if you're bullish & theta you could do a pcs monday afternoon before the close. Make it wide af since you're capped at spread width on P/L.\n\nif you're long options right before earnings and you're wrong then IV crush is gonna screw you. Id probably play it safe and do a pcs at like 30 delta with a 7/19 exp. i've been wrong with spreads during earnings before and iv crush is still so massive that if you wait around for a few days, you can usually offload the spread w/out losing money.", "score": 2, "replies": []}]}, {"body": "Let’s do this $35c 6/19", "score": 2, "replies": []}, {"body": "I did the same research and bought the April 30c a week before Sony made the announcement and booked a 4x gain.  I bought the May 40c but dumped it a couple weeks ago after it started going back down.  I would not hold this through earnings, as they are no where near profitable.", "score": 2, "replies": []}, {"body": "Fuck it I’m in.", "score": 2, "replies": []}, {"body": "You lost me at “Chinese company”", "score": 2, "replies": []}, {"body": "never trust chinese tho", "score": 2, "replies": []}, {"body": "I dont see it being profiting because anything listed in the US is based on US Money. Not China money.", "score": 1, "replies": [{"body": "All the figures given were converted from RMB to USD at the current exchange rate of 1 RMB to .14 USD.  So the market cap is $10.6 B USD, and the revenue for FY 2019 was $964 M USD.", "score": 2, "replies": [{"body": "see thats the problem... do you know if the sony stake is in the NYSE or the HKSE? idk your probably right ive been on a losing streak so take my voice with a grain of salt", "score": 1, "replies": []}]}, {"body": "If this is true, all of this DD is useless right?", "score": 1, "replies": []}, {"body": "OP seemed to be onto something..", "score": 1, "replies": []}]}, {"body": "Screenshot positions?", "score": 1, "replies": [{"body": "Edited post to include positions", "score": 1, "replies": []}]}, {"body": "Okay I was just making sure I understand it’s better properly. Thanks. The final question is one 35c or 2 40c’s?", "score": 1, "replies": [{"body": "If you want to be safer and potentially make more then 35c is better.  40c will only start majorly printing if $BILI gets closer to $40, but the chances of $BILI getting near $35 is higher so price will increase", "score": 1, "replies": [{"body": "Thanks. I bought one of each.", "score": 1, "replies": []}]}]}, {"body": "I saw that earnings are on Monday, does anyone know if that’s before open or after close?", "score": 1, "replies": [{"body": "After hours", "score": 3, "replies": []}]}, {"body": "Great DD. Going to jump in.", "score": 1, "replies": []}, {"body": "MOTHER..F you are right, I DO my DD.. Monday is  gonna a good day for you.", "score": 1, "replies": []}, {"body": "You son of a bitch. Nice play. Gonna see what's up with earnings tonight and should sell tomorrow for a nifty lil haul.", "score": 1, "replies": []}, {"body": "Thoughts on earnings?", "score": 1, "replies": []}, {"body": "Jesus the volume is low. I don’t know if I’d ever be able to unload", "score": 1, "replies": []}, {"body": "#Fuck you and fuck china", "score": 0, "replies": []}, {"body": "Hey it’s the Lumber Liquidators guy moving onto to new prey, small street bets !", "score": 0, "replies": []}]}
{"title": "How are Beyond Meat (BYND) burger patty sales at your local grocery store?", "selftext": "I bought some BYND stock when it was low in March/April, but am quite annoyed that I was conservative. Delighted with the almost +140% gain of course.\n\nAm thinking of buying more. I am guessing their sales in Asia post-COVID and at Starbucks China will boom. Not yet clear if McDonalds (testing in Canada) will add them to their US menu, but if yes, watch out.\n\nIf anyone sees BYND burger patties for sale at their local Costco/Whole Foods/Wal Mart/Kroger etc... please post here if they think sales are looking good. I can never tell, but a lot of people commenting online seem to be able to tell. Perhaps they talk to the grocery staff?\n\nCramer recently compared BYND to early stage TSLA and AMZN. A bit of hyperbole, but not entirely incorrect.\n\nRestaurant sales of Beyond burgers have obviously fallen drastically this quarter. Hope they recover before the end of 2020.\n\nTheir key advantage against main competitor Impossible Foods' Impossible Burger is that Beyond Burgers are non-GMO. Some people also prefer peas (Beyond) to soy (Impossible).\n\nThank you.", "id": "gjrpza", "created_utc": 1589480020.0, "score": 4, "upvote_ratio": 0.7, "num_comments": 47, "comments": [{"body": "Here in NH/MA the only \"meat\" left on shelves lately is the fake stuff, It doesn't appear very popular.", "score": 10, "replies": [{"body": "That's interesting... well not too surprised about NH, but I would've thought the lack of meat would've caused more people to try them, and by pretty much every anecdotal account I've heard, everybody seems to say they taste pretty damn good.", "score": 1, "replies": []}]}, {"body": "My wife is a vegetarian.  I'm not.  Lately I've been enjoying the fact that I can basically grill the BYND patties and my steak at the same time.  And this carnivore, at least, thinks they taste pretty good even next to a juicy tenderloin.\n\nA couple issues they face are that they look and smell gross when uncooked, and are packaged more wastefully than legal Canadian cannabis.  But the product is quality, so I think their long-run prospects are good.  No trouble finding them where I'm at.", "score": 5, "replies": [{"body": "You're grilling non-meat with real meat?  Huh.  I'm sure your wife isn't too happy about that.", "score": 1, "replies": [{"body": "She'd rather I didn't eat \"carcass\", as she calls it, but 600F is great at dealing with cross-contamination.  ;)", "score": 2, "replies": [{"body": "LOL.  Nice.  Enjoy.  Stay safe out there, mate.", "score": 1, "replies": [{"body": "Likewise!", "score": 1, "replies": []}]}]}]}]}, {"body": "Literally the only vegan meat products I’ve seen were hidden at the back of the grocery store.", "score": 4, "replies": []}, {"body": "We are headed towards 10Billion. If we continue to live our current livestyle, including consumption of meat, our planet is toast. As climate change becomes more intense, subsidies will no longer be provided to animal farms since they are a major source of methane gas. So inevitably people will shift to BYND products. It's a no brainer, saving our planet vs consuming less real meat.", "score": 2, "replies": []}, {"body": "They don't sell. When the meat section and freezers were empty, those shelves were full. And my community is all about that healthy and environmentally friendly lifestyle", "score": 2, "replies": []}, {"body": "> Their key advantage against main competitor Impossible Foods' Impossible Burger is that Beyond Burgers are non-GMO. \n\nHow is that an advantage?", "score": 2, "replies": [{"body": ">> Their key advantage against main competitor Impossible Foods' Impossible Burger is that Beyond Burgers are non-GMO.\n> \n> \n> \n> How is that an advantage?\n\nthink about the typical person that would want fake meat. gmo is a pretty big marketing point for the granola crowd.\n\nnon-gmo doesn't mean anything in and of itself, but to the company's target audience, it's a big deal. (that being said, i don't see these fake meat companies being anything more than a novelty with a small but vocal clientele. these companies won't be the next big thing, just a fad).", "score": 2, "replies": [{"body": "Precisely. Advantage in terms of marketing.", "score": 2, "replies": []}, {"body": "> to the company's target audience, it's a big deal\n\nHard disagree here.  Plenty of people who want to eat less meat either for health, environmental, or ethical reasons are not fucking idiots and understand all the GMO fear is bullshit.", "score": 2, "replies": [{"body": "While I completely agree with you, I think if they're including it, they're obviously not trying to market towards scientifically literate people...", "score": 2, "replies": [{"body": "They're including it because it's not a zero-sum game.  Non idiots just ignore stupid claims printed on labels, it doesn't dissuade them.  So I think you're right to say they're not marketing towards scientifically literate people (but that's true for pretty much every marketing ever).  Who you market to and who your target audience is are not necessarily the same.  \n\nTheir target audience is everybody, they can capture the overlap between everybody and people who believe in nonsense like GMO with marketing, but that doesn't mean that's their only target audience.", "score": 1, "replies": []}]}]}]}]}, {"body": "We've had trouble getting it at the store. Always sold out.", "score": 1, "replies": []}, {"body": "Honestly I have never looked for it, but I have never seen it before at Kroger or Costco. It doesn’t seem to be marketed very well in store.", "score": 1, "replies": []}, {"body": "I've never had it but my dad claims it tastes weird. Which is backed up by it being left on the shelf here in the Midwest", "score": 1, "replies": []}, {"body": "Saw it on sale at Whole Foods yesterday for $4.99 for the patty 4-pack; first time I have seen it that low. It sells well there I think but it’s hard to compete with companies like Kraft and Kellogg’s in your average supermarket or Walmart when it costs $2 more. I have been buying veggie burgers for 20 years and I just get what’s on sale. None of them are that great but they’re all adequate. The Beyond Dunkin sausage sandwich is good but too pricey.", "score": 1, "replies": []}, {"body": "I love it, but honestly, I can't wait until Impossible Foods become public.", "score": 1, "replies": [{"body": "They won’t", "score": 1, "replies": [{"body": "They won't?  Why do you say that?  Just curious.", "score": 1, "replies": [{"body": "They have fuck tons of private equity and VC money. They don’t need to go public", "score": 2, "replies": [{"body": "Huh.  Good to know.  Cheers.", "score": 1, "replies": []}]}]}]}]}, {"body": "I eat meat and was not impressed with the Beyond Burger and meat products.\n\nHowever Bubba Burger makes a great veggie option and is beyond the beyond burger\n\nBYND is a lifestyle brand , not a product .", "score": 1, "replies": []}, {"body": "Bought Beyond burger and sausage links. \n\nBoth were disgusting.  There is no way they are replacing meat with those stuff.", "score": 1, "replies": [{"body": "Lol", "score": 2, "replies": []}]}, {"body": "Cramer is pumping this. Yet I worry about the following: what if the risk of fake meat outweights the benefits? The unknown aspects of it all is a 'tail risk' of some sort since we still don't know the long term effects of what this stuff does or how it reacts with our body in the long term.", "score": 0, "replies": [{"body": "What risks exactly? I've seen a number of people mention how it might be unhealthy, but they obviously haven't looked at the ingredients. I don't see anything in there that would be dangerous.\n\nAnd this whole higher sodium argument seems crazy to me. Who's eating a burger expecting it to be the perfect balance of nutritional content? People shove garbage down their gullet all day, im not sure how a slightly higher sodium profile on a BURGER substitue really matters in the grand scheme of what people eat.", "score": 4, "replies": [{"body": "Also, their new Beyond Breakfast Sausage has less sodium, fat, cholesterol and calories than traditional sausage:\n\n[https://investors.beyondmeat.com/news-releases/news-release-details/go-beyondr-breakfast-beyond-meatr-announces-national-retail](https://investors.beyondmeat.com/news-releases/news-release-details/go-beyondr-breakfast-beyond-meatr-announces-national-retail)", "score": 2, "replies": []}, {"body": "To quote N. Taleb: \"Remember transfats? And another 0000s of these \"obviously\" safe thingies\". Also, see: https://twitter.com/jwmares/status/1133449746792767488", "score": 0, "replies": [{"body": "And?\n\nThey aren't touting the product as a salad replacement. It's a burger replacement.\n\nThis is the problem when you zero in on a singular product, and over analyze it without context. The context being the amount of \"unhealthy\" food out there that people choose to eat.\n\nDo you only eat whole ingredient foods? No candy, packaged food, fast food, etc etc.\n\nIt's a burger replacement made by a company with the goal of reducing the footprint of the meat industry. They aren't saying you could survive and thrive by eating only beyond meat patties.", "score": 1, "replies": []}]}]}]}, {"body": "Personally, I think the stock is \"only\" going to go up in the long term. The more people are exposed to their products and the benefit of their products, the more sales they are going to have. I haven't bought in, yet, but I should. \n\nTo compare it to AMZN is probably a bit foolish, but who knows? It may be the next Amazon/Apple/Facebook.", "score": -1, "replies": [{"body": "Comparing it to any tech stock is idiotic.  Compare it to companies like Tyson.", "score": 1, "replies": [{"body": "Yeah, I don't disagree with that.  (I was only comparing in terms of stock prices). I think in comparison to other food companies, whether they be meat or other food products, BYND looks favorable, and I certainly think it will outperform the market as a whole over the next 3 years, 5 years and beyond.", "score": 1, "replies": []}]}]}, {"body": "I’m glad I have half a cow and deer meat in my freezer and don’t have to eat this fake meat flavored bean curd.", "score": -3, "replies": [{"body": "You don't have to.  You could try it.  There's both health and environmental benefits for eating less meat.", "score": 3, "replies": [{"body": "So growing a huge field of soybeans to make fake meat isn’t environmentally damaging? It’s likely a wash there. Meat just tastes better.", "score": -1, "replies": [{"body": "FYI most of the fake meats are mainly comprised of pea proteins.  And yes, there are environmental impacts to growing crops, but the scientific consensus is that plant based diets are better for the environment.  \n\nA pound of beef takes approximately 1800 gallons of water to procure, including water required to grow the feed.  ( [https://www.latimes.com/food/dailydish/la-dd-gallons-of-water-to-make-a-burger-20140124-story.html](https://www.latimes.com/food/dailydish/la-dd-gallons-of-water-to-make-a-burger-20140124-story.html) )\n\nBeyond meat uses less than 250 gallons per 1lb.  \n\nFor perspective: A 10 minute shower is approximately 20 gallons of water. \n\nAdditionally we have the greenhouse gas considerations and livestock are one of the largest greenhouse gas producers.  \n\n&#x200B;\n\nHere's a nice paper on the comparison between beef/fake meat:  [http://css.umich.edu/publication/beyond-meats-beyond-burger-life-cycle-assessment-detailed-comparison-between-plant-based](http://css.umich.edu/publication/beyond-meats-beyond-burger-life-cycle-assessment-detailed-comparison-between-plant-based)", "score": 1, "replies": [{"body": "It’s still a salty bean curd burger! No thanks.", "score": 0, "replies": [{"body": "Just remember that your fragile masculinity will have impacts on your children, and grandchildren.", "score": 2, "replies": [{"body": "Not sure where you got the impression I’m fragile? Truth is I don’t give a shit what you think. Lol.\n\nAnd neither do my kids.\n\nUsually who I see eating these things is women with hairy pitts and dudes with really long, pretty hair. Which are you again?", "score": 0, "replies": [{"body": " \n\n>Not sure where you got the impression I’m fragile?\n\nIt was just a hunch\n\n&#x200B;\n\n> Usually who I see eating these things is women with hairy pitts and dudes with really long, pretty hair \n\nThanks for the confirmation.", "score": 1, "replies": [{"body": "But am I wrong. Lol I’m not. And you’re still an idiot. \n\nNow I’m gonna go smoke a joint with weed I grew myself and just forget all about this stupidity. Peace out.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Please understand that soy is mainly, by a huge margin, used to feed livestock. The amount of soy grown for direct human consumption is minuscule.\n\nAnd yes, growing huge fields of soybeans is extremely damaging to the environment, especially since it usually goes hand in hand with massive deforestation. The greenhouse gas emissions produced directly by cows and other livestock is also detrimental.", "score": 0, "replies": []}]}]}]}, {"body": "No one is fucking buying that shit. The stock price is all hype. Okay? Bye.", "score": -1, "replies": []}]}
{"title": "After years without turning a profit, Tesla is now poised to be a powerhouse", "selftext": "", "id": "gjrknq", "created_utc": 1589479568.0, "score": 246, "upvote_ratio": 0.96, "num_comments": 44, "comments": [{"body": "Only posting this for the following quote\n\n>Tesla's gross profit margin was 20%, compared with 17% at Toyota and Volkswagen, and less than 10% at General Motors, Ford and Fiat Chrysler. The company has maintained a profit margin of 18.8% or better for the last three quarters.\n\nGross margins continue to grow despite already being larger than the competition when many said electric vehicles just aren't profitable.", "score": 95, "replies": [{"body": "It's rather important to understand that Tesla gross margins are not directly comparable to other OEMs due to several things like Tesla's warranty and R&D accounting and the required adjustment for the financing arms of the others.", "score": 30, "replies": [{"body": ">due to several things like Tesla's warranty and R&D accounting and the required adjustment for the financing arms of the others.\n\nAnd are also offset by ZEV credits, which none of the other auto companies listed have (to the extent of Tesla).", "score": 17, "replies": [{"body": "Last quarter 20% without ZEV credits.", "score": 26, "replies": []}]}, {"body": "Are you saying Telsa's are worse (ie there are later costs  which aren't captured)?", "score": 6, "replies": [{"body": "Btw thanks for contributing! Good to have diversity of opinions here. My condolences on your flair position.", "score": 17, "replies": [{"body": "FYI: You can edit an existing comment rather than create a new one.", "score": 11, "replies": []}]}, {"body": "No they are actually better. Tesla takes out a large amount of margin for warranty stuff just in case. Being extra cautious. When they get more data on how long their cars last you can expect way more hitting margin line.", "score": 2, "replies": []}, {"body": "Yes well it depends on how you define gross profit. I think the real Tesla gross margin per car sold is not 20%, more like 15% or so.", "score": 1, "replies": []}]}, {"body": "That and they can sell hugely expensive software packages to existing clients.", "score": 5, "replies": []}, {"body": "Can you please expand on this? I don’t really understand.", "score": 1, "replies": [{"body": "Tesla can use over the air updates to essentially create an App Store like the iPhone. They already used it to unlock back seat warmers for $500, unlock performance in the model 3, and technically FSD is a software unlock. No other manufacture can do this and when Tesla gets to a larger company base they will be able to generate huge revenues from software running on their cars the exact same way an iPhone does.", "score": 2, "replies": [{"body": "This has no relevance to the point being discussed.\n\nEdit: I see where you responded to the comment just  above mine but my question was in response to something completely different further above", "score": -3, "replies": []}]}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": ">The gross margin will drop over time\n\nHow so? It's proven the opposite over time.\n\n>but they skip a lot of stuff in the cars that will be needed to be added in once they actually have ev competition\n\nWhich features exactly?", "score": 7, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I'm kind of confused you're comparing a Model 3 with an E class, but there we are. If you wanted E class, you should have gotten a Model S, and we both might have to agree that what makes a Mercedes is the ridiculous chrome styled buttons and dials and RGB LEDs everywhere, which isn't my style.\n\nFor reference: we have a Model X and a Model 3, and I don't really agree with your assessment that Tesla's miss things other carmakers have and people want.\n\nFor instance I do not get the hype about a HUD. The cars are designed to drive for you, so I'm not sure why I would need information like speed and route displayed on my windshield next to it being displayed on a dashboard.\n\nWith a panoramic roof and a good air conditioning I am unsure why one would want a sunroof. I've had 2 Model S's as temp cars and they both had sunroofs and I closed them in less than 5 minutes because they make a lot of noise. And I say that as an ex-owner of 4 convertibles.\n\nBluetooth settings are way more advanced and easier to use in a Tesla than in any other car. Tesla's sound system is very good. A 'Burmester' sound system in a Mercedes isn't actually Burmester.\n\nI do agree the seats in a Model 3 are less supportive/sporty than some BMW sport seats, but the Model X seats are just absolutely perfect.\n\nYou need to compare a Model 3 to a BMW 3 series, and our BMW didn't have air suspension, heated steering, automatic shades and trunks. It also doesn't have a glass panoramic roof or an advanced autopilot or the ability to run the air conditioning remotely.", "score": 2, "replies": [{"body": "Trying to answer everything, sorry if out of order.\n\nWhether I bought an s or compared to a c class the assessment is pretty much the same. This is the issue with comparing in this forum. The \"ridiculous\" chrome or minimalist design seems to always be the deflection in this forum rather then talking about the material just not being as durable or high quality. Piano is scuffing for everyone, soft plastics all over, cloth in high touch areas to save money....\n\nHUD is a nice to have on the highway but in the city it makes a lot of sense. True fsd is years away and even if it's as early as 2021, that still left 3 years where people could have benefited from it. \n\nSunroof is preference imo. Panaromic and air conditioning is not a substitute for someone that just wants to drive with open air lol. That's like saying don't go to the ocean, just swim in a pool it's the same thing. \n\nLol please prove to me that Bluetooth is better in Tesla then any modern car. We're not talking about a phone key, talking about actual media and phone controls. It's so far from even a Hyundai it's a joke. But as I mentioned ota updates can fix this over time. \n\nAgreed the model S Raven I sat in were nice. I think they have a lot of room to improve but for most people it's fine. I do a lot of long distance so would appreciate some nicer amenities. \n\nI looked at new 4 series, a5/s5, c/e class, and rc. Definently not looking at hitting all these points but would definently hit a lot. Honestly it's low hanging fruit for the most part. The civic and Camry I looked at would hit most of these and really speak to the attention to detail of materials and convience isn't about \"flashy chrome\" .\n\nEdit: just to be clear, not trying to argue, just conversing", "score": 2, "replies": []}]}]}]}]}, {"body": "The 20% is reached with EV credits from FCA, but they still have ~18% otherwise. Edit: nvm i was wrong", "score": -4, "replies": [{"body": "Afaik it's 20%without, 24% with.", "score": 10, "replies": [{"body": "Correct. As Model Y Ramos it is expected to reach 27%, and with further manufacturing improvements could reach as high as 30%", "score": 10, "replies": [{"body": "I just got a bit longer", "score": 6, "replies": []}, {"body": "It could but I doubt it will ever get there.  Tesla will likely reduce the price in order to keep CAGR of at least 40%.", "score": 1, "replies": []}]}, {"body": "Oh, sorry, mb", "score": 3, "replies": []}]}]}]}, {"body": "So is this supposed to be a low-key apology from CNN after the hit-piece on Elon lying about sending ventilators to hospitals?", "score": 17, "replies": [{"body": "I'm not sure, but I do know CNN is always late to the party. They are now just realizing Tesla's margins are rising and, despite not even including ZEV credits or FSD revenue, they are larger than traditional auto. This was clear in the earnings document and during the call. Why they waited so long to \"cover\" the story is beyond me.", "score": 6, "replies": []}]}, {"body": "when is all said and done gross margins 30%-40%", "score": 18, "replies": [{"body": "I think they will be capped at 30% and prices will be lowered. Never forget the mission statement of the company. The larger their market due to lower prices the faster they achieve their mission.", "score": 42, "replies": [{"body": "Elon will choose speed of growth over all else. I guess they'll need to find the balance between profit margin and expansion.", "score": 14, "replies": []}, {"body": "True, but if you can still sell every car you can make at a 40% profit margin, this will give you more cash to grow faster.", "score": 10, "replies": [{"body": "Agreed, there needs to be a middle ground and I think Tesla will play that well.", "score": 9, "replies": []}]}, {"body": "Agreed, I believe Elon Musk is more interested in scaling up the size of his empire to rival Amazon than scaling up its profit margins to rival Apple. Elon Musk, like Jeff Bezos, is the kind of guy that literally wants his finger in *EVERY* pie.", "score": 11, "replies": []}, {"body": "Eventually yes, but on a per product level it might be higher. If Fremont is pumping out Model 3s with gross margins nearing 25%, then China Model 3s will be pushing 30%, and China Model Ys will be pushing 35-40% due to lower manufacturing costs and increased price.\n\nAlso worth noting that out of Elon's first set of goals for his stock grants, he hit 9 out of 10 targets, with the one remaining being to achieve >30% gross margins for 4 quarters or something like that.\n\nI don't know how competitive Elon is personally, but if I were him I would be aiming to break that 30% margin barrier as quickly as possible, though ultimately the goal is to build more cars to accelerate the transition to sustainable energy, so exceeding that might be a temporary \"Look what we can do\" goal.\n\nBut once self-driving comes into play, the value of the car will be so freaking high that 60% margins will be easily attainable and they need to keep supply and demand approximately equal so... who knows?", "score": 6, "replies": []}, {"body": "I can see Tesla keeping auto margins low 20-30% and using that segment to boost their recognition. Then having batteries be their main profit driver, they talk about pack level costs of around $110/kWh now and sell PowerWall for like $440/kWh. \n\nBatteries are extremely complicated and not really consumer facing, they would be charging high margins to utility companies and governments which can pay. Right now if you run the numbers battery storage is still really too expensive to rival fossil fuels, but at something like $100/kWh solar + battery starts beating coal outright in costs. \n\n2000 cycles, $100/kWh capacity is $0.05/kWh energy, solar is like $0.015/kWh cheapest while cheapest fossil fuel energy is around $0.09/kWh. \n\nif Tesla can cut costs to $40/kWh and use their auto business to drive cell costs lower then they could easily charge 60% margins in energy which is a $2 trillion dollar global market. Compared to automotive which is like $5 trillion, but much lower margin.", "score": 2, "replies": []}]}, {"body": "Are you forgetting about increased costs for being bigger? Increased competition weighing down margin. \n\nIt's not anti Tesla. It's business. It's how it works", "score": 4, "replies": []}, {"body": "Not exactly, keep in mind teslas mission to accelerate sustainability.  For this tesla is going to have more interest in dropping margins to increase demand.  Margins will increase as quickly as advancements can be realized.  Margins will decrease as quickly as tesla can ramp up production.  Tesla would rather have 20M autos at 15% margins than 5M autos at 30% margins.  So really its a race between tesla operations team, and tesla expansion team.  (Would be cool if Elon identified this and assigned team bonuses on how moved faster with ops trying to drive down cost and expansion trying to maximize production growth).\n\nThe margin floor will be fully driven by ramp speed/ability to fulfill demand at current prices before advancements drive down cost.  With that tesla go it to ramp up production as fast an possible and then only maintain margins are demand backlog grows vs production capacity\n\nSo in theory, the higher the margins go, the more tesla is behind its self setting goal of maximizing sustainable vehicle adaptation.  Until we have robo taxis that break the model completely.", "score": 3, "replies": [{"body": "Elon have given the go ahead for Tesla CN to produced lower priced cars for world consumption.  So current S3XY fleet can retain 30% margins.  Does not necessarily need to lower price in the future any longer once MIC model 2 is in production.", "score": 1, "replies": []}]}, {"body": "Who could have anticipated that motors and batteries are cheaper to make than mini petrol powerplants and transmissions??", "score": 1, "replies": []}]}, {"body": "non AMP URL \nhttps://www.cnn.com/2020/05/13/business/tesla-profit-outlook/index.html", "score": 9, "replies": []}, {"body": "It looks like OP shared an AMP link. These will often load faster, but Google's AMP [threatens the Open Web](https://www.socpub.com/articles/chris-graham-why-google-amp-threat-open-web-15847) and [your privacy](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot).\n\nYou might want to visit **the normal page** instead: **[https://www.cnn.com/2020/05/13/business/tesla-profit-outlook/index.html](https://www.cnn.com/2020/05/13/business/tesla-profit-outlook/index.html)**.\n\n*****\n\n​^(I'm a bot | )[^(Why & About)](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot)^( | )[^(Mention me to summon me!)](https://www.reddit.com/r/AmputatorBot/comments/cchly3/you_can_now_summon_amputatorbot/)^( | **Summoned by a** )[^(**good human here!**)](https://www.reddit.com/r/teslainvestorsclub/comments/gjrknq/after_years_without_turning_a_profit_tesla_is_now/fqn3w71/?context=3)", "score": 8, "replies": [{"body": "Good bot", "score": 1, "replies": []}]}, {"body": "And in another breakthrough news, water is wet.", "score": 4, "replies": []}, {"body": "Yawn, wake me up when gross margins are 100%", "score": 1, "replies": [{"body": "1 million funding secured", "score": 2, "replies": []}]}, {"body": "/u/amputatorbot", "score": 1, "replies": []}]}
{"title": "Wave 2 of 🏳️‍🌈🐻 or it's a bear trap.", "selftext": "I've been skeptical on market's behavior during this pandemic after the initial drop. A ~35% drop in the market relative to the market high prior to the drop and then a ~30% rise in the market relative to the market low is insane.\n\nI've always said that rapid increases in stock prices (that have no substantial reasoning) is just as scary as a market drop. The saying that stock prices \"rise like taking an elevator up and drops like jumping out of the building\" is accurate. \n\nHowever, this time the rise in the market is acting like they gave you a jetpack prior to jumping out of the building. It's speed of recovery is faster than the market correction that happening on December 2018.\n\nI have a few assumptions of why there has been this fast rebound:\n\n1. Investors are worried that they are going to miss the opportunity to buy stocks while they are low, creating a pseudo bull trend.\n\n2. Investor confidence that the pandemic was only temporary (a few month or up to a year) and that we would recover.\n\n3. A lot of possible daytrading going on during the stay-at-home orders, given that the hour before closing bell has seen a lot of sell-offs recently.\n\nThere could be other reasons for this that I can't think of off the top of my head, but I personally think we are in the process of seeing a secondary market drop. Investors will realize that the economy isn't as strong it was prior to the pandemic.\n\nSo to give a TL:DR- We either gonna see another market crash (maybe not as bad as the first) or we are in a bear trap.", "id": "gjojyr", "created_utc": 1589470223.0, "score": 4, "upvote_ratio": 0.55, "num_comments": 40, "comments": [{"body": "Wow it could go up or could go down. Extraordinary analysis here bud", "score": 114, "replies": [{"body": "The important part is that if it goes down like a bunch, it will often go down even MORE. Up until it doesn’t anymore. At that point...it could start to go up and if it goes up a bunch, it could go up even more - unless it keeps going down again. \n\nSo...yknow...trade accordingly", "score": 5, "replies": []}, {"body": "Literally reads like a fucking yahoo finance article. Lot of words for no substance.", "score": 1, "replies": []}, {"body": "I'm personally thinking it is going down, but have to present the other side of the coin as I can't read the future.", "score": 0, "replies": []}]}, {"body": " \n\n# 🏳️‍🌈🐻 is coming", "score": 9, "replies": []}, {"body": "My puts expire tomorrow. Second crash incoming Monday guaranteed.", "score": 5, "replies": [{"body": "I felt that on a personal level", "score": 3, "replies": []}]}, {"body": "I m not sure, so i m collecting cash now and selling high risk positions. Bought TLT calls", "score": 3, "replies": [{"body": "I would be cautious even with TLT. If investors fear a potential liquidity issue, they might just pull out their money instead of going into bonds.", "score": 3, "replies": [{"body": "Did you forget about unlimited QE?\nIt seems more like there will be solvency issues.", "score": 1, "replies": []}, {"body": "I m diversified, but thanks for warning. I also got short russell2000, still long nasdaq too. How do you play this uncertainty?", "score": 1, "replies": [{"body": "Depending on what you are wanting to achieve, you could find the delta of your overall portfolio in comparison to a market index or stock/etf(common one is SPX). Find out how much your delta is and then either trade options or long/short whatever you are using as a comparison (SPX, SPY, whatever) until your delta is in a comfortable spot for you. One caveat is that delta can change in a portfolio, so keep an eye on that every so often.", "score": 1, "replies": []}]}]}]}, {"body": "Market goes up without reason? I’ll give you two reasons: Jerome and Powell.", "score": 3, "replies": [{"body": "Yeah and Pelosi/Trump/McConnell\n\nTurbulence currently is because next relief bill is in doubt", "score": 4, "replies": []}]}, {"body": "I'm not from the US so I don't know how easy it is to get a RH account. But I think it has something to do with RH. It has never been easier to 'invest' and the UI is beautiful too. What more does a inexperienced individual want? Add the 3 milliom new costumers to RH and you have your explanation.", "score": 3, "replies": [{"body": "dude RH is a minnow in Lake Michigan", "score": 4, "replies": [{"body": "Yeah learned that. It's hard to get a sense of it when you are not from US", "score": 2, "replies": []}]}, {"body": "I used to be a stockbroker and can say that Robinhood is extremely small. I will say it has a decent looking UI, but other than that it is a shady af brokerage firm. They don't have much of an effect on the market compared to the other brokerage firms, as the assets held at Robinhood is low.", "score": 3, "replies": [{"body": "Ahh k thanks. So RH really is all about yoloing on options?", "score": 2, "replies": [{"body": "A majority of it is. People who tend to get a good amount of money from RH would transfer to a bigger brokerage firm for quality purposes. When I was a broker, I had talked with a looooot of people who did that. Definitely when the $0 commission fee change happened with Interactive Brokers to Charles Schwab to TD Ameritrade to most other brokerage firms.", "score": 1, "replies": [{"body": "Makes sense thanks", "score": 2, "replies": []}]}]}]}]}, {"body": "We’re in a recession.", "score": 3, "replies": [{"body": "How did you come to this conclusion? It can't be", "score": 4, "replies": [{"body": "Saw a squirrel run by me today.", "score": 5, "replies": [{"body": "Wad he hoarding nuts though?", "score": 4, "replies": [{"body": "Crap. I didn’t look for that.", "score": 2, "replies": []}]}]}, {"body": "Impossible!", "score": 1, "replies": []}]}]}, {"body": "Bear trap, feds know what they’re doing.", "score": 2, "replies": []}, {"body": "This market is just...lame.", "score": 2, "replies": []}, {"body": "Honestly current trends look logarithmic, both the up and down swings up SPY seem to be trending flat, somewhere around $285. Will probably stay flat untill big news one way or the other.", "score": 1, "replies": []}, {"body": "Big players are worried about Q2 earnings. I expect a sell off up to earnings and then a big rebound a couple weeks after earnings after the initial volatility tied to earnings", "score": 1, "replies": [{"body": "Good point, I also forgot that it is getting closer to elections and election years tend to be more volatile as companies reassess business strategies based on who is elected.", "score": 2, "replies": [{"body": "Yeah that’ll be a big factor too here", "score": 1, "replies": []}]}]}, {"body": "Its \"escalator up, elevator down.\"", "score": 1, "replies": [{"body": "I've heard both being used, but yeah that is used frequently as well.", "score": 1, "replies": []}]}, {"body": "It's just a remix", "score": 1, "replies": []}, {"body": "20% pullback in progress 🏳️‍🌈🐻🐻🏳️‍🌈", "score": 1, "replies": []}, {"body": "save this trash for your therapist", "score": 1, "replies": []}, {"body": "Lol the bear trap closed its snare before most bears woke up this morning...", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "gjpiv6", "created_utc": 1589473296.0, "score": 252, "upvote_ratio": 0.98, "num_comments": 47, "comments": [{"body": "The real crime was he didn't make a DD post on wsb telling us all to buy puts so we could rake in the tendies too. \n\nWe go full retard, he went FULL retard", "score": 180, "replies": [{"body": "THIS!", "score": 9, "replies": []}]}, {"body": "The real question is why this guy, a senator, was even picked to be the chair of Intel in the first place, his background has nothing to do with tech.", "score": 46, "replies": [{"body": "INTC calls it is!", "score": 4, "replies": []}, {"body": "A sinister conspiracy to keep AMD down!", "score": 3, "replies": []}, {"body": "That went right over my head the first time, not gonna lie", "score": 1, "replies": []}, {"body": "[removed]", "score": -6, "replies": [{"body": "[removed]", "score": 4, "replies": [{"body": "[removed]", "score": -12, "replies": [{"body": "[removed]", "score": 7, "replies": []}, {"body": "[removed]", "score": 7, "replies": []}]}]}]}]}, {"body": "Good. Fuck that guy. Destroying the name of Burr.", "score": 81, "replies": [{"body": "money printer goes \"Burrr\"", "score": 23, "replies": []}, {"body": "[Bill Burr](https://www.youtube.com/watch?v=oE41lmr36G4) in his place", "score": 16, "replies": []}, {"body": "Aaron... who else?", "score": 8, "replies": [{"body": "I actually think he might be in the lineage, but that's not particularly special tbh.", "score": 3, "replies": []}]}, {"body": "He is *the worst Burr...*", "score": 2, "replies": [{"body": "Aaron Burr, sir?", "score": 1, "replies": []}]}]}, {"body": "I'm guessing McConnell will replace him with Kelly Loeffler?", "score": 35, "replies": []}, {"body": "No big deal. He's just gonna be given a job as the senate AMD chair.", "score": 16, "replies": []}, {"body": "what a noob. he should've \"leaked\" it first, then the info would be in the public domain", "score": 6, "replies": [{"body": "His bootyhole is going to be leaking once the feds get through with him\n\nJust kidding, he’ll probably get a 10,000 dollar fine and have to give trump a handy", "score": 6, "replies": []}]}, {"body": "Now they gotta get that giraffe looking cunt that was doing the same thing", "score": 10, "replies": [{"body": "Pelosi?", "score": -2, "replies": [{"body": "Kelly loeffler", "score": 7, "replies": [{"body": "I thought that her investments are managed by third-party advisers at Morgan Stanley, Goldman Sachs, Sepio Capital and Wells Fargo. Has that been disproved? Because it's still up on her website.", "score": 1, "replies": []}]}]}]}, {"body": "This link has been shared 2 times.  \n\nFirst seen [Here](https://redd.it/gjpb1e) on 2020-05-14. Last seen [Here](https://redd.it/gjpbl2) on 2020-05-14 \n\n**Searched Links:** 61,796,983 | **Indexed Posts:** 485,255,018 | **Search Time:** 0.009s \n\n*Feedback? Hate? Visit r/repostsleuthbot*", "score": 2, "replies": []}, {"body": "Interesting week for this to happen. I wonder if anything will happen to the others who were shorting during covid. Doubt it.", "score": 2, "replies": []}, {"body": "Surprised he stepped down.   GOP tends to double down on scandals these days", "score": 5, "replies": [{"body": "Do they ever investigate democrats for these types of things though?", "score": 1, "replies": [{"body": "Is that a fuckin joke?  Dems would investigate themselves for these types of thing.", "score": 1, "replies": [{"body": "I’m sure.", "score": 1, "replies": [{"body": "Not the same situation, but look at the two parties' reactions to Al Franken and Roy Moore.  Both had allegations of misconduct.  Dems forced Al's resignation and ran him out of politics.  GOP doubled down on supporting Moore and threw money at his campaign.\n\nThere is certainly a double standard.", "score": 1, "replies": [{"body": "Looks like the FBI is investigating Dianne Feinstein about the same thing. I wonder if the Dems will run her out of politics.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Losing his committee chair... oh so sorry... how about jail motherfucker.", "score": 1, "replies": []}, {"body": "**Consider this:**\n\nJust last week, the Senate intel committee published a report once again confirming Russian interference in the 2016 election. At least two other senators are known to have traded right before the crash, but neither of them are being investigated.\n\n&#x200B;\n\nThis has nothing to do with the trades - this is a political hitjob from the White House to get Burr off the Senate Intel Committee, discredit the report released under his guidance, and continue trying to cover up Russian interference in our elections. This is actually some terrifying shit, because they are getting away with it.\n\n**also, lets be real -** anyone who was paying attention to the news in December/January saw a massive economic crash looming. He really didn't have *any* hidden information, except maybe GOP strategy memos telling everyone to continue pretending coronavirus didn't exist. Fuck him for those trades, but what is going on here has nothing to do with those trades.", "score": 1, "replies": [{"body": "Muh russia...", "score": 1, "replies": []}, {"body": "Well, he did have private information. But that doesn’t change the fact that a savvy individual wouldn’t have been able to make a good bet that the market was coming down.", "score": 1, "replies": []}]}, {"body": "stay in r/investing.", "score": -5, "replies": []}]}
{"title": "Day 4 5/14 : From Down to Up - The Road to $18385.37 - +9.96% ($1968.86 - $2165.08)", "selftext": "Today was a strange day to say the least. The red start really drew down everything that I was tracking as an opening play, and even TWLO couldn't bail me out today - went in and out pretty damn quickly this morning. So I sat and waited for a good play - and nothing really seemed like a good deal - almost went in on MT and X but decided against it.\n\nAnd then the financials started to run up! Jumped in for a quick buck on BAC, JPM, and WFC - made some quick money there! Which was great. Tried to do the same thing with MS - but by then the financials were skipping town - so I scalped a quick $10 and closed out the position. Missed the TWLO morning moon because of this... sad day :(\n\nSpent the rest of the day looking for a good play - and thought I'd found one EOD with LRCX - but I got in just a TAD too late on its runup, and I got screwed on the spread when she started to flatten out EOD. Ended up hitting my stop pretty quickly and dumped for a loss. While she ended up going up further EOD - gotta remind myself that its just as likely that she would have fallen further. Glad I got out only lost $77. AND SHE CONTINUES IN AFTER HOURS. GUH.\n\nThe jump in overall value today is because another $500 was available for me to trade today! The final $500 is coming in hopefully tomorrow? Maybe on Monday - gotta wait for it too clear.\n\n* I learned the patience lesson initially today! But I've gotta work on that one since another company I was watching for EOD - WIX - decided to moon instead of LRCX. Best to take that one to the bank.\n* Trailing stops worked pretty well today! Definitely contained my losses on a couple things.\n* Even though I already know this - I've gotta be better about watching the spread on the options I buy, part of the reason I got fucked on LRCX was that the spread was over $0.50 - so fuck me.\n\n**The Plan:**\n\n1. Get a TDA cash account and fund with $2000\n2. Play intra-day swing and momentum trades\n3. Cut losses early and often - wins will accumulate over losses.\n4. Take profits Regularly\n   1. Account Balance $4000 - take $2000 to cover initial investment\n   2. Account Balance $14328 - take $12328 to cover cash losses\n   3. Account balance of $6057.37 - take $4057.37 to cover equity losses\n\n**Position History:**\n\nDay 4: 5/14 +9.96% ($1968.86 - $2165.08)\n\n|Position|Day P/L|Quantity|Bought|Sold|\n|:-|:-|:-|:-|:-|\n|TWLO 5/22 200c|\\-$26|1|$425|$399|\n|BAC 5/15 21C|\\+$63|3|$41|$62|\n|GS 5/15 172.5C|\\+$46|2|$183|$206|\n|JPM 5/15 87C|\\+$135|5|$68|$95|\n|LCRX 5/15 270C|\\-$77|1|$342|$265|\n|MS 5/15 37.5C|\\+$10|5|$44|$46|\n|WFC 5/15 24C|\\+$67|3|$41|$63.5|\n\n&#x200B;\n\nDay 3: 5/13 +8.35% - $1356.57 - $1469.84\n\n|Position|Day P/L|Quantity|Bought|Sold|\n|:-|:-|:-|:-|:-|\n|CODX 6/19 20C|\\-$22|1|$277|$255|\n|TWLO 5/22 200C|\\+$174|1|$469|$643|\n|DDOG 5/15 70C|\\+$45|1|$200|$245|\n|NVDA 5/15 335C|\\-$39|1|$213|$174|\n|ZM 5/15 180C|\\-$39|1|$180|$141|\n\n&#x200B;\n\nDay 2: 5/12 +29.53% - $1046.34 - $1356.57\n\n|Position|Day P/L|Quantity|Bought|Sold|\n|:-|:-|:-|:-|:-|\n|CRM 6/19 200C|\\+2|1|$263|$265|\n|EGHT 6/19 20C|\\+59|1|$191|$250|\n|TWLO 5/29 205C|\\+30|1|$370|$400|\n|VTIQ 5/15 30C|\\+224|2|$103|$215|\n\n&#x200B;\n\nDay 1: 5/11 +5% - $1000.89 - $1046.34\n\n|Position|Day P/L|Quantity|Bought|Sold|\n|:-|:-|:-|:-|:-|\n|DDOG 5/15 55c|\\+54|1|$380|$434|\n|CSCO 5/15 44.5c|\\-16|2|$214|$198|\n|CHWY 5/15 39.5c|\\+12|1|$134|$146|\n\nFAQ:\n\n* Why do I have so many day trades with such a small account?\n   * Cash accounts aren't subject to PDT restrictions - instead what happens is that you can only spend up to the amount of cash you have in a day.For Example - at open today I have $1050 in cash - meaning I could buy up to $1050 in option positions for the day. As long as I sell whatever positions I have by market close - that $1050 plus whatever gains I made during the day are available as cash in my account by market open tomorrow. It does end up limiting the number of positions I can take in a day because I only have so much cash - but it allows me to easily prevent losses by having a tight stop loss - and it allows me to take gains when my positions do well.\n   * Technical Side:It does take time for the cash to \"settle\", ie. have the transaction be processed. For stocks that is T+2 - meaning your cash is available two days after you close the position. However for options that is only T+1 - meaning the cash is available back in your account the day after you sell the position.\n* What Broker am I using?\n   * TD Ameritrade and their ThinkOrSwim platform. You pay $1.10 for every round-trip contract, but it is definitely worth it - if only to be able to set a proper trailing stop.\n   * TD Ameritrade cash accounts also let you purchase options - which is not something thats possible with RH.\n* Please take my advice with a grain of salt - this is all coming from a guy who lost over $15,000 in the past two months - so pleaseee treat my advice with the skepticism it deserves. ", "id": "gju82e", "created_utc": 1589487711.0, "score": 15, "upvote_ratio": 0.76, "num_comments": 41, "comments": [{"body": "You doubled your money in 4 days? I’m honestly impressed if you keep it up", "score": 5, "replies": [{"body": "Almost! I'm up 65% in four days - I was always planning on having $2k in the account so the money has been arriving in waves - which is why the value jumped. The percent increases though exclude that!", "score": 3, "replies": [{"body": "I have converted my TOS to cash account yesterday and hope to follow your train of thought from Monday.\n\nThanks for the motivation. Keep them coming and wish you more smol tendies daily", "score": 2, "replies": [{"body": "Good luck to you! I will say it's been working out for me, so I hope the same goes for you!\n\nThe smol tendies will do! And frankly as long as it's gains it'll do, getting somewhere between 5 to 15% daily returns adds up fast enough for me.", "score": 3, "replies": [{"body": "So for a cash account hypothetically: you start the day with 1000. You spend 500 on one option, 300 on shares, and 100 on other shares. \n\nYou sell all 3 plays an hour before close for a $50 profit each. You’d still only be able to trade with $100 until the next market open, correct?\n\nI’m also considering going cash", "score": 2, "replies": [{"body": "So you would get the $500 from the option and the $50 from the profits from that the next day in addition to the $100 you didn't spend. Unfortunately Cash used to purchase equities takes 2 days to settle, so you would get the $400 and $100 from shares two days after you sold.", "score": 2, "replies": [{"body": "Still sounds like a good deal for someone who only trades options and has at least 2k in their account. They could do some real damage every day if they’re smart", "score": 1, "replies": [{"body": "That's the plan! We'll have to see if it's true or not mind you, but I'll take 66% gains in a week and be happy about it!", "score": 2, "replies": []}]}]}]}, {"body": "Thanks man. I converted my TOS to cash account immediately after your reply. It was updated today.\n\nI was able to make a quick $125 on TSLA and lose $50 on DIS immediately after that lol.\n\nBut, this is a good restart of my dormant TOS account.", "score": 2, "replies": [{"body": "Awesome! Hey up $75 is $75 more than you had when the day started - so that's a win in my book! And always good to reboot the account as well.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "What's the average amount of time you're in a position?", "score": 2, "replies": [{"body": "Here's a screenshot of today's trades - I'd say around 8 mins or so?\n\n[https://i.imgur.com/RoBfc6C.png](https://i.imgur.com/RoBfc6C.png)", "score": 1, "replies": []}]}, {"body": "How are you able to sell/buy more than 3 times with a cash account? \n\nI have a cash account with TD but I can’t only sell/trade 3 times a day.", "score": 2, "replies": [{"body": "When you have a cash account you don't have to worry about the day trade counter, it's still there but it doesn't matter.\n\nas long as you aren't trading with unsettled cash, which TD Ameritrade doesn't let you do, you can make as many trades during the day as you want with a cash account", "score": 1, "replies": [{"body": "it happen to me 2 days ago. I got locked out of a good trade even I still have money to trade. I buy/sell 3 times and got lock out trying to get in on a fourth trade.", "score": 2, "replies": [{"body": "Then you might not have a cash account, you might actually be in a margin account - while obviously I don't know the ins and outs of the system, that is the way it's supposed to work.\n\n\n in order to confirm you have a cash account there are two ways\n1. look at your ToS - it should have an N/A under Available Funds For Trading\n2. look at your TD online account - Under Client Services > My Profile > Elections and Routing > Margin Trading should say None, and Option trading should say Standard cash\n\nIf both of those are true and you're still having day trade issues, I would recommend giving TD Ameritrade a call, because they should not be restricting you to three trades.\n\none other thing to look at is your cash in your account differs from your buying power during the day. You can only use settled cash to purchase options every day, and that cash resets every night. Just because you got more cash from a previous trade doesn't mean you can enter another one in the same day if your option buying power is below the purchase cost.\n\nRead through the explanation of a cash account in my post and see if that applies to you.", "score": 2, "replies": [{"body": "Thanks I will look at my account again. I know I don’t have a margin account cause I only have 5k in it. Lol 😂", "score": 2, "replies": [{"body": "You can have 5K in it and still have a margin account, you can have $1 in it and still have a margin account hahaha.\n\nIt all depends on if you applied for margin when you initially set up the account or not, and even if you didn't, they still might not have put you in a cash account status.", "score": 2, "replies": [{"body": "Hmm didn’t know that, thought you can only have margin if you have 25k or apply for it. Which I know I didn’t do either of it.", "score": 2, "replies": [{"body": "The 25K in the margin account unlocks day trading when you have a margin account, you can have a margin account with any amount in it as far as I understand. As for applying for margin you might have done it when you were initially signing up for the account cuz it's one of the screens that TD Ameritrade has you click through, but honestly I have no clue how it all works so take that with a grain of salt.", "score": 1, "replies": [{"body": "Just checked, I do have a standard cash account. \n\nHmm but I still get hit with the 3 trade rule. Probably need to call them tomorrow. Thanks", "score": 1, "replies": [{"body": "Yeah I would definitely give them a call, because that shouldn't be a thing.\n\nlike I said the one thing that could be tripping you up is the difference between option buying power and total cash in your account.\n\nIf you have $5,000 in cash at the start of the day, you can only spend $5,000 on your trades during the day. Even if you close a $1000 trade that made $500, that $1,500 isn't available to you until it settles the next day.", "score": 2, "replies": [{"body": "I read all your post and got me rethink my trading habit. Need to start using stop lost. \n\nDo you use trailing stop lost or just stop? Also at what percent you set your stop loss to?", "score": 1, "replies": [{"body": "When I initially placed the trade I use a plain stop, and then if it starts going up I change it to a trailing stop.\n\nAs for percentage I think it varies on my level of confidence in where the stock is going, which is based on my entirely uneducated opinion on how the chart looks at any given moment.\n\nBut I think it's probably somewhere around 15 to 20%. Probably around 10% if if the stock is really running, because at that point I want to get it near its peak, not necessarily when a reversal happens.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "This is depressingly slow man", "score": 3, "replies": [{"body": "The upside... and downside of playing it safe with tight stops - then again +68% in a week? I'll take those returns.", "score": 8, "replies": [{"body": "Nvm I didn't realize the oldest chart was at the bottom. This is fine", "score": 2, "replies": [{"body": "Ah! Yeah no I'm pretty happy with the returns - still gotta learn the lesson of patience so I can actually keep my gains!", "score": 2, "replies": []}]}]}]}, {"body": "Sir, this is the bread line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Bet it all on JD 50 calls 5/22 or 5/29.", "score": 1, "replies": [{"body": "HELLLLLLLL no", "score": 1, "replies": [{"body": "Okay lol", "score": 1, "replies": []}]}]}, {"body": "Sir, this is the bread line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Any tips on finding stocks and to call or put them? I started with 1.2k a week ago and now 2.1k following some reddit tips and own DD. Want to grow the account as I’m relatively young (19) and very interested. I am unfortunately restricted from day trading because of PDT. Should I turn it into a cash account so I can daily trade? Using RH btw.", "score": 1, "replies": [{"body": "You need to find a different broker, specifically one that has a cash account that lets you trade options with. I've been using TD Ameritrade.\n\nAs for finding stocks, I look at earnings, specifically what's coming up because often you can just slow ride those up the day that they report, and I also look at options flow, mainly because that really helps to see where money is moving", "score": 1, "replies": [{"body": "Thank you for replying. I have created a TD account just in case I do switch. So if I were to switch over the weekend will I be able to trade options by Monday? \n\nHow do you deal with having a small amount of cash and having to hold it for an earning play out two to three weeks? Or do you play the short term earnings play and buy in that week or couple days before at a premium and sell for a small profit?", "score": 2, "replies": [{"body": "Make sure it's a cash account, and it does take a few days for cash to settle so you might want to move some in there if you think you might switch at some point. It's definitely not a created on the weekend and trade on Monday sort of deal.\n\nI don't usually hold for 2 to 3 weeks, the earnings stuff is just a way for me to keep an eye on stocks that might be trending upwards more so than downwards, so I can trade them during the day, I'm totally fine with putting in money at the beginning of the day and then taking it out at the end of the day as long as the stock slowly burned up all day long.", "score": 2, "replies": [{"body": "Thank you very much", "score": 2, "replies": []}]}]}]}]}, {"body": "I am also trading on ThinkOrSwim with a cash account, was thinking of taking the same approach you are.\n\nAny interface tips?  There's like 6 different workflows to place orders, but I'm not sure which is best for this style.  Are you using ActiveTrader for options?\n\nAlso, what are you finding is a viable open interest and volume for the tickers you pick?", "score": 1, "replies": [{"body": "I use active trader and the price ladder for trading options intraday. The price ladder follows the latest mark — so long as the bid ask spreads are tight, it makes it really easy to send a quick market order without risking too much slippage. I find this interface much more intuitive and easier for day trading. \n\nAs for your question to OP on OI and volume— I try and stick to options in a chain with a minimum of 1k of open interest and say 500 contracts of volume. I think this is preference only. Another way to think about this— so long as the underlying is doing at least 1m per day in volume, the market maker should be able to provide liquidity for whatever strike and expiry you need because there is ample opportunity for them to purchase shares and get delta neutral with dynamic hedging.", "score": 3, "replies": []}, {"body": "I use the trade screen, I probably should switch to something else, but I do like that when my trailing stop appears on the chart I can adjust it when I think things are going in a certain direction or not because I can literally see where the stop is in relation to the price of the underlying.\n\nIn terms of open interest and volume, I don't really look at the open interest too much, I probably should though. I do look at the volume and I will jump to a higher or lower strike if I see that there's substantially more volume on that strike versus the one that I'd actually want.", "score": 1, "replies": []}]}]}
