{"title": "[ELI5] How do you bet against a stock?", "selftext": "Relatively new to trading, and been primarily buying mid to long term. \n\nI see a few folks claiming they won money betting against a specific stock, and Nassim Nicholas Taleb  (author of \"The Black Swan\" - great read) supposedly made a ton of money betting against banks just before the 2008 crash. \nHow does it actually work and what do you do in practice with your broker?", "id": "5nx4ht", "created_utc": 1484395318.0, "score": 30, "upvote_ratio": 0.73, "num_comments": 32, "comments": [{"body": "Short sell it or buy put options. Short selling a stock, in theory, enables you to borrow from a shareholder of a given company over an indefinite timespan usually with interest. Upon loan maturity, you are required to return the amount of shares borrowed to your lender. Being short on a stock instantly and automatically prompts you to sell your borrowed shares at market value. If the price of the stock falls, you will be able to repurchase at a discount and fulfill your indebted for a profit. However, if the price of the stock goes up, you will be forced to exceed initial principal undertaken and return the shares no matter the price. Short selling is generally quite risky. Put options enable you to sell a stock to the market at a predetermined price. If you suspect the price of a stock to fall, buy a put option matching or exceeding the current price of the stock and lock in profits if your suspicions prove correct. ", "score": 28, "replies": [{"body": "Also, if you're betting against a commodity you could always buy inverse ETFs", "score": 11, "replies": [{"body": "Example please ", "score": 1, "replies": [{"body": "DUST if you're betting against gold. It used to be DWTI if you're betting against oil.", "score": 2, "replies": []}]}]}, {"body": "Def not explain it like I'm 5", "score": 2, "replies": []}]}, {"body": "please. if you are new to trading, don't do this. also, check your language. words like, \"betting\" and \"won money\" are a dangerous way to think about trading. ", "score": 46, "replies": [{"body": "Cheers, thanks. I'm definitely not thinking about it right now but am interested in how it actually works as it seems somewhat counter-intuitive - or at least counter productive to creating a healthy stock market. ", "score": 11, "replies": []}, {"body": "Agree this can be very dangerous for beginners, I've massively shorted DB when they were first talking about the massive fine and the stock kept dropping endlessly, I made a nice gain, but if I hadn't jumped off the train right in time I could've lost probably triple the amount of what I made shorting the stock, the potential losses are unlimited and beginners shouldn't even think about it.", "score": 5, "replies": []}, {"body": "Yup. I started trading 6 months ago and am no where near ready to start shorting. However if the orange menace trump crashes the market I'm going all in inverse ETFs", "score": -4, "replies": []}]}, {"body": "You borrow 10 stocks of AAPL from me for a month and sell them immidiately for $100 each, so you now have $1000. Then a month later AAPL is not doing well so you can buy 10 stocks for $50 each and give those back to me and you have made $500!!   \nThis is called shortselling/shorting. Now you can imagine what happens if AAPL goes up in price instead :(   \nYou might ask why I would let you borrow my aapl stocks? Well you might pay me $1 for borrowing each one, so if I was going to hold on to them anyway I make a bit extra. ", "score": 28, "replies": [{"body": "Five-year-old me thanks you for the simplest explanation. ", "score": 9, "replies": [{"body": "You also have to remember that a month later when you have to buy back apple for jjonj it could be selling for $100,000 so you have the potential to lose a lot of money. In theory apple could go up forever at a price you can't afford and you could lose infinite money. \n\nThis is more dangerous than just buying apple yourself at 100 because once it falls to zero that's all you can lose.", "score": 2, "replies": [{"body": "Is the length of time predetermined? If I get worried and see apple shares going up and want to buy them back in a shorter time frame to reduce my losses, is that allowed? Or is the time frame predetermined and I have to just sit there and take it? ", "score": 2, "replies": [{"body": "You can do what youre asking (buy them back right away) if you are just shorting a stock. If you are buying puts, then yes time can matter, but that's a whole other thing to learn. You would have to learn what options are in order to better understand that. \n\nCheck out Khan Acadamy videos. He's pretty much taught me all the math I know. \n\n[Shorts](https://www.youtube.com/watch?v=-IDmLERenrU)\n\n[Put Options](https://www.youtube.com/watch?v=6CUcgUeQS-w)", "score": 2, "replies": [{"body": "Thanks for the reply. I'm brand new to this, here to learn. Will check these out, thank you.", "score": 1, "replies": []}]}]}, {"body": "So start small lol 3 shares, won't hurt that much if you're wrong.", "score": 1, "replies": []}]}]}, {"body": "Don't forget to add that you'll probably pay a $100 premium to \"borrow\" those shares for three months and your broker is going force you to buy them back if it end up at $120 at any time during those three months.", "score": 3, "replies": [{"body": "Can the broker do that?  So I say I borrow for 3 months, it's currently. 60, it goes up to 100, but the crash I'm expecting still comes just in the third month, where it will be 30.  You're saying I don't have the luxury of waiting the 3 months?  Say you short a stock and it goes up even a bit the first day, the broker can say pay up?", "score": 1, "replies": [{"body": "Yep. Google Margin Call.", "score": 5, "replies": []}, {"body": "Yes but it all depends on your margin account requirements and how much money you have in your account versus how much money you are currently losing. Eventually you will paper lose a certain percentage stipulated by your broker and it will trigger a margin call. Honestly though, you shouldn't be trading like that. Stop losses and risk management are both very important.", "score": 1, "replies": []}]}]}]}, {"body": "Taleb was trading options and he purchased a ton of options (puts) that were worth pennies. Then the crash hit and they were suddenly worth a ton of money.\n\nTaleb is not a brilliant trader dude. He's a smart guy and an interesting writer but he just flat-out got lucky, and he admits he got lucky. When he ran a fund, all he did was guarantee that it wouldn't lose more than like 15% a year -- ppl investing in his fund basically thought of it as \"buying insurance.\" He eventually closed it bc it wasnt that profitable\n\nIn practice you can do a lot of things if you want to bet against the value of financial instruments. If you want to short the market as a whole you can buy an inverse leveraged ETF like SPXU which shorts the market as a whole.\n\nIf you want to actually short a specific stock, you have to have a certain minimum $ balance w/ a broker, because the risk of shorting a stock is much larger than the risk of buying a stock -- the downside is potentially infinite. Let's say you buy one share of AAPL at $100 a share and it goes to $0.... okay, you just lost $100. But if you SHORT AAPL at $100 a share, it can go *infinitely high*, and you can therefore lose *infinite money* if you're not using a stop-loss order (which you should be).\n\nIn practice, if you want to short the market, you buy an inverse ETF. If you want to short a specific stock, you get in touch with your broker and ask about how to do it b/c different brokers have different account minimum requirements to do it. You can also buy options called \"puts\" but thats a whole other topic and its a lot more advanced.\n\nBe careful not to be \"fooled by randomness\" homie ;). Hope this helps <3", "score": 8, "replies": [{"body": "Thanks much. Taleb is def an interesting writer with good ideas, but gosh I wish he had an editor to turn down the ego. ", "score": 3, "replies": [{"body": "100% agreed.", "score": 1, "replies": []}]}, {"body": "Taleb also recommends to stay away from options because they are too complex. ", "score": 2, "replies": []}]}, {"body": "Not like this:\n\nhttp://www.marketwatch.com/story/help-my-short-position-got-crushed-and-now-i-owe-e-trade-10644556-2015-11-19\n\n\"they won money\"\n\nlol. \n\n\n\n", "score": 7, "replies": [{"body": "This does not make sense to me. Why does this even exist? You could not gain more than potentially 100 percent, where as buying stock normally you can potentially gain more than 100 percent. Why would people put themselves in suck a losing position? Is there some hidden benefit I don't see? Or am I confused as to how this style of trading works?", "score": 1, "replies": [{"body": "There's a thing called leverage. Where you can maximize profits, or losses. You can lose more than your initial investment if you don't manage your risk correctly (stop/loss). ", "score": 3, "replies": []}, {"body": "Suckers are born everyday it's to scam, dumb retail investors into giving their hard earned money to smart investors, that's the stock market. XD", "score": 1, "replies": []}]}]}, {"body": "If you are new to trading, DO NOT naked short stocks; you can get killed.  Learn about options or use short ETFs.", "score": 3, "replies": []}, {"body": "You're going to need a margin account with your broker. It is important to remember that when it comes to short selling stocks, your profit and loss functions are inverse, meaning that instead of having the potential(while rather slim) of unlimited gains and limited losses, when you short sell, your loss potential is unlimited and your gain potential is limited. Make sure to learn about stop losses and proper risk management as well when it comes to trading, especially short selling. Regardless of whether you are trading or investing, education is the most important part of the equation. I would also suggest reading Security Analysis by Ben Graham for investing (Basically do the opposite if short selling) and The Disciplined Trader by Mark Douglas for trading. Both excellent books. Best of luck. ", "score": 2, "replies": []}, {"body": "Always love requests for explain it like I'm 5 and seeing explain it like I'm 40 & have 2+ yrs banking vocabulary practice ", "score": 2, "replies": [{"body": "Second that. ", "score": 1, "replies": []}]}]}
