{"title": "Heart fell out of my chest at first…", "selftext": "Bought a credit spread on MSFT before market lost 5% and got assigned for the first time last light. Boy did I think that I really messed up for a second. Still don’t fully understand the whole “you might not want to exercise your put, as it still has extrinsic value, but also you owe us 40k”", "id": "1eolp85", "created_utc": 1723268951.0, "score": 3078, "upvote_ratio": 0.96, "num_comments": 481, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 1 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": [{"body": "This is exaxtly how and why I understand how spreads work and also why I will never touch them again.", "score": 1, "replies": []}]}, {"body": "There was a kid a while ago that killed himself because of this exact situation. Was a way larger amount shown tho, like 400k.\n\nTurned out he lost like 300$\n\nEdit: so I got the specifics wrong, it was more like 730k losses showing, but was actually up 3k. can check this comment for the news story [mentioned in another commen by /u/Datboileacht](https://www.reddit.com/r/wallstreetbets/s/FtDmC5cj09)", "score": 6796, "replies": [{"body": "I remember that, that’s one of the saddest stories I’ve ever heard I wish he would’ve waited to let everything resolve. At the very least he could’ve declared bankruptcy if he ever owed 400k, and built everything back up. \n\nIIRC it happened on a Friday and Saturday or Sunday he jumped in front of a train. Should’ve waited till Monday to see it play out.", "score": 3028, "replies": [{"body": "For anyone who gets into a similar situation, creditors have very little power, and this isn't as life changing as you might think at first. Declaring bankruptcy wipes it all away, and in 7 years you'll be able to start your credit history over. Immediately after bankruptcy finishes you no longer have creditors and can retain all of your new income.\n\nExceptions for student debt, child support, back taxes, and similar special debt situations that don't go away.", "score": 1588, "replies": [{"body": "Back taxes will actually go away in Bankruptcy if they are 2+ years old. So the taxes you owe for the year you file bankruptcy and the year prior you still have to pay, but everything older than that is wiped.\nAsk me how I know 😅", "score": 716, "replies": [{"body": "How you know?", "score": 170, "replies": [{"body": "Cause I did it lol", "score": 537, "replies": [{"body": "Look at this dudes post history", "score": 267, "replies": [{"body": "Swwweeeettt Caroline buh buh bah", "score": 180, "replies": [{"body": "Yep totally made this as a throwaway account to post there, and forgot what account I was logged into when I commented here lmao 🤷", "score": 135, "replies": [{"body": "She is pretty hot Ngl", "score": 54, "replies": [{"body": "6.5", "score": -4, "replies": [{"body": "Why are you talking about my penis size", "score": 15, "replies": [{"body": "I didn’t read 3.75”", "score": 3, "replies": [{"body": "Why are you talking about my p......nevermind.", "score": 3, "replies": [{"body": "I called it first.. that’s mine", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Good taste brother!", "score": 15, "replies": []}, {"body": "Id smash. Her too I guess", "score": 1, "replies": []}, {"body": "You're making obscene comments about a news anchor on a public forum.\n\nNow one cares if you'd bang her or not, what are you, 12yrs old?\n\nSeek therapy my guy, keep shit like that to yourself.", "score": -4, "replies": [{"body": "I didn't even want to talk about her nor did I bring her up originally lol, someone else said to look at my post history and I was just explaining why those are the only things on there", "score": 3, "replies": []}, {"body": "Nah fr too far gone even for wsb", "score": 2, "replies": []}, {"body": "Is it your first day using the Internet or something?", "score": 2, "replies": [{"body": "Yes", "score": 1, "replies": []}]}, {"body": "I care", "score": 0, "replies": []}]}]}, {"body": "But caroline is a gold digger and she won't find any with him lol", "score": 1, "replies": []}]}, {"body": "He definitely has a type", "score": 18, "replies": [{"body": "Whats weird is she's actually not my normal type 🤔", "score": 12, "replies": [{"body": "Maybe you're Into girls that are not your normal type.", "score": 13, "replies": []}]}]}, {"body": "jfc", "score": 1, "replies": []}, {"body": "Hot girl summer", "score": 0, "replies": []}]}, {"body": "I’m about to join you myself", "score": 51, "replies": []}, {"body": "I think you like caroline too much", "score": 21, "replies": [{"body": "Eh we were FWBs for awhile, I explained the whole sad story in another comment lol. Not my proudest moment lmao", "score": -4, "replies": []}]}, {"body": "I knew the answer but the response still made me lol", "score": 13, "replies": []}, {"body": "SKINNNNEERRRR", "score": 3, "replies": []}]}]}, {"body": "The most important thing is to file your taxes on time even if you owe a huge amount.", "score": 10, "replies": [{"body": "Why?", "score": 5, "replies": [{"body": "Federal income taxes are dischargeable under a Chapter 7 bankruptcy when meeting all 3 conditions 1) 3 years from filing deadline including an extension 2) 2 years from when the tax return was actually filed 3) 240 days from when the tax was assessed.  \n\nSo if you filed CH 7 bankruptcy today, then you could discharge your timely filed 2020 and pre 2020 federal tax return debt.  If you file your 2020 tax return today, you would need to wait 2 years to file bankruptcy if you wanted that debt discharged", "score": 15, "replies": [{"body": "Oh shit. I haven’t filed the past two years because I am afraid I am going to owe a ton in wash sales day trading XOM in 1,000 share blocks 100-300x a day in 2022. $250M in transactions and I didn’t know about wash sales. The next year I set up mark to market basis and an LLC for trading but moved to futures so it didn’t matter. I filed an extension for the 2022 year but nothing filed for 2023 because I thought my CPA would handle it automatically. I asked him to file one day too late. \n\nWhat should I do?\n\nI never filed bk before.", "score": 5, "replies": [{"body": "The best thing to do is just get everything filed. You see how much you owe, if anything, and then consider your options.", "score": 7, "replies": [{"body": "Thank you!!!", "score": 1, "replies": []}]}, {"body": "As I read it wash sale only stops you from writing off losses on those securities. While this is not good it should not be devastating. If you were not mark to market I believe your max loss you could claim was only 3000 dollars anyway. Not a tax expert here but I have done some digging because I trade the same ticker daily.", "score": 2, "replies": [{"body": "There is a CPA named Brian Rivera who is a trader and a CPA. He has a couple videos about this… I think his channel is TraderTaxCPA. My concern is without being able to write off the losses I may have a lot of gains.\n\nEven if in reality it was a $30k loss for the year I could end up owing on $90k. It’s a double fk fk as I understand it.", "score": 1, "replies": []}]}]}]}]}, {"body": "Exactly!", "score": 1, "replies": []}]}, {"body": "Are you a fan of that woman or what's going on?", "score": 14, "replies": [{"body": "I used to be a FWB with her a few years ago. one day I stumbled upon her reddit and there were a bunch of really thirsty dudes on there commenting. Since I knew her personally and intimately one of my female friends after I sent her screen shots of people's comments dared me to make a burner account and post pics cause I had stuff that had never been posted online. So I did and my DMs got overloaded with people messaging me and everyone was commenting on everything etc. Then my first account got banned lol. But I was having fun cause I'd been bored and was going through a really rough patch the last few months so as sad as it is the interactions were actually helping out, so I made another burner to replace that one and came back. And then I got bored of it and stopped posting, if you see my last posts was a few weeks ago. But I forgot to log out of this one and so commented on here on accident as opposed to my \"real\" reddit account lmao", "score": 25, "replies": [{"body": "I bet you gott off on dudes sending you wiener pics huh", "score": 17, "replies": [{"body": "Luckily that never happened lol", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 12, "replies": [{"body": "Sure was, and we still talk, hence the need for a fake account lol, but theres no point in arguing with strangers online", "score": 3, "replies": [{"body": "You are so weird.", "score": 2, "replies": []}]}]}, {"body": "No chance you were Fwb with her lol! A stalker perhaps lmfao", "score": 13, "replies": []}]}]}, {"body": "Thank you 🙏", "score": 1, "replies": []}, {"body": "How do you file ? I’ve been wanting to do it but I do t know how. And how long does it take?", "score": 1, "replies": []}, {"body": "How do you find a lawyer who will help you file for bankruptcy for back taxes? Or is it easy to do yourself?", "score": 1, "replies": [{"body": "Bankruptcy lawyer", "score": 1, "replies": [{"body": "Thanks but the few bankruptcy lawyers I’ve contacted were unfamiliar with bankrupting back taxes. Even though it is clear on the IRS website. I guess I’ll keep hunting. I got burned on those tax firms that claim to help you negotiate your tax situation. I had an angel of an attorney who was great at getting me from underwater with leans but then they suddenly retired.", "score": 1, "replies": []}]}]}, {"body": "what about child support? any similar rules for that?", "score": 1, "replies": []}, {"body": "3 years for taxes. Credit score starts improving immediately.", "score": 1, "replies": []}, {"body": "That depends on the state where you file and whether it is Chapter 13 or Chapter 7", "score": 1, "replies": []}, {"body": "I know, cause I know too. \nBack in 86. Taxes were 3 years old. Nothing signed showing I owed $40k. Court Considered the Taxes unsecured debt.\nEasy charge off.", "score": 1, "replies": []}, {"body": "How much did it hurt your credit and how long did it take you to rebuild or get a new loan? I have/had a 711 when filing.", "score": 1, "replies": []}]}, {"body": "Before you declare bankruptcy be sure to max out a credit card to buy Wendy’s gift cards so that you can eat during that period. It’s very cost effective to be able to eat near work", "score": 17, "replies": []}, {"body": "[deleted]", "score": 34, "replies": [{"body": "Thanks! I was so scared about taking a loan and investing into options but not anymore. It'll be the first thing to do on Monday. I love you all!!!", "score": 14, "replies": [{"body": "I'm glad that's what you took from this. Now do me a favor and hold my bag.", "score": 7, "replies": []}, {"body": "Soo you are going to go take a loan out monday?", "score": 1, "replies": []}]}, {"body": "Correct. No credit for 7 years is an urban legend. You can qualify for a mortgage in 2-4 years.", "score": 1, "replies": []}]}, {"body": "You start building your credit history immediately after your Ch 7 is discharged. The BK stays on your record for up to 10 years, but it really only affects people from buying a home the first 2 years, holding a financial job, car loans your first year (maybe), and applying for a cc from certain credit card companies indefinitely. I filed last summer. Wiped away $70k in trading debt. Got my credit score from 500-700 and I have a couple cc already. Just got a lease on a nice studio apt downtown in a beach city.", "score": 25, "replies": [{"body": "What if you don't declare bankruptcy and just kinda stop answering phone calls? Assuming they don't sue", "score": 4, "replies": [{"body": "Eventually the collection company will sue. Then gain access to your bank and garnish wages.", "score": 6, "replies": [{"body": "But let's say they dont. Say it's a small amount and not worth their time", "score": 1, "replies": []}]}, {"body": "It all depends. In most cases, your debt will be passed around like a hot potato, but it’ll remain on your credit score as a derogatory mark. Eventually, they might take you to court even if it was only $500. Your best bet is to see if they can negotiate. Start at 50% of the debt and work your way down to at least 30%. Ask to talk to the collection agencies supervisor’s supervisor. Just keep haggling them and eventually they’ll budge. I got a $10k Amex card to $2k, and then still declared bk lmao", "score": 6, "replies": [{"body": "They will go after you for a $30 medical bill", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 20, "replies": []}, {"body": "One of those exceptions is not like the other and should be covered by bankruptcy.", "score": 9, "replies": []}, {"body": "It’s like nature’s Get Out of Jail Free card", "score": 6, "replies": []}, {"body": "You can wipe away student debt if it’s private loans. It’s still a pain but doable. Friend did his also within 6months credit card companies were reaching out lol", "score": 2, "replies": [{"body": "Most of the time it depends on whether it is secured or unsecured debt. Most credit card debt is unsured. A car loan is secured. It is possible to lose a car during bankruptcy process", "score": 1, "replies": []}]}, {"body": "I'm sure Trump has been involved in multiple bankruptcies and look how well he turned out (financially).", "score": 2, "replies": []}, {"body": "I agree on your point, but Declaring bankruptcy is not get out of Jail card if you are already doing well. It will impact job background verification and will also also impact big ticket credit outcomes with higher rates . declaring bankruptcy will also take away everything you have or you own. This is an option and should be always used if in trouble and taking ones life is not the way but at the same time its not a simple wild card for foolish gambles", "score": 2, "replies": []}, {"body": "Agree with you 100% my son got himself in some pretty significant debt and it was something I couldn’t get him out of so he just had to buy  his time until it finally fell off his credit. He obsessed about his credit yet never made any big purchases through that whole time. So I never understood why he was so worried other than his score looks bad, but he didn’t need a reason to apply it to anything.", "score": 2, "replies": []}, {"body": "The student loan thing is ludicrous. You can get into hundreds of thousands of dollars in debt at 17-18 and can’t get rid of it, even if you die.", "score": 4, "replies": [{"body": "At the same time, what’s to stop people from just filing bankruptcy right out of college to discharge the debt, get their hopefully well paying job in their field, and building up your financial future from there?\n\nIt sucks but I understand why it’s not dischargable debt", "score": 9, "replies": [{"body": "College loans cannot be discharged in bankruptcy", "score": 0, "replies": [{"body": "Yes, I know. I comment was explaining why they cannot be discharged.", "score": 6, "replies": [{"body": "Federal law… bankruptcy laws are basically federal laws and now the feds control most student loans", "score": 1, "replies": []}]}]}]}]}, {"body": "Heck, not even 7 years. You can buy a home in 24 months. Rebuild credit starting day 1 with secured credit cards.", "score": 1, "replies": []}, {"body": "Stupid question, but I always avoid options because of nightmare scenarios like this that I don’t quite understand (Also a good reason I haven’t tried options yet)\n\nAre there scenarios where if I place a call/put and it goes nightmare mode, I would owe a stupidly large amount of money?\n\nSometimes I just want to throw down $50 or $100 on a call/put to basically gamble but I feel I don’t know enough about them to even try", "score": 1, "replies": [{"body": "Traders play options due to the potential of enormous gains with relatively small amount of money down. Of course you can lose it all, possibly more, depending on the trade. There are ways to limit your risk", "score": 1, "replies": []}]}, {"body": "And medical bills I think.", "score": 1, "replies": []}, {"body": "This is not true for a majority of situations unless the lien is specifically avoided. \n\nIf there is a judgment in your name, the judgment stands, but the collector has lost the obligation to collect on that. But it is a valid judgment until it expires if it's just discharged. For a lot of states that's way more than 7 years.", "score": 1, "replies": []}, {"body": "mods need to pin this shiet somewhere", "score": 1, "replies": []}, {"body": "Your credit starts geting rebuilt within a few months. 7 years is just the reporting period to credit bureaus.", "score": 1, "replies": []}, {"body": "For all the Germlander Wienerhandlers like me - As a German citizen bankruptcy is half of that, 3,5 years.", "score": 1, "replies": []}, {"body": "https://preview.redd.it/a0qh9ci3a3id1.jpeg?width=1423&format=pjpg&auto=webp&s=4b6b599d3a2c1abee292b6c8db6f89dc4f6afe94", "score": 1, "replies": []}, {"body": "Amazing that student loans survive. And colleges gleefully keep jacking up rates and lending more obscene amounts to students to get degrees that will never pay off\n\n![img](emote|t5_2th52|4267)", "score": 1, "replies": [{"body": "Right, depends on the country. In some countries you are enslaved", "score": 1, "replies": [{"body": "I'm not familiar enough with most countries university cost/benefit system. I just know the US is broken as Fk.\n\nYou can literally borrow $250,000 to get an Art History degree. Time to pay-off = right about when you die.", "score": 1, "replies": [{"body": "I have some understanding of your predicament… my daughter majored in Art and works writing grants for a nonprofit. I had the foresight to have her do some of her coursework less expensive community college.", "score": 2, "replies": []}]}]}]}, {"body": "How I wish we had that kind of bankruptcy in Europe.\nHere, it follows essentially for all your life", "score": 1, "replies": []}, {"body": "You have zero clue how bankruptcy works my man.  You should not be giving advice ", "score": 0, "replies": [{"body": "To whom are you speaking?", "score": 1, "replies": [{"body": "To the guy who has no idea on how bankruptcy works", "score": 1, "replies": []}]}]}, {"body": "I’d tell them to go fuck themselves. Just say your numbers don’t match their numbers and hang up on their asses. These goddamned mega-corporations can sink themselves and have the taxpayers bail them out but they try to scalp the little guy? Fuck that.", "score": 0, "replies": []}]}, {"body": "man suicide sucks", "score": 178, "replies": [{"body": "Woman suicide also sucks.", "score": 158, "replies": [{"body": "mmm not as much. they dont commit as much as men do…", "score": 26, "replies": [{"body": "And they say men have commitment issues ….", "score": 91, "replies": [{"body": "yeh committing to staying alive", "score": 48, "replies": [{"body": "Ha! Ha! Ha! Ha! \nStayin' Alive", "score": 5, "replies": [{"body": "*pinches my testicles* “ if you can’t tell by the way, I use my walk I’m a woman’s  man no time to talk”", "score": 2, "replies": []}]}]}]}, {"body": "The last I read the statistics on this, women make more attempts than men, but larger percentage of the attempts by men result in death. This may have changed", "score": 1, "replies": [{"body": "huh, i didnt know that. Ill look into it.\n\nI wouldnt be surprised with all the body shamming n shit they have to endure.\n\nHavent you heard of that little girl that got bullied by other little girls in like middle school? And she just fuckin killed her self? Thats insane to me", "score": 1, "replies": []}]}, {"body": "Follow through is key. Remember kids, the barrel goes between your eyes, not under your chin.", "score": -61, "replies": [{"body": "Nah most guys ive know just intentionally overdose", "score": 4, "replies": [{"body": "Death by Snu Snu is the way.", "score": 27, "replies": [{"body": "I wanna get my head crushed by some nice thighs…", "score": 18, "replies": [{"body": "This went a direction I didn’t expect", "score": 0, "replies": [{"body": "Honestly it's exactly as expected", "score": 2, "replies": []}]}]}]}]}, {"body": "Oof.", "score": 1, "replies": []}]}]}]}, {"body": "Yeah it's fairly permanent.", "score": 8, "replies": []}, {"body": "It is a permanent “solution “ to temporary problems. DON’T DO IT!!!!  As someone who has both contemplated suicide and lost friends to suicide, I beg you not to do it.  Please seek help, and watch out for friends.", "score": 1, "replies": [{"body": "Bruh im not gonna lol\n\nSure ive thought about it, and will again and again, but that doesnt mean i will.\n\nIve also lost friends to it. Ive seen what it does to families ", "score": 1, "replies": []}]}]}, {"body": "Inexperienced people shouldn't trade the more complicated option strategies.  I feel most regarded people in this subreddit should only buy naked calls/puts, or covered calls/puts.", "score": 60, "replies": [{"body": "Whatever you do, don't do cash secured puts and shitty companies. That's how you lose 10k on weed stocks instead of weed joints...", "score": 22, "replies": [{"body": "Don't tell me how to run my portfolio. Weed stocks will rise again!!\n\nhttps://preview.redd.it/wbwumbj9nvhd1.jpeg?width=2102&format=pjpg&auto=webp&s=9ed06ff500513397434983c5758ba920313c1d96", "score": 12, "replies": [{"body": "Almost perfect score. Only 0.1% to go!", "score": 5, "replies": [{"body": "I really wish I could get 100%", "score": 1, "replies": []}]}, {"body": "sundial got me good on god", "score": 2, "replies": [{"body": "I sold HEXO puts because I liked their CBD drinks mixed with coconut rum. I can't be the only one right?", "score": 2, "replies": []}, {"body": "I escaped sundial up like $1 maybe a few cents", "score": 1, "replies": []}]}]}]}, {"body": "Most fit regards should serve country and die abroad for unfit to benefit.", "score": 7, "replies": []}, {"body": "Hey covered calls/puts aren't risky... they won't blow your account like naked options.", "score": 1, "replies": [{"body": "Buying Naked calls and puts you just risk the money you put into it.  Yes you can blow your account but it won't be unlimited risk", "score": 1, "replies": []}]}, {"body": "Instead of what ? I am learning the terminology and taking notes..", "score": 0, "replies": [{"body": "If you can't even be fucked to browse investopedia you absolutely should not be just \"learning the terminology\" on here lol", "score": 19, "replies": []}, {"body": "Learning and taking notes from wallstreetbets probably isn’t the best place to start my friend", "score": 18, "replies": [{"body": "I thought you put money in, red line go down, ???, Profits.\n\nHave I been investing wrong?", "score": 5, "replies": []}]}, {"body": "But the terms…", "score": 1, "replies": []}]}]}, {"body": "Even if it ended up with him actually owing 400k. He had his whole life ahead of him. At that age bankruptcy would’ve been a blip in the rear view mirror by his late 20s. Plus, letting a teenager leverage to the tits like that… that bank/brokerage deserved to have that amount written off in bankruptcy anyways.", "score": 23, "replies": []}, {"body": "That is very sad. And a good cautionary tale for the budding psychos on wsb. \n\nBut I'm forced to think that a person playing wsb options without any understanding, who would react so quickly and not explore their options enough to at least verify the actual consequences of that situation for like 48 hours... might have ended up in front of the train for other reasons. It's a shame he didn't have the support in his life that he must have needed.", "score": 16, "replies": [{"body": "Yeah sounds like a final straw type of situation. Sounds like the poor guy was probably near his rock bottom already and spiraled fast enough to not actually explore solutions.", "score": 13, "replies": [{"body": "It was a high school kid if I'm thinking of the same story. He thought his life was over before it even really started", "score": 1, "replies": []}]}]}, {"body": "You gotta assume he had other stuff going on and this was just the last straw, he was probably suicidal already, but who knows. \n\nReally is such a minor thing too when you're that young. You don't have any assets and you won't really even need your credit for a few years anyways. Would've been a minor inconvenience.", "score": 5, "replies": []}, {"body": "Moral of the story is don't hold over the weekend.", "score": 2, "replies": []}, {"body": "You say build everything back up like that's achievable for most.", "score": 1, "replies": [{"body": "His portfolio was relatively small I think 15k of his own capital and he was 20 years old. He had his whole adult life to live you mean to tell me you can’t rebuild all the damages done in your late teens early 20s?", "score": 1, "replies": []}]}, {"body": "He was never actually in debt. His options got assigned, so he had a large position in whatever stock they were for and a corresponding large margin debt. All he had to do was sell the stock to pay off the margin. He might have even made money, at worst lost a little.", "score": 1, "replies": []}, {"body": "Declaring bankruptcy doesn't make all trouble go away. Usually you make a settlement and a plan to pay off the debt... for the rest of your life.", "score": 1, "replies": []}, {"body": "Why is it a sad story?", "score": 1, "replies": []}, {"body": "Stand in front of a Saturday train that arrives on Monday?\n\nNot everyone is in Italy.", "score": 1, "replies": []}]}, {"body": "I have the top comment on a wsb post that was exactly like the kid who killed himself a week later then the kid. \n\nIt was 700k the kid was down and the market opened up so he would've actually made 3000 but only because the market opened up when it would sold his stock. His intrinsic value on the weekend was 300 dollar loss but everyone commenting was too late. He had posted it and then killed himself immediately after. \n\nWsb put a ton of rules in place following that. It was a very sad time and I comment on almost single credit or put spread I see just to make sure. I also tell people to stop doing this shit if they don't understand it. It's very sad that kid didn't stop just to read any comments. Would've save his life.", "score": 148, "replies": []}, {"body": "It happened to me once, too, but a much smaller amount of -40k for about 4 hours with a SPY vertical. And I was in an equally dire financial situation.\n\nBut me being me, I was like: fucking stand in line, bitches. I moved money around and just accepted the worst case scenario. \n\nBut then things settled, I lost about $100. \n\nThe story of the guy killing himself happened about 2 weeks after my extreme scare.\n\nI had thought by now RH would have improved this process, like a simple asterisk or email informing the user would make all the difference. It’s like they really do want people to jump off bridges.", "score": 66, "replies": [{"body": ">  It’s like they really do want people to jump off bridges. \n\nYup. this is 100% on RH here. Their UI is better than other companies, but it's responsibility of UX team to represent the reality clearly.\n\nDoing:\n\n# You owe us 100,000$ !!!\n\n^(and we owe you almost as much, maybe even more)\n\nis just asking for trouble.", "score": 57, "replies": []}, {"body": "Same thought. A message like that is irresponsible.", "score": 3, "replies": []}, {"body": "Yes, amazing that they don’t. And also amazing anyone trades on RH given its history.", "score": 2, "replies": [{"body": "I trade small sums on there, have had an account for a long time. Do I trust them with my real retirement? Absolutely not.", "score": 2, "replies": []}]}]}, {"body": "Sorry not from US. Did robinhood got any punishment or anything ?", "score": 27, "replies": [{"body": "Ofc not :(", "score": 37, "replies": [{"body": "Seriously ??? No accountability ? What a sad state this world has come to.", "score": 7, "replies": [{"body": "Options are for advanced traders what are they supposed to do?", "score": 26, "replies": [{"body": "Cause it was their issue. Dude did not actually lose 700k and end up hundreds of thousands of dollars in debt, it was just the app being shit and making it seem like he was in massive debt.\n\nRead a article about it and it said that next day after his suicide he was emailed that it was solved and that he did not own any money.", "score": 35, "replies": []}]}, {"body": "What would they be accountable for?\n\nAs it stood when the screenshot was taken he owed the displayed cash value of the exercised options to the broker. He could obtain this by either exercising the options he bought as part of the spread, by selling his positions in those options to a willing buyer, or by depositing cash. \n\nIt was an accurate representation of the current state of the brokerage account, just didn't include the full list of available paths forward to settle things out right there on the home page of the app. It even tells you in the app before you trade options that this specifically is a possibility when trading spreads. \n\nGenuinely what do you think the brokerage should do? Automatically exercise or close out positions without asking you if one leg gets exercised? Lie about the current status of the brokerage account? Either of those things present major challenges in terms of compliance with SEC regulations.", "score": 6, "replies": [{"body": "They sent him margin call emails demanding immediate deposits knowing that the overall value of his account is in the green. I actually have no idea how you're defending this shit", "score": 1, "replies": [{"body": "They sent those emails because they're not allowed to just automatically liquidate your positions without permission.\n\nThe brokerage account had a negative cash balance because the sold options were exercised. That negative cash balance will result in a margin call. Margin calls can be solved by either depositing money or liquidating positions. All of this is explained to everybody wanting to add permission for options to their brokerage account.", "score": -1, "replies": []}]}]}, {"body": "2007 has entered the chat", "score": 1, "replies": []}]}]}]}, {"body": "He was from my hometown, threw himself off the parking garage in our downtown. Shit was tragic", "score": 15, "replies": [{"body": "Naperville? I think there's been a few that have jumped from the parking garages or in front of a train", "score": 1, "replies": []}]}, {"body": "First thing I thought of when I saw this too. Such a sad story", "score": 20, "replies": []}, {"body": "Is there any link to this story here? I've never heard of it.", "score": 9, "replies": [{"body": "It was back at the start of the pandemic. https://www.cbsnews.com/news/alex-kearns-robinhood-trader-suicide-wrongful-death-suit/", "score": 70, "replies": [{"body": "Can you imagine being the coder/designer that designed this screen? I feel like RH should have taken some responsibility or something", "score": 41, "replies": [{"body": "That will only lead to more government regulation, less freedoms and more overreach.\n\nPeople should just educate themselves before they get into something. Too many stupid impulsive decisions and then they’re surprised if it explodes in their face.", "score": -17, "replies": [{"body": "Youre so naive", "score": 10, "replies": [{"body": "![img](emote|t5_2th52|27189)", "score": 2, "replies": []}, {"body": "Those people are naive taking risks they're not able to take and not being able to oversee the consequences.", "score": -2, "replies": [{"body": "Just shut the fuck up you sound angsty af", "score": 1, "replies": [{"body": "Ahhh this is the reddit I used to know. :) You have some anger management issues bro.\n\nYou also don’t seem to know what “naive” is.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Just read that whole article. I’m sick, I really wish I didn’t know this but to bear it is the least. God bless that family. that’s horrible genuinely will be thinking about this all week", "score": 14, "replies": []}, {"body": "Man that is awful", "score": 28, "replies": []}, {"body": "news in 2021 feb, the verdict?", "score": 1, "replies": []}, {"body": "Holy fucking shit, he actually did it? Fully regarded. Good that he's not breeding.\n\nDownvote me to hell, I've been suicidal before for way better reasons than \"I'm too lazy to google ***anything*** ***at all*** about this before **I put my whole family through an unfathomable pain they will carry for the rest of their lives.**\" And I still didn't go through with it because I didn't want to do that to my people (some people like me for some reason).\n\nSeriously, fuck this guy. I feel so bad for everyone that cared about him.\n\n...if he actually wanted to die for other reasons, and this was just an excuse, that's different though. Nobody owes anyone their life, it's just that this doesn't appear to be something he wanted, so he basically fucked everyone (and himself) over for no reason whatsoever other than his own stupidity, and that's...shitty.", "score": -10, "replies": [{"body": "I don't know why you feel superior to him lmao, don't think you are better because you had \"better reasons\". The both of you think the same, \"i got a problem so I might just kill myself to not deal with it\".", "score": 2, "replies": [{"body": "...tell me with a straight face that being in fucking debt is IN ANY WAY EQUIVALENT to losing your spouse unexpectedly, or going through decades of childhood abuse. I fucking dare you. Go up to an abuse victim or a grieving widow (both of which I've been) and say that shit.\n\nI mean for fuck's sake, even without bankruptcy, did this fool think he would be in prison? Worst they could do is garnish wages, and even then, that's...really not a reason to die? That's just deeply annoying, and even then, there are ways around it.\n\nI'll double down for the regarded folks in the back: either this was the dumbest kid I've heard of in a long, long time, or he was already just done with life and needed (what he felt was) a reason. I desperately hope it was the latter, for his sake and his family's sake.", "score": 0, "replies": []}]}]}]}]}, {"body": "Robinhood encourages people who have no understanding of options to trade complex options strategies. Screens like this wouldn’t be any issue if people avoided complex financial instruments they do not understand. Just go gamble of sports if you have an itch to scratch.", "score": 15, "replies": []}, {"body": "You’d think that you’d at least wait to see how the bankruptcy filing goes before offing yourself… but then, I suppose people with good decision-making skills and impulse control wouldn’t have been gaming like that of fucking Robinhood of all platforms in the first place", "score": 6, "replies": []}, {"body": "Yeah, his account showed a $700k deficit if I remember correctly. Sad.", "score": 3, "replies": []}, {"body": "Killing yourself over a money problem that you don't understand and isn't actually real without consulting anyone is insane.", "score": 4, "replies": []}, {"body": "Why does Robinhood do this for?", "score": 2, "replies": []}, {"body": "I thought it was a bad glitch and it said he owed millions but didn't owe anything?", "score": 1, "replies": []}, {"body": "That was when we had to retire the R ticker.", "score": 1, "replies": []}, {"body": "Alexander Kearns", "score": 1, "replies": []}, {"body": "I remember this, damn that was like 9 years ago now rip", "score": 1, "replies": []}, {"body": "Read about that shit in a case study, tragic", "score": 1, "replies": []}, {"body": "lol it wasn’t this situation it was the market closed on Friday and he sold some spreads. The volitilty due to lack of bids made the sold preportion look 10x more expensive thus making it look like he lost a shit ton of money despite it not being true", "score": 1, "replies": []}, {"body": "WOW THATS INSANE STORY", "score": 1, "replies": []}, {"body": "Big dumb", "score": 1, "replies": []}, {"body": "So, how does this work? Trying to understand it. The other open options that is not assigned will cover the deficit of the option that is assigned?", "score": 1, "replies": []}, {"body": "IIRC, it was $700k and Robinhood had a computer glitch or poor programming that caused it. They also weren’t accessible over the weekend.", "score": 1, "replies": []}, {"body": "Yeah crazy coincidence, my ex was his resident assistant at the time in college. Happened in 2020.", "score": 1, "replies": []}, {"body": "I remember that event. Sad times for the family . To think someone would offer themselves over money is crazy to me, but I guess I’ve never been in that position. I had to contemplate that rash of a decision.", "score": 1, "replies": []}, {"body": "He was actually up 3k and got a message for 730k losses? How?", "score": 1, "replies": []}, {"body": "This kid killed himself because he wanted to", "score": 0, "replies": []}, {"body": "I don’t have any sympathy either, maybe do some research first lol", "score": -1, "replies": []}, {"body": "The kid was a dumbass. Who the fuck enters that trade without knowing what they were doing!!", "score": -74, "replies": [{"body": "You must be new here.", "score": 51, "replies": []}, {"body": "Literally everyone here", "score": 42, "replies": [{"body": "It wasn’t a question my guy…", "score": -31, "replies": [{"body": "Look man I don't know your life", "score": 18, "replies": []}, {"body": "it literally was a question", "score": 9, "replies": [{"body": "Look up what rhetoric is.", "score": -6, "replies": [{"body": "a rhetorical question is still a question", "score": 4, "replies": []}]}]}]}]}, {"body": "I mean, robin Hood certainly didn't help at the time and I believe they lost the case to the kids family about not protecting him as a consumer\n\nBig difference between owing 400k and 400 dollars", "score": 16, "replies": [{"body": "Wut? The case never went to trial. RH settled with them.", "score": -10, "replies": [{"body": "Settled, lost, I don't see a huge difference there", "score": 15, "replies": [{"body": "They settled the case for over $7.5mill. Rarely will you see these cases go to court. That’s a win.", "score": 0, "replies": []}]}]}]}]}, {"body": "300k vs 400k?\nBig difference!\nYep, that would have changed my mind.", "score": -91, "replies": [{"body": "Not 300k its was $300.00", "score": 47, "replies": []}, {"body": "Congrats, you are king of the regards.", "score": 34, "replies": []}, {"body": "Illiterate fuck", "score": 14, "replies": []}]}]}, {"body": "https://preview.redd.it/wf4qv24lkthd1.jpeg?width=1170&format=pjpg&auto=webp&s=d802fc752a0856edf7a79c41ff872fbb068f7786\n\nFirst time? In my case, RH automatically sold the shares on Monday 24hr market. The interest payment over the weekend really hurt…", "score": 881, "replies": [{"body": "Does RH actually charge interest for having a deficit? I had a deficit of $1M and don’t remember having to pay any interest on that.", "score": 207, "replies": [{"body": "Jogged my memory a bit. So on April 24 2024 QQQ last minute of trading sharply dropped and my put got assigned out of the money on my short leg. But my long leg all expired worthless so my account was in deficit without long leg to counter.\n\nhttps://preview.redd.it/z2l9x59ozuhd1.jpeg?width=1170&format=pjpg&auto=webp&s=e454c960cc811a700a496ff8e97ef2ccab6a07b0", "score": 106, "replies": [{"body": "https://preview.redd.it/x27kjxei0vhd1.jpeg?width=1170&format=pjpg&auto=webp&s=d23cc383f5d17b2e6f31d860a968f2e23bfdaf2a\n\nSo actually interest payment was not as bad as the bad fill by RH on market order to cover lol", "score": 64, "replies": [{"body": "https://preview.redd.it/zdomlum11vhd1.jpeg?width=1170&format=pjpg&auto=webp&s=5c50b7137ab654caa7ea73fe26a10984c6224ab1\n\nLearned my lesson of closing early even if at max lost since it can get worse lol. Lost $8k due to bad market order fill after hours.", "score": 46, "replies": []}, {"body": "https://preview.redd.it/9j9zhfqk0vhd1.jpeg?width=1170&format=pjpg&auto=webp&s=95f315a517cd32e7ba6f18f49a3c6f90ffff17c0", "score": 17, "replies": [{"body": "https://preview.redd.it/u0q9jyxm0vhd1.jpeg?width=1170&format=pjpg&auto=webp&s=5513b2dceeb2aac1fd499314b07c58a08dec27ba\n\nWhen it happened with long leg intact there was no interest.", "score": 24, "replies": [{"body": "Yea ive got butt fuked by pin risk a couple times. \n\nKeep in mind: option exercise deadline is 2:30PM PST (1.5 hrs after market close) after expiration. So keep watching after hours action. If the stock goes ITM before 2:30 call your broker asap, esp if your long leg is also ITM.", "score": 14, "replies": []}]}]}]}, {"body": "If you were assigned OTM then that should have given you some free profit between the exercise price and market price though? Assuming it didn't move too much on Monday open. ", "score": 1, "replies": [{"body": "It was during the week actually. RH used market price and lost me $8k on the trade. $442 exercise, $421.37 fill. If it had moved even further it would have been in even deeper doo doo. Interest charges because it took 3 days to settle.\n\nhttps://preview.redd.it/ews3ecg6yxhd1.jpeg?width=1170&format=pjpg&auto=webp&s=619aa04bc062759465699e7c67fa129d0b20cc5b", "score": 3, "replies": []}]}]}, {"body": "Check your statements carefully", "score": 3, "replies": []}]}, {"body": "My heart rate would jump to 350 if I ever saw this on my account.", "score": 25, "replies": [{"body": "https://preview.redd.it/7o5f5okasvhd1.jpeg?width=300&format=pjpg&auto=webp&s=ef989f806c3080a07374b5c17f208836de5a8f99", "score": 19, "replies": []}]}, {"body": "Fukin had same shit last week with Schwab. Early assignment overnight huge overbalance on account I sold the stocks the next morning I literally held the stocks for several hours and I get hit with interest like WTF SHITTIN ME!? Schwab rate is like 21% too it’s fkin bs", "score": 28, "replies": []}, {"body": "Okay now that's an epic 'first time?' Response if I ever seen one! Deserves the flex!", "score": 9, "replies": []}, {"body": "Not using dark mode is the crime here", "score": 1, "replies": []}]}, {"body": "https://preview.redd.it/8ksg5r0x4uhd1.jpeg?width=1284&format=pjpg&auto=webp&s=eac16bf4371b069acabf71b374c5ce8a58ce1f7d", "score": 1050, "replies": [{"body": "https://preview.redd.it/810od12opuhd1.jpeg?width=718&format=pjpg&auto=webp&s=9b4fd89ce67961ca972850b2e11b7a94ae48fe6a", "score": 189, "replies": [{"body": "![img](emote|t5_2th52|29637)", "score": 3, "replies": []}, {"body": "sir this is Wendys.. missing the dumpster icon...", "score": -1, "replies": []}]}, {"body": "Uncle Ben Dover", "score": 17, "replies": []}, {"body": "why cant i get my port up but i can get my social points up ![img](emote|t5_2th52|4260)", "score": 2, "replies": []}]}, {"body": "Robinhoods true purpose is to get random people to off themselves. Otherwise they would have fixed this by now", "score": 1226, "replies": [{"body": "It’s such a simple fix. Like a notice on page or an email stating that the total afterhours isn’t reflective of the total value of the portfolio, since it is being settled. Not asking for more money lol. SOMETHING.", "score": 195, "replies": []}, {"body": "Fix what? The page straight up says exactly what’s happening and what to do? I know reading is hard but fuck did you even try?", "score": -338, "replies": [{"body": "You aren’t very smart", "score": 201, "replies": [{"body": "You probably hold options until expiration too", "score": -197, "replies": [{"body": "You gotta be trolling bc I refuse to believe someone can be this dense 😭", "score": 113, "replies": [{"body": "He really isn’t. You see all sorts of creatures around wsb.", "score": 67, "replies": []}, {"body": "I’m convinced you don’t even know why OP has this message and why I’m laughing at all of you idiots.", "score": -99, "replies": [{"body": "You’re either too new to trading or too unfamiliar with RH to understand what you’re looking at. I know reading is hard but Im rooting for you to figure it out (if you are indeed not trolling, but I still think you must be a troll because surely nobody is this stupid)", "score": 59, "replies": [{"body": "You gotta be dumb as hell to think this is a Robinhood issue. This is how option work at every broker. You clearly have no fucking idea how options work…", "score": -9, "replies": []}]}]}]}]}, {"body": "😂", "score": -89, "replies": []}]}, {"body": "r/UsernameChecksOut", "score": 14, "replies": []}]}]}, {"body": "Can someone explain how this is a positive outcome?", "score": 189, "replies": [{"body": "I sold a put at $417.50 and bought a put at $415. MAFT was well below this all week so I was cooked regardless, but the put I sold got exercised early so I exercised the put I bought and ended up losing $250 minus the premium I got initially", "score": 304, "replies": [{"body": "Just be happy this is not after expiry, as it can happen. Then you wouldn't be able to exercise your long.", "score": 109, "replies": [{"body": "Well that’s terrifying. Is it best to try and exit positions like these once they are ITM usually then?", "score": 67, "replies": [{"body": "Just never hold a sell order until expiry. Even it's it's OTM. Look up pin risk. \n\nIt's terrifying shit.", "score": 126, "replies": [{"body": "Always close before expiration, even if it should expire worthless but the price isn’t\n\nOtherwise you enter a complicated zone. And that last couple of minutes when the price jumps around a bunch often allows shenanigans", "score": 2, "replies": []}, {"body": "It sounds like this does not apply to naked calls/puts. Only when the net profit of owning multiple option types is uncertain. I only skimmed the Investopedia page. Obviously there is risk to holding any option to expiry that is near the money, but for things you think won’t pass your strike price, I don’t see any reason not to hold an option you sold to $0. Because then you get to keep all the credit you generated. Am I misunderstanding this?", "score": -17, "replies": [{"body": "Yes. The first hour or so of AH activity counts for options settlement. If the company makes so.e sort of announcement that causes a big move in the stock price after hours it can and will fuck your short leg and cause assignment. \n\nIf you were doing a spread and had a long leg as defense, you won't be able to excersize it to cover and now you are royally screwed. It's called pin risk, it's real, and it's why you should always close down short option positions before expiry, even if it's way OTM and you are only buying it back for $0.01, you want to take that risk off the table.", "score": 22, "replies": [{"body": "I've been reading up trying to figure out how options work, not just big picture, but the actual process. Nothing I've found has mentioned any of this or what it actually means to be \"assigned\". It still doesn't make any sense to me.", "score": 6, "replies": [{"body": "You get assigned if you are short an option that is ITM at the time of expiration. You can get assigned early as well, but probably wouldnt happen unless it is deep ITM. If you are short a call option and get assigned that means you are forced to sell 100 shares of the underlying stock at the strike price of the option. If you are short a put option and get assigned thateams you are forced to buy 100 shares of the underlying stock at the strike price of the option.\n\nGenerally you can think of assignment and excersizing as opposite ends of an In The Money option transaction. The party who is long the option excersizes it, and the parry that is short the option gets assigned. \n\nSo for example, say I sold (am short) a put that expires today with a strike price of $20, and the stock closes at $15. The person holding the put (long) that I sold is probably going to \"excersize\" the right the contract gave them to sell 100 shares at the strike price of $20/share. As the counterparty who sold the contract, I am \"assigned\" the responsibility of fulfilling the obligation of the contract to buy 100 shares at $20/share.\n\nIt would be the opposite for calls. The person long who is excersizing their rights under the contract gets to buy 100 shares at the strike price and the person short who is assigned the obligation has to sell 100 shares at the strike price. \n\nNow, it's a little more complicated in the back end. When you buy/sell an option you aren't immediately matched up with a specific person on the other side. The broker you did the trade with has a list of everyone who is short that contract through them and when they get notice from the OCC that one of their contracts has been excersized they will randomly select one of their customers who is short that contract to receive the assignment. \n\nGenerally though, you should always assume that if you are short an option that is In The Money (ITM) at the time of expiration then you are virtually guaranteed to be assigned.", "score": 22, "replies": [{"body": "I dont think this explaination can get better bravo", "score": 4, "replies": []}]}]}]}, {"body": "Found the fucking moron.", "score": -10, "replies": []}]}]}, {"body": "Exit before expiration. Thats when you can get screwed.", "score": 16, "replies": []}, {"body": "Dude holy shit stop trading fucking options. You should never hold until expiration.", "score": 22, "replies": [{"body": "Wdym? The whole point of debit spread is that you want them to expire itm. Can you explain further?", "score": 7, "replies": [{"body": "I got you:\n\nSpreads have a theoretical max loss. That’s means exactly what it means, the max loss you set up with a spread is only theoretical and can be broken. A few common was a spread is broken is pin risk and dividend risk. In pin risk you are at risk of the spread ending between the two points of your spread. Lets say you set a call debit spread you’ll be long the 10c and short the 15c. The stock ends at 12. Your long call would be exercised while your hedge the 15c expired worthless, pinning you with the 100 shares long at 10c. Now most options expire Friday so you’ll hold these shares into the weekend unhedged (most you of in this sub doesn’t even have enough to cover the 100 shares opening you to significant risk). Monday opens the stock for fun is trading at 7. You’ll now lose 300+ blowing your entire hedge. Now magnify this with 100+ contracts on underlying that trade at $500+ per share and suddenly your entire account is blown. This is the reason brokers won’t let you hold options spread into close if you don’t have the $ to cover exercise / assignments. The overall entire industry understands that you don’t hold options into expiration due to these risk and it’s 1000% better to close your option for 1$ than hold.\n\nThis was all on mobile so sorry for any errors", "score": 39, "replies": [{"body": "Thanks, very helpful. I'll make sure to either sell or close my vertical spread before exipry date.", "score": 2, "replies": []}, {"body": "So you're saying exercise as soon as possible and don't get greedy. It also seems like if the price change is under the amount you're just left having to buy the stock outright? So don't risk it, is what you're saying. Nothing necessarily bad about it expiring, but waiting for it to expire and hoping it's still in range is foolish?\n\nI don't trade options because i don't know what the hell i'm doing. Just trying to understand one piece at a time.", "score": 1, "replies": [{"body": "It basically never makes economic sense to exercise vs selling. Very rarely does it", "score": 5, "replies": [{"body": "I thought those were interchangeable. This is why i don't trade options.\n\nBased on context, i think you mean selling immediately sells whatever options you have and exercising means buying the stock at whatever price was agreed to.", "score": 1, "replies": [{"body": "Correct! Exercise very rarely makes sense since options with time left have time value and speculative premium", "score": 2, "replies": []}]}]}]}, {"body": "This is wrong. If I am long the call then I am the one who would exercise if I wanted to own the shares at that price. I I own the cal at 10 and stock is at &12, sell the call for $12 plus premium. If I want I can buy the $15 I am short back for pennies. Otherwise it expires worthless", "score": 1, "replies": [{"body": "No, that’s not what he’s talking about. What you’re describing is the moves you can make around 3:00pm on Friday. In his situation he’s describing a scenario where the ticker might be at $9, you’re long $10c and short $15c with no intention of actually owning the stock, you only wanted to cash in on a potential rise. If you look away at market close figuring your options are worthless and you’re letting them expire, and then the price goes to $12 in afterhours, and you don’t have a DNE in place, your brokerage will attempt to exercise the call on your behalf.", "score": 1, "replies": [{"body": "I guess I have never had that happen with my options", "score": 1, "replies": [{"body": "But if it goes to $12 and the call was exercised at $10, why couldn’t you just sell it at $12 and take the $2 profit?", "score": 1, "replies": [{"body": "Because that’s only one possibility of how it would play out. If you’re lucky, it hits $12 in after hours, your broker exercises you at $10, and then it opens Monday morning at $16 and you make a quick fortune completely by accident.\n\nBut the alternative can be true, you look away at 3:58pm and did not sell your OTM long option. Price hits $12 in afterhours, broker exercises you, then at 6pm, price comes back to $9, then $8, and opens Monday at $7\n\nSo while it could be beneficial to you in some scenarios, it’s also opening up your price range by a large amount. For example, if I want to buy $2,000 worth of NVDA options with a max loss of $2,000, then that’s the range I’m playing in, where a $1 price change moves me like $200-$300. If those options were exercised, we might be looking at more like $350,000 or so, where now a $1 price change could be moving our value by $3,000 or whatever the amount of contracts came out to be. So sure, if I’m lucky I gain a crazy amount by accident, but it’s not worth the risk of losing a crazy amount", "score": 1, "replies": []}]}]}]}]}, {"body": "/u/hornetsarebad since I don’t want to retype shit ^ read this and explain to me what I don’t know? Op was either early assigned on meaning Monday they can just exercise their long and cover the maintenance or they are just assigned in general and now are unhedge. This message is 100% accurate and clear you don’t understand options.", "score": -2, "replies": [{"body": "I think the question is if you are long the 10c, i.e. you bought the call, would you not be the one exercising it?\n\nFrom your original write up, it seems like it gets auto-exercised. Is that what happens?", "score": 1, "replies": [{"body": "Hi sorry I didn’t see this comment. Yes most brokers will auto exercise contracts itm unless you have a dne (do not exercise) which requires you to call them and say that ahead of time. But if you are placing dne on options itm you are basically forfeiting the entire value which goes back to my original statement. It very rarely make sense to hold options until expiration.", "score": 1, "replies": []}]}]}]}, {"body": "Also to really drive the point home. You sign a document stating you understand all these risk which is why I laugh at people who trade spreads thinking they are completely safe", "score": 10, "replies": []}, {"body": "Simply: Hodling to get the theoretical max premium on verticals isn’t the way. Exit before expiration ALWAYS. A sudden price movement while you’re in the black could lose it all.\n\nMarket makers are usually on the other side of transaction. Let the market makers hold the bag.", "score": 2, "replies": [{"body": "Do you guys usually sell the spreads peacemeal or close your positions? What if the OTM shorts have no sellers coz they are OTM and v.v.?", "score": 1, "replies": [{"body": "Well the key is not getting into that position to begin with, trade only options which both sides have volume and liquidity. So that eliminates a lot of possibilities, and narrows down to just a few potential trades.\n\nSometimes the bottom can fall out of one side unexpectedly. In response (usually emotionally) I may part off a side of the spread, but historically it increases the loss. The value of naked calls or puts decay faster than a spread does. I’ve had the best long term results closing the position.", "score": 2, "replies": []}]}, {"body": "I let credit spreads expire worthless everyday. Things like SPX are only cash settled and don’t have a risk of being assigned anything either.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Why exercising your put instead of selling it. You may have left a bit of money on the table.", "score": 14, "replies": []}, {"body": "Ive never thought about writing a put, then purchasing a protective put at a slightly lower price 🤔 ", "score": 5, "replies": [{"body": "Bro is on an options gambling subreddit and just now learning what a spread is.", "score": 46, "replies": [{"body": "lol i know what spreads are, just never thought of this one… I like writing calls and buying puts… I think its called a collar", "score": 4, "replies": [{"body": "This one is the most vanilla bull theta strategy there is.", "score": 7, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Yo what the fuck are you talking about, it’s literally just a bull put spread lmao. The max loss is the spread minus the net credit collected when the position was opened.", "score": 5, "replies": [{"body": "I'm a moron who belongs here", "score": 3, "replies": [{"body": "Hats off to you.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "When an options is assigned in a spread, ie call spread where the short leg got exercised early,  do you always exercise the other long leg to cover?", "score": 1, "replies": [{"body": "Only happened once so far. Didn’t like being wed to a single stock so I switched from wheel strat to credit spreads. For my own sanity I’ll probably always exercise the other leg just to have a clean break and stay within my initial gain/loss calculation.", "score": 2, "replies": []}]}]}]}, {"body": "It goes away if you just close the app.", "score": 158, "replies": [{"body": "De-lete app, block all unknown callers on phone, forward all RH emails to trash. Forever solved!", "score": 77, "replies": [{"body": "Debt goes away on its own after 7 years. Don't even need to declare bankruptcy, just don't talk to them.", "score": 26, "replies": []}, {"body": "Don’t use RH", "score": 3, "replies": []}]}]}, {"body": "Can someone explain like I’m 5", "score": 53, "replies": [{"body": "You told wife’s boyfriend you’d buy him condoms at the store for $5 and he needs them by Friday. You have no car so your buddy agrees to pick them up for you and will drop them off Friday. Thursday night he decides he’s in the mood and demands condoms early. You gotta walk your fat ass down to the store and pay a little extra since you went to CVS instead of Walmart. This is not financial advice", "score": 222, "replies": [{"body": "Your wife’s boyfriend uses condoms?", "score": 38, "replies": []}, {"body": "PUT YOUR HANDS UP Grabeyboi!!! POLICE ARE ENROUTE! PREPARE TO BE BOOKED FOR PROVIDING ILLEGAL FINANCIAL ADVICE!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 39, "replies": []}, {"body": "wife’s boyfriend is CRAZY", "score": 25, "replies": []}, {"body": "We do not need discussion of condoms here apart from Wendy’s dumpster", "score": 2, "replies": []}]}, {"body": "You are too young to be doing this without an adult guiding you. Ask a parent or guardian", "score": 8, "replies": [{"body": "I’m 20", "score": 1, "replies": [{"body": "In the previous comment you said you a were 5", "score": 5, "replies": [{"body": "Is this satire or are you regarded?", "score": 3, "replies": [{"body": "Your understanding of sarcasm points more towards being 5 then 20", "score": 6, "replies": []}, {"body": "Sorry, man… I guess I misunderstood what you were saying when you said “like I’m 5”", "score": 2, "replies": [{"body": "Please don't ever make any financial decisions beyond buying more crayons.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "You shoulda have said eli1.", "score": 5, "replies": []}, {"body": "You tell the neighborhood bully that you will buy a Pikachu Pokemon card for $50. Said bully then finds a nerd and forces him to sell the card for $50. Now the bully goes to you and tells you that owe him $50 and he will beat your ass unless you pay him. So it's pretty scary, you don't have $50, and think you're going to get a beating. What bully doesn't tell you is that you also own a card worth $50 that you could easily sell to pay him back.", "score": 12, "replies": []}]}, {"body": "Spreads are for nerds... Nerds don't get pussy... OP... Are you a virgin?", "score": 292, "replies": [{"body": "No, I am a pussy tho", "score": 330, "replies": [{"body": "Getting fucked in the ass by the wife’s gf doesn’t count", "score": 34, "replies": []}, {"body": "I am a pussy too, trading brakes us... we rebuild if we want and make $$$$", "score": 8, "replies": [{"body": "[deleted]", "score": -12, "replies": [{"body": "Time has no favor with the poor or the stupid", "score": -18, "replies": []}]}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "And no, this offer is just for op, we want the low hanging fruit", "score": -6, "replies": [{"body": "he will be a king one day", "score": -4, "replies": []}]}]}, {"body": "I will give 1 hr cause you seem extra ghey", "score": -24, "replies": []}, {"body": "quick vagina defense system... they will erase this", "score": -23, "replies": []}]}, {"body": "When my wife spreads I’ll gladly be a nerd if spreads are for nerds.", "score": 1, "replies": []}]}, {"body": "Isn't this what made that kid go long on rope?", "score": 106, "replies": [{"body": "Yup", "score": 8, "replies": []}, {"body": "Yep", "score": 4, "replies": []}, {"body": "it was a train", "score": 1, "replies": []}]}, {"body": "I can't believe robinhood still delivers this message to people with credit spreads. Especially since it's a app alot of beginners use. Crazy. Hence the dude killing himself a few years back.", "score": 38, "replies": []}, {"body": "Hahahahahha regard.  Options my regard. \n\n😂😂😂😂😂😂", "score": 59, "replies": []}, {"body": "I had a moment like this.\n\nI had a TSLA iron condor that I tried to close on expiration day but I couldn't get the order to fill no matter what I did to the price. So I stupidly decided to let the whole thing expire since TSLA was trading within the brackets anyway and I would save the few dollars it should take to close out that position. \n\nExcept right at close, TSLA shot up and closed above my short call leg, and less than a minute later the market closed and everything else expired. I was left short 100 shares of TSLA at like $620 a share. \n\nTSLA collapsed in after hours trading and Robinhood cancelled the transaction later that day.  it continued to collapse over the weekend and if I had been able to hold on to that short position I would have made something like $3000 instead of the $80 I made on the Iron condor.\n\nthis was a couple of years ago, before the stock split.", "score": 18, "replies": [{"body": "TSLA too scary for me", "score": 11, "replies": []}, {"body": "Next time instead of trying to close the entire condor (since one side is worthless anyway) just sell the side that is closer to the price of the stock. Or, sell both sides in separate trades. That has worked for me when I could not get the whole condor to trade", "score": 2, "replies": [{"body": "Yes, that's what I started doing after this, breaking it into individual legs and closing them one at a time.  Short side first then long.", "score": 1, "replies": [{"body": "I know that is a pain in the @$$ but sometimes in a thin options market you gotta do it", "score": 2, "replies": []}]}]}, {"body": "Why did I just read *iron condom* ![img](emote|t5_2th52|31225)", "score": 1, "replies": []}]}, {"body": "I thought RH was going to be more transparent about this sort of situation after that kid who lost $300 was told he owed $400k and jumped in front of a train. \n\nI guess RH was just full of shit? Not surprised.", "score": 29, "replies": [{"body": "You are correct", "score": 2, "replies": []}]}, {"body": "Pay your student loans with credit cards and bank loans. Hang out for a few years then file for bankruptcy.", "score": 13, "replies": [{"body": "Id, except I never filed bk, got sued 6x in one year. Countersued and got two banks to both pay me $15k to go away. I never paid anything, eventually it goes away… in Texas.", "score": 2, "replies": []}]}, {"body": "Don’t kill yourself. It has happened before. Deficit isn’t a debt.", "score": 11, "replies": []}, {"body": "Welcome to the crew lad!", "score": 16, "replies": []}, {"body": "The regarded thing to do is sell both the shares and the long put to collect the time premium remaining on the long. You already collected all the premium from the short when the other end exercised it.", "score": 7, "replies": []}, {"body": "Just delete the app.", "score": 9, "replies": []}, {"body": "What happened here? I just invest in etfs and basic stocks. Idk wtf any of this means", "score": 11, "replies": [{"body": "He did a bit of gambling and lost a little bit of money. Nothing nearly the magnitude of the number presented here.", "score": 13, "replies": [{"body": "Wouldn’t he just lose the money he invested? Like if he spent 1k on a spread that’s his max loss? Or no", "score": 2, "replies": [{"body": "Basically one leg of the spread was assigned making it *seem* like he was fucked, but really he still had that other leg to protect him. Robinhood should present this more clearly so people don’t kill themselves", "score": 3, "replies": []}]}]}, {"body": "Ask someone who has experience and seems to know what they are doing. PM me if you want and I’ll do my best to help", "score": -1, "replies": []}]}, {"body": "It's crazy they haven't changed this screen yet knowing that kid killed himself over this happening. I'm sure they get tons of emails when this happens too so I bet it causes a lot of unnecessary support work.  \n  \nJust say \"shit will be fine Monday morning, chill out\"", "score": 7, "replies": [{"body": "Another reason why I will not use Robinhood", "score": 5, "replies": []}, {"body": "This screen is very scary, it only says \"you lost $40,000\" and not you also have 100 shares of SPY or whatever that you can sell to pay off the 40K. For someone who doesn't understand assignment, it can really seem like the end of the world.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Unless you get pinned. I had 530/531 call credit spreads on SPY with a max loss of $40 each expiring on Thursday. SPY hit 530.84 at the deadline for option exercise so the 530 short call was exercised but my 531 long call protecting it was not as it was worthless. I know how this works though and covered my short with shares afterhours to lock in my loss since the long calls didn't. I normally sell before close but I rolled the dice too close to the bell. No big deal but only because I understood the postion and options.", "score": 6, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "It worked out ok because I wasn't oversized so buying shares was easy for me and I actually was able to have a smaller loss than what the spread defined. It could get super sketchy though if someone gets into a too big position and doesn't understand what and how to manage it.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I do that too usually but since it was technically defied risk and I thought the MM were going to push us just under 530 to close I rolled the dice.", "score": 2, "replies": []}]}, {"body": "Only bc you had funds to buy shares to cover ", "score": 1, "replies": []}]}]}]}]}, {"body": "I apologize, I’m out of the loop. How do you go negative on stocks? I didn’t even realize that was a thing", "score": 3, "replies": [{"body": "If you you spent more money buying the stock position than the money you actually had in your account you have borrowed money from the brokerage firm to make the purchase. The amount you borrowed is called margin and is limited to a certain percentage of the total value of the account. If the value of the equity you purchased drops in value, it lowers the total value of account which could  cause the amount you owe to exceed what is permitted and you are issued a “margin call,” you have “gone negative” on your equity, meaning that if you sold the equity you would have losses money on the trade.", "score": 2, "replies": [{"body": "Holy shit. Thank you for the incredible response. It’s greatly appreciated", "score": 1, "replies": []}]}]}, {"body": "Happened to me on Amazon credit spread, the short leg was assigned on Friday. My account showed a deficit of 1 million. I wasn’t worried but thought could make money if Amazon rises on Monday. Robinhood closed the position first thing after trading bell.", "score": 3, "replies": []}, {"body": "I was awoken to a $2m margin call Thursday. Someone had exercised their puts early. \n\nI had done a 1/3 ratio put spread ahead of this correction and sold 2x the lower puts to lock in a big profit Monday morning. This left me with a basic short put spread that was way ITM. While the higher puts (the ones someone exercised) had very little premium, the lower puts still had $4+ worth of premium. \n\nThanks for the extra $20k free on the trade I guess???", "score": 3, "replies": []}, {"body": "Can someone explain how that’s not the correct balance?", "score": 4, "replies": [{"body": "I owe someone 41k and someone owes me 40.75k (rounding a bit). Robinhood is only showing me that I owe someone 41k on this screen, but on the next part it walked me through (not with much explanation) what my choices were to cover the balance", "score": 27, "replies": [{"body": "I follow now. Thank you. It’s a shame about that one kid then", "score": 6, "replies": [{"body": "They really do make it look as scary as possible. This is one trade with one contract, so I can totally see how someone who made a play with 10 contracts would consider the rope if they saw something like this", "score": 10, "replies": []}]}, {"body": "I'm sure someone told a developer to generate an automated Scary Warning Email for negative options balances, and never got around to asking for an automated check on the net of ALL options first.  Probably because a single SWE is easy to automate, but \"net the thousand options someone could theoretically have open simultaneously\" would generate excessive system load.", "score": 3, "replies": []}]}]}, {"body": "That’s pocket change", "score": 4, "replies": []}, {"body": "Last week I got assigned. I was -$100k for whole day.", "score": 5, "replies": []}, {"body": "all of my stocks are managed by someone else, but sometimes i browse this sub randomly when i see it on the front page. can someone explain this to me?", "score": 3, "replies": [{"body": "In short: you lent $100 to Person A and borrowed $100 from Person B at the exact same time, with the expectation that you’ll get your $100 back from A in order to pay back B in exactly two weeks. Your bank account/wallet stays at the exact same point it was at when you started since they cancel each other out.\n\nHowever, three days later, Person B comes knocking on your door and says they need their $100 back today, right now, and they’re not leaving without it. Person A still has the $100 they owe to you, so you have no choice but to give Person B another $100 of your money. Now, your bank account/wallet is down $100, but you will have $100 coming back from Person A later which will bring you back to square.\n\nThat’s the basic concept of what’s happening here, except we’re looking at thousands of dollars and the figures aren’t perfectly even nor static. It’s more like they owe person B $41,000 and Person A owes them roughly around $40,000", "score": 2, "replies": [{"body": "aha, that was an awesome explanation. thank you!", "score": 2, "replies": []}]}]}, {"body": "Can someone ELI5 this for me? Just assume I know nothing.", "score": 2, "replies": [{"body": "Please see my tldr comment above", "score": 2, "replies": []}]}, {"body": "\"still don't fully understand the....\"\n\n\nYeah this isn't going to end well", "score": 2, "replies": [{"body": "I got this. I think. Maybe.", "score": 3, "replies": []}]}, {"body": "Just another reason to not get cute with options", "score": 2, "replies": []}, {"body": "At least you didn't long $ROPE over it", "score": 2, "replies": []}, {"body": "This makes me want to not mess with margin ![img](emote|t5_2th52|4260)", "score": 2, "replies": [{"body": "This may be tldr for some, but here goes:\nI go in and out of margin all of the time, just keep in mind that margin means you borrowed money to create the position whether it is stocks, options, futures, etc. The amount you can borrow is limited and if the position becomes a loss, you could get a “margin call” meaning your margin debt has exceeded your limit, and you have to add money to your account by adding more dollars or selling one or more positions.", "score": 1, "replies": []}]}, {"body": "This wouldn't be an ongoing problem/scare if Robinhood didn't allow everyone with zero experience  to trade option spreads..", "score": 2, "replies": [{"body": "Wouldn’t say it is a lack of experience, as I was covered. Instead they need a simple message saying “the put you sold as part of your credit spread has been exercised, so you need to exercise the put you purchased, or hit this button to buy 100 shares at current price to fill your obligation.” Not confusing.", "score": 3, "replies": [{"body": "Not directed towards you OP, but if the average Joe knew how spreads work they'd already know they have to exercise their long leg or buy/sell shares to cover an early assignment", "score": 1, "replies": [{"body": "Very true, I say Robinhood makes em all take an “options for apes” digital course, then mails everyone the “I did it!” Stickers to put on the fridge", "score": 1, "replies": []}]}]}]}, {"body": "I'm just here to lurk, but I don't understand how this works. Can someone ELI7.5?", "score": 2, "replies": []}, {"body": "Wouldn’t you have the $41k in stock that is probably worth more than $41k since you got assigned and therefore can just sell some?", "score": 2, "replies": [{"body": "You’re on the right track and correct in terms of theory, but not in value. He sold the Put for $417.50 which equates to spending $41,750 on assignment, and the stock is currently worth (as of Friday night) $406.70 for a total value of $40,670 if he simply accepted and then sold the shares.\n\nBecause he also had the protective put at $415, he instead gets to move the 100 shares at that price, recouping $41,500 for a loss of $250 minus whatever premium he was paid for selling the spread.", "score": 1, "replies": []}]}, {"body": "Delete the app bro", "score": 2, "replies": []}, {"body": "So explain this to me. Is your deficit not actually $42k?", "score": 2, "replies": [{"body": "When I opened the position I wrote a put and I bought a put, one at 417.5 and one at 415. I put up the collateral for the difference between them ($250) which is what I ended up losing. The 417 put got exercised early, which is why I got this lovely notification. I then exercised my 415 option and long story short lost $250 minus the premium I made when I opened the position", "score": 1, "replies": [{"body": "So, you exercised the put at 415?", "score": 1, "replies": []}]}]}, {"body": "Frankly that’s why I buy verticals. You haven’t lived until you’ve been assigned $500k to $1M in stock, only to realize the other part of your option offsets it.", "score": 2, "replies": []}, {"body": "In cases of assignment, many inexperienced people panic, not realizing that they hold an asset that has value and can be sold, in some cases, for an overall profit. \n\nI once was assigned 800K in TSLA, which was initially jarring, but when the market opened, I sold them for a profit.", "score": 2, "replies": []}, {"body": "is this something that only occurs on margin accounts?", "score": 2, "replies": []}, {"body": "Buddy of mine wanted to kill himself last week before I explained him he only owed 140$. Wild how companies are allowing anyone to use complex products.", "score": 2, "replies": []}, {"body": "Maybe you shouldn’t trade options until you understand how they work.\n\nBut then again, then almost nobody would trade options", "score": 3, "replies": [{"body": "I honestly feel like I understood my position, but didn’t know how Robinhood would go about it. My max loss was established when I made the trade, I was more shocked by the number at first and then momentarily thought Robinhood would make me transfer in 40k to buy shares then immediately sell them", "score": 4, "replies": [{"body": "I repeat my earlier statement", "score": 1, "replies": []}]}, {"body": "Actually a lot of people trade options and make a lot of money doing so", "score": 1, "replies": [{"body": "A lot of people trade options. Very few of them earn money. Even less make a lot of money.", "score": 1, "replies": [{"body": "A lot of traders on here lose, some win. I know someone who made $1M on an AMZN option trade just as the stock exploded", "score": 1, "replies": []}]}]}]}, {"body": "Just borrow more.", "score": 1, "replies": []}, {"body": "Troy that you?", "score": 1, "replies": []}, {"body": "I was confused when I saw on mine a $2.86 deficit . But I only put $100 in RH. I can only imagine your shock when you saw this", "score": 1, "replies": []}, {"body": "Just delete the app.", "score": 1, "replies": []}, {"body": "Rookie numbers", "score": 1, "replies": []}, {"body": "Saw this on the train 🤣🤣🤣", "score": 1, "replies": []}, {"body": "Just delete the app and install another", "score": 1, "replies": []}, {"body": "I just had the same thing happen on Friday. Got assigned some shares and the puts still had value to them above intrinsic. \n\nYou guys have to watch this one when you're doing spreads, it doesn't automatically mean that you're safe because you can have market fluctuations in between the time you get called or assigned on one and you can unload the other", "score": 1, "replies": [{"body": "I think I could’ve lessened my loss, but decided I didn’t want the headache and exercised my put first thing Friday morning since MSFT opened green", "score": 1, "replies": []}]}, {"body": "Chump change account deficit notice. ![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "How do deficits happen? I dont do calls or puts and i go negative sometimes and i have no idea why. Can someone explain to me why this happens, btw im only 5 years old.", "score": 1, "replies": [{"body": "You can have a negative win/loss ratio without having a negative balance in your account (which would mean you owed money)", "score": 1, "replies": [{"body": "I see but how thoughh. Maybe im just not understanding", "score": 1, "replies": [{"body": "You can only have negative balance in your account if you have a margin account and the value of your securities has dropped below the purchase prices and that paper loss exceeds any cash in the account. I do not think you can have a negative balance if you just have a cash account", "score": 1, "replies": [{"body": "I thought i had just a cash account. But how do check if im on a margin account. I just buy and sell stocks, nothing of that more advanced trading stuff", "score": 1, "replies": []}]}, {"body": "You can still have cash in your account but if you have net losses on the trades in your account, the value of the account is still positive but you have negative on the trades you have made", "score": 1, "replies": []}]}]}]}, {"body": "I also got early assigned on a msft credit spread that I opened otm before the drop and had to immediately exercise my long put. Maybe we are like options Eskimo buddies!\n\nThe bit about extrinsic value is just letting you know your contract still has a lot of value and making sure you are sure about your choice. In this case you have no real choice because you are in margin call, that’s why you have the long put in the credit spread to hedge against this situation and cap your max loss.", "score": 1, "replies": [{"body": "I have been trading options for over a decade, won some, lost some, been assigned but always had balancing I option to cover. I will be glad to look at this either way you if you want to PM me", "score": 1, "replies": []}]}, {"body": "Just delete the app and youre fine", "score": 1, "replies": []}, {"body": "Welcome to Wallstreetbets!", "score": 1, "replies": []}, {"body": "Time to make a new account and try again! Just delete the old account", "score": 1, "replies": []}, {"body": "Good luck!", "score": 1, "replies": []}, {"body": "You designed the spread. How far out was the long side? You should know your max loss. If that was more than you can handle, tighten up the spread. Make small amounts until you build your bankroll and actually get to know what you are doing. In my opinion, debit spreads are safer, where you can always make the max loss way less than your max gain. I use Schwab Thinkorswim to design my spreads. \nEven better is when you have a hundred shares of a company, you can sell a call on it every week if you want. If you get too greedy and set the strike too close to current market value, the hundred shares can get assigned at the strike, but you keep the profit to that point and the premium you collected when you sold the call.", "score": 1, "replies": []}, {"body": "Just delete the app.", "score": 1, "replies": []}, {"body": "Team RobINhOoD", "score": 1, "replies": []}, {"body": "Is this another reason to not go back to Robinhood and stay on webull", "score": 1, "replies": [{"body": "I need to make the switch over, been dragging my feet. Won’t have any positions next week so we’ll see", "score": 1, "replies": []}]}, {"body": "damn that sucks.. what’s your plan next.. hope it will work out", "score": 1, "replies": []}, {"body": "If u don't have the money why do this. Obviously it is what they want. Play with ur non bills money and start their. Credit is a way for u to be in debt. I have 0 credit bills and pay all my bills. Rather be broke after than do anything I might owe. Just stupid if u ask me. Mine as well go to a casino and ask for 100k and put on black. I do stock market and I save my extra money on dividend stock in my IRA. Otherwise u see nothing. Sad people still jump on credit like it's free money. Especially in this high interest times from joe Biden and Kamala Harris. Harris says elect me to save money. Lady u been in office for 4 years already what r u talking about.", "score": 1, "replies": [{"body": "Thank you, very cool!\n\nWith the strategy I used, I really only lost $250 on a safe play that went sideways due to back to back terrible days in the market. I didn’t take out a loan for any of this, it’s just called a credit spread, and it gives me the opportunity to make money as if I actually had a lot of stock, but with some risk as well. I have retirement through work as well as high yield savings, so not like I’m wasting all my money. \n\nTo your other point, sir, this is in fact a casino.", "score": 1, "replies": [{"body": "I know all about those. 😂 I just know from my past these spreads hurt unless u know what u r doing. I will suggest u learn volume profile before u engage in more experience trading like iron condor and other such moves. I use to do options but futures r better for my style. I don't know u so u could be very well knowledgeable on this. Such a reason would be to ignore me. Lol 😂 i just hate seeing these I had 100k and down 20k negative now. What do I do? 😂 Gl may the force be w u", "score": 1, "replies": []}]}]}, {"body": "As Borat would say: wa wa wee wa", "score": 1, "replies": []}, {"body": "7 years is not this short window of time to not be able to borrow money for.", "score": 1, "replies": []}, {"body": "Dang bro that sucks hopefully you don’t keep a gun in your house cause this would be the time when suicide seems really really nice.", "score": 1, "replies": []}, {"body": "My man!", "score": 1, "replies": []}, {"body": "I always wondered what would happen in a scenario where your short leg is exercised while your long leg is still OTM.", "score": 1, "replies": []}, {"body": "I’m an options newbie. Would someone help me understand what’s going on here? I get that the short side was assigned early I think", "score": 1, "replies": []}, {"body": "Buy the contract back....", "score": 1, "replies": []}, {"body": "This is scary as shit. ￼​", "score": 1, "replies": []}, {"body": "Happened to me recently but for $120k. Fortunately Webull gives you a courtesy phone call at pre market so I was only able to panic for a minute before that call came.", "score": 1, "replies": []}, {"body": "Free money hack \n\nAlso good luck Monday", "score": 1, "replies": []}, {"body": "oh damn", "score": 1, "replies": []}, {"body": "This exact thing happened, but with SPY and 2 million dollars.\n\nI prayed to God. I figured it'll be best not to panic.\n\nLo and behold. I made 1.2k in the end, cleared the issue up, and somehow my borrowed credit stocks, if I'm correct, were bought up.\n\nAnd that was the end of that.", "score": 1, "replies": []}, {"body": "First time ?", "score": 1, "replies": []}, {"body": "Can someone explain what’s going on here lol. Thanks in advance", "score": 1, "replies": []}, {"body": "Been there done that, definitely was a stressful Wednesday evening, I already had plans on how I was going to have to get a loan and work x amount of years to repay this", "score": 1, "replies": []}, {"body": "Can someone explain how this \" deficit \" work? Like i am 5.", "score": 1, "replies": []}, {"body": "If you sold puts you now have to buy the shares! Whoever had the other side of the contract exercised it! You can then sell the shares or sell calls", "score": 1, "replies": []}, {"body": "I am not certain how you would check with brokerage you use, but when you check you balances you will see references to margin balances, margin equity, margin percentages, etc., something of that nature", "score": 1, "replies": []}, {"body": "I heard Wendy is hiring bro", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4275)", "score": 1, "replies": []}, {"body": "It has been discussed here a thousand times, just delete the app. If you want to make sure and be 100% certain, delete the email address associated and welcome to your new life. A new beginning", "score": 0, "replies": []}, {"body": "Sell on Monday or ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": -1, "replies": []}, {"body": "Just fake your own death", "score": 0, "replies": []}]}
{"title": "Intel's Nightmare Week: Price in Freefall (38% plunge) + Moody's Downgrade", "selftext": "[INTC - 1 month price chart](https://preview.redd.it/6gfmtkki9thd1.png?width=1051&format=png&auto=webp&s=f23966a193352b9ef8d23365de655f0fa9f9b453)\n\n([Reuters](https://www.reuters.com/technology/moodys-downgrades-intels-senior-unsecured-rating-2024-08-08/)) – **Moody's downgraded Intel's senior unsecured rating on Thursday to BAA1 from its earlier A3 rating**, citing concerns about the chipmaker's profitability. The unsecured ratings outlook has been changed to negative from stable, Moody's said. It affirmed Intel's Prime-2 short-term commercial paper rating.\n\n**Source:** ", "id": "1eopk0h", "created_utc": 1723284552.0, "score": 237, "upvote_ratio": 0.92, "num_comments": 170, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 1 day ago\n**Total Comments** | 1 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "https://preview.redd.it/kliw4ce7cthd1.jpeg?width=1284&format=pjpg&auto=webp&s=e840fdc4abbc349190a15a93cdfecbc4820d1ecb", "score": 557, "replies": [{"body": "He bought? Nuke it.", "score": 109, "replies": [{"body": "Imagine if there are actually dudes sitting at hedge funds watching this shit and actually saying that?", "score": 39, "replies": [{"body": "[deleted]", "score": 20, "replies": [{"body": "Same boat my brother", "score": 1, "replies": []}]}, {"body": "It's called Bloomberg terminal but works at much larger scale", "score": 5, "replies": []}]}]}]}, {"body": "The fact that Intel debt was rated as investment grade up until this point says all I need to know about Moody's. Good to know that nothing has changed since pension funds were loading up on synthetic CDOs in 2007.", "score": 194, "replies": [{"body": "As the big short movie described them: \"The whores of the credit agencies\"", "score": 68, "replies": [{"body": "Buffet owns Moody's. ", "score": 3, "replies": []}]}, {"body": "Did you know that dolphins can actually communicate with each other through interpretive dance? It's true! They use a complex system of flips, jumps, and tail movements to convey messages and emotions to each other. Unfortunately, humans have yet to crack the code and understand their dance language.", "score": 1, "replies": []}, {"body": "This is how to use lobbying power. Information is power, I wouldn’t surprise if AMD,nVidia, etc. behind this.", "score": 0, "replies": []}, {"body": "Damn what a reference. What books or obviously movies are you basing this reference on?\n\nDid you know anything about the bond and credit markets prior to the release of the movie?", "score": -14, "replies": [{"body": "I read that chapter last night ", "score": 9, "replies": [{"body": "It’s such a fun opinion because it’s just treated as complete fact without any nuance.", "score": -9, "replies": [{"body": "You seem like a person with a lot of fun opinions, I'll take your word for it", "score": 6, "replies": [{"body": "“I watched a movie”", "score": -8, "replies": []}]}]}]}]}]}, {"body": "https://preview.redd.it/jph8ow2cdthd1.png?width=500&format=png&auto=webp&s=6f07d35171491f3d3039aca8678413e013d15dd3", "score": 78, "replies": []}, {"body": "Intel is such a weird case. They are one of the first companies to be below their 2020 recession (COVID shutdown era) low, which is really saying something because they were also a major recipient of the (bag of) CHIPS act. But even more insane is the fact that they are still down more than -70% from their Y2K dot-com bubble high. This company is like the canary who started living in the coal mine full time and somehow survives...", "score": 76, "replies": [{"body": "After election season some politicians will throw them another bag to save them. Too big to fail. Will probably start loading in December.", "score": 17, "replies": []}, {"body": "Lulu is below pre covid level too", "score": 6, "replies": [{"body": "Didn't realize that. There should be a revised listicle about this.", "score": 2, "replies": []}]}]}, {"body": "I bought shares on this dip for my IRA. Not $700k worth like Intel guy, mind you.", "score": 12, "replies": [{"body": "Well full porting into INTC would be crazy, unless you got given the money then ![img](emote|t5_2th52|4271)", "score": 3, "replies": [{"body": "The drip on 700k of INTC would be nice though… oh wait. \n\nHonestly though I think Intel will rebound but it’s gonna be awhile.", "score": 3, "replies": []}]}, {"body": "I did the same, bought 200 shares to hold for 5-10 years and then reassess", "score": 1, "replies": []}]}, {"body": "Everyone in comments buying Intel… what the fuck. This is news that Intel’s debt might collapse. $700k Kid used the “it’s so cheap” thesis. Go ahead and keep trying it, but sometimes there’s a reason that investors sell their shares of a company.", "score": 71, "replies": [{"body": "Not all companies are too important for the US government to let fail.  It's a national security issue, and shitty or not they'll get bailed out of their bad decisions", "score": 43, "replies": [{"body": "The US will bail out the company, not the shareholders. When they bailed out AIG, they took 80% of the equity and made AIG payback all the bail out money. The shareholders got diluted by 80% and didn't profit from the bailout.", "score": 16, "replies": [{"body": "Good point.", "score": 2, "replies": []}, {"body": "Not so bank of America.  In 2008 Hundreds of small banks closed and shareholders got nothing.  Bank of America shareholders never gave up control, just got free money from the gov.", "score": 1, "replies": []}]}, {"body": "So? How is that bullish for the shares? Might want to read about who gets wiped out first when the government steps in to restructure debt. ", "score": 11, "replies": [{"body": "I ain't bullish.  But there isn't anyway Intel goes poof", "score": 8, "replies": [{"body": "Yes, but the shares can go to zero. Look what happened with General Motors.", "score": 7, "replies": [{"body": "Intel is not in car business.", "score": -11, "replies": [{"body": "Point? The government bailed them out. Existing shareholders were wiped out. They did another IPO. The government considered the company too important to fail, they did not consider the shareholders important.", "score": 19, "replies": [{"body": "Comparing intel failing and general motors failing is like comparing apples and oranges, IMO. Because Semis have become so important in today's world and fear of China taking over Taiwan. It's likely US govt thinks intel too important to fail. Their FAB business will be incredibly important once China gets near Taiwan TSM factories. A lot of this is conjuncture. But anything can happen.", "score": -10, "replies": [{"body": "Are you dense? The US government DID find GM too important to fail. The US government DID bail out GM. The US government let GM shareholders lose everything.\n\nThe same can happen to Intel. They will find Intel too important to fail. They can bail out Intel. Intel shareholders can still lose everything.", "score": 13, "replies": [{"body": "You still don't understand Geopolitics boy! DId you travel outside the US ever or like a typical American think SF giants and LA dodgers is a world series match. Considering your arrogant tone, I'd think the latter is probably correct. Well, I tried. Goodbye and enjoy your American dream.", "score": -13, "replies": [{"body": "When the government bails out a company, they void the shares.", "score": 10, "replies": []}, {"body": "You are regarded! Americans understand geopolitics better than most. We control geopolitics.", "score": 5, "replies": []}, {"body": "I think you might be missing the point entirely.\n\nIntel's current capital structure (i.e., you and all of the other INTC bagholders) will get zeroed, while their physical assets like their fabs and all of that gear will get absorbed by New Intel, Inc, and you will own none of that. If you want a shot at a piece of that action, you would need to buy their secured bonds right now. There would probably be a debt/equity swap in the event of a restructuring, but all common shareholders of INTC would go to zero.", "score": 9, "replies": []}, {"body": "lolz @ fucking this up in each post and calling out arrogance.  oooof.", "score": 4, "replies": []}]}]}]}]}, {"body": "> Intel is not in ~~car~~ business.\n\n*fixed", "score": 1, "replies": []}]}]}]}]}, {"body": "Wait the new thesis is Intel gets a bailout? Come on yall", "score": 21, "replies": [{"body": "Yep. Too big/important to fail.", "score": 22, "replies": [{"body": "I’ll wait until the Fed mentions INTC at their next meeting.", "score": 13, "replies": []}]}, {"body": "Only viable chip manufacturer on US soil. Maybe INTC will fail but something else will need to rise up before that happens and it will be clearly visible. US empire is not letting the only domestic chip foundry go under. Don't worry I have been selling you those puts.", "score": 21, "replies": [{"body": "For now. Even with the up front costs and employment issues, TSM is closing in on the Arizona fab going live in the next couple years. Give it ten years and if Intel doesn’t turn their shit around, they’re toast", "score": 6, "replies": []}, {"body": "lolz @ calling them viable, at all.\n\neven intel is using tsmc's fabs.  how the fuck is that viable?", "score": 1, "replies": [{"body": "Lol, read:\n\nhttps://www.fool.com/investing/2024/03/12/intel-will-have-1-critical-advantage-over-tsmc-and/#:\\~:text=Intel%20is%20playing%20catch%2Dup,with%20a%20critical%20new%20technology.", "score": 2, "replies": [{"body": "ah, yes.  a 5 month old article that wasn't even correct at the time and is lulzily worse now.\n\nclueless", "score": 0, "replies": []}]}]}, {"body": "You definitely didn’t sell the 20-bag, I made a couple bucks off MMs. At least I hope you weren’t steamrolled. Intel caught a bit of index recovery this week but it’s done with the $20 level. Thanks for the weeklies and monthlies, might become a long-term putholder in the company. ", "score": -1, "replies": []}]}, {"body": "Or if we decided its actually very important, nationalized. Or just poach their top talent (lol). Or, buy it out for pennies when they go insolvent and use the fabs.", "score": 3, "replies": []}]}, {"body": "They are not the only dog in the ring. US gov is hedging. They gave money to Samsung and TSMC as well. Even Rapidus is coming to roost", "score": 3, "replies": [{"body": "Imagine the software rewrites the government would have to make. Nope their software is too invested in X86-64 to change. The cost to just rewrite tactical systems that the military uses would be astronomical. ", "score": 3, "replies": []}, {"body": "only domestic chip fab on US empires soil. you do the math.", "score": 2, "replies": [{"body": "sure, aside from glofo and texas instruments and micron and on...", "score": -3, "replies": [{"body": "Agreed they could emerge and I'll watch out for it. Right now Intel has just fired 15% of their staff and specifically outlined a plan to become a chip foundry. It would be smart for fundamentally national security reasons for them all to succeed and maybe they will. Right now, Intel is front running them.", "score": 2, "replies": [{"body": "regard, they've BEEN a foundry.  they're just terrible at it.", "score": -1, "replies": []}]}]}]}]}, {"body": ">they'll get bailed out of their bad decisions\n\nNot you, shareholders\n\nLOL", "score": 1, "replies": []}, {"body": "Auto companies got bailed out too and are will never be allowed to fail. Ford currently is trading around $10 which is also around the same price to the levels in 1987. \nYou guys are so stupid you don’t understand the difference between a company going bankrupt and barely surviving. Intel can get all the bailout money it wants it doesn’t mean shit about how the company will perform.", "score": 1, "replies": []}]}, {"body": "Listen you should only ever buy stocks that are crushing their 52 week or all time high.  Then make sure to sell them when they are cheap because they might fall further.  Buy high and sell low.  It’s fool proof.  Imagine having to wait for a company turn around….. that could take months! Or even gasp years…", "score": 21, "replies": []}, {"body": "Doesn’t matter, buying the dip.", "score": 6, "replies": []}]}, {"body": "Those analysts are pathetic, they only adjust rating after the price drops. When the price WILL go back up, I can guarantee you they will increase the rating. Lmao. Pathetic. ![img](emote|t5_2th52|4271)", "score": 113, "replies": [{"body": "Why is this regarded comment upvoted? Credit rating changes have nothing to do with the stock price.\n\nThe credit rating agencies don't get a heads up on Intel's announcement, so they can only analyse the implications after it's announced. The stock moves straight away but credit rating changes take time for the agencies to calculate the impact on the credit worthiness of the company and publish a report on their rationale/findings. So obviously the credit rating changes comes through after the share price move, but the former isn't driven by the latter.\n\nI swear I don't know why I bother commenting in this sub sometimes with all the dumbass beginner investors so confidently acting like they're Peter Lynch.", "score": 40, "replies": [{"body": "I think you just proved his point with your comment. They decided to change the rating now, that price drops, not before, looking at the fundamentals of credit capability of the company.\n\nAnd they will put them back to AAA as soon as price goes back up, claiming Intel is again capable of managing the debt.\n\nOppps", "score": 13, "replies": [{"body": "Or maybe the stock price and the rating agency are reacting to the same information.", "score": 0, "replies": []}]}, {"body": "You are so smart man! So you are telling me that after intc announced they are having trouble and shit earnings the credit rating is lower? Unbelievable, those analysts are priceless we need them so much.", "score": 9, "replies": [{"body": "Yes, like I said in my previous comments, the rating agencies don't get insider information on drastic corporate strategy changes or unexpected profitability issues. So obviously the rating changes come after the announcement. The same way the stock moves after the announcement. By your logic, the stock should move before the announcement as well, but that's just a stupid assumption.\n\nThe main value of credit rating agencies aren't predictions, it's the analysis of the current credit worthiness of the company based on public information. It's what investors gain from speaking to them and reading the analysis that they value, not the actual downgrade which is just the equivalent of a headline in a news story. Stock analysts have more a focus on earning predictions, but their target audience are the buy-side, not retail investors, and even the buy-side only use their analysis and information to form their own view - not take their price targets and buy/sell recommends as gospel.\n\nClearly you know very little about the market and how the agencies, analysts and IBs play into it. I recommend you stop running around acting like some cocky overconfident professional when all of your comments give a strong indication that you are talking absolute shit and have probably only been investing for a couple of years. And yet somehow still haven't learnt anything meaningful about the industry.", "score": 19, "replies": [{"body": "You sound mad that your job is pretty much useless. Lmfao. Probably worst returns than investing straight into into the sp500. No wonder you're in WSB. HAHAHA", "score": 0, "replies": []}, {"body": "Sir. this is a casino gtfo to r/investing with this bs", "score": -8, "replies": [{"body": "Living up to your name in a big way. Looking forward to your loss porn, hopefully to the benefit of my six figure portfolio hitting seven eventually.", "score": 4, "replies": [{"body": "Bro really thinks you make money by being smart ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4267)", "score": -6, "replies": []}]}]}, {"body": "So essentially bond ratings are most useful for those looking to buy a particular bond now or in the future, NOT those currently holding said bond.", "score": 0, "replies": []}]}]}, {"body": "People/investors are irrational. They overshoot in both directions. In our time, especially after the subprime debacle, banks and credit rating agencies have a bad rap. It doesn't matter, what they do. They must be evil is the new mantra.", "score": 1, "replies": []}]}, {"body": "username checks out.", "score": 3, "replies": []}, {"body": "The rating should be higher now. If the price dropped it is objectively a better investment than before the drop. It's the same investment for less money.\n\nIt's still not a good investment, but slightly less bad than before.", "score": 6, "replies": [{"body": "The ratings are about bonds. If the drop in stock price reflects that they’re closer to bankruptcy, bonds should be rated lower.", "score": 16, "replies": []}, {"body": "What you say is not related to my comment. I am talking about analysts rating. Not if Intel is a better or worse investment than before. Analysts are REACTIVE to price action, that's it, if you dont agree with me you must be new to the market.", "score": -2, "replies": [{"body": "I would be more worried if analysts could accurately adjust the price rating before it fell. This would mean they have access to information outside the scope of the public domain. \n\nThe fact that they do it reactively just indicates that they are operating on the same knowledge we all have access to. Besides, their job title is as an analyst, which means they analyse information made public. \n\nThe ratings themselves are only meant to be a confidence indicator. That's why we see a different range on analysts' target prices. And why some say sell and others say buy. In many ways, the analyst ratings are a reflection of the market sentiments. With some stressing on some issues more than the others. \n\nThe biggest mistake newbie traders/investors can make is just going by the price target. Rather, it's better to figure out what the deciding factor  was that made a particular analyst rate it with a higher or lower target price.  From there, the investor/trader needs to decide whether or not the issue is big enough of a factor for them to invest or avoid.", "score": 4, "replies": [{"body": "Why those analysts even exist then? I can hear the earning call and understand earnings are trash. The summary is: this is a nothing burger and it is not going to move the price after a fucking -40%.", "score": 1, "replies": [{"body": "Becuase there's no such thing as a single human being being blessed with all knowledge and all wisdom. Analysts are basically submitting a research report on a company, and the price target is more an indication of how confident they are in their prediction. Sometimes, you see a rating change from hold to buy but a downgrade in price. That's probably an indication that although the analysts think it will go up. He isn't very confident how if it will go up very far.\n\n There is always going to be a point of view that we might not have considered. The reason could be for something as simple as our political, economical, or even prejudiced bias would prevent us from considering. \n\nThe research reports are a good way to gauge potentially different impact points on the stock pricing. Doesn't matter if it gels well with your beliefs or not, but it's good to be aware of what the potential triggers for the stock may be.\n\nAfter all, these analysts are usually the in-house specialists for the top investment houses, which means quite a bunch (not all) of these pressure points are incorporated into their trading outlay. \n\nIf news comes out that were to hit those pressure points, retail may shrug it off thinking of it as inconsequential action. But the argos will immediately act on it, either buying or selling as needed. And that buying/selling will effect retail.\n\nAnother aspect to remember is that investment houses also ask one set of analysts to write up a report on why the price will fall and another set to write a report on why the price will rise. The reason being they want to gauge what are all the ways that can be thought off with the tools they have to assess what news are relevant enough to spin as good/bad for stock pricing.", "score": 3, "replies": [{"body": "Here's something I found in regards to intel.\n\nhttps://stockanalysis.com/analysts/hans-mosesmann/\n\nHans mosemann has a 64% success rate and has been rating intel as a Sell since 2022.  He has had a target price of usd 17  for intel since January 17, 2023. And has maintained the usd 17 target 15 times since then.  Even when intel went bullish to +48. \n\nSo yes, there was an analyst who targeted intels current price range. From as early as a year ago. Just it got drowned out in the hype of the ai bias. \n\nThere were others as well that advocated sell but not to the margin that intc experienced.", "score": 2, "replies": []}]}]}]}, {"body": "Yeah you’re wrong. They do adjust targets after they are met, or after big events (like last earnings.) otherwise they don’t care about PA, just fundamentals", "score": 3, "replies": []}, {"body": "I agree with you", "score": -1, "replies": []}]}]}, {"body": "lol. Look up analyst up/downgrades every day and see how massively it can affect price. And this is a credit rating, not a price target…. It means banks decided after this earnings that Intel might not survive as a company.", "score": 2, "replies": [{"body": "Are those the same guys giving AAA ratings to shit assets in 2008?", "score": 3, "replies": [{"body": "Not really that was over 15 years ago. Intel’s financing costs went up, it’s another red flag because this rating will affect their cash flow.", "score": 6, "replies": []}]}, {"body": "was earnings really that bad? I guess they can always get a bailout.", "score": -1, "replies": [{"body": "There’s no clear reason to believe they will have “good” earnings again. Constant red flags with the company and it would take an actual analyst to figure out if the assets are worth anything", "score": 4, "replies": []}]}]}, {"body": "Yea when it goes up 5% after every other stock goes up 20% every intel regard fanboy will go “LOOK I TOLD YOU IT WOULD GO UP”.", "score": 1, "replies": []}]}, {"body": "Keep bringing it down, I need to buy more.", "score": 32, "replies": [{"body": "Go have a look at this first:  \n[https://youtu.be/agxSclh27uo?si=eRBhXAQlOuVKdPJi](https://youtu.be/agxSclh27uo?si=eRBhXAQlOuVKdPJi)\n\nThere's nobody at Intel left to turn the boat around: when they beat AMD by years with hyper threading, they turned into a sales organisation instead of a product organisation. Money doesn't buy the kind of people Intel needs you see, it's the internal culture that does and they don't have it.", "score": 9, "replies": [{"body": "AMD does not manufacture chips. They design, them.. INTC is restructuring to fabricate the chips for great designers like AMD.", "score": 12, "replies": [{"body": "And companies like AMD, Apple or Nvidia will never make any chip at Intel, as long as Intel has a processor design division of its own. They are worried about Intel stealing ideas. Not so much the IP which is protected. But the way those companies design their chips. \n\nThis isn't outsourcing some design to any fabricator. These chips are designed around specific, semi conductor producer specific processes called nodes and that takes several years. There is a whole set of design rules, documentation etc around. That is a PDK.   \n[https://en.wikipedia.org/wiki/Process\\_design\\_kit](https://en.wikipedia.org/wiki/Process_design_kit) \n\nLike that we get to the second problem. Taking a design and making it ready for production and then producing the chips. That is where Intel has been dropping the ball for many years now. They had their original 10nm node for many years, but the chips they designed for it, would not work because of never ending manufacturing issues. Then Intel basically rebranded Skylake year after year. 6th-10th gen where all Skylake. The architectures designed for 10nm, basically died.  \n  \nThen what seems to be a completely redesigned, now less performing 10nm node (renamed to Intel 7 later) was introduced for Alder Lake in 2021, some five years later than 10nm chips where supposed to ship. Then we got to Raptor Lake which is basically Alder Lake with more cores and higher clock speeds to try and keep up with AMD at stupid power consumption levels. The higher end ones have been dying at an alarming rate. Something Intel only is starting to admit to after months of ever mounting public pressure. And it just gets worse and worse with that mess...\n\nThen Intel its next node is Intel 4. They started shipping chips based on that, nearly a year ago. That is Meteor Lake. But its only for laptops with \"Core Ultra 5/7/9\". Almost a year later, those are still not that plenty to find. Intel isn't making anything powerful like a desktop, let alone a server CPU, on that node. In fact, it seems that Meteor Lake finally convinced OEMs to include more AMD into their line ups. You see, Meteor Lake kinda sucks. Its expensive, not that well performing and doesn't seem to be available in large quantities either. \n\nBut most damming is that Intel its next generation of processors, Arrow Lake, is being made at TSMC its superior 3nm node. That includes laptops. Intel its server parts are slated to remain on 10nm/Intel 7 for a while. So Intel is making all that capacity with new fabs. But the current ones aren't even being used to capacity. And who would want to use them with their spotty track record over the last decade? They delivered one new node in a decade after massive struggles and the next node is so bad, that Intel doesn't even want to make most of its chips on that. TSMC delivered four and overtook Intel. \n\nIntel has all its hopes placed on the next node, 18A. But with Intel its abyssal track record, I would not believe it until I see it. \n\nIn summery:  \nGrandma's inheritance is gone...", "score": 12, "replies": [{"body": "it's not (just?) stealing of ip, but the obvious conflict of interest.\n\nlike, sure, intel's going to give their competitor priority, amirite?", "score": 2, "replies": [{"body": "That also plays a factor. But these massive chip designers, buy a set allocation of wafers in advance. Not just months, years in advance. This is also why Apple is always first to any new TSMC node. They basically bankroll TSMC to develop the process and construct the production facilities. Basically Apple just drops billions in advance to be first. That is also why they often have better performing chips. Most of the performance gains aren't from architecture and never have been. Most comes from more transistors you can use with a smaller node.   \n  \nIf Intel wants to be taken seriously, they also need to adopt such a model where they can't touch guaranteed supply from 3th parties. Meaning that if Intel runs into trouble with manufacturing (again), they would have to prioritise their 3th party customers over themselves. If they don't, nobody is going the Intel route either...", "score": 3, "replies": []}]}]}, {"body": "Remains to be seen if they can. From what I can see they claim to be able to resolve everything like they did with 10nm Chips, and I think we all remember how well that went. We'll see how they roll out \"20A\" (5nm) later this year, but to my knowledge TSMC is already going 3nm.. so I'm not holding my breath for Intel's victory here.", "score": 7, "replies": [{"body": "> \"20A\" (5nm) \n\n*facepalm*", "score": 3, "replies": []}, {"body": "Good points. Yes we will see.", "score": 2, "replies": []}]}]}, {"body": "They have 1-2 years to restructure before their state of the art fabs are online, plenty of time to reorganize.\nThis has been their move since they started building.\nLooking at it now, yeah, it’s almost at bottom, but they do have a plan, and the firing of employees was the next step. The next 2 years are critical for their potential growth; I’m banking on them hitting it out of the park.\n\nI will ride this low, by selling weekly CCs and buying more shares.", "score": 3, "replies": []}]}]}, {"body": "Intel is effectively priced for bankruptcy. If  you don't think they'll go bankrupt. It's a buy", "score": 14, "replies": [{"body": "The feds won’t let that happen.", "score": 3, "replies": [{"body": "worked great for gm", "score": 2, "replies": []}]}]}, {"body": "I bougth more, If AMD turned it around so can Intel. Decent turn around thesis and with a low enougth starting price point, why not? Before Ryzen AMD was a joke and that didn't happen that long ago.", "score": 5, "replies": []}, {"body": "Is it genuinely good time to put money in Intel? I feel like this has to go up eventually no way it stays down", "score": 8, "replies": [{"body": "Depends. Do you have $700k lying around?", "score": 57, "replies": [{"body": "This joke is over. RIP", "score": 2, "replies": []}, {"body": "Have around 50k bought at 19.5ish avg yesterday 😬", "score": 1, "replies": []}]}, {"body": "It is a great time to buy Intel if you hate money and want to learn why the saying goes \"cut your losses\" and \"don't throw good money after bad\".\n\n\n\nIntel is a gigantic zombie company that's rotting from the head down. They can't produce a good CPU even if they stole the fans straight from AMD due to their nepotistic incompetent leadership. They are a walking failure.\n\n\n\nThey sure have many customers for now but over time they get less and less. Less order for new products, less products on the markets and worse performance for the ones that get released. There is litterary *nothing positive about this stock* so it's a guaranteed buy for you. After all, Intel is surely \"too big to fail\" and \"the stock must return to previous ATH because...magic?\". It can always go lower son, if you like it at these prices you'll love it in a another few months...and years...", "score": 7, "replies": []}, {"body": "Short run, maybe. Long run, cannot compete against nVida, AMD, and TSMC. They passed on the mobile movement, way behind on AI, when quantum computer get big, behind too.", "score": 3, "replies": [{"body": "Had a small position that I recently exited. Looking back at the last 20 years Intel have done basically fuck all. They had a huge lead and almost a monopoly on laptop CPUs. And they’ve done fuck all ever since. 0 presence in mobile, miniscule presence in data center, they are now even losing market share by Qualcomm’s ARM laptop chips. \n\nThey can say a lot of things, but execution- wise they’ve been trash for decades. Nvidia, AMD, TSMC and Qualcomm are all leaps and bounds ahead of them and I don’t see that turning around no matter how much government money gets thrown at them.", "score": 2, "replies": [{"body": "I used to only buy Intel computers and laptop until AMD Ryzen chips. Now I’m all AMD / nVida GPU. I believe AMD has a better future.", "score": 2, "replies": []}]}]}, {"body": "They should try to sell the fabs like AMD did. If it's so important for US Government they should do something with the fabs while Intel can design their stuff. It's good stuff it's just their fabs can't compete with TSMC. \n\nI am not invested yet because I believe it will go even further down.", "score": 2, "replies": [{"body": "it's impressive how regarded this comment is\n\nintel it quite literally betting the entire company on IFS and youre saying they should sell the fabs lmao", "score": 20, "replies": [{"body": "no, it's showing how regarded intel's strategy is.  \n\nespecially since intel already is selling off 49% of their new fabs, anyway...", "score": 1, "replies": []}]}, {"body": "If you want to invest, you should invest before Jan 2025", "score": 2, "replies": [{"body": "Why?", "score": 1, "replies": [{"body": "Because the current quarters (Q3 as well) are particularly bad and everyone is waiting for the 18A Node news. Production will start in H1 2025 and this December could be the lowest entry point. They HAVE to deliver and failure to do so would be a risk for their entire foundry project. But if you don’t believe Intel will deliver, you shouldn’t buy the stock anyway.", "score": 3, "replies": []}]}]}]}, {"body": "Intel had a 4 year lead over AMD when they came out with Hyper threading first. AMD currently has the best CPU's on the market:\n\nAre you REALLY going to invest in a tech company that pissed away a 4 year unbeatable edge over their competition?", "score": 1, "replies": [{"body": "yeah, but it was really important to spend $200B on buybacks to maintain cutting edge foundries.", "score": 1, "replies": []}]}, {"body": "That operating cost cutting will turn their next quarterly profit positive. That will be dead cat bounce. Gelsinger will cash in and get the F out and so shoukd you. 18A new tech that will come in before TSMC 2nm? Fat hope after firing their R&D. Gelsinger gambled and he lost the company.", "score": 0, "replies": []}, {"body": "Only if Trump wins, since it means US may ditch taiwan and it will be a disaster for TSMC", "score": -7, "replies": [{"body": "You really think that trump will screw over top 3 biggest companies in US?", "score": 8, "replies": [{"body": "Yes. The dude is a rambling wreck. He loves China and will continue to beat the drum of pay or die. He never speaks of unwavering support.", "score": 1, "replies": [{"body": "That was a rhetorically question. Here's another one: Do you really think the top3 us companies will let trump fuck them over?", "score": 1, "replies": []}]}, {"body": "Indirectly. The market was down when his interview about taiwan was published, saying taiwan needs to pay for their security. He even said that TSMC stole American jobs.", "score": 0, "replies": []}]}]}]}, {"body": "Grandma!!ughhh", "score": 3, "replies": []}, {"body": "It’s basically the same as GE was in 2018. Good product, terrible leadership. They need to poach someone good to be the CEO, lead from the lines and cut the fat from the business.", "score": 3, "replies": [{"body": "This is the most boomer-tier take I've ever seen in this subreddit.\n\nGE did nothing but trim 'fat' from the business for decades. Now it's delisted.\n\nIntel has some fat (marketing and such), but that is their company at this point- all business deals and legacy. Except tech doesn't get by on just momentum. By now, MBA-style cultures that demand regular stock buybacks for their own short-term gain are DOA in both the short and long term. This even applies to manufacturing complicated products like airplanes (Boeing).", "score": 1, "replies": [{"body": "Delisted from the DOW???? Who the hell cares about the price adjusted weighted Dow anymore. That’s the most boomer take in this thread. GE has been one of the best performing non tech stocks of the S&P the past few years.\n\nWhat worked for GE might not work for Intel I agree, but Intel need to get their CEO out. Worst case Intel becomes an Oracle quality stock. But that’s better than the nosedive it’s currently in", "score": 2, "replies": [{"body": "It's more than their CEO. It's the entire culture at Intel. The finance guys are running the show.", "score": 2, "replies": [{"body": "Eh, it's not finance guys running the show. Gensler is an engineer. The problem at intel is they're old, they lack innovation. They're essentially turning into IBM. Ride a current offerings into the ground instead of being more cutting edge like Nvidia or AMD.", "score": 0, "replies": [{"body": "The stock buybacks imply to me that there's more financial bullshittery than much else afoot.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Gonna buy more. \n\nRemember when AMD was like 4 dollars a share less than 10 years ago? Do you all honestly think intel is going to go tits up? They still have 3/4th of the server market share. Right now intel is a fire sale. I’ll just keep dollar cost averaging until the stock returns. ", "score": 6, "replies": [{"body": "> They still have 3/4th of the server market share.\n\ncongrats, you just described the bull thesis for amd.", "score": 3, "replies": []}]}, {"body": "Fear? Buy.", "score": 2, "replies": []}, {"body": "Just curious, that might be the time for an intel investment", "score": 2, "replies": []}, {"body": "I'm going to have a lot of intel stock. Fuck I'm becoming a boomer.", "score": 2, "replies": []}, {"body": "IMHO extremely undervalued, they have the IP to top CPUs in the world", "score": 2, "replies": [{"body": "Apart from the fact that, even their CPUs are falling of the TOP and many companies deciding to design their own like Apple did.\nIntel is actually really expensive right now, did you see their latest report. By the way is a good thing they gonna lay off a lot of people, to bring their costs down, but that will hurt them even more on the short term. Lay offs are expensive. There is a possibility of going up in the short term, from people thinking is at the bottom, but it could also go lower ( it actually should). \nSo many better companies to invest, with more upside and potential. \nEven if you believe in the CEO, you’ll be waiting for a long time before making decent gains on intel, better off somewhere elae", "score": 4, "replies": [{"body": "To be fair, in the x86 CPU market they still hold significant market share. AMD is the only competitor in that space as of now. It's not a very easy product to bring to market either. If Nvidia starts making PC CPUs (rumoured) that would be a major problem cause it's likely going to be the best if not at least competitive. Apple doesn't pose much of a threat as it would be very unlike apple to produce CPUs for non apple products.\n\nTLDR: If get over the slump and produce a stable CPU next gen. They can recover (not to glory days in the foreseeable future) as competition is slim as of now.", "score": 3, "replies": []}]}]}, {"body": "Yeah, it hasn't been great. Should have sold at 35, would have been basically at 0.", "score": 1, "replies": []}, {"body": "Ouch ![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "Intel is a pretty mature company and moves so slowly. I feel like there has to be so many other stocks out there that have far better upside than Intel.", "score": 1, "replies": []}, {"body": "I mean, yes they are right; however, this is Intel we are talking about. I'm starting to feel like we are getting close to Intel actually being a good buying opportunity to for the medium/long term investor.\n\nIf it falls below $18 I think it's definitely in the \"buy\" range if your investment timeline is >4 years.", "score": 1, "replies": []}, {"body": "Suck it Grandma!", "score": 1, "replies": []}, {"body": "Surely a near bottom?", "score": 1, "replies": []}, {"body": "Regard question - if you were intel guy and truly believed in intel, wouldn’t it make sense to sell now at a loss and then rebuy in 30 days with the risk being that it would go up in the next 30 days which seems like a low risk?", "score": 1, "replies": []}, {"body": "I bought 400$ worth at 34$ but man am i worried more for the grandma guy.", "score": 1, "replies": []}, {"body": "Oh grandson please stop", "score": 1, "replies": []}, {"body": "So how much of Nana’s money did our boy lose by now?", "score": 1, "replies": []}, {"body": "https://preview.redd.it/3e7t8ed7oyhd1.png?width=498&format=pjpg&auto=webp&s=6ddef506df82ec1971ff788392d786f9e3f2224d", "score": 1, "replies": []}, {"body": "Moody’s research are reactionary…basically like shifting goalposts as long as it suites their narrative", "score": 1, "replies": []}, {"body": "https://preview.redd.it/rrd6o9069uhd1.jpeg?width=1284&format=pjpg&auto=webp&s=4d214512b07ab237e4351c26f5be6dd80d0a28da", "score": 1, "replies": []}, {"body": "If Intel guy had cut his losses and flipped to VOO or QQQ like everyone told him, he’d already be like 5% on his way to recovery. Now he’s going be down another 10 on Monday.", "score": 0, "replies": [{"body": "As a complete ignorant, wouldn't that be also a non optimal move? Isn't Intel still part of those?\n\nOr is the rest simply going well and balancing out Intel performance?", "score": 1, "replies": [{"body": "The latter.\n\nYou can probably look it up, but I can’t imagine Intel comprises more than one percent of either of those ETFs. \n\nVOO averages something like 10% a year over the long run, and QQQ is actually closer to 15%. Intel has averaged 3.5% annual returns since like 1990 or something ridiculous like that. \n\nEven if those ETFs only return 7% a year for the next decade, Intel guy would double his money, more than compensating for his loss. The worst possible thing he could do is keep holding such as shitty, shitty company.", "score": 0, "replies": []}]}]}, {"body": "See intc at 9.99 end of year....", "score": 0, "replies": [{"body": "I'll sell you puts for 1k each. Min 10. How many do you want? None? I thought so.", "score": 2, "replies": []}]}, {"body": "Oh no", "score": 0, "replies": []}, {"body": "And this, my friends, is when you start DCA'ing.", "score": -1, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "weird comment... it's like shorting Hanes because they are standard issue undershirts for Israeli forces. Yea maybe but Good luck with that.", "score": 2, "replies": []}]}]}
{"title": "Intel getting sued by shareholders", "selftext": "https://www.reuters.com/legal/intel-is-sued-by-shareholders-alleging-securities-fraud-2024-08-07/\n\n“Intel (INTC) was sued on Wednesday by shareholders who said the Silicon Valley chipmaker fraudulently concealed problems that led it to post weak results, slash jobs and suspend its dividend, and caused its market value to sink more than $32 billion in a single day.”\n\n“The proposed class action against Intel, Chief Executive Patrick Gelsinger and Chief Financial Officer David Zinsner was filed in San Francisco federal court.”\n\nDo you think this will lead to something? Will Intel shareholders (sadly me too) recover atleast some losses?", "id": "1eor22w", "created_utc": 1723290270.0, "score": 1590, "upvote_ratio": 0.95, "num_comments": 285, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": [{"body": "Another day another intel fuck up", "score": 2, "replies": []}, {"body": "Nope.  Not leading to anything.  The class action attorneys always sue companies when there’s a large pullback.  But there’s nothing inherently fraudulent about a company losing money even due to mistakes by the executives.  They may settle it but it will have no lasting effects.", "score": 1, "replies": []}]}, {"body": "Lead plaintiff: grandma", "score": 3171, "replies": [{"body": "It's a sueance, get ready folks", "score": 411, "replies": [{"body": "Sueance’s are very expensive.", "score": 113, "replies": [{"body": "Quickly!  Put some money in the box!", "score": 60, "replies": [{"body": "How to buy calls on lawyers?", "score": 1, "replies": []}]}, {"body": "What like $350,000 now?", "score": 19, "replies": []}, {"body": "I have 3k", "score": 18, "replies": [{"body": "I got about tree fiddy", "score": 10, "replies": []}]}]}]}, {"body": "https://preview.redd.it/fk73quh83vhd1.jpeg?width=1284&format=pjpg&auto=webp&s=0a0c30f4454ccadc48e9981f7f249fbd54fe3c4e", "score": 232, "replies": [{"body": "I will never get tired of seeing nana in heaven meme", "score": 98, "replies": [{"body": "Looks like ![img](emote|t5_2th52|4260)", "score": 30, "replies": []}, {"body": "Nana looks like she’s said the N word a few times.", "score": 11, "replies": [{"body": "/u/nwordcountbot\n\n/u/zeketarsim", "score": 1, "replies": []}]}]}, {"body": "if dead people can vote, then they can sue!", "score": 2, "replies": []}, {"body": "I swear on me nans grave, I will fookin do u in mate", "score": 1, "replies": []}, {"body": "Sorry, who is this grandma?", "score": 1, "replies": [{"body": "Intel guy's", "score": 2, "replies": []}]}, {"body": "'ve seen this image hundreds of time and i still can't avoid laughing", "score": 1, "replies": []}]}, {"body": "Meemaw and Partners LLC", "score": 57, "replies": []}, {"body": "6 years ago I warned people.  Every few months someone would say INTC is a value play and is getting gov assistance (depending on gov assistance means your business actually sucks, like saying Boeing depends on gov money is a good investment).  I’d warn everyone again again and again.\n\nhttps://np.reddit.com/r/AMD_Stock/comments/9v1n6f/amazon_web_services_aws_pricing_amd_vs_intel/e994dka/  \n\nEven a schlub like me working in a datacenter knew this 6 years ago that INTC were the worse in the performance/watt and all they did was just keep pushing more watts to keep up with AMD.  So yeah INTC CEOs knew their design was faulty and lied about it every quarter until they couldn’t, they are still lying because their cpus are taking too many watts and literally dying.  Google it.\n\nhttps://www.youtube.com/watch?v=OBSe0bOuNKQ\n\nhttps://www.pcmag.com/explainers/intels-raptor-lake-desktop-cpu-bug-what-to-know-what-to-do-now\n\nActual 12th gen cpus are dying too so it’s been 3 years or over 12 quarterly reports they haven’t mentioned their cpus are defective.  \n\nThey again didn’t disclose this in their last earning report, omission is not an excuse. They’ll get sued by shareholders for this different reason again over this\n\nSo this month or next month once or twice a month so 24 times a year over the last 8+ years you’ll see some scam post about INTC being under valued, needing/getting gov assistance as if that’s a plus.  The tech performance/watt is garbage so it’s going to be a money loser for a long long time until they redesign it.  Don’t think being down 45% makes this a bargain, the opportunity cost of holding this semi stock vs another semi/cloud computing stock is too much.", "score": 61, "replies": [{"body": "Crazy that AMD came back from the grave and beat them. Intel really rested on their laurels for short term profits.", "score": 38, "replies": [{"body": "[deleted]", "score": 22, "replies": [{"body": "That’s rough.", "score": 6, "replies": []}, {"body": "IBM is largely a consulting firm as I understand it, with some servers on the side.", "score": 3, "replies": []}]}, {"body": "Not only did AMD come out of the grave they had to look for a private investor \"silverlake\" which is basically the equivalent of a necromancer who takes your soul as part of the deal.", "score": 4, "replies": [{"body": "> silverlake\n\nare you sure that is not an Intel CPU?", "score": 2, "replies": [{"body": "No it’s a private equaity frim", "score": 2, "replies": []}]}]}]}, {"body": "I agree - but it doesn't matter what the true value of Intel is, only the perceived value by larger investors - curious how they will react over the next few months - I still have my eye on intel if they go low enough and their roadmap pans out", "score": 1, "replies": []}, {"body": "Also 13th and 14th gen wafers were contaminated from a faulty HVAC system and will likely result in large recalls . See https://youtu.be/gTeubeCIwRw?si=lleTSzCZDodmTEJ2", "score": 1, "replies": []}, {"body": "Right now theres a 20 billion dollar intel plant being built in my back yard. One of 3 in the usa built by govt money. 60B in brand new infrastructure and an 80B market cap.  You've got time but when these plants go online and produce chips to spec for the us military, or worse when china seizes taiwan and ends nvidia as we knew it. That'll be when you wish you had bought the dip. Me, ill hold 3 years for a guaranteed triple and hope for 5x.", "score": -1, "replies": [{"body": "What a terrible plan, been hearing this for the last 8+ years.  Your number 1 problem is management isn’t looking to advance the tech that is first and foremost, INTC management will screw it up.  \n\nIn that 8+ years waiting for INTC value play AMD, NVDA, AMZN, MSFT, ASML, AAPL, every cloud, semiconductor, AI has made you a millionaire.  INTC in 8+ years has lost half its value probably 200 billion market cap in the biggest 3 tech runs , cloud computing boom, semiconductor boom, AI boom, QE, low interest.  If all those 4/5 things happen and you still lose money as the largest CPU company it’s laughable bad.  \n\nFirst it was Intel 10nm coming for like 3 years I kept hearing that, their mobile SOC was going to get them in phones, their GPUs were catching up in gaming, their GPUs would be AI competitive.  I’ve worked with this stuff intimately and every quarterly report is filled with lies.  \n\nINTC shareholders really do have a legit case here. Course you have never worked with this stuff but think another 3 years will print while bag holding.", "score": 11, "replies": [{"body": "I guess they have a case, but the us govt picked intel to make us chips, and right or wrong, the money is allocated. So, in my mind, it's a bargain even if the last 8 months were criminally bad.", "score": 2, "replies": [{"body": "intel is becoming a manufacturing and r&d company. will take like 10 years to complete the turnaround. they could actually get bought by nvidia or something, thatd be funny", "score": 1, "replies": []}]}]}, {"body": "You have no idea how the semiconductor business works. You’re just babbling", "score": 2, "replies": []}, {"body": "What does US strategic security have to do with dominating international markets?", "score": 2, "replies": [{"body": "Money is money. Guaranteed money is a defense contract. And if they get anything else, bonus.", "score": 1, "replies": [{"body": "Outdated tech won’t be in high demand or any demand and not at a profitable price. For who will those factories pump out stuff?", "score": 1, "replies": [{"body": "Why would brand new factories be designed to make outdated chips? Why does intel using outdated tech and suddenly laid off everyone working at those factories equate to the brand new 20 billion dollar factories will make trash when completed? but hey, im not here to convince you. Keep the price where i can buy more.", "score": 1, "replies": [{"body": "National Security mostly, which was stated publicly if I remember correctly", "score": 1, "replies": []}]}, {"body": "Military applications don't necessarily need the newest tech. They need *reliability*. Oh wait...", "score": 1, "replies": []}]}]}]}]}, {"body": "They redesigned their chips this year but I guess that was too much research 😂", "score": 0, "replies": [{"body": "Bag holder\n\nLike how they lied about having figured out 10nm for 12 quarters or they lied about their modems business until they had to sell it for 10 billion loss or they lied about their gpu business or they lied about outlook and missed by miles?  \n\nI’ve got some magic beans to sell you , maybe with that history we’ve got a right to be skeptical", "score": 4, "replies": [{"body": "The chips are being made by TSM should be fine.", "score": 1, "replies": [{"body": "This isn’t the INTC flex you think it is. \n\nSo INTC chips made by Intel are dying and failing.  They don’t trust their own manufacturing and sending it to TSM to “fix” this.  You guys are bullish on INTC because they can’t make working chips and are sending it to TSM? When Intel plants come online and everyone wants high end CPUs that don’t fail they’ll go to TSM? \n\nThis is your bullish case for INTC? They don’t trust their own manufacturing to make their own CPUs and need to out source it?  \n\nYou have to be the biggest regard if you think this point is actually a pro to bring it up.", "score": 1, "replies": [{"body": "I think most of their capacity is being used for their new Xeon chip.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Grandmas ghost", "score": 16, "replies": [{"body": "..Used to go to church on Sundays. \n\nGrandma’s ghost, shares all in on Intel.", "score": 4, "replies": [{"body": "...Used to issue out a warning.\n\nShe'd say... *Billy, don't you understand. Pat Gelsinger is a really bad man. Fry your CPU until it's just sand.*\n\nDon't put... \n\n*My $700k into his F%#!ING hands. That foundry play is a guv'ment subsidy scaaaaam...*", "score": 8, "replies": []}]}]}, {"body": "Lead Paint-iff: that poor college student", "score": 12, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Based on our observations, that might happen in due time lol.", "score": 5, "replies": []}]}]}, {"body": "And she is dementedly angry, while yelling at you in a langue you don’t understand.", "score": 6, "replies": []}, {"body": "I can already imagine a Family Guy scene where the lead plaintiff is grandma’s ghost, and Peter represents her because is the only one who can hear her", "score": 3, "replies": []}, {"body": "So is this done in the living or dead courts? Also will the payouts be in cash or crypto then?", "score": 3, "replies": [{"body": "R.I.P.D case for sure.", "score": 3, "replies": []}, {"body": "Nfts", "score": 1, "replies": []}]}, {"body": "Grandma coming back alive to sue Intel from beyond the grave.", "score": 1, "replies": []}, {"body": "https://preview.redd.it/iwb4bfy3ewhd1.jpeg?width=884&format=pjpg&auto=webp&s=8747c517a1a63b7ae2eaca6a34d93b75ec17a376", "score": 1, "replies": []}]}, {"body": "Nah this happens when any company drops 30%. Some class action lawyer must be making money but never heard about shareholders getting paid", "score": 701, "replies": [{"body": "No joke. Seen the same ambulance chasers advertised about Nvidia.", "score": 149, "replies": []}, {"body": "Nobody told me stocks could go down?!", "score": 118, "replies": [{"body": "Fake news", "score": 19, "replies": []}]}, {"body": "Shareholders get paid... pennies per share. But the lawyer gets 1/3 of the settlement so...great for them. Really just a way for lawyers to get tens of millions and probably further damage the stock price.", "score": 18, "replies": []}, {"body": "Each shareholder will get a check for 6 bucks", "score": 13, "replies": []}, {"body": "All the ambulance chasers come out when the institutions lose money. But when we get ripped off it’s business as usual", "score": 23, "replies": []}, {"body": "Nah it happens. I had a stock (company I used to work for …. Ugh) drop 30% after earnings and 85% overall and “sue” statement came, the company issued a 1 time 5% dividend to shareholders so it was kind of a lump sum payback. Obv not even close to the stock losses but it’s a consolation", "score": 6, "replies": [{"body": "…. But then their share price dipped the same amount. It’s just moving money from one pocket to the other and paying the lawyers 40% for the privilege. This is bad news for shareholders", "score": 6, "replies": []}]}]}, {"body": "https://preview.redd.it/gg0x4e38vthd1.jpeg?width=1280&format=pjpg&auto=webp&s=1855b5c3d6bac85ed45960af6f820443525fab0f\n\nNana would be pissed too.", "score": 1208, "replies": [{"body": "Nana doesn't even have two monitors? SMH", "score": 112, "replies": [{"body": "But the monitors she does get are *thicc*.", "score": 64, "replies": []}, {"body": "Bullshit. She has a heart rate monitor & a blood pressure monitor", "score": 49, "replies": [{"body": "Under rated comment ![img](emote|t5_2th52|4271)", "score": 9, "replies": []}, {"body": "Don't forget glucose for da 'betes", "score": 2, "replies": []}]}, {"body": "Psshhhhh nana got 7 monitors…\n\nShe just spins around…\n\nAnd…\n\nBoingggggg", "score": 6, "replies": [{"body": "But the other 6 are for playing Solitaire", "score": 4, "replies": []}]}]}, {"body": "https://preview.redd.it/qxbcx55c8whd1.jpeg?width=1024&format=pjpg&auto=webp&s=2f14694c1acfa47c1a15bac7c4801124e2814614", "score": 17, "replies": [{"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 3, "replies": []}]}, {"body": "Nana seeing nothing but red", "score": 2, "replies": [{"body": "I like how the last red bar goes up on the top graph lol", "score": 3, "replies": []}]}, {"body": "I can’t believe no one has mentioned she’s not even using the fucking keyboard lol", "score": 1, "replies": []}]}, {"body": "Its ambulance chaser law firms you see them every time a stock goes down. They get fees from the idiots that engage them and the shareholders get like 0.13c in 8 years from now", "score": 286, "replies": [{"body": ".13c is more than that dumbass grandson has made", "score": 80, "replies": []}, {"body": "I've literally gotten checks for $0.02 in a class action lawsuit that I didn't know that I was a part of.", "score": 16, "replies": [{"body": "I make it a couponing hobby to sign up for class action settlements and exaggerate my damages.", "score": 9, "replies": [{"body": "I believe they refer that to that as fraud", "score": 6, "replies": []}]}]}, {"body": "This is on contingency", "score": 17, "replies": [{"body": "There are plenty of dipshit lawyers too.", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 10, "replies": [{"body": "I’m a PC gamer and my YouTube has been full of Intel chip fail videos for a few months now.  \n\nAMD has also been having a lot of chip issues as well as an open war with Gamers Nexus over its chip failures and lack of accountability. \n\nIt wouldn’t surprise me if AMD financials drop and it’s a big wtf to the markets. Usually it’s a lot of basic testing videos in the algorithm or NVidias bleeding edge card has heat issues. Lately it’s nonstop “do not buy these chipsets…” both Intel and AMD", "score": 1, "replies": []}]}]}, {"body": "https://preview.redd.it/i7h257trbuhd1.jpeg?width=1290&format=pjpg&auto=webp&s=cf904323d9ff0bf6c725f069f39bd7370395d111\n\n🥹🥹🥹", "score": 311, "replies": [{"body": "Meemaw is haunting that little shit from the grave", "score": 33, "replies": []}]}, {"body": "Lmao, they don't realize that they are sueing themself?", "score": 313, "replies": [{"body": "Lawyers are happy anyways...", "score": 103, "replies": []}, {"body": "Perhaps they dumped the stock and are now suing. Doubt they would hold and sue at the same time.", "score": 33, "replies": [{"body": "No. Then they lack standing for most if not all of those claims.", "score": 6, "replies": [{"body": "That makes no sense, surely you just had to be a holder when the fraud occured? You can't extract damages from Intel if you have to hold a proportionate ammount of the company's stock. Any amount they pay would immediately be reflected in the share price.", "score": 15, "replies": []}, {"body": "That makes no sense. Stock you owned lost value. That's standing because you were the one damaged.", "score": 3, "replies": []}]}]}, {"body": "\"intel goes down another 20% after court decides intel has to pay of stakeholder\"", "score": 27, "replies": [{"body": "Then goes up 20% from business insurance payouts", "score": 2, "replies": [{"body": "Nope, not how it works if the payouts are enough to drop a stock 20%.", "score": 1, "replies": []}]}]}, {"body": "well they are suing the company management, kinda make sense to get rid of them if they ever want their investment back.", "score": 19, "replies": []}, {"body": "Make the shares go up so we can sell!", "score": 7, "replies": []}, {"body": "Quick, someone post the put a stick in the bike wheel meme", "score": 4, "replies": []}, {"body": "impossible onerous shame repeat rinse deserve ad hoc birds nose dolls", "score": 2, "replies": []}, {"body": "Micheal Jackson, the first man to clone himself, is suing himself for molesting himself", "score": 2, "replies": []}, {"body": "I guess theoretically you could have sold then sued, but yeah. If you kept your shares.", "score": 1, "replies": []}]}, {"body": "https://preview.redd.it/olvdqyz5kuhd1.png?width=913&format=pjpg&auto=webp&s=e0df651a1416ccadd74d84a3a88627c738aa00b2", "score": 54, "replies": [{"body": "This never gets old", "score": 1, "replies": []}]}, {"body": "Intel kid check in", "score": 32, "replies": []}, {"body": "Nana's revenge", "score": 45, "replies": []}, {"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4267)", "score": 56, "replies": []}, {"body": "If the company doesn't make a profit and on top of that has added substantial debt in the last year then what will they pay you with even if you sue and win?", "score": 50, "replies": [{"body": "Dont try and add logic to this. It will come from the magic money trees. Just because they dont have money, does not mean they cant pay butt hurt shareholders loads of money, that dont make sense.", "score": 30, "replies": [{"body": "Fairly safe to assume that officers and directors have insurance against this sort of lawsuit", "score": 4, "replies": []}, {"body": "Money can come from business insurance", "score": 1, "replies": []}]}, {"body": "what about when their new foundrys are up and running? they're spending like crazy on expansion", "score": 0, "replies": []}]}, {"body": "Zinsner. was CFO at Micron 2 years ago. Chandrasekaharan(head of technology development) also left Micron for Intel only a few weeks back. imagine the regret", "score": 62, "replies": [{"body": "[deleted]", "score": 24, "replies": [{"body": "Get in line. Nana gets her cut first...", "score": 10, "replies": []}]}]}, {"body": "Man fuck your shares... Puts anyone???", "score": 12, "replies": [{"body": "I dont have them anymore I sold them after it crashed… I luckily didnt put that much into it, unlike that one guy 🥲", "score": 8, "replies": []}]}, {"body": "are we watching the downfall of intel ? the entirety of gen Z grew up with untel CPUs and just like that, it's about to be the new IBM", "score": 34, "replies": [{"body": "I get your point, but IBM is, today, actually profitable, and yielding 3.5% on a dividend they can actually afford to pay out", "score": 34, "replies": [{"body": "IBM reinvented themselves.\n\nHopefully Intel can do it too …\n\nGrandma is watching", "score": 2, "replies": []}, {"body": "Yeah, IBM I was looking at through 2022 and it suddenly exploded up!", "score": 1, "replies": []}]}, {"body": "IBM is still valid in the B2B space. Not respected but still valid. \n\nJust like Dell. Nobody knows anything about them but they are still raking it in by playing in the B2B space.", "score": 14, "replies": [{"body": "IBM is very big in mainframe, made some good investments with red hat. IBM is also one of the forerunners when it comes to quantum computing.\nThey also receive a stable revenue from the shit ton of patents they own.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 10, "replies": [{"body": "Finally someone who actually understands what's going on in the fabs! There are so few process dev people commenting around these recent market developments, and way too many people who only know what marketing tells them. It seems to me like most people have no clue what they're even investing in these days.", "score": 8, "replies": []}, {"body": "How has Intel solved the cobalt problem? Genuinely asking.", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "While this could be their bottom, there is still a lot of “ifs” in there. It could be stagnant for another 5 years before they can prove themselves. IMO it’s too early to buy in, I’d wait until they can show they can turn it around.\n\nYou don’t have to get the absolute bottom, you can still ride them back up if/when they can prove they can compete again.", "score": 1, "replies": []}]}]}]}, {"body": "literate encouraging joke fragile jobless homeless butter shaggy disarm reminiscent", "score": 3, "replies": []}, {"body": "> untel\n\nYou maybe onto something here. ", "score": 4, "replies": [{"body": "I like the idea - un-tel Intel", "score": 1, "replies": []}]}, {"body": "> the entirety of gen Z  \nI mean, you are not wrong, but isn't this true for millenials too? (not sure what intel's market share was for gen X)", "score": 1, "replies": []}, {"body": "Generation X here, where your added you arithmetic processor (80287) to your CPU (80286). Practicing assembler to 8086 gen ( horrible CPU compared to Motorola 68000 :) )", "score": 1, "replies": [{"body": "And stuck a turbo button to it", "score": 1, "replies": [{"body": "Oh yes I remember when the turbo button appeared with the frequency display, 2 digits at the beginning.", "score": 3, "replies": [{"body": "Sounds fancy:).  Machines at our uni just had the light come on if i remember", "score": 1, "replies": [{"body": "https://preview.redd.it/acubhwzstuhd1.jpeg?width=320&format=pjpg&auto=webp&s=518a174c5a3383749bd12fd54498393f1b1fe8e9", "score": 4, "replies": []}]}]}]}]}]}, {"body": "So you’re also trying to make your grandma proud?", "score": 21, "replies": [{"body": "Make Grandma Great Again", "score": 10, "replies": []}]}, {"body": "Didn't even read the article. I came straight to the comments for one thing only and I was not disappointed.", "score": 15, "replies": [{"body": "Was literally telling my bf about Intel Grandma seconds before I saw this post 😭 ", "score": 14, "replies": [{"body": "Do you mean your wife's boyfriend?", "score": 4, "replies": []}]}, {"body": "Grandma approves", "score": 1, "replies": []}]}, {"body": "The intel guy will eventually sell at 50% loss and then the price will spike crazy high.   Wait for that signal.  When he capitulates and sells his bags for a large loss.   Then buy in.  He likely owes Inheritance tax that he has yet to pay so when the IRS comes knocking he will sell at a loss.  Buy the next day.", "score": 19, "replies": [{"body": "you do not pay tax on inheritance.", "score": 3, "replies": [{"body": "You do, but it depends on the state. Lowest is NJ where you pay on 350k+ or something. Federally, it's 5 million or so, I forget. Many states don't have one and often it's in the millions.", "score": 2, "replies": [{"body": "in New Jersey inheritance to children is tax free, of course until you reach the 13.6M", "score": 3, "replies": []}]}, {"body": "that's strange, my buddy is having a fit over money he owes after his mom passed and willed him her home which is paid off in full.", "score": 2, "replies": [{"body": "a. his mom owned a house but had unpaid bills and loans, so just loans his mom owed. If you accept the good stuff, you also get the bad stuff.  \nb. his mom was filthy rich 13.6M+ and his mom's state paid tax i.e poor dude got 20M instead of 25M  \nc. he is complaining about property taxes which were increased because his mom bought the house for 10k and a dinner table. While he inherited a 1.4M house so his mom paid 1% of 10k, but he now pays 1% on 1.4M", "score": 4, "replies": [{"body": "I will let him know!!!  He will be very relieved.", "score": 3, "replies": []}]}, {"body": "If he lives in the home or rents it out, he pays no \"inheritance\" taxes except the normal yearly property taxes that everyone pays on their home or on the rental income. If he sells it, then he will owe capital gains taxes.", "score": 1, "replies": []}]}]}, {"body": "denying", "score": 1, "replies": []}]}, {"body": "Where is 700k INTC guy?", "score": 12, "replies": [{"body": "Ha ha he started the lawsuit", "score": 20, "replies": []}]}, {"body": "Means nothing anytime a stock falls people try to sue I see the notices all the time I doubt many of them actually win", "score": 5, "replies": [{"body": "These always get tossed, just ambulance chasers collecting their fees", "score": 1, "replies": []}]}, {"body": "Lol", "score": 4, "replies": []}, {"body": "from what I understand law suits are practically obligatory after major drops it's not news and shouldn't be factored into you decision making", "score": 3, "replies": [{"body": "“Stocks could go down?!?”", "score": 1, "replies": []}]}, {"body": "They clearly said the foundry business would add value but that it would be cost intensive to stand up and it would take some time so who knows. ", "score": 3, "replies": [{"body": "Boomers when the company has expensive CapEx after signaling it’s gonna be expensive for years: ![img](emote|t5_2th52|27421)", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Praise Jesus", "score": 2, "replies": []}, {"body": "bought 250k worth, it is literally nothing", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "       ", "score": 1, "replies": []}, {"body": "bro... Are you serious? many of us have burned way more money on stupid stocks such as BBBY and other similar stocks. The fact you actually think it is anything to him, means he was successful in his intent.", "score": 1, "replies": []}, {"body": "Actually to his net worth 250k is nothing.  To smart people we know it means he has no confidence in his own company .  \n\nHe’s worth  well over 120 million , 250k is .002 of his net worth\n\nThat’s like losing 25 cents to him", "score": -1, "replies": []}]}]}]}, {"body": "I ignored WB advice, started buying Intel at $28, sold at $33 less than a week before it tanked. \n\nThanks be to the gods of the market, though normally they shit on me.", "score": 3, "replies": []}, {"body": "We are seeing what the intel guy did was his remaining 100k. All to lawyers and gonna force intel to make him a profit lol", "score": 3, "replies": []}, {"body": "Can I start suing for when I lose money gambling? Lmao", "score": 3, "replies": []}, {"body": "Everything is securities fraud. \n\n-this is not Matt Levine's burner account", "score": 3, "replies": []}, {"body": "Same as Crowdstrike. Gotta file first in case anything goes south further", "score": 3, "replies": [{"body": "To be fair crowdstrike was gross negligence, someone actually did fuck up. Intel signaled for years they were gonna lose money building the foundry business and their regarded shareholders still lost their minds when they actually lost money on said foundry business ![img](emote|t5_2th52|4271)", "score": 3, "replies": []}]}, {"body": "Suing because intel didn’t give them information that would be considered insider trading if they used it and sold? Bold move. Is the lawyer asking legal fees up front? Or is this guy charging no legal feels in hopes of collecting 50% of a settlement like a true regard. \n\nPuts on this lawyers legal future.", "score": 3, "replies": []}, {"body": "Bagholders getting desperate now.![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4267)", "score": 3, "replies": []}, {"body": "everything is securities fraud", "score": 3, "replies": []}, {"body": "You're gonna sue a company that lost 50% of it's market cap in less than 6 months? Enjoy the 2 cents per share every plantiff will get out of this", "score": 3, "replies": []}, {"body": "This is a common thing that happens after big stock crashes. Nothing every comes out of it.", "score": 3, "replies": []}, {"body": "You bought a stock knowing it could go up or down. It went down. Thanks for playing, better luck next time.", "score": 5, "replies": []}, {"body": "Not even the prayers protect our hero", "score": 2, "replies": []}, {"body": "You will get a coupon for a discount on a chip.", "score": 2, "replies": []}, {"body": "Only way may to make money back Grandma. Put your soul into this /s", "score": 2, "replies": []}, {"body": "What would it do for the guy that put 700k into it lol", "score": 2, "replies": []}, {"body": "The stock went down and Im not happy about that. Wtf?\n\nTheir complaints will be nothing more than a fart in the wind. \n\nPut your money in index funds", "score": 2, "replies": []}, {"body": "Grandma shall be avenged!", "score": 2, "replies": []}, {"body": "How could this possibly be a win for current shareholders", "score": 2, "replies": []}, {"body": "People would have not bought the stock if they knew that the company was actively hiding that it had defective products. People would have not bought intel chips if the knew that there was a problem. Intel is hemorrhaging customers because the trust i gone.", "score": 2, "replies": []}, {"body": "Shareholders sue Intel. Intel drops in value on the news.\n\nShareholders: ![img](emote|t5_2th52|27421)", "score": 2, "replies": []}, {"body": "These suits happen all the time on stock drops, I don’t think anything ever comes from them because stocks are know to be risky for these exact reasons", "score": 2, "replies": []}, {"body": "Turns out there's no law against suckin'.  Ask me how I know", "score": 2, "replies": []}, {"body": "Could be an early step for government intervention.  I think there is a great deal of truth that Intel is a national security matter.  I don't necessarily believe government intervention will benefit shareholders in the near term (see GM, Chrysler).", "score": 2, "replies": []}, {"body": "This is the most stupid decision. It makes me question the IQ and memory of those investors. You know for 2 years that company is reorganizing, you decide you still want to keep the stock during reoganization. Now it drops like a rock, obviously amplified by algos because someone wanted stock for cheap and now you cry like a baby for unrealized losses instead of just have patience. Some who have some memory, know that in 27.04.2023 the company had way bigger losses yet the price barely moved, so obvious there was some manipulation also.", "score": 2, "replies": []}, {"body": "How are they going to pay shareholders? Think they can come up with 32B? Just another law firm that will get rich off this if they even get paid. It’ll probably get thrown out of court anyway…", "score": 2, "replies": []}, {"body": "Didn't they also just get a bunch of fed money to boost chip manufacturing in the US?", "score": 1, "replies": [{"body": "Remember that Samsung and TSMC also got some of the sweet government Moe y. Intel is not the only dog, just an underfed one", "score": 5, "replies": []}, {"body": "Nah, gov backed out i think", "score": 1, "replies": []}, {"body": "Ya they probably are gonna just take out tax dollars and use them to reorganize", "score": 1, "replies": []}]}, {"body": "That's interesting. Gambling is hard when you lose. But maybe if a few years intel will go up, that's a lot of payroll. They will go up and ceos won't reap the rewards , right? RIGHT?", "score": 2, "replies": []}, {"body": "I like it", "score": 1, "replies": []}, {"body": "The stockgods just can't let grandma rest in peace ", "score": 1, "replies": []}, {"body": "Nana is giving a hard lesson from afterlife to his grandson", "score": 1, "replies": []}, {"body": "Grandma sends her regards", "score": 1, "replies": []}, {"body": "So how would this even work? They then pay themselves?", "score": 1, "replies": []}, {"body": "So if intel lose and have to pay out. Hows Intel gonna get the money? From the sharehoarder?? Think of the sharehoarder!", "score": 1, "replies": []}, {"body": "Intel will be an activist play.", "score": 1, "replies": []}, {"body": "Lawyers will do but you can also recover maybe half penny of your each stock. Ie each $20k lost you get $5", "score": 1, "replies": []}, {"body": "I’m thinking about buying, what’s the consensus here? I want to do the opposite", "score": 1, "replies": []}, {"body": "They’re laying off 15,000 people.", "score": 1, "replies": []}, {"body": "LOL \n\nMimaw’s Estate vs. Intel", "score": 1, "replies": []}, {"body": "Dang. How many kids did Nana have?", "score": 1, "replies": []}, {"body": "Grandmas boy is leading the pack", "score": 1, "replies": []}, {"body": "Intlel: dead inside", "score": 1, "replies": []}, {"body": "Guys, I’m hopeless at this, just here for the memes honestly. But… doesn’t suing Intel make the stock value go down?", "score": 1, "replies": []}, {"body": "How the fuck they didnt warn before earnings report they miss that bad? Thats illegal", "score": 1, "replies": []}, {"body": "Zinsner is a fitting name for a CFO. Since Zins is the German word for interest. 🙈", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4271)nana is pissed", "score": 1, "replies": []}, {"body": "We all know the REAL reason the stock dropped. The money guys were waiting for exactly $700k to be invested into commons so they could tank the price.", "score": 1, "replies": []}, {"body": "I wonder how the intel kid is doing", "score": 1, "replies": []}, {"body": "it’s about time. Pat needs to go away also.", "score": 1, "replies": [{"body": "Regarded take, INTC got mismanaged after Pat left. They brought him back to turn the ship around but it takes time to implement changes in a big company.", "score": 0, "replies": []}]}, {"body": "Taxpayers seriously paid $8.5 billion for Intel to implode.", "score": 1, "replies": []}, {"body": "Anyone else wondering how the 700K investor is doing?", "score": 1, "replies": []}, {"body": "Go Intel! Will they be the next failed business the government has thrown money at?", "score": 1, "replies": []}, {"body": "Nana is the prosecutor", "score": 1, "replies": []}, {"body": "I belive you need to be onboard the class action in order to get any money IF they win. Just beeing a share holder wont cut it. But perhaps Im wrong.", "score": 1, "replies": []}, {"body": "The “C” will still get their millions in bonuses and not one will go to jail.  Government will bail them out due to “to big to fail” song …… we have a broken system that no one wants to fix.", "score": 1, "replies": []}, {"body": "No no, intel fixed it with the  27 biOS updates", "score": 1, "replies": []}, {"body": "Intel is going to have to ask the fed to add more money to the grant to build that manufacturing in the USA 😂\n\nBut hey, 15K employees laid off and the CEO got a 45% salary increase. You know the business is dead when they take a fail upward approach like this. Shareholders should axe the CEO.", "score": 1, "replies": []}, {"body": "That poor dude who put 700k…\nWhere is it at now?", "score": 1, "replies": []}, {"body": "I’ll be selling puts for months while this this thing goes sidewise.", "score": 1, "replies": []}, {"body": "INTEL PLEASE REACH 12, I will full port if you do", "score": 1, "replies": [{"body": "It’s already trading at book value", "score": 3, "replies": [{"body": "assets-debts?", "score": 1, "replies": [{"body": ".25 debt to asset ratio lol", "score": 2, "replies": [{"body": "bro this shit is good then when do we get the short squeeze?", "score": 1, "replies": [{"body": "Squeeze deez nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Float is too big for a short squeeze probably, just wait until sentiment changes and it’ll run again. It’s a shakedown that comes with any business pivot.", "score": 1, "replies": [{"body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Squeeze deez nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": ">“Intel (INTC) was sued on Wednesday by shareholders who said the Silicon Valley chipmaker fraudulently concealed problems that led it to post weak results, slash jobs and suspend its dividend, and caused its market value to sink more than $32 billion in a single day.”\n\nNot the only thing INTEL is concealing.", "score": 1, "replies": []}, {"body": "It'll lead to an outing of the ceo and board members doubt anyone gets money back", "score": 1, "replies": []}, {"body": "What would the resulting outcome be? If they wanted money wouldnt this just sink the ship faster?\n\nIf they wanted to oust leadership that would be more interesting but i dont think there's laws that are punishable by being fired.", "score": 1, "replies": []}, {"body": "If you look at the latest headline about almost every stock the latest headline is always something like: \"The law offices of bumfuck and dumbshit are suing $TICKER\" its so widespread. Its worse than \"INJURED BY A TRUCK?!?!\" dudes", "score": 1, "replies": []}, {"body": "me and muh 2 shares at -53% looking forward to getting our money back lol", "score": 1, "replies": []}, {"body": "Dividend turning into a class action payment, haha.", "score": 1, "replies": []}, {"body": "Buy more, lower your cost avg, then you need the shares to move less to recover 🤓💯", "score": 1, "replies": []}, {"body": "Me who just bought into Intel: what losses? :p", "score": 1, "replies": []}, {"body": "If the glove doesn’t fit, you must acquit", "score": 1, "replies": []}, {"body": "Nana is saved", "score": 1, "replies": []}, {"body": "Grandma watching over her grandson. What a legend.", "score": 1, "replies": []}, {"body": "Whenever i am feeling down after seeing some red numbers i come here to read about grandma 👵 and eventually everything gets better", "score": 1, "replies": []}, {"body": "Now, to be fair....\n\nOn average, there are any where from 300 to 400 new securities class action lawsuits filed annually. Looking at this proposed class action, I always see this unfold with any publicly traded company when it comes to moving against who should be liable (assuming liability here) when shit hits the fan. \n\nIs it over for Intel? Nah. Are they  in hot, hot doo doo water? Oh god yeah. \n\nAll in all, my heart goes out for the employees who are severely impacted by these moves. Got a buddy in Oregon who just moved there during this housing shit show, got locked into a rate for an incredibly inflated, overvalued home and now goes through the unemployment process to try to get something back in line.\n\nI've dumped my shares a few months back, but definitely hits home when lives are changed by this in every which way.", "score": 1, "replies": []}, {"body": "This kinda stuff always happens. They’ll end up settling most likely.", "score": 1, "replies": []}, {"body": "OP happily greedy when all is good, making noise trying to recover losses when shit hits the fan", "score": 1, "replies": [{"body": "Well, lesson learned… I didn’t put much there luckily", "score": 1, "replies": []}]}, {"body": "Intel powered Grandma's Packard Bell on dial up, but she didn't invest because it took 45 mins to load a Google search.\n\nInstead, saved for 65 years pinching pennies and eating Circus peanut's to lose 300K in a week on a company that didn't exist before she was 60.", "score": 1, "replies": []}, {"body": "I sold this near the top thanks to a Sven Carlin YouTube video calling the company a fraud. They have been using shady accounting tactics for quite some time. \nPlot twist: he now says it’s a great time to get back in. Too over sold. Time will tell.", "score": 1, "replies": []}, {"body": "RIP the 700k guy", "score": 1, "replies": []}, {"body": "https://preview.redd.it/qa1gsgsq81id1.jpeg?width=1179&format=pjpg&auto=webp&s=e77e881b853ccdd9dbb6e1001ac6bcdfff923aec", "score": 1, "replies": []}, {"body": "Hmmm… sounds like I need to buy some INTC stocks…\n\nIs it a good signal to buy?", "score": 1, "replies": []}, {"body": "Wouldn't surprise me that they were doing that. \n\nIt seems they knew about a problem in CPU manufacturing that would result in corrosion of the chips, yet they made no mention of it to anyone, even the people running data centres who buy heaps of CPUs. \n\nThat company is rotten to the core, but this lawsuit isn't going to do anything.", "score": 1, "replies": []}, {"body": "No you won’t recover anything, this only benefits the lawyers and the shareholders end up worse off since the company they are owners in is paying money to its lawyers instead of investing it.", "score": 1, "replies": []}, {"body": "star witness: intel guy", "score": 1, "replies": []}, {"body": "Interesting how for each dollar to the shareholders, the total value of shares will go down by a dollar, so... like a dividend but without profits basically?", "score": 3, "replies": [{"body": "Only the law firm who convinced them to sue themselves takes a cut of whatever they end up paying themselves.  Takes a truly regarded person to lose twice on the same trade.", "score": 3, "replies": [{"body": "So.. calls on whoever is the litigation funding provider for the lawfirm?", "score": 2, "replies": []}]}]}, {"body": "This means buy. 2026 intel turns around", "score": 1, "replies": [{"body": "Nana gonna double up", "score": 1, "replies": []}]}, {"body": "Intel is a very long play. Eventually they will have some new state of the art fabs that will take market share from TSMC. But this is years off. There is always a chance they will find some efficient architecture for their CPU's or find a better footing in the GPU market too. It's not impossible, just difficult.\n\n\nThe way I see it is Intel will pivot into the wafer market with a bit less focus on chip design in a few years. They might stay behind AMD in chip design, but their own chips will eventually be made at a discount and there will be no shortage of orders for fab space that will be sold at a premium. \n\n\nAnd if China invades Taiwan, suddenly those Intel fabs are gonna be looking mighty fine. ", "score": -4, "replies": [{"body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "I don't think you understand the problem with Intel. It's leadership. They missed every wave in the last 20 years. It's a dead company.\n\nMy positions: sold recently and lost £15000 - money would've been dead for years so better off reinvesting in something with a quicker short term upside", "score": 0, "replies": [{"body": "Yea this is the bottom for sure. regards capitulating in excessive fear, INTC is quite literally priced for bankruptcy at its enterprise book value right now.", "score": 1, "replies": [{"body": "Unfortunately the stock market isn't rational. I do believe we're not far from the bottom but doesn't mean we're going to see any growth. I don't want to hold bags for a couple of years just to break even. There is also opportunity cost", "score": 1, "replies": [{"body": "Intel being this oversold when they’ve been signaling their strategy was gonna be expensive is the irrational fear. I don’t mind waiting for the irrational exuberance cycle.", "score": 1, "replies": []}]}]}]}]}]}
{"title": "SPY/QQQ have another 30% upside before a major correction. ", "selftext": "I know this sounds crazy to most bears and probably bulls as well, but everything I’m charting and gathering from past recessions/bear markets tells me we still have plenty of room to go up before we should all consider buying long dated puts and singing YMCA\n\nFirst from chart perspective, both SPY and QQQ are above their 50 and 100 daily moving averages and they have both support around strong Fibonacci levels. If they both manage to  reclaim August, as in forming either a bullish reversal on the weekly candle or forming a bullish hammer on the month (SPY 550 or QQQ 460) than we are 100% likely to see a strong blow off top before end of the year as we are also in an election year which is very bullish.\n\nSecond, we are all aware of the obvious which is the consumer is weakening (see earnings for most consumer stocks) and that credit debt is rising. But we do know that tech spending is still high. Amazon, microsoft and meta are all raising capex regardless of the consumer. They know the key *now* is to prepare for leveraging AI as a service. They can weather a 12-24 month recession. They have *billions* in cash with very low debt to equity ratios.\n\nSo as such, expect Nvidia earnings to keep rising, and for Amazon/microsofts cloud services and AI systems to grow while their more consumer side of business slows down or goes stagnant for the next year.\n\nThird, I expect layoffs and mass defaulting to occur sooner rather than later. But I do not think this will impact the stock market. Until tech is positioned to stop giving every dollar they can possibly shovel to the mag 7, once all infrastructure is tapped out and exhausted, will we see the market turn over and retrace. The fed will likely raise rates in September and we will see the yield curve potentially uninvert after more than three years. But it will take 6-12 months before this causes a market downturn because we will rally from the news for quite some time.\n\nFor SPY; long to 650, short to 500 level. Don’t do anything else till then. ", "id": "1ep1s50", "created_utc": 1723319577.0, "score": 105, "upvote_ratio": 0.62, "num_comments": 229, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 6 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 1504 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1ejbalk/buy_puts_end_of_august_this_year_will_likely_end/) \n**Account Age** | 10 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Okay crayon boy", "score": 774, "replies": [{"body": "Using them to draw instead of as food is an improvement", "score": 125, "replies": [{"body": "https://preview.redd.it/5t0es045exhd1.png?width=720&format=pjpg&auto=webp&s=9a4c523d05dfa4ea8011bfd2ccb05e744cb30dc9", "score": 35, "replies": []}]}, {"body": "Purple crayons taste like grape fr", "score": 14, "replies": [{"body": "Yo FR FR", "score": 7, "replies": []}, {"body": "Iykyk", "score": 2, "replies": []}, {"body": "purple tastes dry I was disappointed.", "score": 1, "replies": []}]}, {"body": "who left him out of the basement?", "score": 7, "replies": []}, {"body": "Please just make it make sense to me. How do people convince themselves that a graph of an index fund can tell them anything?\n\n\nLike, TA is fuckin' stupid on its own.\n\n\nBut, like...this guy thinks the entire market, or at least this one fund, is in collusion and they're all gonna work together to gain 30 percent because...well...crayons...", "score": 7, "replies": [{"body": "TA with fundamental analysis is amazing. TA singularly is goddam bizarre.", "score": 3, "replies": [{"body": "Doing TA with fundamental analysis is just you doing some mental gymnastics to validate your decision to gamble your paycheck.", "score": 1, "replies": [{"body": "Not really.   \nEspecially for me considering my sole source of income is trading and I live a very comfortable lifestyle because of it. \n\nBut you do you man.", "score": 1, "replies": []}]}]}, {"body": "He's probably a crapricorn", "score": 1, "replies": []}]}, {"body": "Right?? \n\nLmao! \n\nWas going to say\n\n\"Says who? Your little lines?\" \n\nYour comment is much better 😘", "score": 19, "replies": [{"body": "Step away from the crayons please, they are to be used with the rest of the class.", "score": 1, "replies": []}]}, {"body": "Okay guys, I did not expect to see so much hate from crayon eaters in my messages along with tons of praise and Zelle payments from rich fucks encouraging coke and hooker use my god thnx", "score": 3, "replies": []}, {"body": "I like the red ones cuz they’re the tastiest", "score": 2, "replies": []}, {"body": "The moment someone says \"Fibonacci\" i'm out of this bs.", "score": 2, "replies": []}, {"body": "He obviously got his Crystal Ball 🔮 at the good place", "score": 1, "replies": []}]}, {"body": "My bro draws a line and then thinks he’s an expert selling advice to people", "score": 312, "replies": [{"body": "Same reason why some people believe in astrology.", "score": 58, "replies": [{"body": "Okay, but what do you guys think algorithmic traders do? They make strategies with indicators/TA and backtest. You're telling me if something works a statistically significant amount of the time that's \"astrology\"? \n\nYes, most people fail with TA, but most people fail at trading in general anyway. It's a tool", "score": 6, "replies": [{"body": "There’s entire hedge funds built off of quant trading managing very large sums of money. No one thinks it’s actually bullshit. \n\nBut your average discord trader barely has a fundamental understanding of how the tools work, so they’re more like children drawing a bunch of lines on a graph. \n\nWhen a MIT PhD uses such tools and works for citadel, that’s science. When a random trader draws colourful lines all over a graph, that’s pseudoscience.", "score": 38, "replies": [{"body": "> There’s entire hedge funds built off of quant trading managing very large sums of money. No one thinks it’s actually bullshit.\n\nEven then, hedge funds get their asses kicked by just a boring S&P 500 ETF like VOO", "score": 9, "replies": [{"body": "Well, this is just a myth. Plenty of firms beat the market. Jane Street is printing rn for example", "score": 0, "replies": [{"body": "Js underperformed s&p in recent 3 years btw https://hedgefollow.com/funds/Jane+Street+Group/Performance-History, a period that’s arguably very favorable to quant", "score": 3, "replies": [{"body": "No, this is completely false info. Google sucks now, and I can see how you ended up on that link. \n\nHere is an article from [Bloomberg ](https://www.removepaywall.com/search?url=https://www.bloomberg.com/news/articles/2024-04-17/jane-street-scores-10-6-billion-trading-haul-amid-growth-push?embedded-checkout=true) (I tried removing the paywall for you). They made 7 billion last year from 21b equity. This is what you would see on Bloomberg terminal", "score": 2, "replies": [{"body": "Probably yeah, JS doesn’t have a long enough track record of profitability that some others have shown. Bar is certainly high there, but its relatively good culture may prevent it from beating indices over a long horizon (say 20 years+). I think ppl generally estimate js to be a $3m/employee fund. There are fund out there that can produce $25m/employee for years straight.", "score": 2, "replies": [{"body": "I'm honestly not sure what point you're trying to make here. It kind of seems like you're summarizing the article I just sent\n\nThey're on track to do >10b this year. My point was just that there are definitely algorithmic trading firms that beat the market. TA isn't \"astrology\"; it's a tool.", "score": -1, "replies": []}]}, {"body": "Google sucks despite the info not being from google but from hedgefollow.com?  \nHuff more copium", "score": 2, "replies": [{"body": "He googled \"Jane Street annual returns\" and clicked the first non-wikipedia link. That's what I meant. Hedgefollow is not as accurate as the Bloomberg Terminal. If you want to argue that, I have nothing to say. \n\nI didn't think I needed to write this all out, but that's on me for forgetting I'm on wsb", "score": 1, "replies": []}]}]}]}, {"body": "Yes just a myth, except that it's not. the average hedge fund underperform the nasdaq 100 for various reasons.", "score": 1, "replies": [{"body": "You have really bad reading comprehension. \n\n>Plenty of firms beat the market.\n\nI never said they beat the market *on average*.\n\n>hedge fund\n\nJane Street is not a hedge fund.", "score": 1, "replies": []}]}]}]}, {"body": "Or r/wsb", "score": 5, "replies": []}, {"body": "Sure, citadel:  \nIn 2023, Citadel's global fixed income fund returned 10.9%, while its flagship fund, Wellington, returned 24.4% in 2020. At the end of 2023, Citadel returned $7 billion to its hedge fund investors after achieving a 15% return, although this was less than the S&P 500's 26% return that year.\n\nUnderperforming the Nasdaq 100 constantly.\n\nNevermind their constant scandals.\n\nUse FA! not TA!", "score": 2, "replies": []}, {"body": "Many of the actual PHD’s in the field believe some form of EMH, so a random MIT PHD in a different field working in finance making some algorithm does not mean much. ", "score": 1, "replies": []}, {"body": "The issue is drawing a single line that is damn near exponential and tend justifying it as support when there are limited data to support his line. TA is fine, using a combination of high probability of success indicators and patterns are fine. It’s not exactly fine to sell shit like potential 30% returns based on my stupid ass line.", "score": 1, "replies": []}, {"body": "Okay, but you could say the exact same thing about all trading. Example: /r/valueinvesting is bs, but in the hands of Berkshire Hathaway, it's powerful", "score": -1, "replies": []}]}, {"body": "You’re a tool.", "score": 3, "replies": []}, {"body": "Wrong. Algo Traders do not run on TA. they run on 1) resistance/support levels that are determined by FA not TA and 2) they analyze momentum, volume and price to bear/bulltrap (which is slang for taking maximum profits)", "score": 3, "replies": [{"body": "Wtf are you talking about??? Just go to quantconnect or /r/algotrading to see what historic strategies look like. These become public because they no longer work, but you can still see that a lot are based on TA. The classic example is turtle trading\n\n>and price to bear/bulltrap (which is slang for taking maximum profits)\n\nThis is nonsense. How do you quantify/code this\n\n>resistance/support levels that are determined by FA not TA\n\nFA can't be quantified. I honestly don't think you even know what algotrading is, let alone how to code", "score": 1, "replies": []}]}]}, {"body": "Some people try to find a Fibonacci sequence in stock trading patterns. i mean how cringe is that. Try to find smileys or donald trumps or dicks or whatever. just as useful.", "score": 1, "replies": []}]}, {"body": "Which is hilarious cus anyone who has actually drawn trend lines knows spy has broken multiple the last month. This guy sounds like a used car salesman selling calls", "score": 3, "replies": [{"body": "On the daily, it’s broken one major trend line and not gone back in yet. Not sure what you mean by “multiple” in the last month", "score": 3, "replies": []}]}]}, {"body": "https://preview.redd.it/wst5bzpc7whd1.jpeg?width=1024&format=pjpg&auto=webp&s=e3f3ab8e1bde23c2c17ed30d05f90cf2a5257760", "score": 124, "replies": [{"body": "love how everything is red, just like OP's portfolio", "score": 10, "replies": []}]}, {"body": "Nuh Uh", "score": 37, "replies": [{"body": "Yuh huh!", "score": 7, "replies": []}, {"body": "🤣🤣🤣🤣", "score": 1, "replies": []}]}, {"body": "Not enough triangles. I'm out.", "score": 35, "replies": []}, {"body": "“We will go up 30% before end of year” says wsb user\n\nThis is a godawful sentiment signal, all…", "score": 161, "replies": [{"body": "I didn’t say before end of year.", "score": -33, "replies": [{"body": "Oh damn. Just nvmnd then lol. “At some point SPY will go up 30%” is a decent prophecy even if useless. \n\nThat’s to completely disregard the last sentence of your second paragraph.", "score": 84, "replies": [{"body": "I think you got it wrong a second time.\n\nThey said “it will go up 30% before the next correction”.", "score": 5, "replies": [{"body": "Nvmnd that’s completely predictable my point has been rendered useless", "score": 1, "replies": []}]}, {"body": "I mean this guy is probably regarded but he said before next major correction", "score": 8, "replies": [{"body": "Fair enough but he’s still essentially saying “from x price we will go up 30%”, it’s actually even more hubristic to say “specifically this price movement will occur from  x price and y price will not be reached first”", "score": 0, "replies": []}]}, {"body": "No this is it, we've hit the final ATH. It's all downhill from here\n\nEdit: /s if that wasn't blatantly obvious", "score": -3, "replies": [{"body": "Why did you get down voted?  I just gave you an up voted. My guess is es will hit 5500 5511 then going to new low", "score": 0, "replies": []}]}]}]}]}, {"body": "were approaching September. historically the worst trading month of the year.", "score": 30, "replies": [{"body": "When everyone thinks the same way....\n\nHoward Marks once talked about \"second-level thinking\" as \"*You must think of something they haven’t thought of, see things they miss or bring insight they don’t possess. You have to react differently and behave differently*\" to do better than average.\n\nThat's why I always utilize an Oujia board to decide when to trade, instead of relying on some lines.", "score": 18, "replies": []}, {"body": "Vix also popped 60 and the market only pulled back 10%….old adage is time to buy when the vix is high! So maybe this is the dip 🧐 idk im buying everyday. On margin. Till im at a comfortable level", "score": 7, "replies": []}, {"body": "Meaning it’s the best time to buy?", "score": 3, "replies": []}, {"body": "Best time to buy is when VIX spikes", "score": 4, "replies": []}]}, {"body": "I completely agree. Last week was a major test of the uptrend, and both QQQ and SPY rebounded gloriously above that trend. Same thing happened 10 months ago and the market went parabolic afterwards.\n\nBers, you have been warned ![img](emote|t5_2th52|4276)", "score": 14, "replies": []}, {"body": "Once it gets into the brown, it's going to flush down.", "score": 10, "replies": [{"body": "But if it goes yellow, let it mellow", "score": 2, "replies": []}]}, {"body": "news drive the market\n\ntradewars, taiwanwar, inflation, japan mega earthquake includont tzunamies, there plenty of room for news", "score": 22, "replies": [{"body": "How could news drive the market. you can clearly see the line that the market can’t go below??? You blind or sm???🤡", "score": 37, "replies": []}, {"body": "News does indeed drive the market, and nvda has some good news scheduled for the 28th. I think we're likely to see a rally from earnings assuming the guidance continues to be strong, though probably not the 30% over the next few months that this guy's crayons have told him", "score": 4, "replies": []}, {"body": "I watched markets collapse one by one as the S&P drove higher and higher throughout covid before it crashed.  I would expect nothing less to happen again.\n\nThe time to get bullish is *always* when people are acting like it cannot go higher.", "score": 2, "replies": []}]}, {"body": "This has a 50% chance of happening. It either will happen or it won’t happen\n\nSource:trust me bro", "score": 20, "replies": []}, {"body": "https://preview.redd.it/ou7f1g7t6whd1.jpeg?width=1170&format=pjpg&auto=webp&s=239a28e176c905e92651e549fda29b98a94a8fee\n\nForgot to post my positions", "score": 35, "replies": [{"body": "lol…. You’re gonna lose all your money.", "score": 53, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Good eye, didn’t pay enough attention. As long as he treats it as a long term investment minimum 3-5 years he’ll probably be ahead at worst case", "score": 1, "replies": []}]}]}, {"body": "Expirations should be further out imo this looks dangerous", "score": 8, "replies": [{"body": "IMO 2 months is decent if not too far OTM. The guy that took Intel guys place as the WSB darling specifically mentioned he did 2 months out and sold 2 weeks into holding them. Much further out and you’re not really getting an aggressive move when things go your way. Just no more than 2 strikes OTM.", "score": 3, "replies": []}]}, {"body": "Sir, I'm accepting donations. I can make good use of your money, thanks.", "score": 6, "replies": []}, {"body": "Similar portfolio - I cut all my shorter term options though.  End of August will be very telling on which direction we’re heading.  If the market reacts well to 2.8% real GDP (and if that number comes in higher) and nvda earnings + probably 50 basis point cut in sept.  Lots of good news on the horizon.  Long term I have some concerns", "score": 3, "replies": [{"body": "Do you actually believe the Japanese Carry Trade was completely unwound?", "score": 7, "replies": [{"body": "No - that’s my primary concern with a rate cut.  It could add extra pressure due to the weakening of USD.  But if equities are going up then it will relieve some of that.\n\nBasically worst case scenario is yen / USD goes up while equities go down which is what happened.  If the fed stops QT it will add more liquidity to the markets though.  Idk either way I’m long positions, I’m not panic selling and I’m only adding small amounts on dips while still being half cash", "score": 4, "replies": [{"body": "So more puts then?", "score": 1, "replies": []}]}]}, {"body": "Not to mention that September has been historically a bad month", "score": 3, "replies": [{"body": "This year has been a lot of inverses. March is generally bad, but good this year. April is supposed to be good, but bad this year. \n\nHowever, even though this is said, the expiration should still be at least Oct. He can at least roll on Sept if he needs more time.", "score": 3, "replies": []}]}, {"body": "And you would be correct. I’m a banker and I get to see lots of inner workings of others financial health. I kind of compare it to obesity in the US. People can’t stop eating processed garbage. People also cannot slow their spending. Now it’s just on credit. 10% of credit card debt is 60 days + past due. We also have a glorious milestone of over 1 TRILLION in credit card balances. Oof. Debt crisis in the making……amongst other things. The stock market would sure make things look like they are just fine. They aren’t,", "score": 2, "replies": [{"body": "Ok, so how is this different than the 2008 housing market where it can nonetheless stay afloat for years? I'd rather set stop losses and switch once we crash than try to short the global economy that can irrationally fly for possibly years to come.", "score": 6, "replies": [{"body": "Completely different. In the late 90’s and early 2000’s, there was little to no oversight on mortgage brokers. Well, the big loan buyers ( Lehman Brothers amongst many others ) were offering disastrously dangerous loan products. For example, someone with a 580 credit score could borrower up to 95%, cash out, on the value of their home AND state their income!  And the cherry on top was that most were adjustable rate loans. Well, that set the stage for 2008 as they were bundling these risky loans into mortgage backed securities ( MBS ) that were supposed to be lighter risk. They weren’t at all. Then the perfect storm hits with 911. Recession, then comes the defaults. On a MASSIVE scale. Those loans, for the most part, are not prevalent in the market these days. This scenario we are in is also a possible perfect storm. Years of robust growth and cheap money got an entire generation spending like it was going to last forever. Here we are now. 8 trillion in debt heavier, the middle class making generally the same amount but inflation out of this world. And when you hear “CPI 3% YOY” you know better than that. How much did you pay for those groceries in 2019? How about that car? Or services? Now what is actual inflation? Not 3%. And those trusted brands you buy….well, you are still buying them…..but getting less for the same price. Stagflation is the word. The corporations are showing record profits. How??? That’s how. Do some research on how we got out of the 2008 recession. It was actually the middle class ( that didn’t really have the money ) kept spending. THAT group got us out of that one while the big dogs sat on the sideline with huge amounts of cash. They won big then and are winning big now and will win big again if we do slip into an official recession.", "score": 7, "replies": [{"body": "I like to use the price of gold as a very rough true inflation gauge since in the past 100 years it only has a real return of like 1%….its up 63% in the past 5 years", "score": 5, "replies": []}, {"body": "You misunderstood my question. I asking about timing the collapse/recession.", "score": 2, "replies": [{"body": "Impossible. Way too many factors involved. And there is a chance an election could change things and / or timing IF something were to happen:", "score": 1, "replies": [{"body": "that was my point. that in 2008 even though quite a few people saw how bad things are, they didn't time it right. that's why in the famous burry scene in the big short he says he's not wrong, he's early, to which the other character responds they're the same thing. the whole point of my original comment was that even if things are really that bad, you're better off having stop losses and switching to shorts once things start to collapse rather than trying to short the market now.", "score": 2, "replies": [{"body": "Exactly. However, I wouldn’t be shorting anything, personally, right now. I still think there is a lot of forward momentum that will take us through first quarter of next year. Could be totally wrong. And yes, they are going to lower rates but 50 bps isn’t going to do much. In fact, I think it is already baked in to the market. Most likely it will pump it for a moment and we will see pullback after that. I will, however, be taking short positions once they officially lower. Almost a guarantee that it will be a temporary hype.", "score": 1, "replies": []}]}]}]}]}, {"body": "Because we had a functional printer back then, we don't now.", "score": 1, "replies": [{"body": "Oh they have made monster improvements to the new printer. It prints real nice. And fast too.", "score": 2, "replies": []}]}]}]}]}, {"body": "Idk how to read this\n\nA lot of red tho\n\n![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "Bro please round off those numbers. Why own 97 shares when you can own 100??", "score": 2, "replies": []}, {"body": "Your profile isn’t very heavy in options. Not to mention, how you gonna play out at 150 in SPY handles in 2 months? October expirations at most", "score": 1, "replies": []}, {"body": "Oc", "score": 0, "replies": []}]}, {"body": "Oh what astral projection are we looking at today boys? Think mars is in regardation", "score": 8, "replies": []}, {"body": "Honestly not a bad line. This is the camp I’m in. Everything thinks a recession is coming but we are about to get cuts BEFORE a recession is happening. In the past cuts were the REACTION to a quickly mounting recession. We are likely fine for a while and once people realize that we will rally until there is a true recession whether it’s from rates or something else. But I also think 6-12 months down the line if not later.", "score": 4, "replies": []}, {"body": "The Fed will likely raise rates in September?!?!?! Yeah right", "score": 5, "replies": []}, {"body": "I too have special needs", "score": 4, "replies": []}, {"body": "Thank goodness the lore bullish sentiment I see with absolutely no real back bone the happier it makes me that I bought puts", "score": 7, "replies": [{"body": "When you see posts like this; it’s pure hopium. Good chance there is downside to come.", "score": 2, "replies": [{"body": "Yes sir", "score": 1, "replies": []}]}, {"body": "You bought puts after a 15% pull back?", "score": 1, "replies": [{"body": "https://preview.redd.it/rgjcf2sn9whd1.jpeg?width=1170&format=pjpg&auto=webp&s=3206a185e3a77e11f2e4dc3dced703405532368a\n\nBought for 1.38 ish had about 20 contracts in total", "score": 2, "replies": [{"body": "May the best regard win 🫡", "score": 2, "replies": []}]}, {"body": "No before and I cashed out I only have puts on Walmart and Zillow and Redfin now", "score": -1, "replies": [{"body": "Idk about Walmart I feel like they’re recession proof and their dividends are strong.", "score": 4, "replies": [{"body": "Only bearish on Walmart cause they’re still pre flash crash prices and really close to their ath, it’s been trading really weird and lastly they put out a profit warning in end of June", "score": 1, "replies": [{"body": "That’s because they’re a dividend stock. They don’t always follow the market. Compare McD, WMT, and MO to prior crashes. They’re called defensive stocks for a reason", "score": 5, "replies": [{"body": "McDonald’s missed q 1 and went from 277 to 243, wmt hasn’t a had a significant pull back there’s negative catalyst and until the market figures out what it’s doing this is a sellers market Tesla shit the bed and death spiralled goggle hit earnings and shit the bed so why not Walmart", "score": 0, "replies": []}]}]}]}, {"body": "Shorting real estate seems smart rn. Itll be the first to crash", "score": 3, "replies": [{"body": "I’m getting pissed on and getting told it’s raining with my Zillow and Redfin puts but I feel like my trade plan is still solid and I bought the puts for 100 plus days out I feel like it’s one of those things were bags are being dumped and they’re waiting for some one to hold them.”", "score": 1, "replies": []}, {"body": "This is why the fed is nervous to lower rates. The market will be flooded with inventory since people can make a much-needed downsize move (missed mortgage payments has been skyrocketing). People have been holding onto their overpriced homes and the bubble is bigger than 08. Commercial real estate is in an even worse position", "score": 1, "replies": []}]}]}]}]}, {"body": "Ok Tom Lee", "score": 3, "replies": []}, {"body": "Don’t fckin lie to me on a Saturday", "score": 3, "replies": []}, {"body": "Been looking for a reason to invest in bonds…found it.", "score": 3, "replies": []}, {"body": "Doubt it. Last week was a pretty clear inflection point. Weakness in consumer spending was obvious.  Consumer debt at all time highs. Commercial real estate is a looming disaster.  I see house prices being cut constantly with listings stay up a long time.  There’s a bunch of supply but no buyers at these unsustainable prices that got spiked up too fast by artificial demand from all the free money.  It’s all shaking out now.  \n\nI think it’s more likely the s&p 500 goes down to at least 3,600 before the correction/downtrend reverses.", "score": 3, "replies": []}, {"body": "No I do actually think he's right.\n\nSort of.\n\nIF there's a crash it will most certainly be preceded by the stupidest bull run you have ever seen.\n\nWe have not even seen the IPO wave that comes with a bubble yet.  \n\nI'm effectively a perma-bear and even I will be betting on SPX to 6000.", "score": 5, "replies": [{"body": "Yes. Not to mention small caps (IWM) is still beaten down. Ever since the sell off we never got a recovery to 220", "score": 1, "replies": []}]}, {"body": "Maybe, but I strongly think we will see another dump before any bullish move.\n\nIf we break through that resistance line , I will switch to bullish, but I think SPY is going to 450 first\n\nBelow is SPX\n\nhttps://preview.redd.it/fhoczo6d9whd1.png?width=2028&format=png&auto=webp&s=9f085175366725368c69d9aa77c789ea452f3146", "score": 14, "replies": []}, {"body": "Thanks for the analyses, I found it interesting.  \nSPX will clearly reach 6.5k at some point, the question is when?\n\nWithin this year is not very likely, it would mean SPX gained close to 40% in a year, which is excessive.\n\nHowever, I do think the next few months will be volatile, and there might be a lower bottom coming, maybe below 5k, depending on news, rates, inflation etc.\n\nI also believe the market will do very well after the election, maybe a little sooner, but that's still a ways off, and could change, but that's usually how things work.\n\nTalk of recession and slowing economy is not that uncommon in august and september, it usually passes, and hopefully it does this time as well, and doesn't end up being a real problem for the economy", "score": 2, "replies": []}, {"body": "u know u can just draw a line going down too", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I will be messaging you in 30 days on [**2024-09-09 21:56:07 UTC**](http://www.wolframalpha.com/input/?i=2024-09-09%2021:56:07%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/1ep1s50/spyqqq_have_another_30_upside_before_a_major/lhi0pah/?context=3)\n\n[**2 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F1ep1s50%2Fspyqqq_have_another_30_upside_before_a_major%2Flhi0pah%2F%5D%0A%0ARemindMe%21%202024-09-09%2021%3A56%3A07%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201ep1s50)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "“Don’t do anything else till then” as if money can’t be made on the up and downside of a stock", "score": 2, "replies": []}, {"body": "Does 100% likely = definately?", "score": 2, "replies": []}, {"body": "Go  all in with spy call OP. We will see you behind Wendy", "score": 2, "replies": []}, {"body": "So SPY to 680 my calls are golden then", "score": 2, "replies": []}, {"body": "So 30% up 10% down? Seems bullish", "score": 2, "replies": []}, {"body": "“What, you think I fell out of a coconut tree”?", "score": 1, "replies": [{"body": "This one made me laugh :)", "score": 1, "replies": []}]}, {"body": "No", "score": 1, "replies": []}, {"body": "\"The Fed will likely raise rates in September\"??\n\nIs that what you meant to write?", "score": 1, "replies": []}, {"body": "This is when she says \"put is all  in\n.. but all  is already in\"", "score": 1, "replies": []}, {"body": "I can live with that.", "score": 1, "replies": []}, {"body": "Credit markets totally collapsing in real time. It’ll be fine.", "score": 1, "replies": []}, {"body": "Just need it to get to 540 by Monday and we're good ez", "score": 1, "replies": []}, {"body": "Nah looking at $380 support into election", "score": 1, "replies": []}, {"body": "Why is it yellow and not green crayon then?", "score": 1, "replies": []}, {"body": "Wait until you saw my lines 😎", "score": 1, "replies": []}, {"body": "The safer play would have been to use all those funds to buy TQQQ no? Good luck, personally I’m loading up on TSDD starting Monday", "score": 1, "replies": []}, {"body": "Fibonacci used to suck Libarace", "score": 1, "replies": []}, {"body": "Bulls truly are regarded.", "score": 1, "replies": []}, {"body": "500 SPY 08/13/2024 $350C 🎭💴📈🇯🇵📉🥳", "score": 1, "replies": []}, {"body": "Is this fib trend based extension?", "score": 1, "replies": []}, {"body": "lol k", "score": 1, "replies": []}, {"body": "Bullshit", "score": 1, "replies": []}, {"body": "Time to buy puts", "score": 1, "replies": []}, {"body": "He has spoken puts it is boys", "score": 1, "replies": []}, {"body": "Cope 🪢", "score": 1, "replies": []}, {"body": "Oh yes Fibonacci and crayon lines and oooo what does your palm lines say??", "score": 1, "replies": []}, {"body": "Well this is bearish", "score": 1, "replies": []}, {"body": "What an arbitrary line lol\n\nIf I draw the line at the bottom of the top green bar then we have 30% down side", "score": 1, "replies": []}, {"body": "Sure bro", "score": 1, "replies": []}, {"body": "Yeah sure", "score": 1, "replies": []}, {"body": "This is the confirmation bias I need.", "score": 1, "replies": []}, {"body": "I expect a lot of volatility and weigh more to the bear side than bull. Good luck with your chart", "score": 1, "replies": []}, {"body": "smoking meth bro", "score": 1, "replies": []}, {"body": "Ok boys, the top is in.", "score": 1, "replies": []}, {"body": "Pretty good analysis. We hype up into 2025 for a spring post election correction", "score": 1, "replies": []}, {"body": "Now make the lines do the thing where you say we're heading towards a recession", "score": 1, "replies": []}, {"body": "Take your lines and leave. Never return to this casino.", "score": 1, "replies": []}, {"body": "Why didn’t you draw the same line 50 SPY handles ago?", "score": 1, "replies": []}, {"body": "Fib levels and MA’s , god how you’re all fooled by furus. You think institutions look and say , fuck were above the 50 day MA AND we’re at key fib levels we can’t sell this!! Lol, you need a real system, any system without orderflow, historical tick data, historical volatility data, and options writers positions, you’re cooked.", "score": 1, "replies": []}, {"body": "Technical Astrology.\nWhat is the flaw in people's minds that makes them think magical Fibonacci ratios (drawn from one arbitrary price point in time, to another) have any kind of predictive power in something as complex as a global financial market?\nDon't people realize how absurd this is?", "score": 1, "replies": []}, {"body": "Yeah.... nossas.... 🤣", "score": 1, "replies": []}, {"body": "Well duh, NQ broke 19558.25, which means we’re in Wave 3 now. This is the most aggressive wave. \n\nNQ, ES, and YM all confirmed. Personally my PT is 19653, but to each his own. Swinging 8/30 ITM calls. Take me to tendie town, fuckers.", "score": 1, "replies": []}, {"body": "Tea leaves aren’t really good for anything other than making tea", "score": 1, "replies": []}, {"body": "you drew the line, so it must be true!\n\nthe fed is not raising rates in september", "score": 1, "replies": []}, {"body": "Damn so you're saying we are actually headed for a bear market :(", "score": 1, "replies": []}, {"body": "!Remindme 5 months", "score": 1, "replies": []}, {"body": "Imagine putting actual cash money into stocks based on the graph of what they did in the past", "score": 1, "replies": []}, {"body": "NostraDumbass over here ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "Good call.\n\nI just went all in.", "score": 1, "replies": []}, {"body": "Is he high or something?", "score": 1, "replies": []}, {"body": "Puts will print Monday if I am reading this correctly.", "score": 1, "replies": []}, {"body": ">The fed will likely raise rates in September and we will see the yield curve potentially uninvert after more than three years. \n\nWhy would the fed RAISE rates? Grandma is not amused.", "score": 1, "replies": []}, {"body": "Thanks man I will take this into consideration.", "score": 1, "replies": []}, {"body": "Puts it is", "score": 1, "replies": []}, {"body": "Did Friday all but confirm?  I heard that was a pivotal day", "score": 1, "replies": []}, {"body": "lol. Keep believing that. As soon as they touch their ath’s I’m yoloing on puts.", "score": 1, "replies": []}, {"body": "I think you’re right. Starting sometime in November. Until then it’s going to suck.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Was that referring to crowd source? If so I sold those at 215/share and went long. It’s now at 245.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yes if we close red this August September had a very good chance of being bearish because July also closed red.\n\nBut so far we are not looking to close red. we still have nearly 3 trading weeks left and the dip buying has been strong off of key support levels. \n\nAnd I don’t think we necessarily need to close green this month to be considered bullish. A strong reversal hammer could form on the monthly candle which would mean we close SPY at just 540-545. If that happens than I think September will be more bullish than average", "score": 2, "replies": []}]}]}]}, {"body": "My psychic says otherwise", "score": 1, "replies": []}, {"body": "Sure Jan", "score": 1, "replies": []}, {"body": "Famous last words. As if it can't dip below the line.", "score": 1, "replies": []}, {"body": "https://preview.redd.it/vax6a3nw2zhd1.jpeg?width=640&format=pjpg&auto=webp&s=e7545fc3dcf4b8ad9089f847f0c6449eb06c441a", "score": 1, "replies": []}, {"body": "Wow bearish much?", "score": 1, "replies": []}, {"body": "If I draw more lines, do I make more money?", "score": 1, "replies": []}, {"body": "This is literally beyond my comprehension, why show a chart and just show some candles you want people to see but not the death crosses on moving averages nor the declining volume for the week? Puts it is then", "score": 1, "replies": []}, {"body": "- Posts Fibonacci and TA voodoo stuff ✅ \n- Endows tickers with agency ✅ \n- Vague connection with fundamentals ✅", "score": 1, "replies": []}, {"body": "agreed", "score": 1, "replies": []}, {"body": "So, do I understand this right, you are predicting the stock market by connecting two data points with a line segment in yellow colour and extrapolate the slope directional as a future movement? Why did no one else think of that 🤯🤔?", "score": 1, "replies": []}, {"body": "Options might go 300%", "score": 1, "replies": []}, {"body": "puts it is", "score": 1, "replies": []}, {"body": "Man all your call outs suck checked your comments McDonald’s and crwdstrike. Just last week you said buy puts gtfo", "score": 1, "replies": [{"body": "McDonald’s went from 250 to 275 and crwd from 260 to 209. Are you a fucking idiot?", "score": 1, "replies": [{"body": "Are you tweaking you have a crwd put at $234 price it’s $240 currently mcds you had calls it’s $267 currently down since your post foh bum", "score": 1, "replies": [{"body": "When i made my post about mcd 72 days ago my average was 253/share. It went as low as 242 and as high as 275 after earnings.\n\nI entered short CRWD at 260 and sold it at 215 and i made $7000 off puts.\n\nhttps://preview.redd.it/j1xllaemy5id1.png?width=1170&format=png&auto=webp&s=fd44cb752be0382895d534fba667482352075803", "score": 1, "replies": []}]}]}]}, {"body": "Agree, spx to 6k-6.2k", "score": 1, "replies": []}, {"body": "I think that there is a very real scenario brewing where we will go into a mild recession that will really suck for some people and companies and others will barely notice. Long mag 7 to provide support through it.", "score": 1, "replies": []}, {"body": "I agree with what he says. We’re gna have another blow off top before a recession. Everytime the vix spikes the market goes higher. In the case of 07 it shot up before then crashing. I believe this is a very good take on the us economy at the moment. Something will blow up likely at some point but not until after the election. Most likely trump wins and then we see a market crash…. Just my opinion been trading and investing since I was 16 and I’m in my 30’s now.", "score": 1, "replies": []}, {"body": "I should of bought puts on friday", "score": 0, "replies": [{"body": "Should HAVE...Jesus christ people", "score": -2, "replies": [{"body": "how sad is your life that you have to correct grammar on wsb", "score": -1, "replies": [{"body": "Don't you mean that I OF to correct grammar?", "score": 7, "replies": []}]}]}]}, {"body": "We do realize that the rebound on Thursday is in fact not so bullish, right? It’s such a fucking bull trap. \n\nMultiple >3% swings in such short time frames aren’t signs of a healthy market. Y’all are going to get rugged because the market never goes straight down.", "score": -1, "replies": []}, {"body": "watch it drop 5% on mon", "score": 0, "replies": []}, {"body": "Your lines are as gay as you.", "score": 0, "replies": []}]}
{"title": "My 2 cents on what the fuck happened his week", "selftext": "If you woke up Monday and thought god fucking dammit I don’t have enough cash right now to buy this dip like I want too then you probably weren’t sitting in treasuries getting dicked on with 4% returns cause you got scared.\n\nSome of the valuations that morning were insane bargains. The first thing I bought was bitcoin and then of course sold before the major moves before buying nvidia below $100 and then cashed that shit out and was done.\n\nMy gains could buy a nice dinner at Wendy’s for a family of 5, which I absolutely fucking did and told them about the trades that got us here.\n\nNow I’m here to tell you we are going to SPY 600. It’s gonna be here by the end of the year. \n\nTrust me. JPOW wants to retire too…\n\nDid I spell everything correctly?\n\nI’m not sure spell check is working on my flight to Venezuela ", "id": "1ep3npr", "created_utc": 1723324751.0, "score": 1664, "upvote_ratio": 0.78, "num_comments": 305, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 1274 | **Previous Best DD** | \n**Account Age** | 7 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "So OP,\nWhat the fuck happened ?\nYou never explained.", "score": 1824, "replies": [{"body": "He spent all his gains on cocaine and did all of it in one huge line with his rolled up boarding pass before he got on the plane to Venezuela. I just know it in my heart of hearts that the boarding pass was comically rolled the long way and was wide like an oversized smoothie straw.", "score": 802, "replies": [{"body": "Yeah, that was the Venezuela part, how could you not pick that up? 🤣", "score": 59, "replies": []}, {"body": "OP does sound high", "score": 33, "replies": []}, {"body": "He didn't do any lines. He whipped out the baking soda and cooked it into crack and started smoking that shit.", "score": 10, "replies": [{"body": "![img](emote|t5_2th52|29637)", "score": 3, "replies": []}, {"body": "Smokef it on the flight to Venezuela", "score": 2, "replies": []}, {"body": "https://preview.redd.it/eas781ss37id1.jpeg?width=1080&format=pjpg&auto=webp&s=414824352b9a49bff2c8158bccc5c27612bfb7f8", "score": 1, "replies": []}]}, {"body": "I’m literally in Lima Peru doing exactly that 😆 I made $$ Friday and called my guy on WhatsApp. The shit they have down here is not for the weak.", "score": 3, "replies": []}, {"body": "Venezuela has that inflation thing down to a science", "score": 1, "replies": []}, {"body": "He just wanted to brag about buying 5 Wendy’s meals", "score": 1, "replies": []}, {"body": "He said longways 😭", "score": 1, "replies": []}, {"body": "Spent all ur gains on Venezuelan hookers lol", "score": 1, "replies": []}, {"body": "P-p-p-para-para-paradise.", "score": 1, "replies": []}]}, {"body": "Did you not read? Family of 5 got Wendy's", "score": 86, "replies": [{"body": "Got a family-pack deal behind Wendy's", "score": 7, "replies": []}, {"body": "That’s probably 150 bucks right there.", "score": 7, "replies": [{"body": "$148 with the app", "score": 2, "replies": [{"body": "The app is a must for exceptional savings.", "score": 2, "replies": []}]}]}]}, {"body": "At no point in your rambling, incoherent response were you even close to anything that could be considered a rational thought. Everyone in this room is now dumber for having listened to it. I award you no points, and may God have mercy on your soul.", "score": 94, "replies": [{"body": "Business ethics. Well see the thing about ethics...", "score": 5, "replies": []}, {"body": "Billy Madison never gets old.", "score": 6, "replies": []}, {"body": "one of my favorite movie lines EVER", "score": 2, "replies": []}, {"body": "Totally agree what a shit head", "score": 1, "replies": []}, {"body": "I'm still trying to comprehend what I was.reading. Either that person is high as a kite or big mental issues. The rambling made no type of sense.", "score": 1, "replies": []}]}, {"body": "OP is regarded", "score": 32, "replies": [{"body": "One of us!", "score": 9, "replies": []}, {"body": "Highly", "score": 2, "replies": []}, {"body": "Regarded with the hard G", "score": 1, "replies": []}]}, {"body": "He bought his family Wendy’s and forced them to listen to his nonsense for the meal.", "score": 13, "replies": []}, {"body": "Well all I can say is that I always eat 100mg of edibles on flights and OP most likely follows a similar protocol.", "score": 11, "replies": []}, {"body": "What happened is the market overreacted to one data point (a weaker-than-expected jobs report). \n\nWhy did the market overreact?  Because there’s been a collective disbelief on Wall Street about the strength of the U.S. economy for well over a year.  The “experts” have thought for many months that a recession is inevitable and will come very soon. But they’ve been consistently wrong.\n\nSo when the weak report hit, it resulted in a collective panic: “The recession is finally here!  Run to the exits!”  But a recession isn’t inevitable and it hasn’t come soon (or at all).  Maybe it will. But the doom-and-gloom crew have been telling us — incorrectly — that IT’S THE END for a damn long time.", "score": 36, "replies": [{"body": "It's the end!\n\nOf my sentence", "score": 9, "replies": []}, {"body": "wasn’t it because of the Japanese bank stuff?", "score": 1, "replies": []}, {"body": "Japan raising interest rates too. That was a factor. Check this out. \n https://youtu.be/iGBsuBnfcJc?si=gX6gvtP-R7KsVqpz", "score": 1, "replies": []}, {"body": "Incorrect. The first weak jobs report was the one three months ago. The July report was the most recent in a concerning trend of bad reports. \n\nJuly was particularly bad because the number of jobs created is below population growth, so we are actually contracting at the moment.", "score": 1, "replies": [{"body": "The market is a fickle mistress.  Real estate started a recession last Oct.  Jobs loss?  Can you imagine a 4,000 mortgage and a spouse is getting layoff letters?", "score": 1, "replies": []}]}]}, {"body": "SPY is going to 600 happened. \n\nCan't you read???", "score": 4, "replies": []}, {"body": "Godzilla probably.", "score": 1, "replies": []}, {"body": "His family lives in a Wendy’s?", "score": 1, "replies": []}, {"body": "OP says he got incredibly lucky and has no idea what he was doing. Could have easily gone south.", "score": 1, "replies": []}, {"body": "Its the friends we made along the way", "score": 1, "replies": []}, {"body": "lol ya literally gave no valuable insight, like a true degen", "score": 1, "replies": []}, {"body": "OP paper handed", "score": 1, "replies": []}, {"body": "He said 2 cents not 1 dollar buck", "score": 1, "replies": []}, {"body": "He was down to his last scent, couldn't pony up for the second one.", "score": 0, "replies": []}, {"body": "Read it again, he had a stroke.", "score": 0, "replies": []}, {"body": "Didn’t you read he almost had a dinner for five at wendeez but then pivoted back to studying for the sat", "score": 0, "replies": []}]}, {"body": "Thanks, unnecessarily aggressive person.", "score": 1516, "replies": [{"body": "While also providing nothing of value in their post.", "score": 566, "replies": [{"body": "Bro he sold bitcoin and bought nvdia then also sold it and something something 600. What more do you want?", "score": 322, "replies": [{"body": "Hey he also said we all should have bought when we were all locked out of our brokerages. How could we be so dumb! ", "score": 91, "replies": [{"body": "Yeah that pissed me off. Wanted to buy NVDA sub $98 ended up with $99 and $100. I’m still pissed about it", "score": 18, "replies": [{"body": "i got it at 98 both times this month 8) AMA", "score": 1, "replies": []}, {"body": "Here I am, NVDA @ 117 ;( still waiting to recover", "score": 1, "replies": [{"body": "woah! when was this??", "score": 1, "replies": [{"body": "Thursdays just before the fun last Monday", "score": 1, "replies": []}]}]}, {"body": "I played it safe with SMH", "score": 1, "replies": []}]}]}, {"body": "Wendy’s…![gif](emote|free_emotes_pack|yummy)", "score": 2, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Yeah, he's still using the front of Wendy's...", "score": 6, "replies": [{"body": "Because he could afford it.", "score": 5, "replies": []}]}]}]}, {"body": " Except jinxing us all back down to SPY 400 with his glaring top indicator of a post", "score": 25, "replies": []}, {"body": "Yeah he posted a title saying he was going to explain what happened and then instead read his trading diary to us, haha", "score": 9, "replies": []}, {"body": "The WSB way.", "score": 3, "replies": []}, {"body": "I find mild humor of some limited value.", "score": 1, "replies": []}, {"body": "Right. OP even had the wrong flair. Should’ve been ‘yolo’ instead of ‘discussion’ if it actually netted him dinner FOR FIVE at our favorite establishment.", "score": 1, "replies": []}, {"body": "He reminds me of those sales guys who think that yelling makes their points more true and effective. He must be right, look how loud he is.", "score": 1, "replies": []}, {"body": "Well he really meant was two cents was the value of his opinion.", "score": 1, "replies": []}, {"body": "That sweet sweet copium", "score": 0, "replies": [{"body": "What would I be coping about..?", "score": 1, "replies": []}]}]}, {"body": "I feel like this is the energy of when WSB first started, for better or worse, one guy is still holding onto that hope", "score": 46, "replies": [{"body": "What hope is he holding onto?  I don’t understand what he’s going for in this post.", "score": 19, "replies": [{"body": "Wendy's dinner for 5. Weren't you paying attention?", "score": 43, "replies": []}, {"body": "Cocaine rant", "score": 18, "replies": [{"body": "This guy gets it", "score": 3, "replies": [{"body": "I can smell the the ether through the text.", "score": 1, "replies": []}]}]}, {"body": "Zany zoomer clickbait non-sequitur humor a lot of people seem to like for some reason I think.", "score": 9, "replies": []}]}, {"body": "We still holding GameStop right?", "score": 7, "replies": [{"body": "Diamond hands.", "score": 5, "replies": [{"body": "My $300 1 stock hold is so light with these diamond hands. Never letting go", "score": 1, "replies": []}]}]}]}, {"body": "I was watching The Bear last night, I just assume this guy is an American chef.", "score": 5, "replies": []}, {"body": "In my experience the ones who are unnecessarily aggressive are the wisest and most regarded.", "score": 2, "replies": [{"body": "Lol", "score": 1, "replies": [{"body": "He got that backwards", "score": 1, "replies": []}]}]}, {"body": "I didn't perceive it as aggressive, but more of the IDGAF variety.  \n\nNot one single F will be given when I am en route to Venezuela either. Cocaine and hookers galore in a land that loves the American dollar bills....  I rest my case.", "score": 3, "replies": []}]}, {"body": "OP has been deported to Venezuela…again.", "score": 87, "replies": []}, {"body": "Spy 600 end of year? Going all on puts Monday open", "score": 55, "replies": [{"body": "Lmaooo on god I’m neautral now going full bearish next week", "score": 10, "replies": []}]}, {"body": "Same bought 25 NVIDIA ATM call options at 96 and 25 AMZN @ 157.5…crazy day was lucky to access my brokerage account early after the open unlike others", "score": 127, "replies": [{"body": "Yea wtf everything was down, rigged.", "score": 56, "replies": [{"body": "Yep I was trying to add money to my account like a mad man and was pretty much froze out", "score": 6, "replies": []}]}]}, {"body": "Family of 5!", "score": 106, "replies": [{"body": "Wife's boyfriend has 2 kids", "score": 271, "replies": [{"body": "LOL", "score": 12, "replies": []}, {"body": "those boyfriends get expensive", "score": 10, "replies": []}, {"body": "🤣", "score": 5, "replies": []}]}, {"body": "120 people. This has to be a huge family", "score": 8, "replies": []}, {"body": "OP is buying food for strangers because he doesn't realize the dry hand Js are in the back alleyway.", "score": 3, "replies": []}, {"body": "At Wendy’s no less- this guy won big!", "score": 1, "replies": []}]}, {"body": "You were actually able to access your trading platform Monday morning? Way to rub it in. I’m still waiting on the lawsuit that Schwab should face (it’ll never happen). The system is rigged.", "score": 89, "replies": [{"body": "Fuck Schwab, I miss TDA", "score": 31, "replies": [{"body": "I am e away from switching to TastyTrade. They stayed up…. TOS really let me down", "score": 1, "replies": []}]}, {"body": "Robinhood was working 🤣", "score": 27, "replies": [{"body": "It was wild HOOD was working and Fidelity & Schwab wasn't.", "score": 3, "replies": []}]}, {"body": "That was the craziest fucking thing I've ever seen. Every major broker was down at the same time. I legitimately wonder if something upstream at the exchanges was fucked and all the brokers did their \"break glass\" process of blocking logins. \n\nWith the crazy swings, I bet the HFTs and quant firms were pushing insane volume to the exchanges and they couldn't keep up.", "score": 36, "replies": [{"body": "Fidelity worked for me", "score": 2, "replies": []}]}, {"body": "I'm a novice with about 5k invested in ole Schwab and I thought it was really fishing I couldn't access my account till mid day", "score": 11, "replies": []}, {"body": "Interactive was working.", "score": 1, "replies": []}]}, {"body": "Word", "score": 23, "replies": []}, {"body": "These some of the biggest global moves in markets I seen in awhile. \n\nOne day Japan crashes the markets and it's looks like we going into a down trend.\n\nNope next day big time whales bought the dip.\n\nIt's going to be pretty choppy for a while don't get shaken out by these whales.", "score": 79, "replies": [{"body": "VIX went to 66.  Only two times that level of fear has happened before in the last two decades was Covid and GFC.\n\nRetail panic sold big time:\n\n>Institutional investors bought the dip, retail traders sold aggressively. https://www.investing.com/news/stock-market-news/institutional-investors-bought-the-dip-retail-traders-sold-aggressively-3556297\n\n>Retail investors were aggressive net sellers on Monday following the sharp equities pullback, with most of the selling occurring in the first hour of trading, JPMorgan strategists noted.\n\n>Institutional investors, on the other hand, bought the dip with +$14 billion in net buying (+2.9 standard deviations above the 12-month average) during market hours and -$6.7 billion in Market on Close (MOC) trades.", "score": 16, "replies": [{"body": "[deleted]", "score": 19, "replies": [{"body": "Although generally speaking there's a lot of evidence retail can actually move markets way more than people think, I didn't say retail necessarily fueled this particular drop by itself.\n\nJust saying they incorrectly bought into the fear-mongering and sold at the worst time.", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Some institutional investors had to sell to cover their Japanese currency positions.  The big firms who didn't have to do that were all buying.  Retail was probably all over the place because there was no big movement were some big brain explains to everyone why the crash happened and why the rebound is imminent.", "score": 3, "replies": []}, {"body": "Not sure how they categorize institutional and who was on other end.\n\nThe article just states institutional was net buyers.", "score": 1, "replies": []}]}]}, {"body": "They didn't all crash. Get off Robinhood.", "score": 0, "replies": [{"body": "Vanguard was down.", "score": 2, "replies": []}, {"body": "People were claiming fidelity as down as well.", "score": 1, "replies": []}]}]}, {"body": "This, and everyone’s bullishness while there are obvious signs of a recession, led me to sell on Wednesday", "score": 3, "replies": [{"body": "There aren't.  The economy is objectively strong.\n\n440,000 full time jobs added in July.  Prime age participation soared to 84%.  Jobless claims are super low.  GDP is accelerating.", "score": 1, "replies": [{"body": "inflation not under control, unemployment increasing, vix spike, sahm rule, increasing institutional divestment, increase in consumer debt, we can keep naming shit. let’s check back in three months and see. ", "score": 5, "replies": [{"body": "I am sorry these are all BS and lies.  Or at the very least uneducated half truths.\n\n* Inflation clearly cooling.  Harmonized CPI basically at 2%.  Even regular CPI around 1% annualized in 1Q.\n* VIX was just a silly crowd hysteria from a bunch of degenerate traders liquidating after being overlevered.  VIX is already down from 66 to 20.\n* SAHM rule even Claudia Sahm said it doesn't apply. U3 unemployment is NOT rising from net job destruction there is still net job creation.  Like I said 440,000 full time positions in july.  U3 is rising from expanding labor force and surging participation.\n* Consumer debt is low, not high.  Both in overall delinquent balances and service relative to income.\n* Institutions, broadly speaking are not divesting from the market.  Over the last year there have been net inflows.", "score": 1, "replies": []}]}]}, {"body": "You misinterpreted my post.  Retail panic sold while tutes gobbled the dip.", "score": 1, "replies": [{"body": "is there a way to measure that? I didn’t know that", "score": 1, "replies": []}]}]}]}, {"body": "No it’s not lol, it’s gunna be a straight line up to 570", "score": 2, "replies": []}]}, {"body": "Thanks! Taking your 2 cents and buying SPY puts.", "score": 16, "replies": []}, {"body": "Your 2 cents isn’t worth 1 cent.", "score": 25, "replies": []}, {"body": "Dude, chill out on the caffeine", "score": 11, "replies": [{"body": "That ain’t caffeine my regard ", "score": 10, "replies": []}]}, {"body": "The way you said that you told the family of 5 about the trades that \"got us here\" makes it sound like you made this update while chowing down on French fries and a frosty. Tell them all we say hi. And congrats I guess.", "score": 9, "replies": []}, {"body": "Positions or ban", "score": 7, "replies": [{"body": "Yeah, I want that Wendy's receipt OP.", "score": 1, "replies": []}]}, {"body": "Kid doesn't even know what the word \"valuation\" means 💀.\n\nKeep pretending.", "score": 5, "replies": []}, {"body": "If you were Canadian, you just watched the world markets burn on Sunday/Monday to come in on Tuesday as if nothing ever happened so it was a little saddening to miss out", "score": 17, "replies": [{"body": "So true. Very frustrating to watch all the amazing deals on Monday morning and not be able to buy anything (I didn’t want to buy US stocks- I’m an etf investor) It seems these events often happen on Canadian long weekends 😖", "score": 5, "replies": [{"body": "What ETFs do you like", "score": 1, "replies": []}]}]}, {"body": "\"bargains\" when NVDA was at x60 P/E 😂😂😂😂😂😂😂😂😂😂", "score": 25, "replies": [{"body": "It only went up from $160 to $1400 in a year and half. Now it’s down to $1040 a share! Such a steal!!!", "score": 13, "replies": [{"body": "https://preview.redd.it/k2jc1303cxhd1.jpeg?width=294&format=pjpg&auto=webp&s=6c9c84a442afa9f6acdadc7bfc2af17d9bdf45a3\n\nbuy bro, it's a steal, bro trust me buy it at x60 P/E it will retire us bro plz bro don't make fun of me bro buy it bro it has margin of safety bro trust my analysis", "score": 5, "replies": [{"body": "The most crazy comments I see are the people who bought the absolute top will say stuff like; “don’t worry, it’s gonna go back up”, or “The price action hasn’t been great lately, but I’m just gonna hold because it’ll be back up in a few months”\n\nLike bro… the last time NVDA had an insane run like this and then pulled back, it went from 3.50 to 34.00, and then dumped for an entire year straight. I wouldn’t be surprised if even though they beat earnings, the stock will still drop, and then continue to dump for the next 3-5 months heading into next earnings.\n\nAnyways… for those who are writing those comments…\n\nhttps://preview.redd.it/tthedhokzzhd1.jpeg?width=1024&format=pjpg&auto=webp&s=6b8dd25f073174fbbc646c5f0cb9315d2bb7768e", "score": 2, "replies": [{"body": ">entire cohort of tech CEOs / C-Suite / execs liquidate a big chunk of their stocks at the peak of the tech markets weeks ago\n\n>average r/wsb: buy the bargain bro (x60 P/E btw)", "score": 2, "replies": []}]}]}]}]}, {"body": "Nice bear flags on the charts. Especially the last one!\n\nBut TA is BS, right?", "score": 30, "replies": [{"body": "If TA was consistent we would all be rich", "score": 29, "replies": [{"body": "TA goes out the window in periods of high volatility, as uncertainty hits the market and you have bulls and bears fighting it out, so there’s no clear direction. But once volatility spikes down, you can rely more on TA. \n\nAs an example I had started long positions on Thursday and rode the trade until Friday morning because of TA. But trying to trade the previous days (Monday-Wednesday) it was a hella volitile and no one knew where the F the market was going next.", "score": 8, "replies": [{"body": "Even in high volatility though the price action respected key technical levels Qs bounced right off the weekly 50ema on Monday", "score": 1, "replies": []}]}, {"body": "If humans were rational, it wouldn’t work.\n\nPretty sure humans aren’t rational.", "score": 1, "replies": [{"body": "'If a, then not b' does not imply 'if not a, then b'.", "score": 5, "replies": []}]}]}, {"body": "Everything's a dip on the way down, 7 layer dip!", "score": 3, "replies": [{"body": "Luv dat cake", "score": 1, "replies": []}, {"body": "Ole!", "score": 1, "replies": []}]}]}, {"body": "All that for a Wendy's meal?", "score": 4, "replies": []}, {"body": "Why does this post have so much activity?", "score": 5, "replies": []}, {"body": "the title of this should have  been my 2 cents on how regarded i am. nothing in this explains the market.", "score": 4, "replies": []}, {"body": "Not to be a bear cause I hate bears. I wouldnt be surprised if there is one more large dip between now and end of september.\n\n\nNot as bad as the one that just happened because all the bears were driving the fear hardcore.", "score": 13, "replies": [{"body": "We could experience endless bull traps all the way down to -50% before September, what would you say then? ![img](emote|t5_2th52|8882)", "score": 7, "replies": [{"body": "Several brokerages locked out the retail bears Monday morning...", "score": 1, "replies": []}]}]}, {"body": "\"Some valuations were insane, so anyway i bought bitcoin, because thats worthless, and nothings more insane than spending 50k on a online token!\"", "score": 6, "replies": []}, {"body": "Most masturbatory post on wsb", "score": 3, "replies": []}, {"body": "SPY 300 eoy 2024 SPY 600 eoy 2025", "score": 3, "replies": []}, {"body": "Is 2 cents all you had left after panicking?", "score": 3, "replies": []}, {"body": "Wrong", "score": 3, "replies": []}, {"body": "Drunk", "score": 3, "replies": []}, {"body": "Spy 500 by Tuesday", "score": 3, "replies": []}, {"body": "Youre not a psychic so i dont believe you regard.", "score": 3, "replies": []}, {"body": "Monday puts. Got it.", "score": 3, "replies": []}, {"body": "Market looked like garbage after Friday when the largest semiconductor manufacturer in the US-Intel’s shit hit the fan and earnings were reported as less than PLTR. PLTR came in with the hopes and dreams, America is saved!", "score": 3, "replies": []}, {"body": "Bulls fuck hot chicks and fight and get stabbed to death by some Spanish dickhead in an arena full of idiots. Bears sleep and get fucked by some redneck in rural Vermont and probably die in a cave or something alone and are never seen again. I know what Id rather be.", "score": 11, "replies": [{"body": "Wtf does this have to do with the original post?", "score": 11, "replies": [{"body": "It’s that covert spy talk bro 😎", "score": 3, "replies": []}]}]}, {"body": "[removed]", "score": 5, "replies": []}, {"body": "And if SPY doesn’t hit 600, regard? The rug pulls of all rug pulls is around the corner, I suppose you’ll continue buying dips all the way down to -50%. Good luck ![img](emote|t5_2th52|4271)", "score": 4, "replies": [{"body": "Can’t wait. That bounce on Thursday doesn’t mean shit. \n\nJust one little piece of bad news next week and we are dipping quick again. Too much volatility. Could be wrong. But I really don’t think I am.", "score": 2, "replies": [{"body": "We are totally dipping and people will continue buying red ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|31225)![img](emote|t5_2th52|31226)", "score": 1, "replies": []}]}]}, {"body": "This guy either fucks or watches other people fuck while sitting in a comfortable chair.", "score": 3, "replies": []}, {"body": "You lost me at bitcoin", "score": 4, "replies": []}, {"body": "OMG great value here. Thanks, Michael Burry", "score": 2, "replies": []}, {"body": "“Trades that got us here” = ZJs behind Wendy’s.  Enjoy those tendies kids papa worked hard for them.", "score": 2, "replies": []}, {"body": "Flight to Venezuela was a nice touch, not sure how many regards will get that reference ![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "Ok… what the fuck.  Tell us next time. Dont come here after the fact acting like you’re all that.", "score": 2, "replies": []}, {"body": "Gonna buy a $599 strike on spy to honor you", "score": 2, "replies": []}, {"body": "Bitcoin has a valuation?", "score": 2, "replies": []}, {"body": "You have 2 cents?", "score": 2, "replies": []}, {"body": "Just wait for Tuesday PPI and Thursday CPI bargains my friend!!", "score": 2, "replies": []}, {"body": "The fuck are you smoking cuh", "score": 2, "replies": []}, {"body": "Mannnn.... STFU", "score": 2, "replies": []}, {"body": "SHUT", "score": 2, "replies": []}, {"body": "Puts on SPY, got it!", "score": 2, "replies": []}, {"body": "Fuck me my spy calls are cooked Monday", "score": 2, "replies": []}, {"body": "I’ve realized WSB is just a bunch of people that think they figured it out then get crushed. Good luck on your manic episode bro!", "score": 2, "replies": []}, {"body": "Yaaa this post was a waste of time  ![img](emote|t5_2th52|31226)", "score": 2, "replies": []}, {"body": "Your 2 cents is only worth 1 cent - inflation", "score": 2, "replies": []}, {"body": "That's not even worth one cent", "score": 2, "replies": []}, {"body": "Dumbest post ever.", "score": 2, "replies": []}, {"body": "The what", "score": 2, "replies": []}, {"body": "It’s all in riddles 🚀", "score": 2, "replies": []}, {"body": "Still don’t understand your perception of “what the fuck happened” but glad you got to eat at Wendy’s. I heard the baconater is a hell of a sandwich.", "score": 2, "replies": []}, {"body": "Dudes edible just hit him", "score": 2, "replies": []}, {"body": "What about her week? Is that bloody?", "score": 3, "replies": []}, {"body": "Fuck SPY, buy Intel!", "score": 3, "replies": [{"body": "With nana's money", "score": 9, "replies": [{"body": "I knew someone would do it 😂😂😂", "score": 7, "replies": [{"body": "https://preview.redd.it/7xzgyk1o0yhd1.jpeg?width=281&format=pjpg&auto=webp&s=6d63a94ff248aff19f108c5b9e7d68a063c38925", "score": 8, "replies": []}]}]}]}, {"body": "So funny cuz I’m on a flight to Detroit rn", "score": 2, "replies": [{"body": "Welcome home", "score": 1, "replies": []}]}, {"body": "Wife’s boyfriends eviction notice, he’s taking the house", "score": 2, "replies": []}, {"body": "Who’s week?", "score": 1, "replies": []}, {"body": "His leaked in your mouth. 👄", "score": 1, "replies": []}, {"body": " Nothing happened. Markets are and have mostly been manipulated for geopolitical reasons. There is no rhyme or reason to it.", "score": 1, "replies": []}, {"body": "Bro said 600 eoy right after a crash", "score": 1, "replies": []}, {"body": "The WallBro is strong with this one. Especially loved the close telling everyone he’s going to Venezuela. Never heard anyone brag about that before.", "score": 1, "replies": []}, {"body": "Wait till next week! \n\n(I have no idea what might happen.)", "score": 1, "replies": []}, {"body": "Idiot", "score": 1, "replies": []}, {"body": "I believe we will get Spy to 600 this year question is, when? I don’t think buying call options till December will be worth the cost", "score": 1, "replies": []}, {"body": "Bwhahaha...It was money moving in and out...in out...in and out.", "score": 1, "replies": []}, {"body": "I had a put it paid", "score": 1, "replies": []}, {"body": "https://preview.redd.it/ns0oombedxhd1.jpeg?width=279&format=pjpg&auto=webp&s=ea616c59993bcead718e8b360b277e0f9ee730ae", "score": 1, "replies": []}, {"body": "Dude is mad his 2 cents are now 1 cents", "score": 1, "replies": []}, {"body": "Thanks for the laugh. Needed it.", "score": 1, "replies": []}, {"body": "I missed the Apple and arm dip 😢", "score": 1, "replies": []}, {"body": "Maybe next time you can trade better and get yourself some Applebees.", "score": 1, "replies": []}, {"body": "Gotta build that wall higher", "score": 1, "replies": []}, {"body": "This guy obviously knows his shit, u better listen", "score": 1, "replies": []}, {"body": "Alright I got a lot of up votes for making a post like this on a bear post. But god damn, pls don't take advice from people that have absolutely nothing at risk.", "score": 1, "replies": []}, {"body": "What happened was another bailout by the government for riches.", "score": 1, "replies": []}, {"body": "Nobody cares", "score": 1, "replies": []}, {"body": "All of you worms talking about the “dip”. Why didn’t you throw your money in the market last year and let it ride🤣🤣 way more gain that way.", "score": 1, "replies": []}, {"body": "Must be nice, I couldn’t buy anything because I couldn’t get into my accounts. Schwab, fidelity", "score": 1, "replies": []}, {"body": "I like turtles", "score": 1, "replies": []}, {"body": "This is it. This is the absolute useless shit post the market needs to actually justify going into a recession now, just to show OP how dumb he is", "score": 1, "replies": []}, {"body": "K", "score": 1, "replies": []}, {"body": "Hey OP… sending your wife home now. Clean up on aisle your whore wife", "score": 1, "replies": []}, {"body": "Impressive gains bro. About the Wendy's trying to calculate exactly how much you made from this insanely good trade, we're 3 kids meals involved at a discounted rate? It's not just some buffet salad bar bullshit you're hyping the shit out of here right?", "score": 1, "replies": []}, {"body": "I used all my dry powder to buy 3 more shares of NVDA  on friday..  The other $350K?  Fully invested  pretty much always ,, Weak hands get shaken outta the tree.. Long LEAPS and stock  NVDA GOOG MPC UBER CAVA AMZN COF XOM AMGN TOST", "score": 1, "replies": []}, {"body": "Your top post is claiming that Netflix is going down and now is up 30% since then??? Now your post today says “trust me”?? Yikes dude.", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "This guy says it best: [https://www.youtube.com/watch?v=ovX5G0O5ZvA](https://www.youtube.com/watch?v=ovX5G0O5ZvA)", "score": 1, "replies": []}, {"body": "He said spy going up another 20% in 3 months basically pretty stupid take but hey put ur money where ya mouth is if you believe", "score": 1, "replies": []}, {"body": "The dude forgot to mention how to profit from my collection of underpants that NomeTrader69 convinced me to take a long position in.", "score": 1, "replies": []}, {"body": "Yup. This is yhe dumbest post I've seen in a while, which is pretty impressive, really.", "score": 1, "replies": []}, {"body": "Sometimes living on the west coast sucks. \n\nMissed out getting my Monday morning beauty sleep…", "score": 1, "replies": []}, {"body": "OP saying SPY 600 and here I am with 2 shares of VOO for low and slow dividend gains.", "score": 1, "replies": []}, {"body": "this is a great summary love it", "score": 1, "replies": []}, {"body": "I was all set to go shopping expecting Tuesday to offer even better prices. Nope.", "score": 1, "replies": []}, {"body": "Which plane company are you using to try to Venezuela?", "score": 1, "replies": []}, {"body": "Your 2 cents in Venezuela is now worth 0.035 cents", "score": 1, "replies": []}, {"body": "Is it possible to change the status quo from Wendy’s to Taco Bell?  They got nacho fries and free daily butt purges.", "score": 1, "replies": []}, {"body": "Absolute recession indicator is what this post is", "score": 1, "replies": []}, {"body": "Bullshit there ain't no spy 600 by EOY", "score": 1, "replies": []}, {"body": "Now get ready for the double dip", "score": 1, "replies": []}, {"body": "Shoulda bought LLY you’d be partying by now.", "score": 1, "replies": []}, {"body": "At no point in this rambling did you try to explain wtf actually happened", "score": 1, "replies": []}, {"body": "VOO @ $470 was insane.", "score": 1, "replies": []}, {"body": "bro i overdrew my ck. acct. just to buy the dip. you’re/were good!", "score": 1, "replies": []}, {"body": "Musical chair. There are now only three chairs left and 10 people circling. When the music stops the impact is more pronounced.", "score": 1, "replies": []}, {"body": "It amazing how many bull thesis people could come up with to make themselves feel better, but it was gonna happen eventually", "score": 1, "replies": []}, {"body": "\"My gains could buy a nice dinner at Wendy’s for a family of 5, which I absolutely fucking did and told them about the trades that got us here\"\n\nAny sane person that doesnt have an attention span and gratification delay tolerance of only 5 seconds, can only be perma doomer bear in this world", "score": 1, "replies": []}, {"body": "\"you had to money left to buy the dip? lmao fuck you dumb peasants I've made boatloads\"", "score": 1, "replies": []}, {"body": "This was more like your 0 cents on calls", "score": 1, "replies": []}, {"body": "What in the cocaine bear are you talking about?", "score": 1, "replies": []}, {"body": "I’m not here for his week. I’m here for HER week.", "score": 1, "replies": []}, {"body": "Please tell me this is satire .. dude Wendy's?", "score": 1, "replies": []}, {"body": "Wendys Dinner for 5, shit man you are living the dream. My gainz can only buy Olive Garden dinner for 5.", "score": 1, "replies": []}, {"body": "OP is drunk and in a funk.", "score": 1, "replies": []}, {"body": "Can you please repeat, regard?\n\nI was distracted buying my 69th lambo.", "score": 1, "replies": []}, {"body": "Wendy's fries are not bad I hear", "score": 1, "replies": []}, {"body": "all I know is OP got 5 figure gains cuz thats how much taking your family out to Wendys is now", "score": 1, "replies": []}, {"body": "If JPow doesn't budge, he's the fucking man.", "score": 1, "replies": []}, {"body": "Man, been waiting all week for this critical analysis. On pins and needles checking Reddit every day.", "score": 1, "replies": []}, {"body": "You forgot that SeptemBEAR is upon us", "score": 1, "replies": []}, {"body": "Nice dinner at Wendy’s 😂", "score": 1, "replies": []}, {"body": "Too long. Did not read. ![img](emote|t5_2th52|4276)", "score": 1, "replies": []}, {"body": "I don’t even trade but I read this sub religiously because you guys are fucking hilarious!", "score": 1, "replies": []}, {"body": "your thoughts are obscured by clouds", "score": 1, "replies": []}, {"body": "It was just yen and the possibility of Japan rising interest rates, it scared American investors who use yen as a currency play as it was cheap and on Monday when they announced a potential rate hike they began selling positions in an effort to avoid getting margin called.", "score": 1, "replies": []}, {"body": "Forget retirement. JPOW sucked me off good last week. My dream came true already.", "score": 1, "replies": []}, {"body": "Sounds like someone just wants to talk for the sake of talking.", "score": 1, "replies": []}, {"body": "If you fuck up the title than the whole post is regard moot", "score": 1, "replies": []}, {"body": "2 cents could've been 4 if you just bought NVDL instead bud. ![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "This is the type of WSB content I tune in for. Let's fucking go", "score": 1, "replies": []}, {"body": "What a Karen 🤣", "score": 1, "replies": []}, {"body": "He gets us.", "score": 0, "replies": []}, {"body": "He is taking all his dollars to a communist country, overthrowing the government, is a great idea 🤓☝️", "score": 0, "replies": []}, {"body": "Why is it always HIS week and never HER week?", "score": 0, "replies": []}, {"body": "Don't forget to set aside some winning for taxes", "score": 0, "replies": []}, {"body": "https://preview.redd.it/djxsuyewyxhd1.jpeg?width=1170&format=pjpg&auto=webp&s=7b5ba9566729edf7147def446cda98fe7442ff58\n\nFuck it, we ball", "score": 0, "replies": [{"body": "My friend , if this is whatever money to you keep it riding . If it’s not and your solely relying on these profits pull out now", "score": 1, "replies": [{"body": "10% in 5 months seems reasonable, compared to my other regarded plays. But I have stop losses just in case shit goes south 👍", "score": 1, "replies": []}]}]}, {"body": "Monday had the biggest and easiest trading opportunities ever….\n\n\nAnd people were worried…", "score": 0, "replies": []}, {"body": "Japan raised their interest rates which caused some sort of effect on our market because people were middle Manning through their market or something like that. \n\nAlso  Just my person opinion I think a lot of people had margin calls so they had to sell a lot of stuff to pay their margin call and that dropped the market a little bit more as well. Just my opinion on that though. \n\nMassive discounts so I bought 8k SOXL, 3k TQQQ, 1500kTECL, 1kFNGU, 1kTNA, 1k FAS, 1kDPST, 1kBULZ \nAll of those are bullish 3x leverage ETFs. \n\nLoaded up on 2K on MARA, 2k on CLEANSPARK, $1500 to $1000 on each of the following...CDLX(Had a huge drop I'm up 25% already) BitFarms, CHEWY, ROKU, WOLF, PAYPAL   BLOCK, TWILO , UNITY, PATH, FIVVR, CLOVER, SNAP, LIFT, REDFIN,  BTC.US MINIT TRUST. REDFIN, OPEN, UPSTART .\n\n6k on UNI\n2K More on Neo Coin 5k total\n1500 EACH on BITCASH, ZCASH, EOS, MOTA , SHIB, XLM, DOGE, LITECOIN, COMP. \nNO BITCOIN OR ETHEREUM \n\nI had 500 shares left of carvana that i bought at $4ish to $6ish that I sold a bunch of to fund the buying spree. \n\nMaking money making money 💰", "score": -1, "replies": []}]}
{"title": "SHORT TSLA", "selftext": "[removed]", "id": "1ep475v", "created_utc": 1723326220.0, "score": 223, "upvote_ratio": 0.78, "num_comments": 176, "comments": [{"body": "\"SHORT TSLA\"\n\n>doesn't short TSLA\n\nban", "score": 1, "replies": []}, {"body": "Thinking of shorting tsla?? Where have you been last 3 weeks", "score": 353, "replies": [{"body": "make that 2 years", "score": 92, "replies": [{"body": "Make that 4 years. Shorting TSLA is like that scene in Old School when the pledgees drop cinderblocks attached to their dicks from the rooftop. You may think the chord is long enough but someones gonna drop that shit in a manhole and get their shit dropped all the way to the bottom.", "score": 158, "replies": [{"body": "This analogy is poetry. *Muah*", "score": 36, "replies": []}, {"body": "Except for everyone who shorted the last 2 years before a few months ago haha", "score": 4, "replies": []}]}]}, {"body": "I tried logic with TSLA, it doesn’t work ![img](emote|t5_2th52|4260)", "score": 30, "replies": []}, {"body": "I had a brief moment on Monday when my TSLA puts were up 80%, but I missed it. I ended up selling them at a 33% loss. On the bright side, I'd bought those puts a month ago and at some point they were down 90%.", "score": 4, "replies": []}, {"body": "Please short Tesla. I like free money.", "score": 17, "replies": [{"body": "Yup, Elon loves pissing all over the shorts", "score": 3, "replies": [{"body": "You would think at some point they would learn.", "score": 2, "replies": []}]}, {"body": "How do you make money of anyone else shorting a stock? (Noob question prolly)", "score": 2, "replies": []}]}]}, {"body": "Do you have any money left to short Tesla after blowing grandma's $700k on Intel?", "score": 202, "replies": [{"body": "Grandpa stepped up and he doubled down to cover his loss. ", "score": 45, "replies": [{"body": "🤣🤣🤣🤣", "score": 4, "replies": []}]}, {"body": "The more important question is: “Is your Manager at Wendy’s going to give you the day off from making Baconators and blowing Dudes behind the dumpster so you can short Tesla on Monday and get your ass handed to you into a position where you no longer work at Wendy’s, you just hang out behind the dumpsters and give out free blowies?”", "score": 9, "replies": []}]}, {"body": "It's a meme stock economic reality has nothing to do with it. Just look at memes if you want to know when to short", "score": 119, "replies": [{"body": "What happens to the market cap of Tesla if Elon were to unexpectedly die? (or cryogenically freeze himself, or move to Mars, or something else weird but permanent)", "score": 14, "replies": [{"body": "If Elon died it would probably go up. \n\nHe’s become a dead weight on the 5 companies he cosplays CEO for.\n\nThere’s a lot of very talented engineers who Musk has repelled away from the hiring pools for SpaceX and Tesla.", "score": 48, "replies": [{"body": "Lol to CEO cosplaying!", "score": 13, "replies": []}, {"body": "You sound like you have shorted Tesla in the past.", "score": 8, "replies": []}, {"body": "Go for more Trump and politics shit and TSLA could go 🚀🚀🚀 yeah sure  hahaha,\n\nElon is now more like a disgusting opportunist than a entrepreneur, especially comparing with Jensen", "score": 2, "replies": []}, {"body": "In other words, there would be no one to tell you \"go. Fuck. Your. Self\"", "score": 1, "replies": []}, {"body": "I bet you loved Elon before you realized he wasn’t going to be an echo chamber parrot", "score": 0, "replies": [{"body": "Yes, I think most people fell for the “Tony Stark” mythos he cultivated early on, and thought he was an actual engineering genius, which is what attracted so many geniuses to Tesla and SpaceX.\n\nBut then he popped that bubble by revealing himself to be an unhinged lunatic - the first sign was when he went on a tirade against the Thailand cave diver rescuer by calling him a “pedo” for not using Elon’s stupid submarine idea.\n\nAfter that it went downhill from there. We began to see he knows fuck all about engineering or programming, and after he bought Twitter he just sat on his ass shitposting wingnut conspiracies and political bullshit all day long.\n\nWe all began to see how little work a CEO does when one guy can be part-time CEO of 5 different billion dollar companies while spending all day on Twitter.", "score": 1, "replies": []}, {"body": "How come he parrots Tucker Carlson?", "score": 0, "replies": []}]}, {"body": "This is why exit liquidity is a thing", "score": 0, "replies": []}]}, {"body": "Clearly we can trust Elon's AI clone to run it. Price will moon!", "score": 2, "replies": []}, {"body": "0", "score": 1, "replies": []}, {"body": "Only the good die young.", "score": 1, "replies": [{"body": "I’m not rooting for it in the least bit. Just genuinely curious. I can’t think of many examples of a massive market cap company that was so dependent on its deity of a CEO.", "score": 1, "replies": []}]}]}, {"body": "True, but on a longer scale, buy short ETF could be a good one. Memes don't last long.![img](emote|t5_2th52|27189)", "score": 1, "replies": [{"body": "they lasted the last 5 years so yeah.", "score": 1, "replies": []}]}]}, {"body": "As soon as someone says to short Tesla, all Elon has to do is tweet about the moon being conquered by transgender Muslims then his stans buy buy buy and you money is gone dude.", "score": 57, "replies": [{"body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -1, "replies": []}]}, {"body": "Toyotas EVs have been an insult so far, so I wouldn’t bet on them", "score": 51, "replies": [{"body": "Because EVs are a joke", "score": -80, "replies": [{"body": "Womp womp.", "score": 26, "replies": []}]}]}, {"body": "🤣🤣🤣 Do Not Short Tesla. Hear it from me. I shorted $20k worth like 3 weeks out and got completely fried. Diamond handed those bitches to zero & you will too. It’s on sale right now I just bought shares.", "score": 41, "replies": [{"body": ">to zero\n\nYou shorted with leverage??\n\nYou belong here regard", "score": 6, "replies": [{"body": "Wouldn't it be negative if leveraged, my fellow regard.\n\n\nI think they mean that they held put options to expiration.", "score": 8, "replies": []}, {"body": "I’m giving good advice to buy Tesla and I’ve learned from my mistakes MR RUB IT IN and it’s called a put option Mr Big Brain", "score": 2, "replies": []}, {"body": "you don’t have XXXX in your trading account but you still here tryna disgrace a fair warning to this kind lad.", "score": 1, "replies": [{"body": "Read the room Inspector Clouseau. Regard is treated as a badge of honor here.\n\nThis is our mascot:\n\nhttps://preview.redd.it/tvbdlz2e2yhd1.jpeg?width=1313&format=pjpg&auto=webp&s=7d8582d061f01caddff1cb6d601660e7928e6d2b\n\nThe dudes just razzin' you.\n\nOr the dude's an ignorant ass. It's the internet. They're all over the place.", "score": 3, "replies": []}]}, {"body": "You know that when you short,  you must do so with margin, not leverage.  Bro got a margin call after tsla went up 20%.   Pretty normal stuff.", "score": 1, "replies": []}]}, {"body": "Tried puts on $TSLA, it was possibly my most well-researched, and in my opinion, fundamentally sound move… **SPOILER** Elon Musk bent me over his knee spanked me, sent me for a time out, and took away my allowance.\n\nTLDR: Don’t use logic with TSLA ![img](emote|t5_2th52|4260)![img](emote|t5_2th52|4267)", "score": 2, "replies": []}]}, {"body": "I thought Robotaxis were going to be unveiled on 8/8 or was that just a nod to some Nazi friends of Elmo?", "score": 14, "replies": [{"body": "That tweet came out while the stock was trading at -33% ytd and around 52wk low. It was a desperate attempt by the chief pumper to prevent new lows.", "score": 14, "replies": [{"body": "And 10 represents the letter jay. \n\"Just joshing\"\nA hat tip towards the massive value people place in his bullshit, and that he knows this. \n\nMusks attempts to keeps this up until June when he has to leave the board, per the recent shareholder vote. \n\nHe'll try to keep the stock price up until then. Afterwards he'll dip out, cash out and run out. \n\nAt least that's my new perspective. \n\nThe question is, CAN he keep it up that much longer?", "score": 2, "replies": []}]}, {"body": "It’s on 10/10 now.", "score": 1, "replies": []}, {"body": "Well, if 8/8 represents the eighth letter, \"Heil H\" then what could 10/10 or JJ mean...\n\n--->Just Joking!", "score": 1, "replies": []}]}, {"body": "Tesla is by and far the most illogical stock of the MAG 7. I wouldn’t try to out think it", "score": 26, "replies": []}, {"body": "How much did Bill Microsoft pay you for this?", "score": 21, "replies": []}, {"body": "I've made more 💰 on Tesla calls than anything. From 190-240 was quite a ride. Sold it all at 240 and ready to start again.", "score": 15, "replies": [{"body": "What strike and time frame did you use?", "score": 1, "replies": []}]}, {"body": "Yea toyota just rolled out a new engine that was supposed to be the bees knees but ended up dealing with catastrophic engine failures.. sure, 9 minute charges.. i bet.", "score": 40, "replies": [{"body": "From what I've heard the engine failures aren't really from the design, but from the manufacturer not cleaning after production.", "score": 14, "replies": [{"body": "They are still dealing with the cost of replacing like 100,000 engines.", "score": 2, "replies": []}]}, {"body": "It'll be done when it ignites", "score": 6, "replies": []}, {"body": "\"We can charge our car in 9 minutes\"\n\n\"What's it running on\"\n\n\"AA battery\"\n\n\"...\"", "score": 4, "replies": []}]}, {"body": "You're gonna make Elon get back out his short shorts. \n\nOn a more serious note, even if Toyota could charge in 9 minutes where TF are they gonna plug them into?", "score": 3, "replies": []}, {"body": "Don’t do it! He (bad daddy musk) will cook your puts with a single tweet.\n\nThis guy cheats to prop up Tesla’s stock price. He did it with fake rumors about a Saudi buy out when the shorts almost killed his company. He did it with the Robotaxi announcement recently. He tied his star to the coattails of the first crypto bull run by tweeting about Doge and bitcoin.\n\nHe’s a fucking con. His brand is badly damaged. It’s over valued. The cyber truck is uglier than the Homer and half as functional. It still hasn’t fallen as much as it should have the first time earnings came in weak this year. Yes, by all measures it should go down, but bet against it at your own risk.", "score": 12, "replies": [{"body": "It's more nuanced than that.\n\nMusk is a rogue when it comes to hyping up the stock price.\n\nBUT - he's dead serious about the engineering.  Tesla cars are the best electric cars.  SpaceX rockets are the best rockets.\n\nIf he was truly a con, Tesla doors would pop off, and SpaceX astronauts would be stranded in space for months.\n\nThe real f-ing con is ...\n\nBoeing.", "score": 4, "replies": []}, {"body": "Or he’s just really smart with marketing?  Have you ever considered that most people dream their personal brand could create such an outsized marketing influence", "score": 1, "replies": [{"body": "Well, op's name is \"evilgenius\". Based on his comment I would suppose that his name is meant to indicate that he is knowledgable of, an expert on, evil geniuses.", "score": 2, "replies": []}, {"body": "People call Elon a cuck, but I think his fans and shareholders are the real cucks. If this offends you, you are one or more of these things, but definitely a cuck according to my rudimentary understanding of algebra. Now that I’ve got that out of the way, yeah sure, he’s savy and was good at marketing until he alienated his customer base by becoming a conservative. Oh shit…he’s a Trump cuck?  I think I get it now.", "score": 0, "replies": [{"body": "Where in my comment did it imply I was offended or at all invested or cared about Elon?  I was just stating an observation that anyone with 2 eyes and 3 brain cells could gather.  \n\nElon haters are just as obsessed with him as his fanboys.  Go touch some grass losers", "score": 0, "replies": [{"body": "People tend to be pretty obsessed with powerful people who throw their support behind fascist political cults.", "score": 0, "replies": []}]}]}, {"body": "Is marketing the word for announcing products that haven’t been designed or tested?", "score": 0, "replies": []}]}, {"body": "The S African autist made CC safe to use online, made EVs sorta cool, privatized space, made a world wide internet network, helped paralyzed people have a better life, etc.. And then there is you. Someone who thinks he’s a bad person because your sunny-July-day-in-Nunavut-IQ doesn’t life the idea of free speech \n\nPipe down boy ", "score": -6, "replies": [{"body": "\"The S African autist bought the companies that made CC safe...\" fixed it for you.", "score": 5, "replies": [{"body": "This is just hearsay because I don’t care enough to google it, but I’m pretty sure he bought Telsa too and rebranded it as his own brainchild. Like I said, I don’t care, someone will refute me if I’m wrong though.", "score": 2, "replies": []}]}, {"body": "Sunny-July-day-in-Nunavut-IQ must be stolen material. Anyone clever enough to put that line together would have constructed that sentence without flaw.", "score": 2, "replies": []}]}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 3 weeks ago\n**Total Comments** | 6 | **Previous Best DD** | \n**Account Age** | 7 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 3, "replies": []}, {"body": "Worst take.  Musks fans are dumb and will prop up any turd.  While I believe Tesla is heavily over valued, only a fool would bet against Elon's cult. ", "score": 3, "replies": []}, {"body": "Tesla roadster drops soon. I have a strong feeling. Not evidence to back it. Do what you Will lol. I've been seeing it promoted more lately through YouTube,fb algos", "score": 3, "replies": []}, {"body": "Many have tried and failed", "score": 3, "replies": []}, {"body": "But Toyota always be lyin", "score": 13, "replies": [{"body": "I mean Tesla too lol, been pushing back roboTaxis for years", "score": 22, "replies": [{"body": "Lying works for tesla though because elon musk fans are genuinely gullible regards.", "score": 16, "replies": []}, {"body": "Fsd is just around the corner at least /s", "score": 14, "replies": []}]}]}, {"body": "The only reason I don't do that is that this is a bull market. It is very risky to short a company during a bull market. If the market crashes, Tesla is my go-to choice", "score": 4, "replies": []}, {"body": "And what happens when space X saves the astronauts stuck in orbit until 2025?", "score": 12, "replies": [{"body": "This is the kind of logic I would expect from Tesla bulls.", "score": 22, "replies": []}, {"body": "SpaceX is its own company. Private... its stock doesn't trade.", "score": 16, "replies": [{"body": "Tesla has nothing to do with tesla and everything to do with Elon.\n\nIf SpaceX does something good it will push up tesla.", "score": 2, "replies": []}, {"body": "Yeah, it’s private for now. Elon can get people to invest in Tesla by telling them the best way to invest in Space X is to buy Tesla…and that if and when it goes public Tesla shareholders will get the first rights to buy shares. 😒", "score": 2, "replies": [{"body": "Oh yeah. Fair point. I remember that massive pile of illegal bullshit that dumped on everyone's heads. \n\nThe hyper bulls tilted their heads up and opened their mouths, the way domestic chickens drown themselves when it rains.", "score": 3, "replies": []}, {"body": "Indeed.  He's already said that.  \n\n[https://x.com/elonmusk/status/1799621606744162548](https://x.com/elonmusk/status/1799621606744162548)", "score": 2, "replies": []}]}]}, {"body": "Elon fanboy moment. Spacex isn’t Tesla", "score": 7, "replies": []}]}, {"body": "Anybody thinking about shorting Toyota? All this here battery talk came out of nowhere and sounds like Nixon’s secret plan. But maybe if I read something…", "score": 2, "replies": []}, {"body": "So CALL's Monday morning! Thanks!", "score": 2, "replies": [{"body": "Yeah that sounds right. \n\nThis turd floats another year. \n\nProbably 350 by December.", "score": 2, "replies": []}]}, {"body": "You mean 9 min hydrogen refill ? Toyota doesn’t like electric.", "score": 2, "replies": []}, {"body": "Shorting stock is a dangerous game. Why don’t you just buy some Toyota if you believe whatever you’re talking about?", "score": 2, "replies": []}, {"body": "Don't bet against cults.", "score": 3, "replies": [{"body": "Don't they all eventually drink tainted koolaide?", "score": 3, "replies": []}]}, {"body": "TSLA is empty promises and mediocre cars.\n\n\nOptimus is their best option and they're working on CyberStuck and robotaxi... ", "score": 8, "replies": [{"body": "If Optimus is Tesla’s best option then the company is doomed.", "score": 8, "replies": []}, {"body": "Tesla Energy is their best option (and that is a long shot). Optimus is complete trash. No regular person is going to blow $20k+ on a humanoid robot that is awkward and slow. No company is going to blow that on Optimus when they can get specialized machinery (which they already have) that does the task faster and better. Plus if you wanted such a thing, the H1 robot from China is far farther along than Optimus", "score": 2, "replies": []}, {"body": "Don't forget about their powerwalls and big grid batteries. They recently started selling them in Europe.", "score": 3, "replies": [{"body": "Massive competition in grid storage solutions from the players who control the battery supply (CATL, BYD, Panasonic, LG, SK, Samsung). Tesla has a small minority of market share. It will be a race to the bottom on profit margins at maturity just like EVs.", "score": 3, "replies": [{"body": "I think LFP is the move for grid and home batteries. I don't want the risk of a fire ", "score": 1, "replies": [{"body": "They’re all making LFP batteries at this point.", "score": 1, "replies": []}]}]}]}]}, {"body": "Yes", "score": 1, "replies": []}, {"body": "Idk anything about robotaxi but my grandma was in phoenix last month and got picked up in a Jaguar driverless Uber so…. All in.", "score": 1, "replies": []}, {"body": "This has been the play for the last month ![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "Not sure about Toyota but the bobbies 🇬🇧are after Elon and they always get their man", "score": 1, "replies": []}, {"body": "Depends on your time horizon but all in all now is the time to go long. \n\nAccumulation is mostly done under $200 range.", "score": 1, "replies": []}, {"body": "Robots…ai…robotaxis…china…infinity", "score": 1, "replies": []}, {"body": "No.", "score": 1, "replies": []}, {"body": "Yes, short tesla is the way to go. This nonsense company is going down. But it is tricky to time it", "score": 1, "replies": []}, {"body": "Thinking of shorting tsla?? Where have you been the last 12 years?", "score": 1, "replies": []}, {"body": "Short until Orange Man gets in office.", "score": 1, "replies": []}, {"body": "I got burned by that \"ROBOTAXI EVENT SOON\" bullshit when I shorted a month or two ago. I want to short again, but just feels dumb. The whole fool me once thing...", "score": 1, "replies": []}, {"body": "Toyota is the play on MY mind.", "score": 1, "replies": []}, {"body": "Toyota has been anouncing the super fast charging /1000miles battery for years and nothing", "score": 1, "replies": []}, {"body": "Its easy to charge in 9 min when your battery only has 50 miles of range", "score": 1, "replies": []}, {"body": "Toyota has claimed to have a solid state 9 minute, 1000 mile EV battery since 2013.\n\nAnd again in 2016. And 2018. And 2020. And 2023.\n\nIf you believed them, you are exactly the kind of person they would like to sell a hydrogen FCEV to for 75k while you wait for \"battery technology to catch up\"", "score": 1, "replies": []}, {"body": "You short TSLA, you get fucked.", "score": 1, "replies": []}, {"body": "Tesla is a meme. Don’t short memes. You may be right in the long run, but not liquid enough to prove it.\n\nElectric cars are commodities at this point. They’re appliances. Imagine valuing whirlpool like a tech growth stock", "score": 1, "replies": []}, {"body": "Toyota with a 9 minute charge? Wasn't this an announcement a few years ago that will probably never happen? Or might happen 10 years from now?", "score": 1, "replies": []}, {"body": "Remember “funding secured”? That’s all it took to ruin many shorts", "score": 1, "replies": []}, {"body": "OP you always do the opposite of what the comments tell you. WSB rule no. 1!!", "score": 1, "replies": []}, {"body": "Too late.", "score": 1, "replies": []}, {"body": "Already priced in", "score": 1, "replies": []}, {"body": "I wasn’t until you posted. What were you thinking?", "score": 1, "replies": []}, {"body": "Have you heard of tslz?", "score": 1, "replies": []}, {"body": "Short only after TSLA gets a temporary dead cat bounce. Elon giving DTrump some bj on Monday so TSLA price may pump a bit. After a while u can short.", "score": 1, "replies": []}, {"body": "> with Toyota announcing 9 minute charging capability\n\nRofl. You know how many times Toyota has announced new EV tech? Boy that cried wolf at this point. Fucking irrelevant. What matters is if they mass produce it affordably. They don't have any EVs that people want. Toyota is so far behind on EVs it's not even funny. \n\n>  and the fall out of the robotaxi stuff with Uber\n\nWtf are you talking about? Uber doesn't have shit. FSD improvements in each version are pretty staggering and fast. Their camera only, AI driven solution is working. They will be robotaxi ready in several cities by mid year next year at this rate. Shorting Tesla is dumb. Period.", "score": 1, "replies": []}, {"body": "Been holding TSDD since before earnings and see it as one of the best flight to safety trades out there and over 50% up already.\n\nI've done a deep thought analysis studying the possible different outcomes in my minds eye and have drawn the following hypotheses: (thoughts or conclusions for the neandathels among us)\n\nSituation a) overall market doesn't tank:\n\nTesla tanks\n\nSituation b) overall market does tank:\n\nTesla tanks hard\n\nSituation c) market chops sideways for a bit\n\nTesla tanks", "score": 1, "replies": []}, {"body": "There will be a good opportunity soon. I wouldn't recommend trying it if you're new though.", "score": 1, "replies": []}, {"body": "TSLA will be a good short at some point. Good luck timing it, though.", "score": 1, "replies": []}, {"body": "Forget about any realities and news. Just trade TSLA's range-bound.", "score": 1, "replies": []}, {"body": "No one else worried that Tesla will have a law suit on their hands for promising self driving cars for 10 years and not being able to deliver. Like the older models are just not powerful enough to actually do self driving", "score": 1, "replies": []}, {"body": "I think about shorting tsla every day", "score": 1, "replies": []}, {"body": "Yeah, short Tesla right before their big announcement in October. And October is known as good for stocks.\nThis would be well regarded.", "score": 1, "replies": []}, {"body": "Tesla could announce that they've stopped building cars and are now focussing on huffing paint and the stock would still go up 10%\n\ndont do it", "score": 1, "replies": []}, {"body": "Already in", "score": 1, "replies": []}, {"body": "It’s a overhyped car company and growth is becoming dog. Short it to hell", "score": 1, "replies": [{"body": "how about u eat my ASS\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}]}, {"body": "Tesla's stock price is verbally inflated by Elon. Everybody knows that.\n\nI have not read about Toyotas 9 minute charging capability. Can you share the source?  But yeah, if that is indeed possible, it is a game changer", "score": 1, "replies": []}, {"body": "TSLA was a pretty good short the last few weeks, as it fell from ~$251 to ~$200. And, for long stretches before that as it fell to sub- $140 before its next-to-last earnings release.\n\nHeck, it could still be a decent short. But as long as it's around the current $200 milestone/potential support level and stuck closely between its 200 SMA ~$203 (50 also close above) to the upside and 100 SMA ~$191 to the downside, it's a tough trade in either direction.\n\nTSLA can be an especially tough stock to trade. \"New to trading\" and \"thinking of shorting Tesla\" aren't the most promising joint scenarios. Additionally, shorting TSLA based on a \"random\" individual news -- no matter how much importance you may want to attach to it -- could be a mixed bag. Negative news related to Tesla (or Elon Musk, specifically) comes out all the time (It's arguably the most 'discussed' company), whether the stock continues to trend up or down.", "score": 1, "replies": []}, {"body": "Tesla equals innovation. Betting against it needs careful consideration beyond short-term news. Ensure your strategy accommodates TSLA's potential volatility and diversify if you’re unsure.", "score": 1, "replies": []}, {"body": "People only buy Toyotas because they have to ", "score": 1, "replies": [{"body": "Toyota is the Nissan of Hondas.", "score": 6, "replies": []}, {"body": "True, most other automakers have you spending more in maintenance by 100k miles than what the car is worth", "score": 3, "replies": []}, {"body": "Same can be said for Teslas. People were only buying them because they were the only option in town. Now there are tons of options and Tesla sales are down YoY while BEV sales are up.", "score": 1, "replies": []}, {"body": "I buy Lexus because they are more dependable than BMW and Mercedes.", "score": 1, "replies": []}]}, {"body": "Haven’t you learned to not bet against Tesla? Musk is gonna make you eat your words", "score": 0, "replies": [{"body": "alternatively musk goes to jail if kamala wins", "score": -4, "replies": []}]}, {"body": "short and wait", "score": 1, "replies": []}, {"body": "\"You will be obliterated\"  - Musk", "score": 1, "replies": []}, {"body": "Don't listen to Toyota they are lying. They will be bankrupt as they are too late to the game and too much invested in motors and transmission business. Also they messed around too long with hydrogen useless too expensive to fuel. They might have a prototype for this battery that charges in 9 minutes but like Elon says, prototypes are easy but scaling and mass production is extremely hard like eating glass staring into the abyss. Good luck.", "score": 1, "replies": []}, {"body": "Tesla is literally hundreds of millions of miles worth of data ahead of every car manufacturer on the planet. I’m not saying scalping them in this situation is a bad idea I’m just saying keep your guard up because a lot of people me included have bet money the fact that they will get there first whenever it happens to come. Just keep that in mind when trying to get a quick scalp in. Kinda like betting against the mouse. Bad idea.", "score": 1, "replies": []}, {"body": "I won't be shorting but will be loading up when the stock price goes down. In Musk we trust.", "score": -2, "replies": []}, {"body": "They’ve been calling out Tesla killers since Tesla was founded. I don’t think they’re going anywhere but up", "score": 0, "replies": [{"body": "BEV sales grew YoY but Tesla sales declined YoY…", "score": 0, "replies": []}]}, {"body": "elmo is a fucking clown. the shareholders are dumber than the bacteria in my shit. flush that crap.", "score": 0, "replies": [{"body": "The Elon bears on Reddit make zero sense. All of you spew this nonsensical rhetoric about how dumb, or what a loser Musk is. He didn't get to be the richest man in the history of the world because he's dumb, inept or incompetent.  It has to be based on jealousy,  he has something that none of you (or the rest of us) will ever have.", "score": 1, "replies": [{"body": "To be fair, Crassus is the richest man in history. \n\nHe simply created the first for-profit fire department in Rome, set fires and negotiated in quarters of a person's wealth to put the fire out. \n\nCrooked and genius are not necessarily equivalent. Crassus just had the balls to do what no everyone else thought was wicked, or at least too obvious a crime to go unpunished. \n\nThen he became a third of the triumvirate. \n\nOf course he did eventually have molten gold poured down his throat to quench his thirst for money.", "score": 2, "replies": [{"body": "You could also maybe say Solomon, but there's really no way to say for sure since it was 2000 years ago and records are incomplete for both. Let's just say that Musk is the richest man in the history of the world that can be verified.", "score": 1, "replies": []}]}]}]}, {"body": "As much of a cunt Musk is on a personal level (can’t believe I used to like the guy) I don’t think it’s a wise idea to bet against the business man. He has single handedly advanced the human species by a 100 years so yeah, I would not recommend betting against this fucker", "score": -5, "replies": [{"body": "Not him. The people he exploits.", "score": 2, "replies": [{"body": "Without him there is nothing so yes it’s him", "score": 2, "replies": []}]}]}, {"body": "If your worried about tesla and you are bullish on Toyota I'd be worried for your investment.", "score": 0, "replies": []}, {"body": "Idk anything about robotaxi but my grandma was in phoenix last month and got picked up in a Jaguar driverless Uber so…. All in.", "score": 0, "replies": []}, {"body": "You think it’s looking bleak….\n\nYou know nothing, and or you are an imbecile.   Everyone on Reddit is now dumber because of your moronic run on sentence, idiotic idea of shorting what will be the biggest company in the world.   You wanna be a peasant forever?\n\nNow someone do that remind me thing.", "score": 0, "replies": []}, {"body": "Please never ever short Tesla, Tesla is people, it is us, i can hope Tesla goes over the roof and Elon happy forever, Tesla and Elon is the national treasure for the world", "score": 0, "replies": []}, {"body": "Musk haters suck. Go ahead and downvote you ungrateful swine", "score": -5, "replies": []}, {"body": "Never bet against papa musk. Tesla does 500x more ish than cars 😆\n\n\nIt's like saying short wendys cause their straws are a lil flimsy", "score": -1, "replies": []}]}
