{"title": "Thoughts on ARKX", "selftext": "Since it’s debut about 2 months ago, Cathy’s latest fund has performed with little fanfare. It’s actually been surprising stable, consistently trading between $19 - $21 for the duration of its existence. It’s also had remarkably low volume (less than 200,000 per day). I know there was some grumbling about the perceived randomness of its holdings (NFLX, Deere, etc), and the fact that they’ve recently sold off all of their SPCE holdings, but what’s your opinion on the funds long term viability?", "id": "nt292h", "created_utc": 1622918162.0, "score": 42, "upvote_ratio": 0.89, "num_comments": 67, "comments": [{"body": "Welcome to r/stocks!\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nPlease direct all simple questions towards the stickied Daily Discussion and Quarterly Rate My Portfolio threads (sort by Hot, they're at the top).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "You’re better off just identifying individual companies in that industry using DD to invest in right now, there are so few at this point that it’s pretty inconceivable to be able to fill an ETF with  only space industry options and expect it to do much.", "score": 30, "replies": [{"body": "It's like trying to invest in electric cars in the 90s or computers in the 40s. The companies that will dominate are not even around yet.", "score": 21, "replies": [{"body": "Good analogy.", "score": 7, "replies": []}]}]}, {"body": "ARKX is a 5-10 year hold at minimum", "score": 12, "replies": []}, {"body": "Probably the worst of her ETFs. I think ARKF, ARKG and ARKK in that order is the way to go.", "score": 20, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Not saying space won’t be big…just saying that her other etfs are better buys at this point", "score": 2, "replies": []}]}]}, {"body": "I think ARKX is truly a stock you need to hold for like 5-15years if you want to get amazing profits. I don't see ARKX doing anything amazing for the next couple years, but when the space industry takes off and it's the new gold rush I could see her style of investing leading to record breaking profits. This is all assuming the space industry takes off and becomes the most profitable thing in the world. I mean imagine how much money at some point we could make getting rare minerals or a million other insane ideas that will come to play. \n\n At some point space will be the next big investment. Who know's maybe we catch one of those UFO ships CNN and the Navy posted videos of, reverse engineer their technology and a whole new world of technology opens up for us. Lol okay the last part might be a bit far fetched but we are getting closer to actually exploring space and profiting off of it.", "score": 10, "replies": [{"body": "How do you profit off space?", "score": 3, "replies": [{"body": "Your imagination is the only limit, we could literally harvest the power of an entire sun all the way to creating a black hole big enough to theoretically go through a worm hole. You never know when an insane leap in technology could happen and space is the frontier. There has got to be things in space worth more than we can imagine, or that will transform entire industries with new metals or elements.", "score": 2, "replies": []}, {"body": "YouTube has tons of space documentaries with  computer generated examples of wrangling meteors and literally dragging them to holding areas to be mined. These meteors hold unimaginable quantities of rare minerals. There are also gasses in outer space that don't exist on earth (Helium2). And the best part is the shit is super expensive so it doesn't fuck up the price system already in place on earth. Gold will still be expensive because mining in outer space will be expensive.", "score": 1, "replies": [{"body": "Could this lead to hooker's in space?", "score": 1, "replies": []}, {"body": "That's stuff we'll be doing after we are dead", "score": 1, "replies": [{"body": "That is what my grandpa said about the Computer. Time marches on and gives no fucks what we want.", "score": 1, "replies": []}]}]}, {"body": "its almost kinda like real-estate. except if mines goes up it stays,", "score": 1, "replies": [{"body": "Huh?", "score": 1, "replies": []}]}, {"body": "By mining asteroids for gold and other rare elements is one thing I heard, but not sure how cost effective unless you found a chunk of gold the size of a house", "score": 1, "replies": [{"body": "And the craft had the ability to bring it back.\n\nThe only profitability I can see is government funding", "score": 1, "replies": []}]}]}]}, {"body": "Look at the chart for ARKW since inception, then look at the graph for ARKK since inception.\n\nNo use grumbling about current performance when these ETFs are designed to be ahead of the curve. Is space exploration relevant now? No. Just like her innovation, and next gen internet fund, you have to give it time for the industry to ramp up.", "score": 16, "replies": [{"body": "Who cares what a chart shows since inception???\n\nThere are many, many. many new investors since the beginning of this year...\n\ninnovation ramping up??? these funds have significant investments in older, stable companies...\n\nHow is COIN working out?", "score": -10, "replies": []}]}, {"body": "I'm continuing to hold some shares of ARKK. I think she gets a worse rep than she deserves and more flack for the underperforming. When you buy an ETF with the stated strategy X and then X doesn't perform well the ETF isn't going to perform well. Just because it's actively traded doesn't mean that it's a mutual fund. Holding an ETF that underperforms the market is unpleasant, holding an ETF that is no longer giving exposure to the equities it's supposed to is unacceptable and I suspect would be illegal. \n\nSo regardless of what you think of her stock picking I think a lot of the criticism is kind of unfair. She made changes at the margins to add \"cash-like\" stocks that made the ETFs more stable liquid in preparation for a correction in the market, which is a marginal change but it's about all she can do while still keeping true to what the ETF does. \n\nIn Irrational Exuberance there's a little chunk where the author writes about how some of the really good money managers were outperforming the market prior to the dotcom bubble and then crashed harder than others. The trend was that a bunch of the managers continued to outperform the market after the dotcom bubble, and long-term did fine, but their funds had huge inflows in the years following a hot streak and big outflows following the correction. So the managers can regularly beat the market, but the average investors can still under-perform by not being patient.", "score": 5, "replies": []}, {"body": "I'm holding several ARK* ETFs. All have been in the red for months. Possibly a time to buy but it seems more like Cathie's winning streak has ended.", "score": 19, "replies": [{"body": "Agreed. I have a stop loss on my ARKK shares.", "score": 9, "replies": []}, {"body": "How well has disruptive growth been performing since the top in february? The answer is generally worst than the ARK funds.\n\n\nSPCE 55$ -> 31$\n\n\n\nPLTR 38$ -> 24$\n\n\nWKHS 40$ -> 13$\n\n\nThe list goes on.\n\n\nOnce speculative growth does good again, i have no doubt ARK will be doing well again.", "score": 20, "replies": []}, {"body": "I never believed in certain companies and then watched them skyrocket after I got out or never get in. If you like her funds for the same reasons you did when you first bought, imo you buy more. I'm not a fan of hers but I'm wrong all the time", "score": 3, "replies": [{"body": "A lot of us feel that we're wrong all the time then a day comes when everything goes right so we keep going. My point of view is that every loss is a lesson on what not to do in the future.", "score": 2, "replies": [{"body": "I agree but sometimes losses are nothing more than a lack of patience, for me at least. That's what I'm always trying to avoid", "score": 3, "replies": []}]}]}, {"body": "What no patience looks like", "score": 6, "replies": [{"body": "Holding for about a year now.", "score": 4, "replies": [{"body": "Then you’ve been absolutely killing it and it has been a shit few months. Tech took a big hit, let’s not overreact and start calling cathie a WSB ape.", "score": 6, "replies": [{"body": "They never said that and people should always be willing to re-evaluate and look for better opportunties on the market. Even if one were to still believe in Cathy's picks, it could easily be argued that they've had a huge run up and the ROI for the coming years might be lower compared to other industries.", "score": 2, "replies": []}]}]}]}, {"body": "She'll probably be in the green again soon enough but over time she'll underperform. She always do, like most others. Look at her previous ETFs and their performance, it's well known she likes to start high risk/disruptive ETFs and usually get a decent honeymoon period. Eventually she'll fail, get desperate and double down on bad beds sending her further into red.\n\n\n\nOnce this happens she'll quit and start a new \"disruptive ETF\" and promise the world once again. She's done it many, many times...usually all it takes is a few red/underperforming months and she'll bail. Taking her sweet sweet cash and leaving everyone else holding the bags. But don't trust me, look up her \"work history\" and realize it's a repeating pattern. Once she hits a red streak she's eyeing the exit while telling everyone else to hold", "score": 3, "replies": []}, {"body": "Tech is tired out.  ARK is tech.  Cathy is ARK.  Therefore, Cathy is tired out.  \n\nThe profits were taken.  The sector was rotated out, so it will be in malaise for awhile.  I made a little here and there since February, but from the volumes and flat prices - it's apparent this is a sector in paralysis.", "score": 2, "replies": [{"body": "They rotate as you say. When it rotates back I'll sell out and move on.", "score": 1, "replies": [{"body": "Yup.", "score": 1, "replies": []}]}]}]}, {"body": "0.75% fees mate", "score": 7, "replies": []}, {"body": "I have a little ARKX but I think it is a longer-term investment than the 5 years people have mentioned in conjunction with other ARK ETF's. If there are other shorter-term investments available right now, it might make sense not to tie up funds up in ARKX at the moment but to keep an eye on it. \n\nIt looks like the current US administration's funding proposals are positive towards NASA budget ([https://www.space.com/biden-nasa-2022-budget-request-science-artemis](https://www.space.com/biden-nasa-2022-budget-request-science-artemis)) and that could be a boost for contracting companies if the proposals pass, but there are so many financial burdens closer to home right now like pandemic recovery.", "score": 2, "replies": []}, {"body": "What the hell is Netflix do in a space etf.\n\nThat’s all you need to know.", "score": 3, "replies": [{"body": "Satellite internet will make subscription services like Netflix available to many more people. You could have found this out in five seconds with a Google search.", "score": 19, "replies": [{"body": "So a innovative disruptive tech that can utilized in a space ETF, is Netflix being available to more people?\n\n\nYou could have logically thought about this without google in about 5 seconds.", "score": -9, "replies": [{"body": "You are the one who posed the question in the first place. You could have “thought logically” or done the Google search, and yet you didn’t.", "score": 16, "replies": []}, {"body": "> You could have logically thought about this without google in about 5 seconds.\n\nDid you?", "score": 8, "replies": []}]}]}, {"body": "Netflix made  Space Force", "score": 4, "replies": []}, {"body": "People need a way to entertain themselves when they're in space because there's nothing to do up there. You've obviously never been to space.", "score": 4, "replies": []}, {"body": "If you read the \"Fund Description and Objective\" of ARKK, then you'll see any company in VT can be included in ARKK. Because everyone benefits \"from technologically enabled products and/or services that occur beyond the surface of the earth\".", "score": 1, "replies": []}]}, {"body": "Some of the stocks in the etfs are q.interesting. If ure aginst certain stocks inside, then pick some of the stocks that are inside that u would invest in. I personally did that with Opendoor. Not telling u to invest in opendoor but u could do something like that", "score": 2, "replies": []}, {"body": "Lets just say all of my ark investments have TANKED these past few months. I unloaded most of them at a loss because I have little faith they’re coming back any time soon.", "score": 1, "replies": [{"body": "You don’t think Tesla or Square is coming back any time soon?", "score": 2, "replies": []}, {"body": "Well played.", "score": 1, "replies": []}]}, {"body": "Arkx fees are crazy Cathy is crazy so too negatives equal a 🚀 if you 💎 🙌 to the 🌝\n\nAlso had to double check 6% is the 3D printing etf so she can double dip the fees", "score": -3, "replies": [{"body": "This isn't how it works at all, there's no double fees for arkx.", "score": 10, "replies": [{"body": "I think the poster means that ARK is buying their own ETF PRNT for ARKX.......\n\nunclear if they are charging themselves, but 2X 0.75 is not 6.....", "score": 0, "replies": []}, {"body": "Interesting can you show me the link that says that?", "score": -7, "replies": [{"body": "You made the claim, you show proof first. I haven't heard about that either for the record.", "score": 9, "replies": [{"body": "She even said so herself on CNBC or whatever news network a few weeks after it IPO that there's no double dipping in fees", "score": 10, "replies": []}]}, {"body": "Best I can do is tell you I've heard Cathie herself respond to this concern in a YouTube video somewhere.", "score": 6, "replies": [{"body": "Thanks I did find it too I’m relieved and feel guilty for my claim", "score": -1, "replies": [{"body": "It's smart to notice and be concerned about so don't feel too guilty.", "score": 3, "replies": []}]}]}]}]}, {"body": "You are an ignorant fool. And I thought this sub banned these stupid emojis.", "score": 4, "replies": [{"body": "I though I was on the wsb sub I didn’t think the smart subs talked about ark lottery tickets", "score": -2, "replies": []}]}]}, {"body": "Personally not fond of Cathy, but idk about anyone else", "score": -2, "replies": []}, {"body": "Bought calls cuz ufo report ur welcome", "score": 1, "replies": []}, {"body": "I'm usually a fan of ARK and I'm invested in one of their other ETFs, but the ARKX ETF is a joke to me.\n\nIt is supposed to be a space ETF, but you have to really stretch to find a way that many of the holdings relate to space. I mean, Netflix is one of the holdings... ridiculous. And now they don't even hold the most obvious publicly traded play on space. It should just be called the \"ARK Random Stuff\" ETF.", "score": 1, "replies": []}, {"body": "I really like their 6% KTOS holding.  Keeping ARKX and also did a buy on KTOS directly.", "score": 1, "replies": []}]}
