{"title": "What is TWNK?", "selftext": "# Enter TWNK; Hostess Brands\n\nYou're looking at a company that is profitable, has glowing ratings, and is growing. \n\n*not to mention a \\~17% Short Interest, but we'll get to that later...*\n\nLet's take a deep look.\n\n# A Brief Financial Checkup\n\n[EPS, revenue, and cashflow +Projections compared to the industry average](https://preview.redd.it/65s21baltj471.png?width=1564&format=png&auto=webp&s=34622d076187915fa11aafc04579aa0c16d40001)\n\nAs pictured above, TWNK's growth has not only beaten the industry average, but absolutely left it in the dust. The only areas that lag behind the industry are future projections, but even those look good.\n\nHere are the highlights:\n\n* 12-Trailing-Month revenue Growth: More than double industry average.\n* Cash Flow Growth (5yr): +200%\n* EPS compared to same Quarter Last Year: **+850%** (this growth isn't just because of the pandemic, as in industry average is just +24.16%)\n\n# Profit \n\n[TWNK margins vs industry margins](https://preview.redd.it/7ah86nipwj471.png?width=1572&format=png&auto=webp&s=d7f6a76157ec762a4cebec3a195ddd03dfd218e9)\n\nHere is something to note: TWNK's margins are some of the strongest in the industry, mostly placing in the 80th percentile or better. TWINK about matches or beats the industry average across the board; just take a look for yourself!\n\n# Let's Look At Earnings\n\n&#x200B;\n\n[TWNK EPS & Share price since Q2 2019 \\(ADJUSTED EPS\\)](https://preview.redd.it/5hubjmdnyj471.png?width=1528&format=png&auto=webp&s=1281c2d46a32a1925d71b19a31b847399a1a6cbb)\n\n TWNK has been beating estimates for years, not to mention their incredible performance in 2020 and continued strength in 2021. Even though the pandemic they have never underperformed and bounced back like a champ. \n\n# TWNK the stock\n\n&#x200B;\n\n[TWNK share price since June 2019](https://preview.redd.it/9naupxk60k471.png?width=1292&format=png&auto=webp&s=e37b800816d3391c1dc70db76508dcc1a4e2b1fe)\n\nThe Stock price has ripped since the pandemic crash, backed by consistently meeting or beating earnings expectations. Even after this incredible run, TWNK is **still undervalued.** \n\n# Valuation\n\n&#x200B;\n\n[TWNK valuation ratios](https://preview.redd.it/hguzxhqy0k471.png?width=1568&format=png&auto=webp&s=d7bb08f66d038bb8a49c27e2691b7edffc5feeb0)\n\n* Price to Book: **1.30 (This will even have the fella's at** r/ValueInvesting **salivating for some TWNK)**\n* Price to Sales (12mo trailing): **1.98**\n* Price to Earnings (12mo trailing): **23.74** \n\nAt first glance these numbers don't look all too impressive. Many of these are close to the industry average (Excluding P/B). But for a company that has much better growth & margins than the industry average, not to mention incredible share-price momentum, I'm surprised these ratios aren't higher.\n\n# Smart Money Says...\n\n&#x200B;\n\n[Some analyst ratings of TWNK](https://preview.redd.it/ri4mypx53k471.png?width=1576&format=png&auto=webp&s=bcd70cdc9b9dfa12440371f2710caf32f467c714)\n\nHere's a snapshot of what \"smart\" money thinks of TWNK. Ratings show neutral or better, with every rating posted within the past 30 days. (except for Morgan Stanley, I think old-man Stanley dropped his glasses).  \n\n# Options Demand \n\n&#x200B;\n\n[Highest call options flow of the day \\(vs. average call volume\\)](https://preview.redd.it/6pf568057k471.png?width=1736&format=png&auto=webp&s=29d6550531e39bd06a865e2db0fa0e8a43491aee)\n\nHere's a simple yet interesting chart; top Call options volume vs avg. call volume. Compared to it's daily average, TWNK call volume has **exploded** today (June 10th) vs its average call volume. Someone (or many people), is loading up on call options, with TWNK finishing 9th on the list (just ahead of WISH and a little behind WEN), I only wonder why.... \n\n&#x200B;\n\n# Twinkie's Shorts\n\n[Short interest as posted on NASDAQ.com](https://preview.redd.it/icd1gdhh4k471.png?width=1272&format=png&auto=webp&s=dbe2e4740119b5fc38cecd7cab0a12445b72b7e7)\n\nEven with juicy fundamentals and share-price growth, shorts are loading up on TWNK. Short interest as of May 28th is 17% [NASDAQ reports](https://www.nasdaq.com/market-activity/stocks/twnk/short-interest) , and [shown on FinViz](https://finviz.com/quote.ashx?t=TWNK&ty=c&p=d&b=1) High short interest is usually never a good sign for a stock. However, TWNK is a strong company and strong stock, so I'm not sure why there is 17% float short.\n\n# TL;DR\n\nTWNK (Hostess Brands) is a great company and has amazing momentum. Call options and short volume his been rising, but only one of these have a good reason to do so.\n\n**Positions:** I currently have 5 shares of TWNK \n\n*I'm not a financial advisor and this is not financial advice. Do your own research.*", "id": "nx6wgp", "created_utc": 1623384413.0, "score": 69, "upvote_ratio": 0.78, "num_comments": 67, "comments": [{"body": "[deleted]", "score": 25, "replies": [{"body": "At this point the porn context is more appealing than diabetes.", "score": 5, "replies": []}]}, {"body": "I’ll tap dat TWNK ass.", "score": 12, "replies": [{"body": "Yes daddy, please.", "score": 7, "replies": [{"body": "Uhhh, I believe it’s “baker” as in “I’d bake that Twinkie”", "score": 5, "replies": []}]}, {"body": "You want to see me make a twinke disappear? Ask me, I dare you.", "score": 3, "replies": [{"body": "show me what you can do with my TWNK", "score": 1, "replies": []}]}]}, {"body": "And, their product never expires (not factual) and is rumored to be able to survive global thermonuclear war (again, not factual) and can be frozen, battered, and deep fried into something amazing (this is true).\n\nThey are one of the highest shorted stocks right now and are on my list to purchase this month.", "score": 9, "replies": [{"body": "Noooooo. They killed Bill Murraaayyyyy", "score": 6, "replies": [{"body": "When did TWNK do that?", "score": 1, "replies": [{"body": "Well actually emma stone did...", "score": 2, "replies": []}]}]}, {"body": "But are twinkies on your *grocery purchase list*?", "score": 4, "replies": [{"body": "Lol, gawd no. \nThere's a whole generation of boomers dealing with diabeetus because of Hostess products, lol. \n\nBut that fried Twinkie? Hell yeah.", "score": 5, "replies": []}]}]}, {"body": "Here for the twink jokes", "score": 10, "replies": [{"body": "Hey guys let’s keep these comments $CLNE 😏🚀", "score": 6, "replies": []}, {"body": "Who doesn’t love cream-filled pastry with silly name?", "score": 3, "replies": [{"body": "Mmm. Never seen a pastry on pornhub.", "score": 5, "replies": [{"body": "Shudders...it’s in the “how the fuck did I get here” section of the hub...", "score": 4, "replies": [{"body": "you know exactly how you got there", "score": 2, "replies": []}]}, {"body": "Lol", "score": 3, "replies": []}, {"body": "search up TWNK (twink). you in for a treat", "score": 1, "replies": [{"body": "twice a day", "score": 2, "replies": []}]}]}]}]}, {"body": "Are these fuckers shorting Twinkie and SusieQ, and snowballs! These fucks have no morals!!! We almost lost Twinkie once and did lose most of the hostess stores. Another child hood favorite place of mine. I dunno know about anyone else but this is beyond blasphemous!!!! 🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬", "score": 8, "replies": []}, {"body": "It's crazy how much call option exploded on June 10th after a few TWNK posts on reddit and honestly not that much traction relative to other big meme names. Points to how easy this could squeeze if there is traction. \n\nAlso, my guess behind the high short interest is just big money betting against unhealthy foods, possibly because of ESG concerns (ESG is all the rage these days).", "score": 7, "replies": []}, {"body": "Sounds good. What do you think about price target?", "score": 6, "replies": [{"body": "Looking at their graphs the gains are fairly consistent. If you bought right now, no way you’d be bagholding", "score": 5, "replies": [{"body": "Lol they are at about a all time high, hold his bags for him he’ll thank you later", "score": 3, "replies": []}]}]}, {"body": "you do all this work foro only owning 5 shares? dafaq?", "score": 12, "replies": [{"body": "I did DD, not hyping", "score": 12, "replies": [{"body": "I respect the passion and caution. Thanks man. 😊 \n\nI'd trust you to fingerblast my rectal cavity more than any retarded ape here.", "score": 7, "replies": []}, {"body": "fair enough.", "score": 6, "replies": []}]}]}, {"body": "Sounds gay im in", "score": 4, "replies": [{"body": "said like a true TWNK", "score": 1, "replies": []}]}, {"body": "does twnk stand for twinkie?", "score": 6, "replies": []}, {"body": "Never short twinkies🥺", "score": 4, "replies": [{"body": "Exactly! You know what they say: “3 twinkies a day keeps your cravings at bay!”", "score": 3, "replies": []}]}, {"body": "🧐🤔 that's definitely not a twink", "score": 4, "replies": [{"body": "Instructions unclear: going to store to buy Twinkies", "score": 6, "replies": []}]}, {"body": "This guy did some DD on TWNK. HA!", "score": 4, "replies": [{"body": "Wouldn’t ya think!", "score": 3, "replies": []}]}, {"body": "TWNK 4 🌈🐻", "score": 4, "replies": []}, {"body": "I’m a huge supporter of hostess, I’m always buying cupcakes Twinkies and ding dongs", "score": 4, "replies": []}, {"body": "TLDR: 🌈🐻 are after the Twinks?", "score": 4, "replies": []}, {"body": "So TWNK is the opposite of a bear?", "score": 3, "replies": []}, {"body": "I agree! I’m in", "score": 5, "replies": []}, {"body": "I love Twinkies!", "score": 3, "replies": []}, {"body": "Calls have been treating me well!", "score": 4, "replies": []}, {"body": "TWNKs have something to do with gay bears I think 🤔", "score": 4, "replies": []}, {"body": "This will be a funny meme stock! Spread the word", "score": 3, "replies": []}, {"body": "Nothing new compared to the other DDs for TWNK, 5 shares ... mods need to start looking at the usernames, ticker symbols, and posting timelines to find patterns", "score": 2, "replies": [{"body": "What are you implying?", "score": 3, "replies": []}, {"body": "can't have any tickers aside from CLNE, BB, CLOV, AMC, and GME get any views", "score": 0, "replies": []}]}, {"body": "The reason why it's shorted so much is because American diets and eating habits are changing. \n\nHave you considered most Americans in 2020 were staying at home smoking weed all day and eating junk food. Trust me I gained 20 pounds this year.\n\nLast years growth was from the pandemic. \n\nAlso, short interest is not a good investment idea. Lmao. That's a red flag 10/10 times. Stop trying to find another GME.\n\nMy target price: 14usd", "score": 0, "replies": [{"body": "You didn't DD, never trust a man who doesn't like a Twinkie. They entered the zero calorie snacks market.", "score": 1, "replies": [{"body": "I'm short it because I'm warring buffet", "score": 1, "replies": [{"body": "Sentiment isn't even high yet, I like getting high on things before other people get high on them, and then sell them when everyone is baked on the couch and full of Twinkies. Don't be a dingdong!", "score": 1, "replies": [{"body": "I like making money. Enjoy your meme bags", "score": 1, "replies": []}]}]}]}]}, {"body": "GME", "score": 0, "replies": []}, {"body": "No diabeto no no", "score": 1, "replies": []}]}
{"title": "Simple Note on Why CLF is at the Perfect Cross Section of Where the Market Wants to Invest", "selftext": "1. It is a meme stock that has barely even memed so far\n2. 6% GDP Growth + international demand - starving for steel.\n3. It is a value stock - market fleeing to value\n4. It is a commodity stock - market wants an inflation hedge\n5. It is a steel stock: we can't just ramp up new steel plants willy nilly.\n6. They are going to make a bucket of money - for sure this year and a strong market for at least 3-5 years in my opinion.\n7. They are protected by steel tariffs that aren't going away.\n8. China wants to go green, and reducing their dirty cheap steel production is one of the best ways for them to accomplish this\n9. They are a PRIMARY PRODUCER of steel which is vital to our national interests. They aren't just melting scrap.\n10. They are FULLY INTEGRATED producing all of their own Iron for their steel mills. They even have a cutting hedge HBI plant (produces things that other steel makers need and for themselves. super high value)\n11. Their CEO is a fucking badass who hates shorts: [https://www.youtube.com/watch?v=kcagi2icXaU](https://www.youtube.com/watch?v=kcagi2icXaU)\n12. The stock is undervalued because they have only had ONE QUARTER as a newly combined entity. Institutions will wait for things to get proven out before they fully invest. They bought AK Steel and Mittal Steel's U.S. operations in 2020 - amazing timing. #1 steel producer in the USA. Edit: This will also give them more negotiating power.\n13. I am comfortable holding shares for 10 years. I don't care if it doesn't rip. If the stock Memes it is merely a bonus for me and faster time to value. I see this as very limited downside and massive upside.\n14. Edit BONUS: NEGOTIATING POWER AS COMBINED ENTITY: From Q1 Earnings Call: \"Another thing is that the real competition for the more sophisticated grades of steel that AK Steel, and Cleveland-Cliffs owned AK Steel for alone for almost a year. The only real competition was AM USA. So now we own both. So the automotive clients, they have already realized that. And they are no longer negotiating with a beggar. They negotiate with the supplier that treats them with a lot of respect and demands respect in retrospect, so we are doing great. \" - LG\n15. Edit BONUS 2: Auto chip shortage seems to be easing. This will help CLF. Their massive profits will also trail a bit as contracts get renegotiated. In other words Q1 was just an appetizer.\n16. Edit BONUS 3: You can sleep at night knowing that this is a real and profitable company and not the usual shit meme stock with zero revenue or massive losses.\n\nThank you. I know there is a lot more detailed DD. But this post is about discussion and pulling together some interesting factors that might not be together.", "id": "nxlllt", "created_utc": 1623432920.0, "score": 209, "upvote_ratio": 0.84, "num_comments": 63, "comments": [{"body": "CLF ran up 10% + in a day, and analysts ARE INCREASING PRICE TARGET?! BULLISH\n\nCLF held it's ground while meme stocks dropped 15%+ in a day? BULLISH\n\nCLF to the moon 🚀🚀🚀", "score": 53, "replies": [{"body": "I thought I recognized this comment", "score": 21, "replies": []}, {"body": "I hold $TX and $CLF. What I like about $TX is that they have little debt and a price to book ratio of 1", "score": 8, "replies": []}]}, {"body": "Nice job.  CLF is also the world leader in clean steel manufacturing.  One of their sites is the most advanced in the world in terms of clean tech in the mining industry.\n\nGreat company!", "score": 40, "replies": [{"body": "Steel gang goes brrrrrrrrrrrrr 🙈🚀🙌💎", "score": 10, "replies": []}]}, {"body": "Nice list. you dropped there. You forgot the 11 forward PE in a cycle where value is expected to outperform growth. \n\nOn the downside: it's a Jim Cramer favourite.", "score": 24, "replies": [{"body": "I think the REAL forward P/E is more like 5 for 2021. Hey Jimmy also pumped NUE and it ripped. I made a lot of money there.", "score": 14, "replies": [{"body": "You are right, FinViz has it at 11. Zacks at 5.\n\nYou are preaching to choir, buppa. Been in CLF, X and MT for a hot minute. I'm a numbers guy.", "score": 13, "replies": [{"body": "The analysts have been wrong pretty much the whole time. They are starting to catch on now.", "score": 6, "replies": []}, {"body": "also PEG ratio for 2021 is estimated at 0.18 .", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Homeless cats are ivriwhere, b. Axe Jay.", "score": 2, "replies": []}]}]}]}, {"body": "Also debt is a concern. I might be biased, but I really do prefer $TX over $CLF for the simple reason that their balance sheet is bonkers and they have cumloads of assets. Also FCF is amazing. 🙈🙈🚀🐸🍦", "score": 1, "replies": []}, {"body": ">On the downside: it's a Jim Cramer favourite\n\nCramer wouldn't still be Cramer if he didn't give the plebs a win every now and then. that's how you keep 'em hooked for the next Wells Fargo pump.", "score": 1, "replies": []}]}, {"body": "Been holding for 8 YEARS AND I LOVE YALL!\n\nBought on every dip. TRUE BELIEVER OF THIS COMPANY! Legit he could go on and they are paying down debt. Infrastructure BILL!\n\n24,000 SHARES HERE DUMB APE, NOT MOVING! \n\nFEEL THE STEEL! BE THE STEEL! WE GOING TO MAKE THE SHORTS PAY!\n\nhttps://imgur.com/a/NocltUZ", "score": 19, "replies": [{"body": "Impressive man.", "score": 4, "replies": [{"body": "Great write up. And it’s all fuckin true", "score": 3, "replies": [{"body": "WSB Should mean WICKED. STEEL. BALLS.", "score": 2, "replies": []}]}]}, {"body": "FEEL THE STEEL! 🍆", "score": 3, "replies": [{"body": "WSB Should mean WICKED. STEEL. BALLS.", "score": 2, "replies": []}]}, {"body": "WSB Should mean WICKED. STEEL. BALLS.\n\nAnd you Sir Have WSB,,", "score": 1, "replies": []}]}, {"body": "Why are primary steel producers valued more than secondary?", "score": 11, "replies": [{"body": "It's not really a valuation thing. Its the fact that they are produce NEW steel and not melting scrap. We have plenty of scrap here and it isn't an issue. But in the end as a country we will want to have some of our own primary steel production.\n\nThere is some potential that higher grade scrap etc could start getting bid up and they won't have an issue there. NUE/STLD are vertically integrated EAF (Electric Arc Furnace) producers. They only melt scrap. It is lower margin. BTW they aren't dumb. They can change their scrap mixes. NUE does have several DRI plants to produce scrap substitutes.\n\nI am long CLF and STLD. STLD is like Nucor's little brother. Even higher margins but trades at a lower multiple. Their production is increasing by about 25% in the next year as the massive new state of the art mill in Sinton, TX ramps up. Note, there is some new steel plants coming online which is why insane 2021 prices wont persist into 2022. But the overall macro situation is strong and I believe that steel prices will remain strong.\n\nAlso - if crude oil production continues ramping up and I think it will that could eat up the rest of the surplus steel production.\n\nI made a lot of money in NUE options, got stopped out on a trailing stop.\n\nOnly in shares right now.", "score": 12, "replies": [{"body": "I was not talking about valuation in a financial sense. I was curious why the U.S as a country value primary steel produces more. Thank you for your detailed answer.", "score": 2, "replies": []}]}, {"body": "Because they are making the product that the secondary producers need to craft their product is my understanding", "score": 2, "replies": [{"body": "It just makes me feel good that we can produce own own steel with zero reliance on any other country or input commodities.", "score": 3, "replies": []}]}]}, {"body": "I'm heavily invested in $CLF and $STLC for a Canadian play. The big clanging nuts of my portfolio", "score": 10, "replies": []}, {"body": "I believe!!!", "score": 4, "replies": []}, {"body": "Whats more MEMEable then Merica steel $CLF $X", "score": 6, "replies": []}, {"body": "WSB Should mean WICKED. STEEL. BALLS.", "score": 3, "replies": []}, {"body": "Some things that make $CLF CEO Lourenco C. Goncalves (aka LG) stand apart from many other CEOs and why I like him so much:\n\n- knows his industry better than anyone on the planet\n\n- invests his personal money in the company\n\n- speaks openly and honestly and does not suffer fools\n\n- had the guts to remake a 174 year old company at a risky time which turned out to be exactly the right time\n\n- did it at an absolute bargain price\n\n- tells the truth about China\n\n- does not spend investor airtime on woke dogma\n\n- seems to have NO PROBLEM finding labor while others are whining\n\n- loves the USA and its workers and makes a point of saying it right into the camera every time he speaks...in his second language no less... when so many won't say it in their first!", "score": 3, "replies": []}, {"body": "I say this every time I see a CLF post. I think small to midcap American industrials including CLF are really going to take off because of infrastructure spending and general sentiment. A few examples that I've honed in on include Foster (FSTR), Graham Corp (GHM), Park Aerospace (PKE), Gulf Island Fabrication (GIFI), ATN International (ATNI), Capstone Green Energy (CGRN), Ceco Environmental (CECE), Consolidated Communications (CNSL), and Genie Energy (GNE).", "score": 2, "replies": []}, {"body": "Damn, that YouTube video just made me want to double my position on Monday, but I need more money haha.", "score": 2, "replies": []}, {"body": "also， clf also has dividend and buying and selling ratings is 3-0，\nAmeritrade rating is on ResearchTeam is Hold，CFRA is Five stars，\nMarket Edg is long term，\nThe street is Hold，\nFord equity researching is 2 out of 5☝️", "score": 3, "replies": [{"body": "Divvy got put on hold during pandemic. Imagine it gets reinstated at a time like this? Fuel on the fire.", "score": 6, "replies": [{"body": "I hold 7268 shares together to the moon😉🚀 7268 is a lucky number. When the stock clf price drops to 23, I will buy another 1000 because 8268 is a luckier number.\n\nMy broker told me about this is a very good stock long time ago，also I saw so many good things about it on YouTube or medi， and many years ago it worked  over $100 and also， clf also has dividend before the covid and buying and selling ratings is 3-0\nAmeritrade rating is on ResearchTeam is Hold，CFRA is Five stars，\nMarket Edg is long term，\nThe street is Hold，\nFord equity researching is 2 out of 5☝️ \nAnd I have studied energetics, I have also done an energy test, before I decided to buy, I tested the energy of this stock is very good, then I bought it😉 But please do your own research to make you own choice😁\nI also saw this onAmeritrade  yesterday on my position news👇：\n\n4:50p ET 6/10/2021-Zacks\n Cleveland-Cliffs (CLF) Stock Sinks As Market Gains: What You Should Know\n Mentioned: CLF\n In the latest trading session, Cleveland-Cliffs (CLF) closed at $22.96, marking a -1.12% move from the previous day. This change lagged the S&P 500's daily gain of 0.47%.\n\n Heading into today, shares of the mining company had gained 16.27% over the past month, outpacing the Basic Materials sector's loss of 2.29% and the S&P 500's loss of 0.12% in that time.\n\n CLF will be looking to display strength as it nears its next earnings release. On that day, CLF is projected to report earnings of $1.18 per share, which would represent year-over-year growth of 480.65%. Meanwhile, the Zacks Consensus Estimate for  revenue is projecting net sales of $4.75 billion, up 334.97% from the year-ago period.\n\n For the full year, our Zacks Consensus Estimates are projecting earnings of $4.45 per share and revenue of $18.09 billion, which would represent changes of +2517.65% and +237.83%, respectively, from the prior year.\n\n It is also important to note the recent changes to analyst estimates for CLF. These revisions help to show the ever-changing nature of near-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.\n\n Research indicates that these estimate revisions are directly correlated with near-term share price momentum. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model.\n\n The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. Over  the past month, the Zacks Consensus EPS estimate has moved 12.66% higher. CLF is currently sporting a Zacks Rank of #3 (Hold).\n\n Digging into valuation, CLF currently has a Forward P/E ratio of 5.22. For comparison, its industry has an average Forward P/E of 11.34, which means CLF is trading at a discount to the group.\n\n Also, we should mention that CLF has a PEG ratio of 0.19. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. The Mining-Miscellaneous industry currently had  an average PEG ratio of 2.13 as of yesterday's close.\n\n The Mining-Miscellaneous industry is part of the Basic Materials sector. This group has a Zacks Industry Rank of 175, putting it in the bottom 32% of all 250+ industries.\n\n The Zacks Industry Rank includes is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to  1.\n\n You can find more information on all of these metrics, and much more, on Zacks.com", "score": 1, "replies": []}, {"body": "Which is a good thing. Dividends are overrated. Too many companies bleed themselves dry trying to keep the div going.\n\nCome in with share buybacks when things are boomin. keep the div low. Much better way to return value to shareholders. Also, easier to turn off buybacks when there's a downturn.", "score": 1, "replies": []}]}, {"body": "They are going to clean up the balance sheet first and pay down debt. Indeed, no divy right now.", "score": 2, "replies": [{"body": "Sleep better after buying this stock 😹😹😹 because I don’t like gambling😤☝️", "score": 2, "replies": []}, {"body": "Sleep better after buying this stock 😹😹😹 because I don’t like gambling☝️😤😉", "score": 1, "replies": []}]}]}, {"body": "Someone convince me that this isn't the peak. I regret not getting into CLF weeks ago but I just can't shake the fear of getting stuck holding the bag. Are investors really still fleeing to value? Growth has been regaining leadership. Are investors still worried about inflation? The market is forward looking. Once big money decides the commodity cycle is over, the bull case for CLF as a company will be irrelevant. It will just plummet with the rest of the industry.", "score": 1, "replies": []}, {"body": "Lots of great points! I'm more of a traditional investor but love momentum. I've traded in steel stocks ($X, $NUE, $VALE, and $CLF) and made some great profits. It's a cyclical, so we have to be mindful of the industrial cycle's ebb and flow, but this is a sweet stock. And I like that CEO a lot! He just puts it out there plainly! Nonetheless, this is a more traditional industrial and there are many types of investors in play now, so I don't see this making a run like $GME (but I hope it does). Long and strong for $CLF.", "score": 1, "replies": [{"body": "Good point. Personally, I worry investing in commodities due to the cyclical nature of the industry. Where do you think we are in the cycle?", "score": 2, "replies": [{"body": "Because of the pandemic, I feel we are in the early stage of an industrial cycle. And once we have an infrastructure plan from congress, I suspect the cycle will really get going. A cycle like this can run for five, six, seven years. It's a big deal. I don't know the nuances of foreign steel being dumped into the U.S. but typically, an industrial cycle lifts all boats, so to speak.", "score": 2, "replies": []}]}]}, {"body": "I just want to know what analysts think of WSb moving in on $CLF.\n\nOne minute WSB is horny for a piss poorly run theater chain. The next they're horny for a steelmaker that's a legit comeback story.\n\nSay what you will, but it's not an easily predictable pattern.", "score": 1, "replies": []}, {"body": "Look, we all know the CEO going off on short sellers was all the DD 90% of us needed.", "score": 1, "replies": []}, {"body": "400 let’s go!", "score": 1, "replies": []}, {"body": "CLF should be making a lot of money with current steel prices, but is getting no credit from the market, yet...", "score": 1, "replies": [{"body": "I think we move sideways for another month or so. Once the market starts focusing on 2022 we rip.", "score": 2, "replies": [{"body": "I agree - hopefully the buyback of the preferred is the catalyst for the market to see the future possibilities for Cliffs.", "score": 2, "replies": []}]}]}]}
