{"title": "$FSLY", "selftext": "September 21 deadline to get a deal done, per Trump's terms. I like one of the big boys (MSFT, TWTR, etc) to make it happen. ByteDance has to force a deal given the US growth and download demographic. Upon news of a deal and then the deal itself, I like the stock to recover to pre-deadline highs of upwards of $120. September 25, $70c gives $82.50 breakeven.\n\nI like chances of this breaking through $100 swiftly.", "id": "i813fp", "created_utc": 1597183105.0, "score": 6, "upvote_ratio": 0.8, "num_comments": 12, "comments": [{"body": "I got $150c 12/18", "score": 3, "replies": []}, {"body": "Hello,\n\nIf you do some googling, you will see that bytedance has international investors - KKR, Sequoia, SoftBank, and others. \n\nYou think these big boys will let the deal die and lose out on their billions? \n\nI’ll bet Trump will get a heads up that the deal is done so his kids and cronies can pile into Msft or Twitter calls the night before the PR. Look for unusual options actions.", "score": 2, "replies": []}, {"body": "Hence the 400% run. But I’d bite on some long calls. I think it’s to crazy to own outright", "score": 1, "replies": []}, {"body": "Never said it was but Microsoft likely has a fastly equivalent in house. I doubt they pay for something they can do for their products. Fastly mainly provided security for tik toc video. Won’t be needed if Microsoft absorbs tik tok. Almost 60% of fastly sales are from a hand full of big companies who will eventually take it in house as opposed to paying them. There’s my DD", "score": 1, "replies": []}, {"body": "FSLY grew too fast, too quick.  I think they could bleed or trade sideways for a bit.", "score": 1, "replies": []}, {"body": "Cccp and trump meeting this week to discuss trade deal. Tiktok on the agenda", "score": 1, "replies": []}, {"body": "I’m in MSFT with or without tiktok there is no reason for a massive sell off.", "score": 0, "replies": []}, {"body": "How can it recover? If Tik tock banned they cannot do business with them. If msft buys them how does that help fsly ?", "score": 0, "replies": [{"body": "You should do some dd on azure and fastly before thinking that azure is a competitor.", "score": 2, "replies": []}, {"body": "Good point lol I was thinking that they would use Fastly for the same purposes as before. If Microsoft can provide their purpose though it doesn’t make sense.", "score": 1, "replies": [{"body": "I was just brainwashed. I had it from 35. Sold calls at 125 s for earnings. thinking it would stay up there but it tanked down to 90 straight. I got out at 87. Shoulda just sold into earnings after that run. The 30% run up and down mind fucked me on that stock now. Watched $30k go up in smoke", "score": 1, "replies": []}]}, {"body": "because i dont see how FSLY revenue wont recover if you give it a couple months, they have just added AMZN and SPOT as customer list and they added the most customers ever in last quarter since their IPO.", "score": 1, "replies": []}]}]}
{"title": "MAXR - Stonks Only Go Up", "selftext": "I will skip the part of the DD where OP calls you a bunch of names and tells you to listen up.\n\n**TLDR: $MAXR**\n\n$MAXR is a relatively recent product of some space related M&A activity. MDA (they made Canadarm for the Space Shuttle) bought DigitalGlobe (they take pictures of the earth and sell them to government, google, newspapers, etc) and it's subsidiaries and then rebranded itself as 'MAXAR Technologies'. Ironically, they just sold MDA to private equity for ~$750 mil and paid down some debt with it. They fully acquired a company they helped start in a joint venture with SAAB that creates a ton of useful information about the planet.\n\nTheir main business model is they make satellites and sell information produced from data that those satellites collect to all sorts of entities.\n\nThey just had a great earnings and are executing their plan to reduce debt. There is a S 3 E K I N G  4 L P H A article from '19 titled \".. connecting the dots...\" that is a decent read on MAXAR.\n\nYou'll notice stock price went to shit in '18 and '19. They had a lot of debt and they had their newest big bet satellite fail and it was thought that they would go brankrupt. They've righted the ship, pivoted to building LEO constellations and the next catalyst for share price will be any updates on WorldView Legion constellation.\n\nWhy you should jump in (not in any order):\n\n1) Space is now meme status. Space is the future. $MAXR is 100% space exposed. They aren't a diversified manufacturer of stuff like Boeing, NG or Raytheon.  \n2) \"Information is the new currency\" and these guys have and can get a ton of information about anywhere on the surface of the earth very quickly. They will be improving their information collection abilities in 2021 when they launch their new satellite constellation.   \n3) They have competitors but their competitors offerings aren't as great as theirs.  \n4) Float is 1.5% held by insiders. 94% held by institutions. That leaves just a few shares for us retail Robinhood traders to play with. It is a wild ride as institutions acquire and dump shares. 15% of the float is short (that was pre earnings).  \n5) Investor's concerns about debt are easing.  \n6) A very significant amount of their revenue comes from government / military. I believe that military spending will never decrease save for a radical change in government. China is escalating its military operations and non-China governments will all want information about what they are doing. This is just one example of more and more demand for precise almost real time information that MAXAR can deliver. US Gov't focused on GIS (new NGA facility) and that'll only increase demand for their products.  \n7) Any time something happens in the world, people will want satellite imagery of it whether that is for news articles or research or whatever. Most recently:\nhttps://www.cbsnews.com/news/mauritius-oil-spill-disaster-satellite-images/\nhttps://blog.maxar.com/open-data-program/2020/open-data-response-to-the-beirut-lebanon-explosion\nhttps://www.reuters.com/article/us-australia-bushfires/australia-begins-damage-assessment-amid-temporary-respite-from-bushfires-idUSKBN1Z30O1\n8) Stonks only go up.\n\nYes this post is kind of pumpy and dumpy.\n\nPositions: 800 shares (I am tired of losing money on options). 1/15/21 $25Cs are a decent play. You can also trade on momentum swings as it swings hard.\n\n**I am an idiot with a smooth brain and this is not financial advice. Sir, this is casino.** In before dadbot says \"Hi, an idiot with a smooth brain... I'm dad.\"", "id": "i7lgsu", "created_utc": 1597121651.0, "score": 12, "upvote_ratio": 1.0, "num_comments": 12, "comments": [{"body": "So this stock blew up in 18’-19’ because their satellite failed. \n\nAnd now in 20’ people should invest because they are launching a satellite?", "score": 5, "replies": [{"body": "A constellation (multiple) satellites with latest tech. The value isincreased 'refresh rate' and quality of imagery. Also now losing 1 out of multiple less expensive satellites isn't as bad as losing 1 out of 1 very expensive satellites", "score": 4, "replies": [{"body": "Well now I’m sold on constellation satellites.", "score": 2, "replies": []}]}]}, {"body": "Got in at $9.90 just a few months ago. Already way up.", "score": 2, "replies": []}, {"body": "Eyed this when it initially popped to $18 in June but never pulled the trigger. If it comes back to anywhere near $22 after this week's rise I'd probably look to enter.", "score": 2, "replies": [{"body": "like now?", "score": 1, "replies": []}]}, {"body": "You nailed the 1/15/21 $25. Hope you held the 800 shares.", "score": 2, "replies": [{"body": "Sold at 32 hoping to swing back in on a dip. Womp womp.", "score": 1, "replies": []}]}, {"body": "This is it. 1/15/21 420c.", "score": 1, "replies": [{"body": "420c and the company was founded in '69. Some solid numbers here.  I think it'll print", "score": 2, "replies": []}]}, {"body": "Hope you held that 1/15/21 $25C ! Haha", "score": 1, "replies": [{"body": "Sold at $32 was going to buy back in on a dip. Dip never happened and here we are. Womp womp.", "score": 1, "replies": []}]}]}
{"title": "The bull market rally is over", "selftext": "Well ladies and gentleman.....it was one heck of a ride!\n\nToday's action is showing FIERCE trend downwards, and for all you experienced and sophisticated folks out there, you all know what that means!\n\nThe sideways market is about to take over, if it hasn't already, and you all should be wise about how invested you want to be going forward. Personally, I see the early stages of a long-term bear market. But that's me! GLTA", "id": "i7shcj", "created_utc": 1597154949.0, "score": 0, "upvote_ratio": 0.12, "num_comments": 13, "comments": [{"body": "Oh noes! \n\nWait until the stimulus drops - new record highs.", "score": 7, "replies": []}, {"body": "🚨 Paper hands alert 🗞️✋✋", "score": 5, "replies": []}, {"body": "Can you give some explanation? I hope youre right but I dont want to make decisions off of hope. I cannot understand why this market has rallied every single day of August \"amid stimulus hopes.\" Its driving me nuts. We were expecting the stimulus all summer so it should have been priced in already. But I could see it rallying for a day or two when we did get it. Instead, the benefits expired and negotiations have stalled past multiple deadlines. No pullback at all. Trump's executive orders are dubious but even if they work its far less than the market was anticipating. It seems like the best outcome at this point is congress passes a bill that is less than the market has been pricing in all summer. Yet, the market has rallied every single day as if a big bill was passed. Every day.", "score": 3, "replies": [{"body": "When it comes to the stock market, there are those who have experience and those who don't. Can't \"explain\" it to anyone. For the most part, we are all each other's enemies here.....we're all trying to take money from each other. What happens politically is good for short-term results, if you focus on that, then you have to have insider info to make any real money. The average shmuck should take his profits and wait. JMHO.", "score": -7, "replies": [{"body": "so you are saying that youre going on your gut? or are you saying you have insider information?", "score": 2, "replies": []}, {"body": "Yeah dude that's not how any of this works.", "score": 1, "replies": []}]}]}, {"body": "Hahahahaha one slightly red day and it’s over wow 😂😂😂😂", "score": 2, "replies": [{"body": "I've been doing this a long time, friend. Learn something or get pummeled.", "score": -10, "replies": [{"body": "Would love to try to unpack your intuition, what indicators make you think we are heading down from here?", "score": 1, "replies": []}]}]}, {"body": "Lol yes look at it go! It's down so much that the percentage change is showing up as GREEN! Crazy!", "score": 2, "replies": []}, {"body": "These bears are ducking hilarious man", "score": 1, "replies": []}, {"body": "I think its too early to call the end of the rally. Today what its really looking like is a rotation out of tech specifically which honestly was so overbought its not funny. If you look at SPY its down less than a percent and that is because alot of money moved into financials and things like consumer staples.\n\nIf on the other hand the indexes start to drop continuously then yes we might be there but we wont know that for days to weeks.", "score": 1, "replies": [{"body": "People can make their own guesses and bets. It doesn't take a rocket scientist to see that a huge leg was removed today on the broadest level possible. That's not rotation. But denial is a major player in the stock market, and there is a reason why Wall Street coined the term \"dumb money\". I'm just the messenger....you know the rest.", "score": -2, "replies": []}]}]}
{"title": "Walmart over $200 by EOY?", "selftext": "Does anyone here believe it’s feasible? My stupid logic is that Walmart’s stock has only increased by about 20% while all other major shopping companies have had astronomical gains. Even the Amazon of Africa, Jumia, hit it big during this covid crisis (which I made over 1,000% profit on option calls). I’m thinking with unveiling of Walmart + combine with the holiday shopping season, Walmart can hit big in Q4. And a move to $200 is only a 50% gain from here.\n\nAnyone with me on this one?\n\nEdit: with Walmart +, I really believe Walmart can further solidify themselves as Amazon’s primary rival. They have way more real estate than Amazon. Overtaking them may be a stretch, but being Pepsi to Amazon’s Coke isn’t bad at all\n\nEdit: Walmart is Amazon’s primary competitor. Competition brings out the best in everyone. It forces companies to innovate and make advances. Walmart is now breaking new ground!", "id": "i7h14e", "created_utc": 1597104526.0, "score": 1, "upvote_ratio": 0.54, "num_comments": 18, "comments": [{"body": "I hope so.  Been holding WMT Jan 15 2021 140 Calls for awhile.  But, it moves SO SLOWLY.  Hoping they get a nice bump when they release the details on Walmart+, and maybe even partner with some big content providers.  What worries me is the recent announcement from Amazon about opening distribution centers in vacated big-box stores like JC Penny, etc.  That could be a problem.", "score": 9, "replies": [{"body": "It’s gonna happen!!!!", "score": 2, "replies": []}, {"body": "It could be a problem, but any move Amazon makes puts pressure on Walmart to counter imo. This is good news to me. \n\nI’m currently thinking about buying January $180 calls, and in a big way. It just makes too much sense to me right now", "score": 0, "replies": [{"body": "I owned WMT when Amazon bought Whole Foods. That was a bad day for WMT stock (and basically all other grocers). It got hammered.", "score": 1, "replies": []}]}]}, {"body": "> My stupid logic is that Walmart’s stock has only increased by about 20% while all other major shopping companies have had astronomical gains. \n\nYeah, I agree with you on the logic.... you got some revenue and earning estimates to make the case?", "score": 1, "replies": [{"body": "No lol that’s why it’s stupid logic. It just came to me like 20 mins ago while working on my finals", "score": 2, "replies": []}]}, {"body": "🙄", "score": 1, "replies": []}, {"body": "It seems AMZN is taking from Walmart. I live in a small town and would generally hit Walmart twice a week. In the last two years I go monthly at best. Between Amazon for goods and groceries I'm pretty covered. And walmart produce and meats are garbage so I go to a further grocery store outside of town. They also have lots of extra costs that amazon does not have, like urban real estate, higher property taxes, theft and staff with Amazon located in more rural areas and taxes offset for them. I dont see walmart disappearing anytime soon but their major growth is over.", "score": 1, "replies": [{"body": "Completely agreed, last time I was at walmart to buy something was bc amazon was sold out lol", "score": 1, "replies": []}]}, {"body": "Poor people shop at Walmart. Poor people ain’t gonna pay a 98 dollar annual subscription fee for Walmart+.", "score": 1, "replies": []}, {"body": "WMT+ is delayed again, and will probably get delayed even further.. i got F'ed, bought call for sep which is tanking.. i assumed it wouldnt get delayed a 3rd time and would be announced in july and now it might not even get announced in August.", "score": 1, "replies": [{"body": "Damn", "score": 1, "replies": [{"body": "Butt then came tiktok! Broke even, instead of risking it. Bad choice though. Shoulda held for longer", "score": 1, "replies": []}]}]}, {"body": "Walmart won't get aggressive growth. It's a big company that is slow to risk things. I don't see it at $200 any time soon. I don't even see it beating the SP 500 really.", "score": 1, "replies": [{"body": "Damn", "score": 1, "replies": []}]}, {"body": "late but walmart+ is a big hit reported that 90% of people love it", "score": 1, "replies": []}, {"body": "It seems like a huge jump. But, in this market, any stock can go to the moon. That being said, WMT is not a trendy stock among the day trading / Robinhood crowd. Now, if the right headline hits and Robinhooders pile in, the stock could go way up. I would just say fundamentals, to the extent they matter, do not support $200.", "score": 1, "replies": [{"body": "It sure is trendy now", "score": 1, "replies": []}]}]}
{"title": "NVDA Earnings and Price Upgrades", "selftext": "They have to crush earnings, but it's possible.  New products coming out, Q2 Gaming Sales through the roof, this should see a nice bump if they do beat earnings.  Wont' be like the AAPL 10% gains, but hoping for 3% or 4%.  Holding Aug 21 Calls at $440, $450, and $455.\n\nhttps://www.benzinga.com/analyst-ratings/analyst-color/20/08/17010213/why-bofa-has-the-streets-highest-nvidia-price-target-ahead-of-the-q2-print", "id": "i7h3z9", "created_utc": 1597104812.0, "score": 17, "upvote_ratio": 0.86, "num_comments": 15, "comments": [{"body": "Articles (Bullish) about Nvidia and ARM Chip  to buy Arm from SoftBank for more than $32bn\n\n[https://www.bloomberg.com/news/articles/2020-07-31/nvidia-said-in-advanced-talks-to-buy-softbank-s-chip-company-arm](https://www.bloomberg.com/news/articles/2020-07-31/nvidia-said-in-advanced-talks-to-buy-softbank-s-chip-company-arm)\n\n[https://www.telegraph.co.uk/technology/2020/08/09/nvidia-arm-tie-up-could-create-new-king-chips/](https://www.telegraph.co.uk/technology/2020/08/09/nvidia-arm-tie-up-could-create-new-king-chips/)", "score": 7, "replies": []}, {"body": "selfishly hope they miss so i can buy", "score": 10, "replies": [{"body": "Lol i own shares and i too lowkey hope i this bc i want more damn it", "score": 2, "replies": []}]}, {"body": "NVDA has run up 28% since their last report 3 months ago. They have to announce revenue better than 3.65bn guided last quarter and given the run up maybe them beating guidance is priced in, so they must beat it significantly. 4bn revenue with margins intact would be nice here", "score": 3, "replies": []}, {"body": "I’ll wait everything has been beating earnings good company wise and has been going down besides a good handful", "score": 1, "replies": [{"body": "Except AAPL...  and QCOM...", "score": 1, "replies": []}]}, {"body": "Curious as to why you got three different strike price for your calls", "score": 1, "replies": [{"body": "As it went down today, I bought more positions at lower strike prices which also helps me bring down my average price to break even.  I currently am at about a $40K profit in nViida on stock I purchased a while back in June in the low to mid 300's.  I decided to sell a good chunk of those shares and risk about 75% of that profit in options on the stock as I think it's going to really take off if they beat earnings (relatively speaking, of course).  If I lose everything, I still end up making a good chunk of change in nVidia and move along.  Being in the tech sector for the last 35+ years, and having used nVidia products, not to mention having kids that use nVidia products, seeing their hardware used in consoles, researching their upcoming AI chips for self-driving cars, and their penetration into the data center market, I strongly believe this is a huge winner and the earnings announcement will fire up another push well above $460.  That being said, if it doesn't happen there will be no lack of people slamming me but I'll still have made a profit.  As earnings approach, I'll have my ear to the ground to see how things progress.  I'm still holding on to 200 shares of nVidia which I may sell covered calls on somewhere in the 470s or 480s as well as putting in a stop order on them in after hours in case the stock does tank to make sure I don't suffer any losses.  In the end, I could stand to make a pile of money, or just about 8% to 10% overall on the (approximately) 2 month transaction.", "score": 3, "replies": [{"body": "\"yesterday\" not \"today.\"  :)", "score": 1, "replies": []}, {"body": "I see, that’s a good move. Wish I averaged down like that when I bought calls on FSLY’s dip. Guess i’ll be taking that strategy with me whenever i’m buying dips from now on", "score": 1, "replies": [{"body": "The trick is to know when to cut your losses (something I have trouble doing sometimes) or knowing when to sell to avoid FOMO (another thing I've done).  I know what Fastly is and the market sector they are in, which intrigues me, but not sure I'm ready to jump in yet.  Their company \"tagline\" in TDA, when I read it, sounds like they took every \"buzzword\" from the industry and threw it together, LOL.  Agile... (I'm in Software Development), VOD/Streaming, etc.  I've seen the people here in stocks talking about it, but I don't know enough about it and the company I work for (over 14K employees) doesn't use their technology that I'm aware of.  I'll definitely need to put it on my radar.  Just watching the Nasdaq futures tank, LOL... could be an \"ouch\" type of day, but maybe my Jan options on CCL and WMT will help keep me afloat :).", "score": 1, "replies": []}]}]}]}, {"body": "I would add a 465 and 475 in there.", "score": 1, "replies": [{"body": "LOL... Done!", "score": 1, "replies": []}]}, {"body": "What’s more bloated Apple or NVDA.  They have the same stock price", "score": -17, "replies": [{"body": "But nowhere near the same market cap... a stock's price means nothing to tell how \"bloated\" it is.", "score": 14, "replies": []}]}]}
{"title": "Markets will never be red again", "selftext": "The DOW has been green consistently for the last 6 business days, and looks like it’s gonna be green again tomorrow. I think that we won’t ever see red days anymore. I don’t get why everyone doesn’t just buy DIA calls, it’s literally free money with 0 risk.", "id": "i7kmas", "created_utc": 1597118014.0, "score": 0, "upvote_ratio": 0.23, "num_comments": 10, "comments": [{"body": "Get this junk off my feed", "score": 19, "replies": []}, {"body": "Stonks", "score": 9, "replies": []}, {"body": "The fed keeps whipping the market like it is a race horse. So far it has performed like a race horse. But, there is still the chance it falls over dead. Although, if the fed is willing to play the role of the greater fool and keep bailing everyone out with free money, the market may keep going up and up.", "score": 3, "replies": [{"body": "I give the Dow a 60% chance of surviving until November. At that point, I give it a 90% chance of eating shit before Christmas. \n\nI also just made those numbers up, do not invest in DIA based on my seven second assessment alone. Or do, fuck it.", "score": 2, "replies": [{"body": "Seems legit to me. No risk it, no biscuit! Fundamentals be darn.", "score": 2, "replies": []}]}]}, {"body": "Cool. \n  We got one person yelling at us we are oblivious and stupid for investing and another telling us it\nWill\nNever be red again", "score": 6, "replies": [{"body": "In my non-expert and somewhat uneducated opinion, the answer is probably somewhere in the middle.", "score": 2, "replies": []}]}, {"body": "What’re dia calls?", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "Oh ok", "score": 1, "replies": []}, {"body": "imo we will see another mild red couple of days. But that’ll be it. I think the market is Mostly up until the election. And if Biden wins...well good luck to everyone lol.", "score": 1, "replies": []}]}
{"title": "What's your end game?", "selftext": "I've been watching this sub for the past month and made a comment here and there but one thing I haven't seen discussed is what is the end game for people. Lots of people looking to snag the next Tesla, Amazon or Apple and hold for eternity but no one talks about what their end game is? \n\nCurious to know what people plan to do. I assume most people is for retirement? \n\nFor me it is more of a 10 year plan to diversify as we already own (at least a portion of it the bank has the rest) a house. Build a portfolio and hopefully have enough to one day do an around the world trip with the funds. Given the current state of the world I think 10 years may be optimistic!", "id": "i7naay", "created_utc": 1597130449.0, "score": 1, "upvote_ratio": 0.56, "num_comments": 19, "comments": [{"body": "Get rich or die tryin", "score": 33, "replies": [{"body": "In a casino", "score": 1, "replies": []}]}, {"body": "Idk killing thanos", "score": 13, "replies": [{"body": "I asked for that", "score": 2, "replies": []}]}, {"body": "Personally mine depends on how my portfolio looks at certain stages, and my personal situation.\n\nI plan to be holding for quite a long time, probably coming into retirement if things have treated me reasonably well. Whether that's paying the last chunk of a mortgage off, having enough for a few extra holidays, or just being able to live with an extra annual paycheck, that's all I want.\n\nMy portfolio is there to make me comfortable and give me a few extra luxuries, basically working harder for me than it is in the bank. Hopefully, anyway.", "score": 8, "replies": []}, {"body": "With the Feds actively  destroying the dollar my goal is to find stock that I can hold onto forever... selling is bad if you don’t have a plan about what your going to do afterwards.. once you sell your out of the game. In order to get those forever stocks My entry can’t be to slow or two aggressive so I dollar cost average along with some technicals are key I think", "score": 6, "replies": []}, {"body": "Clear my nearly $1mm in personal debt.", "score": 5, "replies": [{"body": "Million? Jesus. Best of luck!", "score": 2, "replies": [{"body": "Thanks! Technically 980ish thousand but who's counting.", "score": 1, "replies": []}]}, {"body": "Med school/law school? \n\nI have a cousin who's coming out $250k in debt from his PhD program alone.", "score": 1, "replies": [{"body": "Four mortgages.", "score": 2, "replies": []}]}]}, {"body": "“Up there, that’s the endgame... how were you guys planning on beating that?”", "score": 3, "replies": []}, {"body": "Build for retirement while still living well now. \n\nI have my “number” that I have to reach but I really prefer to think about trying to be green every single day, if I can make $50-$100 a day I’m good. It’s a daily fight, you start turning red and you have to figure out how to fight back to green, what can you turn - where is it.. then take your shot.\n\nI like that type of daily thinking so I don’t ignore the value of a dollar", "score": 3, "replies": [{"body": "Sounds like your more than a set and forget kind of guy, you do a lot of day trading to keep in the green or you talking about overall portfolio?", "score": 1, "replies": [{"body": "Yes when things turn red I try to push it by trading actively in my after tax brokerage account. Sometimes it works and sometimes it doesn’t. It bothers me to just watch a loss happen without trying to mitigate or minimize it.", "score": 1, "replies": []}]}]}, {"body": "For me I would consider cashing out if my portfolio grew to where I could pay 50% down on a house. That wouldn’t be the end though. I would just aggressively start over. I may never get there but my long term goal is 3 million.", "score": 2, "replies": []}, {"body": "i'm just having fun...playing around with 1300 bucks....buying/selling/holding long enough to sell.  don't have an endgame.  i'll take my money out when i get bored.  i do have 2 aapl that i'll hold for a long while...i think", "score": 2, "replies": []}, {"body": "Two major milestones. \n1. 5 year plan: grow my portfolio enough for a down payment on a house. \n2. 20 year plan: Start growing my portfolio again for college tuition for each kid I plan on having. Aiming for 2.", "score": 2, "replies": []}, {"body": "Retire as soon as possible.\n\nI don't necessarily care about buying and holding for life unless it is a very broad index fund, so I invest in all kinds of thematic ETFs and individual stocks.  Occasionally, I will sell off a percentage of profit on any of those ETFs or individuals and buy partial shares of VTI or VT.\n\nI would like to have the majority of my individual portfolio consist of VTI and VT, but I want to juice the returns along the way because the CAGR of those two ETFs is weak af, but looks like a fairly stable way to live off mostly dividends when combined with my other retirement accounts and Social Security.", "score": 2, "replies": []}]}
{"title": "Looking for new positions", "selftext": "My school is starting next week and with the recent rallies in WYNN and UAL I sold them today and now I'm looking for new positions. I already have a share of AAPL and a little bit of Intel and I'm looking for two of three more companies to invest into. I was looking at Chevron and MGM if it get's beaten down again. Preferably no tech stock recommendations because I feel there bound to fall because of how much they've been pumped. Thank you for any recommendations.", "id": "i7udvs", "created_utc": 1597161773.0, "score": 1, "upvote_ratio": 0.6, "num_comments": 15, "comments": [{"body": "JPM", "score": 3, "replies": [{"body": "100% agree! JPM and Synchrony Financial (SYF), largest store brand credit card company are my two favorite financials.", "score": 2, "replies": [{"body": "The dividend on JPM has massive growth as well. An easy choice.", "score": 1, "replies": []}]}]}, {"body": "NET", "score": 2, "replies": []}, {"body": "SPR is doing good. I have been scalping it everyday making 4-8%\n\nSAVE is more of that and has a good outlook according to analyst again. \n\nTNA has been good.\n\nNIO is another good scalp/swing. You could always do a long hold and hope it turns into Tesla Jr as well. Huge volume over 100 million per day.", "score": 1, "replies": [{"body": "TNA overbought is wait for a drop", "score": 1, "replies": [{"body": "I don’t usually play with ETF because they are slow but this one seems good as it tracks small caps. \n\nI don’t see how it’s overbought when it’s an etf that is still closer to a all time low than high. The market is recovering and doing well.  The trends are looking very steady for recovery on this one. I could be missing something let me know. Thanks", "score": 1, "replies": [{"body": "Technically it’s overbought zone.\n\nI mainly use 3x etf because of the extra juice", "score": 1, "replies": []}]}]}]}, {"body": "Inovio. Thank me later", "score": 1, "replies": [{"body": "That 20% dip today is gonna be the start of a good or bad position if he does.", "score": 1, "replies": [{"body": "Not as much dip as iBiiiiiiiooooo that I also heavily bought into 😁🙈", "score": 1, "replies": []}]}]}, {"body": "I think Dominos Pizza still has a long way to go.", "score": 1, "replies": []}, {"body": "Tcnnf", "score": 1, "replies": []}, {"body": "ODFL", "score": 1, "replies": []}]}
{"title": "Investing in Sony and Microsoft stocks in relation to upcoming release of PS5 and Xbox Series S/X", "selftext": "For the first time, I am starting to make a bit of money and thus exploring investment possibilities.\n\nIs it too easy to consider buying Sony and Microsoft shares as a safe bet, due to the likability that their income will probably (massively?) increase during November/December with the release of the new consoles?", "id": "i7uiqb", "created_utc": 1597162193.0, "score": 1, "upvote_ratio": 0.56, "num_comments": 11, "comments": [{"body": "Consoles are only smaller parts of many things msft and sne do. You need to dig deeper into what their company portfolios are consisted of.", "score": 10, "replies": []}, {"body": "If you do some DD (research) you can look back to see when the consoles were released and how they affected their stock price. For sony, when the ps3 and ps4 released it didn't affect their stock much at all. The only time it happened is with the ps2 (probably due to it having the dvd drive in there and that being an in for casuals as well). \n\n&#x200B;\n\nI'd think the same would happen and like others have said, the stock price is already reflecting the inclusion of the systems in there.", "score": 3, "replies": []}, {"body": "You can’t beat the market. The stocks are already valued based on the predicted success of the new consoles. For Microsoft, Xbox isn’t worth that much compared to Windows and Office.", "score": 3, "replies": []}, {"body": "Most of the console releases are already priced in when they were announced.", "score": 2, "replies": [{"body": "The prices are priced on the demand. if more people buy. the price goes up. if less people buy, price goes down.  \n\n\nIf the consoles release and they are great. and everyone rushes and buys the stock, prices go up.   \n\n\nTheres no such thing as \"priced in\"", "score": 2, "replies": [{"body": "Yeah, but the release of next gen consoles is priced in. They've already been announced. I think you meant the success of each console isn't priced in. The demand is unknown and will be priced after earnings calls probably.", "score": 2, "replies": []}]}]}, {"body": "Don’t forget that AMD makes the CPU & GPU for both new consoles too.  Just a thought.", "score": 2, "replies": [{"body": "Good point", "score": 0, "replies": []}]}, {"body": "Xbox is a small part of microsoft , wouldn’t be a reason solely why I would invest..", "score": 2, "replies": []}, {"body": "I think SNE is priced in now. Went up pretty good earlier.", "score": 1, "replies": []}, {"body": "Thanks all, this made me put things a bit more in perspective :)", "score": 0, "replies": []}]}
{"title": "Should I sell my Amazon and buy QQQ instead? I don't want to transfer more funds into my account until I'm working again in October (stupid Covid) and am trying to position myself as wise as I can with what I have in there currently. I'm currently down $70 in Amazon", "selftext": "32 f. I don't want to transfer more funds into my account until I'm working again in October (stupid Covid) and am trying to position myself as wise as I can with what I have in there currently. I'm currently down $70 in Amazon", "id": "i7xz43", "created_utc": 1597173069.0, "score": 2, "upvote_ratio": 0.6, "num_comments": 10, "comments": [{"body": "Go long on amazon, you won’t regret it. Buy QQQ in a tax advantaged account like a Roth IRA.", "score": 10, "replies": [{"body": "> you won’t regret it\n\nFamous last words.", "score": 2, "replies": [{"body": "I see no issue in holding amazon long term.", "score": 4, "replies": [{"body": "I'm just joking about how no one can possibly know the future so it is impossible to say what will happen in the future with any level of certainty about the success of any company. Even if i do agree that amazon seems like a solid investment, it can come out tomorrow that Amazon suffered a huge data breach, or that a huge warehouse caught fire, or Bezos is killed by a bus. This is why we diversify, to compensate for risks that we are uncompensated for.", "score": 2, "replies": []}]}]}]}, {"body": "I haven't gotten a Roth IRA yet. I know I need to.  Do you have any direction to point me in as far as researching Roth's? I know nothing about them. I want to eventually go to a financial planner but would rather when I am working again after my job opens back up and can contribute to an account more", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I read that people are dumping tech stocks. Do you still think that investing in the Nasdaq is wise at the moment?", "score": 1, "replies": []}]}]}, {"body": "I kept Amazon and went ahead and added to my position with IIPR ( for the first time).  Baby trader!\n It's gained about $5000 so figure it was a wise move ( I think lol )", "score": 1, "replies": []}, {"body": "Okay so I now have AMZN, AAKF. TSLA, IIPR, & FIVG. Hoping that moving some things around and getting more ETF's gave more of a diversification. I'm assuming I'm still rather high risk???\n     Next step will be a Roth.", "score": 1, "replies": []}, {"body": "FIVG", "score": 0, "replies": []}, {"body": "I would go long with amazon, and instead of QQQ i would invest on TTOO for long. Good luck to u mate", "score": -1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "i7ylni", "created_utc": 1597175059.0, "score": 0, "upvote_ratio": 0.19, "num_comments": 13, "comments": [{"body": "300+ days on Reddit, but can't search a question first?", "score": 8, "replies": [{"body": "Hah! I was expecting someone to say this and I know you won't believe it.. but I seriously can't find the 'search' option on this sub. I know there is one because I see other people mention it but I don't see that as option anywhere. Can you please tell me where is the search option so I know atleast for future?  Thanks!", "score": -1, "replies": [{"body": "I'm on mobile atm, but if you just go to the subreddit page, and go to the top of the page, there's a navigation bar with the Reddit logo on the left, there's a large search bar in the center.", "score": 1, "replies": []}]}]}, {"body": ">So I heard the split is happening on 31st of Aug. Does that mean whatever is the stock price at the end of the day on 31st, new price will just be 1/4th of that?\n\nThe actual price split will happen on August 30th at the closing price. The stock will begin trading at a split adjusted price on August 31st.", "score": 1, "replies": [{"body": "u/thenewredditguy99 Thank You!   \n\n\nOk! Would you say that the stock price may get higher as we approach the split day or there is no correlation?", "score": 1, "replies": [{"body": "🤷‍♂️. Apple got bombarded in the selloff towards the close so that probably just wiped off a day or two's worth of gains.", "score": 1, "replies": [{"body": "That's why I'm thinking maybe it's a good opportunity to pick up some stocks?   \nAccording to AAPL's previous split history, stock has gone up by 8% soon after the split. Do you have any thoughts?", "score": 1, "replies": [{"body": "Past performance is no indicator of future returns. With the whole split thing, it's been widely speculated that Robinhooders will pile into Apple and drive it higher on the day it begins trading at the split adjusted price, so it could make for some easy gains.", "score": 2, "replies": []}]}]}]}]}, {"body": "Mandatory \"ThIS hAZ BeN asK3D a MIlliUn TImeZ!!11! LoOk It Up IN ThA SuB HiStURy n00b!!11!!1!\" comment.", "score": 0, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Jesus would want you to look it up in the sub history.", "score": -2, "replies": [{"body": "u/DRWMI92 How do you search sub history?", "score": 1, "replies": [{"body": "Idk.. I've never done it directly. That's just what the sub-nazis always say to do.", "score": 1, "replies": []}]}]}]}]}]}
{"title": "What are some great non-tech stocks?", "selftext": "I came to the realization that my portfolio lacks a bit of  diversification. It’s down quite a bit which is understandable. I was looking at non-tech stocks like JPM,WMT, and DIS. I want to get in to casino/gambling stocks once they reach a good buy in. What are some of your favorite non-tech stocks?", "id": "i8058b", "created_utc": 1597180024.0, "score": 10, "upvote_ratio": 0.86, "num_comments": 11, "comments": [{"body": "For gambling PENN & MGM. Non-tech: BAC, BRK.B, XOM, T, WM, BA, LUV, KO, MCD, JNJ, PFE, MRK, RTX, LMT", "score": 7, "replies": []}, {"body": "HD, AZO, ULTA", "score": 6, "replies": []}, {"body": "None in gambling currently but I'm watching MGM.  Otherwise I like SMG, PEP, MCD, BHF.  Also considering HBI or maybe the house building sector?", "score": 3, "replies": []}, {"body": "JPM, BRK.B, JNJ", "score": 3, "replies": []}, {"body": "Here's an answer.\n\nAres Capital. Established business development company that usually invests in industries with some legs. Know how to navigate a recession and economic reorganization. Currently their parent Ares Management is being used as a bit of a hedge right now with a high P/E. But ARCC is good. Solid dividend. They lend to middle market companies needing capital. I don't expect them to suffer terribly in a downturn. If they do suffer downturn they know how to recover. Safe enough. I can see them doing well enough in the next political session, too, since BDCs really took off under Obama's tenure.\n\nHow about a dividend ETF? SPHD. Currently at a discount. Monthly dividends if that's your thing. Safer than the solid monthly payers, but will take time to recover. Popular yet good. (Edit: I personally like this more than Realty Income after reading a short expose about O from Spruce Point... they seem like investigative journalists of the stock market). SPHD is just friendly as hell.\n\nOr UTG? A closed fund based on utilities. Good return, historically good, isn't likely to die. Closed funds can destroy value but this one seems well managed.\n\nOr, you can go for oil supermajors. Marathon Petroleum beat the S&P since it began as a company. The other majors may be forced to unlock value if it gets bad enough. I do not think they will be allowed to die. They will likely return your money a few times over if you invest now over the next couple years. But there is risk of losing for sure. They're all half off right now.\n\nLots of things out there if you think the mass technology stocks are overbought. Even if you Iike the tech companies that provide for our modern convenience... there are still many opportunities.", "score": 3, "replies": []}, {"body": "MDT", "score": 1, "replies": []}, {"body": "Plnt", "score": 1, "replies": []}, {"body": "Oke\nCemi", "score": 1, "replies": []}, {"body": "The 3 you listed and O", "score": 1, "replies": []}, {"body": "WM, RTX", "score": 1, "replies": []}]}
{"title": "Are you waiting to buy into tech until after recovery?", "selftext": "[deleted]", "id": "i807az", "created_utc": 1597180206.0, "score": 8, "upvote_ratio": 0.69, "num_comments": 11, "comments": [{"body": "There might be a rotation out of tech in the near future but not as extreme as many people think. I'm sticking the course and buying dips. I like my tech picks for long-term", "score": 13, "replies": []}, {"body": "Tech is where it's at long term . I will stick with my amzn , apple , MSFT , GOOG , Nvidia , sq , v , ma, adbe PayPal over airlines , oil, telecoms , utilities  REITs, banks etc", "score": 15, "replies": [{"body": "We are portfolio bros", "score": 6, "replies": []}, {"body": "They are obviously good long term bets but if you have money on the sidelines why not wait to get into tech until after prices drop enough that you can get extra shares?", "score": 3, "replies": [{"body": "Probably because people been saying they will drop since we bottomed in March. Still hasn’t happened.", "score": 3, "replies": []}]}, {"body": "Adbe?", "score": 1, "replies": [{"body": "Yes also own adbe added it", "score": 1, "replies": []}]}]}, {"body": "You can’t just say “buy tech”.  You can buy IBM and CSCO right now, that’s cheap tech?  Amazon is consumer discretionary, FB and Google are communication services.  Sadly, they are cheap for a reason.  Hyper growth tech that is part of digital transformation and benefiting from the WFH paradigm won’t ever trade at reasonable levels while their growth is still through the roof and in some cases accelerating during a pandemic and global economic crisis.  Some big winners have pulled back to reasonable levels to take a position in and at least start positions to add to on further weakness.  \nBuy MSFT and FB now and just hold them until you get bored or die.\nBuy TEAM, DDOG, CRWD or ZS, SQ or PYPL or both\nBuy TDOC\nWORK is good too.\n\nPoint being, we are in the early stages of a shift in the way we work and live.  Digital transformation is here and accelerating in this environment, i wouldn’t wait for them to become cheap.  Start small and add to positions when you can.", "score": 1, "replies": []}, {"body": "Alert us when real recovery starts", "score": 1, "replies": []}, {"body": "Recovery? From what like highs a week ago? Look at 5 year charts, most tech stocks are near ATH", "score": 1, "replies": [{"body": "I think he means general market recovering to normal. (Cus when that happens, tech would presumably dip down to the earth)", "score": 1, "replies": []}]}]}
{"title": "Umm so what just happened with AMD?", "selftext": "[removed]", "id": "i80dnw", "created_utc": 1597180791.0, "score": 0, "upvote_ratio": 0.31, "num_comments": 14, "comments": [{"body": "People taking profits relax", "score": 7, "replies": [{"body": "Oof really thought AMD would reach the 100s", "score": -9, "replies": [{"body": "Give it time", "score": 5, "replies": [{"body": "Will do, do you hold amd stocks as well?", "score": -6, "replies": []}]}]}]}, {"body": "[deleted]", "score": 11, "replies": [{"body": "Yeup, I'm new to investing so I haven't put in too much", "score": -13, "replies": []}]}, {"body": "You only lose it if you sell, you are down $50.  Stocks go up, stocks go down, AMD been on a tear.  All tech is down right now, money went into all the depressed stuff.", "score": 6, "replies": [{"body": "Yeah lols sorry my portfolio is down 50. Yeah I saw apple and other tech giants they getting screwed", "score": 2, "replies": [{"body": "Stocks don't move in straight lines. If you like the stock buy the dip, big tech isn't going anywhere and you've barely put any money into it if all you lost was $50. There are folks who lost thousands on the same drop-- be patient, keep watching the stock, and try to average your price down.", "score": 3, "replies": []}, {"body": "Bro, u gotta look at the market in less dramatic terms, tech is up like crazy, it pulling back is simply a natural part of the game.  Nobody is getting screwed here.  Apple is up 70pts in the last two weeks.", "score": 1, "replies": []}]}]}, {"body": "Massive tech and market drop at around 12.", "score": 1, "replies": [{"body": "Dang what happened though? Last week was so great? Did it have something to do with trump again?", "score": 2, "replies": [{"body": "Harris was announced running mate. If you recently  bought then that probably has more to do with it. You bought when the stock popped and law of averages would make it so the stock comes back down some. I think it will make some of its losses back tomorrow because the drop was so narly.", "score": 5, "replies": [{"body": "I really hope so, I bought it a month ago when it was around 82 to 84. Thought it should go to 100 since the recent success of amd beating Intel. So kept holding but turns out today nope", "score": 1, "replies": []}]}]}]}, {"body": "So far this is just a pull back, still watching to see if volume continues to increases or starts to taper off more while pulling back. AMD in particular was WAY over extended and needed to pull back. Maybe it will come back and do a gap fill.", "score": 1, "replies": []}]}
{"title": "Is AMD safe?", "selftext": "[removed]", "id": "i80es7", "created_utc": 1597180887.0, "score": 0, "upvote_ratio": 0.4, "num_comments": 11, "comments": [{"body": "[deleted]", "score": 9, "replies": [{"body": "True, im people but i put more money in the day before it went red lmao", "score": 0, "replies": []}]}, {"body": "Bought at $75. Story keeps getting better and better.", "score": 4, "replies": []}, {"body": "“After a couple good days”\n\nBuddy if you think the last couple days have been good wait till you see what the stock has done IN THE LAST COUPLE YEARS.\n\nJesus fucking Christ", "score": 3, "replies": [{"body": "True i need to do long term investing but im 18 and want money lol im glad those years of hard work was knocked down by a couple viral bois", "score": 0, "replies": [{"body": "The sentiment of my comment is not to knock you down, but to make you understand that measuring a stocks price movement in days is a fool’s errand. It goes up on some days and down on the next.  Up on weeks and down on the next.  You have to stop focusing/worrying on what happens next week and focus on where a company goes two years from now and why.  Stop thinking short term, it will be the death of your bank account.\n\nIf you’re 18, the hard work is still ahead of you.  You ain’t seen nothing yet.", "score": 1, "replies": []}]}]}, {"body": "Went sky high after Intel's fall from grace and hit the point of overvalued some time around earnings. Still a solid pick but its just coming back down to a fairer valuation as it's probably still inflated. Just wait for a the bottom or a few sideways days and that'll probably be good time to buy in.", "score": 2, "replies": []}, {"body": "I would've expected a drop like this because it jumped from 67 to 85 in what, a week? I bought at 77, hope it doesn't go lower.", "score": 1, "replies": []}, {"body": "INTC only down 2% today; the worm is turning.", "score": 1, "replies": []}, {"body": "No", "score": -1, "replies": []}, {"body": "Probably not. Bought it anyway", "score": -3, "replies": []}, {"body": "Tesla", "score": -3, "replies": []}]}
{"title": "Sectors", "selftext": "I’m trying to diversify more. I put about $100 in a week usually and don’t have high income. I’m looking to try and get a couple - a few stocks in each sector. Currently I hold:\n\n**ARKK,\nICLN,\nMSFT,\nPLUG,\nQQQ,\nSE,\nSPHD, \nVOOG,\nVYM,\nWCLD**\n\nI’ve been looking at V, T, VZ, O, VOO, BOTZ, ARKF, and KO. Does anyone have any other suggestions and can you put the sector next to the stock (I’m still pretty new at this and want to learn as much as I can). What do you guys recommend?", "id": "i81o94", "created_utc": 1597184952.0, "score": 1, "upvote_ratio": 0.67, "num_comments": 18, "comments": [{"body": "Might want to add a defense sector stock.  Good options are Raytheon Technologies (RTX), Lockheed Martin (LMT), Northrop Grumman (NOC), and General Dynamics (GD).\n\nIf you ask this specific sub, they will recommend you choose RTX out of the 4, and I agree.  Since the merger, it has a close connection with commercial airlines through Pratt & Whitney, so it's stayed fairly low in price and is at a somewhat discount now (although it has regained 11% this week, so who knows whether or not now is a good time to buy in or not).  Since it just rose quite a bit, it may go back down in the short term (but also it might not!).  Long term though, it is very likely to be good because the company itself is well-established, well-diversified and well-run.\n\nI'd also recommend Waste Management (WM) for further diversification.  Well-run also and in an industry that isn't going anywhere.  It's seen nice growth over the past few years.  To accomplish diversification in my portfolio, I do have 20% in a total market ETF, but I also have a combined 13% in Raytheon Technologies and Waste Management as well as a few others mixed in there as well for diversification at lower percentages, so those two are definitely companies I believe in strongly long-term.  The rest is more risky tech.  I'm just another dumbass on the internet though, so please do your own research first.", "score": 7, "replies": [{"body": "I'm heavy on RTX, 400 shares at 50 dollar.\nGot high hopes. Fantastic company.", "score": 1, "replies": []}]}, {"body": "VPU", "score": 2, "replies": []}, {"body": "I'm currently invested in ITOT, IUSG, and FTEC for about half of my portfolio, with the other half in ARKK, ARKF, and WCLD. Below are a few other investments I was considering.\n\nBEP - Renewable Energy (+decent dividend)\n\nIDNA - Genomics & Healthcare ETF\n\nHERO - E-sports/ Gaming Tech ETF\n\nKWEB - China Internet Tech ETF \n\nQCLN - Clean Energy ETF", "score": 2, "replies": [{"body": "Sweet, i’ll look into all of these. Thank you. What are your thoughts on ICLN? Ive had QCLN and BEP in a renewable energy list for a while, need to look into them more. I like that BEP has a decent dividend", "score": 2, "replies": [{"body": "ICLN has a slightly lower E.R. (.46% vs .60%) and I like how the diverse and international it is. I'm also also invested in one of it's bigger holdings, PLUG, and think clean energy may become more prevalent depending how things go with the elections in November. I like the returns better on QCLN, although it may be heavily influenced by Tesla. Cheers!", "score": 1, "replies": []}]}]}, {"body": "RTX - Defense/Aerospace\n\nCHWY - Animals\n\nWM - Garbage/recycling\n\nGERM - Healthcare ETF", "score": 1, "replies": [{"body": "Excellent picks.  I just posted my comment a minute ago before even looking at yours and I specifically recommended OP RTX and WM also.  I have CHWY in my portfolio also ... underrated ticker.", "score": 2, "replies": [{"body": "Yeah I'm pretty happy with my long term portfolio. Things I can buy and not care about like RTX and WM are the core outside of tech. I've been buying as much as I can afford sub 60 every time it dipped. I only have 3 CHWY shares but was looking to add more, looking into Zoetis as recommended by u/znjc now too. Everyone has pets and will always have pets, I could add both by I like to sit at about 12 tickers and would have to drop something. Well see what I can dig up in the 10K", "score": 1, "replies": []}]}, {"body": "Personally I like Zoetis for animals better than chewy for long term", "score": 1, "replies": [{"body": "I'll check them out! I was looking to add more CHEWY this week but my position is small, so I wouldn't mind moving elsewhere if I find something that looks better", "score": 1, "replies": [{"body": "Zoetis is a strong company, and supplies a solid 90% of the equipment and medications that the practice I work at uses on a day-to-day basis. They’re a strong competitor with IDEXX, and definitely aren’t going anywhere in a downward direction any time soon. I’m holding long call options in Zoetis. Both are worth the time looking in to", "score": 1, "replies": [{"body": "Looks pretty good, revenue and cash on hand seem great\n\nDebt to asset ratio looks a bit high? Not that I can complain, CHWYs is negative. It seems like they have a large reach (international as well as US) but a narrow focus (meds) - Ya? Do they have any intent to diversify into other areas? I know CHWY supplies food/toys/meds and all that jazz. I might keep my eye on this and do proper research, only had a few minutes tonight. Possible room for both in my portfolio tbh, and ZTS hasn't went 3x pre covid levels, meanwhile CHWY has.", "score": 1, "replies": [{"body": "My position on ZTS comes from a client point of view. They are a massively growing company, working with creating revolutionary veterinary medicine, medical products, etc. they’re easily one of the biggest names in the veterinary industry (which is only growing), and I see them making ground-breaking changes in the veterinary industry. Both are great picks, I just think ZTS is an irreplaceable entity which will only increase in value, while I think CHWY will level out due to the only growing competition", "score": 1, "replies": [{"body": "Ah so they are more focused on life changing medicines and products that could be game changing to an animals health and overall life. Much more like a true medical or biopharm company while CHWY is more e-commerce for pets. I think once I can do some proper research they may make it into my portfolio.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "buy an all world etf and don't care about it", "score": 1, "replies": [{"body": "Do you have any recommendations?", "score": 1, "replies": []}]}, {"body": "I'd go for PEP over KO", "score": 1, "replies": []}]}
{"title": "Tesla is involved in the development of a smartwatch, but why? - Electrek", "selftext": "", "id": "i7ondf", "created_utc": 1597137928.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 17, "comments": [{"body": "I would buy Tesla Airpods and phone.", "score": 14, "replies": [{"body": "I would buy Tesla anything.\n\nHell, I bought three pairs of friggin' short shorts!", "score": 11, "replies": [{"body": "Heck, for something they'd overhaul the engineering of the entire design and make a fundamentally better device for toasting bread - so yeah, I'd want theirs.", "score": 5, "replies": [{"body": "Toasting bread? Hell, I want a \"Not A Flame Thrower\" now to sear and put a crust on my steaks after sous-vide. I knew I should have ordered one when I had the chance.", "score": 3, "replies": []}]}]}, {"body": "Tesla iPhone!", "score": 1, "replies": []}]}, {"body": "\"KITT, I need ya \"", "score": 9, "replies": []}, {"body": "What if Electrek's assumption is wrong and Tesla wanted to use just the technology of this smart watch company? Not a watch,  but the type of communication this company may have a patent on. \n\nOur cars have LTE. Didn't Elon mention in a tweet or someone suggested to have our cars have the ability to talk to another Tesla?", "score": 5, "replies": []}, {"body": "The quote, “buying TSLA is like buying 16 startups,” is aging well!", "score": 6, "replies": []}, {"body": "Reallly hope Tesla doesn’t try to compete directly with Apple simply with another smart watch. With that said, I think the speculation looking down the road of using this technology for ride hailing sounds very promising.", "score": 5, "replies": [{"body": "I would love for Tesla to compete with Apple.", "score": 5, "replies": [{"body": "I would too, I just don’t think it’s a great use of resources right now, just my opinion.", "score": 6, "replies": [{"body": "They are innovating on many fronts... And I like it.", "score": 2, "replies": []}]}]}, {"body": "They're not just going to design apple type products. It needs to tie in to the mission.\nThat being said, I'm sure there are ways that certain wearables can fit into the Tesla ecosystem. (especially with neurallink lol)", "score": 1, "replies": []}]}, {"body": "It's clearly to replace the car key.", "score": 3, "replies": [{"body": "I wouldn't say \"replace\"", "score": 3, "replies": []}]}, {"body": "Reason four will BLOW YOUR MIND? come on, Fred, knock off the clickbait. I don't even click on ho hum stuff anymore. You've overplayed it.", "score": 3, "replies": []}, {"body": "They will get into the phone business.", "score": 1, "replies": []}]}
{"title": "Elon Musk: Tesla, SpaceX, and the Quest for a Fantastic Future by Ashlee Vance - Must read!", "selftext": "", "id": "i7upd0", "created_utc": 1597162778.0, "score": 5, "upvote_ratio": 0.86, "num_comments": 10, "comments": [{"body": "I'm not done yet reading it but if you have any investment in Tesla, I highly recommend to read this book. Very easy to read and a great insight into Elon's history and way of life.\n\nPlease don't buy it on Amazon and get it from your closest local bookshop, they need the support more than Besos.", "score": 2, "replies": [{"body": "Best not to buy anything from Amazon", "score": 2, "replies": [{"body": "Being in Ireland, options are scarce on most things but I agree.", "score": 1, "replies": []}]}]}, {"body": "Maybe someone can explain it better than me but I found the authors tone or attitude towards Elon to be a bit jaded, not necessarily a bad thing since it's always good to have a sense of skepticism.\n\nOverall great read. Musk is the Howard Hughes of our era, and what's best is his story is not even close to done.", "score": 2, "replies": [{"body": "So far I find the tone to be pretty fair but I haven't finished it yet.\n\nRegarding to comparing him to anybody else, I don't think that it's needed as he will end up being his own as the like of Nicolas Tesla, Albert Einstein etc... but just way bigger in the sense that if he succeed, he will have made the world transitioned to sustainable energy, make us a multi-planetary species and more or less saved Humanity for extinction. Only time will tell but surely the biggest part of his story is ahead, if not too late already.", "score": 2, "replies": [{"body": "I recommend you read rocket billionaires next. Another fantastic read especially if you have an interest in space. \n\nTo tie it back to this sub, I have a slight worry that one of these days he's going to step down from Tesla to focus on SpaceX. That's clearly his bigger passion.", "score": 2, "replies": [{"body": "I'm sure he will but not for a 5years to decade at least.", "score": 1, "replies": []}]}]}]}, {"body": "Not adequately related to investment. Investment thesis around Elon or book recommendations loosely related to Tesla investment are better suited for Daily or Weekly threads.\n\nEdit: a letter", "score": 1, "replies": [{"body": "Considering that it will cover the company history, I'm pretty sure that worth a read to understand more about the company, his CEO vision and state of mind.\n\nDaily and weekly are interesting for day trading but a comment instead of a post would make it lost in visibility.\n\nI thought the misc flair was for this kind of posts.\n\nAnything that provide more info about a company or his management should be considered investment related imo. You can't be too informed when betting your own money.", "score": 0, "replies": [{"body": ">Daily and weekly are interesting for day trading \n\nWeekly thread is for substantive or substance provoking comments only. \n\nI agree that everyone who's looking to invest in TSLA should read this book. I'm planning to update the wiki page of the sub to acquaint newer investors with resources such as this book.", "score": 2, "replies": []}]}]}]}
{"title": "A Tesla Solar Roof system is deployed for under $30,000 - Electrek", "selftext": "", "id": "i7zwit", "created_utc": 1597179246.0, "score": 48, "upvote_ratio": 0.98, "num_comments": 13, "comments": [{"body": "Looking forward to the Q3 results!", "score": 9, "replies": []}, {"body": "Still not happy with solarchitys progress/Bailout.  Could have built a second GF for that in 2016", "score": 3, "replies": [{"body": "Yep.. I called it then and voted against it. You will never convince the people who can’t handle cognitive dissonance but Tesla never had any real business in solar. When you have a rocket ship like auto and the robotaxi follow up to that, you focus on that business. Elon just couldn’t delete this from his head because he was involved in it.\n\nit’s fine though. It doesn’t really matter. It’s fine print on the story. No one should believe the nonsense about Tesla energy being equally as big as auto though.", "score": -9, "replies": [{"body": "Got numbers to make your case?", "score": 7, "replies": [{"body": "Oh I dunno... how about this long running false commentary about energy matching auto? Presumably\n Straubel left because he saw the opportunity?\n\nI don't need to justify it. The people antagonistic to this are morons that operate at level 0.", "score": -2, "replies": [{"body": "So short-sighted...", "score": 6, "replies": [{"body": "Except unlike the people parroting the line about solar city being some great opportunity my predictions are now accurate 4 years later.\n\nand I’m perfectly capable of also predicting the future for auto.\n\nbut again.. this is cognitive dissonance and people can’t handle musk being wrong.", "score": -1, "replies": [{"body": "Solar is a slow burn and has not yet hit the steep curve of the exponential; and, it has obviously not been at the top of Tesla's priority list up till now. They have just begun offering super competitive pricing at $1.49/W and the next-gen solar roofs. Give it time.", "score": 7, "replies": [{"body": "Do the math. Tell me the revenue potential from buffalo.. have they started the next factory? \n\nHave you really thought this out?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I think you are missing the point completely. Solar systems from Tesla produce more energy than all Tesla use. This is exactly what they want in their mission. Sure it may is not a big deal finanically now, but i can see a bright future.\n\nI certain, sometime in the future, battery storage, V2G/controlled charging, Solar and maybe heating/cooling (heatpump/AC) will all come together to form a very strong virtual grid. This combined with a software called \"Autobidder\" will make them billions. \n\nThe best of all, this revenue will reaccrue every quarter and have a extremely high margin. And it gets bigger with ever battery they sell, no matter if in a car, power wall or power pack.\n\nThis is how solar make sense, because it integrates perfectly in Tesla's virtual grid.\n\n\\-banana-", "score": 5, "replies": [{"body": "It will grow slower than auto and start from a smaller base. It might be a fine business but it is tiny.\n\nI like the banana though.", "score": 1, "replies": [{"body": "I think you missed the part where cars actually become part of the virtual grid. But this is only speculation at this point.", "score": 4, "replies": []}]}]}]}]}, {"body": "I, for one, am glad Tesla bought SolarCity.\n\nThey need a strong solar component in their offering. The Tesla roof is a genius product. Once they bring the cost down low enough, no traditional solar panel manufacturer will be able to compete.\n\nBuying SolarCity was a quick way to get a jump start in that market.", "score": 1, "replies": []}]}
{"title": "Tesla Announces a Five-for-One Stock Split", "selftext": "", "id": "i805sj", "created_utc": 1597180076.0, "score": 22, "upvote_ratio": 0.87, "num_comments": 14, "comments": [{"body": "HELL YEAH!!! \nThat was fast news. I wonder if this has anything to do with potential SPY inclusion - perhaps a split could help increase the float?", "score": 6, "replies": []}, {"body": "This seems like a move that is welcomed by the market 🚀", "score": 4, "replies": [{"body": "But why?", "score": 1, "replies": [{"body": "Cheaper to aquire a share. That doesn't really matter in this day and age with fractional shares tbh.\n\nBut it will reduce the cost of options which is a heavy portion of Tesla investors", "score": 2, "replies": []}, {"body": "it's a bullish sign", "score": 2, "replies": []}]}]}, {"body": "Now, ElonMusk can do buyout @ 420 :)", "score": 1, "replies": []}, {"body": "This is a stupid question but receiving a stock dividend is not a taxable event, right?", "score": 1, "replies": [{"body": "Nope, it is not taxable until you sell. Unlike a cash dividend...", "score": 3, "replies": [{"body": "Thank you!", "score": 2, "replies": [{"body": "To clarify my comment, it is tax neutral. It adjusts your cost basis if you sell. The only tax is capital gains or (loss). A cash dividend is taxable (in most cases). Only way I think you may avoid tax on cash dividend is in a Roth (i think).", "score": 2, "replies": [{"body": "Oh I see, the stock dividend will adjust my cost basis?", "score": 1, "replies": [{"body": "Yes if you buy 1 share at 1500 pre split your cost basis is 1500. After your split it will be 5 shares at $300.", "score": 2, "replies": [{"body": "Ah ok, makes sense, thanks!", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Removed as a topic repost; see [this thread](https://www.reddit.com/r/teslainvestorsclub/comments/i801xr/tesla_announces_fiveforone_stock_split/).", "score": 1, "replies": []}]}
{"title": "DIA CSP's?", "selftext": "Is anyone considering selling DIA CSP's as of late? \n\nFrom what I noticed the QQQ and SPY are still at ATH's and the DOW seems like it will catch up over the coming months. DIA ATH was  **295.87** and we're currently @  **278.01** (17.8) spread. \n\nI've considered selling 1 or 2 of the 11 SEP 20 275P @ 5.30 \n\nJust wanted to see what the general consensus is on this from the group. Mainly the ones who like selling options on index funds.", "id": "i7kxdb", "created_utc": 1597119291.0, "score": 3, "upvote_ratio": 0.71, "num_comments": 8, "comments": [{"body": "I don't buy it. What went down must come up is not a sound trading strategy. If Corona is not getting better soon, the companies on the Dow are a lot more vulnerable than SPY. The only counterpoint is that SPY is even more overvalued at the moment.", "score": 4, "replies": [{"body": "Sell SPY CC's it is.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "What would be some good Indexes or ETF's for a smaller account? I'm only working with 7k atm. I've been selling naked puts on SPY. Has worked well so far, but in retrospect is not a great idea. Any recommendations?", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Thank you very much for that. Most of those ETF's are on TD's 24/5 list too which is an added plus. I have some good DD hours ahead of me. I really appreciate the help and support brother. It's a lot harder to scale a smaller account quickly. Given the pandemic and bizarre market movement in every which direction with nearly no rhyme or reason. I put the majority of my funds (around 60k) into PFD's, and fixed income ETF's just to focus on holding out for the long term / retirement. I left myself 7k to use to actively trade options with, but with an account this small, a lot of the stock equities I see in the sub like AMC, NIO, GNUS, AAL, INO, carry a little too much risk for my taste. I'm selling CSP's on a few of the aforementioned, but they expire next week. So I'd much rather shift right back into to index funds in general.\n\nThanks again broski, have a great rest of your week.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Will do, like wise broski.", "score": 2, "replies": []}]}]}]}, {"body": "You can try LABU, FAS, TNA, XLU, XLC, XHB,DEFN. All are less than $60-70 and focus on different sectors.", "score": 2, "replies": [{"body": "Thank you! Adding them to my DD and watch lists. Much appreciated.", "score": 1, "replies": []}]}]}]}, {"body": "I like IWM for the same reason", "score": 2, "replies": []}]}
{"title": "Current holds and stats. Getting this option game down. Yes I was up 23k on Tesla during the big run.", "selftext": "", "id": "i7iztd", "created_utc": 1597111691.0, "score": 0, "upvote_ratio": 0.44, "num_comments": 18, "comments": [{"body": "My mom can make money on Apple", "score": 15, "replies": []}, {"body": "what is this, my receipt from farfetch?", "score": 14, "replies": []}, {"body": "So you’re down more than 19k from your ATH. Still got 3.2k left to lose my fellow autist.", "score": 4, "replies": [{"body": "Yes I started at 3200 got up to 31k and back to a little over 6k but I pulled out 4k because I bought a house needed new furniture.", "score": 2, "replies": [{"body": "You pulled out profit. You’re no autist of mine.", "score": 13, "replies": []}, {"body": "Lost all respect from us if you pulled out profit", "score": 5, "replies": []}]}]}, {"body": "Remember.. Apple stock is splitting on the 24th so that means more people will buy because it's cheaper. So stock will go up", "score": 5, "replies": []}, {"body": "Congrats on your $13 gain? IDK what you want", "score": 13, "replies": []}, {"body": "If it’s good enough for a screen shot, probably good enough to sell.", "score": 4, "replies": []}, {"body": "whats this broker. nice ui", "score": 2, "replies": [{"body": "Webull", "score": 2, "replies": []}]}, {"body": "Jesus Christ look at that fucking pendulum. Reminds me of my dads balls when he would wear boxers", "score": 1, "replies": []}, {"body": "People really be havin charts like this n say “Im happy ive come a long way trading” like no stupid your shit just hasn’t crashed back down yet", "score": 1, "replies": [{"body": "You think you’re getting the hang of it but you’re really just learning new ways to fuck up even worse", "score": 1, "replies": []}]}, {"body": "Weird flex but ok", "score": 1, "replies": []}, {"body": "Lmaoooo, nice avg. price on APPL. Looks like you’re a genius", "score": 0, "replies": [{"body": "😊", "score": -1, "replies": []}]}]}
{"title": "The story of Tesla's IPO", "selftext": "[deleted]", "id": "i7rv9s", "created_utc": 1597152705.0, "score": 26, "upvote_ratio": 0.93, "num_comments": 10, "comments": [{"body": "Fuck investment banks, especially MS. Retard yolos all the way.", "score": 9, "replies": []}, {"body": "Dude Russia has a fake vaccine lmao that’s what I’m focused on", "score": 15, "replies": [{"body": "I'm taking the Russian vaccine the same way as my tech calls... up the ass", "score": 4, "replies": []}]}, {"body": "I like pussy and titties", "score": 5, "replies": []}, {"body": "Dear Diary Nonsense, OP send this into readers digest or cosmo.", "score": 5, "replies": [{"body": "Lol", "score": 1, "replies": []}]}, {"body": "That’s really not that different from a normal IPO... VIP investors get invited to tour sites / labs / product demos and such all the time. Management / boards / Sponsors push back on valuations all the time. CEOs have their own style / jeans that becomes part of their ‘brand’ \n\nNothing here.", "score": 3, "replies": [{"body": "Of course there isn't, but to a liberal artiste like the guy posting it, it seemed totally out of the ordinary.", "score": 1, "replies": []}]}, {"body": "Rocket started at 18 and was up to 25", "score": 1, "replies": []}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}
{"title": "The way to keep RH nice, tidy and green...", "selftext": "I just sell everything that’s red, and buy back immediately. Starts off green right away - works 100% of the time!\n\nPRPL, SLV, TSLA calls for you down. SELL. Then buy back and prepare to enjoy a nice green portfolio.\n\nOnly works with, when your wife’s boyfriend gives you a weekly allowance :)", "id": "i7snot", "created_utc": 1597155593.0, "score": 113, "upvote_ratio": 0.92, "num_comments": 18, "comments": [{"body": "who are you so wise in the ways of trading?", "score": 42, "replies": []}, {"body": "Wait I sold my red stuff and bought it again and it's already red again help what did I do wrong", "score": 30, "replies": [{"body": "Just rinse and repeat. I tell you - this cannot fail!", "score": 19, "replies": [{"body": "I rinsed and repeated but now robinhood won’t let me buy anymore stocks", "score": 10, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "just missing the free share achievement I need it now", "score": 2, "replies": []}]}]}]}]}, {"body": "remember if you buy at 100 and sell at 80 then buy at 80 and sell at 100 you would’ve lost only 20% but then earned 25%", "score": 16, "replies": [{"body": "That's big brain", "score": 3, "replies": []}]}, {"body": "I see you work in IT", "score": 1, "replies": []}, {"body": "Omg it works thanks a lot", "score": 1, "replies": []}, {"body": "Damn, appreciate the hot tip. I’m having a red day, but not for long!", "score": 1, "replies": []}, {"body": "I actually cut my losses on some shit and made about half of it back 🗣🗣. Goes down as a Green Day for me", "score": 1, "replies": []}, {"body": "My wifes boyfriend is an ISIS commander hes super busy", "score": 1, "replies": []}, {"body": "Except now you can’t write off your losses", "score": 1, "replies": []}, {"body": "Has this money glitch been patched yet??", "score": 1, "replies": [{"body": "Still works - plan to execute on this first thing tomorrow morning", "score": 1, "replies": []}]}, {"body": "I do not recommend doing this there's a few reasons why (whitewashing for one)", "score": 1, "replies": []}, {"body": "Turn on color accessible that works too it turns the red to pink lol", "score": 1, "replies": []}, {"body": "Terrible, if I was your dad id be ashamed.", "score": 0, "replies": []}]}
{"title": "Rotation is temporary", "selftext": "So Every good news in NASDAQ is sold off.. Tech is going down rotation, bla bla... I have been hearing this since last week.. that Covid has peaked and after 20 days was the peak of cyclical stocks.   So Covid is no more. Or is it? \n\nThis is US tests per day. Peak July 24th.\n\nhttps://preview.redd.it/ro896q3fbeg51.png?width=995&format=png&auto=webp&s=6e4b243c29caca1657579587cd417501e6b6100e\n\nand this is Total cases per day. peak July 24th. very conveniently as the number of tests went down number of cases went down too.. interesting? must be Trump's  TREMENDOUS intelligence winning COVID BIGLY .\n\n&#x200B;\n\nhttps://preview.redd.it/xjskjcznbeg51.png?width=932&format=png&auto=webp&s=4f76940d819a2549b967bd4265db09cb30c07256\n\nRemember when Trump said that america is seeing high number of cases because they are testing too much, yeah right. He found a way to fix this. Just be careful when you FOMO into IVR, AAL, cuz this shit has definitely not peaked. Tho a lot of retard are being played right now, stick with quality and SLV of course :D \n\nGodspeed you retard.  \n\nPositions (Bag-holding) :  PTON, ATVI, HUYA, ROKU, SLV", "id": "i7ujfe", "created_utc": 1597162251.0, "score": 14, "upvote_ratio": 0.76, "num_comments": 18, "comments": [{"body": "a month ago people were screaming about the same thing\n\nunless people start dying in the streets due to lack of hospital beds, nothing will change", "score": 31, "replies": []}, {"body": "Perfect day to double down on SLV", "score": 15, "replies": [{"body": "get some further out tho.. Like Nov or smth.", "score": 2, "replies": [{"body": "I have jan 2021 so i might pick up more today", "score": 5, "replies": []}]}]}, {"body": "The drip is forever.", "score": 3, "replies": []}, {"body": "Bag holding roku.. making me feel better. Good luck! Love roku as a company but as an investment theyre too reliant on tlc for me. Praying your speculation on tech sector return proves true", "score": 2, "replies": []}, {"body": "We are so far from peaking.  You realize this is still the first wave?   \n\nWe will go X steps up and a percentage of that back down, then we will go up further...\n\nWhen the cold weather hits and those idiots are partying INSIDE instead of at the beach, we will see the big wave.", "score": 2, "replies": [{"body": "tbh we just gotta go for herd immunity at this point, what are we even doing anymore", "score": 1, "replies": []}]}, {"body": "Nice mix of vintage COVID crash and new meme bags you’ve got there.", "score": 2, "replies": [{"body": "U wont believe but i also have MSFT 220 18.09.20", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "The travel industry pumps and techs are beaten down today by a Russian vaccine news, LMAO", "score": 7, "replies": []}]}, {"body": "Ya I’m not buying that ‘rotation’ crap. But I am buying it because it’s a dip. That ATH wasn’t ridiculous enough for my liking. I don’t think it’s over. Apple will still do buybacks, airlines probably won’t. I agree stick with quality.", "score": 3, "replies": []}, {"body": "Buy gold gold miners treasuries and tech!!!!!!! Get me in!!!", "score": 2, "replies": []}, {"body": "SLV is not quality.", "score": 2, "replies": [{"body": "didnt say it is.", "score": 1, "replies": []}]}, {"body": "The percentage of positives also went down. So the decrease in covid numbers is actually due to an improvement.", "score": 1, "replies": [{"body": "anybody who still believes the narrative being spewed on the news of numbers of cases/deaths deserves to be dead themselves .  even beyond wsb level retardism.  if u think covid is anything other then a politically motivated tool being used in the election , again , u deserve to die .", "score": 0, "replies": [{"body": "It is not clear what view you actually support", "score": 2, "replies": []}]}]}]}
{"title": "What’s the latest Bet on Tik Tak?", "selftext": "Now let’s say Vlad Putin has a vaccine up his sleeve, tech will stall at best. It a Kit Kat still a desirable  purchase for Microsoft and Twitter? \n\nWhy buy at the high? Now they have some room for negotiation.", "id": "i7x13e", "created_utc": 1597170127.0, "score": 2, "upvote_ratio": 0.58, "num_comments": 10, "comments": [{"body": "idk about them nik nak", "score": 10, "replies": []}, {"body": "I bet msft/thik thot deal goes through", "score": 4, "replies": []}, {"body": "I bought SLV puts because I thought Tik Tok was going to be banned.\n\nI guess it worked out.", "score": 4, "replies": [{"body": "I have been hoarding ammo and dry goods in case of the Tik Tok ban.", "score": 2, "replies": [{"body": "A Tik Tok ban riot would make BLM protests look like a Charlie Chapel film", "score": 1, "replies": []}]}]}, {"body": "Nah tik tak will be old news in like 1 year. Put your money in shake shack.", "score": 3, "replies": []}, {"body": "Tok tok, the shit that UAE peddled to spy on it’s citizens.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Fuck off", "score": -3, "replies": [{"body": "Sir you are arguing with a bot", "score": 4, "replies": [{"body": "Then he belongs here.", "score": 3, "replies": []}]}]}]}]}
{"title": "JPM is the only thing that didn't bleed for me today.", "selftext": "[deleted]", "id": "i7x6k0", "created_utc": 1597170604.0, "score": 19, "upvote_ratio": 0.84, "num_comments": 16, "comments": [{"body": "I’m losing so much money today holy hell. Wtf happen", "score": 12, "replies": [{"body": "\"Market rotation\"\n\nDon't you watch CNBC?\n\nHahahaha!", "score": 16, "replies": [{"body": "I bail on the last rotation and regret locking in my loss.", "score": 5, "replies": []}]}, {"body": "I lost 2 dollars :(", "score": 1, "replies": []}, {"body": "Market isn’t even red yet jesus", "score": 1, "replies": []}]}, {"body": "Ironically, they caused that SLV dump.", "score": 5, "replies": []}, {"body": "J P Morgan chase\n\nJ P Morgan chase\n\nJ P Morgan chase", "score": 4, "replies": []}, {"body": "cashed out jpm at peak today, bought at open yesterday, will buy back in at 100 if we get there", "score": 3, "replies": [{"body": "that is the plan", "score": 5, "replies": [{"body": "plan executed", "score": 2, "replies": []}]}]}, {"body": "Haha my BAC kept me green. I liquidated everything just an hr before the dump and now 100% cash.  \n\nThank you random dude with the GLD SPX correlation post. Made me paranoid as fuck", "score": 1, "replies": [{"body": "I’m diamondhands-ing BAC... telling myself that if shit crashes I’ll just keep holding until the world recovers.... too big to fail right?", "score": 1, "replies": []}]}, {"body": "Dave and busters is up for me, they are holding strong. Holding till January baby!!!", "score": 1, "replies": []}, {"body": "What a coincidence the only bank that’s been caught price manipulating silver within the past year is the only stock doing well the day silver crashes", "score": 1, "replies": []}, {"body": "Despite my username I dont know why banks held their ground. Maybe sector rotation. Tech got hit hardest. Maybe banks will drop later.", "score": 1, "replies": []}, {"body": "Bleed bitch bleed", "score": 1, "replies": []}]}
{"title": "BYND will eat your souls", "selftext": "Macho men like my wife's boyfriend, think real men eat only steak, drink whisky, and say things like \"hey buddy, don't drink soy, it will  turn you into an even bigger cuck. Just trying to help you buddy!\"\n\nOld wall street money thinks such a stock is an insult to them. Like TESLA was supposed never going to  work because nobody wants an electric car that doesn't go vrrroooooooom and gives you no reason to stop at a dirty gas station for a quick visit at the gloryholes.\n\nThe truth is, Beyond Meat is not targeting vegetarians. It is targeting meat eaters who want more ethical, environmental friendly, healthier food. And they succeeded. The younger generations absolutely love it, the older generation doesn't understand it.\n\nSo with every old man dying, BYND loses an enemy. With every new baby born, BYND gains a future supporter.\n\n&#x200B;\n\nTLDR: Bynd DD. Bynd grows stronger by eating the souls of dying old men. Turning them into delicious soul meat.", "id": "i7y0vn", "created_utc": 1597173219.0, "score": 11, "upvote_ratio": 0.66, "num_comments": 14, "comments": [{"body": "I'll eat old man meat", "score": 21, "replies": [{"body": "Wait. Shit.", "score": 13, "replies": []}, {"body": "I thought most of ya’ll are autists only and not freaks!", "score": 2, "replies": []}, {"body": "I'd too. Hopefully my retirement home will offer it.", "score": 1, "replies": []}]}, {"body": "This is not DD. And while I agree, this post is shit.", "score": 10, "replies": [{"body": "stonks", "score": 0, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/LongSatan don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "young people are retarded beta males. carnivore is the way to go.", "score": 1, "replies": []}, {"body": "targeting meat eaters who...want to eat gross ass tasting plant burgers? You mean people that were already gay veggies", "score": 1, "replies": []}, {"body": "Eat the vegans.", "score": 1, "replies": []}, {"body": "I'd rather eat cow than meat-looking goop that is as healthy for you as a bag of doritos.", "score": 1, "replies": []}, {"body": "I enjoy killing cows and grinding them up into burgers. That fake meat shit is for the fucking birds. But then again, this nation has turned into a bunch of retards. Shit shouldn't even be sold in the meat section. Gah.", "score": -2, "replies": []}]}
{"title": "Tsla 5-1 stock split", "selftext": "[removed]", "id": "i8098y", "created_utc": 1597180389.0, "score": 23, "upvote_ratio": 0.81, "num_comments": 15, "comments": [{"body": "Im not fucking you bro\n\nBan, and Gay. But neat\n\nSo this is what the analysts saying “TSLA $300” meant", "score": 16, "replies": []}, {"body": "What's a reasonable price to expect the stock to reach by the end of the week ?", "score": 8, "replies": [{"body": "420 = 2100", "score": -2, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "Woosh", "score": -4, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Talk dirty to him", "score": 3, "replies": [{"body": " Curious cause I bought a call around 1370$ today on a whim and I have no idea when to take the gains", "score": 1, "replies": []}]}, {"body": "How the fuck am i supposed to predict tesla price, of all stock seriously and why the fuck would you value my opinion anyway. Thats a bullish news but im not retarded enough to tell you its gonna hit x or y.\n\nCongrats if you are already holding positions tho.", "score": 0, "replies": [{"body": "Just looking for an estimate to gauge my exit point not looking for a definate # here. But I understand.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Fuck yeah. Tsla will run back up to 1000 after split guaranteed. I will be loading up on them FDs.", "score": 7, "replies": []}, {"body": "🚀? 🧐", "score": 6, "replies": [{"body": "Yes most definitely", "score": 5, "replies": []}]}, {"body": "\\#MOON", "score": 4, "replies": []}, {"body": "Tsla puts if you're interested in giving me money", "score": 1, "replies": []}, {"body": "It’s going to be a entanglement.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "why you being racist towards pigs?", "score": -4, "replies": []}]}]}
{"title": "My dad just called and told me to buy tesla puts.", "selftext": "[removed]", "id": "i81thd", "created_utc": 1597185443.0, "score": 5, "upvote_ratio": 0.63, "num_comments": 11, "comments": [{"body": "Should I inverse this and buy calls", "score": 28, "replies": [{"body": "A bull autist i see", "score": 6, "replies": []}, {"body": "This is the way.", "score": 4, "replies": [{"body": "This is the way", "score": 3, "replies": []}]}, {"body": "1800C 9/11 funding secured", "score": 3, "replies": []}]}, {"body": "nobody believes you have a gf", "score": 17, "replies": []}, {"body": "You were at your bfs house sucking his dick when his bf texted you what?", "score": 15, "replies": [{"body": "No, i was taking it up the butt", "score": 5, "replies": []}]}, {"body": "OP's girlfriend prefers the gender neutral bathrooms to fit her mood.", "score": 4, "replies": []}, {"body": "Well it’s up 5% AH", "score": 2, "replies": []}]}
{"title": "TSLA split?", "selftext": "[removed]", "id": "i82r7n", "created_utc": 1597188779.0, "score": 2, "upvote_ratio": 0.75, "num_comments": 12, "comments": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Time to all in and make it back", "score": 1, "replies": []}, {"body": "So thats where my money came from.", "score": 1, "replies": []}]}, {"body": "Fuck me This is the top", "score": 5, "replies": []}, {"body": "No", "score": 3, "replies": []}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/yao97ming the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "let’s fucking go!!!!", "score": 2, "replies": []}, {"body": "This is a Tesla split post #37. \n\nP.S: don’t mind me, just like to keep track of everything.", "score": 2, "replies": [{"body": "Good bot", "score": 1, "replies": []}]}, {"body": "Time to dump your bags", "score": 1, "replies": []}, {"body": "IV is way too high lol", "score": 1, "replies": [{"body": "Bro stonks only goes up", "score": 1, "replies": []}]}, {"body": "What do you think IV will be tomorrow?", "score": 1, "replies": []}]}
