{"title": "Exiting iron condor", "selftext": "Hey all, looking for some advice on exiting a position. I’ve been selling iron condor weeklys with wide ranges to collect on theta decay. I closely monitor them and exit around 50% profit or exit for a small loss if it seems like the underlying will make a big move. \n\nI’ve done this on TSLA a couple times since it’s been relatively sideways the last couple weeks. \n\nYesterday I sold an IC on TSLA accidentally for the Jan 2021 expiry (1400/1410 put, 1600/1610 call) I realized my mistake and tried to exit the position but I couldn’t get filled. Thinkorswim says max loss will be around $550. It’s down about $1000 on daily changes. Not sure if I should just hold til expiry and write it off or try to sell the spreads individually or what. Any ideas?", "id": "i42ir1", "created_utc": 1596621490.0, "score": 60, "upvote_ratio": 0.91, "num_comments": 17, "comments": [{"body": "With LEAPS the bid/ask is typically wide.  This makes for unreliable price quotes.  Your trade had a max loss of the difference in the strikes minus the credit you recieved.  If you see a quote with a larger loss, it's just a bid ask thing unless you actually agree to trade for that larger loss.\n\nAs far as should you unwind the position, I think you should.  Who the F knows what TSLA will look like in 5 months bt it probably won't still be in the same price range then.  That insures a max loss to your IC.  I'd set a limit order of around what you got in for.  Chances are someone will eventually let you out.\n\nYou mention you're doing these ICs with a \"wide range\".  Be careful not to go too wide.   It might feel safe to have a 95% probability of profit but when a trade like that goes against you the loss is disproportionate to the potential gain.   My personal limit is about .10 deltas.  I usually aim for more like .16 in an IC trade.", "score": 29, "replies": [{"body": "Thanks for the advice. What’s the typical max loss to max profit ratio you see on your IC’s? Mine are usually around 2:1 loss to profit.\n\nAlso do you think it makes more sense to set the limit orders for the whole IC or set a limit order for each spread around break even?", "score": 2, "replies": [{"body": "You'll probably get out sooner if you close the two spreads (call and put) separately.\n\nMy IC's are more like ~4:1.  TSLA is an unusually volatile stock so I can see why your ration looks better.  I normally wouldn't think about a range bound trade like an IC on a stock like TSLA.   I know higher IV is better to sell but there's a point were it's to much.    As an analogy, icing on a cake is nice buy a cake that's mostly icing would be grose.", "score": 7, "replies": [{"body": "That’s good advice. I think the high IV, credits and high volume attracted me since it’s been range bound for a couple weeks but that could easily change in an hour. \n\nWhich stocks or types of stocks are you usually doing IC on?", "score": 1, "replies": [{"body": "I prefer IC as well - glad to hear I am not the only one that made a mistake like that before too.  Have you ever put on an Iron Butterfly?  Every time I try a fly my target is so small that I never have made any real money.  Anyone else prefer fly over condor?", "score": 1, "replies": []}, {"body": "Indexes.  SPY or SPX.  I traded RUT a lot in the past.  RUT is a little more spicy than SPX.", "score": 1, "replies": []}]}]}]}, {"body": "I was actually going to ask this question as a seperate post but I'll ask it here instead.  I sometimes see Iron Condors that have zero potential losses when sold.  So for example if I sold an IC and got $1 in premium and the width of my wings was $1.  Is this legit? What am I missing?", "score": 2, "replies": [{"body": "When you see a \"can't lose\" trade it's usually an illusion.  If the underlying stock in question has thinly traded options, the bids and asks can get wide.  Wide doesn't mean they're evenly distributed around a reasonable value.  For example the bid could be .10 and the ask 1.25.  Most trade software would assume the mid price of .67.  In reality it could just be a low bid and the market would really trade for more like 1.10.  Or with the same bid/ask the tradable price for the option could be .20.\n\nAnother check for a lossless trade is to ask yourself who would be on the other side, taking a trade that can't be won?", "score": 3, "replies": [{"body": "I guess for your last point it depends on how the trade goes through.  It’s four seperate trades.  Does an iron condor have to be bought by one party? Or can four seperate parties buy the four seperate parts of the IC? If the latter is the case you could have a situation where you have a lossless iron condor because each party is buying or selling their component of the trade so it could add up to greater than the potential loss.  Or am I missing something still?", "score": 1, "replies": []}]}, {"body": "What where at? :) Seems like it’s deep in the money if it’s only $1.", "score": 1, "replies": [{"body": "Kodk today at 14-15-16-17 was at $1 for weeklies in September for awhile today.  Range was .22-1.15", "score": 1, "replies": [{"body": "What the other commenter said, it’s an illusion. The spread is so wide that the midpoint coincidentally falls in at $1.00 but you’ll probably never get it filled.", "score": 1, "replies": []}]}]}]}, {"body": "True about LEAPS, but this isn't one by definition. Yeah, TSLA will at some point undoubtedly blow through either side of that condor. \n\nMaybe a less popular idea would be to buy vertical spreads on either side of the condor.", "score": 2, "replies": [{"body": "it seems people are doing just this - the vertical spread is always harder to maintain though", "score": 1, "replies": [{"body": "It's the same thing.", "score": 2, "replies": []}]}]}]}, {"body": "Update on this: I’m a lucky autist. I set a limit buy for break even and it executed immediately at market open for a $2k profit. Thanks TDA", "score": 30, "replies": [{"body": "Wrong sub", "score": -2, "replies": []}]}]}
{"title": "Trading VIX", "selftext": "[deleted]", "id": "i4392s", "created_utc": 1596625260.0, "score": 1, "upvote_ratio": 0.67, "num_comments": 16, "comments": [{"body": "Chart is spot vix and mark is the current vix futures value", "score": 4, "replies": [{"body": "Ok, I kind of understand that. Is there a ticker I can use to see the futures values?", "score": 1, "replies": [{"body": "/VX", "score": 2, "replies": [{"body": "Thanks", "score": 1, "replies": []}]}]}, {"body": "So for clarity, if I were to hold until expiration, at that point it’s the spot price that matters on exp day, right or no?", "score": 1, "replies": [{"body": "No. On expiration day at market open there’s a settlement price calculated after ten minutes. It is separate and calculated differently from spot price.\n\nEdit: you can see the settlement price in TOS under the ticker VRO", "score": 1, "replies": [{"body": "Ahh... thanks.  Seems like the VIX options should be listed under “VRO”.", "score": 1, "replies": []}]}]}]}, {"body": "Vix futures", "score": 2, "replies": []}, {"body": "I'm gonna recommend NOT buying calls on the vix right now, but that's just me", "score": 2, "replies": [{"body": "So I’m buying for October and November. It’s currently lower than it’s been since the corona crash so that’s why I’m buying now. I figure just prior to election markets just might get excited again.  If Biden wins, November ought to see some high Vix as well.", "score": 4, "replies": [{"body": "Selling puts might be a better strategy if you think volatility will rise", "score": 1, "replies": [{"body": "Selling Vix puts isn’t for me. I like selling puts on stocks I like, so if I get assigned I’m left with shares I can sit on. If I’m wrong about Vix, I just lose money and have nothing to sit on.\n\nEdit:  and I like the idea of unlimited gains you get with a long call on something like vix because it’s within the realm of possibility for it to go back to 80.  The risk/reward doesn’t add up for me to sell puts on Vix.", "score": 3, "replies": []}]}]}]}, {"body": "vix is by default a future? how much is one \"unit\" of value then (because it's not traded in $)? \n\nhttps://www.reddit.com/r/wallstreetbets/comments/fb0ex9/how_i_almost_went_26k_in_debt_over_my_first_1/\n\ncan someone explain what happened here?", "score": 1, "replies": [{"body": "Looks like this fella didn’t know that options contracts cost you the price of the contract x 100.", "score": 1, "replies": [{"body": "oh yeah, i thought he meant 1 contract :)", "score": 1, "replies": []}]}]}, {"body": "Care to add imgur screenshot?", "score": 1, "replies": []}]}
{"title": "It aint much but its honest work....", "selftext": "Follow up from the kid with the TD ameritrade 13 hours options course...\n\nThe still decided to reject me for spreads, so i moved to tastyworks...\n\nI still keep 500 bucks in TD so I can use their stock scanner and superior charting, but I do all my spreads in Tastyworks....\n\nJust made 40% gain on a Visa Debit Spread. Kind upset I put the max gain at only 40%, as my short call was not that far OTM. But its my first spread so thats fun.... Correct me if i am wrong, but I usually think of Iron Condors being poorly capital efficient. For instance, if you get a credit of 10 dollars, but need to put away 100 dollars in margin, and you get to keep all your credit, you only made 10%, cause you had to spend 100 dollars in margin, that cant be invested in options, only static stonks. Plus, the 10% of the time your wrong, they will go after that stuff..... Invested around 480 dolllars, closed at a 238 dollar profit. Or something like that.\n\nMade the trade yesterday, closed today. Also, It took so long to get me to fill the close order. I then decided to lower it by 5 cents and it filled instantly, but the ppl saying lower by like 1 or 2 cents didnt do anything, and the default limit price that i first sent, never filled after 20 minutes. I was getting pretty stressed lol, that it wasnt filling haha.\n\n&#x200B;\n\nSo far my track record is ok i guess. I have a long call in INTC expring in January, thats made like 10%, lol it was way to safe of a pick. I should have picked a bit more OTM strike. I spent 100 dollars in STNG call option that is down like 30 bucks on. Good thing i didnt throw more into STNG but it was more of an experiment. Oh and rememeber to have diamond hands. I sold the Microsoft call option I owned before the tik tok stuff, didnt break the news yet bause It was dropping, for a break even. If i held it, i would be doing pretty well. :(\n\n&#x200B;\n\nhttps://preview.redd.it/wy7hbiecn7f51.png?width=1052&format=png&auto=webp&s=5f91874efdcf35c39266c3a79df0f63195c008de", "id": "i48i7z", "created_utc": 1596644895.0, "score": 1, "upvote_ratio": 0.56, "num_comments": 10, "comments": [{"body": "Stay within one's comfort zone. I have a number of calls out from March- April speculating that pandemic will be over by the expiration of these contracts of 2020 year end. All past pandemics disappears after isolation. But this is not the case.  Except just closed a call after MSFT after Tiktok, the rest amounts to wrong assumption and will lose less and small wins.", "score": 3, "replies": []}, {"body": "You mention that iron condors are not capital efficient... Compared to single option trades they are loads efficient and the alternative spreads, debits really, are only more efficient if the probability of profit is low enough. Don't get greed y", "score": 1, "replies": []}, {"body": "Do any platforms let you trade spreads without margin ? Rather just have cash account", "score": 1, "replies": [{"body": "I traded Credit and Debit Spreads on Robinhood with a cash account.", "score": 2, "replies": []}, {"body": "no. You must have margin. A credit spread implies trading on margin. And they are all lumped together with debit spreads, so yes, you must have margin....\n\n&#x200B;\n\nTastyworks gave me a margin acccount on 150 dollars. Not the 2 grand they say you need. So dont worry just apply.", "score": 1, "replies": [{"body": "What about debit spreads", "score": 1, "replies": [{"body": "There are 2 types of spreads....\n\nCredit: you are given money, as a credit, cause you are a net seller, so you get premium.\n\nDebit: you are a net buyer, so you pay premium, so its a debt, or debit.\n\nCredit spreads affect your options buying power as you now will have to pay out some margin if you get assigned and buy 100 shares or whatever... \n\nDebit spreads do not affect your buying power as you are a net buyer, and the long ITM will cover the short OTM. \n\nTo trade any spread type, debit or credit, you need a margin account, which is unfortunate as they should just make a distinction, but its because if someone decided to close out half of the spread, they would have unlimited losses, and hence need a margin account.", "score": 2, "replies": [{"body": "I knew that they were, but thanks for the explanation of why debit spreads need margin. Guess I’ll have to beg for an upgrade lol. I wonder if etrade will allow me to just do debit spreads and not make me reapply for level 3", "score": 1, "replies": [{"body": "dude move to tastyworks. I begged for TD like 10 times called them up emailed them all that BS. I did a 13 hour education course for options and still denied....\n\nMove to Tastyworks with 150 dollars deposited in my account, r/babystreetbets\n\nand was immediately approved for LEVEL 4 in 30 minutes.\n\nAlso, commisions are cheaper and capped at 13 dollars per leg. Example, buy 100 contracts, thats 100 x .65 = 65 bucks. But nope, you only pay 13 bucks cause its capped at 13. Not to mention closing trades are free. And tom snoffof is funny and love the show.\n\nI still keep my Thinkorswim open for the technicals, charting, and layout, cause tastyworks UI and features are garbage, and then i just execute the trade in tasty but do all the prep in think or swim.", "score": 1, "replies": []}, {"body": "Nope, they will force you to upgrade to level 3. Its not worth your time, I promise they wont allow. I tried to call up TD and ask for spreads but nope, wont budge... You know they haggled me over 20 cents once. You need 500 to get live data on your paper account and I had 498.80. Last year it was free, no 500 req. I literally said, ok so should I ach 25 cents into my account and they were like i know our rules seem a little bit fickle, like WTF does fickle even mean, I only heard that on a SAT test before lol.   Its because if you opened a debit and closed out half the debit spread, like kept the short option open, for whatever reason, not sure why you would want to, but you could, they would need a margin account as unlimited loss, So they will require a level 3 margin option level. \n************************************\nBut if you want to move to tastyworks, here is my referral link. I get 75 dollars if you sign up with it, and I believe you also get 75 dollars too. If you sign up and fund with 2 grand... If you do tastyworks, they will grant you level 4 approval right away. I got mine in 30 minutes. No obstacles at all, just say you have extensive knowledge in every check box and ask for a margin account. LVL 4 is Which allows naked contracts and spreads. \nhttps://start.tastyworks.com/#/login?referralCode=B2BCVB7Z8Y", "score": 1, "replies": []}]}]}]}]}]}]}
{"title": "TDAmertrade Nickel Buyback", "selftext": "Sold some DIS Puts, trying to close for $0.01 but it keeps trying to charge a commission. I have 9 contracts, and its only $5.85, but every dollar counts right.\n\nHas anyone dealt with this? This is the first time I've seen it. Just went to Margin as well if that makes a difference.", "id": "i49mrv", "created_utc": 1596648411.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 11, "comments": [{"body": "All I’m reading from the headline is Nickelback. Somewhere Chad Kroeger is smiling.", "score": 6, "replies": [{"body": "Look at this photograph!", "score": 3, "replies": []}]}, {"body": "It shows a commission on the order confirmation page but once you execute the order no commission is actually charged. Just went through this this morning, also buying back some Puts in DIS for $0.01.", "score": 3, "replies": [{"body": "Awesome, thanks. I had the order open all day and no close. Kept seeing the Last X at $0.01 too...I was at the $111 strike. IV has been falling everywhere the last few days, so I'm not too disappointed in missing out. Try again tomorrow.", "score": 2, "replies": []}]}, {"body": "i've heard that if you're high volume, a call can adjust the commission... but i've sorta left it alone as a reminder to think about what i'm doing", "score": 2, "replies": []}, {"body": "Why don't you just let the  expire worthless? Gets cleaned out and should not show up on Monday.", "score": 2, "replies": [{"body": "Open up a new position.", "score": 2, "replies": [{"body": "Ahh, that's true, to free up buying power.\n\nUsually you have to put $0.01/0.05.", "score": 3, "replies": []}]}]}, {"body": "Why would you think it would be commission free?", "score": 1, "replies": [{"body": "TDAmeritrade is $0.65/contract to open, and $0.00/contract if you are closing a Short Option for $0.05 or less.", "score": 2, "replies": [{"body": "Thank you! I never noticed this.", "score": 2, "replies": []}]}]}]}
{"title": "Can I buy new shares of a stock for my covered calls?", "selftext": "I wrote some covered calls on AAPL a few months ago, and now I'm past my strike price.  The cost basis of the shares is really low.\n\nIf I have long term capital gains for 2020, can I buy new shares of AAPL at the market price today, and sell them at my covered call price for a loss, and offset my LT capital gains with the ST loss?\n\nDo the shares I sell have to be owned before I wrote the calls?", "id": "i49oo4", "created_utc": 1596648578.0, "score": 1, "upvote_ratio": 0.67, "num_comments": 13, "comments": [{"body": "You could just buy back the calls. That’d be the simplest way probably. \n\nYou could also check with your broker to see if you could specify the lot you’re selling and/or see if it’s set for last in, first out for cost basis accounting.", "score": 5, "replies": []}, {"body": "This would be an excellent question for a broker lol, and not reddit.", "score": 5, "replies": [{"body": "haha..I know.  I have a call with my CPA to discuss this week.", "score": 0, "replies": []}]}, {"body": "Lots of information is missing. Expiration date? Number of shares and number of calls? Strike?\n\nAssuming a near term expiration, like this Friday, and all shares are covered by calls, e.g., 300 shares and 3 short calls, and a strike like $400, you absolutely can buy more shares and do whatever you want with those shares.\n\nHowever, why would you purposely sell for a loss? That's nuts, not to mention a wash sale. Your covered calls are already showing a loss (assuming my assumptions are correct), why not just close those and get your short term loss that way? Actually, that might count as a wash sale also, if you rewrite more CCs.\n\nI don't think you can make the tax play you are imagining unless you stop writing covered calls on the shares for at least 31 days.", "score": 2, "replies": [{"body": "EDIT:  I think I realize my mistake.  I would still lose 300k since I sell the shares for less than what I paid.  Guess what they say is true...only thing guaranteed is death and taxes.\n\nThe backstory.  So I sold 30 contracts of AAPL set to sell Nov 10 at a strike of 300 a few months ago.  They are European style so I can't get called beforehand.  I have about 700k in capital gains this year, from sales I did before the pandemic, this will cost roughly $300k in taxes (state and federal).\n\nI can unwind the covered call right now for about 430k but that loss doesn't go against my taxes since the original options position was a collar and considered a tax straddle.\n\nMy thought was to buy the shares today, sell them for 300 (covered call price) and take a 400k loss.  Since I have 700k in capital gain already, I would be left with a 300k capital gain, which would lower my taxes owed to about 75k.  I save about 225k in taxes, plus a couple thousand in dividend payments.\n\nMy CPA and I have a call this week to discuss, but I was wondering if it's even possible or if there's a better way.\n\nThis way I save money in taxes and keep the lower cost basis shares.", "score": 1, "replies": [{"body": "> I can unwind the covered call right now for about 430k but that loss doesn't go against my taxes since the original options position was a collar and considered a tax straddle.\n\nOkay, that's definitely an important detail.\n\n> My thought was to buy the shares today, sell them for 300 (covered call price) and take a 400k loss. \n\nHow exactly would you sell them for $300 when AAPL is going for 439? And even if you could, the loss would be a wash sale. \n\n> My thought was to buy the shares today, sell them for 300 (covered call price) and take a 400k loss. Since I have 700k in capital gain already, I would be left with a 300k capital gain, which would lower my taxes owed to about 75k.\n\nThis is the logic that doesn't make sense to me. Without doing anything, you have a 300k tax liability. So you propose to lose 400k to reduce a 300k tax liability?", "score": 1, "replies": [{"body": "It's not really clear, but from what I can decipher, he already has a 700k gain.  He's saying that if he closes the short calls now, the resulting loss can't be offset against that 700k gain (that doesn't sound right, I'd bet against it being the case).\n\nSo, he wants to buy shares now at 440, deliver those shares to the option holder at 300 at expiration/assignment, then use that resulting loss to offset the 700k gain.\n\nI think.", "score": 1, "replies": [{"body": "Yes you have it right.  I’m meeting with my personal cpa about the tax straddle.  My brokers tax specialist said it was a tax straddle and the loss couldn’t be realized until the entire position was disposed.\n\nAlthough I realized my mistake.   I would spend 1.3m to buy the shares and collect about 900k.  So even if I save 225k I still lose 400 on the capital, so net net I’m down 175.", "score": 2, "replies": [{"body": "> so net net I’m down 175.\n\nYes, that was the part that didn't make sense to me.", "score": 1, "replies": []}]}]}]}, {"body": "You want to buy new shares now, at 440, to be delivered to the call option holder at expiration for 300, and use the loss to offset other gains you already have?\n\nThat's an interesting one.  You'd need to check with your broker to see if you can designate particular stock lots to be used for the assignment.  Are you sure about that \"tax straddle\" loss not being able to be offset?", "score": 1, "replies": []}]}]}, {"body": "how about just keep selling short term puts until you get assigned?  then u have the shares to deliver?  and then you can write another set of  calls on your new aapl stocks.", "score": 1, "replies": [{"body": "I have the shares to deliver now.   I thought about short term puts but do I stay close to the money or go otm?", "score": 1, "replies": [{"body": "I would sell puts very close to the strike ATM.  and do it on a big red day so the premiums are juicier.", "score": 1, "replies": []}]}]}]}
{"title": "Trading for life? How have stocks impacted your life ?", "selftext": "I’ve only been trading since early April like many people thanks to corona. I missed out of some good buys that my experienced trade buddy’s got into like MFA in the .20 range and airlines when they were single digits and a whole ton of other stuff. I have also made some good cash, up 133% over all. Used my gains to pay off credit card debts and treat my family to some well deserved birthday dinners and gifts. Now my current goals are getting those fat gains so I can help fast track a new truck and fishing boat. I spend a ton of time looking at stocks making small swing trades and finding worthy long term investments. I spend most of my time on the 1cent stocks and swing trading. I’ll hold stuff for a few weeks and then move on. Probably going to hold BA and SPR from here on though. \n\nWondering how all the other new traders are feeling and if you genuinely think you will stick with it. What about the long time traders, have you guys made some big gains that have significantly impacted your life?", "id": "i3v7zk", "created_utc": 1596587100.0, "score": 6, "upvote_ratio": 0.88, "num_comments": 14, "comments": [{"body": "Made me spend a lot of time staring at my Robinhood account during work", "score": 13, "replies": []}, {"body": "Invested / traded for 7+ years now. \n\nNever had any gains that were consistent. Win some lose some (a lot). \n\nThe only account that’s been successful is my retirement. This year more than ever. \n\nI’ve gotten a real pulse on market sentiment but individual stocks are still tough. \n\nAs the lessons have piled up, I’ve saved myself from a lot of losses. Gains are getting somewhat more consistent, I do feel at this point I’m close to getting a pulse on individual stocks. \n\nJust remember, any time you think you have the key, the market will change the lock. Don’t get cocky with wins. Sure fire way to lose them.", "score": 7, "replies": [{"body": ">Never had any gains that were consistent. Win some lose some (a lot).\n\nThis is the reality for most. Some people think just cause they made 2k in a month that it is gonna be like that forever. I started trading around q3 of 2018 with little knowledge. Started with 4k, got to 9k in 2019, then 17k, then down to 8k, and now here I am mid 2020 with 13k. Overall, there will be profit if you are smart and patient and learn fron your losses, but dont think this is a smooth ride up. Hopefully il surpass the 17k mark I was at before.", "score": 3, "replies": [{"body": "Yes. Key is to learn from the mistakes but also not make them into solid rules. Have to have a quantum brain for this stuff, because what didn’t work yesterday can certainly work tmrw in the market. \n\nMy retirement keeps going up as it’s a steady play, all my other one offs fail by literally a week. \n\nI was bullish oil all July, had a false breakout, now after my calls expired it holds a breakout. Everytime. \n\nThat’s the most frustrating thing. I’ll be right, but market will make sure the timing is always off. Always.", "score": 1, "replies": []}]}, {"body": "Good advice at the end there. That’s when you say “don’t get cute”. That’s when you lose it all", "score": 2, "replies": []}, {"body": "What does your portfolio look like now? Specifically, are you more focused on etfs and “safer” plays or do you hold individuals", "score": 1, "replies": [{"body": "I have a few indices. \n\nMostly mid cap based along with small caps. Balance of SPY and tech. \n\nThe rest are bonds (5%) right now. I’ll flip between bonds and stocks when I feel a top or bottom are in. \n\nThe margin I play on options. (1%)", "score": 2, "replies": []}]}]}, {"body": "Well, my general sleep schedule is the exact time the stock market is open, so I haven't slept in months.", "score": 2, "replies": []}, {"body": "I started investing in 2015 and trading in 2017. I used one of my long term investments to pay off debt and a trade I did in 2018 (shorted Ebay) to pay for a place where I have always wanted to live.\n\nHonestly other than that I'm just sitting on everything, since I never leave my apartment. So that's probably the only two trades that impacted my life in a major way.", "score": 2, "replies": []}, {"body": "Made about 3k in swing trading in April and May before I barreled my entire 95k IRA savings into the market in long term investments. Pattern trading just got exhausting overtime. Now I can breathe", "score": 1, "replies": []}, {"body": "Well I lost 6k. But for real, long term I think it will be great", "score": 1, "replies": []}, {"body": "I am contributing to Roche's pharmaceutical earnings swallowing valiums (diazepam) like they're munchies", "score": 1, "replies": []}, {"body": "I hit refresh on my browser more than ever.", "score": 1, "replies": []}, {"body": "A rising stock market is usually associated with a growing economy and leads to greater investor confidence. So it did for me.", "score": 1, "replies": []}]}
{"title": "Should I invest into Pfizer pharmaceutical (PFE) Any feedback is appreciated", "selftext": "I’ve been keeping my eye on the pharmaceutical empire for a while. About a week ago, Pfizer(PFE) began final stage testing for Corona virus. What are you thoughts on this? Should I buy? Any feedback is appreciated.\n[WSJ Article](https://www.google.com/amp/s/www.wsj.com/amp/articles/modernas-coronavirus-vaccine-begins-final-stage-testing-11595854440)", "id": "i3xzf9", "created_utc": 1596598274.0, "score": 8, "upvote_ratio": 0.83, "num_comments": 14, "comments": [{"body": "Cheap but you missed the dip\n\nIt was around $32 for a few days and jumped to $39 recently", "score": 10, "replies": []}, {"body": "I invested in PFE 2 months ago before they announced the possible covid19 vaccine.  Even without the vaccine, they’re a solid pharm choice. I like the yield, solid P/E, room to grow. It’s a slow moving stock that’s gotten some recent action. Long term, it seems to be a good bet. It makes up 5% of my portfolio with 150 shares.", "score": 8, "replies": []}, {"body": "I have been hoarding PFE for years. I paid $9 on the average. It pays about 4% dividend.", "score": 8, "replies": [{"body": "What year was that? Had to be 15+ years back?", "score": 6, "replies": [{"body": "Good quality stocks hold almost forever.", "score": 1, "replies": []}]}, {"body": "K", "score": 1, "replies": []}]}, {"body": "Sure, but stop chasing vaccine news. Those are pump and dumps", "score": 10, "replies": [{"body": "There's 5 ***Billion*** doses needed to extinguish this... *If* it's a single dose vaccine.( Early polio, early smallpox weren't) \n\nI'd agree there's lots of also-rans that *are* being hyped. And plenty are cross-partnering to get a slice of the competition's prospects.", "score": 5, "replies": [{"body": "But COVID will likely be a seasonal vaccine like the flu shot (which is a collection of 4 of the most likely coronaviruses each year). COVID will likely piggyback as the 5th in that yearly flu shot. This makes it much less profitable for investors.", "score": 1, "replies": [{"body": "It's lethality may justify a semiannual vaccine, then \n\nIt's been mutating rather quickly from what I've read. (struggles to find reference to several current strains)", "score": 1, "replies": [{"body": "It's not mutating rapidly it's just very wide spread so you see more mutations than  localized outbreak.", "score": 2, "replies": []}]}, {"body": "Flu is not a coronavirus", "score": 1, "replies": []}]}]}]}, {"body": "Pfizer has a German partner doing the development.. look there\n\nBiontech, I believe.", "score": 2, "replies": []}, {"body": "Average price target is 43$ i think so it has room to grow, but not by much :) i personally believe in PFE but they dont seem proned to big jumps. Still i would hold for some years 👍", "score": 2, "replies": []}]}
{"title": "Is it too late to buy AMD?", "selftext": "[deleted]", "id": "i3yn0o", "created_utc": 1596601130.0, "score": 5, "upvote_ratio": 0.67, "num_comments": 15, "comments": [{"body": "I would wait to buy AMD.", "score": 31, "replies": []}, {"body": "i'm waiting for a dip myself", "score": 16, "replies": [{"body": "Me too. They've had 3 massive pumps, but for their stock price to continue a healthy uptrend, its def needs a correction/pullback. But in this fake and gay bull market I could be dead wrong :/", "score": 6, "replies": []}]}, {"body": "I'm honestly looking into Intel after they dipped that hard. They still are dominant in their market.", "score": 3, "replies": [{"body": "Thinking of selling my 1 AMD share just to buy 2 Intels", "score": 1, "replies": [{"body": "2 stocks > 1 stock so only pRoFiT", "score": 2, "replies": []}]}]}, {"body": "Yes", "score": 4, "replies": []}, {"body": "I'm holding 65@ 45 avg. I'm going to buy more . Even it out to 100 but will wait for things to settle a bit.", "score": 3, "replies": []}, {"body": "$12 or $12,000?", "score": 0, "replies": []}, {"body": "If you are serious about using that $12K on AMD then I’d recommend learning how to sell puts options to reduce your cost basis. Warren Buffett himself has made a lot of money doing this on stocks he wants to own at a discount. I bought AMD at $55/share but thanks to put options my real cost basis is probably closer to $50 now.", "score": 0, "replies": [{"body": "But if the price continues to go up, by selling put options, he will further increase cost basis, no?", "score": 5, "replies": [{"body": "By selling a put option, he basically covers the put with cash, and if amd price goes down he is \"forced\" to buy it at the strike price. If it continues to go up, he never acquires the shares, but he does make money off the premium that he sold the put for. Selling a put is a very conservative vote of confidence in the stock price never falling below the strike price that you set, but if it does, you don't mind buying it because it's on a \"discount\" compared to when you made the contract.", "score": 1, "replies": [{"body": "I'm still confused. If you buy 100 shares at e.g. $80/ea, and sell 1 put contract for $2 (i.e. $200), and the share price goes down to $70, you will eventually need to close the options trade by a) liquidating your 100 shares at $70/ea (i.e. incur a $10/share loss) or b) buying back the contract a higher premium that you paid for. Correct?", "score": 1, "replies": [{"body": "It sounds like you are confused with selling calls vs. puts.  \nBasically it's like this:  \n  \nSell covered call: you put up 100 shares as a security/insurance, in the event that the strike price is reached and you need to sell those shares. Then you collect a premium for the selling the option.  \n  \nSell covered put: you put up the equivalent cash value of the strike price, in the event that the price of the stock is met, and you need to purchase the shares. Then you collect the premium for selling the option.  \n\nIn these scenarios you technically win when the option expires useless, or you buy back the option at a price lower than the premium you collected for selling it.  You \"lose\" when the strike price is met, and you have to honor your obligations on the option, however on these cases the loss is an \"acceptable\" loss (perhaps you still got a profit from selling the call/shares, or you were able to buy the stocks at what you consider a \"discount\").", "score": 2, "replies": []}]}]}]}]}, {"body": "Yes it’s to late for you. Sorrrry.", "score": -2, "replies": []}]}
{"title": "Tencent in talks to create $10billion straming giant, merging HUYA & DouYu", "selftext": " (Bloomberg) -- Tencent Holdings Ltd. is driving discussions to merge China’s biggest game-streaming platforms Huya Inc. and DouYu International Holdings Ltd., people familiar with the matter said, in a deal that would allow it to dominate the $3.4 billion arena.\n\nThe Chinese social media titan -- which owns a 37% stake in Huya and 38% of DouYu -- has been discussing such a merger with the duo over the past few months, although details have yet to be finalized, said the people, who asked not to be identified because discussions are private. Tencent is seeking to become the largest shareholder in the combined entity, one person said.\n\nA deal would create an online giant with more than 300 million users and a combined market value of $10 billion, cementing Tencent’s lead in Chinese games and social media. Faced with rising competition for advertisers from ByteDance Ltd. and its rapidly growing stable of apps, the WeChat operator would then run a highly profitable service akin to Amazon.com Inc.’s Twitch. Huya and DouYu would keep their respective platforms and branding while working more closely with Tencent’s own esports site eGame, said the people.\n\n[Article here.](https://finance.yahoo.com/news/tencent-talks-create-10-billion-063744220.html?guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAMCl0nhEoBc-c_UT4_f79K6rof_RNaCBBOPOnZrjQTB9ZFq9XnzNVvMqGSNEfQb9t38gY2srlnxzT8u_a6fHtrn7Am1ANT4dVGKuMK0P3xhgSz3OyIxLCxHnN81zANpiVxnYQ-ndliCj1U_ohcLY5E7DWHVLO3njnLoUEC0YHNFa&_guc_consent_skip=1596615965)\n\nHUYA up 16% pre market this morning.", "id": "i41mat", "created_utc": 1596616473.0, "score": 16, "upvote_ratio": 0.77, "num_comments": 10, "comments": [{"body": "Just reading this.\n\nI got into Huya at about $19 when Cathie Wood said about a month ago that a merger was likely.", "score": 5, "replies": [{"body": "Same, i'm in at 18. Great news!", "score": 1, "replies": []}, {"body": "0.19? The stocks at $20+", "score": 1, "replies": [{"body": "Sorry typo.", "score": 1, "replies": []}]}]}, {"body": "How do you invest in Tencent, anyway? Directly in the HK index? The TCEHY ADR on OTC?", "score": 3, "replies": [{"body": "If you use Robinhood you can invest in Tencent.", "score": -1, "replies": []}]}, {"body": "i gotta stop selling stocks when i get bored of them...", "score": 3, "replies": []}, {"body": "I'm very bullish on Tencent cause I think they can dominate the live streaming market. I'm up 35% ATM and plan to hold it for a very long time. Twitch sucks imo and think Tencent can come in and beat them.", "score": 1, "replies": [{"body": "I’d be bullish on them just for domination in China. \n\nHowever It’d take something massive to dethrone twitch no matter how shit they are. Ninja and Shroud going to Mixer didn’t even move the needle. They booted Doc off the platform without batting an eyelid.", "score": 2, "replies": []}]}, {"body": "What's behind the drop today anyone?", "score": 1, "replies": []}]}
{"title": "The next rally for beaten down stocks", "selftext": "Beginning June 11 many beaten down stocks/industries have been going sideways or faced a mild downtrend. Take a look at stocks like JWN, NCLH, WFC, MGM, DENN... highly volatile before June 11 but mostly going steady, after. I have no idea when the next big rally for stocks like these will come but it’s bound to arrive eventually. Why? Because there’s more good news to come. Stimuli packages, FED money printing, decreasing infection curves, more going stuff going back to normal and of course hopefully someday a vaccine. \n\nThe way I see it, the tech bubble may burst.. I’m not willing to take that risk. I’d rather stay sideways or take a little hit facing a slow descend while I wait for a huge rally to arrive. Then I’ll probably sell and switch to tech then because my guess the two may coincide; tech could go down when these other beaten down stocks go up. \n\nThoughts?", "id": "i445ox", "created_utc": 1596629451.0, "score": 5, "upvote_ratio": 0.86, "num_comments": 10, "comments": [{"body": "Basically you’re looking at recovery vs. growth. I think it makes sense, if you’re confident that the companies you pick have good business models and are strong enough to get through the next year or so without going bankrupt.", "score": 3, "replies": [{"body": "Yeah, I agree. That and what you believe in terms of: virus will end soon vs will go on for years.", "score": 1, "replies": []}]}, {"body": "If the tech bubble bursts, your T&E companies will tank first..  sell the dogs for margin calls, ride the wave and expect an investment in 5G.", "score": 2, "replies": [{"body": "Not so sure there even is a tech bubble / anything that will burst but I find it very likely tech will stay sideways while other stocks will recover.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "If you’re used to playing a ton of Playstation and your mommy takes your Playstation away from you for a long time, what do you do when she gives it back to you? You play a ton of Playstation again.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I adjust to a new landscape and play VR", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Like Nordstrom going more e-commerce and less malls; adjusting to the new retail landscape. You think companies like Ralph Lauren will just do nothing and die? Nah man, they’ll adjust and recover.", "score": 1, "replies": [{"body": "They'll adjust.\n\nWhether they recover or not is down to how well they adjust.  Just because they have cash to burn on trial and error doesn't mean it's a sure thing for shareholders.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Until the vaccine is secured the rest discussion is pure speculation.", "score": 1, "replies": []}, {"body": "I agree. The great rotation will occur. Energy, airlines, banks are gurgling and getting staged to make a run.", "score": 1, "replies": []}]}
{"title": "AAPL: Worth buying before stock splits", "selftext": "I do not currently own any Apple stocks but I am considering to get it before the stock splits.\n\nHowever, I am concerned if it would be the right decision to make given that Apple's retail sector is slowly eroding and given this pandemic, there are no chances of revival.\n\nJust looking for opinions.", "id": "i45sxh", "created_utc": 1596635848.0, "score": 0, "upvote_ratio": 0.36, "num_comments": 18, "comments": [{"body": "Hold AAPL for life.", "score": 18, "replies": [{"body": "Whats the point? To die rich?", "score": -3, "replies": []}]}, {"body": "Have you looked at their last 2 earnings? That should answer your questions about retail and chances of survival", "score": 13, "replies": []}, {"body": "Probably is. Robinhood people are gonna see it at about 100 and jump all in. Could be an easy swing.", "score": 10, "replies": [{"body": "My thoughts exactly. I'll probably set an EXT buy the night before and hold it through the follwing day and sell close to the bell.", "score": 1, "replies": []}, {"body": "When exactly is this split happening?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Thanks! I'll put that in my calendar.", "score": 1, "replies": []}]}, {"body": "Aug 24", "score": 1, "replies": []}]}]}, {"body": "Is the sky blue?", "score": 2, "replies": [{"body": "Yeah no it isn't", "score": 0, "replies": [{"body": "That sucks - it is here!", "score": 2, "replies": []}]}]}, {"body": "lol what?", "score": 1, "replies": []}, {"body": "Don’t know how much you plan on buying but don’t forget about the reorganization fee. I think it’s like $38 for Td not sure on others. Personally I’d buy after the split because more small investors will buy at $100 vs 400 and that may also push it up", "score": 1, "replies": []}, {"body": "buy it - check back and smile ten years from now...", "score": 1, "replies": [{"body": "I’ve been holding 🍎 since 2003, and you are right I’m smiling each day", "score": 3, "replies": []}]}, {"body": "I also was considering it every much but I just think it’s too expensive for me, it was 100$ less like a week or two ago, that would have been better for me. I do hold appl in 2 of my 401k assets, but not individually.. still considering but think I will focus on msft", "score": 1, "replies": []}, {"body": "There will be a big move. 50/50 chance to go up or down. Do you want the big risk/big reward or no? (No wrong answer)", "score": 1, "replies": []}, {"body": "Whatever your opinion is of AAPL stock, the split should have no impact on your decision-making. If anything, the stock split news has just made it a little more expensive for the next few months.", "score": 1, "replies": []}]}
{"title": "Your picks for good value (not hype)", "selftext": "I'm sitting mostly cash right but looking for deals. I've been adding slowly to my $DIS, $RTX, $MDT, and $WM positions\n\n&#x200B;\n\nDoes anyone have any good picks for companies not currently rocketing to the moon or over-hyped right now but are solid additions to a portfolio?", "id": "i45ww3", "created_utc": 1596636241.0, "score": 5, "upvote_ratio": 0.86, "num_comments": 18, "comments": [{"body": "BAC or JPM.", "score": 12, "replies": [{"body": "Imo bank stocks are pretty undervalued atm. \n\nI bought into TD too. \n\nI’ve been DCA-ing JPM whenever it has a red day and hits like $95.\n\nBAC I think is overvalued at it’s current price, but I got in at $20 with only a few shares. I might increase my holdings if I has a red day and hits the $23 mark....we’ll see", "score": 6, "replies": [{"body": "TD is a solid pick, added more to my position today", "score": 2, "replies": [{"body": "Agreed. A lot of people are avoiding banks like the plague (for good reasons) cause of everything going on. \n\nGoing to slowly add to my positions and enjoy the dividends + long term growth", "score": 1, "replies": []}]}]}, {"body": "I agree but the vast majority of users here will definitely not have the patience for these to rebound", "score": 2, "replies": []}]}, {"body": "People are going to say over hyped. But AMZN addressable market is by far the largest in the comparable FAANG stocks. AWS, E commerce, Electric Vans, Space Internet, Grocery, Logistics, Self Driving, Entertainment, Banking, Ads, probably missing a lot more too.", "score": 4, "replies": [{"body": "And their international business JUST became profitable. Huge growth potential there.", "score": 2, "replies": []}]}, {"body": "JNJ -> Will be fine as long as people need healthcare\n\nASML -> Will be fine as long as people need CPU's", "score": 2, "replies": []}, {"body": "Banks and Defense are some of the only sectors that haven't recovered most of their earnings. So unless you think banks and the military are going to die out those are probably fine.", "score": 2, "replies": []}, {"body": "You looking long? Check out BIGC just IPO’d today. They are basically SHOP but deal with much larger business, enterprise companies unlike SHOP who focuses on ma and pa’s. They have generated increased revenue over the past 3 years with stiff competition such as SHOP, etc. Put it this way do you want to invest in a realtor selling 300k homes, or a commercial realtor selling 20m properties? SHOP is making minimal off their clients because their much smaller, BIGC focuses on much larger businesses and have much higher revenue. BIGC will be a monster 2-3 years from now. Set that reminder now 😉", "score": 2, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "AMD is definition of sky-rocketing stock.", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "But still it has been sky-rocketing. OP said he wanted non-sky-rocketing stock. You can make the same argument for most growth stock.", "score": 2, "replies": []}]}]}]}, {"body": "SSL", "score": 1, "replies": []}, {"body": "I have mix profile value stocks and growing stocks.\n\nMy  value stocks that are different from you are: CVS, SPG, WBA, VZ and ABBV\n\nI have CVS and WBA because they will rise when vaccines get approved since most likely they administer most of the vaccines.", "score": 1, "replies": []}, {"body": "BMY, MO and GSK", "score": 1, "replies": []}, {"body": "BA, DIS, LUV, JPM", "score": 1, "replies": []}, {"body": "Brk.b", "score": 1, "replies": []}, {"body": "UUUU, NXE", "score": 1, "replies": []}]}
{"title": "$TRU Possible Covid-19 game changer for the United States and the world?(On August 6th 3 pm)", "selftext": "This link provides a slideshow transunion put together:\nhttps://solutions.transunion.com/healthy-america/resources/file/healthy-america-project-plan-2020.pdf\n\nFor the past month I’ve been trying to find the next big thing and I think I may have finally found it. TransUnion, SiriusIQ and UST Global are partnering up to make a joint venture company called CLX Health LLC. CLX Health LLC is introducing an app called Healthy America™️  that is set to be announced on August 6th to the world. The media will be disclosing it at 3pm EDT on August 6th. \n\nWhat does it even do?\nThis link provides all the information you need without having to read all of that down there:\nhttps://solutions.transunion.com/healthy-america/resources/file/healthy-america-project-plan-2020.pdf\n    \nMessage from TransUnion on Healthy America:\n\nIn a world forever changed by the COVID-19 crisis, we’re committed to protecting American lives. TransUnion and its US-based healthcare technology partners have developed HealthyAmericaTM. This unique solution enables people to securely share test results, helping businesses, schools and consumers assess risks stemming from COVID-19 and interact in a safe, confident manner.\nHealthyAmerica combines the power of TransUnion’s identity and fraud solutions, clinical data management capabilities of SiriusIQ, and business transformation assets of UST Global — together forming CLX Health, LLC. By leveraging and deploying our existing technology in a way consumers and businesses can readily adopt, it will be easier to mitigate risk in everyday interactions while maintaining individual privacy. Going forward, we expect airlines, large event organizers, restaurants and others will leverage the tool — which will easily adapt to changes in science parameters, including the evolution of a seasonal vaccine.\n(https://solutions.transunion.com/healthy-america/?=undefined)\n\nWhat Healthy America is:\n\nCLX Health LLC, a joint venture company, has developed the HealthyAmericaTM mobile application to be deployed as a key component of the HealthyAmericaTM Solution Architecture and Database. The CLX Consortium of partner companies have come together to manage the spread of COVID-19 and other viruses by accessing real-time laboratory testing data for operational business and consumer decision support, ultimately allowing the economy to scale back up to capacity.\nUtilizing existing technology and infrastructure critical to delivering a solution now, the CLX Consortium has network access to over 1 million physician offices, 22 largest by volume clinical laboratories, 40 major hospital systems and 20 Federally Qualified Health Clinics (FQHC) in the United States.\nIn much the same way TSA PreCheckTM provided airline passengers with an increased level of confidence after 9/11, the HealthyAmerica application is positioned to mitigate risk of businesses and individuals. With TSA PreCheck in place, passengers returned to travel with assurance that fellow travelers had been screened and posed little to no risk. The HealthyAmerica application manages real-time and batch files of health status requests for consumers to provide businesses and facilities operational decision-making capabilities that can mitigate exposure to employees and clients.\nLike the TSA PreCheck status, which is delivered in bulk to airlines and directly to the consumer via a Quick Response (QR) code, HealthyAmerica enables consumers to present a QR code indicating health status. With the HealthyAmerica QR code, individuals can securely gain access to government-restricted sites, such as airports and/or sporting events, as examples.\nThe HealthyAmerica application works in the following manner, first requiring the individual consumer to register. Consumer identity is verified in combination with mobile device authentication, then the consumer selects a laboratory, schedules testing and receives validated test results—all within the application on the consumer’s verified device. The HealthyAmerica application stores diagnostic or antibodies test results received directly from an FDA-approved laboratory and generates a QR code indicating current health status.(https://www.siriusiq.com/siriusiq-introduces-clx-health-and-develops-healthyamerica-tm-as-virus-response-mobile-application/)\nMy summary and analysis:\n\nOkay so this app basically gives verification to other people on whether you have Covid-19 or not wherever you go. First you start off by scheduling a testing through the app for antibodies and then you send the tests to SiriusIQ labs where they see if you have antibodies. TransUnion then verifies your identity through your social security number making sure it’s you. Then the data is stored in the app which is federally regulated and presents proof of your safety from Covid-19. You can also opt in or not for contact tracing on it to see who is infected and not. I think businesses, airports and big events like baseball games will soon require this because it‘s as simple as scanning a QR code or sending a verification online through the app to wherever you're going to check if you are safe to be there both to yourself and others. It provides a more organized and safer way to open up the country and European countries as well and yes they have been approved by the European Union on this. Anyways I think this can allow countries to  open up in a safer way then the first time they tried. This would help both the economy and stock market. This will all go down on August 6th at 3 pm (EDT) when they announce the application and the media is to announce it at that time as well.\n \nWho are these companies TransUnion is teaming up with?\n\nTransUnion- TransUnion is a global information and insights company that makes trust possible between businesses and consumers, by ensuring that each consumer is reliably and safely represented in the marketplace. They do this by having an accurate and comprehensive picture of each person. This picture is grounded in their foundation as a credit reporting agency which enables them to tap into both credit and public record data; their data fusion methodology that helps us link, match and tap into the awesome combined power of that data; and their knowledgeable and passionate team, who stewards the information with expertise, and in accordance with local legislation around the world.\nhttps://www.transunion.com/about-us/about-transunion\n\nSiriusIQ- SiriusIQ provides cloud-born Master Orchestration and Automation of data to streamline business processes, conversations, analytics and more. Offering enterprise-level solutions that are faster, better and smarter, SiriusIQ integrates native Cloud Services, Human-Assisted AI, Continuous Integration Continuous Delivery of Data and Subject Matter Expert Collaboration.\n\nUST Global- UST Global is a technology partner dedicated to transforming businesses, communities, and the people who live within them. Operating in 25 countries, we deliver future-ready digital transformation strategy services, products, and platforms that create new possibilities and help you imagine what’s next in ﬁnancial services, healthcare, retail, manufacturing, semiconductor, and communications. But what matters most is the deep partnership we forge with you to solve the unique challenges you face today, while preparing you for tomorrow. That’s us together. That’s UST Global.\n(https://www.ust-global.com)\n\nThese are obviously three reputable companies that are working together and I think this can potentially be big.  Especially since it has to do with easing the pandemic I know investors will go crazy over it.\n\nLet me know what you guys think down below.", "id": "i45x0m", "created_utc": 1596636255.0, "score": 3, "upvote_ratio": 0.61, "num_comments": 12, "comments": [{"body": "Yeah fuck this tracking you’re ass technology. Hard pass even if I thought it would make money.", "score": 1, "replies": [{"body": "I think you severely missed the point and didn’t read it all. The tracking is completely optional.", "score": 0, "replies": [{"body": "Having to give your medical records to an app so you can go on an airplane. Who would be okay with that?", "score": 1, "replies": [{"body": "Medical records? It’s just whether you are sick or not man.", "score": 0, "replies": [{"body": "Bro you’re giving your test results to a company so that company can tell other businesses if you’re allowed to use their services or not. No business will adopt this cause it’s fucking creepy. I can’t imagine what the conspiracy nuts reaction will be", "score": 2, "replies": [{"body": "Well it’s either that or businesses will keep on struggling to meet ends meet with limited people being allowed to use their business instead of a lot more healthy people.", "score": 0, "replies": [{"body": "My main questions before trusting any of this would be\n\n1) How do they handle positives (and false ones)? Are you out for 2 weeks, until you test negative, or what?\n\n2) How often does the “safe” meter last? What if it marks someone as safe and then they cause a ground zero because everyone in certain areas believe that no infected can enter the area?\n\n3) What’s the game plan when COVID ends? Once we either get a vaccine or herd immunity, where does all the money thrown into this move to?", "score": 1, "replies": [{"body": "Look at the pdf", "score": 1, "replies": [{"body": "Unless I’m blind, it doesn’t answer any infected-timeline or post-COVID questions", "score": 1, "replies": [{"body": "I don’t know anything beyond what I researched and what is on this post.", "score": 1, "replies": [{"body": "Aw, fair enough", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "https://www.gofundme.com/f/mnjen-corona-relief-fund", "score": 1, "replies": []}]}
{"title": "Pfizer announces deal with Canada for experimental COVID-19 vaccine", "selftext": "https://www.reuters.com/article/us-health-coronavirus-canada-idUSKCN2511RH\n\nPfizer getting yet another deal and this time in a country that has already done a solid job in containing the spread of Covid-19. This is huge news for Pfizer, but only time will tell if this effects the share prices.", "id": "i465oa", "created_utc": 1596637130.0, "score": 21, "upvote_ratio": 0.9, "num_comments": 10, "comments": [{"body": "So of course its down today", "score": 11, "replies": [{"body": "Why though??", "score": 4, "replies": [{"body": "Over 200 Billion dollar market cap and 5+ billion shares of stock. Takes a lot to move it", "score": 5, "replies": []}, {"body": "Because $PFE -_-", "score": 1, "replies": []}]}]}, {"body": "Not sure it will move mate. They need to land hard news like \"phase 2/3 successfull, no downsides, both vaccine candidates outperformed expectations\" and even then be ready for people taking some profit after first jump.", "score": 3, "replies": []}, {"body": "lol 0.05% up today. I'll take whatever unrealized profit I can I guess...", "score": 2, "replies": []}, {"body": "Kevin O’Leary just busted a nut", "score": 1, "replies": []}, {"body": "PFE dont move much. Boomer stock", "score": -1, "replies": [{"body": "Maybe people need more time to process it I'm curious how it will play out over the week.", "score": 1, "replies": [{"body": "Yeah, usually it moves slow and takes a couple of days for people to realize. I’m expecting the same as last time when they got that 1.9 billion deal. Took about a day or two and finally started going up", "score": 1, "replies": []}]}]}]}
{"title": "How do you stop yourself taking profit?", "selftext": "So I just started investing around March, possibly the best possible timimg, and now i’m up by a decent amount...\n\nThing is, most of my stocks are considered long term holds like MSFT, AMZN, DIS. But everytime I see the couple grand in green, I just want to cash out. Growth investors, how do you stop yourself from this itch?\n\nOh and I also bought NAT at $7, will probably just keep that and pray for some miracle", "id": "i469bc", "created_utc": 1596637493.0, "score": 2, "upvote_ratio": 1.0, "num_comments": 10, "comments": [{"body": "Do you need the money now?\n\nIf you were invested in volatile stock like Tesla, I'd be more inclined to take profits now. The 3 companies you mentioned are solid, I'd confidently hold.\n\nThere's also nothing wrong with cashing out your initial investment if you get too nervous so you're just gambling on the profit.", "score": 5, "replies": []}, {"body": "Cash out a small portion (20% maybe) to appease that desire to take profit. Put it back in the bank account and enjoy it. Hold the rest. That's my 2 cents", "score": 4, "replies": []}, {"body": "I just don’t sell", "score": 8, "replies": []}, {"body": "But far otm calls with 1 week out expiry. That way you never take profit", "score": 1, "replies": []}, {"body": "Idk, people I know usually have the opposite problem", "score": 1, "replies": []}, {"body": "I remind myself that I would probably just end up using the money to just buy more stocks. Except that I would end up with less than I had when I started, because taxes.", "score": 1, "replies": []}, {"body": "the ones you mentioned I think will be fine long term so I would not sell. Now, if the urge is just too much, take a little profit, say 10% and look to put that money to work somewhere else. Of course that also means you will pay some tax on that money so, keep that in mind.    \n\n\nYou see if you sell too much of them and they just keep going you will kick yourself later. Yes I know, you could also put the money back in if that happened but since you don't know what will happen in the future, sitting tight is the best move.     \n\n\"The trick is, when there is nothing to do, do nothing\" - Warren Buffet", "score": 1, "replies": []}, {"body": "Never was in situation to be couple of grand in green. Ill tell you in year or so. RemindME! one year \"reply to this thread\"", "score": 1, "replies": [{"body": "I will be messaging you in 1 year on [**2021-08-05 14:27:54 UTC**](http://www.wolframalpha.com/input/?i=2021-08-05%2014:27:54%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/stocks/comments/i469bc/how_do_you_stop_yourself_taking_profit/g0g4tlp/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fi469bc%2Fhow_do_you_stop_yourself_taking_profit%2Fg0g4tlp%2F%5D%0A%0ARemindMe%21%202021-08-05%2014%3A27%3A54%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20i469bc)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}]}, {"body": "Always have an exit plan when you invest.  If you intended to just have a couple grand then it’s time to sell.  If you invested for the long term then why is this even a question.", "score": 0, "replies": []}]}
{"title": "Double down on $NIO?", "selftext": "Hi, \n\nSo I'm in a bit of a dilemma. I currently only have holdings in two stocks - $NIO and $TSLA split maybe 65-35 in NIO's favour. \nIn recent days I've been growing quite impatient with Tesla. \nDo you recommend and sell my Tesla stocks and double down on $NIO? \n\nI've got huge confidence in NIO, but would be slightly concerned with them being my only holding in case it all went wrong.\n\nWhat do you recommend? \n\nThanks", "id": "i46b33", "created_utc": 1596637675.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 16, "comments": [{"body": "Just curious, why are you confident in NIO?", "score": 11, "replies": [{"body": "A man can be confident without a reason. :))", "score": 7, "replies": [{"body": "That’s a thing called luck", "score": 2, "replies": []}]}, {"body": "Deliveries grew 322% YOY last month, backed by Chinese government, Tencent and bailey Gifford (Tesla’s largest shareholder). Bailey Gifford has a $300 price target on it.\n\nBattery swapping technology that allows them to fully charge a car from 0-100 in just 3 minutes, as opposed to supercharging which takes about an hour.", "score": 1, "replies": []}]}, {"body": "Personally, I think NIO will never beat Tesla, but as an investment NIO has potential to give higher return than TSLA (It can also be much more volatile short term). I feel that there will be a Chinese all EV behemoth at the end of the day, and NIO is the current front runner. If you've done your research, and you are confident, then don't let anyone tell you otherwise, because no one really know what would happen.\n\nHowever, I would diversify your portfolio as others have suggested.", "score": 8, "replies": []}, {"body": "Reorganise your portfolio. Start from base zero and diversify - 100% of your holdings are in the EV sector which is a high growth HIGH RISK sector atm.", "score": 3, "replies": []}, {"body": "Got friends in China I was asking about the perception of Nio. It’s the only car the Chinese community is willing to pay more than the average car price in China. I forget that exact value, but it’s held in high regard and seen as quality. Nio looks like a good play.", "score": 5, "replies": []}, {"body": "How long have you been holding Tesla? Is has gone up 200% in the past 6 months. NIO is at best a Tesla knockoff. I would think Tesla is the stock to hold here", "score": 4, "replies": [{"body": "At best a tesla knockoff? lol your ignorance is laughable", "score": -3, "replies": []}, {"body": "Go research NIO before making statements like that. They're doing a lot of things drastically different than Nio, and the fact alone that they are catering heavily to the Chinese market makes it very different.", "score": -3, "replies": []}]}, {"body": "I would hold them both but NIO is far cheaper now and has far far more room for growth.  \nI predict NIO in the triple digits in a few years.  Almost a third of my portfolio is NIO.", "score": 2, "replies": [{"body": "This is probably the best reply I've had. I'll stick with it. And in future diversify while gradually putting more into NIO.", "score": 0, "replies": []}]}, {"body": "I'm very high on NIO and have tons of it.\n\nBut you can't bet it all on one company. \n\nBuy a software stock that has room to grow, Cloudflare, or at <90 maybe Fastly.", "score": 1, "replies": []}, {"body": "Nio gang", "score": 1, "replies": []}, {"body": "Nio gangggggg👌", "score": -1, "replies": []}, {"body": "Just. Do it. Don’t let your dreams be dreams.", "score": -1, "replies": []}]}
{"title": "Disney stock gets an upgrade at Guggenheim amid new streaming push", "selftext": ">Walt Disney Co.'s [**DIS,** **9.65%**](https://www.marketwatch.com/investing/stock/DIS?mod=MW_story_quote) plans to get more aggressive with streaming as the pandemic hammers other areas of the media conglomerate helped earn the stock an upgrade from Guggenheim analyst Michael Morris after the company's [Tuesday afternoon earnings report](https://www.marketwatch.com/story/disney-loses-nearly-5-billion-in-three-months-as-pandemic-wreaks-havoc-on-business-2020-08-04?mod=article_inline). Morris raised his rating on Disney shares to buy from neutral and upped his price target to $140 from $123 after Disney said it would launch a new streaming service overseas under the \"Star\" brand and release live-action \"Mulan\" as a direct-to-consumer option on Sept. 4 given disruptions to the traditional theater model due to COVID-19. \"Using Disney assets to accelerate a push into DTC will likely be well received by investors,\" Morris said in his Wednesday morning note to clients. \"Bottom line, as we head toward an investor day (in the coming months), we expect the burden of proof to be on why Disney will not be a secular streaming winner rather than justifying the company's ability to deliver on investor expectations.\" He saw hints in the company's language that may have signaled \"a broader willingness to pursue additional opportunities\" in streaming down the road, in his view. Disney shares are up 6.6% in premarket trading Wednesday. They've lost 19% so far this year as the S&P 500 [**SPX,** **0.58%**](https://www.marketwatch.com/investing/index/SPX?mod=MW_story_quote) has risen 2%\n\n [https://www.marketwatch.com/story/disney-stock-gets-an-upgrade-at-guggenheim-amid-new-streaming-push-2020-08-05](https://www.marketwatch.com/story/disney-stock-gets-an-upgrade-at-guggenheim-amid-new-streaming-push-2020-08-05) \n\nThoughts? Disney is almost up 10% today. Is it worth getting into?", "id": "i46cyb", "created_utc": 1596637869.0, "score": 27, "upvote_ratio": 0.87, "num_comments": 17, "comments": [{"body": "DO. NOT. FU¢K. WITH. THE. MOUSE.", "score": 15, "replies": []}, {"body": "Disney was worth getting into for the last 4 months.", "score": 29, "replies": [{"body": "\"I'd consider it at 90\"", "score": 23, "replies": []}, {"body": "Got in at $103 and took my profit today. Today was a good day.", "score": 3, "replies": [{"body": "I bought 7 shares at $116 😄", "score": 1, "replies": []}, {"body": "You fool we are just getting started!", "score": 1, "replies": [{"body": "Taking it off my Apple list. Refuse to see the lambos I'm gonna miss!", "score": 1, "replies": [{"body": "Lambos?  We pulling up in a space ships!", "score": 1, "replies": []}]}]}]}, {"body": "40 years*", "score": 1, "replies": []}, {"body": "Bought 1 share at 120, sold at 117. Lol.\n\nSomehow I feel wrong for investing in Disney and I don't know why. Their parks always seemed like a middle class indulgence I never got to enjoy so I get an actual feeling not to invest in them. Weird.\n\nTheir stock isn't going to go to 500 though. I think some people are expecting it to surge that hard and through sheer numbers that won't happen.", "score": -6, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "How many shares are outstanding compared to Netflix?", "score": 0, "replies": []}]}]}]}, {"body": "DIS streaming service strategy and management seems terrific. Growth is stunning. They found a clear market segment and take full advantage of their brand and production (synergy). I’m invested in DIS and think it’s a great long term hold. Park segment will have 2 strugglesome years and may never return to what it was, so very glad that DIS is stepping up in other sectors.", "score": 5, "replies": []}, {"body": "Got in heavy at $92.50. No looking back. Long hold all the way.", "score": 5, "replies": []}, {"body": "What the fuck is Guggenheim?", "score": 3, "replies": []}, {"body": "Initially bought in at 150, since the pandemic I've been doubling down. Finally have positive returns. Still looking to buy more. Disney is a great long term hold.", "score": 3, "replies": []}, {"body": "loaded up last week", "score": 2, "replies": []}, {"body": "I really expected it to drop today. I got in around 90 and I’ve been second guessing myself. It’s going to be a while until theme parks come back. I’m not going to downplay the virus, it has killed people, those aren’t just numbers they are humans with families. On the other side of the coin in most cases you need to be tested to see if you have it. Four people at my company tested positive none of them had any symptoms, they are recovered with no symptoms and are fine. Now I could go on the internet and find cases where people are having issues long after the virus onset so I’m not using the four cases I know of as a guide, just an example. Regardless many people are scared poopless and our interactions are altered. Shit getting a cup of coffee is a task. I’m seriously considering just selling Disney although tbh when I got it I was thinking at least a ten year hold.", "score": 1, "replies": []}]}
{"title": "Is Disney a underrated stock?", "selftext": "I just had to get this out here in more recent time. \nWith Disney+ being a great success for Disney, I’m having a hard time seeing that Netflix is faaaar ahead of Disney - don’t get me wrong, I do know that Netflix is still the most popular streaming service. Why I’m also confused is that Disney is more (and have always been) than their new streaming service. Looking at society nearly everyone knows about Disney. We have all grown up with some of their popular characters. Disney has nearly always succes with their animation movies. Disney channel and Disney xd. I do know that parks has been shutdown for now, but yet again, Disney is not only one thing. They own a lot of big companies now. I might just be a confused European who can’t seem to find any logic in the stock prices now and then. Anyone who is friendly enough to help me out?", "id": "i47lia", "created_utc": 1596642017.0, "score": 0, "upvote_ratio": 0.46, "num_comments": 10, "comments": [{"body": "Netflix ISNT ahead of Disney! \nYou’re just looking at it wrong, although Netflix individual share price is more they have less shares available! So if you round up both companies shares and times them by how much each share is worth, Disney is worth 20 billion more than Netflix.\nHope this helps.", "score": 6, "replies": [{"body": "Market cap baby!", "score": 2, "replies": []}]}, {"body": "Buy Disney and never sell it!", "score": 5, "replies": []}, {"body": "Under 100$ Disney was a gift from the Most High, i accepted that gift !", "score": 5, "replies": []}, {"body": "I bought DIS at 129 last October, sold it after the Disney+ bump in November at 140ish. Now its back to the 129 price despite no movies, no parks, losing billions of dollars and barely any sports and dividend suspension. It defies all logic, but so does this market.", "score": 8, "replies": []}, {"body": "Underrated stocks don’t go up when they report -42% revenue and -92% EPS, and withhold guidance. They are more accurately seen as overrated stocks. CVS is an example of an underrated stock. +3% revenue, +38% EPS, raised guidance, stock goes down.", "score": 2, "replies": []}, {"body": "Disney is not going anywhere. I think it's a great stock to hold for the next few years and it'll be way above what it is at now. This is just my opinion.", "score": 2, "replies": []}, {"body": "DIS has a lot of things going for them. Nflx has more company.", "score": 1, "replies": []}, {"body": "An analyst was bad mouthing them on CNBC today. She couldn’t say one good thing about stonk. Really? But in same interview she recommends all these Momo stocks like ROKU and PTON, which can’t turn a profit and may never.", "score": 1, "replies": []}, {"body": "Imo it is. Buy with every chance you got, it won't grow as fast as others but for sure it will grow big in the next 12-24 months.", "score": 1, "replies": []}]}
{"title": "Is holding cash and waiting for a market crash a good idea?", "selftext": "Before I get bombarded with the \"Time in market\" quote, I would just like to say that most of the stocks are ATH, I don't think these prices are a good entry point. I predict with a 2nd COVID wave and the upcoming elections might bring about another market crash similar to the one we've experienced mid-March.\n\nDo you think it's wise to just hold cash and wait for discounted prices? The only stock I am contemplating in getting is Apple before the split.", "id": "i4aduc", "created_utc": 1596650785.0, "score": 1, "upvote_ratio": 0.57, "num_comments": 19, "comments": [{"body": "You obviously aren’t familiar with the great American money printer", "score": 23, "replies": []}, {"body": "Most of stocks at ath?? Far from it", "score": 8, "replies": [{"body": "*Cries in Boeing*", "score": 5, "replies": []}]}, {"body": "I was like you before... until I zoomed out beyond 1 month charts. Look at 1yr, 3yr, 5yr charts... depending on what you're looking at - most dominant players are consistently trading at ATH. \n\n1. Keep whatever amount of cash helps you sleep at night.\n\n2. Invest the rest.\n\nIf you're a long term investor sitting on the sidelines because stocks are at ATH... good luck being right twice (timing the top and bottom). If you're a short term trader who's nervous - then refer back to number 1.", "score": 7, "replies": []}, {"body": "Wait are you saying that first covid waive is over?", "score": 6, "replies": []}, {"body": "The odds you time the market perfectly are slim. Just invest some cash and work with it. Have some cash in reserves or for quick trades you want to make. 10% gains on a penny stock or less than .1% interest in the bank.", "score": 3, "replies": []}, {"body": "My roommate pulled money and is holding it in cash, he lost out on $50k in his portfolio because he was pessimist back in March and thought the market would go lower. He’s been waiting for it to “crash” to put it back in....he missed his opportunity in March. \n\nIn sum: Don’t take it out of the market if you’re already in, move it around into more secure shit if you’re worried but DO NOT wait. \n\nAs for jumping into the market right now, it’s a bit of a gamble but another stimulus is coming so you could benefit from that momentum. Do your research, it depends on your tolerance for risk. \n\nIf I was adding a chunk to the market right now I’d go long and hold some back in cash so I don’t go broke, plus a little to screw around with in shorter holds.", "score": 3, "replies": []}, {"body": "Just DCA into the market and invest some more if it goes down", "score": 3, "replies": []}, {"body": "I am slowly adding as I agree the prices are high and the big dip was too quick, I expect another down turn especially if lock down continues into the fall... I have a good chunk waiting for the next crash but not letting that stop from adding where I see a deal", "score": 5, "replies": []}, {"body": "I'm still buying some each month cause I'm not a timing God but im buying about half what I normally would so I build up a chunk on the side to move in if we correct", "score": 2, "replies": []}, {"body": "If you want to do that why not invest it into a bond fund like ANBFX or something so it’s at least making you some money. Sell it and reinvest when you need/want.", "score": 2, "replies": []}, {"body": "You should put small amount money that you feel comfortable with in stocks that are priced correctly right now or bargain that you feel comfortable with buying and holding. Holding on all cash is a risk due to inflation. USA federal reserve said they want inflation.", "score": 2, "replies": []}, {"body": "DUDE HOLD IN CASH AND SELL CASH COVERED PUTS. Ie. If you don’t mind holding MSFT at 200 sell some puts for the premium", "score": 2, "replies": []}, {"body": "Roll cash covered puts into covered calls and vice versa. If the market tanks you’ll keep premiums and end up holding stocks at lower entry prices. I am planning to do this with my savings", "score": 2, "replies": []}, {"body": "It really depends on your time horizon really. Yes, the market is over extended (mostly on the backs of a few stocks), holding some cash is a good thing but I would not come out too much. For example, I have 10% cash atm. I am not really waiting for a crash just other opportunities that I have yet to find that I want.", "score": 2, "replies": []}, {"body": "Time in the market beats timing the market", "score": 5, "replies": []}, {"body": "Cash is trash", "score": 1, "replies": []}, {"body": "YES cash is not trash, wait for the hammer to fall", "score": 1, "replies": []}]}
{"title": "Looking for an alternative to Boeing with active Dividends", "selftext": "I am interested in selling some shares of Boeing,  I know itll double in price, but Who knows how long ill be waiting on the dividend to return. Are there any heavily beaten down stocks you know of that have active dividends that I can just transfer some $ to?\n\n&#x200B;\n\nThanks!!##!", "id": "i4anud", "created_utc": 1596651662.0, "score": 2, "upvote_ratio": 0.75, "num_comments": 11, "comments": [{"body": "Rtx", "score": 14, "replies": []}, {"body": "RTX is what you want then.", "score": 5, "replies": [{"body": "will check it out. good yield?", "score": 2, "replies": [{"body": "Around 3%. But don’t always focus on the yield, there’s more important things", "score": 3, "replies": []}, {"body": "1.90 / share", "score": 1, "replies": []}]}]}, {"body": ">I know itll double in price\n\nYou really don't. I'd repeat that to myself if I were you. I'll also throw my vote for RTX out there, but I'm pretty biased as I have a large position myself.", "score": 3, "replies": []}, {"body": "I hold BA, RTX, LMT, and HON. All worth a look, I probably like RTX the most out of the bunch.", "score": 2, "replies": []}, {"body": "Check out some property and casualty insurance companies", "score": 2, "replies": []}, {"body": "PTY, AWR, O, MAIN", "score": 1, "replies": []}, {"body": "RTX, for sure. Aerospace and defense behemoth.", "score": 1, "replies": []}, {"body": "sell calls", "score": 0, "replies": []}]}
{"title": "Just bought 2 apple shares!", "selftext": "Hello, Just bought 2 apple shares- feeling full of pride. What are my next steps? Do I just play the waiting game? \n\nI chose to buy it now after being advised to do it before the 4 1 Apple split happening on the 24th August. Thoughts?\n\nThanks in advance for sharing your thoughts! :)", "id": "i4bo8p", "created_utc": 1596654735.0, "score": 0, "upvote_ratio": 0.48, "num_comments": 16, "comments": [{"body": "Now you hold them until the day before you die.   \nEnjoy the stonks on your last day.", "score": 42, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Hello. I just bought my first 2 stocks today as well (also Apple stock). \n\nI have no idea what I’m doing. The way I look at it is that money invested in Apple is basically money in the bank correct? The money I invested has potential to grow over time? I apologize for the mild mental retardation on my end. \n\nI’m looking to buy one more Apple stock and 2 Microsoft stocks. Good move?", "score": 2, "replies": []}]}, {"body": "Waiting game . Welcome to the stockholder team my dude lol congrats", "score": 10, "replies": []}, {"body": "im holding on to my .37 share of apple.\n\nHopefully they won't cash me out when the split comes......\n(fidelity btw)", "score": 3, "replies": [{"body": "They probably will. I sold my .09 shares 2 days ago and reinvested the proceeds into Levi's, UBS, and UPS.", "score": 3, "replies": []}, {"body": "They will I think? I’ve been through one split and one spinoff on Fidelity and both times fractional shares were returned to me in cash.", "score": 2, "replies": [{"body": "My only expereince was with M1 Finance and my ACB shares during their reverse split. I heard fractions were gonna be liquidated, but nothing like than happened. Not sure if it was because of M1?\n\nBut Fidelity offers Fractions now, so hopefully they WONT liquidated", "score": 2, "replies": []}]}]}, {"body": "I did the exact same thing last week, congratulations welcome to the team. This will most likely go to my daughter in the future", "score": 3, "replies": []}, {"body": "Bought my first apple share this week. I know the feeling :,).  I’m holding", "score": 5, "replies": []}, {"body": "never sell", "score": 2, "replies": []}, {"body": "Haha. Buy more before and after the split. Then keep waiting!", "score": 3, "replies": []}, {"body": "Congrats.", "score": 3, "replies": []}, {"body": "You hold them for a very long time, and add more whenever you can", "score": 4, "replies": []}, {"body": "Buy more, make more", "score": 4, "replies": []}, {"body": "Proud of you son", "score": 2, "replies": []}, {"body": "Are you up? Hurry sell and lock in the gains!\n\nWhat is the point of these threads?", "score": 0, "replies": []}]}
{"title": "Second stock market crash? No? Then how about \"large cap bubble?\"", "selftext": "It's pretty common to see people post new threads asking when the next crash will take place, and they usually get downvoted because it's impossible to predict and these posts are pretty repetitive. But what I haven't seen anyone ask is what *kind* of crash we can expect if it ever comes around. Like people such as Mark Cuban are comparing the markets right now to the dot com bubble, but when you look at the effect that the dot com bubble had on stock prices, it didn't have much of an impact on stocks unrelated to the internet or computers. We can't guess whether or not there will be a second crash, but is it any more reasonable to assume that we are in a \"large cap bubble,\" rather than another upcoming crash that will impact *all* stocks?\n\nI've often preferred to avoid FAANG or other highly overvalued large caps, buy shares in more obscure mid cap companies to avoid speculators, then sell after I get my 5-10% capital gain which happens between 2 days and 3 weeks after buying. I haven't bought anything in a while because I'm afraid of another global event this year that would interfere with prices (vaccine research, elections, China, etc). June 11th was pretty bad but I've noticed that I would've still got my 5-10% if I waited an extra 2 or 3 weeks. That time people were saying that traders should pull out and investors should stay but I don't know if I'm either of those. Yeah I'm rambling but I have no idea if I should still get back into it this year with the bubble concerns or if I should still trade even though data from years ago tells me my strategy is reliable.", "id": "i4e4yd", "created_utc": 1596662456.0, "score": 1, "upvote_ratio": 0.6, "num_comments": 11, "comments": [{"body": ">highly overvalued large caps\n\nAmazon and Netflix, sure, but AAPL? FB? Google? MSFT? I'm not seeing them as highly overvalued here. Maybe a bit, but their PE, forward PE, and PEG ratios aren't atrocious. In absolute terms they're definitely not low, and I would like to see them come down a bit, but for their sector they seem pretty reasonably priced.", "score": 4, "replies": [{"body": "I should probably clarify that I'm just trying to do everything I can to avoid speculation without resorting to unstable small caps. Not saying it's the best way to go about it, but my gut tells me avoiding everyday brand names just seems like a good way to do it.", "score": 2, "replies": [{"body": "My only advice there would be to invest in the business, not that sort of high level, macro idea of where the market may go. I understand diversification (and agree with it to an extent), but if you have done your research and feel e.g. MSFT is solid long term,  the only thing holding you back is emotion (fear). \n\nThere will always be short term volatility, but it sounds to me like you're an investor, not a trader.", "score": 3, "replies": []}]}, {"body": "I still don’t really see why amazon is considered overvalued, to me they are THE growth stock. They started as an online bookstore and now have revolutionized shopping, along with having their hands in all types of streaming services while also having easily the largest share of cloud computing. What has made you think they’ll stop growing?\n\nFull disclosure, I bought in at $1400 after hearing a podcast about cloud computing and how big of a market share AWS has in that space.", "score": 1, "replies": [{"body": "Depends on your definition of overvalued and your own assumptions about the future. I love their prospects, but I'm not prepared to pay the premium I'd have to in order to own more shares today. I bought in March.", "score": 1, "replies": []}]}, {"body": "Apple has grown their revenue by about 3% to 4% a year every year for the last few years.  Which, on its own, is pretty great.  \n\nApple has twice doubled in market cap over that same period of time.  3x...over single digit revenue growth.  I would love a pair of those rose-coloured glasses you’re using because I can’t look at this stock without thinking it’s overvalued.\n\nIt’s still a great company.  Buts it’s far too expensive at this price.", "score": 0, "replies": [{"body": "Then don't invest in tech, or go find the next Apple. I was pretty clear in saying they are a bit too expensive for me, while comparing their premium to the sector they're in. Not sure what point you're trying to make.\n\nI have held apple since 2011 and picked up a bunch more in March. I'm not buying at these levels, but to call it a bubble is I think a bit too much.", "score": 1, "replies": []}]}]}, {"body": "They’ve been saying we have been in a bubble since I’ve started investing(2016)", "score": 2, "replies": []}, {"body": "I don't think we are in a bubble but we may get a correction. The price seems high because we did not adjust for inflation. The truth is no one knows.  If there is a crash, I don't think we will ever reach the march low. I think, there could be correction for tech stocks going back to pre-covid level plus 10-30% higher especially all those tech stocks that gained due to covid.", "score": 1, "replies": [{"body": "Apple zigs, then it zags, then it zigs, then it zags. Look at it on the all time level on Google and you can see the correction going to pre-march drop levels. It's like clockwork. Might be middle august, might be end of August, but it's coming. Get back in for the election and ride that puppy up for probably a 90-100% gain! Good old apple.", "score": 1, "replies": []}]}, {"body": "Great information! You have made a lot of things clear with your post. I am glad that I came across it.", "score": 1, "replies": []}]}
{"title": "Aggressive Growth Stocks Portfolio", "selftext": "[deleted]", "id": "i4e92p", "created_utc": 1596662817.0, "score": 1, "upvote_ratio": 0.57, "num_comments": 11, "comments": [{"body": "That literally is the million dollar question", "score": 23, "replies": [{"body": "Right", "score": 1, "replies": []}]}, {"body": "It’s not going to be over night but draft kings and penn are going to explode. They have to overcome covid and wait on widespread state by state legalization but the market will be huge. DraftKings already has a huge base and ESPN(Disney) in its corner. States are going to be looking to increase revenue and their is an easy way right in front of them. The industry has a loyal base and accessibility will create new users. Live in game micro bets could be an interesting niche as well. The stock is fundamentally over priced but so was and still is Tesla. You pay a premium for growth", "score": 4, "replies": []}, {"body": "QQQ\n\nundervalued, some think not.", "score": 7, "replies": [{"body": "Tqqq", "score": 2, "replies": []}]}, {"body": "- Tesla\n- Square\n- Invitae\n- Crispr\n- Shopify\n- Sea Limited\n- Alteryx", "score": 2, "replies": []}, {"body": "You pay premiums for growth stocks, if you believe that a company will keep growing at a great pace then buy it now and you wont regret paying that much later", "score": 1, "replies": []}, {"body": "Enph and net", "score": 1, "replies": []}, {"body": "My portfolio is also 10k geared towards growth and higher risk. 30% SPY, 20% QQQ, 10% ARKK, 40% NET/SE/MSFT/AAPL/RTX/AMD. \n\nLVGO is risky with the merger and might take time to recover. FSLY is dependent on tiktok which may be banned or bought by MSFT soon. TSLA is already up tons, but ARKK is 10% TSLA if you want it at less risk.", "score": 1, "replies": []}, {"body": "Ark ETFs growing nicely", "score": 1, "replies": []}, {"body": "Sell coke", "score": 1, "replies": []}]}
{"title": "10MW/20MWh utility-scale Tesla Megapack battery storage ready to go into operation in Alberta, Canada", "selftext": "", "id": "i48nq0", "created_utc": 1596645381.0, "score": 188, "upvote_ratio": 0.99, "num_comments": 20, "comments": [{"body": "This is awesome. Tesla is going to make a killing with their mega packs!", "score": 31, "replies": [{"body": "Agreed. It's especially significant for it to be located in Alberta, Canada's fossil fuel province. There's the doubt, repeated ad-nausea, that renewables are not viable because: \"wHaT dO yOu Do WhEn ThE WiNd DoEsN'T bLoW?\" Utility-scale battery storage is the answer and a project like this will help definitively prove that out to the province's electrical utilities and the Province that ultimately make the decisions.", "score": 35, "replies": [{"body": "Well there I disagree. Projected pricing of Megapacks and other grid storage will make Tesla billions because of FCA fees and because they can replace peaker gas plants (basically solve the duck curve problem that solar has).\n\nThe megapack in Australia and this one in Alberta will specifically make most of their profit through FCA fees.\n\nBut the wind sometimes doesn't blow significantly for days on end. \nBatteries will not solve that problem.", "score": 1, "replies": [{"body": "Batteries won’t solve wind not blowing for days but base load plants can reload batteries in off peak hours. With enough notice, they can move up and down (a bit) in energy production to support.\n\nThese batteries are great for taking on the peak load energy plants. Would need to be significantly larger/efficient to take on the base loads. Probably need solid state batteries to be at scale/cheap to do that.", "score": 15, "replies": [{"body": "Agreed, either baseload or more efficient cogen plants can be used.", "score": 3, "replies": []}]}, {"body": "FCA is a very shallow market", "score": 2, "replies": []}, {"body": "Depends on what kind of buffer you want for your generation. Localized power generation plus storage frees up a lot of the long distance cables that we can use to transfer energy from one state/country to the other. 500 miles away there might be plenty of sun when you don't have any, so using weather forecasts you could transfer a little energy from many places to store for off days. How efficiently you can do this determines the ratio of total storage / energy used per day.", "score": 3, "replies": []}]}]}, {"body": "Are the Samsung cells or Panasonic?", "score": 2, "replies": []}, {"body": "so are we going to see how much this made in the next quarter er?", "score": 2, "replies": []}]}, {"body": ">Construction on WindCharger began this spring and it will begin operating later in August.\n\nBoy do I love how fast these things go up.\n\nPretty soon it will be a few weeks from order placed to installed, up and running.\n\nOnce the design work is done, what do you really need? Couple of people to pour a slab, couple people to move them in place, and a a couple of electricians to wire things up?", "score": 14, "replies": [{"body": "I imagine the day will come soon when new buildings and communities get built with a mega pack or power pack for self reliance that then ties into teslas autobidder.\n\nAlready having houses built with them.\n\nThey can be placed almost anywhere.", "score": 9, "replies": []}]}, {"body": "i thought the pricing on these was something like ~~$150K~~ 180^1 for the first one and 90K for the additional ones. I see 9 units being installed, so around $1 million. But the article says $17 million. What am I missing? Is this project economically viable without subsidies? What is the projected payback period? How does the cost compare with the GE installation mentioned in the article?\n\nI'm not sure yet whether tesla battery storage as of now is viable as a widespread practical technology,or just an expensive boutique product suitable for small niches such as remote islands or places with regulatory demands. That is, is it more like the model x, or the model 3? I think tesla is making good progress on both battery storage and solar, but it's not there yet. I live in indiana, one of the many states where tesla solar is not yet available. What is the hangup exactly?\n\n^1 https://electrek.co/2020/03/31/tesla-powerpack-price-commercial-solar/ requires commercial solar purchase.\n\nhttps://www.windtaskforce.org/profiles/blogs/economics-of-tesla-powerpack-and-powerwall-systems", "score": 4, "replies": [{"body": "Megapacks are far more than $150K. The price of just the enclosure itself is $40K", "score": 4, "replies": [{"body": "i'm having trouble finding the prices i thought i remembered.\n\n\n[–]this1willdo 2 points 6 months ago \nResponse from Tesla\n\n*We use $/kWh ballpark pricing instead of $/kW. We have 2hr and 4hr durations typically, so you can deduce the kW by dividing the kWh by 2 or 4 respectively. Ex: 1MW/2MWh BESS costs roughly $800-$900k. 1MW/4MWh BESS costs roughly $1.6-$2 million.*\n\nso those numbers are consistent with the 17 million. for an energy policy wonk, i'm not very literate in working with numbers like these. i mean, a gallon of gas is $2 and gets me 20 miles, so i can do that in my head, but i'm not fluent in mwh or tons of coal. added sources to above entry.", "score": 4, "replies": [{"body": "I don't know exact numbers but the last time we had a tour come through I believe the cheaper version was $850-900K before shipping and everything else involved.", "score": 2, "replies": []}]}]}, {"body": "You are thinking of powerpacks at 180. Mega pack is more like a shipping container.", "score": 2, "replies": [{"body": "right, thank you.", "score": 2, "replies": []}]}]}, {"body": "I asked about this in Saskatchewan like  \\~4 months ago. Maybe now that daddy Alberta has done it we can follow suit. socialized power company move too slow for my liking :(", "score": 6, "replies": []}, {"body": "I love how they've arranged them.", "score": 3, "replies": []}, {"body": "So glad to finally see these in action. Think we sent them up a while ago.", "score": 4, "replies": []}]}
{"title": "Tesla begins construction on moss landing world's largest Megapack project for PG&E - Electrek", "selftext": "", "id": "i4fyxw", "created_utc": 1596668566.0, "score": 164, "upvote_ratio": 0.97, "num_comments": 10, "comments": [{"body": " elon time: this project has been in the works since 2017. construction was supposed to start in march and be finished by the end of the year, but we are now looking at 2q next year. covid delay. project supposed to save the utility 5 million a year. article does not have cost data.\nthis post is related to an earlier thead which i will link shortly. https://old.reddit.com/r/teslainvestorsclub/comments/i48nq0/10mw20mwh_utilityscale_tesla_megapack_battery/\n\nhttps://en.wikipedia.org/wiki/Moss_Landing_Power_Plant wikipedia as of today is saying the batteries will be in place by 2019. seems outdated.\n\nseems like it is being built on a cost-plus basis rather than a free enterprise basis. musk is opposed to cost-plus financing, but is still willing to do projects that way.\n\ni welcome progress reports, number crunching, more sources, etc.\n\nhttp://investor.pgecorp.com/news-events/press-releases/press-release-details/2020/PGE-Tesla-Break-Ground-on-Landmark-Battery-Energy-Storage-System/default.aspx\n\nhttps://www.triplepundit.com/story/2020/battery-storage-monterey-bay/121071\n\nhttp://www.montereycountyweekly.com/blogs/news_blog/vistra-gets-approval-for-a-battery-system-big-enough-to-power-1-1-million-homes/article_b74564cc-d5d8-11ea-9a66-f79b16c0b5ba.html", "score": 4, "replies": [{"body": "From the article you linked it says “earlier this year the project was officially approved” which I assume they just got the approval earlier 2020, which means they couldn’t start the project before that. I don’t see how this makes it Elon time /Tesla’s fault? Just because in general Elon maybe opposed to a particular form of contracting why would that stop the company from applying to a business opportunity? The business or entity that puts out the RFP sets the guidelines, they are the ones paying.", "score": 12, "replies": [{"body": "oh i agree, it was regulatory delay folowed by covid delay.", "score": 7, "replies": []}]}, {"body": "The best way to make a 1 year project take 3 years is to insist on cost plus billing.", "score": 6, "replies": [{"body": "See: Boeing aerospace contracts - SLS", "score": 1, "replies": []}]}, {"body": "What is a cost plus basis vs free enterprise?", "score": 3, "replies": [{"body": "cost plus is the government tells the utility spend all you want then add 9%. that's an oversimplification. the market model is you produce a good or service and offer it for sale, at whatever people are willing to pay.", "score": 1, "replies": [{"body": "So teslas profit is 9% in that example?", "score": 1, "replies": [{"body": "no tesla is the contractor. pg&e is the regulated utility.", "score": 1, "replies": []}]}]}]}]}]}
{"title": "Would you go long shares + debit put spread to hedge a naked long call?", "selftext": "Hi all, curious what some of theta gang would do in a present situation.  \n\n\nIt started with   \n1. An earnings strangle 58/80 on AMD for Aug cycle  \n2. AMD went straight up to 78 post earnings. I closed out the put and rolled the call to Sept at the same strike. Now i have a naked 80 call in AMD  \n3. AMD blew past 80 to 85 this past session. I was wondering if we can hedge further potential losses should AMD continue its run  and reduce my deltas (around 65 now). I thought of going long stock at 85, but to hedge the potential intrinsic losses from the long stock position should AMD go back down , initiate a debit put spread at 85/75.   \n\n\nI know the downside of this is the additional buying power required for both additional positions.  Generally for naked calls the advise is to roll it out in time to collect more extrinsic value. However if one is already in the Sept cycle with still 45 days to go, that might not be the most ideal step. I haven't seen anyone else do something similar (maybe cause of the adding BPR component?)", "id": "i3vr5x", "created_utc": 1596589198.0, "score": 7, "upvote_ratio": 0.82, "num_comments": 15, "comments": [{"body": "Given that it’s a tech stock in this market, you’re probably best buying the stock to cover or buying a call to cap the loss. Normally it’s a terrible way to manage, but people are buying tech stocks as if they were tulip bulbs. The way things have been rallying, it could go up another 15% before meaningful pullback.", "score": 2, "replies": [{"body": "Tulip bulbs. lol", "score": 1, "replies": []}]}, {"body": "I was in a similar position but I rolled up my 40p to my 75c for a straddle to collect a credit. I didn't want to leave a naked call for this reason. Once amd moved passed my strikes I didn't want to continue rolling this losing position and closed for a loss and opened a new csp. Sometimes you gotta take the loss.", "score": 1, "replies": [{"body": "Yup, i generally hate to leave naked calls on single names as well, but guess the one time i did it went against me haha", "score": 1, "replies": []}]}, {"body": "Open a new put credit spread and make your short call into a call debit spread take a small loss on the long call position but hey it’s better than losing overall", "score": 1, "replies": []}, {"body": "I wouldn't do that. Instead, I'd go long a number of shares that gets you to 0 delta with the call. So if the short call is at 60 delta, buy 60 shares. Then keep adjusting your hedge while theta eats the call extrinsic value (\"reverse\" gamma scalping)", "score": 1, "replies": [{"body": "Right, thanks for the suggestion. I guess its one way to limit the losses to current intrinsic losses if AMD continues to run up. For some reason the buying power required for 65 shares is 50% more than that of 100 shares (maybe since i have an equivalent short call so that BP is offset there, but not for the 65 shares), so it gives me less incentive to engage in this.", "score": 2, "replies": []}, {"body": "You screw the return, but probably better than otm call", "score": 1, "replies": []}]}, {"body": "On  the longside you should always hedge with a OTM call because theorically it can goto infinite", "score": -1, "replies": [{"body": "Yup i get that. Something to learn for especially with a non-ETF ticker that could run like AMD. However at this point this seems to be not ideal.   \n\n\nIf i were to go buy the 90 call, to create a 80/90 call spread, it would cost about $5, which would be > than my credit collected ($3.40) for this leg. i would end up with a debit of $1.60 for a $10 wide credit spread. where i.e best case i lose $160, worst case i lose $1000.", "score": 2, "replies": []}, {"body": "Disagree", "score": 0, "replies": [{"body": "You disagree even though your other comment you agree that you should hedge a call?", "score": 2, "replies": [{"body": "He is hedging his comments. If you take both sides of the position, you can't lose.  : )", "score": 3, "replies": [{"body": "His points seem consistent to me. And I happen to agree with both", "score": 1, "replies": []}]}, {"body": "Yeah. Not sure why I'm getting downvoted here, there are plenty of reasons why selling naked calls can be a good trade.\n\nIn the other reply I was answering OPs question about how to go about hedging his short call. That's different than this guy saying you should always hedge with a further OTM call.", "score": 2, "replies": []}]}]}]}]}
{"title": "Made a few $ today. Don't know why I didn't know about this stuff earlier..", "selftext": "So I made $46 (minus the dollar whatever in fees from TOS..) today selling a Covered Call (30.5 SPCE) and a CSPut (10.5 AAL).\n\nAccording to my Return on Capital Risked (rolling accumulation of % I make back off what I've risked, since it's basically been the same $1,000 - 3,000 over and over) I'm up 19.58% or so since I started on June 1st.\n\nI feel like a fucking idiot for not having learned about doing this 20 years ago", "id": "i4cnqo", "created_utc": 1596657722.0, "score": 12, "upvote_ratio": 0.72, "num_comments": 17, "comments": [{"body": "I wouldn't claim victory quite yet.  We will see how easy you think this is after a period where volatility takes a huge jump instead of the slow meltdown we've had over the last few months.", "score": 13, "replies": [{"body": "I'm not playing anything crazy, a few % of my portfolio. Most is dividend growth investing, and this is just to add extra income selling options with less than 15 Delta", "score": 5, "replies": [{"body": "Can you please elaborate on \"dividend growth investing\"?", "score": 1, "replies": [{"body": "https://www.thebalance.com/making-money-with-the-dividend-growth-investing-strategy-357877", "score": 1, "replies": [{"body": "Thanks.  I'm learning about alternative approaches to investments. I hear dividend kings mentioned now and then. Did you manage to get more out of it than you would from same investment into SPY or similar? What is return in reality?", "score": 2, "replies": [{"body": "I don't know that I have any Kings, but I have some Aristocrats.\n\nMy thought is that I can just keep letting it snowball for as long as possible while they give me a 5-10% raise basically every year, and by the time I'm ready to retire I just turn off DRiP and collect the checks instead", "score": 1, "replies": [{"body": "Sounds like a solid strategy. Own something which returns you 5-10% in cash sounds nice. However, yahoo finance says that SPY 10 year return has been 13.84% (https://finance.yahoo.com/quote/SPY/performance?p=SPY) which is more than 10% on dividends you mention. As I'm learning about investing in general I'm probably missing some other aspects of this investment. Why would you prefer 5-10% from dividend aristocrats instead of 13.84% from SPY? I guess there are some other important things I don't understand. I'm asking to learn about it.", "score": 1, "replies": [{"body": "5-10% dividend increase every year (say a 2% yield turns into 2.1%, then 2.21%, etc.). The dividend yield + capital appreciation would be higher - ie I'm up 33% on my entire taxable portfolio so far this year", "score": 2, "replies": [{"body": "Right, I didn't consider asset appreciation as well as dividend yield. Thanks for the explanation.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Same thing happened to me a month ago. Realized all my dividends were suspended cause of covid. Looked into generating income with long positions, figured out that selling premium to autists was good money. \n\nThis weeks awkward bull run on things is probably going to get me assigned on some OTM calls i wrote for 15% gains on some dogs i still hold. Guess now is as good a time as any to rearrange my portfolio", "score": 9, "replies": [{"body": "I would roll those calls into next month", "score": 2, "replies": []}]}, {"body": "20 years ago many of your trades may not have been free. Something to keep in mind.", "score": 7, "replies": [{"body": "That is a very good point - more than half of my initial trades were $5 profit swinging Ford", "score": 3, "replies": []}, {"body": "Also weekly options are available from 2012 I think.", "score": 1, "replies": []}]}, {"body": "Welcome to the SPCE Covered Call Crew! I’ve learned weeklies are the best for this stock. I sold a $23 and $24 expiring this week before earnings and collected 90%+ on those, rolled them out to a next week $22 and the following week $23 because premium got clapped. Best of luck!", "score": 5, "replies": []}, {"body": "Didn't SPCE drop 2$ today? That's like 5x the premium you collected from selling those options?", "score": 6, "replies": [{"body": "What does that have to do with income on shares I already own?", "score": 3, "replies": []}]}]}
{"title": "TGT 140 08/21", "selftext": "Today target 135 8/21 calls printed. Still got a fuckload and planning to grab 140 8/21 tomorrow. Their last earnings they beat EPS BY 46%. EVERYTIME I GO TO TARGET LINE IS TO PRPL MATTRESS STORE AND STORE IS EMPTY SO YES GET IN FREE TENDIES", "id": "i3w2zj", "created_utc": 1596590493.0, "score": 16, "upvote_ratio": 0.84, "num_comments": 14, "comments": [{"body": "Keep talking shit about PRPL and it'll moon harder", "score": 14, "replies": [{"body": "Bro I’m balls deep in PRPL mattress", "score": 8, "replies": [{"body": "I was balls deep in ur mom last night", "score": 5, "replies": [{"body": "Im glad", "score": 1, "replies": []}]}]}, {"body": "PRPL aint tesla or SPCE.. shit aint mooning.. there is always someone left holding the bags.", "score": 0, "replies": []}]}, {"body": "Did this somehow end up being a PRPL pump post?", "score": 3, "replies": [{"body": "It was always a PRPL post", "score": 4, "replies": [{"body": "Always has been", "score": 3, "replies": []}]}]}, {"body": "Yo at $1.14 it’s a steal.  I honestly think this will hit $150.  I’m in on Atleast 20 tm.", "score": 3, "replies": []}, {"body": "it is time to stop tickling balls and start sucking your dreams dick", "score": 2, "replies": [{"body": "comment of the century", "score": 1, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/sh3rcko don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Back to school and tax free weekend this week. Walmart was printing until it took a dump. Good thing I said that I had enough and got out before the dump.", "score": 1, "replies": []}, {"body": "I just got TGT 300 8/21 shits gonna print hard", "score": -2, "replies": []}]}
{"title": "Walmart?", "selftext": "[removed]", "id": "i45ptg", "created_utc": 1596635527.0, "score": 7, "upvote_ratio": 0.82, "num_comments": 13, "comments": [{"body": "source: I work for walmart (cashier or office u decide)\n\n\nIm bullish", "score": 7, "replies": [{"body": "Have y’all been gearing up for WMT+ ? It was supposed to launch last month", "score": 1, "replies": [{"body": "I only learned about it when the public did actually. My work has nothing to do with it. But I will say that last earnings our e-commerce grew by 74%. Walmart groceries has a real chance of being an existential threat to Amazon if they do it right", "score": 4, "replies": []}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Walmart also sells online", "score": 1, "replies": []}]}, {"body": "Shit the supermarkets around me where constantly poppin. Worth throwing a few wads of cash at. I mean it’s either that, or fat otm spy calls", "score": 3, "replies": []}, {"body": "Judging by CVS I would say they will beat earnings but then shit the bed anyways. Plus they have the growing issue of the Walmart + fail.", "score": 1, "replies": []}, {"body": "You better be buying this dip! But for real when the fuck is Walmart+ coming?", "score": 1, "replies": []}, {"body": "Walmart is also starting a drive-in movie business", "score": 1, "replies": []}, {"body": "I’m on this train as well but do not hold through earnings under any circumstance is my advice.", "score": 1, "replies": [{"body": "Yep. I fucked myself on UPWK yesterday. I told myself this time would be different, but obviously it wasn't.", "score": 1, "replies": []}]}, {"body": "8/18 132 call checking in", "score": 1, "replies": [{"body": "You don't even know what you own...", "score": 1, "replies": []}]}]}
{"title": "Why does purple have a higher short float % then Nikola?", "selftext": "NKLA 11.21\n\nPRPL 13.22\n\nIs the tesla of beds going to crash soon or something?\n\nI mean I would understand a crash, I moved 100% of my portfolio into purple calls yesterday.", "id": "i45saf", "created_utc": 1596635783.0, "score": 22, "upvote_ratio": 0.85, "num_comments": 19, "comments": [{"body": "PRPL will continue to rise up to and through earnings.  $70-$100 by year end.  Not a mattress company; it is a tech innovation company currently using mattresses etc. for sales.  More to come.....", "score": 39, "replies": [{"body": "it will continue to rise up until earnings but not because they are a tech company... because they clearly are not", "score": 15, "replies": [{"body": "Idk your mattress might feel like a cloud but my mattress lives on the cloud", "score": 6, "replies": []}]}, {"body": "PRPL 100c 08/21!", "score": 13, "replies": [{"body": "I’m laughing but man I am hoping for this", "score": 3, "replies": [{"body": "If it hits 100 I will get a tattoo of the wsb guy on my ass", "score": 9, "replies": [{"body": "Fuckit. Me too. Although if it hits $100 I’m gonna look like randy marsh when he finally found him some internet. So I’ll need to clean up first.", "score": 3, "replies": []}]}]}]}, {"body": "I can't even tell what's real anymore", "score": 1, "replies": []}]}, {"body": "bullish. short squeeze", "score": 8, "replies": []}, {"body": "What’s wrong with you guys? It’s a mattress company", "score": 7, "replies": [{"body": "Lollllllllllll", "score": 1, "replies": []}]}, {"body": "Right now is THE time to buy up calls/average down if you haven’t been. 24$ atm. Easy money ppl. Just liquidated my portfolio(what wasn’t already prpl) and bought more 8/21 30cs", "score": 4, "replies": [{"body": "Are you serious? My spreads I just bought are down 20% and I'm wondering if it's the right move...", "score": 5, "replies": []}, {"body": "Dude that’s way too risky. I’m a PRPL believer but you need to get later expiry. At least Oct. I’m siting on majority Jan 35, but I bought some Oct 35 on dip yesterday", "score": 2, "replies": []}, {"body": "Ah, nm you just started buying them...", "score": 0, "replies": []}]}, {"body": "Purple $15 EOM", "score": 10, "replies": [{"body": "My puts bought at 27$ agree", "score": 3, "replies": [{"body": "You may not like it, but this is what peak performance looks like.", "score": 0, "replies": []}]}]}, {"body": "Maybe cause of the warrants, big supply of calls makes protective calls cheaper, so hedged shorting is cheaper.", "score": 1, "replies": []}]}
{"title": "$TRU Possible Covid-19 game changer for the United States and the world?(On August 6th 3 pm)", "selftext": "This link provides a slideshow transunion put together:\nhttps://solutions.transunion.com/healthy-america/resources/file/healthy-america-project-plan-2020.pdf\n\nFor the past month I’ve been trying to find the next big thing and I think I may have finally found it. TransUnion, SiriusIQ and UST Global are partnering up to make a joint venture company called CLX Health LLC. CLX Health LLC is introducing an app called Healthy America™️  that is set to be announced on August 6th to the world. The media will be disclosing it at 3pm EDT on August 6th. \n\nWhat does it even do?\nThis link provides all the information you need without having to read all of that down there:\nhttps://solutions.transunion.com/healthy-america/resources/file/healthy-america-project-plan-2020.pdf\n    \nMessage from TransUnion on Healthy America:\n\nIn a world forever changed by the COVID-19 crisis, we’re committed to protecting American lives. TransUnion and its US-based healthcare technology partners have developed HealthyAmericaTM. This unique solution enables people to securely share test results, helping businesses, schools and consumers assess risks stemming from COVID-19 and interact in a safe, confident manner.\nHealthyAmerica combines the power of TransUnion’s identity and fraud solutions, clinical data management capabilities of SiriusIQ, and business transformation assets of UST Global — together forming CLX Health, LLC. By leveraging and deploying our existing technology in a way consumers and businesses can readily adopt, it will be easier to mitigate risk in everyday interactions while maintaining individual privacy. Going forward, we expect airlines, large event organizers, restaurants and others will leverage the tool — which will easily adapt to changes in science parameters, including the evolution of a seasonal vaccine.\n(https://solutions.transunion.com/healthy-america/?=undefined)\n\nWhat Healthy America is:\n\nCLX Health LLC, a joint venture company, has developed the HealthyAmericaTM mobile application to be deployed as a key component of the HealthyAmericaTM Solution Architecture and Database. The CLX Consortium of partner companies have come together to manage the spread of COVID-19 and other viruses by accessing real-time laboratory testing data for operational business and consumer decision support, ultimately allowing the economy to scale back up to capacity.\nUtilizing existing technology and infrastructure critical to delivering a solution now, the CLX Consortium has network access to over 1 million physician offices, 22 largest by volume clinical laboratories, 40 major hospital systems and 20 Federally Qualified Health Clinics (FQHC) in the United States.\nIn much the same way TSA PreCheckTM provided airline passengers with an increased level of confidence after 9/11, the HealthyAmerica application is positioned to mitigate risk of businesses and individuals. With TSA PreCheck in place, passengers returned to travel with assurance that fellow travelers had been screened and posed little to no risk. The HealthyAmerica application manages real-time and batch files of health status requests for consumers to provide businesses and facilities operational decision-making capabilities that can mitigate exposure to employees and clients.\nLike the TSA PreCheck status, which is delivered in bulk to airlines and directly to the consumer via a Quick Response (QR) code, HealthyAmerica enables consumers to present a QR code indicating health status. With the HealthyAmerica QR code, individuals can securely gain access to government-restricted sites, such as airports and/or sporting events, as examples.\nThe HealthyAmerica application works in the following manner, first requiring the individual consumer to register. Consumer identity is verified in combination with mobile device authentication, then the consumer selects a laboratory, schedules testing and receives validated test results—all within the application on the consumer’s verified device. The HealthyAmerica application stores diagnostic or antibodies test results received directly from an FDA-approved laboratory and generates a QR code indicating current health status.(https://www.siriusiq.com/siriusiq-introduces-clx-health-and-develops-healthyamerica-tm-as-virus-response-mobile-application/)\nMy summary and analysis:\n\nOkay so this app basically gives verification to other people on whether you have Covid-19 or not wherever you go. First you start off by scheduling a testing through the app for antibodies and then you send the tests to SiriusIQ labs where they see if you have antibodies. TransUnion then verifies your identity through your social security number making sure it’s you. Then the data is stored in the app which is federally regulated and presents proof of your safety from Covid-19. You can also opt in or not for contact tracing on it to see who is infected and not. I think businesses, airports and big events like baseball games will soon require this because it‘s as simple as scanning a QR code or sending a verification online through the app to wherever you're going to check if you are safe to be there both to yourself and others. It provides a more organized and safer way to open up the country and European countries as well and yes they have been approved by the European Union on this. Anyways I think this can allow countries to  open up in a safer way then the first time they tried. This would help both the economy and stock market. This will all go down on August 6th at 3 pm (EDT) when they announce the application and the media is to announce it at that time as well.\n \nWho are these companies TransUnion is teaming up with?\n\nTransUnion- TransUnion is a global information and insights company that makes trust possible between businesses and consumers, by ensuring that each consumer is reliably and safely represented in the marketplace. They do this by having an accurate and comprehensive picture of each person. This picture is grounded in their foundation as a credit reporting agency which enables them to tap into both credit and public record data; their data fusion methodology that helps us link, match and tap into the awesome combined power of that data; and their knowledgeable and passionate team, who stewards the information with expertise, and in accordance with local legislation around the world.\nhttps://www.transunion.com/about-us/about-transunion\n\nSiriusIQ- SiriusIQ provides cloud-born Master Orchestration and Automation of data to streamline business processes, conversations, analytics and more. Offering enterprise-level solutions that are faster, better and smarter, SiriusIQ integrates native Cloud Services, Human-Assisted AI, Continuous Integration Continuous Delivery of Data and Subject Matter Expert Collaboration.\n\nUST Global- UST Global is a technology partner dedicated to transforming businesses, communities, and the people who live within them. Operating in 25 countries, we deliver future-ready digital transformation strategy services, products, and platforms that create new possibilities and help you imagine what’s next in ﬁnancial services, healthcare, retail, manufacturing, semiconductor, and communications. But what matters most is the deep partnership we forge with you to solve the unique challenges you face today, while preparing you for tomorrow. That’s us together. That’s UST Global.\n(https://www.ust-global.com)\n\nThese are obviously three reputable companies that are working together and I think this can potentially be big.  Especially since it has to do with easing the pandemic I know investors will go crazy over it.\n\nLet me know what you guys think down below.", "id": "i45ul3", "created_utc": 1596636015.0, "score": 5, "upvote_ratio": 0.69, "num_comments": 19, "comments": [{"body": "If people won’t wear masks why would they use this?", "score": 6, "replies": [{"body": "So they can have a good reason not to wear a mask lol", "score": 2, "replies": [{"body": "I like the idea but would rather trade CLX Health if they were publicly traded. Also people will just compare this to China and not use it", "score": 1, "replies": [{"body": "They are going to be publicly traded by a reverse merge through a OTC stock called PASO in the 4th quarter. I was just thinking this can have a good run up when the media talks about it on the aftermarket.", "score": 1, "replies": []}]}]}]}, {"body": "Fuck those words", "score": 9, "replies": []}, {"body": "Ticker. Options ?", "score": 3, "replies": [{"body": "Yes", "score": -8, "replies": []}]}, {"body": "So, you're saying that a large consumer credit reporting service that has proven it is unable to securely store personal financial information is now going to get in the game of collecting personal health information?  Cool.  Very cool.", "score": 3, "replies": [{"body": "And you are going to make claims without anything to back it up? Very cool.", "score": -2, "replies": [{"body": "https://www.cbc.ca/news/business/transunion-data-breach-1.5315488\n\nhttps://www.databreaches.net/hk-transunion-in-new-apology-amid-leak-fear/\n\nhttps://www.classaction.org/news/trans-union-hit-with-another-fcra-lawsuit\n\nhttps://www.reuters.com/article/transunion-fcra-lawsuit/9th-circuit-affirms-transunions-fcra-violation-with-blacklist-false-ids-reduces-award-idUSL2N2AS0DK", "score": 4, "replies": [{"body": "Old news. They have definitely reinforced their cyber security by now.", "score": -4, "replies": [{"body": "In what ways?", "score": 1, "replies": []}]}]}]}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/AidanVillegas don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "View in your timezone:  \n[August 6th at 3 pm EDT][0]  \n\n[0]: https://timee.io/20200806T1900?tl=%24TRU%20Possible%20Covid-19%20game%20changer%20for%20the%20United%20States%20and%20the%20world%3F(On%20August%206th%203%20pm)", "score": 1, "replies": []}, {"body": "How do you Know the date of presentation? I didn’t see anything about that", "score": 1, "replies": [{"body": "One of the board members tweeted it.", "score": 1, "replies": []}]}, {"body": "Bought some 100c 8/21 leaps", "score": 1, "replies": []}]}
{"title": "Another PRPL dip for those believers!", "selftext": "PRPL broke through yesterdays resistance area of 24.40-24.50 and has dropped down to 23.88 as of now. For those that still believe in our mattress daddies, now is a time to keep a damn close eye on it and buy in if it looks like its starting to bottom on the correction.\n\n&#x200B;\n\nFor those PRPL naysayers, enjoy your gains and jeers now, if you have puts, also keep an eye on it and cash out before the recovery!\n\n&#x200B;\n\n&#x200B;\n\nFor reference, a 'safer' play may be to Sell covered calls with equity, buying 100 shares for each contract. As of the 23.88 price, you can buy 100 shares and simultaneously sell a covered call for 8/21 $30 for the effective share price of 22.47.  \n\n\nThe PRPL guru's think $30 by 8/21 may be a bit high, but if it hits, solid $750 profit per contract, if not sell more covered calls and watch your tendies grow!\n\n&#x200B;\n\nPRPLW warrants are around 6.50 currently as well. Another great way to cash in while avoiding IV crush.", "id": "i46j91", "created_utc": 1596638490.0, "score": 26, "upvote_ratio": 0.81, "num_comments": 18, "comments": [{"body": "[removed]", "score": 20, "replies": [{"body": "I did, used the allowance my wife's boyfriend gave me to double my portfolio (sounds cool to say double, wasnt really that much lol), and spend it all on PRPL shares at $24 even.\n\n&#x200B;\n\nIn a few days when it clears, I'll be selling covered calls and cashing in.", "score": 6, "replies": []}, {"body": "Fun fact for all the new friends: this meme was the top post on this subreddit the day after the start of the big one in February.", "score": 1, "replies": []}]}, {"body": "How do warrants work?", "score": 5, "replies": [{"body": "Warrants grant 1/2 share plus 5.75 exercise price. So the same price as the stock. OP is retard and didn't do his DD", "score": 5, "replies": [{"body": "Yes, they are the same price, and as the stock recovers and continues its rally so will the warrants. However, unlike Calls, they wont plummet from IV crush after earnings when a bunch of PRPL gang cashes out profit.\n\n&#x200B;\n\n&#x200B;\n\nBut yeah, you explained the how they work part, so updoot for you!", "score": 2, "replies": []}]}, {"body": "In addition to what CorrosiveRose said, keep in mind these will essentially 'expire' (bought back for 0.01 each) if PRPL trades over $24 for 20 out of 30 days. I'm no warrant expert, but I'd assume this means closing price of the share rather than intraday.\n\n&#x200B;\n\nThe play on these would be either wait until the spread separates some and its worth exercising, or just ride them up and sell out later as essentially a 'cheaper' share.", "score": 2, "replies": []}]}, {"body": "If you are a little hesitant about the share price, you could also sell 8/21 22.5p for \\~2.40 per right now, giving you a \\~$20 entry price if assigned.", "score": 6, "replies": [{"body": "Updoot for this great comment. PRPL is a prime wheel target.\n\n&#x200B;\n\nI'm currently holding a lot of credit put spreads as well and plan to take assignment of what I can with cash on hand, then just selling the short leg rather than letting both legs exercise/assign. Would only be able to afford about 2 assignments though, the rest would have to use both legs lol.", "score": 3, "replies": []}]}, {"body": "I believe. Grabbed a couple stonks this morning.", "score": 3, "replies": []}, {"body": "Bought more $20, $22.5, $25 and $30.  I hope the whiners continue to push it down, as leading up to ER on 8/13 it will shine!!!  $70-$100 by year end.  People think it is a mattress stock - no idea of the underlying tech innovation play.", "score": 6, "replies": [{"body": "What is the underlying tech innovation?", "score": 5, "replies": [{"body": "Big purple dildos with Bluetooth", "score": 11, "replies": []}, {"body": "Do you watch and read prospectus?", "score": 1, "replies": []}]}, {"body": "Bought in as well, this time shares and will be selling covered calls against them at a pretty high spread once the deposit clears fully.\n\n&#x200B;\n\n8/21 $35s and such.", "score": 2, "replies": []}]}, {"body": "No.", "score": -5, "replies": [{"body": "You're flair says you're already in a gang... cant be in prpl gang too. Its ok, you made bad choices when younger and now the only way out is in a box.\n\n&#x200B;\n\nFor prpl gang, the only way out is on a Purple4 heading to tendie town.", "score": 8, "replies": []}]}]}
{"title": "FLIR 45/50c 8/21 - Earnings Play", "selftext": "I bought FLIR 45/50c 8/21 x10 at about $0.65 a little while back when all of the DD posts were floating around. I don't have much to add, except that with the earnings coming up tomorrow, there was a medium amount of buying volume at close yesterday and at open today. It's calmed down a little since, but I think these will print.\n\nFLIR was trading for a little above $50 pre-crash and I think they will be heading back there. $1 now could get you $5.\n\nMaybe Sept 18th might be safer for @ $1.2 for a 4 bagger.\n\nI also have a 50/60 1/15/21 and if they post good guidance I'll add to this position.", "id": "i46jg6", "created_utc": 1596638512.0, "score": 10, "upvote_ratio": 0.73, "num_comments": 18, "comments": [{"body": "I have been long on these guys for a while. I hold some of the same LEAPs. I am undecided to sell my AUG 40c or sell the 50s for protection. \n\nI appreciate these posts. It helps me learn from others strategies and ways of thinking. So thanks for posting.", "score": 5, "replies": [{"body": "Oof.", "score": 1, "replies": [{"body": "luckily i sold a lot to move around cash. their ER call was a total shit show. i sold everything. I have zero faith in these guys right now.", "score": 1, "replies": [{"body": "Why was it a shitshow?", "score": 1, "replies": [{"body": "Man, are you an asshole or do people not like you? I've never seen so many downvotes lol. \n\n\"Flir Systems Inc. (FLIR) said it has withdrawn its previously issued guidance for the full year ending December 31, 2020 due to the significant uncertainty generated by the COVID-19 pandemic.\"\n\nThe CEO gave no forward guidance, nothing. Just not what anyone was hoping, especially from a company that was supposed to benefit the most.", "score": 2, "replies": [{"body": "Weird, it says I only have one upvote. Thanks though, too bad the CEO screwed it up for the rest of us.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I nibbled only because I recognize your name and you seem slightly less retarded than everyone else around here.\n\n8/21 50c", "score": 4, "replies": [{"body": "Calling me slightly less retarded than everyone else is literally the nicest thing someone can say on this sub.", "score": 12, "replies": [{"body": "You've earned it, old man", "score": 3, "replies": []}, {"body": "Ok boomer.\n\nGet some puts just in case", "score": 1, "replies": []}]}]}, {"body": "I got in a few days ago at $40.90.\n\n350 shares\n\n10 45c 8/21\n\n5 50c 8/21\n\nUp 55% on the calls and 4% on the shares so far. Selling tomorrow morning if it pops at all.", "score": 3, "replies": []}, {"body": "been in for a week up 60%. I think they will beat and it is definitely not priced in.", "score": 2, "replies": []}, {"body": "FLIR puts \nWatch it behave like every other earnings that beat & dipped", "score": 2, "replies": [{"body": "I'm only in for $650 which is up 50% and they are spreads dated out several weeks. Even if they dip after earnings and I sell, I'll probably only lose a few hundred because there will be enough Theta left on the bones.\n\nIf it actually drops, I'll sell 39/38p and make my money back because that's probably where it will stabilize.", "score": 2, "replies": []}, {"body": "Well played.", "score": 2, "replies": []}, {"body": "So did you win?", "score": 1, "replies": []}]}, {"body": "Got the same debit spread x8 here.  Gl friend.", "score": 2, "replies": []}, {"body": "I found Boomers usually disturbing especially when they end up on a site like WSB but I'm glad you are here to lend some sanity to an assylum.", "score": 2, "replies": []}]}
{"title": "Discussion on Walmart, Lowes and Home Depot", "selftext": "[removed]", "id": "i47kd3", "created_utc": 1596641912.0, "score": 0, "upvote_ratio": 0.42, "num_comments": 16, "comments": [{"body": "LOW 8/21 $155c", "score": 6, "replies": [{"body": "Thanks", "score": 2, "replies": []}]}, {"body": "LOW 8/21 152.5C", "score": 5, "replies": [{"body": "Thanks", "score": 2, "replies": []}]}, {"body": "All 3. Lowes over hd if u have to choose", "score": 3, "replies": [{"body": "Do you have any positions? Im leaning more towards Lowes also, then HD then walmart", "score": 1, "replies": [{"body": "Nah i dont yet sorry", "score": 1, "replies": [{"body": "No worries thanks for your input", "score": 1, "replies": []}]}]}]}, {"body": "I don’t think the guidance will be there. I’m probably wrong but my gut is telling me not to do it. Might play up to earnings but not through.", "score": 3, "replies": [{"body": "Ya I don’t think it will play through earnings but I could see a play up to earnings. I am also new to trading so could be wrong. I just see most of these stocks that have somewhat positive outlook seem to follow the trend of going up to earnings", "score": 1, "replies": [{"body": "Go look at CLX for an example. Great numbers. Poor guidance. Tanked after earnings.", "score": 1, "replies": []}]}]}, {"body": "No", "score": 6, "replies": [{"body": "Appreciate you", "score": 0, "replies": []}]}, {"body": "Those were essential industries that everyone knew would remain open, that doesn't necessarily mean the stock will soar.\n\nThe options are also kinda expensive, because markets are still a bit volatile and a lot of people are buying options, driving up the price.\n\nAltogether, if I were buy options with them, I'd go for some sort of bullish credit spread.", "score": 2, "replies": []}, {"body": "Fuck off.", "score": 0, "replies": []}, {"body": "Good companies but stonks setting up for a pull back.", "score": 0, "replies": []}]}
{"title": "AAPL, BRK, BAC. Let's find out if you can really buy the news.", "selftext": "https://markets.businessinsider.com/news/stocks/warren-buffett-berkshire-hathaway-almost-25-percent-bank-of-america-2020-8-1029465456\n\nhttps://www.cnbc.com/2020/08/05/bank-of-america-downgrades-apple-citing-a-number-of-risks-including-valuation.html\n\nI posited in an earlier post that the top investors at Apple pushed for the 4:1 split, expecting either retail bagholders or increased liquidity for options. (Maybe that last idea developed in the comments.)\n\nEither way, Bank of America pissing on AAPL can't fit into Warren Buffet's master plan. So he doubled his position on BAC. I know the timing is a little off, and bank PE values are low making them a good long-run buy. But in this coincidence I have a theory that the analyst's rating will be adjusted to take into account some news happening in the next 10 days. What news? Anything. Because the new 25% owner doesn't want to see infighting.\n\nThe human mind project intentions on to the way sand swirls on a dune. Let's see if this one plays out.", "id": "i47mxn", "created_utc": 1596642134.0, "score": 12, "upvote_ratio": 0.79, "num_comments": 20, "comments": [{"body": "[deleted]", "score": 13, "replies": [{"body": "I know! Ninja edit. I heard Neutral really means sell. I'd love to be selling at $470.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "you mean like Goldman Sucks tried to do before earnings and ended up failing?", "score": 2, "replies": []}]}]}]}, {"body": "I question why Warren is buying more Bank of America rn... isn’t it bound to hit $20 again before the year is over?", "score": 4, "replies": [{"body": "They’re not paying retail for it..", "score": 3, "replies": [{"body": "Sure, but the question still stands; why is Buffett buying more $BAC now, when we all know the numbers look bad for banks?\n\nI'm bullish on $BRK.A/B, but only because I think Buffett knows his shit better than me. I'm cautious on going to heavy in BRK.B because if he's wrong, his fund might never recover after a back to back miss with that and the airline stocks.", "score": 2, "replies": [{"body": "He’s not thinking Q3, or even the rest of 2020, or even 2021 for that matter. Banks aren’t going anywhere.", "score": 4, "replies": [{"body": "Dudes not going to be around in 2022 lawl", "score": -4, "replies": [{"body": "but his legacy will, not sure about yours.", "score": 5, "replies": []}, {"body": "You think that dude gives a fuck? He’s kiss my ass rich.", "score": 1, "replies": []}]}]}, {"body": "> Sure, but the question still stands; why is Buffett buying more $BAC now, when we all know the numbers look bad for banks?\n\nA few reasons:\n\n1 - Value investing/fundamentals.  BAC is underperforming its counterparts when it comes to recovery (WFC and C are performing about the same, JPM, BNS, RY, TD, BMO are all performing better).\n\n2 - Market cap/liquidity.  For Buffet to make a worthwhile investment, he needs to deploy a significant amount of capital.  A company with a higher market cap is usually easier to invest in (in this regard).  BAC's mkt cap is ~$220B.  C and WFC are ~$100B.\n\n3 - Industry rebound.  Banking is underperforming right now.  The sector will probably perform better in the future.  Banking also has a generally special place in the capital markets with an ability to extract value based on the value of other companies (either via equity issues or loans).  \n\nSo if we just look at those 3 we then have a sector that will probably rebound over the next year or so, coupled with a company that will probably rebound better than average within that sector, and that company has enough liquidity/size for a large placement.", "score": 4, "replies": []}, {"body": "Banks are undervalued so much. Maybe BAC will add a trading arm. JPM and GS made a killing this last quarter.\n\nOver trillions in deposits in the banks.\n\nInterest rate goes up even 0.25% is a huge increase in rev.\n\nLoans/PPP profits\n\nGovernment roll back of regulations.", "score": 3, "replies": [{"body": "Doesn’t BAC already own Merrill Lynch?", "score": 1, "replies": [{"body": "I think Merrill is more wealth management/asset management.\n\nThey don't really have a trading division.", "score": 1, "replies": [{"body": "Ah fair", "score": 0, "replies": []}]}]}]}, {"body": "$BAC is 30% off it's high and beat earnings both of the last two quarters. What \"numbers\" are you referring to sir? Seems like everyone just scared 2008 kind of event will happen again but the dodd frank act literally prevents it.", "score": 1, "replies": []}]}]}, {"body": "Maybe big deals are hard to time. So much front end paperwork.", "score": 1, "replies": []}, {"body": "Buffett dont care about price fluctuations, buddy. He ain't a trader.", "score": 1, "replies": [{"body": "I’m aware I’m just saying why not wait a few months then buy. He’s a patient guy supposedly", "score": 1, "replies": []}]}, {"body": "It has such a huge footprint in the retail sector. Will out last all the smaller banks that could go under over the next couple of years and be close to a monopoly in a decade.", "score": 1, "replies": []}]}, {"body": "$BAC premiums are so cheap. Perfect stock for a hedge fund to buy a bunch of far OTM calls then pump over night when no one is watching.", "score": 3, "replies": []}]}
{"title": "Mercado Libre ($MELI) reporting earnings tomorrow, gonna bring you mucho tiras de pollo!", "selftext": "$MELI is the Latin American Amazon for those of you who don't know. South America is also getting rekt by the rona just like us.  The stock is entering parabolic phase this year and has a current market cap of $60 Billion USD (not pesos!). I don't really have any DD just wanted to post about it since no one else has.", "id": "i47tmr", "created_utc": 1596642736.0, "score": 11, "upvote_ratio": 0.84, "num_comments": 16, "comments": [{"body": "And no, it's not like Amazon, it's more of an eBay", "score": 7, "replies": [{"body": "But like ebay *and* PayPal right?", "score": 2, "replies": [{"body": "hmm similar to Paypal, but not as commercial and popular", "score": 2, "replies": []}]}, {"body": "tomato, tomate.\n\nAs long as it's not latin american craigslist.", "score": 1, "replies": []}]}, {"body": "Man, that site is so shit. Sure it's doing well during rona but man it's like a 10 year old built a website in 1990.", "score": 6, "replies": [{"body": "tbf, I say the same thing about reddit. yet here we are.", "score": 9, "replies": [{"body": "Haha, yup. You looking at anything else down that way?", "score": 1, "replies": []}]}]}, {"body": "One of the most exciting things about this company is Mercado Pago, a payment system that allows buyers to pay with cash - which is a huge advantage for the South American market, where many are unbanked or underbanked.\n\nI hold shares and add more whenever I can afford it.\n\nBased on AMZN’s huge beat, I think that MELI are also gonna crush earnings, along with SE, BABA, JD, CHWY, and WIX.", "score": 3, "replies": [{"body": "I buy anytime its in the 900s and haven't had a bad week holding it.", "score": 1, "replies": []}]}, {"body": "This stock has only been going up but I'm sure as I buy in, it will drop", "score": 4, "replies": []}, {"body": "Previous earning i remember they blew away all predictions. So maybe now the bar will be really high", "score": 1, "replies": []}, {"body": "Earnings moved to monday", "score": 1, "replies": []}, {"body": "They pushed back their ER to next week", "score": 1, "replies": []}, {"body": "Is anybody from latin america here? What's the deal with Arcos Dorados?", "score": 1, "replies": [{"body": "People still eat at Mc Donald’s. They also partnered up with delivery apps like globo and rappi . Still bullish", "score": 1, "replies": []}]}, {"body": "Up 63% the past 3 months. Why didn't u tell us sooner phgt. Even though expectations seem lower im sure its already priced in. \nReports on 4 days. Might be enough time for a run up. But no way should you hold past earnings", "score": 1, "replies": []}]}
{"title": "They call me Leotardo Dicaprio", "selftext": "[deleted]", "id": "i495x3", "created_utc": 1596646940.0, "score": 210, "upvote_ratio": 0.96, "num_comments": 18, "comments": [{"body": "Reotardo Handicaprio", "score": 126, "replies": [{"body": "this is the winner, I think. Perfect flow.", "score": 19, "replies": []}, {"body": "That’d be a great flair! Mods, get on it!", "score": 3, "replies": []}]}, {"body": "More like Reotardo Dicaprio", "score": 71, "replies": [{"body": "Ugh, I was so close. Literally a letter away.", "score": 23, "replies": []}, {"body": "*Deotardo Licaprio*", "score": 5, "replies": []}, {"body": "Tobey Maguire", "score": 4, "replies": []}, {"body": "https://youtu.be/ZbjRjqdxTQI", "score": 1, "replies": []}, {"body": "Retardo Putscaprio", "score": 1, "replies": []}]}, {"body": "Ur more of a Gilbert Grape.", "score": 10, "replies": [{"body": "Take it back right now mister", "score": 7, "replies": [{"body": "Someone go check there nearest water tower for OP.", "score": 3, "replies": [{"body": "Also I would like to posit my theory that the Whats eating Gilbert Grape and Step Brothers happen in the same universe. And that Gilbert is banging his friends mom, the father wins the 2 kids we see in the scene, leaving John C Reilly's character to live with his mom.", "score": 3, "replies": []}]}]}, {"body": "\\*Arnie", "score": 2, "replies": []}]}, {"body": "Prpl 100c 08/21", "score": 11, "replies": [{"body": "This is the way.", "score": 4, "replies": []}]}, {"body": "The correct term is Leonardo Retardo\n\nhttps://youtu.be/c0CSSykJ9aE", "score": 4, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": []}]}]}, {"body": "Please tell me you bought puts, so I know my calls are safe.", "score": 2, "replies": []}]}
{"title": "STMP could be UPS 2.0", "selftext": "I posted this play when they where at $260 Sunday night $280c 8/14 $16.95 premium... there at $2675 now and earnings should be up now obviously in this market that doesn’t mean shit apparently I was confident in Activision but we all know how that one went I did great on UPS after everyone told me it was “ already priced in”\n\nWe got more room to fly or what bois ? \nTheir premiums are also low volume idk what’s the play here?", "id": "i4d1aw", "created_utc": 1596658914.0, "score": 4, "upvote_ratio": 0.7, "num_comments": 14, "comments": [{"body": "The play on this is theta gang. Hope you bought before close today for a free 100% gains.", "score": 6, "replies": [{"body": "I did not buy in lol", "score": 3, "replies": [{"body": "That’s okay. Can’t lose money if you don’t.", "score": 4, "replies": []}]}, {"body": "I will be selling my condor tomorrow assuming I survive Roku and Etsy", "score": 2, "replies": [{"body": "I missed bigly on $W. Gut said no so I passed. Would’ve secured like 90% of max profit today. Oh well. I played $280 put calendar spread on it. BoL to ya.", "score": 3, "replies": []}]}, {"body": "That is some serious premium!", "score": 2, "replies": [{"body": "IV man. Theta crush accelerates towards expiry, so I sell an 8/7 $280 for $16xx and buy an 8/14 $280 for $20xx. Theta on the 8/7 is like -5.7 and only like -1.6 on the 8/14. Most of that will realize at open, which is about the amount I paid to open the position. Rinse and repeat.", "score": -1, "replies": []}]}, {"body": "Fuck me 🥵", "score": 1, "replies": [{"body": "I closed my $280p at open for like 15%. Glad I did.", "score": 2, "replies": []}, {"body": "I been in it since early June.\n\n\"Daily Discussion Thread for July 02, 2020 by AutoModerator in wallstreetbets\n\n[–]Nyc_Johnny 1 point 1 month ago \nSTMP broke 200 again. Wooo\"\n\nI'm rich bruh", "score": 2, "replies": [{"body": "Fyjdjdskdkthsts how I feel", "score": 1, "replies": []}]}]}]}, {"body": "Still do not understand their business model. How can they be successful while Pitney and USPS are not?", "score": 2, "replies": [{"body": "Fuck me bud that shit flew I knew it dog 🤕🥵", "score": 0, "replies": []}]}, {"body": "I was long UPS and I took gains before earnings by selling. I missed out on $1500 because of it.", "score": 2, "replies": []}]}
{"title": "Shout Out to the HUYA DD Autist", "selftext": "Where the fuck is that guy? Does anyone remember the straight paper back novel that guy wrote about his fucking kid watching online gaming or some shit?! It was such a piece of narrative mastery that I bought straight stock in HUYA, and have been regretting it wasn't calls ever since because its up over 40% since that post. Wherever that guy is, probably on a Tesla roadster in space doing blow off a great apes pinky nail, thank you.", "id": "i4d1pb", "created_utc": 1596658944.0, "score": 14, "upvote_ratio": 0.95, "num_comments": 16, "comments": [{"body": "Lol I bought in because of that post tripled up 4-5 times, love that stock", "score": 10, "replies": []}, {"body": "You're welcome......\n\nBuy AGRX and EBAY", "score": 6, "replies": [{"body": "yo this is the guy!!! lol funniest shit ever.. i actually big brained ur posts and went extra retarded and bought Oct $30's.. thanks bruv.. u were wrong but it still worked out..", "score": 3, "replies": [{"body": "I made 4 suggestions and 3 are in the money.  The FDs would have been money as well but for the market manipulation \n\n10/16 and 1/15/21  are going to be 30 baggers\n\n\nThat's why they took down the DD as I updated it with post earnings shenanigans \n\nWorking on a part 2\n\n\nDropped a dime on those involved.......\n\nGoing to get me some of that whistleblower 💰💰💰", "score": 2, "replies": [{"body": "Hey bc of you i got one 1/21/2022 35 call contract. What do you think it will end up doing? Its up like 30% so far. Will the upcoming merger do anything to my super long term option?", "score": 1, "replies": []}, {"body": "What strikes did you post for those HUYA oct and Jan?", "score": 0, "replies": [{"body": "$35c October and $35 or 40c January\n\nMy Octobers are up $1380%", "score": 2, "replies": []}]}]}]}, {"body": "There he is! I follow you like the messiah from here on", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Yup\n\nThey sell a patch that prevents babies\n\nSimilar suppression of stock price but different timetable", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Shares and $5c \n\nI snatch them when they are cheap\n\nIt's a golden retard situation. \n\nBO could happen anytime and or once it hits market it should price at a multiplier of sales", "score": 1, "replies": []}]}]}]}]}, {"body": "I watch the Chinese Dota2 GOD streamers on Huya and Douyu. So much going on in a language I don't understand on those 2 apps but I am all-in.", "score": 4, "replies": []}, {"body": "I heard a rumor months ago that HUYA is gonna be merged with DOYU. They are top2 streaming platforms in China. So I bought the dip and it finally pays off.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "lol i have same and didn't sell.. i actually bought some 8/21 $28's..", "score": 1, "replies": []}]}, {"body": "he got banned for some reason... I got 42.5 leaps for .17, sold at .78. Regretting that now", "score": 1, "replies": []}, {"body": "lol", "score": 1, "replies": []}, {"body": "preach", "score": 1, "replies": []}]}
{"title": "Tgt to the moon", "selftext": "The earnings are gonna be too good to be dragged down but it’s not tech and it ain’t prpl so maybe it goes down any way what are all of y’all opinions on it I’m new hear so I’m hoping I didn’t just waste a couple hundred bucks", "id": "i4dn64", "created_utc": 1596660849.0, "score": 7, "upvote_ratio": 0.73, "num_comments": 10, "comments": [{"body": "I bought 8/21 $140 c. May buy more. Earnings 8/19 before open. Check out the other posts on the today.", "score": 3, "replies": [{"body": "Was on this play 1week ago. Sold @ $131. Made good money", "score": 2, "replies": []}, {"body": "well you sure got some tendies", "score": 1, "replies": []}]}, {"body": "I have my money on the BLM 8/21 1017c beating out TGT this quarter like they did last", "score": 2, "replies": []}, {"body": "Congrats on your new hearing.", "score": 3, "replies": [{"body": "Lol i see you over \"their\"", "score": 2, "replies": []}, {"body": "Thanks i’m trying to pay off the hearing aids with stock options haha", "score": 1, "replies": []}]}, {"body": "TGT looks good.   Following WMT and others.  Big box stores are getting all the other retail channeled to them.  \n\nBIG also looks good -- low PE and 10% annual growth.", "score": 1, "replies": []}, {"body": "I got some, but tissue-handed my way to fewer trendies than I should have!", "score": 1, "replies": [{"body": "Same I sold at 80% gain fml", "score": 1, "replies": []}]}]}
{"title": "All aboard the MSFT TikTok train!", "selftext": "", "id": "i4gnz1", "created_utc": 1596671035.0, "score": 61, "upvote_ratio": 0.92, "num_comments": 13, "comments": [{"body": "This is the deepfake future we were warned about", "score": 17, "replies": [{"body": "I don't think our brains could handle anything more sophisticated than this jewel!", "score": 3, "replies": []}]}, {"body": "Microtok to the mooooooooooon. MSFT $250C 09/17/2022", "score": 10, "replies": []}, {"body": "Please let this be a real video, that'd be all the tendies I need", "score": 3, "replies": []}, {"body": "Nice.", "score": 3, "replies": []}, {"body": "Can I get another one except it’s J Pow", "score": 3, "replies": [{"body": "I’m not fucking dancing for you", "score": 3, "replies": []}]}, {"body": "Unziiiiiiiipppppp", "score": 2, "replies": []}, {"body": "But Elen is #canceled", "score": 2, "replies": []}, {"body": "Msft 10/16 250c lets goooooooooo", "score": 2, "replies": []}, {"body": "Sound on everyone", "score": 1, "replies": []}, {"body": "Microsoft can't lose \n\nReel? Immediately condemned by zoomers as shit. \n\nOther buyers? The federal government literally has beef with every other tech company who would even consider buying.\n\nChina doesn't want to sell? Doesn't matter, they don't have a choice. \n\nMonetization? Microsoft uses the collected data of millions of Tik Tok users to enhance Bing's search engine. \n\nPost-election Trump's DoJ fucks the rest of Silicon Valley in the ass for four years of bullying. Bill Gates, who Trump just gave the WHO funds to, is last tech giant standing. \n\nThen Bill microchips us with the global vaccine... But those of us who already own Microsoft stock will only benefit when the microchips force others to buy Microsoft stock.", "score": 1, "replies": []}, {"body": "Sorry, your post has been removed by vote. Please don't delete the post if you think it's not spam as it may be approved later.\n\n___\n\nYou can either contact moderators or vote to restore this thread and punish the volunteer moderators responsible for spamming your post in the daily [WSBVoteBot action log](https://www.reddit.com/user/WSBVoteBot/posts?sort=new).", "score": 0, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "i4gowj", "created_utc": 1596671130.0, "score": 20, "upvote_ratio": 1.0, "num_comments": 18, "comments": [{"body": "The 9/18 call is only 10 bucks. May pick up one or two and hold", "score": 9, "replies": [{"body": "That would take about a 20% increase in stock price. Hard to do.", "score": 3, "replies": [{"body": "In no way is this person thinking the stock and move their thinking what option they can afford. No possible way are they thinking what it would take for Bank of America to moved by that percentage. This is a wonderful example of how people throw their money away on here", "score": 4, "replies": [{"body": "Explain?", "score": 3, "replies": [{"body": "Look at a long term chart of $BAC.\n\nLook for spikes.\n\nNo spikes.\n\nIts a boomer stock.\n\nThats why options are cheap.\n\nWant a winner?\n\nBuy the damn stock, stick it in your ira.\n\nEvery paycheck, buy dividend stocks, every paycheck in your ira.\n\nA little at time. \n\nGet rich slowly.\n\nDon't cum in crazy.", "score": 3, "replies": [{"body": "Now let's look at the activity driven simply by this subreddit's commentary and consider that he's selling these calls, or riding a 30% premium bump and selling off\n\nSource: 9/18 30c calls bought last Wednesday, up 80%...", "score": 1, "replies": [{"body": "ok. i apologize.  i know nothing. good for op.  my bad.", "score": 1, "replies": [{"body": "Lol I mean I was pretty much agreeing with you my dude. Just saying there are probably ulterior motives all over this sub so common sense goes out the window", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Crazy that Jan leaps are only 150 dte...", "score": 11, "replies": [{"body": "Where the fuck has this year gone??", "score": 3, "replies": []}, {"body": "150 DTE is not a LEAP....", "score": 3, "replies": []}]}, {"body": "I got on the tendies train when the Buffet news broke out, already up 18% on my 1/15 25C. I guess I didn’t buy far OTM enough...", "score": 3, "replies": []}, {"body": "1. PE Ratios are dumb and should always be ignored. No correlation to stock performance in the long run. \n\n2. This is 100% the Buffet effect. OTM Calls always increase whenever he takes a position. \n\nNothing new here. But still not a bad gamble IMO. \n\nCommence the downvoting like you retards always do.", "score": 11, "replies": []}, {"body": "Bought BAC [@this](https://i.imgur.com/fchxWAm.jpg) an hour after last weeks Buffet move. Slow progress but still progress.", "score": 3, "replies": [{"body": "shouldve grabbed ITM for better gains, I wish i thought ahead like that... i may grab a contract", "score": 1, "replies": []}]}, {"body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**BAC**|**$30**|**BUY CALL**|**2021-01-15**|**$0.88**|**$25.39**|**86855**|**1638**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckdi0xfh5lc390786thp8r7sz) | [Track Record](https://www.pickmojo.com/user/Dat_Speed/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*Recorded after market close, will be recorded at the next market open if the premium is within 10% margin. My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "score": 1, "replies": []}, {"body": "Haha remember Dodd Frank", "score": 1, "replies": []}]}
{"title": "Puts on AAPL?", "selftext": "[removed]", "id": "i4gxdq", "created_utc": 1596671962.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 17, "comments": [{"body": "U sir r retarded...", "score": 9, "replies": [{"body": "I second this...retarded for sure", "score": 5, "replies": []}, {"body": "why did you not just tell him to load up and watch", "score": 3, "replies": [{"body": "Lolol", "score": 1, "replies": []}]}]}, {"body": "Not quite window licker!!", "score": 5, "replies": []}, {"body": "Lol 😂 he found the loophole boizzz", "score": 4, "replies": [{"body": "Hedgefund managers hate this one trick for stock splits...", "score": 3, "replies": []}]}, {"body": "ya man exactly, load up on them, instant gains.", "score": 3, "replies": [{"body": "Agreed, OP put your life savings into it", "score": 2, "replies": []}]}, {"body": "Lmfao, are you from Stocktwits or something? Nobody tell him.", "score": 3, "replies": []}, {"body": "I’ll sell you AAPL 9/18 300P. You’ll make bank when the stock splits.", "score": 2, "replies": []}, {"body": "Lol", "score": 1, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "yes :D", "score": 1, "replies": []}, {"body": "go deep, its guaranteed to go down", "score": 1, "replies": []}, {"body": "do it", "score": 1, "replies": []}, {"body": "Bet the rent!!!", "score": 1, "replies": []}]}
