{"title": "Smart money trades for Monday", "selftext": "What’s your smart money trade for Monday ....to make over 9000!!!\n\nPuts on MU? AMD? Netflix????", "id": "8ccrvk", "created_utc": 1523763891.0, "score": 7, "upvote_ratio": 0.82, "num_comments": 31, "comments": [{"body": "AMD calls", "score": 27, "replies": [{"body": "buy calls sub 10, buy puts at 15, works 60% of the time everytime", "score": 7, "replies": [{"body": "Doesn’t this work like, every-time so far?", "score": 1, "replies": [{"body": "Yes but we might still be in the 60%", "score": 1, "replies": []}]}]}]}, {"body": "I have netflix calls am i fucked", "score": 10, "replies": [{"body": "Nah it will close 3% green. ", "score": 8, "replies": []}]}, {"body": "I'm going to buy a MAY ATM Straddle on TSLA. Hoping to see a repeat of last week, with it bouncing between $290 and $310. If it gets near $295 I'll sell the $300 put and buy a $295 call, at which point I'll wait for it to bounce up to $305 and do the opposite. Then I'll just trade the legs of the 295/305 strangle back and forth until I'm a millionaire. What could go wrong?", "score": 9, "replies": [{"body": "You have the right idea. But in and out of those quickly and you might need a friend to help you buy and sell, One person sells, and one person buys very near each other so you can keep capturing the change,  because if it's just you alone, you'll have to re-open the options chain and find the options and setup the trades again etc.. \n\nI'm rooting for you.", "score": 7, "replies": []}, {"body": "If TSLA could go to $305 on Monday or Tuesday I'd be pretty fucking happy.", "score": 1, "replies": []}, {"body": "You. You are going to win big. Honestly if you do this please post daily updates with your moves. I’d love to see it play out", "score": 1, "replies": [{"body": "It is not working out so far. I couldn't get filled on the straddle, so I started buying $295 calls from $295 down today. Average price is $5.56. Was up almost $1k when it popped back to $295 but I couldn't fill my sell order in time. Fingers crossed it pops back up tomorrow, I don't know if I have the stomache to ride this out the rest of the week. Oh well though. Max loss is only like $5.5k.", "score": 1, "replies": [{"body": "Yeah it’s not the best news day for Tesla. Maybe Elon has one of his magical tweets waiting for you this evening. ", "score": 1, "replies": []}]}]}]}, {"body": "AMD always the best bet", "score": 9, "replies": []}, {"body": "Lets see how the faggot pre market traders react to this whole Syria thing first.", "score": 4, "replies": []}, {"body": "1. Sell NFLX puts.     \n2. Buy AMD puts.     \n3. ???    \n5. Profit.     \n    \nMost importantly, you should be all in on MU. Obviously. ", "score": 8, "replies": [{"body": "I got assigned Friday on a covered call for MU at $50. But at least that means I have cash to buy the dip.", "score": 5, "replies": []}]}, {"body": "LMT FDs, first thing\n\n", "score": 7, "replies": [{"body": "All in dfen ", "score": 2, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "BTFD to enjoy the 10 year fireworks show to celebrate \"mission accomplished\".", "score": 1, "replies": []}]}]}]}, {"body": "Reverse iron condor on NFLX. All about that volatility, baby", "score": 3, "replies": []}, {"body": "Buying up all the weed stocks my shallow pockets can afford", "score": 3, "replies": []}, {"body": "i bought a bunch of MSFT calls, so hopefully nothing dumb happens", "score": 2, "replies": []}, {"body": "Market looks bearish short term. Kind of expecting Monday to be in the red.", "score": 0, "replies": [{"body": "Really? I dont get why people think it'll open red. Trump basically shot at the floor and flexed like a little bitch.\n\nNO ONE DIED.\n\nGive me a break. Trump doesnt want war. He wanted to save face. And now \"mission acconplished.\"\n\nEven though I'd love a -2% monday, I thinl we'll open green.", "score": 11, "replies": [{"body": "Me thinking it will be red Monday has nothing to do with Syria. I am not calling it will open in the red. I think it will close in the red. Overall, the market looks to be bearish to me and I am anticipating it to have another drop soon to previous low from February.", "score": 1, "replies": [{"body": "Too bad it won't crash when I buy 40 Puts at Strike $258 for 80 days.", "score": 2, "replies": [{"body": "You bought those on 4/02-4/04 when SPY was around $258? I think you'll be fine since you bought them for 80 days. What is your break even price? I think it'll go back to $253 and test that again. You may be lucky and it drops further.", "score": 1, "replies": [{"body": "It looks like I purchased them for .38 cents. I'll close them and reopen on monday if Volatility falls more.  \n\nI'm just saying that If the market falls, I don't care, because I'll be collecting on 40 puts as it nears $258. \n\nSo drop away.", "score": 1, "replies": [{"body": "You bought them OTM for cheap then? If it does fall like i think it will, you'll have more room to make money than i was thinking in my first reply.", "score": 1, "replies": [{"body": "Yes, and I think if Monday opens heading upwards, I'll buy a ton more at 258 for cheap, so if they do pull any sneaky moves to drop it, I'll capture it.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}
