{"title": "The Dow after Trump’s tweet. The Fed skirts questions on QE. Precious Metals are up. Is this the start of hyperinflation or is it healthy growth?", "selftext": "I’m trying to stay optimistic, but I’m very concerned that this is all happening while jobless claims showed that they were at 262,000 for the week.", "id": "e9oqnr", "created_utc": 1576163308.0, "score": 155, "upvote_ratio": 0.89, "num_comments": 83, "comments": [{"body": "Jobless claims is just one data point. I think the broader picture to look at right now is we have a fed doing 11 trillion dollars worth of repo operations right now, up from 4 trillion. Inflation is not a big deal, which is why the fed is ok being so aggressive with this. However I think the mid-term health of the economy will be worse off. The cheaper loans are, the increase in probability that a domino default effect can occur.", "score": 65, "replies": [{"body": "Username checks out", "score": 41, "replies": []}, {"body": "While I do agree with you, However do you think the capital flight from Europe is helping prop up the US market? or is this something I may wrong about? While I think the US market will cool down in terms of growth. I think that prices will continue to rise, mid to long term.", "score": 16, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "not really, Its just the it seems like Europe is not doing well. Germany is near/at a recession. Brexit uncertainty and a few other economic factors that make investing in Europe risk, Also Europe's negative interest rate may have very hard to reverse consequences in the long term scope.", "score": 11, "replies": []}]}, {"body": "That's what I'm reading.  EU, Japan, etc have negative yields and so that is pushing naked foreign money to the US where we still have positive yields and a so called \"secular bull market\".\n\nBut I don't agree US stocks can go up long term (more than another 12 or 24 months).  And when the rubber band breaks, it's going to snap hard.  At least that is the conclusion I've come to.", "score": 10, "replies": [{"body": "the rubber band analogy you have is absolutely correct. The problem I have is The fed has taken a stance on some of these bubble like the corporate credit bubble and stated it not a bubble worth monitoring. which has me really worried in the long term. Just waiting for that first domino to fall to take steps to protect myself.", "score": 3, "replies": [{"body": "So correct me if you think I got this wrong please - the first \"domino\" will probably be single day 6% plus drop in the US market?  Or is there something else that is an even earlier indicator with decent confidence?   Is there a way to monitor the corporate bond market real time?", "score": 0, "replies": [{"body": "no clue what it could be, would have to monitor incoming information and make some decisions. Could be something like 4 straight quarters of low GPD. or the first signs of a bear market, or like you have implied some bonds get downgraded to junk. however I dont have the slightest clue atm either.", "score": 1, "replies": [{"body": "Thanks for the back and forth.  The more I learn the more I realize that I don't understand.  I do think the big boys on wallstreet will know and be able to execute first - which will probably manifest itself in record or close to record single day largest drop of the market by percentage.\n\nBecause if the bears are right, it's not just dropping 10 or 15%.   Of course that won't be all in one day but it will be relatively quick probably.", "score": 1, "replies": [{"body": "NP, this is something I have come to realize as well. There is too much information to look at and it get tough to actually parse it. But like you said its really tough to compete with the big boys on wall street or Chicago.", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "if you where born around 1980 ish real income hasn't gone up in your entire lifetime.  technology is pushing costs down everyday.  unemployment is a painfully outdated measurement device.  I have absolutely no fear of inflation.", "score": 5, "replies": [{"body": "I never disagreed that with inflation. My worries are with corporate debt and the possibility of a default domino effect.\n\n&#x200B;\n\nEverything is basically hinging on positive GDP. If the US GDP declines then loans will be difficult.\n\n [https://realinvestmentadvice.com/wp-content/uploads/2019/03/TotalCorporateDebt.png](https://realinvestmentadvice.com/wp-content/uploads/2019/03/TotalCorporateDebt.png)", "score": 1, "replies": [{"body": "I think as long as people are working in general no business will default unless they are truly outdated etc.", "score": 1, "replies": []}]}]}, {"body": "Repo isn't cumulative. It's predominantly overnight lending. It basically resets every day.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 30, "replies": [{"body": "red, china; it all makes sense now", "score": 26, "replies": [{"body": "Oy vey, the goyim cracked the code. Abort!", "score": -1, "replies": []}]}, {"body": "Buying puts?", "score": 7, "replies": [{"body": "Nah, I am not buying anything until next year when the tfsa limit increases in my country.  It is a Canada thing, I do all my investments tax free.", "score": 3, "replies": [{"body": "Hello fellow Canadian! Why not just invest as much as you can and then fill up the second you can?", "score": 1, "replies": [{"body": "Its a long story, but i am going to add about $15,000 to my tfsa on Jan 1.  Changed banks last year, and when i transferred my tfsa to the new bank, it got counted as a contribution and not a transfer, which put me over the limit.  Got a sternly worded letter from the CRA, which advised me to remove the money, which turned out to be the wrong thing to do.  Bank fixed everything, and handed me $100 cash for the fuck up.  All good now, but can't add to the tfsa  until Jan 1.", "score": 1, "replies": [{"body": "Ahhhhhhh ok\n\nDidn’t know that can happen but it makes sense", "score": 1, "replies": [{"body": "Neither did I lol.  Because it was first offense, the cra sent a me a letter the basically said, fix this right away, or we reserve the right to fine you for every dollar you went over.  In the end everything got fixed, but I did remove some cash, and they told me not to put it back in the tfsa until jan 1.", "score": 1, "replies": [{"body": "But you can still invest outside of a tfsa you’ll just get taxed until you’re able to move it to tsfa", "score": 1, "replies": [{"body": "Yah but I would have to open up another investorline (bmo) account, when I would rather just have all my investments in the same account.  I do have an rsp that I let the bank manage for me which is not tax free.  Also not a millionaire lol", "score": 1, "replies": [{"body": "Fair enough, ya same I just like screwing around with a tiny amount on questrade :)", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Oh I was fucking pissed.  Threatened to change banks and pull all my investments.  They went out of their way to fix every thing for me.  The problem was they has some idiot working for them, who just so happened to quit a few months before I even noticed this stuff happened.  Who literally had me fill out a form, and then he just forgot about it, and left it on his desk for 5 months.  I did have to spend like 3 hours on the phone with the cra and my bank.  In the end, there were no tax implications or fines from the cra.  And the bank fixed everything and transferred me $100.", "score": 2, "replies": []}]}, {"body": "In mother AMERICA you pay bank when they screw up!!!!", "score": 1, "replies": []}]}]}]}]}, {"body": "I hope it does", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 32, "replies": [{"body": "https://en.wikipedia.org/wiki/Volfefe_index", "score": 6, "replies": []}, {"body": "There's a few robots trading based on Trump tweets, I haven't stayed informed of their returns.", "score": 9, "replies": []}]}, {"body": "I mean gold always goes up when people become unsure they run back to that haven. Idk from just walking around my city and talking to everyday people people do have a lot more disposable income then they have had in years granted people are still financed to their gills but the fact that people are still buying new cars and latest phones and lenders are still low and willing to push it out just signifies we have a good base. But generally the avg pop is the last to feel the shit roll down hill so", "score": 9, "replies": []}, {"body": "[deleted]", "score": 12, "replies": [{"body": "You make this statement without any proof to back your claims.  Why do you do this?", "score": -6, "replies": [{"body": "There is a series of article on Seeeking Aalpha that explains this.  Some financial subs block linking to SA, so you will have to look it up.    the first article would be titled:  Another Repo Hiccup Highlights Year-End Uncertainty .   There are a few more articles linked in there.  That provides an explanation.  There are Fed charts in those aricles.  I get that people may frown on SA, but there it is.", "score": 3, "replies": [{"body": "Why do they block seeking alpha?", "score": 1, "replies": [{"body": "It is something that users reported it as unreliable or opinion.", "score": 1, "replies": []}]}]}, {"body": "Not OP, but here is proof of the Fed balance sheet trend:  [https://www.federalreserve.gov/monetarypolicy/bst\\_recenttrends.htm](https://www.federalreserve.gov/monetarypolicy/bst_recenttrends.htm) \n\nPre 08' crisis the balance sheet was $870B. They blew it up to a record 4.5T by 2015. The reduction OP is referring to is the \"balance sheet normalization program\" where total assets declined to under 3.8T. \n\nStarting in September 2019, total assets increased beyond 4T during times that are supposedly good.", "score": 2, "replies": [{"body": "Thanks. Can't they just pay it back any time they want (by selling assets)", "score": 1, "replies": [{"body": "Yes, though aggressively reducing the balance sheet would come with its own problems. Selling securities would put pressure on the bond market, which would cause interest rates to increase rapidly. In the context of massive levels of consumer, corporate and government debt - nobody wants this to happen.\n\n [https://usdebtclock.org/](https://usdebtclock.org/)", "score": 1, "replies": [{"body": "Thank you. So in the event of inflation, they will want to sell the assets to drive down inflation, which will push up bond rates.  But because there is so many assets to sell, interest rates will go to over 5% which will be bad because that's a high rate with which to service our debt?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "The unemployment rate has just gone down, again. This time to 3.5%.", "score": 8, "replies": [{"body": "Couple this with a 3.1% wage increase and only 1.6% inflation.", "score": 4, "replies": []}, {"body": "That unemployment statistic is deeply flawed. It inaccurately counts people who are underemployed as ‘employed’. The unemployment statistic also doesn’t count all of the people who literally don’t have jobs, but have just stopped looking.", "score": -1, "replies": [{"body": "U6 is as low as ever measured, and it includes the things you mention.", "score": 5, "replies": []}, {"body": "U6 is at all time lows so I'm not sure what you're trying to say here.", "score": 1, "replies": []}]}]}, {"body": "Before jumping back in, I am waiting for the official announcement that Dec 15th tariffs are being delayed.  I also would prefer an update on this directly from the Chinese foreign ministry.", "score": 5, "replies": [{"body": "You'll be buying the top by then", "score": 1, "replies": [{"body": "If they buy now it's still the top.", "score": 1, "replies": [{"body": "Not the top of the trade war pump it isn't. Waiting until China confirms it and signs everything will waiting until trade moves are already priced in.", "score": 1, "replies": []}]}]}]}, {"body": "We could use some inflation up in here. Look at debt levels and the wealthy hoarding cash and equivalents. Bring it on.", "score": 7, "replies": [{"body": "Problem with the wealthy is they can dodge that all by just moving the money or rolling into another currency world doesnt move together the rich just keep jumping from lilly pad to lilly pad", "score": 12, "replies": [{"body": "US and Canada are the only ones offering higher-than-negative rates tho, no?", "score": 2, "replies": [{"body": "Rates? on what we are talking about rolling money around not loans", "score": 2, "replies": []}]}]}]}, {"body": "Probably healthy growth. Definitely not hyperinflation. It is likely we will see a deflationary scare before we will see extreme inflation.\n\nWith that being said, a 10% allocation to gold (e.g. GLD, IAU, etc.) will decrease the maximum draw down of any portfolio you would care to back test across any time period in history. Even though it is basically a lump of yellow metal that just sits there on the shelf, everyone flocks to it when the market crashes. This tends to nicely offset the drop in your stock values right when you need it.\n\nGLD works very well with TLT. 10% in GLD and 10% in TLT will drop your draw downs by a significant amount while simultaneously not impacting your CAGR very much.", "score": 3, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "For gold only, I would say backtesting to tell you the correct amount is the best idea. First, I would backtest to 1978. Then, I would backtest to 2006. Compare the numbers you get to tell you what the correct long term allocation should be. Use portfolio visualizer to back test. \n\nI would say the above advice also applies to TLT.", "score": 1, "replies": []}]}]}, {"body": "Precious metals have been going up. ESPECIALLY palladium. One of my best buys so far has been sbgl. Highly reccomend.", "score": 2, "replies": []}, {"body": "going to go off on a limb and say it's not the start of hyperinflation", "score": 2, "replies": []}, {"body": "Hyperinflation is extremely unlikely. A more plausible inflation outcome would be inflation ticking up a few points above target or, yet again, defying expectations and remaining below target. \n\nIf you think unemployment is going higher than a supportive Fed should be stressing you out less, not more.", "score": 2, "replies": []}, {"body": "Trump is full of shit. Keep pumping this turd balloon up, but when it pops, it’s gonna be really shitty for most.\n\nSP500 back to 2400 by end of 2020.", "score": -7, "replies": [{"body": "[deleted]", "score": 53, "replies": [{"body": "To be fair, saying he's full of shit isn't exactly a political emotion. This is about the 10th time the indexes have reached a near peak and magically the words, \"We're nearing a trade deal!\" are said and the market spikes further. Each time, no deal has been reached. So, until he quits crying wolf on a trade deal -- he's technically full of it. \n\nTraders love it, creates a modicum of volatility and an excuse to push assets higher. But, it's smart to be wary of a market that's pushed higher based on tweets of a deal that has been \"potentially, maybe happening\" for quite some time now.", "score": 56, "replies": [{"body": "To the obvious extent that he has done it should be illegal. Whether you like Trump or not, it can’t be healthy for the market to be held up by tweets lmao.", "score": 16, "replies": [{"body": "Yeah, empty tweets (remarks) to pump up or disturb the markets seem unneeded... people complain when Elon does it and the same should be said for him.  Such a strange strange time.", "score": 8, "replies": [{"body": "The problem is that Elon did it to benefit HIS company. Trump is doing it to benefit the overall market so it’s not an SEC thing.", "score": 2, "replies": []}]}]}, {"body": "For some reason you’re ignoring improved earnings and lowest unemployment rate and fantastic jobs report... it ain’t just a tweet..", "score": 1, "replies": []}, {"body": "which tweets keep pushing the market up?", "score": -1, "replies": []}]}, {"body": "> Advice from an old man, it’s your enemy.\n\nGot it.  The old man is our enemy.", "score": 3, "replies": []}, {"body": "Ok boomer", "score": -9, "replies": []}]}, {"body": "Good rationale.", "score": 5, "replies": [{"body": "I concur", "score": 4, "replies": []}]}, {"body": "No lol", "score": 2, "replies": []}, {"body": "Dude, the only thing that’s getting it back there is the FED. Until he FED raises rates and cuts the balance sheet this shit is going much higher. JPow will probably never raise rates again. He’s been completely cucked by the market. As long as him and Trump are running things the tweets/lies will keep going and the market will keep running. I’d be genuinely surprised if we even see a 10% correction before the next election. Much less 2400. Trump won’t let it happen. He’ll have SPX at 3400 or higher by then even if he has lie about phone calls at 1755 every Sunday night for the next year.", "score": 1, "replies": []}, {"body": "Blackrock, T.Rowe, Goldman, JP, Invesco, Wells Fargo & Vanguard are all saying marginal growth in 2020 but you should definitely trust this guy with TDS.  Cope harder Bears.", "score": -1, "replies": []}, {"body": "Yeah I agree. I don't know when it's gonna fall but when it does it'll be quite nasty I think. The fact that the market continues to go up based on the nonsensical rantings of a madman is concerning.", "score": 0, "replies": []}]}, {"body": "Thanksgiving falling the last week of November impacted the jobless claim number. \n\nEither way, do you have a trade/investment plan or just praying shit keeps going your way?", "score": 1, "replies": []}, {"body": "For those interested in the Repo side of what the Fed is doing, it looks like they are going to be standing by with a reservoir of cash for the rest of the year:\n\nhttps://www.newyorkfed.org/markets/opolicy/operating_policy_191212\n\nNot OE4, _technically_, but still expanding their balance sheet.", "score": 1, "replies": [{"body": "Let's not kid ourselves. It's QE4 by another name. They're just hiding their true motivations behind this fakeass \"liquidity crisis\" narrative.", "score": 1, "replies": [{"body": "I’m interested to hear why you think there is not a liquidity issue.", "score": 1, "replies": []}]}]}, {"body": "Assuming this is the blow off top of the bubble coming the next few months, what was it that broke last December that leads to our next bear market?", "score": 1, "replies": [{"body": "The FED and trump/China. Both of which have pulled a 180 and are now doing nothing but pushing the market higher and higher. It's not coming back down for a long time.", "score": 1, "replies": [{"body": "Yeah, about 11 months, when the fed is tightening again, and trump has won the election and doesn’t need farmers any more.", "score": 2, "replies": [{"body": "Minimum. The FED would need to take a drastic turn for that to happen. JPow is so scared of his own shadow that I don't see him raising rates for a long time. We MIGHT see a 1/4 point raise after the election and even that would surprise me.", "score": 1, "replies": []}]}]}]}, {"body": "A reminder to everyone, please focus on how this is going to affect a specific stock or the stock market in general.\n\nIf your comment is pushing political agendas, memes, insults, trolling, etc then your comment is going to get removed and/or get you banned.\n\nIf you *have* to discuss just the politics, then post this topic to r/PoliticalDiscussion without linking back to r/stocks, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}]}
{"title": "Did some DMT. 200 year Bull Market Confirmed.", "selftext": "[removed]", "id": "e9fvbv", "created_utc": 1576110264.0, "score": 937, "upvote_ratio": 0.98, "num_comments": 85, "comments": [{"body": "Hard to argue with the machine elfs.. fuck it let’s go", "score": 296, "replies": [{"body": "Those fuckers do not fuck around", "score": 36, "replies": [{"body": "They'll bite your fucking dick off", "score": 16, "replies": [{"body": "FREE ME FROM THIS FB PRISON!", "score": 10, "replies": []}]}]}, {"body": "Terrence McKenna is my PM", "score": 2, "replies": []}, {"body": "I know your saying this comment sarcastically, but those machine elfs made me rich.", "score": 2, "replies": [{"body": "Bruh I’ve never heard of anyone discuss the machine elves sarcastically .. those fuckers don’t play games man", "score": 1, "replies": []}]}]}, {"body": "Jamie, pull that up", "score": 107, "replies": [{"body": "Does everyone listen to the Joe Rogan podcast?", "score": 43, "replies": [{"body": "I think most people just watch the meme compilations on YouTube, otherwise there would've been a revolution", "score": 19, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Because drug-induced blowhardery is difficult to distinguish from wisdom when you stopped learning anything after 10th grade", "score": 18, "replies": [{"body": "This is one of the top 10 lines I've ever read on WSB. Consider it stolen.", "score": 3, "replies": []}]}]}]}, {"body": "required listening for r/wsb", "score": 5, "replies": []}, {"body": "Yes", "score": 2, "replies": []}, {"body": "every single one", "score": 2, "replies": []}]}]}, {"body": "Long $DMT", "score": 64, "replies": []}, {"body": "This is entirely possible", "score": 40, "replies": []}, {"body": "Sir this is a bowling alley", "score": 135, "replies": [{"body": "Why the hell is there a donkey in here?", "score": 15, "replies": [{"body": "Same reason there's a fucking tiger in the bathtub!", "score": 6, "replies": []}]}, {"body": "[this guy](https://youtu.be/7NIQbsW2rOw)", "score": 3, "replies": []}]}, {"body": "DMT is fucking awesome. I need to get some, throw $1,000 into a RH account, and see what kinds of calls and puts come out of it. Shit would be majestic.", "score": 61, "replies": [{"body": "I dont think the feeling of loosing it all will be very pleasureable on DMT", "score": 33, "replies": [{"body": "I definitely feel like if I hit some acid or DMT at market open I would make more gains than losses", "score": 19, "replies": [{"body": "I would actually also love to try that", "score": 7, "replies": []}, {"body": "Follow the white rabbit.", "score": 2, "replies": []}]}, {"body": "My account already experiences Ego Death anyway", "score": 18, "replies": [{"body": "lol", "score": 1, "replies": []}]}, {"body": "i don’t think executing any type of financial transaction is even remotely plausible on DMT either, but here we are. \n\nlose is the opposite of win\n\nloose is the opposite of tight. \n\nyou don’t just add an “o” when adding the ing\n\nfrom this day forward; no one will judge you for that misspelling, welcome to the other side.", "score": 20, "replies": [{"body": "Sir, you can't just walk into a special ed class and start teaching spelling.", "score": 5, "replies": []}]}, {"body": "Little do you know... Everything is pleasurable on DMT", "score": 2, "replies": [{"body": "Never tried it, but a 'bad trip' is a real possibility with all psychedlics, even something as 'innocent' as weed. Why would everything be pleasurable on DMT?", "score": 1, "replies": [{"body": "'OK' u/ultra_autist", "score": 1, "replies": []}]}]}]}, {"body": "Man you can’t operate a phone much less make RH trades on DMT lmao", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 23, "replies": [{"body": "All in GOOG puts, fuck it boys", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 23, "replies": [{"body": "I'll start a business that removes those chips! It wont pay well.. but the benefits are great.", "score": 5, "replies": [{"body": "I'm disturbed by this comment.", "score": 6, "replies": []}]}]}, {"body": "I do DMT with Alex Jones and Joe Rogan all the time.", "score": 18, "replies": []}, {"body": "[deleted]", "score": 15, "replies": [{"body": "I will be messaging you in 199 years on [**2218-12-12 04:40:30 UTC**](http://www.wolframalpha.com/input/?i=2218-12-12%2004:40:30%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/e9fvbv/did_some_dmt_200_year_bull_market_confirmed/faj65qu/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fe9fvbv%2Fdid_some_dmt_200_year_bull_market_confirmed%2Ffaj65qu%2F%5D%0A%0ARemindMe%21%202218-12-12%2004%3A40%3A30%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20e9fvbv)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 18, "replies": []}]}, {"body": "You think you can still collect unemployment if you get fired from marshals for doing dmt while helping customers? That’d be tight.", "score": 7, "replies": [{"body": "Tell them to drug test you for it because they more likely than not can't (not saying it's impossible, just exceedingly expensive and extremely time sensitive).\n\n\"It was a social experiment bro\"", "score": 4, "replies": []}]}, {"body": "This isn't really the kind of thing people usually see on DMT. It's more like otherworldly 6 dimensional hyperspace and cartoon aliens and most of the time it's completely forgotten after the trip with the tripper struggling to describe anything at all. Imagine caring about something as insignificant and self centered as stocks  within the glory of the infinite cosmos - get smited by angry gods.", "score": 18, "replies": [{"body": "The only time I got to try DMT I just stared at a literal cartoon alien poster that said “take me to your dealer” for 10 minutes. 10/10 would do it again.", "score": 13, "replies": []}, {"body": "Or maybe the OP’s the chosen who’s been seen by the gods to lead WSB", "score": 2, "replies": []}, {"body": "Woke", "score": 1, "replies": []}, {"body": "ok nerd", "score": 0, "replies": []}]}, {"body": "Did you remember your pen?", "score": 6, "replies": []}, {"body": "I stopped reading after “I was in the customer service line at Marshall’s”", "score": 8, "replies": []}, {"body": "I will buy more calls tomorrow just because of this", "score": 4, "replies": []}, {"body": "This is the kind of DD I come to this sub for", "score": 3, "replies": []}, {"body": "Dude", "score": 3, "replies": []}, {"body": ">200 year bull market\n\nI'm on board. Business cycles are for chumps.", "score": 3, "replies": []}, {"body": "lmao", "score": 3, "replies": []}, {"body": "SPY from 314 to 42069 in 200 years is only 2.5% annual return, pretty weak.\n\n\n(42069/314)^(1/200)", "score": 3, "replies": [{"body": "It split 15 times you dolt.", "score": 6, "replies": []}, {"body": "OP meant SPY to 42069 UE (United Earth) credits. On Novermber 11, 2158, the United Earth government began phasing out the U.S. dollar as the global currency to UE credits at an exchange rate of 10,000 USD for 1 UE credit.\n\n7.3%", "score": 1, "replies": []}]}, {"body": "what", "score": 2, "replies": []}, {"body": "We finally did it then. We infinite leveraged ourselves all of robinhood. Well done to the austic bloke out there who accomplished this", "score": 2, "replies": [{"body": "He hasn't even been born yet. \n\nBut if he's born in my lifetime, I'm taking him some myrrh.", "score": 3, "replies": []}]}, {"body": "Duncan Trussel confirmed this 10 minutes after his 57th hyperspace visit.", "score": 2, "replies": []}, {"body": "Had pretty much the same experience only with the Marshall's customer service rep. Weird.", "score": 2, "replies": []}, {"body": "# literally can't go tits up", "score": 3, "replies": [{"body": "check your personal risk tolerance", "score": 3, "replies": [{"body": "I have calculated the exact amount to be...yolo", "score": 3, "replies": []}]}]}, {"body": "fake", "score": 2, "replies": [{"body": "Source?", "score": 20, "replies": []}]}, {"body": "Wooooow", "score": 1, "replies": []}, {"body": "Requesting that OP hooks a mofo up so that I can see for myself. In the name of science, that is.", "score": 1, "replies": [{"body": "Narc alert", "score": 3, "replies": []}, {"body": "Nice try, DEA.", "score": 2, "replies": []}]}, {"body": "Nice", "score": 1, "replies": []}, {"body": "Thanks for confirming.", "score": 1, "replies": []}, {"body": "My friends brother killed himself a few days ago. Anyway, I know how to get DMT for free, if anyone is interested.", "score": 1, "replies": []}, {"body": "liar. there's no way the Marshall's customer service line was only 6 minutes", "score": 1, "replies": []}, {"body": "Is this legit?", "score": 1, "replies": []}, {"body": "Sir, this is a Marshall’s", "score": 1, "replies": []}, {"body": "Ok - but what did the mechanical elves say? They usually have better investment advice.", "score": 1, "replies": []}, {"body": "Those are gonna be some long fuckin calls tho", "score": 1, "replies": []}, {"body": "This is the DD we NEED. Somebody make this man a high paid Executive.", "score": 1, "replies": []}, {"body": "Meth is a hell of a drug", "score": 0, "replies": []}, {"body": "weird fucking crossover with r/Psychonaut", "score": 0, "replies": []}]}
{"title": "Let's take a moment to appreciate how much of a WSB legend Cramer is", "selftext": "Jim Cramer when $TSLA was $17: \"don't even rent the damn thing.\" \n\nJim Cramer today at $363, right after a huge drop followed by a +100% run: \"buybuybuy!\"\n\nTrue legend.\n\nOn a side note, RIP TSLA, my whole bull thesis is now in shambles...", "id": "e9oneq", "created_utc": 1576162904.0, "score": 278, "upvote_ratio": 0.97, "num_comments": 84, "comments": [{"body": "\"Bear Sterns is not in trouble\"", "score": 77, "replies": [{"body": "he claims he was referring to deposits at Bear, which were backed by the FDIC. remember, he also went on that unhinged rant.", "score": 21, "replies": [{"body": "He was because he was worried about a bank run. The unhinged rant contains my favorite line ever on CNBC (maybe it was surpassed the other day with that guy calling WSB sociopaths): \"Sometimes I wish I didn't know anybody so I could sit here and tell you to go buy Washington Mutual and take that dividend.\" Basically a shot across the bow at every blowhard money manager from shit towns like Indianapolis and Kansas City who parade on CNBC with their terrible picks.", "score": 21, "replies": [{"body": "lol the whole thing is gold. \"YOU HAVE NO IDEA! BERNANKE HAS NO IDEA! NONE!\"\n\nEdit: I would correct my quote with an exact quote from [the actual transcript, which CNBC has (lol)](https://www.cnbc.com/2018/08/03/11-years-later-jim-cramers-they-know-nothing-rant.html), but there's too much good stuff in it to just single that out. I started highlighting what I wanted to copy and selected like half the document.", "score": 13, "replies": [{"body": "I'm just going from memory here, but I've watched it so many times I think I can do this:\n\n\"I haven't seen it this bad since I went 5 bid on a million Citibank in 1991 and GOT HIT!\"", "score": 9, "replies": [{"body": "i just skimmed it before i read your comment and that sounds familiar. i won't go back and check if you got it verbatim, though.", "score": 4, "replies": []}]}]}]}]}, {"body": "> Bear Sterns is not in trouble\n\nvideo clip: https://youtu.be/-6u1kG7yuy4?t=10", "score": 9, "replies": [{"body": "That's juthst ignorant", "score": 2, "replies": []}, {"body": "***guitar solo***", "score": 2, "replies": []}]}, {"body": "**DONT PANIC**", "score": 3, "replies": []}]}, {"body": "Or when Bear Stearns was $62 and Cramer said don't get your money out of there.\nFive days later it was $2.\nhttps://youtu.be/V9EbPxTm5_s", "score": 22, "replies": [{"body": "If you have an FDIC insured account, your bank's stock price is largely irrelevant", "score": 9, "replies": [{"body": "Not to shareholders", "score": 2, "replies": [{"body": "Did you know that shares of stock aren't FDIC insured?", "score": 2, "replies": [{"body": "Yes of course, stocks are a gamble.", "score": 0, "replies": [{"body": "Good, then why did you think I was talking about them when I mentioned FDIC insured accounts?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Everyone gets calls wrong, not just us.  The difference between us and them is that we have a more advanced Personal Risk Tolerance algorithm.", "score": 20, "replies": [{"body": "Guh", "score": 6, "replies": []}]}, {"body": "To be fair to him, Tesla is literally one in a million. So many have tried to do the electric car thing for decades dating back to WW2. It’s been a nonstop failure. Tesla is the first to show massive progress in not only electric cars but also in tech savvy electric cars.", "score": 92, "replies": [{"body": "Not really basically all the other manufacturers made an electric car but it looked gay as fuck. As if they purposely make it ugly so that you wouldn’t buy it unless you were really into the environment and stuff.\n\n\n\nTesla first of all had a cool name and also wasn’t gay looking, it looked like a normal car instead of some gay environmentally friendly appearance.", "score": 77, "replies": [{"body": "That’s true, idk where that logic comes from. “Let’s make the car look like it’s from futurama”", "score": 20, "replies": [{"body": "\"Don't let it compete with our internal combustion offerings\"", "score": 39, "replies": [{"body": "Exactly. I think they knew that no way was a $130k ICE vehicle going to get the same 0-60 in 2.5s like a Model S.", "score": 4, "replies": []}]}, {"body": "> “Let’s make the car look like it’s from **F**uturama”\n\nWhat's wrong with that?!?!?", "score": 3, "replies": []}]}, {"body": "> As if they purposely make it ugly so that you wouldn’t buy it unless you were really into the environment and stuff.\n\nI don't think it's \"as if\".\n\nLook at the nissan leaf. It's a laugh. The bolt. Embarassing. The Volt, well okay but it looks like a chevy cruze. Mitsubishi even had an EV back in 2012 time frame.\n\nTesla was the first company to come up with an EV that didn't look like shit. \n\nI still think Tesla is screwed long term. Competition is going to crush them and their sales are already imploding in north america. Musk is a huge asshole so he deserves it (too bad about the employees, though).", "score": 4, "replies": []}]}, {"body": "The secret is they’re not really a car company, they’re a really good battery company.", "score": 25, "replies": [{"body": "So if the future is space force then start a company that manufactures air filter rebreathers, but markets space suits?\n\nEdit: air recycling software?", "score": 7, "replies": [{"body": "this but unironically", "score": 3, "replies": []}, {"body": "The real money is always in consumables.", "score": 2, "replies": [{"body": "Sell the shovels", "score": 2, "replies": []}]}]}, {"body": "Tesla wants to pretend they are not a car company so that they can be valued at a billion times earnings but in reality they are a car company.", "score": 3, "replies": [{"body": "If the market will give them a billion times earnings, then\n\n🎉 tada 🎉 \n\nThey’re worth a billion times earnings.", "score": 2, "replies": [{"body": "sure, just like aramco", "score": 1, "replies": [{"body": "If the moneys in your pocket who gives a fuck", "score": 1, "replies": [{"body": "tell it to the bagholders", "score": 1, "replies": []}]}]}]}, {"body": "and not even a good one.", "score": 1, "replies": []}]}, {"body": "ahsoeer hedþbe oiðarḥuh riebwa lðeak aon", "score": 11, "replies": [{"body": "Maybe it’s better phrased as “battery management software” company but that didn’t have the same cut to it . \n\nI’ve spoken to a few engineers in the field. From what I’ve been told, their physical batteries aren’t anything special (what you’re saying about Panasonic) but their software that manages their batteries is the best in field right now.\n\nDisclaimer: I’m also really fucking stupid.", "score": 9, "replies": [{"body": "It's not even the software that manages it, it's their coolant technology on the batteries. The biggest killers of modern lithium ion batteries is heat and being ran to extremely low levels. \n\nCombine a software solution that isn't dogshit and runs akin to a Solid State Drive storage cell where high usage cells are used less often until every other cell meets it's same usage level and your batteries will last a longer time.", "score": 6, "replies": [{"body": "That's not worth an entire multi billion company.\n\nNext year the rav4 prime comes online. Toyota will have a 150k warranty on a smaller (meaning: tons of cycles) lithium battery. I'm genuinely very interested to see how the capacity on one of those will be at the 140k mark if it was been cycled thousands of times.", "score": 2, "replies": [{"body": ">rav4 prime\n\nIt only has 39 miles of EV-Only :/", "score": 1, "replies": []}]}, {"body": "That's called balance charging and it's standard procedure on any $20 LiPo charger from china. not something new/special from tsla in any way shape or form.", "score": 1, "replies": []}]}]}]}, {"body": "Then why can't these motherfuckers make a cell phone battery that lasts 24 hours that doesn't explode?", "score": 1, "replies": []}, {"body": "they are not even that. Banks of 18650s with shitty fill-factor? The 1990s called and wants it's battery tech back. Let me know when they start doing molded-to-fit batteries like a Macbook Pro.", "score": 0, "replies": []}]}, {"body": "I mean it was obvious they were one in a million a while back. He could've turned during the plunge in the $170s last spring", "score": 17, "replies": [{"body": "Obvious my ass. Until the Model 3 came out and sold very well, Tesla was a neat concept company that made toys for rich people.", "score": 21, "replies": [{"body": "> Until the Model 3 came out and sold very well, Tesla was a neat concept company that made toys for rich people.\n\nDid you even read my comment", "score": 5, "replies": [{"body": "Eh. Model 3 wasn't a clear market winner until later last year.", "score": -17, "replies": [{"body": "You have eyesight problems?\n\n**He could've turned during the plunge in the $170s last spring**", "score": 16, "replies": [{"body": "You have eyesight problems? The market price was clearly volatile due to the combination of Model 3 uncertainty and the phasing out of the tax credits. Until the Model 3 showed consistent multi-quarter high sales it wasn't so obvious that early in 2018. You're just using hindsight bias, or worse, naked technical analysis. It was far from a sure thing back then or it would've never reached that low. What do you think drives asset prices?", "score": -14, "replies": [{"body": "> it wasn't so obvious that early in 2018.\n\nSo last spring was in 2018, good to know. I wonder where spring 2019 went! xD\n\nHindsight bias my ass, I went all in at $180 last spring and got thoroughly laughed at", "score": 8, "replies": [{"body": "Oh a language game, nice, been a while.\n\n When people say last spring I tend to think spring of last year. When people say this spring I think spring of this year, because when they say \"next spring\" they're obviously referring to spring 2020. If last spring was 2019, then this spring and next spring would both be spring 2020. How can this spring and next spring be the same spring? Checkmate atheist.\n\nAlso let's see some screenshots my man, if you actually bought back then, good on you, you'd be one of few who doesn't do that \"it was so obvious\" thing, one year later.", "score": -5, "replies": [{"body": "Damn once in a while I come across a true autist, in the spring of 2018 tesla was in the $300s, not the $170s.", "score": 3, "replies": [{"body": "Eh whatever. My main point of contention is the overuse of the word 'obvious' with hindsight on this server. At least \"literally cannot go tits up\" is funny", "score": -2, "replies": [{"body": "this guy is why the anti vaxxers exist", "score": 2, "replies": [{"body": "Intellectual overconfidence is a trait of anti-vaxxers, assuming they are smarter than the medical community.\n\nThat same trait, overconfidence, is what I was criticizing here. Plus a healthy dose of hindsight bias. I assumed this guy was like 90% of people who go \"oF cOuRsE tEsLa wENt uP\" after it had already gone up, but it seems he actually did have the right idea beforehand, that was my bad. But deadass spend enough time here and you'll notice the ratio of people making actual predictions before an event vs ex post facto rationalizing something that already happened and thinking they're very smart for being able to find a reason for something that already has happened, is like 1 in 10.", "score": -1, "replies": []}]}]}]}, {"body": "> Also let's see some screenshots my man\n\nhttps://imgur.com/a/SMonuqC\n\nAlso don't bother commenting further I won't answer\n\n**P.S. For reference since you have trouble with reading, posted on 01 June 2019, share price was $179**", "score": 1, "replies": [{"body": "“Never argue with an autist. They will drag you down to their level and then beat you with experience.”\n\n-ChainsawVasectomy", "score": 3, "replies": [{"body": "Damn straight.", "score": 0, "replies": []}]}, {"body": "(Grabs popcorn and watches thread)", "score": 2, "replies": []}]}]}]}]}]}, {"body": "It's still not. The company still can't consistently make a decent profit.", "score": 2, "replies": [{"body": "Yeah they can. The margin on the 3 is good. They're just expending a lot of that profit on investment into new designs, new markets and the supercharger network. And they're still turning a profit.", "score": 0, "replies": []}]}]}]}, {"body": "still is", "score": 1, "replies": [{"body": "Toy companies don't make multi-quarter best-selling sedans (and not just in the luxury category)", "score": 0, "replies": [{"body": "neither does tsla", "score": 0, "replies": [{"body": "Google \"model 3 best selling sedan\"\n\nBest selling in luxury category\n\nBest selling in \"mid size premium\"\n\n6th best selling overall for 2018", "score": 0, "replies": []}]}]}]}]}, {"body": "I did and recently sold", "score": 1, "replies": []}]}, {"body": "tsla is a bigger non-stop failure than anyone else who has attempted it. It's all over with them except for the crying.", "score": 1, "replies": []}, {"body": "The only reason that company is anywhere is because of its government contracts and subsides.  Similarly to all other car manufacturers. How does it feel to be subsidizing Elon’s wet dream with your useless USA dollars?", "score": -4, "replies": [{"body": "I’m not a shareholder. I invest like an old man into shit like JNJ. My most risky stock is SBUX.", "score": 7, "replies": []}, {"body": "Did you make a Reddit account to just post dumb shit every day?", "score": 3, "replies": []}, {"body": "Such a blind troll", "score": 0, "replies": []}]}]}, {"body": "He is a caricature of how the average person views \"bankers.\" What a fucking dolt.\n\nGood luck to anyone listening to financial advice simultaneously given by a guy blowing kazoos and soundboard FX buttons.", "score": 16, "replies": []}, {"body": "I will give him credit for always having an opinion and not ignoring his past missteps.", "score": 10, "replies": [{"body": "If I paid you seven figures to always give an opinion would you do it?", "score": 7, "replies": [{"body": "Are you telling us we're all doing this shit for FREE!?!?!?", "score": 2, "replies": []}]}]}, {"body": "He bagged on Tesla for years and never drove their cars. \n\nHe is like the old guy with the flip phone that complained about iPhone users.", "score": 18, "replies": []}, {"body": "the last time it touched $359 anything, it went down to $328 pretty shortly thereafter....", "score": 4, "replies": [{"body": "Completely different sorry this time around.  We aren’t worried about Tesla running out of money in 6 months, production is now on 2 continents with a 3rd under way, record deliveries with production that becoming increasingly efficient, 100s of thousands or pre orders for models not even in production yet, and billions in free advertising from the mass media and YouTube.", "score": 3, "replies": []}]}, {"body": "If Jimmy can't pump it higher no one can.", "score": 3, "replies": []}, {"body": "Always inverse Creamer", "score": 2, "replies": []}, {"body": "he is the original no fucks given. X-men big brain super memory guy", "score": 1, "replies": []}, {"body": "You guys really are autistic.  It's almost as if time and circumstance might change someones mind on a stock and it's future.\n\n&#x200B;\n\nHey Cramer why weren't you right about this stock 10 years ago???!!  Wtf...", "score": 0, "replies": []}]}
