{"title": "DISNEY GOING DOWN", "selftext": "FACTS: \n\n6 of their top 20 (Over a billion) worldwide box office hits were this year (Avengers Endgame, Lion King, Captain Marvel, Toy Story 4, Aladdin and Frozen 2 (give it this weekend)\n\nDisney subscribers will likely hit near 20 million by year end (with half of them being discounted subscriptions via Verizon) They wont make much money from it because Netflix, but this growth cannot be discounted. Also they own Hulu. \n\nTheme parks and resorts like crazy. Make a popular movie? Follow up with its own attraction in some of their parks.\n\nAll these reasons make Disney a great stock...which based on the WSB inverse principle means we must place PUTs and quickly. I'm suggesting the 02/21 $120 strike price, only a buck a piece but all of this DD points at it going below $100 \n\n\nI have multiple positions in DIS and have plans to initiate additional positions within the next 72 hours.", "id": "e8eons", "created_utc": 1575919799.0, "score": 118, "upvote_ratio": 0.93, "num_comments": 84, "comments": [{"body": "Never bet against the mouse", "score": 152, "replies": [{"body": "there is an entire industry based around getting rid of vermin. Puts FTW", "score": 51, "replies": [{"body": "You don’t know shit! DIS is the new AMD. WSB was all over Sue Bea’s chesticles when AMD was below $4. Now WSB is milking the mouse.", "score": 26, "replies": [{"body": "I have nipples, Greg, could you milk me?", "score": 18, "replies": []}, {"body": "Ya but disney is full of pedophiles", "score": 2, "replies": [{"body": "Also.  Dont you ever try to compare anyone to our queen su bae like that again...", "score": 3, "replies": []}]}]}, {"body": "Did you buy and hold?  Those puts would be worth probably 1000% or more what you paid.", "score": 1, "replies": []}]}, {"body": "I have spoken", "score": 10, "replies": [{"body": "I will delight in inversing your inverse of my inverse of the WSB inverse", "score": 7, "replies": [{"body": "🤪", "score": 3, "replies": []}]}]}, {"body": "Here from the future.  Your put would be worth somewhere around 5000 dollars each.", "score": 1, "replies": [{"body": "I didn’t have Disney puts back then. But TSLA. Made a bunch on that.", "score": 1, "replies": []}]}]}, {"body": "The true rule of WSB is to inverse whatever advice is given on here.\n\nSo DIS to $200 confirmed", "score": 67, "replies": [{"body": "Disney does not move. Fuck your calls and your puts", "score": 20, "replies": [{"body": "Sell Iron Condors?", "score": 12, "replies": []}, {"body": "[Fuck Yo Grapes](https://youtu.be/9rK7qd2dWHI)", "score": 1, "replies": []}]}, {"body": "Wait no, I said all the facts indicate its going to do well, thus it will have to be puts.....are you inversing the inverse result of my inverse theory? You keep going and you'll end up dressing like a mouse.", "score": 6, "replies": [{"body": "I have spoken.", "score": 7, "replies": []}]}]}, {"body": "[deleted]", "score": 25, "replies": [{"body": "I literally just said above! Check my comment, that is  hilarious. \n\nI also feel $120! To funny.", "score": 10, "replies": []}, {"body": "It's really not out of the realm of possibility, why do you think it is?", "score": 2, "replies": []}, {"body": "Omg lol.  From the future.  His put is worth 1000% investment", "score": 1, "replies": []}]}, {"body": "Update with pics on your positions l", "score": 19, "replies": []}, {"body": "This is the way", "score": 12, "replies": [{"body": "This is the way.", "score": 6, "replies": [{"body": "This is the way.", "score": 3, "replies": []}]}]}, {"body": "Classic inverse the inverse situation", "score": 12, "replies": [{"body": "Double Secret Inverse 🤫", "score": 4, "replies": [{"body": "Triple publicly acknowledged inverse", "score": 3, "replies": []}]}]}, {"body": "I'm holding my calls baby", "score": 7, "replies": [{"body": "Better off holding your balls cause them calls will be worth nothing soon.", "score": 6, "replies": []}]}, {"body": "Is it truly an inverse pick if you state it on WSB? I’m going to inverse your inverse and buy calls to satisfy the inverse rule.", "score": 7, "replies": [{"body": "By that logic anyone who reads your comment has the inverse the inverse of your inverse and buy puts", "score": 5, "replies": []}]}, {"body": "$160 in two weeks!", "score": 4, "replies": [{"body": "With a name like Nick D I was not expecting much...you delivered.", "score": 2, "replies": []}]}, {"body": "This is so Autist.", "score": 4, "replies": [{"body": "Perfect for WSB", "score": 1, "replies": []}]}, {"body": "i averaged down/doubled down or whatever it's called today  - at the high.", "score": 3, "replies": [{"body": "This guy fucking gets it, averaged down on his puts to maximize his gain. Wohoo!", "score": 3, "replies": [{"body": "Lol I never said I grabbed puts.", "score": 3, "replies": [{"body": "Ballsy admitting you wasted your money by betting against a sure thing.", "score": 1, "replies": []}]}]}]}, {"body": "If ur buying now ur already too late", "score": 3, "replies": [{"body": "Exactly, I put all my money in before I posted!", "score": 2, "replies": []}]}, {"body": "I’ve been holding calls for 2/20 for awhile now.", "score": 3, "replies": [{"body": "Apologies but did you even FUCKING read my well crafted shitpost? It's PUT time baby!", "score": 1, "replies": [{"body": "I’ll inverse myself", "score": 3, "replies": [{"body": "Thank you for respecting the rules of WSB", "score": 1, "replies": []}]}]}]}, {"body": "\\*Remind me to ridicule this pleb.", "score": 3, "replies": [{"body": "Heh, yeah.  I just grabbed some calls today hoping the ship isn't too far from the harbor yet.", "score": 2, "replies": [{"body": "You can lead a horse to water but...", "score": 2, "replies": []}]}, {"body": "You made me start to doubt myself then I looked at your contributions to this subreddit and realized you pushed weeds calls.... Nuff said", "score": 2, "replies": [{"body": "Pleb.", "score": 1, "replies": []}]}]}, {"body": "You didn't mention merchandising off those films,  so you under played your inverse.   All in calls then", "score": 3, "replies": [{"body": "Great point Baby Yoda won't be available until months after everyone wants it for holiday gifts. Puts Gang!", "score": 1, "replies": []}]}, {"body": "You realize the numbers they were touting included free trials", "score": 3, "replies": [{"body": "Exactly and we all know after 7 days everyone was like \"not interested\"", "score": 1, "replies": []}]}, {"body": "So long DIS? I’m confusef", "score": 3, "replies": [{"body": "Just transfer me your money, I'll play for you", "score": 1, "replies": []}]}, {"body": "Hulu with live tv pricing going up 20%", "score": 2, "replies": [{"body": "Pricing themselves out of the Market, $100 here we come!", "score": 2, "replies": []}]}, {"body": "Disney Park opex with Streaming opex is not the same besides head office G&A so DIS has nearly no profit synergies.  They might beat Revenue but they will surprise with an EPS loss", "score": 2, "replies": [{"body": "This guy fucks", "score": 2, "replies": []}]}, {"body": "you are late to the game already Dis has been selling off for weeks now. Look at every gap up in the morning gets sold off instantly.", "score": 2, "replies": [{"body": "Am I late to the game if this shit's hitting a hundred? Focus on learning basic math...", "score": 1, "replies": []}]}, {"body": "I hope no one takes this seriously", "score": 3, "replies": [{"body": "Considering its down today, looks like I was right and you call fuckers are wrong.", "score": 9, "replies": [{"body": "I don't know what your breakeven is but if it's anywhere close to $120 you're gonna have fun losing your money", "score": 7, "replies": [{"body": "My break even is a dollar cause that's what I spent.....this guy", "score": 3, "replies": []}, {"body": "That's what I'm thinking...", "score": 2, "replies": [{"body": "No one cares for your lack of details....", "score": -1, "replies": []}]}]}]}]}, {"body": "Disney + doesn't even launch in Europe until early next year. Their numbers are gonna continue to go up.\n\nNext time you wanna lose money, burn it and get it over with instead of the slow painful death you chose.", "score": 3, "replies": [{"body": "This is GUH part two", "score": 4, "replies": []}, {"body": "Good point, Disney has done poor planning by not having a global launch. By the time they launch fucking HBO will have streaming out already. Puts Gang Assemble!", "score": 1, "replies": []}]}, {"body": "Inverting this horseshit for certain.", "score": 2, "replies": [{"body": "Invert away", "score": 1, "replies": []}]}, {"body": "All time high while they lost $1 billion on streaming last quarter over Hulu acquisition. DIS+ was down or bugged out during its launch, they must have spent a lot trying to keep it up.", "score": 1, "replies": [{"body": "If bugged you mean so many people logged on their servers could not handle the traffic. Than yes it was bugged.", "score": 8, "replies": [{"body": "Yup, they weren't ready for the business. Seems like Disney isn't a long term hold, they should stick to theme parks", "score": 1, "replies": [{"body": "Haha.  Have you been to any of their parks recently?  Certainly you have noticed all of the buzz on social media over Disney+.", "score": 3, "replies": [{"body": "Of course I haven't been to the parks, who goes to a kids park? Pedo Alert. \n\nAlso the only buzz I heard about Disney Plus was that they couldn't get their service to work well the first day.", "score": 2, "replies": [{"body": "The parks done really well and they are raising the tickets.  You haven't heard any of the Baby Yoda stuff?  I don't believe you.", "score": 1, "replies": []}]}]}]}]}, {"body": "Thank you, this guy gets it!", "score": 2, "replies": []}]}]}
{"title": "$TSLA at $700 in 5 years", "selftext": "", "id": "e8ici6", "created_utc": 1575935810.0, "score": 148, "upvote_ratio": 0.96, "num_comments": 86, "comments": [{"body": "wow this is so much more accurate. 700 bear price vs 4000 bull price. \n\nimagine being a MS analyst and predicting $10 or $500 when we have ark investments predicting a 700 bear price vs 4000 bull price", "score": 106, "replies": [{"body": "Becky MS vs. Stacy Ark Invest", "score": 42, "replies": []}, {"body": "Thankfully our financial institutions dont hire people that retarded", "score": 1, "replies": []}]}, {"body": "Bear case $700 Bull case $4000. Ya.", "score": 118, "replies": [{"body": "Ayeeeeee", "score": 14, "replies": []}, {"body": "Umm achtualllyy\n\nif those fuckers at cnbc let her finish, I think she was gonna say her bull case is much higher now", "score": 12, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "It has motley fools very rare double down alert, ‘mkay?", "score": 1, "replies": []}]}]}, {"body": "2k by 10 years", "score": 39, "replies": [{"body": "Guess I need to buy Tesla stocks with my credit card now", "score": 37, "replies": []}, {"body": "4k in 15", "score": 9, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "RemindMe! 50 years", "score": 1, "replies": []}]}]}]}, {"body": "The stock already doubled this year. After halving... Tesla has been trading between $180 and $360 for the last several years. It’s not a good stock to actually invest in. Great to YOLO though. $420 by April 20, 2020", "score": 58, "replies": [{"body": "[deleted]", "score": 24, "replies": [{"body": "You know you will", "score": 9, "replies": [{"body": "The 5% of us that have the funds will.", "score": 8, "replies": [{"body": "I'm taking a HELOC and selling my body for this. today worth it", "score": 1, "replies": [{"body": "You can run a HELOC on a tent? TIL.  Better chance going with the perpetual flesh sale.", "score": 1, "replies": [{"body": "It's a 4 person tent. Show some respect.", "score": 2, "replies": [{"body": "My mistake😟🙅", "score": 1, "replies": [{"body": "💖🌈", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "IMO the date under discussion includes two big thresholds: full autonomy and maturity of EV market.\n\nIf they pass those two tests they will definitely make some serious money, and i'm not sure all the existing ICE manufacturers will pass.", "score": 6, "replies": [{"body": "They definitely won't pass, they see where things are going. Porsche making the Taycan, next cayman will be all electric too. VW ID.3, plus a few others. Renault-Nissan going in the right direction as well. Toyota has been moving more and more to hybrids in the last 15 yrs, I don't think they'll shy away from full electric. These companies are a bit like big pharmaceutical companies - don't want to do the battery RnD themselves, but they won't just sleep on a large market segment", "score": 5, "replies": [{"body": "Ford already threw 500 mil at Rivian as well", "score": 2, "replies": []}, {"body": "The brand recognition from being first mover is unreal though.  High School kids know who Elon is.  Thats status for a CEO.", "score": 2, "replies": []}]}]}]}, {"body": "5 fucking years? All of us will be dead or worse we'll have fucking children.", "score": 23, "replies": [{"body": "Or worse, we'll be broke\n\nWait...", "score": 9, "replies": [{"body": "Or broke and have children.", "score": 3, "replies": []}]}]}, {"body": "OP is gonna lose it all when Elon decides to smoke DMT with Joe Rogan on screen", "score": 40, "replies": [{"body": "How do you think Cybertruck was designed?", "score": 9, "replies": []}, {"body": "that's literally the catalyst for a $4k target", "score": 16, "replies": []}]}, {"body": "Petition to add Ark Invest bae Tasha Keeney to the current WSB cybertruck banner", "score": 19, "replies": [{"body": "Fuck yes.  I like it.", "score": 3, "replies": []}]}, {"body": "100% return in 5 years?  This is WSB where you can make and lose 100% in minutes.", "score": 6, "replies": []}, {"body": "840 you plebe", "score": 3, "replies": []}, {"body": "A stock doubling in 5 years isn't far from ordinary", "score": 8, "replies": [{"body": "What about a stock fucktupling in 5 years?", "score": 5, "replies": [{"body": "Ill fucktuple your mom", "score": 9, "replies": [{"body": "Fucktupleing his mom isn’t far from ordinary", "score": 3, "replies": []}]}]}, {"body": "Yeah buts that’s the bear case. Bull case 4000.", "score": 2, "replies": []}]}, {"body": "10k by eoy", "score": 3, "replies": []}, {"body": "I’ll have whatever Kathy is smoking.", "score": 3, "replies": [{"body": "Yeah, me too!!", "score": 1, "replies": []}]}, {"body": "CyberVan think T2 or Mystery Machine covered in chrome (with custom plate PedoGuy), TSLA to the mooooon...", "score": 2, "replies": []}, {"body": "Im in, you son of a bitch", "score": 2, "replies": [{"body": "Im in, you son of a bitch", "score": 1, "replies": []}]}, {"body": "01/2025 $700 calls locked and loaded", "score": 2, "replies": [{"body": "I see Robinhood opened up a new market......the MEGA LEAP", "score": 2, "replies": []}]}, {"body": "Or $0 bc ded.", "score": 2, "replies": [{"body": "Ban", "score": 3, "replies": []}]}, {"body": "Ark is a pump shop", "score": 2, "replies": []}, {"body": "Why isn't Robinhood letting me buy $4000 calls????!!?!", "score": 2, "replies": []}, {"body": " David Einhorn enters the chat", "score": 2, "replies": []}, {"body": "Sure, after Musk's incorporates Fib technology into his cars", "score": 1, "replies": []}, {"body": "Basically free money gang", "score": 1, "replies": [{"body": "Elon has free money spigots.", "score": 1, "replies": [{"body": "Elon has his own weather machine", "score": 1, "replies": []}]}]}, {"body": "Before that where is 420?", "score": 1, "replies": []}, {"body": "Bear case is 4000 IMO", "score": 1, "replies": []}, {"body": "Wasnt down til she has #s to back it up", "score": 1, "replies": []}, {"body": "Every time I see a CNBC link I imagine it coming straight out of the mouth of Joe Kernan and it makes my autism infinitely worse.", "score": 1, "replies": []}, {"body": "EOW", "score": 1, "replies": []}, {"body": "Is this the rumour or the news? I need to know if which one so I can buy or sell like the guru's in /r/investing teach", "score": 1, "replies": []}, {"body": "With inflation that's basically a 0% increase", "score": 1, "replies": []}, {"body": "Any prediction loses accuracy exponentially after >3 years", "score": 1, "replies": []}, {"body": "They would have to sell a mountain of cocaine to get to that price.", "score": 1, "replies": []}, {"body": "I was thinking I should buy 20k usd worth of Tesla stock but that only gives me 57 shares at current price and even if Tesla goes to 1k I’d only make 40k. 2:1 pot odds at 33% idk if the likelyhood of that happening is greater than 33% to risk $20,000. Thoughts?", "score": 1, "replies": []}, {"body": "Is this credible, or in any way realistic? Bearish prediction is $700? Honestly curious", "score": 1, "replies": [{"body": "do you think tesla is worth 120 billion without AP?\n\nSelling cars, batteries, solar and now a subscription service for premium internet, future potential to be a full scale energy company with leading battery tech.\n\nFor comparison Waymo is worth 100 billion because of potential of AP revenue and they can't scale as much as Tesla and are about as far from AP as Tesla. Btw I think Tesla will be first to FSD.", "score": 3, "replies": [{"body": "Interesting thanks", "score": 1, "replies": []}, {"body": "> now a subscription service for premium internet\n\nnot TSLA btw. SpaceX is a private concern.", "score": 1, "replies": [{"body": "Tesla cars will have 10$ subscriptions to view Netflix YouTube and stuff", "score": 1, "replies": [{"body": "Elon likey", "score": 1, "replies": []}, {"body": "Nah Tesla cars will pay you a $10 so Disney+ can stream dashcam footage from the fleet as reality TV.", "score": 1, "replies": []}]}]}]}, {"body": "Some bear analyst here maybe. Bear thesis is bankrupt go to 0 Elon Musk runs away to Mars.", "score": 2, "replies": []}]}, {"body": "so basically i need to short this now?", "score": 1, "replies": []}, {"body": "Behold the power of hype!", "score": 0, "replies": [{"body": "https://www.bbc.co.uk/programmes/m000c2w6", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "What does one have to do with the other??", "score": 0, "replies": []}]}, {"body": "Is space x under the Tesla umbrella or does it have its own ticker symbol. In any case, space x may have an extremely bright 10 years based on what they are working on.", "score": 0, "replies": [{"body": "It's a private company.", "score": 2, "replies": []}, {"body": "Not public so no ticker. And Elon has said being public sucks so he won’t do it for his other businesses.", "score": 1, "replies": []}]}, {"body": "most companies will have electric cars and self driving cars in 5 years\n\nthe money will be in electric trucks.tslr cant get cars out fast enough so quality goes down,then you get crashs and driver dies,will it always be the drivers fault", "score": -10, "replies": [{"body": "ur an idiot", "score": 6, "replies": []}, {"body": "ur a retard", "score": 2, "replies": []}]}]}
