{"title": "TSLA +12.72% today, Q3 earnings tomorrow.", "selftext": "Tesla shares popped 12.72% today, driven by Citron Research's HUGE shift of opinion in the 9 page document:\n\n\"Citron reverses opinion on Tesla. The story has become too compelling to ignore\".\n\n(google it to read)\n\nTesla also, on almost no notice, pulled their Q3 earnings call forward by a few weeks. It takes place tomorrow after market close.\n\nQuestion is, how positive will Tesla's Q3 results be, and how much room does the stock have to move on the results, given the enormous gains made today?\n\nIMO, shares pop over $300USD on Q3 results, close 2018 over $300 and never fall below that mark again.... even if Elon Musk does LSD next time he appears on the Joe Rogan podcast.\n\nI think in 5-10 years, we'll look back on a $300 2018 stock price and laugh at how ludicrously cheap it was given all the available evidence for future success.\n\nFYI, I have a small position in TSLA.", "id": "9qsrvf", "created_utc": 1540326388.0, "score": 294, "upvote_ratio": 0.93, "num_comments": 179, "comments": [{"body": "> even if Elon Musk does LSD next time he appears on the Joe Rogan podcast.\n\nJoe Rogan is the new wizard of Omaha.", "score": 139, "replies": [{"body": "Elon Musk is the new Snoop Dogg. ", "score": 30, "replies": [{"body": "Elon Musk is a heroin shot away from dying. I'm genuinely worried about the dude. ", "score": -8, "replies": [{"body": "The guy is probably stressed out of his mind (as evidenced by erratic tweeting), but none of the drugs he has allegedly taken come anywhere near heroin in terms of personal harm. Comparing LSD to heroin is ridiculous.", "score": 8, "replies": [{"body": "His erratic tweeting seems more happy than anything, I'd say he's in love or excited for Tesla's success.\n\nIf he was randomly insulting people, then you'll know he's stressed.", "score": 7, "replies": [{"body": "Lol, prolly too subtle for the fanboys tho.", "score": 3, "replies": []}, {"body": "Like the SEC? Vernon Unsworth? Tesla short sellers?\n\nThe guy doesn’t exactly scream stable to me.", "score": 1, "replies": [{"body": "Old news. Try to update your mainstream media sometimes.", "score": 1, "replies": [{"body": "https://twitter.com/elonmusk/status/1047943670350020608?s=21\n\nThis was less than a month ago. You need to work on your attention span if that’s old news.  This is directly related to the most expensive stupid tweet of all time and isn’t what anyone expects from a stable CEO", "score": 1, "replies": [{"body": "How is that erratic? You need to lighten up if you can't take a clever joke. SEC didn't even give a shit.", "score": 1, "replies": [{"body": "They gave enough of a shit to fine him 20$ million and give him a 3 year ban as chair of the board for talking shit on twitter.\nFucking around with the people who have the power to completely ruin his entire project is not a good idea.\nAlso, have a look at the replies on that tweet of desperate people who lost thousands of dollars because he can’t stop saying stupid shit on twitter, this isn’t a game.", "score": 1, "replies": [{"body": "Slap on the wrist. Don't be such a drama queen.", "score": 1, "replies": [{"body": "That’s completely besides the point. The point is that it was entirely avoidable if he’d simply chosen not to commit securities fraud by running his mouth on twitter in an erratic fashion.\n\nWhen you’re as responsible for as many people as Musk is, your license to do dumb shit is revoked, especially when that dumb shit has a direct affect on the stock price and performance of your centre-piece company.\n\nThis isn’t rocket science (if you’ll forgive the poor joke). Committing libel and securities fraud on twitter isn’t just banter and you can still be a fun personality without negatively impacting billions of dollars of people’s money.", "score": 1, "replies": [{"body": "He was sued because he said \"Funding Secured\" which it was, just not on paper. \n\nFraud requires intent, which is why the case ended in a non-guilt agreement.\n\nHe can tweet erratically all he wants as long as the stock isn't mentioned.\n\nCase closed.", "score": 1, "replies": [{"body": "What is wrong with you? Calling me an “uneducated ape” because I’m not worshipping Musk and pointing out his very human flaws that have had a demonstrable impact on both him and his business is absurd.\n\nIt clearly wasn’t secured (as evidenced by the supposed “slap on the wrist”), and even if it was, he messed it up with “erratic tweeting”.\n\nAll I’m saying is, likely due to the stresses of operating Tesla, Musk has said some ridiculous stuff on twitter that has led to two lawsuits and a demonstrable effect on the stock price.\n\nThis isn’t controversial, and your decision to resort to personal attacks in lieu of an actual argument should be just cause for a little personal reflection.", "score": 1, "replies": [{"body": "It was a weak case, everyone knows it (even a SEC lawyer.) \n\nInstead of fighting it and winning, Elon decided to settle for the investors sake and make it go away.\n\nFunding was easily secured, Saudi's approached him with multiple offers over the past 2 years.\n\nStock prices don't matter, long-term will be over 1k. Don't be such a drama queen.", "score": 1, "replies": [{"body": "Once again, this is completely beside the point. Whether or not he would have won the case is irrelevant, the entire situation could have been avoided if he simply didn’t tweet. It’s the exact same situation with Vernon Unsworth.\n\nEven if he definitely would win both lawsuits (that isn’t exactly a guarantee either), it’s still true that it was stupid, erratic, and unnecessary to get involved in them anyway.\n\nI don’t understand what point you are making, I’m not necessarily commenting on the results of his lawsuits or the long term viability of Tesla as a company. I’m just saying Musk has made multiple unforced errors in regards to tweets and that that has both cost him to an extent and made him look erratic and unstable.\n\nI don’t know why you are being so belligerent on this point. It is obvious that the tweets were mistakes and Musk would have been better off having never made them.", "score": 1, "replies": [{"body": "Nah, blowing a whistle at a pedo was a good move, regardless of backlash. ", "score": 1, "replies": [{"body": "Are you serious or are you just messing with me?\n\nThere is no evidence that that was anything other than a defamatory statement in response to Musk’s ego being bruised by an insult. It’s not a coincidence that this was the guy who insulted him.\n\nI would be very interested if you can produce anything that would prove otherwise.\n\nI understand that Tesla is one of your long term investments and that you believe it will dominate the EV market in the future. However, that is no reason to dogmatically defend everything the boss does.\n\nElon Musk is not a perfect human being, and I’m only trying to say that making multiple unforced errors is not a good idea. He has made more than just these two over the years with varying degrees of justifiability and almost all of them were completely unnecessary and avoidable. This isn’t complicated. You can defend individual statements he has made until the sun comes down but you are missing the point, that being that you shouldn’t have to defend several dubious statements because he shouldn’t be making dubious statements as a prominent CEO.", "score": 1, "replies": [{"body": "No, I'm serious. All signs point to pedo. \n\nLooking forward to seeing what evidence a million dollars can dig up, when he gets Vermin in an American court. ", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Let the man love his games and animes", "score": 1, "replies": []}]}]}, {"body": "Because he does psychedelics you assume he's addicted to opiates?\n\nOk then.", "score": 1, "replies": []}]}]}, {"body": "Why Omaha", "score": 1, "replies": [{"body": "It's where Warren Buffett (\"The Oracle of Omaha\") is from.", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 28, "replies": [{"body": "[deleted]", "score": 25, "replies": [{"body": "It takes a lot of education, and a surprising amount of experience in Bird Law.", "score": 36, "replies": [{"body": "Which is just laughable, seeing as bird law in this country is not governed by reason.", "score": 1, "replies": []}]}]}, {"body": "Not to mention if he owns the only company that can get to mars, he essentially owns an entire planet", "score": 5, "replies": [{"body": "Here’s the thing tho, I honestly don’t think the government (Not one in particular but all of them collectively) will give Musk this power. It essentially makes him a god and there’s no way they let that kind of power get to a man. There’s gotta be crazy government regulation.\n\nAnd I get it, his is the only company to get to Mars so he’s gotta have an upper hand. Not exactly, maybe short term. But once you prove something can be done everyone’s gonna replicate. And how long till you think another company pops up with ties to the government that can colonize Mars if he doesn’t comply? \n\nSure nobody can be certain and there’s always a possibility Tesla could become this huge company, biggest we’ve ever seen, but it’s not gonna be easy if it does end up happening. Once he gets to Mars it will just be the beginning.", "score": 4, "replies": [{"body": "Right, it’s kinda like betting on any fusion company right now. “Well theirs is the only company that is going to make fusion a thing, so...”\n\nYeah someone is going to do it and it’ll be awesome. But business is not as simple as being the first or best marketed in an emerging space.", "score": 1, "replies": []}, {"body": "I’m not worried, I don’t see the “government” as a functional organization, point in case can’t push climate change regulation quickly (other countries have already funded solar factories and set ban dates for gas cars) or set AI regulation, or stop bezos from putting countless retailers out of business, it just sits idly by and bickers about the next election cycle", "score": -2, "replies": [{"body": "Climate Change is a tricky situation because it loses people money if they act towards fixing it. \n\nBut this on the other hand would make them money so you better bet they’ll be going full steam ahead to make sure they don’t miss out on their payout.\n\nIt’s fucked up but it is what it is", "score": 5, "replies": []}]}]}, {"body": "I have a feeling some convenient laws will be put into place defining those trips as a utility that can't be denied.", "score": 1, "replies": []}]}, {"body": "I'm glad to know others following my line of thinking. Everything Tesla is doing will be useful on AND off earth.\n\nAnother point to mention, just on the investment front is that Space X is already profitable. Big launch manifest + exponentially decreasing launch costs while reusability is perfected = increasing margins. When the internet swam is operational, revenues and profits are going to a whole other level. \n\nSpace X progress may not look relevant to Tesla in the short term but both companies can share tech and resources (e.g. manufacturing, materials, AI etc). Same with The Boring Company. Over time, I see them becoming more integrated. ", "score": 2, "replies": []}]}, {"body": "I'm calling a bad day tomorrow, down 8%. Mod if I'm right, ban if I'm wrong.\n\nEdit: wish me luck boys\n\nEdit: well uh turns out Tesla is preeeety good. *Runs*", "score": 74, "replies": [{"body": "/r/wallstreetbets material here... Get me on the screenshot", "score": 36, "replies": [{"body": "You have my sword!", "score": 1, "replies": []}]}, {"body": "The longs thank you for your sacrafice.", "score": 6, "replies": []}, {"body": "Yeah I'll be ready with some puts", "score": 2, "replies": []}, {"body": "!RemindMe 1 day", "score": 2, "replies": [{"body": "I will be messaging you on [**2018-10-25 05:23:33 UTC**](http://www.wolframalpha.com/input/?i=2018-10-25 05:23:33 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/stocks/comments/9qsrvf/tsla_1272_today_q3_earnings_tomorrow/)\n\n[**CLICK THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/stocks/comments/9qsrvf/tsla_1272_today_q3_earnings_tomorrow/]%0A%0ARemindMe!  1 day) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! e8cemwf)\n\n_____\n\n|[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/)\n|-|-|-|-|-|-|", "score": 3, "replies": []}, {"body": "!RemindMe 1 day ", "score": 1, "replies": []}]}, {"body": "Can’t wait ", "score": 2, "replies": []}, {"body": "GG", "score": 2, "replies": []}, {"body": "BAN", "score": 2, "replies": []}, {"body": "!RemindMe 1 day", "score": 1, "replies": []}, {"body": "GG", "score": 1, "replies": []}, {"body": "GG", "score": 1, "replies": []}, {"body": "GG", "score": 1, "replies": []}, {"body": "Haha glad I got reminded of this post. Now, MOOOODS!! ", "score": 1, "replies": []}]}, {"body": "Word is it's going to $420.", "score": 34, "replies": [{"body": "I'll smoke to that.", "score": 1, "replies": []}]}, {"body": "23 shares at 260 ☺️☺️ Lets get it tesla boiis", "score": 17, "replies": []}, {"body": "> I think in 5-10 years, we'll look back on a $300 2018 stock price and laugh at how ludicrously cheap it was given all the available evidence for future success.\n\nI think the market cap (50B), is already factoring in a lot of the future success. At current state, no way the company is worth 50B. It is trading on sentiment and the 'story'.\n\nBut then again, it is not hard to imagine that the future that got 'priced in', will be priced again. It may go 5x, but there are plently of stocks to choose from in the market which also have a good 'story' but also have the balance sheet and economic 'moat' to back up the price. It is not like you either have to go long or short on TSLA, you can also ignore it.", "score": 18, "replies": [{"body": "I agree market cap is factoring in som future success. That is what happens when visionary leadership, execution and continued innovation and disruption are highly likely. I think Tesla's stock price will continue to factor in future success for many years to come.", "score": 5, "replies": []}, {"body": "So name a few with the same growth potential . Not ones that are In stagnant markets that will hover around 10-15% growth margin for years . It’s easy to say there  are plenty of stocks out there but there aren’t many that can match Tesla’s growth . \nFundamentals matters I agree with that whole heartedly and my portfolio with exception of Tesla shows that .. but they don’t apply to certain stocks , why ... in my personal dumb founded noob opinion it’s because the masses are hungry for change and when a company in any sector  provides that their stock will shine. \nAmazon and Netflix are other examples same applied to them for a long time they were not profitable not sustainable, burning through cash , PE was horrible etc etc ... i personally watched them go from affordable for me to invest in  to “ I can’t even buy a single Frikin share “ \nI completely understand someone not willing to invest their hard earned money due to volatility But what was driving that volatility news and shorts. I sold my damn $ 200 ish position (all of it ) when I saw the frikin bankruptcy news everywhere and learned my lesson after that .... that was a shitty day . You need to believe in the product and the company to invest in it . I have coworkers who had most of their retirement in GE why cuz GE believe it or not Did EVERYTHING and was literally too big to fail. \nTesla will survive and prosper as long as they don’t deviate from their vision and produce cars that people want .  Hate or love the stock I really like the product . Hopefully I can afford one in the future . ", "score": 1, "replies": [{"body": "Local mall (Short Hills NJ) - I went in the Tesla store many years ago, maybe 5-6, glanced at the cars and walked out.  \n\nThis last weekend- walked in expecting to walk right back out, and instead spent 45 minutes talking to a salesman about the cars, sitting in them, checking out all the features.  \n\nThey aren't sitting on their laurels.  ", "score": 3, "replies": [{"body": "Did you test drive? You’ve gotta test drive. God dam are they fun. ", "score": 2, "replies": [{"body": "Didn’t know that was an option.", "score": 1, "replies": []}]}]}, {"body": "The thing that's wrong with your comparisons is that Netflix still isn't profitable and Amazon hasn't been burning through cash for almost 20 years now (that's right, there is a 0 after the 2).", "score": 1, "replies": []}]}]}, {"body": "Tomorrow down 20% on earnings beat, cuz stock market :/", "score": 5, "replies": [{"body": "It's not until after hours", "score": 4, "replies": []}]}, {"body": "Bought around 50 shares in ranges between 240 and 260\n\nPretty happy about the 13% up today hehe", "score": 14, "replies": [{"body": "I have a couple of shares, not complaining!", "score": 5, "replies": [{"body": "another 10% after market ohohoho I thought about selling before earnings release but im glad I didn't ", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 61, "replies": [{"body": "Great thing about tesla stock, short or long, you’ll be right at some point during the week.", "score": 68, "replies": [{"body": "50% of the time you're right every time. ", "score": 13, "replies": []}]}, {"body": "> historically wrong\n\nSo what are you suggesting? Were they wrong on their short or long?", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "That means he shorted it before they released the paper\n\n*After", "score": 4, "replies": []}, {"body": "To be fair, they went long twitter too after originally shorting it", "score": 1, "replies": []}]}, {"body": "> Were they wrong on their short \n\nYes.  They shorted 2 years ago, expecting it to drop from 180 to 90.  They are suing Musk/Tesla for having to exit soon after his 'funding secured / 420' tweet.", "score": 1, "replies": []}]}, {"body": "They were recently correct about NVDA being way over priced", "score": 3, "replies": []}, {"body": "> intentionally hindering his own company\n\nWhile everyone is worried about Elon smoking, he's smoking the competition. ", "score": 5, "replies": []}, {"body": "agree, it is a boat I am willing to miss. There are plently of stocks in the market to choose from, I am ignoring TSLA\n\nIt is entertaining to watch the TSLA volatility but I don't think I will participate on it.", "score": 3, "replies": []}, {"body": "I don't like Citron, but this is disingenuous.. They wouldn't exist if they were historically wrong.  They likely have many positions that they don't disclose.  You might perceive them to be wrong more frequently on the things THEY TWEET about.. But that doesn't mean they tweet all of their positions, and you also don't know their timelines for each holding.", "score": 2, "replies": [{"body": "I personally don't really care how correct or wrong they are, but its more so their ingenuity in pumping/dumping stocks to fit their interest because of their market mover ability. You really dont know if hes proping up stocks up for short term gain than immediately shorting or vice versa. Granted this is something everyone from Bill Ackman to a 3rd year Equity Research might do, but doesn't necessarily its right. ", "score": 1, "replies": []}]}, {"body": "How is Musk hindering Tesla? Look at the net result of his leadership and tell me.", "score": -2, "replies": [{"body": "[deleted]", "score": 14, "replies": [{"body": "In a ruthlessly fast-moving, innovating and disruptive company, higher than average turnover isn't relevant. Look at the RESULTS the company is achieving. ", "score": -19, "replies": [{"body": "You're choosing to frame this in a positive light, but high exec turnover is not generally a good thing no matter what.", "score": 20, "replies": [{"body": "nah your wrong, everyone knows they leave because they can’t take the heat, it’s kinda obvious ", "score": 1, "replies": []}]}, {"body": "Have you looked at their financial results? They're the stuff nightmares are made of. ", "score": 18, "replies": [{"body": "Of course, I have about 15% of my net worth in Tesla and I do my homework before making major investment decisions.\n\nIf I ran Tesla I would have done exactly the same. 1. Make incredible products 2. Invest as heavily as posible in scale, not short term profits.\n\nNext I'm going to hear that Amazon is a trash company because their profit margins are so slim.", "score": -1, "replies": [{"body": "“I have about 15% of my net worth in one stock”\nWoof.", "score": 9, "replies": [{"body": "You're assuming his net worth is large", "score": 3, "replies": []}, {"body": "\"A small position in Tesla\"", "score": 4, "replies": []}]}, {"body": ">Next I'm going to hear that Amazon is a trash company because their profit margins are so slim.\n\nHeh. ", "score": 1, "replies": []}]}, {"body": "Looks fine to me, not sure what shit you’ve been reading", "score": 1, "replies": []}]}, {"body": "Yeah, they’ve been constantly behind on their model 3s and Musk just got slapped with a hefty fine from the SEC. They’re crushing it. ", "score": 8, "replies": [{"body": "They’ve been behind who, their own internal goals? No other EV even comes close to matching specs of the 3", "score": 0, "replies": [{"body": "In my opinion, that’s because no other carmaker wants to lose money selling their product.", "score": 8, "replies": [{"body": "They make money selling the cars, Detroit did a tear down and said it’s 30%, do you live under a rock?", "score": 1, "replies": [{"body": "What about UBS's findings?", "score": 1, "replies": [{"body": "What about it? UBS is a financial services company, not a car tear down analytics company, ubs is short tesla and it is in their interest to post negative reports, https://cleantechnica.com/2018/09/10/insane-ubs-bias-on-tesla-ubs-analyst-recommended-selling-tsla-18-times-in-2-years-recommended-buying-gm-35-times-in-7-years/\n\nPretty basic stuff here", "score": 1, "replies": []}]}]}, {"body": "Economies of scale will kick in once the scale is built out.  As for your other car maker comment, explain how Ford has $38B in cash and cash equivalents But has a market cap of $34B.  Is their business really worth negative $4B", "score": 0, "replies": [{"body": "Making cars at a profit is REALLY hard.\n\nFord’s book value is 9.14.  I’m not really sure what you’re asking.", "score": 2, "replies": [{"body": "Why do you think Tesla wants to lose money selling cars?  \n\nI mean take fords market cap,  subtract cash and cash equivalents and you get a negative number. Why?", "score": 1, "replies": []}, {"body": "Ford is a dying company not sure why you would compare it to a rising one", "score": 1, "replies": []}]}]}]}]}, {"body": "I don’t think you got the memo, the same short sellers that fed you that line have switched sides", "score": 0, "replies": []}, {"body": "1) They always push up their deadlines and end up between their original conservative deadline and the aggressive one. \n\n2) Hefty fine? You mean the $20 million? That’s literally pocket change, not to mention Musk is covering it on the behalf of Tesla. Does not effect the company whatsoever. ", "score": -1, "replies": [{"body": "I’m sure that fine in no way affected the company.  Keep telling yourself that. ", "score": -1, "replies": [{"body": "Ya your prolly right, that 20 mil really broke the bank, guess he’ll have to sell some tequila to make it back", "score": 1, "replies": [{"body": "Headlines around the world about a ceo manipulating stock I’m sure has no effect on the company right??  Right??", "score": 0, "replies": [{"body": "Yes totally. Because of that, now every Tesla on the road is not as good as it once was. /s", "score": 0, "replies": [{"body": "I think their products are amazing but that has nothing to do with my point.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "They are losing lots of money, prove me wrong.", "score": 5, "replies": [{"body": "You don’t invest in profits. You invest in potential. ", "score": 1, "replies": [{"body": "I'm not seeing the absurd valuation when management has been more hype than results.", "score": 1, "replies": [{"body": "All those pesky imaginary cars driving around, and their fake drivers telling all their friends to buy them", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Good idea, do it and report back your findings", "score": 2, "replies": []}, {"body": "Don't bet against Elon. Buy puts when TSLA hits 400 Thursday.", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": 12, "replies": [{"body": "How exactly do you define good company? Usually good companies actually make a profit ", "score": 6, "replies": [{"body": "So Amazon was a bad company until 2017?", "score": 6, "replies": []}, {"body": "Wait until tomorrow ", "score": 4, "replies": [{"body": "if tesla makes a profit ill eat an oreo", "score": 14, "replies": [{"body": "That’s absurd, no fuckin way you’ll do it", "score": 4, "replies": []}]}]}, {"body": "How do *you* define a good company?", "score": 2, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Sustainable growth does, potential is just hopes and dreams.\n\nI would be concerned with:\n\n- the servicing of tesla vehicles and potential buybacks\n\n- tesla is focused on midsize luxury vehicles, while they are growing significantly in that niche, it is a niche that has had significant decreases in demand for cars. SUVs excluded.\n\n- scalability (it took 8 years yo figure out how to manufacture, imagine launching a new vehicle platform!)\n", "score": 1, "replies": [{"body": "* They're adding more service centres and adding on to mobile servicing where they come to your house to service. And while they've said they don't want to make their service centres profit centres, I can see that model change over time.  \n\n* We're still in the early phases of Tesla's masterplan, you can't forget that. The truck and model Y are coming out next year. There's likely to be a pickup coming in 2020.  \n\n* You mention scalability, none is close to them in battery production for EV's. And it will take a while before the competition can catch up, especially with Tesla looking to double their 2018 numbers again next year.   \nIt's not the scaling in car production, it's battery production we need to pay attention to. YOU CAN'T SLEEP ON THIS.   \nThe german car manufacturers might be really efficient about car building, but they haven't invested anything in battery production. They are at the mercy of LG, Panasonic and the likes, who are now seeing a surge in demand. They can pick & choose who to work with until real longstanding contracts come out of the woodworks with serious investments up front like how Tesla did it with Panasonic.  \nNot to mention the E-tron, Taycan, Ipace, EQC are all lower number production runs. With how much demand for EV's is growing, they will not put a dent in Tesla's demand. \n\n&#x200B;", "score": 1, "replies": []}]}]}]}]}, {"body": "Thanks for posting. I am shorting.", "score": 29, "replies": [{"body": "Puts are on clearance ", "score": 1, "replies": [{"body": "what does that mean? I only pretend to know about stocks", "score": 4, "replies": [{"body": "Puts are a stock option and it's the right to sell at a specific price.  They're often used for hedging but you can use them for speculation as a replacement to shorting.  This is extremely simplified but the general idea of it.", "score": 1, "replies": []}]}]}, {"body": "How much", "score": 1, "replies": []}, {"body": "Prove it. Show your position.", "score": 1, "replies": [{"body": "I ended up not shorting. I bought heavy positions in $amzn. That said, I still think Tesla has production problems and in the long term I don't think it will survive headwinds, such as a major economic downturn or stiff competition from other carmakers who will ramp of electric car development. No doubt, Tesla opened the door, and another company will knock it down. ", "score": 1, "replies": [{"body": "Should be a sharp buy on Amazon.", "score": 1, "replies": []}]}]}, {"body": "rekt!", "score": 1, "replies": []}, {"body": "How did that work out for you?", "score": 1, "replies": [{"body": "Didn't pull the trigger this time! Lucked out but maybe next time. ", "score": 2, "replies": []}]}]}, {"body": "I am 13% happier today!", "score": 6, "replies": []}, {"body": "Think the make or break in tomorrows ER will be:\n\n\n\n1) How long until TSLA is profitable and general guidance for next quarter\n\n\n\n\n2) Will the $1 billion+ in debt they have in debt due between nov and march be an issue", "score": 5, "replies": [{"body": "1. They will be in Q3.\n2. Model 3 sales, improved margins, no issue ", "score": -1, "replies": [{"body": "The cash flow mechanics don’t work. Or at least they haven’t ever for Tesla. Used all borrowed money to make promises, push back promises and take more notes out, Wing it when notes come due.", "score": 8, "replies": []}]}]}, {"body": "Hard to get excited about Tesla until Mgmt shows it can execute on its vision...", "score": 5, "replies": [{"body": "That's the fucking point dude. They are! :)\n\nRead the report. Check the sales, production and deliveries data. They are executing, at scale, on the make-or-break product.", "score": 2, "replies": []}, {"body": "it isn’t? ", "score": 1, "replies": []}]}, {"body": "This stock is bullshit. The market and SEC work tirelessly to remove noise so that the market itself can efficiently price equities, but Musk and his twitter, the irrational management of this company, etc has turned this stock into a circus. Who knows what it is worth or what a fair price is, market is still digesting the whole \"funding secure\" and SEC investigation, now this shit...", "score": 4, "replies": [{"body": "Point on your portfolio where Elon touched you", "score": 3, "replies": []}, {"body": "It kinda sounds like you are resentful to those who have done well from the stock.", "score": 11, "replies": [{"body": "There is some truth in there. The stock is highly driven by buzz which makes it unpredictable. It might be a good buy, but the technicals and fundamentals are so muddied by the buzz hype, that it's impossible to tell. ", "score": 12, "replies": [{"body": "MU would be a $300 stock if markets worked on fundamentals", "score": 4, "replies": []}, {"body": "Agreed.  Too much noise to really correctly price TSLA, hence the significant and regular swings.", "score": 2, "replies": []}, {"body": "Not really dude it's pretty clear what their sales and cash flow are going to be if you have any training in financial analysis.", "score": 5, "replies": [{"body": "Your full of shit. You think cash flows are what determine stock price? That's maybe 20% of a stocks price, and means nothing if management does not have plans to return net income to investors.\n\nReported cash flow and technical analysis is all accounting and historic, it has nothing to do with future activity which is what gives equity value\n\nEdit: it has little to do with", "score": 4, "replies": [{"body": "Ha. Tesla's business model is a comprehensive master piece of disruptive innovation. See this presentation by a Stanford professor to understand: https://youtu.be/2b3ttqYDwF0\n\nIf Tesla turns the corner on cash flow, it's basically over for tradtraditional ICE manufacturers.", "score": 0, "replies": [{"body": "All business is based on disruptive technology. Tesla is no different than any other company with a decent business model", "score": 2, "replies": [{"body": "Not all businesses are disruptive.  In fact the VAST majority of businesses are not disruptive.  Recommend you read the book \"the innovator's dilemma\" written by the guy who invented the term \"disruptive innovation\" to learn more.  Also watch the video to see why Tesla is a unique company.", "score": -1, "replies": [{"body": "Innovation is what drives companies forward. Why do you think Sears just delcared bankruptcy? Sure, tried and true models work but they won't last", "score": 1, "replies": [{"body": "Sorry we are not talking about the same thing.  Disruptive innovation is different from incremental innovation.  These words have well known definitions in a business context.  We can't discuss these concepts productively unless you learn what disruption means in a business context.  There are many videos online about the concepts of innovation and disruption.  It's worth it to learn what they mean. It will make you $ in the long run.", "score": 1, "replies": [{"body": "How are you going to tell me that the majority is Tesla's value is derived from reported and upcoming cash flow (mind you they don't pay dividends) then tell me they have a fantastic disruptive tech strategy but that doesn't feed into share price? Which one is it, where is the value to shareholders derived? \n\nLemme frame it this way, do you think coca cola is valued by the same metrics as Tesla?\n\nI have an MBA and went to school for the past 10 years for this shit. I've read everything you've already suggested.\n\nEdit: by the way, looks like Tesla \"turned the corner\" today on the ER depsite analysis predictibg a negative EPS, they managed to pull what? $2/share out of their ass? Sounds like some creative accounting to me, maybe they reported a bit less RnD this quarter pass.", "score": 1, "replies": [{"body": "You have an MBA and you're asking fucking stupid questions.  Watch the god damned video I linked you then make a risk adjusted NPV calculation based a decision tree analysis of their chances of success.  The free cash flow just lowers the risk of a low valuation dilution event at the start of Q2 '19 greatly enhancing Tesla's terminal value/share and thus their NPV calculated current valuation/share.", "score": 1, "replies": [{"body": "Tesla doesn't make money, and they sure as fuck aren't passing any income onto share holders. Not sure why your valuing a company that doesn't produce cash based on fundamentals. Sure, value a company like MO based on future cash flows if you want, discount them to present value and increase to eternity. But Tesla's value is purely speculative. Roll the dice.", "score": 1, "replies": [{"body": "It's only speculative if you choose not to understand their business model. Tesla is a growth stock that will only pay off far in the future.  I invest in growth stocks all the time. It's not surprising or confusing in any way. If Tesla executes on their development plan they will be worth a trillion dollars in 10 years. The share price today is a reflection of the risk associated with that goal.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Yep.\n\nAnd this is the quarter they demonstrate the cashflow and production at scale.", "score": 1, "replies": []}]}]}]}]}, {"body": "Don't get me wrong, I made a few bucks trading puts with the whole $420 bullshit, but the market clearly doesn't know what price Tesla should be. Its no longer an investment, just a vehicle for trading", "score": 1, "replies": []}]}]}, {"body": "I think TSLA stock is already priced for perfection. $300 a share for a company that can't turn a profit and burns through cash at a blistering rate. Unless it can produce a mass market car under 35K, it's just a niche market car with a strong brand.", "score": 1, "replies": []}, {"body": "... buying puts, and commenting this at risk of being seen as a complete idiot in 2 days time...\n", "score": 1, "replies": [{"body": "Rip you", "score": 1, "replies": [{"body": "Well, i pussied out, now I am seriously regretting that decision.", "score": 1, "replies": []}]}]}, {"body": "One thing's for sure. Given the activity on this post, Tesla is a popular talking point.\n\nLet's see what happens after the earnings call.\n\nI think I read wall street is expecing a los of 3 cents per share.", "score": 1, "replies": []}, {"body": "Shares pop 13% after hours on huge Q3 results.\n\nI am not surprised.", "score": 1, "replies": []}, {"body": "Well, not much to say here other than: glad I'm still holding, ps RIP internal combustion engine industry.", "score": 1, "replies": [{"body": "Fun reading all the Tesla shorts attacking everyone on this post.", "score": 1, "replies": [{"body": "They jelly (or angry).", "score": 1, "replies": []}]}]}, {"body": "We'll see what happens by market close but I nailed it: \"IMO, shares to pop to $300USD on Q3 results\"", "score": 1, "replies": []}, {"body": "Just sold yesterday. I hate myself", "score": 1, "replies": [{"body": "You did the right thing but got the wrong reward.", "score": 15, "replies": []}, {"body": "Elon would be ashamed of you", "score": 1, "replies": []}]}, {"body": "Short or long, it's telling to see what a reaction this post got.\n\nSee you all in about 24 hours :)\n\n<3", "score": -1, "replies": [{"body": "Hola homie ", "score": 1, "replies": [{"body": "Not surprised.", "score": 1, "replies": []}]}]}, {"body": "wishful thinking. bmw audi jaguar mercedes all are getting big time into luxury ev space and tesla can’t hold a candle to the build quality and customer service of those guys for the same price ", "score": -5, "replies": [{"body": "Disagree. Tesla’s are BEAUTIFUL cars. They will compete and will always be the EV Car. Late 20’s and early 30’s aren’t looking at the European EV’s. They’re not exciting. Tesla is exciting. Those cars may be in demand for the older generations, but the younger ones don’t care.\n\nNot to mention the sheer amount of superchargers that is rapidly expanding. Are BMW, Mercedes, and Audi going to invest in that kind of infrastructure or are they going to lease off Tesla? ", "score": 5, "replies": []}, {"body": "You mean the Audi e-Tron that was pushed back a month because of issues.   Or the I-pace that needs a 90kWh to get roughly the same range as the much bigger Model X with a 75 kWh battery.   All those cars will be built in low volumes because they don't have their own battery manufacturing.   Plus the state of charging networks for them will suck until the faster chargers come online in the next 1-2 years.  So good luck driving that I-pace (that has garbage range to begin with) on a long distance drive.   The interior will be a nice place to sit while it takes 1.5 hours to charge your car at the current fast chargers so that is a plus.      ", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": -1, "replies": []}]}
{"title": "$TSLA Daily Investor Discussion - October 23, 2018", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Q2 Earnings Official Thread](https://reddit.com/r/teslamotors/comments/93rhl3/tesla_tsla_second_quarter_2018_results_and/).\n", "id": "9qn69p", "created_utc": 1540285548.0, "score": 10, "upvote_ratio": 0.79, "num_comments": 119, "comments": [{"body": "holy shit", "score": 25, "replies": []}, {"body": "Wow, imagine if the rest of the market wasn't crashing this morning", "score": 17, "replies": [{"body": "TSLA will lead the rally!", "score": 1, "replies": []}]}, {"body": "#  2 Trading Days Until Q3 Earnings Report and Conference Call!!!", "score": 16, "replies": [{"body": "Holy moly!", "score": 5, "replies": []}]}, {"body": "I'm very surprised TSLA is holding up this well (for now) while the Nasdaq is down over 2,4% and back to the same level as May 2018.", "score": 13, "replies": [{"body": "Me too, and me three ", "score": 5, "replies": []}]}, {"body": "Just a reminder to everyone to be nice.   I've gloated in the past and it wasn't cool.  Lets keep the discussion friendly.", "score": 13, "replies": [{"body": "The best way to avoid gloating is to keep in mind that we are still down over $100 per share from the spring, and that we first saw ~%270's four years ago.  ", "score": 12, "replies": []}, {"body": "Celebrate don’t gloat.\n\n (Ain’t nothing wrong with a little bit of celebration)", "score": 6, "replies": []}]}, {"body": "Going strong into after hours. $296.41", "score": 5, "replies": []}, {"body": "[https://www.cnbc.com/2018/10/23/short-seller-who-is-suing-tesla-changes-his-mind-tesla-is-destroying-the-competition.html](https://www.cnbc.com/2018/10/23/short-seller-who-is-suing-tesla-changes-his-mind-tesla-is-destroying-the-competition.html)\n\n&#x200B;\n\nAwsome news.", "score": 8, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Recommended read, especially since they came from the short side.", "score": 1, "replies": []}, {"body": ">The other reasons the comparison with the other automakers is skewed in Citron's research, is that Left's comparing Tesla against the sedan models -- not the crossovers and SUVs. The reality is that if Tesla didn't exist, the sedan sales of those other automakers would be down anyway -- as they are cannibalized by their very own SUV sales.\n\nThoughts?", "score": -1, "replies": []}]}, {"body": "Misleading headline, but great news!! Important to be able to change one's mind :) Respect to that guy!", "score": 1, "replies": [{"body": "His fucking report also moved the market like 6%, fucking free money even if he doesn't believe a word he wrote. Analysts disgust me.", "score": 2, "replies": [{"body": "They likely covered their short position", "score": 2, "replies": [{"body": "With options you can easily make a couple hundred % with little risk if you know when a 5% gain is going to happen.", "score": 1, "replies": []}]}]}]}, {"body": "Hopefully the first of many analysts to change their tune", "score": 1, "replies": []}]}, {"body": "Like I wrote last night:\n\n> A rational short would have covered with the magnitude of the decline since Elon Musk's tweets about going private. To not do so is to defy the adage that \"Bulls make money, bears make money, pigs get slaughtered.\"\n\n", "score": 8, "replies": [{"body": "points for pithy", "score": 2, "replies": []}]}, {"body": "290?\n\n&#x200B;", "score": 4, "replies": [{"body": "probably over 300.  I think this rise confirms this stock has been heavily manipulated in an effort to cover before earnings.  I believe the larger short sellers believed they had more time.", "score": 14, "replies": [{"body": "Hot damn, you might actually be right with your crazy optimism this time.", "score": 3, "replies": []}, {"body": "Sounds right honestly, if you noticed, at the end of Friday, Monday, Today, and Tonight at 8pm Eastern there were huge jumps in volume of buying. My guess is that's larger short sellers trying to get out quick. Wonder how many shares were shorted, bet S3 knows.", "score": 1, "replies": []}]}]}, {"body": "https://electrek.co/2018/10/23/tesla-rushes-q3-earnings-near-profitable-record-quarter/\n\nElectrek really managing expectations here.", "score": 7, "replies": [{"body": "I noticed that too. I'm pretty sure everyone is expecting a profitable quarter, not a near profitable one. Fingers crossed I guess", "score": 5, "replies": [{"body": "Even Citroen  said... \"Does anyone think they moved up the earnings call because of bad news? \"", "score": 3, "replies": [{"body": "It is interesting timing for sure... but I can see wanting to avoid Halloween, post Mid-term day, and lingering at this level.  If midterms cause the market to drop, at least this way they will see a post-earnings pop (hopefully).", "score": 3, "replies": [{"body": "or a  pre-pop into priced in earnings", "score": 2, "replies": []}]}]}, {"body": "Well as long as they beat wall street expectations they should be good short term stock prices wise. Maybe?", "score": 2, "replies": [{"body": "Yup, that's true. In theory the price today includes Tesla meeting expectations, no more and no less. If they come out ahead of that then it should go up. Of course the market is rarely that rational but that's what an economist would say", "score": 1, "replies": []}]}]}]}, {"body": "First time investor here. This weekend I decided I was going to buy $6,000 of TSLA stock at $261 and hold it  long term. So I initiated a transfer from my account, but it won't be accessible until tomorrow morning. Unfortunately for me, stock rose $294 today and feeling a little discouraged to buy my first shares. Do you guys anticipate that this will keep rising, or dip back down in the next few weeks? Was just wondering if i can get someone's thoughts from someone with more experience than me.   First time getting into stocks.  Any response is appreciated! ", "score": 6, "replies": [{"body": "You gambling, or investing? Either is cool, but you approach them different.\n\n**Investing**\n\nI would not suggest making a portfolio 100% a single stock.\n\nIt’s hard to build a balanced portfolio with single stocks without a lot of capital.\n\nUse ETFs, Mutual Funds, and RIETs to get started. They can help build wide exposure, easily and cheaply.\n\nIt’s all up to you, and you need to do you’re own research. But look for cheap ETFs like VOO, VB, and VNQ to build the basis of a portfolio.\n\n\n(I’d suggest using $5,500 of that money to fund a Roth IRA, and the rest you could buy some Tesla in a brokerage account. You can buy a little TSLA in the Roth also)\n\n**Gambling** \n\nDo whatever ya want. You can even buy options if you really want to YOLO.\n\n**Bonus life lesson**\n\nAnyone who try’s to sell you variable annuity isn’t you’re friend. Always be skeptical of life insurance as a investment vehicle, most are trash. ", "score": 9, "replies": []}, {"body": "Worse yet it will likely open over 300.    However, many long term investors paid more, like say my parents who bought 150 shares around 330.  Now my personal timeframe is 10 years.  so the difference between 260 and 330 for a buy in won't matter all that much in 10 years. Good luck, stick to your instincts, and be wary of *expert* advice :P.\n\nAlso personally, I think it will go up a lot at during / after earnings and never revisit current prices.  But I've been wrong many times.", "score": 6, "replies": [{"body": "I think Tesla will probably revisit prices until they start charging for autonomous rides via the Tesla Network.  ", "score": 1, "replies": []}]}, {"body": "Assuming you can stomach the risk I think you should just buy and forget about it. This and next quarter are critical to Tesla. With the successful model 3 ramp there likely won't ever be another crazy expansion phase like it again. Which means they'll probably stabilize (relative to the past year) and hover around the profitable mark. They would go from a company reliant on raising money to a self sufficient one. The stock price will reflect this. It might not ever go below $300 again.", "score": 6, "replies": [{"body": "Glad I went all in.  Got 15 shares at 298 and 5 more when it took a slight dip at 292.  I'm happy I got my first 20 shares under 300!  Since i'm holding long I plan on getting 5 shares per month.  Still a lot to learn though.  But I am confident Tesla will grow big time in the next 5-10 years", "score": 1, "replies": []}]}, {"body": "If you are really looking for long term (10yr or so) then 260/290 doesn't matter. Buy the stock as you have capital available to invest and forget about the stock price.\n\nIf you are looking to capitalize on short term stock fluctuations, no one has the answer.", "score": 6, "replies": [{"body": "Long term is the plan.  Thank you VasiS", "score": 4, "replies": []}]}, {"body": "If you really mean you'll hold it long term, don't worry about the current price. It won't matter several years from now. Buy it if you think it has a long-term future, buy it at market price and don't watch it every day.", "score": 3, "replies": []}, {"body": "This happens all the time. So get used to it. There is always money moving around or second guessing your decisions. \n\nI recommend buying half of what you planned as soon as you can. Then you can wait to decide on the second half. If it drops you can get it. But if it keeps going up, you can use a stop limit order or just login and market buy. Like if it goes up another 10% just swallow your pride and buy the other half. \n\nThis way your risk is limited and you're still buying the stock and not stuck with cash. \n\nOf course you can still choose the wrong price points but it at least limits the risk. ", "score": 3, "replies": []}, {"body": "Honestly? Based on your questions, buy index funds. This stock is not for you.", "score": 5, "replies": [{"body": "^ this guy is being nice, even tho you may not believe it", "score": 6, "replies": []}, {"body": "This. \n\nDon’t buy this stock. It’s moved 12% based on an early earnings call. That fact says a lot. ", "score": 2, "replies": [{"body": "That.", "score": 4, "replies": []}]}]}, {"body": "If you have $6k now, put roughly half in tomorrow around lunch time eastern.  Don't look at the price, just buy 10 shares. \n\nLeave the other half in your account. If the stock goes back down to around $260, maybe buy another 10 shares... or not. If it goes up to $360 on Thursday, maybe sell some and lock in profits. Keep putting money into your brokerage account regularly-- no crime in having cash sitting there.  Buy when you see opportunities, but don't be trigger happy. \n\nYou will have losses, you will have gains. Just relax and stay involved long term with the markets.", "score": 1, "replies": []}, {"body": "Be patient and observe how it moves a few weeks before jumping in. Not being patient is only good for people with experience on the stock market. You will not lose money by waiting for the good moment to get in.\n\n I made that mistake trying to jump in as it was rising and I got my shares at 305 while I could have gotten them at 250 if I had been patient.\n\nIf you jump in during a ride up consider putting a stop-loss to secure your profits to then get more shares at a lower price.", "score": 0, "replies": []}]}, {"body": "What a wonderful way to celebrate my cake day :)", "score": 8, "replies": [{"body": "Gratz, even tho we all know pie is a superior dessert.\n\n(Cobbler is also acceptable)", "score": 2, "replies": [{"body": "Burn the heretic!", "score": 1, "replies": [{"body": "I’ll meet ya half way. Cheesecake?", "score": 4, "replies": [{"body": "Acceptable, though I stand by my \"drowning in chocolate\" sweet tooth", "score": 1, "replies": []}, {"body": "Pie cake?", "score": 1, "replies": [{"body": "And cornbread, is a really corn cake with butter icing.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I expect another one or two analysts upgrade or reiterate buy ratings on $TSLA tomorrow ... Fingers cross for $325 closing tomorrow.", "score": 3, "replies": []}, {"body": "Breaking 300 today???", "score": 5, "replies": []}, {"body": "Feels like an eternity but we're getting there. I  had an orgasm this morning.", "score": 8, "replies": []}, {"body": "Pre-call movement? Huge spike just now, closing in on 200k volume sold in premarket. ", "score": 4, "replies": [{"body": "Seems to coincide with the hacked [v9 autopilot video](https://www.youtube.com/watch?v=rACZACXgreQ). Looked mighty impressive to me at least.", "score": 3, "replies": [{"body": "I believe one criticism was that Tesla didn't do 3d bounding boxes and there they are.\n\nApparently also free cashflow is great.\n\nTesla being up when tech is down is a good sign.  ", "score": 7, "replies": [{"body": "Yeah, Nasdaq down, Tesla up is indeed a good sign. Curious to see how far it will run before Thursday.", "score": 2, "replies": []}]}, {"body": "This is amazing. I wonder what they training dataset was. ", "score": 1, "replies": []}]}, {"body": "Someone spilled his coffee over his keyboard ;)\n\nLet's see what the opening brings.", "score": 2, "replies": []}]}, {"body": "Let's get those expectations as high as possible for tomorrow. ", "score": 4, "replies": [{"body": "Based on past experiences, it does seem highly likely that if we get another run-up tomorrow, the share price will drop after earnings on Thursday. \n\n... Unless earnings defy expectations.", "score": 4, "replies": [{"body": "This is how long term longs miss out.  You've been so beaten down you think this run up is too much.  Then when it jumps to 400 post earning you get left behind.  And then it keeps going to 1000.   Please don't let that happen.  ", "score": 11, "replies": [{"body": "Definitely. I've never sold a single share. And won't.\n\nBut I do have some Nov 9 calls that I'm debating to unload before earnings. ", "score": 4, "replies": []}]}]}, {"body": "The higher this goes the more cautious I'm getting. it's hopeful times like this that the stock seems to love pulling the rug from under you.", "score": 0, "replies": [{"body": "That's good, better than the opposite.\n\nBut even if it does, does it matter?", "score": 1, "replies": []}]}]}, {"body": "Looks like a lot of tech premarkets are struggling. Be interesting to see if the earnings call announcements makes any movements.", "score": 2, "replies": [{"body": "Europe is a bloodbath at the moment with a lot of exchanges down 1 or 2%.\n\nThat money could of course flow back into US stocks but who knows 🤷‍♂️.", "score": 1, "replies": []}]}, {"body": "H-Holy", "score": 2, "replies": []}, {"body": "280.", "score": 2, "replies": [{"body": "285! I thought we'd peaked for the day already, but I guess some more people are buying in", "score": 2, "replies": [{"body": "fear of missing out", "score": 2, "replies": []}]}]}, {"body": "He call got pushed back an hour BTW.\n\nhttp://ir.tesla.com/events-and-presentations", "score": 4, "replies": [{"body": "Damn that puts me on midnight. The calls are usually around an hour right? ", "score": 2, "replies": [{"body": "1:30ish", "score": 3, "replies": []}]}]}, {"body": "Just remember that this is a volatile stock and know what your exit conditions are.  We'll likely see a lot of resistance around $310 if it gets there over the next 2 days.  Would take an amazing earnings to move past that.\n\nDepending on how things go, I may sell ITM friday expiration calls against my stock to collect that extra premium before the volatility collapse after earnings (if I do decide to sell).\n\nE: Best case setup is if the stock breaks the $295 resistance line and gets close to the $310 line tomorrow.  Those two have been the primary delimiters over the past 5 months.  If we're close to $310 before earnings and earnings are good, could break upwards to the next line at around $330.  If earnings are bad, back down to $260.\n\nE#2: My methodology for this is 1) establish a fundamental thesis for whether you are bullish/bearish on a stock 2) look at technical for entry and exit points 3) look at volatility and construct an options trade to execute against your thesis and entry/exit points (volatility high = sell volatility, low buy volatility).", "score": 2, "replies": [{"body": "What's your basis for the $310 resistance?", "score": 2, "replies": [{"body": "People throw darts I think and I guess this time it hit $310. I’m eyeing 387 all time highs if Tesla beats guidance by 20%", "score": 4, "replies": []}, {"body": "Just a read of the chart for the last 5 months.  A lot of people bought in around $310 and are underwater.  The price has repeatedly bounced off that point and those people will likely be selling to at least break even.", "score": 2, "replies": []}, {"body": "https://www.stockconsultant.com/consultnow/basicplus.cgi?symbol=TSLA\n\n**SUPPORT BELOW**\n\n-3.6% at 274.8 ± 5.22 type double, strength 4\n\n-8.9% at 259.8 ± 4.94 type double, strength 9\n\n**RESISTANCE ABOVE**\n\n+5.7% at 301.3 ± 5.73 type triple+, strength 10\n\n+8.6% at 309.6 ± 5.88 type single, strength 8\n\n+12.5% at 320.9 ± 6.1 type triple, strength 10\n\n(The only things that make these matter, is the fact that people believe in them)", "score": 0, "replies": [{"body": "Resistance points are real, they form around breakeven points for past trades.\n", "score": 1, "replies": [{"body": "They are real, I concede that, and are important.\n\n(But only because traders, believe in them)\n\n", "score": 2, "replies": [{"body": "I guess I should have written more on why, but unlike voodoo indicators like RSI/MACD etc; the belief as to the why on resistance points centers around people wanting to avoid paper losses on currently losing positions or previously winning positions.  It's not actually trading on the stock fundamentals which is why IME, they are useful for calibrating entry and exit points after the fundamental analysis is done. ", "score": 2, "replies": [{"body": "Sigh, At 22, I'm still learning what the real world is like... Figured people would be aware of their biases and able to trade more on fundamentals. Heck even institutions have this problem. I'll probably sell a stock tomorrow before earnings and hold out the rest until after earnings. \n\nStill though, good to know at least (thank you for explaining technicals and support btw). Now I know where everyone else is trying to sell in the \"smarter\" money, that leaves, well the one's who try to be \"smarter than the smart money\", and the \"I just like Tesla\" traders and the \"I made it on bitcoin, why not tesla\"....\n\nWhoever first said that it's impossible to know the ups and downs of a stock is probably right in that humans are entirely extremely unpredictable and contradictions. \n\n\\----End 1'st ramble---\n\nIn other news, it'll be pretty good news tomorrow on fundamentals, probably 2-3 bigger surprises in terms of products, factories, technologies, I expect the stock to hit $350 based on fundamentals but with short squeeze chance it could go $400+, or with short term \"longs\" cashing out, it might just be $330.\n\n&#x200B;\n\nAll this stock nonsense is a pain, maybe I should just get back out of stock investing and 100% focus on entrepreneurship....\n\n\\--end 2nd ramble---\n\n&#x200B;\n\n&#x200B;", "score": 2, "replies": [{"body": "My best advice would be to find good mentors - in my 20s I worked for one of the top 2 \"mega\" software companies and the investment clubs were very active.  You could always find people who were ex I-bankers/traders to bounce ideas off of and learn from.  The better your peer group the better you will do.", "score": 2, "replies": []}]}]}]}]}, {"body": "Every time I think i'm learning how the stock market works I read something like this and am reminded how small time I am.", "score": 1, "replies": [{"body": "These theories only work if the situation of the company and peoples opinion about it do not change too much over 6 months. With Tesla these things are all over the place on a weekly basis. Just buy the dips and be patient.", "score": 5, "replies": []}]}]}]}]}, {"body": "I just thought this article was funny to come out on Seeking Short just during this tesla bull run. [https://seekingalpha.com/article/4213514-tesla-full-self-driving-called-vaporware-prepare-harsh-consequences](https://seekingalpha.com/article/4213514-tesla-full-self-driving-called-vaporware-prepare-harsh-consequences)", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "let's not jinx it everyone :D", "score": 1, "replies": [{"body": "Deleting now from existence ", "score": 2, "replies": []}]}]}, {"body": "Deleted", "score": 1, "replies": [{"body": "do you mean tomorrow's webcast? ", "score": 2, "replies": [{"body": "Yes, lol. Got a little excited, I suppose.", "score": 1, "replies": []}]}]}, {"body": "If the stock stays flat today it's a pretty good sign that the market has already priced in any good or bad news coming tomorrow.  If that is the case we will likely continue to see this level until the end of Q4.  While technically \"not bad\", it means that the share price is sitting where we were in fall of 2014.  As a \"very long\" that hurts.", "score": 1, "replies": [{"body": "I personally think pretty much a negative EC is already priced in. If they give us a nice outlook for the future and a profitable quarter we might see the 300s again pretty quick.", "score": 8, "replies": [{"body": "I still think that 260 is unjustifiably high for anything less than perfect execution over the next ten years, so I tend to think the opposite. A small profit and positive guidance will probably boost the stock to around 280; market sentiment more generally will decide the rest.\n\nA loss and negative guidance sends TSLA past 220.", "score": 0, "replies": [{"body": "I’m just wondering what Elon will tweet before hand.\n\nHe hasn’t started bragging about a short burn yet. But at the same time seems to be in high spirits.", "score": 2, "replies": [{"body": "Based on his tweets last night, I'm afraid \"high\" is probably right :(", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": ">Powerwalls\n\n>Solar Roof\n\nThere is zero synergy between powerwalls, solar roofs, and automaking.", "score": 0, "replies": [{"body": "Are you being serious?\n\nSUN POWER>SOLAR ROOF>POWERWALL STORAGE> POWER THE HOME> CHARGE THE CAR>???\n\n&#x200B;\n\nBe happy", "score": 8, "replies": [{"body": "Synergy is a ~~weasel word~~ business term which in this context means that two things are cheaper when produced together.\n\nThere is no synergy between automaking and powerwalls and solar roofs. It does not cost you less to make one if you're making the others.", "score": -1, "replies": [{"body": "Ahahahha. Battery packs.... Jesus have you even done any research on Tesla!?", "score": 3, "replies": [{"body": "I've had the misfortune of talking with him a few times. It's best to ignore him. He's probably the most clueless person I've seen on here, even on basic things in investing in general.", "score": 2, "replies": []}, {"body": "Making powerwalls instead of cars is kind of dumb: you get a lot more money out of the car.", "score": 0, "replies": [{"body": "For now", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Synergy for consumers is not synergy for production.", "score": 1, "replies": [{"body": "Being efficient at making batteries makes Powerwall *and* car production more efficient. ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Something very very strange would have to happen for $TSLA to stay level for an entire quarter.", "score": 2, "replies": [{"body": "Musk not tweeting. ", "score": 3, "replies": [{"body": "HAH.. well..that would be a prerequisite yes", "score": 3, "replies": []}]}]}]}, {"body": "[deleted]", "score": -4, "replies": [{"body": "we've all heard this, but i think you are wrong in this case.   i'm a long term buy and hold type anyway so whatever.", "score": 7, "replies": []}]}, {"body": "[removed]", "score": -1, "replies": [{"body": "shorts!", "score": 4, "replies": []}]}, {"body": "&#x200B;", "score": -8, "replies": [{"body": "You don't say!", "score": 9, "replies": []}]}]}
