{"title": "I predict Amazon will acquire Lyft in the next 18 months.", "selftext": "Lyft is five times cheaper to acquire than Uber. It has 35% of ridesharing marketshare in America and is rapidly growing in Canada—two of Amazon's biggest market. \n\nCurrently, no major Western ridesharing platform is profitable. That's because it takes a ton of costly promotions and subsidies on both the rider and driver sides to grow a ridesharing platform. \n\nAmazon, however, could substantially reduce the high cost of new rider acquisition by just offering their over 100 million Prime members a discount for using Lyft over Uber. This would shift marketshare overnight. \n\nThen, on the driver side, Lyft drivers could be doing last mile order fulfillment for Prime Now and Amazon Restaurant when ride demand is low—effectively increasing driver wages through removing time spent waiting for a new passenger while also lowering Amazon's fulfillment costs. \n\nThe operational efficiencies that come from owning both commerce and ridesharing would allow Amazon to become the most valuable company in the world.\n\nUber and Amazon are already competing on a ton of fronts. AmazonFresh and UberEats, Uber freight and amazon prime delivery. My money is on Bezos to win though, they can shoulder the massive costs with AWS", "id": "9su0zw", "created_utc": 1540947432.0, "score": 2966, "upvote_ratio": 0.89, "num_comments": 388, "comments": [{"body": "at this rate there will be 2 social economic classes: prime members and non prime members", "score": 2587, "replies": [{"body": "The correlation is already high with high income households.  That'll just add causation to the mix.", "score": 294, "replies": [{"body": "Of course. High income households can afford to say \"make my packages appear faster\". It isn't a necessity of life, so it becomes a luxury subscription.", "score": 59, "replies": [{"body": "Make my packages appear faster and give me streaming service.  Also give me special pricing", "score": 47, "replies": [{"body": "\"Special pricing\" on things that are probably overpriced online anyways.\n\nIf it can grant savings to customers enough to justify the purchase if Prime, even lower income households will buy it.", "score": 24, "replies": [{"body": "Not sure about over pricing so far the only place I have found that amazon can’t F with in terms of price is Costco. Comparing similar items , I feel like amazon is still not economical for smaller items But convenience over cost is what matters here I guess .  \nI bought Baby proofing drawer locks - amazing product btw, the manufacturers had all this literature to have people buy it directly from them and when I checked it out it was actually more expensive to get it directly from the manufacturer vs amazon. Plus shipping wasn’t free ", "score": 11, "replies": [{"body": "Well sure, however costco is as cheap as it is because you generally buy most things in substantial quantity. \n\nIf you only have 2 or 3 people living with you in your household, you aren't really saving much money because you end up not using or waisting more product. In fact in some situations while it may feel like you are getting a deal, it can be the opposite. Especially if you buy anything perishable at Costco.", "score": 5, "replies": [{"body": "Wasting * , waisting products may result in back problems and death ", "score": 4, "replies": []}]}, {"body": "That’s because the sellers on Amazon aren’t from the manufacturer. It’s basically EBay, but with more rules and regulations. The sellers are selling legit items,but get them at a discounted price so they can undercut the originals.", "score": 1, "replies": []}]}, {"body": "True and like the Prime platform is already, if they can incorporate another service into their pricing structure, they're adding value. Even if they raise the Prime price 20$ a year but that includes x amount of free Lyft rides, most people would only use Lyft. Especially if they incorporate it into their app somehow.", "score": 7, "replies": []}, {"body": "Special pricing refers to other buisnesses.\n\nI get special prices at Whole Foods for being a prime member, saving lots of $$$ monthly by shopping there.", "score": 2, "replies": [{"body": "Excellent, so if those savings exceed the price of your Prime membership, you do it. Otherwise, you pay normal amount (but don't have to pay for Prime).", "score": 2, "replies": []}]}, {"body": "Not always. Things from name brand vendors is generally much cheaper online than in store. For example, I generally wear Carhartt double kneed pants for work. In store, unless they are on sale are $100. Just bought a pair on Amazon for $40 last week. \n\nThe same goes for a lot of name brand shoes and other things. I'd definitely say if you bargain bin shop, online shopping probably isn't right for you, however if you are looking for something specific that might be hard to find or come from expensive name brands it's pretty great.", "score": 2, "replies": [{"body": "Okay, so if any consumer needs to buy 2 of these in a year, they can be smart consumers and buy Prime, THEN buy these. The savings exceed the price of Prime.\n\nThis is a matter of consumers being smart and doing their research to save money. If Amazon stops giving sales, customers stop buying Prime, and Amazon reconsiders their deal system.\n\nBasically, consumers should know enough to conclude:\n\n* Amazon Prime is worth it and they will spend money on the service\n* Amazon Prime is NOT worth it and they will not spend money on the service", "score": 3, "replies": []}]}, {"body": "That’s the plight of lower income households.  They buy necessities.  We buy necessities and luxuries and everything in between.  ", "score": 3, "replies": [{"body": "Most low-income households, sure. Not all of them are buying necessities. ", "score": 4, "replies": []}]}]}, {"body": "They also give me some ad free viewing.", "score": 3, "replies": []}]}, {"body": "Prime is $12.99 ??", "score": 2, "replies": []}]}, {"body": "Holy shit, it's true.\n\nhttps://en.m.wikipedia.org/wiki/Amazons", "score": 66, "replies": [{"body": "Why did you link me to a bunch of Amazons?", "score": 15, "replies": [{"body": "I am so confused yet knowledgeable about Amazons now. ", "score": 10, "replies": []}]}, {"body": "**Amazons**\n\nIn Greek mythology, the Amazons (Greek: Ἀμαζόνες, Amazónes, singular Ἀμαζών, Amazōn) were a tribe of women warriors related to Scythians and Sarmatians. Apollonius Rhodius, at Argonautica, mentions that Amazons were the daughters of Ares and Harmonia (a nymph of the Akmonian Wood). They were brutal and aggressive, and their main concern in life was war.Herodotus and Strabo place them on the banks of the Thermodon, while Diodorus giving the account of Dionysius of Mitylene, who, on his part, drew on Thymoetas, states that before the Amazons of the Thermodon there were, much earlier in time, the Amazons of Libya. These Amazons started from Libya, passed through Egypt and Syria, and stopped at the Caïcus in Aeolis, near which they founded several cities.\n\n***\n\n^[ [^PM](https://www.reddit.com/message/compose?to=kittens_from_space) ^| [^Exclude ^me](https://reddit.com/message/compose?to=WikiTextBot&message=Excludeme&subject=Excludeme) ^| [^Exclude ^from ^subreddit](https://np.reddit.com/r/stocks/about/banned) ^| [^FAQ ^/ ^Information](https://np.reddit.com/r/WikiTextBot/wiki/index) ^| [^Source](https://github.com/kittenswolf/WikiTextBot)   ^]\n^Downvote ^to ^remove ^| ^v0.28", "score": 21, "replies": [{"body": "Shut up bot", "score": 37, "replies": [{"body": "He's doing his best, ok", "score": 93, "replies": [{"body": "[removed]", "score": 19, "replies": [{"body": "username checks out... (someone had to say it right..)", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "bad human", "score": 1, "replies": []}]}]}]}, {"body": "What if causation is already in the mix", "score": 3, "replies": []}]}, {"body": "Jeff Bezos should be named Optimus Prime, our fearless leader ", "score": 34, "replies": [{"body": "[I think you mean Amazon Prime](https://i.redd.it/ct8bw8eti7ux.jpg)\n", "score": 39, "replies": []}]}, {"body": "this is the coolest shit i’ve read in a while \n\nreminds me of this: \nhttps://youtu.be/_1NaR4jr-8k", "score": 10, "replies": []}, {"body": "Sounds like buy n large. Disney might predict our future and Amazon is the head of it all.", "score": 7, "replies": []}, {"body": "Sounds like subscribing to a premium account on real life.", "score": 4, "replies": []}, {"body": "Lyft riders and Lyft drivers. And at the top sits Bezos - the Lyft Drider", "score": 7, "replies": []}, {"body": "/r/writingprompts", "score": 2, "replies": []}, {"body": "I just keep making new accounts for the free trials", "score": 1, "replies": []}, {"body": "You joke but I honestly feel like Amazon is trying to take over the world and I'm kind of here for it... As a prime member ", "score": 1, "replies": [{"body": "Careful what you wish for. Concentration of power doesn’t usually work out so well.", "score": 2, "replies": []}]}]}, {"body": "lmfao nice job copying parth detroja from linkedin... won't let me link the post cuz of some domain bs but ya lol ", "score": 133, "replies": []}, {"body": "Sounds logical.  Now go and convince Bezos.", "score": 515, "replies": [{"body": "[deleted]", "score": 366, "replies": [{"body": "In fact Mr. Bezos, your space program would be useless until you give VanguardDeezNuts a free ride (and back) into space!", "score": 58, "replies": []}]}, {"body": "FWD: jeff@amazon.com", "score": 125, "replies": [{"body": "Someone reads those emails, although it's not Bezos for sure. I work at Amazon and my team had to make a change based on one of those emails", "score": 53, "replies": [{"body": "He’s said that he does read it every morning. Probably can’t read a lot though.", "score": 24, "replies": [{"body": "Lmao what’s he gonna say, that he doesn’t read it?", "score": 49, "replies": [{"body": "I mean judging from what I’ve read and seen about him, I wouldn’t be surprised. The dude has literally built his business centered around “what does my customer want and how can I make their happiness the priority”", "score": 22, "replies": [{"body": "You misspelled “how can I extract every possible ounce of value from my employees while paying them as little as possible and without any concern for their physical or mental wellbeing”", "score": 26, "replies": [{"body": "Turns out that’s what the customer wants after all! ", "score": 35, "replies": []}, {"body": "Dat free 2 day shipping though.", "score": 8, "replies": []}, {"body": "Then don’t work there?     They aren’t some company with a heritage in an area.    There are other places to work ", "score": 1, "replies": [{"body": "I don’t work there. But someone has to if you want to keep getting your packages in 2 days.", "score": 1, "replies": [{"body": "No has to.    If Beto can’t find help because of his employee treatment and it fails then that’s his fault.    There is no mandate that we must have Amazon", "score": 1, "replies": [{"body": "In an ideal Econ 101 world yes. In reality most people working for $15 an hour in a warehouse do not have the ability to simply pick up and quit their jobs.", "score": 1, "replies": [{"body": "They had job before Amazon.     Did the company go bankrupt?    Are there other companies hiring?    \n\nWhere I live there are $15/hour jobs all day everyday.    \n\nBut it’s easier to blame a company that hasn’t been around that long (with a big foot print) for problems.    \n\n", "score": 1, "replies": []}]}]}]}]}, {"body": "There's a bajillion other MBA hacks out there doing the same thing and they're not worth $100+ billion. Clearly he doing something better.", "score": 1, "replies": []}]}]}, {"body": "and then again, who has the balls?", "score": 5, "replies": [{"body": "Would be fucking hilarious. “Nah I don’t read them shits lmao”", "score": 1, "replies": []}]}]}, {"body": "He has a team of secretaries who spends all day reading all of it and forwards the worthwhile ones to Bezos, or the responsible person/team.", "score": 1, "replies": []}]}, {"body": "Someone does read them. I had a HUGE order / shipping fuck up (somehow USPS lost a 80lb, 4 foot long package TWICE, for weeks)  and I was livid that I had two different amazon reps blatantly lie to me about what was going on so I emailed the Bezo account with the chat transcripts and within a day, an Amazon executive contacted me and got all issues resolved in one email.  Refunded my money, personally called and reamed the local USPS that \"lost\" the packages, told me they would be delivering both \"lost\" packages that day, and said they are both free, do what you want with the second.  They also changed my account behind the scenes so that almost none of my deliveries use USPS anymore.   ", "score": 17, "replies": [{"body": "Yeah, I’ve read he just forwards emails like that to one of his executives with nothing more than a “?” and they know it means they are supposed to resolve that issue fast as fucking possible.  ", "score": 9, "replies": [{"body": "?\n\n*turns on the egg timer*\n\n*hovers hand over \"fire employee\" button*", "score": 6, "replies": []}, {"body": "\"?\" Bezo is a gangster, I'm gonna be like him , everytime my mom messes up my breakfast I'll text her \"?\"", "score": 3, "replies": []}]}, {"body": "I called Amazon once to ask if I could request them to neber use Purolator to ship packages to me for various reasons. I was told it was impossible. Bastards. ", "score": 1, "replies": []}]}]}]}, {"body": "What are you, crazos?", "score": 1, "replies": []}]}, {"body": "Please give credit where credit is due, you copied this from Parth Detroja, the prominent Author and Product Manger at Facebook from his  LinkedIn post, which he posted just yesterday. ", "score": 719, "replies": [{"body": "I was looking for this comment ! I saw the LinkedIn post yesterday and so when I this I thought I might’ve stumbled upon his reddit account. Then I saw the post history and I was like “definitely not”.  C’mon man, give credit where it’s due", "score": 139, "replies": []}, {"body": "Give credit. Don’t be a karma whore.", "score": 54, "replies": []}, {"body": "But muh karma!", "score": 14, "replies": []}, {"body": "Amazon cannot do what OP said legally. ", "score": -10, "replies": [{"body": "How so? ", "score": 19, "replies": [{"body": "I'm not saying it isn't possible but one flawed part of the idea is \n>Then, on the driver side, Lyft drivers could be doing last mile order fulfillment for Prime Now and Amazon Restaurant when ride demand is low—effectively increasing driver wages through removing time spent waiting for a new passenger while also lowering Amazon's fulfillment costs.\n\nIt is no longer ride share if the intention of the driver is not fully committed to giving rides to people. Once you start packing on other responsibilities the driver is required by law to be given a minimum amount. This would mean that drivers would have to be paid back for the wear and tear on the car. The reason why ride shares do not have to do that now is because the purpose of ride share isn't to be a taxi service at all times but for someone to give another person a ride while already en-route to a destination. logistically it is not possible to incorporate both these into one. there is no way to insure that drivers wont be to busy to deliver packages and the costs associated for doing this would drastically rise.", "score": 2, "replies": [{"body": "I don't think op is implying that Amazon would force them to also deliver packages. He is just saying that Amazon would have a database of people that have already been vetted as drivers that could also if they chose deliver packages.", "score": 6, "replies": [{"body": "Doing last mile order fulfillment while demand is low. Meaning they would be doing Lyft and delivering packages at the same time.", "score": -2, "replies": [{"body": "How is that illegal.", "score": 0, "replies": [{"body": "I never said illegal. I said it was flawed. Lol", "score": 0, "replies": [{"body": "Why is it flawed?", "score": 0, "replies": [{"body": "not logistical. inherently inefficient ", "score": -4, "replies": [{"body": "what", "score": 1, "replies": [{"body": "My bad I thought you said what? If you want to know why read my original post or my other comments ", "score": 1, "replies": [{"body": "Uber already does this with the \"packages\" being food parcels via Uber eats. How would this be different?", "score": 1, "replies": [{"body": "because an employee delivering food is still considered a tipped employee and allows companies that deliver food (uber, dominoes, pizza hut) to pay those employees less than the minimum because theyre expected to get tips. Where as delivering packages isn't expected to generate tips. So, amazon would have to pay them a higher amount.", "score": 1, "replies": [{"body": "Do amazon flex employees already benefit from this?\n\nAlso, the drivers aren't employees, they're all contractors. Doesn't that nullify minimum wage requirements?", "score": 1, "replies": [{"body": "When you say benefit from this, do you mean do flex employees benefit from higher pay compared to food deliverers? I would say yes, because amazon Flex employees make anywhere between 18-25 an hour. Uber eats employees can expect to make anywhere between 8-12 plus tips. So, ubereats drivers could make equivalent to amazon flex employees. but, the consumer is paying part of the wage in tips instead of uber paying it all out of their revenue. \n\nBeing a contractor doesn't eliminate the employees entitlement to minimum wage. All it does instead is eliminate the employers responsibility of withholding SS, taxes, and medicare. ", "score": 2, "replies": [{"body": "Does this apply when the contractor is responsible for finding work for themself?", "score": 1, "replies": [{"body": "the pay that the employer is offering must be equal to or greater than a minimum rate. If a contractor goes to the employer and undercuts that minimum rate in order to ensure they get the work, then it is the contractor who voluntarily requested less then the minimum. ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "what", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Ups drivers are paid fantastically, and by some estimates can be wealthier then doctors when saved correctly. Paying someone 50 cents a mile and some wage probably would be cheaper then a ups wage. ", "score": -1, "replies": [{"body": "But, a Toyota corolla isn't going to have trunk space that a ups truck does. and You're probably right that it could be cheaper than UPS but then that means that lyft needs to more profitable in order to cover all the additional expenses. This would mean they would have a tough time offering the discount with the additional expenses. or they would have to raise their rates to cover their costs which means that to non Prime members, Uber is the cheaper option. ", "score": 0, "replies": [{"body": "Amazon already has delivery drivers in cities. This would allow them to have additional potential drivers similar to how uber has drivers delivering food.  It's not a far fetched idea and the synergies they'd gain would be massive. ", "score": -1, "replies": [{"body": "I'm not saying it isn't possible. My point to my original post was that if they start having ride share drivers take on additional responsibilities amazon would lose out on the low cost that they would be paying them. \n\nFor example:\n\na Driver does 5 rides for a total of 50 miles at 1.35 a mile to the rider.\n\nThat means the driver takes in the remaining of rider charges - (service fee) - (platform fee which isn't constant and have been anywhere up to 50% of the total bill) \n\n67.50-(5 x 2)-lets assume 15=42.5\n\nAt an assumed average speed of 25 MPH for 50 Miles that means total drive time was 2 hours and doesn't include waiting time. Which means that in this situation the driver takes in 21 an hour. \n\nAAA says with 15,000 miles in a year, a driver could expect to spend 9,122 in maintenance cost and this does not include depreciation. NYC cab drivers can put on an average of 70,000 miles a year. so, we will meet in the middle and assume 42,000 miles for our driver which would mean about 25,500 in vehicle maintenance cost. which comes down to 11.38 dollars an hour with an assumed 40 hour work week. which means the driver is netting 10 dollars an hour. Which means in most larger cities the driver isn't making minimum wage. But lyft drivers can get tips so it is justified. and remember vehicle depreciation cost and waiting time isn't calculated within our example meaning the driver is making less than 10/hour. \n\nNow, if the driver is required to make deliveries while driving they are no longer a tipped employee meaning they would have to be paid minimum wage. this would include driving to and from the distribution center and any time required to get the job done. In order to do so they would have to raise their fair from 1.35/mile to 2/mile. this does not include excess driving or time on the clock. this is just the raise in fair to reach NYC minimum wage. So, by having drivers deliver packages they raise their costs and would have to raise their prices. \n", "score": 0, "replies": [{"body": "25.0 mph ≈ 40.2 km/h ^(1 mph ≈ 1.61km/h)\n\n\n\n^(I'm a bot. Downvote to remove.) \n\n_____\n\n  ^| ^[Info](https://www.reddit.com/user/Bot_Metric/comments/8lt7af/i_am_a_bot/) ^| ^[PM](https://www.reddit.com/message/compose?to=Ttime5) ^| ^[Stats](http://botmetric.pythonanywhere.com) ^| ^[Opt-out](https://www.reddit.com/message/compose?to=Bot_Metric&subject=Don't%20reply%20to%20me&message=If%20you%20send%20this%20message,%20I%20will%20no%20longer%20reply%20to%20your%20comments%20and%20posts.) ^| ^[v.4.4.6](https://www.reddit.com/user/Bot_Metric/comments/8o9vgz/updates/) ^|", "score": 1, "replies": []}, {"body": "Uber literally is already doing this just fine.", "score": 0, "replies": [{"body": "yeah and Uber lost 891 million in the second Q of 2018. lol\n\nNot to mention uber is delivering food which allows the driver to still be a tipped employee. Amazon is delivering packages which wont generate tips.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I can’t say for sure cus law is quiet complex but I’d say this is in the grey zone. \n\nIn general, you cannot sell things at a loss to force your competition out of the market. \n\nIf this was allowed loads of companies would have done it and the last one standing would be the one with the most cash reserves. ", "score": -11, "replies": [{"body": "What? Amazon operated at a huge loss for a long time... they certainly weren’t making money when prime was cheaper and they’d ship you anything 2 day no matter how inexpensive or annoying it was to ship. ", "score": 7, "replies": [{"body": "https://qz.com/1196256/it-took-amazon-amzn-14-years-to-make-as-much-net-profit-as-it-did-in-the-fourth-quarter-of-2017/\n\nSpeaks for itself. \n\nAnyway, investing in growth is not the same as undercutting competition with clearly obvious predatory pricing. ", "score": -2, "replies": [{"body": "Amazon was intentionally undercutting everyone? Their entire business model was to operate at super low margins in order to have everybody consider them THE place to buy things online. Then once people don’t even consider buying certain items elsewhere, they can slowly raise the prices (which they have). ", "score": 0, "replies": [{"body": "Operating at low margins is not the same as operating at loss... \n\nOperating at loss is illegal if intentional to push competition out of the market, operating at low margins isn't. ", "score": 0, "replies": []}]}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "There are clear laws that govern competition, but even then some law suits that you’d think the defendant would be guilty ends up being cleared. \n\nLaw isn’t black and white. Just go to legal advice subreddit and see how different people approach posts from different angles. \n\nIf it was black and white in today’s world, we wouldn’t really need lawyers. \n\nYou can simply google for yourself and you’d come upon predatory pricing which is what I interpret is suggested above. \n\nAka illegal. \n\nThat’s my interpretation and it’s open to discussion, where you say why it’s not predatory rather than tell me I’m talking out of my ass. ", "score": -3, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Yeah it is hard to prove it which is why I said it’s illegal but complex. \n\nI don’t care about other cases. \n\nI’m talking about this one. This one has it written over it.", "score": -2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "That’s not the definition of predatory pricing... \n\nSimply having a lower price isn’t predatory pricing. \n\nCutting your prices by 50% where you are just losing money where it is unsustainable in the long run is what’s illegal. ", "score": -1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "1. Buy one, get one free\" or \"two for the price of one\" is a common form of sales promotion. Economist Alex Tabarrok has argued that the success of this promotion lies in the fact that the price actually takes into account the fact that two items are being sold. The price of \"one\" is somewhat nominal and is typically raised when used as part of a buy one get one free deal. Whilst the cost per item is proportionately cheaper than if bought on its own, it is not actually half price. - Wikipedia \n2. It doesn’t have to be 50%. The point was to cut price at a reasonable rate so that you are actively losing money per ride, let’s say 5 dollars. Instead of making 2. \n\n3. You use predatory pricing to establish a monopoly, just like you said and not have a monopoly and then do it. \n\nFYI, doing it when you have a monopoly makes no sense cus you got no competitors 😂 so alright. So much for “ be a monopoly “. The entire point is to bankrupt competitors 😂\n\n4. Yeah that’s not what I am saying. \n\nI am saying that if amazon buys lyft, if it cuts the prices so much that lyft alone operates constantly at loss, it could constitute under predatory pricing. \n\nWhether it can be proved or not, that’s difficult. \n\nThat’s just my two cents. ", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Okay.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Lol you're full of shit. Amazon sells many products at a loss to earn customers. Customers they lose $5 on a book to in return will buy larger items once they realize how great Amazon is. ", "score": 1, "replies": [{"body": "Ok", "score": 0, "replies": []}]}, {"body": "Moviepass. ", "score": 0, "replies": [{"body": "And it’s bankrupt. If they were successful they’d have had law suits. \n\nAnyway, in that case it seems more like a flawed attempt at a bad business model rather than what I stated above. ", "score": -1, "replies": [{"body": "I didn’t say it was a good idea, but it’s certainly not illegal. Most venture capital companies operate at a loss in the beginning. \n\nUber and Lyft are literally burning money into the ether to see who runs out of funding first. Taxis can’t do anything but lobby to get them banned, yet we see how well that’s going. \n\nYou are saying that operating at a loss is legally grey, yet Costco is still around and so is Amazon. I don’t see Walmart suing either of them. ", "score": 1, "replies": [{"body": "That’s what hyper growth is about!! \n\nYou need to burn cash to grow super fast so you gain massive market share. They are burning cash because they are expanding and not because they have an unsustainable business model. \n\nIt’s different than a reduction in price facilitated by successful innovation, systems or strategies. \n\nOperating at a loss is not illegal if it’s a result of activities that are aimed at creating more ROI in the future or expansion. \n\nOperating a loss just to pressure your competitors, forcing them to do the same and aiming to bankrupt them like that is illegal and in bad faith. ", "score": 1, "replies": [{"body": "So. Address Costco and Amazon. Neither are venture capital level companies anymore. Both have a quite large market share. \n\nWhat are you even talking about anymore, Amazon purchasing Lyft? You claim that Amazon buying Lyft and running at a loss to out run competition would be semi illegal. But you have not offered why Amazon hasn’t been sued already. For doing the exact same thing.\n\nYou state: in general you can’t sell at a loss to force competition out of business. Yet you have not refuted any of the examples I’ve provided. Something can’t happen “in general” yet actually only happen in the minority of cases. \n\nWhen has this happened? Can you give examples of someone being successfully sued for selling at a loss to get rid of competitors and this happening often?", "score": 0, "replies": [{"body": "What do you mean by address amazon and Costco?\n\nAdress what? They can discount the price for prime members, just not so much that they are making a loss on every ride.\n\nWhy amazon has not been sued for what?\n\nYou gave no examples of selling at loss to force competition out of business. You said venture capitalist firms operate at loss, but it is because they are spending all their resources on aggressive expansion, and not because their business model is meant to operate at loss.\n\n&#x200B;", "score": 0, "replies": [{"body": "It literally took five minutes: https://www.investopedia.com/articles/investing/070715/costcos-business-model-smarter-you-think.asp\n\nCostco sells certain items at a loss to attract customers to buy other items, but a large percentage of their profit comes from membership-not product.\n\nI have literally no idea what you’re claiming anymore. You have been arguing with 5 or so people about this nonsense and I don’t think they know what you’re saying either. \n\nAmazon literally runs some operations at a loss to undercut competitors. This isn’t a secret. Why hasn’t Walmart sued them yet if this is illegal? You claim this practice is illegal. Why is Amazon different? Literally anyone can claim “hypergrowth.”\n\nDo you have examples for what you’re talking about because I really don’t understand what you’re saying. Give an American company in the past ten years that has been sued successfully for the practices you claim are illegal. \n\nMoviepass was founded on this metric, fyi. They were still a legitimate company although a joke in terms of investment. Their entire model depended upon losing money to sell data and make regal and amc reliant on them. It didn’t work. But this is literally what Amazon does. They subsidize their losing products heavily with the ones that make profit to eventually drive competitors out of business. \n\nAre you trolling? It feels like you’re trolling because none of this seems to be in good faith. ", "score": 1, "replies": [{"body": "What operations does amazon run on loss to undercut competitors? To subsidize their losing products heavily with the ones that make profit? \n\nWhich ones are subsidized? \n\nAlso, stop being so aggressive when trying to understand a different perspective. \n\nIf you wanna claim I’m a troll then it’s just a waste of time continuing this. \n\n", "score": 0, "replies": [{"body": "Lol ok, I’m being aggressive trying to understand whatever you’re going on about. Have fun in whatever world you’re living in. I don’t think it’s reality. ", "score": 1, "replies": [{"body": "Alright. ", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "That’s typically only in the case of a monopoly.", "score": 0, "replies": [{"body": "That’s anti trust law which is different than competition law. \n\nWhat is suggested above is called predatory pricing. ", "score": -1, "replies": [{"body": "Anti trust law and competition law are the same thing. Predatory pricing is not illegal unless the company is abusing their market position, which is typically determined if the company has a monopoly.", "score": 0, "replies": [{"body": "They aren’t the same. \n\nThey aim to create a fair competitive environment but they are different. \n", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Yes, they can. They literally did the same when they acquired Whole Foods and set up discounts for Prime members.", "score": 1, "replies": []}]}]}, {"body": "Thumbs down for saying its your idea when you copied it from  Parth Detroja. Not cool dude.", "score": 26, "replies": [{"body": "I keep reading his name as a sith lord Darth Petroja", "score": 6, "replies": []}]}, {"body": "But there's no moat around ride sharing.  Why wouldn't they just create their own?  It would cost almost nothing.  They already have a bunch of drivers.", "score": 206, "replies": [{"body": "I could be wrong but it could be cheaper to purchase for the Lyft app’s IP and established user base instead of needing to build from scratch. Also get an already established name, not to say that Amazon isn’t a name but Lyft by Amazon would to me at least make more sense. ", "score": 210, "replies": [{"body": "I have to think building an app is less than Lyft’s 2.5 billion valuation.  ", "score": 43, "replies": [{"body": "15*", "score": 20, "replies": [{"body": "Even more reason to make your own!", "score": 14, "replies": []}]}, {"body": "It's also about time. The clock is ticking on self-driving tech and by the time Amazon could get a service popular they'd already be crushed. The valuation cost of Lyft includes the time spent building the market. A turn-key operation is inherently more valuable than a duplicate built from scratch.", "score": 17, "replies": [{"body": "I don't know why Lyft and Uber want to be in the business of owning and maintaining cars, nor do I understand why people just accept the premise that a bunch of cities around the world are just going to allow a constant swarm of autonomous traffic through their streets at all times.", "score": 6, "replies": [{"body": "Because it's a business worth untold billions of dollars. And it will only get less messy and more profitable with self-driving. \n\nI imagine the adoption of self-driving will go much the same way the legalization of marijuana is going. There will be holdouts until the benefits are seen and then it will pretty quickly sweep. Add to that there's no moral objection as there is with weed and there are stronger corporate interests promoting it as opposed to the mostly grassroots weed movement. \n\nIn 100 years the difference between cities/infrastructure built pre and post self driving will look as different as Houston and Paris. ", "score": 6, "replies": [{"body": "Ok, so there are 60,000 black cars in NYC, 46,000 of which are connected to Uber. Lets just say that Uber thinks that they can lower the amount of cars needed to cover NYC to 30,000 as they're autonomous and can work all hours or better coordinate shifts.\n\nI'm going to make a few assumptions but let's say that autonomous cars make it to the market and they cost $50k per vehicle. So just in vehicle purchase costs, not accounting taxes and registration, Uber is looking at 1.5 billion dollars in costs just to cover one city. An average sedan driving 15k miles per year costs 60.8¢/mile to maintain. These costs are going to be more for an Uber autonomous car because it's going to be used more in stop and go traffic, but lets take this value anyway, and the cost to run each vehicle per year is $9,122/yr, or $273,660,000/yr to run for the entire NY fleet. Add in additional costs like needing to have a place to store and service these cars in dense cities, a staff to maintain these cars and take them in for registration and other such tasks, and I can't for the life of me figure out why _anyone_ thinks that Uber and Lyft should be owning these cars.\n\nIf anything, Uber and Lyft should work just as though do now, but be able to delegate tasks to autonomous cars that _other people own_ dynamically.\n\n**EDIT**\n\nI should also add that the $1.5billion cost isn't a one time thing either, but a rolling cost, as inevitably cars are going to get into accidents, get prematurely worn, and eventually just get old. With some of Uber's product offerings, like Uber Black, it would be unacceptable for those cars to be older than five or six years old, and as a result those cars are going to be turned over more often. If we presume that Uber's plan of killing car ownership becomes a thing, well then good luck trying to recoup those sales by selling the fleet vehicles as used, let alone the entire operational concern of trying to sell those used vehicles in the first place.", "score": 3, "replies": [{"body": "Oh I was not at all assuming that Uber would own their own fleet, or at least not as their main operations. I must have misread your post before. I fully expect the vast majority of cars being used to be privately owned and rented to Uber. Whether that be private individuals renting their cars out while they work and sleep, large taxi-like companies that own a private fleet, or likely a mix of the two. Just like now, Uber will rely on 'contractors'. Turns out that their bullshit line about just being a tech platform might actually come true one day.\n\nEdit: more to the point of how transformative the tech will be. NYC has 60k black cars and 13k medallion cabs. If we are talking private rentals while people work or sleep I could easily see the number of \"fleet cars\" going down to around 10k in time. That's a loss of 63k from the streets of NYC. It will be fucking revolutionary. ", "score": 3, "replies": []}, {"body": "Having other people front the cost of buying a vehicle and putting it on Uber's network would just be a less efficient method than taking the same people's investment through the public market.", "score": 1, "replies": [{"body": "Uber's current business model is other people fronting the costs of owning and operating the vehicles. Uber doesn't have to pay for gas that's consumed just waiting for a hail to show up, or having to replace shocks because driving on potholes all day messed up the suspension. Why would you give all that up to take on the burdens of car ownership on a worldwide fleet?", "score": 1, "replies": [{"body": "Because the person already owns the car and uses it personally. Once driverless cars are out there won't be an exciting user base", "score": 1, "replies": [{"body": "Assuming this plays out, why would anyone invest in Uber then? If the prevailing narrative for the company is that one day in the next decade or two, Uber will be forced from it's current business model of payment processor and match maker where it's major costs are advertising and keeping the app working to needing to do all that while also needing to create and maintain the world's largest fleet of privately owned vehicles, turning the company into a high tech, low margins business akin to Hertz for cabs.", "score": 1, "replies": []}]}]}]}, {"body": "More autonomous vehicles would mean fewer human driven vehicles and therefore less traffic. The stop and go would cease to exist with proper planning. Vehicle would be smaller as well. Currently most vehicles seat 4 or more people but %90 of the time only transport one or two people. So two passenger pods would also take up less room on the roads. \nLess private ownership would require less parking and therefore parking garage could be converted to recharging and maintenance stations. \nThere is a book called Autonomous that goes into well thought theory about the future of autonomous vehicles. The author has been involved in robotics and the future of transportation for a long time. ", "score": 1, "replies": []}, {"body": "A company buying 500,000+ cars doesn't bother with the cars, they'll buy out the entire company.\n\nAlso fleet car maintenance is far far less than individual ownership. ", "score": 1, "replies": [{"body": "How about buying hundreds of millions?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "The cost isn't building the app, **it's customer acquisition**. Lyft and Uber already run promotions and advertising constantly in order to maintain marketshare. Amazon would be purchasing both the app, its drivers, and its user.", "score": 7, "replies": [{"body": "There are 100,000,000 Prime members.  I’ll guess Amazon already has more drivers than Lyft.", "score": 3, "replies": [{"body": "I'm quite aware how many prime members there are; I am one. But why would I download and install a third ride-sharing app when I already have Uber and Lyft? I'd have to go to the app store, download it, learn to use the app, input a CC, and 'Amazon Rides' might not go everywhere I want to go because Uber/Lyft have already worked out exclusive deals with venues, and rides might be more expensive because 'Amazon Rides' doesn't have enough drivers to handle both passengers and packages, etc, etc. \n\nIt took Uber and Lyft multiple years to acquire their customers; adding a ridesharing service into Prime doesn't guarantee customers. I can order food through Prime, but UberEats and Grubhub are still the leaders in that market.\n\n**Amazon was built on making processes as frictionlessas possible. From the customer's perspective, Amazon acquiring Lyft presents much less friction that building 'Amazon Rides' from scratch.**\n\nReal life examples: Amazon didn't build a grocer, they acquire Whole Foods. Amazon didn't build a gaming streaming platform, they acquired Twitch.", "score": 5, "replies": [{"body": "It's Amazon, when bezo says you jump, you say how high ", "score": 1, "replies": []}]}]}]}, {"body": "That’s not that much for amazon. the time to build it up can be costly in opportunity costs and also time list to make it popular. Furthermore, if you’re going to promote amazon prime with ride sharing benefits, selling “Lyft for prime members” is much better than selling “amazons Fire taxi for prime members”", "score": 2, "replies": []}, {"body": "People can be convinced to move to Uber 2. Another one? Not so much.", "score": 1, "replies": []}, {"body": "It's not just the app, it's the infrastructure and immediate market penetration that Lyft already has", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 26, "replies": [{"body": "Of course you plan to do both. Plus, buying lyft gets rid of the competition. ", "score": 15, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "[deleted]", "score": 7, "replies": []}, {"body": "Amazon can.t just push lyft away same as coca-cola can.t push away pepsi :)", "score": 2, "replies": []}]}]}]}, {"body": "What IP!", "score": 8, "replies": [{"body": "Honestly I’m not sure. I just assumed some of it exists. Though I did think that GM recently invested into them as stated below by somebody else and I thought it had to deal with driverless tech. Now imagine Lyft not as a ridesharing app but as a driverless technology company that Amazon acquires for its logistics company. ", "score": 3, "replies": []}, {"body": "Brand recog.", "score": 2, "replies": [{"body": "Pink Mustaches", "score": 1, "replies": []}]}]}, {"body": "I think amazon could develop their own app easily. Amazon could easily establish their own ride sharing brand. They would just need a marketing blitz for a few months, but they get a lot of publicity just for being Amazon introducing something.", "score": 6, "replies": []}, {"body": "Bold hypothesis, however I'm not so sure Amazon is in any rush to acquire a business with an estimated profit margin of (40%) that's very optimistically projected to break even in 2020. (Source: https://www.google.com/amp/s/techcrunch.com/2017/11/14/unpacking-lyfts-projected-financials/amp/).  \n\nAlthough truth be told, if Amazon is trying to transform prime into the Costco membership, a Lyft like service is interesting. But then again, why not shoot for something easier, more profitable, and synergistic like leisure travel, e.g. Expedia or Trip Advisor?\n\nAnd then there's, the current valuation of Lyft which is around $15B, which is a lot to pay, especially given the fact that Amazon already has implemented Uber/Lyft for packages (Amazon Flex). Go on YouTube, look for tutorials on Flex, it's got mapping, route optimizing, scheduling, etc... How hard would it be for Amazon to do the easy stuff; high margin scheduled rides business (eg travel to the airport or transit center) and tack that on to their drivers schedule? ", "score": 13, "replies": [{"body": "That's a good point. Amazon Travel offering flights, hotels, car rentals makes a lot more sense and a lot less infrastructure requirements than something like Lyft. \n\nMy guess for Flex and turning that into a ride sharing app as well would be that John Smith wouldn't exactly want to sit in the backseat with a bunch of packages on his way to the airport, but you make an excellent point. I think they actually featured Amazon Flex on 60 Minutes and it was extremely cut throat for people but did also do it along with Uber to make some money. ", "score": 3, "replies": []}, {"body": "**Direct link**: https://techcrunch.com/2017/11/14/unpacking-lyfts-projected-financials/\n\n---\n^^I'm&#32;a&#32;bot&#32;-&#32;[Why?](https://np.reddit.com/user/amp-is-watching-you/comments/970p7j/why_did_i_build_this_bot/)&#32;-&#32;[Ignore&#32;me](https://np.reddit.com/message/compose/?to=amp-is-watching-you&subject=ignore&message=If%20you%20click%20%27send%27%20below%2C%20the%20following%20action%20will%20be%20taken%3A%0A%0A%2A%20The%20bot%20will%20ignore%20you%0A%0AYou%20will%20receive%20a%20confirmation%20in%20reply.)&#32;-&#32;[Source&#32;code](https://github.com/bvanrijn/aiwy)", "score": 3, "replies": []}, {"body": "This is the best defense I've seen of Amazon starting from scratch thus far, although I still feel like they would be fine just buying Lyft", "score": 1, "replies": []}, {"body": "Totally agree. Lyft valuation is nuts. All you're buying is customer loyalty, which you have with Amazon name. ", "score": 1, "replies": [{"body": "That is not true at all. Building a ride sharing company is a long slog of partnering with localities, regulatory compliance in citiies and states, etc. There is a lot of overlap but there is substantial difference too, you can't just \"nail on\" ride-share to package delivery.", "score": 3, "replies": []}]}]}, {"body": "\"Hey Yo, get 2 months free of Amazon Prime when you sign up for our new ride share service that is here to revolutionize how you MOVE and GROOVE around your city!\" \n\nBoom, instant 3 million subscribers. ", "score": 3, "replies": []}, {"body": "Amazon uses open-source 'MapBox' for their Flex program. No reason to pay billions for Lyft's IP when they can just build on top of a good open source solution. Pretty sure they also own Nokia's mapping software from when Nokia was huge in the early 2000s (which I'd assume they got for pennies on the dollar).", "score": 3, "replies": []}, {"body": "I doubt it. It's not that Uber and Lyft are trivial apps, there's a lot of work that one would need to do about ride pairing, there's all sorts of conditional regulatory cases to account for, there's a lot of on the ground recruiting to do, especially in cities like New York where you have to get TLC licensed drivers specifically, etc, but Lyft's last valuation was $15.1 billion, and they're planning on going public presumably with a higher valuation.\n\nAmazon already has all the technological infrastructure they need to make their own ride sharing app. They have a mechanism, through prime, to entice customers to their service. They likely already have some sort of paring algo that they use for their food delivery service that I'm sure could extend to ridesharing if they wanted to. They don't really need Lyft to enter ridesharing.", "score": 3, "replies": []}]}, {"body": "This. Amazon Ride would be crush Lyft overnight ", "score": 25, "replies": [{"body": "Prime riders get a 10% discount", "score": 16, "replies": [{"body": "$10 credit every month", "score": 17, "replies": [{"body": "“Spend $100 on prime, get $10 on primeride” RIP uber and Lyft. ", "score": 21, "replies": []}, {"body": "That seems more likely", "score": 14, "replies": []}]}]}]}, {"body": "Same reason why they bought Zappos and Living Social. They could easily spin up their own, but they’re buying an established customer base and most of all a brand", "score": 14, "replies": [{"body": "The difference is Uber/Lyft have practically 0 brand value and customer loyalty. Most people use both and will use whatever is quicker, the drivers are usually the same people even--their brand isn't much of anything. The app is what they have to offer and not much else really", "score": 8, "replies": [{"body": "I actually work in the industry and have interacted with thousands of riders and drivers as part of my job. You would be surprised how people forgo their own best interest in favor of brand.", "score": 8, "replies": []}, {"body": "Lots of people I know no longer use Uber because of all the bad PR. So there is brand loyalty out there. ", "score": 7, "replies": []}, {"body": "And there are also Zappos and Living social competitors which I’m sure take a slice out of the same consumer pie. \n\nWhen customers are switching back and forth between two rideshare platforms, I’d say there’s more brand loyalty there than buying shoes from Zappos vs the gazillion other outlets to buy shoes from. ", "score": 4, "replies": []}]}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "Twitch actually had notable assets though. Servers aren't cheap, and content producers are harder to convince to move than users are (and users even often have brand loyalty).\n\nLyft barely has any real assets, and drivers and passengers hold no brand loyalty towards Lyft.", "score": 1, "replies": []}]}, {"body": "Totally agree. They already have the logistics company, so routing, and mapping are done, all they need is to convert TNC driver's (who will jump at any new TNC), and put an ad on a site that gets millions of views a day, like... Amazon.com.", "score": 3, "replies": []}, {"body": "Lyft also is working on autonomous tech. That's why.", "score": 2, "replies": [{"body": "Aren't they working on it through GM? How would that play out if amazon were to acquire them?", "score": 3, "replies": [{"body": "Good question; would be part of the negotiation process. It’s part of their valuation so either GM keeps the deal and works with Amazon (probably their preference: hey new money backing the project!), or they severe it and Lyft’s valuation drops, giving Amazon a better deal.", "score": 3, "replies": [{"body": "Interesting. Thanks for explaining!", "score": 2, "replies": []}]}]}]}, {"body": "At this point the ride sharing market is dominated by Uber and Lyft.  Trying to enter it and get market share will be difficult to say the least.", "score": 2, "replies": [{"body": "I already have a bunch of Amazon apps tied to my credit card, if I could order a car with it, I would in a heartbeat.  Amazon Prime already has 100,000,000 users.", "score": 1, "replies": [{"body": "So?  Just because prime has loads of users doesn't mean they are all going to use such a service.  Especially when Lyft and Uber already have an established market.", "score": 0, "replies": []}]}]}, {"body": "As a business, maybe. The infrastructure is the hard part of a project like this. Starting it anew creates a lot of uncertainty overnight that requires time and effort to solve. Could be trivial, could be not. But you won't know until you're in the middle of it. Yeah they have drivers, but I would assume they already are operating at full capacity.\n\nIf you're in the kind of financial spot that Amazon enjoys, it's more productive to acquire something that's operating fairly well already rather than starting from scratch. You are also acquiring a workforce that knows the platform and the industry well, instead of moving people around internally or having to hire for a very specific skillset that's not exactly widespread yet.", "score": 1, "replies": []}]}, {"body": "General motors won't allow that.", "score": 88, "replies": [{"body": "What is GMs interest in ride sharing?", "score": 30, "replies": [{"body": "GM owns about 10% of Lyft. As for their interest I would imagine ultimately launch autonomous vehicles directly into the Lyft ecosystem ", "score": 68, "replies": [{"body": "They have a program where you can rent a GM vehicle to drive for Lyft. I think you're right about the autonomous vehicles considering they own Cruise Automation.", "score": 24, "replies": []}, {"body": "Lyft and Delta also have some partnership. Admittedly, not entirely sure what it entails.", "score": 3, "replies": [{"body": "[deleted]", "score": 21, "replies": [{"body": "That's wheelsup you're thinking of.", "score": 2, "replies": []}]}, {"body": "So does JetBlue. You get miles when you use Lyft. ", "score": 4, "replies": []}]}, {"body": "Noob question, can't AMZN just buy 50% from the remaining 90% ", "score": 1, "replies": []}]}, {"body": "They own part of Lyft and they make the self driving technology and the cars that Lyft will use.", "score": 12, "replies": [{"body": "Why not allow it?", "score": 2, "replies": []}, {"body": "They do not make the self driving technology or the cars for lyft. I'm not sure where you got your information but Lyft's autonomous vehicles are Ford fusions. ", "score": 1, "replies": []}]}, {"body": "GM has a rather large partnership with Maven in regard to ride sharing.  There's the obvious interest of selling fleets of vehicles to ride sharing companies.  I'm interested in what you're really asking, because the literal answer is too obvious.", "score": 2, "replies": []}]}, {"body": "Why wouldn’t they allow it? I see no reason their partnership couldn’t continue with Amazon instead of Lyft.", "score": 8, "replies": [{"body": "Why would it have to be instead of? GM owns 10% of Lyft", "score": 4, "replies": [{"body": "thats not controlling interest....", "score": 7, "replies": [{"body": "And...? \nI am asking because I don't understand why that would be an issue. Can you please clarify rather than give me half a sentence?\nCongrats on the world series btw", "score": 3, "replies": [{"body": "well there is such thing as a hostile takeover. If amazon can buy up enough shares to own a majority of the shares, they can force a buyout of the rest of the company.", "score": 7, "replies": [{"body": "Oh, I see. Thank you. So would it be in GM's best interest to buy a majority?", "score": 1, "replies": [{"body": "yes, but that involves a significant capital investment that GM may not be ready to make. We know amazon prints money, although not as much as apple, but a company like GM might balk at a $6 billion investment just to protect from a hostile takeover", "score": 2, "replies": []}]}]}, {"body": "Typically owning 10% of a company doesn't allow you to decide on whether the company gets taken over (it gets more complicated with share classes and voting rights).", "score": 2, "replies": []}]}]}]}]}, {"body": "I did some digging and found out that gm isn't the only one:\n\"Nor is GM the only public company that could find itself lifted by Lyft's success. S&P Global also names publicly traded (i.e. you can buy them) Icahn Enterprises(NASDAQ: IEP), KKR & Co. (NYSE: KKR), Alliance Bernstein Global High Income Fund (NYSE: AWF), and GSV Capital Corp(NASDAQ: GSVC) as all owning stakes in Lyft. China's Alibaba (NYSE: BABA) and Tencent (NASDAQOTH: TCEHY) are also said to own stakes via their investment arms.\"", "score": 6, "replies": []}, {"body": "Exactly what I thought when I read it.", "score": 8, "replies": []}, {"body": "They will or more so allow Amazon to buy a portion of the company.", "score": 2, "replies": []}, {"body": "GM doesn't control Lyft's board...", "score": 2, "replies": []}, {"body": "They would get a good return on their investment and they could still make a deal with Amzon", "score": 1, "replies": []}, {"body": "Why's that? ", "score": 1, "replies": []}]}, {"body": "OP is a fucking tool. When he's not over at T_D posting garbage,  he's stealing shit from linkedin and posting it here as though he came up with it. \n\nOP,  how fucking sad is your life? That's a rhetorical question.", "score": 20, "replies": []}, {"body": "Ol musky is gonna buy it make my words it’s not rocket appliances ", "score": 57, "replies": [{"body": "If all else hails, I’ll just go back to growing dope", "score": 12, "replies": []}, {"body": "Best show", "score": 4, "replies": []}, {"body": "If its not patented which taxi services / ride shares cant really be.. then imo he would just start his own.   \nHe seems to prefer building from the ground up.   \nI think the next big venture here is driverless taxis.", "score": 8, "replies": [{"body": "Taxis from mars to earth (and vice versa) in 2036", "score": 3, "replies": []}]}]}, {"body": "Amazon already has their own lyft like service for packages.  Its called amazon flex.  They have no shortage of people wanting to deliver packages.  Plus youll get paid at least 18 an hour.  My buddy did it for a few months and made really decent money.", "score": 30, "replies": []}, {"body": "I would agree but one thing is bugging me. The ride share model works only when the workers are contractors and not employees with benefits. This would leave Amazon with potential legal liability depending on the states Lyft operates in. ", "score": 29, "replies": []}, {"body": "Interesting theory. Certainly sounds plausible, we shall have to see!", "score": 55, "replies": []}, {"body": "Oh a Parth Detroja fan! I loved his LinkedIn post about this, I’ll give him my Karma :)", "score": 26, "replies": []}, {"body": "did you just copy this off some dweeb on linkedin", "score": 17, "replies": []}, {"body": "Lyft is not a retail but a service/human based organization. That doesn't scale with Amazon's core platform which involves physical and not human capital. Think products  (physical goods or cloud-based services) in comparison to humans (drivers). That requires a completely different set of managerial efforts.\nUber would make more sense, if at all, because they are heading toward driverless cars at which point amazon can offer a product that involves physical, not human, capital.\n", "score": 16, "replies": [{"body": "couln't they just push Lyft towards driverless cars eventually too?", "score": 17, "replies": []}, {"body": "I don't know if you've seen Amazon recently, but they offer \"expert installations\" on tons of stuff. I just bought a new oil filter for my oil tank and they offered expert installation. Same for car parts, housing accessories, etc.", "score": 2, "replies": [{"body": "That's a fair point, but I'm not sure how involved their contractor management is?", "score": 3, "replies": [{"body": "Doesn't matter. They're testing the waters. If they need/want to expand and improve their system, they will.\n\nAmazon has the talent, disposable income to start projects, and the networking capabilities. They can do it whenever they want.", "score": 0, "replies": []}]}]}]}, {"body": "Interesting proposition but.. no. No just yet.\n\nLyft is valued at ~15B, so an acquisition by Amazon would be in the 30B range to be palatable to Lyft's VCs.  And that would mean that Amazon would swallow a pill that's about 1/25th of it size.  So far so good.\n\n2 issues:\n\n1. The acquisition would be dilutive and not accretive, so Amazon's earnings and P/E ratio would worsen; and with those stock price\n2. Lyft's path to profitability is far, far away; nowhere in sight with the current business model (drivers and \"regular\" cars); which means that the issues highlighted on #1 above will continue with no end in sight.\n\nLyft is not WHM! There's no way AMZN is going to swallow such a big, earnings damaging pill. AMZN would be better off paying 100B once Lyft's profitable or near profitable than today.  It's just the way Wall Street operates and the dynamics of being a publicly traded company.\n\nMaybe we're going to see an investment, even a large chunk, let's say 5B (convertible with warrants, of course) or so, investments are accounted for differently and don't affect earnings as directly and as timely as a full-blown outright acquisition. That is unusual for AMZN since it has never happened before, but . . . if Jeff wants to enter the new generation of auto-transportation, that could be a way in.", "score": 13, "replies": [{"body": "Agreed. Has anyone ever stopped to wonder, wait a minute. Why is lyft usually cheaper than Uber? How can they manage to do that with less drivers and market share?\n\n\n\n\nOh right it’s fucking subsidized. The company is bleeding money and is most likely a dumpster fire on the inside as they scramble to catch up to Uber. ", "score": 3, "replies": [{"body": "Both Lyft and Uber rides are cheaper than their cost, so effectively they are both subsidizing all rides in order to establish the new category and their market share.\n\nIt's not clear to me the long-term path to profitability unless it's dependent on:\n\n* Putting taxi cabs out of business, the same way that auto companies put bus companies out of business about 100 years ago\n\n**AND**\n\n* new personal transportation business models: self-driving cars, time-share autos, self-driving car-pools...", "score": 4, "replies": [{"body": "Lyft subsidizes more than Uber. Check out the lyft incentives for vs Uber’s. As Uber heads towards IPO a big concern on all parties minds is, is it profitable? \n\nUber’s vision is also no longer just ridesharing. Eats is definitely a profitable business and is booming with HUGE growth in the last 2 years. From 0 to the industry leader in food delivery. Uber is going to use their existing driver network to solve many different consumer needs. \n\nNow I’m not saying lyft can’t do these things, but Uber is thinking strategically, while lyft is thinking “can we catch the fuck up”. \n\n\nPeople think, there’s no moat to ride sharing, and while that’s true, one might argue that a moat is the surprisingly difficulty to build a software infrastructure like that, I can’t see any newcomers truly upending Uber for a long time coming.", "score": 1, "replies": []}]}]}]}, {"body": "Cheaper for Bezos to do it himself with his own data. ", "score": 6, "replies": []}, {"body": " \n\n\"Lyft   is five times cheaper to acquire than Uber. It has 35% of ridesharing   marketshare in America and is rapidly growing in Canada—two of Amazon's   biggest market.\"\n\nShows you the value of  market dominance. Do you rather be Coke or Pepsi? UPS or FedEx? Lyft is  2ND BANANA. The market isn't pricing Uber wrongly in comparision to  Lyft. Both are wildly overvalued, but in relation to each other, it is  that way for a reason.\n\n\"Currently,  no major  Western ridesharing platform is profitable. That's because it  takes a  ton of costly promotions and subsidies on both the rider and  driver  sides to grow a ridesharing platform.\"\n\nIt  goes to show you what I said it the first point... The value of market  dominace is so high that both of these companies are running at negative  60% profit margin in order to try to be bigger than the other. Did you  ever think for a second that maybe these are terrible businesses? Amazon  doesn't have any magic trick that would allow it to make Lyft grow  faster than they already are. Not anymore than any other buyer could.\n\n\"Amazon,   however, could substantially reduce the high cost of new rider   acquisition by just offering their over 100 million Prime members a   discount for using Lyft over Uber. This would shift marketshare   overnight.\"\n\nSo subsidize the losses even  further... Amazon doesn't have very deep pockets. They spend most of  their money subsidizing their money losing retail business anyways.\n\n\"Then,  on the driver side, Lyft  drivers could be doing last mile order  fulfillment for Prime Now and  Amazon Restaurant when ride demand is  low—effectively increasing driver  wages through removing time spent  waiting for a new passenger while also  lowering Amazon's fulfillment  costs.\"\n\nThat is unfathomable, and a  logistical nightmare. Also highly inefficent. They already have  independent contractors who deliver 150 packages an hour for poverty  wages.\n\n\"The   operational efficiencies that come from owning both commerce and   ridesharing would allow Amazon to become the most valuable company in   the world.\"\n\nOwning both companies doesn't  give them any efficiency... You're not going to get in a Prius that is  stuffed with 50 packages. The idea is mindless.", "score": 5, "replies": [{"body": "> That is unfathomable, and a logistical nightmare. Also highly inefficent. They already have independent contractors who deliver 150 packages an hour for poverty wages.\n> \n> \n\nYup, strange so few else people else mention this. They don't need Lyft at all. I don't think anyone does, they're just preparing for an IPO at a crazy valuation that is based on autonomous cars breaking through, and transport mobility in 2040. ", "score": 1, "replies": []}]}, {"body": "I'm here to echo the no moat argument. \n\nAmazon could let the overvalued Uber fail, and then strong arm them into a purchase at a low price. Remember they haven't ipo'd yet.\n\nAmazon could work out a backroom deal with Lyft before their ipo in 2019, which is scheduled after Ubers ipo if I remember correctly. \n\nAmazon could simply buy up a smaller service, and commodify/homogenize the shit out of them, while integrating their own tech/delivery/autonomous driving background.\n\nAmazon could just buy up a shitty and underperforming Nationwide taxi company instead, and do the same with them.\n\nAmazon could also just disrupt UPS/FEDEX instead, and destroy their business model, while the market takes some time to realize that Uber and Lyft are wildly overvalued, and then purchase them later for the purpose of taxis/autonomous vehicles without even using them for deliveries.\n\nAmazon could turn into a unicorn and poop rainbows while riding off into the 2 trillion market cap sunset for all this crazy fucking market seems to think is realistic.", "score": 11, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Why is this bad for UPS?", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Really? I feel like that would be free at the point of use but Amazon would be paying UPS a shit load for the service. Why would they do it for free?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Jesus", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "https://www.google.com/amp/s/www.cnbc.com/amp/2018/10/16/lyft-hires-jp-morgan-to-lead-ipo-at-15-billion-valuation.html", "score": 4, "replies": []}, {"body": "RemindMe! 18 months 2020-04-30 ", "score": 4, "replies": []}, {"body": "I bet you're wrong. Lyft will IPO in 2019. As soon as that happens, it won't be cheap anymore.", "score": 4, "replies": []}, {"body": "\"Alexa, get me out of here\"", "score": 4, "replies": []}, {"body": "Bitch ass OP plagiarizing and trying to pass it off as his own thoughts ", "score": 4, "replies": []}, {"body": "Remindme! 17 months “amazon and lyft", "score": 3, "replies": []}, {"body": "Uber and Lyft both haven't earned a profit?", "score": 3, "replies": []}, {"body": "Why would Amazon buy Lyft instead of just starting their own competition? As far as I'm aware, Lyft doesn't actually have any assets or unique licenses or technologies.", "score": 3, "replies": []}, {"body": "!RemindMe 18 months", "score": 3, "replies": []}, {"body": "!RemindMe 18 months ", "score": 3, "replies": []}, {"body": "!RemindMe 18 months", "score": 3, "replies": []}, {"body": "Remindme! 17 months. \"Amazon buy Lyft\"", "score": 6, "replies": [{"body": "I will be messaging you on [**2020-03-31 02:28:15 UTC**](http://www.wolframalpha.com/input/?i=2020-03-31 02:28:15 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/stocks/comments/9su0zw/i_predict_amazon_will_acquire_lyft_in_the_next_18/)\n\n[**CLICK THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/stocks/comments/9su0zw/i_predict_amazon_will_acquire_lyft_in_the_next_18/]%0A%0ARemindMe!  17 months. ) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! e8rlxvy)\n\n_____\n\n|[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/)\n|-|-|-|-|-|-|", "score": -2, "replies": []}]}, {"body": "Ripped off LinkedIn .... SMH ", "score": 3, "replies": []}, {"body": "But are you not uncertain?", "score": 2, "replies": []}, {"body": "damn AWS paying for everything", "score": 2, "replies": []}, {"body": "I read this in an article like a week and a half ago haha, nice summary of it tho ", "score": 2, "replies": []}, {"body": "I predict antitrust laws to finally start having an impact in the next 18 months.  ", "score": 2, "replies": []}, {"body": "Makes sense", "score": 2, "replies": []}, {"body": "Ride share is not going to be hugely profitable until autonomous cars are being used. It makes little sense to take the lumps of the bad years right now.", "score": 2, "replies": [{"body": "Uber’s business model was written around driverless cars. They know for long term, they only have to put up with drivers for a small fraction of the companies future. UBER will be the first working fleet of driverless cars, bet on that for sure. When they don’t have to pay drivers, their profit margins triple overnight. Of course their will be a huge investment for the cars. I bet at that point they will almost design their own custom car that will look stupid. Of course this is what Amazon would be seeing in Lyft, they will probably buy lift once that driverless car is more a reality. They are coming sooner than you think. Most shipyards and routine truck routes are soon to be replaced with driverless trucks boys and girls. Probably will start having their own lane on the highway for cautious States. ", "score": 1, "replies": []}]}, {"body": "I have no doubt Lyft VC's invested with a buyout in mind as they have no chance of overtaking Uber. I had other companies in mind, but your reasoning for Amazon makes perfect sense.", "score": 2, "replies": [{"body": "Not necessarily. One bought in because the management at Uber left a bad taste in their mouth and they felt like Lyft wouldn’t fuck up in terms of PR. ", "score": 2, "replies": []}]}, {"body": "That is surprising that Lyft only has 35% of the market.  A lot of people I know have switched to lyft and I’m not sure anyone else I know still uses Uber.  It is growing and would be a great purchase for amazon.", "score": 2, "replies": []}, {"body": "Imagine so many years from now when all the ride sharing companies have switched over to self-driving cars. Will there still be people pulling up in 7/11 on wheels because Uber sure as shit won't be stocking up their cars?", "score": 2, "replies": []}, {"body": "AmazonFresh do not compete with UberEats. It's the name, fresh. They do supermarket delivery, not restaurant delivery", "score": 2, "replies": []}, {"body": "!remindme 18 months", "score": 2, "replies": []}, {"body": "Lyft lowkey been taking my 2$ for months now, but shit is it worth it for from where i love to the train station lol", "score": 2, "replies": []}, {"body": "You think GM will sell Lyft to Amazon?", "score": 2, "replies": []}, {"body": "Bezos is a redditor. He has read this. 2019 is gonna be big!", "score": 2, "replies": []}, {"body": "Sounds like an \"all in\" maneuver would be the best thing to do.", "score": 2, "replies": []}, {"body": "Does the remind me thing even go that far in timr", "score": 2, "replies": []}, {"body": "Never thought about it....but now that you mention it, totally could see the synergies.  Here is the major point which supports your thesis (that respectfully you missed): the market is forcing Amazon.com to focus on profitability.  As a result, management can pursue speculative acquisitions like potentially acquiring Lyft since Amazon.com is being rewarded for future growth potential, not current ROE/ROIC trends. ", "score": 2, "replies": []}, {"body": "Now you can get free two day shipping on yourself. ", "score": 2, "replies": []}, {"body": "Great theory! Good call. I’m excited to see if you’re right. !remindme 90 days", "score": 2, "replies": []}, {"body": ">Amazon, however, could substantially reduce the high cost of new rider acquisition by just offering their over 100 million Prime members a discount for using Lyft over Uber. This would shift marketshare overnight.\n\nThat's a pretty good idea; however, if no ridesharing companies are profitable, where is that discount going to come from if they already have negative margins? Also, don't forget 100 million Prime Members is a global thing, and that not everyone uses ridesharing services (so maybe it'd be more like 15 million relevant customers?).\n\n>Then, on the driver side, Lyft drivers could be doing last mile order fulfillment for Prime Now and Amazon Restaurant when ride demand is low—effectively increasing driver wages through removing time spent waiting for a new passenger while also lowering Amazon's fulfillment costs.\n\nTons of Amazon Flex drivers already drive for Uber and/or Lyft anyways, so they wouldn't be gaining much in that regard. People already do Amazon Flex blocks and then turn on Uber/Lyft to try and get routes that essentially take them back to/closer to their homes, and vice-versa.\n\nTo be honest Amazon could probably just start their own ridesharing service under the Flex brand if they wanted to, it would probably be a lot more cost-effective than an acquisition given current market valuations anyways.", "score": 2, "replies": []}, {"body": "Just watched The Equalizer 2.  Lyft spent big money on that film.  Cool movie, btw.", "score": 2, "replies": []}, {"body": "Lyft pride themselves on their treatment of drivers, good luck relinquishing this to Amazon!", "score": 2, "replies": []}, {"body": "I predict someone will create a decentralized business model of the above and we will see these CEO's become extinct.", "score": 2, "replies": []}, {"body": "It's not even profitable to be the driver.. ", "score": 2, "replies": []}, {"body": "There’s Amazon Flex that, to some extent does last mile delivery. ", "score": 2, "replies": []}, {"body": "Amazon is slowly scaring me. It is clearly the umbrella corporation. Lol", "score": 2, "replies": []}, {"body": "Doesnt lyft run on aws Anyways?", "score": 2, "replies": []}, {"body": "Acctualy I believe they will acquire Careem( the Arabian uber) first since it is more successful in the reigon  just like they did with souq.com ", "score": 2, "replies": []}, {"body": "This is brilliant, especially the last mile delivery of prime packages... you a thinking man. ", "score": 2, "replies": []}, {"body": "really smart\n\nbut would have been smarter to sell this idea to Bezos", "score": 2, "replies": []}, {"body": "Hello, prime member Lyft discounts! ", "score": 2, "replies": []}, {"body": "Lyft hired an M&A-focused investment bank in 2016 - https://www.wsj.com/articles/lyft-hires-m-a-banker-qatalyst-partners-1467065007\n\nIf Amazon had legitimate interest, not sure why they didn't acquire them then when they could have been had for a lower valuation", "score": 2, "replies": []}, {"body": "Shh, don't give Jeff too much idea ", "score": 2, "replies": []}, {"body": "I think it would be far more likely for Amazon to acquire a company like UPS. Being able to have ultimate control top to bottom of shipping and supply chain. Makes no sense for them to acquire a ride sharing company. IMHO Amazon looks at every deal in the lens of \"What will get customers to buy more products on Amazon.com?\".", "score": 2, "replies": []}, {"body": "I'll bet they go IPO before then. ", "score": 2, "replies": []}, {"body": "RemindMe! 18 months", "score": 2, "replies": []}, {"body": "Holy shit...this makes a lot of sense...", "score": 2, "replies": []}, {"body": "Dude, either you need to be the next Bezos, or he needs to give you a job\n\n!remindme in 18 months", "score": 2, "replies": []}, {"body": "It does seem like something they’d be stupid enough to do to continue to show “growth”.", "score": 2, "replies": []}, {"body": "I think you think waiting for rides is a bigger part of low wages than it really is. Even in LA it's still a hustle and you have people driving from hours away just to drive ", "score": 2, "replies": []}, {"body": "Honestly, it would probably just be easier for Amazon to develop their own rideshare program. I think they are already working on self driving cars. Either way, I would absolutely move to an Amazon rideshare from Uber and Lyft ", "score": 2, "replies": []}, {"body": "Remindme1 18months", "score": 2, "replies": []}, {"body": "The issue I see with this is that Amazon just declared a $15 dollar minimum wage and are lobbying for it to be the new standard. Uber drivers and other food delivery drivers get paid a commission per ride/delivery not hourly. Uber and Lyfts business model works because there is no hiring process and people can work at their own pace. If Amazon bought lyft they would be pressured to maintain their $15/hr minimum wage or they would get major negative criticism. You have to have a hiring process to make sure your employee will give you at least $15 worth of labor an hour. There is no way they would have it where anyone can sign up and just sit in their car dicking around on their phones, occasionally delivering a package for $15/hr.\n\n&#x200B;\n\nI also personally don't want this to be a thing. Do you realize how much more congested roads will become? Especially in densely populated areas. rather than having a few large loaded up UPS trucks delivering packages, you will have thousands of regular cars delivering packages all day/night.", "score": 2, "replies": []}, {"body": "Highly doubt it.   But they do need self driving technology.  I am surprised they have not already made a move.\n\n", "score": 2, "replies": []}, {"body": "Yay! Another business that doesn’t make money!", "score": 2, "replies": []}, {"body": "!Remindme 18 months", "score": 2, "replies": []}, {"body": "you predicted this huh?", "score": 2, "replies": []}, {"body": "Looks like you were ahead of [your time] (https://www.businessinsider.com/amazon-could-acquire-lyft-expert-2018-11)", "score": 2, "replies": []}, {"body": "How did it turn out?", "score": 2, "replies": []}, {"body": "Remindme! 17 months. \"Amazon buy Lyft\"", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Good bot", "score": 1, "replies": [{"body": "Thank you, GeoFlashMite, for voting on Angry_Robot.\n\nThis bot wants to find the best and worst bots on Reddit. [You can view results here](https://botrank.pastimes.eu/).\n\n***\n\n^(Even if I don't reply to your comment, I'm still listening for votes. Check the webpage to see if your vote registered!)", "score": 2, "replies": []}, {"body": "good human", "score": 0, "replies": []}, {"body": "Aww do you mean it ? <3", "score": 0, "replies": []}]}]}]}, {"body": "Uber and Lyft are bad long term investments. Once driverless cars takeover, why are Uber and Lyft going to exist? Some company like Tesla or GM can just deploy fleets of their vehicles, build an app, and reap all the profits without having Uber/lyft act as middlemen. I'd bet a lot of money amazon doesn't buy Lyft.", "score": 5, "replies": [{"body": "Uber's business plan is driverless taxis, not contracting randos to drive people. They're actively involved with driverless technology (and have run over at least one person so far).", "score": 4, "replies": []}, {"body": "True, but before that happens, individual owners with self driving cars might be able to have their vehicle uber-itself. Imagine having your car drive you to work in the morning, and make money for you the whole day while you are working.", "score": 1, "replies": []}]}, {"body": "RemindMe! 18 months\n\nHopefully I did that right", "score": 4, "replies": []}, {"body": "Nah, lyft isnt for sell guys. You guys are tripping.", "score": 2, "replies": []}, {"body": "He will buy SFIX first.", "score": 2, "replies": [{"body": "Why would he do that", "score": 4, "replies": [{"body": "After taking a peek, I could see that actually, it's the route Walmart is choosing to compete with Amazon. Still pretty small, they could buy it with cash generated in a quarter or two. Integrated with their own offerings or even branded clothes, could become another revenue stream or Prime benefit to drive growth.", "score": 3, "replies": []}]}]}, {"body": "What up?  - - Jeff bezos here", "score": 2, "replies": []}, {"body": "Delivery by drone.\n\nThat is all.", "score": 2, "replies": []}, {"body": "Rideshare isn't profitable and won't be until full automation. I don't see the plus side for Amazon. ", "score": 1, "replies": []}, {"body": "Not going to happen, Google investing a lot in Lyft and will never let Amazon buy them out. Between those two companies, Lyft is just like penny change and definitely Google has more of an advantage of getting the passenger data points.", "score": 1, "replies": []}, {"body": "I put a remind on this for 90 days. Hasn’t happened yet but at this point it feels more likely rather than less. ", "score": 1, "replies": []}, {"body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/lyftdrivers] [DISCUSS? IMO THIS MAKES SENSE TO ME](https://www.reddit.com/r/lyftdrivers/comments/b611kt/discuss_imo_this_makes_sense_to_me/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*", "score": 1, "replies": []}, {"body": "they already have their own drivers, no need to buy lyft", "score": 1, "replies": []}, {"body": "It’s still possible", "score": 1, "replies": []}, {"body": "\n> would allow Amazon to become the most valuable company in the world.\n\n\nIs it not already? ", "score": 1, "replies": [{"body": "It’s below AAPL and MSFT currently ", "score": 6, "replies": []}]}, {"body": "there is a lot of blowback coming from apps managing labor in europe  \nand you can expect something similar to happen in ca/us/mx as the  \nderegulating republicans lose their grip on government policy making.   \ncompanies that profit off low wage earners to hollow out the middle class  \nwill be facing growing pressure to provide actual employee benefits.   \nbezos knows this, and won't be expanding into more of that economy.    \nthe problem with the entire ride sharing industry is the app mostly cut  \nout the dispatcher job, but that wasn't enough for their shareholders  \nso to grow they kept fares so low that drivers  clear minimum wages.", "score": 1, "replies": [{"body": "Lyfts not going to have a drivers within 10 years, so this point is moot.\n\nHuman drivers are stop gap to ride share development. We will see wide scale driverless ride share in the next five years, with few, if any human drivers doing ride share in 10.", "score": 5, "replies": []}, {"body": "I couldn't help but read this as a poem", "score": 6, "replies": []}]}, {"body": "Ehh, UPS maybe. But prob not Lyft. ", "score": 1, "replies": [{"body": "They would have to pay over $100B for UPS, would be surprised if they decided to shell out that much for a legacy logistics company.", "score": 2, "replies": []}, {"body": "Never understood why UPS never entered the e-commerce market. \n\nIt would have been easier for them to blow amazon out of water with the infrastructure already in place. \n\nUPS had the potential to take over every aspect of distribution and retailing and become the most valuable company in the world. ", "score": 2, "replies": []}]}, {"body": "so they are going to screw over all those independently operated delivery fleets who signed up with Amazon?", "score": 1, "replies": [{"body": "Of course. Duh.", "score": 3, "replies": []}]}, {"body": "fucking hell. this sounds like the beginning of a dystopian movie where an evil corporation starts taking over everything by first providing tempting benefits to the consumers who will later have all daily necessities dependent on its service and thus have themselves become the slaves that tirelessly work for the corporation without even knowing. ", "score": 1, "replies": []}, {"body": "This is a copypaste from a post on LinkedIn...", "score": 1, "replies": []}, {"body": " By the same Logic Amazon will takeover GE cuz hurdur they can make it more profitable.", "score": 1, "replies": []}, {"body": "So I should buy stock in Burger King. Gotcha. ", "score": 1, "replies": []}, {"body": "Lyft is worth \\~ $15 Billion apparently.  What are your thoughts on how $AMZN would finance this acquisition?  Issue stock or cash on hand?", "score": -1, "replies": [{"body": "Probably a combination of debt financing and AMZN shares.", "score": 3, "replies": []}, {"body": "They are worth 748 billion soooooo, the will probably ask real nice for some money", "score": 2, "replies": []}, {"body": "and.. $AMZN is worth $1000 Billion.. ", "score": 1, "replies": [{"body": ">ReplysharereportSaveGive gold\n\nI thought they had lost $215 billion last week. ", "score": 2, "replies": [{"body": "and yet.. that loss is still 15x lyft's worth. ", "score": 4, "replies": [{"body": "Oh I know. I was thinking about that. Would be nothing to acquire. ", "score": 1, "replies": []}]}]}, {"body": "Not after last week. ", "score": 3, "replies": []}]}]}, {"body": "Delta has a big agreement with Lyft, so I’m not sure how they would like this", "score": 0, "replies": []}, {"body": "Holy shit this is retarded. Not gonna happen. LMAO", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "You stole this post. ", "score": 1, "replies": []}, {"body": "The fact you get upvotes for this is perhaps even more funny that the points you make.\n\n&#x200B;\n\nBut as you wish:\n\n&#x200B;\n\n \n\n\"Lyft  is five times cheaper to acquire than Uber. It has 35% of ridesharing  marketshare in America and is rapidly growing in Canada—two of Amazon's  biggest market.\"\n\nShows you the value of market dominance. Do you rather be Coke or Pepsi? UPS or FedEx? Lyft is 2ND BANANA. The market isn't pricing Uber wrongly in comparision to Lyft. Both are wildly overvalued, but in relation to each other, it is that way for a reason.\n\n&#x200B;\n\n\"Currently, no major  Western ridesharing platform is profitable. That's because it takes a  ton of costly promotions and subsidies on both the rider and driver  sides to grow a ridesharing platform.\"\n\nIt goes to show you what I said it the first point... The value of market dominace is so high that both of these companies are running at negative 60% profit margin in order to try to be bigger than the other. Did you ever think for a second that maybe these are terrible businesses? Amazon doesn't have any magic trick that would allow it to make Lyft grow faster than they already are. Not anymore than any other buyer could.\n\n&#x200B;\n\n\"Amazon,  however, could substantially reduce the high cost of new rider  acquisition by just offering their over 100 million Prime members a  discount for using Lyft over Uber. This would shift marketshare  overnight.\"\n\nSo subsidize the losses even further... Amazon doesn't have very deep pockets. They spend most of their money subsidizing their money losing retail business anyways.\n\n&#x200B;\n\n\"Then, on the driver side, Lyft  drivers could be doing last mile order fulfillment for Prime Now and  Amazon Restaurant when ride demand is low—effectively increasing driver  wages through removing time spent waiting for a new passenger while also  lowering Amazon's fulfillment costs.\"\n\nThat is unfathomable, and a logistical nightmare. Also highly inefficent. They already have independent contractors who deliver 150 packages an hour for poverty wages.\n\n&#x200B;\n\n\"The  operational efficiencies that come from owning both commerce and  ridesharing would allow Amazon to become the most valuable company in  the world.\"\n\nOwning both companies doesn't give them any efficiency... You're not going to get in a Prius that is stuffed with 50 packages. The idea is mindless. \n\n&#x200B;\n\n&#x200B;", "score": 0, "replies": []}]}]}]}]}, {"body": "They won't. Self-driving cars are now a reality with Tesla's live test as of last week. 18 months to jump behind the curve is foolish.", "score": -3, "replies": [{"body": "Because everyone’s gonna be taxied around in teslas in the near future and amazon’s gonna pay for it, right...", "score": 5, "replies": [{"body": "Why would Amazon even want to bother with the business? Retail is their gig. Transportation is and always will be an easily disrupted industry. But selling total crap to people? That never gets old. Doing it faster and with less interaction? That's how Amazon wins.", "score": 2, "replies": []}, {"body": "That would never happen. ", "score": 2, "replies": []}, {"body": "Apparently Tesla has their own ride share program ready to go for owners. Once the bugs are worked out for the self driving cars and are legal to drive without a driver. Any Tesla owner with the right model will be able to send their car out for ride sharing to make them some $$ when they don't need it.  So basically the car could literally pay for itself. ", "score": 2, "replies": []}]}, {"body": "Honestly, the people who are actually working on self-driving tech are nowhere near that optimistic in regards to the timeline for full deployment of the tech.\n\nWe’re talking 5 years at an absolute minimum for the kind of changes you’re talking about.", "score": 3, "replies": [{"body": "Full automation isn't the risk here; Uber/Lyft use the knowledge of the last of the land as the primary source of their ability but cars that can direct themselves to a location, meaning go beyond human navigation and suggestion, are on the road today. \n\nThe only point of actually owning a company with that advantage doesn't exist anymore. And using them as just a taxi service will die quickly if they lack staying power in large metros, which they would, because the entire point of that particular advantage over public transport is distinctly achieving difficult destinations.", "score": 2, "replies": []}, {"body": "Within 2 years you’ll have driverless ride share. In a few major cities. GM was poised to do it next year until some setbacks. ", "score": 2, "replies": [{"body": "I guess we’ll have to see. I had the impression that the various “setbacks” are significant and the tech still needs work to be optimised.", "score": 2, "replies": []}, {"body": "Got a source? Not that I don't believe, I'm just a big fan of driverless car news.", "score": 2, "replies": [{"body": "It’s not true, we’re not even close on a regulatory front or a technology front. ", "score": 2, "replies": []}, {"body": "Supposedly there will be one in Israel next year by Intel/Mobileye and Volkswagen--this was in the news last week. However, I'm somewhat on the more skeptical side as well.", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Unlikely. Amazon would lose because Amazon isn't a car company and owns no cars. It turns out Lyft isn't a car company and also owns no fleet to put this on. The partnership would dissolve faster than sugar in water.", "score": 1, "replies": []}]}]}, {"body": "You think drivers are going to riding around deliever packages while waiting for a customer to request a lift? That would never happen.", "score": 0, "replies": []}, {"body": "This guys post history makes him seem unbearable. ", "score": 0, "replies": []}, {"body": "The more likely scenario is Lyft and Uber will merge and we'll be back to taxi prices. ", "score": -4, "replies": []}, {"body": "Why on earth would Amazon by lift? Amazon wants people at home on their computers not out experiencing the world. I don’t see how it aligns with any of the other offerings.", "score": -3, "replies": [{"body": "Shhh, they wouldn't. OP is a total retard and so is everyone who upvoted this. By the same Logic Amazon will takeover GE cuz hurdur they can make it more profitable.", "score": 3, "replies": []}, {"body": "This is one of the worst posts in the history of this sub. You receive no points - and may God have mercy on your soul ", "score": 7, "replies": [{"body": "Is the point of this sub to try and pump and dump based on ridiculous speculation that makes no sense whatsoever? If that's the case, clearly Microsoft is going to buy Jiffy Lube in the next 6 months. I predict they will tap Ozzy Osbourne as CEO.", "score": 2, "replies": []}]}, {"body": "Lol right on!", "score": 2, "replies": []}, {"body": "Yeah, that’s exactly why they’re opening physical stores now. \n\nWait 🤔", "score": 1, "replies": [{"body": "From day 1 they were about selling items cheaper than their competition. It started as books. I’m an Amazon reseller. How any of that jives with ride sharing is unclear to me. But good luck ", "score": 1, "replies": []}]}, {"body": "They should probably stop selling camping gear then. /s", "score": 1, "replies": []}]}, {"body": "I wanted to say how stupid. But then I started thinking...", "score": -1, "replies": []}, {"body": "Amazon already has “flex” idiot", "score": -1, "replies": []}, {"body": "Amazon Ride does have a nice ring. However as mentioned above they would spend a fortune dev the app and building loyalty. I see Bezos acquiring Uber however. Good bet on Lyft as I’m sure the stock will catch up with the mean of both. Uber will fall, Lyft will rise. ", "score": -2, "replies": []}, {"body": "as of today, it's $20/share, maybe this will come true after all, just later than predicted", "score": 1, "replies": []}, {"body": "Nope", "score": 1, "replies": []}]}
{"title": "$100k in FDs holding through $AAPL earnings.", "selftext": "[deleted]", "id": "9t2keu", "created_utc": 1541017663.0, "score": 420, "upvote_ratio": 0.97, "num_comments": 318, "comments": [{"body": "  You will either be rich or a wsb mod, good luck my son ", "score": 451, "replies": [{"body": "He may be your dad...", "score": 73, "replies": [{"body": "This guy is like 18, he made all this from playing Overwatch lol", "score": 55, "replies": [{"body": "[deleted]", "score": 101, "replies": [{"body": "well gl my dude, /r/OverwatchTMZ is also praying for u", "score": 27, "replies": []}, {"body": "this is Zombs? bro you're a fellow Autist? I should've known lmao", "score": 15, "replies": []}, {"body": "No wonder you don't stream that much, gl dude", "score": 6, "replies": []}, {"body": "My dude. What makes you fundamentally feel Appl goes up? I bet against Amazon myself after reading the federal documents on lower consumption last week. Was a pretty penny.\n\nWhat makes you feel it? I'm tempted to join. Amazon is way below mean.\n\nI see the sold out of Appl phones was slower this year, and they're running out of ideas. I know next earnings in spring they're down, this idk. debating.", "score": 1, "replies": []}, {"body": "[removed]", "score": -2, "replies": [{"body": "What a gay comment. Good work automod for removing it", "score": 5, "replies": []}]}]}]}]}, {"body": "win win", "score": 4, "replies": []}, {"body": "I bet it'll push another 30$ by then", "score": 5, "replies": []}]}, {"body": "Yikes. In this volatile market, Apple reports one thing that investors don’t like, and you’re gonna take a fisting. ", "score": 204, "replies": [{"body": "He best pray to God they don't use the t word.", "score": 66, "replies": [{"body": "Tranny? ", "score": 102, "replies": [{"body": "Tariffs, but I'm glad to see your head is in the right place", "score": 118, "replies": [{"body": "[deleted]", "score": -8, "replies": [{"body": "And how is that?", "score": 6, "replies": [{"body": "[deleted]", "score": 23, "replies": [{"body": "If a gay man like Cook can make a stock moon or crater, then I can't imagine the power trannies would have on the stock market", "score": 12, "replies": [{"body": "My god, you're on to something.", "score": 6, "replies": []}]}, {"body": "Because a serious investor meeting that has someone actually mention transvestites, something completely unrelated to technology, would be indicative of some serious psychological issues?\n\nUnless the new iPhone XI performs gender reassignment surgery in which case you'd better pick up two. ", "score": -1, "replies": []}]}]}]}]}]}, {"body": "I’d be very surprised if they didn’t. They produce way too much overseas and are too big of an international player to not drop a word that rhymes with shmariff. Plus - to my current understanding - I thought companies like Huawei were starting to take a bigger slice of the Chinese cellphone consumer pie than was previously thought.\nDon’t know what’ll happen, but there are definitely some variables that could give this thing big swing.", "score": 6, "replies": []}]}, {"body": "Take a fisting.", "score": 19, "replies": []}, {"body": "Fisting is $300", "score": 9, "replies": []}, {"body": "I got puts, he better pepper his anus ", "score": 1, "replies": []}]}, {"body": "What app is that? MS Office? ", "score": 116, "replies": [{"body": "Looks like Windows 95 to me ", "score": 39, "replies": [{"body": "MSPaint", "score": 33, "replies": []}]}, {"body": "He cropped out the paper clip", "score": 13, "replies": []}, {"body": "Looks like Robinhood online layout", "score": 6, "replies": []}]}, {"body": "I heard Tim Cook and Bezos are hung like a horse. Best lube up really well.", "score": 86, "replies": [{"body": "Tim Cook’s stage name is Dirk Diggler, so best be prepared", "score": 27, "replies": []}, {"body": "i met bezos and can confirm there was a redwood-like bulge almost all the way to his knee", "score": 1, "replies": []}]}, {"body": "Amzn will offset the IV crush on those Apple calls. Unless Apple goes to 240. I would've put it all in Amzn but I dont have 100k and my laptop doesn't run on Windows95", "score": 49, "replies": [{"body": "Agree, unless Apple hits near all time highs, the crush will hurt.  Smarter play would be to go further out - 11/23 or 11/30 calls would negate most of the IV crush and see the buyback window reopen.  I'm long $13k worth of 212.5 11/23 calls.  Essentially same breakeven as the OP, with a third of the IV.", "score": 20, "replies": [{"body": "Even better with all that capital why not open itm calls and day trade it if it pulls back and reverses just get out right? (If I had 100k this is what my alternative play would be)", "score": 5, "replies": []}, {"body": "Where do you find IV info while buying?", "score": 0, "replies": []}, {"body": "Buybacks never stopped.", "score": -3, "replies": [{"body": "Blackout window reopens a few days after earnings.", "score": 1, "replies": [{"body": "Show me a circular or one document showing that there is buyback blackout for Apple", "score": -1, "replies": []}]}]}]}]}, {"body": "why does this look like you typed it up on ms wordpad circa 1998", "score": 74, "replies": [{"body": "It’s retro UI. Fucking lit bruh 🙌", "score": 28, "replies": []}, {"body": "Pixels are expensive.", "score": 9, "replies": []}, {"body": "Whatup with those jaggies!?!?", "score": 1, "replies": []}]}, {"body": "What did you clear on your 100k tesla yolo?", "score": 28, "replies": [{"body": "[deleted]", "score": 58, "replies": [{"body": "no wonder you're dumb enough to yolo $100k on an FD... you jst made a fuck ton", "score": 61, "replies": [{"body": "Classic gambler’s fallacy", "score": 55, "replies": []}]}, {"body": "Nice!", "score": 7, "replies": []}, {"body": "absolute madman", "score": 7, "replies": []}, {"body": "Put some away for the taxman ", "score": 4, "replies": [{"body": "The larger your losses the bigger your write offs on taxes, that’s my play ", "score": 1, "replies": [{"body": "You can only write off $3000 per year. ", "score": 1, "replies": []}]}]}]}]}, {"body": "only down 20% on amazon you musta bought recently. god fuck i wish i was only down 20% on amazon", "score": 53, "replies": [{"body": "yeah for sure im down 99% on amazon personally. $35k POOF GONE tears", "score": 8, "replies": [{"body": "For real? Pics for uptoads man, that sucks tho", "score": 5, "replies": []}]}]}, {"body": "Mobile screenshot please so we can avoid the \"inspect element\" fraud we usually get subjected to. ", "score": 55, "replies": [{"body": "[deleted]", "score": 68, "replies": [{"body": "Seems legit", "score": 19, "replies": []}, {"body": "The mad man. Good luck.", "score": 17, "replies": []}, {"body": "Good lord, 5 figure loss makes my eyes water", "score": 18, "replies": []}, {"body": "Bruh, the theta burn alone isnt worth it", "score": 6, "replies": [{"body": "They’re foxtrot deltas \n\nOf course they’re a shit idea ", "score": 4, "replies": []}, {"body": "Its an FD he will be fine", "score": 1, "replies": []}]}, {"body": "Good luck ", "score": 2, "replies": []}, {"body": "Amzn is way way up, congrats ", "score": 1, "replies": []}, {"body": "That’s not 100k in aapl u fag", "score": -5, "replies": []}, {"body": "Why?? After AMZN already rallied $100. Why not get the calls when it was $1500", "score": -12, "replies": [{"body": "why didnt he buy apple at $20?", "score": 26, "replies": []}]}]}]}, {"body": "RemindMe! 2 days", "score": 23, "replies": [{"body": "RemindMe! 2 days", "score": 7, "replies": [{"body": "RemindMe! 2 days", "score": 3, "replies": [{"body": "RemindMe! 2 days", "score": 5, "replies": [{"body": "Remind! 2 days", "score": 5, "replies": [{"body": " RemindMe! 2 days ", "score": 3, "replies": []}, {"body": "RemindMe! 2 days", "score": 3, "replies": [{"body": "RemindMe! 2 days", "score": 1, "replies": []}, {"body": "RemindMe! 2 days", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "RemindMe! 2 days", "score": 1, "replies": [{"body": "Remind me! 2 days", "score": 1, "replies": [{"body": "Remind me! 2 days", "score": 1, "replies": []}, {"body": "Remind me! 2 days", "score": 1, "replies": []}, {"body": "RemindMe! 2 days", "score": 1, "replies": []}, {"body": "Remind me! 2 days", "score": 1, "replies": []}, {"body": "RemindMe! 2 days", "score": 1, "replies": [{"body": "> RemindMe! 2 days\n\nRemindMe! 2 days", "score": 1, "replies": []}]}, {"body": "RemindMe! 2 days", "score": 1, "replies": [{"body": "RemindMe! 2 days", "score": 1, "replies": [{"body": "RemindMe! 2 days", "score": 1, "replies": [{"body": " RemindMe! 2 days ", "score": 1, "replies": [{"body": "RemindMe! 2 days", "score": 1, "replies": [{"body": "RemindMe! 2 days", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Remind me! 2 days", "score": 1, "replies": []}, {"body": "RemindMe! 2 days", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "RemindMe! 2 days", "score": 1, "replies": []}, {"body": " RemindMe! 2 days ", "score": 1, "replies": []}]}, {"body": "RemindMe! 2 days", "score": 1, "replies": [{"body": "RemindMe! 2 days", "score": 1, "replies": []}, {"body": "RemindMe! 2 days", "score": 1, "replies": []}, {"body": "RemindMe! 2 days", "score": 1, "replies": []}]}, {"body": "RemindMe! Friday 8 am", "score": 1, "replies": []}, {"body": "RemindMe! 2 days", "score": 1, "replies": [{"body": "RemindMe! 2 days", "score": 1, "replies": []}, {"body": "RemindMe! 2 days", "score": 1, "replies": [{"body": "RemindMe! 1 day", "score": 1, "replies": []}]}]}, {"body": "RemindMe! 2 days", "score": 1, "replies": [{"body": "RemindMe! 1 day", "score": 1, "replies": []}, {"body": "RemindMe! 2 days", "score": 1, "replies": []}]}, {"body": "RemindMe! 2 days", "score": 1, "replies": [{"body": "RemindMe! 2 days", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "RemindMe! 2 days", "score": 1, "replies": []}]}, {"body": "RemindMe! 2 days", "score": 1, "replies": [{"body": "RemindMe! 2 days", "score": 1, "replies": [{"body": "RemindMe! 2 days", "score": 1, "replies": []}, {"body": "RemindMe! 2 days ", "score": 1, "replies": []}]}]}, {"body": "RemindMe! 39 hours", "score": 1, "replies": [{"body": "RemindMe! 40 hours", "score": 1, "replies": []}, {"body": "RemindMe! 38 hours", "score": 1, "replies": []}]}, {"body": "RemindMe! 2 days", "score": 1, "replies": [{"body": "RemindMe! 2 days", "score": 1, "replies": []}, {"body": "> RemindMe! 2 days\n\nRemindMe! 2 days", "score": 1, "replies": []}]}, {"body": "RemindMe! 2 days", "score": 1, "replies": []}, {"body": "RemindMe! 2 days\n\n", "score": 1, "replies": []}, {"body": "RemindMe! 2 days\n\n", "score": 1, "replies": []}, {"body": "RemindMe! Friday 8 am", "score": 1, "replies": [{"body": "RemindMe! 2 days", "score": 1, "replies": []}]}, {"body": "RemindMe! 2 days", "score": 1, "replies": []}, {"body": "RemindMe! 2 days", "score": 1, "replies": []}, {"body": "RemindMe! 2 days", "score": 1, "replies": []}, {"body": "RemindMe! 2 days", "score": 1, "replies": []}, {"body": "RemindMe! 1 day", "score": 1, "replies": []}, {"body": "RemindMe! 2 days", "score": 1, "replies": []}]}, {"body": "Good luck OP. I hope AAPL made it cause if not, tech could crap out again.", "score": 17, "replies": [{"body": "Uh...not just tech—if Apple misses or guides lower, this whole fucking market is gonna shit the bed. ", "score": 23, "replies": [{"body": "Fingers. Are. Crossed.", "score": 10, "replies": []}, {"body": "What's funny is is people think Apple will save the markets, that should be their sign how fucked things actually are. 😂🤣", "score": 6, "replies": [{"body": "look at march/april and also july/aug\n\ntech was lookin scary until AAPL reported", "score": 2, "replies": []}, {"body": "Oh we all know things are fucked. But this is WSB and short term gains are to autists like cake is to a pregnant woman. ", "score": 1, "replies": [{"body": "I fucking love cake, have an uppy!", "score": 1, "replies": []}]}]}, {"body": "Jokes on you. Im in weedstocks and theyre already in the toilet.", "score": 2, "replies": []}, {"body": "i just got an erection", "score": 1, "replies": []}, {"body": "Apple is one of the only stocks that didn’t tank 10%-15% and it didn’t even save the market. ", "score": 1, "replies": []}]}, {"body": "Apple will need to post record setting numbers or else we're all tumbling. ", "score": 1, "replies": []}]}, {"body": "Lmao wtf", "score": 33, "replies": []}, {"body": "post your loot or homeless sign in a few days. ", "score": 14, "replies": []}, {"body": "It’s not worth it man just get some Jan 2020 $250s if you have $100k to throw at AAPL calls", "score": 22, "replies": [{"body": "Think it’s too late now.", "score": 22, "replies": [{"body": "Here's a tip: If you delete the app and reinstall it, it'll reset your funds.", "score": 16, "replies": [{"body": "Only on Tuesday’s if you hit start over while zooming in. Factory reset.", "score": 3, "replies": []}]}, {"body": "30 day refund ", "score": 10, "replies": [{"body": "Only if it is in its original packaging.", "score": 3, "replies": []}]}]}]}, {"body": "you're doing that when discretionary spending in china is the worst it's been in a while? there's almost a 100% chance that they will guide lower than expected\n\ngood luck sir ", "score": 29, "replies": [{"body": "So why dont you have puts, if its almost 100% chance to make money ?", "score": 28, "replies": [{"body": "Take your pick of headlines, each one is equally plausible given identical AAPL earnings:\n\n1. AAPL crashes lower on declining Chinese demand\n2. AAPL slightly lower in after hours after hints of Chinese slowdown\n3. AAPL flat in after hours as higher margins on new phones offsets China concerns\n4. AAPL modestly higher after Chinese demand not as slow as feared\n5. AAPL rockets higher as ASPs on new iPhones rises, Chinese demand better than feared", "score": 8, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "holy fuck nice\n\nthoughts on TNDM earnings?", "score": 6, "replies": [{"body": "BUY", "score": 7, "replies": [{"body": "SELL", "score": 3, "replies": []}]}]}]}]}, {"body": "P R I C E D  I N ", "score": 6, "replies": [{"body": "remindme! -1 days", "score": 3, "replies": [{"body": "YO DUDE", "score": 1, "replies": []}]}]}, {"body": "Do you really think they'll report a loss cuz of the tariffs? I'm super nervous about tomorrow", "score": 1, "replies": [{"body": "tarifffs are the most overblown crap i have ever seen", "score": 7, "replies": [{"body": "In my experience when buying lots of stuff from China or South Korea, the shipper labels the package as worth $20 and a gift and there are no tariffs, when in reality I was buying $1000-2000 worth of stuff at a time.\n\nEasy to get around the tariffs.", "score": 3, "replies": [{"body": "Something tells me it is easier for a small company to fly that under the radar successfully than it would be for Apple.  Hell, don't they basically fly entire planeloads of just iPhones around the launch time?  Good luck declaring those for $20", "score": 18, "replies": []}]}]}]}, {"body": "Iphones aren't discretionary spending. It's like milk, you need that shit. ", "score": 0, "replies": [{"body": "that's the dumbest shit i've ever heard", "score": 0, "replies": [{"body": "Heard of a joke? ", "score": 1, "replies": []}]}]}]}, {"body": "Calls or puts?", "score": 9, "replies": [{"body": "Calls pretty sure", "score": 13, "replies": [{"body": "how much would it cost to roll these?", "score": 3, "replies": [{"body": "“Rolling” means terminating your current position and buying future dates.\n\nThat’s mean he’d eat all the losses he has right now, listed in the post. -13k in Amazon alone.", "score": 1, "replies": []}]}, {"body": "Uh oh...", "score": 1, "replies": []}]}, {"body": "ok", "score": 7, "replies": []}]}, {"body": "Nephew... god bless homie and good luck.\n\nIf this is a recoverable loss for you god speed.\n\nif not then I would've recommended something like maybe selling puts on AAPL or something like that.  Not super sexy but you could've got like 3-5% in a week with covered puts, or like 10% with naked puts (but you could also get reamed that way, too).", "score": 20, "replies": []}, {"body": "This has aged very well. ", "score": 7, "replies": []}, {"body": "good luck dude, it would genuinely make me happy seeing this make it through. \n\nF", "score": 3, "replies": []}, {"body": "Naw it's gonna be pure money, solid job!", "score": 6, "replies": []}, {"body": "Joining you on AAPL bro, good luck", "score": 4, "replies": []}, {"body": "I hope your net worth is over 250k, otherwise this play is the dumbest thing I’ve seen, it’s bad if your lose, and it’s bad if you win, as it will convince you this was a good idea and you’ll do it again", "score": 100, "replies": [{"body": " /r/personalfinance sounds like your type of sub", "score": 111, "replies": [{"body": "Can’t buy FDs if you have no more tendies. ", "score": 28, "replies": []}]}, {"body": "This should be down voted and that it's not being down voted is worrisome.", "score": 23, "replies": [{"body": "This sub has gone sawft", "score": 18, "replies": [{"body": "October has tamed us.", "score": 1, "replies": []}]}]}, {"body": "Also IV crush is a thing, my MA calls went down 50% yesterday while MA went down 2%", "score": 13, "replies": [{"body": "I feel everyone should learn what IV crush is before trying to play earnings lol", "score": 19, "replies": [{"body": "Yeah and even just FDs. IV can drop significantly just from Wednesday morning to Wednesday EoD. Today was one of those days.", "score": 5, "replies": [{"body": "What is a max IV you would trade with", "score": 2, "replies": [{"body": "I always do diagonal call or put spreads to get around IV crush on earnings. Like buy 220C Nov 9 and Sell 230C Nov 2.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Rip", "score": 9, "replies": [{"body": "He sold them. ", "score": 3, "replies": [{"body": "wheres it say that?", "score": 2, "replies": []}]}]}, {"body": "zombs, i knew it, you were autistic", "score": 5, "replies": []}, {"body": "This is FSCOMEAU all over again, I want that leaf back", "score": 4, "replies": [{"body": "Is that guy dead or just banned ?", "score": 2, "replies": [{"body": "Isn't he just banned?", "score": 2, "replies": []}]}]}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Click here to find more YOLOs](https://new.reddit.com/r/wallstreetbets/search?sort=new&restrict_sr=on&q=flair%3AYOLO). \n\nYOLO flair is for dank trades only. If you misused the flair please change it. Mods have been notified of this thread.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 6, "replies": []}, {"body": "oh my god you have 100k just lying around to gamble like this? first off congrats on that achievement, second of all - GOOD LUCK hope you BANK tendies!!!!!", "score": 5, "replies": [{"body": "I like to see this. ", "score": 2, "replies": []}]}, {"body": "You deserve to be in the news. FDs in 100K. You can retire. Good luck", "score": 5, "replies": [{"body": "Nah with that IV he will 5x his money max most likely", "score": 2, "replies": [{"body": "That's still a lot of fucking money", "score": 6, "replies": []}]}]}, {"body": "How much are you down now OP? ", "score": 7, "replies": []}, {"body": "I fucking love it. ", "score": 3, "replies": []}, {"body": "You are so close to break even on both. One more day like today and you have it made. ", "score": 3, "replies": []}, {"body": "We just had 2 green days, odds are the bears aren't dead yet", "score": 3, "replies": [{"body": "Fingers crossed they have returned to hibernation ", "score": 1, "replies": []}]}, {"body": "Prepare your anus", "score": 3, "replies": []}, {"body": "Did you sell yet? At least sell AMZN, jeezus!", "score": 3, "replies": []}, {"body": "Sell Amazon NOW. ", "score": 3, "replies": []}, {"body": "congrats Zombs \n", "score": 3, "replies": [{"body": "how much he make?", "score": 2, "replies": [{"body": "[About 64K*](https://www.reddit.com/r/wallstreetbets/comments/9tbrzg/100k_in_fds_sold_sorry_my_brothers/)", "score": 5, "replies": [{"body": "good stuff.", "score": 2, "replies": []}]}]}]}, {"body": "Tell me you got out of your AMZN you lucky bird", "score": 3, "replies": [{"body": "nevermind, he is safe :) [https://www.reddit.com/r/wallstreetbets/comments/9tbrzg/100k\\_in\\_fds\\_sold\\_sorry\\_my\\_brothers/](https://www.reddit.com/r/wallstreetbets/comments/9tbrzg/100k_in_fds_sold_sorry_my_brothers/)", "score": 2, "replies": []}]}, {"body": "Yep\n\nYou gonna make it", "score": 3, "replies": []}, {"body": "...all these comments and nobody has asked what strikes?\n\nWhat strikes?", "score": 7, "replies": [{"body": "Look at the break eve price vs.  cost of option ", "score": 11, "replies": []}]}, {"body": "Update this Friday please. Strikes on these bad boys?", "score": 3, "replies": [{"body": "Looks like hes at 1615 and 215", "score": 1, "replies": []}]}, {"body": "Godspeed bro, my dick is twitching. Please post returns even when you lose. ", "score": 2, "replies": []}, {"body": "RemindMe! 2 days", "score": 2, "replies": []}, {"body": "Remindme! 2 days", "score": 2, "replies": []}, {"body": "Good Luck man", "score": 2, "replies": []}, {"body": "I sold on tuesday, didn't want to risk my options becoming worthless. However I do think it'll break even at least at $223", "score": 2, "replies": []}, {"body": "shit, man\n\ngood luck", "score": 2, "replies": []}, {"body": "Fortune favors the bold. GL . ", "score": 2, "replies": []}, {"body": "Aaaaaand it’s gone ", "score": 2, "replies": []}, {"body": "RemindMe! 2 days", "score": 2, "replies": []}, {"body": "Fuck dude, Apple's totally fessing up to some multi billion dollar settlements with this ER. ", "score": 2, "replies": []}, {"body": "And here I am, worrying about $43 in 5.5 11/16 SNAP puts. Godspeed.", "score": 2, "replies": []}, {"body": "There's always time to change your mind. This is a crazy bet, I hope it's not your whole account.", "score": 2, "replies": []}, {"body": "Just play roullette or something man", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "His ass is already spread ", "score": 1, "replies": []}]}, {"body": "I think there may be some sell the news on aapl, even if earnings are fantastic. My DD :\n\nLook how well aapl did immediately following last two earnings.\n\nLook how well aapl held up in October.\n\nI'm thinking traders were loading up on aapl last few weeks for hopes of another earnings blow out and to sell after. Aapl is an over crowded trade right now as it is/maybe was the last bastion of hope.\n\nI'm personally buying puts today on it, I don't expect much higher prices from them, like who doesn't already own aapl, that wants to own aapl? ...but fuck who knows man. ", "score": 2, "replies": [{"body": "What exp are you doing ?", "score": 1, "replies": [{"body": "Fucking work was so busy I completely forgot about my degenerate gambling addiction. And fuck me, aapl is down, but of course it is. They would've been FDs :(", "score": 1, "replies": [{"body": "I got 11/2 210 Ps ❤️", "score": 1, "replies": []}]}]}]}, {"body": "good luck", "score": 2, "replies": []}, {"body": "You beautiful bastard", "score": 2, "replies": []}, {"body": "I think you went the wrong way with this, but what the fuck do I know. ", "score": 2, "replies": []}, {"body": "Goddamn don't have enough popcorn for this", "score": 2, "replies": []}, {"body": "Rip", "score": 2, "replies": []}, {"body": "How much is something like this worth??", "score": 3, "replies": [{"body": "$100k", "score": 6, "replies": []}, {"body": "??", "score": -1, "replies": []}, {"body": "??", "score": -1, "replies": []}]}, {"body": "This is dumb as fuck.  Sure, it will be awesome if it works in the same way robbing a bank and getting away with it would be awesome.  It will also suck in the same way not getting away with that robbery would suck.", "score": 3, "replies": [{"body": "\"It would be awesome like it was awesome and it would suck like it would suck\" Thank you for your contribution.", "score": 4, "replies": []}]}, {"body": "I'm in for 1k. Hope you make some mils", "score": 2, "replies": []}, {"body": "This is either fake or he’s so autist he’s recreating his rape scene with pointallism.", "score": 2, "replies": []}, {"body": "Good luck nephew\n\n&#x200B;", "score": 1, "replies": []}, {"body": "wishing you the best mang", "score": 1, "replies": []}, {"body": "Godspeed", "score": 1, "replies": []}, {"body": " RemindMe! 2 days ", "score": 1, "replies": []}, {"body": "Is this what you do instead of playing ow zombs?", "score": 1, "replies": []}, {"body": "Bought AAPL puts, good luck brother", "score": 1, "replies": []}, {"body": "Shenanigans.  I call shenanigans.", "score": 1, "replies": []}, {"body": "Savage AF! I think you got this played right.", "score": 1, "replies": []}, {"body": "Thursday gonna be red should have waited to buy them", "score": 1, "replies": []}, {"body": "I love it, get that money son!!! I wish I could afford to follow you even the slightest. My favorite call I ever bought was apple before the last earnings call.", "score": 1, "replies": []}, {"body": "My man, I really hope you spend a couple bucks on a hedge. Grab a few OTM QQQ puts so you’ll at least have something if this goes against you. ", "score": 1, "replies": []}, {"body": "Good luck, I'm expecting a miss so I have puts.even if they meet expectations, they are already trading high. Tesla was trading low, so was Facebook. Apple's chart is on the edge of falling with the rest of the market.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "The one where they increased the price to $1500 per phone and sold out of it?", "score": 2, "replies": []}]}]}, {"body": "Why AMZN? Would good AAPL ER bring AMZN up?", "score": 1, "replies": []}, {"body": "I’m excited to watch this from the sidelines.", "score": 1, "replies": []}, {"body": "RemindMe! 2 days \"Is this guy alive?\"", "score": 1, "replies": []}, {"body": "You're about to get fucked so good", "score": 1, "replies": []}, {"body": "Honestly you only have about a 20% chance of profiting here.", "score": 1, "replies": [{"body": "31% based on the prices at close.", "score": 3, "replies": []}, {"body": "How can you calculate chance of profit? ", "score": 1, "replies": []}]}, {"body": "In.", "score": 1, "replies": []}, {"body": "Remindme! 2 days", "score": 1, "replies": []}, {"body": "GL!!", "score": 1, "replies": []}, {"body": "There is this great game called roullette.  It offers fantastic odds.", "score": 1, "replies": []}, {"body": "The spirit of WSB lives! This is what a YOLO looks like! I'm rooting for you.", "score": 1, "replies": []}, {"body": "$1000 says he wins, if we're betting", "score": 1, "replies": []}, {"body": "[https://www.youtube.com/watch?v=8sGKbLjc3gg](https://www.youtube.com/watch?v=8sGKbLjc3gg)\n\n&#x200B;\n\nskip to 2:20 onwards. ", "score": 1, "replies": [{"body": "what is this supposed to be telling me?", "score": 1, "replies": []}]}, {"body": "Amazon is up today - I really hope you are selling prior to earnings if green, there was some moneyflow out of Apple yesterday", "score": 1, "replies": []}, {"body": "If its up before earnings today take cash out your original 100k and let the rest ride.", "score": 1, "replies": []}, {"body": "Damn", "score": 1, "replies": []}, {"body": "RemindMe! 1 day", "score": 1, "replies": []}, {"body": "That theta decay :O. Just holding FD's till friday xD", "score": 1, "replies": []}, {"body": "Take the gains bro", "score": 1, "replies": []}, {"body": "Hopefully it's not more than you can afford to lose..", "score": 1, "replies": []}, {"body": "Look, I hope apple beats too but I think it's kind of obvious you want to play the next quarter as then you will include Christmas sales!\n\n  \n\n\nWe know they can blame all kinds of crap on China and this or that when they release earnings and it drops or doesn't rush up.\n\n  \n\n\nBut good luck, I'd say halve that position and grab Leaps for next year and make bank after Christmas.", "score": 0, "replies": []}, {"body": "iV CrUsH", "score": 0, "replies": []}, {"body": "can anybody tell me how the \"current price\" of an option is determined? thx. am thinnking of buying some FDs too", "score": 0, "replies": [{"body": "there are 3 basic things that determine option price. Strike price (gap between stock price and stike price), time (how long till option expire), and volatility (how frequent does it go up and downdrastically). \n\nBasically it is only best to buy fd under the following circumstances\n-near the money (if the stock price isnt near your otm strike price then it will instantly become worthless)\n-buy the day before you think the event is going to occur. Events out of the blue, not earning reports. So you dont pay for time you dont need\n-volatility is low ", "score": 1, "replies": [{"body": "first of all thanks for answering my dude. What would be events that might occur? And where do I get to know those? Isn't this some sort of insider trading?\n\nAlso, is the option more expensive if it's volatile? Is there a way to determine an options \"current price\"? Like with a calculator or formula? Let's take [this](https://i.imgur.com/OjGBnhw.jpg) option as an example. Please correct me if I misunderstood anything.\n\n1615$ is the strike price of the option which means if the price of the amazon stock exceeds 1615$, the option-holder can exercise the option.\n\nAVG COST is the cost of the contract itself (the premium?).\n\nAMZN BREAKEVEN PRICE is the price the amazon stock needs to reach for the option-holder to have a profit of +-0$ and is calculated by (Strike-Price + AVG COST).\n\nEquity is = (Current Price * 100 * Contracts)\n\nThe guy paid (AVG COST * 100 * Contracts) for the options (= 60.300$)\n\nEXP DATE means that the option has to either be exercised or expires worthless (?)\n\nWhat I don't understand is how the Option's initial price and current price are determined. Like how do I know how much I'd have to pay for an option? And how do I know it's price... let's say 1 week after I bought the option? How can I calculate these prices?\n\nthanks in advance. even if you don't answer lol", "score": 1, "replies": []}]}]}, {"body": "Don't AAPL stocks usually go down after earnings?", "score": 0, "replies": []}, {"body": "I wish i understood more, do any of you have any resources that i can learn from? ", "score": -2, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Omg that's crazy 🤯🤯🤯 thank you so much for explaining. It sound like a big deal. Im hoping for the best. ", "score": -3, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "Lol 🤣🤣🤣🤣", "score": -3, "replies": [{"body": "Why downvotes? ", "score": 1, "replies": []}]}]}]}]}, {"body": "Ban.", "score": 3, "replies": []}]}, {"body": "I can’t wait to laugh at you if you lose this money.\n\nBest of luck, but you are truly a moron for doing this ", "score": -2, "replies": [{"body": "Cmon man send some good vibes", "score": 4, "replies": []}]}, {"body": "Noob Question:  \n\n\nWhats an FD? Options? ", "score": -5, "replies": [{"body": "[removed]", "score": 11, "replies": [{"body": "Thank you", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Many thanks", "score": 1, "replies": []}]}, {"body": "French dicks", "score": 4, "replies": [{"body": "Thanks ", "score": 1, "replies": []}]}, {"body": "Fifth Dimension ", "score": 3, "replies": [{"body": "Ty", "score": 1, "replies": []}]}]}, {"body": "Why buy calls right now when you WILL get IV crushed?", "score": -6, "replies": [{"body": "Lol ", "score": 5, "replies": []}, {"body": "You must be new here.  Ban.", "score": 3, "replies": []}]}]}
