{"title": "The Big Flip - What the yield curve inversion means for your money", "selftext": "Finally, the yield curve has inverted. It’s something we were all expecting to happen ever since the Fed announced its rate hikes last month. The two-year yield settled in at 2.430% compared to the 2.374% yield of the 10-year U.S Treasury note last Thursday. This is the first time the two-year yield closed above the 10-year yield since 2019. Adding to this, the spread between [5-year and 30-year bonds inverted](https://www.bloomberg.com/news/articles/2022-03-28/treasury-slide-sees-5-30-spread-invert-for-first-time-since-2006) for the first time since 2006! An inverted yield curve is a very prominent indicator for predicting an upcoming recession.\n\nBut, before we jump into the implications of the yield curve inversion, it’s important to understand what a yield curve is, how it predicts a recession, and what the previous data tells us.\n\nhttps://preview.redd.it/bu3pugvy0is81.png?width=500&format=png&auto=webp&s=e985edd7afffc4cb812239073c08bef5b2bde863\n\n**What is the Yield Curve?**\n\nThe yield curve is just a graph showing the relationship between the short-term and long-term interest rates of the U.S Treasury bond. The bond here is the promise between you and the U.S govt that says if you loan some money now (by buying the bond), they will give it back to you later with an added interest.\n\nhttps://preview.redd.it/jzej4we01is81.png?width=1272&format=png&auto=webp&s=20ea73ab9a79b2b59ce278860bfdecae9bf26440\n\nThe above chart shows how a normal yield curve would look. The simple logic here is that it’s riskier for you to buy a longer-term bond *(the future is uncertain because of all the unknowns, good and bad, that could happen over years of time)* and you are rewarded proportionally for taking the larger risk. For eg., you would get a significantly lower interest rate if you are investing for 1-year vs 20-year as it’s generally riskier to stash away your money for a longer time period.\n\nhttps://preview.redd.it/xxjaz9411is81.png?width=897&format=png&auto=webp&s=a69337c54556c499533e7da431ed0ed36b75beb8\n\nBut the yield curve is not always positive. If the long-term and the short-term rates get closer together, the yield curve become flat. Finally, if the short-term rates are higher than the long-term rates, the yield curve becomes inverted.\n\nThe yield curve becomes inverted when a lot of people are worried about the short-term economy. In theory, you would demand a higher return for taking on a higher risk. So if the yield rate for a short-term bond is higher than a longer-term bond, it implies that investors are so worried about the short-term economic outlook (*i.e they think the present is much riskier than the future*) that they are willing to invest in a longer-term bond at a lower rate.\n\n**Where does the yield curve stand now?**\n\nhttps://i.redd.it/6buvv2k41is81.gif\n\nThis excellent visualization by [Eeagli](https://www.eeagli.com/) shows how the yield curve has changed over the past 6 months. The yield curve hasn’t completely inverted yet, but still, it’s a cause for concern.\n\nhttps://preview.redd.it/0t4lmyp51is81.png?width=905&format=png&auto=webp&s=22f9521b277b4bf5c4f678f84d7f937fee7dbd8d\n\nThe drastic difference that occurred in just the last year in the yield rates is visible in the above chart! Ideally, the yield rates are supposed to be in increasing order like it was in Apr 2021. Now the 2-year yield rate is more than the 10-year one and almost equal to the 30-year yield rate.\n\n**Does Yield Curve Inversion Predict a Recession?**\n\nThe yield curve is considered one of the best signals that are currently available for predicting a recession. As per the research done by FRBSF,\n\n>*Every U.S. recession in the past 60 years was preceded by a negative term spread, that is, an inverted yield curve. Furthermore, a negative term spread was always followed by an economic slowdown and, except for one time, by a recession. -* [*FRBSF*](https://www.frbsf.org/economic-research/publications/economic-letter/2018/march/economic-forecasts-with-yield-curve/)\n\nhttps://preview.redd.it/s7oyvu971is81.png?width=578&format=png&auto=webp&s=9479357a888a4ef32f0af4b7586252a4afd8e07f\n\nWhile the above results are for the spread between 1 and 10-year rates (which is still positive now), research done on 2-year and 10-year spreads shows a similar trend. According to [Commonwealth Financial Network](https://www.kiplinger.com/investing/stocks/604484/inverted-yield-curve-stocks), the 10-and-2 yield curve has inverted 28 times since 1900, and in 22 of those instances, a recession has followed.\n\nWhile there is certainly statistical merit for yield curve in predicting a recession, where experts are conflicted is in the type of spread that should be used. There are various different spreads we can consider (3-month vs 10-year, 1-year vs 10-year, 2-year vs 10-year, etc.). All of these provide different probabilities and timelines for an upcoming recession. For example, if you consider the 3-month vs 10-year spread (positive as of now), it has predicted every recession with [100% accuracy](https://www.youtube.com/watch?v=DCQwiF0J7hw&ab_channel=CNBC) in the last 50 years.\n\nhttps://preview.redd.it/6gphtpg81is81.png?width=1272&format=png&auto=webp&s=d1e9c6bf2f2fa0e9783a3edae66694b0fd900299\n\n**What’s the best thing to do now?**\n\nGiven that, an inverted yield curve is a reliable indicator of a looming economic downturn, what should we do to best prepare our portfolios incase a recession hits. The worst thing you can do now is to panic - especially when the yield curve inverts.\n\nThe problem is that even though yield curve inversion indicates a recession, it does so long before the actual recession hits. For eg, the tech bubble burst in Mar’01 but the yield curve had inverted almost 3 years before that (34 months to be exact). The same thing occurred again during the 2008 financial crisis when the yield curve inverted as early as 2005.\n\nAccording to research conducted by[ LPL Financial,](https://www.kiplinger.com/investing/stocks/604484/inverted-yield-curve-stocks) Yield curve inversion can be bullish for stocks, and the last four times the 2-and-10 yield curve inverted, the S&P 500 was up an average of 28.8% before it peaked!\n\nhttps://preview.redd.it/099pv1m91is81.png?width=836&format=png&auto=webp&s=ab2a46fed2da581a022e2183c1d8df97e040e156\n\nAdding to this, I had done an [**extensive analysis**](https://marketsentiment.substack.com/p/recession-primer?utm_source=substack&utm_campaign=post_embed&utm_medium=web) on how the stock market performs during and following a recession.\n\nhttps://preview.redd.it/g8n1n0ba1is81.png?width=889&format=png&auto=webp&s=239cdedaf68ca0b1d800ed8a2daf127495e06a25\n\nOn average, the U.S recessions lasted only 10 months and the market returned a +1.7% in return. What is even more interesting is the market performance just following the recession.\n\nhttps://preview.redd.it/e4brta3b1is81.png?width=899&format=png&auto=webp&s=260627c7eb7e31e4d74fc215e905e4937b9d7c24\n\nAfter the end of the recession, in just one year, you would have made money in 85% of the cases. And after 3 years, you would have been **in the green in 100% of the cases!**\n\n**Conclusion**\n\nPredicting future economic developments is a tricky business! There are 100’s of factors that are different than the last time, but an inverted yield curve is one of the most reliable predictors we have for accurately predicting a recession.\n\nBut as we could see from the analysis, it takes a while for the economy to finally go into recession after the curve has been inverted and you will miss out on the gains till then if you stay out of the market. If you are feeling truly adventurous, you can always try keeping a certain portion of your portfolio out and try to buy the [inevitable dip.](https://marketsentiment.substack.com/p/is-waiting-for-a-dip-the-best-investment?s=w)\n\nFor the rest of us, even if the recession hits, the best strategy is to stay invested and weather the storm.", "id": "tzsfm0", "created_utc": 1649508236.0, "score": 595, "upvote_ratio": 0.96, "num_comments": 99, "comments": [{"body": ">For example, if you consider the 3-month vs 10-year spread (positive as of now), it has predicted every recession with 100% accuracy in the last 50 years.\n\nCampbell Harvey was the original person to research and publish the yield curve, but he primarily uses 5y-3m and as a secondary 10y-3m.  I've never seen him use the 10y-2y and for good reason, because it's inaccurate.\n\nI feel it is a bit disingenuous that you stopped where you did.  The 10y-3m and 5y-3m is not close to inverted right now.  The conclusion should have factored that in.", "score": 54, "replies": []}, {"body": "Patiently waiting for the fed to remove nine fucking trillion from their balance sheet.", "score": 78, "replies": [{"body": "They will not be able to do all of it before something breaks and forces them to stop like 2018.", "score": 9, "replies": [{"body": "With the risk of hyperinflation at hand I do not really like this unstoppable force meeting immovable object business that is unfolding", "score": 6, "replies": []}, {"body": "I would begrudgingly agree with this. Short-sighted possibility 😒. Aka Fed put.", "score": 1, "replies": []}]}, {"body": "Asking the real questions. Been waiting since the Great recession when the balance was just shy of a trillion.", "score": 5, "replies": [{"body": "Ha! It’s a massive scam. Bullard said in 2012 the fed would never monetize the US debt and bernanke said, in front of congress, that the fed needs to return its balance sheet back to a respectable level of under one trillion. \n\nLet’s face the facts …. If the fed removes nine trillion we take a 70% haircut in the market. They do something prudent and raise rates to 5% and there won’t be a market left. \n\nThe sheer incompetence of one body of non elected members is astounding. Short the fed at all costs.", "score": 0, "replies": []}]}]}, {"body": "Buffet's HP purchase doesn't care about no yield curve inversion.", "score": 93, "replies": [{"body": "Nor do i. I saw on youtube that stocks only go up", "score": 51, "replies": [{"body": "I know for sure stonks only go up.  Not sure if stocks do too but probably.", "score": 9, "replies": [{"body": "All we need to know is how many rockets this means🚀🚀🚀", "score": 4, "replies": [{"body": "Four?", "score": 7, "replies": [{"body": "As long as the 🚀 can't invert, we're good.", "score": 2, "replies": []}]}]}]}]}, {"body": "I don't understand, yet I chuckle at this statement", "score": 9, "replies": []}, {"body": "Being in the laptop business idk why would Buffet even buy HP. The products are craps, the customer service is crap. I’d just buy more Apple or buy Dell before buying HP. Hundreds of laptops/servers pass thru my hands every week and HP stuffs is just the worst.", "score": 23, "replies": [{"body": "I didn’t know buffet took a position or acquired HP.  I agree HP produces total trash.", "score": 7, "replies": [{"body": "They have a huge market share in commercial grade products though.\n\nTheir consumer grade stuff are trash as you said.", "score": 10, "replies": [{"body": "Yes. They advertised HP to me countless times on Reddit. I tried to downvote HP add every time. I finally messaged the Ad people at HP and told them I’d never buy a HP product again. It has actually stopped showing me HP adds on Reddit.", "score": 3, "replies": []}]}]}, {"body": "While I agree on the laptop side, they're prouder of their printing business, with further development focus on 3D.", "score": 2, "replies": [{"body": "I thought HP split their PC and printer businesses?  No?", "score": 1, "replies": [{"body": "Nope, HP split in 2015 as follows:\n\n1. HP Inc which does hardware PC & Printers.\n\n2. Hewlett Packard Enterprise which does servers and other software.\n\nThen HPE further split into DXC and other, but those are other stories.\n\nYou were on point with there having been a split, though.", "score": 1, "replies": [{"body": "Ah!  So Buffet invested in the former, right?", "score": 1, "replies": [{"body": "Yeah", "score": 1, "replies": []}]}]}]}, {"body": "This isn’t true at all, assuming you’re using pride as a euphemism for percentage of revenue (I highly doubt you meant your comment literally, as no one gives a shit about the emotional state of HP management). \n\nPersonal systems represents $11.8b to printing’s $4.9b.", "score": 1, "replies": []}]}, {"body": "Teh", "score": 1, "replies": []}, {"body": "buffett lets his protégés but stocks that he himself wouldn't understand", "score": 1, "replies": []}, {"body": "Buffet likes to buy somewhat distressed companies and make them work with his existing portfolio.  I bet there will soon be a Geico-insured,  Coke-cooled HP PC that you buy with a loan from BofA via a down-payment from your Amex card.", "score": 1, "replies": []}]}, {"body": "Wait until everyone realizes that Buffett bought some TSLA. The market will go batshit insane.", "score": 3, "replies": []}, {"body": "Me holding for decades dont care either. In fact I might buy some more as it goes down.", "score": 1, "replies": []}]}, {"body": "I'm just holding and in five years I'll see where all this ended up.", "score": 22, "replies": [{"body": "*5 years later: Apes no longer trust compushare for failing to call out the discrepancyof issued stocks. Instead they decide to physically hold stock certificates. Ryan Cohen, recognizing the trend and the recent legalization of marijuana starts issuing physical gamestocks certificates with tobacco rolling paper. Memes are made of apes smoking the stock and the value hits 10,000,000 rubles.*", "score": 10, "replies": [{"body": ">*10,000,000 rubles*\n\nSo five bucks, then?", "score": 2, "replies": []}]}, {"body": "I just buy VIX", "score": 0, "replies": []}]}, {"body": "Nice write up, thanks!", "score": 29, "replies": []}, {"body": "A well written explanation of the inverted yield curve prediction of recession thesis. You should have added, however, that the inverted yield curve had predicted I think about nine of the last 5 recessions.\n\nInvestors are always looking for the one simple thing that can reliably predict market direction, but in reality there are about as many reasons as there are trades.", "score": 69, "replies": [{"body": "Which instances are you referring to when it inverted and a recession didn’t follow? I think there was one instance in the 60’s. This is saying literally every time since the 70’s:\n\nhttps://barberfinancialgroup.com/a-recent-history-of-inverted-yield-curves/", "score": 11, "replies": []}, {"body": "It is mentioned in the comment:\n\n> According to Commonwealth Financial Network, the 10-and-2 yield curve has inverted 28 times since 1900, and in 22 of those instances, a recession has followed.\n\nKeep in mind this is generous.  A recession always follows eventually.", "score": 5, "replies": [{"body": "exactly!  When a recession follows 3 years after the inversion, it's still claimed as a prediction even though it's nearly impossible to cash in on that knowledge.  What they need to do is a time dilation, that is, fade out the effect over months.  Each inversion would then have a predictive power that could lead to investment strategy.  But they prefer their binary classifier and so I ignore the inversions.", "score": 2, "replies": [{"body": "The real yield curve (the 5y-3m and 10y-3m) does have a time window and it has 100% accuracy.  Neither inverted, unlike the fake 10y-2y the news has been using.", "score": 1, "replies": [{"body": "Got any graphs of that?", "score": 1, "replies": [{"body": "You can use Fred or Tradingview.  Eg: https://fred.stlouisfed.org/series/T10Y3M", "score": 1, "replies": [{"body": "I love Fred.\n\nInteresting, tho, if I read the graph you linked correctly, there’s no recession after the 2019 inversion.  In fact, it goes positive before the recession.  I think a 100% prediction would go negative and stay negative until the recession hit, right?", "score": 1, "replies": [{"body": "Maybe it's a bug on your browser.  Are you on mobile?\n\nIt's greyed where the recession was in 2020 properly.\n\n>I think a 100% prediction would go negative and stay negative until the recession hit, right?\n\nZoom out to the other recessions and see the correlation for yourself.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "[That’s not true, the last 5 yield curve inversions were all followed by a recession for each of the last 5 recessions](https://fred.stlouisfed.org/series/T10Y2Y)\n\nEDIT: Apparently this sub can’t click on links or read charts. There was never a yield curve inversion in the last 45 years that was not followed by a recession within 9-24 months", "score": -8, "replies": [{"body": "You're misconstruing the commenters meaning.\n\n* You are correct that each of the last 5 recession were preceded by an inverted yield curve\n* The other guy is saying the yield curve has inverted 9 times in the span of time 5 recessions happened. \n\nThe takeaway being that 4 times the yield curve inverted and **didn't** predict a recession.", "score": 23, "replies": [{"body": "The sun has risen every morning before a recession.", "score": 21, "replies": [{"body": "*furiously scribbling down notes*\n\nAnd? And!?", "score": 3, "replies": []}]}, {"body": "false positive rate of 4/9", "score": 4, "replies": [{"body": "5/7 would yield again", "score": 4, "replies": []}]}, {"body": "You clearly didn’t click the link. Each of the last 5 yield curve inversions were followed by a recession (marked in grey)\n\nThere was no instance where a yield curve inversion was not followed by a recession within 9-24 months later. There were instances where the yield curve inverted, went slightly positive, and then inverted again. That does not mean it is not predictive of recessions, it just means there were several inversions in a row (in short succession) before a recession.", "score": 1, "replies": [{"body": "I think 24 months is too long a period to be deemed predictive. The average length of the business cycle is just under 5 years, so saying an inversion 24 months counts as 'predictive' is basically saying it's fine for it to be half an entire cycle before the actual recession.", "score": 5, "replies": [{"body": "There’s only been 5-6 recessions in the last 45 years depending on the definition. So 2 years is a decent warning. Also the one time it took 24 months between first inversion and recession, the yield curve stayed inverted for 1.5 years. It typically uninverts just prior to the recession", "score": 1, "replies": []}]}, {"body": "You’re still misunderstanding the commenter, btw. \n\nHe wrote that yield curve inversion has predicted 9 of the last 5 recessions, meaning that ~4 (the commenter was obviously using hand-wavy numbers, not quoting statistics) of the last 9 inversions were not followed by a recession. \n\nYou retorted that all 5 of the last inversions were followed by a recession. \n\nThis is not a refute of the original statement. The last 5 inversions can have 100% been followed by a recession while at the same time, of the last 9 inversions, only 5 recessions followed. \n\nThis may not **actually** be the case according to the data. In fact, I’m sure it’s not. \n\nI’m just pointing out that your retort was not actually refuting the original thesis. Last 9 inversions can be followed by 5 recessions ***and*** last 5 inversions followed by 5 recessions if the 4 that preceded the last 5 were false positives. Get it?", "score": 1, "replies": [{"body": "Sure, but please name a time after world war 2 where a yield curve inversion in us was not followed by a recession. There was no such time", "score": 1, "replies": []}]}]}]}, {"body": "What about the times that a yield curve wasn’t followed by a recession", "score": 19, "replies": [{"body": "Point to a time where the 10 year and 2 year yield inversion did not lead to a recession within 24 months\n\nI can save you some time, there is no such instance with the 10 year and 2 year yield:\n\n1. Inversion August 1978 followed by recession January 1980\n\n2. Inversion September 1980 followed by recession July 1981\n\n3. Inversion December 1988 followed by recession July 1990\n\n4. 10y and 2y went back and forth between inverted and slightly not 2 times in June 1988 and February 2000 followed by recession March 2001\n\n5. 10y and 2y went back and forth between inverted and slightly not several times between December 2005 and June 2007 followed by recession December 2007", "score": 2, "replies": []}]}, {"body": "Bullshit this correct and intelligent take with a primary source is downvoted 😒", "score": 0, "replies": []}]}]}, {"body": "What exactly are the mechanics that make the % rates go up and down? \n\nThe rates change every day, just like a stock. Is it just a supply/demand thing? Does the Treasury \"set\" the rates? Do people actually trade these treasury notes with each other, or is it all just buying from / selling to the Treasury?", "score": 10, "replies": [{"body": "People trade these bonds like stocks. When there is a lot of buying, yields go down because buying raises the price and if you pay $100 for a 5% coupon you have a 5% yield, but paying $200 for that same bond means you have a 2.5% yield.", "score": 16, "replies": []}, {"body": "Short-term “notes” are bid and asked for like a stock. Keep in mind bond prices are directly inverse to yields. No demand? Yield goes up, face value goes down. Need a safe haven, i.e. demand goes up? Yield goes down, face value goes up. \n\nLonger term “bonds” pricing is a little more complicated and subject to Fed funds rate, inflation, and expectations among other macroeconomic factors.\n\nWhat will happen when the Fed, as a primary buyer of “notes”, removes their presence in the market?", "score": 1, "replies": [{"body": "where do you buy these bonds? Can you buy them on brokerage apps like Fidelity, Schwab, Robinhood or do you actually need to go through a real live broker person?", "score": 1, "replies": [{"body": "yes, all brokers sell them.  For example, at eTrade, enter the \"Bonds & CDs\" section and you'll see Treasury, Corporate and Municipal bonds.  \\[Some of the Muni's have extreme interest rates. I like to browse them like I'm window shopping on Rodeo Drive.\\]\n\nOne of my fav's is a *fixed to float* rate, which means the corp starts at a rather high rate (up to 6-8%) and then \"floats\" it to whatever rate the market is paying on a particular date (which you'll know when you buy it).   But you sell it before that date.  For that, I'd ask a live broker to review all the complex tax conditions, but you CAN buy it yourself, if you wish; or simplify and buy an ETF that specializes in these bonds.", "score": 2, "replies": []}]}]}]}, {"body": "What a great article. Thanks!", "score": 5, "replies": []}, {"body": "Great article.  Also, WE'RE ALL GONNA DIEEEEEE!", "score": 5, "replies": [{"body": "100% guaranteed!   Just not from this inversion.  If it even \\*is\\* an inversion.  (I have my doubts).", "score": 1, "replies": []}]}, {"body": ">For example, if you consider the 3-month vs 10-year spread (positive as of now)\n\nIt's more than positive, it's on a [very strong upward trend](https://www.cnbc.com/quotes/10Y3MS) and is already higher than at any point since 2015.", "score": 6, "replies": []}, {"body": "One inversion that is not mentioned here is the 3month | 18month yield curve. Check that out. When that inverts, I think it’s about 65-85% chance of recession. If the correct companies are picked during the downturn on the recovery those picks will be fruitful", "score": 10, "replies": [{"body": "To be fair, I think you can just say “picking the correct companies will be fruitful” and ditch the rest", "score": 19, "replies": [{"body": "So if I am right I will be successful?", "score": 3, "replies": [{"body": "Yes, but keep that luck running by running all the profits into weekly options trades", "score": 1, "replies": []}]}]}]}, {"body": "If an inversion is such a consistent indicator of a recession, but it takes time for the recession to happen, is it possible that the inverted curve *causes* the recession instead of just predicting it? Is there something in the bond market when this happens that tees the economy up for a recession?", "score": 6, "replies": [{"body": "Market speculation really is a game of chicken or egg", "score": 5, "replies": []}, {"body": "Yes it can be self fulfilling. It makes it difficult to actually study just how reliable it is.", "score": 1, "replies": []}, {"body": "Not when the recession happens 3 years later.  IMHO, inversion is not a symptom or a cause or a bi-product or an enabler.  It's noise.  Almost any technical indicator can get a 65% hit rate.\n\nWhen we get Machine Learning to tell us that an inversion predicts recession, I'll be more likely to believe it, but not with the math most stock people use.", "score": 1, "replies": []}]}, {"body": "Thank you for this write up! Definitely showing my family this.", "score": 3, "replies": []}, {"body": "Fantastic write up, really helped. Easy to follow and understand. Thanks again, great work.", "score": 2, "replies": []}, {"body": "Great write up! Thank you\n\nBullish on recession", "score": 2, "replies": []}, {"body": "Excellent write up. I finally understand what the “inverted yield curve” is and means.", "score": 2, "replies": []}, {"body": "Great post.", "score": 2, "replies": []}, {"body": "For someone who is still new. Does this mean everything is about to go down?", "score": 2, "replies": []}, {"body": "We keep using the terminology \"an inverted curve predicts...\" when in fact we should be saying \"an inverted curve indicates that **people** are predicting...\". We shouldn't forget that market forces are ultimately human reactions.", "score": 2, "replies": []}, {"body": "Perfect explanation. Exactly like what I learned in my economics classes. Thank you for this alert. You clearly know economics.", "score": 1, "replies": []}, {"body": "Everyone expecting a recession, will cause people to short the market. We will push their shit back in them when we are pushing to 500 see you there!", "score": -3, "replies": []}, {"body": "The whole market : \n\n\noh shiz the yeild curve, look. 👀 👀 👀 👀\n\n\nEveryone else :\n\n\n👀 👀 👀 👀\n\n\nMainstream media and Reddit DD's :\n\n\nI know how it looks!! But it's not what you think!..\n\n\n6 months later:\n\n\n🔥🔥 🔥 🔥 🔥", "score": 0, "replies": []}, {"body": "You seem to know what you are talking about.\n\nShould I buy a house now and pay 35-45% its 2019 value?", "score": -3, "replies": []}, {"body": "Sounds like my PLTR and ZYNGA calls will 🚀", "score": -3, "replies": []}, {"body": "!remind me 1 year", "score": 1, "replies": [{"body": "I will be messaging you in 1 year on [**2023-04-10 03:39:53 UTC**](http://www.wolframalpha.com/input/?i=2023-04-10%2003:39:53%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/StockMarket/comments/tzsfm0/the_big_flip_what_the_yield_curve_inversion_means/i44csme/?context=3)\n\n[**3 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FStockMarket%2Fcomments%2Ftzsfm0%2Fthe_big_flip_what_the_yield_curve_inversion_means%2Fi44csme%2F%5D%0A%0ARemindMe%21%202023-04-10%2003%3A39%3A53%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20tzsfm0)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}, {"body": "!remind me 1 year", "score": 1, "replies": [{"body": "I will be messaging you in 1 year on [**2024-04-11 00:17:28 UTC**](http://www.wolframalpha.com/input/?i=2024-04-11%2000:17:28%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/StockMarket/comments/tzsfm0/the_big_flip_what_the_yield_curve_inversion_means/jfrldtw/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FStockMarket%2Fcomments%2Ftzsfm0%2Fthe_big_flip_what_the_yield_curve_inversion_means%2Fjfrldtw%2F%5D%0A%0ARemindMe%21%202024-04-11%2000%3A17%3A28%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20tzsfm0)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}, {"body": "So with this looming recession, if I hypothetically had $100k right now to invest, would it be better to slowly buy in over time (aka dollar cost average), or just go ahead and invest all $100k at once?", "score": 1, "replies": []}, {"body": "very insightful thanks so much 👍👍", "score": 1, "replies": []}, {"body": "TLDR?", "score": 1, "replies": [{"body": "DCA", "score": 1, "replies": []}]}, {"body": "What causes movements in bond rates. Are they like stocks where it’s supply and demand?", "score": 1, "replies": []}, {"body": "This might be a stupid question. Never purchased a treasury bond but if I did, do the rates changes for the ones I purchase? Or am I locked in at the rate for the duration of 2 or 10 years for example (depending on what I buy). In other words, do the rate changes only apply to newly issued bonds?", "score": 1, "replies": [{"body": "The short-term rates are fixed for the duration and published.  The price, however, varies by a bidding process.  Read the wiki pages -- they're quite good!", "score": 1, "replies": [{"body": "Makes sense. Thanks", "score": 1, "replies": []}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "tziby5", "created_utc": 1649467504.0, "score": 42, "upvote_ratio": 0.72, "num_comments": 94, "comments": [{"body": "The central banks two mandates are price stability and maximum employment. These come into conflict because maximum sustainable employment typically indicates an over heated economy, since they target an extremely aggressive unemployment rate of \\~3%.\n\nThe central bank during COVID pumped money to avoid anticipated deflation, they succeeded but played very conservatively when it came to increasing rates because they feared triggering a recession when the economy was fragile, they wanted to obtain full employment again, and they thought inflation was temporary. Now inflation is too high and is more important than the full employment mandate, so their price stability mandate is now their focus.\n\nThey are not trying to trigger a recession, monetary policy is not an exact science so mistakes often happen. They screwed up by waiting to raise rates because they focused too much on employment with COVID recovery. They may trigger a market correction, but it likely wouldn’t be a 2008 style crisis, more of a lighter version of the 2000s dot com bubble that is market wide - but the Fed is doing its best not to cause that correction by being transparent about rate hikes and observing the market’s reactions.", "score": 88, "replies": [{"body": "This comment is too logical for this sub lmao. It’s outstanding how often people just fail to actually learn how monetary policy works before saying “central banks are irrational.” I have literally seen people say “oh look how much money was printed” and they show you the un adjusted M1 graph.", "score": 36, "replies": [{"body": "Well yeah everyone on reddit seems to know monetary policy better than the fed and be a socio economic expert. Its good to see there are people who still understand the wider picture.", "score": 4, "replies": [{"body": "Well, the Fed was not helping it's credibility with the \"it's transitory\" nonsense knowing it was not.  So now many people are all \"see I know what's going on the economy better than Jerome Powell\" and they wouldn't be wrong on that.", "score": 2, "replies": [{"body": "The Fed saying those things just ties back into the price stability goal. They were trying to instill confidence in markets. Everything they say is an attempt to do just that.", "score": 1, "replies": []}]}]}, {"body": "It's good but it's not THAT good of a comment.  Though I would agree they aren't triggering the recession.  Recessions are natural.  I hate the incessant fear mongering we have to live through about recessions.  The media talks about them like they are the end of the earth. They are not.  They are a cycle.  There  is no reason for fairly valued stocks to drop 50% because a company may make less money for a year.  Our reactions to these things are so mellow dramatic", "score": 3, "replies": [{"body": "> There is no reason for fairly valued stocks to drop 50% because a company may make less money for a year.\n\nThey drop 50% because we know other people will think they're going to drop 50%. It's the same reason some rally. If everyone thinks a stock is going to the moon a lot of people will buy just to exploit the price action. Even if you think you have a good long-term stock you're probably going to have doubt about holding anything during a recession.\n\nThe other thing I'd add to this thread is is that while recessions are natural I don't think it's healthy that the FED is so influential in their cause and recovery. Imo it's leading to highly inefficient allocation of capital. Perhaps a controversial opinion, but the mistake the FED made wasn't hiking too late, but so aggressively trying to fight a recession caused by a pandemic. If it wasn't for the FED our COVID policies would have been more economically sustainable and practical. In 2020 governments didn't consider the cost of anything. They were just giving everyone (including businesses) money and ordering everyone to sit on their couches. I remember talking to a friend about a year into the pandemic and he told me he had basically just been playing video games all year because he was being paid to stay home and he couldn't do anything else. This was a healthy guy in his twenties. What we did was frankly insane. I understand COVID was awful, but it was a mistake to think the hardship could be avoided. What we probably should have done was just protect the most vulnerable. If you're under 50 and healthy there was really no reason that you couldn't work. The vulnerable could have been isolated and those who lost their jobs could have been given some financial assistance. If this happened we also wouldn't have seen people investing their government checks on meme stocks only to lose it, and the rich wouldn't have gotten even richer during the course of a global pandemic.", "score": 1, "replies": []}]}, {"body": "Could you look at the Feds balance sheet instead, or is that equally misleading?\n\n[https://cdn.corporatefinanceinstitute.com/assets/fed-balance-sheet-1024x504.png](https://cdn.corporatefinanceinstitute.com/assets/fed-balance-sheet-1024x504.png)\n\nWe did create a lot of money as far as I can tell, and we did drive wealth inequality with Powells own admission.  I think thats more what people are concerned about.\n\nI also think its a bubble if we want to ease some of this inequality through tighter monetary policy, which if 2018 is any indication will cause a large decrease in stock and housing valuations.", "score": 0, "replies": [{"body": "A lot of money was created, but what other options did they have? We were at risk of run away deflation and an economic recession. Every central bank did what they did, and with the information available at that time, the consensus was they were doing the correct moves. I haven’t seen a good argument they made bad moves even with hindsight.\n\nThe only valid critique I have seen is stimulus lasted too long. They likely played over conservative. However them being over conservative was also understandable given the uncertainties they were dealing with. They could have raised rates earlier, but what if that triggered a recession because people felt they were moving too quickly?\n\nIt is a very tight balancing act. They may have made mistakes, but a lot of that is hindsight and not knowing what would have happened if they did rate hikes earlier.", "score": 1, "replies": []}]}]}, {"body": "The last paragraph is the real problem I have with the actions of the Fed. They don’t care about prices in the market as things go up, they should not care about prices in the market as things go down. They need to stop babying the market and tell them that things are gonna get rough", "score": 4, "replies": [{"body": "The problem is, when the market deflates, consumer spending declines. When spending falls, businesses cut asset purchases and and cut employees. This is why most market corrections follow increases in unemployment and deflation - both of which are against their mandates.\n\nThey also do care about an over-heated economy, it just doesn’t catch headlines as much. Trump fought Bernanke when he was trying to raise rates well before COVID. As the presidency has grown in political power over the last \\~100 years, the central bank has become more sensitive to the president.\n\nThe aggressive 3% unemployment however I personally blame for most central bank issues, which is there to help the little guy. I personally think 3% and lower are not actually a sustainable unemployment target and a target of between 4-5% is more reasonable to prevent an over-heated economy. Keynesian economic intervention with a 3% target, I personally feel, will just keep leading to \\~10 year boom and bust cycles.", "score": 4, "replies": [{"body": "I would love to see the spending decrease due to market declines broken down by income levels. My guess is that the majority of that spending is concentrated in the higher incomes that have excess income to invest in the first place.  I would argue that we have more fundamental problems than aggressive monetary policy if our entire economy is based on consumer spending.", "score": 2, "replies": []}, {"body": "I don't think 3% is aggressive because our method to calculate it is crap.  If it was an actual calculation it would probably always be double the official #", "score": 2, "replies": [{"body": "You could be right. I do not know how the US methodology compares to the methodology of other developed countries. We also do not have a good comparable because the EU central bank does not have a dual mandate, they focus solely on price stability and economic growth.", "score": 1, "replies": []}]}]}, {"body": "mmmm my issue now is the impact of algorithms and passive investing.  I would agree with you if people were just dumping Netflix pre-its-crash or Tesla.  But they aren't.  Stocks that have much lower PEs and solid dividends and revenue/profit also get dumped.  We can't have everything drop equally just because some overpriced things need to come down in price.", "score": 1, "replies": [{"body": "Agree with you in the short run. However in the long run valuation will one day matter again and those stocks with low PEs and high yield will perform better than those without", "score": 2, "replies": []}]}]}, {"body": "Thank you for this well thought out comment. I do not support the idea of many traders acting as if we were in a David Vs Goliath battle with the FED when it comes to investing.", "score": 7, "replies": [{"body": "I do believe its an everything bubble, I just dont trust the Fed much to actually drop inflation to 2% through higher rates so I dont have the conviction to sell.\n\nIt seems to me our failure to tighten in 2018, where we caused a crash, showed that we're in some form of fiscal dominance, and raising rates will pull down a ton of leverage.  Corporations and the public do have record debt loads, higher servicing fees on the debt has got to come from somewhere, and it seems it will bring with it great pain.\n\nAre we in the same state as the 80's with Volcker, inflation is at 9%, and now excludes housing.  Even mortgage interest is brought down artificially by QE.  I dont see how we're in a state any different than we were then, except for being far more leveraged.", "score": 2, "replies": [{"body": "You have a good point in debt servicing costs. As debt becomes more expensive, companies will use available cash to pay down the debt instead of investing it into assets and expansion. When all businesses do that, which many are highly leveraged, we could see a contraction in GDP.\n\nRight now rates are still technically negative with the current inflation, but if rates get high enough and inflation becomes more controlled, we could see GDP figures dropping as companies focus on paying down debt.", "score": 2, "replies": [{"body": "It happened in late 2018. Now we took on enough new debt to stave off an entire recession.", "score": 2, "replies": []}]}]}]}, {"body": "Free market capitalism was intended to allow for wealth inequality - if you work hard, you come out ahead. However, the resulting greed led to corruption, so now we are in a situation where big money always wins. When money is printed, big money wins. When rates go up, big money wins. Big money determines policy, so policy favors big money. They printed money to bail out big money, big money took the benefits, now big money cashed out and wants more. So now policy changes so that they win again. Normal people can only win if they understand this and follow along. The answer to “why did we intentionally do this?” will always be that it benefits those at the top who control the policies. We have no recourse as we can only vote for people who are puppets of big money. It’s pretty messed up. I know that it’s a negative view, but the idea that there would be good intentions behind this for normal people seems to be a fantasy. The wealth gap will continue to widen in spite of whatever the central banks say, because it’s what they do that matters. They knew what they were doing, and did it anyway.", "score": 1, "replies": [{"body": "Handling the wealth gap isn’t a Fed mandate and they do not have the tools to handle it. Fed only controls monetary policy, wealth redistribution would need to happen through fiscal policy.\n\nYes they are at partial fault for the inflation (with others being supply chain issues and pent up demand from a long lockdown). If the Fed did nothing however, a recession and deflation were fairly probable. Both hit the poor harder than the rich and the wealth inequality would still had grown, except the poor would had been even worse off because many would be without a job.\n\nWhat you are looking for is a fiscal policy solution, not a monetary policy solution.\n\nAs far as politics and corruption, that has been an issue for over 150 years and not a new event. At times the US makes improvements and at other times it falls backwards. I have no solution to that, the average American voter is far too partisan for any easy solution.", "score": 1, "replies": []}]}]}, {"body": "What do you mean 40 years. The Romans were effectively printing money (debasing the gold/silver content of coins) during economic crises 2000 years ago. France did it in the lead up to the French Revolution. Once you have a money printer as your main policy tool, your policy becomes printing money. Debt is effectively used a stealth tool of central planning (government directing funds into things it wants), until it becomes unsustainable, followed by default and then starting the cycle over. Central banks merely react to the fallout from government policies -- by printing money.", "score": 41, "replies": [{"body": "Ray Dalio, is that you?", "score": 16, "replies": [{"body": "“A new world order is coming…” 😅", "score": 12, "replies": []}]}, {"body": "So... it always precedes some kind of collapse or revolution?", "score": 3, "replies": [{"body": "Some will say it causes said collapse and revolution.", "score": 10, "replies": []}, {"body": "Everything every society does precedes some kind of revolution or collapse.", "score": 2, "replies": []}]}, {"body": "> Central banks merely react to the fallout from government policies -- by printing money.\n\nYour comment is spot on, but to me it's unclear who is actually calling the shots. It could very well be that it's the government responding to whatever the guys at the fed decide to cook up.", "score": 1, "replies": [{"body": "The government decides how much debt to take on, via bills/bonds/notes. \n\nIf there are no buyers, the Fed basically has to step in and monetize that debt in order to maintain its policy rate. So in a way the Fed can be forced to monetize, it does not get to decide when push comes to shove.", "score": 1, "replies": []}]}]}, {"body": "Shelter is included in CPI. \n\nThis isn't the first time rates have gone up in 40 years. \n\nHigher servicing costs are the point. It'll cut back on your ability to buy stuff and slow the economy down. That'll reduce inflation.", "score": 10, "replies": [{"body": "Shelter is included in the CPI in an absurdly bad faith way.\nThey call random homeowners and ask them how much would they rent out their house for.\nIts a blatant way of playing down the rising cost of living.\nThe “official” CPI is cooked up and manipulated so much it’s ridiculous.", "score": 4, "replies": [{"body": "Shelter also includes actual rents from renters. \n\nOER has a methodology and I don't see what's \"blatant\" about it. Existing homeowners saw cost drop with refinances over the past couple years. New homeowners saw house prices go up, mortgage rates go down. How is it I tuition that a different methodology would get a different result?", "score": 1, "replies": []}, {"body": "Seriously?  Didn't know that.  I would say though, for people who own houses....the cost of housing will be very stable and also skew CPI.  I, for one, rent from a friend, and I haven't seen a rent increase in years.  He doesn't see a reason because he locked into a mortgage years ago and the price is cheap in today's dollars.", "score": 1, "replies": []}]}, {"body": "Probably referencing to the fact that 10s broke the line in the sand. I figured that was going to occur, now since it's an emotional trade right now, I think it's going to likely shoot right into the sky on Tuesday next week.\n\nThing is, I'm not 100% sure it's appropriate to call it different this time (it broke in 2018 and failed to stick), even if inflation is indeed terrible. It's very, \"VERY\" much possible that it is different considering that pretty much everyone is on the side of it not being different (outside Peter Schiff who you don't want on your side if you're looking for a MAJOR trend change haha), but I wouldn't automatically side that way quite yet.\n\nI expect a bond dumpster fire on Tuesday after CPI is posted (probably stock too), but after that, we're likely going to see a bounce even if that bounce would make 0 sense considering the macro event. What we see during that bounce will be telling.\n\nIf 10s bounce on 2.66ish, then it is likely different this time and we're going to see a lot more repricing.\n\nUnless something comes up to interrupt the move higher again. As that has usually been what ends up happening.", "score": 1, "replies": []}]}, {"body": "Why are central banks irrational? \n\nThat depends entirely on what you think the central bank is.\n\nIf you believe it to be a truly independent entity from bot government and private industry, then it would appear irrational.\n\nHowever, if you assume that it is corrupted by both government and industry, then it's behavior becomes quite predictable.", "score": 5, "replies": [{"body": "So they'll raise rates 0.25% in the next fed meeting, and do it until theres a market crash, and then start QE back up?", "score": 2, "replies": [{"body": "I think that's a fair prediction. \n\nThey're likely wanting to time it for the election year if they can, and they're also betting on QE being the actual solution for the problem, they might have pushed the system too hard for QE to work if people's confidence in the Canadian dollar is fundamentally weakened.", "score": 1, "replies": []}]}]}, {"body": "It's all greed.", "score": 18, "replies": [{"body": "Human nature", "score": 3, "replies": []}, {"body": "Everyone is greedy.", "score": 2, "replies": []}]}, {"body": "Because central banks are a form of central planning. The answer to this question starts and ends with [The Economic Calculation Problem](https://en.wikipedia.org/wiki/Economic_calculation_problem)\n\nIrrationality in inevitable with central planning, since not even the wisest, most knowledge, and most benevolent of planners are more aware of your needs and circumstances than you are.\n\nSince this is a finance sub, the effects of central planning are exacerbated in capital markets, since central banks distort the cost of capital, distorting the prices and costs businesses plan around, creating malinvestment, leading to shortages/excess when the ripple effects are finally felt.\n\nAll this to say that the idea that a small handful of men can plan the economic well-being for billions of people should be dumbfounding to even the most financially illiterate.", "score": 3, "replies": [{"body": "Wow this is a very cool perspective, thank you.\n\nIt makes sense, I had heard the soviets failed miserably at trying to balance the supply and demand of their economy through central planning.  That it would be a massive undertaking even by the best statisticians in the world.\n\nIt is a bit frightening to hear thats what we're doing.", "score": 1, "replies": []}, {"body": "**[Economic calculation problem](https://en.wikipedia.org/wiki/Economic_calculation_problem)** \n \n >The economic calculation problem (sometimes abbreviated ECP) is a criticism of using economic planning as a substitute for market-based allocation of the factors of production. It was first proposed by Ludwig von Mises in his 1920 article \"Economic Calculation in the Socialist Commonwealth\" and later expanded upon by Friedrich Hayek. In his first article, Mises described the nature of the price system under capitalism and described how individual subjective values (while criticizing other theories of value) are translated into the objective information necessary for rational allocation of resources in society.\n \n^([ )[^(F.A.Q)](https://www.reddit.com/r/WikiSummarizer/wiki/index#wiki_f.a.q)^( | )[^(Opt Out)](https://reddit.com/message/compose?to=WikiSummarizerBot&message=OptOut&subject=OptOut)^( | )[^(Opt Out Of Subreddit)](https://np.reddit.com/r/stocks/about/banned)^( | )[^(GitHub)](https://github.com/Sujal-7/WikiSummarizerBot)^( ] Downvote to remove | v1.5)", "score": 1, "replies": []}]}, {"body": "I fucking cringe when i see retail investors calling “irrational” the market, the fed, speculators, my grandma and so on…stay humble guys…you don’t know shit about fuck", "score": 3, "replies": []}, {"body": "For more than a decade, nothing happened. No inflation, the Fed even tried to get inflation to 2%, couldn’t do it. The money printer whirred, all was okay. Then, weird, a worldwide pandemic shuts down supply chains, a war begins in the epicenter of one of the worlds most critical energy and food markets, labor begins an uprising against poor compensation and exploitation, housing hasn’t been built in any reasonable quantity to meet demand in 10 years, and there aren’t enough chips for cars or anything else. But by all means blame the Fed, who are clearly responsible not only for the US hitting highs in inflation, but are also somehow responsible for inflation in Europe and Asia as well, right? Clearly these guys were idiots and are to blame for everything bad that happens in the world. /s", "score": 14, "replies": [{"body": "The government has changed their measures of inflation multiple times so as to how the real inflation rate. The money supply has accelerated and all of it ended up at the top. \n\nThis wasn't a mistake. It was theft of the national currency by financialization. Your buying power has declined every day of your life and for 95% of people your income didn't keep up.", "score": 10, "replies": [{"body": "Real wages are flat since the 70s, the rich are vacuuming up the lion share of growth for sure but purchasing power has remained flat not down.", "score": 5, "replies": [{"body": "because they exported production to cheaper labor sources to help ease the impact on inflation. as those places develop, they move to cheaper places, like indonesia and the phillippines. not saying that to be argumentative, just wanted to explain how they \"saved\" our purchasing power within a system of widening wealth gaps and rigged inflation metrics", "score": 6, "replies": [{"body": "That's one of the reasons yeah.", "score": 0, "replies": []}]}]}, {"body": "You're talking overall, they were talking specifically about the 10 years leading up to covid, and I would agree.  I live in a HCOL area and rents were pretty much the same for years.  Any raise just went into savings.  I definitely felt the lack of inflation", "score": 1, "replies": []}]}, {"body": "The US has had a constant 4-5% inflation rate for the last 10 years before 2020. Most people just didn't realize it because the increases were in stocks/high dollar assets, and the rest was exported to all the third world nations that produce everything the US consumes in exchange for US dollars.\n\nThe US economy is probbed up be the fact the US dollar is the reserve currency, and the current inflation data is now showing that it's status as such is coming to an end.", "score": 0, "replies": []}]}, {"body": "What do you mean irrational? it was the most rational and best thing post GFC  ....all that printing found it's way into the stock market making wealth distribution to poor folks like me who threw money blindly into the stock market   inflate our networths. Do the right thing and please apologize to Bernake for your ungreatfulness. \n\n\nWe just have a new problem post Wuhan and Rooskie war....we have now learned that while the fed can print money and distribute it through the stock market making simpletons like us rich, they can't print oil, food and other stuff we need.", "score": 6, "replies": []}, {"body": "They're only irrational if you think their purpose is to serve society. Central banks are mafias whose sole purpose is to steal as much wealth as possible. From this perspective, everything they have done makes sense. \n\nWhy did Pablo Escobar sell cocaine? If he had a money printer, would he have sold cocaine? Once the money printer exists, how long does it take for someone like Pablo Escobar to take it over?", "score": 8, "replies": []}, {"body": "Do you want to be the guy who restricts the money supply causing a recession, which leads to millions of people losing their jobs even if it's better for the society long term? No one wants to be the one in charge when the music stops.", "score": 2, "replies": []}, {"body": "Inflation - up = Value of covid debt - down", "score": 2, "replies": []}, {"body": "Because they want to make voters happy and investors rich. It’s really not much more complicated than that.", "score": 2, "replies": []}, {"body": "Keynesian economics is soft communism. Politicians and government prefer to wield larger power. They choose Keynesian monetary expansion policy. Poor and middle class people suffer from inflation. History is repeated.", "score": 4, "replies": []}, {"body": "Lefties will say greed.  Righties will say conspiracy.  Either way, it’s clear the people at the top don’t have our best interests at heart.  You’re asking the right questions.", "score": 3, "replies": []}, {"body": "I think the challenge is that most, like the Fed, are privately owned. Only a few are owned by the country they service. \nSo, despite any stated “mandates”, in the end they serve their shareholders, like any company. \nSo, the Fed, for example, has conflicting priorities.", "score": 7, "replies": [{"body": "This is utterly wrong.\n\nThe Fed is not \"privately owned\" in the traditional sense. There's no Jeff Bezos sitting in a mansion taking in the big bucks from its profits. There are no greedy \"shareholders\" using the Fed to buy Ferraris while the country suffers. \n\nThe Fed is the central bank of the United States. It's intentionally STRUCTURED to be independent from the government so the government cannot politically influence it. Imagine if every president can order the bank to sabotage the economy for the next guy before leaving office. There would be chaos. \n\nThe Fed is a public entity set up in imitation of a private entity, and this is a good thing. It is a mix of both, and neither.\n\nFed officials are appointed by the government. If Powell runs amok and starts enriching himself while hurting the people, the President's political fortune would obviously suffer. Powell would be kicked out faster than you can blink. \n\nSo please stop with the conspiracy theories.", "score": 11, "replies": [{"body": "You sound like you just finished reading your 2nd year econ textbook.", "score": -3, "replies": [{"body": "You sound like you are immune to knowledge.", "score": 2, "replies": []}]}, {"body": "The Fed is not a public entity. Each of the 13 banks are owned entirely by the member banks in its district. \nThe Board of Governors of the Fed is appointed by the US President. Each of the 13 banks has its own board for i ternal operations. \n\n[The Federal Reserve Act](https://www.federalreserve.gov/aboutthefed/section5.htm)\nRead sections 5 and 7, maybe the whole thing. .", "score": 1, "replies": [{"body": "The board of governors is an independent government agency. \n\nIt's not the same as normal corporate share ownership. It's more like a participation pledge. Like the $30 lifetime membership fee you pay to be an owner of REI Co-op.\n\nMember banks hold stock in the Federal Reserve Banks and earn dividends. Holding this stock does not carry with it the control and financial interest given to holders of common stock in for-profit organizations. The stock may not be sold or pledged as collateral for loans.", "score": 1, "replies": [{"body": "Fair enough. The Act says that the boards of each reserve bank has total control over the bank. But maybe they have a gentleman’s agreement to work in the broader best interest. \n\nThe Fed’s operations cost is interesting to me because it seems incredibly high. \n\nEach of the last 15 years, the Fed lends $1T to the US. And receives T notes as collateral. They auction those. Since they typically return $100-300B to the treasury. How are they spending $700B on operations, when it costs all of Walmart about $500B per year to operate.\n\nThe asset flow seems ‘off’ to me.", "score": 1, "replies": []}]}]}, {"body": "Jay Powell *was* enriching himself as Fed Chair, however.  He invested in securities in the market which his policy decisions control.\n\nHe literally sold the market top last Fall — along with two Fed Presidents (who recently resigned).", "score": 1, "replies": [{"body": "You forgot to mention that Fed officials are now banned from owning individual securities. They can still invest in funds but must provide 45 days’ notice in advance of buying or selling. They are also required to hold the securities for at least a year.\n\nIf these corruption complaints are valid, then there's your ticket to wealth. Just look at the 45 day notices and copy the Fed presidents. You'll be a billionaire in no time.", "score": 1, "replies": [{"body": "They were “banned from investing” at the time.  Probably why they resigned.  The real question is why JPow didn’t resign.  \n\nIt’s outrageous.", "score": 1, "replies": []}]}]}]}, {"body": "Why does the President of the United States appoint the Fed chair, a privately owned entity?\n\nIllusion and ruse?", "score": 2, "replies": [{"body": "That was part of the negotiation with Congress, to give the politicians some feeling of control over the money supply; and agree to pass the Fed Res Act.  But the Fed banks manage their own affairs. \n\n[The Federal Reserve Act](https://www.federalreserve.gov/aboutthefed/section5.htm)\nRead sections 4, 5 and 7. \n\nWant to really blow your mind. The US govt cannot issue new dollars, paper or electronic. But the Fed can make them up out of nothing.", "score": 1, "replies": [{"body": "I don’t understand why anybody would downvote your answer.\n\nThank you for the information.", "score": 2, "replies": []}]}]}, {"body": "The fact that this has multiple upvotes is why taking peoples’ opinions on this sub is risky af. The Fed simply does not have shareholders. That is misinformation at its finest. The Fed is not owned by anyone; it doesn’t pay dividends nor does it have investors in the same way a private company does.", "score": 1, "replies": [{"body": "Actually it does have shareholders. Andrew Jackson would like a word.", "score": 1, "replies": []}, {"body": "[The Federal Reserve Act](https://www.federalreserve.gov/aboutthefed/section5.htm)\nRead sections 5 and 7 before you speak on this topic again.", "score": 1, "replies": [{"body": "Seriously? From the same website you cite:\n\n“The Federal Reserve System is not ‘owned’ by anyone…\n\nSome observers mistakenly consider the Federal Reserve to be a private entity because the Reserve Banks are organized similarly to private corporations…\n\nHowever, owning Reserve Bank stock is quite different from owning stock in a private company. The Reserve Banks are not operated for profit, and ownership of a certain amount of stock is, by law, a condition of membership in the System. In fact, the Reserve Banks are required by law to transfer net earnings to the U.S. Treasury, after providing for all necessary expenses of the Reserve Banks, legally required dividend payments, and maintaining a limited balance in a surplus fund.”\n\nDude if you’re going to link the Fed’s website then at least read it properly. \n\nIt’s insane how aggressively people take positions when they fully know they are spreading misinformation indiscriminately.\n\nSource: https://www.federalreserve.gov/faqs/about_14986.htm", "score": 2, "replies": [{"body": "Notice that your first quote is from the marketing part of the Fed website, not form the letter of the law. \n\nRead the law. It says something different from the marketing materials.", "score": 1, "replies": []}]}]}]}]}, {"body": "It was either we print money or tax the ultra wealthy. Printing money has bipartisan support, taxing the ultra wealthy does not.", "score": 4, "replies": [{"body": "Or, don't intervene at all, and let good companies succeed and bad companies fail.", "score": 6, "replies": []}, {"body": "IIRC the math comes out to taking 100% of the ultra wealthy net worth funds the US government for a few months. Raising taxes on them wouldn't help in any significant way.", "score": -1, "replies": [{"body": "You’re in the wrong place to drop truth bombs like that.", "score": 2, "replies": []}]}]}, {"body": "Easy.. because it is profitable", "score": 2, "replies": []}, {"body": "CBs create fake money by extending our debt (fractional reserve banking). Increasing money supply devalues currency, offsetting the cost to us, the peasants. We pay for it in higher inflation, rising interest rates, reduced jobs/pay (to offset corporate costs), and declining value of assets (savings, real estate, investments, etc.). To add to the issue, the unelected bureaucrats, and elected politicians who appoint them, front run the public in equities, bond, and derivatives trades before enacting policy, which magnifies the asset bubbles. This is illegal insider trading, but none of these people are ever held accountable because they also write the rules. They are not irrational, they are criminals, pillaging the taxpayers' coffers for their (and their family's and friend's) personal gain. They bear zero accountability, which incentives and emboldens them to continue, and at grander scales.", "score": 2, "replies": [{"body": "I did hear about the Fed doing insider trading, wasnt Powell even doing it himself?\n\nPretty shady stuff.", "score": 3, "replies": [{"body": "Yeah. Didn't really mention it when he was crucifying the other Fed presidents for doing the same thing.", "score": 3, "replies": []}]}]}, {"body": "The comments here are the most moronic I've seen in a long time.", "score": 3, "replies": []}, {"body": "What?! Not only is shelter included in CPI, but it’s the LARGEST component. \n\nIts like half the people in this sub refuse to Google economics questions or are Austrian economists.", "score": 1, "replies": [{"body": "Well sorry you're right, I should say the changes to lower inflation, not remove it in its entirety.\n\nSpecifically understating inflation through owners equivalent rent, and through QE to drop mortgage interest payments.\n\nHeres the Schillers housing index contrasted to the CPI official calculation, shadow stats can also be used to compare the old versus the new:\n\nhttps://2.bp.blogspot.com/-Q3JKCSGBIxU/WcXGiONLeoI/AAAAAAAAOO4/cy_7n99XcP4ytYzYu7Sq87jqeq7HANOLQCLcBGAs/s1600/house_price_rent20170923-1.png", "score": 1, "replies": []}]}, {"body": "It allows the government to suck your purchasing power(in alarming quantities) out of you and you will NEVER blame them. I haven't even scrolled down yet and I already know what r/stocks is going to have to say about this.\n\nIt's a no brainer deal. If you could steal and never get caught because people are provably too dumb to know what's happening, you're probably going to do it.", "score": 1, "replies": []}, {"body": "Greedy people serving the wealthy. Shame on you for being a socialist and not just giving all your wealth to the top. Trickle down economics and all, you'll get it back, we promise!", "score": -2, "replies": []}, {"body": "As somebody who majored in math and economics, yes, in macro classes they do discuss how it’s the fed’s duty to stop bubbles by raising interest rates. This rate hike is long overdue.", "score": 1, "replies": []}]}
