{"title": "What do we think triggering this bull run of ‘24", "selftext": "[deleted]", "id": "1bqbc6h", "created_utc": 1711671637.0, "score": 34, "upvote_ratio": 0.72, "num_comments": 99, "comments": [{"body": "Debasement of currency. Everything is at an all time high and expensive as shit. \n\nOther than an emergency fund cash in MM funds, I'll hold any type of appreciating asset (stocks, real estate, commodities, crypto) over cash and any depreciating asset (cars). \n\nMaybe I'm stupid as shit, but my basic working hypothesis is that the government of the world's reserve currency printed a shit ton of money while the global output had a sharp decrease and then remained relatively stable during CV. The money is slowly flowing through the US economy (and eventually global economy) at whatever money velocity is currently calculated at.", "score": 84, "replies": [{"body": "[removed]", "score": 43, "replies": [{"body": "Same. The Asian fusion restaurant near my house has raised prices for their noodles from $11 in 2019 to $17. Literally stopped going after the last time I saw them raise prices again. And as for any other restaurant, if I do go out, I always order takeout. Fuck tipping an additional 20% of already overly inflated food prices when I can eat it in the comfort of my own home.", "score": 9, "replies": [{"body": "Just to be perfectly clear - you understand the restaurant by your house isn't making more money, right? \n\nThe CEOs of foodservice distributors and large meat and produce manufacturers are pocketing these profits. \n\nAnytime this comes up I feel like it's important to point out.", "score": 13, "replies": [{"body": "Absolutely. I’m aware that most price increases are so that they can continue to meet the margins they previously held, but it’s just gotten to the point where I’ve changed my consumer behavior because of it. \n\nMakes me wonder if enough people do the same, will the “free hand” of the market bring prices back down? Probably not, but a man can dream", "score": 7, "replies": []}]}]}]}, {"body": "They don't even have to print any more, most people use cards. All the \"Reserve\" has to do is click on \"make a trillion\", and the federal government is able to keep working for another month.", "score": 2, "replies": []}, {"body": "And yet 10-15 years from now, what you think is expensive today will look cheap when prices double again.", "score": 2, "replies": [{"body": "That's what debasement of currency is", "score": 1, "replies": []}]}, {"body": "Individual stocks are much more risky than a CD though for example if I ran a hedge fund I’d put it all in bonds and cds and notes", "score": -19, "replies": [{"body": "Lol there's a reason you don't. No one wants to invest with someone who doesn't even think they can beat a fixed income market...", "score": 19, "replies": []}]}]}, {"body": "Election year and we're still in the infancy of this AI hype. If the AI hype train keeps going its gonna make the dot com bubble look like some kids corner lemonade stand.", "score": 40, "replies": [{"body": "Not really. In the dot com era you had garbage companies trading at like 100 PE just for putting dot com in their name. The biggest ai players are Microsoft and Google which are trading in the 30s and 20s and they're actually good companies that have moats outside of ai.", "score": 15, "replies": [{"body": "It's still mostly hype. This technology has existed for +10 years without much usefulness. The difference is that ChatGPT made it mainstream -> drawing in non-technical investors -> bringing more money into the industry -> incentivizing everyone to participate.", "score": 8, "replies": [{"body": "Agreed. But now, there’s a race, and average shmucks like us are forever left behind. These data centers being propped up are nuts and will take over our livelihoods.", "score": 3, "replies": []}, {"body": "I think it’s more the computing power of chips has advanced so much from Nvidia mostly that even though AI existed, the hardware is going to make it come to fruition. This is just the beginning, AI will bring trillions of dollars into the economy", "score": 2, "replies": [{"body": "How? ML-based AI is still extremely expensive with little to show for it.", "score": 1, "replies": []}]}, {"body": "Large language models did not exist in practice 10+ years ago, this is factually incorrect.\n\nIn addition, the exponential rate of increase for hardware performance has been around for less than 8 years. This is all very, _very_ new.", "score": 2, "replies": []}, {"body": "Dude they have language models running humanoid robots now. It’s not hype, this shit is going to change the world.", "score": 4, "replies": [{"body": "How does a \"language model run a humanoid robot\"? You mean that someone just installed ChatGPT on a robot that looks like a human? How is that useful?\n\nAlso look up SOPHIA. It's a realistic robot that was launched back in 2016. Reason you haven't heard of it is because it's useless.", "score": 1, "replies": [{"body": "No the models can translate actions to instructions to drive the motors and other functions of the robot. Obviously there’s some translation layers but the models are actually controlling the movement and actions of the robots.", "score": 2, "replies": [{"body": "I'm not understanding how this is new technology. ML controlling motors has existed for several years now (e.g. Tesla autopilot).", "score": -2, "replies": [{"body": "Tesla really wasn’t using much ML in autopilot in practice. They just recently transitioned to an AI based engine.", "score": 0, "replies": [{"body": "Youre confusing the terms AI and ML. Even your conventional cruise control is technically considered AI. Tesla autopilot is AI that happens to also leverage ML. They have a computer vision model (ML) that can do things like read lane markings and provide readings like curvature. The translation layer takes the ML outputs, combines it with other readings like speed, turn radius of the vehicle, etc. to create mechanical outputs (like steering the wheel). This is fundamentally no different than your humanoid robot example.", "score": 1, "replies": [{"body": "No fundamentally it’s quite a bit different because the humanoid robot is being directed by a language model.", "score": 0, "replies": [{"body": "It doesn't matter what the model is. And whether it's outputting something to the screen vs outputting motor instructions is more a testament to the translation layer, not the underlying model. I hate to ask this, but what experience do you have in this industry?", "score": 0, "replies": [{"body": "It doesn’t matter what the model is? \n\nBased on statements like that I’m going to just say I likely have quite a bit more professional experience with both modern transformer based AI, and classical ML tools than you do. You sound like a teenager who read a book and think you’re an expert now. Spend a few decades working with this stuff and get back to me kid.", "score": 1, "replies": [{"body": "You still haven't answered my question, and you have no idea what you're talking about. I have professional experience implementing ML models for big tech and dealing with challenges like explainability, extrapolation, continuous training, etc. Yet you think AI and ML are the same thing, so I'm not going to argue with you.", "score": 0, "replies": [{"body": "Dude you can’t even read let alone argue. You literally just said \n\n“it doesn’t matter what the model is”\n\nBefore that you said \n\n“I’m not understanding how this is new technology” \n\nYou are clearly the one claiming there is no difference. You are the one arguing that modern AI is nothing special when driving humanoid robots. I am claiming there is a huge difference. \n\nAll the big tech AI experience in the world can’t help you with basic logical reasoning and self expression apparently.\n\nShit you might be a model yourself for all I know, not Claud level but maybe gpt3.5 based on how you keep losing track of your own damn position. I wouldn’t pay you to build a Wordpress site the way you fail to stay on point and present a coherent argument. Guess you fell onto whatever job you claim to have.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "Chatgpt brought in 2 billion in revenue.", "score": 1, "replies": []}, {"body": "I remember there was a free ai lawyer for UK since like 2013. It's not new tech and been around for awhile. All chat gpt does is gather websites articles and tells you. It cuts down research, but at times it says false thing.", "score": 1, "replies": [{"body": "Yep. Heck, I had a research project as a freshman undergrad focused on generative AI. The tech is cool, but the applications are very limited (at least for the foreseeable future).", "score": -1, "replies": []}]}, {"body": "My favorite movie is Inception.", "score": -4, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Copilot has made me at least 1/3rd more productive at coding. There are similar tools for other types of software like image and video editing. Look at Sora for example. Its looking like you'll be able to make adverts with something like that soon with no actors, no camera man, no sound guy, just a prompt engineer. Its looking like gen AI will bring a lot of productivity gains. \n\nThe market may be overstating it a bit but it's definitely nothing like the dot com insanity which is what my point was. Because Microsoft, Google, Amazon etc would still be great investments even without ai.", "score": 0, "replies": []}]}]}, {"body": "Sounds like you don’t understand the environment", "score": 1, "replies": []}]}, {"body": "Mostly around expectations from the federal reserve. Inflation slowing (supposedly), expectations of cutting the interest rate. Enormous consumer debt or housing affordability doesn’t generally impact the stock market so long as corporations continue to rake in record revenue.", "score": 21, "replies": [{"body": "I know it doesn’t directly effect the market but retail while small still matter in the market and if retail investors are struggling the market should eventually struggle may just be a lagging effect. At least how I think of jt", "score": 2, "replies": []}]}, {"body": "I don’t think you guys realise how much foreign investment in the US also exists. I live in Sweden and here we have mutual fund like investment accounts. Everyone and their mother have these accounts which allows them to buy into funds. These are Swedish managed funds but a lot of them hold tons of American companies. This is just an example, but I can imagine other Euro countries have the same or similar types of accounts. \n\nWhen you examine volume it’s good to really expand your borders beyond the US to give an explanation. ", "score": 7, "replies": []}, {"body": "It’s simply designed to go up.  And that won’t change in your lifetime.  Buy every dip", "score": 19, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Why do you hate this? As a national develops, grows, and becomes more profitable naturally the businesses should become more valuable.", "score": 4, "replies": []}, {"body": "We have a real market.  Why would you hate a market that goes up? Are you invested in the market? Do you want your tiny $$$ puts to cash?  Millions of people have 401ks that buy the market every day week and month.  So confused.    SPY literally removes the under performing stocks and replaces them with better performing ones.  Hence designed to go up. Also now that we have 0DTE options on SPY and QQQ people can hedge on a dime and when so much put pressure that gets built up the market can’t stay down for long.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I assume you don't understand the market since you think it is Government Manipulation lol.   At least you aren't doing any degenerate betting with puts.    All that fearmongering stuff you just repeated is Wall Street selling fear to the masses so they can sell Retail options and collect Fees.", "score": 1, "replies": []}]}]}]}]}, {"body": "Nobody can explain it. If they can, they are making it up.\n\nThe market does what the market does. People buy stocks, people sell stocks. There is a constant cycle between fear and greed. We are in the greed cycle now. Sooner or later this will transition to fear, the markets will pull back, and everyone will ask why. There will be plenty of pundits who think they know why. Their opinions are irrelevant. Only price pays.", "score": 4, "replies": []}, {"body": "Election. Populism. Stagflation.", "score": 6, "replies": [{"body": "Where are you getting stagflation? We aren’t in a recession lol.", "score": 4, "replies": []}]}, {"body": "as long as the companies make money while going up it seems fine.\n\nthe only visible bubble is crypto.", "score": 8, "replies": [{"body": "Look at a chart of the Shiller PE. We're already like 70% back to peak helicopter money valuations.\n\nThis entire run is multiple expansion, not earnings improvement. S&P 500 real earnings growth is -5% right now. Even nominal earnings growth is -1.5%.", "score": 13, "replies": [{"body": "Just seems to me like investing in’s SPACS after CV all hope no true guidance but with some type of base to build off of. I just think it’s completely overvalued at this point for what is truly being innovated. AI is definitely the future but it’s quite there yet at producing money for what theirs pricing at. Feel like the chips stocks have stuff priced into them that all off speculation and hope. That’s only reason I see a AI bubble", "score": 8, "replies": []}, {"body": "Right, and if AI can contribute even half of what is being said, then the market is simply forward looking.", "score": 2, "replies": []}]}, {"body": "Not entirely what I was asking but 👍🏻", "score": 1, "replies": [{"body": "money is coming from tech giants investing in what they think is the next big thing. AI.\n\nso first they buy the chips from nvidia, it pumps and brings the indexes with it.\n\nnext phase will determine where we go. Up/down.\n\nif the companies which bought the chips from nvidia can turn AI into cashflow, they will start looking like NVIDIA chart.\n\nif they cannot, then they will go down. and why buy more chips? then nvidia goes down. bringing everything down. \n\nthe reason i think we continue up is because I already see real world applications for the AI which are coming to fruition. For example FSD 12.3 was a leap in autonomous driving.\n\nif cars can drive themselves and we see it happening, then robots can produce labor, and grow productivity. \n\nnot sure about chatbots and video ai, but if they monetize it then horrah. \n\nso my opinion is that this has just started, even though it looks rediculous.\n\nCrypto is clearly a distraction and should be shorted, because theres not going to be enough demand for ponzi schemes when all compute needs to go towards useful productive activities like training AI models.", "score": 7, "replies": [{"body": "Thank you that’s much more clear. And with pricing and the increase in these stocks. I’m not disputing AI at all, I like it trying to learn about it. But just seems the price of these stocks are being priced in of pure speculation at this point in time.", "score": 3, "replies": [{"body": "Don’t forget foreign investment. You’ve got Europe experiencing market stagnation and increasing geopolitical risk. And you’ve got China appropriating Ma’s money and disappearing him to communist reeducation camp. That’s causing a lot of foreign investment capital to flow stateside as it pulls out of the second and third biggest market next to the states.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I am a technical analyst. if this isnt the top i get stopped out at break even right now.\n\nif it is the top, i will also close it around 45k, then re-open it on a bounce.\n\nI dont have time to explain why its over, but you can expect that to be more clear in the coming week. The problem with waiting till its obvious, is that youre no longer shorting the top, youre shorting the middle, or the near term bottom before a bounce that squeezes you out.", "score": 1, "replies": []}]}]}]}]}, {"body": "Mark Zuckerberg said, \"It's the year of efficiency.\"", "score": 2, "replies": []}, {"body": "Look at Japan 🇯🇵 it doesn’t even have to make sense anymore.", "score": 2, "replies": []}, {"body": "Greedflation", "score": 2, "replies": []}, {"body": "So, we're seeing rates getting slashed, folks spending more, and everyone's feeling pretty optimistic about AI. This AI stuff? It's gonna change the game big time.", "score": 2, "replies": []}, {"body": "My eyes. \nWell good for you. You’re so young, if a bubble pops, it’s a clearance sale for you", "score": 2, "replies": []}, {"body": "Irrational exuberance.", "score": 2, "replies": []}, {"body": "Trump getting back in office...", "score": 2, "replies": []}, {"body": "To be honest. I feel like since the whole GME meme stock introduction and the crypto currency wave. People started getting more exposure to information on investing leading to more people buying/selling in the market (not just banking institutions and hedge funds). I think that is a partial reason to the the market increase rn. More people are willing to pay their last dollar betting it will generate a higher return. Not to mention president elections are this year. I’ve heard the market tends to do well during this time.", "score": 2, "replies": []}, {"body": "Simple. People that never cared to invest or had enough money to invest were giving money by the government at the same time a generational bull market was happening paired with a short squeeze being in the news every day for months. People flooded the market then and now they’re part of it. Billions of dollars that were on the sidelines are entering the market every paycheck cycle, regardless of fundamentals or market sentiment. What else are they going to do with their money? A HY savings account that doesn’t even return half the average market APY? Buy an over priced house they can’t afford?", "score": 3, "replies": [{"body": "I do wonder if the gameification and ease of investing from an app has had a significant impact.", "score": 3, "replies": [{"body": "No matter how much extra money people had in earlier decades, investing was always kind of an esoteric activity. With the Internet and online brokers and apps, the whole game changed.", "score": 2, "replies": [{"body": "Yeah so with every Tom, Dick and Harry now able to easily trade while taking their morning dump I wonder if this has had/does have a significant enough impact that this time it might really be different.", "score": 1, "replies": [{"body": "I didn't follow the stock market that much prior to the early 2000's but pre-Internet, meme stocks did not exist, companies had sane P/E ratios and valuations actually meant something.", "score": 1, "replies": []}]}]}]}]}, {"body": "Rates cut, consumer spending growth, and bullishness on AI (not just in tech, but across industries). One of the most transformative technologies to touch our economy in a long long time.", "score": 1, "replies": []}, {"body": "As a normie, I am tempted to say that delusion markets have tended to spike upwards before a crash. \n\nThe AI hype is likely about to pop, and there's nothing else to hold up the bubble.\n\nTbf you only asked about what we think, not evidence. :P \nThe currency devalueing is probably correct though.", "score": 1, "replies": []}, {"body": "Inflation", "score": 1, "replies": []}, {"body": "Adding trillions to the debt - money printing", "score": 1, "replies": []}, {"body": "I may be wrong but… inflation effects share prices too. Businesses cashing out to retailers fomoing.  And Ai… hype   But one of the biggest uses of AI that people don’t talk about is its ability to sift through consumer data and spot trends in purchasing habits. We’ve got the data and now we have the computational power to individualize this. But heck at the same time let’s analyze the individual as how they react to their family. And their demographic. And geographic region and on and on. We aren’t creating value but we’ve got some powerful tools for squeezing the consumer using psychology that just got a serious upgrade.", "score": 1, "replies": []}, {"body": "1) EPS growth is expected to broaden and accelerate in the second half \n\n2) inflation has topped out and markets empirically do best when CPI is 3-4%. Better than 5% or 2%. \n\n3) credit spreads have narrowed which cheapens financing costs \n\n4) AI is booming. MSFT and OpenAI announced plans for a *$100 billion* data center today. \n\n5) 8 of 11 sectors, and most of the entire small/midcap space, are trading cheaper than pre-COVID. They were absurdly cheap in late Oct. \n\nYou have to look at the market ex-Mag 7 if you want to understand broad valuations. Oil won’t matter till it hits $90 and nobody gives a shit about cocoa.", "score": 1, "replies": []}, {"body": "It's like it's built to climb, and that ain't changing anytime soon, even if you live to be a hundred!", "score": 1, "replies": []}, {"body": "Inflation matters, for sure.", "score": 1, "replies": []}, {"body": "Interest rates stopped climbing, and people keep expecting a series of cuts. Those cuts keep getting delayed by economic indicators.", "score": 1, "replies": []}, {"body": "Yeah, Japan is like, doing its own thing, not even worrying about making sense anymore.", "score": 1, "replies": []}, {"body": "Ah, classic case of irrational exuberance", "score": 1, "replies": []}, {"body": "None of the things you are talking about matter. All that matters is net liquidity. The market goes up or down solely because the fed and the government want it to", "score": 1, "replies": []}, {"body": "Biden pumping billions into the economy because it's an election year driving up US debt.\n\nFor example, he keeps bragging about how many jobs are created yet unemployment is rising\n\nAI hype has a role as well just like the tech bubble did in 2004", "score": 1, "replies": [{"body": "How is your second point an example of your first? Sounds like you're doing some heavy lifting here to make Biden bad where it may not apply lol", "score": 4, "replies": [{"body": "and getting upvotes for it.  This is America, 2024!", "score": 2, "replies": []}]}]}, {"body": "Money printing on top of real innovation,  and in the US, government spending.", "score": 0, "replies": [{"body": "What’s the real innovation been though. I feel ai is here to stay, yes. But has been innovated to the point of producing the money that’s being put into yet. Am I wrong in asking? Here to learn", "score": 1, "replies": [{"body": "The innovation is the AI buzzword pushing select stocks higher while most stocks languish.", "score": 6, "replies": []}, {"body": "Microsoft and Google will start charging a monthly subscription for their top tier AI. Humanoid robots are starting to be used in factories and warehouses. Green energy is getting large funding from governments. Progress in quantum computing.", "score": 1, "replies": []}]}]}, {"body": "Dark Brendan 🤣🤣", "score": 0, "replies": []}, {"body": "[\"bull run\"](https://ibb.co/r6dVHvK)", "score": -2, "replies": [{"body": "I mean I’m not saying it rlly is but what else do you classify S&P up 11% in 3 months.", "score": 4, "replies": []}]}, {"body": "It’s a combination of FOMO & WSB guys hitting tech at the right time. A train of them made millions on Nvidia and are rolling it over to all tech…..\n\nI Personally think the market has topped and before the sell in may and go away mentality kicks in I think the major players will throw puts on market in April \n\nThe above is just my personal opinion and I wouldn’t recommend anyone agreeing with me\n\nI’m just a wannabe cuck 🍾", "score": -1, "replies": [{"body": "Even if the idea that April will be red works out, it’s probably going to be slow and choppy, unless some sort of event pops up to interrupt the slowness.\n\nI’m already seeing a fair bit of vibes of August-late October 2023, the thing that’s missing is a turnaround by the market. March was a pretty choppy month, in the middle of it, the S&P took a 7 of 10 red stretch and managed to avoid much damage in the process.", "score": 1, "replies": []}]}, {"body": "Remember those stimulus checks? They got spent and after that money bounced around a few times being passed from one set of weak hands to the next  it eventually found its way to strong hands that could invest it rather than spend it.\n\n\nThat's where all the new money in the stock market came from.", "score": -6, "replies": []}]}
