{"title": "invested half of my savings into Nvidia earlier", "selftext": "It will go up right? I don't know that much about stocks and shit but I like AI and use it, so the line should go up right?", "id": "1awkqa3", "created_utc": 1708543282.0, "score": 16, "upvote_ratio": 0.73, "num_comments": 85, "comments": [{"body": "Bro that's really risky you can never be sure.", "score": 27, "replies": [{"body": "This aged well", "score": 1, "replies": []}]}, {"body": "Short term? Maybe not. \n\nLong term: Yes.", "score": 18, "replies": [{"body": "Should I sell after GTC then?", "score": -9, "replies": []}]}, {"body": "Hold for years not days for life changing gains", "score": 8, "replies": [{"body": "yeah, I convinced my mom at the start of 2023 to buy NVDA and that paid off really well so I'm tryna get in now", "score": 4, "replies": [{"body": "you will go bankrupt; i invested stocks like that couldve lost my money; dont mislead your mom into risking her money into something just because you are interested in it", "score": 1, "replies": []}]}]}, {"body": "If you don't know much about stocks, do yourself a favor and learn before you risk any more of your life's savings. Nothing is guaranteed in the stock market. \n\nBefore putting money in the stock market, you should have an emergency fund of three to six months' living expenses saved. And \"saved\" means it's in an account where it can be accessed when needed and won't lose value... so no stocks. (Right now you can get interest that's higher than the rate of inflation.)", "score": 7, "replies": [{"body": "This was the money I was saving for university (I'm 17 rn) so that sucks ig, but I have faith it will go up", "score": 5, "replies": [{"body": "Mm, yeah, be careful with that money; that's your future. Never invest more than you can afford to lose.\n\nI don't know where you live, but in the US it's possible to get rates over 5% for savings, with inflation hanging around 3%. Less exciting than stocks\n but much safer.", "score": 4, "replies": []}, {"body": "University money? Man that’s risky. Even if a blue chip stock like MSFT or AAPL, idk if I’d throw all that into stocks for an attempt at short term gains", "score": 2, "replies": []}, {"body": "I wish you had waited to buy after it splits, which is coming sooner than later.", "score": 2, "replies": [{"body": "Yeah but by then the price might have gone up a lot more than right now, so either way, line go up", "score": 2, "replies": [{"body": "Price per share post 4:1 split back in '21 was around $175(?). One of NVIDIA's reasons for the split was the high price/share and they want to make the stock more affordable for retail investors like us.\nThree years later, the price per share is back again at that level before the last split. \nI invested 7k when the share price was @ $70, then the 4:1 split happened and I gained $280k+ from my initial investment. I'll have over a million bucks If they do another 4:1 split this year and share price shot up again to this level. But, nothing is guaranteed in the stock market.", "score": 2, "replies": [{"body": "This aged exceptionally well", "score": 1, "replies": []}, {"body": "Alright thanks! I'll buy more if it splits", "score": 1, "replies": []}, {"body": "It didn't go up from '21 to now because of the stock split though, it went up because of increased income.  I don't get why people think stock splits will increase the market cap of a company.  You'll get more volume and liquidity, but that's pretty much it.", "score": 1, "replies": [{"body": "Did I say the stock price went up because of the stock split?🤔", "score": 1, "replies": [{"body": ">then the 4:1 split happened and I gained $280k+ from my initial investment. I'll have over a million bucks If they do another 4:1 split this year and share price shot up again to this level.\n\nYou certainly appear to have been implying that the split was driving share price growth.  If that's not what you were implying then it's strange that you mentioned \"split\" 5 times in your comment when it's irrelevant to the company's valuation.  Your comment was almost entirely focused on the stock split and potential future split.\n\nIf it's going to grow you into $1m+, it's going to do it regardless of any stock split, so I'm confused why you even mentioned it at all.\n\nAnd OP seems to have interpreted your comment that way too:\n\n>Alright thanks! I'll buy more if it splits", "score": 1, "replies": [{"body": "I wasn't implying a split would drive share price growth, and you left the \"affordable\" part and I apologize for making you count my use of the word \"split\". You bet I'm focused on Nvidia's future stock splits, who isn't? 1. Free shares with potential gains. 2. Share price is more affordable post split, we can afford to buy more.", "score": 2, "replies": [{"body": "OP mentioned investing half of his savings on NVDA already, he doesn't need the share price to be more affordable.  Also, most brokerages allow purchasing fractional shares, so it really doesn't matter at all.\n\nI'm not focused on Nvidia's future stock splits, why should I be?\n\n>Free shares with potential gains\n\nLol, free shares?  Except I paid for them?  See you're still alluding to stock splits influencing gains.  The company is going to gain or lose market cap completely irrelevant of stock splits and share counts, and the % of the company that you own is going to gain or lose accordingly.  You don't own more of the company because you have more shares post-split, you own the exact same amount and the company is worth the same.\n\nIt's like cooking a pizza in the oven, taking it out, cutting it into slices and saying \"Look at all these free slices, look at how much pizza I have now!\".  You bought the whole pizza, including as many slices as you want to cut it up into...", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Would it split if the company has been buying back its shares?", "score": 1, "replies": []}]}]}]}, {"body": "Thats a bad move regardless the outcome", "score": 2, "replies": []}, {"body": "To the moon brother!!", "score": 2, "replies": []}, {"body": "Just fucking hold  I would take a  3 year time horizon from  here & turn water into wine 🍷", "score": 2, "replies": []}, {"body": "Up big in after hours. Just keep it!", "score": 2, "replies": []}, {"body": "Congrats, OP. Now hold.", "score": 2, "replies": [{"body": "Nvidia is insanely overvalued right now though, won't it fall drastically when the bubble pops?", "score": -2, "replies": [{"body": "I believe some investors mean to hold for several years or more.", "score": 2, "replies": [{"body": "Even after a few years I mean, would it really get to a price as we see now? 3rd biggest company by market cap is insane", "score": 1, "replies": []}]}, {"body": "It's not insanely overvalued at all, it's valued similarly to MSFT but with *waaaay* more growth occurring.  It's about 40% cheaper than AMZN.\n\nSo many people simply think NVDA is way overvalued *because* it tripled in the past year, completely ignoring that earnings have increased 10x in the past year and is set to continue to increase.", "score": 2, "replies": []}, {"body": "Then why would you put half of your savings in it?", "score": 1, "replies": [{"body": "I don't know tbh, I only thought about \"what am I going to do\" afterwards. After doing a bit more research though I don't think the bubble is peaked yet, so I'm gonna just keep holding", "score": 1, "replies": [{"body": "Still holding?", "score": 1, "replies": []}]}]}]}]}, {"body": "Better off invest in a good global index fund (e.g. a Vanguard fund with a low fee), or the S&P 500 again via a low fee ETF or Index Fund, which will have a heavy weighting towards Nvidia anyway, with significantly less risk.\n\nInvest, don't gamble.\n\nSuggested fund:\n\nVanguard FTSE Developed World UCITS ETF (VHVG)", "score": 3, "replies": [{"body": "After thinking about it more, yeah I def did a really really stupid move, thank you for the advice, I will be using it now lol", "score": 3, "replies": [{"body": "If you want a decent guide to investing check out Pension Craft (Aka Ramin Nakisa on Youtube). I must admit that 99% of YouTube investing content is garbage, and terrible investment advice. Also, don't fall for hype and group think on discussion forums / reddit. Hoever, I've found Pension Craft content to be  factual, non-rampy and his advice is always just invest in one global fund with the minimum possible fee. You're young, so you have time on your side. May as well buy the whole market and let it grow. (look up Warren Buffet).\n\nEnd of the day, the best way to invest would be one global fund, keep buying in for a few years, or deposit a lump sum at once and just let it be to grow for 10 years (or whatever your time horizon is).\n\nI went down the single stock route when I first started investing and took a few brutal losses which was a learning curve.  My global ETF has outperformed my own foolish decisions in the long run.  \n\n\nAlso, if it's shorter term, consider that you can get 5% interest rates in a no risk savings account right now!", "score": 2, "replies": [{"body": "> I went down the single stock route when I first started investing and took a few brutal losses \n\n  \nOut of curiosity, what were your worst individual stock picks in that regard?", "score": 1, "replies": []}]}]}]}, {"body": "Welcome to the Casino!", "score": 1, "replies": []}, {"body": "It’s to volatile", "score": 0, "replies": []}, {"body": "You're out of your mind. Hopefully you don't need that money soon.", "score": 0, "replies": [{"body": "Well, the number went up, so it's all ok! I was gonna use it for when I went to university though", "score": 1, "replies": [{"body": "Please tell me you sold at 780 today.", "score": 1, "replies": [{"body": "Absolutely not, yall seem pretty trustworthy and a lot of people said I should hold, so I'm gonna hold", "score": 2, "replies": [{"body": "Then please set a stop loss (i.e. go for 10% below the current price). That will at least partially protect you from any market volatility.", "score": 1, "replies": [{"body": "But what if it goes up again after?", "score": 1, "replies": [{"body": "You need this money in the short term. Any stock comes risk. Please educate yourself and take precautions.", "score": 1, "replies": [{"body": "I'll be better off in university if the stock does go higher though, high risk high reward, it's already gonna be pretty tough to go to university cause it is expensive, so if this can pay off it will be 100% worth it", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "It’s going to fall even more after the earnings. Amateurs are the only ones buying as the whales know to sell.", "score": -1, "replies": [{"body": "Lol, falling upwards I guess.", "score": 2, "replies": []}]}, {"body": "Bad idea\n\nIt’s going back to 400s", "score": -2, "replies": [{"body": "Lol", "score": 1, "replies": []}]}, {"body": "Im only in about 6k and stressed… can’t imagine how you feel. I’m a long term believer though, won’t be taking my money out anytime soon.", "score": 1, "replies": []}, {"body": "Get your money bro", "score": 1, "replies": []}, {"body": "A few thoughts:\n\n* Diversification is always mentioned as a key part of any \"sensible\" investment strategy. Thing is that the top tech stocks are pulling away from the rest of the market and so concentrating investment across a small number of high growth tech stocks with solid fundamentals actually makes a lot more sense than it used to. Meaning that it may be OK for you to have most of. your money in a single stock. \n* If you're doing this, you really don't want to buy options because it's very high risk i.e. you're trying to predict direction of movement, magnitude of movement and timing. You're trying to predict the outcome of three coins being flipped and you have to get all three right to win. As opposed to owning a stock and being able to just wait it out. You're trying to predict one thing with stocks and that's that it will go up. No timing. No magnitude. \n* Assuming you own the actual stock, you really need to take at least an 18 month view on this. Stop looking at the daily chart. Stop obsessing over it. Stop counting your money. Invest and hold for 18+ months. That smooths out the herd movements, reduces your risk, and gives the fundamentals of the business time to be reflected in the financials and ultimately the stock price. \n\nThis is not investment advice and I'm not an investment advisor. Best of luck.", "score": 1, "replies": [{"body": "Yep, I've realised I really did a stupid move, tysm for the lesson, I'm gonna use it to properly invest", "score": 3, "replies": [{"body": "Or you made a genius move… take those gains!!", "score": 1, "replies": []}]}]}, {"body": "What price did you buy in at?", "score": 1, "replies": [{"body": "I got my mom to buy at around 230 (early 2023) and I just bought earlier this morning at ~667", "score": 3, "replies": []}]}, {"body": "If you are for the long ride, don’t worry. Only question is when did you buy?", "score": 1, "replies": [{"body": "earlier this morning", "score": 1, "replies": [{"body": "Now is up 8% after hours.. 🙌🙌, so no worry", "score": 2, "replies": []}]}]}, {"body": "Well, you better hope it does lol", "score": 1, "replies": []}, {"body": "Shit like this is why the stock goes down...", "score": 1, "replies": []}, {"body": "You risked it for the biscuit! It paid off", "score": 1, "replies": []}, {"body": "If I had a lot of extra money I would definitely have a large quantity of NVDA.", "score": 1, "replies": []}, {"body": "Yeah", "score": 1, "replies": []}, {"body": "Congrats", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "HOLY FUCKING SHIT IM SO HAPPY RN", "score": 1, "replies": []}]}, {"body": "Please don’t do that because of FOMO. Do it because it’s an investment strategy where you may lose it all or gain in long term", "score": 1, "replies": []}, {"body": "Not very smart.", "score": 1, "replies": [{"body": "Yep, I only realised that aftee", "score": 1, "replies": [{"body": "That was a little harsh of me considering I’ve made similar decisions, multiple times over in my past. \n\nWe all want to make money and ideally we would like to make it fast. \n\nI would advise just taking a little profit tomorrow if you are up; maybe reduce your position size by half (even if not up honestly). That would be a step in the right direction to mitigating some risk. \n\nAnyways; at least you didn’t dump it in some small cap stock that has no revenue and just dreams. \n\nIt’s not yet certain if Nvidia will be able to maintain the growth yet; right now quarters are being compared to pre h100 sales quarters so year over year growth is wild, but eventually the quarters will be compared to these already high revenue quarters; the big revenue increase gains will be the past etc; and the stock won’t be going straight up anymore. \n\nAt the start of the internet and web really taking off Microsoft flew up to extreme heights share price wise. Everyone knew Microsoft was the future because well, they were. This was 1999 and if you bought the company Microsoft which everyone knew was gonna be one of the biggest players; it was 2013 that you went into the green again….just some perspective. 13 years to go green in a company that in fact was wildly important in the internet, web and computing. People weren’t even wrong.", "score": 1, "replies": []}]}]}, {"body": "Grats. But always remember your victory today was pure dumb luck as you yolo'd without even doing any background. \n\nCount your blessings, take the profits. Only buy what you understand.", "score": 1, "replies": [{"body": "Absolutely, this was one of the stupidest things I have ever done in my life, I'm gonna do proper research and invest in indexes for next investments", "score": 1, "replies": []}]}, {"body": "Do you plan on just sitting on it for a while? Buying other stocks?", "score": 1, "replies": [{"body": "Yep, I think I'll use the other half to invest in S&P, I don't think there will be a recession soon so I can use all that money for when I go to university", "score": 1, "replies": [{"body": "Bad bad bad bad bad bad bad idea. The market can go down for no reason and stay there for years. You are gambling with your savings. Do not do this. Look into fixed income instruments", "score": 1, "replies": []}, {"body": "I'm not sure that you can say that there is not going to be a recession anytime soon.\nConsidering multiple countries are already in recession and the US is slowing down.\nSo I would think twice about investing.", "score": 1, "replies": []}]}]}, {"body": "Lmao are you using student loans to buy stock", "score": 1, "replies": []}]}
{"title": "NVDA theta gang representing", "selftext": "Everyone knows how inflated the IV is. Care to share your positions? \n\nSold iron condor 700-750 ten wide strikes for 4:1 risk reward. Not my only position going into NVDA earnings, but this is my theta trades. Risky, I know but just going off purely on risk to reward ", "id": "1awltr3", "created_utc": 1708545851.0, "score": 24, "upvote_ratio": 0.8, "num_comments": 100, "comments": [{"body": "SOLD -1 NVDA 100 (Weeklys) 23 FEB 24 630 PUT  @ 15.17", "score": 33, "replies": [{"body": "Well done!", "score": 10, "replies": [{"body": "Cheers!", "score": 4, "replies": []}]}, {"body": "Nothing better than a trade going your way, is there? Nice work!", "score": 3, "replies": [{"body": "Thanks, I finally feel like I'm getting the hang of this, I hope I didn't just jinx myself!", "score": 2, "replies": []}]}]}, {"body": "595/600/815/820—looking good", "score": 13, "replies": [{"body": "How much premium did this IV net you? Mind if i ask?", "score": 3, "replies": [{"body": "1.65 per contract", "score": 1, "replies": []}]}, {"body": "What made you pick those strikes?", "score": 3, "replies": [{"body": "Usually shoot for 20-30 delta on the short side for my entries.  The short strikes were at 20 delta when I put the trade on so wanted a bit higher probability given the frenzy in NVDA.", "score": 7, "replies": [{"body": "Thank you", "score": 3, "replies": []}]}]}]}, {"body": "So happy when it climbed above 700 😁 now stay under 750 pls hahah", "score": 8, "replies": [{"body": "Rip ", "score": 7, "replies": [{"body": "Rip indeed hahah. But the plan stays the same, just gonna be not as smooth sailing. Expecting a backtest of the 750 resistance, in which case I might even exit just the short leg of the calls side. I did mention other positions like being long options on other names that will definitely move on good earnings, so I’d take some exposure off those first at open.", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 17, "replies": [{"body": "lol 700 strike?", "score": 8, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Lets say the nvda goes to 900\n\nDoes ur call option got called immediatly, or u have to wait until nov?", "score": 3, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Assume it's a CC as no one in their right mind would sell uncovered calls on NVDA.", "score": 3, "replies": [{"body": "Poor me I'm so fucked because I hit max profit, and was able to roll it out for more monies", "score": 5, "replies": []}]}]}, {"body": "If I’m not mistaken, yes that’s the biggest “risk” with rolling contracts further out, tying up the capital for longer. It’s challenging to unwind the covered call, also unlikely to be assigned early given the high extrinsic value, hence most likely outcome is the capital being tied until November barring any market or sector wide obstacles", "score": 1, "replies": []}]}]}]}]}, {"body": ">Everyone knows how inflated the IV is.\n\nIts not inflated if it realizes more volatility. Not saying it will.", "score": 11, "replies": [{"body": "This isn’t something I check frequently, but what happened to IV as NVDA went higher today? We did surpass implied move after all", "score": 3, "replies": [{"body": "I've commented on a couple posts recently that I don't think earnings are worth trading from a short-premium side. There's is too much explosive volatility around them lately, especially with a tulip like NVDA. \n\nI feel like 1-2 years ago, you used to be able to sell premium around the expected move and make money 9/10 times. \n\nIIRC, the expected move was 60 points. It exceeded that by almost double, so even though people were paying obscene amounts for calls, they made money on them.\n\nThis is a batshit market controlled by AI fanboys. At some point, the adults will come home and make them clean up the mess, but who knows when that will be.", "score": 1, "replies": [{"body": "Yep this quarter definitely not. In hindsight, bullish put spread (and the short leg cash secured) would’ve been the best trade", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": -9, "replies": [{"body": "IV becomes RV.", "score": 4, "replies": []}, {"body": "This comment is not constructive to the conversation.", "score": 1, "replies": []}]}]}, {"body": "Anyone doing post earnings plays? Am new so just curious on what the thought process might be to captialize on iv crushes", "score": 3, "replies": [{"body": "post earning iv has already crushed usually.\n\nnot always, but usually.\n\nwhen NVDA beat earnings in may 24 2023, the day after, when NVDA was \\~370, the 345 put was paying out like 2.00. which is quite high for a 10% drop in 2 days, but it was because everyone was expecting it to pull back and then it obviously did not.", "score": 3, "replies": []}, {"body": "Post earnings play would be more so getting more info, having more certainty on what the market direction is, not so much IV crush", "score": 1, "replies": []}]}, {"body": "I had ~$2000 cash on hand from selling calls against other positions.\n\nBought 3 shares in the mid-afternoon at $670 and immediately set a limit sell for $725, which hit in after hours.\n\nNot a massive win, but $165 for two clicks ain’t bad.", "score": 4, "replies": []}, {"body": "1x 36d short put 615\n2x 121d long put 500", "score": 2, "replies": [{"body": "Nice, I’ve seen a similar strat before. You’re collecting premium every month. But the 2x long put doesn’t make the trade too heavy on the negative delta side?", "score": 2, "replies": [{"body": "It was just for this earnings. Basically getting myself some free puts if the short put expired worthless. Or I can close it tomorrow for a small profit due to the delta differences and longer exp on the longs. If NVDA dipped hard then I would get the shares for even cheaper than the short put strike. Of course I don’t have the premium from the short since I purchased the 2 puts so that’s the trade off.", "score": 1, "replies": []}]}, {"body": "was this a net credit entry or a net debit entry? if net credit then you don't really have any upside risk. and even if it was a net debit your upside risk would only be the net debit at the entry. \n\nit seems your downside risk is just getting assigned 100 shares of. not such a bad outcome either. \n\nwell done.", "score": 2, "replies": [{"body": "It ended up being free. Thanks, cheers!", "score": 1, "replies": []}]}]}, {"body": "I’ve 3 112s; each a week apart. Guess I can consider the premiums as realized PL now. Or should I not count my chicken before the eggs hatch? 🐣", "score": 2, "replies": []}, {"body": "Risky! Nvidia currently at 725", "score": 2, "replies": [{"body": "I got paid 8.00 for it. The max loss was only 2.00, so it felt right. IV crush will play a part, but no chance I’m letting it sit to expiration end of the week hahah", "score": 2, "replies": []}]}, {"body": "Opened a single 550 weekly put yesterday for $1.95.\n\nIt was up 44% after a few hours and if I had been paying closer attention I probably would have bought it back. Glad I didn't!", "score": 2, "replies": []}, {"body": "I went for 6 put credit spreads 642.50/640", "score": 2, "replies": [{"body": "2/23 expiration or longer DTE? for how much premium and maximum risk?", "score": 1, "replies": [{"body": "It was for 2/23 premium was 538, and maximum risk was around 960.", "score": 1, "replies": [{"body": "well done. when did you put the trades on when the premium was $538?", "score": 1, "replies": [{"body": "8am", "score": 1, "replies": []}]}]}]}]}, {"body": "sold 1x 2/23/2024 $780 call, bought 2x 3/1/2024 $870 calls. both the short and the long looking good so far\n\nprobably going to close one short call and one long call, to collect some profit, and let the 3/1 $870 call ride.", "score": 2, "replies": [{"body": "Wow, so a diagonal spread and a ratio combo. I’m digging the creativity! Any particular reason for those strikes, or you just shopped around in the chain to find a good combo? Usually for ratio spreads I find myself just shopping around for a nice combo after looking at the chart", "score": 2, "replies": [{"body": "I chose those strikes mostly because the entry was a net credit. I think the total credit was $178 (when I put this trade on yesterday). So there is zero downside risk if NVDA drops. \n\nIt seemed to me that there was not much upside risk either. If price shoots up, then you end up with two long calls and one short call, at this point delta is in your favor, unless the IV crush is much more significant than the gain on delta, I don't know for sure quantitively, but it seems unlikely. plus the long calls still have plenty of time value left as a cushion.", "score": 1, "replies": [{"body": "Did you end up getting out of the short calls? Or you’re keeping the spread intact?", "score": 1, "replies": [{"body": "No it was dumb trade, a bad trade. The IV drop ruined both the deltas on the short call and on the long calls. Even though the stock price jumped so much after the earnings, the IV drop destroyed the delta on the long calls, and shot up the delta on the lower strike short call. Loss on both legs. Thought I was so smart LOL..\n\nI failed to realize how IV can change delta way more drastically than the price movement of the underlying. My assumptions were totally wrong. \n\nBut I did close one short and one long, and keep riding one remaining long call now.", "score": 1, "replies": []}]}]}]}]}, {"body": "Been holding the 3/15 610/600 PCS for a week.", "score": 2, "replies": []}, {"body": "Tell me why I shouldn’t sell 700 c for like 5 grand. I got in at 250 how much higher can it go I don’t see it blowing past 750 anytime soon", "score": 2, "replies": [{"body": "It has a chance of breaking 750 resistance even this week so you might be surprised—two trading days still. Personally I’m actually expecting the market to pull back. Hoping for an exhaustion type move in the coming days. \n\nReally just depends whether you’re willing to let it go at the strike you do choose. I don’t think it’s a bad plan. I’m expecting there’s a spot for you to buy back in", "score": 1, "replies": []}, {"body": "Did you end up selling calls?", "score": 1, "replies": []}]}, {"body": "Sold 670c/670p 03/23 and purchased 680c/660p 03/01 double diagonal for -1.47 per contract. Wonder what they will open at tomorrow :)", "score": 2, "replies": [{"body": "You mean 2/23? How’d they do?", "score": 1, "replies": [{"body": "IV dropped killed me. Short leg dropped to 100 IV and the long leg went to 40 IV. This killed the spread.", "score": 1, "replies": []}]}]}, {"body": "10 naked 15 MAR 500P", "score": 2, "replies": [{"body": "Cash covered though? Otherwise, what’s the margin requirement look like on it?", "score": 1, "replies": [{"body": "5k per contract. I closed them out, though and moved them to 600 and 650.", "score": 1, "replies": []}]}]}, {"body": "Sold four 2/23 puts at $500 strike for .58/contract.", "score": 2, "replies": [{"body": "Nice, so it was cash covered I presume?", "score": 1, "replies": []}]}, {"body": "update???", "score": 2, "replies": [{"body": "Wrote it here\n\nhttps://www.reddit.com/r/thetagang/s/8cPJOBpms0", "score": 1, "replies": []}, {"body": "worked out great for me with my NVDA iron condors", "score": 1, "replies": [{"body": "Nice. What strikes?", "score": 2, "replies": [{"body": "665/675/810/820, and 665/675/840/850, and 650/660/860/870. Pretty wide- also had a 710/745/780 iron butterfly. All exp 2/23 - all closed near max profit :) \\~1k gain", "score": 2, "replies": [{"body": "So you were slightly bullish biased, indicated by the butterfly. When did you decide to exit it?", "score": 2, "replies": [{"body": "Yes - I exited morning after earnings since i was nearly at max profit on all of them according to my strategy - last few % gain not worth the assignment risk, etc. Congrats on your gains!", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Update—I don’t think I can edit the OP.\nSold within 5 mins of the open. With implied move st.dev +1 at risk of being breached, I didn’t wanna take the chance. Fortunately, NVDA did pull back. I commented my plan it’s sprinkled throughout this thread what I’d do if NVDA went bonkers premarket\n\nFinal result—8.00 credit, exited at 5.00 for 1.5R (max risk 2.00). \n\nAs mentioned, I did have other trades over NVDA earnings but weren’t theta gang. In hindsight, bullish put spreads were the way to go, especially if cash covered. I didn’t get full credit from the spread. My prediction was “slightly bullish“ but good thing I still got out alive", "score": 2, "replies": []}, {"body": "sold my 625 put way too early and now praying its not gonna go below that", "score": 5, "replies": [{"body": "You will survive 🥳 🎉", "score": 5, "replies": [{"body": "thanks!", "score": 1, "replies": []}]}, {"body": "How hard did you shit yourself and then turn around and thank god lmao", "score": 2, "replies": [{"body": "lol actually not too bad, i was ready get assigned. actually bought some shares at 680s.", "score": 2, "replies": []}]}, {"body": "What day did you enter? 😆", "score": 0, "replies": [{"body": "placed the order last friday but didnt get filled until this tue. immediately losing 100% right after market open.", "score": 1, "replies": []}]}]}, {"body": "Sold 1 put credit spread. Will expire worthless on Friday .", "score": 0, "replies": []}, {"body": "I bought 100 shares strike at 541.61 and opened a CC665 a month ago. It looks like I might not get assigned at this rate. Hurray!", "score": -3, "replies": [{"body": "just so you know, the correct thing to say is \"I bought 100 shares with cost basis 541.61\"\n\n\"strike\" for buying shares is meaningless", "score": 13, "replies": [{"body": "just so you know,  the correct thing to say is \"I FOMO'd in at 541.61 because this thing literally cannot go tits up\"", "score": 7, "replies": [{"body": "I was going to wheel NVDA in the 600s and below. I have made comments that since NVDA is in the 700s that I'd no longer be wheeling it since it was beyond my range of safety, and with my assignment I'll be wheeling something else.", "score": 1, "replies": []}]}, {"body": "To clarify I originally opened 2 pcmm for 505 and 515 and chose not to roll one of them (515 which pushed strike to 541.61) I closed one PMCC due to assignment and exercised my other one because I realized PMCCs are not for me. I'd rather wheel. So I CC 665 and the stock skyrocketed. Been sitting here waiting for assignment so I could wheel again.", "score": 1, "replies": []}]}, {"body": "Didn’t age, but congrats on the profit :P", "score": 2, "replies": [{"body": "I know, that dead bounce. Oh well, profit is profit. Theta is about no emotion and only about gains and a snail's pace. In the end it's 22% profit in a month, so it's all good", "score": 2, "replies": [{"body": "Aaabsolutely, nothing to be sad about there!", "score": 2, "replies": []}]}]}]}, {"body": "Sold 24 puts strikes are from 525 to 635 02/23\n\nhttps://imgur.com/dTwQLwD\n\nI sold my NVDA position a while back and want it back at less than 640.  Have the cash on hand (in SGOV) to secure all the puts.", "score": 1, "replies": [{"body": "congrats!", "score": 1, "replies": []}, {"body": "Total Win!", "score": 1, "replies": []}]}, {"body": "IC: 575/580-745/750.  Seems risky on upside.", "score": 1, "replies": [{"body": "I chose 750 cuz I knew it would provide a hefty resistance as proven by the market. Well… I’m generally bullish on NVDA, so let’s hope we have time to exit our positions tomorrow 😀 hoping premarket doesn’t go crazy, and maybe a pullback to get a chance to exit", "score": 2, "replies": [{"body": "Correct. I’m anticipating little pullback too and not take out ATH. Still prepared to take loss :) will keep my other 600 put calendar open for few days.", "score": 1, "replies": []}]}, {"body": "2/23 expiration? plan to roll all the legs up tomorrow?", "score": 1, "replies": [{"body": "Yes-2/23. No rolling. Will close them out since it was pure earnings/IV crush play.", "score": 1, "replies": [{"body": "good luck on the upside tomorrow, prob should close them first thing in the morning lol", "score": 2, "replies": [{"body": "That’s what I did with mine! Lucky to have gotten that slight pullback. But had to act quickly within 5 minutes", "score": 1, "replies": []}]}]}]}]}, {"body": "[https://imgur.com/a/QLgGK78](https://optioncreator.com/sts7d83), willing to get assigned on any of the CSPs.\n\n2DTE on the link is Feb 23.\n\n57DTE is Apr 19.", "score": 1, "replies": []}, {"body": "Sold Puts too. Only have capital for 1 CSP tho", "score": 1, "replies": []}, {"body": "RIP OP 🙏 🪦", "score": 1, "replies": [{"body": "I came out with profit. We dipped just enough at open", "score": 1, "replies": [{"body": "Better to be lucky than smart, or so they say...", "score": 1, "replies": [{"body": "I did have a plan depending where it would open. Would’ve been very hard to make it out without profit if I didn’t", "score": 1, "replies": []}]}]}]}]}
