{"title": "NIKOLA", "selftext": "Seriously now people, Nikola up 23% today.\n\nDo you even know anything about the company??\n\nDo you even see the news - only bad news - it's getting daily, and still pump this like nuts.\n\nSerious now??!!\n\nNo wonder this market will crash and burn, everyone just playing Nikola deserves to loose all the money!", "id": "j3agqr", "created_utc": 1601565205.0, "score": 199, "upvote_ratio": 0.91, "num_comments": 145, "comments": [{"body": "[deleted]", "score": 111, "replies": [{"body": "I need the dump ASAP", "score": 44, "replies": [{"body": "I’m so red on a Put right now :/", "score": 21, "replies": [{"body": "Never fuck with a meme company", "score": 56, "replies": [{"body": "These words will stick with me forever", "score": 4, "replies": []}, {"body": "I'm too broke for an award. I want to give you one.", "score": 1, "replies": []}]}, {"body": "Exp", "score": 1, "replies": []}, {"body": "Yup, luckily my expiry is a ways out, but was hoping not to need that.", "score": 1, "replies": [{"body": "mine is 10/16.. so may I still have a chance lol", "score": 1, "replies": [{"body": "Oh no, I just checked and mine is too, I had it mixed up with an NFLX call I had for Nov 20, so I got that going for me, which is nice.", "score": 2, "replies": []}, {"body": "I will come back to this next week and we will cheers our great option selecting skills.", "score": 1, "replies": [{"body": "ahh okay we are in the same boat then. I gotta hunch we'll get a dump soon and be alright. I'll see you then!", "score": 1, "replies": []}]}]}]}, {"body": "Yo, that's a fucking late put. You put a put on a company that just when down 33% of it's most recent sitting value, after an enormous 2 day sell-off?\n\nWhat were your strikes?\n\nYou don't put $10 9/10 when it's at 18 after a huge death spiral. It was always going to dead cat.\n\nYou put a $15 9/10 or 16/10 when it's at 23 and almost certainly going to tank again.", "score": 0, "replies": [{"body": "I did a 17.5P last week for 10/16 ...", "score": 3, "replies": [{"body": "So, you either got in late or you 💎 ✋ your win away? Gotcha.\n\nSorry, I'm sounding like an asshole. We all fuck up sometimes. You'll get'em next time, chief.\n\nEDIT: Also, I thought this was WSB so, I assumed you were a filthy degenerate. Mb", "score": 2, "replies": [{"body": "I’m still learning really lol. But thanks.", "score": 3, "replies": []}]}]}, {"body": "This guy puts", "score": 2, "replies": []}]}]}, {"body": "yo same. -19% now", "score": 9, "replies": []}, {"body": "picked it up yesterday shorted today Mmmm 800$", "score": 1, "replies": []}]}, {"body": "Definitely.. So glad I sold at $66", "score": 16, "replies": [{"body": "66 wooow :))", "score": 12, "replies": [{"body": "But they still have workers, deals, production, hope, determination, try not being scared", "score": -2, "replies": [{"body": "You must be a bag holder. It’s obviously a fraudulent company without any real engineering talent. That whole didler company is a toxic asset. Bara is just waiting to issue the statement that there’s no deal low enough for Girsky and Russell’s people to sell their shares.", "score": 6, "replies": [{"body": "So you’re saying nikola will not put any vehicles on the road? Ever?", "score": 1, "replies": [{"body": "Not OP but I wouldn't bet that they will never put a vehicle on the road. However, I would bet that Nikola will not turn a profit within the next decade.", "score": 2, "replies": [{"body": "Place the bet", "score": 0, "replies": []}]}, {"body": "Yes. I’ll take that bet. There is a big difference between making a prototype that functions enough to test drive and making a vehicle that is road worthy.  Then, to think that shitty team could design, source and manufacture, and maintain fleets and make a profit doing it? No way it’s happening.", "score": 2, "replies": [{"body": "making a prototype that functions enough to roll downhill\\*", "score": 1, "replies": [{"body": "Gravity-powered ^TM", "score": 1, "replies": []}]}]}, {"body": "I feel like it’s another boomer infomercial.  For the people like my dad get their info only from CNBC.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Not being sarcastic. The hardest part about building an innovative company is recruiting top level engineers. Look at their employees on linked in. There mostly all the second rate Utah State engineers.. the types of people that GM and ford might hire, not Tesla", "score": 1, "replies": [{"body": "Not to mention the Director of Hydrogen Production / Infrastructure has no college degree and was paving driveways for a living.", "score": 1, "replies": [{"body": "This whole thing is going to come crashing down once the Shareholder lawsuit firms start their discovery. We’re going to see just how much money the executives took from the company. So blatant too. Was it a $32million ranch Milton bought?  You just can’t do that with pre-revenue company. This would’ve never happened with venture capital investment. (Wework is a notable exception)", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Tell me about it. I bought in high at $56 but sold at $88. Only 8 shares though. Avoided this trainwreck. Too risky to play now.", "score": 6, "replies": []}, {"body": "Yoooo u lucky duck 🦆", "score": 13, "replies": []}, {"body": "$69 baby~~", "score": 2, "replies": []}]}, {"body": "Yup. Bag holders pump the stock up to trick newbs into thinking its safe to buy then dump their entire holdings till it drips to $15. Rinse and repeat until zero", "score": 7, "replies": []}, {"body": "Some people just love to give them money away. No plant, no actual trucks....just a design on the desktop of Milton.", "score": 2, "replies": []}, {"body": "I was thinking short squeeze", "score": 2, "replies": []}, {"body": "That's my sister's nickname", "score": 2, "replies": []}]}, {"body": "Ha, I’ve stopped trying to make ANY sense of NKLA...", "score": 52, "replies": [{"body": "Tesla atleast has a product", "score": 18, "replies": [{"body": "And to a lesser extent, Hyliion. Nikola is where logic ceases to exist.", "score": 13, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Absolutely, NIO too. Literally EVERYBODY else has a dog in the show, and NKLA's standing off to the side with a picture of a dog. Printed on a shitty home printer.", "score": 2, "replies": []}]}]}, {"body": "Sure, but it’s still worth more than Walmart. \n\nYou know...that Store that 99% of the population has used in their life and probably 70%+ have used in the last year. \n\nJust because Nikola is insane doesn’t make Tesla’s valuation sane.", "score": 3, "replies": [{"body": "Tesla has a product to show that they have engineers that can have a non zero chance to produce amazing for the future. nikola probably doesn’t even have the right engineers.", "score": 1, "replies": [{"body": "Sure but Nikola is only valued at 1/10 (ish) of Tesla. They are not the same.", "score": 1, "replies": []}]}]}]}]}, {"body": "hedge fund manipulation to save their stakes, dont fall for it", "score": 109, "replies": [{"body": "The hedge funds have realized the gravity of the situation.", "score": 28, "replies": [{"body": "Well I hope so, their Due Diligence should have shown the companies gravity based truck driving.", "score": 3, "replies": []}]}, {"body": "I saw it coming, actually happened", "score": 5, "replies": []}, {"body": "SoftBank", "score": 1, "replies": []}]}, {"body": "Some of the worst trash ever unleashed on the market.", "score": 30, "replies": []}, {"body": "PUUUUMP....\n\n\n...and then dump.", "score": 27, "replies": []}, {"body": "Even if NKLA somehow gets past all their *many* scandals, the best case scenario for them increasingly looks like them becoming another branch of GM with deals that all heavily favor GM.", "score": 13, "replies": [{"body": "Nikola name is diddler tainted. GM would never want it. All they have is a students rendering of a pickup truck.  The semis are shit. Not engineered. Not manufacturable and not built to last.  The whole company was built off a salesman’s pitch and not engineering talent.", "score": 3, "replies": []}, {"body": "I’m not sure they have IP. Why would GM shell out money/stock on them?", "score": 1, "replies": []}]}, {"body": "Because they want investors who are stupid to throw their money at it because they’re afraid of missing out.", "score": 12, "replies": []}, {"body": "What're the puts bois", "score": 10, "replies": [{"body": "I have puts expiring tomorrow and Im fucking pissed off right now", "score": 7, "replies": [{"body": "so glad i’m not alone... worth $0.08 each and expire tomorrow. might double down with a november expiration or something..", "score": 4, "replies": [{"body": "Yeah same", "score": 1, "replies": []}]}]}, {"body": "My answer is much different from yesterday", "score": 1, "replies": []}]}, {"body": "end of the week short squeeze.  it'll correct", "score": 8, "replies": []}, {"body": "The biggest joke is the nikola subreddit, I would not be surprised if one of the mods is Trevor himself or a family member.  No dissent is allowed, every post has to be approved.  No mention of the fraud allegations, either its being run by the company or some investors who are way over their head and cannot hear any negatives about the company.  They also keep posting Nikola factory updates that are literally machines moving dirt around.", "score": 17, "replies": [{"body": "I got banned from that sub, because someone said the stock was heavily undervalued (at the time) and I asked how to calculate the value of a company with 0 income/revenue/product.\n\nWhoever finds the date of the bubble popping will make a fortune on puts. I'm just too scared about these random jumps to short/buy puts myself", "score": 7, "replies": [{"body": "The prime time to do so was when it pumped to $50+ on the GM news", "score": 1, "replies": []}]}, {"body": "They even flag youtube videos that trash them claiming copyright BS", "score": 5, "replies": []}]}, {"body": "Bought puts and am already up 15%", "score": 9, "replies": [{"body": "What is your expiration date?", "score": 1, "replies": [{"body": "10/9 currently up 20.59%", "score": 2, "replies": [{"body": "Good timing, hopefully it doesn't go the same way tomorrow. But with 10/9 you are probably safe.", "score": 1, "replies": [{"body": "Nikola is nothing but hype, wouldn’t be surprised if it hit 15.00 next week.", "score": 3, "replies": [{"body": "Yeah same here, wouldn't be surprise if its hit 15$ and wouldn't be surprised if its hit 30$, I am still 90% confident you will make bank with this.", "score": 2, "replies": [{"body": "Haha same, although Nikola normally seems to snap back.", "score": 1, "replies": [{"body": "This is such bullshit LOL. Still 1 week to go at least.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "So sad to see this. How can it go up after all the revaluations? 😢🥺", "score": 5, "replies": []}, {"body": "It's a game. You coordinate a large enough buy order that shorts are forced to cover, and then you profit off the resulting short squeeze.", "score": 3, "replies": []}, {"body": "There are always gamblers in the market, people are buying a hope here.", "score": 2, "replies": []}, {"body": "See but you’re talking in absolute. There has been no true concrete evidence saying fraud. Place your bets.", "score": 2, "replies": [{"body": "Any reasonable person sees it’s a fraud. Just look at the LinkedIn profiles of the employees on LinkedIn. The company is is just a bunch of people from their Mormon community in Utah.", "score": 1, "replies": []}]}, {"body": "just bought some puts", "score": 2, "replies": []}, {"body": "Somebody is short.", "score": 2, "replies": []}, {"body": "Eventually it will be a penny stock", "score": 2, "replies": []}, {"body": "It is a short squeeze. 33% of the current stocks are shorts.", "score": 2, "replies": []}, {"body": "I'm not an expert but could there be some sort of options manipulation happening? Think about it. We all bet it's going down !", "score": 2, "replies": []}, {"body": "stfu gei bare", "score": 2, "replies": []}, {"body": "[NKLA lies](https://www.cnbc.com/2020/10/01/nikola-shares-jump-more-than-20percent-after-management-reconfirms-.html)", "score": 2, "replies": []}, {"body": "FUGAZI", "score": 2, "replies": []}, {"body": "I hate to break it to you... but the news on NIKOLA doesn’t affect current operations. Trevor resigning and being kicked is actually GOOD NEWS because people thought he was incompetent. The news surrounding him and his rape allegations are irrelevant to the company as he’s no longer with it. \n\nThe only thing that matters is whether Or not GM stays with the deal or not. Which it’s looking like they will.", "score": 2, "replies": []}, {"body": "It's certainly perplexing. But you should know good and well not to touch this thing with a 40,000 ft pole", "score": 5, "replies": [{"body": "For sure not touching it.", "score": 1, "replies": [{"body": "What if the pole is vertically integrated?", "score": 2, "replies": []}]}]}, {"body": "We need stupid people so we make money from them.", "score": 1, "replies": []}, {"body": "a gift and opportunity for bag holders", "score": 1, "replies": []}, {"body": "investors trying to milk their money back before it crashes for good. I mean if you all interested to gain (or lose) 10-20% in a day, why not?", "score": 1, "replies": []}, {"body": "Only way I’d touch this stock is actively trading and keeping my eye on this stock to see when to sell. It’s absolutely not the type of stock to hold for more than a day.", "score": 1, "replies": []}, {"body": "I just keep buying DYA.TO, it’s going to pop when these NKLA idiots realize it’s the real deal", "score": 1, "replies": [{"body": "what’s dya?", "score": 1, "replies": [{"body": "https://dynacert.com/", "score": 1, "replies": [{"body": "oh.. people fucking hate using def, i had to use it for years. a lot of small companies are buying older trucks to avoid this", "score": 1, "replies": [{"body": "Def?", "score": 1, "replies": [{"body": "diesel exhaust fluid\n\nedit: nvm i skimmed & didn’t read they were using the old hho trick. my bad, two totally different topics", "score": 2, "replies": [{"body": "Ah! Ya I’m not an expert but know a guy at this company who told me about it, I think it will pop. If you work in the space check it out.", "score": 1, "replies": [{"body": "for sure, ya never know. i’ve always wondered if anyone would try to take hho stuff commercial. best of luck!", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "That is another evidence that stocks are overvalued.  Should be history now it is pumped up again.", "score": 1, "replies": []}, {"body": "shit went from 23 to 16%. I bought at 15 and sold at 17% but somehow my order wasn’t filled in td ameritrade to now I’m stuck with Th is shithole of a stok", "score": 1, "replies": []}, {"body": "Bought at 19 sold at 25.50....", "score": 1, "replies": [{"body": "r/wallstreetbets welcome home", "score": 1, "replies": [{"body": "I already feel comfortable lol", "score": 1, "replies": []}]}]}, {"body": "Shit company boom now days. Learned this the hard way on Zoom", "score": 1, "replies": [{"body": "well, i can’t argue with right..", "score": 1, "replies": []}]}, {"body": "Lost a lot of money trying to make plays that are supposed to \"make sense\". Played NKLA yesterday and today, in and out for 15% profit. F it", "score": 1, "replies": []}, {"body": "Lol, yes, i'm on the other side of your puts bitch", "score": 1, "replies": []}, {"body": "This is literally why I would only strangle this trash company. \n\nGot burned on puts way too much.", "score": 1, "replies": []}, {"body": "Always inverse the mass sentiment / mass option orders. No one is buying calls, which means...", "score": 1, "replies": []}, {"body": "My puts are crying", "score": 1, "replies": []}, {"body": "You obviously haven’t hertz of the Robinhood gang.", "score": 1, "replies": []}, {"body": "if the deal with gm goes through is nikola legit??? who thinks the deal will go through.???", "score": 1, "replies": []}, {"body": "Their truck has a cool name and looks good.  Sign me up.", "score": 1, "replies": []}, {"body": "Relax, it’s probably shorts covering.", "score": 1, "replies": []}, {"body": "Easy, everyone and their moms were up to their tits in puts. All someone/some people had to do was sell some puts, buy some calls, then pump the shit out of it so they take everyone's put money.\n\nMarket is manipulated if you haven't figured that out yet, so someone will always exploit when a situation like this happens", "score": 1, "replies": []}, {"body": "Get out before GM issues their statement.", "score": 1, "replies": []}, {"body": "Do credit spreads. I'm up $40 today on my 15/10 put spread", "score": 1, "replies": []}, {"body": "Well those are gamblers lmfao\n\nNKLA is not a stock, it's chip on table", "score": 1, "replies": []}, {"body": "Trevor Milton and Jonny Robb", "score": 1, "replies": []}, {"body": "I just shorted the stock at 21$. Of course it just had to go up... this was the very first time I shorted a stock. Smdh", "score": 1, "replies": []}, {"body": "This is why the big dawgs are correcting the market. Uninformed, uneducated traders.  Unfortunately it is traders like this that gets all our hands spanked for reaching in this big cookie jar.", "score": 1, "replies": []}, {"body": "Feel free to join the superior to $NKLA, $HYLN community @ [r/Hyliion](https://www.reddit.com/r/Hyliion/) ! :)\n\n🚚 \n\n🚚", "score": 1, "replies": []}, {"body": "(OPINION) I think investors feel more confident in the company after Trevor left.", "score": 1, "replies": []}, {"body": "Anyone’s who’s ever lost money on NKLA deserved it for not doing any DD", "score": 0, "replies": []}, {"body": "Lmfffaoo at you dumbasess, what's the matter, stock isn't going where you want?? Ffs these (awahhwwa it shouldn't go up because i say so) posts are cringe af", "score": -11, "replies": []}, {"body": "Stonks only go up!!! Let’s go NKLA!!! In all seriousness, I have some and it’s a long term bet. I won’t be selling even if it crashes down to $1", "score": -4, "replies": [{"body": "Very intelligent", "score": 1, "replies": [{"body": "/WSB represent! :)", "score": 2, "replies": [{"body": "god i love that retarded sub lol", "score": 1, "replies": []}]}]}, {"body": "In at 17s should of sold at 60+ held and now I'm waiting to offload. Idk about long term hold anymore I was hopeful with GM move but Trevor ruined the momentum and GM is supposed to partner with honda for EV cars in NA", "score": 0, "replies": [{"body": "holy hell man.. dump that shit on a day like today. you had the chance to sell at $27 today at one point...    \n\n\nYou don't get many opportunities to recover like that from a disaster and you shrugged it off?!?!", "score": 6, "replies": [{"body": "I've been in and out of it, not playing with many shares but making profit nonetheless. It just hurts to see it drop from when it hit 80 I know of a lot of people that went in on 50s and lost a lot. People thought it was going to be another tesla where idk they got that impression from but I don't even think IMO that they compete with each other. NKLA receives a lot of hate but it's just another stock can't get emotionally attached to any stock bc it'll f you over.", "score": 0, "replies": []}]}, {"body": "When your investment philosophy is I am waiting to unload my losses you are in trouble.  Think how many investors are thinking the same thing.", "score": 3, "replies": [{"body": "Yea I have a lot to learn, I'm relatively new to trading.", "score": 1, "replies": []}]}, {"body": "I know it’s a yolo stock, but anything can happen. Instead of getting dissolved, I feel like it has a higher chance it gets bought out by GM like you said, or an overhaul like AMD and Lisa Su.", "score": 2, "replies": [{"body": "I also feel like GM will push it in the right direction especially since they appointed a former vice chair of GM as chairman", "score": 1, "replies": []}]}, {"body": "Do little research before investing in companies", "score": 1, "replies": []}]}]}, {"body": "Short squeeze, and just the beginning.\n\nThe firehose of bad news and analysts saying it's a sell, combined with insane volume and attention means too many people on one side of the trade, and to exit those shorts they just buy. A lot.", "score": -1, "replies": []}]}
{"title": "+3000% in 2020... My Journey to the Golden 7 Figure Mark", "selftext": "Hey Folks,\n\nMy first ever Reddit post and I guess I chose to make an essay of it. This post is about how 2020 has been a stellar year for me in the stock market. For context, I'm 32 and have a been trading for about 7 years. I started in 2013 with stocks and then in 2016,  I switched to options trading which had disastrous consequences at first, but is also the reason I eventually managed to hit the million dollar mark. Disclosure: I have a pretty stable career completely unrelated to the finance world so a lot of this is mostly self taught, which I am sure is also the case with most readers :)\n\nI will preface this post by saying that I am aware that  there have been a bunch of success stories in the market in 2020 and by no means do I intend for my excitement and elation in sharing my story to come of as chutzpah. 2020 has been a crazy year considering the adjustments we have had to make to our lives because of Covid. The \"benefit\" of this has been the ability to wfh and this lifestyle change has spawned a whole new population of day traders. As an inhabitant of an area that follows Pacific Time, the 2.5 or so hours before work officially begins has been an absolute blessing for me. This additional time coupled with super favorable market conditions, gumption/balls of steel and a good technical understanding or experience of the stock market are the factors that probably led to my success. I will also say you need A LOT OF LUCK in this process. Sometimes things just work out for you in life and you ABSOLUTELY need that to even come close to achieving something like this.\n\nPoint to note: This post is going to ignore the injection and removal of some of my own funds along the way. You can assume the highest \"baseline\" amount I ever had in the account was around 140k. I mention starting at 11k but please note in no way is this post saying I went from 11k to >1 million.\n\nHere's this year's action and the next few images summarize/document my crazy journey to get to this point.\n\n[BOOM portfolio as of 10\\/1\\/2020. 3000&#37;. You can do it too!](https://preview.redd.it/iqyzc5ygtiq51.png?width=2279&format=png&auto=webp&s=e8aa2d7b37a972287642b9a7c82a93c08bf9eede)\n\nI started trading 7 years ago. Mostly stocks. It was all good but humans have a propensity for risky behavior and I am human after all. This tendency meant that I couldn't just let my money sit in an account and grow gradually. I will admit I have a gambler/risk taker mentality and you must realize how critical this characteristic is to achieving success like this. Anyway, started dabbling in options in 2016 and I probably went about it the wrong way. My first foray into the options space was via long calls (which I realized later is actually only recommended for Options \"Veterans\" and not for those starting out as novice traders). Got burned A LOT along the way . I start with 11k in 2015ish and built that to about 39k by May 2017 and then literally lost more than 50% by 2019. Yuck! I know. Trust me there were days I would hate myself for being so incompetent or just displaying terrible money management. For this post, let's assume you only start seeing the action from Jan 8 2016 (image below)\n\n&#x200B;\n\n[The starting value here is reflected as \\~100k](https://preview.redd.it/2nxonyp3uiq51.png?width=659&format=png&auto=webp&s=846446432b1b0fe01331233ddd9ad8896ba6d7f6)\n\nIt's not so obvious anymore because the scale has been affected massively by the spike this year. But for clarity, my lowest point was Sep 2019 (See image below). I was heavily leveraged and this was where I was basically ready to give up. Thank god I didn't. So what changed? Read on!\n\n&#x200B;\n\nhttps://preview.redd.it/l5ugxjuhuiq51.png?width=566&format=png&auto=webp&s=032d472e0e912f43b35547214eacdae371870311\n\nSo in retrospect, I think we were in a very bearish environment between 2018 and 2019. People don't reference it as a bear market because lots of stocks did climb in that period (and it technically wasn't a bear market) but the tariffs on the Far East really messed with a lot of trading strategies and just market movement in general. My favorite stock in the early part of wealth building was AMD!  I used that to build my portfolio and get out of the rut, post 2019. I basically took all my 80-90k (46k + 100% margin) and bought long AMD calls with strikes very close to the market price it was trading at in June-Sep 2018 and expirations 4-6 months out and just waited. POTUS did us all a great favor by ending the damn tariffs and that's when this party started.\n\nBy March 2020, right before Covid, I hit 292k or so and was loving life and every minute of what I had pulled off. I will admit somewhere along the way between Oct 2019 and March 2020,  I had traded NVDA and a few other large cap growth stocks given I now had all this additional purchasing power. BUT Guess what? My dumbass didn't take any profit! Or if I did, I reinvested it into the market. Remember what Mathew Mcconaughey's character says in WoWS? \" They're all f\\*\\*ing addicted. As brokers, we take their money out from 1 stock and dump it in another and just keep making money. Who cares about the investor!\"  .... So anyway, Covid strikes and BAM! my portfolio fell back to around 105k. I was pissed (I am sure many of you suffered the same fate). Thankfully, we have had a V shaped recovery (or K depending on what your political affiliation is) and I basically used the next 6 months from March till today to supercharge my portfolio to what you saw in the first image.\n\nSo here's what I learned along the way:\n\n**Disclaimer: None of what I mention in this post should be taken as financial advice. I accept no responsibility for how you do/do not use this information in your own trading strategies**\n\n1. The power of compounding is a beautiful thing. People understand this but don't full appreciate what this can do for you. If you start at 10k, you should aim to get to 20k first before trying to fly to 100k. When you get to a 100k, make sure you don't lose a single cent and have to start again from scratch. 100k with 100k margin = 200k. That can get you an ROI a helluva lot larger than if you were to start with 10k again. Grow your money in steps but know that in the casino, to win more, you have to bet more, which in this case would be your new principal amount after you have made profit.\n2. Don't waste time trading rubbish. I see lots of new investors chasing the dollar stocks hoping they reach $10. Yes I did it with AMD but when I started trading AMD it had already gone from $3 to $16 in a year so the story was starting to build up! Penny stocks/pink sheet stocks are trash. Please don't waste your time on that. Large cap growth is the best way to make money. It's all about %. One option of TSLA or NFLX or AMZN purchased at the right time will make you a lot more than 1000 shares of a trash penny stock.\n3. Technical Indicators are your friends. Learn how to use them, particularly in a bull market. I personally love Bollinger bands and RSI. These coupled with understanding the trend in a market will give you a significantly higher chance at making money than just speculating. Also, use these to either take profits off the table or to let your winners ride. 95% of all price action takes place within the +/-2 sigma bollinger bands(hence the definition). Don't believe me? Plot the chart yourself. Use the daily indicator for short term trading. Use the 3min or 5min chart for intra day trading.\n4. If you are interesting in options trading,  please go read or watch YouTube videos to understand how to get started. There is SO MUCH LITERATURE available for free. DONT PAY ANYONE to learn how to trade unless you want to contribute to the downpayment for their next Aston Martin :). Also, the Greeks didn't just give us great Mediterranean food, they are also the most important parameters in  options trading. Delta and Theta should be with you at all times but dont' ignore gamma and vega. Alos understand how IV impacts your trading. The most successful/profitable strategy for me was (once I learned to do it correctly of course), buy call/put options with expiration>=2 months from the day you purchase them at a strike very close to the money. Don't worry about straddles and iron condors till you have mastered what the basics mean. Also, once you understand options and start buying them, know that writing Calls and Puts is a great way to collect premium as you grow your account. If you own shares, there's no reason you shouldn't be collecting extra income from writing calls against them. If a stock flies up too high, sell puts at 10% below the current price. In a bull market, you'll be hard pressed to find a growth stock that doesn't recover after tanking 10% in a 2 month time period.\n5. Margin is your friend. Think of margin as the mistress/boy toy. He/She can give you unreal levels of pleasure but if he/she rats you out/bails on you, RIP. Use it wisely. Finally, trust nothing but your own instinct - No one but you is responsible for how you grow your account. Don't blindly follow people unless you understand what they are proposing. Most of us learn this the hard way (including me).\n6. Take profit off the table but also let your winners run! Set yourself targets when you are in the very early stages of building your wealth. Remember the point I made about compounding? If you start at x, and make 20% on that, you are now at 1.2x. If you make 20% on that, you are now at 1.44x. I know you want to make 8x eventually but is it better to be realistic and try and grow 1.44x to 8x or go back down to 0.5x and then have to make your initial capital back and more? If your winners are up 20%, TAKE YOUR PROFIT. If you want to let it run, fine go ahead. But if you are now suddenly 50%, wtf are you waiting for? Are you going to stare at the screen hoping you suddenly see $1,000,000? That's not going to happen. Now, that said - in the current market climate which is a SEARINGLY HOT bull market, it is not unreasonable to see stocks climb 5-10% in a day. So? Take advantage of that of course but never ever let FOMO be the reason you lose out on profit.\n7. Much like point 6, realize that you need to cut your losses when things don't work out. Go check out the CANSLIM method for some guidance on what targets to set yourself. E.g. in your early stages set tell yourself that no matter what, you will take profit at 20% upside and cut losses at -10% downside. On paper, with this math you can never lose. Of course, executing this requires curbing 10 different stages of human emotion which is why most never make consistent profit in the stock market.\n8. Be greedy when others are fearful. I am at a stage now where I LOVE RED DAYS. Why? Because I know that in 24-48 hours the large cap growth stocks are going to recover and I will basically make close to 100% gains on my initial investment. Don't chase when others are chasing. Most of retail doesn't know wtf they are doing. Keep cash handy for days like this. Never be 100% invested with your entire portfolio and never be invested in a single stock unless you are very very sure based on technicals that you will see a rebound. And don't be scared to hit the buy button on a red day. Trust me, once you see it work you will instantly feel vindicated.\n9. Finally, and most IMPORTANTLY. The risk taking mentality/gambler mentality is CRITICAL to making money. You won't hear this much and it might even be a controversial statement to make but your end goal should be to place a bet on a trade which you know, based on experience, will have a favorable/profitable outcome in the near future. To execute this you need to have the guts and the belief in what you are doing but also very low aversion to risk. I will add again that YOU NEED A LOT OF LUCK and a brazen assurance in your own abilities. These will come with time and you will likely make lots of mistakes along the way. But, if you are patient enough, you will reach that level where you stop second guessing your decisions and that's the day you are on your way to your dream portfolio.\n\n&#x200B;\n\nOkay, I could probably write much more and I might edit this again in future but I will stop here for now. I hope you were able to take something from this. I respect your opinions so feel free to disagree with anything, everything I have said. I am just sharing my story and always happy to hear yours too!\n\nGood luck folks. I hope you all make boatloads of money and have very happy, enjoyable lives regardless of whether you are motivated by money or not!\n\n\\-Phantas\n\n&#x200B;\n\n**EDIT:**\n\nThanks for the comments everyone. I appreciate both the love and the hate. Many of you make excellent points and valid arguments both for and against what I have done. \n\nI saw a few posts about how this might be fake. I understand that this is my first post and so it does create some doubt. Video proof below for those who had concerns on the legitimacy of the screenshots. I apologize in advance for the disparity in the numbers. Due to this morning's gains, the portfolio value in the video is significantly higher than when I made this post. \n\n&#x200B;\n\nhttps://reddit.com/link/j3fx2r/video/dteq0s1njpq51/player\n\n&#x200B;\n\n&#x200B;", "id": "j3fx2r", "created_utc": 1601582012.0, "score": 2941, "upvote_ratio": 0.96, "num_comments": 290, "comments": [{"body": "The fact that the post right below this is a dude who lost everything in 1 week shows what this sub is all about. Love it", "score": 1318, "replies": [{"body": "I'm happy for OP but this is survivorship bias.\n\nsomeone probably did the same thing OP did but lost it all or are holding on to their tick-tocking 3% YOY gains.", "score": 235, "replies": [{"body": "I mean he basically said buy the dips and be lucky.", "score": 104, "replies": [{"body": "Buffetisms for 500, Alex.", "score": 40, "replies": []}]}, {"body": "He'll still have a cool $10,000 after he loses 99%.\n\nHe can probably become a mod on wsb and buy a used Toyota Camry with the proceeds.", "score": 50, "replies": []}, {"body": "What are you even doing here bro? Go back to your EMH orgy", "score": 1, "replies": []}]}, {"body": "lol exactly, this shit is 98% luck\n\n> Be greedy when others are fearful. I am at a stage now where I LOVE RED DAYS. Why? Because I know that in 24-48 hours the large cap growth stocks are going to recover and I will basically make close to 100% gains on my initial investment.", "score": 156, "replies": [{"body": "This is hilarious. Prime example of a V shaped recovery convincing retards that the market is always like this. \n\nI’m gonna check in on this guy next time there’s a full meltdown over multiple weeks", "score": 151, "replies": [{"body": "[deleted]", "score": 42, "replies": [{"body": "what color is the safety helmet?", "score": 15, "replies": []}, {"body": "Also\n\n>in the current market climate which is a SEARINGLY HOT bull market\n\nI think they wrote this before Septembear", "score": 10, "replies": []}]}, {"body": "Friend of mine at work became a millionaire in a year in the dot com boom with AOL and YAHOO. then he lost it all plus most of his initial $100k when the market busted. His thought was \"getting to 1M was easy. Once i hit 5M I'll be out!\".", "score": 5, "replies": []}, {"body": "it's a K shaped recovery. The rich got richer, everyone else is worse off.", "score": 4, "replies": []}, {"body": "Only if you have youre entire portfolio invested and he also said to track trend lol\n\nHes talking about a red day in bull market", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 114, "replies": [{"body": "[deleted]", "score": 18, "replies": []}, {"body": "Only make highly leveraged all-ins if you KNOW they will be profitable.  This man has it figured out.  \n\nTL;DR Ride highly leveraged hot stock through hot market and if it works, explain to everyone why you are a genius.", "score": 15, "replies": [{"body": "The man's got a fucking point IMO.  If you don't \"KNOW\" it will be profitable, you won't have the balls to hold the position.  You need some solid confidence in your plays to ride them with leverage.  Obviously you can never know the future, you need to be able to realise when what you  \"KNOW\" is bullshit, but it still stands if your not 100 percent confident in your position you'll make emotional moves when anything happens either way.", "score": 1, "replies": []}]}, {"body": "simply make profitable trades 4head", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 24, "replies": [{"body": "I dont want to be so mean like the other posters here. But this is really REALLY true.\n\nThis is the kind of stories you see from the percent of people that did above average at market tops.", "score": 2, "replies": []}]}, {"body": "It's only 98% luck if you suck", "score": 13, "replies": [{"body": "60% of the time, it works every time", "score": 17, "replies": [{"body": "It works 99 times out of 10.", "score": 1, "replies": []}]}]}, {"body": "not 98 he said he used TA to boost his probabilities in his favor.", "score": 1, "replies": []}]}, {"body": "LOL \"I'm officially done.\"", "score": 49, "replies": [{"body": "i let a homeless man cum in my mouth n it taste like rotten eggs", "score": 46, "replies": [{"body": "How much did you have to pay him for that?", "score": 9, "replies": [{"body": "About two rotten eggs, just before the action", "score": 11, "replies": []}]}]}]}, {"body": "The fact that I can fuck your mother when you're poor or worth millions makes this sub amazing. Love it.", "score": 25, "replies": []}, {"body": "He didn’t do the math properly on paper. 20% up, -10% down. Never go broke. Easy.", "score": 11, "replies": []}, {"body": "Which post was that", "score": 8, "replies": [{"body": "**THE POST RIGHT BELOW THIS ONE.**", "score": 31, "replies": [{"body": "Sort by new gang checking in", "score": 3, "replies": []}]}, {"body": "[https://www.reddit.com/r/wallstreetbets/comments/j3fw59/im\\_officially\\_done/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/wallstreetbets/comments/j3fw59/im_officially_done/?utm_source=share&utm_medium=web2x&context=3)\n\nhere ya go dumdum", "score": 14, "replies": [{"body": "It’s deleted now :(", "score": 1, "replies": []}]}]}, {"body": "Its a battlefield", "score": 1, "replies": []}]}, {"body": ">The risk taking mentality/gambler mentality is CRITICAL to making money. You won't hear this much and it might even be a controversial statement to make but your end goal should be to place a bet on a trade which you know, based on experience, will have a favorable/profitable outcome in the near future. To execute this you need to have the guts and the belief in what you are doing but also very low aversion to risk.\n\nJust to add a counter-opinion. When I first started trading (I have a degree in the field but never had the time to go full day-trader until I was in my mid-20's), I deposited 26K (just for a slight PDT buffer) and made some *huge* plays. Within a week, I had 100k, and I wasn't even risking much of my capital. I was making like 2-3k trades at a time. It was nutty.\n\nI had your mindset and wanted to keep upping the ante and retire, and I fucking blew up my account the next week. Like literally 100k back down to 1k in a few bad days.\n\nSo, personally, I'd recommend the exact opposite. Be super risky in the beginning with money you are okay losing, to try to get out of the trenches. Okay completely gambling with $5k? Go for it, and be completely ok losing it.\n\nIf you get lucky and manage to blow that up to $50k, it's time to pump the brakes, not slam the gas. Keep making your yolo plays, but so many people work 5K to 50K, then yolo 45K on plays because it's \"house money.\" It's not. It's your money, and this is a recipe for eventual disaster.\n\nOnce you work your way up a good bit, lower your % of options in your portfolio. Start trading some stonks. Do some theta gang shit. You already won, so don't blow it. I really wish someone had told me this back then, because I got caught up and carried away and it fucked my up financially for a good while.\n\nI'm not knocking OP or anything, as I'm sure he was making educated trades. But I'm sure that even he knows there was *a lot* of luck here. Even the smartest traders on earth will blow up their account without proper portfolio management. It's literally the most important thing.\n\nThe goal with trading is to win more than you lose, but you will lose some. So if you bet 50% of your portfolio over and over again, it's only a matter of time until a loss kills you.\n\nJust my two cents.", "score": 320, "replies": [{"body": "Make your first 250k on wsb from dumb luck on yolo plays, then mosey on over to /r/investing and act like you know some shit.", "score": 86, "replies": []}, {"body": "Lol at both of the other replies to this comment.", "score": 46, "replies": [{"body": "the way of wsb", "score": 6, "replies": []}, {"body": ">This ^\n\nand\n\n>Pussy\n\nFor anyone who gets here when they all just say \"x days ago\"", "score": 8, "replies": []}]}, {"body": "This ^", "score": 39, "replies": []}, {"body": "Pussy", "score": 40, "replies": []}, {"body": "This is the better advice, 100%", "score": 2, "replies": []}, {"body": "How did you manage to recover from that loss? I’m in a similar situation right now", "score": 1, "replies": []}]}, {"body": "Solid post, and huge congrats my dude.\n\nBut I do have to point out that you have seven years trading, have passed a mil, are writing trading guides... and you're still using robinhood lmao.\n\nI fucking love WSB.", "score": 163, "replies": [{"body": "> you're still using robinhood lmao\n\nRobinhood GOLD!", "score": 24, "replies": []}, {"body": "I think this shits fake", "score": 40, "replies": [{"body": "Anytime I see a huge gain I always call it fake unless I see video.\n\nmember WSBGOD lmao", "score": 22, "replies": [{"body": "This clown said he “loves red days” because he knows the next days will be green. Lmao.", "score": 11, "replies": []}]}, {"body": "This shit is fake. This is targeted at getting more accounts open, getting more money to the casino. WSB has become a way to market to the younger generation, it’s the “in” thing and this is the equivalent of all those gurus on YouTube selling the trading lifestyle and “look at my mansion and women” pumps to sell it.", "score": 8, "replies": []}, {"body": "Fake as fuck", "score": 7, "replies": [{"body": "We used to not believe shit like this back in the day. Everyone would troll posts like these. Back when we could say the f word and n word freely, without fear of being reported or banned. Back then the real traders loved the pumper in chief. Now, you can’t say his name without getting a ban. These are dark times, dark times...", "score": 1, "replies": []}]}]}]}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 137, "replies": []}, {"body": "Oh so I can be a millionaire too, I just need a small loan of 100k", "score": 30, "replies": [{"body": "Just start with $100 and triple your money every single day. What is so hard about that?", "score": 11, "replies": []}, {"body": "I can also me a millionaire too, I just need a small loan of 1 bill. I will eventually get to 1 mill", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 328, "replies": [{"body": "Admit it, you feel really smart when you make 500%+ in a play", "score": 110, "replies": [{"body": "I’m a fucking genius when I hit a 10 bagger and I tell all my friends. I do not tell all my friends about the next 5 losing trades I did after that.", "score": 91, "replies": [{"body": "thats actually the second month of the booth school. it's a rule.", "score": 1, "replies": []}, {"body": "This is the way.", "score": 1, "replies": []}]}]}, {"body": "The fact his key lessons learned are \"let winners run, cut your losers, margin can be good and bad, be greedy when others are fearful and use bollinger bands\" lets us know he will be back to zero if keeps trading options for another year. He might as well just said his secret to profit was buying low and selling high. 😂", "score": 83, "replies": [{"body": "Don't forget letting winners run, and also taking winners off the table.\n\nHuh?", "score": 43, "replies": [{"body": "Use 100% margin and keep cash on hand.\n\nHuh?", "score": 35, "replies": [{"body": "Yeah honestly sounds like he just got lucky\n\nToo many contradictions", "score": 16, "replies": [{"body": "the more i read these posts, the more i think \"the less you know about the market, the more successful you can be\"... too much risk tolerance will keep your gains grounded\n\nbut hey im ok with some gains", "score": 1, "replies": []}, {"body": "Or you must embrace contradiction to master the market...!", "score": 1, "replies": []}]}]}]}, {"body": "His best strategy was basically telling us to buy the dip and it will go back up in two weeks... \n\nThis guy is as good of a trader as that dude who said he brought a tesla option for $14 and sold for 14k", "score": 9, "replies": []}, {"body": "I mean, trading stocks is gambling either way you look at it. Options is obviously more risky but you can hedge if you have experience and manage your risk reward rations to reasonable level. But its all gambling at the end", "score": 3, "replies": [{"body": "Gambling is yoloing on a random play because of some DD on WSB. Handicapping is finding the probabilities on a play and if you are good at it the gains exceed the losses.", "score": 2, "replies": []}]}, {"body": "But that is the secret.....?", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 110, "replies": [{"body": "Its a 2000 word post that could be summed up as 1/100,000,000 run of luck", "score": 80, "replies": [{"body": "Sounds like someone that can't sell in the money", "score": 33, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "His gains are all from this year alone bud", "score": 3, "replies": []}]}]}]}, {"body": "[deleted]", "score": 13, "replies": [{"body": "Be sure to take profit though!", "score": 2, "replies": []}]}, {"body": "And not post positions?", "score": 2, "replies": []}, {"body": "Luck is when you buy a random option with your eyes tied and it makes 10000% profit", "score": 3, "replies": [{"body": "There was this guy I saw in Vegas who was playing roulette and kept betting red. It came up red like 15 times in a row.", "score": 17, "replies": [{"body": "He was just playing the roulette Bollinger bands", "score": 19, "replies": []}]}, {"body": "Luck is also when you flip a coin 200 times and it comes up heads every time\n\nIt doesn’t matter if it is gambling over one trade or a series of trades\n\nDo you really think this guy could repeat a 3,000% return?", "score": 17, "replies": []}]}, {"body": "When you hold a position for weeks that ain't no luck.", "score": 1, "replies": []}]}, {"body": "TLDR: I was lucky and now feel like I can teach others", "score": 112, "replies": [{"body": "“This requires an insane amount of luck”\n\n\n*proceeds to write a step by step essay of how to replicate 3000% gains like its cooking spaghetti*", "score": 64, "replies": [{"body": "but like, do you heat up the sauce beforehand? or like, just dump cold tomato sauce on hot noodles?", "score": 1, "replies": []}]}, {"body": "Thanks, you saved me a read... *shudders*.", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 59, "replies": []}, {"body": ">Bollinger bands\n\nInto the trash you go", "score": 35, "replies": [{"body": "I have found the scroll of truth!!\n\nThe scroll of truth: use Bollinger bands \n\nNYAH!", "score": 13, "replies": []}, {"body": "Why?", "score": 2, "replies": [{"body": "Because technical analysis violates weak-form market efficiency", "score": 1, "replies": [{"body": "Weak-form market efficiency violates weak-form market efficiency.", "score": 4, "replies": []}]}]}]}, {"body": "Congrats u fuck", "score": 54, "replies": [{"body": "Congrats fuck u", "score": 20, "replies": [{"body": "I want to be different than all of u retard u fuck", "score": 7, "replies": []}]}, {"body": "You don’t have to try so hard man you’re already special  :)", "score": 1, "replies": []}]}, {"body": "I don’t buy this post. Be careful buying dips on margin at this extremely volatile time. You’re not gonna show us some positions. I dunno I’m jaded, happy 7 figs.", "score": 15, "replies": []}, {"body": "Very insightful and very inspirational. You probably dont end up in a cardboard box like the rest of us.\n\nEdit. every time some one makes it bigly here on wsb, this quote comes to mind.\n\n“Sometimes the pit sends something back”", "score": 37, "replies": []}, {"body": "I liked everything in the post except margin... Options are already so fucking volatile, adding margin is just so much more riskier. Of course, if you set stops and actually follow them, you can minimize the risk but hard to recommend it to new traders (which this post seems to target) who will 9 out of 10 ignore stops and eventually get margin called on a losing position.", "score": 14, "replies": [{"body": "Margin within reason is ok in stock positions with proper risk management, but yeah on options you can get yourself in trouble quickly.", "score": 3, "replies": [{"body": "I thought margin was just free money...am I missing something?", "score": 1, "replies": [{"body": "if you lose you owe that money", "score": 2, "replies": [{"body": "Just delete the app...it resets the game and you get your margin back.", "score": 2, "replies": []}]}]}]}]}, {"body": "if i were you i'd do one last yolo to go 9 digits", "score": 11, "replies": []}, {"body": "\\#9 is so fucking true. I saw the fear back in March and felt it was going to be a V-shaped recovery but I didn't have the guts to press the buy button hard...like go all fucking in. Would have retired by now. You definitely need guts to make it big.", "score": 9, "replies": [{"body": "In hindsight this pandemic was a money maker if we used our brains back in March and invested.", "score": 1, "replies": []}]}, {"body": "Congrats and shut the fuck up cuck", "score": 32, "replies": []}, {"body": "Dad? Is that you? Are you back from getting milk at the store?", "score": 6, "replies": [{"body": "Are ya gamblin son?", "score": 9, "replies": [{"body": "Son, I am disappoint.", "score": 4, "replies": []}]}]}, {"body": "Positions or ban.", "score": 5, "replies": []}, {"body": "You’re a genius, but also a ret@rd for leaving that kind of money in robinhood", "score": 11, "replies": [{"body": "20% goes to IRS 😢", "score": 4, "replies": [{"body": "More than that.", "score": 7, "replies": [{"body": "More than that 😢", "score": 3, "replies": [{"body": "Anything over 500k is 37% taxed\nEdit: short term gains held less than a year", "score": 3, "replies": []}]}]}, {"body": "Taxes? I thought we were here for cocaine and hookers", "score": 1, "replies": []}]}]}, {"body": "TLDR buy low sell high and trade within your personal risk tolerance", "score": 5, "replies": []}, {"body": "[deleted]", "score": 21, "replies": [{"body": "I feel like I should be annoyed by your comment but I’m not.", "score": 3, "replies": []}]}, {"body": "This guy fucks.", "score": 13, "replies": [{"body": "This guy lucks", "score": 20, "replies": []}, {"body": "... me if I am lucky", "score": 5, "replies": []}]}, {"body": "You should put this as NSFW, this gain porn is un-fucking real.", "score": 11, "replies": []}, {"body": "I would say quit while you are ahead but the epic loss porn a year from now will be worth the million bucks.", "score": 4, "replies": []}, {"body": "Update us when they are red", "score": 3, "replies": []}, {"body": "So gay bro. Also, this is a Wendy’s.", "score": 11, "replies": []}, {"body": "Congrats!", "score": 3, "replies": []}, {"body": "So what were your trades?", "score": 3, "replies": []}, {"body": "Upvote for chutzpah, chag sameach and mazel tov.", "score": 3, "replies": []}, {"body": "Get ready to paid 30% in taxes.", "score": 3, "replies": []}, {"body": "I’m gonna get all motivated and go lose money tomorrow", "score": 3, "replies": []}, {"body": "He doesn't sound retarded enough! Mods!", "score": 3, "replies": []}, {"body": "OVE RED DAYS. Why? Because I know that in 24-48 hours the large cap growth stocks are going to recover and I will basically make close to 100% gains on my initial investment.\n\nAh I see you’ve never experienced a real bull market before.", "score": 3, "replies": []}, {"body": "#8 is spoken like someone that didn't live thru March 2020,  October 2008 - March 2009,  or October-Dec 2018, or the Nasdaq Crash of 2000.\n\n\"I love red days because I know in a few days stocks will gain it back\".  Fn idiot.", "score": 3, "replies": []}, {"body": "Great write up!! Lots of excellent information. What would you say you were mostly trading from may to rn?  Doing wheel trades?  Long calls and puts?  Specific stocks these past 6 months?  I'm not going to say positions or ban because I'm not retarded but it would be interesting to hear what your general go to play or stock is.", "score": 10, "replies": []}, {"body": "Guys this is a brand new account with no post history... Just remember that not everything you read on the internet is always true.", "score": 6, "replies": []}, {"body": "I am going to need that $2300 back!!", "score": 2, "replies": []}, {"body": "okay but there’s no way this fucker achieved  all that on mother fucking robinhood", "score": 2, "replies": []}, {"body": "Is this WSBgod alt account?\n\nOr did you simply right click>inspect element", "score": 2, "replies": []}, {"body": "how long did it take to make this. Should upload a powerpoint to help with the presentation lol", "score": 2, "replies": []}, {"body": "Can I just get the audio book?", "score": 2, "replies": []}, {"body": "Thanks for your post. I think the big takeaways are sell at 20 up, sell at 10 down. Twice I've held big positions right down to the bottom. Never never again.\nCongrats", "score": 2, "replies": [{"body": "ONLY TWICE?", "score": 2, "replies": [{"body": "So far", "score": 1, "replies": []}]}]}, {"body": "Very well written and congrats. \n\nHow about leaps (expiring more than 6 months later) and are up 50-70%. Would you still take profit or ride?", "score": 2, "replies": []}, {"body": "Giant wall of text and zero actual positions.\n\nBased on your graph you must have had a lot of TSLA options.", "score": 2, "replies": []}, {"body": "Here's how to make money in 2020.  Buy literally anything during the March dip.  I knew fuck all about stocks or options and still had a 50 bagger  buying ostk.", "score": 2, "replies": []}, {"body": "what a time to be alive for a retail trader\n\none had to work for 20-30 years to become a millionaire in a high paying job if they came from nothing\n\nnow easy access to options allows a select lucky to bypass this and create money out of thin air", "score": 2, "replies": []}, {"body": "Taxes boutta fuck you harder than I’m gonna fuck your wife", "score": 2, "replies": []}, {"body": "Congrats! A great post! I also got great returns in the past two years, less than yours in percentage wise, more in money wise because of large initial portfolio.  \n\nMy approach is quite different, I mainly invest in stock and long term leap, and sell short term calls against it, the so called PMCC.  \n\nMy personal advice is that you can start to understand fundamental analysis, and invest more based on fundamentals, and in the meantime using your trading skills to enhance&protect portfolio. As portfolio grows bigger, I do believe it’s better to invest as main part, trading as supporting part.", "score": 2, "replies": [{"body": "I couldn’t help but take a moment to reply to this because it’s a brilliant comment and really one of the few I can actually coherently respond to haha . PMCCs are great. I didn’t go into the detail but some of the calls I wrote were against Leaps and they are indeed  beautiful. I prefer the term diagonal calendar spread to sound cooler haha but PMCC is very well known. 🙂\n\nThat’s my intended path moving forward. Sell weeklies on stock. The leaps are good but I’m apprehensive to use that as collateral particularly because I’ve built this up to a pretty good number now. Care to share what delta you use on your LEAPs. I used 0.7 sometimes 0.8 but I wonder if the risk on a lower delta is worth it for the leaps? Probably not given there’s no incentive to take even more risk YET...\n\nGreat comment! Thanks for your input", "score": 4, "replies": [{"body": "You can sound like a dick and say synthetic covered calls as well", "score": 3, "replies": []}, {"body": ">0.8 delta. I typically buy stocks as collateral these days.  Only buy 2-3years ahead leaps during market correction when panic sell happens.  I use ITM leap more as a leverage when I see a significant discount.", "score": 2, "replies": []}]}]}, {"body": "Liked and saved\n\nThank you sir for your contribution", "score": 2, "replies": []}, {"body": "How done this was know I not. That fake it is I am certain.", "score": 2, "replies": []}, {"body": "I like how all the comments ignore the fact that this guy is actually kinda smart about investing in options\n\nHe doesn’t belong here", "score": 4, "replies": [{"body": "What is this word “investing” you use?", "score": 4, "replies": [{"body": "Yeah I don’t know. He used it in the same sentence as options for some reason.", "score": 2, "replies": []}]}]}, {"body": "This about as believable as wsbgod", "score": 2, "replies": []}, {"body": "See, Jews are good with money! Someone needs to tell that guy that his friend is going to be alright.", "score": 3, "replies": []}, {"body": "TIL 2,792% is the same as 3000%....who the fuck rounds up 200%+ on their gains, weird as fuck", "score": 2, "replies": [{"body": "Agreed but why did you round 208% to 200% and not 210%? 10% is nothing to scoff at according to OP 😂", "score": 4, "replies": []}]}, {"body": "lol wat a pile of bs. this retard gambled, won big on the lottery unlike most other poor schmucks who lost big and now has sage words of advice about wat he did. Congrats to the OP and everybody else, do NOT listen to any of his advice unless you want to lose your shirts!! This part cracked me up- when you get to 100k take Margin of 100k!!! hahaha wat could go [wrong](https://www.reddit.com/r/wallstreetbets/comments/j3fw59/im_officially_done/?utm_source=share&utm_medium=web2x&context=3)", "score": 1, "replies": [{"body": "Dang dude. That’s crazy. \n\nTl;dr dude gambled AMD puts and stock mooned. He lost 100k then made a suicidal comment.", "score": 3, "replies": []}]}, {"body": "[Well Done.](https://i.imgur.com/MyxZgIS.jpg)", "score": 1, "replies": []}, {"body": "Can you recommend any resources for learning technical analysis and indicators?", "score": 1, "replies": [{"body": "Check Dan Takashibon youtube , I could understand a bit atleast", "score": 2, "replies": [{"body": "For those looking... Dan Takahashi", "score": 6, "replies": []}]}, {"body": "Rayner Teo", "score": 1, "replies": []}]}, {"body": "The best part about this is that it would take him damn near an entire month just to withdraw all of this money if he wanted to. Not to mention he'd have to withdraw what he's gonna owe the tax man through the course of an entire week lmao.\n\nI wish I could have that problem :-/", "score": 1, "replies": [{"body": "As a peasant who just loses money yoloing everytime, why does it take that long to withdraw?", "score": 2, "replies": [{"body": "Robinhood 50k per day limit withdrawal or something.", "score": 2, "replies": []}, {"body": "Robinhood", "score": 1, "replies": []}]}]}, {"body": "\\-80% when your robinhood account gets hacked and only 250K was backed", "score": 1, "replies": []}, {"body": "Did you invest in any dividend stocks?", "score": 1, "replies": []}, {"body": ":)", "score": 1, "replies": []}, {"body": "the chart looks identical to Tesla", "score": 1, "replies": [{"body": "so you're saying.... calls on Tesla??", "score": 2, "replies": []}]}, {"body": "Congrats and thanks for the post! I have been on a 5 year trading journey and I feel like have learned a huge amount and I can see it in my account balance and ability keep cool and recover if I do take on some losses. It is good to hear your experiences and tips, very helpful. Before this year I never really had much profit but also did not myself the capital of at least 25k to avoid getting stuck in trade because of PDT rule, currently I am at 35k but I was at 42k just a few months ago and I learned a couple hard lessons.", "score": 1, "replies": []}, {"body": "Sir,  we need to fuck your mother", "score": 1, "replies": []}, {"body": "Hey just a question- why not sell puts when the stocks you own is tanking? Wouldn’t you collect more premiums and less likely to be assigned?", "score": 1, "replies": []}, {"body": "Obligatory great job and fuck you.", "score": 1, "replies": []}, {"body": "Ayyy, grats and fuck you", "score": 1, "replies": []}, {"body": "Thank you for the advice I’ve been looking for this. Put in 6k high was 12k and I dropped to 1k I’m at 3k rn and I’m starting to trade rather than play the lotto. Thanks again", "score": 1, "replies": []}, {"body": "Thank you for taking the time for this.", "score": 1, "replies": []}, {"body": "congrats and fuck you", "score": 1, "replies": []}, {"body": "what were the trades that caused the latest spike?", "score": 1, "replies": []}, {"body": "I feel like I just wrote this to myself from the future.", "score": 1, "replies": []}, {"body": "Great write up, started trading at 19, hoping to hit $1m portfolio mark by 30. Slow and steady", "score": 1, "replies": []}, {"body": "See", "score": 1, "replies": []}, {"body": "Congrats and fuck you", "score": 1, "replies": []}, {"body": "Came for the ambiguous \" Fuck You \" comment!", "score": 1, "replies": []}, {"body": "Still made breaddddd", "score": 1, "replies": []}, {"body": "Congrats, and FUCK YOU.", "score": 1, "replies": []}, {"body": "OP, please help me, why do you recommend atm calls over otm calls? Have there been times where you used calls that had expiries less than 2 months recently?", "score": 1, "replies": []}, {"body": "Mfers salty up in here", "score": 1, "replies": []}, {"body": "Please update us on your loss porn when you blow your account", "score": 1, "replies": []}, {"body": "Awesome post. I bookmarked it so whenever I have money again I can refresh.", "score": 1, "replies": []}, {"body": "What was that about Survivor Bias?", "score": 1, "replies": []}, {"body": "Tldr: Aapl c $135 10/16", "score": 1, "replies": []}, {"body": "This guy got it, but he don't get it.", "score": 1, "replies": []}, {"body": "Lmao there's extreme jealousy in a lot of these replies.", "score": 1, "replies": []}, {"body": "You mentioned some indicators but what are you looking for for entries?", "score": 1, "replies": []}, {"body": "WTF, when did this sub turned from degenerate gamblers who are aware enough to know they're gambling, to degenerate gamblers with delusion of grandeur who thinks they're the next WB. \n\nThis is like WSB turning into investing and stocks subs.", "score": 1, "replies": []}, {"body": "Fooled by randomness", "score": 1, "replies": []}, {"body": "“Congratulations on your conquest of the west coast”", "score": 1, "replies": []}, {"body": "Zero rockets in this post, I don't believe a word of it.", "score": 1, "replies": []}, {"body": "Guys. A lot of you are saying hur dur its just luck. And lot of it is. But a lot of things are luck and you can still win at them. \n\nHis point about setting a floor for losses and an area to start taking gains out is a big one. In addition to this you shouldn't be taking positions that can blow past the loss floors like weeklies unless you accept your own degenerate.\n\nThose that have blown their accounts honestly examine what happened. Im guessing its a situation where you did not respect a loss floor or did not set one.\n\nI have blown my account and it was because I put it all in on weeklies. I.e. positions that can easily blow past a -20% stop loss in seconds.", "score": 1, "replies": []}, {"body": "Thank you. Hope to be in your shoes soon. Fell off the cart in Early sept and lost 50% but the climb back has been challenging and fun and ive enjoyed the learning", "score": 1, "replies": []}, {"body": "You're my hero!", "score": 1, "replies": []}, {"body": "I'm sorry, but did you skip the part where you went from $100k during COVID crash to $1.2mil today? I missed that part. \n\nCan you elaborate beyond \"used v-shaped recovery to supercharge my portfolio?\"", "score": 1, "replies": []}, {"body": "Dad?", "score": 1, "replies": [{"body": "Yes", "score": 1, "replies": []}]}, {"body": "As a new options day trader, I'd have to say #7 is the most important followed by #6 and then #8. These will help you grow your account", "score": 1, "replies": []}, {"body": "Your post was so inspirational, it actually made me tear up. As someone that’s pretty young, it’s kind of motivating to read this. There’s so much to read/learn and digest. Thank you for telling us your journey and the wisdom you have learned along the way.\n\nAMD 120c 10/9.", "score": 1, "replies": []}, {"body": "Hey man. Glad you made it! Thanks for the suggestion. I just end up thinking so much about strats and idk what gets to me. I’ve been in it since august 3rd. Got in on CBAY and SRNE back then, they didn’t print and I abandoned ship. 25k down to 23. Then came sept 2, start of correction. I decided fuck it, buy spy puts and ride the wave. I bought 5 puts of 500 contracts each priced at 0.01. All of them printed. I pulled out the next day, figuring I saw tesla down. I heard the snp was announcing something that weekend and knew about the tesla talks for the SNP. I assumed they would announce it, plus Labor Day could be good to the market and we’ll be up on Monday. I now have 40k in my account. I go to sleep. Monday, the SNP denies tesla and opens conversation with 3 other automobile companies. It was then that I saw that my demise was on the line. 17k at open, by the time I could sell my TSLA calls and AAPL too, i was at 15. Slowly bled, until 14...13... now I’m at 12. Barely moving from the 12 mark because I wince at losses and get FOMO and buy wrong. I want to just see 25k ASAP on my account before this panicked feeling I get goes away. IV on tesla is too much. 10/23 600 calls are like 3 bucks each. Theta is eating delta and gamma but its still up 60 percent today", "score": 1, "replies": []}, {"body": "When do I stop scrolling?", "score": 1, "replies": []}, {"body": ">take profit at 20% upside and cut losses at -10% downside. On paper, with this math you can never lose.\n\nThe fact that you don't understand this basic math says it all (protip: why cut losses at whooping -10%, cut losses at -1 cent and become a billionaire next year!). If you want to give a good advice just slap I GOT LUCKY THIS YEAR BOIS across your screenshot.\n\nI know you wrote it with good intentions. When everything goes your way for a while it is too tempting to start believing that you cracked the code, it's not just a dumb luck, you put lots of hard work into all those years of research and it is finally paying off, others just don't have your knowledge. But the sad truth is all those technical indicators and complex strategies are nothing more than superstitions of a gambler. \n\nThere is no technical indicator that could give you any slightest edge, all greeks are useless (yes they describe the option and all the probabilities, but knowing that gives you exactly zero edge, you just know the odds of your lottery), no strategy gives you any advantage only eats away from your profits the more complex it is due to fees. \n\nTo understand this try to come up with the most stupidly retarded strategy and behavior possible where you would lose every single time. Cut your winners short, buy high and sell low etc. Sounds very simple right? But guess what, not only you won't be able to come up with always losing strategy, you wont be able to come up even with a strategy that is guaranteed to lose just 51%, otherwise you could just reverse it and become a trillionaire by the end of 2020. Buying all those retarded out of the money options for 1 cent has exactly the same winning probability as your \"safe\" ATM strikes, \"letting your winners run\" is exactly the same as \"letting your losers run\" and so on, it's all just a meaningless fluff not different than just tossing a coin. \n\nCan you come up with a winning strategy for a coin toss? You can't for the very same reasons, you can study historical coin tosses for past 50 years and plot 50 indicators on your graphs it wont give you the slightest edge in a game against a monkey.\n\nSee how much I wrote all because I got jelly, but I feel better now. So... those 2 sigma bollinger bands are pretty dope huh, will go add them to my charts, thanks man.", "score": 1, "replies": []}, {"body": "If a stock flies 10%, why would you sell puts?", "score": 1, "replies": []}, {"body": "Pay your taxes you cumdumpster.", "score": 1, "replies": []}, {"body": "Happy for OP but if a million monkeys throw darts, one of them is going to hit the bulls eye.", "score": 1, "replies": []}, {"body": "hope you cashed out lol", "score": 1, "replies": []}, {"body": "Great post!!!!!", "score": 1, "replies": []}, {"body": "Great post OP! \n\nQuestion: do you take profit once the candlestick reaches the edges of the bollinger band? Or wait for confirmation? Etc? What are the specifics, if you don't mind me asking?", "score": 1, "replies": []}, {"body": "tldr\n\n2020 aint over yet bitch", "score": 1, "replies": []}, {"body": "If you write more than 3 sentences in a post you're just a gigantic faggot\n\nNice essay, faggot", "score": 1, "replies": []}, {"body": "You bolded a legal disclaimer in your post on WSB you self righteous ass, fuck you.\n\nAnd that's it, fuck you.", "score": 1, "replies": []}, {"body": "This guy fucks", "score": 1, "replies": []}, {"body": "Beautifully written. I am a little late to the party but believe I am learning fast.", "score": 1, "replies": []}, {"body": "I wish there were more post like these.  I actually learned something..  Iv only been using candle stick patterns ..but using the RSI +  Bollinger bands after a couple YouTube videos on how to use them I think I can use these to my advantage. Thank you for this post.", "score": 1, "replies": []}, {"body": "Buy on red days is a good play. Far out dte", "score": 1, "replies": []}, {"body": "How the hell did you have 90k to start investing with at 33?", "score": 1, "replies": []}, {"body": "After WSBGod I don't believe anything posted on here...you can easily change dollar amounts in Robinhood web browser by editing the page.\n\nA video also proves nothing...I work in VFX...I could make a video of me refreshing a webpage showing I have 50 million dollars and NOBODY would know.", "score": 1, "replies": []}, {"body": "Survivor bias, lol", "score": 1, "replies": []}, {"body": "Way too long. Adderall hasn’t hit yet. Congrats sir. Seems like you’re only semi retarded", "score": 1, "replies": []}, {"body": "Jeez loan me a hundred bucks", "score": 1, "replies": []}, {"body": "Great write-up.  Thanks for taking the time to help enlighten us, I love reading motivating posts like this.  Sometimes it's hard to remember it's a marathon and not a race.", "score": 1, "replies": []}, {"body": "\" Anyway, started dabbling in options in 2016 and I probably went about it the wrong way. My first foray into the options space was via long calls (which I realized later is actually only recommended for Options \"Veterans\" and not for those starting out as novice traders). Got burned A LOT along the way\"  \n\n\nCan anyone elaborate on this?   \n\n\nI started trading options since two days ago, and I've been placing long calls OTM since i'm on low capital and I figured that because I believe the asset related to this option was going to increase in value.   \n\n\nI opened & sold both calls on the same day I bought them. Raking in 20% profit on the trade each time.   \n\n\nBut reading this I'm guessing I was just lucky.  Why is this recommended for veterans? what should a novice trader turn to instead?", "score": 1, "replies": []}, {"body": "Please add more of whatever you deem worthy.", "score": 1, "replies": []}, {"body": "First ever reddit post, no positions, bullshit advice, 3,000% returns, 1M in Robinhood.. Yeah.. Wsb is retarded", "score": 1, "replies": []}, {"body": "If you expect me to read all this you are more retarded than I am. Chart or GTFO. Positions at bottom.", "score": 1, "replies": []}, {"body": "The gains are more if its farther otm tho. I'm not saying like 2x market price but if youre buying contracts like a year out isn't it better to buy them otm?", "score": 1, "replies": []}, {"body": "So dude got lucky on AMD and wrote a wall of text telling others how to trade.  Started trading options in a bull market and has never really traded in a bear market - sorry, but I am not counting that 30 day blip in March.  Buying blue chips or options on blue chips works until it doesn't.  At some point we will have an extended bear market and you had better be prepared to change your strategy.", "score": 1, "replies": []}, {"body": "Sooo OP... what is your plan today on a POTUS-is-covid-positive day?   \n\n\nAlso great post, its amazing learning from other peoples mistakes and success!", "score": 1, "replies": []}, {"body": "damn you had $50K of fuck around money at 27? thats legit af.", "score": 1, "replies": []}, {"body": "\"What changed?\" Tesla and Amazon went up by hundreds of dollars each day lol\n\nSerious note: nice work OP. You and a couple others that hit the 7 figure mark have a few rules in common that I follow as well:\n\n\\- Pick an expiration 1-2 months out\n\n\\- Pick a strike 10-15% off current price and is something you think it could reasonably hit\n\nBefore I buy anything, I come up with a story why a stock could hit XXX by YYY. If it's believable, I pull the trigger. Good luck on your next chapter!", "score": 1, "replies": []}, {"body": "What tool do you use for technical analysis?  Willing to pay for a non-sub software, or if there's a good free one that would be lit.  Thanks.  I've been buying FDs with 0 technical analysis like a true autist and would like to learn", "score": 1, "replies": []}, {"body": "Good job but PAY YOURSELF. Move money out of your trading account into your cash account, say 10% of monthly gains. As long as it's on the table it's not yours, so put it in your pocket.", "score": 1, "replies": []}, {"body": "Congrats and fuck u", "score": 1, "replies": []}, {"body": "From experience I think points 6 and 9 are the most important\n\nGreat post!", "score": 1, "replies": []}, {"body": "Lmao. So many haters in this thread. Y’all really expect that there is some magic sauce that someone could give you? Then get salty when he says stuff that we all know but don’t do??\nBe happy for the OP. Maybe one day it’ll be you.", "score": 1, "replies": []}, {"body": "12x .. meh", "score": 1, "replies": []}, {"body": "Thick. Solid. Tight.", "score": 1, "replies": []}, {"body": "This is I aspirational.\n\nEdit: inspirational! Why phone? Why?!", "score": 1, "replies": []}, {"body": "I never understand the whole taking profits thing... like if I’m up 20% on Apple, in my mind why would I take profits? To just reinvest them into apple? Given enough time I feel Apple is only going to go higher.", "score": 1, "replies": []}, {"body": "look at that I used some these ideas and made money today playing KMX in shares and Puts on TWTR- pulled out Twtr with a 23% gain and KMX shares at 1.8%+", "score": 1, "replies": []}, {"body": "I love it when someone makes a ton of money gambling on options, lacks the self awareness to realize they were just lucky and goes on to write a massive post with their trading tips as if they actually knew how to predict the market's moves. It would be no different if someone won the jackpot playing slots and did a write-up on exactly how they pulled the handle to win.", "score": 1, "replies": []}, {"body": "Fake and gay. \n\nRobinhood viral marketing campaign.", "score": 1, "replies": []}, {"body": "OP, what shares do you hold? If any? \nCurious to know. Feel free to share or PM.", "score": 1, "replies": []}, {"body": "How’s this bro gonna come in here and not post positions.", "score": 1, "replies": []}, {"body": "What were your positions/moves between March to September that took your portfolio from 100K to 1.4 million?\n\nWere you invested mostly in stocks or calls/puts?", "score": 1, "replies": []}, {"body": "Hey, great work on your portfolio! A few questions: \n\n1) What is your day job? \n\n2) how much earn in your day job? \n\n3) I read your writeup thoroughly and i still dont understand what stocks or options made you this kind of returns. Can you please clarify. \n\n4) Finally, what did you do to become this lucky!!??", "score": 1, "replies": []}, {"body": "Where the TLDR? Not reading all this", "score": 1, "replies": []}, {"body": "Great post, thanks", "score": 1, "replies": []}, {"body": "How or where did you get the stonks you bet on?", "score": 1, "replies": []}, {"body": "Congrats! \n\nI’m lucky to see many similarities in your way of thinking and mine. Made ~10k in the last two months and used several things you mentioned.\n\nA key mindset I read and which seems to be somewhat true is. Buy when you want to sell. Place your order where you would place your SLs. \n\nAnd ofc a lot of luck if someone asked me how I made 10k in 2 months I’d just answer: luck", "score": 1, "replies": []}, {"body": "I appreciate the effort to write your essay but we only look at the pictures. Congrats and fuck you", "score": 1, "replies": []}, {"body": "You had nerves of steel. Well played", "score": 1, "replies": []}, {"body": "Solid post. Basically your favourite strategy is still buying naked calls/ puts? No spreads ?\n\nAlso, you know you're a beast and consistent when your liquidity chart looks like AAPL chart lol. \n\nCongrats", "score": 1, "replies": []}, {"body": "Very well written. I'm saving this post so I can revisit it again for inspiration in the future", "score": 1, "replies": []}, {"body": "thats a lot of words but i did click the link congrats fuck u", "score": 0, "replies": []}, {"body": "Saved", "score": 0, "replies": []}, {"body": "Man I love seeing shit like this I’m happy for your success enjoy brother !! Also I appreciate you for taking the time to write this I’m starting and I will take everything to write to my notes. Once again congratulations and thank you !", "score": 0, "replies": []}, {"body": "Thank you so much for this 🙏🏼", "score": 0, "replies": []}, {"body": "!remindme tomorrow", "score": 0, "replies": [{"body": "There is a 3 hour delay fetching comments.\n\nI will be messaging you in 1 day on [**2020-10-02 23:30:00 UTC**](http://www.wolframalpha.com/input/?i=2020-10-02%2023:30:00%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/j3fx2r/3000_in_2020_my_journey_to_the_golden_7_figure/g7cdyn5/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fj3fx2r%2F3000_in_2020_my_journey_to_the_golden_7_figure%2Fg7cdyn5%2F%5D%0A%0ARemindMe%21%202020-10-02%2023%3A30%3A00%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20j3fx2r)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "You forgot \n\n10. You get bored and yolo everything on DKNG SPCE AND NKLA and lose everything in a day. Make sure to post your loss porn on reddit and say it’s only money. You didn’t really need that million anyway!\n\n11. Make sure to hold your million dollars with an extremely shady millennial brokerage that has no customer support line and has consistently crashed or locked its users out for days on end.", "score": 0, "replies": []}, {"body": "Thanks.\nIncredibly helpful.\nConfirms the path I am on so far.", "score": 0, "replies": []}, {"body": "Love this post. A lot of gold advices in here. Congrats man !", "score": 0, "replies": []}, {"body": "Congrats bro. When do you sell your options positions, after 20% or 100%?", "score": -2, "replies": [{"body": "If you read his post completely you would sell +20% gains and cut -10% loss plays.", "score": 6, "replies": [{"body": "Fuck that noise. My failures are +25% gains. Never sell until +66% so that you’re still getting 50% profits after tax.    \nSource: Up 85% in the last 5 months. Not confident, just cocky", "score": 2, "replies": [{"body": "ez to do in a bull market", "score": 2, "replies": [{"body": "True. I’d be up 150% too if I hadn’t lost 65% of my gains", "score": 2, "replies": []}]}]}]}]}, {"body": "Fuck you, show off.", "score": -1, "replies": []}]}
