{"title": "Apocalypse is priced into Hotel REITs at the dawn of their golden age... I’m leveraged to the tits 🌰🌰", "selftext": "Coming hot off [my RIVN play](https://www.reddit.com/r/wallstreetbets/comments/13cn3hx/rivn_is_undervalued_and_oversold_im_leveraged_to/) a couple months ago... Today I want to tell you why the market has completely mispriced **Hotel REITs** in the midst of the commercial real estate meltdown. Trading at a fraction of their pre-COVID stock prices on the very cusp of their golden age, leading to the opportunity for a **400%+ return**.\n\nTried and failed to cut this down, **scroll to the end if you want the TLDR**, or just read the sections of interest. Took weeks to put together and I think I've accidentally stumbled into something huge.\n\nhttps://preview.redd.it/kjq2gqjegpbb1.png?width=1280&format=png&auto=webp&s=15c42fab9ccb8b1eae70917bc5a30ed037d5dcb8\n\nAlso for those who’ve been asking; yes I held my Rivian. My portfolio is up 172% year to date. Yes I see it going higher still, yes I haven’t sold a cent. Still leveraged. Still autistic.\n\nhttps://preview.redd.it/rb3240ghgpbb1.png?width=450&format=png&auto=webp&s=dc7773872abf5cd425a2580882793dba1ed14ac2\n\n&#x200B;\n\n&#x200B;\n\n# What’s A REIT?\n\nIf you don’t know what a REIT is you’re not knowledgeable enough to do this trade, stick to $SPY.\n\nReal Estate Investment Trusts (REITs), are stocks that hold real estate and pay out the majority of the rental income as dividends. Basically they’re high yield dividend stocks, with moderate capital appreciation as the real estate they own goes up. Typically they are servicing a lot of debt from buying the properties.\n\n&#x200B;\n\n&#x200B;\n\n# What Happened To Commercial Real Estate? 🤯\n\nCommercial real estate has been destroyed, particularly for inner city offices. Vacancy rates are soaring, work from home is shrinking office footprints. Interest rates are hurting the mortgages and commercial REITs are down 50-70%.\n\n[Office vacancy rate](https://preview.redd.it/d7fps6yigpbb1.png?width=1028&format=png&auto=webp&s=52f0d0e2c5c411bcf03d6a1ebe8bdf8bf7156211)\n\n&#x200B;\n\n&#x200B;\n\n# What Are Hotel REITs?\n\nHotel/hospitality/lodging REITs own hotels and resorts, usually franchised from brands like Hilton or Marriott. The revenue from visitors, after service costs, renovations and mortgage repayments is paid out as dividends. \n\nUnlike other commercial real estate, their “rental” income is day to day, not multi year contracts, which means they have incredible ability to adjust pricing.\n\n&#x200B;\n\n&#x200B;\n\n# 🏨🏨 The Grand Hotel REIT Mispricing 🏨🏨\n\n# Hotel REITs Are Performing Like Hotel Businesses\n\nYou would assume there’s a strong relationship between hotel brands like Hilton, and businesses like “Parks Hotels & Resorts” that franchise Hilton.\n\nBoth respond to the same leisure market, with the franchisor enjoying high margin and less downside during the bad times, but the low margin franchisee receiving more upside in the good times. We can see this holds true during the last few tough COVID years:\n\nhttps://preview.redd.it/0pkkruemgpbb1.png?width=1248&format=png&auto=webp&s=10d2e37526e5695d34cd628f4f273fab4a5ba0b8\n\nhttps://preview.redd.it/29q2174ngpbb1.png?width=1284&format=png&auto=webp&s=69999f619576849e8d94c0116be17af48e737165\n\nHilton has done better through the tough times (as expected), and debt is better serviced by profit, but overall they’re directionally headed the same way. We’d assume that Hilton definitely deserves to be performing better, particularly during the rough COVID years, but as leisure normalises the performance gap will narrow.\n\nBut performance has **only grown wider**. $PK is trading *50% lower* than it was pre-pandemic while $HLT is trading *30% higher*. A dollar invested in $HLT pre pandemic is worth 2.6x what one in $PK would be. Hilton now trades at a market cap of $39b, Parks at just $3b.\n\n[Hilton: Blue | Parks & Hotels: Purple](https://preview.redd.it/r3o6krjqgpbb1.png?width=1248&format=png&auto=webp&s=c1a8b4cc48c0e3e4d7dec102faf373f7fa2d341c)\n\n&#x200B;\n\n# Hotel REITs Are Performing Like Hotels... But Trading Like Office REITs\n\nWhen we throw in an Office REIT ($BXP) it becomes clear what’s happening. The recent performance of $PK and $BXP look like two snakes fucking:\n\n[Hilton: Blue | Parks & Hotels: Purple | An Office REIT: Light Blue](https://preview.redd.it/p49pdwqvgpbb1.png?width=1248&format=png&auto=webp&s=1be74b787af7680ea0f4d28618ab0a6caa81c408)\n\nHotel REITs are trading in step with Office REITs, but the market drivers for offices and hotels are *completely* different. Offices are facing headwinds, but hotels are the complete opposite.\n\n&#x200B;\n\n&#x200B;\n\n# Leisure Demand Is BOOMING\n\nWe are about to surpass the demand for leisure seen in 2019, after years of pandemic. Even better, demand is predicted to continue to rapidly increase:\n\nGiven years of weak demand and tighter credit, there’s signs hotel construction has slowed, which means higher demand will meet undersupply. Hotel REITs swing on the margin, expect greater pricing power and occupancy rates, significantly boosting profit.\n\n[Leisure \\(hotel\\) demand](https://preview.redd.it/jstqn9lzgpbb1.png?width=1248&format=png&auto=webp&s=7fb474bb5d17b84eaa9b80af16545e5e5d3ccd5b)\n\n&#x200B;\n\n# Future Is Bright For Bougie Vacations\n\nLuxury upmarket resorts benefit from many tailwinds. \n\nAI will deliver productivity gains in the midterm, increasing wealth and free time. This leads to more interest in leisure activities and drives demand further up the price curve.\n\nResorts don’t suffer from the reduction in business travel from video conferencing. Or the reduction in asset valuation that the inner city faces from WFH.\n\n&#x200B;\n\n&#x200B;\n\n# Interest Rate Panic Is Subsiding\n\nDespite the intense panic, inflation is continuing to moderate and the fed is making more dovish moves. The end is in sight for rate hikes, there won’t be the need to push to ludicrous levels. This is the primary fear for panicky REIT investors, as REITs have large interest rate sensitive mortgage burdens. As this situation improves they will return.\n\n# \n\n# Great Depression Panic Is Subsiding\n\nWe may have a recession, but if so it’s looking like it’ll be mild. Economic indicators keep coming out strong. The reason we’d have a nasty recession is the fed pushing rates higher and that is less likely now. The second major fear for panicky REIT investors is an economic collapse destroying both property income and valuations. As this situation improves they will return.\n\n&#x200B;\n\n&#x200B;\n\n# Property Valuations Are Too Low\n\nHotel REITs are valued “per key” or per hotel room. Hotel REIT Hersha recently sold off some of its properties ranging from $360k/key to $455/key, with the higher end being more indicative of its portfolio. Yet market cap put the per key valuation of Hersha at $300k/key.\n\nHotel REITs are trading below their shareholder equity, Hersha has over $700m in shareholder equity, yet trades at a market cap of $300m.\n\n&#x200B;\n\n&#x200B;\n\n# Hotel REITs Are Seeing Insider Acquisition\n\nhttps://preview.redd.it/4bhml9z2hpbb1.png?width=1592&format=png&auto=webp&s=22e30cc9cbe8d2e3f412d157bd83fbde58979be8\n\n&#x200B;\n\n&#x200B;\n\n# The Bad\n\nREITs have high debt to market cap which makes them vulnerable.\n\nIn the case of a severe recession REITs will suffer from reduced income and reduced asset values. They will have to sell assets to cover interest repayments at artificially low prices. Given they’re low margin businesses, they’re more vulnerable in downturns.\n\nIf the rate hike cycle has much further to go, repayments will increase and valuations will fall. Although most hotel REITs are partly hedged for the next few years.\n\nIn the case of unexpected environmental disasters like wildfires or hurricanes, hotel REITs suffer significantly from damage to their locations, closures and reduced demand.\n\n&#x200B;\n\n&#x200B;\n\n# TLDR - The Coming Hotel REIT Golden Age 🏨\n\nOk so you scrolled past my autistic ravings and just want to know what stonk to buy?? Rude.\n\n[TLDR](https://preview.redd.it/ygivwu96hpbb1.png?width=1646&format=png&auto=webp&s=8ece82de5b142790a80c4b938f36b562711af555)\n\nHotel demand is skyrocketing. Hotel supply has been constrained, due to tough COVID years and tighter credit. The outlook for hotels with productivity driven wealth growth and reduced work hours is amazing. The economic fears that kept REITs down are abating.\n\nThis has caused hotel stocks to surge, yet the stocks of Hotel *REITs* are trading as if they own offices, down 70%+. Offices have genuine headwinds, in contrast to the tailwinds for leisure. \n\nThe hotel valuations are artificially low, with Hotel REITs trading at half their shareholder equity. They’re priced like they’re offering submarine trips. The apocalypse is already in this price, so it’s difficult for them to go down much further and very easy for them to go up much higher.\n\nGiven the golden era we’re about to enter, I expect profits to soar and hotel valuations to soar, leading to Hotel REITs exceeding their 2019 highs. This represents a 400%+ increase on current prices.\n\nThis is a sector play and most Hotel REITs will do well. I believe the REITs that do the best will have less exposure to inner city business travel and more exposure to vacationers. Upmarket will outperform value accommodation.\n\nFor that reason **I’m personally buying** **Parks Hotels & Resorts ($PK)** for its smart management. I'm also buying a REIT with a portfolio focused on upmarket luxury resorts and aggressive acquisition strategy - but it's currently just under the $500m limit so unless mods tell me otherwise you'll have to do your own research.\n\nThis is the grandest mispricing I’ve ever discovered. Stumbling upon this and gradually realising the size of it was such a thrill. Putting this together has been a blast, even if I have come across as a madman to my friends/family these past weeks.\n\nThanks to everyone who has read my hot takes over the years, special thanks to those who didn’t even call me a regard. All the best from one to another.", "id": "14ygnwk", "created_utc": 1689242650.0, "score": 523, "upvote_ratio": 0.91, "num_comments": 256, "comments": [{"body": "Postions/play?", "score": 1, "replies": [{"body": "As you wish. These are all my open positions (I'm buying $BHR), plus I have $10k on 5x leverage in eToro on $PK. I have $3k left in my bank account and I make $40k a year cause I work at a startup. \n\nhttps://preview.redd.it/deifiasowpbb1.png?width=1235&format=png&auto=webp&s=95ecb9f79fe89c4ad7d09ccb031095c18d518aa4", "score": 43, "replies": [{"body": "Okay so, i really like the post and i truly appreciate the DD. But i cant allow a 256m mc penny stock where the bid/ask is $3.43-$4.02\n\nActually ill leave post up because it doesn’t mention it but please for the love of god people dont buy this garbage", "score": 137, "replies": [{"body": "LAME, I'm gonna yolo into it out of spite.", "score": 142, "replies": [{"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|8882)![img](emote|t5_2th52|27189)", "score": 37, "replies": []}, {"body": "This is the way", "score": 9, "replies": []}, {"body": "Is that a ticker symbol I should buy?", "score": 5, "replies": []}]}, {"body": "To be fair this is better analysis than stuff I’ve seen recently and that bid/ask was premarket. avg mkt $ volume is like $1m/day, smallish. I think overall “hotel reits trading under 1b are undervalued, here is a list” seems like pretty fair game", "score": 18, "replies": []}, {"body": "Inverse Cramer= inverse WSB mods", "score": 6, "replies": []}, {"body": "To be fair, there is a whole lot of seriously unprofitable and sometimes possibly fraudulent flaming garbage that has been bid up mindlessly (CVNA, DASH, FSR, etc.), so people get to talk about it here...and yet there are a lot of well-run REITs that have real operating assets and cash flow and are smaller as a function of their age, asset class, and geography - and we wouldn't get to talk about them due to their size even though they can make for some great plays. \n\nREITs are required by tax law to distribute 90% of their taxable income every single year, so their valuations are mostly stable as real estate cash flow tends to be stable. In some respects buying a REIT is akin to investors buying a bond or taking an LP position in a real estate deal. However, the underlying valuations can swing based on asset class market dynamics (e.g. office not being so great right now) and capital markets dynamics (i.e. high interest rates impacting refinancings and also cap rates for valuation) so there are some real opportunities for some WSB-style plays on small-yet-quality REITs.", "score": 6, "replies": []}, {"body": "Same guy who never posted his RVN positions (protip he probably was too early and lost money)", "score": 10, "replies": [{"body": "dude said \"year to date\" gains LMAO. dude is down big\n\n&#x200B;\n\nhey OP, GTFOH", "score": 17, "replies": []}]}, {"body": "Why would you leave it up just because he didn't mention it? Sets a precedent", "score": 4, "replies": [{"body": "Bro this isn’t a courtroom… its a pretty decent DD", "score": 8, "replies": [{"body": "Yeah, I agree it's a good trade idea.", "score": 1, "replies": []}]}]}]}, {"body": "Lmao, writing a massive essay about an $8k play into a microcap.", "score": 15, "replies": []}, {"body": "Actual good dd", "score": 5, "replies": []}]}, {"body": "I accidentally unstickied ur comment but I can’t resticky it", "score": 5, "replies": [{"body": "Its all good, i saw your comment about volume. I was looking at it premarket so makes sense", "score": 3, "replies": []}]}]}, {"body": "Did this fucker say “I’m not smart enough for this trade”!?!   I’ll show him", "score": 190, "replies": [{"body": "He also called me rude for going straight to the TLDR section 🥺", "score": 35, "replies": []}, {"body": "Devious regard logic.", "score": 22, "replies": []}, {"body": "Well, I did look at the 5Y and 10Y performance of Hotels/travel etfs compared to S&P500 and the S&P500 outperformed them by a lot.\n\nThese seem like short-term gambles at best and try to avoid the pandemic years.", "score": 1, "replies": []}]}, {"body": "What's a hotel? Is that like a big Airbnb?", "score": 331, "replies": [{"body": "Imagine an entire neighborhood of airbnbs in one tall box.", "score": 184, "replies": [{"body": "And you don’t have to do the dishes, take out the trash and do the laundry before you check out and then pay an extra cleaning fee on top", "score": 41, "replies": [{"body": "No you just pay a resort fee, parking fee, service fee, convenience fee, fee fee.", "score": 18, "replies": [{"body": "And tips all around", "score": 10, "replies": [{"body": "Only in the US though.", "score": 3, "replies": []}]}, {"body": "A billing fee for being charged so many fees", "score": 2, "replies": []}]}]}, {"body": "Sounds unbearable", "score": 2, "replies": []}]}, {"body": "It's like a giant motorcycle that people live in for a bit but without any wheels.", "score": 30, "replies": [{"body": "It's this, exactly like a giant motorcycle, the only difference is that it's absolutely nothing like a motorcycle.", "score": 16, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "without cycles its just motor", "score": 1, "replies": []}]}]}, {"body": "We should start a new business that's like an Airbnb but like the whole building is mini condos, with no fridge or anything. Just rooms, we can even give every room it's own lock.  \n \nThen just rent the rooms out for like a night or a week or whatever, hire someone to manage it and staff to stay in the building and clean the rooms when people go. How has kobody thought of this yet? We gonna disrupt the disruptor!", "score": 22, "replies": [{"body": "So...public storage? ![img](emote|t5_2th52|4271)", "score": 16, "replies": []}, {"body": "Seattle has that, it's called a tiny house community.  Kind of like a tent encampment except with wooden tents.  But you're not allowed to deal Fentanyl or shoot your neighbors, so it's kind of a drag.", "score": 7, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Buncha fuckin Karens", "score": 2, "replies": []}]}, {"body": "Oh, so it’s like a Starbucks but without the lattes and Fentanyl…", "score": 2, "replies": [{"body": "We have Wendy's too.", "score": 1, "replies": []}]}]}, {"body": "Orrrr we book every room in a hotel for 3 months and then list them on AIRBNB?", "score": 1, "replies": []}]}, {"body": "After you get four houses you can upgrade to a hotel.", "score": 9, "replies": []}, {"body": "I think it’s like a vrbo but other people stay there too", "score": 13, "replies": []}, {"body": "I think so. But, like,  for old people who don't know how to use the internet?", "score": 2, "replies": []}, {"body": "Yeah, but they don’t automatically upload your stay to OF, so you have to do that by yourself afterwards.", "score": 1, "replies": []}]}, {"body": "Park Hotels just defaulted on 725m worth of hotel loans in San Francisco last month. Ashford Hospitality (another hotel REIT) just gave 19 hotels back to the lender like a week ago. I think we’re on the cusp of Something alright..", "score": 363, "replies": [{"body": "The real DD is always in the comments.", "score": 175, "replies": [{"body": "yes", "score": 10, "replies": []}]}, {"body": "I thinks San Fran is an aberration as it is a uniquely difficult market for a variety of reasons, defaulting on a SF loan is probably the smartest thing they could do right now", "score": 66, "replies": [{"body": "SF homeless fentanyl crack addicts salivating at free real estate", "score": 45, "replies": []}, {"body": "If you default on a loan the debt market will be very hesitant to offer you new debt / refi opportunities. I would be looking at their maturities disclosure to understand the time horizon of major maturity events.", "score": 17, "replies": [{"body": "They have 800 million due in 2023.", "score": 10, "replies": [{"body": "Is this in addition to the loans they turned the keys over on or does this include that $750m?", "score": 5, "replies": [{"body": "They have the big SF one they’re defaulting on that’s about 725 (maybe 750 like you said, not sure) and another 100m or so due in 2023 according to their latest 10Q.", "score": 6, "replies": []}]}]}, {"body": "But San Fran", "score": 1, "replies": []}]}]}, {"body": "There are strong indicia that the leisure demand/recovery has been debt and savings fueled. People came out of Covid desperate for leisure, and they've been dipping deep into credit to make it happen. This doesn't end well.", "score": 15, "replies": [{"body": "I enjoy strong indica", "score": 23, "replies": [{"body": "As do I...", "score": 3, "replies": []}, {"body": "I like a good hybrid myself, around 30% THC.  Grinds down the edges a little.", "score": 1, "replies": [{"body": "I mostly just use for the sleep.", "score": 2, "replies": [{"body": "CBD works great for that, very relaxing.", "score": 1, "replies": [{"body": "If you think cbd is great, wait til you try thc", "score": 2, "replies": [{"body": "LOL I have 4 THC stores within 2 miles of my house.  And I've tried them all.  But I've found that cbd works better topically for aches and pains and CBD encourages deep sleep without messing with my dream state.", "score": 2, "replies": [{"body": "Oh man, having dreams again is one of my favorite parts of thc. \n\nI will give the topical cbd a try tho", "score": 2, "replies": [{"body": "Interesting lots of people can't remember their dreams if they've been smoking regularly.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Don't buy your indica from some street dealer. Make sure you get the pharmaceutical-grade stuff.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 20, "replies": [{"body": "Lol yes this guy doesn’t understand the business. Defaulting on a non recourse loan is basically a way to sell an asset for higher than its market value.", "score": 19, "replies": [{"body": "It’s still not a great sign but definitely the right move and ok if you don’t have all your property in the drug addict shithole", "score": 2, "replies": []}]}]}, {"body": "San Francisco is a dead city. BN also defaulted on a property there but I am super bullish on them", "score": 5, "replies": []}, {"body": "It’s priced in", "score": 4, "replies": []}, {"body": "I have also been reading article after article of AirBnb owners not able to rent their place. Some saying it's the worst they have ever seen. OP also didn't go into the fact that Hilton and others make significant sums from affiliate marketing and royalty agreements.", "score": 2, "replies": [{"body": "I feel like this is AirBnB's fault for getting the product completely wrong and allowing rampant fraud and abuse of owner guidelines.", "score": 1, "replies": []}]}, {"body": "Someone add in shopping mall reits", "score": 2, "replies": []}, {"body": "That’s because San Francisco is a petty crime/junkie/liberal utopia.  \n\nCutting your trash property loose there doesn’t necessarily mean everywhere else is trash.   \n\nNo one wants to be in San Francisco", "score": 2, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Remindme! 12 Months", "score": 1, "replies": []}]}, {"body": "Park is exposed to the downsides of the current travel market in important ways.  Park was originally a spin-off from Hilton, and was built to hold many of the largest group (convention) hotels in the portfolio.  These are major urban and airport hotels in gateway cities.  San Francisco Union Square was emblematic, not an aberration.  Park has a handful of resort properties, but by and large it’s focused on center city.  This is the problem for Park — the recovery has been mostly focused on leisure and luxury, not group or business travel.  Also gateway destinations — San Fran, LA, NYC, Chicago — have been the slowest to recover due to the perceptions that they’re crime ridden and overrun with homeless (some of this is just the lack of people working in downtowns, due to WFH, but it’s a real factor in tamping down occupancies).  Anyway, I don’t think this DD is wrong about the sector overall, but Park specifically has issues, and is going to take awhile to bounce back.", "score": 1, "replies": []}, {"body": "Shocking on the San Fran default. I figured the hobos living there for free would've helped pay the bills...", "score": 1, "replies": []}]}, {"body": "I feel like someone just tried to sell me a timeshare.", "score": 251, "replies": [{"body": "After the RKLB guy, i have decided to distrust these long posts with good formatting because theyre always trying to sell you on something. If you have a good play, you should be able to explain it in 5 sentences or less.", "score": 44, "replies": [{"body": "It blows my mind that people unironically read these DDs and go \"Yeah that seems like a good idea\". I just come here to shitpost but I do appreciate the regards among us who actually yolo on these, wouldn't be any loss porn otherwise <3", "score": 23, "replies": [{"body": "Sometimes they have a decent idea, sometimes they are obvious shitposts, and sometimes they are pumping, nothing wrong with riding a rocketlab pump, or the ASTS pumps when that guy comes back.  \n \nThe problem lies with people who think you blindly buy everything and diamond hand it until entropy kills the fucking universe, then throw tantrums that they got played.  \n  \n  \nBut, shitposting is like 99.99% of the reason to come here for sure, entertainment and having fun with fellow regards.", "score": 11, "replies": [{"body": "Do you mean I have to use common sense to determine which posts are genuine and which are pump and dumps? I can just YOLO into every play mentioned here, or label every one of them a pump and dump? way way too much nuance for me, GTFOH.", "score": 5, "replies": [{"body": "Fair. Leaving in shame.", "score": 2, "replies": []}, {"body": "Maybe not you but a shit ton of dumb people do do that. They are all probably poor and divorced by now though.", "score": 1, "replies": []}]}]}, {"body": "This is the Way", "score": 2, "replies": []}]}, {"body": "I liked the TLDR being a page long myself.", "score": 24, "replies": []}, {"body": "Here's the thing, if you're one of the first people to read a post, and you see a semi-obvious pumper and he tells you where he bought in and it's still there or close and the bet isn't totally braindead and doesn't risk too much, I'll throw a few bucks into it. With the PENN play I was an early reader, got a few options a few dollars more than the OP did and waited. Post blew up, I knew I was money. I made a quick 50% gain the next morning and sold.\n\nIf you pull up on one of those posts and there's already 500 comments, and the option is double the price of where OP bought in. Don't touch it.", "score": 8, "replies": []}, {"body": "I found it to be far too coherent. I need at least one spelling error in the title or I'm out.", "score": 3, "replies": []}, {"body": "Rklb was trading .25-.30 their morning and .2-.25 last I looked. From .05-.1 \n  \nDumb people lost there. \n \n  \nEven save was .43 the night after the DD was up all night, was 1.30somethng by lunch. Then been trading from .65-.90 today. \n  \nBoth those plays were explained in a few sentences or less, rocketlab is constant shilled here, having an upcoming launch Friday was all I needed to know to have a look, set some orders and wait for the pre launch pump run.   \n \nI sold the next morning, but even if you waited till today you doubled your money.", "score": 3, "replies": []}, {"body": "Yea why isn't my stock advice given to me in 30seconds or less. /s", "score": 1, "replies": []}]}]}, {"body": "\"Two snakes fucking\" is the kind of TA I'm looking for. I'm in.", "score": 132, "replies": [{"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|27189)![img](emote|t5_2th52|4258)", "score": 11, "replies": []}]}, {"body": "Bloke mentioned AI.\n\nI'm in.", "score": 132, "replies": [{"body": ">AI will deliver productivity gains in the midterm\n\nYeah, i was on the fence until i read this. Now i'm going balls deep obviously.", "score": 30, "replies": []}]}, {"body": "[deleted]", "score": 138, "replies": [{"body": ">Nearly half a billion in debt just for a little guy like me.\n\nhow leveraged are you? ![img](emote|t5_2th52|4275)", "score": 21, "replies": [{"body": "[deleted]", "score": 15, "replies": [{"body": "I don't understand. Can you explain for a regard - are you nearly a billionaire?", "score": 5, "replies": [{"body": "just guessing, but half a billy in debt might mean a billion in gross capital, but it's the company's and the lenders', not his. Heading that business probably puts him over the 8 figure mark, but not necessarily by much", "score": 2, "replies": []}]}, {"body": "What are your DSCR requirements?", "score": 5, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "2.5 is amazing.  Lots of lenders are stress testing at 1.5 - 1.65.  I would think with a coverage ratio kicking that much ass, you'll have no problem finding attractive financing.", "score": 5, "replies": [{"body": "[deleted]", "score": 19, "replies": [{"body": "Do you usually go direct to the lender?  Most of my lending clients are still keeping a close eye on liquidity and are clamoring for deposit relationships.\n\nParticipation loans with your smaller, regional lenders can expand your options and strengthen your existing relationships.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "More is lost to indecision than wrong decision...\n\nGreat trade!\n\nI'd pitch you some CRE lending ideas, but it sounds like you're well covered.  If you ever want to open a hotel in NYS, keep me in mind!", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "You have no comment history.", "score": 5, "replies": [{"body": "4 year account though but yeah, how was anyone supposed to know he's a hotel guy?", "score": 7, "replies": [{"body": "You can find his deleted posts through google/rareddit. You couldve picked up on the fact that he has a flair + 4 year badge and no previous history  older than 1 month then figured out the rest yourself.", "score": 1, "replies": []}]}, {"body": "🤨 sus AF", "score": 1, "replies": []}]}, {"body": "Congrats on the higher RevPar and occupancy stats! \n\nHow much impact will said 20-25% rate kick do to your flow? \n\nIt's prolly good you're on 10 year paper instead of I/O like some regards. That will help with a potential value decrease from higher cap rates due to the raised debt component and higher yield requirement. \n\nI'm an appraiser (MAI)", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Are you in the right place? This place is for crayon eaters. Or savants.  ![gif](emote|free_emotes_pack|grin)", "score": 1, "replies": []}]}]}, {"body": "So inflation, basically", "score": 2, "replies": [{"body": "[deleted]", "score": 32, "replies": [{"body": "great comment, you win the internet for today", "score": 7, "replies": []}, {"body": "Isn't that the point of rates being so high right now? to combat inflation?", "score": 0, "replies": [{"body": "[deleted]", "score": 16, "replies": [{"body": "Good strategy. Also if you are really rich, charitable foundations. If just very rich, insurance is lovely to not pay taxes.", "score": 1, "replies": []}]}]}]}]}, {"body": "How does one go about buying hotels like this?  Upfront franchise fees indicate you already must have sizeable capital requirements in the 10s of millions. I imagine offer the first one it’s easier to roll into others.", "score": 2, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "Maybe you can be the one to buy the two pack (kc and atl) that fell apart lol", "score": 1, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "W Atlanta might be the only one taking a look at", "score": 1, "replies": []}]}]}, {"body": "Well that sounds pretty incredible. Thanks for the lesson, one day maybe, but not this day!", "score": 1, "replies": []}]}]}, {"body": "The best DD is always in the comments. Thanks for sharing", "score": 2, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Agree with this, found a preferred share option on OPs play with an 8% divided. NGL though, REITs make me squirt.", "score": 1, "replies": []}]}]}, {"body": "Great input, thanks for all your comments", "score": 1, "replies": []}]}, {"body": "“If you don’t know what a REIT is you’re not smart enough for this trade” goes on to explain what a REIT is.", "score": 25, "replies": []}, {"body": "Actually not looking bad. I'm for once not disappointed by the ramblings of a madman will look further into it.", "score": 58, "replies": [{"body": "Yeah it really doesn’t look bad at all. It makes sense. Where I live hotels are booming but I live near a national park. It shows people are indeed traveling though.\n\nJust not in the giant literal shitholes.", "score": 3, "replies": []}]}, {"body": "1) the debt expiring this year will be crazy expensive to refi. Capital markets (especially in some of these markets) will want a 12 DY and be SOFR+4-500.\n\nSome of these assets will need a significant pay down\n\n2) most of their assets are delapidated and have not gone through brand mandidated pips since Covid. Now that Covid times are over the brands will be looking for significant capex to stay brand-compliant. Now sure of the financial strength of the hotels to comply \n\n3) just looking at the portfolio, many of these markets are not seeing comp trades at 350-400k/key\n\n4) look at high-quality hotel trades in last 2 quarters. It has been silent. The bid-ask to is too wide right now, and will likely remain that way until capital markets settle.\n\n5) Travel demand may be up, but the business/leisure mix has changed drastically. Many of their hotels in the portfolio are not seeing the business travel back which could be their backbone (I.e. look at the W in Chicago by Willis)\n\nThis play needs a deep-dive asset by asset. Would be weary", "score": 17, "replies": []}, {"body": "Hey, thanks for posting, great stuff. It looks like PK has about $800m of debt maturing this year while HLT has no maturities until 2025, plus PK is trying to get out of San Fran hotels. Could these issues be leading to the valuation disconnect?", "score": 15, "replies": []}, {"body": "Is $INN a play here?", "score": 9, "replies": [{"body": "I'm liking Hersha Hospitalitie's preferred shares as well.", "score": 1, "replies": []}]}, {"body": "What's your timeline on the rebound? To be truly leverage to the tits, I need an expiration date", "score": 18, "replies": [{"body": "If you're doing your calls: interest rate / recession panic should ease over the next 6-12 months for which it'll probably double.\n\nOnce we get rate cuts that's when real estate is going to rip, in conjunction with an even better economy driving more travel. I'd then expect to see in the 12-24 month timeframe more than a double again to exceed the 2019 highs. \n\nIf you look at hotel REITs in general, they tend to absolutely rip from the lows over a 12-24 month timeframe, going up many multiples of their stock price low. That's one of the reasons they're fun to trade.\n\nWho knows, could happen slower or faster, market is forward looking. I thought I'd have to hold $RIVN longer then two months to double but here we are 🤷🏼‍♂️", "score": 0, "replies": [{"body": "Once we get rate cuts……LOL", "score": 45, "replies": [{"body": "So 24-48mo? 😂", "score": 4, "replies": []}]}, {"body": "I'm going to say 6-12 months is the timeline I expect the commercial property values to collapse and drag things down in general...which would ruin baby cap hotel chain valuations. \n\nCalling this one a hard pass.", "score": 5, "replies": [{"body": "I read something else talking about a lot of commercial loans coming up in 2024-2025. I think we’ll see some stuff hitting the fan over the next few years.", "score": 2, "replies": []}]}, {"body": "I’m thinking about playing earnings in August. $15c on PK. Thoughts?", "score": 1, "replies": []}, {"body": "Dude rate cuts are like a 30% chance at best. There is still so much uncertainty on inflation go-forward.", "score": 1, "replies": []}]}]}, {"body": "***\"If you don’t know what a REIT is you’re not knowledgeable enough to do this trade, stick to $SPY. \"***\n\nI have no idea what $SPY is and at this point I'm too afraid to ask.", "score": 16, "replies": []}, {"body": "Maybe this has something to do with the decline of $PK? \n\n### Table3: Comparison of growths of HLT and PK side by side\n\n&#x200B;\n\nhttps://preview.redd.it/nde4bfod2qbb1.jpeg?width=1088&format=pjpg&auto=webp&s=5f688baa74f53e7922ae70ad76bd9e736f23150b", "score": 8, "replies": [{"body": "So $pk only is invested in shitty Hiltons?", "score": 4, "replies": []}, {"body": "Growth of what?", "score": 1, "replies": []}]}, {"body": "AI will likely not deliver more wealth and free time to benefit premium hospitality. It's one of the few big innovations that has very little on blue collar workers, but can put millions of white collar workers out of jobs. Those millions may no longer be able to go live it up in some 5 star resort.", "score": 7, "replies": []}, {"body": "This makes me think of Charlie and the “Pepe Silvia” conspiracy rant from It’s Always Sunny.", "score": 12, "replies": [{"body": "\"What do i found out Mac ?! WHAT DO I FIND OUT ?! There is no pepe silvia. \"", "score": 2, "replies": []}]}, {"body": "To play the devils advocate, high interest rates will limit the growth opportunities for capital-intensive industries like real estate. Without new buildings the growth forecasts will depend upon increased revenue per room.", "score": 6, "replies": []}, {"body": "What a regard. Hotel REITs are leveraged to the tits on non fixed loans that are crushing them with todays high interest rates. \n\nThis is why the REITS look like commercial office Reits. Same problem, and no, travel demand won’t fix this.", "score": 6, "replies": []}, {"body": "Regard might have something here. Since I’ve been traveling all the hotels I’m staying in are busy", "score": 9, "replies": []}, {"body": "What in the time share peddling hocus-pocus bull cock did I just read?\n\nWho wrote this? Hotels?\n\nWendy's really does have infinite number of future employees lol", "score": 6, "replies": []}, {"body": "I 100% agree that leisure travel is shifting from AirBNBs back to Hotels, and that leisure demand is booming.   \n\n\nMy question is what about Business Travel ? I feel like that will be down significantly due to the work from home / video conference trends.  \n\n\nSo yes, JUN-AUG hotel demand should be high, but what happens when skewl is back for fall / winter ?", "score": 5, "replies": [{"body": "Hmm, that’s a very good point considering that business travel was/is a pillar of hotels. That being said, I feel as though air bnb is sucky and it’s time for a resurgence in hotels (like you said already lol). \n\nBlah blah blah, I think the big thing here is debt and loans. If interest rates go down-> hotels up, if interest rates continue to stay high as they have been, then… boom(not a good boom)\n\nBut who am I, just a degenerate teenager trading a few thousand. I think I will go long on a small part of liquidity in my portfolio. It’s low enough to which, as dumb as it sounds, only place from here is to go up! (Unless economy takes a dip, interest rates go up, and if the real estate market just gets more expensive, but yolo!)", "score": 2, "replies": []}]}, {"body": "Hotels before the onset of a global recession, seems legit.", "score": 19, "replies": [{"body": "Is this recession in the room with us? Is it speaking to you right now?", "score": 6, "replies": []}]}, {"body": "So consumers will have blown through their Covid savings by the end of the year and student loan deferrals are set to end this fall and the next big bet is on bougie vacations? \n\nI’m no bear but I’m also not regarded", "score": 3, "replies": []}, {"body": ">If you don’t know what a REIT is you’re not knowledgeable enough to do this trade, stick to $SPY.\n\n>Proceeds to explain what a REIT is anyways", "score": 4, "replies": []}, {"body": "Hold up my fellow autist, you might need to take a break from the regard-go-round. You spent two weeks on *this*? You've vomitted all over the white stallion, and it looks just like the Kool-Aid they served at Jonestown.\n\nThe most notable aspect of your confused rant was the three sentences you spent on economic analysis. Those carefully constructed sentences eloquently ignored around 90,000 data points, strengthening my faith in the success of Dave Thomas' red-haired brainchild.\n\nNow,\n\nIt's true that offices are facing headwinds due to changing work dynamics and remote work trends, whereas hotels are benefiting from increasing leisure demand. However, this doesn't guarantee that Hotel REITs will automatically outperform or that the pricing discrepancy will close rapidly.\n\nDuring the pandemic, leisure travel was significantly restricted, and many hotels faced substantial declines in occupancy and revenue. As travel restrictions eased and leisure demand started to recover, one might have expected Hotel REITs to quickly rebound and outperform. However, the actual performance varied among different Hotel REITs.\n\nConsider an example: Ashford Hospitality Trust (AHT) is known for its ownership of upscale and full-service hotels, primarily located in urban and resort destinations across the United States. Despite the overall increase in leisure demand, the REIT faced challenges such as high operating costs and debt burdens. As a result, the financial performance and stock price has not experienced a rapid recovery or caught up with the broader market. In other words:\n\n\\- The performance gap between Hilton and other Hotel REITs doesn't necessarily indicate that the gap will narrow as leisure demand normalizes.\n\n\\- The valuation of Hotel REITs is a complex process that takes into account various factors such as property locations, cash flows, debt levels, and market sentiment.\n\n\\- Economic indicators are *not* strong, and investors are understandably *not* confident.\n\nMarket participants clearly have concerns about the sustainability of the hotel industry's recovery, potential headwinds, or the company's ability to generate future earnings and cash flows. You insist that this sentiment is blatantly unjustified, and economic concerns are sedated by bottom-up analysis. But even this leaves much to be desired.\n\nWheres the in depth assessment of financial performance? FFO, AFFO for starters? Comparing these indicators can provide insights into their profitability, cash flow generation, and overall financial stability.\n\nWhere's the comprehensive discussion about balance sheet strength? Strategic ignorance of debt levels, leverage ratios, interest coverage, and liquidity can mask the financial health and resilience of any given company.\n\nOccupancy Rates and RevPAR? No commentary regarding operational performance to this end, either.\n\nProperty quality? Brand recognition and market positioning? Management expertise? Crickets, pretty much.\n\nFurthermore:\n\n1. While it's true that Hersha recently sold off some of its properties at a higher per key valuation, the market cap of the company is determined by a vast number of factors beyond just the value per key.\n2. Hotel demand and supply constraints: Supply constraints can have various reasons beyond just tighter credit and tough COVID years. It's crucial to consider factors such as construction timelines, regulatory approvals, and market dynamics that impact hotel supply.\n3. Outlook for hotels and economic fears: The current economic conditions pose challenges for the hotel industry. Rising inflation drives up costs for hotel operations, squeezing profit margins. Moreover, a declining GDP suggests slower economic growth, leading to reduced consumer spending and lower demand for hotel accommodations. Changes in consumer behavior, like increased saving or shifting spending priorities, can also impact the industry as people may prioritize other essential goods and services over travel.", "score": 4, "replies": [{"body": "This guy hotels! RevPAR and RevPASH were big discussions in my hospitality program at Cornell.", "score": 2, "replies": []}]}, {"body": "Tbh your tone sounds a bit insane :D", "score": 3, "replies": []}, {"body": "$/key seems like a fine metric to evaluate hotel reits, I’m not gonna dispute that, but does $/key level actually matter without the context of how much they’re renting those rooms out for? Surely a higher $/key multiple in NYC could actually be a better buy than a low $/key multiple in Arkansas, because they can monetize a higher $/key in nyc.", "score": 3, "replies": []}, {"body": "Government paying hotels to host immigrants! All in fellas!", "score": 2, "replies": [{"body": "But then they need major reno once they’re gone", "score": 2, "replies": [{"body": "So stonk go up profit then who gives a shit, murica", "score": 1, "replies": []}]}]}, {"body": "Can we try to pump Ford or GM? I need some money too.", "score": 2, "replies": [{"body": "Gm has been a great buy at 33 and a great sell over 40.", "score": 1, "replies": []}]}, {"body": "If hotel REITs are in such a good place, why is $PK's dividend 1/3rd of 2019? Clearly there is some shit stuck in the pipe.", "score": 2, "replies": []}, {"body": "The high debt of these brands are what would hold me back on this trade. Commercial real estate debt isn’t the same as a 30 year fixed. Interest rates won’t probably go higher, but will stay at these levels for at least 8-12 months according to fed outlook. When this debt gets refinanced and the cost to service goes from 1 to 6%, then the good times might not be enough to service said debt.", "score": 2, "replies": []}, {"body": "I have a lot of long term hold REITs (like SPG). PK and INN sounds interesting, I'll buy a share of each to keep an eye on them.", "score": 2, "replies": []}, {"body": "Great post. Travel industry is rising.", "score": 2, "replies": []}, {"body": "While this specific REIT and position may be a bust I agree with the general premise that REITs are under priced by the market. They are also required to pay out 90% of their earnings so for the dividend folks it’s not a bad option too.", "score": 2, "replies": []}, {"body": "RemindMe! 1 year", "score": 2, "replies": [{"body": "I will be messaging you in 1 year on [**2024-07-13 21:35:35 UTC**](http://www.wolframalpha.com/input/?i=2024-07-13%2021:35:35%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/14ygnwk/apocalypse_is_priced_into_hotel_reits_at_the_dawn/jruu590/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F14ygnwk%2Fapocalypse_is_priced_into_hotel_reits_at_the_dawn%2Fjruu590%2F%5D%0A%0ARemindMe%21%202024-07-13%2021%3A35%3A35%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%2014ygnwk)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Can someone summarize this for me it has too many words", "score": 2, "replies": []}, {"body": "I call bs real estate in all kinds especially commercial is due for a big ass crash", "score": 4, "replies": [{"body": "So you disagree, right?", "score": 1, "replies": []}]}, {"body": "Take my money", "score": 3, "replies": []}, {"body": "Thanks for info. How to participate?", "score": 2, "replies": [{"body": "Short $PK", "score": 1, "replies": []}]}, {"body": "I do like this. \n\n\nMainly because people enjoy doing things, and in order to do these things you must pay hotels. Generally you need to pay hotels money.", "score": 1, "replies": []}, {"body": "TLDR", "score": -1, "replies": [{"body": "No", "score": 15, "replies": [{"body": "GIVE US MORE HINTS ON THE >500m !!", "score": 3, "replies": []}]}, {"body": "Hotel REIT stats at pre pandemic levels but stock prices aren't.", "score": 7, "replies": []}]}, {"body": "Positions?", "score": 0, "replies": [{"body": "He’s too scared to post them 🙈", "score": 4, "replies": []}]}, {"body": "What sort of timeframe do you see this playing out over? Are there triggers that you see?", "score": 0, "replies": []}, {"body": "NVIDIA to 700!!! 😯🥳🎉", "score": 0, "replies": []}, {"body": "Your TLDR needs a TLDR.  \n\n\nI'm out.  You are trying too hard.", "score": 0, "replies": []}, {"body": " This statement appears to be a personal opinion on the investment  potential of Hotel REITs (Real Estate Investment Trusts) in the current  market. It suggests that due to the challenges faced by the hospitality  industry (possibly due to the pandemic or other factors), the prices of  Hotel REITs have already factored in worst-case scenarios. Additionally,  the phrase \"leveraged to the tits\" implies that the speaker has taken  on significant debt or leverage in their investment approach. Such a  strategy can amplify both potential gains and losses and should be  approached with caution.", "score": 0, "replies": []}, {"body": "AGNC trading with 100% upside is a better REIT play. Also, with a 14% dividend yield. Not financial advice.", "score": -1, "replies": [{"body": "PUT YOUR HANDS UP Standard-Finding-360!!! POLICE ARE ENROUTE! PREPARE TO BE BOOKED FOR PROVIDING ILLEGAL FINANCIAL ADVICE!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Equity REITs and Mortgage REITs are not the same thing.", "score": 1, "replies": []}]}, {"body": "That TL;DR needs TL:DR 2x. Lemme make it easy\n\nSticker: \\_\\_\\_\\_\\_\n\nOptions:  Calls/Puts\n\nDTE: \\_\\_\\_\\_\n\nSP:\\_\\_\\_\\_\n\nFill the blanks regard.", "score": -1, "replies": []}, {"body": "What are some hotel REITs that you think are well positioned?", "score": -1, "replies": []}, {"body": "Not bad, high interest rate debt is scary tho", "score": 1, "replies": []}, {"body": "Let’s see your realized RIVN profits", "score": 1, "replies": []}, {"body": "You’re an idiot RIVN has been hitting a wall it can’t break past. Better to sell now and keep gains", "score": 1, "replies": []}, {"body": "I dunno, lots of factors in something like this. Airbnb has been around a while but the number of people investing in it specifically for resort homes has exploded in the last few years.", "score": 1, "replies": []}, {"body": "buy it when the fed cuts rates to zero", "score": 1, "replies": []}, {"body": "\"Park Hotels & Resorts said it stopped making payments on a $725 million loan tied to two prominent hotels in a city hit hard by pandemic-related changes.\" - NYT\n\n&#x200B;\n\nThey are basically giving up their properties", "score": 1, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Is it really that easy, just stop paying and walk away? It has to affect their ability to finance in the future, maybe in terms of higher borrowing rates, or their Morningstar rating, right?", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I learned something new today… thank you!", "score": 2, "replies": []}]}]}]}]}, {"body": "Wall of words I don't have the patience to read... Dammit I'm in!", "score": 1, "replies": []}, {"body": "Ya, it's gonna get a real bad when the market realizes that everyone maxed out thier credit cards at the end of summer and banks aren't releasing new credit lines to people.", "score": 1, "replies": []}, {"body": "Can we buy options on these REITs?", "score": 1, "replies": []}, {"body": "Hilton and Marriot are up 20 ish % over the entire interest rate hike period last 12 months", "score": 1, "replies": []}, {"body": "REITS - Literally the most boring asset class. if that's your thing though man, godspeed.", "score": 1, "replies": []}, {"body": "I love your thesis homie, but there has to be better hotel REITs", "score": 1, "replies": []}, {"body": "Went too heavy on the facts there... we don't look at those here, Cheers.", "score": 1, "replies": []}, {"body": "You son of a bitch, I'm in.", "score": 1, "replies": []}, {"body": "I’m insulted, but I’m in", "score": 1, "replies": []}, {"body": "accumulating shares and selling calls don’t sound too bad", "score": 1, "replies": []}, {"body": "STWD", "score": 1, "replies": []}, {"body": "PK just defaulted on a loan. Wtf?", "score": 1, "replies": []}, {"body": "The reason the big brands like Hilton and Marriott are trading higher is because of their asset lite model. Assuming the REITs are going to come out of this well is not a great assumption. Higher fees and upside on management, not ownership. Look at Pebblebrook and a few others for an idea of what’s to come.", "score": 1, "replies": []}, {"body": "I like Blue Green vacation", "score": 1, "replies": []}, {"body": "Hopefully my shares of $HT get dragged outta the toilet.", "score": 1, "replies": []}, {"body": "Assuming I'm highly regarded, how does one buy?", "score": 1, "replies": [{"body": "through a broker", "score": 1, "replies": []}]}, {"body": "EMOJI'S, FORMATTING, PREVIOUS PLAYS WITH GREEN NUMBERS, \n\nGUH GUH GUH!!!!\n\nCHARTS WITH NO NUMBERS?!?!? COUNT ME IN! \n(I am placing esport bets as we speak)", "score": 1, "replies": []}, {"body": "I‘m in", "score": 1, "replies": []}, {"body": "I feel like its the '80s all over again.", "score": 1, "replies": []}, {"body": "Riding with you", "score": 1, "replies": []}, {"body": "3% change in office occupancy is \"massive\" to you?  Meh", "score": 1, "replies": []}, {"body": "Why not short hotels long hotel reits if the view is that fundamentals the same but market performance diverged?", "score": 1, "replies": []}, {"body": "The downside of hotels right now is that there are roughly $275B in hotel notes coming due this year….at much higher rates. Some will go under, some will weather, but anyone in this bucket will absolutely have fewer profits this year. The only hotel play right now is to buy them.", "score": 1, "replies": []}, {"body": "4x return?  What is that a return for ants?", "score": 1, "replies": []}, {"body": "I‘m invested in REITs a lot, but mostly office and forestry. Thanks for your DD, I’d love expanding into hotel REITs! Gonna look up the names you mentioned", "score": 1, "replies": []}, {"body": "What does this mean for my $bbby position? Should I hold onto it bc hotels will need more towels and cups and plates and vacuums?", "score": 1, "replies": []}, {"body": "OP, what's your opinion on CIM?", "score": 1, "replies": []}, {"body": "Appreciate the DD! Agree there has been some babies tossed with bathwater across commercial REITs sector. Am currently long:\n\n* $SPG: Shopping malls\n\n* $ARE: Biotech incubators next to universities\n\nI’ll take a look closer at hotels for diamonds in rough. Thx again, and good luck in the trade", "score": 1, "replies": []}, {"body": "How do I buy this on etoro", "score": 1, "replies": []}, {"body": "alright im in\n\n&#x200B;\n\nbut if i lose a single cent on this, im suing you", "score": 1, "replies": []}, {"body": "You lost me as soon as you said a REIT is a stock.\n\nJust because they trade on exchanges doesnt mean they are stocks you dumb fuck, they are trusts.  They work much, much differently.", "score": 1, "replies": []}, {"body": "The price is nice unless we hit a recession and then people stop going to hotels.", "score": 1, "replies": []}, {"body": "Saw someone say in here that hotels use floating mortgages. Can someone confirm? Where did you get said info?", "score": 1, "replies": []}, {"body": "Apple! No not that AAPL this APLE.", "score": 1, "replies": []}, {"body": "Ok I'm convinced, in on PK and INN", "score": 1, "replies": []}, {"body": "Took long a post before my brain melts.", "score": 1, "replies": []}, {"body": "Sounds reasonable and well thought out.  Not nearly \"regarded\" to belong here..... :-)", "score": 1, "replies": []}, {"body": "Any Angle on Vegas hotel REITs?", "score": 1, "replies": []}, {"body": "Congrats OP, KSL is acquiring Hersha at a 60% premium. My preferred shares fucking printed.", "score": 1, "replies": []}, {"body": "@ini0n status update here Sir ?", "score": 1, "replies": []}]}
