{"title": "Coinbase long term prospects?", "selftext": "I found this chart on the subject of how people hold bitcoin. However I see something entirely different, I see how other exchanges dissappear and coinbase is the main player now.\n\nIPO was around 400, now trading at low 90s. I'm thinking that long-term as more and more people enter bitcoin, coinbase will keep making commissions. \n\nThey will also partner with Blackrock if that ETF gets approved.\n\nAny counter arguments?\n\nThx!", "id": "15dne4g", "created_utc": 1690728431.0, "score": 60, "upvote_ratio": 0.77, "num_comments": 120, "comments": [{"body": "Coinbase's future is tied to two things, sensible crypto regulation and legacy banking pressure.  If the US can pass good regulation without stifling business and if legacy banks don't force out/buy out good exchanges, then crypto and Coinbase will succeed.", "score": 41, "replies": [{"body": "Serious question - wasn't crypto supposed to succeed in spite of traditional banking and regulation, not because of it?", "score": 31, "replies": [{"body": "We are talking about a companies stock price going up or down, not about Crypto succeeding or not. \n\nCrypto being a success isn't tied by how much money people make off crypto. Its price however is tied exactly how useful it will be *in the future*.", "score": 15, "replies": [{"body": "Good points, thanks!", "score": 6, "replies": []}, {"body": "We’ve had 10+ years of crypto in the “mainstream” and it has still yet to demonstrate a single use case that’s better or more efficient than the current use case.", "score": 7, "replies": [{"body": "Thats pretty much why I never went full in on crypto in the first place. \n\nBut currency is funny. Its value and strength is solely in the belief of said currency. If didn't accept dollars and only bitcoins the dollar would have little to no value. \n\nIf I can buy bitcoins and end of the day, at the moment, can simply go cash it in for dollars, it has value. \n\nThere are improvements to be made still with blockchains. It certainly is a razors edge however at the moment if this is something that will stay or just a dumb fad.", "score": 3, "replies": []}, {"body": "Uneducated", "score": 3, "replies": [{"body": "Ok I’ll bite. I’ve taken the University of Oxford blockchain strategy programme in furtherance of my financial institution employer’s digital asset strategy. This is obviously in addition to my undergrad and professional degrees. My comment that crypto has yet to demonstrate a single use case derived from these experiences and trainings.  I’m actively involved in a major financial institution’s digital asset strategy and it keeps coming up with the same questions - why are we doing this, and who is it for?  For a regulated institution, there are regulatory barriers to many of the things common in the crypto space (for very good reasons I.e. KYC/AML, separation of roles, product permissibility etc.)  with these common sense guardrails crypto makes no sense since we cannot as a regulatory matter put carbon emissions on the blockchain to facilitate sanctions avoidance and money laundering. \n\nWith all this I ask what’s your education in the field, and since I’m uneducated by your standards, how is yours at least equal?", "score": 3, "replies": []}, {"body": "Tell me more", "score": 4, "replies": []}, {"body": "Tell me more", "score": 2, "replies": []}]}]}]}, {"body": "Bitcoin is up 185% vs Nasdaq 65%, gold 25%, and long bonds -31% over this period of a global pandemic, war, and 50 year historic inflation. \n\nAnd the Bitcoin network itself, measured by hashrate, is 207% larger with many more users. \n\nIt's been a success however you measure it. It can obvious get even bigger if every grandma's Fidelity advisor can allocate 0.5%. But if its performance thus far hasn't been successful I don't know how you define success.", "score": 7, "replies": [{"body": "That means nothing above it success.  It just means it has crazy high beta, and is attributable to change rapidly due to loose monetary decision", "score": 8, "replies": []}, {"body": "People using bitcoin as a tool for speculation doesn’t make it a success. Is dogecoin a success? Shiba Inu? And other of the dumb meme coins just because number went up?", "score": 7, "replies": []}, {"body": "The people on this thread are luddites of the highest order. \n\nAnd I’m thankful they still exist in such numbers.", "score": 3, "replies": []}]}, {"body": "The big problem with crypto and the idea of decentralisation is exactly that: decentralisation. Regulators need to have some control over the currencies to monitor and enforce things like taxes, (financial) crimes, money laundering and more. With completely unregulated cyrptocurrencies that is very difficult or even impossible.\n\nOn the other hand, a lack of regulation also hurts consumers if you take a look at scams and other criminal actions. If your grandma wants to send you money but on accident types in the wrong wallet, the money is simply gone.\n\nSo for the sake of the average consumer as well as functioning properly, regulators need some sort of regulation and control, which goes against the very nature of crypto currencies (at least the first ones). Combining both is difficult and one of the reasons that crypto hasn't been used widely except for speculation. At least for now.", "score": 1, "replies": []}]}]}, {"body": "It was $55 before blackrock announced they plan to use it for the bitcoin etf they trying for. Now its like $100. I messed up and got talked out of buying when it was $55", "score": 26, "replies": []}, {"body": "PayPal started allowing crypto buys, although I think they hold it all. Coinbase might be better from a crypto purity perspective but we're talking ease of use for general population...\n\nAnd only god knows what Elon is going to try to do with X.\n\nJust a couple things to consider.", "score": 6, "replies": []}, {"body": "Counter argument:\n\nHow many crypto exchanges need to collapse, and how many crypto bad actors need to get exposed, and how many years need to go by where crypto can't find any useful legal positive real-world uses before crypto cultists finally conclude that maybe the whole crypto space just sucks ass for society and is full of nothing but shady grifters (who spam social media forums telling you to buy/hold crypto) and their marks?\n\nWith that in mind, do you really want to buy Coinbase stock, which has all its eggs tied to that crypto basket?  And even if you love crypto (which you shouldn't), do you really want to pay 8x SALES for the money-losing company that is Coinbase?", "score": 11, "replies": [{"body": "Whales and other buyers and sellers of btc don’t care if it’s good for society or has actual use cases. They only care if they can continue to pump it up and sell, and then buy it after it crashes. If btc isn’t going away, I feel it will still find buyers who pump it for profit. Bittersweet for sure, but it’s a lucrative cycle that I don’t see being broken until something dramatically changes, such as the advent of quantum computing.", "score": 2, "replies": []}]}, {"body": "Here is the chart. Purple is Coinbase.\n\nhttps://imgur.com/a/9ArEato", "score": 6, "replies": []}, {"body": "Why not simply investing into BTC?", "score": 20, "replies": [{"body": "Because at one point Coinbase was worth less than the cash it has on hand.  It was oversold.", "score": 9, "replies": [{"body": "It matters.  If you think that cash is likely to be invested poorly, that is the true valuation.\n\nLook what weed companies did with cash.  They put it in a pile and burned it.", "score": 3, "replies": []}]}, {"body": "My funds are all tied up in beanie babies", "score": 17, "replies": []}, {"body": " Can't do that in IRA. This question is about Coinbase.", "score": 9, "replies": [{"body": "You ABSOLUTELY can invest in BTC using your Ira (even Roth). Plenty of options, but you can start with Swan bitcoin.", "score": 4, "replies": [{"body": "You guys don't seem to get it. There are gold miners and there are stores selling the shovels. I'm looking to profit off of selling shovels.  That's my idea here, at least.", "score": 22, "replies": [{"body": "Sure, but you said you can’t buy crypto in an IRA in your previous comment, which is patently false.", "score": 8, "replies": [{"body": "What is the best way to buy Bitcoin in an ira?", "score": 1, "replies": []}]}, {"body": "The pick and shovel crypto play is CUBI.  They are the surviving bank after the other two main banks lending to crypto services collapsed.", "score": 2, "replies": []}, {"body": "okay cringelord", "score": -5, "replies": []}]}]}, {"body": "Oh ok, missunderstood", "score": 0, "replies": []}]}, {"body": "Basically investing in gold or the shovel to dig it", "score": 1, "replies": []}]}, {"body": "If we see the economy stronger next year and BTC reaches new sustained highs, I think more large companies will start adding BTC to thier balance sheets again. Coinbase will probably partner with many of these companies and make commissions. The commissions they are making now on individuals is nothing compared to what's to come when a few mega-caps want even 1% of their balance sheet in BTC.", "score": 3, "replies": []}, {"body": "I believe there will be a big comeback on crypto and therefore Coinbase.", "score": 9, "replies": []}, {"body": "It will reach new all time highs after the bitcoin halving\n\n$100 will look like a steal in 18 months, you can tag me 2024 Christmas.", "score": 8, "replies": [{"body": "RemindMe! 2y", "score": 2, "replies": [{"body": "I will be messaging you in 2 years on [**2025-07-30 21:48:32 UTC**](http://www.wolframalpha.com/input/?i=2025-07-30%2021:48:32%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/15dne4g/coinbase_long_term_prospects/ju4iy4o/?context=3)\n\n[**10 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F15dne4g%2Fcoinbase_long_term_prospects%2Fju4iy4o%2F%5D%0A%0ARemindMe%21%202025-07-30%2021%3A48%3A32%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%2015dne4g)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 0, "replies": []}]}, {"body": "Remind me! 18 months", "score": 1, "replies": []}]}, {"body": "They should benefit off BINANCE getting worked over. I have personally always used COIN as my fiat on-ramp over the years and appreciate the easy user experience. That said, I don’t really feel comfortable investing since the swings in crypto are so wild. If I wasn’t comfortable doing it in the low 40s I wouldn’t today when nothing has changed except the share price. I just feel like they could blow up randomly like other exchanges", "score": 4, "replies": []}, {"body": "the comments here are hilarious. \n\nCoinbase is front runner to be a custodian of crypto assets, including Bitcoin, for major financial institutions. Its trading income will be a fraction of the money they will make off of holding the assets and getting interest on the collateral of it, essentially fractional reserve crypto assets. \n\nAlso, it’s trading in high 90s to 100s now, not low 90s.", "score": 14, "replies": [{"body": "Fractional reserve system for crypto feels like a time bomb, no?", "score": 11, "replies": [{"body": "it’s already being done. And yes when done wrong yields disaster. FTX one example on the crypto side.", "score": 7, "replies": [{"body": "I was thinking that the volatility inherent to crypto (because all coins are worthless from first principles, there’s no material demand for any of them) makes it inevitably unstable?", "score": 2, "replies": [{"body": "so firstly, I would recommend moving away from that mentality. Do the research, proper research with an open mind. \n\nBitcoin in particular has inherent value. \n\nYou don’t think there’s value to a network that can safely and reliably  transfer and hold money over simple internet protocol anywhere across the globe with no middleman involved? And it’s been proven to do so for over a decade now. \n\nNow throw in the spice that only 21 million will ever be “made/minted/mined.”\n\nThe volatility is only there now because the value of these assets are still such a small portion of the global money pool. And adoption is still in single digits people wise. \n\nBut you will notice the % swings are dropping on every halving cycle. This cycle might only double its peak to last (im expecting $120k - $160k).", "score": -6, "replies": [{"body": "I mean it has use case just like you can technically ride a horse but you don’t see it being implemented all that often because there’s just better things to do the job", "score": 7, "replies": [{"body": "There’s literally nothing else that can do what Bitcoin does. And I will say the same of Ethereum, but the case is still out there on whether it is the “Windows” OS of crypto or something supersedes it or PoS (Proof of Stake) proves fatal, but right now it has first mover advantage and is being built on heavily by the best programmers.", "score": -3, "replies": [{"body": "Bitcoin does literally nothing that is genuinely useful beyond pseduoanonymous money transfers.\n\nMonero is better for that, and the value of something being \"facilitates illegal activity\" isn't bullish for its long term viability as an investment.\n\nMemes make money, but let's not pretend its actually useful. The SWE's working in crypto know they're working on bullshit, money is money.", "score": 9, "replies": [{"body": "This whole message thread further instills the belief in me that global money supply will see a rebalance that involves the third world much more. Their earlier adoption and better comprehension of crypto asset worth will rewrite the global money power dynamic.", "score": -5, "replies": [{"body": "put the pipe down brother.\n\nthe poorer masses of the world falling for get rich quick schemes isn't new.", "score": 6, "replies": [{"body": "they’re using the bitcoin network everyday to transact and have a reliable medium of exchange as well as a hedge against rampant inflation. \n\nThe opinions expressed in this thread even further confirm that there is much more upside in crypto ahead.", "score": 1, "replies": []}]}, {"body": "Bitcoin ownership is hilariously concentrated among whales. This whole bullshit about democratizing finance is gibberish.", "score": 2, "replies": [{"body": "Sure, but how much of the “float” are whales? They can horde and keep as much of it as they want, there will still be an available pool to transact with and hold for the general population. \n\nA bitcoin is made up satoshis. As long as there are enough satoshis to facilitate transactions, it is a fantastic equalizer to government based currency.", "score": 1, "replies": []}]}, {"body": "Was in crypto early and I got out in December of 21.  It offers no real benefit to those in first world countries except for those wanting to scam, launder, or do other illegal activities.  \n\nI think it’s too late for bitcoin or crypto as a whole.  If the community had rooted out the bad actors after Mt. Gox and prevented this continued run of scams, maybe I’d feel differently.  Exchanges in their current states are just unregulated banks speed running the lessons learned over the last 100 years.  Without exchanges wash trading crypto to inflate value, these coins would collapse on themselves fairly quickly.", "score": 0, "replies": [{"body": "Major financial institutions strongly disagree with your assessment.", "score": 0, "replies": [{"body": "Major financial institutions are neither buying crypto nor investing in its development. Setting up some funds that are crypto related doesn’t indicate anything about crypto adoption. Just another way for them to collect fees.", "score": 5, "replies": [{"body": "This is patently false and pure ignorance.", "score": -2, "replies": [{"body": "Sure bud. Whatever makes your bags feel lighter.", "score": 2, "replies": [{"body": "No bags. Just pure, unfiltered gainz.", "score": 0, "replies": []}]}]}]}]}]}]}]}, {"body": "I mean give me 3 examples of Bitcoin being implemented and also being the most efficient at doing so", "score": 0, "replies": []}]}]}, {"body": "We’ll you’re talking about the theoretical use case for bitcoin. Which may or may not be realized. I agree there is value in the type of exchange system you describe, but at present, Bitcoin doesn’t offer that. There is no material demand for bitcoin. Nobody ‘needs’ Bitcoin tomorrow, regardless of the theoretical benefits of blockchain and regardless of Bitcoin’s other much touted attributes.", "score": 1, "replies": [{"body": "Again, disagree here. \n\nA lot of the third world NEEDS Bitcoin. Very much so. \n\nAnd I believe the whole world needs it as we further drown ourselves in fiat debt. There is a case for hard money, and Bitcoin is THE prime example of it, the essence of what was described by the Austrian school. \n\nIts adoption rate in the western world is different from the developing world. For different uses. While the West uses it as a reserve, the “South” uses it for its insulation to hyper inflation and its trustless factor. In environments of hyper corruption, Bitcoin is the answer to provide for reliable business transactions.", "score": 1, "replies": [{"body": "Name one country using bitcoin to hedge hyperinflation. Name one country that is actually relying on Bitcoin for ordinary business transactions.\n\nEverything that you're saying is hopeful speculation about the future of a Bitcoin-driven world, it's not the reality of today. You're talking about future hypotheticals as though they are present realities.", "score": 1, "replies": [{"body": "I would stay away from investing if you only care about “present realities.”", "score": 1, "replies": [{"body": "That's a little disingenuous and I think you know that. You're twisting my words. I said that you are talking in a way that suggests all these things are currently happening in defense of the idea that there is material demand for Bitcoin. I pointed out that there is not, that in fact, none of this is currently happening. Ergo there is no material demand for Bitcoin. You're talking in vagueisms.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Imo after the sbf fraud or whatever you want to call that, investors who were bullish on crypto in general have all but pulled out. Coinbase being seen as risky due to fears from other exhanges collapsing, and future regulation.. now is a perfect time to buy. It all rides on them not shitting the bed, and regulation going semi-smooth.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "If you only care Bitcoin and Ethereum, sure.  But for all the other \"altcoins\" you need Coinbase or other similar exchanges.", "score": 1, "replies": []}]}, {"body": "less and less people will enter bitcoin.", "score": 11, "replies": [{"body": "few understand", "score": 3, "replies": []}]}, {"body": "I am a COIN believer long term\n\nI anticipate the price will return to ATH sometime around 2025 (1 year after the BTC halving)\n\nThey have first mover advantage being a regulated crypto exchange.\n\nI just can't help but feel it is a better bet to put money in BTC instead of COIN, simply because BTC is a worldwide asset and COIN is predominately US based.\n\nAlso, COIN is a company, and companies can fail. \n\nBTC is not a company. It is a system that is tethered to no institution. It is its own perpetual motion machine. It will continue to grow, despite protests from haters.\n\nI anticipate somewhere in the $1 million range in the 2030s\n\nHere is a post from a while back about the progression of Bitcoin:\n\n[https://www.reddit.com/r/Bitcoin/comments/1c5j46/you\\_people\\_are\\_seriously\\_not\\_thinking\\_clearly/](https://www.reddit.com/r/Bitcoin/comments/1c5j46/you_people_are_seriously_not_thinking_clearly/)\n\nWe are approaching the endzone of financial capital being thrown into digital assets. \n\nI took a small profit from COIN after the XRP lawsuit news a few weeks ago. But still am DCA'ing", "score": 4, "replies": [{"body": "Least irrational bitcoin maxi", "score": 1, "replies": []}]}, {"body": "Heavily shorted and by some of the top short sellers of all time (Jim Chanos). This alone scared me into selling off my shares at a loss back in mid 2022. Jim Chanos has a very good track record. COIN is volatile however so it can spike quickly/crash, repeat...think of it as a leveraged BTC/crypto play with more volatility", "score": 1, "replies": [{"body": "Fuck Jim chanos\n\nI’m adding to my position Monday", "score": 7, "replies": [{"body": "User name checks out", "score": 1, "replies": [{"body": "I’d rather not be on the side of a prolifically wrong short seller, but you do you.\n\nMan’s a fuckin dinosaur who is intransigent even when wrong", "score": 2, "replies": [{"body": "Lol didn't meant to downplay anything. Just liked your username.", "score": 2, "replies": [{"body": "The humble increase is some shit Reddit chose tbh", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Chapter 11", "score": 1, "replies": []}, {"body": "Crypto is a useless asset class that will slowly fade into irrelevancy over time. Whether that happens in 2 years or 20 I don't know. But long term I don't see how this ends anywhere but zero.", "score": -7, "replies": [{"body": "At some point don’t you have to reassess that thesis?\n\nIf didn’t goto 0, while the qqq was in a 40% drawdown.\n\nClearly, you’re wrong", "score": 6, "replies": [{"body": "No need to reassess... Nothing has changed to make btc actually useful and desired by the masses. If a global pandemic couldn't bring widespread adoption nothing will. Let alone the fact it's ripe for regulations given the impact on the environment and that bad actors, state or otherwise, use it to launder money.  Btc will be dead in 5 years", "score": 3, "replies": [{"body": "Lol people been saying this since the beginning of btc, and yet here it remains", "score": 2, "replies": []}, {"body": "I lol'd at that last sentence", "score": 1, "replies": []}]}, {"body": "The price is propped up by Tether, they can print infinite Tether to buy back btc through binance then sell it to retail dumb money when things are bullish. When Tether and Binance finally go down is when the crypto grift will end.", "score": 1, "replies": []}, {"body": "In 10 years not a single use case has been developed. Billions of dollars of investment and what do we have to show for it? If that changes I’ll reassess.", "score": -2, "replies": [{"body": "comments like this remind me how little research people seem to do before they talk. you should read about what's going on in Africa w.r.t bitcoin.", "score": 5, "replies": []}, {"body": "“Don’t bother me with facts, I’ve already made up my mind!”\n-You", "score": 1, "replies": []}]}]}, {"body": "So you don't know. Great.", "score": -3, "replies": [{"body": "Of course I don’t know. I can’t see into the future. But you asked for counter arguments and the easiest one is that crypto is useless for anything other than speculation and that’s just not sustainable long term. Either a genuine use case will come about and crypto will subsist (although I imagine the TAM is vastly smaller than the current value of coins) or it won’t and it will slowly fade away.", "score": -1, "replies": []}]}]}, {"body": "Crypto is a scam and their leg is tied to crypto while ceypto slowly dies.", "score": 0, "replies": [{"body": "And the heavily manipulated stock market that allows brokers to do shady shit behind the scenes all the time isn’t a scam??", "score": 4, "replies": [{"body": "I am only talking about crypto being a scam, you don't gotta whaddabout this.", "score": 1, "replies": [{"body": "On a stock market sub so it’s relevant. Yeah both are a scam. Our entire financial system is a scam. The same people run both scams.", "score": 2, "replies": []}]}]}]}, {"body": "The point of bitcoin is to avoid Coinbase third parties. If Coinbase goes up then the whole point of bitcoin is gone.", "score": -2, "replies": [{"body": "A marketplace will still be needed in some way or another.\nHow else would we know the price and buy and sell.", "score": 7, "replies": [{"body": "But it won’t necessarily be on coinbase. Coinbase is exactly a “trusted third party” that crypto is intended to obviate.\n\nThen again, the original libertarian fantasy for crypto is probably bogus. So who knows what the actual future of crypto will be.", "score": 2, "replies": [{"body": "This is the dilemma cryptobros find themselves in and I have to imagine it’s quite uncomfortable.  They want to break away from traditional finance, however they’ve managed to recreate the modern banks (exchanges) without any oversight to them.", "score": 4, "replies": []}]}]}, {"body": "The real point of Bitcoin was lost long ago when it just became another asset for people to enrich themselves off of", "score": 2, "replies": []}]}, {"body": "When BTC exceeds all time highs we’ll all get rich", "score": -1, "replies": []}, {"body": "[https://data.bitcoinity.org/markets/volume/30d?c=e&t=b](https://data.bitcoinity.org/markets/volume/30d?c=e&t=b) \n\nHere is your link OP", "score": 0, "replies": [{"body": "missing binance...?", "score": 1, "replies": []}]}, {"body": "Coinbase was tanking because it is pegged at the price per coin of BTC.  But for now this weekend, BTC seems to be back to it's normal sub $29k levels. So theoretically COIN should go up this week, and depending on earnings we should see if it goes past the $110+ mark.", "score": 1, "replies": []}, {"body": "None.", "score": 1, "replies": []}, {"body": "Coinbase's long-term prospects are like a roller coaster ride. It's going up, then it's going down, then it's going sideways.", "score": 1, "replies": []}, {"body": "If their customer care determines their success then they are doomed. I regard them to be the most trustworthy exchange, in which case the crypto related industry at large is compromised.", "score": 1, "replies": []}, {"body": "OK, since no one is gonna say it... I'll bite.\n\nThere's an elephant in that room.\n\nI think COIN has significant downside risk.\n\nFull disclosure: I don't own COIN, but perhaps after this I will go and get some Oct $22.50 puts, they are currently at 3 cents.\n\nI believe there are several reasons to anticipate trouble(s) with Coinbase, and I'm not even going to dive into their balance sheet (although there is a gold mine in there as well, I'll leave you to that...)\n\n\\----------REASON #1----------\n\nCoinbase is exposed to significant IP risk. Most cypto exchanges are, in fact... and the tradfi boys jumping into the ring are as well, but at least they are used to doing IP due diligence. The crypto boys just cut & paste code blindly because -- hey it's all good for everyone!\n\nCoinbase recently had a lawsuit to fight, and fight they did. Lucky for them the opposing counsel -- err... ummm, \\*died suddenly\\* - so... that's that, right?\n\n(WRONG)\n\nUnfortunately, Coinbase's legal team understood that despite the withdrawal of the IP case, they were still exposed to \\*another\\* potential IP suit. So they went crawling to the [USPTO.gov](https://USPTO.gov) for some help (\"Hey, USPTO - get this gnat off my ass!\").\n\nAnd yet, USPTO decided that Coinbase didn't have a leg to stand on and rejected all 5 of their claims. You can read all about this judgement (came down Oct 11, 2023) at: [https://developer.uspto.gov/ptab-web/#/search/decisions](https://developer.uspto.gov/ptab-web/#/search/decisions) (search for \"Veritaseum\" and it should pop up).\n\nFor those having trouble reading between the lines... here's the Cliffs Notes version:\n\nCoinbase (and most centralized exchanges and yes even peer-to-peer exchanges) are using patented technology (\\*not\\* a \"software patent\"), and owe a sh1t-ton of money to the inventor.\n\nThey can't pay.\n\nTo their credit, they've realized they can't pay and have tried every (legal) trick in the book.\n\nTheir best bet would have been to pay earlier... but now they've got a cranky inventor to deal with... so, the best deal(s) are likely off of the table now.\n\nWhich brings us to:\n\n\\----------REASON #2----------\n\nAs a publicly traded company they are obligated to inform their shareholders of any IP claims.\n\n\\*To the best of my knowledge (remember, I am not a shareholder, so what do I know?)\\* they \\^have not\\^ informed shareholders of these IP claims.\n\nSo, this is very naughty. (Bad Coinbase! Bad COIN!!)\n\nThis is how these events typically unfold...\n\nStep 1: Investors buy stock ABCD\n\nStep 2: Stock goes up, investors high-5 themselves for being so clever!\n\nStep 3: Stock tanks on the news that stock ABCD has lost a court case and has a $930m judgement against them.\n\nStep 4: Company ABCD's lawyers release a statement that they are \"disappointed in the decision and vow to appeal.\"\n\nStep 5: Investors panic & can't believe they've \"lost\" so much $... someone must pay for this negligence!\n\nStep 6: New plaintiff's lawyer comes out of the woodwork to file a class action against stock ABCD on behalf of shareholders... after all, company ABCD had a \"fiduciary responsibility\" to it's shareholders!\n\nStep 7: Stick a fork in stock ABCD, the CEO and all the main players.\n\nStep 8: Bankruptcy and vultures (creditors) step in to pick at the bones of company ABCD.\n\n&#x200B;\n\n===\n\nOf course, I could be blowing a bunch of hot air, feel free to look this up for yourself.\n\nBut for me, COIN has too much exposure to IP risk.... now... where were those $0.03 put options again?\n\nAhhhh, yes, \\*there\\* they are.", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Well, thank you!\n\nNow I understand completely!\n\nA plaintiff's voluntary dismissal \\*\\*without prejudice\\*\\* (because his lawyer died) means the case is magically gone, never to appear again.\n\nI do hope that someone will tell Lori Gordon and Dmitry Kagan and Perkins Coie that there really was no need for them to go to the USPTO to request *inter partes* review of claims 1-3, 7 and 8 of U.S. Patent 11,196,566B2 -- but, alas, lawyers will be lawyers, I suppose and they will always find a trivial reason to grab some billable hours.\n\nAs for the SEC's case. Was there a judgement? Which district do the SEC \"courts\" fall in again?\n\nhttps://guides.ll.georgetown.edu/c.php?g=365494&p=2821444\n\nOhh, that's right, it's an \"*administrative law judge*\" -- the most feared and legal of all judges. And the SEC brokered an agreement with the \"defendant\" - that's what the \"judgement\" was... a brokered deal. \n\nThank goodness they set up the \"Veritaseum Fair Fund\" so that fewer than 1% of those wronged could claim their funds back.\n\nNow we know the \"Intellectual Property\" (owned by Veritaseum LLC) is to be considered \"technology\" -- I was erroneously placing it in the \"IP\" bin.\n\nSo that settles it.\n\nCOIN is going to the moon.\n\nU.S. Patent 11,196,566B2 is worthless.\n\nSee you in 1 year, I'll come back for a healthy serving of warm crow.\n\n&#x200B;\n\nP.S. I've always wondered... are the cubicles at Coinbase nice? What's it like to work there? Is there a chef? Barista? With all of the layoffs I'd imagine it's more roomy and comfy over there... anyone care to enlighten us?\n\n&#x200B;\n\nhttps://www.businesstoday.in/technology/story/coinbase-cuts-close-to-1000-jobs-in-its-third-round-of-layoffs-359651-2023-01-10", "score": 1, "replies": []}]}]}]}
