{"title": "0.75% per week - WEEK 19 UPDATE", "selftext": "https://preview.redd.it/5gloyjnexmza1.png?width=347&format=png&auto=webp&s=07955b0ce89fb5260a9b0b1d37c363c7dca7e506\n\nhttps://preview.redd.it/uvjawc57xmza1.png?width=1018&format=png&auto=webp&s=8afc57ca62fcf343ffd1df9830c3f88fd3fbd403\n\nhttps://preview.redd.it/siogmm1gxmza1.png?width=1192&format=png&auto=webp&s=77115594ce7d51f75e97dd11d370c03dee67c5cb\n\nhttps://preview.redd.it/selixwgyknza1.png?width=1193&format=png&auto=webp&s=645ce446c0cccc505079b59f11ffd2fbf30dd878\n\n**13 MAY 2023**\n\n* This week I closed 3 positions and opened 4 more.\n* Two of the positions I closed this week were my F Put Credit Spreads ($11.50 and $12.00 strikes). I closed these two for a profit of 49% and 27% respectively. I used the cash from these to open 3 more Put Credit Spreads on F for 16 June at the $11.35 strike. The odd strike price was due to Ford’s one-time special dividend last month. F is one of my favorite tickers to trade. The premium is never that high on F options, but it tends to be consistent. If I had a million dollars in my account, I would likely be trading close to $500k on F Put Credit Spreads or about the same percentage as this portfolio.\n* The other position I closed this week was my SPY Call Credit Spread, which I closed early for a 59% profit after commissions.\n* In addition to the new F PCS, the other three positions I opened this week included Call Credit Spreads on both APPL & ORCL and a Put Credit Spread on SCHW. I chose the CCS on AAPL after it shot up after earnings and hitting a nearly 52-week high. I traded a second CCS on ORCL after its recent run up. The first spread I traded had a 70% chance of succeeding. It is very unlikely to continue running up $4 dollars higher than the first spread even though it’s about a month longer in time. My rationale for a PCS on SCHW is because I’m convinced that the ticker has completely bottomed out. Recognizing I have made many mistakes in the past, I didn’t risk much on this SCHW position being the spread is only $2.50 wide and I only traded one contract for each leg.\n* I expect the market to remain flat-to-down over the next several months. I do find it particularly interesting that I haven’t lost more than 2 weeks in a row. I am compiling metrics that I plan to discuss during my one-year review and winning/losing streaks will one of those key metrics I will measure.\n* Next week I have two spreads expiring so I will be looking to open additional positions to replace them. I started trade alerts a few weeks ago on my profile. If you are interested in seeing my trades as they happen, you can follow me directly.", "id": "13gnsj6", "created_utc": 1683999650.0, "score": 83, "upvote_ratio": 0.88, "num_comments": 36, "comments": [{"body": "Solid work, also what are you using for these visuals, I’m just using an excel graph to visualize p/l per trade, I like how you have candles for your weekly progress", "score": 23, "replies": [{"body": "I only use Excel to track my data independently of Schwab.", "score": 13, "replies": [{"body": "Then I clearly suck at making graphs in Excel.", "score": 2, "replies": [{"body": "If you track all the necessary data then making the charts are much easier.", "score": 3, "replies": []}, {"body": "You don't. Just youtube it bruh", "score": 1, "replies": []}]}]}]}, {"body": "What is your typical portfolio delta? How far otm do you try to sell? Btw, I enjoy these posts weekly. Keep them coming!", "score": 13, "replies": [{"body": "I use a probability matrix on trade entry.  I havent looked at the deltas much but i know they come out to around the 30 delta or so for the short legs.", "score": 7, "replies": [{"body": "I do something similar, I looked into how Delta is calculated and it's not on some incredible solid foundation and doesn't deserve the faith it's given. I do look at Delta's but the revelation for me was that it's meant to reflect a probability potentially underpinned by sentiment, and the calculation didn't sit well with me.", "score": -1, "replies": []}]}, {"body": "maybe i misunderstood you.  what do you mean by portfolio delta?", "score": 4, "replies": [{"body": "I just meant do you tend to have more bullish, bearish, or neutral positions? To follow that, how do you decide what positions to open.", "score": 2, "replies": [{"body": "Mostly neutral I'd say.", "score": 2, "replies": [{"body": "I’d like to hear more about how you set up the probability matrix for strike selection. I’ve not heard of that. What data do you use?", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Thanks appreciate it.", "score": 3, "replies": []}]}, {"body": "Very nice tracking. I'm envious:-)", "score": 6, "replies": []}, {"body": "You use ta at all while opening a position? Looks like ford has paid well for you but opening a put credit spread just below that wedge would concern me until I saw what direction it breaks out to.", "score": 5, "replies": [{"body": "Yes, i use TA for some but not all.  I use TA mostly for my call credit spreads.  A 52-week high is a big consideration.", "score": 4, "replies": [{"body": "And out of curiosity how/when do you cut losses on credit spreads as that's the most difficult part for me.", "score": 1, "replies": [{"body": "if it looks hopeless... i'm still trying to find a systematic way of doing this.", "score": 2, "replies": []}]}]}]}, {"body": "Great follow through posting your progress. Nice", "score": 3, "replies": []}, {"body": "Bro I’d like to buy some calls on your portfolio", "score": 4, "replies": [{"body": "Thanks", "score": 2, "replies": []}]}, {"body": "amazing graph", "score": 2, "replies": []}, {"body": "Wow. Great post! I recently joined the group. Love all the details! Do you have another post where you explain your strategy?", "score": 2, "replies": [{"body": "You can look at my previous posts. I explain a bit each week but I'm also refining it each week.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "i sent you a chat.", "score": 1, "replies": [{"body": "Are you sure? Is there something wrong with my messaging? Lol. I can't send or receive anything.", "score": 1, "replies": [{"body": "Try again", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": -6, "replies": [{"body": "i have consistently been posting since i started the first week of january. My goal is to be transparent and exchange sharing knowledge with this community.", "score": 24, "replies": []}]}, {"body": "I have been thinking about trying an iron condor.  What ranges do you use for them generally?", "score": 1, "replies": [{"body": "I just use a probability matrix as a guide. It varies depending on the ticker symbol. It's probably between a 20 and a 30 Delta on the short side.", "score": 1, "replies": []}, {"body": "Good starting point for iron condors is to set your strikes so that you collect 33% of the width if your strikes.", "score": 1, "replies": []}]}, {"body": "Are you using 100% of your liquidity? If all your trades went against you for max loss in one day what % of your portfolio would you be down?", "score": 1, "replies": [{"body": "Effectively 100% but not all spreads. If everything went against me I would own 300 shares of Ford at $11.35 per share and would have lost at least 45% of my portfolio.\n\nMost of my spreads are call credit spreads so the probability of that happening is highly, highly improbable.", "score": 2, "replies": [{"body": "Thanks for responding", "score": 1, "replies": []}]}]}, {"body": "Call Credit Spreads on SPY feel pretty safe right now, also like the thoughts on SCHW", "score": 1, "replies": []}, {"body": "I admire your persistency and commitment to weekly updates. Even though I don't trade your setups, I still check your posts\n\n\nWhat happened to the subtrack? Did you stop doing updates there?", "score": 1, "replies": []}]}
