{"title": "Bull Call Spread on $TSLA", "selftext": "Hi, I'm new to the options game and would like to make a speculation on Tesla. I do believe in the firm and would like to bet on an appreciation in share price, potentially the 420$ buyout. My trade idea would be Long 20/01/2020 350C and Short 20/01/2020 370C. That would cost me about 1000$. Let's say the firm would be bought out for 420$ or otherwise rise above 370, I would make 1000$ on my trade, right?", "id": "97jqo6", "created_utc": 1534350765.0, "score": 5, "upvote_ratio": 0.86, "num_comments": 34, "comments": [{"body": "*game*", "score": 6, "replies": [{"body": "Just a bit of background: My first touch with options was on r/WallStreetBets, that might expalin it...", "score": 3, "replies": [{"body": "so what the fuck are you doing asking these people? come back over to the bois and make some trendies my guy. ", "score": 15, "replies": [{"body": "LOL didn't think a 520 day DTE would pass under FD ", "score": 2, "replies": [{"body": "I just bought two FD debit spreads on Amazon and I came here (from WSB) to find a safe haven and some answers. ", "score": 2, "replies": [{"body": "Calls or Puts? 17/08?", "score": 2, "replies": [{"body": "Calls, it is Amazon. ", "score": 3, "replies": [{"body": "All we can do is hope and double down.", "score": 1, "replies": [{"body": "I am pretty mf stupid, so here is the question: I bought 2 x 1890-1892.5 8/17 Amazon Debit Spreads. If I carry this to expiration on RH and it closes at 1895 do I get $500? I know that is how it *should* work, but I don't want to be left on the hook or something if I cant sell on Friday at like $2.40 if it is at $1895.  \n", "score": 2, "replies": [{"body": "Yes you will get $500,  RH will execute both your options after expiry and you will pocket the gains.", "score": 3, "replies": []}, {"body": "I don't know about RH, but IB does it that way.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Why not outright sell a PUT? I sold Jan 2020 200 PUT for $23. I get to keep $2300 if the stock remains above 200 in the next year and half.", "score": 3, "replies": [{"body": "I think you have a winner right there. ", "score": 3, "replies": [{"body": "Thank you", "score": 1, "replies": [{"body": "Lol what awful skew. Risk 20k to make 2800. ", "score": 3, "replies": [{"body": "Even if TSLA is going bankrupt, it's value won't be exactly 0. There is some intrinsic value in the company, I believe it is $150 per share atleast.", "score": 0, "replies": [{"body": "Book value per share is approx. $23. \n\nThere is no extremist value to the stock when your bondholders will start stripping assets in a bankruptcy scenario. Zero stock value is a very possible outcome. ", "score": 5, "replies": [{"body": "Thanks, if there is bounce back today, I will close the position.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Thanks for the suggestion but I wouldn't want to risk 20k per trade on a TSLA speculation ;)", "score": 2, "replies": []}]}, {"body": "The max gain would be the difference between the strikes minus the amount you paid for the position.  So yes, 1000.", "score": 1, "replies": [{"body": "Ok, but when I go to the Options Chain, selling a 300C and buying a 320C (what  I would do to close the position) only is a 1300$ Credit. Wouldn't it have to be 2000$ (as the stock is way above 320)?", "score": 1, "replies": [{"body": "At expiration you'll have the full amount.  Before then, there's still uncertainty.", "score": 1, "replies": [{"body": "So, I would have to wait the full 520 days to realize the profit? What would be an alternative to bet on the rise of $TSLA with options?", "score": 2, "replies": [{"body": "Go shorter term.  Most options trades are in about a 60 day window.", "score": 1, "replies": [{"body": "Hmm but then I have to be right about the near future, the chances of a loss would seem to mount?", "score": 1, "replies": [{"body": "IMO the longer timeframe is harder to predict.", "score": 1, "replies": [{"body": "I believe the buyout will happen but it will take quite a while..", "score": 1, "replies": [{"body": "Then why are you putting this trade on right now?", "score": 2, "replies": [{"body": "I don't know when it is happening so why not set up the trade now?", "score": 1, "replies": [{"body": "Theta (time) decay would be one huge reason.", "score": 1, "replies": []}]}]}]}]}, {"body": "There will probably be a nice run up, because Elon promised to be profitable from now on. Maybe sell a bull put spread instead of buying a call spread?", "score": 1, "replies": [{"body": "If I look at the options chain, there doesn't seem to be a huge difference between ATM spreads. What would be the advantage?", "score": 1, "replies": [{"body": "With a call spread, you have to be right about the direction and you have to be right about the price. Assuming you're right on both, you have to be right the right amount in order to hit your profit target. Plus, if volatility goes down then your call value goes down.\n\nBut when you sell a put spread, your risk and reward are both defined when you sell the spread, and there are several ways to profit:\n\n• Theta decay is slightly in your favor instead of working against you\n\n• If the underlying goes up, you profit. If it goes sideways or remains unchanged, you profit. As long as it doesn't go down too far, you still profit. \n\nYour bull call spread has a defined risk and reward too, and it may be higher than a put spread, so that's one disadvantage.", "score": 2, "replies": []}]}]}]}]}, {"body": "If the buyout is confirmed and is 99.99% happening then you don't have to wait 520 days. You will see the spread trading close to 1900-1950.\n\nIf you have to wait 520 days that is still an amazing return on capital.", "score": 1, "replies": []}]}]}]}]}]}
{"title": "lol you cucks with Micron. Just stop obsessing with her, k?", "selftext": "[deleted]", "id": "97e8k3", "created_utc": 1534296991.0, "score": 0, "upvote_ratio": 0.4, "num_comments": 29, "comments": [{"body": "Someone wasn’t vaccinated..", "score": 26, "replies": []}, {"body": "Your post tells me MU fucked you so hard and you're still hurting.  \nGod bless you and I hope your \"ass hole\" heals fast.", "score": 38, "replies": [{"body": "∆∆mu fanboy", "score": 2, "replies": []}, {"body": "[deleted]", "score": -6, "replies": [{"body": "So how much did you lose on it?", "score": 5, "replies": []}]}]}, {"body": "[deleted]", "score": 31, "replies": [{"body": "[deleted]", "score": -19, "replies": [{"body": "Translation: When I have money people will want to have sex with me!\n\n\nYou realize what a retarded incel you sound like?", "score": 14, "replies": [{"body": "[deleted]", "score": -13, "replies": [{"body": "Confirmed Incel. Go cry in your moms basement until those leaps work out. \n\n\nEdit: holy shit you're an actual real life incel according to your post history. Good luck dude, you're view of the world is skewed and retarded. ", "score": 13, "replies": []}, {"body": "If you don't have a few hundred thousand dollars in net worth already, I wouldn't bank on playing the market to get you pussy. ", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah sure. And they can also set you back. If you can't get women I wouldn't worry about high risk plays on money, because that is the hardest way to get them if you don't have it.", "score": 2, "replies": []}]}]}]}]}, {"body": "lol didn't deny it eh.\n\n> I will ride them daily \n\ngenerally you want the girls to ride ya but to each his own.", "score": 9, "replies": []}, {"body": "family members don't count", "score": 7, "replies": []}, {"body": "Pocket pussies don’t count ", "score": 3, "replies": [{"body": "THAT IS A DAMN LIE.. TAKE THAT BACK. TAKE IT BACK AND NEVER MENTION IT AGAIN.", "score": 2, "replies": []}]}]}]}, {"body": "this post is what we call a hard cringe", "score": 24, "replies": []}, {"body": "k", "score": 7, "replies": []}, {"body": "this is so god damn weird", "score": 13, "replies": []}, {"body": "In your post history you talk about shooting women in the vagina. You also speak of acting on that fantasy giving you power. Before you make any big money you will either be dead of a self inflicted wound or in prison. ", "score": 5, "replies": []}, {"body": "MU is not a girl", "score": 10, "replies": [{"body": "yeah he's a trap ", "score": 9, "replies": [{"body": "a cute trap (:", "score": 5, "replies": []}]}]}, {"body": "REEEEEEEE", "score": 3, "replies": []}, {"body": "Leave $Mu, Go with Su", "score": 2, "replies": []}, {"body": "But I love her 😢", "score": 2, "replies": [{"body": "[deleted]", "score": -3, "replies": [{"body": "It can’t be true. She told me she loved me back and that she would give me everything I wanted. \n\nSo she’s been playing me from the start? ", "score": 1, "replies": []}]}]}, {"body": "There's nothing wrong with being an average looking girl!", "score": 1, "replies": []}, {"body": "Mods, do something please. This is.... sickening ", "score": 1, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Click Here to read fresh WSB DD.](https://new.reddit.com/r/wallstreetbets/search?sort=new&amp;restrict_sr=on&amp;q=flair%3ADD).\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "I am also bearish on Micron.", "score": -6, "replies": [{"body": "[deleted]", "score": -5, "replies": [{"body": "Says the incel", "score": 1, "replies": []}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "97k6ru", "created_utc": 1534353813.0, "score": 277, "upvote_ratio": 0.95, "num_comments": 30, "comments": [{"body": "He’s also on AAPL, dude is annoying ", "score": 84, "replies": [{"body": "[deleted]", "score": 121, "replies": [{"body": "But $ORCL is down too. ", "score": 21, "replies": [{"body": "I don’t think that’s what he was referring to lol. ", "score": -29, "replies": [{"body": "nice1", "score": 2, "replies": [{"body": "Ouch", "score": 2, "replies": []}]}]}]}]}, {"body": "With autism like that he for sure posts on WSB. ", "score": 29, "replies": []}]}, {"body": "Woah. Turns out there's an even more autistic stock discussion board than /r/wsb ", "score": 62, "replies": [{"body": "No", "score": 15, "replies": []}]}, {"body": "The Yahoo Finance conversation area is filled with absolute horsh shit being spouted all day every day.", "score": 50, "replies": [{"body": "[deleted]", "score": 27, "replies": [{"body": "I only hang out on the Mu board these days, great place", "score": 8, "replies": []}]}, {"body": "There’s always some prick named Benjo on every tech stock trolling them.  ", "score": 2, "replies": []}, {"body": "Gotta hear other opinions right?", "score": 1, "replies": []}, {"body": "Horsh? Like Sean Connery saying horse?", "score": 1, "replies": [{"body": "A horsh is a horsh of coursh of coursh.", "score": 1, "replies": []}]}]}, {"body": "WORLD CRASH", "score": 13, "replies": []}, {"body": "So does this mean I should buy calls now? ", "score": 10, "replies": [{"body": "It's $AMZN, would you rather buy puts?", "score": 8, "replies": [{"body": "AMZN puts is like betting again John Cena in a payperview", "score": 15, "replies": []}]}]}, {"body": "You have no idea what shorting AMZN does to a person.", "score": 7, "replies": [{"body": "If they're shorting Amazon they're already beyond help", "score": 11, "replies": [{"body": "5D chess where you short amazon because your package was a day late", "score": 7, "replies": []}]}]}, {"body": "AMAZON CRASH CONFIRMED 100% https://i.imgur.com/bfjmEbc.png", "score": 2, "replies": []}, {"body": "I used to read these for pump and dump garbage biotechs. The APDN board has posts nearly exactly the same 5 years ago.", "score": 2, "replies": []}, {"body": "I hate that fucking guy", "score": 1, "replies": []}, {"body": "Its the collapse of civilisation as we know it.", "score": 1, "replies": []}, {"body": "\"Apple and Amazon is going to zero confirmed\" - Marc Faber", "score": 1, "replies": []}, {"body": "Best DD I’ve seen on here so far! ", "score": 1, "replies": []}, {"body": "World Star! World Sta- ..wait, wrong place?", "score": 0, "replies": []}]}
