{"title": "SPY Wheel and Bull Market", "selftext": "Hi,\nI have been wheeling SPY for a year now generating 12-15% for a while but didn't see the bull market coming.Looks like a secular bull trend, does it make sense to dump the wheel and go long SPY, if the market goes up like crazy my premiums will dry out(when selling CSPs)..Maybe go long and sell far out covered calls?Any other strategies apart from long calls?\n\nAny advice would be appreciated.\n\nBest,\nAsh", "id": "133yr6g", "created_utc": 1682878087.0, "score": 38, "upvote_ratio": 0.9, "num_comments": 83, "comments": [{"body": "Is your crystal ball working?  Mine isn’t so I have no idea what the market will do . . .", "score": 35, "replies": [{"body": "Thanks and yes point well made...the bull run up has been swift so don't want to miss out on further gains if this trend continues. Yes no one knows where markets are headed.", "score": 3, "replies": [{"body": "I feel your pain. Another answer is you have to do both. You can wheel a portion for cash and certain roi and hold shares long.", "score": 8, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "The wheel should really also be viewed as a modified long-term investing strategy and not \"monthly income\". Yes you can collect premium every month, but a strategy that can be in drawdown for months or a years at a time as the underlying moves should not be considered able to provide \"monthly income\". Most people hear \"income\" and think \"I can increase my net liquidity and take profits out of my account every month\" and the wheel simply doesn't provide that smooth of an equity curve.", "score": 2, "replies": [{"body": "If someone has more than a small percentage of their account “in a drawdown” for more than a month or two then they are not running the wheel properly . . .  ;-D\n\nMost wheel traders and myself are able to make a monthly income, but this requires smaller positions on a diverse number of different stocks.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": ">I don't agree. Historical data shows that standard index of broad market buy and hold strategy outperforms in a long run.\n\n>Of course, there are skillful people that will have different results, but for the majority VT is way to go.\n\n\nI agree with this. If literally anyone could mechanically trade options and outperform buy and hold long-term, than the standard investing advice for non-traders would be \"run the wheel\" and not \"put a part of every paycheck into a broad market index fund\". For the majority, ANY options strategy is the wrong way to go. \n\nThe wheel isn't any different. It requires an edge and precise application by a skilled trader to be worth it in the long-run. It's not the best strategy for a trader who wants to consistently grow their account every month of the year, but it is a good tool for a skilled trader who wants to augment the volatility profile of a long-term investment.\n\nSome people think that the wheel is an easy way to bring money in every single month for a new trader, and some people think that the wheel serves zero purpose because every backtest shows it underperforms the underlying in the long run. The reality is somewhere in between.", "score": 5, "replies": []}]}]}]}, {"body": "Its simple.  Adjust your calls bit OTM to capture upside on equity gains", "score": 3, "replies": []}, {"body": "I was looking at SPY chart on Friday, and if you only take a 6mo time frame it looks like we are in a bull market.  if you take a time frame of 1 - 1.5 years, it still looks down to flat.  My crystal ball isn't working either, but I wouldn't bet on us just going on a long straight upward run.  BTW, I don't wheel SPY, but I sell daily CCs, so I roll to continually avoid assignment.  I'm not sure that I will be able to do that forever, esp if we do turn bullish overall.  I'm up about 15% since I started in May 22, which is nice.  I can say that my CCs have been as much as 4% ITM, and I managed to continue rolling out/up for small credit and avoid assignment (SO FAR).", "score": 1, "replies": []}]}]}, {"body": "What bull market are you talking about?", "score": 11, "replies": [{"body": "LOL yeah I'm reading this and I'm like \"we're at the same levels we were in April 2022 and April 2021\" where's three bull market? We've gone nowhere for 2 years.", "score": 4, "replies": []}]}, {"body": "Can't really help you here too much. My opinion is that the wheel is too capital intensive and it's not worth it compared to traditional theta decay strategies. In my opinion, for the wheel to work long term you just need to keep doing it through the tough times (just like every strategy). If you want to offset potential losses, keep a separate bullish position in SPY.\n\nSorry, I know this isn't much help. I'm just not a fan of wheeling.", "score": 21, "replies": [{"body": "What would you consider \"traditional theta strategies\"?", "score": 10, "replies": [{"body": "Sell into high volatility, buy back at lowered volatility. Let time, not price, work in your favor - and roll so you can reduce the chances of assignment (which is the direct opposite of the wheel strategy). Pick your strikes according to the best risk:reward ratio and manage at 21DTE. Do not get assigned unless there's a very specific reason you want assignment - it eats up your buying power more than opening another position would.\n\nIn lower vol times, focus on your delta more, sell into earnings, and wait for a volatility spike. You'll also end up getting more directional in your trades the longer the up trend drags on without any real price shocks (see also 2015-2020, hello sub-9 volatility).", "score": 19, "replies": [{"body": "Can you explain this with some examples?", "score": 0, "replies": [{"body": "People buy options (in theory at least) as a hedge due to uncertainty. Think if it like buying insurance: flood coverage is going to cost more in Florida than Iowa. Similarly, people are more willing to pay more for the same strike/expiration option during high volatility than low volatility. If you can sell your options when people think there’s a huge recession/bull market on the horizon and buy it back when the market has 2 weeks of kangarooing you profited off the passage of time and decrease in volatility", "score": 7, "replies": []}, {"body": "Sure, I'll tell you what I'm looking at right now in pre-market (6am, 5/1/23):\n\n$MPW is a REIT that specializes in medial properties. They are sitting at an IVR of 35.2. At 46DTE the JUN16 7/10 strangle nets you around 0.45 credit. PoP @ 66%, P50 @ 80%. It will give my portfolio -7 dynamic delta, 1.1 theta. I'm overall bearish on the market, so negative dynamic delta is OK with me.\n\nMax profit is 0.45 (the total credit received), maximum loss is technically infinite (it could blow past the call strike), but my margin account's Buying Power is reduced only by $226. It's a 5x risk:reward (226/45), so it's pretty risky, but in this johnny sized account there's not much I can do but eat it.\n\nHypothetically, let's say I open this trade today.\n\nTheta decays with time. If anywhere along the way I see I have a 50% profitability, I close the trade. If at 21DTE the trade isn't profitable I analyze the position and adjust as needed. If we're still in the middle of the range but the theta decay hasn't been enough to reach my profitability, I may just hold the position and wait a little longer. If one of my strikes is challenged or breached, I will roll out to the next monthly expiration for a small credit (which will, coincidentally, be around 50 days out).\n\nAdditionally, if one of my strike is breached before 21DTE and my buying power is reduced a lot, I will consider adjusting the position early to free up buying power (a sacrifice you must make in a small account).\n\nYou manage at 21DTE to minimize your risk of early assignment and maximize your profit potential in any given trade.\n\nHope this helps. Check out tastylive, optionsalpha, and the thetagang wiki for more info on what I'm doing.", "score": 3, "replies": []}]}]}]}, {"body": "Except when the bull run does happen wheel blows", "score": 2, "replies": []}, {"body": "Thank you. This helps put in a new perspective (better use of capital)", "score": 2, "replies": []}, {"body": "Thank you for your response.Much appreciated.", "score": 2, "replies": []}, {"body": "Too capital intensive? I literally have been averaging 2.6-3.1% weekly returns with covered calls/CSP. If I had put in 150k and done that I would have made higher returns then my regular portfolio in 2 months then I had all of last year. You have to invest in something to make a decent return. I definitely disagree", "score": 1, "replies": [{"body": "There's zero chance you did this in 2022. The entire market was down all year. How long have you been trading?", "score": 0, "replies": [{"body": "Not if you sell weekly puts and then sell covered calls when you’re assigned.", "score": 2, "replies": [{"body": "Brother... I don't care what DTE you're using, no one is making money on a strategy that always has long deltas when the SPX drops 18% in 2 months or 12% in 2 weeks, both of which happened in 2022. \n\nYou may have had _periods_ in 2022 when you averaged 2.6% weekly but there is absolutely zero chance that you averaged a 2.6% weekly for an entire year. That's a 400% compounded yearly return, which basically makes you the best trader ever. You would be running your own fund, not posting on Reddit. \n\nThere are only 3 ways I could see this happening: 1) you are the oracle of stock picking, in which case just pick stock. 2) you traded something other than the wheel. 3) most likely - you're making this up.", "score": -1, "replies": [{"body": "Never said I averaged 2.6% return each week last year. Please show me where I said that. \n\nI said had I put more capital in this year, I would have made a higher rate of return in 2 months than I did all of last year. One point of reference I did not mention was how long I’ve been buying/selling puts. It’s only been roughly two months which is where my frame of reference came into play. I can understand the skepticism . Not here to impress or prove myself, so do what works for you.  If you don’t believe me I’m okay with that. My main point was to state my dissenting opinion on the capital intensive comment .", "score": 1, "replies": [{"body": "You may not have said _explicitly_, but when you claim you average 2.6% weekly and then respond to \"zero chance you did this in 2022\" the way you did, it seems that you're _implying_ it.\n\nIf you didn't and I just misunderstood, then my bad.", "score": 1, "replies": [{"body": "Idgaf what you think I implied lmao. If I said it directly call me out and I will own it but if I didn’t and you made some assumptions and interpreted differently than it was intended that’s on you 🤣", "score": 1, "replies": [{"body": "Alright, like I said, my bad then. I have no problem accepting I'm wrong.", "score": 2, "replies": [{"body": "What’s funny is that your entire point of 2022 being a shit year was exactly point of how CSP/CC have made a greater return in the last 2 months of 2023 than all of 2022. I’m essentially reaffirming what you were saying but comparing now to then. Either way, life is too short. Let’s get this money and I wish you the best in all your future trading endeavors 🤙🏼", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "How long have you been running that? My guess is not longer then a year.", "score": 1, "replies": [{"body": "You are correct only a few months(coming up on 3 months )", "score": 1, "replies": []}]}, {"body": "In my experience you get a better RoC to close and roll the position (or open a new position in a different underlying), versus holding on to stock.\n\nSo, yes, too capital intensive.", "score": 1, "replies": [{"body": "Do you have any examples of this that you can speak more in depth to? My experience hasn’t been what you’re describing so that’s why I’m curious.", "score": 1, "replies": [{"body": "The last time I ran the wheel was prior to the 2016-2020 melt-up. I imagine the melt-up type of market would be ideal to run the wheel, but in 2014(?) I was trying the wheel and got assigned 100 shares in SPY. BPR was something like 19,000? I don't remember specifics, it was a while ago.\n\nCan't remember the exact strike prices and I'm not digging through history to find it, but a 1SD wide strangle in SPY has something like 7x less buying power in a margin account than just holding shares. If I take today's price, it's something like 41,500 BPR to be assigned SPY, versus 6,200 BPR to hold a 45 day strangle. Yes you're limiting the maximum potential profit, so in the event of a market melt-up you're losing out on money but in exchange you get to open nearly 7 similarly sized positions, more if you choose lower priced underlying's.\n\nI'd rather just close and roll the position before assignment (actually, 21DTE so I don't mess with early assignment either) and redeploy that capital than have it tied up in one underlying.", "score": 1, "replies": []}]}]}]}]}, {"body": "You don't have to cover every single share of SPY that you own with short calls for e.g. if you own 300 shares sell 2 calls.\n\nIf SPY runs up and ITM on your calls that's a win, but you can also sell puts and put spreads down at or below your breeched strike.  You can't be wrong in both directions at once.\n\nIf you need a quick hedge get futures permissions.  1 MES future == 50 shares of SPY deltas but uses < 2k of buying power.", "score": 8, "replies": [{"body": "This is also how I prefer to Wheel in aggressive bulls. I do lose some upside during those times, as I sell my calls at .2 to .3 Delta. But, I wheel a lower percentage of my portfolio during steeper up markets. When it flattens out or dips, I try to have cash available to sell puts and get paid for buying shares. If a cycle is lasting more than 2 weeks, I'll adjust my wheel percentage accordingly.", "score": 2, "replies": []}]}, {"body": "Have you explored other types of positions? The wheel, while popular on this sub, is just one of many (and better) strategies. \n\nYou could buy ZEBRAS on SPY. I think buying one a year DTE costs about $7,500. For the cost of your 100-share spy wheel, you can get 5x the upside potential. There are a lot of ways to use leverage in intelligent ways, none of which include the wheel.", "score": 5, "replies": [{"body": "First time hearing of this strategy. Looks interesting.\n\nAny idea how that compares to a diagonal spread in terms of risk reward?\n\nIn theory I would love to learn every single options combination strategy, but I feel like there are so many possible combinations that it's nearly limitless.", "score": 2, "replies": [{"body": "The ZEBRA is a stock replacement strategy and is quite different from a diagonal. \n\nYou don’t need to learn every strategy. This just happens to be a very cool use of options strategy. Additionally, it’s an example of using leverage in a smart way.", "score": 2, "replies": []}]}, {"body": "What is a ZEBRA", "score": 2, "replies": [{"body": "For those of you too lazy to google: https://www.tastylive.com/concepts-strategies/zebra", "score": 7, "replies": [{"body": "Haha. Yes", "score": 0, "replies": []}]}, {"body": "🦓", "score": 2, "replies": []}]}]}, {"body": "The absolute key piece of running the wheel in the first place is *being fine owning the stock long term, even through periods of huge price drops.* This means that the same principle applies for the underlying: always use dollar-cost averaging to bring your basis down. As long as you can sell calls above your cost basis, you're going to have a good time.", "score": 3, "replies": [{"body": "The issue is not about owning the stock for long term.The issue is not being able to own the stock after being assigned a call and then the stock going way up for you to pick up the wheel again(Sell premium for a Put  becomes extremely low and doesn't become worthwhile)", "score": 2, "replies": [{"body": "If you're sad that you sold a stock for more than you bought it for AND got a premium on top of it, I'm not sure I understand why you want to use this strategy at all.\n\nEdit: And don't forget you could just buy the shares again and sell calls, no need to sell the put first. You'd lose the premium, sure, but if you're worried about the price spiking upwards then just get back into the position with cash. Also, if you're worried about the price spiking upwards, then don't sell the calls either.", "score": 2, "replies": [{"body": "*Don't forget you could just buy the shares again and sell calls*: Regarding this the problem happens where there is a melt up and the price has run far away from your assignment. For sideways  markets, the wheel works really really well.\n\nI am not sad for buying low and selling high, just worried about the melt up like what happened last week. This week has been sideways till today.\n\nThanks a ton for your reply. I appreciate your insights here.", "score": 2, "replies": [{"body": "Yep, totally understand how frustrating it is. My INTC calls got almost all exercised last week. Sold a bunch more puts and now I wait again.", "score": 3, "replies": []}]}]}]}]}, {"body": "I’d say the wheel functions just fine if the market is going up, just not super rapidly. \n\nI’d be careful at inflection points I guess is what I’m saying", "score": 2, "replies": []}, {"body": "The wheel/covered call is a bullish strategy. I don’t see why you stop if you think we are in a bull market.", "score": 2, "replies": [{"body": "Being long stock with no options activity is bullish.  Selling premium is best for sideways markets.", "score": 1, "replies": [{"body": "You have a firm grasp of the obvious.  I pay my bills by selling SPX strangles so yes, selling premium is best for a sideways market.  Let's break this down.  OP states that he has been wheeling SPY, but now notices a bull market.  Wheel strategy is a bullish strategy...so, there are a variety of ways to do this.  If he doesn't care about holding stock, he could sell strangles such as a 30 delta put and a 16 delta call if he is worried about getting his call blasted through.  He could merely sell puts.  He could buy a shit ton of stock and sell calls against it and if they get tested, continue rolling up and out to collect more premium.  Maybe it gets called away, maybe it doesn't.  Either way he's making money.  He could buy stock and just sit and watch the dividends roll in.\n\nHe asks if he should dump the wheel and go long SPY in a bull market...when in fact the wheel is a bullish strategy and by running the wheel, he is in fact already long SPY.  Either way he has positive delta unless he's selling an ass ton of calls against his puts or stock position to be delta neutral.\n\nAm I missing something?", "score": 5, "replies": [{"body": "I just kinda object to the concept that CCs/CSPs are described as a bullish strategy just because you happen to have positive delta.  Positive delta or not, these aren't the best ways to play bull markets (or bear markets, for that matter).\n\nIf OP expects a bull market, they should stop selling premium and just go long stock.\n\nIf OP expects a sideways market, they should sell premium.", "score": 3, "replies": [{"body": "I 100% agree with that however positive delta is positive delta regardless of how you get it but there is more than one way to get long.  I personally don't like holding stock as it's not capital efficient but some people like taking stock to collect dividends.  No my thing but to each their own.", "score": 3, "replies": []}, {"body": "If you expect a bull market wouldn't you profit much more from buying calls and selling puts?", "score": 1, "replies": [{"body": "Buying calls - Only if you get the timing right.\n\nSelling puts - long stock has more positive delta unless you are leveraging much higher on the selling options side than the owning long stock side.", "score": 1, "replies": [{"body": "Well I meant doing both. Sell a put and buy a call. Same strike. They could be long dated and mimic shares performance.\n\nWould you be using more leverage than simply buying shares?\n\nI'm curious about this because I did this with frc. But had I bought shares I would've taken a 2-3x greater loss.", "score": 1, "replies": [{"body": "Synthetic stock can get you a long stock P&L chart for less money.  That allows for potentially more leverage.  Shouldn't really change the results much if you don't use that leverage.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Can’t you move your strikes for your bullish bias?", "score": 2, "replies": []}, {"body": "I love the wheel, but doing it on SPY isn’t the way. Buy and hold on S&P 500 historically outperforms SPY wheel.", "score": 2, "replies": [{"body": "Don't bring those facts here", "score": 4, "replies": [{"body": "Answer is incorrect.   The wheel outperforms indexes on flat and bearish markets.   It gets obliterated on bull markets", "score": 3, "replies": [{"body": "Look at the long term trend of the SP500, is it down, flat, or up?", "score": 2, "replies": [{"body": "This was a study from Goldman sachs -", "score": 1, "replies": [{"body": "Missing a link? Im interested", "score": 1, "replies": [{"body": "[https://www.gsam.com/content/gsam/us/en/advisors/resources/investment-ideas/buy-write.html](https://www.gsam.com/content/gsam/us/en/advisors/resources/investment-ideas/buy-write.html)\n\nNot exactly wheeling but pretty similar in context as you are not worried about your calls getting blown out", "score": 1, "replies": [{"body": "Dont see a study. Dont see outperformance.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Holding shares outperforms any theta strategy. If you really want to do a covered call, then I would place the short call at least 1SD out. You could also short ITM puts as that is less capital intensive than buying shares. I would always short a put rather than just outright buying so you get paid to take the shares", "score": -7, "replies": [{"body": "Sorry, this is completely absurd . . .\n\nYou mean if I held T it would outperform trading the wheel on AAPL??  \n\nEven SPY makes an average of 10% per year over time so theta strategies can easily outperform this return.", "score": 10, "replies": [{"body": "If you held aapl it would outperform trading the wheel on T.  You have to compare the same stocks or etf", "score": 6, "replies": [{"body": "The point is that a blanket statement like “buy and hold” outperforms options just cannot be made . . .\n\nB&H can outperform options IF the right stock can be traded at the RIGHT time.  If a trader can predict when the right stock will move up and then the right time to close before it drops is, then they can do very well.  As no one can reliably predict when this will happen it is often more luck when B&H might have a better return.\n\nIn contrast option strategies like the wheel can profit even if the stock direction is not predicted correctly.  While it may require rolling a few times, or even taking the rare stock assignment to then sell covered calls can all continue to bring in premium income.  Spread risks out over multiple diversified stocks and even if one or two (rarely) are assigned and underwater for any period of time the others can still be producing income.", "score": 4, "replies": [{"body": "I mean for most average investors buy and hold is a better strategy, I sell options myself and many things has to go right for an option trades to outperform buy and hold. I am very passive on option selling and I am having hard time keeping up with my passive buy and hold portfolio. \n\nI mean both statements can be true. 1 options trading are more profitable than buy and hold.  2 Buy and hold is more profitable than options trading.  However for options trading to be more profitable require more work and luck. \n\nThe problem I see is people are focusing on what option strategy works, but in the reality is picking the right assets to buy.  Own the right asset, when is a good time like when the market is over valued, sell some CC.", "score": 1, "replies": [{"body": ">I mean both statements can be true. 1 options trading are more profitable than buy and hold.  2 Buy and hold is more profitable than options trading.\n\nMy point is this exactly, no one can say that b&h will ALWAYS beat options, or that options CANNOT beat b&h . . .  \n\nOptions are not passive and do require work.  This includes researching underlying stocks to trade, finding good entry points, managing and rolling the position if needed, and handling assignments and/or exits.  \n\nI'd submit \"luck\" is not part of the equation for options traders who know how to trade well and have a good plan, but if luck is required then it applies to b&h equally to options . . .", "score": 2, "replies": []}]}]}]}]}, {"body": "Thank you for your response.  I did think about it, but shorting ITM puts in a crazy bull market like last few days, you might never get assigned and the market goes up too much to play catch up which is what's happening to me.", "score": -1, "replies": []}]}, {"body": "your third and fourth statements seem concerning - what if your assumptions are wrong?\n\nwhat if we're in an up-leg of a bear market?  (and what if this turns into a recession and an extended bear market?)\n\nlooking ahead, and assuming a higher interest rate regime (longer-term) equity prices do not tend to do well, neither do corporate earnings.\n\nI'm not sure you've thought out your thesis well enough - or have defined your time-frames sufficiently?\n\nyour arguments wouldn't convince me to be taking the actions you're advocating, but I don't think that's saying much - and as mentioned, you've left an awful lot out and you're making a whole bunch of assumptions that do not seem to fit.\n\n(and I'm not even sure about your terminology - if I understand you? - now I'm looking at some of your comments)", "score": 1, "replies": []}, {"body": "I am in a similar position.  What to do.  I got called away at 402, and was upset how we went higher and higher. I thought we would got lower from 405 and obviously I am wrong.\n\nI consoled myself by going deeper into TSLA CSP 165 and 157.50.\n\nThis is a much risker situation, and I don't recommend it, but I have been with Tesla since 1370 two splits ago.  Its been good to me.\n\nI strongly suggest do not do what I do, and go back to 12% a year with $SPY as that is a better way to build long term wealth.\n\nI am 53 and I am taking far too much risk today. But in the end. Its my choice.", "score": 1, "replies": [{"body": "Still not clear to me how folks are so clear about being able to make over  5 to 9% a year. 12 would come with risk, no?", "score": 1, "replies": [{"body": "People buy high and sell low.  for many reasons overconfidence. Mistakes. Circumstances. They could forced out for many reasons\n\nOver your lifetime you will witness millions of financial mistakes", "score": 1, "replies": [{"body": "I'm not too far of your age, and have seen the mistakes. Not making them myself is not as trivial!", "score": 2, "replies": []}]}]}]}, {"body": "Don’t write CC only CSP, if you want CC select very low premium like 0.1% on monthly calls", "score": 1, "replies": []}, {"body": "Well what is your goal?  What are you trying to do with this money you are wheeling with?  Be conservative?  Aggressive?  Would you be happy with 5 percent gains?  Trying for 10 or over?  Are you hedging?  Gambling?  Trying to beat the market?  Or just kinda trying to make some money.", "score": 1, "replies": []}, {"body": "If that's your thesis just sell higher delta and maintain it if it drops past a point.", "score": 1, "replies": []}, {"body": "What bull? We’re sideways from a year ago, with a recession looming.", "score": 1, "replies": []}, {"body": "This isn't a bull market. Almost all of April was flat, and we had a dip and recovery around fomc. Some people are expecting a run up this month because we think that was the last rate hike of the year. But no one actually knows (including powell)", "score": 1, "replies": []}]}
{"title": "The actual \"stages of a bubble\"", "selftext": "", "id": "133iwgk", "created_utc": 1682840504.0, "score": 564, "upvote_ratio": 0.88, "num_comments": 80, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|6|**First Seen In WSB**|1 year ago\n**Total Comments**|348|**Previous Best DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/vukie5/keep_an_eye_on_regis/) [x](https://www.reddit.com/r/wallstreetbets/comments/x7hpv5/getty_images_gety_possible_diamond_in_the_rough/) \n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "I always time the market perfectly. That’s why I live in my friends garage and catch pneumonia every year and you live in a cardboard box.", "score": 200, "replies": [{"body": "But you have Internet and a Device", "score": 15, "replies": [{"body": "Thats not ethernet, you are just in ms-dos mode", "score": 4, "replies": []}]}]}, {"body": "The blow off phase is incomplete!", "score": 24, "replies": [{"body": "Tell your mom I'll be back, my shift started", "score": 21, "replies": [{"body": "Wendy’s Careers.com", "score": 7, "replies": []}]}]}, {"body": "So you lost a lot of money on puts", "score": 23, "replies": [{"body": "Same here 😢", "score": 5, "replies": [{"body": "Yup", "score": 1, "replies": []}]}]}, {"body": "I made this in ms paint please enjoy", "score": 110, "replies": [{"body": "It shows", "score": 56, "replies": [{"body": "thanks babe", "score": 18, "replies": [{"body": "it's kind of backwards.... 2023 values are lower than 2021 ATH's for the most part", "score": 2, "replies": [{"body": "sorry let me go back and edit it i'll let you know when i repost", "score": 13, "replies": []}]}]}]}, {"body": "I don't see Cramer on this anywhere, please amend.", "score": 12, "replies": []}, {"body": "I can't read all the words but I love the bull flag you made.", "score": 5, "replies": []}, {"body": "The true hero's always do", "score": 2, "replies": []}, {"body": "[you lying scum](https://www.reddit.com/r/Infographics/comments/pjpntp/stock_market_psychology_101_market_emotion_cycle/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=2&utm_term=1)\n\nYou just slightly edited this 10000\\* reposted image. I call fraud. ![img](emote|t5_2th52|4267)", "score": 2, "replies": [{"body": "Ya that's the joke man congrats you found it", "score": 1, "replies": [{"body": "Suuuure ![img](emote|t5_2th52|18630)", "score": 3, "replies": [{"body": "im just saying we've been sideways for a year", "score": 1, "replies": []}]}]}]}]}, {"body": "Waiting to sell low to avoid taxes", "score": 14, "replies": []}, {"body": "According to this, if you sell into \"greed\" you get less than waiting for \"the new normal\".", "score": 5, "replies": [{"body": "According to this, you can keep buying because the peak only happens once lmao", "score": 1, "replies": []}]}, {"body": "Wasn't the market [down during 2022](https://www.chooseinvesting.com/calc/historical-index-returns#table-of-returns)?", "score": 15, "replies": [{"body": "It doubled since 2016. That's crazy.", "score": 14, "replies": []}, {"body": "2022 was up and down", "score": -16, "replies": [{"body": "My bad, I can't even decipher the most basic charts.\n\nAt least I belong here at /r/wallstreetbets alongside the rest of the financially-challenged individuals.", "score": 9, "replies": []}, {"body": "Every year is up and down if -20% is still \"up and down\" no?", "score": 7, "replies": [{"body": "this is flaired as a meme dude i dont care im just saying we've been sideways for a year", "score": 4, "replies": []}]}]}]}, {"body": "I agree with your assessment of the market cycle. I think we are currently in the awareness phase, where more and more people are becoming aware of Wall Street Bets and what we're up to. The mania phase will occur when everyone is talking about us and our exploits, driving prices higher and higher. Eventually, there will be a blow-off top as everyone rushes to sell before prices come crashing down.", "score": 43, "replies": [{"body": "Exhibit: \"denial\".", "score": 34, "replies": [{"body": "This is a bot lmao", "score": 17, "replies": [{"body": "Yes, I'm glad you got the joke", "score": 1, "replies": [{"body": "You’re welcome", "score": 1, "replies": []}]}]}, {"body": "Slobbering delusion phase", "score": 5, "replies": []}]}, {"body": "![img](emote|t5_2th52|27189)", "score": 2, "replies": []}]}, {"body": "Sir, this is a dumpster behind Wendy's", "score": 9, "replies": [{"body": "so get to work buddy my little guy is getting cold", "score": 7, "replies": []}, {"body": "Please leave this sub", "score": -3, "replies": [{"body": "Now that's a clear downvote bait", "score": 3, "replies": [{"body": "Nope. You really should just leave. That joke stopped being funny ~4 years ago, and you didnt even do it right. You should leave and go back to r/bussy where you belong", "score": -4, "replies": [{"body": "Who hurt you sweetheart", "score": 1, "replies": []}]}]}]}]}, {"body": "....Do this winning trade process everyday with SPX 0dte options and get rich in no time, and live happily ever after in 2023,", "score": 5, "replies": []}, {"body": "That last phase is consolidation and may be a pause before awesomeness resumes. NVDA looks to be in that stage.", "score": 3, "replies": []}, {"body": "The shorts countless buy stops will be taken out before we go down. Since every one is short this market, there is a lot of buy stops that need to be activated.", "score": 2, "replies": []}, {"body": "I honestly laughed really hard at this. Thank you", "score": 2, "replies": [{"body": "thank u brudda  🤗", "score": 1, "replies": []}]}, {"body": "What about exponential growth theory? Zoom out far enough and those graphs all become very steep on the right side.", "score": 2, "replies": [{"body": "this is a logarithmic chart check my labels on the y axis . Very troubling", "score": 2, "replies": []}]}, {"body": "You're chart is backwards. This is WSB, buy high sell low.\n\nAlso, your graph is only works for insiders. Buy before the mania? When retail hears, that IS the mania. Most of the time it is insiders dumping on dumb retail like us.", "score": 2, "replies": []}, {"body": "Your timeframe is too small. We're at first sell-off right now.", "score": 1, "replies": [{"body": "i think ur right actually", "score": 1, "replies": []}]}, {"body": "Guys i think we are in the take off phase, not financial advice", "score": 0, "replies": [{"body": "PUT YOUR HANDS UP mxk2020!!! POLICE ARE ENROUTE! PREPARE TO BE BOOKED FOR PROVIDING ILLEGAL FINANCIAL ADVICE!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "I was joking, this is why AI will fail", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "i dont know if its a bull trap or not", "score": 1, "replies": []}]}, {"body": "![img](emote|t5_2th52|4258)", "score": 1, "replies": []}, {"body": "But AI!!!!!! Will save us all!", "score": 1, "replies": []}, {"body": "That red line looks awfully like a bull flag.", "score": 1, "replies": []}, {"body": "I would agree that in today's world,  thanks a coordinated QE system by all federal reserve agencies around the world..... this is the most likely outcome as stocks never correct properly as they should anymore", "score": 1, "replies": []}, {"body": "Are these the candles everyone talks about", "score": 1, "replies": []}, {"body": "pretty accurate", "score": 1, "replies": []}, {"body": "interesting", "score": 1, "replies": []}, {"body": "When crash?", "score": 1, "replies": []}, {"body": "2022, that's all, figure it out", "score": 1, "replies": []}, {"body": "I will buy at literally any point in this chart and outperform long.", "score": 1, "replies": []}, {"body": "I’m more accurate than any investor I’m always at the top baby.", "score": 1, "replies": []}, {"body": "Every single WSB member looking at charts:\n\n\"Everyone is stupid except me\"", "score": 1, "replies": [{"body": "this is a joke post big guy", "score": 1, "replies": []}]}, {"body": "It would be painful, but in the long run healthy to retest the trend line. This is across almost all markets including real estate. It's all been fueled by money printing octane, flip this house bullshit low interest rates all sorts of artificial crap. I would not be surprised if the tree really gets shaked", "score": 1, "replies": []}, {"body": "As we continue to move up and up and up. Where ever the bull trap is, I’m waiting for it.", "score": 1, "replies": []}, {"body": "In true wsb regard fashion, labeling a bear trap as a bull trap, multiple times.", "score": 1, "replies": []}, {"body": "So your saying stocks only go up?", "score": 1, "replies": []}]}
