{"title": "Piedmont Lithium 2.0 - Tesla will also sign a deal with a nickel miner, and here it is.", "selftext": "[removed]", "id": "j1wjw3", "created_utc": 1601374668.0, "score": 151, "upvote_ratio": 0.96, "num_comments": 89, "comments": [{"body": "I'm a VALE bagholder and I approve this optimistic post.", "score": 191, "replies": [{"body": "[removed]", "score": 17, "replies": [{"body": "It’s gonna be Glencore", "score": 19, "replies": [{"body": "[removed]", "score": 4, "replies": [{"body": "They produce some of the worlds purest nickel, and are the largest recyclers and processors of nickel (including batteries). Plus they’ve been ramping up their supply chain worldwide swapping over to a new system etc. I know this because I was hired to assist the American team with implementation of the new ERP system in Australian offices earlier this year.", "score": 40, "replies": [{"body": "Also, they already have a contract with tesla.\nAnyway, buy stock or not? Price is 163, with a medium target of 230... I don't know if it's a bargain or the price is reflecting some bad news.\nEven google can't find news regarding any problem.", "score": 12, "replies": [{"body": "[removed]", "score": 16, "replies": [{"body": "A hahaha, sadly not. BP is actually doing ok, against all odds", "score": 3, "replies": []}]}, {"body": "It’s being heavily investigated by the Swiss for their use of child labour and slavery in the DRC.", "score": 1, "replies": [{"body": "Fuck the Swiss, they should investigate where they stashed all the nazi gold.", "score": 15, "replies": [{"body": "They don't need to investigate when they know exactly where it is.", "score": 11, "replies": []}]}]}]}]}, {"body": "Potentially because they already have cobalt deal with them. The Giga is imo hot take cause of their environmental sustainibility, and they already had talks with tesla about developing the turnagain mine. But it will take time and i reckon tesla wants the nickel soon.", "score": 8, "replies": [{"body": "They didn't have talks with Tesla. It was a rumor to pump the stock.\n\nEdit: Talking about Giga Metals", "score": 3, "replies": [{"body": "Nice", "score": 2, "replies": []}, {"body": "https://www.google.com/amp/s/www.forbes.com/sites/korihale/2020/06/22/tesla-supercharges-africas-cobalt-concerns-with-new-glencore-deal/amp/\n\nI think a deal for cobalt exists", "score": 1, "replies": [{"body": "Sorry, I should’ve been specific. Was talking about Giga Metals.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "769 yup 4/", "score": 1, "replies": []}]}, {"body": "VALE bagholder checking in", "score": 4, "replies": []}, {"body": "Same bro, although I’m still up overall on Vale.  Just picked up some glencore now too", "score": 1, "replies": []}]}, {"body": "VALE VALE VALEVALE VALE COME ON PAPA ELON FUCK YOU", "score": 17, "replies": [{"body": "My feelings concerning all Nickel in the world summed up in one comment", "score": 5, "replies": []}]}, {"body": "Glencore and Vale are too big for daddy Musk to moveth\n\nGlencore already has papa's cobalt deal", "score": 16, "replies": [{"body": "Wonder if this will do anything to First Cobalt (FCC)\n\n[https://www.mining.com/glencore-commits-45-million-to-restart-first-cobalt-refinery-in-canada/](https://www.mining.com/glencore-commits-45-million-to-restart-first-cobalt-refinery-in-canada/)\n\nI knew I'd seen the name Glencore around, I threw 400 bucks at FCC as a giggle because I know the Ontario government is pushing for local manufacturing and I figured it has a chance at bouncing pretty well.", "score": 1, "replies": []}, {"body": "Option price might still get pumped", "score": 0, "replies": [{"body": "No it won't", "score": 1, "replies": [{"body": "Happened to Vale the day after the DD on WSB", "score": 0, "replies": []}]}]}]}, {"body": "Here we go again.\n\nSincerely,\nVallehala", "score": 12, "replies": [{"body": "all aboard the nickel plated rocketship, soon we ride!", "score": 1, "replies": []}]}, {"body": "October 4th is a relevant date for VAL3. There's an independence vote for New Caledonia to become free from France, another in 2022. Tesla already has a deal with them to use New Caledonia nickel in Giga Berlin. The mine was being shopped and a deal fell through with other buyers.\n\nOctober 20th may also be relevant. They hired the current Brazilian treasury secretary and he becomes vested on this date. Not sure if that matters in the PR scheme or not.\n\nThey're also still hiring like crazy. Nothing has pointed me away from them, that's where my money is. Been watching since end of July.", "score": 8, "replies": []}, {"body": "HNCKF is where I have my money.", "score": 6, "replies": [{"body": "Same.", "score": 1, "replies": []}]}, {"body": "Thoughts on going into Piedmont Lithium now that it dropped off almost a good 10 dollars. Any change it'll balance back up tomorrow?", "score": 5, "replies": []}, {"body": "JJN\n\n:PLM", "score": 5, "replies": [{"body": "What's the reason for PLM? I'm interested...", "score": 1, "replies": []}]}, {"body": "Buy shares guys. Theta will eat your ass. Besides, you have to anyways for most of these.", "score": 3, "replies": [{"body": "Buy shares sell options on all of them.", "score": 1, "replies": []}]}, {"body": "isnt vale brazilian?", "score": 3, "replies": [{"body": "No I think they just mine under the resort in Colorado", "score": 3, "replies": []}]}, {"body": "What about Talon Metals (class 1 Nickel, green, in the US)? [http://talonmetals.com/](http://talonmetals.com/)", "score": 3, "replies": [{"body": "Could be although it doesn't sound like they are ready yet? \nProbably will buy just in case", "score": 1, "replies": [{"body": "Neither is Giga Metals AFAIK", "score": 5, "replies": []}]}, {"body": "doesnt look like they have any output", "score": 1, "replies": []}]}, {"body": "Giga has most appealing name.\n\nFree DD", "score": 3, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Yea but name sounds tech related.\n\nSoooo.....\n\nLeaps are free money", "score": 2, "replies": []}]}]}, {"body": "Nickel is in Canada\nHudson Bay is in Canada\nHudson Bay Minerals owns working Canadian Nickel mining operations... and other dirt works\n\nYou're missing out, VALE suckers", "score": 5, "replies": []}, {"body": "Vale is really fcking me good....just bought more calls tho dec 18 expiration. Fuck it", "score": 3, "replies": [{"body": "God speed", "score": 1, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/spacpro don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "Plausible", "score": 2, "replies": []}, {"body": "Nano One ticker NNOMF", "score": 2, "replies": []}, {"body": "What about FPX Nickel Company?  \n [https://fpxnickel.com/](https://fpxnickel.com/)", "score": 2, "replies": [{"body": "That's my pick. Musk mentioned we need a way to mine metal in a more environnemental friendly way and this company is testing a carbon neutral process to get nickel out of the ground.\nhttps://www.metalbulletin.com/Article/3949196/Canadas-FPX-tests-first-carbon-neutral-nickel-mine.html", "score": 2, "replies": [{"body": "Hmm ok; guess I'll go all in.", "score": 2, "replies": []}]}]}, {"body": "Lundin mining isn't even on Robinhood lol", "score": 2, "replies": []}, {"body": "Piedmont lithium was the only one without an options play. Which of the above don't have options? Narrows the list down!", "score": 4, "replies": [{"body": "Four of them don't have options plays unfortunately. Only ones with options are VALE and Hudson Bay.", "score": 5, "replies": []}]}, {"body": "They were discussing with giga mining Corp though! Don’t you think there’s a possibility they’ll side with them", "score": 2, "replies": [{"body": "That was fake news.", "score": 4, "replies": []}, {"body": "No wonder their pump and dump worked so well. Go do some actual DD before investing.", "score": 1, "replies": []}]}, {"body": "Won't news of any of these guys these stocks being chosen by TSLA pump the others though? If only for a day or 2?\n\nI'm trying to lessen my invested cash before the election so I chose VALE a few weeks ago and will see what happens", "score": 2, "replies": []}, {"body": "Its probably Glencore based on Teslas battery day presentation pictures. (They showed PLL also)\n\nGlencore is also already supplier for Tesla. (Cobalt)", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Glencore also has nickel mines in ontario.", "score": 4, "replies": []}, {"body": "Sudbury Ontario has always been know for it nickel production... the city lives or dies based on the price of nickel.", "score": 1, "replies": []}]}]}, {"body": "Holding 11/20 12c and just bought more 12/18 14c valegang baby", "score": 1, "replies": []}, {"body": "NAN- North American Nickel", "score": 1, "replies": [{"body": "What do you see with NAN?", "score": 1, "replies": [{"body": "They're a nickel mining company that wasn't mentioned on the list.", "score": 2, "replies": [{"body": "Can't find them", "score": 1, "replies": [{"body": "They're listed in Canada.", "score": 1, "replies": []}]}]}]}]}, {"body": "way ahead of you battery metals are liquid gold. They use silver too. Buying up all that shit. Dollar cost averaging to zero if I must on stocks. Placing calls.", "score": 1, "replies": []}, {"body": "Hey...will I get a premium on my old pickles then?", "score": 1, "replies": []}, {"body": "How long do you retards think this down trend is going to last ?", "score": 1, "replies": []}, {"body": "Long shot calls on Lundin", "score": 1, "replies": []}, {"body": "It’s not just Tesla doing this....\n\nVale is the best bet\n\nMost sensible option for Tesla is to buy / JV a refinery and put through nickel concs.\n\nOn those above:\n- Sheritt - Cuban nickel so not this one\n- Glencore - they refine in Norway, so doubt it \n- Vale - maybe, but they sell a lot of aero grade for a lot more money\n- Giga (and other BC projects) forget it - loads of these around and never get built\n- Lundin - concs not metal\n- HudBay - Cu and Zn - not much nickel", "score": 1, "replies": []}, {"body": "Too late to buy calls on Piedmont? I scared the bulk of the share increases are priced in already.", "score": 1, "replies": []}, {"body": "GIGA is the only way to go from this list.  \nThey are planning the worlds first 0-carbon mine , in comparison with VALE , who has many environmental disasters + new lawsuits on hand.", "score": 1, "replies": []}, {"body": "just wait for the announcement and jump in then like everyone did piedmont 1.0. You guys already done with piedmont 1.0?", "score": 1, "replies": []}, {"body": "Fuck VALE\n\nFuck LAC\n\nFuck WSB\n\nAnd most importantly\n\nFUCK ME for going full RETARD", "score": 1, "replies": []}, {"body": "https://www.reuters.com/article/us-mining-canada-vale-sa-idUSKBN26N3HH", "score": 1, "replies": []}, {"body": "Metal plays via miners. \n\n\nKiddos. Grow up. You want to play the commodity not the miners. The miners will fuck you and you’ll be left holding the bag. Buy the fucking commodity.", "score": 1, "replies": [{"body": "How u du dis?", "score": 1, "replies": []}]}, {"body": "You couldn't just name them by the tickers? Don't you know I'm lazy?", "score": 1, "replies": []}, {"body": "why pll is down today?", "score": 0, "replies": []}, {"body": "I did some half-ass research into GIGI and bought a hundred shares or so. They're an exploratory mining company that owns the rights to a fuckload of nickel and colbalt in northern BC. Currently (according to google maps), it is completely undeveloped, no road going to or from the deposit and when I say northern I mean the yukon northern BC. They appear to already have ties to TSLA  (hence the giga - gigafactory name and picture of a gigafactory on their homepage. highest risk highest reward.\n\n\\+shares are cheap as fuck right now (market cap 60M)  if this ends up being a thing, im sure they will take off.\n\n\\- Highest probability of being a bagholder as they currently dont have a mine up and running.", "score": 0, "replies": []}, {"body": "does any one knows how much tonnes of nickel tesla needs for it's car production ?", "score": 0, "replies": []}]}
{"title": "CRMD - Prime for a buyout - 2+ Years of DD below", "selftext": "HERE IS MY POSITION (for the haters/doubters/douchers): [https://imgur.com/a/fLfdseD](https://imgur.com/a/fLfdseD)\n\nCRMD (Cormedix) has been my golden goose since July 2018. I believe they will either partner-up or (more likely, imo, get bought out). I am going to explain my reasoning why, either way, I think this has the most upside in the market right now (I own lots of shares and options, trying to time the explosion)\n\nThey developed a catheter-lock solution (solution that helps reduce infections) called DefenCath (formerly called Neutrolin). This is a huge issue in the world and hundreds of thousands of people die from this annually -with a mortality rate of about 25%.\n\nIn the midst of the largest Phase 3 trial for HD, it was halted due to efficacy by the Data Safety Monitoring Board. Meaning, the board saw all they needed and the results were so convincing, there was no need to continue the trial. The stock went from $.34 to $.80 the next day. The P Value is 0.0006 from the trial - over 1000 times better than the P Value necessary to equate this to a \"successful\" trial. AKA - they knocked it out the park.\n\nAbout 18 months ago, the company conducted a reverse-split (5-1) to get the price over $5 and entice institutions and hedge funds to buy in much heavier. Most funds don't touch stocks unless they are over $5.\n\nRight now, it is trading at $5.66, which is $1.15 pre-split. The Market Cap is only $177 million. The market for Hemodialysis catheter locks is over $1 billion. For Oncology and other indications, it brings it to over $5 billion. Many believe the FDA will approve this for all indications, which will be a HUGE deal. I think this company will be bought out by big pharma\n\nSome facts and reasons why I think this is so bullish and also gets bought out or enters a substantial partnership:\n\n* P Value of 0.0006 is so amazing, I cannot overstate how important this data point is to the company and, more importantly, the FDA\n* The company received Priority Review from the FDA and Fast Track status - which puts them basically ahead of the line for the FDA to review\n* The NDA was accepted by the FDA at the end of August\n* The PDUFA Date (date the FDA will decide approval by) is February 28th\n* The product is currently approved and on sale in Europe, but they use an entirely different process for catheter lock solutions and this just does not fit into their model, so it does not sell well there at all - completely different story in the US and I can go into detail on what the differences are and why it is a non-factor here\n* The Board of Directors is filled with people over the age of 70 and they keep buying\n* Their new CFO has zero CFO experience, but experience in banking in Mergers and Acquisitions\n* New member just joined the board, Paulo Casto, and the PR said \"We are excited about his experience as CEO of Amylin Pharmaceuticals\" - he helped get Amylin bought out for $7 billion. He was the president of 2 other big pharma companies, each worth over $300 billion. He did not join the company for peanuts.\n* Cormedix said they plan to hire a team of 50 sales people to being selling the product - no job listings anywhere and no where to apply - I work in staffing and there is no way they are planning to do this and have it ready by February\n* Upon approval, they have 10.5 years of EXCLUSIVITY - meaning, only they can sell the product. Very attractive to Pfizer, who has the edge on the catheter-lock $5 billion annual market at the moment\n   * **I believe this is a huge reason this will be bought out - 10.5 year exclusivity clock starts the DAY DefenCath is approved. Cormedix can't waste time building a sales team - a company like Pfizer or J&J will want to buy this ASAP so they receive the entire 10.5 year time-frame to dominate the market**\n* JMP set a price target of $22 today (9/29/20200\n* Truist Bank set a price target of $20 last week\n* The CEO, Khoso Baluch, states on every earnings call that they will \"maximize shareholder value\" and are always looking to \"enter strategic partnerships\" - they have indicated they will absolutely be looking for partners to help market Oncology and other indications of the product's market\n* **This is VERY important - they received the right to go after LPAD - which allowed them to end their trial and not conduct another Phase 3 Trial. This is a very new process the FDA has rolled out to help drugs and products that have life-saving capabilities to receive approval through a much more streamlined and faster process. It cuts red tape.** It is not as good as regular approval, because the company will need to have certain info on the labels - think about cigarette packaging with warnings on it etc. It will allow them to sell the drug but not to the extent full approval would most likely allow. **What is important here is this allows Cormedix to receive approval through either the regular means OR through LPAD - basically gives them another shot at approval if the committee is nervous about approving a product that had less trials than a typical product would. But the FDA is really behind the LPAD process and Cormedix is the 2nd company ever to have a shot at receiving it - the FDA wants other companies to go after this and to make it attractive, so it is self-serving of them to approve DefenCath as a good example and case study.**\n* The market is $1 billion for hemodialysis, which is what the trial was done for, but their Chief Medical Officer at Cormedix stated \"a catheter is a catheter\" when asked if he expects the FDA to just approve for all indications\n* If approved for all indications, **the market goes from $1 billion annually, to over $5 billion.**\n* **Institutional Ownership has grown to over 60%!!!!**\n* **Insiders Buying has been very active in the past month and no insider has sold for over 2 years**\n\n**The ONLY bearish case I believe is a risk is that Elliott Management, who owns a huge chunk of this company, could get it in their heads to take this private with a hostile takeover. I just don't see this happening with all of the other institutional ownership here and at the levels it is at. Obviously, the other bearish case is the drug not receiving approval, with a p value of 0.0006**\n\nI may add some info here later this week, but this was a big brain dump for me. I am very curious to hear any bearish reasoning, so please throw any questions at me. I hope my 28 months of DD is helpful. GLTA.\n\n&#x200B;", "id": "j25l06", "created_utc": 1601405420.0, "score": 45, "upvote_ratio": 0.85, "num_comments": 86, "comments": [{"body": "So you're telling me you've been DD for 2years and you decide to \"share\" this great insight after they got pumped 20%? I am in, but fuck you.", "score": 35, "replies": [{"body": "Hah I have been trying to tell people for years. And, keep in mind, they reverse-split, so $5 is actually $1 pre-split. This is actually down from 2018 when it was above $10 for a week. And then it floated around $8 and $9 for a long time. Great price to get in.", "score": 9, "replies": []}]}, {"body": "[deleted]", "score": 13, "replies": [{"body": "Thank god I waited the extra month to post this", "score": 7, "replies": []}]}, {"body": "Positions? With screenshots", "score": 12, "replies": [{"body": "[https://imgur.com/a/fLfdseD](https://imgur.com/a/fLfdseD)", "score": 4, "replies": []}, {"body": "Screenshots? What, you don't trust strangers?", "score": -9, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "[https://imgur.com/a/fLfdseD](https://imgur.com/a/fLfdseD)", "score": 1, "replies": []}]}, {"body": "This isn't stocktwits", "score": 2, "replies": []}]}]}, {"body": "so what do you see the price being if: \n\n1. just the buyout without FDA approval \n2. just the FDA approval without buyout \n3. both approval and buyout \n4. none of the above", "score": 7, "replies": [{"body": "1. I believe a fairly priced buyout would be in the neighborhood of $1 billion up to $2.5 billion. Pre-approval gets them a discount so say, $800 million? That puts the share price at $25 minimum.\n2. I honestly have no idea how that will play out. I have seen companies dump on FDA approval, but that is when the product really does not have a market and/or the company has no go-to-market strategy in place. I don't anticipate that here, but ready to buy more if it does.\n3. I would guess the buyout price would be $35, but that could be way low. If it is already approved, you could see a company drop a couple billion to secure the market for 10.5 years and that is worth a lot. If they are approved on all indications? This could realistically go to triple digits. Sounds crazy, but this is low float, low market cap, and the market is huge for the product.\n4. Lol please don't make me answer.", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "[https://imgur.com/a/fLfdseD](https://imgur.com/a/fLfdseD)", "score": 2, "replies": []}, {"body": "My average is slightly under $5. I have options everywhere lol. Even used to have puts as a hedge but now just focused on calls.", "score": -8, "replies": []}]}, {"body": "My buddy has been playing CRMD for a while - he calls it \"Crumby D\"", "score": 5, "replies": [{"body": "Your buddy sounds like a blast!", "score": 3, "replies": []}]}, {"body": "Over here you said \"[*we* are waiting on acceptance news](https://www.reddit.com/r/wallstreetbets/comments/hf297r/crmd_primed_for_a_200_gain/fvuz4o4/?context=3)\"  does this mean you're affiliated with the company or the FDA?   What does the 'we' in that statement mean?", "score": 4, "replies": [{"body": "Lol I guess that is misleading. I said \"we\" as in longs or investors. We have been waiting for quite a while", "score": 3, "replies": [{"body": "oh okay :c )", "score": 2, "replies": []}]}]}, {"body": "I’ll throw some money at it. Those price targets are awfully high. We’ll see if they manage to get anywhere near that.", "score": 3, "replies": [{"body": "Nice! My PT would sound bananas to you, but minimum $40 imo. That only puts the market cap slightly above $1 billion.", "score": 2, "replies": []}]}, {"body": "Ahem, this was trading at a daily high of $5.90 the day I posted this. Who bought and who is holding????", "score": 4, "replies": [{"body": "I got some shares thanks to you a bit under 7 dollars. How long do you think until their catheter solutions is accepted by the FDA? I know the TAM is in the billions but im wondering how long until they can ramp up production and how much of the market share they'll actually be able to secure", "score": 3, "replies": [{"body": "That's awesome! We are guaranteed to hear by February 28th, but I think there is a good shot we hear something in 2020. I give it about 50% we hear this month and 50% in 2021. I think either at that point or shortly thereafter a partnership or buyout will be announced. I would not be surprised if this dipped on approval and then goes to the moon off that news. Hold until you hear about that. It's coming.", "score": 3, "replies": []}]}]}, {"body": "I went in on this as one of my first option plays like 2 weeks ago. I was dumb and bought $10 strikes for June. \n\nPlease give me some fucking hope here! Catalysts needed", "score": 3, "replies": [{"body": "Hey! Sorry - I was banned from this sub for marking the wrong flair. You should be good to go. $10 strikes post-approval should be money and June is the safest bet by far. Hold em tight!", "score": 2, "replies": []}]}, {"body": "My uncle is one of the Directors on the CRMD team. Agreed. This is a great time to grow your position :)", "score": 7, "replies": [{"body": "one comment in history and fresh acc hmmmm", "score": 17, "replies": [{"body": "I will not stand idly by as SlutTeamsix69's reputation as a gentleman and scholar is unjustly impugned!", "score": 16, "replies": [{"body": "I've never known a member of SlutTeamSix to be untrustworthy or dishonest.", "score": 4, "replies": []}]}]}, {"body": "Is this legal", "score": 6, "replies": [{"body": "The SEC doesnt have to know", "score": 13, "replies": []}]}]}, {"body": "Largest Shareholder, Paul Elliot of Elliot Management.\nHe is known to be an activist investor and will not leave money on the table. When this gets bought by Big Pharma he will instigate a bidding war and make sure to get every last dollar for the company! \n\n$42mm in Cash, $0 Liabilities/Debt\n\nCompleted $20mm Offering In August 2020. Cash Through Approval. \n\nNew CFO With Tremendous M&A Healthcare Experience From Bank Of America. \n\nNew Analyst Coverage: Truist $20 PT and JMP Securities $22 PT\n\nCompany Size: 35 Employees\nThey Cannot Launch And Market A Potential $1B Per Year Drug Themselves. Primed For Buyout. Agreed.", "score": 5, "replies": []}, {"body": "Didn't the company recently announce the expected PDUFA date of February 2021?  Does the LPAD designation move that date up?  If so, when is a reasonable timeframe?  Otherwise, lots of opportunities elsewhere instead of waiting 4 months for this to pop off...", "score": 2, "replies": [{"body": "LPAD is fully awarded upon approval, so unfortunately, it does not help with timeline in that regard. You are correct, however, February 2021 is the LATEST the FDA can let them know by. Could happen anytime beforehand, most likely after ADCOM, but a partnership or buyout can be announced anytime leading up to it. Contingent on approval, but a lot of these deals take place after the NDA is accepted by the FDA (happened a month ago) and before approval. They buy the companies for a better price this way and given that it is a contingent offer, does not offer much more risk than post-approval.", "score": 2, "replies": []}, {"body": "Correct PDUFA Date 2/28/2021 - While you may look at it as “dead money” between now and then there be much well could be a surprise partnership announcement.\n\nIn addition, I don’t see the stock price being surprised too much before then, I expect a run up to $8-9 at the very least ahead of announcement. \n\nGood time to get in at a lower evaluation IMHO", "score": 3, "replies": [{"body": "CRMD has no other products and someone else posted they have 35 employees - licensing to a manufacturer/distributor is the only way this gets to market.  If you want to call it a \"partnership\", you do you, but why buy the cow when you can get the milk for a negotiated fee?  The PDUFA approval will probably pop the stock price, but unless they have a couple more candidates in the lab that are going to filed soon, there is no reason to buyout this company.", "score": 1, "replies": [{"body": "I would say the big pharma companies who milk the $5 billion market fighting CRSBI's would want to buy this to keep their strangle on said market, but you know, maybe not.", "score": 2, "replies": [{"body": "> CRSBI\n\nYou are throwing around healthcare acronyms on a message board where the majority of readers struggle to properly apply a plaster.  The biggest $$ market is the US healthcare market and every decision is a trade-off between cost and effectiveness.  Big pharma doesn't make those decisions; insurance companies do and often times pharmas play along to maximize revenue at the expense of patient outcomes.  Not every catheter gets infected, so is the cost of this device less than the (# of infections times the cost of fighting the infection)?  Still doesn't mean a buyout, it simply means there is a better licensing deal on the table.", "score": 3, "replies": [{"body": "I didn't use many acronyms, purposely. The difference here is that insurance companies are not involved. If you contract a catheter-related infection while you are in a hospital in this country, your insurance company is not responsible to pay and you, the patient, are not responsible. The hospital has to pay out of pocket for any treatment related to the infection - it is similar to malpractice in their eyes because it could only get infected if the catheter is not flushed correctly or had been contaminated through negligence/not enough flushing of the catheter. I believe there is a deal in the works, the company has mentioned it, for some kind of government subsidy involved with the product's purchase. That is something I do not know enough about to discuss here tbh.", "score": 3, "replies": [{"body": "I would argue that in the med device space, insurance company buy in has a lot to do with whether a med startup exits well. One might naively think efficacy would be the deciding factor.", "score": 2, "replies": [{"body": "Insurance companies aren't involved in this at all.", "score": 2, "replies": []}]}]}, {"body": "Oh my bad!  *Catheter*\\-related bloodstream infection (*CRBSI*)", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Fine. I'm in", "score": 2, "replies": []}, {"body": "What made you choose 10/16 expiry instead of 11/20 or 12/18?", "score": 2, "replies": [{"body": "I own some December and March calls too. I really want to hold as many contracts as I can when a partnership or BO news or any huge catalyst hits. I have always had calls here and found the nearer term options that are closer to the money are much cheaper than long term out the money calls. So I buy a few closer to the money long term calls and a ton of short term calls and buy more when they expire. I have done the math and I spend about the same amount but hold more contracts. I am a dream customer for call sellers here but one day....", "score": 2, "replies": []}]}, {"body": "This stock alone has saved my memefolio over the past year.", "score": 2, "replies": []}, {"body": "This looks like it will pan out in the future (you wrote approval on Feb), then why did u get 10/16 shares?", "score": 2, "replies": [{"body": "I have $6 October calls. They're in the money right now. I had 50 and sold 20 last week for 150% and am free-rolling the other 30. They could announce a partnership with hemodialysis labs at any point.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Sure. From what I remember about this, the US uses heparin-based solutions as the catheter-lock solution around the country. To switch to Cormedix's product, they would simply change the vials they use - that's it. In fact, Cormedix's product is made up of mostly Heparin. Europe does not use heparin-based solutions. CitraLock is an alternative to heparin. For them to use Cormedix's product, it would require every hospital to purchase new equipment and change their entire catheter-use strategy. The ease of transition in the States is as simple as purchasing the product and using it. In Europe, it would require a lot of work and cost to do this. It just is not attractive there at all. Cormedix never really expected a big market there - they just received approval years before the FDA got around to it, so why not try? Also, they have an ongoing lawsuit because I believe a company in Germany ripped off their product and is selling it themselves. Europe is not kind to Cormedix.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "They are really frustrating. It's as if the call sellers know that if they are going to hit, they are going to hit big. It's really difficult to get good, long term options. Like, 50 cents for a $12 call? That's over 100% rise to be ITM. It's ridiculous.", "score": 1, "replies": []}]}]}]}, {"body": "Ok I'm in", "score": 2, "replies": []}, {"body": "So what’s your play on this? Should I get March calls or earlier\n\nEdit: nvm I’m retarded", "score": 2, "replies": []}, {"body": "Bought some shares and calls for March and December. Let’s make some money!", "score": 2, "replies": [{"body": "Yessir! I want them to open up $15 calls or higher so I can load with over 100 for cheap.", "score": 2, "replies": [{"body": "Would love that. Sent your post to friends and siblings as this is really solid DD. Am only in college so obviously can’t invest a ton, but profit is profit! Makes me even more confident that this hasn’t been upvoted a ton on Wsb- i sprinkled calls and stock, so let’s ride!", "score": 3, "replies": [{"body": "That's awesome! I have a lot of friends and family in this as well, so it sure would be swell for it to work out.", "score": 2, "replies": []}]}]}]}, {"body": "FDA just announced that ADCOM is NOT NECESSARY for DefenCath. This means it can be approved at ANY point. Up 15% pre-market. Get it while it's hot!", "score": 2, "replies": []}, {"body": "Been seeing you on the stocktwits board for years. Our day is coming!", "score": 2, "replies": [{"body": "Heyyyy! That's awesome haha. Our day is indeed coming and it has never felt closer. GLTY!", "score": 3, "replies": []}]}, {"body": "Now is a great time to add. February 28th is the PDUFA date and with ADCOM now cancelled, I really expect it before February. I originally thought 50% chance it happens in Dec 2020 and 50% in Jan 2021 when the meeting was cancelled, so I now think the best bet is January, but guaranteed by March 1st. \n\nThey just issued some shares through an ATM and it should start it's way back to $9 and $10 now. I targeted March and June options. GLTA.", "score": 2, "replies": []}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/issapunk don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "The time to get in is now. I smell Insider Buys being reported on Friday and Monday. The reason they didn't buy after the Earnings Call is probably because they knew this AdCom news and there was a blackout period until the PR. \n\n**I think this is primed for a buyout or partnership big time now. Elliott also doubled its' position in CRMD in the last quarter. They are the biggest Institutional Holder and they are famous for pushing small caps into a buyout.** GLTA!!!", "score": 1, "replies": [{"body": "This guy right here is a legend. I'm going to hop in. All in", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "That is awesome to hear! Good luck! Hold those shares tight for the big buyout/partnership news!", "score": 1, "replies": []}]}]}, {"body": "I suggest anyone who is interested to go for some Calls here. March is safe, but I have a feeling January calls hit big. I am all about quantity over quality here, due to the fact that I think it will go parabolic at some point. GLTA!", "score": 1, "replies": []}, {"body": "Shit volume most days except today. \n\nPoor liquidity. \n\n184M Market Cap\n\nOP Didn’t Post any Positions\n\nIf you fall for this 1 the word retard alone isn’t enough to describe your level of retardation", "score": -1, "replies": [{"body": "It's pre-revenue buddy. And they have enough cash through Q3 of next year and already purchased $4 million worth of material to make their product.\nAnd here is my position, you utter douche: https://imgur.com/a/fLfdseD\nI hold shares in another account as well, but this should be fine.", "score": 5, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/issapunk don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}, {"body": "too many words SKREEEEEEEE", "score": 0, "replies": []}, {"body": "CRMD is garbage. Used in Germany, barely. Do not buy.", "score": 0, "replies": [{"body": "Please see any of my comments regarding Europe and if you have a counter point, I am glad to hear it. Otherwise, you’re way off.", "score": 1, "replies": [{"body": "Stuck at 6 and weak. Going to retreat under 4 when Biden wins.", "score": 1, "replies": [{"body": "Lmao this comment aged like rotten milk on a Sunday afternoon.", "score": 3, "replies": [{"body": "Or maybe I own 38k shares and was trying to keep the price down you stupid fucking cunt.", "score": 1, "replies": []}]}, {"body": "Lol has nothing to do with Biden. This is all about approval. I’d be happy with another dip so I load up on 2021 calls.", "score": 1, "replies": [{"body": "Then why the fuck did you post it here to get a dip?!?!?   Who does that? C’mon dude.", "score": 1, "replies": [{"body": "You think I posted here WANTING a dip? Fuck off loser.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "ok im inversing, puts it is", "score": 0, "replies": [{"body": "I'd suggest getting both puts and calls. Guaranteed to make a good chunk one way or the other come March.", "score": 2, "replies": []}]}]}
