{"title": "When do you take profit?", "selftext": "I've been interested in options trading recently. I bought my first call at the beginning of September. I think it was SBUX 87.5c 10/2. It slowly went up the first two weeks and was actually in the money for a little while. I chose to keep it going because there was still maybe 2 weeks left. At that point I was up about $85, I ended up selling the contract for a $185 loss last week. I'm asking this because I bought TGT 160c 10/30 and I am currently up $75 (30%) in total. I know there is a while before expiration but when do I decide to sell? Thanks\n\nEdit: I sold at $350. Bought in for $245 so I’m up $105 (43%). I had done plenty of dd on targets movement but just realized that ath was $157 today. My call was above ath. I don’t think the market will go past ath this week so I got out. Thanks for all of the advice", "id": "j1ct8g", "created_utc": 1601302635.0, "score": 53, "upvote_ratio": 0.89, "num_comments": 92, "comments": [{"body": "I like to do LEAP calls and then sell closer dated calls. My general rule of thumb is if the short call starts going significantly against me, I’ll close the whole spread for a credit (since the long call went up more) and walk away. Otherwise I’ll close the short call around 50% profit and repeat it again. Not the best system, but this ensures that I take profit assuming the market isn’t completely tanking.", "score": 33, "replies": [{"body": "Doing leaps and selling covered calls when they go in the money seems like a pretty safe strategy.\n\nEdit: doesn’t seem like it’s supported by RH though\n\nEdit again: never mind it does. Just select the call you want to sell and it will recognize the leap as collateral", "score": 14, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Do you have to set it up as a spread, or can you leg into the long and short call individually? I haven’t tried it yet.", "score": 2, "replies": [{"body": "You can always leg in! I prefer legging in- there's risk either way, but I generally want to open the short call after I see the stock starting to move up (assuming I'm long) and then close the short call when the stock starts sliding down.", "score": 1, "replies": []}]}]}, {"body": "I primarily use Robinhood to trade options lol. I select through the dates and strike prices. RH lets you select up to 4 options at a time to execute in the same trade. I only ever execute 2 at a time for a spread.", "score": 2, "replies": []}]}, {"body": "I only have level 2 options right now so I can’t sell any options :(", "score": 2, "replies": [{"body": "Might be wrong but I think level 1 includes selling covered calls.", "score": 5, "replies": [{"body": "Yes covered calls is okay but spreads are not. I don’t know if I really want to tie up a lot of my account to do covered calls especially in a market where I don’t know where stocks are going", "score": 4, "replies": [{"body": "Wasn’t recommending doing it. Just making sure you knew that was available to you", "score": 6, "replies": [{"body": "Level 2 doesn’t let you sell covered calls using leaps as the cover", "score": 1, "replies": [{"body": "Thanks bro. OP edited the hell out of this. Was just trying to make sure he knew his options. I’m good tho. Thx.", "score": 1, "replies": []}]}]}]}]}, {"body": "I applied for RH level 3 and was approved seconds later. TDA makes it really hard to get level 3 but it should be easy on RH", "score": 3, "replies": [{"body": "I tried but didn’t get approved. I’ve heard that it’s either based on yearly income or trading skill. Whatever that’s based on. I’m a college student so my income is really low and I haven’t been trading options that long. Any thoughts?", "score": 3, "replies": [{"body": "I believe Rh has some profile options you can choose (sorry this might be TDA I’m confusing it with). Basically choose all the more risky options. For example choose speculative, extensive option experience, and other things of that nature to improve your chances. On TDA I heard that if you take their option course and call them you have a high chance to be approved right there end then, but haven’t tried they yet.", "score": 2, "replies": []}]}, {"body": "I got approved for level 3 on Robinhood without knowing a thing about options 😅\n\nI actually tried switching to TDA a couple months later but they would only approve me for level 2. Ended up going back to Robinhood since it works well enough for me.", "score": 1, "replies": []}, {"body": "how did u apply", "score": 1, "replies": []}]}, {"body": "Ah okay yeah you can’t do spreads then :/", "score": 2, "replies": []}, {"body": "Level 2 spreads are available on the desktop.", "score": 2, "replies": []}]}, {"body": "So your long leap call covers you in the event of the short one going against you, do you buy atm leap and sell slightly otm near term calls?\n\nIs there anyway that if the person you sold the call to exercises the option will ruin you?", "score": 2, "replies": [{"body": "That's a good question. Technically, LEAPs are defined as having > 0.8 delta generally speaking- I like to buy in the 0.7-0.8 range. I usually sell OTM 30-60DTE calls that are around 0.3 delta or less. I like this timeframe because I have a little wiggle room should I decide to roll the trade. Usually, when the stock price is right at the short call's strike point, I'll close out the spread for a credit. \n\nI've never experienced any of my short options getting exercised on me. In my cases though, since the short call is a higher strike price, I should be able to exercise my long call and then sell those 100 shares to the other party at that strike price. If you do the math, the differential here is comparable to the profit made by closing out a spread.", "score": 2, "replies": [{"body": "Thanks for the solid answer", "score": 1, "replies": []}]}]}, {"body": "Not sure if I fully understand your strategy. I'm still learning but I'm familiar with all the terminology you've used. Could you give me an example trade, for say AAPL or your favorite stock? Thanks!", "score": 1, "replies": [{"body": "Its called Poor man covered call. Example trade I'm doing. Bought 95 Call of AAPL for 28.45. Expiration June 17 2022 and Delta is 0.74(this is called LEAP). Using this call, now I can sell 121 Call Oct 16, Delta is 0.32. Now if you look at this trade, its positive delta and positive theta. You have to make sure you are positive delta, in case AAPL goes past 121 short dated call, I can exercise 95 Call to cover my short call.", "score": 5, "replies": [{"body": "Yep, that's exactly it. I actually learned about it by watching a TastyTrade video- they have lots of great options videos. I'll also comment under my thread with one of own examples as well :)", "score": 2, "replies": []}]}]}, {"body": "Could you give an example for something you’ve done this with?", "score": 1, "replies": [{"body": "Yep, replied to my original comment with a timeline of trades. Go take a look :)", "score": 1, "replies": []}]}, {"body": "What platform do you do these type of trades with?  I've been trying to figure out how to do it on TD Ameritrade or Robinhood and they both seem to only let you start a covered call with a stock or start a spread where you buy and sell the calls at the same time.  I haven't seen a way to cover a call with another long call that you have in your account already.", "score": 1, "replies": [{"body": "I use Robinhood since TDA wouldn't approve me for level 3 lol. Also, mobile trading works for me since I'm working during the day and can't conveniently be staring at a screen. That being said, TDA's technical analysis features are really great and I highly recommend.\n\nTo open a short call, just go to the stock where you have the long call > Trade Options > select a date out in the future and select sell call. Robinhood should allow you to submit that order if you have level 3 options trading. You can try it out after hours just to see that it's possible to make that order (options aren't traded after hours so it won't get executed- just make sure to cancel when you're done!). If there's some collateral requirement, Robinhood will also say that before you submit the order.", "score": 1, "replies": []}]}, {"body": "A lot of great discussion here- going to add an example of one of my trades as requested. This is definitely not a great trade, but I've broken down everything that happened.\n\n&#x200B;\n\n|Date|Option|Price|Net Profit/Loss|Notes|\n|:-|:-|:-|:-|:-|\n|08/20|TJX $47.5 Call 4/16/21 Buy|\\-$930|\\-$930|I entered this trade on TJX after I saw it had gone down a good amount.|\n|08/25|TJX $58.5 Call 10/2 Sell|\\+$65|\\-$865||\n|08/28|TJX $58.5 Call 10/2 Buy|\\-$120|\\-$985|Don't do what I did here- there's a tendency to buy these short options back when we think we can hold out and capitalize on more gains from the long option. If anything, I should have rolled for a credit. But, can't change the past so here it is.|\n|09/03|TJX $59.5 Call 10/2 Sell|\\+$115|\\-$870|Opened a new short call|\n|09/04|TJX $59.5 Call 10/2 Buy|\\-$100|\\-$970|I took profits too hastily here, but dropping around 15% within a day is not bad.|\n|09/04|TJX $59 Call 10/9 Sell|\\+$125|\\-$845|Turned around and sold another call the same day.|\n|09/11|TJX $59 Call 10/9 Buy|\\-$50|\\-$895|Managed to close this one out after it hit the 50% target.|\n|09/11|TJX $57 Call 10/23 Sell|\\+$130|\\-$765||\n|09/16|TJX $57 Call 10/23 Buy|\\-$273|\\-$1038|This time, I decided to close the spread completely after this short call started going in the money.|\n|09/16|TJX $47.5 Call 4/16/21 Sell|\\+$1253|$215|Less than a month later, $215 excluding taxes :)|\n\nBetter executed trades have much higher profit potentials, but we all have to start somewhere. Of course, an argument could be made for how I could have made more had I just sat on the long call and sold on 09/16 instead of opening all these short calls, but it's kind of a hedge. Also, I bought back one of the short calls for a loss which I shouldn't have done.\n\n&#x200B;\n\nAll in all, 09/16 is the day that TJX traded the highest over the past month, so that was a good time for me to get out, and I'm glad that the short call forced me out of the position in hindsight.", "score": 1, "replies": []}]}, {"body": "You walk into a casino and put $500 on the blackjack table.  The first hand the dealer shows a 6 and you have 17.  The dealer offers you $150 right now to walk away and you take it.  In the end, the dealer would have lost.\n\nThe next hand you put up all $650 and the dealer shows a 4 with you having 14.  The dealer offers you $105 to take it now, and you run with it.  The dealer turns over another face card and would have lost yet again, you have now left over $800 on the table in two hands.  \n\nOn the final hand, the dealer shows an ace and you with all the money you have being bet, are showing a 4-2.  You hit twice and bust.  The dealer takes your money without ever giving you a third chance to run.\n\n&#x200B;\n\nThis is why trading in a lot of ways is more deceptive than actual gambling.  In a casino, you put the money down and wait to see what happens.  There's no scenario where the casino will pay you a fraction to walk away early aka scalping.  \n\nWhen you put up the $245 for the TGT call you never told yourself I'll be happy if I get up 43%.  You probably didn't tell yourself anything.  **I'd strongly recommend swing trading with options by ivanoff**.  What you're doing is trading B- to B+ setups with options and then punting them early thinking you're making a smart decision.\n\nSize your options for a max loss and then trade them like a casino.  Absolute black and white rules that cannot be broken.  The casino lets you make the bet anytime, but they have a real consistent edge before you ever get to place a chip down.\n\nWhen you're betting with options, you better be sure you're trading an A+ setup.  Buying outright calls in this heightened volatility will only work when you have a real edge that can be used properly in this environment.  But what you just described was not that.  \n\nThe issue with ignoring this is eventually your early punt turns out to be the wrong idea, and then you hit the normal drawdown without any of the upside cushion you would have had if you held your winners longer.  \n\nDon't ask others for when to take profit--track trades yourself and determine that.  Options are the most sophisticated instrument many traders will ever use, and they're doing so with zero F's given, much to their later regret.  \n\nI'd strongly suggest focusing on what your strategy is, and why options benefit it, and then the profit can start to take care of itself.  But what you described is something that will not work long term, and I hope I'm convincing you to stop and reassess while you still can.    \n\n\nIf you're unsure where to start, ask yourself if your strategy works well when trading equities instead of options.  Buying outright direction only increases the returns of the strategy, so if your strategy isn't strong enough, start looking at past winners and go from there.  Not saying to not use options, but stop trading them the way you are, there's a better way.\n\nGood Luck.", "score": 23, "replies": []}, {"body": "I generally ask myself:\n\n\"Would this position be worth opening right now considering no commissions or money paid to the market maker?\"\n\nIf so, I stay in my position.  Why close it?  It's a good position!", "score": 10, "replies": [{"body": "Thanks. I realized that target literally hit all time high today and my option was price even higher than that so I got out", "score": 10, "replies": []}]}, {"body": "Try to do 30/50. Sell some at 30%, sell rest at 50%", "score": 8, "replies": []}, {"body": "Honestly that is why selling is easier to me. Your max profit is locked in so I take 50% of that with a call you need to set one or setup.a trailing stop call with an oco, so if you see rapid movement down you can sell. Best to automate these decisions when your thinking clearly.", "score": 8, "replies": [{"body": "Can you do this with robinhood? I do that a lot with regular stocks but I didn’t think I could do it with options", "score": 1, "replies": [{"body": "Not sure about Robinhood, I use thinkorswim but to that you right click the option to get an id and enter it like using a stock. You may be able to do that similarly in RH.", "score": 3, "replies": [{"body": "Yeah you can’t with robinhood. I have been thinking about switching to think or swim. How is your experience?", "score": 2, "replies": [{"body": "It's been pretty great actually. I'm still small so the 1.60 contract doesn't really apply since Im buying things under $1.00 a contract. I just usually buy .30-.80 contracts and do more of them if i want \"tastier\" options.", "score": 2, "replies": []}]}]}, {"body": "I don’t think you can set a trailstop for options in rh. At least not that I ever saw.", "score": 3, "replies": []}]}]}, {"body": "Before you ask yourself when you take profits you should also know when you cut your losers. You can imagine where you will be if you hold your losers to -75% and winners to 50%", "score": 6, "replies": [{"body": "This is one I've struggled with because if you are buying options 6+ months out (not sure if that counts as a LEAP quite yet) then a -75% P/L can actually come back pretty quickly. I learned this the hard way with AAPL after the event. If the expiration is a lot sooner than theta will kick your ass and its much harder to make up lost ground.\n\nSo I \\*think\\* this is all completely dependent on your extrinsic value... Not saying you shouldn't have an exit stategy, but big losses can turn to gains just as fast as your big gains turn to losses.", "score": 3, "replies": [{"body": "I go in with an amount I’m willing to 100% lose when just doing long calls or puts. A bunch of my calls that have made money were down a LOT at some point. I had Nokia leaps I held through March and sold 8 months later for 40% gains, they were -85% at the lowest in March. I’ve had Pinterest calls go from -60% to +75%, slack calls -60% to +25%, ringcentral calls -60% to +90%, SMH calls -60% to +1%, TLT -60% to +200%, and the list goes on. The key is honestly just not being greedy when it goes back in your favor or taking profits early if the trade immediately goes in your favor.", "score": 1, "replies": []}]}]}, {"body": "Before the applt event my apple call was up about 20%. The event started and since then it's been plummeting. Still holding out but a profit is a profit no matter how much. My BA went up 20% and instantly sold. No ragrets", "score": 5, "replies": [{"body": "Same here, holding on on my 3/19 120c but after the event it plummeted a ton. I also had a 1/15 115c that was up $400 at one point during the event and my greedy ass kept it and ended up selling at a loss cause I got scared. Buy high, sell low right? :D", "score": 3, "replies": []}]}, {"body": "Apparently when it’s too late.", "score": 3, "replies": [{"body": "Lol I’m 1 for 2 so far", "score": 3, "replies": []}]}, {"body": "I've had the same issue. Now as soon as I buy it I put in a limit order to sell it.", "score": 3, "replies": [{"body": "How do you know where to set the limit?", "score": 2, "replies": [{"body": "I consider why I bought that option, was I trying to capture gains based on earnings season or is it a scalp trade. If its based on earnings then I wait till then after earnings are announced I get the final bump then sell. If it's a scalp then I have a dollar amount in mind that I want to get. My scalps exp in about 2 or 3 weeks but I'll probably sell that same day. SPY is one example. I'll buy 10 contracts atm usually around 9:30 a.m. ctrl time. Or during the morning lows. Set my sell order for a 2 dollar gain and it'll sell when it hits my number. It's usually a day long process.", "score": 2, "replies": [{"body": "How often does this work/not work? I don’t have unlimited day trading so it could be an every once in a while thing. I just looked a the trends in moving average prices and decided that it would go up during this month. But I ended up buying on Friday and selling on Monday. Maybe I will hop back in at a lower price", "score": 2, "replies": [{"body": "Every investor is different find a pattern on a security that you feel comfortable with then try it or use paper money till you feel comfortable with your process.", "score": 2, "replies": []}]}]}]}]}, {"body": "i take profits at 25%", "score": 3, "replies": [{"body": "I would say, in general, that is too early. You should try different setups and strategies.", "score": 1, "replies": []}]}, {"body": "Lately I've been playing small ball. Last few calls I've closed early I've ditched once I was in the 10-15% profit range. Too many times I've waited for the GRAND SLAM I've been burned, most often with the calls expiring worthless. This is usually with weeklies.", "score": 3, "replies": []}, {"body": "**Standard Advice: Be sure to have a defined exit strategy before making your options play.**\n\n\nThis has turned out to be some of the best & most useful advice I've received in this sub.", "score": 3, "replies": []}, {"body": "If you made money sell, if you lost money and want to save money sell and finally if you don’t want to save money wait to for it expire worthless", "score": 4, "replies": []}, {"body": "On short to midterm options (30-60 DTE), I auto submit a GTC at 50% profit.", "score": 2, "replies": [{"body": "Oh okay. That’s a good idea. Do you ever end up selling yourself short if it goes over?", "score": 1, "replies": [{"body": "If you get greedy and chase a profit, it can easily gap against you or drop suddenly due to some outside news. Long term profitability requires discipline and consistency. Every trade should have a define stop loss and profit taking level selected prior to open.\n\nJust my 2 cents.", "score": 1, "replies": [{"body": "Agreed. I appreciate it", "score": 2, "replies": []}]}]}]}, {"body": "No rule. The market changes so much it is good to take gain as soon as you feel it is ripe. In your case for SBUX 85 bucks is a good deal.", "score": 2, "replies": []}, {"body": "Whenever the market starts looking too optimistic I get very apprehensive. After getting burned way too fast in the last two pullbacks I’m even more wary and taking smaller profits at 30% instead of 50%+.", "score": 2, "replies": []}, {"body": "Depends on your risk tolerance I would say. Friday I could’ve sold my SPCE $16c at about a 30% profit. As I was about to, the market closed (thank god).  Woke up this morning to see the stock jumped 15-20%. My call was now 300% return and I sold it ASAP. I know I would’ve been good with the 30% return as well, but if you think your option will be worth more, put in more thought and time into how much it should go up. Don’t just chance it like I accidentally did.", "score": 2, "replies": []}, {"body": "After I’ve cried a bit because the stock is up 10% and my call premium deteriorated so fast I’m only up $10", "score": 2, "replies": [{"body": "You should try selling premium in high IV underlyings.  Then you'll benefit from that IV contraction.", "score": 2, "replies": []}]}, {"body": "Who says there's profit?", "score": 2, "replies": []}, {"body": "I usually do long calls when I see a very bullish stock. I just closed my calls for DKNG @ 55 expiring on 10/16. It just kept going up but oh well, got a 63% return on my investment.", "score": 1, "replies": []}, {"body": "For me, ASAP.", "score": 1, "replies": []}, {"body": "After being up 400 and losing it this week. Always", "score": 1, "replies": []}, {"body": "Generally half way into the expiry of an option as decay starts to accelerate. This is either for profits or losses.", "score": 1, "replies": []}, {"body": "Pick a % and stick with it. Take your W bc as $PLAY just proved, one half baked NYT article can tank your underlying and mess with your options", "score": 1, "replies": []}, {"body": "At the end of the day you need to make a judgement call and your judgement gets better with experience. Well at least its suppose to.", "score": 1, "replies": []}, {"body": "I can’t say that I’ve ever had a profit to take.", "score": 1, "replies": []}, {"body": "Lock in some profit.  You don't have to sell out of the entire position.  If you're long a naked call and the stock is rising sell out a percent of your delta.  You can do this by either selling shares of the stock or selling a higher priced call.  You still make more money if the stock keeps going up, but now you have some protection if it drops back down.", "score": 1, "replies": []}, {"body": "50% profit. Or usually 2-3 weeks with the strategy of options at 30-45 days out.", "score": 1, "replies": []}, {"body": "Whenever I see GREEN", "score": 1, "replies": []}, {"body": "When you have some", "score": 1, "replies": []}, {"body": "Before theta starts kicking your ass", "score": 1, "replies": []}, {"body": "Generally half as it approaches 100% but not always, if I think the stock has more to run. I’m not sure why most people commenting seem to sell at 20-50% but either they have little conviction or a history of bad picks.", "score": 0, "replies": [{"body": "By half you mean half of the number of contracts you bought?", "score": 2, "replies": [{"body": "Sorry, yes, I try to sell half of the contracts if the premium has doubled, my goal generally is to play with the house’s money. With ones like Tesla where I’ve had conviction I’d sell one contract (of 5) each 100% it went up, rather than selling half of them", "score": 3, "replies": []}, {"body": "I should be clear also that I only play a few % of my money in options at any given time, I’m 95%+ long in stocks. I might be more risk averse if I played a higher percent in options.", "score": 3, "replies": [{"body": "My account is about 3k now and I’ve only really used 1k at any given time. I’m just having a hard time picking long stocks because everything is such a rollercoaster right now. I’m just trying to learn about all of the different methods to play the game. I’ll probably never buy more than 1 contract at a time until I can prove to myself that I’m doing it right", "score": 2, "replies": [{"body": "That’s probably the right approach. With 3k, I’d probably use only 1k of that for options, 1500 split across my 3 favorite stocks, and leave 500 in cash for any opportunities if stocks fall. You were late on your SBUX move buying it in September but I don’t know that I would have sold it yet, even without today’s move. TGT was late on its move too but am glad you got some profit. I’d only play options you know will go up. On 9/18 when PYPL, AAPL and AMD were down 15-20% each from their high a couple weeks earlier that was too much of a correction so I bought options in those knowing they’d go up and they did and I think they still will so I’m holding. Stocks that I’m just generally bullish on, without that same emphatic conviction, I just hold long as stocks. It’s good to look back at options you bought and say why did I buy them then, why would they go up from there, and why did I sell when I did and should I have. A kind to yourself but critical look back is healthy. Your picks and calls are reasonable though for sure, some people have way OTM picks that are ridiculous, and in ridiculous companies, and they swing for homers instead of singles, and that rarely ends well. You didn’t ask for any of this input but just wanted to throw some encouragement your way.", "score": 5, "replies": [{"body": "Thank you. This is helpful. It sound like you always play on uptrends. Do you ever buy puts when you think a stock is over priced? Would the strategy be the same?", "score": 5, "replies": [{"body": "I actually bought the 3 I mentioned at market open on 9/18 and was lucky that it went up that day, but otherwise that was sort of a downtrend, it was just too much of a down move for them too fast (despite the ever-considered warning to not catch a falling knife). Was probably just lucky though. If something looks overbought I’ll sell some or all, if something looks oversold I’ll buy some. Only of companies I believe in though. I’ve never bought puts - unlike calls there’s technically infinite downside if you’re wrong. Though I was definitely tempted to with Nikola.", "score": 3, "replies": [{"body": "I also don’t buy puts because I’m generally bullish and optimistic about people and companies. History has also shown that betting for stocks is safer than betting against them. On average or long term at least.", "score": 3, "replies": []}]}, {"body": "I need to follow this advice myself, but if you pick say 10 stocks to follow, you’ll have a better sense of knowing if the drop was too steep or if there is a chance of rebound etc. since you’ll be familiar with their movements.", "score": 3, "replies": [{"body": "Oh for sure. I’m not at all advocating following only 3 stocks. I think 20-30 is the right amount and you get to know them and get different levels for conviction for each, can respond to any news or macro events that affect each, etc. Then you see a couple pristine names that are way cheap and you pounce. Small plays though, never home run plays.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "I almost never take profit if I've held the stock less than 1 year. Being taxed at income vs LTCG makes it too hard to beat the market.", "score": 0, "replies": []}, {"body": "I take profits at +1000% or I ride it to 0", "score": 0, "replies": [{"body": "You sir are in the wrong sub.", "score": 2, "replies": []}]}]}
