{"title": "Tesla 800c 9/25. OI = 17,460", "selftext": "You people are nuts!!!\n\nHow in the living fuck is the stock gonna go up 75% in 3 days?!??!!??! Anyway i'm in, see you fuckers in the breadlines!!!\n\nP.S.\n\nFully expecting musk to unveil that they found an image of jesus in one of the battery cells.", "id": "ix8kj6", "created_utc": 1600719968.0, "score": 213, "upvote_ratio": 0.87, "num_comments": 97, "comments": [{"body": "How you feelin hoss?  Elon’s Twitter fucked it again.", "score": 42, "replies": [{"body": "Why I'm in shares instead of options right now...all in one tweet.", "score": 17, "replies": [{"body": "It's great when this happens, though. I pick up a few at a discount every time -- plus the funds are having to sell today before demand drops.", "score": 2, "replies": []}]}, {"body": "SEC come get him.", "score": 10, "replies": []}]}, {"body": "[deleted]", "score": 119, "replies": [{"body": "I agree. I don’t know much about options and would like to come here for learning more than memes.", "score": 12, "replies": []}, {"body": "[deleted]", "score": 4, "replies": []}, {"body": "Why not both", "score": -10, "replies": [{"body": "Keep them separated.", "score": 23, "replies": [{"body": "That's racist", "score": 11, "replies": []}, {"body": "No dad", "score": -2, "replies": []}]}]}, {"body": "[deleted]", "score": -4, "replies": [{"body": "*\"The ability to speak does not make you intelligent\"*", "score": 0, "replies": []}]}]}, {"body": "This is probably a long volatility play. Delta/gamma can pick up a little too if the we start mooning, but i think they’re hoping for a big IV spike....something about kurtosis and skew", "score": 29, "replies": [{"body": "This, and also sometimes cheaper otm options are purchased by call sellers with larger accounts to cap margin requirements. For example, if a penny picker in front of steam roller dude with a $2m portfolio margin account decides to sell 100 contracts of TSLA 9/25 600C because he feels that there is just no way on earth TSLA could reach 600 by 9/25 and ‘the premiums are so juicy’, the margin requirements on this over-leveraged position in the account will really blow up with just a few dollars up move on TSLA. This penny picker will get a call from their broker to immediately add more funds to the account or liquidate part of the position to free up margin. By now this position is way in red even though TSLA merely moved up by $20 from the time he sold these naked calls, and with 100 contracts, it’s a lot of red. \n\nSo upon further discussion and debate with his broker on how he can keep this penny picking operation running until 9/25 without having to liquidate and take a loss, this person will go and buy some otm $800 calls for relatively much cheaper than what he sold the 600’s for, and now his account doesn’t have to face a margin stress test beyond TSLA being at $800. However, since TSLA keeps going up, and by the time it makes it to $475, he is like $50k in red due to IV expansion and other factors. He thinks about the time when TSLA was having a dip earlier in the day and he was up $30k, and does one of his usual ‘I wish I would’ve taken those profits.’\n\nHe decides since now ‘market makers’ are manipulating TSLA to rocket up and through no fault of his own he has been put into this unfortunate situation, he abruptly closes the entire position, realizing a loss close to 6 figures. When expiration comes, TSLA has tanked and never made it close to 600, let alone beyond it, so those calls would’ve expired worthless. He now says ‘never again’ and starts to look for other tops to buy and bottoms to sell, this time promising to himself that he will be more careful with position sizing and risk management from now on. Obviously, he soon finds himself in the same situation again and the cycle repeats. \n\nAnd yes, these people exist, I know some personally.", "score": 37, "replies": [{"body": "No fucking way. How do you even get to a $2 million account collecting dogshit in front of a steam roller? 100 NAKED short calls? The mind boggles.", "score": 7, "replies": [{"body": "It’s the wealthy man’s Robinhood account. They can’t be bothered with the inconveniences of PDT rule or learning how to trade with a smaller amount. They didn’t make the $2m by trading, they had it already and deposited it in their trading account when they decided to pick up the hobby thinking it’s easy money and ‘what could possibly go wrong’.", "score": 10, "replies": [{"body": "Oh dear god. With that much capital, why not legit pay $500-1000 to take a derivatives course? Or run the Wheel on high IV stocks worth owning?   \n\n\nSounds better than donating $100K to option writers & theta gang", "score": 5, "replies": [{"body": "Beats me. And I actually haven’t made any of this up. Literally know a couple of people doing exactly this and playing with fire.\n\nPart of the problem seems to be that people who are otherwise educated and accomplished in life, lawyer/engineer/doctor/etc, they may have an impression of ‘how hard can it be’. They were able to learn and conquer many other things in their professional life, so what’s putting on a couple of trades in a trading account. And if that gets combined with beginner’s luck and they get the impression this will be easy money, it’s a recipe for disaster.\n\nAnd this is exactly what is happening with these friends of mine. They’re currently in a major hole with the recent pullback (they did sell puts on ‘good’ stocks like AAPL and AMZN, just a lot of them and right when the stocks were at the top, leveraged out the wazoo) and they’re scrambling to add more equities and cash to their accounts to keep it out of the red and get more buying power. One of them transferred longer term investments from a different account to this trading account to provide a cushion and increased buying power, of course nothing can go wrong with that. And of course increased buying power is the answer. I’ve already given them a piece of my mind about the situation as a humble friend, but we’re all adults and ultimately most people just learn by their own experience regardless of what anyone tells them.", "score": 12, "replies": [{"body": "That's absolutely insane. It's a shame that their money is going to waste, when they could actually invest it or put it toward doing some good.", "score": 2, "replies": []}]}]}]}]}, {"body": "Whoa this sounds like a great idea!", "score": 7, "replies": []}, {"body": "You’ve written my trading history, just minus a few decimal places in my case.", "score": 3, "replies": [{"body": "Lol I hear you bro, at least we’re not doing it with 7 figures ;)", "score": 3, "replies": []}]}]}, {"body": "Yea this is correct. It's a pure vol trade. Those can go up 3x pretty easily even if it's no where near ITM.", "score": 20, "replies": [{"body": "Volatility affects OTM more than ITM/ATM right?", "score": 8, "replies": [{"body": "Not exactly.  Near the money options move more with the underlying in general, but far OTM options can have large swings because of lower liquidity.", "score": 7, "replies": [{"body": "Which can also be a huge pain in the ass to sell", "score": 6, "replies": [{"body": "Not as long as WSB is in business", "score": 11, "replies": []}]}]}, {"body": "yes, higher vol means higher probability option could end up ITM thus price reflects this probability", "score": 5, "replies": []}, {"body": "Gamma expansion", "score": 1, "replies": []}]}]}, {"body": "Even if it goes up 10X in IV, the prices of contract will not move because of Vega, which is the change in price in IV. Because it is too far OTM and too near to expiry", "score": 3, "replies": [{"body": "So you're telling me there's a chance.", "score": 6, "replies": []}]}, {"body": "This suggests another stock split is needed.", "score": 0, "replies": []}]}, {"body": "Elongated Muskateer will help me retire early...600c 10/2", "score": 68, "replies": [{"body": "Elongated MUSKRAT", "score": 9, "replies": []}, {"body": "[deleted]", "score": -24, "replies": [{"body": "Ban.", "score": 9, "replies": [{"body": "Top post from that stupid sub has this gem in it though  \n\n\n>It costs me $50 dollars to put a call for 100 shares. Why would I not just buy the stock instead and save my 50 dollars?\n\n........what? haha", "score": 10, "replies": []}]}]}]}, {"body": "Selling near the money TSLA puts may be the move... thoughts? Given that IV seems to drop ATM and TSLA is heavily fueled by vol", "score": 6, "replies": [{"body": "Selling anything related to Tesla right now is a recipe for getting your face ripped off.", "score": 10, "replies": [{"body": "Mmmm perhaps, maybe a bull put spread for some insurance then", "score": 4, "replies": [{"body": "What do they say?  Something something...picking up pennies in front of train.", "score": 6, "replies": []}]}]}]}, {"body": "this aged well", "score": 15, "replies": [{"body": "See you tomorrow.", "score": 5, "replies": [{"body": "in the breadlines, was it?", "score": 9, "replies": [{"body": "Nah, I got your wife holding my spot.", "score": 1, "replies": [{"body": "Totem", "score": 1, "replies": []}]}]}]}, {"body": "Your nut sack aged well.", "score": -2, "replies": [{"body": "When did they start letting 12 year olds open brokerage accounts?", "score": 1, "replies": [{"body": "When they realized they were better investors than you.", "score": 0, "replies": [{"body": "you're really knocking them out of the park today", "score": 1, "replies": [{"body": "I know.", "score": 0, "replies": [{"body": "save me some bread", "score": 1, "replies": [{"body": "Screw you dude.  First come, first serve.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Whoever is holding this is hoping Elon starts texting some good shit after that last tweet haha", "score": 5, "replies": []}, {"body": "[deleted]", "score": 14, "replies": [{"body": "lol", "score": 2, "replies": []}, {"body": "Battery Cell shaped fleshlight to be revealed?", "score": 1, "replies": []}]}, {"body": "Rip", "score": 3, "replies": []}, {"body": "Kiss that shit goodbye", "score": 4, "replies": []}, {"body": "Aint gonna lie - saw this title and the post and thought i was in the WSB sub.", "score": 4, "replies": []}, {"body": "You only looking at one side of the trade.", "score": 4, "replies": []}, {"body": "This is very likely just one end of a spread.  Someone probably doing a 780/800c credit spread (or something similar) for virtually guaranteed money", "score": 3, "replies": []}, {"body": "Lol I'm 740c I think I'm alright.", "score": 4, "replies": [{"body": "Your 7 is on the wrong side", "score": 21, "replies": []}]}, {"body": "I did a diagonal 640/800 for 9/25 and 10/2 for this battery day play on top of other I already had", "score": 2, "replies": []}, {"body": "Daggon $800? Good luck", "score": 2, "replies": [{"body": "The thing that speaks volumes about Tesla's retail cult following?\n\n95% of options trades I'm involved in are done with me as the seller. This trade is absolutely insane. Literally free premium. There is no way on Earth that Tesla will announce something that will literally almost double the already-inflated share price in such a short time. This call is a seller's dream and I would love to just hand out 10-20 of them like I'm taking candy from a baby.\n\n\n...that being said I'm still scared to sell it because it's Tesla and Tesla is even more insane than an 800c on a 400 stock expiring in a couple weeks.\n\nNo position.", "score": 4, "replies": [{"body": "I hear ya , the stock has treated me well. Options not so much. But fingers crossed calls pan out this week\n\n545c expire 9/25\n\nI need to start selling options", "score": 1, "replies": []}]}]}, {"body": "You can still win even if Tesla doesn’t go up to 800. The premium will increase regardless with big moves. It’s still pretty much a yolo play though. Most people don’t exercise their options anyways. It’s almost always more profitable to sell than exercise.", "score": 2, "replies": [{"body": "I get all that, but we are only 3 DTE.  How in the fuck is there still over 17,000 in OI.", "score": 2, "replies": [{"body": "Don’t really see a reason to close a 3dte 800c early from the short side anyway...", "score": 1, "replies": []}]}]}, {"body": "Is this like WSB but with more fundamentals?", "score": 2, "replies": []}, {"body": "Did you wander off the reservation that is /r/WallStreetBets ????", "score": 2, "replies": []}, {"body": "Now that the stock has tanked, I'ma pick up some of these lottos", "score": 3, "replies": []}, {"body": "So is TSLA a good stock to do long call diagonal debit spread?  Or PMCCs?\n\nHell I might be willing to just buy 100 shares of TSLA and sell 20% OTM covered calls.  \n\nCurrent Price:  449\n\nThe TSLA 10/2 540 C bid is 17.25.  This is 20% OTM.  Days to Expire = 18.\n\nProfit:  17.25 / 449 = 3.8% over two weeks!!!\n\n&#x200B;\n\nUnless one believes that the underlying will eventually regress to a more normal level over the next year and lose anywhere from 25 - 50% of it's value, e.g. stock price goes to \\~250....one could sell these 2 week deep OTM covered calls for the next 10 months and make $$$$$$$\n\nIf I'm ever called...heaven forbid.....I'll make 24% if not more.\n\nI think this thesis is OK provided you think TSLA will trade > 350 over the next year or two.  You can take swings in stock price and still make some good money.\n\n&#x200B;\n\nThis is why I was thinking of buying a TSLA LEAP and doing this.....\n\ne.g. 9/17/2021 350 C is currently selling for 183.45.  Delta is a respectable 77%.  DTE 360 days.", "score": 3, "replies": [{"body": "$183 meaning $18,300 for the contract ?", "score": 3, "replies": [{"body": "yes...as opposed to spending $44,300 to just buy the TSLA shares outright at today's prices.", "score": 1, "replies": [{"body": "So break-even is 350+183 = 533?", "score": 1, "replies": [{"body": "Yes...Well....OK.  To carry this out fully:\n\n\\- BUY TSLA 9/17/2021 350 Call - Mid is 187.13 = -$18,713.  FYI if you ever execute this contract, your cost basis for your 100 shares will be 350+187.13 = $537.13\n\n\\- SELL TSLA 10/2/2020 540 Call - Mid is $17.43 = $1743.\n\nIf TSLA goes over 540 in the next two weeks, your results is simply the sum of the credits and debits from this trade:\n\nDebits:  -187.13, -350\n\nCredits:  17.43, 540\n\nSum (Debits + Credits) = 20.30\n\nSo you make 2K in two weeks with the unlikely event that TSLA increases by 20%.  I think over 2 weeks that is a low prob event.\n\n&#x200B;\n\nIf TSLA stays under 540...you net 1743.  Your capital needed is 187.13, so profit is 9.3%.  Rinse and repeat.  For every cycle that you do this...you can lower the cost basis of your LEAP.  Your LEAP is now 17.43 less....so 537.13 - 17.43 = $519.7....so the next covered call you sell should be > (519 - premium) for you to break even with this strategy.", "score": 2, "replies": [{"body": "Interesting.  So you could conceivably have the $18,713 \"paid for\" by the time the exp date comes.\n\nIf they're purchased at the same time, does that cover the Short call?  Or would you need to have $43,000 (or whatever the current price is) to cover the short?", "score": 1, "replies": [{"body": "Yes you can have a substantial part of your LEAP paid for.  Your LEAP will generally track the price of the stock.  And you can always sell your LEAP too at whatever time in the future and get out of this position.  Depending on where TSLA is, you might make or lose a little bit on simply closing your position.  But say you sold 4 covered calls and then wanted to close your position.  You might make a total of 40-50...which lowers the CB of your LEAP.  That's pretty good...even if your LEAP which you bought for 187 is now worth 150, and you sell it at 150, that is a loss of 37 but you have made maybe 50 and so your net is 13.  Note that I'm just tossing around some numbers here to make this point.  I suspect given the delta of 80%...and the general notion that I think Tesla is going to trade between 400-500 in the foreseeable future, this is a viable strategy.  It doesn't work if TSLA gets downgraded and trades consistently in the 300's.  But then again most trading plays won't work in that scenario unless they are bearish ones like buying puts.  Note too that your LEAP will decay over time...but it's probably pretty stable (e.g. tracks the stock price) for the first 50% of it's life.  But you can't do this for the entire LEAP because then your LEAP might become worthless. The goal is to sell your LEAP and still have a profit.  \n\n&#x200B;\n\nFor your second question...therein lies the rub.  I trade using Schwab and I asked them once, and one cannot sell a covered call against a long dated contract.  I said \"that's the whole point of doing this\" and apparently it can't be done unless you have been approved for their max option level 3.  I'm approved at level 2.\n\nLevel 3 at Schwab supports\n\n All of level 2, plus:\\*  \n\n\n* **Uncovered calls** and puts\n* Short straddles/strangles\n* Short calendar/diagonal spreads\n* Short ratio spreads\n* Uncovered options\n\nI was actually going to post something on here if other people have had similar difficulties doing PMCC's without having a max approval option level.  I guess this is an uncovered call.  Maybe it can be done easier on TD Ameritrade, or eTrade, or TastyWorks, etc.", "score": 2, "replies": [{"body": "Thanks for laying that out -- I only have just learned about LEAPS as part of my \"training\" so I didn't know how they were used.\n\nTDAmeritrade I haven't even gotten to Level 2 yet, but I'm pretty sure what you describe would be level 3 there.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "In two years tesla will either be way above 350 or way below 350.", "score": 2, "replies": []}]}, {"body": "What I don’t understand though is how the stock closed up 1.64% with higher IV and basically all 9/25 calls are down. Wouldn’t IV alone drive up the prices. Theta is going to eat away at the value but you don’t usually see that on weeklies with increasing IV.", "score": 1, "replies": [{"body": "It expires _this week_.", "score": 1, "replies": []}]}, {"body": "Because I meant to sell this and hit buy! Kept it just for fun", "score": 1, "replies": []}, {"body": "Lol I think this should go on r/wallstreetbets", "score": 1, "replies": []}, {"body": "45 percent of tesla market is professionally held and alot of those places vent macros. Tesla is good at gains... but it's really hard for tesla to maintain gains like that when portfolios limit percentages", "score": 1, "replies": []}, {"body": "Dude I sold 560calls expiring this Friday for a healthy premium huge theta huge iv shits free money.", "score": 1, "replies": []}, {"body": "このSUBは本当にWSBになった。", "score": 1, "replies": []}, {"body": "Excuse me sir, What the fuck is OI?", "score": 1, "replies": [{"body": "Open interest", "score": 1, "replies": []}]}, {"body": "Didn’t age well....", "score": 1, "replies": []}, {"body": "800C IV spike gonna stick in your little hole, go buy some lube!!!!!!", "score": 1, "replies": []}, {"body": "What made you think these were long OI trades?  With that kind of OI, and 3 days, I would say these were short calls, probably 40% easily covered calls.", "score": 1, "replies": [{"body": "Nothing, but I guarantee a good chunk of them are.", "score": 1, "replies": []}]}, {"body": "WSB post leaked again", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Sell the news eh?", "score": 2, "replies": []}]}, {"body": "Enron Muskrat is GOD", "score": 0, "replies": []}]}
