{"title": "How I accidentally ended up with 100 shares of Tesla...need advice. How likely to get this called away before expiry? Sold Tesla covered call $480 10/23 for $57.50.", "selftext": "I am honored to be part of the Tesla family. I am a long time share holder(only 10) and absolutely love this company. I hope to one day own a Tesla of my own. \n\nNow let me tell you how I accidentally ended up buying 100 shares of Tesla on its decline from 500 on last weeks decline at $440. I had 10 shares and wanted to add 10 more...\n\nI had the order up on my laptop for 10. I step away to grab a bottle for my 9 MONTH OLD SON...upon my return, he somehow SUBMITTED the order for 100 shares! \n\nI nearly had a heart attack. I started selling my other positions immediately because it caused me to be -40K in margin. I couldn’t think straight and I’m usually a cool headed guy. \n\nMoney has been a little tight since Covid and for most of the year I’ve been unemployed and recently started working again. \n\nI could have just sold the shares back but after the near panic attack and me selling half of my other stocks...I felt an Amazing Wave of relief come over me to see my portfolio have this wonderful company all over it. \n\nI can’t wait to one day hold 100 shares and not worry about it but I need income until we’re okay financially again.\n\nI sold a $480 covered call exp 10/23...how likely is it to have this called away before expiry? As much as I want to hold these shares, I can’t. \n\nI’d love to hear some input \n\nThank you in advance.\n\nThank you so much for all the helpful info! Glad to be here and part of this exciting club.", "id": "ivk387", "created_utc": 1600482757.0, "score": 34, "upvote_ratio": 0.84, "num_comments": 90, "comments": [{"body": "Giant bull here, I personally put a 50/50 on that covered call getting covered. I personally think there will be a pull back after battery day, but the delivery numbers if close to 150k can bring the stock back close to and maybe over 500.", "score": 20, "replies": [{"body": "I picked 10/23 specifically due to earnings. How do you feel about it being called away before? Does this happen often?", "score": 5, "replies": [{"body": "Look specifically to see how much of your call's value is extrinsic versus intrinsic. If there is any kind of significant extrinsic value left in the option, then it is very unlikely that it will be assigned to you. If you do get assigned and the shares are called away, you should be very happy because you get to keep that extrinsic value, and the person who exercised the option forfeits it.", "score": 2, "replies": [{"body": "How is he benefitting from the extrinsic value? He sold the right to buy 100 shares at a price, right? He received a premium and those shares will either be exercised or not based on the intrinsic/extrinsic value of option/market maker stuff. Im new to options. How does OP benefit by virtue of the call being exercised?", "score": 2, "replies": [{"body": "if there is still extrinsic value (time value) remaining in the option that he sold, then it makes it much less likely that the person holding the option will choose to exercise it. if that person were to exercise it, they immediately forfeit the extrinsic value - it would be like throwing away money. Where would that money go? In effect it would go to OP.\n\nhttps://youtu.be/7pTb1a5IgKM", "score": 2, "replies": [{"body": "I watched the video. He indicated the loss in that example is the same whether or not the option is exercised.\n\nYou keep the premium, regardless, right? I understand the buyer of the option is forfeit any extrinsic value if he exercises the option, but I still don't understand how that would effect the seller of the option.\n\nBuyer closes, there's extrinsic value, he profits from extrinsic value. Buyer exercises (at same stock price), there's extrinsic value, he loses money as a result of not making money off of that extrinsic value.\n\nSorry for being dense, but how specifically is the seller of the option in an advantageous position as a result of the buyer exercising as opposed to closing assuming they would exercise/close as the same stock price. \n\nThanks in advance!", "score": 1, "replies": [{"body": "Yes, the seller of the option keeps 100% of the premium if the purchaser of the option exercises the option.\n\nI suppose it's a matter of perspective when you sell an option that gets exercised while the option still has extrinsic (time) value.\n\nLet's make up an example. Let's say that you purchase 100 shares of stock ABC for $50 each. You then choose to sell a call, using that stock to cover the call. Let's say you sell the $60 call, and you receive $4 in premium. Because the option at that time is out of the money, then all $4 of the premium is extrinsic, or time, value. There is no intrinsic value. \n\nIf the stock goes up to $61, now the option has $1 of intrinsic value, and it probably has increased its extrinsic value as well, depending on how much time has elapsed and how much time there is left before the option expires. Let's say that the option has gone up in price to $6. So that's $1 of intrinsic value and $5 of time value. As the option seller, or writer, in order for you to buy back that call option, it would cost you $6. That means you would have lost $2 on the deal. of course, that's offset by the fact that you own the underlying stock as well and that stock has gone up. But just looking at the option position, you are in the hole by $2.\n\nLet's say for some crazy reason the person who purchased the option decides to exercise it at this point. What that means is that whatever the option costs now in the open market is irrelevant. The owner of the option has now exercised it, which means that you, as the seller of the option, get to keep all $4 of the premium that you originally received. in addition to that, you are forced to sell the underlying 100 shares at the strike price of $60. But since the stock price is $61 right now, essentially you're only losing $1 of value by being forced to sell at $60. But you get to keep the original $4 that you receive from the option, and you don't have to pay $6 to get out from under the position (to buy back the option).\n\nOf course, different scenarios might be a bit different depending on the numbers, but in the example I gave above, the seller of the option would be thrilled by being assigned. They only miss out on $1 of value from the underlying stock, and they are instantly no longer underwater with the option, in fact, they get 100% profit on the option they sold since they got to keep the premium.", "score": 2, "replies": [{"body": "Wait, I thought the seller of the contract keeps the premium even if the contract expires worthless", "score": 2, "replies": [{"body": "Yep, that is true also. The seller of an options contract keeps 100% of the premium if it is exercised or if it expires worthless.\n\nThe seller of an auctions contract also has the ability to buy the contract back (presumably from some other party who also purchased the same contract and now wants to sell it). Of course, if the contract is less valuable when it is purchased back, then the seller of the option makes a profit. If the contract is more valuable when it is purchased back, the seller takes a loss.", "score": 2, "replies": []}]}, {"body": "Awesome. Thanks. For some reason I wasn't even considering buying the option back (I believe called buy to close?) in order to reduce more potential loss. Now, if the buyer of the option doesn't exercise and closes his position what responsibility does the seller have at that point?\n\nPresumably since you're essentially matched up with buyers/sellers you would still have to buy to close your position EVEN if the individual who bought your option closed their position, or no?", "score": 2, "replies": []}, {"body": "Great explanation!", "score": 2, "replies": []}]}, {"body": "Another advantage is the seller can also take the proceeds plus part of the premium to buy back the shares from the market, resell the same covered call a second time, or just keep the shares and might still have enough left over premium from the original covered call sale for souvenir.", "score": 2, "replies": [{"body": "Is what I've indicated reference closing your short position accurate?\n\n*\"Presumably since you're essentially matched up with buyers/sellers you would still have to buy to close your position EVEN if the individual who bought your option closed their position, or no?\"*\n\nI'm fairly confident that's the case, but the poster I replied to didn't confirm. Are you able to? Btw, thanks for your input. Hadn't considered that.", "score": 1, "replies": [{"body": "If I sell a covered call, and the buyer of that call decides to execute the purchase, then three things will happen simultaneously to my account - I will no longer have those 100 shares, my balance will increase by 100 x the strike price, and I will no longer be short the covered calls.  Not sure if that answers your question.", "score": 2, "replies": [{"body": "Basically I'm potentially obligated to sell shares for a call all the way until expiration (assuming the stock price is above the strike price) unless I either buy to close my position or the buyer of the call exercises early.\n\nIt doesn't matter if the specific buyer of my call closes their position as opposed to exercising -- I'm still potentially \"on the hook\" for an early assignment/expiration assignment as MY position still isn't closed?", "score": 1, "replies": [{"body": "Correct.  And if the stock shots up, and the option becomes deep in the money, and both the volatility and time value have greatly diminished, that increases the risk of the option being exercised before expiry, but the risk is still low unless someone wants those shares to vote with them, to collect dividend, or another reason.", "score": 2, "replies": [{"body": "> both the volatility and tim\n\nGotcha. And the volatility and time value in this hypothetical would have gone down because the option is closer to expiration and further from being OTM. It's overall extrinsic value is much lower and as such less/no money is lost in terms of exercising the option as compared to selling to close?\n\nCan I ask you a follow-up question since you've been so helpful? So, when I buy to open or sell to open there is either a market maker or opposing position on the other side of that equation, right?\n\nWhat about when I sell to close or buy to close? From my perspective, someone has to give you that money still, right? If so, how does that option look?\n\nFor example:\n\nI buy an option expiring 10/31. I \"sell to close\" on say, 10/20. How does that option show in the \"option chain\" if it only has an amount of days left that isn't an available expiration date for the stock?\n\nOr, do these closing positions not show when you're scrolling through available options for a stock?", "score": 1, "replies": [{"body": "some random comments, not in any particular order:\n- options cannot expire on 10/31/2020 because it is a Saturday\n- If an option your broker allows you to trade is not listed on a certain web site listing option chains, then it is most likely that web site is broken\n- option chain only show open positions.  Closing a position reduces the number of open positions.  I don't know if you sell a covered call or put and the market maker buys stocks or sell stock to hedge (and no counterparty buys the opposing call/put), whether that increases the number of open positions.  I believe it should but that is just a guess.\n- volatility of stock price goes down because of less stock price swings\n- all trades, including buys, sells, open, close are done with your broker. Your broker may choose not agree to your bid (or ask) unless another broker matches the price, or your broker could take on the role of the counterparty for the trade. All trades, including between you and your broker go through the options clearing house, or between your broker and the counterparty's broker, go through the Options Clearing House.  That is why the settlement is on the next business day and not on the same day.\nI don't know enough to answer some of your other questions.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Extrinsic value is IV = 122 and time value of 55.", "score": 2, "replies": [{"body": "It's better to think in terms of the actual premium you got for the call.\n\nOct 23 $480 calls were trading at around $55/share yesterday, at $445 TSLA underlying.\n\nAssuming this is close to your TSLA entry price & the premium you got, your TSLA profit breakeven point is $480+$55 = $535.\n\nSo it doesn't really matter if your shares get called away in the $480-$535 price range, you will keep the premium and come out ahead: you can buy back the shares immediately if you so wish, or keep the $53.5k cash and put the ~$10k profits into the college fund of your toddler. 😁\n\nThe real question is, will TSLA move beyond $535 until Oct 23:\n\n - **Battery day** is September 22, next Tuesday.\n - **2020 Shareholder Day** is September 22 too. People tend to forget that it's not just Battery Day ... On Shareholder Days Tesla tends to disclose information beneficial to long term shareholders and cuddles up with institutionals.\n - If September 22 is disappointing or just \"meets expectations\", there will be big IV crush of at least ~$10, even if TSLA stays roughly flat. At that point you could buy back the call and realize ~$1k gains - and ride Q3 deliveries and earnings without capping your TSLA upside.\n - **Q3 deliveries** will be announced on Oct 2-3. Depending on how good or bad they are, if there's an IV crush, you could buy back the call.\n - **Q3 earnings** are either on Oct 21 or Oct 30. Note that there's a probabilistic play here: should Tesla announce Oct 30, the Oct 23 options will immediately lose value, because they'll not be after earnings anymore. Should this happen you could buy back the call *before* earnings, if based on deliveries you think earnings will be good.\n - Note that Tesla earnings price reactions tend to come with a phase delay, but IV crush is always immediate. IV will crush on 9:30 October 24, but TSLA might not realize even good earnings for days or weeks (!). Tesla is a complex company, and TSLAQ lies are the easiest job in the world to create & disseminate. It takes time for Wall Street to digest a quarter, and Q3 might be similar. I.e. you might have another chance to exit here, even if Q3 earnings are fantastic.\n - **Macro environment**: more volatility possible, and TSLA could follow. A macro dip could give you a way out and allow you to buy back the call at a profit, if you are otherwise still bullish on TSLA.\n\nOn the other hand, there's also the possibility that TSLA will drop more than the $55 premium you received, to below ~$390, your downside break-even point. In that case you still keep the premium, which will cushion your loss on the 100 shares.\n\nShould TSLA dip below $390, I'd examine the reason for the dip and buy back the $480 call if its price dips below $10-$20. There's little point in holding to expiry once you've realized 70%+ of the max potential gains - and TSLA is known to whiplash violently.\n\nFinally, \"being assigned on a call written\" should be the least of your worries: should it happen you'll get pure cash, you'll have a very tidy profit and you will have zero margin. Being assigned or exercised is only a worry if you've written a cash covered put, or bought a call or a put. Writing calls is the only stress free option variant. 😁\n\nI'd suggest thinking about this covered call the following way:\n\n- \"I contracted to sell my 100 TSLA shares for $535 in the next ~1 month. They are gone.\"\n\nYou might still end up having them in a bearish scenario, but you definitely should not think of having 100 TSLA shares in a bullish scenario.\n\nPut differently: you've entered a sticky SELL LIMIT $535 order for 100 TSLA shares that you are not allowed to cancel (for free).\n\np.s. The October 23 options chain is one of the lesser \"weekly\" expiries with low open interest and low liquidity. Be careful not to buy back this contract at the ask, the spread can be sky-high. Post a buy order with a limit price a bit over the bid and wait for it to be filled, might take a few minutes.", "score": 6, "replies": [{"body": "Man thank you so much for the detailed reply! I highly appreciate this and will use it as reference until expiry. \n\nI actually want the call to be exercised and will wait it out until after all the news is gone and see what to do next. If tsla closed very close to $480. I’ll buy back the contract and sell another 30 day covered call for income and cost average down. \n\nWhat do you think?", "score": 1, "replies": []}, {"body": "Not sure where you got 53.5k in cash from - if he sold an option for $55 premium it's 100 *$55 = $5500 in premium he collected.  If tesla goes to $535/share and he paid 440 for each share as in his scenario, he only has the $5500 in premium and $4000 in share appreciation. \n\nI say $4000 because when tesla goes beyond $480 a share - HE WILL GET ASSIGNED and lose the shares so he will not benefit from a runup to $535/share.", "score": 1, "replies": [{"body": "He has 100 shares today, and a short call contract with a $480 strike.\n\nIf his option contract gets exercised, he'll get $48,000 from the buyer, in addition to the $5,500 premium.\n\n$48k + $5.5k = $53.5k cash position, $9.5k will be profits given his $440 entry price (+17% returns).", "score": 2, "replies": []}]}]}, {"body": "Extrinsic value is most certainly not IV. IV is a part of the extrinsic value, but it is only one of the Greeks that make up that value. And where do you get the the time value of 55. Time value isn’t represented by a number like that. You might want to read up on options and learn more about them.", "score": 2, "replies": [{"body": "Since TSLA is trading well below $480, **all** of the option contract's current value is extrinsic value ($55) - zero intrinsic value.\n\nNote that the option greeks only apply if the option contract's value was set according to Black-Scholes or one of its modern variants - which it might not be. JFYI, about $20 of the $55 premium is outside the Black-Scholes pricing formula and is not covered by any greeks in the standard model.\n\nIn the most general sense **all** of extrinsic value is \"time value\". Sometimes \"theta\" is called \"time value\", but it's a sloppy nomenclature many (including me) don't subscribe to.\n\n> Extrinsic value is most certainly not IV. \n\nI don't think the OP claimed that. I read his comment as saying that IV is 120% and time value is $55. Which is correct.", "score": 1, "replies": [{"body": "You’re right. It was late and I didn’t read super carefully. There have just been so many noobs and wsb guys in here recently and so many trying to get into options without knowing anything about them. \n\nI was not aware that so much of the premium was priced outside black-scholes. Is that true for all/most modern options, or is the extreme options market around Tesla the reason for that?", "score": 2, "replies": [{"body": "It’s okay I forgive you lol I’m aware extrinsic value is not IV. I simply wrote the IV of 120% for info purposes. \n\n_TSLA_ did an excellent job clearing things up, no need for me to repeat. \n\nAlso, I was lucky enough to have the call purchased at the higher end of the daily range of $57.50.", "score": 1, "replies": []}]}, {"body": "Thanks for clearing that up sir/madam. \n\nI was lucky to have sold the option on the higher range of the day at $57.50.", "score": 1, "replies": []}]}]}]}]}, {"body": "That doesn't happen. You will have it all the way to end unless you decide to buy that covered call back.", "score": 2, "replies": [{"body": "Well, I feel leading up to earnings the stock will be in this territory we are now and with theta decay the cost of this covered call would be a lot less. I could roll it and collect another premium to to decrease cost or close it out and my shares for profit close to $480. \n\nGiven you’re a Tesla bull, how likely do you feel the stock to go back to the $320 like it did last week?", "score": 1, "replies": [{"body": "Not likely but not impossible. I feel like the current stock price has already priced in Tesla kicking ass short term. So if battery day is a dud, if the delivery numbers are 130k or below, if the macro environment keeps going down. I think those would be the things that could possibly crash the stock down that far.", "score": 3, "replies": [{"body": "Thanks for the informative input! I really appreciate it.", "score": 3, "replies": []}, {"body": "I’ll be very surprised if battery day is a dud. That said, I’m been very surprised a lot lately.", "score": 2, "replies": []}, {"body": "quite impossible for battery day to be a dud", "score": 2, "replies": [{"body": "It really isn't. People are expecting so much that Tesla can come out and reveal some amazing stuff and people can still be unimpressed.", "score": 2, "replies": [{"body": "Papa Musk knows how to impress people, trust the process", "score": 3, "replies": [{"body": "Just don’t let him demonstrate the “bulletproof” battery case.", "score": 2, "replies": []}]}, {"body": "I think peoples expectations are generally in line with what we will see. A million mile battery, more energy density, cheaper and faster to produce.  Maybe some car to grid stuff.  I think maybe we get a pop off the hype, but it could fade.", "score": 1, "replies": []}]}]}]}]}, {"body": "That's absolutely not true - American style options can be called away at any time before expiration.  I've had this happen before with Tesla calls i've sold.", "score": 1, "replies": []}]}]}]}, {"body": "Given that there is ample time left to potentially have a wild swing in price direction ( either way) i might suggest if you’re worried about the money issue, and would like to free yourself from the call. I would recommend closing out the call position. Buy back the covered calls (at a gain or loss) and retain your stock.\nTo allow you to exit out the position and sell your shares.", "score": 16, "replies": [{"body": "Yes, I understand your point. I sold the covered call to decrease the margin. I figured with battery day on 9/22 and earnings 10/22, the stock would go a lot higher than $480 and I’d have the benefit of selling it at $480 and get the premium to invest if the stock has a correction in the future. \n\nI’m just curious how likely is for this to be exercised prior to expiry.", "score": 4, "replies": [{"body": "Everyone here sure hopes that we ll be above 480 asap.", "score": 8, "replies": []}, {"body": "Your biggest risk is not tsla going up. It's tsla going down temporarily. \n\nSince you bought on margin. if the value of the shares drop, you could get margin called. You should look into how your broker does that. Because some will give you a few days to deposit more money (you don't have), and others will sell your position. \n\nEither way, your money is now gone. But you have a (now uncovered) call out. If that expires ITM, you will lose another bunch of money. You can get into serious debt. \n\nYou might want to sign your kid up to r/wallstreetbets", "score": 4, "replies": [{"body": "I have a covered call. So I’m hoping it gets called. I’ll protect the downside with an OTM put of $395 if Tesla catapults on Monday.", "score": 1, "replies": []}]}, {"body": "In general the likelihood being assigned before expiry is very low regardless the price goes down or up.", "score": 3, "replies": [{"body": "Yeah, makes sense with the volatility.", "score": 2, "replies": []}]}]}]}, {"body": "Maybe just find a way to hold the shares. Could be the greatest mistake you ever made!", "score": 6, "replies": [{"body": "That’s how I felt after the trickle of sweat subsided from my temples and I took a few deep breathes. \n\nI was relieved to shake off good but not as good as Tesla stocks after the accidental purchase. \n\nBut I’m still curious to know how likely it is to get called away before expiry. I feel a correction can take place and I can use the premium I received to purchase shares IF it goes sub $400.", "score": 1, "replies": [{"body": "Tbh, I think your son is making sure he's doing his part in covering future expenses. With an entrepreneurial spirit like that, I'd trust the little guy.", "score": 3, "replies": [{"body": "I trust him! Thanks man lol", "score": 1, "replies": []}]}]}]}, {"body": "I heard a story a few years ago where oil took an unexpected dip and nobody could figure out why someone would put so much selling pressure at that time.\n\nTurns out a drunk billionaire got a little too out of it and accidentally sold a few billion dollars worth.\n\nSo on the bright side it could have been worse. It'll make a good story when your son comes of age. 🤣", "score": 4, "replies": [{"body": "Haha great story! This will definitely be a great story to tell him. He is usually next to me when we watch CNBC.  I talk to him and tell him why I am making a certain trade or buying a stock for long term which helps me rationalize my decisions even more!", "score": 1, "replies": [{"body": "No wonder he submitted an order for 100 shares... he knows TSLA only goes up from here", "score": 6, "replies": [{"body": "He probably thought “Ummm dad, you forgot a 0. *There*” lol", "score": 1, "replies": [{"body": "Give the kid a trade desk he knows what he's doing", "score": 5, "replies": [{"body": "Yes on it!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "As much as I enjoy holding Tesla shares, I believe the shares will face a lot of pressure leading up to battery day. \n\nAs for your question, I’d personally close out the option you wrote, and simply sell the shares to mitigate any further risk. Investing with money you can’t afford to lose can be very stressful.", "score": 5, "replies": [{"body": "You’re the first to mention pressure on Tesla leading up toe battery day...what are your thoughts? \n\nMonday would be the pressure day. If this is the case and Tesla sees a major decline Monday then closing the call could very well be an option.", "score": 2, "replies": [{"body": "Watch this [Tesla Daily](https://m.youtube.com/watch?v=eWsflZ2Gzdw) and you will see what I mean by expectation. Rob sums it up well, but I’m mostly referring to the surveys reflecting the sentiment. The bar is set real high for Tesla.\n\nAnyways, back to your question, I think what Elon said in the earnings call is the reason why I invest in Tesla. [Link](https://www.reddit.com/r/teslainvestorsclub/comments/iucine/teslas_new_battery_cell_credit_suisse_outlines_1t/g5lesd1/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3)", "score": 3, "replies": []}]}]}, {"body": "\"'I swear, the baby bought the stocks' said the op to his wife, sweating profusely.\"", "score": 5, "replies": [{"body": "Lol! I’m not making this up. He loves to mash the keyboard. The default on purchasing equity on TDA is 100...one click up equals 100 shares. I must have clicked the up arrow once and thought it was just one share.", "score": 2, "replies": [{"body": "\"'Lol! I’m not making this up.' he said, doubling down on his position, just like with the stock he recently purchased...\".\n\n&nbsp;\n\n\njust kidding, typing these fake book excerpts is fun - hope you get things figured out and get into a nice non-stressful place.", "score": 1, "replies": []}]}]}, {"body": "I think you’re good", "score": 3, "replies": [{"body": "Thank you.", "score": 1, "replies": []}]}, {"body": "Keep the shares and thank your son in 10 years.", "score": 3, "replies": [{"body": "I’ve already recorded a video for him and sent it to his email. lol", "score": 1, "replies": []}]}, {"body": "On the plus size, if you win big your son will be the new god of WSB", "score": 3, "replies": [{"body": "Lol I’d rather keep him away from WSB.", "score": 1, "replies": []}]}, {"body": "Can’t you call your broker and tell them it was a mistake?", "score": 2, "replies": [{"body": "I attempted to reverse the order but didn’t work. But we’re beyond that now as I’ve sold the covered call and would be happy if it is exercised.", "score": 1, "replies": []}, {"body": "This was a self-directed trade so the broker will not be able to help.", "score": 1, "replies": []}]}, {"body": "All depends on the person holding your call option. Maybe they exercise right away, maybe when it hits their magic price, maybe they get drunk miss their chance and it tanks, or it get exercised at the day of expiry automatically if it’s within the price range. 🤷🏼‍♂️ but for the reasons you stated up to you, whether you’re comfortable with rolling the dice for a various number of outcomes. Either way you’ll make a profit if it hits that point. So up to you to decide", "score": 2, "replies": [{"body": "Thanks for the reply! You’re right the market is a dice roll and it helps to know people take the time to reply and give their honest input. I feel it will be over $480 since the magic number is $500.", "score": 1, "replies": [{"body": "Long term I do see Tesla at higher prices and a long term future gainer. Considering advancement in batteries( faster charge/ longer charge miles/ smaller batteries reducing cost- increasing profit margin etc) as well as the future potential of them rolling into being an energy supplier and the market potential of their batteries supplying said grid/ power plants etc (think trillions dollar market potential)", "score": 1, "replies": [{"body": "How long is your long term? How do you feel about the market volatility and the chances of us testing the $320 levels we went down to last week?", "score": 1, "replies": [{"body": "I think in chess moves in my life in general lol ( think like 6 month plans / year / 5 year / 10 year type ) lets me break down goals/ objectives and work on the necessary steps to accomplish them. It’s gotten me quite far in my life vs peers, so no complaints:)\n\nWhen it comes to Tesla for myself I do currently believe in their long term potential based off what I see. ( but it’s important to consistently do research and homework on what you own. To ensure it continues to fit what your goals are. Over the long term i see share prices higher. I do see the the market continuing to be a bit rocky over the next few weeks. ( mostly due to peoples uncertainty with upcoming elections/  continued covid shutdowns/ economic numbers rolling out( oct when the cares act expire with no replacement stimulus should be interesting) there is the potential to touch those lows, but I don’t believe well touch close to that low again. Unless some dramatic news comes out", "score": 2, "replies": [{"body": "I agree with your chess move state of mind. \n\nI asked what your long term is because in this market long term seems to be a month with the violent moves the market has been making recently.", "score": 1, "replies": [{"body": "Ive been playing with Tesla since its ipo and bit coin when it was double digits lol so we can safely say my long term is a bit more then a month 🙃", "score": 2, "replies": [{"body": "Sure it! Keep up the great work and I appreciate your kind works and input!", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "From what I'm seeing late Friday night your $480 strike 10/23 calls have a *Delta* right around *.50* which means that there's roughly a 50% chance of being ITM before expiring. The bid is currently 51.00 and ask is 60.50 so there's a grand of spread in your call if you need to get out of it.  \n\nOn the other hand, if you collected around $5,000 in premiums that's covered a tenth of your kid's purchase. ***If*** (and this is a big if) you can do that nine more times you'll have your kid's shares paid for. If your shares get called away you get $48000 + all of the premiums until then. I don't know what your margin costs or living expenses are (but with a 9mo old I can make some guesses). Will that $5000 premium last you and your family until 10/23 if your call expires OTM?\n\nTLDR: About 50%.", "score": 2, "replies": [{"body": "I love the “your kid’s shares” statement. Lol \n\nYes, I sold the Oct 23rd expiry because we are okay until then with the  income from my new position. \n\nI do hope my shares get called away. And if they don’t then my cost basis will be decreased from $440 to $390 because of the premium. I could close out the position anywhere between $390 and $440 without a loss. If it for some reason increases a lot higher then I can sell another 30 day covered call and use that as income and continue to decrease cost...\n\nHow does that sound?", "score": 2, "replies": [{"body": "Clearly, you're golden if your call is exercised. You're good above $390 because of your premium.  \n\nWith shares purchased with margin you need to be able to deal with the bear side of the equation too (as unpopular as that is around here...). Are you getting margin called (or worse) at $375? 200? Could a Put that's way OTM right now protect you for a reasonable premium? With or without a put, will you be able to sleep with this much margin until 10/23? If yes, then I think you're in a pretty good position. Different people deal with risk differently.", "score": 2, "replies": [{"body": "Yes, I’m glad I’ve got the same idea. I’m, along with most others, anticipate a catapult move to the upside Monday and will be purchasing a $395 put 10/23 after selling some other positions.", "score": 2, "replies": []}]}]}]}, {"body": "I suggest you wait until after battery day if you want to close your call. IV will then contract for sure, which will lower your cost to close the call, and there may also be some pull back if battery day doesn’t impress. Friday’s tens be downish days, so maybe think about closing out on 9/25.", "score": 2, "replies": []}, {"body": "I don't really weel understand what covered calls are so TAKE ALL OF THIS WITH A GIANT GRAIN of salt.\n\n&#x200B;\n\n But as of my understanding you want the stock to be below 480$. After Battery day Tesla is likely to trade at 500$ with maybe a peak at 550. Now it will probably come down a bit to 470 a few days after but probably will come up after deliveries are announced as analyst often understimate them. Now I think they learned from the mistakes and error margin is probably be less consequent, like 5 or 10%. 10$ peak from deliveries is realistic for me. Now it will probably stabilise at 460 somethiing like that. \n\n&#x200B;\n\nNow what about earnings ? First we don't know if earnings is happening the 22th or the 29th. You should look historically what is has been. What could cataplut the stock is a) S&P inclusion exceptation rising, b) a very good quarter with less reg credit. The two are linked as for S&P inclusion excepation rising, Tesla should at least be profitable w/o reg credit this quarter. A good quarter will still make the stock a bit higher  \n\n\nhoverall, I think that TSLA is probably going to trade at 480$. But that's w/o macro. Tesla is a stock that generally amplify macro, so this is the big unkown.", "score": 2, "replies": [{"body": "A covered call is selling an option contract to collect a premium. If Tesla is above $480 at close on 10/23 then my shares will be purchased for $480 regardless of what the spot price is. I want this happen. \n\nI agree with your statement and the macro.", "score": 1, "replies": []}]}, {"body": "What is your carrying cost of the shares? If it's not to high, say 5%, you can keep the 100 shares, sell monthly covered calls well OTM of your average and then pocket the difference. If you get called on the shares, well no big deal, you pocket the profit. If you don't, you keep the call option premiums.", "score": 2, "replies": [{"body": "My cost is $439 so I am okay on that side.", "score": 1, "replies": []}]}, {"body": "Keep selling covered calls.  Eventually they will be called away but at a profit.  Unless there shares tank then you may need to cover the margin calls.  That's The gamble.", "score": 2, "replies": [{"body": "Yeah it’s a gamble but luckily I have others shares to help cover if that happens.", "score": 1, "replies": []}]}]}
{"title": "TSLA 9/25 Call Holders. How are you playing battery day?", "selftext": "Are you planning for a run up on Monday and early exit? Or are you going to diamond hands through the event hoping that Elon will announce that TSLA has discovered groundbreaking battery technology that will finally power the massive vibrator that you’ve been desperately waiting to use? \n\nPositions: TSLA 420 call 9/25 exp.", "id": "ivzxbj", "created_utc": 1600546513.0, "score": 56, "upvote_ratio": 0.9, "num_comments": 90, "comments": [{"body": "Holding until earnings because I’m not poor like you fucks and can afford greater than 5 day calls", "score": 86, "replies": [{"body": "Hey man, these 5 day to expiry calls are fucking expensive! At least mine was. 420 call and my breakeven is at like $465. Insane.", "score": 18, "replies": [{"body": "You must bought far ITM?", "score": 7, "replies": [{"body": "Oh yeah. It was trading at like $436 when I bought the $420 calls. Total coincidence that I bought the $420 strike btw...", "score": 6, "replies": [{"body": "I think you will get your profit for sure", "score": 3, "replies": [{"body": "There's a possibility that you will definitely profit.", "score": 4, "replies": [{"body": "100% possible.", "score": 5, "replies": []}]}]}, {"body": "Theres huge volume on 420 calls compared to everything around it", "score": 2, "replies": []}]}]}]}, {"body": "Are you baller enough to get 10 year calls?", "score": 5, "replies": []}, {"body": "Lmao", "score": 1, "replies": []}]}, {"body": "Tsla hitting $550 this week boys, HOLD!!!", "score": 14, "replies": [{"body": "If it doesn't hit $550 or close to it, I'm gonna be mad at you", "score": 9, "replies": [{"body": "Heard it here first", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 33, "replies": [{"body": "Get IV crushed after Monday close lmao", "score": 0, "replies": []}]}, {"body": "Im holding a small amount of 20k TSLA calls into Wednesday. I expect 100,000% returns.", "score": 10, "replies": [{"body": "God speed fellow autist.", "score": 5, "replies": []}, {"body": "i’m expecting good loss porn from you", "score": 1, "replies": []}]}, {"body": "I am in Silicon Valley and work for a company that \"knows things\" - lets leave it at that. Anyway, I have an insider who has been spot on with all his predictions. He would kill me if he knew I was posting this, but, well, just for you retards....\n\nThe rumor is that Elon is going to announce that he is actually an alien from another world. He is also going to announce that all of our \"human\" physics models are wrong and that there really is no energy density limit to a new patented super material only Elon and his alien buddies know how to make.\n\nTesla to the moon (and beyond - about 1000 parsecs from here where Elon comes from).\n\nGood luck all!\n\n/s", "score": 83, "replies": [{"body": "The real insiders know that Elon is a time traveler from future.  On battery day, he will illegally introduce future techs.   That will trigger TimeCop Corp to send JCVD to catch and bring EM back to the future.  TimeCop has no jurisdiction on Mars, that's why Elon wants to get to a Mars so badly.", "score": 10, "replies": [{"body": "Okay put on Tesla then", "score": 1, "replies": []}]}, {"body": "Truly retarded.", "score": 15, "replies": [{"body": "Well, if it wasn't obvious, this is clearly bullshit.", "score": -3, "replies": [{"body": "Idk man, Elon admitting he truly is an alien is something I can see happening", "score": 4, "replies": []}, {"body": "Oh I know. Doesn’t negate the fact that it’s retarded ;)", "score": 3, "replies": [{"body": "Agreed. Thanks!", "score": 0, "replies": []}]}]}]}, {"body": "TSLA 1000c 10/02 - confirmed.", "score": 10, "replies": []}, {"body": "So calls then?", "score": 3, "replies": []}, {"body": "As someone who was once part of Tesla's upper circle, I can confirm.", "score": 3, "replies": [{"body": "Proof or ban.", "score": 2, "replies": [{"body": "\\[redacted\\]", "score": 1, "replies": []}]}]}]}, {"body": "Probably sell on run up on Monday. Market makers will try and fuck us", "score": 15, "replies": [{"body": "Same, monday is gonna be green as fuck with everyone trying to get in, this shit is gonna take a massive dive on tuesday 100% since most people wanna sell before close, probably buy it back after the dip", "score": 13, "replies": [{"body": "Just be ready to buy back in at the dip. Earnings coming up in 4 weeks.", "score": 12, "replies": []}, {"body": "Yeah....but I hope you're wrong and it just keeps on climbing", "score": 7, "replies": [{"body": "My shares would be ok with that", "score": 5, "replies": []}]}, {"body": "I might even sell my shares, lock in profit and rebuy.", "score": 4, "replies": []}, {"body": "Mark my words. Monday will not be green. Tuesday will not be green. Neither will the earnings call. \n\nThis post and this whole sub is nothing but posts about  \"when is the right time to sell the battery day hype?\" So with everyone trying to get out over the next 2 days, how do you think that will affect the price?\n\nAnd earnings? How many cars do you think the company sold? You can't hype your way through earnings. Either you sold more cars than expected, or you didn't.", "score": -1, "replies": [{"body": "Possible, but short squeezes due to hype, pulse the chance that it may, increased demand in China, hype. It may crash after but I think people and institutions are and will be trying to get in. Implied move of 52+\\- points on Monday", "score": 3, "replies": []}, {"body": "Implied move is +- 52 Monday so I imagine the PJ traders take this from 449 to at least 475. Fighting through the sell wall.  Maybe open at 460 or higher and continue up. Not sure if they get a regularly scheduled dip due to battery day. But I imagine that it hits a bunch of regular folks who don’t trade premarket sell orders and fight that sell wall, then continues up.\n\nCould be completely off", "score": 2, "replies": []}, {"body": "Its gonna dip man, you gotta lock the profit when you can, this stock has been growing because of all the hype im not expecting much from earnings but if it dips at earnings again ill just hold and buy more", "score": 1, "replies": [{"body": "Yea, I think you literally are saying exactly what I said.", "score": 1, "replies": []}]}]}]}, {"body": "Market makers don’t have that much influence over Tesla. They’re actually just doing their job of providing liquidity on a ticker like Tesla.", "score": 1, "replies": []}]}, {"body": "Watch out for IV crush", "score": 14, "replies": [{"body": "Yessir. That’s what I’m afraid of. That and a sell off due to the insanely high expectations.", "score": 4, "replies": [{"body": "If there's a run-up Monday sell half your calls. Then Tues you either make even more tendies or get IV crushed and still have tendies from Monday to comfort you", "score": 3, "replies": [{"body": "It’s after market on T. Crush if any would happen on W", "score": 9, "replies": []}, {"body": "I’ve only got one call :(. It’s worth $5,000 right now tho.", "score": 3, "replies": []}]}]}]}, {"body": "Run up only and then using some of that profit to hold through. Otherwise it’s a sell on news unless Musk delivers", "score": 7, "replies": []}, {"body": "Hold till Wednesday", "score": 7, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "I’d sell the one closest to expiration. You’ve got plenty of time for that 6/18 to print 1,000 times over.", "score": 9, "replies": [{"body": "Plus the number of times he can sell calls against that one means some serious $$$ to average it down.", "score": 1, "replies": []}]}]}, {"body": "Why is everyone saying they’re gonna sell Monday or Tuesday before close? Battery day is after hours on Tuesday, so it seems best to sell Wednesday at open.", "score": 11, "replies": [{"body": "I think a lot of us are nervous about IV crush after the event and a sell off due to insanely high expectations and the event not living up to them.", "score": 23, "replies": [{"body": "Gotcha. I’m holding shares so I’m selling Wednesday but that makes sense for calls.", "score": 8, "replies": []}, {"body": "Yeah I like tsla but ima sell my calls Tuesday and buy a put wed morning", "score": 2, "replies": []}]}, {"body": "because those that have the ability to work after hours can lower things before you have a chance.   \nEither lock in your gains, or lose it.  \nIf Tuesday night performs well and it shoots up, then that's a missed opp. But it's not lost gains.   \nI'd say Tuesday morning before 10:30-11AM EST is safe. Anything else and it's personal.", "score": 10, "replies": [{"body": "I’m nervous of Elon saying it’s time I step away from Tesla and let someone else run the business while I attend to flamethrowers and spaceX.", "score": 7, "replies": [{"body": "It most definitely is not", "score": 2, "replies": []}]}]}]}, {"body": "My plan is to make money", "score": 3, "replies": []}, {"body": "The IV crush last earnings blistered my asshole thus I’m selling Tuesday at close. 9/25 $500c.", "score": 5, "replies": []}, {"body": "Tsla 450 10/2 call here and I’m probs gonna just sell monday(hopefully I don’t get greedy).", "score": 3, "replies": [{"body": "Why not Tuesday, event is after market close", "score": 3, "replies": [{"body": "Maybe but market makers are always trying to fuck us dude", "score": 6, "replies": []}]}, {"body": "I’m debating the same thing. I might be wrong, but I’m somewhat viewing this as a mini ER play. Don’t want to get fucked by IV.", "score": 2, "replies": [{"body": "there’s no way it doesn’t go up 5% on monday. leaving money on the table is a better problem to have than losing it all", "score": 2, "replies": []}, {"body": "Same here not sure when to sell", "score": 1, "replies": []}]}]}, {"body": "Holding a 9/25 $445 and not sure if I should sell Monday or wait it out until Tuesday before close", "score": 2, "replies": [{"body": "If it spikes, you should 100% sell and lock profit", "score": 2, "replies": []}]}, {"body": "sell early and pre order vibrator so my wifes boyfriend can use it when hes too tired", "score": 2, "replies": []}, {"body": "I'm thinking liquidate Tuesday and get some long strangles.", "score": 2, "replies": []}, {"body": "Honestly sell mon/tues and take some profit to buy a crazy yolo before event. Or better yet take a risk and sell call even to your purchase price maybe you don't profit but at the very worst you lose 0. At the best you get a free Tesla call debit spread that prints.", "score": 2, "replies": []}, {"body": "Ive got one Im planning to sell Monday Open/Near close. The other one I will sell Tuesday Open vs. Close or hold Thru BDay", "score": 2, "replies": []}, {"body": "I’ll prob sell on Mon or Tues and lock in any gains. Maybe keep one call open or hold shares just in case he reveals he is made of adamantium.", "score": 1, "replies": []}, {"body": "VALE call here. 10/16 $15. Will probably sell Tuesday around 11am. Then buy way otm puts around 3, on VALE and LAC. I already sold my LAC calls late this week to lock in some profits.", "score": 1, "replies": [{"body": "Those are priced at 5 cents.. what are you expecting this week", "score": 2, "replies": [{"body": "This is essentially my plan as well. I sold 1/3 of my lac Friday to cover initial costs. My $15 calls were already over 800% so I can’t really lose any initial cost at this point. Selling the next 1/3 Tuesday and holding the last 1/3 in case it actually does rocket. \n\nI got in on Vale right before the pump and dump and sold half for 100%. Since it’s so cheap I’m just holding the other half if it actually hits. I honestly don’t expect anything to happen with vale as it looks like a wsb big money scam but I’ll take the game since I’ve already cashed out my initial cost.", "score": 3, "replies": []}]}]}, {"body": "Jan 2021 460 calls. 5 of em. They gonna print? Thinking of holding until after earnings in October", "score": 1, "replies": []}, {"body": "Autistic play", "score": 1, "replies": []}, {"body": "They're getting gaped", "score": 1, "replies": []}, {"body": "Got 4x525c for 2 months out, will sell 3 and let 1 ride.", "score": 1, "replies": []}, {"body": "YOLO MY WHOLE LIFE SAVINGS INTO $VALE calls", "score": 1, "replies": []}, {"body": "Position Stats: TSLA 420C 09-25-2020 - All time performance: -42.65% [Price history chart](https://tendiechart.com/pricehistory.cfm?symbol=TSLA&date=1600992000&s=420&t=C)", "score": 1, "replies": []}, {"body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**TSLA**|**$420**|**BUY CALL**|**2020-09-25**|**$49.95**|**$442.15**|**4012**|**2584**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckfa48o7t9zd30792sukepp8o) | [Track Record](https://www.pickmojo.com/user/jiggapimp223/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*Recorded after market close, will be recorded at the next market open if the premium is within 10% margin. My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "score": 1, "replies": []}, {"body": "Wtf is battery day? Calls on oil.", "score": -6, "replies": [{"body": "Does your vibrator run on oil?", "score": 11, "replies": []}, {"body": "Wtf is a call?", "score": 1, "replies": [{"body": "Wtf is oil?", "score": 4, "replies": []}]}, {"body": "Wtf is Elon?", "score": 1, "replies": []}]}]}
