{"title": "Buffett sells 100,000 bank shares and increases stake in gold and Coca-Cola", "selftext": " \n\nThe former largest holder of the American bank Wells Fargo & Co, Berkshire Hathaway Inc of mega-investor Warren Buffett, continues to withdraw money from bank shares.\n\nBerkshire Hathaway has sold more than 100 million shares, the equivalent of $ 2.5 billion or more than $ 10 billion since June, according to a report published on Friday. As a result, Warren Buffett's company now owns only 3.3% of Wells Fargo's shares.\n\nThe North American bank reported a big loss in the second quarter of this year, with a negative US $ 2.4 billion. Credit losses and provisions were the causes, but the bank is also involved in scandals.\n\nFrom 2002 to 2016, employees used fraud to meet impossible sales targets. They opened millions of accounts in customer names without their knowledge, hired involuntary account holders for credit cards and bill payment programs, created fake personal identification numbers, forged signatures and even secretly transferred customers' money.\n\n## [Short the banks?](https://read.cash/@SamHamou/buffett-sells-100000-bank-shares-and-increases-stake-in-gold-and-coca-cola-a95715de#short-the-banks)\n\nBut it seems that it’s not just financial problems or customer treatment that Warren is withdrawing from his favorite bank.\n\nThe investor reduced its stake in Goldman Sachs, JPMorgan, PNC, M&T Bank, Mastercard and Visa. While he bought a slice of Canadian mining company Barrick Gold, despite historic criticism of the precious metal.\n\nHowever, Warren has increased his positions in Apple, Coca-Cola and Bank of America. It is speculated that Warren is predicting that the effects of Covid19 will last longer than Wall Street imagined.\n\n>“Accumulating money and finding gold mining attractive – suggests that he sees the crisis last longer and perhaps worsen before it gets better. No one knows whether this will be the case, but Buffett has his finger on the pulse of the economy through all the various sectors in which Berkshire operates: from freight railways to aircraft parts, insurance policies to car dealerships, building bricks from households and Fruit of the Loom underwear, Dairy Queen industrial chemicals for fast food, jewelery for private jets and more. ”  \nsays Tara Lachapelle, Bloomberg columnist\n\nBuying more gold-related assets makes a lot of sense in times of crisis, but what is the reason for increasing participation in Coca-Cola? \n\n&#x200B;\n\n[https://read.cash/@SamHamou/buffett-sells-100000-bank-shares-and-increases-stake-in-gold-and-coca-cola-a95715de](https://read.cash/@SamHamou/buffett-sells-100000-bank-shares-and-increases-stake-in-gold-and-coca-cola-a95715de)", "id": "irayy6", "created_utc": 1599910299.0, "score": 155, "upvote_ratio": 0.97, "num_comments": 111, "comments": [{"body": "coca-cola: higher sales and growth of bottlet water sales in china maybe", "score": 55, "replies": [{"body": "Dividends?", "score": 20, "replies": [{"body": "buffet is a longtime KO holder, so he‘s in for dividents already, but the increase on his position could be due to new insights for growth markets as mentioned above", "score": 23, "replies": [{"body": "Got it. Thanks. 👍", "score": 3, "replies": []}, {"body": "Just read a piece on KO. Covid didn't even slow their growth. Yeah they took a big drop at the beginning but even without running at 100% they've almost completely recovered. \n\nWe've missed huge sale opportunities for KO with all the sporting events paired down, yet they continue. NFL now trying to be wild and run the whole season, if they succeed KO profits massively, if not we may see a small decrease. \n\nThe more that opens up the more Coke needs to flow. Americans need their coke, it's an addiction.", "score": 4, "replies": []}, {"body": "Topo Chico hard seltzer.\n\nCoca colas first alcoholic product in 40 years. \n\nPenetrate Latam, EU and APAC before Truly and White Claw do. \n\nBoston Beer and White Claw can’t touch Coca Cola’s international distribution capabilities.", "score": 2, "replies": []}]}]}, {"body": "If Buffett likes KO again, KDP and PEP are worth looking into as well", "score": 7, "replies": []}]}, {"body": "Buffet is betting on the fact that people will continue to consume liquids in the future. It’s a bold bet but I think he has earned the benefit of the doubt.", "score": 59, "replies": [{"body": "You joke like it's obvious - but don't coke make a ton of their money from selling to restaurants? That's probably taking a hit right now.", "score": 10, "replies": [{"body": "COVID has decimated the restaurant industry and it’s going to take years for it to recover, but people are still going to order coke at drive thrus and take out venues. KO is so well diversified that they’ll be fine in the long run. Coke runs through our blood as Americans.", "score": 8, "replies": []}, {"body": "That and sporting events are reason why I held off on investing in KO. I think its gonna go down when people realise it", "score": 1, "replies": []}]}]}, {"body": "Have you never played fallout? Buying coca-cola for the caps which will be the main currency in the future. Watch for investments in power armor to confirm Apocalypse", "score": 16, "replies": []}, {"body": "[deleted]", "score": 47, "replies": [{"body": "I'm a bit confused on Buffett's decision to sell MA and V. Financially the next few months will be shaky, but there are strong long-term tailwinds for fintech as we transition to a society that uses less and less paper cash.", "score": 15, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "PE ratios should be the inverse of long term (say 10yr) average GDP growth.  The modern assumption has been 4-5%.  2% inflation and 2-3% real growth.  That gives you about 20x PE.  That’s where we’d been and peaked at 25x.  Treasury rates are at historic lows and the fed said inflation isn’t picking up.  The GDP growth is 2-3% at best now.  That’s 33-50x PE for the market. Fed ain’t raising rates for 5+ years.  Stop looking in the rear view mirror and look at what’s coming.", "score": 5, "replies": [{"body": "thank you. higher inflation - higher PE", "score": 1, "replies": [{"body": "No. Lower inflation seen and expected = fed flooding market with liquidity to ignite inflation but technological advances are creating deflationary pressure so fed has no intention to stop.  And if their efforts to give liquidity only just keep us out of deflation don’t work they won’t stop.  If we have stagflation they’re even more ducked because they have their dual mandate moving in opposite direction and I highly doubt they raise rates.  So either way liquidity is here to stay and it will inflate asset prices if nothing else.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "The reason is it's a consumer staple which tend to do okay in recessions. At least compared to other sectors.\n\nHistorically KO is a good stock to own. Not a massive performer but neither parabolic decrease...", "score": 19, "replies": [{"body": "Has nothing to do with the upcoming hyper inflation? optimistic.", "score": -6, "replies": [{"body": "There isn't going to be hyper-inflation lol.", "score": 18, "replies": [{"body": "Said every country that has ever gone through hyperinflation. I'm not saying it will happen, but I won't say it can't either. Our Govt is shit at making sound fiscal decisions. The debt crisis is real and the toll will have to be paid eventually. We're backing ourselves into a corner, the question is how long can we keep backing up till we hit a wall.", "score": 1, "replies": []}]}, {"body": "hyper inflation doesnt happen when rich people make more money.", "score": 1, "replies": []}]}]}, {"body": "Not surprised, no interest rate rises till 2024 from the fed, so the banks are dead money till then. What I am surprised with is Buffett's lack of exposure to tech (other than Apple). It would have made sense to increase his position in Amazon or find a cloud play like Microsoft.", "score": 39, "replies": [{"body": "Didn't BH just buy a bunch of snowflake pre ipo?", "score": 26, "replies": [{"body": "People are theorizing that BH actually uses Snowflake. Maybe they're not actually invested in them for the reasons we thought they were", "score": 3, "replies": []}, {"body": "I was listening to somebody today who clarified that Berkshire Hathaway does not equate to Warren Buffett they can make decisions independent of each other.\n\nthey seem to indicate that Berkshire Hathaway made the snowflake decision and that Warren Buffett wasn't really involved.", "score": 4, "replies": []}, {"body": "570 million isn't huge for them, about 0,25% of their portfolio", "score": 2, "replies": []}]}, {"body": "He has said he’d never own Microsoft because of his close friendship to Bill Gates", "score": 18, "replies": []}, {"body": "He has said numerous times that he simply doesn't understand computers. He has sent 1 email in his entire life. A lot of his investments come from close research of a company and understanding its products, services and financials. He finally broke this \"no tech\" rule when he purchased Apple (was it last year?)", "score": 9, "replies": [{"body": "buffet first invested in Apple in 2016", "score": 5, "replies": []}, {"body": "He must have gotten an iPhone recently", "score": 1, "replies": [{"body": "He did actually in February", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": []}, {"body": "Why is it surprising? He said he invests in what he understands and doesn’t get tech.  His HUGE downfall as an investor is the world is tech dominated now and going forward.  He will be behind the curve and miss out on performance", "score": 3, "replies": []}, {"body": "He doesn’t consider Apple tech (which is an unusual but defensible position).", "score": 1, "replies": []}, {"body": "I am surprised. Apple has had a ridiculous run up to the point where I assumed buffet wouldn't like the price. Coke he hasn't added any to his position since 1994, so I assumed he was partially holding it for capital gains reasons and didn't really love their growth potential.", "score": 1, "replies": []}, {"body": "Perhaps stupid question, but if banks keep their dividend owning their stock for a few years is basically a savings account", "score": 1, "replies": [{"body": "Nah man, shares are never safe as a savings account, they can tank 50% if they want to.", "score": 9, "replies": [{"body": "This. If you want your money safe, put it into options or something.", "score": 4, "replies": [{"body": "Lol", "score": 8, "replies": []}]}]}, {"body": "Wells Fargo is precisely why this is bad advice. Share price is halved, and they cut the dividend yield from 7% to 1%. \n\nA savings accounts is a savings account.", "score": 4, "replies": []}]}, {"body": "this is why ppl are retarded here. Why would he buy into techs right now when they are going thru correction? They are overvalued right now.", "score": -1, "replies": []}, {"body": "[deleted]", "score": -33, "replies": [{"body": "Just to clarify if you invested the $100k in Coca-Cola in 1998 you would have $389,266.62 according to their investment calculator", "score": 20, "replies": [{"body": "[deleted]", "score": -28, "replies": [{"body": "They did a 2-1 split in 2012, and 22 years of DRIPping would more than double your money", "score": 25, "replies": []}]}]}, {"body": "Don't know where you are getting your KO numbers from but they're false.\n\nAn investment of $100,000 in KO in 98 would be worth $389,266.62 now, with a total return of 289.27%. \n\nIt's no Amazon but also a very good return for a low risk stock like KO.", "score": 12, "replies": []}, {"body": "You can say that with virtually any stock if you cherry pick one of their peaks. If you invested in KO in 1994 as opposed to 1998 then you’d have $737,000. \n\nIf you bought $100,000 of Microsoft in 1999 then in 2015 you’d still have $100,000. That’s 16 years of waiting for a 0% gain on one of the largest tech giants on earth", "score": 11, "replies": [{"body": "People are doing this roght now! Buying at ath peak tor the next years", "score": 1, "replies": [{"body": "We’ll see about that lol \n\n!remindme 2 years", "score": 1, "replies": [{"body": "There is a 21 hour delay fetching comments.\n\nI will be messaging you in 2 years on [**2022-09-13 09:53:50 UTC**](http://www.wolframalpha.com/input/?i=2022-09-13%2009:53:50%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/stocks/comments/irayy6/buffett_sells_100000_bank_shares_and_increases/g52xa16/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Firayy6%2Fbuffett_sells_100000_bank_shares_and_increases%2Fg52xa16%2F%5D%0A%0ARemindMe%21%202022-09-13%2009%3A53%3A50%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20irayy6)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}]}, {"body": "Hindsight man, would you invest 100k in SPCE now? Would you invest 100k in a penny stock? Amzn was considered super high risk and Coke a blue chip", "score": 4, "replies": []}]}]}, {"body": "No matter how bad the economy gets, people will still be able to afford a coke. Plus coke gets distributed at drive tru restaurants which will continue to operate no matter what.", "score": 8, "replies": [{"body": "You are very naive if you think KO is not affected by a recession.\n\nHow many people have switched to off-brand coke to save money?", "score": 3, "replies": []}]}, {"body": "I heard cola might be going into hemp products", "score": 13, "replies": []}, {"body": "Weird question but why is the thumbnail for this post a screenshot of an interface mock-up in Sketch?", "score": 5, "replies": []}, {"body": "He criticizes owning gold itself, not the business that mines it. That's the big difference in terms of his buy.\n\nOther than that, everyone else is buying BofA and AAPL anyway, and KO is pretty much always a win.\n\nNot sure I'd short JPM, they're doing great and I'll be buying more for sure. Their dividend increases are wild and anyone who likes a dividend stock should take a look at them.", "score": 3, "replies": []}, {"body": "Gold or gold miners ? Not the same", "score": 5, "replies": []}, {"body": "Buying WFC now.. it’s buy low sell high right? So buy now and sell later? Buffett seems to have forgotten with the airlines and banks. \nHis “favorite holding term is forever” eg never sell mentality, so a few years to recover on banks is a small amount of time. \nI really wonder what’s driving these moves and if WB is really driving these decisions.", "score": 7, "replies": [{"body": "WFC is probably the worst of the big banks you can buy. They couldn't even administer PPP loans because of prior restrictions due to their decade-plus history of outright fraud. \n\nBAC is still around half price and is probably a good way to double money in the next 3-4 years.", "score": 2, "replies": [{"body": "That’s the sentiment right now. I tend to pick stocks that i know will recover but have fallen on hard times. E.g. chipotle, I got in at 250 when everyone wrote them off with the ecoli scandal. It’s not a strategy that’s for everyone but it’s worked for me very well... don’t buy for the sentiment today, buy for the potential years from now. \nSame with intc, people are writing them off for a variety of reasons. I believe they will come back.\nLook at tsla... people wrote them off years ago too. \nYeah WFC is in a rough patch and has a lot of work to do, but that’s a known factor and should mostly be priced in at this point.", "score": 2, "replies": [{"body": "I'm that way with REITs. But WFC has burned people. Multiple times. I sold mine for ARKF.", "score": 1, "replies": [{"body": "Yeah I’m just buying in now. My thought is over the years to come they will root out the cancer and turn things around. Or maybe they won’t, that’s the risk we take!", "score": 1, "replies": [{"body": "I think the cancer so to speak is gone. But they're still capped by the government... and I'm not sure big bank stocks are usually the best investments anyway.\n\nIf they ever pay 7% yields again I guess I would go back in.", "score": 1, "replies": [{"body": "Yeah the banks are shafted by rates right now which is also depressing share price. I’m with you on the div, which I think will come back within the next year or year and a half.", "score": 1, "replies": [{"body": "Just FYI, from 2009 to 2014, BAC paid dividends of 4 cents a year. I don't know why but even WFC recovered better than they did. \n\nIt can take a WHILE for bank stocks to recover, my friend. \n\nI'm doing something similar with oil supermajor stocks. I know, guaranteed, they'll recover eventually. But yeah, that's risk.", "score": 2, "replies": []}]}]}]}]}, {"body": "Chipotle and INTC are both good companies, idk if you can really say that about WFC. Out of all major US banks they have the worst financials, upside due to penalty restrictions from the scandal, and their revenues is most affected by interest rates vs BAC and JPM, due to having less revenue diversification. \n\nSeems like a value trap to me", "score": 1, "replies": []}]}]}]}, {"body": "He already this? Is this an old topic or did he sell even more?", "score": 2, "replies": []}, {"body": "The Fed has said interest rates will not rise until 2023 at the earliest, so there is no reason for Berkshire to be concentrated in bank stocks. He owns a ton of Bank of America, and that really is all he needs to do. At one point, Berkshire almost looked like a bank ETF with Apple added to it. I'm glad he's doing this.", "score": 2, "replies": []}, {"body": "Weird, I bought BAC for writing covered call and KO this week. \n\nI’m clearly the next oracle. \n\nExcept for all the money I lost this week .....", "score": 2, "replies": []}, {"body": "Buffet also drinks five cans of coke a day...", "score": 1, "replies": []}, {"body": "> owever, Warren has increased his positions in Apple, Coca-Cola and Bank of America. It is speculated that Warren is predicting that the effects of Covid19 will last longer than Wall Street imagined. \n\nWhere did you see that?\n\nHe was selling Apple back in February before the first crash, and I'd be absolutely shocked if he was buying at these prices.  This is a prime opportunity to unload.\n\n&#x200B;\n\nI don't think Buffett is done with banks, and the economic impact of this recession is significant.  He is very clearly using this as an opportunity to hoard up a massive amount of cash, I think he is expecting a very major correction, and he has always shown he is willing to wait it out.  This market is a dream for someone with assets like that.  At this point you know a massive correction will come, and you got a prime opportunity to unload at great prices.", "score": 1, "replies": []}, {"body": "As far as I can tell, this article is based off of the 13F filed in the ending period of June 30 and made public on August 14th. So kinda old news.\n\nI’d highly doubt buffet would add onto his Apple stake given its valuation and potential growth.", "score": 1, "replies": []}, {"body": "They are definitely doing something right. I own Brkb shares and while tech is getting blasted with both barrels recently my Brkb shares have barely gone down.", "score": 1, "replies": []}, {"body": "Reading Buffett increased his shares in coke makes me feel more confident about purchasing more shares the other day 😃😃", "score": 1, "replies": []}, {"body": "FYI this was done over a month ago", "score": 1, "replies": []}, {"body": "What a fucking wannabe boomer", "score": -8, "replies": [{"body": "Who the f invests in coca-cola? What a crap product that can cause diabetes and makes me personally feel like garbage when I drink it. Corn syrup is garbage. I will never invest in garbage.", "score": -28, "replies": [{"body": "I’m going to assume they own other interesting assets he likes but who knows\n\nThe guy doesn’t even know what a becky is so I question his word view", "score": -11, "replies": []}]}]}, {"body": "[deleted]", "score": -10, "replies": [{"body": "> If he was still Legendary he wouldn't have let go of airlines to drop to lowest value while it was near lowest. Then then airline sector doubled following month. He could've waited.\n\nDo you think he loses a second of sleep over this? Berkshire Hathaway makes more from dividends in a year than the worth of his entire airline position. He doesn't baghold, he held onto Berkshire stock for too long and it cost him $200 billion (according to him) in missed growth in subsequent decades.", "score": 8, "replies": []}, {"body": "You think JPM is gonna keep its dividend.. and its share value, through 4 years of ZIRP? Buffett has to think like a billionaire. I wager that even he couldn't have predicted the madness of Govt and central bank actions that have paid near 10 trillion dollars to prop the economy up. We're still in an everything bubble, the great depression took 2 years to hit the bottom.. it's only been 6 months", "score": 1, "replies": []}]}, {"body": "[removed]", "score": -19, "replies": [{"body": "Damn bro wishing death just because people make posts about his moves in a subreddit", "score": 16, "replies": [{"body": "I think even warren would rather dead than read the financial news about his underlings moves these days", "score": -10, "replies": [{"body": "Says some random guy on the internet. I am so sure you are a terrific investor with much experience...", "score": 3, "replies": []}]}]}]}, {"body": "If Buffett thought CoVID would last long, he wouldn't be doubling down on Coca-Cola.", "score": -14, "replies": [{"body": "\"Coke\" sells more than just cola beverages... considering most of us are shut in trying to not catch this shit - people are buying more products at home - typically comfort foods / drinks are on that list of items we like to keep while we are not going out and doing normal things....   \n\n\nThey also have a stake in the healthy beverage market as well for those who choose not to indulge in their inner depressed Thor...  \n\n\nCoke is a great defense play\n\n[https://www.coca-colacompany.com/brands](https://www.coca-colacompany.com/brands)", "score": 5, "replies": [{"body": "Coke is all about selling at events. The had mad revenue decline due to Corona virus shutdowns.", "score": 1, "replies": []}, {"body": "Wow. How is it sitting on your high horse.\n\nPepsico is the CoVID play. The have a strong snack business that is doing well whole people stay home.\n\nMost of Coke's revenues are driven by events. Movie Theaters. Sports events. Travel and hospitality. And of course fast food and resturants where people are not going \nas much.\n\nFor example, the movie theaters just pushed back all of their movies again because Tenet bombed. If people aren't going to the theaters because movies aren't being released, then Coke loses a lot of sales from fountains. It may not show up in the first quarter after COVID, but the successive ones will be challenged. \n\nIt's quite arrogant to think I don't understand what Coke sells. I understand it more than most and I'm not some sheep that just assumes the steady state. If COVID lasts through the end of 2021, Coke stock will fall another 20% easily.\n\nGood luck.", "score": 1, "replies": []}, {"body": "Didn’t Coke recently purchase a whole “power water” brand too? Which seems to be a new fad.", "score": 1, "replies": [{"body": "yea - I believe they did", "score": 1, "replies": [{"body": "Yea, so to me Coke seems like a great play because they have a product that is fairly unaffected by world circumstances and continue to innovate for the future.", "score": 2, "replies": [{"body": "Continue to pollute the world and fuck our oceans beyond repair..... Fixed that for ya", "score": 0, "replies": [{"body": "I love the world as much as the next guy but I don’t make investment decisions based on things like that.", "score": 2, "replies": [{"body": "Coke has been a good invest for warren.   Thats about it.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Buffett is clueless. \n\nThis is how he trades without rubbing shoulders with oil CEO’s. He has no idea what’s going on.", "score": -6, "replies": []}]}
