{"title": "Bear market? No! US large value stocks are down -2%, US small value and international large value stocks are positive, and international small value stocks are down -4%. 2022 reminds me of 2000.", "selftext": "[deleted]", "id": "v84gos", "created_utc": 1654735417.0, "score": 39, "upvote_ratio": 0.63, "num_comments": 97, "comments": [{"body": "S&P 500 was down 20% ytd a month ago but is down less than 14% now. Not crazy bad but not great when people get used to 25% gains like last year.", "score": 73, "replies": [{"body": "When people are used to 25% pa, then -14% is a necessary correction in both price and expectations.\n\nI bet people aren't going into 2023 with a +25% expectation. That's a good thing.", "score": 26, "replies": [{"body": "Nope, I'm going into 2023 with +175% expectations", "score": 5, "replies": []}]}, {"body": "You have to realize those gains were just fake money. 80% of all money was printed in the last 2years.", "score": 10, "replies": [{"body": "This phrase is thrown around waaay too much", "score": 32, "replies": [{"body": "It does correlate with situations like this.", "score": 4, "replies": [{"body": "So if loose monetary policy makes equities going up \"fake\" then are the losses from tightening also fake?\n\nPretty sure you could sell them for real money and still owe real cap gains?\n\nThe comment makes sense if the fed were pulling a buy and hold on spy or vti or something, prob worth noticing they bought bonds which inadvertently led to pe expansion so \"value\" was left out of the rally so naturally get left out of this selloff...", "score": -1, "replies": []}]}]}, {"body": "You say that like the money doesn't still exist though", "score": 18, "replies": [{"body": "People like you don’t realize that money means nothing without value. You shouldn’t be worrying about dollars, only the value of said dollars", "score": 2, "replies": [{"body": "Also known as purchasing power.  You are entirely correct; and one reason the artificial price of the Russian ruble is so spurious", "score": 3, "replies": []}, {"body": "People like me? I'm fully aware. But if we are talking about the nominal value of equities, then the price should sustain better if there is more money in the system, even if it's intrinsic value is less.", "score": -1, "replies": []}]}]}, {"body": "Not true. I read that its more like 20%", "score": 5, "replies": [{"body": "Sauce?!", "score": 0, "replies": [{"body": "Closer to 30%, or a 50% increase, at least for M2.\n\nhttps://fred.stlouisfed.org/series/M2SL\n\nHow about some sauce from you now?", "score": 8, "replies": [{"body": "Inflation is because of Putin and nobody wants to work though!", "score": 6, "replies": [{"body": "Inflation is because there’s issues on both the supply and demand side.\n\nSupply is down because of factories’ outputs being lower during the pandemic, shipping issues behind behind, staffing issues, China lockdowns, and Russia sanctions. Lower supply.\n\nMoney supply is also up due to low interest rates and higher wages and money printing / loans. Higher demand.\n\nHigher demand and lower supply = inflation.", "score": 0, "replies": [{"body": "Inflation doesn’t come from supply issues fam. It comes from the fed printing money to bail itself out, at everyone else’s expense", "score": 1, "replies": [{"body": "Inflation absolutely comes from supply issues. Most factories lowered output during the pandemic and can’t get back online fast enough to meet orders.  Silicon chip orders are backed up for months.  Oil prices are up entirely due to supply issues, which is driving up shipping prices too.\n\nThere’s a reason this is happening in EVERY country. Not just USD.", "score": 1, "replies": [{"body": "There’s a difference between inflation and high demand. Just because prices go up doesn’t mean it’s due to inflation. In this case, high prices are due to both inflation *and* supply issues.", "score": 1, "replies": [{"body": "This is actually a misconception- inflation IS caused by this factors.\n\nUsually supply factors cause rising prices which leads to people demanding and receiving higher wages which leads to more money in circulation which leads to the higher prices becoming a little more permanent even when supply resumes.", "score": 0, "replies": [{"body": "That logic is flawed. It would make sense if the 1% were holding USD, however 90% of their assets are not fiat, they are stocks, real estate, and other appreciating assets such as Bitcoin", "score": 1, "replies": [{"body": "What did it have to do with the 1% or investments?", "score": 1, "replies": [{"body": "The only reason money in circulation would rise in your scenario is if the corporations were holding usd, thus effectively taking it “out” of circulation", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Bar-B-Que", "score": 1, "replies": []}]}]}]}]}, {"body": "Bear market? Yes. QQQ down 25% YTD...\n\nI don't get the point of this post. Are you expecting every sector and market cap to be down the same % at all times?", "score": 80, "replies": [{"body": "My post shows a broadly diversified portfolio involving all world, all sectors, and stocks of all sizes. By the way, QQQ is only one sector.", "score": -2, "replies": [{"body": "QQQ is about half one sector (tech), but it is made up of stocks from other sectors as well ([QQQ Sector breakdown](https://www.investopedia.com/ask/answers/061715/what-qqq-etf.asp))", "score": 2, "replies": []}]}, {"body": "In a real crash, correlations go to 1.", "score": -36, "replies": [{"body": "Uhhhhh no.", "score": 21, "replies": [{"body": "Name checks out. Don’t worry, won’t affect you in the crash.", "score": 1, "replies": []}]}, {"body": "bear market is not the same as a crash tho", "score": 8, "replies": [{"body": "Guess dat true. We haven’t really had bears, more just stairs up elevator down markets.", "score": 1, "replies": []}]}]}]}, {"body": "\"whether or not the world has learned anything else from the problems of the year 2000, one thing won’t be forgotten: it was bad, and nobody wants it to happen again.\"\n\n[https://time.com/3741681/2000-dotcom-stock-bust/](https://time.com/3741681/2000-dotcom-stock-bust/)", "score": 15, "replies": [{"body": ">Companies were going to market with IPOs and fetching huge prices, withstocks sometimes doubling on the first day. It was a seeming wonderlandwhere anyone with an idea could start making money.\n\nReads like last year...", "score": 12, "replies": [{"body": "I think we’re lucky the shit IPO’s aren’t big enough these days to fully wreck the market like 2000. ARKK is a good indicator of what the rubbish is doing compared to profitable megacaps that make up the top % of QQQ", "score": 6, "replies": [{"body": "However unlike in 2000 many of the companies in ARKK have a somewhat legitimate business model and could be profitable if they stopped expanding their workforces by 25% every year. There was just no reason for them to do that with free money lying around.", "score": 2, "replies": []}]}, {"body": "It's widely accepted now that high-growth stocks just experienced a bust on the order of 2000-2001. But that bear market lasted around 2-3 years, so we may have more to go still.", "score": 4, "replies": [{"body": "I think one important thing about 2000 is it was a bubble in a completely new sector. A bunch of sectors experienced bubbles in there early years. Like railroad mania in early 1840s. People knew there was a load of opportunity but not how to recognize junk in the sector, so we got a bubble. Crypto is experiencing the same thing.", "score": 2, "replies": []}]}]}, {"body": "Excellent article. Thank you for sharing. I remember it well.", "score": 3, "replies": []}]}, {"body": "In what way does 2022 remind you of 2000?", "score": 8, "replies": [{"body": "idiots like CW being hailed as financial geniuses?", "score": 1, "replies": []}]}, {"body": "Yeah until it doesn’t", "score": 7, "replies": []}, {"body": "So we should all buy tech and avoid value then?", "score": 18, "replies": [{"body": "Pelosi' husband did.", "score": 4, "replies": []}, {"body": "Wait. \n\nThe rotation back to tech growth will probably be in the fall after all of retail is shook out over the summer.", "score": 11, "replies": [{"body": "Once the recession hits hard everyone will be jumping back to tech, Nasdaq usually recovers before the broader market. Usually falls first and harder too.", "score": 19, "replies": [{"body": "That’s… not true", "score": 4, "replies": [{"body": "Yes it is", "score": 2, "replies": [{"body": "To clarify, I was calling out your first point. I don’t know if tech is the safe haven in a recession. Or at least not the overvalued, debt heavy junk that blew up in 2021.", "score": 4, "replies": [{"body": "I agree, I like cash flow positive tech, even with high p/e’s that’s okay if they are critical to  business’s success.", "score": 1, "replies": []}]}]}]}]}, {"body": "Wait on what type of tech tho? \n\nSmall cap growth tech? Most of the stocks fell 70-90% from peaks and then bounced 40-100% from the lows 1 month ago…I’m pretty sure retail already capitulated in those and the institutions got their bottom. \n\nLarge cap tech? Most were down 25-50% 1 month ago so not as red but still pretty bad.", "score": 2, "replies": []}]}, {"body": "I think avoiding value is not a good idea.", "score": 3, "replies": [{"body": "I’ll stick with value for now", "score": 3, "replies": [{"body": "Value tech + Growth", "score": 0, "replies": []}]}, {"body": "Plenty of value in the tech space right now.", "score": 3, "replies": []}]}]}, {"body": "Do you think this is the bottom?\n\nYou know there are rallies in bear markets. FED has not stopped with hikes and ECB hasn't even started yet. QT is about to start in just now.\n\n\nThis is not the bottom.\nBut idk I couls be wrong.", "score": 6, "replies": []}, {"body": "Is that really all it is? Geez. The talking heads in the news would have you believe the world is over.", "score": 19, "replies": []}, {"body": "All this means is the pain is yet to come.", "score": 12, "replies": []}, {"body": "Oh so we havent bottomed yet. Gotcha", "score": 3, "replies": []}, {"body": "All participants in stocks, stock indices and futures should focus on the Fed's rate hike on June 16, which has become a market consensus of 50 basis points", "score": 5, "replies": []}, {"body": "Everything is inflated, tech stocks are meme stocks, life is a lie", "score": 5, "replies": []}, {"body": "wait another 6 mths to a year.. a recession might be looming as interest rates keep go up.", "score": 9, "replies": [{"body": "If you wait until the recession is called you’ve already missed the equity recovery. Start buying now", "score": 15, "replies": [{"body": "You think this is the bottom?? You're absolutely silly lmao the world is in turmoil. Step to the side wih some cash and have some patience grasshopper. The bottom will be here before you know it. Just hope it's survivable.", "score": 4, "replies": [{"body": "Nobody knows", "score": 8, "replies": []}, {"body": "People with this mentality have missed rallies for decades. Everyone, including corporations, are cash flush with consumers spending like nothings wrong. I’m not saying that a recession WONT happen, but the degree to which is does ….or doesn’t no one knows.", "score": 2, "replies": [{"body": "The feds are actively trying to slow the market down, this is public information. I agree that nobody knows shit but this is definitely not the bottom.", "score": 2, "replies": [{"body": "The feds are going to reverse on the Powell pivot 2.0 by year end. You can reference this at a later date when it happens. S&P flat to +5% by year end.", "score": 2, "replies": [{"body": "Shitt lol I'm here for it if it happens. My ideas are fluid, I hope we remember this comment lol", "score": 4, "replies": []}]}]}]}]}, {"body": "During a recession stock prices will drop even more. Since many will be cash tight due to losing jobs or needing to fork out more for their housing loans etc. \n\nAnyhow I practice DCA. Just saying in case some here are hoping for a strong rally. \n\nStrong rally /bull market will only happen once Ukraine war is over and Fed stops increasing the interest rate.", "score": 2, "replies": []}]}]}, {"body": "It is very much like 2000.   We are in a similar Bear Market rally now.   Tech stocks down a ton everything else kinda down, some up.   The difference is that energy is up big this year, but that is driven by the War primarily.", "score": 7, "replies": [{"body": "Uh. No. Pull up the 1 year chart on crude oil.", "score": 7, "replies": [{"body": "Hell, pull up the 2 year.  Gotta go back 10 years to see prices this high.  If you go back to 2008 though, prices were twice as high as they are now.\n\nI’m looking at USL specifically.", "score": 8, "replies": []}, {"body": "So you don't think Crude is up in the past year?   I think it is up 89.67%.\n\nAnd that is different than 2000 when it was down 25% over that 12 months.", "score": 2, "replies": [{"body": "You stated “oil is being driven up by war primarily”. I am assuming you are referring to Ukraine. Oil has been on the rise since Brandon was installed.", "score": -1, "replies": [{"body": "Can one of you degenerate just go kill Putin already and save us from his raging dick size insecurity.", "score": 0, "replies": []}]}]}]}, {"body": "Energy was up big. Then war. Now it's up hugely big. The war is definitely the cause of the oil price surge in the last 3.5 months but that surge started from an already high level.", "score": 5, "replies": [{"body": "Yes, thankfully I rotated completely out of growth stocks into value and chose the energy sector for my value as well as commodity plays in mid 2021 through November 2021.   So that decision makes up for some bad decisions I have made in some years before.", "score": 2, "replies": []}]}]}, {"body": "I dont believe any data analysis means much tbh. Inflation is rising and i wont fight against it", "score": 3, "replies": []}, {"body": "https://www.youtube.com/watch?v=JlEGU2ypr1Q  explanation contained in this interview (with an actual expert) will be far more useful than any comment you read in this thread", "score": 2, "replies": [{"body": "Grantham is a joke.\n\nI got 90% out of the market in mid January by the way.   The crash is in the rear view mirror at this point.", "score": 1, "replies": [{"body": "The interview is from January.. if you got out then you aligned with his view and you missed a broad market downturn of ~20%.... so what's the joke?", "score": 2, "replies": [{"body": "he is ALWAYS saying the end is near.  always.  he is a joke and his followers bigger jokes.", "score": 0, "replies": []}]}]}]}, {"body": "Si la jerte esta acostumbrado a tener un porcentaje de 25 % y cuándo cae tan bajo tiene rason de preocuparse", "score": 2, "replies": [{"body": "Էս ինչ ես գրել?", "score": 1, "replies": []}]}, {"body": "I wasn't alive back then so a little clarification would help", "score": 2, "replies": []}, {"body": "Hindsight perfect. Now whatever we pour into now will be the under performers in your next hindsight post. Unless it’s not", "score": 2, "replies": []}, {"body": "WoW … the level of BS in this post is unique! Amazon is down 26% in the last 6 months … go figure", "score": 2, "replies": []}, {"body": "I hate posts like this. Same problem, the idiot who posted it has no idea what is happening.", "score": 2, "replies": []}, {"body": "Lmao, I guess if you trade sideways for 15+ years, you won’t react to this cycle either. DFA International Large Value and DFA International Small cap are still below their 2006 levels. These funds, outside the S&P 500 aren’t great reflections of the market", "score": 0, "replies": [{"body": "They are higher than their 2006 levels if you take into account dividend reinvestment.", "score": -1, "replies": [{"body": "Immaterial and exactly why these aren’t great examples of the broader market. You can find plenty of investments that haven’t reacted much to this downturn (see low down capture/low vol plays with many of these constituents), but that doesn’t mean “the market” hasn’t sold off. This is but a small subset of names relative to the universe and you can always find some investments to fit a “narrative” in the short term", "score": 2, "replies": []}]}]}, {"body": "r/BuzzTheMarginCall", "score": 0, "replies": []}, {"body": " Hi Team. No news market trending down ahead of CPI number. Just sitting back and chilling no need to take action. I love this market. Let’s get ready to have fun!!! After the numbers.", "score": 0, "replies": []}, {"body": "Hi Team. No news market trending down ahead of CPI number. Just sitting back and chilling no need to take action. I love this market. Let’s get ready to have fun!!! After the numbers.", "score": 0, "replies": []}, {"body": "Hi Team. No news market trending down ahead of CPI number. Just sitting back and chilling no need to take action. I love this market. Let’s get ready to have fun!!! After the numbers.", "score": 0, "replies": []}]}
{"title": "I brought a 4 leg tesla option I got assigned How I'm only worth $500", "selftext": "", "id": "v88bwk", "created_utc": 1654748059.0, "score": 76, "upvote_ratio": 0.86, "num_comments": 96, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|7|**First Seen In WSB**|8 months ago\n**Total Comments**|14|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=v88bwk)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=v88bwk)", "score": 1, "replies": []}, {"body": "Over here is where we cook the fries. Now I’ll show you how to refill the soda machine.", "score": 113, "replies": [{"body": "When your done with him, send him to the dumpster, I'll be waiting.", "score": 30, "replies": [{"body": "You can afford BJs?", "score": 7, "replies": [{"body": "Only at OPs going rate, a whole quarter goes far with him.", "score": 3, "replies": [{"body": "I have some live footage behind the local Wendy's right now.\n\n&#x200B;\n\n[https://www.youtube.com/watch?v=-elMcQWuynU](https://www.youtube.com/watch?v=-elMcQWuynU)", "score": 3, "replies": [{"body": "Lol wtf did I just watch, a zj 😆", "score": 1, "replies": []}]}]}]}]}, {"body": "Repeat after me \"do you want lids on these???\"", "score": 3, "replies": []}]}, {"body": "When you go to get an apartment or buy a new car they will say “sir your credit score is 52”. They may also sue to garnish your wages and or bank account. I heard Wendy’s is hiring for UP to $15 an hour. You start at $8.15 and work your way up to $15 after a decade or 2.", "score": 43, "replies": [{"body": "It's wasn't my fault I try to close this position so many times    \nMy order never get filled", "score": 9, "replies": [{"body": "If you can convince a judge of that when they sue mabey they will find Robinhood at fault.", "score": 32, "replies": [{"body": "I got prove where they said my max loss was only 28 buck", "score": 25, "replies": [{"body": "hahaahhaha", "score": 21, "replies": [{"body": "Judge: so far", "score": 3, "replies": []}]}, {"body": "$28.00 in option is $2800.", "score": 18, "replies": [{"body": "Still less than $90,999", "score": 3, "replies": []}]}]}, {"body": "Mabey love this typo (?)\n\nGonna use it all the time to sound like a Frenchman Mabey, mabey not chrhoonkkooonkk", "score": 5, "replies": []}]}]}]}, {"body": "Oh you are so fked… it has been nice knowing you bro, see you behind Wendy’s soon.", "score": 67, "replies": [{"body": "I ain't putting money into robinhood so I think I'm good", "score": 22, "replies": [{"body": "Better pray robinhood declares bk soon lol", "score": 52, "replies": [{"body": "![img](emote|t5_2th52|8881)", "score": 4, "replies": []}]}, {"body": "...ya thats how it works...", "score": 8, "replies": []}]}, {"body": "![img](emote|t5_2th52|4271)", "score": 4, "replies": []}]}, {"body": "You know that feeling when your ass is getting eaten and you fart in their face? You just got farted on", "score": 50, "replies": []}, {"body": "The numbers aren’t adding up", "score": 23, "replies": []}, {"body": "Exercise one of the puts you bought and you're all good.", "score": 41, "replies": [{"body": "Thanks bro u right", "score": 13, "replies": [{"body": "Did that work?", "score": 6, "replies": [{"body": "Yea", "score": 10, "replies": [{"body": "Dude. Did you just blidly follow what a random guy say on the internet? Youre lucky it worked out", "score": 29, "replies": [{"body": "This is the way. u/12baakets what should I do?", "score": 5, "replies": []}]}, {"body": "So you’re out of the negative?", "score": 3, "replies": []}]}]}]}, {"body": "What this person said", "score": 5, "replies": [{"body": "Like, I wonder if there’s a button for that?  Perhaps multiple buttons for that?  That’d be neat.", "score": 16, "replies": [{"body": "so neat", "score": 5, "replies": []}]}]}, {"body": "I was never able to figure out how to exercise options on Robinhood. It was never clear in their UI. Still not sure if it is even possible to exercise options on that platform.", "score": 3, "replies": [{"body": "It...it does have a button that says exercise lol. If you have a call option anyway.", "score": 3, "replies": []}]}]}, {"body": "If you're serious as to what to do, you now need to exercise 1 of your long put positions to get rid of the shares at the defined strike price.\n\nRelax, take a deep breath. You're not actually down 90k. In fact with tesla up so much this morning you've likely gained a profit on the shares that were assigned.\n\nNext time close these positions when they are so deep in the money and close to expiry. You won't have this issue.", "score": 14, "replies": [{"body": "Isn’t this scenario what caused someone to sadly kill themselves, even though they weren’t actually in the hole? I thought RH fixed this???", "score": 10, "replies": [{"body": "Yes. A kid killed himself because the short leg of his spread got excised and they displayed his account value in the -100k’s or something in that ballpark. He killed himself. Robinhood excised his long option which fixed his account days later, but the deed was done.", "score": 9, "replies": []}]}, {"body": "Thank you I was 2k today", "score": 8, "replies": [{"body": "First one is free.", "score": 13, "replies": []}]}, {"body": "Listen to this guy.", "score": 3, "replies": []}]}, {"body": "![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)", "score": 28, "replies": []}, {"body": "Maybe you shouldn't be trading options if you are confused by this.", "score": 7, "replies": [{"body": "This is why I don't trade options. I understand Calculus and Ordinary Differential Equations, and the process of options hirts my brain. I could write a spreadsheet that calculates what the option is doing, and I could never explain this post.", "score": 4, "replies": [{"body": "To my knowledge, which is very limited, this guy was doing a strategy where you have 4 options open. 2 calls, 2 puts, equaling to 2 spreads.\n\nRobinhood automatically exercised one of his options, which made that spread \"lopsided\" and made it look like he owed thousands of dollars. So all he had to do to \"fix\" it was to just manually close out the spare option and he got those thousands that he \"lost\" back safely in his account.\n\nThats my understanding of it.", "score": 4, "replies": [{"body": "OK, yeah, that makes more sense. I am learning options, but only plan to use it as a hedge and covered. My risk tolerance can't accept spiraling losses.", "score": 1, "replies": []}]}]}]}, {"body": "Put a little salt on it. You’ll be alright", "score": 9, "replies": []}, {"body": "Can you post your entire original trade including strikes and premiums, when you got assigned, and what price you were assigned? There may be a way out of this.\n\nIf the other three options expire worthless and you are stuck with the 100 shares, you might consider selling a weekly call just above your assigned price to collect some premium until it gets called away.\n\nAre you on margin now? What's your margin interest rate?", "score": 6, "replies": [{"body": "No I'm not using margin that's why I'm confused how this happened", "score": 1, "replies": [{"body": "Just exercise a put you bought.", "score": 4, "replies": [{"body": "Oh you right thanks", "score": 5, "replies": []}]}, {"body": "perhaps you should understand what the fuck you're trading before you enter in complicated positions like this...? \n\nseems from the comments you got out OK but I would seriously suggest you read and understand basic options before you even try at all to do something like this again, lol", "score": 3, "replies": [{"body": "100%", "score": 1, "replies": []}]}]}]}, {"body": "Haha nice", "score": 5, "replies": []}, {"body": "![img](emote|t5_2th52|4735)", "score": 5, "replies": []}, {"body": "Exercise put my guy", "score": 5, "replies": []}, {"body": "You must have been assigned early before expiration date.\n\nExercise one of the puts you bought. It will sell your 100 shares at either $925 or $900, depending on which one you exercise.", "score": 4, "replies": []}, {"body": "Whats with idiots not knowing the difference between 'bought' and 'brought'? How did retards get confused by this?", "score": 5, "replies": [{"body": "I have a friend who is EXTREMELY book smart, like got straight A's her whole life even in college. But one day she was confused when I called her out for mixing up those two words. It's so crazy to me.", "score": 1, "replies": [{"body": "My wife doesn't understand the difference between these two words.\n\nFor the life of me I don't see how.", "score": 1, "replies": []}]}]}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}, {"body": "That +$2 looking up, hunt the good stuff", "score": 3, "replies": []}, {"body": "OP asked for EOD and someone gave him EOY", "score": 3, "replies": []}, {"body": "You didn't lose you retard. Exercise your 900 put and you'll make 1000.", "score": 3, "replies": []}, {"body": "Holy shit…", "score": 5, "replies": []}, {"body": "Robinhood should have sent you an email on options for what to do next (such as exercising some of the legs)\n\nJust follow whatever steps it tells you to and Robinhood usually handles the rest. I've had it happen to me when I got assigned - at max profit. IDK if that's the case here for you, but you probably got an email or even a message on your app asking you what you'd like to do next.", "score": 2, "replies": []}, {"body": "Your in Robinhood", "score": 2, "replies": []}, {"body": "Cause you’re a dumbass ![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "Whoopsie!", "score": 2, "replies": []}, {"body": "\"it wasn't my fault!!!\" Lmaoo", "score": 2, "replies": []}, {"body": "Damn you fucked around and found out", "score": 2, "replies": []}, {"body": "Absolutely had to return to this post. Are you having a heart attack yet?", "score": 2, "replies": []}, {"body": "This would be such an easy fix too 🙄", "score": 2, "replies": []}, {"body": "$500 is enuff four sum grammarar lessons.", "score": 2, "replies": []}, {"body": "Just tap the reset button and you should be fine.", "score": 1, "replies": []}, {"body": "See you at Wendy's bro. Hours are 8 a.m. to 3 a.m.\n\nDon't be late", "score": 1, "replies": []}, {"body": "Why does this happen?  Thanks", "score": 1, "replies": []}, {"body": "The fact i only see $23k in buy order and you're -$90k , let me know I'll stick to covered puts and calls... there's always levels for every income to lose money.", "score": 1, "replies": []}, {"body": "dude  looking at option prices when the market is closed is useless. \n\ndont worry about margin calls. just sell for a profit and youll be fine.\n\n\ndont get greedy on the orders and it will work out", "score": 1, "replies": []}, {"body": "Time to open an Onlyfans and move to Mexico they got Wendy’s there I think.", "score": 1, "replies": []}, {"body": "It just says you can’t open any new positions. Just don’t open any new positions.", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4270)", "score": 1, "replies": []}, {"body": "At what strike did you get excercised?", "score": 1, "replies": []}, {"body": "mason what do the numbers mean", "score": 1, "replies": []}, {"body": "Why cant you just sell the stock... Its dumped", "score": 1, "replies": []}, {"body": "What are you doing trading in the unemployment office..  I mean robinhood", "score": 1, "replies": []}, {"body": "If you don't know what you're doing then YOU NEED TO CALL THE BROKER. The solution is probably simpler than you're realizing. I've read exercise the put side; that may be the answer, but call the broker.", "score": 1, "replies": []}, {"body": "hey where’s that tarD who was talking about how spy wasn’t gonna drop because it had formed a 2 week bull pennant?", "score": 1, "replies": []}, {"body": "Little advice: \"DON\"T TRADE SHIT YOU DON'T UNDERSTAND\" like why did your mom have kids or why is my wife's boyfriend in me underwear. Just don't.", "score": 1, "replies": []}, {"body": "It's Robinhood. Switch broker.", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "Lol!\n\n“My portfolio finally gonna see some green.”\n\n🤣", "score": 1, "replies": []}, {"body": "More rooks that shouldn’t be trading options", "score": 1, "replies": []}]}
{"title": "I Have a Job", "selftext": "We’re currently building an absolutely massive distribution facility for a certain retail chain in the United States. From what I understand the project has been kept under wraps for the most part. This facility is massive; think Amazon warehouse. \n\nI think it’s fair to say *redacted* is building infrastructure for massive expansion, and may soon become a competitor to Amazon.\n\nWe’re on TARGET to finish the project by end of year.\n\nDo with this information what you will.", "id": "v8q7up", "created_utc": 1654806875.0, "score": 64, "upvote_ratio": 0.77, "num_comments": 97, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|1 year ago\n**Total Comments**|8|**Previous DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=v8q7up)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=v8q7up)\n    \nHey /u/lobsterthatishorny, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 1, "replies": [{"body": "No position right now", "score": 1, "replies": [{"body": "Trust me bro!!!", "score": 2, "replies": [{"body": "Ah so if I bought some random shit that would be the determining factor for you? Good to see you aren’t so easily influenced.", "score": 1, "replies": []}]}]}]}, {"body": "It's a secret message guys I think OP is trying to tell us to buy Walmart!", "score": 91, "replies": [{"body": "No, you imbecile!  OP said that this company may become a competitor to Amazon.  Amazon is well-known book selling company.  OP is involved in building a massive distribution facility for Barnes & Noble, obviously!  Buy more $BKS!", "score": 46, "replies": []}, {"body": "I think I've hit the bullseye by realizing he's working for a hedgefund that lost a lot of money.", "score": 8, "replies": []}, {"body": "No, dumbass, he’s trying to tell you to buy Starbucks.", "score": 5, "replies": []}, {"body": "Walmart is for sale? How much?", "score": 3, "replies": []}, {"body": "Busy buying the Broncos. Please hold, your call is very important to us. \n\nCalls on domed stadiums for pussy football players.", "score": 3, "replies": []}, {"body": "1,000 calls for WMT you say?", "score": 2, "replies": [{"body": "![img](emote|t5_2th52|4258)", "score": 2, "replies": []}]}, {"body": "He’s trying to sell us his wives", "score": 1, "replies": [{"body": "I already got one. Does he have any girlfriends for sale....", "score": 1, "replies": []}]}]}, {"body": "It’s literally impossible to keep it “under warps” zoning, environmental reports, traffic impact reports and tax and deed  records are public information.", "score": 40, "replies": [{"body": "I agree, but regardless, this is a huge facility which would not be built without plans for expansion which I don’t believe is priced in.", "score": 3, "replies": [{"body": "Lol. Not priced in. It's right on their fucking website.\n\nhttps://corporate.target.com/press/releases/2022/03/target-announces-investments-to-drive-long-term-gr", "score": 59, "replies": [{"body": "Nowhere on there does it say it’s priced in.", "score": 43, "replies": [{"body": "It was priced in before any of us were even born retard", "score": 37, "replies": []}, {"body": "Oh god this is so embarrassing", "score": 11, "replies": [{"body": "Oh god you’re actually intellectually disabled", "score": -10, "replies": [{"body": "Back to SS with you kiddo", "score": 0, "replies": [{"body": "Do you get on Reddit just to complain?", "score": 0, "replies": []}]}]}]}, {"body": "*TARGET* sounds like everything is pre determined with that kind of name.", "score": 4, "replies": [{"body": "That’s because everything is predetermined and free will is an illusion, obviously.", "score": 7, "replies": [{"body": "I hope it goes well for you.", "score": 1, "replies": []}]}, {"body": "It's pronunciation is tar-gay according to bears 🐻 I know", "score": 1, "replies": []}]}, {"body": "He’s gotta point there 😂", "score": 2, "replies": []}]}]}]}]}, {"body": "Got it, \n\nGME", "score": 29, "replies": [{"body": "Bull’s eye", "score": 10, "replies": []}]}, {"body": "[deleted]", "score": 24, "replies": []}, {"body": "GameStop. Yeah yeah, it must be GameStop.", "score": 15, "replies": []}, {"body": "is another distribution center going to give TARGET more sales?", "score": 20, "replies": [{"body": "store inventory\n\nretailers are way overstocked on average now", "score": 7, "replies": [{"body": "There are some great sales right now. I bought some pants from a fancy brand for $20. I got a bunch during the 2020 glut as well. Half of my wardrobe was bought 50%+ off during the pandemic era.", "score": 6, "replies": []}, {"body": "Well I can just buy another 3 TVs instead of eating", "score": 4, "replies": []}, {"body": "He figured it out. Buy [Overstock.com](http://wendys.com). At least its the most likely winning trade. Right?", "score": 1, "replies": []}]}, {"body": "It’s a link in the chain that allows them to have more sales, yes. This is in an already developed area, and they have not been building new stores much. My guess is they are going to shift to online sales heavily within the next 1-2 years.", "score": 3, "replies": [{"body": "They can have as many links as they want. Americans are tapped out now with the inflation. Revolving credit card debt for your average earner has skyrocketed past prepandemic levels.", "score": 7, "replies": [{"body": "I don’t think people will suddenly start buying more stuff. People may buy their stuff from Target instead of Amazon or other retailers. \n\nIf you cut a cake into 8 slices and Bezo’s has 7 of them, taking one of Bezo’s slices would not increase the amount of pie that exists, but rather how much pie you have. Make sense?", "score": -1, "replies": [{"body": "I'm not much of a pie guy. Do it again but with cake instead", "score": 6, "replies": []}, {"body": "I see what you are saying by getting more business in the online sales realm I just think in the grand scheme until inflation calms everything is going down and possibly another massive reckoning something akin to 2008.", "score": 1, "replies": [{"body": "Absolutely agree. This would be a long play and I don’t have any positions at the moment as I suspect we’re still yet to see the bottom. If we have a nice little economic collapse I’ll pick up some atm LEAPs, assuming that we don’t hit hyperinflation.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "ORACLE", "score": 9, "replies": []}, {"body": "Is it Blockbuster? As all of the letters that spell Blockbuster are in your post so surely it must be Blockbuster?…………………blockbuster", "score": 9, "replies": []}, {"body": "Commin up in here straight bragging about having a job. Super fancy huh", "score": 7, "replies": []}, {"body": "I alrdy did and bought more gme", "score": 31, "replies": [{"body": "based af", "score": 2, "replies": []}, {"body": "Already did what?", "score": 1, "replies": [{"body": "What they will", "score": 6, "replies": []}]}]}, {"body": "I work at an undisclosed location, currently under renovation.  You might be right", "score": 6, "replies": []}, {"body": "Instructions unclear. Bought some Blockbuster shares.", "score": 5, "replies": []}, {"body": "Unless target is going to build AWS they won’t be an Amazon competitor.", "score": 9, "replies": []}, {"body": "Pays to have a big storage warehouse when inflation is so high. Keep it for a year and it's a 7% return just for holding it", "score": 5, "replies": [{"body": "This fits in great with the retail model, buy hold for a year then sell at a sweet 8% extra profit. 🤑", "score": 1, "replies": []}]}, {"body": "I too have a job at an undisclosed location behind a well-known franchise that put meat between 2 buns. Business has been going downhill so do with this info as you will.", "score": 3, "replies": [{"body": "Alrdy did and bought more gme", "score": 6, "replies": []}, {"body": "The fast food business puts meat between two HALF buns. Your activity sounds more raunchy.", "score": 2, "replies": []}]}, {"body": "So Spudz McKenzie gave the go ahead, did he?", "score": 3, "replies": []}, {"body": "I work at a grocery store and every week we get slower and slower", "score": 3, "replies": []}, {"body": "This PUTS an idea in my head", "score": 2, "replies": []}, {"body": "You say MSFT?", "score": 2, "replies": []}, {"body": "BUILD A BEAR..??", "score": 2, "replies": []}, {"body": "Is the facility being outfitted with automation like Amazon facilities?", "score": 2, "replies": []}, {"body": "I expect they need the space to store their ballooning inventory.  People can't buy plastic crap from China when they can barely afford gas and groceries.", "score": 2, "replies": []}, {"body": "I smell a pump and dump", "score": 2, "replies": []}, {"body": "1 huge facility is meaningless compared to Amazon’s hundreds", "score": 4, "replies": [{"body": "Well I’m only on the one job site, since I do not have the capability to transcend space or time.", "score": 4, "replies": [{"body": "pffft amateur", "score": 11, "replies": []}, {"body": "Amazon is a bit more than the facility itself you know?\n\nThey’ve got the end to end from manufacturer to customer sorted out and they’re growing wider. And can grow wider as they make more money from AWS. Target I believe could compete for a bit more of the retail market but it’s not going to be in a good shape.", "score": 2, "replies": [{"body": "I wouldn’t expect them to be ‘the next Amazon’ at all but they could very well take a slice of the retail sales.", "score": 1, "replies": [{"body": "Def not since amzn isn't just online sales.  \n\nI think tgt has a place in a diverse portfolio in the retail area.", "score": 3, "replies": []}]}]}]}]}, {"body": "Buy target?", "score": 1, "replies": []}, {"body": "If this is target this is a ridiculously stupid idea.  Targets main consumer is basic bitches with too much time on their hands.  Nothing gets white ladies aged 25-50 wetter than the prospect of aimlessly wandering around target with a Starbucks.\n\nThe trip to the actual store is the destination.  If you want to order something you use Amazon.  Unless you need cat and Jack clothes.", "score": 1, "replies": [{"body": "“If you need a car you get a Ford Model T, because things don’t change or improve ever.”", "score": 1, "replies": [{"body": "Bitch did you even read my comment.  Half of target sales are in person experience.  But hey keep trying to compete with aws", "score": 1, "replies": [{"body": "Yes, right now that is true. Will that be true in 2 years?", "score": 1, "replies": []}]}]}]}, {"body": "So calls on $RIDE?", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I will bring it up! I’m just not sure how much we can affect that, me being a construction worker and all..", "score": 1, "replies": []}]}, {"body": "Old news", "score": 1, "replies": []}, {"body": "Maybe Sears is making a comeback as an online retailer.  That’s why their stock has been ripping!", "score": 1, "replies": []}, {"body": "Costco gonna deliver in an hour?", "score": 1, "replies": []}, {"body": "Does this store sell arrows also?", "score": 1, "replies": []}, {"body": "TGT puts yep.", "score": 1, "replies": []}, {"body": "Ban", "score": 1, "replies": []}, {"body": "Is this insider trading?", "score": 1, "replies": []}, {"body": "Invest in a competitor to Amazon when their sales are down and in this current economic climate. No ty sir.", "score": 1, "replies": []}, {"body": "While I applaud your instinct to share something like this to strangers, I have to wonder if you know how the real world works. \n\nAnything this “massive” would have already been approved by regulators, would be obvious on recruiting websites, and likely disclosed in public SEC filings. \n\nBig and real companies don’t operate like GME and make random pivots for mysterious reasons every other week.", "score": 1, "replies": []}, {"body": "Shorting the shit out of bullseye.  Go long video game.\n\n&#x200B;\n\nGot it.", "score": 1, "replies": []}, {"body": "He is talking about Zales. You are retatrds.....", "score": 1, "replies": []}, {"body": "so you work at target?", "score": 1, "replies": [{"body": "That’s probably the most logical assumption in this entire thread. But no.", "score": 1, "replies": []}]}, {"body": "I hear ya, all in on Costco", "score": 1, "replies": []}, {"body": "I hear ya, all in on Costco", "score": 1, "replies": []}]}
