{"title": "Where to put equity at age 70", "selftext": "Better to pull out of market at 70?\n\nIt seems everyone is saying we are headed into a recession, including the likes of heads at JM Morgan, etc. It seems more probable than not that market will go negative for the near term from where it is now, and average recession is something like 500 dats. Given my age, I don’t see point in keeping any of my money in equity. I’m thinking of taking it all out but I’m not sure where to put it - maybe just a money market acct. is this the right strategy? Where would you put your money in this circumstance?\n\nEDIT: I’m in a mix of like 60 40 (FI / Equity), and it’s all pre-tax rollover money. I’m curious mostly on the equity side. Since it’s all pre tax, I can’t see doing I bonds since I’d have to pay income tax on the distribution before investing into I bonds", "id": "vmme8n", "created_utc": 1656420129.0, "score": 68, "upvote_ratio": 0.91, "num_comments": 93, "comments": [{"body": "Welcome to r/stocks!\n\nFor stock recommendations please see our portfolio sticky, sort by hot, it's the first sticky, or see [past portfolio stickies here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3A%22Rate+My+Portfolio%22&restrict_sr=on&sort=new&t=all)\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Honestly, probably going to a pro would be best thing to do. Come up with sone detailed plans based on what you need and expect your money to do.", "score": 36, "replies": []}, {"body": "There are some questions: do you need access to it soon? What's your current income and does it cover your expenses? Do you have long term care coverage? Is this an IRA? Do you have other savings? What percentage of your overall assets is your equity? What kind of equity is it? Well-established dividend companies or volatile small cap tech? I'm in the industry, and if someone came to me with your question, I couldn't legally give advice until I considered all of the above plus more.", "score": 14, "replies": []}, {"body": "Why not cash out and enjoy your latter years? You can't take your equity with you when you die.", "score": 13, "replies": [{"body": "It still has to last 20 or more years.  Seventy isn’t that old.", "score": 8, "replies": [{"body": "Who wants to reach 90 though? Fuck that.", "score": 1, "replies": [{"body": "more importantly - who wants to be flat broke if they do?", "score": 6, "replies": []}]}]}, {"body": "[deleted]", "score": -3, "replies": [{"body": "If they're half decent people they would prefer their father/grandfather (or mother/grandmother) to enjoy their own retirement than to leave it all for them.", "score": 13, "replies": [{"body": "To each their own. I invest with the sole goal of providing to my kids/grandkids when I pass. My life is relatively unimportant in the grand scheme of things.", "score": 9, "replies": []}, {"body": "Half-decent people build generational wealth to help their kids and grandkids. “I’ve got mine, fuck the kids” is why we’re indebted up to our eyeballs and the planet is burning.", "score": 4, "replies": [{"body": "My dad helped the less fortunate his whole life. Got fuxked over more than once, but made very good money in his last 10 years before retiring. My brother and I keep telling him, you grew up on pigs feet, we had pork chops, our kids are going to roast the whole pig... Travel, buy a new Bike, buy 2!! We got this. \n  \nGenerational trickle down is not only money, just having money doesn't solve shit the \"I've got mine, fuck thw kids\" problem. \n\nReal role models aren't rich.", "score": 3, "replies": [{"body": "Real role models are very rich. Just not by most peoples definition of rich.", "score": 1, "replies": [{"body": "I'm keeping that saying. Thank you.", "score": 2, "replies": []}]}]}, {"body": "You work to *live* though. Why work your whole life and never get around to the \"living\" part because you saved all of your money for your kids or grandkids to squander?\n\nAll well and good if you're loaded when you hit retirement and can afford to do both, but most of us are probably going to have to work until we die.", "score": 2, "replies": [{"body": "I hope you’re living long before you reach 65. Living doesn’t require seven figures.", "score": 4, "replies": []}]}, {"body": "Have you met some of these kids, though?", "score": 1, "replies": [{"body": "No, they know to stay off my lawn.", "score": 3, "replies": []}]}]}]}, {"body": "Go have some fun and don’t sweat it! Descendants like Trust Fund Babies”. Fuck that is a depressing thought that you worked all that time only to hand over all your money to some shallow ungrateful entitled son of a fuck who treats others like shit. Nah, go blow your whole wag on hookers and gambling or give it to somebody who’s trying like hell to make others lives better.", "score": 0, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Hope is a bad plan. I’ve known many people I really thought highly of and somehow the kids were so awful. How about an animal rescue donation for cats or dogs.", "score": 1, "replies": []}]}]}, {"body": "Done anything right? Having kids is a personal choice that doesn’t reflect on a person’s character, and in any event they might want to enjoy their own life for a while rather than scrimping for the kids, which is 100% their right.", "score": 0, "replies": []}]}]}, {"body": "2 year Short term CD or Treasury ladders, I series bonds at your age.", "score": 23, "replies": [{"body": "Since my investment is all pre tax, I assume I bonds wouldn’t make sense since I’d have to pay income tax (12%)", "score": 7, "replies": [{"body": "Don't let the tax tail wag the investment dog.  \n\nYou are smart to want to reduce risk.  With the rise in interest rates, fixed annuities would pay you a higher rate and give you a guaranteed income stream for life.\n\nAlso, you could keep some of your assets in equites, but concentrate on solid dividend paying stocks.  Dividend payments tend to hold up during recessions and rise during recoveries, so this could give you another income steam, and the underlying stocks should tend to appreciate over time", "score": 14, "replies": []}, {"body": "It does not require state income tax.   12% is actually below national avg.  People in way higher(>37%) some buy muni bonds.", "score": 2, "replies": []}, {"body": "You can do bonds and CDs inside an IRA or 401k rollover.  I’ve done it through Fidelity.", "score": 1, "replies": []}, {"body": "You can only do $10k in i.bonds anyways. I hope at 70 you have alot more than that saved up. 😉", "score": 1, "replies": []}]}]}, {"body": "I mean, you certainly shouldn't invest like a 25 year old should. But hopefully you're not in that position to begin with. As for what to do, it depends on what you want to achieve. There's more safety in bonds. And if you plan on spending a substantial amount of that money within the next few years, perhaps taking some or all of it out is a viable strategy. \n\nWith other goals and needs, perhaps it can be correct to stay in equity.\n\nWhere is your money right now, in what type of investments? What are your goals? What'are your fears? What are your plans?", "score": 11, "replies": [{"body": "60 / 40 (bonds,cash / equity)", "score": 4, "replies": [{"body": "Equity in a broad fund like VT?", "score": 4, "replies": []}]}]}, {"body": "I’m assuming at 70 if you sell out of the market entirely you’re looking at a large tax bill. Depends on your risk tolerance but I would have 1 to 2 years of living expenses saved in cash. A further 20 to 40% of your wealth in more stable sources of return such as CD ladders, real estate, possibly bonds. And the rest remain in equities. When equities are performing well draw down from that. When they aren’t draw down from CDs, etc. You’ll be able to peacefully ride out most recessions this way without losing out on all of the upside in the market", "score": 5, "replies": [{"body": "No tax bill if I just put in a pre tax money market account (I.e. no distribution)", "score": 3, "replies": [{"body": "Just sell  if it's 401(k) or IRA. At 70 you should be at least 90% cash. Unless you have so much you're planning on handing the account down to next generation in the family. Then the convo would pivot because you would actually want to leave a decent portion in equities.", "score": 1, "replies": []}]}]}, {"body": "Cocaine and hookers my man. Time to spend all that cash", "score": 11, "replies": []}, {"body": "70 seems pretty young to me to be pulling all of your money out of the market.  Do you have enough money to live the rest of your life adjusted for inflation?  I subscribe to the age - 20 rule (although I am using age -25) which means that you should have your age - 20 in cash/bonds and the rest in the market.  At 70 this would mean a 50/50 split.", "score": 6, "replies": [{"body": "Makes sense but if you knew a recession was coming (and we’re my age), wouldn’t you adjust that?", "score": 3, "replies": [{"body": "The problem with timing the market is you have to be right twice.  You have to get out at the right time and also get back in at the right time.  I know someone who got out probably 20% before the bottom in 2007 and they were really cocky about it but then they were late getting back in and actually ended up worse than those who rode the whole thing out.  \n\nThat 50% allocation should give you enough cushion to ride it out depending on how much you have.  Obviously you should not have invested anything you will need in the next couple of years but if you are 70 and retired you should have 10-20 years worth in your portfolio so should be able to ride out the bottom.  I would also be more aggressive and rebalance quarterly which may mean moving more money in the market as a dropping market would probably mean you stock allocation got lower.  \n\nI am not that age so that is easier for me to say and do in my case.  I just think that it is very dangerous to try to time the market", "score": 10, "replies": [{"body": "This is exactly it. The chance you get it right both times is small, and it's far from a given that the first timing to sell will be the right one. People always forget that on average the market goes up during recessions, as it's forward-looking and institutions tend to sell out when they see a recession coming and then start to ease in again when it hits. This easily could be another one of those, where now that the recession has hit the market will go up again while the economy suffers for a few more quarters.\n\nSelling everything, even if you know 100% sure that a recession is coming, could easily mean that you sell near the bottom and get stuck trying to wait for another drop while the market continues to rally. It seems safer than holding through a recession, but that's far from a given.", "score": 3, "replies": []}]}, {"body": "investing as retired is way harder than investing for retirement, as you can't just cost average :)\n\nThat being said, problem right now is that both stocks and bonds are threatened by rising yields. So bonds are bot the usual safe haven. \n\nThis means that a \"balanced\" portfolio should contain something else,  if these two will start to become correlated moving downward.\n\nOther assets that might work to anchor 10-30% of your portfolio might be:\n- cash\n- some commodities exposure\n- gold\n\ngoing all in cash is as risky as going all in bonds or stocks in a way. Because you need to time the market.\n\nSo you might want to pick 3 or 4 of these asset classes, settle to some ratios: (mostly these should substitute partially the bond side) ... and then rebalance regularly.\n\nRebalance regularly is the key here. \n\nI am doing more speculative trading, but for my wife I devised a strategy with 5 etfs, one of which is gold and the others stocks with different world exposure (we are much younger)  ... and for the last years her portfolio stayed rock solid.", "score": 2, "replies": []}, {"body": "I did (67).  I don’t feel comfortable waiting on 10 years to recoup my losses.  I’m in at about 10% right now.  Even if I’m late getting back in later I’ll still be better off.  Meanwhile, CDs, treasury Ibonds and cash.  Cash is losing to inflation but better 8% loss annually than 20%.  Some of it you should be prepared to buy near the bottom, even if you have to guess when that is.  Dollar cost averaging can be your friend here.", "score": 1, "replies": []}]}]}, {"body": "I'm 69,,, my personal opinion is the market with drop significantly and suddenly. There's just to many dead bodies floating to the surface.\n\nMy plan is simple, for now I am all cash, bank CD, simple stuff like that, FOR NOW.\n\nAfter the blood bath I will revisit my long term plans.\n\nBeyond that it's impossible to take any position long term.\n\nWe know there we will experience a crash,,,, the smart thing is to get out of the way and then revaluate after the dust settles", "score": 5, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": " your hearing needs to be checked 😉.\n\nSimple arithmetic will tell you after the coming Crash, stocks will be cheaper, right? That's the time you buy, and avoid all the pain.\n\nWhat your saying is,,, if you sell now, the plan is to buy back at a higher price. That means waiting many years as the stock market and economy recover and the price rises above what it is now.\n\nI think 🤔 you may want to revisit your long term investment plan.", "score": 1, "replies": []}]}]}, {"body": "A friend of mine pulled everything out near bottom of 2008 crisis, thinking it would continue lower, he still regrets that decision obviously...", "score": 5, "replies": [{"body": "Is your friend 84?", "score": 21, "replies": [{"body": "Smart comment, as it never makes sense to be fully invested if you actually need the money in the near future", "score": 5, "replies": [{"body": "Plus factors like giving your investments to loved ones after you pass can be at play", "score": 1, "replies": []}]}]}]}, {"body": "If I want to put into equity I check yields first. Oil, energy are fashionable is paying 7% ish.  AT&T(T), IBM lately is one not sensitive to latest market correction is paying 4.64%.", "score": 2, "replies": [{"body": "Might follow that up with payout ratio, don't want them to slash that dividend", "score": 2, "replies": []}]}, {"body": "Talk to an investment advisor....that is not your local branch rep btw.\n\nYour ask is too serious to get answers online.", "score": 2, "replies": []}, {"body": "Why are you asking advice from 15-30 yos on managing money they clearly do not have? Seek professionals.", "score": 2, "replies": []}, {"body": "Well you should have thought about asset allocation BEFORE the market tanked.  Is this money you need to pay bills minus $$ from SS, pensons, and/ or SPIA's?  If not then jus sit tight and let it recover.  Mind you that is if you are in index funds.  If not, then it just matter what companies (how speculative) you are holding.", "score": 0, "replies": []}, {"body": "OP, my family knew of a fairly wealthy retired doctor who had his money in the stock market during the 2008 crash. He went back to work part-time after seeing how much of his retirement savings went down. He passed away before the market recovered. \nIt was a sad thought in my mind to think of his circumstances. I was in my early 30s then. \nAtleast, this recession (if we’re going to have one), you’re not being caught off-guard like he was. \nIts OK to put your money into cash for atleast 6 months until we have certainty (of either an upcoming deeper recession or of a bottom already hit).", "score": 0, "replies": []}, {"body": "I recommend put 100% of your money in cash. If stock market  crashes more over next 6-12 months doller cost your money back into SP 500 index fund. Start putting money back in around the winter months or January next year.", "score": -1, "replies": [{"body": "Obviously, nobody should do this.  Timing the market is a fools errand.", "score": 4, "replies": [{"body": "Lol", "score": 1, "replies": []}, {"body": "Well what you think now ?", "score": 1, "replies": [{"body": "&#x200B;\n\nnobody should do this. Timing the market is a fools errand, and you are a fool if you think a short term market swing changes this", "score": 1, "replies": []}]}]}]}, {"body": "In regards to your age, and you‘ll properly not have the time to wait 10-15 years for a rate of return higher than 40%, you maybe keep it on you bank account if you really want to destroy now your interest on interest effect.", "score": 0, "replies": []}, {"body": "I would buy farm land to feed America real food, through what is to come . Google  ( Bill Gates buying up farm land) . I think something very nefarious is going on.", "score": -4, "replies": []}, {"body": "Too much missing information.  I keep cash on hand (24 months of expenses is my comfort level.  I live on the cheap well below my means.  I started off at 6 months in my younger days) so I am not put in a situation where I have to take losses.  Planning ahead seems to be what you missed or maybe not.  Depending upon needs put cash aside.  Hopefully this helps out others.", "score": 1, "replies": []}, {"body": "You should have both cash and passive income (dividends, interest) to preserve share count during an extended decline.\n\nAre you aware of what your assets produce in terms of passive income?  Are you taking these distributions today?", "score": 1, "replies": []}, {"body": "Better question is how good is your heart.", "score": 1, "replies": []}, {"body": "If you have not put money in [iBond, the 9.62%](https://www.treasurydirect.gov/indiv/products/prod_ibonds_glance.htm)inflation adj 180 days is too enticing not to investigate.  Those started before are getting a bit of 10% in safe dept of treasurey account.\n\nMost older folks are now into high dividend etfs getting 10-12% relatively safe corp etfs.  Most have also adjusted lately 10% ish.  But you are getting 10-12%.    [CD rates are paying 2.25% and more so things have changed a lot.](https://www.bankrate.com/banking/cds/cd-rates/)", "score": 1, "replies": []}, {"body": "VWAHX, take your tax free payments", "score": 1, "replies": []}, {"body": "Does social security cover enough of your fixed expenses like housing and food /gas ?.\n\nDo you have enough in your investments to buy a rental property (near a Starbucks) that could generate a few thousand dollars monthly and no taxes on rental Income FYI ?\n\nThere are many stocks that give out dividends which is another option.", "score": 1, "replies": []}, {"body": "I know this doesn't help you in any way, but I'm just amazed there are 70 year olds on Reddit. Hope I'll be as much with the times as you are today by the time I'm that age!", "score": 1, "replies": [{"body": "There’s lots of older people on Reddit.", "score": 1, "replies": []}]}, {"body": "Something very safe, maybe like VT", "score": 1, "replies": []}, {"body": "Spend it on noodles and birdseed", "score": 1, "replies": []}, {"body": "It all depends on what you need the money to do for you. Without knowing that it’s impossible to give good advice. \n\nExamples: \n\n1) do you need it to finance your lifestyle? \n\n2) if you don’t need it, then what is it for? (Children, grand kids, charity etc.)", "score": 1, "replies": []}, {"body": "I'm 130 years old and I'm thinking the same.", "score": 1, "replies": []}, {"body": "It's much better from an evolutionary and tax perspective to not sell and instead let your heirs inherit your stocks, whose cost basis would then be reset.", "score": 1, "replies": []}, {"body": "At 70, Just go to mexico and enjoy hookers and blow while its lasts.. Don't need much more!", "score": 1, "replies": []}, {"body": "If I was seventy and had a couple 100k stashed away, I would put 10-20% in Gold and Split the rest evenly between Berkshire Class B shares and VOO or a comparable SP500 etf.", "score": 1, "replies": []}, {"body": "Xx", "score": 1, "replies": []}, {"body": "Build a bond ladder.  Bond prices don't matter if you are holding until maturity.  Get in cash and wait a little.  The 3 month should go up.  Getting a guaranteed return right now at 70 is big even with short term bonds.", "score": 1, "replies": []}, {"body": "70? yes, go 100% dividends/corporate bonds", "score": 1, "replies": []}, {"body": "The silver lining now is you can actually get some decent yields in CDs and bonds.  If you are living off income in your portfolio or a portion of it, then you may be able to replace some dividend income with fixed income.  It all depends on your risk tolerance.  Inflation may be less of an issue for you than younger people as you may eat less, own your home, and not need to buy a car every few years.  Might be best to talk to a financial planner and let them lay out some scenarios for you in terms of how long your account will last and grow under your current holdings or a reduced equity portfolio.", "score": 1, "replies": []}, {"body": "Bonds.", "score": 1, "replies": []}, {"body": "I’m not a pro financial advisor so please don’t come back and said “you told me to”, but what I would do in your situation is this:\n\n1. Review my portfolio and make sure I don’t have any exposure to stocks I think wouldn’t survive a recession. If I do, I would sell.\n\n2. For each one of my large investments, I would reach out to an investment bank (BoA, Goldman, or any other big one who controls enough money to move the market) and ask for their analysts report on those stocks. Their reports are for sale, and can help indicate to you what they’re doing with their money. If they have a price target that’s significantly higher than where you are today, chances are they’re going to hold through the recession. I would dump any stock that _they_ aren’t keeping their money in for. Remember, they have the money to move the market, and if they and their buddies are all holding/buying, then the price has a great chance of going up.\n\n3. I would take the money from selling off the loser stocks and keep enough for living 1 year in cash. I would put the rest into an index fund that I think will do very well as we recover; maybe even a leveraged one.\n\n4. I’d move somewhere super cheap until the recession is over (maybe somewhere in South America or the Middle East). There’s no better time to enjoy a vacation and see the world.", "score": 1, "replies": []}, {"body": "I am retired at age 70 with 70% in equities 10 cd, 10, annuities, 10 cash. I don’t even touch my investment portion as of yet. Waiting for RMD to hit other than that living very well off Pension, SS, and a fun winter part time job. Take three nice vacations a year go to the beach, fishing, boating, a little dining out life so far is awesome. I invested I’d in VOO, VUG, VHT, VWIX, etc. in Vangard, Schwab, TRowe, Fidelity, Wasatch, Janus, ARK, with a lot of Green on the screen 👍😎moments and the pain of RED you wish you were dead moments 😱😂 but overtime the equities fight back😀. So you need staying power concentration and lots of sleepless nights to hang in for better days but with the crazy Putin and the finger on the button it may be all for nothing. This POS can start Armageddon overnight which is very likely 🥵🔥", "score": 1, "replies": []}, {"body": "We are already in a recession and champions don't sit on the sidelines.\n\nThis is one of the rare times I suggest a professional. There is just to much to unpack here.", "score": 1, "replies": []}, {"body": "Plastics, Benjamin. That’s the future.", "score": 1, "replies": []}, {"body": "You should definitely talk to a professional fiduciary specifically for estate planning.\n\nYou may safe yourself and potential hairs a bunch of taxes.\n\nEg. If you have equity with a very loose cost basis, instead of selling and pay capital gains tax, instead, use them as collateral to take out a loan.\n\nWhen your beneficiary inherit, the cost basis will be reset.\n\nDefinitely not financial advice! \nDo not try this at home!\nWatch John Oliver instead\nhttps://youtu.be/gvZSpET11ZY", "score": 1, "replies": []}, {"body": "Under your old mattress.  I wouldn’t trust this Wallstreet run Ponzi scheme for a second.", "score": 1, "replies": []}, {"body": "Unless you have some rock-solid lock on a pick (long or short), stay the fuck away from the risk.\n\nThis is absolutely not the market climate you want to be speculating in, unless you're loaded and have money to burn on gambling.", "score": 1, "replies": []}, {"body": "I moved my money out of equities and rotated it to commodities especially physical silver not ETF s  as it's hugely undervalued. Ii do own some oil and general commodities funds but the safest place to be are the precious metals to weather this inflation storm", "score": 1, "replies": []}, {"body": "Make the decision yourself given the pertinent details shown to you. Do you really believe a recession is coming? For me I believe yes. Recession does bring plenty of new opportunities though. May I introduce you to shorting.", "score": 1, "replies": []}, {"body": "Have you looked at Vanguard’s targeted retirement funds? They are intended to fix such problems and are the same ultra-low-fee types of funds that made Vanguard well known.", "score": 1, "replies": []}, {"body": "Consider a switch to income investing (dividend investing). Assuming your stock investment worth is enough to make a living off the dividend then this is the usual approach for retirees. At least for me anyhow.", "score": 1, "replies": []}]}
{"title": "LOCAL NEWS Big chain stores have too much inventory, consider new way to handle returns", "selftext": "\" \n\n**MIAMI** (CNN) -- The chaotic mix of record fuel prices and an unending supply chain crisis have retailers considering the unthinkable: Instead of returning your unwanted items, just keep them.\n\nIn recent weeks, some of the biggest store chains, including Target, Walmart, Gap, American Eagle Outfitters and others have reported in their latest earnings calls that they have too much inventory of stuff ranging from workout clothes, spring-time jackets and hoodies to garden furniture and bulky kids' toys. It's costing them tons of money to store it.\n\nNow add on to that glut another category of product that stores have to deal with: returns.\n\nSo instead of piling returned merchandise onto this growing inventory heap, stores are considering just handing customers their money back and letting them hang onto the stuff they don't want.\n\n\"It would be a smart strategic initiative,\" said Burt Flickinger, retail expert and managing director of retail consultancy Strategic Resource Group. \"Retailers are stuck with excess inventory of unprecedented levels. They can't afford to take back even more of it.\"\n\nReturned products are handled in a number of different ways, he said. Retailers take back merchandise from the customer, evaluate it, and if it's in good condition put it back on the shelf at the same or lesser price.\n\nThey can refurbish damaged returns and sell them for less or offload them to liquidators to resell. They also can sell returned products to foreign liquidators for sale in Europe, Canada or Mexico.\n\n\"Given the situation at the ports and the container shortages, sending product overseas isn't really an option,\" said Flickinger. Lastly, retailers can hire third party firms to handle all aspect of merchandise returns for them.\n\nEach of these options, however, tack on additional costs for retailers, he said.\n\n\"For every dollar in sales, a retailer's net profit is between a cent to five cents. With returns, for every dollar in returned merchandise, it costs a retailer between 15 cents to 30 cents to handle it,\" said Flickinger.\n\nThere is one other option for retailers to address returns while avoiding more product bloat and that's to consider a 'returnless return,' said Steve Rop, chief operating officer with goTRG, a firm that processes over 100 million returned items annually for companies like Wal-Mart, Amazon and Lowe's.\n\n**Just keep it**  \nRop said his company's clients are 100% considering offering the \"keep it\" option for returns this year, although he wouldn't disclose if any of his customers have implemented the \"Keep it\" returns policy yet.\n\nIn some instances, when they determine it would be easier, some retailers advise customers to just keep or donate their return after issuing a refund. \n\n\"They're already discounting in stores to clear out products but, when there's heavy discounting, buyer's remorse goes up. People are tempted to buy a lot to only return it later,\" he said.\n\nRefunding customers while simultaneously letting them keep their returns isn't a new practice, said Rop. \"It started with Amazon several years ago,\" he said.\n\nThe offer makes sense for some types of products -- lower price-tier bulky items like furniture, kitchen appliances, home decor, baby chairs, walkers, strollers where it's costly for the retailer to cover the shipping cost for the return.\n\n\"Other products like kids' toys, footwear, towels, and bedding raise sanitary concerns when it comes to returns. It could also apply to these categories,\" he said.\n\nAnother concern with cheaper items: Stores typically discount returned products, so the amount of money they can make on an inexpensive return is miniscule -- and may not be worth the tradeoff, says Keith Daniels, partner with Carl Marks Advisors.\n\nStill, a \"keep it\" policy has its own disadvantages, namely: Companies will need to ensure that they don't become victims of fraud.\n\n\"One thing retailers need to track and ensure is that customers that become aware of the \\[Keep it\\] policy do not begin to abuse it, by seeking free merchandise over a series of orders by getting a refund but getting to keep the merchandise,\" said Daniels.\"\n\n&#x200B;\n\n[https://www.cbsnews.com/miami/news/big-chain-stores-too-much-inventory-customers-keep-returns/](https://www.cbsnews.com/miami/news/big-chain-stores-too-much-inventory-customers-keep-returns/)", "id": "vmrrcb", "created_utc": 1656434933.0, "score": 140, "upvote_ratio": 0.9, "num_comments": 91, "comments": [{"body": "Yeah this is not happening. I’m sure no one will abuse this system and keep getting free shit.", "score": 169, "replies": [{"body": "This actually happened to me with Target. I ordered a dress that my girlfriend already had. When I realized I forgot about it and let it sit. I went back into the app to do a return. I think I had the option of an online or instore return. I did the online and they just told me to keep it, donate it, etc. \n\nI have a Target card so essentially they know everything I’ve purchased and I’m sure they keep track of returns for abuse.", "score": 57, "replies": [{"body": "Wayfair too.  If you have an item that’s damaged, and show them, they’ll first offer you a 10-20% discount and if you say no, they’ll say donate it and refund you the money.  Not worth the shipping to have furniture sent back.", "score": 14, "replies": [{"body": "We had a desk that was missing parts when delivered. They sent another desk to us for free and no need to return the old one.", "score": 3, "replies": []}, {"body": "I think that’s specific to Wayfair’s business model though. They drop shop garbage from suppliers with poor quality control, and their entire business model relies on not paying for warehouses, so what are they gonna do with returns?", "score": 1, "replies": []}]}, {"body": "Yep. Stores ban people who abuse the return system.\n\nWhen you think about it, almost nothing gets returned. People who do a lot of returns are abusing the system.", "score": 1, "replies": []}]}, {"body": "Target has been doing this for years. Amazon does it sometimes", "score": 13, "replies": [{"body": "Amazon always does it for some products. Batteries for example, they will never have you return them from my experience.", "score": 2, "replies": [{"body": "Car batteries?? 🤔 nice!", "score": 1, "replies": []}]}]}, {"body": "Chewy has done this for years.  No one wants dog food that has been shipped to someone's house so they ask you to donate it to a shelter.", "score": 8, "replies": []}, {"body": "This is actually par for the course with online retailers. I work for a company that has a threshold. It’s not even worth dealing with restocking items under 25$. It takes serious manpower and extra shipping costs, and customers fuck up returns all the time, sending in damaged stuff that can’t be resold anyway, shipping things they didn’t buy from us, any number of things that basically make reselling the item impossible. So we write it off.", "score": 8, "replies": [{"body": "[It's a write off you say?](https://youtu.be/XEL65gywwHQ)", "score": 11, "replies": [{"body": "You don't even know what a write off is", "score": 4, "replies": [{"body": "But they do, and they’re the ones writing it off!", "score": 3, "replies": []}]}]}, {"body": "Yup, at Amazon we were getting back pennies for every dollar worth of inventory liquidated.", "score": 1, "replies": []}]}, {"body": "Many retailers ban you very quickly with returns especially Amazon .\n\nMy gf got a 2 year ban from nordstroms for returns . Early days of a fashion influencer with a 90% return rate", "score": 5, "replies": [{"body": "My wife orders like 3 things a week from Amazon and returns 2 like clockwork.  Been doing it for years.  Never had an issue.  I have always told her they might but she just keeps ordering", "score": 2, "replies": []}]}]}, {"body": "wrong squeal imagine sable jobless whole violet retire elderly scale\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 46, "replies": [{"body": "From my understanding many of have mentioned and scared to see what will be lower. Clothes is probably coming then home goods", "score": 7, "replies": [{"body": "I have no idea what this means in terms of why goods have not dropped in prices", "score": 8, "replies": [{"body": "Because people still pay the current prices.", "score": 4, "replies": [{"body": "Then why is there excess inventory?", "score": 4, "replies": [{"body": "That just means there’s an extended time line for them to be sold. It isn’t perishable goods…they’ll hold and sell at the same price and the donkey population will continue paying.", "score": 0, "replies": [{"body": "Why would retailers manufacture excess inventory though? That would require extra storage which costs money\n\n\n\nBusinesses forecast and estimate how much they will sell and adjust their production numbers accordingly. **It sounds like they sold less than they expected to sell**", "score": 1, "replies": [{"body": "Isn’t it saying these are big chain stores with excess inventory, not manufacturers?", "score": 1, "replies": [{"body": "The stores like h&m, gap, etc tell the manufacturers how much to produce and pay them accordingly", "score": 1, "replies": []}]}]}, {"body": "This is untrue. Especially in retail.", "score": 1, "replies": []}]}, {"body": "Because prices are still high in retail. No one is buying things that they overstocked on.", "score": 1, "replies": [{"body": "Schrodingers price tag.", "score": 9, "replies": []}, {"body": "But the guy before you said customers are still buying at current prices", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "This whole thread makes no sense. If you don't know what you're talking about, don't even attempt at answering the question", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "Maybe they need to drop prices and hit a equilibrium price", "score": 1, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "I just want to know the truth tbh", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Then why is there excess inventory?", "score": 1, "replies": []}]}]}]}]}, {"body": "All over stocked after supply chain issues past two years. No they have supply , but the economy is slowing", "score": 1, "replies": []}]}]}]}]}]}, {"body": "It'll depend a lot on what the product is. If your margin is only 15% on an overstocked product you'll try a lot options before cutting price and taking a loss. \n\nBut yes, if it doesn't change we should start to see deals again. Fingers crossed at least.", "score": 1, "replies": []}]}]}, {"body": "They will.  Like next year when things go on clearance because they can't sell last years model.", "score": 4, "replies": [{"body": "I said this but ppl in this thread are saying I'm unaware of what I'm discussing.\n\nI worked in retail(for years) and these ppl still don't believe I know what I'm talking about.", "score": 1, "replies": []}]}, {"body": "Anecdotal, but I've seen some pretty good sales lately on summer clothes at the mall. The sale prices are better than what the retail prices were pre-pandemic.", "score": 2, "replies": []}, {"body": "THIS^", "score": 1, "replies": []}, {"body": "Inflation, actually some things are going down. Junk you don't need will go down in price some. Food will go up", "score": 1, "replies": []}]}, {"body": "Here's a crazy idea, let the economics of supply and demand dictate. If you have too much stuff and want to sell it quick, LOWER THE PRICES!! This might even help lower inflation, who knows...", "score": 31, "replies": [{"body": "Behold the insane lengths companies will go to in order to keep price gouging.\n\nDemonstrates why prices are sticky, once they learn they can get away with charging you more they won’t go back until competition literally forces them to.", "score": 28, "replies": [{"body": "The other way applies. Once price stabilizes at some general level its hard for it to move up or down significantly, and manufacturers that moves priced based on small fluctuation everyday would just get themselves decimated, except for essential stuff like gas and food probably.", "score": 3, "replies": []}]}, {"body": "[removed]", "score": 0, "replies": [{"body": "Huh? Supply side economics meaning government policy promoting supply increases or the theory of supply and demand? The latter has not gone anywhere.", "score": 2, "replies": [{"body": "[removed]", "score": 4, "replies": [{"body": "Desktop version of /u/d0rsett's link: <https://en.wikipedia.org/wiki/Supply-side_economics>\n\n --- \n\n ^([)[^(opt out)](https://reddit.com/message/compose?to=WikiMobileLinkBot&message=OptOut&subject=OptOut)^(]) ^(Beep Boop.  Downvote to delete)", "score": 1, "replies": []}, {"body": "That's what I assumed you meant but just wanted to check. My point was I don't see how anything the parent comment was saying had to do with supply side economics. I think he was simply saying that market forces will inevitable lower prices, nothing about tax cuts or corporate welfare.", "score": 1, "replies": []}]}]}]}]}, {"body": "Would a company like $Wish be useful for overstock", "score": 8, "replies": []}, {"body": "Or I don't know....maybe start donating all these items they are spending money storing to those in need?\n\n**Clothes?** Homeless and Domestic Violence shelters\n\n**Personal Care products?** Homeless and Domestic Violence shelters\n\n**Toys & electronics?** Foster and Group homes\n\n**Cleaning Products or Food?** Community Pantries or Group Homes\n\nThis is really not brain surgery.", "score": 19, "replies": [{"body": "That sounds all warm and fuzzy, but even if they were to do that there's still a period where the products need to be staged and transported which will be an expense they don't want (can't?) bear.", "score": 18, "replies": []}, {"body": "Who pays the logistics of holding and shipping? It isn't brain surgery so you must have ALL the answers", "score": 15, "replies": []}, {"body": "That would only make the problem even worse. It would add another entity, which could also fumble the item in another delivery and you incur in even more costs. The cheapest way is just to throw the item away, which is why the policy is for the customer to keep it.", "score": 8, "replies": []}, {"body": "Food pantries and shelters turn down donations all the time because they don't have room for it or enough labor to distribute it.", "score": 4, "replies": [{"body": "I know. I volunteer at a homeless & domestic violence shelter for women and families regularly in a major metropolitan area (Downtown Miami).\n\nThey struggle having enough trained help to sort their donations, but the things I listed above never stop being needed.\n\nHonestly, the clothes alone would be a godsend as most women fleeing abuse leave with nothing but the clothes on their back to get out in the middle of the night or when their partner goes to the store.\n\nThe labor and transport costs of all those returned clothes to empty the warehouse is probably less than 6 months of the rent for warehouse space in a major transport hub metro.\n\nAs a long-term bag-holder of GPS that scooped up several thousand dollars of shares in March 2020 I would happily see a solution that sees those clothes donated to such shelters and reduces the enormous storage costs of commercial warehouse rent and that they can then use to advertise their community involvement for intangible good will towards the brand.", "score": 0, "replies": []}, {"body": "Many charities prefer that you donate cash instead of products.\n\nFood shelters for example, while they accept food donations, would much rather you donate cash to them for various reasons.\n\n* The food shelters can usually buy a lot more food with the same amount of money then you can by shopping at some local grocery store or big retail chain.\n\n* Food donations tend to be heavily skewed towards certain types of foods (i.e. canned goods that can sit around for months unopened) versus other types of foods that are also needed for a healthy diet (i.e. greens, and stuff that spoil more quickly).", "score": 1, "replies": []}]}]}, {"body": "Except for Putin and gas gouging there isn;t much infglation left.  I just went grocery shopping and most items were normal priced, only a few were still at elevated prices.", "score": 8, "replies": []}, {"body": "In other news, people across the world have all come to the same realization that they don't want anything they've ever bought from a big box retailer.", "score": 4, "replies": []}, {"body": "Puts on $ovsk", "score": 2, "replies": []}, {"body": "I think I’ll be returning everything I buy", "score": 2, "replies": []}, {"body": "“Here is a gift card keep it and buy something else and more shit while your at it” …is this there angle?", "score": 2, "replies": []}, {"body": "What if we as consumers learned to just consume less and be more responsible overall keeping in mind economic and environmental costs? Oh wait! 😂", "score": 2, "replies": []}, {"body": "It's interesting reading on reddit how the supply chain \"is fucked for the next few years\" and then reading articles like this.", "score": -11, "replies": [{"body": "This is part of supply chains being fucked...", "score": 22, "replies": [{"body": "I was more of referring to all the doomers saying that shelves would be empty and start a new depression.", "score": -5, "replies": [{"body": "That could still happen.  The ports are still backed up, trucking is a nightmare and diesel prices are causing a lot of smaller companies to fold.  It's one thing to get an order or furniture or electronics a few months late.  It's quite different when you're talking about produce and other perishable goods.", "score": 2, "replies": []}]}]}, {"body": "This is a different position of fucked. Read up on the \"bullwhip effect\". We're in the stage now where previously spiked consumer demand has sharply dropped off, was not forecasted, and piles of inventory are burning holes in pockets and going to waste. So early on it was customers being fucked, now it's the retailers getting it.", "score": 10, "replies": []}, {"body": "Don't listen to these bears with their fancy doomsday terminology. They are betting on doom. Redditors are especially some pessimistic depressed sons of bitchez. When the retailers put all this overstock on sale, buy buy buy. I see this as a positive, just like the cheap hotels and stocks in 2020. Let these people sit on their cash like cowards.", "score": 1, "replies": []}]}, {"body": "Highly irresponsible to publish these artciles imo. Now you will have an even larger demo trying to game/steal stuff from stores. It was bad enough with the thieves who make it their day job currently.\n\nI feel like this is just encouraging people to try to scam stores by telling them \"its okay, the stores allow it\". Its sickening imo. \n\nA demographic who wouldnt normally try something like this, now have been told by articles in \"trusted\" news sites that \"its okay to try and steal, stores want to do this to get rid of stock\".", "score": -2, "replies": [{"body": "First of all, boo hoo, the Walton family are going to lose a few hundred bucks to a middle class family who got a few free shirts? Cry me a river. Second of all, others in this thread have pointed out these companies ask for your phone number when you return stuff and can easily ban you if you abuse the system.", "score": 2, "replies": []}]}, {"body": "Uhhh why are you stocking stuff nobody wants. Stock the stuff people want … duh. \n\nI refuse to believe this given brick and motor across all of our purchase areas has pushed us away to online retail over the past two years. \n\nOr, perhaps they have not adjusted ordering for the new purchasing climate.", "score": -4, "replies": [{"body": "Probably the latter, or more accurately they over adjusted for the problems recently.  Some retailers over-order from distributor during time where allocation is spotty just to get something; I.E., they order 100 of a thing expecting to get 30, because if they order 30, they might only get 10.  So they order 100;. This works for a short while while things are difficult to fulfill; it usually ends in a glut, however, as distributors see those orders as actual demand, and not just retailers gaming the system.", "score": 3, "replies": []}, {"body": "Stores order months in advance. In the case of Target 6 months to 1 year. That's why they currently have stock they have to liquidate. They werent able to read future demand/inflation/climate correctly.", "score": 1, "replies": []}]}, {"body": "Then u hear & see stores can’t get inventory or shelves r bare?", "score": 1, "replies": []}, {"body": "I’m sure the companies will record the returns as a bad debt expense or a loss for accounting purposes and with the gift card they give you as a refund they’ll report that as income once you do spend it. \n\nCooking da books", "score": 1, "replies": []}, {"body": "Incredibly frustrating that we are in this situation.", "score": 1, "replies": []}, {"body": "Cue the scalpers…I mean scammers.", "score": 1, "replies": []}, {"body": "Maybe they can encourage consumers to send the item to a charity, and get a tax break from it. This way everyone is happy.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "vmv6x3", "created_utc": 1656443481.0, "score": 0, "upvote_ratio": 0.47, "num_comments": 95, "comments": [{"body": "I'm like 80% sure I saw Bezos begging for change on the highway by my house", "score": 137, "replies": [{"body": "puts on amazon.", "score": 16, "replies": []}, {"body": "That was me, sorry", "score": 6, "replies": []}, {"body": "I’m waiting for that documentary “Bezos from space to peasant”", "score": 3, "replies": []}]}, {"body": "Short term - who the fuck knows\n\nLong term - they will be fine", "score": 88, "replies": [{"body": "Longer term - all companies are doomed to fail", "score": 5, "replies": [{"body": "Long term in the investing world is 20-30 years.\n\nLonger term the world will end but that’s not a realistic time horizon for investing.", "score": 4, "replies": [{"body": "There is a class of investing above the mere mortals where you do invest in 100 year or even century time scales. It’s for Institutions.", "score": 3, "replies": [{"body": "So you’re saying those companies won’t fail? Lol\n\nAnd yes I’m aware of longer term, like the 1000 year bond issued by Danish company Orsted.", "score": 2, "replies": [{"body": "I said they will fail, guaranteed.", "score": -1, "replies": [{"body": "Everything that lives, dies eventually", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "Doomed? They own AWS, just the biggest cloud computing platform on the planet today. In the long run they'll be fine.", "score": 27, "replies": [{"body": "azure\n\ngcp", "score": -6, "replies": []}]}, {"body": "Well that's funny because no one really knows", "score": 21, "replies": []}, {"body": "Well they are spending $5B on a second HQ so sounds like Amazon themselves are bullish", "score": 12, "replies": []}, {"body": "You are playing the options game yet are asking Redditors for their opinion on which way the stock is going to go.  Is this WallStreetBets?", "score": 66, "replies": [{"body": "Yea..how dare you ask someone their opinion about Amazon when this space is NOT dedicated to talking stocks. This page was intended for ....ummm....well...NOT STOCK TALK!!!", "score": 5, "replies": [{"body": "[removed]", "score": 5, "replies": [{"body": "I only talk about total multiverse mutual fund, total world has too concentrated risk in one world.", "score": 3, "replies": []}]}, {"body": "Of course this place is for stock talk.  But asking Reddit \"So, up or down on this one?\" after having bought options is a bit dumb.", "score": -2, "replies": [{"body": "He wanted to see what we thought. WTF is wrong with that? Isn't that what we do here? Jesus", "score": 7, "replies": []}]}]}]}, {"body": "I have vivid memories about the sentiment around Apple in 2015. \"They lost their way\", \"No innovation\" etc. it was trading around 90$ (pre 1/4 split, mind you) when Buffet got in. I think the sheer size of Amazon and its divisions is hard to grasp and these Mega-Corps are much, much more resilient than one might think.", "score": 10, "replies": [{"body": "I sold my shares back then at 100$ (pre split) 🙃", "score": 4, "replies": []}]}, {"body": "Uhh Amazon doomed sounds a bit premature no? 😆", "score": 14, "replies": [{"body": "*... mumbles in Sears*", "score": -13, "replies": [{"body": "Seems like a reasonable comparison lol", "score": 2, "replies": []}]}]}, {"body": "Everyone orders from Amazon, and AWS is still very effective. \n\nI don't see them going anywhere.", "score": 5, "replies": []}, {"body": "most attractive big cap there is imo", "score": 15, "replies": [{"body": "META imo\n\nEdit: Come on lads. Feel free to discuss, but don't just silently downvote me to oblivion for stating my opinion. I'm well aware of the potential risks that come with getting into META, as everyone considering it should be, but I still think it's up there is the most attractive big tech play.", "score": -7, "replies": [{"body": "meta has business risk that amzn doesn't", "score": 7, "replies": [{"body": "It certainly does. AMZN is nowhere near risk free, but risk is bigger and potential headwinds are more relevant for META. I believe the potential, the realistic upside outweighs that, however. I own both AMZN and META, just for the record.", "score": 2, "replies": [{"body": "agree, same", "score": 1, "replies": []}]}]}]}]}, {"body": "You know how I know the market still has room to fall?\n\nGuys like this are buying options and asking Reddit what the stock price is going to do.\n\nSo much dumb money in the market that still needs flushed.", "score": 9, "replies": []}, {"body": "I feel for ya. I'm holding a CSP at $121 :( I keep rolling it forward hoping that as time passes the problem will correct itself. Between AWS and eCommerce and the market in general improving, I'm hanging in there.", "score": 3, "replies": []}, {"body": "This seems like it could be a buy signal...", "score": 3, "replies": []}, {"body": "You do realize Amazon was trading at an effective price of 190. So yeah, 120 is in the realm of possibility, but with rates rising who is to say when that happens.", "score": 3, "replies": []}, {"body": "Has anyone stopped ordering shit from Amazon . There is another thread talking about them crushing morning pill sales.   Anyone stop using their servers. \n\nThey will blow back up, it might be a a year.", "score": 3, "replies": []}, {"body": "Hi\n\nLet me see.  I still shop at Amazon, I still have Prime Video, my work still use AWS.  ![gif](emote|free_emotes_pack|facepalm). Let me think, Revenue looks fine to me.  Price is now cheap.", "score": 3, "replies": []}, {"body": "Any \"solid\" consumer discretionary stock that has taken a beating is the best sign of a recession close by.", "score": 5, "replies": []}, {"body": "It can even fall below $100. When I saw Bezos wiped his hands off a year ago. He hinted there was a diminish return in retail and wanted to move on to other things with higher margin. My call got exercised at 121 by accident so I should be cheering now.", "score": 3, "replies": []}, {"body": "You have bought it ≈40% below it's all time high, you are good. Don't listen to Redditors, if market is green the Redditors will be acting as if we solved all the problems and when it ends in the red everything a doom.", "score": 3, "replies": [{"body": "The ATH or how much below he bought it is entirely irrelevant for the future.", "score": 2, "replies": []}]}, {"body": "Monopoly plays fair well", "score": 2, "replies": []}, {"body": "Will eventually go back up, but they definitely peaked during covid.", "score": 2, "replies": []}, {"body": "Will it ever recover? Probably. When? No one knows. Amazon has far more headwinds than tailwinds right now. Their growth is going to cost more and more to gain fewer and fewer sales. Going from 2 day to same day shipping is a huge logistics feat and won't be cheap. How many more customers will it get them? What is their path to more growth? All this is an environment with declining consumer spending. \n\nThey are trying to run their own delivery fleet, both of trucks and planes. Very expensive. They also require a huge workforce at a time when labor is scarce, and probably not improving any time soon. \n\nAWS is great, but facing competition. How long can AWS carry the stock?\n\nAll this, and it's trading at 50x earnings at a time when multiples are contracting.", "score": 2, "replies": [{"body": "You forgot like 10 other business lines", "score": 2, "replies": [{"body": "Didn't want to do a tldr length post. The gist is still there.", "score": 1, "replies": []}, {"body": "Shhhh, you’re interrupting story time.", "score": 1, "replies": []}]}, {"body": "Well said.", "score": 1, "replies": []}]}, {"body": "For starters they could treat their employees better…", "score": 2, "replies": [{"body": "Whoa, take that guppy nonsense outside of this pool here! Only shark talk during late stage capitalism please", "score": 2, "replies": []}, {"body": "It ain't gonna happen. This is modern slavery and it is not going away anytime soon.", "score": -9, "replies": [{"body": "Oh please.  This is a slap in the face to actual slaves.  Amazon might underpay and might have bad working conditions, but don't compare it to actual slavery.", "score": 11, "replies": []}]}, {"body": "Yeah. Most very successful companies could. But if they did, chances are they wouldn't have gotten where they are. They benefit from exploiting their employees. \n\nWelcome to capitalism. A cruel game where we are fortunate enough to sit on the sidelines and make money off that system.", "score": -5, "replies": []}, {"body": "They treat their employees fine. All the warehouse workers and delivery drivers aren't really amazon employees, they're 1099 \"contractors\".", "score": -6, "replies": []}]}, {"body": "I live rural and used to spend a large portion of purchases on Amazon,  but rarely buy much anymore.  Shopping on Amazon has gone to garbage.   Lost the customer focus and now all they care about is collecting sponsored product advertising dollars. \n\nAs for the stock,  it seems like they keep trying to grow by entering low margin business where they are at a disadvantage.   A whole foods competitor, why?  Operating their own delivery fleet because they have a competitive advantage over UPS and FEDEX,  I doubt it. A streaming service in a world overflowing with streaming services?\n\nI think they have a long way to fall.", "score": 0, "replies": [{"body": "I won’t argue about the products/shopping experience but 1) they bought Whole Foods. 2) they operate their own fleet obviously to save $ and deliver faster. Not saying they don’t screw over their drivers, they definitely do. 3) AWS 4) prime is definitely one of the better streaming services imo.", "score": 4, "replies": []}, {"body": "They literally own Whole Foods….", "score": 2, "replies": []}, {"body": "They don't operate a fleet. They farm out the service to gullible freelancers with a predatory contract that makes them pay Amazon to escape.", "score": 2, "replies": []}, {"body": "AWS.", "score": 1, "replies": [{"body": "AWS is just like Amazon when they had near market dominance or monopoly in e-commerce. \nThe other guys are catching up. \nIn the near future it will rise, then stall and ultimately fall.", "score": 0, "replies": []}]}]}, {"body": "The whole union angle is a big deal for them", "score": 0, "replies": [{"body": "Have you seen the guy in charge of the union?", "score": 1, "replies": [{"body": "Sure but the movement gaining steam could be a problem for them.", "score": 4, "replies": []}]}]}, {"body": "Short-term I could see it fall, even below 90 tbh. Long-term I'm fairly certain they'll do decently fine. $115 by June 2023? Very strong \"maybe\" from me.", "score": 0, "replies": []}, {"body": "[removed]", "score": 0, "replies": [{"body": "Between the username and the post it’s hard to know what to lol at first", "score": 1, "replies": []}]}, {"body": "Nah pretty sure it's just a slow trip to zero from here. Make sure you put your puts far enough out though.", "score": 0, "replies": []}, {"body": "During recessions companies try to pile on as much cash as they can. Look at companies like amazon, google, tesla, and other stocks that are doing splits during this time to raise cash so they can buckle down.", "score": 0, "replies": []}, {"body": "The cries of the bagholders... so deafening", "score": 0, "replies": []}, {"body": "Why would you buy calls for amazon. The indexes are in a bear market and this will last into 2023. We may get a bottom in a year or so. Your pretty much buying leaps during the worst time.", "score": 0, "replies": []}, {"body": "Amazon at $120? Wasn’t it like in the thousands not long ago?", "score": -1, "replies": [{"body": "They did a 20-1 split a few weeks ago", "score": 3, "replies": [{"body": "Ahh that makes sense thank you", "score": 1, "replies": []}]}]}, {"body": "I think Amazon is a great company and I considered buying when they were higher at $2900. Now I see bigger opportunities elsewhere. As much as Amazon has fallen, they still are among the highest PE stocks still out there. They are paying employees more and soaring gas prices are cutting into their already slim margins.", "score": 1, "replies": [{"body": "During inflationary times, a high PE needs impeccable justification. Amazon doesn't have impeccable. The PE will drop", "score": 2, "replies": []}, {"body": "judging amazon by p/e was the first mistake here ;)\nNoone knows what happens but at least try to understand how to value a buisness to make an educated guess. Might increase chances to be right by 2-3% 🫡", "score": 1, "replies": [{"body": "PE is a good start. I've looked at their financials and read through their 10k. I don't intend to write a whole investment thesis on here. One thing to think about: Amazon's revenue decreased by $20b last quarter. A temporary blip or not, how will this excite investors who would like to label this a high growth company? For me, I've found other investments. Long term, I think Amazon has a bright future.", "score": 1, "replies": []}]}]}, {"body": "I'm new to options but everything I see about risk management in the space says to cover yourself and make the profit from the difference in premiums.\n\nAm I missing something? From reading around reddit, it looks like no one covers themselves.....", "score": 1, "replies": []}, {"body": "Well, according to SEC filing 44.7 C, it’s illegal for AMZN to go below $100.", "score": 1, "replies": []}, {"body": "If s&p enters the 3500 zone, I plan on buying shares of amzn, gs and a few \"under valued\" blue chips. If inflation does start peaking next month, I see a possible re-bound into the end of the year. Still a big \"if\" though.", "score": 1, "replies": []}, {"body": "I think they showed resilience this last quarter in possibly the worst conditions for their business you could imagine (supply chain, absorbing inflation losses, and still profitable, if you add back 7B valuation adjustment loss back to net income, from their stake in Rivian).\n\nIf this is a correct observation (the idea being, the worst case scenario was last quarter, and we're expecting inflation and fuel prices to go out of whack now), then Amazon looks strong and it could still be a buying opportunity at $100 per share/$2000 presplit.\n\nThe risk comes form: how much more can their ecommerce penetration/market share can increase? It's at an all-time high at 56%  but it will plateau at some point. Walmart and Target have been very quiet in their ecommerce - it doesn't feel like it makes sense for the non-Amazon share to drop with them starting to invest more heavily into it. Amazon grew by having a dominant head start and many years to build out their fulfillment facilities with tepid competition that is now starting to ramp up.\n\nIf Amazon increases Prime membership more, they risk people leaving for Walmart and Target or just going to the store for the cheap stuff. It's already strikingly similar to Netflix model - are you really ordering enough to spend $15 a month on shipping? ie Prime is a household thing, you need 2-3 people in the family ordering to save more on free shipping and justify Prime cost.\n\nThe fact they made these capex investments, into logistics and fleet, this year, shows they're focusing on cost efficiency to find higher margins, is a really good signal. So they are avoiding hiking prime membership cost further.\n\nTheir relationship with labor is a problem. They will have to raise waiges which can leave them where they started in terms of margins improvement.\n\nSo kind of up in the air now. Cloud is growing well enough that AWS, Gcloud, and Azure are all growing at the same time. I would want to understand:\n\nAmazon's roadmap, and the roadmaps of Walmart and Target in their ecommerce. Then read the segment reports/guidance for Microsoft and Google for their cloud divisions, then build an understanding off of that.\n\nIt's possible for Amazon, Walmart, and Target to all deteriorate in their ecommerce, if the macro conditions don't improve. Amazon is at a multi-year high in shipping cost per unit, if it's more permanent it's going to lead to further derating due to worsening EBIT and free cash flow. And a worse surprise would be if there's softness in IT/cloud infrastructure spend. Far from doomed but feels like less growth/more competition in their major segments ahead.", "score": 1, "replies": []}, {"body": "AAPL will grow much bigger but I think Amazon will plateau. I used to work for amazon.  Growth for them is limited by shipping reliability and return policies.  They cannot expand beyond the first world. No one else has the shipping services.  AAPL can go anywhere and everywhere, and they are already there.", "score": 1, "replies": []}, {"body": "The stock dropped because of the huge miss in their ecommerce segment due to being over staffed. The catalyst here is pretty obvious. They just need to return their ecommerce segment back to profitability.\n\nOther catalysts would be yields moderating given that AMZN has a fairly high PE. Also stronger than expected AWS growth is generally seen favourably by investors.", "score": 1, "replies": []}, {"body": "The reality is that Amazon has it's hands in every pie. That does make it particularly robust. Will it thrive? I don't think so. Will it persist for a long time? I do think so. Growth will be steady but it's already hit it's economy of scale.", "score": 1, "replies": []}, {"body": "2025 sure will 100%", "score": 1, "replies": []}]}
