{"title": "Cramer just recommended one of my new stock picks...", "selftext": "But Warren Buffett is long. I bought Bank of America first a few weeks ago and was DCAing down, but then while I had CNBC on Cramer said in the background that he recommended BoA as a stock that will do well because of the rate hikes. I feel like I have to sell because Cramer hyped it, but Warren Buffett is long. This is the unstoppable force (of ruining stocks) vs the immovable object (of diamond hands). Hilarious dilemma.", "id": "vdxpwx", "created_utc": 1655418370.0, "score": 60, "upvote_ratio": 0.79, "num_comments": 101, "comments": [{"body": "SELL AT OPEN", "score": 121, "replies": [{"body": "I might need to. BoA bankruptcy announcement incoming.", "score": 42, "replies": [{"body": "[deleted]", "score": -22, "replies": [{"body": "Cramer recommended them, that's my source.", "score": 70, "replies": [{"body": "The funny part is that's not even a joke anymore. The man's got a touch the reaper would be nervous over.", "score": 27, "replies": []}, {"body": "Underrated comment right here", "score": 11, "replies": []}]}, {"body": "Trust Cramer bruh...he's ALWAYS wrong", "score": 11, "replies": []}, {"body": "r/whoooosh", "score": 1, "replies": []}]}]}, {"body": "XLE is -20% since Cramer said buy oil and don't touch anything else on June 6.", "score": 3, "replies": [{"body": "Horrendous, how does that man have a job.", "score": 1, "replies": []}]}]}, {"body": "Wait till you find out he recommends nvidia and amd", "score": 20, "replies": [{"body": "He already recommended AMAT, getting close to the semi space", "score": 6, "replies": [{"body": "I work for AMAT and I hate it that he recommended my employer", "score": 8, "replies": [{"body": "FACTS. my company is going through an acquisition and  Cramer had the CEO of the company that's buying us out and I didn't like what he had to say at all lol", "score": 7, "replies": []}, {"body": "He recommended mine, too. I had to dump ~10 years of stock built up in my stock purchase plan and option grants.    \n      \nTaxes sucked, but it was worth it. Their stock tanked a week or two after, as per classic Cramer.", "score": 4, "replies": []}, {"body": "I think it's a great company at an extremely compelling valuation tbf.", "score": 2, "replies": []}]}]}, {"body": "The dude was super bullish on NVDA last year. Was saying it's the next $1t dollar company, etc.", "score": 4, "replies": []}]}, {"body": "Buffet probably dumped today and you wouldn’t even know about it yet till it’s tooo late.", "score": 34, "replies": [{"body": "Oh man you're right...", "score": 15, "replies": [{"body": "Buy it on rumor sell it on the news", "score": 10, "replies": []}]}]}, {"body": "Ugh. I have BOA stocks. I always do the opposite of what Cramer recommends.", "score": 6, "replies": [{"body": "I try to do that too.", "score": 5, "replies": [{"body": "So he’s like Cathie Wood?", "score": 3, "replies": [{"body": "Exactly", "score": 2, "replies": []}, {"body": "But without Cathie's pal and next door neighbor, The Imaginary Big Guy.", "score": 1, "replies": []}]}]}]}, {"body": "I was doing awesome in oil until Cramer recommended it. Now I lost $2,000 in a week. I hate that POS. Luckily I know it is just profit taking and that the fundamentals are still solid so it is just a matter of waiting and avoiding margin calls as much as possible", "score": 5, "replies": [{"body": "Biden had a comment or two recently that XOM shouldn’t be at peak profits when aMeRiCaNs are struggling filling their tanks. Like w Amazon and Google, when politicians start targeting specific companies, level of risk increases, investors will consider taking some off the table. Does seem like a good time to sell though, it’s been quite a run and a very quick 15-20% gain is huge given just a few months. Put in cash and look for the next runner!", "score": 3, "replies": [{"body": "I don't think it is over. I sold at the recent peak and bought back in once it fell 5% as I was expecting the Chinese reopening to force oil levels up higher by July. I still do. We have a perfect storm brewing- Libya stopped producing, China is reopening, the US has little reserve capacity for oil, people want to travel more than ever and the Ukraine War is dragging on and on", "score": 2, "replies": [{"body": "Oil isn't over. Biden & Democrats are attacking energy companies & the dollar is strengthening. But what's really driving oil stocks & crude prices down is end-of-quarter window dressing. At the end of each quarter, when most institutional funds & managed funds have to report their portfolios, they sell the bad, dirty stocks that they've been making money on and buy the popular, nice stocks that they're supposed to be holding. \n\nI was expecting a massive stock dump at the end of June. Energy will rebound in July.", "score": 4, "replies": [{"body": ">I was expecting a massive stock dump at the end of June. Energy will rebound in July.\n\nVery good explanation of what seemed to happen today with the quad witching day. I was totally confused how the rebalancing could negatively affect stocks like the oil patch.", "score": 3, "replies": [{"body": "I think the dump is already happening. It may even be close to over. Oil has had a serious correction since about last Friday. Yet there are more and more indications that it should be heading back up to an even higher peak fairly soon, based on historical precedents I would think maybe mid-July. https://markets.businessinsider.com/news/commodities/us-gas-prices-to-surge-stockpiles-refineries-oil-rystad-energy-2022-6", "score": 3, "replies": [{"body": ">Yeah, I think this week oil will start moving back higher and the oil stocks along with it. At least that's my hope. I can't imagine why oil drops 8% and the oil stocks take a 20% dump. But I do think we could hit a peak sometime around the end of July and early August with demand starting to wind down from vacation season. I'll be looking at and evaluating. Either taking profits and waiting for a new entry point or exiting altogether. Again, just depending on how stable things look.", "score": 2, "replies": [{"body": "Oh I've been trading oil since like 2007 and that is the beauty of oil stocks. It works in both directions. A 20% increase can lead to 100% profits especially in small cap oil stocks. A 20% decrease can cause them to crater. So when oil is overall bullish it can literally double or triple your money with margin trading. I think a large part is due to the fact that oil has a basic overall cost for refining, storage and transportation, so increases to high levels don't really increase profits in a linear way but can increase them almost exponentially for companies. The reverse works for cratering prices like when futures went negative during COVID", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Wait for it to tank and then buy it.", "score": 9, "replies": [{"body": "id like to buy a tank", "score": 12, "replies": [{"body": "Same, I want a Sherman tank. I'd just park it on the lawn.", "score": 3, "replies": [{"body": "Puts on lawn", "score": 2, "replies": []}, {"body": "There's one in a little park in my suburb.  They put a little fence around it a few years back, as if that's going to stop the thing if anyone could start it (all fuel and hydraulics were drained over 20 years ago).\n\nPersonally, if I had one, I'd park it on my front lawn and put a sign in front of it--\"Go ahead, mess with this house and see if this baby can still do the job.\"", "score": 1, "replies": []}]}, {"body": "One could be useful in this environment", "score": 2, "replies": []}, {"body": "Go to Ukraine and buy one from the farmers.", "score": 2, "replies": []}]}]}, {"body": "No! Bear Stearns (BofA) is fine. Do not take your money out. If there’s one takeaway, Bear Stearns (BofA) is not in trouble.", "score": 3, "replies": []}, {"body": "You're fucked. They goin' under.", "score": 3, "replies": []}, {"body": "Focus on fundamentals, earnings rather than who says what.  Trust your research.  Good luck.", "score": 6, "replies": [{"body": "Thanks man, in seriousness I’m long on BoA. Great dividend growth and I think the fundamentals make it worth going long.", "score": 2, "replies": []}]}, {"body": "Selllllll", "score": 2, "replies": [{"body": "I might short", "score": 2, "replies": []}]}, {"body": "Selllllll", "score": 2, "replies": []}, {"body": "Sell immediately", "score": 2, "replies": []}, {"body": "You know the answer to this question. Cramer trumps everything. Sell!", "score": 2, "replies": []}, {"body": "Warren buffet is the master of Longs\n\nCramer is the master of getting paid to pump stocks on tv before they get dumped", "score": 2, "replies": []}, {"body": "Warren has ED he's not long, inverse Cramer", "score": 2, "replies": []}, {"body": "Just wash trade it with yourself. Boom! Dilemma solved.", "score": 2, "replies": []}, {"body": "I’m not positive but I thought Buffet sold his BofA position several months ago.", "score": 2, "replies": [{"body": "Nah that was all the Wells Fargo, BofA is his 2nd biggest holding.", "score": 1, "replies": []}]}, {"body": "Sell asap!", "score": 2, "replies": []}, {"body": "I never ever ever buy financials. Ever. Can go to zero overnight. CEOs get golden parachutes. Investors get nothing.", "score": 2, "replies": []}, {"body": "RIP", "score": 2, "replies": []}, {"body": "If you are trying to embrace the Buffett ethos, you should probably just DCA into VTI...", "score": 2, "replies": [{"body": "I do that mostly, but I like researching businesses and financials because I'm a nerd so I'm not uncomfortable picking a few stocks too.", "score": 1, "replies": []}]}, {"body": "That old man got it but things changed.", "score": 2, "replies": []}, {"body": "Shorting BOFA as we talk. Thank you for the DD sir.", "score": 2, "replies": []}, {"body": "Cramer recommended it?  Makes me want to Short it!", "score": 2, "replies": [{"body": "Going with a naked short is the surest way to destroy yourself in the market.  Unlimited downside.", "score": 1, "replies": [{"body": "Unless you are Michael Burry.   Or maybe shorting Cramer's recommended stocks.", "score": 1, "replies": []}]}]}, {"body": "Plenty of bank stocks are good buys right now. Honestly, Im not sure BAC is the best one, but it seems ok, they do share buybacks and everything and have a negative cashflow (a good sign for banks).", "score": 2, "replies": []}, {"body": "I get that the post is for fun, but in all seriousness I don't get why people pay any attention to what someone recommends or what someone's moves are. Sure, chances are they know more than you, but chances are also that your and their situation and portfolios are entirely different and that they're not telling everything they know or assume.", "score": 2, "replies": []}, {"body": "Thanks for the heads up,I’ll buy puts", "score": 2, "replies": []}, {"body": "RUT ROH", "score": 2, "replies": []}, {"body": "Dude. Sell!", "score": 2, "replies": []}, {"body": "I always thought the meme was to fade Cramer...", "score": 2, "replies": []}, {"body": "You're doomed lol", "score": 2, "replies": [{"body": "BofA is going to zero today, probably at open.", "score": 1, "replies": []}]}, {"body": "Sell sell sell", "score": 4, "replies": []}, {"body": "Should I short?", "score": 1, "replies": []}, {"body": "Oh god, he just said he doesn't find staying in index funds to be beneficial. Bogleheads, you've got a decision to make now too.", "score": 1, "replies": []}, {"body": "Nobody knows nothing but nobody knows anything at all.", "score": 1, "replies": [{"body": "Especially me lol.", "score": 1, "replies": []}]}, {"body": "not much of a dilemma.  sit tight and collect dividends.", "score": 1, "replies": [{"body": "Jokes aside, this is what I'm going to do. I'm buying into the decline, I do think that long term, banks profits will be bolstered by higher interest rates. Rate hikes means slowing lending, not no lending. I think the return on interest will make banks a solid pick. Not a 10 bagger, but that's not what it's about.", "score": 2, "replies": [{"body": "make sure to set dividend to reinvest.", "score": 4, "replies": [{"body": "Oh I did. Made that mistake once and didn’t notice for years lol", "score": 3, "replies": []}]}]}]}, {"body": "Keep DCA", "score": 1, "replies": [{"body": "I am, I think BoA is a good pick long term.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "He’s honestly fine, he gets it right, he gets it wrong but he’s pretty funny.", "score": 0, "replies": []}]}, {"body": "I bought Walls Fargo two months ago for this exact reason. “Banks do well with rate hikes” they said.\n\nGuess what, the entire thesis fell apart once people realized the entire economy is about to fall over because of those rate hikes. It’s one of my worst performing stocks this year and I don’t see it getting better. Never ever take the “experts” at face value.", "score": 1, "replies": []}, {"body": "Dude is snake oil and should be charged federally.", "score": 1, "replies": []}, {"body": "Im bag holding BoA!!", "score": 1, "replies": []}, {"body": "I wish all of you would realize Cramer isn’t wrong/unlucky. He’s rich for a reason. His job isn’t to recommend quality stocks to make the average person wealthy. His job is to tell the average person what his buddies have told him is about to tank so it has a pump, they sell and walk away with the average person holding the bag. \n\nTL;DR: Cramer isn’t bad at his job. His job is to convince boomers via the idiot box to give up their hard earned money providing liquidity to failing companies so his rich friends can make off with the silverware.", "score": 1, "replies": []}, {"body": "It almost feels like you're bragging about making a bad choice.  I'm confused.  You do realize that if Coke Rat Cramer is pushing it, you've made a huge mistake,...right?", "score": 1, "replies": [{"body": "I'm definitely not bragging, this is horrible. I picked it months ago, he recommended it yesterday, and now my account is going to get rekt.", "score": 2, "replies": []}]}, {"body": "Why would you buy any bank right now lol", "score": 1, "replies": [{"body": "Because I'm planning to own the shares for the next 10-20 years and I buy a few shares at a time as it drops.", "score": 1, "replies": []}]}, {"body": "‘Roblox is the best junior growth at 135 a share ‘", "score": 1, "replies": [{"body": "One of the worst stock picks of all time lmao", "score": 1, "replies": []}]}, {"body": "Buffett is no longer infallible.  He's made some big \"whoops\" buys in recent years.  You don't hear much about it because The Almighty Narrative says he's never wrong, and anything that contradicts The Almighty Narrative must be ignored or disregarded.\n\nI'm not saying, \"Don't buy it\", only that the Buffett imprimatur isn't the road to automatic success that it used to be.\n\nCramer, OTOH, should never be considered a cause for action.  Anything he recommends goes no farther than \"research this\" in my view.\n\nOf the big four banks, I own some JPM and I'm holding.  If I were to buy one of the four right now, it would be C.  I don't trust WFC or BAC one bit.", "score": 1, "replies": []}, {"body": "If Cramer agrees with you then you're fucked 😂", "score": 1, "replies": []}, {"body": "Guess buying BoA puts this week.", "score": 1, "replies": []}]}
{"title": "75 bips vs 8.6% CPI", "selftext": "", "id": "vdla83", "created_utc": 1655383822.0, "score": 2321, "upvote_ratio": 0.98, "num_comments": 95, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|51|**First Seen In WSB**|2 months ago\n**Total Comments**|506|**Previous DD**|\n**Account Age**|2 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=vdla83)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=vdla83)", "score": 1, "replies": []}, {"body": "Full video please lol", "score": 128, "replies": [{"body": "https://youtu.be/LSAXPzcFupM", "score": 63, "replies": [{"body": "[deleted]", "score": 30, "replies": [{"body": "I love it. \"Polite Rap\"", "score": 4, "replies": []}]}, {"body": "thank you lol", "score": 4, "replies": []}, {"body": "Based on the gif I thought this clip was gonna be a hoot but that scene was about 4 minutes too long.", "score": 2, "replies": []}]}, {"body": "![img](emote|t5_2th52|4258)", "score": 15, "replies": []}]}, {"body": "Best part is the opponent just standing at the side at the end letting him do his thing🤣", "score": 97, "replies": []}, {"body": "Me fighting my wife’s boyfriend after he drank my last hard Mountain Dew.", "score": 203, "replies": [{"body": "![img](emote|t5_2th52|8880)", "score": 30, "replies": []}, {"body": "There is such a thing as hard mountain dew? 😳 Must be illegal in Canada", "score": 14, "replies": [{"body": "I just found it recently in OKC. Cherry one and baja blast is good", "score": 10, "replies": []}, {"body": "vodka + anything = hard on\n\n&#x200B;\n\n![img](emote|t5_2th52|12787)", "score": 8, "replies": [{"body": "It has the opposite effect on me", "score": 2, "replies": []}]}, {"body": "It just gives you a stomach ache.  Don't believe the hype.", "score": 5, "replies": []}]}]}, {"body": "Say what you want but some of those shots are tight", "score": 50, "replies": [{"body": "All of them. \n\nAll of them are tight", "score": 20, "replies": []}]}, {"body": "Jerry Lewis was a comedic genius.", "score": 69, "replies": [{"body": "[Volcker doing a 500 bps raise would be like Brock Lesnar jumping into the ring and rear naked choking inflation](https://www.youtube.com/watch?v=FWcB9-SAYE0)", "score": 18, "replies": [{"body": "Lets do thiiiiiiiiiiiiisss!!!", "score": 4, "replies": []}]}, {"body": "I'm more of a Buster Keaton fan", "score": 6, "replies": [{"body": "Why not both?", "score": 8, "replies": []}]}, {"body": "Looks like he borrowed some moves from shemp Howard", "score": 2, "replies": []}, {"body": "Found the French person.", "score": 1, "replies": [{"body": "Not even close...", "score": 1, "replies": []}]}]}, {"body": "Getting Jim Carrey vibes", "score": 45, "replies": [{"body": "This be the OG: Jerry Lee.", "score": 28, "replies": [{"body": "I like his style ![img](emote|t5_2th52|4887)", "score": 3, "replies": []}]}, {"body": "I totally thought this was Jim Carrey and it was some skit on In Living Color. Lol", "score": 2, "replies": []}, {"body": "John Cleese all the way", "score": 1, "replies": []}]}, {"body": "His footwork though….", "score": 15, "replies": []}, {"body": "The 75 bpts of calm uncle Jerome Powell will knock the hell out of the jumping volatile market. \nOr\nIt will normalize it!", "score": 6, "replies": []}, {"body": "McLovin was favored in that fight I don't know what happened.", "score": 6, "replies": []}, {"body": "basically", "score": 4, "replies": []}, {"body": "This is some comedic gold 🪙", "score": 5, "replies": []}, {"body": "One of us, one of us…", "score": 3, "replies": []}, {"body": "Vegas is telling me JPow is at +10000 odds to dub", "score": 2, "replies": []}, {"body": "75 bps reminds me of a girl I used to see, like throwing a sausage down a Hallway and fuck all traction!", "score": 2, "replies": []}, {"body": "Username checks out", "score": 2, "replies": []}, {"body": "Every time the music starts and he pulls his right fist back I get fooled and hit with the left.", "score": 2, "replies": []}, {"body": "Ah shit, You funny", "score": 2, "replies": []}, {"body": "I laughed WAY too hard at this", "score": 2, "replies": []}, {"body": "I don't get it.", "score": 4, "replies": [{"body": "[deleted]", "score": 20, "replies": [{"body": "Because most of US gov debt is financed with short term notes that must be constantly rolled over.\n\n10% rates would account for over half all tax revenue just to pay the interest on the debt.\n\nWhich means more debt monetization because we'll continue to try to print our way out, which leads to MORE inflation, not less.\n\n\nInflation is a multi variable problem: exacerbating the government spending problem to the max in order to tame the low interest rate problem won't solve the inflation problem.", "score": 13, "replies": [{"body": "What helped it to be successful when Volcker did it? Were other factors at play then?", "score": 1, "replies": [{"body": "We have 33X More national debt now than in 1980 and. Our debt to gdp ratio is 130% vs 30% in 1980.", "score": 6, "replies": [{"body": "Wow some people here actually get it", "score": 3, "replies": []}, {"body": "&#x200B;\n\n![img](emote|t5_2th52|8881)", "score": 2, "replies": []}]}]}]}, {"body": "“Just start the recession already”- man who may likely lose his job in said recession", "score": 12, "replies": [{"body": "Do you want it now or later?", "score": 3, "replies": [{"body": "In the long run we are all dead", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Dummy thinks he’s gonna have money to buy back in lol", "score": 1, "replies": []}]}]}, {"body": "if the fed keeps raising at the rate of .75 a month, we'll be sitting at near 10 percent by the end of the year.", "score": 2, "replies": [{"body": "TIL 5% is actually 10%.", "score": 1, "replies": []}]}, {"body": "So...the boxer in white is inflation?", "score": -1, "replies": [{"body": "You’re a fucking moron", "score": 25, "replies": [{"body": "Ahhh! I get it. Sorry. The boxer in BLACK is inflation and the one in white is GDP...Yes. That's funny.", "score": 2, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 3, "replies": []}]}]}, {"body": "Only if you watch the whole video. The big guy throws a couple of punches in the beginning, but then Jerry Lee starts dancing around doing crazy stuff, hits some slaps here and there, but no one really notices because they are too busy laughing at stupid stuff. Then when big guy tries to hit hardest Jerry Lee rubber bands off the ropes and headbutts him taking him to the ground for a 10 count.  \n\nLove him or hate him, Volcker would have ended it with a hay maker at the beginning and told the audience that they make too much money.", "score": 6, "replies": []}]}, {"body": "Hahahaha nice satire", "score": 1, "replies": []}]}]}, {"body": "All that matters is that he's having fun.", "score": 1, "replies": []}, {"body": "That's Jim Carrey's grandpa", "score": 1, "replies": []}, {"body": "What the fuck did I just watch?  Tears in my eyes!", "score": 1, "replies": []}, {"body": "Where's the massive KO from inflation?", "score": 1, "replies": []}, {"body": "He working that dude", "score": 1, "replies": []}, {"body": "Jerry Lewis was a comedic Genius!!! Lol", "score": 1, "replies": []}, {"body": "Omg hahahahahhahaa", "score": 1, "replies": []}, {"body": "u/savevideo", "score": 1, "replies": [{"body": "###[View link](https://redditsave.com/r/wallstreetbets/comments/vdla83/75_bips_vs_86_cpi/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideo)&#32;|&#32;[**Donate**](https://ko-fi.com/getvideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo&message=https://np.reddit.com//r/wallstreetbets/comments/vdla83/75_bips_vs_86_cpi/) &#32;|&#32; \n [^(reddit video downloader)](https://redditsave.com) &#32;|&#32; [^(download video tiktok)](https://taksave.com)", "score": 1, "replies": []}]}, {"body": "Louis Theroux, ladies and gentlemen.", "score": 1, "replies": []}, {"body": "Wtf is that gif", "score": 1, "replies": []}, {"body": "Classic. Only true boxing fans will remember that fight", "score": 1, "replies": []}, {"body": "Gone from effectively 0.08% to 1.57% in 3 months, do you not realise how much a jump that is? During 70s when Volker rug pulled to 20%, fed rate was 10%, a 100% change, this time it’s a 1,862% change. By September you going to be begging them stop.", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4887)", "score": 1, "replies": []}, {"body": "He knew he could move like that!", "score": 1, "replies": []}, {"body": "Is that Jim Carey in Dumb and Dumber?", "score": 1, "replies": []}, {"body": "Haha nice!! Nailed it for me.", "score": 1, "replies": []}, {"body": "Jerry Lewis is the Best! My favorite is Bellhop when they make him set up thousands of chairs and he does it in like 5 min", "score": 1, "replies": []}, {"body": "I love the internet", "score": 1, "replies": []}, {"body": "What in the hell Bobby.", "score": 1, "replies": []}, {"body": "Prince Nazim Hamed before he debut in America.", "score": 1, "replies": []}, {"body": "This ain't getting the respect it deserves. Guess the truth hurts", "score": 1, "replies": []}, {"body": "Awesome", "score": 1, "replies": []}, {"body": "Thank you for providing the best entertainment in my lifetime", "score": 1, "replies": []}, {"body": "Kind of remi ded me of Jim Caray", "score": 1, "replies": []}, {"body": "Real mvp is the other guy just watching him have a field day", "score": 1, "replies": []}, {"body": "Gold", "score": 1, "replies": []}, {"body": "This looks like something Martin would have done back in the day.  Like his dragonfly Jones character", "score": 1, "replies": []}, {"body": "How do I download this?", "score": 1, "replies": []}, {"body": "Song?", "score": 1, "replies": []}]}
