{"title": "NVDA is getting ready for its path to recovery", "selftext": "[deleted]", "id": "b1k666", "created_utc": 1552683779.0, "score": 108, "upvote_ratio": 0.79, "num_comments": 93, "comments": [{"body": "Can’t argue with the DD here", "score": 167, "replies": [{"body": "You telling me “Badass Trader” doesn’t know what he’s talking about?? ", "score": 55, "replies": [{"body": "Baddest of the Badasses", "score": 9, "replies": [{"body": "Don’t try and be funny you dumb fuck. ", "score": -99, "replies": [{"body": ">-69 points\n\nNice ", "score": 6, "replies": []}, {"body": "Well that's impolite of you... can't we all just get along?", "score": 33, "replies": [{"body": "No because someone exploded an orange", "score": 8, "replies": [{"body": "That's inhumane, a decent person just smashes pumpkins", "score": -3, "replies": []}]}]}, {"body": "Who flicked your balls?", "score": 3, "replies": [{"body": "NVDA", "score": 2, "replies": [{"body": "Sending thots and prayers. ", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Its a total mystery", "score": 4, "replies": []}]}, {"body": "-100 c’mon lets gooo", "score": 1, "replies": [{"body": "Taking call options now", "score": 1, "replies": []}]}, {"body": "Rip ur internet points", "score": -5, "replies": []}]}]}]}, {"body": "Lmao it’s rock solid. Judging from the intellect & attention to detail - This guy could be a GS analyst for all we know ", "score": 15, "replies": [{"body": "Well I don't know what GS stands for... so probably not a good start", "score": 14, "replies": [{"body": "Gerbil Sex. \n\nGah. ", "score": 11, "replies": []}, {"body": "Goldman Sachs bro wtf ", "score": 19, "replies": [{"body": "Lol... Fair point. I should have got that one.", "score": 16, "replies": [{"body": "Yeah man maybe if you’d been trading for more than a week you would’ve known ", "score": -20, "replies": [{"body": "Well if I have been trading for less than a week, I wouldn't have said I should have got that one. :)", "score": 12, "replies": []}]}]}]}]}]}, {"body": "Don't misled. ", "score": 1, "replies": []}]}, {"body": "I don’t trust anyone with 200 posts and 124 karma. ", "score": 65, "replies": [{"body": "Would you trust 1000s of posts and over 100k karma more or less?", "score": 20, "replies": [{"body": "For sure not if he's a Bart Turner, those can't be trusted.", "score": 0, "replies": [{"body": "What is a Bart Turner?", "score": -3, "replies": []}]}]}, {"body": "Trust no1 buddy... do your own research", "score": 13, "replies": [{"body": "Too late. I already bought because of your DD.", "score": 2, "replies": [{"body": "Stupid question, but what does DD mean?", "score": 2, "replies": [{"body": "Due diligence", "score": 0, "replies": [{"body": "Lol... I see. ", "score": 1, "replies": []}]}]}]}, {"body": "[removed]", "score": -6, "replies": [{"body": "Laame", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Lol", "score": 2, "replies": []}]}]}, {"body": "Maybe you can write for Seeking Alpha one day.", "score": 49, "replies": [{"body": "Lol... I know... practicing getting straight to the point", "score": 14, "replies": [{"body": "So good ", "score": 2, "replies": [{"body": "The stock or me? lol", "score": -1, "replies": []}]}]}]}, {"body": "Thank you Sir Trader of House Badass", "score": 10, "replies": [{"body": "Anytime cap", "score": 3, "replies": []}]}, {"body": "holding my $220 position, looks like hope is coming back!!", "score": 7, "replies": [{"body": "Good luck buddy... I think it will get there", "score": 6, "replies": []}]}, {"body": "Bad ass trader = nitwit at trading in the futures of naughty donkeys", "score": 3, "replies": [{"body": "Lol...\nThere's big business in naughty donkeys buddy... jokes on you. ", "score": 4, "replies": []}]}, {"body": "It was an amazing buy below $150, now it’s near fair value but there’s still something there", "score": 1, "replies": [{"body": "I bought it the day it crashes to 130. Only bought 10 shares though", "score": 1, "replies": []}, {"body": "Ya my lowest current position was at 138.37. Up 22.75% with that. \n\nI have a set target at 288 though. ", "score": 0, "replies": [{"body": "NVDA will always be cyclical with semis and trade at a high valuation, but they have some of the best growth drivers of almost any company on the planet", "score": 1, "replies": [{"body": "Curious as to why you see it as Cyclical?", "score": 1, "replies": [{"body": "He meant chiplical, one chip after the next. ", "score": 2, "replies": [{"body": "Lol. That's funny and explains it...", "score": 1, "replies": []}]}]}]}, {"body": "288? where's that number coming from? seems a little high\n\nedit: lol that's literally their all time high value.. is that why you chose it?", "score": 1, "replies": [{"body": "Just below the high before the bear market", "score": 1, "replies": []}]}]}]}, {"body": "+15.5% this quarter. It’s a ways down the path. ", "score": 1, "replies": [{"body": "Ya but it's been ranging a while and the earnings report just kicked it into shape a bit...\n\nBut once the China Trade Deal gets sorted, it will include an agreement to buy semi-conductors and then we will see fast pace recovery. IMO.", "score": 3, "replies": []}]}, {"body": "BUY BUY BUY\n\nSELL SELL SELL", "score": 1, "replies": []}, {"body": "So... PT $300?", "score": 1, "replies": [{"body": "Well I have it set to $288 - But always do your own research buddy. ;)", "score": 1, "replies": []}]}, {"body": "Bet u sell it within the next week. do it you wont", "score": 1, "replies": [{"body": "How do you mean?", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I use Etoro... but there are a lot of choices out there. ", "score": 1, "replies": []}]}, {"body": "Heck yes it is. I've got a put credit spread till two years from now.", "score": 1, "replies": []}, {"body": "I disagree, but we'll see. ", "score": 1, "replies": []}, {"body": "Where do you guys see the acceleration coming from? The RTX series of cards is not selling very well. best case it's kind of business as usual. Still working through the mining oversupply.\n\nIf this bottom in crypto holds and the altcoins get going again that could be the real catalyst because mining will start to pick up. Without that, Gamers don't really seem to have that much of an interest in RTX", "score": 1, "replies": [{"body": "Well Chip stocks were particularly impacted by the Bear market being high beta and the nature of the trade between China and America. So they were undervalued to start with. Then most stocks started to recover, they stayed low, followed by a strong earnings hit and an agreement in the China Trade deal for China to buy semi-conductors, means the recovery is probable and the gap up is still there. IMO", "score": 2, "replies": [{"body": "Yeah that's exactly what it would mean, it would mean recovery. I'm looking at just the opposite with global GDP slowing.. we are basically at Peak employment which is going to do one of a couple of things and those things basically just depend on time. The rate is either going to stay extremely low for a couple of quarters or it's going to start taking up as job creation slows. If we do begin to re-accelerate you're going to see the price of Commodities begin to rise again and you're going to see the FED get hawkish. So far neither of these things have happened and the market keeps increasing the chance of an actual rate cut. Historically when the FED begins to cut it means the Slowdown is evident and the market is already tanking or about to. If you do an overlay of the interest rate cycle and the S&P 500 it's pretty uncanny how correlated that is. ", "score": 1, "replies": [{"body": "You definitely have a better understanding of global economics than me. Will check out the overlay though. Do you monitor the yield curve?", "score": 1, "replies": [{"body": "Yes. Bond market is telling a different story than equities now. If growth was accelerating bonds would be selling off and the curve steepening", "score": 1, "replies": [{"body": "Ya I've been watching it. Do you think a recession is coming? Lots of speculation about it. Though I'm not expert in global economics, I do think if it is coming it will be later in the year. Depending on China Trade and Brexit of course.", "score": 1, "replies": [{"body": "Too hard to really say. There are so many variables that can happen along the way. I think what is most probable is a Slowdown and the recovery in Europe and China is going to take longer than some people expect which will lead to the United States under 2% GDP.", "score": 1, "replies": [{"body": "Interesting. Nice insight buddy.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Lots of reading to do in this post. Solid DD. I'm with you for a long call. ", "score": 1, "replies": [{"body": "Stupid question, but what does DD stand for?", "score": 1, "replies": [{"body": "Due diligence. ", "score": 1, "replies": []}]}]}, {"body": "Just dealt with their customer service recently (as a consumer) - and it wasn't pretty.  Based on my customer experience, I would never trust this company in anyway.  With other companies that put a major emphasis on customer satisfaction, its something I would be concerned about with regards to their competition.", "score": 1, "replies": [{"body": "Yeah lets base the company’s value on some under payed part-timer", "score": 1, "replies": []}]}, {"body": "Are there any news why is it getting back up?", "score": 1, "replies": [{"body": "AVGO called for a bottom in the chip sector slowdown for Q2 this year on their ER that posted yesterday. ", "score": 3, "replies": []}]}, {"body": "If you say so. ", "score": 1, "replies": [{"body": "I do. :)", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "12 steps, buddy.  The first is acceptance.", "score": 3, "replies": []}, {"body": "Smart buddy. Are you gonna wait for full recovery to tp?", "score": -5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Likewise", "score": 1, "replies": []}]}]}]}, {"body": "[removed]", "score": -15, "replies": [{"body": "Who hurt you?", "score": 9, "replies": [{"body": "NVDA ", "score": 24, "replies": []}]}, {"body": "Yes, getting in NVDA years ago would have been ideal. However, to classify it only as a meme stock, acting as though they’re not a legit company is just wrong. ", "score": 7, "replies": [{"body": "SHORT JNUG ", "score": 2, "replies": []}]}, {"body": "Hey this isn’t WSB lol", "score": 6, "replies": []}, {"body": "Troll", "score": 2, "replies": [{"body": "I’m over 45 so I have no idea what that means lol ", "score": -3, "replies": []}]}, {"body": "As opposed to?", "score": -5, "replies": []}]}]}
{"title": "Uber's eye-popping $120 billion valuation would make it worth more than Nvidia, 3M and PayPal", "selftext": "", "id": "b1jp3w", "created_utc": 1552681285.0, "score": 151, "upvote_ratio": 0.97, "num_comments": 87, "comments": [{"body": "Ridiculous.  This coming from a company that lost $2 billion last year and who creates inorganic growth from an unsustainable business model.", "score": 119, "replies": [{"body": "yep, straight up trash. More wall street bullshit to slaughter retail investors like they did with SNAP IPO.", "score": 66, "replies": [{"body": "I mean, at my country Uber started the trend of app taxis, yeah. But then everybody caught on and I think every single taxi company has an app and there are few direct competitors whom are cheaper and taking less fees from drivers..\n\nUber is a dumbster fire.", "score": 32, "replies": [{"body": "So what, you just keep swapping through your 35 different ride-hailing apps until you find one that has a decent wait time? Uber definitely has network effects on its side.", "score": -3, "replies": [{"body": "you know those eta's they quote you are often fake. \n\nhttps://gizmodo.com/uber-is-faking-us-out-with-ghost-cabs-on-its-passenge-1720576619", "score": 8, "replies": [{"body": "This says that the cars on the in-app screen are fake, not the etas. And in my experience, the eta has always been accurate. What, you think they would maintain customer satisfaction is they straight up lied about how long a ride would take? Lol. ", "score": 5, "replies": [{"body": "yes. happens all the time. hence the word \"estimated\". ", "score": 2, "replies": []}]}]}, {"body": "And that means it’s worth 120 billion", "score": 1, "replies": [{"body": "No, it doesn't. But it does mean that competition isn't as \"easy\" as this guy makes it seem. ", "score": 1, "replies": []}]}]}]}, {"body": "Why does everyone think Wall Street gives a fuck about retail? Shits a worse conspiracy than the government flying planes over leaving chem trails ", "score": 20, "replies": [{"body": "who do you think they dump their shit inventory onto? retail morons. ", "score": 2, "replies": [{"body": "Nah bruh. I’ve worked on wallst for almost 5 years and never ever hear retail mentioned ", "score": 6, "replies": []}]}]}]}, {"body": "This is actually completely standard. In Silicon Valley you usually value at 60x losses. ", "score": 24, "replies": []}, {"body": "$5 billion. they lost $5 billion last year ", "score": 13, "replies": []}, {"body": "But lots of millenial noobs are going to buy their shares on robinhood.  ", "score": 6, "replies": []}, {"body": "Much of it's value comes from data of customers routes combined with self driving cars in the future", "score": 2, "replies": [{"body": "Ah that precious data. I remember how valuable Moviepasses data was too.", "score": 14, "replies": []}, {"body": "you mean that exact same data that google and apple have? plz, quit your bs. ", "score": 8, "replies": []}]}]}, {"body": "definitely shorting this. Haven't seen an IPO in years that hasn't sold off", "score": 116, "replies": [{"body": "You gonna wait a few weeks", "score": 26, "replies": [{"body": "I'm sure he meant short and not put. You can just directly borrow shares from your broker.", "score": 17, "replies": [{"body": "I am sure it would be like 50%/annual borrow fees or something ridiculous.", "score": 16, "replies": [{"body": "> I am sure it would be like 50%/annual borrow fees or something ridiculous.\n\nI’ve never directly short anything so would you care to elaborate? Like how much would the typical fee be (not necessarily Uber)? ", "score": 3, "replies": [{"body": "Newly IPOed shares are hard to borrow, so the brokerage houses charge you for it.", "score": 17, "replies": [{"body": "Would they charge you for an existing company…like FB, AMZN, EXC, CGC, etc? If so, how much?", "score": 4, "replies": [{"body": "It can get a little complicated. [This](https://www.interactivebrokers.com/en/index.php?f=1595&p=secfinancing) should give you some ballpark numbers. In certain cases you actually get paid, since on a short sale the cash you receive earns interest which can offset the borrowing fee of the shares you sold short.", "score": 10, "replies": [{"body": "I like how people on WSB only know options on robinhood when in reality the big boy hedge funds short sell on the reg ", "score": 4, "replies": []}]}, {"body": "Yes they do charge.  ", "score": 1, "replies": []}, {"body": "Yeah you pay based off of liquidity and such. The harder/more risky the shares, the more they charge. ", "score": 1, "replies": []}]}]}]}]}, {"body": "Where are you going to get the shares silly.  Do you not remember recent shit IPOs. ", "score": 2, "replies": []}]}, {"body": "You’ll have to, options don’t open immediately ", "score": 1, "replies": []}]}, {"body": "really? several just last year have done well, nothing mega-cap like this is projected to be (and i'm with you on shorting it), but things like DOCU, DELL, etc all did pretty well.", "score": 9, "replies": [{"body": "DELL was hardly an IPO in the traditional sense. That was a company that had been public, went private, was still traded with a tracking stock, then went public again.", "score": 1, "replies": []}]}, {"body": "ESTC. IPO closed Oct 5 2018 up 94%. Today it’s up 136% since IPO. ", "score": 3, "replies": []}, {"body": "Spotify?", "score": 1, "replies": []}, {"body": "Gotta wait for inventory ", "score": 1, "replies": []}, {"body": "Yea man *not a single one* ", "score": 1, "replies": []}, {"body": "Spotify hurt me good last year :(", "score": 1, "replies": []}, {"body": "Check mdb. But I agree this valuation is rediculous ", "score": 1, "replies": []}, {"body": "yes was gonna say that is the most overvalued shit ever and will lose half of its valuation in a year or less", "score": 1, "replies": []}]}, {"body": "Yeah, for all those suckers who think level 5 SDC's are possible, here's some DD for you. You should take note how every year the tech is \"4-6\" years off in perpetuity...and it's been like that for the past 7 years. Also, \"disengagement reports\" are entirely meaningless. people are stupid and fooled by \"big\" numbers. See the below link why it's a fools game to compare human drivers to cars with fancy cruise control.\n\nhttps://hackaday.com/2016/12/05/self-driving-cars-are-not-yet-safe/\n\nBTW, why is a big player looking to sell themselves? don't they know the market is worth a hundred trillion million billion dollars according to 19 year old tide-pod-eating state school college children?\n\nhttps://www.theinformation.com/articles/self-driving-car-startup-drive-ai-seeks-potential-buyers\n\nhttps://www.axios.com/robotaxis-cost-profit-ride-sharing-self-driving-47498c81-cb94-4ca9-ba52-7b08c0cd98df.html\n\nhttps://www.iotforall.com/self-driving-vehicles-dream-becomes-nightmare/\n\nhttps://www.greencarreports.com/news/1120826_2019-ces-quiet-year-for-green-car-and-self-driving-news\n\nhttps://www.theinformation.com/articles/at-ces-new-questions-emerge-as-self-driving-ambitions-narrow\n\n\"executives from self-driving carmakers and software companies who gathered this week at CES, the giant annual electronics show in Las Vegas, appeared to agree on at least one thing: It’s time to lower expectations about autonomous vehicles\"\n\n“A couple years ago, everyone was like, we’ll be done [developing self-driving cars] in three, four, five years. Everyone was promising a lot,” said Heiko Kraft, director of analysis and testing for Mercedes-Benz self-driving car research in Sunnyvale, Calif.\n\nNow, however, companies are more cautious about setting timelines because, among other issues, self-driving cars have had a hard time interpreting and responding to unique scenarios, Mr. Kraft said. As an example, he pointed to a problem his company faced recently when a car it was testing was confused by a school crossing guard riding a bicycle with a stop sign poking out of a backpack.\n\nThe hurdles that still face the most ambitious players were vividly illustrated during a demonstration ride in a self-driving car from Aptiv, a provider of hardware to the industry that has been running autonomous vehicle tests in Las Vegas for more than a year. On the ride with The Information, the car’s safety driver had to take control to guide the vehicle around a construction zone. The driver also has to take the wheel to pick up passengers in private hotel lots, according to a person who used the system in a live scenario.\n\nhttps://www.citylab.com/transportation/2019/01/self-driving-car-technology-consumer-electronics-show/580027/\n\nhttps://outline.com/JKgg6R\n\n\"'Reality is kicking in': Ford says self-driving vehicles are further away than many expect\"\n\nhttps://www.stuff.co.nz/motoring/109805157/the-selfdriving-car-industry-just-acknowledged-it-has-an-image-problem\n\nhttps://twitter.com/amir/status/1075633551268179968?s=21\n\n(notice this Cruise car can't handle a VERY simple task of moving around a parked delivery vehicle. something a developmentally disabled 15 year old could figure out).\n\nhttps://arstechnica.com/cars/2019/01/toyota-is-betting-fully-driverless-cars-are-still-years-away/\n\n\"None of us in the automobile or IT industries [is] close\" to solving the challenge of fully autonomous vehicles, said Gill Pratt, CEO of the Toyota Research Institute, in a speech at the Consumer Electronics Show on Monday.\n\nhttps://www.knoxnews.com/story/money/business/2019/01/01/olli-knoxville-self-driving-autonomous-vehcile/2292584002/\n\nhttp://www.thedrive.com/tech/25589/the-10-worst-self-driving-stories-of-2018\n\nhttps://arstechnica.com/cars/2018/12/we-finally-talked-to-an-actual-waymo-passenger-heres-what-he-told-us/\n\nhttps://www.autonews.com/regulation-safety/key-us-senator-calls-self-driving-legislation-long-shot\n\nhttps://www.thestreet.com/opinion/driverless-cars-will-be-the-biggest-investment-write-off-ever-14818507\n\nhttps://gizmodo.com/the-deadly-recklessness-of-the-self-driving-car-industr-1831027948\n\nhttps://www.wired.com/story/tusimple-self-driving-truck-cameras-computer-vision/\n\nThe demo drive also, however, makes clear there’s work to be done. After 40 minutes of, uneventful robo-driving, a computer voice interrupts our conversation: “Autonomous driving off.” Without my noticing it, the safety driver has retaken control. “I’ve got a freeze on my visual,” he tells Hou. “I shut it down for safety.” A network card in that server box next to me disconnected, likely due to the truck's vibration, freezing the system's human-machine interface and blocking the bit that does the motion planning from the bit that executes its commands.\n\nAnd so this flesh-and-bones human holds the wheel and works the pedals for the next 20 minutes, taking us off the highway and back to TuSimple’s garage. The computer crash mars what started off as a very impressive ride, but hey, there are worse kinds of crashes.\n\nhttps://twitter.com/binarybits/status/1071098533862871040?s=21\n\n\"Until recently my mental model of Waymo was that their technology was basically ready to go in late 2017 and they were doing a last few months of testing out of an abundance of caution, and to give time to build out non-technical stuff like customer service and maintenance.\n\nThis week has forced me to totally re-evaluate that. It now looks to me like Waymo is nowhere close to ready for fully driverless operation in its initial <100 square mile service area, to say nothing of the rest of the Phoenix metro or other cities.\n\nThe Arizona Republic's @utilityreporter spent three days following Waymo cars around and wrote a great piece about it. One of the most striking facts: \"we never observed a vehicle shuttling passengers.\" - https://www.azcentral.com/story/money/business/tech/2018/12/05/phoenix-waymo-vans-how-self-driving-cars-operate-roads/2082664002/\n\nIf Waymo were confident in its technology and almost ready for a large-scale launch, you would expect them to be doing a lot of test rides with real passengers to test out the whole system—customer service, capacity management, vehicle cleaning, etc.\n\nBut clearly Waymo is far from that point. This is a company that's still trying to get its technology to work, not a company doing a dress rehearsal for an imminent large-scale launch.\n\nAnd if Waymo isn't close to ready for a real commercial launch, then a lot of what they've done over the last 18 months—signing deals with Avis, hiring a bunch of customer service reps, ordering 82,000 cars, etc—seems premature.\n\nI saw that stuff as evidence that the technology was on track, because I thought Waymo, of all companies, would avoid the trap of getting overconfident about a complex software project. I guess not.\n\nThis means I have no idea how long it will take for Waymo (or anyone else) to reach full autonomy. It could take six months or it could take six years. Maybe Waymo will be forced to throw out big chunks of what they've built so far and start over.\n\nBTW, @amir deserves special recognition for his thorough, independent, and skeptical reporting on Waymo over the last few months. He's been totally vindicated this week. https://www.theinformation.com/articles/waymos-big-ambitions-slowed-by-tech-trouble …\"\n\nhttps://www.azcentral.com/story/money/business/tech/2018/12/05/phoenix-waymo-vans-how-self-driving-cars-operate-roads/2082664002/\n\nhttps://www.axios.com/who-will-pay-for-autonomous-vehicles-11702624-0fbf-4b5f-9d3a-bf5c4cd3ed8a.html\n\nhttps://www.theinformation.com/articles/waymos-big-ambitions-slowed-by-tech-trouble?shared=4596b7125469ea51", "score": 35, "replies": [{"body": "I read what you wrote but didn't click the links. No bamboozles please.", "score": 12, "replies": []}, {"body": "Thank you for the  info, but your better off sharing that somewhere else, might spark a discussion, but definitely not here. ", "score": 6, "replies": []}, {"body": "Good content, you should make this its own post. While self-driving cars is definitely vaporware at this stage, I think we'll see increasingly computerized ones with driver assistance / data collection capabilities.", "score": 5, "replies": []}, {"body": "Get to the point. Ups or downs?", "score": 0, "replies": [{"body": "Down’s syndrome ", "score": 9, "replies": [{"body": "thanks for the laugh. i almost choked on this dildo i was about to inhale", "score": 2, "replies": []}]}]}]}, {"body": "What bank would invest in such an overvalued price?", "score": 25, "replies": [{"body": "they're not investing. they're hoping that name recognition and hype will be enough to buoy it long enough that they can dump it on retail tards. ", "score": 29, "replies": [{"body": "So switch my portfolio to 100% long term Uber puts. Got it.", "score": 10, "replies": []}]}]}, {"body": "Hopefully there will be options after the first week.", "score": 16, "replies": [{"body": "There won't. I think it has to be a month or so for every IPOs", "score": 11, "replies": [{"body": "Doesn’t it say $7m outstanding shares and 5 days after IPO date ?", "score": 6, "replies": []}, {"body": "No it's usually a week.", "score": 1, "replies": []}]}]}, {"body": "I'm buying Puts ASAP\n\n&#x200B;", "score": 14, "replies": []}, {"body": "[deleted]", "score": 12, "replies": [{"body": "A taxi company far owns no taxis ", "score": 4, "replies": []}]}, {"body": "While I’d love to long the stock, the price wars between Lyft and Uber will be interesting to see how they pan out.  From a consumer perspective, Both have 0 brand loyalty, it’s just based on price.  The apps are identical, the user experience is identical. \n\nAt least with Spotify vs Apple Music, Netflix vs crave vs Hulu etc, the offerings are not exactly the same (content and algorithms).\n\nUnless Uber brings flying cars to market first, I don’t think I’ll buy in until the above is priced in\n", "score": 8, "replies": [{"body": "Of what I've heard as a consensus, Lyft has the better experience for both the passenger and driver typically", "score": 6, "replies": [{"body": "Same driver.  Every Uber around here is a Lyft as well.", "score": 5, "replies": []}]}, {"body": "Why would they be competing, when they can both make money and the owners can play golf together on the weekend. ", "score": -4, "replies": [{"body": "Consumers only have 1 dollar.\n\n\"Why do farms compete when the customer can just buy two apples?\"", "score": 7, "replies": [{"body": "You’re  giving too much credit to the consumer", "score": 0, "replies": []}]}, {"body": "Can’t take and Uber and Lyft at the same time homeslice ", "score": 1, "replies": []}]}]}, {"body": "Knowing WSB, you'll have plenty of autists who FOMO on IPO day.", "score": 13, "replies": [{"body": "/r/Robinhood more likely. But first you'd have to explain to them what an IPO is. ", "score": 6, "replies": []}]}, {"body": "Offering some different perspective here, there is more to Uber than ride hailing. They are really growing in the logistics space. I was a VC analyst at a firm that specialized in logistics and SaaS. Last mile delivery, such as uber eats, and their freight brokerage can be very profitable. The uber eats model can be applied elsewhere and I've seen some successful startups in the space offering delivery for HVAC, plumbing supplies, etc from contracted drivers through an app. Getting to scale and ensuring your place as the leader is important, which is why they throw so much money at inorganic growth.\n\n&#x200B;\n\nThey aren't really a ride-hailing company that loses billions. They're trying to become the leader in logistics tech. There are boatloads of money to be made here. Not saying they will be, but definitely not an IPO to just dismiss either", "score": 4, "replies": []}, {"body": "Going in on the short side after 3-6mo. Based purely on personal experience DD between Uber and Lyft.\n\nI've had a minimum of 3 potentially fucked up (inebriated) Uber drivers and 0 negative Lyft experiences. Over 1k rides total between the two in the last 5yrs.", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "5 stars on both. If I'm having to call a ride service it's because I'm out having a good time. If I can watch 3, 4, or last October (RIP a years profits) 5-figures drop in a week, I think I can afford to take care of a stranger getting me home safely.\n\nI've ridden in enough shitty cabs that tipping 100% on rideshares is still a bargain.", "score": 1, "replies": []}]}, {"body": "That might be just due to Uber having more drivers", "score": 1, "replies": []}]}, {"body": "Lance Armstrong has to be seeing these articles and wishing he could bust 2 nuts-worth.  I can’t remember what they estimated his stake at,  but it was fucking huuuuuuuuuge.  ", "score": 2, "replies": []}, {"body": "PUTS PUTS PUTS. I hate UBER and I hate any company that makes no money. ", "score": 2, "replies": []}, {"body": "Oh boy, everyone on WSB saying it’s going to go down..: time to buy in?", "score": 2, "replies": []}, {"body": "Are these guy high on cocaïne or something? Who the fuck makes up those up those numbers. This is a joke 120 Billion for a company that burns billions. Short the fuck out of this thing. ", "score": 2, "replies": [{"body": "High valuation so they can fuck up retail whenever the lock up period ends.", "score": 1, "replies": []}]}, {"body": "what a completely retarded valuation. This company got pumped way too much before the IPO.", "score": 2, "replies": []}, {"body": "So many people saying puts. \n\nHonestly, I'm in on IPO. Wall Street loves companies that lose money. Tesla loses money, Netflix loses hella coin, and their valuations are yuge. Uber has Uber Freight. Surprisingly, Uber is more scalable than I ever thought, which is nice.\n\nI don't understand how they lose money but I see them growing and Wall Street loves companies that spend more than they earn.", "score": 2, "replies": []}, {"body": "This just seems insane to me. People are gonna be caught with their pants down hard.", "score": 1, "replies": []}, {"body": "cant wait to buy puts", "score": 1, "replies": []}, {"body": "when does it ipo ", "score": 1, "replies": []}, {"body": "The Puts are strong with this one", "score": 1, "replies": []}, {"body": "Anyone know what’s it’s gonna be priced at on ipo? ", "score": 1, "replies": [{"body": "i mean 120Bn valuation doesn't give you any idea what the price would be since you won't know how many shares are going to be made available", "score": 11, "replies": []}, {"body": "$1, usually one share/dollar", "score": -2, "replies": []}]}, {"body": "https://www.reddit.com/r/business/comments/as4sls/uber_reportedly_preparing_to_go_public_despite/egsmj41/\n\nthe takeaway is Uber and Lyft are not profitable now and cannot be profitable in the future under their current model. BUT there is a market for the service that it provides and Uber and Lyft are the two biggest players in that market. It's a marketshare play, but customers have no loyalty to a service and there is no 'sticky' ecosystem factor to 'lock them in'. It's akin to Netflix.\n\n- \n\nHow much debt do they have?\n\nWhat is their credit rating?\n\n\neither they borrow from banks or they will dilute the shit out of investors to keep the business running. ", "score": 1, "replies": []}, {"body": "LANCE ARMSTRONG ABOUT TO BUY A 2ND FAKE TESTICLE. ", "score": -1, "replies": []}]}
