{"title": "What am I doing wrong? (AMD)", "selftext": "[deleted]", "id": "2b22u8", "created_utc": 1405700908.0, "score": 5, "upvote_ratio": 0.86, "num_comments": 24, "comments": [{"body": "It does this after each quarterly earnings. Even on good numbers! It's a well oiled pump and dump machine. Run up to earnings, pull back 15-20% day after. Like clockwork.\n\nI thought it would be different this time (stupid me) and held, so I'm there with you.", "score": 7, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Amd is a turn around story.  if you bought a little more than a year ago at 2.50 even with the pull back you are still up 50%.  I made more than 100% average on the last run up by amd when it went from 3.50 (went even lower, but I waited to get in on the upswing until they had the cash from the 1b anti-trust settlement from intel) to 10.  Sold part of it there, and rode the other half down to 8 and sold the remaining.\n\nNow that their debt is restructured mostly for the next 5 years at better rates, and they have paid off GF, I figured it was a good time to get in, but the GPU loss from bitcoin miners was as bad as expected, and they missed by a little less than a cent from wall street expectations.  I think longer term they are actually ok now.  The shift to semi-custom is basically similar to what ibm did a few years back in switching to a services company.  This is a new business model, so you would suspect the old style revenue will be in decline, and the new revenue will be on the upswing.\n\nIf the OP was looking at the charts any longer than 1 month they should have noticed it tends to go down from 4.50... so why get in then?  I actually got in at 4.53 but had some other options strategies tied to my overall position so I will just average down a bit as we get closer to 3.50 again.  \n\nI think AMD also sandbagged guidance since they saw how bad these results were going to be anyway.  I can't recall listening to a worse conference call in a while.  Even bb on the ride down from 120 to 6 had better conference calls.  That said, the \"run\" in earnings tends to happen thanks to things like intel pre announcing, and doing well/reporting earlier than AMD.  That said, if you buy the intel market analysis, AMD should do better.  If you buy the AMD, you should also be selling your intel at these levels, as both can't be right.  (I personally think they are underestimating semi-custom uptick for q3/q4, but I suppose they will chalk that up to being conservative...)", "score": 1, "replies": [{"body": "Have they fully paid off GF?", "score": 2, "replies": [{"body": "I thought they had earlier in the year.  I'll have to double check that.", "score": 1, "replies": []}]}]}]}]}, {"body": "No one on here likes to stay this, but some companies are just shit and AMD is one of those companies.\n\nIf you chase 'downtrodden stocks' you're going to get burned unless you do extensive due-diligence with solid reasoning behind it. What surprises do you think AMD has around the corner? Will they buy QUALCOMM, take over Intel's market share? The most likely course in history they'll see is a slide into irrelevance and bankruptcy.\n\nWhen a company is on a course of failure don't be surprised when they crash up and down for years before fizzling out altogether. Look at Reddit's love affair with PLUG and NQ. Is that based on due diligence and sanity?\n\nIf you're looking in the bargain bin, stick with STRONG stocks and STRONG companies that are recently seeing stressful or disappointing news (e.g. Apple's artificial shareholder crisis). AMD is surrounded with competitors that are 50x stronger in value. It's not a strong stock. They have a negative profit margin and large debt. Just compare them to Intel and ask yourself which stock is most likely to hold its value through future years.\n\nA superficial inspection of their role in the processor and videocard industry would show you that they are on the cusp of bankruptcy. Every one of their products is saddled with huge rebates. Rebates bring money today that must be repaid tomorrow (it's a short-term loan from your customer). This alone is a strong warning sign of cashflow problems.", "score": 2, "replies": [{"body": "I am guessing you didn't listen to the CC, or just chose not to examine the reason why they are having the rebates.  Anyone who is following all the bitcoin madness will know what has happened.  This is basically the low point, and it is actually a good thing to not have the gpu makers focusing on bitcoin mining performance per se.  The new consoles will bring with them an infusion on both sides of the business for AMD.  On GPU, PCs will be upgrading, many of them for the first time in a long time, as the ps3 and xbox360 have been out nearly 10 years, that means many of the ports will play on at least 5-7 year old equipment.  That won't be the case going forward.  Obviously on the semi-custom side they make something too.  Bankrupt?  It really doesn't look like they will have liquidity problems going forward.  The Gaap loss was due to the refinance at a lower rate and further out maturity.  Honestly given the spreads right now, I can't figure out what better time you could have to refinance.  Even if \"RATES\" go down, spreads are getting very thing already (risk adjusted blah blah...)\n\nThat said, there is a HIGH degree of risk with any change in business model, so this is not the stock you count on for retirement in 3 years.", "score": 2, "replies": []}, {"body": "This post is filled with such heavy-handed rationale and statements.  The stock price is the lowest it has ever been (adjusted for inflation), but historical analysis of market cap would be necessary to make a fair evaluation.  AMD has never been in a position to buy Qualcomm in the 21st century.  Plug Power is a relatively new company.  AMD has a single competitor in each of its major product types.\n\nhttp://www.wikinvest.com/stock/Advanced_Micro_Devices_%28AMD%29/Data/Market_Capitalization/2004\nhttp://www.wikinvest.com/stock/QUALCOMM_%28QCOM%29/Data/Market_Capitalization/2004/Q2\n\nAnd here are two articles displaying their CPU market share as 20% in both 2007 and 2012: http://www.dailytech.com/Intel+Wipes+Out+AMDs+2006+Marketshare+Gains+in+One+Quarter/article7051.htm\nhttp://www.pcworld.com/article/254503/amd_gains_x86_processor_market_share_on_intel_in_q1.html\n\nAnd, of course, AMD purchased Ati and now competes against a different company (nVIDIA) in the consumer and professional add-in GPU market.  Their current respective market share is somewhere around 20%.\nhttp://www.forbes.com/sites/greatspeculations/2014/05/16/how-amds-market-share-can-rise-to-30-after-the-macpro-deal/\n\nThey do compete against Intel in integrated processors including both graphics and x86.  They won the contract for both Sony and Microsoft's new consoles and produce said chip for each.\n\nAMD has been the underdog since their inception.  They began thirty years ago by reverse engineering an Intel chip and offering it at a lower price.  They do not aim to take over Intel's market share and never have.  The stock market currently does not fairly assess a company's actual working potential but its rate of expansion.  AMD offers little expansion and varying changes in market share over the course of a decade thereby offering little stability or guaranteed growth in its stock.  They've had three slightly negative years in a row since the flash crash but the idea that they are on the verge of bankruptcy is absolutely, factually untrue.", "score": 2, "replies": [{"body": "> AMD has a single competitor in each of its major product types.\n\nToday. I think you're overlooking the fact that mobile and desktop computing use is reaching parity and they are now in the process of merging (look at Microsoft's cloud efforts and Google's Chromebook). AMD has zero mobile technology and it hasn't been able to develop a decent microprocessor since 2009. This is all aside from the fact that many people have stopped upgrading their computers altogether or have switched to mobile devices.\n\nThe desktop computer industry is basically in death throes (that's as a whole, so how do you think that bodes for AMD, who has barely kept its head above water during the peak desktop years of the 2000s?)\n\n>AMD offers little expansion and varying changes in market share over the course of a decade thereby offering little stability or guaranteed growth in its stock\n\nA tech company that stagnated during the biggest tech boom IN KNOWN HUMAN HISTORY, with little growth in its future (i.e. a terminal cancer diagnosis), a bad product track record, and tons of debt? BUY BUY BUY\n\n>the idea that they are on the verge of bankruptcy is absolutely, factually untrue.\n\nThe idea is untrue right up until the point that the smart money takes their profit and the stock slides off the board, with young naive brand investors like OP holding the bag.\n\nWhat sane investor would invest in a company that promises HUGE DEBT, ZERO growth, ZERO profit, and ZERO competitiveness with emerging product trends?", "score": 1, "replies": [{"body": "The desktop computer industry is not in any death throes.  Such a phenomenon would be disastrous for Intel.  The majority of desktop users have not replaced their desktop computers with mobile devices.  That is the end of the discussion.", "score": 1, "replies": [{"body": ">Such a phenomenon would be disastrous for Intel. \n\nA company that hasn't focused on desktop computing power since around 2008, and has made massive strides in power usage and efficiency that have thus far left AMD years behind and stuck with aging, crippled technology that cannot even begin to compete with Intel on any metric except cost (which is almost entirely eroded since i3 stamps out even AMD's most expensive offerings).\n\n>The majority of desktop users have not replaced their desktop computers with mobile devices.\n\nYou forgot the last word of that sentence: \"yet.\" Sounds like a good time to invest in AMD, then? Be my guest.", "score": 1, "replies": [{"body": "I've tried to point out several times that you're severely misinformed.  Unless you recognize this we're not really having a discussion.  Intel just released a new generation of the Core architecture last year.  A good i5 can compete with the FX line on single-threaded tasks.  You have to spend more than twice as much to get about 25% more performance out of the equivalent i7 machine than a high-end FX machine.  Desktop machines will not be going anywhere for at least twenty years.\n\nYour doomsaying is dramatic albeit not comical and thus unsavory.  This: http://www.trefis.com/stock/amd/articles/247587/july-17amds-restructuring-initiatives-translate-into-strong-growth-in-1h-2014/2014-07-18\nis a company experiencing issues.  Relating that they are \"circling the drain\" is fiction.  And I have never said to invest in AMD, perhaps even intoned the opposite.", "score": 1, "replies": []}]}]}]}]}, {"body": "you sound like a very savvy investor", "score": 1, "replies": []}]}, {"body": "It's possible that AMD will still come back up from the drop. However, what research did you actually do? Did you just look at the stock price and say, \"hey, this stock seems to go up so I should be ok\" or did you actually look at numbers. Revenue, profit, margins, outlook, overall market, etc etc. Do you understand any of these things about AMD or do you only know the stock price?", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Ah.  At this point you might as well hold.  You looked back to the last time I got out.  I still think the turn around is going well longer term.  The only thing you miss out on long term, is not being able to buy today.  I mean we could maybe drop to 3.50 or even 3.00 on a broader market downturn, but I would personally use 3.00 as a screaming buy opportunity, as I don't think it will get to 2.00 again with the debt restructuring materially complete.", "score": 1, "replies": []}, {"body": "> Sadly, I didn't! I only know how I \"feel\" about AMD \n\nSo... throwing darts at the market.\n\nNow you're asking us why this dart landed on *that* stock.", "score": 0, "replies": []}]}]}, {"body": "I think the lesson here is \"[never try](https://www.youtube.com/watch?v=j73cxLiqc2U)\". Sorry man :/ I've just stuck to ETF's because of this kind of stuff, too much work put into still picking the wrong stocks.", "score": 1, "replies": []}, {"body": "Always pay attention to upcoming earnings, especially on a low priced stocks... if you think the company might not of did too well, perhaps you should sell or pay attention to the results and make a decision quick to minimize your losses.", "score": 1, "replies": []}, {"body": "Another thing I'll show you to go along with the drop after earnings. Look at this 1Y chart. See those spikes and drops, those are earnings reports. However, if you know about AMD, you know they are in a restructuring mode (phase 3 of 3) and the general 1Y trend upward. If you have the stomach for it, it may pay out again before end of year and you can catch it on the next drop and ride into 2015.\n\nhttp://finance.yahoo.com/echarts?s=AMD+Interactive#symbol=AMD;range=1y", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Traditionally, AMD has been an x86 chip company. If you read the earnings reports for the last year, they talk about a plan to restructure income from being mostly x86 to diversifying and having x86 desktop < 50% revenue. They say they are doing this with Mobile APUs, Gaming, Graphics, and Low power server.\n\nI mean if you look at the trend in the link I sent to you, you can see the lowest dips after earnings are increasing this year. Meaning low for Q4-2013 was low $3, Q1 2014 mid $3s. If we stay at high 3.70s, it's a good long term sign. Of course, I wish I had gotten out at 4.70s and back in now, oh well.", "score": 1, "replies": []}, {"body": "If you go to yahoo.com finance or nasdaq.com there are many resources.  If you want something more light weight google finance provides things with more brevity.  (page loads faster from my experience, and I love their charts for checking over different time periods/technical analysis).\n\nYou can also go to AMDs investor relations site ir.amd.com to see what they have put forward recently to the public.  They also talk a little bit about the technological side of things, but you may or may not understand that as easily depending on your background.  I personally love the information on nasdaq.com as they talk about things like short interest insider holdings/trades, institutional holdings (if this % goes up, it is usually a good sign, or if a big player dumps, sometimes they know something, and it can lead you to investigate what it might be.).  \n\nMy advice is to start small.  Research the heck out of things and try to learn your lessons.  Make sure to listen to a copy of the recent conference call form AMD to hear what a not great one sounds like.  Just try to understand things one at a time.  I would probably start with financial statements and ratios etc.  Wikipedia could get you started, and google will get you the rest of the way there really.  Any time you read something you don't understand, google it.  Sounds simple, but over time you will figure out what you are doing.  You could also try to read some of the books, but I would say get started with free resources first and put the effort in yourself.", "score": 1, "replies": []}]}]}, {"body": "one thing I noticed is you researched for a week and decided to buy right before the earnings report was due. with amd they have been consistently been below earning projections and their stock always dip on the earnings report.\n\nfor future research i would verify quarterly earn dates and i would research the trends when they are released (good or bad and how much they drop). Right now would have been the best time to buy AMD after this drop. The stock will increase before next quarter's earnings and drop again again if it misses. its a pump and dump stock. ", "score": 1, "replies": []}, {"body": "2012 Net income, bout negative a billion, followed by negative 83 million. The company is losing a ton of money. 2 Billion in debt. It will have to take more loans out to survive cause it has no free cash flow. Intel is out competing it so hard. AMD might not exist within a few years... How did you not see all of this before you invested in it?", "score": 1, "replies": []}, {"body": "The desktop and laptop markets are dying.\n\nCPU manufacturers are yesterday's whip and buggy makers.\n\nAMD does not have a MID solution, whereas NVIDIA does.  Guess which does better?\n\nUnless something old can be something new again (a la transmeta like reconfigurable microcode that can run both x86 and ARM), the AMD is doomed.", "score": 0, "replies": []}]}
{"title": "Still betting against Apple with $95 strike puts", "selftext": "[deleted]", "id": "2b1vq9", "created_utc": 1405696630.0, "score": 5, "upvote_ratio": 0.86, "num_comments": 23, "comments": [{"body": "I don't think this is going to work out for you.  Apple has tremendous price momentum and is heading towards its all time high (adjusted appx. $100).  \n\nI am *highly confident* that AAPL will touch $100.  That's simply the nature of how price action works.  Your bet, at that point, becomes one that AAPL will not break $100; that it will bounce and you'll get a better than 10% correction ( you have to cover your premium on a 95 strike put).  *Maybe*, and this all has to happen in just over a month.\n\nOn the other hand, if Apple breaks and holds $100, your position will end worthless - which you know.  My bet is that this is what will happen.", "score": 11, "replies": [{"body": "Piggy backing off of this idea because I share a similar view that we are breaking through 100. Also, you are fighting the trend by buying puts. \n\nWhat I would say is that if you do think AAPL is going to correct, I would sell the AUG 100/105 CALL spread. This way, even if AAPL keeps going up or stays here, instead of losing everything like you would with a 95 put, you'd still make 100% of your potential profit. \n\nJust a suggestion to look into. \n\nDisclaimer, I am short Aug 100 covered calls. I am also long AAPL (though that's implied). ", "score": 2, "replies": []}, {"body": "Why are you so confident it will touch 100? Last three times we tried to go through 97, we got bounced back (and this week's two bounces were brutal). Even if we have good earnings, it *seems* like people aren't willing to buy above 97. ", "score": 1, "replies": [{"body": "I'm hoping we break it with momentum on good ER. I think why we bounced off it is because no one wants to go over it without confirmation of how well their doing. ", "score": 1, "replies": [{"body": "That's an interesting theory. What do you think would be the catalyst this ER? Apple has been selling a billion trillion iPhones per quarter already. ", "score": 1, "replies": []}]}]}]}, {"body": "I think this is an okay position but it depends a LOT on earnings. I wouldn't dare play earnings.\n\nCan you explain what you mean by factored in? You can't factor in unknowns. What if the iPhone 6 cures cancer? What if it uses Android? What if it's sold for $100 or 1000?", "score": 3, "replies": [{"body": "All excellent observations and duly noted. I am likely wrong and this is just a bet going against popular opinion.", "score": 1, "replies": [{"body": "Just so you know, I think you're right. My plan is also to go for 95 Aug puts but a gap up on earnings provides a much better entry. ", "score": 1, "replies": [{"body": "The low volatility and decay may kill us.", "score": 1, "replies": [{"body": "Perhaps... I actually bought some 94.21 puts for this week. I don't think I'll hold them through earnings but the stock looks weak to me today.", "score": 1, "replies": []}]}]}]}]}, {"body": "disagree. I think the recent run up has somewhat been due to the new phone, but the stock is going to move higher still when a real release date is given. Add to that the recent IBM news, and the fact that the stock is already moving towards recovery from the ebook settlement, plus what I expect will be more good numbers coming from China in terms of phone sales, and I think you're going to be in trouble. \n\nIt's still only trading at about 15 P/E, which is on the cheaper side (though I think fair, everything else is just crazy high) level for the Nasdaq. I'd say best case scenario is it remains near 95, but there's just not a lot of upside on that play.", "score": 2, "replies": []}, {"body": "Why?", "score": 1, "replies": []}, {"body": "It will be interesting to see how many shares they have repurchased.\nI'm not sure an apples to apples comparison of the previous high will be fair with so many shares bought back.\n\ndividend in august\n\niphone in september\n\niwatch in october.\n\nI'm looking to sell sometime after the iphone and before the iwatch.  the iwatch seems like too much of a gamble for me.", "score": 1, "replies": []}, {"body": "Better hope for poor earnings/guidance on Tuesday.", "score": 1, "replies": []}, {"body": "And here I was gonna buy apple ahead of the new phones.", "score": 1, "replies": []}, {"body": "If we hit 100.00 - it's a sure bet we'll hit 110.00 before you see 95 again. Psychology  of numbers is an awesome thing.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Oh... Don't doubt it. But just like charts and fib numbers... If enough people believe in it, it becomes a self fulfilling prophesy.\n\nI'm long since 1.30 something (split adjusted) so for me, every day is a 100% up or down day lately ;-)", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I've never been in sndk. I don't believe in tech commodities. (Memory) just in tech consumer (apple, etc) and consumer entertainment. ", "score": 1, "replies": []}, {"body": "I hate Apple for helping to kill Flash, a technology that I enjoyed using to create web content.", "score": 1, "replies": []}]}]}]}]}, {"body": "I have not had a bearish bet on Apple work in over two years, so I am probably wrong on the timing again. ", "score": 1, "replies": []}, {"body": "I'm on the other side of this trade: https://i.imgur.com/iyZOVr2.png. As of last Friday, I'm down a lot on my calls but we should just wait it out and see.", "score": 1, "replies": []}, {"body": "I think the biggest thing we need is raised guidance for the next quarter obviously since were suppose to come upon the \"Mother of all upgrades\" and possibly a iWatch. But the next thing comes back to iphone numbers like always. Last quarter we got a beat because of China Mobile and if you have been paying attention Samsung just got killed this recent quarter in China. Why? Hopefully iphone!! But it could be the likes of xiamoi ", "score": 1, "replies": []}, {"body": "Stocks that go to $90 go to $100.\n\nGl though.", "score": 1, "replies": []}]}
