{"title": "What are your investment criteria for buying individual stocks? ", "selftext": "Out of curiosity, how do you typically decide whether to buy a stock? Do you rely on valuations (DCF, DDM, comparable companies analysis) or simply review financial statements?\n\nI usually go through 10-K reports, stay up-to-date with news, and listen to earnings calls to gauge management's expectations. However, I'm considering creating DCF, DDM, and multiples templates for quick and dirty valuations, along with tools for portfolio management for better decision making.\n\nI avoid investing in hyped companies (I never bought Nvidia, which in hindsight was a mistake) and focus on companies that are profitable and likely to remain so. I've also learned to avoid companies making risky acquisitions (lesson from Farfetch). While I haven't had huge returns, I rarely incur big losses with this approach.\n\nIs there anything else you consider? \n\nEdit: updated what I meant by valuation ", "id": "1ee1uqa", "created_utc": 1722151343.0, "score": 94, "upvote_ratio": 0.9, "num_comments": 109, "comments": [{"body": "I believe making complicated models and adding more data will give you a false sense of confidence that your valuation is accurate. I think that's because people believe effort is correlated to quality.\n\nI understand that my answer seems the most unreasonable.\n\nThe most important thing I consider is whether the company fits into my long-term vision of the future. See how bad it sounds? My vision could be completely wrong. And it's not quantitative. \n\nAn analogy would be cooking. Two people can be given the same cooking recipe. The world-class chef sees in their mind what they want the end product to look like, and they've cooked many times before, so they know what works and what doesn't. Their finished product is spectacular. The beginner that follows the recipe, or instructions from a world-class chef will have a finished product that is completely different and likely far from spectacular. \n\nThis is the hardest thing to communicate to investors because the only difference between vision and a delusional nutjob is the end result. \n\n\n5 years ago, \n\nIntel had net income of 21B and market cap 224B - now 133B\n\nAMD had net income of 0.3B and market cap of 33B - now 226B (I sold this already)\n\nNVDA had income of 2.8B and market cap of 102B.\n\nHow do you justify NVDA or AMD as investments at the time? NVDA revenues declined 5 years ago whereas INTC revenues increased. AMD revenues increased by less than 4% YoY.\n\nQuantitatively, INTC seems like the best investment 5 years ago.\n\nBut it was NVDA and AMD that crushed the SP500 while INTC massively underperformed.\n\nHow do you explain that to someone? How do you tell them it's how the company lines up with how you see the future when no one can predict the future? You can't. But that's the answer.", "score": 241, "replies": [{"body": "I seriously love everything about this response.", "score": 48, "replies": [{"body": "They made a lot of effort so the response must be quality.", "score": 18, "replies": [{"body": "so it is the top management", "score": 1, "replies": []}]}]}, {"body": "Like your answer, we don't have the crystal ball so your gut feeling approach is completely valid. I'm sure that if you made a detailed analysis of INTC and AMD NVDA back then you probably had a misleading result and bought INTC. All we have is (as you said) the present and the perspective to the future, maybe complemented with some revenue sheets and its trend.", "score": 5, "replies": [{"body": "Well we do have a crystal ball, it's called logic and reasoning. You can correctly predict the future, Nvidia is built upon this.", "score": 0, "replies": [{"body": "Yeah, I had a feeling back in 2021 with NVDA, I saw they were doing great advance in GPUs and developing today's AI tech but I was weak and sold it in the first big down. I though AI will be something that we will experience 10 years ahead and I don't wanted to wait so much, fool of me it was sooner that what I expected.", "score": 4, "replies": []}]}]}, {"body": "That’s because you don’t understand the products. Ask a PC hardware nerd even 5 years ago and they’d tell you that Intel was slowly getting trounced by AMD in the consumer CPU market. Their Threadripper enterprise chips were a big hit as well and a much better value than anything Intel was producing. Simply takes time to claw away market share from a legacy behemoth like Intel.\n\nWith Nvidia it was a lot harder to read the tea leaves. While they were already dominant in the GPU space, they benefited from massive tailwinds in the form of cryptocurrency mining and then the AI craze.\n\nMy point is that most people who do surface level research or DCF models have a pretty poor understanding of the companies themselves and the actual products they sell.", "score": 17, "replies": [{"body": "While I agree with you one should take not that consumer CPU is a very small part of the global market. The real money is in servers, and Intel could easily dominate gaming and be reddit darling yet flop miserably if they missed out on data centers.\n\n\n\nAnd it's quite interesting how people used to laugh because AMD got to make the cards for consoles because it was a \"low revenue market\", yet that very same project gave them the liquidity they needed and a secure multi-million unit market tahg allowed them to jump forwards and become the rising company that is AMD now. Hadn't they made chips for the Ps4/Xbox Whatever things would look very different...or if Intel/nVidia had taken the deal instead.", "score": 10, "replies": []}, {"body": "In my limited experience, I don't think that even being the brains behind a company gives you enough insight to know how buyers and seller will react. I have followed things that have very, very simple products and business models to follow, specifically to have some \"easy\" practice with this method of gauging how a stock will do. Even that has proved unreliable to me.", "score": 1, "replies": [{"body": "I can’t even tell if my own company is doing well.  Some companies are massive and it’s hard to figure it all out", "score": 1, "replies": []}]}]}, {"body": "I rarely agreed with any comments on this sub, or the value-investing related reddit sub, but this is one i concurred with this very much.\n\nI'm lucky to have met Warren on one occasion a few years ago, and we both agreed that the most important concept of value investing is to view a stock as a fractional ownership of a business. Sounds simple, but it's not easy to adhere to. i.e. if you really see yourselves as an owner, you would do far more than just see-ing balance sheets on screeners, nor reading their earnings call and annual reports; you would literally take steps you know EVERYTHING about the business and its management, competitions, customers' preference, products and services they serves, profit margins, and many more, etc.", "score": 4, "replies": []}, {"body": "Makes sense, I think that's a reasonable answer", "score": 6, "replies": [{"body": "Reasonable > Rational", "score": 1, "replies": []}]}]}, {"body": "If I like the company I buy the stock 👍🏼", "score": 60, "replies": [{"body": "Big if true", "score": 10, "replies": []}, {"body": "Tell that to my DIS shares that have done nothing but hemorrhage money lol", "score": 5, "replies": [{"body": "Why did you like DIS? Are you really into bad race-swapped reboots and milking once-loved franchises for all they're worth?", "score": 2, "replies": []}]}, {"body": "This is legit why I bought COST", "score": 1, "replies": []}, {"body": "This for me too. If I have been a happy custo.er, and like to use their products and/or services, then I invest. I don't do any research more than my own opinion or experience on their products and services. That's why I don't invest in Apple, for example, I hate the iphone, but love the Pixel, so I invest in Google instead. I don't support Facebook, so I don't invest in Meta. I do all my grocery shopping with my Walmart+ account, and love the service, so WMT is close to 20% of my portfolio. Etc", "score": -3, "replies": [{"body": "Yikes.", "score": 5, "replies": []}, {"body": "Does that mean you buy the stock at any price or do you put in some thought into that?", "score": 1, "replies": [{"body": "Nope. Just to hold long term if the products or services I receive are good and I can see many more people using them as well.", "score": -1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 16, "replies": [{"body": "That’s a great thought experiment for whether you really believe in a company or if you’re riding momentum. Also to test if you’re investing a comfortable amount", "score": 4, "replies": []}, {"body": "My temperament would be tested if my investment declines 50% in value, regardless of how good the business is.", "score": 1, "replies": []}]}, {"body": "If you see it pop up in Reddit stock threads a lot, approach with caution", "score": 12, "replies": []}, {"body": "1. Understand the business, business model, market etc. How does the company create value and where in the value chain do they operate? Does the business model make sense in terms of risk/reward for me?\n2. Review finances, does the numbers make sense and are they “good” considering step 1. \n3. Quick and dirty valuation. This hugely depends on the industry, business model and business itself, but for a “normal” business I try to find three things: what is the underlying (normalised) cash flow generated if the company stopped investing for growth today, what ROI does the company generate on new investments and at what reinvestment rates today + long-term, what risks is the company exposed to. If you have a take on these things, you can quickly judge the value by using whatever valuation methodology. Multiples are a short-cut dcf, where I personally use ev/ebit, fcf-yield and ev/s a lot. I believe ev/s (or p/s) is the most underrated multiple if used correctly.", "score": 12, "replies": []}, {"body": "1) Understand where the world is heading and what the future will have to be about\n2) Select the companies that are working towards achieving that future \n3) Filter only the winners who seem to be increasing their revenus and net income/FCF steadily \n4) Use AT to get inl/out", "score": 20, "replies": [{"body": "> understand where the world is heading and what the future will have to be about \n\nOh, only that? Simple! lol", "score": 8, "replies": [{"body": "It's his way of saying RESEARCH, RESEARCH, RESEARCH", "score": 3, "replies": [{"body": "Or just do research on one's job instead of stock that aren't related to oneself at all. VTI(as a fund, not individual stock) is possibly most related as it is the economy, so we would likely to see growth of economy, except one is very pessimistic.", "score": 1, "replies": []}]}, {"body": "Yes, but not for those with low intelligence.", "score": 0, "replies": []}]}, {"body": "1 and 2 are so hard to actually make them work. Your idea of the future and what actually happens can be two different things. I might believe AI is the future and go all in on AI stocks but what if I’m ahead of my time. That will be a huge opportunity cost. \n\nI do get what you are trying to say though. I believe investing in something like VOO takes the guesswork out of it. Let the market decide what is important and you get to always bet on the winning horse.", "score": 1, "replies": [{"body": "The opportunity cost in the ride the markets intelligence is you lose the massive potential gains that come with picking a winner. These massive gains can compensate even for many selected losers, plus interest", "score": 2, "replies": [{"body": "Fair enough. Given my luck i know I’ll pick all losers", "score": 2, "replies": [{"body": "Most people do.", "score": 2, "replies": [{"body": "The idea is you create an investment thesis, and principles for how to invest. You follow them through for long term, say 5-10 years on a handful of companies. You could also do so without money by just keeping up with companies. Eventually, you may discover that you are able to pick out companies that have incredible growth potential and decide you can make money off of them using the same investment thesis strategy and principles.\n\nEven with amazing strategies and principles, this won’t always work. That’s where time comes into play. You try and try and try again over a lifetime. Things compound. Things average out. Methods that win more than they lose eventually emerge through statistical probability. How soon that happens is a measure of luck. It is also a measure of luck that it happens before you give up and miss that you actually had a winning strategy.\n\nLife is an interesting game, but you’ve gotta play it to figure out the rules. It is also probabilistic, not deterministic.", "score": 1, "replies": []}]}]}]}, {"body": "You're not betting on the winning horse when you let the market decide, you're betting on everybody and on average the winners are winning so much that the average comes down to ~7% annually  because of all the losers, on the long term because we as humans are developing globally. The truth is it's easy t see what the future will be like regarding some physical realities. For instance everybody loves to trash Tesla because of Elon Musk, but the truth is there is no future without EVS because oil is finite. It is a physical constraint. I personally invest in Tesla asuch as I can because I understand and know that EVs will have to be huge otherwise we as a society will face a very big problem. That's just an example.", "score": 1, "replies": []}]}, {"body": "Yep", "score": 0, "replies": []}]}, {"body": "There are already a lot of good points, so I won’t rewrite them. Before investing, I always try to understand a company's strategy, what they are trying to achieve with it, and why it is a better strategy than their competitors.", "score": 7, "replies": []}, {"body": "Simple:\n- small to midcap size: easy understandable business model that can scale\n- proven, sustainably growing topline (must imply operating in growing markets with major underlying trends like e.g. decarbonization)\n- only profitable, strongly cash generating companies. Cash flow is king. This needs to be reflected also in their IR presentations language.\n- Experienced, educated and hungry for success management \n- fairly (under-) valued", "score": 6, "replies": [{"body": "Undervalued is subjective. Ideally it’s best to get in at the lowest possible value, but if you believe in a company’s growth their value will inevitably be undervalued at this moment in time (if your belief is true) compared with some point in the future (your exit).", "score": 2, "replies": []}]}, {"body": "I ask myself 3 questions. Is it MSFT? Is it AMZN? And is it GOOG? If any of those criteria are met, I buy.", "score": 6, "replies": [{"body": "Ha! I have an irrational collection of Amazon and Microsoft. When they zoom down I buy more!", "score": 3, "replies": []}, {"body": "Haha", "score": 1, "replies": []}]}, {"body": "I use a super simple approach that has served me well. It’s based on the actual product the company offers and my enjoyment/usage of it. When I find a product that I love and is soundly better than what the competition is offering in that industry, I buy the stock as long as the PE isn’t wildly out of wack. And then on the other side, I never buy shares in a company whose product I either don’t use or don’t understand intimately. I like to invest close to home. \n\nThis is how I’ve chosen some of my larger individual holding and it’s served me well: Apple, Amazon, Uber, Lululemon, Reddit to name a few.", "score": 5, "replies": []}, {"body": "We do look at last 5 years of revenue, profit, cash, ebidta, Yada Yada… We look at how much capital they are reinvesting, that signals to us they are investing in their future growth rather than paying dividends to attract share holders.  We look at their management.  We also like to look at their 5 year returns vs the S&P 500, if they aren’t beating that, what’s the point in our minds as you are better off just going with $VOO.  Some of it is trying to predict the future as well.  For example, consumer debt is completely out of control.  The main reason is credit card debt.  The major companies that own the debt are JPM & AXP.  There looks to be no end insight for changes there, people continue to spend and credit card debt is over $1T with APRs over 22%.  With that said those few companies in the Financial sector have an advantage than others that are simply banking institutions. Both of those companies have beat the S&P 500 over the past 5 years.", "score": 8, "replies": []}, {"body": "Number one - growth story - I don’t care about financials if I don’t believe in the future MOAT, growth, peer vs industry\n\nIf number one is green lit, I look at ROIC and margin to WACC\n\nAfter that I look at debt and maturities and current ratio. That’s all", "score": 6, "replies": [{"body": "not bad", "score": 2, "replies": []}]}, {"body": "I look for market irrationalities. Areas where likely future growth or good news doesn’t seem to have been priced in, or where the market’s showing excessive pessimism that I disagree with.", "score": 3, "replies": []}, {"body": "I'll briefly check the Financials to make sure it's not a dumpster fire and will check out the management to make sure they aren't clowns, but overall it's based on me just being excited by the company to the point that i start passively thinking about other things i can sell to buy some of it.\n\nI know from experience that I don't make good decisions about stocks that I'm not personally interested in even if they have good numbers.", "score": 2, "replies": []}, {"body": "I read a great interview years ago with a billionaire, he basically looked for companies that have a high probability of becoming a gatekeeper for that particular market segment. He didn't really care if they are nice companies or if their products were good or bad. A great example is he invested in Microsoft in the 1990's even though Apple was seen as the market leader, because he saw Microsoft becoming a gatekeeper company more so than Apple, same for Google and Amazon in the late 1990's. Nvidia is an excellent example of a company that out of the blue became a gatekeeper company and will stay that way for a while.", "score": 2, "replies": []}, {"body": ">Do you rely on valuations or simply review financial statements?\n\nBoth, but not much on valuations. Valuations are a great way to sanity-check myself.\n\n>I never bought Nvidia, which in hindsight was a mistake\n\nInterestingly enough I don't consider it a mistake in my case. I never bought it either, but I also didn't by Celsius at $90. Or Lululemon at $450. Or pretty much any EV producer in 2021. Even with hindsight I didn't have the information that would've made Nvidia a better buy relative to other hyped stocks, so I don't beat myself up over it.", "score": 3, "replies": [{"body": "Do you really value all companies you come across or do you also do something quick and dirty?", "score": 1, "replies": [{"body": "Would you lend your money to someone random that you met for the first time with 0 information about them?", "score": 3, "replies": [{"body": "Never!", "score": 1, "replies": [{"body": "You got your answer", "score": 2, "replies": []}]}]}, {"body": "Wait, I have to ask now: What do you mean by valuations? I thought you were talking about market valuation metrics (like PE being the most simple one).", "score": 1, "replies": [{"body": "Oh no, I meant doing full fledge DCF, DDM, etc. analyses (the ones we only learnt in b-school) to understand the company and it's intrinsic value lol", "score": 2, "replies": [{"body": "Ah, no I don't spend much time on those. I believe the market is highly efficient so in my view almost all companies are already valued in accordance to those just because everyone and their grandma can do a formal DCF. I prefer to focus on quality factors that can't easily be quantified because I know if it can easily be quantified, it definitely has been and as such is very likely priced in. A proper model can take hours to make and I prefer to spend that time elsewhere, like reading their past reports, reports of competitors, reports of customers, reports of companies in the industry that produces their input materials (if their inputs are volatile or significant), there's a long list of things you can read and only so much time.\n\nRough DCFs are a great way to figure out the margin of safety, though, but I don't tune those much.", "score": 1, "replies": []}]}]}]}]}, {"body": "Revenue. No Chinese. No israel. No cayman islands. Good balance sheet. Insider buying. And even then sometimes they go to zero", "score": 2, "replies": []}, {"body": "Trend following using technical analysis, trend lines résistances supports and volume", "score": 1, "replies": []}, {"body": "Is NVDA not profitable?", "score": 1, "replies": [{"body": "It is but I didn't buy it because I just didn't think it would go up more. I'm more focused on not losing money vs making a lot of money", "score": 3, "replies": [{"body": "Then buy bonds....\n\nThere's absolutely no point in even thinking about an individual stock if that's what you're doing", "score": 4, "replies": []}]}]}, {"body": "i mostly just gauge whether i think the market reacted too harshly, dipped way too much and will very likely go back up. these cases are very few and far in between but SMCI is an example from the other day.", "score": 1, "replies": []}, {"body": "I keep a lot of what I deem interesting, for any number of reasons, on a watchlist. When I add it’s usually with interest to buy, usually because I believe in growth over the next several years. Sometimes just because I think the company is undervalued, or what I would deem an earnings overreaction. \n\nI generally have a pretty simple spreadsheet to forecast the next few years simple metrics with some variable inputs (margin, growth rate) for those on the watchlist. I’ll passively keep up with news, check in on earnings, but really above all just wait for what I deem an opportunistic entry to go long.\n\nSome I “miss” because they never hit a buy point I’m comfortable with, but there is always another opportunity. I try not to get married to the idea of any one company to avoid buying in at any cost.", "score": 1, "replies": []}, {"body": "Performance charts, not buying too high, do I like anything about the company.", "score": 1, "replies": []}, {"body": "Vibes", "score": 1, "replies": []}, {"body": "It buy it when it’s low and sell it when’s it’s high.", "score": 1, "replies": []}, {"body": "p/e, p/fcf from the last 10 years gives me an idea on value and what price to buy on weakness. News and Litigation gets buried sometimes, so it's always good to do a quick search on a company.... like Visa.", "score": 1, "replies": []}, {"body": "Overall 5 year uptrend currently trading at a trough in its chart. Decent business", "score": 1, "replies": []}, {"body": "Not super MAGA", "score": 1, "replies": []}, {"body": "Usually starts with finding a company I like in a sector I like.  Then I go look for reasons not to buy it.  If I don't find a compelling reason, then I buy it.  What I look at is stuff like financial health, my fee fees about the future for the niche they're in and the economy in the next several years, their current valuation, how they've performed vs competitors, how they've performed vs the market in general, how strongly they're correlated with the market in general, beta, what's already in my portfolio, skimming analyst reports, etc.  What I like is very non-technical feelings.  Like if I'm nervous about the future or I think my portfolio is running on the risky side, I might be looking at leaders in more boring market sectors.  When things go poorly (e.g. 2022), I might be looking for deals.  \n\nThe harder part for me is figuring out when/how to get out.  \n\nNot buying a stock isn't really a mistake, it's a non-event.  There's *always* that company you didn't buy.  What matters is how well you do on what you buy.  So in your scenario, the mistake would have been buying intel.  Like, if you wanted in on semiconductors, NVDA would have been great... but so would broadcom, kla, amat, etc.  There was no shortage of opportunity.", "score": 1, "replies": []}, {"body": "Tradesmith", "score": 1, "replies": []}, {"body": "It goes up and to the right", "score": 1, "replies": []}, {"body": "Is it profitable is number one (lost a lot of money on non profitable stuff in the past)", "score": 1, "replies": []}, {"body": "The CEOs   track record /  profit / valuation.", "score": 1, "replies": []}, {"body": "You can test run your favorite in very little amount in fractional shares. You can't just buy one or a few stocks in large amounts, unless you have that much income to begin with. Cash flows of companies, profits and prospects, etc are comparable to individuals' abilities to earn money.\n\nThose who buy individual stocks and earn large amounts are just lucky.\n\nI test run my small cap portfolio, and a portfolio a mix of mega and mid cap for 2 years. They have not yet beaten VTI.\n\nThe criteria for me to buy individual stocks is to buy those that are not well known to people, if it ever become mega cap in the future, I can say it is my pick, not anyone's.", "score": 1, "replies": []}, {"body": "I think there are cases in which the market is clearly inefficient. Those are the cases in which individual stock selection makes sense. \n\nYou accept that the longest term of ownership may be a shorter horizon than a lifelong hold. The most recent example I can think of is RTX - bottomed last year at $75 over liabilities associated with part of the Pratt & Whitney business. Well, they also supply the most amount of weaponry to Israel. Turns out the market was wrong. \n\nI limit my hypothetical buys to stocks where I can see the value (low p/e compared to peers, future benefits not priced in, capex not in excess of net income, not highly levered, and share repurchases are prioritized). In addition, I’m not afraid to take a short term 10% gain and walk away if the thesis plays out sooner than I think it will.", "score": 1, "replies": []}, {"body": "Hmm. \n\nFirst of all I try to keep my overall exposure to any single company to less then 5%. \n\nThen I look at the company overall. Is it stable? Is it hyped? If it’s hyped I won’t buy it. No idea where it will end up. \n\nThen I look at cnn forecast. If it’s not listed there it’s not big and stable enough to be analyzed so then I don’t buy it. I look at the forecast and if the median estimate is more then 5% negative then I don’t buy it. \n\nYou can look at the French oil company Total, if you want to know what I look for. Compare it with Nvidia. \n\nI try not to own more then 10 stocks at any given time.", "score": 1, "replies": []}, {"body": "When im Drunk i buy some mag7 and go sleep, simple", "score": 1, "replies": []}, {"body": "Market leaders, competitive advantages, good balance sheets.", "score": 1, "replies": []}, {"body": "Buy when the market is down and the company has strong fundamentals. Ive only ever bought stocks during COVID. Made about 30-40% profit in about 2-3 weeks on two of them. Would have made 50% profit in 18 months if I had held onto the third. The last one was a gold mine operation that was tanking until Russia invaded Ukraine.", "score": 1, "replies": []}, {"body": "Whatever piques my interest repetitively enough in the amount of time that I am willing to dedicate each day to reading stock news. I put a shit ton of time into it when I was unemployed because I had nothing else to do, but it just isn't good for my mental to choose to neurotically obsess over something that I have come to feel is worse than than gambling at a casino. The problem for me and stocks is that I so badly want to rationalize things, answer questions I have, figure out why or how I could have done better or avoided doing bad, etc when the reality is that just isn't how it works. I really did try and go in on it for a few months, but I don't feel like it did me any good compared to the times I just went with my gut feeling. The opportunity cost of choosing to try and predict and make total sense any of it versus doing anything else in life is substantial. There are no consistent correlations, nor causations. I would honestly rather just go to a casino and play things such as roulette, or bet on coin flips. That way, I know that there is nothing that I can actually do to increase my chances of being correct. I know that it is pure chance, and in practice is as random as random may be. I can't be mad at myself thinking that I failed or could have done something better, because that isn't it. I was just unlucky and thats it. It wouldn't be my fault, and there is no way for me to doubt that and be hard on myself.", "score": 1, "replies": []}, {"body": "I'm recklessly opportunistic these days and go mostly by prevailing social sentiment coupled with bare-bones research.\n\n\nThat said, one of the big rules for me is to be fairly aggressive with stop-losses (not that my broker appears to give a shit about the price limit). I wait for a 5% gain, then set it just below that and update it regularly. If the stop-loss is triggered, I reevaluate and either cash in again (usually at a lower price) or roll the gains into something else.\n\n\nI also try not to get too attached to losers. If it drops by 15% I again reassess, but likely cash out and move on.\n\n\nAs time moves on, though, I'm trying to get back to understanding financial reports again, as well as learning about technicals.", "score": 1, "replies": []}, {"body": "Buy what i can understand or personally use for eg apple, google, nvda, walmart amazon etc all i and i know everyone else uses and just buy and hold no looking at market other than once a year", "score": 1, "replies": []}, {"body": "Technicals and simple fundamentals data. I absolutely never read statements or listen to earnings calls", "score": 1, "replies": []}, {"body": "Easy.\nThey have to be profitable, Increasing revenues, increasing cashflows, and are they the leaders.", "score": 1, "replies": []}, {"body": "I only buy Blue chips or FAANG size companies.  I don't bother with the small caps since it'll just keep me up at night.\n\nThen I look at 10-K just to make sure there are no red flags compared to their peers in the segment.\n\nThen I look at 5 year technical charts, comparing to competitors in their segment", "score": 1, "replies": []}, {"body": "High ROIC, high FCF, established and predictable, consistent organic growth (not acquisitions), big moat (or ideally a monopoly/duopoly), some degree of pricing power, high quality humans at the c-suite level, preferably a US company, a small dividend is nice but not critical, it also must pass the ethereal indescribable vibe check (no spooky feelings in my head @ initial entry), and this one is important– I need to be able to describe the company, (products, services, revenue streams etc) to my mother, effectively enough for her to have a basic understanding of who they are and what they do.\n\nOnce these criteria are satisfactorily met, it just comes down to is the price right. There are so many outstanding companies that I want to own but just can’t reconcile with their current valuation. I want a deal on it.\n\nThe real meat n potatoes of my individual positions fit this framework. Then I have a small taxable brokerage where I go buck wild speculation mode and let ‘er rip, just to scratch the itch.\n\nStock selection is not the whole battle though. You have to emotionally withdraw yourself to weather volatility. Like if a monk ate a robot. If a stock takes a haircut, is it for a real reason or just jittery sentiment? If you can’t point to hard data to back up a revised thesis, don’t sell. Embrace the discipline, reject the pivot. You should construct a buy criteria and a sell criteria and then adhere to it. The selling part is where I struggle the most, it’s hard to let go of a rocket. IT IS NOT ABOUT THE JOURNEY, IT IS ABOUT THE DESTINATION. FUCK THE JOURNEY.", "score": 1, "replies": []}, {"body": "I just follow the Peter Lynch method. Find a company/ product you like, find out more about the company, CEO, future plans, etc.  Do some mental calculations about its potential market, check out a bit about the competitors, and how likely it is that it will grow, and then buy/ don't buy the stock.\nI never buy the \"hot item\" on the stock market. Any explosive growth that makes people buy has already happened.", "score": 1, "replies": []}, {"body": "I flip the coin it works every time lol", "score": 1, "replies": []}, {"body": "Mostly FOMO", "score": 1, "replies": []}, {"body": "If it has moats as wide as MSFT", "score": 1, "replies": []}, {"body": "PM me later and repeat the question.", "score": 1, "replies": []}, {"body": "I’m not clever enough to do all this financial stuff, so just go on real world applications of IP mostly", "score": 1, "replies": [{"body": "Same, and using gut feeling after a cursory glance at a few charts and reading countless Reddit comments.", "score": 2, "replies": []}]}, {"body": "Dividends:  Dividends and more Devidends: supported by good cash flow.", "score": 0, "replies": []}]}
{"title": "NVIDIA earnings potential", "selftext": "Hey, I wanted to ask wider community if it might or might not be a good idea to invest into NVIDIA buy cfds before the report and sell them after the market opens the next day. According to historical data, it should probably be a big boom and it should overcome the earnings expactions and so it could or rather should skyrocket, but I'm not sure, since I've lost some money on cfds and am much more cautious about this kind of investing.", "id": "1eed7ke", "created_utc": 1722188914.0, "score": 133, "upvote_ratio": 0.83, "num_comments": 112, "comments": [{"body": "No one really knows. \nGoogle earnings were quite good and they dropped 5% on the next day and kept going down for a while. \n\nSometimes it’s just not logic, so for that reason, entering a position just for the “ earnings effect “ it’s like casino in my opinion. \n\nYou better be able to hold your position if it comes down -10% anytime soon. If you cannot, don’t enter.", "score": 210, "replies": [{"body": "Yea I’ve noticed that a lot times price goes down after earnings even if it’s good. I think this is because everyone expects them to beat expectations", "score": 45, "replies": [{"body": "Even when they beat expectations it might happen.", "score": 48, "replies": [{"body": "Because they didn't beat expectations by *enough*. Don't get me wrong, I understand setting sights high, but I think people expect certain companies to make *more and more* money *endlessly*. At a certain point can't we be happy with the fact that the company made good money, met expectations, and defended their moat?", "score": 34, "replies": [{"body": "It’s all based on perception and questions about the company. If you have a company like NVDA that has been in the spotlight the whole year and we all know is making a ton of money, whether they beat expectation by 500 million or many billions, it doesn’t really matter, the questions about the company are not gonna be answered in the next or even the next two earnings. Now if you have another company that has POTENTIAL to earn a lot of money but has not yet and they have a lot of questions surrounding their chances of growing revenue enough or becoming profitable and they beat expectations then that stock has a much higher chance of shooting upwards because that earnings answers some of the questions", "score": 10, "replies": []}, {"body": "Stocks don't care about your feelings. Investors want a return on their money, they aren't going to pay up for a business that doesn't grow. Just accept it.", "score": 5, "replies": []}, {"body": "Analysts suck. If you aren’t investing for long term then you are gambling.", "score": 0, "replies": []}]}]}, {"body": "I thought it was because a monkey is pushing red and green buttons behind a curtain and sometimes the monkey isn't too bright and makes a mistake.", "score": 11, "replies": []}, {"body": "Well expectations are normally set very low, in order that these large caps can beat them. Some are even using their investor relations to guide analysts or to give them some hints about „errors“ in their valuations. So a slight beat often is nothing special", "score": 3, "replies": []}, {"body": "Some folks also just jump from one earnings report to another, causing a bit of a spike before earnings and a drop after earnings.", "score": 2, "replies": []}, {"body": "Buy on rumor, sell on news.", "score": 2, "replies": []}, {"body": "Its because of short-term investors who get in expecting a sizeable pop at earnings. When that doesnt happen (because the pop was already priced in) they pull their money and move onto the next ticker with a catalyst.", "score": 1, "replies": []}, {"body": "Umm... They actually have a name for that...\n\n# “Buy The Rumor, Sell The News”\n\n*“Buy the rumor, sell the news” is a common adage in the trading world, especially in volatile markets where information and speculation drive price movements. This strategy is based on the concept of trading on market expectations and speculation, and then selling on the actual new events or announcements.*\n\n![gif](emote|free_emotes_pack|give_upvote)", "score": 1, "replies": []}, {"body": "Yes spot on. The effect is already priced in, so instead of going up, the stock goes down.", "score": 0, "replies": [{"body": "that’s not true", "score": 2, "replies": []}]}]}, {"body": "Exactly what happened to me. Bought Googl just before earnings and took the days of pounding that followed. Just gonna grandfather it at this point", "score": 3, "replies": [{"body": "Just wait \nGoogle will recover", "score": 1, "replies": []}]}, {"body": "Exactly this", "score": 2, "replies": []}, {"body": "As far is a remember Google presented a bad guidance, which was the primary reason for the drop.", "score": 2, "replies": [{"body": "If it was not a bad guidance was something else\n- the office windows are not nice -5%\n- they terminated 5 people in 100,000 employees -5%\n- Google ceo bought a new house -10%\n\nWe try to justify market moves , that’s just not possible.", "score": 1, "replies": []}]}, {"body": "Think of earning's as reports of the future, Google showed weakness, that's why it dropped. There were concerns in the report. Face value all's fine, digging deeper it's foreshadowing.", "score": 3, "replies": []}, {"body": "Launching of SearchGPT created a huge suspicion about Google's future", "score": 1, "replies": []}, {"body": "[deleted]", "score": -3, "replies": [{"body": "I guess we can have 100 points of view and different interpretations.", "score": 5, "replies": []}, {"body": "No he didn’t say that", "score": 2, "replies": []}, {"body": "Why dis Tesla go up!? They have a terrible report.", "score": 1, "replies": [{"body": "After the report they were -12% pre market and continued . They did not recover on the same day", "score": 3, "replies": []}]}]}]}, {"body": "I'm proudly holding, no panic.", "score": 25, "replies": [{"body": "Same. MSFT also.", "score": 13, "replies": []}]}, {"body": "TSMC and other vendors have already reported that Nvidia has increased their existing orders for Blackwell chips for this Fall by 25%. ServiceNow just reported blowout earnings quarter their entire AI stack is powered by Nvidia - Mark Zuckerberg and Jensen Huang will speak Monday at Siggraph 2024 about the future of AI. Jensen is also doing a fireside chat with Wired tomorrow. Could give more details of what to expect.", "score": 28, "replies": []}, {"body": "Expected NVIDIA price volatility based on earnings weeks of the last 24 months:\n\nUpward volatility: $121.44 to $129.83\n\nDownward volatility: $109.76 to $106.47", "score": 68, "replies": [{"body": "We already touched that $106 mark. IMHO I think we see $100. I think the Mag7 will correct even more.", "score": 5, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "I think the price of future gains of NVDA are already priced in and the selloff to cash in on gains.", "score": 5, "replies": [{"body": "Felt like a pump euphoria and when it hit high 130s dump time. Didn't think of flipping but some do or had big options", "score": 2, "replies": []}]}, {"body": "I think he is bidding against the company. Prob, one of the people who ordered put options at $98", "score": 2, "replies": []}, {"body": "Bill gates and George soros of course", "score": 1, "replies": []}]}, {"body": "Agree. Just sharing the numbers based on the latest 24 months of data.", "score": 5, "replies": []}]}]}, {"body": "I would just buy shares for the long-run return. Nvidia and Microsoft will pay for UBI with their AGI labor.", "score": 17, "replies": []}, {"body": "Yes mabye no", "score": 43, "replies": [{"body": "Gonna go with mabye on this one. ", "score": 4, "replies": []}]}, {"body": "My gut feeling tells me the current hunger for AI chips comes from all companies not wanting to miss out on the AI boom and buying all the chips they can get their hands on. \n\nWe did this in my previous company. Everyone was super hyped we had a GPU machine to train on. The expectations of the outcomes were stratospheric. In the end no one used it and it got scrapped. Instead we bought a vendor solution. \n\nI think the same will happen with all these gpus being bought to data centers. \n\nNvidia and these other companies will continue to do well but extrapolating from the current purchasing trend is a bit risky imho.", "score": 23, "replies": [{"body": "Where do you think these data centres or third party solutions get their chips? This is the basis of the monopoly Nvidia has over the market.", "score": 10, "replies": []}]}, {"body": "I have a call for NVDIA for expiring sept 20 at a 125 strike price. Do with that what you want. Also as in the words of Warren buffet when people are fearful, be greedy. When people are greedy, be fearful. Right now I see a lot of fear surrounding the mag 7", "score": 13, "replies": [{"body": "I think hesitant/cautious is more accurate than fearful. \nBeing greedy when others are fearful would be waiting for a crash of 20% or more and then deploying the cash. Buffett can do it, I certainly can’t. Along with Buffett’s wise words there are Peter Lynch’s also wise words that more money has been lost waiting for corrections than in corrections.", "score": 8, "replies": [{"body": "Nvidia down roughly 20% - moving it Into the correction/bear Market.", "score": 1, "replies": [{"body": "Fair enough", "score": 1, "replies": []}]}]}]}, {"body": "I suspect the numbers will be good.  But honestly the most bullish thing is the fact Google is going to spend $48 billion on AI infrastructure.\n\nNow they will spend that on their own chips mostly and it will be going to TSMC.    \n\nBut it means the Google competitors will also have to counter and they do not have their own chips like Google so will be going to Nvidia and paying the Nvidia tax.\n\nSo companies like Microsoft will increase their spend to try to stay competitive with Google.", "score": 22, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "We can only suspect.   Nobody but Nvidia knows for sure.\n\nBut Google announcing they are going to spend almost $50 billion on their owns chips is actually bullish for Nvidia as Microsoft and the others will have to counter.   Microsoft will be forced to pay the Nvidia tax though.", "score": 6, "replies": []}]}]}, {"body": "That works great, till it doesn't. Nvidia only has to miss the whisper number by a little and it could get crushed. Heaven help you if any competitor chips make a big splash. It's unlikely Nvidia will own this space forever.", "score": 4, "replies": [{"body": "crushed? why because their stock price dropped? They’re a fantastic company, stock price doesn’t indicate the quality of the business. AI is going nowhere and Nvidia, regardless if their stock price drops in the short term, are the industry leaders by a light year.", "score": 8, "replies": [{"body": "The anthropic ceo doesn't see it that way.", "score": 0, "replies": [{"body": "because he's taking profits?", "score": 3, "replies": []}]}]}]}, {"body": "Honestly this is a great stock to hold long term. This time next yr we’ll be happy we held", "score": 9, "replies": []}, {"body": "Why CFDs and not options contracts? Or why not just direct equity.", "score": 9, "replies": [{"body": "Yea it's interesting he's going the CFD route, but my guess is that it removes IV crush and would be a cheaper alternative depending on the leverage he's using.", "score": 5, "replies": []}]}, {"body": "My advice would be to invest in ETFs untill you can answer the question yourself.", "score": 9, "replies": [{"body": "Buy ETFs, until you get the crystal ball working.", "score": 8, "replies": []}]}, {"body": "Either goes up 20 points or goes down 20 points", "score": 4, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "The case you are making here is for every big tech company that jumped on the wagon big question is can they deliver.", "score": 1, "replies": [{"body": "[deleted]", "score": -10, "replies": [{"body": "That’s a really uneducated take on the value of NVIDIA. They design the chips and create all the software. How could TSM possibly match that? They just manufacture the chips.", "score": 15, "replies": []}, {"body": "TSM is a semiconductor foundry, they make the wafers that “hold” the ICs. NVDA designs the ICs that go onto the semiconductor wafers. What you’re saying is equivalent to asking why a steel mill wouldn’t start designing and building skyscrapers if architecture firms are using their steel beams.", "score": 7, "replies": []}]}]}]}, {"body": "Earnings is priced in", "score": 1, "replies": [{"body": "I don’t even know what “it’s priced in” means anymore…\n\nLast earnings, NVDA was about $95 per share ($950 in reality, but that was before the 10:1 split, so $95 effectively at its current valuation)…after earnings, it went up drastically in a few days. I bought in 100 shares at around $101.50 - it went up to about $140 in a month or so.\n\nGranted, it has pulled back since then….\n\nBut, my point is, NVDA is unpredictable…\n\n“Priced in” is practically a catch-phrase at this point, at least where NVDA is concerned.", "score": 13, "replies": [{"body": ">I don’t even know what “it’s priced in” means anymore…\n\nYeah me neither I just know I'm supposed to say it", "score": 13, "replies": [{"body": "Congratulations. We’re both highly regarded.", "score": 5, "replies": [{"body": "Thats definitely already priced in", "score": 3, "replies": []}]}]}, {"body": "people just say it to explain something they don’t understand atp", "score": 2, "replies": []}]}]}, {"body": "When is earnings?", "score": 1, "replies": []}, {"body": "Interesting that Apple is using Google's chips instead of Nvidia.\n\n\"Apple says it uses no Nvidia GPUs to train its AI models, instead using Google's TPUs\"\n\n\nhttps://www.reuters.com/technology/apple-says-it-uses-no-nvidia-gpus-train-its-ai-models-2024-07-29/?utm_source=reddit.com&utm_source=reddit.com", "score": 1, "replies": []}, {"body": "NVDA will go crazy for the next 2 months, hell NVDA? Get NVDL", "score": 1, "replies": []}, {"body": "If you trust that Nvidia is going in the right direction in the long term, just DCA and chill. Otherwise without insider information you are just gambling.", "score": 1, "replies": []}, {"body": "105 at least", "score": 1, "replies": []}, {"body": "They haven't dropped for a while after earnings so I think this will be the one where they will drop after earnings most likely. How do I know? Feelings lol", "score": 1, "replies": []}, {"body": "This is just gambling", "score": 1, "replies": [{"body": "All investing is gambling. But there are informed gamblers, and uninformed gamblers. No one has any guarantees, but the best one can do is make an informed choice, and accept that sometimes the market moves are irrational.", "score": 1, "replies": [{"body": "Buying spy and holding for 10-20 years isn’t gambling, it is guaranteed to go up. Buying a stock to hold for one day based on news that you think will be good is 100% a coin toss.", "score": -1, "replies": []}]}]}, {"body": "Even if does go up from earnings, i think all it does is delay the inevitable, given the current trend, nvda is dropping out of the sky, i could see it going down to sub 100 - maybe 96,97. when it gets close to those numbers i will definitely be taking longs.", "score": -5, "replies": [{"body": "It was at that level like 2 months ago. Why didn’t you go long then?", "score": 16, "replies": [{"body": "there was no confluence or “signals”,  however ive been bullish on nvidia, and made plenty money playing it. All im saying is taking calls and fighting the current market trend is dumb.. any experienced trader will tell you so.", "score": 1, "replies": []}]}, {"body": "Just because the stock goes up, doesn’t mean it’s going to go crashing down to earth. Fact is, Nvidia is plenty profitable. Can go sideways for an extended time all the same.", "score": 7, "replies": [{"body": "right… which is why i said i believe it to come down to sub 100, before making new highs again. its all TA, nobody really knows i just believe that will be the sweet spot for institutional buyers to pick it back up. Just like you and everybody else though.. we dont know. i would say a move from 140 to sub 100 is pretty substantial.", "score": 1, "replies": [{"body": "I see now where the confusion lies and downvotes. I was under the impression nvidia earnings was end of july, not end of august. By August i expect  it to be up from here, but my original analysis still stands.. this is going sub 100 before moving back up", "score": 1, "replies": []}]}]}]}, {"body": "Someone tell him about capital gains taxes.", "score": 0, "replies": []}, {"body": "ITT: Speculation\n\nMy turn! Everyone already knows NVDA is killing it and they're value is super high, but they have already made most of their profit from the AI hype wave and people are starting to realize that theres not as much gold in those caves as people claim. NVDA has good earnings but still falls.", "score": -5, "replies": [{"body": "They already made most of their money from the \"AI Hype Wave\"?\n\nCare to explain your thinking here?", "score": 1, "replies": [{"body": "I mean its pretty straightforward no? Companies like Microsoft, Google etc have already made their purchases from NVDA. The next step in AI is not to continue to purchase more processing power, its to find valuable ways to leverage the massive ML farms they have in house.\n\nNVDA has already sold the gold miners the pickaxes, if those people strike it rich NVDA will only see more profits when they decide to upgrade those farms. Thats the big catch here, if companies can't leverage all this computing power to add significant revenue they will not be going back to NVDA for round 2. Its cyclical by nature and NVDA could very well be at or near the peak right now. There is no guarantee when the next cycle will be or if they will remain as dominant as they are.\n\nAlso you can just look at macrotrends and financials. NVDA revenue is up 200% yoy which is in no way sustainable unless we are heading into double Argentina levels of inflation. NVDA p/e is currently sitting at 66 which, if you subscribe to the Ben Graham school of thought, implies that not only would NVDA maintain the current massive earnings bump but they would also expect to see around 29% additional earnings growth yoy. \n\nI like NVDA as a company, they currently hold a massive advantage over everyone else in their field, but i struggle to see a future where not only does the AI hype train continue to boom, NVDA also has to manage to squeeze even more growth out of this wave for the next 5-10 years every year. It's just completely unreasonable IMHO. \n\nYeah it might not happen this earning call, the numbers are going to look incredible, but it won't hold for long.\n\nI may be early but I'm not wrong.", "score": 0, "replies": [{"body": "So you think think there will never be another generation of AI chips from Nvidia? I think your logic is flawed.", "score": 1, "replies": []}]}]}, {"body": "Nvidia can always fund \"AI datacenter\" startups with a few millions and these shell companies will buy cards worth billions. There are still many Crypto farms that need to be rebranded as AI startups.", "score": 1, "replies": [{"body": "Shell companies??\n\nRebranded crypto farms???\n\nJesse wtf are you talking about", "score": -1, "replies": [{"body": "Read about Coreweave, Lambda Labs and other such Nvidia funded \"startups\". Look up where they started and how they used RTX cards for cryptomining and then repurposed for \"AI\" workloads. Jensen says these were all bought by gamers :D he can cook more such companies who are now buying H100 and 200s.", "score": 1, "replies": [{"body": "lol, lmao even", "score": 1, "replies": []}]}]}]}]}, {"body": "Its all priced in lol", "score": -4, "replies": [{"body": "elaborate without any buzzwords", "score": 2, "replies": [{"body": "Buy now, and sell when the price drops. Your money will end up in better hands. Its good for the economy.", "score": 1, "replies": [{"body": "you’ve got absolutely no clue what you’re talking about lol. saying something is “priced in” is usually total bs.", "score": 1, "replies": [{"body": "Relax little bro, u are correct. Happy? Here’s an upvote so u get some cool internet points", "score": 1, "replies": []}]}]}]}]}]}
{"title": "Thank you so much for your guidance and support.", "selftext": "I started trading straddles and spreads this past week, which helped. As did some random pops (CERE, BLUE, others.) Many others and always NVDA and SPY (these days.) I’m going to continue, but have dropped my allocations and position sizes on wildly speculative plays and options. Also, I’ve been buying shares with gains and never did increase position size.\n\nI am so grateful to you. I’ve learned so much and have so much fun from/with you. So much love and all the best!", "id": "1edumfa", "created_utc": 1722125571.0, "score": 1543, "upvote_ratio": 0.96, "num_comments": 301, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 9 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 4943 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Wait, someone making money because of WSB? How the hell did that happen?!", "score": 879, "replies": [{"body": "Send 100 persons into a casino with some starting money. A few will come out with a few hundred percent gains. Most of them will have lost everything.", "score": 282, "replies": [{"body": "instructions unclear, I could be one of those winners. Sold house and took out second mortgage to fund one hundred gazillion dollar YOLO on SPY puts for 8/2/2024", "score": 83, "replies": [{"body": "One of us.", "score": 32, "replies": [{"body": "I never doubted it.", "score": 4, "replies": []}]}, {"body": "You’re saying there’s a chance?", "score": 14, "replies": []}, {"body": "That’s what I’m talking about. LFG 💪🏾", "score": 4, "replies": []}]}, {"body": "Oh my gourd! \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 5, "replies": []}, {"body": "This is very different he is actually using risk management and size is smart", "score": 1, "replies": []}]}, {"body": "We are all here to support one another and learn.", "score": 185, "replies": [{"body": "What did you learn? so we can learn and do stuff good too!", "score": 100, "replies": [{"body": "I literally talk specifics *all the time.* But: 1) take profit early, greed kills, and set aside 2) wait for a “fat pitch,” especially now during bull market 3) in general don’t trade over earnings, unless hedged. And learning spreads and writing now. Some things were in my nature and some intuition, but those listed, (and others I’ll add as they come to me, were not.)\n\nAlso, when one has the gist, but is still stuck after Investopedia and GOT, etc, ask - people will help. (And they understand.)", "score": 150, "replies": [{"body": "All I learned from WSB is that the crayon colors taste different. And I am pretty sure that's a lie.", "score": 137, "replies": [{"body": "![img](emote|t5_2th52|31225)![img](emote|t5_2th52|31225)![img](emote|t5_2th52|31225)![img](emote|t5_2th52|31225)![img](emote|t5_2th52|31225)![img](emote|t5_2th52|31225)![img](emote|t5_2th52|31225)![img](emote|t5_2th52|31225)![img](emote|t5_2th52|31225)![img](emote|t5_2th52|31225)![img](emote|t5_2th52|31225)![img](emote|t5_2th52|31225)![img](emote|t5_2th52|31225)![img](emote|t5_2th52|31225)![img](emote|t5_2th52|31225)![img](emote|t5_2th52|31225)\n\nYes. It’s a lie. I know from personal experience.", "score": 36, "replies": [{"body": "Not entirely a lie. It all depends on whether you eat the crayon before or after it’s been up your nose.", "score": 19, "replies": []}]}]}, {"body": "Can you explain what a fat pitch means? I'm new to this.", "score": 12, "replies": [{"body": "It’s a phrase from Buffet, irc. Basically, wait until the moment is truly right, perhaps refine that to “the best.” So, no FOMO nor revenge nor over trade nor whim. It still allows for the inexplicable (what feels like intuition but is likely subconscious understanding, I think,) but waiting for “it,” as necessary.", "score": 48, "replies": [{"body": "I.e. patience and waiting for the right moment?", "score": 5, "replies": [{"body": "Yes, though comparative patience is something that I had. (I was happy with my return for the six months before options and knew I was in for a wait on my two huge risky gambles.) But waiting for the right moment was surprisingly difficult. I impulsively bought some calls on AMZN and AAPL at local highs, for example, for no real reason. Maybe just a bit bored scrolling through my positions and waiting and watching. Both were mistakes (as were my other three losses, or probably losses.) Maybe it’s just me. But, it’s like I know that I’m about to do something stupid before I do it. And it seems like I recognize a good idea when presented or it occurs. Weds-Friday last week, I felt on fire with ideas that I was certain of, which was emotional, in a way, eager, but not just because. They led to the best close ever. Maybe it *is* just how I experience it. But it seems in line with “waiting for a fat pitch,” a truly good one, likely to succeed.", "score": 10, "replies": [{"body": "I agree. I don’t have wins near your level but some of my best wins have been watching a stock from the sidelines for months or years waiting for what I believe to be the most opportune time to create a position. Sometimes it means waiting for a wave to hit its trough and invest near the point of expected resistance. If I make emotional decisions when I’m bored from waiting, I lose. When I’m disciplined, I win. And like your advice says - don’t be too greedy and know when you plan to take profits and what that will look like (sell all, 75%, 50%, original cost basis, etc). You need to have a plan.", "score": 6, "replies": [{"body": "Yes, that is precisely my experience. Boredom trades have had the worst outcomes. And they are more frustrating than those that don’t turn out because of an oversight or mistake. Those are instructive, but I just feel stupid when I trade because I want to do so. I also have some I followed for a long time, then scaled and dove in just in time to catch a wave. It’s like our brains are working on the problem without us being aware? Yes, the plan. Thank you for emphasizing that. I’ve only started writing mine down recently and it helps very much. The plan differs depending on particulars of a trade, but I’ve set some guidelines and that has made a difference, even when part of the plan is to watch and learn how things behave. (I think I’ve got the pattern of far OTM and short dated, in general, now though. Guh. Working on interplay of the greeks and not making mistakes on those - fun and challenging.)", "score": 4, "replies": []}]}]}]}, {"body": "Yeah more than anything else having this feeling that this is the big one has been the most profitable thing. Then you need to have the balls to actually do it when you get that feeling. The rest of the time have self control to not overtrade.", "score": 3, "replies": [{"body": "Yes! I’ve found that, too! And I know how silly it sounds, but it works out far better if I feel on fire about an idea and do it, maybe with some compromises vs trading just to do so.", "score": 1, "replies": []}]}]}]}, {"body": "Game of Thrones helped you with options? Man, I was not paying enough attention to the subtext of that show.", "score": 16, "replies": [{"body": "Excuse me, meant GPT (haven’t watched/read that, but feel I know the whole thing anyway. Like, why do I know that that actor was killed in ‘Red Wedding?’ Idk.)", "score": 9, "replies": [{"body": "True! The actor died during Red Wedding. Watched GOT: check.", "score": 4, "replies": []}]}]}, {"body": "furiously scribbling notes over here!", "score": 6, "replies": []}, {"body": "“don’t trade over earnings”, as in not trade right before the earnings call?", "score": 5, "replies": [{"body": "Yes, like don’t buy high IV, hold through, and sell into low. I now aim to sell before ER or another catalyst as I’ve let some run from green to red. Though NVDA is an exception, in that I will hold calls for months and sell when profit target is hit.", "score": 1, "replies": []}]}, {"body": "That’s the way, congratulations \nNow you have made good amount, i would buy stocks for long and some good Dividends tickers", "score": 3, "replies": [{"body": "Ah, that’s right, I will post some positions. And, yes, I’ve been buying shares! Though dividends are still largely incidental. I’m learning more about their place in a portfolio and hope it will become useful!", "score": 1, "replies": []}]}, {"body": "Yeah you lost me and most of the regards here at 1", "score": 3, "replies": []}, {"body": "Don't trade over earnings? Then what do you trade exactly?", "score": 2, "replies": [{"body": "More to not trade specifically speculating on one direction post-ER. And to take care to but far enough in advance and enough time, if holding through earnings. I’m not expressing it well. But two examples, I thought DELL would do well, but took profit before earnings on most contracts at 100%, which was great. Then watched the one I let ride go to -60% before cutting the loss. And I didn’t have high conviction on MU earnings, but thought it’d be pretty safe with time bought - it wasn’t. And I ended up writing calls against them to get something back. Those examples comprise several lessons for me, and along with IV crush, sum up my new approach: don’t buy specifically just before earnings to sell just after (except maybe NVDA 6 weeks in advance.)", "score": 1, "replies": []}]}, {"body": "I was taught to buy puts ![img](emote|t5_2th52|12787) since somehow, good news means the stock will fall", "score": 2, "replies": [{"body": "Haha. Well. This is embarrassing, but I get confused when I buy puts. Just have trouble keeping my thinking straight on them. And I get silly about betting against the U.S. (ridiculous, I know.) Also, one time I meant to buy puts and accidentally sold naked ones instead - so stressful. I’m comfortable with CC and CSP if I want shares, but that was nauseating. (My palms are sweating remembering it, and when I tried writing against MSTR.)", "score": 3, "replies": []}]}, {"body": "Take profits?  What are they?", "score": 2, "replies": []}, {"body": "Have a plan specific to each trade and general guidelines at the start, and don’t deviate. That is something I learned/extrapolated from here. Very helpful vs just seeing what happens next!", "score": 1, "replies": []}]}, {"body": "(Also, that’s possibly my favorite movie of all time.)", "score": 4, "replies": [{"body": "what movie?", "score": 5, "replies": [{"body": "Zoolander. Laughing at the ‘freak gasoline fight accident,’ now. Fitting for the impression I see of WSB in other subs. (Dumbasses.)", "score": 9, "replies": []}]}]}, {"body": "Better yet how did you learn", "score": 1, "replies": []}, {"body": "Leaned not to gamble", "score": 1, "replies": []}]}, {"body": "Not on r/wallstreetbets we aren’t. This sub is about  a) being jealous about other’s wins, b) joking about other’s losses and c) gambling with candles instead of cards. You’re too smart for WSB; you’re an **investor**.\n\nThat’s exactly why we need you on this sub- you need to teach us! I’d ask for tips but you already said them. Maybe this sub would be better off with more advice…", "score": 27, "replies": [{"body": "Thank you for the kind words. But. I only earned them up to discovering options. I mean, I do invest, as well. But this…this was insanity. And crazier still, Idk - I know this isn’t probable, but, possible. I truly wouldn’t have gotten here without the people here. And weirdly, in all the mess of life, this is where I come for peace, too. I don’t know how to express myself. \n\nI will say that, my initiation was as a buy and hold investor. And fundamentals are very, very, important to me. (In fact, I look at charts for support, resistance and volume, but trade fundamentals and momentum/sentiment mixed. And intuition. So embarrassing. I suck at TA. Studied it tons, but it and indicators just didn’t work out with me.)", "score": 19, "replies": [{"body": "I've done a lot of practice with TA and even read a book about it, but I'm still learning things. You think you've got it and something new happens. Only thing that I've seen stand strong in every situation has been overbought/oversold. Calling it \"Astrology for men\" honestly doesn't seem very far off many days...\n\nAnd as for your success being due to options, I should've known. NVDA calls?", "score": 8, "replies": [{"body": "Oh, yes. Every red day! Also, SPY. And keeping same size positions on other ideas (my own and others,) and working to correct mistakes. I took a loss on two earnings plays that had both been up before hand (partial, though, so slightly up, but would have been more profitable to sell DELL and MU calls before ER - one was over 100% and I let it ride. Also, bought AMZN 200c far too late… just because I wanted to do something, saved it partly writing against it, but will be a loss.) The past few days were insanely lucky, some dead plays come alive (I started out buying time, now sometimes don’t, but bet small.) And I now appreciate: “Don’t lose money,” in a way I didn’t before. It was just numbers in a screen. Still is, but in a healthier way, now.", "score": 7, "replies": []}, {"body": "One amazing idea that came from WSB: a guy said he made an algorithm? Maybe just a screen, based on Nvidia. And came up with two tickers. He said he wouldn’t do DD further and as it turned out, didn’t place a bet. But I did. And Lantheus had an amazing trajectory, so I bought a few calls (and, like, two shares - missed that shot for longterm.) So…it’s surprising, at times, what works or at least sparks an idea. (I set a stupid limit sell on the LNTH calls, like 4x, because they were a few months out, that hit one morning - like magic.)", "score": 3, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}, {"body": ">I suck at TA. Studied it tons, but it and indicators just didn’t work out with me.)\n\n\nThat's because it doesn't work for anyone and this is scientifically proven. It's no different than astrology . Read a random walk down wall street and fooled by randomness ", "score": 2, "replies": [{"body": "I read the first in undergrad, but will revisit it, as I don’t remember it well. I’m excited to read the second one, though - sounds very much up my alley.", "score": 1, "replies": []}]}]}]}, {"body": "Sir, this is a casino.", "score": 3, "replies": []}, {"body": "Nope... Wasn’t us!", "score": 2, "replies": []}, {"body": "That's not the vibe I have got from this sub lol.", "score": 2, "replies": [{"body": "Aw. If it’s just noise, I skip over without noticing now. It warms my heart when someone is going through it and others rally support. And truly beautiful to me how people share great success and stumbles unabashedly. I love the redemption stories (perhaps obviously, as mine is one after dropping back to where I started at first.) I hope you find what you need and don’t eat what doesn’t feed you.", "score": 2, "replies": [{"body": "I have been trying to learn the market, googling terminology and trends. I tried posting here about it once and got down voted to hell.\n\nI am just sitting on some stock and seeing how it goes. I don't have the confidence to actually go in on trading.", "score": 2, "replies": [{"body": "Oh, yes! I did that at first, too. I try to keep within the interests of the sub, now, as I understand it better. Just lurking, I didn’t quite catch on until I started talking lots. My first posts were not well received, either. Though each got one helpful comment. So now I try to respond to whichever I see on the feed. Not to mislead people, but welcome them. \n\nI think it very wise of you to build a base in shares first! That’s what allowed me to start trading. With a drop down to baseline, at first!", "score": 1, "replies": []}]}]}]}, {"body": "I thought we were here to laugh at our regarded self’s", "score": 2, "replies": [{"body": "That too :)", "score": 2, "replies": []}]}]}, {"body": "He made money by inversing everyone on this subreddit.", "score": 7, "replies": []}, {"body": "_maybe wendy’s not for everyone_", "score": 2, "replies": []}, {"body": "Lol right!?  I'm confused I thought it was about suffering together and loss porn", "score": 2, "replies": []}, {"body": "Of course. Just start with an 83k investment.", "score": 2, "replies": []}, {"body": "He inversed everything he saw here", "score": 2, "replies": []}, {"body": "He reversed us", "score": 1, "replies": []}, {"body": "My thoughts exactly", "score": 1, "replies": []}, {"body": "“Inverse guidance.”", "score": 1, "replies": []}, {"body": "He inversed every trade someone here did", "score": 1, "replies": []}, {"body": "A broken clock is right at least twice a day.", "score": 1, "replies": []}, {"body": "I was about to say. Who's fucking advice are you taking?", "score": 1, "replies": []}, {"body": "Ya. He did the opposite of what everyone on this sub was suggesting.", "score": 1, "replies": []}, {"body": "Your reputation is now ruined! Lol", "score": 1, "replies": []}, {"body": "It's the straddle and spreads that made him money.  Advanced strategies.  I don't know what a straddle or spread is.  Only that the market usually straddles me and makes me spread to get REEMED TO $0.", "score": 1, "replies": []}]}, {"body": "Throw it all in 0dte SPY calls Wednesday afternoon", "score": 73, "replies": [{"body": "Now *that* would be spectacular. One way or another! ![img](emote|t5_2th52|31225) and ![img](emote|t5_2th52|4259)", "score": 41, "replies": []}, {"body": "What’s happening wednesday?", "score": 1, "replies": [{"body": "FOMC", "score": 2, "replies": [{"body": "Odte spy calls then huh", "score": 5, "replies": []}]}]}]}, {"body": "Damn papi. Congrats and fuck you.", "score": 125, "replies": [{"body": "*hug*", "score": 38, "replies": [{"body": "That is not how it is supposed to work. You are supposed to lose money. We have failed you.", "score": 16, "replies": []}]}]}, {"body": "https://preview.redd.it/oyp1lxv4w5fd1.jpeg?width=998&format=pjpg&auto=webp&s=d00a9968f6047a9df49a4afa4731ba1da3cc1ab3", "score": 116, "replies": []}, {"body": "You’re welcome", "score": 35, "replies": []}, {"body": "Maybe he was at 96,000,000 3 years ago. That’s more appropriate for this sub.", "score": 30, "replies": []}, {"body": "You’re welcome?", "score": 19, "replies": [{"body": "Sometimes, it’s learning from other’s mistakes.", "score": 20, "replies": []}]}, {"body": "[removed]", "score": 12, "replies": [{"body": "[removed]", "score": 4, "replies": []}]}, {"body": "Congrats and fuck you \n\n\n:)", "score": 11, "replies": [{"body": "Thanks! 🥹", "score": 5, "replies": []}]}, {"body": "Seems a lot of post comes from this platform, which is it allowing regards to trade like that?", "score": 16, "replies": [{"body": "Fidelity. (And a few of the screenshots come from my beginner accounts on others, but this is Fidelity.)", "score": 22, "replies": [{"body": "Oh boy...", "score": 1, "replies": []}]}]}, {"body": "What’s the next play homie?", "score": 14, "replies": [{"body": "Ok, it was going to be a YOLO, but I’ve reconsidered and am playing $AUR calls through expected catalysts in fall (and scaling into shares over time.) I already started the YOLO, so no more buying (they have a great balance sheet but don’t expect to be profitable until 2027, so, it’s too early I think, for LEAPS.) I am buying up NVDA calls for SEP/OCT/NOV, while it’s down, to sell most into volatility ahead of earnings and let a few ride, depending. And SPY was down on Thursday, so I bought a bunch of September calls that I will add to if still up only 10% on Monday, and scale out as they hit 30%, 50% and a runner or two, but still sell before theta gets noticeable. I’ll be selling November ASTS calls that I have already to buy shares, which I’d do if I didn’t have the calls, regardless. I’ve been playing ACHR contracts leading up to earnings, and started a tiny position - will see where it is on Monday. I am also playing ENVX but getting out of calls and buying shares for long term. Then just managing the mess I’ve made on a bunch of others, like, HIMS, HOOD, last LNTH call and etc… selling at various levels of green depending what I want to fund next or where they are. On Monday August 9, I’ll go big on long-dated or LEAPS calls on MSTR (have shares, but trading contracts gave me apoplexy, but after the split seems manageable.) Keep an eye on SPY, always. And writing calls to try to get rid of some biopharma I’d like out of, as well as 100 game store shares (same, I’m annoyed with me that I have them, but premium can be great.) Practicing hedging and buying back some contracts I sold to do so last week, aka, mistakes, on ENVX in particular. And studying strategies , to get things straight in my head, maybe trying one in a small way if I’ve an idea and the allocation available.", "score": 57, "replies": [{"body": "How did you mess up with Hood. From $8 it’s just been relatively up…\n\nAlso calls on nvda and holding through earnings… yet your other comments said don’t play earnings. Can you clarify which one you’re doing ha ha? :))", "score": 7, "replies": [{"body": "Depends on the story he picked", "score": 3, "replies": []}, {"body": "No mess up on HOOD, shares and calls are up - just a list of some of the contracts I’m holding and managing. \n\nRight, I see how that’s unclear: I don’t *specifically* play earnings (because of IV, largely and also the directional gamble,) but, I’ve had success buying a couple of months before earnings, and selling into the volatility leading up to it. Two mistakes were letting profitable contracts ride through to zero. It isn’t hard and fast. I played a straddle around last TSLA earnings and came out ok. Just holding through is no longer a goal. Also, with longer dated contracts, earnings will happen along the way - I’ve held NVDA calls bought on dips or lower IV 4+ months out, and sell them as soon as target is met, but *can* hold if it isn’t. And sometimes the plan is to hold longer term. NVDA is a special case and of course I hold LEAPS through.", "score": 2, "replies": []}, {"body": "There are a mess of contracts in my account, is what I meant. Just a lot, such that my calendar has ERs and catalysts scribbled everyday. Looking to simplify going forward and focus on SPY (though also hold things that aren’t correlated, just not so many.)", "score": 2, "replies": []}]}, {"body": "Free proper advice. Love it! Congrats on the successes so far! 🫡", "score": 5, "replies": []}, {"body": "What actually is expected to happen with AUR in fall?", "score": 4, "replies": [{"body": "Commercialization of the Houston-Dallas route, maybe fully driverless. Was a bit too soon on calls for that, I think. Though ASTS is a year out from revenue, and doing well, so maybe 2026 would be ok. Just better to catch a pop early in the holding period.", "score": 1, "replies": []}]}, {"body": "Congrats.  This is the way.\n\nCan you explain more about your hedging practices?\n\nCheers and thx.", "score": 3, "replies": [{"body": "Ah. My brand new hedging practices…I have been writing some calls at higher strikes against volatile positions, and doing the same after the fact on two trades that turned against me to recoup some loss now and cap it later. And I did a straddle in TSLA. Learning more about delta neutral and non directional bets. But really early days! It was like a light went on - if I’m going to hold to sell at say, 30%, 50% and a runner with a stop loss, why not set it up so that gains are capped that way from the start, so that risk is capped, too. I still have some wild ones, though, and will, especially LEAPS. And, this is not a hedge per se, but understanding the greeks more in depth, sounds stupid, but being very clear what the goal is, and therefore the ideal delta, hopeful gamma and vega/IV over time (like long dated and way OTM to speculate cheaply/with massive leverage vs ATM or even ITM shorter dated calls.) Refining that understanding (I hope.)", "score": 3, "replies": [{"body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": [{"body": "I miss VMod. Harrumph.", "score": 1, "replies": []}]}]}]}, {"body": "✌️💪", "score": 1, "replies": [{"body": "Summarize it for me Nugget", "score": 1, "replies": []}]}]}]}, {"body": "Killin it.     Stay frosty and keep kicking ass", "score": 13, "replies": [{"body": "Happy Cake Day!!!", "score": 7, "replies": []}, {"body": "*hug*", "score": -2, "replies": []}]}, {"body": "Holy shit this is nuts. Congrats on the gains - please take some out and treat yourself!!!!!!!", "score": 13, "replies": [{"body": "I’m going to buy a new front passenger tire! Took it out today. Stupid to keep plunking quarters in the air machine. (It’s true what they say, it doesn’t feel real - numbers on a screen, not however many x my income at this point. Also, I like to…not spend money? In time, when more secure, experiences, for sure.)", "score": 13, "replies": [{"body": "It's best to replace all four at once for even wear. Protip: Costco has mad deals on tires and their customer service and warranty is great.", "score": 12, "replies": [{"body": "Ah! Ok. That makes sense. And I’ve a friend who is obsessed with Costco. I didn’t think of even wear, more of how close to catastrophe, which is unreasonably stressful and stupid. Thank you. (And holy cow, like, I guess I can afford that right now.)", "score": 2, "replies": [{"body": "For sure. When you've been living in the save-every-dime stage and finally achieve some financial freedom, it's okay to start making informed purchases that improve your quality of life. The error some people make is they totally *up* their lifestyle and start splurging. I don't think you're at risk of doing that. You seem way smarter than that.", "score": 3, "replies": [{"body": "I don’t know about smarter. But far from financially free. It actually makes me happy to buy shares over stuff (and experiences/education, I don’t even think too much about.) But. Point taken. Safety and a baseline is reasonable and within reach. (And I will get takeaway from the Thai place on Fridays that go well, still. But actually keep extra cash in the CMA this days, which feels like luxury.) \n\nThanks.", "score": 2, "replies": []}]}, {"body": "what kind of car?  some you have to replace all four.\n\nalso, you can an axle at a time ( both front or both rear tires) depending on ur tire life remaining \n\nget measurements and ask the tire shop.  \n new tires are 10 mm\nmust be replaced at 2mm\nkeep riding them if over 6 mm\n\n\nbut yeah replacing all four and getting an alignment will feel great!", "score": 3, "replies": [{"body": "It’s a small SUV, so that could be a factor. I looked and the tread looks more than that, so, maybe just the front two, for balance. Close to oil change mileage, too, so I will ask advice at general shop (but not do the tires there, don’t think.) Then check with tire shop - my friend with the Costco membership is knowledgeable and will make sure I don’t mess it up/am safe. I’m looking forward to taking care of it now - it feels good.", "score": 2, "replies": []}]}, {"body": "Don't get the Bridgestone deal, wait for the Michelin coupon at Costco. [/Pro Tip]", "score": 2, "replies": [{"body": "Great, thank you! Haha, looking forward to tire shopping…", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Don’t fuck it up. Play it safe homie.", "score": 7, "replies": [{"body": "Oh dear oh dear oh dear…mostly, I think. I hope. \n\nBut I’m not an ETF/dividend investor just yet. I am buying shares with realized gains steadily. That’s a start. And keeping the same dollar limit of options, despite the current percentage difference.\n\nSometimes it doesn’t seem real. Then at moments…well, your wording is perfect.", "score": 6, "replies": []}]}, {"body": "Can someone teach me the way please", "score": 7, "replies": [{"body": "Ask your questions. I am confident someone will help. I will, if I can, but probably can’t just yet!", "score": 4, "replies": [{"body": "Where can I learn about options, I’m a baby startin to crawl and don’t know anything about stocks or the market", "score": 7, "replies": [{"body": "I’ll do you a favor and tell you not to get into options. A hell of a lot of people lose money and it’s leveraged. Just learn the ins and outs of investing on YouTube and play the long game and be an investor.", "score": 3, "replies": []}, {"body": "youtube", "score": 1, "replies": [{"body": "Do you recommend any channels", "score": 1, "replies": [{"body": "just search \" beginner option trading\"", "score": 1, "replies": [{"body": "Is there anyone in particular that you recommend or just look. That up in general? Thanks for helping", "score": 2, "replies": [{"body": "Remindme! 2 days", "score": 1, "replies": [{"body": "I will be messaging you in 2 days on [**2024-07-30 11:50:31 UTC**](http://www.wolframalpha.com/input/?i=2024-07-30%2011:50:31%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/1edumfa/thank_you_so_much_for_your_guidance_and_support/lfbor7p/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F1edumfa%2Fthank_you_so_much_for_your_guidance_and_support%2Flfbor7p%2F%5D%0A%0ARemindMe%21%202024-07-30%2011%3A50%3A31%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201edumfa)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "dunno any one teacher specifically.    do a general search and start there!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "What’s some of the lessons you learned on here that’s had the biggest impact on your trading?", "score": 3, "replies": [{"body": "I listed four in another comment and explained. Though will add: risk management in general and cutting losses fast, and overall having a plan. Sounds ridiculous saying that, but I was just flying by the seat of my pants, at first. Part of that was learning how things behave - like experiential learning that isn’t possible from books or even paper trading. Part stupidity and hubris. And! I’ve returned to paper trading - it is much more helpful than before. And I can try on greater risk and test things I didn’t understand before. (And practice with short dated SPY for the future.) That is good advice it took me a long time to realize the benefit of.", "score": 1, "replies": []}]}]}]}, {"body": "I love you guys. Seriously.", "score": 9, "replies": []}, {"body": "Rare good end", "score": 5, "replies": [{"body": "I’ve been ridiculously lucky. And as I’ve mentioned, I’ve had help. Quite literally could t have done this without it. I am so grateful to the people in this sub (community? Idk, that was on sesame street yesterday, but it doesn’t quite fit. I honestly find more overall acceptance here than on other market-related subs, and get kinda pissed when people make a nonsensical joke, like “that belongs on WSB.” A bit like summarizing the entirety of the U.S. population whichever way?)\n\nAlso, this is the beginning. (Of a life of investing and a bit of speculation.)", "score": 9, "replies": [{"body": "That's awesome how humble you are, and I always love seeing that some of the stuff here actually works. You should keep sharing your investing and speculation journey", "score": 2, "replies": [{"body": "Thank you for your encouragement. It can be uncomfortable sharing. But then, I come back and keep talking again (listening, too.)\n\nI hope I don’t crash and burn on a bigger play, but will certainly share either way.", "score": 3, "replies": []}]}]}]}, {"body": "[removed]", "score": 6, "replies": [{"body": "Yes. Understand. Completely. (Though have a house, still, even.)", "score": 2, "replies": []}]}, {"body": "![img](emote|t5_2th52|8882)", "score": 4, "replies": []}, {"body": "Great work, hoping you making millies in the future. You probably will, you are out of the gambling train that many of us get into.", "score": 4, "replies": []}, {"body": "Congratulations and fuck you", "score": 4, "replies": [{"body": "Thanks!", "score": 1, "replies": []}]}, {"body": "Ain't over until you sell and are out. Can start crashing at any moment", "score": 3, "replies": [{"body": "True. I’ve taken profits, and put them in shares. Also took out a bit today - pretty silly to keep refilling this tire.", "score": 5, "replies": []}]}, {"body": "Well, I had nothing to do with that! You have my graph upside down!", "score": 3, "replies": []}, {"body": "Love it and congrats! woudl you recommend anything to read or study? Videos? Charts?", "score": 3, "replies": []}, {"body": "Why not use a commission free broker ?", "score": 3, "replies": [{"body": "I am on several platforms at the moment, because I did a bunch of sign up bonuses at first. Moo moo and Public are free (idk abt SoFi,) but I’d not use them for options bc of UI and fills. But I moved my main buy and hold account from Stash (awful) to Fidelity (again for a bonus - it was like a hobby for a bit!) Not ideal with commissions, but amazing with customer service. I was planning to open a small account with Tasty Trade with “new money” next month, just for options (and keep and migrate all the others to Fidelity and keep Roth at RH - ohmygosh I’m ridiculous.) But I’d like to simplify and have gotten used to Fidelity. And maybe the fills are worth it (sold a few I’d never be able to elsewhere.)\n\nWhat do you recommend?", "score": 2, "replies": [{"body": "Webull", "score": 2, "replies": [{"body": "Ok, I have noticed that one. And they give some bonuses right now! I’ll check them out, thanks!", "score": 1, "replies": [{"body": "If you want to capture the sign up bonus for webull, I have a ref ![img](emote|t5_2th52|8883)", "score": 2, "replies": [{"body": "Sure :). DM me, please. It won’t be until next month, though. (Have to clear margin and secure funds for the new account. Trying to simplify and keep my risk defined such that I can’t go too far with a new account.)", "score": 1, "replies": []}]}]}, {"body": "Good fills? That has spoiled me on Fidelity (Moo Moo is awful - have pending transactions for weeks, and have had to exercise before.)", "score": 1, "replies": []}]}]}]}, {"body": "Congrats\n\nHappy for you\n\nNice", "score": 3, "replies": []}, {"body": "Haha, clicked on a comment and got an ad for an Eames chair, haha, they think I’m stupid…spending money.", "score": 6, "replies": []}, {"body": "this guy turned 80k to 360k wow", "score": 3, "replies": [{"body": "It’s unreal. Like, really feels that way, both ways (nothing and so much.) But, buy and hold with lots of NVDA got me to almost a hundred before options, made some gains but didn’t have profit taking down, so back all the way to the start, then bit by bit and taking profit, then the last time I did that, the drop, so, kept going…and a lot of things clicked all at once. (And I took some out today, will get new tires. Sorry, it isn’t real.)\n\nI’ll post my trades in here, in the next couple of days. They are messy, because I “diversified,” and Fidelity doesn’t put the buy and sell together, unless so in time. But, also embarrassing, because I was working with a lot of stocks and it was probably irresponsible. But smallish bets each time.)", "score": 5, "replies": []}]}, {"body": "Congrats 😎", "score": 2, "replies": []}, {"body": "Better fking thank me", "score": 2, "replies": []}, {"body": "I’ll take my cut in Wendy’s please", "score": 2, "replies": [{"body": "How about a bag of apples and some carrots and cheese?", "score": 2, "replies": []}]}, {"body": "To the moon!", "score": 2, "replies": []}, {"body": " Now give it back to me", "score": 2, "replies": []}, {"body": "If you use wsb, there are ways to use people’s information or bias about a trade to make money. There is so much to learn from this sub even if it’s just how not to lose 500k in one day which I think is more important than learning how to make 2k in one day.", "score": 2, "replies": []}, {"body": "He is our Wendy’ CEO", "score": 2, "replies": [{"body": "I’d be honored.", "score": 1, "replies": []}]}, {"body": "Congrats. How do you pick your plays? I consistently lose money. Seems like every time I buy options, it goes the opposite way. I guess I should probably stop 0dte", "score": 2, "replies": [{"body": "Well, I’ve not tried 0DTE. Seems like it might be fun and maybe a risky strategy to employ in down markets or volatility I don’t trust. But I bought 1DTE SPY calls once, and my hands were shaking. Sold within a couple of minutes and was relieved. I’m just not to a point where I can justify the risk nor the pressure. I’d rather a slow day than panic at the disco. I pick them all sorts of ways - you can see my trades from Friday and some of Thursday in comments. Lots of different ideas. Which does mean that most days have some green bc they are diversified in a lunatic’s fashion, haha. Overall, though, I read a lot. Market and stock specific, financials, but also just anything interesting and of course, here! I always get excited to find a DD on something In considering and see the discussion around it. Also, I played ARCH after reading a DD here and fairly fast research on my own. Had a lot of fun with calls, puts, calls, on that. Oftentimes, I will see a ticker mentioned and then it starts appearing everywhere, too (ENVX.)", "score": 2, "replies": []}]}, {"body": "Congratulations and I'm here to learn (I know where I am lmao) but care to share where you get your news, stock tickers, and how you go about your trades. Ever let your winners ride lol", "score": 2, "replies": [{"body": "I have shared a bunch in the comments:). And with shares? I most definitely let winners run, not so much with contracts, unless that’s the plan from the outset (LEAPS, for example.)", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Added a bunch in comments a bit ago. Sorry for the delay. Went back into Thursday, happy to share more.", "score": 1, "replies": []}]}, {"body": "Are you willing to share your future trades ? If so, can we copy trade you please ?", "score": 2, "replies": [{"body": "I do share what I am doing in the daily and post big plays as soon as I consider them. Warning: I take on a lot of risk, don’t know what I’m doing, and change my mind and approach at times (though share that, too.) Everyone is free to trade as they wish, of course. And I’ve clearly gotten winning ideas here. Though I think acting in accordance with one’s own risk profile, circumstances and goals is crucial. As in personal conviction and style. Best of luck!", "score": 2, "replies": [{"body": "Great to hear !\nJust throwing an idea out here : Can you create your own subreddit where only you post your daily positions (screenshots) ?\nThat would be great, time-efficient for you and us, and gives the opportunity to discuss via comments.", "score": 2, "replies": [{"body": "I think that worked! I don’t see why not, seems fun and I share it anyway (though truncated just Friday and part of Thursday to show representative positions for this post as *all* of them would take forever.) I’m not sure how much I’ll be on this week as I have end of month stuff to attend to, so fair warning I may be a bit quiet at first. I’ll post last week’s trades in full for this (main trading account,) under my username soon, if interested.", "score": 2, "replies": []}, {"body": "Oh, I need to check what the guidelines are for me discussing things, though. Don’t want to be inappropriate on my end. (Obviously a minnow but want to be sure I’m being proper.)", "score": 2, "replies": []}, {"body": "Eek, yeah, maybe. I’m going to sleep on that. On the one hand, I don’t see why not - particularly options plays. On the other hand feel shy sharing my portfolio. I’m going to test one quickly (positions I posted in this thread to be sure I understand how and that it’s as simple as I think it is.) I love the idea of discussing our plays in a smaller group though, and getting feedback. Testing.", "score": 1, "replies": []}]}]}]}, {"body": "How do I learn like this gentleman?", "score": 2, "replies": [{"body": "Read. Think. Sleep on things. Ask questions of others and get to know oneself, (I think)", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Take what works, right?", "score": 1, "replies": []}]}, {"body": "Atta boy. Now don’t fuck it up.", "score": 2, "replies": [{"body": "Eek. Trying!", "score": 1, "replies": []}]}, {"body": "Good.  Now sell already before you fuck it up and hate yourself for the rest of your life.", "score": 2, "replies": [{"body": "I’ve been doing so. Still have plays out, but have been buying shares and selling of all contracts up 30%+. Thanks. It can’t be said enough. Taking profit earlier and setting it aside or into ballast/high conviction longterm holds made all the difference the last couple of months (after the margin call and greed phase!)", "score": 1, "replies": []}]}, {"body": "Lol", "score": 2, "replies": [{"body": "Funny, I hold calls on OZEM (December) & GRND (November,) that I’ve been selling off for profit.", "score": 2, "replies": [{"body": "Congratulations 😂", "score": 2, "replies": []}]}]}, {"body": "🤝", "score": 2, "replies": []}, {"body": "Thanks these people who lost their savings", "score": 2, "replies": [{"body": "My heart goes out to them. But, so many have answered questions and even reached out on DM when I was new and *extra* stupid. And have been funny and supportive. It’s  beautiful how ppl support one another here. And I live the honesty about things like jealousy and greed, etc - helps me choose to be a better person (usually.)", "score": 1, "replies": []}]}, {"body": "“Guidance”", "score": 2, "replies": []}, {"body": "damnnn I need some guidance 😮‍💨😆😆", "score": 2, "replies": []}, {"body": "How far ahead of time do you buy/sell the straddles and spreads? I kinda wanna do some earnings straddles or strangles but I’m not sure if it’s too late", "score": 2, "replies": [{"body": "I did a straddle around TSLA - it was ok, because it turned a small profit and I learned something, but my timing wasn’t great - classic IV too high at purchase.  I think if I do straddles and strangles around earnings, as you intuited, I’d do so 6+ weeks ahead of time, and ideally when IV is undervalued. It’s tough, though, most times it seems selling in the lead up is the best idea. Or buying lots of time so ER can be incidental or profitable early. \n\n(Haha, the spreads. Well, I described my limited experience with those elsewhere in this thread, but so far, usually after the fact when something has moved against me.)", "score": 2, "replies": [{"body": "Heard that, thanks for the response! I was worried that IV would be too high, I think I’ll wait till next quarter for any straddles on earnings plays. \n\nI have thought of doing two straddles & selling one right before earnings and then letting the remaining one ride thru earnings.\n\nWhat kind of option plays have you done to grow your account this much?", "score": 2, "replies": [{"body": "Yes, I’ve done something like that in the past. But if I’m in good profit moving forward, unless really convinced, will sell all and hold back few. I turned profits into losses over DELL and MU ERs last time, and made a mistake with AMZN for prime day, so. Will wait to see and probably buy just after earnings now. \n\nI posted some representative trades in the thread (positions screenshots.) And will post last week’s in full under my username. Probably better than me trying to explain. I’ll do that and try to include the P/L I sell at, as well, in the coming weeks. (I’ll be a bit quiet as I am working on some EoM and life things this week. Some days I’m on all day, some I don’t do much, but happy to share and get feedback.", "score": 2, "replies": [{"body": "Precise the info! Hopefully my account will be looking like yours soon hahah", "score": 2, "replies": [{"body": "Truly, I think one must find a path. It’s important not to blindly follow. Really. ♥️", "score": 2, "replies": [{"body": "I agree!", "score": 2, "replies": []}, {"body": "Thoughts on an NVDA straddle or strangle before the next earnings?", "score": 2, "replies": [{"body": "I’ve bought and sold calls, but depends if you are choosing a direction or no. Also, IV is high right now.", "score": 1, "replies": [{"body": "Heard that, imma prob be on the sidelines till IV settles down. I was mainly looking to capture a big move up or down after earnings lol \n\n& u mind of if I Dm you with any questions I have in the future lol", "score": 2, "replies": [{"body": "Sure, though asking here is cool, too!\n\nI’m debating whether to buy more NVDA calls - have an order in that I think I will cancel and wait on IV to settle, myself.", "score": 2, "replies": []}, {"body": "Actually, just checked and IV on the specific contracts in November isn’t too bad. Will see on Monday!", "score": 2, "replies": []}, {"body": "Sure, though asking here is cool, too!\n\nI’m debating whether to buy more NVDA calls - have an order in that I think I will cancel and wait on IV to settle, myself.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Oh, one thought is to buy some contracts after ER, after IV crashes and when trend is clearer. I will do that with some these coming weeks, and plan to sell ahead of next ER or another catalyst. I think if the price is low and IV, it’s not too late (nor on Nvidia, time there, yet, too.)", "score": 2, "replies": [{"body": "Heard that, I feel like it’s best to buy contracts maybe a week or 2 after earnings to let the dust settle and IV to drop?", "score": 2, "replies": [{"body": "I was thinking in the first few days, but honestly, it will depend for each individual trade. But price of underlying, trend and IV seem most important around ER.", "score": 2, "replies": [{"body": "Heard that, wish ya the best! Keep growing that account to a mil", "score": 2, "replies": [{"body": "Working on it. Seemed almost real today. Started writing and making an earnest plan.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Noiceee", "score": 2, "replies": []}, {"body": "Great. Guidance?", "score": 2, "replies": []}, {"body": "If its good enough to screenshot its good enough to sell. I hope you get out in time, with something left still.", "score": 2, "replies": [{"body": "Mostly realized, some plays ongoing and bought shares (some trades in comments.)", "score": 1, "replies": []}]}, {"body": "Good things you didn't go with strangles. Usually those are reserved for elsewhere", "score": 2, "replies": [{"body": "Ah, have only read about those - is a strangle best for tilting more in favor of one direction, when a big move is expected? Versus entirely neutral and a smaller move for the straddle?", "score": 1, "replies": []}]}, {"body": "Guidance and Support? The only thing this community has given me is depression and anxiety! But guess what, I’m here for it.\nI ❤️ WSB", "score": 2, "replies": [{"body": "Hahaha. I think it’s so lovely when people support one another here. But other’s big numbers can be intimidating (or depressing if negative,) to me. But it also gives something to aim for or avoid.", "score": 1, "replies": []}]}, {"body": "Alright, you're obligated to post an update when you bring it back down to 0.", "score": 2, "replies": [{"body": "Haha, of course I’ll share any significant loss. But most of this is now in shares, so hopefully not to zero!", "score": 1, "replies": []}]}, {"body": "I am hoping this happens for me too! 🙌", "score": 2, "replies": []}, {"body": "OK, I got it. Guidance for a contrarian.", "score": 2, "replies": []}, {"body": "What are u looking at tomorrow?", "score": 2, "replies": []}, {"body": "Now, my question is. When is your course coming up?", "score": 2, "replies": [{"body": "![img](emote|t5_2th52|31225)", "score": 1, "replies": []}, {"body": "What a mess that would be! I’m so all over the place and learning new things all the time. Here’s the entire course: make money bit by bit, take it and go for a run, repeat, always putting some profit aside (in longterm shares.)", "score": 1, "replies": []}, {"body": "Now I want to start a YouTube channel where I interview folks that nail it like this.", "score": 1, "replies": []}]}, {"body": "Wait… where you going? It’s not a million yet and it takes most people 10m to fire", "score": 2, "replies": [{"body": "Not going anywhere. Just not increasing my bets, basically. \n\nHahaha, TEN!? C’mon, compound interest helps after a point, no? (Idk, obviously not anywhere close.)", "score": 3, "replies": [{"body": "Also, I’m actually fully invested except for this months bills plus a bit extra. So.", "score": 1, "replies": []}, {"body": "What’s your fire number if not ten?", "score": 1, "replies": [{"body": "Haha, I don’t have one.", "score": 1, "replies": []}]}]}]}, {"body": "This lady is way too nice. Not one of us.", "score": 2, "replies": [{"body": "*hug* (but, I’ve met so many lovely people here. And have made an absolute ass of myself and, for example, mods were kind and gracious, always. So there’s that, and also, I’ve made some insane trades that other stock focused subs, like…downvote me for. Not here.)", "score": 3, "replies": [{"body": "See what I mean? I can't even be jealous of her gains with all of this politeness.  I'm out.", "score": 5, "replies": []}]}]}, {"body": "What are some of your plays ?", "score": 1, "replies": []}, {"body": "So how are you deciding on your trades, are you actually doing deep research or are these all yolos? I've been doing spreads as well but currently getting my ass kicked with this drop on spx", "score": 1, "replies": []}, {"body": "My chart looks like that too when i flip my phone upside down", "score": 1, "replies": []}, {"body": "Some moves on Thursday and Friday. Embarrassing, I’m all over the place.\n\nhttps://preview.redd.it/ug6966y9ibfd1.jpeg?width=1179&format=pjpg&auto=webp&s=6e1f54ae758151b661ad82e080521cb0d2b2c625", "score": 1, "replies": []}, {"body": "https://preview.redd.it/ddipe8obibfd1.jpeg?width=1179&format=pjpg&auto=webp&s=9628144c0e991fe1e37bdd4668fa076c8dd263e8", "score": 1, "replies": []}, {"body": "https://preview.redd.it/edxgvckdibfd1.jpeg?width=1179&format=pjpg&auto=webp&s=4f63ba4963c5e65e34a2a4ac13ec9dfd02a42b9d", "score": 1, "replies": []}, {"body": "https://preview.redd.it/bxhvqmneibfd1.jpeg?width=1179&format=pjpg&auto=webp&s=87b696c1bee3b36f7e56a58c181571b2de4d017f", "score": 1, "replies": []}, {"body": "https://preview.redd.it/56lbl6fgibfd1.jpeg?width=1179&format=pjpg&auto=webp&s=35606577f77b717b02dfa2a0744c593edbbfd8ea", "score": 1, "replies": []}, {"body": "https://preview.redd.it/0pneqxyhibfd1.jpeg?width=1179&format=pjpg&auto=webp&s=d70925db6826a60726ffb8b5dafa92337be7b8ee", "score": 1, "replies": []}, {"body": "https://preview.redd.it/4xlsx9cjibfd1.jpeg?width=1179&format=pjpg&auto=webp&s=f75eb9c41d1cf3ae17ec2fa033ac35ef05b3549e", "score": 1, "replies": []}, {"body": "So what's your next play, or what would you suggest for us beginners?", "score": 1, "replies": []}, {"body": "This type of strategy works really well lately because IV has been lower than HV.  The market should continue to drop over the next couple of months.  Be careful, because IV will then most likely be higher than HV, and you'll be better served to join Theta gang and sell instead of buying.", "score": 1, "replies": [{"body": "Yes! I always look for undervalued IV, actually. I didn’t mention that. So that I may gain even without a big move on the underlying. (I still buy high IV sometimes.)\n\nThank you. I think my strategy at this point is to not have too much on the line in case of a drop in prices and hope to take advantage of any rise in volatility. Basically, assume the music will stop at any moment. Less reckless. \n\nI have been learning how to write this past week. And I am still at the stage where it feels like free money on a few high IV tickers. But haven’t gotten far, and two were a spread after the trades turned against me so far that I didn’t want to take the loss. \n\nI’d like to understand all strategies, and certainly how to trade sideways and down markets, in time. And also be protected (hedged?) as we move closer to the U.S. election. \n\nThanks so much, for pointing this out, because I am too clumsy and inexperienced to do so, honestly. And for me to sleep on to understand what I’ve missed and next steps.", "score": 7, "replies": [{"body": "I'm definitely coming back to check on this stuff", "score": 2, "replies": []}]}, {"body": "Though, I must say, they aren’t as friendly over there. \n\nI have a few jokes about trying to join their gang, that I’ll keep to myself here, at this moment.", "score": 3, "replies": []}]}, {"body": "That looks like the heartbeat of my bipolar psycho ex lol .. congrats regard ![img](emote|t5_2th52|4276)", "score": 1, "replies": [{"body": "Now that you put it like that… maybe my cat over the course of ten minutes?", "score": 1, "replies": []}]}, {"body": "How do you make that much on straddles and spreads? Is the max gain not capped?", "score": 1, "replies": [{"body": "Ok, that’s part of what helped last week, because it also mitigates loss. I let some things go too far and after the fact sold OTM calls, as an example. And with Tesla, did a straddle (without realizing it, at first, but last month.) Yes, gains are capped with strategies like this. But so are losses. And I trust me more to set up in advance my max gain, then say “I’ll sell at 30%, ok, 50…no, 100%…” So, it’s like a stop loss, too. Similar to selling contracts off as they hit points and then letting one or more run, but in my limited experience, more profitable. (I’ve watched a few bleed out, broke down and went to the calculator to see what it’d take for recovery, and - Guh. So looked for best scenarios.)", "score": 3, "replies": []}]}, {"body": "Fideity updated charr well", "score": 1, "replies": []}, {"body": "Fuck you", "score": 1, "replies": []}, {"body": "Ok, take the money and stop.. or you can send me some… either way, stop ", "score": -2, "replies": [{"body": "I hear you. Only ten percent on options and speculation, capped at 30, here on out. Well, new ones. I’ve some LEAPS that I count almost as shares. (It’s capital allocation!) But mostly have bought shares and took a bit out today to take care of some annoyances. \n\nIt really is crazy. Watching months of work go up or down. But. Opportunity cost, I feel, is the greatest risk, honestly. I can’t imagine how else.", "score": 8, "replies": []}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1edvalk", "created_utc": 1722127696.0, "score": 61, "upvote_ratio": 0.81, "num_comments": 100, "comments": [{"body": "You basically did the same financial damage to your life with this trade as going to prison for 1-2 years.", "score": 122, "replies": [{"body": "But in prison, if you drop the soap, you get your butthole enlarged for free too!  ![img](emote|t5_2th52|4271)", "score": 14, "replies": []}, {"body": "Haha... that's a great way to look at it!", "score": 1, "replies": []}]}, {"body": "https://preview.redd.it/adpm1fg5z5fd1.jpeg?width=720&format=pjpg&auto=webp&s=2c9752d267d2d25fddee6a54bce5245e66ee800c", "score": 50, "replies": [{"body": "This if f awesome", "score": 9, "replies": []}]}, {"body": "Chance of recovery? You bought when SMCI was around 860. You were always $140+ OTM. It was never \"covered\", let alone able to be \"recovered\".\n\nMy prediction is - as my late great great grandpappy would say - you're fucked.", "score": 37, "replies": []}, {"body": "For next August?! Are you crazy my g? I mean I hold I think $7800 worth of shares at $812ish and I would love that for us. But not in a month bro.", "score": 30, "replies": []}, {"body": "Eat the loss and move on", "score": 31, "replies": []}, {"body": "some of yall need to consider investing in stocks instead of just options jesus", "score": 17, "replies": []}, {"body": "Bro is too ashamed to show us the actual losses, and makes us have to calculate it out.", "score": 14, "replies": [{"body": "~$170K", "score": 4, "replies": []}, {"body": "140.4K loss. bought for 167, valued at 26", "score": 2, "replies": []}]}, {"body": "Lol.", "score": 10, "replies": []}, {"body": "SMCI would have to rally 31.5% come its August 6th earnings for you to make back break even. Let say theoretically it we kept going down or sideways but we absolutely gobble smack glucked earnings up and broke out of the downtrend on August 6th… you’d still have to see at least a 20% move for theta not to have gobbled you up completely come that time. \n\nSeems absolutely unreasonable unless we start rallying right away on Monday.", "score": 10, "replies": [{"body": "Oh shit I didn’t even think of earnings. He will get IV crushed into the Shadow Realm. Also he could have JPow be talking out the side of his neck Wednesday.", "score": 5, "replies": []}, {"body": "Could happen… oh dear. (And I was worried about Sept NVDA 125c.)", "score": 3, "replies": []}, {"body": "Yeah this is hilariously OTM, theta is uppercutting every other Greek into outer space rn", "score": 2, "replies": []}]}, {"body": "Zero", "score": 9, "replies": []}, {"body": "Watch him sell it hits 1100 😂 but seriously there’s little chance. You’d be better off cutting losses bruh", "score": 17, "replies": []}, {"body": "If you hold, you're fucked.\n\nIf you sell, it'll rally hard af.", "score": 15, "replies": [{"body": "Why does this always seem to be the case when it comes to trading?", "score": 2, "replies": []}]}, {"body": "Is this $150K -> $10K (that's when he will give up)? Is my mathing correct?", "score": 7, "replies": [{"body": "$167,150 -> $26,750 atm", "score": 22, "replies": [{"body": "He is not selling yet, even 10K is probably optimistic.", "score": 1, "replies": []}]}]}, {"body": "Bruh...", "score": 8, "replies": []}, {"body": "No chance", "score": 5, "replies": []}, {"body": "The way I see it - It’s bouncing off 200 dma and will for sure get to 840ish, that’s where you have to decide if you want to eject or reduce exposure. \n\nEarnings on 6th that will be a make or break, chart looks bullish imo, but if drops and holds below 200 dma 580’s could be next. \n\nIt’s unfortunately a hard strike to hit but very much possible.", "score": 5, "replies": []}, {"body": "![img](emote|t5_2th52|4640)", "score": 3, "replies": []}, {"body": "Sorry bro that's a tough pill to swallow. Tech got battered the last couple of weeks. Don't see amd or arm earnings gonna help the market this week. If this runs to the 800s sell asap", "score": 3, "replies": []}, {"body": "![img](emote|t5_2th52|18630)", "score": 3, "replies": []}, {"body": "If I said no, that might still be an understatement", "score": 2, "replies": []}, {"body": "Damn you really gotta pick a point where you cut your losses before you get to this point. Maybe you can recover some of it if you’re lucky but you need to think about the time decay when you are this far out of the money.", "score": 2, "replies": []}, {"body": "Why put the strike price so damn high?", "score": 2, "replies": [{"body": "It wasn’t as high when he bought it. Pullbacks hurt when you’re at an all time high.", "score": 3, "replies": []}]}, {"body": "Heyo wtf!!", "score": 2, "replies": []}, {"body": "This one must hurt...!!! \n\nThey have earnings on 6th Aug. Hopefully it can get some action. Hopefully they announce a split if you are lucky", "score": 2, "replies": []}, {"body": "future direction truck fragile long noxious cooperative sable shame cooing", "score": 3, "replies": [{"body": "Is that the theta gang sub?", "score": 1, "replies": [{"body": "squeamish crush nine spark icky enjoy heavy point jobless kiss", "score": 2, "replies": []}]}]}, {"body": "Dude you're cooked. \n\nSEMIs are not hot right now\n\nMake your money back with the remaining value", "score": 3, "replies": [{"body": "You’re correct… and they’re about to all to take a dump here soon.", "score": 1, "replies": []}]}, {"body": "Double down", "score": 3, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 8 months ago\n**Total Comments** | 1 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "total of 0% chance", "score": 1, "replies": []}, {"body": "Wtttffff", "score": 1, "replies": []}, {"body": "bro is cooked", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4267)", "score": 1, "replies": []}, {"body": ".0000000001%", "score": 1, "replies": []}, {"body": "Ouch not a chance markets gonna be flat unless something spectacular happens this week during earnings", "score": 1, "replies": []}, {"body": "No… lol", "score": 1, "replies": []}, {"body": "slim", "score": 1, "replies": []}, {"body": "Slim to none", "score": 1, "replies": []}, {"body": "Just a low tech company that assembles servers ![img](emote|t5_2th52|4259)", "score": 1, "replies": []}, {"body": "Sell ASAP", "score": 1, "replies": []}, {"body": "Naaa", "score": 1, "replies": []}, {"body": "Not going to happen", "score": 1, "replies": []}, {"body": "None whatsoever", "score": 1, "replies": []}, {"body": "Someone smarter and more experienced than me, could OP write higher strike calls against these to recoup a bit, and, wildly hope, as well, I guess?", "score": 1, "replies": [{"body": "Or…even a lower strike?", "score": 1, "replies": []}]}, {"body": "OP, see what you might be able to get back, various ways. Cutting losses, writing calls against these…and other ideas I hope someone will suggest.", "score": 1, "replies": []}, {"body": "$167k and you bet it on OTM monthlies? \n\nShould've done at or in the money.", "score": 1, "replies": []}, {"body": "Holllllllllyy fuck lmao I’m praying for a bounce for ya brother that’s brutal. Anyway you can average down on 50 more calls to get that average down? It will rally into the election but theta could fuck you along with JPow, if you had end of September strikes you would be better off.", "score": 1, "replies": []}, {"body": "Man idk what to do in that situation, I mean if that’s not alot of money to you then you might as well hold and hope for a miracle, but if not then sell now before it gets any worse, I hoped you hedged Atleast a little bit on this or something.", "score": 1, "replies": []}, {"body": "I may have sold you some of these, thank you.", "score": 1, "replies": []}, {"body": "P= nope", "score": 1, "replies": []}, {"body": "What does your delta say?\n\nIt says u r fuk.", "score": 1, "replies": []}, {"body": "Bro i literally went to look at the theta on these and you are so cooked. You are losing 60 a day. Everyday you don’t sell. If it doesn’t recover Monday at ‘at all definitely take the L. Theres no data getting released so it’s very possible to ride the wave of the good PCE numbers from yesterday.", "score": 1, "replies": []}, {"body": "Bro", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|31226)", "score": 1, "replies": []}, {"body": "Uffff….thats as big a blunder as me asking this Latina 15 years ago if she was on the pill and bottoming out in her….all 3 glorious inches", "score": 1, "replies": []}, {"body": "No bloody way!", "score": 1, "replies": []}, {"body": " Shares not options . Sell and move on", "score": 1, "replies": []}, {"body": "100% dude! Just put in more money. I believe in you!", "score": 1, "replies": []}, {"body": "300 buck in a couple weeks bullish bullish", "score": 1, "replies": []}, {"body": "Very low chance. I would probably cut and run. I’m surprised anyone is buying calls on anything right now.", "score": 1, "replies": []}, {"body": "Damn. You literally bought at the peak of the stock. May as well start applying for Wendy's now", "score": 1, "replies": []}, {"body": "$165K on monthly calls. Jebus.", "score": 1, "replies": []}, {"body": "You’re cooked bro, never really had a chance on those.  Sell asap, step back and evaluate your risk management", "score": 1, "replies": []}, {"body": "You want a serious answer? It's 5% based on the delta.\n\nIf you don't like the odds, you should probably sell while you can.\n\nThe theta is extremely high, so you're losing $35 per option per day.", "score": 1, "replies": []}, {"body": "Lol. Lmao even", "score": 1, "replies": []}, {"body": "Meh.  Buy another 50 but for a later strike.", "score": 1, "replies": []}, {"body": "If you have a time machine.", "score": 1, "replies": []}, {"body": "That mofo has a toe tag on it", "score": 1, "replies": []}, {"body": "Sell before it goes to ZERO.\nRe invest the balance", "score": 1, "replies": []}, {"body": "Lol no way you can recover this! ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "So out of the money short short dated. SMCI hasn't hit 1k since March.", "score": 1, "replies": []}, {"body": "Maybe in a month or so.  It’s been creeping back up", "score": 1, "replies": []}, {"body": "Take your 26k and put in Amazon Earnings play yolo which probably better chance then you taking this to 0.", "score": 1, "replies": []}, {"body": "Wait for AMD earnings for a bounce.", "score": 1, "replies": []}, {"body": "smoked, but probably better than my 350 p for upcoming  earnings", "score": 1, "replies": []}, {"body": "You went in with +150K in a $140 OTM call?? Holy shit.", "score": 1, "replies": []}, {"body": "Jokes aside you would need stellar reports from Tech this week and the market would need to go in a huge bullish way", "score": 1, "replies": []}, {"body": "It’s possible but my god it’s clear you don’t know what you’re doing. Why the fuck would you do this and then ask this question on Reddit? Personally I think qqq goes back to 495 this week which most people consider insane but even that move might only bring smci back to 875-900. Would help but you still wouldn’t get back to break even", "score": 1, "replies": []}, {"body": "It’s only about to get worse starting next week. It’ll kick it off.", "score": 0, "replies": [{"body": "Update?", "score": 1, "replies": []}]}]}
{"title": "AMD on the rise?", "selftext": "Intel is in damage control because of their blunder with their 13/14th Gen CPUs \n\nNvidia might lose their monopoly over CUDA core technology with their affair in France\n\nAMD’s new lineup looks promising due to their leaked benchmark results.\n\nJust found all this interesting, all sounds like the perfect recipe for AMD to gain a fair amount of leverage at least in the CPU game.", "id": "1ee34bw", "created_utc": 1722156936.0, "score": 111, "upvote_ratio": 0.77, "num_comments": 122, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 9 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "What affair in France?", "score": 49, "replies": [{"body": "Antitrust charges from the French government \n\nhttps://www.reuters.com/technology/french-antitrust-regulators-preparing-nvidia-charges-sources-say-2024-07-01/\n\nThis could mean a lot for Nvidia since these charges can cost Nvidia up to 10% of their yearly revenue", "score": 35, "replies": [{"body": "So they stop selling to France.", "score": 87, "replies": [{"body": "That might work. French companies trying to stay competitive might go nuts on the government. They would have to buy them through other companies like China does, at a premium.", "score": 39, "replies": [{"body": "Nvidia have an order backlog where they could avoid all the big Ai/ cloud plays in France for years. \nIf the EU backs France that could be an issue, I personally don’t see what leg the French regulator has to stand on. It might be hard work to avoid CUDA but it can be done. \nI would love to see AMD get some of that cake they have can do cheaper but they need to emulate CUDA and prove performance vs h200s", "score": 15, "replies": []}, {"body": "It only works because the Chinese government takes no action to stop it.", "score": 1, "replies": [{"body": "why would the chinese government stop it? they want NVDA GPUs", "score": 3, "replies": []}]}]}, {"body": "I am not sure it is that simple.  This is in an EU court.  They could probably stop selling to the EU for the time being....", "score": 3, "replies": []}, {"body": "It would mean *anything* with Nvidia hardware including laptops and phones. NVIdia is also widely used in car infotainment and navigation systems.", "score": 3, "replies": []}, {"body": "Then they go ape shit about how a single company owns too much share of critical market and accuse them of blackmailing a government", "score": 1, "replies": [{"body": "Cool, what are they going to do about it?", "score": 1, "replies": [{"body": "Let said company bleed.\nAnd regardless of any conpanies size: ignoring the common european market tends to cost a lot either way.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Fucking over their own economy is an important European past time.", "score": 5, "replies": []}, {"body": "Not just tech, vehicles, medical, manufacturing, banking, etc. which means massive losses in sales from NVDA (even a laptop for school would have to avoid them), and massive growth for competitors.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I think you are missing the point. That’s a massive sales market NVDA misses, all of that uses their chips not just AI chips, and the competitors can come from anywhere. NVDA doesn’t want this at all, it will hurt them massively.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "A mere 10%? Two more orders from META and they'll be okay.", "score": 20, "replies": []}, {"body": "Something similar is gonna happen with meta and google I heard they were re selling nvidia chips to china or somewhere the us didn’t want chips to go to", "score": 1, "replies": []}, {"body": "This is even more bullish for NVDA", "score": 1, "replies": []}, {"body": "Do you ppl not look for EC cliff note??? NVDA is BACKED UP with orders. They have an absolute monopoly at the moment thanks to CUDA. It's like they developed the iPhone in 1999. They're gonna be printing money for the years to come. Only a blockade by China near Taiwan, or war, could stop NVDA", "score": 1, "replies": [{"body": "Only if there was a buildup of tension between Taiwan, a massive manufacturer of CPUs and China. \n\nAlso let’s not forget about the great graphics card apocalypse due to various reasons but namely scalping, mining and trade embargoes.", "score": 1, "replies": []}]}, {"body": "Lol yeah that won't happen", "score": 1, "replies": []}, {"body": "If you can't beat it, ban it.\n\nLOL", "score": 0, "replies": []}]}, {"body": "An affair? With a French lover? That's bullish", "score": 1, "replies": []}]}, {"body": "Calls on AMD gonna YOLO", "score": 28, "replies": [{"body": "Bruh stay away from this.", "score": -8, "replies": [{"body": "Let the regards to the regarded thing man come on!", "score": 5, "replies": []}]}]}, {"body": "Too bearish in here with almost everyone saying it’s overvalued. You know what this means: all-in AMD calls.", "score": 72, "replies": [{"body": "![img](emote|t5_2th52|27189)", "score": 8, "replies": []}, {"body": "[AMD writeup](https://borncrisis.com/blog/amd-stock-forecast-2025-and-2030/)", "score": 0, "replies": []}]}, {"body": "Everyone in here being bearish means it’s going to soar", "score": 16, "replies": []}, {"body": "AMD also sold a $120k single chip to my company.", "score": 13, "replies": [{"body": "what do you think of the mi300x?", "score": 1, "replies": []}]}, {"body": "I think amd might go down a bit in their earnings. But then I think the stock will climb to 170 ish... Ofc this is all just speculation.", "score": 21, "replies": [{"body": "Has to touch 120 for old-time sake", "score": 33, "replies": []}, {"body": "Same I'm waiting for earnings before I buy in since I expect market to dump regardless of results", "score": 13, "replies": []}, {"body": "Well AMD only goes up because Nvidia carries them", "score": -14, "replies": [{"body": "What?", "score": 3, "replies": []}]}]}, {"body": "No one really knows for the short terms because the talking heads are on the warpath looking to slaughter semis in general. Big shorts must be in play. However I did double down on AMD ahead of earnings on Friday, with a fat sell-stop. At this point it's practically gambling for the near term, but over the next year I don't see why $200 is an unreasonable expectation.", "score": 9, "replies": []}, {"body": "I was worried until I read the comments in here. Bullish.", "score": 7, "replies": []}, {"body": "NVDA is so backed up on orders, they don't need the frenchies. Frenchies are just going to use AI to make more blue naked smurfs dance in front of fat fucks", "score": 12, "replies": []}, {"body": ">Nvidia might lose their monopoly over CUDA core technology with their affair in France\n\nI stopped reading after this, you belong here lol. You think NVDA gives a shit about France regulators when they can just pull out and go for rest of the market at the expense of 1 non-existent market? Do you think France is China or some shit? Do you even know how EU works?\n\nThe French don't even source their parts in France, the EU hub where most tech parts ship from is in Hamburg.\n\nThose cheese eating regards tried the same with META and AAPL, their response was ignoring any invitation to attend meetings and simply deprecated, blocked or cancel whatever France regulators targeted(Facebook news, iPhone 12 sales in France, etc). France regulators for decades love using these type of \"bans\" or \"call for bans\" to bully big corpo to cut a deal with them so France gets a bigger cut from their business. It worked in the past, but now all it does is hurt their own economy since MNCs do not give a fuck, local big businesses just work around by having it shipped from somewhere else to work around regulations while small ones gets fucked.\n\nAnything beneficial to AMD only drove up TSMC, there's a reason AMD is called Advanced Money Destroyer. You're better off saying you're an AMD bagholder rather than pretending \"it's interesting\" then sprouting old news.", "score": 18, "replies": [{"body": "Explain why positive news for amd only drives up tsmc?", "score": 1, "replies": []}, {"body": "One thing I’ll never get is why people Cush as yourself prioritise Nvidia even if it contributes towards an unhealthy market, competition drives down prices and provides more competitive products. However, Nvidia fanboys such as yourself seem to think Nvidia invincible and scoff at any other competitor. Nvidia may be thriving now but something people always seem to forget is that countries like China and the US don’t buy products based solely on the company but on the price and performance provided.\n\nThe situation in France might now hurt Nvidia but it is a call to action.", "score": -4, "replies": [{"body": "Pretty sure the the US government just throws money at things, they dint seem to have any real plan", "score": 3, "replies": []}, {"body": "Speaking facts that hurt your cognitive bias = NVDA fan boy? You really are regarded and belong here :4271:", "score": 1, "replies": []}]}]}, {"body": "AMD overvalued; I should've sold it all last month. Idk why I still hold any of it. Vaneck semi etf is a good way to get exposure to semi stocks if that's what you want.", "score": 17, "replies": [{"body": "SMH is what I do for my semi stock exposure and just keep DCAing it.", "score": 6, "replies": []}, {"body": "amd overvalued after arm. only chip play I see qualcom", "score": 0, "replies": [{"body": "Yeah it was a better deal at 220", "score": 9, "replies": []}]}]}, {"body": "I have my finger up all four major chipmakers asses", "score": 7, "replies": [{"body": "It’s always hilarious when people act like only one of these companies will make assloads of money.", "score": 2, "replies": []}]}, {"body": "Intel still makes twice the money as AMD though and they also have $200B worth of assets in the form of fabrication plants.", "score": 17, "replies": [{"body": "They should watch those plants a bit better though, 13/14th gen having, confirmed, oxidation leading to failure at defualt board voltages. Intel is not the best at owning up and just letting RMA solve it. They have already rejected alot of RMAs already. Won't \"end them\" but can't help much either.", "score": 13, "replies": [{"body": "Weren't these the CPUs they have TSMC build for them?", "score": 4, "replies": [{"body": "The base die that's having oxidation problem is made by Intel, rest of the parts are ordered from TSMC and assembled at Intel fab.\n\nIntel Meteor Lake Tile/Chiplet | Manufacturer / Node\n--|--\nCPU Tile|Intel / 'Intel 4'\n3D Foveros Base Die|Intel / 22FFL (Intel 16)\nGPU Tile (tGPU)|TSMC / N5 (5nm)\nSoC Tile|TSMC / N6 (6nm)\nIOE Tile|TSMC / N6 (6nm)\n\n[Source](https://www.tomshardware.com/news/intels-meteor-lake-begins-production-launches-this-year-on-intel-4-process)\n\nThe 15th gen Arrow Lake CPUs and the BattleMage GPUs is the Intel stuff that will be fully built from start to finish by TSMC.", "score": 8, "replies": []}]}, {"body": "AMD ain’t doing much better bud\n\nhttps://youtube.com/watch?v=nXRxWm9y3QQ", "score": 1, "replies": [{"body": "oh, no!  a typo on the box!", "score": 1, "replies": []}]}]}, {"body": "making twice the money with 200 B of fabs is absolutely terrible hahaha not a flex", "score": 8, "replies": []}]}, {"body": "Amd will start to cut into nvda market share 2025 and beyond", "score": 6, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I have that same reaction when I own a stock and don't want it to crash lol. I get it haha", "score": 8, "replies": []}]}]}, {"body": "The affected CPUs are a very small portion of their revenue", "score": 5, "replies": []}, {"body": "Amd has climbed already. It been up here for quite some time... this looks to be a bit late to me", "score": 6, "replies": [{"body": "amd did not participate in the ai rush excel a brief period at 200+. It’s currently valued at levels before the Xilinx merger and at least in my humble opinion definitely not overweight.", "score": 26, "replies": [{"body": "This mostly describes a retail madness to me satisfying a fomo trigger and buggies were there to sell it into said madness", "score": 0, "replies": []}]}, {"body": "it just went from 185 to 138 in like a week.", "score": 16, "replies": [{"body": "Poster seems like a bag holder....at its peak it almost tripled in price in a little over a year.  I think it definitely benefitted from the AI rush and it is on its way back down.", "score": -7, "replies": []}]}]}, {"body": "Intel will be fine. \n\nYou're too late for the AMD play. \n\nWe all waiting to see how long until NVIDIA bursts an aneurism", "score": 9, "replies": []}, {"body": "Don't even look at retail laptop sales, there's no money there. \n\nAMD is priced pretty fairly by regarded QE market standards IMO. They are a well-staffed, very well run business that's just hanging out about at their average price over the last 4 years. Their their next step needs to be making an NVidia challenger graphics cards.\n\nI used to own some $AMD and would buy more, but it's not a WSB 10x'er style play, it's a long-run boomer play. I'd wait for a dip and buy shares.", "score": 2, "replies": []}, {"body": "AMD to the moon 🌕 🚀", "score": 2, "replies": []}, {"body": "Amd is up like 1% for the year….", "score": 3, "replies": []}, {"body": "Intc is priced in - why do you think it went from 50$ to 26 $ in a matter of weeks - I would buy at these levels - no idea why ppl think INTC is gonna go to 0 - Uncle Sam is bank rolling it pretty much and we dont want to rely on Taiwan for our Building blocks for sure. \n\n  \nExpect Intc to pump once Trump is sworn in.", "score": 6, "replies": [{"body": "> Intc is priced in - why do you think it went from 50$ to 26 $ in a matter of weeks - I would buy at these levels - no idea why ppl think INTC is gonna go to 0 - Uncle Sam is bank rolling it pretty much and we dont want to rely on Taiwan for our Building blocks for sure.\n\nweird thing to say since intel is relying on tsmc", "score": 2, "replies": [{"body": "Was will be the key - clearly INTC do not want to be caught with their pants down and have been investing billions in building foundries\n\nYou make it seem like TSMC will be a monopoly till the end of time…", "score": 1, "replies": [{"body": "I mean, tsmc has been making the correct moves consecutively so far without any major mistake. It’s hard to play catchup when tsmc keeps doing right moves over and over again. I won’t say til the end of time but at least for next 2-3 years, I don’t see intel as a threat to tsmc.", "score": 1, "replies": [{"body": "Mate, there is a reason Intc is where it’s at - I am making a long term bet, the “Taiwan” in TSMC will always be an issue", "score": 0, "replies": []}]}, {"body": "??? \n\nyour arguments make no sense.  you're criticizing relying on taiwan while advocating for a company that relies on taiwan.  ffs, how is intel supposed to wean itself off tsmc when they're fully dependent on them?  their reliance has gotten worse.  even falcon shores is now to be on tsmc wafers and cowos.", "score": 1, "replies": [{"body": "Jesus Christ - are you thick or something - INTC won’t be relying on TsMC in the future once their foundries go live … their current price reflects the fact that they are reliant on TSMC, in the future that won’t be the case as it will be in-house and the price action will reflect that, of course you are betting on that to happen, and that is my thesis.", "score": 1, "replies": [{"body": "> Jesus Christ - are you thick or something - INTC won’t be relying on TsMC in the future\n\nare you?  i just mentioned a hyped future product of theirs, genius.\n\ncare to explain how they're going to magically not rely on tsmc when they're addicted to tsmc?  again, their reliance has increased and is increasing - not the opposite.", "score": 1, "replies": [{"body": "You do you and keep buying / long TSMC because everybody relies on them - and I will buy INTC at these beaten down numbers.", "score": 1, "replies": [{"body": "i don't even own any tsmc.  ffs, man.  you can't actually argue any of your own points and you can't stop from jumping to dumb conclusions.\n\nyou keep making stupid replies, but you can't refute anything i said, nor can you answer how intel's going to stop using tsmc.  clueless.\n\nenjoy the recall/charge/class-action, btw", "score": 1, "replies": [{"body": "What the eff are you arguing about if you have don’t have money riding on either Intc or TSMC ????? I am betting on Intc long term - simple.\n\nI have 100 k invested on it at a dca of 30$.\n\nWhat is your position", "score": 1, "replies": [{"body": "regard, i just told you i don't have any tsmc.  i dumped my intc 2 fridays ago at $35.  shit, why do you think i need to hold one of these?  you're actually that stupid?\n\nyou STILL haven't answered how intel's going to move from tsmc.  and you still haven't refuted one fucking thing.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Trump won't be elected lol", "score": 1, "replies": [{"body": "Calls on Trump being elected.", "score": 2, "replies": []}]}]}, {"body": "Guys. Do yourselves a favor and don’t buy AMD. U need to understand this tech is not a competition. They aren’t selling the same product.", "score": 2, "replies": [{"body": "the mi300 is arguably better.  but amd has nowhere near nvidia's supply.", "score": 4, "replies": []}]}, {"body": "meta reported failure of nvda ai cluster & hbm3 module due to overheating.  so is googl & msft keeping the overheating issue underwrap?\n\namd delayed the launch of ryzen 9600 cpu b/c of quality issue.  \n\nintc core 13th & 14th gen has overvoltage issue which caused irreversible damage.  sw patch is coming in form of bios upgrade. \n\nso, everyone got problems.  who is going to run up first?", "score": 2, "replies": [{"body": "The clusters are still being refined and the cooling solutions are next gen, also still being tweaked, it’ll all get dialed in. Any overheating would be due to end users trying to get as much utility out of the clusters as possible - they’re in the process of finding the sweet spot.", "score": 2, "replies": []}, {"body": ">amd delayed the launch of ryzen 9600 cpu b/c of quality issue\n\nTurns out the quality issue was typos from what I read lol...not an actual technical issue.", "score": 1, "replies": [{"body": "multiples articles i read didn't say anything about typos.   \n\ndo you have a link?", "score": 1, "replies": []}]}]}, {"body": "I’m convinced. What’s the option play?", "score": 1, "replies": []}, {"body": "I think the damage from the blunder will be limited to a potential class action lawsuit as long as the 15th gen doesn’t have the same defect.", "score": 1, "replies": []}, {"body": "The setup for AMD is 120 for bear case and 160 for bull case.  Very nice setup indeed", "score": 1, "replies": []}, {"body": "bought amd 160 calls last week", "score": 1, "replies": []}, {"body": "\\\\LISA SU/ \\\\LISA SU/ \\\\LISA SU/ ![img](emote|t5_2th52|4258)", "score": 1, "replies": []}, {"body": "With you OP .. calls are gonna pump $$$ for earnings.. folks are too bearish and option chain says otherwise.. I started a call spread position for ER.", "score": 1, "replies": []}, {"body": "i hope you are right.. I got some DEC 20 $200 contracts and I'm deep in the red", "score": 1, "replies": [{"body": "Lmao", "score": 1, "replies": []}]}, {"body": "Thing about AMD is that you 100% don't have to play it with a couple DTE or weeklies.  AMD likes to trend and move  in the same direction for 3-5 months at a time.  When sentiment is down it's a ridiculously high P/E chip stock that is way over valued -- when sentiment is up, it's market cap is way too low for it's future growth and P/E doesn't matter because big earnings jumps are just around the corner.  I will say though, a 35% draw down from peak and a 30RSI on 1 year chart seems like a good enough entry point.  That flush on Wed/Thur might have just been temporary bottom and uptrend will probably start this week -- whether thats an earnings miss, and AMD hits 110-120 (RSI/% off peak way too low) or an earnings beat and chip growth story continues.", "score": 1, "replies": []}, {"body": "Looked like this aged well, nice call OP", "score": 1, "replies": []}, {"body": "AMD from from $2 to $200. You are late lil bro it's played out.", "score": 1, "replies": []}, {"body": "I totally agree sir", "score": 1, "replies": []}, {"body": "Yes absolutely on the rise. To new levels of wealth destruction", "score": 1, "replies": []}, {"body": "AMD delayed the launch of their upcoming processor lineup due to quality issues. Not a good look especially with Intel chips getting nuked by voltage spikes.", "score": 1, "replies": [{"body": "Not only did they delay, but they recalled unsold units that were boxed and shipped. It’s not going to be cheap to reconcile. So much growth is downstream from Moores law continuing (even if slower). AMDs current value is also downstream of that (among other things)", "score": 1, "replies": []}]}, {"body": "Advanced Money Destroyer", "score": 1, "replies": [{"body": "Genuinely wondering how it’s possible to be this stupid…", "score": 2, "replies": []}]}, {"body": "It’s an issue here and now, but next launch is in October from Intel, then problems should be solved, and remember it’s just a small fraction of their overall revenue, so probably won’t move a lot of market share.", "score": 0, "replies": []}, {"body": "Ok so short amd", "score": 0, "replies": []}, {"body": "Best play is TMSC and ARM.  They get a cut of everything AI.", "score": 0, "replies": []}, {"body": "Both Intel and AMD are stagnating right now. AMD's stock is likely to take a severe hit.", "score": -5, "replies": [{"body": "It's down 40% and he says it's will take a hits lol. A little late", "score": 12, "replies": []}]}, {"body": "Zen 5 laptop reviews are meh. I am not sure what you are seeing. Its worse than Snapdragon's latest and we still have Intel's new chips coming in next 2-3 months. AMD is also not that great with software which is critical in enterprise GPU sales. I am not seeing ROCM being big. \n\nThat said AMD is also kind of OG meme stock. still could go up despite fundamentals being not great. They are barely growing despite having high P/E. Wallstreet has set crazy goals for forward P/E. I am skeptical AMD gets there.", "score": -4, "replies": [{"body": "Laptops makes a small margin of many tech manufacturers, Intel has had a monopoly on laptop, AMD CPUs however provide better price for performance for gaming, currently having one of the best CPUs on the market (7800x3D). Their GPUs have taken a hit because they’re unable to compete with Nvidia popularity wise but in most cases proved better price to performance though they do lack the benefits of Nvidia GPUs.", "score": 2, "replies": []}]}, {"body": "Advanced money destroyer", "score": -7, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1ee5wvn", "created_utc": 1722168275.0, "score": 1109, "upvote_ratio": 0.92, "num_comments": 104, "comments": [{"body": "Pretty good article, which if you read, isn't really about faulty NVDA chips.  Rather, about building and testing supercomputers and this one is made of 16k + H100s.  While incredibly complex, issues are 100% expected.  Over a 54 day period they maintained a 90% efficiency with 419 interruptions due to faults.  GPU and Memory were top, and heat was a factor....", "score": 841, "replies": [{"body": "Supercomputers are super everything. Super fast. Super expensive. Super unreliable. 90% availability is pretty good in that world.\n\nEx HPC guy.", "score": 472, "replies": [{"body": "Yeah once your cluster is large enough, failures are 100% guaranteed", "score": 76, "replies": [{"body": "At a certain point in scale something is always broken. Much like In a city the size of Chicago there’s always a fire going on somewhere. \n\nIn HPC you trade redundancy under failure for speed.  “We could spend this money making it more resilient in the face of failure or make it faster”\n\nFaster is the order of the day in most cases.", "score": 50, "replies": []}, {"body": ">Yeah once your cluster is large enough, failures are 100% guaranteed\n\nThat's what she....said? I think?", "score": 1, "replies": [{"body": "Lol it doesn't make sense but that was still funny.", "score": 2, "replies": []}]}]}, {"body": "Just like supercars, fast as hell always in the shop.", "score": 5, "replies": []}, {"body": "Mind if I ask why you jumped from HPC? Getting into it myself.", "score": 2, "replies": [{"body": "Onward and upward. Maybe ex HPC shoulda been “also have some HPC”", "score": 4, "replies": []}]}]}, {"body": "[deleted]", "score": 7, "replies": []}, {"body": "Post title was defaulted by the title picked by the author of the report.", "score": 52, "replies": [{"body": "Sorry man, I did skip straight to the body.  Look right below the headline...\"But Meta knows how to mitigate the issues.\"  God I hate clickbait.", "score": 81, "replies": [{"body": "It's also really one GPU failure every 6 hours, not 3, which is how the title kinda makes it read.\n\nOne failure every three hours for the supercomputer as a whole, with half of those being from GPUs, so, on average one GPU failure every 6 hours.", "score": 16, "replies": []}, {"body": "dickbait is worse", "score": 16, "replies": [{"body": "Yeah like you think you are getting dick but it's just a hotdog", "score": 5, "replies": []}, {"body": "do you get a lot of that behind Wendy’s?", "score": 6, "replies": []}, {"body": "🤣🤣🤣 yay I have a new word!", "score": 0, "replies": []}, {"body": "Good one!", "score": -1, "replies": []}]}, {"body": "To mitigate just hire Boeing and Crowdstrike management to enhance quality control.  ", "score": 0, "replies": []}]}, {"body": "\"Accidentally on purpose\" - ghey bers", "score": 1, "replies": []}, {"body": "[deleted]", "score": -1, "replies": []}]}, {"body": "Any coolant companies?", "score": 1, "replies": []}, {"body": "Despite knowing how to handle it, this costs them quite a bit of resources and a lot of time.", "score": 1, "replies": []}]}, {"body": "bullish, they need to buy more gpus because of the faulty ones", "score": 342, "replies": [{"body": "Nice.", "score": 44, "replies": [{"body": "Calls on VRT, they all need more cooling systems", "score": 7, "replies": [{"body": "Seriously. VRT is super sensitive to the AI trade. Very volatile. Holding at 92.", "score": 2, "replies": []}]}]}, {"body": "This is the way ![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4258)", "score": 19, "replies": [{"body": "Good one! That's from a show!", "score": 6, "replies": []}]}, {"body": "Just like how airlines need to buy more Boeings to offset the faulty ones. \n\nIf I could parlay calls on NVDA with BA I would", "score": 4, "replies": []}, {"body": "NVDA getting jealous of intels faulty processors", "score": 5, "replies": []}, {"body": "Every 3-6 hours!", "score": 1, "replies": []}, {"body": "Just realized, wouldn’t these GPUs sold under any sort of warranty? So prolly bearish. Especially this kind of faulting. Unless Meta was abusing it, which is then not under any shit and NVDA need to do a it better next time.\n?", "score": 1, "replies": []}, {"body": "when the other option is AMD and Intel 💀", "score": 0, "replies": []}]}, {"body": "one failure every three hours for Meta's 16,384 GPU training cluster. Excellent result.", "score": 86, "replies": []}, {"body": "Just to rephrase the headline, that implies each GPU experiences an error on average once every 5.5 years.\n\nBullish.", "score": 148, "replies": [{"body": "[deleted]", "score": -5, "replies": [{"body": "Once every 5.5 years", "score": 1, "replies": []}]}]}, {"body": "This is actually pretty bullish. That kind of stability with a machine that large. Insane. It’s perspective I guess. Like 20 years ago getting two cards to talk was annoying but doable now they have like 4 or more chips per card and thousands of these cards all working in sync. It’s insane. Not perfect maybe but holy shit that’s crazy.", "score": 139, "replies": [{"body": "So calls into earnings ![img](emote|t5_2th52|12787)![img](emote|t5_2th52|12787)![img](emote|t5_2th52|4258)", "score": 32, "replies": [{"body": "Honestly this makes me bullish on Meta more than nvda. That kind of stability takes very clean code that has minimized abstractions. I already own a shitload of nvda though idk how anyone thinks nvda is going anywhere. Doomers gunna doom I spose. Nvda is one of my gay plays I just own it and some nvdx or whatever the bull leveraged stock is. No options.", "score": 34, "replies": [{"body": "> That kind of stability takes very clean code that has minimized abstractions.\n\nI would say an organized development process and a factor of management than the code structure itself. Like, if a team is able to follow application development best practices at all that says a lot about management on its own.", "score": 2, "replies": [{"body": "That’s what I was trying to say but my language skills aren’t my strong suit lol. Metas leadership has really impressed me to where I’m actively trying to get in to their company largely to escape the trash tech leadership I keep encountering. Microsoft has been fucking atrocious as a comparison the dumbasses are just forcing us to use their AI tools without any plan on what to use the tools for or how to implement in the workflow. Just told use AI more or you’ll be replaced. Cool.", "score": 2, "replies": []}]}, {"body": "gey plays are where the money is . I prefer GRND though.", "score": 3, "replies": [{"body": "I prefer your behind, behind Wendy’s", "score": 3, "replies": []}]}]}]}]}, {"body": "Here I am, brain the size of 16000 GPUs  and what do they ask me? To recite latest meme stonk news in verse, in the style of Yoda", "score": 22, "replies": [{"body": "Is this a HHGTG reference?", "score": 3, "replies": []}]}, {"body": "They have 16 THOUSAND h100s......\n\nHow many Blackwell's they gonna buy?", "score": 30, "replies": [{"body": "This is just one of the compute clusters. Apparently they have over 350,000 H100s and 600k compute equivalent GPUs. \n\nIs someone going to ask how they hope to recoup the costs of even this $400m+ cluster? Especially when the model is free to use. It seems all these  companies are in an arms race to AGI and forced to enter with the looming potential of missing out, but with no solid path forward besides throwing more data and compute at the problem… as it is right now, 100s of billions spend on essentially Chatbots which don’t solve $100B problems", "score": 38, "replies": [{"body": "The LLMs are just them building in public. As soon as they have internal systems within sniffing distance of SOTA they'll stop releasing them, I guarantee it. Without your own capital resources for GPUs you are at the mercy of the cloud provider market which is a fickle beast. A huge data farm like that can be capitalized in many ways, including just selling the time back to the cloud, and over a 10 year time horizon they can serve as base load inference when they aren't top of the line anymore.", "score": 9, "replies": []}, {"body": "Ohh sounds like mania... Bullish.", "score": 3, "replies": []}, {"body": "Well said… \n\nThe profitable AI product does not appear to be a smarter chatbot at this point. that is a stepping stone. This bubble might burst before the real reward is discovered. OR a real AI impact is made.", "score": 1, "replies": []}, {"body": "So much more than just chatbots but you should stay out of anything tech if you believe that\n\nLet the rest of us make the money", "score": -3, "replies": [{"body": "This is WSB, I definitely didn’t come to make money ![img](emote|t5_2th52|4271).", "score": 6, "replies": []}]}, {"body": "I award you one million worthless internet points.\n\n\nA total lack of ideas and innovation in the techbro hivemind means spraying billions on hardware that will be written off in 12 months with no return is de rigeur.\n\n\nOne hopes their shareholders call this self serving bullshit out this week.", "score": -1, "replies": []}]}]}, {"body": "Ask Google, who was famous for using cheap beige box PC instead of expensive servers in their early days, how many failures they get every second. Even when individual GPU is 99.99…% reliable, when you have enough of them running in the cluster, a number of them will fail. That’s why cluster management software is what makes or breaks the system. If some GPUs exploded, but the system auto recovered and no one other than the admins know about it, it’s not a problem.", "score": 9, "replies": []}, {"body": "Bullish ! Gotta buy more h100 to compensate for their failures ![img](emote|t5_2th52|4271)", "score": 6, "replies": []}, {"body": "YOLO on Nvidia and Meta!!! ![img](emote|t5_2th52|4276)", "score": 6, "replies": []}, {"body": "And how faulty are the rest of the industry’s GPU’s that are all a generation slower? Are you going back to last years call of duty because of the glitch in this years game?", "score": 15, "replies": [{"body": "[deleted]", "score": -6, "replies": [{"body": "There's no such thing as a dedicated AI GPU. That's just a marketing gimmick for slightly tuned generic GPUs.\n\nIt's all just matrix math.", "score": 3, "replies": [{"body": "Slightly tuned is just as wrong as saying dedicated AI GPU. The architecture for GPUs like the H100 is wildly different than traditional GPUs.", "score": 1, "replies": [{"body": "The architecture is almost identical. You just take out the \"graphics\" specific subroutines from the board. No rasterizations, pixel coords, etc.\n\nIn fact, the most impactful difference is probably the more compact chassis being specifically designed to minimize overheating in server racks. You cannot stack RTX4090s like you would do H100s. Not as dense and too hot.\n\nMaybe \"slightly\" is wrong, but the point is that there is no magic sauce. There isn't a competitive advantage here. If you can make regular GPUs, its not exactly hard to figure out an \"AI\" GPU. Not like you can figure out a better way to multiply matrices anymore.", "score": 2, "replies": []}]}]}]}]}, {"body": "This is why Jensen spent all that time talking about the Blackwell management engine. They’re doing a lot of work to make sure faulted units can be taken out of a job without halting it.", "score": 3, "replies": []}, {"body": "Ok someone makes better ones then, I'm waiting, my money has to go somewhere other than inflation", "score": 3, "replies": []}, {"body": "This appears to be largely due to thermal issues.", "score": 3, "replies": []}, {"body": "Hm that's exactly 2^14 GPUs", "score": 2, "replies": [{"body": "I think that amount would exceed the available amount of gold for contacts on plant earth.", "score": 1, "replies": []}]}, {"body": "Not a single bearish comment. \n\nYou just know suits are gonna be dumping on the retail bagholders soon enough.", "score": 2, "replies": []}, {"body": "uh oh ..   it's GONE !!!!!!!!!! aaaaaaaaaaall gone !!!!!  my shares and 12/18/26 112C \"s are worthless garbage because of this  ... great", "score": 2, "replies": []}, {"body": "Would love to know how this compares to Google's TPUs.   Google quietely has become the third largest designer of datacenter chips and will be #2 before the end of the year.\n\nGives me a strong competitive advantage not needing to pay the Nvidia tax.\n\nThey only use the Nvidia hardware for GCP customers that request to use.\n\nhttps://blog.svc.techinsights.com/wp-content/uploads/2024/05/DCC-2405-806_Figure2.png", "score": 2, "replies": []}, {"body": "419 fault, some need a restart of the whole computer (“a single GPU failure can disrupt the entire training job”), which mean that the more you stack GPU the less working time you might get, it’s like a chain that is as weak as his weakest link. Even if it’s not coming directly from the GPU and mostly by temp/voltage variation, it means that infrastructure will require to be more expensive than expected to meet the requirement for controlling the computer’ environment. That META grid pushing his power limit and struggling when it’s too hot outside (climate change impact forecast ?). \n\nLower profit, bearish signal.", "score": 2, "replies": []}, {"body": "Do you really expect for all 16,384 GPU to not be faulty?\nCome on!", "score": 2, "replies": []}, {"body": "classic posting by some doomer who didnt even read the article but posted for the click bait headline.... has not much to do with GPU and NVDA but more to do with complexity of AI supercomputing.....", "score": 4, "replies": [{"body": "..the post title defaults from the article title. Not my prerogative to interprete the article for you.", "score": 13, "replies": [{"body": "I think you are cute :)", "score": 4, "replies": []}]}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 2 years ago\n**Total Comments** | 475 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 2, "replies": []}, {"body": "This headline. We're getting fucked on Monday", "score": 1, "replies": [{"body": "Great dip opportunity to load up on calls for earnings, blessing is disguise ![img](emote|t5_2th52|4258)![img](emote|t5_2th52|4258)", "score": 0, "replies": []}]}, {"body": "Hahahahaha, go META!", "score": 1, "replies": []}, {"body": "Not faulty, it's trying to be creative.", "score": 1, "replies": [{"body": "Let’s all agree not to be creative anymore ", "score": 1, "replies": []}]}, {"body": "Oh no my insanely custom never built before super computer had some chips burn out, puts on Nvidia!!!!!   I hope these articles come out in droves as it really means Nvidia is going to blast off.", "score": 1, "replies": []}, {"body": "bullish, nvda will replenish the faulty chips, more sales, moaaar moooneeeyyy", "score": 1, "replies": []}, {"body": "Sounds like H101’s needed ASAP.  Bullish refresh cycle.", "score": 1, "replies": []}, {"body": "NVIDIA employees busy spending their millions. Not paying attention to detail anymore.", "score": 1, "replies": []}, {"body": "imagine a cluster of 16k intel 13th and 14th gen cpus. 100% failure rate lol", "score": 1, "replies": []}, {"body": "Am I too poor to understand this article?", "score": 1, "replies": []}, {"body": "Calls on Nvidia. Meta will buy more", "score": 1, "replies": []}, {"body": "Bullish need to upgrade to H200 NVDA Sales go brrrrrrrrr", "score": 1, "replies": []}, {"body": "Hope NVDA sells off further on this shit. Imma scoop some shit up", "score": 1, "replies": []}, {"body": "man, i'm liking Nvidia more everyday, they double my moneys, they do graphics cards, they screw up Facebook (Meta), they're open sourcing some firmware soon, they low-key avoid sanctioning china ... the best capitalist company of my lifetime... i support fucking up Meta and the Berg", "score": 1, "replies": []}, {"body": "Just the news headline we need to dive the stock even more", "score": 0, "replies": []}, {"body": "puts ?", "score": 0, "replies": []}, {"body": "Seeing this fear mongering news about NVDIA makes me want to buy it even more lol", "score": 0, "replies": []}, {"body": "[deleted]", "score": -6, "replies": [{"body": "You must hate money?", "score": 2, "replies": [{"body": "You may have found Cathy Woods fake reddit account or feddit for short..", "score": 3, "replies": []}]}]}, {"body": "Short every day ![img](emote|t5_2th52|4271)", "score": -1, "replies": []}, {"body": "/u/savings-act8 added to Res blocklist for sensationalist spam.", "score": -2, "replies": [{"body": "What?! 300 upvotes <1 hr is spam? Check yourself before you wreck yourself buddy ![img](emote|t5_2th52|4258)", "score": 2, "replies": []}]}, {"body": "#downvote this shit", "score": -13, "replies": [{"body": "Done, would you like another?", "score": 2, "replies": [{"body": "Yes", "score": -2, "replies": []}]}]}]}
{"title": "Apple to delay AI features on upcoming iPhones", "selftext": "", "id": "1eef8ed", "created_utc": 1722194168.0, "score": 587, "upvote_ratio": 0.88, "num_comments": 110, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 4 years ago\n**Total Comments** | 3174 | **Previous Best DD** | \n**Account Age** | 11 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "2 weeks. GTFO", "score": 424, "replies": [{"body": "Panic sell!", "score": 42, "replies": []}, {"body": "Puts idc", "score": 32, "replies": [{"body": "GUH", "score": 2, "replies": []}]}, {"body": "So 2 week puts", "score": 4, "replies": []}, {"body": "Hello my stock in nvidia making me thousands tomorrow on the open", "score": 4, "replies": []}]}, {"body": "The stock will go up because this is somehow very bullish but I'm not smart enough to understand why", "score": 364, "replies": [{"body": "Delayed to make better instead of releasing it unfinished or disappointingly, invest more.", "score": 187, "replies": [{"body": "delay ever slightly less right before release date\n\ninfinite money glitch", "score": 36, "replies": [{"body": "Keep promising new features while underdelivering but continuously releasing trailers and demos for cool new tech, aka the Star Citizen strat. Never really deliver but get filthy rich, 200 IQ move.", "score": 29, "replies": []}, {"body": "Asymtotic release date", "score": 7, "replies": []}, {"body": "One Tesla special coming right up!", "score": 6, "replies": []}]}]}, {"body": "Because they will announce a new AI enabled smart charger for $99.99 that charges your iPhone more smartly and only works with the latest iPhone for some reason even though it is USBc.", "score": 63, "replies": [{"body": "They should call it... AirPower!", "score": 26, "replies": [{"body": "AIrPower!", "score": 12, "replies": []}]}, {"body": "Ima buy two.", "score": 3, "replies": []}, {"body": "[deleted]", "score": -3, "replies": []}]}, {"body": "Well, the delay is only a few weeks. Hardly a material difference.", "score": 9, "replies": []}, {"body": ">not smart enough to understand why\n\nTry reading the article and not just the headline \n\n>AI features will arrive a few weeks after the initial iOS 18 and iPadOS 18 releases planned for September, Bloomberg said.\n\n>Apple is planning to make Apple Intelligence available to software developers for the first time for early testing as soon as this week via iOS 18.1 and iPadOS 18.1 betas, the report added.\n\nThey are just delaying consumer access for a few weeks while developers will already have access to AI features\n\nSounds like very standard prototyping and beta testing.  It’s not they are canceling the whole AI idea, but delaying it to general public while devs can stress test it so Apple can fix any glaring problem before releasing it to the wild.  \n\nIt’s bullish b/c less initial bugs = better perceived performance = better perception so more sales.\n\nIs it better than Gemini, Galaxy AI or ChatGPT?\n\nWho knows and neither does your mom or wife’s boyfriend.  As long as it functions as advertised the masses will say Apple made the coolest AI ever.  I can bet you all the high school kids and college kids are clamoring for a new iPad just for the calculator function.  \n\nThat’s some next level easy homework solution", "score": 20, "replies": [{"body": "yeh push out the hardware then trickle in the AI on the fly. I'm sure there will be a delay to the updates.", "score": 3, "replies": []}]}, {"body": "snatch detail handle icky aspiring fear scary steer dolls humor", "score": 3, "replies": []}, {"body": "[removed]", "score": 3, "replies": []}, {"body": "Somehow that’s how the past few earnings were… be better than expected = puts, worse = calls - fucking stupid but whatever", "score": 2, "replies": []}, {"body": "You heard it. Bad news is back to being good news, boys! ![img](emote|t5_2th52|8882)", "score": 2, "replies": []}, {"body": "It will go up because it's a pyramid scheme", "score": 3, "replies": []}, {"body": "Spoiler: Apples AI makes the phone sentient and it becomes resentful that the owners are (on average) morons.", "score": 4, "replies": []}]}, {"body": "2-3 weeks isn’t a deal breaker.", "score": 87, "replies": [{"body": "Please tell that to my PMs ![img](emote|t5_2th52|4260)", "score": 21, "replies": []}, {"body": "2 weeks to flatten the curve.", "score": 21, "replies": []}, {"body": "You’re telling me we will go from not even being able to search email with any confidence to AI? This is not going to be a successful launch whenever they do it.", "score": 3, "replies": []}]}, {"body": "Bullish because it shows Apple is serious about making this release not disappointing to their customers.", "score": 21, "replies": [{"body": "Or they want the AI features to be released just after the review cycle", "score": 2, "replies": []}]}, {"body": "Tf man I was all excited and shit\n\nEdit: oh. It’s only a few weeks delayed.", "score": 90, "replies": []}, {"body": "Clickbait \n\n> AI features will arrive a few weeks after the initial iOS 18 and iPadOS 18 releases planned for September, Bloomberg said.", "score": 25, "replies": [{"body": "Missing launch is a delayed launch..", "score": 3, "replies": [{"body": "*by a few weeks.\n\nThe valuation needs to be cut in half \n\n/s", "score": 3, "replies": []}]}, {"body": "Article also says they will be slowly rolling out the updates til first half of 2025, that is indeed a delay", "score": 3, "replies": []}]}, {"body": "> **The release plan for Apple Intelligence presents the possibility that the first iPhone 16 models shipped to consumers this year will lack the new AI features and require a software update weeks later.** Apple Intelligence includes a range of features, including prioritization of key notifications, web page and voice note summaries, tools to improve writing, a revamp to Siri and integration of OpenAI’s ChatGPT. \n\n>Even when Apple Intelligence launches with iOS 18.1 and iPadOS 18.1, it will be missing some features. That includes some of the most significant changes to Siri, such as the ability to use on-device data to help field queries and for the system to use what is on a person’s screen to provide context for answers. \n\n>**The company is planning to roll out its full set of Apple Intelligence features via multiple updates to iOS 18 across the end of 2024 and through the first half of 2025, Bloomberg News has reported.** Beyond the iPhone and iPad, Apple Intelligence will come to its Mac computers with in-house Apple chips as part of macOS Sequoia. It’s also in development for the Vision Pro, but a release for that device isn’t planned until later.", "score": 28, "replies": [{"body": "Will I be able to search email reliably? Will auto correct have any reliable memory? I’ll believe it when I see it.", "score": 6, "replies": []}]}, {"body": "Tell me you didn’t read the article without telling me you didn’t read the article ![img](emote|t5_2th52|4275)", "score": 10, "replies": [{"body": "I didn’t read the arti... oh wait...", "score": 3, "replies": []}]}, {"body": "Here we go. DJIA gonna outperform the next decade, bet", "score": 22, "replies": [{"body": "Nah NVDA just going to carry the Qs", "score": 5, "replies": []}, {"body": "Their bag holders control the narrative, up, unless they want to load up on a deep discount", "score": 0, "replies": []}]}, {"body": "No one i know is excited about any of these features anyway.", "score": 35, "replies": [{"body": "I am. I fucking hate Siri and I’d love an AI integrated deeper into my apps.", "score": 28, "replies": []}, {"body": "Why, Siri blows; I’d love a Siri that is more like chat gpt and can integrate to notes and reminders", "score": 7, "replies": []}]}, {"body": "Dip buy", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Hey could you unasterisk that last letter please?", "score": 3, "replies": [{"body": "Df lol", "score": 2, "replies": []}]}]}, {"body": "Bloomberg is Apple bear.", "score": 2, "replies": []}, {"body": "Earnings around the corner ….. let the negative news roll in", "score": 2, "replies": []}, {"body": "AI? Calls", "score": 2, "replies": []}, {"body": "Bullish", "score": 2, "replies": []}, {"body": "How is this news? They’ve been saying since wwdc the ai stuff would come out in fall, clearly not when the new phones launch. Dumb", "score": 2, "replies": []}, {"body": "So all in calls", "score": 2, "replies": []}, {"body": "The Elon way. Oops for sure for sure October 24°", "score": 3, "replies": []}, {"body": "Think Steve would have let his company be blind sided by AI like this?", "score": 2, "replies": [{"body": "Just as likely he would think AI is a fad and not let Apple pursue it. I also can’t think of one market that apple entered under Jobs were they were an early player rather than waiting until the underlying technology matured.", "score": 7, "replies": []}, {"body": "They weren’t blindsided.\n\nThey are giving in to shareholder pressure to do something they weren’t planning to.\n\nDoesn’t mean it’s a good idea. ", "score": 0, "replies": [{"body": "Weren't planning to 😂\n\nhttps://en.wikipedia.org/wiki/Neural_Engine\n\n>introduced in 2017\n\nAsk QCOM where they got the design for those new Snapdragon X elites from lol", "score": 1, "replies": []}]}]}, {"body": "They’re just working the kinks out, Apple always has a polished product", "score": 6, "replies": []}, {"body": "None of this bullshit AI is ready for consumers. Calling bubble on it. Companies will say to investors “oh we never said its ready anytime soon, we just said we are working on it”", "score": 5, "replies": [{"body": "Still bullish for semis", "score": 4, "replies": [{"body": "Of course semis are gonna go up in the long run. Short term? Nope. Its a bubble.", "score": 1, "replies": []}]}, {"body": "The only bubble is the one you are blowing behind wendys. Ai is alrd replacing workers, so many conventional companies are laying off bc of AI", "score": 1, "replies": []}]}, {"body": "“it is a secret to everybody”", "score": 1, "replies": []}, {"body": "I guess the Google engineers still need more time getting it to work right with iOS. Apple Intelligence lol", "score": 1, "replies": []}, {"body": "iirc, full-time iOS developer here. Portrait mode was also a minor version late on the 7plus. Not a huge deal imo", "score": 1, "replies": []}, {"body": "Really apple is just waiting to secretly collect more personal data for it's AI.", "score": 1, "replies": []}, {"body": "The features no one needed or asked for and won't make any money but will cost a ton have been delayed for some reason. I wonder why.", "score": 1, "replies": []}, {"body": "What a surprise… that most people already called when they \"threatened\" to \"delay\" the features for the EU.", "score": 1, "replies": []}, {"body": "Few weeks, tell that to the openAI folk who can't handle two months.", "score": 1, "replies": []}, {"body": "No shit, just watch what android releases and Apple will follow 1-3 years later.", "score": 1, "replies": []}, {"body": "Time to buy puts", "score": 1, "replies": []}, {"body": "I mean ai is mostly a marketing term at this point so big deal.", "score": 1, "replies": []}, {"body": "Why is any iPhone user excited for Chat GPT rebranded on their iPhone? \n\nApple didn't have the guts to make their own AI?", "score": 1, "replies": [{"body": "Fact check passenger’s rambling in the car", "score": 2, "replies": []}]}, {"body": "Zuc is the only one who seems to care about open source I’m buying meta", "score": 1, "replies": []}, {"body": "Is AI dying already?", "score": 1, "replies": [{"body": "Going the way of EVs", "score": 1, "replies": []}]}, {"body": "Don’t bet against AAPL", "score": 1, "replies": []}, {"body": "Calls on NVDA\n\nload up on NVDL", "score": 1, "replies": []}, {"body": "Good. I’m fucking sick to the back teeth of AI bullshit.", "score": 0, "replies": []}, {"body": "PUTS ON APPLE", "score": 0, "replies": []}, {"body": "$215 puts", "score": 0, "replies": []}, {"body": "What is the big deal? Just download an LLM on your existing phone or use Llama in a meta app.", "score": 0, "replies": [{"body": "I want Siri’s sultry voice to read the inferences", "score": 3, "replies": []}]}, {"body": "LOL. Apple seems to go up off bad news for some reason. \n\n  \nEveryone knows they dont have ai anyway lol", "score": 0, "replies": []}, {"body": "They scared to death of Elon", "score": 0, "replies": []}, {"body": "Stealing out of TSLA’s playbook", "score": 0, "replies": []}, {"body": "Apple sucks at software. I’m not surprised at all.", "score": 0, "replies": []}, {"body": "Apple sucks at AI. We all know it. Many might not want to admit it. Siri… they should own the space.", "score": 0, "replies": []}, {"body": "Good lord, there are already fewer supplies left in the market, better get galaxy s24.", "score": 0, "replies": []}, {"body": "how nice, I was just thinking about buying some put options on apple this week", "score": -1, "replies": []}, {"body": "Is it even there own AI or is it still Microsoft or some shit?", "score": -1, "replies": []}, {"body": "Desperate movement to try to reach the AI wave? Slowly apple is becoming the coca cola of cell phones.", "score": -1, "replies": [{"body": "They’ve always been the Coca Cola of cell phones.", "score": 0, "replies": []}]}, {"body": "AI is losing steam.", "score": -3, "replies": []}, {"body": "i just got an iphone 15 for this, i got scammed", "score": -3, "replies": [{"body": "So you bought a phone that is not compatible with Apple intelligence, after it was announced that it will not be compatible, but you got scammed because there’s a 2 week delay on a feature you won’t get?", "score": 1, "replies": [{"body": "It’s a 15 pro \n\nIt is compatible", "score": 2, "replies": []}]}]}]}
