{"title": "Got assigned some Mega Cap Stocks that are down over 100% - what are some fundamentals for me to write covered calls on these", "selftext": "I am down about 80% each of them.\n\nI understand if I sell a covered call and the price goes over the strike, I will have a capital loss.\n\nEg. I had sold an Apple put for 220 that got assigned to me.\n\nNow I am already down 7,600 on that as of today based off the price of 154.\n\nI am thinking about doing covered call that is 10% above from the current price on a 30 day basis- however, I would like to understand the risks of doing this and if there specific metrics or % I should be aiming for.\n\nMy plan is if the strike hits, I will repurchase Apple at its current price and write the call again to help close my loss.\n\nI am assuming others have gotten into similar positions and how they are currently handling it?\n\nI believe I am missing some points to this plan but like to hear opinions on it.", "id": "xe989j", "created_utc": 1663179699.0, "score": 13, "upvote_ratio": 0.64, "num_comments": 94, "comments": [{"body": "Why did you sell an AAPL 220 put?  AAPL has never been above 220.", "score": 83, "replies": [{"body": "Can’t lie- I laughed out loud at the thought of anyone selling a 220P and being surprised when they got assigned", "score": 66, "replies": [{"body": "Yhea sadly this sub is full of wsb members who don't understand shit about theta and still think they did a nice play lol", "score": 17, "replies": []}]}, {"body": "Can’t believe anyone would do that lmao", "score": 41, "replies": []}, {"body": "Came here to wtf this as well, wrong sub OP, hit up wsb they’ll break you in gewd", "score": 16, "replies": []}, {"body": "I was like huh, Apple's ATH last year was like $185, why in the ever loving fuck did OP sell that $220 put?", "score": 4, "replies": [{"body": "probably thought the market would continue to just shoot up like most people seemed to think it would", "score": 1, "replies": []}]}, {"body": "and in one of the worst bear markets in history", "score": 18, "replies": [{"body": "What now? How short is this history?", "score": 7, "replies": [{"body": "Lots of people think we are just getting started. Future history man.", "score": 2, "replies": [{"body": "😄", "score": 1, "replies": []}]}]}]}, {"body": "Same reason people buy otm calls when a stock has never been that high", "score": 5, "replies": [{"body": "Not the same. Buying an OTM has some basis in reality especially if you are buying it a ways out.  Selling a PUT at $220 when atm is $182.94 is nuts, makes absolutely no sense.", "score": 36, "replies": [{"body": "Guessing he needed the premium to buy into another trade, and didn’t expect early assignment….except for the fact that he sold +30% ITM during another shitty CPI report….honestly. It was just full retarded", "score": 11, "replies": []}, {"body": "B-b-b-but that premium!\n\nYou're right. That's dumb AF, but I bet their play was \"I expect to roll out.\"\n\nLike..if he bought them for 0.05, maybe if/when aapl was at $200 they'd be worth $0.40 and they close. Obviously only if there was enough time left...\n\nDidn't work out though.", "score": 2, "replies": []}, {"body": "Except for dividends, it’s the same as buying the stock and writing a 220 call, but the capital required is a lot less.", "score": -3, "replies": [{"body": "Sorry if I read this wrong, but it's not the same as buying the stock and writing a call for the dividends. Selling a put doesn't give you the dividend for the underlying since you don't own the stock. Buying the stock and then selling a cc will give you the dividend though as long as it doesn't get assigned before the ex dividend date.", "score": 5, "replies": [{"body": "The dividend is mostly priced into the puts. Aka you get a bit more premium", "score": 2, "replies": []}, {"body": "Yes, that s what I said. Selling a 220 put is equivalent to buying the stock and selling a 220 call. The minor differences are that you don’t get the dividend, and selling the put requires less capital (assuming a margin account), and you’re not paying margin interest. You can reduce margin requirements further by buying a cheap out of the money put wing.", "score": 2, "replies": [{"body": "Good ol‘ put, call parity.", "score": 3, "replies": []}, {"body": "It's not equivalent, it puts you in a similar play, but there is a larger risk for the buy/sell CC method.", "score": 0, "replies": [{"body": "No, the risk is the same. If you’re short a put and the stock goes down, you have the same loss as if you buy the stock and write a call.  Likewise, if the stock price goes up, your gains will be capped when the short put goes to zero, exactly as it would if you are long the stock and short a call.\n\nGoogle put-call parity for a better description of this fact.\n\nFor the case where you’re short a put and you buy an out of the money put wing, that’s equivalent to a collar. That is, long stock, short a call, and long a protective put.", "score": 2, "replies": [{"body": "You aren't wrong. But the risk comes from the added steps to exit, the costs associated with that, and how your account looks leading into your loss that may adjust how you feel.\n\n\nIt's shit simple to close out a cash secured put for a 20% loss.\n\nYour CC is going to look nice at a 20%  real loss, \"because I can buy my CC back for cheap\" and skew your belief moving forward of \"it can go back up\"\n\nI'd rather sell a CSP for $1 and close out watching a down trend at $1.20 than buy and hold shares, and think \"ayyyyyy CC is doing great!\" On that same downtrend, only to have shares so far below my CB that the risk to sell any profitable CCs and being assigned below that CB makes me a bagholder.\n\n\nNot to mention the need for full capital upfront while a CSP will normally automatically factor your premium received into the cash securing it's own position.", "score": 2, "replies": [{"body": "Ok, well, I agree that a CSP is simpler,  and has less fees. And, it is my preferred play. But, from put call parity view, it is still equivalent to a covered call. Beyond that we’re just haggling over the details.", "score": 2, "replies": [{"body": "Yep! I think the difference is just in how much weight we put on the \"human factor\" (vis-a-vis me highlighting how the person feels watching their CC drop closer to worthless vs watching their CSP increase in price)\n\nTo me, the only reason to enter a position you intend to wheel as a share purchase and ITM CC sale is if you're in a registered account that don't allow you to sell short (from personal experience, Canadian TFSAs are like this, and I have done exactly what you described simply because Im not allowed to sell CSPs in the account per regulation.)", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Greed?", "score": 1, "replies": [{"body": "with AAPL? If youre gonna be that dumb at least do it on a high IV stock lmao", "score": 7, "replies": []}, {"body": "You are playing IV and theta. The stock doesn’t need to reach that price in order for you to profit. Just make the directional move", "score": 6, "replies": [{"body": "He was playing delta not theta. That strike is pretty deep ITM to be of any theta value.", "score": 11, "replies": []}]}]}]}, {"body": "To answer all these comments, this was back in Dec 2021 and Apple was 180 and got up a 50 premium, \n\nYes I believe in Apple to rebound and long-term health of the company.", "score": 1, "replies": [{"body": "You got the 50 difference to the strike price as intrinsic value.\n\nYou didn't buy AAPL at 220, you bought at 220-50=170\n\nSo if you sell covered calls at or above 170, you would actually make a profit if you get your shares called away.", "score": 11, "replies": [{"body": "Came here to say this.  It is the only answer to the question.", "score": 2, "replies": []}]}, {"body": "So what happened is you failed to roll your position", "score": 7, "replies": []}]}, {"body": "That premium though.. 💦", "score": 1, "replies": []}]}, {"body": "OP, what is your net stock cost?  $220 minus the premium you got when you sold the put?  \n\nA 30 dte 220 put sells for about $64.50 today, so the net stock cost would be about $155.50.\n\nSell a 9 dte 155 CC to collect about $3.60 in premium and if called away make $3.10 or $310 in profit.", "score": 48, "replies": [{"body": "This guy theta’s hard", "score": 18, "replies": [{"body": "The total net cost would be $170 at the moment.", "score": 5, "replies": [{"body": "So you're only down \\~8% on this position", "score": 36, "replies": []}, {"body": "You're in decent shape on this trade!  \n\nSell a 170 strike CC out a few weeks or 30ish dte to work the net stock cost down, or make a small profit if assigned . . .", "score": 2, "replies": []}]}]}]}, {"body": "Well first, using your example you’re only down 6600 not 7600. Second, you appear to be completely ignoring the premium you were paid when you sold the put. Your loss seems hardly as substantial as you make it out to be", "score": 32, "replies": [{"body": "This is the right answer.  Seems most traders don’t “do the math” necessary to know where they are at . . .", "score": 19, "replies": []}, {"body": "Well you cant count money twice. And i spent the premium on blow and hookers.", "score": 12, "replies": [{"body": "If you track the YTD p&l on the stocks you trade this will matter . . .", "score": 1, "replies": []}]}]}, {"body": "Might be an opportunity for a repair strategy? I opened a repair strategy on a position today. Results to be seen, but it’s a position I want to be out of as quickly as possible while minimizing losses. \n\nhttps://www.investopedia.com/articles/trading/08/repair-strategy.asp", "score": 13, "replies": [{"body": "Nice read… never knew this existed, thanks for sharing", "score": 6, "replies": []}, {"body": "I believe my losses are too high for this to work but will look into it", "score": 3, "replies": [{"body": "I think you'd be looking at the Jan 2024 options to make this viable. The 160 call is $24.95. And the 190s are 12.95 each (so $26 and .95 collected in premium). Anything expiring earlier than that would be a debit.", "score": 2, "replies": []}]}]}, {"body": "What premium did you collect on a 220 put?", "score": 6, "replies": [{"body": "50 dollar", "score": -1, "replies": [{"body": "So you paid 170. It’s at 155.  Sell December 22 calls for 180.", "score": 13, "replies": []}]}]}, {"body": "[removed]", "score": 7, "replies": []}, {"body": "There seems to be a lack of love for deep ITM put selling around here. Bit weird, if you consider that its very similar, positioningwise, compared to selling cc's.  Not suggesting it in general, but it can be a valuable strategy and a useful tool in your box (if you know what you're doing).", "score": 3, "replies": [{"body": "Deep ITM doesn’t usually make sense as ATM has more extrinsic value to make a higher profit.  Deep ITM collects less profit but has higher odds of being assigned if that is what someone wants.", "score": 3, "replies": [{"body": "Correct, so for that reason you would normally go over 90 DTE or even 2023, 2024 and always watch extrinsic value. The trade is focused on economic delta gain, since its a very marginfriendly way to get \"stock like\" exposure. Depending on your broker, it can also increase your buying power.", "score": 3, "replies": [{"body": "Ok, now I’m listening.", "score": 1, "replies": []}, {"body": "You know theta decay starts to ramp up about 60 dte, right?\n\nThat means it would be far better to sell a put every 60 days instead of one 90+ as those will sit there doing little.", "score": 1, "replies": [{"body": "Your margin on 60DTE is somewhere between 400-600% and for 360DTE and up somewhere between 120-30% (roughly speaking). This isn't about theta decay, but efficient positioning.", "score": 1, "replies": []}]}]}]}]}, {"body": "If you are worried about assignment 10% is not enough leeway, even on weeklies. If you do a covered call you will be risking assignment either way. You can always monitor to roll the position out and take smaller losses or smaller gains on the roll.\n\nBest case you gradually lower your cost basis, worst case you get assigned and start over with the losses. You could also do cash secured puts to purchase more and lower your average if you have the cash and want the stock.\n\nPersonally I'm a bit worried about the bear market not being over so I'm staying away from cash secured puts right now. Delta is one metric to look out for, I would do more research if I were in your position though.", "score": 2, "replies": [{"body": "I am not worried about assignment because that would trigger a capital loss that I can offset my gains. \n\nThe goal is to lower my cost and get my assets to at least make some sort of income for me as we go into the bear market.", "score": 1, "replies": [{"body": "Sell a .25 to .3 Delta CC every 2 to 4 weeks. Ignore your insane cost basis as it is now a sunk cost and literally doesn't mean anything.", "score": 2, "replies": [{"body": "Any reason why .25 to .3 Delta?", "score": 1, "replies": [{"body": "Chance for them to be assigned is small compared to premium received.\n\nTypically once I am 50% in profit I put a trailing stoploss of about 10 to 20% of the remaining value so that if the underlying runs I BTC at over 50% profit.\n\nBest practice is to sell on Green days.  The greener the day the further I sell the DTE.  So if Aapl is up 1 to 2% I would probably sell 2 to 3 weeks out.  If it is up 3% I would probably sell 4 to 5 weeks out.  I pick the DTE by finding the strike that is in the delta range I give so maybe a week sooner or later. Pay attention to earnings etc.\n\nIf there is a big red day sometimes I will BTC early if I feel like there could be a good recovery within a couple days so I am uncovered and can sell a new CC.", "score": 5, "replies": []}]}]}, {"body": "Assignment doesn’t trigger a capital loss. It only affects your cost basis.", "score": 2, "replies": [{"body": "Exactly. OP needs to close this position to realize the loss (and avoid the wash sale rule when buying back in). Either by buying back the options now, or selling the stock below cost basis when they get assigned/exercised.", "score": 1, "replies": []}]}]}]}, {"body": "Sell weekly CCs at .15 delta, or could go higher delta if you don’t care about assignment… might be pennies, but will help reduce your cost basis", "score": 2, "replies": []}, {"body": "You can look at Delta values to get an idea of the probability that you'll be assigned on your covered calls. For example, a 0.15 Delta call has about a 15% chance of being assigned. This is not to mean that Delta is a measurement of assignment risk, but it's commonly used to get an approximation for that.", "score": 2, "replies": []}, {"body": "This is such an over exaggeration. You are down approximately 8% on this position at this moment if you factor the premium recieved once it's all said and done.", "score": 2, "replies": []}, {"body": "If you cant work out your cost basis on a stock you sold puts on, you shouldn't be here.", "score": 2, "replies": [{"body": "Omg shut up", "score": -1, "replies": []}]}, {"body": "You talked about getting assigned and repurchasing. This would get you a wash sale, so I'd look into that before doing this unless deducting this from taxes isn't an issue for you(such as in an IRA)\n\nI'd sell covered calls until my shares got called away then move on to a different stock at least for 31 days(wash rule looks back 30 days and 30 into the future to see if you repurchased) before buying AAPL again. This would allow you to deduct your loss on the shares from any gains you make this year on everthing else.", "score": 1, "replies": [{"body": "You don't understand wash sales. They have no tax impact unless they carry over the end of the year, they will only adjust cost basis mid year.", "score": 4, "replies": []}]}, {"body": "take your loss and stop gambling, start studying and don't touch options until you can prove you are profitable in a paper trading account.\n\n&#x200B;\n\nYou blew up already, and by the looks at your question, you are well on the way to doing again.", "score": 0, "replies": []}, {"body": "How can they be down over 100%?", "score": 1, "replies": [{"body": "Margin\n\n&#x200B;\n\nedit: though I don't know how the stocks themselves can be down over 100% like is claimed in the OP", "score": 1, "replies": [{"body": "Sorry, that doesn't make sense. \n\nI need to stock to recover more than 100% eg.", "score": 0, "replies": [{"body": "If a stock is down over 100% then it would be below $0.00.", "score": 0, "replies": [{"body": "Eg. I bought a stock for 320, \n\nIts value is now at 150 dollars - so I am down 170 dollar \n\nI need the stock price to recover more than 100% was my point", "score": 1, "replies": [{"body": "Dude, you have absolutely no clue what you're talking about. The best advice here is to stop playing options until you at least have a small understanding of how it works.", "score": 1, "replies": [{"body": "Dude, are you stupid?\n\nIf I buy a stock at 100, and now it is worth 20 dollars, it is down 80%. \n\nFor it to return to $100, the price needs to increase by 400%. \n\nWhat don't you understand?", "score": 0, "replies": [{"body": "Well done, you read a few of the comments on your post. You clearly didn't understand this simple math when you posted your title, which has nothing to do with eBay you just commented.. Read your own title and quit pretending like you're not a lost puppy. Advice remains the same. Stop playing options because you seem neither smart enough to understand them or wise enough to be humble and learn what you don't know.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "sell <0.2 delta covered calls?", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Let's just say my cost basis is still 220 per share for another stock I owe and I want to break even as soon as possible with the current price at 155.", "score": 1, "replies": []}]}, {"body": "Why the fk would u even sell deep itm puts", "score": 1, "replies": []}, {"body": "Bro, what?", "score": 1, "replies": []}, {"body": "Not sure if this is satire. $220 put on apple is ridiculous.", "score": 1, "replies": []}, {"body": "Ouch. \n\nFor cover calls I stay as high as I can and keep expiry just a few days to collect premium. A month out it is difficult to predict its future.", "score": 1, "replies": []}, {"body": "Hold that shot and sell cc for quite the some time, you’ll be fine.", "score": 1, "replies": []}, {"body": "Wtf did I just read? \n\nStop doing this. Go learn more. \n\nStop playing w options. Go learn more.", "score": 1, "replies": []}, {"body": "The fuck you doin selling 220 ITM puts on apple lol….why did you create this situation for yourself bruh. 220 Puts lol", "score": 1, "replies": []}, {"body": "I think you should have done this post before selling that 220 put.\nThat put has always been itm, so you sold it to own the stock (at least someone who understands options would have done that for this reason probably)\n\nNow it's up to you, if you are stil bullish on Apple you can keep the stock and wait, or you could sell a call against it but knowing that if assigned you would lock in a loss.\nAlso you need to consider the scenario of apple keeping going down.", "score": 1, "replies": []}, {"body": "Dude, you actually paid 170 per share so that's your cost basis.\n\nSell 170 strike or higher calls with 4-6 weeks duration and your good", "score": 1, "replies": []}, {"body": "You're being a little dramatic and your calculations are wrong.", "score": 1, "replies": []}, {"body": "\"Got assigned some Mega Cap Stocks that are down over 100%\"\n\nLOL....what???", "score": 1, "replies": []}]}
{"title": "Intel Has Never Been This Oversold (Not Financial Advice)", "selftext": "Warren Buffet tells us to be greedy when others are fearful, and this is one of those cases in the long term.\n\nOver its entire life span, Intel has never had an RSI value on its monthly chart be this low. This brings to question, is it Intel's death? I don't think so. There are a few things we need to consider with Intel; Taiwan, x86 and RISC V, GPU, ARM chip manufacturing, and upcoming manufacturing plants.\n\n[Look at the RSI \\(1-month chart\\)](https://preview.redd.it/my6bmdx0eun91.png?width=1756&format=png&auto=webp&s=1d6e8bd5a2608e06eca54314e8794dfd0f07d9ed)\n\nTaiwan\n\nAs you may know, tensions between the US, China, and Taiwan are rising, bringing a considerable risk for TSMC. If Taiwan becomes a part of China, TSMC's business will get limited by the US government. Companies like AMD, Nvidia, and Qualcomm use TSMC for chip manufacturing. If the US stops dealing with TSMC, they will increase their spending on local chip manufacturing, and most of the G7, G8, and G20 will follow.\n\nX86 and RISC V\n\nIntel knows x86 is dying, so they've been looking for a new solution. ARM is not entirely out of the question, but it also uses an aging process. Though ARM is more energy efficient, it has its security flaws. Intel is investing a lot of money and time into RISC V as a new CPU architecture. While not supported by Windows yet, there have been many improvements in the space, and RISC V could be a threat to ARM in the future.\n\nGPU\n\nIntel is starting to make GPUs available to the public. The first generation may not be their best work, and there will be things to work out, but the room for growth is massive, and with their in-house chip manufacturing, they could bring manufacturing costs down and seriously compete with Nvidia and AMD.\n\nARM Chip Manufacturing\n\nIn 2023, Intel will be manufacturing and shipping ARM chips for other companies, expanding their sales and chip process domains. This will allow Intel to dip their toes in ARM chips and allow them to profit from the situation in Taiwan. If Nvidia, AMD, and Apple can't use TSMC, they will have to reach out to Intel for more chips.\n\nUpcoming Manufacturing Plants\n\nThe US government recognizes they can't use TSMC if China takes over Taiwan (which is mainly why they would go to war) and therefore wants to increase chip manufacturing on US soil. They will invest in Intel. They are planning to make more facilities soon which are super expensive.\n\nThough Intel is struggling in the short-term, in the long-term these things will work out. The R&D is very intense with this company, and Pat Gelsinger knows it. Once things happen in Taiwan, Intel knows it'll be on a path of tremendous growth. It just needs to sit on the sidelines for a little before the next wave of computing comes to the market. You also can't forget they have the majority of CPU sales in PCs even with AMD putting up a serious fight.\n\nWhat are your thoughts?\n\nhttps://preview.redd.it/zztgffarhun91.jpg?width=1080&format=pjpg&auto=webp&s=dd19eba296efd9912b1efc754930cdf738c9c7ae", "id": "xe54vc", "created_utc": 1663169918.0, "score": 15, "upvote_ratio": 0.61, "num_comments": 95, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|1 year ago\n**Total Comments**|9|**Previous DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=xe54vc)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=xe54vc)\n    \nHey /u/Correct_Huckleberry4, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 1, "replies": [{"body": "Added position", "score": 2, "replies": []}]}, {"body": "This is financial advice (this is not financial advice).", "score": 43, "replies": [{"body": "PUT YOUR HANDS UP No_Profit1711!!! POLICE ARE ENROUTE! PREPARE TO BE BOOKED FOR PROVIDING ILLEGAL FINANCIAL ADVICE!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 16, "replies": [{"body": "You've been caught", "score": 16, "replies": [{"body": "Sir this is a Hardee’s", "score": 6, "replies": []}]}]}]}, {"body": "This is completely irrelevant to stock price. But Intel actually had an NPC advertisement yesterday on Roblox. 🤣", "score": 17, "replies": [{"body": "That's funny🤣", "score": 3, "replies": [{"body": "Yeah. Lol. The ad that came afterwards was for State Farm auto insurance. \n\nNormally it’s ads for children’s toys and movies. Games. Stuff like that.", "score": 2, "replies": []}]}]}, {"body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 16, "replies": [{"body": "[deleted]", "score": 19, "replies": [{"body": "Idk but I'll top Ken Griffin's wife", "score": 9, "replies": []}]}]}, {"body": "It can go lower", "score": 15, "replies": [{"body": "Intc is a value trap it can go lower and never recover. RSI is a terrible indicator and should not be trust.  It can remain oversold way longer than you can imagine.\n\nLook back at 1999 and 2000.  Anyone that bought then and has held since is still underwater even now including Dividends.", "score": 8, "replies": [{"body": "Who said anything about rsi?", "score": 1, "replies": [{"body": "It's in the fucking title", "score": 2, "replies": [{"body": "Right, but what does that have to do with my comment?", "score": 2, "replies": [{"body": "Uh it's in agreement to your comment. OP uses RSI (oversold) to indicate it is likely to go up. You said it can go lower. Response to your comment was elaborating on why.", "score": 0, "replies": []}]}]}]}]}, {"body": "It definitely can with a market crash, which will be the dip to buy Intel for massive gains", "score": 9, "replies": []}]}, {"body": "Intel isn't struggling in the short term. They have been struggling for multiple CPU generations.  \n\nIntel used to led the world in manufacturing capability - adopting new process tech, optimizing it for yield. They paired this with great architectures.  \n\nTSM out-manufactures them. AMD is out-designing them.  \n\nIntel bulls want to talk about the foundry business they are establishing. What exactly is the sales pitch to Nvidia \"Hey Nvidia, its Intel, the guys that used to the lead the world in new process tech adoption. We aren't really any good at that any more, so we are giving you a ring to see if you want to come to us instead of TSM?\"  \n \n\nIf the economy goes to hell in a handbasket, and Intel has to cut the dividend, watch out.", "score": 14, "replies": [{"body": "Finally you are the only smart guy here. People who bought into intel now are in for a bagholding of a lifetime in red. Intel share price will only bleed and bleed.", "score": 3, "replies": [{"body": "Both of you guys are smart.  I have seem so many Intc posts and it is a trap.\n\nIf and when Intc actual builds new foundries and turns things around there will be plenty of time to buy in the next 3 to 5 years.  There are much better places to put your money in the next 6 mths to 3 years.", "score": 3, "replies": [{"body": "All three of you guys are brilliant! \n\nIntel is in the middle of getting it's dick kicked in and I personally won't consider investing until they buy a cup or at least roll over.", "score": 1, "replies": []}]}]}]}, {"body": "Very cool\n\nI heard a lot of retards saying they are happy to buy intel under 50 in the last year because it cant possibly go to 40 and there is no way its dips below 30 because its an absolute steal", "score": 14, "replies": [{"body": "Those are just random numbers they pulled out of their ass though. This play isn’t about fundamentals or valuation its based purely on an insanely oversold technical bounce.", "score": 3, "replies": [{"body": "Oversold ... lol\n\nWho the fuck is gonna buy it over the next 12-18 months? Nobody.", "score": 0, "replies": [{"body": "When the rubber band is pulled this tight all it takes is the tiniest catalyst or even some short covering and it can launch so fast. You’ll see. I have no interest in owning this company but these calls are definitely gonna print.", "score": 3, "replies": [{"body": "Give me a timeframe, what are your calls dated?", "score": 1, "replies": [{"body": "I bought December calls but not planning to hold to expiration. As soon as it is pops I’m out.", "score": 1, "replies": [{"body": "!Remindme 2 months\n\nDid theta destroy this man's INTC position?", "score": 1, "replies": [{"body": "I will be messaging you in 2 months on [**2022-11-15 14:33:36 UTC**](http://www.wolframalpha.com/input/?i=2022-11-15%2014:33:36%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/xe54vc/intel_has_never_been_this_oversold_not_financial/ioja5ws/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fxe54vc%2Fintel_has_never_been_this_oversold_not_financial%2Fioja5ws%2F%5D%0A%0ARemindMe%21%202022-11-15%2014%3A33%3A36%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20xe54vc)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Ouch, Theta raped you on this one bruh.\n\n- 9/15 $28\n- 9/30 $25.50\n- 10/11 $25\n- 10/25 $27.50\n- 10/28 $29\n- 11/9 $27.50\n\nCalls purchased anytime on or before 9/15 stood no chance.\n\nEdit: only calls bought on 10/11 stood a chance.", "score": 1, "replies": [{"body": "Sorry for slow reply. I sold these after about a week for a small loss. Market conditions just make it regarded to be holding calls on anything.", "score": 1, "replies": []}]}]}]}]}, {"body": "Me", "score": 1, "replies": []}]}]}, {"body": "I can't tell you a price but just looking at the RSI you can see something is weird, it's never seen that number before.", "score": 2, "replies": [{"body": "I like the play OP just bought a bunch of December $32.50 calls 💪🏽", "score": 7, "replies": []}]}]}, {"body": "I’m long. Also in intel", "score": 11, "replies": [{"body": "long inside", "score": 7, "replies": [{"body": "Underrated comment.", "score": 1, "replies": []}]}, {"body": "It's too cheap", "score": 0, "replies": [{"body": "Is it cheap for a reason?", "score": 0, "replies": []}]}]}, {"body": "Yep. I am long in intel.", "score": 6, "replies": []}, {"body": "Bruh. RSI barely touched 30 and you are calling it oversold. Looks like you need confirmation bias instead of thoughts and discussions", "score": 5, "replies": [{"body": "I wouldn't freak if this was on the daily chart, this is the month chart and it's never been that low since IPO.", "score": 1, "replies": [{"body": "Pff. I can probably find a ton of stocks that have monthly RSI readings below 30 that goes on to die. Even using INTC for example, it was overbought according to RSI quite a few times but it kept on being overbought for months until it came down.", "score": 1, "replies": [{"body": "Yes, but eventually it corrected, all stocks go through this and it wouldn't be cause for concern, and since it's monthly candles it can take a few months. With that being said eventually it will crawl out of it and normalize, return to the middle. Intel is not a short term play, it's a long term growth. The fact that this has never happened on this chart is different and cause for interest. with a market crash coming soon it's likely to go down for the next few months, but after the crash it's interesting for sure.", "score": 1, "replies": []}]}]}]}, {"body": "“They’ll be releasing GPU’s. Yes, they’ll suck and no one will will buy them because strong competition already exists, but they’ll be there which is kinda neat”", "score": 3, "replies": []}, {"body": "Nice try Pat!", "score": 7, "replies": [{"body": "not pat lol", "score": 1, "replies": [{"body": "Just like Pat would say ![img](emote|t5_2th52|12787)", "score": 5, "replies": []}]}]}, {"body": "Apples M Series chips are by far better than anything Intel has and they have been at it for decades, its embarrassing.  Company has crap leadership", "score": 4, "replies": [{"body": "Yeah, but it uses ARM and TSMC which means Intel could end up manufacturing Apple's chip next year if things go wrong in Taiwan. An overall win for Intel if that happens since they will be manufacturing ARM chips.", "score": 5, "replies": []}]}, {"body": "Intc is absolutely a steal, but you may have to wait for negative sentiment to end", "score": 6, "replies": [{"body": "Yeah, this is long term not short term.", "score": 2, "replies": []}, {"body": "A real steal is CLOV", "score": 1, "replies": [{"body": "Buy some of WiSh while you're at it", "score": 2, "replies": []}]}]}, {"body": "Intel is new nokia, only an idiot thinks it's a good buy.", "score": 6, "replies": []}, {"body": "GOOGL and or Amazon placed Dow 30 replacing Intel and Walgreens??? Weights been dropping pretty  hard past 6 weeks. 🧐🧐🤷‍♂️🤷‍♂️", "score": 2, "replies": [{"body": "Harder than they should", "score": 3, "replies": [{"body": "Yeah, been watching the Dow 30 list weighting past couple months. Something is whacked. 🧐", "score": 2, "replies": [{"body": "Total market overreaction", "score": 3, "replies": []}]}]}]}, {"body": "I am with you 10000% on this. I would wager intel been looking underperforming against amd as they were more concerned about graphics.", "score": 2, "replies": []}, {"body": "Recession incoming, chips too cyclical", "score": 2, "replies": []}, {"body": "Calls and shares in MU, got it", "score": 2, "replies": []}, {"body": ">Intel CEO Pat Gelsinger spoke at the Evercore ISI TMT conference yesterday, saying that the company **expects to continue losing data center market share** **throughout at least 2023** and will only begin **regaining in 2025 and 2026**.\n\nThis is All you need to know\n\nlol", "score": 2, "replies": []}, {"body": "Ha I actually just applied for a job there", "score": 2, "replies": []}, {"body": "You almost got me pal, good thing i noticed that you had AMC and GME in ur tradingview watchlist.", "score": 4, "replies": [{"body": "Gotta have a long term plan with your short term lol", "score": 1, "replies": []}]}, {"body": "Intel will be like Nokia.", "score": 3, "replies": [{"body": "So a meme stock", "score": 3, "replies": []}]}, {"body": "Fuck Buffet HE KNOWS NOTHING!!!!", "score": 2, "replies": []}, {"body": "still waiting for the bottom.", "score": 2, "replies": [{"body": "Same here, I think we're close.", "score": 0, "replies": [{"body": "yes we are", "score": 1, "replies": []}]}]}, {"body": "If you're looking for a stock to buy and let sit for 5 years...Intel should be really high on the list at this point", "score": 2, "replies": [{"body": "Why it would be dead money.  Much better places to put it.  Amd will keep taking Intc lunch.", "score": 2, "replies": []}]}, {"body": "I wouldn‘t touch Intel even if it would be the only listed company in the world…", "score": 3, "replies": []}, {"body": "I own INTC and think it is value (hopefully not a value trap?)  . The only problem with your DD as far as TSMC is: they are investing over 100 billion in Phoenix AZ building one of the world largest chip plants. TSMC builds the most sophisticated hard to build chips ,that is why NVDA, etc buy chips from them as not too many chip makers have the capability to make the    5-nanometer chips . Intel currently does not have said capability. And Nancy Pelosi was just there visiting her husbands money, he is heavily invested:) .  That all being said I like intel for a LONG term play and bought the dip yesterday. TSMC is in Phoenix to cover in case China gets crazy in Taiwan....  https://www.cnbc.com/2021/10/16/tsmc-taiwanese-chipmaker-ramping-production-to-end-chip-shortage.html", "score": 1, "replies": [{"body": "TSMC is at a technological advantage right now, and that's a fact. My worry for TSMC is political. What if China forces them out of the US? Plus Intel has played catch-up many times before with AMD. Once the US pours more money into chip manufacturing in the US, Intel will be included, and I think that's when they will start to pull ahead again. China could slow TSMC down if things get too frisky.\n(Edit: grammar)", "score": 1, "replies": [{"body": "Intel is getting demolished technologically, I think that makes everything but your WW3 concerns invalid. A year or so ago they had a big exodus of engineering talent. That being said if we do go to war with China everything is going to implode so it’s still not a good investment anyway. \n\nThey could turn it around sure, but I don’t think it’s the slam dunk you want it to be.", "score": 3, "replies": [{"body": "They are getting demolished which is why they're looking into Risc V and manufacturing ARM chips. Their plans leading into 2025 are what could turn the company around. Chip manufacturing turnarounds take multiple generations, and the wave we're seeing kicking off behind the scenes could be the comeback. The processors we have right now are based on x86 which dates way back to the 70s. With RISC V being open source they can apply more pressure than ARM in terms of development, which is precisely the catch-up they need. Apple's M series chips are better not solely because of TSMC, but because they maximized Arm's capabilities as a desktop platform. Most rendering programs are still x86. ARM is currently threatened by RISC V. Only time will tell what happens.", "score": 1, "replies": []}]}, {"body": "Well  I like them both and own both , TSMC  as great as they are, cash machine, low pe, great earnings  they have the Chinese stigma ,the stock has done nothing except go down:( All semi,s are out of favor though. Rest assured China has not much Control over TSMC USA operations. TSMC now can tell China F off ..TSMC pays plenty to Chinese officials and I am sure the Biden crime syndicate too :)", "score": 1, "replies": [{"body": "Tsmc is overvalued, like nvidia. The cash flows in the last year are not sustainable. Declining revenues incoming!\nBe careful of the covid benefit many companies received in 2020 and 2021", "score": 3, "replies": []}]}]}]}, {"body": "Solid balance sheet, nice margins although slowly declining, in house manufacturing, R&D and product strategy is more laser focused than ever. INTC is one of the best bargains at the moment, P/E average for the industry is \\~18, INTC is at \\~6. However, rising rates are going to be a huge catalyst for declines in the tech sector and valuation is going to get even more tempting. Looking to go balls deep with 25% OTM calls between 24 and 26.", "score": 1, "replies": []}, {"body": "fuck outta here.  x86 aint going anywhere.  Big biz and banking using ourdated shit for decades.  Fuck you.", "score": 1, "replies": [{"body": "Yes, they will keep selling x86 to big business and legacy systems; that's businesses not leaving old systems that work. However, in the power user world, ARM processors have never been a more significant threat. RISC V is open source and developer friendly which is scary for ARM. This is precisely what Intel needs to succeed in a few years. Intel is being disrupted, and solutions won't come to market for a while. When Intel keeps pushing RISC V, be ready for a hardcore competition like what AMD did with Ryzen, and Apple did with the M1.", "score": 1, "replies": [{"body": "I recall some news a few months back saying Intel will also be making more efficient Betcoin mining chips and in the same news that Block (formerly Square) is already in line to buy. \n\nI have a few shares (bought in the $40s) and would love to believe in this long transformation strategy. \n\nWhen the next bull market finally comes hopefully it will be good timing for both Intel and Betcoin as the latter has been fairly correlated with the market for quite some time. (Though I'm still convinced the coin is more pegged in a \"Delta One\" type derivatives/futures contract tied specifically to inverse short term volatility.)", "score": 1, "replies": []}]}]}, {"body": "gonna buy for $20 or under", "score": 1, "replies": [{"body": "That's if that happens. If so you'll be printing.", "score": 1, "replies": []}]}, {"body": "Eh, I'll see it lower.", "score": 1, "replies": []}, {"body": "I love intel.  I use their chips. Never had an issue with my gaming pc’s.  Holding inside.", "score": 1, "replies": []}, {"body": "Already a lot of chatter that Intel is gonna kill off their GPU division again.", "score": 1, "replies": []}, {"body": "$10 stock", "score": 1, "replies": []}]}
{"title": "Live shot at fed fighting inflation", "selftext": "", "id": "xe6ysk", "created_utc": 1663174237.0, "score": 1431, "upvote_ratio": 0.97, "num_comments": 93, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|65|**First Seen In WSB**|1 year ago\n**Total Comments**|3357|**Previous DD**|\n**Account Age**|5 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=xe6ysk)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=xe6ysk)", "score": 1, "replies": []}, {"body": "Nigeria my country 😂😂😂😂😂😂😂💔", "score": 125, "replies": [{"body": "Is your prince doing better? I hope my $1000 helped him. ![img](emote|t5_2th52|8883)", "score": 32, "replies": [{"body": "Iyalaya E", "score": 2, "replies": []}]}, {"body": "E pain me😭😭", "score": 19, "replies": [{"body": "Nah, it actually looks fun. E no make us look that bad", "score": 10, "replies": []}]}]}, {"body": "The fire is out. All you are seeing is called persistence of vision. It’s when you still see something after it’s gone.", "score": 76, "replies": [{"body": "So the fire is transitory is what you are saying", "score": 65, "replies": [{"body": "Yes just keep making up more none-sense terms and not deal with reality!", "score": 14, "replies": [{"body": "The definition of fire has changed to adapt to reality.", "score": 20, "replies": []}]}, {"body": "Yes, it comes and goes!!", "score": 1, "replies": []}]}, {"body": "\rIt was pure magic made by shaman :D", "score": 1, "replies": []}]}, {"body": "Nothing to see here! We made it go out you saw it!", "score": 67, "replies": []}, {"body": "fire is transitory", "score": 59, "replies": [{"body": "![img](emote|t5_2th52|4641)", "score": 8, "replies": []}, {"body": "![img](emote|t5_2th52|4640)", "score": 3, "replies": []}]}, {"body": "Underrated post", "score": 83, "replies": [{"body": "![img](emote|t5_2th52|4641)", "score": 3, "replies": []}]}, {"body": "The fire never went out", "score": 25, "replies": [{"body": "But he gestured very reassuringly.", "score": 11, "replies": []}, {"body": "Spoiler alert", "score": 2, "replies": []}]}, {"body": "He's using CO2 to fight an A class fire.\nHe should have used foam or powder", "score": 38, "replies": [{"body": "This is likely part of the education demonstration and why the other extinguishers are there.", "score": 31, "replies": [{"body": "He says that specifically toward the end. Can't understand it all cause he's speaking away from the camera, but it sounded like he said \"This is why foam something something something, reignited something\".", "score": 12, "replies": [{"body": "I heard \"there is a lot breeze and the fire will reignite.\"", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": -3, "replies": [{"body": "He's speaking English.", "score": 3, "replies": []}]}]}, {"body": "Yup. If you have a fire extinguisher read the side with the big letters on it. You’ll know when to use it. This was the worst fire extinguisher for this lmao.", "score": 6, "replies": []}, {"body": "You are right.\n\nDangers: CO2 extinguishers should not be used on fires involving solid materials, such as paper, wood and fabric, and also are not suitable for use on flammable gases. How it works: The CO2 works by cutting off the fire's oxygen supply. This then smothers it and, as it does so, extinguishes the flames.\n\nHe is teaching people without a proper knowledge.", "score": 4, "replies": [{"body": ">are not suitable for use on flammable gases\n\nI was taught\\* removing the flow of gas is the only solution. You don't want an explosion to replace your fire.\n\n\\*training for was for safety on ships, might not be correct in other situations.", "score": 3, "replies": [{"body": "I think depends on the situation. A single fire from a single source of gas, kill the fire then close the gas. A full fire with other points of fire, i think you are still right.", "score": 1, "replies": []}]}]}, {"body": "Just like the fed", "score": 1, "replies": []}, {"body": "Water would work as well in this case", "score": 1, "replies": [{"body": "Yes, water would work great.\nI didn't specify it in my comment, but I was talking about portable extinguishers. And to my knowledge a water extinguisher doesn't exist.", "score": 1, "replies": [{"body": "They exist. At least in Brasil, that what A tipe extinguisher have inside. They are usually 10kg fire extinguisher", "score": 2, "replies": []}]}]}]}, {"body": "Didn't you hear last month? The fire was over, it was defeated!!", "score": 4, "replies": []}, {"body": "According to this video, the longterm target rate of 2% inflation is going to have to be reset to 2.5% - 3.25%, and it may take all of 2023 and into the first quarter of 2024 before we get there despite a hawkish Fed with a restrictive stance throughout 2023 and Q1 2024.", "score": 3, "replies": []}, {"body": "This is normal, a co2 extinghuiser only breaks the fire triangle by taking the place of oxygen. Once c02 dissipates and oxygen can get back it starts again cause of available source of fuel and residual heat. Anyway we are fucked.", "score": 3, "replies": []}, {"body": "This is Africa", "score": 5, "replies": [{"body": "Could be Paris", "score": 18, "replies": []}, {"body": "This is Nigeria", "score": 6, "replies": [{"body": "Nigeria is in Africa.", "score": 3, "replies": [{"body": "Africa is on Earth", "score": 2, "replies": [{"body": "Paris is on Earth", "score": 2, "replies": [{"body": "Who is in Paris?", "score": 3, "replies": []}]}]}]}]}, {"body": "Are you Sherlock Einstein?", "score": 3, "replies": [{"body": "Looks more like Paris to me too", "score": 3, "replies": []}]}]}, {"body": "The government is pouring gasoline on inflation with these huge multi trillion spending bills and no way to pay for them except printing and borrowing money.\n\nEdit because I'm a regard...... I'll just get on my short bus and leave.", "score": 2, "replies": [{"body": "The Fed (Federal Reserve) is different from the the Fed (Federal government). You're mixing them up like a true regard.\n\nThe Fed Reserve is not doing any \"multi trillion spending bills\". They already stopped pumping money into the financial markets a few months ago.", "score": 7, "replies": []}]}, {"body": "Apparently you have to approach a fire the same way my portfolio takes it......", "score": 1, "replies": []}, {"body": "This has got to be a comedy skit", "score": 1, "replies": []}, {"body": "The guy is working hard send him 🍌 and 🍉 from the \"regards\"", "score": 2, "replies": [{"body": "Sending bananas and watermelons to Nigeria sounds racist", "score": 8, "replies": [{"body": "The fed is fighting inflation in Nigeria? Now wonder it's not working so well", "score": -1, "replies": []}]}]}, {"body": "made in china.", "score": -1, "replies": []}, {"body": "funny vid but last two months were basically no inflation tho", "score": -6, "replies": [{"body": "can I have some? I just ran out yesterday", "score": 4, "replies": [{"body": "everyone wants to talk abt inflation nobody wants to talk abt deflation tho", "score": 2, "replies": []}]}, {"body": "Yep.  0% MoM in July and 0.1% MoM in August means annualized 0.6%.  People were uppity when the feds ignored overall CPI in favour of core CPI to deny inflation last year, now it's the opposite, only looking at core CPI which clearly lags and got us into this inflationary mess.  Who would think that energy, excluded from core CPI, informs inflation of goods.", "score": 1, "replies": [{"body": "That’s not how CPI works. A CPI of 8.5% means that August 2022 prices are 8.5% higher than August 2021. A “change in CPI” of 0% means that the price changes between August 2022 and July 2022 are the same as the price change from August 2021 and July 2021. So let’s say the change in CPI is still 0% for the next 12 months all the way until August 2023. That would still mean that prices would have increased by 8.5% YoY from August 2022 to August 2023.", "score": 0, "replies": [{"body": "Dude no lol...  the month over month measurement is from July 2022 to August 2022... it is not a measurement of the difference of month over month from July to August 2022 vs. July to August 2021... that's absurd.  If MoM was 0% for 12 months, the YoY would be 0%.", "score": 1, "replies": []}]}, {"body": "\\-0.1 PPI today as well ;)", "score": 1, "replies": []}]}]}, {"body": "damn!\n\nthat inflation is HARD to put out!", "score": 1, "replies": []}, {"body": "What country is this?", "score": 1, "replies": [{"body": "Nigeria. Lovely Nigeria", "score": 2, "replies": [{"body": "Thanks. Looks like a fun place. Would love to visit. My dad introduced me to Fela Kuti’s music. Unbelievable music. Just unreal.", "score": 1, "replies": []}]}]}, {"body": "JUMBO SIR!!!", "score": 1, "replies": []}, {"body": "They make pretty solid fire in Nigeria.", "score": 1, "replies": [{"body": "I can't tell if you are joking or not, because that was really a fire from solid material, and that's why the CO2 extinguisher didn't work", "score": 1, "replies": [{"body": "I’m glad someone picked it up. They could have spent the next week trying to put it out.", "score": 2, "replies": []}]}]}, {"body": "You squeeze!", "score": 1, "replies": []}, {"body": "Inaccurate. He didn’t make it worse than it was…", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "Wrong type of extinguisher", "score": 1, "replies": []}, {"body": "This would be a class A fire, which is combustible material. He used a class BC extinguisher. \nPuts.", "score": 1, "replies": []}, {"body": "Fired guy.", "score": 1, "replies": []}, {"body": "Total fake… I didn’t see any marshmallows.", "score": 1, "replies": []}, {"body": "Is this a metaphor saying that the Fed is using the wrong tools, like the guy trying to put out a class A fire with CO2? Or am I just reading too much into this?", "score": 1, "replies": []}, {"body": "This is truth. The Fed can and well may raise interest rates until the whole financial system grinds to a halt, while prices continue rising because the federal government is still fueling the economy with $2 trillion of annual deficit spending.", "score": 1, "replies": []}, {"body": "lmao?", "score": 1, "replies": []}, {"body": "This is why you use AFFF for an oil/fuel base fire.", "score": 1, "replies": []}, {"body": "One does not fight inflation, one smothers it.", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4887)![img](emote|t5_2th52|4886)![img](emote|t5_2th52|4641)", "score": 1, "replies": []}, {"body": "\"Another .25 should do it.\"\n\nmeanwhile real inflation is probably around 16% or so without the new equations. Jesus Christ", "score": 1, "replies": []}, {"body": "How can we get him to replace j pow?", "score": 1, "replies": []}, {"body": "Quick hire him to play jpowell in the next financial collapse movie.", "score": 1, "replies": []}, {"body": "And that kids, is why you don't use a CO2 fire extinguisher in a solid material fire. For this one, Lok for a water, or at least, quimical polder extinguisher", "score": 1, "replies": []}, {"body": "Water bro 😎", "score": 1, "replies": []}, {"body": "Is there a country I. Africa that’s not scammy?", "score": 1, "replies": []}, {"body": "Oxygen?? (Edit: oh thank god)", "score": 1, "replies": []}]}
