{"title": "I'm Back. $47k in DIS Jan 120 Calls. This is how you WSB.", "selftext": "", "id": "3s56iv", "created_utc": 1447083589.0, "score": 73, "upvote_ratio": 0.93, "num_comments": 110, "comments": [{"body": "[deleted]", "score": 23, "replies": [{"body": "rates are already priced in by now", "score": 10, "replies": [{"body": "So is Star Wars.", "score": 17, "replies": [{"body": "sure but...back in July it hit all time high of 122$...so we know that at the very least with star wars factored in it should be trading at 122$. what caused it to tank were bad ESPN numbers on that ER. Those numbers don't seem to be an issue anymore this ER. ", "score": 1, "replies": []}, {"body": "Partially, but it has a ways to go.  BTW there is much more in store for the Star Wars franchise post-\"Force Awakens\", including [many more movies](http://www.denofgeek.us/movies/star-wars/241723/full-star-wars-movie-release-calendar).", "score": 1, "replies": [{"body": "I'm going to go ahead and guess that the \"smart money\" already had alllllll this stuff in mind when they rolled the dice and moved their mice.  But hey, there's probably more money to be made.\n\nWish I'd never sold the Disney shares I bought 10 or so years ago...", "score": 7, "replies": [{"body": "I still have my Disney my grandma bought me as a Christmas present in 2001. I moved it to my name, but when they go their new stock managing company I couldn't resist register. Still haven't figured out how. Not selling anytime soon so not worried about it for now, but it'd be nice to be able to log in and check on it ", "score": 1, "replies": [{"body": "As I said back when I bought it (but didn't listen to my own advice): \"You can't put a price on the imagination of the world's youth\".", "score": 2, "replies": []}]}]}]}]}]}, {"body": "The biggest risk I can see on the short term horizon is that Episode 7 turns into Episode 1 (ESPN is the biggest long term risk).  \n\nLots of speculation Ep 1 would kill it, but a big let down in the box office (only 1bn in global revs http://www.the-numbers.com/movie/Star-Wars-Ep-I-The-Phantom-Menace#tab=summary).  JJ Abrams is the man, so expectations are also high.  ", "score": 2, "replies": []}, {"body": "December also means Xmas and strong seasonality.  It's traditionally one of the best months to be in the market.  November is a great one too. March - April are the only better months.  Perfect time to raise rates without causing much, if any, pain.  Rates are already priced in, so what happens if economic news gets gloomy?  Either way, there is a positive and a negative spin on either outcome.  One side of the coin is the economy.  The other side is interest rates.  As long as we have a sensible rate raise, we will be fine.", "score": 2, "replies": []}, {"body": "Both of those are already baked into the market. 25 points isn't shit. Don't be surprised if the market rally's off DEC rate hikes  ", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "It's an option with an expiration date though..", "score": 5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Good point.  I keep forgetting there's guys on this sub, unlike myself, that can afford exercising options lol.", "score": 5, "replies": []}, {"body": "Looks better than my Jan LLY right now ", "score": 2, "replies": []}, {"body": "DIS and HAS are the only greens on my list.  I wonder why??  =)  HAS should also see some benefit from Star Wars... though their toy deal only goes through 2020 as I recall, so DIS is certainly the better buy for typical investors.", "score": 2, "replies": []}]}]}]}, {"body": "I doubt they're going to raise rates. The news was alright, but not enough IMO to raise rates. The news before it wasn't very good and the global economy is expected to do worst than projected.\n\nFurthermore small businesses are still in a decline and the housing market is a little shaky as it is. ", "score": -1, "replies": [{"body": "I'll need to disagree with you there.  Jobs are the primary driver, and they were very strong.  In fact there is some slight worry that they may even need to raise them more than 25bp, which I don't see happening myself.\n\nHousing is very strong now.  My main home is up $380k since buying in Nov 2010.", "score": 1, "replies": []}]}, {"body": "Lol, yep, grats on being the biggest idiot I've seen in a while. (Less the guy who was saying the S&P is gong to 2200 this year.)", "score": -1, "replies": [{"body": "2200???  What retard said that?\n\nIt's going to 2250. ", "score": 1, "replies": []}]}]}, {"body": "RemindMe! 67 days \"Did this guy lose all his money\"", "score": 6, "replies": [{"body": "Messaging you on [**2016-01-15 21:05:22 UTC**](http://www.wolframalpha.com/input/?i=2016-01-15 21:05:22 UTC To Local Time) to remind you of [**this.**](https://www.reddit.com/r/wallstreetbets/comments/3s56iv/im_back_47k_in_dis_jan_120_calls_this_is_how_you/cwuix61)\n\n[**CLICK THIS LINK**](http://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/wallstreetbets/comments/3s56iv/im_back_47k_in_dis_jan_120_calls_this_is_how_you/cwuix61]%0A%0ARemindMe!  67 days ) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! cwuixob)\n\n_____\n\n|[^([FAQs])](http://www.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^([Custom])](http://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^([Your Reminders])](http://www.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^([Feedback])](http://www.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^([Code])](https://github.com/SIlver--/remindmebot-reddit)\n|-|-|-|-|-|", "score": 2, "replies": []}]}, {"body": "That's a ton of potential downside.  \n\nWhere are your stop losses (lol)?", "score": 3, "replies": [{"body": "I don't do stop losses... especially with options.  Yes, I can easily lose all 47k.  I can also easily gain 100k+.", "score": 5, "replies": [{"body": "Lost a ton of $ this way.  Don't be an idiot", "score": 13, "replies": [{"body": "I've made and lost millions this way.  No worries.", "score": 4, "replies": [{"body": "Teach me your ways", "score": 1, "replies": [{"body": "Especially the \"made\" part.", "score": 15, "replies": []}]}, {"body": "Are traders taxed on the gains even if they lose them later on?", "score": 1, "replies": [{"body": "Depends when you sell as well as whether you've elected to have mark-to-market accounting, and whether you file as a trader.  Generally speaking, taxes are paid on your net gains for the tax year, so if I say sold my positions (or marked to market) this year, and lost the same amount of money the same year, then I have zero gains and zero taxes.  If, however, I make the gains this year then loss them next year, I will pay taxes this year and need to get them back next year IF I have trader status.  If I do not have trader status then you're limited to 1,500-3,000 in losses going against income... unless I gain more later via cap gains, then I can use the losses against those gains. ", "score": 2, "replies": []}]}, {"body": "You should never put more than 10% of your account in one trade. You're using your whole account as play money, you're an idiot.", "score": 1, "replies": [{"body": "Once upon a time I also tuned $4,500 into $2.25 million in just over a year.  Risky, yes... but then I also own homes and businesses, and the gains can be had for those willing to take the risks.", "score": 4, "replies": [{"body": "Gains can also be had by being responsible, and picking the right levels. \n\nUnfortunately, you've got terrible timing on this trade. Even with a good risk tolerance, you've bought calls at the exact time that institutional money is starting to flow out of this market. They are selling now. While DIS could possibly go to that level by Jan, it isn't going to that level from where it is now. It would first correct. (Leaving the potential to have made those Calls at a much cheaper premium price.)\n\nDIS is extremely overbought, and so it the entire index. We should see a 3-5% correction before any resuming up move.\n\nJesse Livermore went bankrupt 4 times... He also had $100 million in his account. \n\nThe real question is, over your lifetime, what have you won and lost in the market? Making $2 million from 4K doesn't mean anything if you lost it back. It also reinforces bad habits. You're going to actually think you are a good trader, until the point where you blow up your account. \n\nAs Jesse Livermore is the perfect example, risk is not your friend in the long term. ", "score": 2, "replies": [{"body": ">Gains can also be had by being responsible, and picking the right levels.\n\nHa GAY!", "score": 3, "replies": []}, {"body": "> risk is not your friend in the long term\n\nThis part is true.  This is just a jump start... I don't intend to stay high risk.\n\nI disagree with everything else you said.  So far my timing was perfectly fine.  Up $3,200 the first day.  If it drops back 2-3%, that is perfectly fine and reasonable, but I doubt it happens. \n\nInstitutions selling??  LOL.  Now you're just making shit up and self-imagining things.  That is far from reality.  But keep on imagining things while I make real money.  =)", "score": 1, "replies": [{"body": "Price will tell who wins this argument. :) I say we hit at least SPY 205 before going higher, and my actual money is on us hitting lower. (195, 200)", "score": 2, "replies": [{"body": "205?  O.o  I think you mean 105?  Yea, that's not gonna happen.  Time will tell.  ;P", "score": 1, "replies": [{"body": "I'm talking SPY, the etf that tracks the S&P.", "score": 2, "replies": [{"body": "Well in that case, yea, 205 is possible, though if it does go that low we will see some very strong days post-rate increase. ", "score": 1, "replies": [{"body": "The rate increase? That is coming in 2016 breh.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I once heard it like this:  \"Buy stocks to get rich, buy bonds to stay rich\". \n\nNot sure it still holds in this bond environment, but I always liked that one.", "score": 1, "replies": []}]}, {"body": "How did you leverage that $4.2k into $2.25m?", "score": 1, "replies": [{"body": "Swing trading stocks and stock options... same thing I'm doing now.  This was during the net bubble though, and I ended up losing most of it.  Was still up some 5,000% though, so it was all worth it still. ", "score": 3, "replies": []}, {"body": "options", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Vega? More like Vegas.", "score": 3, "replies": []}, {"body": "Funny I just sold my Jan 115 calls today for a 50% profit. I might buy Jan 110 puts today and sell them on a dip later this month. ", "score": 5, "replies": [{"body": "Should have rode it out... definitely going higher in the coming month+.  Puts are pure foolishness here.", "score": 2, "replies": [{"body": "I would disgaree. I already bought 110 puts at 116 underlying. I personally think the market is too volatile and predicting something as big as Star Wars is going to invite lots of swing traders looking to short their minds out. I fully expect it to near 120ish near end of December, but until then it's going to be a mini rollercoaster", "score": 4, "replies": [{"body": "So your reasoning is that swing traders (which I am one BTW) will actually short this thing to shreds?  Oh my... you have much to learn.  WHY would a swing trader short this when Star Wars is still over a month away?  That would be pure foolishness and fighting against a swarm of Jack and Janes buying this in anticipation of Star Wars earnings and all the other earnings streams it provides going forward.  O.o  I do hope you sell those Puts soon... you will undoubtedly lose money holding those for too long.  Have you been shopping lately?  Star Wars merchandise EVERYWHERE.", "score": 4, "replies": [{"body": "People already expect Star Wars to kill it. Do you really think it hasn't been, at least somewhat, accounted for? If it was truly so certain to shoot prices up, why haven't investors bought in at this supposed discount? \n\nFrom now until Star Wars I expect Disney to touch near 110 again. Probably later this month considering China, oil, and the Fed meeting will undoubtedly cause panic.", "score": 3, "replies": [{"body": "China is in a good position here... not something to be expecting panic from.  Oil is already down big... no panic there either, and in fact a good thing for every other company as gas prices are lower.  Fed meeting is already priced in as of today... and we're talking very gradual increases, nothing sudden.\n\nOf course Star Wars is partly accounted for... but there's still a lot of room left.  I see 130-135+ easily.", "score": 2, "replies": [{"body": "I see 120+ in January to February. Until then we'll see if my puts make money or not. I was right about my Jan 115 calls almost 2 months ago and people weren't even hyped back then. And anyway, I only put $1500 into my 110 puts. These days I don't gamble as much because success has been inflating my ego a bit. ", "score": 1, "replies": [{"body": "You opened the calls 2 months ago and only made 50%?  Should be up 100% or so from back then.  120's were a bit far OTM while the underlying was at 100-105 too.", "score": 1, "replies": [{"body": "This was before Black Monday v2. Bad timing, but I held because I knew it had a good chance of profiting. ", "score": 1, "replies": [{"body": "Ahh, well good on you for holding. ", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Shit I had thought about buying puts before the ER on the assumption that there would be another selloff due to cable losses to streaming services.\n\nGlad I didn't do that!", "score": 2, "replies": [{"body": "Cable isnt really losing much to streaming services...they require an internet connection! They lose 80k cable subscribers and add 200k internet subscribers", "score": 2, "replies": [{"body": "Agreed, but that's kind of a separate discussion. Last quarter there was a pretty big selloff of the media guys because they were losing viewers to NFLX and the like. I figured with the ESPN (owned by Disney) restructuring announced a few weeks back they'd post another poor quarter and the market would have another quick selloff.\n\nLike I said ... glad I didn't act on it !!", "score": 1, "replies": []}, {"body": "I seriously doubt that. Most \"cord cutters ” already have broadband internet... So they are losing big. That's why they're all messing with data caps. To reclaim the lost profit. Comcast wants a 250 limit I almost hit that and I don't stream much. A family of 4 could use 1tb a month easy... ", "score": 1, "replies": [{"body": "Right, you cant just cut the cord and not have internet was my point. Like you said these companies will all figure out a way to make it work.", "score": 1, "replies": []}, {"body": "Also, off the top of my head those numbers were accurate. I believe it was for Comcast but I could be wrong.", "score": 1, "replies": []}]}]}, {"body": "I was waiting until post-ER just to make sure I wasn't dinged with any surprises like they had in August.  The only thing that can put some pressure on it here is the overall market with interest rates going up, but I don't see it lasting long. It is quite resilient today, and should continue to be.", "score": 2, "replies": []}]}, {"body": "Considering riding your yacht with a 1k bet too ", "score": 2, "replies": [{"body": "What do I have to lose other than another grand (looking at you, SCTY...) ", "score": 1, "replies": []}]}, {"body": "http://imgur.com/4xXmFvS", "score": 2, "replies": []}, {"body": "I bought more. Lets ride.", "score": 2, "replies": [{"body": "Down on the NY attorney general suing some of their advertisers (fanduel.com, etc).  No worries here.  Still more than a month until Star Wars.  That's a lot of upside potential just on that alone.  Shanghai Disney Resort opening in early 2016 too.", "score": 2, "replies": []}]}, {"body": "So far so good...", "score": 2, "replies": [{"body": "Kicking myself for getting feared out.  I'm just glad I took my SPY put loss quickly... yowsers.  I actually loaded up on Nov 27 DIS call weeklies near the close, after owning Dec 115's the past couple days (closed those out for the weeklies because I'm crazy YOLO and pissed about the damn SPY Puts.  O.o ).", "score": 1, "replies": [{"body": "To be honest, when you were talking about your years of experience in high risk trading, the last thing I expected was for someone like that to jump ship after a few days down. We had a longer time horizon, as well as a catalyst to hold out for (episode 7). \n\nOverall though, there's still a lot gains to be had. Star Wars is undervalued, and the real \"priced-in\" will happen over the next few months. \n\nYou would have been up over 20k now right? (Not rubbing it in)", "score": 1, "replies": [{"body": "Yep.  =/  I just really didn't expect the overall market to turn around as fast as it did.  I thought the interest rate risk was too high and nobody would buy in when we have that on the horizon, but goodness was I wrong!  Anyway, now long 390 Nov 27th 121 Calls.  I think it's gonna be a crazy week for me.  O.O", "score": 2, "replies": [{"body": "I think I'm going to cash out on opening. Buy back in after this fed shit is sorted. Ride it up a bit more while Episode 7 is in play. Feb calls  most likely.", "score": 1, "replies": []}, {"body": "Are you still holding those DIS calls?", "score": 1, "replies": []}]}]}]}]}, {"body": "I really need to learn this options wizardry.", "score": 1, "replies": [{"body": "This is more towards gambling.", "score": 19, "replies": [{"body": "Yep, it is indeed \"gambling\" of sorts, and I'm fine with that.  =)", "score": 6, "replies": [{"body": ":|", "score": 1, "replies": [{"body": "Everything in life is gambling", "score": 5, "replies": []}]}]}]}]}, {"body": "Go DIS go, I'm rooting for ya!\n\nIf it helps any I'm going to go see star wars when it comes out and my daughter wants a bunch of frozen toys for Christmas. ", "score": 1, "replies": []}, {"body": "It ain't a yolo when you know damn well that DIS will explode due to those Star Wars sales.", "score": 1, "replies": []}, {"body": "Target: 130+ or basically a 300%+ gain.", "score": 1, "replies": [{"body": "I wish there were calls for feb, leading up to earnings.", "score": 1, "replies": []}]}, {"body": "Lol, I'm short DIS.", "score": 1, "replies": []}, {"body": "Good luck bro. It looks ugly the next coming months. yolo", "score": 1, "replies": []}, {"body": "wow if disney moves +/- 1 point, you're swing is going to be $7k in options value. True yolo", "score": 1, "replies": []}, {"body": "FYI, DIS made a high at $117 and reversed, and now will come the price were you could have gotten it cheaper. First target $113, 2nd target $107-108. Then if still looking down, test $103, and $100.", "score": 1, "replies": [{"body": "LOL, not gonna happen.  Just a temporary blip on a very bad market day.", "score": 1, "replies": [{"body": "So long as you've been warned, I won't feel bad about the result.", "score": 1, "replies": [{"body": "*yawn*  Zero worries here.", "score": 1, "replies": []}]}]}, {"body": "115 trend support held up beautifully today.  I doubt it goes below that, even though a couple Fast Money bozos said it was a sell after the close.  Either way, it will be at 118+ next week, and BTW I'm still in the green, all while the overall market has imploded.", "score": 1, "replies": []}, {"body": "why are you so worried about his money? I don't get it. The man made a bet. It's either black or white. We'll find out soon enough.", "score": 1, "replies": [{"body": "Because everyone told him he is wrong, and he still thinks he is right. In fact, he pretty much bought the top. Pretty classic mistake, the sort of thing someone who has $500 in their account would do, much less $50,000.00. Buying an overbought stock when it is already up nearly 20%, and then thinking you're smart if you make money, instead of realizing it shouldn't be touched.", "score": 1, "replies": [{"body": "but it's his money...why are you so worried about his money?", "score": 1, "replies": [{"body": "I'm not actually worried, its a penis contest, and I want to have the bigger dick.\n", "score": 1, "replies": [{"body": "you seem really worried about his money...more so than he is. Are you his wife? why do you care what he does with it? oh, you're just salty....now i get it.", "score": 1, "replies": []}]}]}]}]}, {"body": "Welp, it went below my 115 trend support, so I sold and decided to go all in on SPY Puts (Dec 4th weeklies, 203 strike).  No point fighting against the Fed... ", "score": 1, "replies": [{"body": "daaamn! all out?", "score": 1, "replies": [{"body": "For now.  =)", "score": 1, "replies": [{"body": "I'm holding through, most likely...", "score": 1, "replies": [{"body": "You should be fine.", "score": 1, "replies": [{"body": "Star Wars is under-valued, no doubts about it. Episode 7 is going to reevaluate everything.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "1/15/16 DIS 120 calls: $1.30\n\nyolo\n\nwonder if this guy did this on margin", "score": 1, "replies": []}, {"body": "noiceeeeee", "score": 1, "replies": []}, {"body": "I'm right there with ya (almost). $6k in DIS @ $125 Jan.\n\nStar Wars isn't priced in as much as it should be. People have their doubts. They are soooooooo wrong.", "score": 1, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Unless they've already seen it. Do yourself a favor, and buy some calls now, more later for dips.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I definitely agree with ya there. With these options though, we have 2 months to hit that strike. Realistically need to hit it even sooner over risk from that theta.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Kind of looks that way, doesn't it? Investors (and the people in general) have underestimated Lucasfilm's 2015 approach to the Star Wars IP. All will be revealed soon. The beginning is nearing the end, and I truly believe this is the last chance to catch the train for a while. ", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Do it.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Sell the 125 calls against it you fucking duchebag.  Brings your basis down to 1.35", "score": 0, "replies": [{"body": "Why would I do that when I think it's going to 130-135?  A 120/125 spread will earn less than merely holding the 120's.  I could sell the 130's or 135's, but they only go for pennies and if I find myself wanting to sell earlier on early gains, I'm losing out as those will be up in value from what I sold them at.  Got it douchebag?  I've been playing options since you were still in diapers.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": -10, "replies": [{"body": "Someone ban this idiot. He invested 47k in Jan calls with the intent to hold them for longer than a day you fucktard", "score": 9, "replies": []}, {"body": "http://i.imgur.com/NYOyGqw.gif", "score": 2, "replies": []}]}]}
