{"title": "TSM, INTC or Samsung electronics?", "selftext": "Which one between TSM, INTC or Samsung electronics could be the better investment in semiconductors? Currently, TSM is the leader in the sector which a market share of 80% and they announced an investment of 100 billion for increase their production capacity; I have read they invented a new nanochip and their know how give them an advantage of years compared to competitors; TSM stocks raised more than 1000% in the last 20 years. Intel and Samsung are investing in USA because they want to decrease their addiction of semiconductor from China. Which one of these can be a good long term investment?", "id": "njdkpf", "created_utc": 1621793839.0, "score": 149, "upvote_ratio": 0.94, "num_comments": 102, "comments": [{"body": "I think TSM is the clear winner of the three. Intel is finally losing market share in server and until they demonstrate that they can scale their current and next nodes I won’t buy. Their business is built to run on very high margins so a fab spinoff for them would be a disaster sign. The fact that they are buying wafer capacity from their only real rival is a bad look.", "score": 103, "replies": [{"body": "Don’t you think that the commercial war between USA and China (and problems between China and Taiwan government) could be dangerous for TSM development? I bought some TSM shares @112 $ , I know that is a risk but between these 3 companies I think TSM is at moment, and in the near future, the best choice.", "score": 22, "replies": [{"body": "They are expanding in the US where security concerns from China are less of a concern. China would be to be pretty brazen anyways to really invade Taiwan because world wide retaliation would likely follow. https://www.reuters.com/technology/chipmaker-tsmc-eyeing-expansion-planned-arizona-plant-sources-2021-05-04/", "score": 33, "replies": [{"body": "What would retaliation even look like at this stage of history? I couldn't see western states invading or otherwise engaging in serious hostilities with China in the event of an annexation of Taiwan", "score": 6, "replies": [{"body": "You’re assuming China can successfully invade Taiwan. To do a successful land invasion and occupation across the sea is a D-Day level event in terms of logistics and military capabilities, especially considering Taiwan’s entire military is specifically built around repelling an invasion across the Taiwan straight. And these days that’s especially not easy to do considering how far military tech has come. A handful of drones, well placed artillery, and something to launch torpedoes and missiles would be able to sink any ships that try to cross. \n\nAs if invasion wasn’t difficult enough, trying to do an occupation would certainly lead to almost the entire population unifying in resistance, probably along with the US, Japan, Australia, India, Western Europe, among many other countries. While if an invasion happens it’s not guaranteed to bring down unified international sanctions or counterattacks, that’s still too big of a risk for China to take on considering how integrated they still are in the global economy.", "score": 33, "replies": [{"body": "A modern day \"invasion\" is political meddling and getting corrupt and sympathetic politicians to sell out to erode sovereignty and liberties. It'll take time of course, but more than likely if it happens, It'll happen that way.", "score": 17, "replies": []}, {"body": "China controls some critical supply chains, including raw materials for most countries. Sanctions on China wont be a unified response as people predict.", "score": 7, "replies": []}, {"body": "The Taiwanese populace will not rebel as long as China is decent towards them it's nothing like America invading Iraq or Afghanistan. NaZi Germany was a able to occupy most of Europe without much problem.", "score": -1, "replies": []}]}, {"body": "Potential property seizures in the US alone would make them balk.", "score": 15, "replies": [{"body": "Lol that would be lit. I know the Canadians would get Down too", "score": 10, "replies": [{"body": "And the Ozzies", "score": 4, "replies": [{"body": "And all of Europe and the UK.", "score": 2, "replies": []}]}]}]}, {"body": "Immediate cessation of economic ties. China's economy would immediately go into a tail spin. China is just as reliant on the west and the west is on China. It's a common misconception that it's a one way relationship.", "score": 12, "replies": []}]}]}]}]}, {"body": "What? TSM does not have 80% market share lol. Its more like 56% Samsung has 18%", "score": 49, "replies": []}, {"body": "ASML \n\nOut of these three definitely TSM though", "score": 27, "replies": [{"body": "ASML isn’t a foundry like TSM, right? They give to other companies instruments to produce chip", "score": 12, "replies": [{"body": "They have an almost monopoly on the machines that produce chips. The companies you mentioned above have paid ASML billions for machines. You should check them out if you don’t know about them yet", "score": 15, "replies": [{"body": "you are saying that in any case ASML gain. It doesn’t matter, which one of the 3 companies, ASML win always. From October 2003 TSM stock has grown 1152%, ASML 2393% but will it be the same in the future? I put all my money on TSM, do I have to change an choice ASML?", "score": 4, "replies": [{"body": "Obviously your own choice, but you should atleast read into ASML. It will continue growing most likely", "score": 8, "replies": []}, {"body": "ASML and LRCX", "score": 6, "replies": [{"body": "No love for ENTG?", "score": 1, "replies": []}]}]}]}, {"body": "ASML is an optics/ laser manufacturer. I came here to say the same thing. \n\nASML is the ONLY company capable of delivering EUV right now. Any company attacking a sub-7nm node HAS to buy EUV. \n\nYou could go up a level too. ASML buys the “lenses” from the only capable manufacturer (Carl Zeiss). Even if another photolithography company managed to get an EUV system off the ground they’d likely have to buy from Zeiss as well...", "score": 2, "replies": [{"body": "Let's go deeper, what's the only one company that can make whatever Zeiss needs?", "score": 3, "replies": [{"body": "Sorry can’t help there. \n\nThey do have their toes in semiconductors (taking a pounding during supply chain disruption) and also medicine...", "score": 1, "replies": []}]}, {"body": "Oh dang. So ASML could be a key player in optical links replacing RF links for inter-satellite comms. Obviously not so much ground to space links since clouds are an issue.", "score": 1, "replies": []}]}]}, {"body": "Is it me or do they seem way overpriced? TSM seems maybe a little overpriced against Samsung & INTC though not extremely.\n\nI agree that ASML absolutely deserves watching but their price has exploded over the past year and they're at a new ATH every week. Admittedly I'm just glancing at their multiples but it seems worth getting at, idk, sub 400?", "score": 3, "replies": []}]}, {"body": "[this comment about TSM says everything ](https://www.reddit.com/r/stocks/comments/mlbjdv/what_are_your_highest_conviction_picks/gtkp2ft?utm_medium=android_app&utm_source=share&context=3)", "score": 23, "replies": [{"body": "This applies if you're looking only at the semiconductor foundry industry/market. However samsung is not a bad choice as a whole just due to its massive size and diversification. And their foundry effectively has a captive customer in the form of their mobile division (exynos). Also qualcomm would rather get their chips manufactured at samsung rather than TSMC because Apple has priority at TSMC.", "score": 5, "replies": []}]}, {"body": "Applied Materials", "score": 9, "replies": [{"body": "I like them but I keep selling my positions because I have paper hands", "score": 4, "replies": []}]}, {"body": "TSM and Samsung are the winners, intel is losing market share and doesn't produce a lot of chips compared to the other two.\n\nThe real winner however is ASML, basically the only company which makes the equipment needed. ASML is an extremely safe stock, it certainly won't lose value due to political issues as long as the Netherlands and China remain in speaking terms", "score": 16, "replies": [{"body": "US is blocking ASML from sharing the important tech right now......gotta see how long that keeps up..... \n\nMaybe can consider, if China steals the tech from ASML, could they deploy/reverse engineer it without support from ASML?", "score": 1, "replies": []}, {"body": "Most people don't know that while ASML is the dominant player in semiconductor lithography equipment, its next biggest rival is Canon Lithography -- which is at a much more reasonable price point, and holds a diversified portfolio (as well as generating more revenues.)\n\nCanon is the darkhorse pick, and has been developing Nanoimprint Lithography (NIL) as a lower cost competitor to ASML's expensive EUV (Extreme UltraViolet) lithography.", "score": 1, "replies": []}]}, {"body": "Why is everyone sleeping on UMC", "score": 7, "replies": [{"body": "Do you know ow why they have been doing so bad lately,  even compared to other semis? For example, -10% in 1m compared to qcom's -3% and Tsm -4.5%?\n\nThey also have probably the lowest pe in the industry 15.5 Ttm as compared with qcom's 19 and Tsm's 30.", "score": 2, "replies": []}]}, {"body": "I bought TSM and NVDA late last year and wrote about why [here](https://jesbaek.com/2021/01/06/the-arm-powered-revolution-and-why-you-should-invest-in-it/)\n\nThen I bought some more TSM in March and went in depth one the shortage of you're interested in that as well. [Here](https://jesbaek.com/2021/04/27/semiconductor-situation/).", "score": 6, "replies": [{"body": "I was so tempted to invest in Xiaomi a few months ago. Chickened out. Now it's forming cup & handle.", "score": 2, "replies": [{"body": "I just wrote an entire post on them. I'm doubling down. Love what they are doing right now.", "score": 1, "replies": []}]}]}, {"body": "I like Intel, people have been saying Intel is about to collapse for a couple of years now but they have done relatively well for themselves. More or less from my perspective we are in a situation where demand is outpacing supply and that will probably stay the case for a few years. If Intel is able to deliver on their 7nm node in 2023 and they do okish with their GPUs I will be extatic about being able to buy Intel at their current price point.", "score": 11, "replies": []}, {"body": "Try ASX, low PE and price already suffered a lot, I see only upside from here.", "score": 5, "replies": []}, {"body": "LRCX, AMAT, ASML, KLAC. \n\nBuy the companies selling the shovels, not the ones digging for gold.", "score": 5, "replies": []}, {"body": "SMH", "score": 10, "replies": []}, {"body": "TSM for the win!!! Intc really wasted a lot of time for catching up.", "score": 7, "replies": [{"body": "Otellini really fucked Intel.", "score": 1, "replies": []}]}, {"body": "I'm bullish on TSM and plan to buy more. I keep wondering why the experts are currently rating this as avoid. They're reasonably priced for p/e altho p/s is a bit wonky.", "score": 3, "replies": []}, {"body": "TSM is the best one long term in terms of fundamental picture. I’d add LRCX and ASML as long term holds in the semiconductor industry.\n\nINTC is more of a value play at the moment due to low P/E ratio and solid dividend but other than that the company is facing tough competition from AMD and NVDA.", "score": 3, "replies": []}, {"body": "Not sure I would invest in any of them in the near term. TSMC will be undergoing big spending to expand production.  INTC is just a dog that doesn’t hunt any more.   They really ticked off a lot of people during the the growth of the PC and now people still do anything possible to avoid them hence the growth in other processors for every new industry and never from intel.  Just don’t seem them growing.  Samsung is tough to see much growth there either.   Sure one segment might go but another will hurt it.    Any way my 2cents and 90 years of inflation might get you kicked in the face.", "score": 3, "replies": []}, {"body": "AMD maybe idk", "score": 5, "replies": [{"body": "AMD has tons of room to grow. TSM is huge and has lower expectations on future growth.", "score": 6, "replies": []}, {"body": "AMD is going through an acquisition arbitrage at the moment, isn’t it?  Will probably spike after it’s completed.", "score": 3, "replies": [{"body": "Yeah with XLNX but it’s happening in like September, it puts them in a really good position with the FPGA, desktop and server industry, I am very excited for the near future, once this chip shortage is over they will be able to supply all of the demand and they are going to start taking market share from intel and nvidia", "score": 3, "replies": []}]}]}, {"body": "there is a very good chance that Intel stock can outperform the other two simply because of their low valuation multiples because they aren't growing as fast, but it is very likely that things wont turn out as people are making it out to be.", "score": 5, "replies": []}, {"body": "Taiwan number one", "score": 5, "replies": [{"body": "and China is asshole", "score": 3, "replies": []}]}, {"body": "I hate all of these comments. Yes TSM has the large market share... but INTC is a BARGAIN right now. If you wanna cheer on the “winner” buy TSM, if you want to make money, buy INTC", "score": 8, "replies": [{"body": "Nah man tsm is going to a trillion market cap doesn’t matter; Roblox 420, too the moon. Sometimes this sub makes me want to Kill myself. With the amount of hype the have for TSM.", "score": -2, "replies": []}]}, {"body": "ASML, they win if any if them win.", "score": 4, "replies": []}, {"body": "From October 2003 TSM has grown 1152%, my only doubt it’s if is overvalued (I was burned with TSLA)", "score": 5, "replies": [{"body": "Maybe check the revenue vs TSLA. They are a lot more bound to reality. If they were trading at TSLA multiples, a TSM share would cost like 10k, lol", "score": 6, "replies": []}, {"body": "I am down on TSM but it's a long play for me so I don't care, I did average a lot but it's too big in relation to my whole portfolio to average down any more (currently 13%). Also I got into the crazy wagon just a couple of months ago so there's that.", "score": 1, "replies": []}]}, {"body": "LRCX", "score": 2, "replies": []}, {"body": "TXN", "score": 2, "replies": []}, {"body": "IBM and Cisco come onboard.", "score": 2, "replies": [{"body": "IBM while this foundry competition in their backyard heats up is enticing. The manufacturing IP companies have yet to see the competition for their IP heat up with it. I think they like intel’s foundry plans for keeping their revenue stream steady and I think together they are going to see significant return on next horizon in chip manufacturing and design tech together. Hope I’m right", "score": 1, "replies": []}]}, {"body": "Intel has serious culture issues and that chases away a lot of good talent, and thus affects their production capabilities. Im just gonna leave it there..", "score": 1, "replies": [{"body": "Can I ask what made you say this? I’m inclined to agree based on the fact the last CEO was a career finance guy after that one moron was fired for ~~dumping stock~~ an internal relationship years before...", "score": 2, "replies": []}, {"body": "Do you now this first hand? Just wondering where you’re coming from.  Thought of investing in intc stock… price is getting more attractive, but if serious issues lie underneath it’s probably a pass.", "score": 1, "replies": [{"body": "I live in Portland, and everyone I know who works at intel loves it there. So take that as you will.", "score": 2, "replies": [{"body": "Ok thanks for the info 👌", "score": 1, "replies": []}]}]}]}, {"body": "Of these 3 TSM for sure but plenty of better names to play the space imo Amd lrcx klic amd  qcom", "score": 1, "replies": []}, {"body": "Samsung\nI get to see it 1st hand. I deal with Samsung and they have a lot more to offer than just semi conductor. Consumer goods and electronics and with housing boom, Appliances..........  \nSamsung has there own products. What does intl have? Tsm?", "score": -1, "replies": [{"body": "I believe there are two different Samsungs, owned by two brothers, who squabble a lot. Interestingly the president (former president) Lee Jae-yong started a prison sentence for some crime or another. By the way, most of South Korea's former presidents have either been imprisoned or (in one case) hounded to suicide.", "score": 1, "replies": []}]}, {"body": "Samsung because they also make batteries.", "score": -3, "replies": [{"body": "For batteries, they have another company. Check Samsung Sdi", "score": 7, "replies": []}]}, {"body": "I wouldn't recommend buying shares in any of these companies now, and if you do you should sell them before the end of the year. With all this government stimulus for semiconductor manufacturing floating around there's a supply glut on the horizon. And when that happens all of them will suffer losses. Although TSMC will always come out on top due to it's massive economies of scale. Their reserve prices are so low due to this that TSMC can go through supply gluts breaking even while their competition is hemorrhaging cash.", "score": -7, "replies": [{"body": "supply gut, good one", "score": 1, "replies": []}]}, {"body": "SMH", "score": 1, "replies": []}, {"body": "All of them split", "score": 1, "replies": []}, {"body": "TSM.", "score": 1, "replies": []}, {"body": "I’ve been holding TSM for a while now, I’d go with long-term", "score": 1, "replies": []}, {"body": "TSM! Why? Cause they killing the competition", "score": 1, "replies": [{"body": "What competition?", "score": 2, "replies": [{"body": "True", "score": 1, "replies": []}]}]}, {"body": "You have ASML, Besi and ASM international that produce nearly all the machines needed to manufacture semiconductors. All listed on the Amsterdam stock exchange. Personally in ASML for a long time but am weary to just recommend them because the price has gone up a lot the past few quarters", "score": 1, "replies": []}, {"body": "TSM all the way", "score": 1, "replies": []}, {"body": "TSM.", "score": 1, "replies": []}, {"body": "TSM!  TSM!  TSM!", "score": 1, "replies": []}, {"body": "You are looking at three very different companies though. First is a contract manufacturer for most part, but the biggest in the world. Second is a product development company and a manufacturer, third is a vertical. I'll tell you this, whoever is the first to creak the stable 2nm tech, they will win the chip race. IBM, apparently, has a working model, but they're not a manufacturer of chips en large... They'll license it. Intel can't even get their 4nm right. Samsung only does chips to fit its internal needs. TSM will manufacture whatever it can license.", "score": 1, "replies": []}, {"body": "AVGO", "score": 1, "replies": []}, {"body": "Can’t go wrong with tsm, they are basically monopoly", "score": 1, "replies": []}, {"body": "TSM - easy, safe choice\n\nINTC - risky long term play for their comeback\n\nSamsung - you're buying the stock of that whole Samsung iirc, so not pure semiconductor play, too diversified imo.\n\nBut yeah, like some other comments have said, ASML might be the ultimate semiconductor stock", "score": 1, "replies": []}, {"body": "I personally hold tsm and amat as my chip shortage combo. If you want dividends then swap out amat for Lam or ASML.", "score": 1, "replies": []}, {"body": "If I had the money I would buy INTC.  They are an incredible value rn and pay a solid dividend imo.", "score": 1, "replies": []}, {"body": "RemindMe! 3 years", "score": 1, "replies": [{"body": "I will be messaging you in 3 years on [**2024-06-18 18:58:36 UTC**](http://www.wolframalpha.com/input/?i=2024-06-18%2018:58:36%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/njdkpf/tsm_intc_or_samsung_electronics/h28p0yb/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fnjdkpf%2Ftsm_intc_or_samsung_electronics%2Fh28p0yb%2F%5D%0A%0ARemindMe%21%202024-06-18%2018%3A58%3A36%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20njdkpf)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "!remindme 3 years", "score": 1, "replies": []}]}
