{"title": "Inflation is real, how to overcome it?", "selftext": "Housing all time high\n\nOil prices are rising\n\nLumber through the roof\n\nWarren Buffet admitted they are rising prices across the board and inflation is real\n\nSo how to overcome this and the effect it will have on the market?\n\nOne advisor suggests to buy REIT and other ways to buy property or commodities.  \n\nWhat's your take?", "id": "n4y48a", "created_utc": 1620162005.0, "score": 34, "upvote_ratio": 0.82, "num_comments": 94, "comments": [{"body": "Throughout most of history people turned to precious metals...\n\nGold and silver mining companies are sitting on a LOT of cash from last year’s overbuying", "score": 21, "replies": [{"body": "I just bought some KL today as a matter of fact.   \n\n\nGold has been on the climb last 5 years. Nobody buys on the drops and always on the upswings when it's too late.   \n\n\nLowe P/E  \nTons of cash  \nGold goes up during inflation  \nWhat's there not to love?", "score": 8, "replies": [{"body": "I personally like GDX and GLD. But I don’t think you can go wrong with just straight KL, GOLD, or AU. I think all of them are gonna do great", "score": 2, "replies": [{"body": "I just bought B2gold", "score": 2, "replies": []}]}]}]}, {"body": "When inflation is growing its best to have assets and investments. The worst thing to have is cash.", "score": 16, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "What are considered valuable goods/services? Like aapl? Or is that considered a luxury item and not so much a commodity", "score": 2, "replies": [{"body": "Like JNJ, household needs", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Well yes of course invest in others however —-if we’re talking about inflation- this stock is inflated at a much lesser degree than those listed companies. I find that while JNJ (or similar) does go up slower than the tech stocks, it is a stronghold in times of loss.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Gonna be honest... I feel like those three examples have more to do with demand than inflation. I don’t have a good suggestion, but don’t take those as inflation indicators. Check out CPI fluctuation.", "score": 29, "replies": [{"body": "This is my thoughts as well.", "score": 8, "replies": []}, {"body": "You think you can increase the money supply by 25% in a year and drop cash from helicopters to consumers and expect the value of the dollar to not change? It must have the same dilutive effect that increasing a corporation’s share count has on its stock price.", "score": 14, "replies": [{"body": "Depends on what people want to and can buy and what folks expectations of inflation.  The economy is unlikely to soak up all the money but will likely soak up more money than the alarmist are screaming about.", "score": 4, "replies": [{"body": "Prices are going up across the board. And not small increments, double-digit percentages. I’m not sure why everyone is so set on sticking their head in the sand on this. Probably because the Fed continues to pound the table saying it’s “transitory”. They don’t/can’t know that for sure. Their goal is to assuage fears in my opinion. But I digress, believe what you’d like but I’ll take my cues from hard evidence.", "score": 7, "replies": [{"body": "Lumber is up big but stumpage fees have seen only minor increases in comparison.  Most of the other examples in this thread are supply chain issues.  Price will solve the supply chain issues quickly and put downward pressure on inflation. A lot of money is still focused on a few industries and other industries will come back online and soak up a ton of money.", "score": 3, "replies": [{"body": "Speculation on other industries that will soak up the money?\n\nLumber is just making the most headlines. But costs across the board for many raw materials are up. Multi-industry impacting. Some is supply-chain, some demand, some both. But too much money to spend with not enough to buy creates inflation and that's exactly what we're seeing.", "score": 2, "replies": [{"body": "Lumber is up bc demand for housing with low interst rates and low amount of housing suppy. Same with alot of other housing /construction materials needed to build homes. Yes, inflation is side effect of low interest rates bc cheap money increases demand. This has been a concern for some years now...Its why you dont lower interest rates in a strong economy bc it gives GOvt very little room.", "score": 3, "replies": [{"body": "We pumped trillions into the economy though stimulus. Now, savings at all time high. What do people seem to want to buy? Homes. \n\nLumber is long overdue, specific to home demand, and unique IMO. Steel, aluminum, copper, corn, etc. are all other raw commodities that are substantially impactful and setting record highs this quarter.", "score": 1, "replies": []}]}, {"body": "Personal travel this year, business travel next year,  digital goods, eating places, in person events, elective healthcare and livery come to mind at typing speed. Long term deflationary trends continuing: alot of USD is held overseas and those dollars won't chase supply here, automation of clerical tasks and physical tasks, electronic devises getting more capable and cheaper, erosion of the employee/employor relationship.   Couple things that are baked in, high prices will fix supply issues and wrapping up foreign wars.", "score": 1, "replies": []}]}, {"body": "What are your thoughts on lumber prices moving forward?", "score": 1, "replies": [{"body": "Likely to go down soon since the US is finally willing to maybe negotiate a Softwood deal with Canada in good faith. We have the supply up here to meet demands for all of NA. But the US has always played tight with Lumber and Canada since we don't have private woodlots and it would cut into Private equity in the US.\n\nMy Canadian lumber stocks are moving fairly well this week.", "score": 1, "replies": []}, {"body": "After maybe a last gasped spike, Steadily lower than today's prices but elevated from precovid prices, barring a major hurricane.  I'd say convergence with stumpage fee increases over time as a base case.  Not seeing a demand shift for a while but mills will add more shifts, invest in capital improvements  and substitutes will emerge.  Today is the day to put your building materials in your garage on Craigslis", "score": 0, "replies": []}]}, {"body": "Just to be clear- this is purely opinion and speculation. You may very well be wrong about that.\n\nAnd it’s not just supply chain issues. Check comments from Buffett. Also, countless corporates have commented on rising input costs, most not linking it purely to supply chain issues.", "score": 1, "replies": []}]}]}]}, {"body": "depends on where the money goes. Give 25% more money to billionaires and they just blow it into equities since they can't increase their consumption and the velocity of money doesn't increase at all. Give the money to poor/lower income people and the increased demand can actually cause CPI inflation.\n\nSo the value of the dollar in the first situation won't change at all unless you want to buy equities. Whether or not the value of that dollar changes is highly dependent on where you plan to spend said dollar", "score": 1, "replies": [{"body": "Well guess where most of the money went? Lower income people...", "score": -1, "replies": [{"body": "that's not even close to being an accurate statement\n\nhttps://www.propublica.org/article/the-cares-act-sent-you-a-1-200-check-but-gave-millionaires-and-billionaires-far-more", "score": 1, "replies": []}]}]}]}, {"body": "The CPI is pure bullshit being manipulated by the govt. The have to keep it down to keep from having to raise indexed items like ss and pensions and having inflation go through the roof.  You seen house prices? Bought food lately?  Inflation is over the moon.", "score": 2, "replies": []}, {"body": "Lumber is more of a supply problem than a demand problem. Minor difference really, but the big issue is that a combination of Trump tariffs on Canadian lumber + shutting down a lot of mills (apparently they take forever to get going again) early into covid resulted in HUGE supply shocks that still haven't evened out. \n\nOf course this coincided with an increase in demand for lumber as you noted\n\nSo, minor discrepancies aside, we both agree on one fundamental thing- Lumber and lumber products are not materially more expensive to harvest/produce, there is just a supply/demand imbalance\n\nI would imagine it's much the same story with the other two, I just can't speak to them as confidently.", "score": 0, "replies": [{"body": "Disagree. My speculation is we will not get back to even double the standard trading range for lumber. Think minimum $800/mbf floor, IMO.", "score": 1, "replies": [{"body": "based on what? Did lumber become more expensive to grow/harvest? Did it get more expensive to mill? If so, how? Genuinely curious", "score": 1, "replies": []}, {"body": "based on what? Did lumber become more expensive to grow/harvest? Did it get more expensive to mill? If so, how? Genuinely curious", "score": 1, "replies": [{"body": "In a way - but not exactly. Combination of a few things: recent regulation by CA of reduced allowable cut, general conservatism of industry after 08 housing collapse, and bad bet by mills early covid to reduce production has surged lumber prices. \n\nIn short, while I’m not thrilled, it’s clear mills were able to sell lumber to lots of the same buyers in the $650-$950 range and deals still pencil. No other mass produced other structural options in this price range. So my expectation is we’ll see pullback once the crazy demand reduces, but won’t ever get back to the near the same floor.", "score": 1, "replies": [{"body": "I'm also betting on Biden rolling back the lumber tariffs. I'm honestly surprised he hasn't already done so", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Property reits will be a good play as there property portfolio value will go up as property  building costs are going up and reits own billions in property's \n\nFind intrinsic value stocks that sell products we use everyday\n\nBrk.b and psh are undervalued beasts that I own and an buying today\n\nCan't go wrong with commodities beans coffee gold silver Timber bullion mining imo", "score": 11, "replies": [{"body": "Reits are typically sensitive to interest rates so I'd be careful but these are likely better preforming in an moderate inflation than companies with huge profits far into the future.", "score": 5, "replies": [{"body": "Other thing about REITs is to check its mortgage exposure. Some REITs will have a component that buys long mortgages and borrows short term. If rates go up, those long mortgages are fixed term but the short loans get expensive real fast and the REIT can crater. It's easy to goose returns playing that game in a declining rate environment.", "score": 3, "replies": [{"body": "Agree important to know what your in.  Going to have a friend who is going to tell me \"I was here for the Walgreens triple nets not for the interest rate spreads\"", "score": 2, "replies": []}]}]}, {"body": "This except for the property part unless you're living in it", "score": 1, "replies": []}, {"body": "Horrible take, they will be pounded by high interest rates in case of inflation.\n\nAdditionally they might be forced to re-evaluate asset worth if real estate rockets, creating non-cash generating profits that need to be paid out as dividends. \n\n“Find intrinsic value” is like saying “do good stuff”. \n\nAll asset classes will be fucked. If anything you hedge with bear derivatives and go defensive ie utilities.", "score": 1, "replies": [{"body": "Derivatives like bonds stocks comoditys Futures & options and utilities is that your plan Buy the whole market 🤔\n\nYou will be better of finding a good quality reit that can easy pay there way and grow in the long turm like O  bnd  or pk or buy wood as Timber is a solid play at the moment imo \n\nI hope they do re avaluate all there property holdings if property prices rockets that will help to increase the stock price of the reit as reits own properties \n\n\"All asset classes will be fucked\"  \n\nthat's not true as real estate,  Commodities & foreign exchange can all do well in inflation times and the RE in reit stands for real estate lol \n\nI don't think you understand what intrinsic value is,  it's not help your grandma carrier her shopping bags home 😂\n\nI hope this helps you", "score": 0, "replies": [{"body": "\n\nA bear certificate or a sell option is not the whole market. A bond or a commodity is not a bear derivative. \n\nA REIT that has to reprice it’s assets will generate a P&L profit. 90% of that profit has to be paid as dividends. Problem is that there is zero free cash flow generated from that profit. Add increases interest rates as they are always heavily leveraged. \n\nYou see a problem here? I don’t think you do based on your recommendations. \n\nInflation is devastating for most REITs.", "score": 0, "replies": [{"body": "Benjamin Graham would’ve disagreed?", "score": 2, "replies": [{"body": "About what?", "score": 1, "replies": [{"body": "Your comment about REITs? Which I replied to.\n\nEdit: In The intelligent investor there is a chapter about inflation in which REITs are one of the recommended ways to hedge yourself. \nIt might be in the commentary of the chapter and thus not Graham himself but instead Jason Zweig. In whatever case he writes about property as a whole to be a good hedge if you extract the problems with valuation, maintenance etc. which you can forget about with a REIT.", "score": 2, "replies": [{"body": "Well, that would mostly hold true, but it is not a hedge.\n\nIt might be less bad than something else, but a hedge is a counter. \n\nAlso, if the company is forced to reevaluate their asset value as a result of inflation/house prices they will get in to serious trouble. They’re pretty much in the hands of the accountants. \n\nImagine yourself getting a goodwill profit of 20% extra and you have to pay 90% as per REIT regulations.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Buy TIPS. Treasury Inflation Protected Securities. They’re not 100% foolproof, but they’re about as close as you’ll get. \n\nAlso, you’re thinking of demand, not inflation.", "score": 7, "replies": [{"body": "Demand and inflation are closely linked too each other tho. Demand drives prices up. Inflation is calculated from prices.", "score": 3, "replies": [{"body": "Inflation is defined as a generalized and sustained increase in the general price index. Demand can increase the price of certain goods if supply cannot keep up, but this is a temporary phenomenon as the increase in these prices raises the incentives to produce these goods and reach equilibrium again. The only way for inflation to grow permanently is if the growth rate of money supply increases, which hasn't yet.", "score": 2, "replies": [{"body": "Yes but for some goods I think the prices will be elevated for quite some time. For example building a semiconductor factory costs billions and years to build. Companies aren't going to increase capacity if they think this high demand is only temporary. Then they would have a brand new factory in 2025 but no demand to produce chips.", "score": 1, "replies": [{"body": "I agree. But these sorts of price increases are unproblematic and sometimes even healthy for the economy. For inflation to occur these increases have to be sustained. I.e., something has to keep feeding them. One reason could be an upwards spiraling labor demand that pushes wages up with little control, which then feed price increases and so on. But due to the weakness of labor unions in the US that's an unlikely scenario.", "score": 1, "replies": []}]}]}]}]}, {"body": "Buy a house with a mortgage", "score": 5, "replies": []}, {"body": "REIT's have lowered their long term borrowing costs with historically low rates.  Property values will appreciate,  rents will inflate, and dividends are paying better than bonds.  I've been slowly rotating funds that are seeing all time highs into REIT funds.", "score": 3, "replies": [{"body": "Im keeping about 40% of my Bond Proxy portfolio in REITs and 60% in high cash flow dividend payers.\n\nIt seems to me that owning commodities, as apposed to futures, doesn’t make me money until maybe sometime in the future. Speculating and futures are a different thing. I can’t park a significant portion of my portfolio into assets that don’t grown most of the time. And, anything short of significant won’t make much of a difference.", "score": 1, "replies": []}]}, {"body": "People are saying we’re gonna face the 80’s type of inflation....who knows?", "score": 2, "replies": [{"body": "Priced in", "score": 1, "replies": [{"body": "Today was an example of exactly how it isn't priced in", "score": 0, "replies": []}]}, {"body": "inflation tanked in the 80s because Volcker came in as Fed Chair and crushed inflation of the 70s with higher rates", "score": 1, "replies": []}]}, {"body": "Ask Europe (specially Germany how to overcome it). That is the reason why in Europe are so afraid of the inflation because they know all the problems and inconvenients. In my opinion, the classic movement has been precious metals such as gold and silver but nowadays...", "score": 2, "replies": []}, {"body": "I bought cfp ifp at 16$ in November they are now worth over 32$ their cash on hand will be as big as their market cap by end of 2021. So quick answer is buy stock related to commodities.", "score": 4, "replies": []}, {"body": "Some guy said he was buying some Starbucks gift cards.. maybe have a winner then sell it later in the future", "score": 3, "replies": [{"body": "That guy is an idiot, doesn't understand inflation, and you shouldn't take any financial advice from them.\n\nI love when people do such blatantly dumb things because it's a sign you can ignore them about other stuff.", "score": 14, "replies": []}, {"body": "Starbucks gift cards are also affected by inflation...", "score": 7, "replies": [{"body": "Well technically not, but the items you would exchange them for are making it pointless.", "score": 7, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "$10 gift card is still $10. My point was they would bump up the price of a coffee making you get less for your card.", "score": 2, "replies": []}]}]}]}, {"body": "I don’t understand this. Inflation means goods increase in price. What good would a dollar denominated gift card do if Starbucks prices increase?", "score": 4, "replies": [{"body": "This is why I’m stockpiling fully-stamped coffee loyalty cards", "score": 6, "replies": []}]}]}, {"body": "Step 1 : Invest in Gold.\n\nStep 2: Watch the blatant Fraud on the Comex every-single-day. Today Janet Yellen said 'Interest rates should rise' just before gold was about to cross 1800. \n\nStep 3: Repeat Step 2", "score": 2, "replies": []}, {"body": "Inflation is real but everybody is forgetting what happens before inflation shows up widespread in 6 to 9 months.  First we get 3 to 6 months of insane spending.  And the fed gets time to deal with it so it's not a total disaster 9 to 12 months from now. \n\nThe only way to hedge against inflation is to diversify into multiple different areas and to sell off when one area gets pumped and buy the others when they get dumped. It's why you see treasury yields jump some days, or digicurrency or the gold mines. Everybody has their own way to hedge inflation, some just buy raw gold and hold it.  Real estate works when the markets not stupid high, good time to offload properties though. \n\nAnd to make sure you make money off the inflation spending before the inflation drops.  Some of which has already occurred. \n\nGood luck out there, just remember above all else some inflation is healthy and historically inevitable, excessive inflation is disastrous. We dont know how close to the edge we are but it's a ways away and theres lots of market mechanisms that can be used before raising interest rates.  Expect inflation but dont expect the sky to fall unless its paired with recession. The 29 stock market crash came after a decade of unchecked spending.  Covid spending was bad but it wasnt a world war bad.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Not really because to keep inflation down interest rates will be raised and whales will move their money out of the market", "score": 3, "replies": [{"body": "I don't think FED can raise the rate anytime soon\n\nwho's got balls to pull that trigger? Janet? JPOW? I doubt it", "score": 1, "replies": []}]}]}, {"body": "Equities!  No need to run to commodities or real estate.  Companies will perform fine during periods of modest inflation ... i.e. the most likely future.", "score": 1, "replies": []}, {"body": "Buy foreign stocks", "score": 0, "replies": [{"body": "If inflation is a key concern then foreign countries will break two ways those already overbought and those you will worry more about inflation than the USA.  Two exceptions would be 🇸🇦 and 🇯🇵 and I'm uncomfortable with the first due to governance and the ladder due to anemic returns.", "score": 1, "replies": []}]}, {"body": "Lumber will catch up. Some of this is inability for factories to produce a product.", "score": 1, "replies": []}, {"body": "Most of these prices have to do with increasing demand and supply constraints", "score": 1, "replies": []}, {"body": "Stocks fair quite well in periods of high inflation according to a lot of studies.", "score": 1, "replies": []}, {"body": "Buy on margin or leaps on assets...\n\n\nAlso have a mortgage, if inflation skyrockets you can buy back the mortgage at a later date by selling a beer to the neighbourhood tramp burning dollars to keep warm in the winter.\n\nBundles of 1000$ bills take good fuel for a fire when the hyperinflation hits.", "score": 1, "replies": []}, {"body": "Sometimes I think what if they start to mine minerals  on asteroids in the near future and let them crash in some \"gentle\" manner in the dessert or something.\n\nHow would that fuck up gold, silver etc etc and destroy stock market.", "score": 1, "replies": []}, {"body": "INFL etf....", "score": 1, "replies": []}, {"body": "Gold.", "score": 1, "replies": []}, {"body": "They control inflation by raising interest rates. Banks make money on the spread. Buy banks. The rich hedge against inflation by buying gold and precious metals. Buy miners that pay a dividend. Homes increase in value with inflation. Buy home builders and reits that rent.", "score": 1, "replies": []}, {"body": "Pokemon cards ftw", "score": 1, "replies": []}, {"body": "I could be right, could be wrong or events could move so fast that we won't find out.", "score": 1, "replies": []}]}
{"title": "McDonalds Stock", "selftext": "I've been wondering why McDonalds stock doesn't get more love. I don't hear or read much about it in any of the forums. They offer what I call a \"recession resistant\" product (i.e. Dollar Menu), 2.21% dividend yield, & they're one of the largest real estate owners in the world. They've been around forever and have had great growth over the last 3 years. Despite the country becoming more health conscious.  \n\n&#x200B;\n\nPersonally, I like that stock a lot better for a long term buy and hold than say, Coca-Cola \n\n&#x200B;\n\nThoughts?", "id": "n4zfsc", "created_utc": 1620165315.0, "score": 31, "upvote_ratio": 0.63, "num_comments": 95, "comments": [{"body": "It’s as priced-in as it can be. What’s the upside? Are McDonald’s going to suddenly double their profit margin? Are they going to do some insane M&A activity? If not, it’s a snooze boomer stock. \n\nAlso long term buy and hold? Please go back to /r/stocks , this is a casino with a 4 drink minimum.\n\nEdit - I don’t know what the strange awards do, but thanks!", "score": 236, "replies": [{"body": "[deleted]", "score": 51, "replies": []}, {"body": "It was the 5th drink that caused me to think about McDonalds", "score": 50, "replies": [{"body": "Never trade hungry.\n\nI don’t mean eat, I mean just take adderall.\n\nEdit - microdosing is for people that cannot withstand Cramer reaching through their screens, dripping the fiery ichor of capitalism from his fifty sightless eye sockets, screaming that G̫̭̭̳̹ͪ̓͋̍͐̂͘o͓͍̤͕͙ͣl̷̲̰̥̝d̡̫͐̽̐̒̽ ̺̝̫̳͢ͅf͓̲̗u̯͚͈̫̲̹̍ͮ̃̈̾͡t͈ủ̙̘͈͉̞ͤr̦̺̲͎͐̍̃e̹ͤs̳͚̦̳͇͛͂ͤ̓ are the best as smoke erupts from his antlers and your teeth melt.\n\nPlease spare me your weakness.", "score": 41, "replies": [{"body": "Shrooms are hip now I believe, on an empty stomach after five shots they work well!", "score": 9, "replies": [{"body": "Acids far better. 🤪", "score": 4, "replies": [{"body": "Microdosing all week long is the way.", "score": 4, "replies": [{"body": "I hear you get real effects if you microdose a lot at once", "score": 11, "replies": [{"body": "Jokes on you guys holding your breath until you pass out is free", "score": 1, "replies": []}]}, {"body": "Reminds me of that video of that dude that bought shrooms laced with cyanide and something else off the dark net.", "score": 2, "replies": [{"body": "Its a great video lol", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Best thing they have going is the real estate empire no one thinks about. They own property all over the world", "score": 7, "replies": []}, {"body": "They go to complete automation and increase profit exponentially", "score": 13, "replies": [{"body": "That's not how McDonald's makes money. They're a real estate company that advertises with food.", "score": 2, "replies": [{"body": "So you are telling me that getting rid of some 210,000 employees wouldn’t increase profits?", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 50, "replies": [{"body": "Dude this is a Wendy's restaurant", "score": 1, "replies": []}]}, {"body": "1. The company has been consistently underperforming. \n2. Unlike 20 years ago, there are more fast food chains popping up every year - meaning they are losing market share \n3. They sold chipotle and other brands that they owned. There have been no news about new acquisition. \n4.Previously when the competition was not as strong McDonald’s made quite a bit of money through franchising but now they are losing Market share in that field too. \n5. Last but not the least , the damn ice cream machine is always broke. There was a good video about why it’s always broke( McDonald’s has a partnership with the manufacturer of the ice cream machine , the manufacturers make tons of money on repairs- it’s a primary source of income for them) - this means, the franchise owners have to pay more to consistently get the ice cream machine fixed + customers are pissed.  \n\nSo there is no actual reason to show McDonald’s more love. They  should be acquiring competitors and building up their market share or launching new brands but they aren’t doing any of this. ( lessons of brand management to learn from P&G)", "score": 37, "replies": [{"body": "I will not invest a dollar in them until that damn ice cream machine works while I’m there", "score": 16, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "First of all, props for ethos. I can’t say how happy I am to see that word. Second, I feel in my ethos, them machines haven’t worked since Russian mafias ran Russia.", "score": 1, "replies": []}]}]}, {"body": "That part about the ice cream are the truest words ever written.", "score": 17, "replies": []}, {"body": "Good points.", "score": 5, "replies": [{"body": "😇", "score": 1, "replies": []}]}, {"body": "This summer i am going to start bringing my own ice-cream in from DQ and eating it while i order a Quarter pound meal.", "score": 2, "replies": [{"body": "Ahahahah lucky for us, the ice cream machines never break in Russian McDonald’s.", "score": 1, "replies": []}]}]}, {"body": "i like the new chicken sandwich", "score": 17, "replies": [{"body": "Yeah but is it worth stabbing someone or running them over with your car like that spicy Popeyes joint??? That spicy Popeyes chix sammich is TOTALLY stab-worthy", "score": 12, "replies": [{"body": "Meh. I wasn't impressed. I make a better spicy chicken sandwich. I certainly wouldn't stab someone over it.", "score": 2, "replies": [{"body": "In all honesty the spicy mayo is what makes that sammich good. Otherwise its rwally just really crispy chicken no bone on a bun.", "score": 5, "replies": [{"body": "You see, I like to put the spice on the chicken and use garlic aolii. I got a brine that's primarily juice from jarred jalapeños and then I rub with a proprietary blend of spices and chilies. Then I bread it. I usually throw a pinch of cayenne into the crumbs for good measure. While the chicken is frying, spread that garlic aolii on a bun.", "score": 2, "replies": [{"body": "Well no shit you make a better sandwich, but can you get a really good one in 5 mins?", "score": 3, "replies": [{"body": "Gods no! If I had an assembly line and a head start, I could produce them by the hundreds but I'd either work myself to death or quality would suffer. I suspect that's why fast food is so awful in general.", "score": 1, "replies": [{"body": "Or, youd end up hiring the most gangster drug dealers from the scariest most dangerous neighborhoods across the country and have THEM make your sammiches for 8 dollars an hour... Wait a minute.....🤔", "score": 2, "replies": [{"body": "That's church's fried chicken. I'm not gangster enough to go after their turf. Lol.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "r/WSBrecipes", "score": 2, "replies": [{"body": "It won't let me view the sub. Do I need an invite? I would love to post my spicy chicken recipe. Warning: brining takes minimum 2 hours for breasts cutlets. Do start early. Bun is by preference but I like a soft French bread. Or brioche. Or pretzel. You do you. The important part is the chicken. You infuse it with flavor at every step. Brine is literally just that leftover jalapeño juice with extra salt and cayenne. I'm not sure how to make the jalapeño stuff bc I don't can my own jalapeños. Leave in fridge, covered 2 hours. While that's matriculating blend the following spices: \n1 Tbs garlic powder \n2 Tbs smoked paprika \n1/2 Tbs chili powder \n1 tsp cayenne \n1 Tbs black pepper \nBlend well and when the chicken is finished brining, pat dry with paper towels and rub with the spice mixture. Then flour (yep, add some salt and pepper to that) egg wash, and bread crumbs with black and red pepper and maybe a little paprika. Make sure your oil is good and hot, (at least 375°F) and carefully slide the chicken breasts into the hot oil. Be careful not to crowd the pan you may have to do it in batches. Cook until internal temperature is at least 160°F and dress the way you want. Seriously, I could probably just eat the chicken. Oh just regular garlic aolii but now you've got me thinking about the possibilities of remoulade.", "score": 1, "replies": [{"body": "That’s not a real sub lol🤣 maybe it should be tho.  That recipe sounds delicious", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "It’s honestly underrated", "score": 1, "replies": []}, {"body": "Now that's good info I can use.", "score": 1, "replies": []}, {"body": "I like the video of the woman freaking out at a McDonald’s drive-through at 7am because she couldn’t get Chicken McNuggets.  It’s a classic.   Google it.", "score": 1, "replies": []}]}, {"body": "Just like KO. No love, but it’s a dividend beast. In my books it’s a win win.", "score": 9, "replies": []}, {"body": "I’ve had one share since 2008 and it has quadrupled", "score": 7, "replies": []}, {"body": "Just remember they are a real estate company that sells burgers. I like the stock and dollar menu at midnight.", "score": 11, "replies": []}, {"body": "Two Travis Scott burgers please 👉🏽👈🏽", "score": 4, "replies": []}, {"body": "Well I think Coke and McDonalds together is a good idea. There X number of stores for McDonalds. Every single store uses Coke products. Win win", "score": 6, "replies": [{"body": "What is concentration risk?", "score": 2, "replies": [{"body": "In what situation would coke and McDonald's ever lose their profitablity", "score": 3, "replies": []}, {"body": "The concentration risk is Coke uses a special concentration of Coke just for McDonalds", "score": 2, "replies": []}]}]}, {"body": "Sir this is a Wendys", "score": 4, "replies": []}, {"body": "I miss their chicken nuggets ☹️", "score": 4, "replies": [{"body": "Because we're into gettin Tendies now??", "score": 8, "replies": []}, {"body": "You must be to young for their early 90’s fries. Them things tasted just as good cold.", "score": 3, "replies": []}]}, {"body": "I'm into $tast, its the largest BK franchisee and currently sitting under 6 bucks, it was over 14 back in 2019ish. I think it will go back above 8", "score": 4, "replies": []}, {"body": "I have some and know they're not going to set the world on fire but a reliable chug along to sit alongside the etfs and riskier stuff. Turned a reliable return each year and a dividend. Much prefer to Coca Cola.", "score": 3, "replies": [{"body": "And they love buying back stock. Definitely not a growth company, all boomer", "score": 6, "replies": []}]}, {"body": "Are you lovin it ?", "score": 5, "replies": [{"body": "This is an undervalued comment", "score": 3, "replies": []}]}, {"body": "You're asking about McDonalds? Here? Sir, this is a Wendy's.", "score": 3, "replies": []}, {"body": "Plot twist, McD's buys MVIS and starts building ev cars, except they only talk about it for several years and never build anything to drive the company value like Fisker... Oh the possibilities", "score": 3, "replies": []}, {"body": "their earnings will probably fail like their mcflurry machines", "score": 5, "replies": []}, {"body": "hi can I get a buttermilk crispy chicken sandwich and a 10 piece with a large fry. can I have barbecue for the sauce.", "score": 6, "replies": [{"body": "Giving out bbqs with the sauce is not sustainable", "score": 3, "replies": []}]}, {"body": "I think McDonald's is screwed.  Like, they're going to putter along for awhile, but right now it's in stage 1 of a 5 stage slow death spiral.\n\nWhat's the point of McDonald's anymore?  They're not any faster than any other chain, their food definitely isn't any better, and they've raised prices so much they're actually more expensive than a lot of flat out better options.  Like, there's just now way McD's survives long term while charging more than a place like 5 Guys or Fuddruckers.\n\nThat's not a joke either, a meal at McD's really is about the same or more than one at a mid-level place like 5 Guys.  If I had stock in this company, I'd sell it, but I wouldn't short it or anything, it'll take forever for them to deteriorate, but I just don't see any value in what they're doing.\n\nAll they really have going for them is inertia and omnipresence.  Both of those will fade over time.", "score": 5, "replies": [{"body": "I don’t know where you live but McDo’s is definitely cheaper than 5 guys and Fudruckers here in Wisconsin", "score": 8, "replies": [{"body": "Fuddruckers went out of business 😩", "score": 5, "replies": [{"body": "I forgot about that. 😥", "score": 1, "replies": []}]}]}]}, {"body": "I like the stock, got some in my virgin ass isa dividend account", "score": 2, "replies": []}, {"body": "yo but monopoly could come back! i might win a million dollars!", "score": 2, "replies": []}, {"body": "I will hold MC donalds and Coke until I retire", "score": 2, "replies": []}, {"body": "U go to r/investing, WSB is for high risk high reword weekly option gambling. 🥲", "score": 2, "replies": []}, {"body": "Bada bappa baaaa,  that company sucks.\nLarge chains with slop for food can't win new customers,  they rely on idiots like me who work through their lunch and don't plan for real nutrition. Love the ease of use, but demographically they are dead. Nobody is playing in the ball pits and there's zero smoke coming from their restaurants. Does McDonald's smell like McDonald's anymore? No it's all microwaved and fried. Their market isn't sustainable long term years from now.... also they love replacing people with machines . Fuck that. Subway was beating the shit out of them and now franchisee owners of subway are  bashing subway for freshness. The rebranding of MCD Is also toast. \nNot very inviting for kids,  which is what drove them into real success. Ronald took a big nap i guess", "score": 2, "replies": []}, {"body": "McDonalds stonk is beyond boomer levels of retard. Position: 42069 shares of Wendys", "score": 2, "replies": []}, {"body": "Mcdicks sucks", "score": 1, "replies": []}, {"body": "McDonald's valuation has very little to do with thier menue. At its core its a real-estate investment. Good thought tho.", "score": 1, "replies": []}, {"body": "Sir.", "score": 1, "replies": []}, {"body": "if you like the stock you should look at this as a good thing.", "score": 1, "replies": []}, {"body": "McDonald’s is legitimately my favorite restaurant. I’m not the guy to ask, I’m too biased", "score": 1, "replies": []}, {"body": "Great stock, IMO, if you're worried about hyper inflation because they are the largest owner of commercial real estate in the world, on top of food.", "score": 1, "replies": []}, {"body": "They just need to add chicken tenders to the menu", "score": 1, "replies": []}, {"body": "I've been tracking ARCOS for this particular reason. I am bullish on McDonald's. The beyond meats deal was just a cherry on top.", "score": 1, "replies": []}, {"body": "Might as well be talking about rice cakes to a fat kid.", "score": 1, "replies": []}, {"body": "Grimace was a dickhead, a giant swollen purple furry dickhead", "score": 1, "replies": []}, {"body": "Ice cream machine broke or work?", "score": 1, "replies": []}, {"body": "WAAAYYY too WOKE to even try to make a profit.", "score": 1, "replies": []}, {"body": "I’m lovin it", "score": 1, "replies": []}, {"body": "I went to a McDonald's today and the ice cream machine was working so I'm bullish on $MCD", "score": 1, "replies": []}, {"body": "Live a little.  Buy Wendy’s stock.", "score": 1, "replies": []}, {"body": "I prefer Wendys", "score": 1, "replies": []}, {"body": "Instructions unclear. Bought more wendy’s LEAPS.", "score": 1, "replies": []}, {"body": "It's a $174 billion company that trades at 100X last quarters earnings. This was a killer trade in the 80s and 90s even going into the 2010s, but you can find better value plays elsewhere.", "score": 1, "replies": []}, {"body": "Are you lost?", "score": 1, "replies": []}, {"body": "Bc it's boomer trash", "score": 1, "replies": []}, {"body": "I’m here to steal the burgers.", "score": 1, "replies": []}]}
