{"title": "IBM?", "selftext": "[deleted]", "id": "2y4wce", "created_utc": 1425650813.0, "score": 4, "upvote_ratio": 0.83, "num_comments": 13, "comments": [{"body": "Why do you think IBM is a big time long-term winner?", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "If Buffett is a primary reason for you to invest, why not just invest directly in Buffett?\n\nFwiw, I think IBM is pretty intriguing at these levels, but not for any of the reasons you cite. ", "score": 2, "replies": []}, {"body": "My opinion is that divesting weak business and share buyback to stabilize a stock can only last so long. They need to PROVE that they can grow their business.", "score": 1, "replies": []}]}]}, {"body": "I can't speak to the fundamentals, but from a chart perspective, the market's perception of the company's prospects is not good.  A weekly downtrend with substantial Resistance from $172 all the way up to $200.  If I were you I would put the stock on a Stalk List and watch for it to clear that $200 level after which you can look for good buy entry setups on a lower timeframe.\n\nThe company can definitely turn around... but you should make it prove said turnaround to the market at which point the shares will lift giving you an opportunity to join a new uptrend.\n\nHope it helps.\nTrade well...", "score": 1, "replies": [{"body": "This does not compute. You're saying that a long-term hold should move up 20% in order for someone to buy. How much potential is there for a mature bluechip to grow *beyond* that 20% gain?\n\nSure, there's resistance. That's always the case with down-and-seemingly-out companies. Investing in IBM is investing in the turn-around which, if successful, would instantly eliminate each of those points of resistance. \n\nThis is why technical analysis doesn't work with these types of investments. ", "score": 3, "replies": [{"body": "That's a pretty broad statement, but opinions vary...\n\nIf you like it feel free to load up right here...\n\nBut presumably if you're buying it for a turnaround, you're buying it for a return to growth... maturity not withstanding... otherwise, why bother?\n\nYou can be \"right\" about a stock's fundamentals and wait a really long time for the overall market to agree with you... which, by the way, is the only time/way you will make any capital gains.  Waiting for price to clear resistance provides me with comfort and price levels against which to lean (support) in trading the stock... my way of making sure the market agrees with my assessment.  \n\nThis is what works for me consistently.  I'm sure Value Investing works for some folks, but I leave it to those better suited to the task.\n\nTrade well.\n\n\n", "score": 1, "replies": [{"body": "Well, that's the point of the OP's question: he's value investing. So you're giving him this technical analysis response, which of course will contradict *every* value investor's premise for investing. The technicals *rarely* look good on turn-around stocks -- that is the very reason they are turn-around stocks!\n\nSo, yes, of course the OP will need to wait until the value is seen by the wider investing population and that will drive IBM's share price up. But, again, that's the very essence of value investing/turn around story investing.\n\nAnd, btw, it's not at all a broad statement. As mentioned: turn-around stocks will pretty much always have poor technicals. An applicable definition of turn-around stocks is: companies that have lost favour with the wider market and have some plan(s) to improve their fundamental story, which will then (hopefully) gain traction with the wider market. A technical look at such a company will necessarily tell the story of the wider market losing confidence in that company.", "score": 1, "replies": [{"body": "Technicals are neither good nor bad.  They just are.  They're tools, the value of which is extracted from the user's perspective and proficient use.  I use them to tell me what the market thinks about a security.  This works for me as I like to participate with momentum.  They actually work quite well as an overlay on Value stocks when used properly...\n\nTo the original questioner... I recognized that your original question hinged on fundamentals, I just thought you might like a chartist's perspective.  If you have a strong sense of technicals and/or if you have no interest in them, my apologies.", "score": 1, "replies": []}]}]}]}, {"body": "Fundamentals are good except for residual income, which is strongly negative. Hope that helps.", "score": 1, "replies": []}, {"body": "Yeah I get the feeling that he is only wants to get in now because:\n\n>Buffett sees it as a strong buy.\n\nHe might not understand what support/resistance is, or what a good entry point is...... :/", "score": -7, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": ">IBM looks like a good company at a good price\n\nThis is what i mean though, what makes it a \"good price\" to buy at? Plus you said \"buffet says it's a buy\" which to me means you only want to get it because buffed SUPPOSEDLY said it's a buy.\n\nImo it's not right now ", "score": -5, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Because it's currently at 160 and has been stable at that point for a while now, so it might go up and might go down - nobody can predict that.  \n\nHowever, if it starts to see some support and makes its way up, there may be a good entry point at which to buy it - 200 may or may not be that point. I would suggest that 180 would be that point, since that puts it back into the range it was in prior to its earnings report that chunked it down.\n\nBasically, what it comes down to is that buying it NOW is a guess, but buying it in the midst of a consistent rally is more of a sure thing.", "score": 1, "replies": []}]}]}]}]}]}, {"body": ">Buffett sees it as a strong buy.\n\nYou are only getting it because he is getting it. If he said \"meh its not a buy\" would you still get it? I didn't think so.", "score": -5, "replies": []}]}
{"title": "I am new to investing and I have money to invest in either Google, Apple or LMT. Which would you recommend and why?", "selftext": "[deleted]", "id": "2y4wk2", "created_utc": 1425650957.0, "score": 0, "upvote_ratio": 0.29, "num_comments": 10, "comments": [{"body": "Based on this post and your replies, you should not be investing in anything... yet. Please educate yourself further before you make a choice. This isnt meant to be a negative comment against you, it's just a piece of advice. Read /r/personalfinance and other subs, then make your mind up. Investing in index funds might be a far safer and easier option for someone just starting out to look in to. ", "score": 6, "replies": []}, {"body": "You're literally asking strangers in the internet what to invest in. Two of your three options also happened to be current \"buzz\" stocks. I really think you would be better off with an index fund for now. ", "score": 3, "replies": []}, {"body": ">Edit: Another one I was looking at was EXXI, which a redditor said would go up to ten dollars per share, should I listen to that and invest half my my money into it?\n\nIs this for real?  ", "score": 3, "replies": []}, {"body": "Based on your experience and the amount of money you're considering investing, you should read this book first:\nhttp://www.amazon.com/The-Investment-Answer-Daniel-Goldie/dp/B0096ET3S6\n", "score": 2, "replies": []}, {"body": "Apple and Google. Investors are treating both like they're mature, slow growth companies reliant on the next update of their breakout products. They're more than that. They're basically the infrastructure of the future-- it doesn't take a leap of imagination to picture both companies eating away at the entertainment industry, the automotive industry, health care, etc. These aren't just technology plays--they're planting roots across industries. We are just at the dawn of what they're capable of. ", "score": 2, "replies": []}, {"body": "Don't invest in anything based solely on what a redditor said.  As far as the first question? I like Apple and LMT better more than Google. Apple is selling phones like crazy, and I have a feeling the Iwatch is going to do really well, at least in Asia. LMT gets gov contracts with little or no competition. Google is a good company, but they tend to fail at things more than the other two.  \n\n", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "You're asking us to teach you how to stock pick?  There must be 1000's of books on it.", "score": 3, "replies": [{"body": "[deleted]", "score": -3, "replies": [{"body": "You are not ready to invest, sorry.  Until you have an idea of how to pick a stock beyond \"listen to what other people are saying\" you are doomed to lose money in the long run.\n\nRead some books on the subject and maybe paper trade a bit on a stock simulator to get a feel for it.", "score": 3, "replies": []}, {"body": "I mean, they're both good companies. If you are sold on these too companies, why not just get both?\n\nedit: left some words out of sentences. ", "score": 1, "replies": []}]}]}]}]}, {"body": "disclaimer: I am a newbie as well and all my advice is more philosophical and big-picture in nature and not necessarily useful at all in practical terms.\n\n\nI consider myself a newbie investor (maybe novice is a better word) and one of the best pieces of advice I was given was to pick a company who you actually trust and believe in. I assume that you're in it for the long-term. I started investing 5 years ago and the first two stocks I owned were AAPL and GOOG. At the time I was investing with a 10 year time frame, but now I think I might actually hold onto those for life. \n\n\nAAPL to me is the big money maker. They keep coming out year after year beating out every prediction and just hitting homeruns. If you think they will continue to do so (and they prob. will, at least in the near future) then go with them. \n\n\nHowever, I personally own more stock in GOOG and the reason is that I see Google as taking over the world within the next 20 years. I trust them more as a company and I feel like they don't exist only to make a profit--they're focused on changing the world for the better--which matters to me.\n\n\nLockheed Martin is interesting to me. On one hand they benefit from the war machine that is the United States government. On the other hand, I'm not sure that I want to contribute to that war machine.\n\n\nYou need to take into account your time-frame for investing, your overall philosophy, and your overall risk threshold. I think AAPL is the safest bet in the relative short term. I think LMT or GOOG are good plays long term. Honestly, I don't think you can go wrong with either AAPL or GOOG at this point.", "score": 1, "replies": []}]}
{"title": "AAPL at critical technical levels", "selftext": "Going into next week's Apple Watch event as well as the DJIA announcement, Apple seems to be trading at critical technical levels with respect to the 200, 100, and 50 EMAs for Daily, 2-Hour, Hourly, and 30-min.  Apple is well above the [50-day EMA](http://imgur.com/3gOIOx2), but when you look at the 2-Hours, Apple appears to have [bounced off of the 100 and is resting on the 50](http://imgur.com/EauZIGN).  Looking at the Hourly EMAs, Apple ran into [resistance a the 50 level and is now resting at the 100](http://imgur.com/MwyJ6dK). Finally, with respect to the 30-min levels, [we see the 50s, 100s, and 200s all converging around the 127.75 level](http://imgur.com/gnmkFnd) where the stock is currently trading, suggesting an inevitable breakout either up or down.\n\nI'm long Apple, but for fundamental rather than technical reasons.  What do you think - is Apple about to experience a significant move?", "id": "2y5h28", "created_utc": 1425661646.0, "score": 0, "upvote_ratio": 0.43, "num_comments": 15, "comments": [{"body": "With it being part of the Dow Jones along with apple pay becoming revolutionary, I think it has major potential ", "score": 3, "replies": [{"body": "Although historically tech companies haven't done well in the Dow. But I do agree with you, the potential is huge.", "score": 2, "replies": [{"body": "DOW membership just increases the flow of lemming money into the Apple bubble. It's great for the stock.", "score": 2, "replies": []}]}, {"body": "Agreed, but won't apple pay just pave the way for other NFC payment providers? Google and everyone else eventually? Only the finger print reader gives Apple the advantage here and that is a temporary advantage.", "score": 1, "replies": []}, {"body": "Apple pay is years late on the world market.\n\nNfc hasn't caught on in America, but over seas, it's been common for years. Globally, AP has a lot of ground to make up.\n\nIt's not revolutionary, or even evolutionary, it's the same damn thing competitors had for years, except it doesn't work with the existing infrastructure. That's a big issue when 25+% of phones all already have the same protocol and billions of dollars are already being processed every year.", "score": 1, "replies": []}]}, {"body": "[removed]", "score": -9, "replies": [{"body": "Sure thing, chief, lol.", "score": 1, "replies": []}, {"body": "Accurate I'm afraid.", "score": 1, "replies": []}, {"body": "Maybe, but enough people still trade according to it so it becomes something. A self fulfilling prophecy. Don't fight the market all on your own. You don't have enough capital to do it and win.\n", "score": 1, "replies": [{"body": "That's correct and if there were ever technical trading tricks that would generate alpha they would quickly be discovered by other technicians and the alpha would disappear.", "score": 1, "replies": []}]}, {"body": "You'd think that a self-proclaimed \"Apple Pro\" such as yourself would recognize that AAPL [frequently trades according to simple technicals like moving averages](http://i.imgur.com/HfgVnqp.jpg)", "score": 0, "replies": [{"body": "This also happens with shorter-term EMAs acting as resistance levels.  [In this photo](http://i.imgur.com/4xwkGko.jpg) you can see the 50 and the 100 acting as ceilings of resistance.  once the 100 is breached, there is a gap up as it has broken through a key resistance level.", "score": -1, "replies": []}, {"body": "[deleted]", "score": -5, "replies": [{"body": "man, you of all people haven't earned the right to tell somebody to shut up.", "score": 5, "replies": []}, {"body": "My point is that Apple frequently finds the 50, 100, and 200 day moving averages to be key support levels.  When those levels are breached, you typically see quick drops in the stock price.  I probably shouldn't waste my time responding here, but it's Friday and trading is slow, so here we go:\n\nWhen we take a look at [this chart of Apple](http://i.imgur.com/k7ho75x.jpg) we find that the stock frequently uses the EMAs for support (shown in yellow).  Once that EMA is breached, we see a sharp drop down (shown in pink).  I have [zoomed in here to highlight this sharp drop](http://i.imgur.com/UJB60HF.jpg).  Notice the 50 EMA providing support and the subsequent gap down after it is breached?  After the gap down, Apple finds support at the 100.  That tells you that Apple does, in fact, rely upon EMAs.\n\nedit: spelling", "score": 1, "replies": [{"body": "Holy crap that's a lot of pseudoscience drivel. Technicals are Bullshit. Are you guys ever going to get that?", "score": 1, "replies": []}, {"body": "[deleted]", "score": -4, "replies": [{"body": "I don't usually agree with fsyolo, but great comment here :)", "score": 1, "replies": []}]}]}]}]}]}]}
