{"title": "Microsoft deal would reopen Three Mile Island nuclear plant to power AI", "selftext": "", "id": "1fm11rc", "created_utc": 1726918757.0, "score": 439, "upvote_ratio": 0.98, "num_comments": 63, "comments": [{"body": "Wow! I did work for TMI for years before it was decommissioned because it couldn’t make power cheap enough for the regional grid operator - an annual process known as the Power Auction. I also heard that another nuke plant - Susquehanna Steam in Berwick - PA may be used as well for a single tech customer. This is awesome news for the local work force.", "score": 38, "replies": [{"body": ">couldn’t make power cheap enough for the regional grid operator\n\nSo Microsoft gonna lose on this in the long run?", "score": 0, "replies": [{"body": "Well if they cant get enough power elsewhere then it isnt a loss", "score": 14, "replies": []}, {"body": "The way that the grid works is complex as it is all interconnected, but basically TMI will provide so many Megawatts into the grid and Microsoft will pull out that amount while paying for the operation at TMI. I think it’s more a capacity thing for MS rather than one of cost. They need that power and will pay premium for it.", "score": 13, "replies": [{"body": ">but basically TMI will provide so many Megawatts into the grid \n\nOracle is building a 1 gigawatt smr, you think TMIA can compete if they succeed? Where do you think cost and profitbility cross?", "score": 3, "replies": []}, {"body": "This is exactly right. Msft doesn't really care about the upfront energy costs of TMI. They're looking for increased energy efficiencies to power Ai data centers. Once they build out the ai infrastructure the TMI cost inefficiencies won't really matter too much.", "score": 2, "replies": []}]}, {"body": "Past tense. Couldn't.", "score": 1, "replies": []}]}]}, {"body": "This just shows the AI race is still prevalent and the “bubble” hasn’t been popped.", "score": 33, "replies": [{"body": "There is no Bubble, companies make real money on this, its not about a dream like 2000.", "score": 36, "replies": [{"body": "Who is making profit off from the large language or generative AI ( including images and video generators models )", "score": 3, "replies": [{"body": "LLM aren't all there is about AI. It is only a part of it.\n\nThe drugs/medicine industry is already seeing some breakthroughs using this tech to detect cancer humans couldn't or to create new drugs that would have taken years to create without AI. \n\nWeather analysis systems use generative AI to run simulations and better predict the weather.\n\nMeta reduced the cost of their latest tracking tech in the Quest 3 using AI. \n\nThe cars, micro conductors, robotic and security industries are all already using AI to improve their product in ways that wouldn't be possible anymore with only humans (Think facial recognition/emotion analysis for security, fully automated improvement loop for microprocessor designs, (trying to achieve) self driving cars, training robot in simulations before actually having to make their physical brains, etc.)\n\nBut also, LLMs are just a part of an AI \"brain\", and will be required in a way or another for humans to interact with those AI in the future, even if it isn't the final product by itself. Think of it as a part of the user interface of a software. It simply isn't a graphical one:\nFor instance, we could have a medical support AI app, that would be trained to recognise common diseases and their symptoms. The core functionality of this AI would be to recognise diseases, but it needs to be able to analyse images and text to detects the symptoms and figure out what to suggest, and it needs to be able to communicate with the user in some way to fullfill it's duty.", "score": 3, "replies": [{"body": "I worked in deep genomics ( toronto based; startup by one of most famous ML scientist, Brendan Frey; also one of earliest computational biologists who introduce deep learning into biology ) as ML research engineer. I don’t know other industries. But AI sucks for biology. There is no way it gonna work in the way you guys are expecting ( not even a slightly close) in next decade", "score": 1, "replies": []}]}, {"body": "The short answer is: Everyone\n\nThis is just an example of many, but a massive amount of money is being spent by enterprise customers in GenAI.  A simple chatbot to talk to your customers is 100-500k just to set up.  And these things are not nearly as sophisticated as you would think.  \n\nYou mention image and video,  adobe products can do magical things with AI and will drive subscriptions.  Competing tools that aren’t Adobe will make bank.\n\nOther real examples:\n\nCopilot licensing for enterprise for Microsoft.\n\nAll the training being sold to use these products alone is a gold mine.\n\nAll the contracting companies will setup all this for a hefty fee.\n\nTeach a coder to use a 50k/year subscription to do the work of 3 people.\n\nSo yeah, everyone is the answer here.", "score": 6, "replies": [{"body": "3 people. Try a team of 300. I read an interesting speech transcript recently from a speech that was given at a university, I think it was Stanford. The speaker proposed that soon you’ll be able to prompt a LLM to say something like, “hey TikTok is about to be banned in America, write me an app that does what TikTok does, but will not be subject to legal action from American regulators.\n\nComplex software will be able to be created by lone programmers in a single day.\n\nNow if you’re having a hard time seeing value there, that’s why you think this is a bubble.", "score": 2, "replies": [{"body": "https://www.tiktok.com/@todayin_ai/video/7403020845020450053\n\nIt was Eric Schmidt, former CEO of Google.  The full talk is very interesting.", "score": 1, "replies": []}]}, {"body": "copilot usage is very poor. Most customers will churn after their annual contract.", "score": 1, "replies": []}, {"body": "That's not everyone. That's just the shareholders that sell those products. Sounds like the working class once again gets the short end of the stick. Unless we tax and redistribute that wealth to the rest of of society, then it would actually be benefiting everyone.", "score": 1, "replies": [{"body": "Commie", "score": 0, "replies": [{"body": "That’s not communism, comrade", "score": 1, "replies": []}, {"body": "Yes wanting people to survive this massive hoard of wealth while the working class suffers is totally commie.  Honestly just go stick your head in the sand, at least you’ll have a spot ready for you when the rich let you die and wonder why no one is making babies to prop their stocks up.", "score": 1, "replies": []}]}]}]}, {"body": "AI isn't printing money yet.  it is still a nascent technology, but it will change everything.  Like the way the invention of the printing press and the steam engine changed everything.", "score": 1, "replies": []}]}, {"body": "Not quite yet.  AI and neural nets have been used for years in predictions.  What TV shows you would like.  Is that a fake charge on your card.   \n\nThe LLMs have yet to make money.  People are buying NVIDIA chips and lots of the big companies are rolling their own device.  Microsoft developer Maia, Google has TPU.  Amazon Trainium.   Facebook is working on MITA.  \n\nWe shall see.", "score": 0, "replies": []}]}, {"body": "If the bubble was popped it would be obvious, all the stocks would have crashed, the question is if there's a bubbler or not", "score": 1, "replies": []}, {"body": "Only way the bubble pops this time is if ai leads to our destruction as a species.  Then losing money on the stock won’t matter too much probably.", "score": 1, "replies": []}, {"body": "Straight up, hyperscalers have shifted from talking about 150-300 megawatt data centers to 1-5 gigawatt centers pretty much just for AI work. \n\nA true AGI with humanity's knowledge and beyond human reasoning capacity would be a national boon to the point of shifting the geopolitical landscape into the hands of the first to build.\n\nWe are still on the rising edge of this race.", "score": 1, "replies": []}]}, {"body": "I think the datacenter/ai race will drive these kinds of efforts and do more for our outdated, held together by spit and tape power grid than most realize. In my uneducated opinion, this will ultimately generate more jobs and economic activity than any taxpayer supported jobs program.\n\nAnd fwiw... France generates roughly two-thirds of its electricity from nuclear power, allowing France to have one of the lowest co2 emissions per unit of electricity in the world (and therefore lowers reliance on imported oil/nat gas).", "score": 10, "replies": []}, {"body": "Safest cheapest power in the world. More nukes, less kooks.", "score": 8, "replies": [{"body": "Wind and solar are cheaper currently I believe, but I'm sure scale and footprint matter as well.", "score": 1, "replies": []}]}, {"body": "Constellation already green lit TMI, stock jumped 20%, I work for constellation at another plant", "score": 3, "replies": []}, {"body": "I saw this on the Simpsons.", "score": 5, "replies": []}, {"body": "This is big", "score": 2, "replies": []}, {"body": "Because MSFT will be like the only client for it, the cost for electricity will be discounted, because there will be no intermediary supplier company. Also those 880MW reactor power with a 0.8 power eficiency means like 5333 GB200 NVL 72 120kw , aprox 13.5B $ , if GB200 NVL 72 will be 2.5M $ . MSFT will need like at least 10 reactors like this, in order to mantain DC for his clients and OPEN AI.", "score": 2, "replies": []}, {"body": "TMI.", "score": 3, "replies": [{"body": "?", "score": 2, "replies": [{"body": "TMI: Three Mile Island", "score": 8, "replies": []}]}]}, {"body": "I think stories like this show confidence that these companies are going to need more and more chipsnAnd they don't see any breakthrough in efficiency on the horizon where They won't need as much compute .", "score": 1, "replies": [{"body": "There is no amount of fast that will ever be fast enough.", "score": 7, "replies": [{"body": "👏🏻", "score": 1, "replies": []}, {"body": "I don't think you can really say that. But for the next few years that  should be true. There always could be a breakthrough in efficiency where we don't need that much compute. But moves like this show that these big companies don't see that happening anytime soon.", "score": 1, "replies": []}]}]}, {"body": "So what happens if it blows up again", "score": 0, "replies": [{"body": "AI will tell you", "score": 1, "replies": []}]}, {"body": "Why cant Micros**t and other corps redesign to consume lower power for example a human brain the true intelligence consumes only 12 Watts per day ! Btw still stuck on a loss where I bought a lot of shares at 130$ !", "score": -1, "replies": [{"body": "That's more on Nvidia, they make the hardware. And we just barely figured out how to do ai, And the main thing we figured out is if we throw a à s*** ton of compute at it it's way better..", "score": 2, "replies": [{"body": "I think you are unaware of the real world.", "score": 1, "replies": [{"body": "If I'm wrong explain", "score": 2, "replies": [{"body": "Even computer scientists don't know what the meaning of true intelligence is forget about all these other bioscientists I have a degree in medicine and engineering but something like the human brain is extremely difficult to even understand where to start from I think the hardware is very important the human brain is mostly hardware but it's chemically powered it's very different kind of a design and that nature of intelligence comes from the structure of the brain rather than it's not as simple as connecting multiple parallel processors and you will get to replicate the human brain this kind of projects have already been tried at MIT almost 30 years ago and I also studied at MIT and I haven't seen any kind of advantage especially in terms of compute capabilities doing just that I hope this is good enough explanation that the path that these people are following is probably not the right path something completely new needs to be designed or invented that would allow us to mimic the human brain capabilities.", "score": -1, "replies": [{"body": "It seems you're a little out of touch with what people working on this are doing/saying, none of them claim they completely understand human intelligence and have a definitive definition of AGI. . IIt's not like they have a theory that this is the solution for creating intelligence so they're running with it.  They're just folowing a path that gave them some results, that gets improved  the more compute and time they put into it.  they're also making tools that could be useful, There's a very good chance,  and they'll agree too,  that  ultimately there might be much better ways to do it and in the future they might switch to another path but until that's discovered this is the best they found. \nThey're being no sign of a better path at the moment  is all I'm really concerned about when investing.  If the next 5 years will be more of the same , i'm going to hold on to the stocks I have like Nvidia. At one point that might change and I then I might look at selling.", "score": 3, "replies": [{"body": "\n\nI want to clarify that I am fully in touch with advancements in science and technology. I hold degrees in engineering from MIT, in addition to being a medical doctor. Currently, my company is developing a humanoid robot and an exoskeleton, both of which I have designed. These designs diverge significantly from the current state-of-the-art machines in the field.\n\nMy primary concern is the current enthusiasm surrounding AI and this company Nvda, where much of the progress seems focused on parallel computation. I believe it's important to help others understand that this approach might be fundamentally flawed based on my experience in how biological systems work and bio inspired robotic systems would be intended to work. Looking at how the human brain works, it's increasingly evident that simply connecting hundreds of power-hungry processors, such as those from NVDA, won't solve the core computational challenges. \n\nI also worry that many are investing heavily in NVDA without fully recognizing that this technology is largely reliant on foreign manufacturing, which could introduce additional risks.\n\nI appreciate your attention my perspective and hopefully we can save our money and investments.", "score": 0, "replies": [{"body": "And you're hanging out Reddit?  Sure Jan.", "score": 2, "replies": []}, {"body": "You seem out of touch and maybe delusional. . Its increasingly evident that hundreds of powerful processors are improving AI. They're not really power hungry they're actually efficient compared to previous ways of computing , it's just that you need so many and so much compute That they're using a lot of power . That's One of the things we may figure out to get around in the future . But for now that is the best path we know, And we are far from pushing it to its limit,  Now if you want to claim that few years from now like 5 years from now they're going to hit a wall because this is not the best way to do it, I couldn't argue with because no one can really see that far out, but for now the way they're doing it is the best we know.", "score": 2, "replies": []}]}]}, {"body": "The idea of replicating human intelligence isn't really the goal anymore.  It's more about brute force approximations of the same results.", "score": 0, "replies": []}]}]}]}]}, {"body": "Google's TPUs are pretty power efficient", "score": 1, "replies": []}, {"body": "The human brain is not very powerful.", "score": 0, "replies": []}]}, {"body": "Whats next. Turn on nuclear reactors to power bitcoin miners???", "score": -1, "replies": []}]}
{"title": "$11B ORDER ON APPLE TODAY ", "selftext": "[removed]", "id": "1flu3nl", "created_utc": 1726889695.0, "score": 38, "upvote_ratio": 0.68, "num_comments": 41, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 7 | **First Seen In WSB** | 1 week ago\n**Total Comments** | 33 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "But what does it mean Basil? Seriously explain this like I’m 5. Is this were the volume came from at the end that dropped the price ?", "score": 48, "replies": [{"body": "no, the volume that dropped the price at the end of the day had to do with the option chain. there were call sellers at $230 strikes for today's expiration and they had to make sure that those calls expired worthless. i only know this because i know how to read open interest.", "score": -8, "replies": [{"body": "This is idiotic. No, some option seller didn’t move a $3.5T stock 2% in 15 minutes", "score": 46, "replies": [{"body": "People think everything is a conspiracy.", "score": 10, "replies": []}, {"body": "Seriously. What actually happened is buffet's sale caused the float to increase (he was considered a strategic holder so didn't count towards shares outstanding) which made every ETF have to buy apple shares on the close today. Most agreed to do that on the closing print with some bank or another so that's what happened today.", "score": 1, "replies": []}, {"body": "Yes, they do. And it’s wrong and naive to say a 3,5t stock can’t be moved 2% when you have to move the price only at the last minutes of trading by selling a little larger volume than normal. Market makers know how many orders are on both sides, how many transactions are going through and they have made some of these options that were sold https://www.optionstrading.org/basics/trader-types/market-makers/ \nIt’s a matter of calculating if it is worth selling some reserves and buying back later and keeping the premium, or letting the options expire ITM and having to give potentially more stock away.", "score": 0, "replies": []}]}, {"body": "So, if big volume call seller wants to keep the price down or sideways, what do they do? Sell their existing stock for lesser and lesser ?", "score": 10, "replies": []}, {"body": "Same happened with NVDA", "score": 0, "replies": []}]}]}, {"body": "It'd be interesting to see how the stock behaves in the aftermath of these orders to see if there's any correlation. it’s not uncommon to see rebalancing as traders adjust their positions", "score": 18, "replies": [{"body": "oh there definitely is a correlation! i've been studying dark pool orders for the past 10 months. maybe just not with opex orders though.", "score": -15, "replies": [{"body": "Do you have data to show to prove this?", "score": 7, "replies": [{"body": "He doesn’t need any he became an expert in 10 months", "score": 36, "replies": []}, {"body": "absolutely", "score": -5, "replies": [{"body": "This is usually the part where you link a source", "score": 6, "replies": []}]}]}, {"body": "He’s a GMEtard who doesn’t understand how anything works but heard “dark pools” once and thinks he’s an expert", "score": 4, "replies": [{"body": "It's sick, the cult that formed out of that event. I have friends that are paranoid like that and it's sad to listen to", "score": 8, "replies": []}]}, {"body": "10 months! That's like 9 months past the \"max study time\" for wsb. \n\nPlease take your expert opinion to wall street", "score": 1, "replies": []}]}]}, {"body": "Isn’t this just because the funds that track the S&P Tech Sector are rebalancing based on their new concentration limits for the highest cap companies (e.g., Apple, Microsoft, Nvidia)? For example, XLK…\n\nhttps://www.morningstar.co.uk/uk/news/254402/the-sp-is-getting-a-september-shakeup-whats-changing.aspx", "score": 9, "replies": [{"body": "More than likely to be the correct explanation", "score": 5, "replies": []}, {"body": "Indeed\n\nhttps://preview.redd.it/q99a1xm374qd1.jpeg?width=1179&format=pjpg&auto=webp&s=747a5eae3ac29a4df3f9b4281d640f1bbc7ce83d\n\n[https://www.marketwatch.com/story/traders-face-biggest-index-rebalancing-in-four-years-on-friday-heres-what-to-watch-for-0524aa01](https://www.marketwatch.com/story/traders-face-biggest-index-rebalancing-in-four-years-on-friday-heres-what-to-watch-for-0524aa01)", "score": 5, "replies": []}]}, {"body": "So calls?", "score": 5, "replies": []}, {"body": "How do you get access to them? Isn't it only for institutional investors?", "score": 3, "replies": [{"body": "openbb discord bot", "score": 4, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "[deleted]", "score": 35, "replies": [{"body": "Maybe, but openBB is a free discord bot. Thus the name.", "score": 4, "replies": []}]}]}]}]}, {"body": "Average 4 witching day amiright? ![img](emote|t5_2th52|12787)", "score": 3, "replies": []}, {"body": "So wtf does this mean, recession cancelled?", "score": 2, "replies": [{"body": "Not for the poors ![img](emote|t5_2th52|4271)", "score": 3, "replies": [{"body": "I’ll go back to my Amazon flex shift", "score": 1, "replies": []}]}]}, {"body": "Spooky", "score": 2, "replies": []}, {"body": "Hmm is this my confirmation to short Apple?", "score": 2, "replies": [{"body": "I think the better play is to short OP", "score": 6, "replies": []}]}, {"body": "dArK pOoLs ![img](emote|t5_2th52|31224)", "score": 2, "replies": []}, {"body": "So when I see Apple rising up; get some….understood", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4276)![img](emote|t5_2th52|27189)", "score": 1, "replies": []}]}
