{"title": "✅ Daily Chat Thread and Discussion ✅", "selftext": "Please use this thread to discuss what's on your mind, news/rumors on NVIDIA, related industries (but  not limited to) semiconductor, gaming, etc if it's relevant to NVIDIA!", "id": "1fr5yun", "created_utc": 1727496035.0, "score": 13, "upvote_ratio": 0.93, "num_comments": 49, "comments": [{"body": "We held 120 for now", "score": 9, "replies": [{"body": "Would be $125+ without the SMCI BS", "score": 8, "replies": [{"body": "Fuck smci", "score": 4, "replies": [{"body": "Thinking it's more of a China problem.", "score": 2, "replies": [{"body": "China is great now", "score": 0, "replies": [{"body": "Numba one", "score": 1, "replies": []}, {"body": "They banned Nvidia chips today.", "score": 0, "replies": [{"body": "The thing is, this exact same story was out in May", "score": 3, "replies": [{"body": "Hopefully a big nothingburger..", "score": 1, "replies": []}]}]}]}]}, {"body": "Fucking smci ", "score": 2, "replies": []}]}, {"body": "SMCI up 4% today..", "score": 3, "replies": []}]}, {"body": "$200 EOY", "score": -3, "replies": [{"body": "From $3T to $5T in 3 months?  Good luck with that dream!", "score": 15, "replies": [{"body": "It’s already gone up 178 percent this year. It’s more then possible", "score": 3, "replies": [{"body": "Next year, possible.  This year, it’s less than possible: Impossible.", "score": 1, "replies": [{"body": "Lmao. It’s already up 178 dude !! Cvna is up 800! Of course NVDA can and will crush it higher", "score": 1, "replies": []}]}, {"body": "Disclaimer: past performance does not indicate future performance(s).", "score": 0, "replies": [{"body": "That’s why I wrote possible and most likely with NVDA probable. I hope you’re not dumb enough to place puts or sell with shaky hands.", "score": 1, "replies": [{"body": "I never said it was/wasn't possible. I am saying that just because it went up 178% this year, it's not definitive it will happen again.", "score": 0, "replies": [{"body": "No shit Sherlock. I think it will.", "score": 0, "replies": [{"body": "Nice backpedalling.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Went $1T to $3T in no time. Once we get the Blackwell projections next ER on Nov. 19 this will fly.", "score": -1, "replies": [{"body": "Uhhh, it went from 1T to 3T because guidance and real revenues showed up, AI momentum, high demand, low supply, no real competition.  You think they’re going to provide guidance to nearly double revenue in a quarter to justify $200?  Don’t get me wrong, I would love to see $200; I just think it’s impossible on your timeline.  $200 next year?  Maybe.  $200 this year?  Good luck on your fantasy.", "score": 2, "replies": [{"body": "Why would revenue need to jump 100% in a quarter in order to justify a $200 price? \n\nMight want to work on your math skills, pal.\n\nMeanwhile, the stock market is forward looking, which is why you see significant speculative investment in equities, especially growth stocks.", "score": 1, "replies": [{"body": "My math skills are perfect and don’t rely completely on hopium", "score": 0, "replies": [{"body": "Then it should be easy to show your math. Let's see it, genius.", "score": 0, "replies": [{"body": "I already mentioned the math of double revenue for $200.  Please show me your math for $200.", "score": 0, "replies": [{"body": "lol are you joking? Double the revenue *in a quarter* would not even double the price??\n\nUtterly delusional and financially illiterate.\n\nLearn DCF at the very least.", "score": 1, "replies": [{"body": "That's not what I said.  I said we'd need to see at least double the revenue to see a share price of $200 and I don't see that happening this year.\n\nLearn to read at the very least.", "score": 0, "replies": [{"body": "That's actually precisely what you said. \n\n[See here](https://old.reddit.com/r/NVDA_Stock/comments/1fr5yun/daily_chat_thread_and_discussion/lpc4kmv/)\n\n>...You think they’re going to provide guidance to nearly double revenue **in a quarter** to justify $200?...\n\n\nPlease learn to... idk... not say stupid things at the very least?", "score": 0, "replies": [{"body": "You do realize that was a question and not a statement, right?  It was a question I asked Odd\\_Perspection since he thinks it's going to go to $200 by EoY, for which I asked if he thought we'd guide to nearly double revenue in a quarter to justify $200.\n\nI guess you need to learn grammar and understand the difference between a question and a statement, too.  🤔", "score": 0, "replies": [{"body": "Cool story, pal.", "score": 0, "replies": [{"body": "Yeah, I give up trying to explain things when they lack reading comprehension skills.", "score": 0, "replies": [{"body": "Alright. Let me know when you learn basic math too.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "No of course not. Just trying to rile up the sunshine traders. $150 EOY would be a stretch. Made more on this stock as a base over the years than I deserved. Thus the $200 EOY obligatory post. Relax. Enjoy the ride.", "score": -1, "replies": [{"body": "$200 EOY not happening. $175 unlikely. $150 possible. Whatever happens, it's never what we expect.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "On the broader look the slowing growth and decreasing margins are causing the quarterly cyclicality, just relax and buy the dips before Blackwell.", "score": 10, "replies": [{"body": "No more dips buying, time to buy AMD and AVGO", "score": 9, "replies": [{"body": "Just before the Blackwell is coming 🤯", "score": 3, "replies": [{"body": "Who says the market will care much about Blackwell? Imagine 1 error, stock drops hard", "score": -6, "replies": [{"body": "Huh? \n\nThe market cares about reducing costs, improving efficiency and increasing compute density. \n\nBlackwell represents a significant leap forward in these areas. So why wouldn't the market be interested in that...?", "score": 4, "replies": [{"body": "Nobody knows if the market will care", "score": 1, "replies": [{"body": "... but they've literally *said* they care. \n\nYou don't take them at their word?\n\nAre you just uninformed or something? Listen to the earnings calls. Every company is working on AI and the hyperscalers are planning to spend a lot more on hardware outlays next year and likely even more the following year. \n\nThis stuff is public record. You can read the transcripts or listen to the calls or read the 10Qs and 10Ks. Look at the acquisitions and investments... \n\nOf course the market cares about improving their own margins and beating their competitors with better models and more strategic use of compute.\n\nMeanwhile the Fed is in a cutting cycle and the economy is strong. Cheaper money means more will flow into Nvidia and other companies that dominate over the next few years.", "score": 1, "replies": [{"body": "I won’t believe it till I see it", "score": 1, "replies": [{"body": "You *are* seeing it. Look at the demand for hopper and the excitement over the Blackwell dev kits they've already sent to customers. \n\n\nI don't know what to tell you, mate. There are specific target metrics that companies are chasing. These are quantifiable features of nvidia's chips that make them superior to anything else on the market. It's why Nvidia can build in fat 70% margins into their products.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "You need to expect election volatility. Probably people freeing up the money for october", "score": 1, "replies": [{"body": "You must expect the unexpected", "score": 5, "replies": [{"body": "The unexpected is expected, don't accept the unacceptable.", "score": 1, "replies": []}]}]}]}
{"title": "“Nvidia is overpriced” - LOL", "selftext": "You hear from so many that “NVDA is overpriced!” Disagree. Stock is up 185% over the past 12 months. Great rise. Earnings are up 415% over that same period! \n\nBy the way, look at all the other gaudy numbers, like the 55% profit margin, which dwarfs Meta’s 34% or Microsoft’s 36%.", "id": "1fr5e7b", "created_utc": 1727493896.0, "score": 71, "upvote_ratio": 0.92, "num_comments": 60, "comments": [{"body": "If not NVDA, then who?\n\nThe barrier to entry in the GPU space is very high. AMD is a player but Intel hasn't mustered an AI offering.", "score": 17, "replies": [{"body": "NVDA is the whole game right now and will be for a few years, any slowdown in innovation could open the door for AMD or Google, but that is years away. Nvidia is winning a race of one right now and doing so in a massive way.", "score": 14, "replies": []}, {"body": "AMD of course, Intel's Gaudi3 just came out with similar bf16 performance at a lower price, there are a range of startups too, but it is NVIDIA's own customers who are the big risk to them.\n\nNVIDIA could see a quarter of their market evaporate over the next few years as the hyperscalers all deploy their own chips to avoid NVIDIA's egregious markups.", "score": 4, "replies": [{"body": "Not the trend we are seeing at all, google amazon and meta are buying as much Blackwell as they can, it’s still cheaper for them to pay a huge amount for Blackwell chips because they are so efficient in their computing power.  At this point they are only making their own chips because they want more than what they can get their hands on from NVDA alone.", "score": 3, "replies": [{"body": "It is not cheaper which is why they are spending billions to design and manufacture their own AI chips. You don't go to that effort if you're getting a good deal. \n\nNVIDIA chips are not more power efficient either. Compared to some they have the advantage of using TSMC's leading edge production systems but not always. Meta's MTIA2 uses TSMC 5nm which is an advanced node. Almost the same as the 4nm process used for the H100/200. \n\nBut NVIDIA makes relatively general purpose chips compared to the bespoke chips custom designed for specific workloads. NVIDIA even still calls these parts \"GPUs\" and they contain a lot of logic which won't be used (how often do people use the JPEG decoders on an H200?). \n\nBut there's a lot more to overall efficiency than just which node your chip uses. These large companies are custom designing end to end solutions from the rack, server, chip, compiler to network stacks.  They can get much better total efficiency even if the AI chip is fabbed on a node one or even two generations behind.", "score": 1, "replies": [{"body": "Two h100s stuck together would be h100^2. Exponents. 😂🙈", "score": 2, "replies": [{"body": "Linear scaling doesn't exist.", "score": 1, "replies": []}]}, {"body": "Simply wrong lol.  The compute power advancements of Blackwell are exponential, Moore’s law is being thrown out the window by the positive feedback loop of NVDA creating an AI chip making chatbot that is an extremely effective tool at accelerating compute for the next generation.  The hump from Hopper to Blackwell is insane, and Blackwell to Rubin will be too, a trend nobody has a realistic means of keeping up with.", "score": 5, "replies": [{"body": "Nothing exponential about it. Blackwell is an iterative improvement. Basically two H100s stuck together and adding support for FP4. \n\nIt's actually only 25% faster per die at more common FP8/16 data types. \n\nPerhaps check this out if you're interested in learning about it. \n\nhttps://www.tomshardware.com/pc-components/gpus/nvidias-next-gen-ai-gpu-revealed-blackwell-b200-gpu-delivers-up-to-20-petaflops-of-compute-and-massive-improvements-over-hopper-h100", "score": 0, "replies": [{"body": "# Nvidia’s next-gen AI GPU is 4X faster than Hopper: Blackwell B200 GPU delivers up to 20 petaflops of compute and other massive improvements\n\n  \nThe dual-die B200 GPU has 4X the AI training performance and 30X the inference performance of its predecessor.\n\n  \nLiterally the first two sentences at the top of the article summarizing the main takeaways.", "score": 2, "replies": [{"body": "Read beyond that. Details matter. It's only 4x when you _halve precision_.", "score": 0, "replies": [{"body": "No, it’s actually 5x when you halve precision, and because that covers most processes along with the ability to adjust workflows and level of precision, is 4x, it explains this in the fing article lmao", "score": 3, "replies": [{"body": "I don't know why you won't just read the article but I'll copy and paste it for you..\n\n\"That’s an interesting point that again goes back to the lack of massive improvements in density from the 4NP process node. B200 ends up with theoretically 1.25X more compute per chip with most number formats that are supported by both H100 and B200.\"\n\nThey get around that by fusing two chips together and getting a 2.5x increase in performance. However, the B200 uses 1000-1200 watts which is well above the H100's 700 TDP. So you should also account for that. \n\nI hope this finally clears things up for you. \n\nFor future reference, don't take marketing claims at face value. There are always caveats you need to unravel.", "score": 1, "replies": []}]}]}]}, {"body": "Just blatantly wrong, improvements in the system architecture dramatically improve performance, on the scale of Hopper being 4,000 TFLOPS FP8 ➡️ Blackwell 20,000  TFLOPS FP4", "score": 1, "replies": [{"body": "So actually a bit beyond exponential", "score": 1, "replies": []}, {"body": "You'll want to check the article again (and NVIDIA's own published specs) because there are many caveats which go along with the bold \"20 PFLOPS\" claim. \n\nFirst off that's FP4 and you're comparing it to FP/INT8 on Hopper. So there's goes half the figure. \n\nSecondly, you are looking at *two* Blackwell dies on a GB200 package compared to one die. There goes another half of the figure. \n\nAnd we're of course looking at *sparse* FP4 figures which helps inflate things.\n\nOh, and very importantly the GB200 module pulls around 2700 Watts and isn't compatible with the SXM form factor.\n\nYou really should be comparing the H100/200 to the HGX B100/200 as this is the Blackwell architecture based drop in replacement for H100s operating in the same \\~700 watt power budget and in an SXM form.\n\nThe B200 does 9 P(FL)OPS of FP8/INT8 (@1000 watts) while the B100 does 7 P(FL)OPS (@700 watts). A leap over the 3.9 P(FL)OPS of the H100 to be sure but that's two chips fused together.\n\nSo on a chip-for-chip basis and comparing at the same power levels we get a total performance boost of .... 79.5%\n\nThat's pretty great actually but let's not kid ourselves into thinking anybody on earth is breaking physics and getting 'exponential' gains with little to no significant change to the manufacturing process. It's about what we might expect from a year and half of development and access to the cutting edge node.\n\n\n\n- [https://www.nvidia.com/en-au/data-center/h100/](https://www.nvidia.com/en-au/data-center/h100/)\n\n- [https://www.nvidia.com/en-au/data-center/hgx/](https://www.nvidia.com/en-au/data-center/hgx/)\n\n- [https://www.anandtech.com/show/21310/nvidia-blackwell-architecture-and-b200b100-accelerators-announced-going-bigger-with-smaller-data](https://www.anandtech.com/show/21310/nvidia-blackwell-architecture-and-b200b100-accelerators-announced-going-bigger-with-smaller-data)", "score": 1, "replies": [{"body": "TLDR, read your own article.", "score": 3, "replies": []}]}]}, {"body": "Your article even says 4x improvement? Lol how stoned are you? I smoke my fair share, but sheesh", "score": 1, "replies": []}]}]}]}]}, {"body": "The really exciting bit is the rise and fall of vendors who churn through tons of hardware with their VC.", "score": 2, "replies": []}, {"body": "Yeah AMD rocks for gaming rigs\n\nBoth CPU and GPU\n\nPerhaps decentralized AI might allow them to fill the gaps and cost", "score": 2, "replies": []}]}, {"body": "I like INTC at the price. \n\nIt's not just about the best company, it's...about value...which I know everyone gets, but if I was smart, I'd have divested a bit from NVDA and put some in AMD. I did that with AVGO, but there are a lot of companies that will make a lot of money and I think it'll be easier for AMD to 3X, 4X than NVDA. \n\nNVDA is going to sit between \\~110 to \\~130 between now and Q3 earnings and even then, I don't know that guidance is going to do much as they're conservative. Q4...it'll start going up, but it's Q1-Q2 F '26 where it's going to have another huge growth...IMO. I think it goes to 185-200 by then.", "score": 2, "replies": []}, {"body": "Intel is dead ☠️", "score": 1, "replies": [{"body": "How so if they're getting interest from companies wanting to buy them out?", "score": 2, "replies": []}]}, {"body": "Intel is your grand daddy's chipmaker. Lol", "score": 1, "replies": []}]}, {"body": "NVDA will not rise until the market makers are sure that retail has been sufficiently screwed. They've turned it into a meme stock and like all the others, Hold Hold Hold. It costs us nothing to hold.\n\nNFA", "score": 15, "replies": [{"body": "Holding plays into the pump and dump.....think", "score": -2, "replies": []}]}, {"body": "MU memory is needed on each device, not just Nvidia", "score": 4, "replies": []}, {"body": "Agreed. I am tired of the dimwits on eToro posting about how Nvidia investors are pure speculators. The fundamentals show it's undervalued.", "score": 10, "replies": []}, {"body": "Half of the game is waiting for analysts to adjust their expectations..", "score": 4, "replies": []}, {"body": "By the way, if this were a bubble, the numbers would be reversed. The stock price would have gone up at a higher multiple than the EPS.", "score": 9, "replies": [{"body": "🤫🤫🤫🤫\nI wanna buy more at these prices while they last", "score": 8, "replies": [{"body": "Why didn't you buy before? It was so cheap then. If you have know about ML then it was obvious that GPUs market was going to explode (may be not at the scale we are seeing now) when Google started their deep learning work.", "score": 1, "replies": [{"body": "Lol you have no idea of how long I have been investing in this company and what my average cost basis is. Sit down kid", "score": 1, "replies": [{"body": "If you have bought it since say 2016, then why buy at this price? You should have over 100K shares before the recent surge.", "score": -1, "replies": []}]}]}]}]}, {"body": "I definitely still took out my initial investment bc we are closing in on extreme greed territory.  But hey, I’m not complaining.", "score": 4, "replies": []}, {"body": "NVDIA just needs to find a way to add internal gpus to humanoids not just the AI software running from AI data centers .helping to run other parts of the machine locally for more efficiency..then we are talking another trillion dollar market 😃🤟🚀", "score": 2, "replies": []}, {"body": "AMD doesn't want to compete vs Nvidia on their high end stuff.  Intel is in shambles.  Nvidia has about 80 percent of the market in terms of AI hardware.  CEOs are begging them for the first taste of their Blackwell platform.  I'd say they are considerably undervalued right now.  \n\nI really do think Nvidia should buy Intel.  It seems like a no brainer but I'm not sure that the FCC will allow that.  I'm not a huge fan of consolidation of corporations but in terms of a selfish standpoint, eh.........", "score": 2, "replies": []}, {"body": "Overpriced. It is not a software company. Study and learn", "score": 2, "replies": [{"body": "Thanks for chiming in. It kind of IS a software company, though, with those crazy margins and a moat that is quite wide and deep with their overall lead, the ecosystem of partners and customers and the Kuda software, making it more than your typical hardware that is commoditized. THIS is the new platform for computing. It is sort of like getting the IBM PC and Microsoft in one, circa 1987.", "score": 1, "replies": []}]}, {"body": "Hedge funds pump and dump...rape the retailer (now using reddit and bots to hype up stock a retail tactic) JUST SAYING!", "score": 2, "replies": [{"body": "yeah this reads like bot post …. definitely trying to screw retail", "score": 1, "replies": []}]}, {"body": "What am I looking at here and why are these numbers important", "score": 1, "replies": [{"body": "The stock price grew by 185%. The underlying earnings per share grew by 415%. If the stock P/E ratio had remained the same, the price would also have gone up 415%.", "score": 1, "replies": []}]}, {"body": "Hard to stay on top", "score": 1, "replies": []}, {"body": "They will adjust pricing when needed", "score": 1, "replies": []}, {"body": "Never had luck with amd.  Seems I always enter  position at wrong point.  I’ll stick w the big boys for now", "score": 1, "replies": []}, {"body": "Maybe you’re new to investing. What determines if something is overpriced is the P/E ratio. At a P/E of around 30, it is considered overpriced.", "score": 1, "replies": []}, {"body": "Nvidia $200", "score": 1, "replies": [{"body": "$300", "score": 1, "replies": []}]}, {"body": "Yeah I totally agree, and then when you consider, it would be more than justified if it were overpriced, and it's kind of weird it isn't, considering it has an unprecedent prospect of growth, almost certain to occur.", "score": 1, "replies": []}, {"body": "Nvidia does 1.21 petaflops at 88 mph.", "score": 1, "replies": []}, {"body": "This whole \"underpriced\" or \"overpriced\" nonsense is just a guess. What technicals are these claims based on? Sure, if it gets too far away from a bullish or bearish EMA or something, it will correct at some point. I look at technicals and not value to determine where to go long or short. It's not like where you go around and look at cookware and say, \"Man, that's an overpriced pot.\"", "score": 0, "replies": []}, {"body": "Palantir next nvidia ?", "score": 0, "replies": [{"body": "nope.", "score": 2, "replies": []}]}, {"body": "You can not replace nvidia, you can diversify by adding MU, PLTR, AMD but nvidia is the AI king currently with a long road ahead for the others to catch up", "score": -1, "replies": []}]}
{"title": "Iam sure AMD will hit 250$ next year, should i keep investing using CFD x5? i got alot money from amd before, and iam doing it again.", "selftext": "", "id": "1fr7lhf", "created_utc": 1727502505.0, "score": 0, "upvote_ratio": 0.44, "num_comments": 44, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "*Bro is a dropshipper...*\n\nYeah, that investment in AMD is perfect! Strong company, will go to $200 EOY.\n\nNext year I'm thinking $400 at least. Go all in and don't limit yourself on the leverage if you don't want to miss out. x100 seems reasonable.\n\nIn 2026 it'll take over the semi industry and will have higher market cap than Nvidia. Good luck lil bro!", "score": 24, "replies": [{"body": "Hahahah nice one..", "score": -1, "replies": [{"body": "On a serious note however, don't do it. Half a year back AMD was trading in the $180 range for weeks and then it started to go downhill.\n\nIf you believe AMD could grow as a semiconductor company then buy shares and hold for years.\n\nIn the recent months was NO POINT at which you would've been better off buying AMD rather than Nvidia. Nvidia was making new ATHs while AMD kept declining (might not be necessarily true in the recent month or two, but that's because AMD had already fallen so much: 35% fall from ATH, while Nvidia had already gained top 1 global market cap)\n\nAs for now AMD is somewhat rising but it's only because Nvidia is rising as well.", "score": 2, "replies": []}]}]}, {"body": "You son of a bitch…I’m in", "score": 8, "replies": [{"body": "Be careful with AMD, I know that girl and she ain’t nice. She loves them 136s when things are bad and takes forever to get to the 160s.", "score": 6, "replies": []}]}, {"body": "Just buy some long running call options.\n\nI am also pretty sure AMD will go up. Recent actions taken clearly shows they finally opened their hunting season for the AI hardware market.\n\nAnd since AMD was always the number one competitor to Intel and nvidia (ever since they acquired ATI) in the consumer sector, there will be no shortcoming of a battle here soon as well.\n\nAMD seems absolutely dedicated to get some market share and the initiatives alone, independent from the actual outcome, will boost investor sentiment further and any positive progress news will let the stock surge.\n\nThat is what I expect with very high confidence.\n\nNo investment advice.", "score": 5, "replies": [{"body": "Lisa Su will get it up. ![img](emote|t5_2th52|4276)", "score": 3, "replies": []}, {"body": "Although one random week it may drop 10-20%. It's a gamble", "score": 1, "replies": [{"body": "Doesn't matter if you were already in the profit zone", "score": 1, "replies": []}]}]}, {"body": "No, on every dip you get fu\\*\\*", "score": 5, "replies": [{"body": "Should i sell now and buy on dip?", "score": 1, "replies": [{"body": "stay out of options long term. options are for quick time periods", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "HHM FTUCK, not sure but i was checking the news they got new gpus comming next year early", "score": 1, "replies": []}]}, {"body": "Absolutely", "score": 0, "replies": []}]}]}, {"body": "Investing using CFDs ![img](emote|t5_2th52|4271)", "score": 8, "replies": [{"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)🤡🤡", "score": 1, "replies": []}, {"body": "I made £10k with Cfds last week...", "score": 1, "replies": [{"body": "Not saying it won't get you some return. But usually investing is more of a long term thing, which apart from LEAPs, is not usually the end goal of derivatives or CFDs.", "score": 1, "replies": []}]}]}, {"body": "I like your surety....a little bit of skepticism might help in life!", "score": 3, "replies": []}, {"body": "Only thing you can be sure of is death and taxes", "score": 4, "replies": [{"body": "UR RIGHT!", "score": 1, "replies": []}]}, {"body": "No, you should invest using x10", "score": 2, "replies": [{"body": "ye 10% lose, and i will lose all my mone", "score": 1, "replies": [{"body": "But 100% gain and you gain 10x … depends if you want an average life or not kid..", "score": 2, "replies": [{"body": "Risk 🙁", "score": 1, "replies": []}]}]}]}, {"body": "lol god all these stocks only go up people are in for a rude awakening when the covid stimulus shock is over", "score": 3, "replies": [{"body": "LOL covid stimulus shock", "score": 14, "replies": [{"body": "Yeah remember when we printed 10 trillion dollars, I’m not referring to the shitty stimulus check you got. Businesses, banks, houses stocks, you think it’s regular for these markets to increase value 100% in 5 years. Get real.", "score": 2, "replies": [{"body": "So when does it go down market timer? I assume you have puts doomer?", "score": 1, "replies": [{"body": "When Wallstreet decides to start selling, and no- I play the market conditions as they are. I don’t put myself in positions to time major events, I take price action at face value. But I’m not a fool thinking the s&p index will just keep doubling itself every 5 years.", "score": 1, "replies": []}]}]}]}, {"body": "It’s the beginning of quantitative easing my man. That shock ended long ago and now we are finally loosening our financial belts a little and letting the markets have some juice. Globally, not just domestically.", "score": 1, "replies": []}]}, {"body": "If you are sure then why not", "score": 1, "replies": []}, {"body": "I think you should put 700k into it ![img](emote|t5_2th52|4271) you'll find out soon enough if it was a good decision or not.", "score": 1, "replies": []}, {"body": "AMD and all Semi will take a big dump before next march, I will stay away", "score": 1, "replies": []}, {"body": "Not sure why the optimism on AMD. On the CPU side, the Zen5 chips aren't flying off the shelves. With any luck, the 9800X3D will be a good chip, and offer substantial gains, as opposed to the non-3D chips released so far. \n\nOn the GPU side of things, Nvidia is eating their lunch so much that AMD has publicly noped out of the high-end consumer market. That probably doesn't bode well for the enterprise side of things either then, as those customers are willing to pay far more for the extra power.\n\nAMD is gonna have a hard time catching up to Nvidia, and it will be at least another generation of them getting curbstomped by the Nvidia parts. The 5090's only competition might be the 4090.\n\nI think AMD is in a solid position, especially with regards to the mid-to-low-end market. But the sectors that are making the money are the high end and enterprise level stuff, and that's all Nvidia. Hell, Intel might have a more compelling offering on the GPU side than AMD, if Battlemage ends up being solid. Granny might get her lick back after all.", "score": -2, "replies": [{"body": "you're regarded.  there's no money in diy.  hell, amd makes very little from *client,* let alone diy and gaming.  \n\nit's about datacenter.\n\neven nvidia doesn't give a shit about gaming.  your entire rant was irrelevant.", "score": 2, "replies": [{"body": "For revenue, yes, but isn't the stock price going to be steered heavily by \"prestige\" of the brand? Retail investors are going to know the commercial side better than the enterprise side. Or maybe I just don't appreciate the level of sophistication of retail investors today. \n\nThat said, I don't own AMD stock. It just doesn't make sense to me, given Nvidia dominates bother the commercial and enterprise sides of the market. \n\nIntel might be an interesting okay, given their price right now.", "score": 0, "replies": []}]}, {"body": "But what about the accelerator chips. That’s all amd seems to be focused on now. Letting nvda have the gaming gpu, amd must see more revenue on the ai side of things.", "score": 1, "replies": [{"body": "As another user pointed out rather rudely, the enterprise sector is the profitable stuff. But Nvidia is cur stomping the competition there too.", "score": 0, "replies": [{"body": "We know nvda is far ahead but the thing op is getting at is will amd stock go up? I think they will as they get better with their gpus and bring in more revenue.", "score": 1, "replies": []}]}]}]}]}
{"title": "9/30 Monday Nvidia is going to drop", "selftext": "[deleted]", "id": "1frmqr1", "created_utc": 1727553525.0, "score": 0, "upvote_ratio": 0.25, "num_comments": 48, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 14 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "The head and shoulders upside down ballsack pattern is telling me the same!", "score": 40, "replies": [{"body": "Can confirm the relative strength index of his balls being stretched by bollinger bands. Punctuated by the level of support with his autism and resistance to logic.", "score": 7, "replies": []}, {"body": "That pattern is called The Hangman's Sack... If you didn't know that you belong here....", "score": 6, "replies": []}, {"body": "I like this indicator, also eliminates unnescessary dander risk.", "score": 2, "replies": []}, {"body": "https://preview.redd.it/10w3ibg3wmrd1.png?width=1289&format=png&auto=webp&s=daf0a326d601ef77b37b2069aaf303548d97246b\n\nLive look at OP undertaking his anal-ysis", "score": 2, "replies": [{"body": "💀![img](emote|t5_2th52|4271)💀![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "Similar to my fav gay terrorist porno series Anal-Isis", "score": 2, "replies": []}]}]}, {"body": "Sounds like you bought some Puts…", "score": 32, "replies": [{"body": "Sounds regarded. I see a bunny pattern in the minute by minute trading from Friday afternoon when prices are adjusted for volume flux which means there's a 82,4% chance of a lower close on Monday volititality wise.", "score": 14, "replies": [{"body": "Either you're trying to be funny or you're funny.", "score": 9, "replies": []}]}, {"body": "I did i bought 2 contracts", "score": -4, "replies": []}]}, {"body": "Thinks for the jinx. All in all calls", "score": 12, "replies": []}, {"body": "The SMCI shit has teeth.", "score": 5, "replies": []}, {"body": "Bro I have somewhere to go, just put the fries in the bag", "score": 5, "replies": []}, {"body": "oh your TA says so? damn it's over nvda 60 incoming. unlucky i guess ![img](emote|t5_2th52|4260)", "score": 3, "replies": []}, {"body": "Everything red next week", "score": 6, "replies": [{"body": "With the east coast shipping strikes going on, too, yeah probably going to be a red week.", "score": 1, "replies": [{"body": "Except they have until the 30th to sign the new contracts. Strikes wouldn't begin until the 1st. Green Monday.", "score": 3, "replies": []}]}]}, {"body": "* NVDA's autumn pullback was at lowest around October 10th last year\n* Iran is preparing retaliation for attacks on Lebanon\n\nI can see that. Which means there is going to be the exact opposite.", "score": 4, "replies": [{"body": "So I’m inversing the inverse of your inverse.. got it.. wait so puts?", "score": 1, "replies": []}]}, {"body": "Thank god you are here ! I was going to hang on since it made me millions but sell all at open now 👍", "score": 2, "replies": []}, {"body": "Okay now what", "score": 1, "replies": []}, {"body": "Awctwally 🤓👆 my tewchnical analysis says there is going to be a big drop!! (he found a simple divergence on the 10minutes chart)", "score": 1, "replies": [{"body": "Uhhh, thats a bullish divergence.", "score": 1, "replies": []}]}, {"body": "Calls it is ![img](emote|t5_2th52|4275)", "score": 1, "replies": []}, {"body": "That you are gay", "score": 1, "replies": [{"body": "Lol we will find out next week if I am or I ain't", "score": 1, "replies": []}]}, {"body": "Well, ok, I'll buy a put on nvda next week", "score": 1, "replies": []}, {"body": "This is like a NVDA bear heaven in here lmao. Yes it will drop by like a few dollars congrats, long holders don’t gaf", "score": 1, "replies": [{"body": "You make money if you bought puts thoooo it's swing trading", "score": 1, "replies": []}]}, {"body": "Does RSI stand for Relative Shit Indicator? If so than I’m sure your TA is correct OP", "score": 1, "replies": [{"body": "Haha we will find out on Monday man! Come back and give me a thumbs up if I am right thumbs down I am wrong.", "score": 1, "replies": []}]}, {"body": "seems about right. everyone bulled up now", "score": 1, "replies": []}, {"body": "You looked at RSI (on a non specified time period) and have concluded that NVDIA will drop.\n\nQuality analysis.\n\nI'm guessing you have a 50% chance of being right.", "score": 1, "replies": [{"body": "Oh sorry I have not been specific. I used the one day time frame and I use rsi alternative.", "score": 1, "replies": [{"body": "You might want to look st more indicator than one and more time frame than one.", "score": 1, "replies": [{"body": "See my new repost", "score": 2, "replies": [{"body": "I'm not trying to be a dick but my point is that your analysis is about and basic and fundamental as you can have.\n\nThere's a lot more to learn. \n\nYou're not wrong about your RSI conclusion. But you want A LOT more data to work with before you try and make a definite call on a stock.", "score": 1, "replies": []}]}]}]}]}, {"body": "Hope it does so I can buy some ubder 120. The bigger it cakes it's pants, the better.", "score": 1, "replies": []}, {"body": "yea maybe but eom buying will likely occur so any dips will be bought up real quick", "score": 1, "replies": []}, {"body": "I think so as well, possible head n shoulders on daily. You can see it on a few mag7s", "score": 0, "replies": []}, {"body": "I think it's due.   Couldn't help but notice you didn't post your TA.", "score": 0, "replies": []}, {"body": "Likely will be red well time to buy puts", "score": 0, "replies": []}, {"body": "Anyone selling this early is straight goonin", "score": -2, "replies": []}]}
