{"title": "NVDA Tendies am i right?", "selftext": "", "id": "98bpqp", "created_utc": 1534599296.0, "score": 48, "upvote_ratio": 0.86, "num_comments": 69, "comments": [{"body": "Fuck I forgot this event. Yes you are buying FDs for this hype. ", "score": 28, "replies": [{"body": "1. Name checks out. \n2. Bought 9/21 260C yesterday at close", "score": 13, "replies": [{"body": "250 leaps here. Hoping for tenedies. But I bought a bitch play because I've been betrayed too much.", "score": 8, "replies": [{"body": "Leaps may be bitch plays but all of the money I've ever lost on options has come from weeklies/monthlies. I've never lost money betting on ITM or slight OTM options more than 6 months out.", "score": 4, "replies": [{"body": "For the sake of my MU 55 2019 Junes I sure hope so.", "score": 2, "replies": []}]}, {"body": "Don’t doubt papa Jensen, he take u to the promise land", "score": 4, "replies": [{"body": "\\*unless you bought FDs for ER", "score": 2, "replies": [{"body": "Papa Jensen said don’t play Er and u did, not his fault", "score": 3, "replies": [{"body": "I didn't. I headed his gospel. May he deliver tendies unto me.", "score": 2, "replies": []}]}]}]}, {"body": "With the fact that it dropped 5% in AH and continued to drop the next day I’d say that there’s a much higher chance for it to go up Monday than not. But idk tho", "score": 1, "replies": []}]}, {"body": "What if it really is...Lisa..?", "score": 1, "replies": []}]}, {"body": "got 11x 247.5C 08/24 for 2.71 avg  \nI am ready for the tendies", "score": 1, "replies": []}]}, {"body": "If this info has already been leaked and is public info doesn't that mean it's already\n\n\nP R I C E D I N\n\nR\n\nI\n\nC\n\nE\n\nD\n\nI\n\nN", "score": 22, "replies": [{"body": "If you take a peak over at r/nvidia or any PC subreddit you'll see these cards were expected for months. I don't think people understand the sheer amount of people waiting for new cards to drop. Right now all we have is rumors on performance. General thoughts was that the 20 series wasnt going to be the leap that the 10 series brought. But if these rumors are true that the 2080ti is releasing same time as the other cards and if the performance rumors are true then they will sell a metric fuck ton providing they're available. I doubt the price will go back to what it was Thursday at close. But my tendies are praying for at least a 2-3% gain by Tuesday with this event.", "score": 4, "replies": []}, {"body": "On Sat tho?", "score": 2, "replies": []}]}, {"body": "I can run Reddit at 25fps with my 1060. Short NVDIA", "score": 13, "replies": []}, {"body": "wtf is it 2080 and not 1180?", "score": 6, "replies": [{"body": "Im assuming they are trying to make it a completely new gen. Idk what its gonna provide to try and justify it but who knows.", "score": 2, "replies": [{"body": "New architecture (Turing) and also no longer going by GTX but instead by RTX because of the real time ray tracing that is being hyped to be a game changer. Leaks put the 2080Ti at 30% more powerful than the 1080ti, 70% more powerful than the 1080.\n\nI’ve seen speculation it’ll manage 4K 144hz ", "score": 9, "replies": [{"body": "Damn. That’s actually impressive.", "score": 5, "replies": [{"body": "It's a pretty normal performance increase.\n\nSpecially when they're still just rumors.", "score": 1, "replies": []}]}]}]}]}, {"body": "So you’re saying there’s hope for my 8/24 Cs that bent me over a barrel after earnings?", "score": 4, "replies": [{"body": "I mean if you bought 250s maybe. I doubt this does much other than pushes for a green day. Not gonna go crazy. My hope is to see a mon/tues bump to make up most of the dip. \n\nThat all depends if the analysts were dumb enough to not realize these were coming when the earnings call discussed new cards coming very soon", "score": 4, "replies": [{"body": "I bought the 247.50s for 8/24 at 3.7s when it was 245-246, only to drop below 244 stock price at the end of the day....", "score": 1, "replies": []}]}, {"body": "$300! Soonish!!", "score": 1, "replies": []}]}, {"body": "With the huge decline in mining, how well do you think these things will sell?", "score": 10, "replies": [{"body": "Every big PC gamer i know upgrades graphics cards with every new gen release. Its kind of like their dick measuring contest. \n\n\"Yeah my new GTX 2080 run RedDead2 on ultra high at 60fps no problem\" ", "score": 40, "replies": [{"body": "at 144fps*", "score": 24, "replies": [{"body": "In 4k resolution!", "score": 12, "replies": [{"body": "Don't forget about their 3 monitors", "score": 5, "replies": []}]}]}, {"body": "My 2 year old GTX 1080 plays everything on Ultra at 60fps, and it probably won’t need to be replaced for another 2 years unless certain games suddenly force me to go to High or god forbid Medium settings. The 1070/1080 really was a game changer when it came out. It made zero sense to buy any other card. ", "score": 4, "replies": [{"body": "I tried to run monster hunter world in 4k at max settings on my 1080. Didn't work out.", "score": 5, "replies": [{"body": "He doesn't want to admit he needs that 2080 for elite gaming. Probably doesnt even have an Ultrawide monitor with HDR and 4ms/12-hz. \n\nNoob. ", "score": 7, "replies": [{"body": "nah, he's too busy spending his money on more sensible things, like MU $70 8/31 calls.", "score": 11, "replies": [{"body": "I lose money exclusively on ATVI calls. It’s a great gold sink.", "score": 1, "replies": []}]}, {"body": "I see vagina is not going to be diverting your resources, ever...", "score": -1, "replies": [{"body": "Yeah you're mom lets me get it whenever for free... ", "score": 2, "replies": [{"body": "Well my mom is my dad, so you're gay.", "score": 1, "replies": []}]}]}]}]}, {"body": "C'mon. Im not saying the new gen is necessary but you game devs are gonna push shit out just to test the 2080. It happens every gen and itll happen here too. \n\nIm not saying this is earth shattering for gaming, im saying analysts and the market are gonna buy/raise NVDA early this week on the news. ", "score": 4, "replies": []}, {"body": "60fps. LoL. I’m guessing you don’t play any competitive games. And if so, you are bronze as fuck.", "score": 4, "replies": []}]}, {"body": "There is no official indication that Red Dead 2 is coming to PC", "score": 2, "replies": []}, {"body": "Yeah fair enough. I just think the mining industry set unrealistic expectations for future sales. I could very well be wrong I am just learning. ", "score": 2, "replies": []}, {"body": "Gamers were a lot more price sensitive than miners ever were.", "score": 1, "replies": []}]}, {"body": "These will fly off the shelves, the nvda cards now are 2 years old already. ", "score": 2, "replies": [{"body": "Good point. ", "score": 0, "replies": []}]}, {"body": "As well as they had before mining - which is to say very well. ", "score": 2, "replies": []}, {"body": "Anyone that purchased the 1080 or 1080ti for mining is an idiot. That is not the market for these cards.", "score": 3, "replies": [{"body": "I know a guy who bought 40 of them and nearly had me buy 20 from Amazon. Luckily Amazon cancelled my order due too insufficient available stock...... I thank God every day actually. ", "score": 6, "replies": [{"body": "What were you trying to mine? ", "score": 1, "replies": [{"body": "A grave for his ROI.", "score": 7, "replies": []}, {"body": "[removed]", "score": 3, "replies": []}]}]}, {"body": "If you bought them last summer when the AMD card were out of stock you'd have made a good return on the 1080ti's due to the core intensive algorithms.\n\nSure it was a little less profitable than AMD, but they take up less space since there's way more perfomance in each rig and the real kicker *you could actually buy them, and at below MSRP before the general miners caught on.*\n\nAnd the resale value of the 1080ti's would be better if you already sold some off to the gamers. Might even have gotten what you gave for some of them a few weeks ago.", "score": 1, "replies": []}]}]}, {"body": "2080 ... $280.... soonish", "score": 3, "replies": []}, {"body": "Hey /u/TaylorLH your post is now on the [WSB DD list. Click here to read more DD.](https://new.reddit.com/r/wallstreetbets/search?sort=new&restrict_sr=on&q=flair%3ADD).\n\nIt's important that anything marked DD is useful information for other traders. No shitposts, short and vague guesses, unexplained news links, etc. If you misused the flair please change it so people don't come here and be disappointed. You might be banned otherwise.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Hell ya brother ", "score": 1, "replies": []}, {"body": "My sold puts executed, so fuck it. I'm in for this ride.", "score": 1, "replies": []}, {"body": "Arent these the ones only professionals buy because that cost like 9000$?  Normal people don't buy that shit.\n\nEdit: lol, You fucking sheep.", "score": -3, "replies": [{"body": "Quadro series are proceed between 300 and 15000 depending on what bracket of performance the card is in.", "score": 0, "replies": []}]}]}
{"title": "I bought stock for a company that lets users watch unlimited movies for just $9.99 per month, but it plummeted this last month.", "selftext": "What was I thinking? I thought it was probably too good to be true. I mean what company can be profitable by charging users just $10 for unlimited movies?\n\nAnyway, stay away from $NFLX", "id": "98fwaf", "created_utc": 1534634724.0, "score": 535, "upvote_ratio": 0.95, "num_comments": 70, "comments": [{"body": "Booooooo", "score": 239, "replies": [{"body": "I swear if you guys rip on me 13 or 14 more times, I'm outta here", "score": 361, "replies": [{"body": "Oh man, I haven't seen Baseketball in years.", "score": 79, "replies": []}, {"body": "My favorite line in that movie", "score": 25, "replies": []}, {"body": "1) You suck OP!", "score": 4, "replies": []}, {"body": "Out!", "score": 1, "replies": []}, {"body": "Faggót", "score": -4, "replies": [{"body": "Faggœt", "score": 14, "replies": []}]}]}]}, {"body": "A standard Netflix sub is $11 you fag.", "score": 167, "replies": [{"body": "There's a thin line between success and failure. ", "score": 61, "replies": [{"body": "If only MoviePass knew they just had to charge 1$ more", "score": 59, "replies": []}]}, {"body": "Cancelled Netflix.\n\nRunescape now my $11.", "score": 17, "replies": [{"body": "All in on Jagex leaps", "score": 5, "replies": [{"body": "blue party hat futures are on the move!", "score": 3, "replies": []}]}, {"body": "11 fucking dollars? I remember when it was 5\n\nWhy does jagex deserve 11 dollars a month to pump out bullshit no oneever wanted\n\n07scape for life", "score": 3, "replies": [{"body": "It's all 1 subscription. $11 gets you RS3 and OSRS", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.0805  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/10153)", "score": 1, "replies": []}]}]}]}]}, {"body": "Wasn’t it less than $7 when they started movie streaming? ", "score": 8, "replies": [{"body": "They've been gradually jacking up the rates. ", "score": 5, "replies": []}]}, {"body": "It was close enough... this post really had me for a minute... HMNY lost a lot of people much more money than netflix", "score": -7, "replies": []}]}, {"body": "It's all about controlling your distribution stream.  \n\nRIP HMNY.", "score": 34, "replies": []}, {"body": "But they have commercials now at no additional charge", "score": 23, "replies": [{"body": "\"We bring you the traditional TV-like experience you tried to escape at no additional cost!\" ", "score": 24, "replies": [{"body": "I wonder how much the Netflix idea men get to figure out how to make the content shittier all while charging their customers more for it. Sounds more like a job for WSB to me. We can figure out all sorts of ways to fuck those customers for tendies.", "score": 11, "replies": [{"body": "Close to $450k/yr last I checked", "score": 2, "replies": [{"body": "Bam, see we can take that money and make that company way shittier. That's all the big network execs do on TV. The cancel the good stuff, and keep the garbage. We can do that!", "score": 1, "replies": []}]}]}]}, {"body": "They do? How does that work?", "score": 1, "replies": [{"body": "You just watch whatever show on there you want to watch and there's now a good chance random commercials will show up. After people decide they hate them, they'll up the subscription fees another 2 or 3 bucks to make it all stop. At least that's what I think they're going to do.", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 72, "replies": [{"body": "They have One Punch Man. All you need to know. ", "score": 16, "replies": [{"body": "I didn’t know they made an anime about Johnny sins", "score": 8, "replies": []}]}, {"body": "Roman Empire is good check that one out", "score": 5, "replies": [{"body": "Can verify. Similar to those dramas like Medici or Marco Polo but it's in a sort of hybrid format of half-documentary/half-drama. They even bring in historians to describe the events. The format took some getting used to but I feel like the 'breaks' between the drama/historical side are paced better in later episodes than earlier ones.", "score": 3, "replies": []}, {"body": "Just finished binging two seasons. Really great docuseries on how to be a cunt (Commodus) and how to yolo an empire (Caesar). Would recommend ", "score": 2, "replies": []}]}, {"body": "No tendies for you", "score": -5, "replies": []}]}, {"body": "NFLX puts it is", "score": 20, "replies": [{"body": "Netflix to the Earth's core?", "score": 7, "replies": []}, {"body": "Calls bruh. The ad announcement is good for shareholders", "score": -8, "replies": [{"body": "If they enabled the ads, its pretty much done", "score": 6, "replies": [{"body": "Yeah but not right now. We can ride this ad wave first", "score": 2, "replies": []}, {"body": "No it's not. What else are ppl going to switch to? ", "score": 3, "replies": [{"body": "There are plenty of competitors.  One of the reasons NFLX is dropping is because they are posting disappointing results even *before* Disney launches their service. ", "score": 6, "replies": [{"body": "What other competitors are there that don't show ads? Is Disney not going to show ads?", "score": 1, "replies": [{"body": "Why are you so focused on ads?  You do realize this ad thing isn't as prevalent in real life as here on reddit. \n\nNflx can't survive for long, this year alone there are 8 billion reasons why. ", "score": 0, "replies": [{"body": "What do you mean why am I focused on ads? That is literally what the comment I was replying to stated. Ads. ", "score": 4, "replies": [{"body": "Yeah I know but I'm another guy (I didn't make that comment) and I don't exactly agree with that comment either I.e. the reaction is more bark than bite. \n", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Funny how a lot of people don't understand how this post is meant as a joke", "score": 19, "replies": [{"body": "Your literaly speaking to autism anonymous in subreddit form... ", "score": 16, "replies": []}]}, {"body": "Send them back for a refund without rewinding them.", "score": 6, "replies": []}, {"body": "So you telling me liquidate my NFLX positions and put it into HMNY?", "score": 4, "replies": []}, {"body": "There are many ways Netflix can expand. Charging more than $10 a month is not the only answer.", "score": 14, "replies": [{"body": "Netflix dating? Match you up based on movie and show preference.", "score": 37, "replies": [{"body": "Netflix and chill section?", "score": 30, "replies": []}, {"body": "Ew I don't want to date a fuckin weeb", "score": 54, "replies": [{"body": "Say what you will, but if you can find a weeb chick that's remotely attractive, it's worth a try... you'll feel disgusted with yourself like a degenerate pervert, but in a good way. ", "score": 2, "replies": [{"body": "My girlfriend is a hot mega weeb girl. 10/10 would recommend as long as you don't mind occasionally having to sit through random videos and songs from Touhou.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 19, "replies": [{"body": "90% of people could do worse than a clean-but-boring lady who loves The Office.", "score": 5, "replies": []}]}, {"body": "Wsb dating?", "score": 1, "replies": []}]}, {"body": "He’s ripping on moviepass", "score": -4, "replies": []}]}, {"body": "/r/wallstreetjokes", "score": 3, "replies": []}, {"body": "Honestly though I lost a lot on $NFLX though lol bought at $360 just glad I didn't buy at $400+", "score": 3, "replies": []}, {"body": "A+", "score": 3, "replies": []}, {"body": "I dumped $NFLX at $190, after it hovered there for months. Kicked myself looking at it's over $400 peak. I still think my logic was sound. Netflix keeps getting crappier and more expensive, keeps wasting money producing garbage shows, and the competition keeps getting more fierce. Definitely feels overvalued. ", "score": 1, "replies": []}, {"body": "Lol I hope to help your shares", "score": 1, "replies": []}, {"body": "yeah hey why is netflix down so much right now?", "score": 1, "replies": [{"body": "recession", "score": 1, "replies": [{"body": "Let's start a recession, raise monthly Netflix membership by 1$.  Go nflx straddles", "score": 1, "replies": []}]}]}, {"body": "Let's ride the ad wave to the moon, PUT NutFLuX in it's place.", "score": 0, "replies": []}, {"body": "NFLX is profitable you cuck", "score": -2, "replies": []}]}
