{"title": "Absoluely pathetic", "selftext": "[removed]", "id": "1fqxhd7", "created_utc": 1727469372.0, "score": 0, "upvote_ratio": 0.25, "num_comments": 23, "comments": [{"body": "Low quality post by a league of legends player that’s heavily invested in GME. Go away kid.\n\nConsider this your first and final warning. Anymore junk posts like this and it’s a ban", "score": 1, "replies": []}, {"body": "Cannot tell if troll or idiot", "score": 9, "replies": [{"body": "Or a shorter \n\nIts hard to know for sure these days", "score": 2, "replies": [{"body": "Or a day trader", "score": 0, "replies": []}]}, {"body": "Both 😂", "score": 1, "replies": []}]}, {"body": "Calm down bro. It’s up over 140% YTD.", "score": 15, "replies": [{"body": "It's also been up 303,275% since 1999.", "score": 2, "replies": [{"body": "Damn I should’ve been buying NVDA in 99 instead of sucking on my moms titty 🤦‍♂️", "score": 4, "replies": []}]}]}, {"body": "Let me guess, you bought your stocks in June 2024, and now you are crying? Lmao", "score": 12, "replies": [{"body": "Many people did.", "score": 4, "replies": []}]}, {"body": "Same people were talking like this when it was basing under $500 in 2023.\n\nThe fundamentals have grown exponentially since then and it’s trading at a cheaper valuation that it was at that time. \n\nAMD is +18% YTD. So get a fucking clue and buy.", "score": 3, "replies": []}, {"body": "It's setting new foundations. ", "score": 2, "replies": []}, {"body": "Q4 will be huge for NVDA, you’re making a fool out of yourself", "score": 2, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "I think it’s the institutions driving the price down because they don’t want retail involved. The moves are fast with conviction, it’s orchestrated, stay in it and you’ll be rewarded", "score": 2, "replies": []}, {"body": "Insiders selling means?\n\nIt's a myriad of reasons\nTax obligation \nClearing money for a child in college\nPre-arranged sales", "score": 1, "replies": []}, {"body": "So when are you going to sell all your shares?\n\nAnd go on vacation\n\nYou sound crazy right now.", "score": 1, "replies": []}, {"body": "Insiders sell all the time, stock is a large part of their compensation and they like having cash to live off of which requires them to sell stock.\n\nIf they sell ALL of their holdings then we have reason to panic. If they are skimming a small portion of their holdings then this is a McNothing Burger.", "score": 1, "replies": []}]}]}, {"body": "Absolutely wonderful", "score": 1, "replies": []}, {"body": "sell and go your pathetic u will be kicking yourself in the ass alot good luck", "score": 1, "replies": []}, {"body": "Have you done any DD at all OP? \n\nBlackwell demand is going through the effing roof as all of the hyperscalers follow OpenAI and convert their foundation models to Chain of Thought reasoning. The average response time of CoT models is like 10 - 20 seconds now, an order of magnitude below the sub-second response time they need to make them viable product offerings. They're all going to rip & replace their Hopper clusters with Blackwell since they offer 20x, 30x, 50x the inference performance depending on the level of quantization. \n\nHold through H1'25 or GTFO.", "score": 0, "replies": []}]}
{"title": "Nvidia dumper are back", "selftext": "Nobody knows , It's hard to predict when Nvidia will drop or when Micron (MU) will surge. Broadcom dumped .No one knows for sure when these movements will happen. thanks to Hedge fund and institutionsmanipulations, they often react to news, put code in algorithms, causing sudden drops of 5-10%.  is risky— is key to making better decisions to invest and focus on your life.", "id": "1fqpo5k", "created_utc": 1727448969.0, "score": 0, "upvote_ratio": 0.47, "num_comments": 30, "comments": [{"body": "Lots of profit taking happens on Fridays. This is pretty predictable, actually. I’m buying.", "score": 9, "replies": [{"body": "Same. Bought more calls. September is finally over after this coming Monday. October FESTTTTT", "score": 5, "replies": [{"body": "it is beer time", "score": 2, "replies": []}, {"body": "PLEASE IM PRAYING BRO", "score": 2, "replies": []}]}, {"body": "yes, MM make sure they make the most or lose the least", "score": 1, "replies": []}]}, {"body": "The whole tech sector is down today.", "score": 5, "replies": [{"body": "Not SMCI", "score": 1, "replies": []}]}, {"body": ">making better decisions to invest \n\nSo, NVDA was not a good investing decision because it is down today?\n\nI'm trying to understand your message.", "score": 5, "replies": [{"body": "Not been a good investment since June if you haven’t bought all the dips", "score": 2, "replies": [{"body": "Or, has been a good investment since 3 weeks ago.", "score": 2, "replies": [{"body": "If you’re a new comer", "score": 1, "replies": []}]}]}]}, {"body": "It’s these days where nvda goes down 3% and DJT is up 7 when I realize how the magic of the market makes perfect sense. /s", "score": 3, "replies": [{"body": "it is not magic, it is just how institutions who have a lot of money can buy and sell enough shares to control the price", "score": 2, "replies": []}]}, {"body": "its down 2% and you're crying like a fucking child.", "score": 5, "replies": [{"body": "More crying for you is coming", "score": -3, "replies": [{"body": "How would you know what their position is? Just because a stock is down for a day or a month (or up for a week), doesn’t mean that person is negative.", "score": 2, "replies": []}]}]}, {"body": "Good indicator is what’s the max pain SP for this weeks calls? That helps in indicating where the SP might land", "score": 1, "replies": [{"body": "Where can you see max pain for each stock?", "score": 1, "replies": [{"body": "https://swaggystocks.com/dashboard/options-max-pain/SPY\n\nHere’s a daily good - free website", "score": 2, "replies": [{"body": "Thanks", "score": 1, "replies": [{"body": "No probs. Pinged you over a Reddit post where that link came from. Interesting stuff", "score": 1, "replies": []}]}]}]}]}, {"body": "Many Fridays puts print money across the market because people take profits from the week.", "score": 1, "replies": []}, {"body": "Nvda going back to 127\nEnd of next week", "score": 1, "replies": []}, {"body": "Remember the market is at record high, so it’s more challenging for NVDA to keep going up. I’m glad that it’s sitting at 120-121 today.", "score": 1, "replies": []}, {"body": "Everyone’s dumping, you should too. Stock going to go to 115", "score": -10, "replies": [{"body": "🤡", "score": 4, "replies": []}, {"body": "What is the reason?", "score": 0, "replies": [{"body": "Taking profits after a week long run up. Duh", "score": 2, "replies": [{"body": "Or just hold through either way", "score": 0, "replies": []}]}]}, {"body": "Shill Bot", "score": 0, "replies": []}]}]}
{"title": "What are my options when it comes to picking a stock, why NVDA?", "selftext": "There is NVDA and then there is AAPL.\n\nIs my risk lower going with AAPL? or is the risk the same regardless what stock I chose?\n\nI want growth, even if it means more risk. What are the chances NVDA goes to $90 a share again?", "id": "1fr0xyv", "created_utc": 1727479224.0, "score": 0, "upvote_ratio": 0.31, "num_comments": 31, "comments": [{"body": "How’s that Costco stock doing?", "score": 5, "replies": [{"body": "Up 36% YTD", "score": 1, "replies": []}]}, {"body": "What new tech or upcoming innovation is there with Apple?", "score": 3, "replies": [{"body": "Nothing..", "score": 3, "replies": []}, {"body": "Who knows.  THey'll come up with something ..", "score": 1, "replies": []}, {"body": "Just the Siri upgrade", "score": 1, "replies": []}, {"body": "First one since 2018", "score": 1, "replies": []}]}, {"body": "All signs point to maybe. NVDA is on the precipice of being the hardware leader of a new tech revolution, densified data centres and insatiable demand they barely keeping up with. AAPL sell overpriced luxury goods. You want safe or do you want growth (risk)", "score": 5, "replies": [{"body": "Growth means more banskis right", "score": 1, "replies": []}]}, {"body": "If you're asking these questions, you shouldn't be picking stocks, but rather just buying an index like qqqm and or vti.", "score": 2, "replies": []}, {"body": "There’s clearly a disconnect here. \n\nOne is a hardware company and the other is an innovator in the next tectonic shift of compute.", "score": 3, "replies": []}, {"body": "Have you ever opened any of their financial statements?", "score": 1, "replies": []}, {"body": "It's a gamble. This AI thing might take off and be the new Internet in terms of impact, buying NVDA today might be like buying AMZN in 2000.\n\nOr, it might end up being a bust, and NVDA goes back to being just a regular really good company that makes cards that are in high demand. You won't lose everything but you would be buying at a high that takes forever to get back to. Buying NVDA today might be like buying MRNA in ~~2020~~ 2021 _(edit: date)_.", "score": 1, "replies": [{"body": "So NVDA 2000 got it thanks.", "score": 3, "replies": []}]}, {"body": "Apples PEG is well over 2 now. And they just got served by META. Currently, META is trading at the best PEG, 1.1 last I looked. With AMZN and NVDA trading around the same.\n\nYou don’t want a high PEH for growth. \n\nYou kids HAVE to learn valuation, AND technicals. \n\nFucking BUY NVDA. Jesus.", "score": 0, "replies": [{"body": "Hilarious.", "score": 1, "replies": []}]}, {"body": "actually none of these if you want growth", "score": 0, "replies": [{"body": "NVDA certainly is growing at a fast clip, it’s just no longer an aggressive growth small or mid cap.", "score": 1, "replies": [{"body": "can it 5x or 10x within 3-5 years?", "score": 2, "replies": [{"body": "That’s not the definition of growth, friend", "score": 1, "replies": [{"body": "ok, can it even 2x within 3 years?", "score": 3, "replies": [{"body": "You’re talking about aggressive, speculative investing vs growth investing.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Stock picking is for fools and has poor outcomes. You don't know anything the market doesn't (this is what you have to believe in order to believe you know something that has not been priced in (edge) and that you can beat the market), and all of the returns of the market come from the market risk premium. You are taking on additional risk by concentrating (concentration risk) so you should expect a worse outcome. Mode (most frequent) result of single-stock picking is a total loss.\n\nBut you only learn one way. Sometimes that's what it takes.", "score": -1, "replies": []}, {"body": "or amazon", "score": 0, "replies": []}, {"body": "The risk is the same no matter the stock it’s something fully known with the market there’s no way to accurately predict which way the price of tomorrow will move", "score": 0, "replies": [{"body": "I mean yes and no I would say there are some fundamentally riskier stocks than other. Like let’s say LCID to GOOG. one is trying to be successful and the other is already established as fuck.", "score": 2, "replies": []}, {"body": "This is not the case.  I’m invested in NVDA, not Apple, but NVDA is far more risky (as is TSLA).  But there’s also a lot more upside.  \n\nIt’s not an obvious choice.  It depends on suitability for volatility and risk.", "score": 1, "replies": []}]}, {"body": "Buy an indexed ETF like VTI ", "score": 0, "replies": []}, {"body": "tell me you wanna get rich quick without telling me you know nothing about the stock market", "score": 0, "replies": []}, {"body": "Nvidia $205", "score": -2, "replies": []}, {"body": "Nvidia $200", "score": -7, "replies": []}]}
{"title": "4 years of investing, with very little income, solo income, two dependents. ", "selftext": "I don't make much money, $45,000 on a good year. I haven't been able to deposit almost any money into the stock market this year. It's actually been a terrible year for me outside of the stock market. I got an auto loan and I'm just barely squeezing by.\n\nHowever I just wanted to show my growth. I started out with $2,000. And I've deposited a total of $29,000. I've learned some lessons, and if I held onto certain positions I had, I would have probably $250,000 or more. Tesla, Nvidia, Carvana. All positions I had at one point, and I was in very low but sold almost immediately after. \n\nAnyways it looks small, but that large dip in the middle was absolutely brutal for me, but to be honest it didn't weigh on me much. Because I believed in myself. I was down around 60% at it's worst I believe.\nEasy money for me was mostly Netflix and Meta, when they crashed it was the easiest and most obvious money I'd ever seen. I did the same with PayPal but unfortunately it took much longer and I'm only barely starting to see the fruits of my labor regarding that one. \n\nWorst stocks I owned, Snapchat and Alibaba. ", "id": "1fqodco", "created_utc": 1727445520.0, "score": 391, "upvote_ratio": 0.96, "num_comments": 41, "comments": [{"body": "Perfect. You are doing amazing and being very diligent with saving. I'm about in the same situation sounds like. 2 kids single mediocre income. What does your portfolio look like? Like percentages in each stocks. Any mutual funds?", "score": 34, "replies": [{"body": "Just one kid. I just meant my wife doesn't work. I just sold all of my Netflix shares the other day for $7,850. I bought back two more shares just in case it keeps climbing. I'll reinvest back into it, if it falls. But I plan on investing heavily into SharkNinja. I put about $3,500 into that a few weeks ago.\n\nAnyways in size it goes: \n\nCash:$6,100\n\nPayPal: $8,000\nShopify: $7,500\nAmazon:$5,375\nSharkNinja: $3,500\nNike: $3,100\nGoogle: $2,600\nNetflix: $1,400\nRobinhood: $1,400\n\nI have maybe $1000 more spread across a few more risky stock picks that could 10x, but are more risky.", "score": 12, "replies": [{"body": "Right now if you get gold for 5 bucks a month you can get cash sweep on that cash of like 5% or 25 about a month (20 net). Good job!", "score": 4, "replies": [{"body": "I have gold. And I have the gold credit card. Gold is only 4.25% right now, I believe they lowered it.", "score": 2, "replies": [{"body": "How’d you get the gold credit card?! I’ve been waiting for months! Do you only get it if you get those referrals?\n\nThey also lowered your margin rates to 6.25% unless you plan on borrowing 50 million 🥴", "score": 3, "replies": [{"body": "I got it as well with no referrals. And no just a gold member who waited a few months on the waitlist. Its awesome for passive investing", "score": 3, "replies": [{"body": "He may be confusing it with the solid gold card. I tired but I couldn't even get my mother to do it for me 😭🤣", "score": 3, "replies": [{"body": "[removed]", "score": 1, "replies": []}]}, {"body": "Ok how do you get that bad boi?! I want i…. I’ve been waiting since it first announced and before that even. Maybe I just need to be more patient", "score": 2, "replies": [{"body": "I’ve been waiting for 6+ months now, everyone I know got theirs 3-4 months ago. Emailed support, my state isn’t on the “pending/blocked” list. It sucks, by the time I’m off the waitlist it’ll be nerfed.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Robinhood is blowing up the last year. Wish I would have put in 300", "score": 3, "replies": []}]}]}, {"body": "If this is your only savings account, I highly recommend VOO for long-term consistent growth.", "score": 5, "replies": [{"body": "Thanks, I'll check it out. It's tough. I'm very good most of the time, Netflix and Meta Im up nearly 200%. The problem is not putting all my eggs in one or two baskets. So, thus creates lower returns.", "score": 1, "replies": [{"body": "Yes, putting a large percentage into VOO is very boring, but the data shows it’s effective. It should be the majority of your portfolio typically. Then you’re investing into the top 500 companies…very diversified.", "score": 6, "replies": [{"body": "VOO is my largest investment as it is stable and yields a very high %. ", "score": 1, "replies": []}]}, {"body": "No offense but I think you should examine if you are actually very good most of the time. Buy and hold QQQ is up 80% in the last 4 years. You could have done almost twice as well by simply buying the nasdaq.", "score": 4, "replies": [{"body": "People make bad trades. My biggest mistake was not realizing PayPal would take years to recover. And I cost averaged down. I have $10,000 stuck in that damn stock.\n\nSaying \"very good\" was a stretch. I meant I'm decent.\n\nAlso, just fyi it's not like I had $29,000 from the beginning. So calculating returns isn't as simple. I made numerous deposits of varying amounts.\n\nThe PayPal was in like late 2021 or 2022. \n\nI deposited almost $10,000 more in late 2023. \nSo most of my profits are from a very small amount of money. And/ or haven't been invested for 4 years. If you get me.", "score": 1, "replies": []}]}]}, {"body": "As do I.  I have gotten between 24% - 33% on VOO over just 2 years. Also VTI total stocks is at 42%. Buy both and hold forever. Add to your positions a few times a year or during a dip. ", "score": 1, "replies": []}]}, {"body": "What app are you using to invest?\nI’m a single mom and seeing your post gives me hope and desire to invest as my IRA is sitting, rotting away bit by bit and not earning anything", "score": 4, "replies": [{"body": "You have 2-3 options in my opinion.\n\nBuy level by level price on SPY QQQ or SCHD. Like a grid bot. 10 levels price below the actual price. 🤷\n\nOr you try to beat the market (ver very difficult) buying some strong stocks oversold or undervalued like :\n\nSTLA (Mercedes BMW)\n\nALB (LIT etc)\n\nPharma like CVS WBA (super risky)\nPFE \n\nLuxury stocks. Kering ... Or some ETFs\n\nEnergy stocks (Energy World ETF, or XLE)\n\nSome ideas... Thinking loud 🤷", "score": 5, "replies": []}, {"body": "Throw IRA into target date fund if not experienced at the very least. No management needed there.", "score": 3, "replies": []}, {"body": "Don't mess with retirement accounts. I would focus on your own personal account first. I'm not sure how old you are, and I don't know the penalties off the top of my head for IRAs (Depends on which one I believe). Anyways, I'm using Robinhood. It's an amazing brokerage, amazing app, and they now even offer a great credit card with 3% cash back on everything, they also give you 4.5% interest on your uninvested cash with Robinhood gold. \n\nAnyways, I am not a financial advisor so remember not to take my word. But I can tell you what I know. Investing in the S&P 500 is slow, and in my opinion if you ever want to retire and you know your income is low, you need to be aggressive. This means you should not solely invest in the S&P 500 because if you do, you'll never reach your goals. You can still play it very safe by just investing into the companies you already know. For example, Microsoft, Apple, Amazon, Google, Netflix, Meta (Facebook). By investing into those 6 companies, (equally distributed) and on a monthly basis. This will give you the highest, safest returns in my opinion. Here's the reasons: these companies aren't going anywhere, and they have almost ALWAYS beaten the overall market by either a small margin, or usually a significant amount. Spreading your wealth among 6 stocks means no one stocks downtrend will ruin your portfolio. And investing monthly ensures you're not buying all of these stocks at the top. When drip investing you're allowing the possibilty of buying at a cheaper price. What would happen if you bought all of your stocks and the next week they fell 20%? That would suck! But when you still have cash on hand you get to benefit when stocks fall.", "score": 3, "replies": []}]}, {"body": "That's pretty good", "score": 2, "replies": [{"body": "Thanks", "score": 1, "replies": []}]}, {"body": "Awesome- love to see it", "score": 2, "replies": []}, {"body": "Keep it up!", "score": 2, "replies": []}, {"body": "Have been doing a lot of research recently on SNAP and its about to turn around imo.  Covid really distorted their growth numbers similar to Zoom.  They are finally growing beyond those numbers and will have record revenue this year.\n\nIf you are considering lowering your cost basis this an excellent time to do it.", "score": 2, "replies": [{"body": "Oh I sold that shit forever ago. Thanks for the info btw", "score": 1, "replies": []}]}, {"body": "Congrats on having the stomach to hold through that dip, and keep being diligent!", "score": 2, "replies": [{"body": "Thank you it was tough but thankfully I had invested about $10,000 during the bottom of the dip. I knew it was an opportunity", "score": 1, "replies": []}]}, {"body": "Snapchat seems like a deal at THIS moment lol", "score": 1, "replies": [{"body": "It's making lower lows, and lower highs. It needs to break above 18 and hold it.", "score": 1, "replies": []}]}, {"body": "Don’t spend it all in 1 place.", "score": 1, "replies": []}, {"body": "Looks good friend!", "score": 1, "replies": [{"body": "Thanks!", "score": 1, "replies": [{"body": ">Thanks!\n\nYou're welcome!", "score": 2, "replies": []}]}]}, {"body": "Silver", "score": 1, "replies": []}]}
{"title": "Deep dive into Manchester United ($MANU) - Rich Men's Ego Boost", "selftext": "**1.0 Introduction**\n\nBack in 2012, Manchester United became a public company, at $14/share. \n\nOver a decade later with many ups and downs, the share price is **up disappointing 18%**. For comparison, the S&P500 is up **over 300%** during the same period, and the FTSE100 is up a bit **over 40%**.\n\nThe club’s financials continue to deteriorate, and I’m sure anyone who supports a sports club has plenty of ideas about what can be done differently.\n\nThe goal of this post is to elaborate on why the club is deteriorating (financially) and how I concluded that **sports clubs are billionaires’ toys that serve to boost their egos.**\n\n  \n**2.0 How does Manchester United (or any other sports club) make money?**\n\nSports clubs generally have 3 key revenue sources and here’s what the development of each one looked like for Manchester United over the last decade:\n\n**Commercial**: £303m (vs. £189, a decade ago) - Growth of 4.8% per year\n\n**Broadcasting**: £222m (vs. £136m a decade ago) - Growth of 5% per year\n\n**Matchday**: £137m (vs. £108m a decade ago) - Growth of 2.4% per year\n\n\n\nLet’s have a look at each one separately, and in each segment, try to answer the following question: ***How much is this revenue source depending on the fans?***\n\n**2.1 Commercial revenue** consists of:\n\n1. **Sponsorship deals** with various global and regional partners - Such as TeamViewer, the main sponsor on their shirts, but also the ones shown on the advertisement boards around the field.\n2. **Merchandising, product licensing, and retail** - Club-branded merchandise, including shirts, training kits, and other apparel. It also covers licensing agreements that allow third parties to produce and sell Manchester United-branded products.\n\n***Is this depending a lot on the fans?*** Absolutely! The link to the merchandising and product licensing/retail segment is quite clear, but the sponsorship deals are also valued based on the exposure given to the companies. The more fans a club has, the more a company is willing to pay for its promotion.\n\n\n\n**2.2 Broadcasting revenue** has a comparable growth, averaging **5% per year**. Apart from the revenue share of the matches (Premier League, Champions League, and other competitions), this includes MANU TV, a monthly subscription that generates over £6m per year.\n\n***Is this depending a lot on the fans?*** Not always, as a significant portion of it is split equally, regardless of the club and the number of fans. However, it is dependent on the success of the club and its participation in major competitions.\n\n\n\n**2.3** **Matchday revenue** doesn’t need any introduction, although it had surprisingly low growth of \\~2% per year, which is lower than the inflation rate.\n\n***Is this depending a lot on the fans?*** - Absolutely!\n\n\n\n*Conclusion: All of the 3 revenue sources have very low growth, and are dependent on the two key points:*\n\n* *The competitions the club participates in, and its success in them, and*\n* *The number of fans (attending the matches, paying for MUTV, buying apparel, etc.)*\n\n**It is safe to say that over 70% of all the revenue is derived directly from the fans.**\n\n  \n**3.0 Key expenses**\n\nNow, let’s have a look at the key expenses and their development over time:\n\n**Employee benefit expenses**: £365m (vs. £215, a decade ago) - Growth of 5.4% per year\n\n**Amortization**: £190m (vs. £55m a decade ago) - Growth of 11.2% per year\n\n**Other operating expenses**: £149m (vs. £88m a decade ago) - Growth of 5.4% per year\n\n  \nWhat you will notice is that **all of them have been growing at a faster pace than the revenue.** The key drivers behind this are the **larger transfer fees** and **higher salaries**. It is worth noting that the recent involvement of the Saudi clubs put even more pressure. Here's some more information about each category, for those who are interested:\n\n**Employee benefit expenses -** The compensation of the players, managers, staff, administration, etc.\n\n**Amortization -** Anytime a player is bought from another club, the costs associated with the acquisition of the player are capitalized, and then amortized over the duration of the contract period. For example, if a player had a £30m transfer fee, and the contract length is 3 years, there will be a £10m amortization expense per year recognized in the income statement.\n\n**Other operating expenses -** All the other expenses, ranging from security stewarding and cleaning at Old Trafford to property costs, maintenance, HR, professional fees, etc.\n\n  \n**4.0 Historical Financial Performance**\n\nSo, if we add all of this together, the outcome is low revenue growth, with significant declining profitability. The operating margin is down from **positive 15%** to **negative 10%.** This is, after all, a very competitive environment, where no single team has been at the very top for decades in all competitions. It requires significant investments (especially in players and top management), and even then, success is not guaranteed and is temporary.\n\n*So, you might ask:* **What is the value of a company that is not profitable, operates in a competitive field, and even success is temporary? The answer will likely be $0.**\n\n\n\n**5.0 There is no value?**\n\nSo, is there no value? Is one of the biggest clubs in the world worthless?\n\nI’d argue that Manchester United, like other sports clubs, aren’t valued, as there’s no significant positive free cash flow. Instead, they are being **priced**. They are in the same group as Pokemon cards, antiques, and art paintings. The beauty is in the eye of the beholder. Except, the beholders are billionaires, and they’re likely going through a checklist.\n\nDid I buy 5 more houses? Great, check.\n\nHow about a yacht and a private jet? Yep, got it.\n\nDamn, there’s still a lot of money left, what should I do? Oh, wait, what about a sports club?\n\n**The owners of a sports club (in this case, the Glazer family will make money only when they sell the club to someone who is willing to pay more than they initially paid.**\n\n  \n**6.0 The emotional side**\n\nThere’s another angle that we need to explore, which is the emotional side. Some fans proudly own shares of the club, where the goal is not so much to make more money but to be a proud minority owner of the club. As such, there is nothing wrong with that.\n\nHowever, there have been many examples when the stock price went up/down for ridiculous reasons. For example, there was a share price increase in 2013, due to the announcement that the club signed Fellaini. On the other side, the share price dropped \\~9% on the speculation that the club might sign Ezequiel Garay. I’ll leave it up to you to decide how impactful these events are on the club’s value.\n\nFans will always criticize the owners/managers for the poor performance, and to a large extent, rightfully so. However, when it comes to the financial side and the share price, Manchester United is not an exception.\n\nTake a look at the share price of Juventus, and try to guess what the spike in 2018 relates to.\n\nIf you guessed ***Cristiano Ronaldo***, well done! Don’t get me wrong. Events like this have some (minor) impact on the success of the club during a short period of time. In the case of Ronaldo, it might even bring better sponsorship deals, higher ticket prices, and more apparel sales. However, it also comes with an additional cost (his salary!). **In the long run, none of these individual events have a significant impact on the value of a football club.**\n\nTwo other football clubs that are public are Borussia Dortmund and Sporting. You can have a look at their share prices too.\n\n**7.0 The transfer period**\n\nAlthough fans are generally emotional and excited about the club they support, the transfer period is just different. There is a lot of speculation to follow, building up the expectations for the year to come.\n\nWell, here’s how the share price changed during the transfer period (From June 10th to September 1st), in each year since the company was public.\n\n\n\n|Year|Manchester United|S&P500|\n|:-|:-|:-|\n|2013|-1%|-1%|\n|2014|-3%|3%|\n|2015|7%|-6%|\n|2016|-1%|4%|\n|2017|-1%|2%|\n|2018|22%|4%|\n|2019|-4%|1%|\n|2020|-10%|12%|\n|2021|11%|7%|\n|2022|11%|1%|\n|2023|22%|5%|\n|2024|3%|3%|\n|**Total compounded return**|**64%**|**40%**|\n\nAs you can see, investing in Manchester United during the transfer period was a better decision than investing in the S&P500 during the same period. In fact, this return has been crushing the return of the stock since its IPO (which, as mentioned at the very beginning, is around a disappointing \\~20%).\n\n  \nSo, is this a terrible company to invest in? **Fundamentally, yes.**\n\nAnyone who invests in Manchester United, bets that there will be a **transfer of ownership**, which will push the share price up. There were rumors for that back in February of 2023 when the share price went up almost double. Should those rumors come back, I do expect a movement of at least 60% from today’s share price.\n\nI hope you enjoyed this post, feel free to share your thoughts.", "id": "1fqmi8a", "created_utc": 1727440052.0, "score": 175, "upvote_ratio": 0.95, "num_comments": 30, "comments": [{"body": "Actually enjoyed it! Thank you for putting in the work, love quality Posts in this sub.\n\nFootball Clubs are a shitty value investment, therefore I didnt wanted to read through this and fast forwarded to the end. But i noticed you came to the exact same conclusion and worked your way through the fundamentals and many different aspects.\n\nLittle Bit of wasted work for Man United - but fundamentally good Analysis and solid quality post. We need more of this here.", "score": 63, "replies": [{"body": "Interestingly I just came to know that Ariel Investments, a value fund with a long history, are invested in Manchester United. Surprised me.", "score": 8, "replies": []}, {"body": "Glad you enjoyed it, and thank you for the kind words.", "score": 4, "replies": [{"body": "Holy cow, how long did this take you?  A great sacrifice to make for us all but at what cost to yourself?", "score": 1, "replies": [{"body": "The length depends on the complexity. In this case, it was not more than 2 days.", "score": 2, "replies": [{"body": "That's still some dedication", "score": 2, "replies": [{"body": "I really like analyzing companies and that helps a lot :) I am glad that the posts are welcomed in the subreddit and there's positive feedback.", "score": 2, "replies": [{"body": "Do you take requests? 😂", "score": 1, "replies": [{"body": "Of course :)", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "This is generally right. Sports teams are possibly more like high end art as an investment than they are like a normal business. I can't speak for MANU specifically, but in the U.S. there are often ways that the owners benefit financially from owning a team that will not show up on the company books. For instance, they might own most of the parking near the stadium but privately or in a separate entity. In a publicly traded company like MANU that doesn't help shareholders any but it does mean that owning the team is more valuable to a buyer than simply being able to show off.", "score": 16, "replies": [{"body": "Tottaly agree!", "score": 3, "replies": []}, {"body": "TV money in sports is outrageous, and I don't see that changing anytime soon. \n\nFSG have made bank on Liverpool FC, so you can money off them if you don't buy it as a vanity project.", "score": 1, "replies": []}]}, {"body": "There is big fund that invests into football clubs like Manchester, Juventus and Celtic. Here is a article about it: https://www.trustnet.com/news/791314/michael-lindsell-why-we-invested-in-juventus-celtic-and-manchester-united\n\nI don’t think retail investors should invest in sports clubs. Their goal is to win titles and not to generate cash flow for shareholders. Any excessive cash is spent on new players or infrastructure. A club can also have bad financials and still be successful.", "score": 5, "replies": [{"body": ">Their goal is to win titles and not to generate cash flow for shareholders\n\nVery much not true for United under the Glazer's ownership! Hopefully the Ratcliffe era is different.", "score": 1, "replies": []}]}, {"body": "The market cap of every NFL team **combined** is less than companies like Home Depot, Roche Pharmaceuticals, Salesforce, Hermes, and Costco.\n\nThey have an outsized cultural impact, but that doesn't mean they are financial powerhouses.", "score": 6, "replies": [{"body": "Good point.", "score": 1, "replies": []}]}, {"body": "Lots of owners have made a lot of money in football. The key is not managing the club you buy like a squirrel regard.\n\nHell, you are talking about Manchester United which was managed like a squirrel’s dropping, and it still made lots of money for the Glazers. They basically put nothing in, leveraging the club’s money and sold part of their stake for 4bil", "score": 4, "replies": []}, {"body": "I didn't read your entire post so take this for what it is, but I think the thing about football clubs is they generate a lot of hype from people because everyone in the world knows about them and they sell out stadiums easily and have sponsorships, but the reality is they also spend a ton of money on players and stadiums and a bunch of expenses so in reality it's not a really great business, to me the only time I've thought about buying football club's stock is right during the IPO because that's when the hype for them really gets going as every fan wants a piece and big investors see it as initially undervalued, but yeah I think their value as actual businesses that continually have stock growth is dubious in general but during IPOs they're at least worth a glance.", "score": 1, "replies": [{"body": "I understand the post is long, and I do think if you read it, you'd see some overlap between your line of thinking and mine :)", "score": 1, "replies": []}]}, {"body": "As Premier League fan for over 20years I have to say that Man United has a lot to catch up on compared to other top clubs (assuming United can still be considered as top club - they finished in top4 only 4 times in last 10 years, not winning the league even once).\n\nI read many interviews with former players complaining about the infrastructure, work ethics etc. The club is also far behind when it comes to use of technology and data. \n\nImo Man United is still capitalizing on thier popularity that was build during their best years 1995-2013. It is definitely not the club that is going upwards both as a sport club and as a company.\n\nAlso whoever came up with the idea to give it the ticket MANU clearly doesn’t know club history. Google „why not to call Manchester United as Man U”.", "score": 1, "replies": []}, {"body": "Nice Post, interesting to read.", "score": 0, "replies": [{"body": "Thank you, glad you enjoyed it.", "score": 0, "replies": []}]}, {"body": ">So, you might ask: What is the value of a company that is not profitable, operates in a competitive field, and even success is temporary? The answer will likely be $0.\n\n\nUh....dude, you value them the way you normally do (and, no, don't use GAAP-based Net Income.....saw you flagged a bunch of non-cash expenses that can generally be ignored during a valuation exercise....) -- [by looking at historic actual operating cash flow and EBITDA values + consensus broker estimates on the next two years worth of cash flows](https://imgur.com/a/bfTVtzZ).\n\n\n>5.0 There is no value?\n\n>So, is there no value? Is one of the biggest clubs in the world worthless?\n\nFor a company the generates $100mm to $200mm in organic cash flow per year? Yeah, I'd say there's a good bit of value in there.\n\nThis fact is further backed up when looking at MANU's [trading multiples](https://imgur.com/a/z8jmVd1) which all are in a fairly reasonable range of ~18.0x - 13.0x on an Firm Value / EBITDA basis and ~17.0x - 8.0x on a Market Cap / OCF basis.....\n\n>I’d argue that Manchester United, like other sports clubs, aren’t valued, as there’s no significant positive free cash flow. Instead, they are being priced. They are in the same group as Pokemon cards, antiques, and art paintings. The beauty is in the eye of the beholder. Except, the beholders are billionaires, and they’re likely going through a checklist.\n\nI think this line of logic is flawed since (a) we've shown that MANU **does** consistently generate cash flow (no, cash flow =/= accrual income) and aren't valued based on greater-fool or bag holder theory like non-cash yielding \"investments\" like Pokemon cards, Beanie Babies, Crypto, etc.....", "score": -4, "replies": [{"body": "Using EBITDA is pointless when the club has to continuously buy new players. This is completely ignored by your approach, and it is quite a significant cash outflow.", "score": 8, "replies": []}, {"body": "They generate OCF, they don’t generate FCF.  Transfer fees are recurring and necessary.  I don’t think there’s a point to a valuation method that excludes them.", "score": 2, "replies": []}, {"body": "Using generic valuation methods for a sports team shows you don't know anything", "score": 2, "replies": []}]}, {"body": "Valuable analysis, Sir. \nManchester City take raw young players, improve them, and turn them into valuable stars that any other team would bite their arm off for. Precisely the opposite business model to Utd. \n\nThe beautiful, free-flowing football of Utd's once-hapless local rivals has undermined the club's ability to set a course then stick to it. We shouldn't underestimate the demoralising effect of the greatest football team in modern history emerging in their own back yard. Its economically not insignificant.", "score": -4, "replies": [{"body": "It should also be noted that a key part of Man City's business model is taking fake and inflated commercial sponsorships from the UAE. Their state owner with a horrific human rights record. \n\nThat's the reason they're currently facing 115 charges for financial misconduct, and could be stripped of their titles and/or relegated if found guilty.", "score": 3, "replies": []}]}]}
{"title": "Hi, non US citizent here, with the upcoming elections in november on usa, to what degree does it affect the market? ", "selftext": "[removed]", "id": "1fqn9lh", "created_utc": 1727442359.0, "score": 0, "upvote_ratio": 0.32, "num_comments": 19, "comments": [{"body": "Sorry, we're removing this post because it's a duplicate, or extremely similar, to another that was already posted.\n\nWe appreciate the effort but we don't need multiple posts that cover the same topic.", "score": 1, "replies": []}, {"body": "Up down up down side side", "score": 10, "replies": [{"body": "A b a b start", "score": 2, "replies": []}]}, {"body": "Depends. ", "score": 2, "replies": []}, {"body": "Usually a bull before the election. After the election, no one knows what’s going to happen.", "score": 2, "replies": []}, {"body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "There's other things happening in the market today.", "score": 1, "replies": []}, {"body": "Boo low effort purely political speculation post.", "score": 1, "replies": []}, {"body": "VIX futures curve indicates markets are betting on crazy volatility", "score": 1, "replies": []}, {"body": "nobody knows", "score": 1, "replies": []}, {"body": "Impossible speculation.\n\nMy guess is that the market will value predictability and U.S. support of global trade more than it will be concerned about possible tax law changes. And it will not appreciate chaotic or capricious “policies” that make it challenging to plan for long term strategic objectives.\n\nTake that as you will.", "score": 1, "replies": []}, {"body": "Its all priced in already", "score": 1, "replies": []}, {"body": "Historically, you can expect a small degree of impact in the short term but no degree in the long-term.", "score": 1, "replies": []}, {"body": "Who cares?? In the long run it didn't matter in the past and won't matter in the future", "score": 1, "replies": []}, {"body": "I got a buddy who's a time traveler, lemme call him up and see what he's got to say on this one.", "score": 1, "replies": [{"body": "Awesome man, thanks alot", "score": 1, "replies": []}]}, {"body": "No one knows, but you can be certain Trump will continue selling his merchandise to the idiots that vote for him (Donald Trump the crypto, Donald Trump the  silver coin, Donald Trump the $100k watche, Donald Trump the lunch box, Donald Trump the doll, and my favorite! Donald Trump the flamethrowah!!!!!).", "score": 1, "replies": [{"body": "The kids love that one!", "score": 2, "replies": [{"body": "May the Orange be with you!", "score": 2, "replies": []}]}]}]}
{"title": "Intel and US Government to Finalize CHIPS Act Funding", "selftext": "Includes $8.5b in funding, and $11b in loans. This is separate from the $3.5b they secured from the Pentagon.", "id": "1fqlse7", "created_utc": 1727437651.0, "score": 427, "upvote_ratio": 0.96, "num_comments": 30, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 1 month ago\n**Total Comments** | 102 | **Previous Best DD** | \n**Account Age** | 1 month | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Will they now be able to bring back coffee machines and complimentary fruit?", "score": 108, "replies": [{"body": "Fuck those coffee machines. Give the skilled engineers a raise and they can buy their own coffee. ", "score": 50, "replies": [{"body": "it is a known fact that skilled engineers want both. They will walk away from a million dollars if there is no free coffee and food.", "score": 8, "replies": [{"body": "Only the stupid ones do that. Don’t need them", "score": -2, "replies": []}]}]}, {"body": "Fuck coffee they'll be able to stock the break rooms with cocaine at this rate", "score": 10, "replies": [{"body": "I heard that's what Boeing had back in 2014.", "score": 5, "replies": []}]}, {"body": "When did they ever get rid of them for blue badges?", "score": 3, "replies": []}, {"body": "No. But bonuses for c-suite are back baybee!! Thanks taxpayers.", "score": 2, "replies": [{"body": "This is so true it hurts. Didn't the ceo get 45 mil in the middle of the airplanes falling apart in the sky crisis?", "score": 2, "replies": []}]}]}, {"body": "Curious what “end of year” means. Federal fiscal year ends September 30th, which means funding may be finalized very soon.", "score": 30, "replies": [{"body": "Between then and December 😂", "score": 10, "replies": []}]}, {"body": "“We won’t call it a Bailout. We can’t use the words ‘Too Big To Fail.’”\n\n“I got it!”\n\n“Chips Act!”", "score": 17, "replies": []}, {"body": "These are not the Sun Chips i asked for", "score": 2, "replies": []}, {"body": " Finally, engineers can afford better labs, not just better coffee!", "score": 2, "replies": []}, {"body": "[deleted]", "score": -4, "replies": [{"body": "I imagine if you’re on weekly calls with the executives you’re one of the executives grab the dick next to you. \n\nAlso the rest of your comment suggest you are not affiliated with the company at all. \n- let “that” company \n- buys “them” out\n\nStop your hate on -insert large company here- and grow up.", "score": 4, "replies": []}, {"body": "That’s dumb to think that.", "score": 2, "replies": []}]}, {"body": "Government should get 49% of the stock until this bailout is returned with interest.   Then you get your stock back.", "score": -17, "replies": [{"body": "every fab company is subsidized by their government, because fabbing is a critical part of so many supply chains.\n\nwithout Taiwan subsidiaries, no TSMC. without decades of crazy South Korean support for the Chaebols, no Samsung, no sk hynix.", "score": 19, "replies": [{"body": "We cannot say facts here", "score": 6, "replies": []}]}, {"body": "Not how the US free market works. Government gives free money to the market. ", "score": 17, "replies": [{"body": "From taxpayers who invested.", "score": 2, "replies": [{"body": "From foreign countries that the US forces to hoard USD.", "score": 3, "replies": []}]}]}]}, {"body": "Is it safe to buy Intel? Rumour is Arm wants to purchase it.", "score": -11, "replies": [{"body": "Rumour is about Qualcomm. And no nor Qualcomm nor Arm can buy Intel", "score": 11, "replies": [{"body": "Only chip company with cash enough to buy intel is nvda  maybe AMD and that probably would bring an anti trust suit", "score": 7, "replies": []}]}, {"body": "If they buy, that's good for the stock price (99÷ of the time)", "score": 1, "replies": []}, {"body": "Ok buy arm then sheesh ![img](emote|t5_2th52|31224)", "score": 1, "replies": []}]}]}
{"title": "I think DUKE Energy is Dropping in October.", "selftext": "Storm Helene is causing massive damage in Florida. When the Hawaii wildfire occurred, HE's stock price dropped by more than 50%. DUKE Energy, which supplies energy to Florida, is experiencing widespread outages in areas affected by Helena. With the stock at an all-time high, I believe it will drop next month due to the ongoing crisis. The damage hasn't been fully accounted for, and recovery may take time.\n\nDUKE Energy has suffered significant infrastructure damage, as reported by CNN and Yahoo. Here is the Yahoo article:\n\n[https://finance.yahoo.com/news/duke-energy-anticipates-widespread-damage-194500271.html](https://finance.yahoo.com/news/duke-energy-anticipates-widespread-damage-194500271.html)\n\nI think it will take a few weeks for the situation to return to normal, and I expect the stock price to fall below $100 in October.", "id": "1fqpnde", "created_utc": 1727448912.0, "score": 5, "upvote_ratio": 0.56, "num_comments": 23, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 1 year ago\n**Total Comments** | 5 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1fqpnde/i_think_duke_energy_is_dropping_in_october/) \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "HE price collapsed due to concerns over legal liability that their infrastructure caused the wildfires. So unless your theory is that DUK caused the hurricane, I'm not sure why you're bringing up HE.", "score": 57, "replies": [{"body": "Duke is the opposite of nuke, so if a nuke fixes hurricanes then Duke creates them.\n\n\n Checkmate.", "score": 13, "replies": []}, {"body": "If duke had a functional weather machine that’s extremely bullish though", "score": 5, "replies": []}, {"body": "Because they have no brain power", "score": 1, "replies": []}]}, {"body": "Hawaii Energy's power lines ignited a wildfire that killed at least 102 people, the deadliest American wildfire in over a century.\n\nDuke energy happens to supply power to an area of the country getting hit by a hurricane.\n\nThese are not the same.", "score": 24, "replies": []}, {"body": "If they show good performance in handling the outages, it will have the opposite effect.", "score": 9, "replies": []}, {"body": "they will get to charge more for “infrastructure costs”, will likely get money from state gov and insurance, so bullish", "score": 8, "replies": [{"body": "Duke will end up spending roughly a million dollars out of pocket the rest will be picked up by the Feds.", "score": 2, "replies": []}]}, {"body": "That's not how stocks work. People would have to perceive that the damage is so bad they can't ever recover from it. \n\nthis wont impact their stock much imo", "score": 5, "replies": []}, {"body": "My electric bill would like to argue this.", "score": 9, "replies": []}, {"body": "Duke supplies nuclear power in NC\nThere is no chance it’s going to go offline or suffer a Hawaii level event \n\nMaybe it’ll decline with a market decline idk but I wouldn’t bet much on this idea.", "score": 4, "replies": []}, {"body": "did duke energy cause the hurricane? impressive, probably bullish", "score": 3, "replies": []}, {"body": "It’s ‘Helene.’", "score": 3, "replies": []}, {"body": "DUKE didn't cause Helene like Hawaiian did in Maui", "score": 2, "replies": []}, {"body": "You don't have any idea how regulated utilities work. Duke will defer these costs to the balance sheet and collect from customers down the line, as they always have. Shit they might even be able to charge interest on the balance, depending on the regulatory framework in each state.\n\n\nHE was thought liable for a wildfire that killed people and destroyed property. There is no regulatory framework to collect on that unlike a hurricane.", "score": 2, "replies": []}, {"body": "One was a utility that didn’t follow its own protocols and caused a fire… The other is being affected by a hurricane and will get the bulk of the money spent on restoration reimbursed by the federal government. OP is truly regarded.", "score": 2, "replies": []}, {"body": "State legislature will just let them price recovery bonds to recover losses from things like this. It has gotten out of hand recently. \n\nLook at PGE/SoCal Edison/Duke. They each have plenty of recovery bonds outstanding.\n\nThe shitty part is who is actually on the hook for the recovery revenue: consumers, at the bottom of their utility bill.\n\nSource: Securitized Investor", "score": 1, "replies": []}, {"body": "This post make me wanna go back and buy hawaii electric. OH look it trading at a discount", "score": 1, "replies": []}, {"body": "They'll charge customers more, same way as insurance companies.\n\nTheir stock will go nowhere.", "score": 1, "replies": []}, {"body": "You forgot to eat crayons. Hawaiian dropped because Hawaiian energy was implicated in the cause of the fires.", "score": 1, "replies": []}, {"body": "This is one of the most regarded posts I’ve seen here, and there’s a lot of regarded posts here.", "score": 1, "replies": []}]}
{"title": "What the impending stagflation in Russia (might) mean for you: An in-depth look", "selftext": "**TL;DR AT THE BOTTOM**\n\nIf anyone else has seen the latest Business Insider article regarding the fears of an impending stagflation event in Russia, you might be wondering what that means for you and your investments. If you look back on charts of where Russia invaded Ukraine, you can see where the markets tanked. If you want to try to get ahead of something similar this time, read on. Spent a solid chunk of time putting it together for you all. Please note, this is nothing more than info for you to base your own ~~gambles~~ DDs on.\n\nAnyways, here's a \\[paywall-free version of the article\\](https://archive.ph/2024.09.26-143200/https://www.businessinsider.com/russia-economy-outlook-stagflation-recession-inflation-gdp-growth-ukraine-war-2024-9), as well as a rundown of what it (might) mean for the broad markets as a whole.\n\nFull disclosure, I worked on this using the latest and best GPT model o1-preview, which is shockingly good at reasoning. Whether that makes you discredit the content is up to you, but it’s been tested to be on par with individuals with PhD’s.\n\n\n\n**The Significance of This Event**\n\nRussia's looming stagflation—a combination of economic stagnation and high inflation—could significantly disrupt global markets due to the country's substantial role in exporting energy, metals, and agricultural commodities. Supply chain disruptions and reduced exports from Russia may lead to increased global commodity prices, affecting various industries. Companies and sectors capable of capitalizing on these shifts or mitigating associated risks are likely to see notable impacts on their financial performance.\n\n# Sectors That May See Positive Gains, Broken Down by Key Companies\n\n**Energy Sector**\n\nWith potential reductions in Russian oil and gas exports, global energy prices may rise, benefiting companies that can fill the supply gap or profit from higher prices.\n\n* **Cheniere Energy, Inc. (NYSEAMERICAN: LNG)**\n   * **Reasoning:** As the leading U.S. exporter of liquefied natural gas (LNG), Cheniere is well-positioned to meet increased European demand seeking alternatives to Russian gas.\n* **EOG Resources, Inc. (NYSE: EOG)**\n   * **Reasoning:** EOG's strong position in U.S. shale production allows for rapid increases in output, capitalizing on higher oil and natural gas prices.\n* **Pioneer Natural Resources Company (NYSE: PXD)**\n   * **Reasoning:** Pioneer, with its substantial Permian Basin operations, can benefit from elevated crude prices and increased domestic production.\n\n**Renewable Energy Sector**\n\nAccelerated transition to renewable energy to reduce dependence on fossil fuels may benefit companies in this sector.\n\n* **First Solar, Inc. (NASDAQ: FSLR)**\n   * **Reasoning:** First Solar's U.S.-based manufacturing and thin-film solar technology position it to meet increased demand without the supply chain risks associated with overseas suppliers.\n* **Enphase Energy, Inc. (NASDAQ: ENPH)**\n   * **Reasoning:** Enphase's microinverter technology is critical for solar installations, and increased global demand for solar energy can drive growth.\n* **Brookfield Renewable Partners L.P. (NYSE: BEP)**\n   * **Reasoning:** With a diversified portfolio in hydroelectric, wind, and solar assets globally, Brookfield Renewable can capitalize on the shift towards clean energy.\n\n**Defense Sector**\n\nHeightened geopolitical tensions may lead to increased defense spending globally.\n\n* **Northrop Grumman Corporation (NYSE: NOC)**\n   * **Reasoning:** Northrop Grumman's expertise in defense electronics, aerospace systems, and cybersecurity makes it a key beneficiary of increased defense budgets.\n* **BAE Systems plc (OTC: BAESY)**\n   * **Reasoning:** As a major global defense contractor, BAE Systems could see increased orders from NATO countries boosting their defense capabilities.\n* **General Dynamics Corporation (NYSE: GD)**\n   * **Reasoning:** General Dynamics' production of military vehicles, ships, and communication systems positions it to benefit from increased military procurement.\n\n**Agriculture Sector**\n\nDisruptions in Russian grain exports can lead to higher global agricultural commodity prices.\n\n* **The Mosaic Company (NYSE: MOS)**\n   * **Reasoning:** As a leading producer of potash and phosphate fertilizers, Mosaic may benefit from higher fertilizer prices due to reduced exports from Russia and Belarus.\n* **CF Industries Holdings, Inc. (NYSE: CF)**\n   * **Reasoning:** CF Industries, a major nitrogen fertilizer producer, stands to gain from increased global demand for fertilizers amid supply constraints.\n* **Deere & Company (NYSE: DE)**\n   * **Reasoning:** Farmers may invest in advanced agricultural equipment to boost productivity, benefiting Deere's sales of machinery and technology solutions.\n\n**Metals and Mining Sector**\n\nSupply disruptions of key metals from Russia can lead to higher prices and increased demand for alternative suppliers.\n\n* **Alcoa Corporation (NYSE: AA)**\n   * **Reasoning:** As a major aluminum producer, Alcoa can benefit from higher aluminum prices due to reduced Russian exports.\n* **Sibanye Stillwater Limited (NYSE: SBSW)**\n   * **Reasoning:** With significant operations in palladium and platinum mining, Sibanye Stillwater may gain from higher prices resulting from supply shortages.\n* **Vale S.A. (NYSE: VALE)**\n   * **Reasoning:** Vale, a leading global producer of nickel, could benefit from increased nickel prices and demand, crucial for stainless steel and battery production.\n\n\n\n# Sectors That May Be Hit the Hardest, Broken Down by Key Companies\n\n**Automotive Sector**\n\nAutomakers may face challenges due to shortages and higher prices of metals like palladium and nickel.\n\n* **Ford Motor Company (NYSE: F)**\n   * **Reasoning:** Ford's production costs may increase due to higher prices for essential metals, potentially impacting profitability and pricing strategies.\n* **General Motors Company (NYSE: GM)**\n   * **Reasoning:** Similar supply chain pressures as Ford, with potential delays in electric vehicle (EV) production due to nickel shortages.\n* **Tesla, Inc. (NASDAQ: TSLA)**\n   * **Reasoning:** Tesla's reliance on nickel for EV batteries may lead to increased costs and supply constraints, affecting production targets.\n\n**Aerospace and Aviation Sector**\n\nDependency on Russian titanium and increased fuel costs can negatively impact this sector.\n\n* **The Boeing Company (NYSE: BA)**\n   * **Reasoning:** Boeing's supply chain may be disrupted due to reliance on Russian titanium, essential for manufacturing airframes.\n* **Airbus SE (OTC: EADSY)**\n   * **Reasoning:** Airbus also relies on Russian titanium and may face similar production challenges.\n* **Airlines**\n   * Delta Air Lines, Inc. (NYSE: DAL)\n   * American Airlines Group Inc. (NASDAQ: AAL)\n   * United Airlines Holdings, Inc. (NASDAQ: UAL)\n      * **Reasoning:** Higher jet fuel prices increase operational costs, and economic uncertainty may reduce demand for air travel.\n\n**Technology Sector**\n\nSemiconductor and electronics manufacturers may be affected by shortages of critical materials like neon gas and palladium.\n\n* **Intel Corporation (NASDAQ: INTC)**\n   * **Reasoning:** Supply chain disruptions in raw materials could impact semiconductor production volumes and costs.\n* **NVIDIA Corporation (NASDAQ: NVDA)**\n   * **Reasoning:** NVIDIA may face challenges similar to Intel, affecting the supply of graphics processing units (GPUs).\n* **Apple Inc. (NASDAQ: AAPL)**\n   * **Reasoning:** While Apple has diversified suppliers, disruptions in global supply chains and increased component costs could impact production and margins.\n\n# Positively Impacted ETFs\n\n* **Energy Select Sector SPDR Fund (NYSEARCA: XLE)**\n   * **Reasoning:** Contains major oil and gas companies benefiting from higher energy prices and increased global demand.\n* **iShares Global Clean Energy ETF (NASDAQ: ICLN)**\n   * **Reasoning:** Invests in clean energy companies that may see growth due to accelerated renewable energy adoption.\n* **VanEck Vectors Agribusiness ETF (NYSEARCA: MOO)**\n   * **Reasoning:** Provides exposure to global agribusiness companies likely to benefit from higher agricultural commodity prices.\n* **SPDR S&P Metals and Mining ETF (NYSEARCA: XME)**\n   * **Reasoning:** Includes companies involved in the extraction and production of metals, which may gain from higher commodity prices.\n\n# Negatively Impacted ETFs\n\n* **U.S. Global Jets ETF (NYSEARCA: JETS)**\n   * **Reasoning:** Contains airline stocks potentially affected by higher fuel costs and reduced travel demand.\n* **Global X MSCI China Consumer Discretionary ETF (NYSEARCA: CHIQ)**\n   * **Reasoning:** While not directly linked to Russia, global economic slowdown may impact consumer discretionary spending in major markets like China.\n* **VanEck Vectors Russia ETF (NYSEARCA: RSX)**\n   * **Reasoning:** Direct exposure to Russian equities, which are significantly impacted by sanctions and economic instability.\n* **Global X Lithium & Battery Tech ETF (NYSEARCA: LIT)**\n   * **Reasoning:** Companies involved in battery technology may face supply chain challenges and increased costs due to metal shortages.\n\n# Conclusion\n\nIn reassessing my recommendations, I have refined the list of companies and ETFs to ensure they represent the most strategic picks for investors considering the potential impacts of Russia's stagflation on global markets.\n\nRussia's stagflation presents a complex landscape for investors, characterized by both risks and opportunities. Sectors such as energy, defense, agriculture, and renewable energy are likely to experience positive impacts due to increased demand, higher commodity prices, and global shifts in energy policy. Companies within these sectors are positioned to capitalize on market gaps and heightened geopolitical tensions.\n\nOn the other hand, industries heavily reliant on Russian imports, facing supply chain disruptions, or contending with rising input costs may encounter significant challenges. Aerospace, automotive, consumer goods, and certain technology companies may see reduced profitability and operational difficulties.\n\nFor investors, a strategic approach involves focusing on sectors and companies poised for growth amid these global changes. Allocating resources to positively impacted ETFs can offer diversified exposure to these opportunities. However, it's essential to remain vigilant, as the situation is fluid, and geopolitical developments can rapidly influence market dynamics. Continuous monitoring and a willingness to adapt investment strategies are crucial in navigating the complexities arising from Russia's economic conditions.\n\n**Disclaimer:**\n\nThis analysis is intended for informational purposes and does not constitute investment advice. Market conditions are subject to change, and past performance is not indicative of future results. Investors should conduct their own research and consult with a qualified financial advisor before making investment decisions.\n\n**TL;DR**: Russia’s potential stagflation could disrupt global markets, especially in energy, metals, and agriculture. Sectors likely to benefit include energy (e.g., Cheniere Energy), renewable energy (e.g., First Solar), defense (e.g., Northrop Grumman), agriculture (e.g., Mosaic), and metals (e.g., Alcoa). Sectors that may suffer include automotive (e.g., Ford), aerospace (e.g., Boeing), technology (e.g., Intel), and consumer goods (e.g., PepsiCo) due to supply chain disruptions and rising commodity prices.", "id": "1fr0abv", "created_utc": 1727477273.0, "score": 0, "upvote_ratio": 0.37, "num_comments": 27, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 3 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 439 | **Previous Best DD** | \n**Account Age** | 11 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": [{"body": "Soo what do you want me to do? Options DUMB IT DOWN", "score": 1, "replies": []}]}, {"body": "TLDR: OP discovered chatGPT and used it to jerk himself off", "score": 36, "replies": [{"body": "Been using it for a long time, if you have as well then you’re aware of how many people don’t know how to properly utilize it. I was able to take an article and rather than pull out a whiteboard to figure out what sectors might be impacted by a large event like this, I used AI, and then I shared it with a community I enjoy, one which statistically contains a large number of people who don’t have access to o1-preview. I gave a gift to the community, which you couldn’t.\n\nNow that’s how you actually jerk yourself off. Get back to your 0DTE’s.", "score": -20, "replies": [{"body": "chatGPT told me to buy NVDA at 27$ last year\n\nI use AI mostly for crunching financials and historical price. Been very successful with it", "score": 5, "replies": []}]}]}, {"body": "I don’t understand the logic of why any of this affects US firms in any way that we could observe. Russia is disconnected from the financial system. Basically the only function it serves globally is to export gas and raw materials. Even if the economic situation deteriorates in Russia, those exports will continue because they’re a source of money for the regime. Unrest seems unlikely, though it is always possible some officer might be inspired by Prigozhin.", "score": 14, "replies": []}, {"body": "ChatGPT is a bit late to the party.  Russia's economic woes were priced in 2-1/2 years ago.  The world has moved on from Russia.", "score": 4, "replies": [{"body": "Despite the war, Russia has in fact continued its export of Oil and other materials due to sales in non-sanctioned countries\n\nhttps://cepr.org/voxeu/columns/russian-economy-war-footing-new-reality-financed-commodity-exports\n\nhttps://energyandcleanair.org/april-2024-monthly-analysis-of-russian-fossil-fuel-exports-and-sanctions/", "score": -2, "replies": []}]}, {"body": "Saudi Arabia announced they're upping production to regain market share and dropping their 100 dollar target price.", "score": 2, "replies": []}, {"body": "So if the Russian economy goes to crap, will that end the Ukraine aggression, and if so, how does the rebuild of Ukraine with murican businesses factor into the winners/losers analysis?", "score": 2, "replies": [{"body": "Good question. Here’s what it says:\n\nIf the Russian economy collapses, it could strain Russia’s ability to continue the war in Ukraine, potentially hastening an end to the conflict. The subsequent rebuilding of Ukraine would offer significant opportunities for American businesses across various sectors.\n\n**Companies Likely to Benefit:**\n\n- **Construction and Engineering Firms:** Companies like **Caterpillar Inc. (CAT)** and **Deere & Company (DE)** could see increased demand for construction machinery and equipment. **Fluor Corporation (FLR)** and **Jacobs Solutions Inc. (J)** might secure contracts for large-scale engineering and infrastructure projects.\n\n- **Infrastructure and Materials Suppliers:** **Nucor Corporation (NUE)** and **Vulcan Materials Company (VMC)** could benefit from supplying steel and aggregates needed for rebuilding roads, bridges, and buildings.\n\n- **Energy Companies:** Firms specializing in energy infrastructure and renewables, such as **NextEra Energy, Inc. (NEE)** and **General Electric Company (GE)**, might participate in overhauling Ukraine’s energy systems.\n\n- **Technology Providers:** **Cisco Systems, Inc. (CSCO)** and **Microsoft Corporation (MSFT)** could be involved in restoring and upgrading Ukraine’s telecommunications and digital infrastructure.\n\n**Commodities Likely to Benefit:**\n\n- **Steel and Copper:** The reconstruction efforts would increase demand for steel and copper, benefiting companies involved in mining and production of these metals.\n\n- **Cement and Lumber:** Suppliers of cement and lumber would likely see heightened demand as rebuilding efforts commence.\n\nThese companies and commodities stand to gain from contracts and increased demand associated with rebuilding Ukraine’s infrastructure, energy grids, and urban developments, presenting potential growth opportunities for investors.", "score": 1, "replies": []}, {"body": "Unfortunately (or fortunately, depending on your PoV), Ukraine's military resistance is likely to exhaust and collapse much faster than Russia's economy. Russians are not soft pussies like us in the west, the government and the central bank do not mess around, they do not see the choice between 25 and 50 basis points as such a ridiculous drama (cutting or raising rates by hundreds of basis points at a time). Most importantly, the citizens are tough and resilient, they are not going to strike or revolt because their living standard went down by 20%. US, UK, France or Germany, on the other hand... ![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}, {"body": "why do people like to post about insignificant economies? ![img](emote|t5_2th52|31226)", "score": 1, "replies": []}, {"body": "Its not going to affect the Western world that much. Since the invasion of ukraine we've severed all ties to russia. \nWe do not import their resources anymore and there are enormous sanctions in place. The only places that might get affected by this are the middle east with Iran and Asia with china. \n\nConsider the US is a net exporter of oil as well.\n\nHowever it does mean something else: \nRussia's ever increasing reliance on china and its pivot to the east in the chinese sphere of influence as means to keep funding the war effort in ukraine.", "score": 1, "replies": [{"body": "Severed all ties to Russia? You can't be serious. ![img](emote|t5_2th52|4271)\n\nThe supply chains have adapted. Wherever necessary, they started routing their crucial commodities from Russia via third countries and/or smugglers (at a premium). Commodity markets do not behave as some clueless delusional politicians (or their even more clueless citizens) wish them to. They will only make it seem so via made up commentary in mainstream media. Feels good, though, doesn't it?", "score": 1, "replies": [{"body": "As of September 2024, the West continues to impose heavy sanctions and restrictions on imports of many Russian goods, particularly in the wake of the ongoing conflict in Ukraine. However, some Western countries still import specific Russian products, though in significantly reduced volumes compared to pre-2022 levels.\n\nKey imports that continue to flow from Russia to Europe and the U.S. include:\n\n1. Energy Products: Although many European countries have drastically cut their dependence on Russian natural gas and oil, certain imports like liquefied natural gas (LNG) still persist, albeit at reduced levels.\n\n\n2. Metals: Russian aluminum and derivative products are still imported, though the U.S. imposes a 200% tariff on aluminum and derivative products smelted or cast in Russia, and similar measures are applied to steel and other metals.\n\n\n3. Non-Energy Commodities: Certain agricultural products like fertilizers continue to be imported into Europe due to their critical role in food production.\n\n\n\nOverall, the proportion of Russian goods imported by the West has significantly decreased due to sanctions, tariffs, and a broader pivot away from reliance on Russian supply chains. The most prominent exceptions are energy and select raw materials, often subject to very high tariffs or specific exclusions.\n\nAdmiteddly, severed all ties is a bit excessive, severed most of them is more accurate.", "score": 1, "replies": [{"body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}]}]}, {"body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}]}, {"body": ">...it’s been tested to be on par with individuals with PhD’s.\n\nI love you man but what the fuck does this mean? And how is their reasoning any different from the reasoning of anyone with common sense?", "score": 1, "replies": []}, {"body": "As a Russian, this is some solid DD.\nI bless your YOLOs!", "score": 0, "replies": [{"body": "Thanks dude", "score": 1, "replies": []}]}, {"body": "And then a full blown war starts in Middle East and all this DD goes to shit since the world would enter a whole different uncharted territory", "score": 0, "replies": [{"body": "Equally possible! But for now that hasn’t happened, and neither has this", "score": 1, "replies": []}]}, {"body": "I've got nothing to do for the next couple of hours, so if you have good questions you want to ask, ask them here and I'll let you know what it says. I know not everyone pays for GPT-Plus.\n\nNote: I only have 40 messages per week using this model, so make em good.", "score": -2, "replies": [{"body": "Should I buy the ruble?", "score": 3, "replies": []}]}]}
