{"title": "Amazon copied products and rigged search results, documents show", "selftext": "", "id": "q7vtxw", "created_utc": 1634201959.0, "score": 831, "upvote_ratio": 0.97, "num_comments": 81, "comments": [{"body": "Amazon search has always been horrific and anyone who has used it should know that. It pushes things that it assumes are good replacements for what you're explicitly searching for above those things you are actually searching for, as well as promotional products. \n\nAnyone ever try using Reddit search? <shudder>", "score": 30, "replies": []}, {"body": "They shorted the compétition", "score": 85, "replies": []}, {"body": "Yeah Amazon copies products thats what Amazon Basics is, I saw recently they even sell silk pillowcase sets ffs. They obviously saw it was a product selling well and decided they needed their cut of the market share. They’ll do that for all products which do well and can have a factory made/bought for on the cheap in China.\n\nEdit: I should add Amazon aren’t the only ones doing this but they seem to endorse it on their platform. Most sellers on Amazon now seek out hot products on the platform, then find a Chinese supplier and drop ship it at a premium. That’s how Amazon has become flooded with junk, and at this point it’s become a positive feedback loop too.", "score": 77, "replies": [{"body": "[deleted]", "score": 41, "replies": [{"body": "I trust wish brand name products as much as Amazon at this point. \n\nAmazon deletes your review if you try to tell others you received fraudulent merch.", "score": 12, "replies": []}]}, {"body": "They claimed they're not using Amazon Businesses data, which obviously is a lie but difficult for congress to act against them on since it's hard to prove. Amazon will claim coincidence after coincidence.", "score": 13, "replies": [{"body": "I could understand how they’d get away with it when it’s essentials like phone or battery chargers, but silk pillowcases? You’re telling me some exec just had the great idea that they’d sell well and didn’t have any data to base it off? Riiight. It really is just coincidence after coincidence how they find more ways to line their pockets.", "score": 2, "replies": []}]}, {"body": "Costco has been doing this for over 20 years lol", "score": 2, "replies": [{"body": "Fuck you are right but amazon mastered it", "score": 1, "replies": []}, {"body": "I’ve yet to buy a crappy kirklands brand though. They have qa not like the crappy Amazon drop ship.", "score": 1, "replies": []}]}]}, {"body": "What I’ve noticed and started doing lately, is any time there is something I want, I look for it directly on the company’s website first. Most of the time it’s the same price, there will be a discount code for 5-15% off if you do a little googling, and then usually a free shipping code if you do a quick google search and the shipping is usually pretty quick. \n\nThis way I know what I’m buying is legit and not some counterfeit knockoff (which is a huge problem on Amazon) , and I can support the company directly without giving any money to bezos for just being a middleman \n\nFuck Amazon.", "score": 18, "replies": [{"body": "The only reason I prefer zon is free returns. I was shopping for 2K product and seller website has 15% restocking fee. Not on zon though the price was higher. I chose zon and it was a good decision since I had to return it as the product was defective", "score": 1, "replies": []}, {"body": "Smart", "score": 1, "replies": []}, {"body": "Amazon can be used for products details, as they’re often standardized. It’s easier to compare the products", "score": 1, "replies": []}]}, {"body": "Why would you expect them to play fair?", "score": 57, "replies": [{"body": "An outdated sense of morality and a belief that we should hold ourselves to some kind of standard. Very much not in vogue these days.", "score": 25, "replies": []}]}, {"body": "Hahahaha! SCAMazon allowed a whole lot worse shit than this to happen on their platform. The pay to play review system they allowed to flourish for years and years made it so reviews became tools of deception sitewide! If you have no ethical concerns Amazon is a great way to fleece your fellow Americans! Amazon is too big to fail at this point, so this is our future now!", "score": 36, "replies": [{"body": "I would argue that it became so bad that it’s no longer just site wide but has spread across the entire internet.", "score": 13, "replies": [{"body": "Yup, when 4.5 of 5 stars is a sign of a questionable product, the system is broken.", "score": 14, "replies": [{"body": "Amazon has brick-mortar stores carrying products with 4+ stars rating from their website.", "score": 2, "replies": []}, {"body": "It's so broken... I feel like I owe an apology to all the young people my generation failed (I am Gen X). We should have fought the Boomers more diligently and not been open to letting them buy our loyalty. We helped them sell out America and I feel terrible about it. I knew better, but I was selfish. I got infected by ego and greed too. Who knows though, maybe  a future generation of Americans will be able to have the discipline and integrity to right this enormous, treasure ladened ship (instead of joining in the plundering of it).", "score": -2, "replies": []}]}, {"body": "Not eBay!! eBay gets a bad wrap but they are very strict with sellers, never have a product quality issue, I’m really not sure why people dislike eBay so much", "score": 3, "replies": [{"body": "Ebay is like taboo nowadays.  I use it more than Amazon. Once I noticed Amazon starting g to lump \"like product\" reviews together I quit using them. I even cut off my prime, why pay for prime for a few items I might purchase but don't really need asap anyways? \n\nThe system has been broke, people are just now realizing. Ebay cost nothing to use, they vet their sellers much more carefully, and they allow anonymous communication between buyer and seller (no risk of backlash for bad product reviews, broken items, ect).   Overall Ebay has the buyers back, Amazon doesn't.", "score": 4, "replies": [{"body": "Exactly! Took the words out of my mouth", "score": 1, "replies": []}]}]}]}]}, {"body": "I use to buy everything from Amazon. In fact I'd say about 70-80% of my online purchases are through Amazon. But a couple years ago I found out that this hair product I was using through Amazon was as straight up knock off. Since then I stopped buying any healthy/beauty products there. I also tell everybody to do the same. It's a shame tbh. Amazon is convenient and there are some great deals. But Amazon Basics, which forces third party sellers to go cheap, is making everything kind of shittier. \n\nI'm just happy Costco doesn't have third party sellers tbh.", "score": 6, "replies": []}, {"body": "this is like common knowledge so far\n\nIn fact I read it once from a 2 year old selling on amazon guide, 4 years ago when I worked for a company that wanted to sell stuff via amazon.\n\nThey talked about how selling on amazon is convenient but you risk having your product copied by amazon. They take their best sellers and roll out amazon choice product. Which is product they make themselves or they help push for money.\n\nIt's really a no-brainer. Amazon has all your vendor data and they see you are selling a lot of product, why wouldnt they want to cut you out? One of the few cases where the middleman cuts out the other middleman.", "score": 11, "replies": []}, {"body": "This is nothing new, I think there where some lawsuits regarding this in Germany a couple years ago.", "score": 6, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Its not funny at all you are just missing the point like so many others here....\n\nThis is not about right & wrong or principles. Its about healthy functioning markets, which would be severely impaired in long term by a mega corp like amazon.\n\nYou*=the company\n\nYou can abuse your power as much as you want and as long as your actions arent directly illegal and you are not extremely large operator.\n\nOnce you are big enough even legal attempts fall under sceutiny due to public interest.", "score": 4, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "I understand your point and you are not wrong :)\n\nIt is also common here in Finland for supermarkets.\n\nBut it isnt necesarily ironic because it isnt about equality or right and wrong in a conventional sense. Its simply a utilitarian decission to go after amazon eventhough it makes regulators \"hypocrites\".\n\nSorry im about to end up in analysis paralysis :D", "score": 1, "replies": [{"body": "Food is also a required good, not a luxury good of any sort.  Supermarkets making a cheaper competing version of an essential good isn't a bad function of the market at all- it's competition that keeps the price of said essential good tied to the cost of production, not MegaCorp A's desired profit margin.", "score": 1, "replies": [{"body": "Good point. This is true as long as it doesnt kill the competition which would lead to a price hike.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Just cancelled prime yesterday", "score": 5, "replies": [{"body": "I only keep prime for the tv portion of it", "score": 3, "replies": [{"body": "I only had it for the 2 day shipping but now even prime eligible items are taking 2-3 weeks where I live.", "score": 3, "replies": []}]}]}, {"body": "Amazon is such a scummy company", "score": 17, "replies": [{"body": "No, just normal company which has attained too much power.", "score": 14, "replies": []}]}, {"body": "Kroger, and I am sure other big grocers, put their house brands more at eye level than name brands, usually.  And often they have more in stock. To me, this is no different.  If you buy it and don't like it, you send it back.  If you live  close to a Whole Foods, ,they have a kiosk for returns.", "score": 22, "replies": [{"body": "It's more like if Kroger put their brands INFRONT of other brand on the shelf so you didn't even know there were other brands.", "score": 12, "replies": []}, {"body": "Yeah, this Amazon seems scummy to me, but I also know Walmart (Great Value) and Costco (Kirkland) and Kroger all do it, so I'm not sure if Amazon is violating something since it's industry wide.", "score": 0, "replies": []}]}, {"body": "In other news, water is wet", "score": 4, "replies": [{"body": "Water is actually not wet; It makes other materials/objects wet. Wetness is the state of a non-liquid when a liquid adheres to, and/or permeates its substance while maintaining chemically distinct structures. So if we say something is wet we mean the liquid is sticking to the object.", "score": 6, "replies": [{"body": "This guy fucks", "score": 5, "replies": []}]}]}, {"body": "Amazon provides a reliable service overall, but they really need to improve the search and review functions. Unless you are looking for a unique product like a specific book. most search results will be clogged with lots of generic knock-off products of unknown quality. \n\nIf the reviews actually worked you could just filter to find the reliable products, but since everything now gets 4-5 stars this isn't a very good indicator.\n\nBest to completely disregard 5 star reviews and read the 4 and 3 star reviews for a more accurate evaluation. Although I think some brands have caught on to this and started pumping out 4-star reviews that sound pretty similar to 5-star reviews.", "score": 2, "replies": []}, {"body": "Honestly..if they did not do it , i would have thought they were morons.\n\nAnd people that are surprised don’t really understand about business; we are talking about a private company.", "score": 3, "replies": [{"body": "A \"private\" company that receives ENORMOUS government subsidies.", "score": 2, "replies": [{"body": "Come one we are not in china..enormous what!?", "score": 1, "replies": [{"body": "https://www.goodjobsfirst.org/blog/taxpayer-subsidies-amazon-now-exceed-37-billion", "score": 2, "replies": []}]}]}, {"body": "Same applies for individual human behaviour as well.\n\nYou shirk responsibilities to maximize your own free time which in turn increases your utility up to a point.\n\nYou copy other peoples ideas and become free rider in projects for your own utility.\n\nYou withhokd information from your potential spouse to increase your own market value.\n\nYou cheat your spouse covertly in order to maximize your  utility function.\n\nYou secretly feed abortion meds to your pregnant lover because you dont want baby since it would drain time and financial resources thereby lowering your utility.\n\nAll rational!! People who critizise this are IDIOTS!!", "score": -1, "replies": []}]}, {"body": "This is news?  It was blatant on their site when looking for anything.", "score": 1, "replies": []}, {"body": "As the husband of an Amazon seller I can say Amzn does not have small businesses backs. They allow small sellers to be bullied by Chinese accounts and they continue to raise the barriers of Amzn seller entry. What was once an enjoyable market is now a constant battle for survival", "score": 1, "replies": []}, {"body": "https://youtu.be/5maXvZ5fyQY", "score": 0, "replies": [{"body": "Love Hassan he always has great takes", "score": 0, "replies": [{"body": "The Predatory Pricing bit was interesting and referring to Beezos as a Mexican-cheese pervert is a stroke of genius.", "score": 1, "replies": []}, {"body": "Hasan might be entertaining sure but he has barely anything to offer intellectually. He is a reactionary moral outrage provocateur, propagandist, which is all fine and good but that's all he is.\n\nHe is steven crowder of the left with the difference that many of the lefts policies would actually improve the majority of people's lives.", "score": 0, "replies": []}]}]}, {"body": "Not surprised. Big companies are notorious for doing stuff like this, stealing from the competition.  Big tobacco Phillip Morris is a good example, it’s alleged they copy (aka steal) the idea of products from small competitors and have made billions on those products.  \n\nThey have been sued quite a few times. Amazon is no better.", "score": 1, "replies": [{"body": "Yes, whole volumes of books have been written about Microsoft who stole vast amounts of IP from Apple and many other smaller companies back before anti-trust suits became a thing. Facebook itself was a stolen idea whom the CEO was sued for and settled for $300 million.\n\nVirtually every large conglomerate owed its success to theft in some way.", "score": 2, "replies": []}]}, {"body": "Dude, just open up the website.", "score": 1, "replies": []}, {"body": "Nooo, thats impossible !!!", "score": 1, "replies": []}, {"body": "This has been an open secret forever. Why are people acting surprised?", "score": 1, "replies": []}, {"body": "I wonder why this wasn't news when everybody who uses Amazon has known about this since Amazon!?", "score": 1, "replies": []}, {"body": "I try to use some specialty online retail stores. I don't want Amazon to become some monster that eats all retail.", "score": 1, "replies": []}, {"body": "Is anyone surprised. I always considered Amazon a cheap product playground. People saying Amazon is slowly becoming Wish are maybe just now waking up? The products have always been subpar. I just look up what I want on Google now then sift through that garbage.", "score": 1, "replies": []}, {"body": "They have been doing this for YEARS!!!!!!!!!!!!", "score": 1, "replies": []}, {"body": "This has been known for about a decade and regulators are only now looking into it?\n\nFun fact... Once small and medium business is destroyed it doesn't just come back.\n\nWe need regulators to identify anti-competitive policies and actually do something within that discovery phase (like a year) otherwise what's the point?\n\nThen the incentive for any enterprise is to utterly dominate and crush every competitor into the ground, regardless of any worry of future penalty. By the time the penalty comes the purpose is fulfilled anyway.", "score": 1, "replies": []}, {"body": "youdontsay.jpg\n\n&#x200B;\n\neveryone's known this for years", "score": 1, "replies": []}, {"body": "is this a surprise", "score": 1, "replies": []}, {"body": "What's an example of something that Amazon copied?\n\nLike a book?", "score": 1, "replies": []}, {"body": "supermarkets have been doing this for decades, if you want your stuff in the premium shelf space at eye level or the checkout line then you have to pay a lot of money to the store", "score": 1, "replies": []}, {"body": "Shocker. No surprise there. It's only a problem when the little guys/girls/people do it. For the big ones like Amazon, nothing to see here folks.", "score": 1, "replies": []}, {"body": "Is anyone surprised?", "score": 1, "replies": []}, {"body": "Oh no...They read the Chinese play book.", "score": 1, "replies": []}, {"body": "In India \n\nFor those who don’t read the article", "score": 1, "replies": []}, {"body": "Manoplazon", "score": 1, "replies": []}, {"body": "I mean yea their amazon basics tent was literally the same as my coleman tent", "score": 1, "replies": []}, {"body": "If smaller specialized online stores offered great customer service, they could all chip away at Amazon", "score": 1, "replies": []}, {"body": "And using all that profits to fund lawsuits with SpaceX.", "score": 1, "replies": []}, {"body": "It's actually far worse than what you are reading. They have over 400 private label brands all doing their best to copy and not only remove the competition but also remove the middle man. This short term lowers consumer cost but they can then own the ENTIRE supply chain. \n\nSource: work in the team doing it", "score": 1, "replies": []}, {"body": "I have a store on amazon. Amazon will take products that are simple. Little value add and they should. If you are selling something and you make above normal profit and there’s nothing proprietary then other sellers are going start supplying that product. Amazon has massive logistical advantage and they want to give the consumer the best price.  I think it’s fine. Provide value-add to the customer otherwise provide a low price. It’s how business works. Now amazon can cheat. Cuz they have all the analytics on sales and volumes etc. there are tools to give you that edge too but you just can’t beat them on price.", "score": 1, "replies": []}, {"body": "Amazon is just awful.", "score": 1, "replies": []}, {"body": "I really did not think this was something that was disputed?\n\nI mean did not most people think it worked like this?", "score": 1, "replies": []}]}
{"title": "IONq & Quantum Computers are already here", "selftext": "IONq is the first of many world changing quantum computer companies. Rigetti uses traditional superconducting quantum arrays that translate a little easier to conventional computers. The huge downside is the need for extreme cooling. Rigetti uses multi layers where the innermost layer is 100x colder than outerspace. Xanadu uses photonic systems that are great, and run at room temp but they need lots of additional hardware to work and will be difficult to scale down. Microsoft is working on topological arrays which would provide utility benefits but it hasn't been proven yet and they had to retract one of their papers on it. The point is that there are various methods to how you can create and manipulate qubits, the foundation for quantum computing.\n\nIONq uses trapped ions, from a single atom of ytterbium. Technically a rare metal but it's not rare. Then they manipulate the ions using lasers to create the qubits on the array. Sh*t is bleeding edge and I understand .005% of it but I read everything I can find. It can run at room temp and be easily scaled. Basically IONq doesn't need all the extra resources to create and manipulate their qubits, so the cost and energy requirements are down. This also allows for upscaling arrays on existing hardware. Like they can turn a 16 qubit system into a 64 qubit system eventually using the same stuff  they just have to reduce the expected errors that come with quantum computing.\n\nIONq got starting investment money from Amazon, Alphabet, Bill Gates, Samsung, Lockheed Martin, Hyundai, goldman sachs and more. They used that money to prove the tech works and are currently operating with Amazon Braket as their most powerful hardware supplier. Currently IONq has the most powerful trapped ion quantum computer in business operation at 32 qubits. The next closest comp is 16 qubits. And you can have 9 qubit, 11 qubits computers, it doesn't need to be doubled evenly like ram for instance. The CEO, Peter Chapman attended MIT when he was only 16 and was the technical director for Amazon prime before he founded IONq.\n\n\nRemember when you see qubit numbers in the future and from other companies, what that really means.\n\nQuantum computing is based on \"physical qubits\" and \"digital\" simulated qubits. Conventional computers use bits.\n\nNo matter what method you use, ions, photonic, superconducting, etc, You can't have a fully isolated qubit because then you couldn't interact with it to manipulate and tell it what to do. To get around this, modern quantum computing is based on running \"leaking\" environments with varying fidelity and trackable errors. We use the say 93% that is still functional to simulate more isolated qubits, and use those to simulate even more isolated qubits, in deeper layers until we have a fully isolated qubit we can error correct. \n\nEventually we need 1 million qubit machines to simulate 10k error corrected machines. IONq just demonstrated how they can scale up to a million at a recent presentation. Eventually a QPU could really lead to some radically advancements in financial predictions, cybersecurity and encryption, biotech discovery, simulation modeling and on and on.\n\nThey merged with $600m , $350m of which is pipe investment that is locked up for 6 months from now. Ran to $12 before merger, tanked to $10 at merger, tanked to $7.30 during spy correction and tech sell off. It was mostly shorts based on volume. They have tiny revenue because they are just getting started but that doesn't matter imo. They had that white house presentation to show off and IONq is the only pure quantum computer company on the market so far, with rigetti ipo'ing in a few months.\n\nThe pipe investment unlocks in 5 1/2 months and that could be the only negative event coming up. I'll decide what I do with my shares, closer to the date, either hold or sell then compound my gains to hold, maybe for life. It's bleeding edge tech and to try to simplify it more, instead of linear binary data, 1s and 0s. The data can be 1 and 0 at the same time in any ratio, in any direction. It's a bigger technological leap than people understand.\n\nThanks for your time!\n\n\nhttps://aws.amazon.com/braket/hardware-providers/ionq/\n\nhttps://www.businesswire.com/news/home/20211011005114/en/IonQ-and-University-of-Maryland-Researchers-Demonstrate-Fault-Tolerant-Error-Correction-Critical-for-Unlocking-the-Full-Potential-of-Quantum-Computers\n\nhttps://money.usnews.com/investing/news/articles/2021-10-05/amazon-and-google-set-to-attend-white-house-forum-on-quantum-technology\n\nhttps://www.techrepublic.com/article/ionq-puts-its-newest-quantum-computer-to-a-monte-carlo-test-with-partners-goldman-sachs-and-qc-ware/\n\nhttps://www.businesswire.com/news/home/20210927005262/en/IonQ-Expected-to-Go-Public-With-in-Excess-of-600-Million-in-Expected-Gross-Proceeds\n\nhttps://ionq.com/posts/december-09-2020-scaling-quantum-computer-roadmap", "id": "q7qmwn", "created_utc": 1634179296.0, "score": 185, "upvote_ratio": 0.93, "num_comments": 84, "comments": [{"body": "IonQ is a great high-tech company in a hot tech sector right now. The US is focusing on quantum computing as a national strategic important issue. IonQ is at the forefront of quantum computing.", "score": 44, "replies": []}, {"body": "I have made $25k on this one so far, I really like this company. I wish I would have jumped back in when it got killed last week.", "score": 28, "replies": []}, {"body": "You bastard, you almost got the best price. I have 2k shares for around $9 avg. Hoping that it goes to 7 again so that I can keep loading up more and more every week and every month. It will be a big payback soon...", "score": 21, "replies": [{"body": "It look like it's about to have a macd cross. As long as the market doesn't tank, I think it trends up.", "score": 9, "replies": [{"body": "Macd cross? Whats that", "score": 3, "replies": [{"body": "https://www.investopedia.com/terms/m/macd.asp", "score": 3, "replies": []}]}]}]}, {"body": "[here is my share position and I have calls too.](http://imgur.com/a/04QREUb)", "score": 15, "replies": []}, {"body": "Interesting stuff that could/will be a world changer. I have no idea which approach or company will lead this space, though.  Gonna read up!", "score": 11, "replies": []}, {"body": "Glad someone finally posted a DD here, tried to Sunday night but couldn't figure out why it was getting removed. \n\nAnother interesting recent development \n\nGoogle, who have their own world leading quantum computing arm, have been buying up IONQ en masse, I figure they're readying for a buyout to hedge their bets on quantum computing (their current stuff is all superconducting qubits) \n\n[https://www.sec.gov/Archives/edgar/data/1824920/000119312521297031/d859608dsc13g.htm](https://www.sec.gov/Archives/edgar/data/1824920/000119312521297031/d859608dsc13g.htm)   every entity listed here is an arm of google/alphabet", "score": 11, "replies": [{"body": "Awesome! Yea, its reassuring that google is pumping so much money into ionq.", "score": 7, "replies": []}]}, {"body": "I swear I'll read this tomorrow lol", "score": 10, "replies": []}, {"body": "A common complaint is that quantum computing is still very far away from fruition, but the money is pouring in now! First graph in [https://www.bcg.com/en-gb/publications/2021/building-quantum-advantage](https://www.bcg.com/en-gb/publications/2021/building-quantum-advantage) shows private investment has increased 10 fold in the last 5 years\n\nEstimated TAM for quantum computing as a service is >$50b in the next 9 years. (see [https://thequantumdaily.com/2021/08/19/quantum-computing-as-a-service-market-sizing-how-we-did-it/](https://thequantumdaily.com/2021/08/19/quantum-computing-as-a-service-market-sizing-how-we-did-it/) \r  \n ) and this is a conservative estimate, based on what we know quantum computers will be good for now\n\nestimated market  >$1trillion by 2035\n\n[https://www.consultancy.uk/news/24361/quantum-computing-market-to-reach-1-trillion-by-2035](https://www.consultancy.uk/news/24361/quantum-computing-market-to-reach-1-trillion-by-2035)", "score": 9, "replies": [{"body": "Peter Chapman said yesterday in the investor presentation that he believes the TAM for the IONQ quantum computing market is greater than the TAM for the current hardware and software markets combined", "score": 7, "replies": []}]}, {"body": "Oh! We are allowed to talk about 'em! Got 1000 shares... LFG!", "score": 9, "replies": [{"body": "Hope you're banking!", "score": 2, "replies": []}]}, {"body": "DD: How good is the quantum computing edge that IonQ has and how safe is their advantage? For companies like IonQ (high-tech) I like to check out their patents. IonQ seems to have a nice portfolio.\n\nCheck it out at the USPTO:\n\nhttps://patft.uspto.gov/netacgi/nph-Parser?Sect1=PTO2&Sect2=HITOFF&u=%2Fnetahtml%2FPTO%2Fsearch-adv.htm&r=0&f=S&l=50&d=PTXT&RS=%22AST+%2526+Science%22&Refine=Refine+Search&Query=IonQ", "score": 6, "replies": [{"body": "Yea I believe a new one last week!", "score": 6, "replies": []}]}, {"body": "Take my money!!!", "score": 6, "replies": []}, {"body": "I saw qbert .. Im in you son of a birch", "score": 8, "replies": []}, {"body": "Update: up 10% so far this morning!", "score": 6, "replies": []}, {"body": "Thanks for sharing this.. IBM and Honeywell also in my list.", "score": 6, "replies": [{"body": "Awesome! Yea im interested in the whole sector. Just IONq is the best one right now imo. Also trapped ions seems much more practical than superconducting or photonics. We'll see which works best for what applications.", "score": 8, "replies": []}]}, {"body": "This looks like the future. I'm in.", "score": 7, "replies": [{"body": "Hope you're banking!", "score": 1, "replies": [{"body": "\\+15%, thanks for this one!", "score": 2, "replies": [{"body": "Glad to hear!", "score": 1, "replies": []}]}]}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|9|**First Seen In WSB**|1 year ago\n**Total Comments**|2|**Previous DD**|[x](https://i.redd.it/aojxnubbwlh71.jpg) [x](https://www.reddit.com/r/wallstreetbets/comments/q7q11h/ionq_quantum_computers_are_already_here/) [x](https://www.reddit.com/r/wallstreetbets/comments/q7qmwn/ionq_quantum_computers_are_already_here/) \n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=q7qmwn)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=q7qmwn)\n    \nHey /u/X-2357, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 1, "replies": []}, {"body": "Are there any competitors?", "score": 5, "replies": [{"body": "I listed the top dogs in my first paragraph : )\n\nRigetti, xanadu, microsoft, and IBM\n\nOther than Google and Amazon who actually invest in ionq directly\n\nAdd in honeywell and dwave", "score": 10, "replies": [{"body": "Take my money 💦", "score": 8, "replies": [{"body": "Hope you banking!", "score": 1, "replies": []}]}, {"body": "Psi quantum (photonics) is probably the most relevant Competitor (rigetti have kinda fizzled out since they started) but I think it'll be a good few years before any other platform can compete with ions", "score": 6, "replies": []}]}]}, {"body": "This is so interesting. Too bad I just swore off spacs…. SMH.", "score": 4, "replies": [{"body": "It's not anymore. Merger already happened with just some residual stuff left like pipe investment.", "score": 6, "replies": [{"body": "Do you know when pipe investors are allowed to sell? Also, thanks for the informative DD. It's great to read a DD that's not a meme stock.", "score": 2, "replies": [{"body": "5 1/2 months from now.", "score": 1, "replies": []}]}]}]}, {"body": "Great timing with this DD... just starting to fly", "score": 4, "replies": []}, {"body": "Quantum computer is not new. Scientists been working on it for the past 40 years and the technology is no where near complete. I expect at least another 10 to 20 years to work it out", "score": 6, "replies": [{"body": "Yes the concepts are not new but the new developments in error correction are really changing things. Plus all the development since then...Technology advances at an exponential rate, of course in 20yrs it will be even more incredible. If you click on the first link to Amazon braket and became a customer, you could run a quantum algorithm on the cloud right now.", "score": 10, "replies": [{"body": "I will definitely keep an eye on this company but it will take a bit more for me to be an investor", "score": 5, "replies": []}]}]}, {"body": "Seems like a good investment, but after a 10% day? I’ll wait but Is a good look", "score": 3, "replies": [{"body": "Yea it moving fast this week for sure  but technically still at nav from the merger. Can go higher imo", "score": 4, "replies": [{"body": "I think it def will of higher but I’m not sure if buying in at these prices is prudent. Regardless great pick up for the future", "score": 3, "replies": []}]}]}, {"body": "Why don't you sell calls?", "score": 3, "replies": [{"body": "I'm here for the long haul and will probably do that and a lot of other strats lol", "score": 4, "replies": []}]}, {"body": "UPDATE: $10.77 today and maybe going for more.", "score": 3, "replies": [{"body": "I’m quite disappointed in myself…sold 11/19 $10 covered calls for $0.55 when it bottomed out…I’m the hole big on those….need this to trade below 10 until those expire", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Nice!", "score": 1, "replies": []}]}, {"body": "Couldn't agree more. People are always like: \"This sector is 10 years away. No revenue for 5-7 years at least.\" Blah, blah, blah.  And yet, here is IonQ. They have a viable product NOW. They are making revenue NOW. They are building very strong relationships in the worldwide community, including coding/software .... NOW. And they are trading on a major market NOW. People cannot admit, that just like electric vehicles, things are moving along MUCH faster than anticipated ... and IonQ has established itself as the unquestioned leader. Get on the train now or be left behind. $50 stock by spring. Likely a $150+ stock by late 2023.", "score": 2, "replies": []}, {"body": "UPDATE: 11.85 high so far today.", "score": 2, "replies": []}, {"body": "UPDATE: went over $15 lol", "score": 2, "replies": [{"body": "Aged well we’ve just begun", "score": 2, "replies": []}]}, {"body": "Entered today 👨🏻‍🚀", "score": 2, "replies": [{"body": "Nice! I think when I posted this it was $8, but this run has been amazing and really, its clear skies until pipe investment unlocks in march.", "score": 1, "replies": [{"body": "Why would it lower share price you think if we’re getting $350m injected? Does the number of shares increase at that time too?", "score": 1, "replies": [{"body": "No they already have the 350m, just those investors were restricted from selling. That restriction ends in March and usually some people take profit and sell.", "score": 2, "replies": [{"body": "Gotcha", "score": 1, "replies": []}]}]}]}]}, {"body": "FUCK YEAH LOVE COMPANIES WITH 2 EMPLOYEES", "score": 7, "replies": [{"body": "That was the spac, before merger. IONq has over 80 employees.", "score": 11, "replies": []}]}, {"body": "HEY WALLSTREETBETS, CAN YOU TURN IONQ GREEN FOR ME, THANKS\n\n&#x200B;\n\n\\- IONQ BAGHOLDER", "score": 6, "replies": [{"body": "I can’t find any of my green crayons", "score": 5, "replies": []}]}, {"body": "Lol what is \"100x colder\"..", "score": 3, "replies": [{"body": "The bottom layer of Rigetti's cooling zone reaches one hundredth of a Kelvin. I guess I could of said 100x as cold as outerspace. That why I think superconducting isn't as practical. The resource drain is crazy ti maintain those environments when Xanadu or IONq can run at room temp with photonics and trapped ions.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "Divide temp in K by 100?", "score": 1, "replies": [{"body": "That's actually exactly it lol Rigettis machine goes down to a hundredth of a kelvin.", "score": 2, "replies": []}, {"body": "Lmao nice", "score": 0, "replies": []}]}]}, {"body": "Update: $32 from 7.50 callout here lol", "score": 1, "replies": []}, {"body": "What are your thoughts OP?\n\n  \nI missed out on Nvidia in 2004 after winning a class stock competition with the stonk. Looking for the next and found this. Seems like A good buy since the heat is off with the current AI boom.", "score": 1, "replies": []}]}
