{"title": "Suggestions on what fairly low-risk shares to pick up?", "selftext": "I’m pretty new to investing, but have a few extra hundred to put in this week. My long-term stocks are pretty set (VTI, GOOGL, AAPL, MSFT, etc). Planning to pick up more NVDA, BLK already. Debating on CARR, ALGN, just wondering if there are any decent ones to consider.", "id": "p94bz0", "created_utc": 1629599240.0, "score": 21, "upvote_ratio": 0.85, "num_comments": 60, "comments": [{"body": "Since you already have Apple and Microsoft,\n\nVisa\n\nMastercard\n\nDisney\n\nCostco\n\nI wouldn't consider AMD, Nvidia, and Taiwan Semiconductor (TSM), very very low risk, but I like their rate of return in terms of their risk", "score": 10, "replies": [{"body": "AVTR \nA (agilent) \nISRG\nMSFT", "score": 2, "replies": []}]}, {"body": "GM is currently getting hammered due to 'conservative' guidance in their last earnings report (but otherwise a good one) & now the continuing Bolt debacle (LG batteries failing due to manufacturing flaws) that's going to cost ~$1.8B, but they're pursuing litigation against LG for at least some of these costs.\n\nSo right now the stock has been beaten down to ~5.6 PE (TTM).  Which given their Cruise (not Cruz) self driving tech, push to EV & overall great company books seems to be a bit too punishing.\n\nThe Bolt expanded recall just broke after-hours Friday... so I wouldn't rush to buy on Monday.  Just wait a bit and see how the market reacts (it was down a $1 in after-hours Friday).  But could present an even better buying opportunity for those willing to hold for a bit.", "score": 11, "replies": [{"body": "Yea I'd invest in the company that thought NKLA was a sound choice.", "score": 2, "replies": []}]}, {"body": "I might get downvoted here, but I see SMG as a low-risk right now at its current stock price. P/E of 16, pays a dividend, $250 million stock buyback this quarter, and great future growth from its Hawthorne division. Weed is the future and Scott’s is well positioned for it.", "score": 5, "replies": [{"body": "Thanks for the tip, that stock is looking pretty nice at the moment. Weed sector has been getting hammered lately though.", "score": 2, "replies": [{"body": "It has, but I feel SMG is a pragmatic approach to the weed industry. As more states legalizes cannabis, it just means more sales for Hawthorne products. Also, unlike a lot of weed sector companies, Hawthorne is profitable and has their lawn and garden division providing steady cash flow. Too me, it’s a can’t lose at its current share price. But that’s just my opinion; hope it helps.", "score": 1, "replies": [{"body": "For sure, picks and shovels. Why did the price fall so much over the last year? Seems at the very least caught back up with it's former trajectory from a purely chart gazing standpoint (all I really know how to do).", "score": 1, "replies": [{"body": "Could be what you said, coupled with getting caught up with the downfall of the entire weed sector. When Biden got elected the entire sector shot up; it’s since came down. Until weed is legal, the entire  industry will have its ups and downs. Best to buy on the downs though right? Lol", "score": 1, "replies": [{"body": "Yeah, I'm in the red with MSOS now, but may add more still. I wonder if a respiratory disease pandemic has anything to do with the sector taking a big hit.", "score": 1, "replies": [{"body": "I don’t feel it’s COVID related simply because the sector hit all time highs during this period. I honestly feel it’s the legalization aspect. A lot of money can’t pour into the sector right now because it’s an illegal industry on the federal level. Weed companies can’t even get loans right now because the government won’t allow the banks to do so. You can’t buy weed with a credit card because once again the government won’t allow it. Once they change the banking laws regarding weed and change the legality aspect, the industry will take off and legitimize. But that’s just my take on what I’ve been reading.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "If you want low risk look at dividend stocks like JNJ, KO, T, PG, CL.  Medium risk, stick to the large cap proven performers similar to what you already hold like FB, NFLX, AMZN.", "score": 4, "replies": []}, {"body": "So far, I'm seeing some fairly silly picks for what people deem \"low risk.\" My guy, you got the right idea with MSFT because as far as tech goes, that's as safe as you can get IMO. Low risk is boring and unsexy otherwise, and it will either keep you green or out of the thick of the weeds these days. CARR would be a great pick as both a safe and long-term winner. I'd also pick DIS, WM, and LKQ.", "score": 4, "replies": []}, {"body": "tsm, pypl, amat, lrcx, sbux and qcom.", "score": 3, "replies": [{"body": "Semi equipment companies like AMAT and LRCX are at a good price to buy in right now.", "score": 1, "replies": []}]}, {"body": "CRM", "score": 3, "replies": []}, {"body": "BRKB, V, MA, AXP, LVMH", "score": 5, "replies": []}, {"body": "BRK.B, V, PYPL, PG, JNJ, KO", "score": 2, "replies": []}, {"body": "I think the ship sailed on ALGN being a killer deal - I was in for $150 and sold at $200 for a nice profit.  FML.\n\nIt does just keep going up though...\n\nIt's kind of amazing how their competitor Smiles Direct (SDC) is just getting wtfpwned, and I was in on that at $13 thinking they could scoop up some market share with smart marketing and a lower price.\n\nNow I'm hoping that ALGN will just buy them out and I'll get a few shares of ALGN back.", "score": 2, "replies": []}, {"body": "DAL, FDX, MA, GM/F", "score": 2, "replies": [{"body": "Could throw in LUV as well, due to their cash balance", "score": 1, "replies": []}]}, {"body": "Some people don’t know what low-risk means. Maybe go back to you know where. I would say V, SBUX, MA and JNJ", "score": 2, "replies": []}, {"body": "Gud.to and vvpr maybe", "score": 1, "replies": []}, {"body": "$SOFI is a great starter. Price target in the $20’s!", "score": -3, "replies": [{"body": "I dont think this falls under the category of \"Fairly low risk\". I think its more speculative", "score": 17, "replies": []}, {"body": "SOFI is hardly a low-risk stock.", "score": 11, "replies": [{"body": "At this price it is", "score": -1, "replies": [{"body": "It won’t start making a profit til 2023. How the hell is that a “low-risk” investment? It’s not low-risk; it’s a speculative investment.", "score": 5, "replies": [{"body": "You'll see.", "score": -1, "replies": []}]}]}]}]}, {"body": "PM DKNG BUD RICK", "score": 1, "replies": []}, {"body": "My holds right now that are low risk imo are... NET, INTC, AMD, SE, V, ENPH (and CRSR but some others wont think thats as safe)", "score": 0, "replies": []}, {"body": "I like PLL. They have a deal to supply Tesla with Lithium starting next year. Price just dropped a bit over misunderstanding with permits, but was corrected and is going back up. PFE is also looking for the FDA approval for covid vaccine. I think that announcement was after market Friday. I also like GM which is on sale right now,  F, and SPY.", "score": 0, "replies": []}, {"body": "SPRT is my pick", "score": -6, "replies": [{"body": "A stock that went 4x in one year with a market cap of $200M is low risk?", "score": 5, "replies": [{"body": "TY, this is the opposite of low risk.\n\nDum dums spending too much time in you know where", "score": 1, "replies": []}]}, {"body": "Ya...no", "score": 2, "replies": []}]}, {"body": "DKNG (gaming) + RBLX (Metaverse)+ FUBO (streaming)+ LCID (EV).", "score": -6, "replies": [{"body": "Lol no", "score": 1, "replies": []}]}, {"body": "SPRT short squeeze starts tomorrow", "score": -1, "replies": []}, {"body": "HUIZ. by far the lowest value highest upside stock in the market", "score": -2, "replies": [{"body": "expecting them to pick up? thought they had been on a downward trend but i could be wrong", "score": -1, "replies": []}]}, {"body": "$SPRT", "score": -5, "replies": []}, {"body": "$NIO, $CLOV, $WISH, $BABA, $BA. \n\nRight now, you can’t really go wrong with any Chinese stock. Value investors dream come true.", "score": -12, "replies": [{"body": "You might have a different definition of low risk.", "score": 3, "replies": [{"body": "Right now, these are the lowest risk stocks. In 6 months, people will be like, “why tf didn’t I buy back then?”", "score": 1, "replies": []}]}, {"body": "Bagholder spotted", "score": 1, "replies": [{"body": "Nope, I’ve just bought into most of them.", "score": 1, "replies": []}]}]}, {"body": "WMT not only as a defensive consumer staples (and inflation hedge) but because it has a low beta, meaning it doesn't move with the market. Also barely in the green for the year and likely where big money is looking for value. Not to mention it does well during covid and as you know the delta strain may cause more people to pull back.", "score": 1, "replies": []}, {"body": "BRKB VNQ reit btw\nKO \nVONG", "score": 1, "replies": []}, {"body": "ASML", "score": 1, "replies": []}, {"body": "BRK.B for sure. It’s one of the most “boring” stocks with low volatility and steady growth. Also, if you have the capital, GOOG is one to check out; it doesn’t move a lot in either direction, but it seems to always trend up.", "score": 1, "replies": []}]}
{"title": "$TSLA Daily Investor Discussion - August 22, 2021", "selftext": "# This is the daily fun thread/chat. 🥳🚀\n\nAll topics are permitted in this thread.\n\nSee our Monthly thread for more in-depth discussions about news/thoughts/opinions about Tesla.\n\n^((This thread should not be construed as investment advice or guidance.))", "id": "p96fvj", "created_utc": 1629608423.0, "score": 18, "upvote_ratio": 0.91, "num_comments": 66, "comments": [{"body": "Just drove south on highway 580 between Richmond and Emeryville.  Saw 4 car carriers loaded with 3s and Ys on the other side of the freeway headed north.  On a Sunday afternoon.  Bullish af.", "score": 13, "replies": []}, {"body": "Something to watch this weekend if you have 10 minutes:\n\n[FSD Beta 9.2 takes on narrow streets in the Berkeley hills](https://www.youtube.com/watch?v=SuZYACWhYSI)", "score": 12, "replies": [{"body": "Most people have no idea how far Tesla already is with FSD. Google is out. They are stuck with a system that only performs well in fenced-off areas. In particular, all the lidar approaches are out. And then there is MobilEye. They have a very good system, but it has serious downsides, like requiring HD maps. With HD maps you can do with less intelligence in the car. Obviously, I prefer Tesla's approach that requires a much more sophisticated AI and will be much more generally applicable. Also impressed by [comma.ai](https://comma.ai).", "score": 15, "replies": [{"body": "Tesla’s focus on training in vector space is truly groundbreaking. Excited to see where this goes.\n\nWonder if we’ll see some point cloud stuff. Maybe with ideas from Hinton’s capsule architecture.", "score": 3, "replies": []}]}]}, {"body": "I'm looking to buy in on tesla as I'm a long term bull on the company - I'm new to investing and haven't got a lot of money so it would probably only be like 1 share if that (with plans to grow that position as money comes in). Is there any right time to invest or does it not matter as I'm in it for the long run - it looks as though theyre at a bit of a lower point right now so my limited knowledge tells me to just get in now but was wondering if anyone who knew alot about this sort of stuff could inform me? Thanks!", "score": 11, "replies": [{"body": "Honest recommendation from someone who just started buying shares at the beginning of 2020 after following the stock for years but being too chickenshit to buy in:\n\nThe best time to buy was yesterday, the next best is right now\n\nI strongly recommend starting with something that allows fractional shares (like Stash) and if you can afford a whole share now, buy it. Then decide an amount you can safely live without and set a weekly recurring investment (personally I'm currently dropping 50$ into tesla on my stash every week, but my stash isn't my main investment account so I actually end up buying more tesla a week than just that)\n\nAfter that, if you ever see it dip, you can buy larger amounts with any money you've been saving in a rainy day fund", "score": 17, "replies": [{"body": "I totally agree with this. If you look at the stock price from a probability perspective it has always a higher probability to go up tomorrow than down (except in rare occasions such as recessions). Therefore time on the market beats timing the market.", "score": 6, "replies": []}, {"body": "Thank you! This is really useful - going to place my order later tonight then once I've done my final bits of research! Thanks again", "score": 1, "replies": [{"body": "What research do you have left to do?", "score": 2, "replies": [{"body": "Double check the balance sheets etc. I have already done it but I like to take a final look just incase I made a mistake somewhere. I'm still going to invest anyway because I support Tesla but I just like doing it as I'm learning each time I take a look and figure out what stuff means :)", "score": 2, "replies": [{"body": "Nice! Always good to do your own DD! This group is great too if you have questions about the financials.", "score": 2, "replies": [{"body": "Okay great- I am new to reddit but will definetly be asking some more questions then!", "score": 2, "replies": [{"body": "If new, dont sweat the volatility either. You buy and it drops you can feel terrible or you buy and it goes up you feel like a star. Be aware of price movement and how you treat yourself and others around you. You will will eventually become numb and focus on what the compaby is doing 5 years out and not the price it is today. Coming from VT and chill its a big difference.", "score": 5, "replies": [{"body": "Thanks for the advice!", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "5’8” = 4’20”\n\n1st :-)", "score": 16, "replies": [{"body": "Omg", "score": 4, "replies": []}, {"body": "Simulation ✅", "score": 4, "replies": []}]}, {"body": "Do you think Tesla will do drones. And not only eVTOLs ?", "score": 4, "replies": [{"body": "I wonder... Elon said doing evtol will fry his brain but then reveals tesla bot..", "score": 6, "replies": [{"body": "Well, when he said it tesla bot was probably a thing already behind the curtains.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Actually, there is an atmosphere on Mars eVtols can totally work", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "There’s also less gravity there. And less air resistance just means spin faster. Modern jets if they can fly to thinner air and still get enough oxygen — they would as it’s way more efficient", "score": 1, "replies": []}]}]}]}]}]}, {"body": "they need to catch up to Hyundai\n\nhttps://www.youtube.com/watch?v=A33Yu-9rgxo", "score": -6, "replies": [{"body": "🤨 ? In CGI you mean ? 🤣\n\nI was speaking about drones like for deliveries", "score": 11, "replies": [{"body": "https://evtol.news/hyundai-s-a1/\n\nthey are also into robots plus they have this 'tiger' concept", "score": -2, "replies": []}]}, {"body": "Cool cartoons", "score": 7, "replies": []}, {"body": "Wow, what is this anime called?", "score": 5, "replies": []}, {"body": "Hyundai seems to hold a good deck, I bought some right after they bought Boston Dynamics.", "score": -1, "replies": []}]}]}, {"body": "I'm very interested in hearing George Hotz thoughts on the AI day. I hope Dave or Rob interviews him soon on the matter.", "score": 7, "replies": [{"body": "I imagine positive., Because comma uses end to end neural networks and karparthy said that end to end neural is their endgame. Tesla transitions more and more functionality from the implicit programmed portions to the neural side. In the end ist could be a similar approach as comma. Only with way more data and compute", "score": 4, "replies": []}, {"body": "Dave Lee’s interview with Hotz was fascinating and he’s an interesting character but I got the impression that Hotz was comparing his system which is mostly focussed on highway driving to Tesla’s system which does city streets. Apples and Oranges kinda.", "score": 5, "replies": []}]}, {"body": "Haven't read much on the announcement that HW4 comes with camera upgrades. Maybe they'll replace the rearward looking side cameras with a two-camera module that is able to see the sides as well. \n\nI've seen a lot of 'creeping forward for visibility' on FSD videos, because it's dependent on the B pillar camera for some scenarios, which results in the front of the car almost being on the road. Thoughts?", "score": 6, "replies": [{"body": "I'm under the impression the new cameras are just higher resolution.\n\nHaven't heard anything about more cameras being added. I doubt it because they might've said something about the robot getting more cameras, instead of the same number. This assumption is a stretch, though. I do think it'd be a nightmare for them to maintain different suites of FSD/AP code to accommodate the additional cameras. Eventually current setup would go the way of the sunset legacy.\n\nAs far car creeping forward almost too much, we'll that's OK. Almost isn't enough. The boost update allows for it to be more aggressive, and in future updates it will be applied in more scenarios. \n\nI forget who said it, maybe Dave Lee, it doesn't need to be perfect but it should be able to correct its mistakes. So if it has to pull out to look, and an unsafe situation arises it should do whatever the most appropriate thing is.\n\nThis could be backing up if possible. Or if not possible take the turn in the other direction. Or perhaps execute the turn into a different lane that's not as risky. Or just straight up gun it to the speed limit even. None of these are terribly difficult.\n\nThere's always gonna be a blind situation out there. First time I got pulled over was by a cop on the other side of the road from me. From my pov it was blind. I creeped out so far finally a car was coming, so I punched it.\n\nThe officer asked me what if they'd been speeding. I said if they didn't slow, I'd have been hit which sucks but that's how it is. He didn't like the answer. I reiterated it's a blind turn, and he should work on a solution such as getting a mirror up if he doesn't like the risk. He let me go. No mirror or anything else has been done to improve the intersection.", "score": 5, "replies": [{"body": "Perhaps the cameras will also be a wider angle?  Reduce or eliminate blind spots?", "score": 1, "replies": []}]}, {"body": "Let’s assume, as Elon has stated, that the current camera setup is good enough for full autonomy. I think there are still a bunch of good reasons to increase the resolution of the cameras. \n\n1. Higher resolution may result in better predictions and less error, but may require more processing, and thus HW4. That said, many of the NNs can be shared between HW3 and HW4 cars. It’s important to plan for the future and keep improving, even if there is no plan to upgrade old cars which will eventually be out of circulation anyway. \n2. The higher resolution clips might be better for the video labeling pipeline. It might be it’s not needed for in car inference and driving, but helps a lot in knowing the truth for semi supervised leaning and auto labeling.", "score": 7, "replies": [{"body": "Higher resolution usually means smaller pixel size, which means less sensitivity and more prone for sporadic defects. Source: scientific camera expert.", "score": 9, "replies": [{"body": "You’re telling me a higher resolution camera captures less detail?", "score": 3, "replies": [{"body": "As everything in engineering, it's a trade off. You are trading resolution for a lot of problems", "score": 3, "replies": []}]}]}, {"body": "There's also the possibility to increase the frame rate of the video pipeline...", "score": 2, "replies": []}, {"body": "If the current hardware is good enough for FSD, that means Tesla is taking responsibility of accidents on FSD, ie pretty much paying for the cost of insurance.\n\nThe cost of insurance for human drivers is non trivial (not that far from the cost of FSD actually, my google skills reveal an average of $185/month). Surely, the insurance would costs less for Tesla, but on the other hand, that insurance would have basically a $0 deductible, so I don't know, ballpark, the insurance costs about the cost of FSD.\n\nIf they can really get HW4 to be an order of magnitude more reliable/safer than HW3, it seems like it might be plausible for Tesla to retrofit HW4 than to pay for the insurance (or rather pay for the accidents) of HW3 cars...", "score": 1, "replies": []}]}, {"body": "Hasnt Elon said that the current cameras are useful enough? Like they werent even used to their full Potential?", "score": 5, "replies": [{"body": "He stated that current HW3 is capable of driving 2-3x safer than humans with FSD1. He also stated that HW4 will be around 10x with FSD2", "score": 4, "replies": [{"body": "HW5 would allow you sign up for a demolition derby and come away without a scratch.", "score": 6, "replies": []}]}]}, {"body": "Just talking out of my butt, but HW4 is starting to smell like cameras with integrated ASICs that send along vector space data.", "score": -1, "replies": []}]}, {"body": "Unpopular opinion: Tesla is an AI company first and and an EV car company second \n\nFSD is the first product that’s developing the neural net via Dojo. \nTesla bot is going to be the second product that’s developing the synthetic brain via Dojo. \n\nFSD will allow Lv. 5 autonomy when complete.\nSynthetic brain will allow Labor bots when complete.", "score": 8, "replies": [{"body": "Tesla is an Auto company in the same way that Amazon is a bookseller.", "score": 18, "replies": [{"body": "Amazon sells books?   Oh yeah...  I forgot!  Have not bought a book from there in quite a while.", "score": 2, "replies": []}, {"body": "Except 90%+ of Tesla's revenue comes from selling cars and that is not changing in the next 5 years.\n\nAutomotive business is one the highest revenue businesses in the world. Books are not.\n\nWhy is it so important to push narrative that Tesla is an energy company or an AI company when those things are few percent of its sales? Dishonest.", "score": 0, "replies": [{"body": "Basically a car company first and foremost, but the only one that's fully vertically integrated, which is why we say not \\*just\\* a car company. \n\nIt's plausible that within 5-10 years software, energy, and auto revenues will all be around the same. Cars will continue to be the most visible products.", "score": 0, "replies": []}, {"body": "Did you see AI day? Have you checked the experts response to the tech on display there? \n\nInvesting is about projecting where things will be not just where they are now.\n\nWhat the hell is dishonest about that?", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Okay I just love how I can’t decide which of three obscenely lucrative industries that Tesla is currently dominating in\n\nshould be considered their primary industry", "score": 6, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "True — which means that I also love how other insanely profitable industries are lining up to be numbers four five etc", "score": 5, "replies": []}]}]}, {"body": "I think it's going to be a car company first, because it was a car company first :P Also their cars will be their most visible product so it will be hard to change peoples perspective.", "score": 2, "replies": []}, {"body": "I'm not as sold on this one. The energy products, especially grid batteries, are much less technically advanced and much easier to reproduce.  Plus they are much lower margin, they'll always probably be around 10-20% in the best case.\n\nIf they win at it, it'll be because of manufacturing and battery technology, not really much to do with the end product, as other companies will have very similar products, but perhaps be limited in volume.", "score": 1, "replies": []}]}, {"body": "It’s the perfect pivot if they can swing it. And their odds seem better than most. \n\nWould love to see this company bring the Asimov novels of my childhood to life. I just hope their focus on ethical AI is honest.", "score": 4, "replies": []}, {"body": "Everyone needs to come down off their AI day high.  Tesla is foremost an automobile and energy company before an AI company.", "score": 3, "replies": [{"body": "Today, I think you’re right. But not for much longer…", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Also depends on workers and morale. Just a personal thought of mine.", "score": 5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "People are doing the final QC, I believe. Robots installs the panels, most of the interior and does the paint job.", "score": 2, "replies": []}]}, {"body": "Also the penalty for missing something on your watch…", "score": 1, "replies": []}]}, {"body": "I think it strongly correlates with the building. I imagine it’s much easier to have fewer errors with tools that you built from scratch for the job vs a hodge  podge of tools hacked together in suboptimal configuration.", "score": 3, "replies": []}]}, {"body": "Doug demuro deep thoughts on Plaid:\n\nhttps://www.reddit.com/r/teslamotors/comments/p9qg1t/umarquesbrownlee_interview_with_udougdemuro_on/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "score": 2, "replies": []}, {"body": "because I enjoy negative karma \n\n100 solar roof slots & they have 57 remaining & 43 sold/completed\n\nhttps://www.weddleandsons.com/tesla\n\nbut humanoid robot job opening are posted & a ton of cell jobs", "score": 2, "replies": []}, {"body": "Anyone know if i should roll my tesla option for 09/17? I need it hit 750", "score": -8, "replies": []}]}
{"title": "EUA vs. FDA Approval: how $PFE overcomes the shadow of $MRNA", "selftext": "Apes,\n\nThis is not financial advice. It's a guide on how tendies are good for your health.\n\n**Table of Contents**\n\n* Introduction\n* EUA vs FDA Full Approval\n* Time to get cuckold, $MRNA, $PFE just took the 100mg Viagra and is your wife's boyfriend\n\n**I. Introduction**\n\nOn 8/20/21, during after hours, $PFE had two breaking news:\n\n1. EU marketing authorization of its Xeljanz, treatment against arthritic conditions ([source](https://www.yahoo.com/now/xeljanz-tofacitinib-citrate-receives-marketing-203100843.html))\n2. FDA Full Approval of $PFE COVID vaccines ([source](https://www.cnbc.com/2021/08/20/full-approval-for-pfizer-covid-vaccine-could-come-from-fda-monday-report-says.html))\n\nSurely, these headlines are fuel for our rocket ships to the moon? Maybe, maybe not. Headlines shouldn't convince you to invest in something, otherwise you'd pull out on that $CLOV Shitenburg piece right? (wink wink) You should understand what the fluffs are so that you have full conviction on the play. This discussion is to accomplish exactly that, to point out the important differences between an FDA Full Approval vs. an EUA and why it's time for $PFE to fucking fly.\n\n**II. EUA vs FDA Full Approval**\n\n* **EUA**: emergency use authorization is when the FDA requires only half of the samples to be monitored for 2 months post-vaccinations (i.e. taking a short-cut or reading a WSB DD to gamble 100% of my savings)\n* **FDA Full Approval**: is when the FDA requires ALL of the samples to be monitored for a minimum of six months post-vaccinations, including examinations beyond the vaccination side effects such as manufacturing and inspection qualities (i.e. doing u/DeepFuckingValue level of DD before investing)\n\nIf the examples are insufficient, an EUA is like your mum telling you tendies are good for you while an FDA full approval is like a doctor telling you the tendies are so good, you shouldn't just stick it down your throat, but also up your ass and your wife boyfriend's ass.\n\nWhat's the point of comparing the two? Well, it's simple. All COVID vaccines as of date, have not received the FDA Full Approval including $MRNA, $JNJ, etc. but $PFE will this upcoming week. Do what you will with this information but speculations from my end is that, with a fully approved vaccine, I'd imagine $PFE will be mandated for the 30% unvaccinated U.S. adults (I mean, google \"vaccine passports\" and the timing of this approval is just too perfect) and $PFE will be distributed globally to countries that desperately need vaccines (e.g. VP of US, Kamala, traveling to Vietnam and SEA, presumably to discuss distributions to the desperate lockdowned regions).\n\n**III. Time to get cuckold, $MRNA, $PFE just took the 100mg Viagra and is your wife's boyfriend**\n\nThrough the entirety of the 2020 outbreak and our recovery in 2021, $MRNA took the spotlight. Here are three reasons why $PFE will overcome the shadows of $MRNA:\n\n* With $MRNA low floats and high volatility (evident by a beta of 1.49), $PFE laggard ass got cuckold with its low beta of .67 (almost as low as Great Grandfather Buffet's favorite darling, $KO, with a beta of .63). So, for $PFE to shine, it'll need a similar price action as $MRNA, right? Well, so how the fuck does $PFE get there with 5.6B floats? With the aforementioned headlines. After the two breaking news dropped, $PFE made the \"V formation\" in after-hours on 8/20/2021, V for 100mg Viagra erection movement; a formation defined by yours truly.\n\nhttps://preview.redd.it/r2we4s7uiti71.png?width=636&format=png&auto=webp&s=ce681e5733e4ee3c58fc1ec70dba4b3129093af9\n\n* Again, another speculation, but let's play a game: who between $PFE, $MRNA, $JNJ would be the most likely to get FDA full approval before everyone? You'd probably guessed $MRNA a month ago. It's also possible that investors thought that $MRNA of all vaccine players would have the highest likelihood to receive the full FDA approval before others. Well, the tides have turned and $PFE just won this arm race.\n* As $PFE get the full approval announcement, $MRNA gets a bad data news regarding the side effects of its COVID vaccines and is rumored to be probed by the FDA ([source](https://www.barrons.com/articles/covid-vaccine-side-effect-myocarditis-moderna-pfizer-51629474879)). I took Moderna vaccines, so if $PFE rockets this Monday on 8/23/2021 and my 150 call options flies but I die from the side effects, then apes, please take my tendies and give it to my wife's boyf", "id": "p943z9", "created_utc": 1629598308.0, "score": 53, "upvote_ratio": 0.85, "num_comments": 64, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|14|**First Seen In WSB**|2 months ago\n**Total Comments**|262|**Previous DD**|\n**Account Age**|4 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Hope so chief. I’m balls deep in PFE\n\nI took the PFE vaccine though, so I’m practically an employee there", "score": 33, "replies": [{"body": "One of us\n\n\nOne of us\n\n\n Can’t wait for annual 6-12mo boosters. The profit. Can you even imagine ? Multiple tens of billions of dollars guaranteed annually.", "score": 3, "replies": [{"body": "Priced in :'(", "score": 1, "replies": []}]}]}, {"body": "I'm holding some 60c $1.54 avg and lost a ton of money so hopefully, you're right!", "score": 8, "replies": [{"body": "I'm at a $1.61 avg for my 9/24 53c. Was buying and selling calls the re buying them on the dip, bought back in early Wednesday and got F'd on the tapering news like everyone else. I'm looking to sell come Monday, if PFE at least holds these gains I can sell at break even hopefully", "score": -2, "replies": [{"body": "Do you believe in PFE going $60+?", "score": 4, "replies": [{"body": "No, I think it's max at 53 or 55 this year before a pull back to 47", "score": 1, "replies": [{"body": "Gay bear", "score": 3, "replies": []}]}]}]}]}, {"body": "I salute you! 🦾", "score": 4, "replies": []}, {"body": "Well golly gee I hope I can get in Monday", "score": 3, "replies": []}, {"body": "I don’t necessarily disagree with the prediction that PFE will be the predominant vaccine, but I think it’s misguided to compare MRNA and PFE. The better comparison is MRNA and BNTX. \n\n1. Pfizer is an established pharma company with 300+ products, they’re already worth way more than Moderna by market cap. \n\n2. Moderna owns the mRNA tech that they built the vaccine on. They’re valued on the potential of that technology, not just the covid vaccine. Pfizer is not an mRNA company.\n\n3. BioNTech own the tech that the Pfizer vaccine was built on and they have a 50:50 split agreement. Even if The PFE/BNTX vaccine sells twice as many doses as the MRNA vaccine, PFE will only get half of that revenue.\n\nMRNA and BNTX are both mRNA biotech companies and their valuations are based on growth potential. PFE is the beneficiary of an agreement with BNTX to co-market their COVID vaccine. Besides that deal, PFE is the same company it was before the pandemic, so the growth valuations on the mRNA companies shouldn’t apply to PFE. Obviously, the vaccine is very valuable but PFE has already gained $60B in market cap this month.", "score": 3, "replies": []}, {"body": "![gif](emote|free_emotes_pack|upvote)", "score": 3, "replies": []}, {"body": "Instructions unclear, bought delta 60c that expire next week", "score": 6, "replies": [{"body": "That makes no sense lol.", "score": 5, "replies": [{"body": "bc delta is going to fuck everyone up. totally the same delta, right?", "score": 1, "replies": [{"body": "This also makes no sense", "score": 4, "replies": [{"body": "Jesus you must be real fun at parties dude", "score": 1, "replies": [{"body": "This makes sense.", "score": 3, "replies": []}]}]}]}]}, {"body": "> delta 60c\n\n\nYou can buy a 60 strike call but “delta” doesn’t make sense here. Delta is a Greek or a covid variant.", "score": 2, "replies": [{"body": "The airline, dude, ticker DAL. People have been making jokes about buying puts on delta airlines because of the delta variant and people getting confused like they did with Coronavirus and Corona beer last year lol", "score": 3, "replies": []}]}]}, {"body": "Holding a measly 10 10/15 55c’s, hoping they become less measly Monday morning", "score": 2, "replies": []}, {"body": "![gif](emote|free_emotes_pack|give_upvote)![gif](emote|free_emotes_pack|money_face)", "score": 2, "replies": []}, {"body": "Bear opinion: https://www.reddit.com/r/wallstreetbets/comments/p8cqpr/weekend_discussion_thread_for_the_weekend_of/h9sthi1/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3\n\nIn short, almost any tute wanting pfizer b/c of approval would have bought early in this runup. You and I are hoping to sell our calls to someone who wants a position or larger one in PFE. They could have just bought and hedged with puts. \n\nPFE dumped the morning after EUA was granted, and dumped the next day, and the next week. I realized yesterday it was a runup of fools hoping to sell to a greater fool after eua. The same goes for the full auth runup. I’m straddling tomorrow but more put dominant. \nWill hold far otm spreads for a pop. Also, look at biogen, if you’re expecting that you’ll have to sell right after the news, it hasn’t reached that high ever since.", "score": 2, "replies": [{"body": "Fair point, from my perspective, in the midst of taking a lead on supplying the protection for one of the worse pandemic in human history and a head and shoulder formation to break the 20 year all time high makes it almost questionable to buy puts or short $PFE. I could be wrong, but I think you should at least stay on the sideline on this play if you're a bear or in the between. It's likely that the bull wins this one", "score": 6, "replies": [{"body": "I’m long $BNTX but rooting for $PFE to crack that $52 barrier this week as the value of both companies now are coupled on their shared success.  History being made for both of these companies this week!!!", "score": 3, "replies": []}]}, {"body": "Gay bear", "score": 2, "replies": []}]}, {"body": "i will probably lose cell service and internet tomorrow because of this hurricane and thinking about placing sell orders. i have $60 pfe calls march 2022. probably not worth holding right? \n\nwhats a good sell price on these? i would love to make $2 per, is that realistic?", "score": 4, "replies": [{"body": "First off, I hope you and yours are safe. \n\nMy answer is, it depends since I don't know your average. Assuming your average was at Friday's close, which was $1.18 at ask then to get +$2, you'd need us to land at least on $57. If IV gets pumped up, well, you can hope for something lower (I don't know how realistic this will be though given how low the beta is for $PFE). So, tonight and tomorrow, instead of praying for safety from the hurricane, pray for $PFE to be >$57 on Monday at pre-market :)", "score": 3, "replies": [{"body": "I bought 2 calls\n\n\nOne has an average of 8 cents. That’s my money player", "score": 2, "replies": []}]}, {"body": "Hurricane swirling around you and you're just wondering when you can get back to trading 😂", "score": 3, "replies": []}, {"body": "Hold you fuck", "score": 2, "replies": []}, {"body": "Evacuate inland to someplace with cell service.", "score": 1, "replies": []}]}, {"body": "So you’re saying the 10,000 PFE I happened to buy in the last couple weeks after BNT and MRNA fucked me for 20-30% might print? \n\n\nIt is now my heaviest or second heaviest after MSFT.", "score": 3, "replies": [{"body": "Gahdamn bb you telling me you have ~500k on $PFE? Post that $PFE-tty donger", "score": 3, "replies": [{"body": "No my friends and I are heavy wsb users lol. I don’t want to put myself. I’ll make an alt and let it age so it can post on wsb for the future. \n\n\nIt just looked like since Moderna and BionTech were so richly valued, pfe should be too. I bought those two and then saw pfe and was like huh? And then sold out most and bought that. \n\n\nPfe star msft and some oil is what I am now.", "score": 1, "replies": []}]}]}, {"body": "We're getting sloppy with the pumpjobs. A few buzzwords, defining EUA vs Full approval and a dfv namedrop?\n\nSell the news. Get puts ladies and gentlemen", "score": 2, "replies": [{"body": "Yup let's pump a 5.6B float stock, pamp it $PFE pamp it", "score": 2, "replies": [{"body": "Doesn't have to be a penny lol. Shitty pumpjob is shitty.", "score": 2, "replies": []}]}]}, {"body": "[Holding has tested me.](https://i.imgur.com/rYzJ7tY.png)", "score": 1, "replies": [{"body": "Not sure what I'm looking at mate, $PFE play burned?", "score": 1, "replies": []}]}, {"body": "Never forget NVAX. They skipped EUA went with full approval only.", "score": 0, "replies": []}, {"body": "Pfe is a shit stock. I was in it for long time. Also from everything I’ve read pfe has most side effects including brain damage and death.", "score": -9, "replies": [{"body": "Lmao", "score": 3, "replies": [{"body": "I mean shit… mRNA and pfe were same price in March 2020. You invest 5k in March 2020 at start of covid for pfe you have 6k. mRNA 5k would be about 48k now. Newest Mayo Clinic study pfe effectiveness down to 42% mRNA is 76%. Maybe mRNA doesn’t have much juice left to squeeze, but that’s what everyone said about TSLA too so I stand by what I said. Pfe is a shit stock.", "score": -2, "replies": []}, {"body": "How your pfe doing?", "score": 1, "replies": [{"body": "Well? Check it.", "score": 1, "replies": [{"body": "Rhetorical 😉", "score": 1, "replies": []}]}]}]}, {"body": "Lol clown", "score": 0, "replies": [{"body": "How’s pfe doing?", "score": 0, "replies": []}]}]}, {"body": "Can’t wait to buy puts and tag you at the bottom 🤷‍♂️", "score": -1, "replies": [{"body": "Bet your house on it", "score": 1, "replies": [{"body": "The chart doesn’t look good for you, and the approval is already “priced in”… I am your wife’s boyfriend and I’m here for your last 2 cents", "score": 1, "replies": [{"body": "I was in Cocoa Beach all last week for the swell the hurricanes were gonna push in, the wave predictions showed a bunch of chest/head days, it was flat all week... So with that being said, I am doing the opposite of what you say and buying more PFE shares... I'm an emotional investor =)", "score": 0, "replies": [{"body": "Damn it’s really only Tuesday", "score": 2, "replies": [{"body": "I just saw this, sorry I wasn't trying to come across as rude, I was making a joke cause of your username. I squeezed a little profit from the added shares shorting itm, not enough itm, but good enough. The chart didn't look good at all, I think I was at  36 as PFE basis, now 36.29. PFE looking kinda tasty for some long nibs now 10/13.\n\nI live in east Otown next to the cult city, but CB is one of my favorite spots, I put together an LRO charity event there in 2008 and fell in love with the community.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Post loss porn.", "score": 1, "replies": [{"body": "It went up 200%+ Monday morning on 8/30, chill lol", "score": 1, "replies": []}]}]}
{"title": "BioNTech & Moderna - Vaccine/mRNA unicorns", "selftext": "  \n\n**BioNTech & Moderna - Vaccine/mRNA unicorns**\n\nI was motivated to make this DD post because while these vaccine stocks have been crazy hot over the past year, they don't get much attention on WSB which is a bit surprising.  These aren't for the faint of heart, but traders looking for volatility, you won't need a blue pill to get hard.\n\nI will try to highlight some of the key differences and you can make a choice of which you prefer.  My personal choice is BioNTech, reason being they are much cheaper when comparing financial metrics, and also because I think their vaccine is the best in terms of safety and efficacy.  It is also what I'm vaccinated with, and the 5G reception has been great.\n\n**Pfizer & BioNTech partnership**\n\nMost folks refer to BioNTech’s vaccine as ‘Pfizer’, but the vaccine actually belongs to BioNTech, but licensed to Pfizer with profit split down the line in most regions as well as milestone payments to BioNTech ($748 million).  There is also a small equity investment in BioNTech by Pfizer.  Pfizer was interested in acquiring BioNTech, but the owners have no interest in selling. \n\n**Making history as the first FDA approved mRNA vaccine**\n\nIn recent news from Friday, Pfizer/BioNTech is to become the first fully FDA approved vaccine as early as this Monday. First mover advantage is key to locking down market share, as well as advancing the mRNA vaccine booster approvals. With the mRNA technology platform vetted with an FDA approval, Pfizer/BioNTech will be moving yet further ahead of the competition.  Mandates will start soon as this is approved, and BioNTech will be the first choice.  Also, BioNTech is in more arms, and the boosters are advised to follow the primary shots so they will also lock up a lot of doses.\n\nModerna approval is said to be several weeks away, so they aren't far behind either if things go their way.\n\nComparing BioNTech and Moderna based on market cap and financial metrics, Moderna currently has a higher valuation/multiple even though BioNTech has double the earnings per share. \n\n&#x200B;\n\n[Fundamentals](https://preview.redd.it/87y6mjkiuti71.png?width=802&format=png&auto=webp&s=081f5a5bcff8974ec6fc8721bf1f60d91dcbe7be)\n\nFor the next ten years, the COVID vaccine revenues will be the drivers for these companies. I won’t go into the scientific differences between the mRNA vaccines, as this is WSB and I’m not epidemiologist or scientist. \n\nWe know both vaccines are very similar and effective but differ by dosage (Pfizer having 30 micrograms vs Moderna having 100 micrograms per dose). Both of these will require boosters for the foreseeable future with what looks like 8 month intervals (though Moderna may have longer durability due to the dosage). Science supports this since the virus will continue to mutate. Countries such as Canada have already ordered boosters for the entire population out to 2024. \n\n**Ownership and Insiders**\n\nBioNTech is 50% owned by the Strüngmann brothers, who seeded the company. Next the CEO Ugur Sahin owns around 17% of the company. This means 67% of the stock is basically out of the picture. These guys have not sold a single share as this has run up from single dollars to $465.\n\nInstitutional ownership as of the last report was approximately 17%. This means that 84% of the shares (out of 241 million) are not being actively traded, leaving a paltry 38.5 million shares. \n\nModerna while having more shares outstanding has a very strong institutional ownership base of 64% of float, and 10% by insiders, so 74% of the shares are spoken for. Since Moderna is an S&P component (BioNTech is a German company, listed as an ADR so does not qualify for it), it gets more volume and institutional interest. In the last six months, about 11 million shares have been sold by insiders, which is not unusual given how well it has performed. \n\nFrom a share structure perspective, I think the low float and high ownership by the founders of BioNTech make it possible for more upside, but both are currently Wall Street darlings, and Moderna gets more attention in the media.\n\n**Marketshare**\n\nPfizer distributes the vaccine to 165 countries around the world. The net profit from the sale of the vaccine is split 50/50 between Pfizer and BioNTech. \n\n&#x200B;\n\n[More primary shots = more boosters](https://preview.redd.it/7v8rld7puti71.png?width=798&format=png&auto=webp&s=27e11bdcc618de17192efb61d7b2b0defc7660ee)\n\nBioNTech separately has a deal with China based Fosun Pharmaceuticals to distribute in Asia. Fosun is to start production in China at the end of August upon administrative approval (regulator approval already happened last month), eventually producing up to 200 million doses a month to supply Asia. Pfizer/BioNTech did not take US government money to develop their vaccine, which makes it an exception. BioNTech did get $445 million from Germany for the development.\n\nModerna has a smaller reach currently than Pfizer/BioNTech in terms of global distribution and have had some issues scaling fast enough to meet contracts.  However, they are expecting to produce 800-900 million doses for 2021, and up to 3 billion in 2022. Moderna had significant funding by the US Government ($6 Billion), so they are not in a good position to attempt raising prices in the US (though I have heard they may have recently, not sure).  \n\nPfizer/BioNTech wins the distribution hands down, as they were first to launch and scale their production in mass. Also in the US, the BioNTech is able to be given to ages 12 and up, whereas Moderna is currently 18 and over. This could change, but recent reports suggest BioNTech is perhaps a better choice for younger folks due to fewer side effects compared to Moderna, perhaps due to the difference in dosage.\n\n&#x200B;\n\nhttps://preview.redd.it/mquq3u4tuti71.png?width=681&format=png&auto=webp&s=cca23b35d7b1f16116f780d58fa930d6e2e6657a\n\n**Pipeline**\n\nFor pipeline, they both have a lot of treatments under development based on mRNA technology. They both are going to be very cash rich, and will have no issues funding and expediting their candidates with no financing concerns for the foreseeable future. Now that they’ve proven mRNA delivery technology and safety, they are both targeting blockbuster drugs (cancer, HIV).  They will also grow via acquisitions.\n\nBioNTech pipeline has a heavy focus on oncology, 21 or 27 of their candidate are cancer related. They also have another partnership with Pfizer to develop a flu shot which started Phase 1 earlier this year. BioNTech has one drug in the phase 2 stage - BNT122 for metastatic melanoma.\n\nModerna has a more diversified pipeline (HIV, Zika, Flu). They just started human trial of their HIV vaccine.  They also have a treatment for cytomegalovirus that is expected to begin phase 3 trials in 2021, and in phase 2 have a cancer vaccine mRNA-4157, to be given in combination with Merck’s Keytruda.\n\n**Technicals**\n\nBioNTech has consenus of $320.44 and Moderna $276.45, but these includes some older targets which have yet to be updated.  BioNTech has had multiple upgrades over the past two weeks ($450 Canaccord, $433 Goldman).  Moderna has recent targets of $425 by Jeffries and $461 by Goldman.  \n\nBoth of these stocks are extremely volatile.  They went parabolic in recent months and got overbought.  They both fell 30% from recent highs in a matter of days, but are now consolidating and inching up again. The selling of these were not based on any fundamental news, but technically the vertical move couldn't be sustained. Earnings blowout and some criticism by some analysts on valuation are mentioned as catalysts, but I think they just went up too far, too fast. This is a run of the mill correction, but I suspect it has now run it's course.  It's given a great opportunity for new investors to get in at a discount to recent highs.\n\nKeep in mind they both have high correlation to each other, so they almost always move together, but MRNA has outperformed BNTX as of late.\n\n&#x200B;\n\nhttps://preview.redd.it/1tdbel5uuti71.png?width=780&format=png&auto=webp&s=35e47c33df3823c1865bf34a98a4ccecd8ee5154\n\nI believe both of these will at least retest all time highs (464 for BNTX, and 497 for MRNA), possibly go even higher if we get another variant after the delta that requires further changes to the vaccine (this is probably more likely that we'll want to admit).  The pipeline for both is promising, and these trade more like tech stocks than biotech since mRNA has proven with the COVID vaccine that it will revolutionize the industry and both of these companies are at the forefront.\n\n**Risks:**  The biggest risk is the variants mutate to something less deadly, less warranting booster shots. In my opinion these stocks will likely peak then decline sometime in early - mid 2022 as the pandemic changes into an epidemic.  There is also risk of competition, but I think these have such a commanding lead, I don't see anyone choosing another vaccine over these, given the billions of doses and FDA approvals they will have ahead of the competition.  Folks are turning down Astrazeneca and JNJ, willing to risk waiting unvaccinated for one of the aforementioned mRNA vaccines.\n\nTDLR for those who can’t be bothered to read:\n\n**In a nutshell:** Both are great plays on COVID and mRNA, especially now that boosters are now seen as durable reoccurring revenues (though they are expected to decline after 2022). Like the flu, we’ll be getting COVID shots many years from now based on science and history (flu pandemic of 1918, we’re still getting shots due to variants and waning immunity, the same issues plaguing us with COVID).  However, BioNTech is fundamentally much better valued than Moderna as the EPS is double that of Moderna, and they have the first mover advantage and brand awareness (due to Pfizer).  \n\n**Disclosure:** I’m not a finance professional, just a retail trader. I own BNTX via call options and have no position in MRNA.  Do your own due diligence.", "id": "p95gs2", "created_utc": 1629604039.0, "score": 62, "upvote_ratio": 0.8, "num_comments": 67, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|5|**First Seen In WSB**|6 months ago\n**Total Comments**|213|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/nqxze5/viac_has_excellent_mix_of_value_and_growth/) \n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "I get much better cell reception now.\n\nSometimes I don't even need a phone.", "score": 23, "replies": []}, {"body": "Your tldr was like... 99.99% of this post. You basically wrote : i like phizer/biontech. Tldr: heres the encyclopedia.", "score": 28, "replies": [{"body": "Was about to reply exactly this", "score": 3, "replies": []}, {"body": "The nutshell tldr was it.  The rest is for those who want to read.  I think my formatting must have sucked.  I’ll try to edit it to make it more clear.  Thanks for the feedback.", "score": 2, "replies": [{"body": "I see. Well, the TLDR belongs at the end, not after the first paragraph. That way when we all scroll to the bottom  because its too long we can find it.", "score": 5, "replies": []}, {"body": "This was a great and thoughtful writeup. Keep up the great work and thank you", "score": 2, "replies": []}]}]}, {"body": "Just two more shots...", "score": 12, "replies": [{"body": "A year….", "score": 7, "replies": [{"body": "Or you cant go inside…", "score": 4, "replies": []}]}, {"body": "I think after this booster, it will be annual for a while, not biannual.  So far they are saying the antibody response is several magnitudes higher than 2 doses so it may be even longer.  But who knows, things change as we live through this.  Small price to pay to stay safe methinks.", "score": 2, "replies": []}]}, {"body": "I was actually reading the other day about how viruses mutate to be less lethal as a survival mechanism. You can't survive if you're killing all your hosts. It was interesting. Something tells me that no matter how deadly or not deadly covid is, many will always be lining up to get booster shots.", "score": 6, "replies": [{"body": "Only issue is with leaky vaccines. Mareks disease is a good read of what could be to come.", "score": 1, "replies": []}]}, {"body": "They also make you magnetic, that's always a plus", "score": 10, "replies": [{"body": "Puts on MRI manufacturers for sure", "score": 1, "replies": []}]}, {"body": "failed to continue reading after you mentioned BNTX is better positioned for having double the EPS of MRNA, but failed to mention MRNA has nearly double the amount of shares outstanding of BNTX", "score": 3, "replies": [{"body": "It’c clearly mentioned in the table and text and is the basis of why I prefer BioNTech.  Moderna has double the shares, lower revenue and income, and sports almost double the market cap.", "score": 2, "replies": [{"body": "ahh didnt look at the table but also having double the EPS is misleading. it should be adjusted to a proper ration. that being said i think MRNA is extremely over valued", "score": 2, "replies": [{"body": "Yes, I agree I should have added that in the statement to be more clear.  However, IMHO EPS in this case is justified as comparator because the price is almost equivalent at the moment.  If we model BioNTech having the same number of shares as Moderna, the EPS would halve but the stock price would be around $700 a share.", "score": 1, "replies": [{"body": "You know that for comparisons, you can just use P/E ratio, right? Or E/P, EPS is a useless information.", "score": 1, "replies": []}]}]}]}]}, {"body": "fk man I have moderna and your posting is very informative and well put and I hate you for making me doubt my position.", "score": 2, "replies": [{"body": "Pray for good news in the HIV vaccine trials", "score": 2, "replies": []}]}, {"body": "„I own bntx via calls“ Wsb purity. Also im actually having shares of pfe now. Prob sell on the spike. Calls on pfe have served me well,  they are very liquid and min spread between bid and ask ensures the lightest volatility has a strong multiplier. Thinking of hopping on bntx train. Mrna besides having an extreme valuation and reocurring supply issues they also need to still deal with a legal dispute concerning the vax rights. I bought some puts once on mrna but will now patiently wait for them to blow the sp through the roof once more, then buy some puts again. Revenge trading.... wsb after all folks", "score": 2, "replies": []}, {"body": "The play is regn cuz covidiots won’t take any vaccine.  Monoclonal antibodies ftw.", "score": 2, "replies": []}, {"body": "I don't think so.  We've got nuremberg 2.0 coming up.", "score": 2, "replies": []}, {"body": "Your thorough coverage is appreciated!!", "score": 2, "replies": []}, {"body": "Small correction: More first doses does not mean more booster shots. In Germany (and Parts of the eu) it’s recommended to switch vaccines up. I got vaccinated with astra + Pfizer. I still believe Biontech will be the main player for quite some time.", "score": 2, "replies": [{"body": "I don't think Astra will be used much in the future. Biontech produces more than enough now.", "score": 5, "replies": [{"body": "Yes, some countries are doing mix and match, but US and some others are trying to avoid.  Right now, if you want to travel, some countries are not recognizing mixed vaccinations.  I think this will change, but in many countries folks go AZ first as it was in better supply early in the pandemic, but now they’ve pivoted to mRNA (Canada, Australia).", "score": 1, "replies": []}]}]}, {"body": "MRNA is getting examined by the FDA due to heart issues happening in males under 30", "score": 1, "replies": []}, {"body": "NVAX will be the the preferred product. \n\nMRNA based vaccines will end up not preferred as they’ll lead to mutations / “variants” and have risks for longer term rheumatic disease. \n\nNVAX calls, way better move as they also have a new flu vaccine that will become our new standard for elderly and it’ll expand in use.", "score": 1, "replies": []}, {"body": "I hope it goes up for you guys, but this vaccine is a scam. Losing efficacy after 3 months, less than 55% effective against Delta according to CDC: https://www.cdc.gov/mmwr/volumes/70/wr/mm7034e3.htm. Nations who have deals with Pfizer are locked in a contract where data that might hinder sales can’t be released from 10 years.  Pfizer is 5th most popular stock in congress members investment portfolio. They have notoriously predatory lobbying and promotional practices before pandemic. \n\nCase counts are way compared to last August. Deaths are way up compared to last August. Hospitalizations are up. I got the Pfizer vaccine because I hate the culture war around it and wanted to excuse myself from it, but i dont believe it’s protecting me. I see a future where half the population is stumbling through the streets spewing phlegm, blindly grasping at the nearest living creature to attempt to suck the oxygen from it, while the nurses that remain are running around administering doses of Dick Pills. \n\nThat said, they’re pumping their stock as hard as they are pumping their snake oil, and why bet against the stock portfolio of Congress, when congress is making the decision about how many doses will be bought? Calls on Pfizer, puts on the future.", "score": -9, "replies": [{"body": "Yikes...", "score": 3, "replies": [{"body": "Full disclosure: I’m playing  other vaccine scams and Pfizer is currently in my way and about to lose me money. I don’t give a shit about vaccines lmao. I want something to end the pandemic, but I’m pretty useless in terms of health, mine and certainly anyone else’s.  \n\nIf I fomo into Pfizer tomorrow morning, I will definitely become more mentally unstable.  Will I do it? We shall see", "score": -5, "replies": []}]}]}, {"body": "Short Moderna and Pfizer. Got it. Nobody is going to take booster shits from big pharma every 8 months.", "score": -2, "replies": [{"body": "who is making the covid pills? we need to jump on that ish", "score": 1, "replies": [{"body": "Vaxart (VXRT)", "score": 2, "replies": [{"body": "> VXRT\n\nhmmm i friggin hate messing with pharma companies but covid 19 pills would be amazing. it seems even with the vaccine plenty of people are getting covid. with pills you could just get them once you're infected and crush the virus if there's a break through case", "score": 1, "replies": [{"body": "Sorry, to clarify these are vaccine pills. I don't know of any pill form treatments under development.", "score": 1, "replies": []}]}]}, {"body": "Medincell, they are testing ivermectin, which has shown to be extremely effective as prophylactic and during early treatment of Covid. Refer to ivmmeta.com. Of course MSM is suppressing this Nobel prize winning drug. Big pharma cannot profit hugely from it, no patent and dirt cheap.", "score": 0, "replies": []}]}]}, {"body": "It's very possible that COVID vaccines will simply be a three-vaccine course, akin to some hepatitis vaccines.", "score": -1, "replies": [{"body": "Possible but not probable.  Some of the best minds in viruses (Larry Brilliant), say it’s likely to be a forever virus like the flu.  Either way I think it will become manageable like al viruses that have come before this.", "score": 2, "replies": [{"body": "The FDA has said that a three-course vaccine has a reasonable chance of being all that's required. Time will tell.", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Was that the FDA or CDC who said that?", "score": 2, "replies": []}]}]}, {"body": "Endemic it is. They say i work in the field. I wouldnt call it working. Problematic is that people are now hungry to go back and as such will continue creating new variants. There is no back to the future. Flu vax never covers fully as well.  There are some promising therapeutic drugs, one of them being from another big pharma, merck. I know tgere are a lot of smaller sized companies working on it as well. But prob merck has the best solution and will have the setup (like pfe) to deliver", "score": 2, "replies": []}]}, {"body": "We know for a fact that all the available vaccines do not provide “sterilizing immunity” meaning your body won’t produce lifelong antibodies....especially against the newer, stronger delta variant. Until they develop a sterilizing vaccine we would all be smart to take 3 a year and wear a n95 mask.", "score": 2, "replies": [{"body": "Your body doesn't produce lifelong antibodies to most things it develops a lifelong immunity to. Antibody generation is a limited resource so your body focuses on antigens you've been exposed to recently. Immunological memory is often a function of B cells and T cells, and that seems to be triggered quite strongly by the vaccines.", "score": 4, "replies": []}]}]}, {"body": "Great article! Thank you.", "score": 1, "replies": []}, {"body": "What do you think now? I’m expecting bntx to rip this month and retest the ATH", "score": 1, "replies": []}]}
