{"title": "[Serious] Rate hikes", "selftext": "I’d appreciate an honest insight.\n\nThe Fed is going to announce rate hikes next month. There’s no doubt about that. We don’t know how much it will be exactly but they will be there.\n\nWhen the interest rises the cost of paying debt increases.\n\nTSLA has a P/E of 174+ \\[if Yahoo! is correct\\]. When the interest rises, how is TSLA not going to tank an ungodly amount?\n\nFor the first time I’m tempted to buy PUTs although I’m pretty sure, with my luck \\[i.e.: I have no luck\\] 60 seconds after I buy puts TSLA jumps to 5000 dollars/share.\n\nI know and appreciate the general vibe of this subreddit, I would still appreciate an honest perspective by someone who can explain it like I’m a 5-year-old still eating crayons. Thank you.", "id": "sy72ux", "created_utc": 1645483933.0, "score": 47, "upvote_ratio": 0.81, "num_comments": 93, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|8|**First Seen In WSB**|1 year ago\n**Total Comments**|593|**Previous DD**|\n**Account Age**|10 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=sy72ux)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=sy72ux)", "score": 1, "replies": []}, {"body": "Your betting against an irrational cult who does not care about losses.  Your fundamental analysis is correct but your dealing with a group who doesn't care about making money, so good luck.", "score": 85, "replies": [{"body": "That's a lot of words. Could have just said \"bull gang.\"", "score": 28, "replies": []}, {"body": "Don’t take this top comment seriously. Retail money cant hold this stock for too long.", "score": 16, "replies": [{"body": "I heard that since Tesla @80 lmao. “Retail money” is never leaving", "score": 3, "replies": []}]}, {"body": "I was asking a serious question, I was looking for a serious answer. I don’t mind people saying what they want, sometimes I seek a more lucid response.\n\n/I was not under the illusion that everybody would respect that request.", "score": 2, "replies": [{"body": "That is a serious respons.  Markets are 90 % psychological and emotional beings, less than 10 percent technical and fundamental crayon stuff.  If you understand human psychology you will be great at trading and that is the bottom line.  Not every answer has to sound like a college essay or paper to be true.  We live in a real breathing world, not I  idealistic system run by mathematical equations which are at best lagging and derived from prices caused by human emotional decisions.", "score": 31, "replies": [{"body": "I like that one a lot better. I appreciate more words because they can typically cover a wider range of nuance.\n\nI agree with your perspective.\n\nYou have my thanks.", "score": 11, "replies": [{"body": "Look at GME. Shit companies can stay propped up longer than they should if enough apes will buy and refuse to sell.", "score": 6, "replies": [{"body": "big funds also know selling calls to people with long odds is incredibly lucrative. There is honestly no reason to let is drop.", "score": 4, "replies": []}, {"body": "That bubble needs to blow eventually, loses will probably will get eaten away by inflation tho.", "score": 0, "replies": []}]}, {"body": "“You have my thanks”. \n\nCringe lmao- please tell me you don’t use that line in like work emails", "score": -1, "replies": [{"body": "There are differences in English usage across the globe---for example, to a person not raised in the United States, the one-word closing statement \"Sincerely\" seems a bit too curt or informal. \n\nWhile UK or Australian emails also all range from formal to informal, UK or Australian \"formal\" is probably considered \"excessively formal\", or as you would say, \"cringe\", to US eyes.", "score": 3, "replies": [{"body": "You have my no thanks", "score": 1, "replies": []}]}, {"body": "When it comes to the stock market and the economy I gladly defer to people who know more.\n\nWhen it comes to language and expression I use whatever pleases me most in the moment.\n\nThe limitations of your idiom are not my problem.\n\n‘There are more things in heaven and earth, Horatio, than are dreamt of in your philosophy.’ \\[Hamlet - Hamlet 1-5\\]", "score": 3, "replies": [{"body": ">When it comes to language and expression I use whatever pleases me most in the moment.\n\n>The limitations of your idiom are not my problem.\n\nI'll translate this into crayon for those of us who need it:\n\n\"I say what I want, also, you're an idiot.  Git fukt.\"", "score": 3, "replies": [{"body": "I don’t really need the invective but it does add some spice to the idea.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Lucid calls it is", "score": 2, "replies": []}]}, {"body": "Totally agree. Moreover just because a group is irrational doesn't mean the market is always irrational in the same fashion. 🤯", "score": 1, "replies": [{"body": "This is one of those lessons that cost me a lot of money.  Company A has good earnings report, moons.  Company B has amazing earnings report, tanks.  Company C has almost no hope of being listed next month, moon again.\n\nTLDR: Amazon took all my money.", "score": 1, "replies": []}]}]}, {"body": "Feds are going to have rates to tame the inflation beast. No way around it. But that won’t tank the market. The market will tank when the feds start to vacuum up all that liquidity in the markets. Until march 15, we’ll be in a some kind of stock market roller coaster until we get that clarity from Jpow.", "score": 17, "replies": [{"body": "That’s not much of a window, right?", "score": 1, "replies": []}]}, {"body": "Normally high p/e means very few bucks gained in earnings, therefore high debt load and so on \n\nBut Tesla is marking serious money. They are valued high, yes, but hikes are no problem here due to high Cashflow and reasonable debt", "score": 9, "replies": [{"body": "Thank you for your perspective. That makes sense.", "score": 1, "replies": []}]}, {"body": "You should buy gold and silver futures in a negative real interest environment.\n\nPrecious metals are gonna rally faster than this post gets down voted into oblivion.", "score": 15, "replies": [{"body": "Even more? Gold is up 20% in the month", "score": 3, "replies": []}, {"body": "Gold is down today, because of \"cold war and inflation\".\n\nGold was up last week because of \"cold war and inflation\"", "score": 3, "replies": []}]}, {"body": "Good thing we have a \"war\" scheduled!", "score": 4, "replies": []}, {"body": "They will take action and raise rates in line with what they have been suggesting in order to contain inflation.\n\nYes, it will be in line with their dual mandate. Capital will suffer, labor will not. That will be politically and economically acceptable. Labor is the only political concern in the US.\n\nThe Fed does *not*  have a mandate to prop up lofty valuations. Sorry bulls, keep dreaming.", "score": 9, "replies": [{"body": "But asset prices are a leading indicator to employment. If asset prices go down, consumer confidence will go down and thus employment will go down. There is a reason the fed uses \"market stability\" as one of their mandates.", "score": -1, "replies": [{"body": "I'm not convinced employment would go down, actually.", "score": 1, "replies": []}]}]}, {"body": "Puts are inherently very risky at the best of times, going against a cult makes it doubly so.\n\nEveryone knows TSLA is overvalued; doesn't mean it'll fall off back to where it belongs before whatever expiration you take.", "score": 4, "replies": []}, {"body": "When a stock goes up it's (usually) because investors have been convinced that the company will make more money next year than it did last year; last year's profit or loss is history - what matters is the future. \n\nElon managed to convince a lot of people that Tesla was going to take over the world with cars, solar panels, batteries, charging stations, etc. etc. So long as people keep believing that the price will stay up; if people start doubting his vision the stock will tank.", "score": 6, "replies": [{"body": "Thank you for that.", "score": 2, "replies": [{"body": "Also Tesla price will be challenged if it stays high because some investors find it hard to buy whole shares. \nIf it splits I would expect it to rise, otherwise remain relatively static", "score": 2, "replies": [{"body": "This, alot of small retail investors don't have 1k sitting around to Yolo on 1 individual stock which is a risky play.\n\nIf they split and lower the price to entry I think you'll see alot of people who would be willing to say fuck it and spend a few hundred ona share but not close to a grand.", "score": 2, "replies": []}]}]}]}, {"body": "In general I'm also looking at puts on already weak stocks. But considering this is in part an energy crisis, expect oil/gas and thus fuel to rip. IMO that's exactly the case to accelerate leaving ICE cars and might also postpone hydrogen indefinitely since gas is one way to generate it. Also bc rising oils fuels inflation, I'd bet they might go on the higher end for a rate hike or add an additional one (TL;DR: TSLA might not be bleeding that much)", "score": 3, "replies": [{"body": "Thank you, I appreciate your perspective.\n\nSo, buy oil then.\n\nI had an awesome opportunity, for ridiculously little money, to make a fortune, life-altering money, in oil, and I completely missed it.", "score": 2, "replies": [{"body": "You're welcome! I mean predictions were (even before Putin's announcement) that oil will go to 100$. I'm definitely keeping my oil at least until Wednesday", "score": 3, "replies": [{"body": "I would have made a stupid amount of money if I’d thrown some middling amount of cash at it a year ago.\n\nGood luck!", "score": 1, "replies": [{"body": "Also good luck! Yeah I wonder how it goes today (being definitely more cautious than I planned to, crap...)", "score": 1, "replies": [{"body": "I got kicked in the nuts is what happened.", "score": 1, "replies": [{"body": "That sucks...What was your play after all?", "score": 2, "replies": [{"body": "Oasis Petroleum $OAS.\n\nIf I wait 10 minutes longer I don’t catch the blade falling. Of course...\n\nIt’s frustrating.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I mean, everyone agrees Tesla is gonna shit the bed pretty soon. It's just how you go about making money off of it. But just because you know something is gonna go down, doesn't mean buying puts is the right play.", "score": 3, "replies": [{"body": "I understand. I was just asking.\n\nI wouldn’t buy puts. I have terrible luck with my positions. Really awful. The moment I buy puts is the moment the stock shoots up. I’m not touching puts at all.", "score": 1, "replies": [{"body": "Pump et", "score": 2, "replies": []}]}]}, {"body": "25 BP raise is priced in. Fed has given plenty of guidance that it will raise rates. Everyone and their moms knows this. So a 25 BP raise won't do much. \n\n50 BP raise would definitely pull down valuations across the board.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 10, "replies": [{"body": "I'd say you're wrong but the futures market just opened 10 mins ago and Nasdaq just broke a new low from 1/24, this thing may really start shitting the bed and the fed will come in with some dove shit to stop the bleeding. 25 basis point hike may be their remedy though, if CPI comes in red hot on March 10 and the fed says they're doing nothing, recession is on the way and the market will shit the bed anyway.", "score": 6, "replies": []}, {"body": "I would be a lot more amenable to the inflation argument if it wasn’t for the fact that we know that corporations, despite making monstrous profits, still raised the cost of their products thereby contributing to the rise of inflation.\n\nI’m not saying there isn’t inflation, I’m not saying there shouldn't be serious monetary policy, but when companies themselves are the direct cause of increases in the rate of inflation, when they don’t need to inflate the cost of their products, I’m not sure at all what everybody’s panicking about with regards to inflation.", "score": 0, "replies": [{"body": "The corporations are just acting within a free market\n\nYou gave everyone money. So now corporations can charge more\n\nIf they don’t. Someone else would. The only way NO ONE would raise prices would be if the U.S government took full control of the economy, in which case we would all starve to death a month later\n\nYou cannot blame corporations for the failures of our leaders. They were warned not to print money. They did anyway. This is their fault.", "score": 5, "replies": [{"body": "All manufacturers will have to raise prices because their suppliers are raising prices.", "score": 1, "replies": []}]}, {"body": "Jpow might even turn the money printers on full blast again as well as no rate hike if this Ukraine thing tanks the market.", "score": 4, "replies": []}]}]}, {"body": "As a triple crown thru hiker \nI rate the Continental Divide Trail as the best!", "score": 6, "replies": []}, {"body": "Never bet against Tesla.", "score": 2, "replies": []}, {"body": "Just short Arkk", "score": 2, "replies": [{"body": "Mrs. Woods is having some issues with her fund I hear.", "score": 1, "replies": []}]}, {"body": "Inflation has been hiding in asset prices for years. One doesn't have to look too far to compare the median household real incomes to median real price per square foot of real estate.\n\nStop pretending CPI/PPI is good enough to capture the nature of this problem.", "score": 2, "replies": [{"body": "I wasn’t actually pretending anything.", "score": 1, "replies": [{"body": "Oh, sorry, that wasn't aimed at you. It was aimed at all of the inflation naysayers that may try to argue against the Fed's need to tighten.", "score": 2, "replies": [{"body": "Understood.\n\nRaising taxes on the wealthy would also not be a luxury.", "score": 2, "replies": []}]}]}]}, {"body": "Does Tesla still need a lot of debt? \n\nI was talking about buying puts on Tesla a few hours ago… Tesla is vastly overvalued. The problem is that tomorrow Elon can post a meme about a flying semi truck and the stock goes op 40%. I do not have the stomach to bet against Elon.", "score": 2, "replies": []}, {"body": "Many have come before you with equally rational arguments. Look at the option prices. That should tell you all you need to know. If you actually win buying puts on TSLA that’s a fucking badge of honor, because people have called that stock a hundred times.", "score": 2, "replies": []}, {"body": "Interest rates aren't the problem - unless the Fed surprises people, they aren't going to freak out at .25%. They've been yipping about it for months.\n\nThe whole market is heading down. TSLA for sure.", "score": 2, "replies": []}, {"body": "I mean… you are right. Absolutely correct but… so has everybody that has made the same point about TSLA P/E over the  last 5 years and… How did that play out for them?", "score": 2, "replies": []}, {"body": "Musk will just get a loan from the government.  TSLA will drop because nobody's going to be buying cars.  So what.", "score": 2, "replies": []}, {"body": "Idk, but I know tesla has 10B in debt while Ford has 130B in debt so I would go with puts on ford and the rest of the car industry. Of course, I'm no 🌈🐻 so I'm gonna stick woth buying more GME", "score": 2, "replies": []}, {"body": "I don't see a rate hike happening just yet; initial guidance was for three (3) hikes this year ~ we're not even to March yet.  It would not make sense to exacerbate the inflationary pressure that's already at historic levels by nudging the rate higher at this time and risk an inferno of consumer credit defaults. Stay the course for now. As for TSLA, just a business expense...that's what balance sheets are for.", "score": 2, "replies": [{"body": "I agree that it would make millions of people’s lives almost impossible to run.\n\nGood luck!", "score": 2, "replies": []}]}, {"body": "TSLA has the most productive car factory in North America with the highest margin in it's segment.  By all means, eat the FUD.  I'll keep buying the dip.", "score": 2, "replies": [{"body": "I wasn’t trying to sell FUD or eat it. The question was genuine and serious.\n\nSome of us want a question answered. I said \\[serious\\] for that reason.\n\nIt’s not that I don’t appreciate a shitpost, because I do, but not all my posts are shit posts.", "score": 2, "replies": []}]}, {"body": "If I was someone who recognized the transition to electric is happening and Tesla is the clear leader, but felt their stock price was too high, this is how I'd trade. I'd buy 100shares (keeping it simple, can be more), and also sell a call with strike price slightly out of money. If stock goes down, I do it again and keep collecting call premium. If stock goes up, I still come out ahead. The only way to lose is if the stock goes so far down that collecting premiums didn't make it worthwhile...but I think again as a leader in EV that is experiencing massive growth, eventually their stock won't be overpriced.", "score": 2, "replies": [{"body": "That makes sense. Thank you.\n\nI’m not someone who should be option trading.\n\nI had a bad trade again today and it just bit me in the ass :-(.", "score": 1, "replies": [{"body": "i assumed you were ready for options since you were talking about puts. I'd avoid puts if you aren't ready for options yet.", "score": 2, "replies": [{"body": "I’m extremely interested in the leverage of what calls can do, but I don’t understand how the process works and then I’m not touching it.\n\nMost negatives in life I can address with a level of annoyance, getting margin called by the bank and having no way to escape... it’s a mistake I very much want to avoid.\n\nI have read scores of posts here by people who buy options and then see them blowing up in their faces or go to 0 when they expire. It is bizarrely incomprehensible to me that people would even be willing to take on that much risk for a product they scarcely understand.", "score": 1, "replies": []}]}]}]}, {"body": "You don't understand Tesla, it doesn't follow technical analysis or fundamental analysis.\n\nIt use to be 1000 PE, then Elon Tweeted it was a shit company and it moons. Then it was 500 PE, the guy smoked weed and moons. Last year it was 300 PE, and all he did was send a Tesla to space.  Do you see it's growing into it's PE while still huge YOY growth.\n\nThere's only one other thing that keeps growing after you try to kill it: a virus.  \n\n\nThis company is un-killable.  Just like the Apple, another crackhead heaven.", "score": 2, "replies": [{"body": "That's one way to dismiss very hard work", "score": 1, "replies": []}]}, {"body": "Jim Cramer said sell all your tsla share buy all the dwac Lol", "score": 1, "replies": []}, {"body": "With higher rates Tesla financing will be able to charge more for loans - it’ll offset the impacts.", "score": 1, "replies": [{"body": "I had not thought of that, that’s going to have an impact, I don’t know whether that would be enough though.", "score": 1, "replies": []}]}, {"body": "They may leave rates unchanged . Midterm election coming up . They may do nothing", "score": 1, "replies": [{"body": "If anything, the election is cause to accelerate rate hikes. Having uncontrolled inflation is a worse look for retaining voters than a propped up market with fewer individual voters", "score": 3, "replies": []}, {"body": "I have been thinking about the fact that it’s an election year and, given the dire electoral outcome, tanking the economy on top of that is not going to be conductive of success at the ballot box.", "score": 1, "replies": [{"body": "Majority of voters don’t have much assets in the stock market man. Inflation is a much bigger deal to them than propping up an inflated market. They’ll raise rate. It’ll be 100 bps by June/july", "score": 4, "replies": []}]}]}, {"body": "Rate hikes do not matter !\nStop freaking out about Russia and rate hikes they are both irrelevant.", "score": 1, "replies": []}, {"body": "Tesla is still doubling revenue every 2 years. If that continues they'll be 3T in no time. \n\n*\"When the interest rises the cost of paying debt increases.\"*  \nTesla: *what debt?*", "score": 1, "replies": []}, {"body": "\\[serious\\] ![img](emote|t5_2th52|4641)", "score": 0, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "She's 11, tell her not to listen to you so she doesn't end up sucking dudes off behind Wendy's", "score": 0, "replies": []}]}, {"body": "guys guys, he said “serious” only\n\n[sits back, cracks knuckles, dives in ]", "score": 1, "replies": [{"body": "in all seriousness, puts on OPEN all day", "score": 1, "replies": []}]}, {"body": "Death to the boomers in metals", "score": 1, "replies": []}]}
