{"title": "Never thought I'd say this, but I think TSLA's share price is actually fairly valued right now", "selftext": "[deleted]", "id": "t07rgt", "created_utc": 1645698356.0, "score": 28, "upvote_ratio": 0.61, "num_comments": 94, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|8|**First Seen In WSB**|2 years ago\n**Total Comments**|40|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/l7d3bq/gold_and_silver_would_be_the_ultimate_short/) \n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=t07rgt)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=t07rgt)", "score": 1, "replies": []}, {"body": "It’ll be better valued tomorrow", "score": 73, "replies": [{"body": "And tomorrow 🤣🤣", "score": 31, "replies": []}, {"body": "Fingers crossed, hoping to see $500", "score": 14, "replies": [{"body": "You’ll see 300", "score": 13, "replies": [{"body": "200", "score": 2, "replies": [{"body": "-100", "score": 1, "replies": [{"body": "Elon will personally give you a ZJ for each share you buy.", "score": 1, "replies": [{"body": "I have an old ZJ forsale right now, I'll let it go for 3 Tesla shares", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Gahahhahahahhah", "score": 21, "replies": []}, {"body": "You lost me at \"I consider myself a value investor and tesla\"", "score": 35, "replies": []}, {"body": "You mislabeled your shitpost.", "score": 13, "replies": [{"body": "😎 I agree.", "score": 3, "replies": []}]}, {"body": "PE is 155....", "score": 10, "replies": [{"body": "Last year PE was 600, this year trailing PE is 155, forward PE 80, year after that 40-50 .... see the trend? They just need to keep the growth up.", "score": 1, "replies": [{"body": "So you're telling me it's still over valued ...", "score": 22, "replies": [{"body": "No no you got it al wrong, it is under the value op paid yesterday.", "score": 3, "replies": [{"body": "> value op *paid* yesterday.\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*", "score": 1, "replies": [{"body": "Thanks bot!", "score": 1, "replies": []}, {"body": "There is a whole bot for this wtf", "score": 1, "replies": [{"body": "There is a bot for everything.", "score": 1, "replies": []}]}]}]}]}, {"body": "Ummm are you a value investor is deep value investor like ark?", "score": 2, "replies": []}]}]}, {"body": "TSLA is where people park cash when there isn't a war happening.", "score": 15, "replies": [{"body": "You think people wouldn’t be pushed to buy electric when oil goes over $130 a barrel which means gasoline will be close to $5 a gallon.", "score": 4, "replies": [{"body": "you say it like electricity is free...   \nelectricity prices are jumping up same as gas prices.   \nwith only difference being that oil is more accessible globally.", "score": 9, "replies": [{"body": "Yep, electricity prices are fucking insane here in California. \n\nIt's because the idiots refuse to use nuclear power; instead, they waste billions on worthless eco-tech that sounds good but isn't realistic.", "score": 8, "replies": [{"body": "exactly!!!!", "score": 1, "replies": []}]}, {"body": "Just buy some solar panels, the sun is free.", "score": 2, "replies": [{"body": "how many hours of sunshine do you need to charge your car to full battery ?  \nhow many hours of sunshine do you get in the middle of the winter or during rainy days ?", "score": 1, "replies": [{"body": "The original comment does not apply to everyone as solar is still expensive, but your comment is actually stupid. Batteries exist for a reason, for when the sun is not shining, solar works wonderfully in most regions. It’s even used in the UK effectively.", "score": 1, "replies": [{"body": "solar is expensive ...and batteries are cheap right? 5 cent logic bro :)", "score": -1, "replies": [{"body": "You’re actually retarded", "score": 1, "replies": []}]}]}, {"body": "Are we still talking about California? Because we get ALOT of sunshine. Seriously!", "score": 1, "replies": [{"body": "is electricity traded only in California ? or should we think a bit outside of the little California box and imagine that there are 50  other states in the US and about 200+ countries in the world ?", "score": 1, "replies": [{"body": "50 other states?  When did the US pick up a 51st state?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I think the world might try to increase adoption of EV's and any other way to cut down on oil demand. In the 1970's there was no real alternative, but now we have many ways we can cut reliance on oil. Oil just comes with too many geopolitical consequences.", "score": 2, "replies": [{"body": "We could have all the oil we need in the USA if we would allow drilling but...", "score": -1, "replies": [{"body": "At what cost though? Maybe better to invest in moving off oil quicker. And in the 1970's fracking might not have been viable.", "score": 2, "replies": [{"body": "Bio-fuel was the answer, existing infrastructure, lots of methods of production from algae growth in the gulf to small farmers. And you could have a gradual weening off of oil….current ICE engines would need little modifications not even considering jets and the fact they can’t operate off batteries, unless we want to go back to prop planes….And eventually it could be 100% green, something EV will likely never boast as it will be 100 years before heavy machinery and processing can hope to be EV or some other alternate fuel", "score": 0, "replies": []}]}]}]}, {"body": "They are substitutes - same thing happening to natural gas.", "score": 1, "replies": []}]}]}, {"body": "Elon sold at the top top we got his bags 💼 ):", "score": 17, "replies": [{"body": "Yep, he tried to warn his bois with the doggie pump.", "score": 3, "replies": []}]}, {"body": "Was thinking of buying a put.. if I do you're welcome as the price inevitavly shoots up.", "score": 6, "replies": []}, {"body": "EV cars coming from all automakers, especially Hyundai will eat Tesla.", "score": 8, "replies": []}, {"body": "So everything has to go absolutely perfectly for it to reach the value in a couple of years that is already priced in today.\n\nI'm waiting for sub 300.", "score": 5, "replies": []}, {"body": "I dont know. My partner works in a car dealership and some of these electric cars coming out are fucking nice. Like I've always wanted a Tesla but seeing some of these new ones coming out for half the price is definitely going to case competition", "score": 7, "replies": [{"body": "Don’t know too much about cars but the other day I saw a Hyundai IONIQ 5 and thought it looks impressive and I would rather take that over a model 3 and model y", "score": 3, "replies": [{"body": "That's the exact car I was looking at last night.", "score": 4, "replies": []}]}]}, {"body": "Gas going up people probably switch to ev cars", "score": 3, "replies": [{"body": "The way commodities are skyrocketing now people will be selling their Tesla’s, not buying more.", "score": 2, "replies": []}, {"body": "If demand actually rushed in prices would be even higher, its a supply side market.", "score": 1, "replies": []}]}, {"body": "Yah! Buy the dip just like cathie-memetf-wood .... and enjoy the ride to teh earthcore WEEEEEEEEEEEEEE", "score": 3, "replies": []}, {"body": "Right now, this minute, I have people telling me I’m out of my mind for saying this, but I agree. TSLA is a buy right now. It’s just math.", "score": 3, "replies": []}, {"body": "Its all about production capabilites at this point, not demand.  All the EV trucks are sold out and they can't make enough. Tes;a is the only one capable of manufaturing EV cars in numbers and is the only one that has planned for the ramp up. You all naysayers think going from making traditional cars to EVs is like going from typewriters to word processors....just cause it looks alike.\n\nVW says it takes them 30 hours to produce one car. Tesla produces one in 10 hours.   \nVW makes about 10%  profit from each car (industry standard) . Tesla makes 30%...........  \ngiven these ratios, Tesla is  9 times what  VW is........The only legacy thats really jumping into EV production.   \nTesla will start crushing legacy starting this yr and will only grow stronger, faster.", "score": 3, "replies": [{"body": "The naysayers claiming it's foolish to think legacy autos won't eventually prove to be serious competition (at least in the near future) are the ones with the burden of proof imo. VW, the most advanced of them, only sold one fifth of the EVs that TSLA churned out last year. Though I expect some of them will eventually catch up, it's certainly not gonna be quick and easy to convert all their factories to produce EVs. Many of the competitors are also saddled with huge debt and weaker fundamentals. Certainly a few will not survive.\n\nAnd here's the thing, we're not even claiming TSLA has to knock everyone out to justify their valuation. They just need to get to 10 million deliveries within the next 10 years to justify the current share price, simply match what big legacy autos are doing now. EVs are projected to be 50% of all auto sales by 2030, up from 8% last year, which is up from 4% the year before. Do you guys think legacy auto can pivot fast enough? If not, TSLA will pick up a big portion of the slack.\n\nLastly, TSLA already made all the necessary investments and research to produce good quality EVs at a low price. Which wasn't easy to do, and it's something legacy auto is gonna have to do with one tenth the market cap and already high debt.", "score": 3, "replies": []}]}, {"body": "$353 is what that bs is worth", "score": 9, "replies": [{"body": "Truth. The TSLA cultists were so annoying, and I'm thrilled that stock is coming back to reality.", "score": 2, "replies": []}]}, {"body": "At 100 i'm in", "score": 2, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Good reply. \n\nTwo years ago they had a clear advantage and major head start. I feel like their progress hasn’t outpaced the competition. Autonomous driving doesn’t have the adoption yet since it’s so early imo. Also the rivian and Ford trucks are better than anything the cyber truck would be. Besides giving you a cut. I love the Tesla cars. Model s is a great car. But I feel like they are slipping. Plus a lot of people hate Elon which isn’t good for the stock.", "score": 3, "replies": [{"body": "Other than Lucid  (which has produced very few and very expensive vehicles), Tesla leads in efficiency and is about to leapfrog that with the new  cars with 4680 cells in structural packs.\n\nTesla is also able to produce cars much faster than others and that is getting even faster (and better) with increased use of castings in the new  factories.\n\nSaying the Rivian and  Ford trucks are better than what the CT would be is  your opinion. Millions of reservations for the CT suggest many would disagree.", "score": 0, "replies": [{"body": "Tesla is a clear leader in the points made by your comments. They also can produce current and new cars quicker. Battery production ramping up with new giga factories  and their charging network is way ahead of competition. Quality seems to be in question at this rate. But my point is that they aren’t expanding  that lead at the same pace anymore. I’ve wanted a Tesla car for a while. I’m WFH now so it’s not practical for me. Tesla interface is also the best by far in the industry. I think big companies like Ford could either acquire or build home grown solutions to compete but it might not be profitable enough yet for them to do so. \n\nCT reservations are just reservations that just like with the model 3, a lot will cancel cause they don’t want to wait and or when the real product comes out to market they might not like it. Yes appearance and appeal are my opinion but Ford already has best selling truck and switching it to electric makes it an easy entry into EVs for alot of Americans who might have pushback with the CTs extravagant exterior.", "score": 0, "replies": []}]}]}, {"body": "The VW Group did not sell 10 million cars last year and their production capacities and their distribution network is way ahead of Tesla. I’m not here to diminish the progress Tesla had in the last years, but I assume that as the person before me already wrote at some point the old car companies will be on an equal lvl in the electric sector. And at that point Tesla will lose shares. Ofc they excel at the range at the moment. Especially in the low budget area. EQS has the same Range than Tesla S Plaid I think. But both are luxurious cars. So I’d prefer the EQS anytime because if you are in one it has the feel and the look of a luxurious car. \nI myself have ordered a Skoda Enyaq Coupe RS. I’ve not enough cash for an EQS or a Tesla Plaid and I personally don’t like the Look of Tesla Y or 3 who would be within my budget range… they have both plain interior and are not very carlike… \n\nThe VW Group alone has a lot of electric cars in the market and they are catching up fast. \nVW has 3 new and 2 old models. \nSkoda has The Enyaq and Enyag Coupe\nAudi has the 3-4 Models \nCupra has 1 model\nPorsche has 1 Model.\nSo VW alone has more than 10 pure electric models. And they range from (low) budget ID3/Born to Highend Taycan and Etron GT. \nVW doubled their BEV sales from 2,5 to 5,1% in one year. In total they sold more than 450000 BEV vehicles. Right now the VW Group struggles a lot with the chip shortage. I assume Tesla will still be ahead for some time, but eventually VW, PSA, Toyota aso. Will catch up.", "score": 3, "replies": [{"body": "We also have to remember how long these other manufactures can keep producing at a lost. Most of them are needing ICE sales to cover the cost. I’m sure VW will survive, not sure about the rest. Toyota are still meddling with their hydrogen cars lol.", "score": -2, "replies": []}]}, {"body": "They're losing ground in Europe but they don't even have a factory in Europe. Once the German factory gets online (hopefully soon, damn environmentalist eurotards) the tide should turn, or at least level.\n\nTSLA already has significant cost advantages compared to rivals. Idk why you're saying others will be able to produce cheaper vehicles. If anything they have to catch up to equality first.\n\nI agree, 10 million is a little far out in the future and far from certain. But I think bear case we can still assume at least 5 million by 2030.", "score": 1, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "> Elon keeps promising and not delivering\n\nThat's his shtick.", "score": 2, "replies": []}]}, {"body": "The German plant is supposed to start off with somewhere around 10-50k vehicles produced annually, and the water supply issue still remains, being one of the reasons for why the factory has yet to start production. And it’s a real problem, because the same area was initially rejected by BMW years ago, as they were supposed to build a factory in the same spot and decided to build somewhere else. \n\nWhat I find troubling with, I don’t wanna say Tesla fanboys but I’ll say sometimes unrealistic optimists, you guys fail to take a genuine objective look at what the competition is actually doing, if only you had the same investment in other companies as you do in Tesla you might have an easier time figuring out where everyone stands.", "score": 1, "replies": [{"body": "VW says it takes them 30 hours to produce one car. Tesla produces one in 10 hours. \n\nVW makes about 10%  profit from each car (industry standard) . Tesla makes 30%...........\n\ngiven these ratios, Tesla is  9 times what  VW is........The only legacy thats really jumping into EV production. \n\nTesla will start crushing legacy starting this yr and will only grow stronger, faster.", "score": 1, "replies": []}]}]}]}, {"body": "If you think this is a good value and you want to enter, good luck.\n\nTesla is too risky for me, so I'm staying away from it. No positions.\n\nI'm sure everyone knows its overvalued, but it has cult following. Stock price has the potential to go in both directions 🤷‍♂️", "score": 2, "replies": []}, {"body": "Value investors don't just pull numbers out of their ass.", "score": 2, "replies": []}, {"body": "The idea that legacy autos wont be a threat is retarded. \n\nLike all tesla bulls the retardation comes in when you start believing tesla will be the only ev on the road. Bmw and mercedes will wrek this pos car", "score": 2, "replies": []}, {"body": "When it gets to $70, it is time to buy.  It will still be overvalued but just not as much.", "score": 0, "replies": []}, {"body": "You should take the near universal disagreements in the comments as a great contra-indicator. This sub admits it’s retarded and yet people still secretly think they aren’t. Believe the former. Tesla made 1.5% of cars sold in the world last year. If people don’t think it can grow 50% a year for the foreseeable future, not sure what to say.", "score": 1, "replies": [{"body": "Ikr, I was just thinking the same lmao. Most comments aren't even critiquing my analysis.\n\nHonestly, the big guys are doing 9-10 million units right now, no reason TSLA can't at least match that. Just a matter of when. And once they get to 10 million they'll be doing around $65-$70 per share. Plus all the other things not purely directly related to cars. \n\nI'm not like Cathie Wood calling for 20 million vehicles by 2025 or a perma bull on the stock since 2018. In fact up until now I've been like everyone else laughing at their valuation. But   \nafter looking at the numbers, while the share price has stagnated this past year I think the fundamentals of their business are starting to catch up to the price.", "score": 0, "replies": []}]}, {"body": "I agree and just bought 697", "score": 1, "replies": []}, {"body": "I'd love to know why you think $10 EPS = $700 stock price. Ignoring the competition and brand complaints and assuming they keep growing and triple forward EPS to $30... how does that justify $700? \n\n\nI'll wait.", "score": 1, "replies": [{"body": "$700 for $30 isn't that bad in it of itself for a great company (hard to argue it isn't), especially in this environment. \n\nAnd it's not stopping at $30, I'm looking at $65-$70, which is achievable with 10 million units, in addition to their other businesses.", "score": 0, "replies": [{"body": "They make cars who's bumpers fall off when you go through a puddle... \n\nMost of their cash flow comes from selling pollution credits.\n\nBattery replacement costs are astronomical. \n\nFuck Tesla at these prices.", "score": 1, "replies": []}]}]}, {"body": "$250 and I’ll take a look", "score": 0, "replies": []}, {"body": "Tesla is worth $300 pre split. They’re high. I own a plaid btw. Shits 🔥", "score": 0, "replies": []}, {"body": "Tesla manufactures poorly-made vehicles under unsafe conditions. Have you actually seen one up close? The tolerances and QC are terrible", "score": 0, "replies": []}, {"body": "You should listen to your former self… you were right before…", "score": 0, "replies": []}, {"body": "Against my better judgement; I brought tesla puts for September lol.   My gut says the drop isn’t done yet.  ARKK will need to start redemptions on her tesla shares and when she does; it’s down a cliff.   \n\nAt least that’s my hope.", "score": 0, "replies": []}, {"body": "OP about to be in the long-term 2030 Tesla investors club", "score": 1, "replies": []}, {"body": "Lol", "score": 1, "replies": []}, {"body": "As a value investor why would you buy at a fair price? You need at least 30% margin of safety for a volatile stock like tesla….wait for 500 folks and load up leaps", "score": 1, "replies": []}, {"body": "Lol at the title. \n\nThanks. I needed a chuckle.", "score": 1, "replies": []}, {"body": "i bought calls too", "score": 1, "replies": []}, {"body": "Tesla is worthless. Electric Cars are a fad that will pass when we finally start getting our Oil from renewable sources.", "score": 1, "replies": []}, {"body": "No stocks are fairly valued. Values are projected values, not current values. My guess would be only 1% of stocks are actually near true current value and most likely only due to extreme shorting and are just at a way station in route to the graveyard.", "score": 1, "replies": []}, {"body": "Nope, it’s over valued by 10 times. When you consider the amount of production they do versus other automakers, it’s way over value. All the hype over electric cars, which are only sold because of government subsidies. If you subsidized General Motors gas powered automobiles they would sell like hotcakes. And their stock would shoot up. Those who bought at these high rates are going to lose their behinds. In my opinion!", "score": 1, "replies": []}]}
