{"title": "Money printing contest: J.Pow. (Federal Reserve System) vs C.Lag. (European Central Bank)", "selftext": "Alright. I'm probably not the only lurker from the EU that has been following with envy how much money you guys are printing. While my head hurts from all the Ḅ̴̡̠͝Ŗ̶͚̍ͅR̵̹̈́̓̓Ȑ̵̡͛Ṟ̴̂R̴̙͍͐̿R̸̮̭͒̄́R̵̮̺̽͆̔, I haven't been able to extract much actual information regarding that topic.\n\n\nI've seen a couple of diagrams, but\n\n* I fucking hate charts where the y-axis doesn't start at 0. They are either actively misleading by exaggerating fluctuations or assume that my autistic abilites are strong enough to instantly calculate the delta in %\n* I wondered how stronk Europe's money printer is compared to the US'\n\n\nThat's why I went ahead and collected the actual balance sheets from the Fed and the European Central Bank and extracted the value of total assets.\n\n\nI'm just a regular retard, therefore I plotted graphs that are so easy to read that any idiot could correctly interpret them. Joke's on me, I don't have any idea what the numbers stand for, or what their implications are, but the point still stands.\n\n\ntl;dr: Global recession cancelled, Fed vs. ECB head-to-head money printer battle: https://brrrrr.money.", "id": "fyfnt9", "created_utc": 1586524540.0, "score": 377, "upvote_ratio": 0.98, "num_comments": 69, "comments": [{"body": "This is seriously cool. Nice work man.", "score": 108, "replies": [{"body": "Thank you!", "score": 27, "replies": [{"body": "No inflation if we all do it at the same rate right?", "score": 26, "replies": [{"body": "If there's a direct correlation between the total assets of the reserves and inflation, the exchange rate between the currencies should not be affected much if we all print.\n\n\nBUT: The relation between currency and other material assets will change, as the currency is devalued. Therefore, if nothing else changes (which is a dubious statement, if you look at the economy right now), stocks will go up by the same amount as inflation. That's because selling the same amount of material assets in the future will return a higher amount of currency.\n\n\nPlease take with a grain of salt, what I wrote. I have no idea what I'm doing.", "score": 33, "replies": [{"body": "Hey man last time we all bought options based because of three witches any dd is good dd even if I dont get it.", "score": 12, "replies": [{"body": "The witching hour is upon ye!", "score": 1, "replies": []}]}, {"body": "Sounds legit though lol", "score": 5, "replies": []}, {"body": "Doesn't that assume that buying power goes up at the same rate as inflation?  The US consumer is 70% of the GDP.", "score": 1, "replies": []}]}]}, {"body": "Nice.", "score": 5, "replies": [{"body": "𝓷𝓲𝓬𝓮 ☜(ﾟヮﾟ☜)\n#Nice Leaderboard\n**1.** `u/RepliesNice` at **5254 nices**\n\n**2.** `u/Cxmputerize` at **3988 nices**\n\n**3.** `u/DOCTORDICK8` at **2601 nices**\n\n**...**\n\n**2836.** `u/ChiefFries` at **18 nices**\n\n---\n\n^(I) ^(AM) ^(A) ^(BOT) ^(|) ^(REPLY) ^(**!IGNORE**) ^(AND) ^(I) ^(WILL) ^(STOP) ^(REPLYING) ^(TO) ^(YOUR) ^(COMMENTS)", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "𝓷𝓲𝓬𝓮 ☜(ﾟヮﾟ☜)\n#Nice Leaderboard\n**1.** `u/RepliesNice` at **5256 nices**\n\n**2.** `u/Cxmputerize` at **3988 nices**\n\n**3.** `u/DOCTORDICK8` at **2601 nices**\n\n**...**\n\n**263493.** `u/ShortVIXDaily` at **1 nice**\n\n---\n\n^(I) ^(AM) ^(A) ^(BOT) ^(|) ^(REPLY) ^(**!IGNORE**) ^(AND) ^(I) ^(WILL) ^(STOP) ^(REPLYING) ^(TO) ^(YOUR) ^(COMMENTS)", "score": 1, "replies": [{"body": "Nice", "score": 1, "replies": [{"body": "Nice", "score": 1, "replies": [{"body": "Nice", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Nice", "score": 1, "replies": []}]}]}]}, {"body": "EPIC PRINTING BATTLE OF HISSTTORRYYY", "score": 51, "replies": [{"body": "Look\n\nIf you had\n\nOne shot\n\nOr one opportunity\n\nTo BRRRRRRRT everything you ever wanted\n\nIn one moment\n\nWould corporate capture it\n\nOr just let it dip?", "score": 30, "replies": [{"body": "YOU BETTA, LOSE YO SELF IN THE TENDIES, THE FD'S, YOU BETTA NEVA LET EM GOOO.\n\nYOU ONLY GET ONE SHOT, TO PRINT.\n\nTHIS OPPORTUNITY COMES ONCE IN A LIFETIME.", "score": 3, "replies": [{"body": "BRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRT", "score": 2, "replies": []}]}]}]}, {"body": "Could you make another graph? The first derivative of the balance sheet vs price of gold.  The rate of money printing per month vs the price of gold.  How does gold react to the fury of the money printer?", "score": 24, "replies": [{"body": "Good idea. First derivate is easy enough, will add that. I'll look into where I can source data for the gold price.", "score": 15, "replies": [{"body": "Update: I'm working on it, but it will take some more time. You can expect it to be done within a week. I will let you know then.\n\n\nI wrote the charts from scratch and they are not flexible enough to handle other data nicely, yet. E.g. I'd like to have a chart that can go below zero, but still draw the x-axis at y=0.", "score": 3, "replies": []}, {"body": "!remindme 24 hours", "score": 1, "replies": [{"body": "I will be messaging you in 6 hours on [**2020-04-11 18:10:06 UTC**](http://www.wolframalpha.com/input/?i=2020-04-11%2018:10:06%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/fyfnt9/money_printing_contest_jpow_federal_reserve/fn0htxf/?context=3)\n\n[**9 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Ffyfnt9%2Fmoney_printing_contest_jpow_federal_reserve%2Ffn0htxf%2F%5D%0A%0ARemindMe%21%202020-04-11%2018%3A10%3A06%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20fyfnt9)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": [{"body": "!remindme 24 hours", "score": 1, "replies": []}]}, {"body": "!RemindMe 22 hours\n\nWant to see this too", "score": 1, "replies": []}]}]}]}, {"body": "True, EU has big dick, but Murica has Cialis!", "score": 27, "replies": []}, {"body": "fuzzy like", "score": 9, "replies": []}, {"body": "[deleted]", "score": 8, "replies": [{"body": "Regarding the Fed:\n\n> The Federal Reserve's balance sheet has expanded and contracted over time. During the 2007-08 financial crisis and subsequent recession, total assets increased significantly from $870 billion in August 2007 to $4.5 trillion in early 2015. Then, reflecting the FOMC's balance sheet normalization program that took place between October 2017 and August 2019, total assets declined to under $3.8 trillion.  Beginning in September 2019, total assets started to increase.\n\nhttps://www.federalreserve.gov/monetarypolicy/bst_recenttrends.htm", "score": 11, "replies": []}, {"body": "The short/literal answer on why the ECB's balance sheet declined is that gold became less valuable and a bunch of short term loans they made to banks within the eurozone came to maturity within the period (see [this](https://www.ecb.europa.eu/pub/annual/balance/html/index.en.html)). In contrast US was rolling over the bonds they bought during QE so their balance sheet doesn't go down unless they decide to do QT, and they hold a comparatively smaller amount of gold as reserves so their balance sheet was less affected by the price of gold dropping, and they had initiated QE3 aka Q E I N F I N I T Y   to make the American economy more stronk.\n\nThere are a couple important differences in Fed vs ECB monetary policy to grasp here:\n\n1) The Fed can monetize an unlimited amount of government debt, and the ECB cannot. If the American govt wants to give corporations a $1.4tn tax cut and not cut spending to compensate thats no problemo they can just have the treasury issue lots of bonds and the fed will buy them with freshly printed dollars and there will surely be no long term negative consequences for this\\*. In the eurozone they have a central bank (the ECB) but each country has its own treasury, and the amount of debt each individual treasury can take on is limited by the [Maastricht Treaty](https://en.wikipedia.org/wiki/Maastricht_Treaty). This limits the ability of eurozone governments to provide \\*fiscal\\* stimulus, because they have to actually pay for their stimulus with taxes and taxes aren't good for business. This has made the eurozone suck at recovering from the financial crisis compared to murica and compared to european countries not in the eurozone (for example, UK was party to Shengen (free travel) but not Maastricht (limited debt), so they were able to stimulate the shit out of their economy after 2008 and make jobs come back, but then people from Maastricht countries could just go there and take the jobs, so they were basically eating europe's unemployment and were not stoked about it so they brexited)\n\n2) Dollars are the currency of international trade and so if the ECB wants to balloon its balance sheet it needs to buy dollars, which in times of crisis are achieved via \"[central bank liquidity swaps](https://fred.stlouisfed.org/series/SWPT)\" which the fed holds as assets (they are holding euros and the dollars are their liabilities) and the ECB holds as liabilities (to be more exact they hold the liquidity swap themselves, but they lend the dollars out and they are the ones on the hook for paying the dollars back). These liquidity swaps are not captured in either of the series in this chart because reasons but are an important part of this picture (since we did about $350bn in the last 3 weeks).\n\n\\*this may eventually cause an uncontrollable hyperinflationary spiral", "score": 11, "replies": [{"body": "Wouldn't the reason for liquidity swaps not being counted is that it's just exchanging currency? Not actual assets?", "score": 2, "replies": []}, {"body": "nice comment, thanks", "score": 1, "replies": []}, {"body": "If the hyperinflation spiral does happen does that mean I could pay off my student loans for the price of a Big Mac?", "score": 1, "replies": [{"body": "Inflation doesn't have to be uniform, not everything has to inflate at the same rate. If this QE is anything like the last QE it will inflate the prices of stonks and real estate and precious metals more than it inflates the price of bulk commodities and end goods.\n\nSo like if you buy 1/10 of your student loans in stocks then wait 5-10 years you may be able to pay off your student loans with that because of inflation, even though the big mac is relatively cheap compared to either of those things. If inflation is fast it might be like 3 years or something. If the federal government starts paying people $250k/year to shovel dirt then your big Mac might become expensive", "score": 2, "replies": []}]}]}]}, {"body": "The ECB doesn't print money, it takes loans on the market. The fed does", "score": 9, "replies": [{"body": "The ECB is basically doing the same thing as the Fed. Buying bonds (and even stocks) with money that they are creating. \n\nhttps://www.reuters.com/article/us-health-coronavirus-ecb-qe-idUSKBN21D0J4", "score": 5, "replies": []}]}, {"body": "Why is the red going up? How do I do this to my account?", "score": 7, "replies": [{"body": "turn your screen upside down", "score": 4, "replies": []}]}, {"body": "this is great, I was looking for this exact info yesterday, thanks op", "score": 3, "replies": []}, {"body": "Not cancelled at all see: [Chinese currency in crisis... peg to dollar go brrr](https://www.scmp.com/economy/china-economy/article/3079243/coronavirus-china-re-pegging-yuan-us-dollar-avert-financial)", "score": 3, "replies": []}, {"body": "First there was https://brrr.money, now theres https://brrrrr.money. https://brrr.money is also taken. How many more can we make?", "score": 2, "replies": [{"body": "Holy shit https://brrrr.money/ is absolutely hilarious. It's a legit firm and their slogan is \"Need *BRRRR* Money?\"", "score": 6, "replies": []}]}, {"body": "Is this DD?", "score": 2, "replies": []}, {"body": "Danke dir merci beaucoup don't trust the Germans", "score": 1, "replies": []}, {"body": "Can the European Central Bank buy American stock ETF’s or are they bound to similar restrictions as the fed?", "score": 1, "replies": [{"body": "Europe is socialist. ECB mostly buys worthless government bonds from banks and then pretend that someday somebody will pay it back full well knowing that no such day ever comes. Everybody else than Germans, due to ghost of Hitler, would want to print money and go full Communist...\n\nThat said... That Hitler fellow really kick started the German economy. Put some fire on to it... Maybe... Maybe we should print money until from the ashes a new fuhrer will rise... Yes... Yes... Sounds right...", "score": -5, "replies": [{"body": "Obv communism is when the government prints money", "score": 2, "replies": [{"body": "If we were in an actual capatilist economy, the fed wouldn't do any of the things their doing, if the government owning assets of private companies doesn't sound like a socialist policy to you, the fuck man", "score": 4, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Gelddrucker (money printer)\n\nOR\n\nWahrungdrucker (currency printer)", "score": 4, "replies": []}, {"body": "If you want to immerse yourself into the full German experience, here you go: https://www.reddit.com/r/mauerstrassenwetten/comments/fyei0d/gelddruckerwettbewerb_jpow_federal_reserve_system/.", "score": 3, "replies": []}]}, {"body": "so what about China printers... aren't they the best?", "score": 1, "replies": [{"body": "10% increase in money supply M2 from March 2019 to March 2020.", "score": 1, "replies": []}]}, {"body": "LMAO", "score": 1, "replies": []}, {"body": "Data source please for both of them ?", "score": 1, "replies": []}, {"body": "Can u add Japan too? I mean Japan has been the senpai for the ECB and FED", "score": 1, "replies": []}, {"body": "F everybody Brrrring .. when this is done those trillions are going to have to be destroyed but greed tells me they won't", "score": 1, "replies": []}, {"body": "According to this, the fed only printed 2T in the last month.  I thought it was way more than that", "score": 1, "replies": []}, {"body": "And J Pow takes a commanding lead! May the 4th be with you.", "score": 1, "replies": []}, {"body": "It would be really cool if you converted Euros to Dollars or the other way around. It would make a better comparison of the two.", "score": 0, "replies": [{"body": "Are you sure that the EUR/USD isn't rather a consequence of those balance sheets relating to each other? I'm not sure if converting the values into each other makes sense.\n\nIf anyone has an answer to that question, please let me know.", "score": 9, "replies": [{"body": "Whether the exchange rate is a consequence or not doesn't matter.\n\nIf we are comparing the curves they need to have the same unit. If we try to find a correlation between them, then we don't. I think we are comparing here.\n\nAlso the axis have no title, I figured the x was the date. But I don't know exactly what the y axis stands for because I have no idea what is a balance sheet.", "score": 3, "replies": [{"body": "> If we are comparing the curves they need to have the same unit.\n\nIf I'm not mistaken, they do indeed have the same unit: Number of assets that are issued in the respective currency.\n\n> I have no idea what [a balance sheet is].\n\nHere you can have a look:\n\n\nhttps://www.federalreserve.gov/releases/h41/20200402/\n\nhttps://www.ecb.europa.eu/press/pr/wfs/2020/html/ecb.fst200408.en.html", "score": 4, "replies": [{"body": "> If I'm not mistaken, they do indeed have the same unit: Number of assets that are issued in the respective currency.\n\nI'm a scientist, not an economist but I think you are mistaken. Graphs are graphs, and units are units. You are talking about a quantity not an unit here. You can measure this quantity with different units like: EUR, USD.\n\n\"Quantity\" describes what your data is:  \nValue of assets that are issued in the respective currency by the central bank\n\n\"Unit\" is something that you place after your number. If you can't place it right after the number it's not an unit:  \n6T **USD**", "score": 3, "replies": [{"body": "I am assuming what OP essentially did was have *two* y-axis, on the opposite side. The crossing points don't have any value then. Or even a comparison. The percentage differences relative to respective price points of each bank are still valid.", "score": 2, "replies": [{"body": "That would work but why not simplify to one y-axis (so one unit) ? \n\nThat would be like a graph of 2 satellite's altitude and one is in km the other one in miles.", "score": 1, "replies": [{"body": "EURUSD is still somewhat close, so it might be comparing km to miles. It's tricky with exchange rate. Do you just take spot EURUSD for that day, or a PPP equivalent, and/or adjust it for inflation?\n\nThe idea of comparing absolute BS curve in different currencies doesn't seem helpful, tbh (besides the meme). EURUSD rose between 2013-14 and then fell in 2014-15, while Fed BS was almost constant, and ECB winded their down in 2013-15. Between 2015-2017, EURUSD moved sideways (albeit in a 1000+ pips window), while ECB ramped up its APP (Fed still held fast). In 2017, EURUSD rose sharply, along with ECB BS still expanding. Doesn't even make sense. Only somewhat reasonable correlation is in 2018-19, and those years EURUSD was driven more by political news (Italy, Brexit) than balance sheet worries.\n\nWhat might influence US/EZ is how each government/agency is responding to this crisis. US went out full nuts with trillions in QE and buybacks. EC/ECB is still struggling to put anything in EUR 100s billion. It might fall short and once the COVID subsides, the aftermath of junk sovereign debt/insane spreads between EZ country bonds will do more damage to Eurozone. USA just might make it out of this chaos, in terms of Wall Street numbers. Average folks are fucked either way. More populism politics to come.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}
{"title": "TSLA going to 200-300.", "selftext": "[https://twitter.com/EricBalchunas/status/1248586353681600514?s=20](https://twitter.com/EricBalchunas/status/1248586353681600514?s=20)\n\n&#x200B;\n\nSPY index committees are delaying quarterly rebalancing and new component companies till June 22. \n\nJust think about how many investors are holding calls/shares thinking that Tesla is going to get added to SPY and then the corresponding index investors are going to pile in, if they delay decision and TSLA reports a huge loss Q2, which is all but guaranteed they won't get added for at least another 9-12 months. \n\nThoughts?\n\nTLDR; TSLA 200p 300p Oct", "id": "fyku9m", "created_utc": 1586541334.0, "score": 23, "upvote_ratio": 0.7, "num_comments": 70, "comments": [{"body": "Sorry I can’t hear you over the sound of— 🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨🖨", "score": 97, "replies": []}, {"body": "Random autist on wsb vs daddy musk \n\nGoing to be nailbiter", "score": 53, "replies": [{"body": "Who got the weed and joe Rogan real quick?", "score": 6, "replies": []}, {"body": "Papa Elon 🏳️‍🌈", "score": 5, "replies": []}, {"body": "!Remind me 9 months", "score": -5, "replies": [{"body": "**CFM-SK**, reminder arriving in **9 months** on [**2021-01-10 18:03:07Z**](https://www.reminddit.com/time?dt=2021-01-10 18:03:07Z&reminder_id=dc5f5c3a94a14b61b9f61772e4d02b0f&subreddit=wallstreetbets). Next time, remember to use my default callsign **kminder**.\n\n> [**r/wallstreetbets: Tsla_going_to_200300#2**](/r/wallstreetbets/comments/fyku9m/tsla_going_to_200300/fn0h18b/?context=3)\n\n> kminder 9 months\n\n[**2 OTHERS CLICKED THIS LINK**](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder%20from%20Link&message=your_message%0Akminder%202021-01-10T18%3A03%3A07%0A%0A%0A%0A---Server%20settings%20below.%20Do%20not%20change---%0A%0Apermalink%21%20%2Fr%2Fwallstreetbets%2Fcomments%2Ffyku9m%2Ftsla_going_to_200300%2Ffn0h18b%2F) to also be reminded. Thread has 6 reminders.\n\n^(OP can )[^(**Delete Comment**)](https://reddit.com/message/compose/?to=remindditbot&subject=Delete%20Reminder%20Comment&message=deleteReminderComment%21%20dc5f5c3a94a14b61b9f61772e4d02b0f) ^(·) [^(**Delete Reminder**)](https://reddit.com/message/compose/?to=remindditbot&subject=Delete%20Reminder%20%28and%20comment%20if%20exists%29&message=deleteReminder%21%20dc5f5c3a94a14b61b9f61772e4d02b0f) ^(·) [^(Get Details)](https://reminddit.com/reminders/id/dc5f5c3a94a14b61b9f61772e4d02b0f) ^(·) [^(Update Time)](https://reddit.com/message/compose/?to=remindditbot&subject=Update%20Reminder%20Time&message=updateReminderTime%21%20dc5f5c3a94a14b61b9f61772e4d02b0f%0A9%20months%0A%0A%2AReplace%20reminder%20time%20above%20with%20new%20time%20or%20time%20from%20created%20date%2A) ^(·) [^(Update Message)](https://reddit.com/message/compose/?to=remindditbot&subject=Update%20Reminder%20Message&message=updateReminderMessage%21%20dc5f5c3a94a14b61b9f61772e4d02b0f%20%0Akminder%209%20months%0A%0A%2AMessage%20is%20on%20second%20line.%20Message%20should%20be%20one%20line%2A) ^(·) [^(**Add Timezone**)](https://www.reminddit.com/user/setTimezone?source=reddit&username=CFM-SK) ^(·) [^(**Add Email**)](https://reddit.com/message/compose/?to=remindditbot&subject=Add%20Email&message=addEmail%21%20dc5f5c3a94a14b61b9f61772e4d02b0f%20%0Areplaceme%40example.com%0A%0A%2AEnter%20email%20on%20second%20line%2A)\n\n**Protip!** You can use the same reminderbot by email at bot[@]bot.reminddit.com. Send a reminder to email to get started!\n\n\n\n*****\n\n[**Reminddit**](https://www.reminddit.com) · [Create Reminder](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder&message=your_message%0A%0Akminder%20time_or_time_from_now) · [Your Reminders](https://reddit.com/message/compose/?to=remindditbot&subject=List%20Of%20Reminders&message=listReminders%21) · [Questions](https://reddit.com/message/compose/?to=remindditbot&subject=Feedback%21%20Reminder%20from%20CFM-SK)", "score": 1, "replies": []}]}]}, {"body": "Flair this as a shitpost, some of are trying to work here.", "score": 39, "replies": [{"body": "Did you have stroke at the back half of the sentence?", "score": 14, "replies": [{"body": "Yes.", "score": 7, "replies": [{"body": "You good need me to call 911?", "score": 3, "replies": [{"body": "Nah. Puts on 911", "score": 6, "replies": []}]}]}, {"body": "Jeez, cant you see!? He's the dickslexic sufferer", "score": -1, "replies": []}]}, {"body": "!Remind me 9 months", "score": 0, "replies": [{"body": "**CFM-SK**, reminder arriving in **9 months** on [**2021-01-10 17:58:49Z**](https://www.reminddit.com/time?dt=2021-01-10 17:58:49Z&reminder_id=7940a807d7b241a3810f92d6111afdf2&subreddit=wallstreetbets). Next time, remember to use my default callsign **kminder**.\n\n> [**r/wallstreetbets: Tsla_going_to_200300**](/r/wallstreetbets/comments/fyku9m/tsla_going_to_200300/fn0gjhj/?context=3)\n\n> kminder 9 months\n\n[**2 OTHERS CLICKED THIS LINK**](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder%20from%20Link&message=your_message%0Akminder%202021-01-10T17%3A58%3A49%0A%0A%0A%0A---Server%20settings%20below.%20Do%20not%20change---%0A%0Apermalink%21%20%2Fr%2Fwallstreetbets%2Fcomments%2Ffyku9m%2Ftsla_going_to_200300%2Ffn0gjhj%2F) to also be reminded. Thread has 5 reminders.\n\n^(OP can )[^(**Delete Comment**)](https://reddit.com/message/compose/?to=remindditbot&subject=Delete%20Reminder%20Comment&message=deleteReminderComment%21%207940a807d7b241a3810f92d6111afdf2) ^(·) [^(**Delete Reminder**)](https://reddit.com/message/compose/?to=remindditbot&subject=Delete%20Reminder%20%28and%20comment%20if%20exists%29&message=deleteReminder%21%207940a807d7b241a3810f92d6111afdf2) ^(·) [^(Get Details)](https://reminddit.com/reminders/id/7940a807d7b241a3810f92d6111afdf2) ^(·) [^(Update Time)](https://reddit.com/message/compose/?to=remindditbot&subject=Update%20Reminder%20Time&message=updateReminderTime%21%207940a807d7b241a3810f92d6111afdf2%0A9%20months%0A%0A%2AReplace%20reminder%20time%20above%20with%20new%20time%20or%20time%20from%20created%20date%2A) ^(·) [^(Update Message)](https://reddit.com/message/compose/?to=remindditbot&subject=Update%20Reminder%20Message&message=updateReminderMessage%21%207940a807d7b241a3810f92d6111afdf2%20%0Akminder%209%20months%0A%0A%2AMessage%20is%20on%20second%20line.%20Message%20should%20be%20one%20line%2A) ^(·) [^(**Add Timezone**)](https://www.reminddit.com/user/setTimezone?source=reddit&username=CFM-SK) ^(·) [^(**Add Email**)](https://reddit.com/message/compose/?to=remindditbot&subject=Add%20Email&message=addEmail%21%207940a807d7b241a3810f92d6111afdf2%20%0Areplaceme%40example.com%0A%0A%2AEnter%20email%20on%20second%20line%2A)\n\n**Protip!** You can [add an email](https://reddit.com/message/compose/?to=remindditbot&subject=Add%20Email&message=addEmail%21%207940a807d7b241a3810f92d6111afdf2%20%0Areplaceme%40example.com%0A%0A%2AEnter%20email%20on%20second%20line%2A) to receive reminder in case you abandon or delete your username.\n\n\n\n*****\n\n[**Reminddit**](https://www.reminddit.com) · [Create Reminder](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder&message=your_message%0A%0Akminder%20time_or_time_from_now) · [Your Reminders](https://reddit.com/message/compose/?to=remindditbot&subject=List%20Of%20Reminders&message=listReminders%21) · [Questions](https://reddit.com/message/compose/?to=remindditbot&subject=Feedback%21%20Reminder%20from%20CFM-SK)", "score": 1, "replies": []}]}]}, {"body": "Weak, im holding 111 5/15 1000C", "score": 14, "replies": [{"body": "I like your optimism", "score": 5, "replies": []}, {"body": "Smart man.....fkn idiot", "score": 1, "replies": []}, {"body": "F", "score": -4, "replies": []}]}, {"body": "If you truly believe that then short the crap out of it. Put your money where your mouth is... I have learned the hard way; never short TSLA.", "score": 18, "replies": [{"body": "I am... 700p October and 500p 2021", "score": -7, "replies": [{"body": "Good luck with that. I prefer to buy it after a downward swing when it hits resistance since you know their cult following will bring it back up. Bought it at $650 and sold at $800 just 6 weeks ago. Then it hit $900. Then back down to $450 then bough it again. Use a trailing stop on the way up and you are good. Crazy stock.", "score": 9, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I agree, they will have the US, China and Europe covered. Plus driving their cars is an amazing experience. It’s weird how we consider a price of $450 down at the moment. 🙃", "score": 1, "replies": []}]}]}, {"body": "Proof or ban", "score": 2, "replies": []}]}]}, {"body": "Yeah yeah, and they are going to stop printing money any minute now.", "score": 5, "replies": [{"body": "Anyone saying money printer go BRRR as more than a meme doesn't realize that it's a short term solution", "score": 2, "replies": [{"body": "Interesting, why? What stops the Fed from printing $20T this year? They're already buying junk bonds.", "score": 1, "replies": [{"body": "Well 1) every dollar the fed prints is eventually paid back to the fed, or its a loss for the government 2) we already run a trillion dollar deficit on a 23 trillion dollar national debt, EVENTUALLY the creditworthiness of the U.S comes into question, I understand that it's almost blasphemy to suggest that the U.S could default but at the end of the day it is an entity with cash flows, and either it raises taxes to fund the debt (meaning lower household incomes for consumption or lower corporate earnings) or they stop printing money", "score": 1, "replies": [{"body": "Thanks for the insights. I think the Fed will keep printing for the foreseeable future, like $20T this year. That reduces the debt in real terms. There should be stagflation eventually.", "score": 1, "replies": []}]}]}, {"body": "Do you think they care? They'll do anything to prop up this zombie until Drumpf is reelected.", "score": 1, "replies": [{"body": "I understand that but the fact that they do it or not doesn't prevent the long term ramifications.", "score": 1, "replies": []}]}]}]}, {"body": "Hmmm... all I need is ~$2500 for a single position.\n\nI'm not feeling the bargain even with an IV just under 100%", "score": 3, "replies": []}, {"body": "[deleted]", "score": 8, "replies": [{"body": "Update: bot op but he def lost all his money", "score": 1, "replies": []}, {"body": "They are going to report a Q1 loss LOL", "score": -5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Implying they use a cheaper supply chain ignore the currency conversion. What level of deliveries would you say is required to operate the china gigafactory at a profit?", "score": 0, "replies": []}]}]}]}, {"body": "Lmfaoooooooo you shorted Tesla at March 18 which was around $400 now it’s up to around $590, you’re fucking retarded take the Loss and don’t cuck Elon.", "score": 8, "replies": [{"body": "Sounds like a bull who bought at 900", "score": -6, "replies": []}]}, {"body": "Why are there so many idiots who think TSLA will crash and burn? Makes no sense", "score": 3, "replies": [{"body": "Yea a company priced for 40% growth QoQ into the foreseable future that has never reported a fiscal year profit that trades at 3-4x sales when peers trade at .4-.5 sales... yea... makes no sense..\n\nEdit: While going into a steep recession with a slow recovery... At the same time the price of gas is near long term lows..", "score": 2, "replies": [{"body": "Growing companies are priced differently from stagnant companies. Congrats on figuring that out", "score": 1, "replies": []}]}]}, {"body": "Oh Elon is going to raw dog you", "score": 2, "replies": []}, {"body": "Going to 0", "score": 4, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Yeah same shit as last year", "score": 1, "replies": [{"body": "Except it's different this year because it was actually plausible, bigger smarter money is invested than last year", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "User name checks out, if they reported a profit of 160M or more they would meet guidelines, Q1 2019 big loss falls off, What exactly is priced in then huh? if you fully understand it what is priced in? 0% YoY growth on no earnings?", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "To be added to the S&P 500, the following criteria must be met:\n\nIt must be a U.S. company.\nThe market cap must be $5.3 billion or more.\nThe public float must consist of at least 50% of outstanding shares.\nIt must have positive reported earnings in the most recent quarter, as well as over the four most recent quarters.\nThe stock must have an active market and must trade for a reasonable share price.\n\nYes they are", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You are wrong here, it's over so combined over the past year. So you can lose money in Q1 and Q2 but make a lot more profit in Q3 and Q4 to make an overall profit OVER the four most recent quarters.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "That is correct you are correct BUT 4 quarters will be the upcoming earnings for Q1 2020, so Q1 2019 which was 700m loss drops off. So the only negative they have currently is the 400m in Q2. With 100m in both 3 & 4 they need about 200m to make a profit using rough numbers.\n\nNeed anything else spoon fed?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "All I was saying is that you are wrong about your comment I commented on. Not that they would make enough profit to cover, but they have a chance, it's not out of the question.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Aren’t the market reactions usually months ahead of shit like this?", "score": 1, "replies": [{"body": "Not if half the shareholders are retail speculators with loads of calls expecting TSLA to moon", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I've been betting against elon for a long time i just don't lose all my money doing it lol", "score": 0, "replies": [{"body": "Betting through paper trading doesn't count...", "score": 1, "replies": [{"body": "Not everyone on this sub are broke with no money..\n\nCan't post a link but positions are 1 contract 700p october and 2 contracts 500p 2022, if you care you can figure out how much money is behind the bet", "score": 0, "replies": []}]}]}]}, {"body": "I’d imagine a lot of people who bought TSLA were early believers or recent converts. I highly doubt a large number of people are holding because they’re just waiting for the company to be added into the S&P 500 and will dump it because of this.\n\nTSLA can still absolutely go down to <$300 because no one is producing anything but that’s a macro issue affecting all companies.", "score": 1, "replies": [{"body": "Totally, difference is some companies have good balance sheets and earnings to fall back on, Tesla revenue grows at 5-10% a year without new financing, which could freeze up near to medium term", "score": 1, "replies": []}]}, {"body": "TSLA is a meme stock that doesn't give a fuck about fundamentals.", "score": 1, "replies": []}, {"body": "\\>  TSLA reports a huge loss Q2, which is all but guaranteed they won't get added for at least another 9-12 months. \n\nI know its only two data points, but recent good TSLA news includes beating production goals on the cybertruck AND Chinese sales being up. How does that figure into it?", "score": 1, "replies": [{"body": "If you look at gross margins and operating expenses I don't believe 88,000 deliverables is enough to be profitable with theit expenses. Only exception is if they recognize significsnt FSD revenue. Will only be worse in Q2", "score": 1, "replies": []}]}, {"body": "Hi! For this post (and future DD), feel free to join r/WallStreetResearch in order to easily cross-post. This isn't a competing server, but instead a digital archive for DD posts across subreddits so that research can be easily organized and referenced backed to. A financial research library of sorts.", "score": 1, "replies": []}, {"body": "this aged poorly", "score": 1, "replies": [{"body": "Give it time", "score": 1, "replies": []}]}, {"body": "SON OF A GUN", "score": 1, "replies": []}, {"body": "Tesla to 1000 you're drunk go home kid", "score": 1, "replies": [{"body": "ok.", "score": 0, "replies": []}]}, {"body": "Record car sales for them in China.", "score": 1, "replies": [{"body": "”Wholesale”.", "score": 1, "replies": [{"body": "Finally someone who reads past a headline", "score": 1, "replies": []}]}, {"body": "Record wholesale care sales, which basically just means the car left the factory", "score": 1, "replies": []}]}, {"body": "So you think that since they won't get added to S&P500 until at least June, they are going to lose half their market cap?  huh?\n\nEven if that made sense, it would cause SP to go up.  **Everyone knows that no customers, no revenue = ATH share price.**", "score": 0, "replies": []}]}
{"title": "Bulls, do you GENUINELY think the bear market is over for good?", "selftext": "I'm just really curious about the bull sentiment right now. (Personally, I'm neutral at this point, since nothing makes sense and anything is possible.)\n\nI get that it's fun to make fun of gay bears and their losses. But, seriously, do you wholeheartedly believe we're in the middle of the fabled v-shaped recovery and shooting up to ATH from here?\n\nLike, it was one of the most massive crashes of all time, economy is still largely shut down, with massive unemployment, but in a few weeks we'll just resume where we left off in mid February, like nothing ever happened?\n\nMoney printer or not, doesn't this kind of recovery sound *a little* too good to be true?\n\nEDIT:  STFU with your \"brrr\" bullshit.  I'm not implying you're wrong or right.  Answer the question that I'm posing.", "id": "fyplal", "created_utc": 1586555138.0, "score": 46, "upvote_ratio": 0.88, "num_comments": 73, "comments": [{"body": "Yup SPY 350c May 15 all in, more unemployment = strong economy", "score": 81, "replies": [{"body": "Can't tell what's sarcasm anymore.", "score": 60, "replies": [{"body": "It's been like this for the past 2 weeks. \n\nBAD NEWS = +10%", "score": 25, "replies": [{"body": "Do you fools conveniently forget we dropped 30 percent in 3 weeks last month on zero fucking actual news? \n\nWas there any big economic data prints like unemployment out there when we were jumping out the window and tripping circuit breakers?", "score": -5, "replies": [{"body": "Lol fuck. I thought I was stupid", "score": 8, "replies": [{"body": "You are. You are also poor.", "score": -4, "replies": [{"body": "I am not poor, and I never will be. But god forbid I ever get as retarded as you.", "score": 3, "replies": []}]}]}, {"body": "I've heard rumors of a little virus going around idk though could be fake 🤨", "score": 1, "replies": []}]}]}]}, {"body": "SPY 315c 5/1 checking in, already up 50%. None of it makes sense but tendies are tendies..", "score": 2, "replies": []}]}, {"body": "For the last time, you don’t need any reasoning when the printer is on.", "score": 36, "replies": [{"body": "The printer is mostly for loans.  Just because your company took millions in loans, doesn’t mean you’re immune from still getting fucked from having no customers.", "score": 9, "replies": [{"body": "Not just companies, hedge funds too. Companies that invest in the market are getting free money", "score": 5, "replies": []}]}, {"body": "BrrRrRRrrRRrrr", "score": 1, "replies": [{"body": "BrRrRrRRrrrrrRrrRRRRRRRRRRRRR", "score": 2, "replies": []}]}]}, {"body": "Nah, I think we got a bit more upside but the crash is coming. Only a matter of time.", "score": 13, "replies": []}, {"body": "I GENUINELY think Papa Powell will keep printing at least till 290", "score": 20, "replies": []}, {"body": "I think « the market » is over (for now). Now its just a store.\nIn a market you haggle. In a store you just pay the prices asked or you get out. The FED is basically setting a price now.\n\nLike you know when you losers look for a gf at those prostitution/underage russian girl wife auction sand you get that one planted guy screaming in the back « scraggle tooth pancake ass is worth twice that!! I’ll gladly bid $20 sir » well thats like the FED. They’re that guy, and now you have to pay $20 or more, or start bidding at the se asian stand", "score": 10, "replies": []}, {"body": "I'll bite.\n\nSo between the market dropping from 3300 to 2100, I played long and short positions on /ES, and I did well. Ended up 4x'ing my trading account. \n\nI even covered my shorts at the bottom (Sunday night), and initiated longs, during which I captured the move to 3300. At this point, my account was over 5x, and this was also the last time I attempted to go long.\n\nPersonally, I expected 2400-2500 to be the top of the rally, and going into this week, I had a short position @ 2550. \n\nThis Tuesday came about when we rallied a few % points up, and then sold off completely by the close. That to be was the signal that the reversal is finally here.\n\nWell, Wednesday changed everything for me. Since we bought everything right back up.\n\nThat, I realized that I am being too biased on market expectations, so I reevaluated the current situation, and I decided to cover my shorts. At that point, my act was back to 4x of the original. Anyhow, I transferred the balance to my retirement acc, and bought back fully in stocks. \n\nSo I'll begin by linking to this comment I made yesterday:\n\n[https://www.reddit.com/r/wallstreetbets/comments/fy0ne9/what\\_are\\_your\\_moves\\_tomorrow\\_april\\_10\\_2020/fmyaisa?utm\\_source=share&utm\\_medium=web2x](https://www.reddit.com/r/wallstreetbets/comments/fy0ne9/what_are_your_moves_tomorrow_april_10_2020/fmyaisa?utm_source=share&utm_medium=web2x)\n\nToo add to this, right now, investor's confidence in the stock market is ridiculously high. Just think about this, here we are during a pandemic, businesses are closed, GDP is going to be horrible, but we are pushing. Why are we pushing? Because of intervention from the Fed and Congress. \n\nThe stock market should be about risk vs reward. The idea is, it has great returns, but there is risk is involved. Well, those two parties have been able to turn it into a risk-off situation. Worried about a sector failing? They'll bail them out. JPM is holding shit mortgage securities? No worries, the Fed will buy them. \n\nThen wait, since the Fed is buying bonds left and right, the yields are dog shit. Well, money needs to go somewhere? To the market, it goes!\n\nThe point I am making is that this is an unprecedented intervention that we have ever seen when it comes to the economy and market. The market is now pricing that in, knowing that in the future, if shit hits the fan again, the chances of a serious bear market is low, if all the parties intervene to the same level. \n\nI know this is going to sound a bit insane, but I wouldn't even be fucking surprised to see us hit 3400 before we even have a vaccine for COVID.\n\nLastly, with all this being said, I don't expect a rocket ship up from here. I don't expect rallies every other day. Do I believe we'll ever see the previous bottom? Nope. 2300? Nope. 2500? Sure, I can see that.", "score": 13, "replies": [{"body": "I'm in a similar boat (also bought puts after the first down day, covered near the bottom and bought new puts right below 2500). Presumably, you were as overconfident as I was, and yet finally threw in the towel on Wednesday - along with many others it seems. This sounds like a potential top. I wouldn't be surprised to see a false breakout above current levels, followed by a mid-day reversal.\n\nInstead of covering your puts, it may have been wiser to hedge with gold calls - or the most beaten-down stocks you can find. If the mania continues, the hedge is up 3-10x and if we get a crash, the puts are up 3-10x.", "score": 0, "replies": [{"body": "What respectable company’s shares do you know of currently who as of this weekend are still down 10x? Thx", "score": 3, "replies": []}]}]}, {"body": "Dude, there's 2 trillions more in the economy. Where is it going to end up? In stocks.", "score": 14, "replies": [{"body": "Yes, 2 trillions in LOANS.", "score": 7, "replies": [{"body": "Is a loan at 0% reeeaaallllyyy a loan???  Lol", "score": 6, "replies": [{"body": "Do you have to give the money back or do you get to keep it?\n\nExactly.", "score": 7, "replies": [{"body": "Right its like interest only loans kind of...they don't care if u ever pay off principal", "score": 0, "replies": []}]}, {"body": "inflation?¿", "score": 0, "replies": [{"body": "Pfff as that money you borrowed becomes worth less via inflation then if u ever do pay it off its less than u borrowed.", "score": 0, "replies": []}]}]}]}]}, {"body": "Can’t hear you over the BRRRRRRRRRRR 🖨🖨🖨", "score": 18, "replies": [{"body": "What? I can't hear you over the BBBRrRRrRrrrrrr!!!", "score": -2, "replies": []}]}, {"body": "Can't hear you over this money", "score": 11, "replies": [{"body": "So that's a \"yes\"?", "score": 2, "replies": []}]}, {"body": "I’m bullish, but think markets getting ahead of themselves.\n\nEssentially - the negative effect on the market of “country y reports x amount of deaths/cases” is pretty much over\n\nHowever, we’re in no mans land because nobody really knows for sure what Upcoming earnings are going to look like. We all know they’ll be really bad, but how bad?\n\nI think in the next 2 weeks we experience a pullback followed by a surge to 300 on SPY in early May as news of opening the country hits slightly earlier than anticipated.", "score": 7, "replies": [{"body": "Seems backwards though. The models showing 60k dead require lockdown till June 1, whereas we're getting hyped up for an early May reopening.\n\nPlus I think we'll see some rolling peaks outside of NYC, but I'm not sure that part will trouble markets.\n\nI'm a 🌈🐻, but have obv been getting crushed and am going to hedge with 2 week SPY 285 or so...", "score": 3, "replies": [{"body": "The models have been revised and revised,  lower and lower.\n\nThat’s why I think May.", "score": -1, "replies": [{"body": "Revisions down are based on us staying locked down THROUGH may though. It's counter intuitive, but basically, it's always going to look like you did too much or too little.", "score": 3, "replies": []}]}]}, {"body": "Seems reasonable.  Please just fucking dip this week so I can break even on my shitty puts.  spy 250p 5/15\n\nThen I'm buyin calls cuz pepega market", "score": 2, "replies": []}]}, {"body": "Bull market til after the country “opens” and through Nov elections. Then comes the bears. They will keep doing what they’re doing until people go back to work and after Trump gets re-elected then we will start to see reality set in and a big dump. CALLS the rest of the year. PUTS in 2021.", "score": 3, "replies": []}, {"body": "Well you know bulls, they could be delusional at times..", "score": 5, "replies": [{"body": "I'm not even trying to say they're wrong.  Just genuinely curious about the thought process.", "score": 4, "replies": [{"body": "Btw me too, since I’m waiting for them to get rekt 😂", "score": 4, "replies": []}]}, {"body": "Who’s more delusional , the person deciding to enter a short position at a recession level print on vix or someone being bullish long term since every time we have hit such a massive level on VIX, we have slowly grinded back up on the markets ?", "score": 3, "replies": []}]}, {"body": "yes. I even created a new u/wsbGbull account.\n\nThe reason why I say yes is because of this NYTimes article. It finally makes sense to me now: \n\nhttps://www.nytimes.com/2020/04/10/upshot/virus-stock-market-booming.html?action=click&module=Top%20Stories&pgtype=Homepage\n\nThe sentiment is that things are going to get better, and the stock market is the value of a stock based on its FUTURE. So unless something threatens the future of these companies performance, the stock market will continue to stay up and rise.", "score": 5, "replies": [{"body": "Prolonged lack of spending will threaten it. Any travel, retail, restaurant. Cars, construction.\n\nThing is, may take a month or 2 more to set in... I am gonna ride out my 5/15 puts but will hedge w/ some calls cause I think we're in for another stupid week.", "score": 5, "replies": [{"body": "Right? I hate OP’s reasoning. “We trade on the future der der der”. Really, asshole? So when the abomination of numbers Q2 and Q3 come out were just gonna be like “well we expected this! So market goes up!”\n\nFuck off.", "score": 1, "replies": []}]}, {"body": "Wait until taxes rise because of all this.", "score": 3, "replies": []}, {"body": "Consumer sentiment is still a wild card.  We don’t know how quickly the spending will return to normal.   Will restaurants be packed a day after the lockdown is lifted?  Will people pack into planes to fly to vacation destinations?  We don’t know when that will happen.  \n\nHell, we don’t even known when lockdowns will be lifted.  It’s a moving target at this point.\n\nApparently, tomorrow will be the peak of daily deaths.  We’ll see.\n\nAlso, the longer this lasts, the more chance of people defaulting on their mortgages, car payments.  Government stimulus won’t keep people solvent forever.  I don’t think this is priced in because, again, we don’t have a concrete answer on when things will get back to normal.", "score": 1, "replies": [{"body": "I really expect consumer spending to only marginally decrease because this shutdown is such a stark contrast to how life was like 3 months ago, people are still in denial and the minute a vaccine comes out the people become the money printer. I hope....", "score": 1, "replies": []}]}, {"body": "This. The stock market is a leading indicator that's months ahead of the economy.", "score": -1, "replies": []}]}, {"body": "It could drop but not any further than the March 23rd bottom. Then it’ll shoot back up again.", "score": 2, "replies": []}, {"body": "**TLDR:** No. The bear market is not over \"for good\", but I do think the bull sentiment will remain for at least another week or two. Hear me out... possibly end of April.\n\nWhen the markets dropped back in February/March, the drop was significantly overdone, simply because there was so much uncertainty in the market that no one knew what this virus was capable of. Plus half of the world's financial system is automated where stop-losses trigger a sell to avoid being wrecked by unpredictable economic conditions. This not only causes an accelerated selling of assets (in this case equities), but also an overselling. This happened for many reasons, but the drop that spilled the cup over was the lack of certainty surrounding COVID.\n\nTo correct the overselling though, FED had to step in, if they hadn't, America might literally be World War Z right now. So as a corrective measure, and with more data becoming available each passing day, investors start rationalizing their buys. \"OH, company X has solid financials but it is only hit by corona. I should buy now to get 40% return on this\"... Again, the masses think alike, and in comes the capital that had previously left. There are also so many other reasons for this, the FED printed so much money that it made equities a worthwhile risk, but risk nonetheless. Not only that, if overprinting does cause everything to go to shits, the dollar becomes useless and holding something with a mediocre return seems a better option. Ray Dalio supports this by saying \"Cash is trash\". He doesn't mean it's actual trash, he just means it's trash relative to assets that may provide return enough to cover inflation (if it does happen).\n\nWhat we're seeing right now is a once more overreaction by the market. Reduced earnings forecast don't seem to be affecting prices because the logic is \"well yeah, obviously it's reduced earnings... their stock is also 50% down, so it's fine\". Neither do the unemployment levels, because those too seem \"temporary\" because \"corona will soon go away\". In certain cases it is true. In Canada, Air Canada re-hired nearly 16000 employees, causing their stocks to rally from $14-$21 in a week... despite every airplane being grounded, and the world being closed off. BECAUSE THAT IS PRICED within the 70% drop that the price has seen.\n\n**The market only moves based on NEW information**, and it is also a discounting mechanism. Meaning when it gets news, it assumes the worst/best and rolls with it. If more news comes out along those lines, it doesn't seem to matter much in times of panic/greed... News has to be both **UNEXPECTED** and **SIGNIFICANT**. No one was expecting the printers to \"brrrrrrrrrr\" for this long and with such intensity, and thus the rally.\n\nIf governments extend delays of Corona beyond June, and airports/hotels/cruises remain halted for that long... We might see a just as swift fall then as we saw in February/March. But if the news is simply \"100 more dead in NY tonight\" it's not enough. It's expected.\n\nThe good news has stopped with this $2.3t package and buying of the bonds. They should keep the market propped up for a week or two, but the growth will remain low, or sideways. For it to go red, we would need mayhem... which unemployment will eventually cause when people can't pay mortgages or car loans or taxes. But as of now people haven't even been unemployed for two weeks... That isn't anything, especially when you look at the $2000 checks coming in... and in some cases minimum wage workers actually being much better of now than before the virus.\n\n**Edit:** Check out institutional investors. They're putting in billions of dollars on cheap companies and picking them up because they realize these companies are undervalued and they are the ones that mostly move the market. You can find this info on places like CNN or OpenInsider.", "score": 2, "replies": [{"body": "Solid take.\n\nThe covid trajectory model is the wildcard to watch.  It predicts an apex in deaths TODAY.  I’m sceptical.", "score": 1, "replies": []}]}, {"body": "I’ve spent hours and hours poring over charts and TA and I’ve come to the conclusion that the market is about to either go up, go down, or go sideways\n\nHope this helps", "score": 2, "replies": []}, {"body": "I dunno, but each time I go to /r/economy I feel like in the grim darkness of the near futur… there is only bears.", "score": 1, "replies": []}, {"body": "Yes.", "score": 1, "replies": []}, {"body": "Who needs workers or fundamentals when you can just print money? It's easy.", "score": 1, "replies": []}, {"body": "bear market was just an overcorrection", "score": 1, "replies": []}, {"body": "No. I think this will mimic the Great Depression and take about 3-5 years to truly recover. This is a short term bump. More pain is coming this week.  Already 2000 point drop.", "score": 1, "replies": []}, {"body": "No, by why fight the tidal waves? Just get a surfboard and ride them instead of being rolled and smacked against the reefs.", "score": 1, "replies": []}, {"body": "The market is not the economy.", "score": 1, "replies": [{"body": "It partly is.  This is the dumbest new meme.", "score": 1, "replies": []}]}, {"body": "No, lost a bunch on puts thinking it was bound to drop. Sold for big loss, bought calls and got a little back. Now waiting for the fuckening to happen", "score": 1, "replies": []}, {"body": "BRRRRRRRRRRRRRRRRRR", "score": 1, "replies": []}, {"body": "Answer that after April earnings reports are released.  :)", "score": 0, "replies": []}, {"body": "Wow are you asking a bunch of fucking autists.  Are you actually going to make a decision based on random fucking comments?  Get your fucking head checked idiot.", "score": 0, "replies": [{"body": "Who said I’m making any decisions off of this, idiot?", "score": 1, "replies": []}]}, {"body": "I called the bottom 17 days ago. You guys chose not to listen \n\n\nhttps://www.reddit.com/r/investing/comments/fodpo0/did_we_just_miss_out_on_the_greatest_buying/?utm_source=share&utm_medium=ios_app&utm_name=iossmf", "score": 0, "replies": [{"body": "now what", "score": 1, "replies": [{"body": "Wait for the next global pandemic", "score": 3, "replies": []}]}]}, {"body": "Dont tell me what to do cocksmoker", "score": 0, "replies": []}, {"body": "Yes money printer go brrrr and the stock goes up.", "score": 0, "replies": []}, {"body": "Brrrrrrr", "score": 0, "replies": []}, {"body": "\"Shut up with your brrrr shit.\" Lmao bull market go brrrrrrrrrrrrrrrrr", "score": 0, "replies": []}, {"body": " brrr ...", "score": 0, "replies": []}]}
