{"title": "Stockmarket in FREEFALL! This is what happens when you remove the goddamn 3.5mm jack from the iPhone.", "selftext": "Now we can't use our headphones AND we have to deal with a fucking global economic collapse. Fuck you Apple.", "id": "51zf6x", "created_utc": 1473451982.0, "score": 611, "upvote_ratio": 0.91, "num_comments": 112, "comments": [{"body": "That's because everyone has to spend all their money on new headphones, can't afford food or clothes", "score": 185, "replies": [{"body": "Fucking savages. Asking $160 for Chinese air pods? They're worse than Yellen.", "score": 21, "replies": []}, {"body": "r/financialindependence", "score": 2, "replies": []}]}, {"body": "[removed]", "score": 71, "replies": [{"body": "I figured it was because of North Korea's Nuclear detonation.", "score": 2, "replies": []}]}, {"body": "It's definitely people cashing out so they can afford at least 10 pairs of  those air whatever things because they gonna get lost constantly.", "score": 31, "replies": [{"body": "I'm imagining all those drawers full of spare left or right ear pieces. ", "score": 7, "replies": []}]}, {"body": "This wasn't Apple (though fuck them for dragging shit down yesterday too). This was the god damn fucking piece of shit Fed opening their asses and talking shit about a possible rate hike in September WHICH WILL NOT HAPPEN IN SEPTEMBER.  God damn fuck those guys with a fucking rubber hose covered in fucking tar and fucking nails.  Lost all profits today since Brexit for a grand total of -$7,500 in a span of a few hours.  My ass is still gaping and it hurts to sit.  While Monday may dip a bit, I'm fucking twisting my balls of tungsten golden alloy and doubling down come monday.  Fuck it all.", "score": 80, "replies": [{"body": "So... won't it just go back up in two weeks when they don't raise rates? Load into UPRO/NUGT/JNUG and enjoy your profit.", "score": 23, "replies": [{"body": "That's what I think (and almost everyone else I know that does this kind of thing for a living too).  But no, don't mean to disrespect UPRO/NUGT/JNUG, but fuck that.  I have a personal vendetta.  I lost all that with E-minis.  I shall recover my money with E-minis.  I refuse to let that bitch take my money just like that.  I'll jump in sometime next week once it stabilizes and hold that shit all the way through Christmas if I have to as long as I close it at a profit.  ", "score": 3, "replies": [{"body": "That's emotional trading and it will kill you. You'll lose everything if you're trying to make a point to yourself.  e-minis don't give a shit.  Also money is money is money, be smart and make it back elsewhere if one sector is failing you. ", "score": 9, "replies": [{"body": "Quit giving pussies good advice when they don't want it", "score": 12, "replies": [{"body": "You're what.  I don't know what I'm thinking. \n\n\nYou're right*", "score": 3, "replies": [{"body": "How many shots did you take", "score": 3, "replies": [{"body": "Too many. ", "score": 2, "replies": []}]}]}]}, {"body": "Very true.  Needless to say, I am still butt hurt over yesterday's result, so a lot of what I am posting is emotional and (at least trying to be) funny.  \n\nBut yes - time to go back to the drawing board.  Next two weeks will have many opportunities to make money.", "score": 1, "replies": []}]}]}]}, {"body": "So just don't sell it? If your stock price tanked because of some transient like the fed announcement just double down and buy low now then sell it all in a couple weeks when it rebounds. FFS", "score": 11, "replies": [{"body": "I was holding a few ESU16's, which have a last trade date coming up early next week.  Volume for ESZ16 already passed ESU16, so either I closed it and ate the shit sandwich, or I rolled it (which closes your current contract and opens the new one) and still ate the shit sandwich.\n\nI usually hold through very sharp rapid market snaps;  those usually revert within a few minutes/hours/days.  Yesterday was different.  That was a continuous dick thrusting from Asia open all the way through US close.  Steady line down with ever increasing sell off.  Equally important, no real economic announcement (Fed clowns talking, but they did not say anything new, nor mention September explicitly).  When that happens, get the fuck out if you have a chance, even at a loss - it's more of a market regime change than a quick panic.  Eventually comes back, but if I were holding onto my position, it would be a 2X loss right now.", "score": 4, "replies": []}]}, {"body": "I feel you bro. If SRPT goes below $26.10 then go all in and sell weeklies.", "score": 4, "replies": [{"body": "Probably not a bad idea all things considered.  Fucking Fed clowns...", "score": 2, "replies": []}]}, {"body": "You should have sold yesterday. ", "score": 8, "replies": [{"body": "Yeah, but that's easy to say after you wake up in some stranger's bed with your asshole torn apart.  The saddest part is I was just a few ticks away from scratching.  Probability wise, I was much more likely to catch some random drift and hit my limits than whatever the fuck happened yesterday.  Oh well.  ", "score": 2, "replies": []}]}, {"body": "I've heard MSTseX is a hot pick right now. You should probably take out a second mortgage and go all in..", "score": 2, "replies": []}, {"body": "I think with Trump doing this well the uncertainty going into election season is going to be pretty hard on the market.", "score": 1, "replies": []}, {"body": "Average down. XIV and JNUG/NUGT to the moon, son.", "score": 1, "replies": []}, {"body": "Where do you think you are, /r/finance? This is wallstreetbets, ain't got time for the real reasons.", "score": -5, "replies": [{"body": "Hey man, I was Yoloing trades and got fucked along the way.  I think that falls into /r/wsb...  This second part is just accepting reality that I grabbed a few pay checks (post tax, which hurts even more), shredded them, and then lit them on fire.  But, I get the feeling this is similar to a Brexit reaction - nothing truly changed in the economy yesterday.  Will rebuy next week once shit stabilizes.  And come FOMC, most likely (not definite yet) will Yolo a few ESZ16's through the very much expected (but not guaranteed) decision to hike in December and not September.", "score": 1, "replies": []}]}]}, {"body": "I love when incompetent people make companies crash and burn....\n\nlike that psycho control freak Melissa Meyer that rekt yahoo against a telephone pole... and Tim Cook.. that has no idea what he is doing. He looks like a guy that would help me in a hardware store however.", "score": 77, "replies": [{"body": "Yahoo rose 150% during Meyer's tenure http://finance.yahoo.com/news/yahoo-stock-marissa-mayer-151-000000158.html", "score": 26, "replies": [{"body": ">Of course, Yahoo stock performance has much to do with the stock performance of Alibaba, in which Yahoo has had a stake since 2005. Alibaba went public in September 2014.\n\nCherry picking statistics doesn't mean much.", "score": 62, "replies": [{"body": "True, but Yahoo was a sinking ship long before Mayer took over", "score": 16, "replies": [{"body": "They bought 40% stake in Alibaba in 2005, 7 years before Mayer was CEO. Of course they would have stocks in the company when they went public in 2014.", "score": 29, "replies": [{"body": "Yup, and I forgot which exactly it was, but the board wanted to invest in some company that now blew up really big, but instead she insisted on spending billions buying Tumblr, which ended up being a huge failure.\n\nShe was an awful CEO", "score": 2, "replies": [{"body": "She was great in product. Should have stayed at Google, she wasn't fit for a CEO position.\n\nYahoo hired her because they needed a fresh face and someone who would bring the company attention. Of course because of her being a knockout, she would get hired unanimously for the position.\n\nShe also had her own PR team at Google that was focused on making her look really good.", "score": 1, "replies": []}]}]}]}, {"body": "How is stock price performance a cherry picked stat?", "score": -11, "replies": [{"body": "Because events other than management performance influence stock prices", "score": 18, "replies": []}]}]}, {"body": "I mean, you know very well its Alibaba and Yahoo Japan that drove up that value. \n\nTraffic, revenue, and profits all fell during her tenure. The value of Core Yahoo plummeted", "score": 6, "replies": []}, {"body": "Why did they sell it for peanuts?", "score": 9, "replies": [{"body": "Because it was worth a fraction of \"peanuts\" when Meyer took over", "score": 25, "replies": [{"body": "The only thing she did was cut costs and cut employees balls.. besides stalking them....", "score": 10, "replies": [{"body": "Anyone who wasn't able to jump-ship from Yahoo by the time she took over must have been a garbage employee anyway.", "score": 8, "replies": [{"body": "That's what I heard.", "score": 1, "replies": []}]}]}, {"body": "One peanut.", "score": 1, "replies": []}]}, {"body": "Not all of yahoo is sold.", "score": 3, "replies": []}]}]}, {"body": "Yeah, under his leadership stock price was in the low 90s. That's enough to get rid of most of the top brass. Imagine having innovators, like real ones not faggoty ive wanking off cause he invented the click wheel, it'd be a force of nature. Apple should be pushing into new fronteirs not following facebook (aol v2) and amazon (a book reseller). It's almost bizarro world now. ", "score": 10, "replies": [{"body": "and no one should take financial advice from a discount insurance salesman.", "score": 7, "replies": [{"body": "hahah", "score": 1, "replies": []}]}, {"body": "\n\n> not following facebook (aol v2) and amazon (a book reseller). It's almost bizarro world now. \n\n[At its peak,](https://upload.wikimedia.org/wikipedia/commons/6/61/Aol_subscribers_Q201-Q407.png) AOL had <30 million US subscribers. Facebook has > 1.5 *billion* monthly active [users](http://www.statista.com/statistics/264810/number-of-monthly-active-facebook-users-worldwide/users).\n\nAnd Amazon revolutionized e commerce.\n\nApple knows good design and good marketing, they've never been pushing into new frontiers, they've been polishing other companies pushes. \n\n", "score": 2, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "wow rude\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 4, "replies": []}]}, {"body": "there's only so far you can take the 'minimalist brushed aluminum' thing\n", "score": -1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "It's really easy to that when they charge those prices...", "score": 1, "replies": [{"body": "Oh yeah? So why dont they just ask twice that much than if its so easy?", "score": -2, "replies": [{"body": "I'm sure they will within the next 10-15 years. ", "score": 1, "replies": []}, {"body": "They probably would if they could stop people being selling second hand iPhones.", "score": 1, "replies": [{"body": "Yeah but they only could because they made a product worth paying the price than.\n\nIm sure you wouldnt pay the same amount of money for a HTC phone.", "score": -1, "replies": [{"body": "Of course not, because then you can just as easily buy a way better Apple phone for the same price. ", "score": 1, "replies": []}, {"body": "That's definitely debatable. I think most could agree, though, that it was a marketing genius and brand value has a lot to play in the price charged for their products. ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "There were so many outside forces pushing those companies down long before either of those whipping-boy CEOs came in. To blame it on them is not nice, mister.", "score": 1, "replies": [{"body": "Anyone making 20million plus has no sympathy from me. Sorry.", "score": 1, "replies": [{"body": "I don't think they need it. Just pointing out how silly it is for you to believe melissa meyer rekt yahoo, or tim cook rekt Apple. \n\n", "score": 1, "replies": [{"body": "Melissa yes, cook no. Cook is only milking iphone and not bringing anything new, but not rekt'ng apple.", "score": 1, "replies": []}]}]}]}]}, {"body": "TLDR You lost money on AAPL and you shitpost", "score": 23, "replies": [{"body": "Yesterday I posted that everyone should sell. it was titled 'DUMP APPLE YOU IDIOTS'. Can't be more clear than that.", "score": 48, "replies": [{"body": "i think you could have been clearer", "score": 37, "replies": [{"body": "More* clearer.", "score": 2, "replies": [{"body": "more clear?", "score": 1, "replies": []}]}]}, {"body": "So.... What should I do exactly?", "score": 7, "replies": [{"body": "Buy AAPL", "score": 9, "replies": []}]}]}]}, {"body": "[I gottcha covered fam in case you can't afford rope anymore](http://i.imgur.com/X1VRgMI.jpg)", "score": 7, "replies": [{"body": "\\>tfw you can't hang yourself with wireless airpods. ", "score": 20, "replies": []}]}, {"body": ".", "score": 12, "replies": [{"body": "Post", "score": 13, "replies": [{"body": "Transgender ", "score": 9, "replies": [{"body": "A/S/L?", "score": 14, "replies": [{"body": "G/f/y", "score": 54, "replies": []}]}]}]}]}, {"body": "I'm down 1%. Go fuck yourself", "score": 12, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "I'm down 50% I'm going sneeze in your face. ", "score": 6, "replies": [{"body": "I'm still in the same goddamn place because I yolod on SWHC now I'm bagholding", "score": 1, "replies": []}]}, {"body": "Great job faggot!", "score": -1, "replies": []}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Up 7.13% on SPXS, no you learn to short. ", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "wow rude\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}, {"body": "A relevant article posted after this post: http://www.recode.net/2016/9/9/12867842/yahoo-proxy-verizon-acquisition-japan", "score": 3, "replies": []}, {"body": "Removal of the iPhone jack is the single most idiotic thing apple has done. All a ploy to control audio even more. Fuck them. Fuck them hard  ", "score": 5, "replies": [{"body": "Kinda like a mouse that is itself a single giant button", "score": 2, "replies": []}, {"body": "I mean not really. The phone ships with an adapter for 3.5mm. And audio quality can now improve much faster because the speed and loss of the lightning is much lower than tech from 1985", "score": -6, "replies": [{"body": "I don't think you understand how audio works. Once audio is modulated by the sound chipset it is passed through 100% lossless analog to the 3.5mm audio jack. \n\nWhat apple has done is add multiple additional processing layers to send it through USB or Bluetooth. In the case of Bluetooth the audio is processed even more times as it has to go through a wireless chipset WITH loss. Not sure anyone cares about the quality of audio anymore though.", "score": 8, "replies": [{"body": "So you're saying that the sound quality on a standard analog input is better than a digital input?\n\nBy that example the old RGB A/V cables would be the same quality of sound as an HDMI cable and that isn't true. \n\n\nSide note, removing the audio port really does free up a lot of space in the already tiny phone. It's like removing the disc drive from laptops. Plenty of manufacture are doing it to save space and reduce head.  ", "score": 1, "replies": [{"body": "With the HDMI example you are right but that is only because the analog signal has to be converted back to digital for the display which would incur loss. \n\nIn the audio context the headphones are also analog so there is additional conversion step, hence the signal is lossless and the quality is dependent on the headphones. If you use their bloody dongle you are still down converting to analog making all the additional hoopla even more pointless.\n\nWhat is apple doing with all that extra space? Adding more processors to push audio through a USB port? Maybe they could have used that space to increase the battery for all the additional CPU overhead for audio? ", "score": 2, "replies": []}]}]}, {"body": "bro people are trying to circlejerk. Get your facts the fuck out of here", "score": 4, "replies": [{"body": "Oh sorry. What was I thinking. \n\n\nYou may proceed", "score": -2, "replies": []}]}]}]}, {"body": "We are about to witness something economists call a \"modern bank run.\" Last time it happened was 2007.\n\nPrepare you assholes. ", "score": 1, "replies": [{"body": "Last time people said \"it's about to happen\" was every fucking day since 2009. ", "score": 3, "replies": []}, {"body": "What makes you say this? I mean, my gut feel agrees with you, but I'd be keen to learn more.", "score": 1, "replies": []}, {"body": "You or your?", "score": 1, "replies": []}]}, {"body": "Seriously? This isn't freefall lmfao ", "score": 1, "replies": []}, {"body": "What a surprise.", "score": -1, "replies": []}, {"body": "Finally my 214 SPY puts are paying off, was starting to sweat there a bit as it was inching close to 220. ", "score": -1, "replies": [{"body": "what expiration and when did u buy? ", "score": -1, "replies": [{"body": "Bought on August 10th for 1.81, currently before closing its at 3.03. Expires on the 16th of this month. Only 1 contract, been taking a break recently and didn't want to do anything too crazy. \n\nEdit: *3.06 not 3.03", "score": -1, "replies": [{"body": "Damn an entire fucking contract?\n\nWhat a baller", "score": -1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "wow rude\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "We know you're a high-roller because you make fun of internet people's $303 bets. ", "score": 1, "replies": []}]}]}]}]}, {"body": "[removed]", "score": -10, "replies": [{"body": "Relax homie. Go all-in on TVIX Monday morning and you'll be up to to $20k by lunchtime.", "score": 3, "replies": []}, {"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}
