{"title": "[Meta] Since this community is split between \"I want serious posts\" and dank memes, I propose we add a [Serious] flair, where no circlejerk/bullshittery is allowed. Or a daily \"Serious Discussions\" post.", "selftext": "In case mods actually do this, I want 17% of the equity, otherwise I will sue. Go Fuck Yourselves.", "id": "51oc7n", "created_utc": 1473291779.0, "score": 667, "upvote_ratio": 0.9, "num_comments": 151, "comments": [{"body": "[deleted]", "score": 80, "replies": [{"body": "That's on stocktwits", "score": 19, "replies": [{"body": "SONEONE KNOWS SOMETHING", "score": 9, "replies": []}]}]}, {"body": "should have tagged this one [serious].\n\nfuck off m8", "score": 169, "replies": [{"body": "Added a \"Tag me pls\" Flair.", "score": 46, "replies": [{"body": "dont worry baby I hit you with a \"SUPER SERIOUS\" flair. Everyone will know now.", "score": 21, "replies": [{"body": "Thanks, literally Hitler.", "score": 12, "replies": [{"body": "Good to meet you literally Hitler.", "score": 1, "replies": []}]}]}, {"body": "I would tag it but I have no idea how the css wizards do it. I usually page the mods until someone does. \n\nu/cktalon u/only1parkjisung u/stockjock-e u/kevinrose u/goldenchrysus u/martinshkreli \n\nThere. I hope one of them vets this and fixed it for you. \n\nWhile we wait I will see if I can change your flair. I know how to do that, there's literally a button for it. ", "score": 3, "replies": [{"body": "Lol. I definitely didn't realize Martin Shkreli was a mod.", "score": 7, "replies": [{"body": "Pretty sure he questions it as well.", "score": 1, "replies": []}]}]}]}, {"body": "Yeah, fuck your rules op, and yourself!", "score": -3, "replies": []}]}, {"body": "Love the idea. We obviously have some savvy Investors in here that are dropping some serious coin. Would be nice to learn a thing or three. ", "score": 121, "replies": [{"body": "Absolutely. There are practically no good investors in /r/investing\n\nNo coherent DDs or information. Just people flocking from (Supposedly) safe-spot to safe-spot, until they reach 5%, then lose it all on a correction.\n\nThat's not investing, that's faggotry.", "score": 108, "replies": [{"body": "Agreed. I'm trying to make real gains here, not faggotry. I'm just fucking around in bio and mining right now but want to put some serious money towards it. ", "score": 28, "replies": [{"body": "Exactly. This subreddit is about profit, not memes.", "score": 32, "replies": [{"body": "Let's not get ahead of ourselves here. This subreddit is 50% making other people profit with our money, and 50% memes ", "score": 38, "replies": [{"body": "I've only lost $70 since I found this sub and installed robinhood\n\nI'm doing a pretty bad job at making other people rich", "score": 6, "replies": []}]}]}]}, {"body": "I second this. /r/investing sucks and I vote for the serious tag if solely for the yachts ", "score": 18, "replies": [{"body": "I want a yacht but I'm only up 1% after two weeks. ", "score": 7, "replies": [{"body": "Did you download Robinhood yet? I hear they're the best yacht broker", "score": 14, "replies": [{"body": "That's step #1", "score": 2, "replies": [{"body": "step #2 is *all in AMD*", "score": 5, "replies": [{"body": "step #3 RIP", "score": 0, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "hate to break it to you laddie but the little table that shows 52-wk highs/lows does not constitute DD [really serious]", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "u/TheCrownedPixel", "score": 1, "replies": [{"body": "You are too kind! I haven't figured out how to give good info AND be an asshole at the same time. ", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "wow rude\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}]}]}]}, {"body": "not to be pedantic, /r/investing has a different goal than wsb.  they are about consistent growth to self-fund a retirement portfolio.  people in their 50s don't throw 25% of their funds at 3x leveraged ETFs.  they actually care about things like fees and maximizing their gains without going into sweatless bouts of anxiety as they lose all of money shorting KBIO based on a comment someone makes on the interwebs.\n\nalso the \"investors\" in here that give advice are replied to with 'lol get #rekt fgt' type comments when they are down 10% on a position.  when those same \"investors\" post 90% gains those same commenters reply with 'why am i losing money after i mirrored your position after you closed it??'.  then you have serious players giving legitimate advice and everyone responds \"well its not on fucking robinhood yet so i'm going to keep throwing my money into JNUG\" as a rate hike is approved.  it's like everyone in here WANTS to lose money, and that is simply based off of my personal interaction with some cats in here\n\nthere are savvy investors in here but there are way way more teenage college kids thinking they are going to buy a maserati on their $182 robinhood account that they need to keep calling their dad to deposit more funds.  i mean when the masses say 'robinhood is the best broker because it shows all other brokers use fees simply as a profit generating tool' the savvy investor immediately knows they are in the wrong sub", "score": 1, "replies": [{"body": "I'm a novice RH investor and my impression of the sub is that people are deliberately trying to give people bad advice.  I wouldn't take any advice on here seriously. \n\nWhat I get out of this sub, is a reference point to start my own research. People suggest trades on jest, and while I get that it's a joke, I often don't understand why its a joke. So I will read and learn until I can understand why it was blatantly bad advice.\n\nIt would be nice if there was more serious discussion and debate over certain stocks and strategies. But I can't really complain cause I don't have much to offer apart from dank memes.", "score": 3, "replies": [{"body": "Man, I tried to explain to someone that they should not hold DWTI when the saudi's are hinting at a production freeze.  You know what this guy did?  He posted the very next day \"I HATE DWTI I'M DOWN ANOTHER 15%\".  \n\nit's like why give advice if you're going to continue your retarded strategy?  so now when I see people say 'I'M DOWN 40% ON JNUG WHAT SHOULD I DO', i tell them the obvious.  keep holding.  because a fool and his money are soon parted\n\nbut there are also great nuggets of advice throughout the sub.  this one guy gave his butterfly strategy on SPX, which I coudl have blindly followed (and did and made $4.5k), but I also looked into wtf a butterfly was.  what you and i are doing are exactly what I think this sub is about.  laugh at the idiots and listen to the smart moves.  sometimes it takes some research to determine idiots from the smart asses.  anyway check my history I just recently [wrote up a nice post on how to make money](https://www.reddit.com/r/wallstreetbets/comments/51q98o/no_one_here_aware_of_the_money_printing_machine/d7eapvz) on VIX/VXX/UVXY that i'm pretty sure 80% of the sub glossed over because words.", "score": 2, "replies": []}]}, {"body": "Tell us how you really feel", "score": 1, "replies": []}]}]}]}, {"body": "This place would be awful without circlejerk. And I'm a serious investor. LOL\n\n\"I love you now change\" is for skanky bitches man. ", "score": 65, "replies": []}, {"body": "I never want $WSB to change... I need this place", "score": 41, "replies": [{"body": "Nothing will change except people will be able to differ what type of post it is before clicking on it rather than after clicking on it. ", "score": 3, "replies": [{"body": "So it'll be kind of like \"Safe Places\" for the full spectrum autists?", "score": 10, "replies": []}, {"body": "then what's the point of reading?!?", "score": 3, "replies": []}]}]}, {"body": "Do you want this place to become /r/investing this is how it starts. ", "score": 14, "replies": []}, {"body": "You're not the boss of me. ", "score": 23, "replies": [{"body": "pretty pretty please?", "score": 8, "replies": []}]}, {"body": "All due respect. Go fuck yourself", "score": 1, "replies": [{"body": "Gladly", "score": 6, "replies": []}, {"body": "I'm confused. Is this a serious \"Go fuck yourself\" or a dank meme?", "score": 5, "replies": [{"body": "Literally go fuck yourself.", "score": 8, "replies": []}]}, {"body": "**MODS DELET THIS**", "score": 1, "replies": [{"body": "Like with a hammer? ", "score": 2, "replies": []}]}]}, {"body": "Like my flair?", "score": 17, "replies": [{"body": "What about your autism?", "score": 10, "replies": [{"body": "*you'are", "score": 61, "replies": [{"body": "*you're are autism", "score": 17, "replies": [{"body": "*yo'uera is", "score": 7, "replies": [{"body": "*Youre autism", "score": 5, "replies": [{"body": "*smdfbjsdf,jak", "score": 3, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Winner Winner, Chicken Dinner", "score": 6, "replies": [{"body": "[TRIGGERED](https://www.reddit.com/r/wallstreetbets/comments/4ojn07/hey_guys_i_won/d4d8tsy)", "score": 3, "replies": []}, {"body": "BR reference?", "score": 1, "replies": [{"body": "Not really, just the old saying.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "I think a \"serious\" tag will only attract dank memers more.", "score": 8, "replies": [{"body": "[Serious] How many shares of AMD would Harambe have bought if he were still alive?", "score": 5, "replies": []}]}, {"body": "That's what /r/wallstreetdd is for", "score": 13, "replies": []}, {"body": "fuck that noise.\n\ncontent doesn't have to be serious to be productive. Content does not have to be productive to be entertaining.\n\nLOLHARAMBEFAGGOTROBINHOODNOMONEYSTILLINDIAPERSTACHTYACHTYACHT\n\nhas no redeeming qualities.", "score": 31, "replies": [{"body": "I never said it has to be serious to be productive. But honestly, there are some good stuff that get inherently buried because of the circlejerk. Though this is the nature of this sub, the other investing subs are complete garbage.\n\nHonestly, I like to circlejerk, but sometimes I just want to have some serious discussions, and unfortunately /r/investing and /r/stocks are pathetic.", "score": 23, "replies": [{"body": "[deleted]", "score": 19, "replies": [{"body": ">I talk with another person on here via PM and we bounce ideas and trades off each other.\n\nI do that sometimes too, I find someone who seems genuine, and PM them, usually we end up exchanging some tickers, and ideas. Being actually productive. IMO We really need a serious tag :(", "score": 13, "replies": [{"body": "I agree. So much gets lost in the rest of the crap.", "score": 1, "replies": []}, {"body": "i don't think a serious tag is needed.\n\njust ban the pointless memes and people posting pictures of boats and monkeys for absolutely no fucking reason.", "score": -4, "replies": []}]}, {"body": "Let's chat...", "score": 3, "replies": [{"body": "bloomberg and chill?\n\n", "score": 9, "replies": [{"body": "You got a terminal? Party on bruh", "score": 1, "replies": [{"body": "All that means is he goes to business school at a decently large university. That's the only demographic that has access to one that would be on /r/wsb!", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": 2, "replies": [{"body": "28/M/Belize (You know why...)\n\n", "score": 2, "replies": [{"body": "Belize with a yacht and private island. MOFO. Taxes are for chumps. ", "score": 0, "replies": [{"body": "Extradition is for chumps.", "score": 1, "replies": [{"body": "Not if you renounce citizenship. No taxes on foreign earned income in Belize. Uncle Sam will take it on the front end.\n\nWas a shitpost anyway.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "the circle jerk is the problem bullshit i am talking about getting rid of. \n\nthe problem is all the retards that flood in everytime the sub is linked elsewhere only see circle jerk bull shit. everytime there are an extra could thousand subs added, and at least half a dozen dipshits saying they are finally ready to invest their lifes saving of 457 dollars and a bobby pin, but they don't want to do anything risky, so just explain how to write calls for 3x etfs.\n\nget rid of the bullshit memery and ban anyone that links the sub.", "score": 4, "replies": [{"body": "Honestly, I like the memes, I don't like seeing them everywhere upvoted to 150 while something useful is 6-10 posts/comments below.", "score": 15, "replies": [{"body": "and as long as you keep rewarding the retards who don't know good dd when it slams their dick in a car door, this place will remain a joke.", "score": 7, "replies": [{"body": "Agreed. Some people are completely oblivious because of the ilusion that they will make 100k in one day, which brings in tons of /r/all fags. So the shitty DDs/traders/investors are something natural.\n\nWe need a serious tag, where only people knowledgeable can discuss, and no jokes. In case the \"SERIOUS\" tags don't hit front page at all, or very rarely, they should add a daily stickied \"Serious Thread\"\n\nAnd sincerely, that's the only path to take if we want to be a useful community and not just a joke community.", "score": 4, "replies": [{"body": "yeah, and the /r/all faggots don't realize that when i post about 100% gains over three weeks next week that a lot of time and effort does go into the research. and some very painful money lessons have been learned along the way.\n\nno, instead they are greeted by retards welcoming them with open arms telling them to open a robinhood account and get to shitposting because that is all this place is for.", "score": 6, "replies": [{"body": "They don't understand the tediousness of watching GSAT or XCO on a day like today. Seriously. That shit didn't move once. At all. \n\nFor anyone who doesn't follow those stocks please look at the one day ticker to see what I'm referring to.", "score": 3, "replies": [{"body": "it still kills me that there are people with real money on the line the but the ones going full retard on amd pain train or whatever the fuck it is now are the retards that jumped in two weeks ago.\n\nthey are getting what they deserve, so i suppose i should be able to find some solace in that.", "score": 3, "replies": []}, {"body": "Low volatility stocks didn't move today. *gasp* How is this possible?\n\nSeriously, if you expect some action, go for the 3x leveraged.", "score": 2, "replies": [{"body": "I know. I know. XCO has had days of high volatility which I like. \n\nToday it went $1.03 to $1.07 and then $1.03 and flat. Last week it was $1.30 with movement. \n\nGSAT was all over the board last week and there was cash to be made. 3x is not my game at this point.\n\nI was basically reiterating the serious point of this thread. It's not all fun and games to get ahead.\n\nEdit. Added link.\n2nd edit. Deleted link. ", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "Executing anyone that links the sub.  That's an idea i can get behind.", "score": 3, "replies": []}]}, {"body": "FWIW /r/SecurityAnalysis is great quality, but slow. they don't tolerate shitposting, though.", "score": 1, "replies": []}]}]}, {"body": "I actually really like the idea of a stickied thread (I think it would work way better than a flair TBH cause people on this sub are terrible at flairs). That way it's only in one place so people who aren't interested in serious DD, TA, etc aren't inundated by it and people can still have fun with their shitposts. This thread could also be more aggressively moderated than the rest of the sub to help keep it serious.\n\nAs long as it refreshes daily or weekly, this would be a great way to consolidate some of the more thought out discussion/data while still be short enough to easily read through.", "score": 3, "replies": []}, {"body": "No fuck you this is WSB", "score": 15, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Ders?", "score": 3, "replies": []}]}, {"body": "These are good ideas. I like the Serious flair. \n\nAnother suggestion if I may: a weekly \"Judgement Free Questions [Serious]\" thread. I see a lot of n00bs asking repeat questions about options and gold in random threads. Usually they get shit on, sometimes someone cool actually answers. \n\n/r/nfl does this and I think it works well. \n\nhttps://np.reddit.com/r/nfl/comments/4gjjjf/serious_judgement_free_questions_thread_draft/", "score": 7, "replies": [{"body": "Literally everything they need is elsewhere. Though /r/investing is garbage for people who know what to do, it provides a good base for new traders. There are countless books, articles, research papers, resources, and videos about investing/trading.\n\nI don't think we should 'encourage' new traders to be here, since we're a plateau higher than /r/stocks or /r/investing, Overall the subreddit likes High-Volatility things. For newbies, they should stay THE FUCK AWAY from high-volatility stocks, and options in general. I think this is the wrong subreddit for learning. The prime example is the 14 year old kid who posts here regularly and lost some of his dad's money, what we do here isn't for new traders, it's for people who know what they are doing, generally speaking.\n\nThough I would support people posting questions on new posts, since knowledge doesn't hurt anyone, I never downvote a question thread, I like to see people trying to learn instead of going in heads first. Just don't think we should encourage a high-risk strategy to people who don't know what they're doing.", "score": 7, "replies": [{"body": "I don't disagree with you but I think trying to keep new traders away from here is a losing battle. \n\nPeople are attracted to this sub precisely because its risky, volatile, and has the potential for big rewards. It's like squirrel suit base jumping with money. People will try and do it when they shouldn't and telling them to \"go play on the trampoline\" won't help. I figure if we can keep a few people from smashing into the side of a mountain, maybe we should try. ", "score": 1, "replies": [{"body": "I believe they might end up getting scared off of investing after losing their $1,000 that they thought would multiply several times.\n\n", "score": 1, "replies": [{"body": "I'm more afraid that instead of being scared off, they see people on here and then double down only to lose more.\n\nA stupid questions thread isn't only a benefit to new traders, it gives everyone a place to ask things they otherwise wouldn't. Another good example of a sub that does this well is /r/churning with Moronic Monday. I would argue churning is another activity with decent risk attached that you shouldn't jump into without experience dealing with credit, but people are going to anyway so it's good to answer those questions. And those of us who have participated for a long time still sometimes run up on a basic question that we want to ask and it's nice to have a dedicated place to do it.", "score": 2, "replies": [{"body": "Fgt Fridays here?", "score": 3, "replies": []}]}]}]}, {"body": "But without new traders how will ever get the hero YOLOers who buy terrible options using students loans/credit card debt? Those guys are awesome. I wouldn't want to be them, but I do enjoy watching. ", "score": 1, "replies": []}]}, {"body": "Whats an option and how much do they weigh??", "score": 1, "replies": []}]}, {"body": "But when I draw Harambe onto a daily chart I'm being serious", "score": 3, "replies": []}, {"body": "Completely agreed, most of the time I'm browsing this sub I order by new to mitigate upvoted shitposts.", "score": 3, "replies": []}, {"body": "No. Fuck no. You know why? \n\nSomeone posts some goddamn awful biotech crystal ball penny stock \"DD\" or some bullshit reading the tea leaves technical analysis and marks it serious, there's no way in hell I'm limiting my scathing reprisal of their idiocy to something serious and insightful.\n\nIn short, this is a fucking terrible idea and you should feel ashamed for having mentioned it. ", "score": 9, "replies": [{"body": "Lmfao, someone posts a DD, so what? No one is forcing no one to follow the DD, to each their own. Whatever you do with your money is your fault, not the person who posted the DD's fault.\n\nThe sole fact that you brought this up shows me how seriously I should take you.", "score": 0, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "wow rude\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}, {"body": "Delete the inevitable suicide comment at the top of every \"what are your moves tomorrow\" thread. Shit gets old, we get it already. ", "score": 6, "replies": [{"body": "I need that post at the beginning of every day to remind me that someone managed to lose more money than me. Don't take that away. ", "score": 6, "replies": []}]}, {"body": "Thirded ", "score": 2, "replies": []}, {"body": "We tried that one time. Then the whole CSS was changed to SERIOUS\n\n\nhttps://www.reddit.com/r/wallstreetbets/comments/3beqn5/serious_tag/", "score": 2, "replies": []}, {"body": "suck mai deek", "score": 2, "replies": []}, {"body": "You want 17% of the equity, for a blow job. Invest your asshole first. Someone has some daddy issues. ", "score": 2, "replies": []}, {"body": "What about seriously dank memes?", "score": 2, "replies": []}, {"body": "Asking tards to self-regulate...", "score": 2, "replies": []}, {"body": "g f y ", "score": 2, "replies": []}, {"body": "Or go to /r/seriouswallstreetbets", "score": 4, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "wow rude\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "wow rude\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": [{"body": "shut up faggot", "score": -1, "replies": []}]}]}]}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "wow rude\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "wow rude\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "wow rude\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}, {"body": "WSB is already great. ", "score": 1, "replies": []}, {"body": "please hover over the baby on the top.", "score": 1, "replies": []}, {"body": "Here's the thing. You said a \"mountain lion is a lion.\" Is it in the same family? Yes. No one's arguing that. As someone who is a scientist who studies lions, I am telling you, specifically, in science, no one calls mountain lions \"lions\". If you want to be \"specific\" like you said, then you shouldn't either. They're not the same thing. If you're saying lion family\" you're referring to the taxonomic grouping of Felidae, which includes things from house cats to ocelots to tigers. So your reasoning for calling a mountain lion a lion is because random people \"call the big ones lions?\" Let's get panthers and leopards in there, then, too. Also, calling someone a human or an ape? It's not one or the other, that's not how taxonomy works. They're both. A mountain lion is a mountain lion and a member of the lion family. But that's not what you said. You said a mountain lion is a lion, which is not true unless you're okay with calling all members of the lion family lions, which means you'd call house cats, tigers, and other cats lions, too. Which you said you don't. It's okay to just admit you're wrong, you know?", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "wow rude\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "I left because it turned into all memes... \n", "score": 1, "replies": []}, {"body": "Fuck you faggit ", "score": 1, "replies": []}, {"body": "Agreed!", "score": 1, "replies": []}, {"body": "The reason this place isn't a shithole like /r/investing is because it doesn't take itself too seriously.\n\nChange that formula and this place will be scrub nation before you can invest in AMD.", "score": 1, "replies": []}, {"body": "I proposed this last week, you hoe. ", "score": 1, "replies": []}, {"body": "People who want a serious discussion should check out r/wallstreetdd", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "wow rude\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Fuk me pls", "score": 1, "replies": []}, {"body": "I had so many thing written out as to why this is bad but really just fucking leave if you dont like it how it is", "score": 1, "replies": []}, {"body": "I usually check this sub occasionally but am not subbed (yet?)\n\nYou could also create a sister sub for serious posts.", "score": 1, "replies": []}, {"body": "Shut up", "score": -4, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "This is a \"Democratic Community\" that upvoted this suggestion to #1 on the subreddit. ", "score": 3, "replies": []}]}, {"body": "ban this fag", "score": 0, "replies": []}, {"body": "Yea this already exists, it's called a shitpost flair. 💩💩💩. Y'all all a bunch of retards. ", "score": -2, "replies": []}, {"body": "At no point in posting this piece of garbage did u ever even slightly think it would work? If so, you're in the right place. Keep up the good stuff fgt!", "score": 0, "replies": []}, {"body": "Fuck that. Go to a different some for that faggo soda", "score": -5, "replies": []}]}
