{"title": "If someone had enough money to buy a bigger portion of Tesla (than Elon’s 17%), could they effectively take over the company?", "selftext": "What would be the negative consequences to Elon?  Could they call shareholder meetings and make serious decisions?  I’m thinking in a way that somebody would maliciously do this to sabotage Elon, like if a country government bought majority shares (very hypothetical situation haha).", "id": "r8079p", "created_utc": 1638541399.0, "score": 19, "upvote_ratio": 0.68, "num_comments": 64, "comments": [{"body": "Owning 17% of shares means you own 17% of the company. All major shareholders get to vote on actions they want to see the company take, and at 17% you would not have anywhere near the voting power to take over the company. You would need to own at least 51% of the company's stocks in order to control it.", "score": 21, "replies": [{"body": "So only 510 billion, not bad!", "score": 10, "replies": []}, {"body": "That assumes the 17% of shares  available as float even have voting rights. \n\nFor a lot of businesses voting class shares aren't traded. Or all shares have voting rights, but preferred shares aren't publicly traded and have 500 votes each, while each public share has 1/10 of 1 vote.", "score": 4, "replies": []}, {"body": "20-50% is considered significant influence which is “control”. Or at least that’s according to the equity method of accounting for investments in subsidiaries.", "score": 1, "replies": [{"body": "This.", "score": 1, "replies": []}]}, {"body": "Significant influence is classified as 20-50%.", "score": 0, "replies": []}, {"body": "Significant influence is classified as 20-50%", "score": 0, "replies": []}]}, {"body": "the guy wouldn't be able to make any call as he won't be CEO.\n\nHe will be able to go to voting and make a fuss with more 17% of the vote\n\nbut if the majority of others ppl vote like elon they will still win", "score": 45, "replies": []}, {"body": "I doubt you can just buy 17% of Tesla", "score": 50, "replies": [{"body": "Well not with THAT attitude.", "score": 128, "replies": [{"body": "Lol", "score": 5, "replies": []}, {"body": "Exactly. We're all just temporarily inconvenienced millionaires, lol.", "score": 2, "replies": []}]}, {"body": "Wait you guys don't have $170 billion lying around?", "score": 18, "replies": [{"body": "I just spent it on a salad today. Inflation is getting pretty real atm", "score": 22, "replies": []}, {"body": "The share price will go way up before you manage to spend all of that. And there will be people buying before you hoping to sell to you for even higher prices. And you have to make an official statement months in advance if you want more than 10% of any company. And possibly can't back out afterwards.", "score": 3, "replies": []}, {"body": "Berkshire has $150 billion in cash.", "score": 2, "replies": [{"body": "Lets pol all of us 50k each then will have enough money to buy the majority of stake.", "score": 1, "replies": []}]}, {"body": "Do you accept Zimbabwean dollars?", "score": 2, "replies": []}]}, {"body": "Why?", "score": 2, "replies": [{"body": "First of all that’s a lot of moneys maybe not for you but for some of us it is. There are probably not enough people that want to sell a total of 17% of the total shares.buying this many shares I think you need to make a deal with the company I don’t think you can just buy that at the open markeg", "score": 7, "replies": [{"body": "You also have to make a public filing with the sec, a declaration of intent, when you want to buy more than 10% of a company. And the more you keep buying the higher the price will go. You can't just buy all 10% at current price. And people will know you're buying, so they'll hurry to buy the cheaper shares before you and resell to you for even more.", "score": 7, "replies": [{"body": "I didn’t know that, but I was thinking something like that yeah. Thanks for the explanation", "score": 1, "replies": []}]}, {"body": ">First of all that’s a lot of moneys maybe not for you but for some of us it is.\n\nLol that's a lot of money for every individual on the planet!", "score": 1, "replies": [{"body": "Yeah that was the joke", "score": 1, "replies": []}]}]}, {"body": "Uh....because that would make you a corporate raider engaging in a hostile takeover? \n\nWith TSLA (fucking stupid, especially when you consider a shareholder base that often times behaves/trades irrationally...)\n\nSeriously, how the fuck is this even a question. Google T. Boone Pickens, Carl Icahn, Ron Perelman, or any other notable activist investor from the last ~40 years....", "score": 0, "replies": []}]}]}, {"body": "51% majority shareholder , comes with perks.", "score": 10, "replies": [{"body": "Great parking and you may pick your own keyboard at work?", "score": 7, "replies": [{"body": "You get a stapler too.", "score": 3, "replies": [{"body": "A red one?", "score": 1, "replies": []}]}]}]}, {"body": "To take over the company you would need to control the board of directors.  To do this you would need to control more than half of the board seats.  This would require you (or other people who you convince to vote with you) to elect favorable board members to your position which means you (and your fellow voters) would have to own more than 50% of the voting shares of the stock.  Elon controls Tesla not because he owns 18% of the company but because he has the approval of the board of directors.  If they chose to replace him, they could and there is nothing his 17% of the company could do about it.  By the same token there is nothing you could do to influence the board with less than half of the voting shares.  The board of directors are elected by share holders and have staggered terms similar to senators so that the entire board is not replaced at once.  Often if you have a big enough stake in the company they will give you a board seat but you would still need to get the other members of the board to vote with you.", "score": 9, "replies": []}, {"body": "Are there enough shares for that? How many shareholders would you have to buy out to make that happen? At some point, would you need board members’ shares who would refuse to sell to protect their stake and that of Elon’s?", "score": 4, "replies": [{"body": "> How many shareholders would you have to buy out to make that happen? \n\n17% of them.", "score": 3, "replies": [{"body": "Who are you, who is so wise in ways of science?", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 11, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": []}]}]}, {"body": "...welcome to stocks :)\n\nu dont take over the company by just having the highest % \n\nif u had 18% and elon had 17% but he get other people to vote like he wants he still win\n\nu need higher then 50%.", "score": 3, "replies": [{"body": "Yeah I was really thinking the 51% scenario haha", "score": 1, "replies": []}]}, {"body": "I dont know the first thing about buying majority share of a company but I would assume unless the shareholder stated they wanted power over the company prior to purchase if the stock, Elon would remain in control, and even if they did state they would pay X amount of money for X amount of shares over the company if given control over such decisions, Elon would most likely turn them down and deny such request. Again I do not know, all of this is based on my own thought not any factual information", "score": 2, "replies": [{"body": "Elon would remain in control as he is the CEO but the board of directors could replace him at any time.  If you acquired enough voting shares that you could elect your own board members (including yourself) you could then replace him as CEO.  Some companies are one share one vote while others have different classes of stock where certain classes have more votes than others so you need to own more than 50% of the voting shares.  An example of this is Alphabet where they created GOOG and GOOGL one with voting rights and one without so that the insiders could sell some of their shares without giving up voting rights. Berkshire Hathaway is another company where class A shares have more votes than Class B.", "score": 2, "replies": []}]}, {"body": "No. You need to own enough common stock to override 50% of the vote.", "score": 2, "replies": []}, {"body": "Reddit needs to come together and buy Tesla", "score": 1, "replies": []}, {"body": "Even if you control the majority shares, it’s not like the movies where you can have a hostile takeover and do what ever you want with the company.\n\nJust because you have the majority vote doesn’t mean you can do things obviously bad for the companys well being", "score": 1, "replies": []}, {"body": "Jesus Christ, the lack of historical finance knowledge on this sub is fucking baffling sometimes.\n\nOP - if you did this, you're engaging in a hostile takeover. Eventually you'd have to file a Form 3 or Form 4, TSLA treasury, IR, and entire C-Suite would recognize it as a third party building a block of shares to force a proxy vote, and, understandably, gather an army of lawyers and bankers to formulate a defense (while also deploying a ton of defensive measures to ensure you fail)\n\n[Seriously, 5 minutes of googling would have answered this Corporate Finance 101 Day 1 question...](https://corporatefinanceinstitute.com/resources/knowledge/deals/hostile-takeover/)", "score": 1, "replies": [{"body": "This what I’m looking for, I don’t really know anything outside basics- so essentially could TSLA prevent it from happening if they wanted?", "score": 2, "replies": []}]}, {"body": "In that case, I think Elon is happy to sell high, cash out and start another company to do what he want", "score": 0, "replies": []}, {"body": "Price would easily double before you can buy 17% of their shares. It would be insanely expensive to do this. But theoretically, yes someone could do it.", "score": 1, "replies": []}, {"body": "Sometimes founders have super voting power shares, so they may own 5% but have the voting power of 51%", "score": 1, "replies": [{"body": "Which maybe Elon has? Bc I heard him say regarding his board monitoring his tweets, that if they ever did it he could call a shareholder meeting and override essentially", "score": 1, "replies": []}]}, {"body": "To get control of Tesla, you would need 50.1% of the stock. That’s going to cost well over $ 500 BILLION. You might think that you need only 17.1% of the stock, but you also need a whole bunch of other stockholders on your side. That’s not going to happen, because so many of them love Elon.", "score": 1, "replies": []}, {"body": "In addition to what other people have said, keep in mind that owning 10% of a big publicly traded company like this puts you under regulatory scrutiny and you have to declare your trades. Gonna to be hard to amass 17% when people are publicly reporting on your moves.", "score": 1, "replies": []}, {"body": "Succession says nah, probably won't happen", "score": 1, "replies": []}, {"body": "Oh the Elon may be the victim of a plot post. \"The guy made sacrifices and become a multi billionaire for our sins....\"", "score": 1, "replies": [{"body": "You reading too into it m8, I’m just curious about how much control you can keep over your own company after going private", "score": 1, "replies": [{"body": "My bad. Honestly happy to delete the comment if you like.", "score": 1, "replies": [{"body": "Haha no worries m8! Hard to convey tone over the internet", "score": 2, "replies": []}]}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "r87cin", "created_utc": 1638560598.0, "score": 87, "upvote_ratio": 0.94, "num_comments": 65, "comments": [{"body": "The saying goes, \"stocks take the stairs up, and the elevator down\"", "score": 61, "replies": [{"body": "Docusign is definitely not using an elevator. \n\nThis could be sky diving", "score": 57, "replies": [{"body": "It has another 120 points to go imho", "score": 1, "replies": []}, {"body": "Twitter and Docusign are two reasons I would stay away from that fund for a while", "score": 1, "replies": []}]}, {"body": "mine is more of jumping off a window.", "score": 8, "replies": []}, {"body": "Gravity working against high flyers", "score": 2, "replies": []}, {"body": "Lmaoooo that made me laugg", "score": 2, "replies": []}]}, {"body": "This sub used to bow to her when her picks were up…", "score": 67, "replies": [{"body": "How the turn tables something something…", "score": 14, "replies": [{"body": "Fickle as the wind!", "score": 1, "replies": []}]}]}, {"body": "My portfolio is down 6% today. I’m also in a bear market. It’s been a shocking month", "score": 53, "replies": [{"body": "Atleast you are beating Cathy Wood. Oh wait. No. Hold on.  I just hit refresh. Even she is beating you.", "score": 25, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "50% of my portfolio is SOFI.  That doesn’t help", "score": 4, "replies": []}, {"body": "You get used to it.", "score": 1, "replies": []}]}]}, {"body": "So what? I am not invested in her funds nor pick her stocks but so what?\n\nShe invests in those companies for the years to come, not for the next 5 minutes. In a few years her stock picks can be judged.", "score": 30, "replies": [{"body": "Exactly... why would anyone care about the weekly performance of a fund?? Not defending ark, just think it's a silly idea to evaluate on a weekly basis", "score": 11, "replies": [{"body": "Because when it loses 12% in a week it takes a hell of a lot more to just break even. Not everything is guaranteed to go up over time so naturally it is worrisome.", "score": 14, "replies": [{"body": "Absolutely and with ark that is a legitimate concern. I'd be scared of a 12% decline from them as well, but that's because I don't agree with their strategy. For that reason I do not hold their fund .\n\nI guess my mentality is that I wouldn't invest in a fund that I think needs weekly monitoring. Although I'm probably much more conservative than your average ark investor...", "score": 3, "replies": []}]}, {"body": "The fund has been severely under performing the index all year. She’s like 40% down compared to the index, which is up.", "score": 1, "replies": []}]}]}, {"body": "Whats trimble", "score": 7, "replies": [{"body": "Gps, spacial orientation, autonomous construction, surveying and cad / construction management", "score": 7, "replies": []}, {"body": "A conglomerate with a ton of subsidiaries.  Huge company as far as the places it has its tentacles.  Owns multiple ERPs.", "score": 5, "replies": []}, {"body": "Whats a 5 second Google search", "score": 1, "replies": []}]}, {"body": "They are very disappointing. Even the Tesla price jump few months ago didn’t help them much.", "score": 3, "replies": []}, {"body": "Still better than mine. All are already in Great Depression.", "score": 3, "replies": []}, {"body": "I know one thing, everyone will use the excuse-she is on a 5+ year time horizon.  Meanwhile, that could be used in any case where someone is doing poorly at picking stocks.", "score": 4, "replies": []}, {"body": "I think everyone is in red right now", "score": 5, "replies": []}, {"body": "She had an amazing 2020. Usually the year after a blowout year a fund underperforms. She hasn't adjusted her strategy. She has a vision. Whether it pays off is hard to know but if you're DCAing into the fund it might pay off long term.", "score": 4, "replies": []}, {"body": "Considering how insignificant ARK funds are in the grand scheme of things, they sure are talked about a lot on this subreddit huh", "score": 8, "replies": []}, {"body": "What could possibly go wrong with buying speculative high valuation tech stocks at their all time highs?  /s", "score": 9, "replies": []}, {"body": "I got out of Ark just in the nick of time a few weeks ago. I think the environment going forward will not support the appreciation of these high flying growth stocks. If you are still sticking with her then good luck.", "score": 3, "replies": [{"body": "I sold 1,129 shares of arkf at a 6k loss on November 10-11.  If I didn’t do that I’d be at 18k loss today.  Guess I made the correct decision", "score": 6, "replies": []}]}, {"body": "The most important point is still dismissed. If Tesla - IF - one day returns to fundamental values it’s good night night. Think about where ARKK would be if Tesla didn’t go rampage the last 12 months", "score": 5, "replies": [{"body": "Cathie sold TSLA today to buy DOCU an ZM. She gonna fly ARKK into the ground.", "score": 4, "replies": []}]}, {"body": "Wasn't Tesla in a bear market like 2 weeks ago.", "score": 4, "replies": []}, {"body": "She will either become the greatest stock picker or the worst. Time will tell. I’m hating my decision to trust her currently.", "score": 4, "replies": [{"body": "She has no risk management. If there's a down turn, she's becoming the next Janus Funds. Funds that basically were the ARK of the dotcom bubble and then collapsed utterly in the dotcom bust.", "score": 1, "replies": []}]}, {"body": "I’ve been in Trimble since the crash in 2020. I use their equipment every day. They’ll be at Tesla levels and beyond in a few years", "score": 2, "replies": []}, {"body": "So your saying my Trimble position is going to tank hard on Monday now?\n\nSweeet", "score": 2, "replies": []}, {"body": "All the ARKtards who decided to ride or die with Cathie deserve what they get. There are no messiahs or seers in the stock market. Protect yourself and admit when you are wrong.", "score": 2, "replies": []}, {"body": "Fund performance fluctuates a lot. At this point in time with inflation worries, high growth and high multiple stocks cannot perform as well as dividend payers.\n\nExample: TDOC, not gonna be profitable until 5 years from now, goes down now. Walmart, well established defensive stock that pays a steady dividend, goes up.", "score": 3, "replies": [{"body": "vast domineering fuzzy square fearless whistle panicky lock rustic murky\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 7, "replies": []}, {"body": "What about deflation?\n\nWhat about productivity?\n\nWhat about supply chain issues", "score": -1, "replies": []}]}, {"body": "Shocker", "score": 2, "replies": []}, {"body": "800 shares and adding", "score": 2, "replies": []}, {"body": "Tesla is here highest conviction so this means she is not a flash in the pan.  Her top pick is performing the BEST!", "score": 0, "replies": []}, {"body": "Who?", "score": -1, "replies": []}, {"body": "Who?", "score": -1, "replies": []}, {"body": "I feel like she is like a one trick pony", "score": 1, "replies": []}, {"body": "As somebody in the same space Trimble is, trust me it will go down eventually too", "score": 1, "replies": []}, {"body": "“But, God has a plan” - Cathie probably", "score": 1, "replies": []}, {"body": "Why does everyone care so much about Cathie Wood?", "score": 1, "replies": []}]}
{"title": "Here is a Market Recap for today Friday, December 3, 2021. Please enjoy!", "selftext": "**PsychoMarket Recap - Friday, December 3, 2021**\n\nStocks sank today to end the week lower, with technology and growth stocks cratering as market participants digested further updates regarding the Omicron variant and recent marks made by Fed Chair Jerome Powell, alongside the Labor Department’s November jobs report. The S&P 500 (SPY) closed the week -1.2% lower, the tech-heavy Nasdaq (QQQ) slid -2.6% and the Dow Jones (DIA) fell -1.83%. The Russell 2000 (IWM), which tracks the performance of small-caps, closed the week a whopping -5.24% lower. \n\n**Notable Numbers Today**\n\n* S&P 500 (SPY): -0.87%\n* Nasdaq (QQQ): -1.74%\n* Dow Jones (DIA): -0.11%\n* Russell 2000 (IWM): -2.05%\n* VIX: +8.71%\n* NVIDIA: -4.46%\n* Tesla (TSLA): -6.42%\n* DocuSign (DOCU): -42.22%\n* Asana (ASAN): -26.40%\n* Marvell Tech (MRVL): +17.70%\n\nDevelopment surrounding the new Omicron variant remains front and center of the market’s attention. So far, at least five US states have reported at least one case of the variant and over three dozen countries globally. A new report by the World Health Organization (WHO) has so far seen “a suggestion that there is increased transmissibility” of the Omicron variant. However, the report notes that it is still too soon and not enough data is available to make any conclusions yet. \n\nVaccine makers released new, less optimistic commentary regarding how effective existing vaccines are against the new Omicron variant. Moderna CEO Stephane Bancel said their current vaccine would likely see a “material drop” in effectiveness against the Omicron variant. \n\nHe said, “There is no world, I think, where \\[the effectiveness\\] is the same level we had with \\[the\\] Delta \\[variant\\]. I think it’s going to be a material drop. I just don’t know how much because we need to wait for the data. But all the scientists I’ve talked to . . . are like, ‘This is not going to be good’.”\n\n[https://www.ft.com/content/27def1b9-b9c8-47a5-8e06-72e432e0838f](https://www.ft.com/content/27def1b9-b9c8-47a5-8e06-72e432e0838f)\n\nMoreover, the market move today coincides with the release of the Labor Department’s November job report, which showed a disappointing hiring rate even as the unemployment rate fell to a fresh pandemic-era low. Here are the numbers\n\n* Payroll Gains: +210,000 vs +550,000 expected\n* Unemployment Rate: 4.2% vs 4.6% in October\n\nJim Smiegiel, Chief Investment Officer at SEI Investments, said “The markets ... have been pricing in, really, a worst-case scenario. I think the market is now switching gears a little bit and perhaps lessening the intensity of the potential for negative outcomes. The big issue still remains more about the world government's reaction to the variant and what that means from a lockdown perspective. And that's what the market is still kind of struggling with at this stage.\" \n\nJ. Pow’s latest remarks before the Senate Banking Committee further spooked the markets, after he said he would back off from using the word “transitory” to describe rising inflation. This is very notable because the Central bank has been using the T-word since the beginning of the year, when it warned that steep differences in year-over-year comparisons and supply-chain bottlenecks would lead to elevated inflation. \n\nPowell said, ““We tend to use \\[the word transitory\\] to mean that it won’t leave a permanent mark in the form of higher inflation. I think it’s probably a good time to retire that word and try to explain more clearly what we mean.”\n\nMoreover, Powell suggested the Central Bank was considering completing its asset purchase taper “a few months sooner” than previously telegraphed. Market participants expected a more supportive stance, especially with the new COVID variant, but instead Powell suggested his priority was now on curbing higher than expected inflation. \n\nCharlie Ripley, senior investment strategist at Allianz Investment, said “Chairman Powell’s commentary course-corrected the view on inflation and the potential need for quicker policy adjustment. The reality is hotter inflation coupled with a strong economic backdrop could end the Fed’s bond-buying program as early as the first quarter of next year. Ultimately, the transitory view on inflation has officially come to an end as Powell’s comments reinforced the notion that elevated prices are likely to persist well into next year. With potential changes in policy on the horizon, market participants should expect additional market volatility in this uncharted territory.\" \n\nOn a personal note, I am taking this opportunity to do some very small dip-buying (no more than ¼ position). As usual, I believe the market is overreacting (as it tends to do). While it is important to acknowledge the risks present in the market and be prepared to act if they arise, I personally believe Omicron fears are overblown (I remember we had the same song and dance when Delta was first discovered). More concerning is the Fed’s change in attitude towards inflation. That said, the only thing discussed so far has been accelerating the timeline for tapering asset purchases. As I have said for months at this point, I am not worried about tapering. If/when the Fed begins discussing raising interest rates, then I will step back and reassess. \n\n**Highlights**\n\n* Shares of DocuSign (DOCU) cratered more than 40% after posting disappointing earnings and lowering guidance. Like Zoom (ZM), Teladoc (TDOC), and Peloton (PTON) before, this is the latest COVID stock to crater in value. \n* Shares of Chinese ride-hailing company DIDI gapped down once again after announcing plans to delist from the New York Stock Exchange amid regulatory pressures from the Chinese government. This is one of the most spectacular IPO failures I have ever seen and probably just the beginning. I’m glad I divested all my shares in Chinese companies, I wouldn’t trust a single dollar of mine in that environment. At this point, I’m expecting Alibaba (BABA) to delist at some point. \n* As a reminder, a lot of times, when you buy Chinese stock, you aren’t really buying a share of the company, usually you are being what is called an American Depositary Receipt, which is basically just a contract representing a number of shares, not an actual piece of the company\n* The Federal Trade Commission sued NVIDIA (NDA) to block the proposed $40 billion acquisition of Arm. Unfortunately, it doesn’t look like the deal will go through given all the regulatory backlash in both the US, UK and EU. Sad for me, NVIDIA is my favorite stock in the market. \n* Ford Motor (F) expects to be the world's second largest electric vehicle manufacturer within two years, with annual production capacity of nearly 600,000, according to Lisa Drake, the Chief Operating Officer. \n* Shares of sport-betting company DraftKings (DKNG) sank to 52-week lows, losing more than 50% of its value in the last three months. Penn National Gaming (PENN) is following a similar trend. \n* Cathie Wood’s flagship Ark Innovation ETF (ARKK) hit a 52-week low today, after falling 25% in the month amid the broad tech-selloff. \n* Shares of Grab (GRAB), the largest ride-hailing and digital payment solution in Southeast Asia, failed spectacularly in its first day of trading following the largest ever merger, which valued the company at over $40 billion. Has not been a good week for foreign stocks.  \n* Qualcomm (QCOM) on Wednesday released a new chip designed for gaming-specific handheld devices offering 5G connectivity, a potential new mobile platform for video gamers offering more flexibility to play streaming games on the go. QCOM said it partnered with hardware company Razer to create an initial test device for gamers.\n\n“The greatest glory in living lies not in never falling, but in rising every time we fall.” *-Nelson Mandela*", "id": "r8as26", "created_utc": 1638570834.0, "score": 89, "upvote_ratio": 0.91, "num_comments": 59, "comments": [{"body": "I did not have a good time today.", "score": 40, "replies": [{"body": "But the last ten minutes made it less worse.", "score": 16, "replies": [{"body": "Not much consolation", "score": 7, "replies": [{"body": "Yeah, it felt like being caressed fondly after getting raped", "score": 5, "replies": []}]}, {"body": "That was happening the other days too. For me this is the indicator that it is not real sell-off, but rather someone trying to push the market by selling on the margin and than having to close position by the EOD.", "score": -2, "replies": [{"body": "How does selling increase prices?", "score": 1, "replies": [{"body": "What I meant was that the prices dropping are due to someone selling on a margin (either not have the shares, but borrow to sell, or borrow the cash). It works during the day, the prices drop down. But right before EOD they have to close short positions, that's why there are green candles right before the market closes.", "score": 1, "replies": []}]}]}]}]}, {"body": "Today should be the lesson on how investing into aggressive growth single stock with little revenue/profit can be devastating. Bloodbath on a lot of my friends and relatives account while my account with 90% VOO as the core position barely dip YTD and even unnoticeable when looking at 5 years chart.", "score": 19, "replies": [{"body": "This is a great lesson to draw. As I'm sure you've seen on Reddit before, I see a lot of people whose accounts are heavily (in some cases entirely) invested in high growth names\n\nWhile they should be part of a portfolio, unless youre extremely confident in stock picking ability, atleast 60-80% of a portfolio should be invested in low-cost safe ETFs IMO\n\nGreat job my friend", "score": 4, "replies": [{"body": "One year ago Cathie Wood ARK was the new paradigm. Anybody could post any very convincing “due diligence” on any ticker. Things take time to unwind.", "score": 5, "replies": []}]}, {"body": "VOO for my tax deferred accounts, stock picks for my taxable.  It’s my “lady on the streets, freak in the sheets” plan.  I may not go to the moon now, but I’ll retire in the stars.", "score": 2, "replies": [{"body": "YGG!", "score": 1, "replies": []}]}]}, {"body": "Is the guy on the image you, OP? Matches well with your content.", "score": 7, "replies": [{"body": "Dont know what image you are referring to, but the answer is no\n\nEdit: Oh I see what image yoy are referring to hahah. That's Stephane Bancel, the CEO of Moderna. Image showed up because of the article I linked", "score": 4, "replies": [{"body": "Lmao all your posts have an image of a guy with his arms crossed at the top of the post, I always assumed it was you", "score": 7, "replies": [{"body": "It's not again, the image is related to the link I posted. Since I linked to an article about Moderna, the CEO Stephane Bancel is the one featured in the image.\n\nAlso, why do you say \"all my posts\"? That blatantly untrue since the image is related to the link", "score": 1, "replies": [{"body": "Yeah you’re right, definitely not all of them, but I kept seeing him the thumbnail for some of the posts. For example he is also in your nov 30 one. And probably a lot more lol. \n\nSorry for the misunderstanding and thank you for today’s post", "score": 4, "replies": []}]}]}]}]}, {"body": "Don't worry -- December can't get any worse, right?  What was Peter Lynch's rule -- it can only go so low?", "score": 4, "replies": []}, {"body": "Since I am a new investor, I am wondering, what will you reassess if they also speed up the timetable on the interest increases? Exiting stocks with high debt?", "score": 5, "replies": [{"body": "Yes , stocks with hight debt and low Current ratio are risky", "score": 1, "replies": [{"body": "Isn't lower current ratio better?", "score": 1, "replies": [{"body": "Current assets/current liabilities \n\nOf course you want the top number higher \n\n\nWhat is a good current ratio?\n\nIn general, a good current ratio is anything over 1, with 1.5 to 2 being the ideal. If this is the case, the company has more than enough cash to meet its liabilities while using its capital effectively", "score": 2, "replies": [{"body": "Ah, I was sure that it is the other way around, I thought it was current liabilities / current assets. It makes sense now.  \nThank you.", "score": 1, "replies": [{"body": "Good luck!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "IWM doesn't reflect the hundreds of small caps that are up double and triple digits in my list .\n\nOn the other hand I was down 10% yesterday and IWM maybe 2%", "score": 1, "replies": []}]}, {"body": "Is Docusign a Cathie Wood stock by any chance? I don't know the stock, but the percentage looks similar to many of the Cathie Wood stocks in my portfolio.", "score": 3, "replies": [{"body": "From what I found, DOCU is the 29th biggest holding in ARKW. I dont really follow her funds closely, Im sure someone else here is more knowledgeable \n\nhttps://ark-funds.com/wp-content/uploads/funds-etf-pdf/ARKW-holdings-1635453724-1005095528341971484.pdf", "score": 2, "replies": []}]}, {"body": "You know what's frustrating?\n\nknowing that the market is crazy fucking high, but not knowing when to short it because you could get squeezed out.\n\nfuck this market.\n\nfor example I was shorting AMD, and finally some of my shorted shares are in the money again.\n\nAnyone knows AMD went up too high too soon. AMD $165 now??\n\nAAPL $170? gimme a break. \n\nI had SPY puts from $458, and they finally turned green, but I can't even hold that shit long enough because all the fuckers keep buying the dip, despite everything being overpriced.\n\nand then they try to trap the bulls and pull the rug the next day", "score": 4, "replies": [{"body": "ooof you must be looking at stocks too much", "score": 3, "replies": []}, {"body": "Give it another week or two. I've been holding onto 130$ AMD puts currently in the red.... Seems like they might go green the next couple weeks...", "score": 2, "replies": []}, {"body": "Personally, I dont short, I dont see how fighting a trend is productive. I find it way more practical to ride a trend but be prepared in case of a downfall\n\nSorry you feel frustrated, but that sort of comes along with being a contrarian trader. Goes without saying, the market can stay irrational (if you believe that is what is happening) for an unpredictable amount of time, I personally see no benefit in shorting the entire market. Timing that is just way too difficult\n\nApart from daytrading, Ive never been short a stock or the market and it's worked wonders for me for years", "score": 2, "replies": []}]}, {"body": "Nice write up. Concerning BABA, if your still holding ADR shares and it delist I read somewhere they get converted over to actual Chinese shares at a 1/8 ratio. Can anyone confirm?  I’ve heard both sides now.", "score": 2, "replies": [{"body": "I've never heard that before but Im not an expert so do not take my word for it, I really dont know.", "score": 4, "replies": [{"body": "What is your option on EM etfs such as VWO or AVES? Are they creating units based on ADRs?", "score": 2, "replies": [{"body": "I really don't know regarding ADRs, again Im not an expert, im sure somehow in this subreddit knows better than me.\n\nAll I will say is China is usually the biggsst holding in emerging market ETFs", "score": 3, "replies": []}]}]}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "I think Covid is just the scapegoat.    Next year, for the high earner, long term capital gain tax rate is the same as short term gain.   Anyone with half a brain (and the high earners do) would cash out his/her profit now.   Google and you will see that many CEOs do.", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "That tax change isn't gonna pass.\n\nA lot of people will, just in case, cash out now in order to pay the current rate because it *might* pass.", "score": 1, "replies": [{"body": "What make you think so?  With the rob the rich culture, I am certain that mega back door and long term capital gain lower tax rate are going the way of the dodo bird.   The unknown is at what level the new rate is going into effect.", "score": 1, "replies": []}]}]}, {"body": "omicron definitely feels like a scapegoat.\n\ncovid was never even that serious for 99% of people.\n\n&#x200B;\n\nnow with long term capital gains being the same rate as short term.... why even invest at all? just swing trade short term all day everyday", "score": -2, "replies": []}, {"body": "And some states also have massive tax increases that start Jan 1. Here in Washington we have a new income tax that is an infinite percentage increase. It’s going from 0% to 7% to punish us.", "score": 1, "replies": []}]}]}, {"body": "Thank you so much, hope your day has been a good one my friend, cheers.", "score": 1, "replies": []}, {"body": "I have been eyeing and patiently waiting as small caps bleed. I think sometime this month the pain will stop and the reversal back into these stocks will begin. I believe the market already began the worse case scenario for intrest rate hikes next year with these small caps getting hit very hard.", "score": 1, "replies": []}, {"body": "I got screwed again today.", "score": 1, "replies": []}, {"body": "Ford going to GM way of misleading investors. How can somebody take these statements seriously?", "score": 1, "replies": []}, {"body": "No mention of the NFP numbers that got smashed in the am?", "score": 1, "replies": []}, {"body": "Your posts are amazing, I always read them later on the day or day after. Keep up the great work 😄", "score": 1, "replies": []}]}
