{"title": "Good ticker to wheel at the moment?", "selftext": " i.e. buying the underlying and selling weeklies immediately.\n\nLooking for something that won't realisticly crash (e.g. Amazon), and with good volatility for premiums.\n\nIdeas?", "id": "rr7t6s", "created_utc": 1640783274.0, "score": 12, "upvote_ratio": 0.68, "num_comments": 60, "comments": [{"body": "BRK.A", "score": 50, "replies": [{"body": "I couldn’t imagine the premium on that if BRK.A had options", "score": 5, "replies": []}, {"body": "This is the answer I came to see", "score": 10, "replies": []}, {"body": "Beat me to it.", "score": 2, "replies": []}, {"body": "This is the way", "score": 3, "replies": []}]}, {"body": "SOFI and CLF have good volatility premiums compared to something like F. But then again, they might realistically crash, but might be worth looking into.", "score": 14, "replies": [{"body": "SOFI looks low af now tbh", "score": 9, "replies": [{"body": "Very tempted to double down on my LEAPS", "score": 8, "replies": []}]}, {"body": "CLF is a printer", "score": 5, "replies": []}]}, {"body": "You realize why a stock has volatility?", "score": 24, "replies": [{"body": "Because...free money?\n\n\nYeah, that doesn't sound right...", "score": 9, "replies": []}]}, {"body": "UPRO to eliminate single stock risk.", "score": 6, "replies": []}, {"body": "PYPL has already crashed, I’m using it heavily right now", "score": 9, "replies": [{"body": "yeh, 190 seems to be strong support, IV is a bit crap though. will think about this, thanks.", "score": 1, "replies": [{"body": "It's a great opportunity to buy some LEAPs and do a PMCC", "score": 3, "replies": []}, {"body": "It has worked well for me, IV is moderate and almost certain to increase", "score": 2, "replies": []}]}]}, {"body": "SOXL", "score": 5, "replies": []}, {"body": "The cold, harsh reality is that stocks that are less likely to “crash” will almost always have lower premiums. Safer stocks are less volatile, and less volatility lowers the premium.", "score": 4, "replies": []}, {"body": "SPY, QQQ, and IWM….in that order.", "score": 4, "replies": []}, {"body": "I'm still a beginner, but my best pick lately has been DVN. Pays a nice dividend, has had enough variability in the price that I've had good luck selling near the money calls on up days and buying them back when the price is back down.", "score": 3, "replies": []}, {"body": "-High premiums\n\n-Non-volatile stock\n\nChoose one", "score": 3, "replies": []}, {"body": "$TELL. Best stock under $5. High IV. \n\nI’m supper Bullish on this stock so I don’t mind holding long term. LNG play. Europe is in a Natural Gas crisis and it won’t get better anytime soon.", "score": 3, "replies": []}, {"body": "Gotta say, small/mid caps have already crashed hard.  Sure it can go down more.  But who's actually left selling/shorting small/mid caps.  Especially if the company's fundamentals haven't changed.  So I would look at small/mid caps.  Large caps like AAPL, AMZN, GOOGLE, are at ATH right now, it's looking riskier to do CSP on them imo.", "score": 3, "replies": []}, {"body": "$SOFI looks like it can't go lower, and has nice IV for selling. \n\nStill, last time I said something looked like it couldn't drop further... well ...", "score": 5, "replies": []}, {"body": "Find a stock you like really long term, mines currently at this price is DKNG. I also do weeklies.", "score": 2, "replies": []}, {"body": "Apps took a beating recently, is not a meme, good fundamentals.", "score": 2, "replies": []}, {"body": "Naked weekly puts on AMZN, GOOG and NVDA.", "score": 2, "replies": []}, {"body": "TSLA and TSLA only", "score": 2, "replies": []}, {"body": "QS. Near lows, good premiums, affordable and lots of high hopes for the next couple years.", "score": 3, "replies": [{"body": "Near lows isn’t a good thing", "score": 5, "replies": [{"body": "It is if you believe in mean reversion", "score": 1, "replies": [{"body": "Mixing fundamentals with technicals ftw.", "score": 1, "replies": []}]}]}]}, {"body": "$PYPL or $AMD. It also depends on how far of strike your willing to sell at. $AMD swings a lot so premiums fluctuate heavily. $PYPL is more manageable. Just stick to the  rule of “if my assignment is above my cost basis let it go.”", "score": 3, "replies": []}, {"body": "Gme", "score": 2, "replies": []}, {"body": "RIVN", "score": 1, "replies": [{"body": "Good to short. I’ve made some beer money on CCS.", "score": 2, "replies": [{"body": "Sold ccs on earning week and got a bunch of puts with the premium. One of my better plays. Now that weekly premium is pretty great.", "score": 2, "replies": []}]}]}, {"body": "FUBO, PLTR, BABA, PTON\n\nAll getting smashed for various reasons but CSPs at 0.1ish delta seem good value for Jan monthlies.", "score": 0, "replies": [{"body": "This guy hates money", "score": 9, "replies": []}, {"body": "Fubo has killed me.", "score": 4, "replies": [{"body": "I'm about to be it's next victim.", "score": 1, "replies": []}]}, {"body": "Have you traded recently? Those tickers have been pummeled, with new floors every few months.", "score": 0, "replies": []}]}, {"body": "I CSPs on AMC, PENN, BKKT (pre crash). Got assigned just to go thru the process on PENN and selling calls on it now weekly.", "score": -4, "replies": [{"body": "yeh, these are what i consider as 'shit' stocks - i am avoiding to get assigned.", "score": 14, "replies": [{"body": "Premiums aren’t high on non shit stocks.", "score": 6, "replies": []}, {"body": "Yeah assignment not good. But the prems are juicy af. Collecting about 1% a week", "score": 2, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Lol yeah I was in the $22 strike when it dipped that low a few weeks back. All you have to do is roll up and out and you’ll be fine. No assignment and net the loss to close with another prem from a sell. Still have been very profitable with needing to roll up/out 3 different times on different stocks", "score": 1, "replies": []}, {"body": "I was selling $38-40 puts on that stock for a while and decided to stop. About two weeks later, it tanked to the $20's, and boy was I glad I dodged that bullet. I like the stock, but I run the wheel to grow my account in the short term; I want less volatile stocks to wheel.", "score": 1, "replies": []}]}]}]}]}, {"body": "I may be showing my noob status on this but I’m testing out a wheel strat with SQQQ alternating from the $6 CSP to eventually the $6.50 - $7 CC so even assignment is forward profit.", "score": -7, "replies": [{"body": "This is a bad idea for so many reasons", "score": 6, "replies": [{"body": "Why is that the case? It has semi-predictable price momvement in the short term with high volume weekly options.  Since I’m clearly missing something in my wheel strat on this, what did I overlook?", "score": 0, "replies": [{"body": "Wheeling is inherently bullish strat, sqqq is bear Nasdaq, if you don't mind owning sqqq you're assuming the market is declining long term", "score": 3, "replies": [{"body": "My initial plan was to use SQQQ as a market downturn hedge for my portfolio also the Qs tend to panic sell far easier than the S&P so I could also use SQQQ as a swing opportunity especially with three planned interest hikes and taper wrapping in 2022 currently planned.  I’m not overly bearish on the market just converting a hedge asset into a profit center.", "score": 0, "replies": [{"body": "If you're wheeling you're going to get obliterated until there is a downturn simply from the leverage fees and decay by itself, don't think sqqq is the ticker you need", "score": 2, "replies": []}]}]}]}]}, {"body": "You might also like KOLD. I made some good money on that using covered strangles.", "score": 1, "replies": []}, {"body": "SQQQ is inverse S&P + is a structurally decaying asset. If you're planning to use it for tail-risk hedging, which is what it sounds like, the wheel is not the right play. You're better off just long SQQQ or long VIX or something. If you understand the payoff of a short put then there's no reason you'd use it in a \"panic selling\" situation.", "score": 1, "replies": []}]}, {"body": "LCID, MARA", "score": -3, "replies": [{"body": "Tell me you've lost money without telling me you've lost money.", "score": 2, "replies": [{"body": "Lol struck a chord with those tickers. Check out NET, AMD, NVDA if you can afford it.", "score": 1, "replies": []}]}]}, {"body": "WHAT ABOUT $T", "score": 1, "replies": []}]}
