{"title": "What's your take on Apple's earnings coming out today eve?", "selftext": "Whatever Apple says is surely gonna make a big dent on markets. Fingers crossed. Apple hasn't disappointed for a long time, hope they continue the good run even today! Else we are in big trouble.\nSome links\nhttp://www.marketwatch.com/story/apples-report-poised-to-ripple-through-this-vulnerable-market-2015-04-27?dist=beforebell\nhttp://finance.yahoo.com/news/apple-is-no-bellwether-for-the-market-113533525.html", "id": "340t6o", "created_utc": 1430136950.0, "score": 10, "upvote_ratio": 0.78, "num_comments": 15, "comments": [{"body": "I am fairly sure they will beat on all fronts plus increase div.", "score": 7, "replies": [{"body": "that's what everyone is saying.  may be worthwhile to have downside protection if someone is holding a big, unhedged, bull position.  ", "score": 1, "replies": [{"body": "I know - I added a bit more to my position nevertheless. If they do go down, I still see plenty of upside in the near future. I would rather hold a bit longer than miss out on a 3 - 4% jump. It's a chance I'm willing to take. Already regret selling my may 15 $130 calls last week, since they are up 80% since then!", "score": 2, "replies": []}]}]}, {"body": "Wait and see is my take.  I think earnings will be solid on continued iPhone 6 sales, but expectations are so incredibly high already I don't know how far above analyst estimates they'll have to come in at for it really be considered a \"beat\" by the markets.", "score": 2, "replies": [{"body": "Is it worth buying a bunch of shares today before they announce the earnings? ", "score": 1, "replies": [{"body": "My opinion on that is in the first 3 words of my comment.", "score": 2, "replies": [{"body": "Well that'd make sense if I already had stocks. Waiting would just mean not to buy the stocks today. ", "score": 2, "replies": [{"body": "I have to applaud you for normadying that grammar nazi into its plase. ", "score": 1, "replies": []}]}]}]}]}, {"body": "Edit: just deleted a long and useless post.\n\nHoping they beat estimates as per usual, hoping to see $136 this wk, hoping for Divs, definitely SHOULD have bought earlier this wk at 126-128, not sure why I've been staying away from my gut (and brain) this week but not only did I not go more APPL I didn't bite on ENZN after hearing Icahn's stake went thru and that was +16% on friday (I think friday) so don't mind me, I'm just leaving ca$h on the floor everywhere", "score": 2, "replies": []}, {"body": "Dividend increased by 11%, share buyback will continue, more than 61 million iPhones sold, but looks all of it was already factored in the current share price. With some negatives, market doesn't seem to be extremely elated with these numbers.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Wow.. Thanks for the share. I love this guy's analysis and writing style.", "score": 1, "replies": [{"body": "/r/wallstreetbets", "score": 1, "replies": []}]}]}, {"body": "I am 40% in puts. Not because I think they'll do bad but as an emotional hedge because I love Apple/Jobs/Cook/the brilliance/ingenuity/creativity/innovation/polish/simplicity of iDevices more than anything else and I will feel awful if they disappoint on earnings, but at least I'll have money", "score": 1, "replies": []}, {"body": "Lol, I sold my shares at 132.50, but I'm synthetically long about 20x that amount in short options from 125-130 strike.\n\nLooks like the vol crush will win again.  Thank you Tim Cook!", "score": 1, "replies": []}]}
{"title": "AAPL expands capital return program to $200B -- what does that really mean?", "selftext": "Article linked below. As the title states, what does capital return actually mean? From my understanding, it relates to both share buy back (for employees) as well as dividends (for shareholders). \n\nhttp://www.cnbc.com/id/102623422?__source=yahoo%7cfinance%7cheadline%7cheadline%7cstory&par=yahoo&doc=102623422\n\n", "id": "342o86", "created_utc": 1430167990.0, "score": 9, "upvote_ratio": 0.91, "num_comments": 20, "comments": [{"body": "It means existing shares are worth more. Supposedly. ", "score": 4, "replies": [{"body": "RIDE THE HYPE TRAIN TO THE TOP!!!!", "score": 1, "replies": []}]}, {"body": "They announced they would increase their capital return program to $200bn (previously $140bn) and extended it to March 2017.  \n\nYep you're right - through divis and share buybacks. They're increasing their dividend by 11% and spending more money to buyback shares on the market. I think during 4Q (two quarters ago), they spent $20 billion on share buybacks. Companies usually do this to offset employee stock options (that would otherwise dilute shareholders' interest), but to the scale that Apple does it, is considered return of capital to shareholders.  \n", "score": 2, "replies": []}, {"body": "It means we get all the little johnnies piling in on all the upgrades.  ", "score": 1, "replies": []}, {"body": "i wish they would offer drip.  that would be awesome for me.", "score": 1, "replies": [{"body": "Your broker can set up a DRIP for AAPL.", "score": 2, "replies": [{"body": "is that a major hassle if i didn't buy it with my current broker?  ", "score": 1, "replies": [{"body": "Shouldn't be a major hassle.  If you hold the shares with another broker you should be able to transfer the shares.  The broker who holds the shares doesn't offer dividend reinvesting?", "score": 2, "replies": [{"body": "it (one share) was purchased originally in 1997ish by my aunt, from a local broker.", "score": 1, "replies": [{"body": "That isn't just one share anymore, more like 28 if my math is correct.  ", "score": 2, "replies": [{"body": "Correct! Not a bad stocking stuffer, thanks aunt Ruth. ", "score": 1, "replies": [{"body": "I use TradeKing, a simple email to their support staff was enough to enable DRIP on my account. Be careful about transferring shares between brokers though. I was like you, a few old shares of PG my grandma gave me when I was 18. They were sitting with Computershare by default. Tradeking wanted to charge $115 to move them over to them...no thanks.", "score": 1, "replies": [{"body": "i updated my address a few years ago, and i had to deal with computershare.  i'm guessing i might be in the same boat.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "I read that they are working on a new iPhone that will be so much better that they might skip the 6s and go straight to 7.\n\nEither way I think we can expect more of the same for the next decade or so.", "score": 1, "replies": []}, {"body": "Share buyback has nothing to do with employees. They buy back shares to decrease the amount of overall outstanding shares, thus making your shares worth more.", "score": 1, "replies": []}, {"body": "What do we see the share price heading to by the end of the week?", "score": 1, "replies": [{"body": "It's definitely going up, unless it goes down instead. ", "score": 3, "replies": []}]}, {"body": "Apple had a shitload of cash, they decided they don't really need it, so they want to return it to shareholders to boost their return on equity. There are 2 ways to do that; dividends and share buybacks. Either giving the money back directly, or buying their own shares to increase the value of outstanding shares.", "score": 0, "replies": [{"body": "So when would they announce the share buybacks, probably sometime this quarter? And dividends get paid out on May 5th-ish right?", "score": 1, "replies": [{"body": "They have been buying back shares for a long time, they will just expand the program until 2017. Not sure when the dividends will be paid. ", "score": 0, "replies": []}]}]}]}
{"title": "TSLA shot up 9% today, how are you going to play this", "selftext": "Obviously this is an overvalued stock, and it'll fall eventually. Will you just straight short the shares, or buy puts?\n\nInterested to see how WSB is playing this one", "id": "341eqe", "created_utc": 1430148508.0, "score": 13, "upvote_ratio": 0.82, "num_comments": 12, "comments": [{"body": "Already long. This is a textbook short squeeze. ", "score": 3, "replies": [{"body": "Is it too late to get in, in your opinion? Or has this boat sailed", "score": 1, "replies": [{"body": "Here's how I see the next week or so playing out (take this with many grains of salt as I don't consider myself too experienced):\n\n* Tesla stock will probably stabilize mid 230s until Thursday.\n* On Thursday, the price of the stock will probably rise in anticipation and as a result of their \"announcement\".\n* Prices will probably be somewhat stable until next Tuesday when earnings are announced, at which point I expect the stock price to plummet, due to the lack of actual increase in deliveries (due to carryover from Q4 2014).\n\nIf my thinking is right, then the time to short would be right before the earnings announcement. Like I said before, don't take my word on this. I'm just some internet dude without a ton of experience.", "score": 4, "replies": []}, {"body": "I know this is WSB, but I'm actually a believer in Tesla as a company so I'm not going to speculate on how to make a quick buck today. They have a big announcement Thursday and earnings next week so the stock will definitely be making moves. Volatility is your friend.", "score": 2, "replies": [{"body": "That's the thing. I *LOVE* Tesla as a company, my ultimate goal is to be able to buy one with my gains on the market. The stock in and of itself is already super volatile, and I know thursday can make it swing either way. Might look into covered-calls or buy calls and puts to minimize loss. Thanks for your comment btw", "score": 1, "replies": [{"body": "Buy a Prius, put the money saved toward earnings put spreads.", "score": 4, "replies": []}]}]}, {"body": "Straddle options!!!!!", "score": 1, "replies": []}, {"body": "Do you see the stock going to 250 or 300? I do. A Chinese taxi company just ordered some, that and new home energy stuff in addition to increasing sales. The future looks good. ", "score": 1, "replies": []}]}]}, {"body": "I don't have the money to play TSLA (at least not in quantities enough to make profits worth the risk) but if I did, I probably still wouldn't.  It trades strangely and things like a tweet from Musk can send it soaring.  Maybe \"buy rumor and sell news\" at best, but the volatility on this one makes it a large risk.  Volatile stocks might seem like a great way to make quick bank, but most people don't get out until it's far too late, and experienced traders know better than to mess with a stock like this for too long.\n\nI think the best plan for TSLA is buy and hold if you believe in the company long term (if there is *any* money to be made in electric cars long term, I don't doubt they'll make decent a slice of it), but short term be prepared for a roller coaster ride...", "score": 1, "replies": [{"body": "Musk could tweet how he just took a shit and the stock would move up 2%", "score": 1, "replies": []}]}, {"body": "Technical Analysis student here. \nfollowing the 5/10/20 day MA crossovers on 4/7, and resulting gap over the downtrend line from 9/4/14, it rode the DT line as support for that healthy pullback to 4/20. Three days of impulse buying puts us here. \n\nLong at 207, have moved protective stops to 218, based on the 220 resistance range from 4/22-4/24. Planning on pulling out before earnings; we all know how violent that gets. At this level, I'd wait for consolidation/pullback before gaming in.", "score": 1, "replies": [{"body": "I don't know why people are downvoting you, but remember to pair TA with FA.", "score": 1, "replies": []}]}]}
{"title": "what the fuck? buy vxx", "selftext": "srsly guys.  the weekly 22/23 call spread was trading for as cheap as 6 cents with VXX at 20.70.  that's a killer deal.  this thing could pop hard and right now the skew is tiny. \n\nalso apple puts ftw. ", "id": "341p3a", "created_utc": 1430153072.0, "score": 5, "upvote_ratio": 0.86, "num_comments": 12, "comments": [{"body": "What bout those Apple puts", "score": 3, "replies": [{"body": "[too soon](http://www.hollywoodreporter.com/sites/default/files/2012/04/dawson_crying.jpg)", "score": 3, "replies": [{"body": "I hope [this](https://youtu.be/s_MH4Dv0F30) cheers you up a bit", "score": 1, "replies": [{"body": "a tiny bit, thanks.  the 1.5% drop this morning helps too.  ", "score": 2, "replies": [{"body": "Had AAPL opened UP and sold off, you'd be in gravy.  A down open followed by a buy-in seems like the standard AAPL earnings climb.", "score": 1, "replies": []}]}]}]}]}, {"body": "I'm long all the /VX products, yo.  Bring back that volatility!\n\nEDIT:  Oh baby they sellin em off!!!\n\nI bought some of those sweet sweet ultra-cheap call spreads ten cents ago too.  bahaha", "score": 2, "replies": []}, {"body": "33/33.5 call spread selling for $0.\nIs this a misquote? \n\nhttp://i.imgur.com/dVLeLEg.png", "score": 1, "replies": [{"body": "good catch. just put in a 50 lot may 15 33/33.5 GTC order for 0.00.  IB is giving me a bid as of -.02 - .01.  i'm guessing they'll force me to cross for the penny if i want it. \n\n*bid ask", "score": 1, "replies": [{"body": "The fucking VXX, right?    Bastard products!   GO BACK TO 40!", "score": 1, "replies": [{"body": "ugh, VXX is like a structured option.  it shoots up and retreats just as quickly.  i used to make money selling calls and now i'm finding myself on the other side of the trade. ", "score": 1, "replies": []}]}]}]}, {"body": "I bought some calls this morning.  Sold them for a 50% gain shortly later.", "score": 1, "replies": []}, {"body": "nice try marketmaker..", "score": 0, "replies": []}]}
{"title": "Amd is the next google, trust me", "selftext": "Bought at 2.28 will sell once it hits 90 again. Who knew getting rich was this easy?", "id": "342623", "created_utc": 1430160279.0, "score": 1, "upvote_ratio": 0.57, "num_comments": 11, "comments": [{"body": "I just came from a trade show that amd participates in and I don't agree. They are doing shitty In the graphics card area. Not only was the booth much smaller this year but it was moved to the back and completely empty. People don't care about amd they want nvidia and Intel. They have the FirePro in the Mac Pro but the profits are not much. I own a lot of and and I'm debating takining a loss  or selling calls against my position. But yeah it's prolly going to .90 cents.", "score": 5, "replies": []}, {"body": "Amd up 10cents today, get blown out nvidiots. ", "score": 2, "replies": []}, {"body": "5 year peg of 0.05\n\nWhat", "score": 1, "replies": []}, {"body": "lol waht?", "score": 1, "replies": []}, {"body": "Their 300 series cards will be ahead of the competition for at least a few months, then the nvidiots will all convert for the amdomination. Stock will hit an all time high, any anyone smart enough to buy now will live a life of luxury.", "score": 0, "replies": [{"body": "Pc market is declining, plus one non revolutionary product isn't enough to revive a dying company. This is one of the most idiotic things I've ever read on this sub.", "score": 2, "replies": [{"body": "Must be joking. PC gaming hardware sales are going up.", "score": 3, "replies": [{"body": "AMD won't recover because they have the best graphics card around for a few months. Get your head out of the clouds kid. ", "score": 3, "replies": [{"body": "No I definitely agree. \n\nAMD's dead.\n\nThe PC market though isn't declining. It's going up. Intel+nVidia.", "score": 3, "replies": []}, {"body": "Might be able to squeeze some money the month before their next GPU lines release. Not something I would do though ", "score": 1, "replies": []}]}]}]}, {"body": "Ok... Where's the decade spent becoming Google?", "score": 1, "replies": []}]}]}
