{"title": "How many people think Tesla can be very successful, selling millions of cars with a $40B market cap?", "selftext": "Just curious. All I ever see is $0 or $500B. Why? Surely it's possible that Tesla is just as successful as the long think at selling cars while still being a good short based on profit/margins.\n\nI feel like I'm the only one who sees Tesla being a successful, low-margin company. I don't know why it's so hard for others to see this very realistic outcome.\n\nWhy is it only possible that Tesla is the Apple of EVs and not the Huawei?", "id": "awbd6k", "created_utc": 1551484021.0, "score": 15, "upvote_ratio": 0.79, "num_comments": 89, "comments": [{"body": "They arent a car company.  It’s only part of the first master plan", "score": 13, "replies": [{"body": "So far that's all they really are. There is no meaningful revenue from any other line of business they are in and future lines of business have tons of competition.", "score": 7, "replies": [{"body": "Also waymo valued at 125b or something like that.  Theres value more than selling cars if they are different and provide data ", "score": 5, "replies": [{"body": "Do they make cars of just software for cars?", "score": 2, "replies": [{"body": "Waymo has made their own full self driving prototype car, but they are testing on the road with regular cars that have been fitted with FSD stuff. They don't have a product to sell yet, but since it's part of Google they don't really need to.", "score": 4, "replies": [{"body": "They did a couple of prototypes. Good news they quickly realized it’s a really bad idea.", "score": 3, "replies": []}]}, {"body": "They dont make cars.  It’s google maps w lidar.  Oh and you are aware of it bc run by the largest ad firm the world has ever seen", "score": 1, "replies": []}]}]}, {"body": "Competition...lol.", "score": 2, "replies": [{"body": "Their most important potential business -- self driving tech that can be used for ride sharing -- is widely known to be behind Waymo.\n\nSolar panels? A gazillion manufacturers and we already have seen that Tesla solar products aren't in demand. The roofs have flopped.", "score": 1, "replies": []}]}, {"body": "One thing to understand is that they aren't a gasoline engine and final assembly company.  They are a battery, final assembly, and maintenance company.\n\nOnly thing they have in common with car companies is that they do the final assembly on cars.", "score": 1, "replies": []}, {"body": "Part 1 of plan", "score": 0, "replies": []}]}, {"body": "Functionally speaking there seems to be very little synergy in meshing the various businesses to which Tesla aspires together, at least as far as I can see. How does running solar tile production make batteries cheaper, for instance?", "score": 1, "replies": [{"body": "It provides more use cases for the battery storage ", "score": 3, "replies": [{"body": "Solar tiles do?", "score": 1, "replies": [{"body": "The cars are mobile wrappers for batteries. The solar cells are wrappers for batteries in the powerwalls.", "score": 3, "replies": [{"body": "Explains why I get a chubby whenever there's car news and a raging throbber when there's battery news.", "score": 2, "replies": []}, {"body": "Don't they use different batteries?", "score": 1, "replies": [{"body": "They are different batteries and battery packs that are both built in fundamentally similar ways likely using much of the same equipment", "score": 1, "replies": []}]}]}]}]}, {"body": "The synergy  is probably from consuming their own products internally, and from selling products to existing customers.\n\nFor car charging, I think Tesla will eventually use a lot of solar and batteries, that will give them an advantage over fast charging solutions that don't make their own solar and batteries.\n\nFor marketing, galleries will be shared between energy and automotive, service and supercharging will also have displays promoting Tesla energy.\n\nUsing batteries for both energy storage and automotive help scale production to lower prices for both, some battery R&D and production equipment costs can be shared.\n\nAlso things like glass for the Tesla roof can make it into a product  like the Tesla semi windshield.\n\nMore broadly speaking, they have electronics, software and materials science knowledge that has applications for Tesla/Space-X/Boring co. ", "score": 1, "replies": [{"body": ".... What galleries?", "score": 1, "replies": [{"body": "Stores will covert to galleries in good locations, few cars, fewer staff no test drives, my guess is static displays and touch screens,plenty of room for solar.  \n\nTesla hasn't yet identified which stores are closing, and which ones are converting.\n\nThey may still sell Tesla merchandise.", "score": 1, "replies": [{"body": "My impression of the announcement was that the vast majority of stores would close completely, and a handful in major cities would stay open as galleries.  \n\nI get what you're saying, it just doesn't really match up with what Tesla announced.", "score": 1, "replies": []}]}]}]}, {"body": "There's certainly some synergy pairing solar systems with the batteries necessary to store excess power.  Not as much as with vehicles, since the grid can effectively be most people's storage for far cheaper, but I can see the math.\n\n", "score": 1, "replies": [{"body": "Power wall is almost perfect way to utilize used power cells.", "score": 2, "replies": []}, {"body": "Isn't their solar business being wound down?", "score": 2, "replies": []}, {"body": "From the end-customer's perspective, sure. Where's the synergy in production?", "score": 1, "replies": [{"body": "Production, not so much, but they could bring it all together into a slick package in terms of purchasing and control integration.", "score": 1, "replies": []}]}]}, {"body": "Thanks for speaking functionally.  Nah", "score": 0, "replies": []}]}, {"body": "What are they yet, genius?\n\nAn energy company?  Because how's solar coming along? Is Powerwall demand off the hook still?\n\nA tech company?  Because they can't figure out how to process refunds and can't keep their cars from decapitating their drivers if there's a semi nearby?\n\n", "score": -5, "replies": [{"body": "Always a hater never a player", "score": 1, "replies": [{"body": "Can't answer the questions, makes nonsense statement.  Never change.", "score": -4, "replies": [{"body": "Ouch!", "score": 0, "replies": []}]}]}]}]}, {"body": "Can they be successful yes 100%.\n\nHighly profitable with high gross margins like Apple, no. That’s just not how the auto industry is. Automakers trade around 5-10 times earnings.\n\nDoes that make Tesla a bad company? No, auto manufactures are great companies. But it’s capital intensive and low margins. \n\nWhy should Tesla be valued like Apple, or Amazon?  Why not like VW, Ford, or GM? \n\nI mean at this point Tesla is ramping down the other parts of their business, not funding them to push forward the auto segment. Which is a good thing, that’s their only way to earn profits right now.", "score": 8, "replies": [{"body": "Im a bull but I have a few counterpoints to this that I think are valid.  \n\n1.  EVs I believe will in the end have much better margins than cars traditionally have had.  The old auto companies have always had to build a complex engine with many parts and a transmission.  If they can get battery costs down, and EV motor is super simple and cheap.  You could see 20 percent margins as common in the future.  With Tesla vertically integrated they might set a new standard.\n\n2.  Service and parts.  Most new car dealerships make a significant part of their profits from service and parts mark ups.  Tesla has no dealers.  This is a huge advantage as they can charge normal rates for direct service and parts.  This is a large revenue stream that I don't think the market appreciates at all.  In the future, it too will be huge.\n\nTesla has a huge advantage selling online directly. If they can get their margins and battery costs down it could change the traditional auto valuation PE ratio.", "score": 14, "replies": [{"body": ">EVs I believe will in the end have much better margins than cars traditionally have had. The old auto companies have always had to build a complex engine with many parts and a transmission. If they can get battery costs down, and EV motor is super simple and cheap.\n\nThats not how the free market works, in fact most times it works the opposite way: Lower complexity means lower cost of entry for competitors -> more competition -> lower margins.", "score": 3, "replies": []}, {"body": "To counter those though, you just said EVs are super simple and cheap. We can assume that means more reliable. Therefor even if Tesla does capture all the service/part revenue, there won't be any since, as you said, they are super simple and cheap.\n\nLikewise, as we see with smartphones, the cost to produce flagship phones for Samsung and Huawei etc are the same as Apple. What makes Apple so profitable isn't their in-house stuff, it's merely their ability to sell at a high price.\n\nThere's no reason that EVs become any less a commodity than any other car. Tesla is racing to the bottom in cost whereas Apple keeps going up up up.", "score": 5, "replies": [{"body": " Currently the traditional automakers do not benefit from the service sector. That is the profit of the local dealers.  So that would not affect the market cap.  They make very little off the markup of the 3rd party parts. \n\nTesla could sell at a premium.  There was a study done that Elon Musk previous companies cared more about growth and was willing to sell closer to costs to win market share. I believe that’s what he is doing with the model 3 right now. \n\nThe 500B or 0 thesis is this.  0 is straight forward, there is a market correction and Tesla grew too fast and their debt catches up while their revenue shrinks. 500B is Tesla goes from selling500k cars to 10M and has a 10-20% market share with top industry profit margins of 20-30%.  You are right. It’s like 99% likely it’s in the middle.  \n\nSince Tesla has grown at a exponential rate the last ~10 years.  The bulls are betting they continue to grow the next 10 years. Likely placing their market cap closer to 200B than 50B.  Especially with the planned China and Europe plants.  \n\nSo at least from some people’s perspectives it is easier to be 0 or 100B the next 5 years than to stay 50B.  \n\nIt’s an interesting thought experiment. But it’s all speculation from both sides. ", "score": 2, "replies": []}]}, {"body": "> EVs I believe will in the end have much better margins than cars traditionally have had. \n\nIn a competitive market, why won't margins be competed down to the same as they are now?", "score": 1, "replies": [{"body": "Of course they would be.", "score": 2, "replies": []}]}, {"body": "1. Simplicity alone does not ensure high profit margins. If that would be true - you should invest in water closet manufacturing instead :).\n2. Dealers network is an advantage. A mesh of small business are more nimble then your own huge sales department when working with individuals. \n\nEven Apple, being very successful building retail chain, may, in fact, be even more successful spending this effort on product development.", "score": 1, "replies": [{"body": "Doubtful with Apple considering they can't spend their money nearly as fast as they make it. It's not like the retail chain has any effect on resources dedicated to product development.", "score": 0, "replies": [{"body": "Money cannot buy you everything. For example, Tesla spends fraction of what other car companies spend on R&D, however way more effective.", "score": 2, "replies": [{"body": "I think you have that backwards. As a percentage of revenue, Tesla spends way more than VW. That's not more effective, it's less effective. VW spends about 10x as much on R&D as Tesla, yet has like 15x as many cars for sale.\n\nBut that's not the point. Apple's retail focus doesn't take anything away from product development because there is no stretching/overlapping of resources. Apple can hire another 10K engineers tomorrow if they wanted. They simply don't.", "score": -1, "replies": [{"body": "> I think you have that backwards. As a percentage of revenue, Tesla spends way more than VW. That's not more effective, it's less effective.\n\nWhat you mean is efficient, not effective. Tesla is very effective exactly because they spend so much. But the comparison is a bad one even after that because Tesla is still a \"small\" company when compared to the other global automakers. They have to spend a lot to expand their product line whereas the others only have to maintain theirs. And Tesla is making more than just cars and pushing into EVs harder than anyone else safe for the Chinese.", "score": 2, "replies": []}, {"body": "Man, you’ll say pretty much anything. ", "score": 1, "replies": [{"body": "Care to explain or you are you just that attached to your long investment?", "score": 1, "replies": [{"body": "The causation goes the other way: made a small investment because I believe the company is far ahead of competitors and will continue to be for at least a couple more years. I evaluate every week whether I want to sell, buy or hold. No emotional investment in a stock. \n\nThe most absurd thing you said was that Tesla’s RD was less efficient than VWs because they spent a higher fraction of revenue on it. Ignoring the much higher total dollars spent by VW and the fact that doing industry leading R&D is more expensive in general than doing me-too R&D to catch up when someone has shown you the way. I don’t think either of us have exact info on relative proportions of cutting edge vs follower research at each place, so your confident statement about Tesla being less effective or efficient was a red flag to me that you are engaged in the pursuit of justifications to follow your conclusions and not the other way around. There is also the matter of  tech start-ups in general having to spend a higher proportion of revenue on R&D because they have a smaller revenue base, a need to innovate immediately to survive, and basic scientific research doesn’t cost less just because you’re a smaller company (the universe and its laws don’t give you a discount). Yes, it will probably cost a bit less per project because of less bureaucracy, but not relative to total revenue.\n\nBasically, you have a negative interpretation before you have the facts and will keep seeking possible explanations to justify it without adequate information to support it. Of course lots of bulls do the same thing. You’re just the same, is all I’m saying. ", "score": 3, "replies": [{"body": "I'm simply going off of the definition of efficiency. Both companies are turning out cutting edge technologies in many ways. Tesla has some great stuff VAG doesn't, VAG has some great stuff Tesla doesn't.\n\nAt the end of the day, from the business standpoint, VAG is simply more efficient. That's really all I'm saying.\n\nI'm currently neither short or long since the stock is too emotional. Doesn't make either investment thesis easy at this point. Right now I think it should be a $20B company at current performance, but I know that's not going to happen. I think Tesla will be as the title says -- a successful, modest margin car company. I don't think it will be worth $0 and I don't think it will be worth $100B+.", "score": 0, "replies": []}]}]}]}, {"body": "> As a percentage of revenue, Tesla spends way more than VW. That's not more effective, it's less effective. \n\nThis makes no sense to me. VW dollars aren't worth less than Tesla dollars just because they have income, so to compare their R&D efficiency you should compare $$ in -> Tech out. (Not % in -> Tech out)", "score": 1, "replies": [{"body": "Well, that's how you do it from a business standpoint. There is no way to quantify the quality of technology output. At the end of the day they're all just building cars, some the same, some different.\n\nTesla has some great tech and so does VAG.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I think if Tesla delivers, they can have a really nice market value, but nowhere near Amazon or Google. \nFor their margins, their edge is not on the EV part itself, because many legacy OEM do not even conceive their engine themselves and still cannot go further than 8-9% on their margin. However Tesla makes their own software, which has a very high value added and generally EBIT margin toward 30-40%. And this is where legacy OEM will come short. All the technical EV part, I think OEM will suceed in the medium run, because they most have a huge pile of cash (in Europe, do not know for other area like US or Asia), and local government will be ready to help if needed. Moreover, these large companies have started to move. VW launched a huge investment plan in R&D, and Daimler made an alliance with BMW. PSA is in a large alliance with DongFeng and Toyota. And so on. \n\nThe problem for the margins of an OEM, is the very large capex needed all around the world to sustain the production AND the innovations. This is why all OEM have part by part, stop the development of key parts and externalize them, because it was impossible to do it all by themselves, and it is the same for Tesla. \n\nHowever, if they can create some kind of brand image like apple where they can justify a premium on their cars, coupled with their software parts, they might reach an EBIT margin of something like 13-14% which would already be spectacular for a mass market car brand, but would never justify a valuation of a trillion dollar or whatever I sometimes read here. However a couple hundred billions would already be great. ANd this is if tesla delivers on their promesses. ", "score": 1, "replies": []}]}, {"body": "> Why should Tesla be valued like Apple, or Amazon? Why not like VW, Ford, or GM?\n\nI'm still split on this. It should definitely fall somewhere in between them. Lower than the first two (if industrial-scale grid storage + FSD takes off maybe a bit closer) and more in line with auto for the reasons that you've stated. But also at a significantly higher ratio than VW, Ford or GM because those guys are shrinking whereas Tesla is rapidly expanding not just in size but in scope as well.", "score": 3, "replies": [{"body": "Tesla is expanding but is orders of magnitude smaller. ", "score": 1, "replies": [{"body": "That's why I said ratio, not valuation.", "score": 1, "replies": []}]}]}, {"body": "They don’t really have to deal with as extensive as a supply chain as trad auto makers and could be less capital intensive once the company has reached full maturity. How do you know margins aren’t a lot better for evs ones you’ve reached economy’s of scale? I wouldn’t go as far as saying it’s like apple or amazon but definitely not in the same category as trad auto makers.", "score": 3, "replies": []}, {"body": ">\tWhy should Tesla be valued like Apple, or Amazon? Why not like VW, Ford, or GM?\n\nTech companies sell a whole lot of easily replicatable things like software.\n\nWhat’s Tesla just realigned itself to now? selling software for a premium:\n\nhttps://twitter.com/elonmusk/status/1101724210878128128?s=21\n\nThis is the gambit. If they can pull off even a reasonable driver assistance system Level 3 or above they’ll own the market for quite some time.", "score": 2, "replies": [{"body": "Yeah, but Tesla isn't selling software to everyone, just Tesla buyers. Luxury automakers have been selling \"software\" at premium prices for a while now. It's not like Audi's assistance packages are free or cheap.", "score": 4, "replies": [{"body": "You are missing it. No one is selling software for thousands of dollars except for Tesla. If they can. Pull off FSD they’lll have huge returns", "score": 1, "replies": [{"body": "I don't follow. How is Tesla selling driver assistance software different than Audi other than Tesla lets you buy it after the fact?\n\nIf Tesla pulls off FSD, then they will no longer be selling it after the fact either since everyone will spec it from the start. I just don't see this software angle you're talking about being unique.", "score": 2, "replies": [{"body": ">\tI don’t follow. How is Tesla selling driver assistance software different than Audi other than Tesla lets you buy it after the fact?\n\nPrice ", "score": 1, "replies": [{"body": "I still don't follow. They're selling it for more or for less?", "score": 1, "replies": [{"body": "What’s the price of Audi’s software?", "score": 1, "replies": [{"body": "Depends on the car I guess. On the new etron, it's $2800 or included in the premium model.", "score": 1, "replies": [{"body": "Tesla is now selling AP plus FSD for $8000 total.\n\nAP is now just TACC and Lane Keeping\nFSD is now NOA, Summon, Parking\n\nSo as I said at the start if Tesla continues to innovate on FSD as it says it will it will highly encourage more and more people to upgrade an extra $5k to get the FSD features.\n\nWhen they are churning out 400,000 cars per year that’s a lot of money. For other brands without the ability to OTA upgrade and continuous improvement to existing fleet it’s a strong buy for Tesla customers.", "score": 2, "replies": [{"body": "Maybe, but shouldn't self driving feature costs go down with time, not up? I'd expect self-driving software to get cheaper, not more expensive, and I'd expect competition to drive it down as everyone implements it.\n\nI don't think OTA updates/upselling after the fact will be a big deal since so many people finance their cars and wouldn't have a large amount of money available to spend later. They'd likely need it amortized into the loan on day 1 when they buy it.\n", "score": 1, "replies": [{"body": ">\tMaybe, but shouldn’t self driving feature costs go down with time, not up? I’d expect self-driving software to get cheaper, not more expensive, and I’d expect competition to drive it down as everyone implements it.\n\nIt’s software. The more features rich the more demand, the more you can charge.\n\n>\tI’d expect competition to drive it down as everyone implements it\n\nI’m not confident that Tesla can get to FSD but I am confident that if any auto company can, it will be Tesla first.\n\nNo one else is using actual in production cars as their training fleet. That’s a massive advantage as the data doesn’t need to be normalised.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "> No one is selling software for thousands of dollars except for Tesla.\n\nEvery car company sells upgrades on their cars. Including software. \n\n>Pull off FSD they’lll have huge returns\n\nAnd if they invent cold fusion they'll have huge returns.", "score": 1, "replies": [{"body": ">\tEvery car company sells upgrades on their cars. Including software.\n\nWho is selling $8000 upgrades? Who is doing it after the initial purchase?", "score": 1, "replies": [{"body": "Very few people are buying it after initial purchase because they can't/won't be able to afford it. How many people buying a $30K car have $8K cash set aside 12 months later?\n\nPeople need it amortized with the car loan. If they don't get it on day 1, they likely won't get it at all because they won't have or be willing to spend all that money randomly one day in the future.\n\n", "score": 1, "replies": []}, {"body": ">Who is selling $8000 upgrades?\n\nNobody, Tesla is charging $8000 for future upgrades that mostly don't exist yet. ", "score": 1, "replies": [{"body": "Read the caveat said at the very top about Tesla’s gambit", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Isn’t Tesla working on a sort of Uber like service for car rental using FSD? This could really become a huge source of revenues.", "score": 1, "replies": [{"body": "FSD has to be solved first before that exists. I think we can be confident in saying that zero software exists to support such a concept today", "score": 1, "replies": [{"body": "I know but I think Musk mentioned that it was a goal. Obviously they can’t do everything immediately.", "score": 1, "replies": [{"body": "If Waymo/Uber/Lyft actually have a competing product on the market two years ahead of Tesla, how much will the \"Tesla Network\" actually be worth?  What will compel people to use them instead of the much larger, established players?  ", "score": 1, "replies": []}]}]}]}]}, {"body": "I wonder whether software will make a difference in their margins. Tesla vastly increases its profit margins with selling software on top of the hardware (car).\n\nWhile this already exists in current cars, Tesla is really playing a big role here. You can upgrade 10.000 USD+ in software alone, and then I'm not even talking about the unlocking of the battery.\n\nCorrect me if I'm wrong, but I believe this is a relatively new strategy which will allow them to have tighter margins on the hardware, while selling software on top. And since it's software, this sale model works better for them to sell as many cars as possible, since all the cars are sold with the hardware included. ", "score": 1, "replies": [{"body": "See this is interesting but I’m not sure it’ll work in the mass market.\n\nHow many people can afford $10,000 or even $3000 in software that isn’t rolled into the cars loan? Most people have to spread that out over the course of 5 years.\n\nOn the S and X that strategy worked fine because it’s costumers we’re wealthy.\n\nIn the mass market, I think more upfront sales for these items will be common so it’s in the into all car loan.\n\n(I don’t have proof of this, just my hunch)", "score": 2, "replies": [{"body": "That's a very good point regarding upgrades. The only solution would be for buyers of used cars to overpay initially and ask the seller to upgrade it upon sale.\n\nBut yeah, it's unlikely that someone who buys a car for $30K suddenly dumps $5K into software 8-12 months down the line. If it doesn't happen at the time of sale, it's probably not going to happen at all.", "score": 2, "replies": []}]}]}, {"body": "Cruise, Argo, etc have crazy high valuations compared to the manufacturing side. You are making the mistake of thinking Tesla Motors is sitting at $50 billion and Tesla AI at $0 which is not the case.", "score": 1, "replies": []}, {"body": "VW, Ford or GM will soon be state owned companies. If state wants to save them.\n\nTheir share prices are low because market know that risk. ", "score": 1, "replies": [{"body": "VW had an all time high 2018 results, how are they in any danger ? Cannot speak for Ford or GM though since I do not know their situation. \nHowever their weak share price is just based on weaker perspective with a possible trade war and a slow down of the market in China. Not really the end of the world. And most legacy OEM have a large pile of cash to fund their transition toward EVs (at least in Europe, do not know for the US or Asia). ", "score": 1, "replies": []}, {"body": "I think we’re going to see a lot of mergers before that. I’m suspecting VW is going to acquire Ford at some point. Seem to be a lot of working together lately, and could be a precursor.", "score": 1, "replies": []}]}, {"body": "Dealerships have an ROI of 30% how does Tesla's valuation change in your mind if you reprice them as a car dealer?", "score": 1, "replies": [{"body": "Depends -- having a high ROI isn't terribly meaningful. I have a high ROI on selling lemonade, but I just can't sell enough lemonade for it to really make any considerable amount of money.\n\nHowever, Autonation is a public company. It's essentially a bunch of car dealerships, 360 in total. It's worth about $3B. Dealerships aren't worth *that* much.", "score": 1, "replies": [{"body": "Autonation has declined a ton in the last few years. It's trading below levels that were seen in 1997 Ha!\n\nBerkshire automotive earns 15 billion per year for BH, it's one of their most profitable retail holdings.\n\n\n", "score": 0, "replies": [{"body": "Not true. Berkshire Automotive revenue is only $9B.", "score": 2, "replies": [{"body": "Ahh too true. I glanced at the 10k and saw 15.6 billion...but it's only 63% of that or 9.8 billion.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "By the way, did short sellers sent a cut to Elon for his latest efforts? \n\nSeriously, if I’d knew the exact announcement in advance, I could easily predict stock trajectory over the last couple of days. And I’m hardly an expert in this field, by the way. So, Elon should definitely know he was creating a huge feast for short sellers.", "score": -3, "replies": []}, {"body": "Because Elon has a Messiah complex and he has always aimed for more than that. With the price that Tesla acquired freemont for, they could have been an extremely successful midcap seller of high end EVs, and cars like roadster 2.0 would compete with exotics. That's not enough for Musk. It's just like with the rockets. He's not trying to build a private ISS or establish a permanent test colony on the moon, he insists on mars. ", "score": -1, "replies": []}]}
