{"title": "Hyper change Tv: The Garage Theory & Tesla's Demand Cliff", "selftext": "", "id": "b3g9bg", "created_utc": 1553110107.0, "score": 21, "upvote_ratio": 0.77, "num_comments": 82, "comments": [{"body": "Demand issue is pure simpleton thinking. Yes, there is possibly some fluctuations in demand because Tesla is still very new to people and cars are a major purchase. But as long as the product is good, which it is based on numerous consumer experience, the demand will go through the roof. \n\nIt happened for iPhone too. It is pretty simple actually. Also, the price change is long-term thinking. People will come back and praise Elon for this in the future. \n\nEdit: iPhone sales went through similar swings in the beginning. After working out all the kinks, it was known history. I think the same will happen for Tesla. The scaling up will be harder for sure.", "score": 16, "replies": [{"body": "Everyone that’s been following tesla that have their head outside their asses knew tesla was coming out with $35k in first half of 2019. This was confirmed by Elon over and over again. $35k model has been 13 years in the making and when they finally achieve it everyone is SHOCKED by the sudden price decline. I don’t get it. But tesla will succeed with or without the nonsense in the media, so whatever  ", "score": 14, "replies": [{"body": "I totally agree. I mean there is not even a RW option available in Europe and already about 25k orders...\n\nThey had to smooth the price scheme of the lineup when the 35k hit the market. \n\nFrom what i can tell the new price scheme is amazing at up selling. Most people who wanted the 35k model originally will get the SR+ if they somehow can afford to. \n\nA lot of people at the SR+ point will think about LR and if you are LR in a area with snow you are already thinking about the AWD. \n\nPeople who desire a bigger car at this point (with enough of funds) will already think about an S or X...\n\nThan there is the software updates / self driving that will bring money from already sold 35k cars in the future as autopilot gets better.\n\nI saw a lot of post of people in the tesla sub that waited for the 35k model and than ordered a LR model. The strategy works.\n\n&#x200B;", "score": 4, "replies": []}, {"body": "Agree. The hyperchange guy is a good Tesla promoter/support but not an analyst. Hard to read the waves of demand this early in the rollout curve. Regarding why price cut, Tesla in july 18 has already started saying delivery estimate as 6-8 months for SR. \n\nAlso Tesla still has not and will likely not pull all the levers this early. Example, SR AWD is still not available and the US northeast and surely the hilly /cold regions regions of Midwest and North will not have a true SR product for their fit. Same goes for possibly Canada. Similarly, there could S-X updates for which people are holding back. Tesla can always create marketing variant like convertible, coupe. Etc. Lastly there was an expected drop in demand after the late quarter push in Q4.", "score": 2, "replies": []}]}, {"body": "Iphone has 60%+ margins and the manufacturing is sublet to China.", "score": 3, "replies": [{"body": "Apple made more money last quarter than amazon has made in its entire existence. The iPhone analogy is way out in left field.", "score": 8, "replies": []}]}, {"body": "Then why are they slashing prices?\n\nWhy are they having layoffs?\n\nWhy were they shutting down retail?\n\nWhy is their guidance all over the map?\n\nThis isn’t just Elon being Elon, this is concerning. We don’t even know how bad the ASP of the SR is going to affect their gross margins. Q4 sold more cars than Q3 yet profits dropped, so one can pretty easily deduce that the lower ASP of the cars is dragging on the business.\n\nEdit: \nI do agree tho, people want the product. And the people with the cars enjoy them.", "score": 3, "replies": [{"body": ">Then why are they slashing prices?\n\nBecause you can only sell so many $50k+ cars - the market has a limit and Tesla reached it and managed to squeeze a bit more out that most didn't think it could. The rule I've heard is each $10k drop in price opens up the market 2X from the previous step. Dropping the price $15k opens up a whole new market.\n\n>Why are they having layoffs?\n\nPeople are expensive, investors demand profit, slashing people works really well to shore up the bottom line. I'd also imagine that with rapid growth (and rush hiring) some some excess people that aren't as needed. It sucks, but it's going to help keep the company in the black for the year. \n\n>Why were they shutting down retail?\n\n100% impulsive Elon move -- I think it's dumb, but I also think they likely have some sites that needed to go. They need to focus on large delivery/service centers and a fleet of Mobile Techs to do the 70% of jobs that can be done remote. \n\n>Why is their guidance all over the map?\n\nBecause no other company has both grown this fast for a physical product company AND we have ZERO clue what the actual demand for EV's are that at the quality and level Tesla is building. You can guess, you can guide, but at the end of the day, it's a big unknown. I forget the Autoline After hours but they were talking about Nissan or Toyota and the guidance they gave on production for the year, I think they were off by 8 cars or some ridiculously close number. Those companies have known product lines, known demand levels, etc, etc. Tesla, it's a whole new product line, new production challenges (battery production that is almost 50% of the world output), you can guess some things\n\nTelsa has tons of of headwinds, that is for sure but they will get over them in due course and come to a steady state of revenue, cash comes in, they expand and eat almost every OEM's lunch as they all come out with XYZ car in 2021 that is 80% of the range and power of what is currently on offer from the Model 3, a car that is almost 2 years old. ", "score": 4, "replies": [{"body": "> Because you can only sell so many $50k+ cars - the market has a limit and Tesla reached it and managed to squeeze a bit more out that most didn't think it could. The rule I've heard is each $10k drop in price opens up the market 2X from the previous step. Dropping the price $15k opens up a whole new market.\n\nYes agreed.\n\n> People are expensive, investors demand profit, slashing people works really well to shore up the bottom line. I'd also imagine that with rapid growth (and rush hiring) some some excess people that aren't as needed. It sucks, but it's going to help keep the company in the black for the year.\n\nYes but this was due to poor planning. They had to push the SR out the door so sales wouldn’t collapse. Because of that the SR won’t be profitable they had to go to drastic measures and cut staff and attempt to kill the retail business.\n\nThey are caught in a catch 22. If they don’t sell the SR they have to pay suppliers and store parts, or they can ship a car with near zero margins (maybe negative) and attempt to meet supplier agreements. If they renegotiate supplier agreements the price could jump drastically.\n\nThe whole cost structure was built on a 10,000/week run rate, with far less people on the line. They’ve now hit a point where the poor planning is starting to show. The high ASP in Q3 and Q4 was shielded from this. The high margin cars were always going to be profitable. But they can’t just sell the expensive cars.\n\n(While GA4 let them hit the 5000/week run rate, the lack of automation is probably starting to show on the books with all the extra cost of manufacturing)", "score": 3, "replies": [{"body": "Your points are why I'd love to get a look at how they are actually building cars and where they are making improvements.\n\nPart of the problem is you have a traditional ICE production that was perfected literally over 100 years of development now trying to be replicated by Tesla, but with a company that isn't experinced in this field, it's pushing for high automation and has whole new subsystems they are trying to bring to the mass market.\n\nPersonally I think it went like this\n\n1) Try to make the machine that builds the machine. this failed, you were retired to come and shitpost here\n2) They went the China method [throw bodies at the problem, get'er done!]. this worked well to ramp production and get people cars they wanted.\n3) They realized the China method worked to solve the problem of supply, but now the cost was to high, so they spent Q2 to Q4 (with a reported line stoppage in November) where they optimized the lines, this automated out several hundred people from positions, Layoffs happened.\n4) Slowly I think they are building Gromman robots to replace people a few at a time and optimizing the lines. I think they finally got around to doing this with the heavily people powered S & X  line, which is why they are making 20% less cars, but with one whole shift less of people. \n\nOverall they should have targeted 5k to 6k for the TM3, it would have been an easier ramp, demand would stay steady for a while and then gone full 10k per week on the Model Y. I only work in small scale manufacturing, so this is all guesses, but hey, speculation is why we are there :)\n\nI hope they are spending a lot of time thinking about the Model Y line and how to build it out to make it just churn out cars, but not be overly optimistic. The Model 3 will likely settle in the 250k to 325k range for worldwide demand, some of which will be taken up by GF3 in China, so 5k to 6k steady state in 2020 out of Freemont will be a good optimization of that space and they can be at a pace where quality is kept high. That would be my goal for there. Model y in Nevada at GF1 and steady 8k to 9k per week as I see demand higher. ", "score": 2, "replies": []}]}, {"body": ">>But as long as the product is good, which it is based on numerous consumer experience, the demand will go through the roof.\n\n>Because you can only sell so many $50k+ cars - the market has a limit and Tesla reached it and managed to squeeze a bit more out that most didn't think it could.\n\nWhat.", "score": 6, "replies": [{"body": "> What\n\ngo back and look at the market share for the TM3 in the premium auto segment, it's taken over for the most part (the reached it's limit), the \"squeezed a bit more out of than most didn't think it could\" remark is the cars that people were trading in were many sub $30k cars, they really pushed a lot of people into a new car segment and price class.", "score": 4, "replies": [{"body": "Yes everyone agrees on that. They got a whole new community of enthusiasts to buy the car. The question is will this be sustainable. Right now with the sales data we have it appears they may have over projected the demand for this vehicle.", "score": 4, "replies": [{"body": "How many new car sales happen every year by segment and what is Tesla's marketshare of new sales? ", "score": 1, "replies": [{"body": "Depends on what you call the model 3. The SR shouldn’t be considered a premium car.\n\nAnd to date Tesla has been very successful in selling cars, but they are going through 2 years of pent up demand to do it. Basically 2 years of demand depleted in 2 quarters. Unless March is very different that Jan and Feb.", "score": 4, "replies": [{"body": "I thought the question is sustainable run rate. My assumption is we should base that on what is number of new cars sold in the countries Tesla operates in.", "score": 1, "replies": [{"body": "Oh sorry I misunderstood, idk. There isn’t a car like the Model 3. So it’s a guess.\n\nIdk how to guess at that, there was 44.578 BMW 3 series sold in 2018. And 291.071 Honda accords sold in 2018.\n\nThe accord has a lower price point. But some where between that I’d imagine. \n\nSo between 891/week to 5821/week.\n\nhttp://carsalesbase.com/us-car-sales-data/honda/honda-accord/\n\nhttp://carsalesbase.com/us-car-sales-data/bmw/bmw-3-series-4-series/bmw-3-series/", "score": 2, "replies": [{"body": "[https://www.statista.com/statistics/199974/us-car-sales-since-1951/](https://www.statista.com/statistics/199974/us-car-sales-since-1951/)\n\n&#x200B;\n\n5.3 Million passenger cars in the US. Global market estimate for passenger vehicles is 79 million.\n\n&#x200B;\n\nThat works out to 1.5 Million passenger vehicles sold per week around the world.\n\n&#x200B;\n\nTesla's run rate on model 3 is 5,917 according to the bloomberg tracker which is 0.4% of global sales.\n\n&#x200B;\n\nSimple questions I ask myself as a shareholder.\n\n&#x200B;\n\nDo i think Tesla can capture more than 0.4% of global sales?\n\n&#x200B;\n\nIs Tesla scaling production of their vehicles?\n\n&#x200B;\n\nIs there demand for EV's?\n\n&#x200B;\n\nIs Tesla a leader of the EV segment?\n\n&#x200B;\n\n&#x200B;", "score": 1, "replies": [{"body": "Well they don’t occupy all of the passenger car market segments, and they aren’t offered in every country.\n\nI think it’s much more realistic to look at cars like the 3 series and accord.", "score": 2, "replies": [{"body": "Fair point. \n\nSo this US news source ranks 23 models similar to the model 3\n\n [https://cars.usnews.com/cars-trucks/rankings/upscale-small-cars](https://cars.usnews.com/cars-trucks/rankings/upscale-small-cars) \n\n&#x200B;\n\nFor quickness sakes lets focus on annual sales of luxury brands\n\n&#x200B;\n\nAudi - Lexus - BMW - Mercedes \n\n&#x200B;\n\nAudi 1.8 million\n\nBMW 2.1 million\n\nLexus - 600 Thousand (maybe)\n\nMercedes - 2.3 million\n\nTesla M3 - 230 Thousand\n\nTotal of  7 million cars per year from these 4 brands + the model 3\n\n&#x200B;\n\nThats a weekly run rate of 135K per week. \n\n&#x200B;\n\nModel 3 is at 5,917 = 4.3% of weekly sales globally. \n\nDidnt even include GM, Acura or the Chinese players. \n\n&#x200B;\n\nPoint is I think there is room to grow here\n\n&#x200B;\n\nSource\n\n [https://www.reuters.com/article/us-bmw-results/bmw-says-group-sales-up-1-1-percent-in-2018-idUSKCN1P50PO](https://www.reuters.com/article/us-bmw-results/bmw-says-group-sales-up-1-1-percent-in-2018-idUSKCN1P50PO) \n\n&#x200B;\n\n [https://global.toyota/en/newsroom/lexus/23815085.html](https://global.toyota/en/newsroom/lexus/23815085.html) \n\n&#x200B;\n\n [https://www.google.com/search?q=global+mercedes+sales+2018&oq=global+mercedes+sales+2018&aqs=chrome..69i57j0l5.8390j0j4&sourceid=chrome&ie=UTF-8](https://www.google.com/search?q=global+mercedes+sales+2018&oq=global+mercedes+sales+2018&aqs=chrome..69i57j0l5.8390j0j4&sourceid=chrome&ie=UTF-8) \n\n&#x200B;\n\n [https://www.audi.com/en/company/investor-relations/events-and-presentations/investor-presentations.html](https://www.audi.com/en/company/investor-relations/events-and-presentations/investor-presentations.html) ", "score": 1, "replies": [{"body": "Those are brand with dozens of models tho.", "score": 2, "replies": [{"body": "Yes and they play in the same space. I could also argue that their last investor call disclosed that the Honda civic was one of the top trade in vehicles. \n\nIf you include sedan numbers from other OEMs I'm pretty sure it would make up for the SUVs in these 4 brands. \n\nOr if we cut those numbers in half to account for SUVs  that goes to 8-9% \n\n\n\n\n", "score": 1, "replies": [{"body": "Well that’s a terrible way to view the potential market. But if I concede that for arguments sake, how do they even build enough cars to satisfy that demand? Because right now they are only making about 4500/week over the quarter.\n\n(BTW whenever people start using vague language like “total addressable market size” people tune out)", "score": 2, "replies": [{"body": "Well the brand spends almost nothing on marketing and I don't know how else to measure the demand question if we cant go by orders preorders and sales lol", "score": 1, "replies": [{"body": "The spent 70 million on advertising and marketing last year.\n\n> Marketing, Promotional and Advertising Costs\nMarketing, promotional and advertising costs are expensed as incurred and are included as an element of selling, general and administrative expense in the consolidated statement of operations. We incurred marketing, promotional and advertising costs of $70.0 million, $66.5 million and $48.0 million in the years ended December 31, 2018, 2017 and 2016, respectively.\n\nhttp://ir.tesla.com/node/19496/html\nPage 88", "score": 2, "replies": [{"body": "Out of $21 billion in annual revenue lol \n\nThat is nothing\n\nGM advertising is $3.4 billion in the US alone.", "score": 1, "replies": [{"body": "147,049 in milllons revenue page 60.\n\nThat’s 147B.\n\n> Advertising and Promotion Expenditures Advertising and promotion expenditures, which are expensed as incurred in Automotive and other selling, general and administrative expense, were $4.0 billion, $4.3 billion and $4.6 billion in the years ended December 31, 2018, 2017 and 2016.\n\nPage 53\n\nhttps://investor.gm.com/static-files/54070a3d-55d9-4a0c-9913-7ba9b4d366de", "score": 2, "replies": [{"body": "Tesla is annual revenue is $21 billion and you said they spent $70 mil on advertising which means less than .5% of revenue....which I define as nothing.\n\nGM spends 3% of revenue on ads according to their SEC filing\n\nTesla spends next to nothing and grew revenues 82%\n\nGM  spends 3% to grow rev by 1%  \n\nI think that helps the demand argument. \n\n", "score": 1, "replies": [{"body": "Yup, I’m not hiding those facts. I just put them out there.\n\nBut GM also made a profit. So why are we talking about revenues?", "score": 2, "replies": [{"body": "The question was demand. And I had brought up sales, addressable market and the lack of advertising.\n\nThese are my reasons to believe that demand critics might be misguided based on what we know. \n\nI just brought up rev because you had brought up their millions spent on advertising. But again relative to what they take in its not a lot of money so they don't really advertise the same way as their competitors.\n", "score": 1, "replies": [{"body": "Fair enough, this has gotten off into the weeds.\n\nI mean we agree on the facts, just have different conclusions.", "score": 3, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Yes, no, maybe ... all are true. I think they overestimated the performance $50k market. I personally put this down to the \"California\" effect. You and everyone around you makes really decent money, of COURSE people have no problem spending $50k+ on a car. I see it with my work. I deal with clients from California who's monetary world view is highly skewed compared to the rest of the US. \n\nBut the demand for the $35 to $45k range cars, that is a whole area we have no idea. That covers a large part of the US market and I think demand will be quite decent. Also, as people realize Total Cost of Ownership is much lower, I think we will see more and more adoption. The we are past early adopters, now we are onto first generation buyers. As the cars are used, driven, experienced, people will realize they work out great with little drawbacks.", "score": 1, "replies": []}, {"body": "The higher demand was always based around 35k base version. To early to tell what world wide demand is for that.", "score": 1, "replies": [{"body": "The demand was for a 27.5k car, a car that Tesla was going to have 20% gross margins on.\n\nWe know they can’t make that kind of margin on the SR now. The production issues have driven up the costs. While the high end 3 is profitable, the addressable market isn’t large enough to offset the SR.\n\nHence so many analysts staring to turn more bullish on the stock. Musks own admission that Q1 won’t be profitable, mixed with the 6k shipments per month in the US are starting to show this.\n\nI agree tho we do need to wait a month to get the 10Q and be certain.\n\nBut the layoffs, and store closures was a weird weird ordeal that hint at terrible margins on the SR.", "score": -1, "replies": [{"body": "It was always referred to as a 35k car, there are still incentives and gas and maintain savings for those that value that. Demand appears healthy so far. SR margin will be around 20% when you factor in options like AP.", "score": 2, "replies": [{"body": "The 35K car won’t have adders.\n\nI’ve already stated above the higher sales price cars are profitable. We know this, no one denies this. The issue is Tesla has sold cars with the high selling price, and pulled sales into Q4z\n\nQ1 will be great to see the numbers because the SR will have very little impact. That’s why it’s scary that the company is saying it won’t turn a profit. ", "score": 1, "replies": [{"body": "> The 35K car won’t have adders.\n\nJust nonsense. Very few people buy the absolute minimum stock version of any car. Likely greater than 50% will buy AP, not to mention add on color option. \n\n>Q1 will be great to see the numbers because the SR will have very little impact. That’s why it’s scary that the company is saying it won’t turn a profit.\n\nThey always said Q1 would be close profit or not because of higher cars in transit. They said Q2 would likely be profitable again. \n", "score": 0, "replies": [{"body": "> Just nonsense. Very few people buy the absolute minimum stock version of any car. Likely greater than 50% will buy AP, not to mention add on color option.\n\nSorry you miss understood my point, I simply meant a 35k car won’t have options by definition.\n\nI believe the ASP of the 3 will be near 42k with all models being sold. Once demand stabilizes, it’ll be lower in Q2 and Maybe Q3 while they start the roll out. (That’s US only)", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I'm saying that you contradict yourself in the one comment.", "score": -1, "replies": [{"body": "But I never said that first bit \"**But as long as the product is good, which it is based on numerous consumer experience, the demand will go through the roof.**\" - I've looked and I didn't say it and it's not word cadence I would use.\n\nI think you mixed up two different people's posts. - my reply was to the part you quoted I did write, the depth of the $50k car market.", "score": 4, "replies": [{"body": "Yep, my bad. I mixed your post and the OP's together.", "score": 2, "replies": []}]}]}]}]}, {"body": ">100% impulsive Elon move [re: shutting down retail]\n\nYou think? \n\nActually this move was sneakily alluded to in the [Q4 update letter](http://ir.tesla.com/static-files/0b913415-467d-4c0d-be4c-9225c2cb0ae0)\n\n>...our ongoing cost reduction efforts will also make an impact. Since about 70% of Model 3 customers made a purchase without a test drive in the second half of 2018, we believe we can leverage our retail network further.\n", "score": 2, "replies": [{"body": "I must have missed that, I got distracted by the following.\n\n> During Q4, we opened 27 new store and service locations, resulting in 378 locations worldwide at the end of the quarter. Our largely electrified Mobile Service fleet continued to grow further to 411 service vehicles on the road at the end of Q4. In 2018, the total Tesla vehicle fleet grew by 85%, mainly due to the steep Model 3 production ramp. We see upgrading our service capacity and improving customer service as a top priority at the moment. Where needed, our service centers are moving to two-shift operations in order to double service capacity quickly, and we are simplifying processes in order to increase service throughput. We are also increasing the functionality of the Tesla App for scheduling service in order to improve responsiveness and convenience for our customers. Furthermore, we are changing our parts distribution approach to ensure that spare parts are available in a timely manner at all our service centers globally.\n", "score": 5, "replies": [{"body": "This paragraph is heavily weighted towards service centers vs stores. Any stores they opened were probably key important ones that they wouldn't have closed anyways. Or they didn't really realize the extent to how they were going to \"leverage\" their stores. \n\nI would bet that closing stores and especially chopping commissions had been in the cards for some time.", "score": 1, "replies": [{"body": "Then why were 11 stores opened in December?\n\nhttps://twitter.com/tesla/status/1072297925957554176?s=21\n\nI guess you can claim a 60% weighting for service centers. But those numbers are just December not sure about the rest of Q4.", "score": 2, "replies": [{"body": "Did they re-close any of those? Could just be key areas.\n\nMy main point anyways is that everyone seems to think that Elon is just flying by the seat of his pants and making sudden changes based on a whim. \n\nBut I find that very unlikely. It's more likely that we just didn't know he was thinking about these changes and talking them over with other executives and the board for quite some time.", "score": 1, "replies": [{"body": "Yes they did.", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "Well. I just answered your questions. \nEdit: not directly. But by using the iPhone analogy you have to get the bigger picture. This business is competitive and changes all the time. We cannot and should focus on every little move because we don't have all the info. This exercise is not very wise to me. But other people may think differently, which is fine with me. I am pretty confident though \n\n", "score": 1, "replies": [{"body": "What's the iphone analogy? Was Apple cutting prices and closing stores while they were growing?", "score": 5, "replies": [{"body": "Cutting prices yes, closing stores no. ", "score": 4, "replies": []}, {"body": "It is actually explicitly mentioned in the original comment what the \"iPhone analogy\" is here. Did you mean to explain why you think the analogy doesn't apply rather than asking what it is?", "score": 2, "replies": [{"body": "I understand an analogy was being attempted, but it wasn't detailed beyond just mentioning Iphones. What aspects of Iphone sales/profit/growth/demand are we supposed to find analogous in the Model 3? If it's just that it's a shiny toy that most people would love to own if cost wasn't an issue, I think we're all agreed.", "score": 4, "replies": [{"body": "It's a disruptive product that everyone wants. That's the important part of the analogy. Once Tesla's self driving tech improves much further the analogy will be even better because the software of the toy really sticks. Apple uses it's software to sells hardware and Tesla will use its software to sell cars. Once its software comes to fruition with the number of cars on the road they will make a shitton of money just by selling software whose price will indeed increase.\nGood enough?", "score": 2, "replies": []}, {"body": "> But as long as the product is good, which it is based on numerous consumer experience, the demand will go through the roof. It happened for iPhone too.\n\n", "score": 0, "replies": []}]}]}, {"body": "It's an analogy. It can only go so far. Tesla is different from Apple for sure, if that's what you are saying.", "score": 2, "replies": []}]}]}, {"body": "Don't worry fluff! It will all be alright.", "score": 1, "replies": []}, {"body": "Are those serious questions? Are you not familiar with their roadmap *at all*?", "score": 1, "replies": []}]}, {"body": "Tesla has created its own demand cliff with the introduction of ModelY. It's fine to cannibalize your own products, as long as the product is available or will soon be. A lot of people that would have gone for the M3 now may hold off for the MY, and a year and a half is a looong time.", "score": 0, "replies": [{"body": "You say that but we don’t know how many reservations they have.\n\nIt’ll be interesting to see the reservation amount leaving Q1. Sucks we will have to wait for the 10Q.\n\nThat or wait till the check data comes out showing how many they have processed.", "score": 2, "replies": []}, {"body": "Of course. But it is just part of the market partition.", "score": 1, "replies": []}, {"body": "Yup.  Me included.  I don’t get the model y reveil nor the $39k price with full premium interior. ", "score": 1, "replies": []}]}]}, {"body": "hot off the press!", "score": 3, "replies": [{"body": "Drink every time Gali says “I don’t know”.", "score": 5, "replies": []}]}, {"body": "Gali gets real at [16:25](https://youtu.be/Dc8QKXq9EK4?t=985).\n\nSuper super real at [18:09](https://youtu.be/Dc8QKXq9EK4?t=1089).", "score": 7, "replies": [{"body": "It's funny when the tslaq-folk make fun of the 'let's go to youtube' thing because frankly Gali does have a pretty good grasp on the pros and cons, and is willing perhaps more importantly to actually talk in extended fashion about it. I frankly don't understand the point of the pro sell-side analysts. They perform almost no valuable service to anyone and very little emphasis is on accountability or track record or even requiring them to support their logic.", "score": 3, "replies": [{"body": "I think they are making fun of Musk there for cutting off an analyst and saying “let’s go to YouTube”.\n\nI don’t think they are making fun of Gali when they say that.", "score": 4, "replies": [{"body": "Si claro", "score": 1, "replies": []}]}, {"body": "Sell-side analysts exist to:\n\n1. Promote their bank with bold calls (Jonas is a MS hype machine)\n2. Win investment banking mandates (set ridiculous price targets so company uses them for IB deals)\n3. Be hubs for info and intel (if every hedge funder talks to the same analyst, they are at the center of the info flow...valuable spot to be.)\n\nLuckily for you, the sell-side is going extinct because Europe changed some regulations (MIFID) about what kinds of bank revenue can be used to pay sell-side analysts. ", "score": 2, "replies": [{"body": "Any such changes will have 0 effect on me.", "score": 2, "replies": []}]}]}]}, {"body": "Gali is getting worried about some of this too. He’s right it’s odd. The price changes, the older inventory, and closing the store fronts doesn’t line up with what Tesla was saying even 4 months ago.\n\nEdit:\nAnd yes they need to raise capital.\n\nEdit2:\nI’ll also give him props for doing this episode, and bringing up these issues as real concerns. They are real concerns, and he’s being objective about them. That take a lot of guts, when his followers watch him mostly for Tesla news. Even if you disagree with him, at least he’s putting it out there and not trying to cover it up.", "score": 9, "replies": [{"body": ">That take a lot of guts, when his followers watch him mostly for Tesla news\n\nI really love that he does this kind of stuff, it's very difficult to find a single person who tries to look at both sides of the story at least somewhat objectively. Of course I'm not saying he's not bound to be a bit biased, but who isn't? Started following him pretty soon after I first took interest in the company.\n\nHopefully not too many superbulls got angry with him lol", "score": 10, "replies": []}]}, {"body": "While Gali usually gets more right than wrong, I think he is wrong here, and to be clear, the whole price drop and demand issue is confusing people.\n\nHere is my best guess:-\n\n1. Q1 Model S/X demand down for the following reasons:-\n\n* Europe - Model 3 deliveries / refresh rumours\n* US - Tax credit and other factors pulled forward demand  / refresh rumours\n* China - trade war  with the US and general slowing of the economy.\n\nTesla did well to keep Model S/X demand so high for so long, one of the ways they did that was only selling Model 3 in the US before Q1 2019.\n\n&#x200B;\n\n2. Q1 US Model 3 demand for higher spec cars  is down for the following reasons:-\n\n* Tax credit expiry\n* Demand pulled forward in 2018 for lots of reason.\n* Mix was all higher trims and mainly US deliveries for a long time.\n\nThere was still la backlog of unfulfilled reservations so lots of US Model 3 buyers waiting for \"something\"\n\n&#x200B;\n\n3. Tesla took delivery for the new Grohmann line to make SR/SR+ packs.\n\n&#x200B;\n\nFor 1., 2. & 3. above Tesla decided to start making the SR and to make the price drops. One reason they did that  as they needed to make cars for the US in March and end Q1 with the minimum possible level of inventory.\n\nWhere my opinion differs from many, is that I think 3. above is very significant probably almost as significant as the demand issues. But 1. Model S/X demand is most likely the big story of Q1  2019 IMO.\n\n&#x200B;\n\nSo before price cuts -\n\n* Demand an issue / likely large losses and unsold inventory in Q1 2019 / may need to slow production.\n\n&#x200B;\n\nAfter Price cuts\n\n* Demand no longer an issue / margins are lower but pricing is more sustainable.  IMO outside chance of profits in Q1 can go full speed ahead on production. (Deprecation on the Grohamann pack line is the big driver of improved SR/SR+ margins.... the first 50K is the hardest - so get it done ASAP)\n\n&#x200B;\n\nI think the EAP/FSD debacle as due to the fact that price cuts needed to be announced while European cars were on ships. Some carrot was needed to ensure Europeans did not refuse delivery.\n\n&#x200B;\n\nI see this all as swimming a very difficult river, but now Tesla  is on the other side. This specific combination of circumstance is not likely to happen again, so I am not seeing demand issues or severe financial issues on the horizon for any predictable reason at this stage.\n\n&#x200B;\n\nI this phase I expect Tesla to be focused on rebuilding margins, I don't think they can afford further price cuts or they will be making a loss on each car. if it came to that, it would be better to cut production.\n\nI expect Q1 production and deliveries to be high, we are now getting a sense of that, as deliveries stories are filtering in.\n\nBut Telsa has clearly taken some hit to margin, especially on Model S/X.\n\nI don't think US Garages are a big issue, but there are even fewer garages in Europe, it is an issue like that might slow EV adoption, but it isn't the reason for Q1 price cuts.", "score": 4, "replies": []}, {"body": "I think the whole demand discussion is off. But i share the concerns over the wired back and forth decision making.\n\n* In Europe there is only the LR all wheel available\n* There is no right hand drive version at all\n\nSo why did they put out the LR so fast? (My theory)  \n1. Because they can, it gives reservation holders the opportunity to get one with some tax credit still available and makes them happy.\n\n2. They can produce model 3's faster than expected and therefore have a cell shortage to make all of them LR. Bloomberg tracker shows there could be 7-8k model 3 per week now. But this has to be confirmed.\n\n&#x200B;\n\n&#x200B;", "score": 1, "replies": [{"body": "Your thinking Tesla is cell supply constrained so they pushed out the standard range version to maximize the number of cars they can make with the limited amount of cells?", "score": 2, "replies": [{"body": "Yes this is my theory. I mean they did introduced the mid range because of this before.", "score": 2, "replies": [{"body": "Because they needed to generate more demand by dropping the price point.", "score": 3, "replies": []}, {"body": "Some element of truth in this, but there is no single reason, they have the machine to make SR/SR+ packs and need to use it. they need to drop the entry price point to tap 100% of the demand.\n\nI did expect that might make a non-PUP MR, but I think they want to start making SR/SR+ packs and could not afford to gamble on demand, so they made it a slam-dunk rather than taking any risk.\n\nMainly because a pile up of unsold US inventory in Q1 was the last thing they needed, if there was even a 10% chance of that happening, it needed to be avoided.", "score": 2, "replies": []}]}]}]}, {"body": "10 upvotes and 61 comments...\n\nYet anytime I post an article with no info but cheers Tesla on it get 30+ upvotes.", "score": 1, "replies": []}, {"body": "This is like the video version of seeking alpha ", "score": -2, "replies": [{"body": "Is that because you didn’t like the content it provided? Or simple a comment about the quality of the content?", "score": 2, "replies": [{"body": "Seems like Gali’s been reading too much seeking alpha. That was 30 min of incoherent rambling of fud than anything substantive. Those hedge fund managers that keep emailing him are getting to his head.  I’m sorry but if you think tesla has demand problems, then you simply don’t know what you’re talking about and should probably choose a different line of profession ", "score": -1, "replies": [{"body": "You get that Seeking Alpha has contributors that are long the stock, short the stock, and have no position in the stock right?\n\nTrent Eady, Gio Danish, ValueAnalyst, Ross Tessien and many more are very bullish on the stock. \n\nYou obviously are just regurgitating the things you hear.", "score": 4, "replies": []}]}]}]}]}
