{"title": "Is this the time to buy Boeing?", "selftext": "Trump orders grounding of all Boeing 737 Max Aircraft.\n\nIt feels like this could be the bottom...\n\n\n\nhttps://www.dailymail.co.uk/news/article-6805505/Trump-grounds-Boeing-737-Max-planes-effectively-immediately-crash.html?ITO=applenews", "id": "b0pkgb", "created_utc": 1552502458.0, "score": 29, "upvote_ratio": 0.82, "num_comments": 88, "comments": [{"body": "I can’t afford to buy Boeing. That’s a massive company.", "score": 35, "replies": [{"body": "I was thinking you were talking about the fancy jet for the upcoming anniversary gift for your second mistress.", "score": 3, "replies": [{"body": "No unfortunately I just spent all my money on a “donation” to a prestigious college for..... wait nevermind. Continue on nothing to see here.", "score": 13, "replies": [{"body": "You could have gotten a better deal if you had asked your third misstress to do some volunteer work at college president's residence.", "score": 2, "replies": []}]}]}]}, {"body": "It's at \\~377 right now. It was below 300 less than three months ago. I feel like it could still drop considerably from where it is now.", "score": 48, "replies": [{"body": "Everything was at unbelievably anemic levels on Christmas Eve.  They were at $360 six months ago", "score": 16, "replies": [{"body": "True. I personally wouldn't be comfortable buying at the price it's at now, but around $360 could be a could be a good price to get in if you believe it's a good stock for the long term.", "score": 4, "replies": [{"body": "If you’re buying for the long term, then buying it only 4.5% lower from this level is inconsequential. ", "score": 20, "replies": []}]}]}]}, {"body": "Buy now, but also be prepared to buy more if it dips further.. really the only way you can handle situations like this.. I did it with FB, ROKU, TCEHY.. averaging down works if you believe in the company and just buying stock ", "score": 14, "replies": [{"body": "Agree, I did this with unh and it is bouncing back. ", "score": 2, "replies": [{"body": "Nice man, cause the strategy is simple-stupid. You just always average down your entry price so even while things get worse your still actively buying.. really the heart of long term investing ", "score": 0, "replies": [{"body": "Do you continue  buying if it goes up?\n\n What if you average down so much you run out of cash?", "score": 2, "replies": [{"body": "No i don’t really like buying when it’s higher cause that would raise your avg. entry price. And you can most definitely run out of cash so that’s where you have to be selective at when you average down cause maybe the stock slipped 8% and you bought it up.. but then a day later it dips 10% but you have no cash.. this can definitely happen, I always feel more comfortable when I have cash on hand for sure ", "score": 1, "replies": [{"body": "So when you initiate a position are you buying a half or quarter position?\n\nI assume you don't index invest and are a day trader?", "score": -1, "replies": [{"body": "Basically from a cash flow perspective. I have a weekly amount I transfer to my broker account. I do this so my account always has a steady stream of cash, which is independent of the markets. For the last 18 months or so I’ve been buying companies I believe, in that seem cheap. I do a lot of research (not enough tho) and make purchases I feel comfortable with. I have about 10 companies I’ve bought into, averaged down on like 5 of them. Averaged up on BAC, wish I hadn’t but it’s fine I like there positioning.\n\nI just opened a Roth IRA which i plan to primarily use for dividend stocks I like and will average down for as many years as seems appropriate. \n\nI just recently started options, currently holding my first ever puts on the spy. But I also been researching finance in general for years. Not formally educated in finance however ", "score": 1, "replies": [{"body": "Makes sense. Sounds like you are being resonable with your approach.\n\nI just find it counter intuitive to sell winners and buy losers (within reason). Strong companies will continue to get stronger and either buy out or steal other companies ideas and execute it better. (See snap and FB, or when amazon enters banking). Of course try to time dips but sometimes you could be waiting on the dip for a long time. Especially if you are building a dividend portfolio you should be buying and accumulating a small (under 20 imo) portfolio of strong companies and DCA as you have cash.", "score": 2, "replies": [{"body": "Then so be it. Average up my friend ", "score": 1, "replies": [{"body": "Look at any blue chip stock from 20 years ago that is doing well.. you are telling me you wouldn't have bought on the way up? ", "score": 1, "replies": [{"body": " Ooo ", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "It’s safe to assume Boeing will not go out of business on this one. Assuming an unlimited amount of capital, you could double down continually on losses and be assured to at least break even eventually. \n\nThen again, if you had unlimited capital, you wouldn’t need to buy stocks. ", "score": 1, "replies": []}]}, {"body": "Not yet. We are close. ", "score": 27, "replies": [{"body": "What worse news could there be? The US just grounded the aircraft, everyone else is now green lighted to follow suit. There are only two outcomes here:\n\n1) The aircraft is fine, and the stock will bounce back (and you'll make $$$ buying now).\n\n2) The aircraft has serious issues with its programming, and we have no idea where the bottom will be (bad media and lawsuits to follow).\n\nI'm cool with taking a gamble that the aircraft is fine - Boeing hasn't hedged at all with its public statements. They'd legally be digging themselves deeper if they actually think something could be wrong.", "score": 7, "replies": [{"body": "> What worse news could there be?\n\ncanceled orders", "score": 48, "replies": [{"body": "Bingo!", "score": 18, "replies": [{"body": "“the European planemaker exited 2018 with a backlog of 7,577 planes, representing more than nine years of production.”", "score": 6, "replies": [{"body": "European? \n\nAnyways Boeing’s backlog is 80% 737s so canceled orders could be bad ", "score": 1, "replies": [{"body": "Airbus. The main competitor to Boeing, has a 9 year backlog", "score": 3, "replies": [{"body": "So if an airline thinks a plane is unsafe you think they won’t cancel because the alternative is they have to wait 9 years? \n\nI imagine they would way rather wait the 9 years and deal with an aging fleet then spend hundreds of millions on a plane they are not confident in ", "score": 2, "replies": [{"body": "The airlines that fly them didn’t think they were unsafe. And I’m going to go ahead and say the FAA and others only did this from mounting pressure. Sure, info needs to be gathered and likely non mechanical issues will be fixed... but I do think it’ll come to dollar and cents. Wait for the fixes and resume biz as usual or cancel all you orders and go to your competitor to wait for years?", "score": 3, "replies": [{"body": "No airline would ever come out and say “we think the X amount of planes that we just purchased for over 100 mil each are unsafe” they would put their purchases on hold like a lot of airlines have done and gather information. If they do think the plane is unsafe a 9 year backlog is not going to force them back to purchasing an unsafe plane. As someone stated canceled orders is how it could possibly get worse for boeing ", "score": 1, "replies": [{"body": "I’m going to disagree. Having your only other real option have a massive backlog ....making obtaining a new plane unrealistic, why would you cancel your business with Boeing? As stated above, the plane isn’t unsafe. It’s not mechanical. It needs to update and train pilots.\n\nGuess we will just hav to see what happens ", "score": 2, "replies": [{"body": "The plane isn’t unsafe according to you. Very likely all the problems can be solved by a few minor tweaks but they moved all the weight to the back of the plane and there is a very real chance that this is a design flaw that makes the plane inherently less safe. With 2 crashes already in less than 500,000 flights it would need to not crash for the next 10 million + flights to even get close to the safety record of the older versions 737. Which at its current pace is about the next 40 years. \n\nAs I type this Garuda airlines announces they are cutting orders and looking into switching carriers.  France and China are also looking into switching major orders to airbus", "score": 1, "replies": [{"body": "I don’t see anyone cancelling orders or switching carriers yet. I see a lot of talk, not a lot of action. \n\nBut def send me sources if you see otherwise ", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "You think they’re are going to cancel an aircraft they have planned for delivery to join the massive backlog that Airbus currently has? \n\nThis has not been flagged by anyone as a mechanical issue, the fix appears to be pilot training/software related. \n\n“the European planemaker exited 2018 with a backlog of 7,577 planes, representing more than nine years of production.”", "score": 2, "replies": []}, {"body": "And new orders placed with BA for their other models....", "score": -10, "replies": [{"body": "More like Airbus. ", "score": 4, "replies": [{"body": "Not a chance. The are already unable to meet demand. Most companies won't cancel orders. They will simply wait for a fix. It's a software issue. Wings aren't falling off. \n\nNo different than 2013 with the 787's", "score": 5, "replies": [{"body": "How do you know are you an aircraft engineer, do you work for them or are you just recycling stuff you read on the internet? ", "score": 2, "replies": []}]}, {"body": "Nah. Would take years (heard 6 years to order a new craft from them)", "score": 1, "replies": [{"body": "Do you know what a normal lead time is for such aircraft ?", "score": 1, "replies": []}]}]}, {"body": "Yeah, they’ll just buy the older, less complex planes that don’t need Einstein pilots.", "score": 3, "replies": [{"body": "To be fair, Einstein would have been a terrible pilot. Physicists/Mathematician make lousy operators of routine tasks.", "score": 2, "replies": []}, {"body": "Lufthansa just ordered 40 Boeing 787 today.....TODAY....looks like companies are still buying Boeing products. ", "score": 0, "replies": []}]}]}]}, {"body": "Trump just ordered the grounding. I'm not sure the drop from that has happened.", "score": 5, "replies": [{"body": "BA was up today, bottomed out after the Trump news, bouncing back now that people are buying the dip.", "score": 3, "replies": []}]}, {"body": ">The aircraft has serious issues with its programming\n\nOr could be hardware.  The Ethiopia plane had major maintenance done last month and so its possible the mechanics messed up, or there was a quality defect in hardware.  We won't know until the report is done.  ", "score": 3, "replies": [{"body": "Yes. Makes total sense to blame airline mechanics who haven't messed up a plane before, and not blame the manufacturer of a plane that crashed less than a year ago. SMDH. ", "score": 1, "replies": [{"body": "Because we totally know how and why the plane went down right?", "score": 2, "replies": [{"body": "Having a crash within the first million flights would be beyond coincidence but having 2 well short of a million flights is extraordinarily beyond coincidence. The other versions of the 737 are between one crash every 5 million to 10 million flights ", "score": 2, "replies": []}, {"body": "That was the second plane that went down ", "score": 1, "replies": [{"body": "I know.  I am saying we don't know why.  The FAA said today that both plane crashes where similar meaning they likely had the same issue.", "score": 1, "replies": []}]}]}]}]}, {"body": "Short answer is a complete recall of fleet and production. Boeing pays for every minute they are late to deliver and are grounded.", "score": 2, "replies": []}]}]}, {"body": "Let it settle, it’s going to drop more. I’m certain with all this being in the news it’s going to get lower than 360. I would wait for all this to pass the news and let the stock settle before a buy. ", "score": 5, "replies": []}, {"body": "It’s still higher than it was for 95% of 2018, which was a great year for stocks until December.  Current price is certainly more reasonable than where it went in Jan-Feb, but definitely not a deal. That’s before you even factor in the risk of future lawsuits related to these groundings. One’s already been filed!", "score": 4, "replies": []}, {"body": "No. The worst might be yet to come.", "score": 9, "replies": [{"body": "What else could happen?", "score": 2, "replies": [{"body": "The software fix doesn’t work", "score": 12, "replies": [{"body": "Or the investigation reveals neglect/poor training on boeings part.\n\nEdited to add, my personal theory is that the investigation will reveal that proper training was offered by Boeing, and that the airline didn't have adequate compliance in place to ensure their pilots knew it. There's no way to know until the investigation is complete though ", "score": 17, "replies": [{"body": "Agree. \n\nIt's also possible this past incident was just due to pilot error, and anyone who buys in now before any such revelation could profit quite well, but I just don't have the nerve to roll the dice. I'm a long term investor, so if good news does come around, I believe there will still be time to buy in.", "score": -2, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Very true. I, of all people, should know this since I used to do research and teach interaction design and usability. Often times, pilot error results from poor design. However, many retail investors just read the headlines, so when they see a news story with a \"pilot error\" title, they automatically assume all is well.\n\n&#x200B;\n\nDisclosure: Boeing used to fund some of our research work", "score": 1, "replies": [{"body": "That sounds like a good course, is there anything more that you can share?", "score": 1, "replies": [{"body": "It’s been a while since I worked on that project with Boeing. Nothing related to the recent troubles...I hope", "score": 2, "replies": [{"body": "Oh no. I was interested in well thought out way to think on the topic", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Months of negative news. Lawsuits, etc.", "score": 2, "replies": []}, {"body": "Customers going to AirBus, like Lion Air announced today.", "score": 1, "replies": []}]}]}, {"body": "I bought more. ", "score": 3, "replies": [{"body": "Good luck to you brother ", "score": 3, "replies": []}]}, {"body": "I bought short spreads here.\n\nI feel like this is going to get worse for Boeing before it gets better.\n\nBoeing will likely be held liable for many of the flight cancellations and the costs for grounding the planes. There are also a lot of pending orders for 737 MAX8s still that could be cancelled. Buying here seems very risky for the short term at least.\n\n&#x200B;\n\nLong term its probably a buy, but even that could end poorly as the MAX8 orders are projected to drive almost a 3rd of Boeings future revenue. ", "score": 5, "replies": []}, {"body": "I give it a little longer to see what else bad may come out. Credit agencies and analysts just now really exploring what the financial impact of all this may be (comp to airlines, upgrade costs, and worst: Delayed/Cancelled orders) can drive this lower. I’d rather be too late and catch this back on the upswing than possibly see return to Dec 18 prices. ", "score": 2, "replies": []}, {"body": "There is a way to begin a position while simultaneously protecting from further downside.  However, this requires a trading account since you can’t purchase options in a 401k (to my best knowledge).  \n\nHowever, they report earnings on April 24. If you aren’t in a rush to time the bottom it’s probably best to wait until the end of April to see financial performance, initial reactions to the results, and management guidance before committing at these prices.  \n\nFrom a technical POV this could see some near term strength before selling off further.  Such a scenario would make BA an ideal buy and hold for the next few years. ", "score": 2, "replies": [{"body": "Are you thinking buying shares and long puts?", "score": 2, "replies": [{"body": "It can be as simple or complex as you like.  But yeah, I’d take a certain position common then structure an option spread such that I was either protected to the downside or obligated to buy at a price I want anyway.  Maybe cage the option trade to a certain range.  ", "score": 1, "replies": []}]}]}, {"body": "Give it a few days and buy on the upswing to avoid the inevitable losses of the next couple weeks.\n\nDisclosure: Bought Equifax after their crash and it took me a long time (for me) to recover the losses of the following few weeks.\n\nPersonally, I'd wait. I'm gonna add them to a sim and see what happens over time.", "score": 1, "replies": []}, {"body": "well advice I would give is that it's rly hard to predict a bottom, so should always enter with a percentage of ur planned total just to begin a position. Technically speaking, I think \\~372 as a critical support level and it's trading at 377 atm. Hence, if it doesnt break 372, should be a good time to buy and see if it bounce from there, if does then prob look at next support and double down from there. ", "score": 1, "replies": [{"body": "also a very elementary way to see % of ur investment is using the Kelly criterion (can google urself). it's very inaccurate but still better than nothing lol", "score": 1, "replies": []}, {"body": "Broke 372 Tuesday and Wednesday ", "score": 1, "replies": []}]}, {"body": "What are your analysis reasons? are you buying just because you \"think\" it bottomed out? If you haven't done a proper analysis of the company then it makes no sense to assume this is as low as it goes. just because a glass floor breaks doesn't mean you've landed on concrete. You've gotta look down first to see what's there.", "score": 1, "replies": [{"body": "I work full time in the investment world. I do analysis all day long and when it comes to my PA, I try to do the same. But when it comes to certain investment decisions.. headline risk is literally the driving force behind price movement. I had a feeling that might be the case here... could be wrong, but just a guess ", "score": 2, "replies": [{"body": "I see where your going and sometimes I like to bet on how I think mr. money thinks too. So avoiding financial analysis, honestly I don't **think** it will  fully bottom out quite yet, but this will be a temp bottom.\n\nbut I feel like just knowing people this could definitely be a temporary bottom until the numbers show the full scale  of the damage. I just think people tend to underestimate the damage an incident can cause to a big company untill they see it. Whether that's from them announcing something or from the finical sheet, I feel like that will be when shit really hits the fan.", "score": 1, "replies": []}]}]}, {"body": "As a BA stock holder, I think the bottom could be $325-$340 but now isn’t a bad time to buy, it’s gonna be $400+ by the end of the year (barring a bear market or recession). \n\nIf I were giving advice it would be wait until next week and see what it’s at since I don’t think it’s bottomed out yet. ", "score": 1, "replies": []}, {"body": "The main reason why I wont touch this stock anymore is that the passengers are afraid. Even they will fix all issues, how they will convince the people? I guess it will take around 10 years to get the reputation back. Meanwhile Airbus wins.", "score": 1, "replies": []}, {"body": "Just to be clear, is the general intelligent consensus that foul play was the reason for the planes going down and nothing actually to do with the planes themselves, but because of the politics behind that assumption it's safe to say it's possible this is all Boeing's fault?", "score": 0, "replies": [{"body": "No", "score": 3, "replies": []}, {"body": "Looks like pilot error and insufficient training on the new anti-stall features. Not sure how this could be seen as “foul play”", "score": 2, "replies": []}]}, {"body": "Is this question going to be asked 3 times a day", "score": -3, "replies": [{"body": "As relevant new information comes out, it’s a fair question to keep asking ...", "score": 8, "replies": []}]}, {"body": "The time to buy was late 2018 if you believe that the bull run will continue.", "score": 0, "replies": []}, {"body": "Buy ITA (iShares Dow Jones US Aerospace & Defense ETF) for now and wait for BA if you're unclear that it hit the bottom ", "score": 0, "replies": []}]}
