{"title": "Which stocks are you picking up tomorrow?", "selftext": "so late to the game but looks like ill be picking up some AMD, and aurora cannabis :D ", "id": "5ykwqi", "created_utc": 1489132694.0, "score": 3, "upvote_ratio": 0.67, "num_comments": 11, "comments": [{"body": "I'm picking up UAL (United) because of the recent pullback", "score": 2, "replies": []}, {"body": "Kroger", "score": 2, "replies": []}, {"body": "Selling GM, JPM and Enbridge. Taking about 25% off the table from these positions and buying GLD and XLB, Canada long bond ETF. ", "score": 2, "replies": []}, {"body": "Why [Aurora](https://www.google.com/amp/seekingalpha.com/amp/article/4052424-aurora-cannabis-poor-results-mismanagement)?", "score": 1, "replies": [{"body": "it was between aphria and aurora. I wanted one weed stock in my portfolio and with legalization approaching, it felt like a good fit. A trusted friend recently visited their facility and said it was amazing and and they've found ways to make their plants grow pretty darn fast. There are so many weed stocks like WEED, MJN, TNY, TPB, so it took a while to figure out which I wanted to get. Hopefully I don't regret my decision....still fairly new to stocks but after practicing for several months, I figured I'd just jump in.", "score": 2, "replies": [{"body": "You should get Canopy instead.   Highest market cap ", "score": 2, "replies": []}]}]}, {"body": "I'm curious of why you are investing tomorrow? I have been watching this stock for a little bit and would like to know from someone else why to invest now? ", "score": 1, "replies": [{"body": "finally got the funds for it haha", "score": 4, "replies": [{"body": "haha I feel good luck man! ", "score": 2, "replies": [{"body": "thanks! :D", "score": 1, "replies": []}]}]}]}, {"body": "mighty late to the game", "score": 1, "replies": []}]}
{"title": "Anyone else have problem with throwing money away?", "selftext": "While I do like my 3x ETFs and AMD, it seems I have problem with throwing money at whatever ticker that shows up here. \n\nAnyone else have this problem and would like to share their feelings with me?", "id": "5yjbmx", "created_utc": 1489110420.0, "score": 6, "upvote_ratio": 0.75, "num_comments": 9, "comments": [{"body": "[deleted]", "score": 19, "replies": [{"body": "yeah but how do I get good at gambling", "score": 6, "replies": [{"body": "Gamble more.", "score": 17, "replies": []}]}]}, {"body": "Only throw away what you can afford to lose", "score": 3, "replies": [{"body": "My brain thinks that since I made gainz for that day, I can afford to go balls to the walls on crappy ER plays. :( maybe I'll hit it big one time", "score": 3, "replies": [{"body": "just keep doing what you're doing.  you can't lose twice in a row forever", "score": 7, "replies": [{"body": ">“There's an old saying in Tennessee — I know it's in Texas, probably in Tennessee — that says, fool me once, shame on — shame on you. Fool me — you can't get fooled again.”", "score": 5, "replies": [{"body": "God I miss that fuckers lines. He was a fucking gold mine.", "score": 3, "replies": []}]}]}]}]}, {"body": "Portfolio 50% down after buying penny shares of some shitty companies, won't do it again, though. I'm all about 3x ETFs now + the bullish AMD. And I always have stop losses, so even if the stock goes down, I won't lose a significant amount of money. ", "score": 2, "replies": [{"body": "Isn't all significance psychological?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}]}
{"title": "How to exploit a position you are already up on?", "selftext": "Suppose you got in NVDA at like 30 and you watched it spike to 120 and now it's just sorta screwing around in the high 90s even though last earnings was a blowout.\n\nYour expectation is it will probably start going up again but not for a few months since (like AMD) no stock goes up that quickly for that long without giving up some of the gainz at some point. It needs to find a new floor. How do you take advantage of where you're already at? \n\nMy only idea here is that you'd write covered OTM calls on it and just collect the option price as they expire worthless. If they actually get called then you just lock in the existing gains - but you need a lot of shares to make this worthwhile (I think). What's the savviest most autistic play you can think of?\n\nEdit: some words\n", "id": "5yjf8x", "created_utc": 1489111598.0, "score": 15, "upvote_ratio": 0.79, "num_comments": 20, "comments": [{"body": "thats correct strategy, you need at least 100 shares", "score": 10, "replies": [{"body": "So you have 100 and (for example) write 1 March 17th call @ 108 for for 14 cents and pocket $14? That's not exactly YOLO but just making sure I have the idea right.\n\nEdit: suck at typing", "score": 3, "replies": [{"body": "You got it.  And covered calls are generally never going to be yolo, its an income trade.  Obviously the closer to the money you write it the more likely you miss out on a pop but only if it really pops will you not have a chance to continue to collect by rolling at that lower strike (i.e., if you wrote a $100 call right now it would have to go well above $100 for you to not be able to roll calls at $100 and still collect something.  You can also roll up prices over time)\n\nIf you haven't held the underlying stock for more than a year then you should also aim to get it there so you get long term gains tax treatment if and when you do get called", "score": 7, "replies": [{"body": "Good stuff. By 'roll calls' do you mean I'd start buying calls around where I got called at and just open/close out as the stock keeps rising?", "score": 1, "replies": [{"body": "Close the one you wrote and write a new one further out.  So, if you write a call for next Friday lets say:\n\n1. If it's going to easily be out of the money still you probably still want to close it Friday morning-ish (buy it back for no more than 0.05) so that you can write a new one for the next week that still has some decent time premium on it\n\n2. If NVDA pops and it goes ITM you'll want to roll it some time before Friday so you don't happen to get assigned (generally you don't have to worry about that happening early but not worth risking it just to see if NVDA goes down on that Friday)\n\nI don't know the NVDA options market. Seems pretty robust at a glance so you should be able to do pretty well rolling week to week.  You'll just want to take note of when their next earnings release is predicted to be and take extra care writing an option past that week (but you should still write one in that week because you'll collect a lot of premium)", "score": 4, "replies": [{"body": "If it pops and goes ITM do I end up w/ a loss there when I roll it since the price on the option will now be higher than what I wrote it for? Or no, since (if) it went up past my strike then the options I need to 'buy back' are also OTM so now can be had for .05 (in your example)?\n\nI think I get these concepts and have education in this area but still feel like a damn idiot sometimes.", "score": 1, "replies": [{"body": "You would most likely lose money on the call you wrote.  So like (making up numbers) if you wrote a 105 call and got 25 cents for it if NVDA goes past 105.25 you'd have to pay more than 25 cents to roll out of it.  But, covered calls are all about the long term net so I generally don't think of the fact I lost money on that specific call\n\nI would encourage you to go through the various training modules on tastytrade they're really the best at laying this all out visually", "score": 5, "replies": [{"body": "OK I see what I mixed up on the previous post. Got it. Probably.\n\nI'm already inclined to check out tastytrade based solely on the name. Thanks for all the help.", "score": 1, "replies": [{"body": "Don't forget to consider commissions also if you're going very OTM.  If you're not collecting real enough dollars net of commissions then really you're just taking risk.  With something like NVDA that's a tech company and could randomly be acquired anytime you want to make sure your calls are worthwhile", "score": 3, "replies": []}]}]}]}]}]}, {"body": "So just to clarify this as I don't know about options. If you write a say 108 mar 17 call on NVDA but you think it's going over that and want to get out of that trade I can just buy a 108 mar 17 call and it cancels out the one I wrote? \n\nOr is the idea that if I get exercised on I can just exercise the call I bought to cover it? ", "score": 1, "replies": [{"body": "So you're writing the option.  Which means YOU can never exercise the option. Exercising it is the choice of the person that bought it from you.  Everything is backwards from buying an option.\n\nSo, if your goal here is to keep your NVDA shares for the long term and just collect some income you should write the call at a strike you don't think it will go above by expiration.  Figuring that out is, of course, the whole trick to this, but you can study up on implied moves and standard deviations probably of profit and such\n\nBut,  if you write the 108 thinking it won't go past that, and it does you then have to \"manage\"  So you have to get rid of that short call before expiration, otherwise, since it's in the money, your shares will be called away (you will sell 100 shares at $108 each)\n\nSo the simplest way to manage is to \"roll\"  So you buy back the short call and write another short call for a later date.  To answer your question, yes, to close/cancel out the short call you're buying 1 of the same call\n\nI can't speak to NVDA specifically but, generally, if you write a call and the stock goes SOMEWHAT past it, you shouldn't have any issue rolling.  But if it goes WAY past it. Let's say NVDA announces they're getting acquired at 150, you wont really be able to roll much more.  You'll basically be stuck at 108 forever\n\nThat's the main risk of call writing, is mising out on big upside", "score": 1, "replies": [{"body": "Ok I think I understand just not sure of the actual mechanics I guess. Haha thanks", "score": 1, "replies": [{"body": "Only way to learn is to do, write a very OTM call for next week, even if you lose a few bucks you can get a sense of how things work", "score": 1, "replies": [{"body": "Thanks! I'll give it a go", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Annualized, if you were writing those biweekly and never got called, and NVDA stagnated for the whole year, it would give you a 3-4% return on an underlying that didn't move. With moves downwards it gives you a cushion on what would be a loss (even if it is a dip in the long run). With moves upwards, depending on how fast, it might cap your upside gains, but with slow steady growth it wouldn't even impede that.\n\nNo not yolo, but it's not supposed to be.", "score": 3, "replies": []}, {"body": "You might also want to look at https://www.stockoptionschannel.com/symbol/?symbol=NVDA&month=20170317&type=call; it's a nifty site that can give you a bit more specific info about writing options for income on a specific security.", "score": 1, "replies": []}]}]}, {"body": "Here's the real way to exploit gains. \n\nTell wealthy people you know about your gains. Be prepared to prove it. They will want to share in your mystical and illusive abilities to beat the market.\n\nTake thier money and start a hedge fund. \n\nCharge a percentage, regardless of profit or loss. \n\nPut the money into SPY, or similar instruments. \n\nHope market continues going up. \n\nProfit off the commissions. \n\nIf something goes wrong, go all in with the whole fund on some SPX options. If you lose it all say sorry and go back to whatever you do now for money. If you guessed right then you're golden.\n\nOr I guess you could sell covered calls but it's kinda gay. All you do is cap your gains for a few dollars and can end up losing a good percentage of the premium to brokerage fees. \n\nReally the only sure way to lock in gains is to sell and move on. \n ", "score": 3, "replies": [{"body": "That's more what I expect from this sub ", "score": 3, "replies": []}]}, {"body": "Establish key pullback levels through price action. Re-enter at those levels. \n\nAt least that's what I constantly do for futures...options are a different matter, but I don't trade those.", "score": 2, "replies": []}]}
{"title": "$BAC says Au will jump $200 by EOY", "selftext": "http://www.cnbc.com/2017/03/09/gold-to-jump-200-by-end-of-the-year-bank-of-america-says.html\nI mean if they say it then it must be true?\n\nAll in on JNUG time after it hits ~$4 tomorrow?", "id": "5yk5ks", "created_utc": 1489120819.0, "score": 12, "upvote_ratio": 0.8, "num_comments": 13, "comments": [{"body": "After this rate hike my portfolio will be 80% JNUG. ", "score": 6, "replies": [{"body": "why wait?", "score": 1, "replies": [{"body": "I don't enjoy bag holding", "score": 1, "replies": []}]}]}, {"body": "everyone here and StockTwat is expecting Jnug to hit 4s then bounce back.\n\ntheres gotta be an inverse play here somewhere", "score": 4, "replies": [{"body": "Wait until it hits 3", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Jumped in long ago with a healthy current average of 10.25 ^kill ^me", "score": 13, "replies": [{"body": "Jesus, suprised you haven't done it already ", "score": 3, "replies": []}, {"body": "lol", "score": 2, "replies": []}, {"body": "now would be a good time to average down", "score": 2, "replies": [{"body": "That's what they'll say when it hits $1.", "score": 1, "replies": []}]}, {"body": "my condolences ", "score": 1, "replies": []}]}]}, {"body": "JDST or JUNG bro, if jung hits $4 i'm in.", "score": 3, "replies": []}, {"body": "You might be better off just doing vertical spreads on $GLD; that way, you're betting on the price of gold itself rather than the performance of companies that are involved in gold mining.  Buying the 3/31 $115 and selling the 3/31 $117 opens you up to 216% profit if gold goes up  2.3%, and you break even if it goes up 1%.\n\nhttp://opcalc.com/8yQQ", "score": 3, "replies": []}]}
