{"title": "Ladies and gentlemens, it's officially time to panic (DD)", "selftext": "[deleted]", "id": "4puqu9", "created_utc": 1466893802.0, "score": 198, "upvote_ratio": 0.79, "num_comments": 191, "comments": [{"body": "[deleted]", "score": 351, "replies": [{"body": "I've never been more confident lol", "score": 57, "replies": [{"body": "With this post we kind of know for certain that FS is trolling... 2100 not until next decade? Is this some kind of joke... Never mind S&P 7% historical growth for more than 100 years and the fact we are already flat for more than a year", "score": 8, "replies": []}, {"body": "Agreed!", "score": 2, "replies": []}]}, {"body": "YES!!! It's like groundhog day all over again fscomeau saw his shadow and is running for cover! Bull market here we cuuuuuuuuuuuuuuuum!!!!!!1111111111", "score": 3, "replies": []}, {"body": "[removed]", "score": -18, "replies": [{"body": "wait are you saying you *didn't* perform a day's worth of analysis before?", "score": 220, "replies": [{"body": "LMFAO ", "score": 15, "replies": []}]}, {"body": "Rally until December. Nice!", "score": 59, "replies": []}, {"body": "Username checks out", "score": 31, "replies": []}, {"body": "> I spent the entire day doing my analysis \n\nfucking hilarious.", "score": 15, "replies": []}, {"body": "You can't just spend a day. This is something that very well paid experts at the top of their field spend their entire lives trying to predict. You're trying to predict the movement of massive entity, with billions of variables effecting it. You can't do short essay to describe, 99.99% of the population can't even come close to fathoming its scope. Doing shit like this is stupid and you deserve to lose whatever is left of your money.", "score": 50, "replies": [{"body": "Stop feeding the troll.", "score": 40, "replies": [{"body": "How are you going to do inverse fs if he doesn't post? ", "score": 9, "replies": []}]}, {"body": "Yah, something like this needs a week at least.", "score": 8, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Fuck off\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 9, "replies": []}]}]}, {"body": "You hit the nail on the head here.", "score": 5, "replies": []}, {"body": "they spend their entire lives predicting it and still get it wrong.\n\nguess what there's only two directions, flip a fucking coin", "score": 1, "replies": []}]}, {"body": "You said so yourself the market/news/forecasts/predictions are not always right.  Like yesterday.  They all said GB would remain.  They didn't and you lost.  Still love you though but GFY. ", "score": 12, "replies": []}, {"body": "\n>The stock market is doomed for at least 4-5 months.\n\nhahahaha\n\n", "score": 11, "replies": []}, {"body": "Here I was thinking about buying more securities, now you've convinced me to go through with it. ", "score": 8, "replies": []}, {"body": ">sells out in a panic at market open losing $20k\n\n>spends the rest of the day trying to justify his previous move\n\nSounds good man", "score": 8, "replies": [{"body": "This guy has a RH account with $350 in it and he lost $127 on Brexit. No chance he has that kind of money and can be so fucking stupid. ", "score": 6, "replies": []}]}, {"body": "How can you say that? Once Britain invokes article 50 they have up to two years to negotiate a new treaty. Which is when new tariffs, and trade regulations would be created. \n\nIm not going to claim to know what will happen because no one does. But these events will carry on longer than the next five months. ", "score": 6, "replies": [{"body": "Regrexit", "score": 1, "replies": []}]}, {"body": "Lol you're a noob and a half. Go play while the adults do the work. ", "score": 4, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "its all mixed concepts, none guaranteed,  some bad guesswork mixed.  Not very 'researchy'  at all though beer does help to not give a shite", "score": 2, "replies": []}]}, {"body": "Okay got it, double down on calls", "score": 3, "replies": []}, {"body": "Fucking guy, you're attitude is a perfect reflection of the market right now. You let that thing play you like a fool. If the market was a king you are a silly pawn.", "score": 3, "replies": []}, {"body": "OH SHIT i was ready to sell before i saw the god himself was the poster", "score": 2, "replies": []}, {"body": "But I just read you saying that S&P will never drop below 2100. I'm so confused.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Every time my stocks go down 3+% I will buy a significant amount to drop my averages. I hope you're right. Because when that sweet rebound comes, I'll be sailing the Atlantic to go thank everyone in Europe on my 125 ft yacht. ", "score": 2, "replies": [{"body": "You either have infinite money to do that or you don't have enough invested to be worthwhile.", "score": 0, "replies": [{"body": ">not dollar-cost averaging your investments when markets take a shit \n\nEwwwwww", "score": 3, "replies": []}, {"body": "I have salary. I put 10% in my 401, and I invest a good portion. Usually, I try to do fa and ta to find gem stocks, but in a big downturn, i would double down on no brainer stocks. ", "score": 1, "replies": []}]}]}, {"body": "What about long on a company that sells gold?", "score": 1, "replies": [{"body": "Why try and pick stocks like that when you can just go gold or short SPX? You're increasing the chance of something weird happening if you go with a single stock. Maybe they're cooking the books? I really dislike single stock investments.", "score": 1, "replies": []}]}]}, {"body": "DOOMED!!! DoooOOOomed I tells ya!\n\nLast week:\n\nRIGGED! RiiiIIIiged I tells ya!\n\n\nSeriously who let this mentally ill kiddie fiddler out of the institution? Fucking liberals", "score": 1, "replies": []}, {"body": "4_5 years* right ", "score": 1, "replies": []}, {"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "OMG thank you. Going 200% on long positions on Monday. \n\nInverse-FScomeau strikes again", "score": 158, "replies": [{"body": "God help us the day he tries to inverse himself.", "score": 28, "replies": [{"body": "what if this is exactly that ruse, tho?", "score": 10, "replies": [{"body": "It's not. Too many words. Buy SPY calls on Monday for the old Inverse Comeau Maneuver.\n\nIt's tried and true.", "score": 5, "replies": []}]}, {"body": "Depending on whether his inverseness is coming from his initial thought or his character as a whole, that could also mean it'll just invert again?", "score": 1, "replies": []}]}, {"body": "Casual. I'm buying 10000 OTM $SPY calls 50 points from the strike price. I believe in you fscomeau", "score": 2, "replies": []}, {"body": "Good thing I went long Lloyd's on Friday. 😉", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 131, "replies": [{"body": "xd glad u enjoyed my due dillegence xd we r just like real analysts \n\nhaha i love D", "score": -16, "replies": [{"body": "You probably can't even do real analysis.", "score": 3, "replies": [{"body": "yeah i mean nothing close to the brainwork that I see on this sub", "score": 0, "replies": []}]}]}]}, {"body": "*Market unexpectedly recovers*", "score": 86, "replies": [{"body": "*S&P sets new all time highs*", "score": 17, "replies": []}]}, {"body": "Fuck. I'm liquidating all my shorts on Monday. Fuck you guy. Fuck you so hard. ", "score": 67, "replies": [{"body": "I was happy to read like minded thinking, but then I read the username and my heart sank.\n\nIm genuinely worried for my puts and where SPY will open Monday now.\n\nI thought he was leaving ffs.", "score": 20, "replies": []}]}, {"body": "[deleted]", "score": 43, "replies": [{"body": "What he meant is the way he does it is less risky. \n\nWhen he buys puts its probably leveraged like crazy and short term. \n\nWhen he shorts, he's at least limited to the margin requirements. ", "score": 2, "replies": [{"body": "But buying puts his losses would be limited to cost of the contracts which should be better than an indefinite amount?", "score": 4, "replies": [{"body": "Yeah, in theory. But in practical models the S&P 500 likely won't be up 100% in the next month. \n\nThis guy likely puts 100% of his account into short term puts. \n\nIf the S&P increases 15%, he'd lose 80%+ of his account. But by shorting the S&P via spy he'd be down 15%. \n\nIn theory you're right. But in practice (especially the way these hooligans \"trade\"), puts give far more leverage than outright shorting. Hence in a sense it can be called \"less risky.\"\n\nIf people were sizing positions properly, then you're right a put that controls $20,000 worth of $SPY had FAR less risk than $20,000 short $SPY. \n\nBUT the way this guy trades, he's looking at it as he can either buy $20,000 worth of puts (controlling more like $400,000 worth of $SPY. OR he can short $20,000 worth of SPY. \n\nThe puts in this scenario are far more volatile for his account. Just gotta put yourself in the mind of FsCmacau to understand what he means by \"less risky.\"", "score": 4, "replies": []}]}]}]}, {"body": "DD = dear diary", "score": 43, "replies": [{"body": "Donald Duck ", "score": 5, "replies": []}, {"body": "Double down.", "score": 2, "replies": []}]}, {"body": "> I believe we will not see the S&P500 above 2,100 for a very long time - at the very least until the end of this decade.\n\n[Gentlemen, you've just seen the S&P500 under 2,100 for the last time in your life.](https://www.reddit.com/r/wallstreetbets/comments/4m8k6d/gentlemen_youve_just_seen_the_sp500_under_2100/)\n\nI can't tell if you're bi-polar, trolling, or just straight retarded.", "score": 58, "replies": [{"body": "The first and the third probably ", "score": 13, "replies": []}]}, {"body": "Well inverse fscomeau it is, definitely after his brexit prediction.", "score": 57, "replies": []}, {"body": "Where's that guy who keeps a tally of how many times this has happened", "score": 29, "replies": [{"body": "Paging /u/chainsaw_vasectomy ", "score": 14, "replies": [{"body": "[deleted]", "score": 20, "replies": [{"body": "32.33% repeating of course.... LEROYYY JENNNNKIIINNNNSS", "score": 9, "replies": []}]}]}, {"body": "reddit's fuckin shit yo", "score": 10, "replies": []}]}, {"body": "THANK THE GOD'S. I was a little bit concerned about the market grinding lower and lower over fears of Europe destabilizing further. But now I can rest easy. \n\nDo you really think big money traders and investors haven't been watching/managing thier portfolios through the Brexit because they're on vacation? You think they'll \"come back\" from thier apparently 3 month vacations in September/October and be like “Holy Fuck, UK left the EU while I was on that Beach all summer with no cell service or wifi! I'm selling immediately.\" \n\nYou've been wrong a staggering amount of times. I hope you don't, by some ridiculous coincidence, actually make a right call for once and the market collapses. Not while I'm still long at least. \n\n", "score": 52, "replies": [{"body": ">Do you really think big money traders and investors haven't been watching/managing thier portfolios through the Brexit because they're on vacation? You think they'll \"come back\" from thier apparently 3 month vacations in September/October and be like “Holy Fuck, UK left the EU while I was on that Beach all summer with no cell service or wifi! I'm selling immediately.\"\n\nNot quite like that but I can surely see how entire trade floors just got one directive: FUCKIGN SELL EVERYTHING WE HAVE AND BUY GOLD. Retails doing the same.  For the smart money this is now a steam stock sale with high discounts.", "score": 5, "replies": [{"body": "That is not what's happening", "score": 2, "replies": []}]}]}, {"body": "Don't do it man.\n\nI read this well researched article by a guy called fscomeau that said you shouldn't try to short the market. You should read it.\n\nhttp://www.fscomeau.com/seriously-guys-stop-trying-to-short-the-market/", "score": 17, "replies": [{"body": "Wow the first section of that article where he compares stock market movement to a completely random roulette spin may be one of the stupidest things I've read in my entire life.  And I don't even put *much* stock in TA.", "score": 3, "replies": []}, {"body": "Whoa!  He has a website!", "score": 2, "replies": []}]}, {"body": "> I am going to massively short the S&P500 by short selling the SPY, which I think is less risky than buying puts / definitely less than selling calls.\n\nI'm starting to think Fscomeau is actually just a master of satire.", "score": 11, "replies": []}, {"body": "Thanks m8 this makes me feel better about my long positions.", "score": 9, "replies": []}, {"body": "You call this DD? This is simply emotional guesswork.\n\nEDIT: Oh, LOL this is a fscomeau trash post. ", "score": 8, "replies": []}, {"body": "Fuck... I was thinking of shorting, but after this post, going long! ", "score": 6, "replies": []}, {"body": "wait, didn't someone post something about it being the last time we'll see S&P below 2,100? Now you're telling me its its not? Who do I believe? ", "score": 7, "replies": []}, {"body": "RIP in peace to my GDX calls.", "score": 4, "replies": [{"body": "It's like whatever would be the opposite of the Midas effect.", "score": 1, "replies": []}, {"body": "Short gold", "score": -1, "replies": [{"body": "Wait, are you suggesting gold will fall with the markets? Are you expecting the USD to strengthen significantly?\n\nMaybe my calls are safe after all.", "score": 3, "replies": [{"body": "at this point you'd be better of watching the markets than working with this chowder.  USD should strengthen in relation to drop in other currency but a long run like US market has had is not guaranteed to escape unwinding.  Basically anyone with less than a billion doesn't know for sure.  A billion buys a lot of insider knowledge.", "score": 1, "replies": []}]}, {"body": "gold is usually at risk of getting stronger in face of either weakening currency or weakening markets", "score": 1, "replies": []}]}]}, {"body": "Glad to see you back you cunt.  Best of luck.  Hope you learned something from your loss mate", "score": 7, "replies": []}, {"body": "SHITTTTT\n\nI was betting on it going down further. I don't know how it's possible for you to be perfectly wrong 100% of the time, but you seriously have me worried. I hope you are right just this once. This market needs to go down. The rally has been relentless.", "score": 10, "replies": [{"body": "A Broken clock is right twice a day.", "score": 4, "replies": []}, {"body": "A Broken clock is right twice a day.", "score": 3, "replies": []}]}, {"body": "its not exceptionally often when you come across someone from whom you're so evidently taking money...", "score": 4, "replies": []}, {"body": "I'm going to inverse inverse fscomeau", "score": 4, "replies": []}, {"body": "Inverse WSB means buy calls with student loan 3x", "score": 5, "replies": []}, {"body": "[removed]", "score": 14, "replies": [{"body": "Don't you see the value in that, though? I regret not using him as a practical indicator, especially the night before Brexit. If he's always perfectly wrong, he's a fantastic tool for us all.", "score": 26, "replies": [{"body": "In all seriousness I don't think he's wrong this time.  His claims of certainty are bogus, but there is are a lot of indicators for the short side in the medium term.  \n\nS&P just topped at the same height for a 3rd time.  This time followed with a big definitive decline with massive volume.  This, coupled with global financial uncertainty suggests we may not get to 2100 again for a little while.", "score": 7, "replies": [{"body": "> \n> \n> S&P just topped at the same height for a 3rd time.\n\nThird time? It's been rejected off 2100 like over twenty times already. ", "score": 3, "replies": []}]}]}, {"body": "I don't want him to stop, because then I would stop having easy positions to take advantage of. ", "score": 4, "replies": []}, {"body": "If he's wrong in everything, then he's also right in everything if you go the other way.", "score": 1, "replies": []}, {"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Woah, he's actually trolling... Right...?", "score": 3, "replies": []}, {"body": "Gfy", "score": 3, "replies": []}, {"body": "Holy shit you're bad at this.", "score": 3, "replies": []}, {"body": "BUY BUY BUY", "score": 3, "replies": []}, {"body": "That guy had a canoe ", "score": 3, "replies": []}, {"body": "\"Look at the february low, where we barely stood above the 1,800 mark. You really think we aren't going to break that? Name me ONE thing that has improved since then, ONE thing that changed or improved. You know the answer? None. Not a single thing is going better since the February low. And somehow we bounced anyway?\"\n\noil", "score": 3, "replies": []}, {"body": "I was about to call you an idiot but then I read the name of the OP", "score": 3, "replies": []}, {"body": "My guess is you're right, but you're wrong about timing.\n\nFriday was a bad day because.. well it's Friday, and news was on Friday. Bad news friday makes a bad stock day, and not knowing what's coming from the UK on Monday is more than enough incentive to get out over the weekend.\n\nUnless the UK posts some royally bad news on Monday morning while we're all sleeping, we're very likely to see a small bounce out of the SPY. So if you go into Monday with a heavy short against the stock (which you shouldn't do in shares, btw, any idiot knows this), then you're likely to panic sell and eat a loss.\n\nThe trick will be to time when the SPY will stop it's bounce and continue a down trend. I'm just guessing, but if it's not Monday, it probably won't be until Thursday before it starts heading down again on account of the three day weekend.\n\nWill it recover to where it was before? No. But is it going to keep selling off like it did? I somewhat doubt it.\n\nBut I would say from the 202.95 close AH on friday night, we'll see a recovery to the 204-205 range and a lot of sideways trading for the week.\n\nWe likely won't see below 200 until more bad news comes out and another round of panic selling starts, or we slowly descend past 200.\n\n\nIn the short term, Brexit means very little for the US. Unless the current PM comes out and steps down before October, I doubt you'll see much more heavy downside, and definitely not the 1800 mark.", "score": 3, "replies": []}, {"body": "In the event you are serious... why are you fucking shorting SPY? Shorting a fucking 3x bullish etf of spy... such as SPXL...", "score": 3, "replies": []}, {"body": "My inbox was blowing up Thursday night from \"experts\" like this guy predicting a 15% drop in the S&P on Friday alone.\n\nIronically, they were all in a panic saying the market is irrational and will overreact to Brexit. ", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "> That's it. I lost everything.\nI'm done. I apologize to everyone I might have annoyed/irked/harmed in any way. It never was my intent.\nI'm done. Done, done, done. From the first day in this existance, life has made it clear it wanted nothing to do with me. It repeated and hammered this message again today. When I think about my 36 years of existence, I think about a never-ended streak of bad beats and bad luck. I've never been lucky a single time in my life and every moment was spent suffering or waiting for the next source of pain.\nI am done with that shit. Thank you to everyone who supported me through this time on WSB.\n-FS", "score": 1, "replies": []}]}, {"body": "Am I the only one that made money from Brexit on Friday?", "score": 2, "replies": [{"body": "Nah. I was up too. Some of us were positioned to take advantage of a burning world ", "score": 2, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Fuck off\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}]}]}, {"body": "He's watched The Big Short again and now he's role playing.", "score": 2, "replies": []}, {"body": "The markets rallied. The risk was contained. The big losses have happened, but the real world value of most of the stuff going on hasn't changed.\n\nFuck, I'm no expert at all but the fscomeau guy... It seems so obvious that friday was risk accomodation and the risk is falling off (or at least, the risk value is stable)...", "score": 2, "replies": []}, {"body": "Fuck it man I'm in with you this time. Everybody follow FScomeau!!", "score": 2, "replies": []}, {"body": "You again?", "score": 2, "replies": []}, {"body": "Thanks man.  I bought spy calls on Friday at close. I'll sleep soundly tonight knowing that they will be up by 100% on Monday.", "score": 2, "replies": []}, {"body": "\"I believe we will not see the S&P500 above 2,100 for a very long time - at the very least until the end of this decade.\"\n\nLOL", "score": 2, "replies": []}, {"body": "I've been trying to figure out what the sign of capitulation would be - I thought it would be the front page of the Wall Street Journal proclaiming years of recession or something, but this is as strong a buy signal as I could've imagined.", "score": 2, "replies": []}, {"body": "What happen to your DWTI short...? DIdn't you supposedly make a killing on that? So howd you lose 20k? ", "score": 2, "replies": []}, {"body": "If you're so fucking sure of your predictions, you would sell 210 calls and buy 180/190/200 puts till your hands bleed. But you're not sure, you just say you are. \n\nYour actions reveal you to be a bitch. ", "score": 2, "replies": []}, {"body": "So the market is gonna go down, sell everything?  If I follow the opposite advice in 2008 I'd have about 15 million dollars right now, going all in on AIG and CITI. ", "score": 2, "replies": []}, {"body": "can someone put this faggot out of his misery already?", "score": 2, "replies": []}, {"body": "You couldn't be more wrong.\n\n\n\nEat shit faggot", "score": 2, "replies": []}, {"body": "this dude is the most brilliant and successful person on this board and none of you get it", "score": 2, "replies": []}, {"body": "The uncertainty is going to result in a choppy range bound market once again, this time just lower. I'm still shorting calls but not afraid to short puts if necessary. ", "score": 1, "replies": []}, {"body": "Alright, this will be my first inverse fscomeau YOLO!", "score": 1, "replies": []}, {"body": ">I believe we will not see the S&P500 above 2,100 for a very long time - at the very least until the end of this decade.\n\nThank you for restoring my faith in the economy.", "score": 1, "replies": []}, {"body": "I read until you said you liquidated everything. Now I know you're just justifying your positions. \n\nIf Cramer is selling, I'm buying. ", "score": 1, "replies": []}, {"body": "I don't know if he's serious or if its satire... but now I have the balls to buy calls on everything, so thanks I guess.", "score": 1, "replies": []}, {"body": "You hear it here first. SPY won't break 200.", "score": 1, "replies": []}, {"body": "Looks like my all in TVIX position is officially fucked.\n\nI knew I shouldn't have held through the weekend.", "score": 1, "replies": [{"body": "You think TVIX will be down on Monday morning? I sold mine Friday afternoon and now I'm kicking myself for not holding on to it over the weekend.", "score": 1, "replies": []}]}, {"body": "This is your idea of a DD? GFY", "score": 1, "replies": []}, {"body": "This is a terrible DD.......", "score": 1, "replies": [{"body": "...but it was a whole day's worth!", "score": 1, "replies": []}]}, {"body": "The pockets of the rich are lined with the money of fools.  You may be right.  On the other hand, the world may decide that US companies aren't actually worth less just because Britain is no longer a member of a club.  ", "score": 1, "replies": []}, {"body": "This just in: uncertainty will likely lead to bear markets\n\nThanks for your expert analysis, faggot", "score": 1, "replies": []}, {"body": "Get help.", "score": 1, "replies": []}, {"body": "I am going to go buy.", "score": 1, "replies": []}, {"body": "And I was hoping you killed yourself", "score": 1, "replies": []}, {"body": "inverse fscomeau, thanks bro. will hold.", "score": 1, "replies": []}, {"body": "Doom and gloom and fear and panic", "score": 1, "replies": []}, {"body": "MOOOOOOOOOOOOOOON", "score": 1, "replies": []}, {"body": "Back so soon?  I didn't even get a chance to miss you this time!", "score": 1, "replies": []}, {"body": "TVIX is finally relevant again!", "score": 1, "replies": []}, {"body": "What if they just lower rates in the U.S. and in other markets they go with negative rates or they fuckin start another round of 'quantitive easing' again? Seems like they're doing whatever to prop up the stock market. ", "score": 1, "replies": []}, {"body": "Got it, correction on Monday because Article 50 was never invoked and there's a chance that Brexit may as well never happen", "score": 1, "replies": []}, {"body": "Didn't even need to read past the first paragraph to know it was fscomeau", "score": 1, "replies": []}, {"body": "Buy gold and silver miners. \n\nI feel I was the only one that made out on Friday. Lol", "score": 1, "replies": []}, {"body": "#buyhighselllow", "score": 1, "replies": []}, {"body": "Don't turn this sub into personalfinance.", "score": 1, "replies": []}, {"body": "> Monday at bell opening, I am going to massively short the S&P500 by short selling the SPY\n\nI thought you were done, and totally broke, having to eat 4 day expired yogurt and wondering about how you were going to pay your rent? What are you shorting with? Timbits?\n\ntabernac.", "score": 1, "replies": [{"body": "He stole some guy's half eaten cookie at the mall", "score": 2, "replies": []}]}, {"body": "Thought you went broke?", "score": 1, "replies": []}, {"body": "First I saw this and thought it was bullshit.\n\nThen I saw the username and now KNOW it's bullshit.", "score": 1, "replies": []}, {"body": "paging /u/jorgen_von_strangle_\n\nWe have a level 10 raindance report  based on \"check out that gap\" and \"[arbitrary even number]\"\n\nTime will tell if he's wrong or just a guy throwing feces everywhere.\n", "score": 1, "replies": []}, {"body": "At this point, the only DD I need is waiting for you to post and taking the inverse fscomeau. Gfy", "score": 1, "replies": []}, {"body": "Your idea is a knee-jerk reaction to Friday's failure. You are trying to protect your ego by assuring yourself this fantasy will play out tomorrow.\nl", "score": 1, "replies": []}, {"body": "He lives", "score": 1, "replies": []}, {"body": "O fuck off jesus christ all of your predictions were fucking wrong and now there is a high probability you set this shit off in the other direction... ", "score": 1, "replies": []}, {"body": "I agree, and this is what should happen, however this market is rigged and the FED will not allow this to happen, they will buy to fool the masses into thinking everything is fine, they will continue to manipulate same as in China and Japan.  Just look at the dip we had in Jan and Feb both of which got bought up all while the US economy is doing horrible, earnings season has been horrible for most corporations and GDP has basically stopped growing...  ", "score": 1, "replies": []}, {"body": "Don't get Brekt again!", "score": 1, "replies": []}, {"body": "Fremain!!!!", "score": 1, "replies": []}, {"body": "does this mean now will be the best time to get into the market? thank you. GFY.", "score": 1, "replies": []}, {"body": "[deleted]  \n ^^^^^^^^^^^^^^^^0.4365 \n > [What is this?](https://pastebin.com/64GuVi2F/02347)", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Hey man, I'm a complete and total idiot when it comes to this stuff. Is there any way you could explain that graph a little bit?", "score": 1, "replies": []}]}, {"body": "Fuck you I have puts already", "score": 1, "replies": []}, {"body": "WAIT YOU GUYS he's playing on emotions inverse fsocmeau might not work this time!", "score": 1, "replies": []}, {"body": "I feel like I just read a newsletter from a penny stock promoter. ", "score": 1, "replies": []}, {"body": "What is this \"less risky\" you talk about? What does it mean? ", "score": 1, "replies": []}, {"body": "Ahh yes, the notorious summer \"everyone who matters is on vacation\" bear market ", "score": 1, "replies": []}, {"body": "So is inverse fscomeau the reason futures regained majority of its lost today?", "score": 1, "replies": []}, {"body": "So, go long on S&P 500. Thanks!", "score": 1, "replies": []}, {"body": "GD it I just bought some more spy puts.", "score": 1, "replies": []}, {"body": "fuck you", "score": 1, "replies": []}, {"body": "Fuck man... now Im afraid of all my puts. FUCK YOU!", "score": 1, "replies": [{"body": "Don't worry about it. He is almost always wrong. ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -1, "replies": []}, {"body": "Lol yeah everyone thinks they know for sure. You don't know shit. They market could go great. Maybe no one else will leave the EU. Maybe the UK will become better than ever after leaving, and others will leave, which will make the economy BETTER as they expect similar success for those other countries. \n\nTL;DR No one knows shit", "score": 0, "replies": []}, {"body": "Kek ", "score": 0, "replies": []}, {"body": "FUCK", "score": 0, "replies": []}, {"body": "Glad to see you didn't give up on trading... You were going through a rough patch for a while there last year, weren't you?  I was going though one at the same time and reading about your suffering helped me cope with my own.  I also sold about $100,000 worth of bullish positions right at the market open because I'm thinking this is just the beginning of a bear market.  ", "score": 0, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Just cause you \"have a yacht\" doesn't mean you're not a homo still. ", "score": 3, "replies": []}]}]}
