{"title": "Cheerios maker General Mills cuts sales view as price hikes hammer demand", "selftext": "General Mills cut its annual sales forecast, on Wednesday and missed second-quarter estimates, warning of a slower recovery in demand following repeated price hikes on its breakfast cereals, snack bars and pet food products.\n\nIts shares were down about nearly 3% in early trading as the Cheerios cereal maker also lowered the upper end of its annual adjusted profit growth forecast to between 4% and 5% due to still-high input costs, primarily of labor.\n\nA series of price hikes, undertaken to offset the steep input costs, have pushed consumers to shop smaller pack sizes for pantry staples and pet food, as well as opt for cheaper private-label alternatives.\n\nhttps://finance.yahoo.com/news/general-mills-cuts-annual-sales-121839899.html", "id": "18n4y9s", "created_utc": 1703105679.0, "score": 124, "upvote_ratio": 0.96, "num_comments": 72, "comments": [{"body": "Sounds like General Mills should consider reversing some of those price hikes then.", "score": 247, "replies": [{"body": "This is literally what the fed wanted to bring down inflation. Weak demand should cause prices to fall.", "score": 26, "replies": []}, {"body": "Why would they? Sell less at higher prices. That’s what everyone wants to do I thought", "score": -60, "replies": [{"body": "Yeah and then watch your revenue go down the drain. Brilliant strategy", "score": 50, "replies": [{"body": "…who cares what revenue does if profit increases? Less production costs.", "score": -10, "replies": [{"body": "not sure why you are down voted, that's how monopoly works", "score": 6, "replies": [{"body": "Cereal isn't a monopoly. Every major grocery store chain has knock-off cereal that is the same thing for 50% less. Aldi cereal is just as good as name brand and kids 99% of people couldn't care less.", "score": 8, "replies": [{"body": "store brand cereal is usually worse, use more artificial flavoring, use more corn syrup, look at whi PG&E owns? Nice chart to give you the illusion of competition", "score": -4, "replies": []}]}]}]}]}, {"body": "Or sell none because it's an oat and every store has a knock-off brand that is a fraction of the price for the same item.", "score": 2, "replies": []}, {"body": "They're assholes. They're raising prices on cereal for kids in schools. Who fucking does that?", "score": 5, "replies": [{"body": "More importantly, who feeds their kid breakfast cereal?  Sales are going down because parents are getting smarter about nutrition.", "score": -5, "replies": [{"body": "Cheerios is one of the healthier cereals out there.", "score": 4, "replies": []}]}]}]}]}, {"body": "Raised prices and made product smaller size....screw them! Reap what you sow", "score": 104, "replies": []}, {"body": "These companies keep thinking they can just keep raising and hit all the bonus goals. Unfortunately, high prices push customers to leave. Regular customers who leave often don't come back. Serves them right.", "score": 67, "replies": [{"body": "Management who raised the prices in 2021 got their bonuses and patted themselves on the back for being smart.  They have likely moved on to another role in Gen Mills or to another food company.  \n\nProcessed food price inflation has been driven by greed more than commodity pricing.  Now they pay the piper.  As someone above said, once you stop eating cheerios every day, you quickly realize you don’t need it.", "score": 40, "replies": []}]}, {"body": "No one can afford 7.99-9.99 for a box of cereal.", "score": 116, "replies": [{"body": "Exactly.  I switched to some random Post cereal. It’s $4.  On sale for $2 at Kroger occasionally.\n\nEven Raisan Bran is like $7+.  That used to be on sale for $4 all the time.  Hard pass on $7 cereal; they can keep it.", "score": 52, "replies": [{"body": "There are items you specifically buy because they are cheap and cereal is one of them. Stops being cheap losses most of its appeal.", "score": 35, "replies": [{"body": "Exactly. The allure of cereal being healthy is also out. Most healthy people are eating oats and other actually healthy items. At these prices, us unhealthy people will just eat bacon and eggs 5 times a week.", "score": 23, "replies": [{"body": "Bacon and eggs aren't unhealthy", "score": 4, "replies": [{"body": "Idk if 5 days a week would be healthy tho? Occasionally sure. A breakfast with eggs, oats, blueberries and fruit would be more ideal than just bacon and eggs.", "score": 5, "replies": [{"body": "Agreed", "score": 2, "replies": []}]}, {"body": "Oscar Mayer bacon gets a ‘C’ on Fooducate, and regular Cheerios gets an ‘A-‘", "score": -1, "replies": [{"body": "Yeah were also told butter is unhealthy but industrial oils which are heated to insane temperatures and then deodorized because they're so foul smelling are healthy. I make my own decisions on food and nutrition. I'm not saying bacon is the healthiest food in the world but in moderation its not terrible though yeah everyday probably not ideal. Most cereal is hot garbage and in particular Cheerios are supposedly one of the cereals with the highest levels of glyphosate so not sure why it would be scored an A. I also wouldn't consider Oscar Meyer anything to be a quality food source.", "score": 6, "replies": [{"body": "Glyphosate is the same class of carcinogen as pork (2A).", "score": 1, "replies": [{"body": "And Marjiuana is classified the same level of drug as heroin. Id rather eat pork", "score": 5, "replies": []}]}]}]}]}]}]}, {"body": "Raisin Bran is up to $7? Jesus. \n\nI don’t doubt you, as I don’t eat cereal, but I remember those $4 prices feeling high for that cereal, can’t imagine $7. Insane.", "score": 11, "replies": [{"body": "It is $6.49 right now, but I remember it being $7 at one point.  \nIt was exactly like this with Tyson chicken.  They kept raising the price until people stopped buying it.  I remember when the freezers would be completely full but they wouldn’t drop the price…Then the company came out whining, me profits.", "score": 6, "replies": [{"body": "Honestly I just assume anytime I need to buy anything it’s going to be outrageously expensive.\n\nDamn shame what they’ve done.", "score": 5, "replies": []}]}]}, {"body": "People still eat cereal?", "score": 2, "replies": []}]}, {"body": "Right. You eat cereal BECAUSE you are poor. Not to go poor", "score": 12, "replies": []}, {"body": "Seriously, I went to target the other day and the “sale” price for cheerios was 2 for $10… as if a box of cereal on sale should cost $5, and was $8 full price.", "score": 12, "replies": []}, {"body": "Less than $3 at Aldi.", "score": 14, "replies": [{"body": "Trader Joe gang", "score": 3, "replies": []}]}, {"body": "CVS sometimes has a special for $1.99 / box. Avoid the buy one, get on free - still overpriced.", "score": 3, "replies": []}, {"body": "Check out Sam's Club or Costco.", "score": 2, "replies": []}]}, {"body": "Boy that short term bump probably looked good for about a quarter now reality is setting in for the food manufacturers", "score": 43, "replies": []}, {"body": "When they started raising their prices ($7-8 a box), I moved to Post brand.  It’s $4 max and $2 on sale at Kroger sometimes. \n\nI say that as a long-time GIS shareholder (although I’ve sold 40% of my shares this year).  \n\nThey thought they could get away with those price hikes and they thought wrong.  I was originally attracted to GIS because of the pet food diversification they were doing, but I think they are making some bad moves as of late.", "score": 18, "replies": [{"body": "have you seen the price of semi-premium pet food?  It is twice the price of human food.", "score": 7, "replies": []}]}, {"body": "I can guarantee the C-Suite staff just had a 6 hour meeting to try and figure out why no one is buying their shit.", "score": 18, "replies": [{"body": "Based on my experience, the departments that were in that meeting had their team members preparing information for their VP for 3 weeks before the meeting. Just so their VP could use absolutely none of that information. The team members probably all had 5-10 meetings about this meeting to make sure they had all the information that wouldn’t be used.", "score": 14, "replies": [{"body": "You're actually very fucking right..\n\nC-Suite staff are fucking useless.. atleast mine are.", "score": 1, "replies": []}]}, {"body": "I work for a food manufacturer. They do talk about price elasticity and they know price has became so high and now it hit its inelastic limit. They simply won't lower prices unless a competitor does first. It's a game of chicken.", "score": 2, "replies": []}]}, {"body": "I went to the store yesterday and the cereal my daughter likes was 5.79 a box. There was a sale going on for a different brand of cereal that if you bought 4 boxes, it was 1.99 a box.  So I got 4 different cereals for us to try.  I told my daughter (8) when I got home that I will buy her cereal again when it’s on sale, but not for 5.79 a box. She was ok with that.  Teach them young to substitute based on price.", "score": 34, "replies": [{"body": "Teaching moments. Good on you 👍", "score": 3, "replies": []}]}, {"body": "I stopped eating breakfast cereal. I switched to 10 lb bags of oatmeal from Costco for like $12. Basically 10 cents a serving. Also healthier.", "score": 28, "replies": [{"body": "Only by a bajillion times healthier.", "score": 8, "replies": [{"body": "Obviously it depends on what you put on the oatmeal!", "score": 3, "replies": []}]}]}, {"body": "20 years ago cereal used to be a cheap food. Now these processed garbage carbs are really expensive. I don't know a single person that eats this stuff anymore.", "score": 11, "replies": []}, {"body": "\"oh no the cost of oats rose from 6 cents per box to 6.4 cents, we'd better double the price of everything\"", "score": 9, "replies": []}, {"body": "Cereal prices are nuts. Notice how the depth of the box has shrunk so they can put less in a box while keeping the front of the box the same size so it's not as visible on the shelf. When I have cereal I have a large serving and the $8 regular price boxes yield about 3 servings. A box used to last almost a week.  I'd rather hit the McD's drivethru to get 2 Sausage Egg McMuffin's for $5. It's only marginally more expensive than Cheerios.", "score": 14, "replies": []}, {"body": "I’m glad to see I wasn’t the only person to think General Mills were out of their minds to charge $8 for a box of cereal. \n\nCereal is just pseudo healthy food for parents who want to put in low effort to feed their kids. Eggs and oatmeal is a far better choice in both price and nutrition.", "score": 7, "replies": []}, {"body": "Prices of cereal is very seriously high these days.\n\nAlso I don't consume much of it in a year.", "score": 18, "replies": [{"body": "It’s all sugar now", "score": 11, "replies": []}]}, {"body": "I love the idea that the average consumer, after getting brutally taken advantage of during a pandemic by blatantly profiteering and greedy companies, will not give two fucks that the cost of cheerios has come down marginally, because, hopefully, the consumer has worked out a way to permanently remove cheerios from their shopping list. This is the failure of modern capitalism--short sighted CEOs make short-term decisions before they bail. they raid the potential of the future and brag about profits in the present. these people are grifters. they run Ponzi schemes. they are criminals. their cereal is fucking garbage. fuck them", "score": 3, "replies": []}, {"body": "Compared to the increase in price of its product,  labor is an extremely small percentage of the cost increase. This is primarily customers trading to more affordable options.", "score": 2, "replies": []}, {"body": "Cereal is terrible for you anyway. No one should be eating that sugary mess", "score": 2, "replies": []}, {"body": "who eats that s...T", "score": 0, "replies": [{"body": "What do you eat for breakfast? Just curious because I eat a box of cereal about every month which isn't very much.", "score": 1, "replies": [{"body": "eggs, toast w butter and honey, oatmeal w peanut butter, fruit and veggie smoothies, maybe some bacon or sausage couple times a week.   \n\ni stopped eating that cereal crap back in elementary school in the late 80s.", "score": 7, "replies": []}, {"body": "Eggs and toast.  Oatmeal.  Breakfast rice.  That is probably 80% of our breakfasts.  Weekends we will do homemade waffles, breakfast burritos, breakfast sandwiches (egg/sausage on English muffin) or pancakes occasionally.  That takes it to 90%.  The other 10% of the time we skip breakfast.", "score": 1, "replies": [{"body": "I usually eat leftovers from last night's supper. Today it was pork and sauerkraut", "score": 2, "replies": []}]}, {"body": "I make a shake with rolled oats, honey, vanilla almond milk, strawberry yogurt, and some fruit. It's pretty cheap, healthy, and all the ingredients last a long time!", "score": 1, "replies": []}]}]}, {"body": "Aaaghghghgh", "score": 0, "replies": []}, {"body": "Lot of people happily paying $1000/year for a phone, $1800/year for phone/internet and $1200/year for 10 streaming services moaning and groaning about $7 cereal here.", "score": -7, "replies": []}, {"body": "i pay $2/box whatever is on sale", "score": 1, "replies": []}, {"body": "Breakfast cereal is fucking terrible for you anyway. It’s all carbs, processed milk, sugar and chemicals. Stop eating that crap!\n\nMake some eggs with vegetables, Greek yogurt, some fruits.", "score": 1, "replies": []}, {"body": "This is why you buy the bootleg bag cereals.\n\nActually, most of them are bad rip-offs. The Flintstone pebble flavors are 100% accurate though.", "score": 1, "replies": []}, {"body": "Yea dude 6-7$ for a box of cheerios here . I'll pass every time .", "score": 1, "replies": []}, {"body": "Cereal for $8 a box is absolutely outrageous.", "score": 1, "replies": []}]}
{"title": "Can someone explain how we can hit all time highs?", "selftext": "[deleted]", "id": "18mwn0a", "created_utc": 1703084601.0, "score": 0, "upvote_ratio": 0.46, "num_comments": 80, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|2 years ago\n**Total Comments**|198|**Previous Best DD**|\n**Account Age**|9 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "I think you misunderstand inflation. If the overall amount of money in circulation increases, then the stock market most likely will increase aswell.", "score": 32, "replies": [{"body": "This. The stock market is the ultimate inflation hedge", "score": 21, "replies": []}, {"body": "you guys act like inflation adjusted S&P isn't also near ATH lol", "score": 3, "replies": [{"body": "[deleted]", "score": -5, "replies": [{"body": "[https://www.multpl.com/inflation-adjusted-s-p-500](https://www.multpl.com/inflation-adjusted-s-p-500)\n\n&#x200B;\n\nDo y'all just enjoy pulling numbers out ya ass and trying to convince other people it has any value?", "score": 12, "replies": [{"body": "That graph changes based on the starting point because inflation isn’t constant. Change it to 5y and magically were no longer at ATH.", "score": 0, "replies": []}, {"body": "From your link, it’s 7.6% under the Nov 2021 inflation adjusted peak.", "score": 1, "replies": []}]}]}, {"body": "I act like I'm answering a question.\n\nBut sure, even inflation adjusted it's ATH. Why?\n\n1. More people invest in the stock market than ever before.\n\n2. Inflation rate beats wage increase rate. So where is the money? It's going to the current profiteurs aka large companies and their shareholders who in turn reinvest proportionally more than before.", "score": 1, "replies": []}]}, {"body": "Precisely this - inflation is caused by companies charging more money for the same product meaning there’s a good chance that companies profits rise when inflation goes up. Next is that since inflation affects employee wages, some comps rise and that often gets pumped into stocks too. So rising profits, higher multiples => higher stocks", "score": 0, "replies": [{"body": "That’s not what causes inflation that’s a result of inflation", "score": 1, "replies": []}, {"body": "Oh gawd.\n\nWhy are companies charging more money for the same product?", "score": 1, "replies": []}]}]}, {"body": "Irrational exuberance. \n\nMy friend is a doctor and his portfolio has blown up. He doesn't even look at it. Doesn't trade. Just long. That's probably most market participants rn.", "score": 31, "replies": [{"body": "That’s honestly the smartest way to invest for most working people. Max out retirement accounts and throw extra money into mutual funds or ETFs once in a while.", "score": 13, "replies": [{"body": "Or throw money at individual stocks you are an early adopter of using … I’d never have to work again if I did that in my college years", "score": 2, "replies": []}]}, {"body": "Rich get richer?", "score": 1, "replies": []}]}, {"body": "I think the simplest answer is, about 6% of the time, historically, we have been at an ATH.  So if we're hitting all time highs for the first time in a few years, that isn't out of the ordinary.\n\nThe market is pricing a rate cutting cycle, causing tech and unprofitable shitcos to moon.  That's not unusual reaction.  But it is contributing to market wide returns.\n\nBasically, sure, there could be a recession.  There could be a market pullback.  I would argue that's always the case.  But stock market all time highs should happen once every 20 days on average.\n\nMight as well ride the wave?", "score": 8, "replies": []}, {"body": "In tradingview, divide the S&P by the M2 money supply and put it on the monthly or yearly and zoom out. You'll find that we're just on average. No where close to all time highs. A lot of room to grow from here if the market became truly irrational", "score": 7, "replies": [{"body": "Except M2 is lower now than it was last time it ran to ATH during a mega rally?", "score": 1, "replies": [{"body": "So buy now?", "score": 1, "replies": []}]}]}, {"body": "Im just gonna leave this here:\n\n🌈🐻🌈🐻🌈🐻", "score": 13, "replies": [{"body": "Haha nice try m8, Im only bearing once a year to secure my long positions 😜", "score": 1, "replies": [{"body": "Duel to the death? Only one of us shall prevail!", "score": 1, "replies": [{"body": "Ah shit Highlander in this bitch.", "score": 2, "replies": []}]}]}, {"body": "Made back more being a bull in the last month than I lost being a bear in the 2 months prior. Logically I agree with you - but unfortunately stonks only go up", "score": 1, "replies": []}]}, {"body": "Because we have to get the pump before the 2024 recession dump.", "score": 3, "replies": []}, {"body": "Crazy idea here: maybe the money printing was a boogeyman all along and the fed kinda knows what they’re doing?", "score": 6, "replies": [{"body": "have they ever? The same dude that didn't want to raise rates because \"inflation is transitory\" is now telling us he can do a \"soft landing\" that fed chairs much more capable than him haven't managed to do. lol", "score": 2, "replies": [{"body": "Not saying he can do it, he's actually doing it as shown by the data. Can things suddenly deteriorate? Yes, but right now we're rallying because the data look good and the fed signalled cuts", "score": 2, "replies": [{"body": "the data isn't really bullish and the fed signaled cuts because they're aware things are more bleak than the public is being led on. We can see this too if we read deeper between the lines. Jobs up due to strikes ending, when adjusted we're going to see jobs starting to cool. That combined with a slightly hotter CPI report for November showing core inflation being sticky is worst case scenario. Every single time the fed has pivoted a crash as resulted because the fed pivots when something breaks. What makes you think it's any different this time? Wall Street sold regards a narrative to grab liquidity into year end and we're gonna end up with another generation of bagholders in 2024", "score": 1, "replies": [{"body": "Eat my dongus you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}]}, {"body": "I’ve stopped trying to make sense of things a while ago. Well, not exactly, but looking at things leaves me scratching my head in disbelief.  Same for housing prices that started to shoot up in the early 2000s in some areas. Prices (and payments) were far out of reach for the masses.  Didn’t make sense yet it happened.", "score": 2, "replies": []}, {"body": "Someone at the Fed activated the regard switch. So the market goes brrrrr", "score": 2, "replies": []}, {"body": "Stop thinking so deeply. You must understand “stonks go up”", "score": 2, "replies": []}, {"body": "There has been a push for the past three years to convince people the economy is on the brink and will go into recession any day.  That push has been motivated by politics, not the economy.", "score": 4, "replies": [{"body": "The reality is forcing companies like Google and Facebook to scale back head count by making cheap money less accessible, so they don’t have thousands of talented workers just sitting on the sidelines “just in case” and to stymie competition, means that those talented people are now propagating throughout the workforce… empowering legacy companies to modernize and small companies to thrive with higher tier talent. Places where the work they put in actually advances productivity. This alone is great for the economy.", "score": 4, "replies": []}, {"body": "Have you realized that the opposite scenario is equally likely if not more likely to be true? Read old articles from 2000 and 2008, the most bullish takes came right before shit hit the fan. Recession indicators aren't fool proof but if all of them are firing on all cylinders you have to consider, is the fabled \"soft landing\" even possible.", "score": 2, "replies": [{"body": "This situation is completely different from 2008.  Trying to compare them like this is disingenuous at best.  Besides, for the past three years the narrative has been that a recession is immanent or that we are already in one and that it will make 2008 look small by comparison.  That does not sound bullish to me.  And your only comparison to 2008 is that people have bullish takes (not sure why you think this) so we are about to collapse again?  I call bullshit.", "score": 1, "replies": [{"body": "The comparison is not perfect, but there are some key similarities. In both cases, people were overly bullish and complacent about the economy just before a major downturn. This time around, I believe the potential for an even bigger recession is much greater. So while it's impossible to say exactly how this will play out, I think it's fair to say that 2008 could be a very good indicator of what we're facing in the next few years.", "score": 2, "replies": []}, {"body": "My comparison to 2008 is that we're seeing a blow off top where equities are becoming increasingly divorced from fundamentals led by a handful of market leaders. Not to mention even though the fed has put a band aid on the bullet wound cracks are continuing to form. The emergency liquidity measures to halt the banking crisis expires in March and its only poured more fuel on the dumpster fire that is private credit. Yes, there have been a mix of bearish and bullish views the past few years but that's been snuffed out this quarter. Just like how real estate doubters in 2007 were shouted down, soft landing doubters are being shouted down now. You can long here if you want, just don't be surprised when you lose your shirt.\n\n&#x200B;\n\n[https://www.bloomberg.com/news/articles/2023-12-05/goldman-s-rubner-says-stocks-rally-out-of-gas-after-record-rush](https://www.bloomberg.com/news/articles/2023-12-05/goldman-s-rubner-says-stocks-rally-out-of-gas-after-record-rush)", "score": 1, "replies": [{"body": "You mean it’s just like the Dow Jones in 1920s before shit it the fan \n\nYa you’re right and when the derivatives market blows the fugg up in 2024 when fed liquidity programs end, we’re all getting gaped with no lube unless you’re loaded to the gills with puts", "score": 3, "replies": []}]}]}]}]}, {"body": "Yardeni saying 6k S&P 2025. He got 2023 bang on. Should we trust this dude??????????????", "score": 5, "replies": [{"body": "Yes. I think it will go to 6k soon too", "score": 5, "replies": [{"body": "I’m sorry but bond yields crashing and S&P soaring, and MMF growing…. Nothing makes sense. Smells like 2008 all over again lol.", "score": 1, "replies": [{"body": "Wait until the core boomers start dying and their hoarded savings begin hitting the market.", "score": 3, "replies": [{"body": "Isn't their money already in the market? Where are they hoarding these savings?", "score": 4, "replies": [{"body": "Only 40% of boomers have any investments. Their $$ is in real estate, savings accounts, CDs, bonds, etc.", "score": 3, "replies": [{"body": "You realize that the scenario is usually that it gets diluted and liquidated after the inheritance gets split by their kids right?", "score": 0, "replies": [{"body": "You realize if it's sitting in real estate or a savings account none of it makes it to the markets right?", "score": 1, "replies": [{"body": "I'm just saying it's wrong of you to think that shit get straight YOLOed into markets when someone passes away, you definitely don't know estate law. Most of that shit straight up gets taken through various taxes and the rest gets diluted.", "score": 1, "replies": []}, {"body": "Those “kids”, ie adult children, will be using that cash to buy houses though", "score": 1, "replies": [{"body": "These 'kids' are gen X and already have houses, and likely a recreational property and/or rental property. They do two things with inheritance money, pay down debt and invest it, and they will be receiving $30 trillion over the coming decades.", "score": 1, "replies": [{"body": "Gen X still significantly lags boomers for home ownership at the same ages. You’re right about paying down debt, but since we’re at ATH debt loads, I suspect we’ll see reduced market inflows from inheritance monies as Gen X pays off their debt. All the while US median inheritance has not increased significantly with inflation. Boomers are also spending substantially more later in life compared to their parents.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Apart from a few AI stocks, the market is mostly fairly priced compared to earnings", "score": 0, "replies": []}, {"body": "Where’s the systemic issue?", "score": 1, "replies": []}]}]}, {"body": "Maybe. Watch out for the pull back in Jan.", "score": 1, "replies": []}]}, {"body": "It’s a blow off top", "score": 2, "replies": []}, {"body": "inflation in past is permanent. that is what you and many are missing. A 100k house in 2021 is worth more just because the $ are forever worth less", "score": 1, "replies": []}, {"body": "Moral hazard\n\nWith the fed and government going all out to support stocks, then it destroys any price discovery\n\n10+ years of that and you get what we see today, markets that never go down anymore because nobody wants to get run over by the Treasury or the fed", "score": 1, "replies": [{"body": "This is on point, fundamentals haven't existed since the fed put training wheels on the market. Now the market plays chicken with the fed. Only problem is that when bullying the fed doesn't work, the results will be catastrophic.", "score": 2, "replies": []}]}, {"body": "With inflation we’re still quite a bit below ATHs", "score": 1, "replies": []}, {"body": "Unless the people who own 90% of shares have a reason to turn off the buy button and sell with something else to buy, it can go up forever. \n\nAlso, 0DTE and machines drive the market higher on a daily scale. \n\nThere’s just so much $$$$$ buying and not sell. \n\nUnless they have something else to buy (unlikely without more rate hikes) stocks just slowly tick up. \n\nThere’s also a ton of money on the sidelines constantly buying dips. \n\nAnd it’s pretty much backed by the FED/Government to keep the compounding machine compounding. There should have been a severe depression after Covid but stocks dropped for 2 months before being pushed higher and higher constantly for 2 years. \n\nAnd don’t forget that of all those who are rurally own large amounts of stocks, they want to own forever. If they sell one company they just buy another so the overall market stays up. \n\nAnd then there’s the companies themselves that pump hundreds of billions into buying their own shares off the market to make prices go up to make shareholders happy. \n\nThere are just so many forces pushing stocks up in the modern world. Even if they drop drastically they can be and are bought back up significantly quicker than in previous decades.", "score": 1, "replies": []}, {"body": ">There are a number of factors driving the stock market higher at the moment. Firstly, there is still a lot of money printing going on which is pushing up asset prices. Secondly, interest rates are very low so people are looking for alternative investments that will give them better returns. Thirdly, many companies have been doing well despite the pandemic and this has helped to boost confidence in the stock market. Finally, uncertainty remains high as we don't know how long the pandemic will last or what its full economic impact will be.", "score": -5, "replies": [{"body": "Could be right, still the worst answer I’ve ever seen by visual mod, didn’t even call me poor lmao", "score": 2, "replies": [{"body": "Inflation isn't going down, but the rate of it increasing is.  These prices are here forever.  The fed has put their stamp of approval on greedflation.  Fuck the poor and feed the rich.\n\nThe stock market is a reflection of how rich people are doing.   Not you.  You are poor.", "score": 2, "replies": [{"body": "Uncertainty also isn’t high, vix is almost atl, bot\nIs a regard", "score": 1, "replies": [{"body": "It IS a bot...", "score": 1, "replies": [{"body": "Regarded bot idd", "score": 1, "replies": []}]}]}, {"body": "So VIX shows only the fear of the rich and not fear of the rest of the world?", "score": 1, "replies": [{"body": "Essentially.  What would happen in every single investor with less than 100k pulled out of the market?\n\nWhen the fear of the world affects businesses' interests, then the rich notice.", "score": 1, "replies": []}]}]}]}]}, {"body": "There is still an absurd amount of money out there. It's barely gone down at all", "score": 1, "replies": []}, {"body": "Because Citadel fucking said so that's why.", "score": 1, "replies": []}, {"body": "If prices are higher, companies are also making more revenue", "score": 1, "replies": []}, {"body": "Stonk market only goes up.   \nI dont make the rules.", "score": 1, "replies": []}, {"body": "vix is low because chances of crash are very low. as market enters new phase of multi year bull run this is something normal. any dip will be bought into till nasdaq reaches 4 times of current prices in next 8 years.", "score": 1, "replies": [{"body": "That is an interesting analysis. I agree that the market is in a long-term bull phase, but I think there could be some short-term volatility as well.", "score": 1, "replies": []}]}, {"body": "Hello.\n\nI trade lots of things, including bonds.\n\nThe 30 year treasury yield is touching an important moving average, and has indicated that it is going to attempt a reversal, on said moving average.\n\nHistorically, this moving average has been respected, and its being tested right now.\n\nWhen the 30 year yield touches these support area moving averages, you get high volatility on SPX500.\n\nI predict (and my predictions are good) that the SPX500 will face a test, and large institutional money will dictate what happens.\n\nI highly advise sitting out, and simply watching what happens over all of January.\n\nIf I am right in what I am saying, you will get some large candle-wicks on the Weekly chart in either direction, as big money will be playing some tug of war..\n\n1. Will we break long term resistance area and push higher on price.\n2. Will we reject the previous high and see a reversal (short or long term reversal, who knows?)\n\nThe answer is.. you should just wait for confirmation, if you are going to trade this and make money.\n\nI have attached some photos to show you what I am looking at, to help give you a preview of what I am trying to explain, if it helps.\n\nAll I am saying, is tread carefully, I am a very good trader, and I forecast some tug of war in the markets, please do not get stoplossed out of your positions due to your possible lack of patience. 👍🏼\n\nhttps://preview.redd.it/yz3v9flcbe8c1.png?width=2532&format=png&auto=webp&s=fb0f37b08aae8f40b1f2b462a5f55c2d5b04c9d8", "score": 1, "replies": [{"body": "https://preview.redd.it/rnlayosgbe8c1.png?width=2532&format=png&auto=webp&s=270d0a2c8b185fe8116669436a12b877b183d68e\n\nThis chart is SPX500", "score": 1, "replies": [{"body": "And finally, this is just a chart of US interest rates, notice how they ebb and flow.\n\nhttps://preview.redd.it/rwkwmnylbe8c1.png?width=640&format=png&auto=webp&s=e03d778df7b91c729880f6c82dd82242fe9b6a39", "score": 1, "replies": []}]}]}]}
