{"title": "Proxy war at DIS, if you own any vote.", "selftext": "[https://acecomments.mu.nu/?post=407265](https://acecomments.mu.nu/?post=407265)\n\n>Nelson Peltz is renewing his fight to shake up Disney's board.  \nPeltz's Trian Fund Management investment firm, which owns about $3 billion in Disney stock, issued a statement Thursday that after the Mouse House's board rejected Trian's request for board seats, the hedge fund will \"take our case for change directly to shareholders.\" Trian is seeking two seats on Disney's board, CNBC reported. The firm oversees more than $2 billion worth of Disney shares held by former Marvel Entertainment chairman Ike Perlmutter, who has been vocal critic of Disney CEO Bob Iger and was dismissed from the company in March.\n\nIger has been the puppet master behind the scenes since he retired.  DIS went from a high of nearly $200/share to $92/share today.", "id": "1883u4w", "created_utc": 1701407846.0, "score": 90, "upvote_ratio": 0.75, "num_comments": 77, "comments": [{"body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "If Nathan Pelts wants shareholder support, fine. Tell us what your proposals are to improve the company first. From what I’ve seen, he’s provided nothing of actual substance besides saying he wants to improve shareholder value which is incredibly vague", "score": 196, "replies": [{"body": "Peltz’s firm has most of their activist power from Ike Perlmutter’s shares. If the activist’s goals are beholden to what Perlmutter wants, then Disney shareholders should not be aligned with Peltz. \n\nPerlmutter was forced out for a reason, bringing him back in to the fold would be two steps backwards.", "score": 57, "replies": [{"body": "The flimsy “muh shares dropped bc of Iger” is a big tell in this.  Peltz and Perlmutter can take a long walk on a short pier.", "score": 18, "replies": []}]}, {"body": "Correct. Anyone can throw stones. No one from Pelts camp has provided actionable items.\n\nDisney brought back the dividend. Iger has them on the right track. Peltz is an unnecessary disturbance until we hear something that has not already been said.", "score": 19, "replies": []}, {"body": "Reminds me of small town elections where there are no real hot topic issues so all the candidates just have same \"I'll lead this town more responsibly than the other guy\" campaign and it's impossible to figure out who to vote for.", "score": 14, "replies": []}, {"body": "Maybe he can convince them to quit doing sequels of star wars episode 98 and marvel universe movie episode 73 and come up with something original or new. The current marvel movie is a direct representation of the fact - fans are tired of the same shit over and over.", "score": 3, "replies": []}, {"body": "My bet:\n\nFocus on the magic of Disney.\n\nProprietary IP that can be leveraged into toys, theme parks and cruise ships.\n\nKeep DTC (Hulu and Disney+)\n\nKeep Parks\n\nkeep licensing business\n\nKeep studios\n\nTo hell with everything else.\n\nIt doesn’t fit the magic of Disney formula", "score": 4, "replies": [{"body": "Not ESPN? Sports is the last place people are willing to put up with advertising (and where advertisers aren’t afraid to spend without fear of politics etc). It doesn’t fit but that doesn’t mean keeping it is a bad idea.", "score": 3, "replies": [{"body": "ESPN should just be an autonomous subsidiary or a spun off entity with Disney retaining a majority stake.", "score": 5, "replies": [{"body": "That could work too", "score": 3, "replies": []}]}, {"body": "Sports is bidding war, and new players with deeper pockets and better ways to monetize are coming in.\n\nThe advantage of ESPN was they had so many viewers on their platform.\n\nSo does Amazon Netflix and other streamers. If everyone has a scale advantage nobody does. \n\nI think Amazon will ultimately win the sports battle because they can afford to pay more as they can monetize ads in the game directly at Amazon.com\n\nAny yahoo can host an NFL game, only one can show Star Wars or allow Star Wars the lunch box, theme park and so many other things", "score": 0, "replies": [{"body": "To your point, spinning off ESPN would unlock a lot of value. We shall see", "score": 4, "replies": [{"body": "To really boil it down, in my view I think Disney should only do things Disney can do\n\nOthers can do news and sports", "score": 0, "replies": []}, {"body": "I don't see anyone paying the kind of money it would take for Disney to get out for break-even on all the long term sports deals for things like Monday Night Football, Sunday Night Baseball, and all the NCAA football/basketball. If it were to happen Disney would probably have to accept a deep loss there. MNF alone is 2.6B annually. I'm reading that altogether they're spending nearly 45B for sports media rights through 2027. A potential buyer may only want some portions of this mix, requiring multiple buyers to split up that pie and making any deals that much more complicated.", "score": 1, "replies": []}]}]}, {"body": "Go ahead and spin it off. Maybe the sale will result in a one time special dividend? If not, maybe it gives them more money to complete work at the theme parks and resorts or just pay off debt, or do stock buy backs.", "score": 1, "replies": []}, {"body": "All the advertising is for gambling.... Not a Disney value", "score": 1, "replies": []}]}]}, {"body": "Honestly Iger already said he wanted to focus on entertainment instead of political nonsense so It's fine for now, waiting for them to start delievering some good stories", "score": 4, "replies": [{"body": "As we're seeing now with Wish, casting someone unpleasant to voice a princess is not what girls want to watch. Fortunately, they paused development of Snow White that starred that same unpleasant woman.", "score": 8, "replies": [{"body": "Very late to the party, but which unpleasant women is in Wish and Snow White? I couldn’t find any overlapping.", "score": 1, "replies": []}]}, {"body": "All the woke movies were being introduced under his watch before Bob Chapek took over. Even now he's doing a boycott advertisement on X because of political reasons. They say it's over antisemitism but it's already been proven that other platforms like TikTok and Meta have more antisemitism on it. I don't trust anything that comes out of his mouth at this point.", "score": 3, "replies": []}, {"body": "Conservatives aren't coming back until they see some heads roll. As long as Iger is leading Disney they will continue to suffer the soft boycott.", "score": 5, "replies": [{"body": "Their kids aren't getting younger.  They'll remember what their parents denied them", "score": -1, "replies": []}]}, {"body": "barbie makes a billion dollars \n\nredditers: it’s wokeness that’s the problem", "score": 2, "replies": [{"body": "Barbie had a lot of crap politics and messages in it. I saw it but didn't pay. I would never pay to see that crap. A lot of adults went with their kids thinking it would be a fun movie, to me it ended up being another **the message** movie", "score": 1, "replies": []}]}]}, {"body": "When the stock price has declined by 50% over just a couple of years a new direction, just about any direction, would be a welcome change.  Clearly something is very wrong at DIS.", "score": -5, "replies": [{"body": "I'm not going to support change just for the sake of change when the stock has been beginning to recover in the last month in the wake of the decent earnings report they had after the rough year its had. Give us a concrete set of ideas/proposals and allow us to judge Peltz's ideas on their own merit vs Iger's current proposals", "score": 13, "replies": []}]}, {"body": "His demands have been quite specific and DIS has been following some of them.", "score": 1, "replies": []}, {"body": "He's out to raid the crown jewels and loot the best for himself.   Typical of his work\n\nShares dropped in Igers *Absence* .. and are slowly recovering", "score": 1, "replies": []}]}, {"body": "I mean, who are these guys? What are they proposing by being board members?", "score": 49, "replies": [{"body": "Fire Iger and Feige basically.", "score": 26, "replies": [{"body": "Why Feige?", "score": 10, "replies": [{"body": "Perlmutter was sacked, part of it started due to conflicts with Feige", "score": 23, "replies": []}]}]}]}, {"body": "Nah, Changing the board won't do shit and lead to more damage, Give it a couple years, too many headwinds like the strikes and stuff will look bad for a couple months and will be right as rain again. Iger is no angel, he only cares about acquisition and sales which is his only strong suit.\nThe Nathan Pelts campaign constantly talks about political stances and not the buisness stances to help repair Disney. which isn't helpful. What the parks are doing now is adjusting for headwinds, and it's been crowded at the parks for most of the year with very few dead days. Their offerings like food and stuff has suffered in quality, and I hope it's for the short term.", "score": 30, "replies": [{"body": "Completely disagree.  The problem at DIS is their current philosophical direction, they are focused more on shoving culture war nonsense into movies and their parks than on just producing great entertainment.\n\nTheir recent movies are fine examples of this and have flopped bad.  The Marvels was a disaster and Wish is following the same trajectory.\n\nDIS needs new leadership period.", "score": -29, "replies": [{"body": "Lol downvoted to oblivion but many people feel the same way. Disney shows and movies definitely have a left wing bias, and lots of viewers are sick of it.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 14, "replies": [{"body": "Except it’s part of the reason why DIS is in their current position.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Because their financial statements will say “we messed up by virtue signaling and lost revenue”?", "score": 1, "replies": []}]}]}, {"body": "lol tell us you are a typical commie extreme leftist indoctrinated brainwashed bubbler without telling us you are a commie extreme leftist indoctrinated brainwashed bubbler.", "score": -29, "replies": [{"body": "That’s way too many big words for you bud", "score": 7, "replies": []}, {"body": "Reddit is a far left leaning cesspool. You can’t have any real discussion here.", "score": 2, "replies": [{"body": "I know.  It is funny triggering the herd though.", "score": -2, "replies": []}]}]}]}, {"body": "If you are trying to get me to invest big to vote again you it’s succeeding", "score": -1, "replies": []}]}]}, {"body": "Lmao. In the same time period:\n\nNetflix: $690 to $465\n\nTesla: $470 to $238\n\nAmazon: $182 to $146\n\nParamount: $75 to $15\n\nComcast: $59 to $42\n\nIt's almost as if theres a correction to what was market  overvaluation in certain tech or tech adjacent (streaming) sectors... But I guess they could just fire all their CEOs lol", "score": 17, "replies": [{"body": "Lmao look at Disney's share price in in 2015. It's higher than it is right now. The brand is strong but leadership needs a change.", "score": 6, "replies": []}]}, {"body": "[deleted]", "score": 19, "replies": [{"body": "That’s kinda the point though. You have an iconic company with outstanding brand recognition and IP but somehow they can’t figure out to outperform despite being loved by kids and approved by parents", "score": 17, "replies": [{"body": "Probably half of parents no longer approve", "score": 7, "replies": []}, {"body": "I think there’s potential value it’s a case of proving it. If Disney plus shifts to profitability and subscribers keep growing, the valuation will spike because opens up crazy upside income potential. At the moment I don’t think there’s any trust that it will happen because it’s still making a loss and subscriber growth has been stop start. More will become clear in the next year or so and realistically nobody knows the result", "score": 2, "replies": []}, {"body": "It takes a lot of hard work and effort to fuck up a brand like DIS.  Yet they have somehow managed to succeed.", "score": 8, "replies": [{"body": "Yeah they fucked up ESPN pretty good too. \n\nWhen I was in my thirties I watched ESPN relentlessly. I saw sportscenter almost everyday. Listened to ESPN radio in my car.\n\nNow I can't stand it. \n\nI might watch 3 hours ESPN all week - and that's only if I watch Monday night football. (And after football season ends I am turning off ESPN+ subscription and never subscribing again.)\n\nI still watch sports 4-5 days a week. Just not ESPN cause it's so disney-ed I hate it", "score": 5, "replies": [{"body": "Same here, I avoid ESPN at all costs and only begrudgingly add it to my channel lineup during college football season so I can see a few games on it I would miss otherwise.", "score": 2, "replies": []}]}]}]}]}, {"body": "Shouldn't Disney be focusing on getting more viewers and visitors than this...\n\nhttps://worldstar.com/videos/wshh9l6e7BXha96ax38j/thoughts-people-are-cancelling-their-disney-subscriptions-after-executive-wants-50-of-characters-to-be-lgbtqia-and-or-minorities-moving-forward", "score": 14, "replies": [{"body": "Not according to the reddit bubble.  Reddit bubblers are all for whatever the latest thing is so long as the DNC approves.", "score": 14, "replies": [{"body": "You're right, we should listen to the alt-right bubble instead and endlessly screech about CuLtUrE wAr and WoKeNeSs all day. That's much better.", "score": -6, "replies": [{"body": "u/parker0215\n\n>You're right, we should listen to the alt-right bubble instead and endlessly screech about CuLtUrE wAr and WoKeNeSs all day. That's much better.\n\nLMFAO\n\nYou already screech about CuLtUrE wAr and WoKeNeSs all day, in fact that is all you have ever done.  You’ve been doing that for decades.  You just have different names for it, DEI, affirmative action, etc.  You live in an echo chamber where every word is about CuLtUrE wAr and WoKeNeSs and everyone head nods like brain dead zombies at every utterance.\n\nROFL!", "score": 3, "replies": [{"body": "Might sound crazy to your terminally online jabroni ass, but most people don't spent their days plagued with thoughts of divide and conquer bullshit fed to you by your preferred oligarch", "score": 1, "replies": []}, {"body": "Wow you're a dummy", "score": 0, "replies": []}]}]}]}, {"body": "DIS leadership is majority far left. It’s not surprising they’re running the company to the ground. She says she has transgender and pansexual children. That’s all you need to know.", "score": 9, "replies": []}]}, {"body": "200 was too crazy back then, but 92 is too low I think. \n\nMy meager 120 shares have no fight in this. lol", "score": 6, "replies": [{"body": "Yes they do! Every single vote counts, because nobody has a clear majority as of now.\n\nYou may be holding \"only\" 120 shares, fuck I own 1/10 of that. But start thinking like an equity holder. You are first and foremost a miniscule part-owner of the company. Start thinking about how decisions by the company are good or bad and vote when opportunities arise.", "score": 3, "replies": []}]}, {"body": "Yeah something tells me stockholders aren't going to want turmoil in their vested company's top positions and decision making. Even just the perception of turmoil is enough to make a stock tank, you really think investors want to see the stock go lower?", "score": 2, "replies": []}, {"body": "Their board already had a lot of turnover.", "score": 2, "replies": []}, {"body": "Whoever is responsible for infinity war and end game, I want that person making the decisions", "score": 2, "replies": [{"body": "Feige", "score": 3, "replies": []}]}, {"body": "If I see DIS dropping another woke movie I'll sell my 2 shares i swear to god...", "score": 7, "replies": [{"body": "Toy Story 5:  Buzz and Woody Get Married.", "score": 3, "replies": []}, {"body": "Lol sell now, you know the next movie will be woke.", "score": 3, "replies": []}]}, {"body": "I am imagining a Game of Thrones scenario in which Perlmutter is using Peltz to return to power.", "score": 1, "replies": []}, {"body": "Ok thanks Nelson 😆", "score": 1, "replies": []}, {"body": "Disney is not the happiest place on earth, it’s bought out and corrupt. Go woke go broke", "score": -21, "replies": [{"body": "Naturally here on galatically far leftist commie reddit posting something like that gets you swarmed with downvotes because that isn’t approved groupthink.\n\nAnd you are correct.", "score": 3, "replies": []}]}, {"body": "What is this Succession all of a sudden?", "score": -1, "replies": []}, {"body": "If this leads to Disney having enough cash to buy dc after zaslov sinks warner then I will gladly simp for a man, I barely know anything about with ZERO due diligence. \n\n&#x200B;\n\nJoking aside, the movies and tv shows are practically barely more than ads for its themepark/merchandise so they really should just get out of streaming altogether and do what they do best. Monopolize precious childhood memories and bank off of nostalgia.", "score": -12, "replies": [{"body": "> Monopolize precious childhood memories and bank off of nostalgia.\n\nThat's not a good strategy. You can only bank on nostalgia if there are entertainment assets that the consumer can recall. Future generations would not have that connect with Disney's IP if they stopped their visual entertainment divisions.\n\nYou should take a look at Bandai Namco Holdings (TSE: 7832) and its subsidiaries, and give their business model a hard look. Disney is not very different from them, and has 10x as much global brand awareness and a much more diverse IP base.", "score": 6, "replies": [{"body": "Not the film/tv production studios. Just the streaming services because they're an unprofitable drain on resources.", "score": 1, "replies": []}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "188jlba", "created_utc": 1701457266.0, "score": 651, "upvote_ratio": 0.8, "num_comments": 80, "comments": [{"body": "OP, serious question for you: do you actually think this matter whatsoever?", "score": 541, "replies": [{"body": "So fucking stupid. They announce these ahead of time.", "score": 128, "replies": []}, {"body": "OP thinks management only buys/earns stock, never sells when this sub dumps shares harder than BP putting oil in the gulf", "score": 38, "replies": [{"body": "You like 🦐? Because we got you.", "score": 4, "replies": []}]}]}, {"body": "I'm a bear, but I'm actually getting very sick of regards posting \"X insider sell Y amount of shares!!!!\" like they're new to trading or wish their far OTM puts won't expire\n\n1. It's year end, most insiders start selling to prepare for holiday season spending and year end tax purposes \n\n2. Dawn Hudson holds 81,850 shares according to his SEC filing, same filing shows that he sold 11K common shares at $477.7699/share for ~$5.3M. That means he sold only 13% of his shares.\n\nIf you hold puts and thought this was worth celebrating, I'm sorry to inform you that he merely took profit and you are going to be spit roasted by MM like a hooker at an orgy by Christmas.\n\nEdit: I said the truth and the Europoor OP got mad and blocked me :4271:", "score": 155, "replies": [{"body": "Those options she sold may have been expiring or with the stock up about 250% YTD she thought it was time to ring the register.. I hope she enjoys the holiday season! Cha Ching!", "score": 13, "replies": []}, {"body": "Virgin regards here really obsess over a few mil in stock because they can’t comprehend that amount of money even if it’s nothing in the grand scheme to a director at a mega cap. Y’all expect these people to greedily try and sell the top while making coffee at home like they don’t have any desire to just enjoy life and spend some when their RSUs skyrocket lol", "score": 4, "replies": [{"body": "OP and people who agree with him would be very mad if they could read", "score": 2, "replies": []}]}]}, {"body": "Who gives a fuck", "score": 235, "replies": [{"body": "If „a director“ of the company thinks that the stock is at its peak… well yeah who cares, keep buying.\n\nEdit: Not CEO but director", "score": 24, "replies": [{"body": "CEOs sell shares all the time because their cost basis is so low, it doesn’t necessarily indicate a buy/sell signal. 5mil for a tech ceo is fucking pennies. \n\nHe probably wants to buy a new house or some shit so he’s cashing out his 5828589394% gains or like 5% of his shares. Who cares.", "score": 108, "replies": [{"body": "I would bet that CEO's and board memebers and shit are given money just to purchase shares specifically to juice the stock price \"OMG it's a buy signal!\"\n\nI sure as shit can tell you that leadership in my Fortune 50 company don't know the real story anyways.  By the time any information gets up to them it's been massaged 5 times to be way more upbeat than it really is.", "score": 17, "replies": [{"body": "CEOs and board members get most of their pay (70%+) in shares/options, if they’re buying shares on their own after that then that’s usually a personal decision", "score": 22, "replies": [{"body": "no dude, they are definetly forced to by their company to inflate share price and send signals to wallstreet!", "score": 9, "replies": [{"body": "Their job is literally to benefit the shareholders as much as possible", "score": -2, "replies": []}]}, {"body": "NVIDIA's CEO is Jensen Huang, appointed in Apr 1993, has a tenure of 30.58 years. total yearly compensation is $21.36M, comprised of 4.7% salary and 95.3% bonuses, including company stock and options. directly owns 3.51% of the company's shares, worth €38.24B.", "score": 1, "replies": []}]}]}]}, {"body": "It’s calling locking in profits. I wouldn’t expect 99% of people on WSB to understand that, anyways…", "score": 13, "replies": [{"body": "what's a profit? aren't they in the Bible or something?", "score": 1, "replies": []}]}, {"body": "This person isn’t the ceo", "score": 4, "replies": [{"body": "Thanks, changed that. But same logic applies.", "score": -7, "replies": [{"body": "No. They all owe taxes when their shares vest, some choose to sell to cover", "score": 3, "replies": []}]}]}, {"body": "This will fly over many heads", "score": -4, "replies": []}]}, {"body": "\"whO GiVes A fUk\"\n\nSir use your fuken brain for once", "score": -9, "replies": []}]}, {"body": "I sold nine too but is not on the news.", "score": 47, "replies": [{"body": "\\*yet", "score": 5, "replies": []}]}, {"body": "Ok", "score": 15, "replies": []}, {"body": "She found out I had calls", "score": 10, "replies": []}, {"body": "Probably buying a nice house", "score": 14, "replies": [{"body": "Or 4.", "score": 0, "replies": [{"body": "A nice house in the Bay costs this much… average houses are 3M in Palo Alto", "score": 1, "replies": []}]}]}, {"body": "All people saying it doesn’t matter are proof that it does ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271).", "score": 4, "replies": []}, {"body": "Good for them.. I buy NVDA dips when i can. go to 300 for all i care. Holding until im an old man.", "score": 8, "replies": [{"body": "Ya this is literally the company that is going to be supplying robobrains to Raytheon for their cyber soldiers in the next few decades.", "score": 4, "replies": []}]}, {"body": "Time for a pull back than up", "score": 3, "replies": []}, {"body": "calls it is", "score": 5, "replies": []}, {"body": "Aww poor guy", "score": 2, "replies": []}, {"body": "Bearish", "score": 2, "replies": []}, {"body": "Man I got great timing to lose all my money!!!", "score": 2, "replies": []}, {"body": "This is nothing. The last exec that sold and made the news, as far as I know, cashed out $50M.", "score": 4, "replies": []}, {"body": "European decimal detected, deploying appropriate reply:\n\n“Shut up bagholder”", "score": 3, "replies": []}, {"body": "paper hands", "score": 3, "replies": []}, {"body": "He sold them in January? It's not news then.", "score": 2, "replies": []}, {"body": "Insider selling of nvda has been a constant since at least 2020 whats your point?", "score": 1, "replies": []}, {"body": "If it’s pursuant to a plan who cares. This was all predetermined a while ago.", "score": 1, "replies": []}, {"body": "dude just fucking delete this you moron. jesus christ. how new are you ?", "score": 1, "replies": []}, {"body": "Can we stop letting idiots post scheduled sells of a stock that’s up 900%", "score": 1, "replies": []}, {"body": "I just pooped", "score": 1, "replies": [{"body": "Ghost poop?", "score": 1, "replies": []}]}, {"body": "So he sold like 12 shares?", "score": 1, "replies": []}, {"body": "Insiders sell for any number of reasons. It’s the buying you want to watch for", "score": 1, "replies": [{"body": "Jerks buy, smart sell\n\nhttps://preview.redd.it/hsyypfntbx3c1.jpeg?width=4096&format=pjpg&auto=webp&s=2ecfbd1f7991c3628edcfe673772a1782a4cf7fe", "score": 0, "replies": []}]}, {"body": "Bullish. \n\nGen AI is everywhere. As a software developer, I am using ChatGPT more than stackoverflow to get answers.", "score": 0, "replies": [{"body": "Why use chatgpt or stack overflow at all? Just use your brain. 🧠", "score": 3, "replies": []}, {"body": "[jim cramer shares your opinion ](https://www.reddit.com/r/wallstreetbets/s/NCKb3oPwYu)", "score": 1, "replies": []}]}, {"body": "If this was Palantir it would be a full bear run", "score": 0, "replies": []}, {"body": "All I see is butthurt people bragging about why said Director, CEO is selling their shares and why.\n\nThese top management has no salaries, their only source of income is capital gains, selling shares is normal for these people. You start worrying when majority of top management starts to sell all their shares and file for resignation.", "score": -1, "replies": [{"body": "[salary director nvidia ](https://www.glassdoor.com/Salary/NVIDIA-Director-Salaries-E7633_D_KO7,15.htm)", "score": 3, "replies": [{"body": "But technically not all in cash?", "score": 0, "replies": []}, {"body": "Glassdoor is a terrible website for salaries. Levels.fyi has more reliable info. Directors have salaries in the mid 300s+ and similar in equity before appreciation.", "score": 0, "replies": []}]}, {"body": "NVIDIA's CEO is Jensen Huang, appointed in Apr 1993, has a tenure of 30.58 years. total yearly compensation is $21.36M, comprised of 4.7% salary and 95.3% bonuses, including company stock and options. directly owns 3.51% of the company's shares, worth €38.24B.", "score": 1, "replies": [{"body": "Those bonuses comes out from capital gains when you close the books.\n\nI do not know tho why you so worked up, but this is in the contract he signed with the company since day one. He pretty much deserves to cash in as he already vested long time ago. Just do yourself a favor and open financial accounting book.", "score": 5, "replies": []}]}]}, {"body": "Jim cramer [loves Nvidia ](https://www.reddit.com/r/wallstreetbets/s/JpOAZDsI1O)", "score": -1, "replies": [{"body": "I don't really care for Jim Cramer, but I do think Nvidia is a great company. Their products are top notch and they always seem to be innovating.", "score": 1, "replies": []}]}, {"body": "Another overpriced company has started to fall ![img](emote|t5_2th52|4640)", "score": -4, "replies": []}, {"body": "Quarterly tax time?", "score": 0, "replies": []}, {"body": "Hudson Villa propping somewhere in Woodside, CA", "score": 0, "replies": []}, {"body": "[Call Long](https://www.reddit.com/r/wallstreetbets/s/AJcPVZL9tc)", "score": 0, "replies": []}, {"body": "Peanuts", "score": 0, "replies": []}, {"body": "No way someone was paid in shares and cash them in, you don’t say", "score": 0, "replies": []}, {"body": "Uhh it’s only 5m. Isn’t this company like well well into the billions", "score": 0, "replies": []}, {"body": "I know individual contributors that have this much. A director isn’t that high up.", "score": 0, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|1 year ago\n**Total Comments**|94|**Previous Best DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": -2, "replies": [{"body": "Even CEO’s need cash for Xmas presents and $5.25M is like loose change in your sofa to these people.  What exactly is your point?", "score": 1, "replies": []}]}, {"body": "To be fair, I’d like $5M cash.", "score": 1, "replies": []}, {"body": "That plastic surgery doesn’t pay for itself.", "score": 1, "replies": []}]}
