{"title": "My 5 biggest crypto stocks for 2024", "selftext": "**RIOT Stock**\n\nThe first crypto stock on our list is Bitcoin miner Riot Platforms (NASDAQ: RIOT). The company owns 7,358 BTC at a market value of $315 million. While Riot Platforms started out as a small patent holding company known as Bioptix, it ditched its original business model in 2017 and turned into a fully dedicated Bitcoin miner.\n\n&#x200B;\n\nIn order to become a leading BTC mining company, Riot purchased tens of thousands of high quality Antminers from Bitmain developing a massive fleet of high-end miners in the process. Riot achieved an impressive 112,944 miners by the end of November which allow it to produce an average 18.4 BTC every day.\n\n&#x200B;\n\nThe company sells hundreds of Bitcoins each month to increase its liquidity, but it was still holding 7,358 BTC, with a market value of $315 million, on its balance sheet at the end of November.\n\n&#x200B;\n\nAs a result of the crypto rally, RIOT stock increased around 72% from November until now. As BTC’s price continues to increase, Riot’s revenues and profits should increase correspondingly since the company mainly depends on selling Bitcoin.\n\n&#x200B;\n\nIn addition to selling Bitcoin, the company plans to stabilize its long-term operating margins by selling its excess power back to the grid at spot prices. Riot Platforms has a market cap of $3.44 billion and its stock trades at around $16. Additionally, its expected earnings growth rate for next year is 60.1%.\n\n&#x200B;\n\n**SQ Stock**\n\nA second crypto stock to consider is Jack Dorsey’s Block Inc. which owns 8,027 BTC with a market value of $343 million. Block Inc. offers an online digital and mobile payment platform for consumers. It is also the parent company of Square, Cash App, Spiral, Tidel and TBD.\n\n&#x200B;\n\nBlock Inc. is an important player in the crypto market since its subsidiary, Spiral, is focused on Bitcoin development. It offers a convenient entry to the crypto market through Cash App, which allows its users to buy, sell, send and receive Bitcoin. Additionally, the company’s decentralized TBD platform allows developers to build finance applications to run on programmable blockchains.\n\n&#x200B;\n\nIn its Q3 earnings results, Block generated $5.62 billion in revenue, of which 43% came from Bitcoin. The company’s gross profit also increased by 21% year-over-year, reaching $1.9 billion this quarter. Meanwhile, Cash App reported 27% increase in gross profit reaching $984 million.\n\n&#x200B;\n\nThese signs of life for SQ stock are very promising. The company’s performance was squashed in the post-pandemic era, and while it may never reach its pandemic highs of more than $260 per share, it offers a more diversified play for investors looking to benefit from catalysts in the crypto market and a broader recovery in consumer spending.\n\n&#x200B;\n\nAs for its exposure to crypto, Block shared that it achieved $45 million in bitcoin gross profit. Block sold $2.42 billion worth of crypto to customers, a 37% increase YoY. This notable growth is thanks to the increasing price of BTC as well as greater demand for the digital asset.\n\n&#x200B;\n\nBeating earnings expectations and raising guidance helped spur SQ stock on a run. Now up 97% since its earnings, the company could continue running in sympathy with any crypto rallies. Considering that the RSI is significantly overbought at 82 on the daily chart, investors may want to watch SQ stock for a pullback to take a position in 2024.\n\n&#x200B;\n\n**COIN Stock**\n\nNext on the list of best crypto stocks for 2024 is Coinbase Global. The company owns around 9,000 BTC at a market value of $385 million.\n\n&#x200B;\n\nThis company offers a secure online platform for buying, selling, transferring, and storing cryptocurrency. It provides its customers with a main financial account in the crypto space, a marketplace with liquidity for institutional crypto transactions, and technology and services for developers to build crypto-based applications.\n\n&#x200B;\n\nCoinbase can benefit greatly from the establishment of a Bitcoin ETF since it has been selected as a custodian by nine out of twelve spot-traded BTC ETF candidates. This is not surprising, given that BlackRock picked Coinbase to offer crypto services to institutional investors back in August. Although this crypto exchange came under some scrutiny from the SEC, it is still considered one of the most regulated crypto platforms.\n\n&#x200B;\n\nCOIN stock has climbed a whopping 145% since its earnings despite reporting a decline in Q3  trading volumes from $26 billion in 2022 to $11 billion this quarter. The RSI of 80 on the daily timeframe shows COIN stock is significantly overbought, investors may want to wait for a pullback before taking a position.\n\n&#x200B;\n\nSince COIN stock could benefit the most from the spot Bitcoin ETF approval, it is definitely a crypto stock to watch in 2024. Additionally, its expected earnings growth rate for next year is 30.5%.\n\n&#x200B;\n\n**MARA Stock**\n\nA crypto favorite, Marathon Digital Holdings ranks with the largest holding of Bitcoin out of the four stocks chosen. In fact, the company owns 14,025 BTC at a market value of $600 million, making it one of the largest holders of Bitcoin among publicly traded companies in the US.\n\n&#x200B;\n\nMARA is a favorite among crypto stocks and for good reason. As one of the largest, most energy efficient, and most technologically advanced Bitcoin mining companies, MARA could substantially capitalize on the crypto market’s recovery.\n\n&#x200B;\n\nSo far Marathon Digital Holdings has differentiated itself by investing in the newest technologies for Bitcoin mining. Very recently, MARA announced it was investing $179 million to acquire two new mining sites which are expected to add 390 megawatts of capacity and reduce the cost per coin mined by around 30%.\n\n&#x200B;\n\nThis all cash deal could be just one of many as MARA works to capitalize on acquisition opportunities ahead of Bitcoin’s halving in 2024. Marathon noted that its has more than $800 million of cash and bitcoin to “capitalize on strategic opportunities, including industry consolidation” ahead of the halving event.\n\n&#x200B;\n\nThis acquisition announcement has given MARA stock a notable push. The stock has climbed 33% since the announcement but had already climbed 134% since its November earnings. The RSI is notably overbought on the daily timeframe reaching an incredible 87.\n\n&#x200B;\n\nCurrently, MARA has a market cap of $4.89 billion and its expected earnings growth rate for next year is 74.5%. Those interested in capitalizing on the BTC rally may find opportunities in MARA stock in 2024.\n\n&#x200B;\n\n**BITO Stock**\n\nUnlike the other 4 crypto stocks, this one is a little different. While it does not hold BTC, it moves according to changes in the prices of the crypto making it a great opportunity for investors waiting for the approval of a spot Bitcoin ETF. ProShares Bitcoin Strategy ETF aims to produce returns that correspond to Bitcoin by tracking Bitcoin futures. However, its not without its disadvantages, for example, its 0.95% expense ratio is much higher than the average expense ratio of equity ETFs at 0.16%.\n\n&#x200B;\n\nBecause BITO holds Bitcoin futures it is able to more closely track Bitcoin returns than for-profit companies that deal with overhead costs and may have less direct exposure to Bitcoin. On top of that, BITO was one of the best performing ETF’s of 2023.\n\n&#x200B;\n\nIts YTD daily total return reached 140.08%, and it offers a yield of 14.98%. Additionally, BITO is up nearly 58% since mid-October the ETF has net assets worth $1.46 billion.\n\n&#x200B;\n\n*Crypto Stocks Forecast*\n\nAs the crypto market rallies into the end of 2023, its outlook for 2024 looks particularly bullish. With a number of catalysts ranging from Bitcoin’s halving in April, to interest rate cuts, and potential spot Bitcoin ETF approval, crypto stocks like these could be too good to ignore.\n\n&#x200B;", "id": "18pv97i", "created_utc": 1703424561.0, "score": 0, "upvote_ratio": 0.44, "num_comments": 78, "comments": [{"body": "Man all this fomo shit makes me bearish for 2024", "score": 72, "replies": [{"body": "Absolute. Maybe a short term dip but there will be a lot of new years disappointment.", "score": 7, "replies": []}, {"body": "Inverse the inverse", "score": 3, "replies": []}, {"body": "Yup fools buying the top rn", "score": 9, "replies": [{"body": "![img](emote|t5_2th52|27189)", "score": 3, "replies": []}]}, {"body": "🚀 🚀 🚀", "score": -4, "replies": []}]}, {"body": "How much adderal it take you to write all of this ?", "score": 27, "replies": [{"body": "14 Coffee cups do the trick", "score": 10, "replies": [{"body": "Good luck taking a shit tomorrow", "score": 2, "replies": [{"body": "Wouldn't 14 cups make you s#it your brains out?", "score": 15, "replies": []}]}]}, {"body": "🤣🤣🤣🤣🤣", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 19, "replies": [{"body": "I went to a wedding this weekend and lots of bros were talking about crypto and the same bullshit scams that are older than time itself. \n\nI ddint get involved and just said crypto and investing is not for me. They were already trying to rope me in whatever garbage they are dumping their money in. \n\nThey are about to lose a lot of money. But we need those regards so we can cash out this run.", "score": 13, "replies": [{"body": "Tell them to YOLO into GRV", "score": 1, "replies": []}]}, {"body": "Most Uber drivers are actually rich. Listen like he it is financial advice. This *is* financial advice.![img](emote|t5_2th52|29637)", "score": 5, "replies": [{"body": "This is *not* financial advice", "score": 1, "replies": [{"body": "What did I say? \n\nI am a financial advisor of the internet. You can trust me.", "score": 4, "replies": [{"body": "No bot today", "score": 0, "replies": [{"body": "Merry Christmas, VisualMod, and Merry Christmas, Old-Culture-4511", "score": 3, "replies": []}]}]}]}]}]}, {"body": "Was this written by ChatGPT? Seems unlikely that a human would take the time to write tickers with the name of the exchange like “NASDAQ: RIOT” or “NYSE: SQ”. I’d just say “RIOT” or “SQ”\n\nI’ve been seeing more and more posts like these. Long writeups on high beta names that were likely AI generated. Indicates that people with little investing knowledge are starting to pile in. That’s a put signal", "score": 13, "replies": [{"body": "Blatant shilling", "score": 7, "replies": []}, {"body": "Crypto is all about professional marketing. OP gets paid for this copy. And he's pro at it.", "score": 4, "replies": [{"body": "Crypto has no intrinsic value so the promoters are always looking for new bagholders to rope into their scheme.", "score": 1, "replies": [{"body": "The marketing is the only intrensic value. I hope all of you are proud of yourselves for creating this.", "score": 0, "replies": []}]}]}, {"body": "It's crypto the \"yo bro I'll sell 1 to you for 2 and you can sell 2 for 4\".\n\nVery few understand it, very few hold their own and very few actually use it for anything \n\nIt's an NFT ponzi bro pump. \n\nIf BTC was a person right now it would be the guy that has gone to the gym for 10 years and only ever done bicep curls. \n\nIt's built in greed and hype. \n\nEveryone now has forgotten or never knew the actual key points of crypto. Aka Use it as a currency, not your keys not your coin and keep it decentralized minable by regular joe. \n\nNow miners are on the fucking stock exchange, they are begging for sex approval and no one uses it as a currency. \n\nIt has become what it swore to destroy.", "score": 3, "replies": []}]}, {"body": "HUT??", "score": 7, "replies": [{"body": "No one out pizzas the HUT", "score": 3, "replies": []}]}, {"body": "I just read what Bitcoin halving was. So basically the margins of all these miners go to the gutter lol", "score": 10, "replies": [{"body": "Correct, their BTC mined per month is going to be halved. What people are bullish on is the prospect of BTC increasing in price due to the halving event and spot etf, establishing a new ATH and new median price that is much higher than previous. But yes the margins will shrink for miners.", "score": 10, "replies": [{"body": "So mining stocks is better buy when halving starts?", "score": 0, "replies": []}]}, {"body": "Bitcoin had halvings in 2012, 2016, 2020. Miner's margins in BTC terms gone to the gutter. Then it had massive bull runs in 2013 (reached $1k), 2017 ($20k), 2021 ($70k).", "score": 3, "replies": [{"body": "So mining stocks is better buy when halving starts?", "score": 2, "replies": [{"body": "I would say, buying is a better buy before halving starts.", "score": 1, "replies": []}]}]}, {"body": "So mining stocks is better buy when halving starts?", "score": 1, "replies": []}]}, {"body": "Meanwhile, Solano is redefining physics climbing back up to the $100 mark. \n\nAnyone else kicking themselves when they remember SOL was at $8 lol\n\n\nAlso OP thank you for the breakdown.", "score": 20, "replies": [{"body": "got in at 17, got out at 53, im regarded", "score": 3, "replies": []}, {"body": "“Solano” lol", "score": 1, "replies": [{"body": "[link ](https://tenor.com/view/gfy-go-fuck-yourself-angry-elon-elon-elon-musk-gif-5400252297172733531)", "score": 0, "replies": []}]}, {"body": "I got in a $60, so I am still enjoying it. I'm bullish about it.", "score": -2, "replies": [{"body": "I didn't get in at all. But I did get in on Coinbase at $75 lol", "score": 4, "replies": []}]}, {"body": "I literally looked at it last December and said I should buy 100. Look at me now ![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": -1, "replies": [{"body": "![img](avatar_exp|103505620|nani)", "score": 1, "replies": []}]}, {"body": "No problem!", "score": -1, "replies": []}]}, {"body": "Hut8????", "score": 3, "replies": []}, {"body": "Okay…so where are you positions?", "score": 8, "replies": []}, {"body": "Top is in, thanks", "score": 6, "replies": []}, {"body": "I’d say Coin or Robinhood benefit the most with BTC.", "score": 6, "replies": [{"body": "Does robinhood hold any crypto ?\nIs it trying to have a role in the bitcoin etf listing?", "score": 2, "replies": [{"body": "I believe RH holds bitcoin for their customers. One of their wallets: https://bitinfocharts.com/bitcoin/address/bc1ql49ydapnjafl5t2cp9zqpjwe6pdgmxy98859v2", "score": 1, "replies": []}]}]}, {"body": "2DTE far OTM calls just before earnings should return 10x. If not the green financials, the forward guidance in the wake of the ETF then the halving should be amazing.", "score": 2, "replies": []}, {"body": "I mean, these miners got into the $60 range during the last crypto peak", "score": 2, "replies": []}, {"body": "HIVE", "score": 2, "replies": []}, {"body": "Looks to get out once 1000% ytd hit.", "score": 2, "replies": []}, {"body": "No thanks, I'm not going to buy your crypto stocks after they've run 500% because of ChatGPT-written DD.", "score": 2, "replies": []}, {"body": "solid name in the industry", "score": 2, "replies": []}, {"body": "You're totally right! I also thought the same and bought a lot of KO's on Coinbase in November 23 and sold them with 324% profit. Now I used all the money from my sales to buy Options (HS3YUY) I think this will be a awesome year for Coinbase and that we will reach a stock price from ~480$ in the near future🚀", "score": 2, "replies": []}, {"body": "Clean Spark, take a moment and check it out...", "score": 2, "replies": [{"body": "JPM named it as one of the top. I Made a lot of money (for me anyway) this year on Clsk. Sadly I did sell 1/3 around 7.50 and covered calls claimed the rest at around $6.25. Still holding a few hundred shares 😅", "score": 2, "replies": []}]}, {"body": "Crypto is dumb", "score": 3, "replies": []}, {"body": "What about WULF and BITF?", "score": 2, "replies": [{"body": "Wulf all day!", "score": 2, "replies": []}, {"body": "You mean WUPHF right?", "score": 2, "replies": []}]}, {"body": "Get this shit back to twitter 🤢", "score": 2, "replies": []}, {"body": "prefer mara, fast machines and much more machines than hut or riot", "score": 1, "replies": [{"body": "A ton of debt on their balance sheet, I hear this’ll make it really hard for them but we’ll see", "score": 2, "replies": []}]}, {"body": "Interesting write up. Thank you for the summary!", "score": -2, "replies": [{"body": "No problem! Glad you like it", "score": -4, "replies": []}]}, {"body": "Also BitTorrent coin good", "score": 0, "replies": []}, {"body": "$DAPP and chill", "score": 0, "replies": []}, {"body": "paypal ($pypl) is slept on as a crypto play?\n\n- 400million users\n- digital wallet\n- stable $pyusd \n- paypal mafia \n- og ecom ebay pay way", "score": 1, "replies": []}, {"body": "If you really believe bulls are back in town.. Why not go full regard and gamble on the smallest of small cap coins? There are some out there issued by growing venture backed startups selling at marketcaps below 2 mil, despite the companies having hundreds of thousands of active users", "score": 1, "replies": []}, {"body": "$RIOT will rocket. Look at the comparable $MARA. Riot takes some time to catchup as it seems to be heavily shorted but the breakout will be crazy", "score": 1, "replies": [{"body": "Why do you think Riot will rocket?", "score": 1, "replies": [{"body": "See whats happening man", "score": 1, "replies": []}]}]}]}
