{"title": "Why The Odds Of A Rebound In The SP500 Are Increasing", "selftext": "Hello again investors. Most people missed my first thread earlier this year about how the NASDAQ was too far stretched beyond equilibrium and the odds of a crash were increasing. That post is linked below.  \n&nbsp;\n\n\n[Why The Odds Of A Crash in The Nasdaq Are Increasing](https://www.reddit.com/r/stocks/comments/80r87w/why_the_odds_of_a_crash_in_the_nasdaq_are/)\n&nbsp;\n\n\nThe good news (or the bad news) is that we have finally reverted back to equilibrium prices. I've pretty much been in cash since October but now I think we are close to levels where the rewards outweigh the risks again. SP500 is officially in a bear market now. The easy money of buying ever dip is over as the market moves from momentum investing back to value investing. As panic sets in and investors lose confidence, we are nearing a key technical level that should serve as support for a short term rally. \n\n&nbsp;\n\n\nWhat is that key technical level? It's the 200 week moving average.\n\n&nbsp;\n\n[SP500 2007-2008](https://i.imgur.com/NYpXx6b.png)\n\n\n[SP500 2010-2012](https://i.imgur.com/ZZA9cyY.png)\n\n\n[SP500 2009-2018](https://i.imgur.com/1Lptu45.png)\n\n&nbsp;\n\nAs you can see, from 2007-2008 and 2010-2012 charts, the market usually bounces back to the 50 week moving average a couple of months after hitting the 200 week moving average. Bear market rallies have strong counter trend rallies so even if the market rallies back to 270 in a couple of months, the overall trend is still bearish. Pick fundamentally strong stocks that are near their 200 week moving average. Avoid the rest.", "id": "a97z6f", "created_utc": 1545680014.0, "score": 51, "upvote_ratio": 0.77, "num_comments": 97, "comments": [{"body": "Yes, this is for day traders. This is gambling. A bounce will happen by January, but it will not bounce to a new all time high just as we've seen in Feb of 2008, which then followed more selling after the bounce.", "score": 11, "replies": [{"body": "Essentially everything is gambling. As a retail investor, your edge is the ability to be nimble. If the bounce fails, then you can get out with minimum losses. It’s all about risk and reward. Buying near long term trend lines always offer the least risk and best reward.", "score": 7, "replies": [{"body": "wow you're the only sane person I've seen on /r/investing, cheers", "score": -1, "replies": [{"body": "This is /r/stocks tho", "score": 3, "replies": []}]}, {"body": "> It’s all about risk and reward \n\nThere is more downside risk than upside reward at this point. \n\nBut I hope it works out for you.", "score": -1, "replies": [{"body": "Set a tight stop of around 3% after a follow through day and their is your downside risk. Close 1/3 after a 5% return, another 1/3 after 10%, and let the rest run. ", "score": 2, "replies": [{"body": "There*", "score": 1, "replies": []}, {"body": "Sounds great man, I hope it works out for you. \n\nIt isn't my principle to gamble my money like a day trader does. Since you are great at reading charts, you should do what's best for you.\n\nI am not good at reading charts I only have understanding of micro/macro economic conditions and I rely on that.", "score": -1, "replies": []}]}]}]}, {"body": "RemindMe! 1 month", "score": 1, "replies": [{"body": "I will be messaging you on [**2019-01-25 04:26:50 UTC**](http://www.wolframalpha.com/input/?i=2019-01-25 04:26:50 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/stocks/comments/a97z6f/why_the_odds_of_a_rebound_in_the_sp500_are/)\n\n[**CLICK THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/stocks/comments/a97z6f/why_the_odds_of_a_rebound_in_the_sp500_are/]%0A%0ARemindMe!  1 month) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! eci32fx)\n\n_____\n\n|[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/)\n|-|-|-|-|-|-|", "score": 1, "replies": []}, {"body": "1 month is too short for markets to recover all the beating that it had done, but whatever floats your boat. in 1 month we will not see S&P500 hit 3000.", "score": 0, "replies": []}]}]}, {"body": "Average loss for a bear market is 30 percent, just wait things are getting more dicey with no real resolve or counter momentum in sight. Few tweets could sink it further. Firing powel. China. I’m not convinced now is the time to encourage buying", "score": 54, "replies": [{"body": "Sometimes bear markets are severe and sometimes they are not. We briefly slipped into a bear market in 2011 and bounced right back at the 200 week moving average. There could be something bigger brewing but without something that changes the structure of the economy fundamentally, then buying near these levels offer the best risk/reward set up.", "score": 10, "replies": [{"body": "> we briefly slipped into a bear market in 2011 and bounced right back at the 200 week moving average \n\nthat's why its dangerous to rely solely on charts. Don't be a chart monkey. The bounce happened due to Quantitative easing round 2 in 2010 of November. in 2011 Quantitative easing round 3 happened, which propelled the stock market to the bull market that we enjoyed until 2 months ago.\n\n&#x200B;\n\nNow if you were to depend on the same bounce just because in 2011 it bounced at 200MA, you must also consider that today, we do not have Quantitative easing but rather we have quantitative tightening. if you buy solely based on the chart indicators, then you are setting yourself up for a trap. Only QE round 4 will stop this bleeding.", "score": 14, "replies": [{"body": "There’s always a reason but the fact is that the market has an upward bias and when prices get near a certain point, they find the value attractive. In 2011, it was QE. Now it may be Mnuchin calling in the PPT. The reason doesn’t matter. It’s all probability and statistics. The tech crash and the financial crisis in 2008 are the only time the SP500 has trended under the 200 week moving average for more than two weeks in the last 30 years. I would rather bet in the direction of a recovery at least until we start seeing negative jobs creations ", "score": 2, "replies": [{"body": "So you are saying that when we trade below 200 week moving average, we tend to go back to 50 week moving average soon? What is 200 week moving average and 50 week moving average for SPY ?", "score": 2, "replies": [{"body": "The SPX’s 200 week moving average is 2348. Today, we closed at 2351. The 50 week moving average is at 2740", "score": 4, "replies": []}]}, {"body": "> There’s always a reason but the fact is that the market has an upward bias\n\n[Hot hand fallacy](https://en.wikipedia.org/wiki/Hot_hand)", "score": 1, "replies": [{"body": "After every crash, the market has recovered and made new highs. Upward bias", "score": 2, "replies": [{"body": "Not from 2000-2013.  2016 adjusted for inflation.\n\nIf the SP500 reverts to a sub-2250 level, it will be neutral for 19 years (inflation adjusted).\n\nYour statement used to be true, but it hasn’t been for the past couple decades.  It may be coiling up for the other of all breakouts, but it sure doesn’t look like it this week.\n\nThis is something we need to keep an eye on...", "score": 2, "replies": []}, {"body": "That sounds exactly like the pitch Bernie Madoff made up until the feds went through his books discovering his ponzi scheme.", "score": 0, "replies": [{"body": "Name the time period in the US market where it hasn’t went higher after dropping from all time highs", "score": 7, "replies": [{"body": "The market has traded sideways for the majority of 2018, at this point you're confidence is starting to look like desperation ", "score": 0, "replies": []}, {"body": "The times the bears predicted 8 of the one recession in this decade", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Yes but today we have tax cuts that should increase the value of companies by over 21% on average. Markets are considerably below that now, so there is a counter balancing force despite no QE.", "score": -1, "replies": [{"body": "okay but be careful out there man! hope it all works out! ", "score": 2, "replies": []}]}]}, {"body": "But in 2011 there wasn't a trade war with one of our largest trading partners, nor was there public antagonizing of the fed leadership and decisions by the President, so looking at just the technicals and trends absent the context is taking a very narrow view. It's easy to imagine a situation where this gets much worse based on future public comments by the current admin about the fed chairman, more hardline tariff rhetoric or actions etc.", "score": 15, "replies": [{"body": "Exactly, in 2011 we had Quantitative easing round 3, that's why its dangerous to listen to this guy who only looks at charts lol. The circumstances were different in 2011 compared to today. We are in quantitative tightening while 2011 was in quantitative easing.", "score": 10, "replies": [{"body": "Excellently said.  People get so caught up with charts, that they negate the surrounding environment to such charts. ", "score": 5, "replies": [{"body": "I'd rather say it's wishful thinking. Reality is about to check in.", "score": 2, "replies": [{"body": "And, reality is.  This bull run was manufactured falsely. ", "score": 1, "replies": [{"body": "I wouldn't say falsely. More like QE was an attempt at fixing the problem, but as several economist has warned. It's temporary, and not fixing the underlying problems that caused the former crisis in the first place. ", "score": 1, "replies": []}]}]}]}]}, {"body": "Three points:\n\n* This all started when the Democrats won the house and I don't think that's a coincidence.\n\n* The situation with monetary policy has little if anything to do with Trump.\n\n* While 2011 had QE, it didn't have the tax cuts. The corporate rate alone will increase earnings by 21% on average (we have valuations now well below that since October 2016).", "score": -13, "replies": [{"body": "I think it has a lot to do with Trump especially the trade war and tariffs because importers pay the tariff and pass it on to customers. Furthermore, tax cuts and higher government spending increases money supply in the economy. All these increase inflation which necessitates the Fed increasing interest rates.\n\nWhy anyone thinks protectionism is good for the economy is beyond me.", "score": 2, "replies": [{"body": "Trump doesn't want protectionism. He wants *reciprocal* free trade. It's also possible that his pressure on China results in more free trade in the long term (which would be good). But yes nobody denies that trade wars are usually bad for business.\n\nThe problem with your theory is that the markets already knew about the trade war. There was nothing new in October except actually positive information on that front. So what changed in October? Well there was an election...\n\nInflation numbers were good as well so I don't think that's it. What I've said should not be particularly controversial - it's just objectively true. I guess I'm getting downvoted because I'm not blaming Trump.", "score": 0, "replies": [{"body": "Markets knew there was going to be a trade war but they didn't know how serious it would be, e.g. what tariff rates there are. As new information is released showing the tariffs would be put in place, the markets have tanked. The market hoped that the trade war would be all show to appease certain voters but that tariffs would be small or that one side would relent quickly.\n\nJust because you have an event (e.g. the announcement of a trade war or an election or the rate of interest rate hikes) the details of those events don't necessarily get disclosed until later which causes uncertainty and stock market fluctuations.\n\nFederal Reserve economists have been monitoring inflation as their primary function is inflation targeting. Their job is to keep inflation under control, and [their research in the lead up to raising rates found that inflation was indeed high](https://www.marketwatch.com/story/federal-reserve-minutes-indicate-interest-rates-will-have-to-rise-high-enough-to-slow-down-the-economy-2018-10-17). The corporate tax cuts for the rich as well as higher government spending as well as tariffs have all exacerbated inflation necessitating interest rate rises.", "score": 1, "replies": [{"body": "No none of that information was new. The new information on those fronts has actually been positive. Inflation has consistently been lower than expected. Positive talks with China and a potential resolution or at least more certainty coming soon.\n\nWhat changed in October was the political situation. You can beat around the bush all you want in order to satisfy your own politics but that's the truth.", "score": 1, "replies": [{"body": "What political situation has happened and how does it impact the stock market? ", "score": 1, "replies": [{"body": "There was an election and the Democrats won the house. No positive catalysts. Blind obstruction and increased political instability. Radicalization toward the left is also not good for markets.\n\nMarkets were fine until polls started to show Democrats winning the house. Markets fluctuated with the polls, Dems win and we see it mark the peak. These are just facts. Not saying for sure it's that but I think it's likely. Certainly the denial and downvotes I got for pointing it out here is telling.", "score": 1, "replies": [{"body": "It depends on what policies are implemented. Just because Democrats have a little more influence on policy it doesn't mean markets will be affected. Republicans are still in power and any market crash will be happening under their watch. Furthermore, Democrats have been known to pass very market friendly policies in the past, and Republican policies are not necessarily pro-market e.g. tariffs. Even though there is an election, this happened during a time of monetary policy tightening, which occured due to inflationary pressures caused by Republican policy. See the article posted before that cites Federal Reserve minutes.", "score": 1, "replies": [{"body": "So you'll have to explain why the markets are on a tear for two years straight from the time Trump was elected, and then all of a sudden, all of a sudden, they reverse in October right when the American people voted in the Democrats...\n\nDemocrats do not have market friendly policies. I'm not sure what you are talking about. Tariffs are also not Republican, in case you haven't noticed, Trump is not a pure Republican  (see prison reform) - in fact many Republicans hate him.\n\nIf you don't already understand why Democrats would be bad for markets and why the changes happening in the political landscape are scary for investors then what I say is just pissing in the wind anyway. Just pointing out the correlation. Take it as you will.", "score": 1, "replies": [{"body": ">So you'll have to explain why the markets are on a tear for two years straight from the time Trump was elected, and then all of a sudden, all of a sudden, they reverse in October right when the American people voted in the Democrats...\n\nThe markets going up when Trump was elected didn't go up after having gone down while Obama was in power. The markets have been going up ever since Obama got into power. The Democrats also only control one House. A Republican is still the President. Furthemore, just because the market goes up right after something happened, doesn't mean that what happened caused the market to go up. This is the *post hoc ergo propter hoc* fallacy. It may be that the market going up after Obama was voted out was due to policies that were implemented by Obama. The fall in the markets may be due to interest rate rises rather than the mid-term elections.\n\n[https://en.wikipedia.org/wiki/Post\\_hoc\\_ergo\\_propter\\_hoc](https://en.wikipedia.org/wiki/Post_hoc_ergo_propter_hoc)", "score": 2, "replies": []}, {"body": ">Democrats do not have market friendly policies. I'm not sure what you are talking about. Tariffs are also not Republican, in case you haven't noticed, Trump is not a pure Republican (see prison reform) - in fact many Republicans hate him.\n\nWhen it comes to market friendly policies, Democrats often have market friendly policies, but it's not as simple as saying that more deregulation is better for the markets or that cutting government is always better. Free markets don't just exist by themselves. Government needs to intervene, manage and regulate, and Democrats do indeed have a history of doing this e.g. Bill Clinton reduced public debt and presided over budget surpluses. Democrats have been market friendly in the past, but markets cannot simply be left to run by itself. The invisible hand needs the hand of government to guide it.\n\nRegardless of what a true Republican is, Donald Trump is the leader of the Republicans now, and as he said, he is a \"Tariff Man.\" Most Republicans seem to love the tariffs as well or at least most Replicans just go along with whatever Trump wants. What Trump and his supporters don't seem to understand is that tariff don't just hurt the Chinese. They hurt Americans as well because the tariffs paid by importers will be passed on to consumers, which will mean higher cost of living. Many American businesses need to import Chinese inputs for production of American products e.g. to make many American cars, you need to import e.g. a Chinese steering wheel. If the Chinese steering wheel is more expensive due to the tariffs, this means the company faces lower profits or it will cut jobs in order to maintain profitability. Furthermore, retaliatory tariffs by the Chinese will reduce demand for American exports, which will mean lower profits and/or job cuts.\n\n&#x200B;", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "The 2011 bear market was more about Europe’s debt crisis and the US downgrade in credit over political gridlock. Same thing is sort of happening now with Brexit and Italy’s budget. Unless there is a big financial crisis, central banks step in to keep the market afloat ", "score": 2, "replies": []}]}, {"body": "What is 50 week moving average? Where do you expect rebound rally will take us ?  ", "score": 1, "replies": [{"body": "Right now the 50 week moving average is around 274. So at these levels, you’re risking a 5% downside for a 15% return.", "score": 1, "replies": [{"body": "when do u expect to hit 274? Feb ? March ? June ? ", "score": 1, "replies": [{"body": "If it follows past trends then 3 to 4 months. So March or April", "score": 1, "replies": []}]}]}]}, {"body": "Perhaps if we could trust our leadership to make sound decisions.", "score": 0, "replies": []}, {"body": "Yea goy, but the dip!", "score": -2, "replies": []}]}, {"body": "is it wise to sell though?", "score": 1, "replies": []}, {"body": "Yeah but what bear ever fell straight down?", "score": 1, "replies": []}, {"body": "To be fair, the string of bad news can never end, the tweets wont stop, and stupid shit like mnchin did wont either. ( there is now direct corelation of the way the market reacts when a tweet is sent out- heading down south) \n\nChina deal maynot even happen, and there is even a highly likelyhood of impeachment next year then it ever was in this presidency- why? Because now the ONLY thing republicans cared about was the market booming. \n\nEvery tweet, every policy decision was discounted by the republicans- because their bank statements looked rosy and money is Literraly all that matters to them ( evident from decades of corporate donations and lobbying for republican congress men)\n\nNow- the market has turned- and the rich guys have lost BILLIONS in just 2 months.\n\nDT has no idea who is is dealing with, and Mnuchin Literarily had to calm the Banks nerves down- which obviously backfired.\n\nYou piss off the Banks and hedge funds and like of Koch and Waltons, and its the beginning of the end for DT.\n\nThe earlier finanancial crisis was triggered by fuck ups of the Banks. And even after that- they could barely be touched \n\nNow- this is an entirely man( tweet) made bear market. ( with a little help from the fed)\n\nLast week was proof the market is now spooked with the administration\n\nI expect some MAJOR developments to take place in Jan, to pick the market up in some way. Trumps only barometer of success( which he actually even agrees with-https://amp.cnn.com/cnn/2018/12/18/politics/trump-economy-angst/index.html ) is the booming stock market- so he HAS to make a deal to save himself. \n\nIf NOT , DT is NOT finishing a single term. The billionaires will make sure of that. \n\nAnd we can expect a drop like nothing we have seen in the past 10 years. \n\n", "score": 0, "replies": []}]}, {"body": "Your basis for a rebound is chart technicals, completely ignoring the underlying issues as to why the market is actually dropping and what that actually means for some companies with high debt.\n\nWe’ve barely skimmed the surface of a recession bubble popping, and imo the drop in prices is gonna fuck over many companies looking to refinance their debt (lenders look at stock price as part of their loan process) and if companies can’t refinance debt, well that’s what I think will burst the bubble.\n\nDropping equity prices for companies / property bundled with ever increasing debt piling is a real thing happening right now.\n\nYou might be right in the short term..but yikes", "score": 19, "replies": [{"body": "The US economy is fundamentally strong. Low inflation, low unemployment and low interest rates. The QE created a bubble in stocks that we are seeing deflate as interest rates rise but I don’t think the Fed will be as aggressive with rate hikes in the future. The real problem is the slowing growth in China. While the trade war doesn’t help, the real problem is the liquidity crunch they created with the crackdown on shadow banking.", "score": 6, "replies": [{"body": "If fundamentals were all that mattered the market would never have had the absurd run up we saw in 2017.\n\nNo one in finance uses charts as validation for trading or investing strategies except hacks on twitter who run seminars at your local holiday inn. \n\n", "score": 8, "replies": [{"body": "Actually a lot of funds use technical and fundamental analysis. There can be 300+ alpha models that go into one strategy that are constantly tweaked based on market conditions and risk. Most of the large funds use some sort of trend following which is just using the ratios of moving averages. In the end, it all comes down to risk management.", "score": 0, "replies": []}]}, {"body": "This market isn’t built on fundamentals though.\n\nThe lack of stability at the top is what’s triggering all this / and increasing interest rates.\n\nIt’s really a perfect storm and not one I wold recommend basing solely on technical indicators.\n\nCredit crunch has already started to happen with the increased junk bond spreads - if this gets worse, the markets will tank.\n\nNot the best time to buy imo.", "score": 9, "replies": []}, {"body": "If the Feds don’t raise rates, the value of the USD will be questioned. If we do really go into recession, we won’t have much room for expansion. We need the rates up. ", "score": 1, "replies": []}]}, {"body": "Fundamentals have been weak in the past, it's all on the chart", "score": -1, "replies": []}]}, {"body": "When are people going to learn that it's not time to buy while people are still saying things like, it won't go any lower or it's due for a rebound? Instead, you need to buy when people are panicked and think the end is near.\n\nDon't get suckered in to a bear market rally. As good as the advice is to hold for the long term, patience on when to buy is also as good. It's okay to hang out in cash for a little while. Sit patiently while the market works lower.", "score": 16, "replies": [{"body": "Almost no one is saying it's due for a rebound.  Everyone is saying \"The end is near\" and \"Just wait till the recession starts\".  Hence, why I'm buying but then again I always buy.  ", "score": 13, "replies": [{"body": "I keep seeing a lot of threads saying how it's a good time to buy. A sampling from the last couple of hours:\n\nhttps://www.reddit.com/r/investing/comments/a97y1s/best_time_to_buy_into_dollar_store_stocks/\n\nhttps://www.reddit.com/r/stocks/comments/a97snk/amd_nvda_intc_stocks/\n\nhttps://www.reddit.com/r/investing/comments/a97mgm/officially_a_bear_market_time_to_think_about/\n\nhttps://www.reddit.com/r/StockMarket/comments/a971sk/will_apple_stock_go_way_up_in_a_years_time_aka/\n\nhttps://www.reddit.com/r/investing/comments/a96p0h/screw_it_its_a_good_buying_day/\n\nNot sure people are really scared yet. Okay, a few Reddit posts isn't a great sampling of investor sentiment.\n\nWill the market continue to go down? Maybe. Personally, I'm waiting until Shiller PE is around 20. ", "score": 7, "replies": [{"body": "Today I suppose.  Today is literally the first day I've seen this though.  Last week no one was saying this. ", "score": 3, "replies": [{"body": "First people are anxious. Then they go into denial.", "score": 1, "replies": []}]}]}, {"body": "lol go on cnbc, everyone is saying we're rebounding soon. lmao", "score": 2, "replies": []}]}, {"body": "Why hold cash when you can just buy puts?", "score": 1, "replies": []}, {"body": "It's funny, usually there is a second wind for a small little gain before plummeting. The second win is all the people buying thinking it is going up and then realize that is not the case for a mass sell", "score": 1, "replies": []}]}, {"body": "I would advise holding off on buying at the moment. There is still lots of tension present in the markets, and the primary factor still bringing down investor confidence seems to be the Trade War. I would wait until March to start buying to see the results of the deal between China and the US on March 1st. At the moment, there is really no telling how it will turn out given recent events. When there is uncertainty in the markets, there will be selloffs. Trump is creating an extremely unstable market with his tweets and irrational behavior, and there is no telling what he will do next. Hold out, and if anything, throw in some puts/shorts. ", "score": 3, "replies": []}, {"body": "yes! I’m looking at the same thing, went pretty heavy today and Friday as we’re approaching the 200 week MA.", "score": 2, "replies": [{"body": "yikes lmao rip", "score": 2, "replies": [{"body": "we'll see :)", "score": 0, "replies": [{"body": "not wishing you bad luck but I wish that it works out for you! it's the holiday season and it'll break my heart if you went heavy today and it keeps dropping.", "score": 1, "replies": []}]}]}]}, {"body": "What's the 200 and 50 wma of spy and qqq", "score": 1, "replies": [{"body": "For Spy, it’s 226 and 270. For QQQ, it’s 131.41 and 169. Using the indices themselves (SPX and NDX) are more accurate because the ETFs are adjusted for dividends.", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "That is true but I really don’t use RSI. Oscillators can stay in oversold or overbought conditions for a long time ", "score": 2, "replies": []}]}, {"body": "If people are in cash does that mean people are going to buy houses and house prices will go up?", "score": 1, "replies": [{"body": "Housing market is actually falling because of interest rates going up", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Not historically. Usually when the market goes down, there is something wrong with credit liquidity so it’s harder to get loans ", "score": 2, "replies": [{"body": "Hmm interesting. Good to know ", "score": 1, "replies": []}]}]}]}]}, {"body": "Who cares if it's a bounce. You look at the 2007-2008 and all i see from your chart is downwards pressure. That bounce meant nothing.", "score": 1, "replies": []}, {"body": "Big money is on holiday, thats why the volume is low and everyone is shorting the rip. Day traders in total control of algo. Jan will come and big money will re-evaluate their positions into 2019. That is when you should see a bounce. Which is a chance for everyone to exit their long positions. Because it will tank again. Wait for tech earnings before re-entering. Make sure to be as neutral as possible. Short the rips and buy the bounce. A lot of money to be made both directions.", "score": 1, "replies": []}, {"body": "2009-2018 link is fucked", "score": 1, "replies": [{"body": "Thanks, just updated it", "score": 1, "replies": []}]}, {"body": "I'm tired of hoping things are looking up.\n\nUntil further notice, i'm in bear mode, meaning i'm gonna buy more Treasury ETFs and *maybe* some shares of VOO and MSFT.", "score": 1, "replies": []}, {"body": "If you’ve been all cash since October then you are in absolutely no position to give advice. ", "score": -1, "replies": [{"body": "I’ve been in mostly cash since October because the risks outweighed the rewards. As I said before, when the semi sector dips, a bear market is not far behind.\n\nhttps://www.reddit.com/r/stocks/comments/9rnnrc/comment/e8ipldm?st=JQ32H7UU&sh=c4fcd78b", "score": 2, "replies": [{"body": "That really doesn’t make any sense. The semi sector is not a bear market indicator. Sectors rotate, semis formed a top just like everything else. \n\nBut to my comment... you’re saying you knew the market was going to drop 20% back in October, but you chose to sit in cash... You didn’t buy puts or short SPY or even SMH.  You left 20%+ on the table because you went all cash. \n\nIf you’re not dollar cost averaging and your not going short then you’re trying to time the market.  What’s worse is you’re giving people advice. \n\nAt least the price is right, you get what you pay for. ", "score": 3, "replies": [{"body": "I have an options trading account and a retirement account.  I don’t have options trading in my retirement account so I’m in mostly cash. Why dollar cost average all the way down when you can build a bigger positions near the bottom of the trendline? Makes no sense. As I stated before, the market was overstretched. Now it’s back in a position where some valuations are more reasonable ", "score": 1, "replies": []}, {"body": "LOL i was just going to say... this comment is on point.\n\nNot to mention he also failed to profit from the november bounce lmfao.", "score": -1, "replies": []}]}, {"body": "you've been in cash since october, but you failed to play the bounce in november.\n\nNot only that but you didn't short SPY despite claiming to know that the market was going to dip based on your weighting of risk vs reward.\n\nsounds real sketchy from someone who has the crystal ball. lmao. \n\nanyways, good luck bro, I hope SP500 runs all the way to 3000.", "score": 0, "replies": [{"body": "You assume that I don’t mainly day trade options and use my retirement account for long term investing.", "score": 1, "replies": [{"body": "cool man, then keep day trading. The fact that you are on this subreddit announcing to the forum what you intend to do by displaying your analysis and technical jargon means you want more people to follow your strategy. Because you probably trying to get more people to boost your position.\n\nIf you were so confident, you would sit quietly and do your day trading in silence.\n\nAnyways, Merry Christmas and here's to hoping S&P500 to wit 3000 points by next month.", "score": 1, "replies": [{"body": "> The fact that you are on this subreddit announcing to the forum what you intend to do by displaying your analysis and technical jargon means you want more people to follow your strategy. Because you probably trying to get more people to boost your position.\n\nNot OP but holy shit this is a reeeeach \n\n> If you were so confident, you would sit quietly and do your day trading in silence.\n\nEveryone here talks about their technique, DD, fundamental analysis, etc... how's this any different", "score": 2, "replies": []}]}]}]}]}]}]}
