{"title": "The inevitable", "selftext": "Just wondering what people are planning to do for the inevitable interest rate rise?\n\nShifting to longer DTE?\nInflation resistant stocks?\nITM covered calls?\n\nTrying to get ahead of the curve, especially watching the last 2 weeks.", "id": "m3xznf", "created_utc": 1615605609.0, "score": 12, "upvote_ratio": 0.75, "num_comments": 65, "comments": [{"body": "who cares - I only sell puts into big red dildo days.  sell far otm when there's fear juice.  if you're that worried buy a vix call.", "score": 18, "replies": [{"body": "Newbie question here : what does it mean that you “sell into” red days? Thx", "score": 2, "replies": [{"body": "Sell puts on days the underlying is down. Premiums are higher because it's closer to the strike.", "score": 7, "replies": [{"body": "Oh! Thanks very much", "score": 1, "replies": []}]}]}, {"body": "Do you find yourself waiting a while?", "score": 1, "replies": []}, {"body": "Fear juice!  Have an upvote", "score": 1, "replies": []}]}, {"body": "Banks do better with higher interest rates.", "score": 7, "replies": [{"body": "It's quite funny, I think, to hear banks complain that with such low interest _they have too much money_. If only I knew the US banks well enough to have any idea whom to invest in. Eh, I'll figure it out eventually.", "score": 2, "replies": [{"body": "XLF or IAT and you don't have to pick individuals.", "score": 1, "replies": []}]}]}, {"body": "I think interest rates rising will matter for a while but people will stop caring at some point. The initial rise will matter but the continued rise won't. I'm moving into dividend stocks. I don't care about the dividend as much as the growth that will come over the next 6 months as everyone else has the same idea.\n\nHonestly at the moment I'm a buyer of anything nobody has wanted to touch over the last 12 months. As long as it's a real company and not speculative play. Speculative plays will be the first to go with interest rates rising. \n\nGold will have it's day soon along with the miners.\n\nEdit: Forgot what sub I was in. CSP on miners and dividend stocks as mentioned. If I get assigned I'll be good with it. Covered calls to follow.", "score": 12, "replies": [{"body": "Interesting, December I saw hrb on sale giving a 7% div. Ended up getting a bunch of 2022 calls.\n\nIf you have stocks your thinking shoot em this way. Such low volume on hrb.\n\nThe miners scare me a bit, was looking at mara. BTC doesn't feel nearly as immune to rates. Feels very much like the SPAC market as well, took a hit with the rest", "score": 4, "replies": [{"body": "That's funny. When I say miners I mean real miners. Gold, Copper, Zinc, etc. I'm not chasing the bitcoin miners! \n\nI don't follow speculative plays. Real companies that have been around a long time. Good luck!", "score": 11, "replies": [{"body": ">I don't follow speculative plays\n\nlol username doesn't check out 😝", "score": 4, "replies": []}, {"body": "Haha, makes way more sense.", "score": 1, "replies": [{"body": "KT corp ?!", "score": 1, "replies": []}]}, {"body": "Which tickers do you like?", "score": 1, "replies": []}]}]}]}, {"body": "[removed]", "score": 13, "replies": [{"body": "this guy invests", "score": 6, "replies": [{"body": "[removed]", "score": 4, "replies": [{"body": "Until that income dries up because of the pandemic, and you can't even find a new tenant and kick out your old tenant because of an eviction freeze...", "score": 3, "replies": [{"body": "[removed]", "score": 9, "replies": [{"body": "I'm not advocating for raising rent or living rent free or anything. I'm glad you seem like a good landlord and your tenants are as well. I'm just saying that a non-paying tenant is a real risk to being a landlord, especially when an eviction freeze is in place. It's not just \"infinite returns\".\n\nAlso how are you hedging against inflation if you don't raise rents on renewed leases?", "score": 2, "replies": [{"body": "[removed]", "score": 4, "replies": [{"body": "It's not just risk of asset going to zero though. It's the risk of incoming dropping if you have a problematic tenant or can't find one quickly, on a leveraged asset.\n\nAgain, looks like you have things well under control and that's great for you and your tenants, but I just feel like you're downplaying the risk of refinancing and taking on more debt. I've seen too many people do that to purchase another property, and repeat and repeat and just leveraging more and more, to the point all it takes is one property not being rented for them to start to fall under.\n\nIt's no different than people saying selling premium is free money - yeah the risk profile is great but we shouldn't dismiss what could happen and how quickly you can go under.", "score": 2, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Thanks for the reply and continued discussion. I'm learning lots in this discussion and your details are helpful in painting the risk profile you're seeing. 40% debt to equity is pretty solid.\n\nIs managing your properties your full time job? Especially if you're handling all repairs and renovations as well.", "score": 1, "replies": []}]}]}, {"body": "Where can you get a property for 100-150k that you can rent out for 1500+ a month?", "score": 2, "replies": []}, {"body": "You get it. Why do people who understand a topic the least have the strongest opinions? Retired at 41 because I was a software dirtbag who threw a lot of my income for 15 years into buying rentals.  100% on time payment from renters during covid, a single turnover (just last month) that filled in a week at a 10% rent increase. Hot housing market increased my property values by 5-10% in 2020. But please, I’d love to hear more from folks who have no idea what they’re talking about when it comes to the downside risks of real estate.", "score": -4, "replies": [{"body": "The person was asking questions and gaining an education politely. Now tell me why people like you exist?", "score": 4, "replies": [{"body": "Their initial comment was snarky and dismissive. The ensuing convo showed they didn’t know what they were talking about despite their strong opinions. I’m sorry you find facts insulting.", "score": -2, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "Hey, remember this comment? https://old.reddit.com/r/Wallstreetbetsnew/comments/m3sraq/the_key_to_the_moon_buying_a_140_call_option_on/\n\nu/left-anxiety3580 is actually a shill. \n\nHe was posting the XRT play to try and convince people to take money out of GME and put it into calls with no chance of hitting. Go back and look at their post history. Notice anything?", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Yes, highlighting the stupidity.\n\nwhat if I told you u/rensole along with all the r/GME mods were actually shills and I can prove it. Check out u/chickthief\n\nSays they are a 17yr old m with Asperger's ...they mod GME. Says he trades illegally under age and as someone else https://old.reddit.com/r/teenagers/comments/kf9qls/selfpost_weekend_is_active_introduce_yourself_and/gg856tu/?context=3\n\nu/plumdragon is now trying to defend the mod trading illegally.", "score": 1, "replies": [{"body": "Here's a sneak peek of /r/GME using the [top posts](https://np.reddit.com/r/GME/top/?sort=top&t=year) of the year!\n\n\\#1: [I am u/bEAc0n and my wife approved of me dumping $1 per upvote into GME. She said she likes the stock but she wants proof that there are enough retarded autists to make this work. 🚀💎🙌 TURN IT UP FOR LORI, IT’S ACTUALLY ALSO HER 28TH BIRTHDAY TODAY 🎂🎉🎈](https://np.reddit.com/r/GME/comments/lthi3p/i_am_ubeac0n_and_my_wife_approved_of_me_dumping_1/)  \n\\#2: [77% of people surveyed believe Robinhood's restriction of meme stocks during the GameStop frenzy was market manipulation, new report finds](https://www.businessinsider.com/robinhood-gamestop-reddit-survey-market-manipulation-restrict-trading-wallstreetbets-2021-3?amp) | [737 comments](https://np.reddit.com/r/GME/comments/lvgdwx/77_of_people_surveyed_believe_robinhoods/)  \n\\#3: [Endgame DD: How last weeks actions all come together to one specific Date. All the data analyzed.](https://np.reddit.com/r/GME/comments/ltua0n/endgame_dd_how_last_weeks_actions_all_come/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/joo7mb/blacklist_viii/)", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "why do you all keep making multiple posts to say the same things? Why are you not concerned as a mod of r/GME that /u/chickthief is admitting to trading illegally?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "why arent you concerned that your fellow mods are admitting to illegal trading? Also, how are you tracking me down? Also, what exactly are you threatening me with? Please be specific. \n\n/u/chickthief has admitted to being under age and trading illegal as someone else.\n\nWhat are you going to do to me for saying this? Be specific please", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "What do I have to worry about? The internet police coming to get me for telling you your mod is trading illegally?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Its sad that /u/chickthief is admitting to illegal trading? Why arent you concerned that they have admitted to being under age 17 and trading under someone elses name while being the moderator or r/GME? you know, a financial sub about a specific stock thats being heavily manipulated.\n\nThe mods are 17yr olds trading illegally?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "wait, so now you know they are illegally trading?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "What lines do I need?\n\n/u/chickthief has admitting to committing felonies and you seem to be more upset that Im telling you than for them committing them.\n\nIf you knew they were committing this crimes why didnt you say something?", "score": 1, "replies": []}]}]}, {"body": "\"international borders\" hahahaha", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Oh so you do think looking at your public profile on your public account on this social media platform is worse than committing actual felony crimes such as illegal trading?", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Had 2 rental properties. Ended up converting those into REITs. Renters in my area are being less and less desirable :(", "score": 1, "replies": [{"body": "So yeah something like that is what makes renting out less desirable to me.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Hope your tenants trash your places at more of a cost that what you earned while raising your rent prices.\n\nParasite.", "score": -12, "replies": [{"body": "Aww, does poor widdle baby want to live in someone else's house for free? Maybe your mommy will let you.", "score": 7, "replies": []}, {"body": "Miserable cunt", "score": 5, "replies": []}]}]}, {"body": "I think its going to be overplayed. I'm cash-heavy and ready to buy my favorite tickers", "score": 4, "replies": []}, {"body": "I'm trying to psych myself up for a PMCP on some growth darling, but they're all so bloated that I can't afford them after I sunk cash into PMCC LEAPS back in January... Ugh.", "score": 3, "replies": [{"body": "I’d been eyeing ZM for a while but it’s soooo expensive", "score": 1, "replies": []}]}, {"body": "Inflation friendly stocks is the way to go imo.\n\nThe 10yr is heading towards 2%, no question. Growth stocks are going to get hammered - ton of red flags the past 2 weeks sprinkled with some bull traps. The majority of investors are being irrational thinking that the amount of wealth created this past year equates to 2-3% inflation. The Fed will have to step in before the end of 2021, I can almost guarantee it.", "score": 5, "replies": [{"body": "Have some favorites to share?\n\nI'm thinking of heading towards abnb and maybe some banks. But would like a couple more.", "score": 2, "replies": [{"body": "ATT has been doing well and has a nearly 7% dividend. XOM has also been doing well.", "score": 2, "replies": []}]}, {"body": "What would you label as some inflation friendly stocks friend", "score": 1, "replies": [{"body": "I’ve been perusing the holdings of $INFL which is an inflation oriented ETF\n\n\nhttps://finance.yahoo.com/quote/INFL/holdings?p=INFL", "score": 6, "replies": []}, {"body": "Value/dividend stocks, banks, gold (Kirkland Lake/Barrick), TIPS, real estate. Problem is these aren’t really theta gang names. I’m a bit torn on what to do myself. Do I take the risk on growth names and collect better premium or move money into safer areas? This bull run could continue on for years, tough call.\n\nTiming will always be the hardest thing to predict.", "score": 4, "replies": [{"body": "I sold gld csp that is deep itm . Totally didn't expect it", "score": 1, "replies": []}]}]}, {"body": "Do you like Con Ed?", "score": 1, "replies": []}]}, {"body": "Any of several things could happen. The market could throw a temporary tantrum then get over it. Or it could plummet and never recover. Or it could jump as it prices in the recovery. Or it could sell off because recovery was already priced in. Or it could do anything at all for no reason whatsoever.\n\nIf you are convinced the market will decline, go delta negative. If you're just concerned, maybe hedge your positive deltas a bit and/or diversify into uncorrelated or inversely correlated positions.", "score": 1, "replies": []}, {"body": "Thinking about possibly opening a position on TMV, its a 20 year treasury 3x bear etf, as rates go up it goes up. Might buy a few shares to hedge or possibly buy a call on it.", "score": 1, "replies": []}]}
{"title": "Best Boomer/Dividend aristocrats to sell against.", "selftext": "I’m looking to adjust my watchlist with the idea that interest rates are going up to 2%. I’ve sold against BAC and T in the past. The premiums were not as wonderful as our darling PLTR but I’m done with the vida loca for a bit. F looks like another candidate and *maybe* GE. What other action am I missing out on? I like to keep the underlying at around $50 and under atm while I grow this portion of my portfolio. I tell myself I’m wheeling but I’ve never been assigned and I could see myself just taking the L and moving on after rolling once if it seemed like the situation for the stock had really changed. Appreciate any ideas Gangstars.", "id": "m4gms9", "created_utc": 1615673088.0, "score": 51, "upvote_ratio": 0.89, "num_comments": 62, "comments": [{"body": "Ko puts.\n\nOne strike away, you're being rascally warren and will get 1% per week \n\nTwo strikes roughly half that.\n\nThree strikes away and you'll get .8% to 1% per month and never be assigned. That works out to two or three times the dividend, ftr.\n\nFive year low is low 40s, high is high 50s. Stock doesn't do shit.\n\nSell on down days two or three weeks out, close on up days, reopen next time it's down.", "score": 38, "replies": [{"body": "Seems like a situation where you might want to sell an iron condor?", "score": 17, "replies": [{"body": "100%", "score": 4, "replies": []}]}, {"body": "KO is pretty expensive here if you’re selling puts...\n\nMake sure you use your math skills to actually estimate the Present Value of a stock before potentially having to purchase it!", "score": 2, "replies": [{"body": "I don't know what you're talking about, and I don't think the stock market does either. if Coke is overvalued then it has been overvalued for 30 years.", "score": 3, "replies": [{"body": "Agree to disagree. I’d be really curious what interest rate and growth rate you’re putting into your net present value equation, though", "score": 1, "replies": [{"body": "You're trying to answer a question that wasn't asked. No one asked is KO fairly valued relative to whatever your theory is\n\nThe question was what boomer dividend companies around 50 bucks are decent to sell against. And KO fits all of those criteria, whether or not you think it's fairly valued relative to its peers.\n\nOne more thing I forgot to mention is high volume and liquidity. Maybe lots of other companies have better balance sheets, but they don't have options buyers", "score": 3, "replies": [{"body": "If it's overvalued, it's not good to sell against. Most people don't like to be bag holders, even if those bags aren't GME-sized", "score": 0, "replies": []}]}]}]}]}]}, {"body": "X, american steel is always good premium and volatility it's great for wheeling or just straight up premium selling on both sides.", "score": 34, "replies": [{"body": "X may retrace a bit of last week's gains soon, which would be a good entry for a put.", "score": 6, "replies": [{"body": "X is going to climb for a minute with the infrastructure announcements upcoming so probably don't bet on that", "score": 5, "replies": []}, {"body": "I've got an inverted strangle it's been rough lol but I've collected over 5$ so my break evens should be around 28.", "score": 2, "replies": []}]}, {"body": "X GONNA GIVE IT TO YA", "score": 5, "replies": []}, {"body": "I was going to say CLF for steel. \nBLD for EE home insulation. California’s home building requirements are increasingly stricter. BLD has a solid record of beating earnings and they’re an industry standard.\n\n“The California Energy Commission updates the Building Energy Efficiency Standards (Title 24, Parts 6 and 11) every three years by working with stakeholders in a public and transparent process.”", "score": 4, "replies": []}, {"body": "This. I have naked puts in my options account and sold CCs in my retirement account", "score": 1, "replies": []}]}, {"body": "If you can color outside the lines of your $50 ceiling, or don't mind selling a monthly CSP, GM is a great option. All the stability of an old school auto company, with the upside of EV development. Premiums won't blow you away, but they're not bad.", "score": 26, "replies": [{"body": "GM is exactly the kind of industrial play I’m looking for. I’ll look into it for sure.", "score": 24, "replies": [{"body": "I just recommended Gm before reading comments, sorry bout that not trying to spam the thread with gm", "score": 1, "replies": []}, {"body": "Gm looks like they are leading the EV tech compare to other car manufacturers.", "score": 1, "replies": []}]}]}, {"body": "Looking through my wheel portfolio and throwing you my less speculative stuff under $50.\n\n$AXL  \n$BMY ($60)  \n$CLF  \n$CNR  \n$CSCO  \n$F  \n$FCX  \n$GM ($59)  \n$HL  \n$KGC  \n$MRO  \n$NLS  \n$SWBI (crap premiums, rarely able to write)  \n$VALE\n\nI'm pretty heavy into steel/commodities right now if you couldn't tell.\n\nHappy to share high level DD on any of the above if needed basically why I like it).\n\nNot investment advice, yadayadayada.\n\nGlanced at my divi portfolio as well for the things that I tend to write CCs on:\n\n$BMY and $CSCO re-appear there  \n$DVN  \n$GILD ($65)  \n$PBFX  \n$T", "score": 11, "replies": [{"body": "I'm also heavy in Steel and started to move away from memes and into Dividend stocks. Currently have puts on  LMUN, QCOM, KMI, T and WPC.  I'll have to check a few of these on your list. I had COST which I like but didn't like that much capital in one put. Thanks!", "score": 2, "replies": [{"body": "Yeah I still have some meme stuff I do that's higher volatility also.\n\nWheeling 33 stocks currently with another 8 just waiting on a red day for re-entry.\n\nHigh volatility plays are: PLTR, BLNK, AQMS, EBON, RKT, QCOM, WWR, NPA, SRAC, GME...\n\nThen have some standard stuff like BABA, TSM, AMD, LMT etc.", "score": 3, "replies": []}]}, {"body": "What's your favorite commodity in that list under $50 and can you link me to some DD on that one specifically? I'm in way too much tech only.", "score": 2, "replies": [{"body": "I like $CLF although you may want to wait for retracememt back to ~$16 (although I'd likely DCA my way in starting now).\n\nCheck out r/vitards. Loads of DD on everything steel.\n\nAnything with rare earth metals would be good for the next few years as well. Copper, nickel, manganese, lithium, etc.\n\nAlso here's a short high level DD on just a few of the reasons why I'm bullish on $CLF.\n\nhttps://www.reddit.com/r/Vitards/comments/ly466v/i_am_so_friggin_jacked_on_clf/", "score": 2, "replies": [{"body": "Here's a sneak peek of /r/Vitards using the [top posts](https://np.reddit.com/r/Vitards/top/?sort=top&t=all) of all time!\n\n\\#1: [Welcome new members!](https://np.reddit.com/r/Vitards/comments/lcvx2h/welcome_new_members/)  \n\\#2: [1k Upvotes and I will ask my friend Warren Buffett for advice.](https://np.reddit.com/r/Vitards/comments/l3ny57/1k_upvotes_and_i_will_ask_my_friend_warren/)  \n\\#3: [Steel prices and steel/mining stocks - WTF is going on?!?! A DEEP Dive and The Super Cycle.](https://np.reddit.com/r/Vitards/comments/l4d8zj/steel_prices_and_steelmining_stocks_wtf_is_going/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/joo7mb/blacklist_viii/)", "score": 1, "replies": []}]}]}, {"body": "Hey—I know this thread has been dead for a minute but I was looking at CSCO today and it’s IV percentile is 0. I looked at buying a straddle for right after earnings. What’s your take on CSCOs IV over the next couple months?", "score": 1, "replies": []}, {"body": "Nice write up I'm going to have to look at some and add them to my watch list.  I am moving into materials as well, especially Uranium.", "score": 1, "replies": [{"body": "Yeah I had checked out UUUU and others in the Uranium space. I'm not sold that it'll do much. If I wanted a Uranium play, I'd be more inclined to look at companies that service nuclear power plants than companies that mine/deploy uranium. I really really wanted to write puts on $UUUU @ $5.00 but am just not convinced the price will sustain.\n\nMy understanding is that several countries have massive stockpiles of Uranium they could chose to unload if it becomes worthwhile to do so. I don't trust it as a commodity right now, but do think nuclear still has a strong rebound ahead.\n\nSome good stuff at world-nuclear.org if you search, in particular: https://www.world-nuclear.org/information-library/nuclear-fuel-cycle/uranium-resources/supply-of-uranium.aspx", "score": 2, "replies": [{"body": "Thanks for your input! ill do a bit of digging.", "score": 1, "replies": []}]}]}]}, {"body": "I second GM. I think the premium is ok. \n\nMPC pays a dividend and is moving up. Premium is ok. \n\nSPG and O for real estate with a dividend. \n\nKHC is an interesting low key play.", "score": 8, "replies": []}, {"body": "FYI, GE is considering a reverse split.", "score": 7, "replies": [{"body": "Yeah I saw that. Good reminder though. The 8:1 reverse is gonna kill it for me if it does. I was wondering about trying to sell before the split and then watching the adjusted options just get slaughtered by the lack of liquidity.", "score": 8, "replies": []}, {"body": "How does a reverse split affect option sellers and buyers?", "score": 7, "replies": [{"body": "The CBOE will adjust the options after the split. Typically liquidity starts to breakdown after that because people don’t want to end up with a weird number of shares rather than a block of 100.", "score": 8, "replies": []}]}]}, {"body": "$O and $KO are two to look at. \n\n$O is a nice one to own too because they do a monthly dividend, so if you get assigned you might be able to catch a win on the dividend and then do an ITM CC and profit.", "score": 6, "replies": []}, {"body": "T or MMM", "score": 3, "replies": []}, {"body": "NLY\n\nVZ\n\nT", "score": 3, "replies": []}, {"body": "Exxon Mobil. I know the stock has come back and it's a lot of boomers favorite bc they recognize the brand but the company is in a structural decline. The company has been funding their dividend through step borrowing and sales of assets. Long-term I think the company's prospects are pretty dim and I wouldn't own it personally. If I had to pick between AT&T and ExxonMobil I would definitely go with AT&T but I don't like that company either.", "score": 3, "replies": []}, {"body": "If I'm looking for a more defensive, lower volatility trade I like the following blue-chips: PEP, KO, MCD, JNJ, PG, DG, ABT, WMT", "score": 3, "replies": []}, {"body": "Try Eaton Corp. traditional, boomer stock, but did well in 2020. Diversified Industrial with electric, auto, fluid power businesses. Not sure how much options volume there is on it tho.", "score": 2, "replies": [{"body": "I believe they are “buy American,” so they can be facility standard fixtures. Essentially any buy American company can have the federal government by the balls. If I wasn’t knowledgeable about what boxes of stuff and which vendors are unavoidable I would be investing in those companies.", "score": 2, "replies": []}]}, {"body": "MO is good and undervalued right now too", "score": 2, "replies": []}, {"body": "Sold NESN 17.12.2021 P90 on friday for 258, makes an annualized return of 3,7% cash secured.", "score": 2, "replies": []}, {"body": "I like XLE, the energy etf. About half of it is Chevron and Exxon. I've been selling puts for a while, keeps pulling ahead.", "score": 2, "replies": [{"body": "I feel like the Biden administration adds some complexity to that choice. Looking at it there are steep cliffs in the past. I feel like a pro EV administration could cause an upset in energy.", "score": 2, "replies": []}]}, {"body": "I've got T, X and SPG short puts now. Didn't sweat that Nasdaq drop two weeks ago.", "score": 2, "replies": []}, {"body": "Energy stocks? OKE, BP OXY, RDS A and RDS B are all sub $50 all pay dividends. I own some of them for the dividends, I am not a boomer. Does that make me boring?", "score": 3, "replies": [{"body": "Forgot to mention I’ve sold against BP in the past. It did okay! I like the sector but do think OPEC could blow the whole sector up again with little to no effort.", "score": 1, "replies": [{"body": "I agree with this, and why I'm getting the f out of oil. My only play will be XLE and maybe XOM.  I'm still bagholding energy from 2019. Happy to finally widdle down the amount t I have invested there.", "score": 1, "replies": []}]}]}, {"body": "<$50: $OXY, $AAL, $AA, $DVN\n\nSlightly over $50:  $XOM, $C, $OKE,", "score": 2, "replies": []}, {"body": "SOS...Bitcoin miner... Plus its being shorted by corpo's.. Can you say tendies??", "score": -9, "replies": []}, {"body": "I bought a OTM LEAPS for Jan 2022. Am I retarded? It costed 95$", "score": -22, "replies": [{"body": "I don’t know what underlying did you buy the LEAPS on?", "score": 6, "replies": [{"body": "Underlying? I'm not in profit till 34.44\n\nUp 7% now\n\n\nIt was more of 'a lot can happen in two years' sorta play.", "score": -19, "replies": [{"body": "Are you saying you bought LEAPS on PLTR? If so I like the company long term and own some shares. I’ve sold against it in the past with the idea that I’d take assignment if I needed to. I’m just really trying to keep this portion of my portfolio as consistently cash as possible and draw downs to a minimum. Honestly if interest rates crush PLTR I might buy a LEAP myself and just sell calls against it.", "score": 2, "replies": [{"body": "No AT@T", "score": -2, "replies": [{"body": "How did the 5G auction go for them and how are they doing with their HBO and direct TV segments? I would guess the bull case rests on those issues. My impression is $T has been trading sideways for awhile and that people mostly own it for the dividend but with a rotation to “value” who knows?", "score": 5, "replies": []}]}]}]}]}]}, {"body": "Gm has done me ok, my shares got called away but I’ll chip away with csp’s. The premiums actually aren’t too bad, nothing to the wild bois but worth looking into.", "score": 1, "replies": []}, {"body": "Here is my target dividend aristocrat list, broken out by month of ex dividend dates:\n\nJan,Apr,July,Late Sep/Oct: CSCO, JPM, T, VZ, SYY, HRL, ABBV, ABT, CL\n\nFeb,May,Aug,Nov: XOM, WBA, ADM, EMR, CVX, ED, AFL, RTX, DOW\n\nMar, Jun, Sep, Dec: VFC, MRK, KO, MDT, NUE, CAH\n\nEach is a bona fide dividend aristocrat or dog of the Dow, each offers weeklies. I think this list was limited at price < $120 at the time I made it.", "score": 1, "replies": []}, {"body": "You can find the dividend yield, as well as the payout ratio, P/E, P/FCF, EV/EBIT, and Return on Invested Capital for the Dividend Aristocrat stocks here:  \nhttps://modernvalueinvestor.com/dividend-aristocrats-list/", "score": 1, "replies": []}]}
