{"title": "Investing my first $3,000 into the stock market. Where to start?", "selftext": "I want to buy apple stock but not sure what else I want to buy. What's a few good tips or safe stocks to diversify a portfolio?", "id": "9iu1vv", "created_utc": 1537895592.0, "score": 104, "upvote_ratio": 0.89, "num_comments": 177, "comments": [{"body": "iNdeXFuNd", "score": 153, "replies": [{"body": "* Index Fun", "score": 29, "replies": [{"body": "Don't forget to give him the D", "score": 13, "replies": [{"body": "That’s what she said", "score": 2, "replies": [{"body": "Strange situation ", "score": 6, "replies": []}]}]}]}]}, {"body": "S&P500 ETFs", "score": 122, "replies": [{"body": "This is the obvious answer.", "score": 28, "replies": []}, {"body": "I second this guy. If you intend to invest for the long-term, please do not buy individual stocks. A bit is ok, just for fun, but in the long run it's more risky and won't give you a better chance of making money. Especially with only 3k, it's not a good idea because of transaction costs. If you think about it as everyone is investing in 'what they know well', compared to the market average, the collective amount won and lost by people playing individual stocks will be 0 - even if they all think they 'know the stock they are investing in well'. But even worse, due to transaction fees, buying and selling individual stocks will on average be worse than buying and holding something that tracks the market. Unless you are value investing (investing without intent to sell, but based on the value of the company—what Buffet does), you won't be able to beat the market. You won't be able to buy low and sell high, and you won't be able to predict specific stocks (and with 3k, trying to do this is an especially bad idea). Play it safe and invest in an Index Fund or ETF. With only 3k, I would recommend an ETF because I believe a lot of Index Funds have minimum deposit amounts that are higher than 3k (I'm not sure though). I would recommend \\~20% in VXUS and the rest in VOO or VTI. If you want to play around with stocks like VO, VBR, or VSS, that's probably fine, but you really have no idea if they'll do better or worse than VTI. Even more risky is stuff like VGT or VHT (Vanguard index funds, risky?!?), but again, there's no way to know if they'll do better or worse than the market.", "score": 13, "replies": [{"body": "Unless you go through Robinhood exchange and buy HSGX or axogen. Biotech is the bomb", "score": 7, "replies": [{"body": "Sure, Robinhood gets rid of transaction costs, but biotech or otherwise, buying individual stocks is a bad idea.", "score": 4, "replies": []}, {"body": "You think HSGX is a good buy now? ", "score": 2, "replies": [{"body": "Hell yes", "score": 1, "replies": []}]}]}]}, {"body": "ETFs by far. Superior returns in comparison for the effort you need to put in to secure the returns. I’m not sure when this next financial “correction” will happen, but other than that. They are always a SOLID. Starting point while you learn and can watch your money do some work! ", "score": 3, "replies": []}, {"body": "boring ", "score": -14, "replies": [{"body": "If this was posted to r/wsb I would have posted something drastically different", "score": 20, "replies": [{"body": "It’s not a bet if you know what you’re doing ", "score": 1, "replies": []}]}]}]}, {"body": "Step 1) Open Roth IRA\n\nStep 2) Transfer your $3k into Roth IRA\n\nStep 3) Buy a nice index fund, or 50-100 shares of a high dividend, mature stock (BP, RDS.B, T, VZ, etc.)\n\nStep 4) Dividend reinvest always\n\nStep 5) Max out annual contribution to Roth IRA\n\nStep 6) Buy more\n\nStep 7) Never sell unless rebalancing or dividend yield craters, and even then...\n\nStep 8) ???\n\nStep 9) Profit!!!\n\nedit: format\nedit edit: VZ not V", "score": 87, "replies": [{"body": "This all the way. I'd go as far as to suggest market ETFs with decent dividends and a track record for success. DGRO or VTI are good options. You'll not have the short term thrills you'd get going WSB style, but long term you'll be glad you went this route with it", "score": 10, "replies": []}, {"body": "Maybe you mean VZ, because the yield on V or visa is abysmal", "score": 5, "replies": [{"body": "Absolutely this. Thx for catching the typo :D", "score": 2, "replies": []}]}, {"body": "V is better than VZ", "score": 3, "replies": []}, {"body": "How do you learn all this? I'm a senior in hs and after watching video after video and reading article after article, I still can't understand these steps. \n\nMaybe I'm just dumb.", "score": 2, "replies": [{"body": "Follow them, and you will understand. :)", "score": 2, "replies": []}]}, {"body": "This is they pussiest shit I’ve ever seen. ", "score": -9, "replies": []}, {"body": "Pussy.", "score": -14, "replies": [{"body": "Let the new kid on the block taste some success before encouraging spec plays and strategies with 3x leveraged ETFs and their inverses!", "score": 14, "replies": [{"body": "My stance has not changed.", "score": -5, "replies": [{"body": "Hey, I get pounded all day at work and by life in general, don't need my portfolio pounding me too ;)", "score": 1, "replies": []}]}]}, {"body": "This isn't r/wallstreetbets ", "score": 2, "replies": []}]}]}, {"body": "There really only is one answer. $TSLA 420 calls. Nut up and MUsk up.", "score": 242, "replies": [{"body": "Hi r/wallstreetbets", "score": 53, "replies": [{"body": "What's that?", "score": -2, "replies": [{"body": "A place for only the most tender tendies. As it says in the info, like 4chan found a Bloomberg terminal. ", "score": 5, "replies": [{"body": "They seem so smart. No wonder people here are scared.", "score": 1, "replies": []}]}]}]}, {"body": "Funding secured", "score": 14, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "10/19s, got to go far out or theta will fuck you.", "score": 6, "replies": [{"body": "We need more THETA!!!!!!!!!!!!", "score": 2, "replies": []}]}]}, {"body": "How about now?", "score": 2, "replies": [{"body": "More so. ", "score": 1, "replies": []}]}, {"body": "Wrong sub buddy", "score": -34, "replies": [{"body": "Oh I'm sorry I thought this was r/stock market.", "score": 14, "replies": []}, {"body": "Get some faggies", "score": 3, "replies": []}, {"body": "Fuck you", "score": -24, "replies": [{"body": "Lol chill out pal", "score": 8, "replies": [{"body": "I’m not your pal, buddy! ", "score": -20, "replies": [{"body": "I'm not your buddy, pal.", "score": 2, "replies": [{"body": "I’m not your pal, friend!", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "As a beginner, you can start with the simplest ETF - [Vanguard S&P500](https://www.morningstar.com/funds/xnas/vspvx/quote.html) or [SPDR](https://www.morningstar.com/etfs/arcx/spy/quote.html)\n\nWhy?\n\nFor 2 reasons, low expense ration below 0.1% and those ETF covers the most popular market SP500 index.\n\nOnce you get the knowledge, you can look at worldwide etf or individual stocks.  \n\n\nI can help you with starting your investing journey, just send me a message and we'll manage it.", "score": 10, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "I believe it is nothing more than the company that operates it. The return of those two should be identical in the long run. (Maybe negligible differences)", "score": 1, "replies": [{"body": "Vanguard seems to be much more ahead of the game than the others. They adjusted for facebook and other sector switch last week while a others are going to be having a Hell day tomorrow. ", "score": 1, "replies": []}]}, {"body": "The company weights are different and I would assume the available liquidity is also different. ", "score": 1, "replies": [{"body": "Yup, SPY is much more liquid.", "score": 2, "replies": []}]}, {"body": "Look at the expense ratio.  Vanguard is prob cheaper (.04).  Also, Schwab and Vanguard have no fees for their funds.", "score": 1, "replies": []}]}]}, {"body": "Buy Amazon Calls Tendies for daisies ", "score": 35, "replies": []}, {"body": "go with what you are familiar with. or be ready to do some research.\n\ndon't just take what people say in here, i got burned a couple of times (and in some other instances i made good money).\n\nyou win some, you lose some. but you lose less if you are informed.\n\ni started with tech stocks i'm very familiar with. \n\nso far AMD has given me 170% increase from initial investment.", "score": 39, "replies": [{"body": "I agree with this. I did the same as I work in IT. All of my tech stocks are doing well. They were easy to pick as I already had pretty good intimate knowledge of them and their competition.\n\n&#x200B;\n\nMy stocks outside of that, some are doing good, some are meh. They took some time for me to pick out after research and analysis. And now I have a better idea about those sectors and my picks are going to get better from here. So yeah for your first stock or two go with what you know. Then branch out from there.", "score": 7, "replies": []}]}, {"body": "$MU 90C", "score": 26, "replies": [{"body": "I have this stock and it’s been underperforming since I got it. ", "score": 14, "replies": [{"body": "r/wallstreetbets", "score": 16, "replies": []}, {"body": "You're looking at the chart wrong", "score": 7, "replies": [{"body": "Just flip your phone upside down ", "score": 18, "replies": [{"body": "Just delete your trading apps.", "score": -2, "replies": []}]}]}, {"body": "Hold. The simiconductor industry is not done yet.   Play the long game and win. ", "score": 1, "replies": [{"body": "I’ve got some AMD and NVidia too, but Micron has gone down 30% in the last 3 months alone. ", "score": 1, "replies": []}]}]}, {"body": "This is the only answer", "score": 2, "replies": []}]}, {"body": "This belongs in r/wallstreetbets ", "score": 50, "replies": [{"body": "We are a kind and noble people. TLRY $50 PUTS go big or go home bitch", "score": 48, "replies": []}]}, {"body": "[https://investor.vanguard.com/mutual-funds/profile/VTSMX](https://investor.vanguard.com/mutual-funds/profile/VTSMX)", "score": 6, "replies": []}, {"body": "From lowest risk+return to highest:\nETF>individual stock picks>options\n\nIf you don't know what you're doing than ETF is the way to go.", "score": 5, "replies": []}, {"body": "MU 90c 10/5\n\nTLRY 50c 10/5\n\nAMD 40c 9/28\n\nSNAP 6p 10/5", "score": 5, "replies": [{"body": "Can I  be invited to the 10/6 tendie party?", "score": 1, "replies": []}, {"body": "My guy !", "score": 0, "replies": []}]}, {"body": "Voo. There are a lot of good companies. If you pick one you will miss out on something else. Just buy them all.", "score": 12, "replies": [{"body": "Spoken like a true Bogledite", "score": 5, "replies": [{"body": "What’s bogledite precious?", "score": 3, "replies": [{"body": "Lmao, jack bogle, former vanguard CEO. Always talks about buying an entire piece of the market like you did, coincidently Voo is a vanguard index", "score": 3, "replies": [{"body": "Cool never heard of him, I’ll check him out.", "score": 3, "replies": []}]}, {"body": "Keep your nasty chips!", "score": 1, "replies": []}]}]}]}, {"body": "Buy weedstocks. You'll make more.", "score": 11, "replies": [{"body": "These guys get it. Get MJ", "score": 9, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Same!", "score": 1, "replies": []}]}]}]}, {"body": "ITOT = total market fund", "score": 3, "replies": []}, {"body": "MU weekly FDs FTW. ", "score": 3, "replies": []}, {"body": "Disney", "score": 5, "replies": [{"body": "+1", "score": 1, "replies": []}]}, {"body": "Go with an index or mutual fund fund just because when you have $3000 you cant really diversify well otherwise which leaves you to more risk of the stock going down where as a fund with many stocks in it would have some go up and down, but over time would be more likely to go up on a continued basis.", "score": 6, "replies": []}, {"body": "Microsoft and Disney are two of my favorites right now.  They are both consistently moving up at a good rate and have plenty of appealing prospects ahead of them.  You could also jump on the AMD bandwagon as well.  I’ve been riding them for awhile and they have been good to me.  I keep thinking their bull run will eventually die out, but every time I think they’ve reached their ceiling they just keep pushing higher the next week.  They are starting to calm down though recently.  Earnings next month should be the next big movement in the stock if they have a good earnings which seems likely.  SQ has also continued to impress me and you can sell covered calls on them with their juicy option prices.  Just play it conservative and go for ones a good ways in the money though.", "score": 3, "replies": []}, {"body": "Don’t listen to these guys, come on over to r/wallstreetbets if you want the good stuff", "score": 3, "replies": []}, {"body": "Marijuana stocks are the new meme stocks. Put it in a S&P 500 ETF and maybe a dividend ETF. Set it and forget it.", "score": 3, "replies": []}, {"body": "I think Amazon’s a good bet looking at how it’s disrupting retail. ", "score": 8, "replies": [{"body": "He can literally only buy 1 amazon with $3,000 though.", "score": 6, "replies": [{"body": "And still have $1,000 to invest elsewhere.", "score": 0, "replies": []}]}, {"body": "Yeah, give me that moonshine", "score": 3, "replies": []}]}, {"body": "Square, Amazon, Apple, Visa, Microsoft and also weed stocks: CGC, CRON, Aurora, or MJ ETF", "score": 7, "replies": [{"body": "> also weed stocks\n\nJust... lol.\n\n", "score": 2, "replies": []}]}, {"body": "$DIS has got legs at the moment. \n\nDo your reseach & spread your 3k over 5/6 stocks my dude. You'd be crazy to put the whole $3k into Apple considering they just did their yearly product reveal..", "score": 2, "replies": []}, {"body": "Fidelity Contra Fund has a fantastic record long term. ", "score": 2, "replies": []}, {"body": "$SQ", "score": 2, "replies": []}, {"body": "MU\nAMD\nTLRY\n\nsorry wrong sub\n\n\n", "score": 4, "replies": []}, {"body": "Amazon ", "score": 2, "replies": []}, {"body": "Check out TQQQ. It’s basically an S&P index on steroids. ", "score": 3, "replies": [{"body": "This is the correct answer. ", "score": 1, "replies": []}, {"body": "That’s a leveraged ETF.", "score": 0, "replies": []}]}, {"body": "Wait til Tilray is back at 300 and buy 10 shares #gainz", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "> Barnes and noble\n\nLolwut.", "score": 0, "replies": []}]}, {"body": "SQ ", "score": 1, "replies": []}, {"body": "with $3K you shouldn't be buying any single stock. Invest in a single balanced ETF, or just go All World Equity (there are good ones with each brokerage). My recent favorite is actually NTSX", "score": 2, "replies": []}, {"body": "SQ -Square. I just doubled from $40 back in Feb", "score": 1, "replies": [{"body": "he wants to invest now, not 3 months ago. SQ massively over valued. infact I think it's worth a short. \n\nedit: well done on the +100% though man!\n", "score": 7, "replies": [{"body": "I also bought NVDA after it was up 300% in a year and am up an additional 100%. Just because a stock is overbought doesn’t mean it’s going straight back down, especially if the fundamentals of the stock and the business is growing at 45% YoY", "score": 2, "replies": [{"body": "I've also been HODL on NVDA since March. \n\nNVDA are a market leader chip manufacturer who literally just announced they have almost cracked real time ray tracing. They have solid results every quarter. There is still growth to be had in my opinion, lets see how the RTX technology pans out. It's exciting times for NVDA and games fans.\n\nNVDA are an investors paradise IMO - almost the prefect company. Not a services company whose revenue is 5% of it's market cap, who exist in an already saturated market.", "score": 2, "replies": []}]}, {"body": "so overvalued that it went up 11 percent today...lol", "score": 2, "replies": [{"body": "FOMO dude. You probably bought today.", "score": 1, "replies": [{"body": "Proud owner since $39 and lovin it! I thought I was FOMO'ing then :-)", "score": 1, "replies": [{"body": "100% is not to be scoffed at. Grats man.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Great timing. Everything is at all time highs", "score": 2, "replies": [{"body": "Do you suggest to hold out and wait? ", "score": 2, "replies": [{"body": "Sarcasm aside, I would put my money on BRK.B and hold forever. I personally would wait for a slight pullback but in general, time invested in the market beats timing the market.", "score": 2, "replies": [{"body": "Out of all the shit I’ve read, this is what it comes down to. Also doing your research on the stocks you want to invest in will help you make better decisions. Set it and forget it. ", "score": 1, "replies": []}]}]}]}, {"body": "To be real with you. Wait for a dip in Apple and then buy far out calls atm. Apple had 2 really good days rn, might correct ", "score": 1, "replies": [{"body": "1.5 percent is really good?", "score": 1, "replies": []}]}, {"body": "MU $90 C 9/28", "score": 1, "replies": []}, {"body": "$AMD $MSFT $AAPL SPDRs", "score": 1, "replies": []}, {"body": "VTI for stocks MUB for bonds", "score": 1, "replies": []}, {"body": "SQ when it dips ", "score": 1, "replies": []}, {"body": "Let me direct you to /r/wallstreetbets", "score": 1, "replies": []}, {"body": "Lose it all on weed stocks ", "score": 1, "replies": []}, {"body": "NOSIX is a pretty good index fund", "score": 1, "replies": []}, {"body": "Like value? MU all in.", "score": 1, "replies": []}, {"body": "Index fund. Don't bother with individual stocks. You won't know when to sell and when to hold. ", "score": 1, "replies": []}, {"body": "EYPT. Strike while the iron is hot, but do your research and use discretion. ", "score": 1, "replies": []}, {"body": "I-N-D-E-X-F-U-N-D.", "score": 1, "replies": []}, {"body": "Throw it in a Roth IRA, buy SCHG or VOOG. Hold forever ", "score": 1, "replies": []}, {"body": "All in on TLRY $50 puts", "score": 1, "replies": []}, {"body": "Emergency fund market 500", "score": 1, "replies": []}, {"body": "S&P500 a month from now would have made you like 20 dollars - whatever trade commissions. It's pretty safe bet but it's very boring.If you do index funds be prepared to ignore it for years to come.\n\nAlternatively you can look up how to fundamentally evaluate companies you like before investing in them to see if its worthwhile and learn the game. It's always better to do this instead of take random peoples words.", "score": 1, "replies": []}, {"body": "ITOT or VOO or VTI and leave it. ", "score": 1, "replies": []}, {"body": "Tilray ... jk... index fund, growth etfs ", "score": 1, "replies": []}, {"body": "Spy", "score": 1, "replies": []}, {"body": "AAPL AMZN BRKB V SPY", "score": 1, "replies": []}, {"body": "Microsoft is a solid stock. Pays a small dividend and it’s been steadily rising. Wouldn’t be shocked if it hits $150 in 9-12 months. ", "score": 1, "replies": []}, {"body": "Put your cash into a no load mutual fund until you learn more about investing (I started with FBALX).", "score": 1, "replies": []}, {"body": "Canadian Marijuana", "score": 1, "replies": []}, {"body": "Your first 3k?\n\nKeep it in cash. ", "score": 1, "replies": []}, {"body": "By reading your question, I guess you want to play safe. I would suggest buying the stock of a company that is now in the market for long time. The stock price remains stable mostly (even though the price is high), but it will continue to remain stable.\n\nJust research about what new stuff the company is going to take up in the financial year and you're good to go.", "score": 1, "replies": []}, {"body": "$mu. seriously though. if you can read a financial statement, interpret p/e, and listen to the guidance you will be convinced", "score": 1, "replies": []}, {"body": "Junk bonds and gold ETF’s  >;) ", "score": 1, "replies": []}, {"body": "Wait for the crash. Then buy. We're due for a huge correction", "score": 1, "replies": []}, {"body": "TLRY or bust", "score": 1, "replies": []}, {"body": "Buy a share of ILMN you won’t regret it ", "score": 1, "replies": []}, {"body": "I'd study the market for at least a year first. ", "score": 1, "replies": []}, {"body": "Weed and solar are rapidly growing sectors that could give you pretty good returns in the coming months/years.", "score": 1, "replies": []}, {"body": "Invest in education first. Accessatrader is where I started back in 2012, changed my life", "score": 1, "replies": []}, {"body": "r/wallstreetbets", "score": 1, "replies": []}, {"body": "Just keep in mind we are no longer in a buy and hold environment anymore, and take into account the market is very due for a correction with stocks at their all time highs.. I’m not saying it’s going to crash but educate yourself before throwing money into it ", "score": 1, "replies": []}, {"body": "1 share of Amazon, 1 share of Google.", "score": 1, "replies": []}, {"body": "UPRO. It’s the S&P 500 but it’s triple leveraged so it moves up or down 3 times what the S&P 500 does. It’s pattern is upwards and it’s diversified so I call it’s safe enough but with compound returns. That’s what I’ve seen anyways. Look into it.", "score": 1, "replies": []}, {"body": "$MU has been popping up a lot.\n\nCan't go wrong with AAPL.\n\nI'm also putting some long term prospects for $NVDA\n\nA combination of AI R&D, bioinformatics, and advancements in video game tech and CGI has made me quite excited for what these companies can do. ", "score": 1, "replies": []}, {"body": "Please dont invest in the stock market right now. When it halves (which it will at some point) and everyone on cnbc is screaming bloody murder, your friends are thinking of movin to more of a bond portfolio for their investments, then put your money into QQQ it recovers faster and harder than SPY or DOW. \n\nInteractive brokers has decent comissions compared to the scott/etrade/thinkorswims of the retail trading world. ", "score": 1, "replies": []}, {"body": "just research. If you want to buy apple its not a bad investment, i got in around 100.", "score": 1, "replies": []}, {"body": "3k wont go very far with Apple. Find cheap stocks under 10 bucks. You'll make more cash. Look into the marijuana sector. ", "score": 1, "replies": [{"body": "This is not the right answer. Figure out how much risk you're willing to put in. The reliable way is lower risk. OP you'll learn soon that cheap price ≠ good price. If you want to do something cheap. Then I would suggest still putting your money in something that is actually established and use a small portion for the riskier ones. Do your research, investopedia.com will answer most any question you have about objective things.", "score": 1, "replies": []}]}, {"body": "HMNY", "score": 1, "replies": [{"body": "No more than $20", "score": 1, "replies": [{"body": "Yes, minimum stock price in 1 year $20", "score": 1, "replies": [{"body": "I hope so I would make a great profit. But I doubt it.", "score": 1, "replies": [{"body": "You're gonna be rich my dude", "score": 1, "replies": []}]}]}]}]}, {"body": "Canopy growth is a safe bet I would say. ", "score": -4, "replies": [{"body": "Lol if this is your safe bet I'd hate to see the unsafe ones. I agree it will likely hold or increase but it is not nearly as established or steady as many of the large corporations. ", "score": 9, "replies": [{"body": "Within the next 2-3 years it will be established well, obviously a long term hold for me.", "score": -5, "replies": []}]}, {"body": "\"Safe\"", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -7, "replies": [{"body": "Lol", "score": 3, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "I am financially independent @ 24. Keep buying Apple, I dont give a shit. ", "score": -4, "replies": []}]}]}]}, {"body": "How about investing $200-$300 on some trading courses. If you start investing without a firm understanding of market fundamentals and a clearly defined trading strategy you might as well give me your money. ", "score": 0, "replies": []}, {"body": "#Marijuana businesses\n\nCGC and CRON will give you a good return on your money ", "score": -7, "replies": []}, {"body": "Get some low cap mj etf more room to grow a lot of volatility if you can handle the pressure ", "score": -1, "replies": []}]}
{"title": "My take on $PLUG power, near and long term tendies, DD inside", "selftext": "**TLDR**: Buy $PLUG $3 11/16 calls for tendies as Plug Power will see the results of opening new factory, developing robots to take advantage of autonomous forklifts and delivery trucks, and developing new tech to double power storage. $AMZN, $NKE, and $WMT already use their equipment (and will purchase more) and $FDX has conducted 7500mi of deliveries in the Albany area using a Plug Power powered FedEx truck. Institutional investors have doubled their positions by millions of shares and all eight of its board members have purchase shares four times since the beginning of the year.\n\n&#x200B;\n\n**DD**:\n\nWSB listen up - Plug power is going to pop soon with a price target of $3.57, a 90% increase over its current price for the near term tendies. It will increase over the next quarter further as it completes its transition from research company to viable manufacturing company. I have 155 $3 11/16 calls for the near term tendies based around its 11/8 earning report, which I'll then turn over to 3/15 calls for the long term tendies where I expect it will jump yet further.\n\nWalmart, Amazon, Nike, and FedEx have opened contracts with Plug Power for hydrogen powered forklifts and vehicles. Hydrogen power might seem lame but their niche is in industrial forklifts and local deliveries where time spent recharging is thousands of dollars a minute. Their CEO Andy Marsh has also been named to the U.S. Department of Energy Hydrogen and Fuel Cell Technical Advisory Committee, giving the business the political connections it needs to succeed. Jonathan Silver, a member of the board of directors, is also a former US Department of Energy official. They are also pursuing European expansion to become an international company, where the political connections will offer them an advantage over their competitor Bloom Energy.\n\nAll eight of the board members have purchased hundreds of thousands of shares in the company four times since the beginning of the year, most recently in late August, signalling that they see a positive future for the company as it has turned around from a research company to a viable industrial and manufacturing business. Institutional investors have increased their stakes by millions of shares - Odey Asset Management Group Ltd bough an additional 2,330,000 shares increasing their stake in the company to 4,910,000 shares. Ignore the misleading title of the article and read content for a breakdown of the institutional investor increases: ([https://www.fairfieldcurrent.com/2018/09/23/insider-selling-plug-power-inc-nasdaqplug-director-sells-31343-shares-of-stock.html](https://www.fairfieldcurrent.com/2018/09/23/insider-selling-plug-power-inc-nasdaqplug-director-sells-31343-shares-of-stock.html))\n\nThis is also different than a vehicle running on LPG or other alternative fuel. The hydrogen isn't burned in the traditional sense, but is instead run through a membrane that strips the electrons from hydrogen using a catalyst and generates electricity directly from the reaction - the hydrogen then bonds with available oxygen and generates water as a byproduct. The advantage of this type of system is the reduced refueling/recharging time compared to traditional electric forklifts that are used in warehouses, and the reduced emissions compared to traditionally powered forklifts. Their systems are retrofit-capable and can be fitted to currently owned electric forklifts, reducing the overhead of purchasing all-new equipment.\n\nThey have also in-sourced the production of the membrane electrode assemblies to further reduce costs ([https://www.gasworld.com/interview-with-plug-power-ceo/2015463.article](https://www.gasworld.com/interview-with-plug-power-ceo/2015463.article)) and opened a new almost 40k SQFT factory in Rochester New York ([https://dailygazette.com/article/2018/08/15/plug-power-adds-factory-in-clifton-park](https://dailygazette.com/article/2018/08/15/plug-power-adds-factory-in-clifton-park)). They used to purchase their membranes for their equipment from their competitor Bloom Energy, and now that they are producing their own membranes they have announced two new pieces of technology - a new membrane that doubles the energy output of its fuel cell system, and their partnership with Rensselaer Polytechnic Institute and the US DOE to develop a robotic fueling station and reduces the time needed to refuel and allows the the usage of autonomous warehouse equipment powered by its system. ([https://fuelcellsworks.com/news/plug-power-rensselaer-polytechnic-institute-and-national-renewable-energy-laboratory-develop-robot](https://fuelcellsworks.com/news/plug-power-rensselaer-polytechnic-institute-and-national-renewable-energy-laboratory-develop-robot))\n\n&#x200B;\n\nEdit: Positions: [https://imgur.com/a/kroYzCw](https://imgur.com/a/kroYzCw)\n\n&#x200B;\n\nEdit Edit: Here's a list of the companies who have begun using the Plug Power fuel cells - I imagine the quantity will increase as the tech demonstrates its potential vs straight battery powered electric forklifts [https://www.plugpower.com/customer/whos-using-gendrive/](https://www.plugpower.com/customer/whos-using-gendrive/)\n\n&#x200B;\n\nAnother edit: Also apparently more than just WSB is moving here because nobody here buys shares and volume is up 4mil over avg. \nhttps://www.reddit.com/r/wallstreetbets/comments/9iz4bg/wsb_shaking_up_plug/?utm_source=reddit-android", "id": "9itqha", "created_utc": 1537893509.0, "score": 117, "upvote_ratio": 0.97, "num_comments": 156, "comments": [{"body": "That’s a lot of writing. I’m in. ", "score": 95, "replies": [{"body": "Solid logic.", "score": 29, "replies": [{"body": "Up 60% already lol 😂😂", "score": 16, "replies": [{"body": "Fuck you man I’m only up 10", "score": 7, "replies": [{"body": "Now 80% 😂", "score": 6, "replies": [{"body": "20 hahahah", "score": 3, "replies": [{"body": "100!", "score": 2, "replies": [{"body": "Fuck you!", "score": 3, "replies": [{"body": "140...", "score": 2, "replies": [{"body": "You jinxed it", "score": 2, "replies": [{"body": "Fuck", "score": 1, "replies": [{"body": "dammit", "score": 1, "replies": []}]}, {"body": "We good we good", "score": 1, "replies": [{"body": "Now I’m at 80% lmao", "score": 1, "replies": []}, {"body": "Fuck you jinxed it again", "score": 1, "replies": [{"body": "Should I say it??", "score": 1, "replies": [{"body": "Yeah", "score": 1, "replies": [{"body": "160", "score": 1, "replies": [{"body": " I sold", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "I used to follow u/jrkman logic because i'm an illiterate autist but then i discovered text to speech and now the computer does the reading", "score": 4, "replies": [{"body": "It worked. This time. Lol", "score": 1, "replies": []}]}]}, {"body": "Bless you op", "score": 2, "replies": [{"body": "I just hope WSB doesn't kill it - November is a long ways away in WSB time", "score": 4, "replies": [{"body": "I’m up 160% since you posted. I might just take it. You think there’s more to come eh?", "score": 2, "replies": [{"body": "I think this is a short term boost from WSBers but that we'll see a runup in early November prior to earnings", "score": 3, "replies": []}]}, {"body": "Too late. Shit gonna dump now. ", "score": 0, "replies": []}]}]}]}, {"body": "K, 2 grand in this. You're wrong and I'm shoving a fan up your ass and putting it on the turbo setting.", "score": 81, "replies": [{"body": "I'm all in on this shit so it's $ROPE and your turbo fan or tendies galore", "score": 44, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Sent PM - show me how to add screenshot and I will\n\nEdit: Added to post", "score": 8, "replies": []}]}, {"body": "So how ya feeling?", "score": 1, "replies": [{"body": "Well I slowly exited my position the past week since the volume is low and bought 700 shares instead so that timing is less important", "score": 1, "replies": [{"body": "This is the last time I’m ever taking WallStreetBets advice. Hell I don’t know why I took it in the first place.  It’s wallstreetbets. ", "score": 2, "replies": [{"body": "And then recent events tanked the stock. FML", "score": 2, "replies": []}]}]}]}]}, {"body": "I took 50 contracts so I'll hold his arms down.", "score": 17, "replies": [{"body": "I got 500 let's fucking do dis\n\nedit: in at .05 out at .10, will add this to my watchlist and rebuy when the wsb tards shake out", "score": 7, "replies": []}]}, {"body": "$1.2K on this. Y'all better not be pumping and dumping this stock.", "score": 6, "replies": []}, {"body": "Nah, shove a butt PLUG.  😂", "score": 5, "replies": []}, {"body": "There is a part of me that wants OP to be wrong so that I can see that turbo in action. ", "score": 1, "replies": []}, {"body": "Well fuck me for buying calls yesterday. Getting murdered today.\n\n&#x200B;\n\nIs it rime to insert the fan?", "score": 1, "replies": []}, {"body": "This shit is down a penny since this post. So much for WSB pump. boooo", "score": -1, "replies": []}]}, {"body": "I jumped in with 50 contracts \n\nEDIT: lmaooooo value went up 50% real quick\n\nEDIT EDIT: WHICH ONE OF YOU FUCKERS HAS WEAK HANDS STOP SELLING", "score": 54, "replies": [{"body": "Lol", "score": 13, "replies": []}]}, {"body": "Hasn't this company been a dumpster for years?", "score": 28, "replies": [{"body": "Absolutely - but I see them turning around for the first time in a decade with the new developments as they become manufacturing business and focus on forklifts.\n\nI don't see their H2 powered cars taking off any time soon but reducing the downtime for electric forklift recharging is where I think they're going to hit gold", "score": 19, "replies": [{"body": "Over Promise; Under Deliver is their motto. ", "score": 12, "replies": [{"body": "Sounds like the WSB buy high sell low motto", "score": 16, "replies": []}, {"body": "Same as Tesla. Look at where that is", "score": 2, "replies": [{"body": "Oh yes. PLUG is identical to TSLA.  Excellent analysis. ", "score": 10, "replies": []}]}]}]}, {"body": "PLUG is from WSB back in 2014, and the stock sucked then just as now.\n\nIf you buy PLUG, might as well buy some 3D printing stock and finish off the stupidity. It’s the wave of the future! Everyone is gonna use it!!", "score": 9, "replies": [{"body": "I think it'll break out because self driving forklifts and shit are also the wave of the future right now in warehouses and fueling them with shit that takes less time than charging batteries but also doesn't give the exhaust that diesel does seems the best fit, especially when they're automating the refueling process with a 2 million dollar grant from the DOE. \n\nHowever you might be 100% right - what makes sense to me doesn't always make sense to investors and some additional DD gleaned from the comments shows that the leadership in the company has some issues that I wasn't aware of so we'll see. I put my best effort into putting together the DD to give back but I also might just be seeing the mirage of tendies and confirmation bias.\n\nThat said, I'm all in $PLUG so I fucking hope I'm right or I'm broke and will have a fan shoved in my ass", "score": 8, "replies": []}, {"body": "Bingooooo", "score": 5, "replies": [{"body": "Also, WSB sucked back then. People were just throwing money into super speculative shitty low cap fad stocks. \n\nThe new WSB era kicks ass.", "score": 5, "replies": [{"body": "I dunno have you seen all the Biotech posts recently? and I'm pretty sure even my shit is speculative until it rains tendies", "score": 3, "replies": []}, {"body": "You realllly should have put /s at the end of your post.   This WSB is a fucking dumpster and I hate everyone. \n\n\nGet the fuck off my lawn. ", "score": 3, "replies": []}]}]}, {"body": "I'm up 100% on my XONE calls so suck my nut, 3-d printing is the future of american manufacturing", "score": 2, "replies": []}, {"body": "Bought $PLUG $3 calls for $.06 then turned around and immediately listed them for $.12 just to see if WSB autists would eat it up and they did. Should've actually put some dollars in instead of just experimenting.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 23, "replies": [{"body": "I bought at .07 fuck", "score": 15, "replies": [{"body": "Literally worst buy ever. sell.", "score": 12, "replies": [{"body": "It hasn’t even moved", "score": 4, "replies": []}]}]}]}, {"body": "We’re probs the ones pumping this. ", "score": 22, "replies": [{"body": "same thing that happened with admp. stock jumped .40 after it got posted to wsb the other day", "score": 1, "replies": []}]}, {"body": "Man Glassdoor is a graveyard for this company, everyone seems to hate the CEO and working there.\n\nhttps://www.glassdoor.com/Reviews/Plug-Power-Reviews-E9782.htm\n", "score": 20, "replies": [{"body": "Good insight - I didn't think to check Glassdoor\n\nReading the reviews they're definitely polarized and I'd like to think it's because they haven't been wildly successful yet but that could be confirmation bias since I yolo'd my poor mans portfolio into them", "score": 17, "replies": [{"body": "Glassdoor always tends to skew negative but when a lot of the issues get repeated from different people in different areas of the company it definitely makes me nervous. Seems like the kind of place that would benefit tremendously from new executive leadership. ", "score": 7, "replies": []}]}, {"body": "You got me curious and I did a quick search.\n\n\"Plug is one of the largest manufacturers in the Albany area and is also one of the area's few public companies, employing 644 engineers, researchers and technologists, including 108 temporary employees, at the end of 2017.\"\n\nAt this size of over 500 employees, people shouldn't be so drastically and directly impacted by CEOs as they should be a few levels removed from the CEOs direct report. Sounds like a shit show.", "score": 7, "replies": [{"body": "I agree, I usually take Glassdoor with a grain of salt but seeing similar comments directed towards executive leadership from different sections of the company is always a red flag to me, and a lot of the reviews are fairly recent. ", "score": 3, "replies": []}]}]}, {"body": "You fags bought so many contracts the premiums went up and share price went down from a couple hours ago....", "score": 17, "replies": [{"body": "Noticed this as well. I sold for a profit after the price dipped lmao", "score": 7, "replies": []}, {"body": "IV set by the market (WSB) in action!  \n\nhttps://marketchameleon.com/Overview/PLUG/IV/\n\nOption volume and IV through the roof today.  OP created volatility - I wonder if he sold anybto yall for 300% gain.\n\nNow lets watch the stock trade sideways for 2 weeks and IV drop back down to normal.", "score": 7, "replies": [{"body": "Haha was tempted but I gotta stick it out for the November tendies otherwise I'd be a fucking scrub. Plus I had bought in over the past couple days at .048 avg cost so I ain't seen no 300% on my end", "score": 2, "replies": []}]}]}, {"body": "This is some real DD. Just because things should happen doesn't mean they always do, but you convinced me to get a position.\n\nEdit: got in at $.03 and its already at $.11 - OP, you're a genius", "score": 17, "replies": []}, {"body": "Just got into this shit. First option ever... tendies or bust. ", "score": 14, "replies": []}, {"body": "https://m.timesunion.com/business/article/Plug-Power-sued-over-forklift-fatality-13196864.php\n\nJust a heads up", "score": 14, "replies": [{"body": "Yeah but lithium batteries explode too - I think it is a one-off failure that will impact their safety equipment but until they start having a Samsung Note level failure rate I don't think it'll have an impact on the bottom line\n\nAlso they are 5 other companies who got sued too for that incident and I don't think anything will come from it, particularly as the main components in that forklift came from Ballard power based on the reading I did", "score": 3, "replies": []}]}, {"body": "Took your advice and I’m up 300% already today. Bless you sir.\n\n[My only regret is that I didn’t buy more](http://imgur.com/pfPfuH7) ", "score": 9, "replies": []}, {"body": "Been in on this for about a year now...its been pretty much flat that entire time so hope you are right", "score": 7, "replies": []}, {"body": "Sharpen the pitch forks fellas ", "score": 6, "replies": [{"body": "Got a couple weeks left guys....guys....c'mon guys ...", "score": 3, "replies": [{"body": "Fuck you OP, you’re retarded", "score": 3, "replies": [{"body": "Autistic", "score": 3, "replies": []}]}]}, {"body": "This shit tanked hard my b", "score": 2, "replies": []}]}, {"body": "Anything to be made on $2.5 11/2 calls or is it  $3 11/16 or bust?", "score": 5, "replies": [{"body": "I think there'll be a runup leading to the 11/8 earnings call where it'll drop post-earnings as everyone pulls out tendies", "score": 8, "replies": []}, {"body": "That's what Im thinking, no volume on the 11/16s and its already run up a bit so im looking to grab 11/2 calls and (hopefully) profit off the pre-earnings run up", "score": 4, "replies": [{"body": "Ive already gotten +80% tendies on the $3 11/16 calls though, gotta hand it to OP. Considering where the price on $PLUG is rn id say your best bet is to scalp a dip & try to get em around $0.06. I got em at $0.05 and theyre running $0.09 as I type this. The 11/2 calls do seem really tempting though. Little more of a gamble to anticipate an earnings runup than to reap the after-earnings tendies.\n\nEdit: roughly 30 minutes later and my tendies are +160%", "score": 4, "replies": []}]}]}, {"body": "picked up 55 11/16 $2 calls", "score": 7, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "What’s a share", "score": 5, "replies": [{"body": "I dunno, but it sounds dumb.", "score": 3, "replies": []}]}]}, {"body": "is there a reason for the random 5.3% jump today?", "score": 6, "replies": [{"body": "Its hard to sift through the media bots that are 95% of the news on this company but there were a couple articles last night about fuel cell powered forklifts and their viability as well as about institutional investors increasing positions", "score": 3, "replies": []}]}, {"body": "Bought at .11, ready for this to dump on me.", "score": 5, "replies": []}, {"body": "I bought 25 calls at .04, came backan hour later and closed 8 at .12. Letting the rest ride. \n\nThanks for the free money!!!", "score": 5, "replies": [{"body": "Everything is better when it’s free!", "score": 3, "replies": []}]}, {"body": "I fell for this shit shit 5 years ago. Its not happening now.", "score": 4, "replies": [{"body": "It's your money dude - I'm gonna ride this tendie train to hell", "score": 2, "replies": [{"body": "But they don't make any tendies right now, even for themselves. I'll hold out for the next earnings report", "score": 2, "replies": []}]}]}, {"body": "!RemindMe 11/16/2018 \"i lost everything because of him\"", "score": 4, "replies": [{"body": " !RemindMe 11/2/2018 \"I am even more fucked than this guy\" ", "score": 1, "replies": [{"body": "I will be selling before 11/8 so probably 11/7 in the runup so I'ma be happy", "score": 2, "replies": []}]}]}, {"body": "Thank you man! I’ll save a one of my tendies for yah", "score": 4, "replies": []}, {"body": "Nice pump and dump OP", "score": 4, "replies": [{"body": "Since it was my first DD post I didn't anticipate that everybody and their brother was going to hop in too and spike the IV to stupid. Now I'm nervous that IV crush is going to kill this shit for the earnings call.\n", "score": 1, "replies": [{"body": "IV crush man but bravo on pumping this so good. ", "score": 1, "replies": []}]}]}, {"body": "Put $500 in this. Worth a shot thanks op ", "score": 3, "replies": []}, {"body": "Sheesh, my 10/19 calls have gone up a nickel each, solely due to this thread.", "score": 3, "replies": []}, {"body": "I was invested in $PLUG for a couple years but sold a couple months back. You convinced me though on this. Im in. ", "score": 3, "replies": []}, {"body": "Is anybody concerned with AMZN and WMT having warrants for 55 million shares, and the higher price between the two is $2.22/share.  I'm sure that was a bargaining chip for two monster companies to use their products.  If PLUG does well and they bite on the warrants...it essentially waters down the forward movement.", "score": 3, "replies": [{"body": "Great info, I was about to pull the trigger until I read this. ", "score": 2, "replies": [{"body": "Yeah I was almost jumped in too.  Seems odd that it wasn’t mentioned by the OP.....just saying.", "score": 3, "replies": [{"body": "Confirmation bias - I was looking for all the positives and lost sight of the Glassdoor reviews and the share warrants that could have given me a more well rounded DD. I'll keep it all in mind for my next DD post I research", "score": 1, "replies": []}]}]}]}, {"body": "I'll bite, $2.5 11/16 Calls @0.18. For the tendies", "score": 2, "replies": []}, {"body": "already doubled.  thank you ", "score": 2, "replies": []}, {"body": "This company has been a bigger turd than my daily morning dump. Hot pumper. Traded it years ago and lost my tendy money.", "score": 2, "replies": []}, {"body": "I've been long on $PLUG for a while now. I'm loaded up on shares and 2020 $2 calls let's go.", "score": 2, "replies": [{"body": "Wish you the best", "score": 1, "replies": [{"body": "Dude people are still commenting and buying because of your post. Your post is like the Mecca for people to lose money. \n\nRespect to for not deleting it for the sake of others and just keeping it up regardless.  ", "score": 3, "replies": [{"body": "Yeah I fucked this one up really good. I was confident based on my research it would be Q1 2019 they turn a profit. But now it looks like a slim possibility of a FY19 EBITDA positive profit, and not really turning a true positive profit until 2021. Which is depressing.\n\nBut hey I lost a bunch of money, learned some shit, and my next DD post I'll do some more research. I think the thing that fucks WSB a lot, particularly in tech, is thinking about things like how cool the fuel cell filling robots are and reduced downtime of forklifts and how it will enable autonomous forklifts and blah blah. Basically overthinking about how cool it is or what niche it will fill or how it will \"revolutionize\" something. I think institutional investors, who really drive the market, are more about bottom lines, current and future revenue, and sustained growth. And that's probably about it.", "score": 2, "replies": []}]}, {"body": "Dude people are still commenting and buying because of your post. Your post is like the Mecca for people to lose money. \n\nRespect to for not deleting it for the sake of others and just keeping it up regardless.  ", "score": 1, "replies": []}]}]}, {"body": "Plug hit 2.60 today and doesn’t show signs of stopping ", "score": 2, "replies": []}, {"body": "I’m not gonna read all of that, but I saw something about a new plug ❄️🌳", "score": 4, "replies": []}, {"body": "This company has been stuck in the doldrums for 4 years. They have contracts with big companies yet can't make any damn money. You'll need to be extremely patient on this one, and I don't think betting on OTM calls in the near term is the right play. Buy shares if you're long, or stay away. There are better plays out there than this.", "score": 2, "replies": []}, {"body": "Hey /u/100percentangusbeef your post is now on the [WSB DD list. Click here to read more DD.](https://new.reddit.com/r/wallstreetbets/search?sort=new&restrict_sr=on&q=flair%3ADD).\n\nIt's important that anything marked DD is useful information for other traders. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD, mods have been notified of this thread.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "fuck it yolo", "score": 1, "replies": []}, {"body": "in $2 calls @ .30 \n\n", "score": 1, "replies": []}, {"body": "Robinhood denied my buying power today, so had to pay commissions on E\\*Trade.  Great analysis and excited to see where this goes.  Thank you for sharing.", "score": 1, "replies": [{"body": "I learned everything I know from WSB just trying to give back", "score": 3, "replies": []}]}, {"body": "In it m. 6 $3 11/16 calls. Currently up 30%, you think it will grow much further than that in the next couple months towards expiration?", "score": 1, "replies": [{"body": "Lol so what like $3? Come on man ", "score": 1, "replies": [{"body": "$18 :) haha. Ik ik, gotta start somewhere tho. Dumped almost 1/2 my account into this ", "score": 1, "replies": []}]}]}, {"body": "ive been holding 5K shares since $2.50, bought early but a long term hold.", "score": 1, "replies": []}, {"body": "So when should we expect to sell off our calls? Before or after earnings report?", "score": 1, "replies": [{"body": "I'm planning on selling before because I think it'll dip after and take the money and out it into March calls", "score": 1, "replies": []}]}, {"body": "I made a little off that ticker before. Maybe I'll jump back in.", "score": 1, "replies": []}, {"body": "I'm goin in. I hope I don't have to help shoving that fan up ur ass!", "score": 1, "replies": [{"body": "Just look at the short term gains and dream of all the tendies that'll come in November", "score": 1, "replies": []}]}, {"body": "Also check out Loop Energy. They’re private but they’re still a competitor based in Vancouver. \n", "score": 1, "replies": [{"body": "Wtf does private do for me?", "score": 3, "replies": [{"body": "Just for product comparison. \n\nLoop claims to have the highest efficiency, so if you find their efficiency you could compare these guys product to Loop", "score": 1, "replies": []}]}]}, {"body": "I sold mine right before it started going down. ", "score": 1, "replies": []}, {"body": "[https://www.fleetowner.com/running-green/quietly-plug-power-slips-two-big-fuel-cell-advancements](https://www.fleetowner.com/running-green/quietly-plug-power-slips-two-big-fuel-cell-advancements)", "score": 1, "replies": [{"body": "Read that a few days ago that's two of the things I mentioned in the DD. The real question is timing whether all this is wrapped into this earnings call or if they hold until next year to announce it all. I imagine they will go early but we'll see", "score": 2, "replies": []}]}, {"body": "are you still holding?", "score": 1, "replies": []}, {"body": "Whaddup OP. you owe me $5k. \n\nKidding. You should post an update though i have no DD nor position just curious how this played out!", "score": 1, "replies": [{"body": "Yeah I fucked this one up really good. I was confident based on my research it would be Q1 2019 they turn a profit. But now it looks like a slim possibility of a FY19 EBITDA positive profit, and not really turning a true positive profit until 2021. Which is depressing.\n\nBut hey I lost a bunch of money, learned some shit, and my next DD post I'll do some more research. I think the thing that fucks WSB a lot, particularly in tech, is thinking about things like how cool the fuel cell filling robots are and reduced downtime of forklifts and how it will enable autonomous forklifts and blah blah. Basically overthinking about how cool it is or what niche it will fill or how it will \"revolutionize\" something. I think institutional investors, who really drive the market, are more about bottom lines, current and future revenue, and sustained growth. And that's probably about it.", "score": 1, "replies": []}]}, {"body": "Lmfao op you started a pump and dump ", "score": 1, "replies": []}, {"body": "Fuck it's up like 5% on the day. Hate buying in at the top of a day", "score": 1, "replies": [{"body": "Lol try 60%", "score": 1, "replies": []}]}, {"body": "I'm In. Already regret it. Oh well.", "score": 1, "replies": [{"body": "Instant regret is deliciouz", "score": 4, "replies": []}]}, {"body": "This company stinks. The Amazon contract was announced 1.5 years ago and not even that could increase the share price. Plus, Amazon has multiple out clauses on that contract if (when) Plug can’t deliver. This is like betting on Rite Aid to break out. It might happen in the next 5 years, but good luck timing it. ", "score": 1, "replies": [{"body": "Amazon has multiple out clauses because it's new equipment with associated issues\n\nPlug is expected to break even between now and mid-Q1 based on what I've researched - they've gambled a lot on a new factory and new tech (with associated R&D cost) so I think it'll finally break through and we'll see a runup with the next earnings and a share price jump before march\nThen again everything I know I learned on WSB so maybe you're right", "score": 1, "replies": []}]}, {"body": "[Click Here to Vote to Remove this Submission](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=9itqha&message=9itqha) if it breaks the rules, is spam, or ought to be a comment in the Daily Discussion thread.\n\n[Click Here to Change Inaccurate Post Flair](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=postflair%20CHANGEME&message=9itqha)\n___\n ^comment ^will ^disappear ^--- ^202 ^shitposts ^removed ^this ^session ^--- ^[information](https://www.reddit.com/r/wallstreetbets/wiki/votebot) ^--- ^[leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard) ^--- ^[REWARDS](https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands)", "score": -1, "replies": []}, {"body": "I hope the SEC is doing some sort of analysis on these poor stocks that get mutilated by this sub...it would be the ultimate trophy for the best sub on reddit.", "score": -2, "replies": []}]}
