{"title": "Musk out at Board Chairman, settles with SEC", "selftext": "[deleted]", "id": "9k0st4", "created_utc": 1538257222.0, "score": 399, "upvote_ratio": 0.96, "num_comments": 131, "comments": [{"body": " What does this mean for near-future stock prices in Tesla?\n\nI bought three shares of Tesla stock yesterday afternoon when the stock dipped, by the way.", "score": 122, "replies": [{"body": "LOL shorts are going to get destroyed Monday.", "score": 157, "replies": [{"body": "I could see them taking a hit Monday, but I think in the coming weeks/months this is great news for the stock. \n\nThere's at least an answer now rather than uncertainty -- and probably most important -- Musk remains CEO. His vision and personality are what has sold people on this company and that remains intact. \n\nThat $20M penalty out of the company's pocket sucks though.\n\n(I have no dog in this fight, just my thoughts)\n\n&#x200B;\n\n&#x200B;", "score": 68, "replies": [{"body": "Well isn't the valuation now partly based more on the hype around Musk himself and not future profitabiliy?", "score": 24, "replies": [{"body": "The valuation is based upon a belief that Tesla will monopolize the auto industry, the solar industry, the battery industry, and future terrestrial transport and energy production/storage generally mixed with a belief that they're a ponzi scheme built upon a cult of personality. The reality is somewhere in between.", "score": 20, "replies": [{"body": "Yes well said.  I see them as shaking up the industry of automotive.  \n\nWithout Moviepass,  AMC wouldn't have introduced the subscription model", "score": 5, "replies": [{"body": "And look where moviepass is now. RIP Tesla", "score": 5, "replies": [{"body": "I’ve said it before and I still believe it. I’d rather buy an all electric Mercedes than an all electric Tesla. I just see other car companies catching up eventually. Musk tho shouldn’t have a problem with that seeing as spacex is unmatched with their rockets. I think he’s just fucking around with the auto stuff. But since it’s not public no one else profits am I right? He’s stupid for trying to colonize Mars tho. Virgin galactic with the low orbit travel seems more lucrative", "score": 1, "replies": [{"body": "There’s also a chance that Tesla could be the Netflix of the car industry that because it’s the first, it has a much larger market share than you really think it should", "score": 1, "replies": [{"body": "True but the automotive industry has so much competition. Once the tech catches up, it will be impossible to be monopolized. ", "score": 1, "replies": [{"body": "The same is going to happen to Netflix when Disney and other companies catch up.\n\nBut until they do Tesla will be killing it", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "[deleted]", "score": -24, "replies": [{"body": "Wasn’t their goal the $35k Model 3, and they had to give that up because they would be losing money? How is that higher profit margin? \n\nAlso, I’ve been seeing Tesla’s everywhere lately, and they’re popular enough that people are botching about not getting them delivered fast enough.", "score": 7, "replies": [{"body": "I think they have slowed production on the cheap car to as little as they could legally do and still eventually meet the pre orders. They have given priority to the expensive models for the last year but I think they have in the last 3ish months ramped up production of all models. I also think that tesla has really targeted certain states/cities and thus they are really popular in certain cities and not seen at all in other areas. The higher production of the 35k car might allow tesla to actually hold it's share of electric cars.", "score": 3, "replies": []}]}, {"body": "I downvoted because \"Tesla is are not popular\".", "score": 20, "replies": []}]}]}, {"body": "For someone who's not super familiar with company structures, what responsibility will Elon lose when going from chairman and CEO to just CEO? Is being chairman important for Elon to dictate what the company should do?\n\nAlso would Elon musk not being chairman make it okay for him to tweet stuff like \"Stock going to $420, funding secured\"?", "score": 4, "replies": [{"body": "The board has oversight of the company. If Elon screws up or the company fundamentally disagrees with what he is doing as CEO, it could remove him. It would take a lot for that to happen clearly, but the board is there to oversee and represent the shareholders. As CEO, Elon drives the company day-to-day and that is probably the most important thing for tesla. He may lose some of the dictitorial leeway he's had to run the company and to do so with the impunity. But his brother is still on the board and clearly the board wants Elon in charge.\n\nAnd no, in no circumstance is the $420 tweet OK - unless the funding truly was 100% secured.", "score": 4, "replies": []}]}, {"body": "Elon is worth 20 billion. 20 million is nothing to him. That's 1/1000 of his net worth. That's like less to him than a 50k fine is to Draymond Green.", "score": 8, "replies": [{"body": "I'm talking about the $20 million the company pays. I could care less about $20M out of Elon's pocket. \n\nThere's $20M coming out of the company too, all while it works to become profitable, meet production quotas, and has been in need of capital.", "score": 25, "replies": [{"body": "Wouldn’t be surprised if he injected another $20M in the company just to cover his fuck up", "score": 16, "replies": [{"body": "Under what terms? ", "score": 5, "replies": [{"body": "Can’t he just give the company his own money? ", "score": 3, "replies": [{"body": "Most of his 'money' is in tesla/SpaceX stock, which he cant really sell atm", "score": 14, "replies": [{"body": "Anyone would buy his Space X stock. I would sacrifice my first born to buy some of his Space X  stock.", "score": 7, "replies": [{"body": "Hey I'll throw in all my born if I can get in on that....just saying.", "score": 1, "replies": []}, {"body": "Why would you do that??? SpaceX is very limited in it's growth. They'll never be a huge company.", "score": 1, "replies": []}, {"body": "Every few months I look to see if there's a way in on SpaceX.  I hear ya.", "score": 1, "replies": []}]}]}, {"body": "This isn't a lemonade stand", "score": 1, "replies": []}]}]}, {"body": "You realize he doesn’t just have billions in liquid assets sitting around. The vast majority of his wealth comes from stock and other holdings. ", "score": 16, "replies": [{"body": "You do realize those thing scan be sold and turned into liquid capital. Even better, he can transfer them directly to be held as assets the company itself owns.", "score": 5, "replies": []}, {"body": "I'm sure he has $20mil to throw at this black eye.", "score": 4, "replies": []}, {"body": "Apparently he did exactly this, wasn’t gonna gloat but all the downvotes persuaded me to", "score": 1, "replies": []}, {"body": "I do realize that, but he does have a lot in cash. He’s on record saying his only two investments are Tesla and Space X, so unless all his capital is tied up in those two companies, he has cash.\n\nEdit: so many downvoted, and I was right :p", "score": -10, "replies": [{"body": "He has other investments including Neural Link and Open AI. He also donates. And has property. He has access to capital. ", "score": 2, "replies": []}, {"body": "You're confusing having a tonne of cash and choosing to invest I only 2 equities with *some* of that cash with\nHaving wealth derived from those equities.", "score": 1, "replies": []}]}]}, {"body": "Apparently he is buying 20 million in shares on Monday.", "score": 1, "replies": [{"body": "where did you see this?", "score": 1, "replies": [{"body": "[A Tesla spokesman said that Mr. Musk, a billionaire, would be buying $20 million in Tesla stock. The amount of stock being bought by Mr. Musk matches the penalty the company has to pay under the settlement, which was filed in federal court in Manhattan.](https://www.nytimes.com/2018/09/29/business/tesla-musk-sec-settlement.html)", "score": 1, "replies": []}]}]}]}, {"body": "It's about 4 hours of vehicle production", "score": -2, "replies": [{"body": "Interesting to see it out like that. But this isn't GM or Ford who have capital to burn. ", "score": 4, "replies": [{"body": "don't worry about it too much. it'll barely be remembered a year down the road.", "score": 1, "replies": []}]}]}]}, {"body": "$20 million is definitely a hit to Musk. There's a huge difference in net worth and actual cash", "score": 12, "replies": [{"body": "You’re talking about the CEO of SpaceX and TSLA", "score": 1, "replies": []}, {"body": "Ya especially when you are shooting off roadsters to mars as a hobby", "score": 2, "replies": []}]}]}]}, {"body": "Bought in Friday afternoon at $268. Risky move. But after reading this settlement, no regrets! ", "score": 11, "replies": [{"body": "I have calls.", "score": 1, "replies": []}]}, {"body": "Or TSLA stock will go lower", "score": 2, "replies": [{"body": "Temprory small hit on couple days i would guess but after it gone start growth .", "score": 1, "replies": []}]}]}, {"body": "I would be very surprised if Tesla stock isn’t up Monday.", "score": 20, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "It got hammered after the SEC investigation news came out. Since he settled, we could see a pop.", "score": 12, "replies": [{"body": "I'm expecting a pop up, but only like 10-15 points temporarily. There's still a lot of bearish sentiment from the news last week, and I don't think this settlement will garner enough bullish resistance to close above 280.", "score": 4, "replies": [{"body": "Hmm, you said it wouldn’t close above $280 but it’s at $307. \n\nCare to revisit your original thesis there buddy? :)", "score": 1, "replies": [{"body": "I underestimated the rebound. Call me back when it stays there for a week.", "score": 1, "replies": []}, {"body": "*Checks TSLA chart*\n\n*Laughs maniacally*", "score": 1, "replies": [{"body": "We did it Reddit!", "score": 2, "replies": []}]}]}]}]}, {"body": "Stock dropped because people thought the visionary behind the company was in danger of getting forced out.\n\nNow he gets to stay and run the company with this settlement.", "score": 3, "replies": [{"body": "This was the deal for me.  If Elon was out I would be out.", "score": 1, "replies": []}]}]}]}, {"body": "I think next week will see the stock drop perhaps even below the 250 range, but I think once the dust settles and Tesla puts out their 3rd quarter numbers (which should be huge, they've finally solved their production issues), I think the stock will rebound back up to north of 300$. Then what, who knows.", "score": 6, "replies": [{"body": "What? So you're prediction is $TSLA goes -7% in the short term then +20% following 3rd Q earnings report? Thats an insanely specific and speculative statement lol", "score": 24, "replies": [{"body": "It's been an incredibly volatile stock that reacts sharply to news, and generally bottoms around 250$. I think this settlement will bring it down to that point over the course of next week. As well, I expect the actual books to be looking damn good November 1st and I expect the stock to generate positive momentum heading to that report and get back up to the 300-320 range it generally lives in by the end of the year.", "score": 2, "replies": [{"body": "Sounds like you'll be a millionaire after Q3.", "score": 3, "replies": [{"body": "lol this is just what I think will happen. I’m not gonna gamble everything on it though. ", "score": 5, "replies": []}]}, {"body": "So I’ll just do the opposite of this guy then I can profit.", "score": 3, "replies": [{"body": "I hope you did the opposite because instead of falling it’s at $307 a share now.", "score": 1, "replies": []}]}, {"body": "sir you have a crystal ball.", "score": 1, "replies": []}, {"body": "I'm expecting a gap-up Monday followed by a bearish reversal and a close at 270. I could definitely see it dropping to 260 by Tuesday or Wednesday but I don't see it going lower. Expecting it to close Friday at 280 and straddle that number for a few more weeks.\n\nYou're right though, the stock is highly volatile and this news is nothing to scoff at. I just expect a lot of ~30 min bull runs followed by low-volume bear runs, which means higher pop-ups than pop-downs.", "score": -1, "replies": []}]}]}]}, {"body": "Lol why would you buy Tesla when their number one player is under fire?\n\nEdit: I can almost say as a matter of fact that they are going to go lower before they go up, while I’ve been wrong before, this whole “adaptation” is probably going to shake investors until Tesla focuses on more stable projects that will generate higher profits. Especially with the company under a magnifying glass.", "score": 0, "replies": [{"body": "Regardless of who's their CEO or chairman, I personally have faith in Tesla as a pioneer in the burgeoning EV market. Ignoring expensive tweets or smoking pot on Joe Rogan's podcast, I look at it from a pragmatic standpoint to invest now whilst the stocks are low, and see what the future brings. I mean, we're not talking about buying stocks in Blockbuster Video when Netflix first launched its streaming services here -- we're talking about a relatively new innovation that's bound to eclipse the current paradigm of fossil fuels. In other words, EV cars aren't a dying industry, thus it's wise to keep an eye on them.\n\nI can assure you I'm no environmentalist by any capacity; I am, however, a proponent of efficient technology.", "score": 4, "replies": [{"body": "I am both an environmentalist and an advocate for efficiency, but stocks don’t really care what I think and there are a lot of clean energy companies out there.\n\nI love Tesla and their work, but I don’t think pride is worth loosing money over.", "score": 1, "replies": []}]}]}]}, {"body": "A hit on Monday? This ruling is certainty, removing a lot of uncertainty. The stock will bounce up on Monday. Musk can stay involved in the operation of the company, and the fine is peanuts. Shareholders are going to be overjoyed.", "score": 24, "replies": []}, {"body": "“$40 million in penalties will be distributed to harmed investors under a court-approved process“\nHow are/ were the investors harmed? ", "score": 29, "replies": [{"body": "Bought assuming go private deal happens at 420. Deal doesn’t happen. You lose money. Idk if 20 mil is enough and fuck that anyway everyone knows all announced mergers don’t go through. That was their risk to take. No free lunch bitches. ", "score": 23, "replies": [{"body": "Totally agree. Tweets are not press confrences. People don't seem to get that they don't hold the same weight of forethought and intention ", "score": 6, "replies": [{"body": "Wasn't the Boring Company sorta started because of a comment he made?", "score": 1, "replies": []}]}, {"body": "I sold my stock @360...come at me with my free lunch", "score": 1, "replies": []}]}, {"body": "Short-term investors got crushed in the immediate after the stock bump. If you're an options trader, means a lot if you have short puts. ", "score": 7, "replies": [{"body": "Options traders will not be considered \"investors\"", "score": 9, "replies": []}]}, {"body": "Shorts got completely fucked. ", "score": 6, "replies": [{"body": "as they should", "score": -5, "replies": []}]}, {"body": "What if I was gonna invest but then the price went up so I decided not to...am I a \"harmed investor\"?", "score": 3, "replies": []}, {"body": "The short sellers complaining...", "score": 2, "replies": []}, {"body": "Think of all those investors who were Short (in TSLA Derivatives). The initial announcement of taking the biz private would have trigerred their stop-loss.\n\nIMHO, they should be compensated as this was directly caused by a false statement and not their speculation.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 30, "replies": [{"body": "Whats the point? Premarket will fuck you over. ", "score": 7, "replies": []}, {"body": "might want to see where it opens m9", "score": 4, "replies": []}]}, {"body": "Wow a fucking slap on the wrist. That was such a btfo moment friday.", "score": 32, "replies": [{"body": "Yup, it seems like the system is truly built for the rich to above the law. I get they have more impact on the economy than your average Joe, but it's still disheartening from what they tell us. The law of the jungle is indeed well and alive. I could go both ways, but this reminds me to keep my head down while I'm not uber rich :\\^p.", "score": 4, "replies": []}]}, {"body": "What does it mean by a court approved process?", "score": 3, "replies": [{"body": "Just a guess, but since it's already been filed in court as a complaint, the court might need to approve the settlement to close the case. That's usually what happens in a criminal plea deal for example. The court usually accepts the agreements, but sometimes a judge can reject it if he/she feels the terms are unfair, too soft, too hard, whatever.", "score": 2, "replies": []}]}, {"body": "SEC meting out its famous ‘slap on the wrist’ punishment", "score": 13, "replies": []}, {"body": "Buy the dips", "score": 2, "replies": []}, {"body": "Will musk stay the CEO?\n\nIf so, this is a very bullish “settlement” ", "score": 6, "replies": [{"body": "Yes he can and almost certainly will unless the new board replaces him which is unlikely", "score": 13, "replies": []}, {"body": "Sideline chairman", "score": 1, "replies": []}]}, {"body": "The SEC is such a joke, everyone on its board needs to be fired ", "score": 7, "replies": [{"body": "Yep this case should never have been pursued\n", "score": 3, "replies": []}, {"body": "Can’t agree more. Fine 20M to someone own 20B worth of share is like 0.1% cost. It is cheaper than most broker fee.\n\nManipulate share price >10% with 0.1% cost. Brilliant.\n\nBut I hope all short seller can sue ellon musk for more. ", "score": -8, "replies": [{"body": "Unfortunately, the rich are above the law. ", "score": -1, "replies": []}]}]}, {"body": "I’m confused. Is Musk still the CEO?", "score": 1, "replies": [{"body": "Yes he is.\n\nBut he's no longer chairman of the Board of Directors (he's just another board member now, a new independent chairman will be selected).", "score": 3, "replies": [{"body": "Oh ok, that makes sense. Thank you", "score": 1, "replies": []}]}]}, {"body": "This is such bullshit.  ", "score": 1, "replies": []}, {"body": "Looks like the markets have looked passed the bad news and Tesla about to skyrocket. ", "score": 1, "replies": []}, {"body": "That really sucks. People are more concerned about the stock market instead of the benefits of mass producing electric vehicles that hugely benefit humanity... Capitalism is powerful.  \n  \n", "score": -6, "replies": [{"body": "[deleted]", "score": 20, "replies": [{"body": "You're still focusing on Elon and not tesla as a company and proving my point lol Elon is not really a capitalist at heart so i'm not sure why people expect him to be. ", "score": -5, "replies": [{"body": ">Elon is not a capitalist at heart\n\nAre you using the wrong term? Or do you really think that Elon Musk is not pro-capitalism?\n\nHe's still a billionaire businessman, which in itself is a result and aspect of capitalism.\n\nUnless the word you meant to say was 'conservative?' Because that, I can agree with.", "score": 5, "replies": [{"body": "As in he is more concern with the value of his company and not the price of the stock.  \n  \nI remember watching this 3 years ago - https://youtu.be/Bjq6tXRKfUQ  \n  \nThat's why I really don't understand how there is so much anti-Elon opinions lol oh well.", "score": -1, "replies": [{"body": "How exactly does that make him \"not a capitalist at heart\"?\n\nCaring about the company's value as a whole rather than the volatile stock price is not a way of thinking that is exclusive to \"non-capitalists\".\n\nPlus, if you take a look at the petty way Musk has been talking about shorts recently, I don't think what you said applies to him, or at least not anymore.", "score": 3, "replies": []}]}]}]}]}]}, {"body": "I love Elon Musk but Jesus Christ the build quality of Tesla’s Cars is terrible for what they are and he can’t stop crying or running his mouth. Just be the awesome smart guy you are and leave everything alone. ", "score": -4, "replies": []}, {"body": "[deleted]", "score": -8, "replies": [{"body": "The man who has been nothing but wildly successful in every business venture will destroy the company? ", "score": 5, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Name the con. I have a feeling you know nothing about finance or business.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "If I was 13 you would probably wanna marry me, considering you approve of pedophilia.", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "That’s not a con idiot. \n\nBeing a janitor for a fintech company doesn’t count.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "What are the thoughts here? I am thinking this is a long hold. Potential to be 4 times what it is worth with a future split?", "score": -2, "replies": [{"body": "Not sure what youre asking. How does a future split affect the valuation? Tesla is a long way off from being a 200 billion company. I also think its no where near a 50 billion dollar company so who knows I guess.", "score": 3, "replies": [{"body": "I was just saying what I see in the future, not saying the split impacts valuation. I disagree. Tesla is practically a monopoly. No other electric car truly competes at this point in time. When the price point drops to 30k a car business will skyrocket. They're already working on a suite of other \"eco friendly\" products and Elon is extremely innovative. \n\nEdit: obviously no one truly knows how itll turn out, but I think overall this is a strong long term hold. ", "score": 0, "replies": [{"body": "Theres about 2 million automobiles sold each month, of that 30k are EVs and model 3's are about 20k of those. Yes Tesla has basically a monopoly on EV sales. Its a very Niche market still though. Once the EV market grows and other major manufacturers start to really compete will TSLA still have the monopoly? Who knows. As it is now they still cannot keep up with demand. \n\nI just dont see where the 50 billion valuation comes from, let alone thinking they are worth 4x that. Revenue growth is around 30-40% yoy, still no profit, there are a lot of assumptions being made already. They need to be a huge success for their current value to be justified, and we cant forget what sector they are in. What will happen if growth levels and it starts to be valued like other automobile companies? Ford is valued a great deal lower and has 10 times the revenue. TSLA still has a lot of growing left just to fit into its shoes. ", "score": 1, "replies": [{"body": "I agree with what you're saying, but I also think how Elon Musk and his innovative style is far superior to companies like ford. I'm no expert, obviously. I'm just saying I think that this stock has great potential. Whose to say Tesla isn't going to own the rights to other niche markets. Tesla is also one of two car ompanies I believe who didnt go bankrupt when every other company did. I think the 280-300 is modest right now. Obviously people need to do their own research. I'm not investing a lot into them, but I'm confident enough in musk to throw a little bit in. ", "score": 1, "replies": []}]}]}]}]}, {"body": "Such an idiotic move on Elon's part. Here's hoping that whoever steps in continues to push the EV market forward.", "score": -14, "replies": [{"body": "He's still CEO. That's more important to the future of Tesla than him being Chairman ", "score": 29, "replies": []}, {"body": "He's still going to be in charge", "score": 1, "replies": []}, {"body": "Well, there's some big competition coming in the EV market.", "score": 0, "replies": [{"body": "The competition is always coming, but never arrives\n\nhttps://www.marketwatch.com/story/tesla-has-no-credible-competition-analyst-says-2018-09-17\n", "score": 9, "replies": []}]}]}, {"body": "This is a great news for Tesla. Elon will still be around to give advice if needed (doubtful) but now Tesla will find a CEO-manager instead of a CEO-innovator and pretty soon people will realize that model 3 are flying out the doors. Short this one at your own peril.", "score": 0, "replies": [{"body": "He will remain CEO, just not chairman of the board ", "score": 1, "replies": [{"body": "The 2 new independent directors and new Chairman will push for him to be removed as CEO and Elon will agree.", "score": 1, "replies": []}]}]}, {"body": "Over a joke tweet. Ridiculous.", "score": -21, "replies": [{"body": "$40M tweet", "score": 16, "replies": [{"body": "Most expensive tweet in history?", "score": 9, "replies": []}, {"body": "*$1 billion tweet.  (Estimated losses of shorts and longs because of price fluctuations due to said tweet)", "score": 13, "replies": []}]}, {"body": "You can’t mess around and manipulate the stock market in any way. This is not the 1920’s, the SEC was created specifically for this reason. ", "score": 6, "replies": []}, {"body": "Yep. And now he paid the price over it.", "score": 2, "replies": []}]}]}
{"title": "Tesla’s Elon Musk settles with SEC, will pay $20 million fine and resign as board chairman - The Washington Post", "selftext": "", "id": "9k0rj9", "created_utc": 1538256916.0, "score": 37, "upvote_ratio": 0.94, "num_comments": 102, "comments": [{"body": "[deleted]", "score": 14, "replies": [{"body": "So true", "score": 2, "replies": [{"body": "Seriously hope they make a movie out of this one day! ", "score": 4, "replies": [{"body": "They will", "score": 2, "replies": [{"body": "Multiple documentaries. Documentary series. Drama series. Drama movies. Horror movie or thriller movie? I want it all.", "score": 2, "replies": [{"body": "Imagine watching this movie ten years from now. And remembering that whole rollercoaster. Hope this is will be in a lifetime where everybody drives evs, tesla is printing money and recognized as the company that brought electric cars to the mainstream. ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Man am I glad I bought those shares on Friday and didn't wait for a further drop...\n\nDoes the \"harmed investors\" clause mean the likely end to any class action cases?", "score": 8, "replies": [{"body": "No, it means this settlement doesn’t affect those cases", "score": 5, "replies": []}]}, {"body": "Well there you go :)\n\nNow we can all move on to what really matters… ~~try to take over the world Pinky!~~ Obsess over Q3 deliveries/financials!", "score": 15, "replies": [{"body": "Fuck yeah! Q3 party thread incoming :)", "score": 15, "replies": [{"body": "when do the Q3 numbers get published?", "score": 5, "replies": [{"body": "Probably tuesday", "score": 2, "replies": []}]}]}]}, {"body": "im so confused yet relieved. I'm on-board. Looking back one of the biggest wishes I had is a more independent board along with a strong number 2 to lead TSLA similar to Gwynne Shotwell at Space X", "score": 11, "replies": []}, {"body": "Mark Cuban for Chairman.  I understand they don't know each other but maybe their mutual lawyer can make the intro.\n\nPress release: \n\nTesla appoints Mark Cuban Chair to eliminate stupid SEC from investigating.  Patents are dumb.  Billionaires out.\n\nhttps://youtu.be/fAjU_W0GDPA\nhttps://youtu.be/11kvtuuTvrM", "score": 3, "replies": []}, {"body": "I wonder if a group of institutional investors got together and told him to fucking accept the deal or they would do worse.", "score": 6, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Panasonic wouldn't care as much about short term stock price though. ", "score": 1, "replies": []}]}, {"body": "Doubt it.", "score": 3, "replies": []}, {"body": "this. \n\notherwise, they may start a coup to revamp the board themselves", "score": 1, "replies": []}, {"body": "That's not how institutional investors vote. Look up ISS.", "score": 0, "replies": []}, {"body": "I think he didn’t accept the initial offer as a negotiation tactic.", "score": -1, "replies": []}]}, {"body": "This will end up sticking a knife in the shorts, and then in 3 years Elon should be an obvious choice to return as chairman when the company is in a much better financial position. He'll still be CEO and have operational control. I really like this. So glad he didn't risk a lifetime ban and drag out this uncertainty. ", "score": 9, "replies": [{"body": "He might not want the chairman position in 3 years. It depends who takes over that position. It might be kimbal", "score": 6, "replies": [{"body": "The position will be his if he wants it, unless the new one crushes. Seems like a win/win.", "score": 8, "replies": [{"body": "Yeah, I hope Kimbal is up to the task", "score": 4, "replies": [{"body": "Kimbal is not independent per securities regulation: he has too much of a relationship with TSLA and company management (like being the CEO's brother!).  They will not be able to appoint Kimbal as chairman.\n\nBut who's chairman doesn't matter: it's barely more powerful than an ordinary director.  The main thing you use the chairman title for is prestige: by making someone be \"the most important director\" it's a way to keep retired executives involved on the board, etc.", "score": 1, "replies": [{"body": "It's not a requirement that the chairman be \"independent\", just the two new board members must be.", "score": 5, "replies": [{"body": "The SEC's [press release](https://www.sec.gov/news/press-release/2018-226) states:\n\n>Musk will step down as Tesla’s Chairman and be replaced by an independent Chairman.  \n>Tesla will appoint a total of two new independent directors to its board", "score": 6, "replies": [{"body": "Seems like your info is good but it's weird, that's not in the [court documents about the case](https://www.courtlistener.com/recap/gov.uscourts.nysd.501755/gov.uscourts.nysd.501755.6.0.pdf) but then neither is the mention of the two additional directors. \n\nThe SEC press release doesn't link the equivalent Tesla document either.\n\nDoes this mean that one of the two additional directors becomes chairman? \n\nAnyone know how they're chosen?\n\nEdit: seems like /u/yuhong found it. [SEC vs Tesla court filing](https://www.courtlistener.com/recap/gov.uscourts.nysd.501881/gov.uscourts.nysd.501881.3.1.pdf).\n\n", "score": 3, "replies": [{"body": "They already have 1 independent director at the board. Maybe he becomes the chairman.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I just talked to Kimbal.", "score": 1, "replies": []}]}, {"body": "> This will end up sticking a knife in the shorts,\n\nRelative to yesterday maybe. But they are unquestionably better off after this whole saga. \"Funding secured\" helped them, it didn't hurt them.", "score": 2, "replies": []}, {"body": "Musk took the same deal that was on the table Thursday, except he's upset the entire market and is paying a $20M fine instead of a $10M one.  Not the world's smartest move, IMO :P", "score": 1, "replies": [{"body": "Do you have sources that this is the same deal amid 10M more?", "score": 2, "replies": [{"body": "The terms of the rejected settlement were broadly reported Thursday as a $10M fine for Musk, a $10M fine for Tesla, appointment of 2 independent board members, and a 2 year chairmanship ban.  \n\nThey were rejected, and one would expect after the complaint is filed for the SEC to demand more to settle.\n\nNow we have the actual settlement terms, which are **$20M** fines for Musk and Tesla, appointment of 2 independent board members, a **3 year** chairmanship ban, requirements for an independent chairman, and *a special board committee & legal counsel reviewing Musk's public statements* (unclear if this was part of the original settlement..)\n\nMusk had said publicly the reason for his rejection is that he would be barred from denying the charges publicly after the settlement, but the current settlement contains that language, too.\n\nFrom the New York Times:\n\n> The terms of the settlement are slightly tougher than those that two people briefed on the talks said Mr. Musk had rejected on Thursday, which called for a two-year bar on serving as chairman and a $10 million fine.\n\nhttps://www.nytimes.com/2018/09/29/business/tesla-musk-sec-settlement.html", "score": 3, "replies": []}]}, {"body": "Original deal was 2 years,  he accepted 3 years.  Not sure of the money is different.", "score": 1, "replies": [{"body": "https://www.reddit.com/r/teslainvestorsclub/comments/9k0rj9/teslas_elon_musk_settles_with_sec_will_pay_20/e6w0ho7/", "score": 1, "replies": [{"body": "So essentially Musk will be buying $20M worth of shares in Tesla instead of $10M if NYT's sources are to be trusted?", "score": 1, "replies": [{"body": "No.\n\n1. Musk will be paying a $20M fine.\n2. Also, Tesla will be paying a $20M fine.\n3. Also, Musk will buy $20M of shares from Tesla so that Tesla's cash balance does not fall by $20M when they do #2.\n4. (But all shareholders are diluted by #3 a small amount.  e.g. if Tesla lit $1B of cash on fire, and then I bought $1B of Tesla stock directly from Tesla at the market price before lighting cash on fire, current shareholders still lose value).", "score": 1, "replies": [{"body": "Thanks for explaining it but I dont quite get #3&4 as I dont think they are issuing anymore shares because of this to cover 20M cash balance so therefore shares are not diluted but maybe I'm not looking at this the right way as 20M would consider to be Tesla expenses ", "score": 1, "replies": [{"body": "> Thanks for explaining it but I dont quite get #3&4 as I dont think they are issuing anymore shares because of this to cover 20M cash balance\n\nThey are.  He will pay Tesla $20M to cover Tesla's fine, and he will get $20M of common stock in new issuance from the company in return.  They issue shares all the time, for employees that are exercising stock options, bond conversions, warrants, etc.  This is another case of it.  Separately, he will pay the SEC $20M.\n\nIt's a decent way to try and defray the portion of the damages that Tesla incurs, but it still is not \"free\" / the same as being fully reimbursed as far as equity holders are concerned.\n\nedit: for an example of ongoing issuance, from 10Q's:  \nAs of April 30, 2018, there were 169,793,685 shares of the registrant’s common stock outstanding.  \nAs of July 27, 2018, there were 170,593,144 shares of the registrant’s common stock outstanding.\n", "score": 1, "replies": [{"body": "Am I incorrect in my understanding that those shares already exist? Does this not mean there are the same number of shares so the portion of the company per share remains the same just now he's holding them instead of the company?\n\nI ask because AMD recently got permission to do something along those lines as far as I understood. Have the shares available in case they needed them to raise funds.", "score": 1, "replies": [{"body": "There's an authorized share count-- but the number is generally large compared to the number issued, and it is something that the board can just change.  In the case of Tesla, **two billion shares** of common are authorized.\n\nAny *public offering* needs securities approval, but ordinary issues of options, warrants, etc, do not.  (They do require board diligence-- the board has a fiduciary duty to be fair to all existing shareholders).\n\nThe market capitalization of a company is the number of outstanding, fully-diluted shares multiplied by the current trading price.  Things that issue more shares are dilutive.  But, if a company is worth $100, and in exchange for 9.09% of it you give it $10 in cash,  the company is now worth $110 ($100 of old value plus $10 of cash), and existing shareholders have lost nothing in real value.  (The previous holders own 91% of something worth $110 = $100).\n\nIf you give the company $10 in cash, but they then immediately light the cash on fire / pay a SEC fine that wasn't priced into the $100 value, now they own 91% of something worth $100 = $91.\n\nedit: the good news is that $20M is nowhere near Tesla's market cap, so, the effect will be small.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I haven't seen anything about having to add 2 independent directors on the board.  ", "score": 1, "replies": [{"body": "While Musk's settlement document has become public, I have not found Tesla's.  However, from the SEC press release:\n\n> Musk and Tesla have agreed to settle the charges against them without admitting or denying the SEC’s allegations.  Among other relief, the settlements require that:\n\n> Musk will step down as Tesla’s Chairman and be replaced by an independent Chairman. Musk will be ineligible to be re-elected Chairman for three years;  \n> **Tesla will appoint a total of two new independent directors to its board;**  \n> Tesla will establish a new committee of independent directors and put in place additional controls and procedures to oversee Musk’s communications;  \n> Musk and Tesla will each pay a separate $20 million penalty.  The $40 million in penalties will be distributed to harmed investors under a court-approved process. \n\nCompared to the initial reported settlement requirements, it was a two year ban instead of three, and the new committee wasn't present, and the fine was $10M each instead of $20M each.", "score": 1, "replies": []}]}]}, {"body": "im kinda wondering if this was the plan all along. hes gotten tesla to the point they probably wont need a charismatic, if slighty crazy, chairman. they need a more stable and industry focused leader. keeping elon as the biggest shareholder will be a major boost for tesla. they have three cars they cant keep up with demand on, they have industrial customers loving the semi concept; as far as i can tell, sales and maintaince seem to be getting better. this might be a good thing in the long run for tesla. \n\nalso elon will be less stressed and hopefully not make idiotic and childish tweets anymore that can get him in trouble. ", "score": 0, "replies": [{"body": "> im kinda wondering if this was the plan all along. \n\nHow far back is \"all along\"?", "score": 3, "replies": [{"body": "about when he made the tweet. probably not but this whole thing has been crazy. ", "score": -2, "replies": [{"body": "> about when he made the tweet. \n\nHe made the false tweet in order to have the SEC sue him, agree to settle, cancel the settlement, then agree to a worse settlement? \n\nYou really really can't be serious.", "score": 10, "replies": []}]}]}]}]}, {"body": "A more independent board and a disciplined process for official communications are good things.  \n\nElon was basically an out-of-control autist for the past few months.  While seeing things differently is key to vision and innovation, Tesla has to operate effectively in a world of normies.  That is the reality.  Needless drama just gets in the way of Tesla’s growth. ", "score": 6, "replies": []}, {"body": "I hope musk learns from this mess.", "score": 2, "replies": []}, {"body": "Awful deal for Tesla imo but they might’ve not had a choice. ", "score": 0, "replies": [{"body": "Meh, damage limitation. Elon still will control the board. ", "score": 3, "replies": [{"body": "No he won’t. Two added members to the board essentially take power away from him. This is the most important part of the deal not the chairman role. Thus far the board sided with Elon because majority were on his side. Kimbal, Steve, Antonio, etc, were all early investors. The other half are institutional investors that have been trying to dethrone Elon for years but haven’t been able to because they don’t have enough votes. The extra board members is a massive power change that no one seems to appreciate", "score": 3, "replies": [{"body": "Who has been trying to dethrone Elon? If you’re talking about the vote last shareholder meeting it was represented by a very small group. It was laughable, they said it was defeated before they even finished tallying the votes. They would need to change the mind of multiple major shareholders and that’s not likely. If anything this proves how integral Elon is to the company, just the mere threat of Elon being barred from an officer position dropped the stock 14%. No shareholder in their right mind would want that to happen for real, TSLA could drop 50% on that news and might never recover. ", "score": 6, "replies": [{"body": "http://fortune.com/2016/06/28/tesla-investor-group-independent-board/", "score": 1, "replies": []}]}, {"body": "Do these people not realize that tesla is highly valued because of Elon? If they force him out, it is going to crash.", "score": 1, "replies": []}]}, {"body": "I agree. ", "score": 4, "replies": []}]}]}, {"body": "Given that Musk stopped looking at going private as a distraction it seemed highly unlikely that he would actually try to fight the SEC on this.\n", "score": 1, "replies": [{"body": "He pivots quickly. Weird combination of stubborn and willingness to change his mind. ", "score": 14, "replies": [{"body": "Killer combination.", "score": 6, "replies": [{"body": "It's not a killer combination when the net result has been to get a worse deal than was offered (twice the fine) after worrying the entire market.", "score": 2, "replies": [{"body": "The fine is peanuts really. Personally I'm glad it's over so it's not in the news constantly, distracting from great results by dragging on every article.", "score": 3, "replies": [{"body": "Again, why stall for 2 days, cause a damaging legal complaint to be unveiled by the SEC instead of just a settlement, double the fine for both TSLA and Musk, increase the restrictions on Musk (3 year chairmanship ban instead of 2; additional board-level oversight on communications)... :P\n\nYes it's great for TSLA and Musk that it is over, but it could have been over two days ago with a lot less consequence.", "score": 4, "replies": [{"body": "I don't think he was stalling so much as he just changed his mind again. The guy's built two massive leading-edge companies in two considered-impossible industries in the space of 10ish years but no one's perfect, and I'm just happy he wasn't too proud to change his mind again so this isn't dragged out further.", "score": 2, "replies": [{"body": "Yah-- it doesn't do much to dispel the growing perception Musk is mercurial and that it has a lot of material consequences for TSLA, though.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "here we go bois, we going up again. ", "score": 1, "replies": []}, {"body": "I'm worried about this having a huge effect on $TSLA. It's possible that the bears will feel vindicated and increase their short positions. ", "score": 1, "replies": [{"body": "Oh no man, no way, this is great news! Bears need consistent negative and fearful headlines in order to counteract all the positive news about how tesla is actually doing. By finishing this the story pivots to what’s next, which is Q3 deliveries and V9 ", "score": 11, "replies": []}, {"body": "Its better to get this whole ordeal over with now rather than later. If they went to court, the constant news articles and uncertainty would drag the stock price anyway. Hopefully they can start to put this behind them and focus on the business. Of course there is still the uncertainty from DOJ investigation. ", "score": 7, "replies": []}, {"body": "Shorting a company doesn’t hurt the price. ", "score": 1, "replies": [{"body": "It does, but it does so in a way that has a rebound effect on the way up.", "score": 1, "replies": [{"body": "No it’s the same as buying or selling a stock. It just adds more liquidity.", "score": -5, "replies": [{"body": "Selling a stock hurts the price if there is more supply than demand.", "score": 6, "replies": [{"body": "He knows this already ", "score": 4, "replies": []}]}]}]}, {"body": "Yeah it does. Let's say a company has 100 shares which means they have sold 100 shares. Now someone borrows one of those shares and sells it (aka shorting). Now there 101 shares sold, but only 100 actual shares. Supply has been now artificially increased by 1%, which reduces the value of the original 100 shares, because that same value has now been spread across 101 theoretical shares.", "score": -1, "replies": [{"body": "> Now there 101 shares sold, but only 100 actual shares. Supply has been now artificially increased by 1%, which reduces the value of the original 100 shares, because that same value has now been spread across 101 theoretical shares.\n\nThat's not how prices are determined, like at all. There are still 100 shares out there, regardless of how many people are shorting it. And the  \"value\" of the company, if you want to look at it that way, is still divided across 100 shares. All shorting does is put temporary sell pressure because of the immediate sale.", "score": 4, "replies": [{"body": "So if there's a 100 shares, and 50 of them are shorted, now 150 people own shares (50 owners are lending their shares). Now there are many more shares available on the market being traded, even though there is truly 100. Now it's easier for a buyer to find a seller. The % float of the stock is now artificially inflated, which has a real impact. It's way easier to find a share to buy which artificially reduces the price.", "score": 1, "replies": [{"body": "What? No there would still be 100 shares. If I lend you my car for the weekend, we don't say that two people now own a car, or (even worse) that the value of cars has gone down because there's more supply. You're double counting. \n\nThere's 100 shares and 100 owners, no matter what. ", "score": 4, "replies": [{"body": "No that's not the same. What would be the same is if I lent you my car for the weekend, and then you sold my car to someone else.\n\nThere's still only one car, but two people bought it. Don't tell me that doesn't affect the price of the car.", "score": 1, "replies": [{"body": "Still only one car, still only one owner. Yes shorting reduces the share price though", "score": 1, "replies": [{"body": "Yeah I think we basically agree but I'm probably just using all the wrong terminology. ", "score": 1, "replies": []}, {"body": "Still only 1 share technically, but there 2 rightful owners.\n\nNormally people buy-then-sell, shorts sell-then-buy.\n\nSo shorts sell something before they have it, and they have the obligation to purchase it later. So this is like me selling you a car before I actually own it, you now have the rightful ownership of the car. So does the original shareholder. What has to happen is that I have to buy a share back from the open market to cover my obligation.\n\nShorting only works where there is liquidity, it most definitely increases the amount of “owned” shares, though not the actual amount of shares outstanding.\n\nBy increasing the number of available shares, not total shares, shorting has the effect of reducing the share price by increasing the number of shares available for sale, and as they cover their positions the price can rise quicker than it would otherwise, which is known as a short squeeze.\n\nIf shorting has no effect on the market, then short squeezes wouldn’t be possible.", "score": 1, "replies": [{"body": "> So does the original shareholder. \n\nWell, no. The original shareholder for example cannot vote on the shares. They're owed a share in the future, but that's a private arrangement. Each of the 100 shares is only owned by a single person. But it sounds like we agree on that.\n\n>If shorting has no effect on the market, then short squeezes wouldn’t be possible.\n\nI'm not arguing it has no impact on the market. Shorts absolutely reduce stock price. \n", "score": 1, "replies": []}]}]}]}]}]}, {"body": "It is how prices are determined. There are only.a limited number of buyers that consider Tesla a good deal at a given price. If more shares are for sale then the price declines until a larger group of buyers think it's a good price. It's only the basis of all economics.", "score": 1, "replies": [{"body": "Yes price is determined by supply and demand. That's the basis of economics. If that's all you're saying then we agree. There is a supply curve and a demand curve and price is where they intersect. ", "score": 1, "replies": [{"body": "That's exactly what the first poster you disagreed with was trying to say.", "score": 1, "replies": []}]}]}]}]}, {"body": "Shorting doesn't, but short market distortion does.  Distorters can also potentially hurt the product. It would be obvios by now if Tesla's weren't so darn awesome.", "score": 1, "replies": [{"body": "Funny thing to say in a thread about a Tesla long and insider settling with the SEC for manipulating the price of Tesla stock. ", "score": 3, "replies": [{"body": "Not funny. I still believe Elon is innocent and shorts that distort should be prosecuted for their distortions. Without the shorts Tesla would've gone private at 420.", "score": 0, "replies": []}]}]}, {"body": "Maybe not in the long run, but definitely in the short run.", "score": 0, "replies": []}]}]}, {"body": "Elon musk is not interested in taking direction from anyone and the shorts will put extreme media pressure on whoever is chairman. Tensions will rise as new chairman tries to prove himself. Get ready for a bumpy ride boys", "score": 1, "replies": [{"body": "It’s always been bumpy. Let’s wait and see if the new chairman is the pushover you are expecting ", "score": 6, "replies": [{"body": "Maybe Elon's brother? Lol", "score": 5, "replies": [{"body": "“Who you going to listen to kimbal? Those shorts? Or your brother who made you a billionaire?”", "score": 8, "replies": [{"body": "Kimbal's a smart dude in his own right.  But yeah he and Elon of course are going to side together.", "score": 2, "replies": []}]}, {"body": "theres plenty of great candidates out there who arent related and have that baggage. ", "score": 1, "replies": []}]}]}, {"body": "Who's chairman basically never matters: it's a figurehead role with little more power than an ordinary director.  It's often a slot to save for past executives you want to keep a little involved.\n\nMore significant is the independent directors.  The board composition is altered and there will be more real oversight.  This might be very good for TSLA, if they get good directors.", "score": 2, "replies": []}]}, {"body": "What are the chances the DOJ could interpret this as an admission of guilt and press charges? \n\nJust trying to see this from different angles. ", "score": 1, "replies": [{"body": "In the filing it explicitly states this settlement is not an admission of guilt, and as someone else stated already, a criminal charge would require an even higher burden of proof. ", "score": 8, "replies": []}]}, {"body": "Tesla share price down 14% atm", "score": -12, "replies": [{"body": "It’s Saturday. ", "score": 10, "replies": [{"body": "I thought it was a good joke but now I'm not so sure anymore if that was the intent.", "score": 4, "replies": []}]}, {"body": "Source?", "score": 1, "replies": []}]}]}
{"title": "For those who have asked - Tesla Puts up 70k on Friday, still holding 160k in Puts", "selftext": "", "id": "9jyyn8", "created_utc": 1538242983.0, "score": 464, "upvote_ratio": 0.97, "num_comments": 182, "comments": [{"body": "[deleted]", "score": 365, "replies": [{"body": "He made all that money by saving on commission", "score": 240, "replies": []}, {"body": "Yeah are you fucking lost op", "score": 13, "replies": []}]}, {"body": "[deleted]", "score": 141, "replies": [{"body": "He’s a cuck, don’t expect any post of his losses on Monday", "score": 43, "replies": [{"body": "Expect a lot of \"[post deleted]\"", "score": 25, "replies": []}]}, {"body": ":: chuckles first ::", "score": 0, "replies": []}]}, {"body": "You’re gonna get rekt Monday lol", "score": 64, "replies": []}, {"body": "RIP your puts. https://twitter.com/CNBCnow/status/1046146343192993792?s=19", "score": 122, "replies": [{"body": "Lol OP gonna lose like 120k tomorrow.", "score": 63, "replies": [{"body": "Tomorrow's Sunday.", "score": 56, "replies": [{"body": "That money already gone, nibba.", "score": 71, "replies": [{"body": "Yep, he lost $120k today and the markets not even open\n\nIt's like watching the doctor fuck you in the ass while you lie there, unable to move, but still fully conscious and able to feel everything", "score": 56, "replies": [{"body": "this comment and your flair make it sound like you've been through some shit.", "score": 20, "replies": [{"body": "Well... His doctor has been through some shit.", "score": 11, "replies": []}]}, {"body": "Dang you've been unlucky at life.", "score": 1, "replies": []}]}]}, {"body": "well technically market opens on sunday at 6pm", "score": 3, "replies": []}]}]}, {"body": "God everytime I think this place is bad I check twitter comments on things like this and realize the absolutely unapologetic stupidity of most people.", "score": 18, "replies": [{"body": "I was reading some tweets after a news outlet put an article up NKE after the Kaepernick ad. Some said it was a great price to jump in on while others argued their dividend was too low...", "score": 2, "replies": [{"body": "chads always got a reason to keep from getting rich", "score": 1, "replies": []}]}, {"body": "When Steve jobs left Apple (to go die of witch doctor medicine) there was a 3 percent drop.  Obviously they have since “bounced back” but I am interested to see what happens on Monday.   As some firms have stated they would divest if Elon is out.   But of course he is not totally out.    Who fucking knows.  I’m not touching this thing. ", "score": 3, "replies": []}]}, {"body": "Dang it says he has to pay a $20m fine and ALSO pay a $20m fine!", "score": 2, "replies": []}, {"body": "Why RIP? This is bad news for TSLA. ", "score": -22, "replies": [{"body": "No it’s not. They settled, meaning charges are over with. Musk isn’t chairman anymore, these are all good things. ", "score": 43, "replies": [{"body": "*civil charges", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Not over no. But Monday should be a Green Day for Tesla ", "score": 3, "replies": []}]}]}, {"body": "Have to agree.  The stock is not going to shoot up necessarily.  The same issues that lead to an SEC lawsuit still exist in the company.  Now it has to find a new Chairman from its BoD.", "score": -7, "replies": [{"body": "He has 45 days to resign as chairman. Plenty of time to appoint 2 new yes men \"independent\" directors and have the board vote a new yes man into the chairman spot. If anything this is great news because part of the settlement now requires the board to monitor his Twitter. Company secured.", "score": 15, "replies": []}, {"body": "They will also dilute the board too, this is good for investors, uncertainty is gone now that he settled.", "score": 2, "replies": []}]}]}]}, {"body": "what kind of animal drops 290k on one play", "score": 53, "replies": [{"body": "Ha e you ever seen the movie Rat Race?", "score": 12, "replies": []}, {"body": "[deleted]", "score": 12, "replies": [{"body": "is OP a known poster or something? also why say decamillionaire why not just multimillionaire ", "score": 21, "replies": []}]}]}, {"body": "It was nice knowing you", "score": 36, "replies": [{"body": "don't lie to a man on his deathbed.", "score": 14, "replies": []}]}, {"body": "Can i ask you an actual question?  Why the fuck do you use robinhood and not a broker that will actually give decent execution?  More power to you, just made me chuckle seeing that much in a RH account lol", "score": 101, "replies": [{"body": "Was young and dumb when I opened the account, still am but I did open up an IB account this week that I'll be moving too", "score": 96, "replies": [{"body": "Congrats bud. I’ve been following your trades since you the first TSLA put. ", "score": 29, "replies": [{"body": "What's the tldr? This dude crushes it? ", "score": 3, "replies": [{"body": "Yea pretty much. Nate Dogggggggg!", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 16, "replies": [{"body": "Handjobs. Lots and lots of handjobs", "score": 23, "replies": [{"body": "they call him \"butter palms\" in the streets", "score": 11, "replies": []}, {"body": "I dunno...seems like “love you long time” money to me...", "score": 7, "replies": []}, {"body": "[deleted]", "score": 12, "replies": [{"body": "He gave his rich parents handjobs", "score": 7, "replies": []}]}]}]}, {"body": "What’s an IB ?", "score": 9, "replies": [{"body": "IV's Asian cousin.", "score": 33, "replies": [{"body": "Underrated xD", "score": 3, "replies": []}, {"body": "Best answer ", "score": 1, "replies": []}]}, {"body": "Interactive brokers", "score": 8, "replies": []}, {"body": "yikes ", "score": -6, "replies": []}]}, {"body": "Your not going to have any money for IB in 36 hours", "score": 7, "replies": []}, {"body": "What resources are you using to learn using IB?", "score": 1, "replies": []}]}, {"body": "Hes waiting for 7 digits to make the move to WeBull", "score": 35, "replies": []}]}, {"body": "Dude u fuckin jynxed yourself. Musk settled.", "score": 30, "replies": [{"body": "This doesn't change the company's financial situation in the slightest, the future still looks bleak. Happy that I sold most of my shorter term contracts, will probably look to buy more before earnings", "score": -27, "replies": [{"body": "You're talking about puts right?", "score": 14, "replies": []}, {"body": "Ur fucked. No one gives a shit about their current financial situation as evidenced by them continuing to climb before the sec news. The threat of him being removed was the main driver behind the gains on your puts. If you're not retarded, you'll close all of them as soon as the market opens and hope whatever premarket gains tsla makes on this news doesn't offset your profit.\n\nedit: just saw that a lot of them expire 1/19 so i guess it's not as bad as it looks but with a good ER and the board now monitoring his twitter your window is indeed closing, albeit at a slower pace than what i previously envisioned. If you're banking on their poor financial situation, it's gonna be a longshot. They'll be profitable within 2 more quarters. By then, this'll be 400+\n\n\nEdit2: poor guy didn't even get a chance to close out, Musk slit his throat in the premarket and bathed in the blood.", "score": 29, "replies": []}, {"body": "[deleted]", "score": 14, "replies": [{"body": "well played\n", "score": 1, "replies": []}]}, {"body": "F", "score": 3, "replies": []}]}]}, {"body": "Oh lawd yes", "score": 23, "replies": []}, {"body": "Positions? When is your expiry", "score": 20, "replies": [{"body": "Majority are 1/18/19 or later, sold most of the shorter term yesterday but still have a have a few 10/19s and 11/16s. I'll buy more 11/16s if the price somehow rallies in the coming weeks.", "score": 24, "replies": [{"body": "> 1/18/19 or later\n\nBan\n\n", "score": 49, "replies": []}, {"body": "can you post your put options after 1/18/19?  Doing possible march 19 bk's?  ", "score": 2, "replies": [{"body": "https://imgur.com/a/9ChFnJZ", "score": 2, "replies": [{"body": "Mmm HABT delicious burgers", "score": 1, "replies": []}]}]}]}]}, {"body": "Now buy 359K worth of MU calls 🔥🔥\n\nEarly retirement or early suicide ", "score": 58, "replies": [{"body": "Same thing", "score": 1, "replies": []}]}, {"body": "Profiting off anothers destruction. Capitalism is wonderful. ", "score": 136, "replies": [{"body": "[deleted]", "score": 88, "replies": [{"body": "yeah farmers hedge their crop by buying weather derivatives.", "score": 40, "replies": [{"body": "I thought they bought weekly MU calls to hedge risk?", "score": 45, "replies": [{"body": "really? I thought MU calls were for hedging SNAP puts? I mean both are POS stocks.", "score": 9, "replies": []}]}, {"body": "Wow i never thought of that, cool", "score": 1, "replies": []}]}, {"body": "i dont think anyone on here buys options to manage risk", "score": 7, "replies": [{"body": "Ray Dalio is a wsb mod. ", "score": 4, "replies": []}, {"body": "They're voluntarily taking risk away from someone else though.", "score": 3, "replies": []}, {"body": "There are two classes of people that participate in the options market: \"hedgers\" and \"speculators\".", "score": 1, "replies": []}]}, {"body": "Did he just swap futures with options?", "score": 3, "replies": [{"body": "It does apply for options, but yes traditionally that's the spiel for the importance of the futures market. ", "score": 6, "replies": []}]}]}]}, {"body": "RIP. ", "score": 16, "replies": []}, {"body": "Rip come Monday.", "score": 16, "replies": []}, {"body": "Elon.\n\n\nGet the rocket.", "score": 14, "replies": []}, {"body": "Game over.", "score": 12, "replies": []}, {"body": "I’m sorry about your 160k in losses. F", "score": 31, "replies": [{"body": "You really think I have 160k in FDs or do you just not understand how option pricing works", "score": -4, "replies": [{"body": "We don’t understand options please explain if Tesla gains its 15% back how u do not suffer", "score": 23, "replies": [{"body": "His puts don't expire til next year", "score": 11, "replies": [{"body": "You are right , 1 year to suffer isn’t that bad for WSB", "score": 14, "replies": []}, {"body": "Thats only a couple months away. He can still get proper fucked if TSLA skyrockets", "score": 3, "replies": []}]}]}, {"body": "It's the latter.  This sub is having difficulty processing a green RH account, especially one with numbers that big.", "score": 11, "replies": []}]}]}, {"body": "Breaking news Elon just settled with the SEC..10 minutes ago LOL", "score": 11, "replies": []}, {"body": "Lmao you're gaining Twitter attention for this now: https://twitter.com/SlopeOfHope/status/1046179191912321026?s=09&", "score": 11, "replies": [{"body": "Lmao I appreciate their concern", "score": 4, "replies": [{"body": "WSB/that twitter user doesn't understand this man doesn't do weeklies like the rest of them.  A screenshot of a 25% account gain on a -14% TSLA down day for a put holder should indicate the account holder isn't playing short term options.  Monday doesn't kill this man's account (Unless MU makes an unsolicited $840 bid a share for TSLA backed by Antartican Parliament).", "score": 7, "replies": [{"body": "Your last line is what keeps me up at night", "score": 7, "replies": [{"body": "think about adding some small % of ridiculous call strikes to help your exposure in case something really stupid like that happens.", "score": 3, "replies": []}]}]}]}]}, {"body": "Bahaha, way to get fucked op.  Shoulda sold at 255 after Joe Rogan, like I told you.   You should cut your losses now before q3 data is officially released ", "score": 11, "replies": []}, {"body": "What was initial investment? ", "score": 9, "replies": []}, {"body": "Well, I sold a call, so you may be in trouble considering my track record.", "score": 7, "replies": [{"body": "Looks like your track record is still undefeated.", "score": 7, "replies": []}]}, {"body": "oof", "score": 8, "replies": []}, {"body": "RIP on Monday", "score": 9, "replies": []}, {"body": "Should’ve not posted this. GG RIP ", "score": 7, "replies": [{"body": "jinxed himself", "score": 4, "replies": []}]}, {"body": "Foolish mortal. Never short tesla.", "score": 14, "replies": []}, {"body": "Lol judging from your previous posts you've made most of your money off of Tesla puts? \n\nYou should send Elon a fruit basket. Or like, maybe me cause I'm broke and hungry here.", "score": 5, "replies": []}, {"body": "R.I.P sweet gains", "score": 7, "replies": []}, {"body": "I'd suggest waiting until market open on Monday to post. ", "score": 5, "replies": []}, {"body": "Sell now ", "score": 5, "replies": []}, {"body": "Easy come...", "score": 6, "replies": [{"body": "Easy go. RIP.", "score": 1, "replies": []}]}, {"body": "Tomorow is gonna suck for you o.p. sorry dude :( ", "score": 5, "replies": []}, {"body": "RIP my autistic little friend. ", "score": 4, "replies": []}, {"body": "Need that update fam. Complete with screenshots please. preferably before my morning wood is gone.", "score": 6, "replies": []}, {"body": "Your going to get annihilated on Monday morning...", "score": 7, "replies": []}, {"body": "Holy fucking god.", "score": 5, "replies": []}, {"body": "I want to see what $TSLA opens at Monday morning..", "score": 4, "replies": []}, {"body": "Remindme! 36 hours ", "score": 4, "replies": []}, {"body": "gOoD eNOUGh to scReenSHoT goOd eNoUGh to seLL", "score": 3, "replies": [{"body": "Haha, this. Hope I remember it if it ever happens to me.", "score": 1, "replies": []}]}, {"body": "Everyone here says it’s going back up Monday so it’s definitely going down, well played.", "score": 3, "replies": []}, {"body": "Okay just realized these don't expire on 10/05 wow I'm just used to weekly on this sub", "score": 3, "replies": []}, {"body": "All these screenshots will be helpful for that Robinhood class action lawsuit in the future. ", "score": 3, "replies": []}, {"body": "Annnnnd it’s gone", "score": 3, "replies": []}, {"body": "This did not age well. ", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "F", "score": 3, "replies": []}]}, {"body": "Up 18% during pre market, do you realize how fucked you are? Anyway, we’re going to need an update sometime later today", "score": 3, "replies": []}, {"body": "Marry me 😍", "score": 6, "replies": [{"body": "That’d be a poor investment in his life. But he does post to r/wsb so you’ve got a chance. ", "score": 28, "replies": []}]}, {"body": "Fuck yeah man. Rock the fuck out.", "score": 2, "replies": []}, {"body": "...green?", "score": 2, "replies": []}, {"body": "What’s your play for Monday? Are you buying calls? ", "score": 2, "replies": [{"body": "If it rallies add more 11/16s", "score": 5, "replies": [{"body": "Doubling down on this Q earnings? Ballsy. ", "score": 6, "replies": [{"body": " Autistic was the word I was looking for", "score": 5, "replies": [{"body": "That's an insult to autistic people", "score": 6, "replies": []}]}]}, {"body": "Reasonable course of action would be to salvage what you can of the short dated and roll out till June 2019 or later of the longer dated (if you're adamant of the bear case).\n\nIV gonna get crushed, best to let price action sort itself out for a few days/weeks before re-entering in size.", "score": 3, "replies": [{"body": "You sound like the guy from Bloomberg AM. Are you the British dude? If so, stop talking about soccer nobody cares. Thanks for taking my call, godbless. ", "score": 3, "replies": [{"body": "It's *football* m8.", "score": 2, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "was*", "score": 3, "replies": []}]}, {"body": "F all the gone on Monday", "score": 2, "replies": []}, {"body": "Time to exit.", "score": 2, "replies": []}, {"body": "your all caught up!", "score": 2, "replies": []}, {"body": "Holy shit man you torched your tendies", "score": 2, "replies": []}, {"body": "F", "score": 2, "replies": []}, {"body": "Ahahaha you dumb fuck. Should've closed that trade friday. Say goodbye to your 160k lmao you dumb shit robin hood fag bear", "score": 8, "replies": []}, {"body": "First thing Monday, take that 300k and go to a real broker.", "score": 2, "replies": []}, {"body": "Did you take any profits? Tesla seems like a shit show for sure, but there's no telling that it's gonna keep on going down knowing how retarded the stock is.", "score": 1, "replies": []}, {"body": "Jesus man. ", "score": 1, "replies": []}, {"body": "GG", "score": 1, "replies": []}, {"body": "16% up premarket rip", "score": 1, "replies": []}, {"body": "You could have bought a Tesla with those gains but now they're all gone. Shame.", "score": 1, "replies": [{"body": "He was hoping for MU sentiment. The problem about Tesla is less damaging news means moon. The cult is still there. Should have locked the gains and waited. Oh well, easy comes easy goes. No sweat he still made banks. ", "score": 1, "replies": [{"body": "Tesla is a cult. they're the only company I've seen go up on bad ERs. You have to either be really bold or really stupid  betting against a company with this kind of fan base. https://imgur.com/jNRGM5B.jpg", "score": 1, "replies": [{"body": "The banks are also their big fans. That explains the upgrades today.", "score": 1, "replies": []}]}]}, {"body": "Let the little fish go so you can catch the big fish later", "score": 1, "replies": [{"body": "Post pics.", "score": 1, "replies": [{"body": "I did", "score": 1, "replies": []}]}]}]}, {"body": "You alive bud?", "score": 1, "replies": []}, {"body": "Pasta la vista bby", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Robin hood", "score": 7, "replies": []}, {"body": "it's robin hood. it's for people who can't afford or aren't smart enough to use a real broker. ", "score": 3, "replies": [{"body": "Robinhoods interface is better than any legit broker. Customer support is pure trash though ", "score": 9, "replies": [{"body": "You’re on crack", "score": -1, "replies": []}]}, {"body": "I mean... you're not wrong, but for those of us who still work 40 hours a week, I don't work next to a computer so I need to pull out my phone to make trades, it's convenient.", "score": 2, "replies": [{"body": "They all have apps bro...", "score": 4, "replies": [{"body": "But but zero commission fees bro... ", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": []}]}]}, {"body": "Elon just resigned rip your put position", "score": -2, "replies": [{"body": "why would it rip his position? Dont you want these things to happen if you hold puts?\n\n&#x200B;", "score": -1, "replies": [{"body": "he settled with SEC that means a huge uncertainty and fear is gone plus Q3 productions numbers look really good. ", "score": 2, "replies": [{"body": "Hmm I think it's going to decline monday", "score": 1, "replies": [{"body": "If you really think that, do not trade in the stock market. Look up how uncertainty and fear works. ", "score": 1, "replies": [{"body": "We'll see on monday! This whole ordeal is a big L", "score": 0, "replies": [{"body": "Looks like it's mooning ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Buy BABA PUTS!!! ", "score": -1, "replies": []}, {"body": "SEC was just a trial balloon for the FBI. I expect a criminal indictment and Musk in handcuffs on Monday after market close.", "score": -11, "replies": [{"body": "space jail", "score": 2, "replies": []}]}]}
{"title": "SEC settles charges with Tesla's Elon Musk, will remain as CEO but relinquish chairman role.", "selftext": "", "id": "9k0o3q", "created_utc": 1538256148.0, "score": 646, "upvote_ratio": 0.97, "num_comments": 293, "comments": [{"body": "Imagine losing $20MM and the Chairman title because you can't control yourself on twitter. ", "score": 446, "replies": [{"body": "[deleted]", "score": 328, "replies": [{"body": "A man is not measured by what he builds for a woman. But by what he *burns.*", "score": 170, "replies": [{"body": "that's poetic good sir.", "score": 30, "replies": [{"body": "The SEC protects poor defenseless investors from being mislead by the big bad powerful liars who work in tall office buildings.  This organization is part and parcel of the mothering heart of a woman for her defenseless infant. \n\nTo the government, all of you are infants or invalids, now toil and pay property taxes for the luxury of living on the outside of a concrete box and planting your feet on God's ground.\n", "score": 17, "replies": [{"body": "Can I subscribe to your newsletter? ", "score": 4, "replies": []}, {"body": "Please read me more i get more aroused by this abuse than 2009 did to my parents banking jobs", "score": 3, "replies": []}]}]}, {"body": "He is burning all the shorts on monday with SEC involved. ", "score": 8, "replies": [{"body": "I want to buy TSLA options but I have no fucking idea how I should play it. Whats gonna happen next week? Tesla meets its production goals but Elon is caught with a dead hooker in the back of his Model S?", "score": 19, "replies": [{"body": "> But Elon is caught with a dead hooker in the back of his Model S\n\nDon't worry, he'll just send it to space like he did with the Roadster.        ", "score": 23, "replies": [{"body": "So thats why he launched the roadster into space. Thats actually pretty clever.", "score": 7, "replies": [{"body": "Who do you think is providing body disposal services on the dark web? ", "score": 1, "replies": []}]}]}, {"body": "I see two things there that will drive up share prices, what's the confusion on how to play it?", "score": 4, "replies": []}]}]}, {"body": "Virgil(n)", "score": 1, "replies": []}]}]}, {"body": "It's 1/1000th of his net worth, it'll be recouped within a few weeks as the stock rallies, and he gets to keep his power.\n\nI'm sure he'll sleep soundly.", "score": 63, "replies": [{"body": "The ambien should help ", "score": 55, "replies": [{"body": "I hope he stops taking that, we don’t want him to turn racist ", "score": 25, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "i just wanna kno how he’s from Africa and not **b l a c k**", "score": 12, "replies": [{"body": "If he applies for citizenship he could become the richest African American in the US.", "score": 11, "replies": []}]}]}]}]}, {"body": "Net worth isn’t the same as liquid assets. Surely you must know this. ", "score": 6, "replies": []}, {"body": "What's the floor for TSLA is this a great opportunity to catch a previously missed train?", "score": 1, "replies": []}, {"body": "And doesn’t have to deal with those loathsome board cunts anymore ", "score": 1, "replies": []}, {"body": "The ambien should help ", "score": -8, "replies": []}]}, {"body": "Imagine becoming a US president because you cant' control yourself on twitter", "score": 42, "replies": [{"body": "He became president, because he had *ultimate* control of Twitter.", "score": 3, "replies": [{"body": "If by \"ultimate\" you mean \"none\".", "score": 3, "replies": []}]}]}, {"body": "Yeah, only Trump gets away with saying stupid shit on Twitter on a whim. ", "score": 50, "replies": [{"body": "Musk GOP candidate 2020/2024. Sure he was born in Africa but he doesn't *look* the part eh. And already got experience with calling his opponents pedo.", "score": 41, "replies": [{"body": "Obama was born in Africa and looked like it nothing stopping musk", "score": -7, "replies": [{"body": "u evr heard of punctuation", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": -13, "replies": [{"body": "The Senate can grant exceptions to that rule on a case-by-case basis. John McCain was born in Panama due to his military family, and Ted Cruz was born in Canada. It didn’t stop either of them from running.", "score": 13, "replies": [{"body": "Wrong forum. This is for dumb armchair financial advice, dumb armchair legal advice is next door.", "score": 11, "replies": []}, {"body": "Both were born to American parents who were outside the US temporarily. Even though they weren't born on US soil they still count as born citizen.", "score": 2, "replies": []}]}, {"body": "You need to be born a US citizen, which isn’t the same thing. He still couldn’t run, but it’s an important distinction. ", "score": 10, "replies": []}]}]}]}, {"body": "imagine becoming president because you cant control yourself on twitter...", "score": 1, "replies": []}, {"body": "Do either of those things matter? He's still a member of the board and CEO. ", "score": 1, "replies": []}, {"body": "Imagine still being bullish on TSLA. Elon is too much of  a liability but that won't persuade the cult.", "score": -13, "replies": [{"body": "Hahahahaha", "score": 4, "replies": []}, {"body": "Too much of a liability, how? He basically got away with what he was accused of. And now he'll have more time to focus on delivering rather than fighting Twitter and legal battles.", "score": 1, "replies": [{"body": "Ok, So a pot smoking CEO who thought nothing of a tweet that basically said he had funding to go private is not a liability to do or say something else that will surely be another boneheaded move?\n\nK", "score": 1, "replies": []}]}]}]}, {"body": "Saw this alert on my phone at exactly 4:20\n\nEmployment secured ", "score": 563, "replies": [{"body": "Are the Saudis hiring? ", "score": 94, "replies": [{"body": "By Allah, behave yourself", "score": 53, "replies": [{"body": "By Allah, clean your room or you will get a taste of my shoe!", "score": 18, "replies": [{"body": "Ahmed habibi, why you always actin wild", "score": 10, "replies": [{"body": "Tesla, Musk pay $40 million to settle Tweet charges, Musk to resign as chairman but stay on as CEO: http://tsla.invtots.com", "score": 1, "replies": []}]}]}, {"body": "You spelled ‏والله wrong", "score": 8, "replies": []}]}, {"body": "I am never trading on 9/11 again. 9/11/2018 they pumped SNAP and fucking destroyed my puts. ", "score": 8, "replies": [{"body": "Never forget.", "score": 3, "replies": []}, {"body": "I made most of my money after 9/11, just like mah boi Bobby Axelrod.\n\n\\#NeverForget", "score": 1, "replies": []}]}, {"body": "inshallah ", "score": 1, "replies": []}]}, {"body": "inb4 shareholder lawsuits tho", "score": 17, "replies": [{"body": "$4.20 secured ", "score": 3, "replies": []}, {"body": "Ya the class actions will happen.", "score": 2, "replies": []}, {"body": "^", "score": 1, "replies": []}]}, {"body": "I tried seeing if they actually did post it at exactly 4:20 EST - anyone know some way to see timestamp of the release?", "score": 3, "replies": [{"body": "I saw a notification on my phone and by the time I checked it was 4:21 (CST). Someone else posted a screenshot from the SEC news twitter that had a 4:20 time stamp", "score": 3, "replies": [{"body": "https://twitter.com/SEC_News/status/1046147807977959424", "score": 2, "replies": [{"body": "Illuminati confirmed ", "score": 3, "replies": []}]}]}]}, {"body": "TREELON MUSK", "score": 3, "replies": []}, {"body": "420 upvotes, can’t upvote sorry", "score": 2, "replies": []}, {"body": "Your comment's at 420 Karma rn...", "score": 1, "replies": []}]}, {"body": "I feel smart now since I bought calls. Always buy the dip\nEdit..it sounds like I bought a lot since plural, but only got 2 lol", "score": 74, "replies": [{"body": "To be fair, with the premiums on TSLA, 2 calls are probably worth more than my car. Unless we talking some spicy deep OTM weeklies, which are probably still worth more than my car.", "score": 44, "replies": [{"body": "fuck you must have a pos car", "score": 18, "replies": []}, {"body": "i did a 275/295 spread. costed $650, max option value 2k so if it  hits past 300 i'll prob just triple up.", "score": 11, "replies": []}]}, {"body": "always buy 2 so you can pluralize things that you post", "score": 13, "replies": []}, {"body": "4x $310 FD’s leggo", "score": 9, "replies": []}, {"body": "300C 11/16 take me daddy musk 🍆", "score": 5, "replies": []}, {"body": "6 11/2 $280c checking in", "score": 3, "replies": []}, {"body": "thanks for clarifying that you are poor, i guess..", "score": 6, "replies": [{"body": "didn't want \"proof or ban\" only to get laughed at afterwards", "score": 10, "replies": []}]}]}, {"body": "Elon settled \"for 20\" million \n\n&#x200B;\n\nheh lol ", "score": 65, "replies": [{"body": "Holy shit! It’s coming full circle.", "score": 14, "replies": [{"body": "8D chess my hombre", "score": 6, "replies": []}]}]}, {"body": "Big rally Monday morning", "score": 51, "replies": [{"body": "SEC didn't give us a chance to YOLO!", "score": 6, "replies": [{"body": "What?  They absolutely did!  They did it on a Thursday and you had all of Friday.  You had an entire trading day +after hours to YOLO.  You got scurred", "score": 22, "replies": [{"body": "Ha! It's like you read my diary!", "score": 4, "replies": [{"body": "Is it far fetched that Musk and the SEC colluded for another short burn?  There's been crazier conspiracy theories, right?", "score": 6, "replies": [{"body": "I think you're on to something\n\nTesla is probably going to report great numbers next week in terms of the numbers of cars shipped during the quarter. That combined with the slap on the wrists for Elon today is going to put the shorts gonads in a jam jar.", "score": 5, "replies": []}]}]}]}]}]}, {"body": "Sounds like a reason to rally Monday.  Might have to daytrade it for some free money. ", "score": 146, "replies": [{"body": "How could you daytrade it?  It's too late.  It'll just gap up at the open.  There won't necessarily be any volatility after that.", "score": 8, "replies": []}, {"body": "It's good news, but there's still a large lawsuit outstanding and the DOJ can prosecute him criminally. Obviously the stock is still overpriced but rationality has never driven it.  I could see retail investors pouring back in driving it up maybe 5% and then it declining again on Tuesday.", "score": 39, "replies": [{"body": "[deleted]", "score": 37, "replies": [{"body": "We already know Tesla hit its numbers.  We knew that last week.", "score": 20, "replies": [{"body": "The market has ADD though. Reaffirmation will probably drive the stock upwards because the market tends to be reactionary as fuck. ", "score": 22, "replies": []}, {"body": "ditto... and if anything didn't they hit numbers with 3 days remaining?  So in those 3 days they'll exceed numbers...", "score": 8, "replies": []}, {"body": "so sell the news?", "score": 3, "replies": []}, {"body": "Can be a good reminder/distraction the hype is still on.", "score": 3, "replies": []}]}]}, {"body": "I thought you said the SEC was going to win this clean. This is a slap on the wrist. ", "score": 9, "replies": [{"body": "Pretty sure a settlement means the SEC won bud.   They made an offer and he took it.", "score": -10, "replies": [{"body": "You talk like someone who doesn’t really understand what the hell is going on but wants to sound like he does to people who don’t know how boards, companies, and the SEC work. This settlement is practically meaningless. Musk won’t be chairman but he’ll still control the board, Tesla’s direction and day-to-day operations.", "score": 6, "replies": [{"body": "I think you're confusing \"winning\" and severity of the outcome.  Probably because you're a fool.\n\nFurther, its not like this is over and all problems disappear.  The other issue which is just as large are the outstanding lawsuits against Tesla.\n\n\"Let's be clear, however, that the game is far from over. Here are some outstanding items:\n\nFirst, the SEC settlement will fuel the various shareholder lawsuits. Having to settle the SEC lawsuits, Elon and Tesla will not likely be able to get those other lawsuits dismissed. At a minimum, they will have to settle them, too. It's just a question of how much they will cost.\n\nFor example, short-sellers who covered their positions in the hours after Elon's famous $420 go-private tweet have a case, and longs who bought the stock after that time and for the next 17 days, all have a case against Tesla's false statements. That liability could stretch into the billions for Tesla and Musk. Anyone looking to invest in Tesla, or extend credit to it, will have to take into consideration such a potential multibillion dollar liability. Maybe Tesla's suppliers move to Cash-On-Delivery terms, and that would drain Tesla's cash balance almost instantly.\"\n\nhttps://www.thestreet.com/opinion/why-the-sec-s-settlement-with-elon-musk-and-tesla-is-a-slap-on-the-wrist-14727906?puc=yahoo&cm_ven=YAHOO&yptr=yahoo", "score": 2, "replies": []}]}, {"body": "Oh please. ", "score": 1, "replies": []}]}]}, {"body": "So I should do the opposite of what you’re telling me since this is WSB?", "score": 2, "replies": []}, {"body": "All those lawsuits are going to be covered by the $40 million fine. Or at least a lot of them will ", "score": 2, "replies": [{"body": "They most certainly will not be included.  This fine and the class action are two completely separate things.  If anything it provides the class action with evidence of wrongdoing since he was forced to step down as Chairman (even if he doesn't have to explicitly admit wrongdoing in the settlement).", "score": 11, "replies": [{"body": "The SEC statement specifically says that the fine with be for investors harmed by his actions. ", "score": 7, "replies": [{"body": "That doesn't mean it limits Tesla from being sued. Assessing losses and distributing penalties from damages is not within the scope of their settlement, nor is that even what the SEC does.", "score": 6, "replies": [{"body": "Sure but it gives then less of a leg to stand on. Knowing there is $40 million to hand out already ", "score": -4, "replies": [{"body": "$40 million is a drop in the bucket.  It was a punitive charge/slap on the wrist and nothing more.", "score": 6, "replies": []}]}]}]}]}]}, {"body": "Yeah but the lawsuit is like... later", "score": 1, "replies": []}, {"body": "5%? I am guessing 20 - 30 %.", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": -12, "replies": [{"body": "He stays as CEO.  Relief rally.", "score": 36, "replies": [{"body": "But he's obviously done something pretty bad if he's handing over $20 million for the SEC, and the department of justice has a criminal investigation ongoing. ", "score": -2, "replies": [{"body": "Well, duh.  That's why the stock lost $7B or whatever Friday.  He did a bad bad thing.", "score": 10, "replies": []}, {"body": "its hard as fuck to prove fraud beyond a reasonable doubt though", "score": 2, "replies": [{"body": "\"I rounded up because 420 lmao\"", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": -16, "replies": [{"body": "People were fearing worse. This is relatively mild vs. no Musk at all.", "score": 24, "replies": []}, {"body": "Musk is God emperor at Tesla. If they removed him that would halve the stock price. No Chairman for 3 years? And the board gets it say what he tweets so he doesn't shoot himself in the dick again? This is like Christmas. ", "score": 15, "replies": [{"body": "Halve the stock? Lol. Everyone here likes to talk about Elon leading the TSLA cult,  but he also leads the Tesla cult.  If he was kicked out as CEO the only rational course of action for the next CEO would be to begin liquidating all assets.  \n  \n", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 8, "replies": []}, {"body": "Not sure I understand all the downvotes here. Removing him as chairman and adding two indy board seats means that next time he pulls an Elon, he won’t have the safe votes he’s had before and could be removed. If I were holding TSLA shares, I’m not sure I’d see this as great news. ", "score": 2, "replies": [{"body": "Gotta know that all the boards were on his side when he tweeted. He is still Tesla superstar. Two independent haters no matter as long as he still has his homies there.", "score": 3, "replies": []}, {"body": "Good thing people long on tsla lack any sort of critical thinking skills.  I expect this stupid ass stock to rally like hell on monday", "score": 2, "replies": []}, {"body": "The board's not going to remove him for the same reason the SEC didn't remove him.\n\nWho would be better?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Not exactly sure what it means for the stock. \n\nI bought calls at close as a gamble.", "score": 45, "replies": [{"body": "Hello gambling brother. Just pissed I didnt buy more calls. I fucking knew he would settle over the weekend. I'm such a tardfag", "score": 33, "replies": []}, {"body": "congrats, you just made a shitload of money", "score": 23, "replies": []}, {"body": "Congrats on you gainz", "score": 8, "replies": []}, {"body": "Sam e", "score": 5, "replies": []}, {"body": "What's a calls?", "score": 1, "replies": []}, {"body": "If you don't know what this means, you probably shouldn't be trading stocks or options.", "score": 1, "replies": [{"body": "I know what this means just don't know how much the stock will move, is it going to recover the losses on Thursday and Friday or go beyond? ", "score": 6, "replies": [{"body": "3Q delivery numbers going to be next week...  just sayin\n", "score": 5, "replies": [{"body": "is anyone expecting them to be bad? ", "score": 1, "replies": [{"body": "Probably half the analysts.  They are in a catch 22 because if they need to justify their sell rating but can't say anything good about the stock.  Who knows.  Most rational people expect a delivery goal met and knock out earnings.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "What will financial education guy next video be tomorrow? :D\n", "score": 61, "replies": [{"body": "Hahaha, emotionally cucked.", "score": 27, "replies": []}, {"body": "its already out lol\n\nhttps://www.youtube.com/watch?v=qTvNzDUu0Z4&t=303s", "score": 4, "replies": []}, {"body": "https://www.youtube.com/watch?v=ARrNYyJEnFI", "score": 1, "replies": []}]}, {"body": "Why couldn't Shkreli do this? System is fucked. They let the African American pay a small fee but stick the white person in prison.", "score": 331, "replies": [{"body": "Also he's an albanian first generation immigrant with possible Jewish ancestry. That makes it level 3 racism, the worst kind", "score": 65, "replies": [{"body": "Source on the jewish ancestry?", "score": 1, "replies": [{"body": "I think it's just a meme TBH. He said his parents were Christians, I remember that.", "score": 2, "replies": []}]}, {"body": "I think it’s more like level 9000. ", "score": -2, "replies": []}]}, {"body": "You don’t know how livid I was after hearing Bill Cosby got Less time than Martin Shkreli.\n\n~~Wouldn’t go as far as to say this was a race thing though.~~ lol, forgot Elon was actually from Toto by Africa.", "score": 105, "replies": [{"body": "Elon is the African American ", "score": 45, "replies": []}, {"body": "Our justice system is fucked when a guy who's investors made 2x the money they put in gets thrown in jail for 7 years and a guy who raped numerous women gets 3 years. ", "score": 82, "replies": [{"body": "It’s even worse that Bill Cosby still got to live a pretty pampered life for decades after his assaults and still for a few years after the allegations started emerging. Instead Shkreli gets arrested in his early 30s for making his investors tons of money.\nIt’s fucked up.", "score": 46, "replies": [{"body": "Seems like you are making the situation way simpler than it actually is.\n\nYou really think the reason he got 7 years is because he \"made his investors tons of money\"? C'mon.", "score": 6, "replies": [{"body": "Let’s be honest, 100s of cases like Shkreli’s go through the SEC every year and in most cases the offender receives little more than a fine and a slap on the wrist—jail time is practically heard of. The reason he got jail time was as a result of him being politically vocal, as well as being somewhat of a smug asshole in and out of court. \nThe loss cited in the fraud case is marginal compared to the net, but yeah you’re right that ‘tons of money’ is definitely a hyperbole.\n\nThough I’d be interested to hear how you could possibly justify 7 years as being a fair sentence if that’s what you mean to imply", "score": 18, "replies": []}]}]}, {"body": "Short $NIGR", "score": -7, "replies": []}]}, {"body": "I'll do you one better- Elizabeth Holmes CEO of Theranos has not been jailed for being a woman FFs. HSBC bank laundered money for Cartels and no one was jailed, even after the financial crisis no one was jailed. \n\n&#x200B;\n\nThat pretty much tells you about the morality and thought process of the system. My guess is that Martin would have been fine if he didn't go after Hilary. ", "score": 5, "replies": []}, {"body": ">  lol, forgot Elon was actually from Toto by Africa. \n\nDid he bless the reins down in TSLA?", "score": 1, "replies": []}, {"body": "Did you faggots forget about Brock turner already?", "score": 0, "replies": [{"body": "I think you mean, CONVICTED RAPIST HUMAN FILTH Brock Turner. \n\nThe whole system is so utterly subjective and contradictory, it’s disgusting. It’ not like Turner had a better public perception than Martin did, if anything his was much worse. \n\nI have no fucking clue what type of deranged mental gymnastics someone has to do in order to come to the conclusion that raping someone gets only a couple of months, but god forbid you double your investors money, that obviously deserves 7 years.", "score": 3, "replies": [{"body": "100% agree, the system is fucked. But I was referring to uturn_singleton’s comment. To imply that African Americans have it easier because they only pay a “small fee” while white people get thrown into prison is fucking retarded. Elon’s case had nothing to do with race. ", "score": 0, "replies": [{"body": "Yeah, I think he was just making a joke about Musk being South African and the irony of an ‘African’ guy getting off the hook easier than your typical 2xwhite collar criminal.", "score": 7, "replies": []}]}]}]}]}, {"body": "It was the DOJ that put Shkreli in prison, not the SEC. The DOJ's criminal investigation into Musk/Tesla is ongoing. ", "score": 24, "replies": []}, {"body": "[deleted]", "score": 26, "replies": [{"body": "Yeah, if he wasn't trying to be funny and smirking in the court room he would have gotten less time for sure. He even managed to piss off the judge. ", "score": 18, "replies": [{"body": "He won't be trying to be smirking now I guess.", "score": 1, "replies": []}]}]}, {"body": "Those nibbas fucked me up good :(", "score": 12, "replies": [{"body": "Miss you bb😘", "score": 10, "replies": []}]}, {"body": "Simply because larger dick according to Grimes.", "score": 2, "replies": []}, {"body": "I see what u did there", "score": 1, "replies": []}]}, {"body": "Wrist, meet slap. ", "score": 24, "replies": []}, {"body": "Going to try to buy shares premarket Monday.\n\nI imagine options will be fucking insanely priced.", "score": 22, "replies": [{"body": "If I had money I would buy 100 shares and sell covered calls. \n\nOptions are retardedly expensive for this stock.", "score": 12, "replies": [{"body": "well it does swing $50 up or down nearly every week", "score": 9, "replies": []}]}, {"body": "exactly what i did, sold my spy shares and moved them to tsla. ill probably move them back when they hit 300 again", "score": 1, "replies": []}]}, {"body": "Sorry puts", "score": 55, "replies": [{"body": "[Oof](https://www.reddit.com/r/wallstreetbets/comments/9jyyn8/for_those_who_have_asked_tesla_puts_up_70k_on/)", "score": 11, "replies": [{"body": "That’s guy’s in a total state of shock. In the comments he’s acting like his puts are going to be just fine.", "score": 21, "replies": [{"body": "He already made enough money from TSLA. 50% loss is not going to make big dent unlike our MU calls.", "score": 5, "replies": [{"body": "Yeah definitely, it’s a crazy gain. I just thought it was funny that he still believes in the position.", "score": 3, "replies": [{"body": "Lol yeah this probably runs up Monday big time. If a new chairman is announced (prob his brother) this will spike even more..", "score": 4, "replies": [{"body": "No his brother being announced chairman is a neagtove for the stock. They need a good experienced auto industry chairmen ", "score": 6, "replies": [{"body": "Think about it....\n\nHis brother is basically like having Elon they’re one and the same.", "score": 1, "replies": [{"body": "I think his brother will be chairmen. I don't think it's good for the stock. My thesis is musk as CEO and a good experienced traditional chairmen is the best case for the stock. ", "score": 2, "replies": [{"body": "An experienced guy will have difference of opinion with most of the stuff happening in TSLA. It is better to have a good figurehead as Chairman than to have a dino vehicle guy..", "score": 1, "replies": []}]}]}]}]}, {"body": "RIP ", "score": 1, "replies": [{"body": "Send u/potatorader all the Fs you can muster.\n\nFFFFF\nF\nFFFF\nF\nF", "score": 1, "replies": []}]}, {"body": "Of course I still believe in my position. It was never based on SECs investigation of Elon although that certainly strengthened the bear thesis. It's based on the fact that Tesla may just barely turn a profit this quarter while exhausting the backlog of premium model 3 orders and unloading the ZEV credits, neither is sustainable. If you are really interested in understanding the religion of tesla I would highly recommend the montana skeptic podcast with hidden forces. Convertable bonds are coming due and they will have no way to pay but through an equity raise. Too put it bluntly the shit storm is just beginning for Tesla.", "score": 0, "replies": [{"body": "Definitely agree with you on a lot of those points, and I think the fundamentals behind your trade were rock solid when you made it, the SEC investigation certainly being an added benefit. However I think in the coming weeks/months we’ll see how the market reacts to increased stability with Musk stepping down. The question is how much of a limiting factor was having a prudent Musk at the helm to investors. Beyond that, since its inception the perception of Tesla has always been one that’s closely tied to Elon, and that’s because in part it relies on ‘Elon musk’s brand’, an interesting relationship I’ve not seen much of elsewhere.\n\nI’m not quick to say that $TSLA rallies an insane amount tomorrow, but I think a lot of the trading being done in the coming weeks will be based on the perception of the new chairman and the Value of a hopefully more steady executive board.  \n\nThe point being, I don’t think your trade is dead or anything, but the underlying fundamentals (those most relevant to the coming weeks) have drastically changed with the removal of Elon Musk.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "What happened with the sudden price spike to 307 and back down to 267 today?", "score": 8, "replies": [{"body": "Today?", "score": 2, "replies": [{"body": "https://i.imgur.com/19hgDsG.png", "score": 2, "replies": [{"body": "That was yesterday and a graph glitch.", "score": 1, "replies": [{"body": "Ah ok, so not an actual price swing?", "score": 1, "replies": [{"body": "Pretty much yea.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "WSB says it'll go up. That means it'll go down. Keep those puts", "score": 6, "replies": []}]}, {"body": "TSLA to 350 next week", "score": 12, "replies": [{"body": "I feel bad for the shorts who will be having 2 sleepless night before Monday execution by burning.", "score": 7, "replies": []}]}, {"body": "Monday is going to be fun.", "score": 13, "replies": []}, {"body": "Read Fridays news here, Kimbal Musk appointed new Chairman of the board.  ", "score": 10, "replies": [{"body": "You misspelled Grimes", "score": 1, "replies": []}, {"body": "Link? ", "score": 0, "replies": [{"body": "Give me a week, I'm predicting the future here.  Elon and his brother own well over 20 percent of the company, and many of the existing board members are elon fans.  His brother is a board member, and can be chairman with a vote of the board.  Board members are retained by a vote of the shareholders.  So the board can either elect Kimbal, or lose their seats.  ", "score": 7, "replies": [{"body": "Chairman should be independent. Let's see if there are any unwritten provisions in this deal. ", "score": 2, "replies": []}]}]}]}, {"body": "RIP [this guy](https://www.reddit.com/r/wallstreetbets/comments/9jyyn8/for_those_who_have_asked_tesla_puts_up_70k_on/)", "score": 10, "replies": []}, {"body": "This is good for AMD.", "score": 9, "replies": []}, {"body": "Kimball Musk new Tesla Chairman secured", "score": 8, "replies": [{"body": "People forget he still has a lot of homies there. \nBut it’s going to be independent powerless Chairman tho.", "score": 4, "replies": []}]}, {"body": "Tesla and Musk the all father pay 40 million dollars, who does that money go to?\n", "score": 6, "replies": [{"body": "To all those harmed by the tweet. Settle all the lawsuits through a court approved process. The SEC statement says thats what the money is for.\nSo RIP all those lawyers and their class actions ", "score": 12, "replies": [{"body": "It goes towards the class action settlements but is not all of it", "score": 7, "replies": []}, {"body": "I don't think they can do that arbitrarily, unless all the lawyers agree to that.", "score": 3, "replies": [{"body": "Well its going to cover a few at least ", "score": 0, "replies": []}]}, {"body": "Thank you. Will have to read the SEC statement. ", "score": 1, "replies": []}]}, {"body": "This is a very valid question ", "score": 2, "replies": []}, {"body": "Uh, the military, some babyboomer's social security, perhaps repairing a bridge or two? And so on", "score": 4, "replies": [{"body": "Or Trump incoming campaign ", "score": 1, "replies": []}]}]}, {"body": "So that YouTuber that sold all his TSLA stock on Friday is probably crying right now", "score": 7, "replies": [{"body": "He had weak hands.  Claims hes a Warren Buffett type investor.  Smh", "score": 16, "replies": []}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "nah, the current cycle is some bullshit happening makes the stock dip and then it always bounces back to 300. it's one of the most consistent volatile meme stocks ", "score": 5, "replies": []}]}, {"body": "Told my dad to pull out and sell his shares early when the news broke a couple days ago and now I feel like a dick lmao ", "score": 17, "replies": [{"body": "Buy high sell low", "score": 21, "replies": []}, {"body": "You don’t advise. I never advise my friends or families how they should do with their stocks. It’s very sensitive subject. ", "score": 12, "replies": []}, {"body": "Most investors are in TSLA for the long-haul (beyond vehicles) and you put on your Investment Advisor hat after reading a headline. ", "score": 5, "replies": []}, {"body": "You should. Asshole ", "score": 7, "replies": []}, {"body": "Hopefully your dad knew better than to take your advice ", "score": 1, "replies": []}]}, {"body": "Would someone please explain to me how this is good news for the stock ? Or is it a case of \"it's bad news, but not as bad as exptected\" thanks", "score": 7, "replies": [{"body": "If Musk hadn’t settled there was a good chance he would have been forcibly removed as CEO. Much of the value of TSLA seems to be tied directly to Musk, so that would have sent the stock plunging.\n\nThis settlement allows him to remain as CEO and the SEC thing is over with. So yeah, bad but not as bad as expected is fair.\n\nStill ridiculous to me this is the largest auto maker in the US. They lose money at an outstanding rate and the CEO just had to settle on fraud charges with the SEC. Fucking cult stock this one.", "score": 15, "replies": [{"body": "Thanks for the explaination", "score": 3, "replies": []}, {"body": "Tesla is not the largest automaker in the US by any margin. ", "score": 1, "replies": [{"body": "I think he meant by market capitalization", "score": 6, "replies": [{"body": "GM has a higher market cap", "score": 1, "replies": [{"body": "As of Friday, yes GM has a higher market cap. We’ll see if that holds even through Monday.", "score": 4, "replies": []}]}]}]}, {"body": "Salty", "score": 1, "replies": [{"body": "Lol salty about what? Not my money on the line.\n\nStupid people gonna stupid.", "score": -1, "replies": [{"body": "This stock been called a cult stock erroneously.  No \"cult\" members have enough money to move the price.  The reason it is priced the way it is is from institutional investors.  Don't be ignorant of that fact.", "score": 2, "replies": [{"body": "True. See what ARKK did yesterday (hint, they bought $20M worth yesterday, crazier thing is that they sold SQ, AMZN and few other tech stocks to buy TSLA).", "score": 2, "replies": []}]}]}]}]}, {"body": "There is no more uncertainty left, before we didn't know if he stays, leaves, goes to court etc now with a lot less uncertainty the price should go up since the confidence of investors goes up.\n\nPeople are willing to invest a lot more when they know where the company is going compared to limbo.", "score": 3, "replies": []}]}, {"body": "I knew I should have bought calls but didnt have the balls", "score": 19, "replies": [{"body": "Better than being a putz and buying puts? ", "score": 3, "replies": []}, {"body": "Should have* you autist", "score": -1, "replies": [{"body": "That’s what i put....", "score": 1, "replies": [{"body": "Nice edit fag", "score": 1, "replies": []}]}]}, {"body": "should of", "score": -1, "replies": [{"body": "He edited it, what a pussy", "score": 2, "replies": []}, {"body": "I don’t know what you are talking about.... lol", "score": 0, "replies": [{"body": "should have ", "score": 0, "replies": []}]}]}]}, {"body": "Slap on the wrist secured", "score": 11, "replies": []}, {"body": "No way Elon would sign a deal to quit. He's gonna win or die with Tesla.", "score": 5, "replies": []}, {"body": "Jeremy video incoming bois!", "score": 5, "replies": [{"body": "Hahahaha", "score": 1, "replies": []}, {"body": "''Bought back my Tesla shares''", "score": 1, "replies": []}]}, {"body": "well fuck what am I supposed to do with these 2,000 FREE ELON! shirts I bought to sell at WSBcon in vegas", "score": 5, "replies": []}, {"body": "Should of sold my 3k profit put lol ", "score": 13, "replies": [{"body": "should have*", "score": 8, "replies": []}]}, {"body": "rip puts?", "score": 3, "replies": []}, {"body": "Maybe now he'll stop smoking weed and getting up in that gross hippy pussy that's frying his brain and start fucking Asian prostitutes and doing lines of coke like a real man ", "score": 3, "replies": [{"body": "Amen.", "score": 1, "replies": []}]}, {"body": "The moment you hit 420 upvotes on an Elon Musk thread: https://imgur.com/gallery/lkVhHt0\n", "score": 3, "replies": [{"body": "Does that mean I have to take the post private now?", "score": 2, "replies": [{"body": "Funding secured? ", "score": 1, "replies": []}]}]}, {"body": "Settlement secured.", "score": 3, "replies": []}, {"body": "Is this bad for MU?", "score": 3, "replies": []}, {"body": "SEC should be fucking shut down. Forcing Elon out of chairman position is complete fucking coruption. This is fucking bullshit.", "score": 3, "replies": [{"body": "You got puts?", "score": 1, "replies": []}]}, {"body": "Musk did nothing wrong ", "score": 7, "replies": []}, {"body": "Does not admitting any wrongdoing in the settlement decrease the likelihood of DOJ charges? ", "score": 2, "replies": []}, {"body": "Are my 400 FDs going to go up on Monday?", "score": 2, "replies": []}, {"body": "Funding secured. ", "score": 2, "replies": []}, {"body": "https://www.sec.gov/litigation/complaints/2018/comp-pr2018-226.pdf is this a new one???", "score": 2, "replies": []}, {"body": "Amazing how everyone here is bullish on this. Can’t wait for the Tesla call FD loss posts this Friday. ", "score": 1, "replies": [{"body": "Why would it not go up? Was the most likely scenario here that he gets literally no penalty? Because this is basically the softest penalty possible.", "score": 4, "replies": []}]}, {"body": "TO THE MOON", "score": 1, "replies": [{"body": "TO MARS", "score": 1, "replies": [{"body": "The funny thing is that he's already reached Mars... the Moon SpaceX actually hasn't gotten to", "score": 1, "replies": []}]}]}, {"body": "Honestly probably not a bad idea , to bad he was forced off instead of like google when the owners took a step back for a while", "score": 1, "replies": []}, {"body": "He dindu nuffin ", "score": 1, "replies": []}, {"body": "What does this mean for MU?", "score": 1, "replies": []}, {"body": "Fucking oath take that ya pedos", "score": 1, "replies": []}, {"body": "So what does this mean for my 260 10/19s?", "score": 1, "replies": [{"body": "You’re gonna be rich ", "score": 2, "replies": []}, {"body": "Moon", "score": 2, "replies": []}, {"body": "Puts or calls?", "score": 1, "replies": [{"body": "Calls.  As soon as I woke up Friday I saw the tank and pulled the trigger.", "score": 1, "replies": [{"body": "Smart.", "score": 1, "replies": [{"body": ">Smart.\n\nMaybe - well soon see.", "score": 1, "replies": []}]}]}]}]}, {"body": "Never understood how it was ever considered ok/ethical for someone to be both chairman and CEO, seeing as chairman gets to decide the CEO's salary. I know it happens with other companies too but at least they usually have the decency to swap the chairman role with one of their CEO buddys so it's not as blatantly corrupt", "score": 1, "replies": []}, {"body": "Welp guess I gotta wake up early for the first pre-market trades and YOLO for a quick 5% day trade. Free monies", "score": 1, "replies": []}, {"body": "Lol, will be back to 300 in a week. ", "score": 1, "replies": [{"body": "Try Monday", "score": 3, "replies": []}]}, {"body": "Not for nothing but probably the best thing that could happen for Tesla.  Elon has some adult supervision now but is still playing the visionary role.  ", "score": 1, "replies": []}, {"body": "What a lucky break for Musk, SEC is a bunch of pussies. ", "score": 1, "replies": []}, {"body": "This could go either way guys... calm your jets.", "score": 1, "replies": [{"body": "Hahahaha", "score": 13, "replies": []}]}, {"body": "YOURE FIRED", "score": 1, "replies": []}, {"body": "Am hoping it dips a lil bit more maybe 250 to buy in again", "score": 1, "replies": []}, {"body": "I love how he toyed with the SEC, accepting their plea deal Thursday, rejecting it Friday, and now accepting it today.\n\n&#x200B;\n\nEdit: grammar fix", "score": -1, "replies": [{"body": "\\#LikeABoss \n\n\\#LikeAChairman", "score": 1, "replies": []}]}, {"body": "Why is the SEC so interested in pushing elon out of the leadership role of the company? Seems kind of political to me.", "score": 0, "replies": []}, {"body": "it was all planned. he wants to run space x only", "score": 0, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Dude it’s Saturday... It fell ~14% Thursday afterhours when the SEC announced they were suing. No one knows how this is going to shake out yet.", "score": 9, "replies": [{"body": "What kind of timeline do these payments have to be paid? It cant be a one time sum by end of the month right?", "score": 1, "replies": []}, {"body": "Yes, and now The -14% will be reversed on Monday and then some,. SEC wrist slap secured. Huge Uncertainty removed.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "? The point is the market’s closed right now and we can’t trade. All us autists would love to be trading over the weekend.", "score": 6, "replies": []}]}]}]}, {"body": "[deleted]", "score": -3, "replies": []}]}
