{"title": "$17k AMZN YOLO Update", "selftext": "[deleted]", "id": "9hvw84", "created_utc": 1537579439.0, "score": 171, "upvote_ratio": 0.92, "num_comments": 113, "comments": [{"body": "\"I'm diversifying my profile and never touching Amazon again.\"\n\nThe problem is not papa Bezo. The problem is you went full yolo on FD.", "score": 185, "replies": [{"body": "Yeah....OP will probably go with a safer, less volatile stock like MU.", "score": 59, "replies": [{"body": "This is good for MU.  ", "score": 17, "replies": []}, {"body": "This is very solid advice", "score": 11, "replies": []}, {"body": "Straight down is certainly less volatile than a stock like AMZN which teases you with hope.", "score": 2, "replies": []}]}, {"body": "I am new here...what is a FD?", "score": 2, "replies": [{"body": "Foolproof decision", "score": 15, "replies": []}, {"body": "Fart diamond ", "score": 9, "replies": []}, {"body": "Fking Dick", "score": 2, "replies": []}, {"body": "Fire department", "score": 1, "replies": []}]}]}, {"body": "You did a YOLO with expiration before ER? Fuck", "score": 38, "replies": []}, {"body": "Don’t do anything permanent if you know what I mean. Reach out for help if you need it.\n\nYou’ll get through this ", "score": 95, "replies": [{"body": "Appreciate it. Luckily I was investing with my savings and am still very young so I have a lot more ahead of me in life. I also have enough money in my bank account for anything that I need so it’s not like I lost my rent money. It just hurts that the money I worked so hard for is gone:(", "score": 62, "replies": [{"body": "The expectations for next week are that tech stocks will go up because of the changes In what sectors the individual stocks will be moved to. This could go either way. Just trying to give you some hope. I lost 2/3rds of my portfolio this week. Which is about what you have left. Small potatoes compared to your loss. Best of luck. [more info](https://www.cnbc.com/2018/09/20/theres-will-soon-be-a-new-way-to-play-fang.html) ", "score": 20, "replies": [{"body": "Unfortunately I think the whole executive order to investigate goog and fb for antitrust might throw a wrench in the rally. ", "score": 10, "replies": [{"body": "White house denied it ", "score": 1, "replies": [{"body": "Saw that, which only lends more validity to it in my mind. This bunch would lie when the truth fit better. ", "score": 1, "replies": []}]}]}, {"body": "If anything (and I don’t expect this rotation to mean anything) these expectations are typically an indicator that the exact opposite will happen. If gains were to be had they would have been realized in anticipation not on realisation. People buy rumors and sell news, not the other way round.", "score": 4, "replies": []}, {"body": "What is the name of this index?", "score": 1, "replies": [{"body": "S&P communication sector on Monday ", "score": 2, "replies": []}]}, {"body": "Why would tech stocks go up because of their reclassification? ", "score": 1, "replies": [{"body": "Read the link please ", "score": 1, "replies": [{"body": "Are you taking any advantageous positions for this? ", "score": 1, "replies": [{"body": "No. I’m tapped out. Got shares and options for next week. I do have Qcom calls for 4/19 so maybe something will happen there", "score": 3, "replies": []}]}]}]}]}, {"body": "The money is gone. These experiences are yours. You’ve earned them. Appreciate your life. Remember when you lost 13k? Sucks don’t it? When your flight is canceled it won’t be as bad as the time you lost 13k. \n\nYou’re a better stronger poorer person. \n\nYou can use your extra expensive experience to improve your decision making with your investments from now on. ", "score": 11, "replies": [{"body": "will you be my therapist?", "score": 4, "replies": []}]}, {"body": "For everyone who posted 50k gains on a 15k bet, there are several like you who lost the lot.\n\nIts the price of the gamble, chalk it off as a learning curve ", "score": 6, "replies": []}, {"body": "Look at it this way you tried to make some serious cash and it didn’t work out. Now don’t option trade no mo", "score": 5, "replies": []}, {"body": "I'm down to 2k from 20 deposit.  Hurts man, MU screwed me bigly :( ", "score": 4, "replies": []}, {"body": "If it’s any consolation, you’ll get a pretty nice tax break next April", "score": 4, "replies": [{"body": "\\*next 4 Aprils", "score": 1, "replies": []}]}, {"body": "Good luck brotha! Just build that shit back up and when you get on your next rocket make sure to land safely! Real talk, I’ve been through some dark fuking times  but keep chugging and climb out. You’ll be fine! Just don’t fomo or yolo on shit, even FDs you can play smart. ", "score": 4, "replies": []}, {"body": "I held aph calls for 3+ months worth my entire portfolio. The day before it runs 22% and 100% the following week i sold all my aph calls, some at a loss to buy weed puts which hit an all time high. My account rn is at 5k. Wouldve been 50k+ if i didnt change my game plan last minute. 21 with 12k on cc. RIP me lol", "score": 3, "replies": []}, {"body": "I completely know how you feel dude. 2 weeks ago I lost 22K (42% of portfolio) from Amazon FDs because I got greedy from my gains the week before that. I kept trying to double down and refused to sell until it was too late :/ It hurt so fucking much that I was paralyzed in bed for 2 days from depression. Fuck. I'm trying not to think about it but it's truly depressing.", "score": 4, "replies": []}, {"body": "I'm sure this will make you feel better. \n\nhttps://www.cnbc.com/2018/09/21/china-said-to-call-off-trade-talks-as-tariff-war-escalates-wsj.html", "score": 2, "replies": []}, {"body": "Don’t worry you earned an 11k lesson.  People spend months in college to learn 11k lessons ", "score": 2, "replies": []}]}]}, {"body": "Been there done that when I was in college. \n\nGuess what? You’ll eventually be able to chalk it up as learning experience and laugh about it. \n\nYou went for it, and lost. At least you can say you tried, unlike 99% of the children in this sub that “yolo” with all $89 of their accounts. \n\nSave up, and go for it again. Take risks when you’re young. ", "score": 45, "replies": [{"body": "And you get tax deductions for a few years", "score": 22, "replies": []}, {"body": "Tuition", "score": 1, "replies": []}]}, {"body": "Screenshots? Let us sympathize with you 😓", "score": 16, "replies": [{"body": "[lol @the gold restriction, I couldn’t even use my gold because my account was deemed too risky](https://imgur.com/a/b0VLExw) ", "score": 23, "replies": [{"body": "27% on that battery.   \nSo you've got that going for you. \n", "score": 22, "replies": [{"body": "Up 23% from 80% of screenshots ", "score": 9, "replies": []}]}, {"body": "Oof", "score": 3, "replies": []}, {"body": "Gold restriction has nothing to do with the risk of your account. They are not allowed to give you margin buying power when your account is under 2k. It's just a restriction they are required to follow", "score": 0, "replies": []}, {"body": "I found out today that gold doesn't work on options.. just stocks. Lame. Upgraded for nothing ", "score": -4, "replies": [{"body": "You still get instant access which makes it way worth for me. I can liquidate and buy instead of dicking around with keeping cash in the account. Easily made me a few hundred extra this week so it pays for itself", "score": 0, "replies": [{"body": "Basic accounts have instant margin too bro. You’re just wasting your tendies for nothing. ", "score": 8, "replies": [{"body": "All I know is I had basic and I couldn’t use money from options sales until the next day and now I don’t have to wait. Shruuuuggg", "score": -1, "replies": [{"body": "Yeah I guess that means the regular basic 2k tier level is good enough. Need to downgrade I've been dicking around with 12k tier wondering wtf was going on with my buying power lol ", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "One thing I’ve learned the most is to ride the wave, take profits whenever possible.  Going against the market, or timing it, hurts, a lot. \n\nAmazon didn’t have any reversal trend recently and I’ve tried to go against the market.\nLet’s just say I’ve also got burned by it this week by almost 5k trying to catch bottom.  Long call and put spread for me. Doing my best to stay away from FDs unless there’s a hype like AMD week again.  \n\nTake profits whenever you could.  If I have 17k in cash I would totally buy a longer dated call for AMZN rn.  Good luck man, stay mentally healthy.  Talk to us retards if you need to.  \n\nI’m also a young professional so I understand how you felt.  Definitely be willing to learn, especially with options.  May tendies be in our futures forever. ", "score": 16, "replies": [{"body": "This is really solid advice. For the OP: Every underlying has a 'story' that influences the market trend. Never try to predict when the trend will change, before the story changes. Think about it this way: What are the odds that either one of us are 1) a genius vs 2) retarded?\n\nAs an example, look at the Facebook chart for the past 5 months. The 'story' of Facebook during this time has been the Cambridge Analytica scandal, declining trust, privacy violations and regulatory oversight. Shitty time to go long FB! \n\n", "score": 2, "replies": []}]}, {"body": "Don’t feel too bad. We all learn along the way. You will make it back. ", "score": 10, "replies": []}, {"body": "F", "score": 20, "replies": [{"body": "F", "score": 3, "replies": [{"body": "F", "score": 7, "replies": [{"body": "F", "score": 6, "replies": [{"body": "F", "score": 4, "replies": [{"body": "F", "score": 3, "replies": [{"body": "F", "score": 9, "replies": [{"body": "F", "score": 2, "replies": [{"body": "F", "score": 1, "replies": [{"body": "F", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Basically happened to me this summer with IQ. Started with 7k, up to 18k, and all the way down to $200. I stopped for a couple days and thought out a safer way to recover my original investment. Deposited another $7 to dive in and bring my losses back and have done it in about a month and a half and am sitting at around $14k.\n\nI’ve been buying January/March calls on V, MA, MSFT and little TNDM and usually will start selling off when they run 10% above the last high, and will ride a few calls out of it still decides to run. And when the correction happens, I start back up loading up over a few days.\n\nAnother way to do it would be to buy some puts that are about a month out to cover your long calls.\n\nThese stocks are pretty safe and predictable, especially when your calls done expire for 4-6 months.\n\n", "score": 11, "replies": []}, {"body": "[deleted]", "score": 29, "replies": [{"body": "Just read it after your comment and oh fuck, my sides. Check it out people.", "score": 11, "replies": [{"body": "If you sort by most recent it reads like a depressed guy that makes a bunch of money really fast.", "score": 10, "replies": []}]}]}, {"body": "It’s all good dude. When I first started options I went up 10k on iq options. On the way down I made some through puts... then iq tanked. Went to play some more stocks options and proceeded to lose all the 10-20k gains and was effectively at a loss due to trader fees.\n\nNow I’m literally 95% stock and 5% calls and back up 10-20k. I feel much more sane and comfier with stock. Options while fun are just a crap show as you have Time direction and iv all against you. What makes me angry is that I was playing square/roku calls and puts at 45-55 and was effectively at a loss. If I had just bought stock and hold I would be up 50%+++ and I invest with 50-100k. Anyways lesson learned. No thanks to options", "score": 6, "replies": []}, {"body": "With your last bit of money you doubled down and did the same move that screwed you these past weeks....\n\nTrading options is all about momentum and market sentiment. In case you haven’t noticed sometime 2-3 weeks ago the market completely flipped on the big FANG names and Amazon. It started with the Facebook sell off and got worse throughout the tariff announcements and turned into a sell off when it was announced the Apple would be negatively affected by the tariffs. Momentum is against big tech right now. \n\nI recommend that you take a big step back and learn some of the macro big picture factors that drive stock prices. Human psychology, herd mentality, FOMO, PE ratios, basic TA etc. Also you have a gamblers mentality. In the long run you will lose thinking like a gambler.", "score": 6, "replies": [{"body": "This is legit advice.", "score": 1, "replies": []}]}, {"body": "If it helps man, I rode that train down too.  Lost a fair chunk. All I can tell you is that you'll make it back.\n\nI had multiple times to sell out but didn't bc greed.  ", "score": 4, "replies": []}, {"body": "I’ve lost thousands on Amazon MONTHLIES.\n\nAmazon is not an easy stonk to trade since it has wild swings but keeps going up it is very easy to catch falling knives and on the flip side get too greedy.\n\nWith Amazon you never know if a high RSI is a top or the start of a new base.\n\nThe way to trade Amazon is vertical spreads and shares.", "score": 5, "replies": []}, {"body": "Dude you're take away lesson from this... Jesus. Everything about this is so dumb, I don't know where to begin. Sell the call- it's going to get destroyed by theta on its way to a worthless expiration. And AMZN is not the thing to write off. Your bullshit investment strategy that involves poorly timed, unhedged, expensive FD's, is what needs to be written off.     ", "score": 3, "replies": [{"body": "You said it, man.", "score": 3, "replies": []}, {"body": "are you saying OP should have sold the call?", "score": 1, "replies": [{"body": "Yes he should have sold the call. He should never have bought more than one to begin with. Goddamn eggs and baskets. 13k in AMZN calls is fine if you time it right and have a stable source of disposable income and buy those calls at anytime other than what is clearly a local AMZN peak. But shit for a student with little more than the 13k in savings... this move was almost as stupid as going all in on TLRY at 300. Sure he can recover, and I sincerely hope he does, but if this sort of autism keeps up his future doesn't look good.   ", "score": 1, "replies": []}]}]}, {"body": "If you continue to trade options in the future, why not limit the size of any individual trade to like 10% of your total account? That way you won't go broke if one position moves against you.\n", "score": 4, "replies": [{"body": "Actually that was one of the rules I broke which fucked me. I had been playing Amazon with around 20% of my account to limit my risk, and I was doubling that money for 3 days in a row. Went all in on the day it went red and I paid the price for my greed.", "score": 2, "replies": [{"body": "https://www.videoblocks.com/video/man-sticking-his-hand-into-the-mouth-of-a-crocodile-and-takes-the-money-b7ucfskseixhp76vk", "score": 2, "replies": []}]}]}, {"body": "I have puts for Monday.  Maybe you'll get lucky and God inverses me.  Weak ass close, but we'll see what Monday trumpday brings.", "score": 5, "replies": [{"body": "I have a 10/19 $1960 C. No way this thing stays at or below $1900 for much longer. I hope. ", "score": 4, "replies": []}, {"body": "I have 1930 FDs that i bought right before market close today. Am I fucked. ", "score": 1, "replies": []}]}, {"body": "this is a great teachable moment for you.", "score": 2, "replies": []}, {"body": "Oh sorry man", "score": 2, "replies": []}, {"body": "I think the lesson is never get greedy, and always stick to your original plan of selling when you made a profit. Also understand that your YOLO mentality is the reason why you lost money, not Amazon/Bezo's problem.", "score": 2, "replies": []}, {"body": "I think yolos (100% all in) shouldn't be held longer than a day or two.. Gl..", "score": 2, "replies": []}, {"body": "Guess what? Still a lot cheaper than a Degree in Finance and you likely know more your way ", "score": 3, "replies": [{"body": "Oh my fucking god, you people are legitimately retarded. It's not even a meme anymore.\n\nYes you fucking goofball, this guy knows more about finance than people who graduated from business schools because he lost money gambling on fucking Robinhood.\n\nPEAK AUTISM.", "score": 12, "replies": [{"body": "Paper trading or trying with a couple hundred bucks would have worked exactly the same. I wish OP luck in learning more quickly and getting back to where they were financially before making this mistake.", "score": 1, "replies": []}]}]}, {"body": "S&P communication sector on Monday ", "score": 1, "replies": [{"body": "What does that mean?", "score": 1, "replies": [{"body": "Nobody tell him", "score": 1, "replies": []}]}]}, {"body": "Didn't you miss out on tax loss harvesting that trade as well, because you rebought the same security within 30 days?", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Well... for one he bought options and not shares", "score": 1, "replies": []}]}, {"body": "I don't understand how when people buy multiple contracts and their trade goes against them, they don't average down and exit. You can still leave some of them in the trade while not losing your ass entirely. Fucking autists.", "score": 0, "replies": []}, {"body": "Just learn from it. I started trading about a year ago and I lost 15k on a SPY daily call (I was day trading and RH didn’t let me close in last minutes of the day and market tanked the next day). Lost about 15-20k in HMMY swing trading and another 10k on MU earnings 2 quarters ago. It’s easy to get discouraged when you just start but it’s definitely a learning experience and will benefit in the long run on how to better manage risk. ", "score": 0, "replies": []}, {"body": "God I love idiots losing it all on FDs.\n\nHow the fuck do you lose on amazon", "score": 0, "replies": []}, {"body": "what?!?! a massively over valued retail operation didn't work out? no waiiiii\n\noh wait are we still pretending they're a \"tech\" company? ", "score": -1, "replies": []}, {"body": "You should never invest what you cannot afford to lose completely. ", "score": -3, "replies": [{"body": "The thing is that I can afford to lose this money. At the end of the day I’m still young and am doing well in my school and professional lives. I (hopefully) have a successful career ahead of me where I will earn much more than what I lost. The money I lost was savings from hard work in highschool, but I still have money in my bank account and don’t use my savings for anything (just trying to grow them for the future). At the end of the day it’s one really expensive lesson, but god damn am I sad that my savings are pretty much gone.", "score": 3, "replies": [{"body": "Yeah that sounds pretty rough. Maybe you should stick with shares for your large bets instead of options. That way you can still hold it even if it dips. ", "score": 2, "replies": [{"body": "Yup, I got burned early last year and have been good about staying diverse/low risk. But I started browsing this sub again a month ago and it’s been a wild ride since then. Just got bored of seeing how much people were making when I was moving slowly, but at the end of the day I’ve finally realized I’d rather be growing slowly than have nothing at all :p", "score": 4, "replies": [{"body": "That's definitely the lesson here. I almost lost a sizeable chunk of my portfolio to FOMO as well. Instead of comparing yourself to others, try to compare to your past self. ", "score": 2, "replies": []}]}, {"body": "So smart. After options losses this week I bought shares whenever I saw a good play. Only have 4 options left. NKE 9/28 84.5 call. RAD 1.5 puts 9/28. SNAP 11/16 7$ put and QCOM 4/19 95 call. Holding Cron, mnkd, Acbff, NEPT, AMRN shares. ", "score": 2, "replies": [{"body": "For real. Especially since high IV options are stupid expensive. ", "score": 1, "replies": [{"body": "Yeah. Far out from earnings is good. I’ve been holding NKE, RAD, and  SNAP for a few weeks for earnings bought a few weeks ago on each before IV went nuts", "score": 1, "replies": [{"body": "Are you long snap? If so why? ", "score": 1, "replies": [{"body": "Long puts at earnings. They have no revenue stream. User base is leaving. Now they are just a data company ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "You get that out of fortune cookie? Beat it, Confucius. This guy is drowning and you're describing the water. ", "score": 1, "replies": [{"body": "Confucius say, bird in the hand is not better than two in the bush.\n*****\n^(\"Just a bot trying to brighten up someone's day with a laugh. | Message me if you have one you want to add.\")\n", "score": 0, "replies": [{"body": "fuck off", "score": 2, "replies": []}, {"body": "Confucius say, \"Man with hand in pants always feel little cocky\"", "score": 1, "replies": []}]}, {"body": "It's useful advice for when he invests next time. No amount of discussion will change the fact he already lost money. ", "score": 0, "replies": []}]}]}]}
