{"title": "AMD comeback? Time for a long term look.", "selftext": "Looks like Google announced a partnership with AMD for their deep learning gizmos. What do you all think? Is this the AMD comeback? How could this fair in the long term?", "id": "5da2cd", "created_utc": 1479313361.0, "score": 21, "upvote_ratio": 0.8, "num_comments": 28, "comments": [{"body": "AMD has given itself a unique position in the market. I think it’s time we stop comparing AMD to NVDA or INTC. This company has momentum.", "score": 5, "replies": []}, {"body": "And I sold yesterday...", "score": 2, "replies": [{"body": "I'm with you man... sold nearly 500 shares of NVDA on Monday :/\n\nIt was the right decision for me based off of my risk tolerance and the available information so I'm not upset about it... but damn...", "score": 2, "replies": [{"body": "No way? I almost sold too but I got tied up with work, was probably the greatest thing to happen at my job since I started. I hope the opportunity cost wasn't huge for you", "score": 1, "replies": [{"body": "Well, my position would be worth about $11,000 more today than it was when I sold (47k vs 36k)...\n\nI'm just looking to buy a house in the next few months, so I liquidated ~200k in my more risky positions before the election to set aside toward the down payment. \n\nNVDA had a $72 resistance for quite some time and if it wasn't for them unexpectedly crushing earnings, it could have much easier gone the other way like other tech stocks did. \n\nLike I said.. right decision based on the information and risk tolerance I had, but hindsight :)", "score": 2, "replies": [{"body": "Ya very true congrats on the house by the way, always a good time those down payments", "score": 2, "replies": []}]}]}]}, {"body": "Sold today and took my profits.. i think it goes back under 7  by end of the month and ill get back in", "score": 1, "replies": []}]}, {"body": "Where's a source for this?", "score": 2, "replies": [{"body": "https://finance.yahoo.com/news/amd-radeon-technology-available-google-200000546.html\n", "score": 3, "replies": []}]}, {"body": " I sold 1/2 at 7.65. I expect a very small buyback window tomorrow either PM or before 10:00. ", "score": 2, "replies": []}, {"body": "@ 12pm central on a 2 hour chart it looks like a doji candlestick is forming at a previous high from 10-28, stochastic RSI is also overbought so it looks like it has hit resistance and will reverse. A 4 hour chart also looks like it is finishing the C-D leg of a bearish bat cypher pattern which would also support a reversal. A daily chart shows wave 5 of an Elliot wave completing on 8-19 with the correction following, and it may be continuing up but that is not yet confirmed as the movement it still more sideways In my opinion and it may start to move down for that matter. The charts are inconclusive at this point but that's my two cents for the immediate condition.\n\nIf you were in before today I would take your profits and re-buy after it falls as long as it still looks favorable, and if you are not already in I would not buy until after it falls.", "score": 5, "replies": [{"body": "....and this nonsense was wrong.", "score": 7, "replies": [{"body": "you didn't even wait a day yet... ", "score": 1, "replies": []}]}, {"body": "/u/13_Regardless As a follow up, this has now established that it is most likely going to resume its uptrend after its consolidation period after 8/19. It has smashed through 3 previous points of resistance, but currently it is just too overbought to enter right now. Hourly is way overbought, daily still has a bit of room, not to mention this was a news triggered event. This leg of the upswing is most likely nearing its end. I would look for a 50% retracement as your entry point. ", "score": 1, "replies": [{"body": "Completely understand a lot of sites I had checked up on are looking at it dipping as well, which is what I'm banking for to buy in at a lower price", "score": 1, "replies": [{"body": "Could have entered yesterday and sold today to lock in a good chunk of money, but it really was not well established that it was entering another uptrend at that time. Hindsight is 20/20 as they say. You can be happy you didn't enter and lose though.", "score": 2, "replies": []}]}]}]}, {"body": "AMD from 2 to 7.5 this year.  I would say it's already come back.  I mean, it might still go higher, but it's a little late to predict a \"comeback\" I think.", "score": 1, "replies": [{"body": "That's a fair statement, what would your thoughts be regarding a long term investment with them?\n\n", "score": 1, "replies": [{"body": "I'm not sure, I haven't researched it enough to comment, sorry.", "score": 1, "replies": []}]}]}, {"body": "Wondering the same thing regards to long term...I'm not even sure I should exit and wait for dips before 8 anymore...might be worth just to leave it in :/.\n\nAnyone think this'll break 8 before earnings in January and go to double digits next year?", "score": 1, "replies": [{"body": "Thats my thought too\n\nI'm all for making a profit but if its supposed to dip then gain traction i'll just hold it ", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "agreed, just wasn't sure how much. If it dips to 7.55-6 probably isn't even worth leaving and rebuying IF it goes above $10 in 2017 like I anticipate (hopefully lol).\n\nI'll definitely be rebuying in...i've made my money from $SINO and I'm too scared to go back into those shipping stocks and ready for some value investing XD", "score": 2, "replies": []}, {"body": "which will be a sweet time to go back in!!", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": []}]}]}, {"body": "Yeah might dip to $7.50 or so but I'm holding for the long term. Would love to seem solid double digits out out it next quarter. ", "score": 1, "replies": []}]}, {"body": "It's great that AMD moves up again. Now I know that it's worth to keep it long.", "score": 1, "replies": []}, {"body": "To the moon? ", "score": 1, "replies": [{"body": "I wouldn't call it a moon shot yet but its looking really good!\n\nEdit: They still think it might dip a smidgen ", "score": 1, "replies": []}]}, {"body": "Judging by how much its climbed today... im enjoying the ride", "score": 1, "replies": []}]}
{"title": "Favorite undervalued tech stocks?", "selftext": "[deleted]", "id": "5daqza", "created_utc": 1479320317.0, "score": 8, "upvote_ratio": 0.69, "num_comments": 24, "comments": [{"body": "NVDA BRO. ALL IN WEED. AMD TO THE MOON... Not intending to be rude but I feel this is all people talk about in this subreddit. I personally like Facebook's potential for future growth.", "score": 10, "replies": [{"body": "If you're just a stocks person, you probably don't really understand NVDA and why it's an incredible option. You probably think they're a company that makes graphics cards for gamer nerds.\n\nIf you're in machine learning/data science & AI, you know precisely how good NVDA is and you're free to disagree but I recommend saving my comment and checking back in 6 months. They have nowhere to go but up until they're more distributed among holders and you normies catch on when it's too late.\n\nThat's the problem with being *just* a stocks person. NVDA is a feedback loop of opportunity. I'm using their graphics cards to predict their stock with accelerated algorithms using 1,200 dollar hardware that is better than everything else out there. It doesn't get more obvious than that. By the time their hardware is in all of our self-driving cars, it'll be too late to get in on the returns.\n\nTheir ticker looks like Microsoft in 2001 when you zoom out. Think about what exactly that means in this context. ", "score": 3, "replies": [{"body": "What do you use for neural network stock analysis? I got a 980 that I've run NNs on with great success.", "score": 2, "replies": [{"body": "Titan X Pascal. Upgraded from 1080 because of a need for extra VRAM.", "score": 2, "replies": [{"body": "No, I meant software. *totally not jealous of setup*", "score": 1, "replies": [{"body": "Oh! Python, bokeh, pycuda.", "score": 3, "replies": [{"body": "Thanks. I'll look into them.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "It is true though. Both NVDA and AMD up 5% and 9% today. He could've made 2-4k just today heh.  ", "score": -2, "replies": []}]}, {"body": "VZ", "score": 3, "replies": []}, {"body": "aapl is undervalued. if anything, im buying more, not selling it", "score": 3, "replies": [{"body": "Why?", "score": 1, "replies": [{"body": "I hear they are selling books now...", "score": 14, "replies": []}]}, {"body": "Agreed.  Earning $9/share this year. Price should be around $125 - $130 soon.    ", "score": 1, "replies": []}]}, {"body": "KR", "score": 2, "replies": []}, {"body": "The tech sector is overvalued as a whole right now. ", "score": 2, "replies": [{"body": "Totally agree considering snapchat is about to have a 25B valuation. ", "score": 4, "replies": []}]}, {"body": "If you can manage to hold until Q4, NXTD. They create that credit card that fits all the other credit cards and ID cards in one card. Has a little touchscreen on that card as well where you can even put in a picture of yourself (FLYE card). It's still in beta stages, but it has already mass produced the model they're going to sell world wide. ", "score": 1, "replies": [{"body": "Interesting", "score": 1, "replies": []}, {"body": "Remindme! 1 week", "score": 1, "replies": [{"body": "I will be messaging you on [**2016-11-24 23:28:08 UTC**](http://www.wolframalpha.com/input/?i=2016-11-24 23:28:08 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/stocks/comments/5daqza/favorite_undervalued_tech_stocks/da4x0x0)\n\n[**CLICK THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/stocks/comments/5daqza/favorite_undervalued_tech_stocks/da4x0x0]%0A%0ARemindMe!  1 week) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! da4x24g)\n\n_____\n\n|[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/)\n|-|-|-|-|-|-|", "score": 1, "replies": []}]}]}, {"body": "I'm up about 10% on QUAD since they announced earnings", "score": 1, "replies": [{"body": "I'm trying to understand this company, they do print? Globally for marketing?  Why is this a buy or is it revolutionary in some way I'm not getting?", "score": 1, "replies": [{"body": "They're starting to do large scale 3d printing, I mainly bought because they just turned profitable last quarter, and have held since. They do both of the things you stated as well. ", "score": 1, "replies": []}]}]}, {"body": "MBLY", "score": 0, "replies": []}]}
{"title": "Is anybody bearish anymore?", "selftext": "[deleted]", "id": "5d6bru", "created_utc": 1479257891.0, "score": 20, "upvote_ratio": 0.86, "num_comments": 22, "comments": [{"body": "And the moment you capitulate on your bearishness and put your money in bullish positions is when the market takes a huge dump. \n\nStay the course, brother. Eventually this shit is all going to come crashing down, hard. ", "score": 24, "replies": [{"body": "Seriously. Ask people playing the bond market which way is up.", "score": 16, "replies": [{"body": "Right.", "score": 3, "replies": []}, {"body": "Up/down is a trick question for those assholes, they take pride in doing all their shit backwards", "score": 1, "replies": []}]}, {"body": "Coming from the guy going long on amzn. Don't lie, you just wanna watch him lose money", "score": 7, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Thanks Captain Obvious. Go frick yourself.", "score": 0, "replies": []}]}]}, {"body": "Italexit? Is that really going to happen? Doesn't seem like it", "score": 7, "replies": [{"body": "No, it's not going to happen. Op is retarded.", "score": 1, "replies": []}, {"body": "If Italy exits the EU I'm super bullish I mean they couldn't even take Ethiopia and needed a bailout in WWII", "score": 1, "replies": []}]}, {"body": "No market will still likely take a shit if they actually do the rate hike, and when Obummer transitions out. Jan will prob be a pretty choppy month", "score": 6, "replies": [{"body": "But when?!?!?!?!?!", "score": 0, "replies": [{"body": "he said Jan. ", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 6, "replies": []}, {"body": "I believe an S&P 500 ATH re-test is in the cards. That'll be my signal to grab some 6-12 month out put spreads and shut the hell up\n", "score": 2, "replies": []}, {"body": "We test spy ATH, rate hike kicks in, we drop, we recover, trump becomes pres, manipulation happens, we go sub 200 spy in a week. Everyone panics, we go sub 180 in 2 weeks. Then sit. Then sit. Then scyx goes to $7.30 and I go on vacation. I get really drunk after that so things are hazy but I wake up to a $210 spy some time in March.", "score": 5, "replies": []}, {"body": "looking for 12.60 entry on TVIX", "score": 2, "replies": [{"body": "TA on Vix. LOL", "score": 3, "replies": []}]}, {"body": "December rate hike is likely. I'll probably short volatility once the dust settles. If VIX drops below 12 before the hike I'll make a VXX play.", "score": 2, "replies": [{"body": "I think volatility is going to be higher than in the past few years until we have some direction regarding taxes and trade. The futures markets tanked on election night for a reason. ", "score": 3, "replies": []}]}, {"body": "Italexit? You pulled that one out of your ass huh? The upcoming referendum has nothing to do with staying or leaving EU. There's absolutely no talks about \"leaving the EU\" in Italy (besides these tiny extremist political groups).", "score": 2, "replies": []}, {"body": "I'm retarded but I'm bearish now after being a bull for the past 6 years. Consumer debt is high, housing prices in metro areas are out of control, how the fed will unwind from the low rate monetary policy is uncertain, market interest rates are rising, is there a bond market bubble?, how we'll handle global trade is dependent on so called \"conservatives\" in Congress, the stability of the EU is uncertain, student loan debt is still high, GS has hinted at stagflation, and CDS prices (although low) are starting to [rise](https://www.google.com/url?sa=t&source=web&rct=j&url=http://blogs.wsj.com/moneybeat/2016/11/11/the-cost-to-protect-against-a-u-s-default-is-rising-but-still-low/&ved=0ahUKEwixjtWRlqzQAhXCOiYKHWfXBW8QqQIIKSgBMAM&usg=AFQjCNHyZQY2lyoW1tLW4rTR3UhT4jEsXg&sig2=pyR9qqhJD5ARkCAwQHQU0A). I wouldn't be shocked to see SPY lower two years from now or basically stale. I'm not dumb enough to speculate what the catalyst will be but I'm not bullish anymore. I'm thinking leap puts as my 2-3 year term trade while I'm heavy small cap and energy in my long term retirement account.\n\nIf you're YOLOing shit then this is awesome because of volatility", "score": 1, "replies": []}, {"body": "go read zerohedge a while ok? you'll feel better", "score": 1, "replies": [{"body": "I masturbate to ZeroHedge.", "score": 1, "replies": []}]}]}
{"title": "Thoughts on OCUL? DD inside", "selftext": "Ocular Therapeutix develops a sustained release platform for the delivery of eye medication. They are also currently seeking FDA approval for their anti-itch/anti-inflammatory medication to be used in conjunction with the platform for post-surgical patient eye care.\n\nPatient compliance is horrendously bad for eye drops (for a number of reasons) and this would eliminate that problem completely. The space is conservatively estimated to be worth 2-3x OCUL's current market cap (150m). Many have it much higher than this.\n\nAdditionally, Regeneron, a pharmaceutical giant in the ophthalmology space, recently entered into a deal with Ocular Therapeutix for the use of their platform. Upon reaching certain milestones with the clinical testing of Regeneron's drug, Ocular Therapeutix may receive two payments of 150m (one for each milestone). This, in addition to the 10m up front payment, would total 310m in cash for Ocular Therapeutix as well as royalties on Regeneron's drug once it makes it to market.\n\nThe recent political climate has caused a shift in the economic sectors, with biotech being the largest benefactor. The Trump administration plans on reducing the stringency of the requirements to gain FDA approval, something this drug had already nearly achieved. There were manufacturing issues which were addressed and it is up for reapplication late this year.\n\nSorry if it's not meme'd up enough, copy-pasted from when I wrote it for a friend. I'd like to hear why this shit will crash and burn instead of 10x", "id": "5da6cf", "created_utc": 1479314513.0, "score": 12, "upvote_ratio": 0.93, "num_comments": 30, "comments": [{"body": "No need for memes if we can make a solid bet. I'll be looking into this one.", "score": 7, "replies": [{"body": "Hit me up if you have any questions/ideas about it. Always down to share/discuss", "score": 2, "replies": []}]}, {"body": "i got in when it was in the mid 6s. Still bag holding and hoping it reaches 10.", "score": 4, "replies": [{"body": "Yeah, that's about my price point as well. Was originally looking at it as a short term thing but now that Trump won it's seeming more appealing long term", "score": 3, "replies": [{"body": "correct. It dipped like a mofo when Hillary was leading but after Trump won, the stock has been on a straight upward path. \n\nTarget price is still 30... so not sure if selling out at 10 is a good idea. lol", "score": 1, "replies": [{"body": "The way I'm looking at it is if it continues growing around 5-10% per day and I still think it's undervalued I'll hold. If there's a random, enormous spike without news I'm getting the hell out lol. Today is looking like a spike but not exactly sure", "score": 1, "replies": [{"body": "Looks like the $10 is possible this afternoon or tomorrow if continues. ", "score": 1, "replies": [{"body": "Annd it pulled back. Still buying more though.. Don't know why. Because I like them $.50 gains or maybe because I'll hold past $10 and see where it goes in the 3-6 month bagholding term I'll see when it gets to $10. ", "score": 2, "replies": [{"body": "I think if you're comfortable letting it sit for a while it's a really safe bet\n\nedit: as for the pullback, take a look at IBB and XBI. OCUL usually trends with these so today was a really big win considering how much those are down. If those are  up tomorrow morning there could be another breakout day for OCUL", "score": 1, "replies": []}]}]}, {"body": "How are you feeling about OCUL now?", "score": 1, "replies": [{"body": "I wouldn't buy in at this point unless you wanted to hold it for 2-6 months minimum.\n\nIt's feeling the pain from the rest of the sector and general market volatility, but is still a solid long term play. Not sure if anyone will care about resubmission to the FDA in this environment for an EOY jump.", "score": 1, "replies": [{"body": "im in at $11.30 hence me asking. :)", "score": 1, "replies": [{"body": "Oh baby, sorry to hear it haha. You going to need the money anytime soon?", "score": 1, "replies": [{"body": "nah. Just thought it might hit $13.00 soon after i bought it. :/ Im holding for now though. Mostly because im down $1000", "score": 1, "replies": [{"body": "Yeah just hold strong and look elsewhere. It's a virtual guarantee that it'll be well above where you bought it in a few months.\n\nI remember when the Regeneron deal was announced and people bought in at $7.80 or so they were really regretting it because it fell to $6.30 within a few days. Just the nature of this stock lol", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "How do you feel about OCUL now?", "score": 1, "replies": [{"body": "still ok. I just bought some more @8.70", "score": 1, "replies": []}]}]}]}]}, {"body": "Just to expand on what Ocul is trying to manufacture and sell. It's a hydrogel, drug eluding plug that is inserted into the tear duct and releases the drug over a specific period of time. After which, it is absorbed into the body. It's an out patient procedure to get it implanted, and is meant to be a one and done thing. \n\nThey have 3 candidates right now. Dextenza for ocular pain and inflammation, dry eyes and allergic conjunctivitis. Ocular pain is what will be resubmitted, ocular inflammation will be a supplementary application after pain is (assumingly) approved.\n\nAllergic conjunctivitis is on hold pending another retention trial. First phase 3 for AC was positive, but the second was not. They looked at the data and saw a statistical significant difference over the whole trial, but not at the points they measured. \n\nNot sure what dry eyes is doing, they haven't updated recently, but it was phase 2 last I heard.\n\nThe second is for glaucoma. It has statistically significant reduction in ocular pressure during the phase 2 trial, versus a placebo plug. One phase 3 is underway now, and another will start soon. results expect Q1 '18.\n\nThe Regeneron deal is for delivering Eylea through the plug. Eyelea is already FDA approved for treatment, now the question is can it be delivered through the plug. This is pre-clinical, and a while off, but still lucrative. Regeneron will fund all development past pre-clinical, along with milestone payments and royalty payments if commercialized.\n\nThe balance sheet it my only concern. If they get a 2 month review time on the re-submission, you're looking at February being approval. They have cash to run through Q4 '17, but as far as I know, they have only brought on a chief commercial officer, and have not built a sales force at all. I'm a little concerned at how quickly they can built one and get sales going, even enough sales to just push the cash burn out enough. All of this is exacerbated with a June approval.\n\nI'm in for  2000 shares at 6.63 in my retirement, and 1600 shares at 6.70, but my unlucky ass sold 16 November 7.50 covered calls on Thursday last week. Gotta figure out how to unwind that without losing a ton of possible gains.\n\nAll in all, I think this still has a lot of room to run. ", "score": 4, "replies": [{"body": "Great point about the lack of sales--never considered if their estimates for having enough cash through Q4 '17 include the cost of starting up a sales division.\n\nI'm thinking if approval goes through the company won't be allowed to fail, though. Worst case they take a disadvantageous agreement with a company that already has an established sales force within the space (Regeneron, most likely). If this were StockTwits the lack of sales force would just imply that they're already getting bought out haha.\n\nSorry to hear about those calls...", "score": 1, "replies": []}]}, {"body": "Also, I should mention, the short coverage of float is around 25% and institutional ownership is sitting around 70% (after a few reduced positions around the election). Fuel for the moonshot?", "score": 2, "replies": []}, {"body": "This is crazy after looking into it almost P&D gains with no dump (DD). ", "score": 2, "replies": []}, {"body": "Last time it came up most people wrote it off as a shit stock iirc", "score": 1, "replies": [{"body": "I remember seeing a thread like that haha, the dude was guaranteeing 200% returns or something. Short of a buyout (which I don't think will happen for a long time) this just seems like a steady grower until FDA approval.", "score": 2, "replies": []}]}, {"body": "This is run-of-the-mill speculation not YOLO.  \nWhat's their balance sheet look like? Make sure they're not at risk of imploding.  ", "score": 1, "replies": [{"body": "They beat pretty handily the morning after Trump won (I forget the specifics) and have around 73m cash on hand. Supposedly enough to take them into the end of next year if you take the CEO at his word", "score": 1, "replies": [{"body": "> if you take the CEO at his word\n\nI might trust hookers more.", "score": 1, "replies": []}]}]}, {"body": "What does DD stand for. I know it's like an analysis but what's the actual acronym? \n\nLol sorry for derailing your question. ", "score": 1, "replies": [{"body": "Np, stands for due diligence", "score": 2, "replies": []}]}, {"body": "Good call on this - wish I had gotten in but it's probably too late now.", "score": 1, "replies": [{"body": "Yeah, the risk/reward definitely isn't as appetizing anymore. That being said, I still expect $13 or $14 per share after they announce resubmission.\n\nSeems like a safe bet to me in an objective sense, but in the off chance you hop in after a 100% increase in share price then it gets fucked somehow you won't feel too good lol", "score": 1, "replies": []}]}]}
