{"title": "FIT or AMD?", "selftext": "AMD announced their deal with Alphabet and could be on an upswing. FIT seems to be bottoming out and could be trending up as well. Both are under $10.00 at the moment. Looking to pick one. What are your thoughts?", "id": "5ffd4a", "created_utc": 1480378597.0, "score": 4, "upvote_ratio": 0.83, "num_comments": 20, "comments": [{"body": "AMD no contest.", "score": 17, "replies": [{"body": "AMD no contest is right", "score": 2, "replies": []}]}, {"body": "AMD will be releasing Zen in Q1 2017, most people who own it are waiting on that.  If the benchmarks are good it should shoot up, as Intel has juicy profit margins.\n\nThey will also very likely return to profitability next earnings release, so whatever that does to the stock.", "score": 7, "replies": []}, {"body": "What would you say is a good amount to invest in AMD right now?\n\n", "score": 3, "replies": [{"body": "Don't buy now. Buy in a few days time as the MACD indicator suggests that $AMD is due for a pullback soon. A good price to enter would be $7.50. ", "score": 7, "replies": [{"body": "The pullback already happened. The stock has been consolidating since last week. The only pullback is if Zen doesnt do well, which I doubt. ", "score": 8, "replies": [{"body": "Why do u doubt that?", "score": 1, "replies": [{"body": "Amd is a good company with good products.", "score": 6, "replies": [{"body": "AMD is a poorly run company consistently losing money.  They have 'value' products.  If you want the best performance, you go with Intel/nVidia.  If you don't have the money for the best performance, you now have a choice between mid-tier Intel/nVidia or top tier AMD.\n\nZen is *insanely* overhyped right now (as has every single new AMD release for the past decade+).  Trust me, I WANT them to release something that is competitive, but unless they can release something that is faster than Kaby Lake for less money, it won't be enough.\n\nThey just recently failed to do the same with nVidia with their last round of graphics cards.  They were a good value for the money, sure, but that doesn't lead to a high margin or success for AMD.  If you want to have the bare minimum specs for VR, I suppose an AMD card will do you just fine.  If you want to be faster than the bare minimum or do 4k at all, you're looking at nVidia.\n\nThe stock is built on hype right now and they haven't been able to actually deliver on that hype in over a decade.", "score": 7, "replies": [{"body": "Exactly this!!!\nAMD has a track record of overhyping their products.\nBulldozer architecture was also supposed to beat Intel couple years ago.\n\nI do agree AMD is a good company with good (value) products.\nBut their stock is overvalued and Nvidia's products are better (and also more expensive because AMD has no answer.)\nAMD's cpu and gpu line up is behind on the competition.\nThey run less efficient, they run hotter than their counterparts.\nI would buy an RX480 over a GTX1060 though.\nThis is because I find the RX480 to have better value, but this is cause of AMD's low margins. Causing them to make significantly less money.\n\nCorrect, every PC enthusiast (like myself) would love for AMD to succeed. This would only drive gpu and cpu prices down for the consumer. \n\n\n ", "score": 3, "replies": [{"body": "I think everyone is forgetting that the gpu market that investors are concerned with, has shit all to do with gamers. GPU's are used for a lot more than gaming, ask CAD engineers about their workstations. \n\nCommercial is where the money is at", "score": 1, "replies": [{"body": "Except automotive and data is growing at a faster pace.", "score": 2, "replies": [{"body": "You're right, ever look into who came in second place for tesla's self driving vehicles? Competitors are going to snatch that company up", "score": 1, "replies": []}]}]}]}, {"body": "^ this guy right here doesn't know his shit. Zen is solid, sure it's speculation right now, but everything we have seen shows a great product.\n\nAs for the GPU front,  I don't know why you say they failed (aganst nvidia) when they have released a significantly better product, so much so that it made nvidia quickly drop their prices, and on a recent survey of steam (the largest gaming platform) amd made E N O R M O U S gains over nvidia.\n\nLastly, sure amd's products have not been as top notch as intel, but this is a company with *5% the mkt cap*, WHAT DO YOU WANT FROM THEM??!?  the fact that they are competing at all with a company that has a R&D budget 100 times bigger is extremely impressive.", "score": 2, "replies": []}]}]}]}]}, {"body": "Great, thanks for the heads up.  $7.50 would be a good buy for me.  As, I missed $6.8x.  ", "score": 4, "replies": [{"body": "Buy half now, if market goes down, buy the other half at that price point, if it goes up, at least you made some money. ", "score": 1, "replies": []}]}]}, {"body": "half of what you were planning on spending right meow.", "score": 1, "replies": []}]}, {"body": "FIT this will go to low 6's before it bounces", "score": 1, "replies": [{"body": "Why would it bounce?", "score": 2, "replies": [{"body": "Holidays I would assume", "score": 1, "replies": []}]}]}]}
