{"title": "YOLO’d AMD and Roku - Thank you WSB!", "selftext": "", "id": "bwfv35", "created_utc": 1559595146.0, "score": 271, "upvote_ratio": 0.98, "num_comments": 88, "comments": [{"body": "You got 60k to play around with you can get your car fixed lol", "score": 91, "replies": [{"body": "I had a roommate who played poker all the time and one day was telling me about how broke he was.\n\nThere was a shoebox full of bills that I spotted under his bed which I pointed out.\n\n\"No, man that's gambling money. I need that money to make money.\"", "score": 81, "replies": [{"body": "That's the right mentality to have to keep yourself from gambling yourself upside-down but if he's not making enough to pay his bills he should def  YOLO that money", "score": 35, "replies": [{"body": "\"if you're gambling cautiously but not winning enough money you should gamble recklessly to increase your odds of making a lot of money\"", "score": 29, "replies": []}, {"body": "Solid advice, whats the next play bro", "score": 6, "replies": [{"body": "Possibly go tits up?", "score": 4, "replies": [{"body": "Impossible. Literally can’t go tits up, can you read retard?", "score": 6, "replies": [{"body": "When it goes tits up, it's time to get the shinebox", "score": 2, "replies": [{"body": "Hey tommy if I was gunna bust ya balls I woulda told ya to go home and get your fuckin shine box", "score": 2, "replies": []}]}]}, {"body": "where's this tits up box spread memery from", "score": 0, "replies": [{"body": "From our lord and saviour IR0NYMAN (praise be to his name)", "score": 0, "replies": []}]}]}]}, {"body": "That's the opposite of the right mentality. You have money set aside that you don't gamble.", "score": 1, "replies": []}]}, {"body": "i was the same except i would end up losing all the money in the shoebox...", "score": 2, "replies": []}]}, {"body": "its so hard to use money from rh for anything other than equities, but now i can sleep a little better", "score": 10, "replies": []}]}, {"body": "Just curious. How big are your balls? Your car breaks down so you YOLO $10k and basically a 50/50 of losing it (at best odds)\n\nEdit: in a downtrend market too", "score": 49, "replies": [{"body": "actually theyre tiny, may need a microscrope\n\n&#x200B;\n\ntrue story - had an ex, she left me cuz i was too small", "score": 44, "replies": [{"body": "[deleted]", "score": 34, "replies": [{"body": "thank  you sir", "score": 12, "replies": [{"body": "Also, get better in bed so you can use that “motion of the ocean” line", "score": 3, "replies": []}]}]}, {"body": "Why did you make this move? What’d you see in the companies / market that made you confident yolo? Or was it more fuck it imma just yolo", "score": 8, "replies": [{"body": "Honestly, combination of the car situation and all the amazing gains i see on wsb i thought i could make a quick buck to pay for the repair", "score": 15, "replies": [{"body": "Amazing.", "score": 11, "replies": []}]}, {"body": "Not speaking for OP, but high beta/volume stocks like AMD tend to be erratic, but due to the consistency and liquidity of their trading you can time buys/sells fairly easily with technical indicators and experience with the stock.", "score": 1, "replies": []}]}, {"body": "That’s rough", "score": 3, "replies": []}, {"body": "Cuz your balls are small or the whole package is small? Small balls would be a weird reason for leaving.", "score": 3, "replies": [{"body": "the whole package. i would say it's on the nano scale", "score": 5, "replies": [{"body": "Your trading balls are large, sir", "score": 5, "replies": []}]}]}, {"body": "Ditch the corolla and get a penis enlargement", "score": 2, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Or you know dead on the ok table like that Israeli billionaire", "score": 2, "replies": []}]}]}, {"body": "\\>+$25k later\n\n\\>Suddenly your dick isn't so small anymore", "score": 2, "replies": []}]}, {"body": "Way worse than 50/50 lol", "score": 4, "replies": []}]}, {"body": "Recently got into options thanks to WSB. \n\n&#x200B;\n\nCar broke down this weekend so I couldn't go to work this morning. I thought I would YOLO on with my RH fund to help pay for a new car. Thank you WSB! I can now get a Corolla!!", "score": 94, "replies": [{"body": "Keep some money for taxes sir!", "score": 69, "replies": [{"body": "....gotta pay the tariff man", "score": 58, "replies": [{"body": "Oh LAWD he comin", "score": 20, "replies": [{"body": "oh no no no N-", "score": 1, "replies": []}]}]}]}, {"body": "Why just a corolla? Do some Puts on Tesla and then, get a Tesla.", "score": 32, "replies": [{"body": "Or just wait two weeks and you can pick up Tesla for half the price it’s selling at now.", "score": 19, "replies": [{"body": "If he's willing to wait a year to get it.", "score": 3, "replies": [{"body": "He could fix his POS and then wait the ‘year’ then get a sweet Tesla to pick up the honeys. That is if he doesn’t go tits up...", "score": 2, "replies": []}]}]}]}, {"body": "> Recently got into options thanks to WSB.\n\nThis is how it all begins...", "score": 6, "replies": []}, {"body": "If you fix the old car, you'll haveore yolo money", "score": 1, "replies": []}, {"body": "Holy cow! Great job! Teach me? Lol\n\nRH? WSB? Sorry I’m new to this sub.\n\nAlso what app is this?", "score": -31, "replies": [{"body": "Don't mind the downvotes friend, I believe in you. One day you, too, will lose all your money in exchange for some sweet Loss post karma.", "score": 22, "replies": [{"body": "I can pay for goods and services with my internet karma can't I?", "score": 3, "replies": [{"body": "Sure if you gallowboob it and make sponsored posts.", "score": 3, "replies": []}]}]}, {"body": "RH = RobinHood\n\nWSB = Wall Street Bets\n\nThe app is RobinHood.\n\nThis isn't a learning sub, it's a meme generation sub with occasional losers and winners, so if you really want to learn you should start someplace else then come back here once you understand what is going on.\n\nStarting at Investopedia [https://www.investopedia.com/university/beginner/](https://www.investopedia.com/university/beginner/)\n\nand going through the TastyTrade Options 101 course [https://www.youtube.com/watch?v=PIOnNoXgtCI](https://www.youtube.com/watch?v=PIOnNoXgtCI)\n\n\\*edit\\* Here's the whole \"Mike and his White Board\" playlist [https://www.youtube.com/watch?v=kmQ20J\\_3K7Q&list=PLPVve34yolHY43YaBegHMzN9WjrTnQfFr](https://www.youtube.com/watch?v=kmQ20J_3K7Q&list=PLPVve34yolHY43YaBegHMzN9WjrTnQfFr)\n\nIs likely the easiest way to get started.", "score": 19, "replies": [{"body": "what the fuck are you doing", "score": 22, "replies": [{"body": "learning to be an autist", "score": 7, "replies": []}]}, {"body": ">This isn't a learning sub\n\nThen delete the rest of your comment then you educational bastard.", "score": 4, "replies": [{"body": "I saw the down votes and saw his posting history and figured \"eh, I'll help out since they probably have no idea why they are being down voted.\"", "score": 3, "replies": [{"body": "2 pure 4 me", "score": 1, "replies": []}]}]}, {"body": "Shkreli's finance course \n\nhttps://www.youtube.com/playlist?list=PLUtqVrL9DJgS9HYMeZrvgE8nbMGfbfOwF", "score": 2, "replies": []}, {"body": "thank you for this", "score": 1, "replies": []}]}]}]}, {"body": "Now do it 5 more times and you can retire early.", "score": 18, "replies": []}, {"body": "I just bought into NVDA so you might want to short it", "score": 9, "replies": []}, {"body": "The first one is free as they say, you got really lucky, the loses come just as fast if not faster, take money out and run imo", "score": 8, "replies": [{"body": "it will go to good use - new car hopefully, but ill settle for a repair if i don't have enough", "score": 2, "replies": [{"body": "And don't forget taxes", "score": 3, "replies": []}]}]}, {"body": "Who says it doesn’t pay to follow this sub?", "score": 8, "replies": [{"body": "amen", "score": 5, "replies": []}]}, {"body": "Were those babies weeklies?", "score": 6, "replies": [{"body": "yes sir", "score": 5, "replies": [{"body": "You have some cojones sir.  Well played.", "score": 2, "replies": []}]}, {"body": "Is there really any other kind worth gambling on?", "score": 2, "replies": []}]}, {"body": "Ah another month, another chance to rope in more hopeful gamblers.\n\nThis post should do nicely.", "score": 8, "replies": []}, {"body": "yea but did you sell?", "score": 2, "replies": [{"body": "sold immediately after the screenshot, i think i ended up selling both positions for 1-2% higher than the screenshot", "score": 3, "replies": []}]}, {"body": "what the fuck what were your thoughts on taking this?", "score": 2, "replies": [{"body": "\"i could really use couple grand to fix the car\"", "score": 10, "replies": [{"body": "i meant TA wise, or mentally how did you prepare for this holy", "score": 2, "replies": []}]}]}, {"body": "I can’t tell the strike price looking at the screenshot....", "score": 1, "replies": [{"body": "Roku 90c 6/7, AMD 29p 6/7", "score": 3, "replies": [{"body": "Lmao at the amd bags you gave to some poor shit head. Great play OP. Glad you sold", "score": 1, "replies": []}]}]}, {"body": "Lol thank you", "score": 1, "replies": []}, {"body": "Looks like you had a new car going into this trade. Nice win though.", "score": 1, "replies": []}, {"body": "I wrote a long text on how stupid yolo is and never should be glorified but then realized that this is what people wants to see. Fuck my boredom i guess.", "score": 0, "replies": [{"body": "sorry to disappoint, just wanted to thank the good people of wsb for showing me the way", "score": 4, "replies": [{"body": "I am honestly happy for your gain but i wrote that because i dont want you to lose your hard earned money in a short time.", "score": 4, "replies": [{"body": "thank you. the money will be put towards a new car or at the very least, repair", "score": 2, "replies": []}, {"body": "-hard earned  \n-Gambling on the stock market  \nPick one", "score": 1, "replies": []}]}]}]}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Click here to find more YOLOs](https://new.reddit.com/r/wallstreetbets/search?sort=new&restrict_sr=on&q=flair%3AYOLO). \n\nYOLO flair is for dank trades only. If you misused the flair please change it. Mods have been notified of this thread.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}, {"body": "[deleted]", "score": -9, "replies": [{"body": "You have to be 18 to open an account.", "score": 5, "replies": [{"body": "You have to be 18 to look at porn too but that didn’t stop 13 year old me from filling my parents’ computer room trash can with used tissues", "score": 3, "replies": []}]}, {"body": "You'll need some change.  Save up 5k that you're prepared to lose.", "score": 1, "replies": []}]}, {"body": "I am new here. Would anyone be willing to explain what I am looking at? What is an option? How did he make so much money off of RUKO and AMD in one day?", "score": -6, "replies": [{"body": "check out r/options, there are some good resources to get you started on learning about options", "score": 4, "replies": []}]}]}
