{"title": "Major Forthcoming Catalyst for SPCE Imminent", "selftext": "TLDR; SPCE January or April 21 OTM Calls\n\n8 out of 9 analysts rate SPCE a buy. It was an unheard of 8 out of 8 until Goldman Sachs decided to rate it neutral, in late October and ruin the party. Odd timing right?\n\nSPCE is the second most shorted stock on the Street (after GME) and shorts are currently paying 9% interest to maintain their positions.\n\nThis is building up to what will invariably be a short squeeze of biblical proportions as SPCE will be making history in literally 10 days! This 3rd successful powered flight will likely seal the deal for their FAA COMMERCIAL SPACE LICENSE! This will also be the first human space flight in the history of New Mexico!\n\nThe 52 week high was 42 dollars! Market cap is still under 5 billion!\n\nhttps://www.businessinsider.com/virgin-galactic-first-crewed-spaceship-flight-spaceport-america-nasa-experiments-2020-11\n\nP.S. Everyone’s favorite GILF, Cathie Wood and ARK (TSLA and SQ artists) own nearly 700,000 shares. They’ve been acquiring shares at a prodigious pace! Nearly 200,000 shares since the Goldman Sachs hit piece.\n\nhttps://ark-funds.com/wp-content/fundsiteliterature/holdings/ARK_AUTONOMOUS_TECHNOLOGY_&_ROBOTICS_ETF_ARKQ_HOLDINGS.pdf\n\nPlease do your own due diligence and keep in mind that I have a significant sum invested in SPCE shares. Godspeed!", "id": "js1zx6", "created_utc": 1605071500.0, "score": 82, "upvote_ratio": 0.78, "num_comments": 71, "comments": [{"body": "Homie u just everywhere", "score": 21, "replies": []}, {"body": "Theres safer plays out there. Everyone knows about this", "score": 35, "replies": [{"body": "Care to name one?  I recently cashed out early on my cvs calls and im itching for something", "score": 7, "replies": [{"body": "Plug", "score": 1, "replies": [{"body": "Which BMW ruined your life lol?", "score": -3, "replies": [{"body": "4", "score": 1, "replies": []}]}]}, {"body": "SPCE Jan 21 or Apr 21 OTM calls. I’ve invested hundreds of hours of due diligence into my investment. Would you bet against Cathie and Chamath?", "score": -6, "replies": []}, {"body": "Lest we forget also that Sir Richard Branson will be flying in Q1 2021. That’s a virtual GUARANTEE as long as next week’s flight goes smoothly.\n\nThe excitement surrounding this momentous event will be palpable even for the most disciplined and FOMO adverse investor to resist.", "score": -4, "replies": [{"body": "Then why havent we seen it rise yet?  Im inclined to agree with you but I figure we would've seen it increase in price already.", "score": 5, "replies": [{"body": "My opinion as someone who has been holding SPCE is that many think its a meme and it only shoots up the day after big news, and then people sell and it comes right back down. It’ll be like that until they have a sustainable and profitable business going with regular flights.", "score": 5, "replies": []}, {"body": "Bulls out on parade tomorrow. Don't get trampled", "score": 2, "replies": []}, {"body": "It’s because it’s being manipulated like crazy by short sellers. But this is about to change 😏.", "score": 1, "replies": []}]}]}]}, {"body": "The market cap is UNDER 5 billion! All the heavy lifting has been done. The manipulation by the shorts has kept the price down but this is about to change. \n\nYou really can’t put a value on the intellectual property that Virgin Galactic possesses and the ownership of two spaceships. At 5 billion dollars, yes, I feel strongly that it’s undervalued.", "score": -5, "replies": [{"body": "Exactly! 5 billion is nothing right? Like bruh look at their earni- okay well why not their rev-\n\nOkay but there’s no competi-\n\n:|", "score": 23, "replies": [{"body": "Nkla which is fraud and earns 30k have a market cap larger than SPCE. \n\nAt least SPCE has a working aircraft capable of flying to 80km.", "score": -4, "replies": [{"body": "The fact you used a company the lost people so much money through fraud as a comparison to SPCE to justify its cost says all it needs to for me", "score": 2, "replies": [{"body": "Because they are IPOed via SPACs , SPCE has customers and was owned by a billionaire who worked on this for decades , if you don't like it then don't buy it, I'm in because is the only company that gives normal people a chance to go to space without costing millions and they have an actual timeline.\n\nSpaceX going to ISS costs 55 mil while SPCE cost 400k and gods knows how long blue origin would need to make a functional rocket.", "score": 0, "replies": [{"body": "Can you provide a source for that 400k figure because I looked into it and SPCE focuses on sub orbital, but has no spacecrafts for orbital", "score": 1, "replies": [{"body": "https://www.fool.com/investing/2020/11/06/you-wont-believe-how-many-tourist-space-flights-vi/\n\n400k for Sub orbital, orbital, 80km, not enough to 100km or whatever is still the only sensible option for 99.99% of the population to have a chance to try to reach space or edge of space if you count 100km.\n\nBlue origin is still in development hell and doesn't have a cost nor timeline available, spacex costs 55 mil, so SPCE is still the only company to be affordable to most people.\n\nhttps://www.discovermagazine.com/the-sciences/six-ways-to-buy-a-ticket-to-space-in-2021", "score": 0, "replies": [{"body": "Yeah I read that article already, it’s the least informative about the situation out of all the ones you could have chosen...sub orbital and orbital is a big difference\n\nSpaceX is orbital, of course it costs more 🤦‍♂️ \nYour claim is completely false, it can’t go to ISS. This is why I don’t listen to y’all who don’t even do basic research but dump money into companies", "score": 0, "replies": [{"body": "Well then list me another alternative that could go to space without costing more than 500k.\n\nOrbital flights costs way more than sub, but I still can't find an alternative that allows normal people to go to space without 10 mil.", "score": 0, "replies": [{"body": "It’s not really space, but that isn’t the point. You made a false claim and I wanted to correct it. Do your research before lying and possibly misleading people\n\nFurthermore the addressable market is all speculative, they definitely have a future....but their whole valuation is based on the future. If a market dip happens, stocks that are al speculation suffer the most. \n\nI mean look at tesla, went from 900 to 100 in March drop. Now a drop of that level may not happen again, but I’m just stating that u have heavy downside risk. \n\nI prefer to buy in undervalued businesses that aren’t too reliant on future growth. Important to note that I don’t even really play options on most stocks like these. Expensive premium, wild swings, little fundamental value....I’m gonna pass lol \n\nI prefer options on stocks I understand well and it’s been working well for me. This post seems more fitting for r/stocks or WSB\n\nEdit: Also “understand well” means researching before making claims lol", "score": 0, "replies": [{"body": "It is space, otherwise they won't earn their space badges. They did enter space for a few minutes. So you are wrong. \n\nhttps://newatlas.com/virgin-galactic-astronaut-wings/58388/\n\nhttps://en.m.wikipedia.org/wiki/United_States_Astronaut_Badge\n\nBuying value stocks or speculative stocks all depends on preference. This is r/options and all plays should be allowed if you are into just value investing you should go to r/investing.", "score": 0, "replies": [{"body": "**[United States Astronaut Badge](https://en.wikipedia.org/wiki/United States Astronaut Badge)**\n\nThe United States Astronaut Badge is a badge of the United States, awarded to military pilots, naval flight officers, navigators/combat systems officers (this badge can also be awarded to USAF officer astronauts who are not navigators/CSOs, but who wear the same insignia while designated as astronaut-qualified Air Force \"observers\"), flight surgeons, and civilian pilots who have completed training and performed a successful spaceflight. A variation of the astronaut badge is also issued to civilians who are employed with the National Aeronautics and Space Administration as specialists on spaceflight missions. It is the least awarded qualification badge of the United States military.  \n\n[About Me](https://www.reddit.com/user/wikipedia_text_bot/comments/jrn2mj/about_me/) - [Opt out](https://www.reddit.com/user/wikipedia_text_bot/comments/jrti43/opt_out_here/)", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "I believe they will have those in the future. Now is a good time to buy shares", "score": -2, "replies": []}]}, {"body": "Under 5 billion for a tourism company?? Get outta here!", "score": 7, "replies": [{"body": "Up 8.5% today! Laugh 😆 now 😭 later!", "score": 1, "replies": []}, {"body": "Not just any tourism company a 🚀 tourism company! It’s outta this 🌎 I tell ya!", "score": 0, "replies": [{"body": "Holds 8 people . Sounds like a party", "score": 7, "replies": [{"body": "At least it follows COVID regs.", "score": 1, "replies": []}]}]}]}, {"body": "If NKLA could have a 30 bn valuation and still larger than SPCE right now with 6bn valuation, Spce could indeed go up fast if the flight succeed + FAA approval.", "score": 3, "replies": []}]}, {"body": "Wait, whaaaaaaaaat?\n\nI don't  know anything about it.\n\nDo tell.", "score": 1, "replies": []}]}, {"body": "I like spce and have had it in my portfolio since 2019. I rode the huge pump to the top, sold my position, and have been slowly working my way back to it.", "score": 10, "replies": [{"body": "How excited are you for the forthcoming flight window???", "score": 1, "replies": [{"body": "Do the math on $spce. Next year they'll have 2 spaceships with 6 seats that can do a max of 50 flights per year. They charge $250,000 per ticket but as they need to replace the engine after every flight for also about $250,000 their gross income is approx. 5x$250,000 = $1.25M per flight. With a total of 100 flights (2 spaceships x 50 flights) they'll earn a max of $125M next year (IF they can find 600 people ready to drop 250k on a ticket for a plane that doesn't even really fly them to space...). Needless to say that with the current market cap of $5.14Bn $spce is hopelessly overvalued. That business can't really be scaled up, it would mean they have to find large numbers of people ready to drop a QUARTER MILLION on a single flight. I see the potential for a short squeeze but there are opportunities with much better risk/reward proportions. The only real push to the upside are the shorts covering their positions but thats at least partially priced in and without that, the stock is not worth more than $10. + Many shorts entered their positions at over $30 per share and are only waiting for this inflated stock to crash.", "score": 1, "replies": [{"body": "Agreed that it's not a good hold, but even without a major short squeeze this stock is likely to get hyped massively once news really comes out about the test flight. It hit $40 on nothing, and recently ran to $27.50 on hype for a cabin unveil", "score": 1, "replies": []}]}]}]}, {"body": "You say you've done hundreds of hours of DD, but your post could've easily been done in less than 1. \n\nLooks more like you're holding spce calls and want the rest of us to pump it for you.", "score": 30, "replies": [{"body": "Well, he did say he already had a large position at the end of his pump, I mean DD.  I also have couple of leap contacts, so I hope OP is right.", "score": 3, "replies": []}, {"body": "I don’t own a single call. Only shares.", "score": -2, "replies": []}]}, {"body": "*SPCE January or April 21 OTM Calls*\n\nThe volatility within those options is quite high. Your plan is to sit and assume that the stock goes up significantly? \n\nBecause a 10% move by January 1st still has you in the red.", "score": 8, "replies": [{"body": "Monday alone has moved SPCE 12% up then down 5%, there is reason for such high iv.", "score": 2, "replies": []}, {"body": "Sounds like a nice setup to sell covered calls, but SPCE can move crazy sometimes.", "score": 2, "replies": []}]}, {"body": "More interesting opportunity is if they can deliver on suborbital point to point. LA to HK in a couple hours", "score": 7, "replies": [{"body": "As we put more holes in the ozone", "score": -4, "replies": []}]}, {"body": "Sir, this isn’t wallstreetbets", "score": 6, "replies": [{"body": "Is it a Blaze Pizza at least? 🔥 🍕", "score": 2, "replies": [{"body": "What even is that?! It sounds amazing!", "score": 3, "replies": [{"body": "It’s like the Chipotle of pizza. It is wonderfully delicious!", "score": 0, "replies": []}]}]}]}, {"body": "Heyo its Steve Grasso", "score": 3, "replies": [{"body": "This guy knows something", "score": 1, "replies": [{"body": "I’ve literally invested hundreds of hours of due diligence into this. Please conduct your own and draw up your own thesis. More importantly however I’m an ardent fan of space and it’s incredibly exciting to be counting down to this historic flight!", "score": -8, "replies": [{"body": "Lol let me see your DCF on this", "score": 7, "replies": [{"body": "Right, he's killing it with the hundreds of hours.", "score": 4, "replies": []}]}, {"body": "My neighbor is the chief manager of *blank* learned the hard way over at Wall Street bets about that shit, at their manufacturing facility out in Mojave he’s so excited for this...... I think, haven’t talked to him in months since covid.", "score": 3, "replies": []}]}]}]}, {"body": "Anyone buying this shit?", "score": 3, "replies": [{"body": "It’s up 6.16% so far. I implore you to conduct your own DD and to draw up your own thesis. I’ve invested 100s of hours into SPCE.", "score": 0, "replies": []}]}, {"body": "They might take several years to become a thing, like TSLA. So idk if options are the play", "score": 6, "replies": []}, {"body": "All super awesome points just looked into the company a good bit. When do you think profitability would happen? 2021 people actually paying for travel. 2022?", "score": 2, "replies": [{"body": "Yes those estimates are rational.", "score": 1, "replies": []}]}, {"body": "Hoping.. SPCE is my most negative, would just be happy to break even at this point", "score": 2, "replies": []}, {"body": "Hm", "score": 2, "replies": []}, {"body": "I truly believe this is the set up of a perfect short squeeze assuming the test flight is successful.  \n\nAnd if successful it will lead to further more positive developments such as the Richard Branson flight, start of commercial operations, high profile flights of celebrities who booked with them, abc start of operations from multiple different spaceports such as Dubai for example.", "score": 2, "replies": []}, {"body": "I'm still relatively new to stocks, does this incoming Short Squeeze mean that the price of SPCE will tank or rocket?", "score": 3, "replies": [{"body": "Go up", "score": 2, "replies": []}, {"body": "Rocket", "score": 2, "replies": []}, {"body": "🚀", "score": 1, "replies": []}]}, {"body": "Where these people going when they get to space?", "score": 1, "replies": [{"body": "They go on a suborbital trajectory, or a full orbit and come back.", "score": 3, "replies": []}]}, {"body": "Maybe the Moon is where it goes, the rocket and the stock...  \nMaybe the Space is the last country without border restrictions...", "score": 1, "replies": []}, {"body": "The fact that anyone looks at bank ratings after 2008 is hilarious", "score": 1, "replies": []}, {"body": "A company with practically no revenue and huge losses. With projected profits far in the future. It will be crushed if 10 year tbond yield stabilizes at 1% or more. Higher rates crush DCF of these speculative stocks.", "score": 1, "replies": []}]}
