{"title": "[deleted by user]", "selftext": "[removed]", "id": "jy1qtn", "created_utc": 1605921272.0, "score": 56, "upvote_ratio": 0.97, "num_comments": 70, "comments": [{"body": "It is very stressful watching people bash a strategy for not being “buying power efficient.”\n\nIf you are constantly looking to increase the value of your portfolio with the most buying power efficient means possible, then you’re also likely the type of person who will never realize gains and will die absurdly rich in a 2-bedroom apartment with a 2008 corolla outside. \n\nLet the man wheel his AMZN and make $9k/month. It is not buying power efficient. He could do more with less if he used different strategies like strangles. But if he’s managing 1 position, making money, and changing his lifestyle, then this is worth a hell of a lot more than being buying power efficient. This is lifestyle efficient.", "score": 16, "replies": [{"body": "Thanks, I've actually spent more time chit chatting on reddit about options then actual trading options. I work enough at my job, I don't want to have another one. Literally it takes less then 30 minutes on Monday, and another 15-30 minutes on Friday to check up or manage the position. So, 1 hour a week to yield 2000-3000 is a good deal.", "score": 1, "replies": []}, {"body": "Oh, are you the guy with the YouTube videos? If you are, just want to personally tell you that you have the best content based on options.", "score": 1, "replies": []}]}, {"body": "That's a higher income compared to most Americans. I'd love to have the capitol  to wheel AMZN or GOOGL. Well done.", "score": 9, "replies": []}, {"body": "WHAAAAAAAA wheeling Amazon is the dream one day", "score": 10, "replies": [{"body": "the premium roi % wise is not that great tbh", "score": 4, "replies": [{"body": "Any reason why?", "score": 1, "replies": [{"body": "My guess is liquidity and stability. Overall, Amzn is considered a safe stock. I can’t imagine that millionaires are buying puts on it.", "score": 5, "replies": [{"body": "You're right - they sell puts. ;) - Liquidity on AMZN options is decent enough, not saying it's what I would choose but I have seen it plenty of times.", "score": 7, "replies": []}]}, {"body": "I guess because of low iv and the stock being stable", "score": 2, "replies": [{"body": "Oh I read your first comment differently. Depends on account size/limitations, but you can mint on AMZN puts. Regardless of IV.", "score": 2, "replies": [{"body": "I am wheeling it atm. its nothing special. there are better stocks. I regret doing this as a lot of capital is tied in a single stock now.", "score": 1, "replies": [{"body": "Certainly. Ideally, something your broker will allow you sell naked helps too. Not getting that with AMZN.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "Hay man, you’re hustling like the rest of us. Godspeed!", "score": 3, "replies": []}]}]}, {"body": "Good shit OP. I’d be interested to see the comparison between buying and holding vs theta strategies after taxes at the end of the year.", "score": 4, "replies": [{"body": "I think it would depend on how well theta strats does over long term. If they are anything equal, then buy and hold would win due to the tax break on long term gains. Options would have to do at least 25-30% better then buy and hold, depending on my income. You bet your tushy if I keep this going for a year, I'll be figuring that out.", "score": 5, "replies": []}]}, {"body": "I love this thanks for the update bro. I was going to PM you and ask for a update on this. Glad it's working out for you \n\nI am wanting to do this soon as well", "score": 5, "replies": []}, {"body": "Jealous as fuck that you have the ability to wheel AMZN. Good for you OP, get that coin gurl", "score": 6, "replies": [{"body": "Make it rain. :)", "score": 3, "replies": []}]}, {"body": "I make idiotic plays, I mean EXTREMLY idiotic plays. But I’m averaging like $700 days so yes you can. Just matters how big your capital is", "score": 6, "replies": []}, {"body": "Holy fuck...wheeling amazon? Im aware millionaires exist (and even billionaires) but that amount to play for options just sounds so obscene.", "score": 8, "replies": [{"body": "Seems ideal minus the wash sales.", "score": 2, "replies": [{"body": "I shouldn't have wash sales on the options since they are likely to be different. I believe the stock would be a wash. But it would only matter if I realized a negative amount for the year.", "score": 1, "replies": [{"body": "Different in what way? The rule itself is a bit ambiguous but I would check to see what your brokerage firm is going to report and depends on account size,  Have you traded the same underlying for an extended period of time, and seen the reported wash sales?", "score": 2, "replies": [{"body": "Option strike and date of expiration with the same underlying. Last year I was trading NDX options of varying strikes and expiration. I messed up and rebought the same strike and expiration after new year. It categorized the loss the year prior as a wash. And the other ones were OK.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 10, "replies": [{"body": "Until that one day it doesn’t work.", "score": 24, "replies": [{"body": "How exactly would it not work", "score": 3, "replies": [{"body": "March happens, you get assigned a ton of stock, and it stays in the gutter for 2 years. Sure you can hold and hopefully the company recovers, but no guarantee it will\n\nEven if you were just buying and holding though you would still be up shits creek", "score": 4, "replies": [{"body": "Which is why you wheel DKs, so you don't have to worry about what the price of the stock is while you write contracts up, down or sideways while getting paid to wait.", "score": 2, "replies": []}, {"body": "That’s why you trade ETFs. Literally cannot go tits up.", "score": -6, "replies": [{"body": "Oct 2007 the spy didn't recover til January 2013", "score": 4, "replies": [{"body": "Annnnnnnnd someone doesn’t understand sarcasm. \n\nIn all honesty though, position size/ risk management mixed with stop loss or dollar cost averaging, literally cannot go tits up.", "score": -3, "replies": []}]}, {"body": "And ETFs don’t yield as much as individual stocks either.", "score": 2, "replies": [{"body": "They also don’t have anywhere near the risk. Picking stocks has been proven to be random. Plus, you can trade 3x leveraged ETFs, can’t do that with stocks.", "score": -1, "replies": []}]}]}]}]}, {"body": "It will always work better than buy and hold. Unless you use extra buying power that you don’t have.", "score": 3, "replies": [{"body": "Unless its a lost decade", "score": 3, "replies": []}, {"body": "Wait, what always works better than buy and hold?", "score": 1, "replies": [{"body": "This is more of a response on the comment above regarding the downside risk only.", "score": 1, "replies": []}]}]}]}, {"body": "Oh if only it was that easy.", "score": 17, "replies": []}, {"body": "Really? Don't you need like 800k+ to do this? I mean you need some \"backup money\" in case of a huge crash, don't you?", "score": 6, "replies": []}]}, {"body": "Have u compared what u could do by deploying that amount of capital to buy leaps instead of shares to cover your cc?", "score": 3, "replies": [{"body": "Ok, as an example, I looked up AMZN Call Jan 21, 2022 @ 3600 strike. Bid/ask  295.75/302.65. So, Being in a debit of about 30,000. I think I might have to go 30 DTE to get strike prices higher then 3600 to be worth it. Unless, I buy the call and hope the underlying goes up and then sell the call against it. I don't know. What do you figure/suggest?", "score": 1, "replies": [{"body": "This. You could also take a more bullish approach and buy the 2800 leaps if u don’t foresee the stock dumping over the next year or so. This way you can buy more leaps and sell more calls against it.", "score": 2, "replies": []}, {"body": "Look at the 1890 strike  , diagonals are done with deep ITM leaps", "score": 1, "replies": [{"body": "Ok so a 127,000ish call, I could possibly buy 2 contracts. Would I aim for selling a certain OTM delta call or strike price that doubles the strike of the call bought?", "score": 2, "replies": [{"body": "You would sell at a point where, if Amazon spiked and you were assigned on your short call, you would still be in the green. So if it was a $127,000 call (ignoring premium), at least $1270 above your leap strike. So for 1890 strike at 1270 premium, 3160 strike. Which is currently selling for 93.37 for 33DTE. So if you sell that and it’s below that at expiry, you keep $9337 and get to do it again. If it blasts through both strikes, you keep the $9337 and exercise your long call to cover the shares (netting you your initial premium you paid for the long call). Probably a shitty explanation but I tried", "score": 1, "replies": []}, {"body": "Google Poor Mans Covered Call, alternatively you can look at Synthetic Covered Calls as well. Tying up all that capital just to wheel Amazon sounds crazy.", "score": 1, "replies": []}, {"body": "Try selling a strike where the breakeven is higher than the breakeven of your long call", "score": 1, "replies": []}]}]}]}]}, {"body": "Question regarding your 10/27 purchases. These are shares purchased outright to have a contract to do cc with? Why didn't you begin with cash secured puts to acquire, or did you?", "score": 3, "replies": [{"body": "Didn't know I was going to end up wheeling, I just started rolling after the covered call.", "score": 2, "replies": []}]}, {"body": "The wheel works great for sideways stocks....hard to wheel if tje stock is super bearish or bullish", "score": 3, "replies": [{"body": "AMZN has been a relatively sideways as of late. This could be why I feel like I'm doing so well with it.", "score": 3, "replies": [{"body": "your point of entry was good. I sold a put for 3280 when it was a bit higher and then the following week everything went down a lot but AMZN didnt recover like others. got 5000 for the put so at least my cost basis is 3230. i dont know if there is some technique to time your entry or not.", "score": 2, "replies": [{"body": "Brother, if we could correctly time stocks, we would be rich. I wish there was a technique, but I just draw it off luck. The next best thing to timing is determining if news or financial releases will effect the stock and in what direction.", "score": 3, "replies": [{"body": "true that.  down about 16k on 100 shares now. hoping it goes up in the coming  shopping season.", "score": 2, "replies": []}]}]}]}]}, {"body": "Jesus! That's a lot of capital!", "score": 2, "replies": []}, {"body": "Holy taxes dude. Is this an experiment with a portion of your trading capital or all of it?\n\nI haven't done the math, but I doubt the short term capital gains make up for the extra premium over trading indexes/options on futures. Plus the increased risk of a single company no matter how huge they are. Indexes and futures are taxed 60/40. This isn't quite enough capital for SPX, but you could trade RUT and do XSP, DJX, or /MES with the rest and get much better tax treatment.", "score": 0, "replies": [{"body": "I'm aware of benefits of 1256 contracts. Thanks for the heads up on RUT. The thing about selling options on indexes is that I won't have stock in hand after the contract is executed. They settle in cash, so I have to realize a loss right away vs owning AMZN and waiting if/when it goes back up. I prefer the chance to get my money back.", "score": 7, "replies": [{"body": "I see your point, but I wouldn't not let the option get executed. You can just roll it. Don't let it get exercised. Indexes are European style so there is no early exercise risk. Roll until you win. Plus you know an index will recover eventually. A single stock may not.", "score": 1, "replies": []}]}, {"body": "wheeling AMZN makes no sense. Very capital extensive and still risky since it's one company.", "score": -2, "replies": []}]}, {"body": "Good luck!", "score": 0, "replies": [{"body": "Thanks, and good luck to your Burger Fi.", "score": 1, "replies": []}]}, {"body": "Thanks that's interesting way of generating cashflow ! At what delta did you sell those calls?\n\nWas it not better instead of starting buying the stock selling puts until you get assign to generate more cashflow?", "score": 2, "replies": [{"body": "I aim for .3 delta. I didn't know I was going to wheel, I was initially aiming for a covered call strategy.", "score": 2, "replies": []}]}, {"body": "Wheeling AMZN makes no sense. Very capital extensive and still risky since it's one company.", "score": -4, "replies": [{"body": "I must be retarded.", "score": 4, "replies": []}, {"body": "On the plus side, It’s only one position to manage and brings a paycheck every week.", "score": 2, "replies": []}, {"body": "there is no difference between wheeling multiple companies and wheeling one solid company.\n\nAs matter as fact, the more stocks you wheel the higher the probability of getting a bad one.\n\nThis man has a system that works for him, awesome.   It's not like Amazon will go bankrupt anytime soon.   They may even do a stock split like Tesla in the future.", "score": 0, "replies": [{"body": "The difference is commissions and fees. More fees and commissions trading multiple companies and amounts.", "score": 1, "replies": []}]}]}]}
{"title": "NIO: The biggest bull argument for NIO that NOBODY is talking about", "selftext": "\nThe biggest bull argument for NIO that NOBODY is talking about: Chinese AI Full-Autonomous Driving \n \nAI driving is coming, as we all should know by now. \nWe all hear that Tesla is the world leader, blah blah. BUT.. they are an AMERICAN company. China will inevitably want AI driving in their country. Do you really believe they will allow American AI to be driving and collecting data on Chinese roads?  \nEnter: NIO\n \nNIO has proven to be able to develop AI Self-Driving capabilities and is in the process of developing fully autonomous driving. There‘s a good reason China is backing Chinese-based EV companies and especially \nNIO in particular. \n \nJust my two cents. \nWhat do you guys think? Will China allow Tesla AI to drive on Chinese streets once full-self driving is mainstream?", "id": "jyksoq", "created_utc": 1606000645.0, "score": 58, "upvote_ratio": 0.83, "num_comments": 75, "comments": [{"body": "Now ask yourself: will the rest of the world allow Chinese AI to just run free on their streets?", "score": 104, "replies": [{"body": "Solid point. We could see a Huawei-like situation in terms of consumer availability in China.", "score": 20, "replies": [{"body": "What I mean by that is China will use Chinese-made products, and the rest of the world will continue to be the rest of the world.", "score": 19, "replies": [{"body": "Yes. China’s industrial partners all across Africa and the middle east have made it clear they don’t mind Chinese surveillance tools in exchange for development.", "score": 11, "replies": [{"body": "Shit if you think about it that way its a win-win for those governments. They gain security of their power, and their power grows with development.", "score": 2, "replies": [{"body": "Economic colonialism is the cornerstone of quiet ascendency.\n\nI don't know where I read that but it was a few years ago. They're only Communist in name.", "score": 1, "replies": []}]}]}, {"body": "There’s like 8 billion chinamen in the world tho", "score": 2, "replies": []}]}, {"body": "10/10 would buy HuaWei if they went IPO. \n\nSurveillance and 5g and government backing? Count me in.", "score": 3, "replies": [{"body": "I'm in xiaomi right now. \n\nIn the past year Huawei has seen - 23% annual growth and is currently the global #2 for mobile market share. On the other hand, xiaomi is #3 globally, but have seen +45% annual growth.\n\nXiaomi earnings on Tuesday, I'm praying they're good", "score": 3, "replies": [{"body": "Xiaomi isn't a big player because all the people who xiaomi want buying their stuff want Apple products. It's pretty much a tits half-up at least", "score": 1, "replies": [{"body": "Xiaomi have a bigger market share than Apple already. Apple clearly aims at to be the most prestigious phone brand whereas xiaomi offers powerful products at a more budget price. I think they have entirely different markets", "score": 1, "replies": [{"body": "As a Chinese who witnessed this in person, no. People look towards Huawei for the kinds of products you just described. Xiaomi is stuck playing the tiny margin between flagship killer (Vivo, Oppo) and prestige brand (Huawei, Apple). Another brand in the same space but way more niche is ZTE. Apple profits way more per phone and Vivo and Oppo blow Xiaomi out the water with volume. \n\nAlso, from a a Chinese perspective, Xiaomi is an order of magnitude more expensive than Oppo or Vivo.", "score": 2, "replies": [{"body": "Here's Huawei's best flagship at the moment:  The \\[Mate 40 Pro +\\]([https://consumer.huawei.com/uk/phones/p40-pro-plus/buy/](https://consumer.huawei.com/uk/phones/p40-pro-plus/buy/)) is priced at £1299 (they do have a more expensive foldable that we'll ignore). They have a \\[P40 lite E\\]([https://consumer.huawei.com/uk/phones/p40-lite-e/buy/?skucode=80440110010002904](https://consumer.huawei.com/uk/phones/p40-lite-e/buy/?skucode=80440110010002904)), cheaply priced at £139.99 .  From their latest phone series (mate/p 40s) they have 3 cheap ones(<£300), 2 mid price (<£700), and 2 premium (>£1000).\n\nNow looking at Xiaomi, their website is a bit more of a pain to use as it doesn't show the prices immediately but from what I can tell their most expensive product is the \\[Mi 10\\]([https://www.mi.com/uk/buy/product/mi-10](https://www.mi.com/uk/buy/product/mi-10)) at £799 . I expect the Mi 10 pro is more expensive but there isn't a buy option on the website that I can see. They have a couple phones priced 500-600 (mi 10T and mi note 10). Other than that, they offer loads of cheap phones. Their entire Redmi series is very budget friendly.\n\nIt's hard to compare the phones in terms of performance as Huawei offer their own chips whereas Xiaomi use snapdragons. Huawei also don't have Google on their phones - which I and \\[others\\]([https://arstechnica.com/gadgets/2020/03/huawei-reportedly-expecting-a-20-drop-in-phone-sales-thanks-to-export-ban/](https://arstechnica.com/gadgets/2020/03/huawei-reportedly-expecting-a-20-drop-in-phone-sales-thanks-to-export-ban/)) believe to be the reason its sales plummeted. Clearly outside of China this put Xiaomi as the phone of choice out of the 2 brands.\n\nI'll talk about Oppo too (I personally own  a Reno 2 :) ). They have 3 lines: the find series (flagships costing up to \\[£999.99\\]([https://oppomobiles.co.uk/smartphones/find-x2-series.html](https://oppomobiles.co.uk/smartphones/find-x2-series.html)) ); the reno series (mid range phones up to \\[£699.99\\]([https://oppomobiles.co.uk/smartphones/reno-series.html](https://oppomobiles.co.uk/smartphones/reno-series.html)) ); and the A series (budget phones). The x2 find phone has the same chip as the Mi 10, it does have more RAM (12gb vs 8gb) and a higher refresh rate screen (120 vs 90 fps) but it is also £200 more expensive. There are rumours the next Xiaomi phones will all feature high refresh rate and be the first to feature the new snapdragon chip likely to be getting \\[announced next month\\]([https://www.slashgear.com/snapdragon-875-is-coming-what-to-expect-from-the-flagship-chipset-10641808/](https://www.slashgear.com/snapdragon-875-is-coming-what-to-expect-from-the-flagship-chipset-10641808/)). \n\nI think Oppo and Xiaomi are pretty close in competition in regards to the phones they produce and their prices, and I can't wait to see the potential of the sliding phone that Oppo demonstrated earlier in the week! I think your judgement that Xiaomi is in a weird spot in the market is completely wrong. I think outside of China Huawei will continue to fall short, especially for its pricing, and Xiaomi will continue to grow (I'm hoping they come into phone providers, like EE, in the UK for this time next year when my contract runs out lol). I do think Oppo is a big rival for Xiaomi in the market and that they're competing for a similar spot - but I can only invest in 1 as the other isn't a public company.\n\n&#x200B;\n\nHere's the current mobile market shares globally - you can clearly see Xiaomi stole marketshare from Huawei [https://www.statista.com/statistics/271496/global-market-share-held-by-smartphone-vendors-since-4th-quarter-2009/](https://www.statista.com/statistics/271496/global-market-share-held-by-smartphone-vendors-since-4th-quarter-2009/)", "score": 1, "replies": [{"body": "Those are Western prices. In their home market, which is by far their largest market, it's completely different. \n\n£799 ~ ¥7000.\n\nGoing one tier up to £999 takes the Chinese consumer to ¥8700. That's not a trivial difference because Chinese average incomes are not at all comparable to British or any other Western incomes. At that scale, an iPhone that costs only a little more at ¥9000 is a far more sensible option, being their perceptions of \"premium.\"\n\nYou're not taking into account their largest market and the local income of that market. China makes up the lion's share of Xiaomi, Oppo, and whatever else brands' income. The average income of white-collar Chinese people in the rich cities is only ¥8000. These phones literally cost more than their entire incomes every month. \n\nXiaomi is not going to be a worthy proposition considering they're both too premium to compete against Oppo and Vivo, who have far less expensive options, and not as premium as Huawei or Apple, who have dedicated premium user bases.", "score": 1, "replies": [{"body": "I don't know the Chinese prices for oppo and xiaomi, but as I showed they both have budget phones. Oppo is also 9 years older than xiaomi so it's hard to imagine that suddenly they're going to grow faster", "score": 1, "replies": [{"body": "Xiaomi's budget options are a lot less budget. They're comparable to some of Oppo's mid-tiers. Like I said, Xiaomi's slicing a very narrow pie. At least ZTE, its closest competitor, is mainly a telecom equipment manufacturer.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": -5, "replies": [{"body": "Actually EU has issues with Huawei too, and draconian import quotas for non EU cars.", "score": 13, "replies": []}, {"body": "> only US who had an issue with huawei and it’s was because of trump\n\nActually most of the western world, due to the high potential for espionage and backdoor from a state-run Chinese communication company. The risk is less from western countries companies since they aren't state run and even if backdoors are in place they're owned by allies.", "score": 2, "replies": [{"body": "The western media’s villainising of China is archaic tbh and I find it hilarious that they’re ok with what the NSA and CIA have been doing for decades and yet are so paranoid about state run Chinese firms", "score": 3, "replies": [{"body": ">The western media’s villainising of China is archaic tbh and I find it hilarious that they’re ok with what the NSA and CIA have been doing for decades and yet are so paranoid about state run Chinese firms\n\nIt isn't villainizing, it's a realistic view of the geopolitical landscape. China is a growing power that wants to be a superpower, and contends with other major powers both economically and through methods like espionage. \n\nThey're more of a threat globally than classic boogeymen like Russia, and they're pushing into Africa and the South China sea with expansionist goals. Anyone who can't see that is blithely unaware or has pro-China sentiments. \n\nI don't see how it would even be controversial to portray China and the US as being at the start of a cold-war situation, and the current weapons of mass destruction are the ability to destroy the opposing country infrastructure with the push of a button.\n\nGiving an expansionist foreign superpower the ability to shut down your electric grid, communications, etc at the push of a button when you make them angry is a vulnerability of the highest order, and the CIA and NSA are right to recognize and do their best to prevent that for the US and our allies.", "score": 3, "replies": []}]}]}]}, {"body": "Sleepy Joe will be handing the keys to the city to China", "score": -7, "replies": []}, {"body": "its cHyNa market vs world market, pick wisely", "score": -1, "replies": []}, {"body": "Exactly..Tesla has a better chance for a more global reach than NIO currently given the geopolitical situation..even now the EU(Germany) is standing up to China.", "score": 4, "replies": [{"body": "Happy cake day!", "score": 1, "replies": []}]}, {"body": "If we reach some kind of walled garden where NIO gets China and Tesla gets Europe and America, NIO is still a massive company.", "score": 5, "replies": [{"body": "I agree 100%.", "score": 3, "replies": []}, {"body": "that is why own NIO and TESLA. NIO and Tesla at the moment the only EV that has OTA updates btw.", "score": 3, "replies": []}]}, {"body": "Well that was a hard reverse uno card", "score": 3, "replies": []}]}, {"body": "It’s only a matter of time before Elon’s loud mouth gets the CCP pissed and they sanction Tesla. Either that or the tensions with the US will trigger it", "score": 6, "replies": []}, {"body": "NIO uses mobileye which is an Israeli company for their self driving tech... which is what tsla used in 2014", "score": 7, "replies": [{"body": "yes and the latest mobileye is good [https://www.youtube.com/watch?v=HPWGFzqd7pI](https://www.youtube.com/watch?v=HPWGFzqd7pI)", "score": 1, "replies": []}]}, {"body": "Sounds good", "score": 0, "replies": []}, {"body": "I think China will allow Tesla to do what Tesla does. But that doesn't take away from everything else you said.", "score": 17, "replies": []}, {"body": "That’s funny you think China is the tech innovator and not a thief. \n\nTesla will hit the breakthroughs first. China will steal it, fuck up the reverse engineering process and Nio cars will be driving families off of cliffs.", "score": 5, "replies": [{"body": "They'll copy and then do it better. Watch.", "score": 10, "replies": [{"body": "Sort of like facebook, hmm...", "score": 1, "replies": []}]}, {"body": "Except history has proven China is great at stealing innovation and it doesn’t fuck up replicating it", "score": 21, "replies": []}, {"body": "Half right. They will steal it and replicate it for cheaper...", "score": 2, "replies": []}]}, {"body": "The Chinese are peasants like you, end of story STFU. The hard workers come to USA, the one’s that can’t go to HK", "score": -7, "replies": [{"body": "Slow down there, bud. Gains are gains. I have no political position here.", "score": 15, "replies": [{"body": "Some commenters are talking like straight CCP antagonists. You can be greedy without drinking the koolaid homies.", "score": 6, "replies": []}, {"body": "Gains is gains", "score": 7, "replies": [{"body": "we all here tryna get rich, can u not ?", "score": 5, "replies": []}]}]}, {"body": "that American propaganda really getting to you lol.", "score": 11, "replies": [{"body": "It’s true, it’s also obvious that you haven’t lived outside of the United States", "score": 1, "replies": []}]}]}, {"body": "TSLA has to worry about liability.\n\nChina-based EV companies do not; only about CCP-approval. A few hundred thousand dead Chinese won’t slow progress to the glorious future.", "score": 20, "replies": []}, {"body": "Umm AI means paying $2 for a trip across town and no more need for a car.  Doesn’t this mean they ultimately sell fewer calls?", "score": 2, "replies": [{"body": "You do realize not everyone lives in a city right?", "score": 3, "replies": [{"body": "I didn’t say they wouldn’t sell any cars, just fewer.  Are people in rural China buying lots of cars right now?", "score": 2, "replies": []}]}]}, {"body": "hey retard, Nio uses mobile eye oem autonomous driving, off the self, plug and play. That’s why I’m long on Intel, mobile eye is the largest assisted driving developer& manufacturer, they will launch their 7nm EyeQ5 autonomous driving chip.", "score": 5, "replies": [{"body": "I doubt Nio has put any resources into autonomous driving research considering their previous cash shortage, they did get a lot tendies this year from my government, but R&D on good IPs take years and dedication. Not saying oem from mobile eye is bad, but this post is so retard, which is why this stock is in a bubble cuz you guys don’t know shit.", "score": 3, "replies": [{"body": "No idea why you're putting in effort with a well intentioned and information comment on this sub. Just use 🚀 for go and NKLA for pull out like my dad should've", "score": 1, "replies": []}]}, {"body": "NIO and Intel have stopped talking about that. In fact, in their last investor's earning call NIO talked about their own R&D team developing the ADS system inhouse. I don't think that deal is still happening.", "score": 1, "replies": [{"body": "That’s even worse, for now the best thing to do is rely on matured systems from mobile eye so they can not only stay competitive in autonomous driving but also spend more effort on things like scale production and cost management", "score": 0, "replies": []}]}, {"body": "Are they making their own 7nm chip?? I thought Intel was still trying to get 10nm off the ground", "score": 2, "replies": [{"body": "yes，it will be launched next year, but the specs are mostly available online, also if you just looked at the specs it is superior than Tesla’s fsd chip launched last year. Another point is Mobileeye is now an intel company, so I would assume the development is seem less, Tesla relies on Samsung to make their chip don’t know what kind of impact it will have. It’s like apple’s system, apple might not have the best technical specs but the sub unit inside that system works much more efficiently because everything is designed around let’s say the M1 chip. So we might see Tesla facing the biggest challenge they have seen for far next year. The China EV Trio though, they are just not competing in the same level, I don’t know how they can catch up on Tesla or even legacy auto makers such as VW group whether it is scaled production, R&D or cost management.", "score": 2, "replies": [{"body": "imo this is why Elon is not afraid... Tesla after all is an American company, with American ingenuity. They implement change so fucking fast that Sandy munro is even shocked, xpeng stole their source code and then they just rewrote that shit within 12 months... and made it even better. CCP can copy all they want this is just like apple vs huawei/oppo/etc and Apple has destroyed them making their own chips... it would be funny though if one day we see Tesla phones/laptops... I dunno if Apple comes out with a car or not but they may be the only real competitors in the long run", "score": 1, "replies": [{"body": "Yea Chinese here, that’s why I also think NIO’s battery swap won’t work against Tesla after watching battery day. The fact you can change you battery put so many design restrictions. Look at our smart phones. Integrated design will always be better.", "score": 2, "replies": [{"body": "I think battery swap sounds nice in theory if we all charged and discharged at an equal rate in a vacuum. But basically this is going to open the flood gates for battery abusers who give no shits about proper charge and discharge... so do they charge higher premiums for the ones who wear their batteries down quicker?? They should’ve just left it to die like Tesla did. Too many of these companies just waiting on daddy xi to bail them out if they go tits up and honking themselves on getting that amzn valuation where they’ll “eventually profit.” \n\nWhat most of these mopes don’t understand is that Tsla needed to scale to become profitable. Moreover they are doing other things for revenue too like energy storage/solar/carbon credits. NIO is producing a fraction of what tsla does, with only 15-18% margin on asp... they’re at tsla valuations from like 5 years ago but doing everything opposite of tsla like not selling the high end, high margin cars. I like that my nio shares are at 50 but Wall Street is literally duping main St because for once main st out smarted them with tsla so now they’re trying to make up for the missed bag", "score": 3, "replies": [{"body": "Exactly man, agrees on all your points. Scale is always the key, I can’t even count how many time Elon emphasizes on it. Making a prototype work in a lab means nothing, making the same thing in millions under strict time frame with good QC is why PaPa Elon slept in the conference for weeks when they start making model3", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "it took google over a decade to get cars that could self-drive in a tiny suburb in phoenix, which is flat and has no weather. self-driving cars are a fantasy being sold to retarded people who want to pay extra for their tesla.\n\nalso a country famous for stealing technology is not going to get there first, because, well, that's not how stealing works.", "score": 1, "replies": [{"body": "lol Tesla has 1 bil hrs of combined driving on the road and growing... it’s neural net is way beyond that of waymo and their 50 cars. In 5 years tsla will have 30% of global market share and probably 80% in 15 years. This is the new iPhone", "score": 0, "replies": []}, {"body": "my ghey subaru lane sensors won’t even work in fog let alone rain or snow.  add a few highway cones and detours and shit and these AI autonomous cars will be slamming into concrete barriers and those fines are double in work zones you know 😂", "score": 1, "replies": [{"body": "LiDAR", "score": 1, "replies": []}]}]}, {"body": "It doesn't matter.  Its a meme stock.  It doesn't need a catalyst.", "score": 1, "replies": []}, {"body": "So YOU'RE the retard who I sold my calls to at a 600% profit.", "score": 1, "replies": []}, {"body": "I think China will allow Tesla AI on Chinese streets, however I suspect that Tesla will not want their AI on Chinese streets for years after it has hit the rest of the world.  The reason is that Chinese driving is unpredictable. Most police in Chinese cities do not ticket for moving violations. Because of this, the rules are much looser and human behavior is harder to predict.", "score": 1, "replies": []}, {"body": "Another point noone seems to be talking about is battery swapping. Probably to most used argument against EVs is the range and charging time (add the time you have to wait in line until you even get to the charging port). With NIO growing and a swap station around every corner, which takes as much time as fueling a gasoline car, I belive a lot more people will be choosing EVs and especially NIO", "score": 1, "replies": []}, {"body": "Nah bro. XPENg is the future of China’s EV market. Even papa musk is rustled.", "score": 1, "replies": []}, {"body": "I’m always bullish on Chinese papa", "score": 1, "replies": []}, {"body": "If this was the case you wouldnt have other American companies in China. Tesla could make adjustments to meet local regulations", "score": 1, "replies": []}, {"body": "If anyone thinks NIO is gonna fail just reflect on the fact that Tencent owns like 17% of NIO", "score": 1, "replies": []}, {"body": "Please someone convince me not to buy 100 shares tomorrow and sell covered calls.", "score": 1, "replies": []}]}
