{"title": "JPM 69% YoY earnings decline", "selftext": "Q1 EPS of 78cents vs consensus estimate of $1.84 driven by $6.8bn addition to loan loss reserves (total credit costs of $8.3bn for the quarter). \n\nSheds some light on the calculus behind them tightening credit standards on mortgage borrowers.\n\nAnd yet, shares trading up 3% premarket on the news as IMF announces the covid recession will be the worst since the Great Depression. \n\nThis is getting ridiculous.\n\nCNBC article: [https://www.cnbc.com/2020/04/14/jpmorgan-chase-jpm-earnings-q1-2020.html](https://www.cnbc.com/2020/04/14/jpmorgan-chase-jpm-earnings-q1-2020.html)\n\nEdit: Nice!", "id": "g152ca", "created_utc": 1586869133.0, "score": 172, "upvote_ratio": 0.92, "num_comments": 111, "comments": [{"body": "JPM and Wells Fargo are both trading down.  Notice only the stocks that have reported earnings (and those related) are the ones moving in the correct direction.  Everything else is being pumped for a dump.", "score": 49, "replies": [{"body": "Correct direction?. Every stock deserves its own direction. Just because JPM is down doesn't mean AMZN should also be down. Know what you own. \n\nAlso doing the opposite of the crowd usually helps. Last week seeing everyone try to predict the top had me stay the course long. Today was beautiful. \n\nPrice action pays better than opinions. But price action is dumb right? Trade on young Jedi. You have a lot to learn.", "score": 8, "replies": [{"body": "Why are you downvoted.", "score": 1, "replies": [{"body": "It's funny, I realized over the weekend that most of my bullish comments were getting downvoted. I figured getting downvoted was a contrarian indicator to reaffirm my long thesis for now. When I see the same idiots start suggesting the long or get blown out and disappear, I'll sell to them and consider the short IF the price action is there. Good Luck.", "score": 6, "replies": []}]}, {"body": "Really?  I sold all my stocks in January based on the rising debt crisis and sharp rise in stock prices (over valuation).  \n\nThen I bought airlines and REITs in March which I've now sold.\n\nNow I'm buying oil.\n\nI trade on fundamentals. Not on market hype.\n\nHow do you think I'm doing obi wan?", "score": -4, "replies": [{"body": "Thank you sir, may I have another? \n\nObi wan out.", "score": 2, "replies": []}, {"body": "Hitting USO?", "score": 1, "replies": [{"body": "Not yet, but if oil crashes more I plan to.", "score": 0, "replies": []}]}, {"body": "Sure, chief.\n\n!RemindMe 1 month", "score": 1, "replies": []}, {"body": "Which Oil?", "score": 1, "replies": [{"body": "Bought CVE.  Gonna hold this one til the economy opens up.  A no brainer that oil demand will increase again and downside is worth the risk.  I will DCA when it falls.\n\nAirlines: Sold SAVE and AC at 50% gains.  \nREITs: Sold NRZ a bit too early at a 35% gain and it ended up over doubling :(\n\nThis week banks are reporting so we will be seeing them get beat up but I'd be cautious buying as they have a lot of downside coming with personal and corporate bankruptcies likely going to increase. Record amounts of cash have been set aside for those markdowns.", "score": 2, "replies": [{"body": "I did the same thing with NRZ.", "score": 2, "replies": []}, {"body": "Catious buying? Should i buy CVE now or no? Yes right nobrainer!?", "score": 1, "replies": []}]}]}, {"body": "How'd that oil bet play off, chief? Looooool", "score": 0, "replies": [{"body": "Made 50% on CVE\n\nNow I'm buying airlines at their new low", "score": 0, "replies": [{"body": "Yup, sure you did.\n\n!RemindMe 1 month", "score": 0, "replies": [{"body": "There is a 1 hour delay fetching comments.\n\nI will be messaging you in 1 month on [**2020-06-15 04:41:12 UTC**](http://www.wolframalpha.com/input/?i=2020-06-15%2004:41:12%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/StockMarket/comments/g152ca/jpm_69_yoy_earnings_decline/fqokx5x/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FStockMarket%2Fcomments%2Fg152ca%2Fjpm_69_yoy_earnings_decline%2Ffqokx5x%2F%5D%0A%0ARemindMe%21%202020-06-15%2004%3A41%3A12%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20g152ca)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}, {"body": "No need to wait a month.  \n\nToday I sold off SAVE at a 75% profit (have swing traded it twice before for 50%+ gains).  Now only holding CVE which I'm up about the same on but will be holding longer as I believe oil will just continue to grow in demand.\n\nAirlines will be stuck for a while.  Whether that will be reflected in their stock price, I'm not sure.\n\nI'll fully exit the stock market through the summer if this trend continues as everything I'm watching has become grossly overvalued.", "score": 0, "replies": [{"body": "!RemindMe 1 month", "score": 1, "replies": []}, {"body": "Mhmm sure ya did.", "score": 0, "replies": [{"body": "Don't be jealous.  Everyone has been making money in the market recently. Just don't get caught holding the bag.", "score": 0, "replies": [{"body": "Trust me, I'll never be jealous of a guy trying to prove he's making money in the markets to a stranger on the internet.", "score": 0, "replies": [{"body": "Says the troll", "score": 0, "replies": [{"body": "Lol talk to you in a month, pimp daddy", "score": 0, "replies": [{"body": "Stfu I see your racist comments and posts everywhere.I wonder what experiences you went through to be so ill and aggressive rating asian girls and shit like that .", "score": 0, "replies": [{"body": "lol angrily responding to me from an alt? You poor thing.", "score": 1, "replies": [{"body": "Yes I made this account rn because I just so your posts I am not hapa. I am also gonna use this to talk to people like you.", "score": 0, "replies": [{"body": "Have fun lmao", "score": 1, "replies": [{"body": "Ok ;)", "score": 1, "replies": []}, {"body": "Ok ;)", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Lol well that didn't work", "score": 0, "replies": [{"body": "How so?", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Lots of banks hit solvency issues in the 2008 financial crisis.\n\n\nThe fact that JPM has enough cash reserves ($1 Trillion-ish last time I checked) and is able to reposition it’s strategy to weather this economic downturn actually feels a lot of investors with confidence.\n\n\nWhy are you surprised that’s reflected in their shareprice?\n\n\nIt’s gone up because JPM are showing they can survive this without a government bail out.", "score": 117, "replies": [{"body": "[deleted]", "score": 24, "replies": [{"body": "You got a better answer for OP then?", "score": -8, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "I don’t think that either.\n\n\nAs someone who continues to DCA into JPM, I do so because they’re trading at a reasonable price and have a good balance sheet, perhaps others are doing the same thing, hence why the price is going up.", "score": 2, "replies": [{"body": "You telling me JPM is going up because people are buying the stock? Somebody pinch me!", "score": 5, "replies": [{"body": "That’s literally not what I’m saying, like... at all.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Think of it in terms of new available information since yesterday. The outlook was negative to begin with, and this news is far worse than the consensus outlook. You have to imagine that a projection to their free cashflow to equity takes a hit after accounting for what they announced this morning. So, yes, I don’t think this is news that should make the stock trade up on fundamentals.\n\nThey will see large losses on loan markdowns. And just think about the bottom line profit number, $3bn - lowest since 2013. In 2013 they were trading at $35. They are trading at $99 this morning. It seems like a mispricing of risk to me, if only in terms of directionality.", "score": 18, "replies": [{"body": "Free cashflow projections don’t mean as much as they did in a bull market.\n\n\nIn a bear market, people want to know that a company has a solid balance sheet, which JPM do.", "score": 21, "replies": []}, {"body": "Forget about fundamentals.  It's just about emotions right now.", "score": 8, "replies": []}, {"body": "Consensus literally hasn't been updated since the pandemic. It is meaningless now. what were rates in 2013? What was the average multiple in 2013? What are both of those now? Also how long will it be at $3B? until 2021?", "score": 2, "replies": []}]}, {"body": "This is the same reason I bought BAC. These are the only two banks That learned from 2008, positioned themselves correctly, and are well equipped to weather this storm.", "score": 8, "replies": [{"body": "Snap.", "score": 1, "replies": []}]}, {"body": "Solvency issues will become important again when people stop paying their mortgages... AGAIN... because household debt is up and 20% of people will be out of work.\n\nWhy can't people look 3 months ahead?  April 1st... 1/3 of all rent wasnt paid...", "score": 8, "replies": [{"body": "As in JPM won’t have solvency issues even if all of their borrowers struggle to pay it back in the immediate future.\n\n\nThey have $1 trillion in cash.", "score": 11, "replies": [{"body": "I hear what people are saying.  But I just don't think everyone is taking into account ALL the things that are happening.  I agree they have a trillion in cash and that's great, but liabilities will crush that if people stop paying.  I think May will really show what our economy will look like.  When months of people not paying start affecting the markets.\n\nThis is 10 times worse than 08.\n\nHere's a stat for you.  Only 93k people flew this easter... down from 2.1 million a year ago.  All the down stream revenues (usually paying off debt) that are gone.  But I'm just a mad man posting on reddit.", "score": 7, "replies": []}, {"body": "Are they the US government?!", "score": -1, "replies": [{"body": "No, they’re far better at managing their money than the US Government.", "score": 17, "replies": [{"body": "No, they are a private for profit business. Government shouldn't, and isn't \"in it for the money\". While we can always critique how the gov spends money, and it would be nice if they balanced the budget consistently, the two entities have different objectives and aren't comparable. Also, part of the reason they have so much cash is due to gov. regulation.", "score": 1, "replies": []}, {"body": "No shit", "score": -2, "replies": []}]}, {"body": "Yes!?", "score": 1, "replies": []}]}]}, {"body": "JPM only carries high quality(read 800+ credit score) and sold the rest to FM/FM. Their issues will come from corporate/business banking, Trading losses, or Consumer CC debt(they are tightening these standards up and ghost reducing limits).", "score": 3, "replies": [{"body": "I can confirm. I was a week away from a jumbo refi (743 FICO) at 3.375% and had same job for 20 years plus my car lease and credit card with Chase. They called off the loan last week. Rocket stopped doing Jumbo refi about three weeks ago.", "score": 1, "replies": []}]}]}, {"body": "Yea my initial reaction was \"lol, wrecked\", Then I realized this is exactly what companies should be doing to prepare for the storm.", "score": 2, "replies": []}, {"body": ">It’s gone up because JPM are showing they can survive this without a government bail out.\n\nIsn't this a result of the stress tests that were implemented by Geithner after the financial crisis?", "score": 1, "replies": [{"body": "Yep.", "score": 1, "replies": []}]}, {"body": "They just indirectly bailed out JPM via bailing out their counterparties.", "score": 0, "replies": []}]}, {"body": "Nice", "score": 16, "replies": [{"body": "𝓷𝓲𝓬𝓮 ☜(ﾟヮﾟ☜)\n#Nice Leaderboard\n**1.** `u/RepliesNice` at **5645 nices**\n\n**2.** `u/Cxmputerize` at **3988 nices**\n\n**3.** `u/spiro29` at **3403 nices**\n\n**...**\n\n**41545.** `u/YangGangBangarang` at **3 nices**\n\n---\n\n^(I) ^(AM) ^(A) ^(BOT) ^(|) ^(REPLY) ^(**!IGNORE**) ^(AND) ^(I) ^(WILL) ^(STOP) ^(REPLYING) ^(TO) ^(YOUR) ^(COMMENTS)", "score": 0, "replies": [{"body": "Nice", "score": 0, "replies": [{"body": "𝓷𝓲𝓬𝓮 ☜(ﾟヮﾟ☜)\n#Nice Leaderboard\n**1.** `u/RepliesNice` at **5660 nices**\n\n**2.** `u/Cxmputerize` at **3988 nices**\n\n**3.** `u/spiro29` at **3412 nices**\n\n**...**\n\n**26115.** `u/YangGangBangarang` at **4 nices**\n\n---\n\n^(I) ^(AM) ^(A) ^(BOT) ^(|) ^(REPLY) ^(**!IGNORE**) ^(AND) ^(I) ^(WILL) ^(STOP) ^(REPLYING) ^(TO) ^(YOUR) ^(COMMENTS)", "score": 1, "replies": [{"body": "Nice", "score": 1, "replies": [{"body": "𝓷𝓲𝓬𝓮 ☜(ﾟヮﾟ☜)\n#Nice Leaderboard\n**1.** `u/RepliesNice` at **5711 nices**\n\n**2.** `u/Cxmputerize` at **3988 nices**\n\n**3.** `u/spiro29` at **3467 nices**\n\n**...**\n\n**269480.** `u/chodegoblin69` at **1 nice**\n\n---\n\n^(I) ^(AM) ^(A) ^(BOT) ^(|) ^(REPLY) ^(**!IGNORE**) ^(AND) ^(I) ^(WILL) ^(STOP) ^(REPLYING) ^(TO) ^(YOUR) ^(COMMENTS)", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Market is drunk so everything is rational.   \n\nThey will make everyone believe that bulls are back and then decide to take it down.", "score": 21, "replies": []}, {"body": "Robinhood posted that the EPS was 2.89 that might be why", "score": 13, "replies": [{"body": "Trash brokerage", "score": 12, "replies": []}, {"body": "Lol", "score": 3, "replies": []}]}, {"body": "This is the reason for those financial stress tests that were developed after the last crash.   I guess they're working.", "score": 4, "replies": []}, {"body": "This was said in a comment over in r/investing. Thought it was interesting.\n\n“For anyone wondering about the reserve build they speak to, I'd like to add a couple of points;\n\n•It includes the impact of adoption of the new credit loss accounting standard (CECL /ASC 326).\n\n•Key difference between old GAAP and new GAAP is that you must now estimate the lifetime expected credit loss for your loans adjusted for forecasted conditions. So as of these 3/31 results, the increase in expected credit loss from the current portfolio over its   entire life is $6.8B - to the extent of the capability & accuracy of JPM's model, this is as bad is it gets.\n\n•Day 1 (1/1/20 no COVID) impact goes through retained earnings (i.e. no income statement impact), but subsequent measurement (i.e. 3/31/20 big COVID) goes through income. Hence the massive pop in reserves.\n\n•They're likely using a multi scenario weighted model and would have shifted the weightings to reflect the COVID environment; think something like 80-10-10 of most stressed economic environment:moderate stressed economic environment:baseline\n\n•Subsequent Q's won't see as big an income statement impact as the delta between prior Q provision (officially Allowance for Credit Losses) and current Q provision shouldn't be as vast.\n\n•You effectively had a black swan event for this adoption where 1/1/20 (it's effective date), you wouldn't have weighted a stressed economic environment as heavily (if at all, we nearly had the tip in 30,000 DJI almost as recently as Feb), versus 3/31/20 the remeasurement date where you have to account for, well virtually total cessation of normal economic activity.\n\nSo when they speak to building reserves (FASB will have a conniption at that language btw), they've assessed their entire portfolio for lifetime expected credit loss. You see the numbers pop particularly in cards, which are unsecured and your loss given default would to all intents and purposes be 100% vs mortgage loans where you've collateral.\n\nAlso important to bear in mind that since ~2018 the bigger lenders have been keeping higher quality mortgage loans on the books (basically they aren't selling top quality 800 FICO stuff to FNMA FMCC much if at all). Those ratings factor into the modeling which leads me to believe that their +$6.8B is pretty accurate.\n\nJPM are very well placed to weather this, as they were in 2008. It's a well run shop under Dimon.\n\nTL;DR: The EPS miss is due to new accounting rules & watch out for any bank who chooses to defer implementation (CARES relief) as it likely means their numbers on the 3/31 run were pretty bad”\n\nEdit: Credit user thekingoftherodeo", "score": 3, "replies": []}, {"body": "Profit was still nearly $3b.  The credit loss reserves was set aside just in case to cover losses in the future.  Like 2008-2009, most of those won’t be used and added back to earnings in the future.", "score": 11, "replies": [{"body": "You really think they won’t be taking massive losses on loan markdowns? I disagree. They’ll make up some of it on underwriting and trading, but I don’t think you can just dismiss what they’re communicating.\n\nYes, $3bn - lowest since 2013. In 2013 they were trading at $35. They are trading at $99 this morning. That’s rather extreme multiple expansion.\n\nYes, I agree they’re better capitalized, but the market’s pricing of risk here seems tough to justify for me.", "score": 15, "replies": [{"body": "It’s down now", "score": 1, "replies": []}, {"body": "No.  Losses on what?  They aren’t in student loans, minimal auto loans, home loans are mostly sold off to Federal Agencies.  The loan losses set aside are for small oil and gas companies mostly.", "score": -4, "replies": [{"body": "What? They have a trillion dollar loan book. That’s comprised of 21% consumer (cards and auto), 25% residential RE, and 12% commercial RE. So I think you’re underestimating their exposure to mortgages and consumer.\n\nI agree the oil loans will be a negligible issue. That’s only ~3% of their book, with C&I generally being 17%.", "score": 12, "replies": []}, {"body": "Credit cards bud.  You must be new to balance sheets.  Yes JP is diversified.  But all segments will be down.  All loans will be risky.", "score": 7, "replies": [{"body": "Like the markets think, they will be fine for a few months.  I swear Reddit is nothing but puts, shorting and doom and gloom.", "score": -3, "replies": [{"body": "Buddy, truly, if you don't see the next 2 years as doom and gloom, you are just lying to yourself.  The world economic output has plummeted 30%, and that's what we can measure.\n\nFrance is saying that they are closed until Mid May, Connecticut just said Mid May at the earliest.  Morgan Stanley just predicted people won't really return to work until June.\n\nI won't even go into the political part of all this...What else do you need to hear?", "score": 4, "replies": [{"body": "Not at all.  Have you not seen the V recovery in China?  Already talk of reopening the economy.  Predictions of 200,000 deaths and we haven’t even matched the flu.", "score": -6, "replies": [{"body": "Hm, I’m really not sure if we will have the same recovery. For one, we less aggressively suppressed. Places like Florida and Georgia haven’t even issued stay at home (iirc). And “haven’t matched the flu” in total death counts for a year even though deaths didn’t start ramping up until late March. I guess I’m not sure what your point is there, but if you’re suggesting this is mild, I’d say you should look at daily or weekly deaths, considering we haven’t been exposed to COVID for more than a couple months.", "score": 4, "replies": []}, {"body": "Have you? Or are you taking the word of the Chinese government?\n\nEven if they have started to reopen parts of their economy, it’s been how many months of severe measures? Measures that absolutely haven’t been replicated anywhere else in the world.\n\nAnyone who thinks we are still in for a V shaped recovery now is really kidding themselves.", "score": 2, "replies": [{"body": "RemindMe! 2 weeks", "score": 1, "replies": [{"body": "There is a 7 hour delay fetching comments.\n\nI will be messaging you in 13 days on [**2020-04-28 16:33:47 UTC**](http://www.wolframalpha.com/input/?i=2020-04-28%2016:33:47%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/StockMarket/comments/g152ca/jpm_69_yoy_earnings_decline/fne2qsw/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FStockMarket%2Fcomments%2Fg152ca%2Fjpm_69_yoy_earnings_decline%2Ffne2qsw%2F%5D%0A%0ARemindMe%21%202020-04-28%2016%3A33%3A47%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20g152ca)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}, {"body": "Rofl I look forward to your reply then.", "score": 0, "replies": [{"body": "Annnnd the market is up since this post.", "score": 1, "replies": [{"body": "Gotta say, props to you. Don’t know how you could have made that call, but you did and you were right.\n\nThat said, your initial point about v shaped recovery and so on is still a bit premature. Plenty of movement to come in both directions I think. Your prediction on the number of deaths and it not being as bad as flu certainly haven’t aged well...", "score": 2, "replies": []}]}, {"body": "The fact that this guy thinks this is going to be resolved in two weeks tells you everything you need to know.", "score": 1, "replies": [{"body": "The market went up over 20% in 2 weeks and you missed it should tell you everything.", "score": 1, "replies": [{"body": "Lol it also went down almost 40% in 2 weeks. You really think those 2 weeks of relief rally can’t get erased just as quickly? Every major down turn has a crash, a relief rally, then heads for new lows. This time won’t be any different.", "score": 1, "replies": [{"body": "No, but if you bought when it was down, you would have mad compounded returns in the next 1-2 years.", "score": 1, "replies": [{"body": "How is this compounding? Are you sure you know what this means?", "score": 1, "replies": [{"body": "I’m adding shares, plus I’ve kept my existing positions .  My income and dividends are adding to my shares at lower prices, hence as prices rose, like today, I’m compounding my returns, unlike you who probably sold at the bottom and will wait for 30,000 to rebuy.", "score": 1, "replies": [{"body": "Ok so no compounding just price averaging.\n\nI am not in the markets at all, I start and run businesses. Used to be a good thing to do....\n\nCongrats on any gains you’ve had; I for one hope you are right about a 2 week recovery but think that in reality you are miles out sadly...", "score": 1, "replies": []}]}]}]}]}]}, {"body": "The fact the market is up since this.", "score": 0, "replies": []}]}]}]}]}, {"body": "I'll tell you this.  Let's wait for China to actually open before we say how easy it will be.  They have to keep opening and closing because of the outbreaks.  Didn't they just have the highest total in 5 weeks??", "score": 1, "replies": []}]}]}, {"body": "And speculation about “what the market thinks” vs. what actually makes sense from the perspective of economics", "score": 1, "replies": [{"body": "The markets are always proven right.  The markets have been this way for 100 years.  If y’all knew it all, you be on the Fortune 500 list, not a Reddit sub.", "score": 2, "replies": [{"body": "That may take the award for the most specious logic I’ve heard all month", "score": 5, "replies": [{"body": "I stayed invested and added at the 18,500.  I’ve been investing professionally long enough.", "score": 1, "replies": [{"body": "Ok. We will see how it plays out", "score": 5, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "I think we should buy citi group shares. It’ll probably go up despite lower earnings caused by credit provisions.", "score": 7, "replies": [{"body": "Just think if they fail. At this rate the stock price would go through the roof!", "score": 4, "replies": [{"body": "Yeah. If they fail, they will shrug it off and say less competition for the other banks. And shows the economy is working as it should. Let it rise another 20%!", "score": 2, "replies": []}]}, {"body": "Or Goldman. Yeesh", "score": 1, "replies": []}]}, {"body": "NICE.", "score": 7, "replies": [{"body": "𝓷𝓲𝓬𝓮 ☜(ﾟヮﾟ☜)\n#Nice Leaderboard\n**1.** `u/RepliesNice` at **5647 nices**\n\n**2.** `u/Cxmputerize` at **3988 nices**\n\n**3.** `u/spiro29` at **3403 nices**\n\n**...**\n\n**268015.** `u/Blue_Lemur` at **1 nice**\n\n---\n\n^(I) ^(AM) ^(A) ^(BOT) ^(|) ^(REPLY) ^(**!IGNORE**) ^(AND) ^(I) ^(WILL) ^(STOP) ^(REPLYING) ^(TO) ^(YOUR) ^(COMMENTS)", "score": 1, "replies": []}]}, {"body": "So where is all thid worse than the great depression when even banks are armed to the teeth with trillions of dollars playing this corona problem like its nothing?  Either something is totally off or we are running happily into a major crash without even knowing it.", "score": 2, "replies": []}, {"body": "I also don't understand how the market is going up today. \n\nOil is declining despite produciton cut, yet market is rallying. Something is wrong in the market.", "score": 1, "replies": []}, {"body": "Hi! For this post (and future DD), feel free to join r/WallStreetResearch in order to easily cross-post. This isn't a competing server, but instead a digital archive for DD posts across subreddits so that research can be easily organized and referenced backed to. A financial research library of sorts.", "score": 1, "replies": []}, {"body": "69%... Nice", "score": -1, "replies": []}, {"body": "They beat their expectation though, market will probably go up another week", "score": 0, "replies": []}, {"body": "Anyone want a free stock you will need to signup for Robinhood with my link message me if interested", "score": 0, "replies": []}]}
{"title": "THE LAST YOLO", "selftext": "[deleted]", "id": "g19n5m", "created_utc": 1586884658.0, "score": 28, "upvote_ratio": 0.88, "num_comments": 82, "comments": [{"body": "292c 4/15", "score": 20, "replies": [{"body": "In for some 298c 4/17, I’m worse than you", "score": 10, "replies": [{"body": "spy 300c 4/17, sup", "score": 1, "replies": []}, {"body": "We got this", "score": 1, "replies": []}]}, {"body": "Actually?", "score": 1, "replies": [{"body": "Of course. Jpow won't let you down", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Got it locked in", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Position or ban", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I did lol up $20", "score": 1, "replies": [{"body": "[positions](https://imgur.com/a/5121YCu) \n\nUp $30 lol. I got you SPY 287C", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "rip", "score": 3, "replies": [{"body": "putting it lightly", "score": 2, "replies": []}]}, {"body": "Shopify 5/15 $300 put", "score": 3, "replies": [{"body": "You belong here with me", "score": 3, "replies": [{"body": "See you on the other side brother. Shopify is having a better 3 months than Johnson & Johnson had the last 5 years... by 1600%.... think there’s a bubble? Think these idiots have the global economy collapsing “priced in” to Shopify? How about the global lockdown continuities? Hehe", "score": 3, "replies": [{"body": "Of course there’s a bubble but e commerce not operating based on it atm. Earnings should also be positive", "score": 2, "replies": [{"body": "They earned 500 billion, spent 500 billion beat earnings by 4% (just over 20 million) and the stock explodes? Hahahahaha", "score": 1, "replies": [{"body": "Interesting play, hope it works out for you, gonna sit on it for a few", "score": 1, "replies": [{"body": "Each option I posted yesterday will be worth six figures each if the stock goes to down 500% up overall since IPO 😜", "score": 1, "replies": [{"body": "So your bottom is at ~$168?", "score": 2, "replies": [{"body": "200 is my sell bottom for the short term (next two quarters) then 100 is my second bottom.\n\nThe scary thing is I have no way to know the level of margin calls that will be auto executed or how the machines will react... hence why it could be a penny stock in 6 months. Especially locked down.\n\nEarnings next quarter could be from 3 entire months of lockdown.", "score": 0, "replies": [{"body": "Interesting analysis, that's truly a YOLO so good shit", "score": 2, "replies": [{"body": "Trust me I’m weaoponized autism, my new hedge fund is going to be called WSB Bear Capital LLC. \n\nI’ll send the screenshots when I apply for the LLC and hedge fund license next quarter.\n\nSee how my posts get voted down? Bear cap always goes against WSB sentiment. \n\nEveryone is sure everything’s fine and the entire mortgage industry the bedrock of the economy is collapsing worldwide... I’m more bearish the more they get confident. We reached peak autism this week.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Or the retards that shorted at $900 and sold when it was at $300 3 months later... 😉", "score": 0, "replies": []}]}]}]}]}]}, {"body": "This fucking retard thinks fundamentals matter. Have you lived a second in 2020?", "score": 1, "replies": [{"body": "No is there more more mortgage defaults than any time in history? rents behind? and worldwide economic shutdown or something?\n\nThe fundamentals mater if you are burning cash like the joker and trying to “grow” right now hoping for revenues from small business.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "How do you think I got here in the first place", "score": 2, "replies": []}]}, {"body": "SPCE $30 C 05/15", "score": 3, "replies": [{"body": "If you bought that yesterday....to the moon!\nToday not so great.", "score": 1, "replies": [{"body": "But tomorrow!", "score": 1, "replies": []}]}]}, {"body": "Dude. Gld 210c 5/15. \n\nBecause I actually feel bad and want you to make money....", "score": 3, "replies": [{"body": "How this one gonna work", "score": 1, "replies": [{"body": "Like dis. Nobody know if market go uppies or downies.  Errbodee scurred kay? Ppl is like dragnz. Tryna get they BEST autist lizard brain. So. They buy gold. \n\nTL;DR: Market uncertainty + a LOT of cash = GLD go uppies. YUGELY.", "score": 2, "replies": []}]}, {"body": "How much are they?", "score": 1, "replies": []}]}, {"body": "Put 500$ on AMD calls if you know what's good for you. Chinese market is opening, Chinese investors are buying back in, Chinese company, Chinese profit.", "score": 8, "replies": [{"body": "AMD is in California.", "score": 6, "replies": []}, {"body": "Might just be a solid play", "score": 3, "replies": [{"body": "IV made 400$ this morning off 2 OTM identical amd calls that cost me 90$ initial investment", "score": 2, "replies": [{"body": "What positions you in", "score": 1, "replies": [{"body": "AMD 54$ expire 4/24 they were cheap this morning but I Believe a 58$ could print too", "score": 1, "replies": [{"body": "Copy, will look into this thanks!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Damn gg", "score": 2, "replies": []}, {"body": "So this is what it looks like to see a person go crazy. Huh.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Lmao", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Idk if this will work out seeing the current market", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Big if true", "score": 1, "replies": []}]}]}]}]}]}, {"body": "And that's how jack lived happily ever after (jack is my Friend who does not know what options are)", "score": 2, "replies": []}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. Find more YOLOs here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da. \n\nYOLO flair is for dank trades only. If you misused the flair please change it. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Send it to me.  I'll send you $5 back and save you a lot of wasted time.", "score": 1, "replies": []}, {"body": "Fuck dude, are you me?", "score": 1, "replies": [{"body": "Yup", "score": 1, "replies": []}]}, {"body": "Take out a loan and get back to 2k", "score": 1, "replies": []}, {"body": "SPY 285c 4/17", "score": 1, "replies": [{"body": "Already ahead of you SPY 301c 4/17 for giggles", "score": 2, "replies": []}]}, {"body": "GME $6c 4/17 just rip that bandaid right off.", "score": 1, "replies": [{"body": "Lord", "score": 1, "replies": [{"body": "You want a true YOLO go straight to 7.5.", "score": 1, "replies": [{"body": "Made a quick buck off this today but I’m staying off for now, thank you for your suggestion", "score": 1, "replies": []}]}]}]}, {"body": "Welp I’ll give this one for free but you owe me. Etsy calls anything $5 plus on current stock price one week out as many as you can", "score": 1, "replies": [{"body": "How much of a yolo is this sounds like there’s some DD behind it", "score": 1, "replies": []}, {"body": "I’m in", "score": 1, "replies": []}, {"body": "Not bad, their mask sales are booming for sure.", "score": 1, "replies": []}]}, {"body": "3k -> 1k -> 5k -> 250\n\nI’m all in on YOLO SPY 300c", "score": 1, "replies": [{"body": "My brother", "score": 2, "replies": []}]}, {"body": "Sending thots and prayers", "score": 1, "replies": []}, {"body": "AMZN 4/17 2500C, it's parabolic, or SPCE Calls hoping it break above 50 MA (You have volume on your side for this one).", "score": 1, "replies": [{"body": "Bruv", "score": 1, "replies": []}, {"body": "Any DD behind amazon call? Is it not overbought?", "score": 1, "replies": [{"body": "The point of FDs is hoping for people to FOMO and overbuy even more.", "score": 1, "replies": []}]}]}, {"body": "ZM $90 5/15", "score": 1, "replies": [{"body": "I like I like", "score": 1, "replies": []}]}, {"body": "Send it to my Cashapp", "score": 1, "replies": []}, {"body": "this is the way", "score": 1, "replies": []}, {"body": "Diamond hands is the dumbest strategy (or lack thereof) ever. You now need to make a 300% gain off of $500 just to get back to your original investment of $2000.", "score": 1, "replies": [{"body": "Correct", "score": 1, "replies": []}]}, {"body": "I bought a spy put with my last bit, welcome to join me", "score": 1, "replies": [{"body": "Normally I would, but I’m milking the bull this play.", "score": 1, "replies": [{"body": "You’re right. Probably changing tomorrow", "score": 1, "replies": [{"body": "Let’s see, basically my last stand at this point. Holding puts on DD brought me here, so hey 🙅🏼‍♂️", "score": 1, "replies": []}]}]}]}, {"body": "BBY 35P 6/15", "score": 0, "replies": [{"body": "SDOW $95C 6/19 !", "score": 1, "replies": []}]}, {"body": "TSLA 1200C - 04/24 going for 3.75 now. TSLA ER on 04/22 .... this will print. Oh yeah!", "score": 0, "replies": []}]}
{"title": "Your puts are fucked. But they really shouldn't be.", "selftext": " To kick off earnings season Wells Fargo reported revenue of 17.78billion, which was lower than the expected 19.35 Billion. WFC posted an earnings .01cents per share, which is down from an earnings of .93 cents per share from their previous quarter. Their net income also dropped a staggering 89% to $653 million for this quarter. \n\nJPMorgan reported revenue of 28.3 Billion, which was lower than the estimated 29 Billion. They also posted an earnings per share of .78 cents, well below the 1.84 estimates. \n\nBoth banks reportedly added billions to their reserves in anticipation for a high level of credit defaults from their customers and businesses. \n\n$GE, $DIS, $XOM and $WBA have all made moves in regards to securing and rolling over their credit, as fear grows that they’ll run out of credit to maintain their operations. XOM issued 9.5 Billion in debt, while DIS extended their credit line by 5billion dollars. \n\nCompanies such as $F, $M, $DAL, and $GPS, have seen their Corporate bonds ratings drop to Junk bond status. Although the Fed has announced that they will be making purchases within the junk bond market. \n\nSome estimates are predicting that the airline industry could take a 300billion dollar hit this year. \n\nVaccine manufacturers are under pressure to create vaccines faster than ever before, due to the belief that the economy can’t truly return back to normal until we have a vaccine. For every day the economy is shut down, it is estimated the US loses 25Billion dollars.\n\n**WeWork will not be paying their Manhattan rent for this month**, joining a growing list of companies who told their landlords they will not be paying rent. **WeWork is currently the largest tenant in Manhattan paying $500 million dollars a year in rent**. The Cheesecake factory, and AMC are other notable names who have also told landlords they will not paying rent. \n\nThis has all been seen as fantastic news to investors, and reason to be bullish. Markets have now regained about 50% of their losses from March after having their best week in decades last week, the NASDAQ is on its longest winning streak since December, and the S&P500 is trading at 35x earnings. $TSLA is back above $700, and most tech stocks are racing towards their ATHs.\n\nEdit *WeWork pays 500 million not billion a year for Manhattan rent.", "id": "g1bpb6", "created_utc": 1586891272.0, "score": 176, "upvote_ratio": 0.96, "num_comments": 85, "comments": [{"body": "It’s all priced in, including a nuclear war next month and an alien attack in July!!!!!", "score": 186, "replies": [{"body": "Bad news: priced in\n\nGood news: not priced in\n\n\nTherefore, stocks can only go up", "score": 64, "replies": [{"body": "This does seem to be how the market works.", "score": 19, "replies": []}, {"body": "this but unironically", "score": 13, "replies": []}]}, {"body": "Nah, the alien attack is in August. In July, Cthulhu will rise and level the eastern seaboard. All priced in.", "score": 4, "replies": []}]}, {"body": "The market is learning to expect more reward from bad news than good news. A guaranteed stimulus means there is no risk. No matter how bad their numbers are, Trump can't afford to have the headlines read,  \"Disney declares bankruptcy as market crumbles\". Thus, the market can make a confident bet that the worse the news gets, the more likely these companies are to receive additional stimulus to the point of overcompensation. These companies have the world's attention, and their earnings are nothing compared to what they can earn by firing all their employees and handing all the stimulus to executive management.", "score": 82, "replies": [{"body": "[deleted]", "score": 22, "replies": [{"body": "Just jack up the dividend to $10,000/share and \"barrow\" free money from the fed to pay for it. Net loss of $100/share who cares, the company is now a shell used to restribute fed money to shareholders", "score": 5, "replies": [{"body": "If only...\nThat would be a lovely outcome.", "score": 1, "replies": []}]}, {"body": "Ding ding ding", "score": 4, "replies": []}]}, {"body": "I hear what you're saying but that safety net is fake. We'll rally for a ridiculous amount of time, but there will be a day of reckoning. Probably.", "score": 29, "replies": [{"body": "The market can remain irrational longer than you can live. Or something.", "score": 52, "replies": [{"body": "Markets are retarded.", "score": 8, "replies": []}]}, {"body": "So long as inflation doesn’t affect consumer prices too much until covid is over, brrring, beliefe in future value, and people dumping their savings into “the dip” will make your puts worthless.", "score": 9, "replies": [{"body": "Well it won’t effect inflation at the street level because all the man on the street got was chump change. Equity markets are going to inflate and are inflating like a MF.", "score": 7, "replies": [{"body": "So jump in, ride the asset inflation, then cash out and buy a ton of non-inflated things of real value, let asset bubble crash, sell real value things, then buy cheap assets all over again", "score": 2, "replies": []}]}]}, {"body": "One day, probably long after your left anterior descending coronary artery blows out due to your diet of Wendy's and Mountain Dew Livewire, there will be The Big One.   Yellowstone will erupt, or some world leader will dial in the launch codes, or the universe will finally reach maximum entropy.   Then, the bears will be up bigly.  This day ain't it, and we all have to face it.", "score": 6, "replies": []}]}, {"body": "I keep seeing this but how?  The fed printing money literally cannot affect disney. The fed isn’t buying their debt or their stocks so tell me how.", "score": 7, "replies": [{"body": "They are giving free money to banks, who then are buying stocks with that money because interest rates are so low, there is nowhere else to put money. They should be lending it out to businesses but there is a lot of risk of defaults right now, so safer to put it into the market.", "score": 9, "replies": [{"body": "Is this based in fact or hunch?  I thought that when the banks were bailed out in 07 they couldn’t trade anymore they had to become “banks” not shadow banks", "score": 6, "replies": [{"body": "It is literally the entire point of QE. The fed creates liquidity by buying back low yielding assets off of the banks like treasury bonds. The fed does this to encourage banks to lend out more money because their liquidity is higher. Now that the bank has much more liquidity, IN THEORY they should go out and lend more money to people and business that are struggling. IN PRACTICE what happened after 2008 is banks took the extra money and used it to buyback their own stock inflating asset prices. \n\nSecondarily what’s been happening more recently with the persistent low interest rates is that fixed income yields have been basically nothing so that forces people (really banks, hedge funds, pension funds etc.) to chase yields further out on the risk curve. But since money is free because of QE there’s no place to find those target yields except in junk bonds which certain types of institutions are not allowed to hold (e.g. pensions) and the equities market (aka buying stocks). As a result institutions end up buying more and more stock causing the price to rise\n\nThis entire scheme inflates the fuck out of asset prices but doesn’t do a lot to help actual people (really if you’re a saving money you’re being hurt), but at this point it’s basically required to keep us out of a massive deflationary spiral (aka a depression).\n\nEdit: also important point. When the fed buys back these assets they can basically just use money they’ve created hence the printer meme. It’s like if you bought your auto loan back from the bank but using money you created out of thin air. That is what the fed is doing except with trillions of dollar.", "score": 14, "replies": [{"body": "Ok but if they are in fact only encouraging stock buying by driving down yields, there is absolutely a floor to that", "score": 2, "replies": [{"body": "1) the floor is much further than you think, just look at Japan. If the interest rate and stimulus floor were anywhere close to where we are, Japan would’ve collapsed decades ago.\n\n2) They fed isn’t just encouraging stock buying with yields. They’re mainly encouraging it by giving the banks cash for the assets they’re buying back. The fed is basically printing money then handing that money to a bank in order to buy back its own debt so it can go and print more money, then buy back more debt etc.", "score": 5, "replies": [{"body": "Hasn’t Japan’s stock market been stagnant for years now?", "score": 3, "replies": []}]}]}]}]}, {"body": "Nice theory but yeah.. proof?", "score": 3, "replies": []}]}, {"body": "brrrrrrrrrrrrr", "score": 1, "replies": []}]}, {"body": "Based", "score": 2, "replies": []}, {"body": "I agree, but do democrats want Trump to be able to campaign saying he saved the economy?", "score": 1, "replies": [{"body": "Their donors do", "score": 2, "replies": []}]}]}, {"body": "Haha, are my $BAC Bank of America puts also fucked?", "score": 24, "replies": [{"body": "I'm assuming they're going to have terrible earnings. So yes.", "score": 48, "replies": [{"body": "Good my calls are shit today lmao", "score": 8, "replies": []}]}, {"body": "I bought some calls with my puts just in case", "score": 5, "replies": []}, {"body": "BAC already made a big movement downward today around the time of WFC conference call. I would say priced in. Market already made it's reaction, I would be careful here.", "score": 3, "replies": [{"body": "Which call? Why do you think prices in?", "score": 1, "replies": []}]}]}, {"body": "WeWork pays $500 BILLION/year in rent?!", "score": 13, "replies": [{"body": "Correction it's 500 million*", "score": 11, "replies": []}]}, {"body": "Basically free money given to banks, who loan free money to investment institutions, who run up these shitty companies with their free money. The only stocks not going up now are REITs hmmmmm.......", "score": 6, "replies": [{"body": "I've noticed this as well. Do you have any thoughts as to why?", "score": 3, "replies": [{"body": "I am guessing expected mortgage problems incoming which have not been addressed via the stimulus payments", "score": 5, "replies": []}, {"body": "Probably has something to do with all these companies saying they won’t be paying rent...", "score": 2, "replies": []}, {"body": "Why? ⅓ of renters didn’t pay their rent this month and commercial re is dead nobody’s paying rent", "score": 1, "replies": []}]}, {"body": "Which reits are u looking at?most of them have gone up in last 2 weeks", "score": 1, "replies": []}]}, {"body": "BEARS R FUK\n\nBULLS LET U PLAY OUTSIDE FOR A MONTH\n\nBULLS R BACK\n\nBEGONE GAY", "score": 18, "replies": []}, {"body": "Sir, this is a Circuit City", "score": 10, "replies": []}, {"body": "And.....\n https://wwwnc.cdc.gov/eid/article/26/7/20-0282_article\n\nIt's twice as contagious as the models suggested.", "score": 9, "replies": [{"body": "Market don't care", "score": 9, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "You think Manhattans largest tenant suddenly not paying any rent and completely going bankrupt would have no affect at all? It's just a cascading effect that would lead to worse in my opinion. But no its certainly not tied directly to the entire US economy.", "score": 3, "replies": [{"body": "I think using WeWork to predict a depression is the same as using Sears to predict a depression. these are businesses that would be failing in bull markets", "score": 4, "replies": [{"body": "That's a good point.  Successful short sellers work hundreds of hours a week to find the most garbage companies imaginable to short.  They don't just swing-trade an index based on the headlines and anyone who tries this will go bankrupt.  WeSuck and Ford are in the headlines because those companies are teetering on the brink of death in a healthy economy.", "score": 3, "replies": [{"body": "Ford has been on the verge of death forever. They survived the 2008 financial crisis without government assistance, they'll weather this storm.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I do agree that we're heading into a mortgage crisis. In a few months, when we hit bottom, I might invest in some REITs. It's the best that i can do when i dont have enough money to actually buy real estate", "score": 1, "replies": []}]}]}]}]}, {"body": "But my puts are 5/15, not 4/17 like you impatient tards.", "score": 3, "replies": [{"body": "Man it feels like yesterday when 4/17 puts seemed so far out", "score": 11, "replies": []}, {"body": "June gang here, still confident.", "score": 3, "replies": []}, {"body": "I don't think any puts are printing until September", "score": 1, "replies": [{"body": "Why September? Q2 earnings in July, second wave predicted in October-November.\n\n[https://cleantechnica.com/files/2020/03/Imperial-College-COVID-19-report.png](https://cleantechnica.com/files/2020/03/Imperial-College-COVID-19-report.png)", "score": 1, "replies": []}]}]}, {"body": "All Priced in Bro! chill! buy Calls and shhhhhhh, money printer go Brrrrrrrr.", "score": 4, "replies": []}, {"body": "There is no \"should be\" in life. There's only what is. Accept that fact and find yourself happier (and smarter) for it!", "score": 2, "replies": []}, {"body": "\n\nLet's look at Wuhan. They have reopened the city, have opened the malls, people are back to work. The quarantine seems to work with mass surveillance.\n\nWhat has happened here in Amerixa and making companies bull? \n\nComplete retooling of corporations to trim their books and retrofit their companies with new technology for the shut-in economy. Guess who's paying for it? The government aka you. \n\nA corporation no longer has to pay their rents, pay their employees, can default on their loans, etc. They can start retrofitting their businesses with technology, automation, robotics, etc. \n\nWe are seeing the cleansing of a cumbersome job force, benefits, pensions, etc. Without a whimper from their employees.\n\nThe biggest losers are the 9-5ers. They are completely fucked and dont havent cultivated the entrepreneurial & inventive skills to weather the coming storm, which is a digital & solution shut-in economy. They'll be reliant on the government, mafias or someone else for hand outs. \n\nThe people who've been obese or unhealthy will die out from this disease. These motherfuckers wanted this disease to ride out, so you will openly accept an authoritarian surveillance government.", "score": 2, "replies": [{"body": "That last part is my real fear- I do not want any fucking China-esque surveillance programs being slipped in some bill under the guise of protecting public health. The shit they already have in China is wild, and the social credit score is only a part of that.", "score": 2, "replies": [{"body": "Yeah well look at 9/11 and all the stuff that's normal now. \n\nTSA, PRISM, punishing Whistleblowers, Donald Trump.", "score": 2, "replies": []}]}, {"body": "U  nailed it", "score": 1, "replies": []}]}, {"body": "no. They are fucked and should be. The wsb way.", "score": 2, "replies": [{"body": "Meow", "score": 5, "replies": [{"body": "sadly saimese cats don't sound pleasant. It is more a rarrrrrguh@$!#%#^@", "score": 5, "replies": [{"body": "We are Siamese if you please", "score": 2, "replies": []}]}]}]}, {"body": "No home Jerome needs to chill the fuck out soon. Unlimited QE does not work it kills natural price discovery, look at Japan you sleezy fucker. Brrrrr for 30 years and nowhere near ath. The bleeding HAS to come soon.", "score": 1, "replies": []}, {"body": "JPM and WFC need to get their puts in thats all. With so much missed revenue they need to get the market up again before they drop it off a cliff.\n\nI anticipate the market to just keep climbing until the first household name goes under. Question isnt if the market goes up, its will we be at an ATH by the time that happens or not. If it takes longer than 90 days for a household name to go under I expect ATHs before then.", "score": 1, "replies": []}, {"body": "Investors think \"Ok, it's not so bad, to the mooooooon\".", "score": 1, "replies": []}, {"body": "all this buying pressure is just people who sold options buying to cover. In that case this minor run up could just be a short squeeze. :/", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Word for word what was said on CNBC maybe they meant to say Million.", "score": 1, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Do you have a source or are you just going by what your retarded brain thinks is correct?", "score": -6, "replies": [{"body": "[deleted]", "score": 4, "replies": []}]}]}]}]}, {"body": "You morons think low wage schmucks at Panda Express not having a job impact the economy? Ok boomer.", "score": -5, "replies": [{"body": "Those are the folks that funnel 125% of their earnings back into the economy though", "score": 7, "replies": [{"body": "Ok, great. 125% of 40k a year? It is still pennies.", "score": -2, "replies": [{"body": "considering that about 45% of the population makes 40k or less that comes out to just under 6 trillion dollars a year you mongoloid", "score": 7, "replies": [{"body": "Learn the 80/20 rule you dumb fuck.", "score": -9, "replies": [{"body": "how does that even apply here you fucking idiot", "score": 7, "replies": [{"body": "This is like saying oh shit 40% of people arent paying taxes so we have 40% less tax for the country.\n\nIt isnt linear you dipshit.\n\nEdit: seriously you are so fucking stupid", "score": -7, "replies": [{"body": "completely ignoring the means of production here you are trying to tell everyone that a 45% workforce cut isnt going to do much to the economy\n\nits laughable that youre calling me stupid", "score": 4, "replies": [{"body": "Whoa, whoa, whoa. I would never call you an idiot. I called you a dumb fuck, dipshit, and stupid.", "score": -7, "replies": [{"body": "alright now go and tell your mommy how you told off the big bad man since you clearly dont have anything else to add", "score": 4, "replies": []}]}]}]}]}]}]}]}]}]}]}
