{"title": "Costco puts?", "selftext": "With target and Walmart getting hammered by inflation and large drops after earnings, I imagine Costco would be next on the chopping block? They have the PE of a fast growing tech company and we could see a larger percent drop in earnings as a result of that. Thoughts on my hypothesis?", "id": "ut41cp", "created_utc": 1652968734.0, "score": 25, "upvote_ratio": 0.71, "num_comments": 87, "comments": [{"body": "Costco dropped 15% right before you posted this. You’re late.", "score": 108, "replies": [{"body": "It was crushed yesterday in sympathy with Target.", "score": 36, "replies": [{"body": "Is it late? TGT and ROST were not baked in after WMT. The majority of price action comes *after* earnings (i.e. information) is released. Before that is only speculation. COST may have more to go, with a higher PE, but we've all heard the refrain - COST is a subscription service.", "score": 1, "replies": [{"body": "WMT dropped about 18% this week, TGT dropped about 28% and Cost has fallen about 14%.   The PE is pretty high on COST compared to BJ, WMT or TGT - so that may have some downside potential if outlook isn't really strong.  If they miss, it should get crushed further.", "score": 3, "replies": [{"body": "You're missing my point, that TGT dropped *after* reporting results. It didn't puke on the day WMT reported. Models are updated *after* information comes out, not before.", "score": 1, "replies": [{"body": "Are you trying to say stocks don’t make sympathetic moves? Roku dropped when Netflix reported earnings. I feel like I must be misunderstanding you because this is not controversial information.", "score": 1, "replies": [{"body": "I'm saying that the real bulk of TGT's drop was after they reported earnings, not after WMT reported. Obviously the drop in profit was not priced in.", "score": 1, "replies": []}]}, {"body": "Look at the chart of cost when TGT reported.  Some of the downside potential has been taken out already.", "score": 1, "replies": [{"body": "Again, not fully priced in *if* COST is affected by the same issues. TGT dropped 25% after reporting results. ROST cratered today - FL, DECK are up. There may be preemptive selling but the bulk of price action happens after a company releases its own report.", "score": 1, "replies": [{"body": "https://www.daytradetheworld.com/trading-blog/sympathy-play-stocks/#What_is_a_sympathy_play_in_stocks", "score": 1, "replies": [{"body": "The majority of price action in TGT occurred after their earnings report.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "yeah it might have more to go but puts are expensive now not worth the theta decay unless it plunges 25%+ which I doubt.", "score": 1, "replies": []}]}]}, {"body": "But what if it goes down more?", "score": -9, "replies": [{"body": "Sure, it could. I just don’t think after a 15% drop is a good time to buy puts. I’d personally look elsewhere for a play.", "score": 28, "replies": [{"body": "I think it’s still over valued and it’s hard to justify a 40 plus PE for a retailer in the current environment. It could have a solid rebound though with good earnings. Who knows..", "score": -4, "replies": [{"body": "A drop pf 15% increases the premiums too much", "score": 10, "replies": []}, {"body": "You need to understand that costco makes all their income off of selling memberships.  They basically sell all the goods in the store at cost hence the name Costco.  So if you believe that people are going to cancel their membership and leave in droves than good idea however if people might shop less but still keep membership probably not the best bet.  \n\nI don’t go often but always have a membership just for the tire centre at the very least.  Roadside warranty and free balance, rotation, tire swap.  I buy my summer and winter tires there so they swap them for free.  Can’t get tire swap and rotation done at any garage for cheaper than annual membership at costco.", "score": 20, "replies": [{"body": "They don’t sell shit at cost. I don’t know who told you that. They have loss leaders like hotdogs and chickens but they make a profit on most everything else.", "score": 13, "replies": [{"body": "Do your research, google it, the margin on costco items is around 11% compared to retailers like walmart who are in the low 20s, there is overhead costs that need to be covered that eats up that margin.  Look at the profit they make from memberships vs that and it is a rounding error", "score": 3, "replies": [{"body": "Yeah, no shit lower margins. They sell in a bulk. Costco is basically a wholesaler.", "score": 2, "replies": [{"body": "You are arguing against every analyst that covers this stock, they all say it repeatedly,\nIt no secret that costco overwhelmingly makes their money from membership fees.", "score": -5, "replies": [{"body": "? you're the only one saying costco sells shit at cost, no one is saying that lmao, lower margins is not at cost??? everyone knows costco makes their money from membership fees??", "score": 2, "replies": [{"body": "https://www.thestreet.com/.amp/investing/buying-or-selling-costco-stock-these-are-the-numbers-that-matter\n\n\"In 2019, Costco made $3.35 billion from membership fees, an increase of 7% from the previous year. Its entire net income for the year was $3.66 billion.\"", "score": 0, "replies": []}]}]}]}]}]}]}]}]}, {"body": "You'll pay big premiums after the recent drop, even more might not be enough. You're late to the party, should have bought a leaps put at 600+ and then hoped that what just happened did.", "score": 4, "replies": []}, {"body": "It's already priced into the option with an inflated IV", "score": 2, "replies": [{"body": "You're looking at an IV of 76, you could do a credit spread to capitalize on IV crush though...\n\nNot advice just an idea", "score": 3, "replies": []}]}, {"body": "Buy some puts then, nobody here is stopping you.", "score": 2, "replies": [{"body": "Time to find out about this IV crush people like to talk about", "score": 0, "replies": []}]}]}]}, {"body": "BJs beat...so probably beat too. I had puts and it didn't turn out well.", "score": 23, "replies": [{"body": "What I am wondering is how did BJs do so well when retail in general has been taking huge hits due to lower margin?", "score": 5, "replies": [{"body": "I’m unfamiliar with them so maybe if they are a more upscale wholesaler they feel less inflationary affects as their shoppers have more money to spend then the average person.", "score": 1, "replies": [{"body": "I think they’re similar to Costco - a big box, membership club store.", "score": 5, "replies": [{"body": "I just got a membership to BJs, use to have one for Costco. BJs is similar, def not \"upscale brands\" but it may have a few more options per isle. It could also be that big-box stores are able to weather the supply crush as consumers may have picked them over target/Walmart. And with the cheaper gas prices they offer its a two-for-ones saving advantage for their consumers.", "score": 7, "replies": [{"body": "Thanks for sharing.  I think it's sort of Walmart is to Target as Costco is to BJs.  How that translates to it upcoming ER, I'm not sure but $COST was crushed this week in sympathy already.", "score": 3, "replies": []}]}]}]}, {"body": "Yes, I too wonder. They are a bit different. They have more bulk buying. However, I saw that has possibly more of a problem. Looks like I was wrong. Interesting to see what happens with Costco.", "score": 1, "replies": []}]}, {"body": "Interesting, I’m surprised they posted such great earnings. I think one thing that separates their values is that BJ has a much more modest PE compared to Cost.", "score": 3, "replies": [{"body": "PE or not, if they beat, puts are going to be worthless. But if they miss, yes that will make it move down more. I'm watching it for sure. Took the loss on BJs, so I don't want to test it myself.", "score": 6, "replies": [{"body": "I think I’m just gonna buy a cheap OTM put and see if I get lucky with a large drop like target.", "score": 2, "replies": []}]}]}, {"body": "do you do cryptocurrency", "score": 0, "replies": [{"body": "Nope", "score": 1, "replies": [{"body": "I think you should try cryptocurrencies", "score": 0, "replies": []}]}]}]}, {"body": "I really wanted to get in on this play but I have certain timing restrictions with work. Here’s my input. Some say its already priced in, which is somewhat true but look at target. It dropped 5% in sympathy with WMT before getting slammed yesterday. I think COST has room. It fell about 15% and PE is still inflated as you noted. \n\nMy big concern was whether their gas business would be a cash cow and keep them afloat for earnings. I took a look at the 2010 v. 2011 v. 2012 earnings, the year in which crude oil reflected similar pricing $80/barrel to $100+/barrel from 2010 to 2012. Gas is on of their ancillary businesses, with concessions, tires, car washes(?), photo, pharma, etc. together making up 18% revenue. Small number. \n\nLooking at ‘10-‘12, they actually did relatively worse as gas prices increased, indicating they sell gas at a markdown to consumers, or at least it doesn’t inflate their earnings. So I was comfortable writing this off. Note that they had ~25% increased sales of gas but gross margin *decreased* due to gas prices. No cash cow here. Caveat is if they started playing with gas futures and struck hypothetical gold. \n\nSo you’re left with the factors impacting their core business. Namely, COVID (whether people are still stock piling), potential for a recession (will members buy less bulk to spend less, or more to save) and member decline (they have a 90% member retention rate). Also supply issues across the board which was partially an issue for TGT, due to broad “consumption mix.” I have no clue how to interpret this and would leave this to you as the key point about whether it would apply to COST. All in all, if I could buy 0DTE puts on COST, I would be in it. Buy a couple calls to offset. The g/l either way will pay for it.", "score": 13, "replies": [{"body": "Awesome reply. I just kinda feel this earnings is a gamble with possible high reward so I’m gonna buy a cheap put on it and see what happens.", "score": 3, "replies": [{"body": "The CEO also cited a changing product mix as the Covid-19 pandemic abates. Customers who bought television sets or kitchen appliances last year might be purchasing restaurant gift cards or luggage for upcoming trips this year, he said. \nThe value of Target’s inventory surged 8.5% from the previous quarter and 43% from a year earlier. Retailers generally try to avoid piling up inventory because it can incur costs. Target said inventory impairments were a factor in the company’s lower-than-expected profitability. \n\n[bloomberg TGT earning article](https://www.bnnbloomberg.ca/target-cuts-profit-outlook-on-hit-from-unexpectedly-high-costs-1.1767527.amp.html)", "score": 3, "replies": []}, {"body": "I think that’s the way to go. Worst case you lose a few dollars. Let’s say you pass for something more conservative (I.e., value play, long stock). You’re still going to lose money, albeit unrealized, in this bear market. Good luck!\n\nEdit: trying to avoid confirmation bias for you. Take a couple minutes to look into “consumption mix” which TGT continuously cited as the cause for their miss, and consider if that would apply to COST.", "score": 2, "replies": []}]}, {"body": "Very very insightful and with real analytics.  \n\nGood strategy on the calls / puts (minimal investment)\n\nAm so torn on COST\n\nHad bought 3 six month leap options in October at a minimal investment …and went up $15,000 in four weeks..was crazy (of course sold them)\n\nWith it going down so much again was eyeing again…probably better to play it safe right now.\n\nThanks again for the great input— the PE part is really compelling as well", "score": 3, "replies": [{"body": "Do you do cryptocurrency, if you do cryptocurrency short-term investment will quickly achieve your goals", "score": -1, "replies": []}]}]}, {"body": "i pay 120 a year for costco membership and get 2% back\n\nnormally per year i am spending like 4k\n\nthis year already probably exceeded it with new tv shredder air conditioner pots pans moving into a new place. probably spent 5k already\n\npoint is i go to costco and i like what i see. i saw 30\" kitchenaid stove and i was like damn that could have been mine..\n\ntarget. i go there to get orbit wintermint chewing gum, recycling bags, coat hangers ..\n\nbut they dont have my chewing gum so i leave and buy nothing\n\nthey gotta stock their shelves better\n\nwhy in the last two years does target not reliably stock orbit wintermint gum?", "score": 8, "replies": [{"body": "we found it. orbit wintergreen gum is the lowest common denominator on whether a place survives or crashes. time to do some correllation research", "score": 3, "replies": [{"body": "lol", "score": 1, "replies": []}]}, {"body": "Do you do cryptocurrency, if you do cryptocurrency short-term investment will quickly achieve your goals", "score": 0, "replies": []}]}, {"body": "It already dropped 15%. Premiums on puts are too high. Costco is also one of the least-affected businesses in economic downturn/uncertainty; they just have to retain memberships. Long hold shares of the almighty $COST", "score": 7, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Since you didn't seem to get it: the premiums are too high for this guy to make a lot with his hypothesis. Sorry about your reading comprehension 😵‍💫", "score": 0, "replies": []}]}]}, {"body": "Never bet against Costco", "score": 4, "replies": []}, {"body": "Costco is really in charge of their own supply chain. I wouldn’t bet against Costco at all. Especially after BJ’s print.", "score": 4, "replies": []}, {"body": "You’re better off throwing your money in the sewer", "score": 3, "replies": []}, {"body": "Costco controls their supply chain unlike anyone. They have their own ships.", "score": 4, "replies": []}, {"body": "Don't listen to other people go with what u think man,  I'm thinking about buying otm call options on tqqq rn just cause we might see a jump at this qq level", "score": 6, "replies": [{"body": "Exactly this.\n\nHonestly though, if you have a plan then trade your plan. Don't come to r/options for ideas on the trade. Just make sure you have proper stops in place in case you get smoked and you should be fine.", "score": 3, "replies": []}]}, {"body": "I'm actually hoping IV drops and Costco trades sideways for a bit. I'm pretty sure Costco has better cost controls, better merchandising sense, and a better business model than TGT and WMT. I think COST could be in for a big upside surprise if they prove to the market that they're just better at navigating this stagflationary environment.  Might even buy a few shares at open tomorrow.", "score": 3, "replies": [{"body": "Do you do cryptocurrency, if you do cryptocurrency short-term investment will quickly achieve your goals", "score": 0, "replies": [{"body": "Spam bot", "score": 1, "replies": [{"body": "I'm not a robot, I'm just giving my advice", "score": 1, "replies": []}]}]}, {"body": "Costco is a cult. I've got some ATM calls.🙂", "score": 1, "replies": []}]}, {"body": "Costco should do well in a recession and most of their profits are through memberships.", "score": 2, "replies": []}, {"body": "And the Universe will make costco Rocket 30% after good ER just to spite you.", "score": 2, "replies": []}, {"body": "But going forward they have something that only BJ’s has. They have a subscription pricing that can improve their bottom line a la Amazon Prime, BJ , etc . That’s why in spite of their 10 point hit , they were able to bounce back over five points today. \n\nI’d say selling cash covered puts would be a good move perhaps with a protective collar to stop  a sudden thrashing from a steep drop.", "score": 2, "replies": []}, {"body": "Retail by and large is getting hosed but Costco is definitely the one that could surprise heavily. They literally rented their own container ships to keep their supply chain intact.", "score": 2, "replies": []}, {"body": "Maybe Dollar Tree/General instead?", "score": 2, "replies": []}, {"body": "Dont compare Costco with Target. Their membership base is solid but if the lost memberships or growth in those numbers slowed down it would hit their stock more than the supply chain issues. Honestly, I would prefer COST over WMT or TGT any day. Solid company which continously beat analyst expectations", "score": 2, "replies": []}, {"body": "they just build and almost finished costco within 2 months in my city. gonna be open next month.  idk if that got to do with anything. but just sharing.", "score": 2, "replies": []}, {"body": "BJs is more vanilla with every day family necessities and as cheap or cheaper gas with all specials they run on giving discounts with food purchases.\nCostco has a lot of of crap that won’t sell in a recession or highly inflated priced market.", "score": 2, "replies": []}, {"body": "calls", "score": 1, "replies": []}, {"body": "Kicking myself, bought puts back in Jan I think on COST with a June 15th strike at 590, for $14, closed it out when it broke out from old highs, *sigh*", "score": 1, "replies": []}, {"body": "Because of Costco’s large recent decline, IV is high, so puts might be dangerous. If you think it’ll keep going down, try a call credit spread. If I were making the play, I would sell a call credit spread well in the money, so the price could go up slightly and it would still be profitable. This may be a safer bet because their expected poor performance is likely priced in already.", "score": 1, "replies": []}, {"body": "My $79 puts for ROST are going to look good in the morning. $105 AMAT put looked good for a hot minute", "score": 1, "replies": [{"body": "Is your expiration for that tmrw or 5/27 because I was thinking about buying puts for ROST", "score": 1, "replies": [{"body": "Tomorrow", "score": 1, "replies": []}]}]}, {"body": "LOL COST always beat earnings, but if you wanna gamble and become addicted then be my guest.", "score": 1, "replies": []}, {"body": "Well they did raise their hotdog price by $1", "score": 1, "replies": []}, {"body": "Yep. Will drop to 370-370 area. More room for downside", "score": 1, "replies": []}, {"body": "What about Kroger?", "score": 1, "replies": []}, {"body": "Does anybody use the benzinga options newsletter? I’m thinkin about trying it", "score": 1, "replies": []}]}
{"title": "$AAPL to $60 a share?", "selftext": "I was watching CNBC tonight and it was the Chartmaster segment with Carter Worth.\n\nAfter him they had a frequent analyst guest on but I forgot his name.  \n\nAnyways the second guest was talking about AAPL and that it's historic pe is about 16 and that he thinks it could even get down to 10 PE?!\n\nSo I figured it out and if I'm correct this puts AAPL at a little more than $60?\n\nThis would mean about a 60% fall from here.\n\nWhat's your opinion on this?", "id": "usrao4", "created_utc": 1652921313.0, "score": 0, "upvote_ratio": 0.46, "num_comments": 87, "comments": [{"body": "If Apple were to hit $60 it's very likely that earnings plummeted, a P/E ratio of 10 seems low.", "score": 18, "replies": [{"body": "Right but if the whole market sells down maybe it could hit 10.", "score": -11, "replies": [{"body": "While possible when you have a recession earnings drop as well, if you look at 2008 for instance some companies had P/E of 100, not because the share price was so high but because earnings were terrible.", "score": 4, "replies": []}]}]}, {"body": "I think a 10 PE seems extremely unlikely.  If there was a literal depression - sure.", "score": 28, "replies": [{"body": "I think the guest analyst was saying 16, but he did say it could maybe hit 10pe.", "score": -3, "replies": [{"body": "well i mean shit i didnt realize their one of a kind special analyst could see into the future especially with the absolute concrete science that is technical analysis\n\napple to 60 it is!", "score": 2, "replies": [{"body": "He knows more than you!", "score": -9, "replies": [{"body": "The people that are talking generally are the ones that actually don't", "score": 2, "replies": [{"body": "Tell that to Bertrand Russell....", "score": -3, "replies": []}]}]}]}]}]}, {"body": "Reason you hear people claiming something might be even worse than historical norm, is because its going to be worse. You see it happening already. Look at Target. Future earnings are becoming worthless if not massively able to negate assumed levels of inflation, cost of financing, labor, inventory, etc. Their earnings were bad...but they lost 1/4 of value over 1Q of bad earnings.\n\nThey were also like major factor in todays drop. Retail is down, not horrible, but relative to shit not even adjusted with current inflation, let alone future, and markets were looking to them as a key guage (and wal mart too) in what to expect this yr. But marginal demand from consumers as we start to watch our paychecks shrink, profits become worth less, expenses cost more, etc...eh.\n\nApple @ 60ish doesn't sound insane if next yr they can only sell half their phones, which cost 25% more to produce (exaggeration...just saying tho)", "score": 8, "replies": [{"body": "Your outlook is nothing new..... Good luck", "score": -7, "replies": [{"body": "Um...not so much an outlook as literal reality outside my exaggeration for emphasis, but yeah good luck man. Was just meant to give context.\n\n**Edit:** Would recommend...watching CNBC is not going to help. I am being genuine here too. They are like...for the masses to pump/dump shit to and basically low knowledge.\n\nWatch Bloomberg at least, just know they manipulate also, but much more subtle and at least you do get valid data and much broader range of info.", "score": 4, "replies": [{"body": "I'm 45% cash.\n\nThinking of mostly energy and stuff.", "score": -2, "replies": [{"body": "Here is the mistake I'm seeing over and over.\n\nGrowth is on fire sale, and energy is likely overbought. You should have been buying energy 6 months or a year ago, not now. I'm holding energy stocks but I bought them about 18 months ago and held through a couple fairly sharp downturns.\n\nI don't think people are thinking clearly in this market. They are refusing to look at anything that's beaten down, and they're too rosy eyed over things that have been performing well. That ultimately reverses every single time.\n\nI think you're playing with fire with your mindset at the moment.", "score": 6, "replies": [{"body": "Energy still has a lot of room to run. Oil going to 180 according to one analyst.\n\nI'm not only in energy, but it's 10% of my portfolio.\n\nNothing is on sale! This markets going to 3200 in July!", "score": -1, "replies": [{"body": "Oil is going to 180 according to some analyst. Shopify was going to 3,000 according to another analyst. Amazon was going to 5,000 by end of 2021. Analysts are not what you should be paying attention to when investing. No one predicted oil going negative in 2020, no one knows if it gets anywhere close to 180.\n\nAs far as nothing being on sale, I think you're wrong. We have many profitable  companies right now with insane margins and growth, trading at PE levels half of what you'll find with companies stuck in negative growth. That's not typical, it's actually very strange and an opportunity IMO.\n\nYou do you man. I think you've got it ass backwards, just like the people selling oil in 2021 and buying growth companies that were blowing through the roof. Stop chasing the hot ticket and take a look at what has been unfairly beaten down. If you're looking in the right places, you'll find them.", "score": 3, "replies": [{"body": "Oil demand will go higher and higher and there is short supply. You do you !\n\nI have INMD PYPL and UPST that are beat down. I have a very diverse portfolio.  You have no idea what I hold! I also have VTI and QQQ!\n\nI'm 45% cash waiting for 3500 sp500!\n\nGet a life you aren't as smart as you think you are!", "score": -1, "replies": [{"body": "I'm not commenting on your portfolio, I'm commenting on what you think is a buy at this very moment. For all I know our portfolios look very similar.\n\nI also didn't come into this claiming I'm smarter than you or anyone else. Just giving my opinion which is exactly what you asked for isn't it?\n\nThat said, you're following the advice of \"some oil analyst\" and the Chartmaster from CNBC, so... I don't know how to finish that sentence kindly.", "score": 3, "replies": [{"body": "Cramer on Mad Money tonight said \"Buy oil on any weakness\".\n\nOil is a good investment for this year and probably next year also.\n\nI'll hold.\n\nI've heard countless times on cnbc that you should be in energy and healthcare.\n\nMy UNH is still up 40% from when I purchased my initial shares 1.5 years ago.\n\nIt's averaged a 22% CAGR since 1990.", "score": 1, "replies": [{"body": "And now you're quoting Jim Cramer.\n\nAt this point I feel like I'm being trolled.", "score": 1, "replies": [{"body": "Someone said the same thing about energy 2 months ago to me when I bought DVN at $59.  2 months later up almost $2000 in my position.\n\nI also have a 5% trailing stop and it's in my roth so there are no taxes on sales with a profit.\n\nI also have an energy etf that is up about $500 with a 5% trailing stop.", "score": 1, "replies": [{"body": "I'm not an energy bear or anything, I have decent sized positions there. My only point is that (in general) the best investments are made buying beaten to shit companies and holding. Buying energy now feels a bit like buying Apple at 180 a few months back. Of course it could keep going, but it's already flown so high that the risk/reward is skewed.\n\nI seriously wish you the best of luck, I'm not trying to rail against you. I do think, however, that listening to advice from CNBC idiots is the wrong strategy, and I think you'd be smart to take a closer look at growth. The idea at all times when investing is putting your money where it's likely to earn you the most appreciation. My opinion is mega caps, large caps, energy, retail, etc are not the best allocation at the moment. I think it's growth by a mile. I could obviously be wrong, we'll see down the road.", "score": 2, "replies": [{"body": "I'm mostly diversified. I have 10% in UNH as my largest position and so far it's holding up.\n\nAll i know is that UNH has a CAGR of 22% back to 1990 and has beat the sp500 since then.\n\nI also have a little TMO and SHW.\n\nHave some HD COST UNP NEE and ODFL.\n\nSome MSFT GOOGL NVDA CRWD PANW\n\nMy AAPL is 103 basis \n\nThen I've got some small positions in INMD VTNR PYPL UPST etc.\n\nI'm making my ROTH mostly FSKAX which is Fidelity's total market mutual fund.\n\nAnd some of ROTH is also a Fidelity healthcare mutual fund.\n\nI'm 40% cash though right now and will average down slowly over the next month's if we fall or particular stocks fall to better entries.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Just edited last comment. Just a recommendation if you have access to it as an alternate to CNBC", "score": 2, "replies": []}]}]}]}]}, {"body": "Stop watching Jim Crater", "score": 15, "replies": []}, {"body": "This is why using historic pe is not particularly useful and misses a lot of the picture", "score": 10, "replies": [{"body": "\\> Markets are forwarding looking!\n\n\\> Let's use historic PE to justify our forward looking perspective!\n\nI mean, you could use historic forward earnings as a baseline to see how far APPL has deviated from that and its correlation to price movements. But.... Doubtful the analyst is that nuanced.", "score": 2, "replies": [{"body": "Pe is just not the full picture", "score": 0, "replies": []}]}]}, {"body": "This guy should change his name to Carter Worthless..\n\nI watched his video from 2019 and he said to sell AAPL at $64ish (presplit)! For some reason he's super bearish on AAPL.. maybe to swoop up our shares on the cheap? \n\nAnother gem: on Dec 13 2021 he said it was time to buy the shanghai index etf (FXI) @ $37 and now it's $29.. \n\nLast summer he said to buy WMT and sell COST while they both do the opposite what he said.. lol", "score": 3, "replies": [{"body": "😆", "score": 2, "replies": []}, {"body": "Did he have good calls?", "score": 1, "replies": [{"body": "I see no evidence of it... He just talks nonsense 😂", "score": 1, "replies": []}]}]}, {"body": "It could happen if apples growth slowed to negative or 0 like Cisco today. Personally though, I believe apple is still growing and expanding rather than contracting in terms of their business. The services business is new and growing, so are the AirPods, and potentially they could make new products in the future. So yeah 60 or 200 are both fair guesses", "score": 3, "replies": []}, {"body": "Then tesla will be $90.", "score": 2, "replies": []}, {"body": "Apple also had revenue growth of 1-5% and 90% was related to hardware.  There revenue stream is now more diverse.\n\nPpl also thought smart phones would eventually reach terminal value like what happened to computers.  Android and samsung were bigger threats.   Tim cook was a bad ceo and only good at supply logistics.  Apple not innovating.  Common criticisms back then.  \n\nI think apple is overvalue but the apple 5 years ago is not the same as today.  Their ecosystem is incredibly powerful and moaty.  \nThe black swan for apple would be china.", "score": 2, "replies": []}, {"body": "My take: if everybody runs in one direction (out of tech and into energy, oil whatever) it's usually a good idea to go the opposite way if you can stomach the volatility - you'll come out ahead long-term!", "score": 2, "replies": [{"body": "I just stay diverse.", "score": 1, "replies": [{"body": "\"Diversification may preserve wealth, but concentration builds wealth.\"", "score": 1, "replies": [{"body": "And can destroy wealth....", "score": 2, "replies": []}]}]}]}, {"body": "Wouldn’t surprise me. Maybe by 2023. I honestly feel like we are headed for one of the biggest crashes we’ve ever seen", "score": 5, "replies": [{"body": "Sunny optimism, that's the ticket.", "score": 10, "replies": []}, {"body": "That's what they always say..... But I'm glad I'm 45% cash right now!", "score": 1, "replies": []}]}, {"body": "If you look at Apple's charts.  $60 after all the splits would only put it down to Oct 2019 highs.  Why is this unreasonable?  How many other stocks have we seen fall? Apple has a lot of headwinds.  Where are they getting their microchips from? At what price?  There is regulatory headwinds.  How long until they are broken up? They have a near monopoly on smart phones and their e-commerce store.  I don't think $60/share is unreasonable at all.", "score": 3, "replies": [{"body": "This certainly seems possible.  I think highly-regarded companies like Apple have a bit of \"thick skin\" on the front side of corrections and bear markets.  If it becomes clear that everyone is going down with this ship, Apple could see accelerated price drops.    \n\n\nI will say that, if Apple drops to $60, I know what I'm buying.", "score": 11, "replies": [{"body": "Damn right! I'd load up at $60!", "score": 3, "replies": []}, {"body": "I will be as well.  I am just stating that $60 isn't unreasonable & out of the realm of possibilities.  A pullback to 2019 stock prices with everything tanking is possible.  Right now everyone is putting their cash in what they considered safe . Before the last 2 days it was Coca-Cola & Walmart & Target.  They have all fell hard.  Who's to say it won't be Apple next? Maybe people will start wanting to sell Apple instead of Paypal or Facebook that they find at better values at todays prices when they get their next margin calls?", "score": 1, "replies": [{"body": "Oh, I agree with you.  This is sort of what I meant by the \"thick skin\" comment.  Safe, quality stocks are often resistant to drops at first.  But when it becomes clear that there is no safety to be had, they are ripe for the picking, too.", "score": 2, "replies": []}]}]}, {"body": "Apple is in a pretty different place now compared to 2019. The revenue for 2021 is 40% higher than 2019. Apple silicone has been a godsend for Macs in terms of performance and increasing margins. They continue to do incredible sales for pretty much every product short of the iPod lol They’ve also done considerable buybacks since, and I don’t know if anyone is going after iPhones for a monopoly. I see current chip production as an uncertainty, and unionizing cutting into profits a bit, but otherwise they’re looking incredibly solid. A recession might hurt but time can cure that ill. I know you’re not necessarily predicting $60, but dropping ~70% from ATH for a company continually outdoing themselves would require something borderline apocalyptic\n\nEdit: 70% drop from ATH*", "score": 7, "replies": [{"body": "Their APP store monopoly might be severely reduced if the Europeans have their way . A huge part of their income was from APP store in  the most recent report.", "score": 1, "replies": []}]}]}, {"body": "Uhhhh no lol. Definitely possible but unlikely. Using 60 dollar December 16, 2022 puts delta as a probability proxy the market has given it a 1.2% probability by then.", "score": 2, "replies": [{"body": "So your saying there's a chance? /s", "score": 4, "replies": []}]}, {"body": "Yes it is possible. And not even all that irrational to think it may get there. It was at 11 10-11 years ago.", "score": 1, "replies": [{"body": ".... 10 years ago....", "score": 2, "replies": [{"body": "Yes?", "score": 1, "replies": [{"body": "I'm thinking of going mostly energy. I'm 45% cash right now.\n\nSome stocks that i may keep that are holding up:\n\nUNH NEE VTNR DVN SHW HD UNP ENPH COST", "score": 1, "replies": [{"body": "What happens when energy runs its course and its a risk on environment? Do you want to see rises in tech before buying? Kind of sounds like chasing gains.", "score": 1, "replies": [{"body": "I have GOOGL NVDA AAPL ASML LRCX MSFT PANW CRWD\n\nEnergy is only going higher this year.  Summers coming.... And then winter!\n\nThere are shortages especially with Russia out now.", "score": 1, "replies": []}]}]}, {"body": "Short AAPL then. Have fun!", "score": -2, "replies": [{"body": "You asked a question and I answered it. I never said that I am willing to bet it would get there. Just its simple that it can. Burry seems to think so.", "score": 2, "replies": [{"body": "I say it may get to $90 lowest but who knows.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Apple spent years at 12 PE.   Then the stimulus and low interest rates came and it jumped to something like 30.   I wouldn't be surprised to see it come down to Earth unless their services revenue keeps growing.", "score": 1, "replies": [{"body": "Very ignorant comment. Compare Apples revenue mix when its PE was 12 to now. When the PE was 12 over 80% of revenue was iPhone. Hardware companies get low PE. Total over 50% of gross profit is non-iPhone.", "score": 3, "replies": [{"body": "That is precisely the income the Europeans are eyeing. \nApple's monopoly in the APP store could be a thing of the past . Oh oh", "score": 1, "replies": []}]}, {"body": "I say maybe 20 or so.", "score": 1, "replies": []}]}, {"body": "they might be hit by supply chain issue.  i dont know how bad it is.  they might have reduce sell for their product this year.", "score": 0, "replies": []}, {"body": "Look at any other leader in that space, Nokia, Motorola. Blackberry. Apple has been living off its legacy for years, but those margins won’t survive the next recession", "score": -7, "replies": [{"body": "Comparing Apple to Nokia is beyond idiotic", "score": 2, "replies": [{"body": "Ha, welcome to the business cycle", "score": 1, "replies": [{"body": "Sorry I can’t see your comment. Probably because you don’t have enough karma my app is filtering you 😂", "score": 1, "replies": [{"body": "With a name like shoddy what can anyone expect.", "score": 1, "replies": [{"body": "Sorry bro. My third party app is filtering out your comments 😂", "score": 1, "replies": []}]}]}]}]}, {"body": "Nokia Motorola and BlackBerry? 😆", "score": 0, "replies": [{"body": "What, Apple didn’t get smashed in the 90s. Enjoy the ride", "score": 1, "replies": [{"body": "Ok. I'll be buying AAPL below 100 easy", "score": 1, "replies": []}]}]}]}, {"body": "If apples growth rate falls below 5% that can absolutely happen", "score": -2, "replies": [{"body": "What's its current growth rate?", "score": 1, "replies": [{"body": "i dont know but they keep buying back stock.  they can probably grow 5 percent just by keep buying back stock.", "score": 0, "replies": [{"body": "Literally not how it works in the slightest", "score": 1, "replies": []}]}]}]}, {"body": "That would be great, I’d love to buy Apple at 10 p/e.", "score": 1, "replies": []}, {"body": "My magic 8 ball says maybe $60 or maybe $200", "score": 1, "replies": []}, {"body": "Apple hits $60 if China declares war on taiwan", "score": 1, "replies": []}, {"body": "Also I think apples growth in the long term is not going to be as rapid as, say, Alphabet. Hence why Apple is trying to move into cars to get extra source of revenue. They had these record quarters thanks to people literally spending stimulus money on iPhones.", "score": 1, "replies": [{"body": "I'm in alphabet also!", "score": 1, "replies": []}]}, {"body": "Wouldn't that put us in one of the worst market recessions in history if it hits that point?", "score": 1, "replies": []}, {"body": "Hey again \nAAPL to 116 is likely in this downtrend. There will be many small rallies. That’s the first target. 53 would be the next but that would be silly. Spy would need to head back to 250 for that. \n\nEither way. Like I’ve said in previous posts, go learn the strat. Promise you it is worth your time.", "score": 1, "replies": []}]}
{"title": "Why S&P Booted Tesla from ESG Index", "selftext": "https://finance.yahoo.com/news/sp-removes-tesla-from-esg-index-182259870.html\n\nTL;DR: People with power are mad with Elon and trump comments with regards to Twitter. So they took their ball and went home\n\n“While Tesla may be playing its part in taking fuel-powered cars off the road, it has fallen behind its peers when examined through a wider ESG lens,” Margaret Dorn, Head of ESG Indices at S&P Dow Jones said in a blog post.\n\nSo now we know that the ESG Index is bull crap and if you’re looking for actual companies that have an environmental, social and government standards impact, know that this index is just a politically motivated index.\n\nBuyer beware\n\nEdit:  there’s a lot of Tesla / Elon haters in the comments. They’re downvoting comments they don’t like. They didn’t even read the article or the blog post the head of the ESG wrote.", "id": "usxfjx", "created_utc": 1652943050.0, "score": 25, "upvote_ratio": 0.61, "num_comments": 89, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|165|**First Seen In WSB**|1 year ago\n**Total Comments**|958|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/s8ilg4/corz_ipo_today_core_scientific_youre_welcome/) [x](https://www.reddit.com/r/wallstreetbets/comments/t55wc7/boil_uso_much_more_room_left/) [x](https://www.reddit.com/r/wallstreetbets/comments/sh1g8e/test/) [x](https://www.reddit.com/r/wallstreetbets/comments/sq1hf4/gtlb_gitlab/) [x](https://www.reddit.com/r/wallstreetbets/comments/t3hc0k/tsla_multi_trillion_dollar_company/) [x](https://www.reddit.com/r/wallstreetbets/comments/t8saqb/xop_oil_gas_etf/) [x](https://www.reddit.com/r/wallstreetbets/comments/syv0mn/russian_conflict_stocks_ev_tesla_solar/) [x](https://www.reddit.com/r/wallstreetbets/comments/t4ju4p/ev_tesla_community_talk_tuesday/) [x](https://www.reddit.com/r/wallstreetbets/comments/sq25iz/gtlb_gitlab_massively_under_value_101_shorted_yolo/) [x](https://www.reddit.com/r/wallstreetbets/comments/sq3lvd/gtlb_gitlab_enterprise_my_next_yolo/) [x](https://www.reddit.com/r/wallstreetbets/comments/sxeqdj/game_theory_metafacebook/) [x](https://www.reddit.com/r/wallstreetbets/comments/t5o3x2/ukrainerussia_gas_pipelines/) [x](https://www.reddit.com/r/wallstreetbets/comments/ql4zhm/shorting_sbux/) [x](https://www.reddit.com/r/wallstreetbets/comments/o34bsp/russell_1000_and_amc_conspiracy/) [x](https://www.reddit.com/r/wallstreetbets/comments/tyffam/sst_float_700k_22m_shorts_wtf/) [x](https://www.reddit.com/r/wallstreetbets/comments/ql569x/shorting_starbux/) [x](https://www.reddit.com/r/wallstreetbets/comments/u6f4ok/brcc_is_going_to_explode_failure_to_delivers_gme/) [x](https://www.reddit.com/r/wallstreetbets/comments/m4wwip/gamma_squeeze_gme_be_careful/) [x](https://www.reddit.com/r/wallstreetbets/comments/mknli9/visa_what_more_can_i_say/) \n**Account Age**|5 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=usxfjx)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=usxfjx)", "score": 1, "replies": []}, {"body": "Tesla being removed from the S&P 500 ESG index and one addition is Marathon Oil Corp replacing it?!?", "score": 23, "replies": [{"body": "![img](emote|t5_2th52|8881)", "score": 6, "replies": [{"body": "If they cannot censor you, engage in economic terrorism.    Welcome to American Capitalism.", "score": 3, "replies": [{"body": "american capitalism is the only reason elon thrived. in other countries he would have been stomped on the neck long before this for all the employee scandals and union busting.", "score": 1, "replies": []}]}]}]}, {"body": "Shouldn’t there be objective quantitative and qualitative measures and criteria in place?", "score": 5, "replies": [{"body": "There never is", "score": 8, "replies": [{"body": "Must be hard to type with one hand OP", "score": -2, "replies": []}]}]}, {"body": "Without advocating for the ESG, has any of the musk cultist considered the possibility that tesla really didn't comply with the guidelines?", "score": 50, "replies": [{"body": "I’ve been responsible for completing this application for a major US company for years and it’s highly likely that Tesla messed up the massive application. I’ve seen it done especially when a E.S.G. vice president leaves and a new one comes in… The new one reads the old application and determines perhaps there’s more fluff in it then there should be an tries to make a vigilante movement to fix it which results in the score plummeting…", "score": 12, "replies": [{"body": "So could you elaborate on the design of the system?\nTo which extend are they setup to actually incentive 'good' behavior vs more of a bureaucratic symbolism completely dependent on the marketing skills and intentions of the person filling out the application?", "score": 2, "replies": [{"body": "It’s a legitimate program.", "score": 1, "replies": [{"body": "So are you implying Musk is full of shit? Because that would be heresy..", "score": 1, "replies": [{"body": "Yes I am", "score": 2, "replies": []}]}]}]}]}, {"body": "Ofc not, they were too busy sucking Elon's nuts as usual", "score": 15, "replies": []}, {"body": "What we’re the guidelines? You realize that there are other companies on the list?", "score": -15, "replies": [{"body": "Wait - you’re sprouting a conspiracy theory about revenge for political views but did not even check the guidelines for the index you’re criticising? Great sport.", "score": 25, "replies": [{"body": "Conspiracy theories are for idiots to feel smart about something. They don't do any really work or research on them. Lmao", "score": 4, "replies": [{"body": "No, you guys are idiots. He tried to be the smart one. All of you idiots posting here like your enlightened. The article has links in it especially one link to the head of the ESG’s blog post.\n\nNone of you read it, or probably didn’t even read the article. You guys are just disgusting people.\n\n“Conspiracy theory” \n\n“Musk cultists”\n\nYou guys shown who you actually are by the questions you asked. And it shows how pathetic you guys are.\n\nGet out of here", "score": 1, "replies": []}, {"body": "Well, I know I’m naive but I give even conspiracy theorists the benefit of the doubt. But if he admits it so freely….", "score": 0, "replies": [{"body": "I never admitted anything, you didn’t even read the article. Just like the other shitposters who just hate anything Elon or Tesla. That’s it.\n\nYou guys are disgusting", "score": 0, "replies": [{"body": "It is really amusing how you assume that somebody „hates Elon and Tesla“ who simply wants an explanation to your hyperbole. Nowhere (!) in the article you posted is your conclusion drawn. There is a quote (!) from someone believing it would‘ve been better to include and work with Tesla on the issues. That’s all. There isn‘t even a direct quote from S&P as they did not respond (yet or ever).\n\nGrow up. This is not about Musk hate - this is about you coming up with unbased theories.", "score": 1, "replies": []}]}]}]}, {"body": "I’m asking what they were so you can see how stupid and contradictory you guys are", "score": -3, "replies": [{"body": "Why should I research something about that? I’m NOT the one who stated:\n\n„now we know… politically motivated index“\n\nWhen in reality you know nothing but just sprout your biases. \n\nLook - as I said in another post: *I* don’t care much for ESG and ESG indexes and don’t think that they are a good idea. But my reason is not some outrage that they didn’t build a throne for Elon Musk. Btw - I’m neither a fan nor an enemy/hater of Musk. But I like facts and statements with substance.", "score": 6, "replies": [{"body": "Shut up dick face…\n\nIf I didn’t know, would I have posted this.\n\nI’m just showing you how stupid you are. You posted that crap and YOU have no clue", "score": -5, "replies": [{"body": "Oh man…. ![img](emote|t5_2th52|4640)", "score": 2, "replies": []}, {"body": "I asked you a question. I didn’t post any theory here. You provoked this question by asking someone else for the guidelines. Therefore I believe you did not check before posting here. \n\nYour extreme, insulting and personal snap-back suggests you have no material argument and can’t prove your point. So you resort to argumentum ad hominem as only people need to do that don’t have any normal argument anymore.\n\nI make a proposal (which I suspect you’ll reject because you know you don’t have an argument, but maybe I’m wrong here): post a link to the index guidelines. Then we look it up together.", "score": 3, "replies": []}]}]}]}]}, {"body": "I suppose you mean \"what were\". I don't know the guidelines, I just know that they stand for Environment, Social and Governance.\nMusk treats his employees like shit and is an unpredictable cokehead with lack of impulse control. So...", "score": 5, "replies": [{"body": "Ok sure, but majority of the people who work with him love him. I can tell you’re a “woke” person \n\nYour reply is horseshit", "score": -33, "replies": [{"body": "So that majority of people like to be treated like shit, good for them. They have Stockholm Syndrome.\nI don't know if I am a woke person, but should I be offended by that?\nI can tell you are a retard.", "score": 11, "replies": []}, {"body": "Lmao, majority of people who work for him think he is a POS. Go apply and suck a cock", "score": 3, "replies": [{"body": "I know people who currently work for him and they love it.  Pos", "score": -1, "replies": [{"body": "Yeah? His employee rotation says otherwise", "score": 2, "replies": [{"body": "You mean the rotation of every Silicon Valley company?\n\nYou guys are pathetic", "score": 0, "replies": []}]}]}]}]}]}, {"body": "I had a new vp come in and basically lie on subjective questions our scores skyrocketed and the c suite made there bonus but you can only fluff things for so long. The djsi caught on and the scores were terrible going forward", "score": 1, "replies": []}]}]}, {"body": "Haven't we always known that ESG was the elite trying to establish a system to be able to bully companies into ideological submission?", "score": 32, "replies": [{"body": "Pretty much", "score": 6, "replies": []}, {"body": "For the anti - ESG crowd RLX is a poster stock. Vice (vaping), China based with constant questions on their governance and excellent earnings ($3b EBITDA, @0.29EPS). If you’re against ESG this is a buy", "score": 1, "replies": [{"body": "Looking for the earnings thread? \n\nYou can always find it linked in the daily or weekend thread. I also try to sticky it between 8am and 10am, as well as 2pm to 6pm every trading day. \n\nThe earnings thread is sometimes unpinned so that other underappreciated WSB posts can be stickied. This hopefully gives the subreddit more variety and makes it more interesting for you. \n\nI apologize for the inconvenience of having to click into the daily thread first. We're just trying to make it look more like the good old days. \n\nHelp us get the word out, tell people where to find the earnings thread when they ask, as well as why we sticky low karma, high effort, threads!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "Having made my career in esg and spending 5 years completing this application, all I can say is it’s massive and very comprehensive. It’s likely Teslas staff messed something up on the application which is easy to do", "score": 19, "replies": [{"body": "Right because elon hires smooth brains like you to file paperwork", "score": 1, "replies": []}, {"body": "Conjecture, they lead EVs. They created the industry for it, what fucking good reason is there? I mean, giga factories, solar, home batteries.\n\nThey fucking got china to phase out gas powered cars! And they’re taken of the list?", "score": -10, "replies": [{"body": "You can “hack” the application. You can get away with it for a couple years. Usually it’s when someone else comes in and reviews the previous person‘s work and they’re like wow these are lies and they can’t be substantiated… then they try to correct it in your score plummets… The questions on the application are incredibly subjective", "score": 8, "replies": []}, {"body": "So essentially you’re saying:\n\nCreate an index with rules but ignore the rules if it’s Tesla/Musk? You realise that, even if you credit them with the achievements that any company responsible for an index would get into regulatory compliance issues if it waived the prerequisites out of favor (or excluded because of unfavor - which you imply)?\n\nAlso: how is an EV with 670 to 1000 PS more ESG than say a Hyundai Ioniq 5 or an Kia e-Niro or even an VW ID.3 which have a better energy consumption? Because you like it more? Or because it’s got better technique? That’s not ESG.\n\nI am not a fan of ESG investments in general. I think it is limiting and not what a market should try to do by force. But that’s a personal opinion.", "score": 5, "replies": [{"body": "I think esg as an investment is a bad idea…", "score": 2, "replies": []}]}, {"body": "I don’t know where you got the whole Tesla helping phase out ICE in China, because that’s completely wrong. China had been the leader in EV credits, well before Tesla entered. Go check out SAIC Motor.", "score": 2, "replies": []}, {"body": "Guess what, ESG is more than just E, and a blind man can see that Tesla is lacking on the S and G part.", "score": 0, "replies": []}]}]}, {"body": "The ESG index is covert for “this company follows the narrative”", "score": 17, "replies": []}, {"body": "S&P Dow Jones Indices cited claims of racial discrimination and poor working conditions at Tesla’s flagship factory and its handling of a federal investigation into deaths linked to its autopilot vehicles in its decision to remove Tesla from the index.\n\n-that is political to you?", "score": 17, "replies": [{"body": "Apple:\n\nhttps://www.macrumors.com/2022/01/12/apple-bag-check-lawsuit-settlement/\n\nhttps://www.axios.com/2020/10/26/apple-lobbied-congress-uyghur-slave-labor-china\n\nhttps://www.cecc.gov/media-center/press-releases/chairs-issue-statement-about-forced-labor-in-apple%E2%80%99s-supply-chain-in\n\nhttps://www.cultofmac.com/517879/iphone-factory-deaths-investigation/\n\nWhy is apple kept on the list? I guess I’m the one lost…", "score": 12, "replies": [{"body": "Was tesla yeeted out because of the factories? If the answer is yes, then I will apologize; I the answer is no, you are braindead.", "score": 5, "replies": [{"body": "You litterally put “discrimination and poor working conditions at Tesla flagship factories” and “deaths linked to its autopilot”\n\nAnd yet, I showed you lawsuits of poor working conditions, slave labor and deaths in China factories that apple is consistently apologetic for, and that’s your reply?\n\nYou just got your last reply from me\n\nYou just said either your original comment was bullshit or you don’t care about this topic, just hate Tesla", "score": 15, "replies": [{"body": "Maybe a difference contractor vs wholly owned facility and direct employees vs contracted staff", "score": 5, "replies": [{"body": "The employee in the Tesla case was a contractor hired by a contractor fyi\n\nThe apple store is owned by apple", "score": 6, "replies": []}, {"body": "Bingo, Apple doesn’t actually have manufacturing.", "score": 4, "replies": [{"body": "What are you talking about? They’ve partnered with manufacturers and own a percentage of those facilities. They also own the stores which has had many lawsuits…\n\nI’m starting to think these anti Tesla/Elon people are really stupid", "score": 1, "replies": [{"body": "They partner with Foxconn and JGP who own the factories. Apple owns the design studio and the stores.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Apple has contract manufacturers for everything. They don’t own the factories.", "score": 2, "replies": []}]}]}]}, {"body": "Don't go, I was having fun.", "score": -5, "replies": []}]}]}]}, {"body": "I’m one of the few people in this thread that has actually worked in Apple and Tesla factories (plural). Tesla absolutely has better working conditions. ESG is bullshit", "score": 7, "replies": [{"body": "My co worker left 7 years ago to work in one of the battery plants, hes still there and loves it.", "score": 2, "replies": []}, {"body": "All these posters didn’t read the article, didn’t read the head of esg blog post, think they know about the employee sentiments of the employees, disregard the fact that many on the list have the same or worse issues than Tesla \n\nThey’re just brain dead “Elon musk or Tesla bad” for some insane reason", "score": 1, "replies": []}]}, {"body": "You do realize Tesla employs more than 100K employees with giants factories on three continents. Is anyone surprised that there were found a few cases of rasism or inequalities with such an employee count? It ia like saying McDonald's is racist because some shitty restaurant manager asks the muslim guy to do more toilet cleaning rounds than the rest... it's not the company, it's just the idiot that will eventually be thrown out.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Tesla also. And?", "score": 2, "replies": []}]}, {"body": "Yes. Those are subjective measures, not objective. All subjective measurement has a point-of-view.", "score": 1, "replies": []}]}, {"body": "Truth is esg is a lie.  It’s another cudgel to beat people/corporations with when they get out of line.  Like the whole carbon tax money laundering scheme of the leftists.  Invent a problem,straw man, the create a bureaucratic solution and begin the fraud and money laundering.  I.E.  Obamas entire life.", "score": 7, "replies": []}, {"body": ">TL;DR: People with power are mad with Elon and trump comments with regards to Twitter. So they took their ball and went home\n\nWhat a crock of shit. Imagine believing this.", "score": 12, "replies": [{"body": "So explain why they made it before and now are delisted?", "score": 0, "replies": [{"body": "For example they were found gilty of discrimination. And when it comes to Governance its not ideal when the CEO is running berserk on Twitter and is in constant trouble with the SEC.", "score": 2, "replies": [{"body": "Apple is on the list, that’s the first one that also had discrimination lawsuits as well. Against people of color and women, what else do you got…\n\nAnd freedom of speech isn’t allowed anymore? He can say what he wants, if he’s not breaking the law, who gives a shit", "score": 2, "replies": [{"body": "He is braking the law, just watch the shitshow he is currently doing with TWTR.\nAnd the same when he wanted to buy back Tesla for 420...\n\nAnd when it comes to working conditions, you really wanna compare Apple to Tesla? \n\nDiscussing with fanboys just isnt worth the time...", "score": 0, "replies": [{"body": "You’re an idiot\n\nThere are other heads of funds that are saying Tesla shouldn’t have been removed from ESG…\n\nBut I guess you redditors know better lmao\n\nThe amount of hate some of you have without knowing any facts is hilarious. \n\n“Breaking the law” - sure buddy", "score": 2, "replies": [{"body": "All information needs to be published. Its about transparency.\n\nTesla isnt even publishings its emissions. Yes, you heard it right, check it!\n\nAnd thats the problem: these EV companies think they are so super green, that they dont care about the rest.\nOn the other side the most gray companies know exactly that they have to take an afford to look as sustainable as possible. Therefore they really do their homework.\n\nSo instead of crying like a baby, Elon should just hire some people and start cooperating with the ESG rating agencies and deliver all data they need. Thats all that needs to be done.", "score": 0, "replies": [{"body": "Like I said, you know better…\n\nContinue on you fool", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "ESG was created so those of us “not in charge” will always be wrong.  Use both hands to spread em.", "score": 3, "replies": []}, {"body": "Here is the thing. If you think it’s a scam. You shouldn’t care if you’re on it. \n\nYou will get share holders cause you do good business. \n\nIf you’re complaining literally to the whole world about it. You probably care, and must think it’s not a scam. Because you give it weight. In your own mind. Where you basically control everything.", "score": 2, "replies": [{"body": "I think it’s sad that things like this are used as political weapons. People don’t realize what’s creating the Trumps of the future. This is exactly it.", "score": 2, "replies": []}]}, {"body": "Short the index !\nBuy Tesla !", "score": 3, "replies": []}, {"body": "November Midterm is gonna be fun.![img](emote|t5_2th52|4887)", "score": 3, "replies": []}, {"body": "ESG is dumb", "score": 4, "replies": []}, {"body": "It screams volumes that while Berkshire, J&J and others were booted too, Tesla is our biggest concern because Elon has good marketing and lots of cockfondlers. It must all be a big conspiracy against Tesla, the welfare queen doing just fine. Sure Elon will lose net worth, but it is way overpriced anyway (according to his own admission).", "score": 1, "replies": [{"body": "Ah yea.., sure\n\nMoving the world off gas burning cars is peanuts. We’re all just cockfondlers… sure", "score": 1, "replies": []}]}, {"body": "Elon stans are out in full force lmao.", "score": -4, "replies": []}, {"body": "Do y’all remember Elon talking about changing the workplace safety calculation on a conference call? I would venture to say that’s the problem.", "score": 1, "replies": []}]}
