{"title": "[deleted by user]", "selftext": "[removed]", "id": "ursmmj", "created_utc": 1652811284.0, "score": 178, "upvote_ratio": 0.93, "num_comments": 84, "comments": [{"body": "Fruit-company employee here.  We did well during the lockdown and our overlords kept their promise about 15% or less occupancy for critical teams / personnel at any given time.  There are a bunch of us that literally can *not* work from home on a daily basis due to the requirement of physically handling and testing pre-release and R&D stage projects.  The security risk and delicacy of some of the projects (and also test conditions that simply cannot be duplicated at someone's residence) requires us to be here at least some of the time.  We were able to make that about 50/50, but it would be too difficult to make 100% remote work out for a good portion of us.", "score": 75, "replies": [{"body": "[deleted]", "score": 24, "replies": [{"body": "Yes.  Scheduled for 2025.", "score": 13, "replies": [{"body": "Does it come with a charger?", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I’m calling BS, we would’ve got the leaked Chinese car covers by now", "score": 1, "replies": []}]}]}, {"body": "To be honest, totally not my division but with the number of leaks out there and amount of speculation I'm sure you can draw your own conclusions.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "far too long... actually looking to change my situation as i'm pretty close to total burnout.", "score": 29, "replies": [{"body": "Sounds like a regular tech career to me", "score": 20, "replies": []}, {"body": "When them RSUs hit, though.\n\nIt’s like an abusive relationship, huh?", "score": 11, "replies": [{"body": "RSU's... lol.  yeah... plenty of ESPP here, but dick in the RSU department... aside from the paltry sums Tim has been dishing out to everyone the last few years.", "score": 1, "replies": []}]}, {"body": "I heard software engineers and other tech job have it the best now…high wages , even for out of college, more remote opportunities, strong demand across major cities…", "score": 5, "replies": [{"body": "I'm not seeing it. But I'm in the demographic they desperately want to hire less of.", "score": 2, "replies": [{"body": "What demo is that?", "score": 1, "replies": [{"body": "White male i’m assuming", "score": 2, "replies": [{"body": "True.. Colored women and women have been getting preferential treatment hardcore in tech industry recently", "score": 0, "replies": [{"body": "Agreed. It’s a good thing that they are spreading the opportunities around as there are so many people with technical abilities that do not fit into the white male demographic.", "score": 1, "replies": [{"body": "It’s definitely good. My wife had been working at my same company and never got looked at, old people culture lots of white males. She just went to GitHub and it’s way better over there and now has opportunity to promote. She’s Venezuelan.", "score": 2, "replies": []}, {"body": "Haha. Gonna need source on that one.", "score": 0, "replies": []}]}, {"body": "That’s great, congratulations to her and your family. Right now is a great time for women and women of color especially to advance in the  workplace, with so many companies making diversity a high priority. \n\nIt will be interesting to see the changes in companies and their culture as that shift happens. I think it will be a huge benefit and a change that is seriously needed.", "score": 0, "replies": [{"body": "I think it was needed. I think it will drive more compassion and human elements into the work culture, should be a positive impact. We’ve all been shafted for too long with the status quo.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Yep.. me and my gf and all our coworkers have it very good right now. If anything Covid actually helped tech employees", "score": 1, "replies": []}, {"body": "i don't do software sadly.", "score": 1, "replies": []}]}, {"body": "You a citizen and not in cahoots with any terrorists or foreign adversary nations?", "score": -17, "replies": [{"body": "since i was born.  most of my division is here on visas though:  TBH there just aren’t enough competent US born kids in college that have /any/ interest in the area of work we perform.  i haven’t interviewed anyone from the US that’s qualified for years.", "score": 9, "replies": []}, {"body": "also, not really interested in getting back into DoD work.  too restrictive on lifestyle.  been there, done that, forever ashamed of my country’s past fuck ups.", "score": 3, "replies": [{"body": "Lol yep. Know exactly what you mean.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I live in Florida. Covid hasn’t been a thing here in over a year, going on about 20 months on things being very normal.", "score": 20, "replies": [{"body": "Asking cause I’m curious - what was local sentiment like with the lack of lockdowns. Were people happy with it? Upset?", "score": 3, "replies": [{"body": "Most of the country went on vacation to Florida and many stayed and didn't leave.\n\nAlot of CA plates down here.  Alot of Canadians have been down here for a very long time too. \n\nJust for reference, rates have had no impact on housing down here.  Listings last a day and are gobbled by cash offers still.  At least in South Florida.\n\nEven then, most offices are still only partially full.\n\nThe normal lull after mother's day is much lower than usual.  It's still very busy here.", "score": 7, "replies": []}, {"body": "Being that I’m local and I’m also not particularly reckless, this was/is my sentiment: they started reopening restaurants in May of 2020 at I think 25% capacity. I kept my distance. I’m healthy, but in my 40s, and wanted to see if we’d have a spike. Nothing seemed to happen, and I cautiously started going out, being careful. By October of 2020, you’d still see people wearing masks in supermarkets, but night clubs and concerts were packed — moreso than before because of all the people from other places. Halloween was a crazy blowout of parties and people all out with the weather being nice — it might as well have been an end of a war celebration. \n\nI know one older guy that died from Covid who was super sick and refused to get help, a younger person who is still dealing with the effects of it, but said he got it in 2019 and was hospitalized before anyone knew about it. He tested positive for antibodies in 2020. And one other older person who was hospitalized for a month because he went into the hospital twice, feeling like crap, and they didn’t treat him because the tests returned false negatives. \n\nLooking back, Florida handled it far better than the rest of the country. I believe the incentives for Covid deaths encouraged classification and even killing people in other states. We’ve known that Covid is not particularly bad for young and healthy people, and the correct course of action was to caution people and have at-risk groups self isolate. It’s apparent to me that effects of the handling of Covid have been worse than the sickness itself. A lot of relationships between productive people were ruined, there have been suicides, drug addictions and overdoses, and a number of people have ended up in worse health or dead because of discontinued or fear of seeking medical treatment for other issues. \n\nA couple final thoughts: The first being that, anyone who has been to China will know that the Chinese do not have a concept of personal space like we do here in the west. They yell, cough and sneeze in each other’s faces at distances that we could consider intimate. Viral load is known to be an issue and six feet of social distancing is almost normal here and in Europe. Also, growing up in the 80s and 90s, we all thought we were gonna die from AIDS if we had unprotected sex, or even if a condom broke or something. As it turns out, the risk for straight people who didn’t share needles or take it up the ass was pretty low. It was Fauci back then who was mongering this fear, the same Fauci who pushed the mask mandates. It’s like the dude has some sort of sadistic fetish where he gets off on making people comply with wearing some article.", "score": 4, "replies": [{"body": "Thank you - appreciate you going to the effort of writing all this out, it’s a great insight.", "score": 2, "replies": []}]}, {"body": "Why would anyone be upset to NOT be locked down.", "score": 2, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Weird you’re getting downvotes for like, a willingness to sacrifice a little to save lives.", "score": 1, "replies": [{"body": "I was very much of this mindset. My fear is that, just like in *The Boy who Cried Wolf*, people will not take things seriously if a real superbug were to spread. In spite of the lockdowns, Covid still seemed to spread rapidly to the point where everyone caught it. All the measures seemed to fail at preventing the spread — and maybe that was the challenge to the powers that be, that they put stopping the spread ahead of mitigating damages. The fact that nurses were sitting around with nothing to do and hospitals had excess capacity is indicative that the restrictions were excessive.", "score": 3, "replies": [{"body": "So you're argument against lockdowns is that the hospitals weren't  overwhelmed and completely fucked because the lockdown worked? \n\nYou're too stupid to share your opinions, keep them to yourself.", "score": 0, "replies": [{"body": "I’m sorry that you feel it necessary to fire off personal attacks against me; I was stating that the objective of the lockdowns was to save lives and I haven’t seen any evidence that Florida being open has affected the death rate compared to states that are locked down. If anything, the measures have eroded confidence in the WHO and the CDC’s recommendations in a way that, if another pandemic were to hit where lockdowns would be effective, we risk the population not adhering to them out of lack of respect.", "score": 3, "replies": []}]}, {"body": "The lockdowns weren’t meant to stop the spread, just delay how bad the spread was (“flatten the curve”) until we had the means to better treat the disease, and mission accomplished on that front.", "score": 0, "replies": []}]}, {"body": "Maybe because there was no such thing as a short term lock downs and they keep dragging it out and using it as an exuse for more power grabs/profits?", "score": 1, "replies": [{"body": "The lockdowns are over now. So yes, they were short term. And hundred of thousands of lives were saved.", "score": 1, "replies": [{"body": "Depends on where you live, there are still plenty of dracioan policies in place and people are still dealing with the ramifications of covid policy at work, so no it's not over just reduced and by this post waiting to be reunleashed tho the people of the US have had enough that's why the US is not locking down unlike China, not because the officials decided to give up power and back off but because it's political suicide to keep pushing the US public", "score": 1, "replies": [{"body": "I live in the Bay Area which has consistently had the most restrictions in the country, and I’m not aware of anything remotely close to a draconian policy that is currently in place or that has been in place for months now.", "score": -1, "replies": [{"body": "Ok that's nice for your area my area begs to differ heck my work only forces tests on the non vaccinated employees meanwhile vaccinated managers and coworkers keep catching covid.", "score": 1, "replies": [{"body": "A) you could get vaccinated\nB) are you seriously claiming that mandatory testing is a draconian restriction? Yikes.", "score": -1, "replies": [{"body": "A)lol no, compliance doesn't make a draciaon moronic and unfair policy suddenly fine by forcing uncompliant people into compliance. B) lol, ok big pharma shill who doesn't understand basic equity and basic protection structures that have huge glaring holes/contradictions and are only punitive inorder to force people into the A) situation lol\n\nEdit: added to A", "score": 1, "replies": [{"body": "Lol ok", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Planting seeds for the excuse for the inevitable stalled growth.", "score": 4, "replies": []}, {"body": "Covid is never going away. We have the tools to fight it and it's time people resumed normal life.", "score": 33, "replies": [{"body": "This right here. Motherfuckers obsess over it", "score": 8, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "I have some bad news about life in general for you ....", "score": 3, "replies": []}]}, {"body": "It’s all just projection and wanting to control the narrative for those kind of people now. And I say that as someone who still wears a mask from time to time.", "score": -11, "replies": []}]}, {"body": "Ya, if people's jobs dont require them to be at a location then give them the choice to work from home", "score": 1, "replies": []}]}, {"body": "Yep I just caught that shit for the first time in two years(3x vaxxed) and my state is talking about the surge and politely suggesting people wear masks again. But beyond that, America is over it. \n\nI just hope China gets a handle on it so our supply side inflation can chill out.", "score": 10, "replies": []}, {"body": "It’s definitely surging back and anyone who tells you otherwise is lying or not paying attention. \n\nIs it going to be a problem? Eh it depends on a lot. \n\nDon’t quote me on this but last I read/heard it’s currently an omnicron subvariant. This means most previous infections will not provide preventative protection. Aka if you caught Covid before this wave, you’re equally as susceptible to catch this one. \n\nMost “big companies” are now able to go fully remote at the send of an email. They weren’t ready to do so in 2020 so this aspect is removed IMO. \n\nThis may aggravate supply chain issues if factories have to increase precautions. I doubt we’d see federal precautions happen before the midterms so watch your states to do anything. Maybe certain states start putting up restrictions but most people already aren’t masking up when they go out. \n\nLong story short, this should not affect things that badly, but depending on how safe people stay this could get out of hand quick. \n\nInteresting numbers\n- just over 2/3 of Americans are fully vaccinated\n- just under 1/3 of Americans have received a booster \n- Covid booster shots last 4 months so if you got it in 2021 the protection is fading \n- reported yesterday USA is averaging over 90K cases a day and over 20K hospitalizations a day", "score": 17, "replies": [{"body": "> Aka if you caught Covid before this wave, you’re **equally as susceptible** to catch this one.\n\nThis doesn’t make sense in literally any immunological context, unless you have AIDS and are already dying. There’s an entire subset of processes, one of which is called affinity maturation, where the body learns to get really good at fighting not only the exact virus you saw, but also similar viruses. Early on, some science even suggested that [infection with entirely different seasonal coronaviruses could provide some protection](https://www.pnas.org/doi/10.1073/pnas.2108395118).\n\nFor variants, protection will wane but suggesting it is 0% is borderline comedy. [Here is a paper that specifically looks at protection afforded by previous infection and how it interacts with each variant. Note that previous infection was still protective against Omicron](https://www.nejm.org/doi/full/10.1056/NEJMc2200133):\n\n> The effectiveness of previous infection in preventing reinfection was estimated to be 90.2% (95% confidence interval [CI], 60.2 to 97.6) against the alpha variant, 85.7% (95% CI, 75.8 to 91.7) against the beta variant, 92.0% (95% CI, 87.9 to 94.7) against the delta variant, and 56.0% (95% CI, 50.6 to 60.9) against the omicron variant (Table 1).\n\nIt’s honestly kind of insane that this comment has so many upvotes and no responses. Shows just how little people actually understand about the pandemic we’re in.", "score": 25, "replies": [{"body": "Tell that to the covid i got and the 3 vaccines. As well as a bunch of people who got it multiple times", "score": -15, "replies": [{"body": "Oh yeah? Can you tell me the hazard ratio you computed using your infected and control groups, including the 95% CI? Or do you just have anecdotes that you should be able to recognize aren’t a stronger argument than peer-reviewed studies with proper samples and controls?", "score": 10, "replies": [{"body": "Got ‘em!", "score": 3, "replies": []}]}]}]}, {"body": "Anecdotally (and currently getting over COVID myself) this just feels like a prudent move for the month of May. There’s an upswing in cases but the virus is really just a 3-5 day thing. There’s no real danger in having everyone go back but there’s definitely a huge productivity hit if half your staff can’t work for a week.", "score": 2, "replies": []}]}, {"body": "Has covid ended in the first place??? 🤔\n\nThings might slow but will never stop. Companies are resilient and know how to thrive. The least they can do is mask mandate indoors. Our county has imposed it but not mandatory.", "score": 10, "replies": []}, {"body": "They were losing big name employees over this, hope they never implement it", "score": 2, "replies": [{"body": "I feel like we need one big company to crash and burn due to return to office just to send a message to all the other geriatric fucks in management who are trying to force people back.", "score": 2, "replies": []}, {"body": "I honestly can't help but wonder if this has much more to do with it then COVID numbers. \n\nThere's been stories for a while about push back from employees against Apple and other big tech companies about a return to the office.", "score": 1, "replies": [{"body": "I assume so yes. They built this massive new HQ, which isn't being used. They want to force people back to work and there has been huge backlash.\n\nThey don't want more of this https://www.bloomberg.com/news/articles/2022-05-17/ian-goodfellow-former-apple-director-of-machine-learning-to-join-deepmind", "score": 1, "replies": []}]}]}, {"body": "Nobody cares about surges anymore except those who want to use it as an excuse to push off any return to office.\n\nCases and hospitalizations are a stupid metric. The actual incubation rate and those in ICU matters and remains low.", "score": 15, "replies": [{"body": "I care about this to the extent that pretending to care allows me to work from home", "score": 7, "replies": []}, {"body": "Less than 1% of cases are hospitalized... But here come the down voted", "score": 15, "replies": []}, {"body": "“Everyone”\n\nYou including the immune compromised in your statement?", "score": -3, "replies": [{"body": "Common cold could always kill sick people, post vax what's the difference?", "score": 10, "replies": []}, {"body": "Immune compromised people and flu existed before covid. Nobody made a fuss out of it then.", "score": 8, "replies": [{"body": "What does the flu have to do with covid?", "score": -6, "replies": [{"body": "Current death and hospitalization rates for covid are no significantly different than the flu virus. If immuno-compromised people lived without public mask mandates pre-covid, why is there a need for it now?", "score": 4, "replies": []}]}]}, {"body": "Small sample size that shouldn’t force the rest of us to forever wear N95 masks and live in lockdowns.", "score": 11, "replies": [{"body": "And so you admit your terms doesn’t include everyone. Did you mean “the majority”?", "score": -6, "replies": [{"body": "Shallow and pedantic.", "score": -11, "replies": [{"body": "Thoughtful and inclusive.", "score": 0, "replies": []}]}]}]}, {"body": "Just throwing this out here, my dad who’s 60 and takes immunosuppressants for his transplanted heart hasn’t worn a mask or taken a vaccine or booster has been doing just fine. Anecdotal case at best, but worth mentioning.", "score": -17, "replies": [{"body": "Not worth mentioning tbh.", "score": 9, "replies": []}]}]}]}, {"body": "If COVID comes back maybe people can stop driving so much (among other things) and inflation can calm the hell down", "score": 1, "replies": []}, {"body": "It's just a cold. Time to start looking at where a company is headquartered as part of DD.", "score": -4, "replies": []}, {"body": "It's probably more to due with remote employees being willing to quit their jobs if forced to return to the office PLUS an extremely strong job market for engineers PLUS remote working becoming the norm PLUS a tight job market PLUS low unemployment in this sector....\n\nMicrosoft said they are DOUBLING their salaries just to keep employees from quitting their jobs for betting paying ones.", "score": 0, "replies": []}, {"body": "From another manor employer: Our corporate overlords just changed their minds and are default approving any 100% remote request.", "score": -1, "replies": []}, {"body": "OR that apple- as other companies as well- figured out (to the surprise of many.. /sarcasm) that with the right company culture and leadership, the avg worker basically has the same or even better performance when working from home compared to being \"in the office\". \n\nthere were studies conducted since the eighties if I remember correctly, stating that the avg efficiency time of a 8 hr workday at the office is rought 2-3 hrs.   \n\n\nthere are jobs where around the clock communication with coworkers might be essential, but in most cases, the modern \"office space\" is as much a distraction from actual work as working from home CAN be.  \n\n\nits also found out, that MOST people working from home really appreciate the luxury, thus working longer hours, show more effort, are more satisfied overall and show much better work quality. \n\nas always, its the few bad apples that abuse homeworking to do everything else besides working, when they are not in the office. but you can also bet your behind that those people are also not the most high performing cooworkers when they are \"in\".\n\nand those bad apples give working from home a bad rep abnd are cited by managers that somewhat become obsolete and do not feel the power they once felt. hard to wander around the cubicles and feel special when there are no people in those cubicles...", "score": 1, "replies": []}]}
{"title": "Elon calls inflation correctly on the All In pod. Also insinuates JPOW and Jamie Simon might be losing their influence in the future due to better ways of exchanging money..", "selftext": "Sup autists - some interesting insights from our favorite people will a billion dollars+. Most interesting is Elon's take on money and money infrastructure insinuating that Kryppit0 will eventually replace banks' ancient \"cobalt databases\".\n\n&#x200B;\n\n* Elon discussing inflation - from E69 of the All-In Podcast\n   * [https://www.youtube.com/embed/CnxzrX9tNoc?start=4558&end=4801](https://www.youtube.com/embed/CnxzrX9tNoc?start=4558&end=4801)\n   * Discussion on the printer go brrr = inflation to start\n   * 1:19:31 - Elon wants to 'disintermediate' banks with Kryppit0\n* Jeffrey going after Joey on inflation\n   * [https://twitter.com/JeffBezos/status/1525309091970699265](https://twitter.com/JeffBezos/status/1525309091970699265)\n   * Jeffrey saying similar things but insinuating the problem was Fiscal Policy not Monetary Policy (JPOW)", "id": "urltlm", "created_utc": 1652792079.0, "score": 17, "upvote_ratio": 0.56, "num_comments": 81, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|5|**First Seen In WSB**|3 months ago\n**Total Comments**|32|**Previous DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=urltlm)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=urltlm)", "score": 1, "replies": []}, {"body": "It's \"cobol databases\", retard", "score": 10, "replies": [{"body": "Oopsie", "score": 3, "replies": []}]}, {"body": "The irony of that fuckwit saying others are losing their influence", "score": 7, "replies": []}, {"body": "unsubscribe", "score": 16, "replies": [{"body": "Helpful award for you! Thank you", "score": -13, "replies": []}]}, {"body": "This is why he's an engineer and not an economist.", "score": 33, "replies": [{"body": "He's terrible at economics, but he's more credentialed in it than engineering. At least he studied it as an undergrad. But yeah, this is still nonsense.", "score": 3, "replies": []}, {"body": ">This is why he's an engineer and not an economist.\n\nJudging from his comments on why FSD was delayed, he seems more of a hardware engineer than software.\n\nPersonally I don't fully understand what would be wrong with archaic database technology. The main reason we haven't replaced it yet is because it functions well.", "score": 2, "replies": [{"body": "Lmao! Clearly you are no dev. Old systems don’t exist because they function well, they just exist. And rather taking a mediocre paying job to update it, developers would rather take a high paying job in something exciting……like literally anything else other than updating that technology for that old company lol", "score": 0, "replies": [{"body": "Yea no. There are so many things in software that are just new iterations of old designs, sold as new toys to people that don't even understand what they are buying.\n\nAs a software developer working for a large organisation you aren't even involved in deciding what is going to be build and why. If you were, you would probably tell your managers that what they are planning to build is exactly what is described above. But who cares, everyone gets paid and that's the point for most.\n\nAnd no, your latest graphdatabase microservice written in javascript isn't going to outperform some archaic relational system that has being running financial transactions for 10+ years.", "score": 0, "replies": [{"body": "Tomato tomato dude. I’ve worked at a Fortune 500 company that has COBOL systems. I use this tense because literally EVERY attempt they made to educate devs on the language failed. And they were just trying to get simple tweaks in for basic maintenance purposes. I can tell you’re one of those opinionated devs that sit around talking about code instead of writing it. Can you even prove your egregious claim that a newer language cannot outperform a language created in 1959?! GTFO, lol! It’s literally because of devs like you that  this systems still exist.", "score": 0, "replies": [{"body": "Obviously a newer language \\*can\\* outperform and that's not at all what I claimed but if what you say is true you would probably agree that programming language or database performance is not going to be the main bottleneck to realising his full self driving car vision.\n\nBesides that, as you know, C is almost as old as COBOL and plenty of modern high performance systems still employ it. The argument that a language is old and therefore its bad is just nonsense.", "score": 1, "replies": []}]}]}]}]}, {"body": "Enigneers have proper formal training in dealing with signals and systems, and control theory than an economist... both of those topics are sufficient to understand and criticize the idiots that call themselves economists...\n\nFIT INTO MY POLE-ZERO PLOT!", "score": -4, "replies": [{"body": "Criticize yes understand not necessarily.", "score": 4, "replies": [{"body": "What I am saying is that nonsensical ideas are generally not worth \"understanding\".\n\nWe have people specifically trained to analyze and build tools, mechanisms, and systems, including transactional systems that can be used to quantify value, control supply vs demand curves, etc, etc... control phase delay (credit)... etc.\n\nYou change up some words and suddenly you find that people are using Fourier Transforms to decompose a ticker into its component frequencies. The \"feelings\" about a \"human\" aspect isn't as relevant as everyone would like to to be.\n\nThis is not an elon fanboy post, its a comment that you in general need more engineers in the decision making places... unfortunately you don't pay us enough to care about public policy.", "score": 4, "replies": [{"body": "This is the basis of technical analysis. You quickly realize, if you were a good engineer anyway, that there are far too many variables for you to actually discern anything but noise from the system if you try to analyze it as you would a typical system. It's like trying to find the light emitted from a flashlight next to the sun.", "score": 4, "replies": []}]}]}]}, {"body": "Fair statement, but potentially not a 'big picture' statement like Elon's", "score": -8, "replies": [{"body": "Elon said some things which you find confusing, therefore you assume they are correct", "score": 7, "replies": []}]}, {"body": "He predicted the recession last year.\n\nhttps://twitter.com/elonmusk/status/1476619907076923398?s=21&t=BTk6dOn9g5V5ap8SdJ6ANw", "score": -7, "replies": [{"body": "And he predicted COVID would end in a month. His track record for predictions is shite", "score": 11, "replies": [{"body": "He wasn’t really ‘wrong’", "score": -2, "replies": []}]}, {"body": "Economists have predicted 10 of the last three recessions.", "score": 4, "replies": []}, {"body": "Him and probably a majority of economists as well as armchair WSB apes and Econ 101 students and Fox business watching grandpas. Given the eco omy of 5 months ago It's not really going out on a limb there.", "score": 5, "replies": [{"body": "Now he’s saying it will be a prolonged recession up to 18 months \n\nhttp://www.bnnbloomberg.ca/musk-sees-us-as-probably-in-recession-lasting-up-to-18-months-1.1766835", "score": -6, "replies": [{"body": "Who ISN’T saying that? Lmao", "score": 6, "replies": []}, {"body": "    .¯\\_(:|)_/¯.", "score": -1, "replies": []}]}]}, {"body": "In all fairness, Elon could probably effect a recession if he wants to.", "score": 1, "replies": [{"body": "He couldn't cause a recession if he crashed a rocket into a real car company.", "score": 1, "replies": []}]}, {"body": "Very easy to make economic predictions if you never say when or by how much. Or if you talk a lot and rely on people to only remember the times you were right.", "score": 1, "replies": []}]}]}, {"body": "Elon calls inflation correctly on something recorded yesterday?\n\nWas there some new inflation news in the past 12-24 hours he \"called\"?", "score": 4, "replies": [{"body": "No its just that the current MSM narrative is supply chain + Putin's war. He clears that FUD and explains in simple terms that inflation is a function of money supply chasing the same number of goods/services.", "score": 0, "replies": [{"body": "He clears that up by saying the exact same thing with different words? What?", "score": 3, "replies": [{"body": "MSM conveniently leaves out the fact that we printed 80% of all dollars ever in last couple years", "score": 0, "replies": [{"body": "We did not print 80% of all dollars in the last couple of years.\n\nM2 increased by 50% after the pandemic.", "score": 8, "replies": []}, {"body": "If his model is correct, why didn't we experience inflation during QE1 and QE2? And why, if we quintupled the money supply, is inflation not in the triple digits?", "score": 2, "replies": []}]}]}]}]}, {"body": "The supply of nothing is infinite. Nothing will never be money. Money needs to be something.", "score": 7, "replies": [{"body": "But money has been nothing for a while now.", "score": 8, "replies": [{"body": "Not getting chucked into federal prison for not paying my taxes in dollars doesn't seem like nothing.", "score": 4, "replies": [{"body": "Red Herring.", "score": 0, "replies": [{"body": "I can't pay my taxes with fish.", "score": 2, "replies": [{"body": "Red Herring.", "score": 0, "replies": []}]}]}]}, {"body": "Yeah fiat is a giant cluster fuck duhhh", "score": 3, "replies": [{"body": "I’m just not sure what stance you are taking here. The interesting thing about fiat, is they can add zeros to a spread sheet to creat it. With Bitcoin, it literally has to be mined like gold, and there is a hard limit of something like 27 million, so it is finite. It costs money to mine. It takes equipment (graphics cards) and fuel (electricity), so it has a set value to the person mining it. I don’t understand much about it, but I find these aspects to be pretty fascinating. Since it costs money to make, it isn’t fiat. It is actually exactly like gold, but better because it’s more secure. I also think we feel like gold is better because you can also physically use it for things like electronics, but really, I don’t think money ever needed to have a secondary use. Gold was just a good solutions for our ancestors because they were low tech. Seems like decentralized digital block chain money might actually be the perfect currency for a developed civilization.", "score": 4, "replies": [{"body": "Limiting the supply of fiscal currency fundamentally doesn't solve anything because you can't eat Bitcoin, or gold, or any currency. You can only eat food. The most important thing is you can feed people. Once that is satisfied, any system of currency you introduce is going to have a bunch of problems. \n\nGold sounds great until you realize, just like fiat money, you can massively manipulate its value. Eventually, very few actors will control all the gold. That means they will dictate the supply of gold in circulation, and can infinitely make themselves more rich by subdividing the amount of gold they allow to be in use at any time, effectively printing money.", "score": 0, "replies": [{"body": "Edible money. I like where this guy is going.", "score": 1, "replies": []}]}, {"body": "What's the supply of World of Warcraft?", "score": 1, "replies": [{"body": "Infinite", "score": 2, "replies": []}]}]}]}]}, {"body": "I’d like to argue “nothing” is actually very difficult to find", "score": 1, "replies": []}]}, {"body": "He's about to learn how Kennedy felt...", "score": 13, "replies": [{"body": "Seriously...", "score": 1, "replies": [{"body": "Think about it. Look at Jack Ma in China... Kennedy tried shutting down the federal reserve. There are untouchables.. He's playing with fire.", "score": 8, "replies": [{"body": "He literally is one of the most powerful member of the establishment in the US not a freedom fighter fighting it. Talking about Jack Ma, Elon also praised China in this podcast toward the end and was comparing the workers there to Americans ones saying that Americans were too entitled and unions were too powerful.", "score": 6, "replies": [{"body": "He did waffle on that piece. But the argument was more nuanced around long term competitiveness and noting the fact that China is large and in charge and unions won't ever be a problem there, which is an economic advantage of sorts. Not saying I agree...", "score": 5, "replies": [{"body": "\"Economic advantage\" ...for who exactly? Guys like him?", "score": 2, "replies": []}]}]}, {"body": "Did Jack Ma take on the PBOC? If he did I am unaware. do you have a link?\n\nI was also unaware that Kennedy opposed the Federal Reserve. Where do you have this information? I would appreciate a link.\n\nBut I agree in principle - the Federal Reserve and the cabal of big bank CEOs have this country over a barrel", "score": 2, "replies": [{"body": "Jack Ma made a direct comment against Chinese banks and how Ant Financial was going to give access to millions in loans that big banks wouldn't support. He called them a big club and that it was meant for the elites. Since then he's been repramanded, Ant never went IPO and BABA has been dropping like a rock. It's public info.\n\nLook up the Gold dollar Kennedy. Kennedy launched it to use the gold reserves to repay the federal reserve and shut it down. It used to be US Treasuries, now the my are Federal Reserve Notes.", "score": 5, "replies": [{"body": "Awesome context thank you. The heat is ratcheting back up it appears, against central banks. Just look at the 'credibility problem' the Fed has now. I guess the question becomes: do we evolve our systems at this time or do they maintain their stranglehold?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "E69\n\n1:19:31 = 60 seconds 19 minutes 13 seconds\n\n60 1 9 1 3\n\n1 + 1 = 2\n9 - 2 = 7\n60 x 7 = 420\n\nso we have 69 and 420\n\nidk what to do with those numbers but that sounds bullish to me", "score": 6, "replies": [{"body": "Nice!", "score": 2, "replies": [{"body": "Well done you two", "score": 1, "replies": []}]}]}, {"body": "He’s missing the big picture.  AGI will be in place long before any of this happens.", "score": 2, "replies": [{"body": "What is AGI?", "score": -1, "replies": [{"body": "Artificial General Intelligence.", "score": 4, "replies": []}]}]}, {"body": "Did Elon just found Bitcoin?", "score": 2, "replies": []}, {"body": "elon is not interesting", "score": 2, "replies": [{"body": "Who is your idea of interesting? The kardashians?", "score": 2, "replies": []}]}, {"body": "Elon is saying the stuff everybody knows is true, but doesn't want to hear it.", "score": 1, "replies": []}, {"body": "Given Elon is a big picture guy, his thoughts on disintermediating banks with a Krypptio type monetary solution is interesting consideration for long term evolution of fiscal and monetary policy and the implications to capital formation in that future", "score": -6, "replies": [{"body": "The trick would be getting everyone (countries) on the same coin currency so there’s no hiding monies and avoiding tax for the rich no exchange rates etc, and keep cash around for untraceable smaller transactions like prostitution and drugs.. or even enact a law where the coin transactions could be private if under 50k or whatever", "score": 2, "replies": [{"body": "Every country being on the same currency while not having the same government literally sounds like the worst idea ever.", "score": 2, "replies": [{"body": "If there was no devaluing the “credits” why would it matter? We have exchange rates, when Countries bought into The coin wouldn’t they be buying their buying power? Once you enter the coin you couldn’t sell out, one way street only", "score": 1, "replies": [{"body": "Monetary policy is far more than just the literal \"credits\" we use to trade. It's why Greece can fuck over the entire EU while the rest of the EU has to save them from their own stupidity, but can't stop them because lack of governing power. \n\nEasy 5 second of thought scenario. I allow a derivative market and debt market for currency that is global in my market, that I control. I suddenly can fuck the global economy if I am a meaningful producer.", "score": 1, "replies": []}]}]}]}]}, {"body": "https://coinmarketcap.com/currencies/terrausd/", "score": -1, "replies": []}, {"body": "Yes because  Elon is the all seeing, all knowing", "score": 1, "replies": []}]}
{"title": "Calls on Meta", "selftext": "", "id": "urzx6p", "created_utc": 1652831910.0, "score": 1179, "upvote_ratio": 0.96, "num_comments": 80, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|5|**First Seen In WSB**|1 year ago\n**Total Comments**|41|**Previous DD**|\n**Account Age**|4 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=urzx6p)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=urzx6p)", "score": 1, "replies": []}, {"body": "This looks more lifelike than the real Zuckerberg", "score": 167, "replies": [{"body": "Define \"real\"", "score": 22, "replies": [{"body": "How are ~~your advertising algorithm inputs~~ *ehm* how are you feeling today? - asking for a real person 🤖", "score": 8, "replies": []}, {"body": "that which can pass the \"I am not a robot\" test", "score": 1, "replies": [{"body": "Ah so a deep learning network! Gotcha", "score": 4, "replies": []}]}]}, {"body": "this was an old host body before they improved the technology a bit", "score": 10, "replies": []}, {"body": "Fuck I came in to say the EXACT thing except “Fuckerborg” RESISTANCE!", "score": 3, "replies": []}]}, {"body": "“I am not a praying man. But if u r up there, save me Zuckerman!”", "score": 35, "replies": [{"body": "Oh Zuckerman! Where’d you run to?! Ohhhh Zuckerman!!! 🎷 ![img](emote|t5_2th52|4271)", "score": 3, "replies": []}]}, {"body": "Holy Zuck !", "score": 21, "replies": []}, {"body": "Is this the loading screen for the Zuckerverse?", "score": 21, "replies": []}, {"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 14, "replies": [{"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 3, "replies": []}]}, {"body": "Yea I’m out", "score": 16, "replies": []}, {"body": "Friar Zuck", "score": 11, "replies": []}, {"body": "Puts on Christianity…", "score": 18, "replies": [{"body": "![img](emote|t5_2th52|4263)", "score": 1, "replies": []}]}, {"body": "For real.", "score": 3, "replies": []}, {"body": "No.", "score": 3, "replies": []}, {"body": "Saint Zuckerberg of Silicone Valley, patron saint of virgin coders", "score": 3, "replies": []}, {"body": "Meta fucking young boys. OP is a pedo. Puts.", "score": 7, "replies": []}, {"body": "Holy fuck you found the holy zuck", "score": 3, "replies": []}, {"body": "In Zucc we trust", "score": 4, "replies": [{"body": "Cucc*", "score": 1, "replies": []}]}, {"body": "![img](emote|t5_2th52|4640)", "score": 2, "replies": []}, {"body": "Holy fuxking shit.", "score": 2, "replies": []}, {"body": "Sadly, this statue creeps me out LESS than the real Zuck.", "score": 2, "replies": []}, {"body": "Porno for Priests", "score": 0, "replies": []}, {"body": "Sir this is in the church of satan behind the Wendy’s", "score": 0, "replies": []}, {"body": "Serious question: why do people hate Zuckerberg so much?", "score": 0, "replies": [{"body": "Hes terrible at PR", "score": 2, "replies": [{"body": "True, which is ironic cause he built the largest PR platform in history", "score": 3, "replies": [{"body": "Very ironic", "score": 2, "replies": []}]}]}, {"body": "He sells your data to aliens", "score": 0, "replies": [{"body": "While looking like the love child of Data and a group of Aliens 👽", "score": 1, "replies": []}]}]}, {"body": "plz buy more gme，i bought with 150+, i just want my money back ![img](emote|t5_2th52|4260)", "score": -10, "replies": [{"body": "3 day old account \n\nBought high \n\nHolding the bag\n\nWelcome to wsb", "score": 3, "replies": []}]}, {"body": "![img](emote|t5_2th52|8881) God is watching, lol", "score": 1, "replies": []}, {"body": "Looks more like Zuck than Zuck does", "score": 1, "replies": []}, {"body": "Gimme the zuck!", "score": 1, "replies": []}, {"body": "You can’t cuck the zuck", "score": 1, "replies": [{"body": "I can", "score": 2, "replies": [{"body": "![img](emote|t5_2th52|4887)", "score": 3, "replies": []}]}]}, {"body": "Dafuq", "score": 1, "replies": []}, {"body": "Dudes locked and loaded for some finger banging", "score": 1, "replies": []}, {"body": "In the name of the zuck, the zuck and the holy zuck…Amen!", "score": 1, "replies": []}, {"body": "Friar Zuck", "score": 1, "replies": []}, {"body": "Jesus,  can't you leave the Church alone boy! I hear no bell though", "score": 1, "replies": []}, {"body": "Zuck my puts", "score": 1, "replies": []}, {"body": "spittin image", "score": 1, "replies": []}, {"body": "NO!…. But this got my rolling 😂", "score": 1, "replies": []}, {"body": "😂 is the same picture", "score": 1, "replies": []}, {"body": "Zuck can suck my nuts", "score": 1, "replies": []}, {"body": "Fuck! This is most evil thing I even saw. ![img](emote|t5_2th52|8880)", "score": 1, "replies": []}, {"body": "Holy Zucker, messiah or anti-christ? Let me know in the comments below", "score": 1, "replies": []}, {"body": "now i wanna say \"Allahhu akbar\"", "score": 1, "replies": []}, {"body": "Okay… Who has been playing around with Zucks back-up units?", "score": 1, "replies": []}, {"body": "Ancient Aliens", "score": 1, "replies": []}, {"body": "This guy fucks kids", "score": 1, "replies": []}, {"body": "My puts are -90%, so far...", "score": 1, "replies": []}, {"body": "*His coming was foretold...*", "score": 1, "replies": []}, {"body": "St. Zuck", "score": 1, "replies": []}, {"body": "May He guide our spirits to the Metaverse", "score": 1, "replies": []}, {"body": "Is this a NFT?", "score": 1, "replies": []}, {"body": "You met him in the flesh?", "score": 1, "replies": []}, {"body": "Give zuck a beard, a tan, and some curtly hair.  It’s Jesus.  He’s been here all along", "score": 1, "replies": []}, {"body": "Makes me want murder small animals and lie about  the market’s health", "score": 1, "replies": []}, {"body": "DD saying puts tho", "score": 1, "replies": []}, {"body": "Lizard Saint", "score": 1, "replies": []}, {"body": "I just did, a smoke exhale spit take. It’s medical y’all!", "score": 1, "replies": []}, {"body": "I like buddy Jesus better", "score": 1, "replies": []}, {"body": "Dorime 🙏", "score": 1, "replies": []}, {"body": "Nope", "score": 1, "replies": []}]}
