{"title": "Tesla Giga Shanghai has resumed over 80% production | TESLARATI", "selftext": "", "id": "ugpk6y", "created_utc": 1651497823.0, "score": 244, "upvote_ratio": 0.97, "num_comments": 81, "comments": [{"body": "Didn’t Gordon say it would take 6 months to get back to full production? 🤡", "score": 37, "replies": [{"body": "That dude hasn’t quit out of embarrassment yet?", "score": 20, "replies": [{"body": "If he had any, he would have quit 2 years ago.", "score": 7, "replies": []}]}, {"body": "I haven’t seen a person with thicker skin outside the political spectrum.", "score": 7, "replies": [{"body": ">\thaven’t seen a ~~person with thicker skin~~ more **shameless** person \n\nI think “thick skin” is too charitable to GJ. It could be construed as a compliment.", "score": 8, "replies": []}]}, {"body": "He has a medical condition that makes him unable to feel embarrassed", "score": 1, "replies": []}, {"body": "That idiot predicted Tesla would go bankrupt last year!!", "score": 1, "replies": []}]}, {"body": "Bet my model 3 is in the 20% that doesn’t get built", "score": 20, "replies": [{"body": "Patience Mr. Moon.", "score": 16, "replies": [{"body": "Tesla shouldn’t have told me March, then May, now a November, it’s just poor customer service", "score": 2, "replies": [{"body": "Covid stuff and supply chain beyond their control.\n\nHave patience Mr. Moon.", "score": 15, "replies": [{"body": "Covid stuff I’m tired of hearing that for everything I wanna buy. GET BACK TO WORK CHINA", "score": -3, "replies": [{"body": "currently in lock down, beep boop.", "score": 5, "replies": [{"body": "The last time they shutdown Shanghai they used the downtime to increase throughput.", "score": 3, "replies": []}]}]}]}, {"body": "Go buy an f150 electric. Oh wait", "score": 5, "replies": [{"body": "They don’t sell those in EU, but never mind, I might change to a model Y least they being built in Berlin", "score": 9, "replies": []}, {"body": "Mr Moon, when will you learn?", "score": 3, "replies": [{"body": "Mr Moon, your f150 is waiting on the moon.", "score": 3, "replies": []}]}]}, {"body": "You have a shitty Tesla Advisor", "score": 1, "replies": []}]}]}]}, {"body": "…..yay", "score": 4, "replies": []}, {"body": "[Tweet about new Shanghai expansion I saw earlier](https://twitter.com/umbisam/status/1521118661469216779?s=21&t=lxq8oYH87gLBNUAk5-N8ug)", "score": 3, "replies": []}, {"body": "But why isnt it 100% \n\nTesla clearly doesnt know how to operate a business", "score": 5, "replies": [{"body": "Can’t tell if this is /s or not…", "score": 3, "replies": []}]}, {"body": "Where is the unsubscribe button to all these COVID arguments (for/against)? Can we just talk about dogs & moons for a while!?!?", "score": 2, "replies": [{"body": "COVID's just trying to buy more shares.", "score": 1, "replies": []}]}, {"body": "What a fucked up decision by China.  WTF are they thinking shutting everything down over a virus that is basically a flu at this point, and cannot be stopped anyway.  SMH", "score": -3, "replies": [{"body": "China is the only country taking COVID as seriously as it should be. COVID is not a flu, it is a poorly understood, mutated SARS virus and there are many long term implications to having been infected by it. Influenza and cold viruses do not cause extensive immune damage, very high rates of long-term sequelae, reduction in brain volume, autoimmunity etc. etc.\n\nUntil we know this thing isn't going to have a 100% death rate 5-10 years down the line, it is idiotic to allow it to spread as we are.\n\n**That being said**, China's lockdown has been ridiculous and not followed science. They've been killing people's pets despite there being plenty of counter-evidence against transmission to/from household pets. They've also completely ignored the fact that it's an airborne virus, and therefore atmospheric filtration is the correct solution to controlling spread, not locking everyone in dense, poorly ventilated apartment buildings where people are starving and will therefore break rules.\n\nEvery single country has massively botched their COVID response. This period will be looked upon extremely unfavourably in the history books for all involved, I think. If there are history books.", "score": 7, "replies": [{"body": "you cannot stop the spread of the current variations of covid.  It has spread worldwide, even if China is to stop it in their country, as soon as they open up travel, it will come back.   \n\nSo it's either lock down China forever, or start living life again.", "score": 10, "replies": [{"body": "There is a significantly non-zero chance that the \"start living life again\" attitude will result in the total collapse of modern civilisation and the deaths or permanent disability of a high proportion of humans alive today. People *really* don't get how bad COVID has the potential to be, and Western governments are deliberately obfuscating because the global economy is doing badly.\n\nAs for \"you cannot stop the spread\", I disagree. We can mandate high quality (N95+) masks in indoor spaces, add HEPA filtration and UV-C sterilisation systems for shopping malls, cinemas, workplaces, cafes/restaurants, etc. \n\nThose measures work *amazingly* well against COVID. My partner's work (a school) employed those measures and has had only a single case of in-classroom transmission during the height of our local outbreak, despite dozens of positive cases coming to school each week. None of the teachers caught the virus.\n\nWe started treating water to stop cholera, and there's no reason we can't do the same for air. We have the technology, we just need the wherewithal to make it happen.", "score": -2, "replies": [{"body": "There's a non zero chance covid ends civilization as we know it.\n\nThere's a near 100% chance that a \"zero covid\" policy as strict as China will end civilization as they know it.\n\nMost of what they are doing has been scientifically proven to have zero effect (they are disinfecting roads...) or are more harmful than the virus (lockdown with no food).", "score": 5, "replies": []}, {"body": "Water has one point of entry, we are no sea creatures living in it. \n\nAir on the other hand...\n\nI worked in the Heating/Cooling/Air sector for 8 years. What you propose is completely ridiculous if we want to keep functioning anyway near the social freedom we have today. Sure we can add all the technical stuff, i am well aware on all of these. They will cost us a leg, an arm and at least one of yours balls. And you seriously wan't to wear N95 masks for the rest of your live?\n\nI for my self rather die from COVID in 8 years, but had fun seeing friends and family instead of social distancing for the rest of my live.", "score": 6, "replies": [{"body": "I would rather humanity and advanced civilization continues to exist.\n\nI'm very much prepared to forgo some minor social conveniences in order to not die or be maimed and watch everything crumble.\n\nWhat I propose is not ridiculous at all -- it has already been implemented in many locations and works extremely well. It's also not particularly expensive.\n\nBut yes, we would have to stop having quite as much freedom as we do now. And most people are too selfish and stupid to realise that that's probably the only path forward where this debacle has a happy ending.", "score": 3, "replies": [{"body": ">What I propose is not ridiculous at all -- it has already been implemented in many locations and works extremely well. It's also not particularly expensive.\n\nThe not expensive part is complete bullshit. I know exactly how expansive a new air system with HEPA filters is.   \nAnd not the system it self will be the big cost factor. But installing it in existing buildings. We speak about square meter holes in in concrete walls/floors to fit the canals. We talk about very expensive fire protection insulation and claps.", "score": 2, "replies": [{"body": "In new buildings it should be mandated; in older buildings you can work around it somewhat by using in-situ portable air filtration systems and masks.\n\nCorsi-Rosenthal boxes are highly effective at reducing viral particle counts in the air and yet barely anyone even knows what they are. \n\nAlso, as I'm sure you're aware, most buildings already have systems for air distribution/ventilation, they just aren't turned on all the time for a variety of reasons. Why can't those systems be upgraded with better filters/pumps and run all day?\n\nStupidity is why we're losing the fight against COVID; the virus doesn't have magic superpowers.", "score": 0, "replies": []}]}]}]}, {"body": "There are many daily risks that we face, you’re far more likely to die in a car crash for example then Covid becoming a worldwide Civilization destroyer.", "score": 3, "replies": [{"body": "Not true at all. COVID is very possibly going to permanently knock out a huge chunk of our skilled workforce. And we've got maybe 10 years to prepare, all while no one accepts it's even possible.\n\nOur global supply chains are already creaking; it won't take much to set off something that will have the few survivors banging rocks together for a living.", "score": 1, "replies": [{"body": "What evidence do you have of this?", "score": 3, "replies": [{"body": "https://reddit.com/r/teslainvestorsclub/comments/ugpk6y/_/i71fvpq/?context=1\n\nThe absolute mountains of evidence that COVID attacks and causes significant and lasting damage to the brain, pretty much every aspect of the cardiovascular system and the immune system. Also mounting evidence that, similarly to HIV (though optimistically it may be more curable, maybe...) it also persists in your body for months after the initial infection.\n\nMany viruses do persist so it wouldn't be surprising. Non-COVID coronaviruses were found in ~14% of autopsied brains in a study in 2000, so there's reason to think that it quite possibly stays with you for life once you've had it even once.\n\nBut yeah -- take all of that, look at the huge numbers of people with PASC already, and consider what the effect will be on the workforce. I can already tell you that small businesses are really struggling with staff being off sick all the time. That's also an effect of COVID's exceptionally effective immune evasion and rapid mutation rate.\n\nThe economy will not thank us for letting COVID spread unrestricted as we currently are.\n\nEdit:\n\n>\tHow many people in the world total have develop unrecoverable damage due to covid?\n\nYou're missing the point. We won't know how many people have unrecoverable damage for several more years. It's not possible for us to measure long term effects because the virus hasn't even been around for the long term.\n\nBut we have plenty of evidence that the long term effects are going to be very, very bad for a lot of people (and maybe most).", "score": 1, "replies": [{"body": "How many people in the world total have develop unrecoverable damage due to covid? Divide that number by 8 billion that is in percentage the overall significance of your fears.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "The vaccine they produced isn't effective against omicron and they won't import any foreign vaccines, and with the contagiousness of omicron their healthcare system will be overrun extremely quickly.", "score": 1, "replies": []}]}, {"body": "What bothers me more is that *even China* seems to have chosen a *fake solution*. Locking people inside their apartments and running the risk of some people running out of food is... well, cruel, but naively, it should work -- but then you can't *also* force everyone to gather downstairs every day for testing, wearing a normal measly surgical mask, perhaps only covering their mouths. Like, of course they will then continue spreading the virus to each other! (especially now with Omicron etc) It just... doesn't make sense", "score": 2, "replies": []}, {"body": "wow", "score": 0, "replies": [{"body": "Wow indeed. All we need to do is invest in air-filtration infrastructure and accept some new normals (mask wearing indoors and capacity limits on huge social events like music festivals).\n\nBut no, instead we'd rather pretend that a highly transmissible virus potentially worse than HIV/AIDS is a cold, and \"get on with living\".", "score": -1, "replies": [{"body": "Yea i think the psychological damage this virus does on people is actually worse long term.\n\nSo many people live in everyday fear now. \n\nNow add a war next door and fear of nuclear holocaust on top. This really does a number on people with already bad mental health.", "score": 6, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "I don't think this at all. I know many people with long covid.\n\nI refuse to live in fear however.", "score": 2, "replies": [{"body": "I'm not saying you personally think that, but a lot of people do and it's moronic.\n\nMy personal MO at the moment is to act like the world is about to end, so I'm not \"living in fear\" so much as \"maximising my enjoyment of life while I can.\"\n\nBut I still wear a N95 in high risk settings and avoid crowded spaces unless there's a really good reason to be there (e.g. going to a concert for a unique experience is a good reason, going out shopping when I can do the same thing from my computer at home is a bad reason).", "score": 0, "replies": []}]}]}]}, {"body": "Maybe stop being a pussy and get out of your moms basement.", "score": 3, "replies": [{"body": "I live in a large apartment with views out over Sydney Harbour, and work at a major international firm that flies me to the US and Europe in business class multiple times each year whenever I ask them to. I have a fantastic quality of life and a long term partner. It sounds like you might be projecting 🤭\n\nI'm not hiding, I just know how to read and I have read the literature on COVID. Given the obvious serious risks, I take appropriate precautions like avoiding massive indoor gatherings and wearing a N95 mask indoors, on planes, in taxis etc.\n\nIf you think that pretending we aren't still in a pandemic and surrounded by a dangerous pathogen is \"getting on with living\", you are a nincompoop. What you and most other people are doing is actually \"getting on with being permanently neurologically crippled\" -- you just haven't figured it out yet.", "score": 2, "replies": []}]}, {"body": "lol, get fucking real", "score": 1, "replies": [{"body": "What part is \"not real\"?", "score": 1, "replies": [{"body": "> instead we'd rather pretend that a highly transmissible virus potentially worse than HIV/AIDS is a cold\n\nI mean, did you even read what you are writing?", "score": 1, "replies": []}]}]}]}]}, {"body": "bruh lol", "score": 2, "replies": [{"body": "It's an uncomfortable truth. Took me a long while to go from \"it's just a cold-like thing\" to \"this could legitimately be an extinction-level threat\", but that's what reading scientific literature has done to me. Shrug. I hope all the virologists and other medical researchers are wrong, but I'm not optimistic.\n\nMy personal policy is that I'm going to live like the world isn't going to be here in 10 years.", "score": 1, "replies": []}]}, {"body": "It's only more deadly if you don't take vaccine.", "score": 1, "replies": [{"body": "Completely untrue. The vaccine helps reduce the severity of acute illness and reduces apparent risk of long term disease (though that hasn't been confirmed -- it may just delay onset). However vaccines do not stop you from transmitting or catching it, nor do they give good protection against long term neurological and cardiovascular damage.\n\nYou should definitely still be vaccinated but it's a small part of the solution, not even remotely close to *the* solution.", "score": 1, "replies": []}]}]}, {"body": "Like the flu isn't deadly.", "score": 5, "replies": [{"body": "I think you’re misconstruing his point - you’re significantly more likely to die in a car accident than a flu, but you still drive right? You occasionally go on highways/freeways correct?\n\nOur tesla bias aside, what Shanghai did was absolutely over the top, and only delays/delayed the inevitable. They took some utterly inhumane steps to achieve their “goal”. \n\nLastly, it’s a bit of semantics, but I’d argue that the flu isn’t deadly, but it “can” be deadly in some unfortunate instances, predominantly in either very young, very sick, or very old people. Highly similar to COVID.", "score": 5, "replies": [{"body": "Deaths in the US due to car accidents in 2021: 31,720 (source: https://en.wikipedia.org/wiki/Motor_vehicle_fatality_rate_in_U.S._by_year)\n\nDeaths in the US due to COVID in 2021: 460,000 (source: https://www.cdc.gov/mmwr/volumes/71/wr/mm7117e1.htm)\n\nSo you are 14 times more likely to die from COVID", "score": 0, "replies": [{"body": "I was referring to the flu, not COVID. The key point here is that the flu is mature/has matured and we have mitigation strategies, just like we’ve developed with covid. You can also be in a dangerous car accident without actually dying.\n\nAlso, if we want to get specific, we’d have to stratify it by age group as the vast majority of covid deaths were from people 65 or older (I believe greater than 75%). For people younger than 65, that ratio is closer to 1 in 1,400. \nEach successive strain/mutation of covid also appears to be trending less and less virulent.\n\nThe data collection methodology around COVID deaths vs deaths with COVID is also obviously worth factoring into this comparison, and the initial waves of a pandemic vs. a mature endemic virus are going to be vastly different, and we are comfortably past the initial tsunami of mortality of a novel virus.\n\nI acknowledge making a sloppy comparison to make a point, but this isn’t an apt response to what I said.", "score": 1, "replies": []}]}]}, {"body": "are you suggesting the world shut down everything for the flu?", "score": 3, "replies": [{"body": "What I'm stating is the flu is deadly. We sweep that fact under the rug because, well, I don't fucking know why. And Covid is even more deadly and we're in the process of sweeping it under the rug too, using rationalizations like \"it's just like the flu\" which is a deadly disease in its own right.", "score": 2, "replies": [{"body": "Of course they are both deadly. However, shutting down the economy has dangerous mid and long term implications.", "score": 6, "replies": [{"body": "So we agree that the flu is deadly and that it is ridiculous to use \"it's just like the flu\" to ignore Covid. Splendid! Have a nice day.", "score": 5, "replies": [{"body": "It’s much worse than the flu. Covid can spread easier and is more deadly. Atleast that’s what all the doctors say and their research. I’m not listening to idiots without a medical degree calling it a flu.", "score": 6, "replies": [{"body": "There's some nuances.\n\nCountries that let go of all restrictions don't see more deaths and illness compared to a normal flu season.\n\nBut that's only true because we have omicron instead of the previous mutations. And because a large part of the population is vaxed with a very effective vaccine.\n\nThe Chinese vaccine is not effective. And they respond like it's a virus as deadly as ebola.", "score": 1, "replies": []}]}, {"body": "The point is, there are a lot of things that are potentially deadly. There are way more deaths every year due to car crashes than the flu. \n\nPutting any more restrictions on our society due to Covid is analogous to reducing the speed limit of vehicles to 15 mph max.", "score": 2, "replies": []}, {"body": "Dude is letting capitalism alter scientific facts. It's always interesting seeing how people's opinions on life changes once they become shareholders, LOL", "score": 0, "replies": [{"body": "Hmm a few people die or everyone die from starvation idk it’s a tough chose", "score": 3, "replies": [{"body": "You truly are underestimating this virus. You'd think that China, who by western standards do NOT care about human life, behaving like this would be alarming to most, yet it's not. The fact that people are just now worried about \"Long COVID\" and it's implications is crazy. Asian researchers already had shown SARS-CoV-1 has a subpopulation of people with essentially permanent symptoms/damage, some undetectable.", "score": 3, "replies": []}]}]}]}]}]}]}]}, {"body": "I’ve heard that part of their concern is that the vaccine they used there isn’t as effective, so if they let it sweep through a billion people, they’re going to lose millions.", "score": 1, "replies": [{"body": "I don’t know about it’s effectiveness, however I did read that a decent percentage of older people have not gotten the vaccine in China. Ironically this is probably because they thought Covid was going to be contained in China Due to the draconian efforts and lockdowns.", "score": 2, "replies": [{"body": "Yeah. Now I’m googling to fact check and I’m seeing mixed reports. One said that elderly were still facing a 3% death rate after full vaccination with Sinovac, about twice as high as for biontech but not necessarily high enough to warrant shutdown.\n\nIn any case, it is scary to think what will happen when it finally sweeps across the full population there, but I don’t think there’s much else to be done now.", "score": 1, "replies": [{"body": "I think they just need to focus their efforts on protecting the older population and let the rest of the citizens continue with their life.  Wearing N95 masks goes a long way in protecting against covid, perhaps offer special lines or times for older populations.  Trying to lock everyone down is not the answer", "score": 2, "replies": []}]}]}, {"body": "3 dose Sinovac has pretty much the same efficacy against severe illness/death as the mRNA vaccines for elderly according to a study in Hong Kong which had both types available.\n\n>In three-dose booster vaccination for people over 60 years old, Sinovac vaccine was 97.9% effective in preventing severe illness while for the Pfizer/BioNTech vaccine the efficacy rate was 98.0%. Meanwhile, the effective rate in preventing death of the Sinovac vaccine was 98.3% and for the Pfizer/BioNTech was 98.1%\n\nThe problem right now is that a large number of elderly are still unvaccinated (because it has been so safe in the last two years in a zero COVID country, they never felt the need to go, and there is no vaccination mandate in the country) or do not have their booster shot yet.\n\nHopefully Shanghai is a wake-up call to the elderly that they should go get vaccinated ASAP.", "score": 1, "replies": []}]}]}, {"body": "I'm crying", "score": 0, "replies": [{"body": "PAIN", "score": 0, "replies": []}]}, {"body": "Need this to be 200%. 👀", "score": 1, "replies": []}, {"body": "How have they managed that?", "score": 1, "replies": []}, {"body": "🚀 🌚", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "ugek0c", "created_utc": 1651455236.0, "score": 12, "upvote_ratio": 0.6, "num_comments": 82, "comments": [{"body": "Yes. Jump off the bunk bed your wife’s boyfriend tells you to camp out in while he’s clapping the cheeks.", "score": 31, "replies": [{"body": "He makes me lay on the same bed and watch. Although the view from the top would be interesting…..", "score": 13, "replies": [{"body": "🍻", "score": 5, "replies": []}]}, {"body": "You forgot the part where he then also makes him PPV that action from the bottom bunk where he landed after the fall 🤣🤣🤣", "score": 4, "replies": [{"body": "![img](emote|t5_2th52|8881) From nose bleed seats to spit bucket duty.", "score": 3, "replies": []}]}]}, {"body": "Puts on your battery...", "score": 14, "replies": []}, {"body": "You got lots of time bruh, plug your phone in and chill. Wendy's will still be there in September", "score": 13, "replies": [{"body": "True I figured I could get a head start tho. Early bird≠throat gets the *** ya know?", "score": 2, "replies": [{"body": "Upcoming split gonna be a problem for you. I'd cap that loss and move on. There's lots of trades. You don't gotta get rich off this one.", "score": 2, "replies": []}]}]}, {"body": "Update: one of you retards contacted the Reddit cares line and they messaged me inquiring if I’m having suicidal thoughts lmfao. You retards. I can’t end it all yet, I have another 1k. After this goes to 0 I will end it", "score": 27, "replies": [{"body": "They really do that or are you just fucking around?", "score": 3, "replies": [{"body": "They do that. I have had it done like ten times. People love me.", "score": 11, "replies": [{"body": "That's actually cool.. at 1st I was laughing thinking op was joking but then I thought about it for a minute.. you hear these crazy stories of kids losing their ass on margin and then killing themselves.. that's freaking insane.. I still don't understand how that even happens.  I don't remember the detail but that one kid lost like 800k on robinhood.  How does robinhood let that happen?  I must be missing some of the story..", "score": 7, "replies": [{"body": "Well I'm here just thinking there's better reasons to kill yourself", "score": 2, "replies": [{"body": "When I was a kid I never understood suicide.  I just couldn't grasp how anyone could ever do that.  Part of me still feels that way.. the one exception in my head is health reasons.. if you're terminal and are suffering then I get that.  I actually think you should be allowed to have a dr. Even do it.. we do it with pets and animals all the time.. we say they're suffering and it's inhumane, but then we're not allowed to do it ourself.. obviously you'd need multiple dr. Signatures and whatnot.. it'd have to be just extreme cases.. but why not.. it especially sucks for people that are suffering and have life insurance policy's for their family.. they can't do it bc then their families won't collect on the policy.. idk.. I don't agree with that.. I'm getting way sidetracked especially for this sub.  Sorry", "score": 2, "replies": [{"body": "I was thinking your last sentence like after the first period.", "score": 3, "replies": [{"body": "Lmao 🤣", "score": 2, "replies": []}]}]}]}, {"body": "Saddest part of that (from what I understand) is that it was a credit spread of some nature that had one leg prematurely exercised. If he had just exercised the other leg against the first he would have been far less in the hole. He panicked before ever being able to get ahold of Robinhood to get it squared. Someone correct me if I'm wrong.", "score": 2, "replies": [{"body": "No you're right.", "score": 3, "replies": []}]}]}]}, {"body": "Lmao they actually did message me with hella resources on suicide prevention line. Smh I’m going long on $deepthroat", "score": 1, "replies": []}]}, {"body": "Calls on life insurance", "score": 2, "replies": []}, {"body": "Imagine all the stuff you can do with zero repercussions.", "score": 1, "replies": []}, {"body": "Noone contacted...Screenshot enough to raise concern", "score": 1, "replies": []}]}, {"body": "RIP", "score": 7, "replies": [{"body": "RIP", "score": 2, "replies": []}]}, {"body": "See ya at the Wendy’s", "score": 7, "replies": []}, {"body": "1300 better than the 0 it will be on expiry.  Cut your losses this is a no win trade", "score": 4, "replies": []}, {"body": "Whatever rally we get on earnings, sell your calls on open wednesday, buy same expiry lower strike on Friday close", "score": 3, "replies": [{"body": "Will do, I don’t want to sell for more than a 2k loss though", "score": 2, "replies": [{"body": "AMD usually runs for 5-7 trading days after positive earnings.", "score": 1, "replies": []}]}]}, {"body": "That’s going to expire worthless", "score": 3, "replies": []}, {"body": "You lose $5,000 with call plays.  I lose $85,000 with call plays.  We are not the same.", "score": 6, "replies": []}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": [{"body": "I entered $AMD thinking I would x2 my money. Instead I had to x9 my free time behind the Wendy’s dumpsters going long on $throat", "score": 6, "replies": []}]}, {"body": "F", "score": 2, "replies": []}, {"body": "At $17 for a meal, I'll only have $3 for you out back...", "score": 2, "replies": []}, {"body": "This should be a wake up call to the options traders. We all started off trading options until we bit the bullet and got our cheeks clapped. The market is a MANIPULATION you won’t win the options game it’s like gambling. You win once and twice! Now you lose 3, 4, 5 and 6 then claim you ‘at least’ broke even. Don’t lie to yourself pick up the real shares and DRS so the shit is actually yours forever n", "score": 1, "replies": []}, {"body": "Exp 8/19... you're fine\n\nEdit: I have $115, 6/17", "score": 0, "replies": []}, {"body": "Sell buy SPY put", "score": -1, "replies": []}, {"body": "Sell buy AMC", "score": -1, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|1 year ago\n**Total Comments**|54|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=ugek0c)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=ugek0c)", "score": 1, "replies": []}, {"body": "Earnings this week?", "score": 1, "replies": [{"body": "$70 just around the corner", "score": 5, "replies": []}, {"body": "Bro it would have to shoot up to $110 after earnings for me to get my money back. I doubt it. Everything that had earnings recently is crashing and $SPY is hitting $400 end of month. Damn it", "score": 1, "replies": [{"body": "Spy 370 has entered the chat", "score": 4, "replies": [{"body": "I should’ve bought puts smh", "score": 1, "replies": []}]}]}]}, {"body": "You should be fine", "score": 1, "replies": []}, {"body": "You either go long $deepthroat or you don’t throat at all.", "score": 1, "replies": []}, {"body": "How is that even worth a dollar lol", "score": 1, "replies": []}, {"body": "Charge you phone", "score": 1, "replies": []}, {"body": "Charge your phone retard", "score": 1, "replies": []}, {"body": "All lost. Now let it hit 0, cause you deserve it for being greedy", "score": 1, "replies": []}, {"body": "Lmao my guy", "score": 1, "replies": []}, {"body": "these can print ![img](emote|t5_2th52|6880)", "score": 1, "replies": []}, {"body": "So how screwed are my SPY $400p 5/2?", "score": 1, "replies": [{"body": "As of pre market today, put it this way - I wouldn’t want to be in your shoes.", "score": 1, "replies": []}]}, {"body": "I would go ahead and buy some puts to offset those calls.", "score": 1, "replies": []}, {"body": "Ill be there for my session", "score": 1, "replies": []}, {"body": "Calls on overvalued tech that relies on political peace in high inflation global war... no worries bro it'll moon anyday", "score": 1, "replies": []}, {"body": "Oof. You have a lot of time, but you’re way off the mark and I think summer is going to bring a lot more pain to the market, with tech stocks taking a beating. I don’t think you’re going to win this one, but I’ve been wrong plenty of times before 🤷‍♂️", "score": 1, "replies": []}, {"body": "inverse  WSB , so buy put.", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4267)", "score": 1, "replies": []}, {"body": "You should invest on a charger ![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "Some of this companies may be open for a take over if they keep bleeding 🩸 for much longer, and MAD might be one of them, there is hope there was one that was doing stock split can’t remember the name now too drunk to recall ![gif](emote|free_emotes_pack|sweat)", "score": 1, "replies": []}, {"body": "Yeah you got lots of time. You could also average down since you’re at -79%", "score": 1, "replies": []}, {"body": "Here I was expecting an expiry in twelve seconds. \n\nIt's cool, dude. Not an amazing position to be in, but the sky isn't falling. They've got earnings, and they're fucking AMD.", "score": 1, "replies": []}, {"body": "I just want to ask if you had an exit plan (stop)? Or it was a buy and hope trade?", "score": 1, "replies": []}, {"body": "Rip. Sell all 10 and buy one atm and maybe you have a chance to make some money.", "score": 1, "replies": []}, {"body": "If your getting fucked I'll buy some puts in the morning", "score": 1, "replies": []}, {"body": "Do a flip because you probably won't be okay.", "score": 1, "replies": []}, {"body": "You frosty bro", "score": 1, "replies": []}, {"body": "Not going to be ok...", "score": 1, "replies": []}, {"body": "I hear crow is delicious this time of year.", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4267)![img](emote|t5_2th52|4267)", "score": 1, "replies": []}, {"body": "how do you buy calls in a (btw VERY obvious) bear market", "score": 1, "replies": []}, {"body": "Those are rookie numbers, you need to get those numbers up.", "score": 1, "replies": []}, {"body": "You're fucked bro it's expiring worthless", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "ugme25", "created_utc": 1651486467.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 82, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|1 hour ago\n**Total Comments**|0|**Previous DD**|\n**Account Age**|2 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=ugme25)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=ugme25)", "score": 1, "replies": []}, {"body": "People here buy high and sell low. This is WSB. 😂", "score": 65, "replies": []}, {"body": "Better than buying it before the crash at least", "score": 27, "replies": [{"body": "What are the chances to gain profit ?", "score": -11, "replies": [{"body": "0 - 100%", "score": 54, "replies": []}, {"body": "This crash will take 2-3 years. Might need to pivot your game plan lol", "score": 11, "replies": [{"body": "Yah heard it here first ladies and gentleman, one of the few sell offs longer than the above was the great depression...doubt it'll last this long... 1 year max", "score": 2, "replies": [{"body": "I agree. The quantity and frequency of interest rate hikes alone will cool inflation down pretty quickly. I see bottom happening this fall", "score": 2, "replies": [{"body": "They aren’t able to even hike interest rates which should be massively alarming. 10% hedged inflation numbers and they can’t even do a .3% hike without crashing the market. \n\nTheir QE is to let inflation run and use bonds to cycle debt. \n\nThey can’t hike without crash\n\nThey can’t do nothing without crash\n\nThey can’t even hike a small amount without a crash\n\nTheir best bet is to do the bond route which will also crash but hopefully longer down road\n\n(2 more months max) lol", "score": 3, "replies": []}]}, {"body": "L \n\nhttps://goldsilver.com/blog/what-all-market-crashes-have-in-common/\n\nAnd this was before 80% of the current dollars were printed. \n\n2-3 years was conservative. I’m guessing 4-5+\n\nEdit: nvm dudes a shill saying market won’t crash on WSB lmaoooooooooooo. This is your red flag too.", "score": 1, "replies": [{"body": "How long was the GFC my good friend?", "score": 0, "replies": [{"body": "The GFC hasn’t even crashed yet my friend. It’s been can kicked to today with 10X more current market leverage than in 08. Read House of Cards due diligence posts. Series 1-4. You will learn or you can come back and say I’m wrong. Either way I’m set just trying to help spread awareness. :)", "score": 0, "replies": []}]}, {"body": "Also would you expect anything more from a website that literally has gold in the name? Come on ma man", "score": 0, "replies": [{"body": "I just pulled it for the chart only, which ends in 2018 before it went br. I wanted to tag some other subs posts but don’t want to violate brigading. Was the first chart I saw on google image.", "score": 1, "replies": [{"body": "Let me log into Morningstar direct or Bloomberg and I'm sure I can manipulate the data anyway to suit my narrative", "score": 0, "replies": [{"body": "A whopping 0 karma. \n\nWe got paid shills saying the market won’t crash on WSB. \n\nYou know what that means lmaooooooooo", "score": 0, "replies": [{"body": "So anyone who doesn't agree with you is a paid shill? You're an idiot.", "score": 0, "replies": [{"body": "You have 6 karma", "score": 1, "replies": [{"body": "Hahaha you cared enough to look, pathetic", "score": 0, "replies": []}]}]}]}]}]}]}]}]}, {"body": "... and what gives you this idea?", "score": 1, "replies": []}]}]}]}, {"body": "A crash will wipe out some companies. I bought some bank stocks during 08 crash because banks never go under right. Lesson learned.", "score": 26, "replies": [{"body": "Just load up on spy and let it ride after the crash", "score": 5, "replies": [{"body": "Yeah.  The indices will rebound", "score": 1, "replies": []}]}]}, {"body": "What do you mean by \"crash\"? For example, do you mean a sudden drop in the S&P500? The tricky bit is you dont know if the market will drop even lower. Right now we're pretty much back to where we were a year ago. Is this the bottom? Or can the market fall even lower?\n\nWe've been in a bull market for ages. A bear market that may continue on for some time can mean the stocks you buy now may go even lower. And, when the trend reverses back to a bull market, the new market leaders may not be the same stocks that led the way in the previous bull market. So it's risky.\n\nRemember, while the general idea is to \"buy low, sell high\" it's hard to know if the current price is low or high until some time has passed. A $10 share price for a stock that traded at $100 a month ago might seem low but if it goes to $1 in a month, buying at $10 would be buying high.\n\nThat's why another saying is \"buy into strength, sell into weakness\". If a stock is in an upward trend, it seems likely that the current price, even if it seems high, would actually be a low price relative to the future.\n\nA $1 stock that goes to $10 in a nice, even slope, can go up to $20, $50, $100, a $1000. Who knows? So while $10 may seem high compared to $1, it may actually seem low in the future. And if the trend reverses and starts going down fast (weakness), you can always cut your losses early and sell. If it reverses again and starts going up (strength) you can always buy back in.\n\nSince the overall market currently seems weak, it doesn't make much sense to buy it. The only exception would be when everyone is so exhausted and bearish that all the sellers have already sold their positions. At that point, selling pressure drops to a minimum and you start seeing a slow but steady rise in buying. That's a sign of a trend reversal. If you want to take the risk, you can get in then or wait for confirmation (more strength).", "score": 21, "replies": []}, {"body": "Bc if you buy cheap stock after a dip, it’s harder to show your loss porn.", "score": 14, "replies": []}, {"body": "If you actually want to make money in the market, set aside a small amount each month, and buy VOO every month, regardless of the price. Right now it’s around $375. If you do this every month for 30 years you’ll make more gains than 99.999999% of the people in this sub.", "score": 10, "replies": [{"body": "If you want to make more money than people in this sub, just convert everything to cash and sock it under your mattress.", "score": 8, "replies": []}]}, {"body": "Don’t try to catch a falling knife", "score": 13, "replies": [{"body": "Too late and I was successful... \nDoesn't mean my stocks aren't in the tank but I can catch a knife pretty good", "score": 3, "replies": [{"body": "The best method is using your head", "score": 8, "replies": [{"body": "Or your dick.", "score": 1, "replies": [{"body": "Or someone else's", "score": 3, "replies": []}]}]}]}]}, {"body": "After?! What does that mean? Do you know when the after starts? I guess that's the problem.", "score": 4, "replies": []}, {"body": "It’s a great idea to buy now just make sure you buy companies that will survive or, better yet, buy the index.   Don’t try to lump sum in at the bottom, just start averaging in now.", "score": 3, "replies": []}, {"body": "What is your goal? Longterm invest (more than 10 years)? Than it’s a good idea if you find cheap stock", "score": 2, "replies": []}, {"body": "Because the smart money doesn't short stocks from $80 to $6...they short them from $6 to $0.\n\nMore often than not, after a crash, a company's stock continues to go down.", "score": 2, "replies": []}, {"body": "You can’t ‘technically’ be a teenager. You’re either in your teens or not… you could technically be an adult or a child, though. You belong here.", "score": 2, "replies": [{"body": "Thanks man", "score": 2, "replies": []}]}, {"body": "I did exactly this in the 2020 crash and my money is still doubled from it.", "score": 2, "replies": []}, {"body": "The thing is none of these idiots you’re asking on here know. Because if we did we would not be on here trying to get rich 😂 DCA into blue chips and indices and hope for the best. None of us are good at this. Clearly.", "score": 2, "replies": []}, {"body": "So you guys mainly made jokingly answers. So the things I think I understood are: A crash goes a long time, the chances of a stock falling more over the years are high.", "score": 4, "replies": [{"body": "Here is a non-joking answer.  You never know when it hits bottom, so investing on the way down, short term, will look like a lot of loss.  Take Random Stock A for example, normally sells around $100 a share.  It plummets to $50, so you grab 1000 shares for $50k.  It keeps going down to $10, so now you only have $10k, a loss of $40k.\n\nBut!  If you do not sell at $10, and the company survives the crash, it could go back up well beyond where it was.  There are two hard parts in this.  First is picking a company that will survive the crash,  and even as they crash this stock is typically expensive.  This isn't the time to invest in a company you have never heard of, it's the time to invest in a company that is going to still be here long after we all die.  The second part is ignoring that money until the crash is over and it becomes profitable.  The above example is only a loss of $40k if you sell at $10, if you wait for it to turn profitable, you didn't lose anything.  \n\nCrashes happen because a little dip upsets enough people that they leave the market, causing a big dip, scaring more people, amplifying the dip in a vicious cycle.  If you have the confidence to invest and not panic sell when the stock goes down, in the long term you will make money.\n\nThe reason you are getting a lot of joke responses is because most people in wsb (at least the ones who talk) aren't playing long games, they want to make lots of money fast, so they play a lot of short games.  Instead of trying to 200% their money with a solid investment with lots of research and due diligence (DD if you see that posted), they are investing in things that, short term, should see an increase, then pulling it out and investing again.  Both ways have their merits.  Both ways require a certain mindset.  Find out which mindset you are, and then stay the hell away from the other kind, because you just get piles of crap with very little usable info.\n\nI hope this helps.  If it makes you a millionaire, lemme get a couple hundred thousand. 😜", "score": 11, "replies": [{"body": "Thanks man. And If I manage to then we can chill on my yacht 😂", "score": 1, "replies": [{"body": "I don't need a yacht, spent enough time on a boat in the Navy.  But debt free? Hell yeah.", "score": 2, "replies": [{"body": "Do you like beach houses?", "score": 1, "replies": [{"body": "I mean, yeah? But I'm not greedy or anything. I'd rather a paid off shack than a beach house with payments, if that makes sense :p", "score": 1, "replies": [{"body": "Yes,yes that makes sense", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Imagine you're a Hollywood agent where the celebrities are your stocks.  What you're saying is this:\n\n\"Hey looks like Amber Heard gal is suddenly working for much cheaper prices!! I'm going to put her into tons of movies because this woman is stable, costs me next to nothing, in fact, she's so good and cheap that I think she's going to win 10 oscars!\"  1 oscar = 1 bagger after all!\n\n....that's what your proposing.  Everyone thinks they can buy a shitball stock that fell apart because, certainly somehow, it must come back.  It does happen but it's far less predictable. \n\nFFS, Roseanne Barr commands a smaller salary in 2022 than she did in 1992 but you don't see me signing petitions to put her racist ass as the lead in some sexy-teen vampire show.\n\nIf a company is suddenly cheap...there's a reason.  If you think it's value, play it.  But chances are, you're idea of value is out of whack here.", "score": 2, "replies": [{"body": "That is a really good example. It really helped me to understand the main topics. Bro you should be more often by my retardet as side", "score": 1, "replies": [{"body": "It's psychology too.  Many want to feel special; like they have a gift to see value in something others didn't.  In reality, it's the same idea as people thinking their shit doesn't stink but with extra steps.\n\nOn this instagram stage we call life, you're just another influencer on the plane ride back from Dubai with a tear in their eye clutching to their soiled and wrinkled bag of wet wipes.", "score": 1, "replies": []}]}]}, {"body": "If you are technically a teenager that means you are struggling to understand how to count to 20, or your country doesn't have a decimal calendar. You will do well here.", "score": 1, "replies": []}, {"body": "That’s like asking why it’s not a good idea to buy a cheap hooker after you just spent all your wife’s boyfriend’s college fund for your kids on tons of blow. 🫤", "score": 1, "replies": [{"body": "Well no because I have the answer to your question .But mine needs some general knowledge and experience which I don’t have.", "score": 2, "replies": [{"body": "Not to be a dick, but not gonna get what you're needing on social media. Go to subs more suited to beginners and ask what books to read. Parsing through the amount of bullshit you'll get with comments is a waste of your time. Save yourself the hassle.", "score": 0, "replies": [{"body": "Good advice thanks man", "score": 1, "replies": []}]}]}]}, {"body": "Define cheap", "score": 1, "replies": [{"body": "If it looses a a big amount of worth suddenly in 4-10 Hours", "score": 1, "replies": []}]}, {"body": "It depends on the stock but this is a casino so the goal is to lose money.", "score": 1, "replies": [{"body": "Speaks in gambling Addiction: Investing all my money in one stock that might go to the moon you say?", "score": 0, "replies": [{"body": "Yes, check the main thread for flavor of the month, cause the worthless companies that will moon are only recognized by misunderstanding RSI and short interest.", "score": 1, "replies": []}]}]}, {"body": "People get awfully bitter when you buy low and sell high. It’s the not the WSB way.", "score": 1, "replies": []}, {"body": "The expect it to get worse. You'd have to very lucky to time it at the absolute bottom and you might miss the bottom", "score": 1, "replies": []}, {"body": "I always check the debt loads and the potential for bankruptcy after a crash.  That is your biggest concern with a cheap stock crashing.  Otherwise, it could just be an anomaly and a good buying opportunity.", "score": 1, "replies": []}, {"body": "depends why the stock crashed....", "score": 1, "replies": []}, {"body": "How do you know you are \"after the crash\"? You can't.   \nLook up the Nikkei225 from 1990 to 2003.  \nEveryone prefer investing when everybody is buying, because everyone is confident, and because in the event you wrongly estimated your edge, you can still hope to find someone more optimist to sell to. People feel things are going up, they want to get in as soon as possible. They feel they can get real rich : they buy on margin, inflating prices even more.  \nIn a bear market, and during crashes, everyone is mad cautious. People sell quickly because gain todays might not be gains anymore tomorrow. Buyers want to be sure to make money so the ask prices get lower and lower.  \nWhen things are going down, you must be ready to buy and stomach another halving in value and diamond hand through years, cause you believe in your picks. During crashes, the whole financial market gets cautious, not only the stock market. Some companies will go bankrupt and wont find anyone to loan them money or speculate on future huge valuation. Outside of crashes, these events are rare and take a long time to unfold. You must be ready to lose all your money, not just take a 30% loss.  \nYou can't bet on margin either without huge collaterals : another halving and all your money is gone. Time plays against you, the longer the market goes down or sideway, the more money you lose.", "score": 1, "replies": []}, {"body": "Because of the dip of the dip of the dip of the dip of the dip of the dip of the dip", "score": 1, "replies": []}, {"body": "You risk that it drops further and your money is locked for years. Youd have to speculate about when the crash ends. During the covid crash the bottom was very early. In 29 it was late. But thats about it, i guess. \n\nAlso if you buy individual stocks they could go bankrupt. A mkt crash affects more than just stock prices. It could mess up growth, profits etc. That being said, buying on the way down and the way down and diversifying is the way to long term wealth creation. That being said, this is WSB. Don't use financial instruments you dont understand.", "score": 1, "replies": []}, {"body": "Stocks arent YoYos.", "score": 1, "replies": []}, {"body": "🚀🚀🚀🚀", "score": 1, "replies": []}, {"body": "What stocks are low? Everyone is saying they see red but don't say which positions", "score": 1, "replies": []}, {"body": "It's a fantastic idea as long as you're investing in companies that are definitely going to bounce back and continue to grow because the crash is just a symptom of Market fluctuation and not something like Netflix. For instance of Google is a great buy right now but only if you plan on holding on to it for a while which I always recommend. I'm not an accountant I'm not qualified to give Financial advice don't sue me but I have money in that one myself and I bought it long enough ago that it would have to crash a lot further before I saw any losses on it so I'm not motivated to pump that stock up.", "score": 1, "replies": []}, {"body": "Stop the falling knife with your foot ![img](emote|t5_2th52|8881)", "score": 1, "replies": []}, {"body": "All in TSLA", "score": 1, "replies": []}, {"body": "It is a good idea. You're asking in the wrong place", "score": 1, "replies": []}, {"body": "Uhhh, because it will go cheaper. The forecasts for everything are waaaaay off.", "score": 1, "replies": []}, {"body": "May 4th is my birthday. This Alaskan pipeline of a market better be green by then.", "score": 1, "replies": []}]}
{"title": "Dumping my entire savings into chip stocks", "selftext": " Hello, I'm a 25 year old PhD student. I have 2-3 years left and make enough money from my stipend to live and save small amounts. I have that juicy intergenerational wealth, about 20k in my savings. I've gotten my toes wet with investing over the past two years, (had in about 3.5k but that's now 2.5k :) ). I want to go all in on chip stocks, but I'm not sure when to buy. I'm most attracted to intel because it has a dividend and is a safe-ish stock. But I also have a stake in nvidia, amd, and tsmc. I would like to increase my stake in all of these. What things should I take into consideration when buying these stocks during this crash?", "id": "ugzbcx", "created_utc": 1651524510.0, "score": 10, "upvote_ratio": 0.59, "num_comments": 90, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|17 minutes ago\n**Total Comments**|0|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=ugzbcx)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=ugzbcx)", "score": 1, "replies": []}, {"body": "Safe? Dividends? Actual stock? I think you made a wrong turn buckaroo", "score": 98, "replies": [{"body": "We don’t take kindly to learned folk around here", "score": 16, "replies": [{"body": "![img](emote|t5_2th52|4886)", "score": 2, "replies": []}]}, {"body": "Sorry, I found I learn best from memes...", "score": 4, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}]}, {"body": "SPY calls tmrow", "score": 33, "replies": []}, {"body": "Pepsi owns frito-lay.  They have really good chips.  That's a good one to look at. PEP 😁", "score": 26, "replies": [{"body": "Yes but Doritos is the only chip to be buying now. We be holding full bags soon thanks to papa musk.", "score": 3, "replies": [{"body": "Doritos is a product of frito-lay.  Come on man, do your research", "score": 1, "replies": [{"body": "No no no, u may be some chip expert, but elon said doritos so he must be buying just doritos from frito lay.", "score": 1, "replies": []}]}]}, {"body": "😋", "score": 1, "replies": []}]}, {"body": "Wrong group. Try r/Stocks.", "score": 34, "replies": []}, {"body": "If you aren’t going all in on soxl you don’t belong here", "score": 20, "replies": [{"body": "Dont threaten me with a good time", "score": 14, "replies": [{"body": "Do it. I’m in it heavy right jow", "score": 4, "replies": []}]}, {"body": "Bought at $27. Almost went balls deep with my reserves this morning.", "score": 1, "replies": []}]}, {"body": "Remember what happened to solar a while back? Gonna happen to chips next. You missed that bus by about 2 years.", "score": 7, "replies": [{"body": "So puts on chips.", "score": 1, "replies": [{"body": "I don’t mess with options. Timing is near impossible. Too hard to exploit pricing inefficiencies", "score": 1, "replies": []}]}]}, {"body": "Well we’re about to enter a recession in the next 6 months so id consider not buying more on every single dip. But increase your stake gradually", "score": 16, "replies": [{"body": "The advice I'm looking for, thanks!", "score": 6, "replies": [{"body": "Consider capital light companies if you’re going for stocks. With rising inflation the next few quarters might be rough on profits and post less than favourable earnings reports.", "score": 5, "replies": []}, {"body": "Anytime my man, lost most of my life savings with options and squeeze stocks so my investment style is gonna be similar to you in the coming years. If you still want to feel a rush maybe allocate 5% of your portfolio to buy otm puts on squeeze stocks that have ran up with no rhyme or reason, NFA and best of luck 🍻", "score": 2, "replies": []}, {"body": "Try r/investing my man", "score": 1, "replies": []}]}, {"body": "I prefer the guacamole.", "score": 0, "replies": []}]}, {"body": "Avoid single stock risk with an etf like SMH or SOXX. Or just keep adding to the basket of semi stocks you already have, and round it out with a few more. \n\nAs a long term investor, right now is a great time to buy. Anyone who is sure the market’s going one way or the other has too much confidence for their own good. The market could very well go lower, at which point you can add to your positions. If you don’t know what dollar cost averaging is, look it up. It’s a simple, tried and true buying strategy.", "score": 5, "replies": [{"body": ">dollar cost averaging is\n\n&#x200B;\n\nThanks for the advice!", "score": 3, "replies": []}]}, {"body": "Typically it would be smart to diversify more than this. You're putting all your money and faith into a single industry that could very well change over the next few years. On top of that, diversification across a whole sector is not something intelligent investors do. You're better off narrowing your investment in semiconductors down to 1 or 2 companies that are showing more promise than the others. Take everything into consideration: growth prospects, diversity of income/revenue, PE ratio, trend, future plans, debt, etc.\n\nIntel is probably dead in the water, for example. I'd scratch that from the list immediately. TSMC is facing huge risk with the CCP. They're undervalued but that is for very good reason. In all likelihood, the US will probably expand their own semiconductor capacity in a big way over the next few years. That will take share away from a company like TSMC which, at the moment, manufactures 92% of the world's supply of chips.\n\nYou should probably dig deeper into the chip industry and make more informed decisions on which companies stand out to you. For my money, it's AMD and Nvidia, but that is reflected in higher prices too.\n\nJust be careful about putting all your eggs in one basket. Having a portfolio that spans multiple sectors is a very good idea, particularly in this fiduciary environment. Good luck!", "score": 6, "replies": []}, {"body": "May i ask why the chips?", "score": 4, "replies": [{"body": "Chips and beer tasty 🍺", "score": 6, "replies": []}, {"body": "I built my own PC durring the pandemic and became really interested in semiconductors. I just like em, think theyre important, and spend a lot of time reading about advancements in computing technology.", "score": 3, "replies": []}]}, {"body": "I'd yolo intc the ex div date is the 5th btw for the next sweet dividend.\n\n&#x200B;\n\nAMD earnings is tomorrow btw, intel's was the other day", "score": 3, "replies": [{"body": "I'm jacked to the tits on INTC", "score": 4, "replies": []}]}, {"body": "I work in transportation, if you can buy undervalued food brands and grocery chains. They will benefit the most from inflation KR, KHC", "score": 3, "replies": []}, {"body": "Step one of investing don’t invest all you’re money into one sector", "score": 3, "replies": []}, {"body": "If you’re confident about a stock, and want to yolo your savings into it, it’s better to go for Leaps. They are less riskier, and you earn more. You can exit the position with significant losses but you’ll lose maybe 50% before you realize the leaps are not going to be profitable. I made 14k on Nvidia leaps (with 7k) during the last bull run. \nIn any case, there are a few problems. Statistics are showing stock market is in its worst downtrend since the past 77 years, and it is also being predicted that another real estate bubble is about to burst. Right now short term plays are okay but long term plays seem extremely risky.", "score": 3, "replies": []}, {"body": "Don't. But when you learn to read charts, lmk when you see a curl in $NVTS\n\nStay in school. Or quit school and learn what you really want to learn\n\nI'm in intel with you for the dividend (but could probably make more day trading it lol)\n\nBut don't listen to me, I grew up licking 9 volt batteries and listening to Speak N Spell (powered by Texas Instruments)", "score": 3, "replies": []}, {"body": "Get some casino chips instead.   This is the way", "score": 5, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}, {"body": "The \"crash\" is not over. The Federal Reserve has 5 more hikes planned through 2024. It's bad medicine. They have avoided it twice before namely the last attempt to normalize rates back fall 2018.\n\nThey can't stop with normalization other the USD is going to collapses. They know it.", "score": 3, "replies": [{"body": "Priced in.", "score": 3, "replies": [{"body": "You cannot price in leverage. You cannot price in fraud (that is sitting in off balance accounts). \n\nYou cannot price in fear. You cannot price in how people will react when they are worried about getting fired for not \"hitting their numbers\".\n\nThe tide is going out. You will see alot of people were swimming naked over the last 10 years. A lot of inexperienced investors are going to get their skills tested....and they are going to realize they don't have any skills.", "score": 1, "replies": []}]}, {"body": "More like the crash has yet to begin.", "score": 1, "replies": []}]}, {"body": "ASML 🤌🏼🚀", "score": 5, "replies": []}, {"body": "Take into consideration that some of these are or were extremely overvalued.  NVDA still trading at 50x.  I like Intel at the current price though.", "score": 2, "replies": []}, {"body": "just but soxl then. Easy", "score": 2, "replies": []}, {"body": "Proof that you can be an absolute retard and a doctor (fake doctor… but still a PhD)", "score": 2, "replies": [{"body": "It's a wonder they pay me 50k a year to go to school over \"real doctors\" truly baffling stuff. It's almost like medical doctors wouldn't have the tools to treat people without us biomedical engineers. Weird stuff...", "score": 1, "replies": [{"body": "Sounds retarded. Good luck at the casino though. Also, stick around on WSB. You’ll learn not to take anything serious.\n\nGood luck in your studies.", "score": 1, "replies": []}]}]}, {"body": "Who gives a damn if your a PhD student. You think that makes you smart?", "score": -6, "replies": [{"body": "Ohhhh shitt we got a smart off!", "score": 14, "replies": []}, {"body": "He thinks hes smarter than you!  DUEL!", "score": 10, "replies": [{"body": "THERE CAN BE ONLY ONE!", "score": 4, "replies": []}]}, {"body": "Smarter that you, numnuts", "score": 5, "replies": [{"body": "Can’t tell if numb was sneaky spelt incorrect or if your smooth brain is showing", "score": 5, "replies": [{"body": "Bite my pp you degenerate", "score": 0, "replies": []}]}]}, {"body": "Settle down there buckaroo.   We can jump him and rob his ass out back of the Wendy's once nobody is looking", "score": 2, "replies": []}, {"body": "I'm trying to give context to my situation.", "score": 4, "replies": [{"body": "Obviously", "score": 2, "replies": []}]}, {"body": "Yes.", "score": 0, "replies": []}]}, {"body": "Buy AMD pre earrings.. this Earnings report should be good. Their next earning might not be", "score": 1, "replies": [{"body": "'might' is the operative word. AMD is currently in a position to leave some sales on the table in favour of high margin products. As they get more wafer allocation they are going to eat the lunch and dinner of intel first and then nvidia. Intel are trying their their best to block the tsmc capacity. But AMD design and architecture (zen,mcm,stacked chips..) is capable of delivering higher performance even at legacy nodes. Dr Su & Papermaster have put AMD at a very sweet spot. In my opinion AMD is a long time hold.", "score": 3, "replies": []}, {"body": "You think they’ll give weak guidance? (Supply chains, inflation etc?)", "score": 1, "replies": []}]}, {"body": "It should be a decent time to buy semiconductor stocks as they have been hammered. Qualcomm, Nvidia, Broadcom, and AMD are good options. Intel will probably grow less than those but it's still better than hoarding cash.", "score": 1, "replies": []}, {"body": "Your PhD in electronics?", "score": 1, "replies": [{"body": ">Leaps\n\nMolecular biology\n\n&#x200B;\n\nI just like computers", "score": 1, "replies": [{"body": "Well I would apply moore’s law to the current capabilities each company’s products and apply it to their forecast and invest wisely.", "score": 1, "replies": []}, {"body": "[https://www.reddit.com/r/stocks/comments/ue5zwj/intc_has_no_match_for_amd/?utm_source=share&utm_medium=ios_app&utm_name=iossmf](https://www.reddit.com/r/stocks/comments/ue5zwj/intc_has_no_match_for_amd/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)", "score": 1, "replies": [{"body": "Yeah, I'm 100% investing for domestic chip production. \n\nFrankly china is on the cuff of a pariah state. They'll tank AMD and Invade Taiwan in the same step if it benifits their autocratic regime. Although I'm invested in both, have more money in both atm, and hole heartedly believe AMD makes better chips, I also deeply distrust China in the long term.", "score": 2, "replies": []}]}]}]}, {"body": "The trick is to go all in at the bottom, then can cash out at the top for maximum gains.", "score": 1, "replies": [{"body": "Is the bottom 0?", "score": 1, "replies": []}]}, {"body": "I am sorry to hear you only have 2/3 years left. Go for it boy.", "score": 1, "replies": [{"body": "\"only\"", "score": 1, "replies": []}]}, {"body": "But the chip stick with the best supply chain.", "score": 1, "replies": []}, {"body": "VanEck semiconductor ETF has a pretty good balance. I like ASML, AMD, and Nvidia but they trade at pretty high P/E. Qualcomm and MU continue beating estimates and are extremely discounted in comparison. Not a huge fan of Intel since their market share decreases every year, but they do plan on turning it around, if you have faith in them. I stay away from TSMC because China will likely invade Taiwan in the not too distant future.", "score": 1, "replies": []}, {"body": "Given your currently well off situation I advice caution around these parts. Not a helpful answer to your question, just friendly advice", "score": 1, "replies": []}, {"body": "I too have gotten my toes wet. In your mother.", "score": 1, "replies": []}, {"body": "Chances r u’ll lose more.", "score": 1, "replies": []}, {"body": "I only have 3 words for you - VWCE .......", "score": 1, "replies": []}, {"body": "Don't buy INTC they qre forecasting to make less money in the future and the dividend is at risk as they are doing a lot of CAPEX 100B+ an are beggng the government for  subsidies, it wouldn't look good to ask for money while squandering it in dividends.\nConsider the following\nMRVL for no pc exposure, just server\nNVDA data center + pivot into software\nAMD data center + a bit of pc\nTSM top chip foundry\nUMC budget chip foundry\nAMAT/ASML/KLAC for chip manufacturing equipment", "score": 1, "replies": []}, {"body": "MU.", "score": 1, "replies": []}, {"body": "Late on the reply but I recently just did this after thorough review of the market. I think this is a good entry point and the semi industry is poised for growth almost regardless of the US market. My most high conviction stock is INTC. Why invest in my tenth best idea and not just my top best (per Buffet and Lynch). INTC has terrible sentiment in the market and its stock has taken a beating (good for cuurent buyers), and it has a low single digit PE, great revenue (multiples of its chip design competitors), and in an industry that is expanding over the decade. They are now spending billions a year on fabs and r&d. They didn't in years past and are paying the price now. It is good to see them correct this but the capex will weigh on earnings over the next few years. Definitely don't invest in the fabless companies with high PE priced to perfection (AMD, NVDA); those companies are reliant on China/Taiwan with massive geopolitical risk. See my post a week ago on my yolo play on INTC with $500k. Collect my $16k/yr dividend while I wait for it to get to at least a 15 or 20 PE and hopefully increased earnings (potential 3x to 4x return).", "score": 1, "replies": []}]}
