{"title": "People who started investing 2015 onwards, how much are you up/down?", "selftext": "\nJust wanting to get an idea how much pain new investors are in. \nWhat year and what % gain/loss are you at?\nPresumably the last year has been really rough for most people. I started in January 2021 in hype and my only green is Apple. Portfolio still down 25% but would be much more if I hadn’t kept buying recently. \nLooking to build big positions in GOOG, AMZN, DIS now", "id": "ufzbsk", "created_utc": 1651409771.0, "score": 24, "upvote_ratio": 0.81, "num_comments": 86, "comments": [{"body": "Started in 2014, I am up 317%. Got a few lucky breaks so I might be an outlier.", "score": 38, "replies": []}, {"body": "I don’t believe anyone in this thread.", "score": 30, "replies": [{"body": "Probably just survivorship bias. This is one of the few thread made just for people to brag so those in the green coming out of woodwork.", "score": 9, "replies": []}, {"body": "I mean SPY is up 100% and QQQ 180% since Jan 2015. If you were overweight in any FAANGMT name which a lot of redditors are, 200%+ returns are pretty easy.\n\nI also bet most of these people are including their own monthly deposits into these calculations.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "No you didn't", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Where's the screenshot proof? How would you buy BTC in 2008 lol?", "score": 1, "replies": []}]}]}]}]}, {"body": "since jan 2016 i am +13%.", "score": 28, "replies": [{"body": "How?", "score": 3, "replies": [{"body": "Actually quite easy. Buy Disney.", "score": 8, "replies": []}, {"body": "buy low. sell high. collect dividends in between.", "score": -2, "replies": [{"body": "Do you think 13% is good?", "score": 3, "replies": [{"body": "this is just play money. \n\nmy investments are managed by professionals.", "score": 1, "replies": [{"body": "Do you mean 13% annually or 13%, because lets be clear 13% total isnt fun money investing, thats like outperformed by a hysa gains.", "score": 4, "replies": []}]}]}, {"body": "And you only had a 13% cumulative return. That is insanely low. I can believe annual 13%, but cumulative?", "score": 0, "replies": []}]}]}]}, {"body": "Started in June 2020, same for me with Apple being the only green. Down 15% overall still", "score": 12, "replies": []}, {"body": "I bought Tesla, Microsoft, and a decent ETF (WSTAX) in 2015 with about $6k I had saved.  Current worth $51,000 (it’s been as high as $70k with Tesla up and down).  It was a pretty good investment. \n\nI put $1200 in a different broker at the 2020 COVID crash and I’m barely breaking even on that. Tickers like QQQ, Delta, Disney, and Ally Bank have kept me green since then but I lost a pretty significant percentage on SPCE and FCEL although not very much in actual dollars.", "score": 13, "replies": []}, {"body": "Since I started investing in 2017? Probably up around 900-1000%", "score": 35, "replies": [{"body": "That’s amazing. Good for you", "score": 14, "replies": []}, {"body": "Tesla?", "score": 7, "replies": [{"body": "Yeah. Made it around 35% of my portfolio just before it started really taking off in 2019, and then bought some more during the march 2020 panic", "score": 24, "replies": []}]}]}, {"body": "I started around 2014. I was still in high-school and working in a restaurant. My dad made me open a Roth IRA and contribute. I picked Apple (lucky me) and he picked some broad market funds. Those positions are green, but most stuff I have bought in the last two years are red. \n\nThere is a real psychological difference having a position you are up 100% on drop 20% vs a new position losing value.", "score": 7, "replies": []}, {"body": "Started January 2021, down 20%", "score": 12, "replies": [{"body": "Started January 2022, also down 20%", "score": 1, "replies": []}]}, {"body": "I’m down 90%. It would have been more fun to burn all my cash in the back yard. Still I’m clawing it back and going to buy the dip. Also I’m going to focus on buying low and selling high. Instructions were not super clear during covid and I got confused.", "score": 23, "replies": [{"body": "You’re down 90% from 2015?", "score": 8, "replies": [{"body": "No. Just the last couple of years in my cash accounts.", "score": 5, "replies": [{"body": "When did you started? I would assume anyone that started around 2015 should be safe from this bloodbath", "score": 3, "replies": []}]}]}, {"body": "I think it would actually take longer to physically burn it all instead of put it in equities", "score": 3, "replies": []}]}, {"body": "Started in 2015 (didn’t really pick up until 2016) currently up about 100% mostly investing in VTSAX and much later in GOOG", "score": 5, "replies": []}, {"body": "Everything red, Averaging down on GOOGL & VTI", "score": 6, "replies": []}, {"body": "Started in April 2020, down in every position except tesla, of which I'm up over 100%.", "score": 2, "replies": []}, {"body": "Pre 2015 here. Started heavily day trading 2020 to current. Still invest in longs, most are currently down but they are newer positions to be long in. My only thoughts here to share (after reading the comments so far) never be scared to take your profit. Check your charts (if you aren’t certain how to read them…) follow the trends. Nothing wrong with taking profit and waiting for it to bottom back out and buy back in. Holding the same 6 stocks for 30 years is fine, but to maximize your gains and grow your portfolio is to take your profits. The 20% rule is golden. Be active. Best of luck to everyone. Enjoy your Sunday!", "score": 5, "replies": [{"body": "What is the 20% rule?", "score": 1, "replies": [{"body": "Sorry just saw this. It’s where after you have gained 20% in a ticker, pull out your initial investment and let the rest run and continue up or take it out when it starts to decline.", "score": 1, "replies": []}]}]}, {"body": "Started in 2017 and am up significantly, like 300%. Most (90%) of my portfolio is VTI and BTC with a small percent of single stocks. My single stocks are largely down but I only really started buying them in late 2020, but my VTI and BTC that I've been DCAing into since 2017 are still way up", "score": 2, "replies": []}, {"body": "is there any reason that Berkshire Hathaway Inc. (BRK-B)\n\nseems not so popular on reddit?\n\nIf you bought BRK-B in 2015, I am sure you will be UP", "score": 2, "replies": [{"body": "BRK-B is for grandpa. On Reddit it’s all about which ticker gets the most upvotes and who’s CEO is the coolest on twitter", "score": 3, "replies": []}, {"body": "I started in september and hold mostly Berk. It’s the only green one lol", "score": 2, "replies": []}, {"body": "when it was 2020 and growth was raging people hated on it\n\nbut they should have been buying\n\nnow that people see and understand it's virtues... is probably not the best time to buy. i mean, wait for a larger pull back. but then buy for sure.\n\nwhen everything is ripping but berkshire it's hell of a temptation to sell it and use it to buy something that you convince yourself will grow faster. but you will be trading down in durability of earnings most likely and probably round trip it or even lose some money once the tides change. yes i did this", "score": 2, "replies": []}]}, {"body": "March 2020 when I started a new career and could max out contributions…or make any at all, really. Anything prior to that was TSP contributions starting in 2007. Rolled TSP into Fidelity IRA, started 401k and created ROTH IRA and max both. Peak was up maybe 130%, but I’m still up about 80%. Up 20% this year because I ignore “time in market beats blah blah” I don’t need to time the market perfectly to see a huge bubble and rate increases driving a downward trend. Sold to 95% cash, used about 30% of that to buy SQQQ, SARK, and TZA. \n\nStill don’t entirely know what I’m doing, but it’s working for now.", "score": 1, "replies": []}, {"body": "Started investing February 2020, so immediately before the covid crash. Up about 25% still on my portfolio", "score": 1, "replies": [{"body": "What'd you invest in?", "score": 1, "replies": [{"body": "Mostly a basket of individual stocks. I’ve added new positions and bought and sold since then but my top positions are/were: JPM, TGT, BRK, CVS, MS, IRM", "score": 1, "replies": []}]}]}, {"body": "Started in 2016 pretty low. Ramped up on 2018. Beat S&P last couple years but a few %. Up 23% YoY. Not sure on total as I’ve switched platforms a few times. I’d assume probably in line with S&P but I’m 60% ETFs. 25% aapl and msft.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Lol, April 2022 was...checks notes...one day ago?", "score": 4, "replies": []}]}, {"body": "Been trading for 2 years, buy and hold when I think something is undervalued. Don't have much money as am young. Gone from 4k to 6k", "score": 1, "replies": []}, {"body": "99%", "score": 1, "replies": []}, {"body": "I’m up 20% still was up 56% at the peak. Still buying on all the dips. Not worried", "score": 1, "replies": []}, {"body": "If we are counting Roth IRA and 401K then I am at least 50% up. Because they were safer than whatever Reddit is pitching, and I would be another 20% up if I didn't have a Reddit account.\n\nEdit: since last November I am about 8% down across the board. Anything (IRAs etc) that touches the stock market got a beating. Not counting the inflation, my retirement has been melting the last 6 months.", "score": 1, "replies": []}, {"body": "Started investing in April, 2017. But I was mostly just fucking around at that point. Really got serious and opened my Roth IRA in August of 2017.\n\nI'm down roughly 4%. Cost basis is about $45,000 and my balance is right around $43,200. I was up something like $12,000 (~ 30%) at one point, so I'm kinda bummed that I've lost a couple grand in principal. But it's really not too bad given the state of things.", "score": 1, "replies": [{"body": "Same year as I starter buying bitcoin. My 40K turned into 300K since then.", "score": 0, "replies": [{"body": "That's great.", "score": 1, "replies": []}]}]}, {"body": "2015, I bought 200$ of nvidia at 9$, sold some along the way, currently own half that position still. Bought bitcoin at 400$ sold some along the way still my biggest position. Bought a house in 2016,now a rental. I don't know my exact %, but it's a lot.", "score": 1, "replies": []}, {"body": "Started investing in 2017 in \\*the banned word\\* when it was below 5000 USD. Entered stocks in 2020 - so far I accumulated around 1800% (a good third of it is from the Cohen's Stock)", "score": 1, "replies": []}, {"body": "Up 55% over the past 5 years.", "score": 1, "replies": []}, {"body": "Started FEB2020 up exactly 50.00%", "score": 1, "replies": []}, {"body": "Started early 2017 only down -$422 right now. It's my dividend portfolio. I haven't sold much since starting just been adding when I can.", "score": 1, "replies": []}, {"body": "12.8% since 2014", "score": 1, "replies": []}, {"body": "I put about $50k into SPY October/November 2018 when it was $265.  By December 2018 it started tanking again to the $250 range and I bought another few thousand worth.  It's up about 50% and I reinvest dividends.  There were definitely some scary moments like March 2929 though.", "score": 1, "replies": []}, {"body": "Started investing in 2020. Down 40%", "score": 1, "replies": []}, {"body": "Started investing in Feb 2021, down 70%. Thanks Cathie.", "score": 1, "replies": []}, {"body": "2016 here, +19% total. My contributions have increased massively over the last few years so that's constantly dragging me closer to 0%. My gains peaked at the end of Oct where I was sitting closer to +61%, but my total amount invested has increased  by about 40% since then. I've lost about 50% of my \"gains\" but a lot of that is money I've dumped in since October that has done nothing but decrease in value. A ton of my investments are still way in the green. \n\nI'm not to worried about it. My income has been enough to offset my losses so I'm worth about what I started the year with except the number of shares I hold is up dramatically. 30 years from now I'll be able to look at my wealth over time and point to now and say \"that's when I made myself wealthy.\"", "score": 1, "replies": []}, {"body": "I'm up by more than 1000% in combination of cryptos and stocks", "score": 1, "replies": []}, {"body": "December 2017 +13%, primarily index funds", "score": 1, "replies": []}, {"body": "March 2020 - up 174%.  I was up 183% until recent turn but anticipate being back in upward trajectory as we adjust to inflationary pressure and supply issues.", "score": 1, "replies": []}, {"body": "-90%", "score": 1, "replies": []}, {"body": "I had a small side account that i picked my stocks around May/June 2020. At peak my $17k became $30k but i think its back down to $25k now. Rest of the accounts are in funds which also came back down but a lot less chop than my small stock account", "score": 1, "replies": []}, {"body": "Started 2 years ago (right when pandemic first started actually) and I’m down 0.8% 🙃", "score": 1, "replies": []}, {"body": "100% up since feb 2018.\n\nMade my gain with ARKK from 2018 to 2020 and IVV and BRK. \n\nHowever this is when I started tracking. I have been investing since 2001. Before 2018 it was mostly mutual fund with terrible return.", "score": 1, "replies": []}, {"body": "started in earnest mid 2018, gains from march 2020 buys are still there (most part) so i am up on the whole. half expecting them to melt away. if 50% drawdown ill probably be right back where i started. fun. i dont keep good stats", "score": 1, "replies": []}, {"body": "I’ve probably realized around a 10% gain in total from the past nearly two years. I went down quite a ways and lost all the profit last year playing with options, just in time for everything to crap out. Since then though I’ve climbed to be relatively even, I just stuck to my strategy and added more into my few holdings at the right time. \n\nIt’s been smooth sailing though, especially with most of my buys still being up despite everything. With my other, non stock investments though, I’m still doing nicely. Really I’m glad to have got a good lesson last year for a relatively cheap price to pay.", "score": 1, "replies": []}, {"body": "Started in Feb 2022 and I’m up 10 percent. im just inversing the market with uvix, sqqq, and spxu", "score": 1, "replies": []}, {"body": "1000%. Thanks Shopify.", "score": 1, "replies": []}, {"body": "I’m up 416% since 2016\n\nI decided that I should work for a hedge fund. Working on that now", "score": 1, "replies": []}, {"body": "Negative 7.7%, for 2022.  Up largely since 2015.", "score": 1, "replies": []}, {"body": "I began in late January 2022 and am down about 8% (just checked). My best pick was Rheinmetall in early February. I called that Russia's shenanigans would make Germany want to invest in the Bundeswehr and I substantially beat the well-known American defense stocks. I doubled my position in about 60 days and have mostly taken profit there but still have a few in. Thank you Hearts of Iron 4 for introducing me to Rheinmetall! My only regret there was not making it a larger portion of my portfolio. I was just too much of a kid in a candy store at that time.", "score": 1, "replies": []}, {"body": "Started 2019. Currently up 1525% (all of the gains due to Tesla). Of course this year has been a bit of a downer from ATH at roughly 2450% (also due to buying something else besides Tesla that has since traded mostly sideways)\n\n...total investment is about 20k which is currently worth just north of 300k..or - after taxes - would be around 200k if I cashed out)\n\n...Oh well. Stock market goes up, stock market goes down. Since I'm in this for the long haul I'm not overly worried over the current correction/recession/crash/whatever you want to call it", "score": 1, "replies": []}, {"body": "Started investing in 2016, every 2 weeks when I got paid was dollar cost averaging, when I finished college. Started with spy, qqq, and arkk. Sold all three later to buy tesla in 2020. Drank the tesla cool aid. Own 226 shares Tesla. Whatever that gain is. It fluctuates.\n\nKeep grinding, keep working your hourly job, keep dollar cost averaging and in 10 years your minus 25% will be a blimp in the grand scheme of things.", "score": 1, "replies": []}, {"body": "Up 55.6% since Jan 2016.\n\nUp more than that on my 401k and IRA which started in 2012-2013.\n\nThis shit isn't that hard, just don't overthink it.", "score": 1, "replies": []}]}
{"title": "Ford CEO Jim Farley burns Tesla during electric F-150 Lightning launch event", "selftext": "", "id": "ug5x6y", "created_utc": 1651429221.0, "score": 0, "upvote_ratio": 0.42, "num_comments": 84, "comments": [{"body": "> Our truck is here today, because we rolled up our sleeves,\" Farley added. \"We rediscovered our roots around innovation. We worked together, and now we're busting our butts to make more of these.\n\nJim, your truck is here because Tesla scared the crap out of you so you slapped a battery on an existing frame.  Enjoy cannibalizing your own ICE sales for a lower margin.", "score": 77, "replies": [{"body": "We are yet too see any real production or what the actual quality is including battery technology, don’t want to end up like GM Bolt. Too early for Ford to claim much.", "score": 14, "replies": [{"body": "Imagine thinking Tesla is the champion of quality, and doesn't have its own share of problems.", "score": -26, "replies": [{"body": "They are actually not bad, and great at battery technology and drive train. Keep in mind Tesla is under a huge spot light, so any minor item and it’s all over the web. Other car companies can get away with far worse without a Twitter or Reddit storm. Also Tesla quality is way better than 3 years ago and way way better than 8 years ago.", "score": 11, "replies": []}, {"body": "How many Tesla’s have you owned?", "score": 6, "replies": []}, {"body": "Imagine thinking Ford is.", "score": 3, "replies": []}]}]}, {"body": "Frame is different. Body is mostly same. Agree about canalizing ICE sales though. They *should* be able to make *some* margin though, on the Lightning at least, the Mach-E? Doubtful.\n\nDon't envy their position right now, can't make money on them until they can make more, can't make more because they don't (yet) have enough battery supply. They should have moved earlier, but I don't think they could have got that approved by shareholders.", "score": 5, "replies": []}, {"body": "No doubt many very bright people worked very hard to bring the product to fruition though . . .", "score": 2, "replies": []}, {"body": "True. But it’s the right move for companies like Ford when threatened by a new paradigm: \n\n1) Copy your competitor and get to market as fast as you can with an “ok” competitive product in order to stay relevant and buy enough time to eventually design a truly class-leading product. \n\n2) Use your existing brand/name value as much as you can, in order to stay relevant while you re-tool and learn how to operate in the new paradigm. Use your existing strengths to help your mediocre new product succeed until it can become better.\n\n3) Don’t completely abandon your existing business if it is profitable. Instead maximize profits in your existing business and use much of the profits to fund the shift to the new paradigm. Separate the new business units from the old ones if necessary so that the old business leaders don’t sabotage the transition to the new. Make acquisitions if necessary.\n\nFord is playing a textbook response and the most important thing now is speed to market and staying relevant while making iterative improvements. Similar to Microsoft’s response to the threat from Netscape, Netflix’s response to the threat from early streaming services, Instagram’s response when Snapchat was starting to gain traction, etc.", "score": 4, "replies": [{"body": "The last time Ford had to respond to a major threat it brought the Pinto fiasco.", "score": 3, "replies": []}]}, {"body": "Cannibalizing sales is a weird argument. Of course you're cannibalizing some sales, that's the point. You're not going to sell twice as many trucks. Ford is already the king of trucks in the USA, any advance they make could be framed as cannibalizing their own sales.", "score": 2, "replies": [{"body": "The point is that every low-margin EV they sell is at the expense of a higher-margin ICE vehicle.", "score": 6, "replies": [{"body": "That makes a  bad assumption is that Ford is doing low margins on the F-150L. To the contrary, there's no reason to believe that. The F-150L starts at $10K more than the standard F-150, which more than makes up for the cost of the pack by napkin math. They've saved a shitload by using the same stamping lines, same painting, and same basic frame design as the standard F-150, meaning development cost was extremely low. It's *very* possible Ford is actually doing killer margins on the F-150L.", "score": 2, "replies": [{"body": "I think the issue is that Ford sells a million F150 ICE trucks per year, and suddenly most new buyers won’t want the old ICE version. Most will want the much better EV version. Why buy a new $40-$70k truck that is already outdated by a newer faster better version that can power your home in a blackout? \n\nBut there are only 200,000 Lightning’s available each year instead of 1 million. People will simply wait to buy a Lightning instead of buying an outdated Dinosaur F150", "score": 3, "replies": []}, {"body": "No assumptions at all. In what world does an outsourced pack cost less than $10k? Especially for the size needed for an F150. They got outsourced motors on top of that. A beef'd up frame to handle all this. I don't think they profit on this for several years. As is, this is not a profitable vehicle. They better hope most of their sales comes from non-F150 owners.\n\nAt least GM was smart enough to design a truck that will never sell.", "score": 2, "replies": []}, {"body": "I’m no expert on how much these things cost, but there are two pressure points. Number one is the battery. I can’t imagine they’re making much margin on those. The second is that it’s early in their production phase, and they haven’t had a chance to drive cost down. Maybe somebody can give us information if they know more.", "score": 1, "replies": []}]}]}, {"body": "They’re also taking sales from competitors who don’t have an EV offering (e.g. GM, Stellantis and etc).", "score": 1, "replies": []}, {"body": "Yeah totally agree, it’s just funny because Jim is acting like they innovated something to grow their portfolio rather than copycatted something to try and stay alive.  I know that’s what CEOs have to do, but it’s still funny.", "score": 1, "replies": []}, {"body": "It's a very valid argument considering Ford investors are deluded into thinking they will grow into a market cap similar to Tesla with this.", "score": 1, "replies": []}]}, {"body": "I reserved two Cybertrucks on the day it was unveiled over two years ago and am still waiting for when they’ll eventually be built. People reserved their Lightnings less than a year ago and are taking delivery of them now. The F150 Lightning has its own frame, not the one that’s used in the ICE version.", "score": -8, "replies": [{"body": "Tesla has a year waiting list for as many Model Ys they can build.  It made no sense for them to rush the CyberTruck vs capturing great margins for an existing product.  Ford will deliver fewer than 50k Lightnings this year, but will likely defer sales for 200k potential ICE F150 buyers.", "score": 16, "replies": []}, {"body": "Did deliveries actually start? I know it was expected but then they said production started.", "score": 3, "replies": [{"body": "I saw one in person the other day\n\n[https://www.reddit.com/r/F150Lightning/comments/u7mc4a/spotted\\_f150\\_lightning\\_platinum\\_in\\_the\\_flesh/](https://www.reddit.com/r/F150Lightning/comments/u7mc4a/spotted_f150_lightning_platinum_in_the_flesh/)", "score": 1, "replies": [{"body": "Interesting, they could be using it for testing, reviews, employees, but if it is actually being delivered to normal clients, that’s great! Looking forward to seeing it on the street my self.", "score": 1, "replies": [{"body": "They've built over 2000 of them (likely 3000 by now) already.\n\nThere's only so many you can throw to reviewers, and *it's a lot less than 2000.*", "score": 1, "replies": []}]}]}]}, {"body": "Wouldn't it be better to have the same frame to cut costs on manufacturing. Scaling by having the same frame means they can sell both ICE and EV versions with less complexity.", "score": 2, "replies": [{"body": "Body in frame is pretty versatile in design as well . .  Quite easily adopted to an EV.", "score": 2, "replies": []}, {"body": "Ford has enough volume to produce both versions.  The ease of production should never sacrifice long term quality of the vehicle.", "score": 0, "replies": [{"body": "That's an interesting take when almost all hybrids share a frame with ICE versions.", "score": 1, "replies": [{"body": "Hybrid batteries have a fraction of the capacity and weigh much less than BEV batteries. 🤦‍♂️\n\nEdit: The F150 Hybrid battery weighs 80lbs, whereas the F150 Lightning battery weighs 1800lbs, over 20x.", "score": 0, "replies": [{"body": "Okay, so explain why that matters? Weight seems less relevant than volume.", "score": -1, "replies": [{"body": "You really don't understand how adding one-ton of batteries would matter?\n\nWeight distribution affects the handling dynamics of any vehicle. Furthermore, the ICE frame is reinforced in the front where the ICE engine is mounted. The BEV frame is reinforced in the center where the batteries are mounted. Having one frame for both applications would make it unnecessarily heavy and propose challenges. The frames are made by a third-party who have the ability to produce both with ease. \n\nFord sold 726,003 F150s last year, even with the pandemic, chip-shortage and etc. While the F150 Lightning will be successful in its own right, there's very little reason to hinder America's best selling vehicles over the past 4 decades, for a variant, when it's easy to engineer something specific for it.", "score": 1, "replies": [{"body": "Okay, good to know.\n\nSounds like Ford is not a good investment then.", "score": 1, "replies": [{"body": ">Sounds like Ford is not a good investment then.\n\nNot sure where I was giving investment advice. This sounds like a troll reply.", "score": 1, "replies": [{"body": "This is Tesla investor subreddit, that's why.", "score": -1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Huh? Not being afraid to cannibalize your own business is a sign of good management that is forward looking.\n\nAnd using an existing frame to consolidate infrastructure and shorten delivery time is also a win-win. That would be like criticizing Tesla for using similar platform for model 3 and model Y.", "score": 1, "replies": [{"body": "Yeah I do actually agree.  Just funny when they use the word innovation for “copycatting to stay alive”.  I hope ford succeeds but get annoyed at things that approach the “you led!” type stuff", "score": 2, "replies": []}]}]}, {"body": "On a scale of one to ten, that burn was a one.", "score": 16, "replies": []}, {"body": "\"Our truck is here because we threw LG Chem batteries and Magna motors into a chassis we already have because at ford we dont bother with Efficiency!\"  \n\n\nExactly like how GM did with the Bolt and we saw how that worked out", "score": 16, "replies": []}, {"body": "Whatever you gotta do to survive another year", "score": 20, "replies": [{"body": "They’ve survived 119 years, I’m sure they’ll be fine for another one.", "score": -11, "replies": [{"body": "That is a fallacy and a half lol", "score": 18, "replies": [{"body": "There is zero reason why the won’t “survive another year.”", "score": -2, "replies": [{"body": "Still a fallacy. Google it. Because X in past, X in future makes zero sense.", "score": 14, "replies": [{"body": "There is no financial reason why Ford won’t survive another year. Not even sure how u/bazyli-d could even conjure that up.", "score": -5, "replies": [{"body": "I was just poking fun 😋", "score": 2, "replies": []}]}]}, {"body": "Depends when the recession comes. If even a small portion of auto loans default they could be in for a world of hurt.", "score": 2, "replies": []}]}]}, {"body": "It's only true until it isn't.", "score": 2, "replies": []}, {"body": "That's what the dinos said", "score": 3, "replies": []}, {"body": "They got 5 years to survive", "score": 0, "replies": []}, {"body": "Due to a $7 billion dollar loan from the government they never repaid.", "score": 0, "replies": [{"body": "This is categorically false. The ATVM loan has a 10 year term at a mere 2.3% rate. With such a low rate, why would they prepay it when there's a greater ROI elsewhere?\n\nFord has been paying $148m every quarter of the original $5.9b loan balance, which it owes less than $1b now. This is far from your claim of it \"never repaid.\"", "score": 6, "replies": [{"body": "I stand corrected.\n\nThank you!", "score": 2, "replies": []}]}]}]}]}, {"body": "This will age like milk.", "score": 6, "replies": []}, {"body": "if anybody is desperate for attention either troll or praise Tesla.", "score": 8, "replies": [{"body": "Guaranteed clicks! Same goes with the media writing up an event. Even if the content delivered at the event you’re writing a story about is 99% Ford talking about their own plans, just frame the headline/lead it so it’s about Tesla, sit back, and enjoy the web traffic!", "score": 5, "replies": []}]}, {"body": "CEOs say what they think they need to say... Their actions tell us the truth.", "score": 8, "replies": [{"body": "This is why I only own one EV stock in my retirement accounts... The rest are commodities (everyone needs raw materials until there are enough recyclable materials to reduce demand), mix of index ETFs, and Bitcoin.\n\nSpaceX is currently the only future addition I am hoping to add one day.", "score": 7, "replies": []}, {"body": "But… Mary is leading", "score": 6, "replies": []}, {"body": "Ford went from unveiling a vehicle to delivery in less than a year. Still waiting on my Cybertruck reservations from over two years ago. You’re right, actions tell the truth.", "score": -1, "replies": [{"body": "We all know the reason for CT not being a priority has been 4680 scaling and battery priority. \n\nYou seem divorced from the concept of Intelligence vs. Wisdom.... Just because you can do something.... Doesn't mean you should.....\n\nCould Tesla have put the CT production as the priority for Austin... Sure... They choose to prioritize MY production. \n\nRaw materials are going through the roof... Battery shortages are going to make the chip shortage a joke in comparison as a constraint. \n\nBattery conservation is going to be the game now.", "score": 3, "replies": []}, {"body": "Yes, and with the 23000 Mach E, they def have the supply. You were just lucky", "score": 6, "replies": [{"body": "I was lucky? I don’t own a Mach-E nor Ford stock. Not sure what that has to do with me.", "score": 1, "replies": [{"body": "I guess that’s your disconnect to reality. You don’t realize that you getting the f150 lightning is lucky. There aren’t millions of them like there are millions of teslas.\n\nFord only made 23k Mach e. What makes you think they can make millions of EV trucks that uses more batteries?", "score": 5, "replies": [{"body": "Ford sold 27K Mach-E in 2021, which is almost two times the 14K Model X sold. It's easy to find arbitrary data points and argue them for your agenda.\n\nOn the other hand, Ford has sold more vehicles of just one model (the ICE F150) in three years, than Tesla has sold in the entirety of its company. If you can't see that, then that's the true disconnect to reality.", "score": -1, "replies": [{"body": "Why we comparing a Mach-E to a Model X? More like a 2012 Model S. Why am I saying this? Ford limited max power output to their motors for no more than [5 seconds](https://www.google.com/amp/s/www.teslarati.com/tesla-model-y-rival-ford-mustang-mach-e-5-sec-limit-ice-promotion/amp/) to preserve battery.", "score": 3, "replies": [{"body": "The point was that anyone can bring arbitrary data points and compare. The discussion was around the F150 Lightning, yet, the previous commenter decided to bring in the Mustang Mach E sales figures. I know fully well the Mustang Mach E and Model X are in completely different classes.", "score": 1, "replies": [{"body": "The Ford F150 was introduced in 1948 according to online sources. So all those years I would expect Ford to have scaled efficiently in building those trucks.\n\nIn 2021 Ford sold 726k F150's. Tesla delivered 911k Model 3/Y.\n\nHere's the reality, Tesla scaled in under 3 years for Model 3/Y production and exceeded Ford in 2021.", "score": 1, "replies": []}, {"body": "Here's another one for you. Ford aiming to [produce](https://www.electrive.com/2021/12/13/ford-to-triple-mustang-mach-e-production-capacities/) 200k Mach-E by 2023.\n\nGiga Shanghai alone will make 90k vehicles per month. We haven't accounted for the battery supply yet. Those massive batteries is going to eat into Ford's production on those F150 lightning if they can't secure enough resources for the batteries.", "score": 1, "replies": []}]}]}, {"body": "Lolol Mach e is the same class as model x? Get out of here 😂", "score": 3, "replies": [{"body": "You’re right. When considering reliability, fit and finish, and overall quality, the Mach-E comes ahead.", "score": -4, "replies": [{"body": "Lolol it’s looking worse and worse for you buddy. Reality is Tesla is all action, legacy is all talk. I’ll change my mind when they all making millions of pure EV per year.", "score": 3, "replies": []}, {"body": "I suggest you watch some Sandy Munro videos. You know, the old Ford engineer who helped design Fords for decades.", "score": 3, "replies": [{"body": "Yes, I’ve seen them and he was very critical of the Mach E. I was illustrating that any non-related datapoint can be compared to fit your agenda, just like the prior commentor did.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "It will be amazing to see the transformation of legacy auto to EVs. I’m still firmly of the view that they won’t survive as they won’t have the ability to completely change their sales/service structure. Companies that couldn’t adapt wholeheartedly have been diminished, think Kodak, think Nokia.", "score": 3, "replies": []}, {"body": "Alright Ford, how many lightning's you building a day? 8?", "score": 3, "replies": [{"body": "Ford produced \\~2000 F150s per day last year. Don't doubt their ability to scale. They're not Lucid nor Rivian.", "score": -1, "replies": [{"body": "That's... The fossils.", "score": 3, "replies": []}, {"body": "Building the bodies isn't the problem.... They aren't going to have any batteries to put in them.", "score": 3, "replies": []}, {"body": "Batteries is going to be an issue. GM had to halt their Bolt EUV to allocate (most likely battery) resources to every existing Bolt (110k vehicles). So Ford will be limited by whatever is weakest in supply chain.", "score": 2, "replies": []}]}]}, {"body": "Ayyyyy this until next fire starts.", "score": 1, "replies": []}, {"body": "that truck is so easy to make compared to the cybertruck", "score": -2, "replies": []}]}
{"title": "you guys need to start buying houses", "selftext": "Nobody makes the things they're invested in crash like this zoo and I want to be able to afford to own a home before I'm dead", "id": "ug3ova", "created_utc": 1651422920.0, "score": 129, "upvote_ratio": 0.79, "num_comments": 82, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|2 weeks ago\n**Total Comments**|1|**Previous DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=ug3ova)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=ug3ova)", "score": 1, "replies": []}, {"body": "I think OP wants us to invest in housing so that that market crashes as well.\n\nLittle did they realize we would only invest in sub-prime shit that no one would want anyway.", "score": 67, "replies": [{"body": "It’s the WISH house?", "score": 14, "replies": [{"body": "My clock is a SNDL.", "score": 8, "replies": []}]}, {"body": "WSB is the type to YOLO on Neg-am mortgages.", "score": 1, "replies": []}]}, {"body": "It's funny, today I already got 3 ads of buying and investing in houses before it's too late. Now this post ahah. \n\nStocks down, we all know the housing market follows with a delay of 6-12 months.", "score": 31, "replies": [{"body": "Holy shit i can finally get out of my wife's boyfriends attic", "score": 22, "replies": [{"body": "Why tired of hearing her boyfriend make her scream every night?", "score": 3, "replies": []}, {"body": "That actually sounds cozy.\n\n1. The freedom of not being in the same room as anyone at any time.\n2. The free food they leave (as idiots..) in the fridge when their gone.\n3. The free homemade and live porn you get through the cracks and into their room.\n4. Free wifi, free water, electricity (as long as you can reroute a regular 110 circuit up into that crawl space of an attic\n5. Free heat which should go with #4\nI can go on for a while…..", "score": 2, "replies": []}, {"body": "You’re married and don’t own your house? That’s just a little ass backwards.. don’t you think?", "score": -16, "replies": [{"body": "Found the boomer.", "score": 7, "replies": [{"body": "You’re cool, kiddo.", "score": -6, "replies": []}]}]}]}]}, {"body": "U sunuvabitch, I’m in. \n\n\n\n\nClose in three days.", "score": 13, "replies": []}, {"body": "Shoulda bought back in 2019 ![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4267)", "score": 15, "replies": [{"body": "Just when covid hit for me. The only investment I’ve ever timed properly", "score": 5, "replies": [{"body": "Yeah but it's a huge investment and you got a killer interest rate and have experienced over 10% while being in big debt. If you are going to time any investment, a house is one of the best.", "score": 3, "replies": []}]}]}, {"body": "Huh?", "score": 35, "replies": [{"body": "[deleted]", "score": 118, "replies": [{"body": "Wasn’t it the rules of wsb buying the top of the bubbles and looking at our money disappear when it pop..?", "score": 18, "replies": [{"body": "I been doing this for years. Thought that was the only way we get to stay here 👍😂", "score": 5, "replies": []}]}, {"body": "Oh ok. I’ll go buy three to help", "score": 8, "replies": []}, {"body": "I'm pretty sure most of the retards here just enjoy sucking dick behind Wendy's and the whole losing all of their money gambling on stonks bullshit is for show. No shame in that, but I don't think these retards realize it isn't a requirement to nuke their portfolio first in order to suck dick behind Wendy's.", "score": 2, "replies": []}, {"body": "This exactly", "score": 6, "replies": []}]}]}, {"body": "Wtf is this", "score": 31, "replies": []}, {"body": "You’re going to be able to buy a house later this year or next year, after the housing market gets margin called and all the super smart people who leveraged their shares against rising housing prices will have to pony the dough to pay for all of it once China no longer manages to keep Evergrande artificially alive and all the bond holders see their investments go to zero.\n\nIt’s going to be a crash of epic proportions. They’ll be giving you a house when you buy a Happy Meal. Remember: there’s no housing shortage, it’s an affordable housing shortage.", "score": 11, "replies": [{"body": "Cant wait to pick up an apartment building. I just got a solid job right as the Labor market was at the height of its frenzy too. Going to suck looking for jobs now.", "score": 3, "replies": []}, {"body": "I'm beginning to wonder if this is true for the UK too", "score": 1, "replies": [{"body": "UK is old money, nothing will change, too many laws.  China and US are new money, no laws, no hope.  The crash is coming but not like 2008.", "score": 4, "replies": []}]}, {"body": "That was Florida 2008, it's not that bad.  And in 2008 it was bad.", "score": 1, "replies": []}]}, {"body": "Buying houses is lame. Everyone’s into van life now", "score": 19, "replies": [{"body": "Why need house with computer when I can lose money inside van using robbinghood?", "score": 5, "replies": [{"body": "See you get it", "score": 1, "replies": []}]}, {"body": "Down by the river?", "score": 1, "replies": []}]}, {"body": "Not the right time to buy property yet, 6-12 months :) when interest rates peak.. that’s your “buy time”", "score": 7, "replies": []}, {"body": "Now the market is truly crashing if people talk about buying houses and normal shit, not digital zero ones on a screen lol", "score": 7, "replies": []}, {"body": "Okay, got it. I just bought 2 condos, 1 single family, and 1 villa through GrubHub. Happy 😊", "score": 5, "replies": []}, {"body": "Wander over to r/personalfinance and dumb fucks asking if they should take out a mortgage if it means they have to work a 2nd job. They belong here ![img](emote|t5_2th52|4271)", "score": 5, "replies": []}, {"body": "This place is for retards.. that’s some strait thinking shit", "score": 12, "replies": [{"body": "He did the thinking, he wants y’all to do the retarding", "score": 6, "replies": []}]}, {"body": "*Aww, sweet! A schizo post!*", "score": 7, "replies": []}, {"body": "Trust me when I say loads of people are speculating on the housing market. Though we are in unprecedented times. There has never been a time where interest rates rise while Western economies are shrinking. Housing generally follows inflation but what happens when wages are stagnant and intrest rates are rising?", "score": 5, "replies": []}, {"body": "At first I was like lol I have 00.42 in my name and some worthless shares. Then I finished reading your description. I stand behind this post", "score": 3, "replies": []}, {"body": "You need a place to live? There’s plenty of space in my dumpster behind McDonald’s. I can’t afford the ones behind Wendy’s yet.", "score": 3, "replies": []}, {"body": "Houses? Calls or Puts for this one?", "score": 3, "replies": []}, {"body": "I'm realivly comfortable living in my parents basement. Home cooked meals free utilities no yard work or house maintenance. I'm pretty laid back with hodl!", "score": 3, "replies": []}, {"body": "Plot Twist: this post goes viral, they all buy real estate, the market soars to double what it is now in 3 months time, everyone sells. \n\nYou could’ve created the new Gamestop here.", "score": 3, "replies": []}, {"body": "Even if housing crashes, rates and cash buyers will prevent a lot from affording homes", "score": 3, "replies": []}, {"body": "I didn’t know you can buy houses today the price tags on them are like is this for sale or is this the real estate agents phone number", "score": 3, "replies": []}, {"body": "Ain’t nobody in here can afford more than a double wide.", "score": 3, "replies": []}, {"body": "I second this. Also get Cramer to say the housing market is about to take off.", "score": 3, "replies": []}, {"body": "Im trying but these other fuckers wont let me buy they keep waiving inspection or going 50k over asking or full gap appraisal.Honestly making a play on a few more houses then probably will need to lock in a longer term lease. After that I will still look but hopefully it pops or better yet I find somewhere else to live.", "score": 5, "replies": []}, {"body": "Sir.. this is Wendy's.", "score": 2, "replies": []}, {"body": "I thought the housing market was super inflated right now.", "score": 2, "replies": []}, {"body": "The is this funniest post on seen on this sub since the one yesterday of the suicide hotline.", "score": 2, "replies": []}, {"body": "Already on it my man.", "score": 2, "replies": []}, {"body": "Oh, buy a house? Just buy a house? Why don't I strap on my house helmet and squeeze down into a house cannon and fire off into house land, where houses grow on housies?!", "score": 2, "replies": []}, {"body": "I live in NJ so let me go buy a $200k shack that's jacked up to like $350k right before the crash.", "score": 2, "replies": []}, {"body": "What are you talking about?", "score": 3, "replies": [{"body": "Op can't afford a house working at Wendy's. Wants WSB to use their powers of losing money to crash the housing market.", "score": 14, "replies": []}]}, {"body": "Don't do drugs, kids", "score": 2, "replies": [{"body": "Wow worste take on this sub, amazing", "score": 0, "replies": []}]}, {"body": "I mean homie I know this is a shotgun opinion piece but I hear you, listen. I’m working on an open source AI trading algorithm for r/wallstreetbets. Cuz I’m just as angry from GameStop.", "score": -4, "replies": []}, {"body": "[deleted]", "score": -3, "replies": [{"body": "Buddy I'm making the joke that everything this sub invests in crashes and I can't afford a house", "score": 10, "replies": []}]}, {"body": "No matter what angle you look at this post…you can see op is whack as shit", "score": 0, "replies": []}, {"body": "I don’t understand 🤐", "score": -1, "replies": []}, {"body": "Nah", "score": 1, "replies": []}, {"body": "Fuck you…I’m not paying more than the house is actually worth", "score": 1, "replies": []}, {"body": "Did a realtor write this?", "score": 1, "replies": [{"body": "If i were a realtor I wouldn't have to encourage people to buy, I'd just have to list and people would be offering double value and offering to waive inspection (absolutely insane)", "score": 2, "replies": []}]}, {"body": "What's the ticker?", "score": 1, "replies": []}, {"body": "Working on it.", "score": 1, "replies": []}, {"body": "Gonna wait till the 10 years at 25%  so the average house price drops to 100k.", "score": 1, "replies": []}, {"body": "I think just mentioning the idea on wsb will be enough to get the ball rolling on the biggest housing market crash of all times", "score": 1, "replies": [{"body": "When it finally crashes, no longer how long from now, I'm taking credit", "score": 1, "replies": []}]}, {"body": "Unless you're looking to buy a Wendy's dumpster you best look elsewhere nobody here can afford a house", "score": 1, "replies": []}, {"body": "Unless you're looking to buy a Wendy's dumpster you best look elsewhere nobody here can afford a house", "score": 1, "replies": []}, {"body": "Wsb turning into housing investment. \n\nA regular house in miami now start at 500k", "score": 1, "replies": []}, {"body": "I’m up 12% on some rental property I bought with my 2021 stock gains. It’s been a solid hedge against the market. Location and type of property matters of course.", "score": 1, "replies": []}]}
