{"title": "[deleted by user]", "selftext": "[removed]", "id": "nem3ke", "created_utc": 1621271971.0, "score": 36, "upvote_ratio": 0.8, "num_comments": 48, "comments": [{"body": "You definitely want to diversify, but dont force it. Find companies you like first and do your DD, make a price plan and stick to it.  \n\nForcing a position for the sake of protecting your assets is backwards logic and more likely to hurt you than help you.", "score": 18, "replies": [{"body": "Also, unless you have a lot of knowledge of different markets, it's better to stick to the markets you understand than to diversify into different markets just because you want to diversify.", "score": 5, "replies": []}]}, {"body": "Don’t just add companies for the sake of adding more companies, only put your money in something you are very confident in. Microsoft and apple are highly correlated so adding that to your portfolio isn’t li to “protect” you. Costco/Disney would be a better choice if you truly want to diversify (they different sectors)", "score": 14, "replies": [{"body": "Msft and aapl have some overlap in that they both make operating systems, but beyond that, they are pretty vastly different companies doing different things.", "score": 5, "replies": [{"body": "Never said they were the same company. I’m talking about their price movements, which are very correlated. If their goal is just to diversify, better bet is to go somewhere less correlated with large cap tech. That is, unless they really like MSFT, then go for it.", "score": 16, "replies": [{"body": "I don't doubt their movements are probably correlated at the moment. As investors get more sophisticated and stop seeing them as \"they're both tech companies, and I'm increasing/decreasing my exposure to tech\", they will begin to diverge.", "score": -2, "replies": []}]}]}]}, {"body": "Stick with FAANG, or wait for the correction to bottom out and try to time the market (which never actually works and is terrible advice).", "score": 18, "replies": [{"body": "You son of a bitch, I’m in!", "score": 8, "replies": []}, {"body": "\"Markets can correct either in price, or in time.\" I think we'll be going sideways for a while due to all that happened last year. If and when SMH starts to outperform, I hope to get back into microchips, though I'll probably be late to the party as usual.", "score": 1, "replies": []}]}, {"body": "buy and hold is crock of shit, and diversification is for idiots \n\nMark Cuban", "score": 16, "replies": [{"body": "People want to invest their money without due diligence and make an easy buck. It's why I secretly despise bogleheads. Whoops, cat's out of the bag.", "score": -2, "replies": [{"body": "To be fair, Bogle invented the index fund for this specific reason. To give the average American (or any nationality, for that matter) access to capital appreciation. I personally considee the index fund one of the greatest modern tools for improving wealth for the lower and middle class. \n\nThe whole idea is to not be required to pour countless hours into becoming financially literate/a good investor. Calling it a \"quick buck\" is kind of false since index is also the lower benchmark any active investor compares (or should compare) themselves to.", "score": 14, "replies": [{"body": "I really like index funds too, they feel like a much safer bet than picking individual companies.  I like to allocate the bulk of my portfolio to index funds and use the smaller remaining portion to invest in individual companies.  Mark Cuban is right though...the money I've made investing in individual companies far surpasses what I've made off SPY.", "score": 2, "replies": [{"body": "That is smart. I am fortunate enough to have \"enough\" that I can have a core in safe funds (knock on wood), so I can have my core, but then try to outperform based on what some smart (?) bets.", "score": 2, "replies": []}]}, {"body": "Except if everyone did that then valuations would be completely out of wack. Passive investors actually *need* active investors to look for value and mispriced stocks", "score": 2, "replies": [{"body": "Absolutely. But this is not what is discussed here.", "score": 2, "replies": []}]}]}, {"body": "I am a \"recovering Boglehead,\" having bought and held with okay results for 10+ years, but getting my knees cut off yet again last February/March was the final straw, and I finally learned something about technical analysis...so I can at least say smart things about beta and volatility as my portfolio underperforms.", "score": 3, "replies": []}]}]}, {"body": "Warren: Diversification is a protection against ignorance\n\nAlso Warren: YOLO'S 46% of his portfolio into APPL", "score": 17, "replies": [{"body": "Warren only owns stock in one company: Berkshire. And when he started buying AAPL in late 2016, it was only \\~4% of his portfolio.", "score": 17, "replies": [{"body": "Damn. Good to know\nBut he did end up YOLO'ing majority of his portfolio in appl and averaging up", "score": 3, "replies": [{"body": "True. In fairness, he did trim a bit last year, although he now regrets it. If you're going to YOLO into something, you could do far worse than AAPL.", "score": 6, "replies": [{"body": "He really regretted not buying the dip in 2020", "score": 3, "replies": []}]}]}]}, {"body": "You misunderstand what BRK is.  It’s not a mutual fund that buys other companies.  The vast majority of their wealth is in wholly owned companies that you are not valuing in his portfolio.", "score": 4, "replies": [{"body": "Yea I know but he only owns BRK.B the guy said", "score": 1, "replies": []}]}, {"body": "Don't forget coca cola", "score": 2, "replies": []}, {"body": "Dumb question but if Berkshire is just a collection of ownership in other companies, doesn't that make the company just another stock picker?", "score": 1, "replies": [{"body": " Berkshire has its own companies as well like Geiko, Duracell, diary queen etc etc", "score": 1, "replies": [{"body": "My question is more that if everyone followed Warren's advice, wouldn't we all own SPY instead of BRK?", "score": 1, "replies": [{"body": "Agreed but BRK is a collection of mainly boomer stocks lmao and SPY has 500 large cap stocks including tech , clean energy etc. BRK is mainly a hedge and a less risky investment during crashes. That's how his stock didn't get affected much during historic market crashes.\nBesides, Warren buffet himself thinks BRK is under valued and has way more room to go", "score": 1, "replies": []}]}]}]}]}, {"body": "Just depends on an individual.  Not everyone is as knowledgeable and as connected as Buffet .", "score": 3, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "Diversification has a potential to decrease risk without decreasing the reward. Owning 10-30 companys is a sweet spot in my opinion and having some short positions in companys you have a high conviction of being overvalued. This will decrease your market beta and decrease overall market risk. You should also learn a little bit about options because you own more than 100 shares you can sell cover calls and make some sweet premium and decrease your overall cost basis of your Apple shares.", "score": 0, "replies": []}, {"body": "I love apple too!  I have many of their products and agree that they have a wonderful future ahead of them.", "score": 1, "replies": []}, {"body": "buy SPY for diversification", "score": 1, "replies": []}, {"body": "If youre going to go all in something, apple is a good choice. Also youre not putting down a lot of money relatively, so even if apple goes bust youre not going to be homeless.", "score": 1, "replies": []}, {"body": "In the same boat except with 700 at $111 (had more but moved into XOM some). I am a beleiber in AAPL.", "score": 1, "replies": []}, {"body": "For once in my miserable investing career, I had the smarts to put some money in AAPL when the iPhone was announced in 2008, and held on for dear life. Never added to my position but obviously did well over that period. I sold some at the pre-split peak, some at the second peak, and the rest when it dropped below its moving averages. \n\nGoing forward, I think Apple will be fine, and will once again outperform, but beware of recency bias. Everything that hit it out of the park in 2020 is doing poorly right now, because the companies pulled their earnings and goodwill forward so much. I think the M1 transition is going to continue to be fabulous for Apple, and as a customer I couldn't be happier. But I now own things that are in clear uptrends, like financials and energy, because \"we don't marry our stocks.\"", "score": 1, "replies": []}, {"body": "You may want to look into index investing and check out bogleheads. It is often considered the gold standard of investing your retirement and long-term assets.\n\nIn fact, Warren Buffet recommends this strategy for most retail investors.", "score": 1, "replies": []}, {"body": "Diversification is your friend when you're investing in high growth stocks. When I read just the title, I thought Apple is Warren Buffet's \"riskiest stock\". (Maybe BYD is )Not exactly what I call risky.", "score": 1, "replies": []}]}
{"title": "10k Tesla Yolo", "selftext": "", "id": "neoa2q", "created_utc": 1621277060.0, "score": 104, "upvote_ratio": 0.82, "num_comments": 42, "comments": [{"body": "This guy inversed michael burry gl retard", "score": 126, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Except it doesn’t. Burry isn’t a wall street pleb. He made most of his money betting against them. Elon musk is just a rocket man.", "score": 15, "replies": [{"body": "[deleted]", "score": -17, "replies": [{"body": "Yeah. He did bet against Wall Street. Both in the housing crisis and with GameStop. Elon musk is just really good at getting scientists and engineers to make things and raising money for things most people are afraid of. Tesla is a car company that has far too high of a market cap and not even close to enough sales to justify it.", "score": 11, "replies": []}, {"body": ">Is there any other company doing FSD for the masses? \n\nman here thinks Telsa actually has FSD. Like actual FSD. Elon sure got you good with marketing partial self drive.", "score": 2, "replies": []}, {"body": "I mean Burry's only big fame is Big Short against Mortgage Securities and having over a million shares of GME long before it skyrocketed.", "score": 1, "replies": []}, {"body": "Remind me! 5 days", "score": 1, "replies": []}]}]}]}]}, {"body": "May the force be with you\n\n[19.2% short interest on $TSLA](https://www.schaeffersresearch.com/content/analysis/2021/05/17/tsla-could-catch-a-break-according-to-bull-signal)", "score": 19, "replies": [{"body": "the % of shares in float is too high for any squeeze to be realized, I would more bet on a gamma squeeze than anything but right now theres a big gamma pin at $600", "score": 2, "replies": []}]}, {"body": "this is the way 💎🙌🏼", "score": 9, "replies": []}, {"body": "How do you get those numbers in your account to turn green?", "score": 7, "replies": []}, {"body": "My man!!", "score": 4, "replies": []}, {"body": "I’m all in for 90 shares in my 401K, but at $593.", "score": 5, "replies": []}, {"body": "Good luck ape 🦍", "score": 7, "replies": []}, {"body": "why call?", "score": 6, "replies": []}, {"body": "Michael Exhume", "score": 3, "replies": [{"body": "Lmao", "score": 1, "replies": []}]}, {"body": "I just bought a call too when i hear that michael burry. He needs to be burn!", "score": 6, "replies": []}, {"body": "Good Luck fellow Ape! I bought the dip as well", "score": 2, "replies": []}, {"body": "You got any banana rum?", "score": 2, "replies": []}, {"body": "Buying a stock in the top 10 of the s&p, at a recent low \n\nr/investing", "score": 5, "replies": []}, {"body": "that's not YOLO when you expect to get rich by 2022. we are looking for something like tomorrow", "score": 5, "replies": [{"body": "Burry bought 2022 puts didn't he?", "score": 2, "replies": []}]}, {"body": " Mbury bought ton puts. Idk good luck 2u", "score": 3, "replies": []}, {"body": "I feel sorry for you man.  Michael burry did a huge short against Tesla...", "score": 1, "replies": [{"body": "I’m not he’s going to be filthy rich. Tesla is on $630 now btw 🥳", "score": 1, "replies": []}]}, {"body": "rip", "score": 0, "replies": []}, {"body": "Half bulls half bears on TSLA", "score": 0, "replies": []}, {"body": "You know, normally I would wish you luck on this endeavor but as I plan on buying puts tomorrow, I can’t do that good sir.", "score": 1, "replies": []}, {"body": "I take it you need to lose about $10k to break even for the tax man\n\nGodspeed ape", "score": 1, "replies": []}, {"body": "September tge worst trading month of the year", "score": 1, "replies": []}]}
