{"title": "Had some bad FOMO. Now looking to add MSFT, TSLA, BA, DIS, AMD, TSM, PYPL, VTI so that they’re 5-10% each. Side note : on a scale of 1-10 how poor is my portfolio?", "selftext": "[deleted]", "id": "ndv76j", "created_utc": 1621191518.0, "score": 20, "upvote_ratio": 0.78, "num_comments": 50, "comments": [{"body": "Looks like a lot of work and a waste of time honestly 😂", "score": 33, "replies": [{"body": "Amen", "score": 1, "replies": []}]}, {"body": "Explain me the portfolio philosophy...what kind of profit you are going to take on a stock that is 1.8% of portfolio? Just choose 1-2 good ETF 40% portfolio, apply in 2-4 solid companies another 40% and play casino with 10-20%.", "score": 28, "replies": [{"body": "How much does an ETF make on a stock that’s less than 1% of its composition? Gains and losses are a function of total % up or down. His model is effectively a personal ETF. \n\nIt’s not my personal approach, but I respect that the community often says, “you have too many stocks. Cut the number down (reduce exposure), but maybe add an index fund (increase exposure).” There seems to be a no man’s land between a handful of carefully monitored picks and the boglehead approach. \n\nThis reply is just conversational musing, though. My personal approach is index fund + 2 picked stocks.", "score": 5, "replies": [{"body": "I agree. The issue is that if you create your own portfolio you act like a manager, it’s ok. But these fund benefit from Dark Pool deals and use of fast trading algorithms. Besides they have access to market makers. Which means that the common investor is not going to profit so much...these guys can benefit even in a sideways stock. Another issue is to create a portfolio based on long positions. Even so...creating a portfolio with so many overlapping ETF its an personal option. Unless you are able to live only for your portfolio e better to keep it small and consistent.", "score": 1, "replies": []}]}]}, {"body": "Couple of questions / comments:\n\n\\- Why so many names, including very small positions? Is having BB in your portfolio really better than increasing your BABA position by 0.54 ppts?\n\n\\- If you have many names to spread your risks, why not a higher % of VTI which has everything?\n\n\\- Average price that you bought for in the past is irrelevant imo for what your portfolio should look like.\n\n\\- Many of the names are retail darlings / meme stocks with pretty high valuations. How certain are you that their sales & margin growth will be big enough to justify those eye popping price/sales ratios? \n\n\\- Also many of the names in the 'speculative tech' space will be very heavily correlated if things crash (i.e. when the Fed stops pumping and 10 year treasuries go to 4%).\n\n\\- My recommendation: Unless you've done solid DD just put 90% in a low cost global ETF, and use 10% for betting on things that could go to the moon", "score": 13, "replies": [{"body": "As for the score, I'd give you a 3. Would have been a 1 without AAPL, BABA, TSM and VTI.", "score": 4, "replies": []}]}, {"body": "I think these will all gain over enough time, but you bought really high on a number of these. So consider averaging down on your favorites/most conviction and dumping your biggest losses/least conviction. It behooves you to own 100 shares of at least one company so you can earn premiums selling CCs, and then use some of that premium/cash earned to slowly avg down on others while things stay sideways.", "score": 4, "replies": []}, {"body": "Sell all of that shit and invest in 2 companies only", "score": 2, "replies": [{"body": "Why not diversify?", "score": 1, "replies": [{"body": "You’re not making any profit whatsoever with spreading pennies over 20 stocks", "score": 1, "replies": [{"body": "You can also lose a lot on one stock.", "score": 0, "replies": []}]}, {"body": "Diversify with an ETF like VTI, VXUS, or SPY.  Then you're actually diversified.  This is literally all tech stocks and meme stocks with 1.6% allocated to VTI.", "score": 1, "replies": [{"body": "Lol GameStop is a larger portion of his portfolio than the Total US Market Index  he owns (VTI)", "score": 1, "replies": [{"body": "lol this", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Why VTI when you could just buy one share of every stock you can afford?", "score": 1, "replies": []}]}, {"body": "1 GME at $320, that’s gotta hurt. Watch that 1 stock save your whole portfolio though! 🦍", "score": 8, "replies": [{"body": "Why has he not been averaging down?", "score": 7, "replies": []}]}, {"body": "Quick recommendation! I’d consider calculating the % of your portfolio based on current price rather than average cost. If you’re rebalancing it’s generally better to go off of the actual current % each holding makes up out of your total rather than how much you originally purchased it for.", "score": 6, "replies": [{"body": "Do you know how I can somehow link live prices to an excel spreadsheet ?", "score": 1, "replies": [{"body": "Pretty sure there’s a formula on google sheets to link prices from yahoo finance!", "score": 2, "replies": [{"body": "It can be done in Excel:\n\nhttps://support.microsoft.com/en-us/office/get-a-stock-quote-e5af3212-e024-4d4c-bea0-623cf07fbc54", "score": 3, "replies": []}]}, {"body": "Highlight the ticker symbols, go to the Data tab, from there you can change the data type to stocks. Say you wanted to reference AAPL’s price and AAPL is in cell A3, you can reference the price by entering =A3.price\n\nEdit: To add on, click the refresh button when you want up to date data", "score": 2, "replies": []}]}]}, {"body": "Way to spread out. I get it you want that many companies but what's the point", "score": 2, "replies": []}, {"body": "I agree. To many different stocks for a portfolio size of approx 13k. 20 stocks and an ETF or two are fine for 100k or 500k portfolio size. But your BB could 10x and it wouldn’t matter.", "score": 2, "replies": []}, {"body": "This is hilarious", "score": 2, "replies": []}, {"body": "This is way more diversification than needed. So many arkk funds", "score": 2, "replies": []}, {"body": "Check out ipo and generally go in earlier.\nWhen I see PLTR and GME you bought too late.", "score": 1, "replies": [{"body": "too late? nothing wrong with holding a single share—you never know what could happen...", "score": 1, "replies": [{"body": "You are right, my mistake.", "score": 1, "replies": []}]}]}, {"body": "Need amc shares", "score": -3, "replies": []}, {"body": "Extremely poor. You need to be adding AMC and GME. Bollocks to 5/10 % you deserve to go to the moon....", "score": -6, "replies": [{"body": "Lame", "score": -2, "replies": [{"body": "but true. The market is taking a hammering but AMC is in the green and going up. No apes are selling and because of that the price will only keep going up. I dont think that is lame...However i wish this chap all the best.", "score": -2, "replies": [{"body": "I’ve got no problem with AMC shares but this guy is being serious with his buys don’t think having 5% of amc would really fit his game plan", "score": 1, "replies": [{"body": "I know I'm sorry. I guess i was trying to be a little light hearted. I will stick to AMC with the AMC comments. Like i say he has got one GME so he is one the rocket. Anyway i wish him all the best we all deserve to make money but right now things are tough with the way the market is behaving....", "score": 0, "replies": []}]}]}]}]}, {"body": "Need Amc", "score": -5, "replies": [{"body": "Yeah, thank you for representing!  Don't let the down votes deter you from saving this guy from going broke. The bots will downvote because they don't want this info out there.", "score": -1, "replies": []}]}, {"body": "1", "score": 1, "replies": []}, {"body": "I find it unlikely you’ll get pypl for under $225. A lot of those prices are quite low, but who knows.", "score": 1, "replies": []}, {"body": "I would not bother having any position below 5% of total and you're overweight in apple", "score": 1, "replies": []}, {"body": "1 out of ten. TheWorsified too much. Wrong fad ETFs. Pick just a few growth equities with solid fundamentals. NIO and AMD got the one point.", "score": 1, "replies": []}, {"body": "10 or less stocks", "score": 1, "replies": []}, {"body": "Wow. U r holding heavy bag. Ave down.", "score": 1, "replies": []}, {"body": "🦅 Eagle Eye Investments 🦅\n\nEmerging community with fresh ideas, opinions and strategies on stock investing and crypto plays. \n\nUse the education section to learn about trading fundamentals and how to do your own due diligence.   \n\nJoin our community and help us grow! \n\nJoin us! \nInvite link: https://discord.gg/XExcU8ptys", "score": 1, "replies": []}, {"body": "Terrible. Maybe just give you 1. Rather put for 60% spy and 40% qqq.", "score": 1, "replies": []}, {"body": "You need AMC in your life , not financial advice 🚀", "score": 1, "replies": []}, {"body": "Lol, how poor is it? You already know.", "score": 1, "replies": []}, {"body": "5", "score": 1, "replies": []}, {"body": "You’ll be buying all those companies excluding BA at their peak and the first market correction you’ll get slaughtered and chasing the break even line.", "score": 1, "replies": []}]}
{"title": "Tesla Fremont Flyover - Refresh S' Everywhere- May 15, 2021", "selftext": "", "id": "ndgex2", "created_utc": 1621139325.0, "score": 222, "upvote_ratio": 0.99, "num_comments": 40, "comments": [{"body": "Off topic a little but at 12:00 in the video you can see what I assume are mock up homes being built with solar roof - you can see one is brown or terracotta colored and one is still under construction.\n\nIn the future I'd  imagine these will have Tesla  HVAC installed as well :)", "score": 24, "replies": [{"body": "Another interesting tidbit is mentioned in the video description:\n\n> \"**Kato lot full of employee cars.** Not on video.\"\n\nKato road is Tesla's 10 GWh/year full scale 4680 cell factory...", "score": 20, "replies": [{"body": "Since the construction is finished, I've never seen that lot having a single parking spot empty. Bullish sign indeed.", "score": 2, "replies": []}]}]}, {"body": "They're gonna start building a mountain out of those rear frame castings at this rate.  \nAlso I can't get over what an absolute rats nets of buildings that place is.  no wonder Elon prefers to start from scratch.", "score": 13, "replies": []}, {"body": "There has to be some specific part shortage that delayed this release, similar to how there are thousands of F 150's piling up in Kentucky. \n\nbut it's great to know there are Model S's ready to be deployed asap.", "score": 3, "replies": []}, {"body": "Just saw the video of the refreshed X with no radar, so assume that the S and X are waiting for FSD v9 and in the meantime Tesla just continues to manufacture them and whenever V9 is released there will be an explosion of them delivered to make up for previous months. \n\nI think the only issue at this point is the same one from Q1 if they don’t deliver in Q2, essentially they are paying to make them but not generating any revenue from them. \n\nIf that happens the stock will probably stay flat or go down, but then when they are released in Q3 or Q4, they will essentially be delivering all the premanufactured back orders and will have a blowout quarter.", "score": 12, "replies": [{"body": "Could also be missing components due to chip shortage", "score": 8, "replies": [{"body": "Zero chance of that.  Be better next time", "score": -13, "replies": [{"body": "Lol care to back up your statement? Be better next time.", "score": 11, "replies": [{"body": "With such a huge increase in deliveries from Q1, why would chips be the limiting factor? If Tesla has a choice between putting a chip in Y/3 vs S/X they would choose S/X since it’s much higher margin", "score": 2, "replies": [{"body": "Chips are not interchangable. They aren't some commodity that can be diverted from one model to another. That would be like saying \"it can't be shortage of doors, if there was a shortage of doors they would just divert the doors from the model 3/Y over to the S/X.\" That obviously wouldn't work since the doors for each model are unique.\n\nGiven that S/X are being refreshed the chip designs are probably new. Ramping up production on new chips is taking a loooong time these days.\n\nTo be clear, I have no idea if it is the chip shortage or not that is making the S/X take an eternity but I think it is still plausible.", "score": 6, "replies": [{"body": "It’s not chips.  So stop trying to say it is or could be.", "score": -2, "replies": [{"body": "Just link to your source. I'm not saying your wrong, I'm just saying that I'm not going to believe some random person on the internet who makes a claim without backing it up. If what you're saying is true it should be easy for you to show me the evidence.", "score": 4, "replies": [{"body": "You are believing him w no source.  Earnings call for chips", "score": 1, "replies": []}]}]}]}]}, {"body": "Tesla said chips arent a problem and bigfalcon is a concern troll", "score": 1, "replies": []}]}]}]}, {"body": "Lol just S and X aren't going to make or break the quarter.", "score": -1, "replies": [{"body": "Even at low volumes they make a huge impact on the earnings because of higher margins and prices.", "score": 20, "replies": [{"body": "But at low volumes those margins won't be that great either. I think the margins + revenue of the refreshed S/X are gonna come together in Q4 or Q1 2022. So I think we rather can expect an explosion at once a few quarters out rather than already a decent impact in the quarters before.", "score": 3, "replies": []}, {"body": "Maybe if they only deliver Plaid models.  Margins are much lower during ramps.", "score": 2, "replies": []}]}, {"body": "Not at all, but being able to deliver more models than can normally be produced in a quarter will look good. They are also high margin vehicles so that will also look good.", "score": 4, "replies": []}, {"body": "I see the potential to sell at a rate of up to 200 K per year, which is quite substantial compared to 1 million Model 3 and Y.", "score": 1, "replies": []}, {"body": "But they do break the quarter time record.", "score": 1, "replies": []}, {"body": "After months of no sales at all and pent up demand, they absolutely could make the next 2-3 quarters look much better, before settling back to normal.", "score": 1, "replies": [{"body": "They won’t settle back to 70k / year for years.  They will sell 25-30k per quarter for at least 8-10 quarters.", "score": 2, "replies": [{"body": "We will see. There are more choices now.", "score": 2, "replies": [{"body": "Yes, but the market is expanding too. While Tesla’s market share as percentage goes down, I expect to have them healthy growth in terms of absolute units.\n\nLot of people don’t realize how big a moat is the supercharger network. My wife doesn’t even want to entertain other EVs due to that and OTA updates. I can see us successfully have an all EV household with Tesla but not with any other manufacturer for the next 3 to 4 years", "score": 2, "replies": [{"body": "Agree in general, but I think for Model S/X to sell more than the historical 15-20k per quarter after the backlog is done they will need a deeper refresh, or a price drop, or both. With a $10k price drop and more radical restyle, they could double in sales. I just don’t see those two things as super likely in next 3 years.", "score": 2, "replies": []}]}, {"body": "Please name a single one with competitive objective specs.  These are far and away the best vehicles made.", "score": 1, "replies": [{"body": "Not saying all the specs are the same, but there are more things in the ballpark. If price doesn’t matter, Taycan is pretty competitive with Model S on specs. To be clear, I do not remotely think Taycan or the new Audi GT or any premium EV will outsell Model S in a model by model comparison. I’m saying that collectively there are more choices for people who are turned off by one or more aspects of Model S/X but still want an EV. Collectively, they will put a dent in sales I think. If Tesla can keep reducing the cost to build and the price, they can keep up sales or even grow them. But if they stay in the $70-$150k range I think the sales will settle down to about 5,000 combined S/X per month by second half of 2022 after the backlog is taken care of.", "score": 2, "replies": [{"body": "That’s a ridiculous prediction.  The old SX which were already better than Taycan et al would have sold better than that.", "score": 1, "replies": [{"body": "SX sales were flat or dropping for almost two years, weren’t they? That’s just about exactly where they would be selling now without a refresh. I didn’t count the refresh as boosting sales because it seems minimal to me, but I agree that is probably a weak point of my projection. We will see how the market receives it.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "How can you differenciate the refreshed Model S from Model Y / Model 3 ?", "score": 3, "replies": [{"body": "Easiest way I’ve found when skimming this kind of video is to look at the headlights and the rear windscreen, specifically the shape of the tint. \n\nY the rear window is fully tinted and is black all the way down, 3 the rear window has no tint so you can easily differentiate between those two.\n\nOn the S you can see a distinctive full width cut out for the 3rd brake light at the top of the untinted rear window, and the X is easy to spot because of falcon door hinges/seals running down the middle of the roof.", "score": 8, "replies": []}, {"body": "Seeing the difference between 3 and Y is hard for me from these drone videos. But from someone who loves these cars it’s not to hard to see the different tail lights/ front bumper to locate the S on the trucks or in the lot.", "score": 3, "replies": []}]}, {"body": "Anyone know why so many have different body color panels?", "score": 1, "replies": [{"body": "It's a protective film that's used to help prevent the bumpers from getting excessive rock chips and smooshed bugs while transporting the cars to delivery centers.", "score": 13, "replies": []}]}, {"body": "[deleted]", "score": -7, "replies": [{"body": "I’m not sure I’d want to buy a “new” car with 2700 miles on it.", "score": 17, "replies": []}, {"body": "Like others have said, too many unnecessary miles on a brand new car.  I would want it.   But get 10 Tesla Semi in convoy mode, now that’s more like it!  I can see the semi driving the final few miles by themselves and delivering the Tesla house to house like Amazon!", "score": 1, "replies": []}]}, {"body": "Why do they line them up to the left hand side of each lane line, rather than the middle? Just curious!", "score": 1, "replies": [{"body": "Probably easier to line up on a line rather than estimate the middle, ensure the same distance between cars to get in and out of them easily", "score": 2, "replies": []}]}]}
{"title": "Historical Post Earnings Moves MEGA Compilation (Week 5) - $HD, $WMT, $TGT, $LOW, $CSCO, $GOEV, $XL, $SE and More", "selftext": "**Historical Post Earnings Moves MEGA Compilation (Week 5) - $HD, $WMT, $TGT, $LOW, $CSCO, $GOEV, $XL, $SE and More**\n\n&nbsp;\n\nWhat's poppin' bull gang, Flux here with Week 5 of the Historical Post Earnings Moves MEGA Compilation. I hope you all made some good money following the spreadsheet last week, cause it's time to do it all again! Earnings season is slowly coming to an end, so this weeks spreadsheet is a little smaller than prior weeks, but that's alright, there's still money to be made.\n\n&nbsp;\n\nAll that being said, I fucking love earnings season. It’s an absolute battleground out there. Insane volatility, breaking announcements, and huge moves being made every single day for weeks at a time. What’s not to love? Anyone has a chance to pick the correct tickers, roll the dice, and amass a small fortune. That being said, the unpredictable nature of earnings season often makes or breaks traders - many find that they’re one bad trade away from a complete blowout, so you always need to think about each trade critically. No shame in sitting it out altogether.\n\n&nbsp;\n\n\n---\n\n#The Spreadsheet\n\nTo aid us in planning our trades this week, [**I've compiled a spreadsheet consisting of all of the Historical Post Earnings Moves of EVERY stock reporting earnings this week**](https://docs.google.com/spreadsheets/d/1tiIuvRFHYgqLQpe7HdDYNQ1ZkQGA55gLKc0A_jJQKiQ/edit?usp=sharing). Using this spreadsheet, we can determine which options to buy or sell to minimize risk and maximize probability for ANY given ticker. Obviously, past performance isn’t indicative of future success, but we can still use these numbers to gain a general idea of the expected earnings move of a given stock. Gone are the days of getting randomly blown out due to lack of information! If you’re struggling to find a given stock, click on the ticker symbol on the index page, it should hyperlink you straight to the table! If the above link isn’t working for you, refer to the link below!\n\n&nbsp;\n\n[Spreadsheet HERE](https://docs.google.com/spreadsheets/d/1tiIuvRFHYgqLQpe7HdDYNQ1ZkQGA55gLKc0A_jJQKiQ/edit?usp=sharing)\n\n&nbsp;\n\nPlease note that scraping and compiling this data took *hours*. If the sheet has helped you out in any way, please drop an upvote or a comment and peep my socials! It would mean alot to me. Most websites also require you to pay for this data, which I think is a load of shit.\n\n&nbsp;\n\n---\n\n#Interesting Observations and Sample Plays\n\nBelow I’ve compiled some interesting observations which can further aid us in making trades this week, alongside some sample plays for those who are new to playing earnings and need some guidance. If I missed anything, feel free to bring it to my attention!\n\n&nbsp;\n\n- **Expect larger moves coming out of retailers this week**. Home Depot, Lowe's, Walmart, and Target all have fairly conservative historical moves, but will likely break trend this earnings. Last quarter was fucking *massive* for these retail giants, as the holidays combined with stimulus cheques will likely lead to insane profits among them. Expect a large move to happen for each corresponding retailer, to either the upside or downside.\n\n&nbsp;\n\n- **Lots of Chinese tech companies report this week.** If you're looking for a fun little collateral play, you can take a look at various Chinese tech ETFs and paly options on them. The IV on the ETFs is general lower than the ones on the individual tickers, although most of the tickers move in tandem with one another. If one beats, they usually all beat, and vice versa.\n\n&nbsp;\n\n- **Don't fall for the Solar trap**. Solar has been heavily beat down all throughout earnings season, and as a result you may be inclined to buy Puts. Canadian Solar and Maxeon Solar have both slid extremely far following the movements of their peers throughout earnings, and are likely primed for a reversal. There isn't much farther for these stocks to go down, and as a result, a terrible earnings for both of these companies is already priced in. If they even match estimates, or put up a beat, they will likely move upwards. This exact situation occurred with Nikola two weeks back. I would look to play a neutral to bullish strategy on these tickers.\n\n&nbsp;\n\nObviously, since I gave data on over 50 companies, there's plenty that I’ve missed. Dive in, have a look around, and have some fun with it! Use the spreadsheet to aid you in picking the safest strikes, and get the best risk-reward possible. Feel free to share your findings too, I’d love to see what you guys come up with.\n\n&nbsp;\n\n---\n\n# Conclusion\n\nWe’ve got an insane lineup of companies reporting earnings this week, meaning there’s a huge variety of plays to be made for traders of all skills and styles! Use the [spreadsheet](https://docs.google.com/spreadsheets/d/1tiIuvRFHYgqLQpe7HdDYNQ1ZkQGA55gLKc0A_jJQKiQ/edit?usp=sharing) to determine which stocks offer the best risk to reward ratio, and play accordingly! If enough people found these useful, I'll continue making them throughout the earnings season! If the sheet has helped you out in any way, please consider dropping an upvote or a comment, and checking out my socials, it would mean a lot to me! **Happy Trading Everybody! :)**", "id": "ne1fla", "created_utc": 1621209195.0, "score": 219, "upvote_ratio": 0.91, "num_comments": 48, "comments": [{"body": "Just wanted to say I agree with your sentiment on each of these sub sectors - thanks for the quality", "score": 12, "replies": [{"body": "Happy to help brother, thanks for the read!", "score": 7, "replies": [{"body": "thank you for the DD brother", "score": 2, "replies": [{"body": "Not a problem!", "score": 2, "replies": []}]}]}]}, {"body": "You’re a good lad, Flux. Thanks for the quality post as always", "score": 6, "replies": [{"body": "Appreciate it man, cheers!", "score": 5, "replies": []}]}, {"body": "569 shares of XL at $6.98.... to the moon Alice!!!", "score": 6, "replies": []}, {"body": "Short HD and LOW. Expect negative future guidance that will scare markets. Demand destruction from rising prices.", "score": 6, "replies": [{"body": "Calls on HD aNd LOWES it is. Always inverse wsb.", "score": 10, "replies": []}, {"body": "On the flip side, I work at a HD and we're fucking killing sales week in and week out man. We're beating numbers from last year, when half the fucking US was stay at home. Absolute madness.", "score": 8, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "The run up we’ve seen from 300-340 might’ve been the market expecting them to beat so idk what HD will do, but we’ve been busier than all hell almost every day, even compared to last year. People are still spending shit tons of money", "score": 1, "replies": []}]}]}, {"body": "That's something that I haven't considered, and definitely something to take note of, cheers!", "score": 2, "replies": []}]}, {"body": "Some other Ape mentioned Huya this weekend, an interesting tech stock....never like anything Chinese, but this one actually seems like a good potential upswing is in the cards", "score": 2, "replies": []}, {"body": "This is an awesome resource. Thank you for putting it together.", "score": 2, "replies": [{"body": "Glad you liked it man!", "score": 2, "replies": []}]}, {"body": "Week 5 of getting reamed let's get it boys. Puts on everything 🐻", "score": 2, "replies": []}, {"body": "HD going to 400$👀", "score": 2, "replies": []}, {"body": "Target Q1 Store Comparable Sales Up 18%, Drive Up Sales Up 123%", "score": 2, "replies": []}, {"body": "Isn't solar screwed until the semiconductor situation gets under control? I ask because one of my plans was to open and start stacking enph for the next year or two, thinking there will be no rush before price hits the sun.", "score": 1, "replies": [{"body": "I'm inclined to believe most of that is priced in at this point.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -3, "replies": [{"body": "Wtf are you smoking? Both of those aren't OG stocks", "score": 1, "replies": [{"body": "I was here when some dude leveraged his house to buy FNMA expecting them to be released from conservatorship. Also the daily jnug yolos.", "score": 2, "replies": [{"body": "jnug yolos 💆‍♀️ made $80 and felt like a king.", "score": 1, "replies": []}]}, {"body": "It was a question.. I hold my retarded ass with GME and play all SPY index companies falling red on a green week!! Options for options, but all I see is Reddit AMC talk in the top 3 which is bullshit to me", "score": 0, "replies": []}]}]}, {"body": "anyone else eyeballing a short short opportunity on $TJX?", "score": -1, "replies": [{"body": "Why it would be?", "score": 1, "replies": [{"body": "because its far overpriced & the market seems to want todrop things on earnings......", "score": 1, "replies": []}]}]}, {"body": "Super useful. Was considering HD and WMT calls but not too confident anymore after the sheet", "score": 1, "replies": [{"body": "I'm inclined to go long as well, may do so with debit spreads.", "score": 2, "replies": []}]}, {"body": "Home Depot good.", "score": 1, "replies": []}, {"body": "HELP US SIRI INVESTORS,. Plz\n\nShorted to death… and then they dig the grave", "score": 1, "replies": []}, {"body": "I LOVE EARNINGS TOO FLUX", "score": 1, "replies": []}, {"body": "Thanks OP, a lot of work put in this and I appreciate you sharing with us.\nBased on your data I bought calls on LB. last 5 earnings in a row generated an increase in stock price. We will see", "score": 1, "replies": []}, {"body": "I think retailers won't move much. They are priced pretty well. Shouldn't be a huge surprise. I could see WMT going up and TGT going down just because TGT is above it's longterm trend and WMT been stagnant.\n\nTGT killing it though, so I'll hold", "score": 1, "replies": []}, {"body": "Thank you for your great inputs.", "score": 1, "replies": []}, {"body": "Calls on L Brands? Surely the nonsensical +3% / +12% trend will continue", "score": 1, "replies": []}, {"body": "impressive work!", "score": 1, "replies": []}, {"body": "You're list seems very well made. Is your list for stocks, options, or both?\n\nI bought 4 shares of Baidu.  \n\n\nIf I'll get rich from this, I'll need an address to where to send you your present", "score": 1, "replies": [{"body": "Either or! Play whatever derivative you feel comfortable with.", "score": 2, "replies": []}]}, {"body": "WMT 5/21 $150c checking in!", "score": 1, "replies": []}, {"body": "What do you guys think of long term SE?", "score": 1, "replies": []}, {"body": "OP do you mind sharing the links to the other weeks as well? good data to save and add too. u/FluxRevived", "score": 1, "replies": [{"body": "All links can be found on my profile!", "score": 1, "replies": []}]}]}
