{"title": "Oil exec tries to get earnings info from Tesla by impersonating Elon Musk with elontesla@yahoo.com email address.", "selftext": "", "id": "52vzog", "created_utc": 1473944068.0, "score": 575, "upvote_ratio": 0.93, "num_comments": 95, "comments": [{"body": "its me ur broder, how is busines goin?", "score": 271, "replies": [{"body": "Let's go bowling!", "score": 50, "replies": []}, {"body": "http://i.imgur.com/562v8W4.png", "score": 11, "replies": []}, {"body": "Halp! You has $50,000,000 here in turdlickistan but I need $$ to pay customz. Pls send $35,000, USD no Canada dollars. Also, how is earnings doing, eh??", "score": 8, "replies": []}]}, {"body": "Hey everyone, I just got probablyavirgin@gmail.com. Can I use it to E-Mail mast's CEO for Phase III data?", "score": 73, "replies": [{"body": "Or you can e-mail MAST telling them they are FDA approved using fdapproved@yahoo.com", "score": 42, "replies": [{"body": "Hello,\n\nYou've been FDA approved.\n\nCall 1-800-fda-approved for more information.\n\nGood Day,\n\nYours at the FDA", "score": 24, "replies": [{"body": "Plz include credit card number information for additional verification ", "score": 9, "replies": []}]}, {"body": "Someone do it, lmfao.", "score": 1, "replies": []}]}]}, {"body": "Haha how stoned was this guy that he just thought no one would notice?", "score": 78, "replies": [{"body": "He's in Texas, they impale your anus with a fire poker before sending you to jail for life for smoking weed. Guy was most likely drunk off his ass.", "score": 26, "replies": [{"body": "That doesn't stop almost everyone I know here from smoking weed. ", "score": 1, "replies": [{"body": "That depends. Do you live in Austin?", "score": 1, "replies": [{"body": "No, he's just white", "score": 7, "replies": [{"body": "No Dallas ", "score": 3, "replies": []}]}]}]}]}, {"body": "He should've bought the domain \"@TeslaMoturs.com\" or something close to it.\n\nIf anyone tries telling me you can't buy an email domain, g.f.y. I have my own. You don't need to be under a company or anything, just pay the fee.\n\nOff-Topic: If you plan on following any real (Non-McDonalds) Job, get your own domain, for example, mine is <FirstName>@<Lastname>.com - No one can use <TheirName>@<MyLastName>.com since it's taken by me - Anyway, it makes you look more serious and professional. And obviously it's much cooler to have a card saying @<YourName>.com instead of @Gmail.com.\n\nIt's definitely one of the things I look for when a 22y/o straight out of college gives me a card.", "score": -18, "replies": [{"body": "i'm more impressed you managed to snag faggot.com which must be pretty valuable.", "score": 204, "replies": [{"body": "It's worth about three-fiddy", "score": -6, "replies": []}]}, {"body": "> If anyone tries telling me you can't buy an email domain, g.f.y. I have my own. You don't need to be under a company or anything, just pay the fee.\n\nwhy would anyone say you couldn't buy an email domain?", "score": 38, "replies": [{"body": "Because you don't buy it. You lease it.", "score": 35, "replies": []}, {"body": "One faggot did and got downvoted into suicidal thoughts.", "score": -12, "replies": []}]}, {"body": ">It's definitely one of the things I look for when a 22y/o straight out of college gives me a card.\n\nSounds like the typical bullshit bad advice you hear as a college student. \"Don't do a cover letter! No one worries about those!\" \"Always do a half-windsor knot!\" \"Buy an email domain with your last name to show how professional you are!\"\n\nNone of those things will get you the job. Tenacity, qualifications, and general personality fit will get you the job. There's so much silver bullet bullshit out there-- that email trick might work on you, but you're doing people a disservice by acting like it's some requisite.\n\n>I'm a job recruiter and I fuckin love Red Starburst, the first thing I ask for when screening candidates is their favorite Starburst flavor, especially if they're fresh out of college.\n\nNo one is going to ever pass on your resume because of a firstname.lastname@gmail.com email. If someone did-- consider that a bullet dodged, because odds are the work environment will police you over everything else as well.", "score": 36, "replies": [{"body": "OnlyWeakness@Workaholic.net, beating off headhunters with a stick, but that only shows more tenacity. ", "score": 6, "replies": []}, {"body": "It won't get you the fucking job if you're complete garbage. It's an extra. Honestly, I can see that you're definitely not in a powerful/important position, where you actually need to evaluate other people, whenever you get there, IF you get there, then PM me back :) \n\nPS: I'm never getting this PM from you, because there won't be one.", "score": -35, "replies": [{"body": "Turn dah autism down pls.", "score": 26, "replies": [{"body": "Right after you", "score": -5, "replies": []}]}, {"body": "/r/iamverysmart", "score": 14, "replies": [{"body": "Salty weeaboos", "score": -5, "replies": []}]}, {"body": "Thank you for confirming my belief that I'd never want to work for anyone like you.\n\n", "score": 12, "replies": [{"body": "Judging by your pathetic post history you won't. Don't worry :)\n\nThat is, if you even work, from your post history I just know that you live off welfare.", "score": -9, "replies": [{"body": "Lol", "score": 12, "replies": [{"body": "I see I was clearly right.\n\nI mean, statistically speaking, yes, you do live off welfare:\n\nPoster on /r/SandersForPresident , /r/BlackPeopleTwitter , /r/Politics There CLEARLY is a trend which indicates you live off welfare (Or an extremely easy/low-pay job, which isn't much better) :) And then gaming subreddits just to shine the spotlight on how much of a lazy fuck you are: You vote for a communist, then you spend the rest of your day playing videogames. \n\nReally, REALLY good, and people should definitely hear your opinion about finding a job. \n\n-------\n\nSometimes I just have to thank god that I don't work with anyone as dumb as you, in my line of work there aren't many dumb people, and how glad I am knowing that you're not into my line of work at all! \n", "score": -7, "replies": [{"body": "I'm gonna print this out and put it on my desk at work", "score": 12, "replies": [{"body": "Please do, remind yourself of how pathetic you are! You're literally the base of a pyramid, you're the bottom of the bottom, you know that, right?\n\nNow go collect your welfare or your $400 check for the month, or just go back to your house at /r/BlackPeopleTwitter ", "score": -4, "replies": [{"body": "> just go back to your house at /r/BlackPeopleTwitter\n\nwhy are you assuming he's white?", "score": 2, "replies": [{"body": ":)", "score": 0, "replies": []}]}]}]}, {"body": "My one regret is that I only have one downvote for this ", "score": 5, "replies": [{"body": "Aw shucks! Why won't the government give you another one?", "score": -2, "replies": [{"body": "Fresh out. ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Spoken like a person with no power or importance at all. ", "score": 7, "replies": [{"body": ";)", "score": -1, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "wow rude\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "wow rude", "score": 1, "replies": []}]}]}, {"body": "an email domain is no different than any other domain", "score": 10, "replies": [{"body": "Thank you.", "score": -5, "replies": []}]}, {"body": "Personally I keep my gmail but have <fullname>.com registered and it points to my LinkedIn. ", "score": 5, "replies": []}, {"body": "This only works if nobody's done it first: my last name's domain was actually bought a few years ago by a site that does exactly this.", "score": 3, "replies": [{"body": "That sucks :(\n\nMy last name isn't all that common, so there's that. But Definitely get a special domain for the extra bling.", "score": -2, "replies": []}]}, {"body": "I recently did it and I must admit: it is pretty cool indeed. ", "score": 2, "replies": [{"body": "As someone who has somewhat of a say on other people's resumees, it's definitely a highlight.", "score": -4, "replies": []}]}, {"body": "Domains..how do they work?", "score": 2, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "wow rude\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -1, "replies": []}]}, {"body": "[deleted]", "score": -10, "replies": [{"body": ">You can't buy an email domain.\n\nThat's one of the dumbest things I've ever read.", "score": 17, "replies": []}, {"body": "You're autistic. Read the entire thing you fucking mongoloid. I have my own domain, you fucking retard.", "score": 4, "replies": [{"body": "I mean, he's wrong. Really wrong. Laughably wrong. \n\nBut your response might be a bit over the top...", "score": 6, "replies": [{"body": "I just don't really like it when people are as dumb as this fag is. Just my think, you know?", "score": -7, "replies": []}]}]}, {"body": "And where do you think they come from?  ", "score": 1, "replies": []}]}]}]}, {"body": "Ok, this is officially the best news story I've ever read. I bet it's our god and savior /u/jartek ", "score": 141, "replies": [{"body": "At the end of the email there would have been a link to a customer satisfaction survey had it been jartek.", "score": 29, "replies": [{"body": "No idea what this joke is, upvoted regardless.", "score": 30, "replies": []}, {"body": "if(if(if(if(\"Okie-Doke\")))))\n\nJust realized the based flair.", "score": 3, "replies": [{"body": "These nested if loops are so powerful.", "score": 3, "replies": [{"body": "Ha, just realized the programmer humor. Good shit.", "score": 2, "replies": []}]}]}, {"body": "> At the end of the email there would have been a link to a customer satisfaction survey had it been jartek.\n\nMore like an affiliate link for a brokerage masquerading as a customer satisfaction survey.\n\nYou need to make that dolla to yolo with.", "score": 4, "replies": []}]}, {"body": "The only funny part is that no one uses @yahoo anymore, and spoofing the actual email would have worked much better. ", "score": 9, "replies": [{"body": "I have been using the same yahoo email account as my primary email account for over ten years. They love me!", "score": 9, "replies": [{"body": "Older than 40? Anyone in their 20's would not be caught dead with a @yahoo email. ", "score": 2, "replies": []}]}, {"body": "True, @Yahoo is disgusting.", "score": 5, "replies": []}]}]}, {"body": "This is such a Randy Marsh thing to do", "score": 27, "replies": [{"body": "YES x10", "score": -4, "replies": []}]}, {"body": "That's it I'm registering janetyellenfed@aol.com", "score": 25, "replies": []}, {"body": "Hahaha @yahoo.com. Hahaha", "score": 19, "replies": []}, {"body": ">@yahoo.com\n\nWhat a buffoon. At least try a little harder and use @outlook.com\n\n", "score": 11, "replies": []}, {"body": "I wanna shake that guys hand. True Brass Balls shit. ", "score": 8, "replies": []}, {"body": "Desperate, stupid, or both I can't decide.", "score": 9, "replies": [{"body": "Genius.", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Genius.", "score": 1, "replies": []}]}]}]}, {"body": "This guy could teach a Power Move 101 class...", "score": 3, "replies": []}, {"body": "Ok which one of you guys did this lmao", "score": 6, "replies": [{"body": "Gotta appreciate a real YOLO.", "score": 3, "replies": []}]}, {"body": "I think he gave himself away in the ending.\n\n>I drink your milkshake    \n>-EM", "score": 3, "replies": []}, {"body": "Only a newbie could fall for that. ", "score": 1, "replies": []}, {"body": "the onion?", "score": 1, "replies": []}, {"body": "Serious question. How is his industry relevant? Quest isn't even an oil company, they're an engineering firm. Click bait?", "score": -2, "replies": [{"body": "Their continued business relies on the health of those oil companies though. And imagine the goodwill they'd garner by forwarding a response to this to the likes of Exxon etc.", "score": 0, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I take it you dont have much experience with O&G execs.", "score": 0, "replies": []}]}]}]}, {"body": "And when that didn't work, he emailed Elon Musk directly with \"Hey it's me ur brother\".", "score": -1, "replies": []}, {"body": "so how did the oil guy get caught? IPaddress tracked to his company address? if so gg den", "score": 0, "replies": []}, {"body": "Yo freaking Lo!", "score": -1, "replies": []}, {"body": "Why would they be suing if the didn't fall for it?  Whoops!", "score": -2, "replies": []}]}
