{"title": "$NOK for the value investor", "selftext": "Nokia DD\n\n\n\nNokia is an interesting, somewhat overlooked story, that has a lot of value and potential in the near term. Here is some DD to consider:\n\n\n\nHistorical Reputation: Nokia is not the one-trick pony as many think. Much of the perception around Nokia is due to its cell phones from 2000-2010 which became obsolete due to the introduction of iOs and Apple's IPhone. Few realize that the company actually started in 1899 as a paper supplier and has conti ually transitioned based on market/industry trends to remain profitable and healthy. They have done this continually and have a huge new stake in 5G and surrounding new technologies. \n\n\nAlso, it is important to remember that the lingering aftertaste of Nokia's old cellphone tech is a fading one. Many of the new market purchasers are younger and did not ever own Nokias. This also is irrelevant in emerging markets.\n\n\n\n5G Market Share: 5G is here and Nokia is a player within the space - no surprise there. What is intriguing about Nokia is NOT that they are leading some tech in 5G, it is that they have positioned themselves as an end-to-end supplier for operators within the space. This has TREMENDOUS upside for 2 reasons: (1) With the rise of high-tech manufacturing, new enterprises will be able to purchase -at scale- all inclusive 5G tech from Nokia without dealing with a piece-mealing their tech together from different vendors. Nokia makes this globally available. (2) The end-to-end portfolio can allow Nokia to easily grow/shrink areas of their company to match industry trends and remain profitable.\n\n\n\n5G Contracts:  As of today Nokia has 42 inked contracts for 5G. These are revenue generating contracts for deliverable 5G tech. Not R&D, not \"trials\", actual 5G contracts. Currently they are the largest provider globally. And they are contracted with some large players including T-Mobile, Sprint, China Mobile, China Unicom, BT Group, SoftBank, US Cell Core, and Taiwan Star Telecom. For me the India contracts are the most appealing. \n\n\n\nCash Flow, Profits, and Rajeev Suri: Nokia has put most, if not all, its efforts to the development of 5G and related new techs. They have sold over 80 patents, and remain nimble enough to continually grow. Additionally, they are not rushing to increase their operating margins and are HONEST about that fact with investors which makes them a long play. Since they are reinvesting much of their revenues back into new tech, they have stated that Q1 & Q2 will remain underwhelming in 2019 with revenue rising sharply in Q3 & Q4 as the contracts become revenue-generating. All this being said about their profits, they still continue to pay out an annual dividend of over 5% to their investors for a $5 per share stock. This is greater than anyone else in their space and illustrates their committment to investors and the company.\n\n\n\nRajeev Suri, the CEO since 2016, has been with the company since 1995 and has built a reputation as a corporate renewal specialist in the field. He is not an empty corporate suit,  but rather a knowledgable forward thinking leader in the sector. He also has global appeal and is nimble enough to move and adapt Nokias infrastructure in response to geopolitical tailwinds.\n\n\n\nThe Investing Strategy: Based on its current price of $5.14 it is better to outright own the shares and then trade options overtop. Currently a 10 lot ($5 x 1000 shares) would be roughly $5000, and a 5 lot would be $2,500. Owning the stock outright is the best strategy before Q2 reporting on Thursday. If the stock jumps, you get a nice profit from the shares and can purchase options from the profits after IV Crush. If stock trades down, you can write covered calls and get back some premium while still having great exposure to a healthy future 5G revenue generating company.\n\n\n\nSo do I get some flair now?", "id": "cfsztx", "created_utc": 1563668990.0, "score": 46, "upvote_ratio": 0.86, "num_comments": 51, "comments": [{"body": ">value investor\n\n>wsb\n\n\npick one", "score": 37, "replies": [{"body": "Worst yet, value trap.", "score": 10, "replies": [{"body": "I remember retard who long gme and mu", "score": 2, "replies": [{"body": "How was gme a value trap?", "score": 1, "replies": [{"body": "Declining cash flow. Retards though they wouldn’t cut div and guess what. Also look at that 2 year graph", "score": 1, "replies": []}]}]}]}]}, {"body": "I like this. I’m in.", "score": 7, "replies": [{"body": "Oh good, more fellow NOK bagholders", "score": 3, "replies": [{"body": "Don’t hate join", "score": 1, "replies": [{"body": "Oh I am. Been holding for a long time now", "score": 3, "replies": []}]}]}]}, {"body": "Sounds like you're selling us and not telling us.", "score": 13, "replies": [{"body": "Honestly you are right. When I re-read it, it comes across as \"pitchy\". I'm not sure what I would change but perhaps add in some negatives. I am long the stock and do have faith in ownership though.", "score": 8, "replies": [{"body": "I had an engineering professor in college who owned four small chemical companies and had a net-worth in the tens of millions. \n\n&#x200B;\n\nOne of the best pieces of advice he gave me personally was to never \"sell\" your recommendations to executives. Rather, make a giant list of your assumptions and then list out what could go wrong if *you're wrong* in your conclusion.  This has the minor benefit of making you seem more trustworthy, and the major benefit of improving your own thought-process.\n\n&#x200B;\n\nGood ideas aren't ripe fruit that you need to wait before plucking. They come from the sweat-shop activities of critiquing, ripping, throwing out, and starting over.", "score": 20, "replies": [{"body": "Great advice! And on wsb to boot!", "score": 6, "replies": []}]}]}]}, {"body": "Post screenshot of positions please. I like the DD and not saying you're wrong, but my new thing is to not listen to any comments or posts from people who haven't posted any positions.", "score": 15, "replies": []}, {"body": "Gimme some numbers man. Everything you said sounds good but I need numbers,", "score": 5, "replies": [{"body": "https://youtu.be/a6iW-8xPw3k\n\nEdit: Since someone else asked as well. Price/Book is 1.65. Usually anything under 3.0 is considered a good value investment. Which is currently rare in this ATH environment.", "score": 7, "replies": []}]}, {"body": "The thing about Nokia is that even after the crash they've always remained a quality company. It might not be the most media sexy company but their networking solutions abroad were always great. Many people only know of Nokia Mobile Phones and assumed everything else went to shit after that crashed", "score": 3, "replies": []}, {"body": "Don't they hold a strong patent portfolio as well?", "score": 3, "replies": [{"body": "Since 2017, NOK has been gradually selling their patents to generate cash. I believe they sold 50% of their patents by 2018.", "score": 10, "replies": []}]}, {"body": "How has NOK done in the past with earnings calls?", "score": 3, "replies": []}, {"body": "I'm long on NOK with shares.  Eric too on this er dip.  Eric is positioned better to make a little premium on but not NOK.  NOK is good shares or buying 5 strike leaps if that's your thing", "score": 3, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "Eric is a Swede with a big dick that knows a lot about 5g.  He recently got hurt a little and is hard up so you can get a piece of that ass for cheap.", "score": 15, "replies": [{"body": "lol. Gotcha! :) \nlooked up this \"eric\" thing and learned it's a term of art amongst you young millennials. lol. thanks for explaining! may the tendies be with you.", "score": 3, "replies": [{"body": "Millennials are weirdos aha", "score": 1, "replies": []}]}]}]}]}, {"body": "Weaponized retard here with a simple question.\n\nIs $NOK itself a dividend paying stock? Do I simply own their shares to get dividend deposits back into my RH account? Sorry for the especially high dosage of autism, but I've only been messing around with options for a couple months and haven't ever purchased dividends (that I'm aware of).", "score": 2, "replies": [{"body": "Yes owning the stock by the ex-dividend date will get you the dividend.", "score": 4, "replies": [{"body": "Thanks!", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "P/B is 1.65, which is a good indicator of a value investment.", "score": 4, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "tangible", "score": 8, "replies": []}]}]}]}, {"body": "You concerned with their negative cashflow at all?", "score": 2, "replies": [{"body": "The only reason their cashflow is negative is because they are piling money into R&D. If they slashed their R&D in half, they can consistently make $2-3B/year pre-tax. So let's say, $1.5-2.2B/year after taxes, and their market cap is 28B. It's about fairly valued/slightly overvalued.\n\nNow if their 5G business shoots off, that 2-3B/year might turn into 5-6B/year, which changes the whole equation, not only will their profitability double, but growth will lead to multiple expansion, so the stock can easily 4-5X.\n\nI'm a buyer at $3.00-$3.25/share. Too expensive for me now.", "score": 2, "replies": [{"body": "When did you buy at $3 a share, 2013? Holding that long?\n\nWhat’s the time table that Nokia comes out with 5g and actually chance they succeed?\n\nI thought they were making money selling off patents, so once they run out, how else are they making money and able to profit $2-3B /year?\n\nStrongly considering this puppy but can’t be waiting over a year from something so unsure.", "score": 2, "replies": []}, {"body": "Ok this makes more sense as they are managing debt and everything else fine. Seems like they are doing the work now to get the business prepared for massive entry and excelleration into 5g. \n\nLove that bag holding tomorrow. \n\nAlso it being slightly overvalued rn I believe isn’t that important with the potential upside we shall see \n\nI’m slightly retarted have no idea how to spell exceleration", "score": 1, "replies": []}]}]}, {"body": "It sounds like this company is a better bet for the second half of 2019 or in beginning of 2020.", "score": 2, "replies": []}, {"body": "And at the same time Nokia is constantly struggling with filling orders. Stay away", "score": 2, "replies": []}, {"body": "Where is the victory thread?", "score": 2, "replies": [{"body": "With my TSLA calls :(", "score": 2, "replies": []}]}, {"body": "So let's say you buy the shares and it trades down and you write covered calls and it skyrockets, then what do you do? Do you take the L or is there a way to reverse your play?", "score": 1, "replies": [{"body": "Well you'd make money on your covered calls each monthly exp cycle. If you get back to even, then just play it as before.", "score": 3, "replies": [{"body": "Wow nvm I was thinking the play you were talking about was completely opposite so my bad. And yeah I'm also long NOK as i think the 5g could generate some hefty profits for them.", "score": 1, "replies": []}]}, {"body": "Roll the calls", "score": 3, "replies": []}]}, {"body": "They been losin money thou.", "score": -6, "replies": [{"body": "See bynd", "score": 2, "replies": [{"body": "Bynd don't pay a 5% dividend.  Who I kidding thou? I'll buy it at open.", "score": 3, "replies": []}]}]}, {"body": "Man if I had a small portfolio I might of gambled \n\nBut now with being close to a million I stick to what always works trading big boys and vanguard etfs \n\nWhat I mean by big boys \n\nDIS$\n\nEd$ \n\nMSFT$ \n\nVoo$ \n\n$bac\n\n$jpm", "score": -19, "replies": [{"body": "are you flexing? lmao", "score": 16, "replies": []}, {"body": "Proof?", "score": 11, "replies": [{"body": "Or ban.", "score": 6, "replies": []}, {"body": "It's \"show me your pp\"", "score": 7, "replies": []}]}]}, {"body": "They positively bankrupted my aunt during the tech crash. I’d say short Nokia but I don’t even want to touch this fucking stock again.\n\n I bought when Huawei ban went into news cycle and it looked like Nokia would get 5G routers going, but then they had a security breach and it never really recovered from that so far. Fuck Nokia", "score": -4, "replies": []}, {"body": "...", "score": -11, "replies": []}]}
{"title": "Is NETFLIX going to keep tanking?", "selftext": " [https://www.cnbc.com/2019/07/17/netflixs-big-problem-worse-than-expected-international-growth.html](https://www.cnbc.com/2019/07/17/netflixs-big-problem-worse-than-expected-international-growth.html) \n\nVirtually all the stories about Netlix are negative. I just got in on the shorting late aft. Friday and made almost  4$K in a couple of hours. What other companies are overvalued on a similar set of projections? Is Netflix a canary stock for other FAANG-type stonks?", "id": "cg36vs", "created_utc": 1563738492.0, "score": 12, "upvote_ratio": 0.78, "num_comments": 53, "comments": [{"body": "The market can stay volatile longer than you can stay solvent.\n\nNetflix RSI is under 30, so it could continue to go down but short term should recover.\n\nLong term Netflix has some big problems, they can overcome them but need to plan their content out better. They hemorrhage cash and trade at an INSANE p/e. \n\nDon’t think Netflix is going anywhere but they should see a size-able correction over the next few years", "score": 16, "replies": [{"body": "Plenty of room for Netflix to grow in India. Hope it gets a bit cheaper first.", "score": 1, "replies": []}]}, {"body": "From a logical and valuation standpoint, it seems Netflix made it to where they are because they were/are the go to place to watch a show/movie. Now companies with the rights to those movies/shows are thinking “why don’t we start our own streaming service and exclusively stream our tv shows/movies through the service”. To me it feels it only going to happen more frequently if it’s feasible and profitable for them to do. In the end, Netflix is losing titles that subscribers once had access to, and ultimately diminishing the service quite a bit when they start being more limited in what they can stream. \n\nI’m not really sure how Netflix can weather this storm, because Netflix was built off streaming other networks series, movies, franchises etc. and if they lose a lot of that, then they don’t have as much to offer. Also people will have to make a decision between being subscribed to which service, if they don’t want to be paying two subscriptions. Ultimately, Netflix is losing value in my eyes because of these conditions, and I don’t see how the stock could currently push higher. I haven’t done in depth research but from the surface this is what I take from it all.", "score": 9, "replies": []}, {"body": "Comic Con: Marvel reveals Blade, Shang Chi and female Thor https://www.bbc.co.uk/news/entertainment-arts-49060944\n\nAnd Disney will own the content war..", "score": 11, "replies": [{"body": "Except all of those sound super duper dumb.     \n    \nThe only way Female Thor goes over well is if they give her a fat belly, too. Then, they need a fat love sex scene with both Thors -- fully including hammers and lightning. ...else it's just another chick empowerment bandwagoning turd, guaranteed.", "score": 5, "replies": [{"body": "BBW gods sex scene", "score": 3, "replies": []}]}, {"body": "Hulu ftw!", "score": 1, "replies": []}]}, {"body": "One of my rules of investing is ‘never invest in a company who places politics above profit’\n\nThis means Netflix is a big no for me. You can make political statements or you can make money, doing both is difficult.", "score": 21, "replies": [{"body": "I think they underestimated how big of a blow this would be for them... very true!", "score": 10, "replies": [{"body": "Exactly what political statements is Netflix making that would be a blow?", "score": 5, "replies": [{"body": "they literally have a show that calls Donald Trump a Con man. I might it hard for any Trump supporter to subscribe to Netflix.", "score": 2, "replies": [{"body": "I always think Trump supporters would be the type to still use cable. Not even joking here.", "score": 1, "replies": [{"body": "The_donald has 7 million subscribers, some of them gotta be Netflix users. I canceled mine after they hired Obama and put Susan rice on the board.", "score": 1, "replies": [{"body": "Is that sub still blocked? I heard it happened some time ago.", "score": 1, "replies": [{"body": "It got quarantined on the day of the democratic debates for damage control on the memes that would be made about Dems candidates. On the day it got quarantined it gained like 50k users from the publicity.", "score": 1, "replies": [{"body": "That's just crappy from reddit mgmt", "score": 1, "replies": [{"body": "Yeah, lots of admins want the sub banned, Spez (reddit ceo) doesn’t want to, but we’ll see how much longer he can resist them", "score": 1, "replies": [{"body": "I can understand why. Not very palatable for advertisers.", "score": 1, "replies": [{"body": "I’ve never seen an ad on reddit", "score": 1, "replies": [{"body": "You not serious, are ya? Using some extension?", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Every company in America is doing a hard pro-liberal political play. None would really lose money.", "score": 2, "replies": []}]}, {"body": "honestly netflix  is going to be next nvidia.    growth is going to slow down  and they are overvalued. .  their tv contents are horrible and they are keep losing money.     \n\n&#x200B;\n\nlong put is way to go.", "score": 14, "replies": [{"body": ">their tv contents are horrible \n\nIdk how anyone can say this when Netflix is spending $13B a year on content and had more Emmy nominations last year than HBO.", "score": 10, "replies": [{"body": "People that don't watch Stranger Things and live in a bunker say such things :)", "score": 3, "replies": [{"body": "I’m sorry they don’t have enough Bigfoot hunter reruns for you. I’m sure you can find something among the other 3,000 shows they offer.", "score": -1, "replies": [{"body": "Did you reply in the wrong thread or your brain malfunctioned?", "score": 1, "replies": [{"body": "Normal day at the office for the spastics on this sub.", "score": 3, "replies": []}]}]}]}, {"body": "Most of their movies are with half ass ending. I cancelled mine last week.", "score": -2, "replies": []}]}, {"body": "Synthetic short is better for capturing value from a steady march down (at 4x leverage), or an OTM leap put spread would probably be a better binary style Yolo than a naked leap put since you don't bleed theta. The theta bleed would pay off in case the drop was frontloaded and the IV spike amplified the far out leap value, but assumptions like this are more likely to pay off later rather than sooner once optimism is bled off so might as well set up a trade for maximal payout further out.", "score": 1, "replies": []}]}, {"body": "I don’t think NFLX is going to disappear anytime soon, the next generation will grow up only watching Netflix and doesn’t care about the office", "score": 15, "replies": [{"body": "Well there will be a lot of competition...", "score": 3, "replies": []}, {"body": "The Office blows.", "score": 2, "replies": [{"body": "What was your purpose in saying that.", "score": 4, "replies": [{"body": "He's not wrong", "score": 2, "replies": [{"body": "Yep, just stating facts.", "score": -1, "replies": []}]}]}, {"body": "Why are you the way that you are?", "score": 2, "replies": []}]}]}, {"body": "200 by the end of the year", "score": 4, "replies": [{"body": "I'm thinking like $230 since we are almost in Aug.", "score": 3, "replies": [{"body": "Support around $250", "score": 2, "replies": []}]}]}, {"body": "Piling up debt while losing subscribers and losing market share to some pretty large competitors. Currently see NFLX as tremendously overvalued.", "score": 7, "replies": [{"body": "Short it then", "score": 5, "replies": []}, {"body": "\\#PostYurPoots", "score": 1, "replies": []}]}, {"body": "Add that all the dis + hype Netflix under 300 is coming very very soon", "score": 4, "replies": []}, {"body": "Like many tech stocks right now, Netflix is extremely overvalued. I wouldn’t be surprised if this trades all the way down to $200 in the next few years. \n\nHell, even the best companies/stocks trade sideways or enter a bear market for several years. See: Disney, Starbucks, coca-cola, etc. \n\nThis stock market is due to trade sideways for awhile. Down 20% at the end of last year and up 20% this year certainly makes it feel like a bubble.", "score": 3, "replies": [{"body": "Markets aren't \"due\" for anything, anymore than you're \"due\" for a good hand at the blackjack table. \n\nIn any case, markets have been sideways for the last 18 months. There's your \"due.\"", "score": 15, "replies": [{"body": "Tbf being due for a good hand in black jack is the whole point of counting cards", "score": 6, "replies": [{"body": "\"It's just frowned upon...like masturbating on an airplane.\"", "score": 5, "replies": []}]}, {"body": "Hahahaha this aged well", "score": 1, "replies": [{"body": "Markets are still sideways over the last 18 months", "score": 1, "replies": []}]}]}]}, {"body": "Netflix literally tanked last summer at the exact same time, in the exact same way", "score": 2, "replies": [{"body": "..... For entirely different reasons. If you think NFLX will recover, please buy my calls lol", "score": 5, "replies": [{"body": "If you think it won't, post your short.", "score": 1, "replies": []}]}]}, {"body": "Could go up or down", "score": 2, "replies": []}]}
