{"title": "CVS stock falls after Blue Shield of California drops pharmacy as benefit manager", "selftext": "Shares of CVS Health (CVS) are falling after the Blue Shield of California dropped the pharmacy as its benefit manager for drug prices and other services. The Blue Shield of California is reportedly pursuing partnerships with Amazon Pharmacy (AMZN) and billionaire Mark Cuban's Cost Plus Drugs. Yahoo Finance's Julie Hyman and Brad Smith monitor CVS' stock action and comment on the environment for health service providers.\n\nhttps://finance.yahoo.com/video/cvs-stock-falls-blue-shield-140855161.html", "id": "15tpiob", "created_utc": 1692283251.0, "score": 427, "upvote_ratio": 0.98, "num_comments": 76, "comments": [{"body": "Not CVS but I finally caved and sold Walgreens.  Just feels like these are in no man’s land for the foreseeable future, dividend is nice but never ending downtrend is painful.", "score": 123, "replies": [{"body": "CVS is becoming a healthcare giant (bought Aetna, Signify, and Oak Street Health) attempting to compete with the likes of UNH, while WBA is more or less still just a retail pharmacy chain. Sort of apples to oranges at this point. It's going to take a while for CVS' acquisitions to pay off in terms of their long term, value-based care strategy.", "score": 62, "replies": [{"body": "I completely forgot they bought Aetna", "score": 22, "replies": [{"body": "I think CVS is undervalued in part because many people still think of it as \"just a pharmacy\" when they are so much more: health insurer (Aetna), pharmacy benefits manager (Caremark), primary care (Oak Street), in-home care (Signify)... and pharmacy/convenience store.\n\nThey're still in the early stages of executing their value-based care business model but I think they are on the right track. I forget the exact statistic but something like 75% of the U.S. population is within 3 or 5 miles from a CVS, so there's a lot of potential for them to build out additional services they offer at existing stores, in addition to growing OSH (I think they're doubling the number of OSH sites over the next few years).\n\n In the meantime, they're a cash flow machine and also shareholder friendly (buybacks + growing dividends). They're also projected to grow earnings by 20~25% in the next 3 years.", "score": 52, "replies": [{"body": "[deleted]", "score": 23, "replies": [{"body": "I will be messaging you in 3 years on [**2026-08-17 20:33:55 UTC**](http://www.wolframalpha.com/input/?i=2026-08-17%2020:33:55%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/15tpiob/cvs_stock_falls_after_blue_shield_of_california/jwmlxcx/?context=3)\n\n[**10 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F15tpiob%2Fcvs_stock_falls_after_blue_shield_of_california%2Fjwmlxcx%2F%5D%0A%0ARemindMe%21%202026-08-17%2020%3A33%3A55%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%2015tpiob)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}, {"body": "> CVS \n\nRemindMe! 3 years", "score": 0, "replies": []}]}, {"body": "They've also run into a lot of problems with intentional staff shortages and patient facing problems to the point that in Ohio the chain is being investigated and the state bop is already proposing rule changes because of them.  I don't see them changing management style so good for you getting your money now.", "score": 7, "replies": [{"body": "I'm not specifically aware of the issue you mentioned but I'd be interested in learning more. \n\nFwiw their corporate strategy hasn't changed -- they've been on the VBC journey since the 2018/19 Aetna acquisition. They just bought Signify and OSH last year I believe, so there's potential for cost synergies on cost down the road. They're committed to expanding OSH by 100% I believe (from 150ish to 300ish stores, I think) in the next 3ish years.\n\nIt takes significant time, money, and serious effort to make a tectonic shift like what CVS is doing -- going from a pharmacy chain like WBA to a massive, coordinated health care provider like UNH, plus a huge existing store/pharmacy/minute clinic footprint in the U.S.\n\nOverall they've been steadily executing on their strategic goals imo. Most importantly, it gives CVS numerous runways to keep growing across multiple business segments for a long, long time (which is typically a good thing  for stocks).\n\nAt this point, I think *most* of the downside risk is priced into CVS and that today was an overreaction. The biggest risk is that PBM materially craters (if more insurers drop Caremark), but given the healthcare system's historic resistance to change, I don't see that becoming a systemic risk. Then again, their new competitor is AMZN... a company that isn't afraid to throw billions of dollars toward a project. Probably worth looking into AMZN's healthcare strategy in more detail.", "score": 4, "replies": []}]}]}]}]}, {"body": "I sold Walgreens when it popped above 30 a few weeks back after holding for a while.  The stock price is going down a lot faster than the dividend is replacing it.\n\nPlus, you can get 6% risk free right now, so you almost have to ignore a dividend as part of the calculation if you don't see significant upside in the share price.", "score": 13, "replies": []}]}, {"body": "I feel like CVS gets rocked by something like this every year or so and then returns to its value.\n\nIt's usually speculation from competition though, this seems to be actual competition that's going to punch their bottom line finally. They're in for some shit.", "score": 84, "replies": [{"body": "I mean, Walgreens is *stiil* getting rocked after half a decade.", "score": 19, "replies": [{"body": ">Walgreens is stiil getting rocked after half a decade\n\nAnyone who has been to a Walgreens for a shopping experience or to fill a prescription knows why, too.  Their stores are extremely overpriced, following the same strategy as a convenient store.  For prescriptions, they wildly adjust your price per script based on your address.  Last time I went to fill an antibiotic, they wouldn't quote me a price until I provided them an address.  The first address I gave them, they quoted $240.  After giving them a second address, the price dropped to $30.  I asked the pharmacist why they needed an address to quote a price, and he said their point of sales software required it.\n\nI realize many businesses price quote differently by a few percentage points based on zip code and demographics, but this was wild.  Double kick in the nuts because I was gravely sick with a bad lung infection and they wanted to extort $200 extra dollars from me if they thought they could get away with it.\n\nI have not used them since then.", "score": 7, "replies": [{"body": "Biggest problem i have is shit priced on website isnt the same instore.  If I place order and select pickup in store I get web price and pick in 15mins.  If i go to store and dont want do deal will placing and order online I get a different price.  It frustrating as hell having the cashier price match and that's not always done", "score": 3, "replies": []}]}]}, {"body": "Ehhh, it’s not really the competition. I think it’s more that this is the second major client CVS Caremark has lost this year which (a) will be a serious hit to revenue for the next few years and (b) reflects poorly on Caremark.", "score": -4, "replies": [{"body": "Blue shield of California isn’t even a major client. Centene was the only major client they are set to lose.\n\nOn top of that, Blue shield will keep some business with CVS for specialty drugs. This is a major overreaction.", "score": 12, "replies": [{"body": "It's definitely an overreaction (it was down almost 11% at one point) but that's the market for you. Not today but what may come for the company tomorrow. For the past few years if Jeff Bezo's limo even drives past a pharmacy the stock takes a 1-2% hit. \n\nNonetheless, it could be the start of something, and that's more important to the market (I seems, but dafuq do I know)", "score": 8, "replies": []}]}]}]}, {"body": "I bought the dip. Double-digit billion dollar FCF each year is good enough for me to buy at this level.", "score": 25, "replies": [{"body": "Yeah I’m buying the dip.", "score": 8, "replies": []}]}, {"body": "CVS/WBA definitely need to adjust their business model. AMZN is going to eat their lunch when it comes to convenience and accessibility. The only time people go into CVS/WBA is because of their prescriptions they need to pick up or flu shots, if they lose that, they have nothing. 67% of their revenue comes from the pharmacy, not a good sign if benefit plans start pulling away from them.\n\nHave positions in both WBA and AMZN", "score": 54, "replies": [{"body": "And liquor.  It’s also a free liquor store for the homeless.", "score": 18, "replies": []}, {"body": "No, it is not.  You have no idea what the you even talking about.\n\nFor a starter, CVS revenue is probably split half Pharmacy, and half retail and healthcare. Amazon is not changing the way people fill their prescription. Rx online wasn’t invented by amazon, and it all revolves around USPS network for rural populations that amazon don’t necessarily reach.\n\nThis comment reminds me of the morons who were claiming Uber is going to destroy the car industry because no one is going to drive, or Amazon is shutting down mall because everyone shopping online. \n\nI would give you an award just for shear ignorance on the health care system", "score": 7, "replies": [{"body": "2022 Revenue CVS\r  \nHealthcare Benefits: 91 Billion\r  \nPharmacy Services: 169 Billion (2.3 billion pharmacy claims)\r  \nRetail (Including prescription drugs): 106 Billion\r  \n\r  \nAmazon Pharmacy offers RxPass, 24/7 support, delivery, no insurance needed, and discounts on already no mark-up prescriptions. \n\nPlease explain to me how what Amazon is offering doesn't directly effect the business model of CVS. If healthcare providers start dropping CVS for Amazon (like in the article), they're losing another big portion of their revenue.", "score": 25, "replies": [{"body": "Pharmacy and Consumer Wellness are less than a fourth of CVS Health’s op income, so it’s less dire than the picture you’re painting. \n\nAmazon Pharmacy is still not a PBM and does not deal in specialty drugs, which will continue to be the biggest revenue and growth driver in pharmacy services moving forward. You’ll notice Blue Shield of California is still using CVS Caremark for specialty drugs.", "score": 20, "replies": []}, {"body": "Most people want and need their medical needs instantly hence the importance of CVS. The retail section makes it act like a grocery store and I suppose all grocery stores are at risk from Amazon.", "score": 10, "replies": []}, {"body": "amazon only fills prescriptions lol, they dont offer any actual healtchcare services other than the ultra basic skin care / blood pressure / whatever.  that wont affect any of the businesses CVS has acquired to be in the healthcare business.", "score": 8, "replies": []}, {"body": "And from personal experience, Amazon was ~ 10% lower than CVS/Caremark for my scripts.", "score": 5, "replies": []}]}, {"body": "Yea, shopping malls that shuttered were usually overbuilt, surrounded by hard-to-access parking lots and not conveniently located. There are plenty of malls in closer to urban areas or metro access that are doing very well. The weakest ones were to fall. CVS and WBA do just fine in most areas, and their earnings are very consistent. When this tech bubble bursts people will flock back to consumer-staple based stocks as safety. People still need toothbrushes and toilet paper.", "score": 15, "replies": [{"body": "There is a world outside big metro areas in big cities. Human psychology doesn’t change in a a year or even 10... People like to go to stores, and for many cities, that is your actual get out of home reason. Malls were condensed in close proximity in large cities and then surrounded by smaller shopping centers, which didn’t make any sense. Its the same way they keep building parking lots and office spaces today. Its not amazon, its the morons who assume demand is linear. More mean more money so lets build more.\n\nIf you live in a rural area, you are going to go to your doctor, then stop by an actual pharmacy with the same pharmacist you have been seeing for a decade to pick your medication, and that ain’t changing. People don’t switch their life routine overnight, and not for Amazon. Most people who actually order online are the ones without really much internet access who live remote areas, and these are USPS deliveries. \n\nI don’t own CVS or WBD, and have no interest in them, but they are going to be fine today, tomorrow, and 5 years from now. Amazon ain’t conquering the damn world", "score": 3, "replies": []}]}, {"body": "I agree with almost everything, but malls have been dying for a while my guy, specifically because of online shopping. You think the current generation being raised by screens isnt going to online shop?", "score": 3, "replies": []}, {"body": "Retail drug stores are dying and a lot of it is self imposed. Who wants to go to Pharmacy school for 7-8 years just to work retail at Walgreens or CVS? As soon as people can they leave those jobs and move to hospitals or drug sales. That’s just the personnel side of things. From a customer perspective, CVS and Walgreens don’t even fill most drugs on site anymore. You end up going to the store just to have them tell you to come back in a few days. When I’m sick I want my prescriptions right away. And their pharmacy hours are 10am - 6pm during the week and 10-2 on Saturday. What’s the point of using these guys anymore? I have anything I can filled by Amazon Pharmacy. It always shows up on my doorstep the next day with minimal hassle. For rural America, I’d wager more people use Walmart than CVS or Walgreens. \n\nCVS seems to be recognizing the trend better than Walgreens and is moving into healthcare partnerships and insurance a lot more. Probably a smart move on their part.", "score": 9, "replies": [{"body": "Walgreens is moving into healthcare delivery just as much as, if not more than, CVS Health.\n\nWalgreens doesn’t face Aetna, though.", "score": 3, "replies": []}]}, {"body": "Found the CVS bagholder", "score": 1, "replies": []}, {"body": "Amazon did shut down the malls though…", "score": 1, "replies": []}]}, {"body": "Yeah, just like how AMZN is killing it in entertainment (oh wait), consumer tech (oh wait), consumer goods (oh wait). They have a proven record of failing as much as they have one for succeeding in the spaces they enter. And they have begun to get very sloppy about their moat.", "score": 1, "replies": []}, {"body": "Amazon getting into the pharma biz is bullish for AMZN and bearish for PPL", "score": 1, "replies": []}]}, {"body": "Stock Market: The only store people run away from when things go on sale.", "score": 9, "replies": [{"body": "From a cvs owner: the bread in this case is marked down because there’s suddenly some mold on it", "score": 3, "replies": []}, {"body": "If a bunch of people were throwing loaves of bread back into the grocery store because they were expired and disgusting, I would probably run away too", "score": 0, "replies": [{"body": "Id say it's more like people tossing out that xmas fruitcake from 5 years ago. Just sit it back on the shelf, come around Oct/Nov it's gonna be worth BILLIONS!", "score": 1, "replies": []}]}]}, {"body": "Hmmm still not gonna buy.  Fun to look at though", "score": 3, "replies": []}, {"body": "Pharmacy Benefit Managers are just unnecessary middlemen taking a cut of drug prices.  I’m glad to see the large health insurers finally waking up to this fact.", "score": 3, "replies": [{"body": "Imagine if you owned a pharmacy and had to spend resources negotiating prices with drug manufacturers on the supply side and negotiating with insurance companies on the demand side. It would be extremely difficult. \n\nPBMs do this for you.\n\nThe PBMs only exist because of the healthcare system is based on private insurance. Without private insurance, the government would negotiate prices for all patients and PBMs wouldn’t need to exist", "score": 1, "replies": [{"body": "Imagine if you are a consumer and had to pay 30% more for Rx medication because of a legacy middle man squeezing profits while also acting as a pharmacy…", "score": 1, "replies": []}]}]}, {"body": "Was not unexpected. The layoffs took this into account. \n\n&#x200B;\n\nCVS's pharmacy model is the legacy model where, in the old days, people had great insurance and this insurance paid for every prescription with a maybe a small $2 co pay. those are CVS's target customers. CVS is not interested in competing on price or enticing cost conscious consumers. their key demo is seniors / Medicare / Medicaid. \n\n&#x200B;\n\nif they are smart, they will buy GoodRX....", "score": 7, "replies": []}, {"body": "Their only shot is too grow Aetna.", "score": 6, "replies": [{"body": "Honestly I think buying Aetna in the first place is part of their problem. My own health insurance company allows me to buy drugs from everyone except CVS because of CVS/Aetna being their competitor. And I'm sure that's probably part of why Blue Shield of California is ditching CVS.\n\nI'm also still stumped as to how the heck the government decided that it was ok for CVS to buy Aetna. It seems like a huge anti-trust issue to me given that Aetna has to effectively negotiate with themselves on the prices of prescription drugs their members buy at CVS.", "score": 8, "replies": [{"body": "People *really* misunderstand antitrust. \n\nJust because an acquisition creates a conflict of interest or vertical integration does not automatically trigger antitrust issues. The acquisition did not decrease competition ergo not antitrust.", "score": 5, "replies": []}]}]}, {"body": "When do you start to see the wonders of compounding interest take off ?  Around 100k would you say ?", "score": 2, "replies": []}, {"body": "Well I can tell you one thing about CVS, there specialty pharmacy suck!!  I have psoriasis and have to take skyrizi, dealing with morons every time I need the drug is a pain and hassle. I barely get my drug on time and spend hours on calls to straighten them out.  It’s not rocket science, just hope they all get replaced by AI. Seriously look up CVS specialty or go on psoriasis forum to read up.", "score": 2, "replies": []}, {"body": "Slightly off topic but Fuck CVS and Walgreens. Go literally anywhere else. Both routinely mark up prescriptions by hundreds of percents, charge the shit out of your insurance and fool you into thinking you're getting a deal. You're not. If you're taking a generic, your copay is probably higher than buying elsewhere.\n\nCostco is extremely cheap and you do not need a membership to go to them. Another option is Mark Cubans Cost plus Drugs. It's online and extremely cheap as well.\n\nCVS and Walgreens are parasitic middlemen doing everything they can to fuck over seniors and sick people. I hope they both crash and burn hard. Their business model is almost scam worthy.", "score": 0, "replies": []}, {"body": "CVS is dead money", "score": -6, "replies": []}, {"body": "Non-stock question: what does this mean if I have BlueShield CA and use CVS for my prescriptions?", "score": 0, "replies": []}, {"body": "I sold today after buying in on the dip a month or so ago. Sold with like a 3% loss. \n\nI may get back in, but we’re not gonna see a quick bump like I was expecting.", "score": -4, "replies": [{"body": "I see you are doing the good old buy high, sell low. If anything, I would’ve bought more here rather than waiting for it to recover and then buying again.", "score": 9, "replies": [{"body": "I mean I was bargain shopping in the first place. \n\nI wouldn’t buy above $70.", "score": 0, "replies": []}]}]}, {"body": "Lmao “Julie Hyman”, how unfortunate", "score": 1, "replies": [{"body": "It's no Dick Butkus", "score": 1, "replies": [{"body": "Rusty Kuntz is my champion lol", "score": 1, "replies": []}]}]}, {"body": "I work for WBA, and it's not doing great. Between their retail sales plummeting with their share price and constantly being sued. If the pharmacy leg gets kicked, it's going down hard.", "score": 1, "replies": []}, {"body": "I like CVS at 58/59 dollars.", "score": 1, "replies": []}, {"body": "News is it is $0.06 eps hit max in 2025.  Lol. Can you say over reaction.", "score": 1, "replies": []}, {"body": "P/B is 1.28 now, lowest since 2019, CEO purchased 1M on may, could not be that bad, just saying", "score": 1, "replies": [{"body": "Take out goodwill and P/B is significantly higher", "score": 2, "replies": [{"body": "Right, that's exactly what has me thinking before opening a position,  that and the lack of a real competitive advantage vs AMZN UNH and WMT, it seems like the management strategy and acquisitions would not be enough,  price action looks promising though", "score": 1, "replies": []}]}]}, {"body": "I worked for CVS for 5 years and it was the worst job I've ever had. The company is absolutely terrible to their employees. \n\nI've held on to all my stock options the entire time cause the dividend is good, but it has been sliding all year and after today I feel like a total moron. \n\nLuckily I'm still up a bit but Ffffffffffff....\n\nTime to keep holding.", "score": 1, "replies": []}, {"body": "If I was CVS, I would just leave Ca.", "score": 1, "replies": []}, {"body": "They plan to close all physical stores and be all on line", "score": 1, "replies": []}]}
