{"title": "$BUD Due Dilligence", "selftext": "\\>inb4 “didn’t the stock just drop 2.5% yesterday”  \nyes.  It did. And I’m fucking pissed about it because I started writing this  DD last night (and then all of yesterday night and today I couldn't post because of some mod deleting it without a reason). There’s still a lot of downside potential here\n\nTL;DR:  The stock is dogshit, earnings will miss by at least 3.8% in revenue.  Buy short-expiry puts for earnings and long-expiry puts to capitalize on  the collapse of the US market for InBev.\n\nStock Price Analysis\n\nAll stock charts are pulled from Robinhood (I think it looks better)\n\n&#x200B;\n\nhttps://preview.redd.it/zm8cavtockfb1.png?width=1414&format=png&auto=webp&s=00bda835cd48d52e3da7ee6b56b0c9d29f2ec07f\n\nThis  stock had been trading at about $66 before the Bud Light boycott, with a  12 month low of $46 which was caused by what appears to be negative  earnings sentiment. After the boycott, the share price dropped to around  $54 before recovering to $58 by mid-July. However, recovery appears to  have stalled out and drastic upwards movement is no longer seen (even  with a slight upwards trend).\n\n5 year chart for $BUD\n\n&#x200B;\n\nhttps://preview.redd.it/inkgpm6qckfb1.png?width=1422&format=png&auto=webp&s=92b1869fbbeef196926a7599eb8ed6dbd397923d\n\nPre-Coronavirus  the stock was trading at around $100 share with a low point of  $65/share on a bad earnings report (followed by a swift recovery). What  is quite interesting here is that the stock has never recovered to  pre-covid levels. I believe this is because InBev brands are quickly  collapsing and will not likely recover. Reasoning for this belief will  be discussed later, these charts and quick notes serve mostly as some  pricing background for later discussion.\n\nThe Boycott\n\nIt  is time to address the elephant in the room, which is of course the  boycott that has taken place due to outrage against the featuring of  Dylan Mulvaney in their promotional materials. Below is a chart showing  the sales data for Bud Light and other popular domestic InBev brands.\n\n&#x200B;\n\nhttps://preview.redd.it/fp0bzo5rckfb1.png?width=1055&format=png&auto=webp&s=9a87cfd03f2b2bc2cbc45e6e7fea96fd1ff0669f\n\nBud  Light has suffered losses of around 30% of sales for the charted  periods, and their more popular brands average around a 10% loss of  sales. These don’t appear to be letting up much, as even the most recent  sales data shows a 23% weekly loss in sales with variability intra-week  of around 5% in each direction. Permanent brand identity damage to Bud  Light and Budweiser is almost a certainty, and damage to the rest of  InBev’s offerings is also possible. It is getting very hard to dismiss  this boycott as a knee jerk conservative reaction when even 4 months in  as we have now experienced 16 total weeks of an average decline in Bud  Light sales of 26% that have tapered off to a consistant level. I  haven’t calculated complete averages for the entire 16 weeks, but the  most recent data shows around a 5% decrease on average for the other  InBev US brands (and the average would be higher given a recent dropoff  of losses). The Q2 Bud Light loss sits around 27% on average and the  other InBev brands sit at an average loss of around 8% for the Q2  period.\n\nBoycott Impact on Sales Figures\n\nThe  boycott will invariably impact the sales figures for the company. The  question is by how much, because I certainly do not believe the CEO’s  statement of a global loss of only 1% per week. To start off the losses  analysis, we will go over the US market share’s relation to the overall  company’s revenues. (Please note: These are pretty rough estimates, as  the company isn’t super transparent about specific numbers for  individual brands and such. I didn’t completely make them up, but they  are extrapolated from different metrics that may paint a slightly  inaccurate picture of what is going on. However, the point still remains  even with imperfect stats).\n\nFirst,  I will give some background numbers calculated from very reliable  sources (Inbev’s financial statement for 2022) to assist us in tacking  down the impact this will have. The total EBITDA for InBev was 54.3  billion, while the US EBITDA for InBev was 6.13 billion for a percentage  of global EBITDA of 31% (a suprisingly high number given that the US  division of InBev only has a share of global volume of 18%. On another  note, this is probably why the CEO reported that “global volume is only  decreased by 1% weekly” instead of reporting sales decreases). The  global revenue for InBev is 54.3 billion while the US revenue for InBev  is 16.2 billion for a percentage of global revenue of 29%. Finally, the  world EBITDA margin for InBev is 35.4% while the US EBITDA margin for  InBev is 37.7% (profits are going to be higher on American products,  they are made with cheap grain and/or corn syrup). Now, we can get into  the impact calculations for this boycott.\n\nNote:  These are all 2022 statistics. Also please note that these numbers for  individual products actually don’t account for on-premise sales because I  couldn’t find numbers that did, however I did manually adjust it using  the standardized/average alcohol split of 80% off-premise vs. 20%  on-premise.\n\nBud Light itself  brings in around 5.76 billion dollars worth of sales/year (unadjusted #  is 4.7 billion); these numbers account for 35.1% of its US revenue and  10% of global revenue. Michelob Ultra (next largest, surprisingly)  brings in 4.1 billion dollars worth of sales/year (unadjusted 3.5  billion); these numbers account for 25.3% of US revenue and 7.8% of  global revenue. The rest of the listed InBev brands in the source total  4.8 billion dollars worth of sales/year (unadjusted # is 4 billion);  these numbers account for 29.6% of US revenue and 8.9% of global  revenue.\n\nNow, let’s apply the  losses that these brands have experienced so far. We have 16 weeks of  Bud Light losses at an average of 27%. For Q2, the approximate Bud Light  loss is 2.7% of global revenue. For Michelob Ultra, we have 16 weeks of  losses at an average of around 5% loss of revenue. For Q2, the Michelob  Ultra loss is 0.39% of global revenue. For the rest of the listed InBev  brands, the average loss is around 8%. For the misc. InBev brands, Q2  losses are 0.71% of global revenue. In total, a loss of 3.8% of global  revenue for Q2 is expected. Now, for whatever reason the analysts  believe that the stock will actually see a year over year revenue growth  of 3.9%. This makes just about zero sense, because not only are we  seeing a 3.8% *loss* in revenue  (at minimum, these are very conservative estimates); we are also  probably going to see a pullback from the high sales figures in Q2 2022  just because of the fact that COVID-19 lock-downs ending drove them up.\n\nOther Factors\n\nThere  are some other factors that are very likely to drive down the share  price even further in the coming months/years. The first one is the  probable permanent devaluation of Bud Light and Budweiser, some of their  biggest brands. All estimates are pointing to a decrease in sales  around 10-20% permanently for those products. Another one is the fact  that they were forced by US antitrust authorities to sell their US  rights to the entire Corona family of products to another company all  together in perpetuity. Due to the fact that we are seeing a serious  shift away from US domestics and towards Mexican import beer, being  forced to sell the growing portion of their US operation is a death  sentence for their US market in the coming years. They appear to be  burning the candle at both ends here, they are doing “inclusive” ad  campaigns that are alienating older consumers, but also alienating their  younger consumers because the beer tastes like piss water.  Additionally, we are very unlikely to see a return to pre-covid share  prices due to how low the dividend has gotten compared to the period  between 2014-2018. They went from a dividend of $2.24/share to a  dividend of $0.82/share and it is only continuing to decrease. Another  driving factor for a slowdown in InBev’s market is that the US beer  consumption is down overall, and InBev has no exposure to the rapidly  growing alcohol seltzer markets. It just simply appears that there is no  place for InBev for the future of the consumer alcohol market.\n\nThe Play\n\nNow  is the time where you ask me “Well, I believe you. What do I YOLO my  entire account into?”. I believe that the optimal way to play this stock  is to have a combination of short and long term options. Personally, I  like the $55 Strike expiring on 8/4; it will cost you $105 as I am  finishing this DD and the price on the earnings miss is very likely go  below this, possibly returning to the $53 share price during the boycott  starting downturn. Earnings will likely confirm heavy damage to their  US market, which will confirm the negative sentiment and send it soaring  down. This is not priced in to earnings expectations whatsoever,  analists are determined to pretend that everything is fine for some  reason. For the long call, which I would recommend purchasing over the  short call if you are only picking up one, I like the Jan 19th, 2024  expiry at the $50 strike; it will cost you $145/contract and I believe  it will absolutely print come end of year + Q4 earnings report. When  permanent damage to the brand is confirmed through repeated earnings  misses, the stock will nosedive.\n\nSources:  \n[2022 Earnings Report](https://www.ab-inbev.com/assets/pressreleases/2023/FY%20Financial%20Report%202022.pdf)  \n[Q2 2022 Earnings Report](https://www.ab-inbev.com/assets/pressreleases/2022/07/AB%20InBev_HY22%20Press%20Release_FINAL.pdf)\n\n[Q1 2023 Earnings Report](https://cdn.builder.io/o/assets%2F2e5c7fb020194c1a8ee80f743d0b923e%2Fc58c3f3068c545458ea4aae858e04c60?alt=media&token=3bd352c5-dee0-4058-9a3f-797b5a9d3801&apiKey=2e5c7fb020194c1a8ee80f743d0b923e)  \n[Individual Beer Sales Reports](https://www.washingtonpost.com/business/2023/04/28/mexican-beer-rules-america/)  \n[Quick List of InBev Holdings](https://en.wikipedia.org/wiki/AB_InBev_brands)  \n[Sale of Corona Brands to Constellation](https://www.cbrands.com/blogs/news/anheuser-busch-inbev-and-constellation-brands-announce-revised-agreement-for-complete-divestiture-of-u-s-business-of-grupo-modelo)  \n[US Market Report (From InBev US)](https://www.ab-inbev.com/content/dam/universaltemplate/ab-inbev/investors/presentations-pdf-archive/01_Luiz_final-r.pdf)  \n[Stats for 2 weeks before July 4th](https://nypost.com/2023/07/10/bud-light-sales-plunge-28-5-ahead-of-july-4-sister-brands-also-hit/)  \n[Stats for July 4th week](https://nypost.com/2023/07/17/bud-light-sales-tank-by-23-6-over-july-4-holiday/)  \n[Source of sales decline chart](https://finance.yahoo.com/news/bud-lights-troubles-may-extend-into-fall-oktoberfest-season-160336461.html)  \n[Source for CEO comments](https://www.newsweek.com/anheuser-busch-inbev-ceo-tells-investors-about-declining-bud-light-sales-1798442)\n\nMy  apologies for having to use a lot of news articles, I am too broke to  afford the $100/month fees some of those research firms charge for  reports.", "id": "15forkm", "created_utc": 1690923859.0, "score": 49, "upvote_ratio": 0.82, "num_comments": 83, "comments": [{"body": "TL;DR but good stuff", "score": 39, "replies": [{"body": "Thanks, I appreciate it.", "score": 6, "replies": []}]}, {"body": "Good take - I've also been doing my own DD though so let's try and find a consensus here --  \nI believe you're substituting EBITDA for Revenue.\n\nFY22 Rev - 57.8B (11% YoY growth from FY21)  \n1Q23 Rev - 14.21B (13% YoY growth)\n\nNA rev = 16,257/54,304 = 29.9% of revenues  \nNA EBITDA = 6131/19209 = 31.9% of EBITDA\n\nThe loss of sales figures I agree with - they're probably looking at anywhere from a 750-900M decrease in top line from their regarded marketing campaign.  The big question is going to be how much growth can be driven in their other markets and will the other markets continue to see strong growth to outpace the revenue (and earnings) loss in NA.\n\nSo if we're expecting 800M loss from NA.    \nNA 2Q22 Rev = 4.3B  \nOther Regions 2Q22 = 9.24B  \nTotal 2Q22 Rev = 13.54B\n\nNA 2Q23 Rev = 4.3 - 0.8 = 3.5B  \nOther Regions 2Q23 = XXX B. (10.35B)  \nTotal 2Q23 Rev (analyst consensus) = 15.43B (\\~\\~13.85B) (\\~\\~1.58B miss on topline)\n\nOther Regions = 15.43-3.5 = 11.93B ....  (11.93-9.24)/9.24 = 29% growth in other markets to hit consensus which is not going to happen.  More likely they'll see 12% YoY growth = 9.24\\*1.12 = 10.35B.\n\nI'm looking at BUD JAN 19 2024 55.00 PUT ", "score": 18, "replies": [{"body": "All you guys doing all this work and research. On Friday I said BUD reports earnings Thurs, it’ll suck ass, and bought the 55 puts for this Friday since that seemed reasonable, sold half today before lunch to take my money off the table. So a question: does my lack of due diligence make me or you the bigger gambler. Good writeups and good luck to you both!", "score": 9, "replies": []}, {"body": "Yeah, I believe I may have accidentally substituted in the 32% EBITDA ratio instead of the 30% revenue one. One point I did touch on in the DD was that the other InBev brands aren't seeing a pick up at all, they are actually seeing around a 5% decline. Not having Corona in the US is really fucking them right now when trying to pick up the slack in other markets. I have the 12/15 50.00 PUT myself. I agree with all of your numbers when it comes to the YoY growth numbers. It really feels like the earnings analysts are asleep at the wheel here, these numbers are dead simple to calculate from their own financial reports and market data.", "score": 5, "replies": [{"body": "Well I started off the post going into my research about how I wanted to buy $BUD calls and then halfway through running my numbers I realized that was a losing battle...\n\nI figured with how large of a global brand ABinbev is that these numbers wouldn't effect their top / bottom lines that much (given the US market is only about 25-30% of their revenue / profits) and bud light is a singular product.  However, it's the largest product by market share and other beers in their portfolio are also seeing a decline.  That coupled with the analyst growth projections and the decreasing acceleration of growth in other markets makes it hard to overcome the drop in revenue.\n\nThe only way I see this losing is if they miss on top line, beat on EPS, and somehow still go up because it was \"priced in\".\n\nMy concern with longer expiration puts is that they just announced layoffs and I believe they will eventually make the math work on earnings - there's probably so much unnecessary overhead (marketing MBA grads?) in their business currently that they will squeeze out profits despite declining revenues in the future.\n\nI still think they're an OK business, I mean they own so much of the global beer market and beer is not going away anytime soon...  I'd actually look to pick up some shares further down the road once they truly bottom out", "score": 1, "replies": [{"body": "So did I lol. I came into this hoping to write contrarian DD (I love doing that, it pisses everyone off and then its even funnier when I'm right) but realized that there was simply too much data to ignore. To be honest, even without them summarily executing their own company, InBev was always losing the battle for the US market eventually. They were force to give Corona over to another company, and now Mexican import beer and seltzer (two things that they have zero exposure to) are the fastest growing alcoholic beverage categories. Long expiries don't really make much of a delta impact, I will still make the same amount per dollar of share movement regardless.", "score": 4, "replies": []}, {"body": "This is a 3G company. There is likely very little left to cut.", "score": 1, "replies": []}]}]}, {"body": "![img](emote|t5_2th52|31249)", "score": 2, "replies": []}]}, {"body": "Ab InBev owns five seltzer brands. I agree the stock is a dog and but saying they have no exposure to this market is false. Their seltzers do suck and they were late to the party on the trend though.", "score": 7, "replies": [{"body": "Where is the seltzer exposure, I couldn't find any. (genuinely asking). Could you give me some brand names?", "score": 8, "replies": [{"body": "Bud light seltzer, natty light seltzer, Michelob something seltzer, cacti, bon and viv. No one I know drinks these and I never see them out but they all exist", "score": 14, "replies": [{"body": "All gross. Puts for sure.", "score": 10, "replies": []}, {"body": "This is really interesting lol. I've never seen any of these, nobody lists them on the brand lists, and the sales have to be negligible. They definitely exist, but it is almost like the company doesn't even want them to.", "score": 11, "replies": [{"body": "They came out with them way after seltzers became popular. Never see any marketing for them. Personally I don’t know why people choose to drink the canned malt liquor version of a vodka soda but probably a mistake for ab not to push into a market that is so popular.", "score": 6, "replies": []}, {"body": "Bud light seltzer is actually kinda good if you like seltzers. They’ve got several different flavors but I haven’t drank them in so long I couldn’t tell you even a single one of them", "score": 2, "replies": [{"body": "I agree, this summer I've switched over to drinking these alot and their flavors are better than alot of other seltzers like Claws... still, puts on BUD", "score": 1, "replies": []}]}, {"body": "you've never heard of natties??", "score": 1, "replies": [{"body": "I know what natties as in the beer are, I had no idea they made a seltzer version.", "score": 1, "replies": [{"body": "ok I'm back in... you were chilling my feet there a minute, but now I'm back in", "score": 1, "replies": []}]}]}]}, {"body": "Hey it’s not mad dog 20/20 it’s a white claw and it’s classy", "score": 1, "replies": [{"body": "They use it being gluten free as a selling point. It’s a “flavored malt beverage”", "score": 2, "replies": []}]}]}]}]}, {"body": "I liked the colorful pictures.", "score": 6, "replies": []}, {"body": "Saw this yesterday before it was deleted. Didn’t read it but liked the layout and bought 3 55$ and and 5 $54 8/4 puts. If this fails I’m done with the stock market", "score": 5, "replies": [{"body": "maybe you fail cause you dont read ![img](emote|t5_2th52|4271)", "score": 3, "replies": []}]}, {"body": "Lol fuck you", "score": 5, "replies": [{"body": "Lol nice.", "score": 1, "replies": []}]}, {"body": "The hive mind has spoken. BUD calls it is.", "score": 14, "replies": [{"body": "I respect the inverse WSB but I would really implore you to read the DD if you haven't. This isn't even really speculative like 99% of DD here, it is literally just adding numbers together and using stats to make numbers where they don't release them publicly.", "score": 7, "replies": [{"body": "I’ve read the DDs, I agree with most of them, but it’s too obvious. Either it’s already priced in, or there will be some short term butt-fuckery that takes place. My plan is to grab a few last min calls on my belief that BUD will spin a rosy short term picture. After ER, long dated puts.", "score": 15, "replies": [{"body": "That's why I like long dated much more than actually playing Earnings on this one, but I still don't believe this is priced in. The revenue numbers getting spit out are nowhere near in the realm of reality.", "score": 2, "replies": []}, {"body": "Short term butt-fuckery is right. I got cheap calls!", "score": 2, "replies": [{"body": "Thick-Throbbing-Irony. I love it", "score": 2, "replies": []}]}]}, {"body": "Don’t act like we know what “implore” means here, guy", "score": 1, "replies": [{"body": "real and true", "score": 1, "replies": []}]}]}]}, {"body": "Fuck bud. I’m buying puts. Good DD OP", "score": 4, "replies": []}, {"body": "be careful. whatever you said is already known by people. Bad earnings will not be a surprising factor. Also, why are you posting this every few hours? I think I have seen this post 3 times already.", "score": 4, "replies": [{"body": "This got deleted by mods twice within 30 mins of posting, I was able to sort it out and this one was the one that stayed.", "score": 2, "replies": [{"body": "Told you. Prices move only there's a huge surprise.", "score": 1, "replies": []}]}]}, {"body": "Listen bud… I love bud, but I ain’t buying bud, bud.", "score": 7, "replies": []}, {"body": "I have my puts placed ![img](emote|t5_2th52|4271)", "score": 3, "replies": []}, {"body": "Also what's not talked about is **Cannabis being a substitute product**.\n\nIn the states that Cannabis is recreationally legal, **beer sales have crash**.\n\nSame with medical Cannabis... Pharma sales have crashed.\n\nSo the **total addressable market** as a whole of beer shrinking...", "score": 3, "replies": []}, {"body": "TLDR\n\"analists are are determined to pretend that everything is fine\"", "score": 3, "replies": []}, {"body": "I have watched plenty of youtube videos shitting on bud light. Im a contrarian investor. Budd light to ze moon", "score": 5, "replies": [{"body": "Most of those have the thesis of \"trans woman on bottle, buy poots\". This company has sucked for a few years, this just accelerated it.", "score": 2, "replies": []}]}, {"body": "I agree with you by looking at the other side of the trade. Constellation Brands is up 10% on news of Modelo becoming the new #1 selling beer in America. Bud is not even in the top 10. It got the Costco star of death. The icing on the gay bear cake is the redneck factor. They love to drink beer, be angry, and marry their cousins, in that order. If they are angry at Bud (and they are, I tell you hwat), the brand is permanently uninvited to every alley cooler, NRA meeting, and shotgun wedding in every state that contains a vowel. Puts all the way.", "score": 6, "replies": []}, {"body": "Man you really did your homework.  I just get drunk and pick stuff.  You are going places, i am too but I’m going to the poor house", "score": 5, "replies": []}, {"body": "Yeah it's bad and the beer industry is not doing so great and it continues not to do so great but but is a huge portfolio of other brands that the average consumer has no f****** idea is owned by the same parent co. So if Bud light pisses off it's customer base they're just going to switch to the next thing which to be honest is probably the exact same s*** it's just a different can. Hopefully they fire their entire marketing staff and hire Andrew Tate.", "score": 4, "replies": []}, {"body": "Fuck you, I’m in", "score": 2, "replies": []}, {"body": "Didn’t you already post this?", "score": 4, "replies": [{"body": "Yes, and it got nuked about 30 mins in and I had to resolve it with the mods.", "score": 10, "replies": [{"body": "Word.", "score": 3, "replies": []}]}]}, {"body": "I like it", "score": 3, "replies": [{"body": "Thanks.", "score": 2, "replies": []}]}, {"body": "The most fascinating thing for me is illustrated in your little rainbow sales growth chart. When the boycott first began, my immediate thought was, \"middle America and the type of rednecks who guzzle Bud Light will just end of switching to another AB Inbev product and having no net effect on the parent company's bottom line, because those people are stupid.\" The chart seems to indicate that early on, that's exactly what happened, BUT that those consumers very quickly caught on and stopped buying AB Inbev drinks altogether. \n\nI underestimated them, and I think the next two quarters are going to show hits to revenue that are much greater than just the Bud Light product specifically. Bud Light is radioactive at this point; it's a brand NOBODY wants to associate with and will continue to lose marketshare for years to come. But the alternatives to it under the parent company will probably also suffer some unexpectedly large losses.\n\nI don't know if I want to play short-dated puts on it (I already got burned buying some puts on BUD a month ago), but it does look like a fun play.", "score": 3, "replies": [{"body": "Icehouse is the new Bud. And Ying-Ling, but I don’t like Ying-Ling. Tastes horrible, not enough alcohol.", "score": 2, "replies": []}]}, {"body": "Wooooow $BUD puts. Some real Einstein shit you got here.", "score": 3, "replies": [{"body": "I know you are a bit regarded, but maybe actually read it? There's a bit more to the dd then \"beer man put trans person on bottle, I buy put\".", "score": 9, "replies": [{"body": "Trans are priced in. Bullish", "score": -10, "replies": [{"body": "Okay, good luck with that.", "score": 6, "replies": []}]}]}]}, {"body": "I think you’re correct. However, the market isn’t going to reward puts until put side open internet is zero. Budweiser might very well go bye bye, and for good reason. They earned it.", "score": -2, "replies": []}, {"body": "This isn't a dd. But people don't drink beer like my youth. It's not a growth area", "score": 1, "replies": [{"body": "What do you mean \"this isn't a DD\"?", "score": 1, "replies": [{"body": "I mean my rebuttal. Your novella qualifies.", "score": 3, "replies": [{"body": "lmao", "score": 1, "replies": [{"body": "Like it's good stuff. That's what I'm saying. My point is sometimes we deep dude ourselves out of common sense. I just think the beer market is shrinking, and has been for a while", "score": 1, "replies": [{"body": "Oh no, I totally agree with that. I think I had included something about beer consumption being down in general. However, the 2-3% YoY decline in per capita beer consumption doesn't make options move and is literally the definition of priced in.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "That's a lot of words.", "score": 1, "replies": [{"body": "Yes, yes it is.", "score": 3, "replies": []}]}, {"body": "Just waiting for this stock to pump a little bit more today and I'm in. Good stuff man", "score": 1, "replies": [{"body": "Thanks!", "score": 1, "replies": []}]}, {"body": "Are earnings tomorrow? Wasn’t sure on an exact date and time seems like they’re trying to hide it.", "score": 1, "replies": [{"body": "Earnings are tomorrow after hours I believe. I would have to check again.", "score": 2, "replies": [{"body": "Perfect just lmk, I was seeing 7/27 and 8/2 and 8/3 so I had no idea which one it was. I tailed the play regardless.", "score": 1, "replies": [{"body": "It is tomorrow (8/3) premarket at 9:00am. They've moved it a couple times and are being weird about it. Probably super bad.", "score": 1, "replies": [{"body": "Awesome thanks for the heads up, and yea that’s what I was thinking. BOL tomorrow 🫡", "score": 1, "replies": []}]}]}]}]}, {"body": "Looks like they are selling off some of their brands by the end of the year. What's the play OP? \n\nhttps://www.nationalreview.com/news/anheuser-busch-to-sell-off-eight-beer-beverage-brands-amid-falling-bud-light-sales/", "score": 1, "replies": []}]}
