{"title": "Driverless ride sharing and Tesla", "selftext": "Is anyone else surprised that san francisco approved driverless taxis in the city??? I thought this would take years for regulations to pass\n\n\nAnyways this is good news for tesla right? it looks like San Francisco might be the starting/testing ground for teslas robotaxi\n\nFor fun\n\nLet's run through some rough numbers here, I'll probably be wrong on most of this\n\nRight now uber drivers make 25-35 an hr on average in SF.\n\nWith tesla, they'll probably charge half that,  so let's say 15$ an hr.\n\nPeople will be lending their cars out for robotaxi and tesla can supply their own cars too, but let's say people volunteer their tesla \n\nIf tesla takes a 50% cut, that's 7.50 an hr, let's say they operate for 12 hrs a day\n\n\nWell go with Roughly 10,000 teslas roaming around SF giving rides \n\n10,000 teslas giving rides for 12hrs a day at 7.50 an hr equates to about \n\n300 mill in a year Roughly in net profit. Not bad for 1 city.\n\n\n\nAt that rate it's most likely going well,  so it'll be approved slowly around the country, so maybe 50 cities \n\nMultiply 300 mil by 50, you have 16 bil in net profit which should raise marketcap by 160 to 300 bil\n\nOh and uber will most likely be doomed in the process as this is pretty much their core business.\n\n\nThis is a rough guess and estimate , tesla might change the numbers around in terms of profit sharing\n\n\nWhat you guys think?", "id": "15wpbgt", "created_utc": 1692571036.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 71, "comments": [{"body": "Cruise just got into a crash and had to cut their fleet by 50%.\n\nProbably not a great idea to be the Guinea pig here. It’s not just the technology that needs to be better, but public acceptance of accidents is still extremely low", "score": 24, "replies": [{"body": "So surprising to me how much  robots crashing bothers people but the constant  rear ending, tailgating, swerving, and T Boning by terrible drivers is so acceptable.\n\nI love the idea of people less driving", "score": 16, "replies": [{"body": "The main point is culpability.", "score": 4, "replies": []}, {"body": "exactly. i guess its the same where most ppl find excuses for their own bad behaviors, but expect others to be perfect", "score": 2, "replies": []}]}, {"body": "If you're getting hit by emergency vehicles in intersections while their lights are on, you deserve to have to take a step back. Not just about being dangerous at that point, but actively disrupting emergency services.\n\n That said Cruise is still way ahead of Tesla in that market, which shows how much of a pipe dream Tesla is peddling.", "score": 0, "replies": [{"body": "Agree. The bar needs to be high. This should have been tested or verified before approving this which shows you the regulators know nothing.", "score": 1, "replies": []}]}]}, {"body": "Let me guess....you don't have a business degree.", "score": 18, "replies": [{"body": "Some of it is wishful thinking, like the expanding into 50 cities right after.", "score": -6, "replies": [{"body": "Tesla FSD being ready for driverless is the wishful thinking. They cant get summon, parking sensor, rain sensors right & and you expect this.", "score": 2, "replies": []}, {"body": "Also the cost of legal, building and maintaining the software, hiring all the support people to run the business. But other than that pretty easy.", "score": 1, "replies": []}]}]}, {"body": "Tesla lost. Their FSD can’t get pass level 2. Only Waymo(Google) and Cruise(GM) have been approved.", "score": 20, "replies": [{"body": "Not quite, no one has won the race yet. Most engineers involved don’t know who’s gonna win. This is the nature of novel engineering problems. \n\nI knew a couple of researchers in the field back in the day and they basically told me the situation is this:\n\nThe final goal, the holy grail, is a car that can drive any time, anywhere, with minimal sensors(minimal meaning a point at which more sensors don’t add value). \n\nThere’s two ways to get there:\n\nThe waymo way: lots of sensors, pre map a closed area, and drive in that area, learn more, fix issues, expand mapped zone into novel areas, once kinks are worked out, slowly take away sensors and eventually the requirement of pre mapping driving area.\n\nThe big hurdle will be transitioning from many sensors and pre mapped areas to fully independent \n\nThe Tesla way: start with the final suit of sensor, have it drive everywhere but poorly, work the bugs out, and once they’re all worked out, you don’t need to take away anything, it’s already a done product. \n\nThe big hurdle here is getting it to not suck given the limited number of sensors and lack of pre mapped zones.\n\nWaymo getting approvals sooner was expected. That’s their phase one. Getting to a point where their cars can go any where is their big headache (and I can assure you, that’s what they’re putting all their efforts in right now)\n\nTesla doesn’t have a phase two, but their only phase is going to be a long and painful one.\n\nOnce the problem is solved, we’ll find out which approach was the best approach. At this point, no one really knows. Personally as an engineer who has dealt with large projects where some major decisions about how to build the project out, I really appreciate how difficult of a decision it is. I’m just excited that different companies are trying different approaches. Once the answer comes out, there’ll be a lot to learn for all of us following the progress being made by all the players. It’s hard to know where everyone stands either, since bulk of the work being done by both sides are not visible to the public. \n\nAlso, any knowledgeable engineer who confidently proclaims the race is over and one side has one loses all credibility with me. That’s just an emotional opinion and just picking sides for obvious reasons.\n\nMe, I just want self driving cars, and I love how the engineers are doing things differently, thus maximizing chance of success. I don’t care if a company named iHatePuppies does it. The race is a lot closer than it appears, or maybe not, hard to know without knowing the status of ongoing internal projects and their impact\n\nThe only thing that concerns me is the human factor, how the fuck do we convince people to trust these things and allow them to be on the roads everywhere. You just know once the problem is solved, these things could have a spotless record for months and one ugly crash with some kid in it is gonna have hoards of people yelling at politicians about outlawing them, regardless of how better than humans they are", "score": 18, "replies": [{"body": "Tesla doesn’t have more sensors because they weren’t built into the car. Elon promised Tesla owners that FSD would work as is with their current car. It’s not some master plan.", "score": 2, "replies": [{"body": "Yes that’s my whole point. The final product everyone wants is minimal sensors. Waymo is going with the strategy of having a solid machine with a lot of sensors, and as their software becomes better slowly take out redundant sensors. Tesla is starting with the final suit of sensors. Two different strategies with different trade offs. No one knows which one was the better choice until problem is fully solved. \n\nPut in another way, in 30 years, self driving cars will most likely be like teslas. But starting at this point and getting things to work is really hard. They’re dealing with the whole problem first. Waymo is doing it incrementally, by using a ton of sensors and pre mappings, and slowly strip down to something that’s like Tesla", "score": 9, "replies": [{"body": "I lost what remaining faith I had in Elon. I sold my few Tesla shares to buy more Google. His “Tesla Bot” is more bs vaporware that Google will win at also.", "score": 0, "replies": [{"body": "I spoke with one of the engineers at Tesla once, they’re all pretty smart and he told me Elon is just one person in a committee. Their decisions are made as a group and hardly a dictatorship. Trust me, I’ve been in engineering committees, you don’t get Tesla and SpaceX if some idiot was ordering how things should be done despite the disagreements of others. Elon is just the public face of that group, doesn’t mean he’s literally making all the decisions. I have faith in all the engineers of Tesla, waymo, etc.\n\nI can see why to some people tesla seems to be way behind, but they’re just going down a different route, and their big milestones are mostly towards the end of the project, where waymo is more spread out. Personally I’d diversify my bets given how uncertain the future of the technology is. The politics of the situation is a whole different beast as well. Tesla is trying to have personal cars be the first wave of their self driving cars, where’s others have no one behind the wheel. This would probably have regulatory implications too", "score": 16, "replies": [{"body": "i watched a video of someone who used to work on tesla fsd.  and he says he cant give a timeline.  so if the person actually work on fsd cant even give a timeline why do anyone think it will be solve anytime soon.\n\nnot to mention a good portion of the people who worked on fsd all left.  why do people think so many quits if it is close to finish.\n\nmy take is before anyone talk roboraxi when can we actually take our hands off when driving a tesla and just let it drive yourself.  my guess is it wont be possible for the next 10 years and i am not surprise if itll take even 30 years.\n\nlevel 5 is just too hard.  that is why people just tackle level 4.\n\ntesla is tackling level 5 because they just want to make the best driving assist for now.  and ill go as far as saying elon musk is lying about wanting to solve level 5 soon.", "score": 0, "replies": [{"body": "> my guess is it wont be possible for the next 10 years and i am not surprise if itll take even 30 years.\n\nPeople tend to overestimate in the short term, and underestimate in the long term what can be achieved. We barely had internet 30 years ago, and a data centre had less compute power than an iphone.\n\nI can absolutely guarantee you self driving vehicles will be solved within 30 years.", "score": 5, "replies": []}, {"body": "I never said it’ll be solved soon, I’m just saying all players are roughly in the same spot, though it may not seem like it since they’re all going about solving the issue from very different angles.\n\nPeople leave companies all the time, there’s no mass exodus as far as I’m aware, one high profile person left a while ago which was overblown. A lot of people think these things are run by one genius while in reality it’s the whole team and many people who lead them.\n\nPersonally I think it’s very hard predicting when full blow, sci fi movie like robotaxies will happen, probably not sooner than 5 years, but 30 is a little ridiculous. I recently sat in my friends Tesla which had the latest FSD in it and had it drive around an hour in suburbs and some highways and it was very solid. Tried waymo a while back and that was solid too. Software progress tends to speed up towards the end when they’re mostly working out kinks. \n\nTo me the biggest question mark is regulatory. I can easily see a future where self driving from whatever plan is demonstrably safer than humans (but not perfect) and people still refusing to allow them to be widely used", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "You're right.  The only automaker to have a fleet of millions of FSD capable vehicles racking up billions of miles of data and growing exponentially has lost.  They are done.  Cruise and Waymo though... Conquering one small geofenced area of city block at a time.", "score": 5, "replies": [{"body": "Waymo and Cruise have expanded from SF and Phoenix. They are now testing in Los Angeles and Austin and will continue to expand. Uber has already signed a deal with Waymo.", "score": 3, "replies": []}]}, {"body": "For now, just give it time tesla will be approved with the rest", "score": -8, "replies": [{"body": "They had to scrap 300k lines of code that they had been working on for years. It doesn’t build confidence. You still have to sit behind the wheel and babysit the driving.", "score": 5, "replies": []}, {"body": "Just like the cyber truck was announced to be released…. How many years ago? I’d take anything Elon says with the biggest of doubt.", "score": 4, "replies": [{"body": "CTs are roaming america as we speak xX69 Weed Snipe Pussy", "score": 1, "replies": [{"body": "Available for purchase? How late?", "score": 1, "replies": []}]}]}]}, {"body": "I think Tesla use to say “ robo taxi “ constantly to deflect from them being not profitable and almost going bankrupt several times so everyone will look 10-20 years down the road of having fully automated cars . \n\nNow they see they can make money off the actual cars and they are still 5-10 years ahead of every other EV so might as well keep going .\n\nI think a very huge majority of Tesla owners do not even trust their basic auto pilot or even use it ( I use mine daily ) so if the Tesla cult doesn’t trust it yet we are far far far away from people trusting cars without drivers", "score": -2, "replies": []}, {"body": "I’ve never seen a Waymo on the road, so maybe Cruise and Tesla are the only real players?", "score": -6, "replies": []}]}, {"body": "Tesla is nowhere with providing a robot taxi service.  Heck they no longer even talk about it.\n\nHere is the subreddit you want to follow if interested in this.   /r/SelfDrivingCars \n\nBTW, the clear leader is Waymo by a pretty big margin.  The only other provider is Cruise but in the last week they have suffered stalls that created traffic jams, drove into wet cement and had two really bad accidents.  One involved a fire truck which had their sirens on.  Cruise was in an intersection that fire truck needed to drive through to the fire.\n\nIt is so bad that the authorities in SF are requiring Cruise to cut their vehicles by 50%.   They were already far more limited than Waymo.  Cruise could not operate in bad weather where Waymo can.  Cruise could not go more than 35 mph and Waymo can go 65 mph.\n\nHere is an example of where self driving can save an accident versus getting into an accident.\n\nhttps://youtu.be/yLFjGqwNQEw?t=1273\n\nYou invest by buying GOOG or GOOGL.", "score": 13, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "That is not true.  The view was obstructed and the Waymo has more sensors than a human.\n\nSo some humans would have crashed and the Waymo did not.   Superior over the average driver.", "score": 2, "replies": [{"body": "Crashed into what lol? That wasn't even an exceptional situation", "score": 2, "replies": []}, {"body": "[removed]", "score": 1, "replies": []}]}, {"body": "So it’s as good as any driver", "score": 1, "replies": []}]}]}, {"body": "Not everything is about tesla my dude.\n\nAssuming they actually manage to successfully implement fad, they aren't first to the trough anymore.", "score": 9, "replies": [{"body": "But do they need to be first, they just need to be better and or possibly cheaper", "score": 1, "replies": [{"body": "But do you need to evaluate the thesis of Tesla being ahead or do you instead reinforce your prior beliefa because it feels better?", "score": 2, "replies": [{"body": "I'm sure there's advantages with being first, I don't want to jump the gun and assume Tesla will take all market share right away", "score": 1, "replies": []}]}]}]}, {"body": "RemindMe! 3 years\n\nComments in this thread are hilariously wrong. I thought a few were sarcasm but no, people think Tesla isn't already driving between California cities with zero interventions and is far behind the competition. \n\nPure vision vs a geo-fenced, premapped solution.... Oy vey", "score": 2, "replies": [{"body": "And for some reason don't watch any YouTube vids of recent fsd either, or want to", "score": 2, "replies": []}, {"body": "I will be messaging you in 3 years on [**2026-08-22 02:29:48 UTC**](http://www.wolframalpha.com/input/?i=2026-08-22%2002:29:48%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/15wpbgt/driverless_ride_sharing_and_tesla/jx7z37g/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F15wpbgt%2Fdriverless_ride_sharing_and_tesla%2Fjx7z37g%2F%5D%0A%0ARemindMe%21%202026-08-22%2002%3A29%3A48%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%2015wpbgt)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "29 states have had regulations regarding autonomous cars for years. There are robotaxis in multiple states. There isn’t a regulatory hurdle anymore for driverless cars and there hasn’t been for years.", "score": 2, "replies": [{"body": "Really,  what other states have driverless taxis running, besides Cali and az", "score": -1, "replies": [{"body": "There are states that don’t have driverless taxis, but have regulations regarding their licensure. Some examples where driverless companies are also operating are Texas, Tennessee, Washington, Nevada, and Georgia. \n\nHere is a comprehensive list of states that have enacted legislature for AVs. https://www.ncsl.org/transportation/autonomous-vehicles#:~:text=Twenty%2Dnine%20states%E2%80%94Alabama%2C,%2C%20Virginia%2C%20Vermont%2C%20Washington%20and - this was also last updated 3 years ago.", "score": 2, "replies": []}, {"body": "Nevada probably led the pack not via taxis though. Gov has had a playground for years", "score": 1, "replies": []}]}]}, {"body": "Napkin math is great, technology isn't. Musk has always used it as an excuse to pump up the stock, with no actual deadline/release in sight. The problem with giving an ego maniac a ridiculous amount of stock options. He'll say whatever he needs to to pump up the price and this himself.", "score": 1, "replies": [{"body": "Have you seen any recent fsd videos", "score": 2, "replies": [{"body": "From Tesla? No, that's basically propaganda, meant to distract people who don't actually do research, just get spoonfed by Papa Elon. \n\nI look at the officially approved levels by the SAE. Tesla is below its competition.", "score": 4, "replies": [{"body": "Lololol no not from tesla, just YouTube. Tesla owners trialing out fsd beta. Tesla doesn't have any videos on fsd yet, cause it's still in beta I guess", "score": 0, "replies": [{"body": "Yeah, no. I look at the actual unbiased reporting.", "score": -2, "replies": [{"body": "Sounds very tunnel visionish , doesn't hurt to see a vid , there's tonnes of them", "score": 7, "replies": [{"body": "You think it's tunnel vision to rely on unbiased publications?", "score": 3, "replies": [{"body": "It is if your not open to see other sources,  and not all YouTube vids are biased", "score": 3, "replies": []}]}]}]}]}]}, {"body": "My friend, please just stop replying to these comments. These guys obviously have no idea about Tesla. The comments are hilarious. I’m assuming you’ve done a bit of research. These guys in the comments just follow mainstream media and haven’t done any actual research on EV adoption rates, FSD, neural nets, AGI, LiDAR vs Tesla vision. Don’t argue with these people. It’s a massive waste of time.", "score": 2, "replies": [{"body": "True but I like having these discussions, can be fun sometimes and I learn some new stuff, I also get to see how these guys think about tesla", "score": 2, "replies": [{"body": "Haha fair enough!", "score": 0, "replies": []}]}]}]}]}, {"body": "Tesla has not even started. The 2 companies that are approved already have a few cities that they operate in, which in turn gives them more data to continue to refine their system.\nThey are putting the proverbial “money where their mouth is” Tesla, not so much.\nCould they jump ahead of the competition? It’s possible, but as of right now, they don’t have the lead.\nOn the other hand, once they do get rolling, I do see them making buckets of money, just not at the rate that you calculated, because the market will already have leaders. I could be wrong though.", "score": 0, "replies": []}, {"body": "You have no idea how hard it is driving in SF. Doesn’t compare to other countries, but it’s insanely more difficult than driving in the suburbs nearby.\n\nWhen I was a test user for cruise, it was only available in the suburban areas of SF and only between 10pm and 6am AND only when it’s not too foggy or any other poor weather (it’s always foggy in SF in case your not capturing what I’m saying).\n\nTeslas being rented out is the biggest leap from your estimates. I don’t see that happening at all, let alone at scale. Cruise’s are outfitted with a lot of stuff to make sure you are effectively in a cage. \n\nI’ll be curious to see how it works out, but I am far from optimistic. Getting cell service in downtown SF seems to be one of the bigger challenges as these cars would likely struggle to work without reception. Idk… I’m happy to be proven wrong", "score": 0, "replies": []}, {"body": "Are you joking.   Tesla is no where near anything remotely close to self.drving.   check that optimism and come back in 5yrs.   By that time your Tesla FSD you purchased today wont be approved for any sort of rebo taxi fleet  .", "score": 0, "replies": []}, {"body": "This is why Elon has consistently said FSD, once solved, will unlock revenue and profit at scale not seen before.  The napkin math is insane.  And unlike waymo and cruise Tesla FSD can be used in any new location without scanning and constantly updating the surroundings with expensive lidar equipment.", "score": -6, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "That's correct.", "score": 2, "replies": []}]}]}, {"body": "So, who’s Tesla’s are going to be used for this?  \n\nKaren and Jim in the suburbs?  Not a chance that are going to have people puking in their car and cleaning it up daily for $7.50 an hour. Let alone the depreciation for mileage used, the taxes they would have to pay. Won’t breakeven. \n\nThus the only people who might make money at this are car rental places themselves. They would employ cleaners and the cars would be run similar to a car rental agency. Those are not the most lucrative businesses themselves, and require premium payment (fuel, insurance) usually by scaring their customers into it. Won’t be able to do that with a robo taxi. \n\nSo how the hell are you gonna make more profit off these than Uber running cheap Kia Forte’s?  Almost zero chance.", "score": 0, "replies": [{"body": "I'm sure there's going to be vandalism and partying nonsense and all that involved initially , but there's cameras everywhere \n\nAnd of course people will sign up for this, its free money to loan out your vehicle, maybe not everyone that has a tesla but maybe 10%? Besides if there's not enough cars, teslas can send in cars stuck in inventory", "score": 1, "replies": [{"body": "Free money?  So you would let your vehicle rack up 250 miles every weekend to make $50 after taxes?  $2,500 a year for 13,000 miles isn’t a good trade off. \n\nNumbers may be off, but that’s the concern. It’s not evident how beneficial it is at the revenue per ride you are auggesting", "score": 0, "replies": []}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Well can't they just implement rules like uber does before someone's eligible to drive for uber?", "score": 2, "replies": []}]}, {"body": "hm…. sf homeless problem… sf robo taxis…. what could possibly go wrong…", "score": 1, "replies": [{"body": " I would assume you need a credit card and cell phone to call up a robotaxi", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Well waymo and cruise and whoever else is operating right now is dealing with it somehow", "score": 0, "replies": []}]}]}]}, {"body": "300M net profit if your cars run with magic powder non stop, seems legit\n\nAlso, of course, assuming a perfectly spherical law that doesn't interfere with any of this whatsoever", "score": 1, "replies": []}, {"body": "So, basically you are 10x the number of taxis in an area and they are self driving which drops the manhour costs which means you destroy the market and prices drop to a ridiculous level so… who will offer their car then to do that for such little reward?", "score": 1, "replies": []}]}
