{"title": "How much of your portfolio is made up of AAPL?", "selftext": "On the back of the post earlier on about Berkshire, just out of interest how much of your portfolio is aapl?", "id": "tph46c", "created_utc": 1648376474.0, "score": 13, "upvote_ratio": 1.0, "num_comments": 27, "comments": [{"body": "100%. Very bullish on AAPL", "score": 13, "replies": []}, {"body": "85%", "score": 4, "replies": []}, {"body": "99.99%", "score": 3, "replies": []}, {"body": "100.  Only time Will tell if that’s a smart move. So far so good", "score": 3, "replies": []}, {"body": "Actually about 45%.  Didn't plan it that way.  AAPL and GOOG been berry berry good to me.", "score": 2, "replies": [{"body": "I’m saving up now to get some goog after the split too, seems way to good to miss out on that", "score": 1, "replies": [{"body": "Buying Google in a Roth or just in brokerage account", "score": 1, "replies": [{"body": "I’m in the UK so will be doing it through our version of an IRA", "score": 1, "replies": []}]}]}]}, {"body": "94% - the 6% is dividend from AAPL", "score": 2, "replies": []}, {"body": "#100% AAPL portfolio 🍏💼🐂📈", "score": 2, "replies": []}, {"body": "2%. I sold 98% of my positions @ $172. If you zoom out to 6 months, overall trend is still bearish. I will buy more shares when it gets corrected.", "score": -1, "replies": [{"body": "Good luck with that.  You should’ve picked up some shares as went below $155 a couple weeks ago.  In my experience, you get about one chance to buy the correction with each quarter.  If you miss it, you gotta wait for the next correction which will be at a higher price point.  Sometimes MUCH higher price point.", "score": 3, "replies": []}, {"body": "Rip", "score": 1, "replies": []}, {"body": "What price will be ‘corrected’ in your plan?", "score": 1, "replies": []}]}, {"body": "20%", "score": 1, "replies": []}, {"body": "50%", "score": 1, "replies": []}, {"body": "I have a play account (not retirement) that is currently worth $58,000. I have $10,100 in QQQ, $16,000 in an AAPL LEAPS and the rest in AAPL shares.", "score": 1, "replies": []}, {"body": "Small will add if will drop", "score": 1, "replies": []}, {"body": "around 10%", "score": 1, "replies": []}, {"body": "About 75% for me", "score": 1, "replies": []}, {"body": "41%", "score": 1, "replies": []}, {"body": "~70% (15M of 22M total)", "score": 1, "replies": [{"body": "Can I have 1", "score": 1, "replies": []}]}, {"body": ".>60%", "score": 1, "replies": []}, {"body": "15%", "score": 1, "replies": []}, {"body": "Nice.  I don’t want to pay the capital gain, so I’ll just keep it in the drawer.", "score": 1, "replies": []}, {"body": "96%", "score": 1, "replies": []}]}
{"title": "Hi, I have a list of stocks that I'd want to invest in every month for growth but which stocks would you put the least and most money into?", "selftext": "Sorry if this is a silly question I am new to investing but if I can't post this here please guide me to the right place thanks 😅\n\nThe list is:\n\nAmazon, apple, Alphabet, Tesla, Microsoft\n\nNvidia, AMD, MRVL, Paypal, Mastercard\n\nVisa, TSM, Broadcom, Etsy, LRCX\n\nISRG, Costco, Pepsico, Qualcomm, Sony\n\nEnphase, LMVH, christian dior, DDOG, MELI\n\nMicron, UUUU(energy fuels), SLI, ASML, BLDR\n\nCameco, Nasdaq, Salesforce, Chipotle, Garmin\n\nUbiquiti, AMRK, ABBV, NUE", "id": "tpo2bi", "created_utc": 1648400248.0, "score": 3, "upvote_ratio": 0.64, "num_comments": 24, "comments": [{"body": "Welcome to r/stocks!\n\nFor stock recommendations please see our portfolio sticky, sort by hot, it's the first sticky, or see [past portfolio stickies here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3A%22Rate+My+Portfolio%22&restrict_sr=on&sort=new&t=all)\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Tbh that’s something only you could control based of your risk tolerance 💀\n\nI’d make a list ranking the ones you see doing well to worst and take it from there", "score": 10, "replies": []}, {"body": "That is a lot of stocks to keep track of. You may want to cut down by going with an etf. An S&P 500 etf would cover a lot of your picks and would be easier.", "score": 13, "replies": [{"body": "He's not going to keep track of them. He wants someone to post the exact percentages to invest for him.", "score": 10, "replies": []}]}, {"body": "Easier and less stress to pick 4 or 5 etf's.\n\n1 sp500\n\n2 tech\n\n3 medical\n\n4 consumer / luxury brands\n\n5 Asia", "score": 10, "replies": [{"body": "If you put 20% into SP500 \nAnd 20% into tech \n\nYou now have close to 30% in tech lol. \n\nAlmost like saying diversifying QQQ with SPXL. Diversifying GME with AMC. \n\nAnything highly beta weighted to SPY fails to achieve the actual diversification from a sector POV. \n\nBut then again… I also diversify my steak dinner with a rack of lamb. So you know, to each their own!", "score": 4, "replies": [{"body": "You correct, but I believe for next decade,, tech will still be a massive growth industry.\n\nPicking lamb over beef..... Questionable behavior", "score": 1, "replies": [{"body": "Not “over” \n\nSteak with a side of lamb.\n\nIf anything I picked it over … potatoes.", "score": 3, "replies": []}]}]}]}, {"body": "Nobody can answer this question because nobody knows how well you've done your research or your risk tolerance, and tbh nobody is going to look at all of these stocks for you - that's your job, but if you're confident in these choices and you have a higher end risk tolerance then you should put more money into the companies in the last four lines and less into the ones that are higher up. Honestly though, your inexperience shows by both the number of stocks and your picks, so before you do anything I'd suggest opening up a practice account for a few months and practising before deciding what you want to do. It'll probably save you a lot of money.", "score": 3, "replies": []}, {"body": "Too many picks to keep up with. Either pare the list or buy a etf. You’ll go mad keeping track of these.", "score": 1, "replies": []}, {"body": "In my opinion, most of those are good stocks to own.\n\nConsider risk versus return on each. \n\nPersonally, I’d cut PayPal and MasterCard, Visa. This stems from my view in the future of payments.\n\nEtsy seems meh, go Shopify.\n\nI don’t like TSM, geopolitical risk. Better opportunities at that valuation. \n\nI like LULU over LVMH, etc. just did a deep dive in this space.\n\nGarmin and sony seem random to me,  but im sure there’s a theme your trying to catch there. \n\nHave no opinion on Enphase and cameco \n\nCan highly endorse your big tech, most of your semi picks, ISRG, and ABBV\n\nScattered thoughts. My opinions are my own.", "score": 1, "replies": []}, {"body": "...just by SPY, come back in 30 years, you'll do fine", "score": 0, "replies": [{"body": "Great advice! You’re in r/stocks though. If the answer was always buy SPY and come back later, we should merge with r/Investing and r/bogleheads.", "score": 4, "replies": [{"body": "Hahaha I completely agree", "score": -1, "replies": []}]}]}, {"body": "PYPL,DDOG, AMD(but NVDA if you want income), ALPHABET(after stock split),(AMZN after split), and PEP.", "score": 0, "replies": [{"body": "Why would you say after the stock split?\n\nIf the OP can buy fractional shares....they should buy as much amazon and google as possible because both should rise up after the stock split.", "score": 2, "replies": [{"body": "The entry point is lower even with fractional shares he’s still paying out less.", "score": -2, "replies": [{"body": "I dont know what your comment was supposed to mean so here is how it actually works:\n\nIf he buys 1 share at current price *for simplicity sake we will say it is $3000. \n\nIf that stock gains 10% in a year he will own 1 share worth $3300.\n\nOR if he buys 1 share at $3000 and then theres a 20 to 1 stock split - he will own 20 shares worth $150 each\n\nthen the stock rises 10% in a year he will own 20 shares at $165 each.....which will be valued at $3300 total. Its the same thing. \n\nStock splits are great for the stocks value. It increases option chain volume and almost always sees a 4 to 7 percent increase with in 3 to 4 months before or after the stock split occurs.", "score": 1, "replies": [{"body": "Honestly, it seems both of our avenues are the same he can buy 1 share for simplicity and get 20 at 150 and it rise 6 or 7% and he can wait and when it splits still buy 20 @ 150 and it’ll still rise my guy chill. Lol \n\nAlso, you don’t account for if he can only afford .5 of those companies or less then he wouldn’t receive anything but money and would still have to wait. He said he has a list he doesn’t specify if he has 100k. For all we know he has 10k and looking to split it evenly between 5 companies which would mean he can’t afford a full stock. \n\nLiterally, two different avenues that arrive at the same destination.", "score": 0, "replies": []}]}]}]}]}, {"body": "Thats a lot to track. Take a tiny position in every one and learn about them with regards to sector, secular vs cyclical, speculative, dividends, market share vs growth opportunities.  Then as you watch the eb and flow of their charts you start to add more when you believe their price is dipping. You also read about them and begin to understand their business with respect to stck price. Eventually you’ll develop a strategy to fit yourself as an individual. Embrace the path of learning without investing too heavily. Have funds in cash to respond once you begin to understand market dynamics.", "score": 0, "replies": []}, {"body": "lol just go with a etf... If you are asking these questions...", "score": 0, "replies": []}, {"body": "I'd invest about 50%-75% in a broad index ETF and the rest in maybe 3 to 5 of your highest conviction stocks\n\nFrom your list,  I'd go with COST, NVDA, TSLA, MSFT, and GOOGL", "score": 0, "replies": []}, {"body": "Lol, while you do that ill buy up weed stocks are record lows sit on it and make millions.  That my friends is ape logic!  Pay attention what is about to happen.", "score": -5, "replies": []}, {"body": "Create an M1 account, create your pie any way you want and weight them however you'd like.", "score": 1, "replies": []}]}
{"title": "The new EU gas & Oil supplier *discussion*", "selftext": "Hi team, just another part timer trying to generate some alpha and thought I’d throw this out to the group.\n\nHere are the facts:\n\n- Whatever the outcome is in Ukraine (long duration vs short, Ukraine ‘win’ vs Russia, peaceful vs violent resolution etc) the one truth is the EU will change it’s supplier of LNG/ oil from Russia.\n\n- The EU has now vowed to buy its LNG & oil as a block (as opposed to having individual countries compete as before).\n\n- This means that there are some BIG contracts that will be agreed in the future (I’m assuming discussions are already heavily under way).\n\n- With the current inflation levels, commodities are considered ‘safe havens’ and so are related stocks.\n\nI’m trying to find who and where this/these producers will be- it’s easy to just say ‘US’ or ‘Saudi’ but, with countries such as Nigeria publicly bidding , I thought I’d throw it out for discussion.", "id": "tpuvr3", "created_utc": 1648420093.0, "score": 19, "upvote_ratio": 0.9, "num_comments": 24, "comments": [{"body": "TELL?", "score": 10, "replies": [{"body": "TELL going way up if they execute", "score": 2, "replies": []}, {"body": "No production only in construction phase", "score": 2, "replies": [{"body": "Fingers crossed tho", "score": 5, "replies": [{"body": "![gif](emote|free_emotes_pack|put_back)", "score": 2, "replies": []}]}]}]}, {"body": "Turkmenistan and Azerbaijan over Turkey, a new pipeline over the Caspian sea that connects to the already existent pipeline to Europe. TAP, TANAP and Transcaucasian.\n\nI honestly doubt it, chances are that they will try to keep going with reliable Russia.\n\nWhat I really really hope from is a resurgence of nuclear energy, if the green anti-nuclear propaganda is finally put to an stop and regulations are reduced, Europe should become a nuclear power; and Africa is a good provider for this, as usual with minerals.\n\nUSA is trying to make deals with Venezuela it seems, but luckily with Moscow out and now China being the main force of control in the region, I think the CCCP influence is better than the Kremlin.\n\nI think Africa is the future of economics if everyone just played their cards right, from tech which is aiming Africa because it has the most chances to grow there as a lot of has been built yet, a source of minerals, even fucking green energy, like in the sahara; Africa is blessed, but also cursed for the same reason of its own natural resources.\n\nI play my cards in the tech giants conquering more and more of Africa in the near future, I invest heavily in tech for the promise of Africa and things like remote work becoming more common. And I think that if EU politicians think, they should think of trying to make europe a nuclear energy superpower and make deals with Africa.\n\nBut what does one know?... just because something makes sense is not what happens, we are just speculating here, world is unpredictable.", "score": 4, "replies": [{"body": "Jmia?", "score": 1, "replies": [{"body": "I would not recommend a stock pick like that, I don't have the knowledge, technology is simply behind there (in general) and there are big needs that can have technological solutions.\n\nI guess it's simply part of my pipedream of a world of nuclear energy as alternative to fossils with large cooperation between the western powers as for a future where we don't rely in oil as much. Africa could be the uranium supplier of the world and the stocks would be the nuclear power ones.\n\nBut like I said, this is all unpredictable, we don't know the moves they'll do, we can only hope for this sort of diversification.", "score": 2, "replies": []}]}]}, {"body": "The us cant supply enough gas they can supply about 10% of what russia supplies now.  if they could there would be no crisis, no dependency on russian gas. \n\nThis is a problem for europe that is not going away anytime soon.", "score": 5, "replies": []}, {"body": "What makes you think they won't go back to Russia?", "score": 7, "replies": [{"body": "This is the correct solution. There will be some big speeches, but we will simply go back to buy Russian gas once the war is over. Bonus if Putin is couped we will simply say that now we are supporting the new, democratic government.", "score": 4, "replies": [{"body": "Which will most likely also not be very democratic. 😉", "score": 3, "replies": []}]}, {"body": "Did you spend the last 2 months in a cave?", "score": 8, "replies": [{"body": "No, but Europe will go back to Russia.", "score": 7, "replies": [{"body": "This is the correct answer.\n\nThe logistics to getting LNG to Europe over the ocean will be challenging and expensive.", "score": 6, "replies": []}, {"body": "And Russia needs the money.\n\nProbably more than Europe needs the lng.", "score": 1, "replies": []}]}]}]}, {"body": "I think Equinor will be the big winner in this.  I think initially the EU will be scrambling to get anyone at all to supply them.", "score": 3, "replies": []}, {"body": "Buy TELL", "score": 2, "replies": []}, {"body": "  I’m looking at Cheniere ticker is LNG", "score": 4, "replies": []}, {"body": "EU is corrupt and impotent.\n\nWon't manage anything well, electricity prices and inflation through the roof due to incompetence\n\nIn short, don't bet on EU", "score": -5, "replies": [{"body": ">EU is corrupt and impotent.\n\nAnd you base this on... what?", "score": 8, "replies": [{"body": "I base this on the doctrine of Cologne. Germany has completely undermined the EU, they have continuously done back door transactions and have influenced all of Europe through intentional devaluing of the Euro along with intervening in every single political election starting from the local level. They have produced only hand picked officials that will do the bidding of Angela Merkel, this was done due to idk I made all of it up.", "score": -3, "replies": []}]}]}, {"body": "who?EU? EU is a joke. They're prayin Russia not to cut natural gas..will go back and buy Russian gas with a tripled price. It's simple is that.", "score": -5, "replies": []}, {"body": "Coterra", "score": 1, "replies": []}]}
{"title": "Lower prices for NVDIA GPU", "selftext": "Hi guys, as most of you probably know, graphic cards by NVIDIA have been very expensive especially due to the mining of crypto.\n\nHowever, in the past few years, it has been unprofitable to mine Bitcoin with graphic cards due to ASICs miner machines that are much more efficient. And now, Ethereum is moving to a \"**transition to a proof-of-stake protocol**\" very soon, so it will be impossible to mine with graphic cards. All in all, impossible to mine the 2 main crypto currencies with a graphic card.\n\nThe cost to acquire an NVDIA graphic card has already started to decline over this weekend. NVDA is trading at very high multiples right now with a lot of growth priced in. We can anticipate a decline in demand for GPU, but also will the crypto miners turn around and sell their GPU pushing the prices down even more?\n\nI wonder if this is priced in. A lot of analysts like NVDIA a lot, but I am not sure if those analysts are aware of that inevitable possibility of a pull back of people mining with GPUs which will affect the demand.", "id": "tpwioo", "created_utc": 1648425428.0, "score": 3, "upvote_ratio": 0.6, "num_comments": 23, "comments": [{"body": "The analysts care very little about cryptos and more about powering AI applications, metaverse. This is where NVdA has unlimited growth potential and also the reason why Cramer was jumping up and down claiming NVDA will some day worth $10 trillions lol. Also, this is also the reason why a lot of people are starting to think NVdA can topple AAPL as the world most valuable company. We will see.", "score": 16, "replies": [{"body": "NVDA got a great product, however they won’t stay alone for ever. At the end of the day, money matters more than anything else. Even if people like Cramer don’t care about crypto mining, they will be the first ones to scream if NVDA misses their earnings and lower their guidance.", "score": 1, "replies": [{"body": "NVDA is at the top right now, and they will do for a while. However, Intel's GPU coming out very soon, and their GPU is not that bad rather competitive. We would see a big amount of intel's CPU and GPU combo.\n\nEdit: metaverse is many years away. more likely 5 to 10yrs out.", "score": 2, "replies": []}]}, {"body": "Crammer recently said NVDA was a \"buy\", which we inversly interpret. So, SELL...", "score": 1, "replies": []}]}, {"body": "You're just looking at one revenue stream for Nvidia. The metaverse, gaming and auto industry will be the biggest generators of revenue for the company and increasing its value.", "score": 8, "replies": [{"body": "Yes, but isn’t the stock priced for a perfect execution + high growth? 700Billion of market cap with a P/S of 25? It is more than Tesla and it doubles AMD.", "score": 1, "replies": [{"body": "Bulls will say anything to justify the insane bubble valuation. Touting vague future revenue drivers to justify paying 700b on not even 10b of free cash flow for a mature semiconductor company is ludicrous.", "score": 3, "replies": [{"body": "\"mature\"? Lol, look at the growth rates and margins", "score": 2, "replies": []}]}]}]}, {"body": "You're forgetting about the other side of the coin. Thanks to people being stupid enough to pay scalper prices on eBay they now know people are willing to pay far more. \n\nThe current gen is effectively end of line and going on sale relative to recent pricing. \n\nThe 40 series will be an absolute rip off. And people will buy it anyway. Absolutely terrible for customers but great for profit. \n\nThey're a trash company if I'm honest but their anti consumer bullshit works and makes money. And you don't buy their stock because they're nice.", "score": 3, "replies": []}, {"body": "honestly the upcoming tsmc sourced 40 series gpus are pure optionality imo as the company is trying to transition more to datacenter/server verticals and omniverse. pc and crypto is derisked and not really a huge driver for the company on a point forward basis. the grace/hopper performance bump, auto/adas monetization, and hyperscale spending are the main growth vectors for the stock.\n\nin the leading edge, there is no alternative. if youre worried about frothy multiples maybe the analog names or even qcom could be viable.", "score": 2, "replies": []}, {"body": "Define perfect execution? Meaning, does perfection execution incude crypto revenue streams? Probably not.", "score": 1, "replies": [{"body": "Well, perfect execution means high growth for a very long time. For their multiples to make more sense, they would need to double their sales without any price appreciation.\n\nHow you do that with a pull back in demand for GPUs?", "score": 1, "replies": []}]}, {"body": "From one source. You're applying that to every other source. A pull back from mining crypto means units available to every other source.", "score": 1, "replies": [{"body": "I don’t know if you have any basic economy background, but in theory, a pull back of the demand will drive down the optimal price.", "score": 1, "replies": [{"body": "What I'm saying is you're looking at one aspect. Nvidia discloses in their recent 10-K that crypto mining could impact their business but they can't quantify it (I read this as a general \"we have to mention it beacsue we have to\" type of disclosure). Based on this and their strong performance in every other aspect of generating revenue, I would not stress about crypto. Yes, a pull back in demand will drive down the price but I believe that the drop in price will be minimal due to the strong demand in other uses of their products.", "score": 1, "replies": [{"body": "I agree with you, the business of NVIDIA will remain very good, and they will be very successful. My point is rather the price per share of the company. When you have such high multiples on a 700b market cap company, any wrong step might provoke a good plunge (20%+).\n\nWhat if they miss their earnings and lower guidance? 2 years ago, it was a war to get a NVIDIA GPU. A normal GPU of 1000$ was selling for 3000$ because of crypto mining. The demand was just huge and absurd.\n\nAs I said, a lot of crypto miners might just sell everything. There’s potential mean reversal that can go under the median price.\n\nGamers just need one GPU, miners need as many as they can. One rig is usually 6 to 8 GPU, and miners can have multiple rings.", "score": 2, "replies": [{"body": "There's always risk in the marketplace. Especially with tech companies in which technology is always changing and changing quickly. With Nvidia I'm in for the long-term and with that like to think that the company's management knows the marketplace and can quickly adapt to changes. For me, any dips in price is just an opportunity to grab more of the stock at a discount (just like when it was down to ~$210 a couple of weeks ago.", "score": 1, "replies": []}]}]}]}]}, {"body": "If crypto users don't buy GPU's then gamers will.", "score": 1, "replies": [{"body": "Gamers just need one, miners need as many as they can. One mining ring is typically between 6 to 8 GPU. A miner can have 5 rings or more, but some miners have crazy equipment like 100+ rings.", "score": 2, "replies": [{"body": "More and more gamers are opting for using 2 for streaming purposes.. and gamers love to upgrade and go crazy with benchmarks/fps\n\nI have an RTX Super 2070, but wanted to get an RTX 3080 for ultrawide heaven, but there were none in stock at reasonable prices", "score": 2, "replies": [{"body": "You get my point, demand will go down.", "score": 2, "replies": []}]}, {"body": "How many people have not been able to buy a GPU at all due to lack of inventory and price increases? You are trying to compare a few miners with crazy rigs with millions of gamers on the planet.", "score": 2, "replies": [{"body": "We are supposed to talk about valuation here. Decline in demand will drive the price down. We know there’s gamers that will buy GPUs, but that’s not the point.", "score": 2, "replies": []}]}]}]}]}
{"title": "Educate me on 30 year treasuries in a high inflation market.", "selftext": "[removed]", "id": "tpac5l", "created_utc": 1648347393.0, "score": 11, "upvote_ratio": 0.83, "num_comments": 26, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|31|**First Seen In WSB**|1 year ago\n**Total Comments**|390|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=tpac5l)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=tpac5l)", "score": 1, "replies": []}, {"body": "In rising rate environment you don’t want to lock yourself into a long term bond coupon, use the step ladder approach, a 2 year is only 25 basis points lower.  And in 2 years the 10 or the 30 will be paying much higher coupons than today.  We are as close to zero as we will get, so the trajectory is up for rates.  The strategy in this environment is short term bonds.", "score": 7, "replies": [{"body": "I’ll check out the step ladder approach, thanks!", "score": 1, "replies": []}, {"body": "You’re making many assumptions there. I agree with your theory but never assume ‘much higher coupons’ on the 10 or 30.", "score": 1, "replies": [{"body": "I’m just saying in a rising rate environment I don’t want to hold long term bonds.", "score": 3, "replies": []}]}]}, {"body": "Just buy G M E and you will be fine", "score": 13, "replies": [{"body": "Don’t forget to D R S ⭕️", "score": 8, "replies": []}, {"body": "This guy fuks", "score": 6, "replies": []}, {"body": "![img](emote|t5_2th52|4887)", "score": 1, "replies": []}, {"body": "And CLOV ![img](emote|t5_2th52|4275)", "score": -4, "replies": []}]}, {"body": "I'd like to do something similar when rates peak in another 12-18 months. How do long term treasuries work? Do they pay the full premium at the end if the term? My plan was cds and a ladder approach to get some cash yearly but that could be short lived at higher rates if a recession hits.", "score": 1, "replies": [{"body": "What do you mean by full premium? (The premium part its whats getting my a bit confused)", "score": 1, "replies": []}]}, {"body": "r/stocks \nr/stockmarket", "score": 1, "replies": [{"body": "Right lol, grandpas on our betting sub asking about his fixed income retirement bonds.", "score": 3, "replies": [{"body": "I lost more last year yoloing FDs than you made all year, thank you very much.", "score": 3, "replies": [{"body": "Aye papi, I like when you talk dirty to me.", "score": 1, "replies": []}]}, {"body": "It's a legitimate question, and a good plan he's got for a pretty chill life, but the likelihood of getting terrible advice here is high.  Imagine ending up somewhere far away, where the cost of living is $600/month with <$300/month of income.  Poor in the US is not so terrible.  Poor in a poor country is another matter altogether.  I've been both.  Hope you're reading this, OP (P.S. Bonds are not my thing, so I'm not offering 2¢)", "score": 2, "replies": [{"body": "Just to clarify, I make a 6 figure income working remotely, but I have a very low COL due to lifestyle choices and real estate investments. I simply want some guaranteed income so I can stop working or work part time as a consultant. I could find a job in any market conditions that will more than cover my living expenses, I just don’t. Want. To. Work.", "score": 3, "replies": []}]}]}]}, {"body": "Suppose you are on a high inflationary context, yields go up which depreciates the fixed rate bonds that are already on the market, but you notice an opportunity to buy bonds with big yields because you believe inflation won’t last, then as inflation starts going down to a more safe level yields are going down which will appreciate the bonds you are currently holding.", "score": 1, "replies": []}, {"body": "Max out the allowable TIPS yearly", "score": 1, "replies": []}, {"body": "Living the dream with a dystopian country taxing its citizens even if they don't live in the country. How can this work?", "score": 1, "replies": [{"body": "Foreign Earned Income Exclusion via physical presence test for no federal income tax (you still pay Medicare, SS, etc) + virtual address in Florida so that you can claim domicile there for no state income tax + the fact that Turkey does not tax people on visas if they work remotely, allows remote work without a visa as long as you have no Turkish clients, and gives you a 1 year renewable visa every year if you own property as a foreigner. It’s a very nice loophole that’s going to let me pocket $25k a year in taxes that would otherwise be going to funding idiotic things like building Trumps wall, paying for Israel’s war, and subsidizing illegal immigrants medical bills. Also fuck the US for requiring tax filing and FACTA for it’s citizens living abroad, shame.", "score": 2, "replies": [{"body": "Sounds great. Taxation is theft", "score": 1, "replies": [{"body": "100% fam, I don’t mind paying a 50% tax rate for social programs if every *citizen* rich and poor has access to them, not this Mickey Mouse shit America has.", "score": 1, "replies": []}]}]}]}]}
{"title": "Tesla stonk powering through the FUD.", "selftext": "", "id": "tpapcr", "created_utc": 1648348733.0, "score": 921, "upvote_ratio": 0.94, "num_comments": 27, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|just now\n**Total Comments**|0|**Previous DD**|\n**Account Age**|1 week|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=tpapcr)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=tpapcr)", "score": 1, "replies": []}, {"body": "Look at it go. It's majesty brings a tear to my eyes.", "score": 36, "replies": []}, {"body": "It's all about consistency.. he plowed through those hurtles like he didnt want to be next in line after the husband..", "score": 14, "replies": []}, {"body": "[deleted]", "score": 17, "replies": [{"body": "Did he... shatter... some of those?", "score": 6, "replies": []}, {"body": "OMG, his Walk of Champions at the end is gold.", "score": 5, "replies": []}, {"body": "You're right...", "score": 6, "replies": []}]}, {"body": "is that guy from Russia?", "score": 4, "replies": []}, {"body": "Lol", "score": 3, "replies": []}, {"body": "He’s an animal.  No stopping.  Power through!", "score": 2, "replies": []}, {"body": "loll gg, good last joke xD", "score": 2, "replies": []}, {"body": "That a boy, very determined.", "score": 2, "replies": []}, {"body": "Run, TSLA, Run!", "score": 2, "replies": []}, {"body": "Ukraine war is bullish for Tesla though cause of oil", "score": 4, "replies": []}, {"body": "Fat drunk and stupid is no way to go through life son", "score": 3, "replies": [{"body": "Eh...  hungry and sober is over-rated.", "score": 3, "replies": []}]}, {"body": "What fud? They sell recalls and cheap tequila", "score": 1, "replies": []}, {"body": "[deleted]", "score": -10, "replies": [{"body": "You have puts brah? You mad...brah?", "score": 3, "replies": []}]}, {"body": "That guy put his hurdle career to rest that day and became a fulltime wsber", "score": 1, "replies": []}, {"body": "dawg excessively accurate 🤣", "score": 1, "replies": []}, {"body": "100% checks out. Can't say much more.", "score": 1, "replies": []}]}
