{"title": "$nvda condor", "selftext": "thoughts on NVDA? premiums are jacked up! \n\nFeb 17 110/115/125/130 IC...credit 3.05. \n\nthoughts", "id": "5t1y4i", "created_utc": 1486666116.0, "score": 10, "upvote_ratio": 0.92, "num_comments": 37, "comments": [{"body": "I see you're bullish.  The expected move is currently +/- 8.75", "score": 2, "replies": [{"body": "yeah leaning towards bullish here...but dont think it moves much..what do you think?", "score": 2, "replies": [{"body": ">dont think it moves much\n\n\nGL", "score": 9, "replies": []}, {"body": "I'm not in it, but the expected move is now 9.12 +/-\n\nThe way I see your trade, you're betting the market is underestimating the move and that the move will be higher.  I have no opinion about it otherwise.", "score": 3, "replies": []}]}, {"body": "where do you find expected move values? I just do it by delta", "score": 1, "replies": [{"body": "Expected move values are found by taking the ATM call and put and adding them together.", "score": 4, "replies": [{"body": "And multiplying by ~~the implied volatility~~ 85%. Otherwise you'll overshoot ", "score": 2, "replies": [{"body": "The IV is already priced in.", "score": 2, "replies": [{"body": "Oops, wrong factor. Multiplied by 85% is how [TastyTrade](https://www.tastytrade.com/tt/learn/expected-move) calculates it. \n\nOA multiplies by 84%\n\nUsing standard distribution, it can also be calculated it as \n\nStock price x IV x sqrt(DTE/252)", "score": 3, "replies": []}]}]}, {"body": "neat trick", "score": 1, "replies": []}]}, {"body": "I'm using the market maker move on TOS.  It's derived from ATM option prices but I don't know the exact formula.\n\nCurrently 8.98", "score": 2, "replies": [{"body": "ATM straddle x 85% IIRC", "score": 4, "replies": []}]}]}]}, {"body": "I sold 100 104/105 put spreads for a .14 credit. Shoulda sold like 1,000 of them.", "score": 2, "replies": [{"body": "What broker do you use?  That's  $300 in and $300 out for me lol", "score": 2, "replies": [{"body": "Schwab", "score": 1, "replies": []}]}]}, {"body": "entered a feb 17 100/105/125/130 IC for 2.00. covered on a +/- $10 move. ", "score": 1, "replies": [{"body": "Looking good ", "score": 1, "replies": []}]}, {"body": "I had an open order for an IC at below the mid point and didn't get filled. So sad. Was going 110/111/122/123 for .70.  Hopefully you got filled. ", "score": 1, "replies": [{"body": "yeah got the fill! ", "score": 1, "replies": []}]}, {"body": "sold a 108/113 put spread. Kinda wishing i had done an IC but i'll take what the market gives me. Outlook is neutral to long in the short term. ", "score": 1, "replies": []}, {"body": "i went with the 100/140 strangle. the ATM straddle would have been money!", "score": 1, "replies": [{"body": "The ATM straddle would have been money if it was short. It would have been a loser if long since its cost about $10 and NVDA moved only $3. ", "score": 1, "replies": []}, {"body": "what sort of buying power do you need for this play, with out any long legs", "score": 1, "replies": [{"body": "A bit under $2K in BPR, depends on the strike selection. Closer to ATM is more, far OTM is less. It's earnings, a quick in and out.", "score": 1, "replies": []}]}]}, {"body": "111/113/127/128 IC   credit .95 worked beautifully.", "score": 1, "replies": []}, {"body": "I'm sitting on a 110/125 strangle. premium was too good to not take a chance. ", "score": 1, "replies": [{"body": "TY for downvotes I'm laughing all the way to the bank with your premium ", "score": 5, "replies": []}, {"body": "I would get out of it now. This is one stock currently which may blow up. In either direction. I.e. I have a 98/139 Feb 17 earnings strangle and ready to defend it. Too cautious? I just want my $100 overnight and get back to the portfolio :)", "score": 2, "replies": [{"body": "Mate I've been on a few hundred shares since 2011 :)", "score": 2, "replies": [{"body": "Aaand  oops.... Hope it stays above your short strike tomorrow on open!", "score": 2, "replies": [{"body": "So far so good. looked like a good report. little whipsawing around in the after hours but I don't think anybody was surprised here. ", "score": 2, "replies": [{"body": "Iron condors <3 this type of movement :)", "score": 2, "replies": [{"body": "But no more than strangles! :)", "score": 5, "replies": [{"body": "aye much like with unruly employees, Strangles are the only way to go. ", "score": 2, "replies": []}, {"body": "one day i'll muster the confidence to throw one of these on and get on ur level :)", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "no long legs at all?\n", "score": 1, "replies": [{"body": "I am long NVDA stock already. ", "score": 1, "replies": []}]}]}]}
{"title": "NVDA and Why I Think It's Still The Strongest Buy of the Year", "selftext": "Hello fellow investing sub-reddit scum and villany ;p\n\nI know that there have been numerous threads about NVDA and it's earnings reports. How there may be a sell off post earnings and blah blah blah with AMD and INTC... Well I'm here to tell you why that is NOT happening.\n\nFirst of all, I, like many others, have been affected by what I consider the black plague of our lifetime... Cancer. I lost someone very dear to me recently, which is my primary purpose in writing this post.\n\nBack in mid 2016, I invested a quarter of my portfolio into NVDA because I saw what kind of philanthropy they could bring to not only the gaming world (as I am a gamer myself), but also to the amount of lives that will potentially be saved from self drive autonomy. \n\nIt was soon after, that they announced that they were using their deep learning AI on cancer research, and gave almost half a million in funding to cancer research groups, that I knew that this company was going to help cure the world. I invested another 25% of my portfolio on top, and needless to say, I am sitting on some pretty comfortable gains.\n\nI believe that these gains will only continue to rise forward through 2017/18+, because aside from self drive/autonomy partnerships (Tesla, Audi, etc.), their stranglehold on the GPU market, and their own IoT products coming down the pipeline ahead...\n\nI believe that they will find a cure for cancer.\n\nMaybe not this year. Maybe not the next. But eventually, it will happen.\n\nSo if you are an investor on the fence because of the incredibly high p/e, or the risks involved, or whatever reason.. I would like for you to sit back for a second and think, carefully. - Look at where the pricing for companies like Facebook or Netflix are at. How much more growth (and how fast) do they have in comparison to a company such as Nvidia? This is the question you need to ask yourself. And I recommend finding an answer before you're one of my other numerous friends that I hear everyday, muttering, \"Damn, I should've...\"\n\nI try not to mix my personal feelings with my money, because I like to think I'm not a complete financial moron (my ex taught me that) - But I can't think of a more qualified stock to be bullish about that will not only net more incredible gains, but will also make me sleep better at night, knowing that every day, of every hour/minute/sec, we are coming that much closer to having an actual anti viral that can cure ALL forms of cancer.\n\n\nI like to invest in companies that can help fix this already fucked up world we are living in. There are so many others that are at such disadvantage in their lives. And what about us? Who is to say that YOU, my fellow investor, is immune from this disease? Will YOU be able to continue forward, knowing that in your current state, you could get a call from your doctor after a check up, only to find out that the next two quarters of earnings will be the last you ever see?\n\n\n..\nAnd to see a smile on a familiar face, one more time..\nTo feel that touch..one more time.... I would give anything..anything....to feel that one more time...\n\nI love you Jessie. Always <&3 forever. GG, no re...", "id": "5syqxa", "created_utc": 1486627211.0, "score": 29, "upvote_ratio": 0.73, "num_comments": 32, "comments": [{"body": "I feel like i just read a sharktank script", "score": 50, "replies": [{"body": "I'm out.", "score": 25, "replies": [{"body": "I'll give you the $200k you requested.  But for a 25% stake, and I would like to be paid back $1 per unit sold until I recoup my $200k.", "score": 2, "replies": []}]}]}, {"body": "Sorry for your loss.", "score": 13, "replies": [{"body": ":(", "score": 2, "replies": []}]}, {"body": "I get the impression that as high as the PE is for NVDA they basically would have to beat by alot to keep the price here or higher..", "score": 7, "replies": [{"body": "Chipoltle's P/E is 500.  How fucking stupid is that?", "score": 1, "replies": [{"body": "Chipoltle worth less than $100, really. ", "score": 1, "replies": []}]}, {"body": "PE is old news man. No one cares about that stat anymore. PE can be 10,000", "score": -4, "replies": [{"body": "I remember that kind of thinking in 2000", "score": 12, "replies": [{"body": "I don't I'm just making things up", "score": 4, "replies": [{"body": "Everything is basically at record highs.  BUY BUY BUY!!!", "score": 2, "replies": [{"body": "Served me well so far! ", "score": 1, "replies": []}]}]}]}, {"body": "Laughing so hard", "score": 2, "replies": []}]}]}, {"body": "Sorry for your lost but I really canmot agree with your way of thinking. Investing in companies that priorize on helping the world instead of focusing on the $$$ is not gonna be a good investment. The stock world is not to be mox with the world of emotion. Keep it cold blooded and you will make money.", "score": 5, "replies": [{"body": "And personnally, I don't think nvidia will cure cancer. Nvidia is still small compared to all the big players.", "score": 1, "replies": []}, {"body": "This is the sad truth.", "score": 1, "replies": []}]}, {"body": "While I'm sorry for your loss, there are more than 100 different types of cancer.\n\nCancer is not one disease, it is 100 different genetic and environmental causes for a combination of uncontrolled cell growth as well as poor immune system response.  Cancer is not one disease. If NVDA and IBM and Google and The best tech giants wanted to cure or treat cancer more effectively, they would work more closely to create better molecular biology prediction models and protein interaction models with the top universities that have already been studying cancer, very well, for years. ", "score": 7, "replies": [{"body": "> While I'm sorry for your loss, there are more than 100 different types of cancer.\n\nGreat post overall. Not to nitpick but to add to your point, depending on which cancer authority you ask, this number could be off by a factor of 2 or a factor of 10. ", "score": 3, "replies": []}]}, {"body": "$NVDA's Q3 was lead by incredible success in gaming market. The revenue nearly doubled compared to previous quarters. I don't think we would see that kind of revenue spike from current levels in the future however. But I think NVDA is a good buy for a long term, due to fast growing AI sector. Everyone probably knows but GPUs are really good for parallel computing and way faster than CPU for some computations. (okay-ish GPU already have 1TFLOPS while one of the best CPUs have something like 300GFLOPS) AI tech is ridiculously computation heavy. Some of the big name ones like the so-called \"Deep Learning\" requires some serious computation. These AI technologies are definitely creeping into medical sector, because now we have electronic medical data easily available and these AIs are really good for crunching those numbers and getting something out. So the cure to cancer is not completely unrelated to NVDA. But don't expect to have short term fun like last year though. ", "score": 4, "replies": [{"body": "Finally someone who actually reads the 10-Qs\n", "score": 1, "replies": []}]}, {"body": "So, sorry for your loss, first and foremost.  \n\nBut I don't think they will be curing cancer.  First, \"curing cancer\" is a silly line and doesn't mean anything.  Curing all of it?  That's not really a thing.  Cancer is an inevitable consequence of breathing oxygen and having genes that replicate imperfectly.  \n\nCuring or treatment for a very specific type of cancer, might come out of this.  But I don't think they will profit significantly from that.  A cold way of looking at it, but my point is that I don't think it puts them in any particularly advantageous position compared to any other company that is using supercomputers for health modeling.  ", "score": 4, "replies": []}, {"body": "Maybe instead of thinking NVDA has a stranglehold on the GPU market, you can think that both AMD and NVDA are both growing because the computing market is rapidly growing. Causing gains in both companies to be significant over the past year. \n\nI think esports and twitch are gaining in popularity as well which helps growth. Thanks for the interesting writeup. I will definitely be looking into this more!", "score": 3, "replies": []}, {"body": "*I believe that they will find a cure for cancer.* \n\nlmao NVDA designs graphics processing units for the gaming market, as well as system on a chip units for the mobile computing and automotive market. How do you get pharmaceuticals involved? Sorry for your loss, but it's best to leave your emotions out of stocks. Just like every economic bubble that busted before today - NVDA will eventually suffer the same fate ", "score": 3, "replies": [{"body": "What he meant to say is \"I believe they will license or sell their technology to a group, individual, or company that cures some specific, targeted form of cancer, possibly with some help from their Nvidia GPU.\" \n\nAnyone who believes in a (general) \"cancer cure\" is misinformed. Cancer is not one disease. It's a collection of unique diseases which manifest similarly.", "score": 3, "replies": [{"body": "Agreed. There is no magic bullet for cancer. The only thing we can do is make more effective treatments. ", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Hopefully the smart guys have a trailing loss set up. ", "score": 3, "replies": []}]}, {"body": "I'm sorry for your loss.  I 100% agree that NVDA is a strong buy right now.  I have about 85% of my portfolio in NVDA right now, and I'll continue to hold it because I think their revenue is going to continue to rise quarter after quarter.  That being said, I don't think a company like NVDA is a great place to put your faith.  NVDA isn't necessarily convicted to cure cancer, so this company might let you down in the future by chasing profits over altruism.  Also, there is no silver-bullet cure for cancer since the disease comes in so many forms.  There are plenty of smart, hard-working people trying to cure various forms of cancer.  I hope we see breakthroughs--and I'd love to see NVDA contribute to them--and it would be a great thing for humanity to cure the diseases that have taken so many human lives.", "score": 2, "replies": []}, {"body": "With your logic, AMD is a much better deal. ", "score": 2, "replies": []}, {"body": "Just sold my position.  Thank you!!", "score": 1, "replies": []}, {"body": "It's soul-stirring and at the same time causes a deep respect. Thank you for it. And let the stocks realize such our dreams and desires faster.", "score": 1, "replies": []}, {"body": "PE is huge, but I mean who cares, the reality is that people don't really care about pe ratio in tech stocks. ", "score": 1, "replies": []}]}
{"title": "A$M$D Price Leaks in /r/AMD", "selftext": "[deleted]", "id": "5swuas", "created_utc": 1486601513.0, "score": 55, "upvote_ratio": 0.93, "num_comments": 25, "comments": [{"body": "Why the fuck did they leak before NVDA earnings, I want the cake and to eat it too", "score": 19, "replies": [{"body": "the Intel stunt from earlier?\n\n[Intel Trump love fest]\n(https://twitter.com/realDonaldTrump/status/829410107406614534)", "score": 9, "replies": []}]}, {"body": "Saw this too, was leaked way earlier in the day might be why amd held aside from nvda earnings.", "score": 7, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "I just want another dip sub 13 so i can go large and hard", "score": 7, "replies": [{"body": "Go large now so you don't miss it. Add more if it dips, you'll kick yourself if you miss the jump", "score": 2, "replies": [{"body": "Im not too worried about it if it jumps off this it will pull back closer to launch pr consolidate then its gunna either tank or sky rocket again depending on ryzen benchmarks. Also still have until q2 or q3 for financials in which will be anotber catalyst", "score": 1, "replies": []}]}]}]}]}, {"body": "just in case it disappears . . . http://archive.is/bU5vP", "score": 7, "replies": []}, {"body": "The next aapl right here. Get your yachts fellas", "score": 7, "replies": [{"body": "Already started lookin at marinas", "score": 2, "replies": []}]}, {"body": "Sooooo buy amd? ", "score": 4, "replies": []}, {"body": "I wonder if these are the legits price. Seems insane.", "score": 3, "replies": [{"body": "better fucking be because I bought 2k shares after this post", "score": 3, "replies": []}]}, {"body": "Intel is F U C K E D this year. And next. Hey Intel fags, hope those modems work out! Oh wait, your modems suck too!\n\nFeelsGoodMan", "score": 3, "replies": []}, {"body": "Wait so what is a good price haha ", "score": 2, "replies": [{"body": "People thought that AMD would price ryzen at least 500, so if its sub 400 that's insane ", "score": 11, "replies": [{"body": "honestly if it only out-performs the 6600k and 7700k by small margins then the 365 dollar price is exactly competitive. \n\nand if it doesn't outperform the 6600k and 7700k in benchmarks then gg amd i don't see myself buying it lol go fuck yourself for making shitty comp procs again amd ahahaha\n\nalso, i don't give a shit about 8 cores, the 1800x will prolly lose in single core performance benchmarks. 7700k will prolly still be better for gamin, but it won't matter because everyone bottlenecks at the lack of a good 4k graphics card these days. ", "score": 1, "replies": []}]}]}, {"body": "Fuck if this is real. Buy fucking more amd stat. ", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Skylake is 4 core. These are 8 core cpus. Performance wise, they'd be comparable to this.\n\nhttps://www.newegg.com/Product/Product.aspx?Item=N82E16819117645", "score": 9, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "Except these are actual cores not that Bulldozer crap. ", "score": 17, "replies": []}, {"body": "That's because bulldozer cores aren't actual cpu cores, they're more like alu clusters. To keep this from being too confusing,it's better to say that, basically, one bulldozer core > 1/2 actual cpu core. As for 6 cores vs 4 cores in general, that really depends on the applications. For workstations, you definitely want more cores. For games....it depends. \n\nIt used to be, cpus with more cores would perform worse in games. This isn't because adding more cores hurts the cpus ipc (instructions per cycle) or anything, it's just because more cores = more heat = higher clock speeds. But if you took, for ex, a 4 core cpu and an 8 core cpu on the same architecture, and ran them both in a game that didn't use more than 4 threads, both cpus would perform exactly the same.  \n\nNow that that's out of the way, it really depends on the game. Older games aren't well threaded, so the generally scale better with clock speeds (again, assuming the 2 cpus in question have similar ipc) than thread count.  That's not the case with newer games, though. Multicore cpus are becoming mainstream and games are starting to adjust to that. DX12 and vulcan actually scale extremely well with thread counts. but, it's better to show than to tell so, here's a comparison of a 6800k clocked at 4.3ghz and a 7700k clocked at 5ghz. Keep in mind that this is 1080p, where the cpu is going to be more of a bottleneck. \n\nhttps://youtu.be/VdVc8APD0ts\n\nSo what you're seeing is that despite Kabylake's ipc being 5% higher than broadwell's, and the 7700k being clocked at 5ghz, the 6800k is still able to keep up with it. \n\nHere's another one comparing the 6900k to the 6700k, keep in mind that they're both at stock frequencies, so the 6900k is at 3.2ghz while the 6700k is at 4.2. Despite the 1ghz difference, the 6900ok is still able to keep up with the 6700k in the games they tested in. \nhttps://www.youtube.com/watch?v=Vw5efX9zAds\n\nSaying cores don't matter in games might have been accurate a few years ago, but that isn't really the case now. ", "score": 6, "replies": [{"body": "for video games it's going to be all about that 4k gamin and right now the bottleneck is at the GPU and not CPU and nvidia is going to price gouge the fuck out of 4k cards making their stock shoot up to 200 and i wont buy their card because i am morally opposed to spending over 200 dollars on a graphics card but i'll buy their stock...\n\n\nanyways procs really don't matter as much right now, but moving forward more cores def will help", "score": 3, "replies": [{"body": "Personally, I don't see a point in 4k gaming. I like having 100+fps and right now, no gpu can do that in 4k so I prefer 1440p. \n", "score": 3, "replies": [{"body": "i just play in 1080p, 144hz works fine for me lol but cs i play at 1024 reso like it's 1996 or some wack shit", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "This is the most recent 8 core they've made, and there's only a 5% ipc dif between Broadwell and Kabylake.", "score": 4, "replies": [{"body": "78xx and 79xx will be Skylake-E, not Kabylake based. The enthusiast platform lags behind by one generation but uses the current generation's model number (for some weird fucking reason?).", "score": 3, "replies": []}]}]}]}]}]}
{"title": "Tsla up $10 to $272 premarket. Feels so good when you get the conviction buys right", "selftext": "[deleted]", "id": "5szh4c", "created_utc": 1486639530.0, "score": 46, "upvote_ratio": 0.86, "num_comments": 38, "comments": [{"body": "I was holding 100 shares and selling weekly covered calls in December. I let it get called away right before it started to run. Feels bad.", "score": 16, "replies": [{"body": "I know that feeling. I accidentally sold 32 shares of TSLA at 192 because I'm a dumbass and used a limit sell instead of a stoploss. It then proceeded to skyrocket :(", "score": 13, "replies": [{"body": "It will come back. Look at the 5 year chart.", "score": 0, "replies": [{"body": "Tesla is not the same company that it was 5 years ago ", "score": 19, "replies": [{"body": "[deleted]", "score": -6, "replies": [{"body": "Did I say that? Fuck off", "score": 6, "replies": [{"body": "Well it's been on a bull run for months it will come back down not THAT much has changed. The stock has run up and come down 3 or 4 times. Look at the 5 year chart. It will not hold these levels.", "score": 0, "replies": [{"body": "My point- you are looking at the 5 year chart of a different company", "score": 4, "replies": [{"body": "I have 2 model 3 ordered and hold stock. I love this company. But it's stock will fall. It's only February give it time.", "score": 0, "replies": [{"body": "I'm jealous ", "score": 7, "replies": []}]}]}]}]}]}]}]}]}, {"body": "I dumped mine when it hit 250, figured that was tops. Oh well, it will drop like normal and then it's back to weekly.", "score": 1, "replies": []}]}, {"body": "**TESLA IS ABOUT TO BLOW THE ROOF OFF THIS FUCKER BOYS. SNORT LINES AND BUY BUY BUY**", "score": 11, "replies": []}, {"body": "see if you still feel that way after earnings. ", "score": 22, "replies": [{"body": "TSLA always misses earnings and then goes up. ", "score": 6, "replies": [{"body": "yes, but since their last earnings were so good, the narrative around might or has changed. Of course the whole thing was via account chenigans, but regardless. If they dissapoint now, there will be blood.", "score": 2, "replies": []}]}]}, {"body": "Well I bought SCTY when it was at $80ish a share then the market fell out.  Now that the shares are converted to TSLA I am down 66%.  The TSLA needs to hit $788/share for me to break even.", "score": 9, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Right, I didn't have enough funds at the time for doing an average down. ", "score": 2, "replies": []}]}, {"body": "What.the.fuck. Thats some illuminati bullshit right there my dude.", "score": 1, "replies": []}, {"body": "Ouch. I bought SCTY at mid $50s/share, so I know how that feels. When I got the share swap, TD Ameritrade shows a handful of shares \"bought\" at something like $522/share. ", "score": 1, "replies": []}, {"body": "That's literally not possible since $TSLA is at all time highs. There is nobody who is long a loss on TSLA so check yo'self", "score": -1, "replies": [{"body": "ATH is 291.42 in sep 2014....", "score": 3, "replies": []}, {"body": "Literally not possible huh?  So you are saying SCTY was not $86 a share a few years back, and you are also saying that when TSLA bought SCTY and combined companies that they didnt do a stock conversion for X of SCTY you get Y of TSLA?", "score": 1, "replies": [{"body": "I suppose you could've been long on a loss on SCTY at the time it was acquired, your broker transferred that basis into TSLA, and the subsequent gains (since it's at ATH) haven't yet offset those losses from the earlier ticker. My apologies, it is _technically_ possible.\n\nEDIT: Nobody who bought the ticker $TSLA is long on a loss right now. ", "score": 2, "replies": []}, {"body": "Here is my proof, I have checked myself...now time to break youself fool! (Loved Friday) https://i.imgur.com/MuJ9sDm.png", "score": 1, "replies": [{"body": "Now my math jives better, I remember having 44 shares.  The conversion was 1 SCTY = 0.11 TSLA, so that had a partial .84 of TSLA left over that just cashed out, leaving a whole share number of 4.", "score": 1, "replies": []}]}]}]}]}, {"body": "When someone here said to get it while it was under $200, I should have listened.", "score": 7, "replies": []}, {"body": "$272 ...  \nThe insanity of this stock.", "score": 11, "replies": [{"body": "It's market cap is just shy of GM's. It's bullshit.", "score": 6, "replies": [{"body": "Its not really a car company anymore...", "score": 10, "replies": []}, {"body": "Bullshit or is it the next Apple?", "score": 6, "replies": []}, {"body": "[deleted]", "score": 9, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Well like half...", "score": 17, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "Some would argue nearly half is pretty far off", "score": 9, "replies": [{"body": "Other half coming after keynote 2 when they show more than just the exterior of the car and people said \"ooohhh prettyyyy\"", "score": 2, "replies": []}]}, {"body": "Is this going to be a one year sales for TSLA? There is no way they are going to produce 500k 3s in a year.", "score": 2, "replies": []}]}]}, {"body": "bingo", "score": 2, "replies": []}]}]}]}, {"body": "Tesla is going to have a larger market cap than apple in the future. More revenue and profit too. You heard it here first folks", "score": 2, "replies": []}, {"body": "Would've been better off with $BANC.", "score": 1, "replies": []}]}
{"title": "Who else is yoloing NVDA to Valhalla?", "selftext": "I was going to sell a few profitable calls I had today as I'm currently up around 30% overall, and then decided fuck it... let's do degenerate gambling the right way.\n\nWho else is with me and prepared to watch their wallet fly off into the sun and either burn away in flames or reach the heavens?\n\nEdit: BURNING ALIVE IT IS!!!! Rejoice, brothers, for there is glory in death.\n\nAlso I pussied out and sold my calls at the bell, though I'm bag holding 60 shares.", "id": "5t2mei", "created_utc": 1486672419.0, "score": 32, "upvote_ratio": 0.82, "num_comments": 32, "comments": [{"body": "I like this little pre-earnings drop today.  Standard NVDA.  Small dip on earnings day, then a massive jump the next day.  Let's hope that trend continues.", "score": 14, "replies": [{"body": "Only if they beat and guide well. I doubt they will miss as Nvidia's conservative with their guidance, but guidance is key. ", "score": 6, "replies": [{"body": "Not just beat - it's going to need to be a decisive beat, with strong gross margin.  ", "score": 6, "replies": [{"body": "Looks like people are dumping their shares close to the close. ", "score": 4, "replies": [{"body": "Pretty standard with earnings for just about every company, not surprised a lot of people are getting out on this one which stands to be kind of bonkers.\n\nOnly gamblers and serious longs are in NVDA at this point. Anyone playing safe is out.", "score": 4, "replies": [{"body": "> gamblers\n\n\nSo all of us then?", "score": 4, "replies": []}, {"body": "NVDA closed at $116.38, let's see what happens in thirty minutes or so...", "score": 2, "replies": [{"body": "lol", "score": 1, "replies": []}]}]}]}, {"body": "It will. It will be YUGE.", "score": 1, "replies": [{"body": "For your sake and mine, I hope it's a huge beat lol. But I have a habit of jinxing companies that are going into earnings. ", "score": 2, "replies": [{"body": "I like your posts rim but this is some autistic shit.", "score": 3, "replies": [{"body": "''tism works in mysterious ways", "score": 2, "replies": []}, {"body": "I wish I was autistic. That might make me a better trader lol. ", "score": 1, "replies": []}]}, {"body": "I'm only in $2300. Sucks to lose it, but not the end of the world.", "score": 1, "replies": []}]}]}]}]}, {"body": "these guys are so quick on the trigger. fucking weak ass hands. \n\nI got my grip strength from bitcoin... and possibly pornhub. ", "score": 2, "replies": []}]}, {"body": "holding 459 shares @ 109. fuck it lets yolo. ", "score": 5, "replies": []}, {"body": "68% of my portfolio. Yolo!  \nhttps://i.imgur.com/OeyQH4B.png", "score": 7, "replies": [{"body": "RIP", "score": 5, "replies": []}, {"body": "sorry dude\n\nedit tho same here x_x all my monies...", "score": 1, "replies": []}]}, {"body": "to the moon", "score": 3, "replies": []}, {"body": "Sold some puts earlier this week... getting close to the $110 strike...", "score": 1, "replies": []}, {"body": "I'm bagholding my profitable calls too.  So I will join your earnings support group in an hour or so.  ", "score": 1, "replies": [{"body": "I feel we're fucked... but I'm not sure I care yet.", "score": 3, "replies": [{"body": "Everyone feels fucked every time earnings gets closer. Especially if it's something they have a stake in. ", "score": 3, "replies": []}, {"body": "Me too, but I don't know why I feel that way.  Who knows how the fuck the market is going to react.  I can't imagine NVDA misses, but if that were to happen . . . Jesus Christ . . . this thing is going to bleed for days.", "score": 2, "replies": []}]}]}, {"body": "http://imgur.com/JbFAuXv", "score": 1, "replies": [{"body": "Nice nice, balls of steel. I might pick up March calls tomorrow, actually. You're gonna stick with those?", "score": 1, "replies": [{"body": "I'm thinking of buying back the 2 call spreads and maybe the 100/105 put spread tomorrow and hanging on to the 110/115 for a few weeks.", "score": 1, "replies": [{"body": "for better or for worse I picked up some 115 March 3 calls today.\n\nAbout 30m after I put in the limit order, I had this \"oh fuck why did I do that\" moment and went to cancel it - already filled.\n\nAnyway I'll probably try to unload ASAP, meaning if they're ITM next week I'm gonna cash out. I think there's a high likelihood we haven't seen bottom yet and any spikes for now could be very temporary on the way down. I'll wait for the dust to settle to commit more.", "score": 1, "replies": [{"body": "I got greedy, rolled the call spread down for a nice credit. Hope i can finish over 115 too lol.", "score": 1, "replies": []}]}]}]}]}, {"body": "70+% of my portfolio - 50 shares @ 109.78\nRest is 65 shares of JNUG bagholding and 100 shares of AMD @ 13.50", "score": 1, "replies": []}]}
{"title": "$NVDA cry thread", "selftext": ":'(\n\nedit: At least we aren't this guy https://www.reddit.com/r/wallstreetbets/comments/5t39mh/nvda_cry_thread/?st=iyyyeev0&sh=ef2f9f47", "id": "5t39mh", "created_utc": 1486678623.0, "score": 2, "upvote_ratio": 0.55, "num_comments": 30, "comments": [{"body": "Crying about NVDA during this dip is like crying when you come to a red light at a busy intersection.", "score": 26, "replies": [{"body": "Those roll backs are scary shit!", "score": 5, "replies": []}, {"body": "Poignant", "score": 1, "replies": []}]}, {"body": "Time to go out and buy a comfy suitcase cuz ima be bagholding this bitch till it hits 150.", "score": 11, "replies": [{"body": "same, the stock should be going up in the future.", "score": 6, "replies": [{"body": "I really hope so, I took out a third mortgage on my condo and rented my eldest daughter out to afford a few more shares of this.\n\nReally hope it wasn't all for naught. ", "score": 10, "replies": [{"body": "What are her rates?", "score": 18, "replies": [{"body": "1 share per hour, you pick the stock", "score": 2, "replies": [{"body": "SUNEQ, i'll buy her for the next year plz", "score": 7, "replies": []}]}]}]}]}]}, {"body": "Cry me a fucking river.  I am bagholding NVDA calls and I feel better than ever about the company.  20% EPS beat, coming off a 30% EPS beat last quarter?  Yeah, I think I'll take that.  \n\nNVDA is heading to $150.", "score": 10, "replies": [{"body": "yeah i am expecting positive movement this quarter\n\ni'm thinking 25% NVDA 75% SOXL for Q1", "score": 1, "replies": [{"body": "Thanks for reminding me my SOXL is also down almost 3% today :\"(", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "i dunno how to trade soxl and smh/sox with calls. They aren't like other the securities. The bid/ask spreads are huge. ", "score": 1, "replies": []}]}]}]}, {"body": "I'd look at FB as a lesson here.\n\nIt traded relatively flat, then down slightly after a nice earnings beat and reasonable guidance.\n\nThen the following days it has gone up roughly 3% and is on an upswing.\n\nNVDA reported great earnings, buy calls tomorrow that are a week or two out if this shit stays down. It'll bounce back.", "score": 3, "replies": [{"body": "> I'd look at FB as a lesson here.\n> \n\nThe earnings were already priced in.  Note the cost went up to $5.35 for ATM calls. That meant IV predicted a $5 move.  Look what the stock did, it retreated $5 from ATH and then earnings.  This means **earnings were already priced in**.  \n\nWell, b_coin, you retarted fuckdog, why the hell did the stock drop?  Because the market reacted to forward guidance.  They had a hell of a quarter that's not going to be repeated.  So the IV crushed both long and short option holders.  The only winners are the writers of contracts and stock holders.  \n\n#This is why you don't play binary events without understanding what's going on behind them ", "score": 3, "replies": [{"body": "We'll see if your theory holds up & the stock stays completely flat for the next week or so. \n\nOtherwise I guess you're just as dumb as the rest of us.", "score": 1, "replies": [{"body": "i wouldn't say completely flat.  it could rise to 120 or drop back to 112, but to profit you would need to purchase options tomorrow after IV has reduced significantly.  there is a very little chance that your options contracts opened before ER will be profitable\n\nEDIT: market makers aren't in this to give you free money, they're the house and you are gambling against them during earnings.  unless you open well in advance or the stock moves unnaturally due to earnings surprise (see GILD as an example), the house is always going to win", "score": 2, "replies": [{"body": "Isn't all significance psychological?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}, {"body": "Gotta push the earnings players out. Not to mention the options. ", "score": 2, "replies": []}, {"body": "This. My calls expire March 3. I gave myself time for this reason. It is down 1% in after hours. 1% is nothing.", "score": 1, "replies": [{"body": "Calls don't show true value until the market opens next day.. Better pull up a chair, cuz you're about to get knocked.", "score": 2, "replies": [{"body": "lol it's not magic, his calls are far enough out that they will hardly be affected by theta. Whatever they were worth at close, they'll be worth $1-2 or so less each at open tomorrow.", "score": 2, "replies": []}, {"body": "Oh no, my 2 grand investment will be wiped out (it won't). On the recent drop from $118.50 to 116.50, my calls went down $200. \n\n#PLUS, NVDA IS GREEN .5% IN AFTER HOURS. ", "score": 2, "replies": [{"body": "120 tomorrow, let's fucking do it.\n\nGIVE NVDA OUR ENERGY", "score": 7, "replies": [{"body": "I'm wit you fam\n\n/raises hands toward sky", "score": 2, "replies": []}]}, {"body": "Awwwww yissssss.. sorry bud if I sounded like an asshole. I'm holding 250 shares.. 😂😂", "score": 1, "replies": []}]}]}]}, {"body": "Fukkin snitch\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Is it going up or down?!? I need my yacht ", "score": 1, "replies": []}, {"body": "I hope you fuckers had the ability to buy AH, you will not see 108 again for some time", "score": 1, "replies": []}, {"body": "We are going to the moon!", "score": 1, "replies": []}]}
