{"title": "AMZN Earnings Play", "selftext": "What is everyone doing for AMZN earnings? I'm thinking to sell the 785/790/880/875 IC to be on the safe side. \n\nIs the premium high enough to do something like an Iron butterfly? ", "id": "5rod0h", "created_utc": 1486058780.0, "score": 14, "upvote_ratio": 1.0, "num_comments": 36, "comments": [{"body": "Good luck, I did a 785/800/885/900 iron condor @ $4.88", "score": 3, "replies": [{"body": "I sold a put spread close to your puts. 792.5/800. Collected about $1.50 (should have waited until later in the day, could have collected more credit) so risking 5 to make 1, but with almost an 80% POP.\n\nEdit: lets hope it opens up tomorrow.", "score": 3, "replies": [{"body": "Ya. Got a feeling the big boys are gonna keep it at least above 800", "score": 1, "replies": [{"body": "I hope you're right. BTFD has been the mantra this year so let's hope it plays out here.", "score": 1, "replies": [{"body": "how do you plan on protecting yourself if it goes lower than your long put? ", "score": 1, "replies": [{"body": "I'll probably look to manage early and either take the profit or loss quickly because this was a pure earnings play (since there hasn't been much going on). I'm not going to try to defend it, which is why I used defined risk. Right now its still above my short strike so I'm ok and all the IV will have come out of it so I'm keeping my fingers crossed that it pins where it's trading now or goes up a little bit at the open.", "score": 1, "replies": [{"body": "I think that's very smart, no use chasing a falling knife. ", "score": 1, "replies": [{"body": "Ended up closing at the open for $15 profit. Didn't have the cojones to stay in it while the price was jumping between $805-$810.", "score": 1, "replies": [{"body": "smart move, these things could go any way and it's better to make lunch money than lose $$$. Congrats...until next week's gains. ", "score": 1, "replies": [{"body": "Thanks!", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "For what day? A feb 10 or later?", "score": 2, "replies": [{"body": "Feb 3, tomorrow", "score": 1, "replies": [{"body": "Im pretty new to options, so basically ur playing the volatility of tmrw with the volatility crush u make the difference assuming it lands in therd", "score": 1, "replies": [{"body": "Yeah as long as AMZN doesn't hit 800 or 885 the entire value of the iron condor will basically go to zero because there will only be one day left", "score": 1, "replies": [{"body": "And you keep the entire premium?", "score": 1, "replies": [{"body": "Also wheb it comes to closing out if it doesnt gp under 800 or above 885 does this mean everything expires worthless and u dont need to worry about closing anything out?", "score": 1, "replies": [{"body": "Yeah you get the premium deposited in your account up front when you first sell it. If it expires worthless you keep the money and the broker just removes the options from your account. ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "What does \"did\" mean? Buying or selling?", "score": 1, "replies": [{"body": "Selling", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I was too scared to get that close with my puts, good luck to you", "score": 3, "replies": []}, {"body": "too close with those puts man. Good luck to you", "score": 2, "replies": []}, {"body": "ouch", "score": 2, "replies": []}]}]}, {"body": "I ended up selling the 795/800/875/880. Good luck everyone. ", "score": 3, "replies": []}, {"body": "selling the 795/800 put spread!", "score": 2, "replies": [{"body": "fack!", "score": 2, "replies": [{"body": "What's your plan for damage control?", "score": 2, "replies": [{"body": "Going to see if it's possible to roll for a credit with 15-30-DTE. If it blows past my long put, might just have to take it on the chin", "score": 2, "replies": [{"body": "Good luck!", "score": 1, "replies": []}, {"body": "$802 after hours.  There's usually overreaction in AH and the first 2-3 hours of trading, but I think it comes back by lunchtime Eastern time.  ", "score": 1, "replies": [{"body": "Back to 830? Idk goog didnt seem to come back", "score": 1, "replies": [{"body": "No, I meant it would bounce back off $802, staying high enough for him to profit on his $795/800 put spread.  It's back to $805 AH now.", "score": 1, "replies": [{"body": "If the underlying went below his long put, is there any way to roll out further? In other words, let's say you sold a spread that went south do you just take that hit, or roll out and hope next week will be better? ", "score": 1, "replies": [{"body": "Yes, you can just take your lumps and close out your spread. Depending on your strikes, it might not be huge losses and the long put limits your total losses. You can roll it, but the IV will be lower after earnings and less favorable to another credit spread.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Went with 790/795 - 885/890.", "score": 1, "replies": []}, {"body": "745/705 puts.  Originally 735/705, rolled up to 745.  If all goes well $5.35 total ", "score": 1, "replies": []}, {"body": "I bought the GOOG 805 straddle early in the day for $9.  AMZN averages 6.5% move on earnings, guessing 4-5% is safe bet in which case GOOG should move 1%, that will almost cover my straddle.  If AMZN tanks, I think GOOG will too.  Either way, 17 vol in GOOG is cheap, fair to it's 10 and 100d realized.", "score": 1, "replies": []}]}
{"title": "$AMZN", "selftext": "F**king company is putting other brick & Mortars out of biz. You think they going to fail on earnings? LMAO. $900+ By Tom.", "id": "5rn4ts", "created_utc": 1486046688.0, "score": 8, "upvote_ratio": 0.67, "num_comments": 41, "comments": [{"body": "They won't meet earnings expectations because they are reinvesting their profits for continued dominance. Wall Street can be fickle so it's going to be interesting to see if investors keep gladly footing the bill of big Amazon spending.", "score": 14, "replies": [{"body": "Wall street puts more clout into the future of a company than it does current earnings. Amazon spending to increase it's future earnings potential is a good thing for the stock.", "score": 5, "replies": [{"body": "As seen by last earnings, Wall Street is now expecting Amazon to meet EPS numbers. I just don't see how they can do they with the increase in spending and having to cut AWS prices due to competition from Microsoft. I love the future of Amazon as a company but I think expectations on Wall Street have changed ever since they posted a surprise profit a year ago.", "score": 0, "replies": []}]}, {"body": "Please educate me. What exactly is Amazon investing in with their profits? I don't see anything they are 'building' with their so called lost profits.  I look at their balance sheet and I don't see any massive upgrades in assets.", "score": -1, "replies": [{"body": "Well they just announced a $1.5B cargo hub in Kentucky, so...", "score": 3, "replies": []}, {"body": "Distribution centers as always. It's what allows them deliver packages in 2 days and now within hours. And now since they are expanding their video market, they have to spend money on content to keep up with Netflix. And as someone has already stated, their $1.5B cargo hub.", "score": 3, "replies": [{"body": "But the thing about distribution centers is the entire amount is not expensed right away.  Most of these capital assets are depreciated over 30 years. So they should only make a small impact on profits. Amazon is making tiny profits not because of investments in distribution centers (cause they are expensed over 30 years) but rather pricing items at below cost.", "score": 1, "replies": []}]}, {"body": "They also build new data centers this year like the one in Montreal.  Additionally, they invest in research and develop for new products like the echo a few years ago and more recently, Amazon GO.  Amazon's fingers are in so many pies that there are a lot of places for them to invest.", "score": 1, "replies": [{"body": "Yes they built new data centers. But most of that expense is amortized and depreciated over its useful life = 20-30 years. And very soon they need to upgrade those same centers. Its a cost of business for cloud. Echo is a good product. But did that really take $10 billion in R&D to make?", "score": 1, "replies": [{"body": "Good point about the amortization.  I think the point I'm trying to get across is that amazon isn't really a one product company.  It's not like Facebook.  Amazon has tons of products - aws, aiv, kindle, go, fba, maybe this new logistics system they are setting up, ad network, e-commerce and many more.  Of those, many require large upfront investments or have high operating costs.  Many are not available globally so expanding to larger markets is expensive.  \n\nAnd the way they seem to roll out new products appears to me to be very expensive.  The products usually have gapping holes that are plugged by things like manual labour or low (or even negative margins) with the hopes that once they are successful, the bottom line will go down.  They aren't spending 10 billion on just echo but on many different things and it seems reasonable to me that those opportunities are expensive ( given Amazon's history)", "score": 1, "replies": []}]}]}]}, {"body": "I almost bought amazon yesterday, but no dividends. Not sexy enough for long term investors. But I have no doubt they will continue to be a powerhouse.", "score": -6, "replies": [{"body": "What? A stock that's up over 50% in the last year isn't sexy enough because it doesn't give you a 1.5% dividend? lol", "score": 15, "replies": [{"body": "Past success (50% up last year) does not guarantee future success.", "score": 1, "replies": [{"body": "Past growth is the best indicator of future growth. \n\nIt doesn't guarantee anything though, of course, but they have proven themselves in the past. That is the ONLY solid indicator we have.", "score": 1, "replies": []}]}]}, {"body": "growth monsters on the scale of amazon typically will not. bezo's will throw money at anything before giving it back to investors. he's better at spending it.", "score": 3, "replies": []}]}]}, {"body": "I don't know about trading earnings on AMZN, just buy that shit and hold it.", "score": 4, "replies": [{"body": "Agreed, but I sure would love grabbing more on a market correction. ", "score": 2, "replies": []}]}, {"body": "🔥😩😩😩😩😩🔥(I'm ok)", "score": 3, "replies": []}, {"body": "yo did you check after hours lol. nice call.", "score": 2, "replies": [{"body": "Lol, he ordered a box of tissues with same day delivery. ", "score": 3, "replies": []}]}, {"body": "I just can't understand why you guys still buying that shit. 200 PE! Even MSFT tripled their stock over the past 3 years. The only reason Amzn stock looks good is the whole IT industry is doing well. Looking for other stocks, you already missed Nvidia in 2016, stop buying shitty Amzn stock", "score": 2, "replies": []}, {"body": "Looks like OP feel for the Amazon scam.\n\nIf you are not making nice profits you better grow revenue more than 22%. ", "score": 2, "replies": []}, {"body": "I'm thinking the stock will react kinda like FB just did. Up 2% after hours, down 1% tomorrow. Fairly flat. Hold long.", "score": 1, "replies": []}, {"body": "I'm not sure what to make of the high expectations. Will the stock go up after the Earnings Report?", "score": 1, "replies": [{"body": "4% either way ", "score": 3, "replies": [{"body": "legend", "score": 3, "replies": [{"body": "shit", "score": 3, "replies": []}, {"body": "😂😂😂", "score": 1, "replies": []}]}]}]}, {"body": "In my opinion, the crazy thing about Amazon is that they have easily got the market dominance to start tweaking prices here and there to increase their margins now. I would hazard that most prime customers would even pay a small premium (maybe 5%) to be buying through prime with known delivery charge ($0) and scheduling, versus buying through the vendor direct or through other sites.\n\nI'm very surprised that they haven't started tweaking things yet to this extent, though I think that the 3rd party vendor showcase model that they have makes this practice more difficult.  I wouldn't be surprised to see Amazon start curtailing their external vendor listings soon in favour of Amazon origination (so they can start exploiting the margin opportunity).\n\nWith their volumes, very small changes can make a huge impact.", "score": 1, "replies": [{"body": "> In my opinion, the crazy thing about Amazon is that they have easily got the market dominance to start tweaking prices here and there to increase their margins now.\n\nThat's not necessarily true with walmart waiting and argubly #1 at operating on low margins.\n\n", "score": 0, "replies": [{"body": "Well... walmart eCommerce sales are approx 15% the size of Amazon (as of August '16), though they may still open up the market significantly. I have noticed them doing some smart things like moving their pickup @ store for online orders to the front of the store recently locally to me.\n\nI still think that the sheer market dominance and brand power of prime (plus the absolute ease of ordering through Amazon) gives it a tacit advantage when it comes to selling, within a small price window to even command a premium.\n\n\nOne challenge Walmart may have is that for groceries they have a poor quality reputation, and that may hurt them a bit in the expanding online grocery order space.\n", "score": 1, "replies": [{"body": "Walmart is also offering FREE 2-DAY shipping on 2 million products WITHOUT an annual fee.\n\nWatch out. The competition for Amazon is getting hot", "score": 1, "replies": [{"body": "Came here to say the same thing. If walmart modernizes their website to be more user friendly and use their physical stores for free 2 day shipping, they can dent amazon in a huge way.\n\nMy main problem with walmart right now is their shitty website, but walmart has amazing deals. ", "score": 0, "replies": []}]}, {"body": "I'm not sure how viable the online grocery space is tbh. There is a huge premium on \"fresh groceries\" and an even larger premium on \"delivered fresh groceries.\"\n\nFor this discussion we'll just talk about non-food items but you're right in that amazon does have some room for a premium but walmart will easily be willing to offer deals/cheaper prices if amazon gives them the opportunity to steal customer base.", "score": 0, "replies": []}]}]}]}, {"body": "Are you crying yet?", "score": 1, "replies": [{"body": "$40 down is not the end of the world 😒", "score": 1, "replies": []}]}, {"body": "$AMZN up $9 from yesterday's after hours close and premarket hasn't even opened yet for most", "score": 1, "replies": []}, {"body": "Up over 960 just now (afterhours).", "score": 1, "replies": []}, {"body": "Oof wow.  AWS under and 2.25% miss.  This might get a little ugly short term.  Probably down 7-10% from pre-earnings in a week or so, then I would normally pounce but to be honest these numbers were not encouraging even with every thing they have going on for the future.  Hmmmm, might wait another quarter..", "score": 1, "replies": [{"body": "Meh", "score": 0, "replies": []}]}]}
{"title": "Big Money GOYOLOPRO", "selftext": "[deleted]", "id": "5rlagi", "created_utc": 1486017704.0, "score": 29, "upvote_ratio": 0.78, "num_comments": 27, "comments": [{"body": "Gopros only saving grace was supposed to be their drone and that has been a complete failure with its recall and everything. The action sports cam market is flooded with GoPro copies that are finally actually really good and cheaper. GoPro hasn't brought out a response to this so I predict a huge loss. Their only saving grace is their brand recognition but that doesn't seem to be paying the bills.", "score": 10, "replies": [{"body": "Karma was recalled and Autist Nick Woodman said they'll do more drones. Most overrated CEO on Wall Street ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "But they're not buying the new models as they release like people do with the iPhone. A lot of those people are using the same GoPro they bought 4 years ago.", "score": 4, "replies": []}]}, {"body": "Is anybody really expecting a(nother) major sell-off post-earnings?", "score": 1, "replies": [{"body": "Not unless their earnings are way down tonight. Looks baked in at this point.", "score": 1, "replies": [{"body": "That's what I'm thinking.", "score": 1, "replies": []}]}, {"body": "sell puts?", "score": 1, "replies": []}]}, {"body": "I'm down. What's your option strategy?", "score": 1, "replies": [{"body": "[deleted]", "score": -11, "replies": [{"body": "lol\n\nbest just to leave man. or start learning", "score": 9, "replies": []}]}]}, {"body": "Karma released prior to ER now all light on the numbers ! Expecting a beat and really bullish over the coming year: avg 13, target 17. ", "score": 1, "replies": []}, {"body": "I bought 25 03 weekly $10 Puts.", "score": 1, "replies": []}, {"body": "I would probably stay away from this. Expectations are already low. ", "score": 1, "replies": []}, {"body": "Soooo looking at a $11.75 to $9.40 range post earnings. Chart showing overbought currently. I am bearish on them but I believe this earnings may be different. I honestly believe someone on the likes of FB or AAPL would be interested in acquiring them. That along with Blackrock increasing their position 1mil shares a few weeks ago. \nI am looking at $11 feb 17 calls", "score": 1, "replies": []}, {"body": "Low expectations could make a surprise (unlikely). I was on the GPRO wave about 6 months ago, but they're failing to execute everything in the pipeline properly. With the expectations, I'm thinking we see -15% (-20% if really bad Q)down. If a beat, and short, you better cover fast or you're gonna take Nick Woodman's throbbing cock straight up your ass.", "score": 1, "replies": []}, {"body": "Yup putting hard. Nick Woodman biggest Autist on Wall Street. 10.50 puts all the way ", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "they doubted me..\n\nthey said im fsc's alt...\n\nmuthafuckas betta know", "score": 4, "replies": []}]}, {"body": "Thanks for the idea! I bought puts after reading this post. GoPro is overpriced garbage and no one is buying Karma. I only wish I had bought more.\nEdit: Karma, not Mavic", "score": 1, "replies": [{"body": "Glad my advice could help, I didn't even have the capital available for this trade right now. I was strongly considering selling off some AMD to hop in on these short term gains but Lisa gets my nipples too hard I couldn't do it to her", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -11, "replies": [{"body": "You really think those Russian dashcam videos are filmed on fucking gopros? Do you realize how much $300 is to them? Go on amazon, look up dashcam, see the dozens available for $50? You ever heard of anecdotal evidence?", "score": 16, "replies": [{"body": "This whole post is anecdotal evidence. I feel like this is fsc's alt. I'm going to go buy some GoPro because people expect it to be terrible from anecdotal evidence which has been long calculated in. It won't be as bad and theyll go up, just like AAPL.", "score": 3, "replies": [{"body": "Anecdotal or not, there is zero evidence they'll come up with anything resembling a strong quarter.", "score": 1, "replies": [{"body": "Which is why it's already down", "score": 2, "replies": [{"body": "Exactly", "score": 1, "replies": [{"body": "can i join the circlejerk\n\ndown 13% faggots", "score": 1, "replies": [{"body": "Back to high 8s by EOD I say!", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "What an autistic response.", "score": 2, "replies": []}]}]}
{"title": "Looks like China's new currency controls are going to crash the real estate market in Canada. What can we short? (HCG?)", "selftext": "[deleted]", "id": "5rnh3q", "created_utc": 1486050280.0, "score": 18, "upvote_ratio": 0.77, "num_comments": 26, "comments": [{"body": "FTFA:\n\n> Everyone knows China has capital controls, but most don’t know about China’s capital controls.\n\nDo you have to be an idiot to be a journalist these days?", "score": 22, "replies": [{"body": "Most of the journalist majors I knew in college were drunks", "score": 14, "replies": [{"body": "Everyone knows journalist majors are drunks, but most don't know about drunk journalist majors.", "score": 18, "replies": [{"body": "That's really insightful!", "score": 2, "replies": []}, {"body": "You have a bright future in this field", "score": 1, "replies": []}]}, {"body": "Like you were sober.", "score": 1, "replies": [{"body": "I only remember business 101 when I'm drunk", "score": 2, "replies": []}]}]}, {"body": "Ok, but granted you are misrepresenting the statement because you didn't include the italics around the second *know*. It says \n\n>Everyone knows China has capital controls, but most don’t *know* about China’s capital controls.", "score": 6, "replies": []}]}, {"body": "ITT: people think these chinks won't find a work around to keep the gravy flowing. \n\nHonestly, shit like small business regulations and taxes make a lot of international students want to go back instead of staying (cause the job market is shiieeettt). \n\ntl;dr: chinese ppl come here, buy all the real estate, buy all the fckin canada goose, and luxury handbags (who gives a fck). but dont take our jobs, usually not heavily dependent on the government like those french fcks. \n\nprotip: buy property surrounding those areas. upscale the community, sell it back to the chinese, ez profit, repeat ", "score": 13, "replies": [{"body": "I just thought it was funny that people don't care about gentrification when it happens to white people. ", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "??? you been to the GTA mate? ye the prices in vancouver spiked more, like an additional 15% over toronto in the last 5 year period, but its a small fckin place. \n\nin the gta, indians be doing it, koreans be doing it, chinese be doing it, persians be doing it, jews be doing it, italians be doing it. the gta is fcked, if you're getting out of school trying to buy a home; good luck next life. \n\nsince u seem to talk about government jobs as the main source of the steady jobs in the market, im assuming ur an ottawa fag (property is relatively cheaper, but ur better off living in Gatineau since moar subsidies im french huehuehue) or a disguised french fck (tell me the south shore in montreal hasnt gotta out of hand the past 10 years or so)", "score": 7, "replies": [{"body": "Yeah but the rest of Ontario is stable same with Quebec and New Brunswick and Nova Scotia, new found land etc.. plus you can't resell houses 10 times in between closing dates in Ontario unlike BC where you could until recently plus BC houses the highest amount of Chinese imigrants in Canada, to the point where there are complete Chinese neighbourhoods with Chinese street signs and its heavily documented by our government that Chinese are fucking around in BC, so they put in a 10,000 yearly tax for residents of BC who are foreign own property and do not live here. \n\nMy cousin just bought a gorgeous house in Nova Scotia on the ocean 2 years agoin ground pool, 3000 square feet $250,000. BC would be 1 mill plus easy. Easy", "score": 2, "replies": [{"body": "but its nova scotiaaaa :'(. 3000 square feet for 1mil? easily more. u cant even get a 60 year old run down bungalow in a good school area for less than 1.5-2mil ", "score": 3, "replies": [{"body": "See in Ottawa for that 250,000- 500,000 for a run down bungalo in a school area just depends on area. Real nice area would cost more but not a ton of real nice area's.", "score": 1, "replies": [{"body": "ye its called manotick", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Been looking into this for awhile but haven't come up with a reasonable strategy....", "score": 6, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "That's ridiculous. Go back to bed  ", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "there is almost no correlation to the real estate markets in Vancouver and the oil business in Alberta. \n\nThe reason for the increase in pricing over the past few years is limited supply, high demand and the loose regulations in real estate. Demand has slowed but the supply is limited so it's approaching an equilibrium. if anything, immigration to canada will increase with trumps actions so i don't see the market 'crashing' any time soon. If anything there will be a steady increase in value over a long-ish period of time. The geography is unique here so there is only so much real estate unlike toronto or wherever. Vancouver has the ocean to the west, mountains to the north and east, and the border to the south. Add in the ALR and you got yourself a mother fuckin recipe for real estate booms in the future. \n\nOh wait I forgot, this is wallstreebets....ummmm go fuck yrself buddy and buy some 3x leveraged etfs or something\n", "score": 2, "replies": [{"body": "Sorry I'm not trying to say they correlate It's more both could be a problem and both are to the west. Toronto is similar only in that it's built beside a great lake so they can only expand outwards from the lake, point being places like Ottawa won't crash as hard. We don't have huge money here but a large population here work for the government of Canada. Our property is also way cheaper than other major Canadian cities.I guess the reasoning in my head is if a crash were to happen The most highly effected would be Toronto, Montreal, Alberta and BC.\n", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Short maple syrup ", "score": 2, "replies": []}, {"body": "so how will this affect real coutries with real economies, not fake countries or alternative economies. \n\nlike THE great country with THE greatest people. AMERICA.\n\nthat's right USA is so big its bigger than both continents. its huge. So, will this affect the housing market here? the center of the universe? you tell me. ", "score": 4, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "Naw real estate isnt going to crash. There is a small correction happening. West coast Canada is way to desirable place to live. Good weather, low crime, oceans, mountains, clean water, US tech companies moving here also. I could go on. A few chinese might default or try to bring back money. But most will keep it safe overseas.", "score": 1, "replies": []}]}
{"title": "AMZN Bear Credit Spread Earnings Play for EZ MONEY", "selftext": "Here is my Amazon Earnings Play for cheap money fags\n\n\nBuy 1 $805 Strike Put for 635 dollars\n\nSell 1 $820 Strike Put for 1165 dollars\n\nAs long as Amazon stays above $820 I make 530 dollars. Worst case scenario Amazon falls below 805 and I lose 1500 dollars but gain my 530 dollars credit (so I lose 970 dollars). If Amazon stays around $815- I break-even.\n\nSeems like easy money, if Amazon drops less than 2%, stays flat, or goes up I gain $530 dollars per spread that I trade.", "id": "5rod7s", "created_utc": 1486058833.0, "score": 7, "upvote_ratio": 0.7, "num_comments": 31, "comments": [{"body": "[deleted]", "score": 14, "replies": [{"body": "Yeah my bad, should be a bull spread. ", "score": 3, "replies": []}]}, {"body": "Easy money is finding money on the street - this is not easy money.  Far from it.", "score": 8, "replies": [{"body": "I can lay in bed and eat hot cheetos doing this. Finding money in the street means I have to get out of bed. GL finding $500 in the street.", "score": 11, "replies": [{"body": "One time I found hot cheetos in the street", "score": 2, "replies": []}]}, {"body": "i think the odds of this paying off are better than the odds of finding money on the street. not even factoring in risk of mugging or carjacking.", "score": 3, "replies": []}]}, {"body": "So. Max loss?", "score": 5, "replies": [{"body": "Max loss :(", "score": 4, "replies": [{"body": "dang i almost hopped on board with u too. sorry mate, still like the idea.\n\ndoing a credit call spread as well and going further out might be more consistent. idk.\n\nlike this guy\n\nhttps://www.reddit.com/r/wallstreetbets/comments/5rpgir/amzn_earnings_thread_q4_eps_154_vs_135_est_q4/dd92ycw/?st=iyow1acy&sh=0b3e3522\n", "score": 1, "replies": [{"body": "I'm not too worried yet. With IV crush I might end up only losing a little, maybe nothing after the premium I made from it. We will see, I'll keep you guys posted tomorrow. ", "score": 1, "replies": [{"body": "you may break even. i could see it run up 10 on a good spy day/cc after the overreaction.\n\ni dont think so tho.\n\ni dont think you hit max loss either. all depends on futures. id be keeping an eye on trumps twitter all night. i would guess it closes 805 810 range.", "score": 1, "replies": []}]}]}]}]}, {"body": ">Seems like easy money, if Amazon drops less than 2%, stays flat, or goes up I gain $530 dollars per spread that I trade.\n\n2% is nothing.", "score": 3, "replies": [{"body": "You're nothing!", "score": 1, "replies": [{"body": "Ouch. Gl tomorrow", "score": 1, "replies": []}]}]}, {"body": "Is this FS's alt account?", "score": 2, "replies": [{"body": "No I didn't write a 6 page bullshit back story to my trade. ", "score": 8, "replies": []}, {"body": "hes doing 1 spread contract. not 10000 for wow $2 M PROFIT with 500 M MAX RISK OMG LOOK AT ME\n\nso probably not.", "score": 1, "replies": []}]}, {"body": "Since you're technically leaving yourself open to a lot of risk if it were to tank do you have to have a lot of money to be allowed to execute this trade with your broker?", "score": 2, "replies": [{"body": "I'm not leaving it to a lot of risk. If it tanks, I have bought a Put Option for 805 strike, meaning I can dump the shares for 805 regardless of how far it falls. \n\nMax loss is the difference in strike price (820-805)*100=1500. And then I still get the premium for selling (530) so max loss is really 970  ", "score": 3, "replies": [{"body": "Oh sweet, thanks for the explanation. \n\nDid you do this in addition to buying calls or did you decide to just go with this strategy since you get the credit regardless? ", "score": 1, "replies": [{"body": "Just this strategy because I think with IV crush, even if Amazon goes up, options are not a smart play. \n\nIf you buy 860 strike calls for 1,200 dollars, Amazon needs to go up to 872 before you start making any money off the trade. 32 dollars higher than where it is now. ", "score": 2, "replies": []}]}]}]}, {"body": "What expiration are you looking at", "score": 1, "replies": [{"body": "Tomorrow. ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Goodnight!\n\n", "score": 1, "replies": []}]}, {"body": "I was going to congratulate you on your gamble when I read \"Bear Credit Spread\" :(", "score": 1, "replies": [{"body": "Yeah it was actually a bull credit spread. Not too worried yet because I have IV crush on my side. Anything below 800 and I'm fucked", "score": 2, "replies": [{"body": "So not sleeping tonight I guess.", "score": 1, "replies": []}]}]}, {"body": "Doesn't this assume you have $80,000 cash backing each of these spreads?", "score": 0, "replies": [{"body": "No because I bought and sold one. Max loss is the difference", "score": 3, "replies": [{"body": "But what if it falls to 806 and you get assigned? Does your broker just lend you cash to buy it and then sell it immediately?", "score": 1, "replies": [{"body": "Yeah pretty much. It sells it immediately to pay the debt to them. ", "score": 2, "replies": []}]}]}]}]}
{"title": "2017 Macro Outlook", "selftext": "[deleted]", "id": "5rp3yu", "created_utc": 1486066068.0, "score": 26, "upvote_ratio": 0.84, "num_comments": 38, "comments": [{"body": "someone's volunteering to be the new FS Canadian.", "score": 17, "replies": [{"body": "Try inversing my suggestions. Please tell me how it works out.", "score": 2, "replies": [{"body": "such confidence ! :O", "score": 3, "replies": []}]}]}, {"body": "Isn't the Chinese government heavily subsidizing national companies?\n\nI am by far no expert, but I was thinking that the Trump policies and its latest faux pas with Australia is benefiting the Chinese. \n\nEdit: And wouldn't a weakened renminbi help Chinese exports?", "score": 3, "replies": [{"body": "The Chinese government is pressuring banks to lend to nationally subsidized companies. This is causing banks to engage in aggressive lending, which I believe will result in a crash. A weakened RMB would help Chinese exports, but in the next four years I believe that Trump will enact regulatory hurdles that will keep US capital out of China. This is why I talk about buying gold as a hedge. Forcing capital out of EM countries to bring back domestic jobs can only work for so long; It is only a matter of time before the USD begins to fall.", "score": 2, "replies": [{"body": "how about TPP and NAFTA? this could end in unfavorable deals later on and would only benefit China. \n\nAlso China has been ramping up on domestic growth. I mean look at VW and GM. their biggest market is China, not the US. Any trade restrictions or tariffs that Trump enacts against China will be a double edge sword.\n\nedit: I guess what I'm getting at is I'm considering betting the opposite and going long China by picking up long term positions in $FXI and $MCHI", "score": 1, "replies": []}]}]}, {"body": "I agree with your macro thesis for the most part.  China has experienced 2 flash crashes for which there is still no legitimate explanation.  The VIX over a long term perspective will certainly spike, based off of an event with China, or subprime auto loan debt, or medical debt in the US.  I definitely agree that the US or Emerging markets will experience a significant crash at some point in the next year or more, if there isn't a common sense correction to check the market first. \n\nSome criticisms.  In the absence of the TPP, I imagine a world in which the rest of the TPP nations continue forward with a version of the TPP that benefits them, while simply excluding the US.  What's your perspective of the long term view on EMs within the TPP arena, and other nations as well (south africa, India)?  I feel that emerging markets will be able to fill the TPP void if the crash is not purely originated in the China-USA trade relations.  What if the crash is originated from the US, and these EM countries are able to set up working partnerships that exclude the US.  There are plenty of other countries to sell goods to, outside of the United States. (Japan, Australia, NZ, Britain, Germany, France, UAE, Spain, Nordic countries, Canada, South korea) and there are plenty of emerging market countries to produce commodities and low cost/high quality labor in factories for tech work (China, Mexico, India, South Africa, Brazil, Indonesia and the Phillipines, Chile....many others).  In an alternate scenario, what is to stop these countries from setting up their own NAFTA or TPP sans the united states?\n\nYes.  The coming wave of populism is very noticable in the United states, but is also running rampant in Britain, the Phillipines, Austria, And more other nations than I am willing to look into right now.  I understand this complicates the discussion, and predictions for the future, but at the same time these populist nations need goods, commodities, and electronics to buy from other nations.  The sudden influx of populism across the world will certainly redefine how we do business, however I believe that something will step in to replace the void left by the abandonment of the TPP.  Many nations are being reactionary right now regarding trade policies, and that's easy to focus on (Britain, the US) but I strongly believe that other nations will be drafting a proposal to replace the TPP that benefits other emerging and established nations with the exception of the US.  \n\nOr to put it another way, have you ever seen a rich, entitled soccer mom when she can't get a pineapple in January, or her reaction when her family has to spend 150% price increase for the latest iphone?  I haven't, yet.  But I imagine other developed nations are planning what they want the TPP to look like without the US, becausr they don't want to see food riots or people breaking into stores to steal electronics. ", "score": 3, "replies": [{"body": "Isn't all significance psychological?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "You bring up some very interesting points. First of all, I don't think it is in the best interests of the US to oppose TPP. TPP would boost real income by over $100 billion, create jobs in exporting industries, and lead to lower costs for American consumers. Countries like Japan have acknowledged these benefits and have made the right move by passing affirmative legislation. But then the question would be whether the benefits created by opening up markets would make up for the fact that we have been selling out our middle class to countries like China, who have been thriving on selling cheap exports to developed debtors for decades. China has been accepting our inflation with open arms for years and years; with them out of the picture the Fed will have to tighten.\n\nOther developed countries like Japan, Australia, New Zealand, Britain, Germany, France, etc. will partially make up for the US if the US chooses to maintain its distance from TPP. Countries like Japan are already affirming positive sentiment toward open trade and are following through with policies that match these objectives. However, it is important to keep in mind that the US does supply EMs with the largest consumer base in the world. Without the US, the EMs will definitely feel the toll of reduced capital inflow. I know for a fact that Chinese financial stocks will get slammed in the coming years from faulty internal lending policies and macroeconomic risks posed by trade agreements. Less capital inflow into Chinese financial markets would lead to declining top line growth for government subsidized corporations adding to the risks that have been building up on their creditor's balance sheets. There has been tremendous pressure between banks and the Chinese government to expand credit to debtors regardless of the risk of default they pose - A Trump presidency could be the final straw for these risky lenders. What do you think about Chinese financial stocks?\n\nI definitely agree that the EMs and developed nations will move forward and extend TPP benefits to each other and leave the spot open for US cooperation in the future. Both EMs and other developed countries would benefit greatly from open trade systems that will provide increased access to cheap goods and affordable labor markets. The cost of labor is high especially in Europe and we can expect European companies to start shifting labor to EMs in the coming years. Meanwhile, open trade would allow EMs to expand, decrease unemployment, and grow top line growth. ", "score": 2, "replies": [{"body": "I don't disagree that a trump presidency could cause a debt crisis or a financial crash in China. \n\nI think a crash could come from China, but a crash could also originate from the US with many different triggers to initiate it, IMO. \n\nI guess I'm just wondering what's after the TPP failure.  The TPP is dead, the US is not involved, and Trump refuses to be involved.  Will the other countries already in the TPP push for it to continue without the US, as Japan and Australia have said?  Will it be rewritten to include China?  \n", "score": 2, "replies": []}, {"body": "tl;dr.", "score": 1, "replies": []}]}, {"body": "You're sort of discounting the public opposition to deals like the TPP. Publicly backing them is currently political suicide in a lot of countries. ", "score": 2, "replies": [{"body": "Valid point.", "score": 1, "replies": []}]}]}, {"body": "Stopped reading after \"as volatility **continues** to spike...\" check the VIX bro", "score": 2, "replies": [{"body": "Did you look at it during November?", "score": 0, "replies": [{"body": "OFC it went up with the presidential election, but it has been extremely low YTD.  Not saying that means it won't go up sometime soon (it probably will), but to insinuate that markets are highly volatile right now is inaccurate.", "score": 2, "replies": [{"body": "I didn't say volatility is high right now - I said it will increase in the future.", "score": 2, "replies": [{"body": "Saying it \"continues to spike\" implies it is already spiking.", "score": 1, "replies": [{"body": "Yeah, I'm sorry for the confusing wording. Hopefully you know what I mean now.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Great write up OP. Nobody ever talks macro around here", "score": 2, "replies": []}, {"body": "buy gold cuz dollar will get stronger???? wtf ", "score": 3, "replies": [{"body": "The dollar is being pushed to artificial highs so it makes sense to buy gold to protect your assets against potential drawdowns in the USD.", "score": 2, "replies": [{"body": "How are the recent highs artificial? Interest rates will go up this year. The dollar is just continuing its extremely slow, long hike back from its all-time low during the financial crisis, due to overall slowness of the recovery. Unless you see another U.S. financial crisis on the horizon there is little reason to fear a collapse in the dollar.", "score": 1, "replies": []}, {"body": "I think the dollar will rise, and that's it. Forget gold, the USD is the world reserve currency, if shit hits the fan it will be USD everyone wants, not yen, not shekles, not gold.\n\n", "score": 1, "replies": []}, {"body": "oh that explains.", "score": 0, "replies": []}]}, {"body": "post pics of your mom naked ", "score": 2, "replies": []}]}, {"body": "Isn't all significance psychological?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": ">Trump will increase the price of uncertainty so don't be surprised if volatility continues to spike in the coming months.\n\nHow tho, Trump's been keeping up with all his campaign promises. Where is the uncertainty tho?", "score": 1, "replies": []}, {"body": ">Trump will increase the price of uncertainty so don't be surprised if volatility continues to spike in the coming months.\n\nVIX was sitting at 12.5 on inauguration day, it's currently sitting at 12. It has not been spiking whatsoever.\n\n>so we can expect rates to stay flat in the US\n\nTrump doesn't control the FOMC. Yellen will decide whether rates are increased.\n\n>All of these financial companies have exposure to faulty loans to creditors and will drop significantly in the event of a nation wide financial crisis.\n\nI do actually agree this could be a very wise long term play. Our relationship with China is going to change drastically if Trump has his way.\n\n>In the meantime, volatility will continue to rise in the coming months.\n\nAgain, your time frame is dubious. Trump's policies aren't going to make headwinds in the next few months. He will almost assuredly introduce his tax breaks before he introduces anything that could damage American corporate holdings overseas. Ideally he will introduce them together. If he's serious about repealing Obamacare, which is Congress's #1 priority, that will happen first. Meanwhile, overseas markets will be wary simply because they don't understand Trump. He is not a crazy person like, for instance, Duterte. He's not going to make a move that shakes global financial markets before he's confident the American economy can weather the storm. He's certainly not going to do anything crazy before the 2018 midterms. You might think I'm giving Trump too much credit here, but be aware that he's operating with a Republican Congress that knows if the economy tanks, they are going to get annihilated at the polls in 2 years.\n\n>Being long the VIX through option contracts is a good idea.\n\nBeing long VIX via option contracts is literally never a good idea. I guess you could *maybe* buy futures 2 months out if you're absolutely convinced there will be a significant dip.\n\n>the dollar will continue to strengthen so I would recommend buying gold as a hedge.\n\nA hedge against what exactly?\n\n>Interest rates are at all time lows and there is a possibility of a rate hike.\n\nNo, the all-time low was 0-0.25%. Rates have been increased twice since then, and will probably be increased another 2 times this year.\n\n>I personally made a small fortune by buying up puts on the VIX before the election. \n\nDefine fortune.", "score": 1, "replies": [{"body": "Isn't all significance psychological?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Yes, the VIX spiked during November and has remained around 11-12 since. However, this is not indicative of what is to come. As I stated, the reversal in creditor/debtor relations with EM countries like China will surely cause volatility to spike, as global capital flow is redefined during the coming age of populism. \n\nBuying gold acts as a hedge against a potential weakening of the USD. I meant to say that the USD 'will' be pushed to artificial highs as domestic companies are pressured to 'hire American'. The amount of capital that flows into the labor pools of EM countries is not negligible - Just imagine where the USD will be if all this capital is kept within domestic borders. US citizens will have more dollars to spend, unemployment will go down, companies will see a rise in earnings due to tax cuts and deregulation, etc, ultimately leading to more inflation. Remember, a lot of our dollars were being used to buy RMB in the previous years and this makes sense because China exports cheap goods - It has been this way for a long time. However, now I believe that Trump will attempt to curb this outflow by instituting tariffs, taxes, and other types of regulatory measures that will ultimately push the dollar higher. \n\nWhen I said rates are at all time lows, I meant that they are comparatively low.\n\n", "score": 1, "replies": [{"body": "> As I stated, the reversal in creditor/debtor relations with EM countries like China will surely cause volatility to spike, as global capital flow is redefined during the coming age of populism.\n\nWhy this will cause volatility to spike. Not to mention, the reversal is unlikely to happen until significant legislation is passed. Remember that Obama's first \"big\" item was the stimulus bill and it took until September of '09 before the introduction of H.R. 3590. If Trump does work on an enormous bill that rewrites taxes/regulations and simultaneously introduces new trade deals, it will surely not be introduced until at least the fall.\n\n>US citizens will have more dollars to spend, unemployment will go down, companies will see a rise in earnings due to tax cuts and deregulation, etc, ultimately leading to more inflation.\n\nIf any of this even happens (and that's a big if) it won't be until the next calendar year at least. More likely we're talking about late 2018 at the earliest before we see any meaningful results from a huge reversal of the global macroeconomic picture due to a ginormous tax/trade bill. If inflation does go up, the Fed will tighten.", "score": 1, "replies": [{"body": "Isn't all significance psychological?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}, {"body": "how 2 trade volatility ", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "so when s en p doun i poot moneh in vix? kk bb ty ", "score": 3, "replies": []}]}]}, {"body": "Isn't all significance psychological?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}
