{"title": "How to DD Biopharma and Not Fuck Up", "selftext": "Earnings only come 4 times per year, and most little biotechs don't have any anyway. Problem is, guys like us, we need to lose money to big news at least twice as often. The solution: pharma stocks, where you also get clinical trial read outs, patent litigation, and PDUFA dates on the ol' catalyst calendar. Ready to learn how? For the purpose of annoying all you options traders, I'm going to write this from the perspective of someone going long the equity of a small to mid-cap. Plenty of DD already out there on Abbott and J&J.\n\n**Step 1.** Cash matters. Stay the *fuck* away from anything development stage with a market cap under $150 million. Unless you are YOLO-ing a hundred bucks or whatever, the only thing these plays will do is disappoint you worse than you disappoint your dad. Pharmaceutical research takes hundreds of millions of dollars to bring one small molecule from pre-clinical to market under ideal circumstances. A fucking rat carcinogenicity study can run $8 mil and 3 years. Under-capitalized companies with anything besides stud assets don't get bought, they raise and dilute and rinse and repeat, because there is always dumb money out there willing to bet on the 26th attempt to cure alzheimer's by hitting amyloid, or the next me-too formulation of methylphenidate (now in a pez dispenser!) to treat ADHD. Any dipstick with $15m in capital can get listed on the NASDAQ. I've met a lot of them. Don't give them your money. Look at the clinical development success rates by therapeutic area, published by [BIO](https://www.bio.org/sites/default/files/legacy/bioorg/docs/Clinical%20Development%20Success%20Rates%202006-2015%20-%20BIO,%20Biomedtracker,%20Amplion%202016.pdf) (warning: PDF). Make sure your model discounts back to whatever phase your target's lead candidate is in.\n\n**Step 2.** Look at the actual [patents](http://patft.uspto.gov/netahtml/PTO/search-bool.html). The database is free, and reading is easy. You're not looking to do a full FTO analysis here, just see that they actually have some claims that aren't total bullshit. Search the company name in \"assignee name\" then search all the names of the inventors you see listed to make sure they've actually assigned the patents to your target, and that the patents actually cover the drug they're talking about in their press releases. You'd be amazed that sometimes they don't. Check the date of filing/acceptance. If it's still preclinical but has burned ten years of patent life, walk away.\n\nThere are four kinds of patents that matter to pharmaceuticals:\n\n1. Composition of matter - you'll recognize this because the claims will say things like, \"compositions of....\" and \"a compound containing XXXX or pharmaceutically acceptable salt thereof\". These are the only un-fuck-withable patents you get.\n2. Formulation - this means the molecule is not novel, but the pill, patch, liquid, or suppository is. These can be fine, or they can be sketchy. You need to evaluate the underlying technology. Has it been used before in other drugs? Were there Paragraph IV filings on them? Was the company that licensed this technology to my darling DD target sued along with the manufacturer of that other drug? Any one of these can trip you up. Look for solid technology that hasn't cracked under a lawsuit yet.\n3. Method of use - these patents limit the use of the compound to a specific disease like autism. These are easier to work around, but better than nothing since they give the company a heads-up that generics may be coming (remember that paragraph IV thing I mentioned? It means that the generic makers have to file a lawsuit, followed by an automatic 30-month stay on launching their knock-off.) If all your target has is methods of use, tread cautiously.\n4. Method of manufacture - these are worthless.\n5. Other kinds of regulatory exclusivity. Yeah I said 4. This is different, but can still matter. Deal. Orphan Drug (7 years), New Chemical Entity (5 years), QIDP (5 years but just applies to antibiotics, which don't make money), Rare Pediatric Disease (accelerated review voucher, worth $50-100m if sold), Clinical Trial Data (3 years)\n\n**Step 3.** Look at the epidemiology - If your target company has the cure for some ultra-weird orphan disease, so what? Is there a patient registry? An advocacy group full of sad moms? A celebrity that has it? Are there academic centers treating the population currently? If not how the hell are they supposed to find the patients to charge their insurers $1m a head for this miracle cure? Also, holy goddamn, $1m a head? Is management prepared to get hauled in front of Congress to wither under national media scrutiny for weeks on end because people don't understand that nobody would develop drugs for a disease with 500 patients if they didn't make money? Pray they get bought by Alexion or move along.\n\nIf it's not an orphan disease, what are the insurers going to pay for it? New antibiotics, for example,  are worthless commercial investments, because hospitals will reserve them for the absolute worst-case, dumpster fire, probably going to die anyway patients and give everyone else a z-pack or generic iv rocephin all day long. Find out what the cheapest thing to treat your target company's disease of choice is and then scour the conference call transcripts for how in the name of bleeding Jesus they're going to get those tight-fisted bastards at United Health and Blue Cross to pay for it. Gross-to-Net deductions of 50% are the **low end of normal** now that there are 2-3 wholesalers and maybe ten insurers that matter nationally. Make sure you're discounting your projected cash flows appropriately.\n\n**Step 4.** Now, and only now, do you even bother to see what the rest of the company looks like. Are they in Phase 2? Data reading out this year? Great. A phase 3 trial costs at minimum, $10,000 per patient per week. Double that if it's an inpatient study, or being done against an expensive standard of care (like in cancer, where you can't use placebo because *ethics*.) Companies will often not tell you what these trials will cost, but you can find out. Look at the current market leading drug's label [here](https://www.accessdata.fda.gov/scripts/cder/daf/) and find section 14 (Clinical Trials Experience). This will tell you the number of patients and how long the study ran. Regulatory affairs people like precedents, as does the FDA, so it's a good bet that your target's Phase three trials will look a lot like this. Do the multiplication, and decide if that number plus their burn rate of the past 24 months less R&D expense is > cash on hand.\n\n**Step 5.** The Target Product Profile. Odds are, your prospective acquisition has talked up the benefits of their darling compound, and completely downplayed the side effects. Look at the available clinical trial results with a jaundiced eye. Pharma reps, when visiting doctors tend to show them an i-pad and say, *big bar good, little bar bad* and leave it there. Because they're also buying lunch for the office and wearing a low-cut top, the 'scripts get written. We aren't going to fall for that though, are we? Was there a dose-proportional response in their target efficacy endpoint? Was the p value at the 5th decimal place, or did they barely squeak by at p= 0.0499? What about the discontinuation rate? How does it compare to the current standard of care? All this feeds back to the number one question analysts should be asking management; \"How will you get insurers to pay for this?\" If there's not a clear separation on efficacy versus the prior standard, or a reduction by at least 50% in a really gnarly side effect, expect the commercial launch to be a slog.\n\n**Step 6**. The pipeline. Is your target going to continue to exist after Phase 3 is over, or is their plan to get bought? Look at management. Is there anyone with commercial experience on the executive team? Is there a head of sales? Marketing? Look for clues as to whether they're really cut out for this. Did big pharma (Pfizer or Genentech) license something deeper down in their pipeline, back at Phase 1 or before? That means multiple someones with budgets in the billions, access to a diligence database full of every document about the compound, and had the company's management on speed dial for months... passed on buying the thing that's in Phase 2/3 now.\n\n**Step 7.** The exit. Let's say all this has lined up, and you've found a company that's got the goods, with solid data in a real market, ironclad patents, enough capital to cover the next 23 months, and a share price that's not yet north of 200x projected earnings. (Even still, do not let this little bastard become more than 10% of your overall sector exposure.) What's your exit catalyst? If you're betting on an acquisition, look at the big boys in that therapeutic area and see whether there are any where this drug actually fits. Just because Roche or Ferring has \"women's health\" drugs, does not mean they're going to buy Sprout. The former are in reproductive endocrinology (maybe 2,000 doctors) and the latter has a lead asset in sexual dysfunction ( that's primary care, psychiatry, and OB-GYN, 250,000 doctors at the low end.) Roche isn't going to build that sales force. Is there actually a strategic acquirer or licensee that makes sense?\n\nIf not, is there anyone on your target's management team who has commercialized drugs before? Is there a sales & marketing staff? If not, is there the cash on hand to create or rent one? If you know these things before you click \"buy\" you might just not fuck up.", "id": "gno9l4", "created_utc": 1590027208.0, "score": 164, "upvote_ratio": 0.97, "num_comments": 63, "comments": [{"body": "what!? No TLDR!? Ok fine I’ll bookmark.", "score": 56, "replies": [{"body": "Tl;Dr - it is hella complicated to get all the variables aligned and win at small biotechs", "score": 25, "replies": [{"body": "So much of the actual value in small biotechs is super guarded IP. You say to lookup the patents but these companies purposely patent multiple molecule candidate look-alikes simultaneously to shroud which drug candidate they're even high on. Even with insider knowledge of which pipeline candidate how could you possibly ever predict the success before phase I trials. And by then the overnight millionaire status is gone. \n\nModerna is a great example of a company whose workforce is notoriously blasé and unhappy but now they're suddenly the front-runners for a COVID vaccine? Idk. Small biotechs are worse odds than just going to the casino and putting it all on black.", "score": 12, "replies": [{"body": "I know this is WSB, but I'm not playing in the preclinical space looking for overnight millionaire status. That's for university incubators and venture funds. If there's no data in humans somewhere you can access it, don't bother. You're right in that there's occasionally decoy IP, but most little companies are not so sophisticated as to have the $$ to file multiple applications to create a smoke screen around their lead asset. They, or their bankers, are emailing guys like me at bigger companies, eager for us to take a look under the hood the minute the statistics have been run.", "score": 5, "replies": [{"body": "Haha yeah I was gonna say I've seen what VC backed biotechs look like and they're all pie in the sky until they get bought out for pennies or make it huge. But once human data is published that's typically when the huge stock value jump occurs. If it's a therapy that has high need or a better safety profile then as soon as that clinical data hits the public sphere you're already too late. \n\nI think you might be downplaying the ability of even small VC funded biotechs to deploy decoy patent filings. That is literally taught in the tech transfer office of University. But yes capital can restrict it depending on the technology, which again most of the tech being patented if it's not equipment or diagnostics is molecular and this is very very easily obfuscated. \n\nWhen you say guys like you get contacted to \"look under the hood\" that can't possibly be happening without the serious consideration of a buyout or acquisition of a major stake in the company no? Just anecdotal but genuinely curious.", "score": 3, "replies": [{"body": "Oh yeah this is in the context of licensing or acquisition.", "score": 1, "replies": [{"body": "Lmao which fund do you work at and are you hiring", "score": 2, "replies": [{"body": "I do corporate development, so a company, not a fund. I'd like to start a little in house venture fund but the company's resources aren't quite there yet.", "score": 1, "replies": []}]}]}]}]}, {"body": "Bro GILD is on fast track. They are still the only biotech with a drug to market. Moderna is smoke and mirrors and have never produced a drug to market.", "score": 2, "replies": [{"body": "You called Moderna. Back to pre-covid announcement levels. Hope your puts printed", "score": 2, "replies": [{"body": "No puts on MRNA cus I’m dumb", "score": 2, "replies": []}]}]}]}, {"body": "But if you enjoy the task.... I wouldnt have the first clue on playing these if I hadnt been personally involved in a few biotech startups that didnt return shit.", "score": 2, "replies": [{"body": "100% has to be something you love doing. I can stay up all night reading BK filings on distressed companies that have real estate assets in foreclosure, boring shit to most. I have a science/engineering background but the thought of doing the DD described by OP made my eyes glaze over. Not for me!", "score": 3, "replies": []}]}, {"body": "Thanks brotha", "score": 1, "replies": []}]}]}, {"body": "Imagine giving a professional biotech trading lesson for free and when the people go home they base their strategy on which side of the lawn the dog shits on. Thanks man i personally prish it, but this is the wrong sub.", "score": 22, "replies": [{"body": "That bloody gekko has a pretty good track record though for real...", "score": 6, "replies": []}]}, {"body": "I read this whole thing and still don’t know what to throw my life savings at. Would not recommend unless you can read ~~big words~~", "score": 5, "replies": []}, {"body": "Sir, this is the bread line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 5, "replies": []}, {"body": "I didn’t read this... will TAK 25c 10/16 print?", "score": 6, "replies": [{"body": "BOJ printer go brrr", "score": 2, "replies": []}]}, {"body": "Okay Mr. Biopharma what are your positions", "score": 4, "replies": []}, {"body": "This is absolutely pointless because biotech runs on news sentiment alone right now. Noone who sees MRNA pop up on CNBC is going to go \"Oh nice let me spend an hour going through those patents and filings real quick\".\n\nSimilarly it doesn't matter how fundamentally sound a company is if they come out with news that has even a tinge of corona bearishness then that shit will get dumped into the ground within 5 minutes.\n\nIt's simple. Buy the rumor, ride the wave then get out before the dump.", "score": 6, "replies": [{"body": "There’s far more biomedical companies then just MRNA.\n\nI hope for the sake of people’s well being their vaccine candidate yields positive results. I personally however refrain from investing in any company which (if I’m being quite candid) speaks to tons of media before results can even speak for themselves.", "score": 8, "replies": []}]}, {"body": "Thank you for the wonderful advice, definitely bookmarking this. I started investing in biomedical stocks early this year. My initial plays were really just shots in the dark, reading through product pipeline pages and company histories. Been improving my research since.\n\nUnfortunately all I have is babies first portfolio, but so far the returns have been stellar - blowing past 20, 30, and 40% returns since January.", "score": 3, "replies": [{"body": "Gotta start somewhere. One day you'll be a big ass moose", "score": 1, "replies": []}]}, {"body": "Positions?", "score": 3, "replies": []}, {"body": "You can also just add them to your watchlist on StockTwits and let those broke degenerates lead you into the upswings", "score": 3, "replies": []}, {"body": "Check out biotech on reddit they got some DD on there with full analysis", "score": 3, "replies": [{"body": "Which sub?", "score": 2, "replies": [{"body": "r/biotechplays", "score": 3, "replies": []}]}]}, {"body": "read it all and appreciate you boo", "score": 5, "replies": []}, {"body": "Actually read your post. If you'd like to save me some time (up to you), your non-binding and non-professional opinion:\n\nAkorn (AKRX)?\n\nVBI Vaccines (VBIV)?", "score": 2, "replies": []}, {"body": "This was a good read. Thanks.", "score": 2, "replies": []}, {"body": "Good advice, I really appreciate this write up. Hopefully I can put my science background to good use with this. I've been looking at biotech companies but I didn't know where to start.", "score": 2, "replies": [{"body": "Hope it helps.", "score": 2, "replies": []}]}, {"body": "Thanks, good read.", "score": 2, "replies": []}, {"body": "This is honestly a great write up and I appreciate it a ton. I will refer people here when they shit talk my DD on pharma and biotech in the future....like Takeda who tripled profits expected and Revenue for 2020 is projected at $30 billion but they have a market cap of <$60 Billion", "score": 2, "replies": []}, {"body": "I'm in drug development - this is spot on, really good information.", "score": 2, "replies": [{"body": "Thank you. I hope it's useful. Plenty of pros still get burned with access to a hell of a lot more info than a retail investor or speculator will ever have.", "score": 1, "replies": []}]}, {"body": "I had some decent success with just casting a net over a few of em and sell as soon as you make money. SRNE pretty well paid for the lot with one contract", "score": 2, "replies": [{"body": "Yeah if you can buy everything then you'll get the winners. Just ties a lot of capital up and means you have to be extra vigilant to cut the losers ASAP", "score": 2, "replies": [{"body": "Wait you mean you DONT take the 100% loss?", "score": 2, "replies": [{"body": "I mean it's generally about a ten minute window between a 15% and a 40-60% loss on the little guys unless you're *really* good at threading the stop-loss needle", "score": 1, "replies": [{"body": "Good thing my first break at work is half an hour after market open so I can watch all my gains flush down the toilet", "score": 2, "replies": []}]}]}]}]}, {"body": "Thank you for this. What is your take on [this DD on ARWR?](https://new.reddit.com/r/wallstreetbets/comments/fxslud/arwr_primed_for_the_breakout_of_the_century/) Overall super audacious, and it looks like a lot of people have already lost a lot on calls.", "score": 2, "replies": [{"body": "I'll take a look. I used to manage a cardiovascular brand but it's been a while since I've been involved in that therapy area.", "score": 2, "replies": [{"body": "That would be super appreciated. Very interested to get your thoughts.", "score": 1, "replies": []}]}]}, {"body": "Have Shkreli do it for ya?", "score": 2, "replies": [{"body": "His first biotech retrophin isn’t doing that bad.", "score": 3, "replies": []}]}, {"body": "\"**Step 2.** Look at the actual [patents](http://patft.uspto.gov/netahtml/PTO/search-bool.html).\"\n\nLol. Less than 0.5% of us autistic retards would be able to even identify the claims portion of the patents. And it would take an advanced chemistry degree to determine whether the chemical equation is even remotely related to the drug. What next, look to the prosecution history to determine if they've inadvertently narrowed the claims to exclude the drug?\n\nNo thanks. I'd rather just see which side of the lawn a dog shits on, or whether a gecko ate a worm.\n\nAlso, ban for no positions.", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/Hired-Sellout don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "When does ARWR print?", "score": 1, "replies": [{"body": "where's that guy who did the DD and said he works with them?", "score": 1, "replies": []}]}, {"body": "Good advice. Most Covid stocks if by now not in the main stream news. One can assume it is too late.", "score": 1, "replies": [{"body": "I don’t like to talk ill of anyone’s positions, but “muh COVID cure” stocks are expressly risky. If there’s anything I’ve learned it’s medicine takes a long ass time to produce, lots of testing, lots of capital.\n\nFor any company to work on COVID they’re essentially setting aside all their existing planned development in hopes to be first to market with a cure. It’s practically betting on a horse race.\n\nOPs guidance is less about getting poor quick and more putting ones noggin’ to use to make a buck.", "score": 3, "replies": []}]}, {"body": "Soo ABBV?", "score": 1, "replies": []}, {"body": "You lost me at step 2", "score": 1, "replies": [{"body": "No worries. This is a complicated mess of a field. It can be a lot of fun to the right twisted minds, but it ain't for everyone.", "score": 1, "replies": []}]}, {"body": "How you profit from biotech companies?\n\n\n-you don‘t", "score": 1, "replies": []}, {"body": "Just tell me vktx is good or not spaz", "score": 1, "replies": []}, {"body": "Thanks for the info OP!", "score": 1, "replies": [{"body": "You're welcome", "score": 1, "replies": []}]}, {"body": "Nice. I'll assume that other people have done all this work and efficiently priced the biotechs, and then buy the next thing i see on stocktwits.\n\nCurrently Long PTI, VBIV, ARWR. would probably sell if someone tells me those stocks are shitty tho.", "score": 1, "replies": []}]}
{"title": "Heads up on Cloudera (CLDR) Discussion", "selftext": "[deleted]", "id": "gnoy6r", "created_utc": 1590029995.0, "score": 43, "upvote_ratio": 0.86, "num_comments": 52, "comments": [{"body": "Seems solid, betting my whole account tomorrow morning", "score": 40, "replies": [{"body": "This is the way", "score": 4, "replies": []}]}, {"body": "even if cloudera has good financials, why would i buy when lil yachty’s new album will certainly sink the market upon release", "score": 26, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Lil Boat 3 is guaranteed to crash the economy", "score": 14, "replies": [{"body": "Don’t fight the signs", "score": 4, "replies": []}]}]}]}, {"body": "Software guy here... this is not a Cloud company as such. They develop and sell a dying technology Hadoop. There are many new open source alternatives for it and offered on AWS, Azure, Google clouds for free (excluding infrastructure costs).", "score": 14, "replies": [{"body": "Another software guy here. Stock has \"Cloud\" in it, so it must reach the clouds.", "score": 10, "replies": []}, {"body": "Yep, was going to post exactly this, but he said it very well.", "score": 2, "replies": []}, {"body": "They guided lower revenue in this quarter compared to their last quarter. Bad look for a company focused on ARR. Could see it having a run up due to it's name but would not hold this through earnings.", "score": 2, "replies": []}, {"body": "The whole point of their current push is hybrid cloud and to not anchor yourself to a single architecture like AWS or Azure. \n\nAlso, for example, many healthcare companies are unwilling to swap to full cloud due to HIPAA concerns (and because they’re run by physician leadership who hear cloud and get scared as hell) and this is the type of solution they use with on-prem as they adjust to any type of cloud utilization.\n\nEDIT - if anything this will ride up to earnings regardless. Dump before the actual ER.", "score": 2, "replies": []}]}, {"body": "the 6/19 is very call heavy. $10 and $15 strike. I'm in", "score": 5, "replies": []}, {"body": "Got in Monday. Agree with above. Plenty of time to get in for earnings price/volatility run up. \n\nGood margins. Good growth. Good industry. \nShit p/e but, good fwd p/e.", "score": 6, "replies": []}, {"body": "I’m sure you are right about them short term but I wouldn’t hold this stock long term. I don’t think they actually sell anything except their own flavor of Hadoop with MapReduce and maybe professional services for that distro. Amazon AWS will put them out of business plus companies don’t want to run on prem Hadoop any more. It’s too expensive. And MapReduce is dying in favor of Spark.", "score": 4, "replies": [{"body": "Cloudera uses Spark, or Impala if you want to write SQL directly and don’t care about job management.", "score": 1, "replies": []}]}, {"body": "Gonna follow you now brotha", "score": 4, "replies": []}, {"body": "Wooot wooot! YOLO to tendie town!", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "How long to keep them in the oven?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Today hurts after yesterday's run up.", "score": 2, "replies": []}]}]}]}]}, {"body": "Already up like 9% today. Do you think it has more room to run up?", "score": 4, "replies": [{"body": "Not to sound like a jack ass but if he didn't why would he post this DD", "score": 7, "replies": [{"body": "Because he wants to justify his play even if he is wrong?", "score": 4, "replies": []}]}]}, {"body": "You had me at Cloud. All in!", "score": 4, "replies": []}, {"body": "Machine learning tech + off its ATH + earnings = solid", "score": 3, "replies": []}, {"body": "Seems like a better bet than these dumb ZUO calls I'm holding.", "score": 3, "replies": [{"body": "This aged like milk. Hope you held ZUO", "score": 1, "replies": [{"body": "nope. but i did make 500% returns off the CLDR calls. not dumb and didnt hold through earnings", "score": 1, "replies": []}]}]}, {"body": "See you on 6/05! All will be revealed!", "score": 3, "replies": []}, {"body": "I’ve been pimping this shit for a couple weeks now. I put a price point before earnings at 12. I got lucky and got all my positions at the bottom.\n\nPositions:\n10c 5/29\n9.5c 6/12\n12c 5/19", "score": 3, "replies": []}, {"body": "Is it a weakness that it’s an ‘older’ player in the space, meaning people already know who they are affiliated with and that is priced in and why they haven’t run up like the other cloud players? also why are they trending down the entirety of their existence? I would love to find another cloud play that hasn’t already run up but sometimes things are cheap for a reason", "score": 2, "replies": [{"body": "Any other plays in mind?", "score": 1, "replies": [{"body": "XLK leaps", "score": 2, "replies": [{"body": "Might check out some around Jan 2021", "score": 1, "replies": [{"body": "I’m in the January 2022s at 100", "score": 2, "replies": [{"body": "When did you get in those? Do you anticipate it being well above 100?", "score": 1, "replies": [{"body": "I got them beginning of the week, definitely can see it above 100 in a couple years, if anything this whole situation benefits technology companies more than anything else and XLK is relatively well balanced", "score": 2, "replies": [{"body": "I looked at their top 10 holdings. I wish they had a bit more up and comers. It is mostly AAPL and MSFT. I might take up a position, though. Seems safe. My fear is a drawn out recession late this year and next.", "score": 1, "replies": [{"body": "Yea I mean there’s always that risk with options, that’s why you still should take profits when you can, and that’s why I’m not putting my whole account in them, I’ll probably get out if it’s up 50%", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Please. It’s an utterly mismanaged company in the brink of death omg with Hadoop. One trick shit pony. Puts or shut up", "score": 2, "replies": []}, {"body": "I wouldn't bet a penny on this company ever turning a profit before it crash and burns. That won't keep the stock from going up tho for no reason at times... Investors/analysts like the \"cloud\" buzzword and think anything to do with cloud coulf be the next Google. What they don't realize is everyone else is picking up niche scraps left over from aws, azure and gc. \n\nAre people still choosing Hadoop when they start a project?", "score": 2, "replies": []}, {"body": "Why not 6/19 10c? Might have been different when you first posted but it has the same delta, lower IV, higher volume and open interest. The same price +/- $.05", "score": 2, "replies": []}, {"body": "Momentum has started, will see how the earnings go and ladder up", "score": 2, "replies": []}, {"body": "Yo thanks for this post. I decided to take a risk and follow some randoms advice and buy a 6/12 11c. Sold it yesterday for a 425% profit. Just wishing I risked more.", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/refroni don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "When ya getting out?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Do you know why it pumped 8% today? Just up with the general market? I'm not seeing much news on them. I'm familiar with their tech, a lot of products they offer are the same things MANFAG companies use, so its very appealing for startups.", "score": 2, "replies": []}]}]}, {"body": "While this seems like a good 401k buy i'm having a hard time understanding this from such a short term perspective. It seems like the cloud companies blowing up are in the IAAS sector of cloud services. I'm not sure I see Cloudera being impacted by that immediately, but rather when people start buying licenses and hardware to expand their infrastructure.", "score": 1, "replies": []}, {"body": "They’re on my watchlist, actually. They seem like a slow and potentially steady grower, probably not the sort of thing to be popular here.\n\nAnyway, I was thinking of a put credit spread when premium is high before earnings, or buy and hold through.", "score": 1, "replies": []}, {"body": "RemindMe! 14 days", "score": 1, "replies": [{"body": "I will be messaging you in 14 days on [**2020-06-04 05:11:40 UTC**](http://www.wolframalpha.com/input/?i=2020-06-04%2005:11:40%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/gnoy6r/heads_up_on_cloudera_cldr_discussion/frbbt47/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fgnoy6r%2Fheads_up_on_cloudera_cldr_discussion%2Ffrbbt47%2F%5D%0A%0ARemindMe%21%202020-06-04%2005%3A11%3A40%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20gnoy6r)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Price has already risen substantially over the last month. When earnings come out how will you avoid IV crush?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Dont know enough to give a confident answer. Maybe some type of spread to cover losses.\n\n&#x200B;\n\nBut we both know we are going to settle for naked calls dont we", "score": 2, "replies": []}]}]}, {"body": "They’re in the middle of a class action lawsuit and are probably incurring a significant amount in legal fees. Surely this must mean it’ll be green all the way.", "score": 1, "replies": []}]}
