{"title": "Stock Portfolio update for the week ending 4 April 2014", "selftext": "Hi all -- sorry for the delay getting the weekly update out this round.  Its been a hectic week and a Norwegian colleague of mine is visiting, so I've been a bit wrapped up in things this week.  \n\nDisclaimer: I was a bit hungover yesterday because Norwegians can drink in volumes the likes I can't even compare to.  ;)\n\nEDIT: also, I took a snapshot of my Fidelity Active Trader Pro screen instead of the web summary, so sorry if this adds confusion in looking at the positions.\n\n[CURRENT at week ending 4 April 2014](http://i.imgur.com/8lYmuCz.png)\n\n**Summary:**\n\n* Starting balance 1 Jan 2014: $74,617.43\n\n* Balance 1 Feb 2014: $82,017.82 (+10% YTD)\n\n* Balance 1 Mar 2014: $87,069.85 (+16.6% YTD)\n\n* Balance 1 Apr 2014 (END of Q1 2014): $111,823.86 (+49.9% YTD)\n[HERE is the Quarter End snapshot](http://i.imgur.com/akvnGkn)\n\n* Current balance as of 4 Apr 2014: $102,444.91 (+37.3% YTD)\n\n* Current profits YTD (realized gain/loss from selling): +$11,918.02\n\n* Money cashed out YTD (withdrawn from account): -$1200.00\n\n----\n\n**Trades for the week:** I had no trades this week - in fact I barely had a chance to watch the market this week!  Ugh.\n\n----\n\n**Other thoughts:**  Quarter END:  As of pre-market opening on 1 April, I was up almost 50% on the year!  Fantastic...  \n\n...But short-lived, unfortunately -- I'm not starting the quarter off very well it seems: my account lost almost $9K between Tuesday and Friday this past week.  Lovely, especially considering I had no time to watch closely.  I am still up 37% overall on the year and that's not half bad.\n\nIt seems the market is going through a crap-ton of turmoil this last week and it seems to be bipolar -- not sure whether to rise or fall.  Events in Europe, the Fed getting their new legs and a bunch of freaked out \"doomsdayers\" predicting a market crash are not contributing to market confidence I think.\n\nI think April may be a bit of a rocky month, but hopefully with the growing sentiment that marijuana will become a more accepted substance in the US, I feel that even in a bad market, these fledgling businesses have a chance to shine.  I firmly believe there will be some serious scrutiny of the MJ market in the coming months as the SEC starts putting more of a spotlight on this now very visible industry.  You'll see some fraud come out of the woodwork and probably another 100 companies try to join in on the profiting opportunities.  Be careful and always do your due diligence -- this is a hot market segment and there are those keen on preying on the unsuspecting willing to part with their investments.\n\nAt quarter end, I was looking back at the history of my brokerage account and at the low point in mid-2012, the account balance was under $25K.  I can honestly say that I would not have predicted that in under 2 years that same account would be worth over 4 times what it was at the low point.\n\nI'm looking a bit further out here though -- I fully expected the massive gains I made in March to be a bit short-lived.  I went from under 20% to 40% in just a couple of weeks.  I was certain there would be a correction in there coming.  I guess that's been happening this past week.  Perhaps it will taper off a bit, but again, many of my positions are being held for their future potential and I don't intend selling off.  If it takes another quarter before they turn around, so be it -- they have massive upside potential and I don't mind waiting. :)\n\n-----\n\n**Thoughts on next week:**  *IF* I get an opportunity next week, I may do some consolidation to pare down on a few underperformers or stocks I don't really have a long-term interest in holding.  There are a few new bright spots coming up that have been performing well and I may get a couple of new positions open on them, although I'm more apt to watch their patterns a bit before pulling the trigger.  It might be a light trading week for me next week as well because of my workload.\n\n-----\n\nAs always, I welcome your thoughts and feedback!  I hope everyone's investments are providing them good returns!\n\nFor those of you that want to look at my prior portfolio updates, run a reddit search for: \"stock portfolio update author:h0bb3z\"", "id": "22d2o6", "created_utc": 1396810865.0, "score": 4, "upvote_ratio": 1.0, "num_comments": 11, "comments": [{"body": "Nice.\n\nHow often do you trade? I think DDD is right at a purchase price.\n\nDo you frequent /r/weedstocks?", "score": 1, "replies": [{"body": "Yeah - DDD is at a great price right now -- I'd double-up my shares, but I've got some taxes to pay with my settled cash.\n\nI'm subscribed to /r/weedstocks as well, I just don't post this portfolio update there because I think there's a lot of folks that frequent the same subs and I think it would be too redundant for me to post this everywhere...", "score": 2, "replies": []}]}, {"body": "Impressive. Is this real money you are trading? New to this sub. May I ask what you started with? When you started? And do you add to your account and how often? It feels to personal for me to ask this of you but I thought I would because you posted the sheets. Thanks for the reply.  ", "score": 1, "replies": [{"body": "Thanks for the feedback.  Yep - this is real money, but I have had $0 out of pocket to start this account.  I started with about $30k worth of company stock in the beginning of 2012.  I have not added to the account with \"real\" out of pocket money at all -- I grown it over the past couple of years to what it is now...", "score": 3, "replies": [{"body": "Wonderful. Is this a 401k?", "score": 1, "replies": [{"body": "No -- this is a brokerage account.  The restricted stock I received was distributed into the brokerage account when it vested fully.  I have a separate 401k and about 3 different IRA accounts, so this doesn't make up the bulk of my safer investments.\n\nAs I've not put any of my own money in to start it, I tend to have higher volatility and risk in the positions I take in this account.  Thus far it has been paying off...", "score": 1, "replies": [{"body": "Lol. I'm doing about the same thing. As in fore separate accounts with one high risk. ", "score": 1, "replies": []}]}]}]}]}, {"body": "I am blown away that plpl hasnt fallen yet", "score": 1, "replies": [{"body": "Well, they have some heavyweights backing it, so that's probably keeping it afloat until they have to file an SEC report...", "score": 1, "replies": []}]}, {"body": "Keep up the good work. \n\nI can't seem to get much of anything going. \n\nSo I beg, what type of research do you do?", "score": 1, "replies": [{"body": "I use a bunch of different sources and look at screeners and generally try to find things that are trending or turning toward and upward transition.\n\niHub is great to see what might be trending, but i don't trust anything there.  Reddit has a wealth of tips that are generally a bit better start for due diligence.  I use stockta.com for some technicals and screening because it is easy.  I use FinViz.com for high level macro-type trends and read Seeking Alpha and some others and I follow things in Twitter.\n\nI basically grab a crapload of information and try to boil it down to things that look interesting and go from there.  most of my trades are bad, but I get a few right and those are the ones I keep.  I just try to get out of the bad ones before I get too in the red, but obviously that hasn't happened on all of them...", "score": 2, "replies": []}]}]}
