{"title": "Nvidia puts?", "selftext": "I am thinking of getting a few NVDA puts @ $150 3/17 2023. Of course NVDA remains a great stock long-term, but short-term there appears to be much more downside potential. With the Arm deal falling through in February, only negative triggers seem to remain to reinforce the current downtrend: worsening macroeconomic conditions, FED rate hikes, potential stock dilution later this year, ETH switching to proof-of-stake which may hit GPU demand, slowing consumer demand for GPUs... The stock has been hitting the key $210 support level multiple times this year already, and its valuation is still extremely high. Its price-to-sales ratio stands at 20, still much higher than its pre-pandemic peak of 15 and the industry average (AMD P/S is 7 for instance). Same is true for its P/E ratio of 56.  Anything I am missing/your thoughts?", "id": "u766fw", "created_utc": 1650377699.0, "score": 42, "upvote_ratio": 0.77, "num_comments": 73, "comments": [{"body": "Be aware of its weighting in indexes and etfs. A rising tide lifts all boats. Could easily get back up above 240 now.\n\nLet the market run it back up 1 SD before looking at shorts. Earnings May25th as well.\n\nI currently have a tiny long position, but yes I would look at shorts above 250.", "score": 46, "replies": [{"body": "Can you clarify for me how the etf-stock buying relationship works please - in reference to your *rising tides*.\n\nIs it that if more people buy an ETF then the fund manager has to buy more of each of the shares inside the index, and hence their buying power pushes up the price of each of the underlying's that comprise the ETF? Thanks.", "score": 2, "replies": [{"body": "ETFs need to maintain a balanced portfolio of the exchange they track based on how the ETF was structured to work. If a few sectors either increase or decrease there is often rebalancing that must be done for the entire portfolio which may include buying across the board or selling across the board.", "score": 12, "replies": []}, {"body": "ex: XLK is an ETF that encapsulates some major tech players. NVDA has a 4.49% weight in that index. So if people are rotating money back into the ETF, or any of it's heavily weighted components such as AAPL, MSFT, V, etc, then to balance that portfolio the fund/index will be distributing the cash influx based on the weight.\n\nThere are thousands of ETF's many will have a big name like NVDA in it... so hence the rising tide lifts all boats.", "score": 7, "replies": []}, {"body": "> Is it that if more people buy an ETF then the fund manager has to buy more of each of the shares inside the index, and hence their buying power pushes up the price of each of the underlying's that comprise the ETF? Thanks.\n\nYes.  Buying VOO is buying roughly 500 companies.  All of their prices go up.  NVDA is in S&P and S&P is far larger than NVDA so S&P determines NVDA's price more than NVDA's fundamentals do.  (With exception like extreme fundamentals like how Netflix dropped 25% after hours tonight, or how over many years fundamentals tend to influence prices.)\n\nIn 401ks and DCAing paychecks into VOO is the norm, so there is a rising tide for those roughly 500 companies.", "score": 2, "replies": []}]}, {"body": "Overall market outlook in short term (coming months) is looking quite poor though? FED appears determined to get serious with inflation in May and subsequent months ([quite telling how much probabilities regarding rate hikes evolved over last month](https://www.cmegroup.com/trading/interest-rates/countdown-to-fomc.html)), now even talking about a potential 75 bps increase. Would be surprising if this doesn't push stock markets down, no?", "score": -2, "replies": [{"body": "And this is how you end up shorting the bottom. \n\nThe time to buy puts was at end of march or early april, when everyone was optimistic and stocks were flying high. By the time people got spooked and the price is already actively tanking, its already too late and you missed out.\n\nAnd remember, sentiment can change very quickly, just look at the few run ups and pullbacks we have had this year. Each and every one of them went from extreme bullishness to extreme bearishness and back to extreme bullishness.\n \nSo be smart and don’t YOLO your entire account on nvda puts, if you insist on going short… i do think there will be a pullback in early May to mid May, but until then earnings will likely push the prices up for the next 2 weeks. I will probably increase my hedges at the end of april.", "score": 24, "replies": [{"body": "Thanks. I certainly have made wrong decisions on this basis in the past, where I misjudged how volatile market sentiment can be from week to week. \n\nNevertheless, I think the odds of a larger correction are still severely underestimated at this moment, and unlike 2020, there is no central bank to ensure a V-shaped recovery right now. \n\nIt might take years until markets fully recover, and I am looking for ways to hedge my portfolio in a way which ensures at least some positive returns in the coming years. But not planning to go full retard with puts, would not take a position against NVDA exceeding 5% of total portfolio.", "score": -1, "replies": [{"body": "The amount of wildly bullish \"buy all dips\" responses you're recieving should give you confidence that you're on the right track. \n\nLots of people are refusing to adapt to the massive structural changes happening in the economy right now. \n\nThe way you're thinking is very prudent - don't let the blind permabulls convince you otherwise.", "score": -1, "replies": [{"body": "Permabulls are right 74% of the time when we look at years.\n\nEdit: also, what structural changes?", "score": 2, "replies": [{"body": "> Permabulls are right 74% of the time when we look at years.\n\nAbsolutely, but that misses the point. The other 26% matters and most of you pretend it doesn't. It's not really your fault either - post GFC markets have been incredible easy to navigate and provided above average returns. All of that is changing and those returns are very likely to revert back to the mean.\n\n> Edit: also, what structural changes?\n\nMonetary policy dominance is over. Fiscal policy has exploded onto the scene and completely taken over. This is a very real and fundamental change to the way money flows through the economy.\n\nThe evidence is right here in front of us: rates are exploding higher and rate volatility is at one of the highest levels in history. Inflation is roaring back on the scene after being non-existent for 40 years.\n\nThis is **not** a coincidence.\n\nIt's a product of the policy shift mentioned earlier. Covid & the invasion of Ukraine just served to throw fuel on those flames. This has pretty profound implications for the market - the dominance of growth stocks is almost certainly at it's peak and diversification across asset classes has become necessary again.", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "...says the Federal Reserve and the Treasury.", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "You need a source? The Fed meeting notes, government spending figures, and Treasury issuance data are all public domain. I didn't think you'd need to be spoon fed...\n\n[Here](https://www.federalreserve.gov/monetarypolicy/files/fomcminutes20220316.pdf) are the minutes from the March Fed meeting. I suggest going back further to get even more context.\n\n[Here](https://fred.stlouisfed.org/) is the Fed's economic database. You can pull the relevant data sets on fiscal spending and the Treasury General Account directly from there.\n\nTo be quite honest though it sounds like you don't really understand what a \"shift from monetary to fiscal policy\" actually means or entails. As I said earlier, the evidence is obvious for all to see.", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "I literally just linked you to the data source, direct from the Fed. Any article you find would be citing this exact data as a source itself.\n\nHere's a direct link to Fed Chair Evans talking about the Fed's pivot in policy, this took 2 seconds to find: https://www.chicagofed.org/publications/speeches/2022/april-01-prairie-state-college-foundation\n\n> Can you not find a single article in the WSJ or financial times to back up your statement?\n\nThis is a pretty ridiculous request - I don't need an article to validate what I see directly in the data and what the Fed officials themselves are saying. Go look a it yourself.\n\nIt **still** sounds like you don't quite understand what you're looking for or what we're really talking about.", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "> Linking to a massive database is not the same as providing a source. I asked for a needle, and you linked me to the haystack.\n\nYou see the giant search bar on the front page? Try typing \"fiscal spending\" and see what comes up.\n\n> The key section is “adjusting monetary policy”. Heck, the speech is called “why it’s time to adjust monetary policy”. What about that speech do you think supports your argument?\n\nAdjusting monetary policy is exactly what I've said is happening. You asked for evidence of it - here's a Fed official telling you it's happening, right in front of your face. I don't understand how this isn't crystal clear... my best guess is that you just don't really grasp the argument at hand.\n\nGood luck with your investments over the next 10 years. Sounds like you'll likely need it.", "score": 1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "> The Fed is always \"adjusting\" monetary policy based on new information.\n\nThe \"adjustment\" he discussed was setting a path to ending asset purchases. That's the end of monetary policy dominance as described.\n\n> So, I can only conclude that you are full of shit. Good luck with that.\n\nI've spent the last 10 years working in capital markets. What are your qualifications exactly?", "score": 1, "replies": []}, {"body": "The latest monetary policy note from Credit Suisse is a nice follow up to our chat: https://plus2.credit-suisse.com/shorturlpdf.html?v=54t3-WTBd-V\n\n>  If financial conditions don’t tighten on their own, “the Fed will have to shock markets to achieve the desired response”, that is, “it’ll have to inflict more losses on stock and bond investors than it has so far”. If that wasn’t clear enough, the former vice chair of the FOMC closed by saying: “one way or another, to get inflation under control, the Fed will need to push bond yields higher and stock prices lower”. The message could not be clearer.\n\nDo you get it yet?", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "So you were agreeing with my earlier point then?\n\nBizarre", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Hello, 5 months later here I am to say I told you so \n\n🙂", "score": 1, "replies": []}]}]}, {"body": "Keep in mind, Tech has been pummeled since Nov 2021.  We're almost 6 months into a bear market in tech.  Most bear markets last 6 to 8 months.  Look at where NVDA just was a few months/weeks ago (much higher).  I'd be very careful.  There might be some more downside but I think at this point it's getting more and more limited for risk/reward.  I'm long calls right now lol, just bought em.", "score": 1, "replies": []}]}, {"body": "Nailed it", "score": 1, "replies": []}, {"body": "So you’re saying it’s the bottom? \n\nI sold my TLT puts ten days ago because I thought the market has overreacted and look where we are now. Like op, I think there’s more pain to come.", "score": 1, "replies": [{"body": "On a 1 year time frame, probably not, but in the short term, Yes.\n\nThe point is that shorting after a significant pullback is generally very risky, and if you do decide to short, buy at-the-money puts. Far out-of-the-money puts like OP suggest is the fastest way to get wiped out.\n\nIf you think the market will continue to pullback after a 15% - 20% drop, I believe its better to be cash gang and enter when you feel bullish again. Sure, you might miss out some profits from puts, but you also don't risk getting destroyed if you are unlucky enough to short the bottom.\n\nThe volatility of this market is a trader's wet dream.", "score": 1, "replies": [{"body": "Agreed. Just think otm puts will actually make op suffer less as long as he’s risking the same dollar amount. He’s going to suffer much more on 10,000$ on atm puts if market goes bullish than he is on otm puts if market goes bullish. otm delta and gamma make it less painful when it’s moving against your position.", "score": 1, "replies": [{"body": "The problem with OTM puts is that you get screwed by theta as you get closer to expiration, so if you decide to do it, make sure you at least have 2 months left by the time you close.", "score": 2, "replies": []}]}]}]}]}, {"body": "None of that is new news. We've known about the potential factors for months, and the chance that all of that could come to fruition has been considered. I don't know the direction of the market, but I am sure it isn't a \"Only Down\" outlook. In fact, when everyone's so bearish, it would actually take much worse *new* news to bring the market down much further. The general public is most bearish at the very bottom.", "score": 3, "replies": [{"body": "*We*, the retards on reddit (very much including myself in this group), are the general public. And it is quite clear from this post alone that the bearish sentiment is still low. \n\nMany people still seem to think that the insane valuations we are seeing in tech can endure, when it is extremely obvious that these are in large part the result of [an unprecedented amount of monetary stimulus](https://www.currentmarketvaluation.com/posts/2021/07/Fed-Balance-Sheet-vs-SP500.php). Now that this monetary stimulus has to be urgently reduced over the coming months due to surging inflation rates, you think we will see just a small blip and then go back to \"normal\"? \n\nWe have gotten so used to expansionary monetary policies over the last 15 years that we have forgotten what the alternative looks like. We will start to remember when the Fed begins hiking its rates and unloading its balance sheet in a few weeks' time.", "score": 1, "replies": []}, {"body": "Oh, we have only just begun to see the downside.", "score": 1, "replies": [{"body": "this comment is a bottom signal /hj", "score": 1, "replies": [{"body": "😂👍🏻\nGL, you are going to need it before earnings season is finished.", "score": 1, "replies": [{"body": "you could be right, like i said i dont know the direction of the market. if i did i wouldnt be on reddit, id be on a beach. but i also don't see a reason to be petrified-bearish right now, and when everyone else seems to be petrified-bears for old reasons, that's a sign to *not* be bearish yourself. but yeah, earnings season carries a lot of wait, so we'll see", "score": 2, "replies": [{"body": "Bear markets have massive swings - bigger rallies than bull markets, just before they dump again.   This is because shares are being off loaded from strong institutional hands into the BTD crowd.\n\nExpect crazy swings up and down - until the next leg down.   The FED tightening into slowing growth has only just started getting priced in (smart institutional money has been offloading shares for months).   \n\nExpect more Netflix type moves, especially in consumer discretionary stocks.  Best of luck to you.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "The time to short was after the NVDA hype pump a month ago. And some people already mentioned - NVDA is anchored in some popular ETFs. You think it has more downside? Or you want to make a macroeconomic play and think that tech is overvalued?", "score": 2, "replies": [{"body": "Yes and yes. What do you think?", "score": 1, "replies": []}, {"body": "Yes, things will bottom out eventually, but there is a lot more downside coming first.\n\nI am not shorting at the bottom of these dips though, but I am shorting into the rips…\n\nGLA", "score": 1, "replies": []}]}, {"body": "Agreed. Days like today I take in downside risk, close profitable positions, and wait. I do not add long positions on panic buy days, but I will adjust delta on something that gets too short/painful.\n\nI am nervously neutral/flat today across my greeks... not short enough IMO, but figure we have 2-3 days of panic buyers and short covering.\n\nEDIT: Keep in mind that the stock market as a whole is not necessarily representative of the economy. Economy looks sad, but a good quality stock/etf is still better than a bond or savings account.", "score": 1, "replies": []}, {"body": "when you talk fed you have to understand - NVidia is selling everything they make right now - so earning while they may not overwhelm won't be in crisis either - a 1% increase in borrowing costs just isn't that significant yet - the ? is whether they had much impact from reduced production from china current lockdowns but that wouldn't necessarily be reflected in the 1Q earnings for the most part - be careful the markets largest moves are sentiment based just look at how apple shot back up to ath recently", "score": 1, "replies": []}, {"body": "I would not do anything now with the stock pretty beaten down and tons of earnings the next few weeks.  Short after earnings if you want to.  Personally I'm always long biased so it's hard to short a company like NVDA which is actually the top dog in the sector.  I'd like to see some reason to short like it is up a ton in a short time etc.", "score": 1, "replies": []}]}]}, {"body": "It's already dropped from $345 to $220 in the past 6 months. Sure, dropping further is possible, but I have to imagine that at some point it will bottom out. Buying a put on a stock that's already dropped almost 40% seems like the wrong move. The market says that those 3/17 2023 $150 strikes only have a 15% chance of expiring ITM. Basically, few people are expecting that big of a correction.", "score": 22, "replies": [{"body": "NFLX would like a word, as well as all the pandemic tech and mortgage plays. NVDA is still grossly overvalued compare to the financials of intel, and no, I don’t believe their GPU business will eclipse intels CPU business.", "score": 2, "replies": [{"body": "What moved nflx is subscribers.\n\nWhat moves Nvidia isn't just consumer gpus which most people should expect to be lower (4000 series coming soon)", "score": 3, "replies": []}, {"body": "Not gonna argue about intel having better financials, but I can definitely see nvidia GPU business elipsing intel CPU business. \n\nAs a computer scientist, the most common bottleneck that i experience is GPU and not cpu. You can spend 600 - 700 dollars and you have a perfectly capable cpu that is enough for everything. For GPU, even with 2000 dollars you can run into performance issues. As a result, people are willing to spend more money on GPUs than CPUs. But yes, their earning multiple is still too high compared to intel.", "score": 1, "replies": []}]}, {"body": "Cisco topped at 74 and was down to 56 six months after. You could have said the same thing then. Ten years later it was 17$.", "score": 1, "replies": [{"body": "There are thousands of publicly traded companies, each with its story of price action. The truth is that none of us knows what will happen to NVDA a year from now. If people think they know, they're fooling themselves. So all we can do is make our plays according to our risk tolerance. I'd be hesitant to put much of my capital in play on a $150 NVDA put, but that's me.\n\nPeople come on here all the time asking about their trade idea. I generally try to give a counterpoint because an echo chamber doesn't help anybody.", "score": 3, "replies": []}]}, {"body": "> Buying a put on a stock that's already dropped almost 40% seems like the wrong move. \n\npretty much all of weed stocks like to have a word", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Yeah, just sold a put.  If I have to eat it, will be ok to take it at 45% down.", "score": 5, "replies": [{"body": "deleted because responded to wrong post", "score": 3, "replies": []}]}, {"body": "To POS you mean. \n\nCurrently they're POW. \n\nNot trying to be dick though\n\nActually agree, ETH 2.0 or whatever is their POS called these days is a disappointment and I have a chunk of my ETH stuck in CB until 2.0 is released, which is total BS. My fault, but BS.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Yeah that's enough to make someone a little anxious. \n\nI've been flipping ETH and made some decent returns, at least better than I made staking. \n\nIt's just a bit cringe that given there's no clear path to 2.0 and I don't see how CB can lock someone in for what feels like indefinitely.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Negative ghost rider. \n\nETH is switching from POW\n\nETH is switching to POS.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Cheers Mate 🍻", "score": 3, "replies": []}]}]}]}]}, {"body": "Earliest the merge will occur will be end of Q3 2022\n\nIt's definitely laughable how much it's been delayed in the past, but back then they were saying \"soon!\" when they are the 30m mark of a 100m race. Now they are saying \"soon!\" while they are at the 90m of a 100m race. There are test forks running multiple staking clients successfully and they are working out the final merge kinks as we speak. It's going to happen in the next 6 months barring some unforeseeable delay (like major countries banning Blockchain or global Internet attacks or something crazy). \n\nSource: I follow updates daily and closely as a heavily invested PoW miner.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "People giving other people their keys aren't hacks. You are referring to scams.\n\nThe Ethereum mainnet has not had 100m+ hacks. And I doubt the top 100 blockchains combined have even had 1m \"hacks\". Please don't pull random numbers out of the air. \n\nIf counties don't want PoW then that wouldn't hurt the progress towards moving to PoS... \n\nIt seems you have a lot of learning to do in the space. There are some awesome resources out there - let me know if you want some suggestions!", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Virtually the entire crypto community outside of miners are pro PoS - the inequity in ETH2.0 is due to the requirements for staking amount - which will be non-existent when the merge takes place. \n\nThere are hurdles to get over - but the merge is happening in the next 12 months. There's a reason GPUs are readily available now, it's because use miners know the end is coming.\n\nEdit: and again - I know hacks happen, but unless you have a source for 100 million plus hacks per year then I'm calling major BS there.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Source? Putting numbers up doesn't mean anything without a source verifying the information.\n\nEdit: can't provide a source then - got it.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Yikes, this would not be my play. Good luck.\n\nMy two cents, fed rate hikes have already been priced in for 75-100 bps. Anything short of that announced will almost certainly lift the markets. FOMC is the 4th, AMD earning is 3rd. I would wait until after these events to see how the market responds.\n\nhttps://www.cmegroup.com/trading/interest-rates/countdown-to-fomc.html", "score": 2, "replies": [{"body": "FED isn’t the only issue.   Try slowing growth and crazy comps.   Many companies, especially consumer discretionary & tech gonna get Netflixed as well.\n\nThis quarter gonna be crimson.", "score": 1, "replies": []}]}, {"body": "Buying puts... while RSI and MACD is going up... and a potential double bottom...\n\nGood luck, guy", "score": 2, "replies": []}, {"body": "Ive been seriously considering selling it short. Agreed 100% with your thoughts.", "score": -1, "replies": [{"body": "Short the rips, cover some on the dips.  Rinse & Repeat.   I don’t expect to see a bottom until possibly the end of the quarter - and only if Pancake Powell & crew reverse course.", "score": 2, "replies": []}]}, {"body": "Buyer will jump in as soon as it hits previous low. So no puts for me", "score": 1, "replies": []}, {"body": "God speed…", "score": 1, "replies": []}, {"body": "It makes sense to be a put buyer but I wouldn’t be so far out of the money and certainly wouldn’t pay up for such a long dated option in this stock. You’d probly make out with a better risk reward by purchasing a put spread 2-3 months out or even a wide butterfly put spread", "score": 1, "replies": []}, {"body": "Where did y’all learns options . I know what calls and outs are and some of the Greeks . But finding plays and the right stocks is my problem. I have $1000 to start with . Any suggestions", "score": 1, "replies": []}, {"body": "how'd this turn out ?", "score": 1, "replies": [{"body": "Sold puts with a loss. But that is because I'm fucking stupid - was up more than 200% in the middle of October on my $150 put. Became too greedy... Good (but not a fun) lesson", "score": 1, "replies": []}]}]}
{"title": "Your top stocks in your watchlist", "selftext": "Mine are:\n\n- Veolia Environment (Utilities, Waste Management, 4. largest recycling company)\n\n- Sony (Self-explanatory)\n\n- LVMH (Luxus Brands, Huge Conglomerate) \n\n- Blackrock (Passive Investing Trend etc.) \n\n- Big Tech / Bluechips (Apple, Google, Berkshire) \n\n- Shimano (Bicycle trend) \n\n- Costco \n\n- Danaher \n\n- Disney \n\n- Caterpillar (IMO best construction/building equipment) \n\nApart from that I got some speculative stocks I watch like:\n\n- Weyerhouser (Timber and much land, maybe a trend for „greener“ construction materials?) \n\n- Atlassian (Software for companies to use SaaS)\n\n- Shopify \n\n- MSOs (Cannabis) \n\nIf you want let me know your highest conviction stocks. \n\nRegards\n\n\nEdit: I know those questions are Asked frequently. Nonetheless it interests me :-)", "id": "u7ed5p", "created_utc": 1650399261.0, "score": 34, "upvote_ratio": 0.84, "num_comments": 76, "comments": [{"body": "Google is top of my buy list and picking up more Disney is probably the number two spot", "score": 28, "replies": [{"body": "Disney really seems interesting long term.\n \nJust watched a video about how Disney could use dead actors faces for new movies. \n\nThey are also releasing a movie with James Dean I think? (Dead for 70yrs now).\n\nKind of sounds dystopian but I also see how they could profit from that.", "score": 11, "replies": [{"body": "I see them as an entertainment powerhouse with a ridiculous content library and tremendous staying power. I have a hard time seeing it not being a good investment years down, I’m just not sure what my next entry point will be", "score": 10, "replies": [{"body": "This might sound dumb idk but ur just talkin bout normal buying shares and holding to see where it goes or you doing options ? Or lik in sum type of account lik ira, I’m new so I only ask to learn", "score": 2, "replies": [{"body": "I’m just holding shares. I did have some calls on Disney but sold them when they broke even. There is really no difference in terms of the shares whether you hold them in an IRA, Roth or other account, the only difference is how gains are taxed", "score": 2, "replies": []}, {"body": "Don’t buy derivatives if you are just starting", "score": 2, "replies": [{"body": "After work ima look that up but if it’s not too much wat is ah derivative", "score": 1, "replies": []}]}, {"body": "Ok I just didn’t know if it went deeper then options/ reg. Shares but yea I think soon ima start ah Roth but sumtime when I’m almost at my career height , ima switch it to reg ira so lik my retirement/kinda done with working I’ll b ima lower tax bracket and I’m turning 22 this week so obvi I still have years for all this but my long term plan with the ira’s", "score": 1, "replies": []}]}]}]}]}, {"body": "If I could afford it, I'd buy GOOG/AMZN.", "score": 14, "replies": [{"body": "Yeah can’t afford google now too :(", "score": 3, "replies": [{"body": "Stock splits coming up for both of them! 20 for one!", "score": 12, "replies": []}]}, {"body": "Not sure if you're interested but you can still play the potential impact to share price with debit spreads.\n\nFull disclosure: I'm long Google and have shares and options on them.", "score": 1, "replies": []}]}, {"body": "Costco is the first pick on the list. I don’t like that I haven’t got myself to buy, but it seems a little pricey. Even though they are brilliant.", "score": 18, "replies": [{"body": "The thing with them is the „membership“ or the subscription model, right? \n\nThat way they have steady cash flows.\n\nOr am I missing something.\n\nIf true, than I agree :-)", "score": 6, "replies": [{"body": "Exactly. Costco aims to have their margins on products as razor thin as possible. The membership is basically pure cash flow, just like you said.", "score": 4, "replies": []}]}, {"body": "Why not grab some BRK? Then you’ll have some exposure to COST.", "score": 3, "replies": [{"body": "They don't own Costco anymore. You are thinking of Munger - he owns Costco in his personal account.", "score": 3, "replies": []}, {"body": "Does BRK own Costco shares?", "score": 1, "replies": []}, {"body": "not anymore!\n\nthey sold the entire costco stake at the end of 2020", "score": 1, "replies": []}]}]}, {"body": "The only thing we share is Google!!\n\n![gif](emote|free_emotes_pack|scream)", "score": 7, "replies": []}, {"body": "Does everyone here just buy tech stocks? \n\nGet a bit boring seeing AMD, Nvidia, Google, Microsoft being mentioned over and over again.", "score": 15, "replies": [{"body": "Try dg", "score": 2, "replies": []}]}, {"body": "ROK, Rockwell automation. \nI feel on shoring will create a huge surge for their products. \n\nCCJ- cameco\n\nCanadian uranium miner. \n\nGGG-graco\n\nWide moat industrial company that makes paint spray machines. \n\nBLDR- builders first\nIt's of pessimism around home builders right now, but long term there's a huge need for new housing and lots of people wanting to move to areas that have land to build on. \n\nAOS- A.O Smith\n\nMakes hot water heaters and boilers and is half of a duopoly. Replacement water heaters are a huge market, and they always break, even in a recession.", "score": 4, "replies": [{"body": "But if housing slows down due to more expensive mortgages, wouldn't demand for water heater replacement go down?", "score": 1, "replies": [{"body": "Demand for new water heater installs would go down but replacements wouldn't. Still need hot water.", "score": 1, "replies": [{"body": "They last like 10 years or more. Why not get AAPL, every year people get new one.", "score": 0, "replies": [{"body": "I can't tell the difference between the last 4 iterations of Iphones. Literally nothing.\n\nI would know if I couldn't take a hot shower every morning.", "score": 1, "replies": []}, {"body": "Apple is very expensive. Also, as a homeowner, I can easily put off getting a new cell phone, but putting off getting a new water heater could lead to the old one breaking and flooding the basement leading to thousands of dollars of damage. \n\nAlso, apple needs to get a new feature for each upgrade. Even then, I don't understand why people get a new one each year. My phone is 4+ years old and works great. \n\nWater heaters don't require a new model each year. \n\nYou could own both of course.", "score": 1, "replies": []}]}]}, {"body": "If you have a water heater, it needs to be replaced when it wears out, or disaster can happen. Even if there isn't new construction, all the existing houses are still customers.", "score": 1, "replies": []}]}]}, {"body": "Disney is a huge position in my retirement account. I will continue to add, content powerhouse with huge moat and multiple revenue streams (sports, parks, movies, merchandise, etc)", "score": 3, "replies": []}, {"body": "CROX. Growing profits, big margins. P/E is around 7..", "score": 3, "replies": []}, {"body": "1. GOOGL\n\n2. AMD\n\n3. MSFT\n\n4. SOFI", "score": 6, "replies": [{"body": "One of these is not like the other.", "score": 19, "replies": [{"body": "Be a lot cooler if it was", "score": 3, "replies": []}]}]}, {"body": "Just one, Biogen (BIIB)\n\nI usually do a ton of DD before committing any kind of money but I like this stock.", "score": 2, "replies": []}, {"body": "I actually share a few stocks with you:  Google, Berkshire, Costco, Danaher.\n\n\nAnd also some trends, but with different stocks:\n\n- Luxury: Hermes International (vs LVMH)\n\n- Passive investment: MSCI (vs Blackrock)\n\n- Building equipment: Ritchie Bros Auctioneers (vs CAT). I get it is not quite the same, but you can see where I'm going...\n\n\nFinally, I leave some of my conviction stocks, already bought or in my watchlist:\n\n- Credit Agricole (best French bank but quite unknown outside of France)\n\n- Mayr Melnhof Karton (largest producer of recycled cartonboard worldwide, Austria)\n\n- Accor (personal favorite hotel brand, France)\n\n- Goodman group (logistics & industrial real estate, Australia)\n\n- Logitech (self explanatory, Switzerland)\n\n\nPs I have doubts wether to add Atlassian, I'm actually trying to gain some insights on the industry by talking with insiders. Would you mind sharing your thoughts on this one?", "score": 2, "replies": [{"body": "I work with Atlassian.\n\nFor me personally it’s a useful tool. \nEspecially if you work in a team.\n\nBut apart from that I did hear good and bad things from other customers.\n\nI wouldn’t buy much of them though. It’s a bit speculative and also very highly valued", "score": 2, "replies": [{"body": "Thanks for the insight!", "score": 2, "replies": []}]}, {"body": "Why not LVMH though? In my opinion it’s a safer bet.", "score": 1, "replies": [{"body": " 'The truly wealthy customers want the real deal – authentic luxury brands – not poseurs or pretenders.'\n\nI'm Spanish, but I found a Forbes article that will help you understand my preference for Hermes vs LVMH conglomerate:\n\nhttps://www.forbes.com/sites/pamdanziger/2018/08/01/louis-vuitton-or-hermes-which-is-the-more-authentic-luxury-brand/?sh=711f6a19bab0\n\n\nA little summary in case you don't have time to read it:\n\n\n - Authentic luxury whispers, it doesn’t shout:\nOverall, LVMH is far more heavily invested in marketing and selling expenses than Hermès. \n\n- Authentic luxury isn’t for everyone, but for that special someone:\nWhile Hermès rejects celebrity endorsements as a marketing strategy, Louis Vuitton fully embraces it. For example, Angelina Jolie was paid some $8.5 million\n\n- For authentic luxury the deeper you dig, the more authentic it becomes:\nFor example, the Business of Korea reported this year that Louis Vuitton shoes are produced in a factory in Romania then shipped to Italy where the soles are attached. That is so it can affix a “Made in Italy” tag on each one\n\nAs Abraham Lincoln said, “You can fool some of the people all of the time, and all of the people some of the time, but you can not fool all of the people all of the time.”", "score": 2, "replies": [{"body": "Thank you very much for that summary!", "score": 1, "replies": []}]}]}]}, {"body": "There is only one megatech that will remain king of the hill for at least ten years to come and that is Apple.  AAPL is a buy now in the 160's. \n\nAAPL is for sale at 10% off now due to the China covid shutdowns but  turns out Apple is so good at managing these kinds of things now that it only affected them for about a week, and they can make up a week's production within a month. So any loss of sales this Q gets quickly replaced for next quarter.  I also consider GOOGL, FB and AMZN greedy ands elfish to not pay dividends. I never trust a company awash in cash which wont give back to their shareholders or even have stock buybacks.   AMZN also has some serious problems now with inflation and unions, and FB and GOOGL are the two mostly likely to be hit with regulatory measures, plus ongoing resistance from Apple to allow datamining on IOS.", "score": 2, "replies": []}, {"body": "* AI\n* COIN\n* EXPI\n* HYPR\n* ITI\n* PLBY\n* RBOT\n* SWCH\n* TDOC\n* TWST\n* WMT\n\nMSFT was on there but I opened a position today.", "score": 3, "replies": []}, {"body": "HITI. When marijuana stocks get popular again this one is going to pop pretty good. Steady and strong growth the past 2 years. Lots of acquisitions. Uplisted to nasdaq within the past year.", "score": 4, "replies": [{"body": "I hate how much we’ve been diluted but hopefully it’ll all be worth it in a few years", "score": 1, "replies": [{"body": "I feel ya on that. I bought pre-uplisting to nasdaq. I'm in with a cost basis of $8.75 therefore im getting absolutely rekt right now. I always planned on holding for at least 5 years so im not worried, but it would be great to see this stock take off. I think marijuana stocks in general will gain some popularity again eventually, regardless of legal status in the USA. But if it does ever become legal... good lawwwd is HITI going to take off.", "score": 1, "replies": [{"body": "Same, pre-nasdaq uplist kept averaging down and i'm at $9.13, ugh. Agreed on legalization happening eventually. just a matter of how low this could go in the meantime. If they're going to keep diluting this much I need to see some better revenue and FCF growth than what we've been getting", "score": 1, "replies": []}]}]}]}, {"body": "I’m amazed how well Apple has held up given most tech companies have fallen quite a bit. Once they go back to the $150s I’m in.", "score": 2, "replies": [{"body": "Unless their earnings are an absolute disaster I don’t think we will see $150 again.", "score": 7, "replies": []}, {"body": "You’re gonna need another split to see AAPL at $150.", "score": 6, "replies": []}]}, {"body": "SBNY and SI.  I think crypto has a bright future, but I dont know which crypto to invest in.  So I will invest in the banks which underwrite most of the crypto transactions.\n\nSBNY also handles a lot of private clients (IE rich people).  If a recession hit, a rich person's bank will be less impacted than most commercial banks.", "score": 2, "replies": [{"body": "> SI\n\nHow do I evaluate this stock. I know they are building some important infrastructure for Cyrpto transfer and lending. But what I don't understand is how much of a moat they have (i.e. can another bank or crypto company easily displace them)?\n\nAlso, how much exposure do they have to interest rate growth?", "score": 1, "replies": []}]}, {"body": "Coinbase (COIN)\n\nFacebook (FB)\n\nOil & Gas: Chevron, EOG, Occidental and Devon\n\nMP Materials (MP) \n\nI already own these above and would be adding to respective positions.", "score": 1, "replies": [{"body": ">Oil & Gas: Chevron, EOG, Occidental and Devon\n\nEver thought about Ovintiv?", "score": 1, "replies": [{"body": "Not familiar with it, but has a beta of over 3 so that one can move super quick!", "score": 1, "replies": []}]}]}, {"body": "SCRN DM TAIGA LEV CBDT PSYC YOUR LSPD", "score": 0, "replies": []}, {"body": "Atlassian has been down for how long now? Still expecting weeks to recover from a major outage. Their products... Are hated. They are pushing cloud but can't manage a cloud service. Long term, I think the company is fucked. Inertia will o ly carry so long before something better starts eating away at them.", "score": -1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Dependent on something you hate isn't uncommon. We still have Oracle. A shocking lack of communication by Atlassian is embarrassing though during this whole incident. Displacement takes time and is slow. Ask IBM.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Like all those customers who hate you're trying to force everyone onto cloud versus on-prem? You keep saying businesses love you, but you were built on the back of developers who used to enjoy the products. But that's gone now. Maybe you can argue it's maturity, but to me it signals peaking. Developer tools that aren't loved by developers anymore. But businesses keep using us!\n\nThis is stocks, I am a software developer, I invest in a lot of software companies. If developers don't love it, I don't invest in it. Long run, bad signal.", "score": 1, "replies": []}]}]}]}]}, {"body": "Ater\nFATH\nHymc", "score": 1, "replies": []}, {"body": "HUBS, AVGO, MDB, SNOW", "score": 1, "replies": []}, {"body": "Universal Display gatekeeper of oled. Clearsign tech to reduce emissions 40 million market cap with Exxon evaluating tech, new regulations make it a requirement.", "score": 1, "replies": []}, {"body": "L'Oréal people will always want to look good", "score": 1, "replies": []}, {"body": "Today buy PARA and WBD, the ones causing Netflix to lose market share which are inexpicably down 6-9% today in sympathy. same thing happened when Netflix missed last quarter and PARA turned out to be an excellent buy that day,", "score": 1, "replies": []}, {"body": "Dollar General", "score": 1, "replies": []}, {"body": "HSY\nSBUX\nWM", "score": 1, "replies": []}, {"body": "Nice to see Veolia getting some love a European WM with a low pE and world wide exposure.\nWith it tentacles in water as well, a good buy imo", "score": 1, "replies": [{"body": "Once they figure out how to drink seawater for cheap, game over, they've conquered the world. Veolia has the largest and leading desalination program on the planet and just took out their largest rival, Suez. And stock still undervalued. Good pick OP. These Googlefkers should learn how to use their own search engine.", "score": 1, "replies": []}]}, {"body": "Have positions in Disney that will hopefully pay off before they expire. \n\nAlso considering a credit spread on Atlassian (TEAM)", "score": 1, "replies": []}]}
{"title": "What's a good stock to buy with a high dividend for 1st time Investor?", "selftext": "Hi all I'm looking to start investing as early as next month and looking for a long-term hold. I am looking for high dividend stocks. I am going to buy 2 stocks a month going forward I am currently looking at IBM dividend at 1.64USD and Southern Copper or Suncor Energy thoughts", "id": "u7hf5k", "created_utc": 1650407555.0, "score": 0, "upvote_ratio": 0.36, "num_comments": 77, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|5|**First Seen In WSB**|1 year ago\n**Total Comments**|3|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=u7hf5k)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=u7hf5k)", "score": 1, "replies": []}, {"body": "r/dividends will get you a better yield in terms of answers", "score": 33, "replies": [{"body": "I see what you did there.", "score": 5, "replies": []}]}, {"body": "Go to r/investing this is not the sub for those kinds of decisions.", "score": 34, "replies": [{"body": "Step 1: leave WSB and never look back.", "score": 19, "replies": []}]}, {"body": "What do you know about IBM?  Too late I already bought calls.  Thanks for the DD.", "score": 16, "replies": [{"body": "My opinion: IBM, terrible stock only goes sideways but at least you wont loose your ass like NFLX holders just did.  It's only down 9.4% this year.  Their earnings beat expectations but EPS is lower than its been for 10 years. There are better dividend yielding stocks in my opinion. But at least you should of made money with your calls, good on you =)", "score": 2, "replies": []}]}, {"body": "2 shares or 2 companies? If you are looking shares, FDL is a dividend ETF that's a good way to start small.", "score": 5, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "You’re going to get wrecked here, go do a basic google search on investing and then do some research.  Best advice you will get here is to buy broad based etfs, often so you dollar cost average, and do that over a long time frame and you’ll make money.  This sub is for making bets, not investing.", "score": 12, "replies": []}, {"body": "An ETF is an exchange traded fund. In essence, it is a mutual fund that gets traded like a stock instead of at the end of the day like a traditional mutual fund. There are a few other subtle differences, but for someone who wants to hold that difference is not a big deal. \n\nThe nice part about this is if your goal is dividend investing, this will stay a little more consistent since it is a basket of stocks, so if one eliminates their dividend it gets sold by the fund. It also will move more like the market, so slightly less volatile.", "score": 3, "replies": []}]}]}, {"body": "Suncor has been doing very well and could rise if Europe stops buying Russian oil", "score": 4, "replies": [{"body": "I have been following it for a month", "score": 1, "replies": []}]}, {"body": "XOM", "score": 4, "replies": []}, {"body": "Invest heavily in whiskey and whores.", "score": 4, "replies": [{"body": "No cocaine?", "score": 3, "replies": []}, {"body": "always a good return on investment", "score": 2, "replies": []}, {"body": "MGPI for the whiskey, which stock for the whores?", "score": 2, "replies": []}]}, {"body": "$DZNUTS", "score": 6, "replies": []}, {"body": "MO", "score": 3, "replies": []}, {"body": "O it's ruffly 0.8%per month I think I goofed early I think I doubled it oh well", "score": 3, "replies": []}, {"body": "Go buy VZ\n\n5% div, that's safe.  Price stays consistent no matter what's going on", "score": 2, "replies": []}, {"body": "SPYD", "score": 2, "replies": []}, {"body": "Sir this is a fuckin Wendy's, place your order or gtfo", "score": 2, "replies": []}, {"body": "QYLD is the NASDAC dividend fund and it returns 12%", "score": 2, "replies": []}, {"body": "Verizon", "score": 3, "replies": []}, {"body": "$DEEZ", "score": 3, "replies": [{"body": "What's $DEEZ?", "score": 2, "replies": [{"body": "I am partial to LGMA but will have to check out DEEZ...", "score": 1, "replies": []}]}]}, {"body": "gamestop", "score": 3, "replies": [{"body": "👑", "score": 1, "replies": []}, {"body": "+1 for gamestop", "score": 1, "replies": []}]}, {"body": "Berkshire Hathaway, grab a few to max the 2.5% divi yield.", "score": 2, "replies": [{"body": "Berkshire doesn't have a dividend", "score": 3, "replies": []}, {"body": "[deleted]", "score": -5, "replies": []}]}, {"body": "$ZIM paid a 17.00 dividend/share and they are swimming in free cash flow.\n\nStock has been hammered the past month because of the div payout and it’s moving back up because of the backlog and rising shipping costs.\n\nProbably will be another 12.00-15.00 dividend this quarter too", "score": 2, "replies": [{"body": "thanks for this", "score": 1, "replies": []}, {"body": "No way that's happening.", "score": 1, "replies": [{"body": "It could easily happen again. With the amount of cash flow. It’s possible.", "score": 1, "replies": []}]}, {"body": "Agreed", "score": 1, "replies": []}, {"body": "The argument against ZIM is that with rising shipping prices, more and more companies are looking to create their own shipping departments. I don't know if that's true or when/how much it would actually hurt ZIM's business, but there you go.\n\nI think it's a fun stock to play. I missed the dividend this year and still made money.", "score": 1, "replies": []}]}, {"body": "Why buy safe stocks that give you something when you can throw money at something that could possibly maybe in some way make you rich??\n\nLike NAK…currently about 40 cents a share…if it gets approved it’s an “instant” $25-$750 a share.", "score": 0, "replies": [{"body": "this is good", "score": 2, "replies": []}, {"body": "I would like to know more", "score": 1, "replies": [{"body": "The EPA is stopping the single largest deposit of copper and gold and other metals from being dug because it’s 125 miles away from Bristol bay Alaska. That’s pretty much it it’s 20%ish of the worlds copper/gold in one place and we’re not digging it cuz fish and politics", "score": 0, "replies": []}]}]}, {"body": "IBM or VTV (etf)", "score": 0, "replies": []}, {"body": "Are you lost?", "score": 0, "replies": []}, {"body": "T", "score": -1, "replies": []}, {"body": "BP, INTC", "score": 1, "replies": []}, {"body": "GOGL", "score": 1, "replies": []}, {"body": "$SBLK seems to be strong.  I have a bunch of it bought at 18.00", "score": 1, "replies": []}, {"body": "PBA is solid", "score": 1, "replies": []}, {"body": "IBM is terrible. You’re welcome.", "score": 1, "replies": []}, {"body": "AB Alliance Bernstein", "score": 1, "replies": []}, {"body": "BRK-B", "score": 1, "replies": []}, {"body": "Apple.", "score": 1, "replies": []}, {"body": "There are websites where you can screen for stocks by dividend yields.", "score": 1, "replies": []}, {"body": "ZIM...", "score": 1, "replies": []}, {"body": "I'm in SU, so I like that one because I'm in it.   I'm also in TSLX - I don't know what they do, something about lending out sixth street for the special olympics...  but I like the dividends they've been giving me.\n\nAlso ZIM, they gave a fat dividend and I wouldn't be surprised if they do another one next year.", "score": 1, "replies": [{"body": "tslx is only 0.41usd how much do you net in a qwarter", "score": 1, "replies": [{"body": "$0.41 per share in Jan, $0.11 per share in March, $0.41 per share April.  Annual yield was 7% over past year compared to current stock price.", "score": 1, "replies": []}]}]}, {"body": "This is wsb so I'd say QYLD or NUSI", "score": 1, "replies": []}, {"body": "You're asking in the wrong place but i like RC for high yield dividend - Quarterly Dividend  \n$0.42 /share roughly  11.08% annually. Stock is trading at 14.70 because we just had a div ex date. Will slowly rise to 15 dollar range, rinse and repeat.", "score": 1, "replies": []}, {"body": "O is a good one. REIT", "score": 1, "replies": []}, {"body": "Sir, this is a casino.  Take your dividends to somewhere more responsible.", "score": 1, "replies": []}, {"body": "NFLX", "score": 1, "replies": []}, {"body": "ET, looks promising!", "score": 1, "replies": []}, {"body": "MAIN...love that stock, it pays monthly dividends with occasional special dividends.", "score": 1, "replies": []}]}
