{"title": "$34k Tesla scalp", "selftext": "", "id": "tzhti0", "created_utc": 1649465780.0, "score": 95, "upvote_ratio": 0.89, "num_comments": 74, "comments": [{"body": "Balls of steel for not getting scared by 9:30 spike", "score": 20, "replies": [{"body": "Wasn't that early. Trade was at 12:32 pm and in and out in less than 10 minutes after plotting a break in an uptrend with those support lows that reversed.", "score": 12, "replies": [{"body": "Good explanation. Shit like this makes it painfully clear that spending the time learning to plot can pay. \n\nAnyone have a good starting point on drawing lines? Any particular site/video/series that helped you?", "score": 9, "replies": [{"body": "https://youtu.be/PuboYnBc0t8\n\nhttps://youtu.be/UhRUbckhKog", "score": 4, "replies": [{"body": "Thanks very much for a starting point man. I've been trading around basic indicators like bollinger bands and RSI for the last month or so, along with simple and easy to identify candlestick patterns. I definitely see my success rate and decision-making improve with each new tool that I learn to use for TA. \n\nGonna watch these in a little bit, very much appreciate the links.", "score": 2, "replies": []}]}, {"body": "It doesn't work just as many times as it does. Don't get your hopes up", "score": 6, "replies": [{"body": "True that. It can give you some better chances but is still far from guaranteed. If it was, everyone would be rich", "score": 5, "replies": [{"body": "It won’t give you better chances. It actually worsens it.", "score": 1, "replies": [{"body": "Technical analysis is based off of historical correlations. I've yet to see any proof that proper application worsens chances, but I'd like to see your sources.", "score": 1, "replies": [{"body": "Proof? You want proof? If TA worked, there would be plenty of algos that would have 100% efficiency  in trading, but there isn’t. Historical correlation doesn’t equate to future results. Those who perform TA, equate their results to what we call “self fulfilling prophecy”. This means that if enough people do the same “TA” it eventually becomes true, hence people become delusional.", "score": 1, "replies": [{"body": "I'm not denying self fulfilling prophecy is rampant in the investing world, but I didn't say TA \"worked,\" I said it can increase odds. For that reason, algos USE TECHNICAL ANALYSIS. They are fundamentally based in it, along with the small tweaks to calculations made by real people as market conditions change.", "score": 2, "replies": []}]}]}, {"body": "My P/L this month says different", "score": 1, "replies": [{"body": "A broken clock is still right twice a day.", "score": 1, "replies": [{"body": "Good thing I’ve been right more then twice and I know of plenty of other people who have made tens of thousands every month", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Don’t draw lines. It won’t get you anywhere. Especial2 pulled this explanation out of his astrology book of TA after the stock has moved. It’s just like me saying ahh yes we see two monkey dick pattern on Tesla, that’s why it dipped after the rip. Stocks move on emotion, news, and algos. You can’t use TA to predict that. Don’t waste your time.", "score": 1, "replies": []}]}, {"body": "My guess is that he was also probably smart enough to set a stop loss at maybe 0.28 a contract which would have limited the loss to a little over 3k.", "score": 4, "replies": []}]}]}, {"body": "you spent 30,000$ on 1hour DTE. nice", "score": 18, "replies": []}, {"body": "You crazy bastard.", "score": 10, "replies": []}, {"body": "Quality content. Nice.", "score": 7, "replies": []}, {"body": "It take Gigaballs to buy puts the day after Gigapump event by Musk....well done 👍", "score": 6, "replies": []}, {"body": "Teach me how to use crayons like you", "score": 5, "replies": []}, {"body": "Message sent", "score": 3, "replies": []}, {"body": "beautiful", "score": 3, "replies": []}, {"body": "Been doing the same!!! Fucken 5 and 15 min charts are awesome huh", "score": 3, "replies": [{"body": "Especially in 0dtes", "score": 1, "replies": []}]}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": [{"body": "Position and rationale posted in the photo!", "score": 3, "replies": []}]}, {"body": "Did you have a stop loss, if so where was it?", "score": 2, "replies": []}, {"body": "Hope you recognized the high probability of a bounce at $1029 in the fakeout territory. Else you gonna get fucked one of these days.\n\nH&S patterns are not very reliable.  Getting the full measured move is also not reliable.\n\nYou gave yourself an ~hour for it to barely eek out just ITM before theta would have made those calls worthless.  Luckily for you it played out immediately.\n\nYea I dunno, seems pretty fucking stupid to me but maybe you're just rolling in fuck you money to throw in gambles like this.", "score": 2, "replies": []}, {"body": "SICKO MODE! y TSLA tho?", "score": 1, "replies": [{"body": "Cuz TSLA is the best stock for momentum trading", "score": 5, "replies": []}]}, {"body": "No restrictions that are TD specific. Same as any other IRA. Cash secured puts and covered calls for selling. You can buy whatever you want", "score": 1, "replies": []}, {"body": "Funny how they can buy and sell options within minutes of each other, but if we do, that's a violation. Fuck them all.", "score": -3, "replies": [{"body": "You need 25k in your account then you can sell and buy whenever you want", "score": 9, "replies": [{"body": "Cash account bro stop whining and get to 25k", "score": 6, "replies": [{"body": "Even with cash account you can’t trade unlimited since you have to wait for the funds to settle. Especially when you use all the funds for single trade every time.", "score": 1, "replies": [{"body": "This is true but also retarded. Options are cleared the next day. If you’re all in yolo more than 3 times a week PDT was meant for you.", "score": 6, "replies": []}]}]}, {"body": "Yeah, I should be okay. Do you know if there's any restrictions with IRA accounts?", "score": 1, "replies": [{"body": "I never own one so not sure.", "score": 1, "replies": []}, {"body": "Yes 2. Margin is not possible in an IRA so you can’t do spreads and you can’t trade options with an expiry date of less than a week away.", "score": 1, "replies": [{"body": "Some brokerages don’t consider spreads to be margin. My Roth with TDA is where I hold LEAPS and I sell diagonal calendar spreads (pmcc) on them", "score": 2, "replies": [{"body": "Really… that is good to know. With Merrill though, which is where I have my IRA, I can not trade spreads. Does TDA let you trade regular monthly credit spreads through your IRA?", "score": 1, "replies": [{"body": "As long as it’s a spread with defined risk (I think all spreads are) and you have cash collateral equal to max loss. No securities can be used as collateral. Also no naked calls or margined puts, obviously. Those (along with long positions using margin) are the only things that actually use margin according to the law. \n\nSpreads technically aren’t margin because with defined risk it’s impossible to lose more than that amount, so as long as the broker requires cash collateral equal to max loss no margin is put up as collateral or used.\n\nSorry if that was hard to read or if it seemed like I was repeating myself. Still waking up. \n\nI transferred my Roth at Vanguard over to TDA after some Googling on who allowed it (I already used TDA for my taxable account which was nice). I decided that a 401k was enough for passive investing, and if I was to hold 10%-15% of my portfolio in LEAPS, anyway, I might as well do it in a tax free account. I pretty much consider my Roth and taxable accounts as one, now. I don’t have to worry about long vs short term capital gains when choosing a strike or exiting early, don’t have to worry about any tax on leveraged gains for that matter. And now with TDA I can make extra cash selling calls, also with no taxes. I use that cash as leverage for the occasional spread and eventually I’ll be able to buy another LEAPS in that account.", "score": 2, "replies": [{"body": "Thank you for your detailed explanation. In Merrill I can do the individual components of a credit or debit spread but, it would severely impact the buying power. Like buy an AMZN 3200c and sell a 3210c. Purchased as a spread in my margin account, the buying power used would only be $1,000. However, if I were to do this in Merrill, I’d have to do the individual legs. Buying the 3200c would be no problem at $3-$10k (depending how far out you go) but, I wouldn’t be able to sell the 3210p because I’m a little short of the $315,000ish collateral LOL", "score": 1, "replies": [{"body": "No problem.\n\nYou first mentioned a bullish call debit spread, did you mean to? Also, just to note, selling a single 3210c would be infinite risk, technically, so even with 1,000,000 in cash you wouldn’t be allowed to do it in a retirement account.\n\nAnyway, the trade you mentioned is a debit spread, but assuming you meant a bearish call credit spread, you would only need $1,000 collateral to make the trade in TDA with the highest options level, just like your margin account.", "score": 1, "replies": [{"body": "Really just talking about any of the common spreads with 5-25 wide strikes. My AMZN example was mistakenly reversed though, meant sell the lower strike and buy the higher strike.", "score": 1, "replies": [{"body": "Then yep, you're right. Fun fact, in case you didn't know, purposefully reversing that order is like buying an OTM call for less money. It limits your profit to the difference between the two strikes, though.", "score": 1, "replies": []}]}]}, {"body": "I’m pretty sure my TD Roth account just holds the max loss in margin for any spreads I have open, rather than treating it like separate positions.", "score": 1, "replies": []}]}]}]}]}, {"body": "Have a Roth with TD.  I trade spreads in that account, and buy/sell FD’s at my leisure.", "score": 1, "replies": []}]}]}]}, {"body": "Who is they?", "score": 3, "replies": [{"body": "Whoever can buy 1k puts at .31 ($31,000) and sell them for .66 ($66,000) in less than 5 minutes. I don't know about you, but Fidelity limits how many options I can buy in a single transaction, which is 200.", "score": -5, "replies": [{"body": "Oh, well open a TD account. I’ve got both.", "score": 4, "replies": [{"body": "Both what?", "score": 1, "replies": [{"body": "I have TD and Fidelity accounts.  I opened the TD account because they are less strict for approval levels.\n\nEdit:  the screenshot is think or swim, presumably a TD Ameritrade account", "score": 5, "replies": []}]}]}, {"body": "Fidelity is a boomer broker, try ibkr or td\n\n&#x200B;\n\nactually try Tastyworks, transaction fee capped at $10 so 1000 contracts still has $10 fee.  \nibkr will probably charge you $3000 trading 1000 contracts.", "score": 6, "replies": [{"body": "Fee cap is nice but their platform is buggy and I’ve seen a lot of people get screwed by technical mistakes with the site", "score": 1, "replies": []}]}, {"body": "I can nearly guarantee that if you were able to buy 1000 contracts of *anything* your money would evaporate faster than you could load the sell button on your broker. \n\nOP knows what he's fucking doing and is posting gains for a reason.", "score": 2, "replies": []}]}]}, {"body": "It’s a violation? I’ve bought and sold within a few hours of each other", "score": 3, "replies": [{"body": "It’s a day trade “violation.” You get a set amount per day. Depending on your broker there are ways to get around it though. OP likely is not held to day trading rules", "score": 2, "replies": []}, {"body": "You don’t know shit about investing 😂 I’m only 21 and could trade circles around you. Where’s you dad at😂😭", "score": 1, "replies": []}]}]}, {"body": "I don’t see any option which sold under $100 at that time. 🤔", "score": -3, "replies": []}, {"body": "what app/broker is this?", "score": 1, "replies": [{"body": "Think or swim", "score": 1, "replies": []}]}, {"body": "Were you tempted to initiate at $1042?", "score": 1, "replies": [{"body": "Not at all. That was a bullflag. I got in on a head and shoulders pattern w the right shoulder breaking the trendline. Super e z Money.", "score": 3, "replies": []}]}, {"body": "Question how much can u make with just 1 option? If I  trade TSLA . I like scalping like that but I don't have enough capital", "score": 1, "replies": [{"body": "Each one was $33", "score": 1, "replies": []}]}, {"body": "How did you know it was going down???", "score": 1, "replies": [{"body": "Head and shoulders pattern, breaking trendline", "score": 1, "replies": [{"body": "Thank you", "score": 1, "replies": []}]}]}, {"body": "Fucking love it, well done", "score": 1, "replies": []}, {"body": "Damn this is true degen\n\nI would swear my puny balls thinking of possible instant -50% wipes", "score": 1, "replies": []}, {"body": "Traded on 5 min??", "score": 1, "replies": []}, {"body": "which app is this, sorry im a noob", "score": 1, "replies": []}]}
{"title": "played Tesla options last week. 5k to 17k", "selftext": "", "id": "u04zf6", "created_utc": 1649546660.0, "score": 375, "upvote_ratio": 0.94, "num_comments": 75, "comments": [{"body": "Congrats and fuck you", "score": 73, "replies": [{"body": "🤣", "score": 8, "replies": []}]}, {"body": "I was down 24k last year. Recovered most of it this year. Now let's see where this takes me.", "score": 51, "replies": [{"body": "now toss it all on SST calls see you in a week.", "score": 21, "replies": [{"body": "I’m so mad I sold my contracts would’ve been up 8,000% ![img](emote|t5_2th52|4260). Now I’m back to sucking dick behind Wendy’s", "score": 12, "replies": [{"body": "My absolute best plays are the ones i sell out early. Just the other day i sold out of my call options for NVDA as i was finally at breakeven.......just to turn around and see if went up 400+% the next couple hours", "score": 3, "replies": []}]}, {"body": "Is that what the cool kids are investing in?", "score": 8, "replies": []}, {"body": "🚀🚀🚀", "score": 6, "replies": []}]}, {"body": "What type of options are you playing? Spreads? Calendars? I'm trying to recover my portfolio with spy and iwm options. Also, I a call options for tsla on Friday and it got crushed!", "score": 3, "replies": []}]}, {"body": "Still with Robinhood. Niiiiiice.", "score": 8, "replies": []}, {"body": "Take the money and run. If you play again you’ll lose it and more odds are very much against you", "score": 9, "replies": [{"body": "Take 10k, keep yoloing with 7k and slowly keep increasing your capital", "score": 11, "replies": [{"body": "^^ This man earns.\n\nWtf are you doing in wsb?", "score": 5, "replies": []}, {"body": "What he should after losing that 7K.. get that 10K out to yolo is what you are saying??", "score": 4, "replies": [{"body": "With 7k he can make profit of 10k more, then take 5k from there and save other, if he loses the initial 7k then ya he can jse that 10k for that too", "score": 1, "replies": []}]}]}]}, {"body": "What options did you buy and for how far out?", "score": 5, "replies": [{"body": "All tsla for this week. Started with 1100 put monday. Then 1050 Tuesday put 1035 call on Wednesday and 1035,1030 and 1050 puts on Friday.", "score": 23, "replies": [{"body": "Dam it how so accurate on those picks and directions.. do you TA or follow someone on discard on those picks??? What’s the secret..!", "score": 3, "replies": [{"body": "The secret is luck. This time next week he will have lost it all.", "score": 10, "replies": []}, {"body": "I have lost 24k last year by getting emotional about my plays. Now I try to keep my emotions at bay", "score": 7, "replies": []}]}]}]}, {"body": "Finna check premiums on all those dates via ToS to get a better mental image of how you played this one.", "score": 7, "replies": [{"body": "Will pull that info soon.", "score": 3, "replies": [{"body": "You had great timing. I checked. You mainly played 0DTE options. \n\nMy question is were you already someone who followed tesla and therefore had a good gist of price movement? Or was this just blind guessing?", "score": 8, "replies": [{"body": "I follow Tesla but frankly in my opinion it has its own whims and I got lucky and played with balls of steel was down 11k from 19k but did not sell on a fucking Friday", "score": 10, "replies": [{"body": "You had 11k riding on a 0DTE and held? Lol this is why I'll never make this kind of money off options. I can't handle that kind of loss.", "score": 11, "replies": []}, {"body": "Congratulations! May you see more success", "score": 3, "replies": []}]}]}]}, {"body": "[removed]", "score": 0, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "[removed]", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Which way way is it going this week you think? Besides to the right.", "score": 4, "replies": [{"body": "I simply did not care. I was mostly looking for bottoms and peak resistance for the stock and playing them in my favor", "score": 7, "replies": [{"body": "Well there’s obviously support right around 980-1020, what’s your next entry point?", "score": 5, "replies": [{"body": "otm Calls at 700, otm puts at 1200 my guy. Obviously dont get burned by IV and give some cushion for theta.", "score": 3, "replies": []}]}, {"body": "Chad", "score": 1, "replies": []}]}]}, {"body": "Played HMHC and SST and fucked both", "score": 5, "replies": []}, {"body": "Very nice work, No pressure for this week coming….", "score": 2, "replies": []}, {"body": "Turn that wheeeeeel", "score": 2, "replies": []}, {"body": "Congrats and fuck me", "score": 2, "replies": []}, {"body": "Good hits.", "score": 2, "replies": []}, {"body": "What is the play for 4/20 earning?", "score": 2, "replies": [{"body": "Seriously. I’m guessing it’s gonna surge just due to the meme factor of stellar earnings on 4/20..", "score": 3, "replies": []}]}, {"body": "Switch to puts if you wanna keep making money.", "score": 2, "replies": []}, {"body": "nice HODL", "score": 2, "replies": []}, {"body": "Strange looking loss porn. I think you did it wrong", "score": 2, "replies": []}, {"body": "Godspeed", "score": 2, "replies": []}, {"body": "I also played Tesla options last week. Turned 2k into 0", "score": 2, "replies": []}, {"body": "What happens this week bro lmk", "score": 2, "replies": []}, {"body": "Tesla call options are like free money. Ya know when it you got Elon Musk to back us up.", "score": 1, "replies": [{"body": "Most of these were puts", "score": 1, "replies": []}]}, {"body": "good job!\n\nill be selling tsla puts next week, interested?", "score": 1, "replies": []}, {"body": "How do I even start to do this", "score": 1, "replies": []}, {"body": "$5k to $17K? Bro during that run tsla was turning $200 calls into $12,000 with $5K playing tsla you should have $40K atleast", "score": -5, "replies": [{"body": "I wish", "score": 3, "replies": []}]}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Congrats and Fuck You dudeeee", "score": 1, "replies": []}, {"body": "That’s what happened when I make a transfer", "score": 1, "replies": []}, {"body": "Well that escalated quickly... 😂", "score": 1, "replies": []}, {"body": "Did you do put spread or was just puts", "score": 1, "replies": [{"body": "Just puts and calls. I do not understand put spreads that clearly", "score": 1, "replies": [{"body": "Well good shit man I wish I could do that", "score": 2, "replies": [{"body": "The secret is to start with enough capital to sell naked puts. This amounts to fun money for OP", "score": 1, "replies": [{"body": "Ohhhh", "score": 1, "replies": []}]}]}]}]}, {"body": "Short Nasdaq from the second week of May till the end of May  or so. Including Tesla. Tesla is going to really take off when they start crushing Apple and Samsung with their new phone. Nice pairs trade long TSLA and short Samsung and Apple when TSLa phone comes but Idk the timing on the phone but it's coming.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Nope", "score": 1, "replies": []}]}, {"body": "Good play \n\n\nKeep it light. Don’t go for crazy gains. Just take profit when it shows.", "score": 1, "replies": []}, {"body": "Awful lot of day trades for someone with less than $25k in their account.", "score": 1, "replies": []}, {"body": "Your put on Apr 4 was clever.   I couldn't see it.\n\nBecause on Apr 4 the stock was up 5.6%, until the last 2 hour it began to stay flat, then the next day Apr 5, it dropped.\n\nWhich indicator do you use?\n\nDo you use 15 min time flame to monitor TSLA?", "score": 1, "replies": []}, {"body": "All on Tesla too! Love it!", "score": 1, "replies": []}]}
