{"title": "Apple selling C/C and puts, seems like you could turn 100 shares into 1k shares in 5-6 years", "selftext": "Hey all, I'm strongly considering putting aside 20k for this strategy. Buy 100 shares (of course starting with a CSP for the discount and premium) and the premium for the weeklies seems to always be enough to at least buy 1 more share. I know IV is dummy high right now, but I've had my eye on it for a while.\n\nAlso, I know Apple is cheaper than $200 a share, I just think it's a good idea to have wiggle room for dips. \n\nThe first 2 years would be the real grueling grind, 1 share a week gets you 100 shares at 100 weeks. But now you have 200 shares, can sell 2 covered calls, and generate 2 shares per week, so you'd have 300 shares total in more 1 year. Rinse and repeat.\n\nUsing this compounding system you would have 1k shares of Apple in 286 weeks or so, roughly 5.5 years. Now that original 20k investment can bring in 2k in premium a week or 8k a month, more than my current job does by a good amount. \n\nAlso generating that amount of shares now, if you kept going at the 360 week mark, or 7 years, you would have 2k shares for 16k a month in premium!\n\nThe basic plan is simply a zero emotion wheel strategy. If I get assigned a call, next week sell a put to buy them back at a discount send collect the premium for that next share.\n\nCan anyone point out any glaring flaws with this? I feel like it's one of those, \"if it's that easy, everyone would do it,\" style things, but it does take some basic knowledge and patience.", "id": "senhj3", "created_utc": 1643364582.0, "score": 41, "upvote_ratio": 0.77, "num_comments": 69, "comments": [{"body": "premiums are high now bc of volatility...apple premiums are usually shit", "score": 93, "replies": [{"body": "Nothing lasts forever.", "score": 11, "replies": [{"body": "Even November rain?", "score": 16, "replies": [{"body": "And we both know \\*premiums\\* can change ...", "score": 2, "replies": []}, {"body": "Now that’s gonna be my soundtrack for the day, thanks Alternative-Plum! /s", "score": 1, "replies": []}]}, {"body": "everybody wants to rule the world", "score": 2, "replies": []}]}, {"body": "They are similar to SPY aren't they.", "score": 4, "replies": [{"body": "apple **is** SPY", "score": 37, "replies": [{"body": "Lmao 🤯", "score": 2, "replies": []}]}]}, {"body": "> premiums are high now bc of ~~volatility~~\n\nearnings (yesterday)", "score": 4, "replies": [{"body": "Premiums dropped dramatically overnight. The 160 straddle was $750 at market close yesterday - would have been a loser due to IV crush today.", "score": 2, "replies": [{"body": "Yes, vega crush will do that after earnings. Earnings were announced at yesterday's closing bell. AAPL's IV percentile is still in the mid 80's even today, though. IMHO, it's not a bad time to write some options and pick up some income on an underlying that most options sellers see as \"boring\".", "score": 1, "replies": [{"body": "Most definitely. I’m not writing many puts these days. Large caps are the last to go in a correction/bear market. AAPL is barely off highs, so I’m good to wait. That said, I made a little money on NVDA puts at the gap down this morning.", "score": 1, "replies": []}]}]}]}, {"body": "Right now, yes, they are high, selling an ATM call gets you $260, and a CSP would give you $740 in premium, enough to buy another 4 shares. This strategy only needs the premium to be enough to buy 1 share on the weeklies. In the past that was still the case", "score": 1, "replies": [{"body": "I own visa shares tried to do the same for about same for 6 months and what you explained happens only during high volatility and and chance of almost every other Friday getting exercised.....going back to rebuy and wait for the price to fall to rebuy.....anxiety kicks in.....I only could do it bc I owned visa at $10 from 10 years ago...... But starting from scratch, it will be hard", "score": 6, "replies": []}, {"body": "Why would you sell ATM calls on Apple though? Doesn’t make sense. I think the play with a stock like Apple is to sell ATM or even ITM puts for assignment when oversold or sell OTM calls when overbought and keep the shares with no intention of getting them called away. Just my opinion", "score": 5, "replies": []}, {"body": "Where do U see $740 premium on a weekly at the money CSP? \n\nRight now the weekly 2/4 at the money is roughly $4 on both the call and put side.", "score": 2, "replies": []}]}]}, {"body": "This post is confirmation we aren’t at the bottom yet", "score": 115, "replies": [{"body": "It may be confirmation that we are at the top of volatility", "score": 3, "replies": []}, {"body": "Why? Is the bottom only when everyone sold and the market is at 0?", "score": -3, "replies": [{"body": "The bottom is when the OP instead posts I cant do this. Nothing makes sense. Bought rope today. Goodbye everyone.", "score": 6, "replies": []}]}, {"body": "lol", "score": 1, "replies": []}]}, {"body": "With 20k you can buy more than 100 shares and get a kickstart to your plan. \nRemember that the premiums will not be always juicy.", "score": 50, "replies": [{"body": "Also, AAPL will not always be juicy. Also taxes, inflation, market crashes... lots of reasons why you should maybe just buy more shares now instead of betting on a rent-to-buy plan for your share portfolio", "score": 16, "replies": []}]}, {"body": "[deleted]", "score": 16, "replies": [{"body": "Check out EPD for dividends it's up a bit now but @18-19 I've been adding nice solid 8.3% at those levels...", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "What do you think of PSX?", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Wow, Standard Oil, that's crazy. I was just mentioning PSX because of the hefty dividend, and it tends to move up and down enough to generate some moderate IV for option sales. I was thinking about it lately for the IRA.", "score": 5, "replies": []}]}]}]}]}]}, {"body": "Every investment study in the history of mankind, and the Universe for that matter, has proven out that buy and hold beats this grind it out strategy over time.  \n\nNow, with that said, it's fun to try to beat the market and grind out profits and learn a lot about investing strategies, and like Blackjack, you'll have some good times, and some bad times.  And that's why I'm here because I enjoy learning intricate trading strategies and it's fun to try to outperform indexes etc.  \n\nGood luck - and have fun.  That's why I'm here.", "score": 12, "replies": [{"body": "except in an IRA. no tax drag on short term trades makes so many more trading strategies better than buy and hold. it seems counter-intuitive, but i use indexes in my brokerage account and active trading in my retirement account.", "score": 2, "replies": [{"body": "But you are significantly restricted on margin, and selling options in IRA accounts. There are very few Theta stats you can run in an IRA account.", "score": 2, "replies": [{"body": "You can trade multi leg strategies like condors, spreads, diagonal spreads, covered calls, etc. And when your balance grows with time CSPs become do-able as well.", "score": 2, "replies": []}]}]}]}, {"body": "You only think you can get $200 a week right now because earnings was last night, and you were looking at it yesterday.\n\nCheck again today, at best you're going to get like 30 to 50 bucks selling weeklies at around 30 to 40 Delta.", "score": 5, "replies": []}, {"body": "You’re never going to win in the long run on weekly Apple CCs. That’s gambling. Apple doesn’t move quickly until it does. Your calls will get assigned then you’ll be selling puts. Then Apple will move back down. Your puts will get assigned and Apple will be down $20-30 a share below where you were. Then do you sell a weekly that will lock in a loss? What’s the plan then? Apple runs back up to your original price, then 10% over, all in the span of two weeks. You’ve been assigned a call at a loss and cashed in on a put the next week then, but you’re still down.\n\nWeeklies are gambling and you can wheel with them, but you will in the long run and average lose to buy and hold. You can come up with a strategy to sell calls and make money on Apple for sure. But I don’t think it’s as lucrative as you think it is. Don’t forget that you’re paying tax on 30% of your premium too, gotta do that before you reinvest.", "score": 10, "replies": []}, {"body": "CCs and short puts have the same flaw as any other bullish strategy: you lose out if the stocks decline. \n\nIn other words, the wheel is just like literally any other trade, it goes well if you're right, and poorly if you're wrong. I know that sounds obvious, but sometimes people seem to think that the wheel is some guaranteed, pain-free, income machine.\n\nAs for reinvesting the premium you receive, that sounds fine. \n\nI would personally go for monthlies over weeklies. The lower delta/gamma should keep your portfolio value a bit more consistent (plus better liquidity).\n\nOne other thing you may want to potentially reconsider is your underlying. This totally depends on the size of your portfolio, but it sounds like the 20k you need for AAPL is a lot in context. If you used a lower priced stock, you could have more contracts open. I'm not recommending this specifically, only using it as an example, but F is about 1/10 the price. This means your could have 10 contacts open with the same capital. The advantage here is that you could stagger your entry over time; essentially, you can DCA over time. This also allows you to maintain a more consistent delta, since you can make adjustments to 1/10 of your position at a time, and even split the position between puts and CCs. \n\nLastly, choosing a stock that pays dividends might allow you to build your position faster, since you can reinvest those along with your premiums. \n\n\nJust my thoughts. Nfa and all that.", "score": 8, "replies": []}, {"body": "Yeah I was working on something similar while we were on our never until ending upward trajectory...  Apple deep itm leaps and selling premium  and rolling received premiums into more leaps while this works great in a sideways or slowly moving market idea would be to have an ever increasing position size which would have worked wonderfully until January started obviously ,but needless to say I've now seen the dark side of what I was looking into heavily mid 2020. \n\n my personal opinion would be to DCA in over the next few months yes you wouldn't be able to write options but you also may miss out on a significantly lower price I could see it heading back into 130's before ath's.  Yes you can always choose to park money in apple and no one would fault you for that and yes premiums are so inflated right now it's tempting but if you check back into pre covid and even second into third quarter of 2021 you can kinda get a feel for just how inflated they are...  I was looking at the same 21 day distance strike and upto 3-5 extra weeks to get  roughly 1/2 what you can get now. Is it cash yes. Is it a safe long term play well yes. I just think there may be better opportunities later in the year with small and mid caps. Good luck", "score": 4, "replies": []}, {"body": "If you have traded AAPL when market was not volatile like now, you will know this doesn’t work. 5% OTM weekly is like 30 bucks, I don’t even bother sell covered calls are my shares", "score": 3, "replies": []}, {"body": "there are way better structures than wheeling using 20k. you can split the money into 2 piles. use 8k to buy 2 Mar 23 130c  and sell CC against it, then use 12k as collateral to sell 1 puts. you only need around 4k collateral for naked put so 12k is plenty to defend in case of downturn. use the 3 short contracts premium to buy shares and start your strategy. \n\nin bullish case, if your short calls are tested, keep rolling up and out to allow your long leaps for maximum gains. roll your put up to increase premium. if you can't no longer roll the short calls, then sell to close the entire PMCC and start again from higher strike.\n\nin bearish case, roll your short puts down and out. roll your short calls down to collect more premium. with 4k initial collateral requirement plus 8k extra room, you should have no issue with margin calls. the shares you pick up along the way using premium also help with your liquidity, and you're DCA in at a lower price.\n\nwith this, you start with 3 contracts instead of 1, and 2 of the contracts captures the upside potential of aapl going higher.", "score": 4, "replies": []}, {"body": "Wow, someone who looked at premiums on the day of earnings in the middle of a volatility spike and thought there's free money on the table.\n\nLmfao.\n\nYour entire thesis will go out the window in 62 minutes btw.", "score": 12, "replies": [{"body": "You could sell the 2/4 170 right now for $206 and buy one share...", "score": 0, "replies": []}]}, {"body": "Sure if everything goes perfect. What happens if apple plummets 20%? What happens if apple jumps 20%? What happens if apple stays flat and volatility drops to 5%?", "score": 10, "replies": [{"body": "If it plummets 20%, I get 100% of my call premium, buy the amazing dip opportunity, and hold for a bit. If it jumps then cool I get assigned and then buy it a discount with a CSP once it stabilizes. The whole point is to be comfortable with the stock long term and not sweat the assignments.", "score": 8, "replies": [{"body": "Excellent, you got a plan that you're confident in. That's better than me on 99% of my days. You're in a good place, best of luck!", "score": 5, "replies": []}, {"body": "At these amounts, the taxes, fees and not receiving the dividend make me think you’ll end up barely better off than simply buying the stock. I’m not gonna do the math for you, but you should have a hard look at the numbers before taking the plunge.", "score": 5, "replies": []}]}]}, {"body": "I like this plan. You’re looking into investing long term in one of the strongest underlyings out there.", "score": 2, "replies": []}, {"body": "Anyone else see that shiny penny, right there in front of the steamroller.", "score": 4, "replies": [{"body": "This is why I prefer WSB, at least there a person can fire off a proper response to a snarky comment.", "score": 1, "replies": [{"body": "I mix the two and it works out well to keep that balance.", "score": 2, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "That’s friggin hilarious. Very true!!! I’ve definitely seen lingo from WSB spreading to other financial groups. I’m torn between the apes have broken loose, and the apes are trying to learn. Cracks me up though.", "score": 2, "replies": []}]}]}]}]}, {"body": "You've done it, you've discovered infinite money hack. Take notes everyone!!", "score": 0, "replies": []}, {"body": "What is CSP?", "score": -1, "replies": [{"body": "Cash Secured Put", "score": 2, "replies": []}]}, {"body": ">Can anyone point out any glaring flaws with this?\n\nYeah, it's way faster to just wash cars, or mow a lawn to buy that 1 per week.", "score": 0, "replies": []}, {"body": "No offense, but since you're referring to option prices with their notional value, that tells me you're way in over your head.\n\nVolatility is a thing (VIX and vol based around events such as earnings). Delta is a thing. Correlation ratios to SPY is a thing (and aapl is quite closely tied to spy).\n\nPuts and CCs both lose if the asset they are derived from drops. This will also happen if there is a small draw down, even if aapl is doing quite well.\n\nYou're inexperienced. It's ok. We all started somewhere. The thing to help with inexperience is size. Just please control your size, and trade accordingly.", "score": 0, "replies": []}, {"body": "Lol stocks only go up", "score": 1, "replies": []}, {"body": "My concern would be having your calls get assigned and then having the price jump so high that your CSP wouldn’t generate decent premiums. Or the price dips a lot and you’re forced to either risk selling below your cost basis or waiting until the price recovers to sell CCs. I’d prefer to sell calls and puts to have both directions covered", "score": 1, "replies": []}, {"body": "If you are thinking this, look into calendar spreads as well. Be aware of the dividend ex date is the 4th as well.\n\nAlso make sure you aren't \"buying 100 shares\" sell a put on the ex date one it corrects for the dividend....\n\nYou are also forgetting about taxes...sry", "score": 1, "replies": []}, {"body": "It works until it doesn't", "score": 1, "replies": []}, {"body": "mathematically proven better to just hold stock long term.  anything else is purely luck.", "score": 1, "replies": []}, {"body": "I have been selling CCs on AAPL since last June and buying shares with the premium, so obviously I'm not going to say it's a terrible idea, but in my experience, it's not going to build up as quickly as you are projecting. After \\~8 months, I am at 116 shares, but I haven't been absolutely consistent about putting premiums into shares. Also, I haven't done a purely \"zero emotion wheel strategy\" and have gotten sidetracked in running straddles and strangles, so it's not a 1-to-1 comparison (in the end I think these two factors just about balance out in terms of the number of shares I have at the moment). Still, there are worse ideas out there, and at the end of the day, if you are holding any bags so to speak, at least they are AAPL bags, so are sleek and shiny with crisp clean modern design.", "score": 1, "replies": []}, {"body": "thought of something similar but i think that it would be better to do this kind of strategy with more companys from different sectors at the same time, so same strategy but diversified", "score": 1, "replies": []}, {"body": "LMAO... $200 a week.. FOR FREE!! Zero risk.. can't go tits up. \n\n$10,000 in premium received during the year on a $20,000 investment. 50% annualized return. \n\nWe are not at the bottom yet boys! \n\n......\n\nNow to actually be constructive after my initial salty reaction. \n\nCheck out this table I just threw together. I think it spells out the downside risk pretty clearly.\n\n\r\n\n[https://imgur.com/a/NrhJ77l](https://imgur.com/a/NrhJ77l)\n\n&#x200B;\n\nIt was thrown together quickly so please don't nitpick. The point was there is no free lunch on WallStreet, even with 'basic knowledge and patience'.", "score": 1, "replies": []}, {"body": "And what if it moved by 5% in a week and your shares get called?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "But then if you want to continue this strategy you have to buy it at a higher price which means less shares.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Exactly! The flaw with OPs compounding math is that he doesn’t take into account the occasions when his calls end up ITM and his shares taken away.", "score": 1, "replies": []}]}]}]}]}, {"body": "Apple premiums are notoriously bad.  they are only decent right now because of the instability of the market.", "score": 1, "replies": []}, {"body": "It's always good to exercise your brain and create trades that seem rock solid. This will help you develop the skills and experience to employ +$EV plays/positions in the future.\n\nHowever, your idea is likely not a profitable strategy over years, as you laid out. Since your proposed play is a relatively simple strategy and would be deployed over such a long time horizon, I think it falls into the category of:\n\n**If this worked as you stated, \"everyone\" would be doing it.**\n\n...Especially, when using an underlying with such insanely high market liquidity, meaning it's not likely to ever have such a big inefficeny to exploit/arbitrage.", "score": 1, "replies": []}, {"body": "It’s beautiful if everything goes according to plan. You asked what the flaw is, the flaw is that NOTHING in the stock market goes according to plan, much less for 5 years. For example you’re going to get your call called away when something happens and price spikes like crazy. And vice versa you’ll get assigned when some crazy drip happens. In both cases there will be a big gap between what you buy and sell for. Give it a try though maybe you’ll get lucky.", "score": 1, "replies": []}, {"body": "This seems like a great idea until it stops working one day. \nThars the flaw. You assume Tim Cook wont one day piss off the cabalah enough to be ousted as a pedophile or something, and that Apple wont then plunmet. \nOr that Apple wont be decalred a monopoly and broken up into multiple companies. Etc. Etc. \nLikely? No. But nothing is ever guarenteed.", "score": 1, "replies": []}, {"body": "I think this will be no better than buy and hold.  Taxes will also take a big bite out of it.\n\nThere's no free lunch in the market with these delta neutral strategies.  Every now and then you'll miss out on sudden spikes like today, or you'll lose on a sudden drop, by exactly the probability you're giving up by selling the option.\n\nI think it's just a Rube Goldberg way of accomplishing the same or inferior result than just buy and hold.", "score": 1, "replies": []}]}
{"title": "ARKK is a Sinking Ship: Practical Portfolio Construction Theory", "selftext": "I see a lot of memes and arguments about the fate of ARKK and Cathie Wood. I wrote this post to give everyone the definitive guide to what happens from here with ARKK. At this point, the losses are accelerating. Nothing can save this sinking ship (see what I did there?).\n\nThe first thing you need to know is that ARKK is not an etf in the traditional sense. Cathie Wood actively trades the portfolio and has made some serious portfolio construction errors. Even if the underlying stocks can stem the hemorrhage, it is more than likely that these mistakes are large enough to disband the ETF.\n\n1. **Concentration risk 1**: too much of the portfolio is concentrated in too few stocks. This is an issue because even if she is right on 9/10 stocks, one stinker can impact the entire performance. Right now, the biggest risk is Tesla. Even if her other positions recover somewhat, if Tesla falls (not saying it will, but IF) then this will be the death knell for the entire portfolio.\n2. **Concentration Risk 2**: ARKK owns multiple trading days worth of stock for some of these companies. The problem with this is if Cathie Wood has to sell a position, she cannot sell many of her holdings without tanking the price of the underlying. This risk is actually baked into ARKK since any up and coming tech company will by definition have fewer investors trying to buy in every day and thus fewer shares trading. You don't liquidate when you want to. You liquidate when you have to.\n3. **Correlation risk**: all of her stocks are affected by the same macro themes. it doesn't make sense that TSLA and Coinbase drop together, but both companies benefit from a low interest rate environment. If anything happens to the macro environment that effects market liquidity or general P/E multiples, then her entire portfolio will take a hit at the same time.\n\nIn general, you want a portfolio with uncorrelated assets. this is because if one asset goes up or down for non-fundamental reasons, you can arbitrage that against your other assets and wait for the securities to be rationally priced. Cathie doesn't have this option.\n\n4) **Liquidity risk:** ARKK owns large amounts of illiquid companies. If Cathie has to sell them off, ARKK is so big that their selling will have a material effect on the stock price. In general, this is why big dogs don't mess with small caps. If you buy enough to make a difference in your portfolio, then there is not enough liquidity to exit if you need to.\n\n**THE MECHANISM**: when you buy/sell your ARKK shares, the market cap of ARKK deviates from the Net Asset Value (NAV). This can be corrected when a market maker trades ARKK for ARKK shares or the underlying asset.\n\n**Example**: if ARKK is going up because people are buying it, then the market cap will grow larger than all of the assets that ARKK owns. Cathie Wood can then print up more ARKK shares for free, and exchange them with a market maker who will buy up the proper amounts of the underlying assets. This increases the amount of assets that ARKK owns while keeping the market cap the same, which brings the market cap and Net Assets into balance.\n\nWhen ARKK is going up, this has the effect of placing huge buying pressure on illiquid names. Since there are not that many sellers at any given price, the stock of the company will increase to draw more sellers into the market. This is especially true since ARKK got so big that it became a huge player in comparison to the companies it was buying.\n\n**Example**: if ARKK is going down because people are selling, the market cap will deviate lower than the NAV. In this case, Cathie has to trade shares of the underlying to a market maker who buys ARKK shares in the market. Since the market maker is getting more shares\n\nWhen ARKK is going down in market cap, a market maker gives Cathie ARKK shares and takes the underlying stocks in exchange to sell them. This is horrible if you are selling a large number of shares into into an illiquid market. large sell orders will push the price of the stock you are selling even further down.\n\n**The vicious cycle Cathie Wood is experiencing:**\n\nNon-profitable Tech falls—> All of ARKK takes a hit because it is all correlated—> people sell their shares--> Cathie Wood is forced to sell the underlying holdings—> The underlying holdings are very illiquid, so the stock price falls--> Repeat.\n\nCathie Wood attempted to break out of this pattern by selling her Tesla shares and rebalancing into her other holdings. This worked for a while because Tesla had an amazing run and ARKK could offload millions of shares without changing the price. The final nail in the coffin was Elon Must selling his shares. The market was forced to absorb so many Tesla shares that Cathie Wood could no longer sell the quantity of shares she needed to without tanking the stock.\n\n**Why ARKK will not recover even if Tech does:**\n\nIf a huge whale stepped in to accumulate ARKK shares, Cathie Wood could issue more ARKK shares to buy more of the underlying companies. However, right now there are a huge number of people sitting on losses in many of these names. Any rally in these names will be seen as a selling opportunity to people who are pretty far in the red at the moment.\n\nEven if ARKK investors are diamond handed investors, the companies themselves have decided to sell shares into the artificial demand created by ARKK. If you look at filings, many of the companies ARKK owns have decided to dilute shares to fund their business ventures.\n\n**In short, ARKK is a sinking ship. Get out while you can.**\n\nHow can you benefit from this knowledge? I bought 30 ARKK Puts at a strike price of $42, expiring January 2023. I am currently up 300% profit on this trade. If ARKK fails completely, I would have turned $3,000 into $120,000.\n\nhttps://preview.redd.it/3auaehndrhe81.jpg?width=780&format=pjpg&auto=webp&s=6ebebdb30d67c784981103220b36447f9c0da79d", "id": "sf0dhb", "created_utc": 1643403021.0, "score": 85, "upvote_ratio": 0.83, "num_comments": 72, "comments": [{"body": "I would be more impressed with this DD had you dropped it a few months ago, now you are just hopping in to kick the dead horse.", "score": 71, "replies": [{"body": "Yeah, I actually wrote something similar/less detailed, but no one really cared about it. I took it down after a few days since it got like 20 up votes.\n\nSame with this post I guess. Dd on the short side is never appreciated lol. \n\nAt least I got a gold!!!", "score": 14, "replies": [{"body": "It could work she just needs to be in more companies.\n\nEdit: I just looked at all the holdings and holy fuck she's just picking tech stocks off the WSB front page.", "score": 9, "replies": []}, {"body": "Thank you for the write up, I still believe in Ark but I can understand why people feel that it wont come back", "score": 7, "replies": []}, {"body": "Bought SARK in early December.  I'm up 26% and I still think ARKK will go lower", "score": 2, "replies": []}]}]}, {"body": "Nah dude Cramer said its a sinking ship.... we all know what that means.....", "score": 21, "replies": [{"body": "🚀🚀🚀😎", "score": 11, "replies": []}, {"body": "Fading Cramer is the only analysis that needs to be done.  When I said sinking ship I started buying.", "score": 1, "replies": []}]}, {"body": "Thank you for the buy signal. I was waiting patiently", "score": 13, "replies": [{"body": "Thank you for your donation 🙏", "score": 5, "replies": [{"body": "Thank you again OP. Already up 8.5%.", "score": 1, "replies": [{"body": "Get good or stfu, I’m up over 300% and closed out the long let of my calendar spread. \n\nI gotta mute you now for wasting my time and not understanding how to trade. \n\nHave fun staying poor.", "score": 3, "replies": []}]}]}]}, {"body": "Nice to read an actual piece of DD.  I have no positions on ARKK, but I enjoyed the read.", "score": 20, "replies": [{"body": "WSB, a few years back, used to be full of well-written DD. Now it's nothing but rocket emojis.", "score": 10, "replies": [{"body": "🚀🚀🚀😎", "score": 6, "replies": [{"body": "Nice lol", "score": 1, "replies": []}]}]}]}, {"body": "After listening to the last quarterly, It sounds like they are just throwing darts and hoping for a winner. That and saying things like our holdings are in deep value and we’re not in a bubble, value stocks are in a bubble. Ships going down.", "score": 5, "replies": [{"body": "Yeah, I didn’t even get into the delusions. Their whole valuation strategy isnt to be accurate, but to be uncorrelated to the market. She teaches her ppl that it’s ok to be wrong as long as you are wrong in a unique way. \n\nThat’s why you get PLTR diluting their shares every chance they get.", "score": 5, "replies": []}]}, {"body": "How can it fail when she has our lord and saviour personally providing her investment advice?", "score": 10, "replies": [{"body": "Underrated!", "score": 2, "replies": []}]}, {"body": "The theory is sound but do you realistically think arkk will go to zero?", "score": 5, "replies": [{"body": "I think zero over a couple of years. $120k is the theoretical max. Right now, there is pretty strong support at $60. As it falls, I’m going to sell calendar puts against my puts. \n\nSo, this week, I opened and closed 10 calendar puts that netted me like $500. Not a lot by any means, but it is a pretty safe weekly trade. If arkk blows past the 10 puts I sold, I have 20 that are pure ITM. \n\nIn reality, I think I will probably eke out a 30k profit on this strategy. A 10 bagger is really solid and I don’t think jpow will let the market crash too hard.", "score": 6, "replies": []}, {"body": "For this to happen every company she has invested in has to go bankrupt, including Tesla.", "score": 3, "replies": [{"body": "No it does not. Arkk can just decide to disband bc investors don’t feel like paying her very very high management fees. \n\nLook at zoom, hood, PLTR, etc. right now, Cathie can hope to reach all time highs if jpow prints up some big bucks, but at a certain point it’s just going to make her look bad to hold all these stinkers in one fund.", "score": 0, "replies": []}]}, {"body": "She will close up shop a it will be bought by another company for pennies on the dollar just  like what she did last time.", "score": 2, "replies": []}]}, {"body": "If you included some numbers, it might reinforce or weaken your hypothesis.\n\nLet's take your TSLA example, and the difficulties you cited about trying to sell. Her last big sale according to Cathiesark was 72k shares on Jan 13 and 24k shares on Jan 14. Now the trading volume in that period was 13-15m shares a day. So most conservatively, 72k shares in a 13m volume day is 0.5%. 24k shares is 0.18%.\n\nI'm not a market marker nor an expert in these matters, but is 0.2% or 0.5% of the daily volume really that big a deal that it would tank the stock?", "score": 6, "replies": [{"body": "So, look at the number of shares she has, and had at her peak. Never had more than a day of trading, but that’s bc Tesla is one of the most liquid stocks in her portfolio.\n\nLook at the supply/demand now. Clearly, more sellers than buyers on Tesla after Elon sold. That means if she wanted to sell a truly large number of shares, she would be competing with more and more sellers. \n\nKeep in mind that price is decided based on the marginal trade, so even a seemingly small amount can really move the price in the short term.", "score": -2, "replies": []}]}, {"body": "Yeah I listened to the earnings call they dropped a few days ago and let me tell you, it sounds like a bunch of college kids working on a school presentation. They know they’re fucked.", "score": 5, "replies": [{"body": "Maybe they sound like college kids because their degree is in science and not in public speaking.", "score": 1, "replies": []}]}, {"body": "Why do supposedly smart people defend these systems built entirely on feedback loops?", "score": 2, "replies": [{"body": "I think Cathy got lucky with Tesla and wanted to get on tv. She just denies there is a problem and hopes to get picked up by a bigger fund who wants her name and social cache.", "score": 4, "replies": [{"body": "Maybe, but if were firing off psychological profiles from the hip, I wouldnt discount \" x is up YY%, so why wouldnt we invest in x? Its the new market paradigm\", etc etc. Given aapl, msft, and generally how important tech ia now, it must be pretty tempting to just ignore buffet type people, and have gone all in on the nasdaq. Cathy is just one of us with all otm qqq leaps, except on a big enough scale that she can pull in others.", "score": 1, "replies": []}]}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|52|**First Seen In WSB**|11 months ago\n**Total Comments**|655|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/sf0dhb/arkk_is_a_sinking_ship_practical_portfolio/) \n**Account Age**|11 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=sf0dhb)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=sf0dhb)", "score": 1, "replies": []}, {"body": "When I bought puts, $50 seemed far fetched. Now I'm glad I picked $50 as strike", "score": 2, "replies": []}, {"body": "Etfs backends are wierd.\n\nOp: dont many of these issues exist with themed-ETFs?", "score": 2, "replies": [{"body": "Not really. Most are not this big, and have caps on how much of each company they can own. \n\nIf you are in gdx or xle, you are never too exposed to just one company messing up.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "How would it liquidate at today's price? That in itself would tank its value.\n\n\nEdit: nvm, I see what you're saying. Didn't see the first part.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Great question!\n\nMy puts are at $42, not $30, so a little safer lol.\n\nMy put strat isn’t my main play in my portfolio. It’s just there to hedge tail risk.\n\n In the end, my puts will be in the money if arkk goes back to like 2017 prices. Cathie was nowhere near closing up shop then and I think they have way to much riding on this to call it quits. \n\nAlso, I’m selling a small number of calendar puts that have already covered my cost basis, so the insurance is pretty free right now.", "score": 3, "replies": []}, {"body": "I'm actually not too familiar with the process of ETFs closing shop. Would that be able to actually happen quick enough to capture value? Because I imagine the announcement alone would cause a massive selloff of both the ETF and the underlying stocks, which could have a pretty significant effect if we're talking weeks to unwind the positions.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": ">Shareholders typically receive notification of the liquidation between a week and a month before it occurs\n\nSounds like it would be bad, imo. If ARKK announced it was delisting, given how intertwined its holdings are, the number of small cap stocks, and the potential to take weeks, I think we'd see it tank severely and cause the feedback loop OP is describing.\n\n\nhttps://www.investopedia.com/articles/exchangetradedfunds/09/etf-out-of-business.asp#:~:text=ETFs%20that%20close%20down%20have,trades%2C%20that%20trading%20will%20cease.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Absolutely fantastic post", "score": 4, "replies": [{"body": "Thanks!", "score": 1, "replies": []}]}, {"body": "Now that you've dropped this nugget so incredibly late, it's pretty clear that it's time to buy the absolute hell out of ARKK", "score": 4, "replies": [{"body": "I’m up 300% so far. I’m happy to take the rest of your money as well.", "score": 1, "replies": [{"body": "Lol it's that arrogance that makes me even more certain of the bad timing of this post. Becoming clearer that ARKK logged it's short term low but hey keep holding, someone has to be on the other end of a future winning trade", "score": 3, "replies": [{"body": "🚀🚀🚀😎\n\nRemind me 2 weeks", "score": 2, "replies": []}]}]}]}, {"body": "Definitely sinking", "score": 2, "replies": []}, {"body": "NEVER invest into a fund of a religious nut job", "score": 1, "replies": []}, {"body": "Cathie Wood will win ….", "score": -4, "replies": [{"body": "L O L", "score": 0, "replies": []}]}, {"body": "Why are you setting it at 1/2023? I think if what you're saying is correct it will happen much sooner. It's already lost ~20% of its value in a few weeks.", "score": 0, "replies": [{"body": "I’ve been a bear long enough to know that politicians can rig the market for a long time. I opened this position a while ago and chose really long expiration to hedge against tail risk for a long time coming. \n\nWhat if money printer go brrrr? Might be 6 months for the unwind to occur.", "score": 2, "replies": []}]}, {"body": "Solid stuff.  I learned something.  Thank you", "score": 0, "replies": []}, {"body": "5) she’s a women lol", "score": -3, "replies": [{"body": "How many women is she?", "score": 1, "replies": []}]}, {"body": "Tldr - ARKK is bunch of meme stocks with no future. Buy at your own risk. It may give meme stock type upside or downside.", "score": 1, "replies": []}, {"body": "Stopped at where you said the biggest risk is $TSLA. They should do well then.", "score": 1, "replies": [{"body": "Reading is hard.", "score": 2, "replies": []}]}, {"body": "Got debit put spreads exp next 2week need this under $65 how you think this could get?", "score": 1, "replies": [{"body": "My heart says those puts will print, but my mind says hedge. \n\nCounter trend rallies can be really strong, so we could go up like 20% before resuming the drop.", "score": 1, "replies": []}]}, {"body": "Happy Cake day!", "score": 1, "replies": []}, {"body": "Analysis seems sound and convincing, however, I don’t think Tesla will fail and I don’t think inflation will be around forever. Ultimately my view is that innovation will win over inflation. I still buy monthly on ARKK.", "score": 1, "replies": [{"body": "Different views make a market.\n\nKeep in mind, Tesla doesn’t have to fall for arkk to fall, it would just instantly kill the fund. \n\nLiterally none of her holdings are up ytd.\n\n! Remind me 30 days", "score": 1, "replies": []}]}, {"body": "Well thanks, just lost all my money on puts…", "score": 1, "replies": []}, {"body": "Arkk holds positions in SNAP and they made profits first time - should be interesting!", "score": 1, "replies": []}]}
{"title": "$500 to 16k - Calls AND puts on NFLX, SPY", "selftext": "", "id": "sf0u4p", "created_utc": 1643404248.0, "score": 247, "upvote_ratio": 0.92, "num_comments": 75, "comments": [{"body": "I'm not used to these posts with green numbers", "score": 68, "replies": [{"body": "Me too", "score": 17, "replies": []}, {"body": "Don't worry, [Valentines day is coming up](https://www.factionfinancial.com/prediction/c35d63b7-504f-4ee7-954c-cf9507e3150f), and NFLX is only used for one thing, AMIRITE boys: Getting PUsPuS", "score": 15, "replies": []}]}, {"body": "You know there are 10s of thousands behind this post who lost that $500 trying to do the same thing", "score": 61, "replies": [{"body": "No need to call me out. I’m right here.", "score": 14, "replies": []}]}, {"body": "All time: *down 89%*", "score": 25, "replies": [{"body": "In my fidelity account, definitely. This is just my crack cocaine option gambling account. I transfer everything out after a big win before I lose it all.\n\nhttps://imgur.com/a/ZF5FP29", "score": 50, "replies": [{"body": "Nice work. Was just pulling your leg. See posts all the time that have day, week, or month charts and it's like ok... post your all time too so we know how big of a deal it is. I have good days and weeks too but I'm not gonna brag about it because my all time is a little embarrassing haha", "score": 11, "replies": [{"body": "Yeah I hound people who post 1 year but never all time. And they never respond. I think 99% of peoples all time is shitty", "score": 5, "replies": []}]}, {"body": "[removed]", "score": 12, "replies": [{"body": "Reddit has a new paid team called **Anti-Evil Operations** which goes around permanently banning accounts for saying bad words. We made automod block them so you don't lose your account for saying a word and getting reported. It's not our rule, it's the entire website now, we're just trying to look out for our people. Sorry.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Do you only choose to work with $500 at a time? How much do you reload with?", "score": 3, "replies": [{"body": "After blowing up my account last year I’ve usually just been doing $500-1,000 at a time. If I blow that up I take a break to reset mentally and force myself not to revenge trade. \n\nLike most people here it’s when you have way more capital at risk that you fuck it all up. I’m fine with losing $500 and I had more motivation to find a great play rather than just tossing thousands around", "score": 14, "replies": [{"body": "Great strategy to have fun gambling but not ruin your life.", "score": 2, "replies": []}, {"body": "I was looking to make a play like this earlier this week because I saw that people were getting good returns on Puts last week - except I have never done option trading before. My bother-in-law told me not to get sucked into the FOMO…….. but I have 2k I can gamble/invest. Any advice for a literal newbie?", "score": 1, "replies": [{"body": "Paper trade ;)", "score": 2, "replies": []}, {"body": "Honestly I wouldn’t get into at all. No matter what anyone says it is an addiction. Even when you’re winning it can feel like losing “if I had held 1 hour longer I could have made double what I made!” Etc", "score": 2, "replies": [{"body": "I appreciate the response. Thank you 🙏🏾", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Great job!!! Glad to see these green numbers. Keep up the great work", "score": 7, "replies": [{"body": "Thanks", "score": 2, "replies": []}]}, {"body": "Postions", "score": 7, "replies": [{"body": "[This was the majority of it.](https://imgur.com/a/HhwsLdL) I took this before I sold, I think it was 12k in profit total. Then just trading SPY weeklies", "score": 3, "replies": [{"body": "Netflix was banging after earnings! Wish I’d got into it. What percentage do you try and aim for the weeklies?", "score": 1, "replies": [{"body": "Gain %? I look more at moving averages and fib levels. Once NFLX broke $400 next fib level was $358", "score": 4, "replies": []}, {"body": "Thanks v much!", "score": 2, "replies": []}]}]}]}, {"body": "How do I do this? Will someone that knows what their doing honestly trade my money for me and I’ll pay you well from the returns…", "score": 6, "replies": [{"body": "This was a lot of luck, I don't trust myself with my own money.", "score": 17, "replies": []}]}, {"body": "Here’s a colour I haven’t seen in a while", "score": 5, "replies": [{"body": "Right? It has a green setting?", "score": 2, "replies": []}]}, {"body": "Congrats , curious on the positions?", "score": 4, "replies": [{"body": "Mainly NFLX 1/28 $400 puts and SPY weeklies", "score": 6, "replies": [{"body": "When did you buy these? Mind sharing your strategy on what you were looking for when you bought?", "score": 1, "replies": [{"body": "Netflix was morning of their earnings. I wasn’t going to touch it but it had a huge spike the week before after announcing it was raising all subscription prices. If there was massive growth in subscribers (what every institutional investor cares about for streaming) they wouldn’t need to raise prices, especially in a high inflation economy. \n\nI honestly thought it would drop to around $450 and I’d make a few grand since I bought a few weeks out. Had no idea it’d actually get to and fall below $400", "score": 1, "replies": [{"body": "Great timing. I'm wondering if $DIS is going to get hit with a drop in their disney+ service. I know I got 3 months free for being an Amazon music subsciber. BOBF ends before my free trial and I'm not renewing. They could report higher subscribers but there's zero revenue to go with it.", "score": 1, "replies": []}]}]}]}]}, {"body": "Fucking Axe capital over here..... Me I'm just about be flat after all those gains from last year. 😑", "score": 4, "replies": []}, {"body": "Gg. Now don't go spending it all in one place.", "score": 3, "replies": [{"body": "I’ll probably transfer back in and lose it all, just being honest with myself", "score": 14, "replies": [{"body": "Surly the smart play is to put the principle back in. So yeah, burn it all for sure. This is WSB.", "score": 3, "replies": []}, {"body": "Buy a Rolex. It retains its value", "score": 1, "replies": []}]}]}, {"body": "Quit while you're ahead or lose it all.", "score": 3, "replies": []}, {"body": "Very well timed. Grats", "score": 2, "replies": []}, {"body": "What did you buy with your winnings?", "score": 2, "replies": []}, {"body": "I have $368 on my trading account now. Everything else locked on ARVL. You’re my spirit animal!", "score": 2, "replies": [{"body": "There’s always a chance…", "score": 1, "replies": []}]}, {"body": "Hope in trading restored.  Thank you..,", "score": 2, "replies": []}, {"body": "why are the numbers green", "score": 2, "replies": []}, {"body": "Teach me….", "score": 2, "replies": []}, {"body": "I don’t understand how people do this with so little money? Seems like you would have to buy out of the money call and puts, but then theta would eat you up anyways no? How do i do this?", "score": 2, "replies": [{"body": "Yes you only get these types of massive gains buying far OTM and having a huge move past whatever the implied move was. I don’t think NFLX has ever moved more than 12% after earnings and it was like 27% by Friday’s low. I got incredibly lucky, but that’s why I donate $500 a few times a month to the casino. I had a feeling they would miss subs as the country opened back up, I just didn’t know how badly they would miss.", "score": 2, "replies": []}]}, {"body": "Fucking RH", "score": 1, "replies": [{"body": "I upvoted you 🤥", "score": -1, "replies": []}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|9|**First Seen In WSB**|3 years ago\n**Total Comments**|720|**Previous DD**|\n**Account Age**|5 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=sf0u4p)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=sf0u4p)", "score": 1, "replies": []}, {"body": "0dte? wtf", "score": 0, "replies": [{"body": "Weeklies, got lucky with NFLX dropping as much as it did.", "score": 6, "replies": []}]}, {"body": "Surprised to see no mention of discord in the title", "score": 1, "replies": []}, {"body": "Roll it all on the bengals ML Sunday +270", "score": 1, "replies": [{"body": "Remember when I said to roll it on Bengals ML", "score": 1, "replies": []}]}, {"body": "16K in more Puts and Calls", "score": 1, "replies": []}, {"body": "Do it again next week and make it 500->500k", "score": 1, "replies": []}, {"body": "Good now stop trading", "score": 1, "replies": [{"body": "I wish it was that easy", "score": 1, "replies": [{"body": "Take $10k out right now and then keep going", "score": 1, "replies": []}]}]}, {"body": "Straddling the fucking thread with the needle nice and also fuck you! Congrats", "score": 1, "replies": []}, {"body": "Good job!", "score": 1, "replies": []}, {"body": "Congrats and fuck you", "score": 1, "replies": []}, {"body": "That's impressive gains for spreads (if I understood properly what you meant by calls AND puts)", "score": 1, "replies": []}]}
