{"title": "Anyone eyeing any interesting growth stocks?", "selftext": "I am looking to pickup up a couple leaps and/or positions and have my eyes towards small caps or stocks that have had recent drops but decent fundamentals. Does anyone have anything they are watching or top picks they want to share for companies that you are optimistic on over the next 18 months? \n\nI have on my watch list so far: \n\nZoom, Dis, VNB", "id": "151yqmc", "created_utc": 1689591675.0, "score": 13, "upvote_ratio": 0.74, "num_comments": 103, "comments": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Love Enph, already have a very substantial position", "score": 6, "replies": [{"body": "PE is a little high, no?", "score": 1, "replies": [{"body": "It is high, but that’s a concern I’m willing to deal with as long as they keep hitting their growth targets", "score": 2, "replies": []}]}]}, {"body": "MASI is kinda a steal", "score": 0, "replies": []}]}, {"body": "ENVX has had a pretty good run over the past few months, and their tech seems legit.", "score": 7, "replies": []}, {"body": "RKLB", "score": 19, "replies": [{"body": "Up 7% already today.  Thx!", "score": 4, "replies": []}]}, {"body": "Did you say Disney?", "score": 22, "replies": [{"body": "They is a little exhaustion in their IP. Marvel, Star Wars and their old Disney remakes are tiring.", "score": 6, "replies": []}, {"body": "I did if it drops another 10% or so I might pick something up", "score": -3, "replies": [{"body": "Not much growth in a copyright firm.", "score": 9, "replies": [{"body": "I think Disney has the capacity for growth…", "score": 2, "replies": [{"body": "What's the growth story?", "score": 3, "replies": [{"body": "Streaming. Movies (they still own the heavy majority of major theatrical releases). Parks. Merchandise. Same story it’s always been. Right now park attendance is hurting. This year movies are struggling. Right now their 2 year old streaming platform isn’t churning out profits: but these are not necessarily permanent conditions and I see plenty of growth potential", "score": 10, "replies": [{"body": "also, gaming...hope they make some great games in future. right now just Spiderman and Star Wars are worth playing.\nI think at this point they should have their own game studio.\n\nedit- lol, just checked, they closed their game studio in 2016😅", "score": 2, "replies": []}, {"body": "They already have a huge market share in these markets. Where are they going to expand to? What are the growth customers coming from?", "score": 2, "replies": [{"body": "It’s a market with growth built in. Their streaming platform is 2 years old, if you thought Disney+ would gobble up all of Netflix’s market share I. Two years then expectations were not on point. Lots of growth opportunity in streaming \n\nParks grow, that’s the nature of the park business. They continue building them, they continue updating them. Attendance was quite poor this year. If attendance increases again, park revenue grows\n\nMovies are similar, continue building cinematic universes and producing films people want to see, you feed both cinematic revenue and streaming content", "score": 4, "replies": [{"body": "Streaming is losing them a ton of money right now... Why would this change within 18 months?", "score": 2, "replies": [{"body": "Who set an 18 month timeframe?", "score": 2, "replies": [{"body": "Remove the time frame. Why would this change?", "score": 1, "replies": [{"body": "Because their streaming is still new and there is a lot of competition. It takes time to build out your platform, let others fail and capture market share from a very entrenched competitor", "score": 1, "replies": []}]}]}]}]}]}, {"body": "So their story for growth is the same one that has it on a decline? All the different areas of business are suffering, and they’ll just get better? I’m not even saying you’re wrong, that’s just wishful thinking not a thoughtful strategy.", "score": 0, "replies": [{"body": "Their streaming is a brand new sector, it’s been around 2 years. Of course it’s still in a growth phase.\n\nTheir park has had one single year of bad attendance. They continue pouring money into it. It has been a major profit center throughout their existence. There’s no reason to assume one bad year is the death of the parks growth\n\nThey have dominated the box office for over a decade. Again, one bad year doesn’t require a miracle turnaround", "score": 1, "replies": [{"body": "I don’t disagree with you that these COULD be short term problems. 3 negative indicators could go positives, they could also continue to trend negatives. Best of luck to you though, and I mean that. Just don’t forget that last performance does not always predict future gains", "score": 2, "replies": []}]}]}, {"body": "Yes these aren't permanent conditions but it's gonna be a long time before Disney recovers. Better to put into different stocks in my opinion and come back to Disney in maybe a year.", "score": 1, "replies": []}]}, {"body": "Streaming.\n\nThat's about it. I think it might be a good value at current prices but calling it a growth stock is a stretch", "score": 4, "replies": [{"body": "Hmmm maybe, though I'm not too convinced. The only company that turned streaming into a growth story was Netflix, simply becsuse they were uncontested. With all the competition present right now, the margins haven't shown themselves to be 'growth worthy' in my opinion", "score": 2, "replies": [{"body": "Hence I said \"it's a stretch\"", "score": 2, "replies": [{"body": "I hear you, I think we got the same take on this. just felt it was nice to leave a response :)", "score": 2, "replies": []}]}]}]}]}, {"body": "Growth with what? Their agenda is destroying their profits. People like myself and millions are cutting Disney off until they serve the conservative base who consisted of most their fan base.", "score": 1, "replies": [{"body": "As an investor I’m not concerned with any agenda they may or may not have and I am certainly not concerned with Disney isolating the stupider end of the conservative base that gets fired up when they hear the words woke agenda", "score": -1, "replies": [{"body": "That makes no sense what you said. As an investor, you SHOULD be concerned about politics, as it influences the profits of a company. \n\nLet’s say CNN did not report on liberal ideas for a week for example, you think their viewership would go up or down? Down so profits as well. Same for Fox and reporting conservative ideology, if they don’t their profits will fall\n\nWhat you said is completely dumb and wrong, flat out fooling yourself too. Don’t believe me, go make a poll and ask if politics should be a concern for the profitability of a company. \n\nAlso what does woke mean? I’m conservative and I don’t understand your stupid words that are not even in the Webster dictionary. Did Disney wake up, how does that occur? I think the real stupid should be pointed at your face. You literally are calling a non living company “woke” as if it woke up in the morning. Go get a life and invest wisely or give me your money when I get puts", "score": -3, "replies": [{"body": "I’m not sure you understand. I’m saying that in the case of Disney, I’m not the least bit concerned with any politics they have taken a position on. \n\nI used woke because you said disneys agenda, I can’t imagine what else you were referring to, but please enlighten me.\n\nAs a final point, they say not to invest with your emotions. Sounds like you would do well to remember that", "score": 1, "replies": [{"body": "At first he had some saving grace because he didn’t like the word “woke” (I don’t either) then he went on a tirade about pedophilia and proved you right. “Grown man” lol", "score": 1, "replies": [{"body": "What's funny was that the only reason the word is even prevalent is because conservatives use it to label anything that sounds remotely progressive. This conservative chucklefuck seems to not even know that, while at the same time participating in the mass temper tantrum against it...it being general awareness that social injustice exists, I guess? Then he was like completely aghast that someone used the word, because he took it literally lmao. What a beautiful example of absolute public stupidity.", "score": 1, "replies": []}]}, {"body": "If I invested with my emotions I would have been broke by now, but I learned that lesson YEARS ago, trust me. This isn’t emotions, this is called running a business and losing customers because of politics. It is the exact case I am talking about here, and denying this is good for me because it’s making me richer so honestly yes go fund me, make me richer, go buy Disney all you want. I rather take your money and go donate than have someone who doesn’t understand business getting money. Sorry\n\nYou didn’t answer, what is woke? I have the Webster dictionary next to me, I’m an educated man, do not play child games with me, before you call others stupid look at yourself. I’m done arguing with someone who believes companies can be “woke” because next thing you know you are gonna tell me Disney is drinking coffee and milk for breakfast. I’m scared of people like you making money, I can only imagine where that money goes to, hopefully not pedophilia like Disney and it’s many employees are getting caught for. I can post articles to back this claim if you want, there are many", "score": -2, "replies": [{"body": "You sound very emotional…\n\nWoke is a buzzword that has become popular for conservatives to throw around. I see no purpose in defining it, I used it because you said Disney was pushing an agenda. Usually a sentence like that is followed by or includes the word woke. Again, I welcome you to tell me what agenda you think Disney is pushing", "score": 2, "replies": [{"body": "I can sound all you want me to sound, that’s subjective and if you sat and saw my accounting you would change your mind, but I’m not here to change your mind because I know I have a 0% chance to do so\n\nI’m conservative and I don’t use that silly term. Maybe you hang out with silly conservatives, I don’t agree with all of them, but rest assured the people you know do not represent me or the conservatives I hang out with and know. This goes to every group. When dealing with highly educated conservatives, try to use highly educated terms instead. Agenda is applied to any group that has a goal to push. In fact you can apply it to a conservative for example, it is not limited to liberal leaning companies. Fox has an agenda to push, it is a clearly biased news source and for that reason I do not rely on that news source. I try to get my conservative news from less biased sources like PBS and Wall St Journal, they have good non biased conservative news", "score": 0, "replies": [{"body": "So what is the agenda you feel Disney is pushing, for the third time now?", "score": 1, "replies": [{"body": "If you really do not see it then how blind are you? \n\nCheck out snow brown and the 7 magical creatures that do not even have dwarfism except 1. Don’t even have floppy hats. I’m brown and I’m pissed off at how much they are making fun of us minorities instead of organically showing support. Literally every minority family and friend I know even the liberal ones are pissed off at Disney. This is not organic, this is very superficial and it’s getting to the point where it’s actually damaging to us. \n\nWant to actually support a minority. Go marry one, go donate to one, go eat food that you probably think is disgusting but is actually good, I love sheep intestines, that’s brown people food and when I mention it to Americans they get disgusted. It’s all virtue signaling. \n\nThanks for making me rich today btw, Ima take this money and go donate to some Arab and Indian Churches. I bet that is 1000000% more help than you are doing to the minority community and I’m not even a demorat. Peace racist punk ✌🏼", "score": 0, "replies": [{"body": "My dude you have some serious baggage you are carrying around.\n\n1. You come off extremely emotional about all of this in a stocks sub- there’s no reason to get your panties in a twist when discussing a company you may or may not want to invest in\n2. When you say a company has an agenda, it’s reasonable to expect others to ask what that agenda is\n3. You still haven’t actually explained what you think the agenda is, just that you are very upset about the details of an upcoming movie\n4. It seems messed up to think marrying a minority is supporting them, that’s some weird white savior narrative coming from a brown person \n5. Sheep intestines are one of the whitest foods around, offal is big particularly in Scotland, one of the whitest lands around \n6. How weird is it that you assume what food I do or don’t like based on this thread \n7. What country are you from? Because you talk intimately about US politics and then say when you mention it to Americans they get disgusted\n8. I obviously didn’t make you gain or lose any money today, so that’s a pretty weird thing to throw in there \n9. We’re on an investing sight, but you have made this extremely political for no reason - I am not trying to help anybody just talking about stocks…", "score": 1, "replies": [{"body": "I know nothing about Scottish culture, I’m not Scottish or anywhere close to that part of the world. Good to know others like intestines but surely no one I ever met, and I meet thousands of Americans. I am American living but not raised in America \n\nYour Disney interest is what got me rich, I am putting they company so people like you are helping me grow and I thank you all for your delusions. I also explained the agenda Disney has so the answer is in my reply and I will not repeat my answer. I can tell you the sky is blue all you want but if you ignore then it’s on you \n\nI can sound as emotional as you think, it’s all subjective, and I care not about subjective. In the end I do my math and I calculate Disney is failing and get puts. If Disney was rising my math would show it, and I would get shares. It’s that complex, and that’s why most people fail the stock market because no one cares to do math\n\nGood to know you are racist, you would probably never marry a brown person. I can bring any Indian girl and you would pain them or Arab girl. Oh Indians and Arabs are VERY CONSERVATIVE, it’s the reason my family supports sodomy laws. Hopefully America adapts like the Middle East and Africa, or stay racist and say they support brown and black skin folks but ignore our entire culture", "score": 0, "replies": [{"body": "Right but I don’t have a position in Disney. Good luck with your outs but you’re so eager to tell me how smart and successful you are you seem to have not actually understood that my post was just discussing stocks I have been watching and to see what others are. \n\nYou have not explained what you think disneys agenda is. You defined the word agenda for some reason, lectured me about the word woke, told me I’m racist, and told me you didn’t appreciate that Snow White was black and there weren’t any dwarves in a movie that hasn’t been released yet. That’s not an agenda…\n\nWhat does your math show fair value for Disney is? Because you haven’t mentioned anything factual so far, just your opinions and your puts", "score": 1, "replies": [{"body": "This is a wild comment thread, thank you for keeping it going. So much excellent copypasta. I can't believe that people like that are out there. What a freak. Absolutely no social or emotional intelligence at all. It's actually scary.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "You need massive help lol", "score": 1, "replies": [{"body": "What sort of help? And by what standards? I can say you need help with communication", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "ASTS", "score": 5, "replies": [{"body": "Assuming land based internet is cheaper than satellite based internet, who is the target demographic of ASTS? People with money already live in areas covered by land based internet. What problem is ASTS solving? \n\nDoesn't the Starlink antenna model make more sense if the goal is to bring internet to areas where there is no internet coverage? \n\nIt's not like Chinese or Iranian people can just suddenly signup with ASTS just because it doesn't require an antenna. Or can they?", "score": 1, "replies": [{"body": "Uh lol ok yeah I mean rich people buy things all the time to remove minor inconvenience so why not never drop coverage on planes or the high way or in the mountains on that ski trip or who knows I don't think it's hard to imagine even wealth people and nations would use this there is a demand for more data every day as more devices get connected and there is a whole world out there besides Iran and China", "score": 1, "replies": []}]}, {"body": "the new bagholder stock huh", "score": 1, "replies": [{"body": "I mean potentially", "score": 1, "replies": []}]}]}, {"body": "DKNG", "score": 5, "replies": []}, {"body": "SOFI earnings coming up, ARK just bought some, very fast growth, CEO is phenomenal and is always buying shares, profitability by eoy...", "score": 6, "replies": [{"body": "Nah, the rocket missed this one.", "score": 1, "replies": [{"body": "Aged like milk", "score": 1, "replies": [{"body": "bro, aged like milk would mean the exact opposite; Sofi plummeting.", "score": 3, "replies": []}]}]}]}, {"body": "Snap", "score": 3, "replies": []}, {"body": "EOSE", "score": 3, "replies": []}, {"body": "NSSC\n\nThey make security equipment and the software that goes into them. Lots of recurring revenue and solid balance sheet. It's not cheap right now, but a great company.", "score": 2, "replies": []}, {"body": "AFRM, TWST, SDGR.", "score": 2, "replies": []}, {"body": "Mercer International. Well diversified and mass timber is growing rapidly. It will probably overtake concrete in the next 2-3 decades. With that in mind, they recently aquired one of the largest masstimber companies out there. Also pays a good dividend.", "score": 2, "replies": []}, {"body": "LVO - LiveOne\n\nI’m very optimistic in the growth potential, still undervalued currently. Take a look at recent news.", "score": 2, "replies": [{"body": "I've been holding this one for a few years. Bought some more last week, 2300 shares at 1.81. Total gain of -8.5% as of today so I'm close to seeing green. Hoping for a nice upside to those $6-$7 price targets that are projected", "score": 3, "replies": []}, {"body": "This aged poorly", "score": 1, "replies": [{"body": "Like a fine bottle of piss.", "score": 1, "replies": []}]}]}, {"body": "RYCEY (Rolls Royce)\nNot the car company! Just look at their press releases here, making huge moves and signing billions of dollars worth of contracts in various sectors from maritime, to military, to commercial flight, to aerospace, to nuclear tech. I personally think they are a cool company, plus it's a British legacy company, they would get bailed out before bankruptcy. \n\nhttps://www.rolls-royce.com/media/press-releases.aspx", "score": 2, "replies": []}, {"body": "Ginkgo bioworks (DNA)\n\nMarket agnostic synthetic biology play. Risky, but recently technicals are favorable.", "score": 2, "replies": []}, {"body": "Tsla", "score": 2, "replies": [{"body": "Did not age well.", "score": 1, "replies": [{"body": "Apparently they didn't beat and the numbers they showed terrible.\n\nEdit: oh btw VAW went up yesterday they are doing better the tesla I guess that makes sense?", "score": 1, "replies": []}]}]}, {"body": "Mttr", "score": 3, "replies": []}, {"body": "NYSE:NU\n\nPrice is still lower than IPO, but recently changed to a profitable company and the trend now changed to increasing prices.", "score": 3, "replies": [{"body": "I’m not too sure on how to analyse this company. I have been curious because of Buffet, but Idk", "score": 2, "replies": [{"body": "Some disclaimer before I start: I'm Brazilian so I know the company since it's start.\n\nNubank started in Brazil because they saw an opportunity to take clients that no other bank wanted to take (unbanked). The rates of unbanked people in Brazil were high back then. Also because banking concentration in Brazil was very high, 5 big banks got pretty much all market share of people and business on banking services. 2 of the banks are state-owned (Banco do Brasil and Caixa Econômica Federal), other 3 are private (Itaú, Santander and Bradesco). The last reason to choose Brazil was because it's a very big market to try.\n\nTheir strategy worked, they started with only one service, a credit card and no physical stores and over 10 years grew to many services, including investments, cripto, checking account, insurance, loan, business services, etc. And the number of clients also grew a lot, up to 80 million, that is more than 30% Brazil's population.\n\nAnd they received so much funding they didn't worry much about profits for a long time, only spending to grow their services. It's worth to notice that they never spent much on advertisement, they always had a customer service so much better than the other banks that they basically grew by word of mouth.\n\nWith the funding, in the last 4 years they also started expanding to other Latin American countries, Mexico and Bolivia. Mexico is growing very fast and they say faster than their growth in Brazil. Bolivia is just starting but I don't see why it won't go the same way.\n\nThey still have zero agencies/stores and their software UI is very praised among Brazilians as the best and easy to work with UI. Their cost to maintain a customer is always $0,80, regardless of how many customer they gain every year. That shows their software is very scalable.\n\nTalking about software, they use a specific programming language because they wanted to reduce the chances of bugs in their solutions, so they do a lot of work using a functional approach instead of a procedural one. And they even bought the software language company to make sure it will keep evolving. They never had a problem of data breach or funds misplacement I can remember, other Fintech competitors had some of these same problems in the meantime.\n\nThey just started to be profitable, probably because the stock fell a lot after the IPO and they received criticism around not having proved themselves as a profitable company. I knew Nubank was solid so I wasn't worried about that. The profit today comes from Brazil's operations, while Mexico's and Bolivia's are focusing on expanding the customer base.\n\nAnyway I'm bullish and I think Buffet is too.", "score": 6, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Nintendo is still a zero. No one will buy a sideways stock", "score": 3, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Nope. If next-gen consoles can't save them, then no one can. Great company tho, just an unusually shitty stock compared to it's competitors.", "score": 1, "replies": []}]}]}]}, {"body": "Green Brick Partners. That company has had a massive runup and is, in my opinion, still fairly priced at a forward PE of 10 (definitely slightly rich for a homebuilder, but still).\nQuite frankly i don't understand their valuation: Yes they trade at a premium at their sector as they should as they own a lot of land they can build on and thus have great margins, but why is their PE so low in general? They have not had an unprofitable quarter in 8 years and crazy growth to match. Not only that but their ROIC keeps on growing and growing too (20% in 2022).\nThey have grown their revenues yoy on average by 28% for those 8 year period. Even if their growth would slow down (doesn't look that way since orders for new houses are picking up too), they would still be growing exceptionally for their price and ROIC.\n\nPlus they are a simple and understandable business: They build houses.\n\nFor me they seem like an exceptional company at a good price.", "score": 2, "replies": []}, {"body": "PayPal. Literally used in every facet of online purchasing nowadays internationally", "score": 2, "replies": [{"body": "I barely ever use it and I shop online a decent amount", "score": 2, "replies": [{"body": "Ok that’s fair, I purchase over $300K per year online for my business and I use it and trust it a tremendous amount. Additionally, for any payments international I always use PayPal because it’s the safest way to ensure a refund if things go wrong.", "score": 3, "replies": []}, {"body": "Ever use Venmo?", "score": 1, "replies": [{"body": "Yeah but just for personal payments", "score": 1, "replies": []}]}]}]}, {"body": "TSLA, MTTL", "score": 1, "replies": []}, {"body": "SOFI, ALLY, NU, PYPL, maybe HOOD\nAll growth stocks poised to grow once there are rate cuts", "score": 1, "replies": []}, {"body": "\"Zoom\"", "score": 0, "replies": []}, {"body": "I have some actual growth stocks instead of these", "score": -2, "replies": [{"body": "Cool, do you wanna share and discuss them…", "score": 3, "replies": [{"body": "FTNT is will make more in stock price than any of these in a year", "score": -2, "replies": [{"body": "What makes you say that? It has a high pe and is at its 52 week high?", "score": 1, "replies": [{"body": "It’s been at a 52 week high since I bought it at 52$. They print money. 32% revenue and 76% profit margin for the last 2 years.\n\nThe war in Ukraine has the Ukrainians using almost 100k drones this year to fight off Russian advances. Do you believe warfare is going to see less advances in cyber? It’s FTNT and PANW for the future duopoly in this sector. I’m buying until it caps at $90. I’m holding probably for life", "score": 0, "replies": []}]}]}]}]}, {"body": "I’m sticking with SNPS, CDNS, ASML. \n\nThrow in a little MPWR just because.", "score": 1, "replies": [{"body": "Should stick AMAT in there as well. Really liking the chip equipment manufacturing. Honestly the best way to play AI in a safe way.", "score": 1, "replies": []}]}, {"body": "FLNG \n\n(personal bet, you might see me on WSB in case it goes wrong)", "score": 1, "replies": []}, {"body": "NYSE: SMR\n\nThey build small modular nuclear reactors.", "score": 1, "replies": []}, {"body": "VOO and cover all bases", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I still see zoom used quite heavily, and it’s very easy to adopt particularly on mobile devices. I don’t see remote work becoming less frequent post pandemic, I see it continuing to grow and become more a part of everyday business. That leaves ample room to grow alongside its rivals", "score": 0, "replies": []}]}, {"body": "ASO!!", "score": 1, "replies": []}, {"body": "IOVA bout to take off.  Get in soon.", "score": 1, "replies": []}]}
