{"title": "Why or why not, would selling covered TSLA calls not be free money?", "selftext": "How could this blow up in my face other than Tesla becoming bankrupt? Because Tesla is constantly high IV. I wish I had dumped everything I had into Tesla when it was near $100 a few months ago. \n\nI could have been selling covered calls with far out strikes and been making thousands in premium. \n\nIs this totally misguided or nah I missed the train for sure?", "id": "14pxbcf", "created_utc": 1688424040.0, "score": 1, "upvote_ratio": 0.52, "num_comments": 82, "comments": [{"body": "oh boy…", "score": 37, "replies": [{"body": "You know we’re overbought when you start seeing posts like this.", "score": 7, "replies": []}, {"body": "Can you explain why I’m stupid please. I’m taking everyone on the internets advice with a grain of salt, but I’m interested to hear your thoughts. \n\nI’m not good with options. And was just trying to find a way to make money with all the money I have sitting around thru a relatively safe means", "score": -14, "replies": [{"body": "Tesla (as a stock) did nothing for two years. Then it went pretty much straight up for two years. Then it went straight down for a year and now has been pretty straight up for 6 months. \n\nWill it keep going up for another 6 months or a year or more? Will it start to tank for another year? Will the car manufacturers that actually sell cars go all electric in the next couple of years and put Tesla out of business (_ducks the impending hate comments_)?   \n\nThe point is no one knows. It’s not free money. Tesla went down 75% in 2022. It still hasn’t recovered yet. So if you asked this question 18 months ago, you’d currently be in a world of hurt.", "score": 13, "replies": [{"body": "Exactly this.  Nothing is a sure bet in the world of investing.  Going all in on a single ticker is suicide.", "score": 6, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Cmon man, what if I just throw it on red and it goes green 🤷🏻‍♂️\n\nEdit: I’m fuckin with you", "score": -4, "replies": []}]}, {"body": "Relatively safe? You know tbills are paying 5.4% right?", "score": 1, "replies": [{"body": "How do I buy? Can I buy in and exit easily? Is there a risk of my investment going south?", "score": 1, "replies": [{"body": "Could just buy a money market, intended to always stay at $1 per share, similar yield to Tbills. Can buy or sell daily in your brokerage account. I'd just look up money market tickers on Google", "score": 1, "replies": [{"body": "What does money market allude to? Sounds like its an etf or collection of safe stocks that pay solid safe interest. So if I have money in my bank, transfer it to my thinkorswim app and buy a “money market” ticker that people trust? And that will be a smarter way to hold my\nMoney than leaving it in my bank sitting?", "score": 1, "replies": [{"body": "If your account doesnt have a default money market sweep you can buy a money market mutual fund. You'll actually get interest on it vs holding it in a bank, thats the advantage. They hold extremely short term bonds, so the price is intended to always stay at $1 and pay you monthly interest. The interest rate your paid will change with short term rates.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Bro… clear your head. The fact that TSLA was 100 not to long ago is irrelevant. “But if only I had done this” right before “changing strategy to the thing” is flawed.\n\nIf you had tsla and sold CC you would have massively underperformed buy and hold. You would have worked 3x has hard to make less.\n\nShares plus CC can be assumed “neutral” let’s say - yet Tesla is very very directional always.\n\nThis is a strategy for something with low vol that goes sideways that is also a great company and fairly valued.\n\nIf you want to do some options on TSLA and want to FOMO or yolo  then just sell ATM puts/spreads", "score": 9, "replies": [{"body": "If he has tesla at 100, he would have continuously rolled for losses and them whine about why cover calls aren’t making money.", "score": 1, "replies": [{"body": "Facts", "score": 1, "replies": []}]}]}, {"body": "> How could this blow up in my face other than Tesla becoming bankrupt\n\nThe value of your Tesla holding could go down in value more than you make off the call premium", "score": 6, "replies": [{"body": "The company would have to stay below $300 for the remainder of its life at this price point for it to be a fail", "score": -1, "replies": [{"body": "If you are sure the stock will go up, you're right, there's no way to lose selling CCs or simply by holding the stock", "score": 3, "replies": []}, {"body": "What if it rockets", "score": 1, "replies": []}]}]}, {"body": "You can definitely make money selling ccs. Do you already own shares, or are you talking about buying shares now just to sell against?", "score": 6, "replies": [{"body": "Maybe buy em now or wait for an entry. I’m more so realizing how I had so much much money that was just sitting back when Tesla was super low. Like $120 range. I coulda bought a good amount back then and not have to worry about work, just sell covered calls smh 🤦🏻‍♂️ fuck I’m sad. I feel like that ship has sailed now", "score": 2, "replies": [{"body": "You could’ve sold covered calls at 150 but you likely would have been assigned and missed the rest of the ship anyway.  Not much to be sad about if that’s what the alternative was", "score": 7, "replies": []}, {"body": "Is tsla the only ticker you've ever heard of? There will be other opportunities with other stocks and it's not far off. Maybe start learning how to spot stocks that should come in to favor.", "score": 3, "replies": [{"body": "How can I spot them?", "score": 1, "replies": [{"body": "Podcasts and news articles and YouTube channels. Look for technical breakouts. Some stock advisers have newsletters you can pay for where they recommend or point out stocks with movement they like.", "score": 1, "replies": []}]}]}, {"body": "Consider selling csp's at or around the strike you wouldn't mind paying for the entry.   You can make the premium, and if/when you do get assigned, you will then have the shares but at a lower cost basis due to the collected premiums.", "score": 2, "replies": []}]}]}, {"body": "You could definitely make some money off of this, but I wouldn't call it free money. You'd be accepting all of the downside risk with little of the profit potential.\n\nIn other words, if it goes down a lot, you lose a lot of money. If it goes up a lot, you don't make much money.", "score": 6, "replies": [{"body": "Why not? The premium is pretty huge. If I make the strike high enough, I can usually keep premium plus appreciation of share price. And the way Tesla rises, it would be just as much to be made going up as going down. I’m not talking about buying calls. I’m talking about selling covered calls", "score": -1, "replies": [{"body": "The premiums are huge because the movements are correspondingly huge.   The volatility is part of the price.   Yes, you can sell a high strike price but the only strikes that are safe are the ones that have a lot less premium.  I’m sure you know this, but I think you may be over estimating how safe the high strikes are with Tesla", "score": 5, "replies": []}, {"body": "Options, stripped down to it's essence, is basically paying someone else to take the risk for you. The only reason the premium is huge is because the IV is high. TSLA is a ticker that can either rally or crash 20% in a single week. \n\nYou aren't smarter than the rest of the market, people who bought your calls aren't idiots either. The only reason why the market is willing to buy your calls at a high premium is because the odds of hitting that strike is equivalently high.", "score": 2, "replies": []}, {"body": "Why are you asking for advice and then arguing with it? Everyone is telling you that your concept is naive but you want to keep making your silly point.", "score": 2, "replies": []}]}]}, {"body": "You buy 100 shares today at 275 and Tesla drops to 180. Ok, no big deal, you're temporarily down, but you can sell a call. Calls at your cost basis are a bit pricey so you sell one at 210. Tesla moons to 300, damn, it's gonna keep going! You buy back the call at a loss to stop missing out on gains. Tesla comes back to 275 and you're back where you started just a few thousand dollars poorer. Rinse and repeat.", "score": 5, "replies": []}, {"body": "Do you want to invest in Tesla at this valuation? Well then, your thesis is sound.", "score": 5, "replies": []}, {"body": "What happens if the stock goes down?", "score": 4, "replies": [{"body": "I think he said “free money” so should be good", "score": 6, "replies": []}, {"body": "Whoa whoa, wait, what? A stock that has run up 150% in 6 months, might, go…*down*?! Shocked Pikachu", "score": 4, "replies": []}]}, {"body": "\"How could this blow up in my face\"\n\nTrust me Mr. dirtiestofbuttholes, the market will find a way.", "score": 5, "replies": []}, {"body": "It's not free money because you are getting paid to take on risk while someone else reaps the rewards. You're basically saying \"I bet TSLA won't go up or down until the expiration date\". Is that a bet you feel comfortable making? If so than yeah, go ahead and sell CCs.", "score": 3, "replies": [{"body": "How is that my bet? Right now price is $280 or something. If I do a strike of $350 or $320 there’s a decent amount of premium and the chances of it hitting are possible but enough room to hopefully keep the shares. Worse case I have to sell my shares and get the premium plus appreciation", "score": -2, "replies": [{"body": "That isn't the worst case.  Worst case is it goes back to $100 a share and you don't see any gains for a few years.  You get the premiums from this CC, then the next one is less as it goes down, but you know it will recover, so sell another CC for less premium.  Keep doing this and it sits at $100 (so $10k stock value) and you sell maybe two or three CCs for 800-1000 each on the way down, so maybe $3k, and you've now turned your $27.5k investment into $13k and you are afraid to sell CCs because even at $180 you only get $100.\n\nIn that scenario, are you going to cut your losses at some point? You ok holding TSLA for a couple years at $100 a share or are you going to take the $14k loss?", "score": 7, "replies": []}, {"body": "That is not an approach to CCs I would recommend taking. Yeah you can sell far otm calls with a far out expiry but if you look at [this graph](https://www.investopedia.com/thmb/BCVAA13Jg4MWHLCqSHwYEHHeWF0=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/dotdash_Final_Time_Decay_Apr_2020-01-a2824c7ac5ad47ed9082ea52f9ace031.jpg) you can see that the value of options decays more steeply closer to the expiration date. What this means to you as an option seller is that you make most of your money closer to expiration. You will rake in more in premiums by selling monthlies or even weeklies closer to the money than you will selling far otm long expiry options. If you sell a call and it looks like it's going to expire in the money, you decide if you want to roll the CC over for a higher strike. You might lose sometimes but I'd say more often than not the CCs I sell expire worthless, which is what I want. \n\nEdit: should probably mention that you might wanna think about a different stock if you're just getting into CCs, F is less volatile and the shares are much cheaper to buy in and there's a lot less downside. Tsla is overvalued af IMO, I wouldn't be buying in at this price.", "score": 3, "replies": []}]}]}, {"body": "I owned TSLA at 150 and sold 177 ccs.\n\nBlew up in my face", "score": 3, "replies": [{"body": "You shoulda waited for more market direction but that sucks man", "score": -8, "replies": [{"body": "Meh, I'm up 86% this year on my portfolio...can't win them all.", "score": 5, "replies": [{"body": "Fuck I’m terrible at trading stocks", "score": 2, "replies": [{"body": "Only if you're constantly losing money or not keeping up with an index fund every year.", "score": 1, "replies": [{"body": "I’m not keeping up. I’m not doing anything. I don’t wanna risk my hard earned money on this rigged market. Six months and I’m up 2%, next month it drops 20%", "score": 1, "replies": []}]}]}, {"body": "how much were you up in 2022?", "score": 1, "replies": [{"body": "I was down 20%. \n\nWould've been more, but thankfully I took out 106k to buy a triplex in cash.\n\nEDIT: Oh I get it. You were trying to pull a gotcha moment and it backfired.", "score": 1, "replies": [{"body": "Interesting choice with the cash. May I ask why you chose to not get a loan?", "score": 1, "replies": [{"body": "It was quicker to do a cash deal and it \"needed\" a roof.", "score": 1, "replies": [{"body": "Ah that makes sense", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I would sell OTM puts (-10/15%) and then if you get assigned, sell CCs and keep rolling until it gets called away.", "score": 3, "replies": []}, {"body": "Yes it’s free money just do it already please.", "score": 3, "replies": []}, {"body": "Lol, sure you could be like me, buy at 100ish, and end up getting called away at 140 and be chasing it with CSPs ever since. There is no reasonable way to roll out far enough during these big moves.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I wait for the return of share price or sell at extreme highs and buy back in lower.", "score": 0, "replies": []}]}, {"body": "Either invest in it or trade it.  Don't sell calls if you are an investor (and wait for pullback at this point if you are not already in).  If trading, buy a LEAPS call and sell over top of it, just make sure the width of your strikes is sufficient to cover your premium.  Be prepared to manage the position.  Overall it makes great returns.", "score": 2, "replies": [{"body": "Do you know of any good videos or articles that talk about how to use LEAPS in this way? I’m struggling to understand how to properly use this for a profit", "score": 1, "replies": [{"body": "https://youtu.be/LnVI-8efQsQ\n\nDude has some good vids.", "score": 2, "replies": [{"body": "Awesome! I’ll give him a watch! Thank you!", "score": 1, "replies": [{"body": "Sure.  Also look on YouTube for poor man's covered call. There are many that explain it well, like this https://youtu.be/LmqbVg9zqjQ", "score": 2, "replies": []}]}]}]}]}, {"body": "Ive been selling CCs on tesla for most of this year and when they get called away i start writing CSPs.\n\nDepending how much capital/leverage you have, you could definitely make decent money on tsla.", "score": 2, "replies": []}, {"body": "The top is in lads", "score": 2, "replies": [{"body": "Up 18% smh", "score": 1, "replies": []}]}, {"body": "Hedge it with calls", "score": 1, "replies": []}, {"body": "Just chiming in on someone here that was doing covered calls on TSLA. I’m long term bullish on the company full disclosure but I also don’t own any shares, I trade it constantly. I held shares and tried CC’s and got blown away a time or two too many. TSLA when she moves, she MOVES. I’m sure you have noticed it’s volatile. I think it’s fine if you’re ok with these things but it can also turn against you. I wouldn’t suggest doing CC’s on a large position but certainly some could be fine.", "score": 1, "replies": []}, {"body": "If you're holding shares, best to do a covered strangle on part of your position.  \nLeave some room for long term upside.  \nBut be prepared to get your shares called away.\n\nThere will be opportunities to add more shares later, there always is. Trajectory is never a straight line.", "score": 1, "replies": []}, {"body": "I do this. Just made $4,500 on a 330 strike CC with a 6/21/2024 expiration.\n\nI've sold 2 previous CCs and bought to close them for a combined $900 profit. I just wait for tsla to gap upward on a new 6 month high and then wait for a pullback.\n\nHonestly, I've just been lucky. I could have sold those CCs and then tsla might have gone to the moon. And then I have a lot of capital tied up for nearly a year unless in the unlikely event someone exercised the contract early. The exact same shit is happening to me right now with NVDA.\n\nBut I'm still above my cost basis with NVDA and I'm way above my cost basis on TSLA. The only thing I know for sure is that stocks go up and they go down. The higher they go up, the more likely they are to go down due to profit taking, reversion to the mean, investors looking at P/E ratios, and the fact that rising stock prices rely on a string of good news that is more likely to break as time goes on. Maybe I'm right. I sure as he'll didn't predict the AI nonsense going on right now. But I'm hoping I'm right more often than I'm wrong.", "score": 1, "replies": [{"body": "whats your plan if it rips to 1k?", "score": 1, "replies": [{"body": "Wait for it to maybe come back down so I can close the call. If not, wait for assignment and sell puts when it does dip back down.", "score": 0, "replies": []}, {"body": "Update, I just closed this call for $500 profit and I'll wait for tsla to gap back up to sell another one. So I've made $1,400 opening and closing calls on the same 100 Tesla shares that I own. Each time I do it, I can be a little more aggressive knowing that I've already made a tidy profit. But yeah, one of these days it might actually shoot to 1000 and the call I sold against it will be worth double or triple what I actually got for it. But for now, I'm basically in the business of selling hot garbage right before it catches on fire and then buying back the ashes for cheap.", "score": 1, "replies": []}]}]}, {"body": "Covered calls are free money.  However, everything you do in markets has a trade off.  The trade off with covered calls is you cap your upside if TSLA keeps going up beyond your strike.  Another trade off is if the stock tanks, you would have been better off just selling your shares (though you did offset losses with the covered call premium).  Don’t sell a covered call unless you’re positively ok with losing the shares at your strike.  Many people sold CCs when the stock reclaimed $200, and now regret it.  There’s always a trade off for any move you make.", "score": 1, "replies": []}, {"body": "there is no such thing as free money with derivatives. I sold a 25% OTM, 30 DTE call for 1.5% of the strike price and ended up buying it back for 10x that amount today. It was secured by a long call so I was still able to net a 50% gain on my cost, but I could have netted a 100% gain on cost had I not sold the call. \n\nMeanwhile last year I bought shares at 290 and sold a 295 call for 15. The stock proceeded down to 100. Yeah I kept my 1500 premium, but I'm hoping to get some long term profits here soon and trying not to look to hard at the 300% gain I could have made had I been prescient enough to perfectly time the market. And make a note of that: if you experience a -65% drop, you have to get a 290% increase to break even", "score": 1, "replies": []}, {"body": "I have been doing it for months.  It takes a fair amount of management but works great.  I am selling puts in there now to get back in at a better price.", "score": 1, "replies": []}, {"body": "Since no one else mentioned it, there is significant earnings risk coming up on 7/19.  Anything less than stellar should dump it quite a bit.  However, with TSLA it might be stellar, or people could just FOMO anyway.  Just be aware that some movement is likely.", "score": 1, "replies": []}, {"body": "TSLY by Tidal / YieldMax is alreading doing a TSLA FD strat as an ETF which also has its own option chain so you could do covered calls on a TSLA Derivative Income ETF and get the full derivativception experience.", "score": 1, "replies": []}, {"body": "Actually, the covered call helps if the stock goes down. If you sold the CC the stock would have been taken away from you at the strike price", "score": 1, "replies": []}, {"body": "Delta has to be insanely low to feel safe and therefore hard to make a lot of cash with CCs.\n\nFor eg, I own 7500 shares and terrified to lose them.\n\nSold 330 call 6/21 exp before June share run up\n\nRolled to 420 7/20 exp\n\nRolled to 480 8/18 exp\n\nBut only like $1.18/share premium for Aug 18 at 480 strike, so was like 2-3%/year return.\n\nWill roll again if price reaches 350 or so", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": []}, {"body": "Lol; hindsight trading.  You can’t trade with that mindset.  \n\nIf you did what you are proposing; you would have been underwater on most of your covered calls and would have performed worst than buying and holding.  Selling cover calls on a fast rising stock is stupid.\n\nThe play was to buy and hold or buy calls.", "score": 1, "replies": []}, {"body": "If you make $100 from a cc you make 100 but if it hits 500 and your cc was 300 you missed big and should've held. Stick to stocks that are barely up in 5 years for selling ccs and holding growths like Tesla", "score": 1, "replies": []}]}
{"title": "Apple Squeeze Imminent", "selftext": "[deleted]", "id": "14p5k4b", "created_utc": 1688348768.0, "score": 0, "upvote_ratio": 0.36, "num_comments": 83, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|2 years ago\n**Total Comments**|136|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "This sounds like self-castration to me.  Are you able to ejaculate?", "score": 36, "replies": [{"body": "Did earlier, but that was earlier", "score": 8, "replies": [{"body": "You'll be ok. You don't really need your nuts.", "score": 3, "replies": [{"body": "Fun fact if you louse one of your nuts the other compensates and makes a super nut![img](emote|t5_2th52|4271)", "score": 7, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}]}]}, {"body": "![img](emote|t5_2th52|4271)", "score": 2, "replies": []}]}, {"body": "This is gonna age well. They’re cutting back on Vision Pro production ![img](emote|t5_2th52|4271)", "score": 13, "replies": []}, {"body": "YouTubers will buy to get more views . I got questions to ask; how many Americans have $3500 + tax laying around to buy a product that in about 2 weeks of use will start accumulating dust ? \n\nHow many of those who actually buy the product will actually wear it the whole day ?", "score": 25, "replies": [{"body": "GoPro all over again. You buy for the hype then have it sit all year long.", "score": 16, "replies": []}, {"body": " Not many, I bet. It's like buying a treadmill and using it as a clothes hanger.", "score": 9, "replies": []}, {"body": "🤚", "score": 2, "replies": []}, {"body": ">how many Americans have $3500 + tax laying around to buy a product that in about 2 weeks of use will start accumulating dust ?\n\nAsk the people who bought a Peleton ![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "Your expectations of their expectations are off. Not looking to make it a device you wear all day, although some certainly will. Kids are going to fucking love this thing. \n\nNot everyone’s broke, especially Apple’s core market", "score": -9, "replies": [{"body": "$3500 and you going to let it sit all day ?", "score": 2, "replies": [{"body": "Why are your standards either use it all day long or let it sit all day long  …. ? \n\nSome people could use it a few hours a day ..? \n\nMaybe 8 hours one day and 15 minutes the next day … ? \n\nEverybody’s different …? \n\n….. ?", "score": -4, "replies": [{"body": "There's no content. There is no purpose in wearing these. And the batteries die quickly. I'm not saying it will never be useful but it's not there yet.", "score": 1, "replies": []}, {"body": "You spend $3500 plus tax on item and use it a few hours or 15 minutes . How many people will be wearing this thing for 8 hours a day ?  \n\nOn the other hand , a 256 gb iPhone 14 pro max will set back around $1300 or higher . How many people here use their iPhones few hours or 15 minutes per day ?", "score": 0, "replies": []}]}]}, {"body": ">Not everyone’s broke, especially Apple’s core market\n\nnot even that far, like i've said a trillion times on here... once the have nots, see the haves wearing the iGoggles, it'll make the iGoggles a must have item!\n\nnobody wants to be the poors not in the clique", "score": 1, "replies": []}]}, {"body": "I think the best market will be design, anything 3D. Apple has owned the graphic design space a long time. This headset will work well for visual effects artist for games and movies. That weird ass Lion King remake was done mostly in VR headsets. Auto manufacturers will use it. Maybe even Crayola will design their next generation of crayons this way. \n\nBuying expensive tools to make your expensive creatives more productive is the norm. I don’t see many people buying these as individuals.", "score": 1, "replies": [{"body": "VR, not AR...", "score": 1, "replies": [{"body": "This Apple device can do both AR and VR, thanks to external cameras. But so can the first gen Oculus Quest. I’m not sure what you are saying.", "score": 0, "replies": [{"body": "Ar is useless", "score": 0, "replies": []}, {"body": "Vr good for porn i guesss?", "score": 1, "replies": []}]}]}]}, {"body": "Also you know the apps won't be free, and they will be a premium. So Most likely 20-50+ per app minimum.", "score": 1, "replies": []}]}, {"body": "![img](emote|t5_2th52|8883) me putting my life saving into this play for 2 weeks\n\n![img](emote|t5_2th52|4260) me end of 2 weeks watching it never reach $225", "score": 8, "replies": [{"body": "$225? Thats just another casual $500 billion in market cap, I'm sure itll reach", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "![img](emote|t5_2th52|4276)", "score": 3, "replies": []}]}, {"body": "A 3500 dollar product that has a 2 hour battery….hard pass bro", "score": 19, "replies": [{"body": " At least it gives you an excuse to take breaks and socialize while waiting for the battery to charge", "score": 1, "replies": []}]}, {"body": "Ah yes you tubers like it. People who are given apple products for free in advance to “review” them only to be cut out of the loop if they provide an honest review are always a good measure of broader demand.", "score": 12, "replies": [{"body": "Youtubers like it because they have money to spend that their viewers don’t. Is the equivalent of showing off an expensive car on YouTube. It doesn’t fit in the car maker is doing well.", "score": 2, "replies": []}, {"body": "Regardless, millions of eyes are seeing these videos", "score": 0, "replies": [{"body": "Yeah, like if you search for Ferrari on YouTube, there's tons of video with +10m views and they sell around 10 000 car per year...", "score": 1, "replies": []}]}, {"body": " YouTubers and 'honest' reviews go together like peanut butter and jelly...if they were both made of artificial flavors", "score": 1, "replies": []}]}, {"body": "I can see that.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "😩 say it harder!", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Depends on your risk level. Those are cheap…\nRegardless of time frame I’ve been buying 2024 and 2025 expiry", "score": 4, "replies": []}]}]}]}, {"body": "Jesus Christ you’re still fanboying over the vision pro?", "score": 3, "replies": [{"body": "Nobody asked you General Cum, Apple to 225", "score": 1, "replies": [{"body": "You posting in a public forum is you asking the forum you god damned fanboy regard", "score": 8, "replies": [{"body": "You’re a closet fanboy shut da hell up", "score": 2, "replies": [{"body": "Prove you aren’t main lining uncut Tim Cook spooge right now", "score": 3, "replies": [{"body": ">Tim Cook\n\nwho is is tim cook¿!¿\n\ntim aapl to 69T market cap!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Spy 500 not 470", "score": 3, "replies": []}, {"body": "You sure the vision pro will have big demand cause we’re the iPhone 14 came out and the Mac 2 there was less buyers. And I don’t think people will have 3500 usd in there saving account. Probably use a credit card. You can buy a VR in meta only 500$. But I will hold Appl stock cause it’s apple", "score": 3, "replies": []}, {"body": "I'm buying this fucking thing\n\nTim Apple is buying me one with dividend payments alone.", "score": 3, "replies": [{"body": "The dividends? Maybe for a couple of cappuccinos a month.", "score": 1, "replies": []}]}, {"body": "$225 is another $500 billion in market cap. So you expect aapl to add half of nvdas market cap for goggles?", "score": 3, "replies": []}, {"body": "They better be good when they are $3,500 I wouldn't pay $180 for the facebook googles", "score": 2, "replies": [{"body": "Yeah a social media company trying to make a tech product was a failure. We’re dealing with a real tech company now", "score": 2, "replies": [{"body": "A shitty tech company.  I have the 14 because fuck google, but ….my next phone won’t be an Apple product.  Wish the Surface phone would have caught on, maybe BlackBerry will get back into the game?  Fuck I’m buying another iPhone.", "score": 3, "replies": [{"body": "Lol blackberry went to android but was too late.", "score": 1, "replies": []}]}]}, {"body": ">facebook\n\nfucc the zucc is a fucking dork!![img](emote|t5_2th52|4267)\n\ntim aapl is ![img](emote|t5_2th52|8882)", "score": 2, "replies": []}]}, {"body": "Can’t go tits up.", "score": 2, "replies": []}, {"body": "Tell me you have far OTM calls without telling me you have far OTM calls expiring this week.", "score": 3, "replies": [{"body": "Long calls, I’m just saying it’s primed for a SQUEEZE", "score": 1, "replies": [{"body": "I swear if fucking morons don't go look up what \"squeeze\" means before you post this stupid shit...\n\nWhen you type that word absent of its actual context, do you not realize you lose ALL credibility in ANYTHING you are saying? I wouldn't believe that dogs bark if you told me now.", "score": 4, "replies": []}, {"body": "Squeeze DEEZ NUTS  beeeATCCH", "score": 3, "replies": []}, {"body": "Do you even know what a squeeze is ?! Seems like not", "score": 2, "replies": []}]}, {"body": ">expiring this week\n\nnot expiring this week.\n\nbut yes i have several otm calls expiring, well over 3 months from now\n\nonly way to make money dog!©️™️®️", "score": 1, "replies": []}]}, {"body": ">You're right, the potential for Vision Pro is growing every day. The call option volumes are definitely increasing and earnings are around the corner which will only draw more interest. I think Spy back to 470 and Apple to 225 is a great idea!", "score": 2, "replies": [{"body": "Can you be sued?  Asking for a friend.", "score": 3, "replies": []}]}, {"body": "Stupid post\n\n$3500 VR with no content = negative revenue vs development, deployment and marketing cost.\n\nGet back to us next year when Apple is back to a rational valuation.\n\nOh yeah - YouTube Influencers that got it for free aren't consumers, they're paid shills.", "score": 1, "replies": []}, {"body": "Fuck it! I’m buying puts!", "score": 0, "replies": []}, {"body": "If you think a VR headset is going to add 500 billion dollars to a company's market cap then you're at Zuckerberg levels of delusion regarding the broad appeal of VR", "score": 1, "replies": [{"body": "The broad appeal is successfully being built. A social media company with a biscuit for a CEO failing with a product like this is no surprise", "score": 0, "replies": []}, {"body": ">500 billion dollars\n\nif just saying AI can add millions or billions of market cap¿!¿\n\nwhy not iGoggles¿!¿\n\nhttps://preview.redd.it/y6945dmn4q9b1.jpeg?width=600&format=pjpg&auto=webp&s=c41458212c7497f5d8137020821e4de143c447c0", "score": 1, "replies": []}]}, {"body": "Wait a sec. The squeeze has not happened yet?", "score": 1, "replies": [{"body": "Was waiting for this lol, not at all \nIt’s been a slow, strong and steady climb. We gonna see 5-20 % up in a day/s", "score": 0, "replies": []}]}, {"body": "Heard you can watch porn hub on it... I'm all fucking in. Fu cking jacked! Tits on swole....", "score": 1, "replies": []}, {"body": "I love how there being high call option volume means it's going to take off... That's the part that gets me super hard... Puts.\n\nIf share holders are writing a shitton of calls it's because they know their shares are safe within the lifetime of that contract.\n\nI haven't looked but I bet there's something like 2x-ish as many calls being written as puts on Apple because it's hit an all-time high and is due for a bit of a fall.", "score": 1, "replies": []}, {"body": "Does this logic make $meta a short?", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "Love Apple. Love their products. I’m grateful they exist. One day maybe, but today I say No. A 2 hour battery life is the reason.", "score": 1, "replies": [{"body": "Enovix | $ENVX \\-  of course I'd say that because I'm invested long...", "score": 1, "replies": []}]}, {"body": "They are at 3T you are fckin high", "score": 1, "replies": []}, {"body": "what's happening to people, lol", "score": 1, "replies": []}, {"body": "The current short float of AAPL listed on Finviz is .77%. Not really much to base a squeeze on.", "score": 1, "replies": []}]}
{"title": "“US Factory Sector Continues Contraction for Eighth Straight Month, Raising Concerns of Impending Recession", "selftext": "The latest report on the US factory sector reveals a persistent slowdown throughout June, as the overall index remained in contraction territory for the eighth consecutive month. Among the details, only four out of eighteen industries experienced growth during this period. The economy is now below its pre-pandemic high, leaving little room to deny the evident slowdown.\n\nOur analysis leads us to maintain our belief that a recession is looming, with today’s report emphasizing that the goods sector of the economy is likely to be the leading contributor. Respondents of the survey in June expressed concerns about the deceleration of the US economy and more importantly, anticipated reduced demand from customers. \n\nNew orders index also remained in contraction territory for the tenth month in a row. Similarly, the production index fell back into contraction territory in June.\n\nConsumers have been shifting their preferences away from goods and toward services, further exacerbating the situation. \n\nThe combination of decreased consumer demand and accumulated inventories at retailers indicates that factory output is likely to remain sluggish. There is some positive news, as factories have managed to catch up on order backlogs due to fewer new orders and improvements in supply chains. However, the backlogs index, although showing a slight increase in June, remains near the lowest readings since the 2008 Financial Crisis.\n\nUnfortunately, the slowdown in orders and the reduction in backlogs have started to impact employment, as reflected in the employment index falling back into contraction at 48.1 in June. On the inflation front, the prices index witnessed a decline to 41.8 in June, marking the second consecutive decrease after a recent upward trend.\n\nIn conclusion, the latest report on the US factory sector presents a worrisome picture of a persistent slowdown and contraction in June. With the overall index remaining in contraction territory for the eighth consecutive month and only a few industries showing growth, it becomes increasingly difficult to deny the evident slowdown. This analysis strongly supports the belief that a recession may be on the horizon, with the goods sector likely to be the primary contributor. Respondents’ concerns about the deceleration of the US economy and anticipated reduced customer demand further emphasize this outlook.\n\nOrder backlogs, which have slightly improved due to fewer new orders and supply chain enhancements, they remain near their lowest levels since the 2008 Financial Crisis.\n\nRegrettably, the impact on employment is becoming apparent, as reflected in the employment index falling back into contraction. Furthermore, the decline in the prices index suggests a possible easing of inflationary pressures.\n\nTaken together, these findings paint a challenging landscape for the US economy. The accumulation of inventories and reduced consumer demand are likely to keep output sluggish in the coming months. Vigilance and proactive measures will be essential to navigate these economic headwinds and mitigate the potential impact on various sectors of the economy.", "id": "14pq5c9", "created_utc": 1688407301.0, "score": 20, "upvote_ratio": 0.63, "num_comments": 85, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|5|**First Seen In WSB**|1 week ago\n**Total Comments**|77|**Previous Best DD**|\n**Account Age**|1 week|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n>TL;DR: The US factory sector is in contraction, with only four out of eighteen industries growing. This slowdown is expected to impact employment and inflation.", "score": 1, "replies": []}, {"body": "TLDR; OP is so regarded he thinks spamming the same shit graph almost everywhere in the thread makes him right.", "score": 31, "replies": []}, {"body": "This along with the deepest yield inversion in over 40 years should Make the bool stop and think, but it wont", "score": 4, "replies": []}, {"body": "So this is a straight up lie? These are not 8 straight months. Looks like two.\n\nhttps://preview.redd.it/y09d2p0fjs9b1.png?width=764&format=png&auto=webp&s=cd49b69da876d4266b3a55275b2bb651223d4e6f", "score": 11, "replies": [{"body": "I don't know what issue this other dude has with sourcing primary references, but here's the chart straight from ISM, in PDF form:\n\nhttps://www.ismworld.org/globalassets/pub/research-and-surveys/rob/pmi/rob202307pmi.pdf\n\nHere's the text article if that somehow doesn't work:\n\nhttps://www.ismworld.org/supply-management-news-and-reports/reports/ism-report-on-business/pmi/june/", "score": 7, "replies": []}, {"body": "I said: the overall index remaining in contraction territory for the eighth month in a row.\n\nhttps://preview.redd.it/j1hme7epos9b1.jpeg?width=1170&format=pjpg&auto=webp&s=926d5e0f68644cb6379c98c076f01abaa4f98af5", "score": 4, "replies": [{"body": "Dude.\n\n>These are not 8 straight months.\n\nLook at f\\*king April. Also this is the manufacturing one holy sh\\*t.", "score": 9, "replies": [{"body": "Understanding the index would be the first step before making a comment like this. 8 straight months of contraction means 8 months of the index below 50. An index value below 50 means the sector is contracting.", "score": 3, "replies": []}, {"body": "Rofl", "score": 0, "replies": []}, {"body": "[deleted]", "score": -3, "replies": [{"body": "Its giving https://forum.bodybuilding.com/showthread.php?t=107926751", "score": 5, "replies": []}]}]}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "You literally linked the PMI below you regard.\n\nActually maximum regard:\n\n>The ISM manufacturing index, also known as the purchasing managers' index (PMI), is a monthly indicator of U.S. economic activity based on a survey of purchasing managers at more than 300 manufacturing firms.\n\n[https://www.investopedia.com/terms/i/ism-mfg.asp](https://www.investopedia.com/terms/i/ism-mfg.asp)\n\nYou literally link wrong and old data to mislead people.", "score": 9, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Extremely regarded actually. ISM is the institution Institute of Supply Management which releases the index which in turn is the PMI index. Look at your own picture it says PMI regard.", "score": 9, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "That's what I said yes. Now explain why you linked old data and said it went down for 8 months in a row. I'm listening!", "score": 7, "replies": [{"body": "this data came out today, first of all.", "score": -4, "replies": [{"body": "I linked you the data. You linked not todays data.", "score": 5, "replies": [{"body": "please check again.\n\nhttps://preview.redd.it/jk2lxoexns9b1.jpeg?width=1170&format=pjpg&auto=webp&s=36152722ad016cd0666c23997ca688e32f47a51f", "score": 1, "replies": [{"body": "I'm taking crazy pills.\n\nWHAT IS THAT IN APRIL?!?!?! IT WENT UP UP UP UP UP UP UP!\n\nYOUR GRAPH YOU LINKED SAYS CLEARLY COMPOSITE WHICH THIS ONE ISN'T", "score": 1, "replies": [{"body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "I SAID IT WAS IN CONTRACTION 8 STRAIGHT MONTHS RIETARD. CONTRACTION, NOT UP OR DOWN. WHO CARES IF ITS UP OR DOWN????", "score": 2, "replies": [{"body": "You're actually regarded as a freaking stone. That's literally what those words mean. Down for 8 straight months.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": -1, "replies": []}]}]}]}]}, {"body": "you’re looking at the wrong index.\n\nhttps://preview.redd.it/j3jghc5sos9b1.jpeg?width=1170&format=pjpg&auto=webp&s=edbaf092115237786c19973c29ce9513af5a7c80", "score": 1, "replies": []}]}]}]}, {"body": "A lot of retail CEOs have warned of slowing consumer spending, Lisa Su and Andrew Jassy warned of a bad quarter ahead, a lot of trustworthy analysts have warned of margin compression and unrealistic EPS expectations - bulls are just deaf. Gonna be a fun earnings seasons starting next week.", "score": 5, "replies": []}, {"body": "Impending recession because this has been going on for eight months.", "score": 5, "replies": [{"body": "we have been in contraction for eight months.", "score": 1, "replies": [{"body": "So what? First of all, we are a service based economy, so ISM Services means more to the overall economy. Second, contraction doesn't necessarily mean decline, and even if it does, when? We also have unemployment below 4%. Bottom line, there's no substantial evidence to definitely say we are in the bad times.", "score": 1, "replies": [{"body": "So what just ignore economics that have shown this is a time to buckle down and just recklessly spend cuz if that is happening that is scary and can effect me so o don’t want that to be happening so it isn’t", "score": 2, "replies": []}, {"body": "It’s important to consider various factors to gain a comprehensive understanding of the economy.\n\nClaims have been steadily rising for a while and the unemployment rate is showing signs of deteriorating. It’s also essential to recognize that sustained slowdown in manufacturing can have wider implications. The manufacturing industry affects employment, supply chains, and various other sectors. Thus, monitoring the state of the factory sector is crucial in assessing the overall economic health.\n\nThe 8 consecutive months of contraction and reduced customer demand also raise concerns. Economic indicators help us identify challenges faced by the manufacturing industry, which can have a broader impact.\n\nI am happy to discuss the other most recent economic data with you and how everything as a whole is showing a slow down. This is just this weeks data and I like to keep everyone knowledgeable because as mentioned it’s not always easy for the average regard or WSB user to parse through the data.", "score": 1, "replies": []}]}, {"body": "Lol we started a recession in quarter two of 2022 when the two negative gdp people only say the 08 crash cuz that’s when Lehman happened the downfall started as early as 06.- started breaking in December of 07 and broke in September of 08 and carried into 09 with lingering effect till 2011 but all in all it was a 3 year process… we literally had banks fail bigger than Lehman and we still deny we are in a recession? It’s mind boggling people are just going more and more in debt", "score": 1, "replies": []}, {"body": " No we haven’t. That’s the point people are trying to get across to you.", "score": -1, "replies": [{"body": "so. to be clear. you are disputing facts? okay. bye.", "score": 1, "replies": [{"body": "You’re the one who has been posting the incorrect charts, and can’t handle being told that you’re wrong.", "score": 0, "replies": [{"body": "what incorrect charts? you’re dumb.", "score": 1, "replies": [{"body": "Dude literally EVERY SINGLE CHART that you’ve posted in this thread has been wrong/or a poor interpretation by you. And people have responded, posting the *correct* charts even though you still insist they aren’t. Get outta here man", "score": 1, "replies": [{"body": "you don’t understand what you’re talking about. post a screenshot of what you’re saying.", "score": 4, "replies": []}, {"body": "you read a guys comments and he deleted all of them after i corrected him and you’re trying to say i’m posting “incorrect charts” why don’t you learn something and read the article i wrote.", "score": 0, "replies": [{"body": "Nah I’m good. You’ve proven yourself to be an utter regard and you know what, that’s a-okay!", "score": 2, "replies": [{"body": "lol. loser.", "score": 2, "replies": [{"body": "Dude literally every single retort you’ve made has been downvoted to all hell. Take a hint.", "score": 0, "replies": [{"body": "that doesn’t matter to me. in my opinion the people doing that bought the market at the top and they’re pissed. probably bought AAPL on Friday and Nvidia after April. \n\ni know what i’m talking about. people who are serious about becoming someone on Wall Street, those who see the value and want to be able to understand data as it comes out and be able to parse through it with an all encompassing idea of what that data is saying. i’m here for them, and they’re the minority in this community of rietards.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Found the bear ![img](emote|t5_2th52|4271)", "score": 3, "replies": []}, {"body": "People in here can smell when you try and push your political agenda. Money talks here. Bullshit walks.", "score": 1, "replies": []}, {"body": "Photo for your reference:\n\nhttps://preview.redd.it/29v5v4auhs9b1.jpeg?width=1028&format=pjpg&auto=webp&s=9d44c01f3107c89d6cd83fd9cd985bf1693aa5e4\n\nWe are now below pandemic levels.", "score": 1, "replies": [{"body": "Hä?! What the heck? You talk about factories in the post and then you link the PMI composite which is literally above 50. Are you just regarded or intentionally lying?\n\n[https://tradingeconomics.com/united-states/composite-pmi](https://tradingeconomics.com/united-states/composite-pmi)", "score": 6, "replies": [{"body": "This chart represents the ISM Manufacturing Index", "score": 0, "replies": [{"body": "ISM and PMI are the same thing. How can someone this regarded post old data and talk about macro economics ![img](emote|t5_2th52|31226) \n\nISM stands for Institute of Supply Management which is the institution releasing the information.", "score": 4, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "No! The PMI composite is including services. If you talk about factories it's about manufacturing. PMI Manufacturing + PMI Services = PMI Composite. You're actually 100% wrong on every front.", "score": 3, "replies": [{"body": "PMI is an index that combines both the manufacturing and services sectors. A decline in the PMI composite would indicate a contraction in overall economic activity, considering both manufacturing and services.", "score": 0, "replies": [{"body": "The PMI composite is above 50 (which I linked you) which using your own graphic means expansion.", "score": 3, "replies": []}]}]}]}]}]}, {"body": "I literally counted OP posting PMI manufacturing five times and you posting PMI composite once and linking it once. It might be you are arguing with yourself. :)", "score": 1, "replies": [{"body": "I'm surrounded by the blind and regarded\n\nhttps://preview.redd.it/z52eiamva0ab1.png?width=731&format=png&auto=webp&s=f3a72861304d647948189ade458a55983ce76a56", "score": 2, "replies": [{"body": "Yes, that's a mistake. The graph itself is PMI industrial, not composite. But I suppose it's just an irrelevant mistake. OP was talking about manufacturing all the way. Or am I wrong? )", "score": 1, "replies": [{"body": "It's not a mistake. OP linked here an old composite index because the actual composite index is not below 50 and also posted the manufacturing everywhere. He posted both. Either he's intentionally misleading people or he actually has zero clue what he's talking about and assumed it's the same because OP refers to both being the same and doesn't acknowledge that he posted months old composite data.", "score": 1, "replies": [{"body": "Well, this source ([https://www.ftportfolios.com/Commentary/EconomicResearch/2023/7/3/the-ism-manufacturing-index-declined-to-46.0-in-june](https://www.ftportfolios.com/Commentary/EconomicResearch/2023/7/3/the-ism-manufacturing-index-declined-to-46.0-in-june)), which seems to be the origin of the graph also in text refers to it as \"ISM Manufacturing Index\". Why the graph has also indication of \"composite\" is beyond me, but this is the ISM manufacturing index as far as I can tell.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Ty for photo", "score": 0, "replies": []}, {"body": "Only upside form here", "score": -2, "replies": []}, {"body": "Why did it go down in 2018?\n\nOh right...", "score": -2, "replies": []}, {"body": "It is definitely [https://tradingeconomics.com/united-states/manufacturing-pmi](https://tradingeconomics.com/united-states/manufacturing-pmi) :)\n\nAnd not [https://tradingeconomics.com/united-states/composite-pmi](https://tradingeconomics.com/united-states/composite-pmi)\n\n&#x200B;\n\n&#x200B;\n\nAnyways, thank you for the post. :)", "score": 1, "replies": [{"body": "https://preview.redd.it/569yftu2zx9b1.jpeg?width=1170&format=pjpg&auto=webp&s=16f5268b706e40004285ce394d77bc42d49b3900\n\n:)", "score": 0, "replies": []}]}]}, {"body": "The student loan forgiveness strikeout\t will steepen the curve hard", "score": 1, "replies": []}, {"body": ">Vigilance and proactive measures will be essential to navigate these  economic headwinds and mitigate the potential impact on various sectors  of the economy.\n\nJesus fucking christ.", "score": 1, "replies": []}, {"body": "Its bullish until they say the bull market is back on.![img](emote|t5_2th52|4271)", "score": 1, "replies": [{"body": "“The S&P 500 is in a bull market.” - AP News\n\nhttps://apnews.com/article/bull-stock-market-wall-street-cde5d042da6aa887e7d5ba64b62815ff", "score": 3, "replies": []}]}, {"body": "Well well well, if it isn't the expected result of the last 18 months of monetary policy. I'm shook!", "score": 1, "replies": [{"body": "That's kinda what I was thinking. Don't know anything about anything but isn't that the whole idea of the rate hikes? To slow everything down, reduce growth a bit, and curb inflation?", "score": 2, "replies": []}]}, {"body": "This is extremely bullish", "score": 1, "replies": []}, {"body": ">I completely agree with the analysis presented in this report. The US economy is definitely slowing down and a recession is likely on the horizon. This will impact various sectors of the economy, so it is important to be vigilant and take proactive measures to mitigate any potential damage.", "score": 0, "replies": [{"body": "I swear I've been reading this exact same comment for like 2 years now. I think they are trying to prevent it from happening as long as possible. Because they know that we are going to take all of their recession stimulus money and buy tons of stock in these companies at their lowest point.\n\nThose mfs don't wanna share.", "score": 5, "replies": []}, {"body": "https://preview.redd.it/3su5p08gos9b1.jpeg?width=1170&format=pjpg&auto=webp&s=7d52ea0393bd6d731b34c1d36a529dcf963eb510", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "you don’t know how to read economic data that was released today or in the past months. nor do you know anything about economics.", "score": 3, "replies": []}]}, {"body": "It’s a fucking bull market until q3 2024. Fuck the media bullshit in the ass/pussy, whatever your preference. Unless you like to get fucked in the ass by a 12 inch bull. A girl I know only talks about big dick after her bf left her ass.", "score": -1, "replies": []}, {"body": "It’s going to lead layoffs", "score": 0, "replies": [{"body": "Well, if layoffs happen the the unemployment rate goes up. That’s all Powell needs to stop raising the rates. Of course the market will go up with no rate hikes", "score": 1, "replies": [{"body": "Too much debt out there, tightened lending standards and student loan repayments = crimp markets", "score": 0, "replies": [{"body": "We always had debt and student loans", "score": 1, "replies": [{"body": "We had debt and loans with incredibly low borrowing costs due to 10-15 years of ZIRP and QE. Now it is way more expensive to borrow due to higher rates. Trillions in corporate debt will mature the next year or two and have to be rolled over to much higher rates. That or businesses will go bankrupt or curtail spending and hiring. Commercial real estate has the same problem. Trillions will have to be refinanced soon at much higher rates.", "score": 2, "replies": []}, {"body": "Cognitive dissonance", "score": 1, "replies": []}]}]}]}]}, {"body": "US is mostly an information service economy. No? Manufacturing is for the peasants. Or China or whatever", "score": -2, "replies": []}, {"body": "Lol.  Impending recession? We are already in one.  Just because the powers that be tried to change the definition doesn't mean we aren't in fact already in one.", "score": -7, "replies": [{"body": "You feeling like you are in a recession doesn’t make it a recession. We’ve been using the same metrics for decades. 2% GDP is not a recession.", "score": 8, "replies": []}]}]}
{"title": "FT BREAKING: China hits back with export curbs on chip making materials", "selftext": "China is the world’s leading producer of gallium and germanium, making any reduction in its output a significant concern for the global tech industry. \nChipmaking materials are distributed globally, the control over production and supply chains can have significant implications. China’s dominance in the production of certain metals used in chipmaking, such as gallium and germanium, can impact global supply and pricing (Impacting inflation). \n\nThe geopolitical dynamics surrounding trade restrictions and export controls can affect the availability of these materials. Limited availability of these metals is likely to slow down production or result in increased prices for manufacturers and their clients in the technology, telecommunications, energy, and automotive sectors. As gallium and germanium are alternatives to traditional silicon wafers in specialized applications, their scarcity could disrupt the supply chain, impacting the production capabilities of companies reliant on these materials.\n\nGallium and germanium are among dozens of minerals classified by the US government as critical to economic and national security. The US state department did not immediately respond to a request for comment.\n\nAccording to officials and experts in China, Beijing is expected to introduce further retaliatory measures in response to the expansion of US-led controls on technology exports.\n\n“There will be more retaliatory measures against the snowballing semiconductor export controls from western countries,” said one senior official close to the Chinese commerce ministry.\n\nConsidering Nvidia is expected to hit 11B+ in revenue for the next quarter, going from 7billion to 11billion considering their already complicated supply chain issues and this is only going to worsen the issue and make it harder for them to meet that expectation. \n\nNvidia is now “priced for perfection.” The bears can point to pretty much any risk and have a valid point. as a dominant player in the semiconductor industry, Nvidia is far from immune to the potential consequences of China’s export curbs. The company’s market cap of $1 trillion is largely based on its leadership in AI Chips. Nvidia could face significant challenges in maintaining its market dominance and growth trajectory.\n\nThe restrictions could impede the company’s access to critical components and hinder its ability to supply AI chips to the Chinese market, which is a major consumer of these technologies. Such restrictions would not only impact Nvidia’s revenue but also create an opportunity for competitors to gain market share in China and beyond.\n\nKim Yang-paeng, a researcher at the Korea Institute for Industrial Economics and Trade, said the restrictions were “worrisome” for South Korean chipmakers.\n\n“Korean companies can find alternative sources, but it will take some time . . . if you lack some materials, no matter how important they are, this could hit chip production,” he said.\n\nBased on historical precedents, supply chain disruptions and export curbs have often resulted in market volatility and reduced investor confidence. If Nvidia faces difficulties in sourcing essential materials and encounters restrictions on selling AI chips to China, it could face a decline in market capitalization. The loss of Chinese customers alone, given their significant demand for AI chips, could have a substantial impact on Nvidia’s revenue and market value. Additionally, heightened geopolitical tensions may deter investors and hinder Nvidia’s expansion plans, further eroding its market cap.\n\nChina’s export curbs on gallium and germanium, along with the potential limitations on AI chip exports, pose a serious threat to Nvidia’s ability to maintain its $1 trillion market cap. The disruption to the global supply chain, which was just starting to recover. The tech sector in particular, and the uncertainty surrounding future market dynamics could undermine Nvidia’s growth and market dominance.\n\nThe recent move by China to impose export restrictions on gallium and germanium, essential metals used in chipmaking and communications equipment, has intensified the geopolitical tensions between China and the United States. These measures, aimed at safeguarding national security and interests, signify a retaliatory response to the semiconductor restrictions imposed by the US. While China’s actions may have short-term implications for Chinese manufacturers, the long-term consequences will undermine Nvidia’s ability to maintain its $1 trillion market cap.\n\nSource: https://www.ft.com/content/6dca353c-70d8-4d38-a368-b342a6450d95 [Financial Times]\n\nSource: China’s metal export curbs reverberate across Asia’s chip sector https://on.ft.com/43947NW [Financial Times]", "id": "14py14h", "created_utc": 1688425778.0, "score": 71, "upvote_ratio": 0.86, "num_comments": 82, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|8|**First Seen In WSB**|1 week ago\n**Total Comments**|113|**Previous Best DD**|\n**Account Age**|1 week|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Like your gf.wont give you something you like , you just need to get things done in an more expensive way", "score": 33, "replies": [{"body": "You just need a hand.", "score": 5, "replies": []}]}, {"body": "The metals aren’t particularly rare or difficult to find, both metals are byproducts from processing other commodities such as coal and bauxite. Why bother reading about export licensing proposals for unrefined gallium/germanium exports when you can just proclaim that semiconductors will take a hit?", "score": 28, "replies": [{"body": "Building a new mine in a country like Australia takes time. So this bearish. I don’t think the problem will be for chip makers. It will be for things like car batteries that use these metals. With a chip the metal is not what you are paying for.\n\nAll the same I wish China and the USA could show each other respect and stop this.  But, China sees this as a “battle” they must “win”! Look at the title “hits back”\n\nYou dont win a trade war at best lose less than the other guy. \n\nWho is getting hurt less the “west” with inflation or China with it obviously hiding its growth numbers. Whatever Chinas actual numbers are it is not the 7%  gdp gains it had for 40 the freaking years China was a friend of the “west”", "score": 5, "replies": []}, {"body": "wrong. \n\nhttps://pubs.usgs.gov/periodicals/mcs2023/mcs2023-gallium.pdf", "score": -9, "replies": [{"body": "So according to this [article](https://www.bloomberg.com/news/articles/2023-07-03/china-to-restrict-exports-of-metals-critical-to-chip-production) this will end up with higher prices but allow others to fill the gap ending China's dominance of the market on them.\n\n“When they stop suppressing the price, it suddenly becomes more viable to extract these metals in the West, then China again has an own-goal,” said Christopher Ecclestone, principle at Hallgarten & Co. “For a short while they get a higher price, but then China’s market dominance gets lost - the same thing has happened before in other things like antimony, tungsten and rare earths.”", "score": 10, "replies": [{"body": "China owns the entire market.\n\nhttps://preview.redd.it/6btrxl7gnv9b1.jpeg?width=1170&format=pjpg&auto=webp&s=d85b5cab0e5c7be970e8cda7ac8c534c93489cc6", "score": -17, "replies": [{"body": "Did you read my comment? They won’t “own” the market for much longer.\n\nhttps://www.bloomberg.com/news/articles/2023-07-03/china-to-restrict-exports-of-metals-critical-to-chip-production", "score": 12, "replies": [{"body": "This stock is priced for perfect conditions. This is a setback and needs to be evaluated. It’s a cyclical stock in a slowing economy, etc etc etc \n\nadd to that this and the US and Europe recent restrictions.", "score": -9, "replies": [{"body": "The Chinese have weaponized their dominance not just in rare earths supply chain but in others as well, for example a Senkaku Islands dispute in 2010 where they restricted rare earths to Japan, for some really asinine and emotional reasons restricting all sorts of trade between them and Australia, Lithuania and various others in recent years, and between them and the US on solar cells about ten years ago which is ongoing and which the WTO ruled in favor of the US on last year.\n\nThere are a lot of other examples where the Chinese have done this. The problem is that it is producing results that are unfavorable to the Chinese in every single one of these examples. In 2010, Japan imported 82% of its rare earth materials from China. This dependence was reduced to 58% in 2019, with the target of less than 50% in 2025. Right now, the US imports 80% of its rare earths from China, but in 5 years it will be less and in 10 years dramatically less because the US is opening its mines back up. Up until 1985, the US was the largest producer of rare earths. Those have since closed down due to the convenience of getting them from China but all of that is changing rapidly. Legislation is being passed that will restrict Chinese rare earths from government and military production.\n\nWhat Chinese have not realized is that weaponizing their dominance in certain sectors makes people want to stop dealing with Chinese anymore in those sectors. In the solar cell example, Chinese were using their access to cheap and readily mined coal without any regard for the environment to drive down costs on those cells and then dumping the market, putting many producers globally out of business. All in a loud and clear eff you to the WTO which had bent over backwards to shoehorn them in. What producers started doing in response is making low carbon solar cells to make them easier to make and with the help of governments (US and EU) passing laws requiring lower carbon cells, as well as tariffs on Chinese cells, which the WTO agreed with.\n\nThe Chinese seem to be under the mistaken impression that there are no consequences to this sort of behavior. Decoupling is happening and US investment in China is tapering off. You can add security concerns and the desire to be in a stronger position in relation to China when they attack their neighbors, engage in massive scale human rights abuses and collude with others engaged in war crimes to the list of other reasons.\n\nFinally, the US is currently building stockpiles of rare earths to fill in until the mines come back online.", "score": 9, "replies": [{"body": "At that time, Japan sued China at the WTO, which led to China's relaxation of restrictions.\n\nBut now the WTO mechanism has been destroyed by the United States, and the alliance formed by the United States has imposed various trade restrictions on China,\n\nThe WTO arbitration mechanism is now defunct.", "score": 1, "replies": []}, {"body": "US starts weaponize industry first", "score": -2, "replies": [{"body": "When do you believe the US first started?", "score": 0, "replies": [{"body": "Can't all kind of measures taken by the US to directly harm Chinese semiconductors industry lately be taken as weaponising?", "score": 1, "replies": [{"body": "Yes, but this started long ago (roughly a decade), between Japan and China", "score": 1, "replies": []}]}]}]}, {"body": "The US has 0 reserves", "score": -10, "replies": [{"body": "According to the US Geological Survey, it does.\n\nhttps://www.usgs.gov/news/technical-announcement/usgs-updates-mineral-database-gallium-deposits-united-states\n\nhttps://www.usgs.gov/data/germanium-deposits-united-states", "score": 10, "replies": [{"body": "Having 2 places that you can start mining it is not the same as having a stockpile of it in ready-to-use form, unfortunately.", "score": 4, "replies": []}]}]}]}, {"body": "> This stock is priced for perfect conditions.\n\nThe stock is priced according to the principles of the market efficiency theory. The price is perfect with all available information currently known to the market.", "score": 1, "replies": []}, {"body": "Bagholder spotted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}]}, {"body": "Time for TMC calls!  It’s in the ocean, bro!", "score": 1, "replies": [{"body": ">TMC\n\nPLUS they picked islands that were mine raped, so now that the mines are pretty much closed and bankrupt...think of how many GD kilos of precious metals they dropped off the coast. TMC is gonna set the foundation for metal mining. They'll pave the way for asteroid mining in the next 5-10 years I bet", "score": 1, "replies": []}]}, {"body": "![img](emote|t5_2th52|4271)", "score": 0, "replies": []}]}]}, {"body": "Oh yisssss China trade war 10.0 ![img](emote|t5_2th52|18632)", "score": 6, "replies": []}, {"body": "Inb4 new 500B nation security of strategic minerals/rare earth metal protection bill introduced at the floor of congress. 70% goes to Intel/IBM/Apple/Microsoft/Broadcom/Qualcom and 29% goes to politicians ~~pet~~ constructive projects and 1% goes to actual mineral/rare earth mining (all of that 1% goes to pay for the bureaucratic legal paperwork system). Then they'll cry not enough and provide an additional 500B bill. See it's not a 1T bill it's absolutely fiscally responsible ![img](emote|t5_2th52|4271)", "score": 9, "replies": []}, {"body": "Ahhh so market makers pushing for people to load up on puts now so that they can keep the stock elevated or even pump it some more. Not falling for it.  NEXT.", "score": 15, "replies": [{"body": "Are you regarded?", "score": 13, "replies": []}, {"body": "It’s important to approach market dynamics with a critical eye. While market makers have a role in trading, it’s not realistic to think they have control over what China does. Stock prices are influenced by many factors, it’s incorrect to assume market makers are deliberately pushing people to buy put options just to manipulate prices in response to China’s actions.", "score": 8, "replies": [{"body": "Are you trying to say this is not a conspiracy to get me to sell my Tupperware shares for cheap? ![img](emote|t5_2th52|12787)", "score": 12, "replies": []}, {"body": "Just took me regard glasses off and… your response look ai 😂🤦‍♂️", "score": 4, "replies": [{"body": "Reads about the same as Visual Mod’s responses.", "score": 2, "replies": []}]}]}, {"body": "You are thinking too small. MMs have likely cornered the physical market for gallium and germanium already.", "score": 1, "replies": []}]}, {"body": "What's stopping western producers from stepping up to fill the void soon? Sure it maybe more expensive to manufacture/start ramping up production in western countries. \n\nDoes china really want the US and other semiconductor manufacturers to stop relying on it especially when it comes to these 2 metals?", "score": 6, "replies": [{"body": "Its not that us cannot produce gallium or germanium..they are not even particularly rare but dependency on china is by design…first of all us mining companies cannot compete with chinese companies mainly because of low skilled labor cost difference. Secondly mining creates all kind of environmental issues and pollution..every country has limited resources..ask yourself, would you rather want your country to have low skilled laborous mining jobs or high skilled white collar semiconductor and tech jobs?", "score": 8, "replies": []}, {"body": "Supply chain hasn’t been restructured yet. US has deposits of these minerals but hasn’t setup operations to mine it on a large scale, that takes time. Russia and Ukraine are the next big sources next to China but good luck with that. This is really happening, it isn’t fud to manipulate the market and tech is going to get hit hard by it, not just NVDA", "score": 6, "replies": [{"body": "I know its not fud to manipulate I think this announcement will give enough time for the US to stock up on the materials needed and give a headstart to ramp up production.  with all the manufacturing Biden is focused on he could simply start giving out incentives again just like the chips bill.", "score": 1, "replies": []}]}, {"body": "they can’t “step up and fill the void”\n\nDomestic primary gallium production in the United States has not occurred since 1987. However, gallium is imported into the United States for consumption.\n\nChina has the entire market:\n\nhttps://preview.redd.it/0his7l4eou9b1.jpeg?width=1170&format=pjpg&auto=webp&s=7705bad07d3a3a9e3bd7b61f964ff9048f4460cc", "score": 1, "replies": []}, {"body": "China： You force me do that.", "score": 1, "replies": [{"body": "Well, in a way that's true. It was a retaliatory measure.", "score": 1, "replies": []}]}, {"body": "> What's stopping western producers from stepping up to fill the void soon?\n\nlack of demand. As long as it is not a problem to buy GaN charger from china, nobody would buy more expensive Ga to make more expensive chargers", "score": 1, "replies": []}]}, {"body": "Here’s some related info:\n\nhttps://pubs.usgs.gov/periodicals/mcs2023/mcs2023-gallium.pdf", "score": 4, "replies": [{"body": "Am i regarded or does that article says china produces 98% of the gallium in the world and us produces almost none? If true, holyfuck.", "score": 5, "replies": [{"body": "98.2%!  Russia is 0.9%.  Meaning 99.1% achievement unlocked!", "score": 6, "replies": [{"body": "And Ukraine is the third largest producer at like 0.5%and produces it in Russian controlled regions ☠️", "score": 8, "replies": [{"body": "This could get messy.", "score": 2, "replies": [{"body": "Why did it take the Chinese and Russians so long to use this?", "score": 3, "replies": [{"body": "Because China mainland doesn’t make most of the GaAs/GaN silicon wafers (they do make some though).  Will they sanction Taiwan?  🤷  Probably not.  So on the surface it’s kind of symbolic, but the potential for unintended consequences is particularly high with control of 99.6% of current supply.", "score": 2, "replies": []}]}, {"body": "Did you finally figure out the purpose of this war? Lol", "score": 2, "replies": []}]}]}]}, {"body": "https://preview.redd.it/le1euvmrlu9b1.jpeg?width=1170&format=pjpg&auto=webp&s=e6b602810b8d67347d07e50fd30f34d8804f7813\n\nIt’s true.", "score": 1, "replies": []}]}]}, {"body": ">I agree that China's export restrictions on gallium and germanium could have a negative impact on Nvidia's business. However, I believe that the company is still in a strong position to weather this storm. Given its dominant market share and technological expertise, I think Nvidia will be able to find alternative sources of these materials or develop new technologies that do not rely on them. Consequently, while there may be some short-term challenges for the company, I believe it has the long-term potential to maintain its $1 trillion market cap.", "score": 4, "replies": []}, {"body": "Demand for chips isn't going anywhere.  They'll just hike prices to deal with the increased cost of goods", "score": 2, "replies": []}, {"body": "I mean just use another material to make it then", "score": 2, "replies": []}, {"body": "My background as microelectronic engineer shows the totally fake \"breaking news\" from today. Chip making materials are \"normally\" distributed on the earth, not like diamond mines as the public suppose. The Chinese government is playing muscle game, but without real power, like Russians in Ukraine. Rare metals are actually not rare - just visit Wikipedia and the Natural History Museum in London (see mineral part of the exhibition). Good reason to buy chipmaker, for a short game.", "score": 2, "replies": [{"body": "You express your opinion, your statement is not accurate. It is true that chipmaking materials are distributed globally, the control over production and supply chains can have significant implications. China’s dominance in the production of certain metals used in chipmaking, such as gallium and germanium, can impact global supply and pricing (exacerbating inflation). Additionally, the geopolitical dynamics surrounding trade restrictions and export controls can affect the availability of these materials.", "score": 1, "replies": [{"body": "Yes, it is not a black/white case, China has real advantages in some areas, I remember the story of the opium wars, some 200 years ago", "score": 2, "replies": []}, {"body": "They're still selling, just not to restricted countries. Think this through, what do you think happens. Think about Russian oil.", "score": 1, "replies": []}]}]}, {"body": "The six critical metals found/produced in Canada: copper; indium; selenium; tellurium; gallium; silver.\n\nYou're welcome", "score": 2, "replies": [{"body": "China has the entire market.\n\nhttps://preview.redd.it/v8gpaaxxbu9b1.jpeg?width=1170&format=pjpg&auto=webp&s=b0c0a773afaeb5a566ae0b7ba6edca6b74953032", "score": 6, "replies": []}]}, {"body": "In the blue corner…you have the freedom loving…war mongering...USofA\n\nIn the red corner…you have the ruthless…oppressive…scary dragon…China\n\n\niiiiiiiiiiiiiiiiiiitttttttttttttt’sssssss\n=\n\n\nTIIIIIIIIIIIIIIMMMMMMMMEEEE!\n=", "score": 0, "replies": []}, {"body": "OP belongs here, considering the alternative sources available and the massive threat to China's monopoly found earlier this year\n\nhttps://finance.yahoo.com/news/16-largest-silicon-producers-world-212541541.html\n\nhttps://www.dw.com/en/sweden-discovers-europes-largest-known-rare-earths-deposit/a-64365661", "score": 1, "replies": [{"body": "from your own article\n\nhttps://preview.redd.it/zyoatfjp5v9b1.jpeg?width=1170&format=pjpg&auto=webp&s=a83cdd230e1cfdb55eaf9389c23aaf95e4bf3f19", "score": 5, "replies": [{"body": "You think mines are built in a day? China is wrecked by 2025", "score": 2, "replies": [{"body": "China doesn’t need new mines. They are the worlds largest producer and also have the worlds largest production capacity of raw materials used in semiconductors.\n\nhttps://preview.redd.it/8lc2e2b56v9b1.jpeg?width=1170&format=pjpg&auto=webp&s=50e3ca4e84f4d3a9cf91b802b0a6c17f96396ef8", "score": 1, "replies": [{"body": "Your dumb as hell bruh, but good luck on your 'endeavors'", "score": 1, "replies": [{"body": "okay “bruh”", "score": 1, "replies": [{"body": "Short NVDA some more then, I'll pour one out for you when the FEDs pump it during their next \"QT\" phase.\n\nOr was it \"QE\"? Fuck if I know, and they don't either", "score": 4, "replies": []}]}]}]}]}]}]}, {"body": "So less money for China no problem", "score": 1, "replies": []}, {"body": "Wouldn't this work in the opposite way? If there's a shortage they can charge more making the stock go up.", "score": 0, "replies": []}, {"body": "Why does this post repeat so much? You got dementia and forgot you type stuff? I’m regarded as fuck and you keep making me read things I already read fuck you OP", "score": -1, "replies": []}, {"body": "Welp. So long Chy-na bois!", "score": 0, "replies": []}, {"body": "TLDR: He missed NVDA opportunity", "score": 0, "replies": []}, {"body": "Carbon Radium Phosphorous  makes what …?", "score": 1, "replies": []}, {"body": "https://archive.is/DmVT1", "score": 1, "replies": []}, {"body": "I don’t think AI is going to like this.", "score": 1, "replies": []}, {"body": "two options:\n\n1. The west will never recover. We're going to be moving coal and wood for our fireplaces by wheel barrow. Our children will never see the sun again. Or, Alternatively:\n\n2. The west will find other sources, likely cheaper.\n\nYou choose.", "score": 1, "replies": []}]}
