{"title": "Tale of the epic comeback…. Started with oil, ended with oil….", "selftext": "I started trading in September 2019, so almost four years ago. \nI began trading a little here and there just to get my feet wet… then got in over my head, got into leveraged etfs in oil. Well I lost it all in March 2020… \nI switched gears and invested in airlines, retail and crypto and quickly recovered, was scammed pretty bad a couple years later out of some crypto and switched gears back to oil… but at the same time kept a diversified exposure as I learned. \nLong story short I polished up my ability to trade options (spreads, selling covered calls and even got lucky on a Tesla strangle (all the talk of joining the s&p 500 timeframe))  made a few hundred bucks on the GameStop and bbby fiascos, nothing major but much needed bumps. \nI experienced all my recent gains from PLTR, PBR, and CRSP.  Mostly buying shares and selling covered calls (which also serves for an exit strategy when you hit acceptable gains) for steady income… and also collecting the hefty dividend in PBRs case. I still have exposure to crypto but limited. And I opened a traditional and Roth IRA.  Still growing and learning. \nI learned a hard lesson at the beginning, don’t use advanced trading strategies without a grasp of it. Granted it was an unprecedented time in march of 2020, but I used it to push myself to learn and get better and to prepare for market instability.\nStarted with oil and ended with oil, honestly is just a coincidence 🤷🏻", "id": "14owb47", "created_utc": 1688324752.0, "score": 257, "upvote_ratio": 0.94, "num_comments": 82, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|10 months ago\n**Total Comments**|89|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Most roads lead back home", "score": 79, "replies": [{"body": "I don’t know what roads you drive, but most of them do not lead me back home", "score": 37, "replies": [{"body": "Maybe he lives in Rome?", "score": 15, "replies": []}, {"body": "All roads lead back home though..?", "score": 5, "replies": []}, {"body": "The only acceptable road is Wendy’s. Everything else is a damn lie", "score": 10, "replies": []}, {"body": "Gotta do a U-turn first", "score": 2, "replies": []}]}, {"body": "Yes but probably about 80% of the degens here got taken away by liquidation before they ever got back home", "score": 3, "replies": []}]}, {"body": "You and Buffet", "score": 25, "replies": [{"body": "![img](emote|t5_2th52|27189)", "score": 5, "replies": []}, {"body": "that dude and his OXY 4 life", "score": 3, "replies": []}]}, {"body": "Crazy way to lose and gain 5k. Gonna be broke before you get to 20", "score": 19, "replies": [{"body": "Yeah it was definitely a wild ride… \nI’m already broke 😅 and I haven’t even hit 10 yet lol", "score": 5, "replies": [{"body": "Wait what..", "score": 4, "replies": [{"body": "He means 10k, not 10 y/o", "score": 3, "replies": [{"body": "His wife's BF knows otherwise ![img](emote|t5_2th52|4275)", "score": 1, "replies": []}]}, {"body": "I have bills, a kid, a mortgage.  A rental property….  I’m broke all the time 😅", "score": 2, "replies": [{"body": "That’s a lot of pressure for a 10 year old", "score": 10, "replies": []}, {"body": "Can’t be that broke with 5k to spare, I’m actually broke with two kids and an apartment with 4k in TDA with biweekly 30 dollar deposits, I should’ve sold that Doge when it hit 74 cents..", "score": 2, "replies": [{"body": "I have a job.  Im a union laborer. I mason tend.\nI work with bricklayers.\nHard work but I make decent money but i got bills.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Looks like my chart for the month of June\n\nhttps://preview.redd.it/qzm0zuvpgm9b1.jpeg?width=1195&format=pjpg&auto=webp&s=8459ff5f2f598fe58e44d721cdc9da0df3e3ba7a", "score": 12, "replies": [{"body": "Looks like mine from last week\n\nhttps://preview.redd.it/1rovpvtiir9b1.jpeg?width=1284&format=pjpg&auto=webp&s=fee3b30ff2fe6cbea03c67493ae38c7dfd88f6a7", "score": 2, "replies": []}]}, {"body": "Congratulations! I also have found success in oil. Are you buying anything going into Opec international conference next week?", "score": 5, "replies": [{"body": "Honestly no… I’m anticipating that OPEC will push an agenda aimed at propping up oil prices but for what I’m doing with Pbr it doesn’t much matter… unless there is a large disruption in the market… an oil “crash” so to speak….  I will hold Pbr and sell calls, adding and subtracting from my position as to capture the dividend and lock in gains occasionally, all the while sell calls with a strike price above underlying price and also if it were to rise, at a level that is acceptable to me, if the calls were to be exercised. \n\nI don’t think OPECs meeting will have a lasting effect until practical matters are affected.  I’m sure there will be a price reaction. But it will be short lived if the fundamentals don’t change or shift in a direction contrary to their agenda. \nFrom what I understand they want to cut supply as to lift the price of oil. Saudi Arabia prefers oil to sell near $80/barrel I believe….  As much power as they have, it’s hard to have complete control over such a vast industry. 🤷🏻", "score": 6, "replies": [{"body": "Interesting take. I also believe any short term jump in price will be short lived. And that’s a great idea to trade covered calls to generate income. I do the same thing with Energy Transfer and Enterprise Product partners stock options… premiums for otm options are just so low rn the return on capital is low.. generally since  oil has fallen so much I’m bullish on a eventual recovery longer term 2024 as China oil demand picks up. I’ve found I can get greater returns on capital by holding shares of UCO( 2x leveraged WTI) and selling covered calls against that investment while oil remains rangebound. I use optionsprofitcalcultor, and always looking for those good risk to reward opportunities with high probability of profit.. that make you money over time.. which can fund riskier trades… like this weeks opec July 7th USO weekly 3 DTE call spreads I’m opening when the market opens this Wednesday. A gamble on Opec reaffirming oil production cuts", "score": 2, "replies": [{"body": "Now that’s an idea… advanced for sure… I’ll have to take a look at that leveraged WTI.   I got burnt in 2020 on one… but I could try it out on a small scale", "score": 1, "replies": []}, {"body": "I’m a little curious exactly what you do with UCO?  Doesn’t it decay , inherently?  And what are the risks associated with it?", "score": 1, "replies": [{"body": "I don’t get why some people think buying risky ass oil ETF’s is somehow a better strategy than splitting that same money into Exxon, Chevron, and Oxy.", "score": 2, "replies": [{"body": "I’m kinda curious as well.   I initially got burnt on UWT and DWT.  You can see by photos complimenting this post…\nI’m just curious to how this leveraged etf would be better than what I’m doing with PBR.  🤷🏻", "score": 1, "replies": []}]}]}]}]}, {"body": "Still buying Shell", "score": 2, "replies": []}]}, {"body": "Oil, you always find a way to keep us entertained! Bravo!", "score": 6, "replies": []}, {"body": "i’ve been looking at PBR calls as well.", "score": 10, "replies": [{"body": "I bought the shares and sold covered calls and poached the ex dividend dates and used the calls as an exit strategy to reduce my position from 825 shares to 425, did this to lock in my gains.    Another ex dividend date is coming up in august sometime, I’m sure.  I’m trying to reduce my position to 125-250 shares before then.   Then snatch up a bunch before the dividend. Capture the dividend and it should rebound shortly after and sell calls to reduce my position again… 🤷🏻 don’t know if it’s a sound strategy but I hope it works", "score": 11, "replies": []}, {"body": "I'm a fan of that stock, def calls", "score": 4, "replies": []}]}, {"body": "No way PBR goes to 16. I've been invested in them for a bit myself. But I don't think they'll hit 16.", "score": 5, "replies": [{"body": "Yeah I’m not sure Pbr will go to 16 but all the better because that means I can sell calls with 16 strike price and they will expire worthless and I can pocket the premium… or buy it back at a lower price for a net gain before expiration. worse case scenario the price of Pbr goes above 16 and I am forced to sell 100 shares at $16,  which would lock in gains for me…", "score": 1, "replies": [{"body": "True, if they go above 16 I don't see it lasting for an extended period of time. Unfortunately PBR.A has been my most successful Investment so far, but one of my smallest. Wish I bought more when I first made the position years ago. I've covered my cost basis in dividends alone so if I sell my cost basis is $0.00. Pure profit.", "score": 2, "replies": []}]}]}, {"body": "TLDR. I saw PBR and I'm all in.", "score": 3, "replies": []}, {"body": "they're gonna eventually ban me from talkin about it here too but, RAD is about to be the biggest pharmacy in the world next 5-10 years. they just partnered with amazon last month and their amazon page looks like hefe bezos believes in them. so I do too and at that price I bought 2500 shares @ $1.50, I'm gonna keep buying and holding because I'm pretty sure this ones gonna be an infinite $ glitch lol", "score": 3, "replies": [{"body": "What makes you think this?  And why would you get banned?", "score": 1, "replies": [{"body": "because they're worth 1.50 at 85.21M market cap. So severely under priced, even if they were close to bankruptcy. which theyve had no talks of such. And I already got banned out of every other stock subreddit and discord for talkin about it. So its' obviously a conspiracy.", "score": 3, "replies": []}, {"body": "if we all bout the remaining 55M shares avail of RAD and held em hostage, I bet theyd value it for half of what its worth just to get us to sell.", "score": 3, "replies": []}, {"body": "Its had 60% or more options volume for as loong as u can look back, some days @ 90%. It's also the only stock that doesnt follow a covid curve. 3.20.20 they're up that day. It actually follows a meme stock curve if you look at the spikes closely. They've been pushing this stock down so bad that they want us all to hate it and forget about it when its time to go off", "score": 3, "replies": [{"body": "It’s weird that I don’t have an analyst ratings or research report… i usually get that with my Robinhood gold. \nSo what does all that mean? \n\nWhat’s your total position and average buy in?  \nIs it a meme stock?  Or it way past that? \nYou’re telling my that rite aid is only valued at roughly 87 million dollars?\n\nWhere does the conspiracy come into it?  For whom would that benefit?", "score": 1, "replies": [{"body": "If it has a market cap of 85M, think of what the earnings could be when in 5-10 years its market cap reflects what amazons today, which is $130 per @ 1.34T market cap. We can assume AMZN will only continue to grow as they're the largest retailer in the world. So if RAD continues in a trajectory similar to amazon, also being a pharmacy, there's no telling what it would be worth. And the reason I've been so criticized for talking about it, and for all institutions and websites saying to avoid it, should just show that its a conspiracy.  \n\n\nand if we go to believe its a conspiracy, then we kno the people behind the curtain love numbers. Numbers and their meaning. I personally hate the stuff, but \"they\" believe numerology is real. And It must be because it is tied into our language even. Plus its pretty obvious they control us with numbers.  \n\n\nthe market cap changed in the past couple days also, it went from 86.9M to 85.21M. Just look at the difference between what numberology says about the two numbers, \n\n86- The number 86 vibration loves organizing social events and mobilizing large groups of people. It gives an ability to be service-minded, loving, and to have strong self-control. It has an excellent aesthetic sense and goes into detail, as well as being able to see the overall picture. ([https://www.numerologistpro.com/numerology-numbers/numerology-number-86-meaning/](https://www.numerologistpro.com/numerology-numbers/numerology-number-86-meaning/))\n\n9-9 is the strongest and most masculine of all the numbers and gives inner strength, power, and the ability to focus one's energies. 9 resonates with the planet Mars also known as Ares. Mars was the Roman God of war and was strong physically and mentally. 9 is the number of the warrior and gives a strong will, determination, and independence in dealing with all aspects of life, always going for the essence of things. But it can also be full of heart and very sensitive, which is reflected in Ares's dual nature as both a strong warrior and a sensitive dancer. ([https://www.numerologistpro.com/numerology-numbers/numerology-number-9-meaning/](https://www.numerologistpro.com/numerology-numbers/numerology-number-9-meaning/))\n\nv.s\n\n85- The number 85/4 vibration is called a \"world conqueror,\" just like the number 58/4, and like 58/4, 85/4 wishes to conquer the world with its new and genius ideas. 85 is more controlled and thinks more about the consequences of its actions. This number gives an interest in politics, business, and expansion, both materially and in terms of influence. Because the 85 has a digit sum 13/4, it does things in its own unique way. But at the same time, we have the number 8, which is very \"traditional\" and likes to do things in the same way as they have been done for generations. This exciting blend between traditional and new gives the number 85/4 the ability to succeed through a very original career. It could, for example, introduce something revolutionary into a very traditional career path or create something revolutionary, but in a traditional way. ([https://www.numerologistpro.com/numerology-numbers/numerology-number-85-meaning/](https://www.numerologistpro.com/numerology-numbers/numerology-number-85-meaning/))\n\n21-21 gives knowledge, diligence, and the ability to achieve great success after putting in a significant amount of effort. The number 21 is a magical number that symbolizes the entire universe and that you can crack the code of success. With 21/3, you have innate intelligence and the ability to get results with all that you do. ([https://www.numerologistpro.com/numerology-numbers/numerology-number-21-meaning/](https://www.numerologistpro.com/numerology-numbers/numerology-number-21-meaning/))\n\n&#x200B;\n\n&#x200B;\n\nI, like I said hate numerology. Plus people say I'm trynna get rid of my shares by shilling. which I'm not. I have 2500 @ 1.52, so If I wanna back out at their Lowest of lowes, I can break even I'm fine. I truly believe this is the ultimate buy and hold they dont want us in on. They've been planning it since at least before covid and I dont believe they are far from pulling it. as you can see, their current market caps numerology meaning (\"their\" favorite language) It basically says after significant due diligence, along with planning and effort, its time to take over the world lol. \n\nI dont even feel like I'm that correct about this is more of a shot in the dark. However, I feel like IF the conspiracy of the world being ran by the bankers and the federal reserve, and pvt military industrial complex is real. Then this is the stock for longevity and infinite gains. Planned and plotted by those same elite, long ago. So long ago that's why they made it the original \"MEME STOCK\" \n\nthey wanted retail investors to be so cuckolded, and hold so much animosity for this stock, that when it became time for them to start scaling it up, retail is going to look at it as the boy who cried wolf and they arent going to jup in on it until its too late. You can call me crazy. And If I lose my 4k investment. I'll just watch it all the way to the bottom because thats how much I feel it may be real.\n\n&#x200B;\n\nAnd they always say no risk no reward. This is the highest risk, with the possible highest reward.", "score": 2, "replies": [{"body": "Ok.\n\nSo how is it going to go up?  Will Amazon acquire it? \nAs it stands now.  Facts alone, ignoring the “conspiracy” stuff. Rite aid is financially in trouble. They have good revenue, but saddled with debt. The CEO stepped down this year and Amazon prime partnered with them in march I believe.\nI’m trying to remain objective but it’s hard to see much upside to rite aid, although a glimmer of hope does exist", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": [{"body": "https://preview.redd.it/a7sua1e4pl9b1.jpeg?width=828&format=pjpg&auto=webp&s=735fdc6b64ff8ac76c5d3595b3b798833b722479\n\nI entered these positions because I thought there was a lot of upside and I wanted to sell covered calls on the way up, and collect dividends as well. I bought the corporate bond etfs because it’s a nest egg for my son.  I bought crypto to have some exposure.", "score": 3, "replies": []}]}, {"body": "Nice never really lost a lot but learned and got better like you did still learning nice comeback", "score": 2, "replies": []}, {"body": "This is why I’m still in oil. PBT has made me over 40k and still have plenty of room to grow. Monthly payouts are nice as  well", "score": 2, "replies": [{"body": "Yeah PBT looks like it was a solid move!!! Over the past year up 50%!!!! Plus it’s pays a pretty solid dividend…\nIt’s not supported on Robinhood unfortunately… I’d be looking to add that to my Roth IRA perhaps", "score": 1, "replies": []}]}, {"body": "short then long, I take it?", "score": 2, "replies": [{"body": "I’m not sure what you mean by short then long?\n\nBut previously back in 2019 and early 2020 I was using UWT and DWT.  They were leveraged 3x  UWT went up when oil did and DWT went down when oil did times 3.  Summed up.  Well you can guess which one I was in when the pandemic crash hit….\nI just wasn’t very disciplined at the time and highly inexperienced… if I would have had the knowledge (not much but a little more) and patience I have now…\nI probably would have been in DWT and would be a millionaire…\nLong story short UWT and DWT were discontinued (UWT after massive losses and DWT after unprecedented gains- they were tied to each other, some fancy financial instruments etc etc etc) let’s just say I didn’t understand it well then and I still have a loose grasp of it but know enough that it was WAY to risky for a newb to be messing with it…", "score": 1, "replies": []}]}, {"body": "If it makes you feel better I lost 4k yesterday too. No? It doesn't? I tired.", "score": 2, "replies": [{"body": "Get some sleep!", "score": 2, "replies": []}, {"body": "🤦🏻‍♂️", "score": 1, "replies": []}]}, {"body": "My DVN stock was to the moon for a while there. It’s come back down some but I’m going to hold it long term.", "score": 2, "replies": [{"body": "Yeah that seems like a pretty good one…", "score": 1, "replies": []}]}, {"body": "Wait so is that it? Are you done?", "score": 2, "replies": [{"body": "🤣🤣\nYep, I’m retiring and riding off into the sunset… living off of 9 grand!!! Wish me luck.   🤣🤣", "score": 1, "replies": []}]}, {"body": "this is not the end for oi\n\ntis but a scratch and we shall return victorious \n\nand I will finally make money", "score": 2, "replies": []}, {"body": "About to double top", "score": 2, "replies": []}, {"body": " Hear me now, children, for my occupation is of much import. For 82 years I have been an oil man, a ‘barren’ some have called me. Now what does an oil barren do? The answer…crush your enemies! Grind their bones into dirt! Make them regret that they were ever born!", "score": 2, "replies": []}, {"body": "Story is not over yet", "score": 2, "replies": []}, {"body": "premarkets lookin good 🙌", "score": 2, "replies": []}, {"body": "Fubo still undervalued at 600 million market cap. 1.7 sales...multiple like hulu, disney, sling= 6.50 a share. Needs to run to at least 4. It's a gem", "score": 2, "replies": []}, {"body": "Did you dump your tears from out that bucket? 🤣", "score": 2, "replies": []}, {"body": "This is just play money right, please tell me your sons future isn't tied to shib or pltr?", "score": 1, "replies": [{"body": "I don’t have much in shib or PLTR.    \nHis is in corporate bond etfs.  \nMost of this is my savings/play money.", "score": 1, "replies": []}]}, {"body": "I feel like you held Luna and never sold if you are holding Shib🤣", "score": 0, "replies": [{"body": "Never had Luna…. But I’ve had a rough go with crypto.  Those basically are my lottery tickets.  I’m up with bitcoin, eth and bitcoin cash.  Down slightly with shib.  \nI’ve been hacked/scammed out of few thousand messing with coinbase and back and forth transfers.", "score": 1, "replies": []}]}, {"body": "I disagree. As we evolve in society, the general consensus is that we need to ween ourselves off of fossil fuels and shift towards renewable energy. Not only that, the free world is looking to bankrupt pur Russian enemies' main source of income. More than 30% of russians GTP is the sale of fossil fuels. If the big democracies of the world and their major consumers shift towards renewable, our Russian enemies get weaker...", "score": 0, "replies": [{"body": "Disagree? With what? My gains… you can’t “disagree” with numbers…\nI experienced  59% returns since I started investing, predominantly from investing in oil summed up. Facts. Isn’t up for debate..\nDo you disagree with my ethics?  That i ethically shouldn’t invest in anything related to fossil fuels? \nBased on what?  A theory that we can destroy Russia by transitioning away from fossil fuels and it would be ultimately better if mankind as a whole didn’t rely on fossil fuel? \nWell in the meantime, in a place I like to call reality, I am capitalizing on an opportunity…\nDon’t worry I’m not completely oblivious to times are a changing…. I have solar panels on my roof as we speak…. I’m diversified 😉", "score": 3, "replies": []}]}, {"body": "Idk if anyone will see this please help me out school and work is hard anything will help $devking89", "score": 0, "replies": []}, {"body": "What?  Huh?  Oil?  Who said something about oil? Bitch, you cooking?", "score": 1, "replies": []}, {"body": "now man up and invest some real money.. you know that's chump change", "score": 1, "replies": [{"body": "Trust me. Wish I had more than chump change 😅", "score": 1, "replies": []}]}, {"body": " Z ''", "score": 1, "replies": []}]}
