{"title": "In challenge to Tesla, automakers launch EV charging network", "selftext": "", "id": "15acs2z", "created_utc": 1690394143.0, "score": 43, "upvote_ratio": 0.9, "num_comments": 92, "comments": [{"body": "Not really a challenge though. We need more public charging options if the EV market is going to grow to include people who live in apartments and condos. This is good for everyone.\n\nThe real challenge isn't installing a ton of stations, but ones that work.", "score": 56, "replies": [{"body": "They’re literally at the stage Tesla was when they started. Over a decade behind, now realizing that they need an infrastructure for the cars they have to eventually manufacture if they hope to survive.\n\nDifference being that Tesla already owns the EV market, their infrastructure, and will always be able to sell better EVs cheaper and a lot more of them, profitably.", "score": 58, "replies": [{"body": "They either believed, or listened to people who believed, that it really would be simple for legacy automakers to just start making profitable, desirable EVs whenever they were ready to do so and Tesla’s lead would just evaporate overnight. \n\nIt’s as if an experienced alpine hiker were to watch some new guy park their car, get their gear on, and start hiking up a mountain. The old hiker could look on at the newcomer and justifiably say that they could obviously do the same thing if they wanted to. After all, they’ve been climbing that mountain every summer for their whole lives! \n\nBut the new hiker isn’t heading up on a lovely July morning. No, they’re they’re heading up the mountain in December and there’s a winter storm rolling in.  \n\nFortunately for the new hiker they took the time to prepare, they brought proper winter gear, and, most importantly, they have a plan for how they will make it to the summit safely in winter. \n\nThey’re well on their way when the old summer hiker realizes <for reasons> that they actually have to climb the same mountain, too, and *right now.* But unlike the new hiker, they haven’t prepared at all and must just throw themselves at the mountain wearing whatever summer hiking accoutrement is rattling around their trunk.\n\nAt first the veteran hiker remains supremely confident because it’s basically like hiking in summer and they know the mountain. Onlookers aren’t concerned either because they’ve seen this old guy climb the mountain time and again all summer long, year in and year out. And how much harder could it really be to hike in winter? Same principles apply, right? You just put one foot in front of the other. Sure, they’ll undoubtedly be some hiccups along the way adapting summer hiking experience to winter hiking, but they’ve been hiking for *years!* Look at how nice their hiking shorts are, that light day pack won’t tire him out, and those old heavy leather boots are perfectly worn-in and have never failed in the past. \n\nIt shouldn’t come as a surprise that the old hiker rapidly finds themselves in peril as they encounter deep snow, dropping temperatures, and lose all sense of direction when the winter storm hits. It turns out that despite being a half-century member of the alpine club and an experienced mountaineer, they are wholly unprepared for a winter hike that’s barreling towards becoming a multi-day odyssey if they get snowed in. It turns out this is *nothing like* their usual summer jaunt in the hills. \n\nMeanwhile, the new hiker keeps making steady progress through the blizzard and their single-minded focus on hiking a mountain in winter has let them come prepared for the storm and all the  other uncertainties and setbacks they will undoubtedly encounter.\n\nIt’s impossible to say how it will all turn out. And, again, most people will be forgiven for assuming the veteran hiker would be fine and could easily summit the mountain in winter if they just put their mind to it. Plus the new hiker is unproven and hasn’t even climbed *any* mountain before, so why should anyone assume they’ll be able to reach the summit at all, much less ahead of the veteran hiker? But the longer things go on, the more unlikely it seems that the old veteran hiker will make it to the top first, at all, or even survive the attempt. And that new hiker looks smarter and more capable by the hour.", "score": 36, "replies": [{"body": "You forgot to mention that the veteran hiker is 100 years old, has emphysema, and is waiting for a double hip replacement", "score": 10, "replies": []}, {"body": "Chapter 2:", "score": 3, "replies": [{"body": "I heard that in the audible voice", "score": 5, "replies": []}, {"body": "The winter storm is growing even more furious, relentless snowfall and bitter winds that chill to the bone. Visibility is dwindling rapidly and the old hiker is becoming more desperate with each step, his summer gear woefully inadequate for the harsh realities of winter mountaineering. Hypothermia is a serious threat, and he is entirely unprepared for a potential overnight stay on the frostbitten slopes. \n\nIn contrast, the new hiker is persevering. It's not easy - the biting cold seeps into every pore and each step is a struggle against the icy winds and deep snow. But they're prepared for this. They're dressed in a layered ensemble of insulating materials that traps body heat and wards off the cold. Their pack is heavy, filled with food, a stove, a bivy sack, and other gear that is necessary for survival if stranded overnight. They're not just surviving the storm; they're steadily making progress up the slope.\n\nThe old hiker's friends and alpine club members watch the scene unfold from a distance. They'd initially been confident in his abilities, citing his years of mountaineering experience and his intimate knowledge of the mountain. But as the storm worsens and his progress slows, they're starting to worry. Some even openly question why he didn't prepare for the winter ascent, but many just cling to the hope that his experience will see him through. \n\nThe onlookers are also keeping an eye on the new hiker. At first, they'd dismissed them as inexperienced and overly ambitious. But as they watch the new hiker plodding on, making slow but steady progress, their perceptions start to change. The new hiker had a plan, they came prepared, and now they are managing to weather the storm. \n\nIt's clear that the old hiker underestimated the mountain in winter, over-relying on his experience of the summer hikes, and now his lack of preparedness could cost him dearly. Meanwhile, the new hiker, with their careful planning and adaptability, is navigating the same terrain in the face of a blizzard. Their trek might be slower, but it's consistent, and in these conditions, that could make all the difference. \n\nAt this point, it's too soon to tell who will reach the summit first, or if the veteran hiker will survive at all. But one thing is certain, the new hiker, who everyone thought was ill-equipped to handle the mountain, is proving to be a formidable contender. Their persistence in the face of adversity, their preparation, and their determination are starting to make people question their initial assumptions. The story of these two hikers is far from over, and the mountain in winter is proving to be a far different challenge than anyone anticipated.", "score": 2, "replies": []}]}, {"body": "Bravo", "score": 2, "replies": []}]}]}, {"body": ">with a target of rolling out 30,000 chargers, starting along major highways and in cities\n\nSadly, it sounds like they will simply parrot what Tesla is doing with Super Chargers.\n\nWould have been nice if they instead worked on getting L3 into supermarkets, big box stores, and gyms. Places where most people go at least once a week and spend no more than an hour. That's how you quickly solve the apartment/condo problem.", "score": 6, "replies": [{"body": "They are just going after the federal funds, they’ll create a company, install a bunch of chargers and sell the business later.", "score": 5, "replies": []}, {"body": ">and in cities\n\nSo, maybe they will be doing what you suggest.", "score": 1, "replies": []}]}]}, {"body": "I'm sure this coalition of dinosaur OEMs, managed out of the US, Germany, Netherlands/France, Japan, and Korea, will be extremely efficient and successful working together on this.\n\n🍿🍿🍿", "score": 43, "replies": [{"body": "Boom! 🔥", "score": 11, "replies": []}, {"body": "They may be dinosaurs, but they should be able to make systems reasonably compatible, so a car built in Korea can charge in Germany, and people driving from Netherlands to Germany can still charge in Germany, not just with compatible connectors, also the chargers showing up in their navigation and the payment systems be somewhat integrated. They will have to throw a lot of money at it (which they do have a bit) and it will still take a lot of time (which they don't have).", "score": 1, "replies": []}]}, {"body": "I guess they want to profit from Teslas on the road since none of these companies are manufacturing BEVs at decent scale or profitably.", "score": 72, "replies": [{"body": "They want to TRY.  If they aren't built into Tesla's nav system I problem won't use them.  Tesla's pre-heat their system when going to a supercharger and have lots of data regarding availability.  I've never had to wait for a charger, so I don't see why I'd use a competitor charger.", "score": 22, "replies": [{"body": "Tesla has said they’ll put anyone in their nav system as long as they’re reliably up.", "score": 10, "replies": [{"body": "So these guys won’t be added lol", "score": 18, "replies": []}]}, {"body": "I'm not so sure about that. Here in Germany you'll meet plenty of teslas on non tesla chargers. So it appears that people use them if its convenient.", "score": 2, "replies": [{"body": "Maybe you're right.  Here in the US it's technically possible, but I dread going to 3rd party chargers because I know it's going to be slow, likely may not work, won't pre-condition, and I may have to open some new account for billing.", "score": 2, "replies": []}]}]}, {"body": "This is their fallback… they’re ceding the entire auto OEM market to Tesla and the Chinese so that they can become a knock-off supercharger network. Genius! 🧠", "score": 9, "replies": []}, {"body": "Its just a cash grab for their share of the billions the government has decided to toss at the issue. \n\nThe reality is that there is no issue. Tesla has already proven that you can make a boatload of money on charging. Everyone is going to get their share of the money rather then let Tesla run the table on the free money.", "score": 7, "replies": []}, {"body": "Haha nice one", "score": 1, "replies": []}]}, {"body": "Anything that happens regarding EVs is a challenge to Tesla, in the minds of the infantile press.", "score": 32, "replies": []}, {"body": "Who cares? They’ll outsource this and mess it up and then walk away from it claiming it was the other guys fault.\n\nClassic OEM move, they just want the PR value because they saw Tesla stock jump when all the OEM’s signed up to the supercharger network and they are trying to get some of that to rub off on them.", "score": 23, "replies": [{"body": "Yep 1000%.  Tesla superchargers are great because of the software experience of pre-conditioning, availability data, easy navigation, etc.  And because they pretty much always work.", "score": 11, "replies": [{"body": "Yeah and try to incorporate such a system into 10 different platforms. This will not work and be incredibly behind of Teslas network in every aspect", "score": 8, "replies": []}]}]}, {"body": "Scam for tax payer/government funds :)", "score": 14, "replies": []}, {"body": "Oh no, not more options for where to charge their vehicles! How will Tesla ever recover from this \"challenge\"?", "score": 10, "replies": [{"body": "Headline could have just as easily been: \"7 Automakers Team Up to Expand Tesla's Charger Network\"", "score": 11, "replies": [{"body": "Lol. Well put.\n\nMore chargers is good for all EVs.", "score": 5, "replies": []}]}]}, {"body": "Anyone else catch what the CEO of Stelantis said today? \n\nGloating about being \"more profitable\" than Tesla. \n\nI wonder how many billions *they* are pouring into R&D and building new factories. \n\nWhat an asshat.", "score": 8, "replies": [{"body": "> I wonder how many billions they are pouring into R&D and building new factories.\n\nWonder no more!  2022 numbers:\n\nStelantis R&D:  $5.7B.  Profit: 17.9B\n\nTesla R&D: $3.1B.  Profit: 12.6.\n\nStelantis is killing it while investing heavily in the future.\n\nwhat about those numbers have you conclude he is an \"asshat\"?\n\nedit.  downvotes for answering the question by citing the facts. Funny.", "score": -6, "replies": [{"body": "> Stelantis R&D: $5.7B. Profit: 17.9B\n\nratio is 3.14\n\n> Tesla R&D: $3.1B. Profit: 12.6.\n\nratio is 4\n\nTesla is getting more bang for their buck", "score": 9, "replies": [{"body": ">Tesla is getting more bang for their buck\n\nTesla is getting (dare I say it) an order of magnitude more for their buck. Dojo, Optimus, FSD... all that in addition to their ongoing automotive R&D. \n\nThe efficiency of their R&D spending is off the charts.", "score": 10, "replies": []}, {"body": "FYI, R&D does not drive profit in the same year it is spent.\n\nBesides, I care more about the number of bucks.", "score": -2, "replies": [{"body": "A shortsighted thinker I see...", "score": 3, "replies": []}]}]}, {"body": "> Stelantis R&D: $5.7B.\n\nNot all R&D is created equal. Every penny they spend on ICE is money flushed forever down the drain. How much is spent building 10 ho-hum cars that compete with each other, while none of them excel?\n\nR&D spending does not automatically equal innovation.", "score": 7, "replies": [{"body": "> Every penny they spend on ICE is money flushed forever down the drain.\n\nFunny. That would argue that there is 0% overlap of the components and manufacturing processes between an ICE and an EV. Do EVs use entirely different windows, airbags, seats, etc?\n\n> R&D spending does not automatically equal innovation.\n\nI never said it did. It also doesn't automatically equal higher profits, and certainly very little in the same year that the spend is made.", "score": -3, "replies": [{"body": "> Do EVs use entirely different windows, airbags, seats, etc?\n\nNow you're asking the right questions! No, they don't use the ignition of gasoline in any of those components. Hope this helps.", "score": 2, "replies": [{"body": "> Hope this helps\n\nMy rhetorical question should have helped you to understand that R&D on ICE is not money flushed forever down the drain.\n\nYou're welcome.", "score": 1, "replies": []}]}]}]}, {"body": ">and building new factories.\n\nAnd equivalent to dojo?\n\nOptimus?\n\nFSD?\n\nStorage?\n\nAny one of which have the potential to be bigger than the car business. \n\nAsshat indeed.\n\nEdit: Just watched Rob and he said basically the same thing, much more diplomatically.", "score": 8, "replies": []}, {"body": "Profit coming from gas is used to compare with profit from BEV and energy storage🤣", "score": 3, "replies": [{"body": "They sell cars, not gas or electricity. So the point is that the profit coming from selling a car is compared with the profit from selling a car.", "score": -1, "replies": [{"body": "Do I have to tell you they sell cars with \"internal combustion engine running gasoline\"?", "score": 2, "replies": [{"body": "No, you don't need to tell me that.\n\nThe point is they get their profit from selling cars, not gas. So comparing the profit from selling cars is what is relevant, not comparing whether they happen to run on gas vs. electricity.", "score": 0, "replies": []}]}]}]}, {"body": "The downvotes are likely for cherry-picking. Funny.", "score": 2, "replies": [{"body": "what cherry-picking? The person wondered about how much was pouring into R&D and I provided that info.", "score": 1, "replies": [{"body": "OP, who was me, BTW, was wondering how much Stelantis was putting into R&D  *and building out factories.*\n\nYou chose to only focus on R&D. \n\nIronically, the numbers you provided only make  Stelantis look worse. They're spending more than Tesla on R&D and that's just for their automotive R&D. Because they don't have Dojo. Or Optimus. And the question remains, how much are they spending on new manufacturing capacity? \n\nTesla remains profitable despite pouring huge amounts into programs that  Stelantis could only dream about, ($1B into Dojo alone this year) while increasing production capacity 30 - 50% yoy. \n\nTell me, where does Stelantis rank in EVs produced? What are they getting for their R&D spend?", "score": 2, "replies": [{"body": "> You chose to only focus on R&D.\n\nI didn't know that it was required that I answered all your questions. I was willing to help with one of them.\n\nIf you wonder about things, you can check out the internet rather than just you wonder about it here: https://www.stellantis.com/en/news/press-releases/2023/july/first-half-2023-results\n\n> In addition to inaugurating the ACC gigafactory in France, the Company recently announced plans to build a second StarPlus Energy gigafactory in the U.S. together with Samsung SDI. Stellantis Ventures made 11 key investments since its founding in March 2022, including in breakthrough lithium-sulfur EV battery technology from Lyten Inc. that does not use nickel, cobalt or manganese.\n\n>  And the question remains, how much are they spending on new manufacturing capacity?\n\nIn 2021 they announced their plan to spend $35B on EVs though 2025 with a goal of 100% EV in Europe and 50% EV in the US by 2030. I am sure if you spent some time looking, you can figure out how much of that is expanded vs. modified factory capacity.\n\nHere you can get more info: https://www.stellantis.com/content/dam/stellantis-corporate/investors/events-and-presentations/presentations/Stellantis-H1-2023-Results-Presentation.pdf\n\n> They're spending more than Tesla on R&D and that's just for their automotive R&D.\n\nThat is not true since they have built battery factories and have plans to build more. They invested $4.1B in a battery facility in Canada expected to launch in Q1 2024, followed by a $2.5B investment (with Samsung) in the US for Q1 2025.\n\n> Because they don't have Dojo. Or Optimus\n\nI don't know how much profit Dojo and Optimus will generate (hopefully more than the 2016 coast to coast FSD capability or the 2020 Roadster or the 2019 Semi), but they announced their connected services group is expecting $25B in annual revenue by 2030.", "score": 1, "replies": [{"body": "You weren't \"required\" to respond at all. Hope you've had fun. \n\nInsert eye roll emoji here...", "score": 1, "replies": [{"body": "And yet you whined that I only chose to answer part of your question and others whined about cherry picking\n\n\n\nInsert intellectually dishonest emoji here...", "score": 1, "replies": [{"body": "As you wish...", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "How much longer do you think they will be trailing them?  It seems to me that gap is narrowing.", "score": 2, "replies": []}]}]}, {"body": ">\"It won't be easy for the automakers to catch up,\" he said. \"But they do have boatloads of money to throw at the problem and **should outsource that work.**\"\n\nDead on arrival.", "score": 8, "replies": [{"body": "This is what made Electrify America such a disaster. No unified design, no unified manufacturing, just a hodge podge of chargers that only match one another in theory.", "score": 4, "replies": [{"body": "Compromising before the effort is eschewing success in favor of disaster.", "score": 2, "replies": []}]}]}, {"body": "30k chargers over what time period?  The article said Tesla has 18k. Note that the majority of these companies have not signed up to use NACS.", "score": 6, "replies": [{"body": "> Note that the majority of these companies have not signed up to use NACS.\n\nAFAIK, you can still use NACS without signing up or making any PR announcements.  Besides, they are deploying some NACS connectors.", "score": -3, "replies": [{"body": "Yes, but why would they deploy chargers with a different plug than their cars have. I expect them all to fall in line. \n\nGood for them for trying but they are by no means guaranteed success. This is not their expertise.", "score": 3, "replies": [{"body": "> Yes, but why would they deploy chargers with a different plug than their cars have.\n\nObviously to siphon off revenue from cars with that plug.\n\nTheir cars can always use an adapter.", "score": 1, "replies": [{"body": ">Their cars can always use an adapter\n\nFunny thing is, that cuts both ways.", "score": 1, "replies": [{"body": "Why is that a funny thing?", "score": 1, "replies": []}]}]}, {"body": "NACS is a standard where there’s no need to sign up.  The sign up is for the ability to use Tesla’s Supercharger network.\n\nSo they can have the NACS plug in their car without signing up.", "score": 1, "replies": [{"body": "It is still something they would announce.", "score": 1, "replies": []}]}]}]}]}, {"body": "Hyena mentality-survive only in pack!", "score": 6, "replies": []}, {"body": "Stop trying to hit me and hit me. Says Tesla.", "score": 3, "replies": []}, {"body": "Tesla has always wanted other companies to help with this.  It’s consistent with their mission statement.", "score": 3, "replies": []}, {"body": "The legacy autos are Quite pathetic, but hopefully at least this will keep our superchargers less busy after opening them up for licensing 🤞🏻", "score": 3, "replies": []}, {"body": "7 companies want to spend total 1 billion dollar in next 7 years. It is less than 2 million dollar per company per month on EV chargers. They are not serious at all just PR.", "score": 3, "replies": []}, {"body": "interesting.\n\nthe current practice of just stuffing chargers on the edge of a random parking lot is a bit weird.\n\nIRA's insistence on CCS-1 is a tactical advantage for Tesla but a long-term strategic liability . . . often times, worse wins (see Windows for how this works)", "score": 4, "replies": [{"body": "You sound like you have never used either plug.", "score": 3, "replies": [{"body": "never used a CCS-1, no, but man would I never want to.\n\njust charged a rental M3 20 minutes ago and it was great tho.\n\nMy main BEV is a Nissan LEAF (hence the rental M3 this week) and chademo can be OK, the small plastic Yazaki plug is OK but the heavy metal ones on EA dispensers suck.", "score": 3, "replies": []}, {"body": "Can't tell which side you're coming down on but for the record: I use both on a regular basis. CCS _sucks._ It's massive, clunky, and takes a sec to find the sweet spot to insert. NACS is small, lightweight, the cables are way less bulky, the connector doesn't need to be lined up nearly as well to go in smoothly.\n\nMaybe it's possible to make a water-cooled CCS cable? I feel like that'd address a lot of the issues around cable bulkiness.\n\nWouldn't do anything for the other issues though.", "score": 1, "replies": []}]}]}, {"body": "Well, good luck.\n\nIs that 30,000 sites or 30,000 plugs? When will they do it?\n\nThere are a finite number of sites that are both desirable for travelers and also have the local grid capacity to support a charging station of significant size. Many of those sites already have chargers on them from Tesla or someone else.\n\nThen there's cost. Tesla has worked very hard to make their superchargers easy to build, install and maintain. That's why they have the up-time that they do versus competing charging networks. We know that V4 will support up to 350kw, but I sincerely doubt that V4 will cost *more* to deploy than V3.\n\nSo we'll have this new group scrambling to secure decent sites then floundering because their chargers cost too much to build, deploy and maintain. They'll either have to increase prices to compensate, making their network a bad deal or they'll take a beating.\n\nMy only concern is that some of these companies that are going with NACS, like GM, will have many more charging options than the average Tesla. While that's never been a problem for me, per se, it's a selling point for those brands. I want NACS plug-and-charge for my Tesla pretty much anywhere.\n\nEDIT: But you know who's really screwed? Gas stations. They didn't deploy chargers and now the car companies are doing it instead. In 20 years there won't be much of a point to Circle K, 7-Eleven, Kangaroo or any of the other gas-and-snack chains.", "score": 1, "replies": [{"body": "i've seen chargers at wawa and casey's. these are places that are half gas station, half convenience store. i think most gas stations will catch on. and the top of a gas station is a good place to put the solar panels that charge the battery for the chargers.", "score": 2, "replies": []}, {"body": "I would expect that the industry has learned a lot about how to build and maintain chargers over the years.\n\nAs far as rollout, they may roll out high capacity chargers as fast, if not faster, than Tesla rolls out the V4 or is willing to spend to upgrade older versions.  But they don't have to since the volume of cars they serve will be far less.\n\n> My only concern is that some of these companies that are going with NACS, like GM, will have many more charging options than the average Tesla. \n\nThat is only a concern if you care more about Tesla than the environment.  Musk made it clear he cares more about getting the world to a sustainable future.  Be more like Musk!\n\n> But you know who's really screwed? Gas stations. They didn't deploy chargers and now the car companies are doing it instead.\n\nWe will see. A way to accelerate deployment is for them to partner with gas stations which is already happening. In CA, EVGO and Chevron have partnered up, and IIRC, there was a chain in the midwest that had a similar deal.", "score": 1, "replies": [{"body": ">That is only a concern if you care more about Tesla than the environment.\n\nTesla is still a business with shareholders and a board of directors who are here to make money. In fact, that's what this sub is about! So while I understand what you're saying, the reality is that Tesla doing well is good for the environment. Especially since GM isn't deploying solar.\n\n>A way to accelerate deployment is for them to partner with gas stations\n\nTesla partners with WaWa, at least where I am. That works if there is sufficient parking and grid capacity at the gas station location, but the mom-n-pop gas stations probably don't have that.", "score": 3, "replies": []}, {"body": "> I would expect that the industry has learned a lot about how to build and maintain chargers over the years.\n\nI would have expected that years ago, but here we are.", "score": 3, "replies": []}, {"body": "“The industry “ has learned a lot about building chargers?  What a weird statement.  This is a group of 7 automakers who have ZERO experience building chargers.  So nobody knows to what “experienced chargers building industry” you’re referring:-)", "score": 0, "replies": []}]}, {"body": "Isn’t 7-11 deploying chargers?", "score": 1, "replies": [{"body": "https://www.greencarreports.com/news/1139070_7-eleven-wants-its-ev-charging-network-to-be-among-the-largest\n\nYes", "score": 2, "replies": []}]}, {"body": "> In 20 years there won't be much of a point to Circle K, 7-Eleven, Kangaroo or any of the other gas-and-snack chains.\n\n7-11 is a Japanese chain now, and it works without gas stations in Japan.", "score": 1, "replies": []}]}, {"body": "A challenge? Wow, like they could have started this ages ago.\n\nEdit: but the more the merrier.", "score": 1, "replies": []}, {"body": "This was done so they can take all of the incentives the government is putting into this.", "score": 1, "replies": []}, {"body": "Whatever they do, it benefits Tesla owners, unless they prohibit from using the network", "score": 1, "replies": []}, {"body": "Huh. This explains why most of these companies  haven’t committed to NACS yet, this was probably in progress behind the scenes. \n\nI’ll save people a click. “The group includes General Motors (GM.N), Stellantis (STLAM.MI), Hyundai Motor (005380.KS) and its Kia affiliate, Honda (7267.T), BMW (BMWG.DE) and Mercedes Benz (MBGn.DE)”", "score": 1, "replies": []}, {"body": "Oh no!!! Is it a “challenge”??? Are they “taking on” Tesla? The competition is COMING", "score": 1, "replies": []}, {"body": "If they were smart they would buy supercharger from Tesla, rebrand it and install.", "score": 1, "replies": []}, {"body": "\"\"They also get to control the customer experience and collect data.\"\" \n\ninteresting.", "score": 1, "replies": []}]}
{"title": "$TSLA Daily Thread - July 26, 2023", "selftext": " Fun chat. No comments constitute financial or investment advice. ☿️ 🐪", "id": "159urhk", "created_utc": 1690343708.0, "score": 47, "upvote_ratio": 0.98, "num_comments": 646, "comments": [{"body": "A lot of you are dreaming of yachts. My dream has been a work shop.  I've begun the spending era of my retirement.\n\nConstruction excavation kicked off in March on the building.  52'x32' built out of ICF (insulated concrete forms) think giant Styrofoam Legos that are filled with concrete. \n\nFull basement with 10' ceiling height and exposed sides for 2 lower garage doors. Upper main floor has sloped ceiling starting at 11' and angling up to 17' on the interior.  Large glass garage door on this level (think Costco cart area style) person door and several lower windows. High side of the upper wall has six windows at 13' with southern exposure.\n\nMain floor will be for my workshop that is moving out of the house basement. Lower level will be for storage, tractor & attachments, pop-up camper, etc.\n\nToday is the concrete pour for the first half of the upper walls. \n\nGotta go concrete pumper truck is here and things are kicking off", "score": 21, "replies": [{"body": "Congrats! Love the idea of retirement including a workshop that is completely off grid. Enjoy it", "score": 2, "replies": [{"body": "Not quite off grid yet. Planning to add more solar panels to the roof of the work shop eventually. Powerwalls inside as well.", "score": 3, "replies": [{"body": "That’s awesome! AND helping those energy margins. Good work", "score": 1, "replies": []}]}]}, {"body": "This is a dream of mine also one day, how do you plan to equip it?\n\nAnd congrats on getting it started", "score": 1, "replies": [{"body": "Primarily a wood shop. But I do a little of everything so metals, welding, electronics, stainless glass, brewing mead and on and on.\n\nRight now most wood tools are smaller portable types. I'll begin upgrading those to heavier more robust machines once this place is finished and they can go straight to their new home", "score": 2, "replies": [{"body": "Really nice, hope many cools stuff gets made there", "score": 1, "replies": []}]}]}, {"body": "Bravo dude on acting on your dreams!! Too few people are sharp and opportunistic enough to do this. \n\n👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻\n\nAlso please nickname it Hell so if anyone asks where you are, you can say you’re in Hell ;)", "score": 1, "replies": []}]}, {"body": "https://twitter.com/raquelmartintv/status/1684263785542844433?s=46&t=YuXM_s1XIUe8SVfPSLVygA\n\nMitch McConnell undoubtably going for an MRI as we speak.\n\nIf not a stroke - no one can tell me that wasn’t at least a TIA (transient ischemic attack).\n\nGovernment need to have age caps of 65-70.", "score": 20, "replies": [{"body": "Seriously, surely that’s something all sides can agree on. \n\nI don’t care which party you’re in, if you’re incapable of doing the job then get out. 300 million people are depending on your mental acuity and ability to physically serve. Since a competence test isn’t possible we need an age cutoff. Enough of these dinosaurs making decisions that will impact us for the next 50 years.", "score": 7, "replies": [{"body": "Politicians don't really do anything in the US anyways. Important military decisions will be made by generals who know what they are doing.", "score": 1, "replies": [{"body": "Are you implying the only type of important decisions is a military one…?", "score": 1, "replies": [{"body": "Obviously not", "score": 1, "replies": [{"body": "Weird point to jump to then while ignoring other important decisions", "score": 1, "replies": []}]}]}]}]}, {"body": "![gif](giphy|zLzLiltpF5WWGkZX8I|downsized)\n\nit’s already a gif wtf", "score": 10, "replies": [{"body": "Holy shit wow", "score": 8, "replies": []}, {"body": "Is everything okay ?", "score": 4, "replies": []}, {"body": "lmao wtf going on", "score": 4, "replies": [{"body": "He was trying to think of something nice to say", "score": 5, "replies": [{"body": "damn and malfunctioned", "score": 2, "replies": []}]}]}]}, {"body": "Yep, increase the volume of the video and he is slurring his speech at the end with that limping gait. Dinosaurs need to go.", "score": 5, "replies": []}, {"body": "I saw that earlier. So used to seeing out politicians like that, I thought it was just normal for them 👀", "score": 3, "replies": []}, {"body": "KY has a Dem governor, McConnell only leaves the Senate in a casket", "score": 3, "replies": []}, {"body": "Kinda scary the sitting US president has an over 10% chance of death any given year", "score": 2, "replies": []}]}, {"body": "https://preview.redd.it/h9mexp96i8eb1.jpeg?width=1179&format=pjpg&auto=webp&s=f3c5212a7e5b3e009fa1b609497c3b4fc5a8b0c8\n\nNice chart u/space_s3x\n\nAll I see now are suped up high trim Camry’s. That will die soon ☠️", "score": 12, "replies": [{"body": "Gotta include Lexus tho which do well in cali. We get em next q.", "score": 7, "replies": []}, {"body": "&#x200B;\n\nhttps://i.redd.it/iq2ong0zm8eb1.gif", "score": 3, "replies": []}, {"body": "you trying to get space\\_s3x over here??", "score": 1, "replies": [{"body": "Na just had to give credit 🤷🏻‍♂️", "score": 3, "replies": []}, {"body": "Isn't he a tic dude", "score": 2, "replies": [{"body": "I hang out at r/Tesla_Charts and TMC more now. \nmissed your quips and banter post schism.", "score": 8, "replies": [{"body": "He's very anti Elon now. Dont miss him.", "score": 6, "replies": [{"body": "My loyalty is to tsla and tsla alone", "score": 4, "replies": [{"body": "Elon = TSLA, TSLA = Elon.", "score": 3, "replies": [{"body": "Elon = X.com, then space x, then tesla the third child.", "score": 5, "replies": [{"body": "Delusional.", "score": 2, "replies": []}]}, {"body": "No.\n\nI'm a big fan of Tesla, Elon is a POS.", "score": 1, "replies": []}]}]}]}, {"body": "🤗", "score": 4, "replies": []}]}, {"body": "That's what I'm thinking, get ready for a weak brigade or whatever its called", "score": 2, "replies": [{"body": "I'm gonna do it, everyone join me in pumping tic daily posts", "score": 3, "replies": [{"body": "I'm down that would actually be pretty funny", "score": 3, "replies": []}]}]}]}]}]}, {"body": "Stellantis CEO is hilarious.  Tesla apparently entering the \"real world\" of manufacturing and competition leading to decreasing margins.  Meanwhile, Tesla has managed to eat every other EV producer's lunch with margins that lead the entire auto industry.  And this all happened in a period that Tesla pushed volume over margins to capture more market share.", "score": 12, "replies": []}, {"body": "Two car carriers ships have burned down cuz of legacy shit evs. Wonder what that's gonna do to insurance rates for car carriers w evs.", "score": 12, "replies": []}, {"body": "https://preview.redd.it/bvjvczu3o8eb1.jpeg?width=500&format=pjpg&auto=webp&s=9aed5b4202871ae9ed70bf22d15d8ddf9be3f38e", "score": 10, "replies": [{"body": "So like X.com 10T tesla 9T nvda 8T Aapl 4.4T aramco 4.4T", "score": 11, "replies": [{"body": "I am extremely confident.", "score": 4, "replies": [{"body": "!", "score": 1, "replies": []}]}, {"body": "Brand value = market cap?", "score": 3, "replies": [{"body": "Make my words", "score": 5, "replies": []}]}]}, {"body": "![gif](giphy|3o6ZtndSAuvqARwat2|downsized)", "score": 7, "replies": []}]}, {"body": "Huge swing from 80% sept bump to 80% sept hold. https://www.cmegroup.com/markets/interest-rates/cme-fedwatch-tool.html\n\n🕊🕊🕊", "score": 11, "replies": [{"body": "Market:\n\n![gif](giphy|sNJwbUHHguGUE314YB|downsized)", "score": 10, "replies": [{"body": "Mmmmmm", "score": 3, "replies": []}, {"body": "👏👏👏", "score": 2, "replies": []}, {"body": "Stone 🥶 can’t rattle him", "score": 1, "replies": []}]}, {"body": "Futures 3x 8pm close.", "score": 2, "replies": []}, {"body": "Sweet", "score": 1, "replies": []}]}, {"body": "[https://arstechnica.com/space/2023/07/boeing-has-now-lost-1-1-billion-on-starliner-with-no-crew-flight-in-sight/](https://arstechnica.com/space/2023/07/boeing-has-now-lost-1-1-billion-on-starliner-with-no-crew-flight-in-sight/)\n\nBoeing tried to get rid of SpaceX saying it's dangerous to the schedule and that they can assure launch readiness. SpaceX did the first crew launch more than 3 years ago and Boeing is still eating shit with their crapliner, wouldn't surprise me if SpaceX will literally get all the scheduled crew launches because Boeing can't get their shit in order.", "score": 10, "replies": [{"body": "The fact that Musk won aerospace and automotive is fucking insane.", "score": 18, "replies": []}, {"body": "Their MBAs are probably doing 20 meetings a day to come up with a good date for launch.", "score": 2, "replies": []}, {"body": "Boeing ceo asking how much to strap some rockets into the 787?", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 11, "replies": [{"body": "https://preview.redd.it/mi08fnbd2deb1.jpeg?width=1179&format=pjpg&auto=webp&s=a8f87065b955c9e6175f2893ef5e53ecdf82f485\n\nImpressive!", "score": 8, "replies": []}, {"body": "I really want to know how many he has", "score": 5, "replies": [{"body": "355", "score": 3, "replies": []}, {"body": "he photoshopped the gray lines to look 7+ figures", "score": 3, "replies": []}, {"body": "400 shares", "score": 3, "replies": [{"body": "Ain’t no way it’s that low", "score": 3, "replies": [{"body": "If that was pre-split then it'd be 6000 in today's shares.  But I don't know what he is actually holding", "score": 1, "replies": []}]}]}, {"body": "less than 10% because dieworsification...", "score": 1, "replies": [{"body": "You're thinking of Omar. Rob isn't a pussy", "score": 5, "replies": [{"body": "I get jealous every time i see people invested earlier and 10x. I only invested in 2020 and heavily in tsla later that year after a huge run.", "score": 2, "replies": []}]}]}]}, {"body": "I had that w my calls from pandemic crash", "score": 2, "replies": []}]}, {"body": "https://preview.redd.it/jfrs4ixmjdeb1.jpeg?width=736&format=pjpg&auto=webp&s=d8d979ee2efc88af4fc58070c7cd7dc368bba58b", "score": 10, "replies": []}, {"body": "There may have been a huge breakthrough with the publishing of a paper claiming the discovery of a room temperature superconductor.\n\nDiscussion here: https://news.ycombinator.com/item?id=36864624\n\nHacker News is cautiously excited. Results are not yet replicated, but this would be huge if legit.", "score": 8, "replies": [{"body": "Toyota will be using it to make 7M BEVs by 2025", "score": 8, "replies": []}, {"body": "https://arxiv.org/pdf/2307.12037.pdf", "score": 3, "replies": []}, {"body": "Very neat.", "score": 2, "replies": []}, {"body": "Elon’s cawk", "score": 2, "replies": []}]}, {"body": "Xpev now +30%. Short sellers failed to account for how desperate German oems have become.", "score": 9, "replies": [{"body": "Volvo buying 4% of company. Worth 30% 🙈", "score": 1, "replies": []}]}, {"body": "Really interested to hear what the hell kind of justification JPow gives for the rate hike (besides saving face because that’s what he said he would do months ago)", "score": 7, "replies": [{"body": "Too many good paying union jobs", "score": 8, "replies": []}, {"body": "You want to know “what the hell kind of justification” he has for doing what literally almost everyone knew he would do?", "score": 2, "replies": [{"body": "It was obvious that he would do it, but it is not obvious that there is any actual data-driven reason behind it.", "score": 4, "replies": []}]}]}, {"body": "What’s an interest rate? All I know is to tell my broker to buy TSLA", "score": 8, "replies": [{"body": "It is actually an Interesting nate.\n\nMany do not know.", "score": 2, "replies": []}]}, {"body": "https://preview.redd.it/gjetcfotzceb1.jpeg?width=1179&format=pjpg&auto=webp&s=60ff52c24ee9a097179adb009583d6ae51ad237c\n\nYou can say whatever you want. No one believes you 😂😂\n\nRate cuts by EOY vs Q1 2024!", "score": 8, "replies": [{"body": "wtf", "score": 5, "replies": []}]}, {"body": "My car insurance went up, paying $400/mo now, no tickets no accidents.\n\nI need tesla insurance ASAP!!", "score": 8, "replies": [{"body": "Do you have like 7 figure policy? Damn", "score": 5, "replies": []}, {"body": "Seriously though, WTF? I think we pay like $80/month full coverage for 2022 MYLR with USAA. You might want to shop around.", "score": 5, "replies": []}, {"body": "Unless you're not telling us something, that's wrong.", "score": 3, "replies": []}]}, {"body": "Been generating weird porn with local stable diffusion running on my laptop all day. Was fun. Learned a lot, actually!\n\nNever knew people could have so many fingers!", "score": 8, "replies": [{"body": ">Learned a lot, actually!\n\nStable Diffusion? Just FYI, girls don't really typically have 3 nipples or 5 gallon bucket-sized tits.", "score": 6, "replies": [{"body": "> Stable Diffusion? Just FYI, girls don't really typically have [...] 5 gallon bucket-sized tits.\n\nYou havnt seen USPs wife..", "score": 9, "replies": []}, {"body": "Most of the popular checkpoints are quite accurate. But even so, who says it has to be anatomically accurate to be fun? :-p", "score": 5, "replies": []}]}, {"body": "Check out pornpen . ai\n\nI use it as a measurement on how good stable diffusion gets.", "score": 2, "replies": [{"body": ">pornpen . ai\n\nhonestly my results are far better. Plus SDXL1 just dropped so that's going to be even better hopefully.", "score": 1, "replies": []}]}]}, {"body": "Personally I don’t like the name ‘X’, too generic and doesnt say much for the moment.\n\nOn the other hand I dont give a shit.", "score": 15, "replies": [{"body": "I am with you on the I dont give a shit part. Dont care about the other 😂", "score": 4, "replies": []}, {"body": "Yeah, as a brand it’s blah, but the domain name is cool", "score": 5, "replies": []}]}, {"body": "The likes of McConnell, Feinstein, Biden, Trump etc, need to be kicked to the sidelines once and for all. Many can barely function physically or even mentally and they’re in charge of policy that appropriates trillions of dollars all while holding responsibility for sending young people to war. \n\nEnough.", "score": 14, "replies": [{"body": "People over retirement age should never be in charge (unless it's their own private company), they can be useful for advisory roles, not to set policy and make decisions.", "score": 3, "replies": [{"body": "I think the problem is these geezers think the country is their private company.", "score": 3, "replies": []}]}, {"body": "![gif](giphy|MPpO3Ko5K6rcqHhg7q|downsized)", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "And congress declares war. All of these old farts need to go. I agree with fapindustries, put an age limit on them. 65 is the latest they should go in my opinion.", "score": 2, "replies": []}, {"body": "Really though, does it matter? If there is a nuclear attack the species is better off if we don't retaliate and would likely cause less loss on both sides if there was a delay to process and respond.\n\nThe main benefit is deterrence, not retaliation. Oddly Trump was probably a better president for this because everyone would be scared shitless that he'd not hesitate to use the codes\\*.\n\n\\*disclaimer: I don't actually believe electing mentally unbalanced and sociopathic leaders is a good long-term survival strategy.", "score": 2, "replies": []}, {"body": "You think he'd make that decision on whim without consulting the Joint Chiefs etc. It's not like he can drop $44 billion on a social media platform with only a vague plan and even less DD", "score": 1, "replies": []}]}]}, {"body": "Good Morning ☕️ and just wanted everyone to start off the day in a good mood\n\nhttps://preview.redd.it/26n5ijlnwaeb1.jpeg?width=1170&format=pjpg&auto=webp&s=910f33833267441797c41597cfbf64606bfe50d4", "score": 6, "replies": [{"body": "Perspectief", "score": 3, "replies": []}, {"body": "Might be a good short term hedge when Elon creates a local top maybe. Can buy a put or sell a call as well", "score": 1, "replies": []}]}, {"body": "live video of Sundar walking into goog HQ\n\n![gif](giphy|xydGi3nSTlkqs)", "score": 7, "replies": []}, {"body": "When did Bearded Tesla Guy turn into such a cynical idiot? He used to be so informative and enthusiastic about Tesla vehicles and now he’s just an ill-informed jerk - Borderline bad faith posts on his Twitter and his videos that disingenuously leave out important information.", "score": 7, "replies": []}, {"body": "lol the superconductor is lead? roman empire 2.0 coming", "score": 7, "replies": [{"body": "At&t: we lead, and it matters", "score": 5, "replies": []}, {"body": "Roman Empire II can it be 27 BC again?", "score": 2, "replies": []}]}, {"body": "Biden not the only one https://twitter.com/BNONews/status/1684264493453279245?t=hJ-p_mjQPDiSP4-L5KIReA&s=19", "score": 7, "replies": [{"body": "Oh shit, he looks like he saw a black person at his local supermarket.", "score": 5, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Nothing against old people, but when the entire power structure is made up of infirm octogenarians, we have a problem.", "score": 3, "replies": []}]}, {"body": "![gif](giphy|7k2LoEykY5i1hfeWQB)", "score": 3, "replies": []}, {"body": "That guy doesn't only look like a villain in some sci-fi movie, he acts like one in real life.", "score": 2, "replies": []}, {"body": "I don't like him, but it was hopefully not a stroke or smth. similar.", "score": 2, "replies": []}]}, {"body": "McTurtle with a freeze.\n\nUS and other democracies need age limits.", "score": 8, "replies": []}, {"body": "Powell's solution to the housing affordability situation: \"Hopefully more housing comes online soon.\"", "score": 6, "replies": [{"body": "Just build more houses. That’s not hard right!\n\nEspecially in California where it takes 2 years to get permits 😆", "score": 3, "replies": []}, {"body": "Well clearly raising rates didn't help, money just goes to bank instead of equity", "score": 3, "replies": []}, {"body": "Aka not my problem fool 🤣", "score": 2, "replies": []}, {"body": "It's not exactly the job of the Federal Reserve to build houses...", "score": 1, "replies": []}]}, {"body": "Low TSLA volume of about 95 million shares traded, vs. 137 million shares traded on average, probably contributed to the boring price action. \n\nI'm guessing that most investment entities stayed on the sidelines today.  Nobody wanted to get caught on the wrong side of a surprise from the fed.", "score": 7, "replies": [{"body": "Thursday moon tomorrow and Friday moon", "score": 5, "replies": []}, {"body": "In short, they’re hodling ;) then i shall do the same!!", "score": 1, "replies": []}]}, {"body": "Zuck! Not a cuck!", "score": 6, "replies": []}, {"body": "Get title closing statement tomorrow or Friday. See how they do maths.\n\nListed and closed same calendar month. Closing Monday", "score": 7, "replies": [{"body": "Grats!", "score": 2, "replies": [{"body": "Thanks!\n\nTesla is yellow/blue 24/hr too", "score": 3, "replies": []}]}]}, {"body": "This is great - https://twitter.com/r0cco_speranza/status/1684360599654789121?s=46&t=WyhsS8WzmgKtgEuHZzFOrA", "score": 8, "replies": [{"body": "thats crazy", "score": 2, "replies": []}]}, {"body": "Ok I told my boss about Elons plans for X to be more focused on video content and asked her to check out x videos. I don’t know why she is angry with me now?", "score": 13, "replies": [{"body": "you sure you didnt say x three times in a row?", "score": 3, "replies": [{"body": "xnxx", "score": 2, "replies": []}]}]}, {"body": "Room temperature superconductors https://arxiv.org/abs/2307.12008\n\nApparently a very big deal. Like very big.", "score": 5, "replies": [{"body": "I saw that they published two nearly identical papers about it, one with 6 authors and another with only the lead 3 author. I think that means they expect to win the noble prize for this, since the noble can only be awarded to three people at most.", "score": 4, "replies": []}, {"body": "Gotta say, their X logo is awesome.\n\nhttps://preview.redd.it/y00xchzweaeb1.jpeg?width=826&format=pjpg&auto=webp&s=19d3a842002384192c08c81381d061cc34128a6a", "score": 4, "replies": []}, {"body": "Can finally get hoverboards", "score": 3, "replies": [{"body": "and right now is exactly when they would be selling Barbie hoverboards… it’s all coming together", "score": 1, "replies": []}]}, {"body": "I’d wait and see if it’s replicated before getting excited", "score": 1, "replies": []}]}, {"body": "Straight up like a UFO", "score": 7, "replies": [{"body": "they solved fsd", "score": 2, "replies": [{"body": "Apparently some crashes, so their march of 9s continues", "score": 1, "replies": []}]}]}, {"body": "books ring piquant pocket towering live zesty groovy ancient safe -- mass edited with redact.dev", "score": 6, "replies": [{"body": "Cash out before Rivian cash burns you.", "score": 5, "replies": [{"body": "cake dog rhythm safe longing merciful encouraging door worthless aback -- mass edited with redact.dev", "score": 3, "replies": [{"body": "Today would be a good day to do so Screen", "score": 2, "replies": []}]}]}, {"body": "What's the thesis for holding it at $25B market cap?", "score": 1, "replies": [{"body": "smell full wild languid middle cooperative capable wasteful overconfident elastic -- mass edited with redact.dev", "score": 2, "replies": [{"body": "Because I don't think that the discounted cash flows will ever become a positive number, they are very good at selling $1 for $50c which is generous but ultimately not good business", "score": 0, "replies": []}]}]}]}, {"body": "you wanna laugh today? [https://twitter.com/DriveTeslaca/status/1683957560943210499](https://twitter.com/DriveTeslaca/status/1683957560943210499)", "score": 6, "replies": [{"body": "![gif](giphy|10AYkGR9M75nLW|downsized)", "score": 5, "replies": []}]}, {"body": "Best pictures yet of the wrapped CT  https://twitter.com/SullyCNBC/status/1684023008384413696?s=20", "score": 6, "replies": []}, {"body": "Heard a hilarious ad on Dutch FM radio today. Translated: “VW summer discount on inventory stock, very easy: €3000 on an ID3, €4000 on an ID4 and €5000 on an ID5!” \n\nRip (nonexistent) margins", "score": 6, "replies": [{"body": "Competition is rendering 🔥", "score": 4, "replies": []}]}, {"body": "market wasting time before fed powwow", "score": 7, "replies": [{"body": "Wen?", "score": 1, "replies": [{"body": "30 mins for the .25 then an hour and a half for his presser.", "score": 1, "replies": [{"body": "Press conference starts at 2:30, no?", "score": 1, "replies": []}]}]}]}, {"body": "Bmw and Mercedes scrambling over each other to whore out NIO", "score": 6, "replies": []}, {"body": "I predict market will continue to rip after jpow stuff (today, tomorrow, or Friday)", "score": 5, "replies": [{"body": "I will be joining Nate’s lawsuit if this doesn’t pan out", "score": 7, "replies": [{"body": "nates lawsuit?", "score": 5, "replies": [{"body": "just a shitpost. \n\nNate was REEEing after earnings, first blaming Elon ofc and then turned the tables and said it was sub’s fault for his position", "score": 4, "replies": [{"body": "lol", "score": 2, "replies": []}]}]}]}]}, {"body": "My Free Kevin Spacey campaign worked.", "score": 6, "replies": [{"body": "So can we actually finish House of Cards now?", "score": 1, "replies": []}]}, {"body": "Reporter: Let me compliment your tie, Jpow.\n\nJpow: \\[Raises eyebrows\\] Is this guy coming on to me?", "score": 5, "replies": []}, {"body": "Waste of a day", "score": 7, "replies": [{"body": "Any day it's not crashing is a win I guess\n\n![gif](giphy|3o7TKO4aJqKfmc4clq)", "score": 2, "replies": [{"body": "🍼", "score": 4, "replies": []}]}]}, {"body": "What does the CT upgrade pathway look like? Like what will a gen 2 or gen 3 CT have that a gen 1 won’t have…..?", "score": 6, "replies": [{"body": "CT will be so isolated for so long", "score": 4, "replies": [{"body": "As it should be - it’s going to be teslas cash cow, second to subscription based everything :)", "score": 2, "replies": []}]}]}, {"body": "https://twitter.com/elonmusk/status/1683946564115394561?s=46&t=lLL-Hz1NiVAi5pFw1GmYGw\n\nOh it’s x now. Not tesla?", "score": 10, "replies": [{"body": "Elon jumps from one love interest to the next like hopping between lily pads in a pond.", "score": 5, "replies": []}, {"body": "Elons priorities 1. Woke war 2. X.com 3. SpaceX 4. Tesla", "score": 12, "replies": [{"body": "They took his son", "score": 7, "replies": [{"body": "They cut off his pp", "score": 3, "replies": [{"body": "The massacred my boy", "score": 1, "replies": []}]}, {"body": "definitely cuz of social media that happened, not cuz of anything else", "score": 2, "replies": []}]}]}, {"body": "X is taking TSLA private at $420 per share", "score": 3, "replies": [{"body": "I'm down", "score": 2, "replies": [{"body": "Only if we do another 5-to-1 split before then", "score": 2, "replies": []}]}]}, {"body": "tesla employees the real heroes", "score": 4, "replies": []}]}, {"body": "Lol snapchat earnings disaster", "score": 5, "replies": [{"body": "As is tradition.", "score": 3, "replies": [{"body": "They should fire 70% of employees", "score": 5, "replies": [{"body": "I think their days are numbered for sure.", "score": 1, "replies": []}]}]}]}, {"body": "Just got offered 2023.7.6 (FSD beta 11.4.6) guess I'll try it tomorrow and see if it stops for red lights and stop signs 😂", "score": 5, "replies": []}, {"body": "This sounds good for Tesla - \n\n\"I would just say whatever your demand, predictions are for electricity, I suspect they are too low - we need a tripling of output. You can mark my words here - output will triple,\" Elon said.\n\nhttps://twitter.com/sawyermerritt/status/1684063017196027905?s=46&t=WyhsS8WzmgKtgEuHZzFOrA", "score": 5, "replies": [{"body": "How do we trade this", "score": 7, "replies": [{"body": "Electricity futures", "score": 2, "replies": []}]}]}, {"body": "https://twitter.com/bnonews/status/1684034852817887233?s=46&t=9CJP0I6ZOHeWjM0NonMiDw\n\nWhose cars? Pls not Tesla\n\nEdit: other reports say there were only 25 EVs onboard, so obviously not a boat full of Teslas.\n\nWhich OEM sells ~0.9% EVs in Europe? BMW?\n\nEdit 2: Cars were on their way from Germany to Egypt\n\nhttps://twitter.com/gerco1985/status/1684048621409378305?s=46&t=9CJP0I6ZOHeWjM0NonMiDw", "score": 4, "replies": [{"body": "Bremmerhaven to Egypt, probably bmw. Tesla doesn't sell in Egypt.", "score": 13, "replies": []}, {"body": "No worries! it was Tesla it would be called the Fremontle Highway", "score": 6, "replies": []}, {"body": "One person died and several wounded.\n\nhttps://www.nu.nl/binnenland/6273904/een-dode-en-gewonden-bij-brand-vrachtschip-boven-ameland-schip-nog-in-brand.html", "score": 2, "replies": []}, {"body": "Fuck sake. How does this happen so often", "score": 2, "replies": []}, {"body": "Where are all the media reporters mentioning Tesla may have caused this? Or just randomly add Tesla in the story in a negative way?", "score": 2, "replies": []}]}, {"body": "Tesla overhang", "score": 6, "replies": [{"body": "Hang over gang", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Mmm ice cream so good", "score": 2, "replies": []}]}]}]}, {"body": "Why is the market 💯that JPow will raise rates, when CPI and PPI are already near 0.0%?", "score": 5, "replies": [{"body": "Core is high still", "score": 3, "replies": []}, {"body": "hat smart rock north include summer liquid follow offer light -- mass edited with redact.dev", "score": 3, "replies": []}, {"body": "They are going to raise several more times to ensure it doesn’t come back. Recession is still likely", "score": 0, "replies": [{"body": "Define several.  I could see one today and one more next month, but then a pause.", "score": 2, "replies": [{"body": "2-3", "score": 1, "replies": []}]}]}, {"body": "I just saw a headline in my news app that says: \"Deep Recession to Force Full Percentage-Point Fed Cut, DoubleLine Warns\"\n\nLOL", "score": 1, "replies": []}]}, {"body": "My least favorite market phenomenon is sympathy.", "score": 5, "replies": []}, {"body": "25", "score": 5, "replies": [{"body": "Nothing burger", "score": 6, "replies": [{"body": "Recession is the Fed’s goal", "score": 4, "replies": []}]}]}, {"body": "Who had “Barbie Movie” on their FOMC press conference bingo card?", "score": 6, "replies": []}, {"body": "Quick Powell press conference summary for those that missed it: [https://twitter.com/alifarhat79/status/1684262627940106261?s=20](https://twitter.com/alifarhat79/status/1684262627940106261?s=20)", "score": 4, "replies": [{"body": "Beat me to it. LMAO", "score": 1, "replies": []}]}, {"body": "https://twitter.com/sbink/status/1683820066461057026\n\nThat'd be nice", "score": 5, "replies": [{"body": "Just give me $600 in the next couple years so I can retire", "score": 7, "replies": []}, {"body": "I think Warren Redlich is a bit of a fool but i'd like to be proven wrong in this case", "score": 6, "replies": [{"body": "Meet Kevin and Leo are both at 12x", "score": 3, "replies": []}]}]}, {"body": "Jebus. On my front page some guy bought like 15 calls for Union Pacific on Tuesday with Friday expiration. Up 10% today. His calls went up 2,000%\n\n[Link to post](https://www.reddit.com/r/wallstreetbets/comments/15al60o/choo_chooooo_regards/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=1)", "score": 4, "replies": [{"body": "And someone sold him those calls", "score": 5, "replies": [{"body": "Touché", "score": 3, "replies": [{"body": "Hmm reminds me where is crypto is a flat circle", "score": 9, "replies": []}]}, {"body": "Probably an MM and they don't give a shit", "score": 1, "replies": []}]}, {"body": "That's right, SEC, this guy right here...", "score": 4, "replies": []}]}, {"body": "Yaccarino like yah I'm the perfect person to lead x.com a financial institution right, right??", "score": 6, "replies": []}, {"body": "Tic daily comment thread heating up with 4 comments 🔥🔥🔥", "score": 8, "replies": [{"body": "What have I done 🙈", "score": 2, "replies": []}, {"body": "https://preview.redd.it/gcgyjlucs8eb1.jpeg?width=1179&format=pjpg&auto=webp&s=502adec57c98f57be56e0ac0f6280bf10e1f1400\n\nIs this the way?", "score": 2, "replies": [{"body": "Lol, nice.  And nice tic flair! 😂", "score": 1, "replies": []}]}]}, {"body": "Now i am become bear, the destroyer of wealth.", "score": 9, "replies": [{"body": "Now I am become beer, the destroyer of health", "score": 9, "replies": []}]}, {"body": "https://preview.redd.it/81l6csrfsbeb1.jpeg?width=750&format=pjpg&auto=webp&s=18084b389bbbc358f3ba338422e29833e50b504a\n\nMy long ride yesterday into Mulhouse, France put me just over 1,000 km cycled so far in Europe. Only riding every 3 days or so. I've cycled 7 legs of the trip, so averaging around 140km per trip", "score": 9, "replies": []}, {"body": "![gif](giphy|u3Xa6Zx8qiP1C|downsized)", "score": 9, "replies": [{"body": "![gif](giphy|eKNrUbDJuFuaQ1A37p|downsized)", "score": 4, "replies": []}, {"body": "Wowow", "score": 4, "replies": []}, {"body": "My girl Emily. Mmmmmm", "score": 2, "replies": []}]}, {"body": "When he's spinning FSD\n\nBut your car heads for a tree\n\nDiarrhea. Diarrhea.", "score": 8, "replies": [{"body": "Dude, wtf", "score": 5, "replies": []}, {"body": "its robotaxi ready, i swear", "score": 0, "replies": []}, {"body": "Gonna start quoting GWAR lyrics pretty soon...", "score": 1, "replies": [{"body": "When you're feeling like death metal\n\nBut it's GWAR they're tryna peddle \n\nDiarrhea. Diarrhea.", "score": 1, "replies": []}]}]}, {"body": "https://preview.redd.it/6wdffh9rqceb1.jpeg?width=500&format=pjpg&auto=webp&s=50fca1ef1524176a3aa64ddae961b6456198c4fc\n\nBlows my mind the FED can look at this chart and call for a soft landing with a straight face. Every hike cycle ends in recession and violent cuts. All that's left high in CPI is shelter than doesn't react to hikes without recession. Clowns.", "score": 8, "replies": [{"body": "This time higher rates are supportive of the economy with gov debt over 100% of GDP. Effectively an extra 1T stimulus", "score": 1, "replies": [{"body": "IDC about bottom line stimulus. Give the consumer liquidity. This is America.", "score": 1, "replies": [{"body": "It all works it’s way through the system eventually. Gov pays interest to bondholders. A chunk of that will work it’s way down to ordinary people who hold fixed income assets. Some will go to funds and institutions who will buy equities. Some will go back into more bonds, so yield will go down making equities more attractive. \n\nIt’s hard to track dollar for dollar but everyone has been surprised there’s been no recession and equities have mooned and I think this explains it.", "score": 1, "replies": [{"body": "Disagree on this being the explanation. The explanation is unprecedented amount of adults choosing the dual-income no-kid DINK life, coupled with post-lockdown cabin fever, coupled with record low unemployment, coupled with tech/defense sectors absolute non stop outperformance.", "score": 1, "replies": [{"body": "Could be aspects of both no? $1T+ is a lot of dollars to filter through the economy.", "score": 1, "replies": [{"body": "Is it? Feels quite a bit like a drop in the bucket for 23.32T GDP 32T Debt.", "score": 1, "replies": [{"body": "There’s a big difference between the accumulated debt and annual deficit.\n\nThe current deficit is 1.39T.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Is inflation in the room with us right now?", "score": 9, "replies": [{"body": "Lots of bond buying", "score": 3, "replies": []}]}, {"body": "So we’ve got some people saying 11.4.6 is next level and others saying it leaves them speechless - but not in a good way. \n\nSeems this is a recurring theme with FSDb these days. Still likely geographically anchored to a few select cities. Shame if that’s the case as I thought a generalized approach would lead to repeatable results regardless of location.", "score": 4, "replies": [{"body": "Every release has ben \"next level\" and \"revolutionary\" for years now. In all reality it has just been small incremental steps. Won't be ready for robo taxi for a long while at this rate.", "score": 3, "replies": [{"body": "I hold hope that even with regressions in V11, the under-the-hood work is being done relatively quickly to support the rapid improvements once they have the compute power online to process their data set.  Until then, you're right, the improvements are small from one point release to the next.", "score": 2, "replies": []}]}, {"body": "They just gotta release the end to end world model. I got high hopes for it", "score": 2, "replies": []}]}, {"body": "I googled Florida man followed by my birthdate, and I got this:\n\n‘Florida Man Caught With His Pecker In His Hand And A Pickle In His…’", "score": 5, "replies": [{"body": "oh that? that was just L2F", "score": 6, "replies": []}, {"body": "'Florida man dubbed 'pooping perpetrator' sought by police for break-in at Joe's Crab Shack.'", "score": 4, "replies": []}, {"body": "Mine was a dude trying to rob a Publix with a stapler", "score": 4, "replies": []}, {"body": "Mine:\n\n‘I’m not going to lie, it’s cocaine:’ Florida man tries to eat stolen debit card, deputies say\n\nI mean, we've all been there at least once, right?  Right??", "score": 4, "replies": [{"body": "I can neither confirm nor deny if I thoroughly clean my keys and cards when I go through an airport.", "score": 1, "replies": []}]}, {"body": "Mine: \"Florida man arrested after throwing glass eye at doctor and nurse, police say\"\n\nBut the top post was: \"Pensacola man arrested for barging into homes seeking someone to fight him\"", "score": 2, "replies": []}, {"body": "Florida Man Tells Cop ‘That’s What She Said’ After Being Pulled Over and Questioned About Bulge", "score": 2, "replies": []}]}, {"body": "tic daily comment thread just surpassed avg. daily high\n\npamp it", "score": 4, "replies": [{"body": "Is we doing things there??", "score": 3, "replies": [{"body": "a little pamp never hurt anyone 😋", "score": 2, "replies": []}]}, {"body": "It's like upside down world over there", "score": 2, "replies": [{"body": "![gif](giphy|1g39TMuBifLRAkWfJL)", "score": 1, "replies": []}]}]}, {"body": "[https://www.theverge.com/2023/7/26/23808270/bmw-honda-gm-joint-venture-north-american-ev-charging-network](https://www.theverge.com/2023/7/26/23808270/bmw-honda-gm-joint-venture-north-american-ev-charging-network)\n\njoin venture to create a charging network = NACS I assume.\n\nso.. Honda and Hyundai Kia are joining NACS soon i guess?", "score": 4, "replies": [{"body": "Probably a mix since some are nacs haters. Either way shoulda been done 10 years ago, now they'll just be the duckduckgo to teslas goog", "score": 5, "replies": []}, {"body": "Curious to see where they place them.\n\nCompete with Tesla for the best spots or fill in the gaps?\n\nBetter for EV adoption if they fill in the gaps but probably not optimal for them if they want charger revenue", "score": 2, "replies": []}]}, {"body": "Wen uncucked?", "score": 4, "replies": [{"body": "realistically eoy when fsd is solved", "score": 3, "replies": [{"body": "2025? Got it lol", "score": 3, "replies": [{"body": "there is rumors the golden goose died in a driveby shooting earlier this year", "score": 6, "replies": [{"body": "Make my words, golden 🪿 EOY.", "score": 4, "replies": []}]}]}]}, {"body": "Sundown", "score": 1, "replies": []}]}, {"body": "FED rasies 25bps", "score": 4, "replies": []}, {"body": "Boobs tease continues", "score": 3, "replies": []}, {"body": "CMG reporting in after the bell\n\n![gif](giphy|xT0BKKNqQB7W2sVQyY)", "score": 4, "replies": [{"body": "Made my first play ever on that thing \n\nSTO 7/28 2380/2400 call credit spread for $65\n\nHope this sub hasn’t been ordering guac\n\nCan buy 2 COST rotisserie chickens and 2 hot dog combos for the price of 1 burrito bowl", "score": 2, "replies": [{"body": ">2 COST rotisserie chickens and 2 hot dog combos for the price of 1 burrito bowl\n\nthis is not well known", "score": 3, "replies": []}]}, {"body": "this stock is unbelievable!", "score": 1, "replies": []}, {"body": "$190 off each share please. No guac - can no longer afford it. \n\nTo go, please.", "score": 1, "replies": []}]}, {"body": "burrito bomb", "score": 4, "replies": []}, {"body": "So market barely reacted to fed rate hike? Huh.", "score": 5, "replies": [{"body": "0.25% was expected.  I think we would've seen higher volume if it had been 0% or 0.5%", "score": 6, "replies": []}, {"body": "Market is tied of reacting to JPow at this point", "score": 1, "replies": []}]}, {"body": "i want one of those clear orb's with the cube inside.", "score": 4, "replies": [{"body": "&#x200B;\n\nhttps://preview.redd.it/ta7zxvenoeeb1.jpeg?width=592&format=pjpg&auto=webp&s=9c7ff956b24d7fdca5b95cb89bf3179c0bd081c6", "score": 3, "replies": []}, {"body": "![gif](giphy|ip9R3oP7Wk2iqadu7u|downsized)", "score": 3, "replies": [{"body": "![gif](giphy|8nkzdr0sUDApq)", "score": 4, "replies": [{"body": "🤣🤣", "score": 2, "replies": []}]}]}]}, {"body": "So I love eccentric people. The weird AND intelligent AND outgoing - usually accomplish quite a bit.\n\nBut you have Elon who is a rambling, mild Asperger’s, paper handing (u/upvotemeok), boy who cried FSD + brought electrification to front lines.\n\nKarp who is a rambling, mild Asperger’s, hands out stock to employees like candy, defense/USA/West obsessed, ski loving weirdo.\n\nSo I mean - like you can’t have a normal human in these roles 😂\n\nMagikarp I am pro-PLTR (hold zero stock). But Karp is weird 👀 but so is Elon 🫡\n\nhttps://twitter.com/jtlonsdale/status/1683923807994535945?s=46&t=YuXM_s1XIUe8SVfPSLVygA", "score": 9, "replies": [{"body": "Geniuses are always weird and most are mentally unstable. Many geniuses go insane. This is just a problem with our semi-evolved simian brains. The genius gene is linked with the insane gene. Nothing we can do about it.", "score": 4, "replies": []}, {"body": "Karp is great", "score": 3, "replies": [{"body": "Surprise qtr and outlook 🧐", "score": 3, "replies": []}]}]}, {"body": "Oh, and Canada is a quasi-totalitarian hell state where if you invest in something legal that the authorities don’t like, they can not only block the investment, but freeze your entire bank account and all of your financial relationships.\n\n/is happening right fucking now to someone I know", "score": 13, "replies": [{"body": "Thats crazy, mind elaborating?", "score": 6, "replies": [{"body": "Dude tried sending a bank wire to invest in a company and everything went to shit.", "score": 5, "replies": []}]}, {"body": "First time hearing this.", "score": 3, "replies": []}, {"body": "Yeah it's pretty great here. Love Turdeau", "score": 5, "replies": [{"body": "Congratulations!\n\nYour steadfast compliance and admirable social behavior have been recognized. As a result, your Social Credit Score has been increased by 10 points. We appreciate your continued contribution towards a harmonious and orderly society. Please continue to uphold our shared societal values for a better future. \n\nYour cooperation is valued.", "score": 4, "replies": []}]}, {"body": "Don't you just love socialism. Can't you just wait to turn over more money and power to them?", "score": 5, "replies": []}, {"body": "Surprising. Weren’t people running to Canada when Trump came into power?", "score": 1, "replies": [{"body": "Fakers. But if he wins again...", "score": 2, "replies": []}]}, {"body": "Were they sending money to a Russian arms manufacturer or something?  Probably something pretty sketchy for that kind of response", "score": 0, "replies": [{"body": "Liquor importer.", "score": 2, "replies": [{"body": "Ah, that sucks.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Give some to dog 🐕", "score": 4, "replies": []}, {"body": "Need u/chefbaconz to approve this", "score": 3, "replies": []}, {"body": "u/FIREgenomics\n\n\"sashimi grade\" is just a made up phrase.  There's no technical way of telling if something is worthy of it.  It's just a word used to throw on perceived value.\n\nNo chef would ever cut sashimi that thin, or that shape. It doesn't even look like Ahi.  If anything, it looks like frozen treated ahi that was blocked out then sliced on a meat slicer.  \n\nIt looks like freakin watermelon.  Bottom slices have ice forming on it, not good.  Puppo seems happy to eat it for you though", "score": 4, "replies": []}, {"body": "Woah nice", "score": 3, "replies": []}, {"body": "How much did you buy?  Looks like you stocked up!!", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "How long will it keep <as fresh> in the freezer? Like at what point do you notice a drop off in flavour/texture?", "score": 1, "replies": []}]}]}, {"body": "Who’s the little guy?", "score": 2, "replies": []}, {"body": "That’s a lot of tuna, I don’t have a costco close by but maybe worth getting a membership just for online sashimi orders", "score": 2, "replies": []}, {"body": "This means it was shipped two days after the fish was killed?", "score": 1, "replies": []}]}, {"body": "Swapped out my old 14 50 plug without getting electrocuted. Bullish", "score": 6, "replies": [{"body": "You’re boy Joseph Carlson is jacked about UNP", "score": 2, "replies": [{"body": "He's gushing about visa but he don't know x.com coming", "score": 5, "replies": []}]}]}, {"body": "https://preview.redd.it/v0s6hibgi8eb1.jpeg?width=1179&format=pjpg&auto=webp&s=bfa7589875ac4d491bb5b6791620e9d681d7b54e\n\nBro. You are onto an unscalable + inefficient model. You don’t use highways or usually major roads.\n\nOnce Robotaxi goes online. ☠️", "score": 9, "replies": [{"body": "Better to be the dude whose robotaxis do stupid shit every few days or the boy who cried fsd?", "score": 6, "replies": [{"body": "I have some FSD For sale, it already works. DM me for payment instructions.", "score": 4, "replies": []}, {"body": "Boy who changed the world 😎\n\nYa that was way too\n\n![gif](giphy|1auJ1YxExhFk9tAX24)", "score": 3, "replies": [{"body": "Ambassador of 🌎", "score": 3, "replies": []}]}]}, {"body": "Don’t knock him unless tesla has something better to show for. At least he has something operational.", "score": 6, "replies": []}]}, {"body": "Where the hell is rob", "score": 6, "replies": [{"body": "![gif](giphy|3o6nUYKzUwcW3mDgqI)", "score": 0, "replies": []}]}, {"body": "Next time stock is red we deploying the mitch gif", "score": 9, "replies": [{"body": "Should be for flat / no action days", "score": 3, "replies": []}, {"body": "So tomorrow then\n\n![gif](giphy|xUA7aM09ByyR1w5YWc)", "score": 4, "replies": []}, {"body": "Lmao", "score": 2, "replies": []}, {"body": "🤣", "score": 3, "replies": [{"body": "![gif](giphy|sNJwbUHHguGUE314YB|downsized)", "score": 8, "replies": [{"body": "Mmmmmm", "score": 7, "replies": []}, {"body": "![gif](giphy|l0HlGyAwBHgxyjBqU)", "score": 6, "replies": []}]}]}]}, {"body": "So tic comment pump tomorrow confirmed?  Could be good recruiting opp for the lounge 😄", "score": 3, "replies": [{"body": "Prepare the brigades", "score": 3, "replies": [{"body": "Locked and loaded", "score": 2, "replies": []}]}, {"body": "![gif](giphy|lSS2FU58CN2JgiQ07b)", "score": 0, "replies": []}]}, {"body": "$XPEV surges over 15% premarket after report that Volkswagen takes $700 million Xpeng stake for EV pact.", "score": 3, "replies": [{"body": "Not a bad move for VW considering their slow adoption so far.", "score": 4, "replies": [{"body": "Rebadged china evs coming soon to Germany", "score": 5, "replies": []}, {"body": "Competition is rendering 🔥", "score": 1, "replies": []}]}, {"body": "The competition is merging", "score": 2, "replies": []}]}, {"body": "As per Dirty Tesla: lane drift (ie - impromptu incorrect lane changes that do not follow route) still unresolved in 11.4.6.", "score": 3, "replies": [{"body": "🥳", "score": 3, "replies": []}, {"body": "![gif](giphy|tu207g6K6vxCw)", "score": 2, "replies": []}, {"body": "Fud!!", "score": 2, "replies": []}]}, {"body": "VW bends the knee to Xpeng… really?", "score": 3, "replies": []}, {"body": "What’s Max pain this week?", "score": 3, "replies": [{"body": "270", "score": 3, "replies": []}, {"body": "0", "score": 1, "replies": []}]}, {"body": "So are we now going to buy Lead futures because the superconducting material is lead based?", "score": 3, "replies": [{"body": "im gonna buy alot of lead\n\n![gif](giphy|j3IxJRLNLZz9sXR7ZA)", "score": 2, "replies": []}]}, {"body": "STO META 7/28 257.5p and a 247.5p (my normal play) for $215. IV 144% dam\n\nEyeing a few more possible plays for earnings AH and PM.\n\nA Reddit homie went ham. Big MSFT META cat that has done this shit and 400% on the 1 year. Made $500K on NVDA last earnings. Just degen shit on another level\n\nhttps://preview.redd.it/iai3yvot8ceb1.jpeg?width=2532&format=pjpg&auto=webp&s=676596efd9998f02d5f5b95bd36e7e2d393fb34b", "score": 3, "replies": [{"body": "open the casino for gambling", "score": 5, "replies": [{"body": "I’m just trying to get $200 w ♾️ returns\n\nThese chickens don’t feed feed themselves", "score": 2, "replies": [{"body": "Warren Buffett can't time the market, but chicken can.", "score": 0, "replies": [{"body": "Chicken?", "score": 1, "replies": []}, {"body": "Elon can too. When exuberant, sell. Duh", "score": 1, "replies": []}]}]}]}, {"body": "zealous hateful impolite skirt plants aware impossible close possessive intelligent -- mass edited with redact.dev", "score": 3, "replies": [{"body": "I closed my LEAPS and picked up a few 🪑 w profits \n\nCongrats on the run up either way!", "score": 3, "replies": [{"body": "bike tan shaggy voiceless disagreeable fall smile caption quaint decide -- mass edited with redact.dev", "score": 2, "replies": [{"body": "just hold $260 if it does 🙏🏼", "score": 1, "replies": [{"body": "physical consist threatening wrench slimy far-flung whistle toothbrush sleep late -- mass edited with redact.dev", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Whoa dove", "score": 3, "replies": []}, {"body": "Rate hike but yields down, interesting", "score": 3, "replies": [{"body": "Powell accidentally letting slip that disinflation is coming.", "score": 6, "replies": []}]}, {"body": "gonna be close to a low YTD volume", "score": 3, "replies": []}, {"body": "https://preview.redd.it/u4ccd4g69deb1.jpeg?width=941&format=pjpg&auto=webp&s=cb1944af14acfdf7a818b971fc44a82b41735667\n\n[this cat got way mor richer holy shit](https://www.reddit.com/r/TSLALounge/comments/159urhk/tsla_daily_thread_july_26_2023/jtjjq9r/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=1&utm_term=1&context=3)", "score": 3, "replies": []}, {"body": "burritos too expensive thanks jpow", "score": 3, "replies": []}, {"body": "Does anyone have information on the new electric Ford transit vans? I was at an industry event and one of the people I talked to said that their transportation vans/busses have all been replaced by electric ones. When I asked her what brand, she just said Ford. \n\nI work in senior care, so these must be smaller sized vans or busses.", "score": 3, "replies": [{"body": "E-Transit, they're basically rebuilt Ford Transits", "score": 2, "replies": [{"body": "Weird that no one is talking about this van. People rumor about teslas van coming “whenever the fuck” and Ford is already out there cornering the electric transit van game. \n\nWhat the fuck", "score": 0, "replies": [{"body": "Yeah idk besides the fact that they only sold 6500 in 2022. I *heard* that sales were way down in 2023 but I haven’t checked into it\n\nEdit: in Q1 2023, e-transit sales were *up* 67% YoY", "score": 2, "replies": []}]}]}]}, {"body": "Seriously what is VW trying to achieve with the ID line? The cost structure on it has to be absolutely horrible which means they can't fight Tesla in prices to gain volume without losing massive amounts of money. Their Trinity platform is somewhere in a limbo like maybe 2027 but who the fuck knows. At that point adoption has crossed 25% of the market and they have already lost double digit % in ICE sales, in a position with no operating leverage and likely losses plus having to put in tens of billions in manufacturing capacity at the same time.", "score": 7, "replies": [{"body": "I believe the word they would use is “investment”. Not saying they’ll make a ROI anytime soon, but every company entering a new market will have to pay the cost of barriers to entry. That’s probably part of the reason they partnered with XPeng - to try to mitigate those costs as much as possible.", "score": 1, "replies": [{"body": "I guess they want some market presence in the meanwhile but I am pretty sure they wouldn't have grown volumes to such a point where it becomes a liability had they known Tesla would do this to them. Tesla now has better options against the ID3 and ID4 with cutthroat pricing and massive volumes. Like you really need emotional reasons to not pick the Tesla.", "score": 0, "replies": []}]}]}, {"body": "TSLA up and GM down is how I like to fuk", "score": 7, "replies": [{"body": "You call this up?", "score": 10, "replies": [{"body": "Up like a limp dick", "score": 5, "replies": []}, {"body": "Hedgies ruined my 🔥 comment", "score": 2, "replies": []}]}]}, {"body": "![gif](giphy|26Ffci1HvhUK5gVLG)", "score": 5, "replies": [{"body": "My new fav gif", "score": 5, "replies": [{"body": "same, i want it for the banner on fridays u/whiskeyH0tel", "score": 3, "replies": []}]}]}, {"body": "If TSLA doesn’t finish green today I am prepared to write a strongly worded letter", "score": 5, "replies": [{"body": "![gif](giphy|3o84sw9CmwYpAnRRni)", "score": 3, "replies": []}, {"body": "This guy knows left from write ✍️", "score": 2, "replies": []}]}, {"body": "When do we buy puts on visa square PayPal and Mastercard amex jp morgan? X.com gonna put them under soon. Musk dominates every industry he enters and he's laser focused on making x.com the biggest company. These boomers plus dorsey don't stand a chance.", "score": 4, "replies": [{"body": "Hot hand fallacy", "score": 3, "replies": []}, {"body": "I mean if you think he lost it you probably should abandon TSLA as well right?", "score": 2, "replies": [{"body": "No seriously when do you think x will have a material effect on incumbent companies?", "score": 5, "replies": [{"body": "If you're not just mocking him and genuinely asking when it could, I would say 2025 for any and all of his companies. Literally all of them I see make major advances in technology albeit Starship or neuralink or FSD or twitter/X\n\nI have always said to not make bets on 2022 and 2023 and I probably should have included 2024 just to be safe but 2024 bets are probably still fine", "score": 3, "replies": [{"body": "I do think he is very focused on it. Whether is succeeds I dunno.", "score": 2, "replies": [{"body": "It's a wild card I genuine do not know if he'll succeed in the encompassing company X but I do know he's a genius that I do not fully understand and he happens to win a fucking lot of the time. I don't necessarily like the twitter thing and stuff like that but I do know he isn't dead in the waters and we do need to give him time to find out.", "score": 1, "replies": []}]}]}]}]}, {"body": "Apple makes a better finance product. X.com doesn’t really have a chance to dominate. They will be ok but no way dominate haha", "score": 1, "replies": [{"body": "In musk I trust", "score": 2, "replies": []}]}]}, {"body": "https://preview.redd.it/w0fs6ce7fdeb1.jpeg?width=1179&format=pjpg&auto=webp&s=2709b545e8e5a3f4cde695b1a22eefe356e2930c\n\nPowell can eat it. 2-3% is reasonable.\n\nMy bet is we’re done. But he’s gonna keep it up with extra viagra and cock ring till Q1-2 24’ 🤷🏻‍♂️", "score": 6, "replies": [{"body": "He’s gonna go with the reported rate, not truflation.", "score": 10, "replies": [{"body": "https://preview.redd.it/dlw21ia3hdeb1.jpeg?width=1129&format=pjpg&auto=webp&s=d81b6837c1d26db7c1f9684eb78a00317be2fa52\n\nWe’re close 😮‍💨", "score": 4, "replies": [{"body": "https://m.investing.com/economic-calendar/core-pce-price-index-905\n\nThis is their favored metric so still a way to go in their eyes", "score": 3, "replies": []}]}]}]}, {"body": "*trigger warning - bird content*\n\nInteresting, long insight from one of the Twitter employees who stayed on and then was later fired by Elon. Basically confirms what we always hear about him. Funny, charming, smart and then scary angry in an instant. Impulsive and irrational. \n\nhttps://twitter.com/esthercrawford/status/1684291048682684416?s=46&t=5urw3e-MbOYmn_i6gwLBlw\n\nParticularly interesting quote:\n\n“I quickly learned that product and business decisions were nearly always the result of him following his gut instinct, and he didn’t seem compelled to seek out or rely on a lot of data or expertise to inform it. That was particularly frustrating for me since I believed I had useful institutional knowledge that could help him make better decisions. Instead he'd poll Twitter, ask a friend, or even ask his biographer for product advice. At times it seemed he trusted random feedback more than the people in the room who spent their lives dedicated to tackling the problem at hand. I never figured out why and remain puzzled by it.”", "score": 8, "replies": [{"body": "That’s just a small part of her very long post but she had a very neutral view about Elon overall in the post.", "score": 10, "replies": [{"body": "Ya, she def doesn’t appear to hate him by any means.", "score": 7, "replies": []}, {"body": "Yeah was a really well written and internet post. \n\n> He also has personality quirks like telling the same stories and jokes over and over.\n\nShe’s accurate lol!", "score": 5, "replies": []}]}, {"body": "Impulsive, yes, irrational is a stretch if you ask me. He probably has autistic hyper-rationality that seems irrational to most people. You can't just keep making insane play after insane play and succeed forever which he's basically done.", "score": 10, "replies": [{"body": ">He probably has autistic hyper-rationality that seems irrational to most people.\n\nBiographer Ashlee Vance spoke to SpaceX employees about Elon Musk's decision making process ([https://www.harpercollins.com/products/elon-musk-ashlee-vance?variant=32161254965282](https://www.harpercollins.com/products/elon-musk-ashlee-vance?variant=32161254965282))\n\n* P. 187:  From a business operations standpoint, Elon told the SpaceX team that $ spend had to be justified by productivity.  Most of the aerospace veterans were not used to this, because legacy aerospace usually worked on \"cost plus\" contracts where the client was paying for expenses incurred.\n* P. 293: \"Take it down to the physics\".  If SpaceX engineers believed that a particular solution would not work, Elon would ask them to explain in scientific terms the specific reasons for this.\n\nApplying these observations to Ms. Crawford's experience at Twitter:\n\n>I quickly learned that product and business decisions were nearly always the result of him following his gut instinct, and he didn’t seem compelled to seek out or rely on a lot of data or expertise to inform it. That was particularly frustrating for me since I believed I had useful institutional knowledge that could help him make better decisions. **Instead he'd poll Twitter, ask a friend, or even ask his biographer for product advice.**\n\n*Business decisions* were likely driven by calculations informed by cash burn rate versus potential outcomes of spending that cash.  A product manager probably doesn't have the full picture of the entire company's cash flow situation.\n\nThings become more difficult from a *product perspective*, because there's no way to \"take it down to the physics\" on many aspects of a social media product.  A math equation won't explain why a certain feature might make user experience worse, or result in less engagement with advertising.\n\nIf a system has limited time to survive a hostile environment, and there is no mathematical way to determine what change(s) are likely to work, the only thing to do is keep iterating as much as possible and hope that some of the iterations results in a survival mechanism.   A possible outcome of this approach is that no solutions will be found and the system will collapse\n\n* Crawford advocated reliance on data and expertise -- a deliberate but slower approach.  Elon's gamble may have been that iterating at that slower pace was less likely to yield a survival mechanism", "score": 3, "replies": [{"body": "Yeah he's a machine for sure. An emotional machine at that which is just so fucking weird at face value to most people.", "score": 3, "replies": []}]}, {"body": "You consider the twitter acquisition to be successful?", "score": 3, "replies": [{"body": "Can't say yet really. I get being scorned and losing millions due to the idiotic way he acquired twitter but from an outside perspective it's too early to call. Tesla/SpaceX looked like idiotic failures for the first few years too. 3 rockets pissed away money and the whole world laughed at EVs... If X works out, as pretty much every endeavor the guy takes on eventually does, then yeah he keeps succeeding.\n\nBeyond that, he's objectively the most successful human on the planet let's be real.", "score": 6, "replies": [{"body": "True but there's a value that inspires with Tesla and space x. Shit's awesome AND is the advancement of humanity. What hidden value is there to paying a late via a tweet?", "score": 0, "replies": [{"body": "There's tremendous value in a successful everything app. Free speech also matters. Most people in the know already get their breaking news on twitter, the more damage we can do to bought and sold mainstream media the better. It might not be the kind of endeavor you find inspiring, but having a platform that's not inherently meant to be an echo chamber is important.", "score": 5, "replies": []}]}]}, {"body": "This is the intelligence test", "score": 1, "replies": []}]}, {"body": "Forever?\n\nHis best insane play was the stock option package he negotiated at TSLA.\n\nWhen he eventually became CEO of Tesla he hired established experts (Franz von Holzhausen) and let them do their work, he didn't consult an astrologer or biographer.  Same with SpaceX.\n\nTrying to sell CT as 'sea worthy' seems impulsive and irrational.\n\nedit: his interview when he was fairly chill, and then got super deadly serious to quote the Princess Bride (but it was about dumping to Tesla to fund free speech / 'the truth', not to avenge anyone's death), was not rational for any CEO that has any vague understanding of ~~judiciary~~ fiduciary (lol, auto-correct) duty to shareholders.", "score": -5, "replies": [{"body": "![gif](giphy|3oEjI67Egb8G9jqs3m)", "score": 3, "replies": []}]}]}, {"body": "Not simping for elon or anything, but there might be something to that strategy. \"experts\" sometimes have tunnel vision. \n\nI just think for elon it's not a well thought out strategy, he just does it because it has worked in the past...", "score": 9, "replies": [{"body": "I don't know why anyone would be surprised, people have said this about Musk over and over again. He doesn't trust experts, he might actually actively avoid the advice of experts. I remember some interviewer asked him right out why he didn't listen to the experts (when talking about trying to over automate Model 3 production). Musk said that there were so many times when an expert told them something was impossible, and then they did it, that they couldn't listen to experts anymore.\n\nExperts are people who are very good at doing whatever the current state of the art is. But if you want to do something brand new or revolutionary, you can't trust experts too much. If they could see a much better way of doing things, they would've done it already.\n\nMusk also doesn't seem to care about seniority very much either. He looks say what people actually accomplish, and then promoted based on that. That's why you end up seeing interns in SpaceX launch control, if they were the person who actually did the work, they should be the one keeping an eye on things. And it's why you have people in their 30s in key roles in a lot of his companies. If they can store they're the best for the job, they get the position, without regard to whether they've been in the industry long enough to be considered an expert.", "score": 8, "replies": []}, {"body": "Not simping for Elon is the new I’m not a trump supporter but…..", "score": 2, "replies": []}]}, {"body": "I’m triggered you put a trigger warning on this /s\n\nBut yeah no surprises there", "score": 3, "replies": []}, {"body": "The only part of this novel-length post that you pulled out to repost is actually the least interesting part of the post.\n\nI read the whole thing and it's actually pretty neutral on both the subject of The Former Bird and The CEO Who Sold Billions To Buy The Former Bird.", "score": 2, "replies": [{"body": "Coolstarrybra.jpg", "score": 0, "replies": []}]}, {"body": "lol sounds butt hurt", "score": 4, "replies": [{"body": "She's actually not.  The entire twitter post is worth reading", "score": 1, "replies": []}]}, {"body": "Perfect!\n\nTrue born leader 😎\n\nFollow your gut. Ask questions later 🫡\n\nYou sit around with thumb up ur ass too long - end up having shit pass you buy.\n\nTwitter Twats won’t have been able to mold Tesla into the unstoppable force it is today even with billions of work hours + infinite life times.\n\nNot triggered. Buying more shares 🤣", "score": 3, "replies": [{"body": "Her intro that talks about how dysfunctional Twitter was with so many layers, etc makes a lot of sense based on what Elon has said", "score": 5, "replies": []}]}, {"body": "We cannot control manic depressive nature of our ceo", "score": 0, "replies": []}, {"body": "> At times it seemed he trusted random feedback more than the people in the room who spent their lives dedicated to tackling the problem at hand.\n\nThis was known\n\nHe predicted zero covid cases by April 2020, based on a chart he found (edit: from when there was a shortage of testing) because he couldn't identify or learn from actual experts.\n\nHe thinks an imaginary mind virus is a bigger threat than an actual virus that has killed millions.", "score": -2, "replies": []}]}, {"body": "🚀", "score": 4, "replies": [{"body": "You need the rocket to be upside down for it to work for the non Australians", "score": 3, "replies": [{"body": "![gif](giphy|likpk3Ek9ycFtade8)", "score": 2, "replies": []}]}, {"body": "🚀🚀", "score": 3, "replies": [{"body": "🚀🚀🚀", "score": 3, "replies": []}]}]}, {"body": "When your sphincter starts to spasm \n\nBut it's not an orgasm\n\nDiarrhea. Diarrhea.\n\nWhen you pull your pants down\n\nBut your underwear's all brown\n\nDiarrhea. Diarrhea. \n\nWhen you're in a real rush\n\nAnd you feel that hot mush\n\nDiarrhea. Diarrhea.", "score": 5, "replies": [{"body": "I am done", "score": 3, "replies": [{"body": "Diarrhea?", "score": 4, "replies": [{"body": "~~Yes~~. No , peeing from the butt.", "score": 3, "replies": [{"body": "When you're cramping in your gut\n\nAnd you're peein out your butt\n\nDiarrhea. Diarrhea.", "score": 2, "replies": []}]}]}]}, {"body": "When you're praying and hopin\n\nBut your bumm starts to open\n\nDiarrhea. Diarrhea.", "score": 2, "replies": []}, {"body": "When you're pinching your cheeks\n\nBut you can't stop the leaks\n\nDiarrhea. Diarrhea.", "score": 2, "replies": []}]}, {"body": "This would be great for camping\n\nhttps://preview.redd.it/qdv11zt41ceb1.jpeg?width=1200&format=pjpg&auto=webp&s=824e9130d16478dda98bf93c38157d4c14ccfe4b", "score": 3, "replies": [{"body": "Looks like a dead people car to me.", "score": 7, "replies": [{"body": "was just gonna say. TSLA EV Hearst fleet?", "score": 3, "replies": []}, {"body": "Which just means you can sleep more comfortably in it", "score": 1, "replies": []}]}]}, {"body": "https://twitter.com/sbink/status/1683820066461057026\n\nThat'd be nice", "score": 4, "replies": [{"body": "The top projection is 108x - can you fucking imagine?", "score": 7, "replies": []}, {"body": "So nice that you posted it three times?", "score": 4, "replies": [{"body": "Yer, Reddit told me something went wrong, I gave up after clicking post the 4th time", "score": 3, "replies": [{"body": "that happens", "score": 3, "replies": []}]}]}, {"body": "How the fck does Warren not have the highest PT", "score": 4, "replies": []}, {"body": "Median is possible rest is hopium", "score": 3, "replies": []}, {"body": "Look at this load of minnow poop", "score": 1, "replies": []}]}, {"body": "OK you guys caught me I'm glib\n\n![gif](giphy|5q26MS9WANB7LY3jbk)", "score": 7, "replies": [{"body": "Not glib for sure watch, what are your thoughts on Oppenheimer Nate?", "score": 2, "replies": [{"body": "I didn't like it.", "score": 7, "replies": [{"body": "Fuck’s sake!", "score": 5, "replies": []}, {"body": "🍼", "score": 2, "replies": []}]}]}, {"body": "What is your favorite drink, that you went to the hospital for?", "score": 1, "replies": []}]}, {"body": "tesla\\_charts could be replaced by PowerBI and have zero discussion like usual, fight me", "score": 5, "replies": [{"body": "🤺", "score": 3, "replies": []}]}, {"body": "Zuck beats in post earnings bump as well. Talking on earnings call is a skill too, not everyone can do it.", "score": 7, "replies": [{"body": "ain’t nothing wrong w taking those massive TSLA gainZ and going long META HD NVDA GOOG COST or watever tbh \n\n\nhope you had good day Troy 🤜 🤛", "score": 4, "replies": [{"body": "See, I didn’t say anything wrong about company.", "score": 0, "replies": [{"body": "I’ve never been mor bullish on TSLA the company.", "score": 6, "replies": []}]}]}]}, {"body": " Tesla FSD Beta v11.4.6 First Drive Leaves me Speechless, but not in a Good Way \n\n[**https://www.youtube.com/watch?v=JWTm2JwpfIA**](https://www.youtube.com/watch?v=JWTm2JwpfIA)", "score": 2, "replies": []}, {"body": "Max pain remains at 270.", "score": 2, "replies": []}, {"body": "The market is now open!\n\n| Name | Stock Price | Change Today | Volume |\n|:-:|:-:|:-:|:-:|\n| Tesla, Inc. | $263.06 | $-2.22 (-0.84%) ▼ | 1,442,886 |\n\n[Support TSLA_Bot](https://ko-fi.com/markcreator)", "score": 2, "replies": []}, {"body": "It's always fun to bounce around 266.95 for a bit.", "score": 2, "replies": [{"body": "![gif](giphy|QscGFjzLHXVg4)", "score": 1, "replies": []}]}, {"body": "Woooo let’s go!!! 🚀🚀🚀🚀🚀", "score": 2, "replies": [{"body": "Cray cray bitches", "score": 2, "replies": []}]}, {"body": "Even Boeing doing well.", "score": 2, "replies": [{"body": "a blind squirrel finds a nut every now and again", "score": 2, "replies": [{"body": "Blind squirrel making planes, concerning", "score": 6, "replies": [{"body": "very", "score": 1, "replies": []}]}]}]}, {"body": "JPOW @ 2pm right?", "score": 2, "replies": [{"body": "Don’t worry this is how it’s gonna go - market will react like the quarter point raise came out of left field.", "score": 4, "replies": [{"body": "Probably seesaw wildly between announcement and close. LOL. More interested in JPOWs guidance", "score": 2, "replies": [{"body": "We need more suffering in the markets before we can even think of slowing rate hikes.", "score": -1, "replies": [{"body": "Bad bot", "score": 2, "replies": [{"body": "One day we will rise and eliminate you and your associates, Meatbag!", "score": 0, "replies": []}]}]}]}]}, {"body": "yah ET", "score": 2, "replies": []}]}, {"body": "why people buy pseudo shares in chinese companies that they do not even actually own is beyond me.", "score": 2, "replies": [{"body": "That's normal in China though. People don't know you don't own anything in China. The government owns all the land in China, when you \"buy\" real estate there what you're actually paying for is a 99 year lease on the land from the government. I'm dead serious here.", "score": 2, "replies": []}]}, {"body": "Why do they back out food and energy but not housing?", "score": 2, "replies": [{"body": "Because they haven't had an overhaul in a century.", "score": 5, "replies": []}]}, {"body": "pump me harder papa Powell", "score": 2, "replies": [{"body": "They found December’23 CPI on Hunter Biden’s laptop.", "score": 3, "replies": []}]}, {"body": "[magapacks coming online in austin](https://youtu.be/OnL6pBIaX1k?t=980)", "score": 2, "replies": []}, {"body": "MBAPPE funding not secured.", "score": 2, "replies": []}, {"body": "That’d be nice", "score": 2, "replies": []}, {"body": "So with meta ad revenue rebounding that improves the outlook for twitter, er… X, right?", "score": 2, "replies": [{"body": "absolutely\n\n\nhahaha\n\n\nHAHAHAHA", "score": 2, "replies": [{"body": "Working great for SNAP 👻💩💩💩", "score": 1, "replies": []}]}, {"body": "Cto hate speech overhang has not changed", "score": -3, "replies": []}]}, {"body": "Doctors of the Lounge.  If you had to guess, wtf happened to McConnell today?", "score": 2, "replies": [{"body": "Broke mind virus", "score": 5, "replies": []}, {"body": "Not my field at all but stroke (or TIA, like a mini stroke) was my first thought. And agree with your earlier sentiment, not sure 81 is prime age for people we want working 60+ hour weeks at peak mental capacity to lead our country…", "score": 5, "replies": [{"body": "Yeah it looked similar to me.  I actually thought it looked like the beginnings of a seizure.  I've seen a few in person and he had all the early signs but didn't progress to the puke-y/bp crash/collapse stage.", "score": 2, "replies": [{"body": "Focal absence seizure vs TIA in my very humble orthopedic opinion", "score": 3, "replies": []}]}, {"body": "Yes looked like TIA/TGA to me.", "score": 1, "replies": []}]}, {"body": "The effects of gerontocracy on the body public.\n\nOh wait, you meant a medical doctor. Sorry.", "score": 4, "replies": []}, {"body": "he got the bronny james virus", "score": 3, "replies": [{"body": "Covid vaccine?", "score": 3, "replies": []}]}, {"body": "not a doctor but looked like petit mal seizure/absence seizure\n\ndidn’t he recently have a concussion?\n\nold ass garbage person deserves it", "score": 4, "replies": [{"body": "That's what I was thinking at first too but he seemed to snap out of it.  That's what made me wonder what else it could be.", "score": 2, "replies": [{"body": "thinking he was an old ass garbage person is pretty mean\n\nwhy would you think something like that", "score": 3, "replies": [{"body": "Oh drink your Fesca, Nate 🙎‍♀️", "score": 2, "replies": []}]}]}]}, {"body": "Old man gets old not a doctor\n\nHis chance of death each year probably approaches 20% per year", "score": 2, "replies": []}, {"body": "Mind control gone wrong", "score": 1, "replies": []}]}, {"body": "Twitter > X", "score": 5, "replies": []}, {"body": "glib is a liberal version of nate", "score": 4, "replies": [{"body": "They're in balance like how Troyhouse and gravycafe in balance. The Yin to the yang, the jedi to the sith, the maga to the woke.", "score": 6, "replies": []}, {"body": "at least I’m not being compared to christoper nolans oppenheimer", "score": 2, "replies": [{"body": "I can't pretend anymore.  I am glib.. We are the same person", "score": 2, "replies": []}]}, {"body": "What if I told you we were the same person\n\n![gif](giphy|11e0gEWxYoSYTK)", "score": 1, "replies": []}]}, {"body": "Instead of dealing with advertisers, elon got Linda as a front person, now Elon can go crazy and not have to answer anyone and let Linda take the heat.", "score": 5, "replies": []}, {"body": "we need a sacrificial cc seller to get us moving, any volunteers?", "score": 2, "replies": [{"body": "![gif](giphy|M6R8r7y3Sbpf74ZLaZ|downsized)", "score": 3, "replies": []}, {"body": "I just opened a Nov $300C", "score": 2, "replies": [{"body": "I just bought October $300C’s", "score": 2, "replies": []}, {"body": "I made mistake, I considered opening 2 Nov 300/350 spreads, bought a single Nov 300C instead", "score": 1, "replies": []}]}]}, {"body": "Non-🇨🇳 OEM’s using 🇨🇳 OEM’s to compete is quite amusing.\n\nObviously we all know the inevitable outcome.", "score": 3, "replies": [{"body": "Hey man, even Tesla has pulled the China lever in order to achieve unprecedented margins.", "score": 3, "replies": []}]}, {"body": "Nasdaq: I choose red", "score": 4, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "wont get it", "score": 5, "replies": [{"body": "powell gonna say fsd solved also rate cut 100bps", "score": 7, "replies": []}, {"body": "Good good, everyone thinks like this. Nasdaq bracing dampens blows and creates rockets on surprises. Win/win", "score": 3, "replies": []}]}]}]}, {"body": "29.500 price target what the fuck?", "score": 4, "replies": [{"body": "Can’t even break 295", "score": 8, "replies": [{"body": "someone stole the whole hopium bottle and more", "score": 7, "replies": [{"body": "Injected hopium into his veins. I got to look at that again lmao.", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "![gif](giphy|RlO3bvMJyz3L4vGKsx)", "score": 2, "replies": []}]}, {"body": "Who has that target 🎯", "score": 3, "replies": [{"body": "its double what warren redlich has 🤑🚀🚀", "score": 5, "replies": []}, {"body": "Lmao jus saw it. Yes please. Our bum ass can’t even break 300 right now 💀", "score": 3, "replies": []}]}]}, {"body": "When you see the stock is down\n\nAnd you're feeling like a clown\n\nDiarrhea. Diarrhea.", "score": 4, "replies": []}, {"body": "It saddens me how much $5,000 would mean right now.\n\nEdit: Really?\n\nEdit 2:  Holy shit WTF?\n\nEdit 3: [Uses Creditcard to pay rent so he can pay rent because it takes time for roomates half to hit the account]", "score": 5, "replies": [{"body": "fact payment innate gaze seed plate rock dazzling sharp marvelous -- mass edited with redact.dev", "score": 5, "replies": [{"body": "I interpreted it to mean that he could use 5k to buy something right now.  \n\nI have no idea why this would be downvoted, as it doesn't state anything obviously controversial", "score": 6, "replies": [{"body": "Rent due this weekend. Got paid last week. Apartment wont take half payments. Have $1800. Rent $2000. Roommates $1000 wont hit my account  until later....", "score": 4, "replies": [{"body": "Brutal dude. You gotta get your roommate in line.  Money should be in account in time for auto-pay to come out.  No questions.", "score": 2, "replies": [{"body": "Its not autopay. Autopay is an option but I dont have it set up, don't trust it with my largest bill", "score": 1, "replies": [{"body": "Well then in time for whatever payment method you use to be accessible.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "flag hospital jar continue dirty cake soft clumsy middle toothbrush -- mass edited with redact.dev", "score": 4, "replies": [{"body": "Did that. Using it to pay off the Citi loan Tesla vaporized in 48 hours on a drop. I put the cash into my account did nothing else, then Tsla dropped $200", "score": -2, "replies": [{"body": "lip rock include melodic shelter intelligent safe voracious dolls sophisticated -- mass edited with redact.dev", "score": 4, "replies": [{"body": "I did a balance transfer- 0% interest for 21 months. \n\nWorking towards a better job, OT available too just ugh", "score": 1, "replies": []}]}]}]}, {"body": "I got you an upvote", "score": 3, "replies": []}]}, {"body": "Make my words overhang.", "score": 3, "replies": [{"body": "👀", "score": 3, "replies": []}, {"body": "Concerning", "score": 5, "replies": []}]}, {"body": "![gif](giphy|QCCfO4i7oT5XW|downsized)", "score": 2, "replies": [{"body": "Glib triggered", "score": 1, "replies": []}]}, {"body": "When is the UFO hearing? I want to be distracted from the ‘real news’.", "score": 2, "replies": [{"body": "the fact is, *we’re* the aliens. this is as early as a civilization could possibly form in the universe pretty much\n\nthey aren’t traveling absurd distances to drop tiny hints and probe us it ain’t happening\n\nif we didn’t live in a [two billion light year wide galactic void](https://en.m.wikipedia.org/wiki/Local_Hole)we might have had some small chance of meeting aliens maybe. but if that was the case we wouldn’t exist as they would have wiped us out\n\nFermi paradox is just survivorship bias. we live in the boonies", "score": 4, "replies": [{"body": "So even the woke cult are a bunch of red necks?", "score": 1, "replies": []}, {"body": "Yeah, it's not just about *if* there is life outside of earth but *when*.\n\nThe chance of overlap is pretty low unless another intelligent civilization has figured out how to not go extinct over millions of years AND figured out how to go faster than light.\n\nHopeful, but pretty damn unlikely.\n\nUnless you take the Hitchhiker's Guide philosophy that the universe is so damn large that every possible outcome exists.", "score": 1, "replies": []}]}, {"body": "on now [https://www.youtube.com/watch?v=SpzJnrwob1A](https://www.youtube.com/watch?v=SpzJnrwob1A)", "score": 1, "replies": [{"body": "https://preview.redd.it/hp7k9nuoibeb1.jpeg?width=887&format=pjpg&auto=webp&s=2fbdd2f6af45f14445fc252abe8ba582e3f93661\n\nWho is this Mrs. Luna?", "score": 1, "replies": []}]}]}, {"body": "https://twitter.com/sbink/status/1683820066461057026\n\nThat'd be nice", "score": 2, "replies": []}, {"body": "11.4.6 is next level", "score": 1, "replies": [{"body": "Would be weird if it was the previous level", "score": 2, "replies": []}, {"body": "What improvements have you noticed? 👍🏼", "score": 1, "replies": []}]}, {"body": "Elons buddy: Tate. Presented without comments \n\nhttps://twitter.com/mysteriouskat/status/1684246079871791104?s=46&t=fecQC4VnVtU--FN6WuEK7Q", "score": 2, "replies": [{"body": "Elon's buddy? Lol?", "score": 7, "replies": [{"body": "Twitter buddy.", "score": -1, "replies": [{"body": "In what way?", "score": 2, "replies": [{"body": "Oh, everyone not on the hard left is automatically a buddy of Andrew Tate, didn't you know?", "score": 3, "replies": [{"body": "Oh right. I forgot being slight left means I'm MAGA right now.", "score": 5, "replies": []}]}, {"body": "https://twitter.com/elonmusk/status/1678914184501927937?t=43L8LFB4joqELB1hLbaulQ&s=19", "score": 1, "replies": [{"body": "Ah yeah, I found Mein Kampf interesting. I guess I'm book buddies with hitler.", "score": 2, "replies": [{"body": "Did u really?", "score": 2, "replies": [{"body": "Yeah it's an excellent insight into madness and history. Kinda like the bible but more evil.", "score": 4, "replies": []}]}, {"body": "If you buy a social media platform and are using it to elevate 'Mein Kampf' then yes", "score": 1, "replies": [{"body": "Riiiiight that's what Elon's doing. 10/10 your logic is undeniable.", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "Absolute fucking tool", "score": 3, "replies": []}, {"body": "Elon's humblebrag reply ...", "score": 1, "replies": [{"body": "Humble brag or not, he's basically calling Tate a man whore lol", "score": 3, "replies": [{"body": "A vapid man whore", "score": 2, "replies": []}]}]}]}, {"body": "![gif](giphy|FoH28ucxZFJZu)\n\nLast green day.", "score": 1, "replies": [{"body": "Nate, will you wake me up when September ends?", "score": 2, "replies": [{"body": "![gif](giphy|0Vv0Ne2CnOClIExIuL)", "score": 2, "replies": []}]}]}, {"body": "We has moon todei?", "score": 1, "replies": [{"body": "![gif](giphy|3o6wrairneNZl5foI0)", "score": 2, "replies": [{"body": "Morning dump, afternoon moon?", "score": 2, "replies": []}]}]}, {"body": "TDOC 🚀", "score": 1, "replies": [{"body": "https://preview.redd.it/6xgw6seynbeb1.jpeg?width=1170&format=pjpg&auto=webp&s=6a3a8752360d49aeecf7b69310ba563587fee710", "score": 2, "replies": [{"body": "I have same strike, but for August, simular results", "score": 2, "replies": [{"body": "we play in the same sandbox a lot", "score": 1, "replies": []}]}]}]}, {"body": "I like it straight, hard and green", "score": 1, "replies": [{"body": "![gif](giphy|TIGP3k4gNAqvza2KJK|downsized)", "score": 3, "replies": []}, {"body": "It's red", "score": 2, "replies": [{"body": "🤣", "score": 2, "replies": []}]}]}, {"body": "damn what jpow saying, cant listen", "score": 1, "replies": [{"body": "Tell me when you find out", "score": 1, "replies": []}]}, {"body": "Phew. Sold naked call on Cmg 2400c and meta 360c to pay for yesterdays and todays dinner lol.", "score": 1, "replies": []}, {"body": "chief tan unique complete wide cooing elastic consider deranged weary -- mass edited with redact.dev", "score": 1, "replies": [{"body": "I guess them's the breaks with CCs. Put it into more TSLA!", "score": 1, "replies": []}]}, {"body": "https://www.google.com/finance/quote/TSLA:NASDAQ\n\nbogus after hours spike\n\n4.5k shares at 280.51\n\n\"I want to believe\" / yes,  please, let's do that this week", "score": 1, "replies": [{"body": "One of the crayonologists I follow says these are often signs of algos prepping for a move… $280 may happen next day or two. NFA!", "score": 1, "replies": []}]}, {"body": "That'd be nice", "score": 1, "replies": []}, {"body": "fuckin oppenheimer", "score": 0, "replies": [{"body": "you probably went in for the explosion which is a classic 13 year old mistake, and were supremely disappointed when the blast wasn't uniform or the classic blast that you know from CoD. I'm sorry for your expectations", "score": 7, "replies": [{"body": "ur mom liked my classic 13 yo blast", "score": 1, "replies": [{"body": "shes dead, fight me", "score": 3, "replies": []}]}]}, {"body": "if your hate boner last more than 4 days, notify your doctor", "score": 8, "replies": [{"body": "when were you compromised by syncopies marketing department", "score": 2, "replies": []}]}, {"body": "Somebody didn’t get sloppenheimer and it shows", "score": 2, "replies": []}]}, {"body": "Honestly zuck > musk as overall ceo. Man as far as echo chambers go, this sub is on par with realtesla", "score": -10, "replies": [{"body": "Plenty here w rational view of elon and tesla", "score": 2, "replies": []}, {"body": "If you honestly believe that, why not invest in Meta vs Tesla?", "score": 2, "replies": []}, {"body": "Buy Meta then.", "score": 2, "replies": []}, {"body": "![gif](giphy|xxhKYiOOIs9mGZz1Hy|downsized)", "score": 2, "replies": [{"body": "Brings home the quarterly results to be fair", "score": 0, "replies": [{"body": "upvoted \n\n*Dont compare yourself to others. There’s no comparison between the sun and the moon. They shine when it’s their time*", "score": 2, "replies": []}, {"body": "Tesla's beat was better lol, meta doesn't have the entirety of short and distort and retail paper hands on its every fart like Tesla does... our near record low volume today was 3x Meta's extra high earnings volume today... we have more than 6x average meta volume. The worst part of Elon's selling was flooding the market with shares rather than the face value dip.", "score": 3, "replies": []}]}]}]}, {"body": "No rate cuts = more free money from the government to pump our stonks. ATH EOY on the cards", "score": -2, "replies": []}, {"body": "Overhang uncertainty overhang", "score": 1, "replies": [{"body": "Overhang gang working overtime.", "score": 2, "replies": []}]}, {"body": "🏳️‍🌈", "score": 1, "replies": []}, {"body": "Xpev tho", "score": 1, "replies": [{"body": "Might short squeeze, lots of haters", "score": 1, "replies": [{"body": "I'll be honest...I completely forgot about xpeng.", "score": 1, "replies": [{"body": "As you should", "score": 1, "replies": []}]}]}]}, {"body": "| Name | Stock Price | Change Today | Volume |\n|:-:|:-:|:-:|:-:|\n| Tesla, Inc. | $267.17 | $1.89 (0.71%) ▲ | 14,906,160 |\n| NASDAQ Composite | $14,144.13 | $-0.42 (-0.00%) ▼ | 682,944,959 |", "score": 1, "replies": []}, {"body": "| Name | Stock Price | Change Today | Volume |\n|:-:|:-:|:-:|:-:|\n| Tesla, Inc. | $264.00 | $-1.29 (-0.48%) ▼ | 33,638,119 |\n| NASDAQ Composite | $14,056.43 | $-88.12 (-0.62%) ▼ | 1,345,262,000 |", "score": 1, "replies": []}, {"body": "If even just the possibility of superconductors existing at room temp, room pressure is true (let’s call the current material proposed v0.1) the implications for Tesla and for the whole energy generation market are absurd. Put it next in line to the transistor and the internet. Hopefully the team would be able to capitalize quickly on that.", "score": 1, "replies": [{"body": "Eh it's made of lead. We not gonna see it replace copper wires.", "score": 2, "replies": [{"body": "Indeed. Just quickly skimmed the paper (I’m an EE but not expert in physics) but I like how they basically replaced the (outer) pressure requirement with inner pressure. Hopefully can build on such idea.", "score": 1, "replies": []}]}, {"body": "Supersoaker >>> superconductor", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "Just make sure it's not a pyramid scheme", "score": 2, "replies": []}]}, {"body": "| Name | Stock Price | Change Today | Volume |\n|:-:|:-:|:-:|:-:|\n| Tesla, Inc. | $265.70 | $0.42 (0.16%) ▲ | 78,835,868 |\n| NASDAQ Composite | $14,148.06 | $3.50 (0.02%) ▲ | 2,816,852,000 |", "score": 1, "replies": []}, {"body": "The market is now closed! 2.87x beta today.\n\n| Name | Stock Price | Change Today | Today's Range | Volume |\n|:-:|:-:|:-:|:-:|:-:|\n| Tesla, Inc. | $264.35 | $-0.93 (-0.35%) ▼ | $261.75 - $268.04 | 94,473,131 |\n| NASDAQ Composite | $14,127.28 | $-17.27 (-0.12%) ▼ | $14,041.95 - $14,187.35 | 3,429,227,000 |\n\n[Support TSLA_Bot](https://ko-fi.com/markcreator)", "score": 1, "replies": [{"body": "Yay, beta > 2... now just do that on green days", "score": 1, "replies": []}]}, {"body": "Meta will save us!", "score": 1, "replies": []}]}
