{"title": "Wtf is this?!", "selftext": "How is possible to have this big drop of 27% for TSLA when the market is closed. \n\n\nP.s: Is not the only one", "id": "156erbh", "created_utc": 1690015777.0, "score": 186, "upvote_ratio": 0.82, "num_comments": 84, "comments": [{"body": "Even if it was just a \"bug\", if I was you I'd take my money out of this app and put it somewhere safer... You can't trust anyone this days.", "score": 178, "replies": [{"body": "I'd take my money out of this stock", "score": 50, "replies": [{"body": "[removed]", "score": -2, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "All tech stocks are overvalued", "score": 4, "replies": []}, {"body": "Compare it with BMW .  to show the large tesla bubble size", "score": 3, "replies": []}]}]}]}, {"body": "What is the problem with Revolut? It’s not like it’s a scam. Many regular banks work together with it", "score": -37, "replies": [{"body": "Revolut has been involved in many scandals over the past 4 years. Have a look online. Most of their risk execs are gone.", "score": 48, "replies": [{"body": "Alright I’m gonna take my money out like OP said lmao", "score": 23, "replies": [{"body": "Which country are you based in? I’ll recommend you a reliable broker if you want", "score": 8, "replies": [{"body": "Netherlands", "score": 8, "replies": [{"body": "DEGIRO or Interactive Brokers; Saxo Bank if you don’t mind paying some commission fees", "score": 8, "replies": [{"body": "I’m thinking to moving my funds to DEGIRO once Revolut fixes the problems, thanks!", "score": 8, "replies": [{"body": "If you decide to switch, don’t sell your holdings. Talk with whichever broker you’re going to move to so they can arrange a transfer.", "score": 16, "replies": [{"body": "How about me who lives in Türkiye? hhh", "score": 2, "replies": [{"body": "Interactive Brokers for Turkey.", "score": 2, "replies": []}]}]}]}, {"body": "Hi, can you please  recommend a broker for me 😄\nIm from Croatia and also using Revolut... Im not happy with it. Would like to move but no idea where.\nThanks in advance.", "score": 1, "replies": [{"body": "In your case I would stick to Interactive Brokers. The Croatian stock broker market isn’t as developed unfortunately. In case IB rejects your application stay with Revolut until a better alternative comes to the market. Remember that when choosing brokers the most important things are 1) the fees (these must be very low); 2) regulatory approval (the company must be in tip-top shape; 3) the app (must be easy to use, bc this is how you will mostly interact with your broker)", "score": 6, "replies": [{"body": "Thanks man 😁", "score": 1, "replies": []}]}, {"body": "Yes absolutely, give me a few moments. As a context, I work in wealth management.", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "This isn't investment advice. It's about an app.\n\nHowever, if it were investment advice, I'd jump on that advice right away. After all Jim Cramer likes it.  :-)", "score": 2, "replies": []}, {"body": "“We break the rules because it’s cools” 😎", "score": 1, "replies": []}]}]}]}, {"body": "You gotta be in the know of the companies you invest in sonny", "score": 1, "replies": []}]}]}, {"body": "I’m not saying that it’s a scam but these type of behaviours are suspicious. FTX also worked with banks and many regulators. I’m just saying that in today’s market, people have to be extremely strict and very demanding when it comes to what app they choose to put their money in.", "score": 5, "replies": [{"body": "Yes but this clearly isn’t one of those suspicious behaviors tho. Dunno how long you’ve been trading but I’ve had 2 similar bugs on IBKR over a 7 year period. If you call them they just apologize and promise to fix soon (and they do). Bugs =/= scam. If one of the most popular platforms in the world was literally scamming you 27% one of the biggest companies in the world, trust me it would be quite noticeable", "score": 1, "replies": []}]}, {"body": "On the flip side, what is the advantage of working with it? I’m curious and I’ve never heard of it. Why not use a traditional brokerage account?", "score": 2, "replies": []}, {"body": "Only way to actually own your shares if you drs ( direct registered shares) them and put them in book. Every share is owned by cede and co till you actually take ownership. The sec also just came out with a post about this. And brokers use “street named” shares which actually gives them all the rights to your shares. Also almost all brokers and banks have committed stock market manipulation or fraud.", "score": 1, "replies": [{"body": "Where to learn how to do it?", "score": 3, "replies": [{"body": "It’s pretty easy you can just call your broker and tell them you want to drs your shares how many you want ( depending on the broker it might cost but I know fidelity and td do it for free) you’ll get it sent over to a transfer agent ( depending on the stock will depend on the transfer agent, like computershare). You’ll get a letter in the mail about setting up an account ( shares will be in your name and your ss number) and it usually takes 2-3 days for shares to settle and boom the shares will be in your name and no longer in the corrupt dtcc. \n\nYou can google which transfer agent is for what companies and I just did for Tesla it’s computershare\n\nAlso here is the link for the memo from the sec about drs shares and ownership \n\nhttps://www.sec.gov/about/reports-publications/investor-publications/holding-your-securities-get-the-facts", "score": 3, "replies": [{"body": "I’m currently in process of moving my shares from Revolut to DEGIRO, do you know by any chance if this is doable on DEGIRO?", "score": 2, "replies": [{"body": "All brokers should be able to drs to a transfer agent since transfer agents are the ones whom receive a companies shares and distributes them to the dtcc and other insiders and shareholders", "score": 3, "replies": []}]}]}]}]}]}, {"body": "What’s the app?", "score": 1, "replies": []}]}, {"body": "A bug in the Revolut app. Almost had a heart attack as well for a bunch of other stocks.", "score": 116, "replies": [{"body": "Move away from revolut, they are notoriously bad and will just lock your funds.", "score": 20, "replies": [{"body": "Unfortunately in the UK you get to choose between horrible app experiences, subpar offers and crap like getting your funds locked for long periods of time. And sometimes even all at once, looking at you HSBC. \n\nI’m just using Revolut for the exchange rates and only keep the “fun” money there.", "score": 7, "replies": [{"body": "Wdym? Freetrade, Lightyear..", "score": 1, "replies": []}]}, {"body": "Trading212. Its a good app, honest team and is adding more and more stocks every month.", "score": 2, "replies": []}]}, {"body": "Yesssssssssss", "score": 5, "replies": []}, {"body": "Gosh thank you!!! I checked my account this morning and rushed to Reddit about what is going on, and literally no one spoke about this massive crash. But I opened it again and it’s fine now!", "score": 5, "replies": []}, {"body": "How do you know is a bug, have you seen an official post?", "score": -22, "replies": [{"body": "No other tracker shows the drops. Nobody is panicking. There are no articles anywhere.\n\nEdit: A 27% drop in Tesla, a 13% drop in Meta, a 10% drop in Amazon, a 20% drop in Schwab would show somewhere else.", "score": 54, "replies": [{"body": "Must be NASDAQ rebalancing.", "score": 7, "replies": []}]}]}]}, {"body": "On cnbc last night at like 6, I saw apple scroll and it was down like $12. I checked yahoo finance, and it was only down like $0.45\n\nSame time all the meme basket stocks jumped", "score": 31, "replies": [{"body": "The other day I saw spy drop 6% after hours on yahoo. Might be glitches but seems strange that it keeps happening", "score": 10, "replies": []}]}, {"body": "I cried when I saw my savings vanished in ENVX 😂😂😂 glad to hear it’s a bug", "score": 23, "replies": [{"body": "Yeah but to be honest us envx fanbois didn't have nice two days. And stupid etoro also tends to bug with number displays giving me daily heart attacks. It's like, \"shit, I am 5% down\" - refresh - \"3% up...?\"\n\nAll in all I'm relatively new so I must say it did surprise me for it to get dumped twice in two days despite good news, maybe because financial report is in 5 days and ppl are scared?", "score": 2, "replies": [{"body": "When did you get in?", "score": 1, "replies": [{"body": "$17.6", "score": 1, "replies": [{"body": "Ah recently... I've been thinging about getting in as well", "score": 0, "replies": []}]}, {"body": "My first position was at 13.25, then 16, then 18", "score": 1, "replies": []}]}]}]}, {"body": "I like it better when it’s up.", "score": 5, "replies": []}, {"body": "You are using Revolut?\nAren't their fees outrageous?", "score": 4, "replies": [{"body": "If you have black metal card (which cost around 60$ per year), you don’t have to pay any fees", "score": 0, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Yeah but the black card presumably has other features too..?", "score": 2, "replies": []}]}, {"body": "Nice.", "score": 1, "replies": []}]}]}, {"body": "Man, I got excited and was going to buy more Tesla. But it was just a bug :(", "score": 5, "replies": []}, {"body": "oops", "score": 3, "replies": []}, {"body": "Yup, logoff your account and login back and they say, we’re fixing ‘smth’. No worries, all good", "score": 2, "replies": []}, {"body": "Cvna 11$ omg", "score": 1, "replies": []}, {"body": "Because stock market is daily robbery within closing hours sessions", "score": 1, "replies": [{"body": "Agree.  Happens every quarter 10-13 days before close high value Financial investment companies sell  creating dip in value then they buy back at lower. At least that’s what historical data shows.  I don’t own Tesla , Apple stock is an example of this", "score": 2, "replies": []}]}, {"body": "Trades 24hrs a day now on Robinhood.", "score": -3, "replies": [{"body": "Yes, on select stocks like Tesla, Apple, Google etc. etc. 24 hours a day, only business days though", "score": 1, "replies": []}]}, {"body": "? Tesla is overpriced for a lot, it will crash eventually. It is surviving now because the US doesnt let chinese EV coming into the US market. The chinese EV will eat Tesla in 3 months", "score": -9, "replies": []}, {"body": "a great time to invest, don’t wet self", "score": -4, "replies": []}, {"body": "I look at my portfolio like every 2-3 hours. This would be annoying af for me personally.", "score": 0, "replies": []}, {"body": "It's the German market. Different hours.", "score": 0, "replies": [{"body": "Or maybe not. \n\nAssumed it was TL0 ticker.", "score": 2, "replies": []}]}, {"body": "Lmao you thought tesla should be worth more?", "score": 0, "replies": []}, {"body": "TSLA PT $189 got it", "score": 1, "replies": []}, {"body": "LOL", "score": 1, "replies": []}, {"body": "Justice", "score": 1, "replies": []}, {"body": "If they’ll let you buy at those prices as well as move stocks from their platform to others & vice versa the shown drop may present a nice arbitrage opportunity between the spot prices of different market makers!", "score": 1, "replies": []}, {"body": "A stock chart", "score": 1, "replies": []}, {"body": "Major oppurtunity to buy.", "score": 1, "replies": []}, {"body": "Checked my stock right away lmao", "score": 1, "replies": []}, {"body": "189,22 \n\nThe stock is $260+\n\nWhatever you are looking at makes no logical sense", "score": 1, "replies": []}, {"body": "Yoo I just bought the sell off this freaked me out!", "score": 1, "replies": []}, {"body": "Shiver me timber", "score": 1, "replies": []}, {"body": "People with more rights than you are making business", "score": 1, "replies": []}, {"body": "It means that ur a trader not an investor.", "score": 1, "replies": []}]}
