{"title": "Starlink will soon be a reality. Potential Tesla synergy?", "selftext": "", "id": "bnresb", "created_utc": 1557681421.0, "score": 68, "upvote_ratio": 0.95, "num_comments": 54, "comments": [{"body": "This is more about increasing cash flow at SpaceX and putting another key technology in place for Mars settlement.  You can't understand Elon's strategy without recognizing that he targets markets in energy and transportation in order to bootstrap needed tools and tech for Mars.", "score": 27, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Yeah Kimball is on board", "score": 5, "replies": []}]}, {"body": "The satellites will be obsolete long before there is a settlement on Mars.", "score": -6, "replies": [{"body": "And then there will be even better satellites available, with a proven heritage behind them because of the work being done now.", "score": 3, "replies": []}, {"body": "Then I guess that gives a definitive advantage to the telecoms with their own rockets (that also happen to be reusable) to be able to improve them.", "score": 1, "replies": []}]}]}, {"body": "I think only way to take Tesla private at this point, is space X gets so profitable from these satellites that it'll buy out Tesla some day. Having gwynne shotwell at the helm of Tesla and Elon in  charge of engineering is an investor's wet dream tbh.", "score": 13, "replies": []}, {"body": "Could put Starlink internet provided wifi at Superchargers. This is more likely for the 30-40 stall types with lounges that have roof space they control, but I guess you could put it on top of an enclosure in the gated cabinet area for medium sized supercharger locations (12-24) stalls.\n\nI don't think there is much direct synergy there. You can sell Starlink internet to anyone no matter if they have Tesla Energy or Tesla Auto product or not.", "score": 15, "replies": [{"body": "I mean sure you can sell internet to anyone and that will probably be how they pay for the project to begin with. The point is giving Tesla owners free access to Starlink could act as a demand lever and further grow the Tesla ecosystem.", "score": 2, "replies": [{"body": "You can give them free starlink interenet at two places\n\n* Supercharger\n* Home\n\nYou can't put it in the car to use while on the highway.\n\nIf you give to them at the house they get a minor bonus a few dollars a month vs paying for home internet. Would that increase demand for cars? No, not noticeably so.", "score": 4, "replies": [{"body": "Hmm, wasn't their goal global coverage? I'd imagine they'd have many receivers spread all around.", "score": 3, "replies": [{"body": ">wasn't their goal global coverage\n\nYeah, at every house and business willing to pay. It takes a receiver the size of a pizza box that will have a cable running from it to a router. You could then run internet from the router to your desk/living room by way of fiber optics or copper (CAT6 cabling) or even WIFI.\n\nThat doesn't magically provide internet to cars driving by in the city.\n\nAnd it sure doesn't provide internet to cars out in the open spaces between cities.\n\nThe cables don't reach that far and neither does WIFI.", "score": 6, "replies": [{"body": "Okay thanks for that. So would it not be feasible to at least set up a bunch of hotspots for city wide coverage?", "score": 0, "replies": [{"body": "Some company could do so, the city itself could do so. That just isn't SpaceX or Tesla that will be doing that.\n\nSee https://en.wikipedia.org/wiki/Municipal_wireless_network which already exists in various cities. The vast majority of the cost for such a project is wiring the access points and mounting them on poles all around the city.\n\nAnd it's limited to dense downtown like urban areas or insanely small 1 stop light towns. It isn't city wide for most cities.\n\nNothing Starlink is doing would change that.", "score": 2, "replies": [{"body": "It could simplify the wiring. You'd only need power.\n\nThat said, I think I agree with you this isn't a cost effective way to give Tesla owners WiFi. Instead, they should work on shrinking the receiver.", "score": 1, "replies": []}, {"body": "Why couldn't they also offer municipal WiFi from the satellite base stations?", "score": 1, "replies": [{"body": "Because the base stations only do one thing. They send and receive data from the satellites. And they'll be put on houses and businesses at random as people sign up for service. Not placed for municipal wifi. The place that is best for wifi in the city park isn't the place that provides internet in my basement or bedroom or living room.\n\nThere are too many variables on types and sizes and mounting for wifi access points.\n\nIt's cheaper to just take an off the shelf product that already exists and plug it in to the starlink receiver than to add wifi to a starlink receiver.\n\nAnd sure someone, anyone can buy one of each and put them out there.\n\nThen you get into billing. SpaceX gets money from the customer that pays for the starlink receiver. If you have municipal wifi that's a ton of users not paying SpaceX. How does SpaceX make money building a super complex local network with no payment system?\n\nThink of Comcast or whoever your current cable company is providing free WIFI all over town. The only way they can do it profitably is to limit access to their customers that already have that companies cable at home. They can't afford to open it up to everyone in the city unless the city pays them for it, and if so then the city is taxing you for it.\n\nSo SpaceX can't afford to give away free internet to everyone in a city unless the city pays for it and then you get taxed for it. And even if they did SpaceX has no expertise in ground systems so it'd be cheaper to have a third party setup the network in the city and just subscribe to SpaceX internet or any other companies internet.\n\nReally asking why SpaceX can't provide municipal WIFI is about the same as asking why SpaceX can't install and mange the red lights in the town or provide fire hydrants or pave the roads. It's just not what their products do. And it's likely they'll never get into that specific business.\n\nAnother comparison would be Asking why your local NBC TV station or the national corporation known as NBC isn't providing municipal wifi. They have those giant towers all over the country broadcasting TV everywhere why don't they do it? Probably because that isn't what they do either. Their equipment isn't designed to do wifi and it's not  placed where it'd need to be to serve WIFI.", "score": 2, "replies": []}, {"body": "They could offer a product that does that.  A sat base and mesh nodes.  The nodes would be a new product that speaks to the base and other mesh peers.  In a city they would space the mesh nodes each block and the sat bases every 1/4 mile or so. Not cheap but would be a profitable product.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "> If you give to them at the house they get a minor bonus a few dollars a month vs paying for home internet.\n\nHome internet is a lot more than a few dollars where I live.", "score": 1, "replies": [{"body": "compared to the price of a car?\n\nYou can get internet for tens of dollars per month (aka less than $100)\n\nThe price of a Tesla is $35,000 and up.", "score": 1, "replies": []}]}, {"body": "The receiver is the size of a pizza box, could easily fit on top of a car", "score": 1, "replies": [{"body": "except it can't track the sats while the car is in motion (it needs to be in a fixed position) and it needs unobstructed view to the sat meaning no trees or buildings or bridges or garage or anything else in the way.\n\nSo I'm not sure why you'd put one on a car it'd be totally useless and hurt your miles/kWh (if exposed) or block the view if integrated into the the roof.\n\nOn top of that it likely draws hundreds of watts and would hurt your range if you used it.", "score": 1, "replies": [{"body": "Never heard it has to be stationary.. source?", "score": 2, "replies": [{"body": "I would also not be surprised if a car travelling at maybe 100 mph makes no difference when tracking a satellite moving at 17,500 mph.  \n  \nAlso, speed here are basically irrelevant; angular velocity across the view area is what matters. A car going over bumps and around turns probably would mess with the connection more. Perhaps coordinated with IMUs in the car, this issue could be managed.  \n  \nThen they just need to build a hood transparent to microwaves. All in all, I don't expect to see direct Tesla-Starlink connections, but being a Musk company, I would not be surprised at all if they make it work.", "score": 1, "replies": []}, {"body": "have you ever tried to use a satelite dish on a moving vehicle?\n\nHave you ever installed one on a house?\n\nYou have to have them pointed in exactly the right direction.\n\nRotating and tilting the receiver at random will make it lose the tracking of the satellites.", "score": 1, "replies": [{"body": "ever heard of sirius satellite radio?", "score": 1, "replies": [{"body": "yep, totally different technology.\n\nSirius/XM is very low bandwidth and transmits from GEO much higher up. That changes the receiver type and angles.\n\nAlso audio only is a very low bandwidth need. You can't get Netflix or Youtube to stream over the bandwidth available on Sirius/XM. You won't be able to download apps and firmware updates over that low of a bandwidth. You won't be browsing web pages over that low of a bandwidth.\n\nStarlink will be much lower to the ground and much faster.\n\nGeo = 35,786 km (above ground)  \nStarlink = 550 km (above ground)  \n\nThat's a huge difference in latency and it will be at higher bandwidth too (550km forces more satellites, makes it easy to up the throughput compared to geo).\n\nCheck out https://www.youtube.com/watch?v=QEIUdMiColU and think about how much more work it is to track a moving object that's much lower.\n\nIf your next thought is wait, isn't the Sirius satellite moving? The answer is no, not in relation to the ground it isn't. That's Geostationary Orbit for ya.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "You underestimate the number of high net worth people who have moved to the countryside. Where my parents live, if Starlink was a \\*bonus\\* with 25mb/s+ speed internet for a nominal fee, say $40 a month but you have to buy a Performance Model of Y or 3 or any S or X, then yes, you will hit a demand lever.\n\nThe desire for decent internet will be enough to push people to get a car IMHO. The problem is there are just TERRIBLE options out in the sticks. My parents internet is 400kbs! and $90 month, it's the only option in  the area that isn't data capped at 22mbs. Maybe 5G will change things for them, but it's not really looking that way.", "score": 1, "replies": []}]}]}, {"body": "To make it provide WiFi on a much wider basis, they need mobile phone towers that talk to Starlink... \n\n&#x200B;\n\nThis might be quicker/cheaper than an existing mobile phone tower that has a fibre connection, but it still needs permits, and a connection to the electrcity grid etc.\n\n&#x200B;\n\nIt would still take a major investment, to put mobile phone towers everywhere.", "score": 1, "replies": []}, {"body": "Isn't the point of starlink that it works anywhere? I was thinking everyone has 5G everywhere and the concept of WiFi is dead. I guess your tesla rise hailing app will work in the middle of nowhere which is nice. But I don't know why you'd specifically look for synergies between Elons companies. A much more interesting synergy is with battery tech.", "score": 1, "replies": [{"body": "no, starlink doesn't work anywhere. It's good where you have a stable view of the sky unblocked by trees, buildings, etc.\n\nIt also requires a stable mount, you can't have the receiver moving about.\n\nAnd the receiver is the size of a pizza box. It won't be something you carry around or that fits easily on a car. You'll still need LTE or WIFI to get data to smaller devices or when you are on the go.\n\nIt also has to be between 55% south and 55% north at least in the first few years until they launch the polar orbit layers.", "score": 2, "replies": [{"body": "Interesting. Do you remember how you learned about this? Would like to read/watch/listen more about it", "score": 1, "replies": [{"body": "r/spacex  \nr/starlink\n\nBoth have coverage. Often details are from FCC applications which can be dry reading. But the next launch is Wednesday night. 2d 11h 40m from now. And that will be live streamed on youtube. Well worth watching.", "score": 1, "replies": []}]}]}]}]}, {"body": "The cars need an internet connection to run things (music player, navigation, etc.) instead of depending on a cellular network provider; Tesla can use Starlink's network, which would be cheaper for Tesla.    \nIn the meantime; Starlink would provide much better coverage than cellular network for rural areas. There is a dead zone between Orlando & Cocoa Beach on a state road.", "score": 2, "replies": [{"body": "afaik the receivers are too big for anything, maybe other than semis and motorhomes", "score": 1, "replies": [{"body": "Not necessarily... Iridium satellites are orbiting around 500 miles, and their satellite phones are similar size as a cell phone with an extra big antenna. I am sure it would fit into cars.", "score": 1, "replies": []}]}]}, {"body": "maybe in a generation or two. from what i understand the current receivers are too big for anything short of the semi or a motor home.", "score": 2, "replies": []}, {"body": "Starlink will make SpaceX filthy rich, and become the most valued private company in the world by ORDERS OF MAGNITUDE. Then Elon can basically get infinite cash to pump into Tesla and Boring, and make VTOL jets and all dreams come true!!", "score": 2, "replies": []}, {"body": "WiFi for your robotaxi ride! #thedream\n\nMore near-term ... Free Tesla network video transfer, if they can set it up at superchargers or on the car itself. Good for data harvesting.", "score": 1, "replies": []}, {"body": "Starlink connection for every Tesla on road? Allows for a higher bandwidth connection to the car to support data for FSD", "score": 1, "replies": []}, {"body": "A strong antenna on a Tesla could make every Tesla a moving WiFi hotspot; they could use them as Comcast uses their routers for the XFinity WiFi coverage", "score": 1, "replies": []}, {"body": "Assuming the launch goes well this week, Starlink should gain a lot of steam with more regular launches. In terms of how this might affect Tesla, I think Elon offering free internet for life to Tesla owners is a very likely possibility. ~~Perhaps even utilizing the vehicles as hotspots down the line.~~ Food for thought; what do you think?", "score": 1, "replies": [{"body": "The receivers are the size of pizza boxes. They aren’t meant to go on cars.", "score": 4, "replies": [{"body": "Under the frunk lid?\n\nI see a lot of advantages: Would allow the cars to be connected even if out of cell tower range. Car would become a hotspot. Would allow massive amount of information to be transferred between cars in real time. Cars talking to each other would be really useful for situational awareness (eg.  car ahead would warn of debris or potholes) and coordination (eg. platooning).", "score": 4, "replies": []}, {"body": "The first cell phones were the size of bricks... current level of technology isn’t an indicator of future potential", "score": 1, "replies": []}, {"body": "Ah, right I remember him saying that. I still wouldn't be surprised if he put them on the semi's though. The free internet for life is still a possibility as well.", "score": 0, "replies": [{"body": "I think the current LTE network and future 5G network is better suited for most automotive purposes. This would be a bit overkill", "score": 7, "replies": [{"body": "Okay you got me there. So my only real synergy possibility is free internet for Tesla owners lol.", "score": 1, "replies": [{"body": "The “middle of nowhere and off the grid” package. Thinking of living on an island? Or on a mountain? Or in the woods? Then get this package! Includes starlink internet, solar tiles, power walls, and the future Tesla air conditioner.", "score": 4, "replies": [{"body": "It's eerie how I was imagining the same exact scenario this morning... Have a silver!", "score": 3, "replies": [{"body": "Wow thanks", "score": 1, "replies": []}]}]}]}]}, {"body": "As it’s satellite based it’s also not going to work in cities with tall buildings.\n\nBasically, it’s not a good idea to put it on cars", "score": 1, "replies": []}]}]}, {"body": "I think you are speculating, and I don't even like the idea of spaceX giving free stuff to Tesla. They are different companies, and Tesla owners should pay the same as everyone else.", "score": 2, "replies": []}, {"body": "Don't quote me on this, but I think the original estimate for stable internet was something in the thousands (4000-5000 I think?).\n\nIt is not a very likely possibility.", "score": 1, "replies": [{"body": "Thats full global coverage. He said today that 6 more launches would provide minor coverage and 12 moderate.", "score": 1, "replies": []}]}]}]}
{"title": "Do you still expect Tesla's automotive operations to eventually be profitable, given the pivot to FSD and seeming focus on that now?", "selftext": "", "id": "bns3si", "created_utc": 1557684965.0, "score": 1, "upvote_ratio": 0.52, "num_comments": 58, "comments": [{"body": "Yes. They’re guiding for profitability in Q3. I think it’s possible. Plus next year I expect the margin on Y and Semi to be better than the 3. They’re learning.", "score": 16, "replies": [{"body": "I do even expect margin from Chinese factory on any car to be wildly different. First, cheap and hardworking labor, second, this is not their first factory of that kind, now they know what are they doing", "score": 3, "replies": []}, {"body": "> They’re guiding for profitability in Q3.\n\nThey were guiding for profitability in Q2 as little as a few weeks ago.  In Q3 they are going to have a much worse product mix as the backlog for AWD variants of the Model 3 goes away, plus the US tax incentives get cut in half again.  \n\n> Plus next year I expect the margin on Y and Semi to be better than the 3.\n\nThey still haven't decided where they are going to build either of those.  Even the company is saying they won't produce either at scale until *hopefully* the very end of the year.  In reality you are looking at 2021 for any realistic hope of either of those projects adding to the bottom line.", "score": 6, "replies": []}, {"body": "[removed]", "score": -6, "replies": [{"body": "Actually, they said Q1 profitability was if everything went perfectly, and it obviously did not. They didn’t realize just how much demand was pulled forward in 2018 Q4. Q3 profitability seems likely at this point seeing as how demand is picking back up. I feel pretty good about Q3 being profitable. 2020 should improve profitability if the ramp up to these higher priced cars (Y and Semi) aren’t too bad.", "score": 4, "replies": [{"body": "You're entirely wrong. I don't know what universe you live in, but your demand estimates are way off. \n\nFirst month of Q2, demand looks to be in the range of 15k.\n\nAre you giving subjective opinions or do you have anything to back this up?", "score": -1, "replies": [{"body": "Well, only time will tell what steady demand will be. As it is, we’ve only really had 3 quarters of high production rates, which is not enough data. I’m obviously optimistic. Why else would I be invested and frequently browse this sub?", "score": 1, "replies": [{"body": "I personally don't see demand rising as the loss of the tax credits makes the vehicles more expensive. \nTo each his own though.", "score": -1, "replies": []}]}]}]}]}]}, {"body": "Why would the \"pivot\" impact profitability?\n\nI don't even see where the pivot is personally, FSD has been something they've been working on for years.", "score": 8, "replies": [{"body": "The pivot is in how Musk is trying to sell the narrative of the company to investors. He's done with trying to convince them that growth of the cars alone will lead to eternal profitability.", "score": 2, "replies": [{"body": "That's hardly a pivot given, again, this is something they've talked about and worked on for years. Remember that this has all been in the second masterplan which came out three years ago...\n\nI'd agree to a statement they'd increased the promotion of this to investors, but that doesn't seem unreasonable given they're valued at something like $50-60 billion versus Waymo's $175 billion.", "score": 3, "replies": [{"body": ">but that doesn't seem unreasonable given they're valued at something like $50-60 billion versus Waymo's $175 billion.\n\nWaymo has actual results.", "score": 1, "replies": [{"body": "Oh yeah? Tell me more about those [results](https://www.cnet.com/news/googles-sergey-brin-youll-ride-in-robot-cars-within-5-years/).\n\nEdit: Seriously people? They're 2 years past their deadline and still in geofenced testing vs Tesla's deployment of self-driving to hundreds of thousands of cars. Why are people upvoting these idiots?", "score": 2, "replies": [{"body": "I mean, per wiki: \n\n> In November 2017, Waymo altered its Arizona testing by removing safety drivers in the driver position from their autonomous Chrysler Pacificas. The cars were geofenced within a 100 square mile region surrounding Chandler, Arizona. Waymo's early rider program members were the first to take rides using the new technology.", "score": -1, "replies": [{"body": "Oh yeah, I'm convinced now. Geofenced testing. Those are definitely better results than functional levels of self driving installed in hundreds of thousands of cars.\n\nWhy do you always feel the need to defend ridiculous statements on this sub?\n\nYou replied to another comment I posted defending a similarly [ridiculous statement](https://www.reddit.com/r/teslainvestorsclub/comments/bn2o0v/teslas_2012_model_s_is_61_more_efficient_than/en5v085/) and then just ignored a response I posted pointing out just how much it was bullshit that you were defending.", "score": 0, "replies": [{"body": "Waymo had members of the public riding in fully autonomous vehicles within 5 years as promised.  Admittedly it was limited to a small number of beta testers.  Now compare that to Tesla's promises regarding their autonomous technology.  Still waiting for that coast-to-coast demonstration....\n\nEdit:  Sorry, thought your other post was a joke because it was so ridiculous.  I've responded now.", "score": 1, "replies": [{"body": "I think Elon mentioned this trip could have happened already. If Tesla were to take the Waymo approach they could geofence a single coast to coast route,focus exclusively on that and it would have worked already. Tesla isn’t interested in focusing on a specific geofenced region. They want general self driving. Waymo is saying if they expand to a new city they will drive/map the city for *30 days* before they offer sell driving in that city. Is it really generalized self driving if it takes 30 days of mapping to be able to roll out in a new city?", "score": 2, "replies": [{"body": ">I think Elon mentioned this trip could have happened already. \n\nI straight up do not believe him.", "score": 0, "replies": []}, {"body": "Oh, well if Elon said so then it must be true.", "score": -1, "replies": [{"body": "Sorry I guess you are right mapping and driving one road is much harder than creating general self driving. Waymo themself said it would take 30 days of driving in a new city before they provided service so I guess it’s better to ignore them as well", "score": 2, "replies": []}]}]}, {"body": "> members of the public\n\nIf you redefine the term, sure, but \"public\" doesn't usually mean \"exclusive, private, and secret non disclosure contracted test personnel\"\n\nTesla also has \"members of the public\" using coast to coast FSD, as do hundreds of other companies.  The problem with limited access secrecy is it's not public and claiming it is universally grants all other secret test the same label of \"public\"", "score": 2, "replies": [{"body": "> Tesla also has \"members of the public\" using coast to coast FSD, as do hundreds of other companies. The problem with limited access secrecy is it's not public and claiming it is universally grants all other secret test the same label of \"public\"\n\nSorry, I don't understand what you are saying here at all.", "score": 4, "replies": []}]}]}]}]}, {"body": ">vs Tesla's deployment of self-driving to hundreds of thousands of cars\n\nNot FSD, not driverless, not taking on any legal liability: no care.", "score": -1, "replies": [{"body": "Took you long enough to respond.\n\nI didn't say **full** self driving did I? All of the people using its current capabilities seem to care quite a bit for it... That's a lot more than Waymo is offering in terms of \"results\".", "score": 1, "replies": [{"body": "Waymo has offered actual driverless cars. What Tesla is offering is nowhere close to being capable of running a driverless taxi service.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "If we are hit with a recession, no.\n\nIf the economy grows, yes.", "score": 3, "replies": []}, {"body": "Yes, still think Tesla can be a very successful company selling cars at 25% gross margin.  500k model 3s and 500k model Ys per year possible in the near future.  It’s just that the autonomy play could unlock 10x profit potential beyond the traditional business.", "score": 5, "replies": [{"body": "Any company can be a successful company selling products at great margins and great sales.\n\nThe question is, what is a realistic expectation?", "score": 7, "replies": []}, {"body": ">Yes, still think Tesla can be a very successful company selling cars at 25% gross margin. \n\nHow about 20%? That's what Tesla will feel good about now.", "score": 1, "replies": []}]}, {"body": "Model-3 is a game changer, once you drive that car for a few hours there's no going back. \n\n\nLots of Production issues - GF1 needs to get to 35 GWH, China GF#3 Needs to come online,etc  This should happen in 12 Months.\n\nIn 12-18 Months FSD Will only be Feature complete and not ready for validation + roll-out which would take much more time.\n\nSo there should be plenty of time between 2019-Q3 and the next 2-3 Years (+ a little elon time) when TSLA will run at 25% or more Gross Margin.", "score": 4, "replies": [{"body": "Tesla will also be getting some insane viral marketing over the next few months as they push self driving features out to consumers. Once people get to experience it there will be crazy amounts of videos and talk about Tesla doing this and this automatically. I mean yesterday a video of a Tesla dodging a rabbit went viral. \n\nThere's so many people that still say \"self driving cars, not in my lifetime or at least 10+ years away\" so once they see it's actually coming pretty much now it will change the mindset of a lot of people.", "score": 2, "replies": []}]}, {"body": "Yes, I always expected them to be profitable... eventually.... battery cell prices are dropping...\n\n&#x200B;\n\nMy assumption is the pivot to FSD may be mission related, and the investor day was simply trying to prepare the ground work for a capital raise (with limited success).\n\n&#x200B;\n\nWhen I say mission related, I think Telsa has come to realise that the move to EVs is slower than they would hope, and the battery cell production ramp is going to constrain volumes for a long time,.... \n\n&#x200B;\n\nFSD is a way of retiring ICE, cars earlier, and accelerating the mission.\n\n&#x200B;\n\nFSD also makes it easier for Tesla to sell cars, and make a profit...\n\n&#x200B;\n\nMy assumption is Elon is focusing on this area now as it is where he sees that the most rapid progress can be made.\n\n&#x200B;\n\nBuilding more cars and batteries is a capital intensive process that takes time... they are wary of going too fast if a recession is potentially looming...\n\n&#x200B;\n\nI also took the capital raise to be one of 2 things:- \n\n1. Tesla is planning ot make their own cells and needs to invest.\n2. Telsa is talking out insurance for a recession or lower than expected demand..", "score": 3, "replies": [{"body": "This sounds like good explanation, Tesla has said they're battery cell limited in production since July 2018. They already use 50% of the world's lithium ion battery production for the Model 3 so they've can't push that as hard. Optimizing production lines isn't even worth it right now because they would just have to stay idle waiting for more cells. \n\nThat gets them a good opportunity to work on FSD while just maintaining current production and building the shanghai Gigafactory. It makes sense with rumors being that Elon has taken a bigger role in the FSD team and probably works with the Gigafactory.", "score": 2, "replies": []}]}, {"body": "I’m sorry but the demand for the vehicles seems too light.  They are struggling to sell the 250k model 3 they make now and it is still fairly fresh.  X/S sales are horrid right now.  I don’t see Tesla with any profitable vehicles to sell in late 2019-early 2021.", "score": 3, "replies": [{"body": "What do you mean struggle to sell?", "score": 4, "replies": [{"body": "In the last two quarters they put ~9,500 into inventory.", "score": 3, "replies": [{"body": "The inventory cars are cars in transit to Asia and Europe.  Last quarter was China, this quarter added Europe.  They will only start coming down if the transit pipeline gets faster or China/Europe Gigafactories start pumping out cars.  Tesla is still production constrained, by battery output, not demand constrained.", "score": 1, "replies": []}, {"body": "so... slightly more than a week's worth of production?\n\nSeems more like they grew so fast they were having trouble stuffing their pipeline.  They've gone from \"can't build enough\" to \"can't deliver enough\" to \"can't repair enough\", and seem to be coming back around to \"can't build enough\".", "score": 1, "replies": [{"body": "More like two weeks of production.  But the point isn't really the total amount of inventory they have, it is that inventory keeps growing despite production essentially being flat QoQ.", "score": 6, "replies": []}]}]}, {"body": "He means they have ~10 days product in inventory.  I'm sure it's the same definition Ford and VW use to describe their \"struggle to sell\" problems with inventory which is why he uses it on tesla.", "score": 1, "replies": []}]}]}, {"body": "Yes. The pivot is more about getting Elon enough money to build a city on Mars. The most valuable car company is Toyota, which is worth $150 billion or something like that. That is only 3x Tesla's recent market cap. The FSD opportunity is much larger.", "score": 1, "replies": []}, {"body": "There are too many factors to lead tesla to a victory in the future. Maxwell, GF3 , EV boom, production improvements, selling credits like to FCA, Model Y, Semi, battery storage etc. This will come in affect in 1-2 years. If they couldnt kill tesla till now, its about over...", "score": 1, "replies": []}, {"body": "They’re profitable now, if you cut out growth expenses.", "score": -1, "replies": [{"body": "No they aren't.  Tesla's net income in Q1 was -$702.1 million.  During the quarter they spent a total of $340.2 million on R&D and $305.1 million on capex.  I'm not sure what else you consider \"growth expenses\", but if you're losses exceed your capex and R&D combined that is pretty horrible and not indicative of a growth story.", "score": 9, "replies": [{"body": "It’s like Tesla critics aren’t even aware of seasonality.  Or somehow think one quarter a trend makes.  It is so absolutely strange.  They’ll pick a single time period, and even sometimes in just a particular market, and say “Look Tesla’s failing”.\n\nQ1 is an especially strange one to zero in on as it had initial rollout of Model 3 into two huge new markets, plus shutdown of S&X production lines to implement brand new drivetrains.\n\nIs it stupidity on their part or is it something darker?", "score": 2, "replies": [{"body": "The guy I was responding to said \"They're profitable __now__\" - and you think it is cherry picking to look at the latest financials?", "score": 5, "replies": [{"body": ">not indicative of a growth story\n\nSo you meant that the Q1 results indicated they didn’t grow in Q1?  Come on man we all know what you meant.", "score": 1, "replies": [{"body": "Revenue was down 33% in Q1 compared to Q3 and 37% compared to Q4. Revenue was only up 33% YoY, when in Q1 of 2018 the company only delivered 8,182 Model 3s.  Do we really need to wait to Q3 of this year to say growth has stalled?", "score": 3, "replies": [{"body": "Revenue was down, but production was way up.  How can this be explained?  Thousands of Europe/China cars still in transit to customers.  It’s simple math.  I can tell you’re reasonably intelligent, so I can only assume you have other interests and you’re trying to spread FUD.\n\nAnd yes, we do need to wait for Q3 to say growth has stalled.  Because it hasn’t.  Even by your own admission:\n>Revenue was only up 33% YoY", "score": 1, "replies": [{"body": "> Revenue was down, but production was way up. How can this be explained?  Thousands of Europe/China cars still in transit to customers.\n\nThose vehicles in transit only translate to about $750 million in additional revenue, which would mean that even if they were all delivered revenue in Q1 would have still dropped 27% from Q4 and 22.7% from Q3.  The real reasons revenue is down are because (i) the company is selling lower cost variants of the Model 3 and (ii) Model S sales are being cannibalized by the Model 3.  Those trends are going to continue, which is why we know growth has stalled already.  If you want to hold the stock until the Q3 report comes out to verify that you'll lose a lot of money.", "score": 2, "replies": [{"body": "I agree that Model 3 is cannibalizing Model S & to some degree even Model X.  A refresh of those cars is also imminent, and that is hurting S/X just as much if not more than the 3.  Once the refresh drops, demand for S/X will go up again, albeit not to the same levels as 2018.\nDemand for Model 3 hasn’t even begun.  We have no idea where the ASP will end up until demand in China and Europe stabilizes.  Right now the ASP is around $49k (per the Q1 call).  I agree that will continue to decline a bit and will probably settle around $45k.  But we can’t expect production costs to stay the same.  They will inevitably decrease as the machine gets lubricated and production increases to 7k-8k a week.\nThe other wildcard is Autopilot.  If it truly does start making rapid progress toward being ‘feature-complete’, this will shoot up the ASP of all models significantly.\n\n>If you want to hold the stock until the Q3 report comes out to verify that you’ll lose a lot of money.\n\nI strongly disagree.  In fact, I just bought 46 June 2020 calls with a strike price of $420 ;)", "score": 1, "replies": [{"body": "> Demand for Model 3 hasn’t even begun.  We have no idea where the ASP will end up until demand in China and Europe stabilizes.\n\nDemand for the higher margin variants has collapsed already.  When the AWD variants were introduced in Q3 last year, 73.5% of Tesla's VIN registrations were for AWD.  That figure dropped to 47.8% in Q1 when orders opened internationally.  So far this quarter it is down to 33.7%.  Expecting a drop like that to only result in a $4k reduction in ASP is highly, highly optimistic.\n\n> But we can’t expect production costs to stay the same.\n\nAgreed - they are going up as material prices increase (thanks Trump!).    \n\n> The other wildcard is Autopilot. If it truly does start making rapid progress toward being ‘feature-complete’, this will shoot up the ASP of all models significantly.\n\nYup, the only hope seems to be that Tesla can figure out FSD really quickly.\n\n> In fact, I just bought 46 June 2020 calls with a strike price of $420 ;)\n\nYou must be really wealthy to throw $25k in the trash like that.", "score": 2, "replies": [{"body": "14% of cars selling for $10k less falls right in line with the $4k ASP reduction I believe.\n\nAP improvements are a sure bet for me.  Every month my Model 3 gets updates and it drives itself better each time.  Where it’s at compared to 6 months ago is truly quite amazing.  I have my doubts about it being ‘feature complete’ in Q4, but I could see Q1 or Q2 easily.  If it’s even anywhere close to ‘feature-complete’, demand for FSD will go through the roof, and institutional investors will start to view them as a serious competitor in the self-driving arena.  Once again - FSD doesn’t have to be finished.  It just has to make people take them seriously!  I think your pessimism is causing you to miss out on a fantastic opportunity here, 🦚", "score": 1, "replies": [{"body": "> I think your pessimism is causing you to miss out on a fantastic opportunity here,\n\nI've been on this board warning people that this stock is garbage for over a year.  During that time the stock has lost about 30% of its value, during a period when the broader market has gone up quite a bit.  So thanks, but I don't think FOMO is going to change my mind given all of the actual analysis I've done.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "I think you forgot about all the logistics issues of starting deliveries to China and Europe simultaneously.  That’s related to growth and easily explains the single-quarter loss.  The R&D number is also highly inflated due to growth.\n\nYou’re a pessimist by nature, so you probably won’t believe Tesla when they say this, but they said the Model 3 program is operating at a 20% margin.  Profitable.", "score": 2, "replies": [{"body": "Yeah, all of this has been explained to him before.  When he said \"I'm not sure\" what he meant was \"I refuse to acknowledge\".", "score": 2, "replies": []}, {"body": "Not forgot, *avoided*.  His purpose trolling tesla forces him to avoid certain things.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "TSLA was unprofitable in Q1 if you ignore all the one-time delivery logistics issues.", "score": 1, "replies": []}]}]}]}
{"title": "BAC Puts, Levi’s Puts, V Puts, Coors Calls, Adobe Puts, Schwab Puts & CRM Puts", "selftext": "", "id": "bnurns", "created_utc": 1557698393.0, "score": 326, "upvote_ratio": 0.93, "num_comments": 47, "comments": [{"body": "You don’t wanna put puts in visa. Gonna have a bad time", "score": 144, "replies": [{"body": "[deleted]", "score": 40, "replies": [{"body": "Man... I wanna love V again but she hurt me so bad in the Dec 2018 recession. Tell me, fellow autist, is it safe to start loving her again?", "score": 12, "replies": [{"body": "[deleted]", "score": 49, "replies": [{"body": "[deleted]", "score": 16, "replies": [{"body": "Totally true! (Kinda) Once walked in on my girlfriend getting bareback gangbanged by the crew that mows my lawn to score a few pills of Oxy. She had been taking the $30 cash meant for the lawn services and became their fuck puppet as payment. After they finished her and the lawn, we had a talk. She never even bothered to take a shower as getting high was more important so she has cum sprinkled with grass clippings all over her body while slurring her barely coherent denials. She looked and smelled like a caesar salad left in a dumpster. Of course I was livid but then I started thinking \"it can't get any worse!\", liberated by the idea that there was nothing left to fear. I went down on her to show my appreciation, savoring the soup of semen, blood, grass, and pubes. Things were great again in our relationship and I realized life was all about perception, right and wrong is just an illusion.\n\n\nUnfortunately, she talked me into selling my MU position and buying SVXY before the big crash last year. We are no longer together.", "score": 16, "replies": [{"body": "Someone who hasn't lost it all yet, give this man the gold he deserves.", "score": 3, "replies": []}]}, {"body": "The most wholesome sub on the web.", "score": 2, "replies": []}]}, {"body": "Oh shit, this description touched me in ways that I never thought the stock of a company could...\n\nCan someone start drawing Tsundere $V memes?", "score": 1, "replies": []}]}, {"body": "What you get for trying to trade options on her. A fine lady like V deserves REAL commitment.", "score": 12, "replies": []}, {"body": "V requires strong, callused hands. Everything shat the bed in dec. Nearly everything is shitting the bed now. And if you can't handle cleaning up the occasional pile of shit your stocks produce when they feast on the tender steak of a bull market, lubricated by blow and hard liquor, may I suggest an entreé of ETFs?", "score": 4, "replies": []}]}, {"body": "Visa obtaining a new feature with global money transfer and that’s awesome.", "score": 1, "replies": []}]}, {"body": "Inverse Cramer never fails.", "score": 16, "replies": [{"body": "I thought inversing this sub was the play?", "score": 11, "replies": [{"body": "Well you have to Inverse what this sub says, so Following Cramer would be the correct play on this one", "score": 12, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Buy puts and calls. Can’t lose, risk free.", "score": 3, "replies": []}, {"body": "But you just countered what I said so you should be good if you counter me one more time and we leave it at that.", "score": 2, "replies": []}]}]}, {"body": "cramer is the personification of this sub", "score": 5, "replies": []}]}]}, {"body": "Might be so obvious that even Cramer gets it.", "score": 1, "replies": []}]}, {"body": "I always inverse Cramer. But I also inverse r/WallStreetBets so what the Hell do I do now?", "score": 22, "replies": [{"body": "Straight cash homie", "score": 16, "replies": []}, {"body": "Inverse WSB, Cramer can’t be wrong about V, or at least if he’s wrong on V we’re all fucked.", "score": 4, "replies": []}]}, {"body": "How do people on this sub feel about WDAY?", "score": 9, "replies": [{"body": "Not a ton of new innovations coming out of WDAY from what I hear. I would be more interested in NOW.", "score": 2, "replies": [{"body": "$NOW is on a fucking tear..beautiful chart", "score": 4, "replies": [{"body": "About the same as WDAY though?", "score": 2, "replies": []}]}, {"body": "What innovations coming out of NOW?", "score": 1, "replies": []}]}]}, {"body": "I know you are excited about Cramer but what you really should be waiting for us u/SoRefreshing", "score": 6, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "No way. Bought a few VXX calls Friday before close and cashed then out. I'm sitting the rest of this shit out today.", "score": 1, "replies": []}]}, {"body": "/u/SoRefreshing your people need you~", "score": 1, "replies": []}]}, {"body": "Actually all those puts sound right! Did you see how much S&P fell today Sunday?", "score": 4, "replies": []}, {"body": "This from Joe and his crew of scammers?", "score": 12, "replies": [{"body": "Can someone explain why he sucks?\n\nLegit don’t know", "score": 8, "replies": [{"body": "He really got off his fundamentals and simply became a talking pusher of stocks. His advice is no better than flipping a coin.\n\nHe's the most famous talking head out there so he's also the most hated.", "score": 14, "replies": [{"body": "Watching him get curbed stomped by Jon Stewart back in the day was beautiful.", "score": 6, "replies": []}]}, {"body": "[This was the big one.](https://www.youtube.com/watch?v=gS0mM2TnT7A)\n\nThey collapsed 3 days later.\n\nHis most recent disastrous call was really pushing lyft and saying getting a share below 80 would be great.", "score": 9, "replies": [{"body": "is he talking about money invested in bear stearns stock? or money on deposit with bear stearns? I think he tries to wiggle out of that one by saying \"FDIC had you covered is what i meant\", but he's talking about it while showing the chart", "score": 2, "replies": [{"body": "I'm not sure. Still FDIC only insures to 250k, so if you had all your investments through them, you were still fucked, I think.", "score": 1, "replies": []}]}]}, {"body": "Joe? For one he’s a condescending asshat.  He set up some stock pick shit on Discord.   Bro knew jackshit about options. It was all swinging stock.  He had a “class” that was fucking joke. All of a sudden one day, he decided he was an option master, promoted and started ripping off more folks. He’s a huge fucking asshole to. Lot of butt sniffing and real clique like. Soccer moms he fawns over, they eat up his shit, they have disposable income and don’t care if they profit, yet they get all his time. I could go on and on.", "score": 1, "replies": [{"body": "Are we talking about the mad money guy Jim Cramer? Now I’m confused does he go by Joe as well? Doesn’t seem like the internet type to setup a discord.", "score": 1, "replies": []}]}]}]}, {"body": "I agree with Jimbo on this one CHIEF 🗿", "score": 2, "replies": []}, {"body": "Dammit I was at that game, should heckled him.", "score": 2, "replies": []}, {"body": "$BAC is going to opt out of agreement with $FDC next month.\n\nI picked up BAC calls and FDC puts, but I'm afraid it could ultimately lead to both dipping.", "score": 2, "replies": []}, {"body": "F this guy", "score": 2, "replies": []}, {"body": "I don’t know about coors calls, I started drinking Busch light instead. Much cheaper. Long Le Crox beer flavor!", "score": 1, "replies": [{"body": "Love me some Busch", "score": 3, "replies": []}]}, {"body": "Safe call op with TAP", "score": 1, "replies": []}, {"body": "Lol BAC.", "score": 0, "replies": []}]}
