{"title": "What underrated stock now do you think will be a winner in 2020 or future years?", "selftext": "Are there any stocks that you see as becoming super successful in the future? For instance, what’s your $10 per share of AMD of today —what stock do you think has the potential to raise from $10 to $40+ like AMD in the near future?", "id": "e93bv1", "created_utc": 1576045182.0, "score": 11, "upvote_ratio": 1.0, "num_comments": 24, "comments": [{"body": "AEO and COST.\n\nThese 2 companies are:  \n\\- making good money in retail apocalypse.   \n\\- will still perform well in recessions (can be defensive)  \n\\- Still have tons of footprint to grow  \n\\- very cheap now because retails sentiment pull it down (AEO only)", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I think fashion are subjective from person to person. but from the stats, AEO is the top 5 more popular brands in America. along side with Nike, apple, lululemon etc.\n\nAlso aerie is taking more and more market share from it competitors. and if we look at the fundamentals. they are a pretty healthy company financially.", "score": 2, "replies": []}]}, {"body": "Where do you see COST ending up in the next year or two? Holding 70 shares averaged at $230.\n\nNo plan on selling, Costco is like an awesome cult and I spend so much money there already.", "score": 1, "replies": [{"body": "If the economy continue to do well. 330 and beyond is not a problem.", "score": 1, "replies": []}]}]}, {"body": "Google.    Worth a lot more than price today.    Their non ad revenue is now about 8 times the size of all of Twitter and growing at 40%.", "score": 7, "replies": [{"body": "> Worth a lot more than price today.\n\nCan you go a bit more into details on this?", "score": 1, "replies": []}, {"body": "Sorry, what is the point of comparing non-ad revenue to a company whose revenue comes mainly from advertising?", "score": 1, "replies": []}]}, {"body": "GE.  Larry Culp has this figured out.  GE has loads of assets it can sell off for cash if needed, and he knows he needs to grow in house business as well.  Once the 737Max issue gets solved, GE should be fine. Currently $11, I would say 14 or 15 is very doable for 2020.", "score": 2, "replies": []}, {"body": "Lscc", "score": 1, "replies": []}, {"body": "Bzun", "score": 1, "replies": [{"body": "I been waiting for the BZun train to leave the station. Nothing but disappointment so far.", "score": 2, "replies": [{"body": "This stock is a long hold. I don't care if the stock is flat several months. I'm bullish for the next 5-10 years.", "score": 1, "replies": [{"body": "What gives you so much confidence ? I stopped out of most of my position in the last couple months. \n\nMoved into another China play in GSX", "score": 1, "replies": []}]}]}]}, {"body": "BGCP", "score": 1, "replies": [{"body": "Why?", "score": 1, "replies": [{"body": "Because it’s a well run company that flies under the radar. Expenses high because they are building out new revenue streams which should payoff handsomely in 2022 and beyond, plus while you wait get a 10% divy. Plus their current products have double digit growth and should continue for the foreseeable future", "score": 2, "replies": []}]}]}, {"body": "Apps - Digital Turbine", "score": 1, "replies": []}, {"body": "Oxy", "score": 1, "replies": []}, {"body": "First Mining Gold: one property alone has a PEA suggesting an $800 mm valuation at $1350 gold, while the whole market cap is barely over $100 mm Cdn.   FF-T ,   FFMGF", "score": 1, "replies": []}, {"body": "Amzn for years\nPton for the short term like bynd", "score": 1, "replies": []}, {"body": "RMD - Resmed Inc. up 50% in two years.", "score": -1, "replies": []}, {"body": "AUPH", "score": -2, "replies": []}]}
{"title": "TESLA", "selftext": "What do you think about Tesla? Is it going to keep growing? Is too late to buy?\nI am intersted in a long term investment and i wont need the money.", "id": "e96tim", "created_utc": 1576069311.0, "score": 2, "upvote_ratio": 0.6, "num_comments": 21, "comments": [{"body": "Basically you’re investing in Elon. If he doesn’t die or do something illegal, the gains will keep coming.", "score": 16, "replies": [{"body": "Elon is literally my lord and savior. Never have I been so excited for the future!", "score": 7, "replies": []}]}, {"body": "I own a few shares of Tesla - about 30. I bought at $318. It's a highly volatile stock, as I'm sure you know. I've read so many conflicting opinions about the company -- some say it's the next APPL others say it's garbage. I debated selling when it dropped to $175 but decided to hang on for the ride because even if I lost all I invested, I would be ok. They got hammered for missing their delivery target by 6,000 vehicles in the 3rd quarter. They need to deliver 105,000 by 12/31 to meet their 400k annual target. Based on what happened in Q3, you have to be prepared for a big swing either way depending on the number they hit. Is it too late? Who knows? I do think that the introduction of the Model Y will be decisive. I'm on the fence about buying more shares. I may wait until closer to year end, but be prepared to take a big hit, then possibly recover if Model Y gets a good reception.", "score": 6, "replies": [{"body": "So you think Tesla price will fall if they dont reach their 400k target, dont you? It would be a good chance to buy cheap. I think it's the new Apple because it has lot of fans instead of only \"common\" costumers.", "score": 3, "replies": [{"body": "I do think it will fall if they miss their delivery target, but if they hit it, it will explode.", "score": 3, "replies": []}, {"body": "They won’t meet 400k. They’re shooting for 360.  Tesla deliveries aren’t as decisive as they used to be because they have proven to be production and ops limited.  And we pretty much know what model 3\nProduction at freemont looks like.  Don’t expect a huge move off of this qtr delivery numbers because it’s not a decisive “information learning” quarter.  China giga will be below 10k production so there’s very little chance for wow factor for this quarter.  The test will be next two quarters as we get a full quarter of China giga and probably a full quarter of Y.  Expect relatively low (for Tesla) volatility for the next 3-5 months.  Only thing that can really surprise the market during that timeframe is margins in Q4.", "score": 2, "replies": [{"body": "Okay, so its indeed a good time to buy, because the expected growth", "score": 1, "replies": [{"body": "TSLA will skyrocket if they actually achieve FSD (theyre trying to push beta out before 2019 end) though they have been saying autonomy is coming for years, i believe 2020 could be the year they deliver", "score": 1, "replies": [{"body": "I think google with Waymo is going to perform much better than tesla. They have better engenieers and more cash spend on test their technology.", "score": 1, "replies": [{"body": "Tesla has hundreds of thousands of cars on the road today, with customers training their self driving software", "score": 1, "replies": []}, {"body": "Tesla has exponentially more data. That’s how you develop AI. Google is an order of magnitude behind.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Buy, anyone who owns one is extremely happy", "score": 5, "replies": []}, {"body": "Buy now or wait for dip?", "score": 2, "replies": [{"body": "I'm asking the same question hahaha", "score": 1, "replies": []}]}, {"body": "You should wait it just came from a fast price increase. When you start reading articles again about how tesla is the worst investment in the world then you should start buying.", "score": 2, "replies": []}, {"body": "[removed]", "score": 1, "replies": []}, {"body": "If you think EVs are the future (and they almost certainly are), it makes a ton of sense to invest in the company that is far and away the leader of the pack in terms of EVs. There are going to be a ton of people 10 years from now saying “I knew the EV revolution was coming, I knew Tesla was the leader there, why didnt I buy more Tesla?”\n\nOn the other hand, im not totally sold that theyre the leader when it comes to autonomous driving, which I think is a much more lucrative business long term. Seems like Google is the leader there.  \n\nAll in all I think its worth owning, and still do own it, but im becoming less convinced its the next apple and will increase like 5/10x over the next decade.", "score": 1, "replies": [{"body": "Why do you think google is the leader in autonomous driving vs Tesla?", "score": 1, "replies": []}]}, {"body": "It’s a long term hold for me. I’ve been in since it was 100, I probably should have sold at certain points and bought back at the dips but so be it. I do think it’s going to hit some big numbers. I know a guy who turned a couple thousand into 100k between the stock and futures but he got in very early.", "score": 1, "replies": []}, {"body": "Buy, ignore it for 5y and profit. If you cant handle swings and check it daily then forget what i said.", "score": 0, "replies": []}]}
{"title": "Got 4K on NVDA calls— will add more if I can get some decent input on if this is hopeless or might actually make something off it. You Autistic sonsabitches give me some input and I’ll add 16k more.", "selftext": "[deleted]", "id": "e8zzu6", "created_utc": 1576027088.0, "score": 20, "upvote_ratio": 0.95, "num_comments": 20, "comments": [{"body": "Nah.  All in this.  Throw the full 20k in there.  Think of all the tendies.  Or loss porn.  Its a win either way.", "score": 13, "replies": []}, {"body": "It’s puts you want for a technology stock right now.", "score": 9, "replies": [{"body": "y tho", "score": 2, "replies": []}]}, {"body": "Turn dark mode on you fucking savage\n\nIt’s not hopeless. NVDA has been on a nice run but taken time to consolidate. Trend looks good and it’s not overheated but it is still a binary bet on a GYNA / trade war (much like the rest of the market - semis are just extra sensitive)", "score": 7, "replies": []}, {"body": "Big calls the day before a Fed rate decision😂 that's the best style", "score": 3, "replies": []}, {"body": "Hell yeh", "score": 3, "replies": []}, {"body": "What platform is this", "score": 2, "replies": [{"body": "Grindr premium", "score": 3, "replies": []}, {"body": "think or swim", "score": 3, "replies": [{"body": "funny enough i bailed on these at like 2.36 last Friday\n\nyou should be up plenty now. they closed at like 3.37 today\n\ni would get out soon though as they're still OTM and theta gets real. or roll them further ahead\n\nyou're really betting on tariff being officially off the table this Sunday if you add more. i wouldn't do Dec 20, at least get an ER in with March calls or something", "score": 1, "replies": []}]}, {"body": "Looks like TD Ameriprise / Think or Swim", "score": 2, "replies": [{"body": "Think or swim offers paper trading. How do we know this isn't paper trading? Not accusing anyone of anything, just curious about how the screenshot would differ", "score": 1, "replies": []}]}]}, {"body": "Risky during tariff week", "score": 2, "replies": []}, {"body": "Oh no honey, what you doing?", "score": 2, "replies": []}, {"body": "Save $1k for puts and hedge", "score": 1, "replies": []}, {"body": "Your Greek letters pain me considering the fed is announcing shit this morning", "score": 1, "replies": []}, {"body": "Do a one year expiry instead thank me later.", "score": 1, "replies": []}, {"body": "Yum on that theta", "score": 1, "replies": []}, {"body": "Lock in profits then wait to buy 2020+ calls whenever the inevitable trade war dip hits", "score": 1, "replies": []}, {"body": "When did you sell these contracts?", "score": 1, "replies": []}]}
{"title": "Your Morning Coffee", "selftext": "#DOW\n\n**Boeing Company (BA)**  The FAA Administrator Steve Dickson said the 737 MAX will not be un-grounded in 2019, CNBC reported. Elsewhere, Dickson will testify in Congress on Wednesday, as is ex-Boeing factory manager Ed Pierson.\n\n**Chevron Corp. (CVX)** announced its 2020 capital and exploratory budget at USD 20bln, considering strategic alternatives, including divestments, for its Appalachia shale, Kitimat LNG, and other international projects. Due to revised oil price outlook, expects a USD 10bln-11bln non-cash, after tax impairment charge on its Q4 results.\n\n**Home Depot (HD)** affirms its FY19 EPS view at USD 10.03 (exp. USD 10.08) ahead of its analyst day on Wednesday, whilst providing a lacklustre FY20 sales growth view of 3.5%-4% (exp. 4.3%).\n\n#NASDAQ 100\n\n**Netflix Inc. (NFLX)** has been mentioned positively at Piper Jaffray – following its downgrade at Needham on Tuesday – where analyst Michael Olson sees upside for subscriber growth, both domestically (6% vs. exp. 4.8%) and internationally (30.9% vs. exp. 29.9%), citing data from his \"Netflix Navigator\" search index and YouTube trailer analysis and seeing little impact from increasing competition.\n\n**Tesla Inc (TSLA)**  is to raise the price of its Model 3 in China in January, currently the amount is unknown, sources report. Elsewhere, the Co is planning to produce 500k vehicles per annum at its new Gigafactory in Germany, with 10k jobs expected. \n\n#S&P 500\n\n\n**American Water Works Company Inc (AWK)** CEO Susan Story is to retire on April 1st, 2020, being exceeded by its COO Walter Lynch. Co sees FY20 EPS at USD 3.79-3.89 (exp. USD 3.91) and announces 10-year capex plan of between USD 20bln-22bln, whilst affirming its FY19 EPS view.\n\n**AT&T Inc. (T)** has entered an accelerated USD 4bln share repurchase programme for Q1 2020 and has set an additional 4% of cost cuts for 2020, driven by lower labour costs and corporate overhead.\n\n**CenturyLink Inc (CTL)** has been initiated with an Underperform at Evercore ISI and a PT of USD 14, where analyst James Ratcliffe cites concerns over its revenue trajectory and sees rangebound trade, with little expectations of a sale or a spin-off of its legacy consumer business.\n\n**Cummins Inc. (CMI)**  has authorised a new USD 2bln share repurchase programme.\n\n**Fortive Corp (FTV)** has been upgraded to Overweight from Equal Weight at Morgan Stanley, being named a top US Electrical Equipment and Multi-Industry pick by analyst Joshua Pokrzywinski, who raised his PT to USD 91 from USD 70 (last closed at USD 73.84). The same analyst names it a top pick for 2020 alongside Emerson (EMR) and Gardner Denver (GDI).\n\n**Fortune Brands Home & Security (FBHS)** has raised its quarterly dividend to USD 0.24/share from USD 0.22/share.\n\n**Franklin Resources (BEN)** has raised its quarterly dividend by 4% to USD 0.27/share.\n\n**Leidos Holdings Inc (LDOS)** has been awarded a USD 6.52bln contract, for which it will provide support for the Department of Defense Information Network/Defense Information System Network.\n\n**ViacomCBS Inc (VIAC)** has begun laying off staff, starting in CBS’ finance department, with further jobs in administrative and back-office suggested to be next.\n\n#OTHER\n\n**American Eagle Outfitters (AEO)** Q3 19 (USD): EPS 0.48 (exp. 0.48), Revenue 1.07bln (exp. 1.06bln). Q4 EPS view 0.34-0.36 (exp. 0.46).\n\n**Beyond Meat Inc (BYND)** has lunched Beyond Beef in Canada.\n\n**Bunge Ltd (BG)** has appointed Sheila Bair, Chair of the FDIC between 2006/11, and Bernardo Hees, CEO of Kraft Heinz (KHC) between 2015/19, to its Board of Directors effective December 9th.\n\n**Dropbox Inc (DBX)** Chief Customer Officer Yamini Rangan is to depart the Co on January 3rd, 2020.\n\n**GameStop Corp Holding Company (GME)** Q3 19 (USD): EPS -0.49 (exp. 0.11), Revenue 1.44bln (exp. 1.62bln); SSS -23.2% (exp. -13.8%). Cuts FY EPS view 0.10-0.20 (prev. 1.15-1.30, exp. 1.21), cites an “unprecedented decline in new hardware sales seen across the market as the current generation of gaming consoles reach the end of their lifecycle and consumers delay their spending in anticipation of new hardware releases.”\n\n**Ollie's Bargain Outlet (OLLI)** Q3 19 (USD): Adj. EPS 0.41 (exp. 0.38), Revenue 327.05mln (exp. 322.53mln). Co appoints John Swygert as President and CEO, previously interim CEO after Founder Mark Butler passed away. Co affirms FY19 guidance.\n\n**PG&E Corp (PCG)** has had its PT raised to USD 10.50 from USD 5 at Citi, where analyst Praful Mehta says the Co’s settlement with fire victims likely dealt a “fatal blow” to the bondholder plan and eliminated the chance of the stock going to zero.\n\n**Sage Therapeutics Inc (SAGE)** CEO Jeffrey Jonas and CSO Albert Robichaud bought a combined 32.5k shares for a combined transaction size of over USD 2mln.\n\n**Bank of America (BAC)** CEO says Q4 trading +7-8% YY, upside led by FICC revenues, Q4 investment banking +3-4% YY", "id": "e97q7q", "created_utc": 1576074279.0, "score": 137, "upvote_ratio": 0.97, "num_comments": 19, "comments": [{"body": "BYND has lunched, heh.", "score": 43, "replies": []}, {"body": "Excellent the morning paper has arrived, how is the GUH doing?", "score": 9, "replies": []}, {"body": "$DIS Apptopia released their numbers on total downloads and in-app revenue.\n22 M downloads and 20 M $US in revenue.\n\nShort this shit.", "score": 7, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "They track iOS and Android downloads from what I have seen. 20M revenue are roughly 3M subs in the first month from the app.", "score": 1, "replies": [{"body": "our smart tv is android, it would get captured", "score": 2, "replies": []}]}]}]}, {"body": "When are these cocksukkers going to give some dividend increases instead of shitty buybacks", "score": 13, "replies": [{"body": "they're the same in the long run, you tend to get better tax treatment w/ buybacks and slightly more predictable cashflow w/ dividends\n\nhttps://www.investopedia.com/articles/active-trading/073015/dividend-versus-buyback-which-better.asp", "score": 5, "replies": [{"body": "They are not the same, in order to monetize a buyback you must sell the underlying instrument. A dividend pays cash right into your pocket. Dividends thus allow you to \"cash out\" the profits without having to liquidate your shares. The tax treatment is also not always better with buybacks, it depends on what tax bracket you are in and whether or not the dividend is qualified or not.", "score": 1, "replies": [{"body": "As the other poster said, if you have many shares, you can simply unload a percentage of your stake equivalent to the dividend. If you have very few shares, then tough shit the company doesn’t care about you and your wants.", "score": 3, "replies": []}]}]}]}, {"body": "Why won’t BA crash like it’s shitty planes, I been waiting for months to pick it up for $250. I mean revenue drag is getting as bad as wind drag that crashed their planes but still institutional retards keep buying", "score": 3, "replies": [{"body": "If it wasn't just Boeing and Airbus, BA would be on trouble. Until there is more competition (never) always bet on BA.", "score": 3, "replies": [{"body": "That’s a good point, at most BA back log can temporarily decrease", "score": 2, "replies": []}, {"body": "Some day. Just a thought. But maybe SpaceX starts building planes.", "score": 1, "replies": [{"body": "Too expensive to start. It would eat too much into the orbital delivery service.", "score": 3, "replies": []}]}]}]}, {"body": "How is BA maintaining altitude when it's planes won't?  I want some but there is no way the entire bad run of 737 maxes are priced in.", "score": 2, "replies": [{"body": "all the planes hit solid ground.  we need one to sink into the atlantic before we see any real dive on the share price.  I think that I saw that DD on CNBC", "score": 2, "replies": []}]}, {"body": "Decided to run a truly autist play and bought some 12/27 $350c once that Whistleblower started talking... up 58%", "score": 1, "replies": []}, {"body": "Nothing is more boring than the large caps.", "score": 1, "replies": []}, {"body": "Sir, this is a MacDonald.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": -1, "replies": []}]}
{"title": "$XIACY and why you should be buying that stock", "selftext": "Xiaomi is a Chinese phone maker. One of the largest in the world and the phone maker with the highest sales growth \\*jeremy clarkson voice\\* *in the world.* They are selling phones in markets apple can't seem to tap into, incluiding india and the PRC.  \n\n\nNow the real DD is here. These phones seem to have an astounding retention rate. I bought myself one. I never used to look for phones, they are tools. Now I'm catching myself looking a xiaomi phones on the internet all the time. If I get the idea of buying another phone, it's always a Xiaomi, I don't look at other brands. My friends who've bought the phone are the same. Add to that their fucking smart watches selling well (and working on both android and apple devices) and you have an extremely undervalued company with a ton of potential. It's easy to see why given their stupid low prices (like seriously, if you are in the market for a phone fucking check out the mi 9 lite or the k20 pro).", "id": "e98tqx", "created_utc": 1576079662.0, "score": 0, "upvote_ratio": 0.44, "num_comments": 28, "comments": [{"body": "Lost me at Chinese.", "score": 20, "replies": [{"body": "Tariff the Commies! Down with Huawei and the other CPC shills!", "score": 5, "replies": []}]}, {"body": "It is a smart phone for poors.  That market is large but the margin is less", "score": 6, "replies": [{"body": "Phones are for poor people. Rich people don't have phones they have an assistant with a phone.", "score": -5, "replies": [{"body": "Go tell it to your CPC handler back in Peking you Huist stooge! May the ghost of Chiang Kai-shek beleaguer your dreams.", "score": 5, "replies": []}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Overvalued at the IPO. UBER is also 50% down.", "score": -3, "replies": [{"body": "And that’s your justification for investing?", "score": 2, "replies": [{"body": "Not really. Did you read the post?", "score": 1, "replies": [{"body": "Got it so your justification is “I just bought a super cool chinese smartphone and now I cant stop going on their website looking at other cool chinese smartphones therefore this is the next apple. “", "score": 1, "replies": [{"body": "You gonna go all Doug Kass on me and ask me for my research or something? This is a betting site. It's 8% up today. Company is worth 33B USD, revenues are 27B USD and growing. They are building up  a whole platform of products. Don't like it don't invest. But you'll miss out on the tendies.", "score": 3, "replies": []}]}, {"body": "No", "score": 1, "replies": []}]}]}]}]}, {"body": "Sir this is America", "score": 4, "replies": [{"body": "No this is patrick.", "score": 2, "replies": []}]}, {"body": "They sell well until their phones get banned for national security concerns. Just look at Huawei. \n\nAlso since you can't legally own chinese companies as a foreigner the CCP can make your shares worthless faster than the orange man can make a tweet about trade deals.", "score": 3, "replies": [{"body": "\\>They sell well until their phones get banned for national security concerns. Just look at Huawei.   \n\n\nDon't think that'll happen since they aren't big players in the telecom world, and their products aren't really popular in the US either.  \n\n\n\\>Also since you can't legally own chinese companies as a foreigner the CCP can make your shares worthless faster than the orange man can make a tweet about trade deals.   \n\n\nThis is no longer true. And you can still invest in the ADR.", "score": 1, "replies": [{"body": "Lol. \n“They aren’t big players and products aren’t big in the US”. Then why should I buy it????", "score": 4, "replies": [{"body": "Asianas have money too... And they've started to sell big in Europe. It's a matter of time til they reach the US.", "score": 1, "replies": []}]}, {"body": "The US isn't the only country that hates China. There's been brewing tensions between India and China for years. Just because the phones are selling well now doesn't mean India won't ban the phones to flip off the Chinese government.\n\nIt seems like they made it legal for foreigners to invest for now, I admit I missed that news. As a managed economy they are still incredibly risky especially since they can change their financial rules at the drop of a hat (or a tweet). The only reason they are even allowing foreign investment right now is their stock market has been in a free fall for the last few years.", "score": 2, "replies": []}]}]}, {"body": "Waiting for Trump to ban Xiacy…", "score": 2, "replies": []}, {"body": "Stocks for a commie phone company. K", "score": 2, "replies": []}, {"body": "5 figure stock ticker? Count me out", "score": 1, "replies": []}, {"body": "just wait until US suppliers are banned from selling to Xiaomi / ZTE / Huawei", "score": 1, "replies": []}, {"body": ">I never used to look for phones, they are tools. Now I'm catching myself  looking a xiaomi phones on the internet all the time. If I get the idea  of buying another phone, it's always a Xiaomi, I don't look at other  brands. My friends who've bought the phone are the same.\n\nSounds like the Commies figured out mind control.", "score": 1, "replies": []}, {"body": "It's huge in India. New phones get sold out pretty fast", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Their products are great. But just being Chinese is enough to keep most people away from this stock. If an American company developed consumer tech this well, they would be competing with Apple.", "score": 1, "replies": []}]}, {"body": "This post is gay", "score": 1, "replies": []}]}
{"title": "Is anyone else thinking that GME has to rise today?", "selftext": "Right? Up? They took a rightfully deserved hammering, but they're gonna do the thing - you know the thing, like $TSLA did after the truck. They're back at pre-truck levels again. GME's gonna be back? Right? \n\nI just bought a bunch of 12/20 6.00 Calls @ 0.05. I need to feel better.", "id": "e99agx", "created_utc": 1576081798.0, "score": 1, "upvote_ratio": 0.54, "num_comments": 28, "comments": [{"body": "Guidance is cut by 90% and stock is down less than 20%\n\nStockholders got off easy tbh", "score": 19, "replies": [{"body": "CEO said \"It's only going to get worse until next Christmas when the new consoles come out. Let's hope people buy them from us instead of Amazon or Walmart. After that, wtf we don't know.\" \n\nThat's GME revenue guidance lol. He went full on retard. \n\nWsb reacts - Time to moon! All-in 500c 12/20/20. Literally can't go tits up!", "score": 5, "replies": [{"body": "Good enough for me", "score": 2, "replies": []}]}, {"body": "It'll keep going down until Jan, level off, and kill itself next Q reporting lol", "score": 2, "replies": []}, {"body": "That must mean this was priced in to a large extent.", "score": -7, "replies": []}]}, {"body": "Imagine investing in calls for a company based around video game sales in 2019", "score": 13, "replies": [{"body": "Hey man come invest in my company. We sell fruits to gorillas", "score": 2, "replies": []}]}, {"body": "It doesn’t have to do anything!", "score": 10, "replies": []}, {"body": "“bUt tHe ShOrT iNtErEsT iS %100....”", "score": 5, "replies": []}, {"body": "That earnings call was SO much worse than I thought it would be. I gambled a few bucks on the big short squeeze possibility, but once those numbers started coming out I cut my losses as fast as Robinhood's Windows 98 order processing server could handle.", "score": 4, "replies": []}, {"body": "Fuck em. Hope they go tits up and shut down all the stores. \n\nGame Crazy was better.", "score": 3, "replies": []}, {"body": "Its happened before but only bc they bought back a shit ton of stock", "score": 3, "replies": []}, {"body": "RIP bro, show us the screenshot of the losses later please", "score": 3, "replies": [{"body": "Happy to! its only 20 calls. But, it does represent 20% of my autfolio", "score": 4, "replies": [{"body": "According to this [youtuber](https://www.youtube.com/watch?v=IJo2lHe78NY), it's future looks pretty bleak.", "score": 2, "replies": [{"body": "His channel is a dedicated smear campaign against his former employee.  I don't necessarily disagree but it's a pretty narrow vantage point being given.", "score": 2, "replies": [{"body": "So you’re saying it’s comprehensive DD", "score": 2, "replies": []}]}]}, {"body": "Will soon be 0% of your portism.", "score": 1, "replies": []}]}, {"body": "Here is a screenshot for you\n\n[https://imgur.com/a/dtFU5z4](https://imgur.com/a/dtFU5z4)", "score": 2, "replies": []}]}, {"body": "I mean general consensus is puts so I figure fd calls are the right bet", "score": 1, "replies": []}, {"body": "GameStop has left the building\n\n[https://imgur.com/a/dtFU5z4](https://imgur.com/a/dtFU5z4)", "score": 1, "replies": [{"body": "well, i released a little poop upon clicking that. of course, it works fine for me. @relief@", "score": 1, "replies": []}]}, {"body": "Wrote 12/20 $6.5 calls for $.38 \n\nmore blood for the blood god", "score": 1, "replies": [{"body": "Let me know if you sell them lol", "score": 1, "replies": [{"body": "....yeah sold them at $.38", "score": 1, "replies": []}]}]}, {"body": "GMErs RiSe uP!", "score": 1, "replies": []}, {"body": "I read somewhere that AMD had to create a subsidiary 50% owned by the Chinese gov in order to manufacture and sell in china. So I guess they’ll all be using amd", "score": 1, "replies": []}, {"body": "bruh", "score": 1, "replies": []}]}
