{"title": "I am long on several 100 lots of stacks.....", "selftext": "I want to sell options with these stocks, not nessacarily spreads. Just insure price drops and make some money as the stock stays solid. I have Pfe,jpm,aapl,cat, and vz. \n\nI have read some but not sure sell strategy of calls. Or is it puts. \n\nJust looking to make some extra money off the stocks while they sit. Content with selling if the contract is called. But what is the actually strategy? Sell a call for say 10% less price? ", "id": "4tv5zf", "created_utc": 1469073838.0, "score": 4, "upvote_ratio": 0.67, "num_comments": 15, "comments": [{"body": "If i understand you correctly, you own several hundred shares of the stocks you listed and you want to figure out how to sell covered calls on them?\n\nThe easiest way to ballpark this strategy is to define at what point you are 100% okay having your shares called away from you. I'll use AAPL as an example.\n\nAAPL closed today at $99.96. For simplicity, lets assume you purchased the stock at $94 a while back. \n\nHow much more potential upside do you think AAPL has in the next 30 days? $5? $10? Let's say $5.\n\nRight now, the Aug 26 $105 strike calls have a bid price of .78. That means for every 100 shares of AAPL you own, you can sell 1 call for $78 (.78*100 shares in 1 options contract). If you own 300 shares of AAPL, you can sell 3 covered calls for a total credit of $234. \n\nI'm selecting the August 26 expiration date because Theta (time decay) begins to accelerate in your favor during the last 4 weeks of the contract's life.\n\nNow lets say AAPL misses earnings on Tuesday. The stock goes down to $96 and the calls you sold go down in value to .36 per contract (random number).\n\nYou have 2 options. \n\nOption 1: If you think AAPL will either stay still or trade within a channel, you can wait until the August 26 expiration and the options you sold expire worthless and you can keep the full premium.\n\nOption 2: You can buy back the 3 calls you sold for $36 each, pocketing the spread between the $78 credit you received and the $36 current value of the calls. This nets out to $42 per contract or $126 profit of the total $234 potential profit. \n\nNow let's say AAPL rallies and surges to $110. The calls you sold are now ITM and your 300 shares are liable to be \"called away from you\". This means that you are forced to sell your shares at $105 each even tho the current share price is $110. You miss out on an addition $5 of profit but since you're already profitable on the shares, this might not bother you.\n\nHope this helps/answers your question. Let me know if i can clarify anything. Best of luck.", "score": 18, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "thanks! We're all learning and I've gotten a lot of useful info from this board. Glad i can help do the same. ", "score": 1, "replies": []}]}, {"body": "This does help. So I sell a call for a higher price and pocket the premium. If it sells then so what....I made my money. \n\nThat is kind what I was wanting to do. It is not a lot of cash, but if I have it rolling with about 5 stocks I think I can make a few extra bucks along the way. \n", "score": 3, "replies": [{"body": "yeah it's a pretty conservative trade. Be sure to come back and let us know how the first month works out for you. \n", "score": 2, "replies": []}]}, {"body": "> You miss out on an addition $5 of profit but since you're already profitable on the shares, this might not bother you.\n\nOption 3: roll the calls up and out and follow the share prices up.", "score": 3, "replies": [{"body": "^^This. I forgot to list this. Thanks for including :)", "score": 1, "replies": []}]}]}, {"body": "Looking at the quotes for a few dollars above it only gives me like $25 with a $8 commission. Not really worth the time....\nBut the prices well below sell at a good premium. \n\nFor example a $100 stock has a call for $10 at a strike of $90. Now I have purchased stock at $60, so I am fine with selling at 90 with the 10 premium, thus $100. If I was going to sell the stock anyway why wouldn't I run the options until it sells and pocket the premiums? If the stock stays flat I win.\nIs this a solid strategy for selling stocks?", "score": 3, "replies": [{"body": "Yep! this is called selling a covered put, it also has a higher probability of success. You're on the hook to sell at a lower strike, potentially leaving more profits on the table. But since stocks are historically biased to the uptick (take that with a grain of salt) it's generally considered a higher probability.\n\nThe higher yield is due to a greater premium being placed on downside insurance. Both covered calls or puts are a fairly conservative options play. \n\nFor more info, CBOE is a fantastic resource: \nhttp://www.cboe.com/strategies/equityoptions/coveredcombinations/part1.aspx", "score": 3, "replies": []}]}, {"body": ">I have read some but not sure sell strategy of calls. Or is it puts\n\nI would recommend getting the two strategies straight before you proceed. In both cases, you will make money if the stocks stay flat. \n\nWith the put strategy though, you'll be on the hook to purchase shares at the put strike prices if these stocks tank. You better have the capital to back up these purchases (enough to buy 100 shares per contract), otherwise you'll be in for a world of hurt.\n\nWith the call strategy, you'll make money if the stock stays flat, if it goes down a little, and even if the stock increases in price above the strikes and you're forced to sell your shares. You'll also make money on the dividends in the meanwhile. This is why I love covered calls--three ways to win money.", "score": 2, "replies": [{"body": "With the call strategy....What is the down side? How do I lose money?  It seems if I am selling a stock....I should sell with options and pocket premiums until it sells. Example above. ", "score": 2, "replies": [{"body": "The downside with a covered call strategy is no less than owning just the shares outright. In fact, the downside and risk is *less* with a CC, since by selling the call you are collecting premium to offset your cost basis on the stock. Your net purchase price on the shares decreases with every option you sell.\n\n>It seems if I am selling a stock....I should sell with options and pocket premiums until it sells. Example above.\n\nYou are 100% correct. If more investors understood this, their returns would be greatly enhanced. If they're ready to sell some shares they have, why not simply sell a call option, and get paid to sell the shares?\n\nWe're talking about covered calls here of course, not naked calls. There is significantly more risk selling calls on shares you don't currently own.", "score": 2, "replies": []}]}]}, {"body": "Alright made my first options trade. AXP with a strike price of 59.5 for $425 for July 29th. It was 63.5 at time of the sale....now has jumped to 64.25. \nTime will play out. I am in the game which is part of understanding how to make it happen. ", "score": 2, "replies": [{"body": "Generally...if the call is just barely in the money will it be exercised? Like .15 in the money? ", "score": 1, "replies": []}]}, {"body": "Also good to establish a desired annual rate of return which will help you figure out what monthly premiums should look like. \n\nFor instance, if you are looking for 20% annual return, you can try to find call strikes that will get you ~2% and do those every month. This can help guide how far OTM you have to go. ", "score": 0, "replies": [{"body": "^^ this is great advice too", "score": 1, "replies": []}]}]}
{"title": "What would happen to SCTY stock if Tesla acquires them?", "selftext": "Would they no longer be traded?", "id": "4twso6", "created_utc": 1469105283.0, "score": 24, "upvote_ratio": 0.79, "num_comments": 11, "comments": [{"body": "How do you know if it's a better deal to keep SCTY and convert your ownership to TSLA or to sell SCTY before the merger?", "score": 7, "replies": [{"body": "Generally speaking, as soon as the merger is announced, the market will price it in. The price difference between the current price and final price will typically be less than 2 percent, and you may have to wait 6 months or a year for the deal to close and get the last bit. The only question is, if there will be people holding out for a better deal, which may force them to sweeten the bid further. \n\nIt's always a bit tricky to figure, but if the bid is sweet enough to close the deal, I would just sell and take the money. Unless you're really a huge fan of the company. Personally I think it's so overpriced, I'd take the money and run.", "score": 4, "replies": []}, {"body": "Just think of it as selling SCTY and buying an equivalent amount of TSLA. You can't *know* which is a better deal unless you have a crystal ball. ", "score": 2, "replies": [{"body": "So I save the equivalent of two brokerage commissions?", "score": 2, "replies": [{"body": "I guess so. If you do see value in TSLA + SCTY then there's no point in selling the SCTY.", "score": 0, "replies": [{"body": "I think I was hoping that TSLA would over bid thereby giving me its shares at a reduced price. SCTY has only gone up since then!", "score": 1, "replies": []}]}]}]}]}, {"body": "You'll get a proportion of TSLA stock", "score": 5, "replies": []}, {"body": "I've just got 2 SCTY stock left on Robinhood (more on main brokerage account, I just mess around with Robinhood). If Tesla acquires them, what happens to me since I only have ~$50 invested in SCTY? Do my shares just vanish and leave me with nothing?", "score": 3, "replies": [{"body": "I imagine they will just credit your account since they don't do partial shares. ", "score": 2, "replies": []}]}, {"body": "It would stay around 27 dollars since that's the price Tesla is willing to pay to acquire shares. ", "score": 0, "replies": []}, {"body": "I think this is actually what's going to happen! ", "score": -1, "replies": []}]}
{"title": "AMD ER tonight, What has happened over this quarter?", "selftext": "AMD ER tonight.\n\n Polaris GPU will not be factored into this ER. I believe the china deal is only going to be around the 25m$ for this Q. Im guessing cpu sales have gotten worse as time goes by for them. GPU have been selling well but with all the news and hype for the new cards (polaris-vega) i would imagine people would have been holding out for the new cards.\n\nWhat are your thoughts for today? SELL HOLD BUY", "id": "4tx9j7", "created_utc": 1469111725.0, "score": 11, "upvote_ratio": 0.72, "num_comments": 13, "comments": [{"body": "Im planning to hold", "score": 4, "replies": []}, {"body": "focus is going to be what AMD says for Q3 Q4 2016 (Polaris / consoles) and Q1 2017 (Zen / Vega)\n\nPolaris released at the end of Q2 so it's not going to do much for AMD\n\nQ2 itself isn't going to do anything for AMD", "score": 1, "replies": []}, {"body": "What do we expect it to open at tomorrow and by steady at? 5.50? ", "score": 1, "replies": []}, {"body": "$AMD on the radar. Uptrend channel remains intact. Key levels to watch on Friday. ", "score": 1, "replies": []}, {"body": "Accumulate shares for next quarter. You are welcome. Enjoy your new house.", "score": 1, "replies": []}, {"body": "I'm holding.\n\nPolaris so far is a strong contender. NVidia are very scared right now to the point of rushing out the GTX 1060 (competitor to AMD's RX 480). Reviews and benchmarks are showing that the RX 480 is similar or better in performance to the 1060 when running games that use newer APIs (DX12 and Vulkan) and newer releases will most definitely be making use of these new APIs after we've seen what's possible with them (see DOOM on Vulkan). This is what AMD's been working towards for a very long time from both a hardware and software perspective (see Mantle). They are now in a position to reap the benefits of their work. I'm confident that they'll be able to turn things around in the GPU sector. Also, keep in mind that the RX 480 is cheaper than the GTX 1060 so most buyers will opt for the RX 480 over the *[only slightly better performance in some games]* GTX 1060.\n\nAs for the CPU sector, they'll continue taking a beating from Intel at least until Zen releases, but their financials have been showing that they have consistently met or exceeded goals the last few quarters so as long as they deliver as promised on Zen as they have with Polaris, I think they'll be alright in the long run.", "score": 1, "replies": [{"body": "The issue for AMD now is that the GTX 1060 is a on a similar playing field as the RX 480, and at around the same price. That might sound like a good thing for AMD, but it's definitely not. Both brands have their own cult following, and in this case Nvidias is much bigger. The RX 480 needed to gap itself away from the competition, and do so at a similar or lower cost.\n\nAMD is a good long term hold, and the next few quarters should be good for them. I feel their lack of PR is really holding them back and hopefully we'll see that change running up to Zen.", "score": 2, "replies": []}, {"body": "AMD's margin are shit because otherwise their gpu wont sell.\n\nNvidia is able tot put out a card that is 10% better than the rx480 for 20% less power draw.\nJust proves how far ahead Nvidia is.\nIf they wanted they could lower the price, but nvidia loves their margins. ", "score": 2, "replies": [{"body": "I bet you have no idea how GPUs work and think that nvda components are just more efficient or something. Do some research and you will find that the increased power consumption is because of design decisions. AMD cards dont smack NVDA around in low level api with async for no reason.", "score": 2, "replies": [{"body": "> I bet you have no idea how GPUs work and think that nvda components are just more efficient or something\n\nThey are.\nThey run games at higher fps (same settings) with lower power draw and lower temperature.\n\nNobody cares about your vulkan numbers lmao. That's why almost noone includes them in their reviews.\nNvidia has been shitting on AMD for years and because of that AMD has to lower their GPU prices which is what makes them competitive (see the RX480).\n\nBut because AMD's shit margin they are providing the ENTIRE CONSOLE community with GPU's and still can't manage to run a profit?\nLmao.\n\nAgain, they supply every GPU for all playstations, nintento wii's and xbox. But they havn't made any profit for years.\n\n\n", "score": 0, "replies": []}]}, {"body": "The 1060 is nowhere near 10% better.", "score": 1, "replies": [{"body": "ArsTechnica: \n\"On average, it's around 15 percent faster, rising as high as 19 percent in Bioshock Infinite. The RX 480 remains an excellent mainstream graphics card for 1080p gaming, but if you can stretch the budget just a wee bit, the GTX 1060 is more than worth the extra cash.\"\n\nTomsHardware:\n\"GeForce GTX 1060 is about 13.5% quicker at 1920x1080 across our suite. Its advantage slips to 12.5% at 2560x1440.\"\n\nPaul's Hardware:\n\"It's about 5-20% better than a 480\"\n\nAnd the list of reviewers with similar results goes on...", "score": 0, "replies": [{"body": "hey look another shill not posting anything about vulkan numbers. Nice try.", "score": 1, "replies": []}]}]}]}]}]}
{"title": "PYPL earnings", "selftext": "Who's predicting a beat or miss, and why?", "id": "4tzwtd", "created_utc": 1469144211.0, "score": 5, "upvote_ratio": 0.86, "num_comments": 13, "comments": [{"body": "[deleted]", "score": 4, "replies": [{"body": "I thought they report on the 25th?", "score": 1, "replies": [{"body": "Lol", "score": 2, "replies": [{"body": "Top right http://i.imgur.com/PjbfIIu.jpg ", "score": 2, "replies": []}]}, {"body": "uh", "score": 1, "replies": [{"body": "Top right http://i.imgur.com/9aXGqHr.jpg ", "score": 1, "replies": [{"body": "yea it says July 25th but it doesn't say earnings is out on the 25th", "score": 2, "replies": [{"body": "It says after close next to it so I kinda assumed ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "And further, why is the stock falling if it beat estimates?", "score": 3, "replies": [{"body": "TDA shows an article was released that explains the V-PYPL partnership is nothing more than a \"keep your friends close, but keep your enemies closer\" front\n\nthe V CEO was quoted ranting about war on PYPL in a past conference\n\nthis was time stamped just after 8pm EST\n\n==========\n\npart of the agreement is PYPL also will pay fees to card companies instead of direct linking to bank accounts like they have been doing.  not sure if this is new info", "score": 1, "replies": [{"body": "Thanks. Any chance for a resurgence tomorrow? Thinking I should cut my losses at open ...", "score": 1, "replies": [{"body": "I think so, the deal is good for PYPL long term so i would just hold he stock", "score": 2, "replies": []}, {"body": "not sure, Im just relaying the news and have no position ", "score": 1, "replies": []}]}]}]}, {"body": "cc was good and a very nice projection for future earnings", "score": 1, "replies": []}]}
{"title": "INTC bagholders. Are you holding, selling?", "selftext": "[deleted]", "id": "4tuh4a", "created_utc": 1469063546.0, "score": 2, "upvote_ratio": 0.6, "num_comments": 18, "comments": [{"body": "Holding indefinitely. May buy more tomorrow. INTC is a beast for a blue chip and one meager report isn't gonna scare me away from them. I'll play with amd buy INTC & NVDA are for life.", "score": 7, "replies": []}, {"body": "Honestly, it's a blue chip company that didn't let down too bad. Let people mull over it. It's not opening any lower than it was 3 days ago, honestly, let it ride out. I truly believe that it won't lose any more than 1% of it's value tomorrow. \n\nPlus you've got the divy if all things go awry. ", "score": 3, "replies": [{"body": "Wait if we got it today do we get divy? I'm retarded and don't know how to read the chart.", "score": 1, "replies": []}]}, {"body": "You should be okay IMO. I played NKE's earnings and it was a very similar situation. Under expectations, but beat earnings. Shit went down in the PM and then opened 4 or 5% up.  \n\nDisclaimer: I am in too, but not as deep balled as you. I spread my shit over Ebay and Imax which both did great. GFY", "score": 2, "replies": [{"body": "Yeah NKE was a similar situation but the timing is way different. NKE posted ER the day 1 of the post Brexit rally. They were down 7%-4% in AH and then green the next morning, absolute madness. I had $12 000 CAD in call options that I bought the day before ER to play an ER run up. Made about 30% I would've doubled or tripled my money if I held for a a few days but that's options. No ragrets. \n\nI highly doubt I'll be lucky enough to have a similar situation happen here, I think the market is out of momentum hence me selling off most positions and all my SPY calls today. I hope I'm wrong though, it happens from time to time. ", "score": 1, "replies": [{"body": "Yea I forgot that was during the rally. Never know. Even if you lose I don't seeing it drop too much. GL and GFY\n\nEDIT: I am just going to hold this shit out. I feel a slight recovery. ", "score": 1, "replies": []}]}]}, {"body": "I'm in long term with $32 basis. No issues. ", "score": 1, "replies": []}, {"body": "I cashed in shares yesterday that I've been holding for 1 year avoiding short-term capital gains tax and used the profits to buy some puts. First time trading options and I'm hoping to close them out today or tomorrow. Feels good.\n\nhttp://i.imgur.com/RCx9I0o.jpg", "score": 1, "replies": []}, {"body": "Omg 200 bucks.  How are you not suicidal, bro?  I'm surprised you can have the composure to make this post.  Keep fighting, my brave fellow!", "score": -1, "replies": [{"body": "Listen, pal. It isn't about the $200, it's about managing a losing position. Trying to avoid turning a $200 loss into $1000, ya got it chief?", "score": 4, "replies": [{"body": "INTC isn't some illiquid penny stock that is only traded by 5 people.  Sell if you don't want a 200 dollar loss to turn into 1000.  \n\nIf you hold, it can go up OR down.  How in the fuck is this hard to figure out?", "score": -3, "replies": [{"body": "Listen dinglenuts, I'm aware of the choices I have. I like talking about stocks, I like hearing what other faggots think about them and then making my own decision. \n\nI'm not worried about the $200, I closed a lot of positions today RLYP, OPK, SPY calls and an HOU oil gamble. Locking in solid gains in the thousands. Alright champ? ", "score": 7, "replies": [{"body": "im all in on $INTC, im selling, and whatever is left over goes to paypal.", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "http://i.imgur.com/rxFI7wF.jpg     \nYour post has been automatically removed because of pedophilia. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}, {"body": "GFY", "score": 1, "replies": []}, {"body": "-7 /r/imverysmart", "score": 1, "replies": []}, {"body": "/r/imverysmart ", "score": 1, "replies": []}]}]}]}]}
{"title": "AMD WILL POP - GET IN QUICK. THIS TIME I WONT BE WRONG", "selftext": "source: \nhttp://www.smarteranalyst.com/2016/07/20/mkm-partners-weighs-advanced-micro-devices-inc-amd-intel-corporation-intc-ahead-earnings/", "id": "4twiua", "created_utc": 1469100697.0, "score": 0, "upvote_ratio": 0.33, "num_comments": 14, "comments": [{"body": "Someone is trying to live up to their dad...", "score": 10, "replies": [{"body": "I literally cannot sell this mofo stock due to 3day settling... All I wish is that we are on the same boat together.", "score": -1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "http://i.imgur.com/rxFI7wF.jpg     \nYour post has been automatically removed because of pedophilia. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}]}]}]}, {"body": "Fuck this guy, he said buy INTC for earnings", "score": 2, "replies": []}, {"body": "Seriously can we ban this dude GFY", "score": 2, "replies": [{"body": "Let's trade him for his mentor, at least his mentor generated discussion. This dude just says to \"trust him\".", "score": 5, "replies": [{"body": "I listened to him on INTC complete Autist ", "score": 1, "replies": []}]}]}, {"body": "So you were wrong with INTC, and what makes you think you are right here?", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "http://i.imgur.com/rxFI7wF.jpg     \nYour post has been automatically removed because of pedophilia. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "I actually agree, -.04 or-.05 is what I'm expecting", "score": 1, "replies": []}, {"body": "I've got January 2017 $3 calls that are up 400%+ that I have no idea what to do with right now. Buy more? Lock in profits? GFM? ", "score": 1, "replies": []}, {"body": "with over 500,000 sold from insiders? GFY!", "score": 0, "replies": []}]}
{"title": "Leave $AMD Alone!! I Dont care if it jumps 4000%.", "selftext": "my fuck with amd when u got paypal. seems stupid in my opinion.", "id": "4twx1m", "created_utc": 1469107051.0, "score": 0, "upvote_ratio": 0.29, "num_comments": 10, "comments": [{"body": "Maybe spend less money on stocks and invest in some ESL classes", "score": 7, "replies": []}, {"body": "How sure are you of paypal being a winner?", "score": 3, "replies": [{"body": "everyone on here seems sure on paypal. A big reason being because ebay beat earnings. No one has provided any evidence other than that really. ", "score": 2, "replies": [{"body": "Ok, I'm out in that case ", "score": 2, "replies": [{"body": "Ill try to do a little half assed WSB DD and I'll post because im interested in Elon's child as well. ", "score": 2, "replies": [{"body": "Seems like people are hype on the promise of it. If venmo starts getting accepted in businesses then I can definitely see the upside. But that won't be reflected in earnings. I'm not as sure as other people are. ", "score": 2, "replies": []}]}]}]}]}, {"body": "Im going All in on pypl. as soon as i sell whatever slaughter i can get from $intc. if i was 100% sure. i would sell my house, car, my 4 way sli desktop.", "score": 1, "replies": []}, {"body": "Why paypal? i havent done any dd yet.", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Fuck off\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}
{"title": "WHAT DO U GUYS THINK ABOUT SBUX", "selftext": "", "id": "4tx86e", "created_utc": 1469111242.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 12, "comments": [{"body": "Pike roast is da shit, nicka.  Best way to wash down an adderall IMO.", "score": 5, "replies": [{"body": "pike roast is the nastiest one they brew", "score": 6, "replies": [{"body": "Yeah seriously. It tastes like cardboard.", "score": 2, "replies": [{"body": "Burnt coardboard roasted with zebra livers", "score": 1, "replies": []}]}]}, {"body": "ok im getting some of that now tyty.", "score": 2, "replies": []}, {"body": "No way pike roast tastes like the coffee beans were chewed by a ginger zebra while being pissed on by midget strippers", "score": 1, "replies": []}, {"body": "Go all hipster and have them make you an Ethiopian on their clover machine. Shits all over pike roast. \n\n", "score": 1, "replies": []}]}, {"body": "Used to be a growth company, I believe they've sort of peaked at what they can do in the USA and have been looking to expand in Europe and Asia more aggressively for the past 3 years (they've had hurdles in both markets). They had moments of stagnation that lasted 3-4 months but they've been fumbling around the 54-60$ range since last summer. They tend to announce their marketing strategy during there summer quarter earnings. Wouldn't be surprised if they announced an increase in dividends but I'm not playing the earnings... @57$ I'm kinda indifferent about them without seeing some positive results. I don't mind paying 54$ or 60$ just as long as I can see some growth. Was long from Q1-2011- Q4-2015.\n\nTLDR: They've lost there steam. (pun intended)", "score": 2, "replies": [{"body": "thanks, i yoloed $8500 here", "score": 1, "replies": [{"body": "how salty does it taste?", "score": 1, "replies": []}]}]}, {"body": "DNKN", "score": 1, "replies": [{"body": "> DNKN\n\nfuck i didnt see tat...", "score": 2, "replies": []}]}]}
{"title": "Ebay doesn't use PayPal, all Paypal hype posts are from the same user.", "selftext": "[deleted]", "id": "4ty475", "created_utc": 1469121682.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 11, "comments": [{"body": "dd: im pretty sure ebay does use paypal, I bought some supreme boxers last week ", "score": 7, "replies": []}, {"body": "Just sold some stuff on ebay for $500, $20 fee from PayPal and no other way to get paid ", "score": 7, "replies": []}, {"body": "You definitely use paypal on ebay. Not sure if you're a troll or just dumb", "score": 4, "replies": []}, {"body": "Pretty sure I had to use paypal to do my first ever ebay purchase, which is why I bought ebay, if I'm willing to purchase from it anyone is.\n\nBut I had to make a paypal or at least use it.\n\nAnd paypal called me to make sure I had actually purchased from shady ebay. \n\nGood companies. all the DD I need", "score": 3, "replies": []}, {"body": "Thanks. But I'm already balls deep because of it!", "score": 2, "replies": [{"body": "Not gunna say I didn't pick up some shares, but I feel it in my balls that this is going to tank at 3:45.", "score": 1, "replies": [{"body": "My balls only tell me when to jack off. You've got some nice balls faggot.", "score": 1, "replies": []}]}]}, {"body": "Man don't say that lol. Just got in for $2k.", "score": 2, "replies": []}, {"body": "My personal PayPal hype is from Venmo not eBay. Venmo is what everyone thought PayPal was going to be way back when and people are actually using it.", "score": 2, "replies": [{"body": "them and braintree", "score": 2, "replies": []}]}, {"body": "Just checked before I bought in, eBay for sure uses paypal. Paypal is better off now though because it can branch into other revenue streams. I like it a lot. ", "score": 1, "replies": []}]}
{"title": "The bubble is popping", "selftext": "[deleted]", "id": "4tyf6g", "created_utc": 1469125332.0, "score": 0, "upvote_ratio": 0.33, "num_comments": 17, "comments": [{"body": "G", "score": 22, "replies": [{"body": "F", "score": 24, "replies": [{"body": "Y", "score": 20, "replies": [{"body": "we did it reddit!", "score": -14, "replies": [{"body": "G", "score": 7, "replies": [{"body": "Unit", "score": 6, "replies": []}]}]}]}]}]}, {"body": "Things are going to go up and then go down? Fascinating, go fuck yourself", "score": 6, "replies": []}, {"body": "\"dont ask me to prove it using anything like logic... i feel this and if you don't feel it too you're dumb and i hate you\"", "score": 10, "replies": [{"body": "Are you fucking stupid? The market is down a while .25% !!!!!! Reeeeeeeeee", "score": 2, "replies": []}, {"body": "> Bookmark this and come back on the 3rd and tell me how wrong I was if things do not play out\n\n", "score": -8, "replies": [{"body": "doot doot i am from the 3rd and i can confirm u r wrong also ur a faggot\n\nupdoot in 0.6969 sekonds or u will always be a faggot", "score": 15, "replies": [{"body": "Door doot I'm from the 3rd and can confirm OP is a faggot", "score": 1, "replies": []}]}, {"body": "so what are your plays Mr. Moneybags", "score": 3, "replies": []}]}]}, {"body": "RemindMe! 13 days \"Laugh\"", "score": 3, "replies": [{"body": "I will be messaging you on [**2016-08-03 18:55:07 UTC**](http://www.wolframalpha.com/input/?i=2016-08-03 18:55:07 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/wallstreetbets/comments/4tyf6g/the_bubble_is_popping/d5lb8y7)\n\n[**2 OTHERS CLICKED THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/wallstreetbets/comments/4tyf6g/the_bubble_is_popping/d5lb8y7]%0A%0ARemindMe!  13 days ) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! d5lbewq)\n\n_____\n\n|[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/)\n|-|-|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "https://www.youtube.com/watch?v=eBPqksG9nbA", "score": 1, "replies": [{"body": ">[**Retard alert! [0:20]**](http://youtu.be/eBPqksG9nbA)\n\n>>OMG RETARD!!\n\n> [*^Spyrome ^EightSevenSix*](https://www.youtube.com/channel/UCM4-1iSkvqGKIGI662d6_UA) ^in ^Comedy\n\n>*^2,612,946 ^views ^since ^Nov ^2009*\n\n[^bot ^info](http://www.reddit.com/r/youtubefactsbot/wiki/index)", "score": 1, "replies": []}]}]}
{"title": "After that great call on QCOM and Ebay burst through the top, how's PYPL looking?", "selftext": "[deleted]", "id": "4tykwc", "created_utc": 1469127211.0, "score": 6, "upvote_ratio": 0.8, "num_comments": 9, "comments": [{"body": "For it because WSB said it will probably go up. 40.50 for my call strike", "score": 3, "replies": []}, {"body": "I've got a limit order for some Paypal shares at 39.75. If I get them, I'll await earnings and see what the reaction is like. \n\nPlaying the V, SWKS, and GE earnings as well... Of course having no access to options, my only option is to go long. ", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "All are solid companies. If my earnings plays don't work out, I can just be a bagholder and collect the dividends for a little while. The fundamentals for each company are solid. \n\nI got like $10,000 in for each of them. V and SWKS announce after closing, GE announces tomorrow. If I'm good, I'll walk away next week a few hundred dollars richer. If not, I'll be bagholding on some decent companies. ", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Got my Paypal order filled too. Let's see how it all goes. ", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Visa's solid. Granted, it's been a bit overbought for a while now so it was going to take a lot to move the needle on the stock. SWKS looks like guidance wasn't nearly as great as analysts were expecting, plus it wasn't a huge beat. ", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Not sure where you are looking at, but from Google Finance, it's only down 3% AH. ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "What time does GE report?", "score": 1, "replies": []}]}]}]}, {"body": "I'm in because of EBay earnings and because of how many people I know personally that use venmo. 41 call strike ", "score": 2, "replies": []}, {"body": "im in on swks instead. similar to qcom.", "score": 1, "replies": []}]}
{"title": "A TON of puts volume on PYPL", "selftext": "", "id": "4tyovh", "created_utc": 1469128494.0, "score": 9, "upvote_ratio": 0.74, "num_comments": 10, "comments": [{"body": "Could just mean it's a bunch of people hedging their longs...\n\nWhich is what options are supposed to be meant for. ", "score": 14, "replies": [{"body": "nah, options are meant for yoloing, everyone knows that", "score": 16, "replies": []}]}, {"body": "also means a ton of people sold them...", "score": 6, "replies": []}, {"body": "Last chance to back out.", "score": 3, "replies": []}, {"body": "Comment: I'm pointing it out - not implying it's a bad or good thing", "score": 2, "replies": []}, {"body": "this doesn't tell us anything", "score": 2, "replies": []}, {"body": "IMO Earnings results are priced in at this point.  PYPL is trading at over 36x earnings. ", "score": 2, "replies": []}]}
{"title": "Just got on the GE, PYPL, V and SWKS trains!", "selftext": "", "id": "4tyoxg", "created_utc": 1469128515.0, "score": 5, "upvote_ratio": 0.7, "num_comments": 14, "comments": [{"body": "That's one way to blow through 40k. \n\nGl. Hf", "score": 5, "replies": [{"body": "Nah, B. Only spent $34,000 today. (Plus $32 commission!)", "score": 2, "replies": []}]}, {"body": "SWKS is down AH 3.6%", "score": 1, "replies": [{"body": "Looks like I'll be bagholding for a bit.", "score": 2, "replies": [{"body": "They are a good company. They beat earnings and revenue estimates but still declined, I still don't get how that works...", "score": 2, "replies": [{"body": "They will have a harder time on q4 based on what they said on the call, and they had a big stock of chips. Investors took it as declining demand. They were also down from last year. \n\nEdit, I was long on 200, and sold off after I heard this on the call.", "score": 2, "replies": [{"body": "Hopefully I break even over the next couple of weeks or months... This was a YOLO I did without much research. ", "score": 1, "replies": [{"body": "Did you sell? man it took another hit this morning.", "score": 1, "replies": [{"body": "Nah. I'm bagholding... for a while, maybe.", "score": 1, "replies": [{"body": "Looking at the current trend it may recover to 69-70 in about 3-4 months. As long as big issues happen. Keep in mind that it may take another hit if apple Iphone 7 does bad. ", "score": 1, "replies": []}]}]}]}, {"body": "I'm going to start listening to these conference calls. Good info, thanks!", "score": 1, "replies": [{"body": "Yeah you should, you pick up a lot on the company future. You can also tell who is just trying to sell you dreams. ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Fuck yeah HRL.\n\nThey have just been shitting money directly into my account for sometime.\n\nORI is another good dividend stock to look at as well.\n\nMaybe not during the impending crash, but once we reach bottom they will just pump out nickels and dimes like there is no tomorrow in which large amounts of nickels and dimes are hazardous.", "score": 1, "replies": [{"body": "I bought it a while back. Kind of wished I put $10,000 into it as opposed to $5,000. More of a long term hold though.", "score": 1, "replies": []}]}]}
{"title": "Good luck to me and all $PYPL holders.", "selftext": "Hope we hit it big today 🚀🚀🚀\nGFY if your holding amd", "id": "4tyq9v", "created_utc": 1469128965.0, "score": 0, "upvote_ratio": 0.43, "num_comments": 16, "comments": [{"body": "Oh another PYPL post from you, couldn't help yourself could you? You're entire post history is Paypal. Ask reddit threads on paypal, stock threads on paypal. Posts on twtr about paypal. I can only assume you have DM'd Peter Thiel all day as well about paypal. ", "score": 8, "replies": [{"body": "He has to be right then??", "score": 1, "replies": [{"body": "2/4 this week 😞", "score": 1, "replies": []}]}, {"body": "YOU DIDNT HEAR?\n\nHe's the owner of the infamous \"stock polls\" on twitter!.  Probably the most retarded thing invented", "score": 1, "replies": [{"body": "🚀🚀🚀😎 critize Is part of envy", "score": 1, "replies": [{"body": "Why do your polls sound so autistic?", "score": 1, "replies": []}]}]}]}, {"body": "Too many people on WSB holding PYPL now my holding isn't safe.\n\nWSB ruins everything", "score": 6, "replies": [{"body": "Eh, look at QCOM from yesterday. Lots of people went into it and got out good. Always a risk, though. \n\nThat said, Paypal's fundamentals are solid. I wouldn't mind being a bagholder for a little while. ", "score": 2, "replies": [{"body": "Eh true\n\nBut I hate bagholding.  Opportunity costs bro", "score": 2, "replies": [{"body": "Oh yeah. Don't spend more than what you can afford at the moment. Keep lots of dry powder handy. ", "score": 1, "replies": []}]}]}]}, {"body": "I cant decide whether you're the wayne gretzky of P&D or my new best friend ", "score": 1, "replies": [{"body": "7 minutes left ", "score": 2, "replies": []}]}, {"body": "Can you please fucking go away", "score": 1, "replies": []}, {"body": "Why does it bother you? Gfy ", "score": 0, "replies": []}, {"body": "😘", "score": 0, "replies": [{"body": "XD\n\nGFY amd, Sbux", "score": 1, "replies": []}]}]}
{"title": "You have 15 minutes to go all in on AMD puts.", "selftext": "Don't be a pussy, buy puts.", "id": "4tytnd", "created_utc": 1469130132.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 12, "comments": [{"body": "Calls it is thanks", "score": 10, "replies": [{"body": "Good luck my man at least one of us is guaranteed to win.", "score": 6, "replies": [{"body": "Spoken like a true gambler. ", "score": 2, "replies": []}, {"body": "Name checks out", "score": 1, "replies": []}]}]}, {"body": "Lol", "score": 4, "replies": []}, {"body": "RIP in peace", "score": 2, "replies": []}, {"body": "Short AMD. Let's see <4", "score": 1, "replies": [{"body": "LOL", "score": 1, "replies": []}, {"body": "GJ BB", "score": 1, "replies": []}]}, {"body": "lol.... 100 sep 16 6 strike calls.\n\nLooks like up AH", "score": 1, "replies": [{"body": "Shooting way up. Looks poised to break 52WH", "score": 1, "replies": [{"body": "rip me.", "score": 4, "replies": []}]}]}]}
{"title": "$PYPL Beats", "selftext": "", "id": "4tyyjh", "created_utc": 1469131794.0, "score": 14, "upvote_ratio": 0.74, "num_comments": 15, "comments": [{"body": "The thing is, it is not going up as much as it should be. This is a really good quarter, and the stock is doing nothing AH.", "score": 6, "replies": [{"body": "Wait until open tomorrow, no reason not to go up. ", "score": 2, "replies": []}, {"body": "Hitting it's highpoints. Unless the market reverses it's gonna have a hard time breaking through I bet.", "score": 1, "replies": []}]}, {"body": "deleted  ^^^^^^^^^^^^^^^^0.3566  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/20635)", "score": 4, "replies": [{"body": "Let me go ask my lizard", "score": 8, "replies": [{"body": "what'd he say?", "score": 1, "replies": [{"body": "He told me to GFM :(\n\nAlso he said was long PYPL calls so HELLZ yeah bish", "score": 3, "replies": [{"body": "silly lizard\n", "score": 1, "replies": []}]}]}]}]}, {"body": "2 for 2 on the WSB earnings plays for me, IMAX and PYPL. Thanks everyone!  ", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "What's the difference?", "score": 2, "replies": [{"body": "The quality", "score": 1, "replies": []}, {"body": "[redacted]", "score": 0, "replies": [{"body": "Wrong, I get to tell my friends I made lots of money instead of being quiet and sulking in my loss. And besides I made more money than I lost with about 75% of my initial beginning which is a win even if I'm even.", "score": 3, "replies": []}]}]}]}, {"body": "Phew, I thought the mass WSB trade was gonna screw me\n\nNow commence the usual post earnings release fade", "score": 2, "replies": []}, {"body": "is dis gud", "score": 1, "replies": []}]}
{"title": "Exit point for $PYPL", "selftext": "[deleted]", "id": "4tz0k8", "created_utc": 1469132493.0, "score": 3, "upvote_ratio": 0.64, "num_comments": 11, "comments": [{"body": ">How do I get out\n\nProbably sell higher than where you bought but I could be wrong.", "score": 17, "replies": [{"body": "fuck what??? I've been doing it wrong this whole time then doing what everyone here does... ", "score": 1, "replies": []}, {"body": "Nah you see the key is to buy high and sell low.", "score": 1, "replies": []}]}, {"body": "Never. Contact your attorney and put the shares in your estate. ", "score": 7, "replies": [{"body": "Get printed shares and leave them for the grand kids ", "score": 5, "replies": []}]}, {"body": "Click sell", "score": 7, "replies": []}, {"body": "why would u do that. hold forever brah", "score": 3, "replies": []}, {"body": "Most of the gains got priced in over the last 2 weeks.  Were you looking for a 10% swing on the beat?  It was trading at $36 two weeks ago.  If you traded for an earnings play I wouldn't expect your gains to advance much.  52wk high is 41.75", "score": 2, "replies": []}, {"body": "Bag hold til eternity ", "score": 2, "replies": []}, {"body": "I bought July 22 41 calls. Will I even make a profit tomorrow? ", "score": 2, "replies": [{"body": "Yes idiot hold and don't be a pussy", "score": 3, "replies": []}]}]}
{"title": "The Big Short now available on Netflix.", "selftext": "Check it out", "id": "4tzuj0", "created_utc": 1469143307.0, "score": 0, "upvote_ratio": 0.21, "num_comments": 11, "comments": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.0152  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/56287)", "score": 10, "replies": []}, {"body": "Guys GFYs he's just trying to be helpful, he doesn't realize he's autistic", "score": 4, "replies": []}, {"body": "Incoming faggots", "score": 3, "replies": []}, {"body": "ban", "score": 2, "replies": []}, {"body": "is this a meme? where do i find an fda calendar?", "score": 1, "replies": []}, {"body": "can we get a ban up in here? ", "score": 1, "replies": []}, {"body": "Yes, please. NFLX is still relevant to the unwashed masses. Green pls.", "score": 1, "replies": []}, {"body": "Short NFLX.\n\nGot it.", "score": 1, "replies": []}, {"body": "Ok so I'm watching this, how do I short?", "score": 1, "replies": [{"body": "Get the free Robinhood app.", "score": 1, "replies": []}]}]}
