{"title": "Question about $AAPL", "selftext": "[deleted]", "id": "4rs7js", "created_utc": 1467942339.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 9, "comments": [{"body": "On the one hand, supposedly the iPhone SE has been a good seller for Apple this quarter.  On the other hand, there have been almost no signs of life on the Mac lineup, the iPhone 7 is rumored to be relatively light on features and tech ahead of the \"10-year anniversary\" iPhone next year, and the Brexit may hurt Apple's revenue as well.  Weighing the options, I'd bet on Apple losing a significant amount (5-10%) after hours, possibly into 1-2 days after earnings.", "score": 3, "replies": []}, {"body": "Wait. They have nothing in the pipeline except a recycled iPhone.", "score": 2, "replies": []}, {"body": "I think Apple will slow down a lot. It's not that Apple will go bankrupt or anything, but without a Steve jobs getting everyone pumped, I don't see a growth company. Then again that might be a reason to buy, if you think the opposite.\n\nPersonally, I wouldn't. But if you think they have something cooking that could be as big as the iphone, then go for it.", "score": 2, "replies": []}, {"body": "There is no earnings that would satisfy investors. Price will fall as usuall IMO.", "score": 0, "replies": []}, {"body": "Apple has good value but just don't expect them to instantly recover to its highs, the next iPhone is not gonna invent the wheel again, competition is strong etc. \n\nYou can buy Apple, but it's fairly certain that it will move sideways for a while, there is just no real indicator for it to rise, maybe the iPhone 8 is gonna change that.", "score": 0, "replies": []}, {"body": "Don't buy apple. I'm hoping it hits my entry point again to sell. The apple ship has sailed. Want to know their fate? See palm and blackberry. ", "score": -4, "replies": []}, {"body": "Apple is probably done.  How many I phone 6 do you see?  I see mostly people with 5 and 4.  ", "score": -4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Yah there totally going to bounce back. \nAnd tesla is the next GM.......   ", "score": -1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "There stock has been trending down for almost two years now. It'll probably continue to do so.  By done i mean if you think there going to be what they where they won't.  The hype is over", "score": 1, "replies": []}]}]}]}]}]}
{"title": "$NVDA Where is the end?", "selftext": "Where do you think the stock will stop climbing considering it has reached an all time high today. ", "id": "4rvk8g", "created_utc": 1467995876.0, "score": 5, "upvote_ratio": 0.58, "num_comments": 10, "comments": [{"body": "Why do people post this question so much? $NVDA has been making all time highs for literally months now. The trend is strong, and it has the momentum, volume, and news, to continue. There's no reason for it to stop yet. ", "score": 5, "replies": [{"body": "Agreed. I'm more wondering if there will be a price dip before earnings in a few weeks. ", "score": 1, "replies": [{"body": "No if anything the stock is going to continue it's run. Don't worry thought it's currently trading at a whopping 45.27 P/E ratio ...lol. It's due for a massive pullback, and I mean massive. Great firm, but those are some dot.com level inflation rates. \n\nhttp://www.nasdaq.com/symbol/nvda/pe-ratio", "score": 1, "replies": []}]}]}, {"body": "I don't understand the mentality of \"oh it's too high it must fall down\" thinking. If a company is doing everything right then why should it fall down? Nvidia has been on a tear lately just simply dominating anything it competes against. From the GPU, to AI, to mathematics crunching, and self driving I don't see how this stock should fall unless there is a huge event that affects Nvidia.", "score": 2, "replies": [{"body": "I feel like it's a natural feeling to worry about jumping on well performing stocks at the wrong time. For many stocks, I believe this is smart. \n\nNVDA doesn't seem to be one of those stocks. It's financials are more than healthy. It's future looks bright with much potential to grow. I see NVDA as a very good investment. It's a SAFE investment with nothing on the radar to worry about bringing down their value. WITH NVDA, you've invested in a stock that WILL continue grow. Quickly, like it has lately, or slowly.\n\nIf I had the extra buying power, I'd probably buy now, and if it goes down in the near future, buy more.", "score": 4, "replies": [{"body": "I'm long Nvidia, but saying it's a safe investment is ridiculous. A $20+ billion company with a P/E over 40 is, by definition, a hyped and therefore risky investment", "score": 2, "replies": [{"body": "Is it hyped for the right reason though, they're trying so hard to break into the deep learning field they are going to begin funding startups with their own resources ", "score": 1, "replies": []}]}]}]}, {"body": "Just Google: \"NVDA Stock Predictions: Nvidia Should Also Take Lead In Mobile-Centric Artificial Intelligence\"", "score": 2, "replies": []}, {"body": "Yea, people kept saying the same about Amazon, look at it now.\n\nIf a company keeps doing well, stock price will keep going up.", "score": 1, "replies": []}, {"body": "When a stock makes a new high, there's no target price. But u can use fibonacci extension tool to find target levels like 127% etc ", "score": 1, "replies": []}]}
{"title": "But $NVDA now or wait until earnings report?", "selftext": "Thinking there may be a potential dip in a few weeks before the earnings report, but it's rising so fast I'm wondering if that dip will still be higher than the $50 it's at today. Thoughts?", "id": "4rwdso", "created_utc": 1468005205.0, "score": 6, "upvote_ratio": 0.63, "num_comments": 10, "comments": [{"body": "Bought NVDA at $27..where's this dip everyone keeps on speaking of?", "score": 7, "replies": [{"body": "Fucking Brexit spooked me into selling/putting stop loss order at $45. I didn't want to lose my beautiful 135% gains... Hoping it take a small little dip so I can rebuy", "score": 1, "replies": [{"body": "Try not to get emotional, very important rule when it comes to investing.\n\nI remember Brexit, I watched my stocks fall, I wasn't worried. Then a few trading days later I made up almost all the losses during the Brexit rally.\n\nBrexit caused panic, emotions can have a large effect on the market.\n\nIn my view, stocks were on sale after brexit, a good time to buy.", "score": 3, "replies": []}]}, {"body": "The earnings dip he is referring to are people either cashing out right before earnings to not take risks, or people pushing down the stock for some reason perhaps to make higher gains.. It happens very often before earnings or other events.. \n\nYou can kinda predict which way the news will go if the stock either suddenly rises before a pending event or suddenly drops before an event. It'll usually go the opposite direction. That's what I've noticed at least.", "score": 1, "replies": []}]}, {"body": "I mistakenly sold my shares not to long ago, to only buy them back.", "score": 2, "replies": [{"body": "Sold all my shares at the start of May.  I suck at investing.", "score": 3, "replies": [{"body": "You're not really investing, you're gambling.  I'm guilty of it too.  Once you have the capital, just let certain stocks sit and ride for years, and buy more during the dips.  That's investing.", "score": -1, "replies": [{"body": "Hell, i'd had the stock for years.  I made money, just could have made a ton more if i'd held it a little longer.", "score": 6, "replies": [{"body": "I had NFLX years ago, then it dipped from like $20 to $11 in one day, and I panicked and sold. \n\nEveryone has their sob story.", "score": 1, "replies": []}]}]}]}]}, {"body": "Technically bullish. Set your stops. ", "score": 1, "replies": []}]}
{"title": "WHY is Deutsche Bank shitting the bed?", "selftext": "[deleted]", "id": "4rt27h", "created_utc": 1467954633.0, "score": 4, "upvote_ratio": 0.75, "num_comments": 13, "comments": [{"body": "Nothing to do with their balance sheet but recently talked to a guy who runs the forex desk at a European bank, he told me DB is so broke they can't even afford to fire people lest they give them their severance. Place seems like a shitshow.\n", "score": 9, "replies": [{"body": "Wow. So it's going belly up any day now. ", "score": 3, "replies": [{"body": "That's not happening ", "score": 2, "replies": [{"body": "Wait... Are you Jim Cramer?", "score": 2, "replies": [{"body": "No, this is Patrick ", "score": 7, "replies": []}]}]}]}]}, {"body": "They're exposed to like... Derivatives and shit... And it's bad. Hope this helps. ", "score": 3, "replies": []}, {"body": "Balance sheet and funding issues. It also doesn't help the AT1 creditors (\"coco bonds\") didn't fucking realize what they were holding earlier in the year and panicked over the fear the EU may force a bail-in on DB.   \n\nI believe DB had the largest trading book (by notional value) in the entire industry and they have some heavy exposure to peripheral EZ countries.    \n\nThe ECB will not let DBank fail. DB fails and the financial system will probably collapse considering the precarious state it is in right now. People are already anxious about the British banks and fleeing the peripheral banks - a DBank flop will accelerate this panic. I hate when mainstream media starts quoting CDS prices but a lot of your typical vanilla senior CDS pricing is back to those February highs when investors initially panicked about DB, SocGen, Credit Agricole, etc. \n\n", "score": 3, "replies": [{"body": "DB != Lehman.. The party isn't over yet, fags", "score": 2, "replies": []}]}, {"body": ">Deutsche Bank shitting the bed\n\nYou read my post!", "score": 1, "replies": []}, {"body": "-------------------", "score": 1, "replies": []}, {"body": "[DB's chief economist is begging for _at least_ €150 billion in bailout money for European banks.](http://www.reuters.com/article/us-europe-banks-idUSKCN0ZR0RT)\n\nI'm pretty sure this is just a warm-up number to get the bailout (sorry, *monetary stimulus*) discussion going.", "score": 1, "replies": []}, {"body": "[This reason](https://youtu.be/dQw4w9WgXcQ)", "score": 0, "replies": []}, {"body": "oh jesus christ..... KYS sir.", "score": -3, "replies": []}]}
{"title": "Time to buy VIX?", "selftext": "[deleted]", "id": "4ruyt0", "created_utc": 1467988676.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 10, "comments": [{"body": "there is some free dog shit outside better grab it quick", "score": 20, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "WomboComboed?", "score": 4, "replies": []}]}]}, {"body": "difference between cheap and undervalued", "score": 7, "replies": []}, {"body": "It's got room to fall for a while before the next spike. Don't need a crystal ball, just look at the behavior patterns", "score": 2, "replies": []}, {"body": "just loaded up on a teaser position for fun\n\nhttps://gyazo.com/852f2814592382b0ec6c8633f4620a45", "score": 2, "replies": []}, {"body": "You mean VIX, the thing whose value is mathematically derived from SPX options activity?  Seems legit. ", "score": 2, "replies": []}, {"body": "How will you \"buy\" vix? with VXX or TVIX? Do you want contango decay out your asshole?", "score": 2, "replies": []}, {"body": "Yup. Waiting on the political risk coming up with the prez elections ", "score": 1, "replies": []}, {"body": "Go all in YOLO. Do it. \n\nActually, nothing is preventing VIX from going lower. We'll probably see a market rally next week, so be prepared for $10 VIX. I don't like buying things that have an obvious downward bias.", "score": 1, "replies": []}, {"body": "FUCK NO", "score": 0, "replies": []}]}
{"title": "SolarCity: What's going to happen?", "selftext": "Dear fellow WSB denizens,\n\nI picked up some SCTY a few months back in anticipation of an acquisition by Tesla. Is this actually going to happen? If so, is it going to be a stock swap or an outright buyout of my shares? Reports have me confused on this. \n\nThanks and gfy.", "id": "4rvaqf", "created_utc": 1467992814.0, "score": 4, "upvote_ratio": 0.75, "num_comments": 16, "comments": [{"body": "Worked in residential solar for 5 years - that company is bloated and not managed well.  SCTY has never been profitable, their model is based on a 7 year MACRS schedule which is hemorrhaging money in overhead.  Too many employees, bad installs means they have to go back and fix mistakes constantly (instead of installing more panels).  TSLA doesn't make sense with SCTY, if you own a Tesla you wouldn't go with SolarCity for your solar panels (yelp them).  GFY.", "score": 8, "replies": [{"body": "I disagree. The main concern for both EVs and renewables is battery storage.  Tesla is already working on a home storage unit for its Powerwall. So going from electric vehicles to solar to home storage does make sense. It all depends on the energy storage and use.\n\nI think Elon gets his way and they acquire Solar City. He usually does.\n\nThat said I realize Solar City and Tesla both are losing money as of now. Betting on either is a bet on how good of a CEO you think Elon Musk is. ", "score": 1, "replies": [{"body": "What do you disagree with?  Yes, distributed storage is the way of the future.  However TSLA's battery wall is currently for commercial use only and has never met it's production figures.  Chrysler/MCB, BMW, they've all announced battery walls in the future - why place your bet on one specific manufacturer that is trying to be 2 companies at once (auto and battery).  An unproven product, far off from commercial realization - coupled with a poorly reviewed company that is not profitable; Musk had to step in to both companies to save them (meanwhile he is also running SpaceX).  Musk is not the messiah, and only has so many hours in the day.  Meme stocks.", "score": 3, "replies": [{"body": "Tesla actually discontinued their 10kwh powerwall, the one they are developing is for home use not commercial use. They are continuing with the 6.4kwh.\n\nI disagreed with the statement that solar city is not a good fit within Tesla's umbrella. I believe that if the financials and right, and that is still an if, they align very well together and would fit nicely under one company umbrella. They deal with the same core issue. Battery performance.", "score": 2, "replies": [{"body": "Totally separate companies, no mutual synergy or client base (other than: solar panels + battery / Musk = profit!!).  \n\nYou are also not considering political headwinds.  You still have to connect back to the grid (interconnection), who says utility companies will allow a battery system to interconnect to their grid?  Arizona comes to mind.  Not to mention solar is not even close to grid parity - 30% Federal Tax credit had to be extended, along with state specific benefits (feed in tarrif, REC's).\n\nFor that to make sense TSLA will have to approach every SCTY customer and say \"hey, wan't a battery wall?\". The catch - it won't be free like the solar panels ($0 down).  The door to door approach won't work, and again - if you can buy a Tesla you sure as shit won't choose SolarCity as your installer.\n\n  $JCI is a better bet.\n", "score": 2, "replies": [{"body": "I understand what you're saying but if you really want to go off the grid and be green you need a home battery pack. So not as much Tesla selling it as people wanting it. If you think other companies are better than I can support that. I just think that these three actually relate much better than I suppose you do. \n\nAnyway nice analysis. GFY", "score": 2, "replies": [{"body": "Right back at ya, GFY.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "We're gonna rock down to electric avenue...", "score": 3, "replies": [{"body": "Gonna take it higher!", "score": 3, "replies": [{"body": "dot dooo dooo", "score": 3, "replies": []}]}]}, {"body": "Somethings going to happen", "score": 2, "replies": [{"body": "Thanks, gfy", "score": 3, "replies": []}]}, {"body": "I don't believe so. Investors won't let it. I don't think regulators would care. But there is some interesting accounting going on. ", "score": 1, "replies": [{"body": "Tesla already extended an offer to SolarCity and SolarCity has assigned a [two man committee](http://www.cnbc.com/2016/06/28/solarcity-appoints-a-two-person-committee-to-decide-whether-to-sell-to-tesla.html) to determine if the offer is beneficial.  Given the bloated nature of SolarCity, why wouldn't they accept the offer now?  The ball is in their hands, after all.", "score": 3, "replies": []}, {"body": "Indeed, the accounting is weird. Mainly in it for the YOLO/lolz, but it'd be nice for this to turn out to be a nice little pay day. ", "score": 1, "replies": []}]}, {"body": "If it doesn't, expect the stock to dive further.", "score": 1, "replies": []}]}
{"title": "How to yolo on options?", "selftext": "If I were to predict AAPL going up $2 in stock price in the next 30 days. Which option calls would benefit me the most? \nIn the money or out of money? What expiration date? What strike price would make me the most?\n\nIs there a calculator that does all this math for me somewhere without paying?\n\nNo I don't want to read 10 pages worth of bs , just tell me how to yolo. ", "id": "4rvglz", "created_utc": 1467994718.0, "score": 1, "upvote_ratio": 0.53, "num_comments": 12, "comments": [{"body": "> No I don't want to read 10 pages worth of bs , just tell me how to yolo.\n\nIf you really want to lose money that bad then just give it to me faggot. Yolo'ing is one thing, but having no knowledge of options and yoloing then you're just a idiot.\n\n> If I were to predict AAPL going up $2 in stock price in the next 30 days. Which option calls would benefit me the most? In the money or out of money? What expiration date? What strike price would make me the most?\n\nLet's say apple is at 97 right now, hypothetically. You expect apple to be 99 in 30 days. \n\n**Best method:**\n\nBuy a 97-99 call vertical expiring 4 weeks from now. \n\nInitial outlay: $86 (net debit) see details\n\nMaximum risk: $86 at a price of $97 at expiry\n\nMaximum return: $114 at a price of $99 at expiry\n\nBreakevens at expiry: $97.85\n\nhttp://imgur.com/ahYVXKM\n\nNet debit of 86 cents for 1 vertical. If you do this, your gains will be MAXIMIZED when apple is 97 on expiration:\n\nhttp://imgur.com/WMDPO8S\n\n**The autistic method**\n\nBuy a 99 strike call for aug 12, approx 1 month out.\n\nInitial outlay: $155 (net debit) see details\n\nMaximum risk: $155 at a price of $95 on day 11th Aug 2016\n\nMaximum return: infinite on upside\n\nBreakevens at expiry: $100.55\n\nhttp://imgur.com/a/rTUs9\n\nYou'd have to buy a fairly ITM call, like under 94 strike, to make decent gains at 99. Even then, the call will be very expensive. http://imgur.com/S17m4ZK\n\nThe spread is your best bet. Don't be an autist. ", "score": 7, "replies": [{"body": "How you gonna go and do the work for him. Kids these days want everything given to them and then he'll be braggin to his buddies at McDonalds that he's a big YOLO'er. Tell him to GFH and learn something for once. Faggot.", "score": 8, "replies": [{"body": "*Maximum return: infinite on upside*\n\ndas it mane\n\nfull autism FTW", "score": 6, "replies": []}]}, {"body": "Wtf why you no teach this autist how to use faggots delight.  ITM calls not Yolo enough. Autist wants a Yolo, give him a Yolo he'll never forget", "score": 3, "replies": [{"body": "yah I was gonna say.. this shits not yolo. I would just buy weekly OTM calls. ", "score": 3, "replies": [{"body": "He said 30 days...", "score": 0, "replies": []}]}]}, {"body": "Bro, where do I get the chart for http://imgur.com/WMDPO8S\nIs there a software for that or does my broker have that once I sign up for options? Thx", "score": 1, "replies": [{"body": "Hey\n\nThe website is optionsprofitcalculator.com. It's not part of a broker or anything.", "score": 1, "replies": []}]}]}, {"body": "Following", "score": 3, "replies": []}, {"body": "Only buy options at least $25 ITM. That is $25 free dollars you get x 100 = $2500 instant value. Expiration date 1-3 days. Any more and your options are filled with thetans. Volume 0 is what you want to see at your strike, anything more means you are chasing money (more demand = higher cost = wasted money).", "score": 3, "replies": []}, {"body": "* Step 1: Pick an option\n* Step 2: **GFY**\n* Step 3: Go wax my yacht deck\n\nHope that was short enough for you.", "score": 3, "replies": []}]}
