{"title": "Google parent Alphabet’s stock hit with two downgrades this week", "selftext": "In his research note, Shmulik said Alphabet’s “narrative has caught up with the fundamentals.” In other words, the stock is priced to match the company’s current performance and outlook. He also raised concerns about the way market sentiment went negative on the company after OpenAI announced ChatGPT in Nov. 2022 only to turn positive when the tech titan debuted its own generative AI software in May.\r  \n\r  \n“What do we imagine would happen then, in any of the next 2-4 quarters, if Google Search numbers were to come in 'soft'? We imagine investors may once again ring the alarm bells around AI-related risks to Google's Search moat,” Shmulik wrote.\n\nThe analysts also pointed to Google’s Search Generative Experience (SGE) as a potential headwind for the company’s search advertising business. SGE is Google’s experimental generative AI-powered search platform. Like Microsoft’s Bing, it uses generative AI to provide users with answers to specific queries. The problem, the analysts say, is that the generative AI responses occupy screen space that is currently used to serve ads on the normal Google Search page.\n\n“We recognize that \\[Google’s\\] SGE roll-out is still in its very early stages (limited beta in the US only), with the integration of ads still being figured out,” Walmsley wrote in a research note. “But our initial testing of SGE shows material changes to \\[search engine results page\\] vs. the ‘old’ Google…which we see as demonstrative of the potential disruption to Google's well-oiled Search monetization machine.”\r  \n\r  \nGoogle is also increasingly facing challenges from the likes of Meta and Amazon in the digital advertising space. TikTok is also quickly playing a larger role in the industry. Increased spending on generative AI technologies could also cut into Alphabet’s margins.\r  \n\r  \nThe company is also staring down a slew of regulatory challenges including calls by the European Union’s European Commission to break up Google’s massive advertising business, which the commission says violates antitrust laws.", "id": "14l5hf7", "created_utc": 1687946967.0, "score": 96, "upvote_ratio": 0.75, "num_comments": 76, "comments": [{"body": "Both analysts simultaneously raised their price targets. Interesting you left that out.", "score": 141, "replies": [{"body": "A dumbass poster on r/stocks pushing their own agenda? *gasp*", "score": 53, "replies": [{"body": "Yep. Price targets are pretty much useless for stock pickers but they shouldn't be left out.", "score": 8, "replies": [{"body": "I think price target says a lot about how credible an analysts buy/sell/hold ratings are.\n\nFor example, I've seen analysts rate certain meme stocks a Hold, all while having a price target that was 97% below where the stock was currently trading, which really destroys the credibly of a \"Hold\" rating.", "score": 3, "replies": [{"body": "Hold rating means Sell recommendation 95% of the time. \n\nPrice targets show analysts are mostly idiots, especially in bear markets.\n\nHence why few provide them.", "score": 4, "replies": []}]}]}]}]}, {"body": "One analyst says too little AI the other says too much AI. Really makes you think", "score": 37, "replies": []}, {"body": "Google.com remains free to use and I don't think the vast majority of people are ready to replace that with a 20$/mo service that's actually going to make them read more and provides a singular response. Google is still great at taking quick questions, giving a concise and usually accurate response, and providing more than one source.", "score": 21, "replies": [{"body": "And yes they need to do better. Yes search is worse. But the competitors are all either getting worse or trying to use AI Search (at extremely high cost per click).", "score": 3, "replies": []}]}, {"body": "The issue with them getting an AI bump is that there’s no actual substance to it, just sentiment. And sentiment quickly fades especially when every company is now rolling out ai in some capacity (or at least pretending to)", "score": 37, "replies": [{"body": "I’d argue they didn’t really get an aI bump relative to say an Nvda when they’re trading at a lower pe now versus the historical. I own google but sundar is out of favor with the street right now.", "score": 9, "replies": []}, {"body": "There's no actual substance to it? Generative Search is 100% working. I used it today. \n\nIs that not substance?\n\nBy your logic Microsoft doesn't have substance either. No company outside Nvidia actually has revenue from \"AI\".", "score": 12, "replies": [{"body": "Where are you getting that from? I didn’t say anything about Nvidia or Microsoft. I said a stock rising solely off ai buzz has no substance to it. That is true for every company. That doesn’t mean these companies have no substance, it means their rise is based solely on the hype around ai and not their core business. \n\nGreat you used generative ai, did you pay for it?", "score": 1, "replies": [{"body": "I paid for it through parasitic ads despite my ad block. \n\nTurns out that clicks still matter and links still matter whether you have ad block or not. It's actually often better for ads when they know the consumer is clicking on what they actually want, and not some trash popup.\n\nSGE is working at Google. It is substance. Bard is functioning. Clearly has improved since February. \nGoogle uses Generative Machine Learning since at least 2018. That's substance. \n\n\"AI\" is over hyped in the near term. I agree. But Google is also trading at 21 Forward PE when its peers are at 70/33/32/28 (Amzn/msft/aapl/meta). Google is already discounted for recession.", "score": 9, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Obviously \n\nBut the highest flyers always crash the hardest", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Highest flyers are always the companies which expand valuations and not earnings. Far easier to outperform low expectations than high expectations. \n\nGoogle is currently low expectations relative to its peers. And for good reason since they've fumbled the ball multiple times", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Sure and neither are AAPL or MSFT at all time high P/E ratios.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}, {"body": "obtainable flag automatic mountainous start enjoy quaint humorous salt illegal ` this message was mass deleted/edited with redact.dev `", "score": 18, "replies": [{"body": "Google has a moonshot strategy that follows a mix of R&D and Acquisitions. \n\nGoogle's entire business outside search is purely due to R&D and Acquisitions. YouTube, Waymo, Hardware, networking, Gmail, & GCP. All were not around originally. \n\nAre you saying that Google has few successful projects? Well yes, that's also true for other companies.", "score": 15, "replies": [{"body": "bow toothbrush tap aloof history nail simplistic domineering paltry yoke ` this message was mass deleted/edited with redact.dev `", "score": 3, "replies": [{"body": "You're literally shilling now. Seriously? \n\nGmail was internal R&D. What the hell is wrong with that? \n\nWaymo is providing an immense amount of data to Google maps and Google Auto. Waymo is also the furthest along in FSD with lidar. \n\nYouTube was bought because Google prints money with Search but knows Search won't always be perfect. Now YouTube is the biggest video platform by far. \n\nYou ignored GCP & networking lol not to mention chip design (TPUv5)", "score": 17, "replies": [{"body": "profit crush include sable salt bored oil bright sleep heavy ` this message was mass deleted/edited with redact.dev `", "score": 0, "replies": [{"body": "Tbh, the above commentor is quite on the money with how far ahead Waymo is in terms of FSD (even compared to firms that have a “good rep” of doing it well like Tesla). So I don’t know what you mean by “how far along competition is”.", "score": 15, "replies": [{"body": "Tesla's reputation is bad now (government regulators are after them) even if it was good it was a mirage because it was based on an inferior technology (visual spectrum).\n\n FSD today relies on other drivers getting out of the way of their erratic behavior, which is why they hit pedestrians so much, because pedestrians can't move fast enough. \n\nI'm not aware of anything life changing happening in that space since 2021. On the experimental side the tech up until then was just as garbage as it's always been. Act flashy because you can drive the bits that a drunk or or half blind or inattentive human can too, handwave the parts that are too hard. \n\nAssistive technology, not fully autonomous vehicles, is the way forward for safety. I know safety isn't the priority for industry but it sure is for governments.", "score": -2, "replies": [{"body": "Waymo is currently operating robot taxis in several metros.\n\nI have ridden in them personally many times.", "score": 5, "replies": []}]}, {"body": "memory continue subtract subsequent safe nippy liquid bake vast rinse ` this message was mass deleted/edited with redact.dev `", "score": -2, "replies": []}]}, {"body": "Your counter opinion isn't even a counter. You used two cases where they support my view (Gmail, Waymo). And another where it's not supportive of your view (YouTube). \n\nI did my best to address your \"counterpoints\" and show how they don't even make sense.\n\nMore broadly I agree that Google is wasteful. That's always been it's strategy though. Miracle moonshots. And my point is they've had some big moonshot successes in R&D and acquisitions.", "score": 5, "replies": [{"body": "scandalous sharp boast smile reminiscent screw abundant fly jellyfish divide ` this message was mass deleted/edited with redact.dev `", "score": 1, "replies": [{"body": "$1.55t market cap", "score": 2, "replies": [{"body": "correct absorbed dinosaurs fly materialistic slimy file station erect disarm ` this message was mass deleted/edited with redact.dev `", "score": 1, "replies": []}]}]}]}, {"body": "There is literally no evidence to suggest that Google is losing search market share. The public aggregators suggest it is steady since ChatGPT has released and bing is actually down. Whether those are accurate or not is questionable, but we do know that search revenue was slightly up for Q1, which tells us that they haven't lost market share.", "score": 0, "replies": [{"body": "overconfident bedroom fearless distinct resolute exultant chief jar advise bells ` this message was mass deleted/edited with redact.dev `", "score": 0, "replies": []}]}]}]}]}]}, {"body": "ever heard of Google Graveyard?  \nhttps://killedbygoogle.com/", "score": 8, "replies": [{"body": "Such a sad look back at Google's potential products", "score": 8, "replies": []}]}, {"body": "In all fairness tho they did add 30% more people to their workforce yoy from 2021 to 2022 but revenue and earnings didn’t quite follow.", "score": 2, "replies": []}]}, {"body": "Google seems very scared on loosing on the ai. They feel extremely threatened. Every other day is some google news about someone at google saying something about ai. \n\nImo is that ceo sucks. It has transformed google searches into a SEO nightmare of product only results where I have to add Reddit to the query to get a normal answer. For absolutely fucking everything the results are product filled links and each one of those is loaded up to brim in display and video ads making it complete useless. \n\nObviously the time is ripe for Microsoft come in and swoop the web search biz with chatgpt. And that’s their trillion dollar mistake for that nerdy ceo that should have stayed as chief tech officer or something but not ceo. So many product failures and now the main money driver.\n\nAi in general as well as quantum computer\nIs filed w overhype and it’s like crytpo at this point. Just a few apps that are actually making it while the rest are\nUsing the hype to gain money. \nAnd the ceo of google using it to increase stock value and making google be relevant in the space is sad. That ceo needs to go", "score": 4, "replies": [{"body": "Meanwhile Google's search engine share is rising... \n\nhttps://gs.statcounter.com/search-engine-market-share\n\nThere's a difference between Reddit hivemind and reality. \n\nBeen 5 months since BingChat emerged. Where's the effect? Is it in the room with you?", "score": 25, "replies": [{"body": "I don't think your graph tells the whole story there, because there's a big thing missing from your graph, people using ChatGPT/Bing Chat/Bard for their \"search\" queries, or rather things that they used to use Search Queries to find that they know Chatbots can do better.\n\nI don't know about you, but the first place I go for at least a third of my searches these days is Bing Chat, which is built straight into Edge these days. But guess what, my queries to Bing Chat won't even show up in your charts. The fact that Bing has been dropping so much in those charts is IMO precisely because it's not counting Bing Chat queries.", "score": -1, "replies": [{"body": "To use Bing Chat most people use Bing/edge. Looking at browser shows very little movement either. \n\nI believe the number of people using Bing Chat relative to Google Search would shock you. I'm betting more people have used SGE Google in the last month than Bing Chat, simply due to the userbase being 40x larger.", "score": 3, "replies": []}, {"body": "Last month Google increased their market share by 29 times more than Bing.\n\nhttps://gs.statcounter.com/search-engine-market-share", "score": 1, "replies": []}]}]}, {"body": ">Google seems very scared on loosing on the ai. They feel extremely threatened. Every other day is some google news about someone at google saying something about ai.\n\nEvery company should always feel scared. This is a good thing, it's motivation.", "score": 6, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Microsoft is absolutely threatened by the fact that new companies do not sign up for their products.\n\nIn startup land, everyone uses Google Workspace.", "score": 2, "replies": []}]}]}]}, {"body": "So, its going on sale soon?", "score": 1, "replies": [{"body": "We’ll find out. They did get a ratings downgrade recently for whatever that’s worth", "score": 1, "replies": []}]}]}, {"body": "Analysts are worthless.", "score": 3, "replies": []}, {"body": "They get downgrade you buy \nThey get upgrade you sell \nWolf’s in suits always against us", "score": 3, "replies": [{"body": "Hence my avatar", "score": 2, "replies": []}]}, {"body": "I'd personally keep downgrading it for as long as Sundar Pichai is running things: no vision, no creativity and no innovation whatsoever. Worst CEO in big tech history.", "score": 19, "replies": [{"body": "Worst? Idk about that but insanely overpaid for the value he brings? For sure", "score": 44, "replies": [{"body": "When comparing his value to his peers at Microsoft/Apple/Nvidia etc. in the last couple of years, I'm safe to say that he is the worst we've seen in the last couple of years. And I agree, his salary is also outrageous. His departure would drive the stock price up by at least 15%.", "score": 13, "replies": [{"body": ">worst we've seen in the last couple of years\n\nbut your comment said \"worst ceo in big tech **history**\"", "score": 21, "replies": [{"body": "Yeah, Balmer was by far the worst I can think of.  Pichai needs Google to implode for him to get there.", "score": 9, "replies": [{"body": "I don't think any CEO could have really navigated the windows situation well. Microsoft was in a position where legal and technical pressure was going to result in bad outcomes regardless of who was in charge (Windows was technically a house of cards, and legal pressures needed to break foundational parts of that house of cards).\n\nHe missed on devices for sure. That's probably the biggest mistake that can be pinned directly to him. At the same time, he's the one that really pushed them into cloud services with Azure, which also set Nadella up for his future position. He also set a bunch of things in motion that Nadella has gotten a lot of credit for (the push onto other platforms started under Balmer, but saw most of its deliverables under Nadella). Also worth calling out that Microsoft was still growing their profits for most of his tenure.", "score": 4, "replies": [{"body": "He also lost the browser wars.\n\nInternet Explorer had the entire world by the balls in the 90s, so much so that MSFT got slapped with anti-trust. By 2012, that was basically toast.", "score": 1, "replies": []}]}]}]}, {"body": "Google stock is up 70% from 2019 and 95% since he took over. Is that bad???\n\nMicrosoft saw share value fall 88% from 2000 to 2002. Does that make their CEO somehow better than Pichai?", "score": 6, "replies": []}]}]}, {"body": "Balmer 2ould like a word but he was so bad his company stopped mattering in the tech world while he was there", "score": 3, "replies": []}, {"body": "think about it for a minute. What has Mark Zuckerberg done in the last 10 years that was groundbreaking outside of purchasing other winning companies", "score": 10, "replies": [{"body": "I find Zuck a strong second in most incompetent CEO's, but at least he added value to his company. Pichai hasn't done any of that, and got the average results you can expect from a company that his peers built into a money machine.", "score": -2, "replies": [{"body": "Pichai’s biggest contribution to Google was Chrome which is still a big deal for them, but since then he’s just been a “peacetime consigliere”", "score": 10, "replies": [{"body": "Which is perfectly fine for a CEO who is only a figurehead of the real owners. \n\nPichai was hired to keep Google Search healthy. By any measure he has succeeded. Google Search is bigger today than in 2020, 2018, or 2015 when Pichai became head of Search. \n\nhttps://gs.statcounter.com/search-engine-market-share", "score": 10, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Well what has Pichai missed? He hasn't missed anything. \n\nThe downgrade discussed here is due to TOO MUCH AI lol", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I keep getting replied to with absolute drivel\n\nWhat has Pichai missed? It takes 10 years to know? He's been in charge of Google Search since before 2015.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Ever heard of Steve Balmer?", "score": 2, "replies": []}, {"body": "https://killedbygoogle.com/\n\nThe amount of society's resources they can light on fire on a whim only to abandon it *disgusts* me.\n\nThe fact they did this and continued to absolutely print cash screams that our anti-trust regulators have been completely asleep at the wheel.  They need serious competition.", "score": 0, "replies": []}]}, {"body": "So let's be honest here since many people blindly follow analysts.\n\nTSLA gets hit hard by downgrades and slides to 240.  Unwarranted.  Suspicious since nothing fundamentally changed.  So I bought shares at 245.\n\nGoog gets hit by downgrades and slides to 116.  Unwarranted.  Suspicious since nothing fundamentally changed.  So I bought shares at 117.\n\nLORD files bankruptcy.  Fundamentally company is garbage.  I did not buy shares on the dip.\n\nSee the difference following media reports versus researching to see if anything has changed fundamentally about the company?\n\nGo figure.", "score": 2, "replies": []}, {"body": "> “What do we imagine would happen then, in any of the next 2-4 quarters, if Google Search numbers were to come in 'soft'? We imagine investors may once again ring the alarm bells around AI-related risks to Google's Search moat,” Shmulik wrote.\n\ngoogle is more than a search engine. Didn't read further. :\\", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "you are probably using outdated info, before android, before google's cloud platform, before youtube...... etc", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Yeah! I though so! You assume that all advertising revenues is by people searching in google search. You ignore the youtube ads revenue, the android ads revenue etc... \n\nhttps://www.oberlo.com/statistics/how-does-google-make-money", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Yeah! let's go back to my first comment that google is more than a search engine. \n\nlol! I like looping.", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "Last month Google market share increased by 29 times as much as Bing.   29 bps versus 1 bp.\n\nI think this entire Google search is threaten is way, way overblown and rather ridiculous.\n\nhttps://gs.statcounter.com/search-engine-market-share", "score": 2, "replies": []}, {"body": "I think what Google will end up doing is creating AI-generated adverts, and delivering them to AI-generated 'viewers', with the payment arriving from AI-generated vendors wanting to advertise AI-generated products to AI-generated hypothetical customers.\n\n#AI!", "score": 1, "replies": []}]}
