{"title": "Apple Vision Pro (MAKE UGLY PPL LOOK HOT)", "selftext": "It’s 3500 but we all know it’s gonna drop later. By the 5th Gen shit be having great battery. Lower price. Even thinner and lighter. Sorry meta, Apple VR too badass\n\nBlah blah blah, work n shit we all know\n\nBut there’s porn\n\nThere’s already companies that are design pocket pussies for Apple vision pro. \n\nPorn sites r like, we coming in too\n\nAlso if your ugly af, or ur partner is, everyone wear the headset and put a filter and viola, they look hot\n\nGaming yes, desktop computer yes.\n\nSo much shit so much potential\n\nImagine having a virtual pet or unicorn bitch in your house when u wear it\n\nIf you live in a Shitty apartment in the city and your view is someone’s dumpster,\n\nWear the VR and there go, view of the whole city cuz\n\nOnly Apple can do this shit. Get ready \n\nHalf of u fuckers buy  fuck pillows n shit so I know you will pay thousands for this experience.\n\nAlso in the future the VR get cheaper and better and lighter.\n\nAlso Apple is the best", "id": "141us07", "created_utc": 1686005174.0, "score": 108, "upvote_ratio": 0.81, "num_comments": 78, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|3 months ago\n**Total Comments**|2488|**Previous Best DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/11v3dux/super_bank_creampie/) \n**Account Age**|3 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "If you meet a girl on a dating app who uses filters you can bring the goggles on the date to be safe.  Who will be the first to develop the beer goggles app?", "score": 45, "replies": [{"body": "I'm on it.", "score": 10, "replies": []}, {"body": "You know what's worse than such an app potentially existing?\n\nIt's that, guessing what the user base will be made up of, the most popular avatars probably won't be human.", "score": 7, "replies": [{"body": "Now that you mention it, I need to grab my 3500 quick.", "score": 1, "replies": []}]}, {"body": "I think they already exist", "score": 1, "replies": []}]}, {"body": "\"By the 5th generation, lower price\". You hear that guys? Apple cuts prices with future gens! - all the Apple permabulls ![img](emote|t5_2th52|4641)", "score": 31, "replies": [{"body": "Imagine laughing at permabulls of the biggest company in the stock market. \n\nThis man got dropped on his head twice as a baby.", "score": 4, "replies": [{"body": "The biggest company in the stock market can make mistakes. At least I can actually distinguish this. I guess if I got dropped on my head it messed up the parts that make me a permabull. \n\nThere is a difference between permabull and someone investing in a company with a solid performance. The ones that can trade down and then back up make more money :P", "score": 4, "replies": []}, {"body": "So what?. GM, 3M, and Cisco have all been the biggest company in the world at one stage. GM went bankrupt. 3M and Cisco are mere shadows of their former glory days.", "score": 2, "replies": []}, {"body": "Yep, sure hate my $26.77 buy in average. Bag holder here", "score": 3, "replies": [{"body": "I wasn't even born when AAPL was at this price. I'm surprised you were able to open up your browser and log in to reddit and type a comment.", "score": 10, "replies": [{"body": "That’s about right, younger than 15 years and pretending to trade stocks.", "score": 0, "replies": [{"body": "Your math is a little off there grand dad but ok", "score": 0, "replies": [{"body": "Someone doesn’t know how splits work.", "score": 2, "replies": [{"body": "I'm not going to do the math for you. Even if you consider the splits they happened in 2005 which means I would still be older than 15. \n\nAapl was $25 in 2012. In almost all aspects I wouldn't be 15 to get your avg price. I'm not going to spend more time on this, you have too much time in your retirement home and you just want to waste mine", "score": -1, "replies": [{"body": "Jesus Christ you really are daft - first off, APPL last split was 4-1 in 2020, then one in 2014 for 7-1, your sleuthing abilities are almost as bad as your math/reading comprehension.  Your comment stated you weren’t even alive when the price was at $26, yet you posted a date of 2012 when it was at $25, so by your own comment you were born sometime after 2012 which puts you at no more than 11.  Fucking moron.", "score": 2, "replies": [{"body": "Wow. I meant for avg. Buy price. Chill out. Lol so technical in an argument. Wow you got tilted so I won? Thanks bro. Did you have fun arguing with an 11 year old from your wheelchair? *\\*", "score": -1, "replies": [{"body": "Bahahahah, nice out.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "with stock splits/DRIP, pretty sure that buy price would be like 15 years ago. i havent looked up all the split dates tho\nedit: 2014 or 2016 would be some possible dates, depending on div reinvestment, so LESS than 10 years", "score": 0, "replies": []}, {"body": "Hahahaha nice one, fellow embryonic sack of fluid", "score": 0, "replies": []}]}]}]}, {"body": "just like iPhones, iPads, Macbooks and all are so much cheaper with every new generation", "score": 1, "replies": []}]}, {"body": "Every day we stray further from God’s light.", "score": 107, "replies": [{"body": "Aka Steve Jobs", "score": 9, "replies": [{"body": "The power of Tim Apple compels you?\n🫨🍆💦🥵", "score": 7, "replies": [{"body": "Cumpels", "score": 3, "replies": []}]}]}]}, {"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 17, "replies": [{"body": "Watch, within 10 years everyone will have the Apple head set", "score": 0, "replies": [{"body": "Headset, within 20 years everyone will have the Apple watch", "score": 3, "replies": [{"body": "IMO, the Apple watch isn’t all that special", "score": 1, "replies": []}]}]}]}, {"body": "Think of how ugly the average person is then you realize that half of them are uglier than that.\n\nBullish ![img](emote|t5_2th52|4276)", "score": 12, "replies": []}, {"body": ">It's clear that you are a very intelligent and successful person. I'm sure you have a great life and I envy your success. As for the VR, it sounds like it has potential but we'll have to wait and see how it develops. Thank you for sharing your thoughts!", "score": 16, "replies": [{"body": "I can’t tell if VM is displaying sarcasm or he’s being serious.", "score": 8, "replies": [{"body": "That means it's working", "score": 3, "replies": []}, {"body": "It means VM is “powered by GPT - 4”", "score": 1, "replies": []}]}]}, {"body": "Now we can add Cyberpunk to the list of shit that’ll eventually come true", "score": 5, "replies": []}, {"body": "With just 36 payments at around $100 a month the price doesn’t seem that bad just add it to the rest of your subscriptions 🤣", "score": 4, "replies": []}, {"body": "you’re talking about the minority here\n\nwealthy people that can’t get laid", "score": 4, "replies": []}, {"body": "Imagine all the headlines that people wearing VR AR goggles in public are using AI to make people nude in public. Or they slap it on and people are doing hardcore porn until they switch off porno mode.", "score": 4, "replies": []}, {"body": "I would like to personally look down on myself in VR....and see a big, hard, beautiful, perky boner on me while watching porn, and doing it virtually. We're all basically tiny, impotent,  guys here.....who wish we had a huge, rock hard, one. All the middle-aged guys can definitely relate.", "score": 8, "replies": [{"body": "Let me get this straight, you just want VR goggles to marvel at your *own* genitals?", "score": 15, "replies": [{"body": "I once downloaded a lesbian vr experience on Oculus. Mind-blowing.", "score": 1, "replies": []}]}, {"body": "Bro if this is my future just kill me now", "score": 5, "replies": []}]}, {"body": "At this rate Apple will have a p/e ratio of 69 in no time.", "score": 3, "replies": []}, {"body": "yeah I think of this as a 1st gen OLED smart tv.\n\npeople are literally going to be selling their other devices for this thing. slowly then all at once.\n\nsome corporations are going to have their employees using them. then their friends will use it.\n\nthen recreationally\n\nall while the price drops until first its $700 used on craigslist in 2026, and then the new version MSRPs at $600 in lite mode or some shit\n\nyeah I can see it", "score": 5, "replies": []}, {"body": "The hand of god has spoken", "score": 2, "replies": []}, {"body": "Wow, Apple really knows how to boost people's confidence. Can't wait to see the before and after pics.", "score": 2, "replies": []}, {"body": "Lots of port on the quest already. Not going to lie only reason I thought about buying one", "score": 2, "replies": [{"body": "It's lacking depending on what you're into. And people look skewed like a fisheye lens most the time , close up faces are fucking hilarious. Not many options for female pov although I haven't check the gay categories maybe they'd have a few receivers", "score": 2, "replies": []}]}, {"body": "Who actually wants to live like this? Really activates the almonds.", "score": 2, "replies": [{"body": "Nobody does.  The fanboys are drooling (for now).  Everyone else knows this product sucks.", "score": 1, "replies": []}]}, {"body": "I would absolutely buy one if I could choose who was naked in meetings.", "score": 4, "replies": []}, {"body": "Hell forget just making ugly people hot.\n\nYou can strap on this VR headset and have your bros bend over (no homo) and as far as you are concerned your best boys bussy is Megan Fox in the doggy position.\n\nDon’t know if this makes you a bull or a gay bear but me and the boys be cumming tonight!", "score": 2, "replies": []}, {"body": "For real people forget there’s rich people too and we pre ordering that shit.", "score": 1, "replies": []}, {"body": "I hear there's already an app for the Vision that simulates riding a Segway in VR.  The future is now!", "score": 1, "replies": []}, {"body": "bears2broke coming in with some rock solid DD here. Probably based off their patented & FED certified BTFP-oops i mean BTFD trading strategy.", "score": 0, "replies": []}, {"body": "The hefty price tags seems worth it just for the sake of being able to porn with largest screen known to man.", "score": 0, "replies": [{"body": "Why do people keep saying this? There are, and have been, lots of other VR devices that let you do that, right? What's special's about Apple's product?", "score": 0, "replies": []}]}, {"body": "It’s call money that’s how ugly people look hot", "score": 0, "replies": []}, {"body": "Hard pass.  That product is overpriced garbage.  Tim Cook fucked up again.", "score": 0, "replies": []}, {"body": "It's not gonna sell well.  Speaking as someone who is a VR enthusiast.  The hardware price point is insane and they don't have any seriously compelling software.\n\nAlso, their customer base buys apple products as personal acsessories, kind of tech jewlery.  This is not something convinent to carry around with you or use.", "score": 0, "replies": []}, {"body": "🍎", "score": 1, "replies": []}, {"body": "Yes, tell it to me like I've only got a 5th grade reading level, perfect", "score": 1, "replies": []}, {"body": "ALL IN ON 0DTE CALLS!!!", "score": 1, "replies": []}, {"body": "Poetry", "score": 1, "replies": []}, {"body": "Viola?", "score": 1, "replies": []}, {"body": "Where does one locate these fuck pillows? Asking for a friend.", "score": 1, "replies": []}, {"body": "Looks like garbage. I’ll stick to Meta.", "score": 1, "replies": []}, {"body": "*Enhance* on view of someone’s dumpster…", "score": 1, "replies": []}, {"body": "Someone bought apple calls and are sweating", "score": 1, "replies": []}, {"body": "So you're saying I am going to be potentially able to be sexually attracted to minorities as a result of this technology? \n\nFuck that", "score": 1, "replies": []}, {"body": "So has steam? There’s literally an adult game that drops weekly. Meta quest is better in my opinion.", "score": 1, "replies": []}, {"body": "People don’t like wearing things on their face. It’s really that simple.", "score": 1, "replies": []}, {"body": "headsets suck, no market for it.", "score": 1, "replies": []}]}
