{"title": "How US stocks rose 20% from their lows, and where they might be going", "selftext": "U.S. stocks have defied fears of a recession, a banking crisis and soaring Treasury yields to rise 20% from their October lows - one definition of a bull market.\r  \n\r  \nThe benchmark S&P 500 index closed at a low of 3,577.03 on Oct. 12, 2022, down 25% from its all-time high after the Federal Reserve unleashed a series of bruising interest rate increases to fight decades-high inflation.\r  \n\r  \nOn Thursday, it closed up 0.6% at 4,293.93, amid growing optimism over the economic outlook and a rate hiking cycle that appears to be nearing its end. Here are some features of the index's rally, and a look at where stocks might go from here.\n\nWhile markets seldom rise in a straight line, the S&P 500's journey from the bottom took 164 days - the longest 20% climb from a bear market low in five decades. Among the factors holding stocks back was a surge in Treasury yields to their highest levels in decades that dulled the allure of equities by offering investors the potential to earn attractive income in government-backed bonds.\r  \n\r  \nA crisis that saw the biggest bank busts since the Great Recession also shook investor confidence, as did worries over a potentially catastrophic fight over lifting the U.S. debt ceiling.\n\nThe narrow breadth of the S&P 500's rally has been a concern for some investors, with just seven stocks - Alphabet (GOOGL.O), Apple (AAPL.O), Microsoft (MSFT.O), Amazon (AMZN.O), Meta (META.O), Nvidia (NVDA.O) and Tesla (TSLA.O) - responsible for almost all of the index's gains this year. Many investors view these stocks as safe bets in uncertain times. Their gains were also driven by excitement over advances in artificial intelligence.\n\nMore recently, however, the market's gains have shown tentative signs of broadening out to other stocks.\n\nMeanwhile, volatility has subsided - not only in stocks, but in Treasuries and currencies.\r  \n\r  \nOne reason for the calm in markets is investors' belief that the Fed is unlikely to deliver many more of the rate hikes that shook asset prices last year.\r  \n\r  \nInvestors have also been encouraged by evidence showing that the U.S. economy continues to be resilient in the face of the central bank's monetary tightening, while inflation slowly cools. The U.S. Citigroup Economic Surprise Index (.CESIUSD) shows U.S. economic data has in aggregate topped market expectations, helped by stronger than expected numbers for employment and consumer spending.\r  \n\r  \nA 20% gain from bear market lows has in the past heralded further upside for stocks.\n\nIn four of the last six bear markets, the S&P went on to rise 20% or more in the six months after hitting this milestone.\n\n[https://www.reuters.com/markets/us/how-us-stocks-rose-20-their-lows-where-they-might-be-going-2023-06-09/](https://www.reuters.com/markets/us/how-us-stocks-rose-20-their-lows-where-they-might-be-going-2023-06-09/)\n\n&#x200B;", "id": "145049d", "created_utc": 1686301620.0, "score": 163, "upvote_ratio": 0.95, "num_comments": 87, "comments": [{"body": "At least they are accurate in saying this is 7 stocks that pulled us out.", "score": 89, "replies": [{"body": "Still a pretty misleading headline. The index rose that much buoyed by just 7 stocks, that they did at least point out, but by saying just “stocks rose 20%” it sounds like they all on average did which they absolutely did not.", "score": 40, "replies": [{"body": "I'm somewhat bullish because it's only 7 stocks that really grew. Hopefully, the rest of the S&P recovers with a more stable inflationary environment, supply chain, and debt ceiling resolution.", "score": 6, "replies": []}, {"body": "Bears sounds smart bulls make money", "score": 2, "replies": []}]}, {"body": "yes the 7 largest companies in the world are doing well", "score": 5, "replies": [{"body": "They are doing fine but stock doesn’t actually mean anything to the company", "score": 1, "replies": []}]}, {"body": "Idk about that one man. If you look at NYSE's Market Internals it's more than half of the stocks listed on the NYSE that have been advancing these past few weeks.", "score": 0, "replies": []}]}, {"body": "You heard it here, Tesla is now a safe bet in uncertain times 😆", "score": 53, "replies": [{"body": "Don’t forget about the company worth 1 T with a PE of 200", "score": 36, "replies": [{"body": "Which?", "score": 2, "replies": [{"body": "[deleted]", "score": 22, "replies": [{"body": "username checks out", "score": 3, "replies": []}]}]}]}, {"body": "(Groan)", "score": 1, "replies": []}]}, {"body": "\"rate hiking cycle that appears to be nearing its end\"", "score": 17, "replies": [{"body": "Rate hiking cycle which effects are yet to be felt..", "score": 36, "replies": [{"body": "Whose effects", "score": 4, "replies": [{"body": "Thanks, something felt off in my previous comment", "score": 3, "replies": []}]}]}]}, {"body": "I got a bonus at work and funding my IRA next week. So expect the market to go down once that's all done.", "score": 19, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Perfect time for you for things to go south tbh", "score": 2, "replies": []}]}]}, {"body": "7 companies brought us here, is it safe to assume others will follow suit which would lead to continued increases for the next months?", "score": 12, "replies": [{"body": "I mean… small/medium tech companies are already up too. DDOG, SHOP, CRWD, IOT", "score": 8, "replies": [{"body": "SoFi", "score": 1, "replies": []}]}, {"body": "Most likely. Bears are only focused on megs tech. However, ddog, sofi, pltr, fsly, net are up 20% ytd.", "score": 3, "replies": []}, {"body": "I think 7 will lead us back down", "score": 5, "replies": [{"body": "Especially if we don’t see any earnings related to ai", "score": 4, "replies": []}]}]}, {"body": "Sounds like it's time to invest in all of the underperforming sectors while they start to catch up with the tech giants and validate the bull market.\n\nI'm buying XLF, XLU, and XLE.", "score": 6, "replies": [{"body": "I took a pretty big position with this exact thesis.  XLU down 6% in the past month.  Opened 300 80c/Oct on DUK, one of the most beat down utilities.  Plan to exit around 99, or reversion to the mean.", "score": 4, "replies": []}]}, {"body": "Lol what r u talking about… in both 08 and 01 the sand p gain 24-40 percent before plummeting down…", "score": 14, "replies": [{"body": "The Sand P gained 20 to 40%? Where was the new sand being added from?", "score": 3, "replies": [{"body": "Saudi Arabia ;)", "score": 3, "replies": [{"body": "They do have an infinite amount of sand.", "score": 2, "replies": [{"body": "Right? It’s a great business model!", "score": 1, "replies": []}]}]}]}, {"body": "The difference here is those times didn’t take 8 months to exit bear market territory after entering it. Really only saw one “fake rally” that was convincing last year (with that rally not hitting the 20% mark in the S&P), and now if a secular bear market began early last year, we have the longest (or at least arguably the longest) bull trap in history here. Probably at the very least gonna get a double top with 4800 within 12 months or so.", "score": 3, "replies": [{"body": "You’re right it’s different this time, that’s why the media misrepresents what the fed says… the difference here is we had chatgpt invented which caused the last bubble look at the charts the s and p is on the stagnation stage and the AI is on the wow that was crazy let’s slow down stage. This recession was a series of microbubbles(ev,crypto, regional banks and now AI) also this isn’t the longest one in history the was blatant misrepresentation of facts…", "score": 4, "replies": [{"body": "Uh…find me a US market rally from a bear market low from the past that lasted 8+ months, hit the 20%+ mark, and then went on to set a new lower low after that. \n\nI don’t think you can, which is why if we’re in a secular bear market, several unique things have already occurred.", "score": -2, "replies": [{"body": "1978-1980 a period of 456 days it didn’t enter a new cycle. They just ignored the risks… lol if you count tech the qqq def did. and didn’t have the s and p power. Also Japan…", "score": 4, "replies": [{"body": "I don’t think there’s a specific time in between 78 and 80 where you had a 20% rally take nearly 8 months, and then go on to set a new lower low after that rally that took that long.\n\nIt’s too long, which means that if this is a secular bear market, you probably go double top with the ATH before starting a new downslide. \n\nThe bull case is that we didn’t see the end of the secular bull market that’s been led by tech stocks last year after all by the way. And right now, it’s a deal where macro says no, but technicals say yes to that case.\n\nI’d follow technicals as long as the NDX remains over the swing high from early February.", "score": 0, "replies": [{"body": "Technicals are being blurred by the macros… it honestly we did a bailout for the banks that’s the only reason it didn’t crash into oblivion… every piece of media I see is misrepresenting what is said in order to dump. Tecnicals? None of the stocks that pumped the market have high volume which in my business ethics class is literally how we look for manipulation. Excluding nvidia liquidity is low and getting lower… I think this time it’s easier than ever to mislead retail in order to dump your positions on them….", "score": 3, "replies": []}]}]}, {"body": "You mean a rally up 20% followed by a new low? It happened in March 2009.", "score": 2, "replies": [{"body": "Uh, I do not believe that rally back in March 2008 took 8 months to get to 20%.\n\nFrom a time perspective I believe this has gone on for too long. Possible we did begin a secular bear market last year, but we likely shoot for a double top with the all time high first now since we’ve gone for this long (not necessarily in this year though).\n\nI’m wrong if SPX drops under 3860ish, then AI helped lead to an amazing last gasp run by the Nasdaq that was as good as the runs it saw in a bull market.", "score": 1, "replies": [{"body": "You know people are grasping when they talk about how slow the recovery has been as a bullish signal. \n\nWhere’s the move back into banks?", "score": 1, "replies": []}, {"body": "There was a huge multi- year run up prior to the crash. I'll check later.", "score": 1, "replies": [{"body": "Oh if you buy the secular bear market thesis, then this is a completely different story here. \n\nThen yes, you can see a 20%+ run over any kind of period, then fall to a new low.\n\nI just think since this has gone for as long as it has, that you’d probably see a double top with the ATH before the fall of doom occurred, just like with 2000-2009, but maybe since many odd things have already occurred here, that won’t be necessary and we will see this rally set a record for timespan of rally without at least getting back to the ATH.", "score": 1, "replies": [{"body": "What exactly is your idea about 20% and 8 months? Can you please say it again?", "score": 1, "replies": [{"body": "That we've probably gone for too long to consider this to still be a bear market rally.\n\nDon't understand the difficulty in understanding this. \n\nNow maybe this is just a cyclical bull within a secular bear market, but that will be something that is learned over time.", "score": 1, "replies": [{"body": "I agree, it's not a bear market.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "How along after peak did it plummet? \n\nWe’re certain it isn’t just a economic cycle", "score": 1, "replies": []}, {"body": "Lows to Highs, Highs to Lows\n\n2003-2007 Gain 95%\r  \n2007-2009 Loss 57%\r  \n2009-2010 Gain 80%\r  \n2010-2010 Loss 16%", "score": 1, "replies": []}]}, {"body": "I just don't get it. There are so many companies issuing pessimistic outlooks, and their stocks are tanking 20-30 percent after earnings. But somehow this market says no biggie", "score": 4, "replies": []}, {"body": "I got the timing right and sold a spy 360 put back in Oct 2022 and got assigned. It offsets the 2 puts for 476 I sold and got assigned in Jan 2022. $61 unrealized gain so far!", "score": 7, "replies": []}, {"body": "Right, because it definitely feels like we avoided the recession.", "score": 10, "replies": [{"body": "You don’t think we did?", "score": 5, "replies": [{"body": "Not by changing the definition.", "score": 1, "replies": [{"body": "2 quarters of negative GDP? Or do you have a different one?", "score": 1, "replies": [{"body": "I do. I have a different definition, which is the new one after they changed it to avoid being in a recession. \n\nhttps://en.m.wikipedia.org/wiki/Recession\n\nIn the United States, a recession is defined as \"a significant decline in economic activity spread across the market, lasting more than a few months, normally visible in real GDP, real income, employment, industrial production, and wholesale-retail sales.\"[3] The European Union has adopted a similar definition.[4][5] In the United Kingdom, a recession is defined as negative economic growth for two consecutive quarters.[6][7]", "score": -1, "replies": [{"body": "So what are you saying? You can argue both ways in your definition. GDP slightly down, employment up, income up.", "score": 1, "replies": [{"body": "We had 2 quarters of negative gdp then they changed the definition. To put it simply my friend, we are in a recession.", "score": 0, "replies": [{"body": "We had the 2 quarters of negative GDP in the 1st half of 2022 so that was a year ago at this point. So are you saying the recession ended or we are still currently in a recession?", "score": 2, "replies": [{"body": "Still in one. inflation is insane and my money goes nowhere anymore. The cost of food is absolutely ridiculous my friend. Most that I know are struggling so it sure feels like a recession to me.", "score": 0, "replies": [{"body": "frame placid shocking intelligent school library sand marble repeat concerned\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 1, "replies": []}]}]}, {"body": "Sure, but it really does not feel like it. Baby recession at most.", "score": 0, "replies": []}, {"body": "Were", "score": 1, "replies": []}, {"body": "Didn’t you just say that your definition is different from the 2 consecutive negative quarter definition?", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I mean, it could've been (still can be) much worse. The people expecting SPY to dump to like 300 were always certified insane though.", "score": 5, "replies": []}]}, {"body": "nice.  another year or so to break even to where things were in ‘22 :(", "score": 2, "replies": [{"body": "A year? That's nothing.", "score": 5, "replies": []}, {"body": "Awesome!  That means you have a full year to DCA at lower prices.  How lucky are we?", "score": 1, "replies": []}]}, {"body": "Hopefull it will stay up there for awhile.", "score": 2, "replies": []}, {"body": "Always when you least expect it \nElection year probably gonna be bloody", "score": 5, "replies": [{"body": "so applying your first clause to your second clause, what you're actually saying is election year will be a raging bull market.", "score": 12, "replies": [{"body": "If someone not anti-business surprises us and is leading in the polls then a raging bull market might happen.", "score": 3, "replies": []}]}]}, {"body": "We've bottomed and now we'll have 10 year bull market as always, making money in stocks is easy asf.\nYou guys missed the bottom last year and now you're gonna search for bad stocks but cheap that will lose you money or keep yelling at the clouds that the world is unfair, boo hoo!", "score": 8, "replies": [{"body": "Gloating Andy over here", "score": 1, "replies": []}]}, {"body": "Down - CNN reported that we're now in a bull market.", "score": 2, "replies": []}, {"body": "Down, they are going down. Nothing has changed to cause the economic environment to somehow recover like nothing happened. If anything IMO the only reason the stocks recovered this much at is because US removed the debt ceiling for the next year and a half, giving them permission to print as much as they can in that time frame. Who knows how much the Fed will print but If I was a gambling man (and I am) I would say the number that they are going to print in that time frame will start with a T...", "score": 2, "replies": [{"body": "I think you need to delve into the actual numbers a bit more. There are clear data points educated finance professionals are relying on, as opposed to gut feelings about the effect of raising the debt ceiling (which was never seriously in doubt) and the Fed \"gambling\" (whatever the hell that means).", "score": 5, "replies": []}, {"body": "> Nothing has changed to cause the economic environment to somehow recover like nothing happened.\n\nThe markets will always recover from a bear run before it makes sense. This is why you and so many others will miss out on the recovery, and miss out on huge gains. It happens every single time.", "score": 2, "replies": [{"body": "Who said I'm missing out? I'm heavily invested and I pulled my start up money out I'm playing with the houses money now. But if you blindly invest in the market cause others think we are coming out of a bear market, you're going to have a bad time.", "score": 1, "replies": [{"body": "> I'm heavily invested\n\nthen your bear thesis is pointless. If youre not acting on it then its not useful in anyway and you dont even believe in it", "score": 6, "replies": []}]}]}, {"body": "Smart, it will probably be 2 or 3 and ten will still net you a win.", "score": 1, "replies": []}]}, {"body": "Word", "score": 1, "replies": []}, {"body": "20% haha rookie numbers, I'm up 67% on AvePoint", "score": 0, "replies": []}, {"body": "I got too bearish after a while during this bear market. Made some awesome buys but sold too soon and realized few gains - that's fine, you live and learn - but there's been only positivity for mega-cap tech recently, some reversion to the mean is likely (though not guaranteed). I'd be taking a bit of profits off the top right now.", "score": 1, "replies": []}]}
{"title": "The confirmation has been made: we are now officially in a bull market", "selftext": "", "id": "145947f", "created_utc": 1686326493.0, "score": 100, "upvote_ratio": 0.87, "num_comments": 79, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|3 weeks ago\n**Total Comments**|0|**Previous Best DD**|\n**Account Age**|7 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "What you mean WE??", "score": 48, "replies": [{"body": "He mean weed", "score": 6, "replies": []}]}, {"body": "So great, they’ve pumped the indices from recent lows through megacap stocks. When does retail get rug pulled?", "score": 70, "replies": [{"body": ">So great, they’ve pumped the indices from recent lows through megacap stocks. When does WSBDEGENERATES get rug pulled?\n\nDespite what you might believe most retail are long term investors who just buy index funds via automated monthly investing and hold for a long time.", "score": 14, "replies": []}, {"body": "[removed]", "score": 24, "replies": [{"body": "No when my balance goes down it’s dumb people who don’t know what’s coming", "score": 3, "replies": []}, {"body": "My only long position is in a SPAC around NAV. Pretty difficult to get rugged. \n\nOther than that, I trade options majority of the time.", "score": 4, "replies": []}]}, {"body": "When are you regarded apes going to fucking learn. They're not going after you, they're  going after each other.", "score": 3, "replies": []}, {"body": "Gotta keep collecting those 401k contributions as long as they can, before the pull comes.", "score": 0, "replies": []}]}, {"body": "Dr Evil: “Right”", "score": 32, "replies": []}, {"body": "My calls don’t think so…", "score": 24, "replies": [{"body": "Well my puts agree. At least we're both getting fucked.", "score": 18, "replies": [{"body": "Spring break gangbang", "score": 4, "replies": []}]}, {"body": "Really? I’m up more than 11,300% on calls since May 1st", "score": 1, "replies": []}]}, {"body": "Is that the same shit they pulled when they redefined recession?", "score": 32, "replies": [{"body": "What *is* the actual definition for bear vs bull market? How long/high does a “bear market rally” have to go before its just a bull market?", "score": 12, "replies": [{"body": "If the index rises 20% from the lowest point of a bear market, it becomes a bull market. If the index falls 20% from the peak of a bull market, we enter a bear market.", "score": 24, "replies": [{"body": "Thank you!\n\nSo from the beginning of October to now SPY has gone up 20.5%, so we *are* in a bull market apparently.", "score": 16, "replies": [{"body": "Not “apparently”\n\nBy every definition we are actually in a bull market.", "score": 12, "replies": []}]}, {"body": "> index falls 20% from the peak of a bull market, we enter a bear market.\n\nso what you are saying is that now we just have to watch this Bull market fall 20% from today's high of 431.99, and then we will enter a new Bear market?   \nAlright so buy puts now before they get expensive from dropping 20% from the high of this Bull market. Gotcha.", "score": 4, "replies": [{"body": "Correct. Good luck though. The average bull market is 1900 days. And we’ve never had one less than 500 days", "score": 12, "replies": [{"body": "There have been plenty of times the S&P has gone up 20% or more from a low and then quickly come back down again.  The most recent example is from the Great Recession.  From 11/20/2008-1/6/2009 the S&P went up from 752.44 to 934.7, an increase of 24.2%, and the final low was 676.53 on 3/9/2009, down 27.6% from the 1/6/2009 local high.\n\nIt went up >20% twice within the 2000-2002 bear market and 5 times in the Great Depression.\n\nIn % terms 30% would be a much safer threshold than 20% to say a new bull market has started.  There has never been a time in history when the S&P has gone up 30%+ from a local low and then gone on to make a new low from there shortly after.", "score": 8, "replies": []}, {"body": "So it’s been 240 days since the SPY low on October 13th. February 25th, 2024 will be 500 days. To make it easy to remember, we should remain in a bull market until at least Valentine’s Day. That’s or we’ll witness history.", "score": 3, "replies": [{"body": "It would not be history, see my other comment.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "No, it is a bull market by the age old definition and no hocus pocus. Same way as there wasn't a recession since there was no *real definition* merely a *simplified rule of thumb*.\n\n\n\n\nThe simplified part is why people here couldn't understand anything else. A recession is only official when called out by the same people who *always do it* in the US. A recession is *usually* 2 terms of shrinking economy together with an aggressively rising unemployment (which we never saw)", "score": -2, "replies": []}]}, {"body": "we've been in a bull market for 13 going on 14 fucking years.", "score": 6, "replies": []}, {"body": "Gunna be the shortest bull market in history.", "score": 6, "replies": []}, {"body": "Down it goes!", "score": 8, "replies": [{"body": "Time to short", "score": 5, "replies": []}]}, {"body": "Very nice, now let's see what the bull market looks like without NVDA & APPL", "score": 4, "replies": []}, {"body": "I'm literally seeing only red today so idk", "score": 8, "replies": []}, {"body": "I’m feeling bullish about it", "score": 3, "replies": []}, {"body": "They’re running these articles before the next fed fomc on Jun 13/14 where rates go up another 25 bps? There mf’er can go fk themselves.", "score": 3, "replies": []}, {"body": "Well that's it folks the top is officially in. ![img](emote|t5_2th52|4640)", "score": 3, "replies": []}, {"body": "Lmaooo I love this… ignore recessions report gains, ignore the bear markets in the last two recessions ignore the indexes made a 24 percent jump and the Nasdaq made a 40 percent jump before crashing. Perms bulls are a joke. I can’t wait to be bullish for sustainable development and not propagandized material for hedge funds", "score": 10, "replies": [{"body": "And the people that made millions out of thin air are those that disregarded the numbers and played the psychology game.", "score": 1, "replies": [{"body": "Yeah I don’t think a lot of the big players made a lot of money vs expense… I can’t get behind rally the dumb for your own benefit. The def of manipulation… I know I’d make more money if I played into that but I can’t morally get behind that", "score": 1, "replies": [{"body": "Was hard for me too. People say fomo is bad but in reality thats what pushes a stock price higher and higher. The stock market will remain irrational longer then one can remain solvent. Also why buying stocks that are at lows seems like the morally right play ( discounted) but, with nobody buying them there is a prob a good reason for that. Play the fomo game. Wait for the stock to start reversing, positive volume coming in a a flood of Uber- bullish articles. Just something I've noticed with stocks like Meta, Nvda, etc.", "score": 2, "replies": []}, {"body": "Oh well as long as you buy you me options morally lmao what a crock", "score": 1, "replies": []}]}]}, {"body": "This market is like survivor where the bears turn down the peanut butter expecting a steak and end up getting nothing\n\nThe simple answer is that the obvious indicators are finally in alignment for them to take the dummies money but in the end somebody moved their cheese and they are the dummies but are blind to it\n\n“Markets just HAVE to crash with low breadth, elevated p/e’s and an inverted yield curve!”", "score": 0, "replies": []}]}, {"body": "Inverse mass media.  Did we all forget media was screaming sell! sell! 2 months ago before the rally? Now they’re saying buy it all.", "score": 2, "replies": [{"body": "It’s sorta like a bank run if people are confident then the crash won’t happen but if we aren’t then it will happen.", "score": 1, "replies": [{"body": "Frfr its all psychological", "score": 1, "replies": []}]}]}, {"body": "7 mega caps....wooohooo", "score": 2, "replies": []}, {"body": "Just when you get comfortable... then the bear shows up\n\nCommercial real estate crashing still a thing?? We had some big developers stop making payments at 2 new SF buildings in the past 2 weeks.", "score": 2, "replies": []}, {"body": "Alright 🌈 🐻 s \n\nYou ready to get Fucked.", "score": 1, "replies": []}, {"body": "Why the fuck are my ATM calls red then", "score": 0, "replies": []}, {"body": "Finally time to start trading bullishly intraday", "score": 0, "replies": []}, {"body": "Find the lube bers", "score": 0, "replies": []}, {"body": "Ty for fucking my calls", "score": 1, "replies": []}, {"body": "It will probably be over in a week.", "score": 1, "replies": []}, {"body": "thick green dildos are good for stretching", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Stop the fomo dude![img](emote|t5_2th52|4259)", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Love you brother![img](emote|t5_2th52|8882)", "score": 1, "replies": []}]}]}]}, {"body": "Few more week of other names to pump then we get the rug as earnings come out next q. they will be crap.", "score": 1, "replies": []}, {"body": "The \"confirmation\" confirmed by a few who control most of the wealth of the world, including the mainstream media. It's a bull trap market.  It's actually all a joke of a healthy market for the most part. Production, profits and business in general are detached from what we see in the stock market, because it's only a few people who are themselves detached from our reality, playing around with the stock market. \n\nAt any point the few can crash the market, prop it back up, or keep it flat, for a long time. Thanks to those movements, a few of us make money here and there, but the movements are unpredictable for the most part. The good news is that everyone's time is coming. The reckoning will happen. In the mean time, enjoy the best things in life, which are free.", "score": 1, "replies": []}, {"body": "I'm not a perma bear but I know a trap when I see one.", "score": 1, "replies": []}, {"body": "How many companies EPS’s were dropped to make it look like everyone is making $, how many of them had lower revenue YOY? A question not a statement", "score": 1, "replies": []}, {"body": "Wait, no change to the definition of “bull market”??? Thank god it only applies to market downturns.", "score": 1, "replies": []}, {"body": "Lol, tech is in a bull market.", "score": 1, "replies": []}, {"body": "Bobosisters..... not like this. It was supposed to be the BEAR DECADE!!!!", "score": 1, "replies": []}, {"body": "Is cramer bearish?? If he's not at least cautious then this isn't a bull market, more like a Bullshit market.", "score": 1, "replies": []}, {"body": "Gotta fit in all these great 1929 headlines before October.", "score": 1, "replies": []}, {"body": "Offical bull market that will last 1 month before we hit a offical bear market", "score": 1, "replies": []}, {"body": "Wait 'till JPOW opens his mouth on Tuesday.", "score": 1, "replies": []}, {"body": "Buying puts now", "score": 1, "replies": []}, {"body": "And inverse", "score": 1, "replies": []}, {"body": "Aliens are sucking brains from politicians and you people only care about money. Puts on everything after Powell speaks,  death of economy coming at us", "score": 1, "replies": []}, {"body": "My daily value change disagrees🤡", "score": 1, "replies": []}, {"body": "So Puts then.", "score": 1, "replies": []}, {"body": "Well here comes 15% down then", "score": 1, "replies": []}, {"body": "False Breakout.", "score": 1, "replies": []}, {"body": "My money is on this bet: https://www.reddit.com/r/wallstreetbets/comments/145zwdx/the_metals_coundervalued/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=1&utm_term=1", "score": 1, "replies": []}, {"body": "Of all the things you hear in markets this business of it’s officially a bear market with its 20% down and bull market when it’s 20% up has to be the most regarded\n\nIt’s like saying after you’ve reached cruising altitude that the plane has officially taken off", "score": 1, "replies": []}, {"body": "Bullshit maybe.", "score": 1, "replies": []}, {"body": "In March to June of 2008 (bear sterns collapsed in March of 08) the market rallied to a “new bull market” just before the most violent part of the cycle hit bottom.  \n\nThe same thing happened in 2001.  \n\nThe same thing happened in the 1980s. \n\nThe same thing happened in 1930.  \n\nThe market has never bottomed before rate cuts.", "score": 1, "replies": []}, {"body": "We’re", "score": 1, "replies": []}]}
