{"title": "Apple Is Now Worth More Than $3 Trillion, First Company To Hit Market Cap Milestone", "selftext": "", "id": "14n5lfi", "created_utc": 1688143700.0, "score": 431, "upvote_ratio": 0.96, "num_comments": 80, "comments": [{"body": "[removed]", "score": 55, "replies": []}, {"body": "That's crazy. To put this into context, the country which came 5th overall for GDP in 2022, had less than $3 Trillion", "score": 56, "replies": [{"body": "I don’t know why people like to compare GDP (which is more analogous to a company’s revenue) to market cap (which is net worth).", "score": 101, "replies": [{"body": "[deleted]", "score": -40, "replies": [{"body": ">Well becuse now Apple has received more money for their shares\n\nWell that’s not true. Market cap is the total value of shares times what is essentially the sale price of the last share sold. They didn’t all sell for that price.", "score": 29, "replies": []}, {"body": "True, but it's still kinda meaningless to compare them directly since GDP measures past/present valuations while market cap is a forward-looking metric.", "score": 11, "replies": []}, {"body": "nose zesty scarce mindless grab plough cobweb cow gullible detail\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*", "score": 3, "replies": []}]}]}, {"body": "Wealth and income are not the same thing, why do people keep mixing up these concepts", "score": 5, "replies": [{"body": "Stupidity.  Ignorance.\n\nAnd, more importantly, fodder for click-bait articles.", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 20, "replies": [{"body": "Second afaik. First close over. First time was intraday Jan 3 2022", "score": 9, "replies": []}, {"body": "I don't know why you have been down voted (take an upvote from me). I've been tracking Apple stock in my portfolio and occasionally check their market cap in my iPhone stock app.\n\nI can confirm I've seen Apple exceed $3B at least once, sometime around 1Q 2022. I think around $3.2B was the high.\n\nI've seen the articles saying this was the first time and (also) don't understand why.", "score": -11, "replies": [{"body": "It momentarily hit that number but didn't close above it. This is the first time it closed above that valuation.", "score": 11, "replies": [{"body": "I do remember seeing it exceed $3B and then staying above $3B multiple days.\n\nPer the post I responded to, I don't remember it \"crossing\" into $3B multiple times, but I distinctly remember it being over $3B for more than 1 day.\n\nIf I'm wrong, that I would say iPhone stock app which (I believe) uses Yahoo may have been wrong. But I do remember seeing it because I remember checking it against Saudi Arabia ARAMCO.\n\nEdit: I have been googling more. I've seen articles that confirms your intraday statement and have not seen anything to confirm mine. So guess I'm messed up.", "score": -6, "replies": [{"body": "https://companiesmarketcap.com/apple/marketcap/\n\nYou can see the market cap over time and it came close but not over 3 trillion before", "score": 2, "replies": []}]}]}, {"body": "Billion?", "score": 2, "replies": []}, {"body": "T", "score": 2, "replies": []}, {"body": "$3T", "score": 1, "replies": []}]}]}, {"body": "Lots of people will buy Vision Pro", "score": 10, "replies": [{"body": "Lots", "score": 8, "replies": []}]}, {"body": "I've been using Apple products since 1985 with a Macintosh. I've worked in music recording, graphic design, web design, virtual reality, and online community building. I've been using various Macs ever since, and added iPads and iPhones. Currently running a Macbook Pro, Macbook Air, two iPads, and two iPhones.\n\nApple products have been at the center of my  business and creative production work  continuously for nearly 30 years.\n\nI have a good amount of VTSAX, of which APPL is currently 6.53%.", "score": 9, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "You aren't missing much. Can't argue that they don't have a great ecosystem/integration. Other than that, overpriced and frustrating AF to use. Proprietary everything (though some of that is starting to change). And once you are in the ecosystem good luck switching to anything else.", "score": 5, "replies": []}]}, {"body": "You don't know what you're missing.", "score": 5, "replies": []}, {"body": "I did use Apple products for ~8 years. When covid hit and Apple started to implement sneaky shit like contact tracing I realized how important privacy and security is. So I switched to GrapheneOS and left big brother apple behind. Best decision ever.\n\nI trust Apple as is trust Google. NOT AT ALL!", "score": 0, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "The illusion of privacy is a powerful drug. I try to minimize what info I share, but no illusions that anything I do is truly private.", "score": 1, "replies": []}]}]}, {"body": "Sheeple", "score": -7, "replies": []}]}, {"body": "I am willing to bet it will be even faster to four trillion.  What people do not realize is the big tech companies have tons and tons of room to grow.\n\nSpecially Google, Apple and Microsoft.", "score": 8, "replies": [{"body": "How? Consumer electronics can only grow so much before they hit saturation. I haven't looked at Apple's books, but I have a hard time believing they're growing enough to constitute a $3T market cap.\n\nOf course they can always innovate into the next world changing must have product, but I don't think the headset is that piece of hardware.", "score": 4, "replies": [{"body": "Apple has found the sweet spot of selling consumer electronics. From the advertisement to the product placement and product stream, they know how to sell things you don’t need but want. From bringing out new iPhones every year, to updating iPads MacBooks and making them look “cool” to people of all ages. With Apple going into the augment reality space, and them working on bringing out an Apple branded vehicles, yes Apple stock has room to grow.", "score": 13, "replies": [{"body": "I’m honestly amazed how they manage Mac sales. There is so much competition with Apple in the laptops market segment and most computer programmes are written for windows. And still apple makes the smoothest and best looking laptops and keep growing.", "score": 5, "replies": [{"body": "Most software devs use macs for writing code. Like it’s not even close. It’s just a nicer environment than windows to build things in.", "score": 3, "replies": []}]}]}, {"body": "Apple will make many billions a year selling access to their customer base.\n\nWithin the next couple of years most people will have an AI agent.   Apple will sell this access to the highest bidder.\n\nThe AI hype is real.   We are going to see just massive change over the next decade.  Unlike anything in history.  The big three, Google, Apple and Microsoft will greatly benefit.   Also AWS (Amazon).   It takes massive resources to run the models and there is going to be a ton of them running in the cloud.", "score": 12, "replies": [{"body": "You really fell for the hype train, most people will not have an AI agent in a couple of years. Most companies yes.", "score": 3, "replies": [{"body": "In 2 years you don't think Apple or Microsoft are going to be charging consumers by the token for premium \"personalized\" ai bots? Sounds like you have your head in the sand to what's coming down the line.", "score": 4, "replies": []}, {"body": "Thing the natural progression for LLM will be personal agents.  That is going to come.\n\nIt will be an extremely strategic product and incredibly profitable as it will drive so much business.\n\nThings are going to radically change in the next couple of years and that is where Google and Apple having 99% of mobile will be able to get to the next level of valuations.\n\nGoogle does have the stronger position as they will also be running these models in their cloud on their TPUs.  Should be very profitable.\n\nMicrosoft should own this space in the enterprise with Amazon and then also Google getting some of this business.\n\nBut at this second Microsoft seems the best positioned for enterprise.\n\nBut it could change.   The next big event will be seeing if Gemini ends up being the next level of LLM.   I suspect it will.  But time will tell.", "score": 1, "replies": []}, {"body": "And we (the “customers”) will continue to supply the data for free to feed the AI agent.  Which they (the big 4 tech companies) will use to bleed us to death. We are the product being sold. Privacy and/or Terms & conditions laws need to be reformed by congress where a company can’t opt you in automatically to their rules & you have to opt out after. Also rights to data & privacy need to be strengthened. I don’t mind loaning my data to companies while I use their product but it move we stop using their products the data should still be ours. Meaning they must permanently delete or possibly even purchase our data.", "score": 1, "replies": []}]}]}]}, {"body": "Tesla has more room to grow than all 3 of those combined", "score": -10, "replies": [{"body": " Not sure about that. I don’t think Tsla is in AI. At least not directly. Like neurolink is not tied to Tsla.", "score": 2, "replies": []}, {"body": "Really odd statement.   The reach of Google is vastly larger than Tesla.  Heck the reach of Apple is many times greater.\n\nHow in the world could Tesla \"has more room to grow\"?\n\nBTW, I love Tesla.   Tesla is our subdivision car.   It was Escalades and then Audi and now it is clearly Tesla.  There is so many it is insane.\n\nI can't tell you how many families I know where the husband purchased one and then shortly later the wife had one.\n\nBut still the percent is far less than the families in my neighborhood that use multiple products by Google.   I mean it would be 100%.   Also Apple would be far higher than Tesla.\n\nMy big issue with investing in Tesla is that any negative macro news and Tesla is going to get completely hammered and far more than a Google or Apple.", "score": 0, "replies": [{"body": "You are only assigning value to the car business. In 10 years Tesla will be a massive energy distribution company with the ability to create and store energy, a real world AI company, a computing company (Dojo), a robotics company (Optimus), an HVAC manufacturer, a bank, an insurance company, and a oh by the way a car manufacturer that makes 20 million cars per year. If you think that’s not better than what google has you are not thinking this through imo", "score": -6, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "How so?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Google has the most reach of any company on this planet by a huge margin.\n\nThey have the most popular web site in history by a huge margin.  But then have the second most popular web site in addition.   They now have 16 different services with over half a billion DAU.  Nine that have over one billion DAU.\n\nThey have the most popular operating system in history with Android.\n\nThey have by far the most popular browser.\n\nThey have by far the most popular navigation with Google Maps.  I am typing this from SEA and Google completely controls the flow of traffic in SEA.  It is what Grab, taxis, food delivery and everything else uses.\n\nThey have lead in AI for almost 20 years now.\n\nWe are about to go through the biggest change in human history over the next 10 years.\n\nAnd you think Google has no growth perspectives?\n\nOr am I somehow misunderstanding?\n\nGoogle, unlike Apple,  Will get the huge benefit from AI not only on the front end but also the backend.   Critical is Google has the TPUs.  The LLMs take massive resources and Google will get better margins than anyone else as not dependent on Nvidia.\n\nIf you really believe Google does not have an incredible opportunity then it is one of the most ridiculous takes I have seen on Reddit in a bit.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Google is up 35% so far this year.  Think the market supports what I am saying.\n\nGoogle is going to just have the most incredible next decade.  They have been a leader in AI for almost 20 years now and now they get to get an amazing return on that investment.\n\nThis is the perfect time for Google.\n\nBTW, the fastest growing thing at Google has nothing to do with ads.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Can’t grow when people are fucking poor and can’t buy your shit. Infinite growth is impossible.", "score": 1, "replies": []}]}, {"body": "My first computer in 1997 was a Macintosh. PC people would laugh and say how lame it was. HA!! 😁😁", "score": -3, "replies": [{"body": "Ya I have the same memory. Imagine buying the Apple stock in 1997. It’s a good lesson in investing: if you find a product you love that has a visionary leader you buy it and don’t sell until retirement", "score": 5, "replies": [{"body": "My brother bought Apple stock way back when, he sold it when it doubled. He’d be filthy rich by now if he kept it.", "score": 4, "replies": [{"body": "I have a feeling Tesla will do the same over a 20 year period", "score": -1, "replies": []}]}]}, {"body": "No we wouldn’t.", "score": -1, "replies": []}]}, {"body": "TradingView and other trading software default their charts to Apple. New traders buy Apple by default. It has a lot of external support it seems.\n\nBut is it really worth $3T? Probably not.", "score": -13, "replies": [{"body": "I mean… most aren’t “worth” their market cap in today’s world, but if the collective population agree on a company’s “worth” then who is any random person to state that is somehow incorrect?", "score": 2, "replies": []}]}, {"body": "I don't think it's worth that much. 😕 best I can do is $500 Billion.", "score": -8, "replies": []}, {"body": "yet oil companies are evil", "score": -13, "replies": [{"body": "They are orders of magnitude worse than Apple.  It’s a ludicrous comparison anyway", "score": 7, "replies": [{"body": "not a single major US oil company using child labor to make gasoline", "score": -4, "replies": [{"body": "My man over here trying to somehow make oil companies look “less evil” in the most idiotic comparison anyone with half a brain can see through, lol.", "score": 2, "replies": [{"body": "between exxon and apple - which is most important to your way of life", "score": -1, "replies": [{"body": "It’s stupid to even make a comparison. Stop being some asshole who’s spreading obvious flamebait.", "score": 2, "replies": [{"body": "answer the question", "score": 0, "replies": []}]}, {"body": "Apple. I have an EV lol", "score": 1, "replies": [{"body": "and you’re ignorant", "score": 1, "replies": []}]}]}]}, {"body": "They just suppress knowledge from the 70s that they knew climate change was real and their industry was making it worse.  Now we get multiple “once in a century” weather disasters every year.  Not to mention disasters like Exxon Valdez and Deepwater Horizon. And let’s not forget price gouging the American public to record profits which has been a major factor driving inflation.", "score": 1, "replies": [{"body": "*doesn’t understand the laws of supply and demand", "score": 1, "replies": [{"body": "Demand has actually been going down for the last year.  And US production is close to all time highs.  They’re doing it because they know the clock is ticking on the entire industry.", "score": 0, "replies": [{"body": "it’s a global market jethro", "score": 1, "replies": [{"body": "No shit.   And prices have been on the decline for the last year even after OPEC cut production to try and prop them up.  Got one more squeeze of the juice before the industry goes into permanent decline.", "score": 0, "replies": [{"body": "Shell Oil sez hello", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Even if your idiotic comparison made sense, two things can be true.", "score": 1, "replies": []}]}, {"body": "To bad one of the worst companies on earth is doing so well.", "score": -6, "replies": []}, {"body": "3 Trillion market cap, 62 billion shareholders equity lol", "score": 1, "replies": []}, {"body": "my puts will print very soon.", "score": 1, "replies": []}, {"body": "It takes a LOT of work, patience, and brain power to get a company to this level.\n\nProps to Apple.", "score": 1, "replies": [{"body": "and hands of small children", "score": 0, "replies": []}]}, {"body": "Can they write a good manual yet?", "score": 1, "replies": []}, {"body": "I think it’s perfectly priced for the moment and needs to stay here until it proves to be be worth this crazy valuation.", "score": 1, "replies": []}, {"body": "Good products that last and not just a service or content provider.", "score": 1, "replies": []}, {"body": "It will be short lived.  There is an all-time high trendline that stops at 196.  I suspect Apple will be 1/3 of what it is by mid 2024.", "score": 1, "replies": []}]}
