{"title": "Hedging my TSLA in the money covered calls", "selftext": "Hey everyone.\nI have two covered calls contracts that have gotten away from me -they’re deep in the money.\nTSLA $185 July21. Tesla is at $250+ now. \nAside from rolling up and out, or buying to close, what’s a better to way to avoid assignment while keeping some profits beyond $185?\n\nAppreciate the help!", "id": "148lzgw", "created_utc": 1686680533.0, "score": 72, "upvote_ratio": 0.85, "num_comments": 84, "comments": [{"body": "There is no \"better\" way. There are only a lot of shitty ways. \n\nHopefully you wrote the strike so you will net a gain on share assignment? You didn't write the strike below you share cost basis, I hope? Taking assignment is a winning outcome if you selected a strike for a gain on the shares, so just be satisfied with that. I know the FOMO of that huge coulda/shoulda/woulda gain is hard to swallow, but every other alternative may be worse.\n\nYou'd have to be very, very confident that you will make up the cost of a rescue plan, like buying the call back, to make it worth rescuing a winning trade.", "score": 69, "replies": [{"body": "Thanks for your comment.\nMy cost basis is $172.5, so I am making a small profit, so FOMO is clearly in play now. \nIn your buying a long call example, Would the expiration date have to be the same jul21?", "score": 17, "replies": [{"body": "Which one? I deleted the vertical spread idea, because I forgot that the width of the spread adds additional risk of loss. \n\nMaking the expiration the same as the short call may be the only way your broker will free up your shares for trading. Turning the short call into a diagonal or horizontal spread may not be enough to free up the shares. It would depend on your option approval level and how your broker handles legging in.", "score": 4, "replies": [{"body": "Copy that. I don’t consider myself that advanced of an options trader to start those type of spreads. I guess I can just swallow the lost gains or roll out far enough for a credit while upping my strike price. And If the stock falls or goes sideways (wishful thinking on a volatile stock like TSLA, right?) for awhile I can always roll down.", "score": 3, "replies": []}]}, {"body": "> making a small profit\n\nYou’re making $1,250 plus the credit received for the call. What’s the issue?", "score": 5, "replies": [{"body": "He’s getting fomo and greed after seeing it run up.  It happens and any recuse will be costly.", "score": 10, "replies": [{"body": "That’s pretty much it.", "score": 3, "replies": []}]}, {"body": "Have you seen the run up? 56% this month. Just wondering if there’s a way to capture more. Apparently it’s not that easy and carries much higher risk", "score": -5, "replies": [{"body": "That’s the danger of selling premium.", "score": 5, "replies": []}, {"body": "You have to catch it before it runs too far away, tesla runs fast when it runs. Unfortunately your option has no extrinsic value anymore, so you can't really play theta. \n\nBest bet is to WAIT for a correction down and then rolling up and way out to late in the year. You will give up any potential future premium in exchange for some modest gains. \n\nPersonally i think the stock has more room to go higher, but plenty of macro events could bail you out. That said, if you want the liquidity for another play, do not roll to December, these options rarely expire early.", "score": 3, "replies": []}]}]}, {"body": "Idk that is what I do I write calls so I will gain 12% or more even if I do get assigned have some ccl that is upside down as yours like sure I probably losing out on $1000 but I'm going to net 12% plus my premiums", "score": 4, "replies": []}, {"body": "If you want to stay in it, sell an ATM CSP expiring this Friday. If it keeps rising keep selling weekly ATM CSPs so you can keep up with the gains. If it turns on you take assignment.", "score": 2, "replies": []}]}, {"body": "This is correct; the trade has not gone the way you wanted and any rescue will be costly.  I’d take assignment here and kick myself in the balls lol.\n\nThere is one way but only if you are sure you want to hold Tesla long term.  Sell 280 or 300 dec.  Will pay out about 30% more plus the premium.  That’s only if you are sure you are willing to ride with tesla no matter what happens.\n\nThis is Not financial advice, make your own decisions..", "score": 4, "replies": []}]}, {"body": "You could try selling puts to recoup some of the lost profit. I am in the sane boat having sold 6/16 $205 calls", "score": 17, "replies": [{"body": "Are you selling puts near current price ?  Worst case scenario you get those puts assigned above $205, while still having your covered call assigned - now you’re just paying more for the shares?", "score": 2, "replies": [{"body": "I’ve been selling 205 puts on a weekly basis and increasing the contracts I sell", "score": 6, "replies": [{"body": "Jun23 $205 is paying $.22. That’s a lot of contracts . Are you also borrowing margin to make those deals? That’s a lot of cash to plow down for small premiums, imo", "score": 10, "replies": [{"body": "I’m selling them for July 21. I own 700 shares of TSLA currently. I am selling 4 contracts at a time, and keep rolling up. I have the cash to cover.", "score": 7, "replies": []}]}]}]}]}, {"body": "I assume you collected the premium when the stock was BELOW 185. So while you are losing out on this Moon shot, you are still making money. That is the way CC work. \n\nAnything you do will only cost you money. Further, there is no guarantee that Tsla continues this blow off.", "score": 14, "replies": [{"body": "You’re absolutely correct. I’ve made money. About $2k each contract. I’m just being greedy as @papacharlie9 pointed out, it’s FOMO. \nIf it doesn’t make any sense, I just won’t get into any risky complex trade to salvage the missed profit. I was just curious to what others may have done or could do.", "score": 5, "replies": [{"body": "Consider yourself lucky, i have a covered call expiring Friday with strike price of $175.\n\n\nNext time I'm going to sell/buy a 2:1 call ratio, because this way, at least if it runs away from me there will be an added bonus for next time", "score": 4, "replies": [{"body": "That’s pretty smart. Use some credit to offset capped gains.", "score": 1, "replies": [{"body": "How is that different than just selling one contract, sell one will be offset by buy one?", "score": 1, "replies": [{"body": "Different strikes.", "score": 1, "replies": []}]}]}]}, {"body": "In the future you can buy an OTM contract above your CC w some premium. How much was a 250c?", "score": 3, "replies": [{"body": "Couldn’t have been much, definitely the strategy I will take in future trades. Thanks for the suggestion", "score": 3, "replies": [{"body": "Especially like 2:1 CC:BTO", "score": 2, "replies": []}]}, {"body": "This strategy is working for me with SMCI.  I expected the stock to run up as the AI trade got rolling so I bought 100 shares at $80, a $130 call 5 months out and then I waited to sell a covered call at $270 once the stock was trading around $250.  I lost lots of shares before I figured this one out.  The $130 call only cost me $260 and is worth about $11,000 now.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "TSLA has had an insane run up in 30 days - 56%! It was a delicate balance of not overreacting and rolling up $5-10 and tie the shares up for another 3-6 months.", "score": 2, "replies": [{"body": "> TSLA has had an insane run up in 30 days - 56%!\n\nOnly 56%?\n\nJanuary was a 100% gain ($105 to $210), so 56% gain in ~a month isn't an outlier here.\n\nUse tradingview and slap an RSI and MACD on the daily ('weekly' is better on most other stocks, but TSLA more volatile) - when the RSI crosses to the upside rebuy some CCs (and look at buying options 30-60 days out)... when MACD crosses to the upside rebuy the rest of them.  Then wait until they cross back to the downside before selling again.  Or don't - not financial advice.  \n\nIn the next 1-3 months TSLA will probably drop 10-20%, but it will probably be 300 down to 250 (edit: could be 280 down to 220), not 185, unless Musk repeats 2022 and dumps billions repeatedly.\n\nYou could try rolling, but I'd lean towards letting them get called away and waiting for the next strong entry after a pull back", "score": 6, "replies": []}]}]}, {"body": "Just let them get called them buy the shares back. What’s the big deal.  Why does everyone want to roll up call.  The loss in capital gains will be same.", "score": 4, "replies": [{"body": "Buy the shares back? Don’t think it’s that easy. There is a nearly $80 per share price difference from my initial $172.5 investment . I could sell a put but to make it worth it has to be near the current price which requires more capital than my  initial capital. and as someone else mentioned - Tesla can bomb anytime , then I’d be really underwater on a sold put. \nSo I’ll either wait for a pullback or invest the capital elsewhere.", "score": -1, "replies": [{"body": "How you going roll the call then?  You have to buy it back. Have to have money for that.  You can’t roll it if you dint have buying power to buy the call back", "score": 1, "replies": [{"body": "Technically I can roll out 6+ months out, collect a small credit while maybe gaining $5 per share - but then I’m tying up the shares for 6 months. If I think Tesla will come back down, then it could be worth it but if it continues to rocket then I’m back where I started this convo.", "score": 1, "replies": [{"body": "I'm in a similar situation. Got assigned at $190 and stuck in a July 21 $215 covered call. Here's my thought process.\n\nI've made about 2K on options premium and will make $2500 on the stock price appreciation. I can:\n\nA: accept assignment, find a 1 month DTE to sell TSLA CSP at or below $200 and be happy with the \"free money\"\n\nB: accept assignment, find different tickers to continue to wheel until TSLA pulls back a bit \n\nC: roll out like 6 months and continue feeling this pain...it could rocket from here and end up at $500...and I will make like $200 for a $5 to $10 roll...so like another $1200  in additional profit\n\nD: roll out like 6 months and get lucky enough to not be assigned but miss out on other tradeable opportunities\n\nE: roll out like 6 months and Elon tweets something egregious or he leaves the company or some event that causes the stock to tank 50%...then I will wish I had accepted assignment for July\n\n\n------\n\n\nI choose scenario B.", "score": 6, "replies": [{"body": "Amazing breakdown. What other tickers interest you?", "score": 1, "replies": [{"body": "On my long term portfolio, I look at stocks with recognizable brand, moderate volatility, and maybe a dividend for good measures.\n\nI currently trade/own: TSM, AAPL, TGT, AGNC, TOST, MET, PLTR and a few others.\n\nI sell cash secured put using volume profile on the daily chart. HVN's are my downside strike for CSPs and upside strikes for covered calls..\n\nHVN area points where there were large volume traded at a certain price..look up volume profile if you want to learn more.", "score": 4, "replies": []}]}, {"body": "B is the best; leave and don’t make a bad trade worst by trying to rescue it.  C is not bad either if you believe in the stock; I’d buy a call too if I were doing C.", "score": 1, "replies": []}]}, {"body": "You have to buy the call back is part of the roll.   Most brokers won’t allow to roll even though it’s an overall credit.  You have to have buying power to buy call back.", "score": -1, "replies": [{"body": "Not true. At fidelity I can do a simultaneous roll up and out for a credit. If it was a debit then I need the buying power. The value of the contracts is key. I do it all the time", "score": 3, "replies": []}]}]}]}, {"body": "Not sure if you trade TSLA and TSLA options only. But you don’t have to trade cover call with TSLA. There are other stocks you can trade.", "score": 1, "replies": [{"body": "I’m we’ll aware. I do covered calls on over 40 stocks I own, I create an extra $4-5k in monthly premiums. TSLA just got away from me, fast!", "score": 3, "replies": [{"body": "Which other stocks do you sell covered calls on? I'm trying to do the same thing", "score": 2, "replies": []}, {"body": "What is ur overall capital outlay for options ?", "score": 2, "replies": [{"body": "270k-300k range", "score": 1, "replies": [{"body": "so you are making about 20% annually ? How long have you been doing this ? Have you consistently beaten the market ? \nSpy has gone up twenty percent this year", "score": 1, "replies": [{"body": "Since 2018. I was doing 10-12% the first few years as I didn’t touch volatile stocks like TSLA, NVDA or TSM like i do now. I’ve lost some $ on stocks like PLTR and AMD by rolling down too far to keep collecting higher premiums - lesson learned.", "score": 1, "replies": [{"body": "Ah pltr … lost too much to even bother selling. It’s in my non options account too", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "There is no way to do better than what you described. What I do is to roll the calls to 90-130 DTE (or further away) to minimize risk of early assignment. And roll again when they approach 60 DTE. Roll away and up but for a credit.\nThen I convert the trade into a strangle by selling a put. When selling a put you commit to buy 100 shares so make sure you have cash to cover it. If not I sell a put spread, but a strangle is the best because it helps rolling the entire structure up and down as needed for a credit.\nThen work out of the hole, roll them up little by little, strike by strike until you get them otm.\nAlso I sell shorter term puts so I can repeat the process again and again, e.g. 130 DTE calls but 7 DTE puts and so on. Play with it and see what is the best.", "score": 4, "replies": []}, {"body": "You’re supposed to hedge before you open a position. \n\n\nYour shares are the hedge by the way. \n\n\nRight now you’re just betting if TSLA goes up even further or not.", "score": 4, "replies": []}, {"body": "I sold 2 covered calls of TSLA Sept 15 $200 C when TSLA was in the $160s. Fortunately for me, I have another 500 shares to be grateful for. We live and learn. Good luck to you going forward.", "score": 2, "replies": [{"body": "Thanks for sharing. Still plenty of time for you, price could come down a bit and rolling up and out will make sense.", "score": 2, "replies": []}]}, {"body": "This won’t help you now but I start to sell puts when my covered call goes deep ITM. If it keeps running I keep selling more. Hold them as long as I’m comfortable. If the stock reverse’s then I take some of the puts off the table.\n\nUnfortunately this happened to my NVDA and MSFT and PLTR", "score": 2, "replies": []}, {"body": "I’m in the same position but I had been actively managing by rolling it up and out every week or so. So far, it’s becoming a losing proposition as I now have my covered call expiring 6 months out at $240 strike.\n\nThe way I look at it is by considering the covered call as guaranteed income over time. If I roll out a covered call for minimal credit into next month, I consider this to be “dividend” or income at the same strike. If I roll it up and out, I will likely have to pay the difference but the jump in strike prices is also considered “deferred dividend”.\n\nHere is an example using your expiration and strike:\n\nIf you roll out to the same strike to next month, you will receive an income of $190. Two months will give you $410 in income. Three months will give you $730 in income. Assuming these prices are accurate, the best bang for the buck is the 3 months as it guarantees you $240 a month.\n\nIf you want to roll up and out, you can pay now to guarantee slightly higher income. Next month, $5 strike higher ($190) would offer you $240 instead of $190. The next month, $5 strike higher ($195) would offer you $565 instead of $410. $5 strike higher ($200) would offer you $1,040 instead of $730.\n\nIf you are confident about where $TSLA price will be in the next six months, then be willing to pay upfront to guarantee income by that date. For example, I believe $TSLA will remain above $250 by January 2024. So I would pay $2,680 to guarantee me $3,800 in actual income or $630 a month.\n\nBut because you’re paying upfront, you now have no leverage to use cash to get into more aggressive positions such as buying ATM or OTM call options for $TSLA.\n\nLet me know if this helps.", "score": 2, "replies": []}, {"body": "225 this friday.....I know how you feel.   Just pray Elon opens his mouth with something silly and buy out of it when it tanks.   Other than that, you have to do the math and see if it's worth it to buy back and hope it keeps going up.   I tried to buy mine back last week and my limit order never hit......oh well", "score": 2, "replies": []}, {"body": "Hopefully your strik was above your cost basis and you will make profit on assignment.  Afterwards, you can keep selling CSPs at $185 strike to collect premium while you wait for the downturn to come.", "score": 2, "replies": []}, {"body": "Had 192.5 calls expiring this friday. Just closed the position out for pretty much max profit and be done with it. At least its not on my screen giving me those should hv could hv thoughts. \n\nHoping Powell puts some temporary brakes!!!", "score": 2, "replies": []}, {"body": "Roll them for another month - Aug18 , or something like that. You get a little more coins , will be locked for another months and if TSLA drops you'll keep your shares. Not sure what benefit of keeping shares though, if TSLA drops.    \n\nNo regrets on missing gains - think of it as part of a bigger scheme. So if you have use for those money then let the calls get assigned and follow the plan. If you have no good ideas for those money, roll for another couple weeks at the same strike, get more theta money, and make plans.", "score": 2, "replies": []}, {"body": "The max profit on a covered call doesn't actually feel too great does it", "score": 3, "replies": [{"body": "It usually works, in a sideways market or stock. I’ve been successful for years doing the strategy, this one just got away, fast!", "score": 1, "replies": [{"body": "If your shares are called away above cost basis, it's still working. Your only issue is the FOMO. You're making money here, only not as much as that other guy.", "score": 3, "replies": [{"body": "Facts", "score": 2, "replies": []}]}]}]}, {"body": "You already have the hedge… you own the underlying….", "score": 1, "replies": []}, {"body": "Bad trade, cut your losses and move on.", "score": -1, "replies": [{"body": "The guy sold calls at a strike above his cost. He ain't cutting any losses.", "score": 2, "replies": []}, {"body": "I’m not losing, I will make about $2k on each contract when including premium received . I’m just “upset” and have FOMO because I can’t take part in the profits about $185. My cost basis before premiums is $172.5", "score": 2, "replies": []}]}, {"body": "Tsla is so volatile i dont like long dated calls with it. If i was in your position i would let it get called away and start selling puts. If you want to write long dated options you should probably run a spread. I.e. you sold 185 calls, you could have bought 190 calls as insurance. Then you could have exercised yur calls and onky been out the 5$ difference", "score": 1, "replies": [{"body": "Thank you. That is a very good idea. I most likely will have them called away and just start the “wheel” over", "score": 2, "replies": [{"body": "P.s. same strategy works for puts", "score": 1, "replies": [{"body": "And TSLA puts are juicy. (For a reason)", "score": 1, "replies": []}]}]}]}, {"body": "Just today I rolled my short Jul 2023 $205 call to  $240 Jan 2024 for ~$3/share.", "score": 1, "replies": [{"body": "I’ve been tempted to do something like that but let’s say if Tesla gets to $300 in august, man I’m holding that contract another 4 months - unless if it was assigned early", "score": 1, "replies": [{"body": "I'm praying for early exercise. You get your premium and the $240 early rather than having to wait until expiration.\n\n$32 pickup on $205? I'll take that over 6 months.", "score": 2, "replies": []}]}, {"body": "What do you plan to do if tsla drops, goes up and your shirt call goes ITM", "score": 1, "replies": []}]}, {"body": "are you thinking about buying the call back? maybe after a dip. you can finance the cost with by writing puts on tesla.", "score": 1, "replies": []}, {"body": "Reverse buy write", "score": 1, "replies": []}, {"body": "Never write a CC on a meme stock, learned that hard with GME", "score": 1, "replies": [{"body": "TSLA is not a meme stock", "score": 2, "replies": [{"body": "ok whatever you want to call it.  It is popular with retail investors, has a cult like following consumer base, it has a super public CEO who makes headlines on a regular basis , exhibits high volatility, and trades unconnected to any of it's peers.\n\nthese are not ingredients where you want to be short vol", "score": 3, "replies": []}, {"body": "TSLA is the original meme stock.", "score": 3, "replies": [{"body": "You’re right!", "score": 1, "replies": []}]}]}]}, {"body": "This is the “risk” of selling CCs. You limit your upside while limiting your downside..\n\nRegardless, you are making a small profit on the shares when assigned, plus whatever premium you got.", "score": 1, "replies": []}, {"body": "It’s so oversold right now, I would buy the TSLA $250 July 21, sell you shares and let some cash sit as margin for the bear spread.  I would expect TSLA to retrace to at least close to 200,   So the $7300 call you sold will only be worth $1500 at TSLA $200.  You keep the 6K profit now, buy the $2k spread insurance, and profit as it falls.  It’s a directional gamble though.  Otherwise just let them get called away.\n\nHonestly I think it could be lower than $185 by July 21.", "score": 1, "replies": []}, {"body": "Market risk is increasing - wait till July and then if still deep in money, roll out to August for additional premium credit. Or you can roll now. I am in similar boat but have a significant profit (selected Strike price at my sell target price)", "score": 1, "replies": []}]}
