{"title": "NFLX breaks into China with licensing deal", "selftext": "Netflix got a deal with Chinese iQiyi (Baidu owned) which is ranked 42 on alexa in China and 292 globally and has around 500 million monthly users.\n\nBasically Netflix will stream some content on iQiyi and get paid as far as I understand from the information released today.\n\nNFLX recently bounced up from its trendline support and beat EPS/Rev expectations.\n\nI bought yesterday after NFLX was going to close again above trendline support.", "id": "67h5vt", "created_utc": 1493133229.0, "score": 129, "upvote_ratio": 0.95, "num_comments": 43, "comments": [{"body": "Awesome, I thought it would never happen.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 8, "replies": [{"body": "I can pirate all the stuff in netflix easily as US citizen as well. Netflix is just more convenient for me so I pay $15 per month.", "score": 19, "replies": [{"body": "Im not sure if most Chinese will see the value prop quite that way, but then again, most of them dont have to.", "score": 2, "replies": [{"body": "Only .1% need to see it that way for about 1.4 million new subscribers ", "score": 3, "replies": [{"body": "This.\nSome sites in China, e.g. Youku, iQiyi, also have paid/subscription options, and we all know they are rolling in cash. You make bank if 1% of China's population pays for your service ", "score": 1, "replies": []}]}, {"body": "That's true. Piracy is so deeply embedded into the Chinese culture, I don't think they'll budge. Even for $15.", "score": 1, "replies": []}]}, {"body": "Exactly how I feel.  Why risk issues with the law when you can pay a small fee per month and get all the shows you need.", "score": 1, "replies": [{"body": "It's not really even the legal fear. It's simple quality and convenience. Even when I'm hunting for the best torrents, 25% of them are total garbage in a different language, bad subs, or awful quality. My favorite torrent sites that aren't the pirate bay always get shut down every 6--12 months. ", "score": 2, "replies": [{"body": "Pirating digital goods in a national pastime in China. Their torrent trackers are very well-organized and easy to browse though, so for them it's almost less convenient to use Netflix. And they never get shut down. \n\nAlso, $15 is not exactly small fee for your average Chinese.", "score": 1, "replies": [{"body": "that's true, but $15 IS a small fee for middle class Chinese. and there's over 300 Million of them in China.", "score": 1, "replies": []}]}]}]}]}, {"body": "I don't have numbers to back it but just general impression. Copyright protection has been improved dramatically in China. Pirate videos are hard to find on major streaming sites. Besides you would be surprised to see how many people especially in young generation are willing to pay for subscribing good content.", "score": 4, "replies": []}, {"body": "You could make the same argument about piracy anywhere else. However, if there is an agreement to distribute the content officially through a Chinese source it's likely those other sites will have a greater focus on removing that content. ", "score": 2, "replies": [{"body": "Except piracy is a much bigger issue in China, because 1) they dont enforce the laws against it and 2) the people are poorer. ", "score": 1, "replies": []}]}, {"body": "Give it some time, sooner or later they're going to love american shows. ", "score": 2, "replies": [{"body": "They already are. They just don't pay for them.", "score": 1, "replies": [{"body": "I think eventually everyone will pay for the content online.", "score": 1, "replies": [{"body": "And I think piracy is not going away any time soon. Perhaps never at all. ", "score": 1, "replies": [{"body": "Who knows, a lot of my friends used to pirate, but now they pay for the content.", "score": 1, "replies": [{"body": "China is different in this regard. Pirating digital goods is their national pastime - they don't even see it as wrong. There needs to be a paradigm shift for it to change and that may take a while.   ", "score": 1, "replies": [{"body": "yeah, that's actually true. Their whole economy based on this principle. ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Personally i would love to see house of cards starring Jackie Chan where the protagonist has all of his opponents executed instead of simply falling by the political wayside with the occasional murder. ", "score": 5, "replies": [{"body": "I'd pay to see Jackie Chan slap some dudes around in a suit.", "score": 2, "replies": [{"body": "You should watch Rush Hour", "score": 5, "replies": [{"body": "Even better, Tuxedo.", "score": 2, "replies": []}]}]}]}, {"body": "Yes and no, I guess for the poor kids and guys who are just used to pirating, most of my friends in China don't buy software, it's not something that has the same mind set as the US, no one sees it as illegal and no one cares.\n\nBut I think the bigger problems will be the already established streaming services in China, and there are tons of them. They all are cheaper and have more OG content in China than NFLX. \n\nWe will really have to see how NFLX will strategize in China, it could end up being like Uber, head in all guns blazing, chased out with their tails between their legs by Didi dache ", "score": 1, "replies": [{"body": "Isn't it mostly about money over there?  Your average Chinese wouldn't wanna pay $60 for a Windows copy, then pay monthly for Office 365 package. It's a lot of money for them, their middle class salaries are significantly lower than those in the US. ", "score": 1, "replies": []}]}, {"body": "Good point.  Seems as though iQIYI has been preventing piracy by making streams available, so instead of someone copying, they just go right back to iQIYI and rewatch it.", "score": 1, "replies": []}]}, {"body": "That explains the $8+ jump today. I was like wtfffffffffffffff in the morning... couldn't find any news aside from their new $1B loan.", "score": 3, "replies": []}, {"body": "Does it make sense to buy it today? ", "score": 3, "replies": [{"body": "Not sure... I'd love to jump in as well, but seems like too high now :(\n", "score": 3, "replies": []}, {"body": "If you are asking it's too late. ", "score": 2, "replies": []}, {"body": "Time in the market > timing the market", "score": 2, "replies": [{"body": "For an individual stock like this it's really not hard. But no you shouldn't be asking to buy them right after a fantastic announcement which has inflated their price. ", "score": 0, "replies": []}]}]}, {"body": "Didn't realize what sub it was, thought China was getting pro football", "score": 2, "replies": []}, {"body": "Step by step they're gonna conquer the Chinese market. ", "score": 2, "replies": []}, {"body": "I've had it since before the split. I sold thus morning before the news broke out. Such is life I guess lol", "score": 1, "replies": []}, {"body": "I pay 12.99 monthly and can use on 4 separate devices - AT THE SAME TIME....does not get much better than that...streaming is just going to get bigger. And Netflix is ahead of the curve. Yes, there are competitors. HULU - I have had major problems with the throughput. Amazon - definitely a competitor with deep pockets. But limited on number of devices. Yes, I own NFLX, and have for many years.  As I said earlier today, brought 15 more yesterday. It's all good. ", "score": 1, "replies": [{"body": "Biggest competitor in China is Tencent.", "score": 1, "replies": []}]}, {"body": "It's this deal the reason Netflix's up almost 6%?", "score": 1, "replies": []}, {"body": "Brought 15 shares yesterday. Nothing like lucky timing. I just like NFLX generally. ", "score": 1, "replies": [{"body": "Congrats on the $120.", "score": 7, "replies": []}]}, {"body": "I always knew that holding NFLX for long was a very good decision.", "score": 1, "replies": []}]}
