{"title": "Wal-Mart drops 4%, Kroger dives 12% in premarket on Amazon-Whole Foods deal", "selftext": "All because Amazon bought Whole Foods or is there something deeper. ", "id": "6hmg76", "created_utc": 1497618960.0, "score": 70, "upvote_ratio": 0.92, "num_comments": 74, "comments": [{"body": "someone tell me why wal-mart isn't a great buy here. whole foods customers aren't buying their food from wal-mart and vice-versa. i don't see how wmt gets hurt by this. somebody tell me why i'm wrong before i yolo.\n\nedit: in this bitch. buy the fucking dip, punks. wmt gang all day.", "score": 39, "replies": [{"body": "Walmart is just a terrible experience these days. The lines are really really long. If you use the self checkout you're treated like a criminal. walmart is making the same mistakes as kmart.", "score": 31, "replies": [{"body": "ok, but when has wal-mart not ever been a terrible experience? and long lines means more sales. i'd be more worried if no one was waiting on line to buy anything.", "score": 26, "replies": [{"body": "The long lines are from less employees working. ", "score": 17, "replies": [{"body": "Fewer.", "score": 26, "replies": [{"body": "But let's be honest, they are probably also less. ", "score": 24, "replies": [{"body": "Lesser.", "score": 6, "replies": []}]}, {"body": "Oh, look I found Stannis Baratheon's account.", "score": 10, "replies": []}]}, {"body": "Which equals more money saved and more criminals on the street. ", "score": 2, "replies": []}, {"body": "Real, actual DD: Walmart is investing in facial recognition and *cart* recognition software to be able to automate the opening and closing of lanes. As soon as a line builds up of more than two carts, the computer recommends opening a new lane. ", "score": 2, "replies": [{"body": "Kroger has had this for a few years now", "score": 2, "replies": []}]}]}, {"body": ">and long lines means more sales.\n\nThe long lines mean increased balking, abandonment, and dissastified customers. Rarely are those a good thing. ", "score": 1, "replies": []}]}, {"body": "Why are you even shopping in Walmart in the first place ", "score": 4, "replies": [{"body": "because he used this sub for his DD", "score": 5, "replies": []}]}, {"body": "> d long lines means more sales. i'd be more worried if no one was waiting on line to buy anything.\n\nyeah but their online experience is expanding. Not sure how well, but it is expanding. ", "score": 1, "replies": [{"body": "They're coming up fast. I work in ecom and my company sells on their site. They are not fucking around. I see them undercutting Amazon's prices daily, then Amazon reacts. They have a loooooong way to go, but they're full steam ahead.\n\nSlightly related note- Target's marketplace sucks giant donkey cock. If you're looking for big ecom growth there you may be in for a rude awakening. ", "score": 2, "replies": []}]}, {"body": "walmarts BM experience it not the reason to buy  it, i've started heavily shopping WM now because of their improved online model.  i would never set foot in walmart or wholefoods.  the only BM store i have to is Costco.", "score": 1, "replies": []}, {"body": "I've never been to Walmart how are you treated like a criminal?", "score": 1, "replies": [{"body": "They have an attendant standing in the middle of the self check out like a panopticon. She'll sometimes come over and peak in your bags or look over your shoulder. And when you're walking out there will be a person at the door that will check your receipt and snoop in your bags.", "score": 1, "replies": []}, {"body": "They have an attendant standing in the middle of the self check out like a panopticon. She'll sometimes come over and peak in your bags or look over your shoulder. And when you're walking out there will be a person at the door that will check your receipt and snoop in your bags.", "score": 1, "replies": []}]}]}, {"body": "Amazon already has much of the market for people with salaries above $100,000 income as customers. They have lots of growth room to go after the poor and low income demographic.\n\nThey have a discount prime membership program that will now start taking EBT account holders. This is Walmart's prime demographic.\n\nWalmart has struggled for ever to get the high income demographic and now Amazon is targeting the low income demographic.\n\nWith Amazons continuos automation and economy of scale they will start chipping away at Walmart's market share. If Amazon starts delivering baby food, diapers, and low income staples for competitive pricing related to walmart including delivery then I can see exactly why walmart should be worried. \n\nWhere is Walmart's growth? Because Amazon is looking at Walmarts customer base and seeing huge growth potential. ", "score": 3, "replies": [{"body": "nothing that you said is wrong\n\nnothing that you said relates to today's drop or amazon owning whole foods", "score": 1, "replies": [{"body": "I would assume that the purchase of whole foods is more related to the distribution network for groceries and access to all the existing vendors. \n\nThe poor can now signed up to have milk, eggs, cheese and bread like items auto delivered on a schedule and have their EBT cards applied. Saving the poor time and money from having to drive to the store or be embarrassed from using their cards in public. \n\nThe more items Amazon customers have on scheduled purchase and delivery, the more they can buy in bulk thus get discounts. \n\nEach whole foods now has to the potential to ship EBT purchases food to customers. \n\n ", "score": 3, "replies": [{"body": "> Each whole foods now has to the potential to ship EBT purchases food to customers\n\nthen it's not a whole foods and the loyal customer base starts shopping elsewhere. you're basically saying amazon bought a luxury clothing store to put a bunch of hanes white t-shirts in the racks.\n\nif amazon wanted a nationwide grocer to cater to the poor huddled masses whole foods was the worst one to buy. whole foods locations are in high earning population centers. if that was their goal they would've bought kroger or safeway or some shit.", "score": 2, "replies": [{"body": "I think whole foods makes more sense then Kroger or Safeway. First off Safeway is mostly in Western United states so its global footprint is way smaller in that regard. Kroger is in the US, Canada and Europe but its not just focused on grocery. They have jewelry stores and other retails business focused markets that Amazon does not need nor wants.\n\nKroger would also be more expensive then whole foods to buy in addition to the fact that both Kroger and Safeway are Unionized. Amazon is anti Union and whole foods is not unionized and I think this is a big deal for Amazon.\n\nWhole foods also has locations in United States, Canada and Europe. They are mostly is High density cities and target Amazons demographic, high income earners.\n\nWhole foods purchase lets Amazon focus on just grocery, in good population density areas, servicing high income earners without having to deal with a union. \n\nSo again they will have the high income demographics with large growth potential for the low income demographic. \n\nIf anyone is going to have peanut butter delivered to their house, its most likely going to be a high income earning person who doesn't have time to grocery shop but wants organic and no preservatives peanut butter. \n\nAll they have to do now is expand that business to low income buy providing grocery options at competitive prices. This is a stable footing Amazon is stepping on to while establishing themselves as and online grocery provider. \n\nJust my opinion with no research whatsoever so I could be completely wrong. \n ", "score": 2, "replies": []}]}]}]}]}, {"body": "Firsy time dipping my feet in their stock was today. Loaded up at 74.5. They're the only real potential competitor in e commerce and its growing.", "score": 2, "replies": [{"body": "[that's what's up](http://i1.kym-cdn.com/entries/icons/facebook/000/013/723/mah-nigga.jpg)", "score": 0, "replies": []}]}, {"body": "Buy bigly. Smart people make millions when plebs overreact.", "score": 1, "replies": []}]}, {"body": "Costco also down, 7-8%", "score": 12, "replies": [{"body": "Down even further; I picked up July 21 calls 170 strike for 3.85", "score": 3, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "yep, always seeing the worst first. Gonna be holding nice and tight.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I did the same thing dude lol", "score": 1, "replies": []}]}]}]}]}, {"body": "Not as dramatic but food distributors took a hit too.  USFD, PFGC, SYY all opened down about 5%.", "score": 2, "replies": []}]}, {"body": "Seems a bit excessive.  Whole Foods is still going to command premium prices.  \n\n", "score": 7, "replies": [{"body": "[deleted]", "score": 25, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "They have a patent for a Floating Warehouse. This makes more sense to use roofs.", "score": 4, "replies": []}]}]}, {"body": "Right but I don't think they're going to destroy the brand.  Produce and meat at Whole Foods is what sets them apart because they pay to have first pick and delivery (and customers pay a premium).\n\nUnless prices come down (ex quality concerns) I think the sell off of Kroger is probably a tad much.  Whole Foods will definitely benefit from amazons efficiencies and infrastructure though which might bring down prices \n\nEdit:  of course the idea of having a storefront in every suburban area is huge......", "score": 5, "replies": [{"body": "Amazon could've been nice and announced this yesterday when I bought the kroger mega dip... fuck me, figures thered be two in a row.", "score": 2, "replies": []}]}]}, {"body": "Amazon now takes EBT cards. They want the supply chain and distribution processes for food. They are now targeting low income customers.", "score": 1, "replies": []}]}, {"body": "Back to back dips from Kroger based on irational fear. Should recover to close to what they were trading pre panic sells. Or I hang myself, one of the two.", "score": 6, "replies": [{"body": " So I'm just playing with a few hundred dollars and I thought yesterday was bad seeing my account down ~$50. Then I looked this morning and saw it down another $50. \n\nGlad I don't have a real big skin in this game. ", "score": 10, "replies": [{"body": "It SHOULD recover... heres hoping", "score": 5, "replies": [{"body": "Thankfully TGT is starting to bounce back from pretrade drops ", "score": 2, "replies": [{"body": "Looks like the dip is over, so if you're planning on buying do it today. I see monday onwards being upwards. Company is doing fine, I don't understand this panic.", "score": 2, "replies": [{"body": "What the fuck are you two smoking? It's slightly up from open for -one day- but down 6% from close yesterday. \n\nFucking wsb\n", "score": 1, "replies": [{"body": "I was talking kroger, not tgt, no clue how they are doing.", "score": 1, "replies": [{"body": "Even worse...\n\nYou people make me sick. ", "score": 1, "replies": [{"body": "You think a loss of 30% is warranted and they won't recover?", "score": 1, "replies": [{"body": "I think calling a continuing decline on a 3 year decline a recovery is silly. I also think kroger is a shit stock. Just buy some SPY instead if you don't want a yacht. ", "score": 1, "replies": [{"body": "I agree, kroger is declining, but not this much. They were at 30-31 and then tanked to 22. I seem em recovering to what their logical decline point would've been, not this overreaction. In the meantime I'll make dividends while I wait. I'm not all in yolod or anything but I see potential for gains.", "score": 1, "replies": [{"body": "What's the dividend? Same as inflation?\n\nI mean... I guess if it picks back up within a month it's a good move... Seems like a waste of time and money. ", "score": 1, "replies": []}]}, {"body": "What's wrong with buying spy?!?", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Kroger sucks dicks of the crackheads that shop there, it'll never come back ", "score": 1, "replies": [{"body": "Thats just, like, your opinion man.", "score": 1, "replies": []}]}]}]}]}, {"body": "I bought the Walmart dip, let's spray and pray! ", "score": 3, "replies": [{"body": "I hope the share repurchase is all over this dip. That could add some serious value.", "score": 3, "replies": []}]}, {"body": "I think this sell off is an over reaction. While i have no doubt that Amazon's growing involvement in the grocery business is going to take business away from traditional grocery stores, I think the overall impact will be smaller than the hypetrain believes. People want to select their own produce, meat, eggs, etc, and if they go to a traditional grocery store to purchase those products, then I am assuming they will also purchase their non-perishable groceries there as well, as there is no material difference in price between Wal-Mart and Amazon. Plus, you have the added benefit of not having to wait 5+ days.", "score": 9, "replies": [{"body": "5 days? They'll be delivering groceries from Whole Food to your home within hours. And I'd be much more likely to allow my eggs, meat, etc., be purchased 'blindly' from WF than from WMT. ", "score": 8, "replies": [{"body": "Are we all forgetting their technology that allows you to scan in grab food and leave without having to checkout. ", "score": 3, "replies": []}, {"body": "I'm assuming it will be really expensive. UberEats costs like an additional $5 for delivery sometimes.", "score": 6, "replies": [{"body": "Yea, but these are Whole Paycheck customers. They don't want to drive their Chevy Suburbans to Yoga and the grocery store.  They'll pay the premium. Hell, Amazon might create Amazon Prime - Prime Grocery ^TM just for Whole Foods at a mere $120.00 per year. ", "score": 9, "replies": []}, {"body": "Maybe, maybe not. Direct to home delivery means product doesn't need transferring and stocking on store front shelves... labor that would otherwise be up front can be transferred to picking storage from back & delivering. ", "score": 2, "replies": []}]}]}, {"body": "Delivered groceries is the future. I get the \"selection\" angle, but vegetables and other products are generally and increasingly uniform I think it will just take time to convert people. Don't see future generations having an issue with this.\n\nDefinitely an overreaction to WMT. They have the storefronts and food supply chain already (Roughly 13x as many Walmarts as Whole Foods). With Jet.com acquisition, competing on this front is a guarantee. ", "score": 3, "replies": []}, {"body": "Amazon now take EBT cards. Poor people can now shop for food online. ", "score": 1, "replies": []}]}, {"body": "The commercial real estate bubble is true. Whole Foods was one of the first to be scooped. They just got out while at the top of the hill. We gonna bail Wal-Mart out. lmao", "score": 3, "replies": []}, {"body": "Kroger was down 2% before this.  Got some more AMZN at 950 but you have think WMT is the last defense to world domination ", "score": 5, "replies": [{"body": ">Kroger was down 2% before this. \n\nKroger investors have insider info confirmed\n\n", "score": 2, "replies": []}]}, {"body": "Ahold Delhaize also down 7%. Bleh.", "score": 2, "replies": []}, {"body": "TGT, COST also going to the woodshed", "score": 2, "replies": []}, {"body": "In for 100 shares of KR @ 21.70. Lets see this back to $24 next week.", "score": 2, "replies": [{"body": "I grabbed a few more shares than that, but by my calcs, they should be close to $25.50 by month end (so your $24 is pretty close, if not sooner) and close in on $28-30 by year end.  It's not like 1/3 of US grocery shopping disappeared overnight and that this deal between Amazon and Whole Foods is a sure thing (see what happened with Albertsons and Safeways debacle and the fall out from their purchasers/anti trust selling).", "score": 2, "replies": []}]}, {"body": "Cool thing about Walmart is that if you look at it's overall chart, they fared very well during recessions. This could be a great swing trade and long term investment", "score": 1, "replies": []}]}
