{"title": "If there are any other girls - or women - on this sub, please PM me so we can support each other and learn from each other", "selftext": "", "id": "a2a4nm", "created_utc": 1543723296.0, "score": 0, "upvote_ratio": 0.24, "num_comments": 15, "comments": [{"body": "Took a look at OP’s post history. If you are, and I quote, “deep in poverty”, and can’t meet your basic needs, do not, for the love of fucking God, trade options.\n\nBest of luck.", "score": 29, "replies": [{"body": "Also, as far as I'm aware, strategies aren't determinate on someone's gender. This means strategies that work for men will work for women. So why would support from other women help any more than just learning winning strategies in general?", "score": 23, "replies": [{"body": "I hate it when my straddles expire worthless because im a male. ", "score": 33, "replies": []}, {"body": "$HER underperforms $SPY, so maybe she's onto something. Or $HER could be a bullshit marketing thing.\n\nOptions are not the way to \"break out of deep poverty\".", "score": 3, "replies": []}]}, {"body": "You are completely right. I think the most solid advise would be for OP to look for job opportunities with higher wages. The risk of losing a few hundreds would be devastating to her life at this moment. ", "score": 5, "replies": []}]}, {"body": "Why is everyone assuming OP is a female? My first thought was that here's a clever guy who happens to be desperate and dateless.\n\nedit: It's the internet folks. Hellooooooo!?!", "score": 9, "replies": []}, {"body": "If you identify as an Apache attack helicopter, please PM me and we can learn from each other in a protected silo.  \n\nMaybe limiting your input is not a good idea when trying to play a game with all types of helicopters participating. ", "score": 9, "replies": []}, {"body": "I get it, you want a community of like minded folk to talk and learn from. I hope you find them, but in defense of the people here, we are generally helpful, and honest where we can't help. Hope you succeed.", "score": 3, "replies": []}, {"body": "Women have as much claim to the sub as men.", "score": 1, "replies": [{"body": "All op asked was for women to PM them. Why are you so defensive lol", "score": 4, "replies": []}]}, {"body": "You didn't say anything anti-anybody. You shouldn't be downvoted.", "score": 1, "replies": []}, {"body": "Here's some advice. You will not succeed until you stop making decisions strictly over emotions like greed and fear. Women tend to be very emotional and make decisions based off emotions, that's why you don't see many women traders.\n\nAnd finally.. If you're trading with rent money it's going to be impossible to not be emotional watching it go up and down. You'lll eventually succumb to fear and sell at a loss, as your so scared to loose your rent money...save up some money you can lose so you can trade without fear. Good luck", "score": -5, "replies": [{"body": "That's not actually true regarding women; it's been studied and found that women are less emotional when it comes to investing, but take less risk.  I read it in the wall street journal like 12 years ago.  So while men had larger returns there were more losers vs women. ", "score": 2, "replies": [{"body": "You said at investing. This girl is on an option sub with not allot of money...there no way she's investing. And there's no way in hell a woman is not going to get emotional seeing her account fluctuate by like 80% swings...men make better traders because we tend to not give a shit", "score": 0, "replies": [{"body": "You're ignorant af; at least try to back up your statements with a source or study.", "score": 2, "replies": []}]}]}]}]}
{"title": "GOOG versus GOOGL. How do buybacks work?", "selftext": "Noticed on Friday GOOGL moved up 1.38% and GOOG moved .56%\n\nThat is a pretty big difference.\n\nI am curious how buybacks work with the two ticker symbols?  Could the difference be from a buyback by Google?\n\nWhen options are given to Google employees which type are given?\n\nAny help much appreciated.", "id": "a2cr4u", "created_utc": 1543752763.0, "score": 110, "upvote_ratio": 0.93, "num_comments": 16, "comments": [{"body": "This doesn’t answer your question entirely but it’s a decent explanation of the way it works. I’m not sure but it sounds to me like the company could buyback either shares depending on the situation.\n\nhttps://www.investopedia.com/articles/markets/052215/goog-or-googl-which-google-should-you-buy.asp", "score": 28, "replies": [{"body": "Glad ive been buying A the whole time i guess lol. Beginners luck", "score": 13, "replies": [{"body": "[deleted]", "score": 18, "replies": [{"body": "Choosing the one with more liquidity is important if you day trade, scalp, and especially if you buy options. Either ticker works just fine for long-term investing id agree.", "score": 7, "replies": []}]}]}]}, {"body": "No both stocks only really moved up in the last 15 minutes before close. \n\nCompanies are not allowed to buyback at that point.\n\nI believe there is a certain time frame 30 minutes after and 30 minutes before close which makes sense since they dont want companies to pump their stock by bidding the stock up at open or close.", "score": 12, "replies": [{"body": "Thanks.  I did not think about this correctly.   They will Ballance out each other.", "score": 5, "replies": []}, {"body": "Depends. They could have an agreement with a broker to purchase shares for them. Broker can buy them whenever they want. ", "score": 1, "replies": []}]}, {"body": "This just proofs that the market isn't efficient.\nThe price will rebalance over time tho. ", "score": 13, "replies": [{"body": "That is a great point.   I was going to at first challenge.  But thinking about it guess you are correct.  It does not matter which they buyback.  Ultimately it will Ballance out.   I am a bit of an idiot for not realizing.   I have thought about this a lot and missed it.  Major thanks!!!", "score": 13, "replies": []}, {"body": "There are different forms of the efficient market hypothesis (EMH). The \"strong form\" is provably wrong and is mostly just used for theoretical study. The strong form suggests that nobody can make excess returns because of market efficiency. It doesn't match reality because people can profit immensely with insider trading. The fact that it's illegal doesn't mean it never happens.\n\nThe weak form of EMH suggests that you can't make excess returns with publicly available information. That's also not 100% true because public information becomes available to different people at different times, and people who get the information early - for example, algorithms who can process reports within milliseconds of release - can make excess returns.\n\nThe market is efficient in a general sense but there are tons of inefficiencies that people are able to profit from. The hard parts are finding them before anyone else does and having the capital to take advantage of them.\n\nEMH also doesn't really have much to do with the idea of value investing or behavior economics. While the market might be \"efficient\" for some definitions of the word, it's not \"rational\" and it's possible to take \nadvantage of these irrationalities, like an under-priced stock, to earn excess return in the long-run. This is how Warren Buffet and other value investors made their returns.", "score": 5, "replies": []}, {"body": "If it proves that then wouldn’t buying the one that went up less and shorting the one that went up more be a viable strategy? Hell, make an algorithm to do it any time this happens. ", "score": 1, "replies": [{"body": "No because it could drop by let's say 5%. That would pretty much wipe or even out your investment. ", "score": 1, "replies": []}]}]}, {"body": "Google has multiple share types so the founders can retain voting control. GOOG represents ownership but has no voting power. GOOGL has some voting power. The founders have their own class of shares (which they have been gradually selling off over time... in the process converting their special shares into the other two) which have OVERWHELMING voting power.\n\nYou are solid whichever type you buy. GOOGL usually trades at a small premium to GOOG due to the voting power. If Alphabet distributes a dividend someday, it's anyone's guess how they will do it with the different types, but for now that is a moot issue. (But in other words, don't expect a dividend anytime soon ;p)", "score": 3, "replies": [{"body": "> Google has multiple share types so the founders can retain voting control. \n\nYes.\n\nThe piece I was failing to realize and someone else pointed out was that the two would be handled because of the market being efficient.\n\nSo the two will stay in sync no matter what is bought back.   The difference is always whatever value is put on voting versus not.\n\nBut say ALL employee shares came from GOOG it would not make worth less than GOOGL.     Well ultimately.  The increase in shares of GOOG will also cause dilution with GOOGL.\n\nThis also explains why this has not come up as a discussion point.  Which I also found curious.  Reason being is there is no issue and I was being a bit of an idiot.", "score": 1, "replies": []}]}, {"body": "Not sure how buybacks work but I can explain the employee side of stuff regarding your question.\n\nA bit of background. Historically Google had single type share where founders, early employees and investors all had. At some point (before my time in Google) they realized that as they issue more employee stock and are about to IPO this would significantly dilute the voting power and make the company vulnerable to hostile takeovers eventually so they divided the stock into two classes: Class-A shares which has 20 units of voting power, and Class-B shares which have 1 unit of voting power. This worked out fine for a while, and all new employees would get B shares, as well as people buy in the stock market. Note that you could not buy or sell A shares. If you wish to sell you would have to convert it to B shares, which would immediately lose its voting power and thus make existing A share holders position even stronger.\n\nFew years ago even this became inconvenient so they introduced Class-C shares which has absolutely no voting power.\n\nToday B shares are known as GOOGL and C shares are known as GOOG. \n\nAs for the employees, those who had B shares vested still have them if they didn’t sell so far, but after the change all employees started getting C shares for their refreshers and new stock grants.\n\nNote that B and C shares in theory has very little difference since A shares’ voting power is so much larger that B voting cannot get the majority. That being said be aware of two totally hypothetical issues that make them different:\n\n1. If some majority A shareholders (ie Larry or Sergei) decide to get out %100. This would convert the A shares into B and total B amount might get much larger pool than it is today to the extent that someone can gather all B shares to have the hostile takeover (assuming they have few hundred billion dollar lying around).\n\n2. In theory Board has no obligation to reward C shares. say if they decide to issue dividends they can choose to only give it to B shares, and C shareholders cannot say anything since they have no voting power.\n\nNote that both of these situations are extremely unlikely but still fun to talk about ^_^", "score": 3, "replies": [{"body": "This is mostly correct but you flipped A and B - GOOGL is class A and GOOG is class C, the super-vote shares are class B.", "score": 2, "replies": [{"body": "Yes GOOG is class C as I also mentioned. I might have misremembered the A vs B though. Thanks for the correction.", "score": 1, "replies": []}]}]}]}
{"title": "NVDA stock \"cryptho bubble\" burst Where is redditors who said stock not gone be effected by cryptho minning ? Do they still flying with nvda to the moon ? No hate", "selftext": "It sad what nvda and amd dip so much but it was so obously all sky rocket was simple cryptho minning bubble after burst people start realise how much real income nvda get from cryptho minners . Lucky only investors who buying now after burst but it gone dip even more streets gone be full of used gpus for cheap for many years to come it means less gamers gone buy brand new gpus unless cryptho prices sky rocket again .\n\nI am wrily sorry for my broken english .", "id": "a2cwie", "created_utc": 1543754478.0, "score": 0, "upvote_ratio": 0.47, "num_comments": 16, "comments": [{"body": "The nvda conference call went into detail regarding this.  As for nvidia's response, they're not lowering msrpp or introducing new mid range products until their inventory goes down which should be 1 to 2 quarters.\n\nSo no, you're not getting cheap gpus, they'll just be normally priced.  And it won't be years, it'll be 3 to 6 months.  Lastly their previous p/e of 60 was way too high at nearly $300 stock price and now at their current p/e of 22 and stock price of 163, it's reasonably priced. ", "score": 4, "replies": [{"body": "22 is still expensive for Nvidia.\nA P/E of \n16 to 18 would be reasonable. There will be more hurt in this for sure.", "score": 5, "replies": [{"body": "Yes i think same but we never know for sure nvdia fail with first in world mining gpus but they may learn from mistake make better gpus for mining or come out with much fasters series of gpus for mining and gameing ( only problem most games don,t use fully newest gpus speeds but it gone change in future ) . Nvda problem first they need to sell brand new gpus withch they got full warehouse so they gone be forsed to lower prices on some gpus . AI got big potencial in future years .", "score": 2, "replies": []}]}, {"body": "The problem was the PS. A PS of 15 for a semi megacap is bonkers. Even at a PS of 8 it's still bonkers, but at least it's less so.\n\nThere's also a problem in the fundamental area. A lot of NVDA investors, me included, thought NVIDIA would be making much bigger inroads into the AI inference space and could possibly end up nearly owning it like they own the AI training space. This is big because AI training demand is somewhat linear in growth, but inference is parabolic and likely to remain parabolic ad infinitum sans an apocalypse.\n\nWhat's happened in practice though is they've cemented their dominance in AI training but have failed to make inroads against Intel (who has about as much of the inference market as NVIDIA has of the training market) and Xilinx, and are even losing ground in some areas. Intel meanwhile is planning to make more aggressive moves into AI training and they've solved the FPGA (XLNX) vs. GPGPU (NVDA, AMD) argument by doing both so they can offer the best solution in all cases.\n\nCan they be successful? Of course. But they're apparently facing a much bigger uphill battle than any of us expected, and that brings down future valuation quite a bit.", "score": 2, "replies": []}, {"body": "Yes you right nvda now is reasonably priced but i think we gone see some dips in future so i would invest some allocated margin money just to take some profit from low intrest rate.  Yes used gpus is already very cheap atleast in uk ebay and in another market places and it would last longer like 6 months just because its 100 milions gpus still in minning but some soon gone be sold of minning geting unprofitable in uk mostly power cost here very expensive unless crypto prices get high again .", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Well, it turns out bitcoin lowers difficulty if miners leave or hash power is reduced, so the cost of mining will go down.\n\nBut nvidia really just made extra money from miners, it's not their core business.. they make a ton of money selling to gamers either directly or indirectly (inside gaming consoles, phones, etc), 2nd is their datacenter gpus, 3rd professional visualization, and then there's the future of A.I., self driving cars, etc.", "score": 2, "replies": [{"body": "What game consoles and phones are their gpus in? That’s interesting", "score": 1, "replies": [{"body": "I thought the Nvidia Tegra mobile chip was famous enough, and of course the PS3, xbox 1 (original, not 360 or the new one), and wii.\n\nUnfortuantely for Nvidia, PS4 and xbox one (the new one) uses AMD gpus.", "score": 2, "replies": [{"body": "Ah I see thank you", "score": 2, "replies": []}]}]}]}, {"body": "Nvda not gone go this range unless somethig very bad happens its unpredictable. Second hand GPUS slowely and stady gone flood market i explained it there  :) ------> First you don,t understand mining its allways gone be somebody mining coin as long as minable , less people mine it biger reward gets rest of miners. Second some people got free power atleast they don,t pay for it so they not gone stop, solar miners not gone stop so fast , some people miners just for winter or 6 months or 9 months or all year and save money on heating so as long its cost less as heating its fine so cold climate countrys not gone stop long time . Some companys mine from solar systems they not gone stop so fast. Some believers not gone stop in cryptho even they loose money on it at the moment prices but they believe mined coin gone be 10-100 x times more expensive in future... And finaly cryptho just need to become little bit more expensive and mining gone be profitable again :) ", "score": 1, "replies": []}]}]}, {"body": "I bought while it was near record highs, but I think crypto was a short-term bubble no matter how you slice it.\n\nAs far as I see no matter what fad or legitimate new technology comes along, it will very likely require considerable computation ability. And that is what GPUs can give you. \n\nOnce I made that decision, it just came down to me always having liked and enjoyed Nvidia products. I’m long on it still.", "score": 3, "replies": [{"body": "OMG i feel sorry for you expensive lesson but for all life .  Many investors bought at hights now all are depresed .Cryptho mining was long term bubble its blow down twice already so you need to hope it gone happen again cryptho craze and than sell nvda or keep it up to you. If its long term investment buy more at this price so average nvda stocks price gone drop little . I got same expierence with GE stock so i know this feeling but never give up i lowered ge stocks price to around $12 and i buying more ge to lower stocks price no matter what but i know for sure company gone be fine in long run .", "score": 2, "replies": [{"body": "I’m not worried about it. But I’m not buying more. The position is the position. I’m preparing to take other positions in accordance with other parts of my portfolio that need to to be rounded out and diversified.", "score": 3, "replies": [{"body": "That's your mistake , if you find a good long term you average down until you can sell calls at your average cost . If you don't find it a good long term then you are making a mistake holding it even at a loss", "score": -1, "replies": [{"body": "I wouldn,t touch calls or puts its just to risky atleast for me... But yes people should keep money ar atleast even use margin allocation to average stock price if its long term investment.  But some people change mind every day so they gone loose money .", "score": 1, "replies": []}]}]}]}]}, {"body": "Weird it’s like they have other customers. ", "score": 1, "replies": []}]}
{"title": "Thinking of buying a couple of APPL stocks to get my hands wet. Need help", "selftext": "Oh god, where do I even start? There's so much out there and the more I read the more I realize I have no idea what's going on. So many terms being thrown around.\n\nHere's my plan, and let's go thru it and see where my logic is falling short:\n\n1. I wanna buy some APPL stocks. just a couple really.\n2. Keep these stocks for awhile\n3. Sell them to see how that happens and gain experience\n4. Buy more stock and just keep adding more overtime like a long term investment.\n\nHere's a question, where is the best place to create an account? I'm not a US citizen, if this matters.\n\nI assume the main gain would come if I decide to sell my shares in a few years when the APPL price is up high. Right?  \n\n\nEDIT: AAPL? wooops", "id": "a2gots", "created_utc": 1543781168.0, "score": 0, "upvote_ratio": 0.48, "num_comments": 13, "comments": [{"body": "You dont have robinhood so you have to keep in mind of transaction costs in buying and selling stocks.  What i did was my bank had a discount brokeage which i signed up for but you may be better off finding a brokerage with the best rates in your country", "score": 7, "replies": []}, {"body": "you are on the right track. But this is the type of stuff you should be able to research on your own. If you can not do the critical thinking for the basics you will find yourself sinking in the future. Look at investopia and consider creating a paper account for practice. Which bank are you with and do they allow trading? What country are you from and what is tax on capital gains for foreign stocks. Getting the answers to these kind of questions will develop your ability to think critically and make sound decisions in the future. Like I said you are on the right track.", "score": 6, "replies": [{"body": "Thanks man! I appreciate the input. There's just too much to catch up at once to be honest. I'm actually gonna try and find out all the answers to those, but just one more question, wouldn't an online brokerage account make more sense as opposed to banks?", "score": 1, "replies": [{"body": "Yes, but in your case of buying a couple stocks, not really. Buying and selling fees will eat into your profit, at such a low investment.", "score": 1, "replies": [{"body": "Gotcha, where would you suggest, a budget viable for this would be at?", "score": 1, "replies": []}]}]}]}, {"body": "Make sure you don’t just hop into a stock like AAPL because it’s a big company. Do your research and wait for the right time to buy. Paper trading is great also, you can use ThinkOrSwim to buy stocks with fake money to get some experience. Just open a Paper account.", "score": 2, "replies": []}, {"body": "FYI: You'd be buying APPL \\*shares\\*, not APPL \"stocks\". It's an easy mistake to make. I am not a bot.", "score": 3, "replies": [{"body": "> You'd be buying APPL\n\nAAPL.  I don't think I'm a bot.\n", "score": 5, "replies": [{"body": "*Bleep, bloop.* Thanks, non-bot.", "score": 2, "replies": []}]}]}, {"body": "AAPL is a more logically investment if you are holding long term. ", "score": 1, "replies": []}, {"body": "You should just paper trade.", "score": 1, "replies": []}, {"body": "Why choose literally the largest company as your first stock?\n\nThe way I like to think about a stock is to think, what does it take for the company to double in value.  And then decide whether that is a possible outcome.\n\nIn AAPL's case, they would need to create 2-3 completely new product lines WHILE having current product lines not die.\n\nMaybe if they create an Apple Car (though car industry scary to me).  Maybe Enterprise cloud (fight against the biggies of google, microsoft and amazon in a market they aren't particularly great in, enterprise).  While making sure laptops and iphones don't die.  ", "score": 1, "replies": []}, {"body": "F that all in amazon they are growing way faster per my reddit posts", "score": 1, "replies": []}]}
{"title": "$TSLA Daily Investor Discussion - December 02, 2018", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Q3 Earnings Official Thread](https://www.reddit.com/r/teslamotors/comments/9r1iru/tesla_tsla_third_quarter_2018_results_and/).\n", "id": "a2bu9v", "created_utc": 1543741468.0, "score": 5, "upvote_ratio": 1.0, "num_comments": 14, "comments": [{"body": "Stock market closed Wednesday for Bush funeral. ", "score": 9, "replies": []}, {"body": "So Trump and the chinese president agreed to not introduce any new tariffs on 1st of January. I assume this means that the current high tariff on Tesla cars is still in effect, right?", "score": 8, "replies": [{"body": "I believe so yes. Hopefully we see a market bounce on monday.", "score": 4, "replies": []}, {"body": "they also agreed that china will import more from the US, so wondering what effect this might have on TSLA", "score": 2, "replies": []}]}, {"body": "Can European customers configure model 3 yet?", "score": 3, "replies": [{"body": "No.", "score": 5, "replies": []}]}, {"body": "I haven't been following the stock much the past few since I just got engaged ^(:D) , but I'm glad to see absolutely nothing has change and it is as exciting as always.  ", "score": 4, "replies": [{"body": "Going up this week!  ", "score": 3, "replies": [{"body": "+1 for undestructable optimism", "score": 4, "replies": [{"body": "I mean q4 is starting to look to be locked in.  Good news out of China (good not great). Should test new highs this week or next.  Enjoy.", "score": 1, "replies": []}]}]}, {"body": "Congrats 🎉", "score": 5, "replies": [{"body": "Thanks!", "score": 3, "replies": []}]}]}, {"body": "Those futures are looking tasty. The French are rioting over fuel taxes. No one can understand the french.", "score": 1, "replies": []}, {"body": "So are we above the convertible price for the bonds?", "score": 1, "replies": []}]}
{"title": "Remember when motley fool laughed at analysts $165 price target on AAPL back in August? r/wallstreetbets remembers", "selftext": "", "id": "a28xrm", "created_utc": 1543713367.0, "score": 44, "upvote_ratio": 0.89, "num_comments": 12, "comments": [{"body": "It's not going to 165 after the trade talks tonight.  ", "score": 39, "replies": [{"body": "Short term, yes, I think it'll go up with the market.  It may continue till next ER.  If they disappoint next ER and guide even lower then you'll be wishing it stops falling at $165.", "score": 2, "replies": []}, {"body": "You’re right, it’s going to 130 EoY", "score": 6, "replies": []}]}, {"body": "r/wsb is the greatest financial think tank in the world.", "score": 38, "replies": [{"body": "This checks out", "score": 1, "replies": []}]}, {"body": "Uh ya I’m still laughing because it never made it there. ", "score": 8, "replies": [{"body": "$170 is pretty damn close.  If they beat next ER they'll be fine, if they guide down expect a shit show.", "score": 2, "replies": []}]}, {"body": "Lol, who takes motley fool seriously. All their clickbait articles not proof enough? I mean their disclaimer is in their name.", "score": 6, "replies": []}, {"body": "NEVER bet against $AAPL.\nThat's all.", "score": 10, "replies": [{"body": "Except win it’s gonna go down.", "score": 11, "replies": []}, {"body": "Tell that to all the put holders who made a fortune off their last ER.", "score": 3, "replies": []}]}, {"body": "mootley fool a fool, send tilray wasbt a buy at 300 guess who's laughing now", "score": 0, "replies": []}]}
{"title": "Strike for late Dec AAPL calls?", "selftext": "[removed]", "id": "a2eexx", "created_utc": 1543766996.0, "score": 10, "upvote_ratio": 0.76, "num_comments": 12, "comments": [{"body": "Any I can afford.", "score": 9, "replies": []}, {"body": "Super high IV coming this week, wait to see how it goes, let the IV drop, buy for Feb or March at the end of the week or next week, trust me, I'm a random guy on the internet, it works everytime", "score": 5, "replies": [{"body": "Hey Random Guy in the internet , i already bought my apple calls fd 200$ for 12/21 . Am i fucked? ", "score": 3, "replies": [{"body": "You good bro, just keep holding until they go up or go worthless", "score": 4, "replies": [{"body": "tautology ftw", "score": 2, "replies": []}]}, {"body": "I've got $200 Jan 18 bull spreads and I'm thinking those are probably fucked. ", "score": 1, "replies": []}, {"body": "that's not an fd", "score": 1, "replies": []}]}, {"body": "seems a bit optimistic", "score": 1, "replies": [{"body": "Just let it happen... Shhhh", "score": 2, "replies": []}]}, {"body": "Just do bull put spreads and the IVs cancel each other out :) ", "score": 1, "replies": []}, {"body": "Why he said spread ", "score": 1, "replies": []}]}, {"body": "Wtf i just posted about this, same i got apple call strike 200$ . Balls deep all in , worse case scenario, just sell it a week before it “expires” ", "score": 1, "replies": []}]}
{"title": "How will Apple performs on Monday?", "selftext": "[deleted]", "id": "a2ehgr", "created_utc": 1543767470.0, "score": 0, "upvote_ratio": 0.2, "num_comments": 9, "comments": [{"body": "Up, down or sideways.\n\nI fuckin bet you one of em\n\nCrafty little stock", "score": 5, "replies": [{"body": "I am almost 900% sure it won’t go down. How bout you bet it will go down and I will give you my wire link", "score": -2, "replies": [{"body": "Why'd you bother asking the question if you're 900% sure?", "score": 3, "replies": [{"body": "Retarts gonna retart. Just what they do around here. ", "score": 3, "replies": [{"body": "I am also asking how Apple is affected by tariff, maybe if you open your eyes you would see the full question ", "score": -1, "replies": []}]}, {"body": "To see how stupid you are", "score": -2, "replies": [{"body": "Wow, you're some prick.\nGood luck with your autism.", "score": 3, "replies": []}]}]}]}]}, {"body": "Trade war didn't end lol...it just didn't escalate further for now...\n\nBut it will be a short term boost for stock market now until talks breakdown again.\n\nRide the momentum assuming it's pretty green on Monday...cash out after your happy with profits as a single tweet will fucking send it back cratering ", "score": 4, "replies": [{"body": "Yep yep yep. Cash in on the pop then be there for the drop. Bulls from the recent run up will def be looking for chance to sell into strength", "score": 1, "replies": []}]}]}
{"title": "Dow Jones Futures up 400pts. Press F to pay respects to put holders and shorts", "selftext": "", "id": "a2irxt", "created_utc": 1543794331.0, "score": 17, "upvote_ratio": 0.84, "num_comments": 11, "comments": [{"body": "Rip bear gang ", "score": 11, "replies": [{"body": "F", "score": 4, "replies": []}]}, {"body": "F ", "score": 5, "replies": [{"body": "F", "score": 4, "replies": [{"body": "F", "score": 4, "replies": []}]}]}, {"body": "Future looking so sexy lol", "score": 5, "replies": []}, {"body": "F", "score": 4, "replies": []}, {"body": "F", "score": 5, "replies": []}, {"body": "Holy fuck. Eat my asshole.", "score": 3, "replies": []}, {"body": "F", "score": 1, "replies": []}]}
