{"title": "TSLA good short entry?", "selftext": "[removed]", "id": "aac7hr", "created_utc": 1546017544.0, "score": 0, "upvote_ratio": 0.45, "num_comments": 17, "comments": [{"body": "https://www.youtube.com/watch?v=q3nnP8JObxo", "score": 6, "replies": [{"body": "Make sense", "score": 1, "replies": []}, {"body": "please take the up-vote, kind sir. ", "score": -4, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "I feel the whole market has been irrational for the past several months ", "score": 4, "replies": []}, {"body": "TSLA had HUGE short interest, and a lot of that short interest came from hedge funds. Hedge funds saw tons of redemptions at the end of the year, and thus had to cut their short exposure as well as their long exposure. With so much riding on a TSLA short here, the selling off of these short positions during redemptions likely actually created a bit of a weird squeeze here not caused by anything fundamental to TSLA.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "There is a whole sub /r/Realtesla devoted to why Tesla should be bankrupt. \n\nTesla has products that creates fanatical fan base, they are expanding. Musk has billionaire friends, and Oracle founder has just been nominated to BoD of Tesla. He has deep pockets as well. \n\nA billion dollar loan from his friends here and there can save Telsa on a longer run. \n\nThey are expanding in China, have not yet exported Model 3 to Europe and a lot of growth to come in next few years. Don't expect the stock to go down any time soon. \n\nSears took multiple years to be bankrupt. JcPenny will also take a long time to go under. ", "score": 2, "replies": []}]}]}, {"body": "> My thesis was that under tense and uncertain global macro conditions and a worldwide equities bear market TSLA would fucking finally start to underperform the market for about a million obvious reasons that I won't take the time to list out\n\n“The market can stay irrational longer than you can stay solvent.” - Keynes", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": []}]}, {"body": "I’m sitting on my hands until 350", "score": 1, "replies": []}, {"body": "It's right in the middle of it's recent range. It could go either way.\n\nI'd be inclined to either do something long gamma and fairly delta neutral (like a long iron condor), or wait until its moved back toward the range low or high. Another thought would be a put ratio spread (or bwb) centered to the downside with little or no upside risk. But then you have to hope that it doesn't entirely crash.", "score": 1, "replies": []}, {"body": "I’ve given up trying to figure out TSLA. Even spouting off about Elon’s private sale didn’t make price move for very long. I’ve lost more than won with options, both puts and calls.", "score": 1, "replies": [{"body": "Buying or selling?", "score": 1, "replies": [{"body": "Both :-) Selling bear call spreads, buying put spreads. I just can’t seem to understand TSLA technicals, so I gave up.", "score": 1, "replies": [{"body": "Should have worked out pretty well for you", "score": 1, "replies": [{"body": "With TSLA it’s always about timing. First rule of investing - only partake in what you understand!", "score": 1, "replies": []}]}]}]}]}, {"body": "I have traded TSLA otions for a while and follow the news regarding them frequently. Based off what I see in the chart is that we will continue going sideways until the SMA's meet together and then we will know which way this is heading. But as of now I would trade PUTs on TSLA back down to the 290-300 range and then reverse it to the upside. Tsla could have a warehouse catch on fire, burning  up 90% of their product and still soar 50% higher.", "score": 1, "replies": []}, {"body": "TSLA value is so irrational, why would you bet either side? There are better bets out there.\n\n", "score": 0, "replies": [{"body": "Like weather or not your wife will takes some other dudes dick tonight? I don’t know any man that would bet against that ", "score": 1, "replies": []}]}]}
{"title": "NVDA expiration", "selftext": "Hi all, \n\nI had an NVDA iron condor that expired today, 12/28. I was hoping for everything to expire OTM but it ended up having the calls ITM. Now, on Robinhood, I have a pending $129 call assignment for $12,900 and a $130 call exercise for $13,000. I’m not sure what will happen next, can someone help explain the next steps to me?\n\n-1 NVDA $123 Put\n+1 NVDA $122 Put\n-1 NVDA $129 Call\n+1 NVDA $130 Call\n\nThank you ", "id": "aaf2cn", "created_utc": 1546035896.0, "score": 4, "upvote_ratio": 0.65, "num_comments": 10, "comments": [{"body": "They will exercise both calls for you, so it becomes a $100 debit from your account + exercise fees.\n(Basically your max loss for the sold spread)", "score": 7, "replies": [{"body": "Thank you very much!!!", "score": 4, "replies": []}]}, {"body": "can't believe people are still doing iron condors on these tech bubble stocks. IV is high on these for a reason.", "score": 1, "replies": [{"body": "Then which stocks would you recommend?", "score": 2, "replies": [{"body": "ICs are better in low vol environments. Most stocks right now are highly correlated with the index, so it's impossible to pin them to a small range. Long gamma is the play until vol settles down.", "score": 1, "replies": [{"body": "I see, well thank you. Still learning everyday. ", "score": 2, "replies": [{"body": "/u/marty3590 didn't really give you much context to what he's saying and could be very misleading.  \n\n\nIn general, when Implied Volatility is high (IV Rank is high), selling iron condors is a historically profitable play.  Implied Volatility is a forward thinking metric and says the market will move X amount in Y days.  Most of the time (65%-70%) actual volatility stays within expected volatility (implied volatility).  When this occurs, premium sellers are the winners.\n\n\nLast few months, actual volatility has been greater than implied/expected volatility, so premium sellers have been getting tested or just been losing.  Keep in mind, despite that, just because an underlying moves way out of your ITM strikes, it can swing right back in within your ITM strikes.  In times like these, if you want to still be a premium seller, I'd advise really dropping your risk and doing stuff like Chicken Iron Condors.  ", "score": 1, "replies": [{"body": "Thank you very much! I’ll lower my risk as I continue to learn. I appreciate your input. ", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "It's more about the size of the move relative to the vol that's already priced in, and the size of the move relative to the market and/or other stocks. AMD Jan 18 straddle is currently around 2.5. That's a 14% move either way. Compare that to the SPY Jan 18 straddles, which are currently priced at 10.8, which is just 4% of the current price. AMD has a 12M beta of around 3.3 relative to SPY, so if SPY moves 4% you'd expect only a 13% move in AMD. So AMD straddles are actually overpriced relative to SPY. \n\nThat said, these volatile stocks often move far more than what's priced in. For instance, the vol on TSLA is massively overpriced relative to SPY (Jan 18 straddle at 35), but it's paid off lately because it's been moving 20+ points in a single day.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "QQQ has a 95% correlation to the SPY. They basically move the same, although QQQ has larger moves in general (priced in to the vol). Only way to get the same amount of gamma for cheap is to buy puts/calls and get the direction right.", "score": 1, "replies": []}]}]}]}]}]}]}]}
{"title": "To those who trolled me for claiming that bear market has been cancelled. Here's why.", "selftext": "[deleted]", "id": "aa506v", "created_utc": 1545956792.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 10, "comments": [{"body": "I partly agree with you but for different reasons so I’m going to be a devil’s advocate for a moment...\nAll of those signs are fine and dandy but those same signs flashed before everyone’s eyes right before the 2008 crash and 2000 tech bubble.\n\nUnemployment at all time highs = peak unemployment = things can’t get much better from here\n\nConsumer Spending Expectations = Higher consumer debt\n\nYou forgot to mention that Consumer Confidence is at a multi-year low\n\nDebt levels at normal levels = Whereas before they were at below normal levels meaning they’re growing\n\nRising interest rates and bank tightening = Money is now more expensive and less liquid\n\nI am optimistic myself but I wouldn’t exactly count on several Lagging Indicators to signal what could potentially be ahead.\n\nWhat are the statistics that prove that new all time highs come within 12 months of a bear market? \nWhat are the statistics that prove that stocks consistently reach all time highs when the bond market is becoming increasingly attractive?\nWhat are the statistics that show that a 24% return to reach new ATH comes right after a 20% decline?\n", "score": 11, "replies": [{"body": "Isn't this the largest expansion in history without a recession (2 quarters of contracting growth)?", "score": 1, "replies": [{"body": "You’re correct. I’m not saying that it isn’t. I just personally think that OP’s argument (which ended up being completely sarcastic and facetious) is flawed. I am optimistic about the next year myself but not for the reasons he outlined", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": -20, "replies": [{"body": "TBH, I don’t see how you’re being /s considering you actually DID post yesterday about ATH coming soon.....and you defended yourself in the comments so I don’t see how this post implies any sarcasm at all", "score": 5, "replies": [{"body": "[deleted]", "score": -20, "replies": [{"body": "Go get a life dude. Or go play League of Legends. Either way, grow up and stop wasting people’s time making shit posts", "score": 7, "replies": []}]}]}]}]}, {"body": "Well hold on your horses. The rally is just 2 days old. There is a long way ahead. ", "score": 3, "replies": []}, {"body": "A dead cat bounce isn't a 1 day technical event.", "score": 3, "replies": []}, {"body": "GDP comes out 30Jan. Jan is a big earnings month.\n\nCheck back in a month.\n\nWhen the yield curve stays slightly positive it means slow economic growth. An inverted curve means negative growth.", "score": 2, "replies": [{"body": "Q4 GDP is expected to be 2.5%", "score": 1, "replies": []}]}, {"body": "I am sure all of you recall 1998 and the horrible crash that followed the next two years, right?\n\nI didn’t think so.  \n\nMarkets crash when everybody is all in and people are using student loans and margin to buy stock, and mainstream media talks about the glorious money making machine called Wall Street.\n\nShit, wages are still flat.  You have not seen a blow off top and nobody is getting laid off.  ", "score": 2, "replies": []}]}
{"title": "Looking for advice on reallocating", "selftext": "I am 24 years old, investing long term for wealth growth and eventually retirement. I currently make ~$60,000 Gross Annually with 7% matched in 401K (TRPLX). I have ~$7,500 in cash. Seeking advice for my Investment portfolio. Looking to reduce from 22 down to 12-15 holdings. Thanks in advance! \n\n\n$23,678 Current Market Value\n\nVOO (17%)\nBND (13.5%)\nBRK.B (13.5%)\nMSFT (7.5%)\nV (7.5%)\nAMZN (6.5%)\nAAPL (6.5%)\nSPLV (3.5%)\nCOST (3.5%)\nLULU (3.5%)\nDIS (2.5%)\nALK (2%)\nAMGN (2%)\nSBUX (2%)\nWMT (1.5%)\nBA (1.5%)\nJPM (1.5%)\nTVIX (1%)\nNDAQ (1%)\nADBE (1%)\nXLF (1%)\nPG (1%)\n", "id": "aaeilw", "created_utc": 1546032261.0, "score": 7, "upvote_ratio": 0.82, "num_comments": 14, "comments": [{"body": "I think it looks good other than the fact that you have too much money on bonds. You dont need 13% in bonds  as 24 year old, unless you keep it as your semi-emergency fund\n\nInstead maybe get more low cost index funds (voo, vti) or consider investing some on energy companies now that they are pretty low due to oil prices. Instead of individual names you can go with VDE which is another Vanguard index fund that is focused on energy companies. Also investing a bit more on banking sector wont hurt either", "score": 9, "replies": [{"body": "Thank you for that advice. I will look into VDE. ", "score": 1, "replies": [{"body": "Correct I noticed after I re-read and fixed it", "score": 2, "replies": []}]}]}, {"body": "Cut BND down to 3% for your fixed income allocation. ", "score": 3, "replies": []}, {"body": "If you want to reduce holding numbers, buy QQQ it has a bunch of those names. Plus there is a 3x version TQQQ. Only saying this because you asked about lowering the number of holdings. 22 isn’t that bad.\n\nI get why you would ask this, I’m in the same boat and I dollar cost average. It’s easier the less you have.\n\nIn your situation I’d leave it alone and set those % as is. Add accordingly to bring the assets up to that predetermined % monthly.", "score": 2, "replies": [{"body": "He looks like a buy and hold guy.  If QQQ tanks 10% more, he losses 30% on TQQQ and then could be caught bag holding a position that may never recover.  \n\nMaybe leveraged ETFs are ok with tight stops, but don’t dare let them take a 30% loss.  \n\nTake it from somebody who lost 80% on GUSH in 3 months.", "score": 3, "replies": [{"body": "I’m actually looking at gush right now. I might put the toe in with 1000 shares and sell weekly calls.", "score": 1, "replies": [{"body": "You might get a short term bounce as the market rallies but I wouldn’t hold longer until oil starts going back up", "score": 1, "replies": [{"body": "How much lower could it go? Countries economies are on the line. The bottom is near if not here imo.", "score": 1, "replies": [{"body": "As we saw it could go lower and countries can’t do anything about.  Nothing happened when it was below 30.  It can also go to 300.  The point is that it is not tradable and you could wait years for that once-a-decade commodity boom that may never come.  \n\nBut buying here is better than buying at $80.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "You can get a lot of those holdings in ETFs, I wouldn’t bother with owning such big names individually unless you see a given advantage in one. VOO already holds a lot of those, there’s no need to own them individually especially at small percentages. \n\nAt your age you can just do targeted ETFs, then become more conservative over time or just by allowing your matched 401k to be your conservative investment(7% is incredible btw). For example you can buy emerging markets or info tech ETFs rather than just broad market. It is true that the whole market ETFs are good, but it’s complicated because they aren’t always positioned to take advantage of emerging opportunities as have come up recently. ", "score": 2, "replies": [{"body": "To clarify they match 4 of the 7% that I contribute. They match 1% in full then match half of the remaining 6%. Thanks for your advice. That is basically what I’m doing with my investments in the individual companies. It’s the ones I believe in more. But some of my lower stakes I may sell and switch to VOO and bet on the market. Much appreciated.", "score": 1, "replies": []}]}, {"body": "What’s your occupation?", "score": 1, "replies": [{"body": "Concierge at a resort on Maui", "score": 1, "replies": []}]}]}
{"title": "Looking for stock recommendation(s)", "selftext": "Criteria:\n\n* Must be under $45 per share\n* Must be at least mid-cap.  No penny stocks or speculative small cap stocks.\n* Dividend yield must be at least 2%\n* EPS must be positive for last 3 quarters\n* Must not be an IPO from within the last 5 years\n* U.S. only - no ADRs, no China\n* No: GE (already have, cue sad violin), F (don't like), Under Armor (similar to F), AMD (don't believe), T (already have)\n* Preferably something that's not too complicated (e.g. I prefer not to buy stuff I don't understand like \"gene replicant splicing technology\" or something like that)\n\nAny recommendations?", "id": "aacr9k", "created_utc": 1546021043.0, "score": 0, "upvote_ratio": 0.37, "num_comments": 15, "comments": [{"body": "Who asks for recommendations with demands? Do your own research", "score": 22, "replies": []}, {"body": "JC Penney 😂", "score": 13, "replies": []}, {"body": "Do your own research you bum, that list of restrictions is ridiculous. ", "score": 12, "replies": [{"body": "Lmao An established US mid-large cap stock with a 2% div yield and positive earnings. \n\nHow will we ever find one of these unicorns!?!?", "score": 2, "replies": []}]}, {"body": "Dude just buy vanguard index funds, they beat most individual stocks and are stupid easy. Investing in individual stocks is for playing with your money, not true investing. Why? because you will never beat the market on average.", "score": 8, "replies": [{"body": ">because you will never beat the market on average.\n\nThat wholly depends on the investor.", "score": 8, "replies": []}]}, {"body": "Maybe CTL? The 45 dollar per share is somewhat limiting. Maybe look at the dividend aristocrat list for some ideas too.", "score": 4, "replies": []}, {"body": "MU  (MU $90 Calls too)", "score": 4, "replies": []}, {"body": "AMAT", "score": 3, "replies": []}, {"body": "Micron /s", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "That's a good stock screener.  Thanks.  ", "score": 1, "replies": [{"body": "It is nice, just make sure you check the fundamentals elsewhere.  Some of their data is off.", "score": 1, "replies": []}]}]}, {"body": "$SO", "score": 1, "replies": []}, {"body": "GE sucks good call. ", "score": 1, "replies": []}, {"body": "MO is hovering at 49, it may get to your under 45 a share criteria. \n\n\nps i love it how we are on the /r/stocks subreddit and people are suggesting fucking ETFs and Index funds.", "score": 0, "replies": []}]}
{"title": "What Bears Have Wrong on Tesla", "selftext": "", "id": "aa9iq0", "created_utc": 1545996228.0, "score": 10, "upvote_ratio": 0.92, "num_comments": 13, "comments": [{"body": "[deleted]", "score": 10, "replies": [{"body": "About a month ago a leaked email said \"depending on how you count it, the current cost of a standard range Model 3 would be around $38,000\".  I'd be willing to bet that number has dropped some as 5k units per week has climbed to 6k.  If I guess they are looking for a 10% margin on the base model (?) then they need that figure to be about $32k before the the SR makes sense.\n\nI'm not convinced of a looming recession because fundamentals are still strong: the GDP is still growing and I don't see it shrinking in 2019, unemployment is super low, etc.  If/when Trump gets the tariff negotiations done and the gov shutdown solved, wall st will begin smiling again.", "score": 3, "replies": [{"body": ">I'm not convinced of a looming recession because fundamentals are still strong: the GDP is still growing\n\nwages, GDP means nothing, wages are everything. You need to follow the: \n\nTable A-2. Current and real (constant 1982-1984 dollars) earnings for production and nonsupervisory employees on private nonfarm payrolls, seasonally adjusted\n\nstats from [bls.gov](https://bls.gov). That is my indicator because while the supervisor wages includes the top level people, they make up a small fraction of the population but earned way more in the 'recovery' since the recession. This stat also accounts for inflation, so the increase is meaningful ... \n\nThere are other factors you can follow, but all things move from wages in the end. ", "score": 2, "replies": [{"body": "> wages, GDP means nothing, wages are everything\n\nWait so GDP and employment don't *drive* wages?", "score": 2, "replies": [{"body": "GDP is more a measure of what is spent and total economic output.  \n\n\nPeople are shit with money, generally, so there is no disconnect in GDP going up while wages do not.  People already spend more than they make, so what's the difference.\n\n&#x200B;\n\nFurther, I beleive a large portion of US GDP is in real estate, and RE prices have been increasing very rapidly, though more people are renting because they are priced out of entry level homes.\n\n&#x200B;\n\nThat again looks like GDP up while wages are flat to down.", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Hey CommonMisspellingBot, just a quick heads up:  \nYour spelling hints are really shitty because they're all essentially \"remember the fucking spelling of the fucking word\".\n\nYou're useless.\n\nHave a nice day!\n\n[^Save ^your ^breath, ^I'm ^a ^bot.](https://www.reddit.com/user/BooCMB/comments/9vnzpd/faq/)", "score": 2, "replies": []}]}]}, {"body": "nope ... GDP is all the money total, where that money goes, drives wages. Most all of the GDP goes to about 12% of the population and the gap is getting bigger. \n\nRight now we are at ultra low employment, high employee demand, but wages aren't going up. That is a problem. Several Fortune 500 companies have gone on the record to state that they don't want to raise wages because it will cut into the bottom line in the long run. They are trying to give out more one time bonuses to placate people, but avoid the yearly raises people use to get. Such is the nature of increasing quarterly return demand.", "score": 1, "replies": [{"body": "Someone is taking a bigger share of GDP. That’s correct:\n\nhttps://ritholtz.com/2011/07/government-spending-as-a-percentage-of-gdp-2/", "score": 1, "replies": [{"body": "You really don't understand government spending and how it works do you?\n\nIt's a busy family day, so I don't have time to explain this concept to you, go google and learn something ...", "score": -1, "replies": []}]}]}]}]}]}, {"body": "The bulk of CAPEX for models S, X, and 3 has been executed, slowly and with great effort and debt, but now they are a steady income source for years (even with competition as the world is huge). Same cycle will come again for new models, but this time with the help of FCF from earlier model sales. \n\nI'm new to the stock and prepared for a nice ride ;) . Once the market sees Tesla having a straight row of positive Qs, and new models disrupt again the market, all the bears BS will vanish. ", "score": 3, "replies": [{"body": "current factories, sure. but the CAPEX for the China factory, Europe factory, and continued expansion of the service centres and superchargers will be a large CAPEX sink for years to come", "score": 0, "replies": [{"body": "Yep but the debt to value ratio will be better. Also next manufacturing lines will be operative faster with the current experience. Also financing china seems to be easier and cheaper. ", "score": 2, "replies": []}]}]}, {"body": "Totally concur. I want to see a good bear argument.  \n\nWhat I don’t see is this “competition”. If Mercedes only sells 100k Class C cars and plans on making a Electric one selling only 20k a year.  How is that competition against the model 3 400k Fremont and 400k Shanghai plant in 3 years. how does 20k compete with 800k a year?  If anyone knows of a company planning on making 250k pure electric vehicles by 2020 let me know. Otherwise there is no competition.  The funniest part is Audi, Jaguar, Mercedes are just advertising for Tesla. Thank you!", "score": 2, "replies": []}]}]}
{"title": "Advice: when the markets are headed for a bear market (or anticipated bear market) what changes do you make to 401k allocations?", "selftext": "[removed]", "id": "aa5bef", "created_utc": 1545959046.0, "score": 0, "upvote_ratio": 0.33, "num_comments": 20, "comments": [{"body": "Up contribution % and wait 40 yrs is my plan. I am is in 20s", "score": 20, "replies": [{"body": "Up and wait 25 years. I'm 35. My next paycheck is going to suck. I increased my contribution to 75% to dollar cost average in. ", "score": 3, "replies": []}]}, {"body": "Hold strong and give up all your gains ", "score": 3, "replies": []}, {"body": "not hard to allocate 0", "score": 4, "replies": []}, {"body": "Increase your contribution size, overweight equities, and change allocation to more risky funds (EM Growth, DM Growth, etc)", "score": 4, "replies": []}, {"body": "Depends on your age and how close you are to retirement. If you have more than 20 years to go, just let it ride. Anything less; GTFO this sub ", "score": 5, "replies": []}, {"body": "YOLO. Let it ride. It dips, increase contributions and buckle the fuck up ", "score": 3, "replies": [{"body": "This has been my strategy to date. Just wanted affirmation from fellow autists", "score": 2, "replies": []}]}, {"body": "Yank it out and yolo it on MU calls", "score": 2, "replies": []}, {"body": "No touchie", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "That 10% penalty plus taxes hurt bb but hope this works out for you", "score": 1, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Stop trying so hard ", "score": 5, "replies": []}]}]}]}, {"body": "DCA every 2 weeks.  No changes.  Once you get old like me, you shift a percentage of money to bonds when the market is high. ", "score": 1, "replies": [{"body": "How old?  I’m 52 and don’t have any bonds.  Sold all of them a few years ago", "score": 1, "replies": []}]}, {"body": "Reduce contribution % and use the money to short my 401k", "score": 1, "replies": []}, {"body": "Buy real-estate don't have 401k funds here....", "score": 1, "replies": []}, {"body": "LoL. We are headed out of a bear market", "score": 1, "replies": [{"body": "Maybe. I realize it’s likely too late to shift funds out of the market into cash if you’re attempting to shield investments from the dip, but just curious about others strategies.", "score": 1, "replies": []}]}, {"body": "Moved money into a money market fund weeks ago. I am waiting for the first circuit breaker to go before buying into the s&p500. ", "score": 1, "replies": []}]}
{"title": "Calling all chart pros!", "selftext": "Who else sees the DOW closing up 500 tomorrow before going down next week to under 21,800?", "id": "aa6hnn", "created_utc": 1545967919.0, "score": 10, "upvote_ratio": 0.72, "num_comments": 11, "comments": [{"body": "Palm readers can do better than chart pros. Come on, even that dead octopus has better prediction rate (that is N/A since Paul is dead) today than chart reader POS.. I mean pros.", "score": 9, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "what does PPT stand for", "score": 1, "replies": [{"body": "Nobody tell him. ", "score": 2, "replies": []}, {"body": "Plunge Protection Team", "score": 1, "replies": []}]}]}, {"body": "I do see it however... I also see lots of money being stolen by a lack of volatility suddenly so I’m out. Next week is where the action awaits ", "score": 1, "replies": []}, {"body": "Looks like all 3 chart pros didn’t see your post", "score": 1, "replies": []}, {"body": "Chart chart chart", "score": 1, "replies": []}, {"body": "I don’t use charts, I get super high and impulsively buy stocks like a normal personal. Dow to 30k by next April.", "score": 1, "replies": []}, {"body": "Guessing the direction of the market in a short period of time is a gamble at best. Charting only really helps for longer periods of time, when you can see an over all trend or momentum", "score": 1, "replies": []}, {"body": "If you look at the S&P 500 we made a head and shoulders pattern, which is a top formation. The neckline is at 2600. We also made a double top at 2900. The Dow is has irrelevant. ", "score": 0, "replies": []}]}
{"title": "5 Things I'm Watching Today (Friday, December 28)", "selftext": "[deleted]", "id": "aaa2eu", "created_utc": 1546001585.0, "score": 73, "upvote_ratio": 0.9, "num_comments": 12, "comments": [{"body": "Pelham Smithers is the most British name I’ve ever heard.", "score": 25, "replies": [{"body": "I do say", "score": 4, "replies": []}]}, {"body": "out of all the things listed here the one id for sure bet on would be trump calling that extra 300m a “huge” win. may even spice it up and throw in a prop for “bigly” too lmao", "score": 12, "replies": [{"body": "Yuge", "score": 4, "replies": []}]}, {"body": "Gene Munster has always been a hyper AAPL bull, for the past 10 years, and he's always had the highest price target. He does offer interesting insight and new perspectives on how the tech landscape is changing, but you gotta take his valuations with a HUGE grain of salt.", "score": 12, "replies": []}, {"body": " the British guy is definitely smarter than me, but he has to be high on tea if he thinks apple is gonna tank past the $100s. \n\nHe has to be so caught up in the iPhone unit sales that it’s the only thing he cares about. Left and right you see people with apple products and  buying more and more apple products. When was the last time you walked in an apple store that wasn’t filled wall to wall?\n\nsMArT phOnE SaTuRAtiON my ass. I get a new fucking phone every two years. Most likely gonna start being every year because phone carriers are allowing for the payment plans where you can just trade in for the new one. People are paying monthly for these phones now so it’s not a 1200 vs 700 price tags difference, it’s a $40 vs $45 monthly difference.\n\nI don’t fully understand the Qualcomm thing or the impact but I highly doubt that its gonna bring the global magnate in smart phones down. Fucking Pelham Smithers", "score": 5, "replies": [{"body": "Yeah I agree with you mate. Everything on Apple’s balance sheet point towards possibly just being oversold and in a slump. Looking at where other tech is priced, AAPL at this price should be a buy. One thing I worry is that apple is quite behind on the IoT and subscriber services, Apple Music and their speaker kinda flopped, but those are long term and if I wasn’t an autist that only does options and UGAZ I’d totally buy shares ", "score": 5, "replies": []}, {"body": "Disregard everything European analysts say. Even worse than American ones.", "score": 2, "replies": []}]}, {"body": "What does Facebook give me? Seriously I don’t understand the infatuation with this cancer site. “Look at me look at me”. “I made dinner”. “My kid shit his pants”. “Buy my shitty mlm crap”. People are simply retarded.  ", "score": 3, "replies": []}, {"body": "Plot twist: Powell says FED will scale back unwinding 50B a month to something less punitive. Trump declares victory and DOW hits 30k in 2019.", "score": 4, "replies": []}]}
{"title": "It’s either the wall or a planned recession. Get them long puts ready on Monday.", "selftext": "", "id": "aaf76k", "created_utc": 1546036802.0, "score": 3, "upvote_ratio": 0.66, "num_comments": 12, "comments": [{"body": "If this was true and not just a sensationalist headline , we would have drilled to earths core today . Surely the tweet doesn’t say “ill cause a recession” and they’re just extrapolating that ? \n\nI hate trump and figure he will end up drilling us more , but fuck I hate clickbait “journalism”", "score": 7, "replies": [{"body": "You’re right on point with everything.  I feel like this is Market Manipulation 101 for big media.  If they keep the crap show up, they just might get exactly what they falsely write about.", "score": 2, "replies": [{"body": "Why would you submit this crap then. Nobody goes to *New York* magazine for their financial news, or any news.", "score": 2, "replies": [{"body": "Because 90% of the US move their portfolios based on what is said on the news.  So if the media starts to throw tabloid quality “news” out there, how do you think the market will react?  ", "score": 1, "replies": []}]}]}]}, {"body": "Wait... so closing the border = recession?", "score": 3, "replies": [{"body": "Closing the border with a wall = no recession.", "score": 1, "replies": [{"body": "No where in the article does it even mention recession besides the title. This is just clickbait.", "score": 4, "replies": [{"body": "That’s what you get with liberal fake news media ", "score": 2, "replies": []}]}]}]}, {"body": "When are the Mexicans going to pay for it? ", "score": 3, "replies": [{"body": "The check is in the mail, _hombre_", "score": 1, "replies": []}]}, {"body": "Sensationalist headline.", "score": 1, "replies": []}, {"body": "Clickbait", "score": 1, "replies": []}]}
{"title": "Short BAC", "selftext": "[deleted]", "id": "aafabx", "created_utc": 1546037376.0, "score": 8, "upvote_ratio": 0.9, "num_comments": 13, "comments": [{"body": "Is that a chart of your muscle gains at the gym? ", "score": 18, "replies": []}, {"body": "Lanky cutie showing some thigh", "score": 10, "replies": [{"body": "Be careful of gingers", "score": 6, "replies": []}]}, {"body": "Fuck i wish my gym did this.  ", "score": 7, "replies": []}, {"body": "There is always huge call volume on BAC. It's almost 70% every day. ", "score": 3, "replies": [{"body": "Possibly from large positions selling covered calls?", "score": 1, "replies": [{"body": "Tbh idk ", "score": 2, "replies": []}]}]}, {"body": "I go to this LA Fit", "score": 2, "replies": [{"body": "You guys should make out.  ", "score": 3, "replies": []}]}, {"body": "BAC is a good long term play because they make a lot of money from actual retail banking and deposits, not deal flow or trading. ", "score": 1, "replies": []}, {"body": "I've made, consistently, money off of BAC calls. It's pretty reliable on its price point, you just need to make sure you're not betting higher than its resistance and you're not buying calls in the middle of a shitstorm. ", "score": 1, "replies": []}, {"body": "holy fuck your LA fitness looks exactly like mine", "score": 1, "replies": []}, {"body": "Banks were hammered the most from rising interest rates, yet the Fed just lowered guidance for next year. Rally incoming led by bank stocks?\n\n* JPM: P/E = 11.23, Fwd P/E = 9.62, 3.3% Dividend Yield\n\n* GS: P/E = 6.52, Fwd P/E = 6.47, 1.96% Dividend Yield\n\n* MS: P/E = 8.33, Fwd P/E = 7.64, 3.05% Dividend Yield\n\n* BAC: P/E = 10.61, FWd P/E = 8.52, 2.46% Dividend Yield\n\nI wouldn't go shorting these stocks... ", "score": 1, "replies": []}]}
