{"title": "Apple (#AAPL) now only -31% since Warren Buffett said the iPhone is “enormously underpriced” tweet (@Hipster_Trader)", "selftext": "", "id": "a85hvb", "created_utc": 1545359841.0, "score": 2, "upvote_ratio": 0.63, "num_comments": 12, "comments": [{"body": "20 years from now AAPL will cost 7,700 a share. ", "score": 11, "replies": [{"body": "Sure, however hamburger in MacDonalds will cost 7000)", "score": 6, "replies": [{"body": "That's why \"the Oracle\" also owns some MCD with his AAPL. ", "score": 2, "replies": []}]}, {"body": "A better guess would be 3x the price today. So maybe $450-$600", "score": 2, "replies": []}]}, {"body": "It's hard to tell if you're saying we should buy more AAPL now or if you're just pointing out that  currently a Buffet call isn't winning.  If it's the latter, WB isn't a trader, he's an investor.", "score": 1, "replies": [{"body": "It wasn’t a Warren Buffett call. He said the iPhone has tremendous value to the users. That’s it. It wasn’t a call on when to buy shares at all. This person keeps posting this statement that makes NO sense!", "score": 1, "replies": []}]}, {"body": "You can keep posting this but it makes no sense. \n\nHe said the iPhone is underpriced for the value it gives the consumer. That’s it; it was a statement about how great the iPhone is.\n\nThat statement has no relation to Apples stock price. Nor does your statement about Apple being down -31% mean anything; he has been buying for years; I think Berkshire has bought from around $100 up.\n\n", "score": 1, "replies": []}, {"body": "The IPhone only has more upside from here so I still believe he is correct", "score": 1, "replies": []}, {"body": "He's not the oracle of tech stocks or he would've bought Apple in 1996.", "score": 1, "replies": []}, {"body": "[removed]", "score": 0, "replies": [{"body": "stop pushing your shitty pennystock", "score": 1, "replies": []}]}]}
{"title": "(BAC) vs (JPM): which is a better choice right now?", "selftext": "In the current market/ situation, which would you choose to invest in?  (Given that you would put the same amount of capitol in either- not one share of BAC vs. one share of JPM.)\n\nDisclosure: I hold positions in both.", "id": "a87r2v", "created_utc": 1545378582.0, "score": 5, "upvote_ratio": 0.78, "num_comments": 14, "comments": [{"body": "I really like JPM. I think their management is fantastic and they are at the top of the game tech/development wise.\n\nThere are a lot of smart people operating their business. And businesses live and die by those who run it.", "score": 12, "replies": [{"body": "Dimon is the man, really enjoying his interviews and the Business Roundtable\n\n https://www.businessroundtable.org/", "score": 1, "replies": [{"body": "Indeed, he makes a lot of sense when he talks unlike some CEO's that are all fluff.", "score": 1, "replies": []}]}]}, {"body": "JPM", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Cheap was when Citi fell to 9cents/share lol \n\n\nFuck Citi, I’d say best bets are BAC and JPM \nJPM being one of my favorites ", "score": 3, "replies": []}, {"body": "I own Citi and JPM in my dividend portfolio. Both are great global banks. Banks will see a rally, eventually. Right?!", "score": 1, "replies": []}]}, {"body": "I had both, sold them during this bloodbath.  BAC has gotten beaten down harder, so you have to decide does that make it a better value or the market perceives it as a lesser investment.  JPM has a premiere CEO but I bet he retires in the next 24 months, that could hurt the stock price bigly.", "score": 1, "replies": []}, {"body": "Think of companies like students unless mgmt and culture change drastically.  A students are gonna A student.  JPM all day.\n\n", "score": 1, "replies": []}, {"body": "Both are great. But bac has less global exposure.", "score": 1, "replies": []}, {"body": "If you only want to go in one of them then JPM, solid company with good management. ", "score": 1, "replies": []}, {"body": "Papa Buffett has a YUGE stake in JPM so... ", "score": 1, "replies": []}, {"body": "Banks are a tough nut to invest in so i like to invest in companies that have Warren buffet's approval. His holding in BAC is greater around 5 times as great JPM.\n\nBut of course do your own research since stock prices go up and fall.", "score": 0, "replies": [{"body": "Buffet also owns American Express over Visa and MasterCard and let’s not pretend like AXP is remotely on the same level as V or MA\n\nBut to answer the question, I like JPM. They are moving into the Boston area aggressively and I love the leadership and int’l exposure ", "score": 0, "replies": [{"body": "Yes that's why i said do you own research since prices go up and down American express was just a lot cheaper as visa and mastercard.", "score": 1, "replies": []}]}]}]}
{"title": "Bottoming out or just getting started?", "selftext": "[deleted]", "id": "a8ayrc", "created_utc": 1545405679.0, "score": 5, "upvote_ratio": 0.85, "num_comments": 18, "comments": [{"body": "I'll say.... 42.", "score": 14, "replies": [{"body": "Well played....\n\nCheck back in 42 and see if you're right", "score": 4, "replies": []}, {"body": "[deleted]", "score": 5, "replies": []}]}, {"body": "The markets have been looking for a reason to be skittish. Even with fairly solid economic indicators they've been reacting negatively. I think we'll be beat for a while because either the fed will see the economic indicators doing well and continue the rate hike making investors irrationally skittish or the economic indicators will be bad also making investors skittish. Now depending on how the trade war plays out, I think that might give the market a quick boost for a bit but it's hard to see anything but a rather volatile/bearish market for the next year or two \n", "score": 6, "replies": []}, {"body": "I think the perspective that stocks are generally long holds for investments is never more true than now. If you plan to buy in, it might be the time, or it might be time to wait and see what happens over the next couple weeks or into earnings season. If you've got down investments and have the income or cash to wait it out, I wouldn't crater a portfolio just to get out before the crash because there might be a turnaround on the horizon, and if dividends stay up, lower share prices could help.", "score": 4, "replies": []}, {"body": "We’re down 20% from ATHs with no troublesome economic indicators.  This is a correction, not a recession.  Who knows what will happen. The market could flounder for a year or bounce back after Q1. \n\nPlace your bets. ", "score": 6, "replies": []}, {"body": "Imagine what would happen if FED raises the interest 2 more times next year.. ", "score": 3, "replies": []}, {"body": "STOP SAY RECESSION. WE ARE NOT IN A RECESSION. \n", "score": 9, "replies": [{"body": "OP clearly said “if it turns into a recession”. Chill. ", "score": 10, "replies": [{"body": "Can you read? They said ‘full recession’ implying we are half way in one already. ", "score": -1, "replies": []}]}, {"body": "Nice all caps freak out, did you get burnt this week?", "score": 3, "replies": []}]}, {"body": "We will see bounces, but I think we’re only ~40% of the way down", "score": 2, "replies": []}, {"body": "The longer secular downtrend is just beginning. Markets are still overvalued. But I think there will be a nice countertrend rally early in 2019. Not a bad move to get in here for a swing trade. Recession is starting in China, but more than a year away in US. ", "score": 3, "replies": [{"body": ">Recession is starting in China,\n\nLink?", "score": 2, "replies": [{"body": "Belated response, but I should have said a slowdown is starting in China. It's still  unlikely to amount to an actual recession, but a risk worth considering. By China's standards, 5% growth right now might be considered \"slow\". \n\nBut here are a few [recent](https://markets.businessinsider.com/news/stocks/china-property-market-passed-the-tipping-point-2018-12-1027784292\n) [articles](https://uk.mobile.reuters.com/article/amp/idUKKCN1OI2RV) on [slowing](https://markets.businessinsider.com/news/stocks/china-trade-data-wasnt-pretty-worst-yet-to-come-2018-12-1027796022) [growth](https://www.reuters.com/article/us-china-economy-activity/chinas-consumers-factories-take-a-beating-as-economic-gloom-deepens-idUSKBN1OD05Q) there, and on the [risk](https://www.project-syndicate.org/commentary/global-impact-of-chinese-recession-by-kenneth-rogoff-2018-11) should it [get worse](https://www.scmp.com/economy/china-economy/article/2173461/china-underestimating-its-us3-trillion-dollar-debt-and-could). \n", "score": 1, "replies": []}]}]}, {"body": "Im with Leon Cooperman when he lays the blame on the trend following algorithms that buy up and sell down. \n\nThere is no factual indications we are in a recession.\n\nThe SEC needs to finally do their fucking job and deal with this wild west market they created back in 2007 by eliminating the uptick rule.\n\nIt's absurd the amount of points that can move in mins with no actual sign of recession. \n\n", "score": 1, "replies": [{"body": "Imagine when passive retail will start selling.", "score": 1, "replies": []}]}, {"body": "While we are on the topic of talking about things that might not happen let me distract you by claiming theres a 20% chance of nuclear war in 2020 because of Russian hostilities and rise of China as a global power. Otherwise... April my man, I call market rallies by Spring. Warm weather is for bulls, cold weather for bears. Duhhhhh", "score": 0, "replies": []}]}
{"title": "A recession is coming. Trump is going to make the recovery worse.", "selftext": "", "id": "a86liy", "created_utc": 1545368840.0, "score": 0, "upvote_ratio": 0.4, "num_comments": 12, "comments": [{"body": "Sound financial advice from an opinion writer ", "score": 23, "replies": []}, {"body": "Lmao. Economy slowed down. Reversed. Negative GDP. Recession and the recovery. All in one article. Bravo on the shit “journalism”", "score": 7, "replies": []}, {"body": "Just imagine his autistic screeching when there is a serious stock market crash. ", "score": 6, "replies": []}, {"body": "When was the last time the recession happened when everyone said it was going to happen?", "score": 5, "replies": []}, {"body": "Why tho\nGdp is high.\nUnemployment is low.\nTrader war yes but it will get resolved in near future. Feels like market in purpuse was trying to go low so feds dont raise rates. Does not make sense", "score": 4, "replies": [{"body": "GDP and unemployment high due to recovery and tax cuts.  With rate hike, it will take away the borrowing and reveal the house of cards credit system we currently under.  People cant borrow, so they wont spend, and businesses starts laying off workers.  Hello 2008, my old friend.", "score": 5, "replies": [{"body": "Why would the fed do this..please ELI5", "score": 3, "replies": [{"body": "Because you can't continue to cut taxes, give away money,  and function as a government. Corporations are greedy and if you let them have their way forever, they will completely wipe out the middle class and there will be even greater income inequality than we already have. ", "score": 16, "replies": []}, {"body": "They are putting bullets in the chamber because they expect things to get a lot worse down the road.", "score": 2, "replies": []}]}]}, {"body": "It’s weird caz earnings have never been better and yet we r lower than 2017 despite having much better earning in 2018 vs 2017", "score": 1, "replies": []}]}, {"body": "Washington Post opinion piece. about Trump. lmao", "score": 2, "replies": []}, {"body": "Hey, Jeff... if you didn't want him to be president you should have worked harder during the election and paid middle America more on your way to becoming a trillionaire.\n\n...but you didn't, so your little postal treaty subsidy is jeopardy.\n\nLive with it, because you earned it and deserve every last bad thing that comes with it.", "score": -7, "replies": []}]}
{"title": "$NVDA should chip in for his funeral", "selftext": "", "id": "a86lzt", "created_utc": 1545368943.0, "score": 26, "upvote_ratio": 0.91, "num_comments": 12, "comments": [{"body": "posts like that make me realize we are going much much lower", "score": 41, "replies": [{"body": "Comments like this make me realize we might trade sideways. ", "score": 7, "replies": []}]}, {"body": "\"Chip in\"\n\nThis man... Is clever.", "score": 14, "replies": []}, {"body": "NVDA needs to be priced at around $37 to get back in line with trend that was going up to 2016.", "score": 7, "replies": []}, {"body": "FOMO is strong in this one...", "score": 5, "replies": []}, {"body": "I mean he's not wrong but you gotta wait for that daily mac d to turn up and show signs of a strong bottom, no use catching a knife.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Probably, but they lowered guidance for next quarter which could allow them to beat.  So 25 pe with earnings beat could allow them to bounce.", "score": 1, "replies": []}]}, {"body": "Scale in 5% every time the stock goes up or down $10.", "score": 0, "replies": []}]}
{"title": "Why own stocks at all? Why even bother? Why not just own CDs? What happened to there's always a bull market somewhere? Who can take this pain? - Jim Cramer", "selftext": "[deleted]", "id": "a88brj", "created_utc": 1545384324.0, "score": 8, "upvote_ratio": 0.79, "num_comments": 18, "comments": [{"body": "Cramer is super anti fed, and almost seems to have  a personal vendetta with them. He has a point that our companies are executing but they seem to be battling the tariff man and  the fed. Really not much more some of these companies can do to grow their profits, but their stocks dont reflect their production and its mainly because of trump and powell. it is frustrating.  ", "score": 9, "replies": []}, {"body": "Bull market in owning puts", "score": 6, "replies": [{"body": "Right. There's money to be made in all markets. ", "score": 2, "replies": []}]}, {"body": "\"Who can take this pain?\"\n\n#BOY HAVE I GOT A SUBREDDIT FOR YOU, CRAMER", "score": 6, "replies": []}, {"body": "I think comments like this are not helpful in a market like this. This market is unusual, historically. I think it's unusual because here you have the market leaders and the people who are supposed to be bringing calmness and sanity to the market actually seeming to be against each other. I am speaking of Fed vs. Trump; Trump vs. Chinese; Trump vs. everyone. \n\nI usually don't think of a leader as being someone who tries purposely to confuse and belittle market participation. But this is really the only thing Trump has done. ", "score": 10, "replies": [{"body": "Trump doesn't get any criticism on CNBC but he has been an absolute clown bringing the markets down with Tweets and just overall dysfunctional leadership. ", "score": 16, "replies": [{"body": "Reminds me of the guy you fire after he gets drunk at a Christmas party. Just no real display of leadership. Even his \"withdrawal\" from Syria seems to be something he just rolled out of bed and decided, and then told everyone, even American allies, was going to happen. They were like, whut?", "score": 5, "replies": []}, {"body": "The mcds near my place has lower turnover than trumps staff. I swear if twitter banned him and he just stopped talking for a month spy be at 280", "score": 1, "replies": []}]}]}, {"body": "My wife, Lisa, was justifiably concerned when she saw how depressed I was and she reminded me that, in the end, I can't do anything about it. I am a TV talk show host for heaven's sakes and she wanted to know who in heck I thought I was to believe I even should count in the process. I said I know that I care about people's retirement accounts and their ability to make money with their money in the stock market. Again, she said, it's not my job to fight the Fed, it's my job to try to tell you why stocks may still be worth buying and why this isn't the end of the world. I told her it's a bear market caused by the Fed and Trump's trade policies and that while I can accept the latter for reasons of national security, I can't abide by the former because there is no reason for Powell to be this way, to make these policy mistakes and that if he listened to all of the conference calls I do and talked to as many CEOs as I do, he would have definitely drawn a different conclusion. She reiterated it isn't my job to try to play a role. It's just my job to help.", "score": 4, "replies": [{"body": "Pullbacks and bear markets are GOOD for the market", "score": 1, "replies": []}, {"body": "Thank you for your service ", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "ill have you know I buy options with loans\n\n&#x200B;\n\nI am not a pussy", "score": 3, "replies": [{"body": "Good man", "score": 1, "replies": []}]}, {"body": "Hes quoting the article. ", "score": 2, "replies": [{"body": "Oh, good catch. The writer sounds like a complete pussy.", "score": 1, "replies": []}]}]}]}, {"body": "I love my compact discs :)", "score": 2, "replies": []}, {"body": "I feel sorry for him. That he has to make these click bait articles. ", "score": 2, "replies": []}]}
{"title": "5 Things I'm Watching Today (Friday, December 21)", "selftext": "[deleted]", "id": "a89aem", "created_utc": 1545393386.0, "score": 46, "upvote_ratio": 0.9, "num_comments": 15, "comments": [{"body": "Don’t want to buy the dip on the USS Thresher!", "score": 6, "replies": [{"body": "SUBMARINES ONCE, SUBMARINES TWICE\n\nHoly jumpin' Jesus Christ\n\nWe go up we go down,\nWe don't even fuck around\n\n*klaxxon noises*", "score": 5, "replies": []}]}, {"body": "Thanks!!", "score": 5, "replies": []}, {"body": "My daily TYFYS (thank you for your service) in providing these updates. Have an upvote.", "score": 3, "replies": [{"body": "✌️", "score": 1, "replies": []}]}, {"body": "It’s all retail trading right now, most big players are out of the market end of November / early December. Anything happening from now until like the first week of January I’d take with a grain of salt. \n\nAlso lol @ that Elon musk article. Writer is so salty. ", "score": 4, "replies": [{"body": "That writers not the only one. I haven't seen a single positive article on it. (because shocking, musk is wrong) ", "score": 1, "replies": [{"body": "I think it’s a great idea, we’ll see who is right in the next 10-20 years. At least he built something instead of these idiots talking about maglev trains coming when I was in MIDDLE SCHOOL. ", "score": 2, "replies": []}]}]}, {"body": "Today is all about Quad Witching", "score": 2, "replies": []}, {"body": "Somebody needs to update all those xtranormal \"buy the fucking dip\" scripts.", "score": 1, "replies": []}, {"body": "If you still use FB there is no helping you", "score": 1, "replies": []}, {"body": "Bought moar EA", "score": 1, "replies": []}, {"body": "\"If the withdrawals continue for the eight final trading days of the year, December will mark the biggest cash-out from U.S. equity funds on records that date to 1992, when the fund industry was far smaller.\"\n\nWhat is this # as a %?", "score": 1, "replies": [{"body": "I don't have that right on hand, but for a decent benchmark, the article said:\n\n>More than $80.7 billion poured out of U.S.-based stock funds during the 14 days through Dec. 19, representing about 1 percent of the total assets in such funds, \n\n&#x200B;", "score": 2, "replies": []}]}, {"body": "If you think sentiment is bad now, you're in for a real treat if this develops into a full blown bear market.  \n\nYeah, yeah.  Get off my lawn.", "score": 1, "replies": []}]}
{"title": "I Read The News So You Don't Have To - Market News (Dec. 21, 2018)", "selftext": "### UNITED STATES\n\n* **Futures** are down this morning in the US and global stocks are falling as well\n* Budget discussions took a sharp turn and it now looks like the government will indeed shutdown tomorrow unless $5bn are allocated to build a border wall\n* Data from the *Philly Fed* shows regional **manufacturing** **activity** **slowing** and \"hours worked\" reversing course to 2016 levels\n   * **New Orders** and **Expected Investments** are holding steady though \n\n### OTHER\n\n* The Bank of England reduced Q4 growth forecasts from 0.3% to 0.2% for the **British economy** \n* **UK Retail Sales** came in strong (Expected 2.3% | Actual 3.8%)\n* A court in **Germany** is making **Apple** stop selling certain iPhones after finding that they **infringed on Qualcomm** patents \n* **Oil** continues to get battered with the price of **Brent** **Crude** falling below $55/barrel \n* The Malaysian government wants $7.2bn from **Goldman** **Sachs** for their involvment in the **1MDB** corruption scandal\n* **Carlos Ghosn** was rearrested amid suspicion that he shifted $16 million in personal losses to **Nissan** \n\n### CHINA\n\n* The gap between Chinese stock underperformance and US stocks is narrowing \n   * US stocks have underperformed Chinese shares since the end of October \n* [The South China Morning Post is bullish on American stocks ](https://www.scmp.com/comment/insight-opinion/article/2178855/why-federal-reserve-rate-hikes-and-us-market-fundamentals)\n* Charges have been filed by the US against two Chinese citizens for their role in a campaign to steal information from US businesses and the government \n\n*\\*This will be my last time reading the news for you until Dec. 27 - Happy Holidays* 🎅", "id": "a89jgh", "created_utc": 1545395536.0, "score": 192, "upvote_ratio": 0.99, "num_comments": 17, "comments": [{"body": "This is dope. Thanks. We fucked. ", "score": 88, "replies": [{"body": "You had like 3 different feelings in one line. Damn.. ", "score": 40, "replies": [{"body": "Thanks, I hate it", "score": 16, "replies": []}]}, {"body": "Hope. Appreciation. Realization. ", "score": 7, "replies": []}, {"body": "gdp of 3.4 fam  dont worry fam HARD GREEN DAY\n\n&#x200B;\n\nGAS THE FUCKING SHORTERS\n\n&#x200B;\n\nAll in EA calls", "score": 5, "replies": [{"body": "See I think this is the difference between professional traders with millions and people gambling with workman’s comp settlement checks.\n\nThe traders are buying the dip knowing they can hold for a year or two and be back pushing new highs.", "score": 1, "replies": []}]}]}, {"body": "Surprised you didn't mention today is a Quad Witching day", "score": 7, "replies": []}, {"body": "Thank you! And happy holidays to you as well.", "score": 5, "replies": []}, {"body": "thx bb", "score": 5, "replies": []}, {"body": "Merry Christmas and enjoy the weekend.\n\n  \n\n\nLet's see who will wait for the rise up and then buy puts today and profit today. Day trade puts today my fellow gamblers. See you on the profit side.\n\nQuadruple witching is today and tons of options and futures expire today. \n\nI personally think buy SPY straddle for dec 31st at the money at 930am. Then hold that for a few days and do day trades today on the direction or \"trend\" that you \"feel\"\n\n\nSet alerts for UVXY at 85 and start thinking of puts on it.\n\n\nRemeber volatility will slowly come down eventually so watch it if it ever spikes up fast, grab a couple of puts.\n\n\nGod bless\n\n  \n\n\nYou'll either see a ton of buying up volume to flush out the puts or we will see tons of selling to try to push the market down to whatever this bullshit evaluation and slower growth bullshit is about.\n\n  \n\n\nSo that's why the longer dated straddle would be good here and then day trade weekly or 0 day expiration puts.\n\n  \n\n\n  \n\n\n  \n\n\n  \n", "score": 10, "replies": [{"body": "Volatility isn't going anywhere until we get some of this uncertainty out of the macro environment", "score": 2, "replies": [{"body": "[Uncertainty is the new norm](https://media.giphy.com/media/7yTqXVALy7Fwk/giphy.gif)", "score": 3, "replies": [{"body": "Funny enough because of the constant bullishness of the market over the past half century, it would turn financial investing/trading on its ass if we had a true uncertain market. ", "score": 1, "replies": []}]}]}]}, {"body": "> **Carlos Ghosn** was rearrested amid suspicion that he shifted $16 million in personal losses to **Nissan** \n\nWell, I don't feel so bad about my 30K in losses now.", "score": 2, "replies": []}, {"body": "It's looking like a 5 year hold for me, nice! \n\nSnap short is up 50% today though, god damn. ", "score": 1, "replies": []}, {"body": "TLDR: We're all fucked.", "score": 1, "replies": []}, {"body": "[WSJ](https://www.wsj.com/articles/america-is-competitive-again-11545350620)", "score": 0, "replies": []}]}
{"title": "AAPL and FB must be buying back at record levels right now", "selftext": "Free Cash flow monsters cannibalizing themselves\n\nJust HOLD and watch Your ownership % rise lol\n\nFor long term Buffett style holders this isn't all that bad.... The Pizza gets smaller and smaller", "id": "a8bnq5", "created_utc": 1545409938.0, "score": 34, "upvote_ratio": 0.92, "num_comments": 11, "comments": [{"body": "With Apple yes with Facebook their cash flow is going to face headwinds in 2019. Long both but much more on Apple.", "score": 21, "replies": [{"body": "FB is much more profitable thank AAPL. Even if their net margin shrinks to 35%, their business requires very little capex", "score": 12, "replies": [{"body": "FB also has borderline nightmare corporate governance. If only that was better it would be the best stock in the market", "score": 14, "replies": [{"body": "Yeah but people forget that FB owns Instagram, Oculus and WhatsApp.  It sells of solely based on the Facebook platform, yet their growth vectors are expanding.", "score": 7, "replies": [{"body": "Id like just one day without bad FB news.  Just one.  ", "score": 3, "replies": [{"body": "Well that's just crazy. They leaked you cat pic likes and date of birth....this is news", "score": 3, "replies": []}]}]}]}, {"body": "See the only issue I have with your statement is simply stating a percentage like 35% is deceiving, FB makes ~35% Net Margins on yearly Revenue of about $55B of 2018 estimates, given Q4 is relatively inline with the rest of the years. Apple makes ~22.5% Net Margins on ~265B yearly revenue. Which company is vastly more profitable now? Apple as they make what FB does yearly in less than half a year.", "score": 13, "replies": [{"body": "Their market cap is also much greater than Facebook's", "score": 9, "replies": [{"body": "2x", "score": 2, "replies": []}]}, {"body": "I should have been more clear, I was talking about cash generation. Apple's lower margin on higher revenue then goes through higher capex and a dividend payout. The amount of free cash available for buybacks as a percentage of revenue, after everything is deducted is much lower than Facebook. Still a great cash yield but FB and other software companies are on another level.", "score": 4, "replies": [{"body": "True, I don’t disagree Apple pays a hefty dividend to the tune of like a 1.9% yield (.73 a share) and FB does not pay any dividend. Hiwever Fb does have a lot of Capex though these days. Apple boosted their Capex to 17B for 2018 in what has yet to be really disclosed on what up from 14B however FB does also have a significant amount of Capex increase this year up to ~14B from 6.7 in 2017 so it seems like both companies are spending significant amounts of money this year. In the end I don’t see any reason why at these prices you wouldn’t want either company. Apple is a cash machine and FB is as well and is just going through maturity pains but there is not really any threat to either business barring their users literally boycott them which lets be honest people are addicted to FB and Apple at this point. ", "score": 2, "replies": []}]}]}]}]}]}
{"title": "Short Boeing, long Dunlop!", "selftext": "[deleted]", "id": "a8c2el", "created_utc": 1545412343.0, "score": 15, "upvote_ratio": 0.86, "num_comments": 12, "comments": [{"body": "He’s fucking lost it. He knows that a wall didn’t work for China few thousand years ago right? He knows that the cartels are running drugs and humans through tunnels right?", "score": 18, "replies": [{"body": "It didn't work against the huns, but there were no Mexicans or Venezuelans in China for centuries after the wall was built!", "score": 14, "replies": [{"body": "It worked pretty well against the Huns, did not work against the Manchu. ", "score": 2, "replies": []}, {"body": "r/technicallythetruth", "score": 1, "replies": []}]}, {"body": "Cartels: using drones, catapults, tunnels, submarines, airplanes, birds, even just fuckin tossing drugs across the border\n\nImmigrants: legally crossing with seasonal visas then staying because businesses keep paying them\n\nTrump: BUILD A WALL I KNOW TECHNOLOGY", "score": 4, "replies": []}]}, {"body": "ol donnie's off his rocker ", "score": 9, "replies": []}, {"body": "Tech AND technology? Shit boi", "score": 7, "replies": []}, {"body": "Can I short this presidency?", "score": 6, "replies": []}, {"body": "Why short BA?", "score": 2, "replies": [{"body": "*whoooosh* above the head.", "score": 6, "replies": [{"body": "r/whoooosh ", "score": 2, "replies": []}]}]}, {"body": "This post was flaired as DD so it's on the DD list. [Click Here to read fresh WSB DD.](https://new.reddit.com/r/wallstreetbets/search?sort=new&restrict_sr=on&q=flair%3ADD).\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "a8dkkd", "created_utc": 1545421115.0, "score": 6, "upvote_ratio": 0.72, "num_comments": 10, "comments": [{"body": "P/E of 12, and a 2% dividend. It's a buy for me for a recession.", "score": 12, "replies": [{"body": "Honestly, same. The post isn’t a bear case against Apple but it is a hold your horses case. We’re in uncharted territory so I’m going to wait before picking some juicy Apple calls (currently no catalyst justifying it imo) ", "score": 6, "replies": []}, {"body": "Also largest cash hoard in the world. Apple could buy most companies without margin", "score": 3, "replies": []}]}, {"body": "agreed.  and while we're at it fuck Nintendo. I've had 2 switches and both of them the screen has been becoming unglued in a corner so you can press it down. They fixed one , but shit. not too mention the unit itself looks bent , and has bulges in wierd areas. ", "score": 4, "replies": [{"body": "Report it and send it to them and demand a new one, not just to fix yours", "score": 2, "replies": []}]}, {"body": "I just came here to laugh at Apple sheep who buy shit bent iPads and shit phones and tell them I was right about the sell off... again 🤣\n\nOP is spot on BTW 👏", "score": 2, "replies": []}, {"body": "Until they buy a company with IP with said cash reserves, APPL has nothing for me. Leadership is a joke and technology and products are stale.", "score": 4, "replies": []}, {"body": ">The new iPad which from specs is a beast but is being shipped out bent due to manufacturing..  \n\n*Made in China*.", "score": 1, "replies": []}, {"body": ">This is the one that’s shook me the most *Bent Ipads*\n\nDid you miss the whole bendable iPhone fiasco like a year or two ago?", "score": 0, "replies": [{"body": "These are coming pre bent from factory. Right out of the box ", "score": 5, "replies": []}]}]}
{"title": "+$250,000 Amazon scalper update... stuck in some calls right now", "selftext": "&#x200B;\n\n[Bull run coming](https://preview.redd.it/xtcrrle12p521.png?width=543&format=png&auto=webp&s=4e2cb4aa1d64f685227d4b9283eb8cbfd45c57fe)", "id": "a8e9qh", "created_utc": 1545425550.0, "score": 23, "upvote_ratio": 0.93, "num_comments": 12, "comments": [{"body": "well ive been sharing my trades with some random reddit people i dont even know and made their Christmas' lol.", "score": 15, "replies": [{"body": "It seems like you know what you're talking about. I'm a bit skeptical on the up side but I bought some TQQQ shares just in case you are right again lol", "score": 3, "replies": [{"body": "i wouldn't go heavy... i was hoping for a short covering into end of day.  will get out quickly with the market volatility skewed heavily pessimistic.", "score": 5, "replies": []}, {"body": "Let’s get it ", "score": 1, "replies": [{"body": "Uuummmm? Futures are getting crushed", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 9, "replies": []}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Click here to find more YOLOs](https://new.reddit.com/r/wallstreetbets/search?sort=new&restrict_sr=on&q=flair%3AYOLO). \n\nYOLO flair is for dank trades only. If you misused the flair please change it. Mods have been notified of this thread.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 4, "replies": []}, {"body": "Has every play you made worked out in your favor?", "score": 1, "replies": [{"body": "no one bats 100% dude.  but if you risk weight your decisions and do stops and such yes.", "score": 9, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "no i was short ", "score": 2, "replies": []}]}, {"body": "Sold and flipped to puts", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Did you go calls?", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Thanks bro.  ", "score": 1, "replies": []}]}]}]}]}
{"title": "Dow dives 400 points to end its worst week in 10 years", "selftext": "", "id": "a8fgen", "created_utc": 1545433647.0, "score": 50, "upvote_ratio": 0.96, "num_comments": 10, "comments": [{"body": "Very cool, trump ", "score": 43, "replies": [{"body": "[deleted]", "score": -16, "replies": [{"body": "> Educate yourself please ..\n\nIf you don't think that Trumps reactionary narcissism is affecting the market crash, then you need to educate yourself.  That is a completely ignorant comment. \n\n", "score": 6, "replies": []}]}]}, {"body": "Time for a rebound!", "score": 7, "replies": [{"body": "In a couple years.", "score": 6, "replies": []}]}, {"body": "Oversold?", "score": 4, "replies": [{"body": "How much did they say that during crashes of 2008 and before etc?", "score": 6, "replies": [{"body": "I'm betting 🐻 with 25% of my portfolio into we are a few weeks into a nuts uptick then I'll just start betting the other way. No idea what to do when it coasts on the bottoms...ICs?", "score": 1, "replies": [{"body": "I'd say straddle at the bottom that way when it swings up you close, and swings back down harder, you close the other side.", "score": 1, "replies": []}]}]}, {"body": "I’m counting on it", "score": 2, "replies": []}]}, {"body": "You’re all caught up!", "score": 3, "replies": []}]}
