{"title": "Meta has been fined $402 million by the Irish Data Protection Commission for its handling of children’s privacy settings on Instagram", "selftext": "A fat fine — of $402 million — is headed Instagram’s way after European Union privacy regulators came to a decision on a long running complaint related to how the social media platform handles children’s data. The penalty is for a breach of the EU’s General Data Protection Regulation (GDPR).\n\nMeta was contacted for comment on the penalty.\n\nWe understand the final GDPR decision on the Instagram enquiry was sent to Meta, Instagram’s parent, Friday — ahead of formal publication on the websites of the company’s lead data supervisor in the EU, Ireland’s Data Protection Commission (DPC); and the European Data Protection Board (EDPB), a steering body which helped coordinate a decision review process involving other interested EU data protection authorities — however the size of the penalty for Meta appears to have leaked early, via a report in Politico, which contains the fine figure (which shakes out to around $403M at current currency exchange prices) but no further details of the decision.\n\nIreland’s DPC confirmed the level of fine to us. Deputy commissioner, Graham Doyle, told TechCrunch: “We adopted our final decision last Friday and it does contain a fine of €405 million. Full details of the decision will publish next week.”\n\nThe Instagram penalty is the largest GDPR penalty the social media giant has been hit with to-date (though not the largest ever GDPR fine; that one landed on Amazon) — following a $267M penalty levied upon the Meta-owned messaging platform WhatsApp last September for violations of the GDPR’s transparency principle.\n\nThe Instagram complaint focused on the platform’s processing of children’s data for business accounts and on a user registration system it operated which the DPC found could lead to the accounts of child users being set to “public” by default, unless the user changed the account settings to set it to “private”.\n\nThe GDPR contains strong measures requiring privacy by design and default generally — as well provisions aimed at enhancing the protection of children’s information specifically, as well as ensuring that services targeting kids are living up to transparency and accountability principles (such as by providing suitably clear communications that children can understand).\n\nThe reasoning underpinning the fine for Instagram is expected to be released in the coming days, when the final decision gets published next week (assuming it doesn’t leak early).\n\nWhile today’s headlines are going to make painful reading for Meta, TikTok is another social media firm likely to be watching developments closely since it’s under investigation by the DPC over its own handling of children’s data. But that enquiry was only opened by the DPC a year ago so it’s likely to have some time to run before a decision is reached.\n\nThe Instagram decision took extra time as other DPAs raised objections to Ireland’s draft decision — triggering a mechanism in the regulation designed to settle disputes which can add many more months to the timeframe.\n\nIreland’s WhatsApp decision also went through a review process after objections were raised to its draft — and in that case the size of the penalty was substantially raised as a result. But it remains to be seen whether the same has happened here, with Instagram.\n\nSource: [https://techcrunch.com/2022/09/05/instagram-gdpr-fine-childrens-privacy/](https://techcrunch.com/2022/09/05/instagram-gdpr-fine-childrens-privacy/)", "id": "x6lz8a", "created_utc": 1662398937.0, "score": 1189, "upvote_ratio": 0.98, "num_comments": 59, "comments": [{"body": "Haha! Serves them right!", "score": 60, "replies": [{"body": "I hate the company formally known as Facebook.\n\nEdit: see proper spelling below", "score": 15, "replies": [{"body": "Formerly*", "score": 8, "replies": [{"body": "Thank you", "score": 1, "replies": []}]}]}, {"body": "Now I wanna see how Telegram or TikTok handles such investigation.", "score": 2, "replies": []}, {"body": "Haha they should instead come to Reddit totally not the same thing", "score": -2, "replies": []}]}, {"body": "Gross profits via Yahoo Finance:\n\n2021 95b\n\n2020 69b\n\n2019 57b\n\n2018 46b\n\nThese may be US-only, but help paint the picture that the EU takes their fines seriously.\n\nA question: Can a business buy *insurance* for these types of fines?\n\nedit: below posters are correct, it is billions not millions.", "score": 39, "replies": [{"body": "They buy \"insurance\" by funding politicians' campaigns as private donors or through PAC's to ensure that nobody tries to legislate or investigate them on a federal level. At least, here in the USA.", "score": 29, "replies": []}, {"body": "[removed]", "score": 13, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "[removed]", "score": 15, "replies": [{"body": "Psychology is so weird... I have no idea how we can buy this massive stream of cash flow so cheaply. God bless horrific sentiment. Otherwise these opportunities wouldn't exist.\n\nIn 2008 Apple was dead. In 2010 Microsoft was dead. In 2020 oil was dead. In 2021 Alibaba became uninvestable. Now Facebook is clearly going to die. \n\nLOL ok whatever you say Mr Market. Even if half of those sentiments are true, the other half will see you recover those losses and still crush the market.", "score": 10, "replies": [{"body": "It’s a dying company that at the same time needs to be stopped from taking over the world 🤷‍♂️", "score": 5, "replies": []}]}]}]}]}, {"body": "Source? Others are saying this data is hugely wrong and should be Billions with a B", "score": 4, "replies": [{"body": "You are right, it's billions.", "score": 2, "replies": []}]}, {"body": "The fine is 0.41% of their latest gross profits, or 6.06% of their net income from 2021. I don’t think that’s being taken seriously.", "score": 6, "replies": []}, {"body": "[deleted]", "score": 3, "replies": []}, {"body": ">A question: Can a business buy insurance for these types of fines?\n\nYes, it works! How?\n\nBanks do this by themselves, let's see:\n\nThere are legal white deals and forbidden black deals (i.e. sanctions). Many deals however are grey deals, because a part of the deal is illegal in Dollar and the other part illegal in Euros. By splitting it appropriately you can still do it. Obviously it's better hidden with different national laws played out against each other.\n\nAround 7-14% are the estimations that grey deals are cought + sentenced with fines. That why the remaining 90% of grey deals must be profitable enough to cover the caught ones.\n\nA fine is just an extra license cost to do business if it isn't connected with jail time. **This is pretty much your insurance or hybrid costing.**\n\nA proper fine - if only measured in currency without jail time - would have to be higher than 'the profit ever made from it' multiplied by 'the probability of beeing caught'. The latter because otherwise you can beat if with statistics if you make just enough of the illegal deals to finance the fines.\n\nBONUS TRICK!\n\nHappens regularly with 'Deutsche Bank', can't remember but I think HSBC was on the same side (like illegal deals with Mexican cartels money laundry,...)\n\nAs you know that around 1 in 10 grey deals comes with fines you put the necessary money for fines aside. You also publish it as **\"accrued legal provisions\"** in your shareholder report.\n\nThen when the court fine goes public you don't have to issue a so called \"profit warning\" to shareholders BUT if the fine is lesser than the expected provisioned fine you stock price rises as there is now spare cash! 🎉", "score": 1, "replies": []}]}, {"body": "Isn't $402m like chump change to them? Is it a slap on the wrist or something bigger?", "score": 10, "replies": [{"body": "[deleted]", "score": 29, "replies": [{"body": "Facebook lawyers excited because they will be getting a fat paycheck now to contest this in court for years.", "score": 19, "replies": [{"body": "True", "score": 2, "replies": []}]}]}, {"body": "It’s not the maximum fine. The max a GDPR fine can go is 4% of a companies global turnover. Still $400 million is not small by any means. For Facebook though, it’s a business expense. Bullish on the stock.", "score": 2, "replies": []}, {"body": "[removed]", "score": 6, "replies": [{"body": "It’s 6% of their profit for the year. That’s kinda big. \n\nFines should be a % of revenue. One flat rate for all is the most equal thing.", "score": 4, "replies": []}, {"body": "Not a drop in the bucket, but also not enough that it actually hurts. Pretty much just operational costs.", "score": 1, "replies": []}]}]}, {"body": "I think other comments are right in that it’s chump change, in fact I see final figures of these to be closure of sorts. I get more worried over new lawsuits than these", "score": 3, "replies": []}, {"body": "Zuckerberg has that much cash in-between his couch cushions.", "score": 2, "replies": []}, {"body": "That’s it he own billions", "score": 2, "replies": []}, {"body": "Farmer snot for Zuch", "score": 2, "replies": []}, {"body": "Wat u expect. When they make a kids only Instagram. Ppl predicted this was gonna happen", "score": 2, "replies": []}, {"body": "Yeessssss 👍👍👍👍👍👍👍", "score": 6, "replies": []}, {"body": "Half a days pay fine for you naughty boy", "score": 2, "replies": []}, {"body": "Zuckerberg spent more than that on ballot box stuffing. This won't hurt them but it's a start.", "score": 2, "replies": [{"body": "“Ballot box stuffing” \n\nRight, I forgot, cause encouraging the general population to vote is somehow controversial in right wing America. \n\nIt’s like trying to ban Lebron from dunking on you in the playoffs", "score": 4, "replies": [{"body": "He plead guilty to paying 419 mill to mules you idiot", "score": -6, "replies": [{"body": "No he didn’t. And the only idiots here are the ones who can’t use Google to tell fact from fiction.", "score": 6, "replies": [{"body": "TIL I'm an idiot", "score": 1, "replies": []}]}]}]}]}, {"body": "Wonder how these EU places are going to get free money when they run out of ways to milk American big tech.", "score": -7, "replies": [{"body": "These eu places? More like just the EU", "score": 4, "replies": []}, {"body": "Just respect EU regulations and you wouldn’t be fined.\n\nAmericans 🍔", "score": 6, "replies": []}]}, {"body": "A literal drop in the bucket", "score": 0, "replies": [{"body": "Yep still probably worth it for them lol. We’re so afraid to issue actual consequences in this world, hence no ones plays by the rules. It wouldn’t be the end of the world to cripple meta for actual crimes. Fuckem", "score": 1, "replies": []}]}, {"body": "Good. One of the reasons why I love living in Europe.", "score": 0, "replies": []}, {"body": "It’s a start. Let’s see more of this!", "score": 0, "replies": []}, {"body": "These fines need to be in the billions for it to actually deter behavior", "score": -1, "replies": []}, {"body": "Fuck Zuckeborg", "score": -2, "replies": []}, {"body": "Ah fck meta", "score": -2, "replies": []}, {"body": "Fuck Meta. Should've been Billion not Million", "score": -2, "replies": []}, {"body": "Silicon Valley vibes lmao.", "score": 1, "replies": []}, {"body": "As well they should be!", "score": 1, "replies": []}, {"body": "Meta is garbage", "score": 1, "replies": []}, {"body": "Finally a source. Kind of a big deal to find one around here 🤣", "score": 1, "replies": []}, {"body": "This is nothing.", "score": 1, "replies": []}, {"body": "OMG 😸, what is going on here?. I think others should take the same steps", "score": 1, "replies": []}, {"body": "I'm new on this platform", "score": 1, "replies": []}, {"body": "At this point, I value META with an additional $20B earmarked for lawsuits and fines.", "score": 1, "replies": []}]}
{"title": "Jeremy Grantham says the stock market superbubble is on the verge of bursting — and an epic finale is approaching", "selftext": "One veteran investor has a bleak market outlook, and expects a brutal sell-off ahead. Below, I break down why legendary investor Jeremy Grantham says recent rebounds in stocks have merely been a bear-market rally and the market could crash more than 50%.\n\n**1. The \"superbubble\" in stocks is entering its final stages,** according to Jeremy Grantham, who made a name for himself predicting a number of bubbles would burst ahead of huge crashes, including the dot-com crash and the 2008 crash.\n\n\"Prepare for an epic finale,\" Grantham said in a note to clients Wednesday, adding that the recent rebound in stocks marked a false dawn. \"If history repeats, the play will once again be a Tragedy.\"\n\nGrantham forecasted a brutal selloff in which assets ranging from stocks to properties plunge in value.\n\nHe rang a similar bell back in January, when he warned that a superbubble was about to implode and that stocks could crater 50%.\n\nAt one point in June, the S&P 500 traded 20% below its January peak, though they have since recovered some of those losses.\n\nBut even more so now than before, Grantham sees an unprecedented mix of dangerous elements among the housing market, inflation, geopolitics, and energy.\n\n\"Between COVID in China, war in Europe, food and energy crises, record fiscal tightening, and more, the outlook is far grimmer than could have been foreseen in January,\" he said.\n\nWhile Bank of America isn't as gloom-and-doom as Grantham, the bank's analysts reiterated a downbeat outlook of a 9% drop in the S&P 500 by year-end, reiterating their view that the summer of gains since June was nothing more than a bear market rally.\n\n\"There are still no real signs of a bull market,\" BofA strategists wrote Thursday, also noting that indexes haven't seen the full impact of the Fed's monetary policy moves.\n\n**2. US stocks futures rise early Friday, as global bonds fell into their first bear market in more than 30 years**. Meanwhile, European stocks were also up, as data signals Russia will resume gas flows via the Nord Stream 1 pipeline as planned. Here are the latest market moves.\n\n**3. On the docket:** Global Blue Group Holding AG, Ross Group PLC, and more reporting.\n\n**4. These small-cap stocks are trading cheap and offer huge upside**, according to Morningstar analysts. Here are seven under-the-radar names that belong to a select group that has crushed the broader market this year. Get the full list.\n\nRead the full article: [https://www.businessinsider.com/jeremy-grantham-warning-stocks-superbubble-is-about-to-pop-in-an-epic-finale-2022-9](https://www.businessinsider.com/jeremy-grantham-warning-stocks-superbubble-is-about-to-pop-in-an-epic-finale-2022-9)\n\nThe super bubble in stocks has yet to burst according to Billionaire investor Jeremy Grantham. He dismissed the recent rebound in stocks as a brief reprieve, noting that previous superbubbles have always been followed by market declines of at least 50%.\n\nDo you agree?", "id": "x6hlts", "created_utc": 1662388241.0, "score": 87, "upvote_ratio": 0.8, "num_comments": 61, "comments": [{"body": "\n**User Report**| | |[DGEN\\FRENDS](https://twitter.com/dgenfrends)|\n:--|:--|:--|:--\n**Total Submissions**|226|**First Seen In WSB**|4 months ago\n**Total Comments**|88|**Previous DD**|\n**Account Age**|4 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=x6hlts)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=x6hlts)", "score": 1, "replies": []}, {"body": "If you say it often enough, eventually you'll be right", "score": 18, "replies": [{"body": "Repost the same article every 6 months. It’ll hit eventually", "score": 7, "replies": []}]}, {"body": "Bear says bear things", "score": 16, "replies": [{"body": "RemindMe! 60 day \"Something something bear going bear and stonks go up\"", "score": 3, "replies": [{"body": "I will be messaging you in 2 months on [**2022-11-04 16:43:39 UTC**](http://www.wolframalpha.com/input/?i=2022-11-04%2016:43:39%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/x6hlts/jeremy_grantham_says_the_stock_market_superbubble/in7b8vp/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fx6hlts%2Fjeremy_grantham_says_the_stock_market_superbubble%2Fin7b8vp%2F%5D%0A%0ARemindMe%21%202022-11-04%2016%3A43%3A39%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20x6hlts)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}]}]}, {"body": "Various Fuckers have been saying this for the last 6 years", "score": 14, "replies": [{"body": "He has predicted the last 50 out of 4 crashes", "score": 12, "replies": []}]}, {"body": "He can say it once and it’ll be noted so if he’s right he can ring his own bell.  When he says it weekly he is trying to do his part to influence the market in the direction of his puts.  Why do old rich guys not retire and travel?  Can’t take the money with you when you kick the bucket.", "score": 9, "replies": []}, {"body": "They've been saying that since 2012.\n\nI'm not saying he's wrong(his past predictions were mostly right), but take this with a grain of salt.\n\nLast Spring they (MSM) kept sayin \"sell everything before August a major event is coming\".\n\nWhere is this major event? Where is the crash?\n\nI might be wrong, but the usual \"self fulfilling prophecy\" seems to be less and less valid regarding the stock market.", "score": 7, "replies": []}, {"body": "Omg I guess tomorrow I'll sell all of my stonks . Thank you Jeremy Grantham you are a hero.\nOnce a 🌈 🐻 always a 🌈 🐻", "score": 5, "replies": []}, {"body": "So I can finally buy at the bottom yes?", "score": 5, "replies": []}, {"body": "Ah yes, this guy peddling doomsday prophecies on Business Insider yet again. Maybe after 200 wrong predictions he figures he’ll be right at some point?", "score": 4, "replies": [{"body": "Even a broke clock is right twice per day", "score": 2, "replies": []}]}, {"body": "Yes, I agree but that massive bear market rally that came back to the 50% retracement really gave me pause.  But just like the housing bubble, just because something has never happened before, doesn't mean that it won't happen now.  The macro picture seems to point towards this though.", "score": 4, "replies": []}, {"body": "He’s just a super 🌈🐻.  Did he predict the bull market of 2009-2021?  Nah.", "score": 8, "replies": []}, {"body": "All these comments 🤦‍♂️ “he predicted xx of the last x of the last crashes” is my personal favourite /s. \nIt’s literally happening right now. \nHow is there so much denial rather than figuring out which plays are best? \nA lot of people make a lot of money in a bear market, nevermind in a recession. Whales just killed it on the way up, they are doing the same on the way down.", "score": 8, "replies": [{"body": "If the whales were so good why do many under perform buy and holding S&P 500 ETFs over a long period. \n\nhttps://ofdollarsanddata.com/even-god-couldnt-beat-dollar-cost-averaging/", "score": 2, "replies": [{"body": "I’m not saying that buying and holding is a bad strategy, historically it has a track record of working. If you think the most successful hedge funds in the world are following the strategies in the link you’ve shared, which was an interesting read btw, you’d be mistaken. The S&P looks no where near what it did 40 years ago for holdings. \n\nAgain buying and holding is historically a good strategy that likely will continue to be, over a great meany of years, gme or puts on anything is probably more current. \n\nWe are on WSB however where the name of the game is calls and puts.", "score": 1, "replies": []}]}]}, {"body": "There’s always downhill and uphill. I doubt we all go to zero and survival is based on hunting and gardening.", "score": 3, "replies": []}, {"body": "Oh Jesus again?  He’s been wrong for decades.  He doesn’t understand that if his predictions came true private equity would come in and start taking everything private.", "score": 11, "replies": []}, {"body": "Hmm based on the comments here I think many people are going to start learning the difference from the value on a balance sheet versus real liquidity. \n\nEventually the house calls all the chips back and then we find out who really has any. Never fun but part of market cycles. \n\nI don't know when or how large the next crash will be, and some of these bears cry crash every month.\n\nBut what I do know, is we effectively have an entire generation of traders who have never really seen a sustained market pullback or QT. That generation also happens to overlap with a likely demographic on here. Whether or not this is the mother of all crashes or not; I do think many many of the younger traders in their 20s-30s are about to see a completely different side of the market.", "score": 6, "replies": [{"body": "As a young trader myself I will say that while trading this market hasn’t been fun, it’s been a great learning experience.", "score": 4, "replies": [{"body": "Don't worry, it's a learning experience for the pro's too.", "score": 2, "replies": []}]}]}, {"body": "Someone told me Jimothy is the bastard child of Jeremy Cramer", "score": 3, "replies": []}, {"body": "He knows nothing about future! If it happens it happens just because it does but not because he knows!! These so called analysts are bollywood movies police! They only analyse after it has happened!", "score": 8, "replies": []}, {"body": "Not sure what he means by superbubble in stocks. Currently the Spy is down to same level as One and a half years ago (Feb 2021).", "score": 4, "replies": [{"body": "U can make an argument that it should be closer to pre covid levels.", "score": 3, "replies": [{"body": "Since then we’ve seen like what 20% inflation. So we’re already at or below inflation adjusted pre covid levels.", "score": 1, "replies": [{"body": "Good point, but is the state of our economy better or worse than before covid?", "score": 2, "replies": []}]}]}, {"body": "I’ve seen price targets of everything from 360 to 240 for SPY by mid-next year", "score": 1, "replies": []}]}, {"body": "I wonder if he’s biased by wanting to see his thesis play out in his lifetime. He makes very good points, but timing may be off. He’s been saying this for ages, and we’ve seen new ath’s followed by plunges lower than previous lows. Post gfc market almost has a megaphone📢 pattern. \n\nHe could be right. But markets are not reality. I have seen it argued that quality of life for most folks has not improved since gfc at the rates the markets would suggest, with that line of thinking meaning real world decline can happen at the same time as “number go up”. \n\nVolatility is also unhealthy, rapid shifts, spikes in inflation, swift declines in asset prices, etc can wreck economies and lives and , and it can be prolonged by chart painting. Extreme inequality might be the result of this bubble pop.", "score": 2, "replies": []}, {"body": "So what’s the best way to make money off a market crash? Chaos is a ladder but I’m uninitiated.", "score": 2, "replies": [{"body": "UVXY calls through December", "score": 3, "replies": []}]}, {"body": "Everything could change tomorrow. Be easy bro.", "score": 2, "replies": []}, {"body": "Yeah well if you predict a spectacular crash for almost 40 years it’s bound to happen eventually. But lol no this guy is just awful at predicting anything", "score": 5, "replies": [{"body": "Yep. Just like everyone quoting Burry now. He’s been predicting hyperinflation for over 2 years. I mean, he’s definitely a smart guy but just because you times it right the first time, doesn’t mean you’re ALWAYS gonna be right.", "score": 1, "replies": []}]}, {"body": "Guys timing is difficult. \n\nI see wsb currently filled with these type of negative posts. \n\nJust don’t go and buy puts. \n\nMaybe some short etf or margin based cfd but i would suggest not to buy puts.", "score": 3, "replies": [{"body": "long term puts/shorts are a thing", "score": 4, "replies": [{"body": "Ok.", "score": -3, "replies": []}]}, {"body": "Mods ban", "score": -7, "replies": []}]}, {"body": "Who knows, maybe this time he will finally be right - or not - a large market decline will happen eventually.", "score": 2, "replies": [{"body": "If you keep betting green on roulette,  you'll be right eventually. C:", "score": 5, "replies": [{"body": "If it's a 0 and 00 wheel, he just doubled his odds.", "score": 3, "replies": [{"body": "If you bet double the amount of times, you'll also double your odds!", "score": 2, "replies": [{"body": "If you bet your clients’ money, you don’t lose any of your own.\n\nEdit: just look at Cathie.", "score": 2, "replies": []}]}]}]}]}, {"body": "If this guy has positions that will benefit from a crash then I don’t have any belief in what he says other than maybe a downturn some time soon.\n\nPeople who predict a trend they need so their own investments will thrive have no credible message.\n\nLike: predicting crashes month after month after month, or: predicting the moon when something like $BBBY comes along because when the stock goes up your calls will print.\n\nLet me read stories like that by people who have a history of correct predictions without an actual vested interest and I’ll be far more inclined to believe them.\n\nIn this case you have to look at stock quotes from previous darlings: they’re down 60% to 90% off their high. \n\nAfter Jerome’s last 10 minute chat the market lost $1.6T in value. I’m not sure where that super bubble is anymore, I haven’t seen it in a while.\n\n/stock can always go down more. Any stock that went down 90% can go down another 90% and then another 90% from that last position. The lowest it can go is 0 and some stock \\*cough\\* crypto \\*cough\\* is clearly not worth the hard drive it’s stored on, but actual companies having actual assets, producing actual goods/services, generating actual revenue, those are always going to be worth something. The day everything goes to 0 is the day the actual economy collapses as a whole. I’m going to say I believe there’s still pain coming, I don’t see the End Of Times.\n\nIt’ll work out.", "score": 2, "replies": [{"body": "GMO is primarily a long-only shop with a focus on institutional assets (pension funds, etc.), with about 120 billion in AUM, most of their funds are actively managed, but they are not traders or a quant shop.  He’s been bearish for a while, but I don’t think they have active short bets, but may be preaching lower equity allocations.", "score": 3, "replies": [{"body": "So, it’s all downhill from here.\n\nThere was a pivotal moment where there was a potential for my life to take a turn for the better, actual economic freedom.\n\nIt did not pan out and now that’s never going to happen. \n\nI hate everything about my life. There is nothing good in it.", "score": 1, "replies": [{"body": "Sorry to hear that - and he is not necessarily, correct.  I was just point out that he is not shorting for a quick win.  Personally, I favor Mike Wilson's (Morgan Stanly) viewpoint, which is another leg down to 3400 then stabilize, if we avoid recession.  If we hit a recession, he believes 3000 is likely.  If you are holding quality stocks, just sit on them and you will eventually come out on top.", "score": 3, "replies": [{"body": "I appreciate your perspective. I hope we can find some semblance of normality in this madhouse.\n\nBe well.", "score": 1, "replies": []}]}]}]}]}, {"body": "While I do agree with some of these doomsday predictions.. I honestly don’t think it will last as long as the 08 recession cycle. Mainly because so many retail investors are just dumping money in to the market. We’re basically helping to hold the market up. Whether it be the people waiting for MOASS, squeeze plays, or long term investments. \nI know some have most of their money in 1 or 2 stonks. But still, making a popcorn stock have over a billion on market cap is a bit insane. \n\nI know I have more money in the market than I ever had in the last few years. \n\nBy looking at the popularity of stock related subreddits, a LOT of folks are gambling at the big boy casino nowadays. Especially with ridiculously low interest rates on savings accounts. It’s better to hold funds or bonds. Even if it gives you a 4% monthly return, it’s still better than any savings account. Just had a little risk to it. \n\nEither way, I’m trying to stay fairly diversified. Bonds, funds, squeeze plays and a few meme stonks. Along with a decent amount of blue chips. \n\nThat’s just me though. Now, if the dollar tanks, we’re gonna have a bad time.", "score": 2, "replies": [{"body": "You have it the other way around. 1/ if the dollar were to tank you good, since you almost don’t own any, you own stocks, etc.\n\n2/ by throwing your money at the market you help the price stay up. The moment you stop throwing money, the price is not supported by anything anymore", "score": 1, "replies": []}]}, {"body": "Do it do it do it do it.", "score": 1, "replies": []}, {"body": "Not complicated, democrats have president, house, and senate.   They also are going hard-core on economic proposals written by the severely math skills challenged.  No way to avoid it realistically.", "score": -13, "replies": [{"body": "Yes, having a Democratic president is [always such a disaster for the stock market](https://blogs-images.forbes.com/peterlazaroff/files/2016/07/2016-07-20-President-Market-Data.jpg).", "score": 5, "replies": [{"body": "This", "score": 4, "replies": []}, {"body": "You can thank newt for the econ doing well under Bill. obama the market was flat his last two years with 0 growth.", "score": -8, "replies": []}]}]}, {"body": "He should put his money where his mouth is", "score": 1, "replies": []}]}
