{"title": "Potential for the VIX to hit 40 or more in September. Have cash ready in October.", "selftext": "", "id": "x7p5jg", "created_utc": 1662506675.0, "score": 68, "upvote_ratio": 0.73, "num_comments": 62, "comments": [{"body": "An arrow pointing up, very convincing.", "score": 163, "replies": [{"body": "Crickey ye beat me to the punch", "score": 8, "replies": []}, {"body": "And a darn good looking at that.", "score": 3, "replies": []}, {"body": "Not enough lines and arrows", "score": 2, "replies": []}]}, {"body": "Ta on vix is derp", "score": 12, "replies": [{"body": "TA is astrology for the stock market", "score": 2, "replies": [{"body": "No. People get confused about that. The derpy drawings like cup and handle are astrology. But ta incorporates things like moving averages and is very clearly important to the market.\n\nYou notice the market had a hard time with 3900 this last week? That wasn't because of PE ratios", "score": 1, "replies": []}]}]}, {"body": "How many times do we have to tell you not to use your crayons on the vix?", "score": 21, "replies": []}, {"body": "Stop with these shitty arrow-pointing posts. You won't move the market in your favor by posting these kinds of bs on a small subreddit like this.", "score": 14, "replies": [{"body": "It’s not a small subreddit :)", "score": 1, "replies": []}]}, {"body": "Why not buy puts now?", "score": 5, "replies": [{"body": "VIX could collapse 25% and your puts would get wrecked", "score": 2, "replies": []}]}, {"body": "I am looking at the VIX to goto 150...  and fiat to be worth zero...", "score": 13, "replies": [{"body": "I will only buy under those conditions", "score": 7, "replies": []}, {"body": "Are you also looking for an alien invasion of disneyland?", "score": 3, "replies": [{"body": "Just remember I told you so and we are aliens and this has been Disneyland, that's coming to a end.", "score": 5, "replies": []}]}, {"body": "Right now fiat USD is gaining in value vs every asset. When the Fed pivots, things will change.", "score": 3, "replies": [{"body": "I wouldn’t buy a fiat unless it was detailed first.", "score": 7, "replies": []}, {"body": "The Feds can make any number look any way they want it to look, don't you get it, man! Don't buy into their BS and be part of the sheep... the reality is that there are major issues with Dodd-Frank law which is going to tank all the brokers, market makers, hedge funds, and clearing firms and leave the taxpayers with the largest debt ever in world history due to naked short selling.. now compound this with the wars and energy crisis and we have the perfect trifecta... there is no historical data that fits this enigma..  Take it for what it's worth, things are fucking bad, unfixable bad... and the Government knows it... they let debt get out of control, debt that you don't even know about yet that makes all other debts look like preschoolers stealing change to buy bubblegum at the five and dime..", "score": 3, "replies": [{"body": "I wasn’t convinced until I got to “five and dime”, which somehow tied it all together into a wonderful boomer rant", "score": 13, "replies": [{"body": "Well, I wanted to weed out the wise from the unwise... glad your in the club :>>", "score": 1, "replies": []}]}, {"body": "Why would the fed intentionally destroy the market that they are responsible for the health of? Sure they fuck things up, but he problems they are dealing with are incredibly complex with endless variables that they can’t control or influence.\nThe fed isn’t Dr. Evil. Take the tinfoil off your head.", "score": 1, "replies": [{"body": "The SEC works for the banks, the banks are their puppet masters... they don't give a shit about anyone or anything else but how to protect their clients, the banks.", "score": 1, "replies": [{"body": "The SEC and the FRB (fed) are different entities with different responsibilities. Both report to congress. Congress is Dr. Evil. I’ll give you that.", "score": 1, "replies": [{"body": "Oh, I know all about the entire mix... to not get into micro details the main issue is that they have let every bank and the reserve create unlimited debt with zero oversight (regulators in their pockets)... This issue with naked short selling (though there are so many others with similar issues) and the massive amount of debt/naked shares which are borrowed and don't even exist most of the time which clearing firms lend out for fractions of the actual costs (over the float/outstanding shares) is estimated to be 50% of the global stock markets and are non-existent hypothecated shares... they let the DTCC/CEDE/CENTRAL BANKS and intermediaries take control with their own money printing firms similar to the FRB, but instead of printing FIAT its based on creating credit with stocks/bonds/commodities and now **the FEDS have lost control because it is too big to fail and the Government can't bail this big of a problem out..**", "score": 1, "replies": []}]}]}]}]}, {"body": "But at the moment it doesn’t seem to happen, and still vix is having better than usual conditions for possible growth.", "score": 1, "replies": []}]}]}, {"body": "There's a pacific ocean filled with dead portfolios by people who keep trying to predict future VIX and profit from it.", "score": 4, "replies": [{"body": "All is well shorting VIX until it ain't", "score": 1, "replies": []}]}, {"body": "Got a different view…..I think Sept CPI will confirm inflation falling, OPEX before and after will generate a rally and Fed will soften language in October pre Mid terms.", "score": 5, "replies": [{"body": "We'll see. Europe has an energy crisis now and these western central banks all work together. Even if CPI isn't rising in the USA, there is already unrest in Europe due to high energy prices. Even Kashmari the super dove has cheered the markets falling. When has this happened before a Fed pivot? Fed pivots are telegraphed bigtime in advance. Powell already pivoted in December 2018 a couple of weeks before the actual market bottom. Fed pivoted in March 2020 well before the market bottom. When the Fed pivots, they are yelling in your face to buy stocks.", "score": 3, "replies": [{"body": "I live in Europe and I can tell you the concept of a crisis is way over blown. UK are launching an energy bail out package and Europe are coordinating a similar rescue response meanwhile Gas inventory’s are filling up in advance of Winter. There is certainly a cost of living crisis across Europe and inflation has made this worse but there is also full employment and a really healthy job market and wages are rising just not at the same rate as inflation. In USA wages are also rising as inflation falls…..Labour constraints suggest this will continue to happen.", "score": 2, "replies": []}]}, {"body": "https://www.cnbc.com/2018/12/19/powell-says-fed-has-arrived-at-the-lower-end-of-neutral-rate-range.html\n\nThis was back in December 2018. Powell basically said a neutral rate had been achieved. Stocks still went down into Christmas Eve. This selloff in stocks along with an oil crash allowed the Fed to print again. The Fed wants stuff crashing down. Then their friends can buy in big.", "score": 2, "replies": [{"body": "But now a bit different story, they only seem hiking more and more. Some say it can trigger a recession in 2023. If all banks start to raise rates globally. But again it’s good for VIX.", "score": 1, "replies": [{"body": "This isn't a deflationary covid crash. This bear market is because of too much inflation. This is why all these central banks hiking at the same time is going to crash the markets like in 2008 which also had a massive commodity boom. The signs of a real market bottom will be just like the others. VIX spikes. TLT spikes. Oil crashes.", "score": 2, "replies": [{"body": "Yeah, makes sense btw", "score": 1, "replies": []}]}]}]}]}, {"body": "Puts now . Calls later. ✔️", "score": 3, "replies": []}, {"body": "Lmao", "score": 3, "replies": []}, {"body": "As long as the dollar is ripping, stocks are gonna keep going down. We're gonna have a currency crisis on our hands if trends continue.", "score": 2, "replies": [{"body": "I agree. The dollar is going to kill many assets. I think the has telegraphed its intentions very well. Honestly, until the capitulation happens, UUP the dollar etf might be the safest investment.", "score": 4, "replies": []}]}, {"body": "Off i fed up with this apocalyptic scenarios", "score": 2, "replies": [{"body": "happy cake day", "score": 1, "replies": []}]}, {"body": "Hello,\n\nI don't think the VIX is going to blow this soon. I have created a simple model (the model is simple but the research behind it is **pretty vast and complex**), which predicts when the VIX will **possibly** explode. It has aligned perfectly with the past VIX explosions and hence I believe that it still has the ability to predict the future VIX explosions.\n\nHowever, many people who have viewed it **rightly say that the sample size is too small, which I cannot deny.** But it isn't a statistical model, it is just a chart that shows what happened before a VIX explosion. And those same things have happened **ONLY** before a VIX explosion.\n\nAs per the model, there's still time for the VIX explosion. IMO about 12 months + away.\n\nFor those of you interested in the model - [https://www.youtube.com/watch?v=Bhz6jcIC3AM](https://www.youtube.com/watch?v=Bhz6jcIC3AM)\n\nI had made a presentation a few months ago about it and uploaded it on YT, you guys can have a look.\n\n**Btw, another key takeaway that I realized whilst researching on this model -** \n\n**After the VIX tops out after a major event, there is another round of downward market movement which is lower than the low when the VIX exploded but the VIX isn't higher than the top of the VIX high when the market bottomed. This point is the market bottom.**\n\n**For example - during the Covid crash, the VIX topped somewhere between 18 - 20th March 2020 and there was a bottom on the market formed. But in a few days the market moved lower, but the VIX didn't go higher than the high between 18 - 20th March, and this was the market bottom.**\n\n**Same was the case during the GFC as well as the previous times when the VIX melted up.**", "score": 2, "replies": [{"body": "I am interested. Please update when you see the VIX rallying a lot. If not now during the Sept to Oct timeframe, it would have to be during an event.", "score": 1, "replies": [{"body": "I plan to make a post when the time is near. But if people will follow or believe it is a different matter.", "score": 1, "replies": []}]}]}, {"body": "You are a day late and a dollar short. Actually, you should have bought it in January.", "score": 2, "replies": []}, {"body": "Puts on what in October?", "score": 2, "replies": [{"body": "October could be when a bottom happens.", "score": -4, "replies": [{"body": "They won’t remedy 14 years of QE in the next 60 days. Excluding the 5 & dime reference, the boomer’s not wrong", "score": 7, "replies": []}, {"body": "Yeah, no.\n\nUnless the Fed gets scared to death about the dollar destroying everything sooner than I think they will, if June was not it, history will apply here and sometime early next year will be.\n\nOh, and the long term bull is over and we might not see a new ATH for several years.", "score": 3, "replies": []}, {"body": "Bottom of…?", "score": 2, "replies": []}]}]}, {"body": "Yeah, everyone is now bearish that the market has already dropped 10% from recent high.\n\nWhere the fuck were all the bears when SPY was at 430. Time to raise some cash was then.\n\n&#x200B;\n\nBut on the positive side, if many people sell to raise cash, we will reach bottom soon :)", "score": 1, "replies": []}, {"body": "I am looking for a 40 VIX, TLT rocketing up, and oil crashing. That will be the time to buy QQQ and XLE big.", "score": -3, "replies": [{"body": "That quadruple top is not bullish trend. 4h is extended", "score": 2, "replies": []}]}, {"body": "Discounts. Cash ready to deploy.", "score": 1, "replies": []}, {"body": "Gotta counter with my own down arrow.", "score": 1, "replies": []}, {"body": "You know how hard the economy has to crash in order for that to happen? After the rally today it is very unlikely. The only thing I can think that will make it happen is the housing market has to crash like 2008.", "score": 1, "replies": [{"body": "2018 had an oil crash from October to December. VIX went to 36. TLT skyrocketed. This was with a good economy with low inflation. We are already seeing the start of an oil crash. Fed is trying to kill asset prices and commodities until inflation goes down. If oil crashes here, then stocks might be okay and not have to sell off a lot. I think we are going to see a very good buying opportunity soon. Could be just weeks.", "score": 2, "replies": [{"body": "It could just be it happened so unexpectedly and shocked the economy out of nowhere. I just don’t see how oil prices drop dramatically would send the vix to the moon, if anyone it would actually helps with inflation and make the economy more stable but who knows.", "score": 1, "replies": [{"body": "Fed is doubling its quantitative tightening on September 15th to $90 billion per month of bond selling. Back in 2018, stocks sold off and oil crashed because of this. After oil crashed, the Fed pivoted. Fed has not given any signals that they are not continuing with QT. If oil crashes like in 2018 and 2020, the Fed always pivots.", "score": 1, "replies": [{"body": "Their main goal is still inflation so pivot will pretty much go against what they been doing and telling the public last 6 months. There’s no way in hell that’s going to happen. They’re always telling the public, there’s no chance of rate cut unless inflation is at 2%.", "score": 1, "replies": [{"body": "I agree. There is no pivot unless things really go to hell fast. If you look at the speed of the decline in 2018 for stocks and oil, it was double the speed now. Things went down fast, and inflation was already low. Right now, inflation is more entrenched especially for wages. It is going to take a killer drop for the Fed to pivot. This is what I am expecting as QT $90 billion a month begins. To get back to 2% inflation would take a killer asset price drop along with an oil crash. This has happened before. So I expect the same now.", "score": 1, "replies": []}]}, {"body": "Do you really think it will crash like it crashed in 2020? When there was Covid and lockdown globally.", "score": 1, "replies": []}]}]}]}]}]}
{"title": "When inflation is transitory and spectacular", "selftext": "", "id": "x6za8p", "created_utc": 1662433377.0, "score": 225, "upvote_ratio": 0.78, "num_comments": 59, "comments": [{"body": "\n**User Report**| | |[DGEN\\FRENDS](https://twitter.com/dgenfrends)|\n:--|:--|:--|:--\n**Total Submissions**|23|**First Seen In WSB**|3 years ago\n**Total Comments**|1436|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/p77vvq/saw_this_guys_mom_loading_up_on_diet_coke_at_the/) [x](https://www.reddit.com/r/wallstreetbets/comments/p77tf0/spotted_this_guys_mom_loading_up_on_diet_coke_at/) \n**Account Age**|7 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=x6za8p)|**Vote Approve**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=x6za8p)", "score": 1, "replies": []}, {"body": "Finally, DD in terms I can finally understand. I can get behind this ![img](emote|t5_2th52|4276)", "score": 37, "replies": [{"body": "I see what you did there", "score": 6, "replies": []}]}, {"body": "Mods are asleep, enjoy before they wake up", "score": 27, "replies": []}, {"body": "DD I can get behind", "score": 21, "replies": []}, {"body": "I need more DD's please", "score": 20, "replies": []}, {"body": "Yo op My credit score is 770  not trying to flex\n\n\nEdit: this post gave me a boner that makes you gay", "score": 16, "replies": []}, {"body": "We need more DD like this", "score": 16, "replies": []}, {"body": "[deleted]", "score": 16, "replies": [{"body": "They are", "score": 8, "replies": []}, {"body": "I bet lots of “nighttime research” went into this!", "score": 2, "replies": []}]}, {"body": "Literally cannot go tits up", "score": 16, "replies": [{"body": "Doesn’t look like she can lie tits down.", "score": 14, "replies": []}]}, {"body": "I like economics now", "score": 17, "replies": []}, {"body": "Seems like I need to do more research on inflation.", "score": 16, "replies": []}, {"body": "There seems to be a stimulus in my pants", "score": 13, "replies": []}, {"body": "She’s my favorite pornstar 😍", "score": 14, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Awww shucks. Thanks 😘", "score": 3, "replies": []}]}, {"body": "Who is that?", "score": 1, "replies": [{"body": "r/AlettaOceanClub", "score": 4, "replies": [{"body": "😍🙏", "score": 1, "replies": []}, {"body": "#Aletta getting pounded", "score": 1, "replies": []}]}]}]}, {"body": "Nooowwww I understand inflation 🤔", "score": 14, "replies": []}, {"body": "Inflation ain’t bad at all!", "score": 11, "replies": []}, {"body": "i like how the obama recovery v is right in front of the cooch", "score": 10, "replies": []}, {"body": "Finally a graph that makes sense!", "score": 11, "replies": []}, {"body": "Lmaooo", "score": 10, "replies": []}, {"body": "I came on the tax cuts.", "score": 9, "replies": []}, {"body": "Stimulus seems about right", "score": 7, "replies": [{"body": "Vote for me and all women get free $10k cosmetic surgery vouchers.", "score": 1, "replies": []}]}, {"body": "Wen cbdc? Her entire body becomes Tits", "score": 7, "replies": []}, {"body": "Mmm...Obama something something", "score": 7, "replies": []}, {"body": "I think she likes me", "score": 7, "replies": []}, {"body": "Ahhhh now that’s an ocean I remember 🥸", "score": 7, "replies": []}, {"body": "They look like those weird mushrooms they found in the forest. Only a true chads knows what i mean.", "score": 16, "replies": [{"body": "I saw that shit on oddly terrifying", "score": 1, "replies": []}]}, {"body": "Now that is a good example of inflationary policy! ![img](emote|t5_2th52|4258)", "score": 10, "replies": []}, {"body": "When the inflation is transitory **AND** NSFW, you know you're gonna get fucked.", "score": 4, "replies": [{"body": "I am more than willing to get fucked by this kind of Inflation, ngl", "score": 1, "replies": []}]}, {"body": "IM NOT MAD", "score": 4, "replies": []}, {"body": "![img](emote|t5_2th52|4259)", "score": 6, "replies": []}, {"body": "Wow boob jobs make people look like shit. Like how could you think that looks good. Only thing worse is lip Botox.", "score": 18, "replies": [{"body": "TIL... Shit gets me hard.", "score": 5, "replies": []}, {"body": "Why are you gae?", "score": 5, "replies": []}, {"body": "you mean this?\n\nhttps://pbs.twimg.com/media/DxB5zN5XgAA1GWn.jpg:large", "score": 2, "replies": [{"body": "Hot dog lips! Yum.", "score": 2, "replies": []}]}]}, {"body": "Tiggle bitties", "score": 3, "replies": []}, {"body": "They're real and they're spectacular", "score": 5, "replies": [{"body": "Even her lips have got bigger.", "score": 3, "replies": []}]}, {"body": "This looks very bullish to me.", "score": 2, "replies": []}, {"body": "2nd bitch to the left 🥵🥵🥵", "score": 4, "replies": [{"body": "Think they're all the same chick", "score": 19, "replies": [{"body": "They are lmfao", "score": 3, "replies": [{"body": "Now that's progress!", "score": 2, "replies": []}]}]}]}, {"body": "Her name? Put some SAUCE in this post 😫", "score": 1, "replies": [{"body": "Aletta ocean 😂", "score": 7, "replies": []}, {"body": "Who is Megan Rain? \n\nUnknown pornstars for $420.69, Alex", "score": 4, "replies": []}]}, {"body": "This caught my attention", "score": 1, "replies": []}]}
