{"title": "AAPL will be in the IA game soon", "selftext": "Sorry for title. Obviously I mean AI\n\nApple CEO Tim Cook teased that Apple may have an artificial intelligence announcement later this year during a call with analysts after the company reported fiscal first-quarter earnings.\n\nWhile Cook’s remarks on Thursday did not include many details, they did indicate that Apple wants to compete with Microsoft, Google, Amazon, OpenAI and other technology companies working on cutting-edge AI models that can generate text and images.\n\nADVERTISEMENTSCROLL TO CONTINUE WITH CONTENT\n“As we look ahead, we will continue to invest in these and other technologies that will shape the future,” Cook said during a call with analysts. “That includes artificial intelligence where we continue to spend a tremendous amount of time and effort, and we’re excited to share the details of our ongoing work in that space later this year.”\n\nGenerative AI started drawing significant attention from technology companies and investors starting in 2022, after OpenAI released ChatGPT and image generators rapidly improved. Apple did not announce an advanced AI model last year, although the company has long invested in similar machine learning technology in its chips and software, which can, for example, identify people or pets inside photographs.\n\nApple typically announces new software in June at its annual developer’s conference, WWDC. Last year, the company announced an autocorrect feature for the iPhone keyboard based on a transformer-based language model, which shares the same underlying technology as GPT. But Apple never used the phrase “artificial intelligence” during the presentation, preferring the more academic term “machine learning.”\n\n“Let me just say that I think there’s a huge opportunity for Apple with Gen AI and AI, without getting into more details and getting out in front of myself,” Cook said.\n\nSource\nhttps://www.cnbc.com/2024/02/01/tim-cook-teases-apple-ai-announcement-later-this-year.html", "id": "1aijums", "created_utc": 1707037934.0, "score": 0, "upvote_ratio": 0.45, "num_comments": 52, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|1 year ago\n**Total Comments**|112|**Previous Best DD**|\n**Account Age**|2 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Intelligence Artificial?", "score": 51, "replies": [{"body": "Yes I mean AI, but in my language we say IA. Sorry", "score": 17, "replies": [{"body": "You could’ve used AI to write for ya", "score": 23, "replies": [{"body": "lol", "score": 5, "replies": []}]}, {"body": "How do you say Brrrrrrrrrrrrrrr in your language?", "score": 2, "replies": [{"body": "We say “I’m calling my wife boyfriend. He will call you for a randevouz soon”", "score": 3, "replies": []}]}]}, {"body": "Interficial Antilligence", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 22, "replies": [{"body": "https://youtu.be/qrO4YZeyl0I?si=aGjlPdQDXHhtdoRd", "score": 3, "replies": []}]}, {"body": "Apple is moving its HQ to Iowa!", "score": 8, "replies": [{"body": "lol 😂", "score": 3, "replies": []}]}, {"body": "Might be? Apple announced its new iOS 18 will come with an all new AI upgrade on Siri.  AI everywhere bitches.", "score": 15, "replies": [{"body": "Yeah buddy", "score": 2, "replies": []}]}, {"body": "As if 70% of my portfolio isn’t already Apple.", "score": 6, "replies": [{"body": "Nothing less than 99% is worth of 🍎", "score": 1, "replies": []}]}, {"body": "I mean ya obviously\n\nPriced in ![img](emote|t5_2th52|4260)", "score": 17, "replies": [{"body": "OP is such a guitard he cannot even spell a 2 letter word. IA.", "score": 17, "replies": [{"body": "In my language we wrote IA instead of AI. Sorry and thank you for your kind answer. Really appreciated and useful", "score": 5, "replies": []}]}, {"body": "Not priced in at all.", "score": 8, "replies": [{"body": "Agreed. Seems like an opportunity. Google too maybe but cart before the horse there.\n\nEdit: Plus that META money has to go somewhere once it crashes and spews traumatized children everywhere.", "score": 4, "replies": []}]}]}, {"body": "Look, just hurry up and have META, APPL and NVDA all hit $10k already", "score": 9, "replies": []}, {"body": "Issue is that while Apple is well positioned to onboard local LLMs with their neural engine, LLMs by nature are extremely hard to “control” and ensure the quality associated with Apple products. Either way, Apple silicon and LLMs go together very well as evidenced by their support in the open source community", "score": 3, "replies": []}, {"body": "Forget AI...Next stop....E I E I O...", "score": 5, "replies": []}, {"body": "AI is no one's game, we are all part of AI's game.", "score": 2, "replies": []}, {"body": "So French of you…", "score": 2, "replies": [{"body": "French?", "score": 1, "replies": []}]}, {"body": "Good. Saving “AI” for when we actually have a true AI.", "score": 2, "replies": []}, {"body": "AI = collect a lot of user data. \n\nApple does a lot of calls on iPhone. My adblocker showing the top 10 servers are all Apple and amount to like 90% of all calls, and I don't even use any Apple App.", "score": 2, "replies": []}, {"body": "Apple is 100% already in it. they design chips.", "score": 2, "replies": []}, {"body": "They need to start making chips and drop as many middlemen as they can", "score": 2, "replies": [{"body": "Hope soon", "score": 2, "replies": []}]}, {"body": "Gets title wrong…. I’m fucking in!", "score": 4, "replies": [{"body": "My language mistake 😂😂", "score": 2, "replies": []}]}, {"body": "How many trolls using the AI glasses on hte social networks. This shows the product is a waste. Still improvements to be made in the next years, will / could make it a boom. Not for now.", "score": 1, "replies": [{"body": "I think it will be used a lot in pro applications and apple is working / writing agreement with hospitals and private structure. (Also working on specifics apps)\nObviously entertainment purpose still need improvements.", "score": 1, "replies": []}]}, {"body": "They couldn't develop their own maps and Siri was lols.", "score": 0, "replies": [{"body": "I know you bought android. And you said something wrong", "score": 0, "replies": []}]}, {"body": "Believe it or not, priced in", "score": 1, "replies": [{"body": "Apple was 3T before AI so not priced in", "score": 2, "replies": []}]}, {"body": "im buying a little more here, and if it dips.", "score": 1, "replies": []}, {"body": "I propose a rule: any person who is unable to conjure a reasonable definition for ML/AI/ChatGPT without resorting to \"outsourced reasoning\" (including wiki) will be banned from discussing AI.", "score": -4, "replies": [{"body": "There’s just an article sharing. I propose instead of your ban proposal to buy for you some Wendy’s stocks", "score": 5, "replies": []}]}, {"body": "Already priced in", "score": 0, "replies": []}, {"body": "How will they monetize?", "score": 1, "replies": [{"body": "With Tim’s cock", "score": 1, "replies": []}]}, {"body": "Did you mean iAI?", "score": 1, "replies": [{"body": "I mean iaiaiaiiaiaiaiaiaiiaia 😂 mistake with my language. We write IA Instead of AI", "score": 0, "replies": []}]}, {"body": "They’d better get to it soon.", "score": 1, "replies": []}, {"body": "AI should be priced in for every major company. All of these companies are already using a form of AI (they have programmers) . Bunch of big fat dummies getting turned on by buzz words.", "score": 1, "replies": []}, {"body": "I fucking hope so. Siri was pretty cool on the iPhone 5, and then they did nothing to improve it, and it is currently a useless pile of shit. \n\nI kind of assumed they would have to buy some tech from another company, since inhouse development has been shit.", "score": 1, "replies": []}, {"body": "https://preview.redd.it/a1askrl66ngc1.jpeg?width=1290&format=pjpg&auto=webp&s=8df4243e81f630c4476be9a59ef87a0bf0434bc5\n\nLong time coming. I mean how hard can it be?", "score": 1, "replies": []}]}
{"title": "CVS Fundamentals & Technical analysis. There is a big divergence between the numbers that CVS is producing and the news.", "selftext": "1. Death, taxes, and pharmacies. Everyone will have to deal with pharmacies & healthcare providers as they get older.\n2. CVS revenue is stably going up 10% QoQ and YoY. Stably is the keyword here, it will be important later in my technical analysis part.\n3. Newly acquired Oakstreet & Signify healthcare businesses are growing at 44% and 21% YoY. CVS is cross-selling Oakstreet and Signify Health with 39 million members at Aetna and 90 million at the pharmacy counters.\n4. Oakstreet is greatly out-performing expectations and CVS is ramping up the opening of Oakstreet offices.\n5. The creation of Cordavis. CVS works directly with manufacturers to commercialize and produce bio-similar products that greatly lower drug costs. The bio-similar market in the U.S. is estimated to grow from $10 B in 2023 to $100 B by 2029.  Example: Cordavis biosimilar Hyrimoz is priced 80% lower than Humira\n6. Enterprise value(Market cap+debt-cash). Cash and debt mean something on the balance sheet so we need to account for it. Example: Apple stock would be at a different price now if they had $3 Trillion in cash or $3 Trillion in debt.\n7. CVS FCF(free cash flow) /EV(enterprise value) yield is 12%. I use EV value because that’s how much the business is truly worth if you bought it with net 0 Debt and cash. (If you want to be 100% technically correct add interest expense to FCF to get a slightly different ratio)\n8. Before buying a stock( partial partnership of a business), imagine that you are going to buy the whole business and go private with it, then ask yourself how many years it will take to get your money back if you bought the whole business with net 0 debt and cash. For CVS you would need $139 B in cash(EV=95+60-16). The business is generating $16.5 B yearly in FCF. 139/16.5= 8.4 So if you bought the whole business, it would take you 8.4 years to get your money back. This disregards the current 10% growth. $16.5 B FCF is the value creation of CVS, if this was your private company, you can have this cash to be paid out in dividends.\n9. I cannot stress enough that we need to account for Debt and cash on the balance sheet when valuing companies because debt leeches cash from the business. FCF will flow straight to the equity holders through dividends, stock BB, etc. if the business doesn't have to pay down debt every year, the same as if we paid off our mortgages. This is why P/E is a poor metric to use on high-debt companies as it doesn’t account for cash and debt on the balance sheet.\n10. Disregarding the stock price, for a growing, FCF-positive business, the business is worth more today than yesterday as they have more cash today than yesterday. So CVS in 2024 is worth more than CVS in 2023 because their business generated $16.5 billion of cash in 2023\n11. So what happens if after all of the analysis CVS stock price falls another 25% from here? I think this is what separates an average investor from a great investor. An average investor would see 25% red and sell based on fear. A great investor would buy more because if CVS falls 25% from here, the business would be generating 14% in value a year with 10% growth.\n12. From my experience of analyzing many businesses, the stock price will often bottom out at around 6.5% (high growth tech) to 15% FCF/EV yield, depending on the quality and growth of the underlying business.\n\nTechnical analysis. If you don’t believe in technical analysis then just focus on the fundamental part. This is my specialty, I spent more than 10 years drawing Fibonacci & trendlines until I was able to make the connection between fundamentals & technical. I’m putting many years of self-taught experience in a few sentences so it could just be gibberish for some. I’m doing this because I wish I found something like this years earlier so I didn’t waste so much of my time trying to figure it out alone.\n\n1. We all have heard of “be fearful when others are greedy and be greedy when others are fearful” but how? Technical analysis is about human psychology, and I have learned that growth trendlines & Fibonacci layering can help measure extreme fear and greed. Have you ever sold a stock simply because the stock price is falling or bought because the stock price is going up? The answer is probably yes. For my technical analysis to make sense, imagine every red bar is fear, and every green bar is greed. I found that emotions buying and selling can be measured with Fibonacci and they are better presented on the weekly candlestick bars.\n2. CVS weekly channel https://imgur.com/a/QKgIPH9.  To explain the red trendline in terms of fundamentals, it’s simply the growth trajectory of the underlying business. I notice that the more stable the business growth, the more stable the trendline.\n3. If you look at the monthly/weekly trendlines of stably growing companies like KO (https://imgur.com/a/FI6txaK) , MCD (https://imgur.com/a/PC6dhXB) , you can see their YoY growth on a trendline. You can also clearly see the growth of the US economy on the SPY monthly trend line from 2009 to 2020 (https://imgur.com/a/jbIebzJ) , until covid and the liquidity injections messed it up. The trendline for high-growing businesses will be steeper until the growth slows and the stock price will fall like a rock, breaking the trend. Slower-growing businesses will have a more gradual trendline. The trendline will break the moment the growth slows or declines.\n4. Short-term, stock price is just a perception of a business, it has nothing to do with the fundamentals. If a business is fast growing, people will want to pay more for it, and when the masses see price appreciation, they will continuously keep buying, pushing the stock higher, creating hype and extreme stock prices, and vice versa for when a stock falls. Example: for INTC, their revenue grew massively since 2000, even at their peak revenue of $79B, their stock never made a new high. (I'm seeing this in NVDA atm). This is why trendlines on stably growing business work, growth is known and we can use this to our advantage.\n5. Fibonacci retracement, you can think of this as a % discount on the stock price. There are 5 retracements that I look at 38, 50, 61, 78 and 87%. What I noticed is that the higher the quality of the business the less retracement that the stock price will retrace(around 38-50% for higher quality, growing, FCF positive businesses). For simplicity, focus on the 50% as it is the most popular.\n6. The importance of 50% retracement(50% discount). CVS revenue grew every year from 2015 and 2019, so the underlying business was doing fine but the stock retraced about 50% from $113 in 2015 to $53 in 2019 (https://imgur.com/a/EsxVV15) . There was nothing wrong with the business, it was just greed that pushed the stock price way past its true value from $30 in 2011 to $113 in 2015.\n7. Warren Buffet has unknowingly talked about the 50% Fibonacci retracement in one of his videos, saying that Berkshire has lost about 50% in value 3 times throughout his lifetime. Link: (https://www.youtube.com/watch?v=NeCAAAbbgmg&t=27s)\n8. There are many ways to use Fib retracement from different perspectives. I have used another perspective to get a price target of $87 on CVS the next 6-9 months.  It’s the 50% retracement from the top at $111 in 2022 to the bottom at $64 in 2023. (https://imgur.com/a/eHN7ZRm)\n9. Fib extension 261% . The 2 main levels that I focus on are 161% and 261%. Imagine every red bar is fear and every green bar is greed. Using CVS as an example. For the weekly red bar on August 14, 2023, I am extending the fear bar upward and I also get a $87 price target at 261%. (https://imgur.com/a/hTJWzwA)\n10. Fib ext 161%. Combining the above fib ext(261%) with another fib ext(161% this time) from the weekly red bars on Jan 8, 2024 to Jan 22, 2024. I also get $87. (https://imgur.com/a/oFfvOby)\n11. In my final screenshot, you can see that I have increased my probability of being right by investing in a 12% FCF-yielding business that has 10% growth. Combining that with 50% fib retracement, 261% + 161% fib extension, upper channel as resistance. CVS has a very high probability of reaching $87 in the next 6-9 months. (https://imgur.com/a/gjN61rk)\n12. It took me many years to truly understand the connection between fundamentals and technical analysis. If you are new to investing I doubt that you will get much from this. But if it was me, I would save this and take a look at it again a few years from now. With more experience from working in the real world ,managing your own business, failing with your own investments and doing your own technical analysis, you will have a clearer view of my presentation above.\n\nTLDR: CVS to $87 in 6-9 months.  LMK if you need more clarification on fibs.", "id": "1aivv07", "created_utc": 1707074243.0, "score": 69, "upvote_ratio": 0.8, "num_comments": 63, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|9|**First Seen In WSB**|1 year ago\n**Total Comments**|59|**Previous Best DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "this amount of words has convinced me to put all of my moneys into this!!!!!!!!!", "score": 65, "replies": [{"body": "If the DD is longer than an actual CVS receipt how can you go wrong?", "score": 63, "replies": []}, {"body": "“This” being the allegedly-upcoming Reddit IPO?\n\nHave they figured out how to get users to pay by the word?", "score": 1, "replies": []}]}, {"body": "Calls or puts, strike and expiry", "score": 16, "replies": [{"body": "This depends on your risk tolerance. The most extreme, gambly way, would be buying $87 strike, 6 months out, this could 5x -10x your money. But for me personally, im buying ATM(75 strike) leap option(350 days out)", "score": 12, "replies": [{"body": "Got it:\n\nhttps://preview.redd.it/1ikzw201vmgc1.png?width=2048&format=png&auto=webp&s=622022b3d974a1351a474629dba8bf93b8af3bd4", "score": 34, "replies": [{"body": "Buying is easy, its holding it through volatility to target of $87 is the hard part. Just make sure you are ok seeing 20-30% loss the next earning. Need to have a strong stomach for options to work on swing trades like this.", "score": 6, "replies": [{"body": "That sounds like a good entry point.", "score": 3, "replies": []}, {"body": "Just came across this post commeny.. down by 20% with 500 stocks. What would you recommend hold or sell? Their earning call was too scary to hear.", "score": 1, "replies": [{"body": "I dont think anyone expected a revision from 8.3 to 7 eps for a company this size. They are still expected to generate $10 B of fcf this year. So after this revision they are still generating 8% fcf/ev yield. If you were holding shares i would keep holding it. I dont see it going down much lower from here.", "score": 1, "replies": [{"body": "Got it.. yeah i entered when it dropped from 80 to 70.. I wasn’t expecting it to drop another 20%. Any price target for next one or two quarters?", "score": 1, "replies": []}, {"body": "Its at 55 as of today, I am thiking of buying ATM Nov call options , I think its easy money if the stock goes up.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Interesting read, tnx. My question is, how do you play this? Do you buy sept calls at 75/80 strike or what is your next move when figuring something like this out? It's 'merely' a 20% jump.", "score": 12, "replies": [{"body": "This depends on your risk tolerance. The most extreme, gambly way, would be buying $87 strike, 6 months out, this could 5x -10x your money. But for me personally, im buying ATM(75 strike) leap option(350 days out)", "score": 15, "replies": [{"body": "At 700 per contract you only break even at 82$. Which limits your upside greatly when only expecting 87$. Not trying to burn or anything, just picking your brain\n\nEdit: wouldnt it make sense to sell some 87,5 calls to lower your cost? Those go for 2.75, almost 40% of your 7.1 contract cost", "score": 7, "replies": [{"body": "My goal is to capture price appreciation the next 6 months and sell at $87. If it does the $700 will 2-3x. But let's say the price drops to $68 the next 4 months, I would lose about 50% of my option. If that happens, I would leverage up and buy further OTM leap options. Stock price for a growing business cannot fall forever like it has for the last 2 years. Eventually the fundamentals will catch up.", "score": 8, "replies": [{"body": "This reads like a gem too. Thx for the post", "score": 4, "replies": []}]}]}, {"body": "what entry are you looking for?", "score": 2, "replies": []}]}]}, {"body": "Two negatives: Amazon's healthcare business is just kicking off and having to wait for CVS to unlock the tooth paste.", "score": 11, "replies": []}, {"body": "i am no expert, and have no clue about this company, but:\n\n**Net Income Applicable to Common Shareholders**\n\n2019: **$6,634,000**\n\n2020: **$7,179,000**\n\n2021: **$7,910,000**\n\n2022: **$4,149,000**\n\nclearly they made money while corona was hitting the fan, but 2022 drop of -40% in profit is looking to me like the reason they lost value. No clue about 2023.", "score": 10, "replies": [{"body": "1Q 2023: **$2,136,000**\n\n2Q 2023: **$1,901,000**\n\n3Q 2023: **$2,261,000**\n\nNow THAT looks like a jackpot. If 4Q is solid they made like $8,000,000. That could even top their profit of the years 2020 and 2021 where they were worth far more!", "score": 11, "replies": []}]}, {"body": "I have to say you got me there until I see \" Fibonacci retracement \".", "score": 10, "replies": [{"body": "You can replace the phrase Fibonacci retracement with % discount on the stock price.", "score": 2, "replies": []}]}, {"body": "former cvs employee here. this was good read. thank you.", "score": 9, "replies": [{"body": "Were you the photo guy or the cashier?", "score": 7, "replies": [{"body": "What a hilarious response 😂😂", "score": 2, "replies": []}]}]}, {"body": "What are your positions in CVS.  You should let people know why you're peddling this shit.", "score": 15, "replies": []}, {"body": "Taking a dump in a CVS right now and this has been really informative thank you OP.\n\n\nThe toilet paper is just one dudes receipt from 2021", "score": 6, "replies": [{"body": "I can’t stop laughing!", "score": 3, "replies": []}]}, {"body": "You clearly have never worked for satan.", "score": 3, "replies": [{"body": "Don't we wish all companies treat their employees like Costco, that would be great.", "score": 3, "replies": []}]}, {"body": "I wonder how long op has worked for Walgreens.", "score": 4, "replies": []}, {"body": "posted by cvs.", "score": 4, "replies": []}, {"body": "*Wait, you don’t work at CBS?*", "score": 5, "replies": []}, {"body": "Blud wrote a whole essay", "score": 3, "replies": []}, {"body": "cvs sucks been waiting 4 weeks for script. there are better choices.", "score": 3, "replies": []}, {"body": "I remember when I discovered ChatGPT.", "score": 3, "replies": []}, {"body": "Yeah but CVS fucking blows. Workers quitting left and right, patients deciding they’d rather pay higher copays at a different pharmacy then wait half an hour at CVS", "score": 3, "replies": []}, {"body": "Every CVS I’ve been to was empty with less than 10 customers.  How can they make money from retail traffic?", "score": 5, "replies": [{"body": "We just gonna have to trust Ernst & Young for this. Would be hard to judge a company on a store to store basis.", "score": -1, "replies": [{"body": "If there is something I have learned is \"Never trust these human auditors.\"", "score": 2, "replies": []}]}]}, {"body": "Im all in cvs", "score": 2, "replies": []}, {"body": "CVS doesn't work anymore in a low trust society. These stores have tremendous amounts of theft. It's mind numbing to witness politicians have devolved into this level of idiocy to pander for votes. ", "score": 2, "replies": []}, {"body": "Insurance and healthcare are for gay bears. I’m living forever", "score": 2, "replies": []}, {"body": "Buy $66 puts for Friday got it", "score": 2, "replies": []}, {"body": "I’m all in on CVS this week in prep for earnings. The rest of healthcare stocks that have reported showed good earnings and are all trending higher since April 1 CMS rate issue.  All besides CVS as if the market forgot Aetna exists.", "score": 2, "replies": [{"body": "Im down 50% in 300 days, atm strike, option on it after averaging down 2 times, if it falls a lot this earning im leveraging up with otm 170 days option.", "score": 2, "replies": [{"body": "Similar situation here as I didn’t think the price could keep dropping when CI, UNH and ELV were rising.  At this point if it keeps dropping it’s like the market cap will just be Aetna and we get the retail and PBM business for free.  Let’s see what earnings hold I guess", "score": 2, "replies": []}, {"body": "Well we fukd", "score": 1, "replies": [{"body": "that revision to 7$ is brutal. They still estimate about $10B of fcf which is more important than eps. Gonna hold onto it for a bit before I decide what to do.", "score": 1, "replies": [{"body": "Not fun to see :(", "score": 1, "replies": []}]}]}]}]}, {"body": "Earnings Date: 07.02.2024\n\nSo calls it is? ![img](emote|t5_2th52|29637)", "score": 3, "replies": [{"body": "I would be lying if i tell you I know what the stock price is gonna do on an earning call. There could be a big sell off like HUM when they talk about healthcare utilization, but I see the stock price recovery to $87 the next 6-12 months. If they crash too much on earning( $68), im leveraging up on my options.", "score": 2, "replies": []}]}, {"body": "CVS is an extremely corrupt company that profits off slavery. They force their pharmacists to work off the clock, and if the pharmacist refuses, then CVS demotes them to graveyard shift or floater to stores 100 miles away to make them suffer, then fires them for something petty, then replaces them with a naive newgrad that works 2 to 6 hours off the clock everyday. This is how CVS are managed all across the country, in fact, District Leaders are trained by corporate and encouraged by the CEO to do this to make more profit and drive up stock price off the blood/sweat/tears of the pharmacist slavery", "score": 1, "replies": []}, {"body": "How's the fundamentals since your thesis?", "score": 1, "replies": []}, {"body": "How are you assessing the cost of delayed medical procedures,increasing cost of there insurance business. Humana showed the industry after Covid produced a rise in cost to their business affecting their profitability.  With there heavy investment in Medicare part b there could be an affect on profitability. I have a target of 135 but in the short term do you see a problem.", "score": 1, "replies": [{"body": "Your target is an 80% increase? In what timeframe on Earth? Even if Walgreens surrendered all of their assets to CVS, their market cap couldn't increase more than 22%.", "score": 2, "replies": [{"body": "I was looking at historical price levels. I think they can get there in a bull market by June or year end. But for me I trade options going to 87 is a good gain for an at the money call.\n\nEdit: there max p/e was at one point 41 it’s now 11 seemed reasonable at the time I did my analysis", "score": 2, "replies": []}]}, {"body": "Those are outside of my technicality. I just focus on the known financial that CVS produced. CVS is like a big moving train, it would take something very dramatic to slow their growth for the reasons that you have mentioned. But if it does affect CVS, you might see their growth slow from 10% to 8% or 7%. Even if their growth went from 10% to 0% overnight, would you be happy to own a business that is producing 12% value a year? I would, as the market return is 10% on average. $87 is just a short term target, I would be happy to own CVS forever at this price.", "score": -1, "replies": [{"body": "I have been following cvs for a while now made some on the movement to 75. I think your assessment on the business is sound, I think a good entry is between 71-75 nice work.", "score": 2, "replies": []}]}]}]}
