{"title": "NFLX Earnings", "selftext": "Hi,\n\nI'm new to trading and I'm just wondering what you think about the possible direction of NFLX after it releases its earnings report?\nI've read that generally the consensus is that it'll be a positive earnings report but I read mixed opinions about how the price will move. Why would it go south if the earnings report is positive?\n\nThanks,", "id": "32ph2u", "created_utc": 1429119558.0, "score": 9, "upvote_ratio": 0.8, "num_comments": 21, "comments": [{"body": "It's a trap!\n\nBut if you're new to trading and okay with the stock moving 20% in either direction...\n\nPersonally I don't follow NFLX, but in general stocks can move down on positive earnings (at least, when just comparing the numbers vs consensus) by not beating whisper, shrinking profits, weak guidance, and even competitor earnings just to name a few.\n\nHistorically NFLX has massive gaps after earnings. Not everyone is going to get it right. Fortunes *will* be lost today.", "score": 5, "replies": []}, {"body": "I would play it with a reverse iron condor if you have no idea which direction it is going. You should explore some options play if interest. Option play based on how much the stock move, without regard of direction, which is better fit for NFLX in my opinion.\n\nhttp://www.theoptionsguide.com/reverse-iron-condor.aspx", "score": 3, "replies": [{"body": "Very interesting. Thank you for sharing. ", "score": 1, "replies": []}]}, {"body": "After hours trading shows it way up.", "score": 3, "replies": []}, {"body": "If you are dead-set on investing in Netflix, I would wait until they miss on earnings. It could be a few quarters from now, but once they report sub-par earnings the market will overreact and their stock will drop like a rock. This will create an excellent opportunity to buy into the stock. Then just sit back and enjoy the ride.", "score": 1, "replies": [{"body": "So you mean yesterday ?", "score": 1, "replies": []}]}, {"body": "NTFX is a no go. They pretty much maxed out their American market. The service is 10$ per month. Not a money machine.", "score": 0, "replies": [{"body": "Recent reports state that netflix has ~55million subs. Which is no where near the American population of 300mil. Given that no one is going to buy their own sub so... 300/average size of american family (2.5) = 120 mil.\n\nAnd the 55million subs is global. No where near maxed out\n\nEDIT: fixed wording to sound less like a dick.", "score": 1, "replies": [{"body": "**P/E = 110.06**\n\nI rest my case.", "score": -1, "replies": [{"body": "All that means is that it's share price is overpriced given that the S&P is like ~17. Has nothing to do with the saturation of the American audience... ", "score": 1, "replies": [{"body": "My whole point was they don't have a lot of room for subscription growth to meet the stock price. I should have mentioned how overpriced it was too in my original comment, but I thought that was a given. If you got into NTFX a few years ago, GOOD FOR YOU. Buying into it now is foolish.", "score": 1, "replies": [{"body": "Yeah, I agree with you there, but they also have a lot of uncharted territory around the world and it doesn't really cost them much capital to expand overseas. Also, the dollar isn't going to be strong forever so when the ECB finally learns how to handle quantitave easing correctly they'll be raking in a lot more profit from Europe. But NFLX is definitely not worth the buy right now.", "score": 1, "replies": [{"body": "I find the risk of a bear market or a correction 1000x more likely than NTFX going global. Most people in other countries give zero fucks and just pirate all their media. I usually don't care what other people invest in, but **buying into NTFX is beyond stupid**.", "score": 0, "replies": [{"body": "Lol, personally I'm waiting for a correction as well before I come back into the equities market. Most PE ratios are too high and not worth the premium. \n\nAnd honestly, I used to pirate all my shit too... I just got too lazy to priate. so hey, now I'm a netflix subscriber.", "score": 1, "replies": [{"body": "Yeah, catch that fish in a correction and it'll make you rich.", "score": 1, "replies": []}]}, {"body": "Most people born past 1990 don't give a fuck and pirate all of their media even in North America; the kicker is, netflix is such a damn great service that it beats free. Everybody I know is subbed with no intention of stopping and the universal protocol for watching a movie is 1. check if its on netflix and 2 if it's not torrent it.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Non-event.   Why?  Because two big down moves, two big up moves in last four earnings, so, this one won't move.\n\nI base that on all the bullshit above and no actual information.  ", "score": -1, "replies": [{"body": "badge cow tan angle fade soft close snow touch aware\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*", "score": 5, "replies": [{"body": "Okay...let me explain sarcasm to you...", "score": 0, "replies": [{"body": "cable payment flag zealous wild simplistic unite groovy drunk normal\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*", "score": 5, "replies": [{"body": "Yeah, it was a real winner.", "score": 0, "replies": []}]}]}]}]}]}
{"title": "[YOLO] Short NFLX", "selftext": "NFLX does not make any sense from a strategic perspective.  They have not created sufficient barriers to entry since now Apple and even HBO are creating streaming services.  In addition, because they rely on content providers as vendors, they are at the whim of content providers and will likely be unable to earn economic profit in the future.  \n\nFurther, they are so close to their all time high that I think it is  likely the market creates a double top.  For these reasons I would like you to go short NFLX ASAP anywhere in today's range.", "id": "32q14e", "created_utc": 1429128419.0, "score": 2, "upvote_ratio": 0.56, "num_comments": 29, "comments": [{"body": "I am sorry about your loss ", "score": 26, "replies": [{"body": "This is a multi-year strategy bet I don't care about earnings or slight variations in price.", "score": -10, "replies": [{"body": ">Short NFLX\n\n... \n\n>This is a multi-year strategy bet I don't care about earnings or slight variations in price.\n\n  LMAO ", "score": 26, "replies": [{"body": ">slight variations in price", "score": 13, "replies": [{"body": "sometimes my \"normal strategies that didn't work\" become \"multi-year strategies\" ", "score": 9, "replies": [{"body": "Yup, been there, although I would only EVER risk that if I'm long. I would recommend Op close his short. After many quarters like this, it's clear WS only really cares about subscription growth and Netflix has its mojo back.", "score": 3, "replies": [{"body": "If I had to pick a top 5 WORST stocks to short... it would be NFLX. The payoff is laughably asymmetrical... and not in your favor.\n\n  Hilarious to see the cognitive dissonance on this sub. \n\n  You bet a coin flip at earnings then spout off nonsense about \"multi-year strategy\".", "score": 3, "replies": []}]}]}]}, {"body": "I have to admit this move is a little bigger than I expected...  I am lucky I am not full size and I will be able to get some DCA action going.", "score": 1, "replies": []}]}, {"body": "Wow you guys. Post an article about what Einhorn or Ackman thinks and people give it respect, post a strategy that they might use and people give you downvotes.  I see how it is.", "score": 2, "replies": []}]}]}, {"body": "hey man, atleast you got the YOLO part right", "score": 8, "replies": []}, {"body": "Stock completely whiffs on EPS estimates and it's up 12%.  It's all about subscriber growth and people couldn't care less about the top or bottom line", "score": 4, "replies": [{"body": "Bull market hype!", "score": 1, "replies": []}, {"body": "My issue was cost of content rising but I haven't heard anyone talking about that...", "score": 1, "replies": []}, {"body": "The possible stock split could have an effect on the price too, no?", "score": 1, "replies": [{"body": "Why would it? a stock split doesn't affect the value of the company in any way, besides some possible psychological effect on uninformed investors/traders.", "score": 3, "replies": [{"body": "Money is a piece of paper and digital number in your banks server..  I think psychological effects are more prominent than you think ", "score": 2, "replies": []}, {"body": "It definitely has a psychological aspect. Look at how easily apple has climbed since it's stock split. Yeah, I get they are making more money now than ever, that's fine. But they made a shit ton of cash for the last ten years or so too!", "score": 1, "replies": []}]}]}]}, {"body": "after hours jumps $62, I don't think people are going to bet against NFLX.", "score": 5, "replies": [{"body": "I guess I just prefer contrarian strategies.", "score": -2, "replies": [{"body": "*contrarian gambles", "score": 3, "replies": []}]}]}, {"body": "I don't get your logic at all. Who needs barriers to entry? People have 500 channel cable plans. Why are they going to limit themselves to one video streaming service? You could subscribe to Netflix, HBO, Apple, and Amazon streaming all for less than the price of the average monthly cable plan...", "score": 2, "replies": [{"body": "This is my \"TV\" plan, plus Hulu. \nFrom Consumer Affairs-\"40% of U.S. homes\nAccording to Nielsen, over 40% of U.S. homes had access to an SVOD service as of November 2014, and 13% of homes had access to multiple streaming services. Their number increased by 1.75 million in 2014 while homes with pay TV services – which still make up the overwhelming majority of homes – declined by 2 million.\n\nThe numbers suggest a trend we reported a year ago is continuing. Last April Experian Marketing Services found that 48% of all U.S. adults and 67% of young adults watch streaming or downloaded video during a typical week, whether they subscribe to a cable of satellite TV service or not. And they weren't usually sitting on the couch while they were watching.\n\nExperian found mobile was the preferred screen for watching, streaming or downloading video, with 24% of all U.S. adults and 42% of smartphone owners watching downloaded video each week.\"", "score": 1, "replies": [{"body": "I'm in the same boat.  I'm 33 and I have literally never in my life had a \"cable TV\" plan that I paid for, including \"basic cable\".  Currently I have Netflix and Amazon Prime, and we're probably going to add HBO  soon as well, but that's it.  I have no desire for a cable subscription and all the hassle that comes with it, and I don't think I'm alone.\n\nI think this trend will absolutely continue, especially given how successful Netflix has been with its original series; I'm pretty certain that is the future of TV - exclusive shows will compel people to buy a VOD subscription.\n\nAnd I love it - I don't have a bunch of BS that I never watch; Netflix has consistently kept my family entertained and if it ever stops being useful for a long while, we'll just cancel.", "score": 1, "replies": []}]}]}, {"body": "That sucks. Next time, be short and still make money while directionally wrong by learning to sell OTM options. Leave the 50/50 coinflip game", "score": 1, "replies": [{"body": "and join the penny/steamroller game!", "score": 2, "replies": []}]}, {"body": "They don't solely rely on content providers. They are creating their own content, series and even soon will be acquiring IP. \n\n\nPrice is high, for sure-- but no risk no reward. ", "score": 1, "replies": []}, {"body": "errmmmmm, I guess you might be correct but I seriously doubt it. Not saying there isnt a short to play but come on now. With respect to content, they (as I'm sure you know) are making their own which has been (and will be going forward) highly received. They have the best UI out there, certainly better than amazon. They are a house name brand. Their management is excellent, their tech is superb. Way beyond anyone else currently is. They're staying a few steps ahead (consistently). I therefore disagree with you but good luck on your short.", "score": 1, "replies": []}, {"body": ">  I would like you to go short NFLX ASAP anywhere in today's range.\n\nNo", "score": 1, "replies": []}, {"body": "yep", "score": 1, "replies": []}]}
