{"title": "NVDA - Past Earnings (If past means anything)", "selftext": "", "id": "7b148g", "created_utc": 1509923607.0, "score": 31, "upvote_ratio": 0.88, "num_comments": 28, "comments": [{"body": "Sold NVDA Friday and used the funds to buy QCOM. Personally, I'm hoping NVDA shits the bed and QCOM rockets, so I feel like an investing prodigy. Next Friday, I revert by selling QCOM and buying the imminent NVDA post earnings dip. At that point, my brain will have reached the singularity and I will be able to manipulate matter with my sheer intellect, allowing me to change the brain composition of all you autistic fags so you actually become autistic fags. ", "score": 21, "replies": [{"body": "10/10", "score": 5, "replies": [{"body": "Would read again", "score": 3, "replies": []}]}]}, {"body": "Yeah they’ll beat, then they’ll drop", "score": 37, "replies": [{"body": "This", "score": 3, "replies": []}, {"body": "If it follows the pattern of previous earnings then it will skyrocket", "score": 3, "replies": [{"body": "if it follows the patterns of previous earnings it will drop dumb ass.", "score": 12, "replies": []}, {"body": "No", "score": 1, "replies": []}]}, {"body": "Is that their typical path?", "score": 1, "replies": [{"body": "Seems like profit taking usually occurs after earnings and you will see a short term dip.  But it also rocketed up this year after earnings in the summer", "score": 3, "replies": []}, {"body": "[removed]", "score": 2, "replies": [{"body": ">But the stock is the most expensive it has ever been on most metrics\n\nI'm not bashing you, but this is repeated in just about every NVDA thread prior to earnings", "score": 1, "replies": []}]}]}]}, {"body": "It's had too much of a run to bounce higher off ER. One of my favorite stocks but I'll probably let my calls ride the next few days, close out before ER, and grab 1-2 puts. The ERs where it has skyrocketed saw the price stagnate a bit in the months prior...just like last ER, it's been on too much of a tear to move much higher. So definitely inverse me.", "score": 9, "replies": [{"body": "wouldn't IV hurt any revenue from puts this close to ER?", "score": 1, "replies": [{"body": "I would buy a few weeks out to at least partially dodge the crush", "score": 1, "replies": []}]}]}, {"body": "This is absolutely pointless without looking at context. For example the climb to 150+ was after the Citron POS lemon was keeping the stock range bound. That ER confirmed that he was wrong, sending it sky high for an entire 3 months. You have to look at context. ", "score": 6, "replies": []}, {"body": "I’m selling before earnings to lock in so go all in guys, it’ll skyrocket.", "score": 4, "replies": []}, {"body": "What about the price movements after earnings?", "score": 2, "replies": [{"body": "Q3 17 - skyrocket\n\nQ4 17 - collapse\n\nQ1 17 - skyrocket\n\nQ2 17- collapse\n\nQ3 17 -???\n\nI guess you notice the pattern.", "score": 9, "replies": [{"body": "Shit son, if Q3 17 is going to be anything like the previous Q3 17, this shit will skyrocket. Man wish investing and trading stocks was always this easy.", "score": 10, "replies": []}, {"body": "This scares me 🤔", "score": 6, "replies": []}, {"body": "Q2 context: It beat and then the Donnie and Kimmie \"Rocket Man\" twitter feud started and the whole market shat the bed for a couple days. It's difficult to say if it dropped due to ppl's actual valuation of the company.", "score": 1, "replies": []}]}]}, {"body": "How do they double earnings and still have a PE of 60; wow.", "score": 2, "replies": [{"body": "by people buying the stock", "score": 1, "replies": []}]}, {"body": "Past Performance does not guarantee Future Results\n\nBut yeah they'll crush this shit", "score": 1, "replies": []}, {"body": "\"Past Performance Is Not Indicative Of Future Results\" - Our Lord and Savior Martin Shkreli ", "score": 1, "replies": [{"body": "True dat. ", "score": 1, "replies": []}]}, {"body": "Just go long they’lll be 300 in a few years ", "score": 1, "replies": []}]}
