{"title": "Holding over the weekend?", "selftext": "So I have a few UAL, DAL, and AMD puts that I’m holding right now. I’ve made about 250% profit overall but don’t know if I should take the risk of holding for the weekend. Expirations are all 3-4 weeks out. I’m leaning towards a hold but what do you guys think?", "id": "fax1l6", "created_utc": 1582906437.0, "score": 12, "upvote_ratio": 1.0, "num_comments": 31, "comments": [{"body": "Surely you meant puts? No way you’ve made 250% profit on Delta calls right now.", "score": 9, "replies": [{"body": "Yup I meant puts... just noticed", "score": 2, "replies": []}]}, {"body": "Well today is Friday and naturally the market always goes down on weekends but with the corona virus, it might drop a bit more than usual towards the end of the day.", "score": 5, "replies": [{"body": "That’s what I’m thinking. And I doubt airline stocks are gonna go up cause of coronavirus", "score": 2, "replies": [{"body": "Well definitely not delta, fuck delta. I actually had a flight to Italy planned for March 6th since August of last year and when news bad got bad last week, I decided to call and cancel to get a refund but they told me my travel insurance doesn’t cover that so I was out of luck. But then today I got a email saying they are giving refunds etc etc. So I’m pretty sure they are going to lose millions of dollars from all the flight tickets they have to return that head to Italy.\n\n\n Nice one buying puts on delta. Is it still worth to get it in?", "score": 1, "replies": [{"body": "Ouch that sucks man... I actually overheard someone this morning griping about a very similar situation! And I bought my Delta puts on Monday and so far haven’t made an insane profit (cause the stock is acting a little funky). I have 3/20p $40 and $35... I think you got time to get in though because this weekend should be brutal. Also UAL is gonna be a good put cause they’re just announced they are reducing their flights to Asian countries afflicted with coronavirus", "score": 2, "replies": [{"body": "I closed out some AAL puts this afternoon.  They gave me a heart attack yesterday.. but a big swing today put me back on top.", "score": 1, "replies": [{"body": "I made bank on my UAL and DAL puts this week and I decided that I’ll hold them till next week. United announced they are putting restrictions on flights to Asian countries afflicted with Coronavirus so I’m confident next week will be a good week. Got rid of my AMD tho", "score": 1, "replies": []}, {"body": "My single AAL put is at +$268 and expires the 6th. I think you got out too soon. I know my number is small but I’m just starting out.", "score": 1, "replies": [{"body": "I actually wound up buying another AAL put (3/13) along with a DAL put (3/20) before close today.  I’m sure my gain could have been bigger but it wasn’t a loss so I can’t complain", "score": 2, "replies": []}]}]}, {"body": "I had UAL and DAL puts, UAL has the biggest exposure to Asia/europe IIRC and made me the most profit. DAL was driving me nuts because it had a lot of positive pressure throughout the day, keeping my put mostly in the red. So I researched why might that be and found a mention that Warren Buffet had made a major investment into DAL at the price its hovering now. \n\nI'm thinking about taking another swing at DAL this week.", "score": 1, "replies": []}]}]}]}, {"body": "Trump doesn’t agree with you and has tasked Fed with pumping the markets again. It’s happening now, not sure how long it can last.", "score": 2, "replies": [{"body": "Even if the fed is pumping the markets right now, imagine when the first case of the corona virus hits New York, which is already rumored to already be there. The market will plummet a little more.", "score": 2, "replies": [{"body": "I agree. No doubt. I just wanted to point out that Trump and the Fed will try everything to keep the markets afloat. Interest cuts too.", "score": 2, "replies": []}]}]}, {"body": "Is there a chance they could be waiting till 30min before close to sell because they know RH closes puts 1hr before close??", "score": 1, "replies": [{"body": "What do you mean? RH closes whenever market closes", "score": 1, "replies": [{"body": "I thought if you have a Put which expires today, they sell it 1 hour before close no?", "score": 1, "replies": [{"body": "Ohhh yeah you’re right, my bad didn’t understand your question.", "score": 1, "replies": []}]}]}]}]}, {"body": "Volatility in the next 3-4 weeks is probably going to continue. I'd take some profits and probably scalp or switch to puts if you have directional confidence.", "score": 5, "replies": [{"body": "Hang on to those \\*\\*puts\\*\\*", "score": 3, "replies": [{"body": "Sounds good thank you!", "score": 1, "replies": []}]}, {"body": "Lol I meant puts", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 2, "replies": [{"body": "I’m thinking of selling AMD and buying more airline puts with it", "score": 1, "replies": []}]}, {"body": "Hold the airlines put. Im in similar situation and im gonna hold until like a week or so before exp", "score": 2, "replies": []}, {"body": "I'm in the same boat. UAL, SPY, INTC, LVS puts 3-4 weeks out. I plan on holding until late next week. This virus scare isn't over yet.", "score": 2, "replies": [{"body": "I’m thinking of selling my AMD puts and loading up on some more UAL puts", "score": 1, "replies": [{"body": "Well in light of the news tonight I would say that's a good bet. Also load up on consumer goods puts. I added TGT puts late in the day. I have a feeling anyone who goes all in on puts will be rolling in cash in a few weeks.", "score": 1, "replies": []}]}]}, {"body": "In puts for DAL AAL RCL BYD, this market is amazing probably the best time if you get the right direction and know to read the charts.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I sold my AMD puts but holding all my airline puts. But I’m probably gonna sell them all in the next week tbh cause the market is getting weird (that random shoot up in the last 5 minutes)", "score": 1, "replies": []}]}, {"body": "There are no spoons", "score": 1, "replies": []}]}
{"title": "25k & Buying the dip", "selftext": "Hi folks, I have some freed up cash I want to put in the market. Wondering if I should wait for a bit and what I should buy. Thinking MSFT & Tesla. \n\nThis is a long game move not looking for a quick return. Thanks.", "id": "fanojz", "created_utc": 1582857465.0, "score": 10, "upvote_ratio": 0.81, "num_comments": 36, "comments": [{"body": "If coronavirus takes off in the US it’s going down even further.", "score": 15, "replies": []}, {"body": "Definitely wait atleast a week.", "score": 19, "replies": []}, {"body": "Well you could probably maximize your profits by watching and seeing if they go lower which they will.", "score": 16, "replies": [{"body": "You seem confident my model puts 89% on a rebound of at least 1.1% for the S&P 500 tomorrow.", "score": -4, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "yes, soon the algo computers will be turned off as they are losing too much money buying into the dips", "score": 1, "replies": []}, {"body": "its* impact.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Sorry, I had to", "score": 1, "replies": []}]}]}]}, {"body": "Futures down 1.6% right now. They can change a lot before open, so who knows, but 1.1% green is likely doubtful", "score": 2, "replies": [{"body": "Looks bad so far my mentors he’s been at it 30+ years and he said he’s never seen investors act so stupidly. He said the market must be oversaturated with ignorant retail investors because they are going to sell the country into a recession.", "score": 1, "replies": []}]}, {"body": "Ut may rebound, but its gonna go down I would bet money on it", "score": 1, "replies": [{"body": "I’ll play short if the model indicates it. I don’t hold a lot for a long time outside of my retirement like most people here. I’ll usually make 3 to 4 full cycle trades in a day when the market is like this.", "score": 2, "replies": []}, {"body": "Also sound confident go SPXS on margin.", "score": 1, "replies": []}]}]}]}, {"body": "Don’t try to time a dip, especially based on what a comment here or there says. What you should do is cost avg it over the next 12 months (i.e., buy chunks every month on a regular interval). If your time horizon is long (10+ years) then the markets will surely be much higher in the long term. \n\nYou’ve already secured a ~10% discount; if it goes down further, your next buys will just be cheaper. But at least this way you can rest easy knowing you didn’t miss a golden opportunity. \n\nFor what it’s worth, I like MSFT on the fundamentals and am long in TSLA. \n\nGood luck.", "score": 10, "replies": [{"body": "This strategy & perspective is helpful, thanks.", "score": 5, "replies": []}, {"body": "it's not a discount, that whole pool of SP500 stocks were overweight from leveraged speculation during past few months.", "score": 1, "replies": [{"body": "Not yet 😉", "score": 0, "replies": []}]}, {"body": "NOT a discount. Everything was overpriced. This isn't even in correction territory yet.", "score": 0, "replies": [{"body": "Discount on what it was previously priced at*. It’s all relative. And we are definitely into correction territory, look at the charts.", "score": 0, "replies": [{"body": "Disagree. We're barely at late 2019 levels which was overpriced as hell. Are you new to investing?", "score": 0, "replies": [{"body": "No. But I have no interest in arguing with you. Good luck with your investing. No reason to volley silly insults back and forth.", "score": 0, "replies": [{"body": "lol off you go", "score": 0, "replies": [{"body": "Lol smell ya later [aka everyone look at his user history]", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "Just buy 25 k of spy puts.", "score": 5, "replies": []}, {"body": "25K and your want to throw it in one of the biggest dumpster fires the market has seen in recent memory? I’d definitely wait a few weeks and see what happens with Coronavirus. There’s one thing the market hates, and that’s uncertainty, hence the exodus. \n\n*unless you’re a degenerate, then roll on over to /r/wallstreetbets and put it all on black", "score": 7, "replies": []}, {"body": "I get the vibe a lot of people think this will be a temporary thing. Companies are already reporting likely missed future earnings, and this is without the virus taking hold in the U.S. On top of that, the market has been ripe for a correction for a very long time. I don’t even think averaging down makes sense given the economic climate (but it’s smarter than buying all at once). This is one of those times where you should wait it out for a month minimum in my opinion.", "score": 5, "replies": []}, {"body": "SPY 290p 03/02 at open thank me later", "score": 2, "replies": []}, {"body": "I am waiting until most economically relevent countries stop having lockdowns", "score": 4, "replies": []}, {"body": "Wait until Monday and begin averaging in with a few thousand a week over the next few months. If it continues to trade down, don’t freak out, just stick with your plan to hold long term and continue to average in if you can.  I like Apple and Tesla as long term moves. I use my iPhone ask the time, I use Microsoft products only so often.", "score": 4, "replies": [{"body": "It’s not what you’re using, it’s what the rest of the world uses. Something like 99%of all companies with 10 or more employees  use Microsoft or its software. And that’s global. Including our countries military and about 100 other countries military. Microsoft has a stranglehold on the market, they just target businesses/ military. Throw in Xbox’s and you got billions of people using Microsoft.In fact more people use Microsoft than Apple, and it’s not even close.", "score": 8, "replies": [{"body": "Xbox might make a big comeback next cycle too. They've been acquiring gaming companies like crazy.", "score": 2, "replies": [{"body": "msft speculation on future earning is based on AI and cloud, xbox and windows licensing is financing those investments", "score": 2, "replies": []}]}]}]}, {"body": "No tesla. Just no. \n\n\nBuy some GILD, CLX, DOCU,TDOC, etc........virus plays", "score": 4, "replies": []}, {"body": "yeh just reallocate and adjust or whatever, schwab said do that you'll be cherry", "score": 1, "replies": []}, {"body": "Buy spy puts instead, this is just getting started", "score": 1, "replies": []}, {"body": "Terrible idea", "score": -2, "replies": []}]}
{"title": "In these bad times, stay strong and DON’T pull out. It WILL come back up.", "selftext": "[deleted]", "id": "fanyh2", "created_utc": 1582858696.0, "score": 8, "upvote_ratio": 0.61, "num_comments": 32, "comments": [{"body": "[removed]", "score": 14, "replies": [{"body": "( ͡° ͜ʖ ͡°)", "score": 8, "replies": []}, {"body": "yes sir 🧐😛", "score": 3, "replies": []}]}, {"body": "This. You can’t lose if you don’t sell. Hold.", "score": 21, "replies": [{"body": "Hold? Hell I’m buying everything these fools are selling", "score": 30, "replies": [{"body": "Guh", "score": 3, "replies": []}]}, {"body": "I sell all my losses and go 12x leverage and play the bounces tax free at least for the first bits.", "score": 2, "replies": []}, {"body": "❌🧢", "score": 1, "replies": []}]}, {"body": "I usually agree panic selling and timing the market is a bad idea, but in this case there's arguments for liquidating now with some losses. This isn't like 2018, we have a downturn that is driven by a severe worldwide event that can be measured and tracked. The fact that it's almost certainly going to get worse suggests it makes sense to sell in anticipation of buying back in at some lower price.", "score": 10, "replies": [{"body": "It's not going to get worse. The rate of infection in China is under control while the number of recovered people is outpacing the infected. The numbers will rise in Europe and the Americas but they will never reach the 10s of thousands as they have in China. We've hit peak flu.", "score": -7, "replies": []}]}, {"body": "Can someone explain this concept of holding?\n\nIn my eyes in a falling market i should be exiting as soon as possible to buy in at a lower price point. Since i do agree obviously it will all recover but selling now and buying in cheaper will make the gains easier when the market is recovering than waiting for it to reach the point where i am bought in now atm.\n\nThe only risk is \"timing the market\".", "score": 9, "replies": [{"body": "You pretty much nailed it, your risk is timing. By holding, you don't have to get lucky at all to make money. You just have to endure some unrealized losses for a while. If you sell now and buy later, you have to get lucky twice. You have to get lucky at your sell point, and at your buy point. Your can potentially make a lot of money, or you could end up with less shares than you started with and be behind someone that just held.", "score": 7, "replies": []}]}, {"body": "in these  bad times as a first  time investor with a lot of money to spent which wouldn't hurt him to lose:\n\nany recommendations on when to buy what?", "score": 2, "replies": []}, {"body": "My couch pulls out, but I don’t", "score": 2, "replies": [{"body": "christ 😂💀", "score": 1, "replies": []}]}, {"body": "Or\n\nOr\n\nFlush those weak hands, take loses, give up on your dreams. Accept defeat. Do it", "score": 0, "replies": []}, {"body": "But the 2019 yield inversion indicates this is a recession... go short", "score": -1, "replies": [{"body": "Wasn't a very big inversion. May not be a very big recession (I like to oversimplify complex things)\n\nNot every recession has been accompanied by a 50% drop in the market\n\nThe 1990-1991 recession didn't even produce a bear market\n\nYou could be right. Or not", "score": 5, "replies": [{"body": "Agreed this is speculation, but a suck a bull run has to end sometime.", "score": 1, "replies": [{"body": "And I should mention 12 years without a significant recession, barring 2018 it wasnt that bad, we truly are due. Typically recessions are every 8 years. I am not pressing my luck with a crippled global manufacturing complex.Not to mentioned the upcoming election, the stock market can take a huge hit if a particular someone gets elected. I hope for a quick upturn for my 401ks sake but am hedging my bets with my portfolio.", "score": 2, "replies": []}]}]}, {"body": "I don’t think this is a recession. This all started happening with the coronavirus.", "score": 6, "replies": [{"body": "this isn't a recession. People using words they don't know the meaning of.", "score": 1, "replies": [{"body": "Recession is 20 percent decline from a recent high. We are already well past 10 percent. I will certainly admit if I am wrong and learn from it. Thanks for sharing your perspective. I am sure you have insights that I am unaware of that would be invaluable.  RemindMe! 3 months", "score": 1, "replies": [{"body": "I will be messaging you in 3 months on [**2020-05-28 05:46:06 UTC**](http://www.wolframalpha.com/input/?i=2020-05-28%2005:46:06%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/stocks/comments/fanyh2/in_these_bad_times_stay_strong_and_dont_pull_out/fizofvd/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Ffanyh2%2Fin_these_bad_times_stay_strong_and_dont_pull_out%2Ffizofvd%2F%5D%0A%0ARemindMe%21%202020-05-28%2005%3A46%3A06%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20fanyh2)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}, {"body": "Clearly, a recession is not ONLY dependent on the stocks, you do realize that?", "score": 1, "replies": []}, {"body": "The definition of a recession is \na period of temporary economic decline during which trade **AND** industrial activity are reduced, generally identified by a fall in GDP in **TWO successive quarters**. So are you correct saying we are in a recession?", "score": 1, "replies": []}]}]}]}, {"body": "but still, it will go back up once the recession ends", "score": 1, "replies": [{"body": "Definetly and I will buy back in.", "score": 3, "replies": [{"body": "100%", "score": 0, "replies": []}]}]}]}, {"body": "Once everyone realizes corona virus is as big of a hoax as Y2K, it will roar back", "score": -8, "replies": []}, {"body": "Thanks for the solid sex advice, stockbro", "score": 0, "replies": []}]}
{"title": "Bought Tesla at 250 should I sell or hold", "selftext": "Missed the exit and there are not many resistances down, is it worth selling or holding? Cheers guys", "id": "far8be", "created_utc": 1582875831.0, "score": 12, "upvote_ratio": 0.7, "num_comments": 32, "comments": [{"body": "Protect with a put", "score": 25, "replies": [{"body": "Not bad advice depending on size of position", "score": 5, "replies": []}, {"body": "Probably should read up on puts if that’s your plan. It’s not just buy puts and save your investment. Can literally double losses having shares and puts.", "score": 3, "replies": [{"body": "> Can literally double losses having shares and puts.\n\nhow? i suppose with bad timing...", "score": 1, "replies": [{"body": "There are other factors that play into options. It’s not just picking a direction and if it goes that way you win. It can literally go your way and your options can be worthless. \n\nMess around with a paper account before you start getting into options unless it’s money you can afford to lose I wouldn’t get into a position.", "score": 1, "replies": []}]}]}, {"body": "IV is too high right now. Better to sell the stock.", "score": 3, "replies": [{"body": "No.\n\nHold it. Even if Tesla turns out to be a dogshit company (which I really don’t think it is) it is still hyped as shit.\n\nDo not panic sell Tesla", "score": 2, "replies": []}]}, {"body": "Puts on Tesla are expensive. There is a tax implication. if you sell the Put with a profit it is taxable income, whilst the profits OP would make on the sale of the stock is probably long term capital gain, so lower rate.", "score": 1, "replies": []}]}, {"body": "No one ever went broke taking profits", "score": 20, "replies": []}, {"body": "Sell, you risking more than 200% profit when the market is all crashing down", "score": 17, "replies": [{"body": "This ain't close to being over. And Tesla's 3 month chart is nutty lmao", "score": 1, "replies": []}]}, {"body": "Hold unless you need the cash now sell soon as market open", "score": 5, "replies": []}, {"body": "Do you absolutely need the cash right now or within the next few years? If the answer is no, you shouldn’t be trying to time the market and just need to sit back & relax. Maybe pick some more up instead. This is all under the assumption you believe in Tesla’s business model", "score": 8, "replies": [{"body": "Conversely, would you buy at it's current price? Of not, take a little of the top and give yourself wiggle room if it pulls back more.", "score": 3, "replies": [{"body": "This kind of thought is scaring me. Investors seem WAY too lax with their money, \"knowing\" it will come back up. Historically, when investors think they're invincible is when they really aren't.", "score": 2, "replies": [{"body": "Exactly there is no consideration of risk or opportunity cost of having to wait 10 years to break even", "score": 1, "replies": []}]}]}]}, {"body": "Depends how far it’s going to fall eh? If you think it’s going to fall back to say 300, then sell now. If you think say 400 is the bottom you’ll still be up.", "score": 2, "replies": []}, {"body": "First off everyone in here telling you to sell also told you to sell at $170 last summer.  Why are you even asking?  Just buy more when it drops.  Nothing has changed with the long term.", "score": 6, "replies": [{"body": "It’d be much more worthwhile to sell and re enter when the market starts to recover, it’s not gonna drastically shoot up because even with a vaccine the impacts will last a while, and could cause a spiral of decline", "score": 3, "replies": []}]}, {"body": "Sell it and buy back in when the market starts to turn back around", "score": 1, "replies": []}, {"body": "Hold, tesla will be solid long term", "score": 1, "replies": []}, {"body": "SELL!! \n\nTSLA is in free fall and showing no signs of bottoming yet. The stock has put up zero resistance unlike many other stocks. Very scary situation for longs", "score": 1, "replies": [{"body": "I’m buying big on Tesla today.\n\nI’m a big believer in Tesla’s future growth. Specifically solar and semi.\n\nEven if it’s vaporwear which I don’t think it is. The stock is very hyped and it’s a stupid idea to sell at these numbers considering most people probably bought when it was in the 800-1000 dollar range.\n\n\nDO NOT PANIC SELL THINK IT THROUGH DEEPLY", "score": 1, "replies": [{"body": "Stock found some resistance today probably holding", "score": 1, "replies": []}]}]}, {"body": "Sell. Tesla is overvalued. Fair value maybe at 400.", "score": 0, "replies": [{"body": "Nope", "score": -1, "replies": []}]}, {"body": "So now AlphaChad needs some else to make his decisions for him... do you also need someone to come fuck your wife?", "score": 0, "replies": [{"body": "Haha yeah more like BetaChad", "score": 1, "replies": []}]}, {"body": "what was the low estimate on tesla?  $5?", "score": -2, "replies": [{"body": "$69", "score": 1, "replies": []}]}, {"body": "Can I buy from you $250 per share?", "score": -5, "replies": []}]}
{"title": "If you survived Winter 2018 get in here", "selftext": "I was wiped out back then. -$200k. I watched this sub as the survivors got rich and I finally just started re-buying last week (you’re welcome)\n\nIf the world doesn’t end, is buying 6 months out or 1 year leaps the right play down here or is the high IV going to dampen gains?\n\ntl;dr Looking for anyone that specifically bought calls in Dec 2018 vs leveraged etfs and how did it go\n\nwhat’s the best play?\n\n1. index leaps\n2. vix puts\n3. index leveraged etf\n\nThanks", "id": "famcet", "created_utc": 1582851482.0, "score": 41, "upvote_ratio": 0.95, "num_comments": 35, "comments": [{"body": "So you rebought at the top twice? Just quit for your own sakes", "score": 66, "replies": [{"body": "I made the $200k during the run up, off an original $25k and was wiped out buying the dip", "score": 19, "replies": []}, {"body": "For real.", "score": 4, "replies": []}, {"body": "It's the learning experience but why go with 200k when you're not successful", "score": 1, "replies": []}]}, {"body": "My answer isn’t the one you’re looking for but here’s what I did.\n\nI kept BTFDing thinking “Oooook, this has GOT to be the bottom.” It wasn’t. After seeing north of $75k wiped out in weeks (about 65% of my net value st the time) I finally just said “Uncle”, went all cash and waited....\n\nI watched the market recover and decided to jump back in around March 2019. I missed out on a pretty stellar run the first 2 months of ‘19. Hindsight being 20/20, I could have done well getting in sooner but I have no regrets just waiting for the dust to settle.\n\nOne other piece of advice I can give from a diehard bull, DON’T FIGHT TRENDS. This is not a dip buying opportunity yet. No one knows when it’s truly going to be over until after. Bear it up in small doses now until it’s obvious the bleeding has stopped. There’s money to be made here but you aren’t going to will the market in any direction.\n\nI’ve made nice money selling bull put spreads for the last 6 months. I finally threw in the towel and started selling bear call spreads. Opened a few on Tuesday with Apple. (I’m typing this from my iPhone...) I’ll go with the trends until the market shows me otherwise.\n\nLive to fight another day.", "score": 31, "replies": []}, {"body": "SQQQ has literally been free money all this week. I think Monday we end green before continuing to shed another 10-15%\n\nObviously its a 3x leveraged etf so use your judgment.", "score": 8, "replies": []}, {"body": "IV will kill you and this thing is just beginning.", "score": 7, "replies": []}, {"body": "I've been buying leaps for every put I buy.", "score": 3, "replies": []}, {"body": "Buying Netflix, Apple, MSFT, and shop calls late 2018 made bank for me by Feb/March. At least $100k across all those trades for 300-400%, also buying puts on Snap.", "score": 3, "replies": []}, {"body": "buy long puts on SPXS. Bear 3x leveraged ETF. Theyre on sale right now and the index loses over time, pretty much by design. The upticks are anomalies.", "score": 5, "replies": [{"body": "Can you explain this?", "score": 2, "replies": [{"body": "Its an index fund thats 3x inverse exposure to the S&P 500. By design, it becomes worthless over time as the S&P rises, and suffers disproportionately from market gains. By the same token, its gone up a large amount from the Corona virus panic. However, as soon as any good news hits, it'll drop lower than it was at before. Just check out the long term trendline.", "score": 6, "replies": [{"body": "Happy cake day!", "score": 3, "replies": []}, {"body": "So would you buy short term calls and long term puts?", "score": 4, "replies": [{"body": "You could, but calls have very high IV now. I bought some puts about a month out, and getting some longer dated ones tomorrow, basically betting on either a complete or short term market recovery.", "score": 3, "replies": [{"body": "Oh okay so you’re not trying to play both sides.\n\nTell me why again having IV is bad? I thought we liked high IV in option contract price movement?", "score": 2, "replies": [{"body": "Selling yes, because more premium in your pocket but if you look at the greeks,specifically Vega, every percent IV goes up the premium increases with Vega and vis versa. To with that what you will.", "score": 1, "replies": []}]}]}]}, {"body": "So you are saying that if someone thinks that the panic will eventually die off, then you will want to buy puts on SPXS? \n\nI'm looking at 07/20 puts at 12", "score": 1, "replies": [{"body": "yes.", "score": 3, "replies": []}]}]}]}, {"body": "How is that smarter than trying to predict the bottom by buying calls on any other asset, leveraged or not?", "score": 1, "replies": [{"body": "It's a lower risk than most FD's, but yeah, its still a risky bet. I'm essentially betting on this blowing over relatively soon for the monthly calls, and the market to have completely recovered for the longer ones. If you think it will continue to tank, puts on a bull etf or another stock would fit your strategy better.", "score": 2, "replies": [{"body": "No more guesswork, I'm going to straddle something. Can't go tits up with this much uncertainty.", "score": 1, "replies": [{"body": "Its a good straddle. The calls are pricier, but they could pay off if this continues to fall. The puts are cheap, and would more than cover the cost of the calls if the market recovers and they become worthless.", "score": 1, "replies": []}]}]}]}]}, {"body": "Wasn’t that around the time Nuclear War was a threat? I was there, trading AMD at 14-23.", "score": 2, "replies": []}, {"body": "Buy 9/18 $30 Ally calls. They're cheap around $100 per contract. If there's no recession, they should print money.", "score": 2, "replies": [{"body": "fuck off", "score": 1, "replies": []}]}, {"body": "I did SPY etf in the winter.", "score": 1, "replies": []}, {"body": "I lost a lot on svxy tbh.  I posted on stocktwits for a long time after as svxy4lyf (check my profile I’m a hot chick).   I keep getting banned on stocktwits", "score": 0, "replies": []}, {"body": "[deleted]", "score": -5, "replies": [{"body": "interest rate hike plus trade war fears", "score": 8, "replies": [{"body": "So basically nothing", "score": 12, "replies": [{"body": "Nothing real, like the bear flu apocalypse", "score": 1, "replies": []}]}]}, {"body": "oh you sweet summer child", "score": 1, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "google it dumbass", "score": 4, "replies": [{"body": "Don’t worry, he will get wiped out soon and leave", "score": 2, "replies": []}]}]}]}]}]}
{"title": "Let's Present the $CORONA ETF", "selftext": "$PG - Proctor and Gamble (cleaning and disinfecting products)\n$JNJ - Johnson & Johnson (more cleaning and disinfecting)\n$CPB - Campbells Soup (people enjoy this while sick)\n$PFE - Pfizer (pharmaceuticals)\n\nfeel free to add to this", "id": "fandtp", "created_utc": 1582856129.0, "score": 44, "upvote_ratio": 0.91, "num_comments": 34, "comments": [{"body": "$nflx because what else do you do when you're sick", "score": 36, "replies": [{"body": "$PNHB", "score": 15, "replies": []}, {"body": "I don't understand all the $NFLX hype, like people who don't watch Netflix and spent their free time doing something else like reading, shitposting or sucking dicks is not going to suddenly be interested in getting Netflix subscription because there's a pandemic going on", "score": 7, "replies": [{"body": "Netflix is lagging. Puts going to cash tomorrow.", "score": 2, "replies": []}]}, {"body": "What’s a good condom companies to buy?", "score": 1, "replies": []}]}, {"body": "APT - they make disposable protective wear and SPCE - because earth is fucked.", "score": 12, "replies": []}, {"body": "$CLX Clorox bleach and cleaning products.\n$MMM 3M N95 masks.", "score": 10, "replies": [{"body": "Where are 3M masks made?", "score": 1, "replies": [{"body": "Good point. The spec sheet for the one I looked at says made in USA but with globally sourced materials.", "score": 1, "replies": []}]}]}, {"body": "Whoever makes KY to help ease the discomfort while the market f-s you up the ass", "score": 8, "replies": []}, {"body": "Watch tv (NFLX), work from home (ZOOM), get delivery (GRUB), then jerk a load (MTCH).", "score": 3, "replies": [{"body": "I’m assuming you mean $ZM? \n\n$ZOOM is a telecom based in Beijing that went out of business and hasn’t reported earnings in nearly a decade.", "score": 1, "replies": [{"body": "Yeah my b lul", "score": 1, "replies": []}]}]}, {"body": "where do you thing these companies make their products? in the US?", "score": 3, "replies": [{"body": "Seriously look at PG all the news and it’s trending down because they have no small Chinese workers to produce products", "score": 2, "replies": []}]}, {"body": "I'm short PG, and JNJ. Made a killing. What a shit etf", "score": 3, "replies": []}, {"body": "Co-Diagnostics CODX make the testing kits", "score": 5, "replies": [{"body": "That's why this thing mooned. California only has 200 Kits at its disposal. This is gonna ship more", "score": 1, "replies": []}, {"body": "Cardinal Health also makes kits.", "score": 1, "replies": []}]}, {"body": "Inverse ETF I like it!", "score": 2, "replies": []}, {"body": "$pornhub", "score": 2, "replies": []}, {"body": "$Hand to jerk off with when your other two are tired.", "score": 1, "replies": []}, {"body": "$KDP because you'll be drinking 7UP", "score": 1, "replies": []}, {"body": "Shouldn't GILD be in this? How about Clorox? Throw in some SPY puts for added leverage.", "score": 1, "replies": []}, {"body": "COSTCO. Loading up for the quarantines.", "score": 1, "replies": []}, {"body": "Clorox becuz if you lose all your money from stonks you can drink it after you clean with it", "score": 1, "replies": []}, {"body": "$MDLZ because you need saltines with your soup", "score": 1, "replies": []}, {"body": "3m never wins on these things.", "score": 1, "replies": []}, {"body": "MU cuz Nothing clears up my sinus like a few stick of RAM. TSLA Idk about you but personally I hate being sick and not stylish and environmentally conscious. Deff load up on short term oil calls cuz everyone is going to be driving to CVS to buy medicine. And my personal favorite sleeper BUD cuz there is no such thing as free marketing.", "score": 1, "replies": []}, {"body": "$BUD literally owns Corona so if Corona goes up $BUD goes up", "score": 1, "replies": []}, {"body": "$KO for the Sprite and Ginger Ale sales", "score": 0, "replies": []}]}
{"title": "Easy 1.8M profit on $TSLA covered puts [ DD ]", "selftext": "[deleted]", "id": "faopsp", "created_utc": 1582862200.0, "score": 2, "upvote_ratio": 0.53, "num_comments": 32, "comments": [{"body": "Implying new tards on here have 185k lol", "score": 14, "replies": [{"body": "Do this strategy on 1/10 of the scale multiple times and anyone can afford this.", "score": 5, "replies": [{"body": "Can't sell covered calls without having the stocks in your account. Hard to do it at 1/10th scale.", "score": 2, "replies": []}]}]}, {"body": "Mods, you approve this shit but not my shit posting? Seriously", "score": 10, "replies": []}, {"body": "99% of people here cannot afford 100 shares of tesla", "score": 6, "replies": [{"body": "Buy 10 shares and re sell covered puts at 1,800 a piece. Do this 10 times and you can afford this strategy.", "score": 3, "replies": [{"body": "question. what if you can no longer afford 10 shares", "score": 3, "replies": []}]}]}, {"body": "100 x 1800....is 180k...and that’s the first of many things wrong with this post xD make money on debit spreads, buy far out calls way otm leaps and sell against them until close to expiration. Real strategy to millionaire status.", "score": 5, "replies": [{"body": "180 x 1800 / 30 days + IV of 58.6 = 1.64 million dollars", "score": 3, "replies": []}, {"body": "If your diagonal spread is big, both in strike and time, you still have insane loss potential.\n\nIf you do that as a double diagonal, it's kinda similar to just selling strangles.", "score": 1, "replies": []}]}, {"body": "Done.", "score": 3, "replies": [{"body": "Do this 30 times and you will have 30 times as much money. Trust me.", "score": 4, "replies": [{"body": "Already did it. Done.", "score": 3, "replies": []}]}]}, {"body": "What the fuck are shares", "score": 3, "replies": [{"body": "Options that don’t expire. Literally free money.", "score": 4, "replies": [{"body": "Cannot go tits up", "score": 1, "replies": []}]}]}, {"body": "1800x100=180,000", "score": 2, "replies": [{"body": "Literally free money man", "score": 1, "replies": []}]}, {"body": "Listen you fuck wits. The Iran Ambassador to the Vatican just died to the corno virus. The Pope is currently sick and not travelling with a 'severe illness'.\n\nHigh ranking public figures are going down. Strap in boys. This is going to be a fast descent.", "score": 2, "replies": [{"body": "Buy puts on $POPE, got it", "score": 3, "replies": []}]}, {"body": "1800x100=180,000", "score": 1, "replies": [{"body": "Carry the zero", "score": 2, "replies": []}]}, {"body": "Ban", "score": 1, "replies": []}, {"body": "SEC has entered the chat", "score": 1, "replies": []}, {"body": "I can only afford one share you fuck hole. Nice flex.", "score": 1, "replies": []}, {"body": "Do you have a good resource that explains this strategy? It's the first I've heard of it and all my Google searches for covered puts get me to strategies with short stock and short puts.", "score": 1, "replies": []}, {"body": "Panasonic canceling solar with tesla is kind of troubling. Why are they exiting solar if it's glowing hot? That was a huge part of this the rally to begin with.", "score": 1, "replies": [{"body": "I think tesla has other plans and the deal is being allowed to expire. 🤔", "score": 1, "replies": []}]}, {"body": "Position or ban", "score": 1, "replies": []}]}
{"title": "DIS $100 puts 03/06", "selftext": "Who the in fuck is going to disney world still? Do you want a Corona ridden fuck to sneeze right on you Mickey mouse ear wearing mfs? Seriously this shit needs to go down. I need to get these tendies before they shut down all the stores.\n\nEdit: I'm an autistic so misspelled.", "id": "faqkh9", "created_utc": 1582871841.0, "score": 25, "upvote_ratio": 0.85, "num_comments": 28, "comments": [{"body": "I’m in Disneyland now chump. I say I’ve seen maybe 20 masks. Place is busy, money is flowing.\n\nThat being said, I just don’t think it’s been really understood yet. If this blows up, you’re right, if not you’re fucked.\n\nSide note- Disney + subs would go up if more people are staying home", "score": 26, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yah let’s measure a service that is 6 months old vs one older than your great mammies tits.\n\nAny other googling you’d like to do?", "score": 11, "replies": [{"body": "I'd like to Google some of your great mammies mammaries.", "score": 4, "replies": [{"body": "You’d be disappointed", "score": 2, "replies": [{"body": "How low can they go?", "score": 5, "replies": [{"body": "Until they become balls", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "this is probably when i'd go to disney world just to avoid the lines lmao", "score": 36, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "i mean if we're all broke and dying from the virus might as well have a last tendie and dew party before the end.", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Maybe we can all pitch in and rent a trailer.", "score": 1, "replies": []}]}]}]}]}, {"body": "Tourists.\n\nEveryone around the area isn’t going.\n\nBut my family from out of the country just went.\n\nI wouldn’t.", "score": 6, "replies": []}, {"body": "Disney in Japan closed!! news announced earlier", "score": 3, "replies": []}, {"body": "[Tokyo Disneyland ](https://twitter.com/wsbconsensus/status/1233240656883179521?s=21) will be closed from Saturday until March 15th", "score": 3, "replies": []}, {"body": "[https://www.channelnewsasia.com/news/asia/coronavirus-japan-tokyo-disneyland-disneysea-closing-two-weeks-12479658](https://www.channelnewsasia.com/news/asia/coronavirus-japan-tokyo-disneyland-disneysea-closing-two-weeks-12479658)", "score": 2, "replies": [{"body": "Westward Ho! Next stop Anaheim!", "score": 2, "replies": []}]}, {"body": "Hard for Disney to see $100. But nothing’s impossible. New CEO at a time like this is just a fuck up move, not to downplay the CEO as I’m sure he is a smart guy", "score": 2, "replies": [{"body": "Did they announced who's the new Ceo?", "score": 0, "replies": [{"body": "Yeah lol. Robert Chapek who was chairman", "score": 3, "replies": []}, {"body": "Yep, Iger moves to a creative role and oversees the transition until 2021.\n\nHow does anyone make money in this sub without reading news ?", "score": 1, "replies": [{"body": "Cuz all I read is Disney change CEO and I all in DIS puts the next days, because the headline is what the markets reacts to anyway", "score": 1, "replies": []}]}, {"body": "Some jew", "score": 0, "replies": []}]}]}, {"body": "Yeah but what if this makes Disney+ subscriptions explode?\n\nThat’s enough of a growth catalyst to keep investors bullish even if parks close down imo\n\nI can see it fall but under $100? Might be a tough ask", "score": 2, "replies": [{"body": "you’re new here", "score": 7, "replies": []}]}, {"body": "Tokyo Disney is going to be shut down for two weeks. Definitely going to be a major hit. Time to buy puts.", "score": 1, "replies": []}, {"body": "china and japan Disney parks are shut down.  just have to wait and see if they will close socal and florida also", "score": 1, "replies": []}, {"body": "[deleted]", "score": -3, "replies": [{"body": "Oh sorry, last time I check this was WSB not wall street let me analyze and make rational decisions based on logic and numbers.", "score": 1, "replies": []}]}]}
{"title": "from 1k to 30k -> 254", "selftext": "[deleted]", "id": "faqsji", "created_utc": 1582873161.0, "score": 95, "upvote_ratio": 0.97, "num_comments": 35, "comments": [{"body": "Up 1,000%\n\nDoesn't realize gains\n\nRealizes autism", "score": 210, "replies": [{"body": "True symbol of retardation. He is the very example of this subreddit.", "score": 3, "replies": []}]}, {"body": "Hopefully whoever represents us in the SEC investigation, uses this as evidence as to why we degenerates can’t move the markets", "score": 68, "replies": []}, {"body": "LMAO my guy, you definitely belong here. You deserve all the extra chromosomes in the world", "score": 99, "replies": []}, {"body": "Thought that was 254k", "score": 39, "replies": [{"body": "Even if it was, I think we’re desensitized to any gains or losses under $500k", "score": 9, "replies": []}]}, {"body": "[Position](https://imgur.com/a/jRU04Xp)", "score": 17, "replies": [{"body": "Did you literally bought DD after seeing the flair here?!", "score": 10, "replies": []}]}, {"body": "damn so you're one of those \"its going back up to 40\" guys on stocktwit trying to pump the pyramid scheme company", "score": 12, "replies": []}, {"body": "You definitely belong here for putting 100% of your portfolio into a company that only has 5 employees", "score": 34, "replies": [{"body": "721 employees according to their S1. Still have no clue how they could support that many.", "score": 1, "replies": []}, {"body": "I dont think they have just 5 employees if theyre building spaceships lol", "score": 0, "replies": []}]}, {"body": "So you were counting that a company generating $500 000 **revenue, which is LESS than SOME SALARIED employees** to be worth 7 BBBIIILLLIIIOOONNN dolla?????", "score": 11, "replies": []}, {"body": "I would just like to say that I appreciate your post. I too lost about 8k this week on calls (MSFT, CRM, COST and NVDA). Seeing all these bears making thousands of dollars while I’m losing thousands hurts my feelings. \n\nYou made me feel a bit better, thank you.", "score": 5, "replies": []}, {"body": "take that $254 and all in VXX calls", "score": 5, "replies": []}, {"body": "Spy puts, you’ll make it back by end of next week.", "score": 5, "replies": [{"body": "Can he even buy any with that amount at this point?", "score": 1, "replies": []}]}, {"body": "It was never your money. You are the definition of this sub and you should be proud.", "score": 7, "replies": []}, {"body": "Buy puts on Japanese etfs and thank me later. Don’t buy space you fuck tard", "score": 4, "replies": []}, {"body": "Just trade on margin brah.", "score": 4, "replies": []}, {"body": "GUH", "score": 3, "replies": []}, {"body": "GUHH", "score": 3, "replies": []}, {"body": "Damn man, feel yer pain. Just go with SPY for now b", "score": 2, "replies": []}, {"body": "Was there a reason you didn’t start selling as it started dropping drastically? Other than that, F and I hope for your full speed recovery back to the top", "score": 2, "replies": []}, {"body": "Jesus fucking Christ man", "score": 1, "replies": []}, {"body": "Maybe you shouldn’t gamble on imaginary rocket ships", "score": 1, "replies": []}, {"body": "You belong here", "score": 1, "replies": []}, {"body": "One of us", "score": 1, "replies": []}, {"body": "Did the same for tsla bought at 785 was waiting for tsla to hit 1k and lost 14k worth of profits.", "score": 1, "replies": []}, {"body": "I think I speak for a lot us by saying,\n\nThank you for making me feel better about only making 5k when I could of easily made 40.", "score": 1, "replies": []}, {"body": "Buddy you're right where you belong. Welcome home retard", "score": 1, "replies": []}]}
{"title": "Retard market", "selftext": "[deleted]", "id": "far89t", "created_utc": 1582875824.0, "score": 122, "upvote_ratio": 0.91, "num_comments": 35, "comments": [{"body": "If this is a retard market we should thrive in our natural habitat.", "score": 72, "replies": [{"body": "This is how we win", "score": 8, "replies": []}, {"body": "No wonder Bloomberg has been on to us.", "score": 4, "replies": []}, {"body": "Sadly most people in this sub are normies and just follow the crowd. A few rare ones will actually make a wallstreet bet.", "score": 3, "replies": [{"body": "Yeah man everybody is in spy puts now. Herd mentality. That's not autism.", "score": 3, "replies": []}]}]}, {"body": "The only true retard is you.\n\nThe 40% thing is from a biased survey used to cover up failing sales. They were already losing massive amounts of beer sales as consumers moved towards IPAs. This is just a way to shift the blame.\n\n3m primary business is industrials in china. As of last earnings, face masks only accounted for 7-10%  even as orders were ramping up. They were at max capacity last month; they physically cannot increase their production.\n\nSelling low and buying lower is a fine strategy to lock in profit, so good on those boomers. Better than you holding onto a 200% return call and watching it fizzle to nothing.\n\nTl;dr OP is a fucking idiot", "score": 43, "replies": [{"body": "im gay", "score": 14, "replies": []}, {"body": "r/murderedbywords\n\nI did notice you destroyed every point except SPCE. But they ate shit today anyway and should continue to do so.", "score": 8, "replies": [{"body": "SPCE doesn't need an explanation", "score": 5, "replies": []}]}, {"body": "You might also be a little retarded too though. It's not just IPAs, but craft beer in general. Microbreweries have popped up like weed shops did in Colorado. Corona, which is a Mexican lager, doesn't have similar flavor profiles to IPAs. Now, yes, IPAs have been the dominant style of beer, but Sours (which include a shit ton of different styles) and Stouts/Porters (the only agreed difference between the two is roasted/unroasted malt) are also huge sellers.", "score": 2, "replies": []}, {"body": "You know his boomer parents are gonna panic sell again when it doesn't work immediately. They've already proven they're dumb enough for the formula", "score": 1, "replies": []}]}, {"body": "OP is mad about his $5 loss on Robinhood", "score": 21, "replies": []}, {"body": "You also can't get to space if the astronauts are zombies", "score": 4, "replies": []}, {"body": "Great technicals", "score": 4, "replies": []}, {"body": "🌈🐻➡️🌝", "score": 6, "replies": []}, {"body": "The futures are down this morning but SO ARE GOLD AND SILVER.\n\n \\- Hey guys let's panic! \n\n \\- OK! This is looking serious!\n\n \\- Let's move to safe haven!\n\n \\- AAAAAAAAAAAAAAAAAAAAAAAAAAHHHHHHHHHHHHH!!!!!!!!!!!  STFU we are too busy panicking!!!!!!!!", "score": 2, "replies": []}, {"body": "So $SPCE 17.50 leaps cuz they on sale? 2022 looks pretty good for those of us that survive.", "score": 1, "replies": [{"body": "In a recession it will be a penny stock. At book value its worth like 50 cents", "score": 1, "replies": []}]}, {"body": "Who here is betting that gold and silver are going down?", "score": 1, "replies": []}, {"body": "This is the way", "score": 1, "replies": []}, {"body": "no u", "score": 1, "replies": []}, {"body": "🏄", "score": 0, "replies": []}, {"body": "Stop using the word “retard”. You don’t sound cool. Maaany other synonyms. Thx.", "score": -13, "replies": [{"body": "Retard", "score": 13, "replies": [{"body": "There is no exact synonym for retard.", "score": 2, "replies": []}]}, {"body": "You’re in the wrong side of the internet buddy", "score": 4, "replies": [{"body": "Wow you guys are so cool. Use of degrading language demonstrates a lack of emotional intelligence. Comparing financial performance with a degrading word for someone’s mental capacity is 👌🏻.", "score": -3, "replies": [{"body": "Considering you have an askreddit thread asking if people are psychic, I'm thinking retard offends you because you are retarded.", "score": 6, "replies": []}]}]}]}]}
{"title": "What’s next", "selftext": "The market. Or macro as some of you call it\n\nI mentioned CTA’s previously. They will keep selling. Sell signals at 2900 and 2800. And we just went below the former. \n\nSupport at 2650/2700\n\nHowever. If Covid-19 causes a US recession the market could fall 50%. That’s an if. Although economic activity is just collapsing. \n\nThis is from a friend. Anonymous but v successful macro PM\n\n\nSo what are odds of recession? Well, I think odds of a large outbreak in the US are now high. So really it is about the odds of whether a large outbreak leads to recession. Maybe once it is a global pandemic they give up trying to slow it. But 5% of cases will die without serious medical intervention so they need to try to slow it down to prevent health service being overwhelmed. So I think they cannot just prioritise economy over disease containment.", "id": "fasb1q", "created_utc": 1582882705.0, "score": 33, "upvote_ratio": 0.97, "num_comments": 32, "comments": [{"body": "People need to stop confusing a stock market crash with a recession. A crash is now, but a prolonged lack of economic development, people fearing job safety, depressed spending causes a recession. We're only at the beginning of the end.\n\nAlso during a recession, stocks will go lower. Just not like now when we have 4% red days. 1%, .5% is more normal.\n\nDepending on how we react to 2800, I'm buying.", "score": 28, "replies": [{"body": "Correct. Except the reason the market is correcting is fear of a recession. That’s why it’s selling off. Not realised or confirmed yet but even a month of stalled economic activity will cause one. May already be happening. And the problem for the market and the Tesla share price is it was priced to perfection. In the matters case, doubly so. If there is a recession we are looking at market down 50% in total. Tesla is high beta so yeh don’t need me to add the fall.\n\nEdit. If it’s not clear my reply is to 1poundbookimgfee", "score": 5, "replies": []}, {"body": "Your downside risk is another 40% if there is recession. Upside is 10% if this all goes away. Can you see it just going away in a few days? No. Chance. There is no reason to buy at all.", "score": 4, "replies": []}, {"body": "My advice is don’t. There is no handle on the news flow -   It’s not peaked yet. This weekend there will be more cases and the market will react next week bc it fears recession. The upside vs downside risk right now is totally asymmetrical. This sell off isn’t done by a long way. Remember the market went up 30% last year - which was year ten of a bull. Not normal.", "score": 2, "replies": []}, {"body": "if its red its a recession.", "score": 2, "replies": [{"body": "Not true. But the market fears it hence the correction", "score": 2, "replies": []}]}, {"body": "what is this gay ass motherfucker talking about \n\nare you a gay bear or a gay bull", "score": 1, "replies": []}]}, {"body": "Economist here. Chances are very high. If the market is closed for even a month, that would devastate the economy for over a year. This could lead to a bigger recession than we would face of this ended right now. However, the hysteria, even if it correct will lead depression talks soon.\n\nAlso, drug shortage just announced.\nFirst death could happen soon in the US as the California woman in now in serious condition. \nSupply chain problems causing construction industry to slow as well.\nWorked at a government contractor yesterday and they couldn’t work on anything new until their factory reopens in China.\nThe list goes on.\nHope for recovery, prepare for the worst", "score": 10, "replies": [{"body": "Yep. And there is no handle on this news flow yet. It’s not stopping anytime soon. They’ll be hundreds of cases announced in the US this weekend. Inevitable", "score": 5, "replies": [{"body": "Hence my SQQQ, SDOW, and SPXS calls", "score": 3, "replies": []}]}, {"body": "of course the other big worry is policymakers firepower response. Rates are still very low and if there is a recession, central banks don't have much in the took box. Where we are now (in policy rates) vs where we are usually at the top of the cycle is a massive differences. 700 bps?", "score": 2, "replies": []}, {"body": ">Economist here.\n\nThat's a fancy way of saying you have no idea what your talking about", "score": 2, "replies": [{"body": "It’s a fancy way of saying i studied theories for 6 years and then can make assumptions based on stuff that happened in the past and has almost no relevance to the future lol", "score": 3, "replies": []}]}]}, {"body": "TLDR - Gay Bear says: 'I'm so fucking gay right now. Literally can't go dicks up'.", "score": 11, "replies": []}, {"body": "Recession because of a virus? \n\nPeople still have jobs, a house, take out loans, have the money to consume, etc...\nBanks aren’t falling, housing market isn’t collapsing,...\n\nIn 10 years the current situation isn’t more than just a tiny frickle on the charts. \nProfit from the fear and buy stocks.", "score": 4, "replies": [{"body": "Yes recession bc of a virus. Stalled economic activity. It’s called an economic shock and is precisely what causes recessions. It won’t be a blip either. The market will fall 50%, it was priced to perfection previously.", "score": 3, "replies": []}, {"body": "Theres more to the markets than just stock. Theres commodities and currencies as well. If those safe havens go down, and we dont have anything to help it like lowering interest rates, then well go on a full blown depression", "score": 1, "replies": []}, {"body": "companies yet to have cash flow depends on stock rises for liquidity will go under and a chain reaction. Boom.", "score": 1, "replies": []}]}, {"body": "The stop of the red will come either when Cabrona is cured or when people are literally sick of it.\n\nEither way, there is still lots of air.", "score": 1, "replies": []}, {"body": "There is no middle ground now; information is too perfect. That’s why we went up fast. Guess what we’ll go down fast to. You’re part of it, WSB is a manifestation of it. The world is different now. We’re going down fast not slow", "score": 1, "replies": []}, {"body": "Called it from the first day. It’ll drop between 2600-2700. If containment fails I think 2300 at the lowest.", "score": 1, "replies": [{"body": "If it’s an exogenous shock that causes a recession your estimate is too high. More like 1600-1800.", "score": 1, "replies": [{"body": "No fucking way that’ll ever happen. This isn’t a financial caused economic problem, it’s a biohazard one. It’ll pass sooner than later.", "score": 1, "replies": [{"body": "You are assuming it doesn’t cause a recession. Don’t know how old you are but exogenous shocks cause recessions. The Iraq invasion of Kuwait in 1990 caused a US recession. Know your history, and be modest in listening to people who were around when shocks ddi cause recessions (9/11 did too). The market at 3000 was priced to perfection. Recession was in no way priced. That’s why if there is one, it halves. \n\nLook at bond yields. The 2-year US is below 1%. That’s a huge massive flashing red light from the biggest market in the world.", "score": 1, "replies": [{"body": "That recession was short lived much like that war and soon after the market jumped 20%. War leads to economic volatility. That’s basic fin/econ 101. \n\nYields are a doubled sided story. Yields have been decreasing since the 70’s and that’s due to the growing stock market.", "score": 1, "replies": [{"body": "Lol. Ok (your comment on bond yields is whack)", "score": 0, "replies": [{"body": "Wack? It’s right. 09’ yields were low compared to 90’ and 80’ were low compared to 70’s.", "score": 1, "replies": [{"body": "Not because “the stock market”. It’s due to what is called the The Great Moderation. Look it up. \nHowever the reason yields are at a record low now is bc of Coronavirus.", "score": 1, "replies": []}]}]}, {"body": "Another amateur", "score": 0, "replies": []}]}]}, {"body": "The market hasn’t just dropped 10 bc of hype. It’s for one reason only - containment strategy may cause a recession. That’s the only reason. Will it cause one? IDK. You don’t. But if the US suddenly reports thousands of cases and uses the same containment strategies as other developed economies have, it WILL cause economic damage. That’s what this is about.", "score": 1, "replies": []}]}]}]}]}
{"title": "Where were you when the Dow Futures Broke 25k (I was here)", "selftext": "[removed]", "id": "fasgls", "created_utc": 1582883670.0, "score": 37, "upvote_ratio": 0.93, "num_comments": 38, "comments": [{"body": "we are going to need our dow 20k hats by next week at this rate", "score": 29, "replies": [{"body": "Son of a bitch, I’m already in when you said 20k", "score": 7, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Just wait, we’re hitting 20k next week", "score": 3, "replies": [{"body": "Buying /YM 20k lottos maybe the only way to make my account green again for the foreseeable future.\n\n/Shrekt", "score": 3, "replies": [{"body": "This is the way", "score": 3, "replies": []}]}]}]}]}]}, {"body": "How can anyone fucking sleep today.", "score": 21, "replies": [{"body": "With lots of puts on spy", "score": 18, "replies": [{"body": "I have them and can't stop thinking of the next play", "score": 6, "replies": [{"body": "Canned beans, cartons of cigarettes, and guns.", "score": 3, "replies": []}, {"body": "What’s the next play?", "score": 1, "replies": [{"body": "Spy 260 long exp", "score": 2, "replies": []}]}]}, {"body": "I need to stop watching boomers buy more spy for some godforsaken reason.", "score": 2, "replies": []}]}, {"body": "I cant", "score": 3, "replies": []}, {"body": "I got 5 hours", "score": 1, "replies": []}]}, {"body": "i was watching the charts when trump called\n\n'dow is kill'\n\n\"Yea but I bought puts fuck you\"", "score": 13, "replies": []}, {"body": "Punching my dick in for panic selling my 306 & 300 puts Wednesday.\n\nPunching even harder for *then* buying 320 calls think shit would trampoline.\n\nTarget was 270, and I got emotional.\n\nI'm numb, dumb, winded, and pissing red.", "score": 9, "replies": [{"body": "you dumb bitch", "score": 3, "replies": [{"body": "Worst part?\n\nDid this all in a drive thru line.  For tendies.", "score": 3, "replies": [{"body": "Were the tendies delicious?", "score": 2, "replies": [{"body": "Bittersweet", "score": 2, "replies": []}]}]}]}]}, {"body": "So what happens if they freeze the market? Can’t trade at that time right? What do we do just in case. Just sell at open to be safe?", "score": 5, "replies": [{"body": "what would it take for them to actually freeze the market? also what the hell happens to my options if the market freezes through expiration?", "score": 3, "replies": [{"body": "I mean at that point your options will be deep ITM so once the market unfreezes they will exercise and you will be swimming in tendies", "score": 2, "replies": []}, {"body": "[A lot.](https://en.wikipedia.org/wiki/Trading_curb)", "score": 2, "replies": [{"body": "\"created to prevent speculative gains and dramatic losses\" this goes against everything this sub believes in", "score": 6, "replies": []}]}]}, {"body": "I keep seeing comments on wsb about this. The market has to drop 7% in a session for a 15 min drop. Not happening.", "score": 1, "replies": [{"body": "Never say never.", "score": 2, "replies": []}]}, {"body": "Buy rice and beans, store clean water.", "score": 1, "replies": []}]}, {"body": "If it get's to 20k I'll actually order a fucking cap and car flags", "score": 7, "replies": [{"body": "Deal!", "score": 1, "replies": []}]}, {"body": "I guess October 2018 never actually ended if we actually wipe out all of 2019 gains.", "score": 3, "replies": []}, {"body": "How beautiful its red.... All you need is to stitch the up arrow one down on it and put some dates", "score": 2, "replies": []}, {"body": "[removed]", "score": 2, "replies": [{"body": "Called in from work just to monitor everything. LMAO", "score": 2, "replies": []}]}, {"body": "And here comes the annual \"No jacking off till DJIA is over 25k\" again.", "score": 2, "replies": []}, {"body": "This is conflicting. My puts will be PRINTING again tomorrow but this can’t be good for the economy", "score": 2, "replies": []}, {"body": "lol any chance of a 1987 black Monday.  dow down 22% that day.", "score": 2, "replies": []}, {"body": "It’s almost 24k", "score": 1, "replies": []}]}
{"title": "KMB - Bearvirus panic winner", "selftext": "OK, so me and my coworkers stayed up all night trying to figure out what company that's going to make a ton off money off of coronavirus that wasn't already up in the market.\n\nObviously APT already skyrocketed, and even MMM went up a little the last two days. MMM is too large to really go up just on mask sales. But there's a company that doesn't just make masks but makes ALL the stuff you need to survive coronavirus.\n\n[Kimberly Clark is the \\*\\*third largest N95 mask manufacturer\\*\\*](https://www.thomasnet.com/articles/top-suppliers/surgical-mask-manufacturer-suppliers/) by sales revenue. So that's a pretty obvious boost to mask sales, whatever.\n\nBut what happens to all the people who get coronavirus and AREN'T sick enough to be hospitalized? They sit at home coughing and blowing their nose into KLEENEX TISSUES. Only 20% or less of people with coronavirus get sick enough to need a hospital-everyone else is just at home using endless Kleenex.\n\nPeople are also **panic buying hand sanitizer**. Hand sanitizer is sold out on [Amazon.com](https://Amazon.com), all the local store shelves are empty of Purell (seriously, I checked Targets everywhere and even the stores claiming that it's in stock don't have it because they got kleptoed). [KMB is also a huge manufacturer of hand sanitizer](https://www.kcprofessional.com/en-us/products/skin-care-dispensers/hand-sanitizer) for both consumers and commercial facilities.\n\nSo we have a company that literally makes MASKS, HAND SANITIZER, and TISSUES but hasn't spiked in price yet. Sales of half the crap they make are going nuts. They're too large of a company to have a batshit run like APT but I can see this going back up to to the $150's when the public realizes KMB is selling half the shit people are hoarding during an outbreak.\n\nAll the OTHER shit they make also doesn't stop selling during a pandemic. Are you going to stop using tampons just because people have the beerflu? Are you going to let your kids shit their pants and not buy your Huggies? Hell no, all their other products will keep selling like they always have. Sales can only go up massively.\n\nEDIT: Since idiots are claiming that hand sanitizer doesn't work against coronavirus I'm gonna point out that it's [**literally recommended by the CDC**](https://www.cdc.gov/coronavirus/2019-ncov/hcp/guidance-prevent-spread.html) for preventing COVID-19 from spreading so stop posting bullshit about how it's not antiviral.", "id": "fawvbs", "created_utc": 1582905767.0, "score": 35, "upvote_ratio": 0.98, "num_comments": 35, "comments": [{"body": "You son of a bitch I'm in", "score": 10, "replies": [{"body": "Glad you printed some tendies. Finished the day up almost 50% on the 4/17 $145 calls.", "score": 2, "replies": [{"body": "4/9 144 also up 50%.", "score": 2, "replies": []}]}]}, {"body": "Found Cramer’s username.\n\nedit: having said that, this isn’t the worst idea. However, trying to go long right now is the equivalent of picking up pennies in front of a moving steamroller.", "score": 8, "replies": []}, {"body": "-10% last month. How. Even. What?!", "score": 3, "replies": []}, {"body": "$43B company but selling some more masks and hand sanitizer is going to bring them up?", "score": 2, "replies": [{"body": "They're a $43 billion company because they sell billions in tissues and hand sanitizers and soaps and masks. What do you think they sell?!", "score": 3, "replies": []}]}, {"body": "Tendies attained, went for a 4/3 $132c and am currently +122%.\n\nganggang\n\nEDIT: Annnd RH won't let me sell. gg boys", "score": 2, "replies": [{"body": "I closed out too early and locked only 100% gains...would have ended the day up over 200%. Oh well, didn’t think the rally would also pull it up this much in just one day.\n\nStill, for a DD thread where everyone just shat on my on idea I think it did pretty fucking good.\n\nToo bad RH probably fucked a lot of people though", "score": 1, "replies": []}]}, {"body": "Wonder if this is gonna [be the next $SPCE](https://youtu.be/ZaI2IlHwmgQ)\n\nIt’s all jokes mods don’t remove my comment plz", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Shhhh, this is wallstreetbets, don’t introduce any reasonable decisions here.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "True, the mainstream media ruined this subreddit tbh. Once $MSFT and $SPCE started skyrocketing and we all were posting our gains the media saw it, spread it like wildfire, and now our subreddit is more strict and is run by the bear gang 🐻🌈🤮🤢", "score": 1, "replies": []}]}]}, {"body": "3M is a huge company but the main issue is that N95 masks are a tiny part of their sales. But KMB sells multiple product lines that benefit so the impact is much higher.", "score": 1, "replies": []}]}]}, {"body": "Lol you idiot the WHO just announced masks will do nothing.", "score": 1, "replies": [{"body": "Then why the fuck does every single hospital use N95's plus eye protection for coronavirus? They're just telling people not to panic, if you're actually near someone coughing with coronavirus N95's absolutely work.\n\nYou just need to also sanitize your hands or the mask won't do shit when you rub your eyes with coronavirus covered hands.", "score": 6, "replies": [{"body": "masks won't stop the virus, but they can stop moisture and larger expellant that the virus might be contained in.  They are recommended for people who are already sick,", "score": 2, "replies": [{"body": "Cheap shitty normal masks might not help much unless you're legit next to the person coughing on you (and even then you'd need eye protection). But N95's significantly reduce the chance of getting these infections. There's plenty of literature on it in medical journals.", "score": 2, "replies": []}]}]}]}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "why buy their products when you can buy clorox products\n\n???", "score": 1, "replies": []}, {"body": " this is interesting because 157.5C is the only one red at 23bux per contract, when everything around it are green. RemindMe! 3 days", "score": 1, "replies": [{"body": "There is a 23.0 minute delay fetching comments.\n\nI will be messaging you in 3 days on [**2020-03-02 20:13:04 UTC**](http://www.wolframalpha.com/input/?i=2020-03-02%2020:13:04%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/fawvbs/kmb_bearvirus_panic_winner/fj1iidv/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Ffawvbs%2Fkmb_bearvirus_panic_winner%2Ffj1iidv%2F%5D%0A%0ARemindMe%21%202020-03-02%2020%3A13%3A04%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20fawvbs)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "APT at the floor. will bounce with more WuFlu cases", "score": 1, "replies": []}, {"body": "I made great amount of tendies yesterday but haven’t sold yet. Any thoughts on how long to hold?", "score": 1, "replies": []}, {"body": "Dude hand sanitizer is antibacterial and this is a virus 🤦‍♂️", "score": 0, "replies": [{"body": "Hand sanitizer is **both** antibacterial and antiviral. **It's literally** [**recommended by the CDC**](https://www.cdc.gov/coronavirus/2019-ncov/hcp/guidance-prevent-spread.html) **for Coronavirus COVID-19.**\n\nIt doesn't work as well on certain viruses that have protective capsules but it works for coronavirus. Even on the viruses it doesn't work 100% for it still has some effect. There are some diarrhea causing viruses that are particularly resistant to regular hand sanitizer but that has nothing to do with this outbreak.\n\nBut honestly, sales aren't about the science. People are panic buying hand sanitizer like never before.", "score": 8, "replies": [{"body": "I like this guy. He hyperlinks his autism for full throttle retardation. You son of a bitch, I'm in.", "score": 1, "replies": [{"body": "Based on how KMB is doing premarket my calls should be worth 3x what I paid and rescue my portfolio from my other puts. My only regret is not going harder on these KMB calls and instead going so hard on TQQQ puts.", "score": 1, "replies": []}]}]}, {"body": "The virus sheathed in a lipid, alcohol breaks that barrier down.", "score": 2, "replies": []}, {"body": "And not to mention that KMB produces masks too, which has been said that won’t do anythinf", "score": 1, "replies": []}, {"body": "Most people dont know the difference.", "score": 1, "replies": []}, {"body": "most masks don't stop the virus not stopping asia from wearing them", "score": 1, "replies": []}]}]}
{"title": "Annual Dow 25k Block Party Thread 🎉", "selftext": "Official petition to make this a national holiday. Please leave your signature below to show your support and tell us where you were when the Dow Jones hit the glorious 25000 point milestone. Let’s make this a yearly celebration. Hell, take the wife or kiddies out for a celebration dinner this weekend at Hooters with all of your newly found tendies. Surely, they can pass this tradition down to their children and grandchildren as well.\n\nThanks for making a difference you pieces of garbage 💜", "id": "faxomy", "created_utc": 1582908917.0, "score": 243, "upvote_ratio": 0.96, "num_comments": 35, "comments": [{"body": "Hugh Janus", "score": 60, "replies": [{"body": "deleted  ^^^^^^^^^^^^^^^^0.6586  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/76438)", "score": 7, "replies": []}]}, {"body": "https://www.reddit.com/r/wallstreetbets/comments/bugpfq/dow_25000_block_party_thread/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nThe original block party. We almost made it a year.", "score": 26, "replies": []}, {"body": "Here's one from me and all my friends:\n\nMike Oxlong\n\nHugh Jazz\n\nErec Shawn\n\nNick Gurr\n\nMike Hunt\n\nLou Saynis\n\nDan Glebals\n\nMoe Lester\n\nDee Snuts\n\nPat Megroin\n\nPhilip Mcrevis\n\nGabe Itch\n\nDixie Normous\n\nBarry McKockiner\n\nRay Piste\n\nHugh G. Rection\n\nMike Litoris\n\nVah Jyna\n\nJakmeov\n\nKlee Torres\n\nGabe Horn\n\nHaywood Jablowme", "score": 35, "replies": [{"body": "I’m calling bullshit on these names, you don’t have that many friends.", "score": 18, "replies": [{"body": "Your right, I only have two friends and they're imaginary", "score": 4, "replies": []}]}, {"body": "You forgot Gabe Oytoucher", "score": 8, "replies": []}, {"body": "Mytur Binsiderty", "score": 1, "replies": []}]}, {"body": "Lou Sasole", "score": 9, "replies": []}, {"body": "Haywood Jablomie", "score": 8, "replies": []}, {"body": "20k 🌈 🐻 yacht party on 3/20. Magic Mike will be the guest of honor.", "score": 10, "replies": []}, {"body": "Perhaps we could start a clothing rental business where \"Dow 25k\" hats and undies can be reused each year to save the environment.", "score": 5, "replies": []}, {"body": "Drew Peacock", "score": 3, "replies": []}, {"body": "Seymour Butts", "score": 3, "replies": []}, {"body": "Wait for the 20k Block Party", "score": 2, "replies": [{"body": "785 1980 party. free blow and aids for all.", "score": 4, "replies": []}]}, {"body": "Gayman Vasquez", "score": 2, "replies": []}, {"body": "Drew Peacock", "score": 2, "replies": []}, {"body": "Ivana Hanjob", "score": 2, "replies": []}, {"body": "Reed Ahrd", "score": 2, "replies": []}, {"body": "Phil McKracken", "score": 2, "replies": []}, {"body": "Jack Meoff", "score": 2, "replies": []}, {"body": "RSVP for Hugh Jass", "score": 2, "replies": []}, {"body": "RSVP for E. Norma Stitz", "score": 2, "replies": []}, {"body": "Hobo Lover", "score": 1, "replies": []}, {"body": "Noah Tendy", "score": 1, "replies": []}, {"body": "George Fück", "score": 1, "replies": []}, {"body": "Great Scott", "score": 1, "replies": []}, {"body": "Arazmus B. Dragon", "score": 1, "replies": []}, {"body": "[deleted]", "score": -4, "replies": [{"body": "Good one Sal", "score": 1, "replies": []}]}]}
{"title": "This is not priced in not a single bit.", "selftext": "Hey autists, your bro here.\nFirst: your mum is a hoe.\nSecond: just took a fat ass needle in my gums from my dentist and he was mad af. With my half working tongue I asked his ass “why you mad , doc”.\nHe said the fucking teeth and crowns and fillings and everything else is made is china, and nothing is going to get shipped any time soon. He said that they have to take new prints for every patient when they can ship again.\nIf we fucking rally on Monday know to load up on puts, not everyone is prepared of insured from a fucking aids like dis.\nLastly: fuck your mum.", "id": "fb2w1r", "created_utc": 1582929270.0, "score": 27, "upvote_ratio": 0.76, "num_comments": 32, "comments": [{"body": "Too much word. I think OP meant “Buy Puts”", "score": 29, "replies": [{"body": "You are a pure autist, yes I sajd buy puts", "score": 5, "replies": []}]}, {"body": "dental student here. this is confirmed. in our clinics we can't get anything for our patients, 3-4wk back log. I held my YOLO puts into the weekend praying for a bloody monday so I can pay off my student loans", "score": 17, "replies": [{"body": "Lesbian here, can’t find any dental dams so I can’t go out and hook up this weekend, which means no bar hopping. Lesbians aren’t spending this weekend.", "score": 13, "replies": []}, {"body": "Dentist here. Confirmed. All my lab cases up to 3 weeks ago have yet to be returned.", "score": 3, "replies": [{"body": "Do you think the US labs are also reliant on China?", "score": 2, "replies": [{"body": "Exactly, that's what I believe is delaying my cases. Send everything to a bigger lab in my region, who sends things they dont want to do like metal frameworks to other labs", "score": 3, "replies": []}]}, {"body": "You send lab cases to China?", "score": 1, "replies": [{"body": "No but my lab sends certain things out, like frameworks for RPDs, which are the main things I'm waiting on", "score": 2, "replies": [{"body": "Ah OK, that makes more sense.", "score": 1, "replies": []}]}]}]}]}, {"body": "Hey I'm a dentist. If your guy is getting his shit from gyna you should get a new guy. Good dentists only use expensive American garbage not expensive Chinese garbage.", "score": 5, "replies": []}, {"body": "Didn't laugh. Ban.", "score": 18, "replies": []}, {"body": "what positions you thinking? I know of no dentistry delivery company", "score": 6, "replies": [{"body": "Smiledirectclub calls", "score": 6, "replies": [{"body": "damn wish I bought puts before markets closed", "score": 1, "replies": []}]}, {"body": "Henry schein", "score": 1, "replies": []}]}, {"body": "Tl;dr puts on everything i see that went green today", "score": 3, "replies": [{"body": "Shhh they are watching.\n\nThis has been the way for weeks. Green Day? Puts for next day, red day? Calls for next day and so on.. it's been a beautiful thing.", "score": 2, "replies": [{"body": "You mean like when there is volatility in the market you can do calls and puts at the same time and.make money by timing when you sell them such as on green or red days?", "score": 5, "replies": [{"body": "Stop! Me learn to much, me brain hurt!", "score": 2, "replies": [{"body": "Why use many word when few word do trick?", "score": 3, "replies": []}]}]}]}]}, {"body": "Fahk, I should've made my appointment last month. My teefs gonna hurt through these massive put tendies", "score": 3, "replies": []}, {"body": "Ban", "score": 2, "replies": []}, {"body": "Dentist here, the only issues we're having are ordering masks. No other supply issues yet.", "score": 1, "replies": [{"body": "Hey another dentist. What's up guy.", "score": 1, "replies": [{"body": "What up, let's party.", "score": 1, "replies": [{"body": "I made more this month trading than I have in the last six months practicing. Why am I even going into the office anymore lmao.", "score": 4, "replies": [{"body": "And in the past week, I've lost all of my trading profits from the past 6 months. Funny how that works.", "score": 2, "replies": []}, {"body": "The next Burry.", "score": 1, "replies": []}]}]}]}]}, {"body": "This shit sucks", "score": 1, "replies": []}, {"body": "china already back to work", "score": -3, "replies": [{"body": "Proof or ban", "score": 3, "replies": []}]}]}
{"title": "Is it better to buy SPX puts or VIX calls?", "selftext": "Taking notes for the next *correction* opportunity 😉\n\nWith **VIX calls** you don't necessarily need to pick the *direction* of SPX, though I understand it *typically* rises when SPX drops...(however, it doesn't seem to be always correlated)?\n\n**SPX puts** seem more predicable than **VIX calls**, but VIX calls seem to offer the better return, at least this week.", "id": "fb3233", "created_utc": 1582930059.0, "score": 19, "upvote_ratio": 1.0, "num_comments": 38, "comments": [{"body": "SPY calls and VIX puts it is.", "score": 40, "replies": [{"body": "lmao, actually VIX puts might be my play on Monday", "score": 12, "replies": [{"body": "already got some today", "score": 5, "replies": []}]}, {"body": "you could make people lose a lot of money with comments like this😂", "score": 1, "replies": [{"body": "Can’t make me lose it if I already bought the puts🙄", "score": 2, "replies": [{"body": "🌈 so you my friend are not amongst the group of people I’m referring to in my comment. 🌈", "score": 1, "replies": []}]}]}]}, {"body": "Its 80% correlated", "score": 4, "replies": []}, {"body": "Both have been printing for me.  SPX faster price action.", "score": 3, "replies": []}, {"body": "So I won on VIX bet yesterday that is skyrocketing still. Problem is it seems impossible to more than fumblefuck guess.", "score": 3, "replies": []}, {"body": "There is actually something to be said about the effectiveness of Vix products as a hedge vs. Spx Puts. I would encourage any WSB-er to buy the front month VIX future as a hedge rather than puts. That's just because the puts require more science to price and you're more likely to eff up.", "score": 2, "replies": [{"body": "How do this", "score": 2, "replies": [{"body": "Well first off don't buy it if it's over 50 because vol is mean reverting.\n\nNext:  fit a line to spx returns and Vix front month future returns. Even just using the last 15 days would be kinda okay. Call the slope Delta.\n\nFinally solve for the amount of Vix front month to buy to neutralize your spx (ie so that total return is zero)\n\nDon't hold this all the time, only when a virus is raging in Asia. \n\nIf you had done this last Friday you could have been totally protected with about 5% of your capital in something that has pretty reasonable cost of carry.", "score": 3, "replies": []}]}, {"body": "> I would encourage any WSB-er to buy the front month VIX future as a hedge rather than puts. That's just because the puts require more science to price and you're more likely to eff up.\n\nThat's what I was trying to say, the SPX would be harder to predict.\n\nWhat do you mean front month? And why not VIX puts instead of futures?", "score": 1, "replies": [{"body": "The Vix options are very illiquid. I mean I have to trade them for my job but I don't wish that pain for tender idiots like wsb.", "score": 3, "replies": [{"body": "You seen the price action on SPY option orders? The bid/ask spread changes every couple seconds. You could submit a buy order for a debit spread and have it filled moments later at a grossly higher price than the going rate a couple minutes later.", "score": 1, "replies": [{"body": "All this lends itself to easily effing up but you're not wrong.", "score": 2, "replies": [{"body": "Right, I'm saying that (esp. in a frenzied market day like today) all the big etf's are insanely liquid and the option order chains are crazy volatile", "score": 1, "replies": [{"body": "Etf's don't track perfectly especially when vol is high.", "score": 2, "replies": []}]}]}]}, {"body": "I thought they were super liquid? how is that 50-cent buyer buying millions at a time?", "score": 1, "replies": [{"body": "They are easy to buy, hard to sell under ordinary circumstances. They are also European, so if they don't go ITM before expiry, you're out of luck.", "score": 1, "replies": []}]}]}]}]}, {"body": "Yes", "score": 2, "replies": []}, {"body": "Why not both?", "score": 2, "replies": []}, {"body": "I'd hold off buying vix calls until we get back to 18-30. If NYC or los angeles announces they are going into 2 week quaruntine, or a huge 1000+ person outbreak in a major city, that's when vix calls are gonna pay bank.", "score": 2, "replies": []}, {"body": "VIX option doesn’t work like any other option. VIX options are priced to VIX future with the same settlement date. If you understand VIX options, then buy VIX calls otherwise u might get some unexpected results. If I were I’d just go long on UVXY.", "score": 1, "replies": [{"body": ">VIX option doesn’t work like any other option. \n\nis this like SPX options?", "score": 1, "replies": []}]}, {"body": "You mean UVXY, not VIX right? Stay glued to your terminal if you do, that shit can move fast!!", "score": 1, "replies": []}, {"body": "take that money and allocate it to horse racing boom no beer virus there", "score": 1, "replies": []}, {"body": "Bought uvxy shares today and got fucked over.  My dumbness buying at open around $25.50.  was expecting another 20% up but it did the opposite and now it's trading around $22.90\n\nI didn't sell, so how fucked am I come Monday", "score": 1, "replies": []}, {"body": "When buying calls and puts, how far in advance do you look for expiration?", "score": -1, "replies": [{"body": "Same day", "score": 5, "replies": []}, {"body": "Ban", "score": 1, "replies": []}]}, {"body": "Did you see spy lately ? Things going to the moon", "score": 1, "replies": [{"body": "Wait til more CV news comes out you ding dong this is just a bandaid on a fatal fucking wound", "score": 4, "replies": [{"body": "Rocovered today’s losses after hours", "score": 1, "replies": []}, {"body": "Priced in", "score": 1, "replies": [{"body": "lol", "score": 1, "replies": []}]}]}]}]}
