{"title": "TSLA is overvalued - I'm Out....", "selftext": "Musk didn't come through for me - during earnings...  \n\n\nI'll come back when they are the same price as GE/Ford/Nio", "id": "am1fo7", "created_utc": 1549023431.0, "score": 0, "upvote_ratio": 0.36, "num_comments": 61, "comments": [{"body": "ok bye", "score": 50, "replies": []}, {"body": "I'm constantly bewildered by the belief that a growth company showing explosive growth and huge potential for more continued growth for many quarters to come is somehow a disappointment. Especially after two wildly successful quarters in a row and strong positive cash flow outlook for the foreseeable future. It's like demanding Amazon or Google two decades ago to stop growing and rest on their laurels. ", "score": 12, "replies": [{"body": "It's because they are never gonna be profitable and 3Q2018 was a one-off and, and... but 2019 will be difficult, and demand, and fraud, and panel gaps, and ", "score": 10, "replies": []}, {"body": "Can you explain why a company in the midst of \"explosive growth\" has to cut $2k off the price of all their cars?", "score": 1, "replies": [{"body": "That tax credit expired... the cars effectively became more expensive.", "score": 2, "replies": [{"body": "But that's a non-issue if demand is there.  Unless you're saying demand was exhausted at $46,000, and now there's a whole new group of people at $44,000 - in which case how long will that bump demand?  A week?\n", "score": 2, "replies": []}]}]}]}, {"body": "On a pure numbers situation, the stock is overvalued, you are correct, but so are a number of other companies.\n\nWhen will Tesla reach its correct value? Well I'm not sure, but before you posted this I was working out some math.\n\nAverage PE for auto companies is 15, so at a price of 300 the yearly earnings should be $3.5 billion(ish) ... they are not doing that.\n\nNext year should be about 9 billion in revenue,, 750 million in earnings - so $62 a share.\n\nbut what about future years?\n\nWell if you see them doing in 2025 the following: Roadster, Semi, Model Y, Model 3, Tesla Truck, S&XS and a small car ... at decent volume, at 12.5% margin similar to BMW, then you get a 15 PE of $1,286 ... So yea, we are over valued for now, but undervalued for where it could be.\n\nNotice I didn't include Tesla Energy in the 2025 model, that is a wild card. Also note I didn't include FSD taxi service, another wild card. Tesla simply as a car company could easily be worth $800 to $1000 dollars in 5 to 6 years, with some very big wild cards thrown in there for measure. EDIT: Waymo, was recently valued at well over 150 billion, so if tesla happens to crack that nut first or at scale, well then the valuation of the company from $50 billion will be MUCH higher ...\n\nNone is any of this easy, is there risk, of course.\n\nIt's likely we will see little growth in the stock in the next year, it will ping pong slowly back up to $400, but once the path becomes clear, the price will rise to a decent level.\n\nEDIT: mixed up some numbers, fixed the $20 billion to read $3.5 ..", "score": 9, "replies": [{"body": "At a PE of 15 then $20 billion of earnings equate to a share price of $1675*\n\n(*assuming 179,026,000 shares outstanding as used when calculating GAAP in latest quarterly earnings letter).\n\nEarning would need to be ~$3.58 billion to support a $300 stock price.\n\n$750 million earnings would be $62.", "score": 3, "replies": [{"body": "ahhh .. i messed up revenue and earnings there ... was trying to do a quick post, it went longer than planned. I'll fix it\n\n&#x200B;", "score": 2, "replies": [{"body": "This bit is messed up too, because it's false:\n\n> **On a pure numbers situation, the stock is overvalued**\n\nThe TSLA cash metrics are actually off the charts, indicating fair value well north of $500, with no growth premium ...\n\nQ4 again showed extremely robust cash generation and confirmed that Q3 wasn't an outlier.\n\nThe \"GAAP profit\" based metrics are artificially lowered by a number of temporary factors that have no impact how well Tesla can generate cash and grow using that cash.", "score": 1, "replies": [{"body": "I know this, but I was going the simplistic approach. Also because I don't have a full grasp of the complex accounting methods they use for their numbers. I run a pretty simple solo business as my main work, I don't really do the crazy accounting corporations do. \n\nThe crazies over at Wallstreetbets (my train wreak watching sub) posted a chart of the first ten years of amazon and tesla as far as revenue growth, it's really crazy to see how fast it's grown.\n\n[https://i.redd.it/odddlcdgoyd21.jpg](https://i.redd.it/odddlcdgoyd21.jpg)", "score": 2, "replies": [{"body": "> I know this, but I was going the simplistic approach. Also because I don't have a full grasp of the complex accounting methods they use for their numbers.\n\nSo it's pretty simple: take two quarters of free cash from operations, add back every current expense that is discretionary and growth oriented: almost all of capex, the R&D part of opex and interest payments.\n\nFrom this we get true cash generation of around ~$2b per quarter, ~$8b cash per year, which with a 15x-20x P/E multiple gives a corporate valuation of $120b-$160b. Per share that's $690-$930.\n\nThis is what Tesla would be worth today, roughly, if they stopped growing today and concentrated on only milking their cash cows.\n\nOf course they are doing none of that and are growing big time into a 2-3 trillion dollars per year EV market by building more Gigafactories and expanding their existing Gigafactories: they have high capex and lots of R&D to capture as big a pie of that future market as possible (which market is 5x-20x larger than Apple's markets, combined ...) - but how the end result will be valued is more uncertain for that reason.", "score": 1, "replies": [{"body": "I agree with all your points... Tslaq on the other hand thinks it's all gone to crap as the ball dropped at midnight nye 2018.", "score": 2, "replies": [{"body": "> Tslaq on the other hand thinks\n\nThe $TSLAQ cult is simply a group of criminals at this point.", "score": 2, "replies": [{"body": "It's counter culture, trolling and conspiracy theories all wrapped up into one. It's fascinating to watch it play out on Twitter", "score": 1, "replies": [{"body": "The $TSLAQ cult is partly a counter culture, but also helped by professional fraudsters and con-men who are doing it for the profit. A bit like the cryptocurrency scene.", "score": 3, "replies": [{"body": "Proof?", "score": 1, "replies": []}]}]}]}]}, {"body": "Wait, did you just use revenue before expenses to value a company at current market multiples? Anyone reading this should know this is completely wrong and not how any reasonable, knowledgeable investor would value a company. P/E is price to earnings, earnings means profit. Revenue before expenses is not earnings, because you do not earn what you have to spend. I.e. minimally informative, maximally misleading", "score": 1, "replies": [{"body": "> Wait, did you just use revenue before expenses to value a company at current market multiples?\n\nCash flow based valuation is a standard valuation method too and it's not the only metric as the GAAP profit or revenue based metrics.\n\nIn fact it's probably closer to the real valuation, where corporate valuation is the \"sum of all future cash flows\".\n\nIs it imperfect? Sure, just like GAAP P/E based valuation.", "score": 1, "replies": [{"body": "But you removed a massive amount of R&D spending and interest. Your assumption is based off the company not still innovating like they have? And you assume they won't have debt?\n\nThat isn't how this works.\n\nJust want to make sure people don't take your number as anything reasonable or factual, cause its not.", "score": 1, "replies": []}, {"body": "Also where did you get a 15-20 multiple? That is way higher than the industry avg, even factoring that Tesla is not purely a car company.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Um the car companies Ford and GM are trading at PE 8?  15 is the average company.  Bears like to compare it to a car company.  Bulls like to compare it to a tech stock with PE 30.  \n\nEither way the biggest issues are growth stocks are hard to predict. I saw a lecture once, exponential growth is hard to understand. And by the time most people figure it out, it’s too late.  This was in defense to city planning, but the same applies here. ", "score": 2, "replies": []}, {"body": "> On a pure numbers situation, the stock is overvalued,\n\nI wish people didn't make this concession. Usually they use the word 'According to the fundamentals..'. The 'pure numbers' or 'fundamentals' when translated to the exact methodology being used are almost always nonsensical and naive like 'Tesla p/e is too high for an automotive company'. Companies are valued roughly as the most probable outcome of the sum of future cash flows over many many forward years.", "score": 4, "replies": [{"body": "I guess I could say on current profitability numbers, but as others have said, the price is what the market decides it's worth.", "score": 3, "replies": [{"body": "'The price is what the market says it is' actually devolves into meaningless recursion. It has to be pinned to something or giant companies like Apple could be valued like tiny companies.", "score": 2, "replies": []}, {"body": "Price is what you pay, value is what you get.", "score": 1, "replies": []}]}]}, {"body": "The stock is never over valued. A free market price mechanism is the only way to determine the value. It’s correctly valued with every tick of the market. Using any other method to try and decide if a stock is under/over valued is a fools errand. Buy growth.", "score": -1, "replies": [{"body": "book (intrinsic) value and market value are two different things, see the Tulip craze in Holland as the best extreme example. ", "score": 3, "replies": [{"body": "I don’t really believe that intrinsic value is a real thing. ", "score": -1, "replies": [{"body": "When buying a stock you are predicting that the stock will go up in the future, you can not do that without referencing some set of reasons for that which one could define as 'intrinsic value'.\n\nIt just doesn't look anything like 'fundamentals' or 'p/e' as used by most retailers.", "score": 2, "replies": [{"body": "Sure you can... as long as you correctly anticipate finding a buyer who doesn't look at intrinsic value either.\n\nI think the real 'intrinsic value' (assuming you don't really care about *control* of the company, is the amount you'd get in dividends if, for some crazy reason, you could *never* sell the stock.\n\n\n\n\n\n", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Don't let the door hit ya where the good Lord split ya, peace.", "score": 3, "replies": []}, {"body": "Kick rocks sir", "score": 6, "replies": []}, {"body": "> I'll come back when they are the same price as GE/Ford/Nio\n\nWeird choices .. market caps of ~~35B, 85B, and 6B~~ 85B, 35B, and 6B respectively .. in other words, all totally different valuations. Tesla sits somewhat higher than the middle at 58B, but if it lowered to their average, it would be 42B, ie. share price of $200 at current split... Nowhere near the price of Ford.\n\nIn short, I think you haven't considered the current split of stock as compares with those other companies you mentioned.\n\nEDIT: swapped", "score": 3, "replies": [{"body": ">> I'll come back when they are the same price as GE/Ford/Nio\n\n> Weird choices .. market caps of 35B, 85B, and 6B respectively \n\nNote, there appears to be an transposition typo.  Ford is at $35B(https://www.google.com/search?q=ford+market+cap), not GE.", "score": 1, "replies": [{"body": "Oops, thanks!", "score": 1, "replies": []}]}]}, {"body": "So is netflix or amazon. Its about the future and every car tesla can produce will definitly find a customer for the next 10 years straight. The biggest thing going for tesla is the fact that a lot of big mistakes have been done in the best and wont be done again in the future. This company learns and adapts quickly and all future products will leave a much smaller dent financially and mentally. Sit down and watch model Y and the china factory, son.", "score": 3, "replies": []}, {"body": "I look forward to commenting on this in a month.  Nothing dumber than retail investors", "score": 4, "replies": [{"body": "How do you summon that reminder bot again?\n\nRemindMe! One month", "score": 1, "replies": [{"body": "RemindMe! One month", "score": 1, "replies": [{"body": "I will be messaging you on [**2019-03-02 00:47:11 UTC**](http://www.wolframalpha.com/input/?i=2019-03-02 00:47:11 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/teslainvestorsclub/comments/am1fo7/tsla_is_overvalued_im_out/)\n\n[**CLICK THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/teslainvestorsclub/comments/am1fo7/tsla_is_overvalued_im_out/]%0A%0ARemindMe!  One month) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! efk7lxt)\n\n_____\n\n|[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/)\n|-|-|-|-|-|-|", "score": 1, "replies": []}]}]}]}, {"body": "Make sure you sell AMZN and CGC also.", "score": 2, "replies": [{"body": "CGC - got it. This is the reason for Elon to smoke weed ($420, remember?). So, your bet, Tesla will pivot to Amazon scale pot retail business, with autopilot, I guess. :)", "score": 1, "replies": [{"body": "Autopilot + pot + shopping? Now that would be a stock!", "score": 1, "replies": [{"body": "$1T market cap by 2025 for sure ", "score": 1, "replies": []}]}]}]}, {"body": "Have some good fun waiting....  Quick hint, It ain't happening without an absolute dire situation, Which is looking more unlikely by the day to happen...", "score": 3, "replies": [{"body": "The only reason they are so high is speculation - you might consider it a meme stock like weed", "score": -13, "replies": [{"body": "Or have you truly considered everything that the company does ?\n\nIts not just based on cars. There is more to the company than that.\n\nHonestly, You are either here trolling, Or you have failed to do any real research about the company before investing.", "score": 6, "replies": [{"body": "Yep - and if you listened to their earnings - Tesla Solar is on life support while he sells cars and the CFO exit is a 'significant loss of institutional knowledge'", "score": -8, "replies": [{"body": "Once again you are showing that you fail to grasp the basics of the company...\n\nYou address the solar \"Being on life support\", Which it is not, You also ignore their rollout coming this year of it. (Finally)\n\nYou fail to address the battery division which installed 1Gw of storage around the world in 2019, And will be increasing to 3 Gw installed throughout 2019.\n\nYou fail to address the fact they are still making a 20% margin on the cars they make, With plans to rollout a Model Y soon and the roadster soon after.\n", "score": 10, "replies": [{"body": "Stock is overvalued...regardless of these things", "score": -5, "replies": [{"body": "So why is the stock overvalued ?\n\nBecause I just listed a bunch of things that contribute to why its value is so high compared to traditional car manufacturers...\n\nAnd your only reason is what ?  You feel like it is ? You know its bad practice to let your emotions do the investing...\n\nIf you want to short or bail when it has room to climb, You do you, But don't start whining when you are losing your money on it because you can't seem to do your research.", "score": 3, "replies": [{"body": "https://www.ibtimes.com/tesla-layoffs-saving-model-3-leads-1000-employees-fired-california-2758439\n\nRead the news....this stock will come down", "score": -2, "replies": [{"body": "Wait so you think that because the stock may goes down over a small and insignificant report of a minor layoff in a company ( that had an exponential growth in employee count last year)  that the entire long term valuation of a company is destroyed? \n\nYou do realize they could barely keep the employee count down after the July layoff right?", "score": 8, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Bye", "score": 1, "replies": []}, {"body": "Bye Felicia ", "score": 1, "replies": []}, {"body": "How is Tesla Overvalued? I think Tesla is Undervalued. ( Please correct me if I'm Wrong )\n\n\nAll the people who think Tesla is overvalued compare Tesla to the other Car companies none of whom have the same Potential Margins, Revenue Growth or Potential.\n\n\nTSLA has the opportunity to become even bigger and better than Apple. (Apple outsource manufacturing)\n\n\nTesla does almost everything themselves owning all the costs and all the margins if done right. (I know Panasonic )\nBut this requires a huge amount of investment and hence the large amount of debt.\n\nThis debt borrowed at a time of historic low interest rates, basic Discounted Cash Flow would suggest\nThis is absolutely the right thing to do considering the future revenue opportunity. \n", "score": 1, "replies": [{"body": "*Hey just noticed..* it's your **5th Cakeday** gank_me_plz! ^(hug)", "score": 1, "replies": []}]}, {"body": "You'll be missed...", "score": 1, "replies": []}, {"body": "Baba und foi ned.", "score": 0, "replies": [{"body": "Austria ;-)", "score": 2, "replies": []}]}]}
