{"title": "Elon tweeted that there would be some Tesla news", "selftext": "", "id": "avbyu9", "created_utc": 1551262777.0, "score": 29, "upvote_ratio": 0.91, "num_comments": 66, "comments": [{"body": "Model X was renamed to Model C?", "score": 39, "replies": [{"body": "S3C Secured!", "score": 25, "replies": []}]}, {"body": "Now profile picture has completely changed to Mars. Together with “revive”\nEdit: corrected text of arrow ", "score": 3, "replies": [{"body": "It says \"Revive\"", "score": 2, "replies": []}]}, {"body": "My guesses are 1) European GF 2) Model Y unveiling date and opening date for deposits 3) Launching new product like Mega power pack 4) Hooking up with another manufacturer for joint venture. 5) Launch of Auto Pilot 3.0 together with demo that shows full level 3 autonomy. ", "score": 3, "replies": []}, {"body": "* $35k Model 3 ?\n* Model Y reveal date?\n* Autopilot news ?", "score": 3, "replies": [{"body": "Could be Model Y. He tweeted about a March 15th date long time ago. But I’ld love if it is the third.", "score": 8, "replies": [{"body": "HW3 is now in production of all cars is my guess ...", "score": 6, "replies": []}]}, {"body": "Nice guesses.", "score": 2, "replies": []}]}, {"body": "My guess is he will share an invite to the model Y reveal", "score": 2, "replies": []}, {"body": "What is it about that Elon Tusk? Never seen that on his twitter before actually... Did I miss something?", "score": 4, "replies": [{"body": "He has changed his profile picture and name last few hours", "score": 6, "replies": [{"body": "Picture I could understand a bit, but that Tusk? I'm not native English - what context is used here?", "score": 2, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "[deleted]", "score": 7, "replies": []}, {"body": "My guess is it's just Musk messing with the SEC again, and he will say something like \"the SEC has a problem with Elon Musk, but I am Elon Tusk\".", "score": 9, "replies": []}]}, {"body": "To streamline Model 3 imports to the EU, he arranged to have the President of the European Council adopt him.", "score": 3, "replies": []}]}]}, {"body": "My guess is they'll create an official Twitter for workplace announcements and he'll use the renamed account for shit posts.", "score": 3, "replies": [{"body": "you mean the already existing @Tesla ?", "score": 0, "replies": [{"body": "Oh right, good point. ", "score": 1, "replies": []}]}]}, {"body": "Let's play a fun game of conspiracy theory. Elon changed his twitter handle to Elon Tusk.\n\nBuffet wants to make an elephant sized purchase. Please enjoy the tin foil hats.\n\n[https://www.cnbc.com/2019/02/23/warren-buffett-wants-to-make-an-elephant-sized-purchase-but-says-prices-are-sky-high.html](https://www.cnbc.com/2019/02/23/warren-buffett-wants-to-make-an-elephant-sized-purchase-but-says-prices-are-sky-high.html)", "score": 1, "replies": []}]}, {"body": "Roadster SpaceX option package, surely they’d be too worried about pissing people off by revealing mY before 35k m3", "score": 3, "replies": []}, {"body": "Maybe the Standard range Model 3 is the elephant in the room... Elon Tusk after all... Probably reading way too much into his meming though. ", "score": 2, "replies": []}, {"body": "Isn't anyone worried that this could be negative news?  Elon has changed his twitter icon to mars.  No one here has suggested he might change his relationship with Tesla because of the SEC and focus more on SpaceX because of the severe penalties the SEC can impose.  Maybe he will become a \"consultant\". I hope the rise in TSLA price discounts that possibility but because Elon can be capricious and people are taking these Twitter posts so lightly it is a concern.", "score": 3, "replies": [{"body": "If he doesn't respect the SEC then he's not going to step down for them unless they force him, and I think he would make a lot more noise about it. I don't think that will happen.", "score": 4, "replies": []}]}, {"body": "I'm not good with American timezones - 2PM in California is after hours for NASDAQ right? I was gonna close one of my smaller tesla positions to short EA but maybe i'll keep it around for an extra day. ", "score": 2, "replies": [{"body": "Fuck EA👌", "score": 1, "replies": [{"body": "This wasn't a fuck EA thing tbh, I just know Anthem is gonna fall on its face and Apex won't be able to carry it. Hopefully I can still get in after Tesla's announcement (assuming it's positive!)", "score": 1, "replies": []}]}]}, {"body": "Not sure what to expect. Maybe restating debt payment made in cash on friday. Maybe reveal a model Y event date.", "score": 1, "replies": []}, {"body": "Semi Raptor Edition", "score": 1, "replies": []}, {"body": "Could Tesla become listed on an EU stock exchange?", "score": 1, "replies": []}, {"body": "Acquisition by Apple? They don't know what to do with money and just shut down their own auto/self-driving division. ", "score": 1, "replies": []}, {"body": "I'm guessing Hardware 3 announcement and demo.  \n\n\nThat would be consistent with 2018Q3's conference call's guidance of sometime 2019Q1.", "score": 1, "replies": []}, {"body": "Tusk as in [Donald Tusk](https://en.wikipedia.org/wiki/Donald_Tusk). Current president of the European Council?\n\nEuropean Gigafactory?", "score": 1, "replies": []}, {"body": "did he also just change his twitter account picture to an earth/mars pic? I hope he's not stepping down from Tesla :/", "score": 0, "replies": [{"body": "He also changed his twitter name to Elon Tusk with a little elephant.", "score": 7, "replies": [{"body": "he'll address the elephant in the room", "score": 15, "replies": []}, {"body": "You think they're getting an elephant to run the company? Or maybe the Model Y will come with a free elephant? Autopilot works on zoo trails? God get me a whiteboard quick", "score": 9, "replies": [{"body": "[https://en.wikipedia.org/wiki/Tusk](https://en.wikipedia.org/wiki/Tusk)\n\n> Elephants use their tusks as digging and **boring** tools. \n\nThis is confirmation that Tesla will merge with The Boring Company, creating a new company. Because of this, all previous SEC matters will expire and the SEC will have no more control over this new company. Elon Tusk will then tweet about taking this new company private at $420 per share.", "score": 3, "replies": [{"body": "**Tusk**\n\nTusks are elongated, continuously growing front teeth, usually but not always in pairs, that protrude well beyond the mouth of certain mammal species. They are most commonly canine teeth, as with warthogs, pigs, and walruses, or, in the case of elephants, elongated incisors. In most tusked species both the males and the females have tusks although the males' are larger. Tusks are generally curved, though the narwhal's sole tusk is straight and has a helical structure.\n\n***\n\n^[ [^PM](https://www.reddit.com/message/compose?to=kittens_from_space) ^| [^Exclude ^me](https://reddit.com/message/compose?to=WikiTextBot&message=Excludeme&subject=Excludeme) ^| [^Exclude ^from ^subreddit](https://np.reddit.com/r/teslainvestorsclub/about/banned) ^| [^FAQ ^/ ^Information](https://np.reddit.com/r/WikiTextBot/wiki/index) ^| [^Source](https://github.com/kittenswolf/WikiTextBot)   ^]\n^Downvote ^to ^remove ^| ^v0.28", "score": 1, "replies": [{"body": "Good Bot", "score": 1, "replies": []}]}]}]}]}, {"body": ">I hope he's not stepping down from Tesla :/\n\nLast year his contract committed him to staying on as CEO for 10-years.  Not that that's the end all be all, but I don't think he'll be leaving anytime soon (willingly). ", "score": 1, "replies": [{"body": "> The compensation plan doesn’t require Musk to stay on as Tesla CEO throughout the length of it, though the only other roles he’s allowed to take are executive chairman or chief product officer. Even in those roles, the CEO would have to report to him, according to the agreement.\n\nhttps://www.theverge.com/2018/3/21/17147678/elon-musk-tesla-ceo-compensation-award-plan", "score": 4, "replies": [{"body": "Good point, but as he's said a lot in the past, labels and titles aren't something they care much about.  That article also says, \"Even in those roles, the CEO would have to report to him, according to the agreement.\"\n", "score": 2, "replies": [{"body": "> Good point, but as he's said a lot in the past, labels and titles aren't something they care much about. That article also says, \"Even in those roles, the CEO would have to report to him, according to the agreement.\"\n\nAlso, anyone following Elon can see the recent transformation in his mood: I believe now he actually ***enjoys*** leading Tesla, and he knows how important Tesla is to the planet's future, which was the motivation that got him through the first half of 2018 against all the attacks.\n\nIt's also about half of his net worth, which he'd hate to see hurt seriously from stepping down as a Tesla CEO.\n\nThis is, I believe, also why opponents of Tesla want Elon to step down or removed as a CEO so badly. Elon was ***frighteningly*** effective in turning around the company into a major carmaker with insane growth, insane cash generation, with the highest profit margin on the planet. They'd prefer he not complete that process turning Tesla into a trillion dollar company. 😉", "score": 3, "replies": [{"body": "I could see him turning over most of the day to day growth duties to someone else and just focusing on FSD and so on.\n\nIf the CEO reports to him then he really is still just the CEO, but with one more layer.\n\nThe opponents want him to resign from the position under some sort of cloud.  Not because the main business is stable.", "score": 5, "replies": [{"body": "> If the CEO reports to him then he really is still just the CEO, but with one more layer.\n\nIf the CEO still reports to him then that wouldn't really be seen as a 'resignation', but as a 'promotion'.\n\n> The opponents want him to resign from the position under some sort of cloud. Not because the main business is stable.\n\nI believe competitors and their agitators primarily want him to resign so that he doesn't continue improving Tesla which is seriously disrupting the markets of others.\n\nThe $TSLAQ cult wants him to resign for a various rational and not so rational reasons.\n\nBut it's not a homogeneous crowd - the Elon hate is widespread and colorful.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Could be, he has said he is staying ceo until the company is stable. And lot of things in fact look stable now after the two profitable quarters.", "score": 1, "replies": [{"body": "Hmmmm I wonder how the stock will react to that.\n\nI'm not selling regardless. I've invested in Tesla, not Elon.", "score": 4, "replies": [{"body": "no Elon, Stock will go up right now ...\n\nI bet he steps down in his main roll, but stays on doing the important stuff he likes to do.", "score": 0, "replies": [{"body": "Maybe CTO ", "score": 2, "replies": [{"body": "And get rid of JB Straubel?", "score": 1, "replies": [{"body": "CEO", "score": 1, "replies": [{"body": "This wouldn’t hurt so much.\nBut I doubt it.", "score": 1, "replies": [{"body": "Oh I doubt it too. Just saying. If elon leaving is on the table, JB is taking CEO and Elon will just keep doing what an Elon do - Product architecture.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Stability?  Two rounds of layoffs, GC quit after two months, CFO leaving (again) and replaced by someone with an MBA and zero C-level experience, new SEC action, nearly $1B cash drop on Friday - that stability?  If this was ANY other company one of these would be seen as a massive crisis.  It speaks to the normalization of chaos at Tesla that all of this can occur and investors are calling it stability.", "score": -2, "replies": [{"body": "Yeah! Stability!", "score": 1, "replies": []}]}]}]}, {"body": "And.... He doesn’t learn. If this is a product announcement, that would be a material event.", "score": -19, "replies": [{"body": "So you have proof of him bypassing the oversight committee?", "score": 10, "replies": [{"body": "Nope, but if he did it had to be approved 2 days ago per the settlement.\n\nAt the time the SEC asked no tweet had been approved. \n\nSo it’s possible the committee reviewed it, but its threading the needle. Guess we will find out soon enough.\n\n", "score": -11, "replies": [{"body": "> Nope, but if he did it had to be approved 2 days ago per the settlement.\n\nThat's wrong, you seriously misunderstood the \"two days rule\", which is just a timeout for the authorization not a waiting period:\n\n> \"[i]f an Authorized Executive (i) further edits a pre‐approved Written Communication, or (ii) desires to release a Written Communication **more than two (2) days**, after receipt of written pre‐approval, such Authorized Executive will re‐confirm the pre‐approval in writing in accordance with this Policy prior to release.\"\n\nElon can get approval from the Disclosure Counsel to post material information in one minute, and tweet the very next minute. He doesn't have to get permission two days in advance - that would be ridiculous.", "score": 12, "replies": [{"body": "Gotcha thanks for the clearing ", "score": 1, "replies": []}]}]}]}, {"body": "Meaning? He's obviously going to announce something...", "score": 6, "replies": []}, {"body": "Bad bot", "score": 2, "replies": [{"body": "Good human ", "score": 2, "replies": []}]}, {"body": "I upvoted you because this is an important point that merits being recognized.  \n\nHowever, it could be argued that this is only an announcement of an announcement. The proper announcement that conveys any actually determinable information would be material. However, I'm no law expert. It's possible that the rules really are that strict.", "score": 2, "replies": [{"body": "I mean it’s fair criticism that Musk may have had approval for last nights tweet. \n\nBut if he didn’t, then it’s another risk. It also just seems like an odd time to poke the bear.\n\nIdk I’m pretty jaded with his tweeting, and wish he’d just let it go and let the official twitter account make that level of announcement. ", "score": 2, "replies": []}]}]}]}
