{"title": "$TSLA Daily Investor Discussion - February 20, 2019", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Q419 Earnings Official Thread](https://www.reddit.com/r/teslamotors/comments/alewpn/tesla_q4_2018_financial_results_and_qa_webcast/).\n", "id": "asm6sp", "created_utc": 1550653481.0, "score": 8, "upvote_ratio": 0.84, "num_comments": 65, "comments": [{"body": "Any ACTUAL news today? ", "score": 6, "replies": [{"body": "The Ark podcast gave a lot of new info", "score": 6, "replies": []}, {"body": "Rumors that leasing for the Model 3 will be offered soon. ", "score": 1, "replies": []}, {"body": "Yup! See the front page.", "score": 1, "replies": []}]}, {"body": "Dan Butswinkas signed the 10-K YESTERDAY and resigned today - was it the podcast?  The corrected production tweet? Something is sus - this guy was not some valley job hopper and is walking away from $Millions in incentives.", "score": 10, "replies": [{"body": "Dane Butswinkas is a superninja lawyer hired to handle SEC/DoJ crisis.This resignation could mean his silent job behind closed doors is completed and threat is no longer in agenda.", "score": 6, "replies": [{"body": "Yes, that's why he's leaving surely millions in equity that will be in the money due to his work in the past 2 months. ", "score": 6, "replies": [{"body": "The guy has money already and will go to another job that offers him the same. Millions is only a big number for us not for him.", "score": 1, "replies": []}]}]}, {"body": "These guys didn't achieve everything they have achieved by quitting the moment something minor happens.", "score": 2, "replies": []}]}, {"body": "[Kandi's EVs approved for imports into the US.](https://www.marketwatch.com/story/kandis-stock-rockets-after-its-electric-vehicles-are-approved-for-import-into-the-us-2019-02-20) ", "score": 3, "replies": [{"body": "Good for Kandi. Personally, I like my cars traveling faster than 64mph", "score": 3, "replies": [{"body": "I doubt these will really be heavily marketed to the public. Even city drivers in the US are frequently on highways.  Then again, with the full federal tax credit you'll be able to have an EX3 for like $20k or less.  If you are driving for Uber/Lyft a sub $20k EV might be the shit in terms of operating costs.      ", "score": 2, "replies": []}]}]}, {"body": "Judging by the volume, the response to all of the news seems measured so far.", "score": 2, "replies": []}, {"body": "just saw premarket go from 308 to 302... bad news incoming?", "score": 4, "replies": [{"body": "ah, here we go: https://www.cnbc.com/2019/02/20/tesla-replaces-general-counsel-dane-butswinkas.html?__source=yahoo%7Cfinance%7Cheadline%7Cstory%7C&par=yahoo&yptr=yahoo", "score": 6, "replies": [{"body": "This is important because Dane Butswinkas was brought in to deal with all of the new legal issues highlighted in the 10-K filing, detailed here: https://www.reddit.com/r/teslainvestorsclub/comments/as9eef/form_10k_filing_date_feb_19_2019/egsqoud/\n\nShout out to u/analyst_84 for his very helpful reply to that post.", "score": 6, "replies": [{"body": "In other words, not very important.", "score": -2, "replies": [{"body": "The market seems to disagree.  ", "score": 5, "replies": [{"body": "I'd like to imagine it was mostly just algorithms auto selling from reading the headlines though I could just be delusionally optimistic. Guess we'll find out in 5 minutes.", "score": 3, "replies": [{"body": "Nope, stock is badly trailing the market.", "score": 1, "replies": []}]}, {"body": "Does it? Wanna make a bet we’ll be green today? Loser can’t post here for a month. ", "score": 1, "replies": [{"body": "302.56@ the close. I win. You don't have to quit posting for a month, though.", "score": 5, "replies": []}, {"body": "I take that bet.", "score": 1, "replies": [{"body": "For you, you can’t post in real tesla for a month. You don’t post here enough for it to matter too much on your end.", "score": 2, "replies": [{"body": "If we are talking green from yesterdays close, I'm in. If we are talking green from pre market, I'm not.\n\nFWIW, I don't really care if you quit posting or not. I just like bets.\n", "score": 1, "replies": [{"body": "We have to close above $305.64, And you have to agree to not post in r/realtesla", "score": 3, "replies": [{"body": "Agreed, but If I lose I get one post to announce that I will not be posting there.", "score": 3, "replies": [{"body": "Ok ", "score": 2, "replies": [{"body": "I just came down here to say y'all are the best. Gotta make light of the pointless bickering that goes on here lol.", "score": 5, "replies": [{"body": "Yea I guess it’s a pure my team will win today bet. But if we don’t close red I think it’s a good indicator to load up on calls since the peak FUD resisted here.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "It’s for peacock specifically. ", "score": 1, "replies": []}]}, {"body": "Sorry, got tied up and didn't see this until now.  There is a chance the whole market jumps at 2pm when fed minutes are released, but outside of that would obviously be happy to take that bet.", "score": 1, "replies": [{"body": "Ok done, you have a head start", "score": 2, "replies": [{"body": "I guess see you in a month?  What's your guess on where TSLA will be then?", "score": 3, "replies": [{"body": "Yup, see you. $360 1 months from today. Once the debt notes are paid some of the manipulation will come to an end. ", "score": 2, "replies": [{"body": "Ok man, I'll take the under on that.  Not everything is a conspiracy.  ", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "https://www.reddit.com/r/conspiracy/comments/asd4dy/confessions_from_a_paid_shill/?st=JSD064KC&sh=8a604efd.   I know there are paid shills here and its important for users to understand it.  Same BS on twitter, some like Mathew battle have admited they get paid to be on the net.", "score": 2, "replies": [{"body": "That Mathew battle fellow definitely puts in the time. I see him everywhere.\n\nNevertheless, if anything that post looks fake to me. There's nothing in it that strikes me as the revelation of hidden knowledge that a paid shill might have. The whole thing is scrubbed of any information that might potentially invalidate it. \n\nI don't think anyone needs to pay for there to be obsessive fulltime Tesla haters. People like fluffer just enjoy the tribal nihilistic sport of it. Some people like stockbroker seem to think they are doing serious meaningful work. Probably similar case with peacock. Most of the leaders of TSLAQ just enjoy the attention that they can get by being good at something, even if that's just twitter propaganda, and they have no fundamental idea how to better spend their time. \n\nThe truth is that the payoff for participating on stock messageboards is so low, we are all nuts for being here. I've been paying attention to stocks for decades now and online nearly as long and people don't change their mind. Ever. When peacock or stockbroker think that just one more catching Elon or Tesla out with missed guidance, or some narrow statistic that looks unimpressive, is gonna cinch the bear thesis and end the debate they seem oblivious that bulls are not working on the same type of arguments.\n\nMost people will spend hours upon hours thinking about the stock and rationalizing out that their position is the best and most logical one, and then at some time in the future the stock will move strongly against them for several weeks in a row and they will end up rage quitting, close their position at the exact worst time, and never talk about it again. ", "score": 9, "replies": []}, {"body": "I can't imagine some of these trolls putting in this much effort without getting paid. I'm deeply invested in Tsla and don't put as much effort into tracking their every movement.", "score": 2, "replies": []}, {"body": "Yeah, I'm pretty sure there are a couple of accounts on here that Tesla pays for.  That $70 million marketing budget has to be paying for something.", "score": -5, "replies": [{"body": "Thanks for coming buddy, you know this post is about you. ", "score": 9, "replies": [{"body": "> Thanks for coming buddy\n\nMaybe wasn't the smartest move... But for cases like this, the script suggests typing \"Ok man, believe whatever you want.\"", "score": 2, "replies": []}, {"body": "Well over 80% of Tesla's shares are held by institutional investors.  It would be a complete waste of time for anyone shorting the stock to bother changing the minds of people on Reddit who own a few dozen shares.  What would make sense is for the company to play up their brand to try and drive sales.  ", "score": -2, "replies": [{"body": "Between myself and my family and friends we own over 14k shares and the FUD is effective at convincing retail who holds large amounts to sell for no good reason.  Anyways your talking points scream shill. You’re not even openly denying it.", "score": 3, "replies": [{"body": "First of all, congratulations on being multi-millionaires.  I totally believe you.  Second of all, no one gives a shit about owning a hundredth of one percent of the float.  You can't affect the stock price at all.  You could sell your entire stake and it would be less than 0.2% of shares traded in an average day.  ", "score": 3, "replies": [{"body": "And I’m one of thousands of retail investors who read about Tesla every day genius. Stop being disingenuous for once in your life.  ", "score": 2, "replies": [{"body": "You are wrong. I would value Tesla in facts as well. \n\nAs of right now, TSLA is in a situation where the stock is not likely to jump soon. Yes the product is nice, it works and people are buying it. But the large scale profitability still has to be achieved. And at the same time scaling up while also not increasing debt. \nThere is a path to do, but that’s narrow and things can go wrong during the execution. \nElon himself said in the Ark podcast that Tesla is expanding exponentially in several areas. Being off by a few months on this curve has quite some impact on the output at a certain measured point in time. \nIt could be caught up later out will have a large impact on the balance sheet at the time when it happens. See also the large swings during Model 3 ramp. \n\nI expect that in the end the tech will win. But the ride will be bumpy. ", "score": 2, "replies": [{"body": "Lol nice FUD. As to whose right and whose wrong only time will tell. ", "score": 1, "replies": []}]}, {"body": "Dude you are so on point. ", "score": 2, "replies": []}, {"body": "Ok man, believe whatever you want.  ", "score": 1, "replies": []}]}]}]}, {"body": "> It would be a complete waste of time\n\nSo why are you doing it?\n\nCan only judge for myself: yes, it is.", "score": 3, "replies": [{"body": "Because I like providing an alternative viewpoint here that is based on facts.  Hopefully some people read my posts and take a bit more critical view of the company and save themselves some money.  But there is no way anything I say on here as any impact on the stock price.  ", "score": 7, "replies": [{"body": "Haha yeah ok cool, but now, why do you really do this?", "score": 3, "replies": [{"body": "Dollar dollar bills y’all ", "score": 1, "replies": []}]}, {"body": "So you’re here because of altruism. Right....", "score": 2, "replies": []}, {"body": "Ah, so not \"alternative facts based on viewpoint\"?", "score": 0, "replies": [{"body": "More like \"facts as provided directly from Tesla's filings with the SEC\".", "score": 4, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "More like r/TSLAechochamber right?  Right?", "score": 1, "replies": []}, {"body": "Can you invite me please ? Link says it’s private ", "score": 1, "replies": []}]}]}, {"body": "I think you got it backwards there peacockey.", "score": 3, "replies": []}, {"body": "I’ve never met a FUDster who isn’t a conspiracy theorist about Tesla. They must be tightly coupled.", "score": 5, "replies": []}, {"body": "*Citation needed", "score": 1, "replies": [{"body": "Proof that there are people paid to promote individuals/companies on social media: https://www.reddit.com/r/conspiracy/comments/asd4dy/confessions_from_a_paid_shill/?st=JSD064KC&sh=8a604efd\n\nProof of Tesla's $70 million marketing budget (with no money spent on traditional advertising): http://ir.tesla.com/node/19496/html\n\n", "score": 1, "replies": []}]}]}]}, {"body": "Junk stock!", "score": -4, "replies": [{"body": "Junk Bond!\n\nhttps://markets.businessinsider.com/bonds/tesla_incdl-notes_201717-25_144a-bond-2025-us88160rae18\n\n(I mean it’s technically right)", "score": 1, "replies": []}]}]}
