{"title": "TIME FOR TSLL CALLS?", "selftext": "To start, I’m a tesla bear, it’s been overpriced for years and still is! None the less, a stock **can not** just keep going down like this. It’s been so aggressively oversold something’s about to pop, it has to. None of the other factors even matter at the moment. Either when Elon announces the CEO of Twitter or the location of the next gigafactory Mexico, it’s off to the races, and if neither of those things happen… it’s still about to happen. The company is not currently going bankrupt so it’s going to bounce, hard, before it continues its much deserved decline to reasonable levels. This is just market science, I’m surprised it’s been allowed to go this far. I tracked back the other day. On a five year chart Tesla has only been this oversold one other time. In 2019, it sold off 50% over 6 months then when it hit this same level of oversold it turned around and aggressively gained back 50% of what it lost over like 6 weeks. Right??", "id": "ztykq3", "created_utc": 1671846198.0, "score": 7, "upvote_ratio": 0.61, "num_comments": 61, "comments": [{"body": "You say it cannot keep going down like this, but it kept going up for absolutely no reason. It’s exponentially over valued and there’s no faith in the company or CEO. More car companies are investing and coming out with EVs. There’s nothing special about Tesla and buying a new Tesla is slowly becoming as popular as buying Yeezys.", "score": 39, "replies": [{"body": "It was definetly overvalued at 1T or whatever. but right its at 380b and they already had slightly more operating profit on q3 than toyota that sits at 220b valuation, while tesla sold 1/10 of the cars toyota did. And tesla is still projected to grow more year over year. So is it really overvalued right now? personally ill open a big position on TSLA after some plays that i have expire on january", "score": 4, "replies": [{"body": "   I think that you are right. I never thought that I would be buying Tesla but the fundamentals are looking like it is ready for a bounce.\n   I bought oil 2 years ago, when WTI was negative and I have held them since.  Best f..king year ever!!!!\n\n   Tesla has been getting kicked in the teeth due to politics,  same as oil 2 years ago. I sold puts this week, perhaps I will be a Tesla shareholder soon, we'll see.", "score": 3, "replies": []}]}, {"body": "Ahahhaha, yes it has the Yeezy sentiment! But still, it didn’t just keep going up exponentially. At times, for no reason at all, except market psychology and buying pressure, it stopped and rapidly declined. And then carried on, that’s about where we are here, but now on the decline we relief up for short periods", "score": -4, "replies": []}, {"body": "There is something special about Tesla… they’re collecting shit loads of data on you the same way as Facebook, Google and Amazon, which is why they’re crashing like Facebook Google and Amazon.  Evidently, data about people is worth lots of money, but less than it used to be…", "score": 1, "replies": []}, {"body": "What exponential? One cannot use such a word without providing numbers without risking looking like an idiot.", "score": 1, "replies": []}]}, {"body": "The stock can indeed keep going down", "score": 22, "replies": [{"body": "Zero is still a number, I have owned tesla shares up until just before the last split, I just lost faith in the stock.", "score": 6, "replies": []}]}, {"body": "Tslq", "score": 10, "replies": []}, {"body": "This was my thinking.  Right or wrong thought process.   Bought 2 Jan 20 $140c for $5 each today. Never owned TSLA.  \n\nOption Plan:  Catch a bounce take profit or catch some IV before earnings allowing for not a bad exit point small loss or it goes to $100 Tuesday and hold.   But seems like a lotta possible good angles.  \n\nHad I been short I would cover some shorts and maybe re-establish shorts higher.", "score": 7, "replies": [{"body": "Sounds well thought out and reasonably safe with the earnings IV backup. Good Luck!", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Tesla has received a few downgrades simply on Musk shenanigans at twitter. Stated by the analyst that they can no longer pretend the twitter circus is  not a negative factor for tesla. So it reasons that when he steps down from twitter teslas price target actually rises. I think Elon thought he was invincible and could act like a complete ass and no one would care. Turns out he was wrong. He’ll probably reel it in now, if he’s capable, turn down the personality and get back to business. And it is a favorite, not one of mine, I could never wrap my head around the price tag. But the vision and perseverance, what they accomplished, they have been extremely impressive up until recently", "score": 1, "replies": []}]}, {"body": "I’m actually considering this as well. The whales are going to pump it because it’s the opposite of what everyone thinks will happen. I know that’s simplistic and stupid, but it’s true. Pump, then dump again. Good luck to both of us when we try to do it. Looks like it hit some resistance today. What expiration you thinking ?", "score": 2, "replies": [{"body": "I started buying Jan 20 Thursday afternoon. If it doesn’t rally next week, I am going to roll them out to feb. 20. You would think if either impending announcement happens that would be enough to spur a rally if it’s ready. I wouldn’t be surprised to see Elon being vindictive and announcing the Gigafactory Tuesday to spur a rally before years end just to spite the people who harvested losses on his baby. He seems a little villainous like that, lol, good luck!", "score": 1, "replies": []}]}, {"body": "I’m bullish on $TSLL", "score": 2, "replies": [{"body": "Still bullish on it? Asking for myself.", "score": 1, "replies": []}]}, {"body": "\"This is just market science.\"", "score": 2, "replies": [{"body": "**market science  ™️**-  the combination of technicals, macros, micros, manipulations and madness.  Now don’t go stealing my jargon, damnit!", "score": 2, "replies": []}]}, {"body": "Not bad to take a shot. I mean that is what everyone does in trading at the core of it. I just wouldn't oversize on something you think should go up, because nothing has to do anything.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Yeah, it has been, but not this oversold. Go check it out. On Thursday the RSI matched a 5 year low that spurred the end of a 6 month sell-off and ignited a 6 week rally. And not so surprisingly the knife has stopped and is floating and considering it’s next move. I agree it’s probably smarter and safer to watch now for more signs, but I guess that was enough for me to start a position. I’m thinking it’s at least very close", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Then right after close Thursday Elon made his no sale announcement and it jumped 5% immediately… I thought Santa was coming and I felt lucky I just dove in. I think if the market wasn’t so undecided with all todays data releases that would have been enough", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "At the moment my feeling is the market will pretty much go sideways for the next 6 months or so. I’m starting to slowly revive my long term positions and trying to play these swings for profit while the other stuff hopefully at least stays relatively flat. Doesn’t always workout, but nothing does", "score": 3, "replies": []}]}]}, {"body": "I can tell that I don’t need to say this, but definitely don’t let me sway you into anything. I don’t need that on my conscience! It feels like the contrarian view at the moment so it’s good to hear it makes some sense to a few others. I put the 7 Jan 20 call on my watchlist last week. It’s value had been dropping fast for a month. Wednesday it dropped $50. They are kind of paused at the moment, which is different, I started adding a few Thursday and Friday. If they don’t pop buy Wednesday I’ll add a few more and roll them out to February. I was just trying to see if I could get away with the cheaper ones in hopes it happens fast", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Not a bad start… not a bad start at all", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I don’t think we will see it get back up to it’s all time highs but I do think we will see a rally and then another drop off", "score": 4, "replies": [{"body": "Me too, I think it might get back up to 175 before turning and dropping probably below 100. Just my take on it", "score": 0, "replies": [{"body": "179 now. They have some investor day coming up in March... Still holding?", "score": 1, "replies": [{"body": "No, I’m out! I actually rolled up along the way to take profits and was out before earnings dropped. I didn’t really expect it to get much above 160", "score": 1, "replies": [{"body": "\\+69% lol\n\nI'm happy you made money. Cheers!", "score": 1, "replies": []}]}]}]}]}, {"body": "It’s probably good for a hold, but I would wait for some calls until the bears hibernate", "score": 2, "replies": [{"body": "I don’t want to hold it, I think it’s still overpriced. But I do want to ride the RSI relief rally, which must be any day now", "score": 0, "replies": []}]}, {"body": "Ah yes, the classic overpriced yet oversold setup.  Good luck with that turbo 🤦‍♂️", "score": 2, "replies": [{"body": "lmao", "score": 1, "replies": []}, {"body": "Even oversold yet overpriced has its day. Have a good one Ace!", "score": 0, "replies": []}]}, {"body": "Glad I'm not the only one thinking about this...", "score": 1, "replies": [{"body": "Lol, thank you, me too!", "score": 1, "replies": []}]}, {"body": "Tulsa has to turn it around and becoming exciting eventually", "score": 1, "replies": []}, {"body": "\"a stock can not just keep going down like this.\" You must be new to investing, because it certainly can. Not only that, Tesla is extremely overpriced even now, to add to it Elon is continuously selling his shares and is ruining his reputation in which Tesla is built on. So, yeah, it can definitely go much much lower.", "score": 0, "replies": [{"body": "Yes, yes, I know. I imagine it might go down another 50%. Just read the title did ya? Reading context does seem like a hassle. I usually just go off the cuff too", "score": 1, "replies": [{"body": "I did read and that is my answer, if you think just because it is bound to bounce, because it is oversold because it did before is just wishful thinking. Just because it is oversold doesn't mean it has to bounce it could continue to decline or stay flat as well. And Elon announcing good news and it will bounce? Sure but also [https://www.theverge.com/2022/12/22/23523201/tesla-fsd-braking-crash-bay-bridge-california-chp](https://www.theverge.com/2022/12/22/23523201/tesla-fsd-braking-crash-bay-bridge-california-chp) not only that Elon has been constantly showing how much of a fool he is on twitter and causing people to see that he is just an idiot who doesn't actually know what he is talking about. Is it possible for it to bounce? Sure, but I wouldn't bet on it.", "score": 1, "replies": [{"body": "Merry Christmas! RemindME! 30 days", "score": 1, "replies": [{"body": "Merry Christmas to you too, hope you have a happy holiday.", "score": 2, "replies": []}, {"body": "**Defaulted to one day.**\n\nI will be messaging you on [**2022-12-26 13:06:39 UTC**](http://www.wolframalpha.com/input/?i=2022-12-26%2013:06:39%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/options/comments/ztykq3/time_for_tsll_calls/j1lulp6/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Foptions%2Fcomments%2Fztykq3%2Ftime_for_tsll_calls%2Fj1lulp6%2F%5D%0A%0ARemindMe%21%202022-12-26%2013%3A06%3A39%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20ztykq3)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}]}]}, {"body": "their last over sold reading before coming back up for a short sprite was much lower than it is now. Won't mention numbers, due to every indicator having different values...\n\nI'd hold off a bit...or find their bear stock straight shres or something Bail out whenever.\n\nthe market is a circus trick now to find real money. fundamentals suddenly go ignored. Crazy as a bank in charge,", "score": 0, "replies": [{"body": "No it wasn’t.", "score": 1, "replies": []}]}, {"body": "A stock can’t keep going down. Lul", "score": 0, "replies": [{"body": "Haven’t you ever noticed those zigzags on rising or falling charts? Never seen a chart that was a vertical line myself", "score": 1, "replies": [{"body": "Bro have you seen stocks like $goev\n\nIt was once $12 now it’s $1\n\nSo yes it is possible for a stock to keep going down.", "score": 1, "replies": [{"body": "This is not the debate brother, it’s a bounce play. There is money in swings. Tesla could go bankrupt, it could go to zero. But like goev, which I didn’t check out but I know for sure, unless a whole opened up in the earth and swallowed it, it did not run a straight line from 12 to 1. It had some bumps like all other falling companies. Unfortunately, when stocks fall, hardline believers try to revive them at points and sometimes cause a nice rise, then when they run out of money or conviction the decline resumes. If your savvy about it, you can ride it up for a bit and then leave. This is like stock 101 type stuff.  Anyway, Have a good evening! Happy Holidays", "score": 1, "replies": [{"body": "Do what you want. But Don’t make a post and then debate with everyone that is telling you possible situations", "score": 1, "replies": [{"body": "I intended on it, but I appreciate the permission.  These post and subs are literally made for debate. There’s no need to get snotty just because you don’t have anything relevant to contribute.", "score": 2, "replies": [{"body": "😂", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "There's your YOLO bet.", "score": 1, "replies": [{"body": "Nah, just a nice swing wager. Always live to play another day!", "score": 1, "replies": []}]}, {"body": "Lots of people said it couldn't climb the way it did. Just sayin 🤷", "score": 1, "replies": []}, {"body": "At some point there will be bounce people are going to want a chance to reload short positions again.", "score": 1, "replies": []}, {"body": "Tesla calls in a bear market! Great way to lose all your money. Not touching that stock with a 10 foot pole, let alone Options. Godspeed to Tesla bulls.. the bleeding resumes", "score": 1, "replies": [{"body": ":)", "score": 1, "replies": []}]}, {"body": "I'm posting one month after OP made this thread. \n\nTSLA just aggressively regained 50%. Good job.\n\nAnyone still holding TSLL calls (or TSLL, in general)?", "score": 1, "replies": [{"body": "Thank you brother! I appreciate the shout, it was not a popular opinion at the time I made it. I crossposted that here and WSB… those guys wanted me thrown off Reddit for the suggestion 😂", "score": 1, "replies": []}]}, {"body": "You were so right", "score": 1, "replies": []}]}
