{"title": "Next week's earnings: Are you ready for Q4 earnings season? $WFC, $JPM, $C, $DAL, $AA", "selftext": "", "id": "56gtka", "created_utc": 1475931147.0, "score": 155, "upvote_ratio": 0.9, "num_comments": 40, "comments": [{"body": "I'm ready for....Q3 earnings season", "score": 50, "replies": [{"body": "No, Q3 sucks compared to Q5.", "score": 9, "replies": [{"body": "Lousy Smarch weather. ", "score": 5, "replies": []}]}]}, {"body": "Whos buying puts on wfc?", "score": 11, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "WFC is gonna beat", "score": 8, "replies": []}, {"body": "All wfc has done is fall how did you lose money on puts?", "score": 5, "replies": []}]}, {"body": "What if the earnings arent actually bad? Also take into consideration the current stock price/discount.", "score": 5, "replies": []}]}, {"body": "$dal miss on higher oil, hedge losses, rasm decline and computer glitch ($200m)", "score": 11, "replies": [{"body": "Going to be a good deal when it drops. ", "score": 3, "replies": []}, {"body": "Got in @$37. Hope it doesn't dip below that lol. Otherwise double down time", "score": 3, "replies": []}, {"body": "I thought they were caught up on fuel hedge losses in q2", "score": 1, "replies": []}, {"body": "At what strike should we yolo our tendies money on puts?  The $37.50 and $38 FD strikes have a tight spread but are awfully expensive considering they've been floating above $38 since 9/22", "score": 1, "replies": []}]}, {"body": "what the fuck kind of company names itself dragonwave", "score": 20, "replies": [{"body": "The best company", "score": 16, "replies": []}, {"body": "I'll buy whatever they sell. ", "score": 16, "replies": []}, {"body": "They actually make some decent wireless backhaul equipment. A bit better than Ubiquiti from a reliability standpoint but not on the level of something like Ceragon or Siklu.", "score": 6, "replies": [{"body": "... You're making those names up.", "score": 20, "replies": [{"body": "nah man theyre pokemon go's or something", "score": 2, "replies": []}]}]}, {"body": "Dragon Naturally Speaking kind of company?", "score": 2, "replies": []}, {"body": "A Canadian company ", "score": 1, "replies": [{"body": "yuck", "score": 2, "replies": []}]}, {"body": "Someone who has 1037280427x more money than you ever will ", "score": 0, "replies": [{"body": "and the same amount of autism, apparently.", "score": 4, "replies": []}]}]}, {"body": "I'm... retardedly long on C. If they do well I'm out. If they don't I guess I baghold for another 8 years. Wheee", "score": 9, "replies": [{"body": "what's your avg? when did you get in?", "score": 1, "replies": [{"body": "I jumped in in 2009 I think. Just post GFC figuring they got ass fucked and would recover eventually. I think my average is 41. They've been up and down so much I just keep holding. ", "score": 1, "replies": []}]}]}, {"body": "Been riding AA for a while. Out of the two new companies they're splitting in to, finished goods branch for the win.", "score": 3, "replies": [{"body": "Same here. Been holding AA since before the RS. I really hope it nails earnings and both companies take off. Iirc, the components company will carry most of the debt, but long-term I think it will perform better than the raw aluminum company. The extra volatility of aluminum will (I hope) provide a good exit eventually- even if it tanks a little after the next split.", "score": 3, "replies": [{"body": "Generally super bullish on Alcoa given the Aluminum supply/demand http://www.kitcometals.com/charts/aluminum_historical.html\n\nI did just sell covered calls for earnings (thought earnings Monday, sold calls on Friday), but I'll be buying in again if I get assigned (or selling puts until assigned).", "score": 2, "replies": []}]}]}, {"body": "WFC will beat but slash forward guidance just watch.", "score": 2, "replies": [{"body": "Bingo. Beat, lower guidance,down 2%. You heard it here first ", "score": 1, "replies": []}]}, {"body": "When did American Eagle turn into a First Republic Bank??? such a subtle transition I never noticed.", "score": 2, "replies": []}, {"body": "Wells fargo....muhahahahahh..\n\nHey look. Its flo from progressive.", "score": 1, "replies": []}, {"body": "Short AA here...", "score": 1, "replies": [{"body": "Interesting; why? Just because of supressed aluminum prices or because of split complications? There was also a solid run up to earnings which may have been overdone.", "score": 1, "replies": [{"body": "Just lucky I guess =P", "score": 2, "replies": [{"body": "Nice; anything short would've worked out well. I got a bit fucked from my long position, but the covered call is doing what it is supposed to and sucking up some of the damage.", "score": 1, "replies": []}]}]}]}, {"body": "Holy Balls Friday is going to be nuts.", "score": 1, "replies": []}, {"body": "OZRK did me right in the past", "score": 1, "replies": []}]}
{"title": "Oil still strong or about to crash?", "selftext": "I think *poor* people just sold their oil profits, usually the people with money are still holding oil contracts, hence why we didn't see a full on fall down to sub $49.", "id": "56i2lr", "created_utc": 1475948855.0, "score": 13, "upvote_ratio": 0.84, "num_comments": 30, "comments": [{"body": "Might crash. Might rally. Might go sideways. Probably will just fuck you in the ass though.", "score": 46, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "N'aww, thanks faggot. 1 year to date.", "score": -1, "replies": []}]}]}, {"body": "I'm actually in the oil industry and I'm bullish. Just yesterday at work I counted hundreds of people filling up their tanks. Seems like now is the time to buy.", "score": 29, "replies": [{"body": "So you work at a gas station? ", "score": 20, "replies": [{"body": "Yeah, I'm in the oil industry ", "score": 49, "replies": [{"body": "Petroleum ", "score": 6, "replies": [{"body": "Jelly", "score": 4, "replies": [{"body": "Vasoline? ", "score": 4, "replies": [{"body": "soothes the intestines ", "score": 2, "replies": [{"body": "Pretty sure you shouldn't eat vasoline ", "score": 2, "replies": [{"body": "Who said anything about eating?  ", "score": 4, "replies": [{"body": "Does the anal cavity lead to the intestines? I haven't gotten to any biology gen eds yet ", "score": 2, "replies": [{"body": "If we reverse the process it appears that the rectum does indeed lead to the intestines.", "score": 2, "replies": [{"body": "May have to try that the next time I binge eat hard. Brb just ate a 25 serving bag of trail mix and a XL kit Kat. ", "score": 2, "replies": [{"body": "It would be like shorting a stock", "score": 1, "replies": [{"body": "Betting it would go straight from ingestion (the top) to down the toilet  soon?", "score": 2, "replies": [{"body": "Sounds like a Crude Oil enema ", "score": 2, "replies": [{"body": "Or Gold enema. Still can't figure out an close-->open trend", "score": 3, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "How's the tobacco industry doing?", "score": 2, "replies": []}, {"body": "Pretty bullish as well", "score": 1, "replies": []}]}, {"body": "I'm betting it will go sideways or down.  OPEC cutting production (assuming members don't cheat) will just give market share to the shale producers.  Demand isn't there, inventories need to draw down substantially for price to go up.  Path of least resistance is down.  ", "score": 7, "replies": [{"body": "Thank you for the Anal isis", "score": 7, "replies": [{"body": "anal lysis ", "score": 1, "replies": []}]}, {"body": "Demand is not there? Demand is higher than ever this year...", "score": 3, "replies": [{"body": "Relative to what?  The demand needs to be high enough to draw down  inventories from record highs.  \n\nhttp://www.howardweil.com/docs/Reports/WEEKLY%20REPORTS/REFININGReport.pdf\n\nThe  \"demand  cover\" is telling.  Regardless of the absolute quantity of barrels of oil demanded, the ratio (5-year) is typically about 25 days, and we're at  30.  This is compounded by the fact that we are way, way over the 5-year average for crude and product stocks, even higher than 2015.  \n\nWe still have a \"supply glut\".  Any upward increase will be met with moar pumping by shale producers, eating up OPEC market share.  The U.S. crude export ban was lifted.  There haven't been nearly enough bankruptcies/production stoppages imo to significantly take supply off the market.  \n", "score": 1, "replies": []}]}, {"body": "cutting production will increase prices?", "score": 1, "replies": [{"body": "Only OPEC is (at least they say they are) going to cut.  US Shale producers (not in OPEC) can respond by increasing production.  Shale has to stay alive so they will ramp production at the first sign of higher prices, driving them back down again.\n", "score": 1, "replies": []}]}]}, {"body": "It isn't expected to pass $55, so it's coming to a close. If you aren't in don't buy, if you are, watch for an exit then watch for an entrance to the inverse.", "score": 7, "replies": []}]}
