{"title": "Guesstimated upside if TSLA joins S&P500?", "selftext": "", "id": "exly5n", "created_utc": 1580635058.0, "score": 115, "upvote_ratio": 0.95, "num_comments": 98, "comments": [{"body": "We have one recent historic example: [when Twitter joined the S&P 500 in 2018 they popped by 60%+](https://www.reddit.com/r/teslainvestorsclub/comments/dtkyet/what_is_everyones_thoughts_on_tesla_making_it/f6xkujd/). (Standard warnings and disclaimers apply: correlation does not imply causation, history does not repeat, etc.)\n\nBut the price effect of TSLA inclusion into the S&P 500 is very hard to guess IMHO.\n\nHere are the key assumptions:\n\n- Tesla float, i.e. shares not locked down as 'not for sale' by insiders, is [142m shares](https://finance.yahoo.com/quote/tsla/key-statistics/).\n- S&P says that 9.9 trillion dollars of global investment funds are benchmarked to the S&P 500, and [this article estimates that Tesla could make up about 0.35% of the index when joining it.](https://www.marketwatch.com/story/more-fuel-for-tesla-stock-could-join-the-sp-500-by-the-end-of-the-year-2020-01-30)\n- The default behavior of any competent active fund manager who doesn't know much about Tesla or doesn't want to risk anything is to **follow the benchmark, i.e. buy TSLA with 0.35% of their funds**. Buying TSLA will be the ***risk averse*** move: buying less or more of TSLA than the benchmark weight will be an *active* investment decision by the portfolio manager that he'll be responsible for ... My guess is that given the unprecedented complexity of Tesla's business model and the leveraged nature of their various businesses, the \"safe\" outcome chosen by a large majority of fund managers will be to flow with the benchmark allocation of 0.35%.\n- That's a *huge* force of unprecedented magnitude: it's ~$34b of funds flowing to buy TSLA when it joins the index, buying 53 million shares at today's prices, reducing the float to 89 million shares. (!)\n- I'd like to stress that this is *unprecedented*: never before has a company with such large valuation joined the S&P 500, jumping in at around rank 50-70 ...\n- But shorts are getting squeezed out gradually as well, and I think a few major capitulations are in order as well. [25 million TSLA shares were still short two weeks ago](https://www.nasdaq.com/market-activity/stocks/tsla/short-interest), and the natural short interest of big tech giants like AAPL or AMZN is 1-2%, not 20%.\n- So if we assume that another ~15 million TSLA short position will be closed this year (the other shorts are probably debt funds with convertibles holding about ~7 million TSLA shares short as a hedge - these will be closed more gradually as the convertibles mature or get bought by value investors), this will reduce the float to about 74 million shares.\n\nI.e. if these assumptions are true then within a year the \"effective float\" might decrease from 142 million shares to 74 million shares - which is a fundamentally non-linear process, because it removes from the pool of investors the 'weakest longs' gradually: $300 price target? Long gone. $400 price target? Gone. $500 price target? Gone. $600 price target? Gone.\n\nWhat will be left is an ever increasing proportion of Tesla investors who are expecting this to be the next trillion dollar company, with a price target of $5,000+. Those investors are, for most intents and purposes, listed as \"float\" but won't really sell at current price levels, because they are waiting for catalysts that haven't happened yet. To them the current +100% upside is nice but nowhere near what they expect from the stock in the next couple of years.\n\nI.e. new buyers will be competing over an ever shrinking pie of the effective TSLA float ...\n\nThere's a secondary effect as well: removal of the 'weakest longs' leaves hardened investors who are holding since the IPO, or who bought the $180 dip in 2019. They'll be a lot harder to scare into selling, and this could reduce the depth of dips. There's been several attempts by the shorts to call a TSLA \"top\" late last year and this year already, but the resulting dips were all rather \"meh\".\n\nNote that on the flip side there's also downsides of course: the global economy could crash, something bad could happen to Tesla, etc. - this is not a prediction.\n\nBut nobody really knows the exact price target distribution of shareholders and thus the magnitude of the upcoming potential short squeeze and S&P 500 inclusion bonanza.\n\nPlus all of this is just speculation of a random stranger on the Internet, so buyers beware. 🤠", "score": 188, "replies": [{"body": "Great write up. One factor we don’t know about yet is what percentage of shares are now being bought in anticipation of the S&P inclusion (to arbitrage the effect you describe). There might be a little less buying pressure if that happens in large numbers.", "score": 33, "replies": [{"body": "If Tesla is included in the S&P, what is that timeline after announcing earnings to actually add it?  Does it take a week? A day?", "score": 13, "replies": [{"body": "This is the question options-traders need to know the answer to", "score": 6, "replies": [{"body": "[https://www.reddit.com/r/teslainvestorsclub/comments/egfhvi/tesla\\_in\\_the\\_sp500/fc89f5j/](https://www.reddit.com/r/teslainvestorsclub/comments/egfhvi/tesla_in_the_sp500/fc89f5j/)\n\nRead this comment from a while ago, by the same random stranger on the internet. Big thanks to him! /u/__Tesla__", "score": 18, "replies": [{"body": "TL;DR:\n\nAnnounced likely on a weekend at June 1 or June 8.", "score": 4, "replies": [{"body": "I'd modify the \"likely\" as \"~50% probability\" - there's still a ton of preconditions, such as decent delivery report on April 3 and $160m profits in Q1 on April 29, which Tesla might or might not achieve. Plus the S&P committee has unlimited discretion to depart from their usual protocol and include or not include companies in the index. All of these are real risks.\n\nMany have bought 2021 January options to bet on S&P 500 inclusion - by that time I think probability is well above 90%.\n\nAlso note that depending on how many investors speculate on S&P 500 inclusion the price reaction might be overly optimistic, and in principle there might also be a *selloff* after Q1 results are announced and S&P 500 inclusion becomes a high probability event.", "score": 2, "replies": []}]}, {"body": "Perfect!!! Thanks and thanks!", "score": 2, "replies": []}, {"body": "Thanks.", "score": 1, "replies": []}]}]}, {"body": "Someone answered in reply to my comment!", "score": 2, "replies": [{"body": "Thanks.", "score": 1, "replies": []}]}]}, {"body": "> One factor we don’t know about yet is what percentage of shares are now being bought in anticipation of the S&P inclusion (to arbitrage the effect you describe). There might be a little less buying pressure if that happens in large numbers.\n\nCorrect. Interestingly the industry trend since 2018, when Twitter was included in the S&P 500, is a *reduction* in such specialist hedge funds.\n\nPassive index funds probably cannot buy yet (it's uncertain whether S&P 500 inclusion will be after Q1, Q2 or Q3 results), and even for active funds, even if they are aware of the potential, it would be perceived rather risky to buy into such a steep TSLA rise, plus there are significant macroeconomic trends as well.\n\nOptions are already trading at very significant premiums.", "score": 7, "replies": []}, {"body": "I work in the financial industry and I’m fairly confident this is the case. The chances of Tesla being included in the S&P 500 are directly proportional to the run-up it has already had as a direct effect of being included. I.E. it’s already priced in. Let me repeat that, being included in the S&P is already priced in, to the amount that equates to the chances of it being included. If anyone seriously thinks they can wait until Tesla posts their first year profit and then go and buy call options right before S&P inclusión hoping for a big upswing then you’re in for a rude awakening. \n\nThese investment banks might not know as many little details in regards to Tesla and the business itself, but they are paid millions of dollars to make money on their billions of dollars they hold in the bank, they’ll do a much better of predicting short term price movement than the average user of this sub, or retail investor. \n\nI’ll link back to this comment in a few months time when we inevitably see posts about Tesla being included in the S&P and the following confusion as the stock doesn’t go up 50%", "score": 14, "replies": []}]}, {"body": "Great writeup. \n\nI wonder how many people are in the $5k+ group. I'm in it for sure but I can't imagine too many people are thinking like that. Out of the pro analysts it's basically ARK only with 15 others no where near.", "score": 13, "replies": [{"body": "So of the ~142 million shares of float, this is the estimated proportion of investors:\n\n- 25 million TSLA shares were created by shorts out of thin air, which will disappear once they close their short positions.\n- Of the rest about 50% are institutional investors with 58 million shares, of which:\n - half are long-term value investors like ARK, a total of 29 million shares\n - other half are tactical investors with shorter time horizons, another 29 million shares\n- ~58 million shares owned by retail investors, which pool was I think 'hardened' in the past 3 years when TSLA was stagnating.\n\nSo if we estimate the S&P 500 inclusion effect to result in the buying of 53 million shares there's 29 million shares from institutionals that are possibly up for grabs, but that still leaves another 24 million shares to find. Are half of retail investors 'weak longs', consisting of people who didn't sell during the dip to $180? I strongly doubt it, but I think we are going to find out - 2020 is going to be very interesting to Tesla investors. 🤠", "score": 15, "replies": [{"body": "Ark’s not a hold til several thousand dollar long term investor.  They regularly sell as the share price increases to keep TSLA to no more than 12.5% or maybe 15% of their funds.  Also if a squeeze really took off, many strong institutional investors will sell as the company valuations surpass their modeled valuation.  And if I’ve learned anything at all through this, in general large fund managers are not as smart as many on this forum, TMC Investor forum...\n\nI’m a very long term investor who was buying down to the $180’s (although not options to my chagrin:-), but I will be deleveraging some into any short squeeze.  Many other retail investors will as well.  Maybe some who weren’t millionaires bought options and now that they’ve become millionaires, decide they better diversify if the stock quickly runs up to $1500 for example.\n\nI love your thesis and it certainly sounds plausible and would make me unbelievably happy.  I just think that if the stock crosses $1k /share some tutes and strong retail longs will be selling into the rise.  E.g. Fred and Seth from Electrek who have been very strong longs, sold some just prior to earnings.\n\nOn the other hand, there will also be share buying pressure from new momentum buyers and call option writers who have to purchase shares to hedge calls they’ve written.  ReflexFunds at TMC did a great analysis and determined this provides a large magnification factor when the share price rises.", "score": 6, "replies": [{"body": "I agree with all that - the big question is the balance and timing of these forces:\n\n- If too many people speculate on S&P 500 inclusion then it might be a dud or even a \"sell the news\" reversal.\n- If there's plenty of supply of willing retail and institutional longs to sell then any rise will have a natural cap.\n\nSo I'm not making any numeric price action prediction - we'll see as the event draws closer.", "score": 2, "replies": []}]}, {"body": "I wouldn't say ARK's shares are held long term, by the time Tesla is has $1T mcap they'll have like a tenth of today's shares.", "score": 4, "replies": []}, {"body": "Will the S&P inclusion result in either:\n\n$35B being spent on shares\n\nor\n\n53 million shares being bought?\n\nThe effects are quite different.   \n\nIf they spend $35B that could be 53 million shares now, 35 million shares at $1000, or 3.5 million shares at $10,000.  If they try and buy 53 million shares, they will have to pay an awful lot more than $35B to persuade hardened investors to sell.", "score": 4, "replies": [{"body": "Number of shares, I believe: higher valuation means higher initial weight in the S&P 500.\n\nAlso note that it's just an estimate, and that a lot of funds already own a fair chunk of TSLA.\n\nThe number of 'forced' share purchases by passive index funds could be in the 10-20m shares range - which can still result in substantial buying pressure, assuming the supply of arbitraged shares is not larger - in which case there could be a selloff.", "score": 1, "replies": []}]}, {"body": "Shorts don’t create shares out of thin air. That’s naked shorting which is illegal and which no broker will allow. They borrow it from longs and especially etf and funds.\n\nEdit : Why am I being downvoted for stating a simple fact ?", "score": 4, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Yes but at two different moment in time. At no time did the number of share increased.", "score": -4, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Naked short selling does create additional shares but that is not the point. TSLA is not shorted naked. \n\nWhat you fail to understand is that although one still have exposure to share price after loaning its share, he is not in possession of the said share and thus can’t vote or sell its share (albeit you might be able to close your position thanks to compensation mechanism). In non-naked shorting, no share is created. Replace share with bricks or anything concrete if it helps.", "score": -1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Why are you focusing on naked shorts ?", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Please explain to me how non-naked shorts create share. I’m genuinely confused.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "You have to keep in  mind the number of shares \"owned\".\n\nI buy a share (1 share owned). I lend it to you (1 share owned by me still, even if I don't have possession of it). You sell it to someone on the market. Now there are two shares \"owned\" - one by me and one by the person who bought it. Of course there is only one real share, but there are two owners. I can request you return my share, and when I do, you will need to acquire one to give to me. Of course, you  can get it back from  the person you sold it to, but you will have to buy it back.Thus, from the market's perspective, you have created an additional share.\n\nThe market doesn't know that I lent you the share. All the market knows is that I bought a share and continue to hold it.\n\nIn addition, you have sold a share to another owner. Even though it is all the same share, the market has seen two purchases.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "My target isn't in dollars but years. It's in my retirement fund and I don't need to touch it. So I won't. My shares are off the market.", "score": 4, "replies": []}, {"body": "I'm in the $20,000 group. I have 30 years until retirement so I can wait.", "score": 2, "replies": []}]}, {"body": "So, for inclusion after Q1 needs a GAAP profit of ~160M, right? That’s higher than Q3 and Q4 profits...not likely to happen. However, inclusion after Q2 is basically guaranteed, bar some unforeseen complication", "score": 5, "replies": [{"body": "> So, for inclusion after Q1 needs a GAAP profit of ~160M, right? That’s higher than Q3 and Q4 profits...not likely to happen.\n\nThere's **three** wildcards in Q1 that could easily push Q1 profits beyond the ~$160m threshold:\n\n- The FCA deal earmarked well over $1b of payments to Tesla for 2020 alone. What will be the split, will Tesla get payments in Q1 already, or only in Q4?\n- Deferred tax asset value of $1.8b if Tesla auditors agree that Tesla is on a path to sustained profitability with a higher than 50% likelihood.\n- In Q3 Tesla guided for $500m FSD deferred revenue recognition in the next 12 months. Very little was recognized in Q4 I think, which leaves a bigger proportion of it to Q1.\n\nBut yes, it's one of the potential outcomes that none of these will happen - and that complications in China etc. could even cause a small GAAP loss.\n\nNote that the uncertainty works in favor of those speculating on S&P 500 inclusion: many big funds won't be able to justify such an uncertain outcome with a company with such volatile earnings.\n\nQ1 is going to be another of those interesting Tesla earnings reports. 🤠", "score": 13, "replies": [{"body": ">Q1 is going to be another of those interesting Tesla earnings reports. 🤠\n\nSeems all of them are. :D", "score": 8, "replies": []}, {"body": "*\"Deferred tax asset value of $1.8b if Tesla auditors agree that Tesla is on a path to sustained profitability with a higher than 50% likelihood.\"*\n\n**Could you expand on that?**", "score": 2, "replies": [{"body": "https://www.reddit.com/r/teslainvestorsclub/comments/eu46rj/teslas_18b_valuation_allowance_could_it_mean_fy/?utm_medium=android_app&utm_source=share", "score": 3, "replies": []}]}, {"body": "I'm expecting FSD to drop in some form in Q1 in order to boost the numbrs. FCA will be a gift to all of 2020.", "score": 2, "replies": [{"body": "I'm expecting Tesla to drop new FSD features only if they think the order book is not good enough for Q1 yet. Elon cautiously said \"a couple of months\" for feature-complete FSD in the recent interview - which could mean anything.", "score": 1, "replies": []}]}]}, {"body": "I am afraid when it comes to Q1. Elon said profitability onwards **except during production ramp-ups.** \n\nWe know model Y is coming very soon + Q1 is usually very weak (though I believe they can surprise on this front).", "score": 4, "replies": [{"body": "I agree.  I fear q1 will be weaker than we hope.  My other fear is that the long wait times may be because Tesla is modifying the Model 3 production to share the new Model Y enhancements and not because demand has increased.  Of course back porting Model Y wiring and new casting to Model 3 will be great for the long run, but we do know Wall St. is intensely short term focused and might punish Tesla for weak q1 deliveries.", "score": 6, "replies": [{"body": "Excellent.. im over here dying for a drop to buy some more", "score": 7, "replies": [{"body": "I would not wait for a dip.  Many, many Amazon/Apple/Early Tesla investors made that mistake and got left behind forever, missing out on 10X gains.\n\nI.e. Tesla will add thousands of dollars value to each share and you’re risking that to make 10’s of dollars per share.  There’s a very good reason, the most successful investors just buy and hold for the long term.", "score": 2, "replies": [{"body": "Firstly i'm already invested, but the recent run up repells me from buying more because i remember buying in last summer at sub 250$, it's a psychology thing.\nSecondly 10% of 600$ are 60$.. 10% of 6000$ are 600$.. the entry point matters more than one might think\n\nEdith: Also, it's kind of a meme by now waiting for the dip to buy more", "score": 1, "replies": []}]}]}, {"body": "Sounds like I should hold out until Jan delivery announcements/estimates until I restructure my holding to be more bullish.", "score": 1, "replies": [{"body": "I would not. This stock will very likely go to thousands of dollars per share. It might very well takeoff this week. There are strong pressures, from short to have to cover, momentum buyers wanting to jump in, and institutions, who have to buy shares to hedge their calls.", "score": 2, "replies": []}]}]}, {"body": "i too have ptsd from q1 2019", "score": 3, "replies": []}, {"body": "He also said q1 was going to be painful, and that from there on it should be good.", "score": 1, "replies": []}, {"body": "Well, technically he said profitability going forward with ***possible*** temporary exceptions during ramps.", "score": 1, "replies": []}]}]}, {"body": "Nice write up", "score": 3, "replies": []}, {"body": "Great post. If Tesla is included in the S&P, what is that timeline after announcing earnings to actually add it?  Does it take a week? A day?", "score": 3, "replies": [{"body": "[Thread link to another thread link that explains it. ](https://www.reddit.com/r/teslainvestorsclub/comments/exly5n/guesstimated_upside_if_tsla_joins_sp500/fgausa6?utm_medium=android_app&utm_source=share) - disclaimer:I think this is the link that explains it, I feel like I've read through hundreds of posts since. \n\nBased on what I've read through (other posts, not the above) it sounds like the shares get sucked up quietly well before being added to the S&P 500. So, when it is finally included, stock won't necessarily move much.", "score": 1, "replies": []}]}, {"body": "Amazing analysis. But I had hoped you'd, at least, a give some sort of a guesstimate based on it.\n\nThanks anyways. Interesting stuff.", "score": 3, "replies": [{"body": "> But I had hoped you'd, at least, a give some sort of a guesstimate based on it.\n\nNo idea, but you really don't have to know it to profit from it: you \"only\" have to time the bullish event itself correctly. Once the price starts rising you'll have more information to attempt to estimate how far it goes.", "score": 5, "replies": []}]}, {"body": "You seem to know your stuff? Guesstimate on when the inclusion happens?", "score": 1, "replies": [{"body": "In the future. The place where you and I will spend the rest of our lives.", "score": 0, "replies": []}]}, {"body": "Bloody beautiful. Great summary.", "score": 1, "replies": []}, {"body": "Where do you see TWTR popping 60%? It was added to the SP500 on June 7, 2018. It only went up like 4-5%.", "score": 1, "replies": [{"body": "Maybe they mean the rise from May to end June (from 30 ish to 45) - you could conceivably claim the market anticipated inclusion and started buying earlier. \n\nOf course uncomfortably for this uncritical thesis the price then plunged from 45 to 27 within months so it was hardly a new support level, nor has S&P inclusion really supported twitter prices since. \n\nWhat supports prices long term is a great company with loyal customers consistently reporting profits quarter after quarter. Nothing else really matters, which is why this sub should IMO focus on looking at tesla fundamentals and long term outlook, accept that the share price will oscillate (sometimes for no reason, sometimes downward). The Tesla price has plunged for no good reason in the past and will do so again and S&P inclusion is unlikely to move it much IMO, not as much as consistent profits will.", "score": 3, "replies": [{"body": "> Maybe they mean the rise from May to end June (from 30 ish to 45) - you could conceivably claim the market anticipated inclusion and started buying earlier. \n\nYeah, Twitter S&P 500 inclusion became a certainty on 2018 April 25 (their Q1'2018 earnings report), when it was trading at around $33 and it went as low as $27 in the days after.\n\nTWTR rose to a late-June peak of $47. That's a 74% rise if you bought the dip - but I estimated ~60% to allow for what entry price people got in the the post-Q1-ER drop.\n\nTWTR quickly lost that valuation after Q2 earnings - suggesting that this was mostly from the S&P 500 inclusion event. Very high trading volumes before and after 6/6 (the S&P 500 inclusion announcement) also support this view.", "score": 1, "replies": []}]}]}]}, {"body": "Huuuge numbers", "score": 10, "replies": [{"body": "Are you sure? That's a little too precise for me.", "score": 12, "replies": []}, {"body": "That’s right! Trump will solely be responsible for all TSLA gains and Musk is just riding coat tails.", "score": -1, "replies": [{"body": "Musk doesn't ride coat tails. Musk does rockets, he rides rockets, he rides rockets very well.", "score": 2, "replies": [{"body": "He invented the wheel. Lot of people don't know that.", "score": 1, "replies": []}]}]}]}, {"body": "How do we know it's not already priced in?", "score": 8, "replies": [{"body": "That's a good question. I'd say it's not, since nobody talks about it openly in the news. That's usually how you know it.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nIn my estimation:\n\n**Not** priced in (at least, mostly not):\n\n\\- Autonomy, S&P500, margins at 30%+ levels\n\n**Already** priced in:\n\n\\- profitability from now on, medium-high level growth, model Y doing well\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nWould you agree? Do you think I am wrong about any of this?", "score": 10, "replies": [{"body": "Other near term catalysts not priced in yet IMO:\n\n- **Moody's and S&P credit rating upgrade for Tesla**. Today Tesla's debt is still very \"junk\" with Moody's last rating being full of arguments that were falsified meanwhile. This is a third effect, there's a lot of funds that have rules prohibiting the investment in equities that are too risky, and credit ratings are a popular parameter to determine risk.\n- More big investment funds besides BlackRock announcing a move away from increasingly toxic fossil fuel investments.\n- Once Brandenburg starts clearing the GF4 forest, the factory being ready in 2021 becomes a high probability event.\n- **Battery Investor Day in April**. Elon was giddy to spill the beans but didn't, other than it still blows his mind what they are up to in terms of battery technologies, despite him knowing what it is. 😉", "score": 9, "replies": [{"body": "I agree with the first one: I did miss that.\n\nI do believe Berlin is priced in as medium-high level growth.As far as Battery investor day is concerned, I am doubtful. I do think that it will be received better, but do bear in mind how poorly the stock did after FSD day. Sure, there was less \"real\", \"physical\", \"measurable\" progress, but still.", "score": 4, "replies": [{"body": "Yeah.  The tepid or even negative response to Autonomy Day was shocking.  However, I don’t think Battery Day will be viewed as much of a Science Fiction project as Autonomy.  I think it will be easier for them to grasp.\n\nTasha Keeney from Ark hypothesized that many Tesla auto analysts will get poor reviews from their firms and be replaced by tech analysts.  Hasn’t seemed to happen yet (although it is hilarious to watch them raise valuations while still showing a distinct lack of appreciation for the underlying technological prowess of Tesla:-).", "score": 7, "replies": [{"body": "I think it will have a giant impact.  FSD was and in many respects vapourware.  Worth pursuing but hard to nail down.  I thing lots of people grasp the advantage Tesla already has with its current battery tech.  Add better, cheaper and easier to produce to Tesla current situation relative to the automotive and energy market.  I bet we will see the stock go up by 40%.  It will bring into sharp focus the lead that Tesla has in all the markets it is in and solves a big limiting factor on the company.", "score": 3, "replies": []}, {"body": "I think it will have a giant impact.  FSD was and in many respects vapourware.  Worth pursuing but hard to nail down when the impact will be felt.  I thing lots of people grasp the advantage Tesla already has with its current battery tech.  Add better, cheaper and easier to produce to Tesla’s current situation relative to the automotive and energy market.  I bet we will see the stock go up by 40%.  It will bring into sharp focus the lead that Tesla has in all the markets it is in and solves a big limiting factor on the company.", "score": 2, "replies": []}, {"body": "> The tepid or even negative response to Autonomy Day was shocking. \n\nWell, Q1 was really bad in terms of QoQ growth, and this was known on Autonomy Day already (from the delivery report), so it was easy to dismiss it as Elon hyping the equity raise and trying to distract from bad financials.\n\nAlso, Autonomy Day was a ~4 hours event that was easy to mislead about, for example the targeted false articles that claimed that Elon promised \"one million robotaxis by 2020\" - he didn't.\n\nAll of this removed from the credibility of the event. Many investors are re-watching those disclosures now though, it was a rare glimpse into Tesla's long term plans.\n\nFSD is still not even ***remotely*** priced in: ARK gives it a 40% probability by 2024, and if that event triggers their TSLA valuation goes up to **$15,000** instantly ...", "score": 2, "replies": []}]}]}]}]}, {"body": "> How do we know it's not already priced in?\n\nBecause S&P 500 event is uncertain and it hasn't happened yet, and most big funds are risk averse, even if they fully know that they'll probably have to buy 0.35% of TSLA once it's in the S&P 500.\n\nPassive index funds (trillions of dollars under management) probably *cannot* buy TSLA right now at all - it's not in the index.", "score": 4, "replies": []}, {"body": "It's not priced in because S&P inclusion means lots of funds buying the stock.", "score": 2, "replies": [{"body": "I feel stupid. Partially. It's likely it will rise because of S&P500 inclusion and because of people knowing it will get included. So you've got both.", "score": 2, "replies": [{"body": "Exactly.\n\nWe're gonna get 3 pushes.\n\nPush 1: the day we publish earnings that merit qualification.\n\nPush 2: the day it's announced that we've officially qualified.\n\nPush 3: day it's actually included in the S&P.\n\nThis is gonna be the stock on steroids. But not that weak shit they had in baseball in the 90s... this the juice Arnold was on.", "score": 5, "replies": []}]}]}, {"body": "We don’t. No one knows. Question to ask: is Tesla only a $100b company? My opinion is they’re still way under valued", "score": 1, "replies": []}]}, {"body": "I'll say on the day they announce four quarters of gaap profit, which is probably q2 or July at the latest, the stock will shoot up 100 dollars.", "score": 2, "replies": []}, {"body": "+$100 in the first month", "score": 2, "replies": []}, {"body": "So who will they kick out of the Index should they add Tesla?", "score": 2, "replies": []}, {"body": "At this point the stock could easily go above $1000, or even $2000. It's a parabolic move. All the longs I know plan to hold to $5k per share before selling a share. \n\nJoining S&P is just one item. There are several items that could boost the stock significantly.", "score": 2, "replies": []}, {"body": "When would we even know for sure if Tesla is joining?", "score": 1, "replies": [{"body": "When they meet the criteria for joining, ie at the announcement of quarter profits for sufficient successive quarters (4 iirc)", "score": 1, "replies": [{"body": "And are voted in. The criteria only puts them up for consideration.", "score": 2, "replies": [{"body": "Indeed, and someone else has to fall out of the 500 \n\nhttps://www.theoptionsguide.com/sp500.aspx", "score": 2, "replies": []}]}]}, {"body": "June 1 or 8 according to some Redditor", "score": 1, "replies": []}]}, {"body": "You can probably find some historical numbers for when other companies were announced for the SP500. It's usually something, but not massively so.\n\nRemember, inclusion of the SP500 doesn't mean the company is performing well. You could very easily meet the requirements of the SP500 while also having a negative outlook.", "score": 1, "replies": []}, {"body": "Sorry if missed, what does tsla have to do in Q1 to make the cut?", "score": 1, "replies": []}, {"body": "ITT: A good explanation of why the S&P500's inclusion parameters constitute a mathematical discontinuity, reducing total gains when stocks enter and exit.", "score": 1, "replies": []}, {"body": "This is the type of content I subbed for. Thank you.", "score": 1, "replies": []}, {"body": "Guys, this is not happening. The reason is Tsla will continue to appreciate, and the probability of Elons option grant for the first tranche keeps going up.\n\nAssuming we stay around 650 for a while, Tesla needs to record 450 million in a GAAP charge in the next 2 quarters, over and above the 60 or so million they recorded in q4 2019.\n\nThey will also start reserving for the next tranche as 780 approaches.\n\nThis all flows through tax accounting as well, and DTAs are doing to be hard to recognize as well.\n\nAll said, i am super happy with what the stuck has done, and I am deep into it. Just don't count on your GAAP profit and DTA release being a sure thing this year.\n\nEdit: this is all gimmicky accounting stuff, except for the dilution, which I was expecting anyways, and Elon totally deserves. Just don't count on these triggering a huge influx of index money shortly.", "score": 1, "replies": [{"body": "GAAP profit was lower because of the expectation of a payout to Elon. Is that correct or am I getting it all wrong?", "score": 1, "replies": []}]}, {"body": "So what’s your guesstimate?", "score": 1, "replies": [{"body": "If I knew, I would not be asking. I am rather ignorant of the traditional stock market practices. Trying to study up.", "score": 2, "replies": []}]}, {"body": "Priced in and probability-weighted in real time by arbitrage algorithms.\n\nThat’s transparent information. There is no free lunch here. The only possible change is structural with growing fund ownership which are known to lend shares to short-sellers to reduce their management fees.", "score": 0, "replies": [{"body": "How can it be priced in if the funds that will have to buy  TSLA (once S&P 500 inclusion takes place) currently can’t buy those shares? Wouldn’t all of the S&P 500-tracking funds have to buy TSLA ahead of time in order for all of this to be priced in?", "score": 4, "replies": [{"body": "Here is how it's partially priced in: some algos think it'll happen so have already bought the shares. When it happens they sell those shares to the funds that have to buy. Net result is less price change than otherwise would happen.", "score": 2, "replies": [{"body": "Institutional ownership is around 65%.  Shorts are around 18%. S&P500 buying is around 35B or 30% of current market cap.  So demand could be 40% of shares vs selling is prob much less than half of institutions, 30% or lower of shares currently.  There will definitely be more demand than supply", "score": 1, "replies": []}]}, {"body": "I'd assume via things like options.\n\nIf the SP500 inclusion has some probability of happening and that probability has some potential price associated with it, then options should reflect that to some extent.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "I don't think they get a choice, it is after all merely an index - a group of shares put together by Standard and Poors - yes that has consequence but I can't see how any listed company can say \"don't put me on it\"", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I'm not at all sure I understand your question.\n\nThere are accounting standards that mandate when profits are booked, there are very limited ways they can be moved around and similarly for the point at which deposits become income, or pre-payment for FSD can be booked.\n\nTesla (or any other company) has zero control over whether they are in the S&P500 as far as I am aware. I guess they could deliberately incur a loss (how I'm not sure) in a quarter to prevent it but what would be the point ? \n\nI know of no benefit to Tesla of delaying being in it, there's neither cost nor benefit directly to them, there is indirect benefit to shareholders (and thus Musk and the directors) of being included as it normally lifts the share price a little and may reduce volatility a little (deeper demand). I can't think of a single downside to it.", "score": 3, "replies": []}]}]}]}]}
{"title": "Bulls please this is a warning", "selftext": "Stock market is going to crash hard. China is full SHTF. Im no 🐻 but I pulled out last Friday. If you care about your gains pull out too. \n\nYou have been warned.", "id": "exxbmv", "created_utc": 1580685597.0, "score": 84, "upvote_ratio": 0.8, "num_comments": 94, "comments": [{"body": "Oh thank god you pulled out. That means we only go up from here", "score": 242, "replies": [{"body": "I will be back to rub it in your face, or delete the thread, all of my comments, my account, my hard drive and move to  a remote village.", "score": 78, "replies": [{"body": "I heard WuHan is a good spot.", "score": 76, "replies": [{"body": "Real estate cheap af right now I’m 17 condos in for 375k. Going to be a sick ass Airbnb boom once this shit tapers off. People are going to want to get the authentic fruit bat tea.", "score": 39, "replies": [{"body": "> authentic fruit bat tea\n\nYou son of a bitch, I'm in.", "score": 12, "replies": []}, {"body": "How much is it to burn the 17 corpses of old Chinese ladies who got cough drops and a nice warm smile from the nurse at the hospital?", "score": 3, "replies": [{"body": "They will just get “cremated” with all of the trash they already burn.", "score": 1, "replies": []}]}]}]}, {"body": "Won’t even have money for that", "score": 5, "replies": []}, {"body": "When can we expect you to delete your reddit account and make a new one?", "score": 2, "replies": []}, {"body": "BAN", "score": 1, "replies": []}, {"body": "You won", "score": 1, "replies": []}]}, {"body": "Pulling out is not the best strategy in my opinion.", "score": 6, "replies": [{"body": "financially if I dont pull out, then my portfolio will be on the decline for 18 years", "score": 3, "replies": []}, {"body": "Go on.", "score": 2, "replies": []}, {"body": "your father might say otherwise..", "score": 1, "replies": []}]}, {"body": "Rip", "score": 3, "replies": []}, {"body": "That’s how it always works doesn’t it", "score": 1, "replies": []}]}, {"body": "Never pull out", "score": 53, "replies": [{"body": "This is my motto. I keep getting letters in the mail labeled ‘CHILD SUPPORT INVOICE’ for some reason but that’s a small price to pay for $GAINZ", "score": 27, "replies": [{"body": "If you ain’t trying to have a baby with a bitch make her eat it or at least wear it. Fuck child support.", "score": 5, "replies": []}, {"body": "Your stonks is your child support. You can provide much more for that little retard than sending your ex cumdumpster any money.", "score": 2, "replies": []}]}, {"body": "That's what my always said. 30 years later and his son is a degenerate gambler just like him.", "score": 0, "replies": []}]}, {"body": "If dumb fucks like you didn't sell the market wouldn't go down.", "score": 70, "replies": [{"body": "FnA this chap figured this whole game out! We are all going to be rich!", "score": 13, "replies": []}]}, {"body": "Never pull out, only buy the dips", "score": 29, "replies": []}, {"body": "Stonks only go up.", "score": 38, "replies": [{"body": "Up doesn’t mean shit if there’s no down. Down makes up, up. Dumped some low earning mutual funds on Thursday and created some cash. Ready to buy, but waiting 10-12 days. You got to GET DOWN to GO UP.", "score": 7, "replies": [{"body": "\"Low earning mutual funds\" please go back to r/investing", "score": 14, "replies": [{"body": "I was hoping for a response like this almost verbatim. Thank you, daddy.", "score": 4, "replies": []}]}, {"body": "What does the word \"down\" mean all I know is up.", "score": 2, "replies": []}]}, {"body": ">Stonks only go up.\n\n-- CCP", "score": 1, "replies": []}]}, {"body": "Pull out king here", "score": 9, "replies": []}, {"body": "Look at this historic charts you fucking bull for life retards. If you're all in on calls week after week you deserve to get fucked. This is solid advice.", "score": 20, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Productivity isn't logarithmic, the stock market currently is. What does that mean?", "score": 1, "replies": [{"body": "The rich get richer?", "score": 1, "replies": [{"body": "It means our current layout is unsustainable", "score": 1, "replies": []}]}, {"body": ">that  \r\n>[th at; unstressed th uh t]    \r\n>1.    \r\n>*(used to indicate a person, thing, idea, state, event, time, remark, etc., as pointed out or present, mentioned before, supposed to be understood, or by way of emphasis):*    e.g **That is her mother. After that we saw each other.**", "score": 0, "replies": [{"body": "You're that witty boi, hello witty boi", "score": 1, "replies": []}]}]}]}]}, {"body": "Pull that crystal ball out of your ass, that's not how it works.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 9, "replies": [{"body": "China pumping 175billion", "score": 2, "replies": []}, {"body": "Futures are a small amount of traders betting on the direction of market open. They are betting green because of china market control headlines. Once market opens the driver is the market itself and people are going to want to protect recent large gains and derisk because of virus uncertainty. Green futures. Red monday.", "score": 2, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Facts. I wait till 10AM PST most of the time", "score": 2, "replies": []}]}]}, {"body": "What are some of the best futures for options in your opinion, just curious?", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Sell me all your stonks", "score": 3, "replies": []}, {"body": "Get your aids off of my phone, bear.", "score": 3, "replies": [{"body": "I ain't shorted a stock since 1995. I just know when to pull out. Ask my wife and 0 kids", "score": 6, "replies": []}]}, {"body": "is this some sort of gay joke?", "score": 6, "replies": []}, {"body": "Corona virus is cured:  all green tomorrow:  http://www.khaosodenglish.com/news/2020/02/02/thai-doctors-say-they-cured-patient-of-coronavirus-in-48-hours/", "score": 6, "replies": [{"body": "Dude, you can't cure a virus. This is obviously media trying to get clicks.", "score": 6, "replies": []}, {"body": "Sigh, didn't want to do this. But imma have to order a hit job", "score": 2, "replies": []}, {"body": "No cure, brainlet. Documented cases of survivors getting reinfected.", "score": -9, "replies": [{"body": "I am willing to bet you had less than $10k in you account, no savings, no IRA, no 401k\nnobody is this much of a pussy unless they are scared to go broke, even in the worse market a few years ago I emptied my account.\n\nIf so I am glad you out, dont fuck with money you don't have retard. Money in the market is money you are willing to lose.", "score": 4, "replies": [{"body": "imagine being this partially retarded", "score": 1, "replies": []}, {"body": "I was just playing play money nlh 4 diamonds on board incl. river ad villain shove with pockoo ace no diamond guess where he/she's from?  China.", "score": 1, "replies": []}, {"body": "You seem like you got a good handle on things. Should I max out my 401k before I start to invest? Also is a IRA something I can max out to every month?", "score": 1, "replies": [{"body": "Focus on your retirement before thinking about investing. Make sure you are secure. \nYou can max your IRA and 401k each year, 7,000 for IRA and 18,000 for 401k(Check if your job match). If you can't max it, put some money aside for it, in 30 years you will have $500k+.\n\nThe market can make you rich but it can also make you dirt broke. Get your payment, make a budget, reserve money for IRA, 401k and the rest for market investment.\n\nIts finance 101.\n\nIf you start in your 30's with a $50k/y and put 10% on 401k each year you looking at 100k in your 40's, 280k in your 50's, $950k at your 65's retirement. Thats just 401k.\n\nNow you also put $5k each year on IRA starting on your 30's? At 40 you have $70k, at 50 you got $200k, at 65 you got $700k\n\nCombine the 2 and at your 50's you are leaving your ugly old wife for an 20 years old model and driving an Lamborghini.\n\nI started in my early 20's with a $30k year salary, now I make a lot more than that and by the time I am 45 i will have $4m in IRA+401k.", "score": 2, "replies": [{"body": "Thanks. So for the 401k you are saying put in 10% of my 50k salary? Or do you mean something else?\n\nObviously the big take away is start young when planning for retirement.", "score": 1, "replies": [{"body": "Yes, 10% of your yearly salary. Also you should always ask for 401k comp when negotiating job positions (Depending on thr job ofc).\n\nGlad you understood, unfortunately most people start caring about their retirement when they are on their late 40's which is usually too late to save enough.", "score": 2, "replies": [{"body": "Thanks.", "score": 1, "replies": []}]}]}]}]}, {"body": "this aged well.  lmfao", "score": 1, "replies": []}]}]}]}, {"body": "👌", "score": 2, "replies": []}, {"body": "Jeezzz. No reason to pull out? That's what puts are for.", "score": 2, "replies": []}, {"body": "Your pull out game is worse than my metaphors", "score": 2, "replies": []}, {"body": "Real bulls cum inside", "score": 2, "replies": []}, {"body": "Wish your father pulled out", "score": 2, "replies": []}, {"body": "Yeah bro futures green and never pull out means ya babies wont grow", "score": 1, "replies": []}, {"body": "The future is green!", "score": 1, "replies": []}, {"body": "LOL. We're headed back to ATH next week retard.", "score": 1, "replies": []}, {"body": "Never gonna take advice from a weak hands halfass bull", "score": 1, "replies": []}, {"body": "Pull out to shoot my fat wad over the back of some *dancer* working her/his way through college.", "score": 1, "replies": []}, {"body": "Ban this guy if no us equity crash ensues", "score": 1, "replies": []}, {"body": "> I pulled out last Friday. \n\nThat explains why you want everyone to do the same...", "score": 1, "replies": []}, {"body": "What gains?", "score": 1, "replies": []}, {"body": "Omfg so confused as to when to buy the a50 dip..10,500.", "score": 1, "replies": []}, {"body": "If you predict stock market to crash then you play puts. That's actually when I go all in on stocks too.", "score": 1, "replies": []}, {"body": "No no China is full of SWAG", "score": 1, "replies": []}, {"body": "Calls it is", "score": 1, "replies": []}, {"body": "Nahh, tesla is going up and beating it's ATH.", "score": 1, "replies": []}, {"body": "Go home pussy", "score": 1, "replies": []}, {"body": "You missed an opportunity to add provocative discussion about plunging markets to your post.", "score": 1, "replies": []}, {"body": "Sounds like something a 🐻 would say", "score": 1, "replies": []}, {"body": "How low do you think spy would go?", "score": 1, "replies": []}, {"body": "Show us your PUTS", "score": 0, "replies": [{"body": "I have none. I pulled all my money out. I have 27 dollars left in my account.", "score": 6, "replies": [{"body": "I pUlLeD oUt OvEr $27!!!!!!!!! PrOtEcT mY nEsT eGgZzZz", "score": -2, "replies": [{"body": "Absolute brainlet. Read that again, but slower", "score": -3, "replies": [{"body": "Would it be safe to say that if one leaves $27 dollars in their account after pulling out money that the individual in question pulled out greater than $27? \n\nYou can apologize in your response, hoss.", "score": 1, "replies": [{"body": "No, maybe he only had $28 dollars in his account, meaning he pulled out $1.", "score": 2, "replies": [{"body": "Yeah, you right. I assumed he had upwards of $54. That’s big money.", "score": 1, "replies": []}]}]}]}]}, {"body": "The first true thing you've said on this thread.", "score": 0, "replies": []}, {"body": "Lol", "score": -1, "replies": []}]}]}, {"body": "Didn’t pull out on your mom, not pulling out now", "score": 0, "replies": []}]}
