{"title": "Tesla spotted stockpiling brand new Model Y SUVs at factory", "selftext": "", "id": "fbdnd3", "created_utc": 1582988378.0, "score": 166, "upvote_ratio": 0.98, "num_comments": 96, "comments": [{"body": "I seriously start to think Tesla is transporting / stockpiling all their new cars in Jan and Feb, thus almost non-existent delivery quarter to date.\n\nA crazy delivery spike will happen in March.", "score": 41, "replies": [{"body": "I think bringing the Model Y production online and needed maintenance has slowed Model 3 production this quarter. Expecting roughly 92k deliveries, a little under Troy's predictions.  But I'm usually wrong so ymmv.", "score": 24, "replies": [{"body": "[Tesla is leading January EV global deliveries with 10,013 Model 3 units in this estimate](http://ev-sales.blogspot.com/2020/02/global-top-20-january-2020.html):\n\n> \"the Top Dog remained the same, with the Tesla Model 3 winning its 12th consecutive monthly win, thanks to 10,013 units\"\n\nThat's a 37% increase over January last year, while some of their core markets like Europe only had a trickle of less than 2k units of inventory left over from Q4.", "score": 6, "replies": [{"body": "Actually what? Normally when saying actually it’s followed by information that corrects a misstatement. Instead you post a link to a metric (#1 in EV sales in January) irrelevant to my comment on total q1 p&d. And they are off to their slowest start in 2 years in combined NL, No, Sp sales. 619 on day 59 vs next lowest 916 in Q3 2018. Q4 2019 was at 5199 on day 59. \n\nWhat’s your estimated Q1 production and delivery?", "score": 3, "replies": [{"body": "> Actually what?\n\nLOL, I noticed that too once reading my comment for a second time, and if you look at the comment timestamps I corrected that shortly before you posted your comment.\n\n> What’s your estimated Q1 production and delivery?\n\nMore than the 63k in Q1'2019, more than 80k units and at this stage I'd say less than 100k units.\n\nSomewhere around the Q3 delivery results (97k) would make Q1 profits possible.", "score": 3, "replies": [{"body": "Sorry I was too quick on the trigger! Waiting for a delayed flight to board with nothing better to do than check Reddit.", "score": 4, "replies": [{"body": "No, that's fully OK, your reply was fair, it's my bad for not noticing it before posting it. My edit and your reply crossed each other.\n\nI also edited my second comment, replying to your Q1 deliveries question. 🤠", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Given how inexpensive Giga Shanghai was to build, its relative simplicity vs Giga Freemont, and the fact that a significant % of the sub-components are still being sourced from high run-rate lines used by the US model 3 (no local supply yet, at least as of January), I think the operating costs spread across 10-15k MIC model 3's should be pretty reasonable... at least break even. Given that the factory was shut down first for an extended holiday and then for an \"act of god\" event, I think the duration of the quarter can be played with a little in the accounting. If they have a component stockpile built up while the factory was closed, they could accelerate the line speed for the remainder of the quarter and see a pretty good effective quarterly rate. Today's report of large #'s of flatbed contracts for home deliveries in the Shanghai area seems to support this.", "score": 6, "replies": [{"body": ">  I think the operating costs spread across 10-15k MIC model 3's should be pretty reasonable... at least break even. \n\nNote that it's even better than that: the vast majority of \"operating costs\" are ***not*** accounted as operating expenses (a.k.a. opex), but are accounted as cost of goods and capitalized onto the balance sheet, and are only recognized in the quarter when the car is sold.\n\nPut differently, unlike the original Model 3 ramp up which was an opex clusterf\\*ck, the quick GF3 ramp-up will have very little drag on opex, and the margins should be pretty OK in Q1 already I think - above break-even I think, if they manage a good March.", "score": 1, "replies": []}]}, {"body": "> Unfortunately, now you have operating costs in China too.\n\nSuch as?", "score": 1, "replies": []}]}]}]}]}, {"body": "Theres been as many or more ships to Europe than Q4 last year, plus China up 400%\\^ on last January", "score": 1, "replies": [{"body": "Re: Europe: 7 this Q  vs 8 last Q.  There's also a shorter load time, with about 30% less load hours.\n\nhttps://t.co/AIr2qLq95e?amp=1", "score": 2, "replies": []}]}, {"body": "That seems logical, but Elon claimed on the call that would not happen.", "score": 1, "replies": []}]}, {"body": "Perfect time for earnings and report delivery volumes to exceed low expectations.", "score": 6, "replies": []}, {"body": "That is the usual cycle every quarter at least in the US. This time the deliveries will include Y. How that'll affect 3 deliveries will have to be seen.", "score": 5, "replies": []}, {"body": "Personally I hope it's them planning to prevent exactly that. They've talked about ending delivery waves because it puts so much pressure on the sales centres and we've often seen that as a reason that sales centres are just pushing people through and not walking them through vehicles with time and attention they should get.\n\nIt would probably really improve the delivery experience, and now's as good a time as any.", "score": 2, "replies": []}, {"body": "> A crazy delivery spike will happen in March.\n\nTo whom? Why would anyone buy this hatchback car for an insane $54k when they could get a RAV4 for half the price?", "score": -39, "replies": [{"body": "lol a RAV4 what are we taking the kids to soccer...", "score": 16, "replies": [{"body": "Eventually, I guess.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 13, "replies": [{"body": "I've driven both. Again, Y is an insane $54k. And it holds less cargo than a RAV4 that is half the price and has triple the highway range.", "score": -15, "replies": [{"body": "Then you should get a Rav4.  Some people prefer Civics over Model 3s.  I don’t know a single one, but I imagine it would be you if budget is a concern as it obviously appears.", "score": 14, "replies": [{"body": "> Then you should get a Rav4.\n\n448k Americans did last year, and more will this year: https://pressroom.toyota.com/toyota-motor-north-america-reports-december-2019-year-end-sales/", "score": -15, "replies": [{"body": "Let’s see those stats again when the Y comes out.  The 3 destroyed the market share of every compatible midsized ride.  You should also invest in stock in Toyota too and short Tesla.  You’ve got it all figured out.", "score": 15, "replies": [{"body": "Tone down the aggressiveness, if you please. People can have opinions without paying for the privilege.", "score": 6, "replies": []}]}]}]}, {"body": "I don't think the RAV4 has larger cargo capacity than the Model Y.", "score": 4, "replies": [{"body": "RAV4 is slightly bigger (~69 vs 66 ft3). Model Y has more space than you would think because no spare and the frunk.", "score": 5, "replies": [{"body": "Why is that more than we'd think though, shouldn't it compare with the #1 selling CUV?", "score": 1, "replies": [{"body": "A lot of people downplay the difference between the Model 3 and Model Y. They think the Y is just a slightly larger 3. But the Y actually has 3x the cargo volume of the Model 3 and compares pretty favorably to other CUVs in its class.", "score": 2, "replies": [{"body": "What? Model 3 cargo volume is 43.6 ft3 vs 66 ft3 for the model Y (both with seats down). That’s not 3x", "score": 3, "replies": [{"body": "Hey that's a good point. Every time I see the Model 3 cargo capacity, it is listed with the back seats up. The Model Y capacity is always shown with the seats down.", "score": 3, "replies": []}]}]}]}]}, {"body": "https://www.tesla.com/modely\n\n> **66** cu ft Cargo Space\n\nhttps://www.toyota.com/rav4/features/weights_capacities/4430/4435/4440\n\n> Cargo volume (cu. ft.) behind front/rear seat, estimated **69.8**", "score": 0, "replies": [{"body": "Oh shit, 4% more cargo space, definitely worth you mentioning it.", "score": 3, "replies": [{"body": "Regardless of the fact that they're weirdly comparing the Rav4 to the Y, you challenged what they said and they showed you were wrong. \n\nThey made a valid point that matters for people getting a small SUV. No need to dig it further.", "score": 1, "replies": [{"body": "Well the RAV4 is top dog CUV and has a PHEV coming out this year with 39 miles EV range and a $7500 tax credit. I suspect the user is somehow affiliated with Toyota or just loves the rav4.", "score": 5, "replies": [{"body": "Where do you see that the Rav4 gets a $7500 tax credit?", "score": 1, "replies": [{"body": "The RAV4 prime will. There's many sources on that.\n\nhttps://www.edmunds.com/toyota/rav4-prime/", "score": 2, "replies": []}]}, {"body": "And a $25k tax deduction in addition to that for businesses (because, unlike Y, it has a 6,000 lb GVWR).", "score": -1, "replies": [{"body": "A RAV4 doesn’t have a 6,000+ lb. GVWR...it’s not even close?", "score": 3, "replies": [{"body": "I tried finding the weight and my Google Fu has failed me. I can't find anything to support this claim.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "This excludes the frunk. Model 3 has 2.7 feet, so if likely to be extremely close to the Ravioli.", "score": 1, "replies": [{"body": "> This excludes the frunk.\n\nNot according to Tesla.\n\n> Model 3 has 2.7 feet\n\nAnd Tesla's own 15 cu ft storage-capacity claim for the Model 3 includes that 2.7 cu ft: https://www.tesla.com/model3", "score": 0, "replies": []}]}]}]}, {"body": "Model Y is competing against BMW X3, X5, Porsche Macan, Cayenne...", "score": 2, "replies": [{"body": "In theory, but with the mass defections the Model 3 saw from Accords and Camrys I think we may be in for a pleasant surprise.", "score": 2, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "Would have approved this comment, and then the last line. Nope.", "score": 2, "replies": []}]}, {"body": "The same argument could be made against the Model 3.   Model 3 is an \"insane\" $40k.  That is more than 2x the price of a Toyota Corolla.  Despite this, Tesla has no trouble selling the Model 3.   Given the popularity of Model 3 against BMW 3-series and Mercedes Benz C-Class, it is likely that Model Y will win sales away from BMW X3, Mercedes Benz GLC, Lexus RX, and Acura RDX.    \n\n\n>  triple the highway range \n\nNo.\n\n[https://www.fueleconomy.gov/feg/Find.do?action=sbs&id=42474&id=42187&id=42189](https://www.fueleconomy.gov/feg/Find.do?action=sbs&id=42474&id=42187&id=42189)\n\nRAV4 2.5L AWD: 34 MPG Highway \\*  14.5 Gallons/Tank = **493 miles** highway range\n\nRAV4 2.5L AWD Hybrid: 38 MPG Highway \\* 14.5 Gallons/Tank =  **551 miles** highway range\n\nTesla Model Y Performance: 112 MPGe Highway.  **291 miles** estimated highway range, based on (315 miles range Combined) \\*  (112 MPGe Highway / 121 MPGe Combined).", "score": 1, "replies": [{"body": "https://www.caranddriver.com/reviews/a19642264/2018-tesla-model-3-test-review/\n\n> it’s difficult to gauge exactly how disappointing the Model 3’s result is in our real-world 75-mph highway fuel-economy test. Our calculated range of 200 miles is far below the EPA’s overall estimates of 310 miles in combined driving and 293 miles in highway driving, but it was certainly affected by the 28-degree-Fahrenheit ambient temperature. Two similar tests of a Chevy Bolt, the Model 3’s closest EV competitor, revealed a difference in observed range of more than 25 percent between a 56-degree and a 36-degree run (190 miles versus 140 miles against an EPA-estimated highway range of 217 miles).\n\n~180 miles winter highway range × 3 = 540 miles. Still less than RAV4 Prime, even before charging the Prime.\n\nAnd remember, range degrades over time for a Tesla. And Teslas normally aren't charged to 100%. Tesla Model Y has a range problem. RAV4 Prime is the cure.", "score": 1, "replies": [{"body": "That is moving the goalposts to an edge case.  \n\nYou initially stated:\n\n>  triple the highway range \n\nNot:\n\n> winter highway range  \n\nThen you change \"calculated range of 200 miles\" at  28-degree-Fahrenheit ambient temperature in the 2018 article you cite to:\n\n> 180 miles winter highway range  \n\n200 != 180.  \n\n> Teslas normally aren't charged to 100% \n\nMy gas tank normally isn't 100% full either.  Typical is somewhere between 50-80%.  If I'm leaving on a road trip, I fill up the night before.    \n\nThe fact that Tesla has not had any trouble selling Model 3, indicates to me that for General use cases, the range is more than good enough for typical customers.  Any system is going to have edge cases where it outperforms competing systems, and edge cases where it under performs competing systems.  Edge cases cannot be relied upon to predict the success or failure of a product in the marketplace.  \n\nFor General use cases, Model 3 has sufficient energy capacity to satisfy customers.  I see no reason why this would change for Model Y.", "score": 1, "replies": [{"body": "> That is moving the goalposts to an edge case.\n\nProve no Americans take road trips around Thanksgiving.\n\n> 200 != 180.\n\nYou think Y is going to be more efficient than 3 on highway?", "score": 1, "replies": [{"body": "> Prove no Americans take road trips around Thanksgiving. \n\nThis is the incorrect question to ask.  It is too broad.  The relevant question is: what % of Americans are taking a road trip around Thanksgiving where a 200-mile range becomes inconvenient (or where they need range capability in an edge case that the Tesla cannot provide).  \n\nThere will be some % of potential buyers for whom a Tesla is currently not going to be a viable option.  I do not think this % is high enough to prevent Model Y from selling extremely well.  If the energy capacity of Model 3 was insufficient for general use, sales would not continue to be strong almost 3 years after the first cars were delivered.  The empirical evidence therefore does not support your predication that Model Y will find few buyers because of an alleged range problem.\n\n&#x200B;\n\n> You think Y is going to be more efficient than 3 on highway? \n\nThe only available data shows that Model Y has Highway MPGe of 112, which is the same as the Highway MPGe of the 2018 Tesla Model 3.  The 2020 Model 3 has highway MPGe of 116, only 3.6% greater.   Note that this is for AWD models only.  There is no comparable RWD number for Model Y yet, but I expect that there would be similar efficiency differences between AWD and RWD Model Y as between AWD and RWD Model 3. \n\n[https://www.fueleconomy.gov/feg/Find.do?action=sbs&id=40385&id=42474&id=42275](https://www.fueleconomy.gov/feg/Find.do?action=sbs&id=40385&id=42474&id=42275)\n\nReal world tests will provide more data.  We do not know the extent of technological improvements to Model Y, if any, over Model 3.  A collection of improvements could make Model Y's range on par with older Model 3.  We just don't know either way.", "score": 1, "replies": [{"body": "> The relevant question is: what % of Americans are taking a road trip around Thanksgiving where a 200-mile range becomes inconvenient\n\nNo one is going to drive a Y 200 miles on highway in winter without recharging. You have very strange ideas about how people use cars if you think they drive without buffers.\n\n> If the energy capacity of Model 3 was insufficient for general use, sales would not continue to be strong almost 3 years after the first cars were delivered.\n\nThe only delivery data for 2020 show sales have dropped to almost zero.", "score": 1, "replies": [{"body": "> No one is going to drive a Y 200 miles on highway in winter without recharging.  \n\nRead my post again, carefully.  I did not say that people would drive their cars 200 miles nonstop.  What I actually said is that we need to look at the % the customers for whom a vehicle with 200 miles range in cold weather becomes inconvenient. \n\nIf someone hypothetically wants a 40 mile buffer but also feels the need to travel 200 miles between charging stops in cold weather, then that would be a problem.  If they only feel the need to travel 150 miles between charging stops, with a 40 mile buffer, then it would be fine.  The question is NOT whether a person would drive 200 miles in one go.  The question is whether 200 miles is enough for their specific driving plans. \n\nSo again, we must consider the % of potential Tesla customers, for whom winter highway driving range is of critical importance, and for whom 200 miles would be below their comfort level in terms of \"Range Between Charge\" + \"Safety Buffer\".  If this was a serious problem for a substantial % of the customer base, Model 3 sales would have dropped off long before now. \n\n \n\n>The only delivery data for 2020 show sales have dropped to almost zero.\n\nNo one can consider this credible, given that you have posted no source for this information or proof of its validity.  People outside the company can at best make educated guesses at this until the quarterly delivery numbers are out in April.", "score": 1, "replies": [{"body": "https://insideevs.com/news/401395/europe-ev-sales-january-2020/", "score": 1, "replies": [{"body": "This is only a single geographic market.  \n\nIt would illogical to extrapolate low to nonexistent sales worldwide based on this data.  Tesla only has 1 factory building vehicles for the European Union.  There is not going to be steady flow of sales as long as cars are built in California and shipped to the EU in batches. \n\nIf you look at lead times for North American customers of high-margin Performance Model 3 trims, they are still quite long.  Weeks.  If demand was really low, customers would not be waiting around 40-50 days for a car: [https://teslamotorsclub.com/tmc/threads/performance-waiting-room.148821/page-367](https://teslamotorsclub.com/tmc/threads/performance-waiting-room.148821/page-367) \n\nMany people who ordered mid-January are still waiting for their Performance Model 3.\n\nLooking at the LR AWD and SR+ “waiting room” threads in that same forum, North American customers have generally been experiencing weeks or even months long wait times.", "score": 1, "replies": [{"body": "> This is only a single geographic market.\n\nAnd the only delivery data for 2020 show sales have dropped to almost zero. Ask Tesla what it has to hide.", "score": 1, "replies": [{"body": "As far as I can remember, Tesla has always reported sales on a quarterly basis.  \n\nCustomer wait times in North America are  around 4-8 weeks based on buyer reporting on forums.  \n\nAgain, if sales were truly close to 0 as you claim, North American customers would not be waiting 40-50 days or more for their cars, especially the high margin Performance AWD models.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "> That is more than 2x the price of a Toyota Corolla. Despite this, Tesla has no trouble selling the Model 3.\n\nWithout subsidies, Corolla Sedan outsold the subsidized Model 3 last year in the US, 222k to 159k:\n\n* https://insideevs.com/news/343998/monthly-plug-in-ev-sales-scorecard/\n\n* https://carsalesbase.com/us-car-sales-data/toyota/toyota-corolla-sedan/\n\nConsider, also, that individual Toyota model sales are cannibalized by the rest of Toyota's extensive product line. Not so with Tesla, yet. If someone wants a Tesla, they have little choice as to what model they will be buying. As more models are added, Tesla's sales will be spread thinner and thinner per model.\n\nMeanwhile, Toyota sold a record 10.74 million units globally in 2019, dwarfing Tesla. As plug-in subsidies are deleted, Tesla's sales have nowhere to go but down.", "score": 1, "replies": []}]}]}]}, {"body": "I think the Model Y will be a strong cross-shop with the Mode 3. More space for only a little more money. I would be surprised if there is much Rav4 Prime and Model Y cross shopping.  Would be interesting to hear from those who are considering both.", "score": 8, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "The strength of the Toyota brand will help them out, and that tiny battery suggests they'll actually be able to produce at some volume while other legacy builders with BEVs will remain battery constrained.", "score": 2, "replies": []}]}]}, {"body": "When was the last time you saw six figure preorders for the RAV4?", "score": 3, "replies": [{"body": "Were there six figure preorders for the Y?", "score": 3, "replies": []}, {"body": "Why would Toyota take pre-orders when they know they sell 400-500K/year in the US like clockwork? Likewise, why would anyone pre-order a Rav4 when they know there will be thousands available at any given time they decide they want one?\n\nThe Model 3 would not have had 500K pre-orders if Tesla said you'll just be able to walk in a get one whenever you want one.", "score": 0, "replies": [{"body": "Mostly cause nobody gives a shit about RAV4s.  You don’t wait for a RAV4...you settle for a RAV4.  Not too many people who aren’t limited by budget are going to go for a RAV4 over a Model Y, unless you’re a boomer.", "score": 1, "replies": [{"body": "No, it's unique to Tesla because Tesla didn't have capacity at the time. People pre-order things that they think will be low stock. Tesla had no production capacity, thus the wait would be long if you weren't in line and wanted one.\n\nIf Tesla have known capacity of millions like Toyota, no one would pre-order because there would be no reason to. \n\nDo you pre-order Starbucks or do you know that Starbucks can always meet demand for coffee? Same principle with Tesla now. Now that people know they have higher capacity and inventory, they don't pre-order.\n\nAlso, I don't settle for a Rav4. I'm pretty sure I have an order of magnitude higher budget than the majority of Model Y buyers, yet I'd consider a Rav4 Prime because they're honestly both A to B, nothing-special modes of transportation. I don't go to an office, I have no commute, and I can't be bothered to waste time driving to places I can fly to. 40 miles of electric range means I'd probably rarely need gas and $20K in savings. I also never considering buying a Tesla, only leasing. Technology moves fast. They already had to replace the hardware for self-driving and they probably will again when they realize HW3 isn't good enoug\n\nYou're making the assumption that people who aren't on a budget care so much about cars. I know some very wealthy people and last time I met up with them, they were renting a Kia and said it was a great car. They don't give a crap about cars and see no excess value in a $50K vs $30K car.", "score": 1, "replies": []}]}]}]}, {"body": "Will a RAV 4 be driving you one day? I don’t think so........", "score": 2, "replies": [{"body": "https://youtu.be/GVar8JMHn9o", "score": -1, "replies": [{"body": "comma.ai", "score": 3, "replies": [{"body": "It's a fair rebuttal though, but I think Comma has a heck of a lot more ground to cover than Tesla, Waymo, and even Cruise and MobilEye.", "score": 1, "replies": []}]}]}]}, {"body": "Oh, this comment will not age well", "score": 2, "replies": []}, {"body": "Weird. You didn’t realize the RAV4 also has a hatchback?  Or is it, that you didn’t realize the model Y is just as large as a Toyota RAV4?", "score": 2, "replies": [{"body": "RAV4 defines the compact-crossover segment. Y doesn't measure up.\n\n> Y is just as large as a Toyota RAV4\n\nFalse: https://www.teslarati.com/tesla-model-y-size-vs-model-3-vs-model-x/\n\nHeight:\n\n* RAV4: 67-68.6\"\n\n* Y: 62.5\"\n\nCargo space (2nd row seats down):\n\n* RAV4: 69.8 cu ft\n\n* Y: 66 cu ft", "score": 0, "replies": [{"body": "Plus the frunk. If it's only as big as the Model 3 at 2.7 feet (though I imagine it would be slightly larger) it will have 98.4% as much cargo space while being 4.5-6.1 inches shorter.\n\nThat's a win for Tesla to me.", "score": 1, "replies": [{"body": "> Plus the frunk.\n\nProve the Tesla website is wrong, and for the first time ever isn't including the frunk in its own cargo-space claim: https://www.tesla.com/modely", "score": 0, "replies": []}]}]}]}, {"body": "they brought back the electric RAV4?", "score": 1, "replies": [{"body": "No one cares if their car plugs in.\n\nAnd RAV4 Ptime (39-mile PHEV) comes out in a few months.", "score": -5, "replies": [{"body": "Dude, you’re on an electric car investor forum and saying no one cares if their car plugs in. You’re obviously trolling. Why don’t you stop wasting everyone’s time", "score": 6, "replies": [{"body": "Investors need to take all information into account. If Tesla is trying to reach a mass market, and if mass-market consumers don't care how their cars are powered, investors need to know that.", "score": -3, "replies": [{"body": "Then post real data. Obviously someone cares if their car plugs in... where do you see that consumers don’t care how their cars are powered?", "score": 3, "replies": [{"body": "https://insideevs.com/news/343998/monthly-plug-in-ev-sales-scorecard/", "score": 0, "replies": [{"body": "I can't see where this source supports your assertion.", "score": 1, "replies": []}]}]}, {"body": "Ummm, real investors are smart enough to project trends, technology, look at specs, total driving experience, understand the difference between premium and economy vehicles...  I.e Toyota’s Lexus sells a premium Crossover that’s a far superior comparison, even though it’s incredibly lacking compared to Model Y.  The closest comparison is that Model Y falls between Porsche Macan and Cayenne, it is still far superior to both of those vehicles as well.\n\nI.e. be far slower to criticize, when it is you that is exhibiting the lack of knowledge in the area.", "score": 2, "replies": [{"body": "In other words, you're hoping and praying that battery power will somehow catch on.", "score": 1, "replies": [{"body": "I think what he's claiming is that it already has. They Model Y checks a lot of boxes in terms of style, performance, size, technology integration, and drive train.\n\nIt looks to be a formidable competitor within the EV market, but outside of it as well.", "score": 2, "replies": []}]}]}]}]}, {"body": "> No one cares if their car plugs in.\n\nI didn't know that, I like paying $1 per gallon and not $3 so...", "score": 3, "replies": [{"body": "I like taking total-cost-of-ownership into account. But let's focus on refueling/recharging costs alone, for the moment. How many cents per mile are you expecting to pay for recharging your Tesla Y? And how much does regular gasoline (of your preferred brand) sell for in your area?", "score": 0, "replies": [{"body": "Might want to also factor in the time not spent standing at the pump each week, though if we're getting that far into the weeds, might as well add back in the value of all those free fumes we get to huff. ;)", "score": 1, "replies": [{"body": "633 mile range, so not fueling up weekly.\n\nBut good luck never cleaning your windows.", "score": 0, "replies": []}]}]}]}, {"body": "> No one cares if their car plugs in.\n\nEV buyers do. Toyota buyers may not care as much, but there will be a significant premium for the Prime and it remains to be seen if it will offset the drawback.", "score": 1, "replies": [{"body": "> but there will be a significant premium for the Prime\n\nIt will be cheaper than RAV4 Hybrid after incentives. About half the cost of the insanely-priced $54k Y.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "I’ve been waiting for this.", "score": 9, "replies": []}, {"body": "When are we going to see a car carrier variant of Tesla Semi?", "score": 5, "replies": [{"body": "It's just the trailer, so I imagine around the time they hit production.", "score": 1, "replies": []}]}, {"body": "Maybe 40 cars there. How fast are they coming off the line? Maybe they need final software updates.", "score": 2, "replies": []}, {"body": "“Lack of demand?!?”", "score": 2, "replies": [{"body": "lol", "score": 2, "replies": []}]}]}
{"title": "When will we see a rebound and for how long?", "selftext": "First I'd like to say that I am a full fledged bear. Have been for years and my atrocious charts would prove that. However, I know this isn't going straight down. I sold all my puts friday and switched to a much smaller call position. I'm pretty sure we see big up day on monday but will that be it? Will we have a black Tuesday? I'm full expecting a market crash but how is it going to happen.", "id": "fbds9s", "created_utc": 1582988974.0, "score": 16, "upvote_ratio": 0.75, "num_comments": 98, "comments": [{"body": "Wait. You spent years as a bear, getting thrashed until the bulls harvested the organs from your barely-alive carcass, and as soon as things finally turned your way you decided to buy calls? Man, your hands must be made of wet toilet paper. And not that fancy two ply quilted stuff, but the scratchy one ply they have at poor people schools.", "score": 69, "replies": [{"body": "Maybe we should redefine bears as “people who always bet against the current direction of the stock market” and bulls as “people making money.”", "score": 21, "replies": [{"body": "We qualify what kind of bear or bull you are with the gay and autistic prefixes.", "score": 7, "replies": []}]}, {"body": "He got those truck stop hands, the type of toilet paper that doesn’t even have perforated tear lines. Just one giant, single ply, continuous roll.", "score": 7, "replies": []}, {"body": "Wait. So bears are only supposed to buy puts? I'm retarded but not retarded enough to think we won't have an up day in this crash. I'm trying to make extra tendies on monday so I have more money for puts after the rally.", "score": -3, "replies": [{"body": "Wtf have you been thinking for 11 years?", "score": 4, "replies": [{"body": "That your mom's a hoe", "score": -4, "replies": []}]}]}]}, {"body": "Monday, and just long enough for every WSBer's puts to be obliterated, before resuming the downtrend again.", "score": 18, "replies": [{"body": "Getting fucked on Monday 2 weeks in a row huh what a world I live in", "score": 3, "replies": []}, {"body": "Yeh if you’re a retard playing weeklies you degenerate", "score": 3, "replies": []}]}, {"body": "Probably a relief rally on mon that dies off when market closes, and then small rally when tues opens due to optimism from the bullshit friday pump and people thinking ‘mArKeTs PrIcEd iN’, then blood will flow in the streets as people realise the virus isnt going any where yet and its only gonna get worse globally \n\nSPY 220p 4/20", "score": 31, "replies": [{"body": "Holy shit could you imagine 220 lol", "score": 11, "replies": [{"body": "If it gets to 220 we would be trading batteries and can foods instead", "score": 11, "replies": [{"body": "Right......\n\nIt was at 240 in Dec 2018, but i'm sure if it hits 220 it'll be a full on apocalypse.", "score": 6, "replies": []}, {"body": "Long Duracell?", "score": 3, "replies": [{"body": "Long green giant", "score": 3, "replies": []}]}]}, {"body": "SPY crashing 30+% in 2 weeks, we will literally be in a new era of stock market after this, assuming we can recovered that is.\n\nAnd the horrible fact is that with the charts jumping up and down like that right now, it's not even that far fetch", "score": 9, "replies": [{"body": "One thing is important. We must capitalize financially if we lose close friends or family.  Just like Bobby axelrod", "score": 7, "replies": []}]}]}, {"body": "Our first relief rally lasted all of 2 hours and got absolutely decimated on Wednesday.\n\nThere will be no relief rally Monday.", "score": 11, "replies": [{"body": "Awww did someone buy puts expiring Monday? Did you not see Friday’s AH?\n\nShould’ve sold on Friday and bought cheaper PUTs for the upcoming rally on Monday.", "score": 1, "replies": [{"body": "What kind of fucking moron would buy puts expiring Monday?\n\nIf you think the last 5 minutes of trading on Friday plus after-hours is any indication of Monday you're actually a complete and utter retard.", "score": 3, "replies": [{"body": "Let’s see come this Monday. Just like me you’re spewing bullshit out of your mouth. You nor I aren’t experts in trading, let’s just be fucking real.", "score": 1, "replies": []}]}]}]}, {"body": "So my 3/16 puts are safe your saying", "score": 0, "replies": [{"body": "[deleted]", "score": 3, "replies": []}]}]}, {"body": "We’ll probably see a crash on Monday afternoon why even wait for Tuesday.", "score": 6, "replies": [{"body": "So you expect it to go straight down?", "score": 5, "replies": []}]}, {"body": "mysticmeg.com", "score": 5, "replies": []}, {"body": "MARKET CRASH", "score": 6, "replies": []}, {"body": "I'm expecting the market to rally 1/3 of the 14% its down.. roughly 4-5%, before moving lower. \n\nI think we could see a 2%, 2%, 1% rally mon, tue, wed, with a 1% loss thur, 2% loss fri, and a 5% loss the following week.\n\nAt 18-20% down, I think it'll be time for some longer duration calls on companies that people use more when they are at home sick.. video games, streaming services, etc. techonology will likely lead the rally, while financial services will lag with slowed growth and interest rate cuts on the horizon. \n\nTLDR: feels like a solid 20% correction. We're at 14%. It'll move up 5%, before falling to the 18-20% down range by early march.\n\nGL autist.", "score": 5, "replies": [{"body": "Bull trap!", "score": 2, "replies": [{"body": "Classic. Aka: tendie time.", "score": 2, "replies": []}]}, {"body": "I’m giving it until Wednesday before the market starts to drop again.", "score": 1, "replies": []}]}, {"body": "Please I don't want to hear about a green Monday lol", "score": 16, "replies": [{"body": "There has to be a big green day at some point. After the ramp friday it seems like the plan is monday. But Tuesday? Idk", "score": 3, "replies": [{"body": "There have been 3 green days this week if you don't count pre-market.\n\nThe rallies have been attempted and failing every time.", "score": 4, "replies": [{"body": "So? Do people really think crashes just go straight down?", "score": 1, "replies": []}]}, {"body": "Lol shits tanking hard on Monday", "score": 2, "replies": []}]}, {"body": "the time dacay though. why would you hold that.", "score": 2, "replies": [{"body": "I know people on this sub are retarded. But holding a 3/2 put over a weekend after a profitable Friday is a whole new level of retarded.", "score": 3, "replies": [{"body": "Excellent I've seen a lot of people make money off of retarded. Diamond hands... This is true DD.", "score": 2, "replies": []}]}]}]}, {"body": "No one knows.", "score": 3, "replies": [{"body": "Someone knows. Shits rigged for sure. No one here knows though. You're right about that", "score": 9, "replies": [{"body": "May", "score": 1, "replies": []}]}, {"body": "I know. But I'm not telling bruh.", "score": 1, "replies": []}]}, {"body": "Got word from a factory in China that has been shut down...they were hit hard with 40% of their work force.  The gov is allowing them to reopen and they expect to be nearly 100% staffed Monday.  They are saying orders are delayed 2 weeks.  All depends how the media pumps but China is definitely ramping production back up.  I think we will start hearing companies announce production is coming back online this week", "score": 4, "replies": [{"body": "They're ramping production up bc xi said so. He's got ppl to burn and the whole country to uphold.", "score": 2, "replies": [{"body": "This is my first hand knowledge from what my direct supplier is telling me as of Friday.  This is what I'm being told from company representatives who said the are back online.  The company does castings forging and heat treating metal parts for my company.", "score": 1, "replies": [{"body": "I'm not saying you're wrong lol. It's just they shouldn't be opening factories back up imo but they are because the govt is allowing them too soon in order to keep their market afloat", "score": 1, "replies": [{"body": "To wallstreet it doesn't matter health effects wise.....but if you have apple and other companies that come out saying production is back online shit will moon.", "score": 1, "replies": [{"body": "I'm not sure about moon but for sure a dead cat bounce is in order. I'm pretty 🌈 🐻 and think the correction is gonna be more serious going fwd but Chinese based supply chains staying afloat will certainly mitigate a lot of the damage.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Green next week fasho. Trump/Pence are going to suppress data on coronavirus, and the fed is going to act as appropriate aka revive the dead and a nice dead cat bounce.", "score": 6, "replies": [{"body": "You think it'll be the whole week and then red again or are you thinking this is over", "score": 2, "replies": []}, {"body": "So like Chicago with voting.", "score": 2, "replies": []}, {"body": "Guessing you haven’t looked at the news today?", "score": 0, "replies": [{"body": "So you think we'll have a 6th red day? With Trump in office and a accommodative fed? Rip to your puts, should have sold with the momentum on Friday.", "score": 3, "replies": [{"body": "You seem to think Trump can do something material about this. They have very little at their disposal and at best they’ll prop it up for a very short time before an even harder crash", "score": 2, "replies": [{"body": "Check my name, I'm the ultimate bear, but I've seen this stuff happen too many times. You have to be contrarian to the noobs in here if you want to make money.", "score": 3, "replies": [{"body": "What have you seen? Plz share your wisdom!", "score": 0, "replies": []}]}, {"body": "Lol you noobs said the same thing Defember 2018. Ok buddy.", "score": 0, "replies": [{"body": "Post your call positions so I can come back in a week and shit on you", "score": 1, "replies": [{"body": "!remindme 16 days", "score": 1, "replies": [{"body": "I will be messaging you in 16 days on [**2020-03-16 15:47:58 UTC**](http://www.wolframalpha.com/input/?i=2020-03-16%2015:47:58%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/fbds9s/when_will_we_see_a_rebound_and_for_how_long/fj3r77j/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Ffbds9s%2Fwhen_will_we_see_a_rebound_and_for_how_long%2Ffj3r77j%2F%5D%0A%0ARemindMe%21%202020-03-16%2015%3A47%3A58%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20fbds9s)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}, {"body": "Why remind you In 16 days? Monday is in 2 days... we’re talking about Monday.", "score": 1, "replies": [{"body": "Lol alright we can do monday", "score": 3, "replies": [{"body": "I like your style.", "score": 2, "replies": []}]}]}]}, {"body": "12 apple 300c 3/20 (4k worth) after the fed meeting. Better believe I'm coming back to call you a pussy when I hit.", "score": 1, "replies": [{"body": "Lol imma come post my put gains - have a lot more riding on that than you’ve got on calls", "score": 1, "replies": [{"body": "Lol alright looking forward to seeing.", "score": 2, "replies": [{"body": "Hiya Pal!\n\n\n\nhttps://imgur.com/a/PuGzXIe", "score": 1, "replies": [{"body": "Lol I made 25k off my apple calls alone.", "score": 2, "replies": []}, {"body": "Good job on those golden hands tho", "score": 2, "replies": [{"body": "Ha fair enough man, we’ll done on your Apple play. Good luck!", "score": 2, "replies": [{"body": "Hopefully we can do the same thing this upcoming week. You bearish? Or think itll bounce back on some weird riggy fed pump stuff", "score": 1, "replies": [{"body": "I don’t know when or why, but we’ll definitely have some green days this coming week haha. I think big in both directions. I rolled out a bunch of my puts to end of April today so I can ride it out. Have a small number of calls as a slight hedge. \n\n\n\nI’m medium term VERY bearish, short term is just pure volatility in both directions with an overall downtrend", "score": 2, "replies": [{"body": "Good shit!", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "I sold my SPY 3/6 320p on Friday before the last minute rally. I'm holding a few puts over the weekend on EW(abcs) and DAL, but I'm expecting a slight rally then eventual drop.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Proof or ban", "score": 9, "replies": []}, {"body": "My dad works at Microsoft and he says we’re in bear country", "score": 5, "replies": []}, {"body": "When have hedge funds ever been wrong.", "score": 3, "replies": []}, {"body": "Imagine the gains if you could yolo 26b all in market wide puts for 3/20...", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "I imagine a lot of hedge funds had their algos set to do this at 3:55pm on Friday and that’s why we saw that massive spike in the last 5 minutes yesterday.", "score": 1, "replies": [{"body": "I think the explanation is even more simple. Shorts closing their positions and margin calls.", "score": 6, "replies": []}]}]}, {"body": "OR and WA have their person to person case, you think the market will go up on Monday?", "score": 2, "replies": []}, {"body": "It depends we have been in a bull market for the past 10 years. I’m bullish on this mainly because people are selling based off of fear aka it’s an irrational market in my opinion . CoVid19 , SARS , SWINE FLU , HIV pandemic , MERS , Spanish influenza, Ebola it’ll be a thing of the past when ? I’m not sure but it will be the greatest minds in the world are working on this from everywhere all the Chinese smart people all the Ivy League people a cure is a matter of time but when though", "score": 1, "replies": [{"body": "Is it fear? Or is it because people around the world arent going to work or out buying stuff and the market was already way overpriced to begin with.", "score": 4, "replies": []}, {"body": "I don't recall any other 'pandemic' causing this many problems with production and supply chain.  I know it's real because I've been hit with such issues personally at my day job as have many other companies I deal with. \n\nI don't think that the health concern is as big as the media is making it out to be but I do believe that the reacation to it has materialised into something tangible. \n\nChina production has definitely taken a hit - we know how many other companies rely on this for their own product manufacturing let alone component / material supply. People have stopped flying so tourism everywhere has taken a hit. Chinese students can't get back to the foreign cities that they study in after having been home for Chinese New year (which coincided with the outbreak). Schools are shutting down. People aren't going out to public places like going out to eat or shopping as much out of fear. \n\nAll of these reactionary behaviours have to have some impact on economies. Irrational fear can still equal an effect on markets as a real or dangerous pandemic. \n\nIf any country can contain and bounce back from something like this rapidly, it's China. I have no doubts they'll be back to business in a matter of weeks. Once the fear and hype dies down there is still some flow on effects yet to be felt. The extents of which are yet to be known.", "score": 2, "replies": []}]}, {"body": "9:30am - 11:30 is my guess on Monday... but Bear Flu news is likely to be completely hose that prediction by Sunday afternoon.", "score": 1, "replies": []}, {"body": "I expect to see a red Monday. ppl tried to call a bounce everyday this week but failed and market continue to selloff despite fed chair's speech. the market wont stop until they fully priced in a global pandemic. some dead bounce will happen, but we cant time the market, we only can respect the trend and play along. keep short until a sustain bottom is found then reverse play. remember some other factor also in play while we r in this selloff, if credit frozen or some big companies went under, will cause systemic risk too. be flexible and open mind. im still shorting atm.", "score": 1, "replies": []}, {"body": "Boomer alert!  Boomer alert!  Boomer has been detected", "score": 1, "replies": [{"body": "I'm a millennial", "score": 1, "replies": [{"body": "A 🌈🐻 millennial?  Are you a mutant?", "score": 1, "replies": [{"body": "Wait. You think boomers are the bears and millennials are bulls?", "score": 3, "replies": [{"body": "I think millennials love tendies and boomers are all scared because they are about to die hence bears", "score": 1, "replies": [{"body": "The boomers from my experience are most definitely permabulls.  They created the buy and hold strategy because stocks \"only go up.\"", "score": 2, "replies": [{"body": "They were, but now they are looking at death in the face and are selling equities.  That’s why bond prices are out of this world.", "score": 1, "replies": [{"body": "They are? Pretty sure the boomers are the ones going to pump the market on monday", "score": 1, "replies": [{"body": "You are technically correct as the Fed is populated by boomers!", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}
{"title": "Listen up dumbfucks, here's the situation", "selftext": "For those of you who think China has the virus under control and will cause the market to trend upwards,\n\n1. Their media lies and only speculate that they are recovering. Leading indicators like PMI tell a different story.\n2. They went absolutely ballistic in their response due to SARS fears.\n3. No other country (except Singapore) is taking the crackdown response China has. Other countries are gonna take a harder hit than China.\n4. The US in particular was inflated. You all think its from fed injection and repo markets but let me tell you, the massive bull run was primarily due to the weakness of the global economy.\n5. The world had a TINA market for the US. Foreign countries were injecting money to prop their economies up... and this money got quickly invested into the US as a safe haven. Just look at Italy's 2019 debt bubble.\n\n(Hint: domestic funds stopped investing as much cash into the US starting in 2016. We also didn't inject enough money into market to make up for the increased market cap, even if 100% were immediately invested.)\n\nAND MOST IMPORTANTLY, Chinese supply chain is a huge indicator for us. Wu flu started in 2019 and we are barely feeling it now in 2020. It'll be months before we can even think about recovering, even if China is recovered (and they're not.)\n\n🌈🌈TLDR CUCK BULLS WHO WANDER NTO BEAR TERRITORY AND WILL BE EATEN ALIVE🌈🌈\n\nthanks for coming to my TED talk 🐻\n\nEdit: Also to note, investment attitude on other countries is much more active than US boomers. They are absolutely pulling their money out.", "id": "fbilqc", "created_utc": 1583008348.0, "score": 193, "upvote_ratio": 0.89, "num_comments": 97, "comments": [{"body": "Sir this is a gay conversion camp", "score": 76, "replies": [{"body": "he's in the right place then.", "score": 21, "replies": [{"body": "Don't need to be converted to what I already am", "score": 17, "replies": []}]}, {"body": "Yea can I see the vice president of the United States", "score": 9, "replies": []}, {"body": "At Buffalo wild wings.", "score": 5, "replies": [{"body": "At chili’s", "score": 1, "replies": [{"body": "Chili wendy wings", "score": 1, "replies": []}]}]}, {"body": "Mike Pence has joined the chat.", "score": 2, "replies": []}]}, {"body": "Bulls are so fucked, hope boomers bought the “dip” hard last week🐻🌈", "score": 129, "replies": [{"body": "Look at r/stocks some dumb fuck posted today he has 100k and \"wants to buy the dip\" LOL everyone suggested all blue chips too.", "score": 30, "replies": [{"body": "*It do3sNt m4ttER he'Ll mAKe a PrOFiT in 5 yEar5 regu4RdL3ss*", "score": 38, "replies": []}, {"body": "It’s hard to imagine a sub are dumber than us.   \n\nAutism speaks. It’s time to BUY PUTS.", "score": 6, "replies": []}, {"body": "To be fair, if his focus is on dividend growth stocks that he can basically buy and forget and he has a buy program for dollar cost averaging for the next few months, in the end he'll be just fine.", "score": 5, "replies": []}]}, {"body": "Dip? That dip will look like an all time high next month, when there are drops.", "score": 23, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Why? Because shit is about to hit the fan.", "score": 1, "replies": []}]}]}, {"body": "Ooooo im foaming at the mouth thinking of all the boom boom bucks", "score": 28, "replies": []}, {"body": "Stop saying crater....the govt has infinite money to fuck up this dip and moon stocks.  Stop jinxing this drop. \n\nEverybody short say STOCKS TO THE MOON MONDAY", "score": 10, "replies": []}, {"body": "We dnt even know if last week was the bottom.", "score": 0, "replies": []}]}, {"body": ">No other country (except Singapore) is taking the crackdown response China has. Other countries are gonna take a harder hit than China.\n\nYea it's crazy, they went full retard on this. 1800 (!) teams tracking down and testing each and every contact of infected people in Wuhan. Locked down cities. Built hospitals, sent 20k+ medical staff and so on.\n\nI doubt any other country would be able to do that at this scale.", "score": 29, "replies": [{"body": "lmao the funniest thing is if China manages to control the beer virus and then the rest of the world is infected, then China's gonna be reinfected.", "score": 23, "replies": [{"body": "China numba won", "score": 2, "replies": [{"body": "China numba five", "score": 5, "replies": []}, {"body": "China numba 4", "score": 2, "replies": []}]}, {"body": "They already said they got a new case from the UK.    Once factories get back up, you’ll see another round of infections.", "score": 1, "replies": [{"body": "If the rest of the world gives up and lets COVID run wild which I think is what's gonna happen, I think China would have no option but to follow. It takes way too much resources to maintain Corona free if it becomes so prevalent globally.", "score": 1, "replies": []}]}]}, {"body": "You’re forgetting both South and North Korea. It was actually reported weeks ago NK executed an official who violated quarantine. In South Korea they’ve tracked down and tested just about every secret cult member in Daegu, which is why their positive coronavirus count is so high. They’ve also largely managed to contain the virus in daegu", "score": 3, "replies": []}]}, {"body": "I'm bi as fuck normally 60 bull 40 bear. But I'm like 98% bear for now on", "score": 41, "replies": [{"body": "Fuk u r you'll change up and switch hit when the market tells your bich ass to", "score": 7, "replies": [{"body": "Bich please", "score": 4, "replies": [{"body": "The market will make you its bitch if it tells you calls and you buy puts it will beat you like your whitney Houston", "score": 8, "replies": [{"body": "Lolololol orrrrrr if you know how to play it and see the giant hole of shit in it, you'll make.money like I have big time all last week and most likely this week , call me bobby brown bitch", "score": 5, "replies": [{"body": "That shit holes gonna be there a while for you to stick your dick into but nothing is forever. Take opportunity when it comes , We are all the markets bitch  grats on last week you gayfuck", "score": 3, "replies": []}]}]}]}, {"body": "I just do what daddy market tells me.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 17, "replies": [{"body": "I've already started a GoFundMe", "score": 4, "replies": []}]}, {"body": "Wish I held my shorts. Loading up in pre-market on Monday.\n\nUp to my personal risk tolerance of course.", "score": 22, "replies": [{"body": "Gay. I’m betting all my tuition and rent money that the market crashes.", "score": 25, "replies": [{"body": "I love you", "score": 4, "replies": []}]}, {"body": "Don't regret. Just learn and make more.\n\nI closed 50% of my US shorts Friday morning and flipped them to Japan and Italy.", "score": 11, "replies": [{"body": "Agreed. I did the same. I dont regret it. A gain is a gain (albeit mine was really high - had puts for over a week)", "score": 3, "replies": []}, {"body": "Yeah. Took my profits and avoided the Fed pump", "score": 2, "replies": [{"body": "Nice man. I got greedy.", "score": 2, "replies": []}]}]}, {"body": "I would buy around noon after the initial crash", "score": 1, "replies": [{"body": "May be the best move. Drop could be priced in immediately.", "score": 2, "replies": []}]}]}, {"body": "Monday is all about moving the direction of the Market.... SCREW THE BULL / BEAR game...  THIS IS WSB, not let's pray for Tendies. \n\nWatch intently on the market futures... plan for dumb intervention methods... INCLUDING a market shutdown.  Do not be on the wrong side of that!  \n\nThis is going to be MMA Bull / Bear action with everyone at risk of losing their shirts playing for all the Benjamins...   \n\nWe are all small chips compared to the market forces coming at us...   RIDE THE WAVE TO VALHALLA whichever direction it starts moving.\n\n\\*NOTE I'm in SPY PUTS 280 Strike for later in the week... that's my play and will be until 9:31am Monday morning.  At that point there is no accuracy in my position I'm not going to stick out stupid if things head into weird.", "score": 24, "replies": [{"body": "My man", "score": 3, "replies": []}, {"body": "[deleted]", "score": -4, "replies": [{"body": "Please stop immediately.  You are going to get killed.", "score": 4, "replies": []}]}]}, {"body": "My parents went away on a week's vacation.", "score": 5, "replies": [{"body": "Looks like youll be inheriting those tendies", "score": 1, "replies": [{"body": "I don't remember that line from [the song](https://www.youtube.com/watch?v=jW3PFC86UNI), but if I was a talented video editor or talented at anything else, I would create a version of Parents Just Don't Understand about Coronavirus.", "score": 1, "replies": []}]}]}, {"body": "Riced in.", "score": 5, "replies": []}, {"body": "🐻🐻🐻🐻🐻🐻🐻", "score": 3, "replies": []}, {"body": "I'm gonna have a fricking yacht in a few months", "score": 9, "replies": []}, {"body": "i don't think there's any more DD needed for what's coming monday.\n\nwe all see the news", "score": 2, "replies": [{"body": "Yea and we still got all of sunday. Let the shit pile on", "score": 1, "replies": []}]}, {"body": "Thailand may be behind in tech, but not in pulling money out of their countrys exchange, whole country is dependent on exponential tourism growth", "score": 2, "replies": [{"body": "Pulling money out of our exchange, not theirs", "score": 1, "replies": [{"body": "no my point is they are outpacing us, SET down about 20%", "score": 1, "replies": [{"body": "Oh I misunderstood.\n\nThen yes I'd agree, any tourism-heavy or crowded country will get hit hard.", "score": 2, "replies": [{"body": "Thai investors bailing, buying gold,  SET down 20%, US exhanges averaging down about 12-13% now?", "score": 2, "replies": []}]}]}]}]}, {"body": "With all these words there should be a 1000% gain position to go with it.", "score": 2, "replies": []}, {"body": "What can I buy puts in? Airlines seem to already be priced in and SPY puts are expensive as shit right now", "score": 2, "replies": [{"body": "Airlines aren’t priced in, airlines are set for a nightmare situation if ticket sales tank.", "score": 3, "replies": [{"body": "Which so you suggest? Delta? Or smaller ones?", "score": 3, "replies": [{"body": "I’m holding 4/17 DAL $30 and UAL $55, MSFT 4/17 $130, and SPY 6/19 $200.  I hope to pick up some GM 4/17 $28 on Monday too.\n\nMy strategy is to flip long puts, Ive been burned too many times playing that FD game.", "score": 5, "replies": [{"body": "I've been thinking of long calls for airlines too after things eventually calm down, companies with more domestic and less international flights. \n\nBut let's see first how this week goes, no idea how much we still have down rally ahead of us.", "score": 3, "replies": [{"body": "Yes, so hard to tell right now.  I’ve been wanting to buy Boeing for when the 737 MAX gets re certified but who knows when that’ll happen, could drop another 15% before then.", "score": 1, "replies": []}]}]}]}]}, {"body": "My put positions:  \nSPCE  \nXOM  \nHSBC  \nSPY   \nTSLA", "score": 1, "replies": []}]}, {"body": "Just tell me who to buy puts on for the most tendies.", "score": 2, "replies": [{"body": "Puts on your future", "score": 2, "replies": [{"body": "Boomervirus only kills boomers. I’ll be alright.", "score": 1, "replies": []}]}]}, {"body": "Gonna not be a 🌈 🐻 for a minute and ask, has anyone put together a recap of what Sars did the China and it's market impact yet?", "score": 3, "replies": [{"body": "Not even remotely the same as the effects the Chinese supply chain has now.", "score": 8, "replies": []}, {"body": "Also I heard sars was after dot com crash, this is at mArket all time high", "score": 2, "replies": []}, {"body": "That was a different time. China wasn't nearly as big a player as it is now.", "score": 1, "replies": []}, {"body": "Yes, they had a 40% drawdown in China.", "score": -2, "replies": []}]}, {"body": "What's love got to do, got to do with it ?\n\nWhat is TINA besides Tina Turner?", "score": 3, "replies": [{"body": "there is no alternative = TINA", "score": 2, "replies": [{"body": "Thanks\n\nBut won't they just go invest it somewhere else say India or Russia. Yeah might not be as 100% but they get more interest.", "score": 1, "replies": [{"body": "Or just hold cash?\nOr try to stimulate their own economy?", "score": 1, "replies": []}]}]}]}, {"body": "Bruh. Literally anything can happen. \n\n1. North Korea sees USA vulnerabilities in handling beer virus and attacks\n2. Bears from planet Gay Bear invades Earth and shoots rainbows and we surrender\n3. Place all Americans in reeducation camps to learn about Gay Bear Constitution\n4. Ted saves us. Ted for 2020. (NOT TED CRUZ)", "score": 1, "replies": [{"body": "I would short any one of those 4 scenarios 🌈", "score": 7, "replies": []}]}, {"body": "Bullbears fucking bulls. So weird, can’t look away", "score": 1, "replies": []}, {"body": "MSCI global index already peaked", "score": 1, "replies": []}, {"body": "What’s the plan on Monday. Sell our spy puts at open and buy at a lower strike? Or is it gonna drop, and bounce up like on Friday.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "To be fair I mostly just creeped for years. Finally started an account so I could shitpost comments too.", "score": 11, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}, {"body": "I can’t wait for people to start deleting their post and DD because WRONGGGGG", "score": -1, "replies": []}, {"body": "what about the World Heath Organization expert from Canada? is he lying too?  \n  \nhttps://www.youtube.com/watch?v=r8dIi_13COM", "score": -7, "replies": [{"body": "I'm not even watching that until a credible source shares it", "score": 11, "replies": []}, {"body": "Bro that’s 50 minutes long, and he started off saying he will be brief. Also, people are skeptical about WHO and China’s relationship, and the big thing he wanted to address is how China is handling the issue.", "score": 2, "replies": []}]}, {"body": "stocks dont go down if people dont sell. majority panicked and sold last week. everything is priced in. tim apple will skyrocket spy next week cuz trump has apple stonks. you could choose to be that one lone wolf or follow these autists and get cucked.", "score": -7, "replies": [{"body": "Did u see the post “this is where you at now?»", "score": 2, "replies": []}]}]}
