{"title": "TSLA Working With AMD To Develop It's Own AI Chips", "selftext": "TSLA will build it's own chips based on AMD intellectual property and phase out it's reliance on NVDA chips in its cars\n\nhttps://www.cnbc.com/2017/09/20/tesla-building-an-ai-chip-for-its-cars-with-amd-globalfoundries.html", "id": "71dqjy", "created_utc": 1505937532.0, "score": 227, "upvote_ratio": 0.9, "num_comments": 41, "comments": [{"body": "Holy shit now you can mine eth while you drive,  then take a space x to da moon.", "score": 26, "replies": []}, {"body": "AMD spiking, NVDA dropping\n", "score": 61, "replies": [{"body": "I just sold all my AMD yesterday. Fml.", "score": 23, "replies": [{"body": "Same", "score": 4, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "All of it ", "score": 5, "replies": []}]}, {"body": "Lucky you. It dropped lol", "score": 1, "replies": []}]}]}, {"body": "You guys think it will settle back down to ~13 after this hype wears off? ", "score": 15, "replies": [{"body": "The number one thing in skeptical about is that none of the news included any numbers or reasoning on why they are going with them instead of nvidea. If I had to guess it's because they are doing it for less and with a smaller margin. \n\nThere are also rumours they are selling Vega nearly at cost. If all their new sales and contracts don't actually add to earnings this stock is gonna crash", "score": 8, "replies": [{"body": "$AMZN philosophy? Is it possible they are forgoing profits now just to break into the market.", "score": 3, "replies": [{"body": "The Vega cards aren't really compelling enough to break into the market in terms of the PC gaming market - Nvidia has been dominating for years even when they had worse cards for the money. \n\nVega is pretty good for low end productivity work for the cost of a card, but neither of the aforementioned markets are very large. \n\nAMD's CPUs are looking hopeful, but that's just one stream of revenue and Intel is going to release their new chips soon which should be good competition to Ryzen from the rumors. \n\n\n", "score": 1, "replies": [{"body": "Tssss.", "score": 1, "replies": []}]}]}, {"body": "They hired one of their ex-executives as well, so that also must have something to do with it. ", "score": 1, "replies": []}]}, {"body": "Going to need a NK nuclear test for this to go back to 13. Earnings in a month. With end of the month rebalance and earnings coming up, it will most likely have enough hype to break through the multi months resistance at 15.10. I can see it retracing back to 14.21 if it fails at 15. 14.21 will be the new floor heading into October.", "score": 3, "replies": [{"body": "I guess that NK nuclear test went through?", "score": 1, "replies": [{"body": "Conflicting reports about the news that came out last night. It's being retracted now. Wouldn't worry unless this close below 13.10. Look to buy between 13.35 and 13.27", "score": 1, "replies": []}]}]}, {"body": "Most definitely.  AMD seems to be a very popular stock with the new Robinhood/ millennial wave of investors, (this isn't an insult as I am one of those).\n\nIt's a brand which people know at a price people can afford with room to grow.  Any sign of positive news will jack the price up but it never seems to be sustainable.\n\n\nI bought into the hype when the price hit a 52 week high after earnings and that was exactly what the smart investors wanted....not making that mistake again.\n\n\nMy average price for all my shares is around $12.5 and if the price gets over $15 this morning I will most likely sell with confidence it will settle back in the mid 12's", "score": 1, "replies": [{"body": "It's not going to hit $15 with this news alone. It might get there if the earnings report is overly positive next month, but not today.", "score": 1, "replies": [{"body": "I was hoping the hype could continue for the morning before people got smart.\n\n\nA guy can dream can't he?", "score": 1, "replies": [{"body": "Yea, I suppose. I've just been bagholding/reinforcing my position since December. The last few months have made me jaded, lol", "score": 1, "replies": [{"body": "I'm just keeping the faith...I mean, right now they aren't losing me money and I don't see them doing that in the near future ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Son of a bitch.  I literally just sold AMD and bought NVDA.  What the literal fuck man. ", "score": 25, "replies": [{"body": "Just wait. If we all got upset over another stock that did better today then we'd be constantly changing our mind, selling low, and buying high. Best not get mad and accept its part of the game. We had those two huge days Friday and Monday for NVDA. The fact that it's holding its new highs for two days is leaving out its 50SMA. Could go down, but AMD could too. Also you had a 1% gain in the morning to sell. AMD up 4% is great: to bad they can't keep up with NVDA realistically. When I feel like this, the best thing I can do is realize that profiting while Investing requires discipline and not making rash moves because I fear missing out is the way to over bet, or sell early.  ", "score": 4, "replies": [{"body": "up 11% AH though.  They'll spike tomorrow, probably another 5-6% before it settles down.", "score": 1, "replies": []}]}, {"body": "> \n> It's a brand which people know at a price people can afford with room to grow. Any sign of positive news will jack the price up but it never seems to be sustainable.\n\nSo hurry up and sell and undo!", "score": 1, "replies": []}]}, {"body": "doesn't really matter much. Nvidia already secured 25+ of the car manufacturers with it's chip. \n\nGrats for AMD scoring 1, though. Too bad Tesla has such a tiny market share for them to make any money from it. ", "score": 20, "replies": [{"body": "This is not the only thing AMD has beat NVDA in the past couple of weeks. I think BIDU going with AMD over NVDA is more significant but TSLA news gets the most press.", "score": 4, "replies": [{"body": "the thing is though - AMD does not make any money. They may have decent tech with Ryzen and so on, but the margins are miniscule. Nvidia's profit margins are bananas. ", "score": 6, "replies": [{"body": "AMD is what NVDA was two years ago. Barring any catastrophic events, it's on it's way $20 per share in the next few months.", "score": 6, "replies": [{"body": "Almost certainly not.  They will keep doing better, but $20 before Q3 of next year is unlikely.", "score": -2, "replies": [{"body": "Oo what kind of Crystal ball you got??\n\nMine is from '89", "score": 7, "replies": []}]}]}, {"body": "To be fair Nvidia makes very little money as well, 8.34B compard to Intels 61.71B.  \n\nI think its assumed AMD will be able to capture some of that sweet Intel revenue as well.  GPU processing is just gravy.\n", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": -18, "replies": [{"body": "What's their P/E Ratio?\n\nedit: (-[493.59](http://www.nasdaq.com/symbol/tsla/pe-ratio))", "score": 14, "replies": []}, {"body": "ummm no they don't. When there are 60 billion worth of tesla's actually on the road with AMD chips in 2040 maybe this will be relevant if either has managed not to go bankrupt first. ", "score": 10, "replies": []}, {"body": "Market share =/= market cap\n", "score": 6, "replies": []}, {"body": "You must be thinking of Elons ego ", "score": 5, "replies": []}, {"body": "How much of that valuation is on the actual roads?", "score": 3, "replies": []}]}]}, {"body": "Just when I sold it off a day ago argh.", "score": 1, "replies": []}, {"body": "More companies should do this. ", "score": 1, "replies": []}, {"body": "Meh I’ll wait till AMD is 10$ and get in", "score": 1, "replies": []}]}
{"title": "$AMD, $TSLA, and $NVDA DD", "selftext": "", "id": "71e1zg", "created_utc": 1505940224.0, "score": 827, "upvote_ratio": 0.95, "num_comments": 40, "comments": [{"body": "[deleted]", "score": 82, "replies": [{"body": "If AMD can make a better processor than Nvidia's X1, which I think they have, then we're in for a wild ride. ", "score": 6, "replies": []}]}, {"body": "v 2.0 for you https://imgur.com/gallery/vNAkh", "score": 30, "replies": []}, {"body": "What's this meme?", "score": 28, "replies": [{"body": "it's the next generation meme", "score": 45, "replies": []}, {"body": "It's a very popular meme from /r/indianpeoplefacebook. The guy who made this picture is a bit of a legend over there, and whenever he changes who his best friend is, he posts pictures like these on facebook (without the WSB content, obviously).\n\nedit: [Original](https://i.imgur.com/Xu4ysI1.jpg)", "score": 37, "replies": [{"body": "Here you go: [friendship ended with Mudasir](http://a.co/7uGHUdw)", "score": 2, "replies": []}, {"body": "Best version:\nhttps://pbs.twimg.com/media/CQGY1wwU8AAIvzF.jpg", "score": 2, "replies": []}]}, {"body": "http://knowyourmeme.com/memes/friendship-ended-with-mudasir", "score": 17, "replies": [{"body": "holy shit i just got lost in a meme hole for like twenty minutes\n", "score": 17, "replies": [{"body": "You can get lost in my meme hole.", "score": 3, "replies": []}]}]}, {"body": "a meme based on the average AMD employees facebook profile", "score": 14, "replies": []}]}, {"body": "[deleted]", "score": 16, "replies": [{"body": "If you buy now your gains at $100 will still be over 600%", "score": 6, "replies": []}]}, {"body": "This is some incredible material thanks for contributing faggot", "score": 16, "replies": []}, {"body": "Needed this, ty", "score": 5, "replies": []}, {"body": "If you followed the story, you'd know TSLA and NVDA will end up together again.", "score": 9, "replies": [{"body": "some expectations you came here with. you must be new, welcome. DD means nothing.", "score": 2, "replies": [{"body": "I meant the story of our epic Indian friendships", "score": 2, "replies": []}]}]}, {"body": "lol", "score": 3, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "> Just waiting for the day when Google/waymo pairs up with ~~NVDA~~ AMD\n\nFixed it for you \n\n", "score": 3, "replies": []}]}, {"body": "I don't trust this. Indians do software not hardware", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "🇵🇰", "score": 2, "replies": []}]}, {"body": "Dank", "score": 1, "replies": []}, {"body": "OMG suebae deliver me from my sins.\nI was a doubter but now I see the light.\n\nElon piloting AMD on the marvelous rocket to Mars. ", "score": 1, "replies": []}, {"body": "Is that the Menendez brothers?", "score": 1, "replies": []}, {"body": "Amd now down premarket and Nvda recovered most of the losses from yesterday’s after hours news. ", "score": 1, "replies": []}, {"body": "I sold at $13.90 and now it's at $14.03.\n\nMistakes were made.", "score": 1, "replies": [{"body": "Not so fast my friend", "score": 2, "replies": []}]}, {"body": "Fuck I put my life savings into NVDA :(", "score": 1, "replies": [{"body": "buy more.", "score": 1, "replies": [{"body": "But I have no money", "score": 1, "replies": []}]}, {"body": "It's up a lot...", "score": 1, "replies": [{"body": "I bought it at it's all time high thinking it would go even higher. Boy was I wrong.", "score": 2, "replies": [{"body": "Wsb way", "score": 4, "replies": []}, {"body": "with your life savings? lmfao no tendies for you", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Course he did, you stupid fuck.", "score": 1, "replies": []}]}]}, {"body": "AMD gunna get you all the vegenes in the world.", "score": 0, "replies": []}]}
