{"title": "Playing North Korea this weekend: VIX long strangle 11.50 puts and 13 calls for next Wednesday", "selftext": "Wish me luck!\n\nPaid .65 for the 13 calls, and .15 for the 11.50 puts.\n\nYes I'm gambling so I didn't bet much.", "id": "6yx5sj", "created_utc": 1504900474.0, "score": 22, "upvote_ratio": 0.84, "num_comments": 40, "comments": [{"body": "This definitely belongs in r/wallstreetbets", "score": 4, "replies": []}, {"body": "Ah, the market maker's dream.", "score": 5, "replies": []}, {"body": "What broker ?", "score": 2, "replies": [{"body": "RBC, I'm Canadian.", "score": 1, "replies": []}]}, {"body": "Why'd you buy the puts if you're playing North Korea? Those will be worthless if something happens this weekend.", "score": 2, "replies": [{"body": "Because if NK doesn't do anything markets will open higher on Monday and VIX should go down a fair bit.", "score": 3, "replies": [{"body": "Both of those will be bad for long puts?", "score": 2, "replies": [{"body": "Are you asking a question or making an assertion?", "score": 1, "replies": [{"body": "Making an assertion in a questioning way. :-).\n\nIf the markets go higher, and/or the VIX falls, the value of your long puts will decline. But it sounded like you were using that as as justification for purchasing them, so I was more wondering whether you were aware of that dynamic.", "score": 1, "replies": [{"body": "Why would the value of long VIX puts decline if VIX goes down?", "score": 1, "replies": [{"body": "Oh, sorry, I was thinking of puts on the SPY. My bad.", "score": 1, "replies": []}, {"body": "Because of skew. Delta of course would cause them to make money, but if all you care about is delta, you might be more interested in futures trading.", "score": 1, "replies": [{"body": "It was more a rhetorical question because he didn't understand what I was doing. Thanks.", "score": 1, "replies": [{"body": "Yeah, just wanted to make sure you understood that long VIX options (calls or puts) lose money when VIX goes down b/c of the crazy skew.", "score": 1, "replies": [{"body": "That's not entirely true either though. If it was, my puts would be worth less than they were on Friday, and they went from .15 to .50.  \n\nIf you lose money on an ITM contract that was previously OTM, it's more likely either because you had too much theta decay or you had a nasty case of volatility crush. ", "score": 1, "replies": [{"body": "Should have specified - I'm assuming options are being delta hedged since delta can just be traded through futures. If you had delta hedged the options, they would have lost money", "score": 0, "replies": [{"body": "Ok thanks, not disagreeing with you just want to make sure we have clarity for other users in /r/options. Appreciate your participation in good discussions.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Merrill won't even take that money. ", "score": 1, "replies": []}, {"body": "am also long vix, but just straight calls. $14.50 oct 18. hopefully spikes sometime between now and then (but not so late that i've already lost everything to time decay).", "score": 1, "replies": []}, {"body": "There's not a single chance you'll make anything on those puts, no way it's under 11.50 by Wednesday ", "score": 1, "replies": [{"body": "Ahem. Currently looking at the VIX in the 10.50 - 11 range. ", "score": 4, "replies": [{"body": "Impressive, guess I was wrong! Good on ya", "score": 1, "replies": []}]}, {"body": "Think they mean short strangle and hoping for non event.", "score": 1, "replies": [{"body": "Oh haha reread, yeah that's a 0.65 cents donation to option gods. Probably didn't need to work bid/ask spread either", "score": 2, "replies": [{"body": "Nope I'm long.", "score": 1, "replies": [{"body": "Break even is:\n\n- 10.65\n-- 17% prob of touch\n-- 82% expire worthless\n\n- 13.85 \n-- 30% prob of touch \n-- 85% expire worthless\n\nYour Greeks are:\n\n- delta 20\n- gamma 35\n- theta -7\n- Vega 1.1\n\nSo your paying 7$ daily (including weekend), have massive gamma risk which will erase your delta in heart beat, and will not profit from vol increase despite this being long volatility strategy. *Sigh*\n\nFew tips:\n\n- 45 DTE to expiration is cycle you wanted (Oct 18)\n- learn your Greeks \n- you cannot afford to inventory volatility, period\n- close on Mon and reposition (eg 11.5/15 debit call spread 1.50)\n- VIX is also capital inefficient use UVXY or SVXY\n- on similar topic: never use calendars in VIX \n- search tasty trade.com for trading VIX explained\n\nAn even better strategy is do nothing until north Korea/trump does something and vol expands, then short it with naked calls or really wide call spreads. Set auto buy back at 50% max profit-- and enjoy nearly free money.\n\nDue to vol being mean reverting that works 90+% of time. Meanwhile your trade is pretty much guaranteed to fail. \n\nAnyway that's my 2cents from successfully trading lots of volatility, sorry if that sounds like rant... Cheers!\n\n", "score": 7, "replies": [{"body": "I would like to preface this by saying I don't condone OP's play but would just like to clear up a few mistakes in iamnatetorius' assessment.\n\n> your paying 7$ daily\n\nNo OP isn't. Theta isn't linear.\n\n\n>(you) have massive gamma risk\n\nNo OP doesn't. When you buy premium you are essentially paying for the gamma so to refer to it as 'gamma risk' is misguided. \n\n> (you) will not profit from vol increase\n\nYes OP could. He owns a call in the VIX he will profit if vol increases enough to cover the cost of the position which wouldn't take some black swan event, just a normal spike.\n\n> 45 DTE to expiration is cycle you wanted (Oct 18)\n\nNot necessarily. 45 DTE is not some magical timeframe conducive to every strategy. I realize it is part of the tastytrade mantra but if we give OP the benefit of the doubt he is playing this weekend like a binary event and made the correct decision to use the chain immediately following the assumed event.\n\n\n", "score": 4, "replies": [{"body": "Thanks for being the voice of reason. ", "score": 3, "replies": [{"body": "No problem, I just try to help people by identifying their obvious mistakes/misunderstandings and appreciate it when people identify my obvious mistakes/misunderstandings as well. I've learned a lot from this sub and appreciate the interplay.\n\nThat being said, have you ever thought about doing a call backspread  in the VIX? That should still give you the homerun if it spikes and if nothing happens and it falls you get to keep a little credit. Just something to think about for next time.", "score": 2, "replies": [{"body": "Thanks for clarifications, was a little drunk and this was the 500th I'm throwing away money on long VIX post I saw. Was more annoyed at volume of people setting money on fire than specific trade... My bad here.\n\nCalendars in VIX don't work because months aren't perfectly correlated. TDA rep mentioned that they've even had to cover losses in past cause users blown up and complained loudly (eg both legs lost money, why didn't ToS warn me).\n", "score": 1, "replies": [{"body": "First of all they are correlated. Very correlated in fact. Just not perfectly correlated or fungible. Calendars on vix still definitely work and you can definitely make money from them. Not too different from S&P calendars since vix options are just options on S&P options. ", "score": 1, "replies": [{"body": "Sure you can trade anything, but there's catch to vix calendars due unlike regular equities...\n\nBetween 5 min and 8min is details. It could be wrong sounded convincing to me.\n https://www.tastytrade.com/tt/shows/market-measures/episodes/vix-calendar-spreads-02-26-2015", "score": 1, "replies": []}]}]}]}]}]}, {"body": "The breakeven probability estimates have no real meaning for this trade. OP is hoping for some kind of 4-sigma reaction to a specific series of events related to North Korea. \n\nWe had one of those last week on the VIX itself. OP is fishing for another.\n\nThis is not the kind of trade I would make but this trade is not without reason. (This may not be the optimal choice of call and put for this trade but I would have to run the numbers and don't want to take the time to do that).\n\nGood luck on this. You will probably lose but you can have a good laugh on us if the VIX pops.\n\n", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "isn't most of the theta over the weekend taken on the friday prior? so if you want to minimize theta loss, it's better to buy later (like 3:45)?", "score": 1, "replies": [{"body": "I mean Friday isn't really the weekend. Weekend = close Friday to open Monday for options.", "score": 1, "replies": []}]}]}]}, {"body": "i'm 6 inches", "score": 1, "replies": [{"body": "6 inches ≈ 15 cm\n\n^metric ^units ^bot ^| ^[feedback](https://np.reddit.com/message/compose?to=cannawen&subject=metric%20units%20bot&message=I%20think%20your%20bot%20is...%20%5BPlease%20include%20a%20link%20if%20you%20are%20reporting%20a%20bug%20about%20a%20specific%20comment!%5D) ^| ^[source](https://github.com/cannawen/metric_units_reddit_bot) ^| ^[block](https://np.reddit.com/message/compose?to=metric_units&subject=stop&message=If%20you%20would%20like%20to%20stop%20seeing%20this%20bot%27s%20comments%2C%20please%20send%20this%20private%20message%20with%20the%20subject%20%27stop%27.%20If%20you%20are%20a%20moderator%2C%20please%20go%20to%20https%3A%2F%2Fwww.reddit.com%2Fr%2Foptions%2Fabout%2Fbanned%2F) ^| ^v0.8.0", "score": 2, "replies": [{"body": "Good bot", "score": 1, "replies": [{"body": "Good human", "score": 4, "replies": []}, {"body": "Thank you BilboT\\_Baggins for voting on metric\\_units.  \n\nThis bot wants to find the best and worst bots on Reddit. [You can view results here](https://goodbot-badbot.herokuapp.com/).  \n\n ***  \n\n^^Even ^^if ^^I ^^don't ^^reply ^^to ^^your ^^comment, ^^I'm ^^still ^^listening ^^for ^^votes. ^^Check ^^the ^^webpage ^^to ^^see ^^if ^^your ^^vote ^^registered!", "score": 1, "replies": []}]}]}]}]}]}]}]}]}
