{"title": "Softbank Sells Entire $3.6 Billion stake in Nvidia 2 weeks before Jensen Huang warns of 20% earnings miss", "selftext": "[deleted]", "id": "ao3nfm", "created_utc": 1549545594.0, "score": 951, "upvote_ratio": 0.99, "num_comments": 88, "comments": [{"body": "[deleted]", "score": 803, "replies": [{"body": "I sleep", "score": 462, "replies": [{"body": "Unless Elon Tweet", "score": 369, "replies": [{"body": "Real Shit", "score": 185, "replies": [{"body": "oh he got a kiss on the wrist and was sent home with a bandaid and a hug.", "score": 22, "replies": []}, {"body": "[deleted]", "score": -21, "replies": []}]}]}]}, {"body": "Probably busy busting everyone here for making 4 fucking day trades in a single week", "score": 204, "replies": [{"body": "you're going to jail for a looonnggg time you criminal scum ", "score": 73, "replies": []}, {"body": "Is that sec or finra?", "score": 12, "replies": []}]}, {"body": "My naym is sec  \nand i do sleep  \nunless the elon  \ndoes a tweep\n\nbut wen softbank  \nis selling stake  \ni firmly sleep  \ni do not wayk  \n\n  \n\nOh shit, my first gold, after all this time.", "score": 154, "replies": [{"body": "Securities I oversee / exchanges, too, must bow to me / And if an insider you be / its wise to fear the SEC. /\n\n...unless, of course, you're fucking MASSIVE. / Then we may remain quite passive / we take our time, we move like snails / when perps may be too big to fail.", "score": 11, "replies": []}, {"body": "/r/ilikthebred", "score": 7, "replies": []}]}, {"body": "Too busy busting people like Martha Stewart for $20k worth of insider trading ", "score": 84, "replies": [{"body": "And if she had held the stock she would have made money.", "score": 33, "replies": []}]}, {"body": "So the SEC won't let me be", "score": 21, "replies": [{"body": "[deleted]", "score": 15, "replies": [{"body": "So let me see, they tried to shut me down before the crush IV", "score": 11, "replies": []}]}]}, {"body": "I think Elon was right when said he did not have ANY respect whatsoever for SEC in 60 minutes interview", "score": 19, "replies": [{"body": "SROs do a better job upholding their responsibilities than the SEC does.  *\"Really makes you think.\"*", "score": 8, "replies": []}, {"body": "He is right, SEC is a joke.  House members can trade on insider information but no one else can, yea how is that legal and or fair to us plebs on robinhood", "score": 6, "replies": []}, {"body": "Whoh, slow down there cowboy. You mean to tell me you think Elon's statement that he himself made about his own opinion was in fact an opinion he himself holds?", "score": 1, "replies": []}]}, {"body": "Its not Lord Elon so PoPo (SEC) no care.", "score": 28, "replies": []}, {"body": "suckin Huang", "score": 8, "replies": []}, {"body": "Softbank is a Japanese company and Nvidia is Taiwanese, what makes you think they even executed the trade on a US based stock exchange? Would make more sense to do it through the Tokyo stock exchange in their native Yen currency. \n\nThe SEC wouldn't even be interested in this let alone able to do shit.\n\nAdded to that, even if the SEC did want to get involved Softbank could completely crush them. Softbank makes Goldman Sachs look like a bunch of toddlers, one of the newer Softbank funds on it's own is bigger than the entirety of Goldman Sachs (the tech focused Vision Fund worth $100 Billion USD), and that's just one fund amongst many. Softbank had an operating revenue of ‎¥8.90 trillion ($81+ billion USD) in 2017, compared to Goldman Sach's miniscule $36.62 billion USD.\n\nIf the SEC did want to mess with Softbank they could just start unloading US assets and unlike the vague threats we hear from China, in this case actually crash the US economy, and it wouldn't even require government sanctions or any kind of government oversight to do it.", "score": 6, "replies": [{"body": "Ironic the name is SoftBank because you just made me HARD", "score": 6, "replies": []}]}, {"body": "They were on holiday", "score": 1, "replies": []}, {"body": "Can we short the SEC", "score": 1, "replies": []}]}, {"body": "Why didn't they sell it when it was nearly $300 a share lol? Losers.", "score": 230, "replies": [{"body": "[deleted]", "score": 89, "replies": [{"body": "If they have 220 puts, they could also have held through the warning without any risk.", "score": 13, "replies": [{"body": "It really depends on if they have a better investment for the money. ", "score": 3, "replies": []}]}]}, {"body": "Their crystal ball was broken. ", "score": 35, "replies": []}]}, {"body": "That was after Nvidia dropped 50%. Softbank had ITM protective puts, probably wanted to exercise before expiration. ", "score": 176, "replies": [{"body": "Yep. They will have a very logical explanation for this move. Absolutely no chance they wouldn’t have an explanation for something which would otherwise be considered quite strange.", "score": 76, "replies": []}, {"body": "Yeah, it was also a few days after CES (Consumer Electronics Show) started where nvidia and their competitors made several announcements regarding their future products", "score": 11, "replies": []}]}, {"body": "Very legal and very cool, Jensen.", "score": 570, "replies": []}, {"body": "SoftBank own parts of so many companies they probably get info about the economy before anyone else. ", "score": 218, "replies": [{"body": "It's like they might have an entire team of analysts looking at this shit or something", "score": 139, "replies": [{"body": "I’m sure Masayoshi does the odd blind YOLO though ", "score": 34, "replies": [{"body": "I mean, he lost a lot of money in the past doing exactly that.", "score": 10, "replies": [{"body": "$70B in one day. Simply heroic.", "score": 6, "replies": [{"body": "I’m struggling to comprehend how such a thing is possible ", "score": 2, "replies": [{"body": "Copied from quora, may not have been in one day actually \n\n“Before the dot com crash Softbank was valued at $200 billion and Son was richer than Bill Gates for 3 days. \n\nJust before the crash, Son announced his intention to pay $15 billion USD in cash for Vodafone Japan, in order to compete with the government owned NTT Docomo network.  The market responded negatively and Softbank stock deteriorated.\n\nThen the dot com bubble crashed. \n\nSoftbank lost 99% of its market cap (it went from $200 billion to $2 billion) and operated at a $1 billion annual loss for several years.”", "score": 12, "replies": []}, {"body": "Bezos lost 70B the day of his divorce", "score": 5, "replies": []}]}]}]}]}]}, {"body": "Any kind of sufficiently advanced form of foreknowledge is still fraud, just not according to the SEC.", "score": 2, "replies": []}]}, {"body": "you forgot about the part about how the shares already dropped 50% before they sold their stake", "score": 101, "replies": [{"body": "They had puts so they were hedged by the 50% drop. It’s almost like an entity with billions AUM isn’t retarded. ", "score": 25, "replies": []}, {"body": "dropping 50% is better then dropping 51% or more.", "score": 46, "replies": []}]}, {"body": "[deleted]", "score": 34, "replies": [{"body": "Only if you use box spreads though", "score": 7, "replies": []}, {"body": "'no'\n\nyou get fucked just as hard as the person giving you the info, if you get caught", "score": 6, "replies": []}, {"body": "Details? ", "score": 4, "replies": []}, {"body": "See Phil Mickelson", "score": 4, "replies": []}, {"body": "I don't think this is true in the general case, see Wikipedia's entry for insider trading: \n\n> In the United States and many other jurisdictions, however, 'insiders' are not just limited to corporate officials and major shareholders where illegal insider trading is concerned but can include any individual who trades shares based on material non-public information in violation of some duty of trust. This duty may be imputed; for example, in many jurisdictions, in cases of where a corporate insider 'tips' a friend about non-public information likely to have an effect on the company's share price, the duty the corporate insider owes the company is now imputed to the friend and the friend violates a duty to the company if he trades on the basis of this information.", "score": 3, "replies": []}, {"body": "I don’t know the details of Mark Cuban specifically, but your post in general is incorrect. Otherwise people would just get their buddies or wives or kids to do all their insider trading for them and there might as well not be laws. ", "score": 2, "replies": []}]}, {"body": "So if they sold 3 months before THEN it would be ok right?", "score": 36, "replies": [{"body": "no sell! Only buy!", "score": 3, "replies": []}]}, {"body": "There's no such thing as insider trading.", "score": 25, "replies": []}, {"body": "🤔", "score": 7, "replies": []}, {"body": "ITT: people who think nvidia is hard to time.", "score": 6, "replies": []}, {"body": "Insider info, clearly ", "score": 20, "replies": [{"body": "We only do outsider trading here!\n\n&#x200B;", "score": 10, "replies": []}]}, {"body": "That's still not even close to their highest value though.. what is it like 155 a share? Less I imagine.  Seems like a nonissue ", "score": 7, "replies": []}, {"body": "Title lacks enough information.  Must just to conclusion.  Soft bank insider trader. Only explanation.  Reset value of Softbank to bad company.  ", "score": 4, "replies": []}, {"body": "Elon is right. No respect for the SEC", "score": 4, "replies": []}, {"body": "Who the fuck bought it? ", "score": 5, "replies": []}, {"body": "So Martha Stewart goes to prison for trading on \"inside information \" when all she did was follow her brokers advice, while SoftBank trades 3 billion dollars and was apparently \"just lucky \" to get out right before a massive earnings miss.", "score": 13, "replies": [{"body": "They had puts to hedge their position, timing didn’t matter so much. ", "score": 14, "replies": []}]}, {"body": "I like dogs.", "score": 6, "replies": [{"body": "Dogs like you.", "score": 8, "replies": [{"body": "And we are all happy", "score": 1, "replies": []}]}]}, {"body": "How the heck did they unload such a large amount and the stock price was going up at the time?", "score": 5, "replies": [{"body": "I always wonder about things like this as well. Same with stock buybacks - doesn't seem to influence the stock price as far as I can tell.", "score": 1, "replies": []}]}, {"body": "So calls or puts?", "score": 2, "replies": [{"body": "Bought puts, bought them too late and am now regretting it. Hoping the opening price tomorrow drops. Going to prevent me from playing $GT earnings", "score": 2, "replies": [{"body": "What did you buy at? Maybe there’s still hope.", "score": 1, "replies": [{"body": "$146 strike expiring tomorrow", "score": 2, "replies": [{"body": "Oof. Yeah hopefully you get an opening dip to sell at.", "score": 1, "replies": [{"body": "I got out even! Could have made money had I held a little longer but the it rocketed back up later and I would have been crushed", "score": 2, "replies": [{"body": "Nice! Any time you get out without a loss is a good day.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Yes", "score": 2, "replies": []}, {"body": "Inverse WSB.", "score": 1, "replies": []}]}, {"body": "Hmmmmm", "score": 2, "replies": []}, {"body": "Everything going on with nvidia is making it hard to take advantage of amd’s poor Radeon VII launch\n\nNvidia plateau incoming?", "score": 2, "replies": []}, {"body": "Masa had costless collars. And when I told you guys a few weeks ago if Mass sells it will hurt Nvidia you were all like “why would it hurt them?” \n\n😂 \n\nLong Softbank long KSA", "score": 3, "replies": []}, {"body": "First AMD and now NVDA. . .", "score": 1, "replies": []}, {"body": "Ruh roh.", "score": 1, "replies": []}, {"body": "2 weeks before this warning, but 4 days after CES started.", "score": 1, "replies": []}, {"body": "If they dumped that many shares on Jan 10 wouldn’t the stock have cratered? It looks like it’s been trading sideways since the beginning for January ", "score": 1, "replies": [{"body": "No because they had puts on it and once those puts went in the money they sold their shares ", "score": 2, "replies": []}]}, {"body": "Talk about timing the market \n\n&#x200B;", "score": 1, "replies": []}, {"body": "Putttt", "score": 0, "replies": []}]}
