{"title": "$TSLA Daily Investor Discussion - February 12, 2019", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Q419 Earnings Official Thread](https://www.reddit.com/r/teslamotors/comments/alewpn/tesla_q4_2018_financial_results_and_qa_webcast/).\n", "id": "aprg3n", "created_utc": 1549962285.0, "score": 10, "upvote_ratio": 0.92, "num_comments": 88, "comments": [{"body": "[deleted]", "score": 6, "replies": [{"body": "They are already there. January was very light, and I don’t expect February to be much better. \n\nI expect to see a $38,000ish dollar model 3 soon. To help fight the demand issues they are having. Tesla does not have enough international volume to sustain them through the year alone.\n\nTesla will limp along with demand, but it’s going to put incredible pressure on them financially. I believe they are already seeing this. This is going to really impact gross margins, and put downward pressure on them.\n\nI expect a Q1 loss Q2 and Q3 small profits, and a Q4 loss. Overall I bet , but am by no way certain, tesla will still have a net loss for 2019.  That’s also assuming no major build out for the Y. They may start to ramp Y build out in Q4 to help the numbers seem like they are fueling growth.\n\n(I do not think they are going to die or go bankwurpt. But I also don’t believe they can make a $35,000 model 3 profitably)", "score": 10, "replies": [{"body": "While I ultimately disagree with the outcome of what you think will happen, I do think that most of what you bring up is a valid concern for a bull. \n\nJanuary was light but we know that international shipments had not yet started. International doesn't have to necessarily last them through the year - just until the 35k comes out. International will cover the demand \"air pocket\" in the US in 1Q, and probably some of 2Q. \n\nWith that said, echoing your comments, I am somewhat concerned about demand in the near-term, and also see a profitable 35k Model 3 as an uncertainty at this stage. I'm a bull and a huge Elon fan, but anyone who says a profitable 35k Model 3 is a certainty at this point is not being truthful. It will likely get above 0% gross margin, but whether it will hit an adequate level to maintain overall Model 3 gross margin of 20%+ is a question mark. \n\nOn the Y comment, Elon has said that Y will not begin until early next year, and even then it will be in low volumes (they're aiming for volume production end of next year). So that won't be buffing any numbers. But if it did, I would consider that valid - I don't see why it would be considered a temporary boost to numbers.", "score": 3, "replies": [{"body": "Well said.\n\n> On the Y comment, Elon has said that Y will not begin until early next year, and even then it will be in low volumes (they're aiming for volume production end of next year). So that won't be buffing any numbers. But if it did, I would consider that valid - I don't see why it would be considered a temporary boost to numbers.\n\nSorry I mean capex spending at the end of this year to ramp up giga to produce it. I imagine the investment will gave to start in 2019 to hit an end of year 2020 release date. ", "score": 2, "replies": [{"body": "Ah, I see. Yes, Elon has said that they will begin tooling for the Model Y this year, and I believe this is factored into their capex guidance for the year of $2.5 billion", "score": 1, "replies": []}]}, {"body": "> just until the 35k comes out.\n\nThis assumes there are tons of people out there just dying to get a car with a smaller battery and budget interior when they could have gotten the same car with $7,900 of upgrades (premium interior and better range/battery) for only $3,500 more.  ", "score": -1, "replies": [{"body": "This is a fairly straight forward assumption that's not really controversial. We know that the total addressable market increases significantly when you move down in price. There are more people that can afford it the further down you go.", "score": 6, "replies": []}, {"body": "Most of the people that would theoretically be making that decision weren't even thinking about buying a Tesla or a car when that option was available.", "score": 5, "replies": []}, {"body": "It's more waiting to have the option to build the 35K model and see how much the extra options would cost", "score": 1, "replies": []}]}]}]}, {"body": "Honest answer.  Q1.\n\nThe fact that they are shipping cars overseas has no effect on USA *demand*, correct?  Maybe the cars are going overseas but the demand should be there.  So if there was still a 5,000/week demand in the US, then it would be piling up every week that production is dedicated to EU/China, right?  So after 8 weeks of producing for overseas, there would be an 8 week wait, yes?\n\nYet cars ordered in the USA are still available immediately.\n\nPlus, why would Tesla decrease prices *twice* other than to bolster weakening demand?\n\nThe reality is there's only so many people who want a ~$50,000+ EV.  They've exhausted that supply in the states.  And it appears to only be about 5 weeks of demand in Europe and even less in China.", "score": 6, "replies": [{"body": "We know that the expiration of the 7500 rebate at end of year pulled forward some demand from 1Q19 into 4Q18. We might also speculate that cold weather in the US might have led to some weakness in January. The question is how much of the weakness in January was due to those two factors vs. a structural decline in the underlying demand. It is a difficult question to answer and will lead to some uncertainty in the near-term for bulls. \n\nMy guess is that much of the January weakness came from those two factors; we know that demand for a $90K+ Tesla sedan has remained fairly steady at about 12,500 per qtr for multiple years (see my [tsla financial model here](https://thenonconsensus.com/tsla/) ), so a demand for a 50k Tesla sedan should be much higher. Is it 5x higher? Maybe not. As a reminder, January Model 3 shipments were estimated to be 6,500 for January.\n\nI think in the end we'll see that the demand for Model 3 has not tanked as much as some of the bears hope it has (many seem to believe that the January rate is the go-forward rate, which is almost certainly not true), but it has been depressed enough to provide urgency for Tesla to release the 35k model. Much of the Tesla story will revolve around whether they can get this model out within a couple quarters once the international demand buffer has been satisfied. ", "score": 9, "replies": []}, {"body": "Have you adjusted your view on Tesla at all after the last two quarters?", "score": 2, "replies": [{"body": "Not a whole lot.  They weathered the cash storm of late 2018 pretty well, and I don't think this upcoming $920M is going to be much of a problem for them.\n\nBut the doubts I always had were around their ability to :\n\n- make a $35k car at a positive PROFIT margin\n\n- keep SG&A spending low to enable the above, while somehow simultaneously massively expanding their service and charging network\n\n- keep warranty costs under control \n\nAnd I haven't seen anything yet to relieve any of those concerns.  I didn't doubt they could throw enough money at the problem to make ~100,000 high-end Model 3s for people who waited two years for them.  But... then what?   That's what we'll find out this year.  Demand in the US and financial performance when most sales are overseas and GHG and ZEV credits are nil are going to be interesting to watch.\n", "score": 3, "replies": [{"body": "Are you still thinking the TSLA story is done Q2 2019?", "score": 1, "replies": [{"body": "I don't know what you mean by \"done\", as I've never predicted BK.\n\nI think Q2 is when everyone realizes they are a niche automaker of luxury vehicles that will top out at 400,000-500,000 vehicles per year globally, yes.\n", "score": 5, "replies": [{"body": "Well you previously commented \"Q2 2019\" in response to \"when will the entire shitshow collapse\", which granted is a bit vague, but the context appeared to be predicting failure in Q2. You might now be the most bullish bear thinking they'll be able to do 400k+ per year.", "score": 2, "replies": [{"body": "I mean collapse in the sense that what they are will become apparent to everyone - even bulls - and the valuation will adjust accordingly", "score": 3, "replies": []}]}]}]}, {"body": "So the last two quarters where they massively augmented their sales while reducing sga haven't relieved your sga concern ? ", "score": 1, "replies": [{"body": "It's pretty clear you didn't read my statement completely.\n\nThe \"massive\" augmentation came from pent-up demand for $60,000 Model 3s.  That is now gone.  So the fact that it did happen means nothing for the future - it's gone.  \n\nYeah, they reduced SG&A by cutting workforce, and how is that working out for their customer service?  The customer base is demonstrably less happy with Tesla in the last few months - cars without plates, delivery appointments being moved multiple times, cars in service for months.\n\nThey're pissing away the brand equity they built over the last several years to squeak out a small profit.  I don't know why that would strike you as a good thing.\n", "score": 3, "replies": [{"body": "I did read it", "score": 1, "replies": []}]}]}]}]}, {"body": "How fast do you think US demand will grow over the next year? It seems unlikely to shrink, given that there are no major competitors to Tesla, so the people who currently want one will probably buy one given the opportunity. But also, every year more people, especially young people, need new cars, so this will presumably add some demand each year, for every car.\n\nLong term, EV demand might start to take more and more of the share as our culture becomes climate-minded. Do you have any sense for how many cars this would be?", "score": 2, "replies": [{"body": "> It seems unlikely to shrink,\n\nShrink from what?  The 4700 per week rate they hit in Q4?  I doubt they ever hit that in the US again.  I'd be shocked if they ever hit 3000 per week in the US again.", "score": 2, "replies": [{"body": "Sorry, I meant the *total* number of people wanting to buy Teslas (including those who already bought them and are satisfied) is unlikely to shrink. It's like, the integral of the thing you're referring to. My question is about how THIS number is changing over time.", "score": 1, "replies": [{"body": "Got it.  I think the problem Tesla has is they hyped this one product so much, and so far ahead of launch, that they really have no idea how many people will actually buy it.  The sales numbers from 3Q18 to 3Q19 are going to all be very good, but I suspect at that point they'll have basically satiated demand that would have typically been spread out over several years.  ", "score": 0, "replies": [{"body": "Assuming EV:ICE will remain 3:97? Because if it's going towards more like 100:0 you might have to adjust for that.", "score": 2, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Agreed, and as they've already maxed out economies of scale on the capital side, I don't see that margin happening on a $35k car anytime soon.\n", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "10 to 15% on 35k$ gets them to rather idealize targets. Failure to get those, and I suspect they won't, is not really equivalent to a dramatically bad situation.", "score": 1, "replies": []}]}, {"body": "They haven't maxed out economies of scale on the capital side (not sure what you mean by capital side).   \nBy producing at a higher rate, they'll get leverage on their fixed costs and spread out their D&A over a larger base of vehicles, which should drive down costs further. \n\nWith that said, it will still be difficult for sure to get to a 35k gross margin somewhere in the teens. They will need to find other sources as well beyond just increasing production rate.", "score": 1, "replies": [{"body": "I like how you disagreed with my comment despite admitting you weren't sure what I meant by it.\n\nWhen I say \"capital side\" I mean use of fixed assets in the plant.  The cost per car attributable to depreciation of capex and plant costs can't drop any further - because they need to add capex and floor capacity to produce any more.  \n\nYes, they can further reduce SGA and R&D costs with more volume.  But they also cannot keep SGA and R&D flat if they want to grow the company.  So they're stuck.\n", "score": 3, "replies": [{"body": "Yeah, I figured that's what you meant, but I still disagree. The fixed assets that you discuss and the depreciation of it is largely a fixed cost. They've already paid for the infrastructure investments. If they can produce more cars, it drives revenue up and margins improve as the costs of the plant stay the same. You are assuming that they will have to add more capex to produce more, but Tesla has said this is not true - they've explicitly stated that they can get to 7k with minimal capex. And up to this point they have continued to increase production with little capex additions. They've backed this up as capex has come in significantly below consensus for the last several quarters.\n\nIf you disagree, that's fine, but it's an opinion and not a fact as you presented in your earlier comment. There is nothing yet that suggests that they have maxed out economies of scale. They've seen huge leverage on fixed costs, even on SG&A and R&D (which have lower fixed cost components generally). Whether they can get to 7k is still up in the air, but they've clearly got more room to go and haven't yet maxed out.", "score": 1, "replies": []}]}]}]}]}, {"body": "So they declare bankruptcy in q1?", "score": -4, "replies": [{"body": "Was bankruptcy even part of the discussion?  What value did you just add to this conversation?\n", "score": 3, "replies": [{"body": "What do you mean by \"die\"??? ", "score": 0, "replies": [{"body": "I didn't say die.  OP did.  I explained why I thought we would see a demand drop in Q1 and made no predictions past that.  You seem to be looking for an argument that doesn't exist\n", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "That assumes they can turn a profit on a $35k model 3. (So that’ll translate to around a $42-$45k ASP)\n\nEdit:\nThat’s a lot of margin to pull out of a car.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "This is a big unknown.  The Model 3 is competitive enough against competition like BMW 3-Series and MB C-Class.  \n\nCan it also convert customers of higher trim mainstream cars?  People who buy or lease something like a Toyota Camry XLE or XSE V6, or a Honda Accord Sport 2.0T or EX-L 2.0T or Touring are in the market for a 33-35k car.  Mazda, Subaru, and others sell similar high-spec cars in this price range.  How many customers looking at these products could be convinced to stretch for a 38k base midrange or 42.9k Premium midrange Model 3?   ", "score": 1, "replies": []}]}, {"body": "Morgan Stanley had some good words today.", "score": 7, "replies": [{"body": "Yup. For those who don't have access, they argued that their physical infrastructure is a potential competitive moat that can \"over time, improve the customer experience, reduce friction points, and support the fleet management of many millions of tesla vehicles.\" Right now it's straining a bit under the fleet size, but Elon is focused on improving service operations.", "score": 3, "replies": [{"body": "> Elon is focused on improving service operations.\n\nThis has been repeated a lot, and obviously service is a major concern.  But where's the evidence that they're actually doing it?  Hell, they just laid off a ton of service staff in the recent round of layoffs even as the service workload is exploding.\n\nI'm concerned about this because Tesla doesn't have a ton of time to get this right.  Consumer perceptions of car companies are very difficult to change once they become ingrained, and perceptions of things like reliability and total cost of ownership have a significant impact on purchasing decisions.  It took Kia and Hyundai nearly a decade to shed their associations with poor quality.  If it becomes \"common knowledge\" that Tesla's are neat and fun to drive but a nightmare to own and maintain, Tesla will have a very difficult time shaking that reputation.  \n\nThey don't get to fail until they get it right on this one - a year of service nightmares will leave the public thinking that their service sucks even after they fix it.", "score": 3, "replies": [{"body": "We'll all have to wait and see if what they say is true - you're not going to get immediate evidence 2 weeks out from when they stated it. \n\nImportant to understand that Musk's focus has been shifting from fire to fire. First it was production. Then it was deliveries to customers. Then it was costs/working capital management. Each time his focus has been on something, it has improved and stabilized. Service is the next priority according to him. This doesn't mean that they will for sure get it right. We'll have to wait and see what changes get implemented over the next several quarters. For now, we do know that they have increased their service cars to 411. They'll have to do a lot more but these things do not happen in weeks", "score": 1, "replies": []}]}, {"body": "> Elon is focused on improving service operations\n\nDoes this mean anything anymore? Elon says a lot of stuff.\n\nThis was a similar statement:\n\nhttps://twitter.com/elonmusk/status/1052356093534302208\n\nI don't think much happened with the above, but correct me if I'm wrong.", "score": 2, "replies": [{"body": "You're right that he says a ton of stuff and you kinda have to take some of his words with a grain of salt. With that said, I would put much more weight on his comments to investors (as opposed to his statements to people on Twitter). Within their investor letter, they claim that they \"consider improving customer service as a top priority at the moment.\" Elon also further emphasized that on the call.\n\nRecall that in prior quarters, Elon had emphasized cost management and working capital/FCF improvements as his priorities, and they have done well in those areas since then - FCF beat consensus by about $740 million in 3Q and $360 million in 4Q.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I'm a Tesla fan, but I think you're off on a lot of points.\n\n>Musk has said that Tesla would be willing to partner with other manufacturers to use superchargers, but that no one had approached them about it. Which seems crazy, maybe everyone's just so used to thinking about moats and competitive advantages that they'd never imagine anyone would share something as important as the supercharger network?\n\nIt makes perfect sense. Tesla built branded superchargers that use a proprietary connector. No other automaker is going to want their customers charging at a competitor's branded charger using the competitors proprietary connector. And Tesla didn't offer to let others no strings attached, they offered to let others use the network if they shared the costs (persumably maintenance, expansion, electric bill, etc.). It's not clear who would actually control the chargers in the end. \n\nThe only company that has started selling EVs in bulk in the US that might care to take advantage of superchargers is GM with the Bolt. But remember the Bolt only handles up to 50kW (maybe 80kW). And it's not even clear Chevy wants to sell more than they already sell as they almost certainly lose money on them still. \n\n>I've seen lots of people say that any big automaker could catch up Tesla in no time. That the cost of making superchargers is pennies compared VW's or Toyota's annual revenues. But it seems like if that were the case, someone should've at least started by now? Even if money is the easy part, there's a huge amount of planning and permitting and construction to do. Anyone who starts right now will likely take years to hit Tesla's current state.\n\nIt is pennies compared to what Tesla's spent. There's no reason Tesla or anyone else couldn't open 1000 fast charging sites in the US next year alone if they hand the funds/people dedicated to making it happen. Of cousre they're limited by permiting, etc. But you can work 1000 of them in parallel. But why would anyone care to? What, is GM going to drop a few hundred million building out a charging network for their ~20k Bolts per year? No one else is trying to sell long-range EVs in Tesla like numbers, at least no in the US. So they simply havne't had the need for a network yet. Plus, traditional auto-maker aren't use to having to build out the fueling infrastcuture, they see that as someone elses problem. \n\nThat doens't mean Tesla doesn't have advantages with their network. They've figured out how to make much simpler & more reliable stations than anyone else. But if another company was serious about building out a netowrk, they could in short order. Only VW has put any serious money towards that goal though (Electrify American) and that was only becuase of a court order.\n\n>The new generation of superchargers could be a big game changer. Let's say they could charge twice as fast, then that means that the capacity for all stations would double when they're installed. Lines would be reduced significantly, and longer trips would get a lot more convenient. I suspect that part of the reason new installs have slowed down is that they don't want to install old hardware when the new generation is coming soon.\n\nOf course faster charging is great. But I think you're underestimating how much work it would take to upgrade a supercharger station to handle twice the amps. You're talking more than just swapping out cables. Potentially hundreds of thousands of dollars per site & permits all over again. As far as new installs, if new chargers were coming tomorrow, Tesla would just stop installing new 120kW chargers. But they haven't. So I wouldn't get your hopes up too much just yet.  \n", "score": 3, "replies": []}]}]}]}, {"body": "Losing relative to the NASDAQ today and at relatively low volume.  \n  \nFor discussion: how do y'all see Brexit possibly affecting TSLA? My take is basically that anything short of cancelling Brexit is gonna be a hard blow to world markets. I'd like to have TSLA rally before Brexit and sell, then buy somewhere in the crash.", "score": 4, "replies": [{"body": "Could be good for the US.  Having a separate trading partner near the EU allows a better negotiating position.  Tech company's profits are in many ways very reliant on US dominance over global trade.\n\nIts bad for British citizens, but that isn't the same as being bad for the US stock market.", "score": 3, "replies": []}, {"body": "I am from Kent in the UK (and install solar panels myself - unfortunately the government has ruined that for us too). I have sold all my shares until I know for sure what is happening. I think it will end up being a complete disaster unless we are given another chance to vote.\n\nWith regards the the future of TSLA and EV's in general within the UK, I think there's a demand - we have installed over 1000 solar systems in our 50 mile local radius and around 50 or so of those customers also wanted an electric car charger installed (and they all had a good amount of money to spend). \n\nBrexit is a shit show and I think it could spark a recession if there is a no deal, potentially having an impact on the stock market as a whole. Who knows what will! ", "score": 3, "replies": [{"body": "solar panels in the UK... a monument to hope? ;)\n\n", "score": 5, "replies": []}, {"body": "Wouldn't you be better off holding your shares if you're worried the pound is going to drop further?\n", "score": 2, "replies": []}]}, {"body": "Weak pound and euro is also bad for Tesla international revenue (exchanged to USD).", "score": 2, "replies": [{"body": "It also makes a European gigafactory cheaper.", "score": 3, "replies": []}]}, {"body": "Don’t think it’ll impact them much. That’s a relatively small market for them.\n\n(Unless the Marco just takes a total shit)", "score": 1, "replies": []}, {"body": " When we leave it's likely the pound will fall in the short term (making a Tesla more expensive) and then go up as markets realise it's not the end of the world.\n\nThe EU runs a protectionist economy and puts tariffs on anything coming in from out of the EU. Its 10% on cars. Not sure if the UK is ditching them all immediately upon leaving or if they are writing them all into law until new ones are negotiated. I believe they end immediately. In which case a Tesla could actually get cheaper as the UK would be in charge of import tariffs and could choose to set them to zero. Or match what the US charges most other countries which is a 2.5% import tariff.\n\nUnder WTO rules they should be matched. \n\n", "score": 1, "replies": [{"body": "Why would the UK want to encourage the importing of American cars? ", "score": 1, "replies": [{"body": "If more people buy cars due to lower prices, it stimulates the economy.", "score": 1, "replies": []}, {"body": "If more people buy cars due to lower prices, it stimulates the economy.", "score": 1, "replies": []}, {"body": "If more people buy cars due to lower prices, it stimulates the economy.", "score": 1, "replies": [{"body": "It would stimulate the American economy.", "score": 1, "replies": [{"body": "And the UK economy. We are a service economy.", "score": 1, "replies": [{"body": "American cars won't be any cheaper than the ones we currently buy from the UK or EU, so how would it increase sales?", "score": 1, "replies": [{"body": "Potentially a Tesla could be 10% cheaper. Depending on what that UK does with their import tariffs. Trump is currently trying to get the EU to remove the 10% tariff on American autos. When the UK goes out. They will be able to set their own import tariffs. They could choose to set it to zero.", "score": 1, "replies": [{"body": "Again, why would they want people to buy American Teslas instead of their own imported cars?", "score": 1, "replies": [{"body": "You pay 20% vat on all sales. The more attractive the price. The more people buy. The more tax they receive...", "score": 1, "replies": [{"body": "Again, they will pay VAT on UK car sales.", "score": 1, "replies": [{"body": "Lol. No again! \n\nYes they will, but if a car is more expensive people are less likely to buy it. You can't collect tax on something that doesn't get sold. \n\n", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "Without a deal, European cars will become more expensive in the UK. Could be an opportunity for Tesla.\n\nI doubt it will seriously affect world markets. As an example, the Dutch border patrol is already hiring extra staff to handle the more extensive border checks. It could affect transport of perishable goods like flowers, but I doubt the border checks will take so long it would even affect those. The UK worked fine before the EU-trade-zone existed.", "score": 1, "replies": [{"body": "You're grossly underestimating the impact. Why do you think they wanted to set up additional ferry lines? Because the current ones wouldn't be able to handle the border control checks in a timely manner.\n\nAnd yes the UK worked fine before the EU trade zone existed, but the world is a very different place today, and the UK has almost no trade deals with other countries.\n\nIt's going to be messy.", "score": 2, "replies": []}, {"body": "> Without a deal, European cars will become more expensive in the UK. Could be an opportunity for Tesla.\n\nI don't think Brexit is going to leave Brits with lots of extra money to spend on luxury imported cars with 10% tariffs, no tax credits and little in the way of charging infrastructure. And a declining pound.\n\n>The UK worked fine before the EU-trade-zone existed.\n\nThe UK was known as the 'sick man of Europe' before they joined the common market. Bodies were unburied, companies were put on a three day week, everywhere was on strike, they crawled to the IMF for a bailout. Britain's entire car industry only exists because of the EU.", "score": 2, "replies": []}]}]}, {"body": "Tons of tech stocks up 0.5-1% premarket, futures looking good, here's hoping for a good general market movement day.", "score": 3, "replies": []}, {"body": "** Scoop: GM Reportedly Working On Electric Pickup Truck With Tesla Powertrain**\n\nhttps://cleantechnica.com/2019/02/12/scoop-gm-working-on-electric-pickup-truck-with-tesla-powertrain/\n\n", "score": 6, "replies": [{"body": "This might excite some private investors but I put it in the \"plausible; let's see\" category. IIRC, powertrains is one of the highly automated lines, so if that's the case and they've ramped production way over that of other lines, why not sell surplus? As long as the two trucks don't compete...", "score": 2, "replies": [{"body": "\"As long as the two trucks don't compete\"\n\nWhat do you mean exactly? Build two different trucks around a Tesla powertrain and no matter what the rest of the car looks like, there should be some competition, right?", "score": 2, "replies": [{"body": "I would also think so. However, perhaps the two trucks are so far apart in terms of market, Tesla would be willing to provide them with powertrains, although even then, I could imagine they would be lower spec powertrains.  \n  \nHowever: why would any company go for any other segment than the F-150? This is what makes me skeptical of this claim, because then the two trucks would be very much in competition with one another.", "score": 2, "replies": []}, {"body": "Strategically Tesla should care more about vehicles that are likely to be used in the Tesla network or otherwise benefit from autonomy. A pickup truck is likely less of these things.I think that taking a role as a supplier for safer income and reaching customers that might be brand loyal is not a bad spproach.\n\nOh and kill solar.", "score": 1, "replies": [{"body": ">Oh and kill solar.\n\nYeah you lost me there", "score": 1, "replies": [{"body": "But I made such a good argument!", "score": 1, "replies": []}]}, {"body": "Killing solar is not an option. It's more a matter of making it work. Tesla as a company was BUILT to advance the advent of environmental sustainability. This will not happen without wider adoption of affordable solar.", "score": 0, "replies": []}]}]}]}, {"body": "I doubt it. But this is an interesting idea.", "score": 2, "replies": []}]}, {"body": "When are they filing the SEC form for earnings?", "score": 2, "replies": [{"body": "10k filing has to be processed before 60 days since the end of the quarter.\n\nEdit:\nDamnit English is hard.", "score": 3, "replies": []}]}, {"body": "What a garbage stock!", "score": 3, "replies": [{"body": "Why’s that?", "score": 1, "replies": [{"body": "Because it trades flat for years, and trades more on rockets than fundamentals.", "score": 3, "replies": [{"body": "It trades like that because of people behaving like you and spreading FUD. Powerful people. \n\nIt will change dramatically in short period of time (it doesn't mean it is close). We are all waiting for the right moment of the S curve. ", "score": 2, "replies": [{"body": "Oh yes.... FUD\n\nI’m sure FUD is what made the model 3 ramp plunged into production hell. I’m sure FUD is what made Tesla layoff 7% of its staff. I’m sure FUD made Musk attempt to take his company private with no capital and get removed as the chairman. \n\nBut yea, wrap it all up in a little box and label it FUD.", "score": 2, "replies": []}]}]}]}]}, {"body": "Didn't expect such a downturn at 12:15-13:18.  Could this be due to the 'The Drive' article?  Looked for a disclaimer at the end of the article (I don't own any stock, etc) but didn't see one.", "score": 2, "replies": []}, {"body": "Tesla's VP of global recruiting is leaving the company\n\nhttps://www.businessinsider.com/tesla-vp-recruiting-leaving-company-2019-2", "score": 2, "replies": [{"body": "Oops. Just pulled out the pin holding the company together.", "score": 8, "replies": [{"body": "LOL They're doomed, as always.", "score": 8, "replies": []}]}, {"body": "*Retiring to travel the world and be with family*", "score": 4, "replies": []}]}]}
