{"title": "AMD up today", "selftext": "I had call option for AMD for 2 weeks now, ngl it was a painful journey. Now I’m up a little bit, should I keep holding or sell it. \n\nBtw, I’m new to trading ", "id": "1b372lu", "created_utc": 1709230426.0, "score": 3, "upvote_ratio": 0.55, "num_comments": 40, "comments": [{"body": "I have held calls for AMD as well and I took profits on most of my contracts today. There will be another opportunity, live to see another day.", "score": 11, "replies": []}, {"body": "Take the green, AMD has sucked for me \n\nEdit: clearly don’t know what I’m talking about, AMD at 52 week high lol. You can always sell part of your position 🤷‍♀️", "score": 15, "replies": [{"body": "same, have had a put position for 3 weeks now. its basically gone with these random +8% days", "score": 3, "replies": []}]}, {"body": "Take your profits. Learn how to win before you learn how to be greedy", "score": 7, "replies": []}, {"body": "The longer you hold the less is worth depending on your time value but if you think the rally will keep going then hold I guess. No one knows one day the stupid stock jumps another the it gaps down", "score": 5, "replies": []}, {"body": "The bear will roar at midnight !", "score": 5, "replies": []}, {"body": "I had calls expiry tomorrow 190 target and it took a while but finally hit today. But with time decay the sooner the better to close otherwise it isn't really giving out as much in profit", "score": 2, "replies": []}, {"body": "Keep a runner, AMD to the moon. Didn’t know r/options is where the bears ran off to", "score": 2, "replies": []}, {"body": "With a P/E over 350 take the money, it's going to fall soon", "score": -1, "replies": [{"body": "Ffs can people even do a little bit of research before they just start throwing numbers out there about companies.... That is because of their recent acquisition", "score": 1, "replies": [{"body": "Why does the PE ratio increase during an aquisition?", "score": 1, "replies": [{"body": "Because the acquisition has an adverse effect in their overall earnings but that doesn't accurately reflect the profitability (or earnings) of the actual business. \n\nRead the comment thread here for a more in depth explanation https://www.reddit.com/r/investing/s/5hb8W9Lu9Y", "score": 3, "replies": [{"body": "Thank you", "score": 1, "replies": []}]}]}]}, {"body": "The PE is because of the Xilinx (or however you spell it) acquisition. But amd does have a tendency to have a huge day then 2 or 3 bad days. I put in a put when it was at 6% gain for the day. Hoping it prints tomorrow", "score": 0, "replies": []}]}, {"body": "No way to tell with more context.\nExpiration?\nHolding thesis?\nTied Capital?", "score": 1, "replies": [{"body": "Expires in 3/15", "score": 1, "replies": [{"body": "Sell it. Don’t trade options without a pre plan thesis for why you are doing things (if you want to make money with it).\n\nAt this time frame whatever reason to buy or sell is BS. You are on a 50/50 gamble and time is against you because of theta decay. The rational thing is to sell to avoid the decay. Don’t regret the choice if it explodes after, we do what we can with what we have.", "score": 3, "replies": []}]}]}, {"body": "Hey folks I got 210 and 220 April 19 calls what should I do? I want to get out of my covered calls that my “professional” financial advisor got me going on. I wanted to let them expire but with so much time left I don’t know. Currently the calls are about break even. Should I try to roll? But I don’t want to roll into earnings. What should I do?", "score": 1, "replies": [{"body": "I’d get rid of them", "score": 1, "replies": [{"body": "Already did. We left the AMD options open because it was going to cost money to close at the time. So essentially gambling on the price staying flat until April. Guess not.", "score": 2, "replies": []}]}]}, {"body": "See profit take profit.", "score": 1, "replies": []}, {"body": "I would consider taking a break from options until you have a better grasp of them .  Just for the fact that you're leaning on reditors for advice on what to do tells me you didn't have a plan when you purchased it.  \nIts not that your an idiot, you just don't the knowledge yet.", "score": 1, "replies": [{"body": "What’s wrong with leaning on redditors for advice? You’re also a Redditor", "score": 1, "replies": [{"body": "Nothing wrong per say but you get what you pay for.", "score": 1, "replies": []}]}]}, {"body": "hedge the delta and hold it", "score": 1, "replies": []}, {"body": "What is the delta?", "score": 1, "replies": [{"body": "I closed it already :/", "score": 1, "replies": []}]}, {"body": "Take your profit.", "score": 1, "replies": []}, {"body": "Youadd it through all of the pain, and you're trying to talk yourself out of the reward??\n\nHow much time do/did you have on the position?", "score": 1, "replies": [{"body": "I knoooow… I had it 2/14-3/15 but I closed it out already, I didn’t want to overthink it 😂", "score": 2, "replies": [{"body": "Omg you had a 3/15 expiration?\n\nBro, you endured all that pain, for nothing? Did you at least learn anything?", "score": 1, "replies": [{"body": "It was down for 2 weeks straight until today. If it keeps going up then I’ll buy again. I played it safe, like I said I’m new to trading", "score": 1, "replies": [{"body": "I know you are, but I'm telling how you need to think about this.\n\nIf you were playing it safe, you wouldn't have opened the position in the first place. Trading comes with risk. You must accept that risk when you enter a position. You have to be okay letting that position lose value, in order to give yourself time to find out if you were right or not.\n\nYou were right. The market told you that you were right. And you folded.\n\nI'm not trying to be mean, just hopefully open your eyes.\n\nThe next time you find yourself in this position, you owe it to yourself fo FAFO when your position turns back in your favor. Otherwise, what is the point in going through all of that?\n\nWhat I'm asking you to do will take time, and it is hard. Some are NEVER able to do this... but anyone CAN do it if they work at it. You have to normalize remaining calm and patient during these down swings, and having the courage to stick with the position when it comes back to you and find out how far the ride is going to take you, rather than cutting it for a few pennies. Otherwise you will never make money in this game.\n\nFor more on what this means, I recommend the book \"Best Loser Wins\". You will not regret reading it/listening to it.", "score": 2, "replies": [{"body": "Also, in addition to the stick with the plan mentality, I’ve learned that 1 out of 10 options will pay off big.  So losing  some of all of the 9 of 10 isn’t so bad as long as you hang in there and squeeze the juice from the winner.", "score": 1, "replies": [{"body": "Name of the book. Best loser wins.\n\nYou need to commit to only taking position sizes that will not affect you, even if they go to zero. You don't need to hold them to zero, but the amount of money at stake cannot be an amount that will cause your emotions to override your plan (some of this just takes time, getting used to putting risk on).\n\nThen, accepting that most of your plays will be moderate winners that end up being small winners or b/e trades. But man oh man, when you can the low end of a trend.... Let. It. Ride!", "score": 2, "replies": [{"body": "Thank you!", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "AMD is a whipsaw... I sell wide BPS and close CC when its down and write new CC when it's up.", "score": 1, "replies": []}, {"body": "Date? Strike?", "score": 1, "replies": []}, {"body": "I have $175 Sept calls ands only now did I get into green. I made almost as much in CELH in one day yesterday than my gains in AMD so far. I may sell and use proceeds for next play.", "score": 1, "replies": []}, {"body": "i have some 210 call that expire in a week... pls go to the moon AMD plsss...", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1b3cqy5", "created_utc": 1709244030.0, "score": 40, "upvote_ratio": 0.82, "num_comments": 39, "comments": [{"body": "Wel your first mistake is comparing two companies that aren’t in the same industry. Does First Solar have 50% of the global micro inverter market? Why aren’t you comparing First Solar to a company that does the same as First Solar? Compare it to Canadian Solar and then you’ll see that First Solar isn’t cheap at all. Canadian solar has more revenue growth, double the revenue and more operating cash flow. The only reason they don’t have more free cash flow is because they currently have high CAPEX due to creating manufacturing plants in the US. And yet they are worth 1.4 billion in market cap. That’s 11 times cheaper. Canadian Solar also has a huge backlog just like First Solar. The price to operating cash flow of First Solar is 20, while Canadian Solar’s is 1.8.", "score": 42, "replies": [{"body": "[deleted]", "score": -8, "replies": [{"body": "Declining earnings he says, while First Solar had declining earnings in the exact same quarters Canadian Solar has declined earnings. Or are we going to compare Q4 First Solar to Q3 Canadian Solar…. Once again. You should equally compare things, same industry and same time frame. And let’s me repeat that Canadian Solar is valued 11 times cheaper while having more revenue and higher revenue growth. If it were the margins they’d have to be 22 tikes better, which would mean First Solar would need to have profit margins of 370%", "score": 16, "replies": [{"body": "[deleted]", "score": -17, "replies": [{"body": "I just checked they reported 30% net profit margin this last quarter. Okay so you want to buy first Solar now in the hope that they triple their earnings. That means with TTM net earnings of 830 mil it will turn into 2.5 billon. That means you are now paying 6 times the earnings in three years. While you can now buy Canadian Solar that costs 1.4 billion while they make 350 billion in net income. Which means you are currently paying 4 times the earnings of the CURRENT year. First Solar and Canadian Solar are in the exact same industry. If first Solar will triple earnings Canadian Solar will most likely as well. As I just said before they are outpacing First Solar hard, so that argument doesn’t stand", "score": 13, "replies": [{"body": "[deleted]", "score": -11, "replies": [{"body": "Then why did first Solar solar go from 2.7 billion revenue in 2020 to 3.3 in 2023. While Canadian Solar went from 3.5 billion in 2020 to 7.8 in 2023? It’s not some prediction the data is right there in front of us. First Solar grew revenue by 20% in 3 years while Canadian Solar grew by 110%. While also having more revenue to begin with. I’m done exchanging info btw. Downvote all you want, just because I’m pointing out First Solar is not cheap compared to its peers. Only time will tell, but I’m nearly one hundred percent certain Canadian Solar will outperform First Solar", "score": 17, "replies": [{"body": "[deleted]", "score": -13, "replies": [{"body": "You need to have a solid thesis to why all of a sudden this huge difference will no longer be the case. Instead of just saying past performance is not the future. Duuh. But you need to say why it changes, which you can’t. Good luck buddy but First Solar ain’t hella cheap. RemindMe! 2 Years", "score": 15, "replies": [{"body": "I will be messaging you in 2 years on [**2026-02-28 23:33:22 UTC**](http://www.wolframalpha.com/input/?i=2026-02-28%2023:33:22%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/1b3cqy5/fslr_is_a_gem_mixed_in_with_some_terrible_solar/ksrun56/?context=3)\n\n[**7 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F1b3cqy5%2Ffslr_is_a_gem_mixed_in_with_some_terrible_solar%2Fksrun56%2F%5D%0A%0ARemindMe%21%202026-02-28%2023%3A33%3A22%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201b3cqy5)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "oh fuck off you dumb fuckin itchy wool sweater", "score": 6, "replies": []}]}]}]}]}, {"body": "Im here and listening but why is FCF -784,000 TTM?\n\nNot a hater...just dont know what im missing??", "score": 1, "replies": []}]}]}]}, {"body": "Canadian solar definately does not look as good. \n\nObviously much more downside risk given eps forecasts have been downrated a lot.\n\nBut agree the PE ratios are very low. \n\nJust generally avoid companies on negative performance trends. Best catch no falling kniws.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 18, "replies": [{"body": "Have patience.", "score": 1, "replies": []}]}, {"body": "I still prefer enph.", "score": 9, "replies": []}, {"body": "Here's a comment from someone else 2 weeks ago that I found insightful about FSLR\n\nhttps://www.reddit.com/r/stocks/s/3eOwqpZxd0", "score": 5, "replies": []}, {"body": "I decided to buy CQIS and ENPH but FSLR was in the consideration as well. I think the whole industry will do well over time which should boost all the company’s stocks", "score": 2, "replies": [{"body": "We bought the same positions. The only reason I’m now ball deeps in CSIQ is because I somewhat don’t trust the market on pricing this one correctly until it starts producing a lot of free cash flow and buying back its way to cheap shares. I’m 70% Amazon, 22% Enphase and 8% Canadian Solar. Just bought these latter two two weeks ago. Looking to broaden these positions over the coming months", "score": 2, "replies": []}]}, {"body": "You can own both and play both utility scale and residential. FSLR and ENPH are very different, doesn't really make sense to compare them directly. FSLR, because they make panels, is more of a commodityesque play. I think they'll continue to be successful because those cadmium telluride panels are excellent. But they don't have the growth potential of ENPH in terms of share price appreciation. ENPH could be a ten or twenty bagger. They have a near monopoly on a small, easier to make and easier to ship component. I'm buying both.", "score": 1, "replies": []}, {"body": "Thoughts on MAXN?", "score": 1, "replies": []}, {"body": "I am holding some in RUN & JKS. Are they the wrong stocks to bet on in this industry?", "score": 1, "replies": [{"body": "JKS is okay. I would avoid RUN at all costs. \n\nFSLR is good, CSIQ is good. \n\nENPH is probably the best bet. Bahdri is a winner. \n\nSEDG is a worse ENPH, I would avoid. \n\nSPWR is great if you love to gamble, but the risk is extremely high. \n\nThere used to be a stock called PEGI, pattern energy group, that paid a 10% dividend and it was my hands down favorite. The management sold the company to somebody private, at a value which was the same as the stock price. My golden goose was killed and it was the only stock in my life that I cried over. \n\nI don’t own any Solar right now, but I would do a 25% FSLR, 25% ENPH, 25% CSIQ and a 25% wind player, something like WVDRY or whatever that ticker is.\n\nEdit: I bought A LOT of ENPH and did very well in it in the early days, but my shares got called away from selling covered calls on about 30,000 shares.", "score": 3, "replies": [{"body": "Thanks for the response!", "score": 1, "replies": []}, {"body": "Do you dislike RUN due to management or them being mostly residential? I read they’re investing heavily in storage. Could this be a narrative changer for them?", "score": 1, "replies": [{"body": "Mostly residential, yes. Cutthroat pricing wars, and consumers have zero loyalty and rarely repeat customers. It’s all about $/khw. I mean, what solar customer says “I want solar panels, I better call sun run and not price shop? No, they say “who’s a reputable company, and who’s the cheapest?” The company is also ran like a clown show. Feels like a MLM/ pyramid scheme company. I know it’s not. \n\nIf you want residential solar, buy TSLA (RIP London Rive and SCTY). \n\nThis is the industry that got me addicted to stocks. I know too much about solar and the industry. \n\nFSLR also makes CDTE panels, which perform better in hot climates, which is why I’d recommend 25% in FSLR. Cadmium Telluride panels. ~30% more efficient in hot climate for, which is their niche, large solar farms (sun shining areas, usually hotter climates). The company knows their strengths and plays to them. Company well run, too.", "score": 2, "replies": [{"body": "That all makes a lot of sense. Their management does seem iffy. Thanks for the detailed reply.", "score": 2, "replies": [{"body": "I’m also an electrician as my career, and I noticed very early that ENPH was going to eat SEDG’s lunch with their inverters. I’ll save this thread and if I see anything I’ll let you know 👍", "score": 2, "replies": [{"body": "Sweet! Yeah I want some solar exposure but it isn’t my expertise. RUN is just a familiar company I see a lot so it was one I had looked into", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I bought FSLR a few years ago. Im up 50% since. It fluctuates a lot but when it gets in the lower ranges I buy more. Compared to a lot of other stocks in the green etf FALR is a part of, it's done much better the past few years. My plan is to double my holdings in the next year.", "score": 1, "replies": []}, {"body": "Will SHLS equipment not be adopted by all of these companies though?", "score": 1, "replies": []}, {"body": "I have been holding both $ENPH and $FSLR since last year. Check out $CSIQ. It's also interesting.", "score": 1, "replies": []}, {"body": "Feel like a lit of people don’t see the technological disadvantages of Microinverters. \nLike more expensive, lower efficiency and while they fail less often, you have 25 of these on your roof. A single one has to fail and somebody has to go on the roof. Yes, the switching part is easier, but good luck going easily on a European roof, taking 3 panels off to get to your microinverter, switching it, just to realise a year later, that the next microinverter failed,\n\nString inverters just have more potential for the european market. Also Enphase won‘t get access to utility scale solar. \nSMA performing so well right now, while Enphase struggles showed me, that utility scale and string are quite important. \n\nFor the European market 1Komma5 will be an interesting company once they go public.", "score": 1, "replies": []}, {"body": "Uhmm, first solar is trading ~11x 24 and ~7.5x 25. \n\nAbout 30-40% upside to target.\n\nI think this is a decent play.", "score": 1, "replies": []}, {"body": "First off, you are comparing to a company that does inverters and not panels.\n\nFirst Solar is also facing a lot of pressure from the Asian manufacturers. Jinko, Trina and JA Solar are all among the largest in the world and China alone, can easily provide all the panels needed worldwide at the moment.\n\nIt’s a tough industry where profit margins are dropping. I would t touch for now.", "score": 1, "replies": []}]}
{"title": "Short Nvidia", "selftext": "[removed]", "id": "1b2qju1", "created_utc": 1709177977.0, "score": 0, "upvote_ratio": 0.44, "num_comments": 29, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "That short squeeze would be massive 😂", "score": 15, "replies": [{"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 5, "replies": []}]}, {"body": "this is regard central anything is possible", "score": 10, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "how about u eat my ASS\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 5, "replies": []}]}]}, {"body": "What is WSB-Bears Buying Power? - 10Mil?\n\nWhat is Hedge and WSB bulls Buying Power? - infinite?\n\nLet me know the plan with what you find.", "score": 8, "replies": [{"body": "Pretty sure this is a massive underestimate. There are some very large accounts among us.", "score": 1, "replies": []}]}, {"body": "No way wsb moves a 2 trillion dollar market cap lol\n\nIf all 15M wsb members shorted a grand of NVDA on the same day, that would be about a 25% spike in NVDA’s daily volume. Probably will cause a quick dip, then a return to the mean, and make your broker some money.", "score": 4, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "ok you go ahead and get started, the rest of us will be there soon", "score": 3, "replies": []}, {"body": "Let me know when y’all do it I’m in 🧐🍷", "score": 2, "replies": []}]}]}, {"body": "We would each have to short at least 2k minimum", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Wtf do you mean anything would count? Do you know how the stock market works.", "score": 2, "replies": []}, {"body": "True , we do run that ultimate risk though", "score": 1, "replies": []}]}]}, {"body": "Maybe start with a company that has a slightly smaller market cap.\n\nDollar General for example.", "score": 2, "replies": []}, {"body": "You are right but don’t have enough money to see it through", "score": 2, "replies": []}, {"body": "I wanna see u do it", "score": 2, "replies": []}, {"body": "This guy is on coke ![img](emote|t5_2th52|4640)", "score": 2, "replies": []}, {"body": "This is obviously a hedge fund plant trying to bankrupt all of WSB on one fell swoop for brownie points and a chance for advancement to Partner that he’ll never get", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "Can we actually though?", "score": 1, "replies": []}, {"body": "No because: Roko’s Basilisk", "score": 1, "replies": []}, {"body": "Imagine buying puts, realizing it was a bad idea, then thinking, \"I bet I can convince WSB to spend their entire life savings to bail me out.\" Actually, you know, that logic checks out…![img](emote|t5_2th52|8882)", "score": 1, "replies": []}, {"body": "Already on put + NVDS", "score": 1, "replies": []}, {"body": "When y’all start let me know I wanna join as well lol", "score": 1, "replies": []}, {"body": "Everyone here and their wealth combined is 0.01% 9f the float. We have zero power", "score": 1, "replies": []}, {"body": "Fuck it, COUNT ME IN!", "score": 1, "replies": [{"body": "After a quick reevaluation of this plan, I've came to the conclusion that this is pretty fucking regarded", "score": 1, "replies": []}]}, {"body": "You are the 🌈est 🐻 that ever 🌈🐻ed", "score": 1, "replies": []}, {"body": "#Submission Vote Removed\nThis submission was voted *spam*.\n##Reasons\n\nAd, self-promotion, or begging\n\nWasn't a Solid Discussion Starter", "score": 1, "replies": []}]}
{"title": "A Milly Ain't Gona Make Itself - MARA", "selftext": "[removed]", "id": "1b2re20", "created_utc": 1709180561.0, "score": 28, "upvote_ratio": 0.87, "num_comments": 38, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 445 | **Previous Best DD** | \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "I’m with you with about a half milly in shares. May the lord be with us!", "score": 17, "replies": [{"body": "I am 69% confident, and 100% all in.", "score": 14, "replies": []}]}, {"body": "60k into 2DTE calls thats wild I admire the courage.\nSince you have a sizeable portfolio, why don’t you go for later-expiry calls? do you really think BTC will surge enough to make you profitable in 2 days?", "score": 10, "replies": [{"body": "I am super confident.  I saw an opportunity and took a risk.  My portfolio isn't that large.  I'm just dumb.  Also, I bought into MARA like 3 days ago and rolled the lower strikes into these.", "score": 8, "replies": []}, {"body": "Also, I am dead serious.  I am liquidating the rest of my portfolio and buying calls.  If it hits, I am selling enough to exercise the rest.", "score": 7, "replies": [{"body": "damn, will truly be one of the greatest gain or loss posts on here, please share after. hope it works out and good luck!", "score": 3, "replies": [{"body": "Thanks dude!", "score": 2, "replies": []}]}, {"body": "How much is the rest of your portfolio? Are you ready if they don’t turn in your favor ?", "score": 1, "replies": []}]}]}, {"body": "I’m also in this ride with you gonna need MARA to pull thru or else I’m cooked", "score": 9, "replies": [{"body": "Rest easy.  Tomorrow is gonna be awesome.", "score": 3, "replies": []}]}, {"body": "Damn… calls on #rope", "score": 8, "replies": []}, {"body": "This is pure insanity .. I love it", "score": 6, "replies": []}, {"body": "I put 50% of my portfolio into 3/1 $34 calls. Still holding out hope that we pass $32 tomorrow and shorts get squeezed", "score": 6, "replies": []}, {"body": "I'm with you but I did the unthinkable and bought stock instead of options. I feel fairly certain it will go up at some point and sooner rather than later due to BTC making headlines but I can't say when that will be and how high MARA will go. I definitely didn't expect such a drop on earnings. They were pretty much all positive. So I bought and I'm holding.", "score": 5, "replies": [{"body": "I think that's super smart.  Their earnings call guidance was super positive and I loved every second of it.  There will definitely be some hiccups as they expand and work on efficiency, but I think they are on the right path.", "score": 3, "replies": []}]}, {"body": "You know MARA just announced they are dumping $1.5B new shares on the market, right?", "score": 4, "replies": [{"body": "Yeah, the one thing I was worried about, but honestly isn't not super bad if you listened to their guidance.  That money is backup to make sure they are the leaders when the dust settles from the havening.  I don't think most long term holders would mind that if it meant security for the company.", "score": 3, "replies": [{"body": "How you feeling this morning?  Thoughts and prayers, ser.", "score": 1, "replies": [{"body": "Not great to be honest.  Lol.  I did Yolo this morning though.  Need a miracle.", "score": 1, "replies": []}]}]}]}, {"body": "https://preview.redd.it/wys4hm9viglc1.jpeg?width=1179&format=pjpg&auto=webp&s=580b02913993ec2fca48e589338308e4101051ee\n\nHey man I’m with you!", "score": 4, "replies": [{"body": "My man", "score": 2, "replies": []}]}, {"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 3, "replies": []}, {"body": "Awwww i love pain too, lets jump on this ship", "score": 3, "replies": [{"body": "Fuck, yes.", "score": 1, "replies": []}]}, {"body": "Those calls are done 🔥 I will be buying at a discount tomorrow", "score": 3, "replies": []}, {"body": "![img](emote|t5_2th52|4640)", "score": 2, "replies": []}, {"body": "!remindme two days", "score": 2, "replies": [{"body": "RemindMe! 40 hours", "score": 1, "replies": []}]}, {"body": "This is sick honestly good luck dude", "score": 2, "replies": [{"body": "Appreciate it.  I will need it!", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Can you help with some high level comparison of the two?", "score": 1, "replies": []}]}, {"body": "Utterly regarded ![img](emote|t5_2th52|12787)![img](emote|t5_2th52|12787)", "score": 1, "replies": []}, {"body": "The real dd is that corn gonna be 150k+ in 2025", "score": 1, "replies": []}, {"body": "Too late to jump in?", "score": 1, "replies": []}, {"body": "#Submission Vote Removed\nThis submission was voted *spam*.\n##Reasons\n\nAd, self-promotion, or begging\n\nNot a YOLO (not open position)", "score": 1, "replies": []}]}
{"title": "Started with 20k. After many mistakes I’m now here. Will this time be different?", "selftext": "[removed]", "id": "1b2sffr", "created_utc": 1709183925.0, "score": 73, "upvote_ratio": 0.88, "num_comments": 39, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 1 month ago\n**Total Comments** | 1 | **Previous Best DD** | \n**Account Age** | 9 months | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "I would secure $200k in the bank and let the rest ride. That way both the cost of your wedding ($100k) and your invested hard work and time ($100k) are paid for. You are in a great position and can let the rest run free.", "score": 56, "replies": [{"body": "+ take your wife on a nice 17k vacation with the balance after the master plan, take it from someone who has just had a child, go fucking enjoy bud as marriage is just the tip of the worlds D.", "score": 8, "replies": [{"body": "I’d cum in your ass while your wife is at it", "score": 6, "replies": []}, {"body": "Yep there is room for that too 😉", "score": 1, "replies": []}]}, {"body": "This is good risk management. Don't be a pig. If you are always all-in, eventually you're gonna get wiped.", "score": 5, "replies": [{"body": "Thanks, I absolutely agree", "score": 1, "replies": []}]}, {"body": "This is the way.", "score": 8, "replies": [{"body": "This is the way.", "score": 5, "replies": [{"body": "I am the way", "score": 6, "replies": [{"body": "IAMDeGen.", "score": 7, "replies": []}]}]}]}, {"body": "200k for work and time. Don’t worry about the wedding part", "score": 2, "replies": []}]}, {"body": "Don’t be a fool. Take the gains now before you lose it all. I warned you.", "score": 10, "replies": []}, {"body": "YOLO that shit and F U", "score": 8, "replies": []}, {"body": "Yes. THIS TIME…it will be different.", "score": 5, "replies": []}, {"body": "Oldtime bitcoiner. Let it ride until end of this year only if you hold the keys.", "score": 4, "replies": [{"body": "This is what my gut and research tells me.", "score": 5, "replies": [{"body": "You got till the end of 2025", "score": 2, "replies": [{"body": "That is a chance that the bull will last longer but why risk it. He s gonna do a 2x or 3x just from now until end of this year.", "score": 2, "replies": []}]}]}]}, {"body": "We may be entering the best time for crypto since Bitcoin first blew up. There are articles whispering about huge multimillion dollar investments in smaller coins like Doge, and a huge power shift into crypto.\n\nCan’t say I understand it all, but I’m glad I’m holding enough for it to matter if this keeps up.", "score": 6, "replies": [{"body": "In the same boat. Rektcapital is a good follow on X. Apparently this is just the beginning but I do have some mile markers that seem realistic for this bull run where I’ll pull out portions. At this current moment it just doesn’t seem to feel like the right time.", "score": 2, "replies": []}]}, {"body": "congrats u mf!!! im next!!!", "score": 2, "replies": []}, {"body": "Take those gains!!! Obviously let a lot ride, but if you think it’s going to boom, just let the rest boom. You have some good shit to pocket here.", "score": 2, "replies": []}, {"body": "yolo that shit in bitcoin", "score": 2, "replies": []}, {"body": "You started with 20k, you better secure at least half of that! I think it would be unwise to sell it all, a lot of institutional investment is pooling into BTC and the price point it will hit is 5x whatever we projecting. So pay yourself along the way, and if you haven’t already PAY YOURSELF!", "score": 2, "replies": []}, {"body": "Take your fucking winnings a dip sir. Leave maybe 40k and save the rest. You’ve got taxes to pay too so set that aside. You’ve done it once before you can do it again", "score": 2, "replies": []}, {"body": "Retire in Cape Town", "score": 2, "replies": []}, {"body": "Here’s what I’d do with 250k (I’m keeping the rest to play with) \n\n20k back into my savings (choose some form of high interest rate banky thing… ewww) at least then it’s impossible to loose money \n\nKeep 50k on bitcoin and ETH and let it ride (who knows could be worth 300k again in two years) \n\n100k on $VIG $VYM or $KBWD and take those dividends yearly - I’d be inclined to do $KBWD but monitor it monthly (around 6% yearly dividend before growth) \n\n50k on $QQQ and just hold - yes I know you’re not supposed to do this but ISGAF - find a broker with 0% commission on 1x trades like etoro (yes… I know 😅)\n\n25k on AMP - risky… but it’s 25k who cares\n\n5k on PepsiCo - purely because Pepsi > Coke", "score": 2, "replies": []}, {"body": "I mean let bitcoin hit 70k, then take out 200k.", "score": 2, "replies": []}, {"body": "300k in nvidia weeklies", "score": 2, "replies": []}, {"body": "brotha 😭😭, give me 50 bucks 😞", "score": 2, "replies": [{"body": "Sent", "score": 2, "replies": []}, {"body": "eww", "score": 1, "replies": []}]}, {"body": "Pull out at 80k on btc", "score": 1, "replies": []}, {"body": "Ride it. This could triple within 2 years", "score": 1, "replies": []}, {"body": "Fuck you, no one cares", "score": 0, "replies": []}, {"body": "Is it just me or is there a huge influx of crypto bois posting to wsb?", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1b3d0ys", "created_utc": 1709244673.0, "score": 0, "upvote_ratio": 0.42, "num_comments": 30, "comments": [{"body": "I keep wondering when to sell AMD….. I’m up like 700% so far… like wtf", "score": 10, "replies": [{"body": "So right now lmao", "score": 22, "replies": []}, {"body": "Sell half at least.", "score": 1, "replies": []}, {"body": "If it's good enough to screenshot, it's good enough to sell", "score": 1, "replies": [{"body": "https://preview.redd.it/ajqpvm7m3tlc1.jpeg?width=1170&format=pjpg&auto=webp&s=45a61b4f16027a11266a8599948067e4a89bcbfd\n\nI was a averaging… here is one and in another account I have 27 shares at like $96. Why did I only by 17. Haha", "score": 2, "replies": []}]}]}, {"body": "https://preview.redd.it/2cfvl4wqpllc1.png?width=828&format=png&auto=webp&s=85fe6dc99cf26304a44c18f6cd8af594fab5476f\n\nAh shit", "score": 5, "replies": [{"body": "AMD just needs to say “AI” in the news and you’re good.", "score": 2, "replies": []}]}, {"body": "First time I ever buy puts and all of them tank:(", "score": 8, "replies": [{"body": "Dr. Lisa Fucking Su said fuck your puts!", "score": 8, "replies": []}, {"body": "What strike", "score": 2, "replies": [{"body": "180 and 182.5 puts Expires 3/8\n\nBought separately throughout the jumps. Maybe I can break even if it tanks a bit in the next day or 2..", "score": 1, "replies": [{"body": "Hmm you would need a big red day tomorrow, or else theta kills", "score": 2, "replies": [{"body": "Definitely lol. Really hoping tomorrow", "score": 2, "replies": []}]}]}]}, {"body": "Oof, hope it was more towards end of day today.", "score": 1, "replies": [{"body": "Half at like 10 am and the rest at 2ish. \n\nDefinitely taking an L let’s hope it’s not half my account tho … really wish I took these calls 💀", "score": 2, "replies": [{"body": "It’s definitely a lesson learned. Can’t win them all.", "score": 1, "replies": [{"body": "Oh yaaaa. Plan on getting out as soon as it dips a little lmao", "score": 2, "replies": [{"body": "Same. Only thing giving me hope is that amd has had a history of popping for a day, then a couple days of tanking", "score": 3, "replies": [{"body": "Yeah like I’m sad but there’s a decent chance I can break even or a slight loss if things aren’t too crazy", "score": 1, "replies": [{"body": "With $DELL backlog from its ER? I think tomorrow is gonna be straight up with multiple bumps along the way.\n\nOr it can take a U-turn around/after 2 because it's Friday/profit-taking time. Or maybe all the way down for me to load up some shares.\n\nI don't pretend that I know, other than the fact that all my covered calls are fucked.", "score": 2, "replies": [{"body": "Well I bought in at 183 then at 190. So if it falls back to 190 give or take I won’t cry just tear up", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "I need the floor to fall out on this one for my puts tm or Im on the ramen diet for some time", "score": 3, "replies": [{"body": "Sounds like a win-win to me. I love ramen 🍜", "score": 2, "replies": []}]}, {"body": "lol cope nvidia fanbois\n\n![img](emote|t5_2th52|18630)", "score": 3, "replies": []}, {"body": "Always play both sides.", "score": 5, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 5 | **First Seen In WSB** | 1 week ago\n**Total Comments** | 40 | **Previous Best DD** | \n**Account Age** | 1 month | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 2, "replies": []}, {"body": "TheStreets articles seemed to be rehashed AI content now.   \n\n\nI thought AMD bumped up guidance for the MI3000 from $1 to $3 billion on their CC, with analysts now saying they expected $5 billion?  ", "score": 2, "replies": []}, {"body": "People who actually create AI models would understand why AMD sales haven’t grown.  People don’t get it that gpus aren’t  all the same. What nvidia built was an industry standard toolkit that allows you to code your models to use the gpu in many different ways. That code doesn’t port over to other gpus.", "score": 5, "replies": [{"body": "Boom. It’s all about the CUDA ecosystem", "score": -1, "replies": []}]}, {"body": "I bought $15 worth last month and now I'll lay awake at night thinking about how regarded I am for buying so little", "score": 2, "replies": []}]}
