{"title": "Tesla has increased the price of the Model 3 Long Range in the US by $1,000 to $46,990.", "selftext": "", "id": "1aiztyj", "created_utc": 1707083982.0, "score": 103, "upvote_ratio": 0.9, "num_comments": 37, "comments": [{"body": "Lot of people seemed to be waiting for Highland.", "score": 28, "replies": [{"body": "It's a way better car.  Solves a lot of my personal wants in cooled seats, softer ride, and quieter cabin.  Gives my child the ability to adjust their own climate, which is a pain to do on the screen while driving.  Put in a US made battery for the federal tax credit and I'll consider...", "score": 29, "replies": [{"body": "*ventilated", "score": 3, "replies": []}, {"body": "And unwanted things like removing stalks….", "score": 4, "replies": [{"body": "And most people really don't care. 99.9% of epople complaining are those who have never tried it or were never going to anyway. Like most complaints about Tesla.", "score": 15, "replies": [{"body": "Yep, it’s an internet meme. When the model 3 came out the internet lost its fucking mind over everything being on the screen. \n\nGuess what? People got used to it and the Model Y, with the same setup, was just the best selling car on earth. \n\nIf you want a car with stalks, you have plenty of options. ", "score": 2, "replies": [{"body": "There was no valid reason to get rid of them in the first place. None.", "score": -1, "replies": [{"body": "Just don’t buy it lmao Tesla will be just fine without you ", "score": 0, "replies": [{"body": "Oh thank god. I was so worried. \n\nThanks for looking out for your boy.", "score": 0, "replies": [{"body": "I know I’m arguing with someone that’s incapable of critical thought but you realize that Tesla is like 150,000 employees right?", "score": 1, "replies": []}]}]}]}]}, {"body": "Eh, I have a model S without the stalks. There is zero advantage and it was a brain dead decision by Tesla.", "score": 2, "replies": []}]}, {"body": "Most people that drive Tesla in our area have migrated from Audi or BMW, so don't bother to indicate anyway", "score": 2, "replies": []}]}, {"body": ">which is a pain to do on the screen while driving.\n\n...hardly, but I'm happy that the new car is better.", "score": -8, "replies": [{"body": "It's 3 taps to change any rear setting on the screen.  That's a pain when driving.", "score": 11, "replies": []}, {"body": "It a def a pain compared to any button car.", "score": 3, "replies": []}]}]}, {"body": "I wonder if the Osborne effect of Juniper is causing a similar drag on demand. I've also seen a lot of people talk about waiting to buy new vehicles way longer due to FSD not being transferable, and that really creates a much higher effective cost yet again (12k more).\n\nIn the short term letting people transfer FSD more or at least give some credit for FSD at trade ins until FSD actually gets to a good enough level would probably make sense.\n\nThe adoption rate of FSD is quite low now, nothing prevents them from raising the price later when it is shown to actually work reliably and stopping the transfer credit and whatever.", "score": 6, "replies": [{"body": "I doubt it... i don't think the average buyer is even aware of that. You have to remember, if you're in this subreddit you're not the average Tesla owner. You're either an investor or super fan, but either way you follow the company alot closer than most people.\n\nOf course when the refreshed Model Y is announced, that should stimulate demand - but not because all of those people were waiting (some of them surely but not most). The demand spike will just happen as because it's new, suddenly people are talking about it, it gets mentioned on the internet, Youtubers are reviweing it, and so someone hears about it who otherwise wouldn't have if it weren't a new product, etc.", "score": 3, "replies": []}, {"body": "They should've just made FSD transferable when you trade in a vehicle... I'm not sure why they don't do it already", "score": 7, "replies": [{"body": "If they can sell the same software twice, why wouldn't they ?", "score": 1, "replies": [{"body": "The point is that people likely won't be paying twice and don't buy new car for that reason.", "score": 2, "replies": [{"body": "They won't pay again.  I passed on FSD the second time around.  I figure if Tesla solves FSD then $12k in TSLA will pay for FSD.", "score": 6, "replies": []}]}, {"body": "I guess it depends on whether they make more from the software or the hardware. We would likely be getting a new X in the next near or two if they made it transferable, but if not then we're looking at maybe a longer time horizon, or even a different brand vehicle instead like a rivian or a volvo", "score": 0, "replies": []}]}, {"body": "they are:\n\nhttps://twitter.com/SawyerMerritt/status/1754321276833775841", "score": 1, "replies": [{"body": "This is a temp thing to drive sales of their vehicles. It's not permanant", "score": 1, "replies": [{"body": "True, but it could also be some AB testing going on. Trying new payment plans/transfers out and see what works. I do vaguely remember Tesla saying(maybe in a quarterly earnings call) that FSD is a singular product, that they don't exactly know what the best pricing policy is as they have nothing to compare it with.", "score": 1, "replies": []}]}]}]}, {"body": "I have 2 friends waiting to buy Juniper, so there definitely is at least a little bit of delayed demand", "score": 2, "replies": []}, {"body": "There is 1000% a drag on demand. ", "score": 1, "replies": []}]}]}, {"body": "Increased demand, lots of positive reviews about it due to an enhanced quality. Tesla learned a lot and are applying it to the newer versions. Popular YouTubers are also giving positive reviews. \n\nI think the increase could be a mixture of higher demand but also a reflection that margins may have bottom in Q4.\n\nRemember, they strive to lower costs and by them enhancing quality and lowering cost, it’s a huge win.", "score": 20, "replies": []}, {"body": "BULLISH", "score": 7, "replies": []}, {"body": "~~341 EPA range, wasn't it 333 before?~~  \n\nNevermind, 2024 Model 3 was always 341.", "score": 2, "replies": [{"body": "I think there were some slight aerodynamic improvements, don't remember the exact range figures though. Don't the ranges change constantly?", "score": 1, "replies": []}]}, {"body": "\"DEAR GOD THEY'RE LITERALLY PRICING THEMSELVES OUT THE MARKET\"", "score": 3, "replies": []}, {"body": "FINALLY GOOD NEWS!\n\nTake that FUDers", "score": 2, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "I hope so , but at this point any good news doesn't matter and doesn't get reported . The \"recall\" that was 10% increase on some indicators update got like 10000 negative articles how Tesla \"recalled\" almost every vehicle", "score": 1, "replies": []}]}, {"body": "They increased the price?? In that case Tesla will be out of business in a week. \n\nOh also, Tesla is going to make a car less than $25k?? In that case Tesla will be out of business in a week.", "score": 1, "replies": []}]}
{"title": "Why sell options at all? A question of principal...", "selftext": "Hi r/thetagang, \n\nSo I've been experimenting with selling options on NDX and underlying ETF positions for the past month. The results are mixed. Covered calls (10d) and credit call spreads (50/25d) got hammered while cash secure puts (50/25d) did well. \n\n&#x200B;\n\n**The question of principle is this: If I am already taking a directional approach on the underlying that I am trading these derivatives with, why don't I just trade futures directionally instead?** \n\n&#x200B;\n\nCorrectly me if I am wrong: backtest suggests that in a strong bull market like last year, only selling puts/put spreads did well. CC, call spreads, straddles, stangles, condors, flies etc all got hammered in a market like last year. So I am drawing the conclusion that in a strong bull market, only going super long makes money. (duhhhhh...no crap)\n\n&#x200B;\n\nWhat are your thoughts on this? Thanks in advance :) \n\n&#x200B;\n\n[View Poll](https://www.reddit.com/poll/1aik5dj)", "id": "1aik5dj", "created_utc": 1707039159.0, "score": 5, "upvote_ratio": 0.67, "num_comments": 36, "comments": [{"body": "\\*principle...\n\nno point in responding to other stuff", "score": 13, "replies": []}, {"body": ">The question of principle is this: If I am already taking a directional approach on the underlying that I am trading these derivatives with, why don't I just trade futures directionally instead?\n\nSelling premium is not the best way to trade directionally. It seems like you've caught onto that. You lose your deltas when the position goes in your favor. You'd have to trade very aggressively to participate in an upmove like we've seen over the last few months.\n\nSelling premium is really an expression of short volatility, because you'll only have a positive expected return, if volatility is overpriced. This is true for directional traders as well.\n\nI've commented on this before, but this has been a particularly bad time for neutral trading. Its not the fact that we're in a bull market, or that volatility is low, although, those are significant factors. Its because we're in a melt up. Its the worst I can recall since the spring of 2020. The market rips higher almost every day, like a commodity facing a global shortage.\n\nThis is extremely abnormal. You could have bought the 45 DTE straddle every day since Nov 1 and you'd be up with an 88% win rate. Under normal circumstances, that strategy would be at a 100% loss within a few months.\n\nThat said, these periods never last very long. I suspect we are at the tail end of this, although I could be wrong! If you look at what the individual stocks are doing, its really just the \"mag 7,\" that are driving the rally. The equal weight S&P and small caps are down or flat. Small caps are still in a bear market.\n\nIts funny to see people say things like, \"sell puts, cause we're in a bull market.\" No one who's ever traded through a bear market would say something like this. You usually don't even know you're in a bear market until its almost over.", "score": 11, "replies": [{"body": ">This is extremely abnormal.\n\nIm hoping we will return back to the mean.  This is unusual,  correct?   I have never seen SPY fire to the upside so aggressively for weeks on end.   Having said that,  if you look at 3 year chart,  this rally makes sense and we could continue going higher.\n\nI think my opinion is its a combination of algos and money that was sitting on sidelines/Money market funds moving back into equities.\n\nIm really hoping we will retreat back to the mean\n\nTheta strategies outperform Buy and hold in neutral and bear markets", "score": 2, "replies": [{"body": ">Im hoping we will return back to the mean.\n\nmean volatility? Equities are not mean-reverting.\n\n&#x200B;\n\n>I have never seen SPY fire to the upside so aggressively for weeks on end. Having said that, if you look at 3 year chart, this rally makes sense and we could continue going higher.\n\n  \nWhen the fed was pumping money into the market in spring of 2020, we had sustained equity inflation that was worse than this. That was due to massive amounts of excess liquidity flooding the market. There's nothing anywhere near this right now. \n\nActually, the daily and weekly volume has been extremely low over the last few weeks. Last week was in the 20% percentile for cumulative volume. IIRC, last friday was in the 8th percentile for daily. The interest is thinning out. I don't understand who's buying NVDA at $650 or META near $500. That's dumb, dumb, dumb.\n\n&#x200B;\n\n>I think my opinion is its a combination of algos and money that was sitting on sidelines/Money market funds moving back into equities.\n\nIts really just the mag-7 that's ripping up. Pretty much everything else is flat or down. Its a problem with the S&P weighting. The opposite will happen when these stocks sell off. The market will be comparatively strong, but the indices will drift lower as tech drags them down. Could happen in a month or 5 years, but it will happen.\n\nSomething to consider also is, the first year of the bull market that started in 2022 was one of the weakest in history, barely making 10% off the bottom. Its possible one of the factors is that we just didn't make as strong enough gains and this is making up for it.", "score": 3, "replies": [{"body": "I mean generally speaking,  the S&P tends to gravitate back towards the 50 and 100 days simple moving average.  It seems to have shot way up and keeping a higher sustained level.   Next few months should be interesting but will bet Volatility will be back on menu", "score": 3, "replies": [{"body": ">the S&P tends to gravitate back towards the 50 and 100 days simple moving average.\n\nThat's true by virtue of them being averages. That's not really actionable though, because it can trade flat, slightly down or slightly up and the average will catch up.\n\nSPY is about 5% above its 50D sma, which is high - 86th percentile. Its close to 10% above the 100D, which puts it in the 91st percentile.", "score": 3, "replies": [{"body": "Yes,  its nice to know where the moving averages are.  I write them down every morning and to be honest,  they move really slow.  I also write down the volatility for every position to see how it changes every day.  So far so good", "score": 1, "replies": [{"body": "If you use tradingview, you can export csvs of historical data for MAs and other technical indicators. That's where I'm getting these stats.", "score": 3, "replies": []}]}]}]}]}]}, {"body": "This sort of melt up in my opinion is pretty par for the course for a while I think. I could certainly be wrong, but when is understanding the underlying market trend not the most important thing a lot of the time. \n\nHave experience trading 2021 and being a cautious downer certainly didn't pay and is trying to avoid that and learn from it for 2024. \n\nHappy trading folks!", "score": 1, "replies": [{"body": "You think its normal for the S&P to increase 20% in 3 months?", "score": 1, "replies": [{"body": "Idk man … only time will tell …", "score": 0, "replies": []}]}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "> I'd speculate that this is because institutions want to buy insurance and retail wants to buy lottery tickets.\n\nPretty much the reason. The stock market is mostly long. Funds have to hedge their positions. Risk is predominantly to the downside, so insurance is more expensive that the actual risk", "score": 2, "replies": []}]}, {"body": "> The question of principle is this: If I am already taking a directional approach on the underlying that I am trading these derivatives with, why don't I just trade futures directionally instead?\n\nFutures have more leverage. A LOT more.\n\nFor example ONE crude oil contract is for 1000 barrels/36,000 US gallons/158,000 litres.\n\n(When my crude oil option gets assigned I hire a few olympic swimming pools to store it there)", "score": 8, "replies": []}, {"body": "what is the point of this post?   \nTheta gang sells premium when IV is high and collect money regardless of the direction.  \nThere are option strategies that take a directional stance on the market, but I won't categorize them as pure theta gang strategies ([https://www.tastylive.com/concepts-strategies/zebra](https://www.tastylive.com/concepts-strategies/zebra)) \n\nThe edge we get is from selling naked options 40-50 days out when IV is sufficient. We can take directionless trades and still manage our positions to stack up premiums. Some people buy shares of the underlying they gain from, other people buy ETFs that yield dividends and little by little they create a massive snowball effect and retire off that.\n\nOthers stick to their equity/bonds portfolio and strategically sell covered calls against their holdings when they feel the market has ran up too much.\n\nTraditionally funds use options to hedge their positions in moments when they'd get their alpha rekt.  \n\n\nWhy would you sell call credit spreads on tech, why would you trade equity futures (maybe you want to take an overnight naked short position) -> that is up to you. Nobody will be mad that you do stupid shit with your own money.   \n\n\nI myself stick to only selling naked strangles and straddles and use the money to sell even more options, but I wouldn't say that's the optimal way, it's just my preference.", "score": 7, "replies": [{"body": "How do you check for \"high IV\"? Do you just get to know the options chains on certain equities/indexes, and do it based on feel? How \"high\" does it need to be based on the relative historical IV in order for you to be comfortable entering a trade?", "score": 2, "replies": [{"body": "Look for stocks that have IV Rank above 40 or stocks with IV index (or percentile) above 60%. I personally stay away from stocks that cost less than $10-15, because the premiums there are shit. I was trading through tastytrade and they have preset watchlists. I use their most popular called High Options Volume (basically companies that have weekly options, you’ll identify them because they have more than 2 near-term expirations) and sort the watchlist by IVx%% which is just an easy way to identify high IV stocks. That is not all though. Using Tradingview or Seeking Alpha (my preferred websites, their offerings aren’t unique so it’s ok to use what you prefer) I look for companies that are profitable by looking at their statements and balance sheet, but for convenience you can just check if the company has an EPS number (nothing == negative earnings)\nI also prefer trading stocks that cost around 50-150 USD, because their option pricing takes into account option greeks, because they give edge to option sellers and negatively impact buyers. Stocks that are too cheap give almost no room for the extrinsic value of the option to materialize using the different components that establish the bid/ask prices. Going higher than 400 USD for an underlying is fine, but it’s a bit rich for my blood, because I regularly double-down on positions while rolling and you can’t do that more than a few times before it outsizes my portfolio. \n\nI hope your biggest takeaway here is\n1. Don’t sell options on companies that can go bust or double in value, usually highest IV lies there and high IV != highest IV. We are looking for elevated IV compared to historic values (IV Rank as a guideline) \n2. Learn what are the semantics behind gamma, vega, theta and how they build the contract’s price, how they affect the delta of your contract and of your overall position in that underlying.", "score": 2, "replies": [{"body": "Thanks for the well thought out response, appreciate it!", "score": 2, "replies": []}, {"body": "Replying to myself to separate the greeks part:\n\nGamma is divided between the days to expiration. The fewer days there are, the strongest gamma is to help buyers make money even if most of the time value and volatility is gone. Holding options to expiration is a dumb risk when you are a seller.\n\nTheta is weakest the more time you have to expiration, selling 100 days out or 300 days out virtually has the same theta dacay and it is a waste of capital. About 60-30 days is the sweet spot when theta accelerates and chips off the biggest chunks of the extrinsic value of an option. You can be greedy with theta. I usually roll options when I have about 16-17 days to expiration (Tuesday/Wednesday 2 weeks before expiration) \nTastytrade swear by rolling or closing 3 weeks before expiration(21 days to expiration at the latest) \n\n\nVega is the IV component which spikes and plunges for a singular reason, but very complicated on how it all comes together: \n- There is a ton of volume and open interest in a specific expiration: that can be because people speculate on an event like a company presentation or earnings date or something more obscure like licensing contract ending, share lockup period ends after IPO, it can be earnings or whatever the end result is that there is a lot more open interest in a given expiration. \nWhat you may not have guessed is that the market maker balancing the options chain by trading contracts through algorithms buy and sell the underlying in an effort to offset what the options market is doing and that “hedging” the MMs are doing puts premium into very OTM options that increase vega for them, hence you see junk options with extrinsic value on them -> that is almost 90% vega and the rest is theta.\n\nThe cool hidden benefit of vega is that you can see in real time what the market thinks about the underlying for that specific time period. Market participant actions accumulate and create a skew on either the puts or the calls side. Call skew means that calls are more expensive compared to equidistant puts when using ATM as base. That easily means the market sees more upside risk or the market thinks the stock will go up by that expiration (not guaranteed it won’t come sooner or later than the expiration you are analyzing). Theta gang dictates we sell calls to speculators, because premiums on the call side are higher, so you get an edge by going further out of the money (13 delta call and 13 delta put aren’t equidistant when you have skew and skew naturally forms as market participants take positions and the market maker takes positions to offset the customer) \n\nAs I wrote to OP in my original comment I play both sides and sell strangles and straddles so I don’t really care about skew, but I try to stay delta neutral, so I sell equal delta options on both sides or in cases when the skew is really noticeable at least if there is call skew I sell more aggressive puts to gain more premium than I would have staying neutral.", "score": 2, "replies": []}, {"body": ">Look for stocks that have IV Rank above 40 or stocks with IV index (or percentile) above 60%.\n\nsorry for the potentially dumbass question but what platform are you using to screen for this?", "score": 1, "replies": [{"body": "Hey, there are no stupid questions! In my long-ass comment I mentioned tastytrade as broker. Here is their article explaining IV Rank. You can find it on most other platforms. I’m currently using interactive brokers, they have it as well while viewing the options chain on an underlying stock. \n\nhttps://www.tastylive.com/concepts-strategies/implied-volatility-rank-percentile#:~:text=Implied%20volatility%20rank%20is%20generally,opportunity%20to%20buy%20options%2Fvolatility.", "score": 1, "replies": [{"body": "Ah thanks! I use IBKR too - so its 52W IV Rank and 52W IV perc yes?", "score": 2, "replies": [{"body": "Indeed", "score": 1, "replies": []}]}]}]}]}]}, {"body": "This is very insightful and intersting. Thank you!\n\nI take your point that picking the underlying and timing is very important for any option selling strategy. And I am realizing that evening selling put spreads on NDX is not a good strategy as IV is so low and likely to go higher if anything were to happen. \n\nReally love the link you've shared. I am looking to take max advantage of a bull run like the one we are in now. You are golden thanks man!", "score": 1, "replies": []}]}, {"body": "What backtest are you referring to? Between 2020 and now, selling a weekly 16-delta strangle on SPY has a 26.9% CAGR. That's 2x the historical S&P CAGR. There's a difference between a bull market and the 1%-up-per-day foolishness we're in now.\n\nHistorically back to 2013, buying a 90-DTE ZEBRA in SPY every month and selling it at 30-DTE would've outperformed the market. You have nasty drawdowns, especially in 2022, but it would've yielded a higher return.", "score": 3, "replies": [{"body": "Is your goal with the zebras to put extrinsic value to zero, or to have the delta as close to 100 as possible?", "score": 1, "replies": [{"body": "Both of those would be the goal of a ZEBRA. This was a backtest, so I just put in buy (+2) 75-delta and sell (-1) 50-delta.", "score": 3, "replies": [{"body": "I see, thanks! Another question: Is it gamma-neutral or the delta will change if the price drops/increases significantly?", "score": 1, "replies": []}]}]}]}, {"body": "1/ Indeed, options are not the best instruments if you are only looking for directional exposure. Futures may be better but have considerably more leverage. If you go that route, why not trade the spread between NQ and ES?  \n2/ Selling put is indeed a much better strategy, especially in that low volatility environment. Be careful about gamma and short-term expires. This can blow up your account significantly.  \n3/ As you noted - it is a bull market right now, and as long as volatility is this low, the pain trade is on the upside. Consider risk reversal - short puts and long calls to get the maximize of the move to the upside.  \n4/ Options are all about volatility first and foremost. Take the time to understand how to use them, more specifically by studying the variance risk premium, or the difference between implied volatility and the actual realized movement in the underlying.", "score": 3, "replies": [{"body": "Looking at zebras and risk reversal.\n\nWhat are you referring to when you said spread between NQ and ES? \n\nA lot of experimentation and iterative learnings here. Thank you for your thoughtful reply!", "score": 2, "replies": []}]}, {"body": "Options are just a way to alter the risk profile and gain exposure to things like time and volatility. There are many ways to play strong directional opinions with options. Selling puts its a hedged long position, not the ideal move for a strong directional opinion", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "He really should have known what the market will do in the next month after he took the trade!", "score": 1, "replies": []}]}, {"body": "Buy and Hold VOO,UPRO , TQQQ. Beats any damn shit ", "score": 2, "replies": []}, {"body": "The premium is not worth it for how much the market overshoots on both direction. Even 1 contract in SPY with a 80 point move in 3 months is $8000, you might as well trade futures so you can be flexible and flip directions.", "score": 0, "replies": []}, {"body": "Where is the sell options to buy delta .", "score": 1, "replies": []}, {"body": "I think you need to reassess your goals of your trading .", "score": 1, "replies": []}, {"body": "Mr obvious stating the obvious", "score": 1, "replies": []}]}
{"title": "my META story", "selftext": "my META story\n\n(positions in comments) \nSo I buy a straddle for META \n\nI see it goes green dick, plan to sell at open in case it “corrects” and drops down in price\n\nIt’s dropping slightly at open so I sell ALL at open with my hands shaking…\n\nI meant to leave a contract open to ride or die but was so nervous and was violently shaking while watching the price drop… \n\nSo I sell a few minutes after market open\n\nand they fucking RIP, a 14x gain (maybe a lil more) instead of a 25-50x… don’t fucking look at what the prices are of those contracts\n\nfuck…\n\n-Sarni", "id": "1aiihbn", "created_utc": 1707032393.0, "score": 91, "upvote_ratio": 0.81, "num_comments": 31, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|2 months ago\n**Total Comments**|229|**Previous Best DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Meta literally set records. The next time this happens, you will hold, and you’ll lose it all.", "score": 31, "replies": [{"body": "This is the way  ![img](emote|t5_2th52|4275)", "score": 2, "replies": []}]}, {"body": "Profit is profit", "score": 18, "replies": []}, {"body": "Fucking stupid way of thinking,  profit is profit, next time you're up, you will say 'wait a little longer', And it's gone.", "score": 18, "replies": [{"body": "you’re right it is fucking stupid, i deserve all the backlash here and it’s pushing me to remove emotions because obviously there are too many “missed opportunities” to care about", "score": 1, "replies": []}]}, {"body": "The f*ck happened to this sub reddit and where did the mods go? Rules used to be 10k + or -, now all i see are shit bottom feeding positions anywhere from $100 - 5k on the same shit people have been running for the past year.\n\nIf you have the nut to post your shit gains for your peers to criticize, grow a second nut to throw some really money on a play or go sit back on the f*cking bench.", "score": 9, "replies": [{"body": "Bitch ass normies have taken over. No longer a chad sub smh", "score": 3, "replies": []}]}, {"body": "https://preview.redd.it/9dws8qwrvigc1.jpeg?width=1170&format=pjpg&auto=webp&s=b82faf9f5e73dded0bb802bbd9ff46889cc128e1", "score": 8, "replies": []}, {"body": "Some one is eating human food tonight.", "score": 6, "replies": []}, {"body": "upset that you made money.\n\nalso upset that you could have made more.\n\noh well", "score": 11, "replies": []}, {"body": "this trader gnna blow up . mark my words", "score": 3, "replies": [{"body": "ticking time bomb", "score": 1, "replies": []}]}, {"body": "Bitch ass gains smh what’s happening to this sub", "score": 3, "replies": []}, {"body": "long story short\n\nI made 5k (some with amzn calls I also sold too early) in a day instead of holding for 30 more minutes to make around 50k…", "score": 2, "replies": [{"body": "Thats still impressive bruh i would be blessed to even make $100 you made 5k i cant even save that much in a year lol", "score": 7, "replies": [{"body": "it’s lucky more than anything, the only skill is just being able to put yourself in the position to make money i supposed and also entry and exits on the contracts, shit is volatile", "score": 3, "replies": [{"body": "To put yourself in a position to make money you need money for that 😂", "score": 1, "replies": []}]}]}]}, {"body": "https://preview.redd.it/ajbaw8ktvigc1.jpeg?width=1170&format=pjpg&auto=webp&s=c71a857aa70e783567f94a3c427f930da965ee93\n\nI even sold the put…\n\nsafe is selling in the green right ..?\n\nbut if i held for 15 minutes longer my port would be well over 25k…\n\nwe live and we learn", "score": -1, "replies": [{"body": "Congratulations.\n\nAnd\n\nDont get into 'what if' mentality, \nThere will always be opportunities in volatile market so chill 🍻\n be proud of yourself.", "score": 13, "replies": []}, {"body": "Don’t do that to yourself, OP. Be happy that you sold in the green. The mentality you currently have is how you end up failing to take your profits.", "score": 6, "replies": []}, {"body": "What ifs are a great way to lose money, congrats on your earnings man!", "score": 0, "replies": []}, {"body": "If you are exiting positions too early you have too much emotion ($) in the position which makes you exit a position too early only to watch it run and then you start calculating all day how much you could have made.  Remove the emotion.", "score": 1, "replies": [{"body": "100%", "score": 1, "replies": []}]}]}, {"body": "No one cares", "score": -5, "replies": []}, {"body": "How do you like Robinhood gold?  I was thinking of joining Robinhood as gold to get that 3% match they are offering", "score": 1, "replies": [{"body": "I'm enrolled for $5/mo with 5% interest accruing each month.\n\nBeats my savings account AND when I have any bad ideas, my money is right where it needs to be...", "score": 2, "replies": [{"body": "That’s my biggest problem right now.  I’m in money market at 5.2% but moving money in and out is a pain.  Would love to just earn 5% by parking it and having it available as soon as I want.", "score": 2, "replies": []}]}]}, {"body": "i watched my nvda call go up a few weeks ago and didn’t sell. shit went back down, expired worthless and my account was nearly $0. friday i sold my 645 call at about 10 am and could’ve held all day for a much better profit but i’m not fucking around anymore with that “wait until it goes up more” bs ", "score": 1, "replies": []}, {"body": "You have to make the best decisions you can with the information you have available at the time. It doesn't make sense to evaluate decisions based solely on \"what would've happened\". \n\nIt's like new poker players who make a ton of money because they made a stupid bet and got lucky. The fact that they got lucky doesn't make their decision less stupid - and they'll lose it all to you in the long run.", "score": 1, "replies": []}]}
