{"title": "June 2026 - where will NVDA be?", "selftext": "I was looking at the option chain of NVDA, to hedge my portfolio. Current P/E, P/S and most metrics point to stellar growth expectations. If that's the case, why is $200 Call for June 2026 priced 'just' at $15. $240 Call (double of current price) is trading at $10.\n\n[NVIDIA Corporation (NVDA) Options Chain - Yahoo Finance](https://finance.yahoo.com/quote/NVDA/options/?date=1781740800) \n\nIt's an almost certainty that NVDA should double in next 18 months, or even sooner. So why wouldn't someone just get this option for $10, and free up his $110 capital for something else?\n\nI know, the option can become worthless if price stays below $240. But if I am getting into something as volatile as NVDA, I'm looking to 2X my capital; and not 'normal' 20-30% gains. So, isn't it better to just \"throw\" $10 at NVDA option, if the end-result is basically the same as investing $120 in it?", "id": "1fvmtmy", "created_utc": 1728002341.0, "score": 0, "upvote_ratio": 0.34, "num_comments": 19, "comments": [{"body": "*it’s an almost certainty that NVDA should double in the next 18 months, or ever sooner*\n\nlol ok. says who?", "score": 49, "replies": [{"body": "[Here!](https://www.reddit.com/r/stocks/s/ZSRDb3xtce)", "score": 10, "replies": []}, {"body": "Oh,  let him buy...  Then he'll find out the PE is not a fundamental,  it's just a comparative statistic\n\nIt's one way to get a trumpie more upset when things go belly up", "score": 0, "replies": []}, {"body": "Says 57 PE", "score": -12, "replies": [{"body": "Put your money where you mouth is then. Almost certainty means you should be easily making money on the trade.", "score": 9, "replies": []}, {"body": "So anything with a stupid PE should double?\n\nShould buy TSLA now eh?", "score": 1, "replies": [{"body": "Yes, Cathie Wood says it's gonna go to $2600", "score": 1, "replies": [{"body": "Because Cathie Wood has some of the best long term performance, like Buffet, or Medallion Fund right? \n\nShe is a bastion of level headed decision making.", "score": 1, "replies": []}]}]}]}]}, {"body": "It is not an almost certainty. But if you feel it is, yes you should gamble on it.", "score": 4, "replies": []}, {"body": "There are actually a lot of risks to Nvidia’s earnings in the medium to long term.\n\n1. Every single big tech is spending billions on developing their own AI accelerators to replace their dependence on Nvidia. These are Nvidia’s primary customers. Google already eliminated Nvidia GPUs and use their own in house TPUs for all their model training and inference. Amazon has Trainium and Inferentia chips. Microsoft has their Maia chip. Meta has their MTIA chip. Tesla has Dojo. Apple has their on-device chips and is rumored to be getting into data center. Then you have AMD, Cerebras and Groq. These companies have the deepest pockets in the world and technical savvy to compete with Nvidia and Google has proven that. And Nvidia doesn’t actually make anything so the other big techs can also go to TSMC and Broadcom to have them manufacture their chips like Nvidia does. Even if these companies don’t completely eliminate their reliance on Nvidia they will offset demand and Nvidia prices could come down and profit margins erode in a big way. \n2. GenAI doesn’t live up to the hype and the productivity gains in real business applications don’t match the capital being spent on it. \n3. Models stop scaling on the training side and start scaling on the inference side (like GPT-o1) and Nvidia GPUs lose their advantage when all that matters is low power and cheap inference. Alternatively, smaller language models and local on device inference become the priority. \n4. Some hyperscalers stop upgrading every year and Nvidia growth stalls. They hit a ceiling on the number of GPUs sold per year. This also means that there is less competition for those GPUs so the price per unit comes down and profit margins compress.", "score": 10, "replies": [{"body": "Jensen will soon sell his leather or dance in leather like in Folsom faire.", "score": 0, "replies": []}]}, {"body": "2 years out is a long time in the tech world. Just ask Inel.", "score": 3, "replies": []}, {"body": "It would not surprise me if NVDA is higher 5 years from now. It would surprise me if there's not a substantial (50% neighborhood) pullback similar to others in NVDA's past between now and then for one or more of the reasons that u/Echo-Possible mentions. \n\nPeople talking about NVDA doubling in the next 18 months after a 1,000% move off the 2022 low feels very 2021.", "score": 2, "replies": []}, {"body": "maybe $50 with struggling to improve margins and Jensen desperately making too many public appearances and like a broken record keeps saying \"massive\" demand?", "score": 2, "replies": []}, {"body": "Not a single person here can answer this", "score": 1, "replies": []}, {"body": "It will be around 80-90", "score": 1, "replies": []}, {"body": "Yes.", "score": 0, "replies": []}, {"body": "< 40", "score": 0, "replies": []}]}
{"title": "Shopify outlook", "selftext": "[deleted]", "id": "1fw219o", "created_utc": 1728055986.0, "score": 13, "upvote_ratio": 0.78, "num_comments": 19, "comments": [{"body": "Shopify promoted itself as the anti-Amazon in 2021 and by 2023 was doing a deal with Amazon and offloading the logistics they were trying to build. A former Amazon exec became CEO of Flexport, Flexport bought the logistics assets from Shopify, did an arguably bad job at Flexport and was forced out. Amazon continued to have its fully operational logistics moat, Flexport was troubled after various issues with the former Amazon exec and Shopify no longer had aspirations to get into logistics.  \n\nAt one point I think there was definitely a hope that Shopify could have some even mild impact on Amazon and become something larger. After withdrawing from logistics though, what it will continue to be is one of the best software options for people who want to sell online...until it isn't. It may be for a very long time, but that really has little moat. \n\nI wouldn't base whether to own on prior highs, which in 2021 were arguably a bubble and imo some aspects of what the business aspired to be are not there. Really becomes making a case for the business going forward.\n\nI wouldn't have anything as 100% of my portfolio in any case but is SHOP terrible? No. Would it be high on my list? No. Maybe a small position in an otherwise diversified growth portfolio.", "score": 11, "replies": []}, {"body": "Some deeper info from someone working at SHOP: everyone here is bashing against Shopify not having a moat. Yes. The software itself can be found more or less a dozen times. ECommerce software in general is commodity and new features can be build by everyone. However, if you see Shopify as a platform, which it is, then you have the moat. Each and every tech company in retail and ecommerce is building the best standard integration to Shopify, because they know they will have access to 3m+ customer. Shopify being easily integrated with every other tech tool makes more and more businesses move to Shopify, because this helps to lower cost and have a modern shop/experience aka making more money. \nAnd tada, we have a flywheel. \nIt takes time. Changing the heart of your sales engine is a big project. But once you move towards Shopify, you’re not moving away. \n\nI got my stock allocation when joining almost at the high. So I feel you (however it’s not 100% of my portfolio, but my 2nd biggest holding)\nWill definitely stay working here and hold the stock for the long term, it’s a great place to be. No advise whatsoever", "score": 11, "replies": []}, {"body": "YOLOing into one stock is always fun. Good luck.", "score": 18, "replies": [{"body": "The portfolio is only $1k.  Ants don't need diversification.", "score": 10, "replies": []}, {"body": "Imagine how the Intel guy felt after yoloing his grandma's inheritance", "score": 2, "replies": [{"body": "Classic. Although who knows, he may come out on top. Eventually", "score": 2, "replies": []}]}]}, {"body": "I liquidated my SHOP to buy more PLTR.", "score": 2, "replies": []}, {"body": "Lots of people will probably spam something along the lines of \"if you wouldn't buy the stock at the current price, you should sell\". \n\nYour strategy here was very apparent to look like gambling to me. Betting on a fin-tech with crazy competition and little moat. I'd say in my opinion that you've already thrown your dice, might aswell stick around and see if it hits. aka keep in\n\nIf you don't want to be a degenerate, then diversification is what you should be doing and really re-evaluating whether or not you'd buy this stock at the current price.", "score": 1, "replies": [{"body": "Little moat?", "score": 2, "replies": []}, {"body": "Thanks. Appreciate that. I’d buy in at the current price because of the previous highs and decent fundamentals but not with 100% of my capital. That’s my issue. \n\nYeah, and it was a gamble. Although, my previous ~50/60 trades over maybe 15 years had left me up probably 300%. I know most of that was market, not my insight. Shopify was flying post-COVID, until it wasn’t. You live you learn.", "score": 1, "replies": []}]}, {"body": "Then just buy more", "score": 1, "replies": []}, {"body": "Only free lunch in the market is diversification. Stop 100%ing a position.", "score": 1, "replies": []}, {"body": "The problem is they’re not innovating or attaining massive organic growth.", "score": 1, "replies": []}, {"body": "Industry is too competitive. Get out of it. They don’t have a moat", "score": 1, "replies": []}, {"body": "I have made ecommerce sites with Wordpress which is like $500 cheaper each year and much better quality. This was with no previous experience in web development or ecommerce. Skip. ", "score": -1, "replies": []}, {"body": "Based on your comments (I don't know you), you have no clue about investment. Stop getting random advice on a specific trade, get some help in basic investment principles and portfolio building and portfolio management.", "score": -1, "replies": [{"body": "Okay, so I’ll assume you’re well intentioned and not just being a dick. I am certainly no expert in ‘investment’. However, I took about $40k 15 years ago and self-managed a portfolio that is now worth  ~$450k. I have half in SHOP and the other half in cash at 4.5%. Not amazing but not bad for an amateur. At the same time, I opened a LIRA from a previous job which I cannot self-manage, other than changing the risk profile from cautious to aggressive. I chose aggressive because I was young. It has grown about $5k by being ‘professionally’ managed by a big-four bank. Over 15 years. So, while I am underwater in SHOP for now, the big picture is I outperformed fund managers by many orders of magnitude. \n\nI really just wanted some insight from folks into the medium term outlook for SHOP. I didn’t need adolescent crypto bro day traders telling me I don’t know about investing. Cheers.", "score": 1, "replies": []}]}]}
{"title": "Google glass 2.0 but worse", "selftext": "[removed]", "id": "1fvoudx", "created_utc": 1728008706.0, "score": 25, "upvote_ratio": 0.75, "num_comments": 24, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 1 month ago\n**Total Comments** | 292 | **Previous Best DD** | \n**Account Age** | 1 month | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "No shit", "score": 4, "replies": []}, {"body": "“Our goal is to demonstrate the current capabilities of smart glasses, face search engines, large language models and public databases. We’re raising awareness that extracting someone’s home address and other personal details from just their face on the street is possible today.”\n\nThis really has nothing to do with Suckerburg’s glasses. To the surprise of nobody, all of this stuff, the cameras and databases and search engines and LLMs, already exists. The glasses are just a platform.", "score": 13, "replies": [{"body": "Yea that doesnt mean its ok in fact its expanding  and promoting this evil technology", "score": -7, "replies": [{"body": "Do you want to ban all cameras? Good luck, bro.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Tbh I don't like random people being filmed without their consent even in public areas without a very good reason. I don't like ≠ illegal, but I will certainly insist its morally dubious.\n\nAt least with phones I can see the are filming, and either avoid or kindly request they not film me.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": ">Have you ever stepped outside and looked around?\n\nYes and that's exactly it. Bussiness in my country are required to put a big fat 'Recording on premises' sign at the door if they are recording. Outside cameras are perfectly visible too, with legally mandated visible markings...\n\nIf you are willing to tattoo 'Hi, BTW I'm recording 24/7 please keep that in mind' to your forehead? Sure whatever. Then I can just avoid you if I wish to.\n\n>at traffic intersections\n\nThat would fall under my 'very good reason' exception, of making sure people aren't driving drunk or 300km/h at a kindergarden intersection. You wanting to record everything for social media though? Would not fall into this exception for me. Sorry. Oh and? They are marked too upfront on the road before intersections.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "There is no expectation of privacy here either, you can record in public as an individual without announcing it. \n\nI'm saying it's to me very dubious to film without indicating it. With phones holding it up and pointing it at something indicates this. With glasses? No. No visible indications.\n\nPoint was that your examples are not good, because they do not apply when informed disclosure is mandated in every example you provided.", "score": 1, "replies": []}]}]}]}]}, {"body": "The last part. Privacy laws exist for a reason.", "score": -3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "So you think thats ok? Sad", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Someone wearing a damn camera on their face collecting information secretly?", "score": -1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "No.I dont", "score": 0, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Or im Gen X and we dont do that shit", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Not a boomer bud, sounds like you know nothing about Gen X.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "A. Your address is not necessarily a publicly available information.\n\nB. Your visage is not necessarily available to free public use, simply because it's out there on the streets.\n\nC. You did not give consent to linking any of the shit above.\n\nD. This is a new area of technology and new laws should be developed, i.e., in the spirit of the law, don't fucking creep on me just because the letter of the law has not been legislated yet.\n\nDo you really not fucking understand how these things work? Sure, in the narrow, literal interpretation of existing laws, it *may* be technically legal, mostly because our lawmakers are regarded and even then it's still a maybe. **In any other respect, however, you shouldn't be doing this shit.** \n\nSay you used the Zuck Glass last week to find out the address, age, job, and social media accounts of the hot girl that you've side-eyed at a bar the other day - you telling me you have no problem admitting to this sort of behavior?", "score": -3, "replies": [{"body": "In 1878, some guy published a \"phone book\"; sometime in the 2000's \"phone books\" became obsolete thanks to social media... \n\nBut the concept of your name, number, and address being publicly available has been around for decades. \n\nThe technology is a privacy nightmare now that you can search the \"phone book\" via someone's photo, without their consent; but the data being displayed is unfortunately nothing new.", "score": 6, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Aight we cool then", "score": -3, "replies": []}]}]}]}]}, {"body": "All and yes?", "score": 0, "replies": []}]}]}]}, {"body": "https://preview.redd.it/m9bvdahsqnsd1.jpeg?width=1280&format=pjpg&auto=webp&s=392bf9962093fcc06fd5423c7ecf63656e58c601", "score": 3, "replies": []}, {"body": "Maniacs will like it…", "score": 2, "replies": []}, {"body": "A face computer that will tell me the name of the person i'm talking to?  \n\nSign me up. \n\nCalls on meta.", "score": 1, "replies": []}, {"body": "Much worse than the Cambridge Analytical stuff, but Zuck looks like a chad now, so people won't care (for now).", "score": 0, "replies": []}, {"body": "I thought of a similar idea a while back.  Alas, I am a lazy turd. So instead. I just setup Whisper to translate in real time for me. Raspberry pi running whisper. SSH from phone. \n\nThen go to foreign restaurants and mind fuck the employees 🤣\n\nWonder when this will become standard issue with all intelligence agents aviators 🤔", "score": -7, "replies": []}]}
{"title": "Fatfingered NVDA Call Option and Now I'm Cooked ", "selftext": "Mean't to place the order to expire on the 18th while half asleep and I checked it after the market closed. 🤣\n\nThank I'm thankful it wasn't much but I kicking myself. I'll be behind Wendy's dumpster if you need me 🫡", "id": "1fvswve", "created_utc": 1728023999.0, "score": 0, "upvote_ratio": 0.28, "num_comments": 24, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 74 | **Previous Best DD** | \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "its $80 dude.", "score": 56, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 6, "replies": []}]}, {"body": "[deleted]", "score": 15, "replies": [{"body": "for 80 bucks you could have bought 2 bottles and sat in your car alone and drank them.", "score": 16, "replies": []}]}, {"body": "Brother no one gives a fuck about your $100 i gamble that everyday minimum", "score": 8, "replies": []}, {"body": "r/antstreetbets", "score": 5, "replies": []}, {"body": "post results at opening bell", "score": 8, "replies": [{"body": "God Speed 🫡", "score": -2, "replies": [{"body": "Just make sure you watch the 1m chart and buy/sell volume. Once the buying/selling stops going 1 direction. Close for a profit ASAP and don't schizo play yourself into thinking this'll close ITM", "score": 5, "replies": []}, {"body": "U might get out of this with some profit", "score": 1, "replies": []}, {"body": "Well dingus, did you close at open?", "score": 1, "replies": [{"body": "I'm still holding the bag 🫡", "score": 1, "replies": [{"body": "How'd things play out today?", "score": 1, "replies": []}]}]}]}]}, {"body": "Cut him slack it’s his life savings.", "score": 2, "replies": []}, {"body": "Wont matter. Would have been worthless on the 18th too.", "score": 1, "replies": []}, {"body": "Ask for a manager, see if they can provide a refund or courtesy discount", "score": 1, "replies": []}, {"body": "At least you didnt sell RIVN puts a couple days ago like I did...", "score": 1, "replies": []}, {"body": "What’s this? Options for ants? No…. Ticks….", "score": 1, "replies": []}, {"body": "All this fuss over $120", "score": 1, "replies": []}, {"body": "he thinks hes cooked but mofo's only on instant noodles![img](emote|t5_2th52|4640)", "score": 1, "replies": []}, {"body": "Dude even if you lose it all it’s $120 total that’s jack shit I literally am staying at a $150 per night casino right now.  Stop being a broke bitch", "score": -1, "replies": []}]}
{"title": "BA: Ryanair Boeing 737-800 suffers engine fire in Brindisi", "selftext": "", "id": "1fvu777", "created_utc": 1728029983.0, "score": 31, "upvote_ratio": 0.71, "num_comments": 28, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 6 | **First Seen In WSB** | 3 days ago\n**Total Comments** | 10 | **Previous Best DD** | \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Boeing doesn't make the engines", "score": 45, "replies": [{"body": "doesn't matter, Boing is jinxed.", "score": 11, "replies": []}, {"body": "There could be factors other than engine design issues to cause engine failure. The control part has to be have some control over engines, hydraulics, heat management etc?", "score": 3, "replies": []}]}, {"body": "GE, Rolls Royce, and Pratt & Whitney makes airplane engines. Boeing doesn’t make engines.", "score": 26, "replies": [{"body": "Yeah, but they also don't make the bolts they forget to put in the doors.", "score": -25, "replies": [{"body": "Thought you was cooking with this huh?", "score": 6, "replies": []}]}]}, {"body": ".", "score": 7, "replies": [{"body": "Yeah, there's no indication that this was a newly delivered plane. Likely the maintenance crew for RyanAir in Italy sucks bad.", "score": 1, "replies": []}]}, {"body": "Need to lookup where the fuck is Brindisi.", "score": 3, "replies": [{"body": "southern italy", "score": 5, "replies": []}]}, {"body": "Revenge leverage short position", "score": 1, "replies": []}, {"body": "Bullish.", "score": 1, "replies": [{"body": "Delulu", "score": -5, "replies": []}]}, {"body": "These airlines making big profits from revenge travel haven’t been keeping up the maintenance", "score": 1, "replies": []}, {"body": "Rolls Royce😊", "score": 1, "replies": [{"body": "No wonder the crashes. You can’t just stick cars to the wings and hope things work out.. 🤦‍♂️", "score": 2, "replies": [{"body": "Fun fact, Rolls Royce Holdings plc doesn't make cars anymore - only aerospace and defence", "score": 4, "replies": []}]}]}, {"body": "Why don’t you go look up airbus problems instead you Pratt!", "score": 1, "replies": []}, {"body": "It always baffles me that Ryanair has managed to retain their place in being one of the safest airlines in the world for decades. Fair play, you’d have thought with being a super low cost airline that we would’ve seen ground crew botch a repair or cut back on maintenance causing a crash by now", "score": 0, "replies": [{"body": "It actually the opposite. They are quite rigorous with maintenance. Spending on routine maintenance is cheaper than the possible losses associated with aircraft having maintenance related delays while in service. ", "score": 6, "replies": [{"body": "I know they don’t cheap out on maintenance, they’re one of the best for responsibly managing their airlines and their safety record shows it. Just saying, you wouldn’t expect one of the cheapest to be one the most responsible and safest lol", "score": 6, "replies": []}]}]}, {"body": "Poor old Boeing, just can't catch a break can they... lol.", "score": -2, "replies": []}, {"body": "What’s new?", "score": -2, "replies": []}, {"body": "Several media outlets have reported on the issue, but i haven't seen the story around here yet.", "score": -6, "replies": [{"body": "And your point is?\n\nThis aircraft's about 10 years old and Boeing doesn't build or maintain the engines.", "score": 4, "replies": []}]}]}
{"title": "Bear, Bull, or Neutral?", "selftext": "What is your opinion of market direction, now that we are in Q4 2024.\n\nSince COVID 19, the shortest lived bear market in all of history, 4 weeks of pandemonium, the bull has been unstoppable.\n\nThe latest leg of the bull has been 49 weeks of relentless gains.\n\nPrior to that it was about 94 weeks of neutral trading with no discernible direction.\n\nAnd prior to that it was 91 weeks of a gravy train bull ride.\n\n(Please excuse me if I’m 1 or 2 weeks off in my count.)\n\nWhat say you?  Have bear markets gone extinct since COVID?  In the aggregate, is the stock market a no can lose investment vehicle?", "id": "1fw74ia", "created_utc": 1728068893.0, "score": 6, "upvote_ratio": 0.75, "num_comments": 22, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 6 months ago\n**Total Comments** | 6 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "You missed 2022", "score": 3, "replies": [{"body": "The 1st week of 2022 through the 3rd week of October 2023 was 94 weeks of neutral direction.", "score": -1, "replies": [{"body": "bull markets usally last longer than bear markets. And 2022 was overall a bearish year", "score": 1, "replies": [{"body": "Even the Nasdaq had recovered all of its 2022 decline by Q2 2024.  The Dow recovered those declines by Q1 2024.  \n\nIs there any reason to think the stock market is not a no can lose gravy train?", "score": -1, "replies": []}]}, {"body": "You must have missed lots of companies dropping 50 - 90%", "score": 1, "replies": [{"body": "I’m just considering the indexes.  They were neutral, not bear.", "score": 1, "replies": [{"body": "You have to look for value of individual companies.  Even now Intel is trading low and everyone hates it saying it’s a garbage company. The same people will kick themselves saying why didn’t they buy it and everything is overpriced.", "score": 1, "replies": []}, {"body": "https://www.macrotrends.net/2526/sp-500-historical-annual-returns it was literally down 19.2% in 2022 for the entire year, please find a fucking brain regard.", "score": 0, "replies": [{"body": "not even 20% in 2022 and all declines recovered by Q4 2023 in that index.", "score": 1, "replies": [{"body": "Are you a fucking regard LMAOOOO", "score": 0, "replies": [{"body": "Wow fast reply.  \nI hate when people sign emails.\n\nBest regards,\nJack ass", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Ok, but the s&p declined 25 percent in the first ten months of 2022, bottoming in Oct 2022, the definition of a bear market. That marked the low and the end of the 2022 bear market.", "score": 1, "replies": [{"body": "The trend was neutral, the bull trend was not broken.\n\nFrom ~ 20 to 36 to 30 to 42 is not a broken bull trend", "score": 0, "replies": [{"body": "OK, whatever - every analyst and stock market commentator acknowledges 2022 as a bear market by every definition in the book. Again, a 20 percent decline or more is the classic definition of a bear market. But I guess you know better, good luck to you in your trading endeavors if you are trading real money and can brush off a 25 percent decline", "score": 2, "replies": [{"body": "The indexes barely changed from start to end of 2022.  It was neutral.\n\nDon’t you just love how the pundits rationalize every decline that kisses the 20% level as a total reset, and the best reason for everybody to get back aboard the no can lose gravy train?", "score": 1, "replies": [{"body": "Well, you can prove anything by \"cherry-picking\" dates, I guess. Doesn't really change the fact that 2022 was a bear market from Jan thru Oct according to 100 percent of every stock market analyst, except for you.", "score": 1, "replies": [{"body": "That is because I look at the long term picture and check if there are lower lows.\n\nGuess what? there never is (unless you zoom in to very short periods).\n\nTherefore, do you think the stock market, at the index level, is a no can lose gravy train?\n\nIt’s difficult to say it isn’t, wouldn’t you say?", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I choose autist", "score": 1, "replies": []}, {"body": "Grandson of nana", "score": 1, "replies": []}, {"body": "Crabbish", "score": 1, "replies": []}, {"body": "Big rally post election, either way -- although delayed election results would cause a pause.", "score": 0, "replies": []}]}
{"title": "Bloomberg: Carpenter loses $306 million on TSLA", "selftext": "", "id": "1fw8hvg", "created_utc": 1728072457.0, "score": 27, "upvote_ratio": 0.81, "num_comments": 20, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "\"It is easier for a camel to go through the eye of a needle, than for a regard to gain eternal riches.\"", "score": 31, "replies": [{"body": "Father regard 3:16", "score": 3, "replies": []}, {"body": "Musk 10:25", "score": 1, "replies": []}]}, {"body": "Typical Tesla bum. Follows the crowd, makes a fortune, think I did it, continues following the herd, loses it all, it’s the SEC! It’s the firms! The systems rigged! Typical sheeple.", "score": 13, "replies": [{"body": "You speak as though you’ve made those numbers… read into it youngin makes a good bet wins wins again and isn’t advised by advisors to hold some CASH in accounts lol… don’t be bitter calling people sheeple cause he did something you didn’t do. Fricking advisors should be more like it. Understand the dude not the institutions built and doctrinated to manipulate, use and abuse us. I salute him and hope he wins his case. Guys got grounds and I stand with him 🫡 Good luck buddy", "score": -2, "replies": []}]}, {"body": "Wtf. Not once did he think to set aside like 30m in case everything blows up?", "score": 13, "replies": []}, {"body": "Imagine being up 480 million and not taking a break or slow down. SMH", "score": 9, "replies": []}, {"body": "[bloomberg link](https://www.bloomberg.com/news/articles/2024-10-04/carpenter-claims-he-made-306-million-on-tesla-then-lost-it-all?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTcyODA3MjMwNywiZXhwIjoxNzI4Njc3MTA3LCJhcnRpY2xlSWQiOiJTS1UxR0VEV1JHRzEwMCIsImJjb25uZWN0SWQiOiI1QjExNUEyNUFDQUI0Q0ZGQTlBMDg2RDE1RjlFNzk0NSJ9.NJLWeYCObZcE0LwrldUYDm4UcAZAyRAMJzhfKVhuAas)\n\nnanas: if you recognize this regard as your grandson, please step forward\n\n# Day Trader Says He Made $306 Million on Tesla, Then Lost It All\n\n* His lawsuit accuses RBC, Grant Thornton of negligence\n* Day trader says he had ‘limited’ tax, investing knowledge\n\nChristopher DeVocht, a carpenter from Vancouver Island, Canada, says he started out like a lot of day traders. After work, he’d read about trading on forums. His favorite things to trade were options on [Tesla Inc.](https://www.bloomberg.com/quote/TSLA:US) stock.\n\nThen he went on what has to be one of the hottest hot streaks in the history of financial markets, according to a legal filing. At the end of 2019, his account, with the brokerage division of [Royal Bank of Canada](https://www.bloomberg.com/quote/RY:CN), was worth C$88,000. Within two years, he’d turned that into C$415 million ($306 million), he says.\n\nSome people would have cashed out. DeVocht didn’t. And when Tesla stock fell in 2022, he lost it all, according to a lawsuit he filed this week against RBC Dominion Securities, RBC Wealth Management and accounting firm [Grant Thornton LLP](https://www.bloomberg.com/quote/4102548Z:CN). The filing, which is an initial notice of claim that doesn’t require evidence to be provided at this stage, didn’t include brokerage statements or other proof of his gains or losses.\n\nDeVocht now claims that the advice he received, geared mainly toward minimizing taxes, was negligent and failed to take into account his level of financial sophistication. His Tesla investment strategy involved loans from a Royal Bank margin account.\n\n“RBC considered Mr. DeVocht to be a sophisticated investor,” according to the complaint. “While this was true in respect of his strategies for put and call options in the trading of Tesla shares, RBC failed to appreciate that Mr. DeVocht’s knowledge of investing more generally, of financial planning, and of tax was in fact limited.”\n\n“The only statement we can provide at this time is that we’re committed to providing quality services to all our clients in accordance with professional standards,” Grant Thornton said in an emailed statement.\n\nDeVocht was good at trading Tesla shares and options, he said in the lawsuit, but he was in his 20s, struggling with “significant respiratory and other health issues” and had limited understanding of financial issues. When he first went to Royal Bank in July 2020, he wanted a loan so he could move out of his rental apartment and buy a home. At the time, his portfolio was worth about C$26 million “and rising rapidly,” according to the notice of civil claim, filed with the Supreme Court of British Columbia in Vancouver.\n\n# ‘Worth Nothing’\n\nTesla shares suffered a series of declines and periodic rallies throughout 2022 and DeVocht tried to recoup some of the losses by borrowing C$20 million from the corporation and using it to make shorter-term trades in his personal account. That strategy failed, and the money was lost, he said in the complaint. When Tesla shares saw even steeper declines in October 2022, DeVocht’s corporation had to sell its Tesla holdings to repay loans from a margin account it held with Royal Bank, according to the suit.\n\nDeVocht and his corporation tried to mitigate these losses but, in time, their “securities holdings were worth nothing,” he said in the complaint. If not for the “inadequate advice” DeVocht received, he and his corporation “would have preserved a substantial portion of their wealth and implemented financial planning that would not have resulted in the loss of their entire net worth.”", "score": 7, "replies": [{"body": "I hope this guy is on here we need to make him a mod.", "score": 5, "replies": []}, {"body": "Oh my gourd! \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "Holy shit. It's Chad Dickens.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}, {"body": "Ok, so we all know this legend is on WSB.\n\nShow yourself!", "score": 7, "replies": []}, {"body": "The GOAT of goats!", "score": 5, "replies": []}, {"body": "Well now we know who was gamma charging tsla in 2021-2022", "score": 5, "replies": []}, {"body": "10/10 Jesus will rise again .. the second coming of GUH", "score": 3, "replies": []}, {"body": "If TSLA didn’t trade like a meme stock I would like it a lot more. I just have shares for this reason.", "score": 3, "replies": []}, {"body": "Yeeee. CANADA REPRESENT.", "score": 3, "replies": []}, {"body": "I thought I saw 300+k and I thought the WSB legends were greater.. until I reread and saw Million.\n\nDefinitely Bill Hwang tier degen.", "score": 2, "replies": []}, {"body": "Reading nothing more than the basic info that's been circulating, I genuinely wonder if he was up that much or if someone was advising him of the \"infinite money glitch\" by just continuously leveraging leverage until it all came crashing down.  In other words, he could've done something like turn his money into $10 million going all-in on TSLA calls, and then leverage that balls deep with more calls several times over to the point that his \"$480 million\" was never really more than like 1/4 of that.  Plain and simple, he did not have $480 million unleveraged.", "score": 1, "replies": []}]}
