{"title": "What earnings releases to watch for before NVDA’s?", "selftext": "", "id": "1g0hllz", "created_utc": 1728563178.0, "score": 31, "upvote_ratio": 0.94, "num_comments": 23, "comments": [{"body": "Company\tNext Earnings Date (Estimated or Exact)  \nAMD\t24-Oct-24  \nIntel\t24-Oct-24  \nQualcomm\t1-Nov-24  \nBroadcom\t12-Dec-24  \nTSMC\t18-Jan-24  \nASML\t24-Jan-24  \nMicron Technology\t20-Dec-24  \nMicrosoft\t24-Oct-24  \nAlphabet\t24-Oct-24  \nAmazon\t25-Oct-24  \nApple\t31-Oct-24  \nSamsung Electronics\t31-Oct-24  \nNXP Semiconductors\t30-Oct-24  \nMarvell Technology\t6-Dec-24  \nNvidia\t21-Nov-24  \nLam Research\t17-Oct-24  \nApplied Materials\t16-Nov-24  \nKLA Corporation\t26-Oct-24  \nSynopsys\t14-Dec-24  \nCadence Design Systems\t20-Oct-24  \nON Semiconductor\t31-Oct-24  \nTexas Instruments\t26-Oct-24  \nSTMicroelectronics\t31-Oct-24  \nInfineon Technologies\t18-Oct-24  \nArm Holdings\t7-Nov-24  \nSony Group\t14-Nov-24  \nSK Hynix\t5-Nov-24  \nMeta Platforms\t16-Nov-24  \nAlibaba\t20-Nov-24  \nTencent\t18-Oct-24  \nSAP\t18-Oct-24", "score": 46, "replies": [{"body": "Sounds like oct 24/25 will be telling", "score": 2, "replies": []}, {"body": "Are the earnings dates correct for TSMC and ASML ??", "score": 2, "replies": [{"body": "TSMC is 10/17, posted on Yahoo finance", "score": 3, "replies": []}, {"body": "Its an estimate.  \n\nIf you're so concerned about them, you would also do well to realise that price move according to fundamentals over time.", "score": 3, "replies": []}]}, {"body": "Awesome, thanks!", "score": 1, "replies": []}, {"body": "Thank you!", "score": 1, "replies": []}, {"body": "!remindme 12days", "score": 1, "replies": [{"body": "I will be messaging you in 12 days on [**2024-10-23 10:44:55 UTC**](http://www.wolframalpha.com/input/?i=2024-10-23%2010:44:55%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/NVDA_Stock/comments/1g0hllz/what_earnings_releases_to_watch_for_before_nvdas/lre5e1p/?context=3)\n\n[**2 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FNVDA_Stock%2Fcomments%2F1g0hllz%2Fwhat_earnings_releases_to_watch_for_before_nvdas%2Flre5e1p%2F%5D%0A%0ARemindMe%21%202024-10-23%2010%3A44%3A55%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201g0hllz)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Definitely!", "score": 2, "replies": []}, {"body": "Yep, 10/17/24", "score": 2, "replies": []}, {"body": "They just released earnings guidance yesterday that was higher than expectations.", "score": 1, "replies": []}]}, {"body": "TSM/SMCI. TSM manufacturers blackwell chips and SMCI builds out data centers/install AI hardware.", "score": 3, "replies": []}, {"body": "Nobel prizes for Physics and Chemistry went to Ai technology- \nHold youre nvda! nvda has 90+% of the moat! At least till end of 2026", "score": 3, "replies": []}, {"body": "Curious to see how AMD has performed I haven’t bought any shares so I’m still standing on the sidelines", "score": 2, "replies": []}, {"body": "My plan is be be wayyyy over-committed to NVDA until mid- or end of 2026. Then it’s retire and move most of it to VOO", "score": 2, "replies": []}, {"body": "Update me", "score": 1, "replies": []}, {"body": "going to be fun scalping off these behemoths with a pre earnings rise great report = thousands in free money, you have to pick a number mine is 10,000 but because I will only be in for a short time so i will need to make 15,000 and put 5000 in a 5.5% interest account for paying taxes! NEVER NOT PLAN FOR UNCLE SAM! if you can hold for a month you’ll save enough in taxes 5,000 will be close enough! Indian season for scalps baby !", "score": 1, "replies": []}, {"body": "Everything related to semiconductors. Is this really a question?", "score": -3, "replies": [{"body": "I am asking what specific companies release their earnings BEFORE NVDA does in mid November. Thanks", "score": 3, "replies": [{"body": "All the big tech companies buying from nvda. \n\nOct 21 week is earnings week for many mega cap tech. It will be important to listen if they plan to continue spending.", "score": 6, "replies": []}]}]}]}
{"title": "Morgan Stanley just met with Nvidia’s CEO and came away even more confident in its top pick", "selftext": "", "id": "1g0ntar", "created_utc": 1728580241.0, "score": 153, "upvote_ratio": 0.97, "num_comments": 20, "comments": [{"body": "Locked for Duplicate Thread. Other thread, https://www.reddit.com/r/NVDA_Stock/comments/1g0okso/key_takeaways_from_morgan_stanley_3_day_road_show/  \nhas summaries/transcripts.  \n\nThis one only has a paywall.", "score": 1, "replies": []}, {"body": "Pay wall. Summary?", "score": 7, "replies": [{"body": "N￼vidia shares are rising on Thursday after management said demand for its next generation GPU Blackwell is strong.\nIn a note published Thursday, Morgan Stanley analyst Joe Moore said his firm hosted Nvidia CEO Jensen Huang and other members of the company’s management team this week for a series of meeting with investors. The analyst said the executives revealed Nvidia’s Blackwell GPU products are “booked out 12 months,” which means if a customer puts in an order today they won’t receive the product until late next year.", "score": 6, "replies": [{"body": "ironically, this means that nvidia is incompetant at managing capacity; they are losing money compared to what they could be making if they had adequately prepared for demand.", "score": -10, "replies": [{"body": "You know they're not running their own fabs right?", "score": 6, "replies": [{"body": "irrelevant. This is corporate planning 101: ensure adequate supply pipeline.  \nThey know this, which is why they are already in negotiations with Foxconn for a plant in mexico.  \nBut they started that planning a year later than they should have.", "score": -5, "replies": [{"body": "Lmao, you can't be real", "score": 4, "replies": [{"body": ">you can't be real\n\nYeah, bot or paid troll.", "score": 3, "replies": []}]}]}]}]}]}, {"body": "# Morgan Stanley just met with Nvidia’s CEO and came away even more confident in its top pick", "score": 9, "replies": [{"body": "Thanks!", "score": 6, "replies": [{"body": "lol sorry that's all I got.", "score": 4, "replies": []}, {"body": "“booked out 12 months,”", "score": 1, "replies": []}]}]}, {"body": "> Pay wall. Summary?\n\nI posted the Morgan Stanley NVDA report here:\n\nhttps://www.reddit.com/r/NVDA_Stock/comments/1g0okso/key_takeaways_from_morgan_stanley_3_day_road_show/", "score": 2, "replies": []}]}, {"body": "[For those stuck behind the paywall.](https://archive.is/WQiAK#selection-2351.0-2351.985)", "score": 6, "replies": []}, {"body": "Tbh this doesn't mean shit, we beat Aug earnings by 2 billion\n\nStock still slipped and never reached a new ath", "score": 10, "replies": [{"body": "You think new ATHs are never coming?", "score": 6, "replies": []}, {"body": "The market was looking for any reason to move money. Now it looks like the opposite. I wouldn’t bet the farm on Nov earnings but Feb may fuel explosive growth.", "score": 3, "replies": []}, {"body": "?? Stock is up 48% in 6 months, 188% the last year, what are u talking about? Short term movement isn't 1:1 with the latest news. But long term if earnings are good the stock goes up.", "score": 2, "replies": []}]}, {"body": "Aston Martin soon….", "score": 2, "replies": []}]}
{"title": "I’m calling the intermediate Top in NVDA", "selftext": "[removed]", "id": "1g0uutz", "created_utc": 1728598791.0, "score": 33, "upvote_ratio": 0.86, "num_comments": 29, "comments": [{"body": "Removed for Low Quality Content. Either post the clip or post the transcript to pass the standard.", "score": 1, "replies": []}, {"body": "NVDA has a lot of momentum behind it now. Blackwell has finally arrived and NVDA will be minting money from it. Nov and Dec are generally good months for the market. I'm a bull.", "score": 37, "replies": []}, {"body": "As long as inflation keeps dropping, unemployment stays around 4.2%, no new wars, cut more interest rates, and continue to have strong jobs reports, we should be good for the next 4 months. NVDA to $200!", "score": 13, "replies": [{"body": "So if everything goes well then things will work out", "score": 2, "replies": []}]}, {"body": "We're still very early in the AI revolution, remember.", "score": 9, "replies": [{"body": "INTERMEDIATE top…", "score": 3, "replies": [{"body": "All the Cramer jinx, inverse non-sense gets real old…", "score": 0, "replies": [{"body": "Spotted the guy with $130 average", "score": 0, "replies": [{"body": "I’ve been in this thing since $15/share.. and Cramer has been recommending it for the last 10 yrs..\n\nUsername checks out tho :P", "score": 5, "replies": [{"body": "Your username checks out too LOL", "score": -4, "replies": []}]}]}]}]}]}, {"body": "We're in the top of the 2nd inning. I remember when bear Stearns was a buy according to ex hedge fund pundit...", "score": 3, "replies": []}, {"body": "Cramer calling it the end means it's going to rip.\n$140 tomorrow 🚀🚀🚀", "score": 2, "replies": [{"body": "Cathie Wood must first sell all her nvda?", "score": 1, "replies": []}]}, {"body": "Oh how he tries...", "score": 2, "replies": []}, {"body": "You’re reacting emotionally. Don’t. \nLook at who owns most of the stock and modify your behaviors to mimic theirs. \nIf the short positions from institutional investors are heavy, it’s going to drop about 7-15% inside a month. \n\nThe issue is, once NVDA reaches $160+ levels, it won’t be so simple to get back to $120 levels. Once it hits certain resistance levels, it takes a lot of bad news and sideways trading, to drop it hard. \n\nIf it hits $160 Before Jan 4th.. you can with new revenues being tracked in the Blackwell chip sales 2025’ to start towards $190+ \n\nIt could go ass backwards however if it goes from $135 now, to $125.  It is goes to $125, it’s very easy to hit $117 then $112.", "score": 1, "replies": [{"body": "I don't see it going under 120 any time ever short of a black swan", "score": 1, "replies": [{"body": "It was just at $102 2 weeks ago and it was at $141 when it began dropping. \n\nThese elections will play a big part of where it goes.", "score": 1, "replies": [{"body": "Elections don't mean shit.\n\nThe biggest moves in the market that started, and decided momentum in the past 4 months (only a few months leading up to the election) were entirely based on unemployment data, central banking delay in rate cuts, and then the 50bps rate cut when it finally did happen. \n\nThose were the only things that decided the momentum of tech overall and only pivoted until one of those things happened.\nBears have nothing on the horizon to make markets tuck tail rn. It was, and still is entirely based on a recession narrative, which the market will try to get ahead of. Only the data and central banking decisions matter. \n\nThe only short-term action downward we could see is escalation in war, but that's unlikely to affect markets past a few days or so. (I.e. Iran launching missles at Israel)\n\nChina invading Taiwan is one of the few things that could send us into calamity mode. But that's highly unlikely to happen.\n\nOtherwise, we need more hot unemployment and hot cpi prints in the middle of cuts to create panic and fear.\n\nPeople sitting on longterm or near long term gains from this year's run up arent going to sell either, they'll wait out until next year to realize  gains to hold off on paying taxes for another year or to get long term capital gains tax rate. This is going to help keep upwards pressure on the stock as well.\n\nI just don't see any real reason for bulls to be selling here anytime soon. There's just no need to take profits here, rn. If you know of any, let me know.", "score": 1, "replies": []}]}]}]}, {"body": "Haha someone is in love with Cramer in here. They are down voting everyone.  Rule number one.  Don't take cramers advice.  Who's paying for his show? It's definitely not retail being scammed by his Shananagans. Down vote me Cramer lover! It let's me know your an idiot.", "score": 1, "replies": []}, {"body": "It's not the top, or even an intermediate top.\nMy guess is after the economic data comes out tomorrow there's another surge into the weekend. Then next week, it just continues.", "score": 1, "replies": []}, {"body": "I say it’s the intermediate bottom", "score": 1, "replies": []}, {"body": "The reality is that he doesn't know what he's talking about! It's hilarious!", "score": 1, "replies": []}, {"body": "I said INTERMEDIATE top. Ugh learn how to read people. You belong here. \n\nIt could easily pop up tomorrow at the open but I’ll edit to say this is the closing high for a while.", "score": -1, "replies": []}, {"body": "NVDA to 150 and Cramer has a stroke, heard it here first folks.", "score": 0, "replies": []}, {"body": "Fuck nvidia is doomed! still remember when he said at around 200$ pre split that nvidia is a shit company cuz btc miners dont want chips anymore, so i doubled my position dont underestimate reverse cramer guys.", "score": 0, "replies": []}, {"body": "All this talk of Blackwell 2025 has me wondering if margins are going to increase lol - would be insane", "score": 0, "replies": []}, {"body": "Inverse Cramer always! NVDA is a beast", "score": 0, "replies": []}, {"body": "Brother, he even has an NVDA mug. We’re cooked for until earnings 😭", "score": 0, "replies": []}]}
{"title": "I lost too much money ", "selftext": "[removed]", "id": "1g0qh9r", "created_utc": 1728587151.0, "score": 0, "upvote_ratio": 0.38, "num_comments": 20, "comments": [{"body": "Sorry -- we removed your post or comment because it's low effort.  Please put effort into what you post to r/stocks.  Any of the following are considered low effort and will result in your post or comment being removed:\n\n* Posts or comments that rely on memes to get your point across\n\n* Posts or comments which are basic one/two sentence questions\n\n* Posts or comments that are similar to ones made several times recently\n\n* Posts or comments where no actual research was done before asking the question or starting the discussion\n\nIf you need more information on a stock, try looking it up on finviz.com or a business news website.  After that, come back and back up your statements with a source or provide a more in-depth question.\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules", "score": 1, "replies": []}, {"body": "this is exactly why you leave the trading to professionals.. as you said - buy and hold, or giving it to said professionals to do it for you..\n\nbright side - you didnt lose all and got 75% of initial investment left! you gonna bounce back stronger with that lesson learned, dont give up on investing!", "score": 3, "replies": []}, {"body": "Agree with all the comments here put the money in and let it sit that being said it's always fun to have a few thousand that you gamble and play with on other stocks. Just not the bulk.", "score": 2, "replies": []}, {"body": "Investing is an exercise in patience. What you are doing is gambling.", "score": 2, "replies": []}, {"body": "That's a 25k lesson learned. Use it and don't repeat the mistake.", "score": 1, "replies": []}, {"body": ">leverage\n\noh well! This essentially means that you just invested money that you didn't have.", "score": 1, "replies": []}, {"body": "Common story for a lot of NVDA retail. Just buy the next dip and hold for a minimum of 3 years no matter how volatile it is in between. Just look out for news that affects production.", "score": 1, "replies": []}, {"body": "What I read is that you gambled and you had a run up until the casino took it back.\n\nGet a grip back on reality. Those numbers on the screen with a couple clicks is nothing other than putting all your chips on red or black if you trade it short term like that.\n\nAlso you did not loose too much money, you lost 25k,  a quarter of your chips. The 75k up was not real. It's only real when you realize it. Unrealized gains are an illusion.", "score": 1, "replies": [{"body": "Doesn't OP also need to pay taxes on the $75k?", "score": 1, "replies": [{"body": "Not if it is all realized. One loss offsets a gain. And in the US you can claim 3k as a loss on your taxes to reduce your taxable income and roll the remaining losses into upcoming years.", "score": 1, "replies": []}]}]}, {"body": "So what did you do with the remaining money?", "score": 1, "replies": []}, {"body": "Stop using leverage. Stop trading options. Like you said, buy and hold stock is probably better for you. In the grand scheme of things, being down 25% is way better than being down 100% so you still have enough capital to work with.", "score": 1, "replies": []}, {"body": "Those taxes are going to hurt", "score": 1, "replies": [{"body": "Wdym?", "score": 1, "replies": []}]}, {"body": "You mentioned you traded. Im assuming you realized gains a few times. Those gains have taxes on them that you'll owe", "score": 1, "replies": [{"body": "What about all the losses though?", "score": 1, "replies": [{"body": "You can claim 3000 max for losses per year. The other will roll over. But gains will be taxed for that year.", "score": 1, "replies": [{"body": "I'm in Canada. Does that make a difference?", "score": 1, "replies": [{"body": "Welp idk the Canada tax codes. You gotta do that work", "score": 1, "replies": []}]}]}]}]}]}
{"title": "Thoughts of Tesla Robo Taxi ?", "selftext": "[removed]", "id": "1g0abj8", "created_utc": 1728532529.0, "score": 1, "upvote_ratio": 0.54, "num_comments": 30, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | 2 weeks ago\n**Total Comments** | 3 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Elon is full of shit", "score": 17, "replies": []}, {"body": "Down", "score": 16, "replies": []}, {"body": "Elon will wear an invisible cloak and will drive the taxis around. The key is, they'll start on a hill and set off downhill so the taxis roll as they won't have working engines... Proven method I hear", "score": 9, "replies": []}, {"body": "The south african jumping bean has ruined the future", "score": 8, "replies": []}, {"body": "They will be driven by a man in India with a Logitech F710 game controller.", "score": 6, "replies": []}, {"body": "My guess Tesla goes up tomorrow. Larger scale waymo service? Seems like a good bet", "score": 5, "replies": [{"body": "People act like Waymo isn’t already an active service lol", "score": 3, "replies": [{"body": "Up until a few days ago, I didn’t know waymo was where it is now. Didn’t know they had an app 💀", "score": 2, "replies": []}]}]}, {"body": "Elon doesn't get AI right", "score": 2, "replies": []}, {"body": "Will never happen ![img](emote|t5_2th52|4271)", "score": 2, "replies": []}, {"body": "Camera can’t tell a real person vs picture of a realtor on a city bus.. so yeah..good luck with that", "score": 2, "replies": [{"body": "Well, I, for one, would NEVER hope you get hit by a bus.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": [{"body": "As long as not by Tesla fsd..", "score": 2, "replies": []}]}]}, {"body": "If a CEO says “if [leading candidate] gets elected, I’m probably going to jail” a month before an election, that’s more risk than I’m willing to deal with. \n\nNot saying there’s not money to be made, but don’t be shocked if it goes wrong.", "score": 2, "replies": [{"body": "When did Elon say this? Must have missed something", "score": 2, "replies": []}]}, {"body": "For the memes I hope there’s a catastrophic failure and Elon reacts really autisticly.. but as a shareholder I hope he makes people think they’ll have lv4 robotaxis by 2025", "score": 2, "replies": []}, {"body": "Here’s how Tesla stock will probably go tomorrow. Everyone will say, oh my gosh there is so much money to be made here. There’s no way this goes tits up. The stock rises to new heights. The richest man in the room waits in the shadows timing his sell perfectly to force you to jump ship. News and media blaming the stock drop on something erroneous, like Elon saying the taxis won’t have cup holders.  Everyone gets gut punched while the richest man is buying puts. Now the slate is cleared. Stock flatlined. Everyone who bought on the FOMO is off the table. Time for the richest man in the room to then buy. Sending it higher than it had reached prior. Everyone runs screaming, oh what a cruel joke I sold too soon, time to play calls since I lost so much with stocks…and wouldn’t you guess who’s waiting in distance. Mr. Money farmer waiting for all the cows to come to slaughter. Rinse and repeat. Zoom out friends. There’s always “a huge play”, just depends on who you follow. Remember pennys make dollars and if someone told you to jump off a bridge woul… oh fuck it buy all the Tesla you want, pour nannas purse into that fucker. This is America 🇺🇸 the home of the few, the proud, the regard 🫡", "score": 7, "replies": []}, {"body": "I’ve been following the FSD demos on YouTube and 12.5 looks amazing. I don’t have a Tesla though so I can’t say for sure. \n\nBut based on the demos it straight up looks like a chauffeur is driving you around town. I would believe the tech for robo taxi is rapidly approaching.", "score": 3, "replies": [{"body": "I’ve been using FSD for a month and I’m quite impressed. It drives better than most people I know, and it drives better than me if I’ve had a few and/or i have my phone in my hand. My commute is 30 miles on both rural roads, city streets, and packed interstates. Bumper to bumper and 85mph free flow. And I don’t have to intervene on my entire trip- but I don’t trust it either. Probably because I’m human and feeling superior is what we do best. Can’t stand Elon either, and think robotaxi is a losing proposition, and think red is appropriate so I’m positioned for green. Tesla is a meme stock and there’s just no logic to it- sometimes you eat the bar and sometimes, well, the bar eats you", "score": 2, "replies": []}]}, {"body": "I think up, followed by some pullback. Hoping for around $270-$280", "score": 2, "replies": []}, {"body": "I watched Tesla many times and I know it will go up. Tesla Robo Taxi Demo will be impressive with self driving since they have planned everything for it, cannot go wrong ...", "score": 1, "replies": []}, {"body": "Elon is full of shit, he’s been making this promise for like a decade, check out thunderf00ts breakdown from 9 months ago about fsd [sauce](https://youtu.be/QoFxTTC-tm0?si=NqbT2TWaLX0IJtgh)", "score": 1, "replies": []}, {"body": "This prolly goes up cuz Tesla tech is unrivaled, people love cybertruck best selling trucks in recent quarter. Most user centric car maker imo. I’m thinking to buy in tmr before the event LFG", "score": -1, "replies": [{"body": "Unrivaled?", "score": 2, "replies": [{"body": "I mean what other ev has fsd.", "score": -1, "replies": [{"body": "https://www.reddit.com/r/CyberStuck/s/0lSmFXMBje", "score": 1, "replies": []}, {"body": "Why would I want a janky driver assist that randomly swerves into oncoming traffic and requires more attention than just normal driving?", "score": 1, "replies": []}]}]}]}]}
{"title": "$JPM earnings play with DD.", "selftext": "I am currently holding puts as I am expecting 20% movement downwards.\n213.45 - 20% = 170.76 \n50 puts = 5000\n195 (my position)-170.76 = 24.24 \n5,000 x 24.24 = 121,200 $ \n\nThe things which I am looking at are \n\n1. Need to pay back\n £12,236 LLOYDS bank \n2. £ 4,145 HSBC\n3. £ 8,086 Barclays \n4 £ 2,430 Capitalone (credit card \n5. £ 1,730 Barclays (credit card)\n6. £ 983 Lloyds (credit card \n7. £ 9000 to couple of my friends (borrowed)\n8. 1,850 Rent (home \n9. £ 183 Gas & Electricity bills \n10. £ 450 car repair.\n\nWith the rest of the money I will buy a mortgage house and gift it to my wife’s boyfriend .", "id": "1g0l34c", "created_utc": 1728573127.0, "score": 13, "upvote_ratio": 0.69, "num_comments": 29, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 10 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 338 | **Previous Best DD** | \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Expecting JPM down 20% on ER is wild.", "score": 40, "replies": [{"body": "I think the bright side is that OP bought the monthlies, not weeklies. So it won't be completely down to 0 when the market opens tomorrow, and OP may be able to salvage enough to cover few frosties.", "score": 5, "replies": []}]}, {"body": "Would you like fries with that sir?", "score": 22, "replies": [{"body": "That will be 5 bucks baby. He just left...with NUTS.", "score": 2, "replies": []}, {"body": "Read this, son. You're going to ask this question a lot of times.", "score": 1, "replies": []}]}, {"body": "![img](emote|t5_2th52|52627)see you at Wendy’s bro", "score": 9, "replies": []}, {"body": "You have to have some seriously good DD and the biggest balls in history. I mean they must be the size of two prize winning pumpkins🫡🫡 se you behind the dumpster brother", "score": 9, "replies": []}, {"body": "are you ok bro do you need some money", "score": 6, "replies": [{"body": "wait is this real , i thought it was a fucking meme", "score": 2, "replies": [{"body": "up 5 percent lol", "score": 1, "replies": []}]}]}, {"body": "Options market is pricing in a 3.1% move tomorrow and you’re counting on a 20% drop.\n\nYikes. I mean, I’m bearish on financials tomorrow too, but yikes.", "score": 6, "replies": [{"body": "JPM might drop 5% if Dimon is excessively gloomy or something but 20%? Not happening", "score": 3, "replies": []}]}, {"body": "DD? Deadly Dick?", "score": 3, "replies": [{"body": "That's the size of boobs, DD size.", "score": 1, "replies": []}]}, {"body": "Good luck!", "score": 2, "replies": []}, {"body": "I’ll take a Frosty to drink.", "score": 2, "replies": []}, {"body": "Have fun making my krabby patty regard", "score": 2, "replies": []}, {"body": "wen earnings", "score": 2, "replies": []}, {"body": "The catalyst likely to be a -20% move maker is not earnings, its collateral management problems. Earnings is not the event to make this bet on.", "score": 2, "replies": []}, {"body": "Guh.", "score": 2, "replies": []}, {"body": "Ban this clown shit.", "score": 3, "replies": []}, {"body": "What’s the DD?", "score": 2, "replies": [{"body": "“Trust me bro”", "score": 6, "replies": []}]}, {"body": "Earnings is today", "score": 1, "replies": []}, {"body": "They are up 1 percent", "score": 1, "replies": []}, {"body": "What did you do", "score": 1, "replies": []}, {"body": "Guh 🥴", "score": 1, "replies": []}]}
