{"title": "Bear SPY strategy with high IV", "selftext": "Relative beginner here, asking half out of academic interest and half to maybe make some small plays (already got lucky with Tesla puts so happy to sit on cash until VIX is back below ~23).\n\nIf I were of the opinion that SPY was going to 300-250 by the end of the year, maybe earlier, what would be an option strategy to play this? I've mostly done simple long options before, but I don't think buying ATM or slightly OTM long SPY puts would work that well because IV is so high that any fall in volatility or inevitable green day would cost too much, even if I was right about the general direction of SPY. \n\nWhat do you think of shorting SPY and hedging with a long OTM call? Or selling ATM SPY calls and hedging with a (far) OTM call? \n\n(Also I can't really do vertical spreads well because of stupid German tax rules but this can be disregarded)", "id": "umedcg", "created_utc": 1652173466.0, "score": 3, "upvote_ratio": 0.58, "num_comments": 19, "comments": [{"body": "Can you do spreads at all?  A calendar spread would possibly be doable.  \n\nSomething like but the 330 December put and sell monthly 300 puts, then you're covered and the more times you can sell the 300 puts the less the 330 put costs you.\n\nTheoretically if IV spiked and crushed enough, and your timing was correct you could have your long put completely paid for by the premium your short puts brought in and make extra of in December spy closed at 300.01.", "score": 3, "replies": [{"body": "Thanks, also very interesting, although this seems very complex. I'll have to look at calendar spreads in detail.\n\nI can do spreads, but German taxes make it really bad: each leg of a options play are regarded separately from each other and loss-offsetting from options is capped at 20k€ per year, so if a theoretical BRK vertical spread with a max loss of 2k and max gain of 1k could literally mean capital gains taxes over a million, even if you make a net loss.", "score": 2, "replies": [{"body": "A calendar is just like a vertical spread except with 1 option farther out in time.\n\nIn this case it would be a debit spread buying the longer dated and selling the shorter dated options.  Definitely not something to get into if you don't understand it well.", "score": 2, "replies": []}]}, {"body": "Ok you have a better idea than my ratio idea 💡", "score": 1, "replies": [{"body": "I don't like ratios unless you have super strict risk management and understand when they're useful and have a good read on the market.\n\nDefinitely wouldn't recommend for the average retail trader.", "score": 3, "replies": []}]}]}, {"body": "Ignoring the problematic way that Germany taxes positions, consider a backspread.   \r  \n\r  \nA put backspread, also known as a reverse put ratio spread, is a bearish strategy that involves selling a number of put options and buying more put options of the same underlying stock and expiration date at a lower strike price.  \r  \n\r  \nIt has limited risk and the maximum loss occurs if the underlying is at the strike price of the long puts purchased at expiration.  \r  \n\r  \nIf the underlying tanks below the long put strike, you make more than you lose.\r  \n\r  \nPlay with various strike price combinations to see if the risk profile suits you. And spend some time figuring out now what you might do at a later date if the position works out.  Know your plan now, not later so you're not a deer in the headlights, paralyzed by indecision  ---> Risk management!", "score": 2, "replies": []}, {"body": "I expect we'll see SPT 450 soon enough. I'd think it too early.", "score": 2, "replies": []}, {"body": "You can do a ratio spread, like sell 2 puts at 3k or whatever your believed bottom number. Then buy one $3.6k put. This is just an example but the two puts sold finance the one put bought maybe making your trade for free. But you have to manage risk so if the market does this move very fast like overnight then your two sold puts can increase too quickly and give you a scare. Course you can always roll them down. Just giving you ideas", "score": 4, "replies": [{"body": "Based on an outlook of SPY at 250-300 by the end of the year, a ratio spread is a bad idea.", "score": 2, "replies": []}, {"body": "Interesting, I'll look into ratio spreads, thanks! So in a way it's one bear debit spread and one naked/cash secured put, but they both correlate to some extent. I'll have to run some scenarios through options profit calculator to understand this better.", "score": 1, "replies": [{"body": "A ratio spread is a bad idea.  \r  \n\r  \nFirst, you're a relative beginner and you don't know how to properly manage the position.  \r  \n\r  \nSecond, it's not going to accomplish what you want it to, namely, to capitalize on a SPY move down to 250-300 by the end of the year.  If that happens, the ratio spread will HURT you.", "score": 4, "replies": [{"body": "^ Only person who actually gave good advice to this beginner. We all know how beginner \"selling\" goes ... Gonna take this guys life savings. #STAYAWAYFROMSELLING until you feel you're an expert at the \"basics\". Then move into it WITH EXTREME CAUTION!", "score": 2, "replies": []}, {"body": "Well I mean not as long as it’s above that lower strike of 250 or whatever then you are green. The only risk is if it goes below the lower strike of 250 then yes you will lose money. Can always roll everything down. But yes it’s an active strategy and maybe not a beginner play", "score": 1, "replies": []}, {"body": "Not if you do put ratio backspreads.. (I mean you might still get hurt if IV crushes at this point), but directionally they’re spot on", "score": 1, "replies": []}]}, {"body": "Yes one put is naked or cash secured. You can do a 2:3 ratio like 2 bought and 3 sold. You can also do a 1:3 ratio of 1 bought and 3 sold. The idea is to finance the bought strike with the sold strike. When markets are down, IV is high, right? So if you are going to buy puts you also should simultaneously sell some lower strike puts because it makes you a less net buyer of IV than buying a put alone which can crush IV if the market just goes sideways or up", "score": 1, "replies": []}]}]}, {"body": "Can you do futures?   One /mes == 50 shares of SPY. Maybe you can create synthetics?", "score": 1, "replies": []}, {"body": "SPXU Calls", "score": 1, "replies": []}, {"body": "Run your ideas through OptionStrat or Options Profit Calculator.  I like to make small directional bets on SPY but I like to keep it simple.  Wait for premiums to be low (watch VIX) and just take a small position that has the possibility of being a 5x-10x but the probability of being a 0% (0% in rl, in options calculator they usually show \\~20% chance).  Whatever my target date is, I take a contract that is twice as long.  So far I just lose money doing this but one of these days I'll be getting a 1000% return . .of like $2000.\n\nSo I guess my strategy is \"don't buy puts with high IV\".", "score": 1, "replies": []}]}
{"title": "Will this week's inflation data give the market a chance to rebound?", "selftext": "While growing concerns that the Fed will need to hike rates by 75bps have caused losses to accelerate since last week’s FOMC Meeting, Wednesday’s CPI figures could actually be key in helping stocks stage a comeback. \n\nMarkets will be keeping a close eye on the data for signs of inflation possibly peaking. Current expectations are for a rate of 8.1%, which is still high, but significantly lower than last month’s record-high print.\n\nThis could see traders’ cool their speculation on the need for the US central bank increase the aggressiveness of their tightening cycle to rein in soaring prices, and potentially encourage dip buyers to step-in with the market trading at such a heavy discount. \n\nOf course, all trading carries risk, especially given the current geopolitical landscape and macroeconomic environment across globe. So, even if a pullback in inflation allows for equity markets rebound this week, it could be relatively short-lived as traders still have a variety of downside risks to navigate.", "id": "umesxf", "created_utc": 1652175359.0, "score": 9, "upvote_ratio": 0.73, "num_comments": 11, "comments": [{"body": "Velocity vs. Acceleration…. CPI = acceleration.\n\nPrices going up 8.1% vs. 8.5% still mean that prices are going up which cuts earnings and corporate net margins and increases cost of goods sold.\n\nIn other words, price is $100 right? Inflation 8.1% still means price goes up to $108.10? Right ?\n\nWatch the PPI on Thursday which is the rising input cost to manufacturers… that tells the truth about if business expenses are rising and will cut margins. Since about 90% of sp500 companies without a wide economic moat can’t raise prices. Even AAPL, people are going to hold onto their $1200 iPhones for a LOT longer with so many other rising costs", "score": 9, "replies": []}, {"body": "The rate has been modified twice in the last few months to make it display a smaller number.\n\nReality is still reality. A surprisingly low rate might induce a feeling of security and calm things down for few days, but shit's going down the drain anyways.", "score": 16, "replies": [{"body": "Can you explain", "score": 3, "replies": [{"body": "Go check the Fed's announcements records for specifics.\n\nIn short, they adjusted the formula to ignore entire sectors of the economy, and they're also ignoring the data from 2021 because it'd make the trend worse and they didn't like it.", "score": 9, "replies": []}]}]}, {"body": "its all going down the drain 8.1% is a weak lie", "score": 9, "replies": []}, {"body": "Yeah, you can assume their estimate is a low ball lie to try and unload as many bags as they can on people who don't know about better", "score": 2, "replies": []}, {"body": "Numbers are a lie but everyone knows this. We see it at the store and pump", "score": 2, "replies": []}, {"body": "No it wont. This is like 2008. You cant ignore reality. You can paint whatever inflation number you want and speculate this or that, but its done. The gears are turning and the motions cannot be undone. *real* inflation, labor shortages, unemployment, global crisis...", "score": 4, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "The forecast is 0.2%. Guess we'll know in a few hours", "score": 1, "replies": []}]}, {"body": "Nope", "score": 1, "replies": []}]}
{"title": "Companies close to/below book value?", "selftext": "I'm looking at the banks specifically.  WFC is at 1.01 and JPM is at 1.436.  I'm not a huge fundamentals guy so maybe someone can help me understand how a business that generates positive cash flow can be worth less in stock value than it's assets?  Especially banks.  Most of their assets are cash or assets that are easy to liquidate.   \n\nAlthough I think JPM is the better play, WFC is tempting to take a sizable position.  I'll definitely wait till we see some stability in the overall market though.  Rather be late than wrong.   Not trying to bottom tick.", "id": "umnjms", "created_utc": 1652202450.0, "score": 2, "upvote_ratio": 0.75, "num_comments": 10, "comments": [{"body": "If you don’t understand this I don’t think you should be investing in banks.\n\nBook value is assets - liabilities. Banks carry deposits and loans on their balance sheets as liabilities and assets respectively, aswell as many other things. However, these aren’t an ‘asset’ and a ‘liability’ in the same way they are for other companies. Notice how a deposit (money put in the bank) is actually a liability to a bank when you’d maybe expect it to be an asset. This is because it owes the deposit back to the depositor whenever the he wants to withdraw his money. Maybe you should also read up on how banks create money and the money multiplier. Personally I don’t invest in banks because they’re so fucking complicated and I don’t know how to work out what bank is doing well or not.", "score": 6, "replies": [{"body": "Second this. \n\nAnd you know what, for most banks if only 10-15% of the total outstanding loan went bust during recession bank stocks could literally wipe 80%-90% of market cap.\n\nIt's totally a differrent beast.", "score": 3, "replies": []}]}, {"body": "those big banks have balance sheets based on assumptions so you cant take them at face value imo. The mega banks are especially hard to analyze and often the company doesn't even know what it has and its risk profile. If you are keen on banks I'd start with a quality regional  like CFR", "score": 6, "replies": [{"body": "Half of their important stuff is off balance sheet or at least in the foot notes anyways", "score": 1, "replies": []}]}, {"body": "I’d avoid looking at financials and comparing book value ratios. It becomes a big question on whether they are valuing their assets properly or not since those values fluctuate a lot.", "score": 1, "replies": []}, {"body": "C….. *cries*", "score": 1, "replies": []}, {"body": "OPRA and AI have solid cash/book value compared to market cap.", "score": 1, "replies": []}, {"body": "Nano dimension N N D M", "score": 1, "replies": []}, {"body": "I was thinking the same as you - JPM looks a great buy - but now these people commenting are scaring me off …", "score": 1, "replies": []}, {"body": "XPEV (not a bank) is well below book value.", "score": 1, "replies": []}]}
{"title": "What’s the deal with Boeing?", "selftext": "Surely this thing must be oversold by now.\n\nBoeing will continue to be a leader in global aviation. Thankfully, they’ve managed to sort out the issues with their MAX jets, which will become a big driver of profit for them in the future.\n\nThe price looks set to make a nice comeback in the next 1-2 years.\n\nSo is there something I’m missing here? Or is the current stock price just a lot of speculation? It has been on a downward trajectory for over a year now, so the recent market sell-off hasn’t triggered the decline.\n\nAny thoughts?", "id": "umnz18", "created_utc": 1652203642.0, "score": 4, "upvote_ratio": 0.67, "num_comments": 18, "comments": [{"body": "787 won’t come back at previous volumes, 737 max will still struggle against a320. No forward progress on  a 737 replacement and moving to Virginia to pander to Washington instead of focusing on fixes.", "score": 14, "replies": []}, {"body": "Boeing is a horribly indebted company and if it was not politically so incredibly important for the national defense and the American ability to have their US made large airliners I wouldn't be sure if it would still exist in the very long term.", "score": 11, "replies": [{"body": "The current legal entity still might not exist. Boeing, Lockheed, Northrup, etc will never cease to *operate*.  But much like with GM, the shareholders will get wiped out and everything will get restructured.", "score": 5, "replies": [{"body": "Yes and that's why I wouldn't buy Boeing", "score": 1, "replies": []}]}]}, {"body": "This is a bankrupt company if the Fed were to actually do what some want them to do.\n\nNow, that's unlikely, but I figured that I'd mention that.", "score": 9, "replies": []}, {"body": "Aerospace suppliers are not working at full capacities presently (I got a birdie in the ductwork that gives me info), which means plane makers are not ordering parts (that being Boeing). Less orders for parts = less new airplanes = less sales = less profit for Boeing and the rest.\n\nAlso, didn't one of them 747s go down over the mountains a month ago in China?\n\nAlso, wern't airlines selling their planes during Covid, to make money to survive? Did they start buying them back or making new orders? Or are they still waiting?", "score": 4, "replies": [{"body": "As an Aerospace buyer, it depends on what you buy. My particular commodity is all kinds of messed up thanks to some administrative compliance issues at a major player.", "score": 1, "replies": []}]}, {"body": "Of course , they are a leader - the industry is essentially a duopoly. I am very doubtful they will return to their highs.\n\n  \nRemember their largest customer is China, and they have been developing their own planes via their state-owned [COMAC](http://english.comac.cc/). Here is an [interesting article](https://www.dw.com/en/airbus-and-boeing-face-new-competition-from-china-and-russia/a-60406728).\n\n  \nI am actually waiting to see China cancel orders as this will truly be the first sign for a major recession for me as too many industries / suppliers feed Boeing in NA. When this happens, the US government will bail them out.", "score": 3, "replies": []}, {"body": "I’ve been accumulating steadily buying in at 210, 190, 150, and 130. Will it ever hit 400 again? Probably not, but once their 777X issues get sorted there’s a solid chance they post numbers similar to their 260+ price targets. I’m fine with a potential 100% return in 3-4 years.\n\nRemember they’re a duopoly.", "score": 3, "replies": []}, {"body": "They are second in a two-person race.", "score": 2, "replies": [{"body": "Good point. Airbus just became bigger last week.  I live in Seattle so I have a lot of family members, like my father, and friends that work or worked there that made a lot of money but didn't work hard. My cousin that was a screw up that dropped out of high school made over $180k painting planes the last time I helped him with his taxes. That just isn't sustainable.", "score": 2, "replies": [{"body": "I bought the dip at 110 on BA, but I'm wondering if it's going to drop past that again. I keep think it's gotta improve but man. It's been a brutal ride.", "score": 1, "replies": []}]}]}, {"body": "The Netflix documentary happened.\n\nI'm sure Airbus fronted the producers of that documentary some money.", "score": 2, "replies": []}, {"body": "Boeing at this point shouldn’t even exist as a company, it might as well just be part of the federal govt like nasa", "score": 2, "replies": []}, {"body": "Look at the revenue vs income and long term debt.", "score": 1, "replies": []}, {"body": "This is a company where you think things can’t possibly get worse and things get worse. So glad Ive never bought this stock.", "score": 1, "replies": []}, {"body": "I just   see more  downward pressure - https://www.bloomberg.com/news/articles/2022-07-01/china-southern-inks-12-2-billion-deal-with-airbus-for-96-jets?srnd=markets-vp", "score": 1, "replies": []}]}
{"title": "Tesla significantly increases its battery recycling capacity, but only a few owner battery packs are coming back - Electrek", "selftext": "", "id": "um5qbf", "created_utc": 1652142861.0, "score": 22, "upvote_ratio": 0.85, "num_comments": 11, "comments": [{"body": "There'll be a ten year lead on these. 🤷‍♂️", "score": 6, "replies": [{"body": "Yeah, it’ll be a min lol", "score": 2, "replies": []}, {"body": "over the course of this decade iirc its 15MT of lithium battery set to expire (globally from benchmark minerals)", "score": 1, "replies": []}]}, {"body": "For now", "score": 3, "replies": []}, {"body": "How about electronics battery? What about iPhone 😂", "score": 2, "replies": [{"body": "Redwood collects them, actually producing something from all those phones but not enough.", "score": 2, "replies": [{"body": "I have a stockpile of junk with battery in them. If there is an effective way to get our battery to them with no cost to us, there will be endless recycling work for them from 🇺🇸 alone.", "score": 2, "replies": [{"body": "Oh yea ppl send boxes of stuff to redwood all the time, idk if i posted the JB video in this group but they collect it all.", "score": 2, "replies": [{"body": "Nice", "score": 2, "replies": []}]}, {"body": "It’s a good idea. But I’m not sure postal services would enjoy lots of packages with [Spicy Pillows](https://www.reddit.com/r/spicypillows/) in them.", "score": 2, "replies": []}]}]}]}, {"body": "Offer a discount on a home wall pack when you turn in an old car pack.", "score": 1, "replies": []}]}
{"title": "Tesla Shanghai Sold 1,512 Cars in April, down 98% MoM, Exported 0. Production 10,757 Vehicles, Despite the Pandemic", "selftext": "", "id": "umfq26", "created_utc": 1652179112.0, "score": 49, "upvote_ratio": 0.88, "num_comments": 14, "comments": [{"body": "Has this been validate by other source yet?", "score": 6, "replies": [{"body": "It's from CPCA, Chinese government agency.", "score": 13, "replies": []}]}, {"body": "Bad news, so I guess green today, right?", "score": 15, "replies": [{"body": "Stock was down a lot yesterday. Today is a correction", "score": 3, "replies": []}]}, {"body": "It’s a good restart of the factory. Looking forwards to this month!", "score": 6, "replies": []}, {"body": "Small blip", "score": 3, "replies": [{"body": "Lol", "score": 1, "replies": []}]}, {"body": "Rough if confirmed , any word on the rest of the factories ?", "score": 5, "replies": [{"body": "I guess everyone is struggling in China. It's not just factories shutdowns, but also the supply chain issues.", "score": 11, "replies": [{"body": "Who would of thought a super strict lockdown would screw the economy lol", "score": 6, "replies": []}]}, {"body": "Wouldn't call it rough. This was very much expected.", "score": 3, "replies": [{"body": "Expected or not still rough on the company and annoying 😂", "score": 1, "replies": []}]}]}, {"body": "This is expected fuckedup news. Still hurt. While. Let’s look at others number as bad or worse to be positive.", "score": 2, "replies": []}, {"body": "Lol epic", "score": 1, "replies": []}]}
{"title": "Israel to Approve Driverless Parking, Unlocking Tesla's Smart Summon", "selftext": "", "id": "umq2zw", "created_utc": 1652209443.0, "score": 108, "upvote_ratio": 0.95, "num_comments": 16, "comments": [{"body": "Unlocking it to crash into stationary objects? I was so excited for smart summon; I watched the progress of the beta before it went to wide release; read all of Musk's tweets regarding it, etc. Then I used it... yikes.", "score": 9, "replies": [{"body": "Need to wait FSD version 11.0 to have new progress on this subject", "score": 8, "replies": [{"body": "You think? As far as I know none of the FSD betas yet have touched or changed the smart summon code. Has Musk said if single stack includes smart summon?", "score": 2, "replies": [{"body": "Yes single stack will be for smart summon as well", "score": 7, "replies": [{"body": "Just more promises that will take forever and way underperform what was advertised.", "score": 0, "replies": []}, {"body": "Nice. Now I just need Tesla to upgrade my cameras and to get into the beta program.", "score": 1, "replies": [{"body": "Source from Elon : https://twitter.com/elonmusk/status/1416511905515048966?s=21&t=pQ3iAgIcwdrJasbqHFxwuQ", "score": 5, "replies": []}, {"body": "Desire is a main form of suffering.", "score": 2, "replies": []}]}]}, {"body": "Yes, always wait…. After V11 you can wait for V12, etc.  just like the hardware.  V3 chips were supposed to fix FSD.  Its not fixed yet.  Still dont have what I paid for 5 years ago", "score": 1, "replies": []}, {"body": "I believe he has but i don't know where to get the source.", "score": 1, "replies": [{"body": "https://twitter.com/elonmusk/status/1416511905515048966?s=21&t=pQ3iAgIcwdrJasbqHFxwuQ", "score": 3, "replies": [{"body": "Thanks!", "score": 2, "replies": []}]}]}]}, {"body": "One of the shitty things about this long beta process. Incremental progress has halted.", "score": 0, "replies": []}]}, {"body": "Yeah. \n\njust wait till some children get run over in a parking lot.", "score": 1, "replies": []}]}, {"body": "Uh oh", "score": 1, "replies": []}, {"body": "🇵🇸", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "umklbs", "created_utc": 1652194533.0, "score": 4, "upvote_ratio": 0.75, "num_comments": 11, "comments": [{"body": "In the end, you will lose money.\n\nOr at best you won't make enough for the risk.\n\nNothing is free, everything is priced in and if it were as easy as \"fade mean reverting products\" we would all be on our yachts right now", "score": 2, "replies": [{"body": "Youre not on your yacht?", "score": 1, "replies": []}]}, {"body": "Um VIX probably going way up short term while SP is on its way to 3800-", "score": 2, "replies": []}, {"body": "Never sell naked in the VIX.  If  you want to do this, sell a call spread.  And that's probably a winning trade.", "score": 2, "replies": [{"body": "Yee setup some call spreads for vix that expire next week. Let's hope", "score": 1, "replies": []}, {"body": "I am starting to wonder why not? Theoretically it is unlimited risk. But SPY cannot fall to negative infinity, so there is an upper boundary for VIX. Also it cannot stay above 100 for forever. To me it seems that you could sell naked and if it is running against you just roll it for a small debit. But I have to do more research.", "score": 1, "replies": [{"body": ">But I have to do more research.", "score": 1, "replies": []}]}]}, {"body": "Guys, I really don't understand the comments here. He is right. I do this and other do it, too. It works. It works only in the VIX. Go figure it out yourself. Every time I talk about this I get a bunch of \"Haha, you'll be losing your shirt\" kinda comments. Is this some conspiracy? I know the industry wants you to lose and steers you into risky trades on SPY or meme stocks. But I've had enough. Next week my next batch of VIX calls will expire worthless and I'm happy to watch my account balance.\n\nEdit: end of week rally - VIX went down and I closed the very next day. Thank you, VIX!", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Actually there is. Yes, you could buy calls and your upside is unlimited. But if you don't like the idea of losing theta along the way you could either buy calls deep in the money a few months out thus retaining value. This usually requires less margin. OR... you sell an in the money put. Say VIX is 18 you sell 22. Next time it spikes you close. You can set a stop order to automate. I have done this. It's not my preferred trade anymore because I had to roll it once but definitely possible. If you sell OTM calls and/or ITM puts the margin requirements are substantial because you got limited upside but a huge downside risk. So you better have a large account.", "score": 1, "replies": []}]}]}, {"body": "Short VIX futures", "score": 1, "replies": [{"body": "I thought VIX futures cannot be traded directly. Isn't it actually called VX future and the VIX index and its options are based on various VX futures?", "score": 1, "replies": []}]}]}
{"title": "Say shit to this market, but does TSLA really deserve more than half of the automotive industry? Probably even put at this point, (P/E is 97).", "selftext": "", "id": "um7wbl", "created_utc": 1652149364.0, "score": 8, "upvote_ratio": 0.83, "num_comments": 18, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|15|**First Seen In WSB**|3 weeks ago\n**Total Comments**|22|**Previous DD**|\n**Account Age**|7 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=um7wbl)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=um7wbl)", "score": 1, "replies": []}, {"body": "Musk jacks it to the thoughts of all the short sellers he’s fucked over. \n\nBut someone someday is gonna make a fortune shorting tsla", "score": 2, "replies": [{"body": "I’m sure Elon has done some incredibly sketchy shit to fuck over Tesla shorts. Shit that he’ll probably end up in jail for.", "score": 2, "replies": [{"body": "Like?", "score": 1, "replies": []}]}]}, {"body": "Tesla doesn’t even deserve 10% of the automotive industry. The entire company is a fucking joke. Their sales are dismal", "score": 1, "replies": [{"body": "While everyone else start their EV manufacturing, that’s when TSLA gets fucked", "score": 1, "replies": [{"body": "i read somewhere that tesla had a huge advantage when starting up because they bought so much manufacturing equipment at deep discount when they were coming up from the big auto companies that were failing in the late 2000's. not sure how true it is but there are definitely barriers to entry and tesla is already established", "score": 1, "replies": [{"body": "I think we’re about to see a lot more used automotive manufacturing equipment enter the market place….. if you catch my drift. Everything comes back around", "score": 1, "replies": []}]}, {"body": "Unless this is a patent holdout FTW.  Wait for everyone to ride the line of patent review. Wait for production of competitor models to start selling well… and start pwning all similar technology patents for every penny.", "score": 1, "replies": []}]}]}, {"body": "Somewhere Bill Gates is laughing while clutching his man boobs.", "score": 1, "replies": [{"body": "Bill Gates lost a bundle today too. Those puts didn’t offset the massive hemorrhaging.", "score": 1, "replies": [{"body": "The man boobs are a moat.", "score": 1, "replies": [{"body": "MOAB = mother of all boobs", "score": 2, "replies": [{"body": "Gahahaha", "score": 1, "replies": []}]}]}]}]}, {"body": "Yes. Its an automotive, ai, solar power (not just houses), battery manufacturing company(not just houses or cars) with its own electric charging station network already set up..... oh they also own their own software for Tesla's too iirc....\n\n\nderp. I got jebaited in my tiredness.\n\n\nKmn.", "score": 1, "replies": [{"body": "Wanted to buy at 800 but stopped myself doing so", "score": 1, "replies": []}]}, {"body": "The price is that high because of anticipation ... not anticipation of the value of their products & profit margins; anticipation of a merger with Apple.\n\n(I say apple because they already have the same ethics when it comes to right to repair and customer service. Plus Musk has got the same perfect resume to fully replace Steve Jobs: manipulative workaholic, neglectful of his family, and  belligerent towards labor laws.)", "score": 1, "replies": []}, {"body": "I am a bot. This Meme does not look like it has generated enough approval to stay on /r/wallstreetbets.                                            We algorithmically cull certain submission flairs whose response is not above a certain threshold to try and keep the page clean.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "umjer5", "created_utc": 1652191279.0, "score": 26, "upvote_ratio": 0.96, "num_comments": 14, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|21|**First Seen In WSB**|10 months ago\n**Total Comments**|25|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=umjer5)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=umjer5)", "score": 1, "replies": []}, {"body": "Rip money", "score": 18, "replies": [{"body": "Yeah this could be an L, but i know that if i get out it’s going up 40$ tmro so I’m holding", "score": 8, "replies": [{"body": "Hold your balls. They must be falling at this point.\nGood luck!", "score": 1, "replies": []}]}]}, {"body": "This is basically playing Russian Roulette with four rounds in a six round cylinder.", "score": 10, "replies": [{"body": "More like fully loaded. OP better hope the gun jams", "score": 4, "replies": []}]}, {"body": "No wayyy haha this beauty has been sliding down to fair value the past six months. NVDA will see $130 post-earnings if they do not absolutely blow expectations out of the water.\n\nYou should probably exit on a rally in the next 24-48 hrs.", "score": 4, "replies": []}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": [{"body": "Feels like we’ll get a fomo rally, and these seemed like good value for what NVDA has done in the past off lows", "score": 6, "replies": []}]}, {"body": "You belong here my dear tard.", "score": 2, "replies": []}, {"body": "!RemindMe 1 week", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}, {"body": "Good luck", "score": 1, "replies": []}, {"body": "I’m going to inverse you just so you can win. You’re welcome.", "score": 1, "replies": []}]}
{"title": "Morning profits +$14k. AMZN $2300 C 5/13 and AMZN C 5/20", "selftext": "", "id": "umkohz", "created_utc": 1652194767.0, "score": 68, "upvote_ratio": 0.86, "num_comments": 14, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|29|**First Seen In WSB**|1 year ago\n**Total Comments**|66|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=umkohz)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=umkohz)", "score": 1, "replies": []}, {"body": "Regarding the first buy: crazy how a 1% bump can produce a 16% profit, especially after it had just dropped another 1% after you bought.\n\nWhat prompted you to buy in the first place?", "score": 9, "replies": []}, {"body": "Congrats.", "score": 2, "replies": []}, {"body": "What trading platform is this?", "score": 1, "replies": [{"body": "Looks like Robinhood", "score": 1, "replies": []}]}, {"body": "How does it look now?", "score": -2, "replies": [{"body": "Doesn't matter he closed", "score": 10, "replies": []}, {"body": "Ask the sub that bought them from him", "score": 12, "replies": []}, {"body": "Looking great! Position was closed at the peak. Check the screenshots!", "score": 10, "replies": [{"body": "Oh, oops, congrats!", "score": 0, "replies": []}]}]}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|29|**First Seen In WSB**|1 year ago\n**Total Comments**|66|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=umkohz)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=umkohz)", "score": 1, "replies": []}, {"body": "this is retarded. you got very lucky", "score": 1, "replies": []}]}
{"title": "In the battle for the chip field, AMD completed the acquisition of Xilinx. Does this mean the formation of the three major companies in the US chip market in the future?", "selftext": "[removed]", "id": "ummu0i", "created_utc": 1652200531.0, "score": 31, "upvote_ratio": 0.97, "num_comments": 17, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|1 month ago\n**Total Comments**|11|**Previous DD**|\n**Account Age**|2 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=ummu0i)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=ummu0i)", "score": 1, "replies": []}, {"body": "Well, I have throbbing losses in all three.", "score": 10, "replies": [{"body": "unless you can think of smth that can replace computer chips in the near future, I think your portfolio is g2g bro", "score": 4, "replies": []}]}, {"body": ">AMD CEO Su Zifeng\n\nwhat the fuck are you talking about. Even her Official signature is Lisa Su", "score": 6, "replies": []}, {"body": "TSMC is the biggest fish in the pond and is still being hammered… this market crash stopped watching fundamentals and went back to sell everything and hope retail will also so we can buy back with their tax money once the bailouts come.", "score": 2, "replies": []}, {"body": "AMD numbers showed that both the acquisition and something else seriously drove their costs up. They need to be aggressively lean and mean internally to control that in this market or the street will hammer them for it. Street wants efficient companies selling things that they can raise prices on and the consumer will still have to buy it. \n\nI’m wary about AMD but love the products. But they need to get back to lower costs (or pass them along) by next earnings release.", "score": 0, "replies": [{"body": "They have lower cost in server still, which is where most of the revenue is expected to come. I think in the entertainment segment, it's better to have the best product and get great margins than it is to be known as the cheap alternative, which they are doing.", "score": 2, "replies": [{"body": "Yeah. The question is, why are their published internal costs rising so rapidly?", "score": 1, "replies": []}]}]}, {"body": "Hey, do you have a source? Please add a link in the post or as a reply to this comment!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "No Qualcomm? Largest supplier of Android CPUs?", "score": 1, "replies": []}, {"body": "Aside from prototyping, what are the real world use cases of programmable chips?\n\nI totally get why it's useful for prototyping. I can see it potentially being used for things like codecs, and encryption where they change moderately rapidly and efficiency wins over GHz.\n\nI'm not so clear on the rest of the use cases. How does 5g use it, and why is adaptability required instead of standard baked in silicon?", "score": 1, "replies": [{"body": "I see one advantage: security patches.  How long was the Spectre exploit around?  Spectre affected all modern day processors going as far back as 1995 that used \"speculative execution\".  Problem was it couldn't be mitigated without serious performance hits back in 2018.  Properly leveraging programmable chips to apply to only portions of the hardware that would best benefit from updates could do wonders for security, while maintaining speed we're accustom to with traditional hardcoded hardware.  \n\n\nSo... was Spectre ever properly patched?", "score": 1, "replies": [{"body": "Nope. In fact it still effects newly released processors.\n\nEdit: Going back and refreshing the details on spectre too, I don't think it will ever be patched. You can't really truly patch it without botching CPU design. Any solution I could think of to fix it would slow execution speed.", "score": 1, "replies": [{"body": "Must be a feature then.", "score": 1, "replies": []}]}]}, {"body": "Theoretically a FPGA design should be more efficient than a CPU for some arbitrary given task. Imagine you use a FPGA as an accelerator for a task (we already do this with fixed hardware. Your CPU most likely has silicon on it to do things like video decode) and as the devs fine tune the algorithm, you get a hardware patch that gives you a double perf boost. \n\nAdaptability would ALWAYS be preferential if that was always an option. For example, if I go and try to write some efficient code now, I'm always going to have to contend with 64 bit cache read. If I want special fast access silicon paths, I have to look at the fixed hardware for what I got (for example a FPU) and if I run into a complicated problem (like mining) I literally just have to get different hardware or be left in the dust in terms of perf. \n\nTo put it another way, would you rather have a computer designed to run a single task as well as possible if all you want to do at some time is a single task, or a computer designed to do many task ok when all you want to do is a single task? Now pretty much every-time you do something, you do a single task. What if you could just swap out those specialized computers for free for all these random single task. That being commonplace might be better than \"AI accelerators\"", "score": 1, "replies": []}]}, {"body": "+5 May 27 (17d) 90 C", "score": 1, "replies": []}]}
{"title": "TeSLa gOiNg tO 500", "selftext": "", "id": "umo9kf", "created_utc": 1652204454.0, "score": 36, "upvote_ratio": 0.89, "num_comments": 19, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|175|**First Seen In WSB**|3 years ago\n**Total Comments**|3400|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/kidiv0/aapl_ev_is_good_for_tesla/) [x](https://www.reddit.com/r/wallstreetbets/comments/kn6iy2/its_a_boomer_play_but_its_guaranteed_money_ge/) [x](https://www.reddit.com/r/wallstreetbets/comments/kst6uo/its_a_boomer_play_but_its_absolutely_guaranteed/) [x](https://i.redd.it/hsaw0898xpn61.jpg) [x](https://www.reddit.com/r/wallstreetbets/comments/lj98g6/tsla_is_the_only_ev_company_outside_of_china/) [x](https://www.reddit.com/r/wallstreetbets/comments/fbw8tl/lil_yachty_dropped_a_new_album_first_track_is/) [x](https://www.reddit.com/r/wallstreetbets/comments/eeon3u/dd_invest_in_norway_norw/) \n**Account Age**|9 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=umo9kf)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=umo9kf)", "score": 1, "replies": []}, {"body": "This will not age well. I'll buy some 500p in your honor.", "score": 12, "replies": [{"body": "Risky", "score": 2, "replies": [{"body": "Sir, this is a casino.", "score": 3, "replies": [{"body": "How did I get here? I do all my gambling at Wendy's,  whats a casino do then?", "score": 1, "replies": []}]}]}, {"body": "What’s your time frame? Don’t be a pussy ; 0DTE", "score": 2, "replies": [{"body": "5/20 500p\n\nFidelity wont let me do 0DTE :(", "score": 3, "replies": []}, {"body": "Up 100% thanks for the free money!", "score": 2, "replies": [{"body": "Haha nice play! Whole market on its period again , damn", "score": 1, "replies": []}]}]}]}, {"body": "Hahah", "score": 5, "replies": []}, {"body": "I don’t think this will age well", "score": 9, "replies": [{"body": "Likewise", "score": 3, "replies": []}]}, {"body": "Commenting for later when this doesn't age well", "score": 3, "replies": []}, {"body": "It will tho", "score": 1, "replies": []}, {"body": "It will tho", "score": 1, "replies": []}, {"body": "Please sweet little tuxedo t-shirt Jesus let CPI come in low tomorrow morning! 🙏", "score": 1, "replies": []}, {"body": "Thanks for the free money bro.", "score": 1, "replies": [{"body": "It’s the Bears turn the hold the money", "score": 1, "replies": [{"body": "I mean.. I'm a bear during bear season and bull during bull season. I just like money.", "score": 1, "replies": []}]}]}]}
{"title": "Russian Oligarchs Selling Contributing to Bear Market?", "selftext": "Are Russian oligarchs needing to sell stock or other assets and if so is their selling contributing to the bear market?  Is there any way to know whether selling by a group of billionaires is forcing share prices lower?  I can appreciate inflation and interest rate worries impacting the market but the recent losses of 3 to 4% a day seem excessive.\n\nThanks for your thoughts on this.", "id": "umpdn4", "created_utc": 1652207500.0, "score": 8, "upvote_ratio": 0.7, "num_comments": 17, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|1 year ago\n**Total Comments**|3|**Previous DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=umpdn4)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=umpdn4)", "score": 1, "replies": []}, {"body": "3% - 4% daily gains seem normal but losses is abnormal?", "score": 12, "replies": [{"body": "Yes, it is normal for investments to have profit and loss. Everyone can predict this crisis, but many are reluctant to believe it.", "score": 2, "replies": []}, {"body": "Yes, these losses are abnormal as they are rare. If they were normal, then people wouldn't invest in the stock market.", "score": 1, "replies": []}]}, {"body": "The record sell off by ALL insiders started clear back on December, retards. They sold long ago. You and most normal people’s retirement accounts were left holding the bag. \n\nThey go on TV and talk about how good their company is doing and then they are NOT buying shares of their own companies… hmmm. \n\n https://www.cnbc.com/2021/12/01/ceos-and-insiders-sell-a-record-69-billion-of-their-stock.html", "score": 6, "replies": [{"body": "Always has been.", "score": 3, "replies": []}]}, {"body": "Im sure they did sell off, or at least re-positioned.  It was clear in Jan from the options for March that something would be negative across the market. I was shopping and March/April strikes were same or cheaper than feb in the things I was looking at. I don’t think they thought it would take more than 2 weeks, you could see the options recovery for May/June and extend like normal for 2 years. I wanted to buy March but the cheap price spooked me so I went out to the fall. I should have heeded the warning, oh well", "score": 4, "replies": [{"body": "That price anomaly sure would have been curious. Good catch!", "score": 2, "replies": []}]}, {"body": "https://markets.businessinsider.com/news/stocks/stock-market-outlook-retail-buying-hedge-funds-sell-gains-ahead-2022-3\n\nWho’s buying and who’s selling.", "score": 2, "replies": []}, {"body": "This is the MSNBC analysis. The same channel that said to buy all these shit tickers. Stocks going down because money was printed, profits slowed, supply chain broke. Russia’s a component of supply chain.", "score": 2, "replies": []}, {"body": "In Russia, stock sells you!", "score": 2, "replies": []}, {"body": "Lol. It’s the Federal reserve deleveraging their balance sheet. They have about $9 Trillion dollars worth of shit assets and they want to unload. A $500 Billion dollar dump would halt the markets and stop trading for the day. When you sell assets in the billions, it takes time to distribute them. I believe Robinhood can only sell 200 shares per day for retail investors. I don’t know how other brokerages do it. There is a way to dump all your shares at once, I think it’s the option “FoK”, Fill or Kill. But I wouldn’t personally do this because the broker will buy your shares at the price they want, not the price you think you’re selling.\n\nBarchart showed the big boys and well known names, that they sold in November 2021. That was the top of the bull market, even though December and January were all time highs, that was not the top. \n\nYou can buy the dip if you think it’s worth it for you. But the idea of dollar cost averaging was invented by Wallstreet after the Dotcom bubble burst, to keep cash flow incoming, that is their kool aid they cooked up. They want to sheep to believe that by dollar cost averaging you can make 30% returns, which is true. However, they don’t want people to know you can achieve 100-200% returns by timing the markets. Lump sum investment, it has existed since Kublai Khan invented the first paper cash to be backed by gold.\n\nAnyway, as long as the Fed is unloading their balance sheet, the buyers will be met by sellers. When they stop unloading, that’s when it is safe to buy. \n\nDon’t fight the Fed.", "score": 0, "replies": [{"body": "I think the securities they are unloading are mortgage backed securities.\nHousing and other properties. \nThey bought a lot of them during covid on the cheap and now are selling them back for profit I think.\n\nI don't even know if the fed can hold shares as property?", "score": 2, "replies": []}]}, {"body": "Are people really this stupid or is the OP trolling?", "score": 0, "replies": []}, {"body": "biden told today all cause bad ruskie, ofc they can down marked with all money locked, they dont have access atm to the any property inside usa", "score": -2, "replies": []}, {"body": "What for? For them useless dollars?\nThey had their shot already when the \"special operation\" started.", "score": 1, "replies": []}]}
{"title": "AMD gamma squeeeze possible here. Over $100 it can start to take out $10 increments at a time!", "selftext": "[deleted]", "id": "umplff", "created_utc": 1652208096.0, "score": 0, "upvote_ratio": 0.44, "num_comments": 17, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|90|**First Seen In WSB**|11 months ago\n**Total Comments**|47|**Previous DD**|\n**Account Age**|11 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=umplff)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=umplff)", "score": 1, "replies": []}, {"body": "Is everything a squeeze after it tanks nowadays?!?!", "score": 15, "replies": [{"body": "Only on WSB been that way for a while now.", "score": 5, "replies": []}]}, {"body": "Clown", "score": 13, "replies": []}, {"body": "Short interest at 1.70% says no.", "score": 10, "replies": [{"body": "XD", "score": 2, "replies": []}, {"body": "Haha!! 🤣", "score": 2, "replies": []}]}, {"body": "The cult is over there", "score": 5, "replies": [{"body": "This☝️", "score": 4, "replies": []}]}, {"body": "Do I go all in or not? Im down to my last $5 and feeling lucky.", "score": 2, "replies": [{"body": "buy a lotto ticket with that and wipe ur ass with the losing ticket", "score": 1, "replies": []}]}, {"body": "I for the most part stay a way from WSB , watch the news, business news, do my own research. Pick company's that the public likes", "score": 2, "replies": [{"body": "WSB IS THE PUBLIC , no other news needed", "score": 0, "replies": [{"body": "I know it's public, it's all the people pushing shares up to save themselves then bailing out leaving others holding a empty bag", "score": 2, "replies": []}]}]}, {"body": "I go and take a shit. By the time I’m back SPY has had a .5% move. Fucking wild these markets are.", "score": 0, "replies": []}, {"body": "Max pain for GME this week is $115", "score": 0, "replies": []}, {"body": "Stay away from tech stocks.", "score": 0, "replies": []}]}
