{"title": "Sell or Buy $TSLA?", "selftext": "Since Model 3 has been unveiled what do you think of TSLA stock?", "id": "4ctve6", "created_utc": 1459484147.0, "score": 14, "upvote_ratio": 0.7, "num_comments": 82, "comments": [{"body": " The 500k goal by 2020 was thought to be a pipe dream. now we know its not and their valuation and multiple will only go up....imo", "score": 13, "replies": []}, {"body": "Buy the car and the stock", "score": 46, "replies": [{"body": "No bias here lol", "score": 30, "replies": []}, {"body": "Definitely buying the car. Lot to prove to me on the stock. ", "score": 2, "replies": []}]}, {"body": "crazy that people are buying at this level. Be careful.", "score": 5, "replies": []}, {"body": "Buy and hold it for decades.", "score": 5, "replies": [{"body": "This does depend on your trading style. The other way is to buy it when its low sell it when the rate of increase slows down. In 6 weeks the price has moved from around $144 to $240 if you got the timing of buying and selling right that would be a massive profit. ", "score": 2, "replies": []}]}, {"body": "I got TSLA jumping 5 points tomorrow", "score": 7, "replies": []}, {"body": "I bought yesterday, was surpised at the drop off toward the end of the day.", "score": 5, "replies": [{"body": "I bought it around 20 days back. its still hovering around same price range. Going long though.", "score": 2, "replies": []}, {"body": "People were REALLY skeptical ", "score": 2, "replies": []}]}, {"body": "Overvalued. Still struggling to make money even though they have huge pre order numbers. Having huge quality issues with Model X and S still.\nThey've posted 4 quarters of increasingly high loss, some due to expansion but still it's bad.\n\n\nI wouldn't buy imo.", "score": 14, "replies": [{"body": "They are struggling to make a profit because they are putting so much to expanding (Gigafacorry is not even close to being done, the supercharger network needs to expand, they could be argued as the most inovative company in the world right now - innovation takes money)\n\nEdit: they are investing in themselves. The Gigafacorry is what makes the model 3 possible. The model s had quality issues at the start hut they are fixed - and customers have a great warranty ", "score": 14, "replies": [{"body": "Didn't Elon say at the presentation that the gigafactory is operational now?", "score": 2, "replies": [{"body": "Operational, but only like 1/7th the size it will be. They're also not yet manufacturing battery cells, they still get them from Panasonic ", "score": 3, "replies": []}]}, {"body": "Model s quality hasn't been fixed yet. Sunroof still creak and leak, trim panels are still misfit, motor mounts...etc.  Issues  have been band aided at best (literally applying epoxy and tape in some cases).  Go look at a new production S and if you look there are serious flaws. Warranty is nothing but cost on their end.\n\nI understand they're investing in themselves and expanding, but I know they are having internal struggles that were reported on TMC. My investing philosophy makes it a no-go for me on several different levels. I love the product, execution is poor. I used to have a Model S and I wouldn't touch another Tesla product with a 10ft pole at the moment.\n\nMy opinion is to not buy because they don't make any money and are floating on hype and dreams right now. They might make it and I hope they do but I'm staying out.\n", "score": 0, "replies": [{"body": "> motor mounts\n\nerm...\n\n", "score": -6, "replies": [{"body": "Well motors don't just float... so yea, motor mounts. \n", "score": 3, "replies": []}]}]}]}, {"body": "Quality issues? My parents own one. I've driven in it, and driven it myself. Trust me, the quality is absolutely there.\n\nhttp://www.cnet.com/news/tesla-model-s-wins-best-overall-car-by-consumer-reports/", "score": 2, "replies": [{"body": "I owned one for a year and a half and it took 2 trips monthly to the service center for various issues. I drove a loaner vehicle more often than my own.\n\nBTW Consumer reports revised their reliability rating to a mere \"Average\" after their car had issues:\n\nhttp://www.consumerreports.org/cro/news/2014/08/consumer-reports-tesla-model-s-has-more-than-its-share-of-problems/index.htm\n\nhttp://www.consumerreports.org/cars/tesla-reliability-doesnt-match-its-high-performance/\n\nGranted it is covered under warranty, but my a car of that caliber should not have those issues, regardless if it is free or not.", "score": 1, "replies": [{"body": "The Germans say Hi, cars in that price range are not immune to problems. My friends dad had a BMW 7 series that would open the trunk when you touched the door handle (the keyless entry was absolutely fucked up in that car). But, the dealer could never find the problem. Overall, the car was in the shop more than in his garage. He dumped it and their other BMW because it also had reliability issues. Mercedes, BMW, and Audi all have models that operate in the same price range as the Model S, and all have their own issues. ", "score": 1, "replies": [{"body": "I understand that as well.  But people seem to be misinformed that the Model S is a trouble-free, maintenance-free vehicle to end all other vehicles, which it most certainly is not.", "score": 1, "replies": []}]}]}]}]}, {"body": "Buy it and forget about it! Not good for short term trading. TSLA could be be over 400 in 2018.  ", "score": 3, "replies": []}, {"body": "Hold you fool", "score": 2, "replies": []}, {"body": "Buy an otm put. There is so much hype right now.", "score": 2, "replies": []}, {"body": "Buy the car, short the stock", "score": 2, "replies": [{"body": "Short it to me :)", "score": 1, "replies": []}]}, {"body": "Problem with TSLA is that all of its potential future growth is already priced into the stock.", "score": 2, "replies": []}, {"body": "Umm, buy. Elon anounced 115K preorders already. Thats $4B in sales. I believe their target is 500K per year until 2020.", "score": 2, "replies": [{"body": "This comment has been overwritten by an open source script to protect this user&apos;s privacy.  It was created to help protect users from doxing, stalking, and harassment. \n\n   If you would also like to protect yourself, add the Chrome extension [TamperMonkey](https://chrome.google.com/webstore/detail/tampermonkey/dhdgffkkebhmkfjojejmpbldmpobfkfo), or the Firefox extension [GreaseMonkey](https://addons.mozilla.org/en-us/firefox/addon/greasemonkey/) and add [this open source script](https://greasyfork.org/en/scripts/10380-reddit-overwrite).   \n\n Then simply click on your username on Reddit, go to the comments tab, scroll down as far as possibe (hint:use [RES](http://www.redditenhancementsuite.com/)), and hit the new OVERWRITE button at the top.   \n\n  Also, please consider using [Voat.co](https://voat.co) as an alternative to Reddit as Voat does not censor political content.", "score": 21, "replies": [{"body": "Yeah if you put that as revenue, it would fuck up your calculations for net profit. ", "score": 5, "replies": []}, {"body": "I guess that makes sense and the $115,000,000 they got today is unearned revenue right? $1,000 a preorder.", "score": 1, "replies": [{"body": "The $1,000 isn't paid until purchase agreement is signed. Oh and, it's refundable if they back out. Ouch.", "score": 1, "replies": [{"body": "Sucks", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "Wait for a dip to 190 to 200 ran too much into this imo.", "score": 0, "replies": [{"body": "[deleted]", "score": 3, "replies": []}]}]}, {"body": "$4B in potential sales, $115m in deposits.\n\nThey have $1.2B in the bank, are currently losing money, and still need to spend at least $3B to manufacture those cars before they make the $4B.  ", "score": 3, "replies": [{"body": "I can't believe I've seen people calculating it like \"35k a car multiply by x sales=y profit\"\n\nLike not only is it not going right to profit but they aren't making 35k a car.", "score": 9, "replies": [{"body": "They don't even make a profit selling the Model S right now.  They make money off tax credits for manufacturing 0 emission vehicles which technically isn't considered revenue and is not a long term strategy.", "score": 6, "replies": []}]}, {"body": "Actuallly its 115m in liability...", "score": 5, "replies": []}]}]}, {"body": "Why so many of you are into TSLA? It's obviously much expensive than the market average (at least 8 times higher PE ratio than its competitors). I do think their long-term growth is to be higher than the market but it's anyway too expensive to buy. ", "score": 2, "replies": [{"body": "Do your due dilligence before commenting Sir. The hype isn't set in stone, but it shouldn't be scoffed at either: With the $115M in liabilities they accrued with those preorders, that's over $4B in potential revenue scheduled for the Model 3 alone next year; and estimating a meager 15% profit margin they should net well over $600M off of it.\n\nIf Elon wasn't lying to the crowd, they are capable of filling up to 300K orders by year end next year. Since most of their expenses were in R&D in past years, and no cars are slated in the foreseeable future, expenses will be even lower; seems like a reason to be hopeful.", "score": -2, "replies": [{"body": "Don't forget though, reservations are not contracts to buy. There is no obligation involved.", "score": 4, "replies": [{"body": "Even factor in a 20% conversion loss from deposit to sale, still a ton of potential revenue. Tsla just gave themselves a lot more room to grow. ", "score": 1, "replies": [{"body": "That's the problem though, the stock has a ton of room to FILL. With a market cap of $32B it's half of a regular such as Ford. Yet that projected, hopeful revenue of $6B added to their usual $4B ($10B for those weak at math) is not even close to Ford's $149B. And TSLA still needs a few years to get the profit margin positive, giving companies like Ford time to start to develop and compete in the EV market (especially with $9B in free cash flow). I absolutely love the product, love the disruption, but I fear the stock at this time.", "score": 0, "replies": []}]}]}, {"body": "That still gives them a P/S of 6.  Ford is 0.36.  Toyota is 0.65.  GM is 0.32.  Daimler is 0.48.\n\n\n", "score": 4, "replies": [{"body": "This is where the bulls lose me. It's a car company that's being valued like a tech company.  Sure, it's kinda both but cars are big ticket low margin items regardless of how much technology you stuff into them.  ", "score": 5, "replies": [{"body": "exactly, people need to realize that the actual winner from TSLA doing well isn't TSLA, it's NVDA.  ", "score": 1, "replies": [{"body": "Explain please, haven't heard this and very interested.", "score": 1, "replies": [{"body": "NVDA is making the \"brain@ of Tesla's self driving cars.  NVDA could have huge profit margins because it's a software/hardware company, while TSLA is in auto manufacturing which has an obvious ceiling.  ", "score": 2, "replies": [{"body": "Ahh yes, I researched the heck out of it last night and am quite happy you posted that. Although slightly overvalued, I think you're on to something good with NVIDIA. ", "score": 1, "replies": [{"body": "Yeah, I agree that NVDA is probably over/properly valued, it's definitely not on sale.  I'm in NVDA long @22, 28, and 30.  NVDA is a strong company that is starting to diversify.  ", "score": 1, "replies": [{"body": "I'm going to definitely keep my eye on it. Thanks for the free chicken. ", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Buy that shit, its gonna take over the car market as soon as they can keep up with demand (this is where I see them having a problem); that and infrastructure that still does not exist.", "score": 1, "replies": []}, {"body": "I bought in at around $170 when it kept dipping a month ago it's been a crazy ride since. I wanted to buy more around that range but it kept going up and up and I thought it would dip back down so I'm just staying put with my original investment. I do believe in TSLA and think that it could go to be a $400 stock but it is a little risky since they don't make any money right now. I would definitely hold, but I'm not sure if I would buy at this price. I think it'll likely go down a little bit after the Tesla 3 hype dies. ", "score": 1, "replies": []}, {"body": "i bought in at $165 and sold at $200.  ", "score": 1, "replies": []}, {"body": "No. The car itself is not what will make Tesla the winner.\nIt's their giga factories that will make them the winner as Ford,GM,and everyone else will need a source of batteries for their EV.", "score": 1, "replies": [{"body": "> t's their giga factories that will make them the winner as Ford,GM,and everyone else will need a source of batteries for their EV.\n\nIf Ford or GM need their own batteries they can make it themselves, they don't need to rely on Tesla and thats so ridiculous to even think its unbelievable. \n\nTeslas GigaFactory costs ~$5 billion. GM has $15 billion in cash on their balance sheet and Ford has $14 billion. They could built it themselves in a heart beat if they wanted to. ", "score": 1, "replies": [{"body": "People need to realize that TSLA will never become a mainstream car company, they will always be high-end/luxury.  If the public actually demands electric vehicles, Honda/Toyota/GM/Ford will mass produce them, and they will be much cheaper than a Tesla.  Sure Tesla can make a $35k car (if they can even hit that price mark), but how many people are going to purchase it when Honda/Toyota come out with a competitor that is $25k and Ford/GM come out with one that is $22k?", "score": 2, "replies": []}]}]}, {"body": "$TSLA and Elon fall flat on guidance each quarter/year. My advice is to sell high on this stock. It's extremely overpriced and production numbers always miss their targets, which brings the stock price down. \n\nThis is my philosophy after watching this stock for the past few years and you should do your own research.", "score": 1, "replies": []}, {"body": "Risky as hell.  If I had to make a trade, and wanted to own the stock lower, I'd sell a couple May 20 190 strike puts after the stock pulls back some more and volatility rises.", "score": 1, "replies": []}, {"body": "TSLA is way overpriced right now imo. ", "score": 1, "replies": []}, {"body": "Can't wait for the next short squeeze. ", "score": 1, "replies": []}, {"body": "Sold in the very early opening on Friday 1st April got slightly more the $240 bought it at $196 on 1st March nice tidy profit. In Elon we tru$t in shortsellers we take advantage. Now waiting in the wings for another way into the market.", "score": 1, "replies": []}, {"body": "Tesla Stock is up more than 50% since this bullish forecast issued on February 11:\n  \nhttps://www.reddit.com/r/business/comments/4591pt/fourth_quarter_results_reignite_investor/", "score": 1, "replies": []}, {"body": "cost of production > $35k. \n\nI would not buy.", "score": 1, "replies": [{"body": "Source?", "score": 1, "replies": [{"body": "1st one quoted 49K and then went to 75K.\n\nThey've been late on all orders.\n\nA lot of people even stated in Reddit that they pre-ordered JUST IN CASE they wanted it, but right now have no intention to buy it. They want a guaranteed slot though just in case they change their mind or their financial situation improves.\n\nWhen you see all these pre-orders, we could say a good portion will cancel, while those cancellations could also be filled. \n\nThe overall market does not look good right now. It's better to stack some cash and wait for a big dip on Tesla before buyin in.\n\nRemember, buy the hype sell the news.", "score": 1, "replies": []}, {"body": "http://ir.teslamotors.com/secfiling.cfm?filingID=1564590-16-13195&CIK=1318605\n\nwhile the annual report does not go into specifics, the consolidated statements of operations has a net loss of 888,633. \n\nAgain, no specifics, but this is pre-model S. You cant tell me a cheaper priced vehicle would generate more profit than the current premier options? The battery alone is estimated to be around 20,000$.", "score": 1, "replies": []}]}]}, {"body": "Tesla  just Osborned itself yesterday - who is going to spend $80k on a model S/X this year when you can get a model 3 for 35k in 20 months. ", "score": 0, "replies": [{"body": "Someone who wants a nicer car? ", "score": 15, "replies": [{"body": "Or a bigger one in the case of X.", "score": 9, "replies": [{"body": "S and X are both bigger", "score": 5, "replies": [{"body": "I was listing it as a reason to buy, not a fact. I don't think anyone goes \"oh, I need a big car, let's buy S\".", "score": 2, "replies": [{"body": "It would be a reason to buy over the 3", "score": 2, "replies": []}]}]}]}]}, {"body": "Going by this logic, everyone should be driving a honda civic.", "score": 6, "replies": [{"body": "It's almost as if different consumers can't have different preferences.", "score": 4, "replies": []}]}, {"body": "Who would buy a BMW when you could just by a Toyota Corolla?", "score": 2, "replies": []}, {"body": "Model S is still the car I want, but the model 3 is more what I can afford right now. Debating whether or not to just use the model 3 money towards the model S in the more distant future", "score": 1, "replies": []}]}, {"body": "As a theoretical, if Tesla were to go into bankruptcy proceedings before they started delivery of Model 3s, where in the whole chain of creditors would the folks who put down deposits belong?  After any bond holders?  What about equity holders?  I assume these deposits would be treated somewhat akin to \"Accounts Payable\" or short term debt.\n", "score": 0, "replies": [{"body": "The deposits are a liability, held under unearned revenue. I don't know where they get refunded back though.", "score": 1, "replies": [{"body": "> The deposits are a liability, held under unearned revenue.\n\nYes, of course.  I'm asking where you would stand in line as a creditor.  I would assume behind bond holders (actually, not even sure Tesla *has* any bonds, TBH), but beyond that, I have no idea.\n\nI wonder if the reservation contract stipulates that somewhere.\n\n", "score": 1, "replies": [{"body": "I only mention UR because you had mentioned AP. I bet they would be just about last in line if TSLA went insolvent. ", "score": 1, "replies": []}]}]}]}]}
