{"title": "Is Starbucks SBUX an immediate BUY?", "selftext": "SBUX shares dropped nearly 16% yesterday following their earnings release for fiscal Q2 which was worse than anticipated and marked a historically weak quarter. Starbucks was already in the Unfavored zone of the SIA S&P 100 Index Report and fell 7 more spots yesterday to the 100th ranking out of 103 investments. Starbucks has been in the Unfavored zone since June of last year and is down around -25% during this time period. \n\nUS same-store sales dropped by 3% compared to an expectation of more than 1.2% as cautious consumer spending and a deteriorating economic environment weighed on customer traffic. Similarly, China experienced a decline of 11% in sales against an expected 2%. Operational margin stood at 12.8%, lower than the expected 14.4%, with EPS at $0.68 compared to the expected $0.80. Global revenue growth is pegged at low-single digits, compared with the previous guidance for a 7% to 10% gain. The retailer also forecasts global comparable store sales to be flat to down by low-single digits, compared with prior expectations for 4% to 6% growth. The company's long-term growth depends on several sales drivers and correcting some recent actions, as well as implementing cost efficiency measures according to analysts. Looking at a candlestick chart over the last five years using weekly time periods, we can see SBUX gap down significantly on the earnings miss yesterday marking the largest one week drop in this time frame. This has continued its recent trend downwards from its all-time highs from July of 2021 and its recent one year high from May of 2023. We could see support just below the $70 level based on previous lows from the spring of 2022 and past moves.\n\nStarbucks Corp (SBUX) is currently in a column of 17 O's in a 2% Point and Figure chart which represents around a 35% drawdown while filtering out the short term noise. To the downside, support can now be found at around $70 and below this at $65.85 which corresponds to the lows from 2022 and the summer of 2020.", "id": "1cjbp99", "created_utc": 1714750672.0, "score": 4, "upvote_ratio": 0.56, "num_comments": 60, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 2 months ago\n**Total Comments** | 13 | **Previous Best DD** | \n**Account Age** | 1 year | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "All you gotta do is buy a put and the stock will run", "score": 39, "replies": [{"body": "1 put, 10 calls", "score": 17, "replies": [{"body": "Investors hate this one weird trick", "score": 24, "replies": []}]}, {"body": "OP gonna try to catch knives", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 21, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Press F to pay respects", "score": 3, "replies": []}]}, {"body": "Lmao I think stuff like this all the time. Crypto brought in a bunch of people who just started making up terms for shit. Now it's spread throughout everything trading and I have to now relearn another dictionary of weird terms cause some influencers decided that \"liquidity zone\" and other shit like that that wasn't a thing before 2015,  was a fun thing to say.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Lmao, oh my bad, Google trends says 2018.", "score": 1, "replies": []}]}]}, {"body": "Coloring outside the lines.", "score": 2, "replies": []}]}, {"body": "offbeat psychotic elastic support society humorous knee violet wide rustic", "score": 18, "replies": [{"body": "No way this guy makes it to the next ER. He went full regard on television. You don’t do that unless you want to be in the unemployment line.", "score": 10, "replies": [{"body": "I saw it, ceo talking about Starbucks as if he running Pepsi.", "score": 7, "replies": []}, {"body": "Making it sound like a good time to buy. Stock will definitely pop when that gets announced", "score": 5, "replies": [{"body": "I sold 85 puts for 17th may. Waiting for 5 dollar jump", "score": 3, "replies": []}]}, {"body": "\"Sir, I don't know how you can come on TV and say that. Your throughput is terrible!\"", "score": 2, "replies": [{"body": "If he was CEO of Boeing they would have killed him live on tv", "score": 3, "replies": []}]}]}, {"body": "True but the last CEO was goated and you won’t get someone similar", "score": 3, "replies": [{"body": "I agree that he was goated but their current CEO never had a particularly impressive (or even good) resume to begin with. Not for a company as recognizable as Starbucks at least.", "score": 4, "replies": []}]}]}, {"body": "Starbucks is doing everything but what they should do and that is to lower their goddamn prices. People are not paying $5 for black coffee. The CEO is out here yapping about bringing value to the customer and blaming poor earnings on the weather lmao. They need to stop junkies from shooting up in the bathrooms and start rebuilding the brand from the inside out starting with the prices. There is way too much good competition and cheaper alternatives w better coffee than Starbucks at the moment.", "score": 11, "replies": [{"body": "While SBUX may miss sales targets, their overall sales are still obscene.  In many American towns outside of big cities, Starbucks is the only thing in town.  Starbucks has gone down market since its founding, not up market.  It is now the McDonald’s of coffee. The drive through in any city in America has a line around the block and out of the parking lot in the mornings.  I am not a Starbucks fan, but I don’t understand the pricing complaints from people. They are by far among the cheapest around in any major city. There is no $5 black coffee. In downtown Miami, DC, NYC, etc a black large (venti) coffee is around $3.75 with tax. A small is in the $2 range and a medium is low $3.  They are by far and away cheaper than their competition, which is the boutique independent coffee shops that do have outrageous prices, for example a black small coffee at Panther Coffee in miami is like $6.50.  Only fast food coffee or 7-11 is cheaper than Starbucks. You want to spend $9 on some bullshit sugar frappe, you can. You want to spend $2.25 on a black coffee with cream, you can.  I haven’t done a business case on SBUX, but they certainly aren’t going anywhere, ever.", "score": 2, "replies": [{"body": "I thought McDonalds was going to skin Starbucks for awhile.  When they decided to stop carrying Starbucks product and launch their own competitive coffee line.\n\nTheir stuff is so awful though.  And Starbucks is still at least okay to drinkable.  Others chains are also usually not as good either, so I’d actually prefer SB stick around.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Panther is fire", "score": 1, "replies": []}]}, {"body": "In miami, there’s a dozen better bougie coffee places\n\nNobody is going to Starbucks who wants good coffee in Miami\n\nPanther, pasion even; I suspect it’s the same in many other cities.\n\nI had Juan Valdez in Colombia and I feel like they’d do well if they were more in America. Never see them here really", "score": 1, "replies": [{"body": "No shit. Your comparisons are like that of an unsophisticated consumer, not an advanced or accredited investor. Millions of people around the world go to Starbucks because they don’t have a W2P for coffee that unjustifiably more expensive. Millions of people around the world depend on SBUX for their daily caffeine, no other business, besides Dunkin, can make this claim.  Other businesses who can, like Tim Hortons, are generally regional at best and aren’t significant competitors. \n\nYou cannot compare SBUX to some place like Panther, it is a completely different market. In fact there is a Panther directly across the street from a SBUX in Miami, and the SBUX is always busier with a line. \n\nThe complaints about the CEO are somewhat justified, but it is generally reckless spending that is cutting into SBUX cash flows. The free college/tuition reimbursement program has been an absolute disaster for shareholder value. The CEO acts like his obligation is to the minimum wage baristas and not to the shareholders.", "score": 1, "replies": []}]}]}]}, {"body": "They sell coffee FFS! I don't get that valuation.", "score": 4, "replies": []}, {"body": "Massive overreaction\n\nWill return to the mean around 80$+ sooner than later", "score": 5, "replies": [{"body": "Nah the anti genocide crowd got em good\n\nBasically \"the jooz did dis\" \n\nIt'll go back up once ceo pulls a Palestinians flag out of his ass. But who knows when that'll be. Risky play", "score": 2, "replies": []}, {"body": "So it’s a buy then?", "score": 1, "replies": [{"body": "Don’t expect any good news to come out for Starbucks anytime soon so idk what will push it. Investors are just not interested after it taking such a massive beating already.", "score": 2, "replies": []}]}]}, {"body": "Picked up a bunch of 79c for the end of the month. Looks like we may be finding that double bottom today", "score": 4, "replies": []}, {"body": "Nah. I need at least two more lines before I'm convinced.", "score": 3, "replies": []}, {"body": "Around $70 a share I think is a good buy. Bought a few today at $73 and dividend yield at 2.94% and a 20.63 price to earning ratio even if I goes down a little still got the dividends and don’t see hitting in the 60 think thats way to undervalued but what do I know I’m just a crayon eater 🥴", "score": 3, "replies": []}, {"body": "Stay away from Starbucks.\n\n$10 cups of coffee is a terrible business model in an inflationary economy where people can’t even afford groceries", "score": 9, "replies": [{"body": "Plus CEO opened his mouth and removed all doubt that he is moron", "score": 4, "replies": [{"body": "L BOZOS", "score": 1, "replies": []}]}]}, {"body": "No", "score": 5, "replies": []}, {"body": "Let me know when you buy so I can short", "score": 2, "replies": []}, {"body": "It’s been beaten down enough. If there’s a little more to go (to nextbsupport level) I don’t know. But May should see a run up due d’or dividend payout may 31.", "score": 2, "replies": []}, {"body": "An immediate buy? Probably not but it’s not far off. Don't expect much to change until they change CEOs.", "score": 2, "replies": []}, {"body": "Naw, millennials and younger don’t buy Starbucks they make their own. Poor choice moving forward as business dwindles", "score": 2, "replies": []}, {"body": "I love the trend line that goes right through the price.", "score": 2, "replies": []}, {"body": "I’ll only say this once \nJust my opinion \nStarbucks ceo is trash \nStarbucks middle management took on a lot of former GameStop managers which is terrible. They are the most cookie cutter trolls you can imagine running a company. I know many of those managers personally and wouldn’t hire a single one. \n\nSbux is going to wreck itself with incompetent management and the ceo needs to go first \n\nNot stock advice \nJust my opinion", "score": 2, "replies": []}, {"body": "That green line, maybe", "score": 1, "replies": []}, {"body": "No", "score": 1, "replies": []}, {"body": "Bought today at 73 cause everybody drinks coffee. Probably hold till the next CEO turns it around.", "score": 1, "replies": []}, {"body": "No way, the company will go bankrupt. People hate their coffee.  It's like drinking water with cream.  The CEO has no creativity whatsoever.", "score": 1, "replies": []}, {"body": "Not until they make their coffee not shit.", "score": 1, "replies": []}, {"body": "There's a Starbucks boycott in the ME sales are down a lot here, with stores closing. They struggle in Asia too. I can't see them expanding much further.", "score": 1, "replies": []}, {"body": "That CEO just had a mental breakdown on tv\n\nI wouldn’t buy into that", "score": 1, "replies": []}, {"body": "Schults still has a pile of $sbux shares, he should consider coming back if he wants them to be worth anything", "score": 1, "replies": []}, {"body": "buy", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I live in southern california and theyre building the 3rd starbucks within 1.5 miles of eachother and renovating 2 within 3-5 miles of that. This shit aint goin nowhere", "score": 7, "replies": [{"body": "Yup.   small biz aint paying rent and the big corps are picking up their spots.", "score": 1, "replies": [{"body": "do they follow the mcdonalds real estate model or rent?", "score": 1, "replies": [{"body": "I believe they just lease.  They seem to do a lot of opening and closing of stores if locations dont work.  Mcds never seem to close.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I think a common misconception is people go there for just a “coffee”. I bet 10% of sales is just a cup of coffee while the other 90% is a fancier type drink you can’t just get anywhere.", "score": 1, "replies": []}, {"body": "Yeah but how many people do you know that eat subway sandwiches everyday vs drinking a starbucks everyday?", "score": 1, "replies": []}]}]}, {"body": "30 year fad lol", "score": 3, "replies": []}, {"body": "They are more like McDonalds, tech people should be allergic to it.  I was buying some kid feed at a decent-ish burger-chain recently and they priced coffee substantially higher than Starbucks.\n\nSo they’re terrible, but you can easily pay $20 for a waffle too.  Pricing wise they are not out of line and are not raising prices enough to keep up with their position during initial expansion.", "score": 2, "replies": []}]}]}
