{"title": "NVDA: Stock Soars, Yet Forward P/E Drops or Stays the Same After Each Earnings Report", "selftext": "", "id": "1cxuwvy", "created_utc": 1716364754.0, "score": 168, "upvote_ratio": 0.94, "num_comments": 62, "comments": [{"body": "But it’s hard to say that Nvidia is overvalued given their performance.  Their earnings per share continue to climb and their net income is up over 6x in the past 12 months.  Their profit performance:\n\n- 2 years ago: $6B in EBITDA\n\n- Last year: $36B EBITDA\n\n- This year forecast: $70B+ EBITDA\n\nSo profit is up roughly 10x and the price is actually up slightly less than 10x in that time.  This is what, as a shareholder, you prefer over something that shoots up for no reason.  As a trader it can make it difficult because it’s up SO MUCH which makes us think that it’s overvalued but the fundamentals actually back up the price.\n\nWill be interesting to see how their earnings today move the market.  The numbers probably matter less than the forecast.", "score": 47, "replies": []}, {"body": "WSM came through today, NVDA needs to bring it! Mama needs a brand new bag!", "score": 20, "replies": []}, {"body": "Things will get wild if we start needing significantly less GPU to run these models in the future which seems inevitable.", "score": 29, "replies": [{"body": "Every new generation of tech seems to cause more intense graphics needing more and more processing power … that wont stop any time soon. Every 6 months seems like the high end products you purchased earlier in the year are starting to fall behind - and realize you need upgrades again within the next year to year and a half. \n\nBeen that way for as long as I can remember - desktops, laptops, phones - everything. No matter what happens with tech, seems like Nvidia always is ahead of the curve … in fact, they seem to be building the curve right now, and its everyone else that has to adjust to navigate it.", "score": 29, "replies": [{"body": "I have a real doubt that the graphic cards is the driver here. GPU chips are used for running AI models due to its structure. I think there’s no doubt today about the AI bright future, which needs to be fueled by the GPU’s. NVDA growth is supported by a real demand in their chips, it’s going to get even more crazier (unless TSMC gets killed by China, literally :) )", "score": 5, "replies": [{"body": "But they do have great graphics cards too ... got my first one in 2001.", "score": 1, "replies": []}]}, {"body": "I disagree. I’m not saying it’s close but it’ll inevitably follow the same way computers and phones have gone. Sure they improve, but most consumers and applications can go years and years without upgrading while early on the time between upgrades was much less.", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "It’s obviously been a great strategy but this plateaus eventually. It depends on your timeframe. It’s probably a great investment for forseeable future but look at Cisco. 20 years ago it didn’t seem like network growth would stop and now it’s become commoditized and growth is much much slower.", "score": 3, "replies": []}]}, {"body": "Consumers aren’t driving the growth.", "score": 2, "replies": []}, {"body": "We are probably 20+ years out from that. Remember the earliest mobile phones? How long between that and the first smartphone. \n\nThe reality is that the data centers will need regular upgrades. The older equipment might get tossed or it might get put on second tier tasks, but the tech will march on at a rapid pace. The big tech companies are buying it all up right now and they aren't going to decide they will settle for last generation equipment. Each generation of newer chips is an arms race for them.", "score": 1, "replies": []}, {"body": "Dont be one of those people where your kids will be coming to your house saying, \"Dad, how long has it been since you upgraded your computer? No wonder you cant open up Google.\"\n\nMy mom always says something like: \"Its new, I just got it in 2017\" ... and my brothers and I go out to get her a new laptop so it works again.", "score": 0, "replies": [{"body": "Unless your mom games or works in 3D, that 2017 laptop wasn't the problem.", "score": 5, "replies": []}]}]}, {"body": "I’ll agree with the overall thesis but also everything is made more efficient over time. We’ve also not ever had this much demand for GPU power. Plenty of companies are seeing Nvidia printing cash so it’s only a matter of time before other companies eat into their market share or develop some type of efficiency breakthrough IMO. I’m playing devil’s advocate to some degree but this will be the bear argument in the future for sure", "score": 1, "replies": []}]}, {"body": "GPU need to run models should decline, models will get better and smaller. But there will be more of it. More people will be using AI and it will touch and affect more systems. Look at cloud computing. So GPU use will not decline or sales will not decline. GPU and ASIC makers will just try to keep up with the demand.", "score": 3, "replies": []}, {"body": "Current state of the world is buy more GPUs (faster than they can even be produced) yet you say it seems “inevitable.” Idk seems like a bad take.", "score": 4, "replies": [{"body": "That’s why I said “in the future”", "score": 0, "replies": []}]}, {"body": "A gas will expand to fill its container\n\ni.o.w. if performance of the models or the GPU is optimized, they’ll start using more complex models or they’ll have more instances, or something like that. They won’t be downsizing on hardware acquisition", "score": 2, "replies": []}, {"body": "sure, rate of growth for GPU systems will go down, but cloud revenues and software revenues will continue to increase, NVDA is a software play as well. Additionally they are pivotal in advancement of vehicle technology. I'm sure their market share of GPU hardware will decline as customers make their own and competitors put out not as good but cheaper products. \n\nStill, more companies will be taking on more AI, and nobody expects this growth curve to be infinite. Also, NVDA is always ahead of the curve. We don't even know what the next big thing may be yet.", "score": 1, "replies": []}, {"body": "look at GROQ and their LPU", "score": 1, "replies": []}, {"body": "History tells us more compute is always needed, AI is just creating more and larger use cases.", "score": 1, "replies": []}, {"body": "Gut says 3-5 years before we start seeing meaningful gains in general knowledge model efficiency. In that time, enterprise demand with only increase. I think terminal price, not accounting for inevitable stock splits, will be around $4000.", "score": 0, "replies": []}, {"body": "Cyclical behaving like cyclical", "score": 0, "replies": [{"body": "I own Nvidia and I’m just being realistic about possible bear cases in the future.", "score": 3, "replies": [{"body": "Companies all signed-up at whatever cost and even if they didn’t need it all just to be on the order desk and backlog.\n\nAt some point they’ll have inventory and CFO will be concerned about working capital and ask to reduce inventory. It will be interesting to see how long ridiculous growth will last.", "score": 1, "replies": []}]}]}, {"body": "No matter how fast it is, it's never fast enough. When you get more compute you just find new ways to spend it and wind up needing more.", "score": 0, "replies": []}]}, {"body": "NVDA's growth is strong, but the valuation feels high, and I've been wrong. Interesting to watch how this plays out. 🧐📈", "score": 17, "replies": [{"body": "As always, nobody knows and everyone will claim they did afterwards.", "score": 36, "replies": [{"body": "It's the opposite of AMD on the market. Beat earnings? Stock drops. 🤷‍♂️", "score": 4, "replies": [{"body": "Bleak future….as perceived by the market", "score": 1, "replies": [{"body": "It's just weird that they beat earnings almost every quarter for 3-4 years and it's still perceived as a bleak future. I don't mind, I'll keep buying AMD stock. They show tons of upside on the CPU front and have a niche on the GPU side. \n\nEventually reality has to catch up to the market...I hope.", "score": 1, "replies": []}]}]}, {"body": "Remember, everyone who invested in NVDA is a financial genius and will promptly lose all of their gain when they decide to apply their financial prowess on their other stock picks", "score": 3, "replies": []}]}, {"body": "You know. There’s a record of how it played out. \n\nIt’s in the chart you posted.", "score": 3, "replies": []}, {"body": "I dont see valuation high at all … its been treading water trading mostly sideways since around 1st week of March (abt 6 weeks) … To me it looks like its coil is pulled tight and ready for a big jump if earnings are as expected. \n\nThe projected earnings will bring NVDAs trailing PE ratio back into the mid 50s - which to me would signal a push of its price to go up back to where trailing PE ratio is in the 70s again … which will probably be in the 1200-1250 per share range to get it back to where its trailing PE ratio is in the 70s again (if earnings are as expected) ... Id expect it to stall in that range until August’s earnings, possibly a bit higher if guidance justifies it.\n\nCould be wrong - but that is what it appears like to me.", "score": 2, "replies": [{"body": "It’s up 20% just this month. 100% past 6. Can’t get more sideways than that I suppose", "score": 3, "replies": [{"body": "Feb 21 was last earnings - immediately the trailing PE ratio went down from 82 prior to earnings to 51 after earnings. The price started to rocket up from the earnings release on Feb 21 to March 7 when the trailing PE ratio hit the 70s. Once trailing PE ratio hit the 70s, it has bounced around not losing too much, not gaining too much. See:\n\nMarch 7, Nvidia was 927,\n\nMarch 25 was 950,\n\nApril 9 was 853,\n\nMay 6 back up to 921,\n\nMay 9 back down to 887,\n\nMay 15 to 946,\n\nMay 17 to 924,\n\nand today it is 948 .... so gone down since March 25 ...\n\nGone up 2% since March 7 (two and 1/2 months since price hit its wall with trailing PE ratio in the 70s) ...\n\nA 2% increase since March 7 is trading sideways in the last 2 and 1/2 months. As soon as the trailing PE ratio got into the 70s price increase slowed down.  I would project it to do the same this time around. New numbers will bring down the trailing PE ratio to the 50s - expect price to go up until trailing PE ratio gets to the 70s again. That is what growing tech companies do.\n\nJust look at the historic trailing PE ratios ... in 2023 NVDA's trailing PE ratios were up in the 114 range for several quarters. Trailing PE ratio got up as high as 245 in July 2023. Here is a link to a chart showing NVDA's trailing PE ratios over time (look at last 5 years and last 3 years and last 1 year views - PE ratio has been going down in past year - May 2023 trailing PE ratio was 162 and price was 309): [https://ycharts.com/companies/NVDA/pe\\_ratio](https://ycharts.com/companies/NVDA/pe_ratio)\n\nPrice is better now than it was then - and it was trading between 200-400 in 2023. As revenue and profits go up exponentially like it has, the price increase is justified.", "score": 4, "replies": []}, {"body": "It’s up 0% in the last 10 weeks but ok.", "score": 2, "replies": []}]}]}]}, {"body": "Everyone wants in on the winner.", "score": 4, "replies": []}, {"body": "Well that’s because it’s being pumped by market makers for liquidity!", "score": 4, "replies": []}, {"body": "NVDA is the new TSLA hype beast.", "score": 20, "replies": [{"body": "tell us you don't understand financials without telling us you don't understand financials.", "score": -3, "replies": [{"body": "Are you talking to yourself? ", "score": 2, "replies": [{"body": "nope, just the economically challenged", "score": -4, "replies": [{"body": "So you were talking to yourself. Gotcha. \n\n\nGenerally firms trade at about 20-30 P/E. I didnt check after their latest earnings report but Nvidia is trading around 78-80ish. The share price is divorced from the earnings per share because the market is assuming their future net income will grow substantially. The same was true of tesla at its peak. Investors believed tesla had such a head start on competition that they would be the dominant player in EVs and FSD. It didnt matter what they were making because they were pricing in massive future growth. \n\n\nNvidia may be different and grow I to its share price but regardless you can see the parallel op was drawing. ", "score": 5, "replies": [{"body": "Nobody cares about trailing P/E.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "This means that the earnings are rising at the same rate of the price. How is this a bad thing", "score": 5, "replies": []}, {"body": "For the same reason I am not adding positions. The technology can not immediately translate to more earnings. Earnings are not revolutionary.", "score": 3, "replies": []}, {"body": "It's all about growth.", "score": 1, "replies": []}, {"body": "When Nancy buys something, you don't ask any questions. You just buy! \n\nShe's the best there is and she knows better than you. \n\nIn Nancy we believe. Long live Nancy!", "score": 1, "replies": []}, {"body": "That’s because it’s incredibly rigged. Pushed to the extreme by hedge funds, to which they can attribute and tie in the collective S&P growth too.", "score": -3, "replies": []}, {"body": "Will Nvidia bigger than Apple in two weeks? Nvidia just needs to jump 25.53% from this level assuming Apple’s stock price stays at this level to go lower which will be easier for Nvidia", "score": -4, "replies": [{"body": "Just needs to gain 800b in 2 weeks lol", "score": 10, "replies": []}]}, {"body": "I don't understand how the P/E metric is useful in anyway.\n\nA high number, whether positive or negative, is simply due to the earnings being close to zero. Why care about price/earnings when I can simply just look at just the earnings? Why not earnings/float or some other dumb combination?", "score": -5, "replies": [{"body": "Because when you buy a share you theoretically own a cut of the company’s profit equal to how many shares you bought. In stocks that give dividends this cut of profit becomes a reality.", "score": 6, "replies": [{"body": "Ok, but what are you expecting the P/E to do when earnings goes up/down? Should it hover around a particular value? If that's the case why aren't we charting it to better see where price should move?", "score": 2, "replies": [{"body": "Do you not see the same chart above? It basically answers your question", "score": 3, "replies": [{"body": "So falling P/E with sideways price action means gains coming soon?", "score": 2, "replies": []}]}]}]}, {"body": "It’s important because when you buy a share of any company you essentially own a tiny piece of the business.  And then you will sell that share at some point.  The goal is to sell it for more than you bought it.  Think about it as if you were buying a small business as a whole:\n\nIf a business makes $100k profit and you buy it for $200k.  You bought it at a P/E of $2.  You can sell your company for more in a couple ways:\n\n1) grow the business but keep the P/E the same.  Double the profit to $200k at a $2 P/E and you can sell the business for $400k\n\n2) convince the market to pay a higher P/E.  If you have higher expected growth or some product that is in high demand the market might be willing pay you more to capture that advantage.  Let’s say it goes up to $4.  Now at $100k profit you can sell it for $400k.  If you can grow the business to $200k and have a higher P/E then you can sell for $800k.  This is Nvidia.\n\nP/E ratios can be a sign that the market expects high growth.  At some point the ratios get so high where the market will no longer keep paying the high price.  Nvidia has both a growth advantage and a tech advantage.  This should cause their P/E to go way up.  But they keep outperforming even what the market expects which keeps their P/E relatively modest (given it’s growth).", "score": 4, "replies": [{"body": "Your NVidia example is really good, and helping me understand where P/E is useful. I also wanted to point out that P/E is unitless. If you did have a unit, it would be $ per $.\n\nMy confusion with P/E comes from negative and relatively low earnings numbers.\n\nP/E can become more negative despite showing less loss from one earnings call to the next. This is counter-intuitive and is due to the earnings encroaching on 0.\n\nAlso, once a company crosses from loss to profit in their earnings report, they go from having a large negative P/E to a large positive P/E. This is also counter-intuitive.", "score": 2, "replies": [{"body": "Those are situations where P/E might not be super helpful.  There are many ratios that investors use.  I like Price / Revenue as well which is often helpful when P/E breaks down.  Revenue will never be negative so you'll always have a positive P/R.  It is sometimes less helpful when a company gets dramatically more profitable without increasing sales as much -- either because of cost cutting, new products that offer higher operating margins, etc.  In that situation P/R will sky rocket because the stock prices probably went up a lot without sales going up as much.\n\nSo it's really about finding what ratios matter in what situations", "score": 3, "replies": []}]}]}, {"body": "You care because of you. There are many metrics. People like what they like. You don’t have to follow if you don’t want to.\n\nPE is useful for comparison of similar companies in an industry. Like chip makers vs chip makers. P/E is basically price per pound. \nIt’s harder to compare a bag of bananas that cost $5 vs 3 apples that cost $3. Price/LB or P/E helps you normalize the price of a stock.", "score": 1, "replies": [{"body": "I'm just trying to understand it's use. Sorry if I came off as uncaring.\n\nBut that is an interesting take. Also explains the break down of the metric when you throw negative \"LB\" into the mix.", "score": 1, "replies": []}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1cy2u8m", "created_utc": 1716391240.0, "score": 0, "upvote_ratio": 0.45, "num_comments": 67, "comments": [{"body": "I'd rather buy private islands.", "score": 62, "replies": [{"body": "Same bro ![img](emote|t5_2th52|4258)", "score": 6, "replies": []}, {"body": "Only islands?", "score": 6, "replies": [{"body": "I can show you my peninsula!", "score": 8, "replies": []}]}]}, {"body": "Recently watched a YouTube video about free cash flow companies and the dude was all in on LULU. He made a good case, so I checked one of his older videos.\n\n\nHe told people to pass on NVDA at $140.\n\n\nSo based on this extensive research, I'm gonna say nah. ", "score": 115, "replies": [{"body": "I think a lot of people would agree with you\n\nBut oh the surface there’s nothing wrong here necessarily \n\nIt depends WHY he said to pass on NVDA. Were his reasons solid, were they defensible and reasonable etc. \n\nYou’re not going to get every call right, what matters more is having strong reasoning for why you do this or that. \n\nSo I don’t think just saying hey I don’t like nvda at 140 then AI comes out and NVDA blows up means you’re necessarily a shitty analyst of stocks so long as the reasons you had for passing at the time were reasonable and made sense.", "score": 11, "replies": []}]}, {"body": "[deleted]", "score": 29, "replies": [{"body": "[deleted]", "score": 0, "replies": []}]}, {"body": "Bought and sold 315C’s this morning. Putting the profits towards these cheap 330C’s for a gamble. I think the severe drop is an overreaction", "score": 12, "replies": []}, {"body": "idk about this. i am a female who pretty much exclusively wore lulu and have stopped buying within the last few months due to the news about all the microplastics in their clothes. \n\ngeneral consensus within my friend group is quality has gone downhill as price has gone up. \n\nnot invested in $LULU, just my 2c, but i hope whatever your position is, it prints!", "score": 36, "replies": [{"body": "Surprise, surprise anything that contains polyester is made of microplastics. Most clothing is a mixture of polyester and cotton.", "score": 29, "replies": [{"body": "you’re correct. i was not aware for a long time. now that i am as the information is more widely available and the topic of more conversations, a lot of people are making different purchasing decisions. that’s all i’m saying.", "score": 8, "replies": [{"body": "I avoid synthetic fabrics. I mostly own cotton. It's hard to avoid elastic in underwear and socks though.", "score": 3, "replies": []}, {"body": "All these sweaty dudes being rude for no reason other than the fact you're a girl\n\n\n\nFeelsbad", "score": 11, "replies": []}]}, {"body": "All sports clothing is essentially pure polyester now- whatever this moisture wicking bs that started about 2010…these sporting companies would have us believe Costanza switching the uniforms to cotton really would have just given all the Yankees a rash.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 24, "replies": [{"body": "but if all women who buy lululemon operate like this her 2 cents is worth 100 cents", "score": 31, "replies": [{"body": "All women = 100 cents. Should be more like 75 cents", "score": 7, "replies": []}]}, {"body": "don’t listen to me, then. i’m just a consumer in their target market.", "score": 19, "replies": []}]}, {"body": "it doesnt help LULU that all these sports brands are coming out with leggings (alphalete, gymshark, aurola, etc.\n\n  \ni would say ALO is/will become the new LULU, my guess but im a man lol", "score": 2, "replies": [{"body": "Lulu is above and beyond better than alo.  Alo just has the soft ponto fabric… everything else Lulu wipes the floor with it", "score": 2, "replies": []}]}, {"body": "If you think they have a lot of microplastics in their clothes you should see the inside of my testicles.", "score": 1, "replies": []}, {"body": "clothes from a popular brand not being recyclable and made of shitty harmful plastic... I'm so shocked, next you'll tell starbucks bean pickers don't make any money... oh well, won't stop girls from getting their $15 frappuccino...", "score": -6, "replies": [{"body": "i, like many others, didn’t research what/where my clothes were. i bought them because they were cute and comfortable. as time and trends have changed, though, more and more people are talking about the importance of sustainable materials - or at least, wearing things that won’t hurt you long term. it’s a real topic of conversation in certain circles. \nsome women will still go on buying whatever they bought out of habit. but there is a real, negative stigma attached to Lulu currently. \nmy comment wasn’t to start an argument. i am part of their core demographic and it was just to let people know that lulu is trending out while other brands like ALO (privately owned) are closing in on the higher end yoga space that lulu once dominated.", "score": 11, "replies": []}]}]}, {"body": "10% bounce back in 5.5? Trading sessions.\n\nI think a bounce back is possible but too short of expiration imo", "score": 9, "replies": []}, {"body": "No. Other brands have the crack scrunchy that makes the butt look better. Never bet on comfort or quality over aesthetics.", "score": 9, "replies": []}, {"body": "Sexist bullshit.  All bums look good in Lulu.", "score": 15, "replies": [{"body": "Nonsense. I only trust Caterpillar for a dump truck like mine.", "score": 17, "replies": [{"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|12787)", "score": 4, "replies": []}]}]}, {"body": "I think Lulu has further to swing down before it corrects. I'm buying in at $150.\n\nI do like the stock though, Lulu makes quality stuff and the more of my wardrobe I can convert to it the better imo. Comfortable, easy to take care of, stylish.", "score": 10, "replies": [{"body": "I’m buying AAPL at $20\n\nAnd NVDA at $5\n\nAnd AMZN at $25", "score": 39, "replies": []}]}, {"body": "I like the play but it's not done selling off yet. Probably more downside until earnings which might help the reversal.", "score": 2, "replies": []}, {"body": "i saw rosie o donnell wearing Lulu yogas", "score": 2, "replies": []}, {"body": "Why not sell puts for $300? Its free money. Its only been a sinking ship for months and Im sure a high level employee leaving is not a red flag.", "score": 4, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 2 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 108 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1cy2u8m/dont_gamble_on_nvidia_earnings_buy_lulu_instead/) \n**Account Age** | 3 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Never owned the stock, has anybody studied if they might be getting priced out to the likes of Shein? Girls absolutely love that app, and they can buy 10 pairs for the price of 1 lulu.", "score": 1, "replies": []}, {"body": "Is LULU not a gamble?", "score": 1, "replies": []}, {"body": "Said that the moment Nvidia spikes", "score": 1, "replies": []}, {"body": "The leap spreads are too high. I tried opening a few 2026 leaps but didn’t fill. Regards are bumping up the ask.", "score": 1, "replies": []}, {"body": "Too crowded of an area for them to compete. Expect them to drop another 10% before support arrives.", "score": 1, "replies": []}, {"body": "Rather buy the dips in ELF… the trade down trade could have legs", "score": 1, "replies": []}, {"body": "Put credit spreads would be the play, IV is high right now and since 300 is a strong support", "score": 1, "replies": []}, {"body": "LULU is extremely overvalued. No i will not elaborate", "score": 0, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "too soon junior. 5/31? needs to be at least past june", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Two hundred whole dollars? Gtfo here", "score": 9, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Risking $200 isn’t even worth posting. Most people make $200/day from their job", "score": 7, "replies": [{"body": "![img](emote|t5_2th52|27189)", "score": 2, "replies": []}]}]}]}, {"body": "Options trading is a risky game, and it looks like this boomer got burnt.", "score": 4, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}]}]}, {"body": "Fashion is fickle and that brand is no longer cool. Sorta like now you're a dork if you have anything by Apple. Come and gone", "score": 1, "replies": []}, {"body": "Fine, bought a few are $0.44  lets take this ride.", "score": 1, "replies": []}, {"body": "Prime DE $LULU", "score": 1, "replies": []}, {"body": "It’s expensive.\n\nThis earnings has shown high expense items are dropping and cheaper options are succeeding.", "score": 0, "replies": [{"body": "I don’t buy that. most people i know are trying to get away from cheap fast fashion and buy higher quality in less volume", "score": 4, "replies": []}]}, {"body": "Bag holder 🚨", "score": -1, "replies": []}]}
