{"title": "SBUX calls? Wife dead, finna yolo “her half” (totally what she woulda wanted)", "selftext": "[deleted]", "id": "8sn8hk", "created_utc": 1529539150.0, "score": 52, "upvote_ratio": 0.86, "num_comments": 80, "comments": [{"body": "Yea, let’s blow 100k on calls. Or puts. As long as you do it with conviction. ", "score": 54, "replies": [{"body": "This.  Weak hands hold no tendies!", "score": 11, "replies": [{"body": "Por que no los dos? Then get cucked by theta when it sideways trades ", "score": 3, "replies": []}]}]}, {"body": "Have you not heard the news about Starbucks? I’d read the news about Starbucks. Unless DD stands for Diseased Dick then by all means carry on", "score": 38, "replies": [{"body": "What else would DD stand for???", "score": 7, "replies": [{"body": "Dysentery Danger", "score": 11, "replies": []}, {"body": "D O U B L E     D O W N\n\nload bb", "score": 9, "replies": []}, {"body": "Deep Dicking", "score": 5, "replies": []}, {"body": "Dgoogleit Dfaggot", "score": 3, "replies": []}, {"body": "Darkwing Duck", "score": 2, "replies": []}, {"body": "Dude...Duuude!!!", "score": 1, "replies": []}, {"body": "Dagger dick", "score": 1, "replies": []}]}, {"body": "idk seems like sbux going down but i've noticed all the people hating on starbucks are the same ones saying tesla gonna fail any day now. maybe just wait a couple days for it to stabilize then buy calls", "score": 8, "replies": [{"body": "I don’t know man. Starbucks is closing real stores . Tesla just making shit up that no one can prove true/untrue. I’d take a gamble on the guy making shit up.", "score": 0, "replies": [{"body": "There's 3 Starbucks in one mall where I live. Literally one upstairs if your fat ass is too lazy to go to the one downstairs. They should be closing more stores, 150 is not enough, I can't throw a brick without hitting a starbucks. ", "score": 13, "replies": [{"body": "But fat fuck won’t climb stairs to buy more Starbucks and fat fuck upstairs won’t come down to buy. Then again maybe China will save the day https://twitter.com/tictoc/status/1009623200458829825?s=21", "score": 0, "replies": [{"body": "so they closing stores and diseased or opening them up and expanding, make up your mind? i honestly just think they're closing stores that got taken advantage of and became unprofitable after they made that rule about not kicking people out for not buying anything and the market is just over reacting. still op, dont try to catch the knife wait for them to stabilize.", "score": 3, "replies": [{"body": "https://www.google.com/amp/s/www.forbes.com/sites/barbarathau/2018/06/20/as-business-stalls-starbucks-triples-store-closure-rate-with-plans-to-shutter-150-locations/amp/\n\nThey’re closing stores in the US and trying something new in China. They have a new CEO. Time will tell if it works but it’s obvious the US isn’t working anymore", "score": 1, "replies": []}]}]}]}]}]}, {"body": "The hoe theory is my DD. So puts then?", "score": 5, "replies": [{"body": "There are probably better hoe yolo plays, pick a high end fashion brand and play earnings (see TIF/LULU/GOOS).\n\nSBUX is a bit toxic right now, the SJW crowd is absolutely insatiable and companies will sooner kill themslves capitulating than be accepted as doing enough, and I think SBUX will be a case study of that. You have to just pretend to care like GOOG. I'd buy puts but i dont think 1 week is enough after it has just gapped down like this.", "score": 2, "replies": []}]}]}, {"body": "they literally just reported they're closing stores due to slow business and the first downgrade just came in\n\nmeanwhile tech stocks continue to make daily highs and you want to go long a stock that just gapped down 9%", "score": 30, "replies": [{"body": "Closing stores may actually be good if they’re not profitable. You need to cut your losses and invest your money where it prints more money.\nI have 7/20 and 9/21 calls. \nWe’ll see.", "score": 22, "replies": []}, {"body": "Ok puts then whatever ", "score": 19, "replies": [{"body": "too many good buying opportunities to get cucked shorting a bull market but good luck with that", "score": 8, "replies": []}, {"body": "Couple days late on puts bruh", "score": 3, "replies": []}, {"body": "Wait a little longer and see what happens. Starbucks will always be around.", "score": 2, "replies": []}]}, {"body": "You are literally saying buy the high not the low.", "score": 3, "replies": [{"body": "buy strength don't catch falling knives.", "score": 1, "replies": []}]}, {"body": "They also said they were targeting to close stores in densly packed urban areas.  AKA places where people will come, sit, use wifi, and not buy a drink.", "score": 1, "replies": []}]}, {"body": "Safe bet... December $500 calls for Netflix ", "score": 13, "replies": []}, {"body": "Did your wife really die?", "score": 10, "replies": [{"body": "Like 6 months ago but I’m still milking it. ", "score": 37, "replies": [{"body": "I'll pour some coffee out for your dead hoe ", "score": 26, "replies": []}, {"body": "If tru I hope ur doing okay. ", "score": 4, "replies": []}]}, {"body": "Did you even read the fucking post?  OP clearly is incapable of having ever had a wife. ", "score": -1, "replies": [{"body": "Ur a real fuck ", "score": 10, "replies": [{"body": "Well fuck me!  I replied before he did. I stand by my cruel sarcastic attitude, but not the specifics as it turns out.\n\nAlso, you’re right. But blow me anyway. ", "score": 8, "replies": []}]}]}]}, {"body": "What?!  Terrible idea. Just buy equity, collect dividends and write covered calls for premium. ", "score": 24, "replies": [{"body": "Pussy", "score": 35, "replies": [{"body": "If you wanna throw away 100k pick up 50k worth of hookers and blow.  Drop the other 50k into July tesla calls, $400 strike should do it. If you live through the drug laden orgy, you won’t ever have to work again. ", "score": 20, "replies": []}, {"body": "Says the pussy who can't fucking decide what to do. If I were you I wouldn't consider options at all unless you had an actual plan. Your DD is tier 1 shit posting at best", "score": 16, "replies": [{"body": "I fucking read this as a shitpost LOL cant even handle criticism ", "score": 2, "replies": []}]}]}, {"body": "F", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "G", "score": 8, "replies": [{"body": "G", "score": 3, "replies": [{"body": "Y", "score": 3, "replies": [{"body": "D", "score": 5, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "L", "score": 3, "replies": [{"body": "I", "score": 2, "replies": [{"body": "C", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Wait until it starts to bounce back. I could see this trending down further", "score": 6, "replies": []}, {"body": "If you actually want to make money however, buy AMZN calls. I personally like my 2019 January 2200 calls", "score": 4, "replies": []}, {"body": "They say it’s only polite to wait a year before the final yolo.  Godspeed yoloson", "score": 4, "replies": []}, {"body": "Sorry to hear my man. Can’t imagine. ", "score": 7, "replies": []}, {"body": "Do you think they’re bouncing back?", "score": 3, "replies": []}, {"body": "10/19/18 HCLP $10 calls", "score": 3, "replies": []}, {"body": "SBUX is negative for the year.... its a dump in the stores, the transgender employees are getting stuck with heroin needles while cleaning the baby changing stations in the free to the public restrooms.... they can't expand any more. People are tired of thier political stance and the ppl who voted for Trump are the ones with the money.... not the dems. If you put 100k into SBUX.... you gonna have a bad time. ", "score": 3, "replies": [{"body": "I am concerned about the public bathrooms. ", "score": 2, "replies": []}, {"body": "agreed\n", "score": 1, "replies": []}]}, {"body": "For large food and beverage companies like this, same store sales comps are the only thing that really moves the stock price. They just slashed next quarter comps to 1%, which is why the stock took a dump today.", "score": 2, "replies": []}, {"body": "Should have gone all in on MU 6/22 60s", "score": 2, "replies": []}, {"body": "Comcast calls. Not sure if you saw it already, but u/Volt52121 gifted us with godlike [DD](https://www.reddit.com/r/wallstreetbets/comments/8smsla/cmcsa_the_real_dd_you_can_buy_easy_2bagger_option/) \n\nMy condolences.", "score": 1, "replies": [{"body": "It seems that your comment contains 1 or more links that are hard to tap for mobile users. \nI will extend those so they're easier for our sausage fingers to click!\n\n\n[Here is link number 1](https://www.reddit.com/r/wallstreetbets/comments/8smsla/cmcsa_the_real_dd_you_can_buy_easy_2bagger_option/) - Previous text \"DD\"\n\n\n\n----\n^Please ^PM ^/u/eganwall ^with ^issues ^or ^feedback! ^| ^[Delete](https://reddit.com/message/compose/?to=FatFingerHelperBot&subject=delete&message=delete%20e11aj28)\n", "score": 1, "replies": []}]}, {"body": "bought otm 8/17 52.50C which are pretty much ITM AH... up 20%+ from just a day", "score": 1, "replies": [{"body": "Those sound way better than my 7/20 $55 calls...", "score": 1, "replies": []}]}, {"body": "Yeah how about make a better investment by giving me your dead wife’s money that would be the safest option to put money on", "score": 1, "replies": [{"body": "Venmo? ", "score": 3, "replies": [{"body": "@figgernaggot", "score": 2, "replies": []}, {"body": "@drilkmops", "score": 1, "replies": []}]}]}, {"body": "How did she die", "score": 0, "replies": []}]}
