{"title": "A Possible September Market Wide Pullback + 9 Options Analysis - Journey to $1 Million, Aug 31", "selftext": "# It is the last day of August, and today we need to review the seasonality of the markets going into September so we can be ready for it all. This is the first year that I have started to let data influence much more of my decision making, for better or worse.\n\n## What to expect in September?\n\nThe honest answer to this question is, it is anyone's guess. Let's be honest, there has been very little that is considered normal about this year and last. From inflation and tapering to Covid and Afghanistan, what could we possibly expect.\n\n[ VTI, or the total stock market ETF, clearly shows that in the past 10 years, September was the worst month.  ](https://preview.redd.it/oel8rujw7lk71.png?width=473&format=png&auto=webp&s=37c9223648070557956bdc70ac3cc684f9916f09)\n\n&#x200B;\n\n[ September for SPY, S&P 500, is tied for the worst month over the past 10 years.  ](https://preview.redd.it/f5v1w5ey7lk71.png?width=480&format=png&auto=webp&s=e8b1d11b48f74a6ec8de9c1ef7ca8f5a6b69a6e7)\n\n&#x200B;\n\n[ Same with DIA, or the Dow Jones.  ](https://preview.redd.it/b48bzqjz7lk71.png?width=466&format=png&auto=webp&s=9467df44f70ff9cb620a919e5d5f8f75b14f13f2)\n\n&#x200B;\n\n[ QQQ, or Nasdaq, is tied for the worst month with December. ](https://preview.redd.it/7oc4cxz08lk71.png?width=491&format=png&auto=webp&s=e28751d5e9cdf04ade3ae10c3e8de482dead23af)\n\nThe percentage numbers you are looking at represents what percent chance the stock/ETF has of finishing out that month positive, or with gains. So, over the past 10 years, VTI has a 44% chance of finishing September up, or a 56% chance of falling.\n\nObviously past performance doesn't indicate future results, but we are in the age of data and analytics, and I find it very interesting to consider this and use it as a lead when we are investing and trading.\n\n&#x200B;\n\n[ Do you remember last September? The Nasdaq fell almost 14&#37; in a three week time span. \\(Just imagine what this did to my TQQQ\\).  ](https://preview.redd.it/55ag30158lk71.png?width=1156&format=png&auto=webp&s=9409b8440115a2c99e9662c68a8262dc4bd5c86d)\n\nThere is nothing we can do but prepare for every outcome. This is why I have been taking profits, going smaller than normal, buying up safer positions (SCHD) and other things getting ready for the September dip. Am I selling everything? No. Am I prepared if we do dip? Yes. Keep some cash on hand, ready to buy the dip.\n\nWhy do the markets pull back in September/Fall? It is because investors are taking profits from hot summer tech stocks or growth plays that they had and are getting ready for a winter run. The stock market is seasonally cyclical. Money flows out of one sector and into another. That is a sign of a healthy market. As you can imagine some companies do better in the holiday season, leading up to Christmas. AMZN, TGT, WMT, DG? And others don't.\n\nThis is why I don't sell everything and run for the hills. Sometimes as investors we need to remember to take profits, and rebalance our portfolios. So from now on, let's do the rebalancing in August.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Possible Entries\n\n**EBON** is flirting with the 50MA again today and if you aren't already in the position, there is still a good chance. I'd go small and give yourself a month or two out in strike for the $2.50p.\n\nhttps://preview.redd.it/h6xzvfub8lk71.png?width=1156&format=png&auto=webp&s=34da8d7e1267c6321bb56b068cd3b7772cec8015\n\n**AI** is another short term put that I am interested in. It is more or less in the same classification as EBON as far as I am concerned. It looks as if we might get a confirmation candle tomorrow. Keep posted and go small.\n\nhttps://preview.redd.it/60bu1ntc8lk71.png?width=1156&format=png&auto=webp&s=dc57f73db5fdecef154bf790c5f9dd339aeda788\n\n**HD, Home Depot,** is one that I have been considering for some time now, but waiting for it to pull back to get better entry and thus justifying a bigger position. **HD** typically does well into the winter months, especially October and November, over the last 10 years according to Trend Spider's seasonality. While we are waiting for it to consolidate back to the 180MA, I think we can snag a short term call off of a VWAP support.\n\nhttps://preview.redd.it/04e8tqwd8lk71.png?width=1156&format=png&auto=webp&s=3821286fb99154b916b0ba0dae8799e1d60e1e62\n\n**TGT** is hanging out around the 50MA, and I picked up December $260 calls today. Last week we got into a position around the 50 which didn't go as planned. Let's see if we can get a better exit this time around. Overall, I like Target going into the holiday months however, it tends to struggle at the end of the summer. I'm going small on this one for now.\n\nhttps://preview.redd.it/msmjui7p8lk71.png?width=1156&format=png&auto=webp&s=16249119a81e229ecacc793616f13f31b18e7b36\n\n**DIS** is forming a long base and looks to me as if it wants to break out. More so it is flat along a big volume shelf. I'm considering a glass bottom around $173 and next time it drops to this level, I'll buy calls toward the EOY.\n\nhttps://preview.redd.it/hyot5qmq8lk71.png?width=1156&format=png&auto=webp&s=2fae85dc4fe74c7fce138ff4ae4a037525199e71\n\n**ABNB** is again on the list of alerts. Although it is playing with the YTD VWAP currently, I'm going to play it safe and give it more room to reach a upper resistance. Although this isn't as strong as the YTD VWAP, I would prefer to let it bounce up a little more.\n\nhttps://preview.redd.it/wfrpzcnr8lk71.png?width=1156&format=png&auto=webp&s=8973fad33b8b30db9dfdb287640b2c34d538770a\n\n**DAL** is one of those that I don't like. In fact, I don't really like any of the airline stocks. They have never been all that profitable, if at all. However, it is hard to ignore below $40. I'm not mortgaging my house for this one, but I believe we can catch a quick bounce.\n\nhttps://preview.redd.it/1j0zg1ts8lk71.png?width=1156&format=png&auto=webp&s=b646dc3973a444bd3534bf3aa990bd49dd097a48\n\n**T** , another Put position, has been doing horribly. I'll be waiting for a bounce either up into the red cloud, or wait longer for it to reach the 50MA. This is not one that I would own long term. I don't like this company. There is nothing good about it. Dividends? Not anymore.\n\nhttps://preview.redd.it/ehsx1c6u8lk71.png?width=1156&format=png&auto=webp&s=e064a6adf631c98ca077d7a36f4fa736702cbd55\n\n**TSM** is one I like long term. We missed our chance a few days ago, so let's see if we can get lucky coming up here.\n\nhttps://preview.redd.it/eeor4vev8lk71.png?width=1156&format=png&auto=webp&s=816c5a4dac29438f415fce90e4464f5495bcc35f\n\nI want to buy calls again for **F** when it hits 180 again. It looks like that is the new support. Unfortunately last week it blew out of the paralell channel that it had been trading in for over a year. I cannot say that I like the company all that much, but I think there is some upside to still be had with their new electric F-150.\n\nhttps://preview.redd.it/3qpuupvw8lk71.png?width=1156&format=png&auto=webp&s=036adfd80ebdba1bb63e7942529303b7a033195d\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# Weekly Positions Update:\n\n## Open\n\n[$TGT](https://twitter.com/search?q=%24TGT&src=cashtag_click) \\-5.45% (Calls)\n\n[$TTWO](https://twitter.com/search?q=%24TTWO&src=cashtag_click) \\-4% (Calls)\n\n[$EBON](https://twitter.com/search?q=%24EBON&src=cashtag_click) \\-6.44% (puts)\n\n[$SCHD](https://twitter.com/search?q=%24SCHD&src=cashtag_click) \\+0.37% (commons)\n\n## Closed\n\n[**$SOXL**](https://twitter.com/search?q=%24SOXL&src=cashtag_click) **+20**% (Commons) - Cut this one at 20% as I'll use the capital for other positions. However, I am still bullish long term.\n\n[**$AMZN**](https://twitter.com/search?q=%24AMZN&src=cashtag_click) **+30%** (Calls) - Cut at 30% profit as this was a high dollar position, so I am happy with the profit. Will consider reentering at a later date.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**For the month of August, I did all right at 8.64% as of today.** \n\nhttps://preview.redd.it/raj5cmqphlk71.png?width=635&format=png&auto=webp&s=d9b31d68ac78738833391974a1fbcdb57ed35cbb", "id": "peuy13", "created_utc": 1630369926.0, "score": 211, "upvote_ratio": 0.92, "num_comments": 75, "comments": [{"body": "Solid DD, I wish I could do more than just upvote.\n\nCareful of Disney.\n\nI'm a huge fan, but with Delta, look for Park and cruise ship announcements. Those are the golden eggs\n\nThey cut the dividend, but if they return it, expect a pop", "score": 25, "replies": [{"body": ">Careful of Disney.\n\nYes, but they are in talks about a possible sports betting deal https://www.investopedia.com/disney-dis-explores-deals-with-sports-betting-platforms-5199310", "score": 8, "replies": [{"body": "Trades like dog shit. Too many holdings because of ETF's.  I never like a company that keeps moving away from it's core roots. Gambling and sports is not something Disney should have ever ventured in.  Stick with the kids and giving those kids dreams and memories.  NTDOY is the new Disney.  They don't have a board loyal to profits.", "score": 2, "replies": [{"body": "You literally have no idea what Disney as a company encompasses, do you?", "score": 1, "replies": [{"body": "You literally have no idea how to invest or trade, do you?", "score": -2, "replies": [{"body": "Very mature", "score": 1, "replies": []}, {"body": "here some light reading for you:\n\nhttps://storage.googleapis.com/titlemax-media/1c8ace8f-every-company-disney-owns-13\\_pageversion-lg.jpg", "score": 1, "replies": []}]}]}, {"body": "Ever heard of ESPN...?", "score": 1, "replies": [{"body": "And it's bleeding cash.", "score": 1, "replies": []}]}]}, {"body": "Never bet against the mouse.", "score": 1, "replies": []}]}, {"body": "This is no where near solid DD.  LOL.  Its just someones opinion on a backward data and his trades dont even specify if hes buying or selling the derivatives.", "score": 6, "replies": []}, {"body": "Disney is one of the few I've taken puts out on. But it is not the Delta that has me worried atm. I've got too many friends in south America telling me that there is immune resistant strains popping up down there, and yeah it is gossip but Lambda and the Columbia strains have both shown increased immune resistance. \n\nI'm expecting that to be the cause of the next big market dump.", "score": 1, "replies": [{"body": "Living in Lima.  All bullshit.", "score": 0, "replies": [{"body": "What, exactly, is BS? The new strains? The vaccine resistance?...", "score": 1, "replies": [{"body": "That it is popping up and having increased immune resistance.  People here are trying to go back to normal. Getting vaccines, going to work, and carrying on with their daily lives.  You certainly don't here in the news that ICU beds are full, that lockdowns are needed, and all the other yada yada yada. And yeah the new strains.  Lambda was from close to day 1 of last year down here.", "score": 1, "replies": [{"body": "I'm not sure what there is to dispute about it \"popping up\". It's [the dominant strain in Perú,](https://nextstrain.org/ncov/gisaid/global) by a considerable margin, and present in many other South American countries.\n\nThe increased immune resistance is a more shake argument, but it still looks likely. [Here](https://www.forbes.com/sites/williamhaseltine/2021/08/10/it-is-time-to-pay-close-attention-to-the-lambda-variant-now-devastating-south-america/) is a decent (if a slightly alarmist title) overview of why it is probably able to avoid vaccine-induced immunity.", "score": 1, "replies": [{"body": "Using the word \"popping up\" implies something new and unexpected.  This is not the case.", "score": -1, "replies": [{"body": "Could you get me the official definition for that word?", "score": 1, "replies": [{"body": "[Sure](https://www.urbandictionary.com/define.php?term=Tool)", "score": 1, "replies": [{"body": "I'm going to guess either you have issues with using context clues, or you decided to give me your resume.", "score": 1, "replies": []}]}]}]}, {"body": "We have maybe 1/3rd of the world given a vaccination, and sadly viruses mutate. Although there is a school of thought that said that not locking down was the quickest way to get herd immunity and yeah some of those countries that did it that way do have a flatter infection curve now, although there is that initial death spike to take into account.", "score": 1, "replies": [{"body": "> Although there is a school of thought that said that not locking down was the quickest way to get herd immunity and yeah some of those countries that did it that way do have a flatter infection curve now, although there is that initial death spike to take into account.\n\nNot criticising you here, but it blows my mind that *anyone*, let alone national governments thought that was a good idea. Delta is one of the most contagious respiratory viruses known. It's like someone deciding natural herd immunity is the best way to stop the spread of measles, polio, or smallpox.\n\nAs to why these countries are seeing lower curves now, its probably because the most vulnerable have already been weeded out and the rest have antibodies against non-spike protein antigens that confers better protection in general, but at the cost of unmitigated initial exposure. It just frustrates me that we could have wiped this out altogether and instead we had some arrogant politicians deciding that their ego and immediate public image was more important than listening to experts and containing a pandemic.", "score": 3, "replies": [{"body": ">As to why these countries are seeing lower curves now, its probably because the most vulnerable have already been weeded out and the rest have antibodies \n\nPretty much that right there.  It is not near as scientific as I would like, but check out open IP Cameras in the places that decided not to shut down. There be much less grey hair in those countries now. \n\nI got to do the covid thing as a complication to major auto accident injuries and I say this from the bottom of my heart, getting t-boned by a big lifted pickup truck and having much of my left side turned to jelly was nowhere near as sucky as covid. \n\n\n\nThose were not pretty deaths those people had in the countries that did not lock down.", "score": 1, "replies": []}, {"body": "ETA: never mind it’s not worth the headache. I’ll just leave this though, smallpox death rate was ~30% it’s the deadliest disease in human history by a landslide. The others are not the flu & can be actually eradicated, because they don’t morph the same way. \n\nYou don’t get a polio or measles shot every year like a flu shot do you? There’s a reason for that. \n\nThe particulars of the debate of our response vs Sweden’s response is more complicated than I feel like debating. But the answer is somewhere in the middle.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Calls on spy.", "score": 32, "replies": [{"body": "How many times do we need to tell these old men. *Stonks Always Go Up*\n\nSPY 500 Calls!!!!", "score": 6, "replies": [{"body": "Do you see spy hitting 155+?", "score": -2, "replies": []}, {"body": "I have a dozen+ 6 hundo leaps. Now we wait 😏", "score": 1, "replies": []}]}, {"body": "EZ print", "score": 5, "replies": []}, {"body": "Sept 27th spy calls all day every day", "score": 1, "replies": []}]}, {"body": "Good job buddy. Thanks for the analysis. I like HD too. \nI'm tempted to buy spy puts but will start small position and build from there.", "score": 3, "replies": []}, {"body": "SEPTEMBER LET'S GO", "score": 2, "replies": []}, {"body": "Great content you provide us. To me, AT&T has been on a secular decline and will continue unless they implement some changes in management. Ford is in a tight spot because they are underdogs on this race to electrify. TSM has asymmetrical risk mainly due to their vulnerability to China. \nKeep up the amazing work.", "score": 2, "replies": [{"body": "I agree with T. I’ll catch some puts on a small bounce. F is an underdog but the media and white house act like they are leaders.", "score": 2, "replies": []}]}, {"body": "Wow… this all seems like very useful information but I have literally no fucking clue what any of it means. Where do I need to start from? Any helps would be nice", "score": 2, "replies": []}, {"body": "Thanks.. Hope TGT flies..my Nov 260 calls would love some action.", "score": 2, "replies": []}, {"body": "Classic trying to time market.. waiting for pullbacks, expecting big correction soon..", "score": 3, "replies": [{"body": "If you don't like posts about trying to time the market, then what the hell are you doing in /r/options?", "score": 8, "replies": []}, {"body": "Almost Hail Mary weeklies on UVXY season… after the next reverse split", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "So spy returns 10% a year on average, pretty nice, but he returned 8% in a month, that is over ten times Spy by the end of the year, even after capital gains tax it’s like 90%, I wouldn’t lecture him", "score": 5, "replies": [{"body": "\\>So spy returns 10% a year on average\n\nLets compare it to this year to make this a bit more reasonable.  Its up 22% YTD and nearly 30% over the past year", "score": -2, "replies": [{"body": "Hindsight op isn't it", "score": 1, "replies": []}]}]}]}, {"body": "Ehh we see these posts every week.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Your thesis is that smart money is moving into Utilities/Energy, which makes up about 5% of the S&P?\n\nEnergy sector is -8% and Utilities are only up 3% over the last 3 months.  Tesla has never had a valuation based on fundamentals, so why do you think that matters today?", "score": 2, "replies": []}]}, {"body": "I believe you are 100% correct about not just a pullback but I'd bet on absolutely catastrophic market conditions in September.", "score": -10, "replies": [{"body": "Catastrophic? \n\nWhere's the $ going to go ? \n\nCDs are paying %0.25 .... Whoopee. \n\n5% dip... Maybe. Catastrophic... No.", "score": 23, "replies": [{"body": "I'm not a doomer, but there is a lot of leverage in the market right now. If things start sliding, it could slide more as people rush to get out of margin positions, and then people's stop losses start triggering and you could have a correction pretty fast.\n\nIf it were all cash investment, yeah, there's no chance of a crash or diverting money out of equities to anything else. Credit, though, people need to liquidate or they could end up bankrupt.\n\nI think you still need some initial catalyst that causes the market to sell a little to start sending leveraged positions into a sell off though. Not a guaranteed crash this month, at all.", "score": 3, "replies": [{"body": "But that’s the buy the dip mentality next - once those stop losses are hit - sky rockets right back up because they closed margin positions and opened new ones haha\n\nI have +35 350puts and -35 349puts for 9/3 on spy average of .25", "score": 3, "replies": [{"body": "That's what I really wonder though. The economy is doing pretty well. If there's a pull back, there's a mountain of cash waiting to rush into stocks at lower prices... but then the prices will be right back where they started if they start buying, but with less leverage. Which might cause a lot of people to leverage up again, since margin debt is a lagging indicator. Like the first thing AAPL or any other big company will do is announce buy backs if there's a 10% or more pull back.\n\nSo... I think the paper handed that freak out when it gets low and sell will be the ones losing all the money in a pull back. I can't see how any big down turn wouldn't be met with intense buying. I think it could go down 10%, but would be back in a month or two.", "score": 7, "replies": [{"body": "10% is way to much I believe - but yup completely agree with everything else you just said haha", "score": 5, "replies": []}]}]}]}, {"body": "I'd refer to the market regulations that will be changing come sept 1st, as well as regulations that have passed over the summer. They've basically spelled out in plain words what they're expecting. I could be wrong but I've already structured my portfolio's accordingly.", "score": 5, "replies": [{"body": "What does that even mean ? 👀", "score": 13, "replies": [{"body": "100% GME", "score": 15, "replies": []}]}, {"body": "IYKYK", "score": 8, "replies": [{"body": "Lfg!", "score": 4, "replies": [{"body": "Buckle up!", "score": 3, "replies": []}]}]}, {"body": "Which regulations?", "score": 1, "replies": []}, {"body": "Have a link you could share?", "score": 1, "replies": []}]}]}, {"body": "If the market didn't catastrophically crash when the whole world literally stopped all business, nothing is going to crash it now when the world is back on the go. You need to get some perspective. This crash that everyone desperately wants is nothing more than a correction. If anything, if something does crash, it'll go back to slightly above the top of pre-pandemic levels.", "score": 1, "replies": []}]}, {"body": "So sad to me you waste your time on this. The first paragraph under \"what to expect in September\" is literally it.  \n\nThat's all you need. The rest is gambling.", "score": -7, "replies": []}, {"body": "Amazing input! Thanks so much, really helpful.", "score": 0, "replies": []}, {"body": "Any ideas on how VYM and DGRO tend to do during September?", "score": 1, "replies": [{"body": "Vym is super low volatile why does it matter", "score": 3, "replies": []}]}, {"body": "I sold my T when it hit 31 some months ago, and reentered it 2 days ago, hope you are wrong about it :P", "score": 1, "replies": []}, {"body": "Vix C25 15 Sep.. new and amateur. Opinions? I think because of swaps rollovers 09-16 September the marketing must react. In my opinion..", "score": 1, "replies": [{"body": "New and amateur + VIX. Classic!", "score": 2, "replies": [{"body": "Doing my best haha 😄", "score": 1, "replies": []}]}]}, {"body": "Markets gonna be more ugly than before", "score": 1, "replies": [{"body": "More ugly than what exactly? 20+% in 8 months?", "score": 1, "replies": []}]}, {"body": "Interesting", "score": 1, "replies": []}, {"body": "I've been burned buy calls for September in the past. Let's hope  I'm not wrong but puts this time.", "score": 1, "replies": []}, {"body": "What broker do you use?", "score": 1, "replies": [{"body": "I use WEbull", "score": 1, "replies": []}]}, {"body": "Says “can’t rely on past data” before relying on past data for the rest of the post lmao", "score": 1, "replies": []}, {"body": "Uhhhh calls on amazon got it", "score": 1, "replies": []}]}
