{"title": "PayPal heats up buy now, pay later race with $2.7 billion Japan deal", "selftext": "https://www.cnbc.com/2021/09/08/paypal-heats-up-buy-now-pay-later-race-japan-deal.html\n\nPayPal Holdings said it would acquire Japanese buy now, pay later (BNPL) firm Paidy in a $2.7 billion largely cash deal.\n\nPayPal also entered Australia last year, raising the stakes for smaller companies such as Sezzle and Zip Co.\n\nThe transaction is expected to close in the fourth quarter of 2021, and will be minimally dilutive to PayPal's adjusted earnings per share in 2022.\n\nPaypal continue to expand the acquisition mode by boosting up the moat to against other fintech companies. Buy now pay later will be a hot future trend so paypal immediately expanding the market share in this area. It proved after the separation from ebay, paypal can continue to grow the revenue and stay on top as a fintech leader.", "id": "pk3ct5", "created_utc": 1631074761.0, "score": 165, "upvote_ratio": 0.92, "num_comments": 73, "comments": [{"body": "Basically, PayPal let Affirm slip between their fingers and now they're trying to get their slice of the pie. All in all not a bad move *if* they can secure usage with popular sites. Affirm and Afterpay already have a big chunk of the market, so it'll be interesting to see where they try to go.", "score": 35, "replies": [{"body": "This guy/gal gets it.", "score": 4, "replies": [{"body": "As someone who worked on BNPL at PayPal a few years ago, it’s not that simple.\n\nAffirm, AfterPay, and Klarna dominate(d) the market and were difficult to take market share away from. Not to mention, PayPal became big about a decade ago as it was the default payment method on eBay. With eBay collapsing, PayPal had to find the next major retail/eCommerce sites to integrate with.", "score": 2, "replies": []}]}]}, {"body": "Welcome to the beginning of an economic correction.", "score": 51, "replies": [{"body": "I still don’t understand how the BNPL is a feasible model that will last. Seems like most would default on their payments.", "score": 35, "replies": [{"body": "Traditionally BNPL has been used successfully in a few ways:  \n\n* for products or deals that are so overpriced they can sustain some defaults, like As Seen On TV mail order things, or a furniture store that retails a cheap $500 sofa for $1500\n* when the payments have an included element of interest, like a $700 item being sold on terms of 3 quarterly payments of $300 each\n* when a zero interest BNPL becomes interest-eligible if it defaults\n\nAll are considered kind of predatory.  It's no surprising to see PayPal or eBay flocking to them, a little surprised to see Amazon.\n\nAlso don't understand why mature, large, capable companies are spending billions on what is effectively an operational feature they could just assign people in-house to implement for a cost of no more than 8 figures.  For Amazon, it's like they hired GoDaddy to host some pages instead of using AWS.", "score": 28, "replies": [{"body": "[deleted]", "score": 14, "replies": [{"body": "Data is overrated.  If you sell fridges, and you pay handsomely for my data, your number one insight will be that I'm a fridge buyer.  Then you'll waste tons of money trying to sell me a fridge because your data said I'm a fridge buyer.  But what your data won't know is I bought a fridge last week and you're wasting your money pitching me.\n\nNow extrapolate that across all the data they're supposedly paying for.\n\nSayings like data is the new oil sound deep, but they're just pithy.  At the end of the day, data is less important than having a customer, and having a customer is less important than having a sale, and having a sale is less important than having a *profitable* sale. \n\n But business is so hypnotized by ad agencies oops sorry I guess we call them \"tech companies\" now, that they're forgetting about what the core of their business really is, and what they need.\n\nAnyway, between Amazon and Affirm, I suspect Amazon has the better data already.", "score": -1, "replies": [{"body": "[deleted]", "score": 17, "replies": [{"body": "FYI, data plus 25 cents won't even buy you a quarter, because data is expensive to collect, and hoard.  And when it misleads you, which is often, it drains you. \n\nFB and Google are ad agencies.  They sell ads.  The ads don't need to actually work, they just need the suckers buying them to *think* they work.  \n\nYou could sell snake oil successfully as long as your buyers think it works.  Selling a lot of snake oil doesn't mean snake oil works, it just means the belief in snake oil is a lucrative way to sell it.\n\n> Your number one insight will be if you need more appliances, how many and for what price.\n\nTechnically that's three \"number one insights\" but ignoring that, they're also not that great insights.  I suppose if there were one that could actually determine if I need more appliances and how many (who needs a fridge right after they just bought one?  Some mass property landlord making up 0.05% of the addressable market?)  then you could tell your fridge making ad buyer that \"hey I've got a customer for you!\"  But here's the thing... they can already do that, and they do do that, all without the insight, and the ad buyer buys their ad, and the ad seller rolls in the money.  The example you offer doesn't really change what would happen in the real world.  It's like building a unicorn detector into the new canyonero.  It's fabulous, but has no real world application.\n\nThat covers the first two, but the third is arguably worse.  If I'm making fridges, and my ad company targets a customer who likes my fridge but wants to pay $1000 for it instead of $2000, how does that help me?  Is slashing my price to go negative margin that useful?  And it's not like that granular insight is going to spur me to invent a whole cheaper new invention for keeping things cold.  My company uses refrigerant and copper tubing and glass shelves and all that because that's how a fridge is made.  A customer wishing to pay less or pay more doesn't really change what I have control of.  And besides, I already have that insight on a more broad basis from the market research I did five years prior when developing my product road map.  If I'm trying to micro, no, nano-manage my product mix at literally the last possible second, then I'm running my whole company wrong... and why? Because my ad company has a bunch of data points on Joan Q Public, sole consumer.", "score": 5, "replies": [{"body": "This is a bad and inaccurate take. Brands are looking at far more metrics and variables than what you nonchalantly gloss over in your post.\n\nLocation, income, gender, age, search history, purchase history, comment history(w/ sentiment analysis), marital status, ethnicity and the list goes on and on. \n\nFor companies that sell ad space it’s all about their product, us. The better they ‘know’ us the more likely we are to click on the ad. More likely we click means we’re more likely to buy. More people that buy, due to better targeting, the more valuable we(their product) become to the brands.", "score": 4, "replies": [{"body": "Yours is a deluded and incorrect take.  The fetishization of marketing bullshit is real, and you are an active part of it, whether that's witting or not.  \n\nTurns out your gas tank doesn't care if you're a 5'3\" LQBTQ-allied latinx divircee.  You need fuel, and Exxon is on the corner.  \n\nSimilar with the aforementioned fridge.  People of all kinds need to keep foods cold.  Micro-analyzing them is largely marketing theater to make the client feel their ad spend is somehow worth more than it is.  \n\nWorse, when this data is misinterpreted and misapplied - which is often - it leads to counter-productive results.  When I got to buy a fridge and I'm offered one with a rainbow door and a salsa dispenser, all driven by hamfisted crowbarring of my silly and supposed data points, I'm *less* likely to buy their product, not more likely.\n\nIf you're a fridge company and your focus is on getting people to click ads instead of on making and selling fridges, you've lost your way.\n\nTo purpose an old saying: 97% of advertising is wasted money, now if only I could figure out which 97%.\n\nTest this yourself.  You click a lot of ads here on Reddit?  No?  Guess what, 99% of people say the same thing.  But someone somewhere is bragging to their boss that they sold those ads, and someone somewhere is telling her boss that she was brilliant for buying those ads, and her boss is impressed that she's \"connecting their eyeballs with impressions and building synergistic brand appeal among the desirable sociostratumerific target consumers\".\n\nThey're both bullshitting themselves, but since the system works out for each of them in the form of an annual bonus, nobody is too motivated to question or disturb the status quo.  Then, even uninvolved observers like you see it and assume that since it's always been that way, it must be the best way (an inherently conceited assumption) and thus you go out and endorse and fetishize it.", "score": 6, "replies": [{"body": "Lol ok", "score": -2, "replies": []}]}]}, {"body": "Fresh insights = downvoted into oblivion. I am sorry buddy. You strayed away from the narrative here", "score": 3, "replies": [{"body": "Data is the new oil, must say data is the new oil.  Must call all computer programs AI.  Must say all software is \"machine learning\".", "score": 2, "replies": [{"body": "Data is the new ^^^^^^^(snake) oil.", "score": 1, "replies": []}]}]}, {"body": "Just say you're wrong and move on bruv. Your opinion is NOT what we see in reality from PUBLICLY traded companies.", "score": 2, "replies": []}]}]}]}]}, {"body": "> Also don't understand why mature, large, capable companies are spending billions on what is effectively an operational feature they could just assign people in-house to implement for a cost of no more than 8 figures.\n\nBecause then they could lose money if people default on the loans. \n\nAnd any bad publicity BNPL services get would reflect badly on them and their brand to.", "score": 4, "replies": [{"body": "If the argument for outsourcing it is risk of the driving premise, then shouldn't *that* be the issue?  And then why buy the company that would presumably be owning the debt and suffering the default losses?\n\nBy your logic, the right strategy then is for Amazon to use in-house developers to do the fairly simple programming of the BNPL checkout branch, then sell the debts for any such transactions to a secondary market.  That way they get the feature, avoid wasting billions buying it, take in riskless revenue by auction, and avoid default risk along the way.", "score": 6, "replies": []}]}, {"body": "Like others have said, it is because of the data Affirm has. You need to be able to accurately infer whether or not someone is capable of paying off their debts. You need AI and data for that. It is much more than just programming BNPL into the checkout process.", "score": 3, "replies": [{"body": "I wonder if Amazon has any data on their customers and their customers' spending.", "score": 1, "replies": [{"body": "Not sure what you mean. Amazon knows their customers' spending habits obviously. But that is very different from knowing their financial health and ability to pay off debts.", "score": 4, "replies": [{"body": "And how do you suppose Affirm has accumulated that data on their shoestring but Amazon couldn't?  Or that Amazon couldn't just get an affordable subscription from one of the several CB's that are slashing their prices to undercut each other?", "score": 1, "replies": [{"body": "One because Affirm has been doing this since 2012 and they have worked with Walmart in the past.\n\nTwo because Amazon doesn't have access to their customers' credit data. How exactly could Amazon have accumulated any data in the first place? They would have to do credit checks on any person that buys anything from them.\n\nThree, Amazon has partnered with multiple companies besides Affirm to provide BNPL (e.g., on the Amazon branded credit card). So Amazon has a history of outsourcing  financial systems to third parties.", "score": 3, "replies": [{"body": "> One because Affirm has been doing this since 2012 and they have worked with Walmart in the past.\n\nAmazon has been in business far longer with orders of magnitude more customers and experience.  FYI, they also collect data.\n\n> Two because Amazon doesn't have access to their customers' credit data. \n\nI already debunked this.\n\n> How exactly could Amazon have accumulated any data in the first place? \n\nSame way that anybody else would, but bigger, stronger, better. \n\n> They would have to do credit checks on any person that buys anything from them.\n\nWell that's not true.\n\n> Three, Amazon has partnered with multiple companies besides Affirm to provide BNPL (e.g., on the Amazon branded credit card). So Amazon has a history of outsourcing financial systems to third parties.\n\nAnd a history of running them too.  We're not in 1997 anymore.  There are boundless choices.  You don't have to shell out billions for what is fairly basic functionality.  If they were getting some unique customers from it, or some unique capabilities, but they're not.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "They don't have to.  They could just make that one a literal pay later perk, and maybe ones over $50 get a certain offer, and ones over $200 something else.", "score": 0, "replies": []}]}]}, {"body": "They are small amounts not worth getting a bad credit rating for.\n\nThe service is useful so people want to keep their account in good standing.", "score": 1, "replies": []}, {"body": "So basically a credit card……..not sure the whole has fallen apart since the their creation.", "score": 1, "replies": []}]}]}, {"body": "Japan is still in a transitionary period from cash to digital, so acquiring these things now are pretty good. There are a lot of different cash apps like PayPay and LinePay, so we'll have to see how it goes though.", "score": 11, "replies": [{"body": "I think Paypay became Linepay when it all got merged into part of Z Holdings. And they're the obvious frontrunner in the market at the moment.", "score": 5, "replies": [{"body": "What about Merpay? I think I hear “Id” being used far more than PayPay or anything else. With Suica it’s hard to notice if people are paying with IC cards but I definitely hear the jingle for Merukari pay most", "score": 1, "replies": []}]}, {"body": "> Japan is still in a transitionary period from cash to digital\n\nCan you clarify this a little bit. How far along are they in comparison to say, United States, or China?", "score": 1, "replies": [{"body": "Very far behind the U.S. Some places still don't accept credit cards, even in Tokyo.", "score": 2, "replies": [{"body": "Wow that is very surprising. Just out of curiosity do you have a guess as to why they are so behind? Is there some kind of cultural aversion to digital payment or credit?", "score": 1, "replies": [{"body": "There has never been a consumer push to go cashless, and so merchants feel no need to run cashless options that would just bleed them money if no one's really asking for it. For example, a popular family restaurant chain called Saizeriya still demands cash. As I said though, it's changing, so we'll likely see a big jump in the next decade.", "score": 1, "replies": []}]}]}]}]}, {"body": "This is why Kredivo (APCB) is worth at least a look. Literally all the fintech giants - Square, Paypal, Visa, Mastercard, Klarna, etc. - are looking into BNPL, and they have shown that they'd often rather do acquisitions than develop the capability organically. Kredivo is very successful in Indonesia and off to a good start in Vietnam, markets that none of the Western fintechs are particularly strong in (although Afterpay was already looking at developing their SEA market).", "score": 5, "replies": [{"body": "APCB or VPCB? because apcb doesn't exist and VPCB is still at SPAC price of 10", "score": 1, "replies": []}]}, {"body": "Where payday loans meet big tech.", "score": 18, "replies": [{"body": "BNPL schemes don't always charge interest.   I use sezzle to buy stuff sometimes and I like it.   Spread the payment out and it costs me nothing.", "score": 8, "replies": [{"body": "Right. Huge effing difference.", "score": 5, "replies": []}, {"body": "Payday loans in my country charge no interest and fees if you pay it back within 2 weeks", "score": 3, "replies": []}]}, {"body": "Whoa... Do not compare the two. I am an affirm user. They flat out give you the price up front (usually better than what a CC rate gives you) and most the time it is a same as cash transaction that sits for 6 months to 48 months. Where as a payday loan is predatory lending that charges over 100% in a matter of weeks against what you originally borrowed. \n\nAs it stands right now there is a very fine and clear distinction between the two. (Also goes with others such as Linepay)", "score": 7, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "The amount of money in the system is really insane right now. I might get down voted for being out of touch but a million dollars ain’t shit anymore I’m terms of personal finance", "score": 5, "replies": [{"body": "You can gladly write me your puny million.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Exactly, they can access that money via low interest loans anytime. What’s a few hundred k at 1.5% when your house has that much equity", "score": 1, "replies": []}]}]}]}]}, {"body": "ELI5: Why is buy now pay later popular? Are there really that many people who are so irresponsible that they'd buy something they can't afford without payments? And that something is not a car or mortgage?", "score": 10, "replies": [{"body": "> Are there really that many people who are so irresponsible that they'd buy something they can't afford without payments?\n\nHave you met people?", "score": 12, "replies": [{"body": "Yes. But no one in my circle does this.", "score": 0, "replies": []}]}, {"body": ">Paidy, then, is unusual among the world’s buy-now-pay-later providers because it allows Japanese consumers to purchase items online and pay them off each month in person at local convenience stores.\n\nNot exactly answering you question but paidy seems to be doing something unique..... this model allows people to buy online without the hassle of online payment", "score": 7, "replies": [{"body": ">  the hassle of online payment\n\nWhat hassle?", "score": 7, "replies": [{"body": "It maybe backwards in your country. A lot of people of skeptical online fishing frauds and stuff which scares away people from online payments which in turn hurts adoption rates of online shopping. (I shouldnt have used \"hassle\")", "score": 5, "replies": [{"body": "Fair enough. My impression of Japan is that they are doing well with going cashless, but I could be wrong. Based on different generations I suppose.", "score": 2, "replies": [{"body": "Cashed based payments currently dominate in japan. although digital payments are on the rise", "score": 2, "replies": []}]}]}]}, {"body": "Hassle of online payment? But paying in person is less hassle?\n\nThis is backwards.", "score": 2, "replies": [{"body": "The article says they can go into a shop and pay, or via a bank transfer so seems like both. Doesn't seem unique. Not sure what the other guy is talking about", "score": 3, "replies": []}, {"body": "It maybe backwards in your country. A lot of people of skeptical online fishing frauds and stuff which scares away people from online payments which in turn hurts adoption rates of online shopping. (I shouldnt have used \"hassle\")", "score": 3, "replies": []}]}]}, {"body": "Because when cash is that cheap, you take it. Your money being liquid is more valuable.", "score": 4, "replies": []}, {"body": "Try the product at you will see. \n\nI bought a pair of sneakers on Nike.com about a year ago. They were $100. I could easily afford $100 at the time of purchase, but I had the option of BNPL with PayPal AND my funding source of my PayPal account was my chase rewards card. With my chase credit card bill funded with autopay from my checking account, I knew I could spread the $100 across four payments (eight weeks), continue to earn travel points on my card, not miss a payment, all the while I could use the $75 in the market and theoretically earn an average of 8% return on the borrowed money.\n\nSo to counter your question if BNPL is popular due to people who can’t manage their money, I would say that BNPL is a perfect payment structure for people who handle their money extremely well.", "score": 3, "replies": []}, {"body": "I buy stuff I can afford over 3-6 months because why not? Amazon have been doing interest free over 5 months and I always do it when it's available. Less money upfront, can use that money somewhere else. \n\nObviously a lot of people who can't afford things straight up are using it too. Want to buy the latest macbook or iphone? Well this is perfect for them. You're more likely to be able to afford it over 5 months rather than in 1 go. Buying a new macbook pro outright is a big chunk of most peoples paycheck, even if you are a high earner, but over 5 months+? Far more manageable.", "score": 2, "replies": [{"body": ">can use that money somewhere else. \n\nYou can, but i doubt you do.", "score": -2, "replies": [{"body": "I do, I put it in the stock market.", "score": 6, "replies": [{"body": "Gamma up is gamma down. You’ll need the money eventually", "score": 1, "replies": [{"body": "Of course, it's not free money, it's just delaying the payment. I can get that money from a future payslip, or maybe by the time I need it, it's made more money in the market.", "score": 3, "replies": []}]}]}]}]}, {"body": "I use the bnpl on paypal whenever im able to.... assuming you have the ability to not go overboard why wouldn't you? \n\nI typically run my bank acc low around 1k as i have most of my money invested. If i want something for $100 and i can pay 25 every 2 weeks for 8 weeks whats the downside? I know i will never default on the payment as i have it pay on my CC with a 5k limit.  Which i pay to 0 every month so i dont even get charged interest on that either. \n\nIf used well and you dont default on your shit its an awesome feature to lower your upfront payments in case an emergency comes up.\n\nEdit: typo", "score": 2, "replies": [{"body": "Bingo! I had a very very similar comment and experience to you!", "score": 1, "replies": []}]}, {"body": "Yup, welcome to capitalism. Probably every cashier, burger flipper, and other low level worker you can think of. Even Apple offers bnpl programs for their laptops and phones.\n\nYou don’t have to be irresponsible to use it, of course. These give you the opportunity to make interest on the money you would have spent on the product in the market instead for example. \n\nOf course, I admit i have never used bnpl for any purchase…", "score": 1, "replies": []}, {"body": "I've used it once when I had the money for a somewhat large purchase but didn't want to use all that cash at once. With no interest its just another tool you can use but I definitely think it preys on those who can't say no", "score": 1, "replies": []}]}, {"body": "This comes on the heels of Axe Cap acquiring Plaintiful over the weekend.", "score": 4, "replies": []}, {"body": "“Buy now pay later will be a hot future trend” ugh? Have lines of credit not been a thing forever.", "score": 9, "replies": [{"body": "you dont get it, credit is a hassle PL is not, imagine robinhood", "score": 0, "replies": [{"body": "People who can’t get credit will now be able to access this pseudo credit — poor people about to get caught in a trap", "score": 3, "replies": []}]}]}, {"body": "I have today bought lot os Square stocks. Square is the king", "score": 2, "replies": []}, {"body": "> PayPal also entered Australia last year\n\nAustralia has had PayPal for two decades. They launched Pay in 4 two months ago.", "score": 2, "replies": []}, {"body": "Can PayPal execute? They r losing to Wise already", "score": 1, "replies": []}]}
