{"title": "When you buy APPLE right before the news come out.", "selftext": "", "id": "plxqy3", "created_utc": 1631322726.0, "score": 493, "upvote_ratio": 0.94, "num_comments": 77, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|100|**First Seen In WSB**|1 month ago\n**Total Comments**|363|**Previous DD**|\n**Account Age**|7 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Never, ever buy AAPL right before major announcements. No matter what they are—good, bad, random, record revenue, regulatory impact—the stock always goes down. THEN you buy.", "score": 99, "replies": [{"body": "Exactly... And when it drops it gives you a lot of time to buy because it doesn't really back very quickly after a big drop", "score": 28, "replies": []}, {"body": "Didn’t the GUH dude buy puts before AAPL earnings with that logic and get fucked?", "score": 7, "replies": [{"body": "That’s exactly what he did up to his level of personal risk tolerance.", "score": 3, "replies": []}]}, {"body": "When I saw AAPL making a downtrend I was like. Something wasn't right so I just held off onto buying options for a bit because most of NASDAQ was positive, Until when the news came out it just flopped so hard too where it dropped the 17 RSI level at 148.8 I just started buying calls.", "score": 5, "replies": []}, {"body": "After which dip we buy? 1st, 2nd or ?", "score": 2, "replies": []}, {"body": "monday or tuesday?", "score": 0, "replies": []}, {"body": "Wouldn't it be better to buy the stock while it's going down, because then you'll be spending less money on each stock? I'm kinda new", "score": 0, "replies": [{"body": "make sure you always buy high sell low.", "score": 9, "replies": []}, {"body": "If you have to ask you shouldn't be here lol, try r/stocks", "score": 6, "replies": []}, {"body": "If you want real advice, don’t ask on this sub everyone is dumb here. Watch this: https://youtu.be/VI_riscmviI\n\nHe’s a former hedge fund manager who’s currently in jail but his YouTube lectures are pretty good and easy to understand. It’ll teach you the basics.", "score": 2, "replies": []}]}]}, {"body": "When the pills don’t increase size, blunt force trauma will swell that right up for you!", "score": 33, "replies": [{"body": "Shoulda invested in PFE… oh wait", "score": 3, "replies": []}, {"body": "![img](emote|t5_2th52|4270)", "score": 1, "replies": []}]}, {"body": "This video should come with a warning label", "score": 19, "replies": []}, {"body": "Its just an overreaction. Itll gap up on Monday lol", "score": 18, "replies": [{"body": "Unless we get a correction. Which is likely tbh.", "score": -3, "replies": [{"body": "Lmao yall been saying the same thing for almost a year….", "score": 12, "replies": [{"body": "Correction come almost every year. Remember that bear market and correction is 2 entirely different things. Also Nasdaq already had a correction this year, so it's actually more likely that Nasdaq doesn't get one. But S&P500 is due for one.", "score": -2, "replies": [{"body": "Nasdaq is still up , tech sector has been running for months , yall can go ahead and wait for a correction lol", "score": 2, "replies": [{"body": "Still doesn't change the fact that nasdaq went down 10% or so from top to bottom earlier this year. People do have really short memories it seems. And that is actually a good thing, cause after the correction was over we have had smooth sailing from there. But S&P500 and DOW in particular has me more concerned.", "score": 1, "replies": [{"body": "Its still going to gap up on Monday", "score": 1, "replies": [{"body": "It very well could. I would call that more of a bull trap than anything else.", "score": 1, "replies": [{"body": "Yup the market’s been bull trapping for almost a year now", "score": 1, "replies": [{"body": "Well i still think end of year SPY will be higher than today. But I think we will get about a 10% correction, before that which is 100% normal.\n\nWe really are in bubble territory when the market has been running 10 months straight and people still don't think we will get a correction when it statistically happens almost every year and we are in the statistically worst month of the year and October is not much better.", "score": 1, "replies": [{"body": "Lolol keep thinking , it’s not gonna happen. The fed wont allow it , not till tax season start which is next year", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "God I hope this is true lol. Have a long call $160 call for 1/21/22 and have been selling short weeklies against it but I need my long call to be ITM too to not lose money lol.", "score": 1, "replies": [{"body": "People can say whatever they want, i just gave up on buying puts in this market a long time ago.", "score": 2, "replies": []}]}]}, {"body": "I bought $300,000 worth before close", "score": 15, "replies": []}, {"body": "Ow, my balls!… ow, my balls!… ow, my balls!", "score": 9, "replies": []}, {"body": "what did you expect? aapl been running for 3 months straight", "score": 18, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Back in the early 2000s Apple almost went bankrupt.", "score": 1, "replies": [{"body": "Please tell us more...", "score": 2, "replies": []}]}]}]}, {"body": "I bought it right before it came out, since then I’ve liquidated my entire portfolio and I’m not trading anymore", "score": 7, "replies": []}, {"body": "I wish I could give this 100 upvotes", "score": 7, "replies": [{"body": "In the next episode, having completed their training, they break these bricks with their Dong*.\n\nHaiiiiiyaaaaaaaa", "score": 2, "replies": []}]}, {"body": "oh my buddha, why?", "score": 4, "replies": []}, {"body": "The good old golden egg training.", "score": 5, "replies": []}, {"body": "Does this have potential to become an Olympic sport?", "score": 4, "replies": []}, {"body": "That’s that good ol wu shu", "score": 2, "replies": []}, {"body": "dis kills d balls", "score": 2, "replies": []}, {"body": "These guys are the official WSB mascots.", "score": 2, "replies": []}, {"body": "Are they just standing on a random street corner slamming their nuts?", "score": 2, "replies": []}, {"body": "U/savevideo", "score": 2, "replies": []}, {"body": "Ah the incel martial arts, such skill to abuse the incel's most worthless muscle. So majestic.", "score": 2, "replies": []}, {"body": "I sold Apple around 145. Sure i missed out on some gains, but you can never hit the top and i knew it was gonna drop eventually, since S&P 500 haven't had a correction this year yet. Apple is the market, so a correction means Apple will also see a correction.", "score": 0, "replies": []}, {"body": "Lmao can someone link me the original without the logos please", "score": 0, "replies": []}, {"body": "Guh", "score": 1, "replies": []}, {"body": "Anyone have link for the original?", "score": 1, "replies": []}, {"body": "This comment has been removed to protest the upcoming Reddit API changes that will be implemented on July 1st, 2023. If you were looking forward to reading this comment, I apologize for the inconvenience. r/Save3rdPartyApps", "score": 1, "replies": []}, {"body": "You've captured the events of my trading day very accurately", "score": 1, "replies": []}, {"body": "Bruh...", "score": 1, "replies": []}, {"body": "He’s wearing a cup", "score": 1, "replies": []}, {"body": "eggs made of steel", "score": 1, "replies": []}, {"body": "What am I watching?", "score": 1, "replies": [{"body": "Are they trying to not have kids, cuz that's how you don't have them.", "score": 1, "replies": []}]}, {"body": "See this is what you have to do when you go get an education", "score": 1, "replies": []}]}
