{"title": "Will market see the most epic crash soon?", "selftext": "Peter Shift and The big short Mike Burrey are calling it that we will see the worst market crash in history. Most market analysts are calling bear market next year. One analyst I follow is calling bear mkt Q3/Q4 this year. We know fed will raise rates few times this year. This is also mid term year. Russia isn't stopping the attacks anytime soon. Expect food shortage due to lack of fertilizers that come from Ukraine / Russia. Russia also have a chance to default this month. We have high energy prices and Biden admin has no fcking clue how to battle raising prices. So... Not looking so great for overall market and nothing positive for bulls. Are you staying invested or taking all out and sit on cash? Even though i am down heavily with some growth names, but if I can avoid - 50% or greater draw down, I might drink some vodka and hit sell buttons. What's your thoughts and game plan for this year?", "id": "u5zoz8", "created_utc": 1650239920.0, "score": 0, "upvote_ratio": 0.3, "num_comments": 68, "comments": [{"body": "It's stupid posts like this I swear...", "score": 87, "replies": [{"body": "It starts off as Peter “Shift.” What did you expect after that?", "score": 6, "replies": []}, {"body": "Makes you want to put them through a wall and then delete Reddit doesn’t it lol! Believe anything the media tells em…", "score": 14, "replies": [{"body": "Or worse yet it’s blatantly manipulative.  I’m always suspicious with these posts in this market probably a heavy short position", "score": 19, "replies": [{"body": "I wouldn't be surprised.  The hedgies started paying attention to Reddit after the whole diamond hand/ ape thing from that other subreddit.  More importantly, a lot of normies heard about this reddit thing with these idiots making bajillions.\n\nI would imagine all of the big money mangers have at least one person on the payroll paying attention to us.  It wouldn't be far fetched to assume they've at least tried to influence opinion around here.", "score": 2, "replies": []}]}]}, {"body": "At this point just buy calls whenever you see these posts right?", "score": 7, "replies": []}]}, {"body": "My game plan is to buy the dips while fools sell out due to fear.", "score": 19, "replies": [{"body": "Same here! Even if I buy a “dip” and it goes further down I’ll buy some more too. It doesn’t hurt to lower your average.", "score": 3, "replies": []}]}, {"body": "No", "score": 12, "replies": []}, {"body": "I have a little more faith in the markets. Plus saying that we will see a crash bigger that 29 is extremely bold.", "score": 17, "replies": [{"body": "Didnt really Say bigger, Just more Epic, its gonna be fun Watch all the panic online", "score": -3, "replies": []}]}, {"body": "I’m buying more. 🤷🏿‍♂️", "score": 18, "replies": []}, {"body": "No.  You didn’t hear?   It’s Bull from here on out.  What a ridiculous post.", "score": 17, "replies": []}, {"body": "Can you explain why you take Peter Schiff seriously? What's his credibility based on for you?", "score": 19, "replies": [{"body": "*shift\nAccording to OP", "score": 2, "replies": []}, {"body": "I mean he did call the 2008 housing bubble with extreme accuracy more than 2 years before it started falling apart. I don’t think he’s ever really been “wrong”, but he’s certainly had bad timing.", "score": 1, "replies": []}]}, {"body": "Imo Better buy as much as you can. After 5yrs you will regret for not buying this discounts.", "score": 5, "replies": [{"body": "Why would i buy at the top?", "score": 2, "replies": []}]}, {"body": "Oh god, here we go…", "score": 16, "replies": []}, {"body": "Just buy on the drawdown you goon, you’re giving yourself anxiety for no reason pondering the unknown. DCA on the way down and thank yourself later (3-5 years).", "score": 10, "replies": []}, {"body": "Nobody knows. Does your investing or trading system depend on knowing what will happen?", "score": 4, "replies": []}, {"body": "I thought it was happening last week!  Or may be the week before... wait, I think I read about a crash a few weeks before that!  ...and then a week before that too...", "score": 3, "replies": []}, {"body": ">Peter Shift and The big short Mike Burrey are calling it\n\nSchiff and Burry have been calling things a bubble for forever. They point out glaring issues that people should be aware of... but don't rely on them to time the market.", "score": 11, "replies": []}, {"body": "Everything you have explained is priced into the market. \n\nThe market will only crash if something that nobody sees coming scares the shit out of everyone and it’s the end of the world.\n\nYour problem is your in tech, the bull run at the moment is in energy and commodities. Tech will recover but you just have to hold on and wait. \n\nDon’t stress over the market crashing, the people you mentioned call for crashes all the time. \n\nJust relax.", "score": 4, "replies": []}, {"body": "market crash is unlikely to happen. all crashes usually involve liquidity issues.\n\nEarnings will mostly drive the stock markets. It's reasonable to assume most companies will be making less revenue or slowing in revenue growth when the US Federal Reserve does QT. \n\nCompanies saddled with high debt and piss poor balance sheet will be the ones to get hit first.", "score": 6, "replies": []}, {"body": "The second I read a story about how Peter Schiff and Michael Burry think the market is about to go through the roof in an unprecedented economic boom, I'm building a bomb-shelter.", "score": 8, "replies": []}, {"body": "I would say “no”.  Unless it’s yes.  But for it to be an epic crash something has to happen that either hasn’t happened yet or is not widely understood - ie black swan.   \n\nThere are some contenders for sure and I believe we are in a precarious place.  If some kind of black swan event does occur we could be in for an epic crash.  But as of this moment there is nothing to make me think we are definitely headed for a “biggest crash ever” kind of thing.", "score": 3, "replies": []}, {"body": "I hope it crashes I will invest 1 million in the S&P 500", "score": 3, "replies": []}, {"body": "I tried to time the market a few times. I was sure a trump victory would look bad for the economy and social trouble. Also that we were \"long overdue for a bear market\".\n\nIf everybody expect a recession, it might never come. I see all the reason it SHOULD! But the market can stay irrational way longer. \n\nIf the market crash, I have to plan to get some cash to invest but in the meantime, I'll invest regularly without too much thinking. \n\nNothing Ling term was built by a bear", "score": 8, "replies": []}, {"body": "Are you an investor or day trader? Unless you think it’s the actual end of the world a long overdue market correction will allow you to lower your cost basis/average down and provide greater ROI down the road versus constantly buying in here now at the top, it all depends on your perspective. You will pay more in capital gains liquidating now than you would “lose” and regain over time just riding it out. Think of it as a fire sale lol buying the dip is good for your long term", "score": 5, "replies": []}, {"body": "If you see some news from East Europe like Putin is outsted you will get unexpected. However, to rebuild a country or break Russia up into several countries installed the like democratic mind politician that can get us into a recession. If you see a prolonged war and more suffering or use of nuclear weapon to show who is in control I will expect a serious blow.\n\nI only plan a more conservative portfolio to reduce more loss. YTD is -6.2% so far.", "score": 2, "replies": []}, {"body": "If it was for sure wed be down further right. \n\nIts kind of thst simple. Who knows. What are your willing to risk to lose or gain\n\nDont worry about analysts. Your wasting your time", "score": 2, "replies": []}, {"body": "Wow two people you’ve heard of whose name you can’t spell are calling for a crash? ONE analyst you follow says a bear market this year! Get on TV man, everyone needs to know now!", "score": 2, "replies": []}, {"body": "i'm looking for a correction below 4,000 on the S&P 500 and here are my reasons why....\n\n[https://www.reddit.com/r/stocks/comments/u5tn5b/market\\_multiples\\_and\\_valuations\\_the\\_sp\\_500\\_is/](https://www.reddit.com/r/stocks/comments/u5tn5b/market_multiples_and_valuations_the_sp_500_is/)\n\nMy game plan is to play defense, hunker down and deploy my cash once the S&P breaks 4,000.", "score": 2, "replies": []}, {"body": "The whole world is expecting a crash and the market doesn’t crash when people expect it. So i think maybe another year or two. Probably going to be flatish for the next few years.", "score": 2, "replies": []}, {"body": "The S&P is down 8.8% and the Nasdaq is down 17.6%. I see them going down to 25% and 50% respectively with all the shenanigans taking place in the world. Just wait out the carnage, don't pay attention to your stocks (unless you own ones that could go to zero lol). Go out for a walk, hit the gym,  play with your kids, watch a movie with your significant other. If you have no s/o, browse some porn.\n\nHaving said that, I don't know much about that Peter Shift guy, but it looks as though he's an alarmist.. As long as the beer trucks are making their deliveries, things aren't so bad..", "score": 3, "replies": [{"body": "Why can’t single people watch movies too you jerk. You think we’re all lotioned up porn freaks. I’m ashamed of you (jokes)", "score": 1, "replies": [{"body": "Lol", "score": 1, "replies": []}]}, {"body": "It's 'Ukraine' and not 'the Ukraine'\n\nConsider supporting anti-war efforts in any possible way: [[Help 2 Ukraine](https://help2ukraine.org)] 💙💛\n\n[[Merriam-Webster](https://www.merriam-webster.com/dictionary/Ukraine)] [[BBC Styleguide](https://www.bbc.co.uk/newsstyleguide/u)]\n\n^(Beep boop I’m a bot)", "score": -2, "replies": [{"body": "The Ukraine", "score": 2, "replies": [{"body": "It's 'Ukraine' and not 'the Ukraine'\n\nConsider supporting anti-war efforts in any possible way: [[Help 2 Ukraine](https://help2ukraine.org)] 💙💛\n\n[[Merriam-Webster](https://www.merriam-webster.com/dictionary/Ukraine)] [[BBC Styleguide](https://www.bbc.co.uk/newsstyleguide/u)]\n\n^(Beep boop I’m a bot)", "score": 1, "replies": [{"body": "The Ukraine", "score": -2, "replies": []}]}]}]}]}, {"body": "So, how about it now boys and girls, are we still optimistic about the market given that fed will hike rates more aggressive than anticipated. This market is honestly hinged on fed. Even with a good ER, gain only lasts a day or two and then evaporate with market being down. I personally still hold S&P500 etfs and some of top growth names (down severely). I do expect to go down further, but as Tommy Lee @ fundstrat said, this year will be very volatile but S&P will still hit ATH this year. He thinks once we are out of the mid term and fed overshot inflation measures then we may have slingshot gain... I like Tom and he is one person I trust from CNBC but I remain skeptical.", "score": 1, "replies": []}, {"body": "ima just DCA into ADA", "score": 1, "replies": [{"body": "ADA being a stock?", "score": 2, "replies": []}]}, {"body": "I hope the fucker crashes. Looking for cheap stocks", "score": 1, "replies": []}, {"body": "Yes it will crash. It could be this week, this year, or in the next 5, 10, or 20 years.", "score": 1, "replies": []}, {"body": "No. There is no evidence and threads such as these are all too common. \n\nDuring a \"crash\", AMZN will still be selling goods, MSFT will be selling software and people will still be searching and storing in GOOG. Their DCF value will not be where you imagine the crash will take us.\n\nBuy and hold.", "score": 1, "replies": []}, {"body": "Sure, the market is going to drop 50% because the fed raise the rates 2%. /s", "score": 1, "replies": []}, {"body": "40% cash gang wishing I was 80% right now!", "score": 0, "replies": []}, {"body": "It’s the ever changing generations that keep people like Peter Schiff in the money. This guy was spouting the same nonsense 15 years ago when I first got into accumulating assets. His big troll was gold, which I like so he caught my ear for a hot minute.", "score": 0, "replies": []}, {"body": "Kinda agree. Big boys and whales have already got out of this market between Nov 21-Jan 22. Thats why you have low volume pump and dump these days.  \n\nThings are gonna be very volatile this year. JPowell is gonna increase the rate 0.5% on May 5th. I think there  is no chance of ATH this year. If inflation doesn’t peak and  reaches 9-10% then the fed may be forced to do 0.5% every FOMC and that will kill stocks pretty bad", "score": -3, "replies": []}, {"body": "The next stock i buy next week", "score": 1, "replies": []}, {"body": "I’ll be buying more", "score": 1, "replies": []}, {"body": "The market is an exchange. I assume any talking head on TV is trying to get me to buy or sell because it helps their position. I would treat everything you hear from anyone about any market as information warfare. \nLet me put it this way, would you believe everything that a car salesman tells you when you’re in the market to buy or sell a car?\n“Oh but they made their clients tons of money”, yeah, and how do you think they did that?", "score": 1, "replies": []}, {"body": "The end is ny!! Here ye here ye!!", "score": 1, "replies": []}, {"body": "Leave us alone with your doomer Trolling.", "score": 1, "replies": []}, {"body": "It will collapse 100%", "score": 1, "replies": []}, {"body": "Remember burry shorting Tesla? How’s that work for him??", "score": 1, "replies": []}, {"body": "I think we will see a slight downturn before summer, stagnant through summer, and then reassess.", "score": 1, "replies": []}, {"body": "sounds like you're about to lose money. have fun! I might even buy something because of this post.", "score": 1, "replies": []}, {"body": "All the parrots here will shit their pants when their life savings are reduced by 80% on a Putin nuke.", "score": 1, "replies": []}]}
{"title": "Real inflation numbers. 50%", "selftext": "", "id": "u5bscr", "created_utc": 1650157354.0, "score": 273, "upvote_ratio": 0.94, "num_comments": 67, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|4|**First Seen In WSB**|1 year ago\n**Total Comments**|1093|**Previous DD**|\n**Account Age**|8 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=u5bscr)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=u5bscr)", "score": 1, "replies": []}, {"body": "Maybe in 1990", "score": 77, "replies": []}, {"body": "Your can drinks used to be 50 cents?!? Where do you live? 1950?", "score": 38, "replies": [{"body": "Prob a work vending machine", "score": 15, "replies": [{"body": "A cheap af one", "score": 9, "replies": []}]}, {"body": "The CFO owns the vending machine and keeps it stocked", "score": 2, "replies": [{"body": "Uh oh, this means company coffers are drying up, then...", "score": 0, "replies": []}]}]}, {"body": "Dollar Tree increased everything to $1.25\n\nThat's at least 24%", "score": 46, "replies": [{"body": "Dollar Tree isn't exactly the kind of place you do your regular shop though, so I wouldn't look at them when attempting to guess the inflation rate over using the actual numbers.", "score": 1, "replies": [{"body": "You do if you like to buy only things that cost a $1.25!!!", "score": 1, "replies": [{"body": "Some things are just best to be bought there. I went yesterday and got two full tubes of name brand toothpaste, literally $2 less than walmart, and tealight candles, which come 20 to a package at $1.25, also about $2 less than anywhere else. They have full loaves of decent bread, cheapest prices on some pop, aluminum foil, candy, etc.\n\nSome of the things are a ripoff though. Like two bites of Jack Links jerky for $1.25. You just have to watch and compare because the whole store is a mixed bag.", "score": 2, "replies": [{"body": "All about the price/volume on the tag, some things appear cheaper but really aren't because the volume you get is less. I think it's law around here that the shelf tag has include the unit pricing.", "score": 2, "replies": []}]}]}]}]}, {"body": "Less than a penny", "score": 39, "replies": [{"body": "I fucking get it now", "score": 1, "replies": []}]}, {"body": ".75 cents?  How will they make change when I pay with my penny?  Nevermind I’ll take 10,000 please.", "score": 39, "replies": [{"body": "The same thought was in my mind", "score": 8, "replies": []}, {"body": "Mandolin in the coin slot", "score": 1, "replies": []}]}, {"body": "0.75 cents is incredibly cheap! You can get 133 drinks for a dollar!", "score": 17, "replies": []}, {"body": "I went to Dollar Tree and paid $1.36 for something that used to cost $1.06.", "score": 16, "replies": [{"body": "gross", "score": 1, "replies": []}, {"body": "Everything now $1.25", "score": 1, "replies": []}]}, {"body": "Damn Cramer was lying!", "score": 7, "replies": []}, {"body": "Cheap", "score": 9, "replies": []}, {"body": "Back in the day when the dollar menu cost a dollar", "score": 6, "replies": [{"body": "Back when I was in high school, McDonald's hamburgers were 29 cents each", "score": 5, "replies": [{"body": "Thanks for making me feel old too asshole though when I was in high school it was only 1 day a week they ran that price😂", "score": 4, "replies": [{"body": "Yeah my dad would buy a bunch and keep em in the fridge, nothing like a couple after school cheeseburgers", "score": 3, "replies": []}]}]}, {"body": "It’s been rebranded to “Value Menu” 😔", "score": 5, "replies": [{"body": "It's pretty weak at most locations too", "score": 1, "replies": []}]}]}, {"body": "0.75 cents = three quarters of a cent.", "score": 11, "replies": []}, {"body": "My vending machine at work is $2 a can.", "score": 4, "replies": []}, {"body": "I remember vending machines with stuff like RC Cola for $0.35", "score": 3, "replies": [{"body": "public wine long piquant deliver fly seemly chief birds books", "score": 7, "replies": [{"body": "Dr thunder and mountain lightning", "score": 3, "replies": []}, {"body": "Fuckers were always broken and would steal your quarter half the time too.", "score": 1, "replies": [{"body": "Never stole mine. The only time I remember it being broken was one time where some meth head had tried to use knock-outs from electrical boxes as 'slugs' to rob the machine, and you could clearly see them jammed in there.", "score": 2, "replies": [{"body": "Sounds like California, lmfao.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": -5, "replies": [{"body": "Real boomers paid 5 cents for a luscious glass bottle of Coca-Cola.  That's with the cocaine in it.", "score": 2, "replies": []}, {"body": "Wasn't that long ago and I do not have to be a boomer by any means to remember it", "score": 1, "replies": [{"body": "V6TransAM = clearly boomiest of boomers", "score": 0, "replies": [{"body": "If the truth hurts u", "score": 1, "replies": []}]}]}]}]}, {"body": "I’ll take a mountain lightning please", "score": 3, "replies": []}, {"body": "Since when were they $0.50? You need to divide the 50% per the number of years since last price change to calculate the inflation.", "score": 2, "replies": [{"body": "Still a common price on machines stocked by where they are located. If it's an outside vendor bend over. Then it's 1-2$ unless I go to shithole cities where it's been 2-3-4$ for awhile.", "score": 1, "replies": []}]}, {"body": "So normal price", "score": 2, "replies": []}, {"body": "That's what I'm sayin'", "score": 2, "replies": []}, {"body": "That’s a % I can get behind! Buying and selling homes in this market has been 50 % plus often over 100%!gains in a very short time window! These idiots will clear their positions and rug pull every poor 401k out there", "score": 2, "replies": []}, {"body": "That’s still probably the best deal in town. Most gas stations are now doing the two 20 ounces for over three dollars. Three dollars fed into the machine will give you 44 ounces", "score": 2, "replies": [{"body": "Thrifty!", "score": 1, "replies": []}]}, {"body": "This is madness", "score": 2, "replies": []}, {"body": "Cheap. I have a machine. I charge $1 for 12oz can.", "score": 2, "replies": []}, {"body": "All will drinks can now be .75 cents", "score": 2, "replies": []}, {"body": "McChicken is 2 fuckin dollars, up 100% from last week.", "score": 2, "replies": []}, {"body": "Once I start seeing arizona ice tea sell for more than $1 I know the end is near", "score": 2, "replies": []}, {"body": "Can someone who is good at the economy tell me how to budget this? My family is dying.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "This is a meme sir", "score": 12, "replies": [{"body": "Bro people are too sensitive", "score": 1, "replies": []}]}, {"body": "And coke is aLwAyS on sale for $10.29…. /s", "score": 2, "replies": [{"body": "What where? I've been getting ripped off with this 180 a ball shit", "score": 2, "replies": []}]}, {"body": "I haven't paid over 7.50 a case so far yet. That was a spot o needed some. Usually buy in bulk on sale", "score": 1, "replies": []}]}, {"body": "$1-2.50 here in NY. count the blessings", "score": 1, "replies": []}, {"body": "Out of order or unplugged or out of stock like every drink machine in front of Walmart 😂 plus that’s a lot of or’s", "score": 1, "replies": []}, {"body": "Yup. Took 40 years to go to .50 and goes up a quarter every few years. The government usually admits to a quarter of the actual inflation rate. They say 2.5, you do the math it's 10. Now they are admitting 13 percent. Shit! More like 50 percent every year now.", "score": 1, "replies": []}, {"body": "Where is this vending machine", "score": 1, "replies": []}, {"body": "Except vitamin water, which is 50 cent’s", "score": 1, "replies": []}, {"body": "We have a fridge full of beer at work for anyone to take, but I’m such a light weight that if I have one beer I’ll be slurring ten minutes into a meeting", "score": 1, "replies": []}]}
