{"title": "What the heck is going on with BAC", "selftext": "I thought that raising interest rates would be beficial for a bank but the stock price has been falling for the past weeks pretty much after the FEDs decision to start raising rates.\n\nSo what is going on there?", "id": "u0fowb", "created_utc": 1649590116.0, "score": 142, "upvote_ratio": 0.88, "num_comments": 61, "comments": [{"body": "Rising rates are only good for banks if the yield curve steepens as rates rise. However, that isn’t what is happening. When the yield curve inverts (short term rates higher than long term rates) it means that banks now have to borrow at higher rates and lend at lower rates. This reduces the biggest way they make money, Net Interest Margin (NIM). This is the spread they collect between what they pay on deposits and what they earn from lending. When the curve is inverted, NIM is reduced.", "score": 148, "replies": [{"body": "Yield curve never steepens as fed raises rates.  At least it hasn’t in the last 20 years.  Don’t know why people think this is true.  Fed policy squeezes short term bond yield upward but doesn’t have nearly the same impact on long term.  That’s why the yield curve inverts usually, the fed makes it invert.\n\nPeople think it’s a recession indicator, it’s not.  It’s an indicator that the fed is raising rates.  It just so happens that the fed usually causes a recession by over reacting.  Which is pretty clearly what they are doing here.", "score": 27, "replies": [{"body": "A recession may happen, sure, but in my view, the real enemy here is inflation not a recession and fed must raise rates to slow or stop inflation.\n\nSo fed is doing exactly what it should be here... Raising aggressively.", "score": 46, "replies": [{"body": "inflation was partly due to supply chain issues, supply chain issues slow down growth on its own by lowering supply in additional to raising Price, that causes economic contraction, wehn the demand also shifts to the left/go down.", "score": 8, "replies": [{"body": "Supply chain issues are going to get a lot worse this summer/fall with China's covid lockdowns, likely dockworkers strike in West Coast ports (July 1), and ongoing commodity disruptions due to the war in Russia.", "score": 8, "replies": []}, {"body": "I'm not sure it matters why we have inflation, it definitely didnt matter in the 80's when it became entrenched.\n\nI myself dont expect inflation to cool until the Fed starts upping rates above the rate of inflation.  Though we're expected to rise another 1%, up to to 9%, as they're ratcheting up 0.25%.  So real rates actually dropped -0.75%, and inflation continues to move higher.", "score": 1, "replies": []}]}]}, {"body": "They have to overreact to stop inflation since they are late", "score": 4, "replies": [{"body": "Yeah, the Fed really messed this one up.  They could have risen rates in March 2021 and prevented a lot of the speculative bubble in housing that's causing so much misery.", "score": 5, "replies": [{"body": "Are you aware of how tight housing supply is still? Huge firms like Blackrock been buying homes since rates went to record lows in swathes then renting them out for far greater than the mortgage payments. This has taken a large amount of the already year by year shrinking of housing inventory for the past 11 years. Supply and demand. In other words, maybe housing is overpriced right now, but it’s certainly not in a bubble like it was from 2006-2008…", "score": 4, "replies": []}]}]}, {"body": "I'm not sure the overreaction is now, with inflation the way it is.  The overreaction was running pedal-to-the-medal QE for more than a year after the initial crisis.", "score": 3, "replies": []}, {"body": "the yield curve starts to flatten even before fed raise rates, it usually mean its late expansion or economic slowdown already happening, they are seeking the returns that are hard to get from shorter term bonds so they buy the long term ones. it takes the credit spread then can steepen when the quality of the debt decreases, and thats the additional indicator that it is recessionary", "score": 2, "replies": []}, {"body": ">causes a recession by over reacting. \n\nSome people are saying that the Fed is posturing to be more aggressive than they intend to be (i.e. pretending to over react), and hope that consumer and market will calm down so they don't have to actually over react. Do you think this might be true?", "score": 1, "replies": []}]}, {"body": "I was wondering why the OI on XLF Iron Condors was in the thousands for the May monthly opex", "score": 2, "replies": []}, {"body": "how did you learn about that stuff?", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 72, "replies": [{"body": "People also default on loans more often as interest rates go up", "score": 7, "replies": []}, {"body": "This is not technically correct. Current bank borrowings are extremely minimal because of vast liquidity from PPP and stimulus. Unless you are referring to deposits as borrowings. But, when the federal funds rate rises, banks disproportionately increase the rate on their assets. I.e. rates rise by 10bp, they increase say mortgage rates by 25, and pay out 5bp more on CDs. So they capture the 20bp in NIM.\n\nThis also depends if the bank is asset sensitive or liability sensitive (if more assets are repricing vs liabilities).\n\nAdditionally we have seen very low loan demand (in key areas like commercial) compared to liquidity so the banks have been unable to originate loans and have been investing in lower paying bonds. Mortgages were essentially all sold to the agencies and the origination fees are pretty minimal. The banks need a higher mortgage spread so that it is worthwhile to keep the mortgages, even if demand declines this will significantly boost bank performance.", "score": 3, "replies": []}, {"body": "Exactly this.  And, people need to consider that people borrow less frequently as rates increase, so not only is the spread the same, you have fewer borrowers.", "score": 7, "replies": [{"body": "And we have even fewer borrowers now than you would historically have in a similar cycle: 1.) any existing homeowner who was able to refinance in 2020-2021, already has and at historically low rates. So, relatively very few refinance candidates going forward. 2.) This is true for business debt too, but qualification for that was tighter in 2020 but eased up in 21 and is further easing now.  3.) revolving credit debt balances (ie: credit cards) are also very low compared to historic norms, given people reduced debt service levels during 20/21.  This is the widest lending margin for banks, and has shrunk considerably.", "score": 5, "replies": []}]}, {"body": "What about the interest earning assets the bank already owns? Isn't the bank getting a higher spread on consumer/commercial loans products tied to an index like Libor/SOFR without originating new loans?", "score": 1, "replies": []}]}, {"body": "Banks are always the last stocks to recover in struggling markets. I think right now there’s a feeling of an imminent slowdown in the economy. The prices of houses will have to fall as interest rates rise, and fewer mortgages will be taken out as rates rise and the economy slows. The risk of defaults on credit card, business, and personal loans rises. I still think (and so does warren Buffett) that BAC is a strong long term play and it pays a dividend so even if it trades flat for a few years you still make a little money.", "score": 16, "replies": []}, {"body": "No one wants to get new debt with raising interest rates. Who want to buy a house with 5% interest rate.  So we will see a fall in housing prices in as long as the FED is fighting inflation.\n\nMaybe 12 Month.\n\nI liked the idea of a very slow bike ride. You can fall left and have Hyperinflation or you can fall right and have a recession.", "score": 5, "replies": [{"body": "You do realize, historically speaking, 5% is still low, right?", "score": 2, "replies": [{"body": "And historically, real estate doesn’t appreciate 30% a year either.", "score": 8, "replies": []}, {"body": "But when your friends and family members just bought with 3% or lower, suddenly 4-6% seems like a bad deal on top of 20% appreciated properties.", "score": 6, "replies": [{"body": "I’m just saying perspective is key", "score": -1, "replies": [{"body": "Lol, perspective? Interest rates may be low, but housing prices are insane.", "score": 1, "replies": [{"body": "Thanks for the downvotes. Interest rates are historically low. Housing prices are historically high. Housing prices have historically gone up. Interest rates have not", "score": 3, "replies": []}]}]}, {"body": "And many of overpaid.  Which isn’t helpful if you’re going to pay off your mortgage early", "score": 1, "replies": []}]}, {"body": "Yes", "score": 1, "replies": []}]}]}, {"body": "It could be that mortgage originations are expected to drop. Also, although interest is increasing, the interest spread between short and and long term debt is decreasing. But these are just my guesses.\n\nIt's just a gully.", "score": 9, "replies": []}, {"body": "Recession fears are outweighing the interest rate hikes right now.", "score": 6, "replies": []}, {"body": "BAC came out and warned about their upcoming earnings report. Over all financials should fare well in the coming recession but there will be a good chance to buy the dip. You might see a 20-30% bargain coming this year.", "score": 7, "replies": [{"body": "I am looking for this report. Can you please link it? Thank you!", "score": 1, "replies": []}]}, {"body": "It’s called inflation…", "score": 3, "replies": []}, {"body": "Banks are complicated beasts. Exposure to interest rate rises is absolutely fundamental to risk, stability, net asset value and profitability of a bank’s balance sheet. The basic ‘banking’ model is … A) acceptance, safeguarding and repayment of cash currency deposits made by customers on demand - perhaps (you’d be lucky these days) with some interest; B) lending capital - against liquidity from customer deposits on its balance sheet (levered up, naturally; praise be… the fractional reserve system love - to third party borrowers, repayable over time, on which  interest for the use of the funds is charged. If B generates more revenue than A + B costs to administer plus any losses from borrower default re B, then you’ve got a profitable bank :) \n\nRaising interest rates will likely change the profile of A (liability to payment of interest on deposits to customers; cost of provision) and of B (loans with floating interest rates pegged to the Fed’s main policy level should yield more). In theory, at its simplest. \n\nBut the main downsides for banks when rates go up is that: \n- cost of their own funding in the money markets also increases (not by as much, but noteworthy)\n- borrower default rates tend to increase from greater challenge of maintaining larger payments from additional interest \n\nWhat this means is that impact on a bank from interest rate rises can be hard to understand , since it will depend on what their loan books are like. \n\nAlso, in the US, huge volumes of loan contracts are sold into the securitisation market for packaging into asset-backed securities by the originating lender shortly after inception at a discounted rate vs the total the borrower will repay over the term if the payments are all met in full and nothing changes. This gets debt off their balance sheet from just after the outset, so they’re not actually directly exposed to interest rate movements at all in relation to  much of the lending they make", "score": 4, "replies": []}, {"body": "No they explicitly said a recession shock is eminent and that lending is slowing down to nothing. You need to keep up with the news and the red flags starting to pop up every where", "score": 2, "replies": []}, {"body": "IMO avoid BAC.  Stick with best in breed if you're investing in individual financials (versus XLF).  JPM, V, maybe GS although I'd like to see that one pull back some more first.", "score": 4, "replies": [{"body": "My brain can't comprehend what you wrote. Is xlf a good buy?", "score": 2, "replies": []}]}, {"body": "BAC themselves were out the other Day and told people to sell their shares", "score": 2, "replies": [{"body": "Do you have a link?", "score": 2, "replies": []}]}, {"body": "Idk but buy some BAC is awesome long play ask Berkshire.", "score": 2, "replies": []}, {"body": "Simple answer, people think rise in rates is going to cause a recesion, which is bad for banks.", "score": 1, "replies": []}, {"body": "Personally think the chart on most banks looks good currently. I like BAC chart a lot. I am no professional just my opinion", "score": 1, "replies": []}, {"body": "too much debt to income ratio?\n\nbalance sheet:  total debt (mrq)   556.12 billion\n\noperating cash flow  (ttm)   --7.19 billion \n\n\\+   bank of america is short  800 million oz of silver\n\nE&OE/CYA", "score": 0, "replies": []}, {"body": "NVDA > BAC. Thats all you need to know .....", "score": 0, "replies": []}, {"body": "I reported someone who stole thousands over years and nothing happened to them, so I’d be surprised if they’re coming after you for $10.", "score": 0, "replies": []}, {"body": "Banks do NOT go up with rising rates! Take a look at the bank stocks in December of 2018!", "score": 0, "replies": []}, {"body": "ALL.THE.BANKS.ARE.OVERLEVERAGED.", "score": 0, "replies": []}, {"body": "Its a bad time for the market. But banks like BAC and jp morning will deffo gain from highrates", "score": -6, "replies": []}, {"body": "Rising interest rates hurt the banks bottom line. Capital is the resource for banks. Rising rates mean an Increased cost of capital.", "score": -2, "replies": [{"body": "This isn't correct. \n\nIt actually increases the spread they can charge. \n\nLoan volume may decrease but margins will rise.", "score": 1, "replies": []}]}, {"body": "Until the interest rates are significant to impact the bottom line showing on quarterly earnings nothing is happening....", "score": 1, "replies": []}, {"body": "I have no idea. But banks make money off of the money they handle, if they have a harder time handling fed money profitably, then they need to go to the retail sector to make their money, if the bank is poorly managed, well, profits go down.", "score": 1, "replies": []}, {"body": "You **do** know what the Fed Funds Rate that the FOMC sets *actually physically does*.....right?\n\nIt's the rate banks pay one another to borrow/lend overnight cash reserves to meet the Feds reserve requirement. It also (albeit indirectly) limits the total amount of capital that BAC would be able to lend out and earn a return on.\n\nNow......after mulling on those two points for a bit, do you really think that increasing bank-to-bank borrowing costs and limiting the % of available capital to lend out and earn a return on would **help near term cashflows** for BAC (and holders of their common stock)??", "score": 1, "replies": []}, {"body": "BAC reports earnings on 4/18.  If people (hedge funds, analysts, retail traders) think that BAC will report less than spectacular earnings, and that their guidance going forward will be lower earnings - then that affects BAC stock now.", "score": 1, "replies": []}, {"body": "Doesn't apply if the US Federal Reserve does QT. Banks won't have access to cheap money.", "score": 1, "replies": []}]}
{"title": "$Tesla !ALL IN ! Going to hold till after the split !", "selftext": "", "id": "u088mr", "created_utc": 1649558077.0, "score": 83, "upvote_ratio": 0.82, "num_comments": 65, "comments": [{"body": "[deleted]", "score": 38, "replies": [{"body": "It’s the little thingys contracts are made off 100x", "score": 20, "replies": []}]}, {"body": "When does the split take place?", "score": 13, "replies": [{"body": "I think they are voting in June for the split", "score": 10, "replies": [{"body": "Where did you hear June", "score": 1, "replies": [{"body": "They are voting for the split at the annual shareholders meeting which normally takes place in june", "score": 10, "replies": []}]}]}]}, {"body": "I know pretty much everything there is to know about meme stocks. Meme stock calls, meme stock puts, meme stock shares, meme stock warrants, grilled meme stocks, boiled meme stocks..", "score": 13, "replies": [{"body": "Why won't anyone go snorkeling with me?", "score": 1, "replies": []}]}, {"body": "Hold deez nuts", "score": 11, "replies": []}, {"body": "What the fuck, shares? Go to r/investing", "score": 29, "replies": [{"body": "If I had any fake Reddit money I’d award this post. \n\n**TICKER DATE STRIKE**", "score": 4, "replies": []}]}, {"body": "I’m in on Tesla Calls $1200 this week! But none of that stock stuff options baby! 1=100 stocks. 100 contracts = 10000 stocks go big or go behind a Wendy’s", "score": 5, "replies": [{"body": "When is the expiration date on it ?", "score": 2, "replies": []}, {"body": "4/14", "score": 2, "replies": [{"body": "Me too. Fingers crossed we go up soon", "score": 2, "replies": []}, {"body": "rip", "score": 2, "replies": [{"body": "Tendies or Wendy’s !", "score": 2, "replies": []}]}]}]}, {"body": "shares? gtfo", "score": 6, "replies": []}, {"body": "why not play this with a leap though?\n\nshares? great but im holding them MUCH longer than after the upcoming split. \n\nmore like 2040 or something lol.", "score": 11, "replies": []}, {"body": "This is boring as shit", "score": 4, "replies": []}, {"body": "We are kinda at a market peak… ok…", "score": 9, "replies": [{"body": "Market peak was a few months ago lol", "score": 4, "replies": []}]}, {"body": "I’m holding 30 @ $876 and never selling", "score": 5, "replies": []}, {"body": "you couldve bought in the 700s, 800s, even 900s but no you choose to buy  near the top", "score": 7, "replies": [{"body": "For real 🤡🤡🤡", "score": 2, "replies": []}]}, {"body": "This a joke right lol", "score": 3, "replies": []}, {"body": "I’m with you brother. Hodl TSLA and you’ll be happy in a few years", "score": 3, "replies": []}, {"body": "Hedge heavily with puts, don’t be silly.", "score": 5, "replies": [{"body": "With one put you mean 😗", "score": 0, "replies": [{"body": "Sure, if you don’t like money…..", "score": 1, "replies": [{"body": "You realize he said “going all in” aka 23k. So tell me how much individual puts can you buy with that money and leave some for IDK 10 shares…", "score": 2, "replies": [{"body": "You realize I said don’t be “silly”, sell a few shares and buy puts, it’s a pretty simple concept, just trying to help, not here to argue with a simp. That’s a huge investment to not hedge for. The whole point of puts is to hedge for a long position, if you all got that you wouldn’t be so sad when your stock takes a shit.", "score": 6, "replies": [{"body": "I don’t think we are in the same channel… but yeah sure you point has no flaws", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Hey, if you haven't already, please reply to this comment with your positions and what led you to enter or exit them!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "I ain't judging, thought of doing the same thing. But I think I'll wait and see how it works out for you first.", "score": 2, "replies": []}, {"body": "The top is in boys. Retards think stock split round 2 electric boogaloo is going to work. Nope, just bag holders being made so Elon can move on to his next project (SpaceX) with plenty of cash from selling off shares at the top to you retards over a 2-3 year bubble / slow and drawn out short squeeze", "score": 6, "replies": [{"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 6, "replies": [{"body": "Good bot, but what do you know about the NBIO infinity squeeze, AKA the first ever r/wallstreetbets short squeeze?\n\nOr are you too dumb and new to account for that?\n\nHey where did u/zjz go? These bots are terrible now ... not even recognizing a hall of fame squeeze artist while clowning me, come on now.", "score": -1, "replies": [{"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": [{"body": "Hey u/zjz I think your retarded short squeeze bot will go into an infinite loop if I make a bot to always respond with the words short squeeze in it... don’t make me do it", "score": 0, "replies": [{"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": [{"body": "See what I mean u/zjz the short squeeze bot is a very dumb bot and could be easily milked for karma farming and post visibility", "score": 1, "replies": [{"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": [{"body": "Hey u/zjz can the short squeeze bot be made smarter and a little less retarded? I’m pretty dumb but I can design better bot logic than this karma and post visibility farming crap.", "score": 2, "replies": [{"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": [{"body": "Goodnight short squeeze bot. May you drive this post into the hot category only using my dumb responses and complaints that use 2 key words. Short squeeze.", "score": 2, "replies": [{"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": [{"body": "Alright 1 more time for emphasis u/zjz get this crap under control. The side effect of this bot is driving post visibility if comments use the word short squeeze. \n\nThat’s pump and dump logic! This sub is better than that!", "score": 1, "replies": [{"body": "Squeeze these nuts you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": [{"body": "Short squeeze", "score": 0, "replies": [{"body": "Squeeze my dongus you fuckin nerd. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Ya let go of those massive gains in stocks like TSLA over time and buy a HARD asset like a house or metals or something that isn’t “funny money”\n\nI’m not sure what Elon’s play is here but I would suspect he’s selling TSLA shares and opening other positions to have multiple projects. That and I bet he’ll use TSLA share sales to help fund SpaceX. \n\nTSLA puts seem like the new play if you want to buy a TSLA. When they run the same play twice, the outcome usually doesn’t repeat.", "score": -2, "replies": [{"body": "Elon cashing out? You must have missed the part where he actually owns more TSLA shares now than he did 6 months ago. He sold some shares to pay taxes on contracts that awarded him more shares at a low cost basis.  One inconvenient fact that makes your argument look silly", "score": 4, "replies": []}]}]}]}, {"body": "Rip", "score": 3, "replies": [{"body": "Right; tesla and apple propping errything", "score": -2, "replies": []}]}, {"body": "Sell your shares and buy calls", "score": 1, "replies": []}, {"body": "Avg over 1000 when it touched 700 several weeks back… sigh", "score": 1, "replies": []}, {"body": "I could never do that with a company that will take 280 years to earn what it's trading at. \n\nEven Musk is selling his shares and diversifying. \n\nPlus there's a recession around the corner, some say a big one. Stagflation and shit. \n\nThe former fed chair was quoted saying share prices must fall to get inflation under control... \n\nSit on the sidelines with a sack of cash and wait for the deal of your life if you are just buying shares.", "score": -3, "replies": []}, {"body": "The split is still equal the same value, no more no less.", "score": 0, "replies": []}, {"body": "Tesla stock real value is 85-100$. And i told months ago. They split it before it drops 100$range. And there we are.", "score": -5, "replies": []}, {"body": "Nobody tel him", "score": 1, "replies": []}, {"body": "Baby with shares", "score": 1, "replies": []}, {"body": "Now Avis is in!!!!!\n\n&#x200B;\n\nhttps://avis.mx/tesla3?gclid=Cj0KCQjwgMqSBhDCARIsAIIVN1WC64Pf7cA0m67wGiWMYDiIpwzOLc1GpD3T826B-rK\\_mJftzzWF08YaAuFZEALw\\_wcB", "score": 1, "replies": []}, {"body": "Omg he went all in with an 18 year olds McDonald’s jobs savings net worth on a mega cap fairly stable company! Good luck you don’t want to lose a couple thousand dollars temporarily until price rebounds!", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4270)", "score": 1, "replies": []}, {"body": "Shares, yawn", "score": 1, "replies": []}]}
