{"title": "Whirlpool Cuts Earnings Outlook After Consumer Demand Drops ‘Massively’", "selftext": "Whirlpool Corp. reported lower-than-expected sales and earnings for the third quarter and cut its outlook for the year, citing softening demand and rising inflation into 2023.\n\nThe 111-year-old manufacturer, which sells all manner of household appliances from refrigerators to stand mixers, on Thursday cut its full-year adjusted earnings-per-share outlook to $19 from a range of $22 to $24. \n\nThird-quarter results took a hit from high inflation that resulted in slowing consumption, the company said in a statement. Whirlpool has raised prices almost every quarter since late 2020 in an attempt to offset increased costs. \n\n“In particular in the US, but also in other markets, we saw consumer sentiment dropping off massively in June, July,” Chief Executive Officer Marc Bitzer said in an interview with Bloomberg Television.\n\nWhat the company calls replacement demand is stable or growing, Bitzer said, but discretionary demand “significantly weakened throughout Q3, and frankly we see similar patterns in Q4.” The company is now focused on taking “aggressive steps” to manage costs, he said.\n\nBenton Harbor, Michigan-based Whirlpool said it cut production volume by 35% in the third quarter “in anticipation of a temporary soft demand environment.”\n\n‘Challenges Persisting’\n\n“Looking ahead, we see these challenges persisting into the first half of 2023,” Bitzer said in the statement. “However, we believe we have the right actions in place that will allow us to navigate through the current environment.”\n\nWhirlpool shares fell 4.6% in late trading in New York. The stock had declined 44% from January through Thursday’s close, compared with a 23% slide for the S&P 500 Index.\n\nSales fell from a year ago across all geographies Whirlpool operates in, with Europe, the Middle East and Africa registering the steepest decline. The company said it’s in the final stages of reviewing two potential investors for the region, which Whirlpool previously said it was evaluating as it chases higher growth and margins.\n\nWhirlpool said third-quarter sales were $4.8 billion, lower than Wall Street’s expectation of $5.2 billion. Earnings per share came in at $4.49, short of the $5.34 average analyst estimate.\n\nReduced Forecast\n\nIn the company’s reduced forecast, net sales for 2022 are now expected to fall 9%, compared with the prior full-year guidance of a 6% decline. It also estimated free cash flow of about $950 million for 2022, down from $1.25 billion.\n\nWhirlpool also said it completed the sale of its Russia business, announced in June, which was responsible for a large chunk of its revenue decline in Europe, the Middle East and Africa in the third quarter. The 28.1% decline would have amounted to about 8% if it excluded Russia and the impact of currency fluctuations, the company said.\n\nThe company, which owns Maytag, KitchenAid and Insinkerator, is still betting that American consumers will need to replace their appliances soon, given that usage has increased as households have spent more time at home since the Covid-19 pandemic began. \n\nIt also expects US existing home sales, which are linked to home-appliance demand, to pick up. Sales of previously owned US homes fell for an eighth straight month in September after increasing in 2021. \n\nhttps://www.bnnbloomberg.ca/whirlpool-cuts-earnings-outlook-after-consumer-demand-drops-massively-1.1835490", "id": "y9eajw", "created_utc": 1666310798.0, "score": 111, "upvote_ratio": 0.94, "num_comments": 62, "comments": [{"body": "Too bad they couldn't even fill an order that they did get. Ordered a KitchenAid wall oven-microwave combo unit in March, backordered until July, pushed to October, pushed again until 2023 before we cancelled the order and bought GE. Delivered and installed in 3 weeks.", "score": 50, "replies": [{"body": "They wanted you to cancel the order all along.\n\nClearly it wasn't profitable for them to deliver it to you.", "score": 21, "replies": []}, {"body": "GE appliances are better anyway. I bought all Cafe appliances for the kitchen.", "score": 7, "replies": [{"body": "Yeah, I really like our GE Profile stuff which is essentially the same thing.", "score": 4, "replies": []}]}]}, {"body": "Maybe that's because a $250 dishwasher is now only in stainless steel and priced at $800.   Screw that, I'll just Dremel and seal my rusting 20 year old dishwater racks for $5.", "score": 45, "replies": [{"body": "That's how my decrepit machine got to 27 yrs old.. . Looks odd inside, noisier than the new ones, but $750 cheaper, for now.", "score": 18, "replies": [{"body": "I just don’t think they’re THAT much better to justify upgrading… across the board, not just dishwashers. Ovens, toaster ovens, I got a new stovetop because the old one broke last year and its the same except now it’s a touchscreen because… that’s futuristic or some shit. I get a real impression of stagnancy in this sort of thing. I genuinely feel like the technological leaps happening from 80’s and 90’s was big enough you could see a huge improvement in a decade if not within a year. Now I look at a fridge from 2002… 20 years ago… and I don’t see THAT much of a difference.", "score": 9, "replies": [{"body": "My old oven got replaced because a power surge burned out the computer.. actually not much more than the clock. And the timers, and the temperature gauge.   My mom used a device as primitive (even more primative) as what was left, but this beast wouldn't let the gas flow anymore. \n\nTouchscreen isn't so much futuristic as cheap.  No moving parts.", "score": 4, "replies": []}, {"body": "I’d be willing to bet a new dishwasher uses significantly less electricity and water than a 20 year old one. A new fridge will certainly be more efficient. Just because you don’t see a difference doesn’t mean they’re not there", "score": 2, "replies": []}]}]}, {"body": "Last stainless steel  dishwasher I bought lasted one day past the one year warranty. Paid two certified repair men a combined total of more than the thing was worth to not fix it.  One just said I was using detergent that was too expensive and the machine started leaking again 5 minutes after he left after charging $150 to look at the detergent brand.    Watched a few YouTube videos and put a zip tie around the drain hose and reset the seal.  $10 repair that the paid \"pros\" couldn't figure out.  Products and service are crap.", "score": 7, "replies": [{"body": "How incompetent were they to not find such a basic issue?", "score": 1, "replies": []}]}, {"body": "The DIY movement is a sign of economic collapse. I liken it to bartering, which you see in history textbooks for every currency collapse. People abandoning the marketplace", "score": 5, "replies": [{"body": "His dishwasher uses 2KWH per cycle while a new one does 0,650KWH.\n\nIt is not as cheap as you think. Besides there are $200 dishwashers even from Whirlpool", "score": 10, "replies": []}, {"body": "Many of the repair men and installers have no clue what they are doing.  DIY in many cases is the only way to get things fixed, delivered, or services without wasting money on incompetent service. I've had multiple delydolks destroy my property on delivery (damaging dry wall, cracking body if car, actually destroying a wooden steps) and flat installing crap completely wrong.", "score": 8, "replies": [{"body": "yeah like I said; economic collapse. People say Im a doomer, but I say its a slow motion trainwreck.\n\nRather than going to the marketplace to both provide & receive services, you do them yourself. If everyone starts doing this, there is no economy", "score": -1, "replies": [{"body": "What is the downside to this though? Like it seems like that's what you should do if at all possible to save money, similar to eating at home vs eating out, changing your own oil, buying used clothes and only when you need them.\n\nThat's what most people seem to tell you to do to better your own financial wellbeing.", "score": 2, "replies": [{"body": "the problem is that there is no problem. The market has failed & people are rightfully abandoning it", "score": 1, "replies": []}]}]}]}, {"body": "I disagree, DIY has been taking off since way before any of the recent economic headwinds.  I think it is more YouTube that started the trend.  I can look at my appliance find a model number, Google common problems with the model, and there will be 2 or 3 common issues with said model and you can like 95% of the time fix the problem without even having diagnostic tools, just by trial and error swapping in cheap parts.  When you consider paying a technician to properly diagnose and fix an issue can cost close to replacement value you have almost nothing to lose with a DIY fix attempt.", "score": 3, "replies": [{"body": "I disagree that the headwinds are recent", "score": 1, "replies": [{"body": "What are you saying that DIY took off during the Great Recession?  Wouldn’t that coincide quite a bit with YouTubes rise?  Maybe it is tough to discern the true catalyst", "score": 1, "replies": []}]}]}, {"body": "Tom Silva - Harbinger of Societal Collapse", "score": 0, "replies": []}, {"body": "Saving money means economic collapse?", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 35, "replies": [{"body": "Whp stock price has been cut in half so...", "score": 3, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "My point is that stocks don't just go down or up forever.  You can beat earnings and drop or miss earnings and rise.", "score": 0, "replies": []}, {"body": "But the market is not going down because the economy is bad, it’s going down because the fed keeps raising rates and fucking with bond yields.  So therefore, bad news is good news.\n\nThe market will go up if value stocks like whirlpool have a shitty quarter.", "score": -13, "replies": [{"body": "It would be nice if it were that simple", "score": 5, "replies": []}, {"body": "🤣", "score": 2, "replies": []}]}]}]}, {"body": "At the bottom of everyone's heart, it's not quite the same", "score": 1, "replies": []}, {"body": "Meh, yeah the economy is on shaky ground but there are still going to be opportunities", "score": 1, "replies": []}]}, {"body": "The cost 4 times as much as old ones and last about a year.", "score": 7, "replies": []}, {"body": "Amazing how fast things change. A year ago you had people fighting for appliances, now they can't sell them.", "score": 15, "replies": [{"body": "Prices haven't decline yet. Maybe I should wait a bit longer to order appliances", "score": 3, "replies": []}, {"body": "> 0eolel\n\nWTF is this supposed to mean?", "score": 4, "replies": [{"body": "Probably should read ‘people’", "score": 10, "replies": []}]}]}, {"body": "Soft landing people. Don’t worry. All is well.", "score": 18, "replies": [{"body": "I feel soft, do you feel soft?", "score": 4, "replies": []}, {"body": "Well a pool of blood and tears is technically a soft landing.", "score": 3, "replies": []}, {"body": "Hitting the pavement like a bag of soup.", "score": 1, "replies": [{"body": "How so?", "score": 0, "replies": [{"body": "Don't overthink it. It is not an expression of optimism. And I don't think the landing will be soft, though a Hefty bag full of vegetable soup is.", "score": 1, "replies": [{"body": "How do you know I'm trembling in fear!? Can you see me?", "score": 0, "replies": []}]}]}]}]}, {"body": "Inflation and also durable goods sales rocketed last few years from the cash injections and because people spent so much time at home. You only need to replace those items infrequently which is why they’re called durable goods. Going to be a long slow slog for those companies for many more years", "score": 5, "replies": []}, {"body": "This seems like a really good time to get this on a nibble list to start DCA-ing into. Sweet divy yield and has a solid shot at a 50-75% increase by 2024-2025 when the economy picks back up again", "score": 6, "replies": [{"body": "Bagholders love this sweet stock", "score": 4, "replies": []}, {"body": "How safe is the dividend? \\~5% seems pretty good but the 10 yr is already at 4.xx", "score": 1, "replies": []}]}, {"body": "Wait till after the war, basically every house in Ukraine will need another one", "score": 4, "replies": []}, {"body": "It’s a great time to own an appliance repair business.", "score": 2, "replies": [{"body": "I’d disagree.  I think with the coming lack of housing starts it will put a ton of pressure on appliance manufacturers to reduce prices.  Combine that with the ever increasing wages for decent service people I think it will be increasing less cost effective to repair vs buy new in the coming year or two.  I think if you are a business owner running a 1 man business you could do well but if you are paying employees I think you are going to feel a squeeze.", "score": 2, "replies": [{"body": "Historically appliance repair dose well in recessionary markets. So much so it’s considered a recession proof business. We do better in economies that we’re in currently. Consumers trend towards repair in recessions, and economic down turns. Technicians are typically paid in commission. We pay a %35 commission to our techs, and have had no issues making payroll through a handful of economic downturns I’ve been through. As well the industry is experiencing an market shift right now of big business trying to jump into the market,and failing as appliance repair is a local business. That is what customer want. We see big business try to jump into the market, and pull out within a couple of years about once ever 10 years. We are coming out of that now, and seeing an increase in revenues because of that as well. Whirlpool itself is going to have issues keeping up with demand. They’ve already shut down there factories multiple times this years due to various different reasons. Cost vs replacement in a health business you’re already going to have pricing below %50 of replacement which is where consumers tend to second guess repairs. Even adding in techs, and appliances falling in price it would be very easy to stay below that threshold, and maintain a %30 net margin.", "score": 1, "replies": [{"body": "When was the last time we had a recession with this low of unemployment though?  Kind of uncharted waters, no?", "score": 2, "replies": [{"body": "We’re still at full employment, and I don’t see that changing. I know employment is an issue for whirlpool, and is one of the reasons they’ve had to shut down manufacturing a couple of times, but that lends more business to repairs. We’ve already seen an increase in customer repairing because it would otherwise be a 6 month wait to replace.", "score": 1, "replies": [{"body": "That was my point though, in the coming year we are going to see less housing starts and this downward price pressure for new appliances.  Which starts to cut into your business as you outlines the 30-50 percent point at which people decide not to repair.", "score": 1, "replies": [{"body": "%30 is a %100 sale for us. We start seeing declined estimates around %50, and even then we’re still making that sale over %50 of the time. So we have a pretty large buffer before a price fall would ever affect us. Housing starts account for a small part of our business in this industry we do some work for builders, but that might account for %1 of our business. You’d have to understand that those are new appliances so they’re not broken. That’s not our clientele. It might affect authorized service companies as they are running repairs on appliances u dear one year old, but most of the industry refuses to work with manufactures as they pay to little to maintain healthy margins. That leaves those that are so far booked out that a slow down for them means they just get to get caught up.", "score": 1, "replies": [{"body": "Housing starts affect demand for new appliances which props up prices.  I wasn’t saying a repair shop would get business directly from housing starts but would see a ripple effect.  Anyway you got some good points but I still think this “recession” with a lack of unemployment is going to be different than past recessions.", "score": 2, "replies": [{"body": "Yeah sorry I took housing starts in a different direction there. At the end of the day there is a lot of things that are most certainly going to be different this time around. The only thing I know to do atm is don’t go into debt, and keep stacking money for a rainy day.", "score": 2, "replies": [{"body": "Yeah and it sounds like even in a worse case your commission based model is somewhat downturn proof.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Overpriced antiquated company . I bought a Beko dishwasher for fat less and better quality..", "score": 2, "replies": []}, {"body": "We’ll maybe because whirlpool breaks down after the 5th load", "score": 1, "replies": []}, {"body": "Just had a second round interview with them for an entry level role in their finance department, are you telling me I should run…", "score": 1, "replies": []}]}
