{"title": "[deleted by user]", "selftext": "[removed]", "id": "kcu8hw", "created_utc": 1607936818.0, "score": 34, "upvote_ratio": 0.74, "num_comments": 53, "comments": [{"body": "Priced in for awhile now and they are selling the vaccine for its cost to develop essentially", "score": 71, "replies": []}, {"body": "It’s like the difference between Jeff Bezos winning the lottery and you winning the lottery.  \n\nPfizer already is an enormous company with a lot of successful products. One successful vaccine isn’t going to move the needle for them, no pun intended.", "score": 34, "replies": [{"body": "But when SpaceX has a successful launch Tesla stock soares. Same energy", "score": 6, "replies": [{"body": "That’s not the same energy at all. Not even close. Space Travel represents a permanent foray into an entirely new multi-billion dollar industry. Meanwhile in 4 years no one is even going to want a COVID vaccine. \n\nIf Disney had a new, successful, COVID vaccine, then their stock would soar because that would symbolize an entirely new industry for them. Vaccines and pharmaceuticals is not a new or noteworthy development for Pfizer.", "score": 27, "replies": [{"body": "> Meanwhile in 4 years no one is even going to want a COVID vaccine.\n\nThis aged poorly.", "score": 1, "replies": [{"body": "You have a time machine that brought you here from 3 years in the future?", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 72, "replies": [{"body": "I feel like people will still be saying this when MRNA is sitting at a $500B market cap with no other revenue than the vaccine.", "score": 11, "replies": [{"body": "500B?  I don’t think so", "score": 1, "replies": []}, {"body": "Vaccines have always been a poor high profit business.  Make the covid vaccine high priced and countries will ignore your legal protection or as with covid there are lots of other vaccines.\n\nEven if covid vaccine has to be taken every year, like the flu, it is not that high of a profit item.  It will give them some needed income but it is not going to move their stock price.", "score": 1, "replies": [{"body": "Tesla investors shrug off the fact that the auto industry is notoriously cyclical, low-margin and ultra-competitive. Tesla gets an innovation premium: any company could have taken the lead in EVs but Tesla did it. It bodes well for their future endeavors and makes it a company worth owning at any price. Moderna, also is trading with an innovation premium but Pfizer is not, although it reached the finish line first. It’s baffling really.", "score": 1, "replies": []}]}]}, {"body": "BNTX phizers partner is the gainer of the joint adventure because it was a smaller company with more to gain", "score": 2, "replies": []}]}, {"body": "Biontech created “the Pfizer Vaccine“...", "score": 14, "replies": [{"body": "Biontech isn't moving much either", "score": -3, "replies": [{"body": "It went up by $40 in one month?  This was a play over a month ago.", "score": 10, "replies": [{"body": "Yeah I know. The post is asking why Pfizer isn't moving. His comment is insinuating that biontech is because they made the vaccine. I was just saying that isn't moving either", "score": 3, "replies": []}]}, {"body": "It's actually down 7% this morning. Me holding the stock like: WTF???", "score": 1, "replies": [{"body": "Success of the vaccine is now priced in. My guess is trump stopping white house staff getting it and news from the UK that there is a new strain circulating.\n\nModerna is going to the moon though haha", "score": 1, "replies": [{"body": "I hope so. I also have $MRNA 130 call, hope it will be worth 4k by the end of this week.", "score": 1, "replies": []}]}, {"body": "As someone who is new to investing in stock. would you recommend investing in Pfizer's stock or  Moderna ?", "score": 1, "replies": [{"body": "Neither actually. \nModerna is pretty risky to enter now. It might go higher (>175) in next few days, but it could also go south of 100 next week. \nPfizer probably won't drop much (35 is bottom), but it won't up much either (43 might be ceiling). \nI think it's probably too late for vaccine stocks. perhaps it's better to move to other sectors", "score": 2, "replies": [{"body": "What about Biontech?  \nHaven't followed up much but it's down 20€. Is that going up anytime soon? Wtf", "score": 1, "replies": [{"body": "It probably will recover a little, but $MRNA approval might make it drop more due to competition. I felt $BNTX broke my heart yesterday. Seriously, best news, yet down 15%, WTF", "score": 1, "replies": []}]}, {"body": "You’re scaring me lol. Moderna is soooo annoying, I’m not confident to know if I should hold it long term", "score": 1, "replies": [{"body": "I fear there will be a \"sell the news\" next week, if not friday", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Technically, the stock ran into resistance and retreated accordingly.  Have a look at the Bollinger Bands and you will have better context for the price movement.\n\nBusinesswise, I think most sophisticated pharma investors understand that vaccines are a relatively low margin business.  So, while COVID vaccinations should be good for the market writ large, it isn't likely to impact a stock like Pfizer much unless something goes horribly wrong. \n\nMy sense is that it is a good company with an overvalued stock.", "score": 6, "replies": []}, {"body": "You may better buy into Moderna", "score": 8, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Pfizer fully funded the project themselves after entering into the agreement with Biontech. Additionally, Pfizer agreed to pay Biontech upwards of 1billion of the proceeds as part of the deal. DD my friend... DD", "score": 4, "replies": []}]}, {"body": "It's a shit stock and the CEO sold 62% of his holding at around the current price. Usually runners have insider buys, not happening here.", "score": 4, "replies": []}, {"body": "I've been loading up on $PFE since last year and will be buying more, not only are they a huge, profitable company but the vaccine will increase their bottom line, plus they pay a nice dividend.", "score": 4, "replies": []}, {"body": "Buy the rumour sell the news.", "score": 5, "replies": []}, {"body": ">Why is Pfizer’s stock not flying up??\n\nBecause they're more or less giving this vaccine away. They're still going to be turning a profit on this vaccine, it just won't be as wide of a profit margin as one might expect.", "score": 4, "replies": []}, {"body": "I bought BioNtect weeks before it the vaccine was approved anywhere at $119. It dropped back down to $119 today so I sold it all.", "score": 2, "replies": [{"body": "Same. Made a whopping $15 but hey, better than losing what I put in.", "score": 1, "replies": []}]}, {"body": "Pfizer doesn’t move, this vaccine hardly moves their margins.", "score": 1, "replies": []}, {"body": "why the fuck would pfizer's stock fly up on this? Jesus christ. It's a massive company and vaccines aren't a moneymaker", "score": 1, "replies": []}, {"body": "I wouldn't bet anything on the vaccine companies. I'd focus on solid companes that are fairly valued and relative to that have juicy profitable earnings growth future outlook. Unfortunately cannot name my favourites because my purchases are still ongoing and it would skyrocket the prices.", "score": -2, "replies": []}, {"body": "Because pretty much everyone in the US has gotten Covid already?", "score": -3, "replies": []}, {"body": "Pfizer is a massive company with an extremely diversified product line. The vaccine probably won’t have an incredible effect on its bottom line. It’s also possible that the market is (for once) taking the long view, and realizing that this is likely just a short-term boost to Pfizer that will give them some nice cash flows and good press for say, a year, but will ultimately not have a crazy long-term effect once the pandemic is over.", "score": 1, "replies": []}, {"body": "BNTX phizers partner is the gainer of the joint adventure because it was a smaller company with more to gain", "score": 1, "replies": []}, {"body": "The selling of vaccines is 100% credit positive, i think its because 1) us were dum enough to only buy 100mil 2) ceo says \"he wont cut in line and get vaccine\" but people might believe its cause he doesnt trust it...", "score": 1, "replies": []}, {"body": "This has been covered countless times - Pfizer is a very large pharma company, and they are likely selling this vaccine at cost - it won't have any material impact on profits or growth.", "score": 1, "replies": []}, {"body": "Buy the rumor, sell the news", "score": 1, "replies": []}, {"body": "Few reasons \n1) already priced in\n2) not a profitable long term product and has/will continue to require a lot of resources that could have been used on more profitable efforts for PFE\n3) once the single shot JNJ vaccine is here who, long term will choose the PFE 2 shot vaccine over a one shot option?", "score": 1, "replies": []}, {"body": "It was the same with GILD and Remdesivir...", "score": 1, "replies": []}, {"body": "\"Literally everything in the market is flying up\". ???  Lots of red today.\n\n&#x200B;\n\nI'm surprised how many don't realize stocks are priced (at least in the short term) off future speculation.  The time to buy pfizer was when there was news they were working on a vaccine.  Not the day it starts getting injected lol  They are up %14 in the past 3 months, thats pretty damn good!\n\n&#x200B;\n\nThis would be like expecting disney to go up the day the parks re-open.", "score": 1, "replies": []}, {"body": "Pfizer pledged to sell the vaccine at-cost so they won’t make any profit on it.", "score": 1, "replies": [{"body": "And this is why I’m an idiot", "score": 1, "replies": [{"body": "AstraZeneca has also pledged to sell the Oxford vaccine either for free or at-cost so even if they sell millions of doses they won’t make a dime either.\n\nActually I think the only major vaccine company that is going to make money off their vaccine is moderna.", "score": 1, "replies": []}]}]}, {"body": "Pfizer has had its day in 90s and early 2000s and a host of fines for unethical and...", "score": 1, "replies": []}, {"body": "It's market manipulation by the truly Elite. PFE is the most held stock in the Stock Market history nearly every pension fund, retirement portfolio, etc... has PFE stock therefore certain sector in the nation can't allow the stock to go up because it would make a ton of people a ton of money. Probably triggering inflation, or if at least 50% of the stock owners sell after profiting it could really fuck up the market.", "score": 1, "replies": []}]}
{"title": "The market is in a huge bubble and is about to collapse, wiping out all of you suckers", "selftext": "[removed]", "id": "kd48if", "created_utc": 1607973337.0, "score": 0, "upvote_ratio": 0.27, "num_comments": 51, "comments": [{"body": "Sir, this is a Wendys", "score": 25, "replies": [{"body": "Best reply by far 😆", "score": 3, "replies": []}, {"body": "well can I have a frosty and baked potato please?", "score": 2, "replies": []}, {"body": "Well, you told me. I recommend going all in on QQQ, like the Fox News \"business\" article advised.", "score": 0, "replies": []}]}, {"body": "We found the guy who is down during the best year in decades", "score": 16, "replies": [{"body": "*Bagholder enters the chat.*", "score": -2, "replies": []}]}, {"body": "The end is near! Hope everyone bought a bunker...", "score": 9, "replies": [{"body": "And food. Make sure you stockpile plenty of food, and keep it well hidden from rodents--both the four and two legged kind.", "score": -1, "replies": []}]}, {"body": "Why are you so angry? It's not your money so who cares? If you were so much smarter than the rest of us, why are you concerned with making sure we know that? Sounds like you're bad at trading. Hope you lose money.", "score": 8, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "How old are you? I'm guessing 14. Or 25. Or hell, even 65. Not much difference these days.", "score": -5, "replies": []}]}, {"body": "I feel like you lost a lot of money and you’re angry that others havnt. Yes, we’re undeniably in a bubble. That’s what happens when the largest economy in the world cuts corners to maintain unsustainable growth. Couple that with the gig economy bubble and you’re faced with a shit show. Anyone with half a brain will tell you that a stock market collapse was expected for 2021 or 2022. The only thing that muddies that is the collapse we JUST had. While I don’t believe that headed anything off, nearly every other bit of your point was just... angry and boring.", "score": 7, "replies": [{"body": "Ya we'll likely eventually see this train stop again but everybody is going to get it wrong on when. Personally I wouldn't be surprised if we get a short term correction (honestly, we're overdue for another one like June/early September/late October), but it's likely to be another head fake on it being the \"end\" for bulls.\n\nWe're not going to get clarity on what the market is going to do over the long term until we see what the Fed does in March next year. That'd be the earliest I can see this stopping but we might really be waiting until they decide on rates years from now.", "score": 2, "replies": [{"body": "> Ya we'll likely eventually see this train stop again but everybody is going to get it wrong on when.\n\nNot everyone. \n\nThe people who called the 2008 crash got it \"wrong\" on when, also, and went bearish years early, only to come out ahead 500% at the end.\n\n> Personally I wouldn't be surprised if we get a short term correction (honestly, we're overdue for another one like June/early September/late October), but it's likely to be another head fake on it being the \"end\" for bulls.\n\nIt's just as likely to be the real thing, which you will interpret to be a head fake and go \"all in\", thus dooming yourself to bagholder status. \n\n> We're not going to get clarity on what the market is going to do over the long term until we see what the Fed does in March next year. \n\nThere are a lot of rocky shoals between now and then. Major, major events. What happens for example when the Supreme Court overturns the election, or it appears that it might? \n\n> That'd be the earliest I can see this stopping but we might really be waiting until they decide on rates years from now.\n\nUnder no circumstances whatever will this market continue on for \"years.\" The next leg of the collapse began in late 2018 and especially mid 2019 with the repo market turmoil. This shit show is on its LAST LEGS AND WILL CRASH SOON.", "score": -1, "replies": [{"body": "\"There are a lot of rocky shoals between now and then. Major, major events. What happens for example when the Supreme Court overturns the election, or it appears that it might?\"\n\nFreaking LOOOOOOOOOOOOOOOOOOOOL. This statement shows to me that you have no credibility. There is ZERO chance that this election gets overturned. ZERO.\n\nI am a young person but I'm not in total fantasy land. Santoli's \"Mystery Broker\", who's been doing really well on calls, told him that he sees no reason for the market to stop through March, although he does see potential for a nasty correction in January. And he's also called for the cyclical trend to last for years.\n\nEdit: We clearly have differing opinions. I think the market is overvalued but this is a rigged game, unless we see an event change the pathway, until the tools that have been involved in helping keep the \"house of cards\" up go away, there's no reason to call for this to stop.", "score": 4, "replies": []}]}]}, {"body": "> I feel like you lost a lot of money and you’re angry that others havnt.\n\nI feel like you're just making excuses to ignore what I say. \n\nLost money?? No, that's what YOU'RE in the process of doing.\n\n> Yes, we’re undeniably in a bubble. That’s what happens when the largest economy in the world cuts corners to maintain unsustainable growth.\n\nLargest economy in the world? You are confused. This isn't China.\n\n> Couple that with the gig economy bubble and you’re faced with a shit show. Anyone with half a brain will tell you that a stock market collapse was expected for 2021 or 2022.\n\nPeople with even 1/4 of a brain seem to be in rather short supply these days.\n\n> The only thing that muddies that is the collapse we JUST had.\n\nWhat collapse? You have seen NOTHING yet.\n\nLook at the NDX 10 year chart. PARABOLIC. How do you think this ends??\n\n> While I don’t believe that headed anything off, nearly every other bit of your point was just... angry and boring.\n\nBagholder detected.", "score": -3, "replies": [{"body": "Wow you got so much wrong. Where to start. I agreed with almost everything you said. If there was an excuse provided it was one meant to give you even a shred of intellectual credibility. Second: yes, the largest economy in the world. By an almost comical margin. China’s GDP is roughly half of ours at 13 trillion. 3: a collapse is any bottoming out in the stock market. If you don’t understand that the covid scare caused a stock market collapse then I’m not sure you understand what the word means, even if the next one is worse. Finally I think you meant “exponential” curve since it’s certainly not a full parabolic curve and it’s definitely continuously multiplying on itself. That’s not actually caused by a bubble either. It’s caused by a mirrored exponential rise in production capacity and number of end customers available. Given all of the inherently incorrect statements you’ve made, the only real way you haven’t lost money is because you’re not actively investing at all. I’m starting to think that’s because you’re a child.", "score": 3, "replies": []}]}]}, {"body": "As someone who was around during the dot com crash this gave me a chuckle.", "score": 3, "replies": []}, {"body": "Won’t be a huge crash till there is an alternative investment. While rates are near zero there are none other than stocks", "score": 5, "replies": [{"body": "The crash will come whenever it is ordained to come. Everything that is happening right now is scripted. If you think investing in garbage companies is an \"alternative\" to anything, you don't deserve that money and you will lose it to someone who is more deserving.", "score": -2, "replies": [{"body": "Must feel bad to be watching everyone get rich around you. Who cares if they are garbage if they make you money. If people aren’t taking the gains and putting some in safe havens then sure, they will get crushed at some point. But people like you will always be poor because a golden goose dick is staring you right in the face, you are just too scared to suck it", "score": 5, "replies": [{"body": "> Must feel bad to be watching everyone get rich around you\n\nNo, it doesn't feel bad at all. Because I'm not the retard who is myopically focused on the here and now, but always think and plan ahead for the future. All you asswipes \"getting rich\" are only getting rich on *paper*. Show me your stack of gold, or your stack of stock certificates for mining firms, and then I'll be impressed. TSLA stock? lol. Worthless garbage, not fit to wipe one's ass with.\n\n> Who cares if they are garbage if they make you money. \n\nBecause when your dumb ass has been trained (like a dog) to always \"buy the dip\", you end up *losing everything*. Then you're not \"rich\" anymore. Got it?\n\n> If people aren’t taking the gains and putting some in safe havens then sure, they will get crushed at some point.\n\nThe problem is a lot of what you fools think are \"safe\" havens, are NOT!\n\n> But people like you will always be poor because a golden goose dick is staring you right in the face, you are just too scared to suck it\n\nYeah, and that's what you dumb ass serfs always say right before you get your fucking face ripped off. lol. ALWAYS. YOU NEVER CHANGE.", "score": -2, "replies": [{"body": "You are one bitter kid. Hopefully they send you another $1200. You could make 5000% in the next year and you wouldn’t equal my checking account interest for a month. I’m retired now but been in this game for 26 years son, so instead of using your buzzwords and trying to sound smart for a couple internet upvotes, why don’t you ask people clearly smarter than you how it’s done.", "score": 1, "replies": []}]}]}, {"body": "Have you been on the sidelines the whole time my goodness your salty , oh your long SQQQ . \n\nHow can someone take advice from you when your bag holding a triple leverage ETF .", "score": 3, "replies": [{"body": "The tech market is going to collapse, dumb ass. LONG SQQQ", "score": -1, "replies": [{"body": "How do you expect any one to listen to you when you don’t even know your not supposed to hold triple leverage ETFs for a long hold \n\nThis is the easiest year to make money rather then buying any value stock , your trying to time the market it’s comical", "score": 2, "replies": [{"body": "> How do you expect any one to listen to you when you don’t even know your not supposed to hold triple leverage ETFs for a long hold\n\nHow do you expect anyone to listen to you when you just mindlessly repeat what other people tell you, without introducing any of your own original thought?\n\nCan you explain why one shouldn't hold SQQQ long just before a major market collapse, in your own words, without Google, and without any bullshit you copied and pasted from a web site?\n\nI'm not only holding long, I'm BUYING MORE!\n\n> This is the easiest year to make money rather then buying any value stock , your trying to time the market it’s comical\n\nYou're* NOT trying to time the market. That's comical.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Huge bubble?\nThe market is undervalued imo", "score": 3, "replies": [{"body": "LOL. Put down the crack pipe and slowly step away.\n\nAre you being paid to post that comment? Serious question.", "score": -1, "replies": []}]}, {"body": "Here’s the problem with this statement- it’s been said for the last 8-10 years and hasn’t materialized yet. \n\nThe market can be irrational longer than you can be solvent. \n\nI’m not saying it won’t happen, as I almost always have a hedge on, but saying when or what it will be is a bit out there. You know nothing more than anyone else.", "score": 4, "replies": [{"body": "> You know nothing more than anyone else.\n\nYou're a God damned fool.\n\nYou personally can't predict anything, so you doubt than anyone exists who can. Despite there being ample evidence that yes, in fact, people can see what's coming from miles away. It's quite obvious, actually. \n\nI've been watching this bubble grow for YEARS. Observing all of the little details that you remain oblivious to. Yes, I do know it's about to crash. Get out or get crushed, it's up to you.", "score": -2, "replies": [{"body": "Dude, you’re fucking looney. Read WTF I said and think about it without emotions. \n\nFor fucks sake, I said you know nothing more than the rest of us. If you had that crystal ball you’d be rich and not spewing this.\n\nNo shit it’s over bought. No shit there’s a correction at some point. The thing is, SPY could be 450-500 before that correction happens and some 🤡 like you would say you tried to tell us.\n\nYes, a correction is coming, you just have not fucking clue when. Might be tomorrow, might be years from now.  I did say I was hedged. 🖕 your ignorance and lack of intelligence to comprehend me saying that without having to repeat myself.", "score": 1, "replies": []}]}]}, {"body": "Are you GameofTrades?  😂", "score": 3, "replies": [{"body": "[removed]", "score": -1, "replies": []}]}, {"body": "There are stocks that are massively overvalued and alot of investors will lose money, I will agree on that point but can't agree on an actual crash. Retail investors make up a small percentage and barely move the market. It ain't a bunch of \"dumb kids\" that will bring it down. There are a ton of great opportunities right now, like no other time and markets are ripe for disruption. This isnt like the dot com bubble.", "score": 3, "replies": [{"body": "No, this isn't the dot com bubble. This is the dot com bubble on STEROIDS.\n\nLook at NDX 10 year chart. Parabolic. Gaining a percentage point every other day, these days. How do you think this ends? Do you even math, bro??\n\n> It ain't a bunch of \"dumb kids\" that will bring it down.\n\nOf course not. It will be brought down because it will simply be *decreed* to be brought down. Everything is being arranged to ensure that the market will crash. The signs and signals are literally everywhere. \n\nBut it will be the kids who lose all the money, and get the *blame* for it. That \"Robinhood\" crowd. You know why they named it Robinhood? Because they want you to think *you're* Robin Hood, stealing from the rich. But in reality it means \"Robbin the Hood\", as in raping you serfs for every dime you possess.", "score": 0, "replies": []}]}, {"body": "You forgot to tell us to stay off your lawn.", "score": 2, "replies": []}, {"body": ">  Many of you paper millionaires will become paper paupers. Many former millionaires will be living in their car, and then a refrigerator box, eating out of dumpsters.\n\nJoke is on you dude, Im already living in a refrigerator box and eating out of the dumpster.  Im not saying things cant get worse, but the delta will be less for me than it is for many others.", "score": 2, "replies": [{"body": "Sorry about that man. In a way, you are in a better position than the masses, because you already see how bad things can get. Keep your head up bro.", "score": 0, "replies": []}]}, {"body": "It's rather simple actually. The market won't completely collapse because the Fed won't let it. They'll keep interest rates low and keep the money machine churning. Sure we'll see some dips, but nothing catastrophic like you prophesize. \n\nMy hope is that instead of bailing out businesses the govt would finally do some good and bail out people. This would force business to become more efficient and allow people to live better. Yang was a terrible choice for president, but at least he understood that we should be giving *people* money instead of *businesses.* \n\nI like your Old Testament prophet vibe you got going though.", "score": 2, "replies": []}, {"body": "I thought Dr.Strange lost the time stone.", "score": 1, "replies": []}, {"body": "Ah yes. Even the inept can post.", "score": 1, "replies": []}, {"body": "I'm with Dave.  I'm calling my wife now to buy batteries, rice, beans, water and TP for the incoming doom.", "score": 1, "replies": []}]}
{"title": "Do you just make an income selling TSLA CCs?", "selftext": "I'm wondering if there's anyone that is consistently selling weeklies on this for at least the past few months or longer, is there some safe % strategy that you are going with, and do you believe that it is a safe method, or will Tesla start to go down maybe a week after the 21st?", "id": "kcpkq7", "created_utc": 1607916473.0, "score": 29, "upvote_ratio": 0.89, "num_comments": 53, "comments": [{"body": "There is absolutely nothing safe about TSLA. It's a stock that will be great until it rips your face off. You need to be okay with that before you trade it.", "score": 34, "replies": [{"body": "This! I made most and lost most off TSLA.", "score": 9, "replies": []}]}, {"body": "You need to search for \"TSLA\" in this sub. Read'em and weep, buddy.", "score": 10, "replies": [{"body": "I mean I bought quite a bit pre-split so I'm doing fine just don't have 100, but was curious", "score": 2, "replies": []}]}, {"body": "I'll never understand why people sell CC on meme stocks\n\nWhy not CSP? That may seem too obvious idk 🤷‍♂️", "score": 17, "replies": [{"body": "I only do CSPs on non-meme stonks. I've made a decent return selling CSPs on SPY and MSFT the last couple of months and I can sleep easy at night doing it.", "score": 12, "replies": [{"body": "You definitely sleep better at night\n\nCSP on MSFT or AAPL is basically banking on the world not collapsing so pretty safe, they also have strong support and resistance very easy to read and tend to grow in a very slight upward chanel so very easy to read as well\n\nIf you believe in TA you can watch Kaswrp on YouTube, he has a good understanding of both those stocks and give you the exact supports to watch for (aka to sell puts on)", "score": 10, "replies": [{"body": "Never heard of him, but I'll check him out. Thanks! I'm actually hoping my 200 shares get called away at 215 this week. I'll be up about $800, so not bad for a week!", "score": 4, "replies": [{"body": "Your Success is my success man 🙏\n\nWould be a great week for sure!", "score": 5, "replies": [{"body": "Absolutely! Good luck out there!", "score": 2, "replies": []}]}]}]}, {"body": "How much cash do you have sitting to do it?", "score": 1, "replies": [{"body": "I've got about $45k I play with. So I can sell two atm MSFT puts or one SPY put.", "score": 1, "replies": [{"body": "I've just started reading here and about spreads in general. Do you have to keep the full value of the contract as collateral for the trade? Ie roughly 36k for 1 SPY contract (360 x100) ?", "score": 2, "replies": [{"body": "Exactly. I've been assigned several times because I sell atm puts but I just hold until it goes back up while selling CCs.", "score": 2, "replies": [{"body": "Damn. I'm cash poor, everything is invested right now. Guess I'll consolidate some positions to sell CCs", "score": 2, "replies": [{"body": "I look at it this way. I made close to $6k since the end of Sept by selling CSPs. With my balance starting at about 39k, I never would have made that kind of bank unless I got really lucky. It just generates so much more cash selling options.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "I opened a diagonal this morning. I didn't want to csp for 50k plus but I did want to buy a Jan 22 400c for 27500. Collected 2200 selling a weekly.", "score": 1, "replies": []}]}, {"body": "Yeah I’ve been doing it for the past few months. It’s been a cash cow. Sell an ATM or OTM call after a big run up and cash out at 50% profit. Gotta have a plan for letting your shares get assigned or rolling out if it blows past your CC. I had a $500 CC that I had to roll out of. Cost me about $2k to roll it into a shorter dated $680 12/24c. Overall it’s been very good. I only have 140 shares so I’ve only been selling one call at a time", "score": 6, "replies": []}, {"body": "I don’t have enough capital to do Tesla Covered Calls even the poor man CC. Are put spreads a good idea for me?", "score": 5, "replies": [{"body": "As long as it doesn't drop haha. I wouldn't do put credit spreads on tsla except very short term if I thought there was very strong support", "score": 3, "replies": []}, {"body": "If you’re bullish then possibly", "score": 2, "replies": []}]}, {"body": "I gave up. It's so erratic, I find it better just to hold shares.", "score": 5, "replies": []}, {"body": "Tesla covered calls have been my sole source of income this year. You have to know exactly when and how to roll though. https://imgur.com/a/oi45LZe", "score": 15, "replies": [{"body": "How/when do you roll?", "score": 7, "replies": [{"body": "Up and out as soon as you're breached. With how quickly the stock moves, you have to be watching it closely. When possible, roll it down and in when it drops a decent amount. You can roll forever to avoid assignment, but you start capping your gains. Rolling back in can speed up the process of getting your current call to expire so you can sell a new batch of calls.", "score": 4, "replies": []}]}, {"body": ">https://imgur.com/a/oi45LZe\n\nWhat delta do you use, or how do you figure out which strike price to use to prevent assignment?", "score": 2, "replies": [{"body": "I used to do about 15 delta. However since we've hit 600 I've gotten more aggressive because I'm perfectly fine with selling at anything above 600, so I'll do 30 delta now.", "score": 7, "replies": []}]}, {"body": "Awesome!", "score": 2, "replies": []}, {"body": "Please, do tell.", "score": 1, "replies": []}]}, {"body": "If you sold CC's on this stock during the past few weeks you would have lost out on A LOT OF MONEY.\n\nThe whole reason why you shouldn't sell CC's on highly volatile stocks and expect to make a constant income off it.", "score": 12, "replies": [{"body": "I have first hand experience selling TSLA CC's and am curious how you've come to this conclusion. I sold 8 600 calls when TSLA was 430. It rocketed all the way to 650 and I kept rolling up and out every time my strike was breached. When it pulled back I rolled down and in. Taking in credit every time. I made 20k in the last month in premium alone, I still have my shares, and the underlying is still well below my current call strike.", "score": 15, "replies": [{"body": "I'm in this position now.  I have 3 jan 700cc I sold that is in the red.  I really don't want to let my shares go so I'll probably have to buy them back.", "score": 3, "replies": [{"body": "You do you, but I would NEVER buy back my call for a loss.", "score": 2, "replies": [{"body": "i don't want to pay tax on the gains thats why i am thinking about closing it.  i still have it i'm not sure yet tho", "score": 2, "replies": [{"body": "Got it. You sold a 700 though, I feel like you'll be okay. It's too soon to make a call anyway.", "score": 2, "replies": []}, {"body": "Same position. I am significantly green on my stock and the shares being called away would be a tax problem for me...", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "By rolling in, I mean closing a back month and selling a front month. The idea behind this is I want to have the calls expire sooner. Always roll for a credit, whether forward or backward.", "score": 2, "replies": []}]}]}]}, {"body": "CSP is the way to play this. Look at weekly 400’s. Not get rich money. But only way you’re gonna get assigned or go tits up is if Tesla really shits the bed. Possible. Not not probable.", "score": 5, "replies": [{"body": "Ties up a lot of collateral though for small premiums", "score": 4, "replies": [{"body": "> Ties up a lot of collateral though for small premiums\n\nDefine \"small\" - you can collect $515 (as of Monday close) for a 500 strike cash secured put that expires this Friday. That's a 1% *weekly* return on that money with only 4 trading days left in the week, all whilst mitigating your risk on a name that's arguably overbought.\n\nWhat are the odds the stock gets hammered 20% in the next 4 days? It's possible sure, but highly improbable. Especially with a vaccine around the corner. And even if it does tank, the *assumption* is you wouldn't mind being assigned a hot stock like $TSLA for a 20% discount.\n\nOf course, the reality is if it fell that far, that fast, there's a big reason. Maybe Elon launched himself into space and the rocket malfunctioned, etc. So you likely may not want to own it at that point. But my assumption and thesis is Tesla can continue to offer some pretty handsome premiums to options writers, as long as the markets command insane prices on these things.\n\nIf you have a better strategy on a highly volatile stock I'm all ears.", "score": 2, "replies": [{"body": "You make good points", "score": 1, "replies": []}]}, {"body": "420p for 36 days out returns 1.75%. Not crazy but that’s still per month.", "score": 1, "replies": []}]}]}, {"body": "I’ve learned my lesson - pennies in front of the steam roller. I’d rather hold Tesla stock, 2021 I’ll start selling calls against it", "score": 4, "replies": []}, {"body": "I've been doing it since about 6 weeks before the election.  I sell weekly covered calls worth about 0.5% of the stock price.  Is it safe?  I don't know.  I plan to hold onto the stock forever.  It will go up, down and sideways, but I hope to generate good income.\n\nIt might crash, but long term, Tesla will become like Google, Amazon, Facebook, Apple, etc.  It might even become bigger.  It's a huge disruption happening.", "score": 6, "replies": [{"body": ">It's a huge disruption happening.\n\nIt makes cars with a different type of engine, I don't see how it is as disruptive as the companies you listed before. If you want to take on this type of risk it's fine, but understand that it's a meme stock for a reason.", "score": -4, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "> Apple just made a phone with a different type of screen too, right? \n\nGood point, but I'd argue it's place a huge 'hype markup' on fashionable phones, simply because it's a cheaper product. Most (not all) people won't pay a 50% markup for a car that's cooler, the functionality is far more important. Sure, they have a head start in EVs but I don't think they'll remain market leader in this hugely competitively market.\n\n>They're poised to become the top distributor in self driving software, cell packs, utility scale batteries, charging, and possibly a few other industries.\n\nThey'll become market leader in some of these industries, and they'll lose in some of these as well. We'll have to see, but so far they barely have any products out yet, only R&D and in all these sectors there are many others trying to come out on top too. Meanwhile, Tesla is priced like it is an eternal monopolist in all of these sectors. There are probably scenarios you can think of that justifies a very high valuation, however at the moment with the high expectations that they have there are way more things that could go wrong than go well for them.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Yes I have, and I think driving a 2020 combustion engine Mercedes is just as comfortable but your opinion might differ. However my point was that all major manufacturers will quit combustion engines in the next few years so I don't believe Tesla's head start is sustainable.", "score": 1, "replies": [{"body": "When those manufacturers start buying Tesla batteries because Tesla has such a massive head start in the R&D as well as supply chain and manufacturing - you’ll see the real power of their tech unleashed.", "score": 0, "replies": [{"body": "Ouch, these comments only prove tesla is a massive bubble.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "It’s an energy company, using their advancements in energy to make a car, and home battery storage, and commercial battery storage, and solar power. But people see the car, so they think it’s a car company. \n\nA combustion engine can only be used for a couple narrow things. A battery has far broader reach. Look beyond the car.", "score": 2, "replies": []}, {"body": "This post won’t age well. Far beyond a “car” company.", "score": 2, "replies": [{"body": "RemindMe! 14 Dec 2025", "score": 1, "replies": [{"body": "I will be messaging you in 5 years on [**2025-12-14 00:00:00 UTC**](http://www.wolframalpha.com/input/?i=2025-12-14%2000:00:00%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/thetagang/comments/kcpkq7/do_you_just_make_an_income_selling_tsla_ccs/gftjpck/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fthetagang%2Fcomments%2Fkcpkq7%2Fdo_you_just_make_an_income_selling_tsla_ccs%2Fgftjpck%2F%5D%0A%0ARemindMe%21%202025-12-14%2000%3A00%3A00%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20kcpkq7)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}]}]}]}
{"title": "Day traded TSLA calls this week, $605 to $660 strikes at various points, always sold before close. Got the free PDT reset through WeBull and got to do like 6 day-trades despite being at <25k. Turned ~6k to 15.5k and cashed out", "selftext": "", "id": "kco22b", "created_utc": 1607910996.0, "score": 327, "upvote_ratio": 0.93, "num_comments": 56, "comments": [{"body": "“And cashed out” was the best play you made all week, nice", "score": 121, "replies": [{"body": "Best thing to do if you’re up gambling.", "score": 47, "replies": [{"body": "see you in a week", "score": 16, "replies": [{"body": "Lost everything plus some.", "score": 2, "replies": [{"body": "Sorry to hear bro. Gambling is hell of a drug.", "score": 3, "replies": []}]}]}, {"body": "See you at market open", "score": 13, "replies": [{"body": "You right", "score": 2, "replies": []}]}]}]}, {"body": "Nice job.\n\nNow do it again.", "score": 73, "replies": [{"body": "“First one is free”", "score": 72, "replies": []}]}, {"body": "Good job and fuck you", "score": 32, "replies": []}, {"body": ">If, however, you are unable to meet the EM call by bringing your account value above $25,000, Webull offers a One-Time reset for your PDT violation that can only be used once every 90 days. An EM call for being a PDT below $25,000 will restrict you from day trading.\n\nhttps://www.webull.com/hc/faq/745#:~:text=If%2C%20however%2C%20you%20are%20unable,restrict%20you%20from%20day%20trading", "score": 23, "replies": []}, {"body": "How did u get the reset?", "score": 13, "replies": [{"body": "Literally just clicked reset. They approved it next day and I was confused too.", "score": 33, "replies": [{"body": "After using Webull for barely any time at all, I've come the conclusion they don't have a single CLUE what they are doing over there.", "score": 18, "replies": [{"body": "It’s the fubu of wsb.", "score": 11, "replies": []}]}, {"body": "Wait so you can do more than 3 day trades in a 5  period day if they approve you despite <$25k?", "score": 4, "replies": [{"body": "<", "score": 3, "replies": [{"body": "Fixed", "score": 2, "replies": []}]}]}, {"body": "lol i just deposited enough to get over, which looking back is harder than hitting one button...wtf", "score": 3, "replies": []}]}]}, {"body": "In the words of the prophet, Steely Dan: \"Go back, jack. Do it again.\"", "score": 10, "replies": []}, {"body": "Did you buy the calls when the stock dipped below 600 twice this week,and if so what gave you the conviction to go in? In hindsight it was inevitable that it'd go back up but at the time it looked like it was going to keep drilling.", "score": 5, "replies": [{"body": "Actually I missed quite a few big morning rises because I overslept and just went with it. Predicted it’s rise", "score": 10, "replies": []}]}, {"body": "\n>and cashed out\n\nThis is the part you should be proud of, half of these idiots get greedy and hold until worthless then post loss porn with a face like this \n\nhttps://imgur.com/t/hide_the_pain_harold/UpHqI", "score": 4, "replies": []}, {"body": "No body tell him", "score": 8, "replies": []}, {"body": "The SEC would like to know your location.", "score": 7, "replies": []}, {"body": "First weeks free.", "score": 3, "replies": []}, {"body": "Take 10k put it in a mutual fund and yolo the 5k. Take the $500 left and do something fun, like hire a hooker", "score": 5, "replies": []}, {"body": "Nice", "score": 2, "replies": []}, {"body": "Do it again!", "score": 2, "replies": []}, {"body": "This is what I did too, nice work", "score": 2, "replies": []}, {"body": "Is this an ad for Webull?", "score": 2, "replies": []}, {"body": "What SPs and expiry dates were you playing with, OP?", "score": 2, "replies": [{"body": "$570, $600, $605, $640, $670 12/11’s, $670 12/18’s.", "score": 1, "replies": [{"body": "thanks", "score": 2, "replies": []}]}]}, {"body": "obligatory congrats & fuck you. \nsave some for uncle sam.", "score": 2, "replies": []}, {"body": "whats ur strategy when using one of ur limit day trades? are u just looking to buy dips on a high liquidity stock?", "score": 2, "replies": [{"body": "Yeah, was just swing trading dips since it’s really fucking volatile and liquid", "score": 2, "replies": [{"body": "im there with you brother, but i trade spy cause tesla premiums r jacked to the tits and im down to 3 digits", "score": 2, "replies": []}]}]}, {"body": "I personally called WeBull to complain about you (srs)", "score": 3, "replies": []}, {"body": "I'm a little confused by the fact that so many autists are closing out their TSLA this week, a few days before the S&P inclusion. Seems like the fact that the ETFs and such are obligated to buy about $77bn of TSLA on the close of the 18th, which makes up about 13.9% of outstanding shares, and more like 17% of the float, would be something that degenerate gamblers would want to take advantage of. I mean, a profit taken is a profit taken, yippee, but this is a very unique and rare event. Am I retarded? Is someone going to drink my milkshake on the 18th?", "score": 1, "replies": [{"body": "The fact you’re already talking about means that it’s most likely already priced in. Maybe. Probably. We’ll see is the only real answer.", "score": 3, "replies": [{"body": "But it can't be priced in! That's what is so absurd about this event. The bigger it gets, and the more \"priced-in\" it seems to be, the larger its % of the S&P becomes, and the more the ETFs are obligated to buy. And these funds are \"graded\" on their precision at tracking the S&P, so they should have no fucks to give about the price they have to buy it at. If a fund tracking the S&P ends up beating the S&P (for example, by rebalancing into TSLA early, at a favorable price), someone is getting fired, and the fund will be viewed as tracking poorly and taking unnecessary risks.", "score": 2, "replies": [{"body": "But they have to buy it as a percentage of their ETF/fund, so that price will ALSO be adjusted to automatically. If only it were so easy, but I hope you’re right and make a lot of money.", "score": 1, "replies": [{"body": "Oh I have no idea what I'm doing, let's make that clear. Right now I'm 500k synthetic in TSLA, on the 18th I'll convert it to actual shares (on margin!) for a few hours, then sell everything and roll around naked in tendies and blow.", "score": 1, "replies": [{"body": "MrDingus show us pictures like we're retarded\n\nremindme! 1 week", "score": 2, "replies": [{"body": "I will be messaging you in 7 days on [**2020-12-22 03:22:56 UTC**](http://www.wolframalpha.com/input/?i=2020-12-22%2003:22:56%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/kco22b/day_traded_tsla_calls_this_week_605_to_660/gfvuza5/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fkco22b%2Fday_traded_tsla_calls_this_week_605_to_660%2Fgfvuza5%2F%5D%0A%0ARemindMe%21%202020-12-22%2003%3A22%3A56%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20kco22b)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}, {"body": "Well, it basically worked. Set all the shares to sell \"on the close\", where they were matched against buy orders \"on the close\". Apparently a lot of buy order because it jumped from 665 to 695 for a split second, where I was filled. 100k net profit for a 1 week hold. Coulda been more if I had balls like my wife's boyfriend.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Well the ~10k brings me just about to net even since starting 2 years ago. In April I got 10k that month, September went from 10 to 30k before losing it all...had to bring balance to the force.", "score": 4, "replies": []}]}, {"body": "Keep it up and u will be a billionaire one day.", "score": 0, "replies": []}, {"body": "Put positions in screenshots or gtfo", "score": -8, "replies": [{"body": "U don’t see the TSLA 12/11’s?", "score": 13, "replies": [{"body": "o my b", "score": -7, "replies": []}]}, {"body": "Jealous much?", "score": 1, "replies": [{"body": "It looked like a screenshot of a balance, we usually spam those", "score": 1, "replies": []}]}]}]}
{"title": "Why TSLA will be a $2.65T Company by 2026", "selftext": "[deleted]", "id": "kd0f5n", "created_utc": 1607961963.0, "score": 11, "upvote_ratio": 0.57, "num_comments": 57, "comments": [{"body": "Why you might be right: TSLA is so overvalued and nobody seems to care. \n\nWhy you’re probably wrong: they don’t have reliable self-driving technology, they will likely lose a large share of EV as big companies start taking it back, even Amazon is hopping into self driving transport, TSLA doesn’t truly make money from their car sales, people will still be driving regular cars with gasoline. \n\nI hope you’re right and you do well for the reason that people keep bidding it up. But they are valued at a higher price of many of the large auto manufacturers combined. At some point, this bubble may burst.", "score": 34, "replies": [{"body": "Agree with your points.\n\nAlso, I don't know where the guy gets his delusional margins from. Tesla's reported gross margins are 20%!\n\nAlso, we haven't gone through a real refresh cycle yet. I was thinking about this the other day, but given how much of a pain it has been to get Model 3 production to where it is today, when are they going to move to next iteration of a Model 3?\n\nAlso, not sure about you, but I am pretty sure there are plenty of people out there who will consider an electric BMW, Audi or Porsche instead of a Model 3 or Model S", "score": 3, "replies": [{"body": "Especially in Europe!", "score": 3, "replies": []}]}, {"body": "Zoox stream coming up in 45 minutes\n\nBB and VLDR about to print", "score": 4, "replies": []}, {"body": "IMO:\n\nTesla will lose the longterm run against the big automotive brands like VW, BMW and Daimler. Tesla is a software company rather than an automotive company, their quality can't compete with the traditional brands. \n\nThe people who own a Tesla are young people who value environment and tech while having a high income. \nTraditional automotive companies usually target a wider market. \n\nAt the moment Tesla is a luxury brand and I don't believe they are going to change that any time soon.\nThis is important for my comparison of the selling points as a Tesla is bought because if their software while a BMW or Benz is bought for the name, quality and by those who love engines, cars and driving sports. \n\nAnother aspect for me is the strategy and the structure that Traditional brands could build in the last years. Not only do they have a whole network of suppliers but especially in the case of VW AG. If they find a successful solution they can bring these technologies onto every price range of car. \nThey can merge their capital to develop one technology which they can share between the brands while not having to develop the car itself. \n\nTesla is completely overvalued which is why I also think that it's a good investment for the next few years", "score": 4, "replies": [{"body": "Idk I think a Tesla mode 3 looks a lot more luxe and beautiful than an entry level bmw, and it’s faster too.", "score": 5, "replies": [{"body": "It looks like a Hyundai, but it is faster.", "score": 2, "replies": []}]}]}, {"body": ">they don’t have reliable self-driving technology\n\nYes they do. Their AI chip for self driving is years ahead of what any company could create.\n\n>they will likely lose a large share of EV as big companies start taking it back\n\nNo they won't, because the margin on competitors right now is significantly low. In fact, a lot of EV competitors would have to sell their cars at a loss to compete with a $30k Tesla model that's coming out. Slowly, competitors will be weeded out of the market. Also, they'll be losing revenue from their combustion engine sales, as people buy more Teslas.\n\n>even Amazon is hopping into self driving transport\n\nThey're 5 years away, and even then.. what are they going to do? Create Amazon brand cars? They *might* but that's another 5 years behind. 10 years behind Tesla. They could sell the tech to Nissan though *holds in laughter*\n\n>TSLA doesn’t truly make money from their car sales\n\nI know. They'll be making it from autonomous driving subscriptions and car insurance. Both have ridiculously high margins. The car is just the vehicle (no pun intended) to selling software, subscriptions and insurance to the drivers.\n\n>But they are valued at a higher price of many of the large auto manufacturers combined.\n\nThat's because they're literally nothing like any other auto manufacturer, other than the fact that how they'll sell subscriptions is through a car.", "score": 3, "replies": [{"body": "Tesla can't even manage to make profits on cars as it is right now and they expect to sell a car for 25k? They expect the government to expand their tax credits to offset these costs?", "score": 4, "replies": [{"body": "They make 40% margin on their cars and could make 90% margin on subscriptions and insurance.", "score": 3, "replies": []}]}, {"body": "I find it funny when people laugh at the whole Tesla being like a software company. Per your post, they have updates they can push to the car and customers can pay to unlock features through software only. Subscription model with this product is a given. People argue about stuff already in the product with customers already paying through that exact model.", "score": 0, "replies": [{"body": "Ford offers OTA updates on the Mach E and likely all future cars. Is Ford a software company now?\n\nVolvo and Porsche offer their cars on a subscription model. Are they a software company now?", "score": 2, "replies": [{"body": "BMW does it too. \n\nWould the cars you cited support a self driving software upgrade?\n\nCan the manufacturer push an upgrade the customer is likely to pay $10,000 for? Maybe a SaaS offering that can create recurring revenue?\n\nNo? The hardware doesn’t support that?\n\nSoftware doesn’t run in a vacuum. You need to have hardware already built to be forward compatible with what you could do in the future.\n\nYou’re confusing firmware upgrades with what we’re talking about here. My TV handles upgrades and so does my phone.", "score": -1, "replies": [{"body": "Tesla hasn’t proven its cars’ hardware can handle a self driving future either. Mine can’t find its way out of my driveway, it needs my attention at all times, it can’t navigate a parking garage, it can’t clean its own sensors... the list goes on. They’re going to get eaten alive by Zoox and Waymo for inner-city taxi cabs. They’ll maintain their lead on selling a personal vehicle with the best driver *assistance* system, but they won’t be the dominant player in the self-driving space, if they’re truly a player at all.", "score": 0, "replies": [{"body": "Not sure we’re in the same page here. By hardware, I mean the motors, actuators, sensors, etc that allows the car to be controlled by software. This hardware is, for instance, not present in a brand new F-150. No software update will make that truck move because the needed hardware is not present. \n\nTesla already has the needed hardware in their cars. That’s what makes the driver assist work. The self driving option is a software update. Just like any software, it’s not going to be perfect on day 1. Look at Microsoft and Apple, how many updates did they require? It’s still an ongoing task. \n\nThe main thing here, you can improve, fix and update the software without the customer having to go the shop. This is where product becoming (at least partially) like software changes everything. Why are software companies valued so much higher?\n\nTesla is already a product on the road (you know that obviously). The others have a lot of catching up. Zoox was founded in 2014 and went nowhere. Amazon bought them this year.", "score": 0, "replies": []}]}]}]}]}, {"body": "Have you seen ev sales in europe this year? Tesla is nowhere to be seen. In the us the situation might be different but tesla can’t maintain their big market share for that long", "score": 0, "replies": [{"body": ">tesla can’t maintain their big market share for that long\n\nOh yes they can! And they will. The competition you see now is too expensive for the makers to continue putting out. Tesla has the edge in creating EVs at a cheaper cost, and thus will continue to take more of the market", "score": 1, "replies": [{"body": "Where the hell are you getting that information from?! Their range is great compared to the cost but tesla’s are expensive in europe. The most popular ev this year, the renault zoe is like 2/3 the price of a new model 3.", "score": 1, "replies": [{"body": "Look up the margin in the EVs that \"compete\" with Tesla. Tesla's EVs make a 40% margin.", "score": 1, "replies": [{"body": "Cool, sure. But why won’t they sell them at a lower price to sell more in europe? You keep saying that tesla’s are the cheapest ev’s while also saying that they make the biggest margins. Which one is it? They aren’t the cheapest, and if they were, we would see it reflected in the price", "score": 1, "replies": [{"body": "They're working on a $30k model, and I do suspect this will happen. Tesla has battery tech way ahead of everyone else. They can create them cheaper. Tesla can be as competitive as they want with any other EV maker. In other words, they can control the market wherever they choose to sell.. this thinning the already narrow margins of competitors. Furthermore, why buy a competitor when you can get a Tesla with easily buyable autonomous driving when you'd like it? And maybe even cheap affordable car insurance?\n\nMaybe europe is a different deal. I'm imaging the US market mostly.", "score": 1, "replies": [{"body": "You’re talking like everything will go perfect with tesla, and that vw’s 150 billion and daimlers 70 billion dollar investment in electric vehicles will go wrong.", "score": 1, "replies": [{"body": "I admit that $2800 a share would have to be practically everything going perfectly. That's the risk I'm taking. I'm trusting in Elon.\n\nHonestly, I expect VW's and Daimlers research to not catch up to Tesla any time soon, if ever", "score": 1, "replies": [{"body": "You seem to be a really big fan of tesla, i suggest hopping over to r/electricvehicles to get to know a little about the competition", "score": 1, "replies": [{"body": "I'm actually not a fan. More of a fan of the business.", "score": 1, "replies": [{"body": "If you’re not aware of what the competition is doing, you’re not fit to give such a ridiculous price target", "score": 1, "replies": [{"body": "I don't care if you deem me fit based off what you believe that I know. You're free to come by and say it, but not disrespect me.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "I don't know the numbers at all but i'm european and i have seen a lot of tesla this year\nEspecially cab drivers", "score": 1, "replies": []}]}]}, {"body": "You had me at Amazon hopping in. \n\nThey bought Zoox which has had the same goofy golf cart prototype for years. Didn’t make it on their own and got bought out. \n\nYou forgot Uber, they’re selling their self driving tech. I thought those guys biz model depended on that. Now, they deliver food. \n\nAs to the other “taking it back”, let’s see:\nDomestic: they’ve been trying to tack back market share from the Japanese for 50 years with dismal results.\n\nEuros: let’s look at the biggest player VW (which owns a number of brands). They have “Mission T”. Google it.", "score": 1, "replies": []}, {"body": "ICE cars will be banned in the EU and UK in 10 years. so Europe will be 100% EV", "score": 0, "replies": [{"body": "Sure but there are plenty of EV players not just Tesla.", "score": 2, "replies": []}]}]}, {"body": "is this a shitpost? if the dutch east india company can have a market of 7 trillion, tesla will have a market cap of 10 trillion. your targets are too low imo", "score": 22, "replies": []}, {"body": "Never go full retard.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 8, "replies": [{"body": "Why? Set a !RemindMe .. short TSLA then?\n\nEdit: no answer", "score": -1, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "Intelligence? Your IQ is in the negative range.", "score": 4, "replies": []}]}]}, {"body": "**Defaulted to one day.**\n\nI will be messaging you on [**2020-12-15 16:24:43 UTC**](http://www.wolframalpha.com/input/?i=2020-12-15%2016:24:43%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/kd0f5n/why_tsla_will_be_a_265t_company_by_2026/gfto289/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fkd0f5n%2Fwhy_tsla_will_be_a_265t_company_by_2026%2Fgfto289%2F%5D%0A%0ARemindMe%21%202020-12-15%2016%3A24%3A43%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20kd0f5n)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": -1, "replies": [{"body": ">RemindMe! 5 years \"Did Tesla reach $2800\"\n\n \n\nRemindMe! 5 years \"Did Tesla reach $2800\"", "score": 1, "replies": []}]}]}]}, {"body": "But ThEylL bE a moNopOLy...", "score": 3, "replies": []}, {"body": "TSLA is the safe haven to store money for growth that will continue to beat the market long term. I have 50% of my portfolio in", "score": 2, "replies": []}, {"body": "By 2026, there will be a Tesla Stock Exchange, and it only trades $TSLA. =D", "score": 1, "replies": []}, {"body": "The world of autonomous driving is wide open for competition. I installed a Comma Openpilot system in my Corolla for $1200 and it drives the car just as well as a Tesla. And no monthly charges.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Like what? OP is retarded but so is this comment", "score": -2, "replies": []}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Retarded*", "score": 8, "replies": []}]}, {"body": "Thanks for the update Diane.", "score": -1, "replies": []}, {"body": "🚀🚀🚀🚀🚀🚀🚀🌚", "score": -1, "replies": []}, {"body": "Tsla 694.20 EOW", "score": -1, "replies": []}, {"body": "Cathie, is that you?", "score": -1, "replies": []}, {"body": "If tesla is the iphone of cars you're gonna be short about 5o% market share retard.", "score": 0, "replies": []}, {"body": "Tesla does not have the best battery tech, they don't even manufacture them, they buy the cells from companies like Panasonic", "score": 0, "replies": []}, {"body": "90% of EV's will be Tesla's? Get fucked bud.", "score": 0, "replies": []}, {"body": "RemindMe! in Jan 2026 \"TSLA trillionaire\"", "score": 1, "replies": []}, {"body": " RemindMe! 5 years \"Did Tesla reach $2800\"", "score": 1, "replies": []}, {"body": "TLDR\n\nHow heavy are the bags?", "score": 1, "replies": []}, {"body": "New paradigm!", "score": 1, "replies": []}, {"body": "Something for you to consider. \n\nWhat happens if the 50%+ cars are not EVs by 2030? Considering Tesla is losing market share in Europe and China, what happens if Tesla EV market share is only say 15%? What is your margin of error on those numbers?\n\nWhat happens if the self driving EV doesn't pan out in the next decade? What makes you think GM Cruise for example is far behind? What if Google and Amazon straight up buy or partner with Ford/GM? \n\nToyota just unveiled a solid state battery. What makes you think competitors are far behind? \n\nTesla has reportedly terrible quality. I have experienced some second hand. What happens if Tesla can't keep up demand while maintaining quality?\n\nI like your enthusiasm, but honestly putting everything in Tesla is stupid.", "score": 1, "replies": []}]}
{"title": "My stocks after hearing Pfizer's vaccine is being distributed and things can finally go back to normal", "selftext": "", "id": "kd0s93", "created_utc": 1607963110.0, "score": 225, "upvote_ratio": 0.98, "num_comments": 55, "comments": [{"body": "Even my pfizer calls are bleeding out..", "score": 61, "replies": [{"body": "Well the vaccine is already priced into their stock. Investors look at the future, stocks won’t change when shit happens that we all know about.", "score": 19, "replies": [{"body": "Priced in? You are kidding right? Show me how its priced in, ive only seen pay walls, it looks like $49-$51 would be the “priced in” number..", "score": 4, "replies": [{"body": "You are joking right? Stock already pumped last month from $33-$43 with the vaccine hype. and other vaccines are already superior due to the insane temperature that you have to store this vaccine at. \n\nThe autism in this sub never ceases to amaze me", "score": 11, "replies": [{"body": "Superior in shelf life, but not better in quality, if that were the case moderna would have been fda approved you fucking retard. $43 a share at $200bill for a company fixing to gross $10bill minimum? Even after the split with BNTX. Maybe im thinking value investing over “its priced in, and its gotta be cold, its bad, im gay and a bitch” like you", "score": 5, "replies": [{"body": "Says the guy whose options will expire worthless 😂😂 modernas vaccine is days or weeks away from approval retard.... they were just barely lagging behind Pfizer. You just went full retard, never go full retard. Look at the studies though, it is another mRNA vaccine that has higher efficacy levels. Don’t get all of your info from this sub....", "score": 5, "replies": [{"body": "Expire worthless nah, profit probably not, break even likely, baby loss most likely. Moderna is a small bitch fish in a large biotech pond, might have gains but they aren’t sustainable", "score": -1, "replies": [{"body": "Investment advice from a retard. I saw your post history... I’ll pass. They used to say Tesla was a small fish", "score": 6, "replies": [{"body": "Lmfao my guy... i was right on on oil and wrong so far on pfizer. 1-1 is a decent ratio", "score": 3, "replies": []}, {"body": "LMFAO BRO YOU OWN A STEINHART YOU BROKE DUMB MOTHER FUCKER LMFAOOOOOO GET YOUR BREAD UP", "score": 1, "replies": [{"body": "My dogs cost more than your portfolio", "score": 2, "replies": []}, {"body": "Dude you made posts about buying lab diamonds for your gf 😂 If I showed you the view from my house you would probably kill yourself on the spot", "score": 2, "replies": [{"body": "Lab made is better quality pussy for cheaper price pussy, go ahead show me and let me see them dogs too", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Ehhh good looking dogs, their owner is still gay", "score": 0, "replies": [{"body": "No denying that", "score": 1, "replies": [{"body": "You two need to calm down lol", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Jesus, it's not just bleeding right now, it's hemorrhaging at this point.\n\nPFE -3.35% after news of delivery of first doses of vaccine.", "score": 5, "replies": []}, {"body": "It's bad.  \n\nRDSA, EXO, ENLC, COP calls not doing well at the moment either", "score": 2, "replies": []}, {"body": "Sold my calls last week. 💰", "score": 1, "replies": []}]}, {"body": "The hype about the vaccine sends stocks up, actual vaccine sends stocks down. Wtf", "score": 43, "replies": [{"body": "[deleted]", "score": 36, "replies": [{"body": "Seriously, its only been this way for, I dont know, ever.", "score": 8, "replies": []}]}, {"body": "Buy the rumor, sell the news. It's one of the wsb commandments like buy high sell low.", "score": 12, "replies": []}, {"body": "Mind blowing how f’ed this market is...", "score": 1, "replies": []}]}, {"body": "My 12/31 PFE call just got gangraped", "score": 19, "replies": [{"body": "I feel your pain... was up 75% and got greedy waiting for 100% and now I’m checking into an autism clinic", "score": 13, "replies": []}, {"body": "Fellow 12/31 call holder lol", "score": 4, "replies": [{"body": "I bought 2 50 calls for it when they announced fda approval on friday, lowkey thought shit was gonna print 😂", "score": 3, "replies": []}, {"body": "hello fellow brothers", "score": 1, "replies": []}]}]}, {"body": "Two things:\n\n1 - removal of CoViD GAAP suspension\n\n2 - removal of default prohibitions (forbearance ending ---> mortgage defaults)\n\nJobs are not going to come back quickly and some percentage of the lost jobs are just gone.", "score": 13, "replies": [{"body": "I work in the mortgage space and you are incorrect.  Lenders are able to mark people late at the end of the year, and start foreclosure proceedings in 6 months, which generally take 2+ years.\n\nLess than 5 percent of mortgages in the country are not paid current as of now, and most of them will resume payments as normal January 1.\n\nLess than 2 percent of mortgages in the worst case scenario will go into foreclosure, with most of them being investment properties", "score": 3, "replies": [{"body": "While true, I think it underestimates the impact of mass evictions of renters (estimated 30-40 million) will have. This will cause some downward pressure on rents as units open up. Not saying mass mortgage defaults will occur, but the housing market might experience a small downturn in general. I still estimate only a 5-10% dip in the housing market nationally with regional fluctuations.\n\nSource:  wrote my economics capstone project on bay area housing market pre and post 2007-08 crash.", "score": 5, "replies": [{"body": "Not saying your economics thesis is incorrect, but 08 is not congruent with current housing market.  \n\nLending standards are literally the strictest in history, housing inventory is historic lows and so are rates.  \n\nI'm in the NorthEast, and right now there are so many \"discouraged borrowers\" who are not looking for homes because there aren't any for sale.  Anything that goes on the market will be purchased instantly, and with home equity at an all time high, the seller will even come out ahead.  Will this displace renters?  Maybe, but that doesn't affect us (investors and mortgage employee) as most of the units under pressure will be huge multi families.  Those stocks/companies will be under pressure for sure\n\nHousing starts/permits not sufficient for our current population growth.", "score": 1, "replies": [{"body": "Oh I 100% agree with your last statement. I am just saying there will be a one-time shock as all the evictions go through, which will cause a short term dip in the market of maybe 5-10% before stabilizing again.", "score": 1, "replies": [{"body": "For commercial/multi-family housing though, not residential.\n\nImportant distinctions.  Any home eligible for financing (4 units or less) will go off the market within 30 days, probably at a 10 percent over list premium", "score": 1, "replies": [{"body": "Depends on the region, but yeah. Coasts for sure. Mid-west and rust belt, not so much. Used to be a bigger problem before the Chinese started cracking down on dudes showing up with brief cases full of cash.", "score": 1, "replies": []}]}]}, {"body": "I don’t watch the real inventory numbers, but checking Zillow shows no shortage of the DC area. I just looked and the inventory while typing this and it’s is at the same level as a year ago.", "score": 1, "replies": []}]}]}]}]}, {"body": "Still boggles my mind how pfizer is fucking lower than it was Friday", "score": 8, "replies": [{"body": "Me too fam \n\n...me too 😢", "score": 2, "replies": []}]}, {"body": "I wish I knew what was going on with PFE, seemed like a sure thing", "score": 6, "replies": [{"body": "Bro I went deep in pfe calls\n\nTold my brother i was going to make bank when they authorized\n\n\n\nYikes.", "score": 4, "replies": [{"body": "same. we’re getting raped out here", "score": 1, "replies": []}]}, {"body": "They’re about as exciting as a wet blanket covered in dog hair. I bought a one day call after I heard good news on Thursday with FDA talk. Up 20% market close. Next day: someone got allergic reaction and got lil itchy, drops 2 bucks. \n\nThat stock is AIDS. Never again.", "score": 5, "replies": []}]}, {"body": "Must have bought gme short calls", "score": 2, "replies": [{"body": "Nah I actually had cash for a Monday drop. I was worried the news was gonna send stocks higher.", "score": 1, "replies": []}]}, {"body": "Im up, I don't know what you tards are doing wrong but today is a good day.", "score": 2, "replies": [{"body": "I've had one up day this whole damn month. November sent me to the moon, December pulling me back down.", "score": 5, "replies": [{"body": "December has been dogshit \n\nNovember I was flying high, back to november 1st balance today just about", "score": 2, "replies": []}, {"body": "Idk what to tell you man. Im up like 15% since December 1st. Joe Biden was the best thing to ever happen for my portfolio. \nIm mostly in automotive and renewables. Also aint been touching options much with premiums being so high.", "score": 1, "replies": [{"body": "Yeah, Joe Biden sent my shit soaring, but the failed stimulus relief is pulling me back down.", "score": 2, "replies": []}]}]}]}, {"body": "I just throw my money at TSLA whenever there is uncertainty in the market ez win", "score": 2, "replies": []}, {"body": "Anyone else gonna take the Pfizer shot and get temporary Bell’s Palsy lol\n\n\nhttps://www.google.com/amp/s/www.health.com/condition/infectious-diseases/coronavirus/covid-vaccine-bells-palsy%3famp=true", "score": 1, "replies": []}, {"body": "**You can keep WSB great by casting your vote. Does this submission belong on WSB?**\n\n| **Remove It (1)** | **Keep It (1)** |\n|--------|:-------|-------:|:------:|\n| [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=kd0s93&message=spam) | [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=kd0s93&message=approve)|\n\n[Click Here to Change Inaccurate Post Flair](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=postflair%20CHANGEME&message=kd0s93)\n___\n ^comment ^will ^disappear ^--- ^8 ^shitposts ^removed ^since ^last ^crash ^--- ^[information](https://www.reddit.com/r/wallstreetbets/wiki/votebot) ^--- ^[leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard) ^--- ^[REWARDS](https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands)", "score": 0, "replies": []}, {"body": "Pfizer is tied in with the CCP. Leaked emails came out. Pfizer will free fall. Buy puts!! Already picked up 250 put calls.", "score": 1, "replies": []}, {"body": "Sorry, your post has been removed by vote. Please don't delete the post if you think it's not spam as it may be approved later.\n\n___\n\nYou can either contact moderators or vote to restore this thread and punish the volunteer moderators responsible for spamming your post in the daily [WSBVoteBot action log](https://www.reddit.com/user/WSBVoteBot/posts?sort=new).", "score": 1, "replies": []}]}
{"title": "PFE has been a big mistake, do I bag hold or take the loss?", "selftext": "", "id": "kd1w22", "created_utc": 1607966438.0, "score": 23, "upvote_ratio": 0.81, "num_comments": 48, "comments": [{"body": "Bitch you have so many months, hold that shit. PFE is slowly trending upwards and those will be ITM soon", "score": 57, "replies": [{"body": "Agree. There is time on those options. People took some profits today, but PFE is a super-star right now, printing covid-tendies. Other competitors having been tapping out with sub-standard vaccine results. Gotta let these ride.", "score": 6, "replies": []}]}, {"body": "Same situation. You have long expirations. Hold", "score": 21, "replies": [{"body": "Whats your expiry?", "score": 1, "replies": [{"body": "Dude you literally have LEAPS. You bought leaps so you don’t have to worry about the temporary corrections that are gonna occur. Imagine having LEAPS back in March/April/May, seeing a correction happening then sell because of scared hands. With a year on your contracts, you’re golden.. and the shorter dated ones will recover... HOLD", "score": 2, "replies": []}]}]}, {"body": "Pfe never leaves its range . It just bounces around 30-40$ . I’m not sure how much more good news they can get...", "score": 17, "replies": []}, {"body": "hold that like a fart in a church hall retard", "score": 12, "replies": [{"body": "Lmaoo bruhh that fart is becoming a shart", "score": 3, "replies": []}, {"body": "About to shit my pants", "score": 3, "replies": []}]}, {"body": "Stay out of the markets.\n\nIt does not fit your constitution.", "score": 16, "replies": []}, {"body": "Average down until your run out of money to average. Then wait", "score": 9, "replies": []}, {"body": "I sold out Friday morning. Hard call.", "score": 5, "replies": []}, {"body": "I think they already blew all there good news", "score": 3, "replies": [{"body": "Definitely bought the news", "score": 1, "replies": []}]}, {"body": "PFE is going to cure the world of covid\n\nThat alone is worth 10000000 a share.\n\nStay the course", "score": 3, "replies": []}, {"body": "Hold dude, don't be a paper hand, LEAPS and you scare out of shit?", "score": 3, "replies": [{"body": "This is the reason i bought leaps and still got 15k cash, but im being a lil bitch thanks for the testosterone boost", "score": 1, "replies": [{"body": "You are good, until the pandemic is ended (which likely Q3-Q4 next year). PFE still have time and place to run up. Stonk always up and it works for LEAPS... no meme.", "score": 1, "replies": []}]}, {"body": "They do if the company is overvalued", "score": 1, "replies": [{"body": "I estimate the pandemic will continue until Q3-Q4 next year.\n\nPFE still have time and place to run up.", "score": 1, "replies": []}]}]}, {"body": "Lmao bruhhhhh time is your friend right now. Stay patient kemosabe.", "score": 2, "replies": []}, {"body": "If you have separate bread money, hold. If not, sell", "score": 2, "replies": [{"body": "Yah i got bread money but my balls are shrinking looking at these losses", "score": 1, "replies": [{"body": "Then sell man. Options are not for everyone. I learned that the hard way", "score": 2, "replies": []}]}]}, {"body": "Wtf these are leaps! Hold!!!!! Don’t fuckin sell these for huge losses... it will go up... just not this week apparently... chill dude", "score": 2, "replies": [{"body": "Thanks brody will be holding, i bought leaps just for these reasons but i am being a lil bitch, pretty sure my balls shrank quiet a bit today", "score": 2, "replies": [{"body": "Lol your good dude. You got so much time for these, by two or three weeks from now youll probably be solidly in the green man.. just looked at PFEs metrics and they are going to destroy their next earnings on Jan 26th.. so you’re going to see solid gains by mid next month at the absolute latest. I’d consider getting some leap calls for PFE today but I have like 100$ in buying power right now lol so I can’t afford it haha", "score": 3, "replies": [{"body": "Dang wish your buying power increases so you could buy some of these pfes and enjoy the ride to the moon, i will probably sell all my options once green cuz im a pussy", "score": 1, "replies": [{"body": "Haha man, I’m already on the moon lol, made 48k in the past 3months with leaps . Safest non autistic wsb retard way to go lol", "score": 2, "replies": [{"body": "Congrats and fuck u", "score": 1, "replies": [{"body": "Lol thanks 🙏good luck to you!", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Take the L.  Vaccine glut by 2Q21 according to Cramer", "score": 2, "replies": []}, {"body": "Daily refrigerated trucks are being loaded up with vials of liquid that is going to allow markets to reopen and global travel to resume. It will end the year-long onslaught of a disease that has shorn family bonds, ruined people's lives, led to god knows how great a rise in suicides. And on those vials there's going to be a little sticker that says Pfizer. Because Pfizer was ahead every step of the way. Nothing pfizer will ever do will raise their value higher than it has been and will be over the coming months. I say hold until the end of January and if your positions are in the green again at any point sell. If not, just cut your losses", "score": 2, "replies": []}, {"body": "Pfizer is a boomer dividend stock. If you invest in this you are looking for dividends not really price appreciation. I'd bail on these personally", "score": 2, "replies": []}, {"body": "Hold bro once PFE ships the vaccine to the public itll rocket faster my chromosomes", "score": 2, "replies": []}, {"body": "PFE has never been at $45 since the year 2000. Terrible stock to invest or have call options in.", "score": 4, "replies": [{"body": "Fuck im a retard", "score": 3, "replies": []}, {"body": "Not if you put it like me. Literally it was so overvalued. I called on the rumor and put on the news. It worked for me so far.", "score": 1, "replies": []}]}, {"body": "You have a while to go and it's still close to ITM. Time decay will likely be your biggest issue, but you still have a few months to worry about that.", "score": 1, "replies": []}, {"body": "Your strikes were definitely searching for a home run (based on how PFE has traded recently).... but you have time... if you're still a believer.", "score": 1, "replies": [{"body": "Im a retard, bought the news", "score": 2, "replies": []}]}, {"body": "Bro u have time", "score": 1, "replies": []}, {"body": "Why the fuck wouldn't hold this shit longer given that expiry is MONTHS away? What a retarded question.", "score": 1, "replies": [{"body": "Im a retard so i ask retarded question", "score": 2, "replies": []}]}, {"body": "You could have bought the stock and enjoyed the ride. However, hold and be patient", "score": 1, "replies": []}, {"body": "Take L", "score": 1, "replies": []}, {"body": "FWIW I was close to pulling the trigger on some similar bets. I still don't know how this shit works.\n\nI can understand why it didn't rocket up, maybe, but why is it tanking??", "score": 1, "replies": []}, {"body": "I learned during the summer that good news for Pfizer is bad stock prices.", "score": 1, "replies": []}]}
{"title": "VLDR; (Velodyne), our shiny chance to visit Pluto 🚀🚀🚀", "selftext": "No, not really, but close we will get!\n\n&#x200B;\n\n>Ticker; VLDR (Velodyne lidar)\n\n&#x200B;\n\n# Before we start:\n\nIf the corona vaccine was to be experimented on all of us WSB-ers first, the government would not be able to analyze if there were side-effects of autism and retardedness. Since, err.. yeah.\n\n&#x200B;\n\nHowever; At least we get to experience visiting other planets on our rocketships every once in a while, long before any other human (or GME bagholders)\n\n&#x200B;\n\nThats why this time, I have a whole new trip set up for us! First; make sure to fasten your seatbelts, put your oxygen masks on and lets flyyy away togehter, PLUTO HERE WE COME!\n\n&#x200B;\n\nLet me insert a rocket here as well: ••🚀•• so that the retards can follow along as well and help us reach Pluto. Here is yet another one; ••🚀••, you’re welcome.\n\n&#x200B;\n\n•\n\n&#x200B;\n\n>**TL;dr:** *VLDR is definitly undervalued, LAZR seems to get all the hype but VLDR is the sh\\*t!*\n\n&#x200B;\n\nEdit: Relevant news described by u/rook2pawn 12.15.20\n\n* Walmart just [announced](https://newsfilter.io/a/192ca51e35d25afb7e5af6198e8e469a) today in partnership with Gatik.AI is using Velodyne for their self-driving middle-mile delivery\n* Amazon just [demoed yesterday in partnership with Zoox](https://twitter.com/VelodyneLidar/status/1338535368770011136) is using Velodyne for their robotaxis\n* Velodyne just won [Silicon Valley Robotics Innovation award](https://www.stocktitan.net/news/VLDR/velodyne-lidar-s-velabit-wins-silicon-valley-robotics-innovation-ja5s5blmdxnl.html)\n* Velodyne is [partnered with Qualcomm](https://twitter.com/VelodyneLidar/status/1336452966107078656) Smart Cities\n* Velodyne is [partnered with NVIDIA](https://twitter.com/VelodyneLidar/status/1337129716625657858) for advanced hardware/software vision platform\n\n&#x200B;\n\n# My point;\n\n1. VLDR deliver long range sensor technologies for cars. This is relevant since we are indeed looking at a future where cars will be self-driven, and sensors is a very important part of ADAS (Automatic driving assistant system).\n\n[Source; Twitter.com\\/velodynelidar](https://reddit.com/link/kd45xy/video/m16uay3rd7561/player)\n\n2. Amazons new auto-drive Taxi (zoox) uses Velodyne’s technology-sensors. Which will likely be in production in the next three years.\n\n[Also, look at the sensors the car is using, definitly Velodyne sensors](https://preview.redd.it/d25w1n3vd7561.jpg?width=1557&format=pjpg&auto=webp&s=bda35586d2f50d67340fb49f3cafbcac473b5159)\n\n3. Earnings will  (weird if not) grow the following years because of delivery deals with Amazon and «soon to be» other great companies.\n\n4. Don’t miss out on Verodyne like you did on NVIDIA, shame on you.\n\n&#x200B;\n\nJoin us, and riiide the steady gains!\n\n&#x200B;\n\nCheck out these links as well;\n\n[https://www.bloomberg.com/news/articles/2020-12-14/amazon-s-zoox-unveils-robotaxi-for-future-ride-hailing-service](https://www.bloomberg.com/news/articles/2020-12-14/amazon-s-zoox-unveils-robotaxi-for-future-ride-hailing-service)\n\n[https://www.bizjournals.com/sanjose/news/2018/01/02/velodyne-lidar-san-jose-price-cut-apple-zoox.html](https://www.bizjournals.com/sanjose/news/2018/01/02/velodyne-lidar-san-jose-price-cut-apple-zoox.html)\n\n[https://twitter.com/VelodyneLidar/status/1338535368770011136](https://twitter.com/VelodyneLidar/status/1338535368770011136)\n\n&#x200B;\n\n&#x200B;\n\n>Price target:  🎯30-40🎯 by early 2021.\n\n&#x200B;\n\nCurrent holdings;\n\n100 Shares. Call; 30 by start of 2021.\n\n&#x200B;\n\n&#x200B;\n\nVLDR to PLUTO 🚀🚀🚀", "id": "kd45xy", "created_utc": 1607973131.0, "score": 84, "upvote_ratio": 0.89, "num_comments": 59, "comments": [{"body": "I see rockets🚀🚀, thats enough for me. Vldr to the atmosphere", "score": 28, "replies": [{"body": "I didnt even read the DD I just skimmed for rockets. Putting 70 strike 12/18 calls on VLDR see y’all on the moon 🚀🚀🚀🚀🚀🚀", "score": 4, "replies": []}]}, {"body": "Fuxk i bought vldr calls but now that this wsb agrees with me I feel I'm gonna lose money .", "score": 26, "replies": [{"body": "I been in red with them since i bought them over the last 2 weeks but now that wsb is here I'm seeing some hope", "score": 7, "replies": [{"body": "How did it go?", "score": 1, "replies": [{"body": "Regained about 28% still -68% 😂🤷🏻‍♂️", "score": 2, "replies": [{"body": "I think we made the exact same trade bro", "score": 1, "replies": []}]}]}]}]}, {"body": "vldr = very long dont read\n\nI cant read\n\nVLDR to the moon all in", "score": 15, "replies": []}, {"body": "I’m so in it’s disgusting.", "score": 11, "replies": [{"body": "Im in nice and deep.... yeeeeaaaaaah........", "score": 2, "replies": []}]}, {"body": "My 200+ commons want you to be right so bad.", "score": 6, "replies": []}, {"body": "Velodyne is introducing their new H800 tomorrow during their conference, which is what very well could be used on the Zoox, we’ll find out more tomorrow. Just strange that Zoox gets announced then a day later VLDR has a conference, could moon 🚀🚀🚀🚀🚀🚀", "score": 10, "replies": [{"body": "No they won't. \n\nFirst the H800 is a front facing lidar. It's similar to what Luminar offers. These are meant for ADAS. The lidars that Zoox uses are 360 lidars.\n\nSecond, Zoox (and basically every L4 company) has been slowly migrating from Velodyne products to Hesai. Half the lidars on their vehicle are now Hesai. I don't see why they would go back to Velodyne after spending all that effort to move their sensor suite to Hesai. Calibration and verification is not easy.\n\nNot saying the H800 won't be a success, but don't bet on any of these self driving companies using them. They are meant for legacy OEMs like VW.", "score": 5, "replies": [{"body": "What I meant was that they could announce their collaboration w Zoox during this conference not that the h800 is what’s on the Zoox because we know they’re using their pucks. Also I can confirm that they are using Velodyne lidar products as I talked to someone on Twitter who worked directly w this project and they confirmed the use of VLDR technology", "score": 6, "replies": []}]}, {"body": "You better be right I’m going all in", "score": 1, "replies": [{"body": "Well I already did so I hope so too", "score": 1, "replies": []}]}]}, {"body": "Yes pump this baby, I'm bag holding shares at $22.60 when shitron downgraded LAZR and then said VLDR is a better pick.", "score": 10, "replies": [{"body": "Same. Then both went down. Thanks shitron!", "score": 3, "replies": []}]}, {"body": "🚀🚀🚀🚀🚀🚀🚀🚀🚀 I got 30c for early next year basically my whole life savings so let’s get it 🤓", "score": 5, "replies": []}, {"body": "My worry is that Amazon eventually makes these products themselves, they have a history of trying to bring everything in house. I’d rather just go long Amazon", "score": 7, "replies": [{"body": "Amazon buying VLDR confirmed 🚀🚀🚀", "score": 22, "replies": [{"body": "Not gonna lie, this would honestly be a genius move by Amazon", "score": 8, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "See above", "score": 3, "replies": [{"body": "Lmfao", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "I'm sure those Velodyne lawyers will make those Amazon lawyers weak in the knees...", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "And others moved to Hesai.", "score": 2, "replies": []}]}]}, {"body": "This supports my current position; not even gonna read it, lets go!!", "score": 4, "replies": []}, {"body": "Does it concern anyone else that there are only 2 employees", "score": 10, "replies": [{"body": "\"The company is Aerotyne Industries. They're a radar company out of the Midwest, awaiting imminent patent approval on the next generation of radar equipment with huge civilian and military applications\"", "score": 18, "replies": [{"body": "\"If you sell $10,000 of this stock today, I will suck  your dick. And I HOPE this happens.\"", "score": 4, "replies": []}]}, {"body": "I'm seeing ~500 (2018) on Google. I also found one that said something like 282 a little further back. Where are you getting that figure?", "score": 5, "replies": [{"body": "He got it from robinhood lol", "score": 6, "replies": [{"body": "Yeah lol. Good to know it’s more than that", "score": 4, "replies": [{"body": "I believe that VLDR was made public through a spac, spacs only have 2 employees and they didn't update the information after the ticker changer", "score": 5, "replies": []}]}]}]}]}, {"body": "Clear shoulder-head-shoulder since June, you know what this means... 😉", "score": 3, "replies": []}, {"body": "🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀", "score": 3, "replies": [{"body": "Oh shit!  Well since you put it that way!", "score": 5, "replies": []}]}, {"body": "Let me help add some good nuggets\n\n* Walmart just [announced](https://newsfilter.io/a/192ca51e35d25afb7e5af6198e8e469a) today in partnership with Gatik.AI is using Velodyne for their self-driving middle-mile delivery\n\n* Amazon just [demoed yesterday in partnership with Zoox](https://twitter.com/VelodyneLidar/status/1338535368770011136) is using Velodyne for their robotaxis\n\n* Velodyne just won [Silicon Valley Robotics Innovation award](https://www.stocktitan.net/news/VLDR/velodyne-lidar-s-velabit-wins-silicon-valley-robotics-innovation-ja5s5blmdxnl.html)\n\n* Velodyne is [partnered with Qualcomm](https://twitter.com/VelodyneLidar/status/1336452966107078656) Smart Cities\n\n* Velodyne is [partnered with NVIDIA](https://twitter.com/VelodyneLidar/status/1337129716625657858) for advanced hardware/software vision platform", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Indeed", "score": 1, "replies": []}]}, {"body": "VLDR to the moon.  Citron just pumped it today while asassinating LAZR", "score": 4, "replies": []}, {"body": "my bags were getting awfully heavy, my head is almost above water which means a concreate slab is about to be dropped on my head", "score": 2, "replies": []}, {"body": "In and out on this one a few weeks back. 20c 3/19/22 printed for me when lazr was going nuts. High premiums though", "score": 2, "replies": []}, {"body": "This is my sleeper stock I’ve been watching a few months. Glad you guys are excited about it finally.", "score": 2, "replies": []}, {"body": "Even after today?", "score": 2, "replies": [{"body": "Do you base your strategies on single day gains? There was a down-fall because people sold their stocks they have been bagholding since 8th of December (today was the highest stock price since). Hold until 2021 if you want to be profitable on this one.", "score": 1, "replies": []}]}, {"body": "Lost all my money from listening to the advice in this idiotic subreddit. Over the past few month been working on smart trades to earn it all back. This play finally got me back to where  I started   \n\n\nThank you  [u/ff21mars](https://new.reddit.com/user/ff21mars/)", "score": 2, "replies": []}, {"body": "We just gonna ignore the head and shoulders in the daily chart? Even with the help of gay citron they still couldn't break price lvl.", "score": 3, "replies": [{"body": "Technicals are worthless when they don't align with our confirmation biases.", "score": 7, "replies": []}]}, {"body": "Voo long, didn’t read", "score": 2, "replies": []}, {"body": "'\\&#x200B;'", "score": 1, "replies": []}, {"body": "Silicon Valley based run by an Indian engineer to the moon all the way", "score": 0, "replies": []}, {"body": "Thoughts on Hesai?", "score": 0, "replies": []}, {"body": "Yall pumping VLDR now??? lmao lets ban all ex-spacs", "score": -9, "replies": []}, {"body": "CGRO has tiny market cap compared to this and LAZR", "score": 1, "replies": []}, {"body": "Looks like the car from westworld", "score": 1, "replies": []}, {"body": "so calls on E**M** **V**EE **I**EYE ES**S?**", "score": 1, "replies": []}]}
{"title": "Anatomy of a Call Option in 60 Seconds ft. AMD", "selftext": "", "id": "kd8qa6", "created_utc": 1607986538.0, "score": 691, "upvote_ratio": 0.95, "num_comments": 53, "comments": [{"body": "Retirement progress meter 💀💀💀", "score": 154, "replies": [{"body": "For the person who sold you the contract...", "score": 23, "replies": []}, {"body": "Bought a contract with 250% IV, it took me all the way to retirement and then kept going all the way until I died", "score": 3, "replies": []}]}, {"body": "I learned absolutely nothing from this which is way better than average for a wsb post", "score": 153, "replies": [{"body": "At least it didn’t make you dumber.", "score": 28, "replies": [{"body": "Spaek for urselv", "score": 13, "replies": []}, {"body": "Sup Algernon.", "score": 3, "replies": []}]}]}, {"body": "\"Volume and open interest...this is basically how many people want to fuck the contract\"\n\nYour words are comparable to that of a young Shakespeare", "score": 50, "replies": []}, {"body": "We don't need the title screen for 10s you stupid fuck", "score": 47, "replies": []}, {"body": "Finance for ants*", "score": 46, "replies": [{"body": "Fine ants.", "score": 21, "replies": [{"body": "🐜", "score": 2, "replies": []}, {"body": "/r/fineants", "score": 1, "replies": [{"body": "I am disappointed this is not a real sub", "score": 5, "replies": []}]}]}]}, {"body": "The higher the IV, the closer you are to retirement or the closer you are to going long on $ROPE.", "score": 36, "replies": [{"body": "$ROPE and retirement are the same thing though. With both, you retire from working.", "score": 7, "replies": []}]}, {"body": "Just like my profits, this writing in this video was something I could not see.", "score": 12, "replies": []}, {"body": "Are you trying to imply AMD is an imposter in my portfolio?", "score": 7, "replies": []}, {"body": "I always forget to check IV and it really grinds my gears", "score": 4, "replies": []}, {"body": "Assuming you had just bought those options at $91, this age real fucken well. To the moon tomorrow!", "score": 6, "replies": [{"body": "haha I’m just here for the lols. all video contents are, as Soulja Boy would say, “cap”", "score": 1, "replies": []}]}, {"body": "This is gold. Don't you dare pull out of my girlfriend tonight mister", "score": 4, "replies": []}, {"body": "This was absolute gold", "score": 3, "replies": []}, {"body": "This is good because I’m illiterate. Any chance you could make this into a picture book?", "score": 3, "replies": [{"body": "For Golden retrievers?", "score": 5, "replies": []}]}, {"body": "Greeks in a future episode lol - SKIPPED", "score": 3, "replies": []}, {"body": "My man just earned a sub. Fast, simple, to the point with humor.", "score": 2, "replies": []}, {"body": "You sir have gained an austist subscriber", "score": 2, "replies": []}, {"body": "Yup I’m subbing to this channel", "score": 2, "replies": []}, {"body": "Can you do one for $94c 12/18?", "score": 2, "replies": [{"body": "Lol. I hope you’re being sarcastic", "score": 2, "replies": [{"body": "Haha yeah but I fucking loved that video. Also that 94c paid today. Cheers from iraq", "score": 1, "replies": []}]}]}, {"body": "Excellent.  Thank you", "score": 2, "replies": []}, {"body": "cool.. went allin", "score": 2, "replies": []}, {"body": "I liked your first episode better. This one is actually trying to teach me something, and I don’t like it.", "score": 2, "replies": []}, {"body": "I can’t read but I also can’t listen for 60 whole seconds.", "score": 2, "replies": []}, {"body": "OMG i'm literally in tears laughing hahahahhaha \n\nThe best!!!!\n\nOMFG - 5 stars!!! and I mean it. You should see my platform, half of the shit I don't know - it goes into abstract mode... And none of the professional traders will Know or Care and I'm professional trader! Retards, if you don't understand this sarcastic crap elementary crap - just buy stocks and hold to them. Its very, very hard to make money in the market. It would make seance, but not in these markets, it is an absolute retardation the way market acts!. And Yes, Cramer is paid retard!!!! Don't listen to this autist.", "score": -1, "replies": []}, {"body": "0:38\n\nNoice", "score": 1, "replies": []}, {"body": "I want stick figures!", "score": 1, "replies": []}, {"body": "Dad?", "score": 1, "replies": []}, {"body": "u/savevideo", "score": 1, "replies": [{"body": "###[View link](https://redditsave.com/info?url=/r/wallstreetbets/comments/kd8qa6/anatomy_of_a_call_option_in_60_seconds_ft_amd/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo)", "score": 1, "replies": []}]}, {"body": "Now this may be the smartest post I’ve seen here", "score": 1, "replies": []}, {"body": "not bad", "score": 1, "replies": []}, {"body": "The chode at 0:37 lol", "score": 1, "replies": []}, {"body": "Continues trading stonks.. fuck", "score": 1, "replies": []}, {"body": "100th sub on YouTube I’m honored", "score": 1, "replies": []}, {"body": "Is it bad I watched this three times?", "score": 1, "replies": []}, {"body": "What a nerd. I came here for the greeks.", "score": 1, "replies": []}, {"body": "Why’s it so god damn far away", "score": 1, "replies": []}]}
