{"title": "My Current Portfolio: Thinking of selling FB & VOO to add NET, IDXX, and more AVGO, MELI, TSLA. Thoughts?", "selftext": "I'm 23 and started my portfolio in April this year. I am pretty satisfied but would like to trim down to 10-12 stocks possibly. Thinking of selling FB and VOO (and others, open to suggestions). I want to add NET and IDXX to my portfolio (also open to suggestions here on what to add), and increase my shares in AVGO, MELI, and TSLA. I also have a lot of money saved up already to put into the market. Outlook is long term, with possibility of taking some profits in 5-10 years. Any thoughts or recommendations? Thank you!\n\n&#x200B;\n\n|Stock|Allocation|Gain|\n|:-|:-|:-|\n|AAPL|12.03%|47.61%|\n|AMZN|5.23%|13.35%|\n|AVGO|7.72%|38.75%|\n|BABA|10.11%|\\-9.52%|\n|FB|3.71%|9.28%|\n|MELI|0.41%|27.50%|\n|MSFT|5.03%|23.38%|\n|NEE|3.29%|10.33%|\n|NFLX|4.45%|18.34%|\n|NVDA|8.62%|20.66%|\n|PYPL|7.37%|53.85%|\n|SHOP|3.66%|14.47%|\n|TSLA|9.20%|89.07%|\n|VOO|1.31%|9.27%|\n|VTI|17.87%|36.54%|\n|||***32.36%***|\n\n&#x200B;", "id": "kku3xe", "created_utc": 1609031411.0, "score": 17, "upvote_ratio": 0.87, "num_comments": 56, "comments": [{"body": "FB has been stagnant lately. Lots of different things limiting the markets perception of its value. This makes it a rather undervalued stock and thus a good stock to hold on to, especially if you’ve held it for less than a year. \n\nUnless there’s something else driving your reallocation, I’d hold until the next earnings report (end of Jan). Expect a bump as the market is reminded that FB is a money making machine with low debt and a very good PE.  \n\nOh hell... buy more actually!", "score": 9, "replies": [{"body": "Definitely understandable. I actually bought more FB a month ago. Think I will hold onto it after seeing more comments regarding it. Thank you.", "score": 1, "replies": []}]}, {"body": "why do you sell fb, 2021 is recovery year and digital advertising will definitely benefit.", "score": 5, "replies": [{"body": "Yeah, definitely rethinking that. I haven’t sold anything yet. Main things I’m thinking of selling now are NFLX and VOO", "score": 2, "replies": []}, {"body": "Can you explain your logic on 2021 being a recovery year for digital advertising though?", "score": 2, "replies": [{"body": "Assuming they’re referring to businesses/sectors bouncing back after cutting ad spend in 2020- travel in particular will be massive once people are vaccinated", "score": 2, "replies": []}]}]}, {"body": "PLTR", "score": 13, "replies": [{"body": "I’ve seen a lot of comments going for pltr what exactly is it and why will it sky rocket in 2021?", "score": 5, "replies": [{"body": "Software company that makes a data analytics product. Market cap is around 50 bill and they've been incorporated since roughly 2003. Right now, they make their revenue primarily, although not exclusively, through government contracts. Many are speculating that they will soon start developing income streams in the private sector. Those who I have talked to say their software is sticky and very useful. \n\n&#x200B;\n\nI discovered them  because whenever someone wicked smart at my job left, a disproportionate amount of the time they were going to work for PLTR. Always very smart, competent people. I did more research and decided to open a position.", "score": 5, "replies": []}, {"body": "It’s just a bunch of retards from wsb lurking in here", "score": -3, "replies": []}]}, {"body": "I see so many conflicting opinions on this stock and am honestly afraid to go in on it based on that. I suppose a share or two would not be bad though.", "score": 5, "replies": [{"body": "shit\nthis company will skyrocket", "score": 2, "replies": [{"body": "And what is your reasoning for that?", "score": 4, "replies": []}]}]}]}, {"body": "The BABA drama with Jack Ma is concerning to me.  What’s your take?", "score": 3, "replies": [{"body": "It’s definitely concerning, but I think BABA is way too big and generates too much revenue for China to go too hard on them.", "score": 4, "replies": [{"body": "You just answered exactly why BABA is concerning; it's way too big and generates too much revenue for China.", "score": 2, "replies": [{"body": "I think China would scare future and current Chinese companies if they go too hard and would stifle growth for those companies. And it would scare US investors from ever putting money into Chinese stocks, if they haven’t already. It can definitely go both ways.  China can be unpredictable with their politics, but I think they know not to go too crazy.", "score": 1, "replies": []}, {"body": "China claims to be a communist country but they know that BABA is too beneficial for their economy to cause a trainwreck", "score": 1, "replies": []}]}, {"body": "Definitely but buy on hong kong if you can", "score": 1, "replies": [{"body": "The HK shares will always have the same price as the NYSE ones. They're convertible.", "score": 1, "replies": [{"body": "Still us stock price might take a dump if alibaba gets delisted", "score": 0, "replies": []}]}]}]}]}, {"body": "Your young with money. Please don’t fall into the index fund trap. Buy and hold good company’s that’s it. So many boomers scared of single stocks", "score": 5, "replies": [{"body": "Cathie Wood would like a word with you", "score": 4, "replies": []}]}, {"body": "If you don't need the cash then leave these alone. Read up on the coffee can portfolio. You're overweight the \"stay at home\" trade, so if you really want diversification then I would pare TSLA back to 4.5% and VTI back to 10%. Think about adding some preferred shares or dividend stocks to add income that you can reinvest in these or other shares.", "score": 2, "replies": [{"body": "Yeah, I definitely don’t need cash right now. How are TSLA and VTI “stay at home” stocks? I can see your logic for others holdings I have but not those two.", "score": 2, "replies": []}]}, {"body": "Look at VIAC", "score": 2, "replies": [{"body": "I like that dividend. What do you think of future growth?", "score": 1, "replies": [{"body": "Very bullish on the upcoming investor day in early 21. Pluto TV is huge they just doubled revenue and it’s a clear launch to CBSAA and Showtime. Overall it’s probably the best streaming stock with legacy catalog and production plus strong streaming after Disney. Proven hit maker with big growth prospects.", "score": 2, "replies": [{"body": "I’ll definitely have to look into these things you mention, thank you. In terms of legacy catalog though, I don’t think anyone can beat Disney. It’s just too timeless and has captured hearts of all ages. And when you pair that with new Star Wars and marvel content, it’s game over in my opinion.", "score": 1, "replies": [{"body": "true and I’m also long DIS but if you look at the possibilities for reboots  older IP VIAC has more than everyone. I love what they are doing with Star Trek and MiraMax is very exciting. Take a look. Very exciting and no one seems to know how much they have going.", "score": 2, "replies": [{"body": "Yep, I’ll definitely look into it. Really really regretting selling the DIS shares I bought at $100 in April 😬", "score": 2, "replies": [{"body": "Yea it was a hard trade cause of parks. I am thinking this VIAC I day could play out even better than that cause of the huge content pipeline that’s cost leveraged a cross platforms. Neither  Cable or streaming pays the full rate of cost because of the other and there are so many different ways to monetize content and there is so much IP that can be remade.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Put some money in INSG. People forget that 5g is going to become the new norm and mine as well get into a company before the explosion", "score": 2, "replies": [{"body": "Thats why I’m big on AVGO + their dividend is insane", "score": 1, "replies": []}]}, {"body": "That would be a smart [move!](https://youtu.be/2Tr7MjtYoIY)", "score": 1, "replies": []}, {"body": "Should sell it all for entirely GME", "score": 1, "replies": [{"body": "Lol, can you explain your logic on that?", "score": 1, "replies": [{"body": "Oh your taking me seriously. I'm trolling. Be smart with your money", "score": 7, "replies": [{"body": "Haha I figured you were, I see some crazy things on here though so it’s hard to know what is serious or not. Adding 1-2 shares short term to then increase my stakes in my main holdings may not be a bad idea tho.", "score": 1, "replies": [{"body": "If your gonna do some high risk shit gme isn't a bad piece of advice\nFair value is $50 but its also under a short squeeze. So could explode. Go watch a YouTube video about the gme short squeeze.", "score": 3, "replies": [{"body": "Will do, thanks", "score": 1, "replies": [{"body": "DO NOT DO", "score": 2, "replies": [{"body": "😂😂😂", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "TSLA is not a stay at home stock, but it has been a trade from home stock. Your gains on it are amazing. Take some profits. VTI is the whole market. The whole market is not going to do as well as individual securities you might find. You eventually want to have a boring 60/40 portfolio to pay for your retirement, but at 24 you probably want more growth to pay off debts or save for down payments on something. That was my logic; feel free to disagree if I am off base.", "score": 0, "replies": [{"body": "I understand what you are saying. But based on your comment about me being young, it sounds like you are in support of my current holdings though?", "score": 1, "replies": [{"body": "Yes. The coffee can strategy (forget them and come back in a year or five) will work for most of these. The only two risks I see are anti-trust lawsuits against AMZN, BABA, or FB; but MSFT survived such shake downs in the 1990's and is still around. :)", "score": 2, "replies": [{"body": "Yep, I agree that all these companies are not going anywhere anytime soon, though they may have short to mid term pullbacks. It seems FB faces a new lawsuit everyday yet they are still going pretty strong. I think AMZN and BABA will be okay. Any company that big is going to face scrutiny, especially in the tech space when it comes to data, but they are way too big and powerful to go down in my opinion. \n\nTaking profits on TSLA is a tough one for me. Especially with them being added to S&P500 recently. Any pullbacks they have just get bought up I feel because so many want to own TSLA at a good price; they are so popular and have that “it” factor to them.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Thank you for the advice. I fear I will not be diversified enough if I cut it down to my 5 best performers. I would like to go with 10 stocks at most maybe. Do you have any recommendations on what to remove?", "score": 2, "replies": [{"body": "[deleted]", "score": -3, "replies": [{"body": "Sounds good, thank you for the advice!", "score": 2, "replies": []}, {"body": "Don't know why you're getting downvoted re: diversification, because you're absolutely correct.  People blindly espouse the mantra of diversification without realizing they're OVER-diversified and spread too thin, minimizing their gains.\n\nDiversification is for maintaining wealth, concentration is for building wealth.  If you want diversification so bad just buy an index fund and be done with it.", "score": 1, "replies": []}]}, {"body": "Keep AAPL, AMZN, FB and MSFT. Take some profits on TSLA and keep some if you want. Ditch the rest.\n\nDon't worry about antitrust with AMZN and FB. If they get broken up in the next decade they're worth more (you'll have shares in AMZN, FB, AWS, Instagram, WhatsApp, etc).\n\nAntitrust with BABA is different than antitrust in the US with AMZN and FB.  China don't play games.  If the CCP decides they've had enough of you, you're DONE.", "score": 1, "replies": []}]}]}, {"body": "XL, BLDP, and PLTR are my stocks for 2021", "score": 1, "replies": [{"body": "At what price range would you buy PLTR?", "score": 1, "replies": []}]}]}
{"title": "So is there gonna be a crash in january?", "selftext": "[removed]", "id": "kl7fpy", "created_utc": 1609089953.0, "score": 0, "upvote_ratio": 0.37, "num_comments": 59, "comments": [{"body": "Impossible to know.\n\nI lived through the dotcom boom and thought it was going to crash about 2 years before it did. \n\nI saw outrageous home price inflation in 2003-2004 and refused to buy a home because it was going to crash. It took 2+ years for that crash to actually happen.\n\nI did have puts (and calls) during the Feb [2017... or 2018 if I remembered it right] crash. For that one I thought it would crash at the end of Feb. I was wrong... it happened sooner. Unfortunately, I thought it had further to fall so I didn’t close my puts at or near the bottom. I also then thought the volatility would continue... which it didn’t.\n\nPoint is: nobody knows.  You may be right that it will crash but it will take far longer than you think, or it might happen two weeks later.", "score": 22, "replies": [{"body": "What was the February 2017 crash?", "score": 4, "replies": [{"body": "That was me trying to remember the year without checking: https://money.cnn.com/2018/02/05/investing/stock-market-today-dow-jones/index.html\n\nFeb 2018... lovely.", "score": 3, "replies": [{"body": "Ah no worries. I figured a 2017 one must have been so bad I blocked it out.", "score": 2, "replies": []}]}]}, {"body": "You make it sound like you are old as fuck 30 year old.\n\nBut what we do know, there is always a rebound, even if its thanks to inflation.", "score": 0, "replies": [{"body": "30, I wish!", "score": 1, "replies": [{"body": "I would delete my statement, but I rather be proven wrong and let the other person know I was wrong. But im 34 and went through all of that. Hence my wrong assumption.", "score": 2, "replies": []}]}]}]}, {"body": "I hope so. I don’t want to pay $500k for a 1,200 squarefoot townhouse", "score": 31, "replies": [{"body": "Underrated comment", "score": 3, "replies": []}, {"body": "That's a mansion on the lake in the midwest.", "score": 3, "replies": []}, {"body": "You poor fool, if we crash you’ll be paying $1mil for that house. Crashes don’t affect rich people. They will keep buying everything while mortgage rates are at a lifetime low", "score": 1, "replies": [{"body": "I have enough money saved up to make a purchase when it crashes haha", "score": 1, "replies": []}]}]}, {"body": "I declare, \"stonks go up.\" There you go. No more crash in Jan. Thank me later.", "score": 39, "replies": [{"body": "This is the way.", "score": 7, "replies": []}, {"body": "You can’t just say “stonks go up” and expect anything to happen...", "score": -19, "replies": [{"body": "It was a joke since OP said \"people\" were saying there's gonna be a crash so he's wondering if there will be a crash lol I was just telling him that stonks go up so he can also wonder if they're gonna go up.", "score": 5, "replies": [{"body": "But it’s not a joke", "score": 4, "replies": []}]}, {"body": "You’re not listening", "score": 2, "replies": [{"body": "You haven’t watched The Office, have you?", "score": 3, "replies": [{"body": "Is it on after billions? I don’t watch anything but billions", "score": 3, "replies": []}]}]}]}]}, {"body": "Who cares. Buy the dip if it goes down. Bc after 🚀", "score": 10, "replies": []}, {"body": "No. Take your post to r/investing or smtg but over here all we wanna see is yolos", "score": 19, "replies": []}, {"body": "Brovid-22 will be here by then so yeah maybe", "score": 6, "replies": []}, {"body": "Ban. \nThey. \nOnly. \nGo. \nUp.", "score": 15, "replies": [{"body": "What do you mean im asking a question not saying there gonna go down", "score": -16, "replies": [{"body": "Up", "score": 3, "replies": []}, {"body": "I mean you should get banned. Because stocks only go up.", "score": 0, "replies": [{"body": "Fair enough", "score": 1, "replies": []}]}]}]}, {"body": "People are saying 😂", "score": 9, "replies": [{"body": "They.", "score": 0, "replies": []}]}, {"body": "Buying Jan spy calls bc of this post", "score": 4, "replies": []}, {"body": "Crash in December", "score": 4, "replies": [{"body": "Go", "score": 2, "replies": []}]}, {"body": "Tax Loss Har-vest-sting!", "score": 2, "replies": []}, {"body": "Ok let me think, January Inauguration \nAfter little destability because Trump ,,Market will be a little bit red.\nAfter Biden say no Oil ...only Green fuel\nSo .... TSLA go up 4206.9 6/9/21 🚀🚀🚀", "score": 2, "replies": []}, {"body": "Who cares lol", "score": 2, "replies": [{"body": "Only", "score": 2, "replies": [{"body": "Up", "score": 2, "replies": []}]}]}, {"body": "There's two sides to this arguement....", "score": 2, "replies": [{"body": "It’s actually *too", "score": 1, "replies": [{"body": "There's used to be a shop in West Edmonton Mall named Wild West Collectables... Any connections?", "score": 1, "replies": [{"body": "Nope just a coincidence", "score": 3, "replies": []}]}]}, {"body": "One right side to this argument.", "score": 1, "replies": [{"body": "The bull in me agrees.", "score": 1, "replies": []}]}]}, {"body": "Ban", "score": 2, "replies": []}, {"body": "This week gonna be bad", "score": 0, "replies": [{"body": "For bears", "score": 1, "replies": []}]}, {"body": "People are saying you're gonna take a shit at 7pm, so are you gonna take a shit?", "score": 1, "replies": []}, {"body": "Correction then recession but probably not a crash. Might be later than Jan.", "score": 1, "replies": []}, {"body": "Crash = buying opportunity, so have enough available cash to get in and ride the recovery. If you think a crash is coming you can hedge with gold, etc.", "score": 1, "replies": [{"body": "Or just sell half your current positions and sit on the cash.  Gold, btw, is oddly still up along with stocks.  Everything is up at the moment.", "score": 2, "replies": [{"body": "Yep, I did that very thing at the beginning of Aug. (mis-timed it by a month), but had plenty of cash to buy in Sept/Oct. when the market dropped.", "score": 1, "replies": []}]}]}, {"body": "I advise you to go read what people were saying in April", "score": 1, "replies": []}, {"body": "Yes but actually no", "score": 1, "replies": []}, {"body": "I expect there to be a crash around June and above.", "score": 1, "replies": []}, {"body": "January is usually an extremely good month for the market.. I am looking for something mild to occur around February.\n Just fyi.. the market is no longer behaving the same as before. Drops are being bought or are simply never occurring. Vix has stayed elevated but price action has changed somewhat.\n\nUnless there is some new risk event that it hasn’t experienced before (not covid).. we’ll never see the monster drop. \nBest case scenario for 🌈🐻’s is a 5-10% drop without new unknown variables entering the picture.", "score": 1, "replies": [{"body": "A new paradigm huh, neat.", "score": 1, "replies": []}]}]}
{"title": "Why GME will continue crashing on Monday using Technical fundamentals. (Not enough retail to break the balance board.)", "selftext": "Now many people are confused about some past posts so I figured we need to go into the deep technical fundamentals on why people hoping for a \"rocket\" so called on Monday will be instead met with a continuing crash. let me break this down with 3 fundamental stock activity charts that focus on the last 5 days of GME trading activity below.\n\n&#x200B;\n\n[Technical charts showing stock activity, shows the rise, start of doom, and crash which will continue on Monday. Click to zoom in.](https://preview.redd.it/mtey1hnv7s761.png?width=1326&format=png&auto=webp&s=618569d9fbfb1e252c6cbd62736bcd17bc2100fd)\n\n**Now then, the dissection:**\n\n1. **The first chart shows the full 5 days and what is called the \"balance board\" the balance board is usually a heavily resistant and stubborn point that if broken, usually leads to a massive spike that may have short or long duration. As you can see within the last 5 trading days of last week (today is Sunday so new week) even with inflated retail, fomoing, and a squeeze, GME could not break the balance board, and in fact declined as attempts to continue to fail.**\n2. Also on image 1 is the clear visual of when the rocket took off, Dec 22nd. That's the end of the flt lower line on Image 1 before the spike up.\n3. Image 2 points out the drop later on that week, showing that the big firms, hedges, and other rich conglomerates that control a significant portion of the market where starting to pull and retail and other smaller conglomerates were losing the ability to pump up the stock,\n4. Finally in image number 3, on Thursday the last day of the week, the big firms, hedges, and rich conglomerates did not go in or pulled back leading to a crash, you can tell by the trajectory of the fall and the grey line (which is for after hours trading) that the amount of investment and pumping by retail and smaller conglomerates were not significantly less than before.\n5. Expanding on point number 4 above, if you look at the after hours grey line, retail and others were still trying to push the stock up but because too much of the market controllers pulled back or/and stopped investing they were not able to not only keep up the pace from days before, but to bring back the GME stock into the green after hours.\n\n**All the points above show that more big movers will pull or stall while retail and other smaller investor individuals and groups will lose the ability to move the stock higher**, it will keep crashing until some part of the bigger market movers jumps in to give a platform for all that retail pump to bounce off.\n\nAs you can see on chart 3 the trading activity of these individuals in groups did not drop, the only thing that dropped was big funding and big money either stalling or pulling the rug a bit. And look at how it crashed the stock, and how even with low volume during after hours retail still couldn't get the stock back up even back to the CLOSING LEVEL they failed.\n\nWe should prepare for a continuing crash on Monday and possibly a bigger major crash back into the low 10's or single digits later this week. Do not be fooled, no time has WSB continued a long fomo has it ever kept going up, there is no exception, get out and/or buy puts now. People were expecting the squeeze on Wednesday and Thursday, it came and couldn't break the balance board, and crashed on Thursday. People are forgetting about Thursdays crash and are hand waiving it as some temporary feet\n\n***But there are no fundamentals or technical analysis to support this stock moving past the balance board***, and with no big major cash movers to help retail or smaller conglomerates move the stock, they can't move the stock by themselves, this just isn't possible. All you are doing is wasting money at this point until more major movers go into the stock, or stalled ones start investing again.\n\nHopefully the breakdown, and stock charts above will finally help people understand why you can't float something without support, or launch something without gas. What is the balloon floating on? If there's nothing there the balloon can't float, this is common sense.", "id": "kla3d9", "created_utc": 1609098626.0, "score": 0, "upvote_ratio": 0.16, "num_comments": 47, "comments": [{"body": "[deleted]", "score": 196, "replies": [{"body": "My man here with the real dd", "score": 79, "replies": []}, {"body": "Ding ding ding", "score": 19, "replies": []}, {"body": "you are OPs biological father", "score": 11, "replies": [{"body": "He is a huge disappointment to his mother and I.", "score": 11, "replies": []}]}, {"body": ">and now you're trying to do astrology on a chart with a 5-day time frame.  You don't know what the fuck you're talking about, son.\n\nastrology... love ya!", "score": 5, "replies": [{"body": "😘😘😘", "score": 5, "replies": []}]}, {"body": "had me at \",son\"", "score": 3, "replies": []}, {"body": "I think I’m in love with you", "score": 3, "replies": []}, {"body": "Holy shit! HAHAHHAHAA", "score": 3, "replies": []}, {"body": "Hmm that thread doesn't say anything about yoloing on GME, interesting out of context post.", "score": -36, "replies": [{"body": "It's literally in the title \"Which stock should I YOLO before AH? GME, CHWY, or others?\"\n\nYou can delete your post, but the title stays retard", "score": 16, "replies": [{"body": "So you sabotaged your own argument gme isn't the only ticker in the title. Not very smart I see.", "score": -14, "replies": []}]}]}]}, {"body": "Shut up bitch", "score": 91, "replies": []}, {"body": "\"[...]crashed on Friday\" Didn't know that the market was open on Friday🤡", "score": 38, "replies": [{"body": "Wait, you didn't trade on Friday?? The biggest 100-baggers were to be had.", "score": 12, "replies": []}]}, {"body": "Technical fundamentals? What kind of oxymoron is that.", "score": 36, "replies": [{"body": "This new and retarded form of hybrid analysis has serious meme potential.", "score": 10, "replies": []}]}, {"body": "I can’t tell if this is a joke or not", "score": 28, "replies": [{"body": "Switched to a daily chart on the third image as a projection of monthly movement. Pretty sure this is satire.", "score": 14, "replies": []}]}, {"body": "Not even reading this, Melvin. No you can't have my shares for a penny less than $200", "score": 42, "replies": []}, {"body": "My asshole is for GME", "score": 20, "replies": []}, {"body": "Fuckin Melvin.  Not today. Not. Today.", "score": 16, "replies": []}, {"body": "\"Single digits\"", "score": 16, "replies": []}, {"body": "> We should prepare for a continuing crash on Monday and possibly a bigger major crash back into the low 10's or single digits later this week.\n\n[lol](https://youtu.be/oavMtUWDBTM)", "score": 14, "replies": []}, {"body": "Nah.", "score": 12, "replies": []}, {"body": "These sad and desperate attempts fuel my 💎👏", "score": 10, "replies": []}, {"body": "This is retarded even for WSB. GME is up 30% last week and a 3% pullback on a half day, low volume holiday signifies a huge crash? \n\nI do think there will be some pullback to the upper teens (as it’s done twice already) before it rockets again, the short attacks will probably keep coming, but this shit isn’t crashing unless RC pulls. Considering he’s recently been buying more makes that a very low risk.", "score": 8, "replies": []}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 9, "replies": []}, {"body": "This may be the worst write up I've ever seen. 10/10 satire though.", "score": 7, "replies": []}, {"body": "Literally buying more gme as soon as market opens just because fuck Melvin.", "score": 8, "replies": []}, {"body": "Can’t see your positions, post puts 10k+ or ban", "score": 7, "replies": []}, {"body": "Technical analysis is BS.", "score": 5, "replies": []}, {"body": "This guy is probably being fed talking points from bears, or did 3 minutes of research and thinks he is a genius", "score": 6, "replies": [{"body": "Definitely the latter. Just a few days ago he was wondering how option price works", "score": 1, "replies": []}]}, {"body": "Someone ban this melvin sympathizer. Youre dd literally reeks of a boomer trying to pretend to be an autist. Fucking retard", "score": 4, "replies": []}, {"body": "Google search... WTF is technical fundamentals and how do I short u/jasoncolin", "score": 4, "replies": []}, {"body": "Is Melvin Capital recruiting out of special needs classes", "score": 7, "replies": []}, {"body": "This is a lot of work where you completely and purposely ignored Lord Cohen. May he have mercy on your soul.", "score": 3, "replies": []}, {"body": "Please ban this fucker for posting a bunch of shitty fake charts twice in a row", "score": 3, "replies": []}, {"body": "How much Melvin pay to be a tard?", "score": 2, "replies": []}, {"body": "The squeeze came? The shorts only got bigger iirc.", "score": 2, "replies": []}, {"body": "You're a phoney fraud, delete this garbage.", "score": 2, "replies": []}, {"body": "I bought puts Wednesday for December 31.  I suck my own dick if hit 10 dollars by then lol. I’m hoping for mid 16s", "score": -1, "replies": []}, {"body": "It should but it won t due to the power of the meme", "score": -1, "replies": []}, {"body": "sHoOt tHe mEsSeNgEr", "score": -4, "replies": []}, {"body": "[deleted]", "score": -12, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}, {"body": "This dumbass is at it again. Fuck you Melvin fanboy\n\nEdit: where's the crash bitch?", "score": 1, "replies": []}, {"body": "This is embarrassing", "score": 1, "replies": []}]}
