{"title": "My YOLO portfolio", "selftext": "http://i.imgur.com/JkAFIl0.png\n\nHello everyone.  Introducing my three legged YOLO moon beam.  Am considering fattening up on more AMD calls today, I estimate the AMD name alone to be worth around $50bn so this is a no brainer value play.\n\nFXCM epic fail.\n\n**What I think will happen to NBG this year**  \nEurope forgive the NBG debt (I'm not sure if that's exactly how it all works).  NBG release their world wide online banking platform which is amazing and every decides to use it.  Free olives for everyone who signs up a new account, takes the world by storm.  They end up buying CITI group and BARC in an unprecedented deal at the end of 2015.\n\nFBI investigates me for buying options before any of this was public knowledge as I'm now rich off NBG options.\n\n**FXCM**  \nA trickier one to analyse.  Hoping they pivot into operating systems as there's a good opportunity now MSFT is looking a bit shaky.\n\n**AMD**  \nThe Time Square advertising campaign has been a huge success, my grandma saw it on the TV and when I came home to her basement the next day to tuck in to bed she'd bought a stack of AMD gpu's to add more ram to her iPad 2.  Just goes to show that advertising can make up for a signifcant shortcoming in product quality and reach new audiences.  High hopes for this one hitting Saturn sometime in summer.  AMD could be the Apple of circuit boards, exciting stuff.\n\n**ZNGA**  \nI'll admit this one is just gambling.  ZNGA is a shit company, but it's full of pumpers.  Hoping to catch a wave up with all their new cack games being released at the moment and dump these options on some other idiot before everyone realises that no one wants to spend more than $1 on a mobile game.\n\nPlaying CS:GO last night as a guy pushing 30 who just joined a clan full of 21 year olds, I have learnt that I am getting old.  This could be my last shot at getting new rims and a spoiler on my Prius\n\nAMA", "id": "37pjpa", "created_utc": 1432899707.0, "score": 10, "upvote_ratio": 0.86, "num_comments": 15, "comments": [{"body": "Dude just give me your account, I'll trade you a costco membership - you'll be better off in the long run.", "score": 7, "replies": [{"body": " Agreed, 5% cashback is worth the AMD bet alone", "score": 3, "replies": []}, {"body": "I'll do him one better, I'll tell him where an ALDI's supermarket is at where someone superglued a bunch of quarters into the shopping buggies' lock system.  Never worry about maybe losing a quarter again!  Just grab a buggy and go!", "score": 2, "replies": []}]}, {"body": "More like PortYolio, amirite? ", "score": 4, "replies": []}, {"body": "Were you playing CS with an NVDA card? Thats probably what went wrong...", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "It's all satire", "score": 2, "replies": []}, {"body": "I kind of agree with the shaky MSFT statement.", "score": 1, "replies": []}]}, {"body": "You're good at this ", "score": 1, "replies": []}, {"body": "my Yolo trade is btc and ltc. it either booms huge or busts spectacularly. ", "score": 1, "replies": [{"body": "by yolo trade I mean 2% max position size btw, which isn't really that yolo, don't go all in noobs. ", "score": 1, "replies": []}]}, {"body": "3 out of the 4 will fail if not 4/4. Sorry mate", "score": 1, "replies": []}, {"body": "Aside from ZNGA I like all of those stocks in the long run. IMHO ZNGA is hopeless for the future. ", "score": 1, "replies": []}, {"body": "Wait. Does your grandma know you can't upgrade the RAM on an iPad? Something doesn't add up here.\n\nEither....\n\n* Your grandmother is a tech god and can forcibly upgrade RAM on a device that doesn't allow it.\n* She is not the smartest grandma (sorry) and didn't realize that you can't buy/upgrade RAM on an iPad\n* Or she heard you YOLO'd on AMD and is investing all of her life savings into AMD products to help you receive gainz.", "score": 1, "replies": [{"body": ">Something doesn't add up here. \n\nVery good observation. ", "score": 6, "replies": []}, {"body": "You misread. She's using the **AMD** **GPU's** to upgrade the RAM on the iPad 2. Hope this helps.", "score": 5, "replies": []}]}]}
