{"title": "Doubled my money w/ options the past 6 months - now straddling Apple with fscomeau!", "selftext": "Doubled my money w/ options the past 6 months - now straddling with fscomeau!\n\nSix months ago I put $4.5k in a trading account, and as of today am over $9k (subject to change any minute) buying OTM call options. \n\n\nMy balls aren't as big as fscomeau's, but I bought ~$2k of OTM call spreads on Apple when it was trading ~$105 last Friday with an expiration date of Jan 30th to time it after earnings.   \n\nWe didn't talk nor did he make his reddit post so we both made the same bet with the same thesis independantly (although I spent 1/10 as much time evaluating the risk/downsides bc I have a full time job). Props to fscomeau - I was happy to read your entire analysis to see where I had holes and where we aligned).   \n\nStill riding this train strong and hope we end up in the money!  YOLO. \n\nProof here: http://imgur.com/vb85qah,ToybAUN & http://imgur.com/vb85qah,ToybAUN#1\n\nIn case anyone is wondering, also made past trade on gold, T-Mobile, and Apple that paid off - but I gave a lot back on Amazon & Brent Crude. \n\nTo all the haters/professionals trolling here:  don't care.  \n\nThis might be small money, not well thought out, and risky, but I'm relatively young and losing $Xk vs gaining $XXk is my risk preference.  I'm not asking to invest others money, nor do I do this professionally, nor do I have the time on the side to research every position/trade/option like a pro.  Backseat drivers love hating and say I told you so!  Even the pros make ballsy trades to go big(e.g. Soros - the pound, Ackman - Herbalife, Victor Neiderhoffer – err never mind). \n\nNone of this is advice, just wanted to share some good results so far!\n", "id": "2tfjcp", "created_utc": 1422039924.0, "score": 13, "upvote_ratio": 0.74, "num_comments": 43, "comments": [{"body": "Boy, I hope all of the noobs getting dollar signs in their eyes realize how dangerous options are.", "score": 15, "replies": [{"body": "I took $800 and turned it in to $6000 in 1 month. Then i proceeded to lose it all in a handful of poor trades. Dangerous indeed. \n\nIt's not all about stomaching volatility, when you are wrong, you are dead. ", "score": 13, "replies": [{"body": "Typically you protect yourself from being wrong by using spreads. But then it just gets complicated and imo not worth it. I'd rather trade stocks so I don't have to worry about greeks.", "score": 5, "replies": [{"body": "Damn those Athenians always mucking about.", "score": 6, "replies": []}, {"body": "I would have except my broker only allows me to do spreads after 6k in the account. I was doing naked calls and puts to get me there! :( I was so close. I got too close to the sun. I was planning on switch to spreads. 20/20 I would have just funded the rest and gone less risky.", "score": 1, "replies": []}, {"body": "what does using spreads mean? (noob here)", "score": -1, "replies": []}]}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "I just doubled my money on one trade today! Since I'm starting at $500, I can use the formula, X=500*e^(0.693147 * 260 trading days), to calculate that I'll have $9.26x10^80 in 1 year! $$$$$$ \\#Ballin \\#yacht \\#dolladollabillyall", "score": 7, "replies": []}]}, {"body": "definitely dangerous the way these guys are playing it.  imo options don't shine when used as blunt instruments. i've replaced index funds with options spreads (ratio spreads to the downside and diagonal ratio spreads to the upside) and have the same exposure with less risk than stock.  ", "score": 2, "replies": []}, {"body": "> Boy, I hope all of the noobs getting dollar signs in their eyes become my counterparty.\n\nFTFY", "score": 2, "replies": []}, {"body": "This x100.  I have ridden my initial $4.5k to $8k, down to $2k, back to $6k, and am now at $9k.  \n\nIf you can stomach losing everything (which I made sure I could before I bought any), and don't act impulsively, they are a good way to lever up trades.\n\nLong term who knows though.    ", "score": 0, "replies": [{"body": "Out of curiosity, how many options trades have you made so far?  Is that 4.5-8-2-6-9 all on single trades?", "score": 1, "replies": [{"body": "I've probably purchased ~20 positions. \n\nNo, I've always held between 1-4 different stocks (with multiple spreads) at time. \n\n", "score": 1, "replies": []}]}]}]}, {"body": "At this point the only reason i'm on this subreddit is to encourage more yolo.", "score": 5, "replies": []}, {"body": "This sub is slowly turning into a pissing contest of who can grab the penny from between the rails before the train comes.", "score": 10, "replies": [{"body": "Isn't that specifically what this subreddit is FOR?", "score": 23, "replies": []}]}, {"body": ">straddling Apple\n\n≠\n\n>OTM call spreads", "score": 4, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Is making 500% once per year *that* greedy?", "score": 2, "replies": [{"body": "It's only greedy if you get fucked otherwise you're a guru", "score": 2, "replies": []}]}]}, {"body": "Eskimo brothers. Either way, they're both gonna fuck or get *fucked by* AAPL. ", "score": 2, "replies": []}, {"body": "100%\n\nLet's do this!", "score": 2, "replies": []}]}, {"body": "    Bring on the rhythm\n    Bring on the rhyme\n    Come on everybody\n    It's earnings time\n\nGood luck everybody!! \n\n\n^^Disclaimer: ^^Groupthink ^^can ^^result ^^in ^^severe ^^case ^^of ^^QCOR, ^^NQ, ^^CL, ^^and ^^other ^^unwanted ^^side ^^effects.", "score": 4, "replies": []}, {"body": "Sometimes the biggest gains are realized by selling *before* earnings.  Don't be afraid to sell some or all of your contracts.", "score": 5, "replies": [{"body": "Seriously, there is a reason buy the rumour, sell the fact is a saying.", "score": 1, "replies": []}]}, {"body": "nice, good luck!", "score": 1, "replies": [{"body": "Thanks", "score": 1, "replies": []}]}, {"body": "\"Good sir, one ticket aboard the yolo train please\"\n\n\"Are you sure? You know where this train is headed, rig--\"\n\n\"One ticket please.\"\n\n:D", "score": 2, "replies": [{"body": "It's like if a time traveler still wanted a ticket on the Titanic. ", "score": 2, "replies": [{"body": "Well, it's not really that clear cut.  If it were, the rest of us would be buying puts.  I'd just say it looks like too much uncertainty for the trouble.\n\nUNP is at resistance, looking like it could break it any day.\n\nHD is at resistance, looking like it could break it any day.\n\nBut no, let's ride the AAPL train to uncertaindom.  ", "score": 1, "replies": [{"body": "Question:  I've never day traded nor looked at technical indicators.  I use Interactive Brokers, where can I see charts like this?  Also, any advice on blogs/books to learn about technical indicators?", "score": 1, "replies": [{"body": "Google Finance is a good place to look up technicals.\n\nI recommend reading [this book](http://www.amazon.com/Trend-Trading-Living-Skills-Confidence/dp/0071544194), which not only teaches some basic technicals but also teaches an example trading approach based on them.  There are some other books that can detail every single indicator, but Carr's book, if you can get past his optimism, puts indicators in context, helping you to remember which of them to use and how.\n\nI've found RSI, CCI, OBV, and the 20/50 SMAs to be the most useful indicators. The Google Finance charts will show you all of those except for OBV.  Google's default parameters for those indicators are perfect, too, so there's no real need to adjust them.\n\nThere's also other stuff, like chart patterns and candlestick patterns.  For the most part, I've found only the cup-and-handle, head-and-shoulder, and coils chart patterns to be useful.  Everything else sounds good in theory, but doesn't really happen in practice.  Candlestick patterns are vastly unreliable and mostly serve as \"good omens\" when they line up with your analysis, so I wouldn't worry too much about them.   \n\nOh yeah, and resistance/support levels.  Those are so important that I doubt you haven't heard of them.  Even fundamentals guys respect R/S.", "score": 1, "replies": [{"body": "Thanks so much, really appreciate the thoughtful advice and feedback. \n\nYou're right, I have heard of resistance/support levels, and they make sense.  I bought the options on Apple because $105 seemed to be a support level. ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "GL ", "score": 1, "replies": [{"body": "Thanks", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah, Monday is going to be a long morning.", "score": 1, "replies": []}]}, {"body": "This is what wallstreetbets is about! Bold play sir.", "score": 1, "replies": []}, {"body": "You don't know what a call spread is and should leave options to the grown folks.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "So what's your lifelong strategy?", "score": 2, "replies": [{"body": "Everyone is different, we all have different risk parameters. Risk being the only single thing you can truly control when trading.", "score": 1, "replies": []}, {"body": "I trade things I know - I did some back-testing on my wins and I realized I am very good at making grand slams off earnings in certain situations if the options stay cheap. I only trade earnings in industries I know and its usually from buying puts when exuberance sets into the stock prior to ER. Also been very good trading off macro-events; my two biggest wins where buying US fear when the gov't shut down in 2013 (UVXY CALLS/SPY PUTS) and buying Russian fear when oil plummeted (RSX Puts)", "score": 1, "replies": [{"body": "The result is I only trade lottery options about 4x a year. I also sell puts on stock that I like and would like to own at a better price, but this gobbles up money/margin quickly.", "score": 1, "replies": [{"body": "Spreads are the way to go. Why tie up so much margin picking up pennies?", "score": 1, "replies": [{"body": "You are probably right - I haven't had the time to learn all the plays. I have the material and resources to up my plays but I guess a. I work a lot of hours now and b. I am comfortable doing what I have always done.\n\nPretty sure I will be able to pick this up in the next couple years though.", "score": 1, "replies": []}]}]}]}]}, {"body": ">  If you don't lose your money and can stay in the game with a clear head it gets to be a percentage game after a couple years (in my experience).\n\nThis is 100% spot on", "score": 1, "replies": []}]}]}
