{"title": "Fed indicates it will let inflation run above 2 percent goal for 'temporary period'", "selftext": "", "id": "8llics", "created_utc": 1527098705.0, "score": 69, "upvote_ratio": 0.93, "num_comments": 77, "comments": [{"body": "wsb strikes again, rip to your puts fellas", "score": 84, "replies": [{"body": "REEEEEEEEEEEEE", "score": 18, "replies": []}, {"body": "Motherfuckers. I thought we could cunt on the fed to fuck everything up", "score": 9, "replies": []}, {"body": "[deleted]", "score": 11, "replies": [{"body": "I sold my spy puts first thing today  at 9:45 am for a nice 200% gains. Cash out is the key ", "score": 1, "replies": []}]}]}, {"body": "Lmao Fed don’t want this party to stop.\n\nDOW TO 100K.", "score": 64, "replies": []}, {"body": "The race to $300:\n\nNVDA\n\nTSLA\n\nMU\n\n", "score": 47, "replies": [{"body": "If MU hits 300 eoy, I will totally get $MU 300 branded to my ass. ", "score": 52, "replies": [{"body": "If MU passes NVDA by eoy, I'll get $MU on the side of a locomotive tattooed on my leg.", "score": 2, "replies": [{"body": "If MU does either of those things, I'll quit my job and learn to tattoo and do all MU related tattoos for free.", "score": 5, "replies": []}]}]}, {"body": "Thank god, my NVDA calls were starting to make me real sad.", "score": 10, "replies": [{"body": "My 06/08 $257.5s still have me feeling sad.. :(", "score": 5, "replies": [{"body": "I got burned with my Er call for NVDA sucks. ", "score": 3, "replies": []}]}]}, {"body": "Please yeezus bless us with MU hype train tendies ", "score": 4, "replies": []}]}, {"body": "Spy takeoff 🛫 💰 ", "score": 38, "replies": [{"body": "Already up 40% on this mornings SPY calls. ", "score": 22, "replies": [{"body": "I took some Autist’s advice a while ago about buying waaay otm spy weeklies for pennies around big news happening during trading days. \n\nI owe this man about 60% more beers than I had this morning. ", "score": 14, "replies": [{"body": "I think I'll start doing that as well, but on Robinhood since they don't charge for options (correct me if I'm wrong). I used to buy big volumes of OTM options on E-Trade, but the prices are silly. Like yesterday I bought 100 $31 BAC calls at 6 cents a piece in the morning, and paid 110 in fees to buy and sell at 15 cents - over 10% of profits eaten up by the broker!\n\nWhich do you use?", "score": 7, "replies": [{"body": " I use retardhood; However, I know I’m gambling — not actually investing. So Why pay a house fee?\n\n\n", "score": 13, "replies": []}]}]}, {"body": "Yep. Happy I bought this morning and held through. Was betting on this:\n\n\"If we get any surprises, it would be on the accommodative side, but I  don't think that will happen,\" said Krishna Memani, chief investment  officer at OppenheimerFunds. \"I think given the gradual posture \\[the  Fed\\] has laid out, things are getting closer to their targets.\"\n\nSeems like it would have been a small loss other wise, if the meeting went the other way. Big gain with anything positive.", "score": 5, "replies": []}]}]}, {"body": "Fed creating the most massive bubble ever created ", "score": 73, "replies": [{"body": "Be sure to have cash handy to buy a house in the Wastelands from starving boomers in a few years", "score": 35, "replies": [{"body": "I am in a seriously fucked up place with this mindset.\n\nI'm sitting on a lot of cash / risk free at the moment... Including gold ETFs I'm probably 70/30 cash to equities, maybe more (plus a few LEAPs). My trigger finger is itchy as fuck on stocks because my cash is sitting around earning shit, but I don't want to miss the bloodbath buying opportunity if / when it happens.\n\nAt the same time, I've been watching people do the same thing as me for the last 5+ years and miss massive gains. I just can't decide what to do. Just to top it off, I've got friends partnering up and buying 50-100 unit apartment buildings and creating a fuck ton of wealth.", "score": 13, "replies": [{"body": "Stop being a bear", "score": 39, "replies": [{"body": "You're not wrong 😪", "score": 4, "replies": [{"body": "just buy weekly calls and youll be fine", "score": 1, "replies": []}]}]}, {"body": "> Just to top it off, I've got friends partnering up and buying 50-100 unit apartment buildings and creating a fuck ton of wealth.\n\nWhat worked over 70 years of falling rates isn't going to work in the next 20 of rising rates. ", "score": 8, "replies": [{"body": "Please elaborate\n\nI need the reassurance", "score": 3, "replies": []}, {"body": "Slumlords always win out bruh.", "score": 2, "replies": []}]}, {"body": "((|))", "score": 2, "replies": []}, {"body": "One of the reasons I'm only messing around with 50&#37; of my total savings in the market is because of this possibility.\n\nI didn't have any real money to consider buying something in 2009 but I'm sure as hell not going to fall for the \"renting is throwing money away\" boomer meme. Guess what morons, so is paying a fuckton of interest on your dogshit 30 year mortgage.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Bought some IYR 2019 puts, and I'm just sitting here watching them dissolve with theta. They might be worthless in two months. Even if they rebound that's money I could've used elsewhere :/", "score": 3, "replies": [{"body": "Yeah, I've been the same. Theta is a bitch and I don't mind spending a few grand a year on a downward hedge, but on the other hand... That's a few grand I could have put to work (or spent on booze)", "score": 1, "replies": []}]}]}, {"body": "Not alone ", "score": 1, "replies": []}]}]}, {"body": "Margin debt as a percent of GDP has never been higher. The longer this goes on, the bigger the bust. ", "score": 12, "replies": []}]}, {"body": "Whole Lee Fook", "score": 21, "replies": []}, {"body": "Got 25 $280 SPY calls for June 29th @ $.43 a piece.\n\nGo go go.", "score": 18, "replies": [{"body": "You’re probably fucked ", "score": 12, "replies": [{"body": "He's fucked. Strike is already high enough, I don't even wanna know the break even price. ", "score": -7, "replies": [{"body": "Isn't breakeven just... 280.43...?", "score": 30, "replies": [{"body": "That kid is retarded, thinks I'll be holding till expiration - who cares about the break-even price. This option is volatile enough to go 50-100% up on a green day like we had this Monday.\n\nAnd yes, the breakeven is literally $280 + $.43. But he doesn't wanna know.", "score": 23, "replies": [{"body": "Yo i might be retarded but im also autistic so fuck you", "score": -19, "replies": [{"body": "You are trying too hard.", "score": 14, "replies": [{"body": "na u", "score": -15, "replies": []}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "You are very special ", "score": 2, "replies": []}]}]}, {"body": "I'm obviously not holding till expiration...I'll probably close the position on an upcoming green day. ", "score": 2, "replies": []}]}]}]}, {"body": "We did it boys, we saved the economy ", "score": 13, "replies": [{"body": "It actually does, because these underfunded pensions get funded and these old fucks who aren’t productive get their shit inflated away", "score": 2, "replies": []}]}, {"body": "I wonder how all the Ally savings account bros in /r/investing feel about this", "score": 12, "replies": [{"body": "They deserve this.", "score": 5, "replies": []}]}, {"body": "More like the fed can't control...", "score": 7, "replies": []}, {"body": "MUn bound\n\nSo glad I got out of mu yesterday at a good price, and bought in at a -1~%...this shit should be 60 and imo is sucha good safe hold, until amd dips a little, then we go back", "score": 10, "replies": [{"body": "Starting to take off again just after this post\n\nYeehaw motherfuckers", "score": 10, "replies": [{"body": "It has been waiting for Nasdaq confirmation. ", "score": 5, "replies": [{"body": "Damn stock refuses to take off - just keeps sputtering.", "score": 1, "replies": [{"body": "Relax it has been up from $53 to $60 in two days. Patience is virtue!\n\nThe key point is to hold this price!!! Then we can go up a bit more as ER approaching ", "score": 3, "replies": []}, {"body": "It is up 18.5% this month. That's pretty good.", "score": 2, "replies": []}, {"body": "Don't worry dog. Pre-Market probably going to launch tomorrow as long as nothing crazy happens AH", "score": 2, "replies": [{"body": "Just anxious.  If/when it hits $63 soon, I make about 100k.  The sooner it does, the sooner I can relax and start looking for a more rewarding job.", "score": 5, "replies": [{"body": "post positions", "score": 1, "replies": [{"body": "Check my post history.  110 7/20 60s at 0.90 (currently 4.15).  500 7/20 70s at 0.84 (currently 1.24).", "score": 9, "replies": [{"body": "goddamn son, nice work", "score": 4, "replies": []}, {"body": "I just sold my 7/20 50s and bought 7/20 60s with the profits. Thinking about doing the same with my 7/20 55s.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "That run up at 2pm though. Mmmmmmmhmmmm", "score": 6, "replies": [{"body": "Just like the drop at 12 on the dot ", "score": 5, "replies": []}]}, {"body": "jerome you my niqqua", "score": 3, "replies": []}, {"body": "buy your FD puts now boys!", "score": 4, "replies": []}, {"body": "Hot take: inflation won’t go over 2 percent.", "score": 1, "replies": [{"body": "Disagreed. 3.9% unemployment and incompetence. Either inflation or labor force participation is going up. Labor force can only go so high because of the skills shortage. If it’s inflation, the fed will either strangle the economy with higher rates and throw us into recession, or won’t keep up with inflation and bond holders take a bit of a fall(5 or so percent per year), and stock holders won’t fare to well because of decreased margins before prices catch up to margins. ", "score": 1, "replies": [{"body": "I should actually clarify, *inflation will stay at 2 percent, give or take 0.4%.* You’ve mentioned the hypothetical branches of your inflation scenario, and the results of Fed action or inaction (Powell dialed down the hawkishness, and this is a good thing at the moment) but didn’t go into labor force participation rates. Only people looking for work (not disabled nor have given up, and not getting jobs) are counted towards the unemployment rate. The labor force participation rate is astoundingly low, and below what might be considered structurally full employment. Janet Yellen called this “slack.” Anyway, this “reserve army of the unemployed” exerts sufficient downward pressure to keep wage increases below the rate of inflation. This is a depressing reality for much of the country (as a side note, it was shocking to hear Janet Yellen note that the opiate abuse crisis is affecting the participation rate). But, the structural inefficiency of the labor market isn’t why inflation is at 2%; it’s at 2% due to the unwinding of the Fed’s balance sheet. \n\nThe Fed, when Janet Yellen began unwinding the Fed’s position had a balance sheet of approximately $4 trillion. She figured out that she could meet the Fed’s inflation target by getting rid of (selling) $10 billion of Fed assets every month for 30 years. When this is added to the fact that there is no other change to monetary policy, the Fed has engineered the introduction of new money to the money supply via the bond market and introducing inflationary pressure on a macroeconomic scale, but at the sustainable 2% rate (as for recent rate increases in the ten year, that’s the combo between a relative lack of demand in the bond market and record deficit spending by Congress). Janet Yellen managed to attain all three parts of the impossible trinity, and I’m impressed.\n\n**TL:DR** Wages and employment rates aren’t driving inflation, the Fed’s balance sheet unwinding policy is. PS, the “skills shortage” is more credential inflation than a shortage of capable people.", "score": 1, "replies": [{"body": "QT reduces the amount of money in the economy leading to deflation. The debt goes from the fed to bond holders which net reduces availability of money to other uses. \n\nQE was just running the money press combined with double entry bookkeeping. ", "score": 1, "replies": [{"body": "Thats what im thinking, feds are selling to reduce money from circulation. Maybe the inflation rate would have been > 2% all along but the unwinding is keeping the inflation in check. But i honestly dont see how it would have a huge effect on consumer prices. I still think it was mainly oil prices keeping inflation down for so long.", "score": 1, "replies": [{"body": "Government debt crowds out private consumption. Government spending makes up for it, but government doesn’t necessarily buy the same things consumers do. Ergo, consumer prices lower marginally as demand slackens and supply stays the same.  ", "score": 1, "replies": []}]}, {"body": "That “debt” going from out of circulation on the Fed’s balance sheet into private hands increases the amount of money in circulation, and without Treasury taking $10 billion out of the money supply, it will cause technical inflation. Whether or not that money actually enters the economy or just sits idle as bonds and drives up prices or actually gets sold and used for more productive investments is up to whoever buys it.", "score": 1, "replies": [{"body": "It does not. The fed reduces the cash in private hands and gives them bonds instead. These debt sales are technically done through the treasury but only because the fed ‘refinances’ the debt. This is a net deflationary pressure. \n\nThe treasury doesn’t have an effect on inflation because they spend all the money they take in. It’s why they bother selling debt to begin with. To balance the federal governments accounts. \n\nOnce debt is in private hands, unless they sell it to the government it will remain technically in private hands. Once again no net effect on money supply. \n\nThe big inflationary pressure was that initial 4 trillion outlay selling cash for bonds. There is also the ongoing debasement of the currency by design, but that’s largely not a problem. ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Watched my $MU FD’s that I sold at the bottom for a 30% loss close up 20%", "score": 1, "replies": []}, {"body": "i fuckin told you dicks, dude said this shit in his first presser", "score": 1, "replies": []}]}
