{"title": "[deleted by user]", "selftext": "[removed]", "id": "8isuho", "created_utc": 1526088490.0, "score": 136, "upvote_ratio": 0.91, "num_comments": 84, "comments": [{"body": "Amazon doesnt do profit", "score": 100, "replies": [{"body": "Correct. It recycles all revenue into growth. One day Amazon will be extremely profitable when it takes 15% in fees from the entire global economy ", "score": 23, "replies": [{"body": "> when it takes 15% in fees from the entire global economy\n\nTop kek. I could see this happening and then Lord Bezos reinvests that money on expanding to moon and Mars bases.", "score": 1, "replies": []}]}]}, {"body": "Amazon avoids profits b/c as soon as it posts one Wall Street expects it to continue and the moment it doesn’t the stock price will fall", "score": 237, "replies": [{"body": "ayyyyy someone's read Zero to One \n", "score": 26, "replies": []}, {"body": "This is the only answer. ", "score": 4, "replies": []}, {"body": "Autisit", "score": -13, "replies": []}]}, {"body": "Wtf is this profit shit?", "score": 49, "replies": [{"body": "No one in this sub knows what that word means. ", "score": 49, "replies": []}]}, {"body": "Bezos is above profits you fucking casual! He is working on a different level where no one needs money but him! ^And ^all ^the ^people ^that ^buy ^shit ^from ^Amazon", "score": 52, "replies": [{"body": "Then Amazon replaces the Fed with it's prime dollars.", "score": 1, "replies": []}]}, {"body": "You even gonna attempt to understand Amazon’s business model?", "score": 30, "replies": [{"body": "Please enlighten us... this should be good.", "score": 10, "replies": [{"body": "Bezos is a literally a twink G O D who is so far above your level that your autistically heterosexual mind would never even begin to understand the reasoning behind the decisions he makes. ", "score": 35, "replies": [{"body": ">  autistically ~~heterosexual~~ **homosexual** mind\n\n~~ftfy fag~~ i dun goofed", "score": -3, "replies": [{"body": "no I meant to type heterosexual you don’t deserve to be called fag if you can’t respect daddy Bezos superior intellect you illiterate piece of shit", "score": 19, "replies": [{"body": "amen! i take my faggotry back", "score": 5, "replies": []}]}]}]}, {"body": "Growth now, profits later. Is that really so difficult to comprehend? ", "score": 3, "replies": [{"body": "You think \"growth now, profits later\" is a business model?", "score": -1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 16, "replies": [{"body": "Apple sells proprietary products and patents. Amazon sells products other competitors can sell also. Both companies have high customer retention ratings. Apple can lose market share with other flashier phones. Amazon would stay having market share because it sells necessities like food, diapers, etc. ", "score": 8, "replies": [{"body": "Don't forget AWS. Amazon runs a significant part of the internet. ", "score": 24, "replies": [{"body": "This is the real answer. Amazon’s e-commerce is only one facet of their business.", "score": 8, "replies": []}]}, {"body": "I buy all my diapers via Google Express.    \n     \nNowadays, I basically only use AMZN for things that aren't at my local stores. ", "score": 7, "replies": [{"body": "Just use the toilet, invest savings in MU Jan ‘19 $60 calls", "score": 26, "replies": [{"body": "Marty, my dude, I can't take your advice seriously right now cause I just had my Buell worked on at the HOG shop, and those tards didn't even reconnect my clutch cable. I paid them; they gave me the keys; I tried to ride off....nothin. No clutch engagement whatsoever. So, I went back to the counter and asked them if they test rode it after the maintenance. They said they did. Lol. ", "score": 8, "replies": [{"body": "They bill over $90/hr too, what a joke.  Obviously don’t go back to that place.", "score": 3, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "They didn’t perform basic post-work rider tests then lied to you about it when you asked them.  What if they f’d up your brake lines instead?  \n\n", "score": 2, "replies": [{"body": "Ha. No I agree; it could have ended much, much worse. However, in my joking, I just didn't explain the full situation. The guy I talked to wasn't the mechanic. I think the actual problem was that they mixed my Buell up with another. Mine wasn't finished, and the other was. So, it (probably) wasn't shit mechanic work; just a mix up. Some mechanic probably told one of the office guys, \"hey that Buell's done\", and that office guy probably just assumed there was only one Buell (because 99.9% of the time that'd be a correct assumption).     \n    \nUnrelated, what's your take on electric bikes? Yay, nay? Worth checking out, or should I not waste my time. I'm in the early stages of looking for a new bike. I'm leaning toward Street Triple, but am open to suggestions. Cheers. ", "score": 1, "replies": [{"body": "Not interested in electric.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "What doesn't make sense is Wall Street's continued insistence that Apple making shed loads of money and growing by more each year than Amazon make is something to bet against. I mean if you bought at the high point of $180 prior to earnings release you'd be up a reasonable amount already.", "score": 2, "replies": []}, {"body": "Apple has the greatest scam ever due to marketing and the brainwashing of sheep of COURSE its profitable. Their thousand dollar desktops have less than 400 dollars worth of parts in them. The iphone x has a shitty in house chip in it and is going for over a thousand bucks. Its a joke.", "score": 3, "replies": [{"body": "If it is a joke but makes me money it is not a joke.", "score": 10, "replies": [{"body": "Fair,  but i avoid companies i hate as a matter of principal", "score": 1, "replies": [{"body": "You need to drop your moral compass if you want to stack cash like a faggot", "score": 11, "replies": [{"body": "This is the advice someone should've given Ackman. ", "score": 4, "replies": []}, {"body": "There are plenty of companies I don't hate. And I'll short the fuck out of aapl and others i hate.", "score": 2, "replies": [{"body": ">short aapl\n\nyou belong here", "score": 4, "replies": [{"body": "Thanks dad", "score": 2, "replies": []}]}, {"body": "So in your logic AAPL has performed mass hypnosis on a global scale and is able to sell cheap shit at ridiculous margins becoming the most profitable company in human history, and you want to short it? \n\nCongratulations you are retarded. ", "score": 3, "replies": [{"body": "I'm saying it's over valued. The recent rise will reverse soon as people cash in tendies. It will then go back up", "score": 1, "replies": [{"body": "You have to imagine how stupid the average person is.  Half the people alive are stupider than that.  And they all think Apple is amazing.\n\nIt doesn't matter that their phone is outdated.  It doesn't matter that their desktops and laptops are virtually useless walled gardens.  They charge their faithful fans out the ass for tiny upgrades and it works whether you like it or not.  They've bred an entire generation of these idiots and now they're having kids.  It's a cult where people want brand name, newest model.  They are too stupid to care about technical specs, they just want to \"think different\" and follow along like the good sheep they are.  \n\nYou can try to fight apple, but you will lose.  They are powered by millions and millions of idiot hipsters at home and abroad.  Idiot fans who think they have all the answers, but actually have none \\(like us at WSB really\\).  They will not be persuaded by your logic.  They will buy apple products, again and again, and their stupid fuckin kids will buy apple products, and then *their* stupid fuckin kids will buy apple products.  Do you get it yet?  Do not bet against apple.  You will get fucked by the horde of idiot fanboys.", "score": 1, "replies": [{"body": "Sigh. I try to hope that the cult will be defeated but i know it won't", "score": 1, "replies": []}]}]}]}, {"body": "Wait you’re saying that Apple can hypnotize customers into opening their wallets every quarter and you don’t want to invest in that sweet cash flow?", "score": 1, "replies": [{"body": "Sorry, i have a soul", "score": 1, "replies": []}]}]}]}, {"body": "My principles are all measured with a price tag.", "score": 9, "replies": []}]}]}]}]}, {"body": "This is facts? Holy shit.", "score": 13, "replies": []}, {"body": "and holding BRK shares would have returned 0 capital over your lifetime, you would still just hold the same number of BRK shares.\n\nand yet shareholders claim to be richer.\n\n\naaaamaaaaazzzziiiiinnnnnggg", "score": 14, "replies": [{"body": "Oh no you're retarded", "score": 1, "replies": [{"body": "Did you know that not understanding sarcasm is a indicator of autism", "score": 3, "replies": [{"body": "So is trying to explain crappy jokes", "score": 1, "replies": []}]}]}]}, {"body": "Nice shill, probably time to dump apple ", "score": 13, "replies": []}, {"body": "Yea its easy to post profits when you make idk 80-90% of all profits in the smartphone industry.", "score": 7, "replies": [{"body": "That's not true.  Samsung makes a lot of money on phones and completely dominates the low cost market", "score": 3, "replies": [{"body": "Apple has like 10% of the smartphone market but males something like 75% of the cell phone profits. It's bonkers. It has to do with carrier agreements I think.", "score": 5, "replies": [{"body": "It’s because their supply chain is fucking great and they don’t sell cheap shit", "score": 1, "replies": []}, {"body": "Its because people are willing to pay the obscene prices for iphones. They make 200 dollar phones and charge 800.", "score": 0, "replies": []}]}]}]}, {"body": "AAPL made roughly the same revenu q4 17(239B) as it did q4 15(234B).\n\nAMZN in q4 15 made 107B, in q4 17 made 177B. \n\n\nIf you were interested in a company that you expect to grow in the future, which of these seemed to be growing faster?\n\nAAPL is an entrenched tech company with dividends.\n\nAMZN is basically trying to grow in any direction that they can at least break even on.\n\nIn 10 years, AMZN is going to be the new Berkshire Hathaway. AAPL will maybe have not floundered its following by then.\n", "score": 9, "replies": [{"body": "This is the DD I look for. Short &AMZN.", "score": 8, "replies": []}, {"body": "Something something fundamentals......\n\nSomething something factor of future earnings potential......", "score": 3, "replies": []}]}, {"body": "Good news for my May 18 185 puts. Funny thing is I was up for one second before this article came out. Then I lost 30%", "score": 2, "replies": [{"body": "I want the stock to go down so I can buy back my short call cheap ", "score": 1, "replies": []}]}, {"body": "But if AWS didn’t have to subsidize selling  avocado toast...", "score": 2, "replies": []}, {"body": "Ross Hanemann says no revenue https://youtu.be/BzAdXyPYKQo", "score": 2, "replies": []}, {"body": "Amazon figured out the ultimate business model. \nThe Mob > Money ", "score": 2, "replies": []}, {"body": "Bezos is the richest man in the world because he never focused on quarterly profit. But WTF do I know about tech investing amirite just give me my dividend and modest P/E buy signals. ", "score": 2, "replies": []}, {"body": "So?", "score": 1, "replies": []}, {"body": "Ha!  Let's all short Amazon now!", "score": 1, "replies": []}, {"body": "Apple is entrenched in its current products that are cash cows and is complacent about it. You know like IBM and mainframes in the 70s-80s. There are only so many iPhones that you could sell in a year. It is sitting on shit-ton of money and doesn't know how to invest for future. Best they could come up with is share buy back. With that kind of cash, they could be expanding in all directions like crazy and dominate new sectors, but no.\n\nAmazon on the other hand is putting every penny it has to anything that it thinks is future. Starting from an online bookstore to now it dominates cloud, retail, publishing, streaming, ML, grocery business etc.\n\nApple is like a rich smug complacent kid with highly profitable family business vs Amazon a hyper competitive poor kid that is built everything from scratch and not satisfied till world domination. Whom would you bet on?", "score": 1, "replies": []}, {"body": "God I can't wait until Papa Bezos decides to make smart phones. I'd love to see a Samsung/Amazon merger. \n\nEdit: Hey did you guys know they actually already did and it was a dumpster fire?", "score": -2, "replies": [{"body": "He decided that once already and failed horribly. ", "score": 23, "replies": [{"body": "TIL. Thanks. ", "score": 6, "replies": [{"body": "Dumpster fire ", "score": 4, "replies": []}]}]}, {"body": "The Amazon phone was awful.     \n     \nIf anyone's supplanting the iPhone, it'll be Google (but even that is unlikely anytime soon). ", "score": 7, "replies": [{"body": "My 5 year old wants an iPhone nor kindle nor galaxy.", "score": 2, "replies": [{"body": "Like I'm gonna take tech advice from a 5yo. GET REAL KID", "score": 15, "replies": []}, {"body": "Your 5-year-old kiddo needs to learn that the iPad compares to the Fire and Galaxy. The iPhone compares to the Pixel, or dozens of other Androids. The Kindle is it's own deal that is strictly for reading text; I dig my Paper White for that. ", "score": 4, "replies": [{"body": "What would you tell your 5 year old who wants everything? ", "score": 5, "replies": [{"body": "Get fucked", "score": 8, "replies": []}, {"body": "Tough shit.", "score": 5, "replies": []}, {"body": "To get off my damn lawn. ", "score": 2, "replies": []}]}]}]}]}, {"body": "They did. It was a dumpster Fire.", "score": 1, "replies": []}]}]}
