{"title": "In what order do you sell off these stocks? $FB, $AAPL, $AMD, $V (Visa), and $BA (Boeing)?", "selftext": "5 very talked about stocks in this sub, as well as other stock forums as well. List in what order you'd sell! Interested in seeing where yall stand on these. ", "id": "8kxazl", "created_utc": 1526867305.0, "score": 42, "upvote_ratio": 0.79, "num_comments": 71, "comments": [{"body": "Don't sell any of them..", "score": 70, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "If you really need the cash, sell a little bit of all?", "score": 1, "replies": []}, {"body": "How come it's not a possibility? ", "score": -2, "replies": [{"body": "[removed]", "score": 45, "replies": [{"body": "That’s why dividends are for. 🤑", "score": -2, "replies": []}]}]}]}]}, {"body": "Why does everyone talk about visa but not MasterCard?", "score": 13, "replies": [{"body": "I read that Visa has a higher upside coupled with great management. But I just got both instead for my portfolio.", "score": 3, "replies": []}, {"body": "Because they don't look at the numbers. MasterCard has better fundamentals than Visa. ", "score": 1, "replies": []}, {"body": "American bias.  Most Americans have visa in their wallet.  Look at the stock performance.  MA is better. ", "score": -7, "replies": []}]}, {"body": "Disclaimer: AMD bagholders should not read the comments in this thread.\n\nEdit: I think some people are taking this post too seriously, lol", "score": 20, "replies": [{"body": "Are there any AMD bagholders right now? Closed at 13 and the highest its been this year was like 14 for very brief time periods. Even if you bought the top you wouldn't be down much.", "score": 8, "replies": [{"body": "Eh, if its keeps following the trend from the past year and a half it'll probably be heading for another dip here within a month or two, but with all the positive news about it I doubt it'll be super significant.", "score": 1, "replies": [{"body": "Doubt it.  AMD is having a serious growth moment right now.  Intel has some serious delays on their 10nm chips forcing them only to have 14nm chips through 2019.   AMD has 7nm chips coming out this year that will have some serious gains over Intel.    AMD is poised to take some serious market share over Intel especally in the Data Center space with their CPU's.    CPU's are what's actually driving growth, unlike the bear analysts who keep thinking it's crypto.   Crypto is only responsable for 7% of AMD's growth.   GPU's are doing great, but the real growth is from EPYC.   Anyone selling this stock is an idiot.   My personal PT is at 20.  AMD should beat next earnings. ", "score": 5, "replies": []}]}]}, {"body": "Yeah bag holder from $3.5", "score": 1, "replies": []}, {"body": "haha!", "score": 0, "replies": []}]}, {"body": "AMD, BA, FB, V, AAPL", "score": 19, "replies": [{"body": "You would sell Boeing, the company that the next eight years of revenue contractually obligated, over Facebook, the company that just testified before Congress and has some politicians calling for anti-trust lawsuits?\n\nI think FB is a great holding, but I'd sell it before BA in a heartbeat.", "score": 7, "replies": [{"body": "Yes, I would sell the cyclical company that's up 100% from 12 months ago first.\n\nThat said I own it and I'm not selling it.", "score": 7, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "It’s only a matter of time before China, India, Russia, and others, develop their Boeing counterpart. Once that day comes then I see the company’s value falling. This is unless they really change the US MIC to a SMIC (Space & Military Industrial Complex). ", "score": 2, "replies": []}]}]}, {"body": "The only order", "score": 3, "replies": []}]}, {"body": "If you follow the advise of people who are saying sell AMD first would lose out on big gains. AMD is a long term hold now as Intel 10nm is officially delayed and broken. Epyc 2nd Gen 7nm will make a huge impact on DC sales. Intel will compete with 14nm cascade lake against 7nm Epyc", "score": 8, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Im referring to CPU business. 7nm Radeon Instinct based on Vega are due later this year. Lets see how it performs. Gaming side will lag if GTX11 series arrive in July", "score": 1, "replies": []}]}, {"body": "and why would this not be priced in? are you sharing insider info? ", "score": -3, "replies": [{"body": "The initial news and speculation is now likely priced in with the run up some last week. It's not really known though how drastically it will affect their numbers though so there is still some room for growth (and obviously shrinkage)", "score": 1, "replies": []}]}]}, {"body": "Will sell AMD only. ", "score": 2, "replies": []}, {"body": "AMD first.\n\nIf I had to *guess* at how I would proceed, BA would be next...I don't know that their momentum could be kept up, or if any news may come out that would insinuate them not getting as many defense contracts or something. Some political talk could put a dent in their valuation, I'd think.\n\nFB would be next, but maybe years and years down the road.\n\nI don't see V and AAPL going anywhere, those two on your list are long term holds.", "score": 4, "replies": [{"body": "I would agree. United States pulling out of the Iran deal shreds deals Boeing had in place with Iranian Airlines. ", "score": 1, "replies": [{"body": "I feel like those planes will end up going somewhere else. There's no shortage of companies buying either Boeing or Airbus aircraft. One airline out of 5,000+ that have IATA codes won't do much long term.", "score": 8, "replies": [{"body": "Boeing has the next **eight years** of orders under contract. The Iranian planes were a small percentage of their backlog.", "score": 3, "replies": []}]}, {"body": "Those planes and equipment are being sold regardless of Iran. Boeing has such a long waiting list for many of its products it shouldn’t matter much, someone else will just get bumped up a spot in line.", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "FB has zero debt, $44B in cash, and owns Instagram (which has primarily young users). Sure the old farts will die out, but zuccyboi will find new ways to innovate.", "score": 21, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "I think the point is that the rabbit might jump straight into the toilet without warning, especially given the investigations that may or may not be ongoing.", "score": 0, "replies": []}]}, {"body": "He never did in the first place- have people forgotten that FB was an outright stolen idea and he has been coasting solely off that and acquisitions (purchased ideas)", "score": -1, "replies": []}]}]}, {"body": "> AMD goes first, easy pick.  \n\nThrowing away money there! ", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "AMD has at least a 20 percent upside.  You would be throwing away money! ", "score": 3, "replies": [{"body": "It also has the most downside of the lot and biggest uphill battle.  AMD and V are the stocks mentioned with the biggest competition too. ", "score": 1, "replies": []}]}]}, {"body": "At IPO it was overvalued. I feel the same way about Spotify, I’ll buy once the market adjusts to its real value. ", "score": 1, "replies": []}, {"body": "AMD goes first, then Boeing. Both of them carry way more risk than the other companies which see little to no risk in today's conditions. Amd is high risk, and Boeing can be hit hard by current events.\n\n", "score": 1, "replies": []}, {"body": "AMD first, then BA. You could definitely hold onto the rest for awhile.", "score": 1, "replies": []}, {"body": "$FB, $AAPL, $V are longterm holds.", "score": 1, "replies": []}, {"body": "Hold them all.", "score": 1, "replies": []}, {"body": "How would you price in market share gain? Lisa was being conservative with 5% Epyc market share in 2018 and that with 1st Epyc. Q3 & Q4 would be huge revenue gainer for AMD", "score": 1, "replies": []}, {"body": "I'd say keep AMD for a little while longer (maybe a month or so) and then sell it.  Wait for the dropoff and then buy again for the long run.  But I'm no expert.", "score": 1, "replies": []}, {"body": "If you need capital and aren’t too risk averse ditch the V and FB, Id expect FB to pull back short to mid term and there’s better ROI than V. AMD is controversial but I’d keep it for now depending on how much you want to sell off", "score": 1, "replies": []}, {"body": "BOEING: Depends what you bought in at.  It has hit a plateau, so taking profits if you bought much lower and putting it into something with more room to grow could be a smart play.\n\nAMD: Depends what you bought at.  Also do you feel the stock will continue the 9 to 14 to 9 trend or do you feel it is going higher.\n\nVISA: HOLDFACEBOOK: HOLDAPPLE: HOLD\n\nThat being said, if you can take good profits on Boeing, do it.  For AMD I would wait until it hits higher than 15, which I feel is coming this year as it has continued to collect market share outside of crypto and also has a technological advantage over Intel.", "score": 1, "replies": [{"body": "The price you bought a stock at has no bearing on how it will do in the future.  If your money will do better elsewhere, put it elsewhere.", "score": 4, "replies": []}, {"body": "9 to 14 to 9 happened once and is very natural for growth stocks.", "score": 1, "replies": [{"body": "Yep.  AMD probably will end up at 20 this go around.   Too much momentum for it not too, 7nm chips coming soon, versus intels delays.   AMD has some serious gains coming in the Data Center market.   If anyone is trading on crypto alone they are an idiot. ", "score": 2, "replies": []}]}]}, {"body": "Amd, aapl, v, fb, ba", "score": 1, "replies": []}, {"body": "AMD first.\n\nThe rest, probably never. But, to answer your question, if there were to be a significant departure in the landscape and company's competitive advantage.", "score": 1, "replies": [{"body": "Only a fool would sell AMD given Intel's 10nm chip delays.   AMD is poised to have 7nm out well before Intel's 10nm chip ever arrives.  Some serious market share will be given up by Intel.  ", "score": 1, "replies": []}]}, {"body": "FB then V then BA then AMD then AAPL", "score": 0, "replies": []}, {"body": "V, BA, FB, AMD, AAPL", "score": 0, "replies": []}, {"body": "(First) FB. BA. V. AMD. AAPL. (Last)", "score": -1, "replies": []}, {"body": "FB only. social media stocks are aids. ", "score": -1, "replies": []}, {"body": "I sold fb after the Cambridge shit. I wanted nothing to do with any of that.\n\nAlso, I’m already overweight in nvda and I’m considering selling some and BO and V were my first runners up for what to do with the cash", "score": -1, "replies": []}, {"body": "my pick would be AMD. Don't do what I did and sell FB and watch it go right back up after earnings  and AAPL after the news of poor possible poor Iphone x sales. All those stocks you have are very long term holds I still own Visa it has huge upside but you could diffidently sell AMD at some point and wait for the re entry point.\n\nI would say AMD, FB, BA, AAPL, V", "score": 0, "replies": []}, {"body": "I couldn't care less about AMD!  It and FB are my one and two, respectively.  The others are good long plays and market leaders, but as a set they are tech-heavy.  ", "score": 0, "replies": []}, {"body": "Yeah, I wouldn’t sell AAPL", "score": 0, "replies": []}, {"body": "I’d sell visa. Fintech and cr*ptos are going to pressure traditional payment networks. ", "score": -2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Visa’s technology is not cutting edge and their profit margins will be pressured as blockchain transactions take over. Blockchain cuts players like Visa out as businesses want to reduce transactions costs. And if you think blockchain won’t be scaling up over time you’re in for a big surprise. \n\nI’d invest money elsewhere. ", "score": 1, "replies": [{"body": "I don't think you understand how payment processing networks work. Unless significant percentage of merchant transactions switch to cryptocurrencies, which seems very unlikely for whole book of reasons in near future, margins of Visa, MC or AMEX are not going anywhere.\n\nThere is reason why these network don't use blockchain on their own despite spending years, millions of dollars on researching it and knowing about it more than most of the ICO funded companies out there combined\n\nOnly torn in the eye, that could pose a threat in near future is OMG and even them plan to co-exist/co-work with good old squad of CC companies ", "score": 1, "replies": [{"body": "You said I don’t understand but you didn’t explain anything, and I also don’t think you made any strong counter points. Further, I don’t think you appreciate how antiquated our current payment systems are, or the economic incentives at hand here. There is significant amount of cost savings with blockchain and a significant amount of vendors will use it. In fact, we can be pretty sure that eventually the whole future of payments will be run on blockchain. We will not be using the current payment networks in 20-30 years. If vendors can cut out payments fees and boost profit margins 3% they will. That’s a big deal to a business. \n\nNot to be exceptionally rude here, but I also don’t think you understand how blockchain works. Companies like Visa don’t have much of a use for blockchain by themselves because blockchain is a decentralized database. A company won’t use blockchain for its internal systems. \n\nEven if Visa doesn’t disappear, their profits margins will certainly shrink because their value-add will shrink. And once a company has pricing pressure the stock dives and doesn’t easily return to former highs. \n\n\n", "score": 1, "replies": []}]}]}]}]}, {"body": "AMD for sure. After that, depending on the news cycle, it would be Facebook (privacy/data) or Boeing (tariffs). I would not touch Apple nor Visa.", "score": -1, "replies": []}, {"body": "FB, AMD, BA, AAPL, V", "score": -1, "replies": []}, {"body": "I'd sell FB and AAPL first. Both are popular, but no longer for the right reasons.\n\nAMD is no longer lagging behind Intel and is a real contender, holding for a while would likely pay off. This really depends how tolerant you are of tech stocks in general.\n\nThen I'd sell BA and then V last due to their market dominance and stability.\n\nI actually bought Twitter and AMEX. Similar categories, but I think those companies are in better positions now and for the future.", "score": -2, "replies": [{"body": "I agree with Twitter. I’ve been steadily buying shares over the last three months and it’s made some good gains. I intend to hold it for while. ", "score": 1, "replies": [{"body": "Yup same. I think it tanked after IPO, but now it's just been a relatively smooth incline & I have no intention of selling anytime soon", "score": 1, "replies": []}]}]}, {"body": "1) Amd, bag holder/meme stock go nvidia\n\n2) FB, making money but long term future is questionable \n\n3) BA\n\n4) AAPL, hate them personally but from a investor point of view they are good.\n\n5) V, though you really shouldn't sell this one unless you're going bankrupt \n\n", "score": -3, "replies": [{"body": "AMD has at least a 20 percent upside. You would be throwing away money!  More to AMD than GPU's.   AMD is poised to take some serious market position away from Intel.  Especally in data centers. ", "score": 1, "replies": []}]}]}
