{"title": "Back in 2018 I bought a cool little stock called NVDA in my rollover IRA. Forgot about it and now I think it’s time to make some moves.", "selftext": "[removed]", "id": "1exyf0u", "created_utc": 1724268001.0, "score": 126, "upvote_ratio": 0.78, "num_comments": 97, "comments": [{"body": "Sorry -- we removed your message on /r/stocks because generic posts like \"I have $XXX to invest, what should I do,\" etc. because they are low-effort and asked on a daily basis in /r/stocks. Please do some basic research first and feel free to come back with any specific questions about a stock, company or market environment afterwards.\n\nIf you're just getting started, please check out our New Investor wiki: https://www.reddit.com/r/stocks/wiki/index\n\nThings you can do:\n\n1. Read the wiki which has tons of information, including reputable learning resources, broker information, and links to useful reddit posts (including old posts similar to yours)\n\n2. Search the subreddit history for similar information\n\n3. You can post questions like this as a comment on our [daily discussion stickied thread](https://www.reddit.com/r/stocks/search?q=%22r%2FStocks+Daily+Discussion%22&restrict_sr=on&include_over_18=on&sort=new&t=week)\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules", "score": 1, "replies": []}, {"body": "Take profit on some of it, half 3/4 1/4, whatever you're comfortable with having in a single stock. And then forget about it and you'll probably be in the same position in a few years.", "score": 161, "replies": [{"body": "OK! 1/4 was what I was leaning towards.", "score": 49, "replies": [{"body": "Good idea!", "score": 2, "replies": []}, {"body": "Sell it till it’s 10% of your portfolio", "score": 1, "replies": []}, {"body": "I would advise you to sell atleast half.  I'm in the industry.", "score": -2, "replies": []}]}]}, {"body": "Do people just not look at their money lol", "score": 181, "replies": [{"body": "A lot of people would be better off if they didn’t for a while", "score": 169, "replies": [{"body": "That hurt. Because it’s true. Still hurts though", "score": 19, "replies": []}, {"body": "Don't tell me what to do! ![gif](emote|free_emotes_pack|grimacing)", "score": 7, "replies": [{"body": "We’re not!  Just suggesting what you Shouldn’t do!", "score": 3, "replies": []}]}, {"body": "I felt this in my bones", "score": 3, "replies": []}, {"body": "Totally", "score": 2, "replies": []}]}, {"body": "The most successful accounts are the ones that people forget about", "score": 95, "replies": [{"body": "And forgot their passwords", "score": 9, "replies": [{"body": "And lose at the dump", "score": 5, "replies": [{"body": "That one guy is still digging through the dump to this day for his bitcoin hardrive", "score": 6, "replies": []}]}]}, {"body": "Except that one guy who accidentally threw away his bitcoin wallet. I think it was valued at one time to be worth like half a billion.", "score": 3, "replies": []}]}, {"body": "lol I know I felt pretty dumb when I looked at it recently! Honestly it was a rollover that originally only had a few thousand in it and I’ve been so focused on my current 401k. I figured it wouldn’t amount to much but I was way wrong. None of my friends nor my husband invest so I have literally no one to talk about investing and retirement with besides my dad… who is the reason why I have any investment knowledge at all. Lesson learned.", "score": 28, "replies": [{"body": "Well kudos to pops for teaching you, and good on you for taking his advice.", "score": 9, "replies": []}, {"body": "Yea I gotcha. Couldn’t have chosen a better 6 years to ignore hahaha\n\nBut yea I agree with others. Let 25% roll and put the 75% elsewhere. I’d personally only let 10% role but I’m an LLM hater.", "score": 2, "replies": []}]}, {"body": "Man i didn’t look at dogecoin for 10 years and i made about $12,000 cad after recovering it.", "score": 19, "replies": [{"body": "Much wow.", "score": 12, "replies": []}, {"body": "What’s a cad ?", "score": 1, "replies": [{"body": "It's maple syrup dollars from the great white north.", "score": 16, "replies": []}, {"body": "1 cad = 1 loonie. Hope this helps.", "score": 2, "replies": []}, {"body": "canukka dooler", "score": 2, "replies": []}, {"body": "It's a type of software used by engineers to design parts/assemblies/structures on a computer.", "score": 2, "replies": []}, {"body": "Computer aided design", "score": 1, "replies": []}, {"body": " a worthless zimbabwenesque currency", "score": 1, "replies": []}, {"body": "Loonies and toonies", "score": 0, "replies": []}]}]}, {"body": "If you ever read \"the psychology of money\" there are studies that show not looking/obsessing over it in many cases is better. \n\nPeople usually cut stocks that continue to run, and hold on to losers too long. if you just did nothing in most cases it would work out better. I found it interesting as someone who sold part of their nvda, asml, aapl after it \"got overvalued\" 50% ago.  Looking to practice this more!", "score": 12, "replies": [{"body": "Yep, I bought AMD in 2018 at like 10 bucks a share and sold at 20 thinking I was the smartest motherfucker alive.", "score": 10, "replies": [{"body": "Bough ENPH at $6, sold at $36. I never forget it.", "score": 3, "replies": []}, {"body": "Been there, done that.", "score": 1, "replies": []}, {"body": "I bought at 7 and sold at 52$. Same shit. I thought I was a genius", "score": 1, "replies": []}]}, {"body": "Same hard being an active investor and sometimes you just do nothing.", "score": 2, "replies": [{"body": "Yes. Sometimes I'm too active.", "score": 1, "replies": []}]}]}, {"body": "I invested in some shit stock 10 years ago on some platform i never use, forgot about it and now it's delisted.", "score": 3, "replies": []}, {"body": "Yep. Haven’t looked at a single credit card statement in months. Why would I, I spend way less than I make and live frugally.", "score": 2, "replies": [{"body": "To look for fraud.", "score": 2, "replies": []}]}, {"body": "The answer is unequivocally yes actually lol. The same mindset applies to forgetting that you're paying subscriptions or recurring fees to the average person. \n\nIn her case, it's worked out very well for her instead", "score": 2, "replies": []}, {"body": "Some of the most successfull investors are one that put their money into something with strong fundamentals and/or possible massive blow up potential and forget about it lol.", "score": 2, "replies": []}, {"body": "Seems like more of a luxury than a mistake to me... I'm happy to be able to pay myself first and then not even look at it.", "score": 1, "replies": []}, {"body": "I bought 25,000 xrp at 7 cents a piece. Lost the nano wallet I shipped it 2 until 3 weeks ago. It's worth quite a bit. But yes invest and forget about it, you will either be set for life or not. Probably not.", "score": 1, "replies": []}, {"body": "I bought 25,000 xrp at 7 cents a piece. Lost the nano wallet I shipped it 2 until 3 weeks ago. It's worth quite a bit. But yes invest and forget about it, you will either be set for life or not. Probably not.", "score": 1, "replies": []}, {"body": "Not looking is probably the best tip Possible for anyone young. If you have 20 years before retirement and initially  chose solid companies there is no point of looking .\n\nHuge majority of people don’t swing trade and hold for years without trimming", "score": 1, "replies": []}, {"body": "I legit try not to.", "score": 1, "replies": []}, {"body": "I don’t understand 90% of peoples financial decisions, and like, good for them I guess. They don’t care about $", "score": 0, "replies": []}]}, {"body": "There are two important general questions to answer whenever you are faced with a stock question: 1) Do you think these are good companies to own and think they will increase in value, and 2) Is the percentage they represent of your total stock portfolio appropriate for your risk tolerance? If the answer to 1) is no, then you don’t even need to move on to 2: you should sell and move the money to something else (treasury, cd, VOO, VT …). If the answer to 1) is yes, then onto question 2.\n\nNo matter what stock you buy, there is risk in having all your eggs in one basket. That’s why people diversify by buying index funds. These index funds already hold quite high percentages of NVDA, AAPL, and GOOG. So, if NVDA has ballooned to be 50% of your account, then it would be the wise move to sell down to a much smaller level. What is a good level? Depends on your conviction in NVDA, how far you are from retirement, and how ok you would be if it lost a lot of value. Personally, I would recommend based on the information you provided, sell down so that NVDA is less than 5% if your portfolio, and buy VOO with the proceeds. If you wanted to sell all of it, that would be fine too.", "score": 14, "replies": [{"body": "Thank you, this is great info. I’ll crunch my numbers!", "score": 5, "replies": []}]}, {"body": "Really depends on how much of your net worth is concentrated in the one stock.\n\nIdeally, you'd keep the single NVDA stock to be less than 10% of your net worth, depending on your risk tolerance.\n\nIf it's more than that, then I'd consider selling some, perhaps a bit at a time over several months to a year.  Or if you're uncomfortable, sell majority of it now.\n\nSo if NVDA position is $100K and you have a $1 Million net worth, nothing for you to do.\n\nIf NVDA is worth $100K and your net worth is $150K, then I'd probably consider selling a big chunk of it, again it depends on your risk tolerance.\n\nQuestions to consider:\n\nIf you don't sell and next week NVDA is 50% less than today, how will that impact you?\n\nIf you do sell and next week NVDA is 50% more than today, how will that impact you?", "score": 3, "replies": [{"body": "These are good questions to ask myself, thank you!", "score": 2, "replies": []}]}, {"body": "Let the winners run. This is psychological only. Don’t look at it for another 10 years. \nClose the app and do nothing.", "score": 11, "replies": []}, {"body": "If it's in an IRA, I would sell all and just buy an index fund.  \n\n\nI don't agree with others that NVDA is going to continue to surpass the SP500.  I have around 2%  ($80k) in NVDA in my portfolio.  I would be extremely nervous to have more than 10% of my stock portfolio in one stock.  \n\nTrim at least to a minor position so if it goes belly up your impact is negligible.", "score": 8, "replies": [{"body": "You’re so rich brah", "score": 8, "replies": [{"body": "Had to tell us the value for extra Internet points", "score": 10, "replies": []}]}, {"body": "This right here. Will NVDA continue to go up? Probably. But its days of 10x'ing are over.\n\nIts returns might (I dare say even \"probably\") beat the sp500, but I wouldn't expect by much. But it carries way more risk than the sp500. I can't know OP's entire investment situation but if it were me I'd unload most, if not all, of it and invest in an index or whatever assets you prefer. \n\nIf you were to invest that money in an sp500 index, you will still be capturing some of those potential NVDA returns since it is now one of the largest companies in the index.\n\nI'd compare this to winning the lottery. Would you take the windfall and invest \"normally\", or re-invest in more lottery tickets?", "score": 4, "replies": []}]}, {"body": "Leave it alone. They are reporting earnings next week and will likely beat estimates significantly. It will send the stock up again. I’d sell maybe 50% after that just to diversify, but don’t think selling right this moment is a good idea. Only my personal opinion.", "score": 2, "replies": []}, {"body": "Positions or ban", "score": 2, "replies": []}, {"body": "You are 33, well away from retirement. Tech and AI is going to explode over the next few decades. The technology is still new but growing at a rapid pace and will almost certainly evolve into something beyond anyone's imagination. And guess what , NVIDIA is leading the way on that. \n\n if you listen to the cowards here who are telling you to sell you will regret it. \n\nDo your self a favor and Hold what you have.", "score": 4, "replies": []}, {"body": "Sell your initial invest and hold rest. Did the same.", "score": 6, "replies": []}, {"body": "How much", "score": 1, "replies": []}, {"body": "Take some out and reinvest it into an ETF. That would be the safest way for your money to continue you know - making money.", "score": 1, "replies": []}, {"body": "It sounds like you're bullish on the semiconductor companies but just want to diversify. You could sell off your cost basis of Nvda and let it ride and then buy SOXX.", "score": 1, "replies": [{"body": "This is a great idea thanks!!", "score": 2, "replies": [{"body": "You're welcome! Also look at SOXQ. Good luck!", "score": 1, "replies": []}]}]}, {"body": "Set a trailing stop loss so that you get most of the gains whilst exiting before the big crash.", "score": 1, "replies": []}, {"body": "If you had that amount in cash, would you buy NVIDIA? If not, sell it. Having that money because you bought that stock is an accident of history. You should not take decision about what you do today based on what you did six years ago. It was a bad decision with good consequences. Now you know it’d be a bad decision to keep it (otherwise you would have been buying NVIDIA since then), so sell it.\n\nPeople are telling you that it’s a good stock and that it’ll do great, but you just can’t know.\n\nInvest the money in something you’re comfortable with. Worst case scenario, sell most of it. You should not invest more than 5% of your portfolio in single stocks (preferably nothing).", "score": 1, "replies": []}, {"body": "I’d cash out 90% and find another gym to forget about", "score": 1, "replies": []}, {"body": "Well there earnings come out on the 28th of this month so your are either going to have a lot more or a lot less next week. Choose wisely.", "score": 1, "replies": [{"body": "Yeah I know it’s soon! which is why I figured I make a decision soon… or not", "score": 1, "replies": []}]}, {"body": "Just wire transfer it all to me and I will manage it from here (not a scam)..", "score": 1, "replies": []}, {"body": "If you trim position,which is ok to diversify, do it over time, months, years, it will be capital gains(earnings) for that taxable year.", "score": 1, "replies": []}, {"body": "Sell half and quit your job, then move to France or some other beautiful place", "score": 1, "replies": []}, {"body": "Sell 1/2 and after Aug 28 (earnings decide if you want to keep or sell)", "score": 1, "replies": []}, {"body": "it really depends on your personal goals and comfort. asking here with minimal info will give you generic biased answers\n\nthe fact that you are asking, as well as starting off with \"Fidelity told me\" and \"back then i had no idea what i was doing\" (did that change?) means you should probably sell majority, if not all of it, and stick to index funds.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Cost basis was around 6-6.9 I think, October 2018? It’s a blur since I was moving jobs. I do remember checking it a couple times the first year but it was down that whole year so I decided to just forget about it because it was making me sad lol\n\nI did it because my dad was pestering me to invest my rollover rather than just let it sit there. I had no idea what I was doing so I did the safe Google and Apple shares. Figured I’d be adventurous and try the fidelity suggested one because it looked solid too but I didn’t do too much digging on it. So I got $4.5k ish", "score": 1, "replies": []}]}, {"body": "Wait until after earnings call next week before repositioning.", "score": 1, "replies": []}, {"body": "Convert it to VTI", "score": 1, "replies": []}, {"body": "Well how the hell much was it, for those of us who came across this post after you deleted the screenshot?", "score": 1, "replies": []}, {"body": "I don’t like owning individual stocks so I’d move it to voo/vti.", "score": 0, "replies": [{"body": "Yeah it didn’t bother me when I didn’t have much but I find I don’t like it either.", "score": 6, "replies": []}]}, {"body": "My thought is: if not thinking about it or doing anything worked so well until now, why change the strategy?", "score": 1, "replies": []}, {"body": "Congrats! I'd say it comes down to your financial goals and situation. NVDA has outperformed the market and will continue to do so. \n\nDo you need the money anytime soon? What's the time horizon? If your horizon is still pretty long no need to sell any. \n\nIf I were you I'd hold and do the same as you did and forget about it :)", "score": 1, "replies": [{"body": "Thanks! plan on working until I’m 60 max so I’ve got time to lose, but it would be nice to retire early.", "score": 1, "replies": [{"body": "Nice, with that 60 target and you want to retire earlier. Honestly you're gonna have to take some risk.\n\nWith index, yes you can expect a more expected return, so therefore you can reach retirement earlier but this means you'll have to contribute more into it.\n\nI would look at your overall allocations, and after budget etc. If you can stomach the risk, I would hold NVDA and not sell any at all.\n\nBut most importantly it's your stomach for risk, if having this concentration doesn't let you sleep at night then perhaps reduce it.\n\nBut again, I'd hold NVDA until 60 plus because it's these sorts of companies that will help you:) check out Peter Lynch! FYI he worked at fidelity :)", "score": 2, "replies": [{"body": "I’ll check him out! Yeah my dad likes to show me how well the Amazon shares he bought decades ago made him a lot of money to inspire me to keep investing. He loves NVDA and doesn’t want me to sell either.", "score": 1, "replies": [{"body": "Nice, you're in good hands and he's shared great advice with you.\n\nAmazon has done well and will continue to do okay.\n\nKeeping it simple. For NVDA, it's still got alot of things coming up in the future.\n\nYeah there is competition, biggest one being AMD but not quite the same but it's like TSMC, their lead on it is really strong and they got a good leader at their helm.\n\nIf you agree, Ai, self driving cars, VR, robotics, and not quite soon but Space, will need these sorts of tech. I think they still got alot of runway taking these into account.\n\nAt the end of the day it's up to you but again if I were in your shoes, I wouldn't sell any, people would kill to have your shares lol..no wonder it's easy for them to say sell. Good luck do your due diligence, trust your gut. Thanks for listening to my 2 cents\n\nSorry just wanting to add one last thing, remember you had forgotten about this in the first place, from 2018 to now, there's plenty of people who missed the boat, sold too soon etc, ideally that's how you want to treat it again going forward!", "score": 3, "replies": []}]}]}]}]}, {"body": "If you want to pull another move like that,you should look at asts…..", "score": 1, "replies": []}, {"body": "Yes, diversify! If you want to make sure you don't lose a lot of money buy world ETFs. Those fluctuate but are a pretty safe bet. Make sure they are passive and don't cost about 0.25% per year.", "score": 1, "replies": []}, {"body": "When you sell you buy stocks that would outperform the previous one.", "score": 1, "replies": []}, {"body": "I would personally sell half and dump it in VOO", "score": 1, "replies": []}, {"body": "We do know where AI is going and have for a while. Do not sell your NVDA. The AI arms race is just beginning.", "score": 1, "replies": []}]}
{"title": "TGT Calls Hit", "selftext": "Little gains compared to some people but definitely going to work my way toward 100k", "id": "1ext6of", "created_utc": 1724255591.0, "score": 356, "upvote_ratio": 0.96, "num_comments": 97, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 4 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Nice, I had one share. Using that $20 for a nice lunch.", "score": 149, "replies": [{"body": "Do you skip lunch if you miss?", "score": 22, "replies": [{"body": "You grab it at Wendy’s.", "score": 14, "replies": [{"body": "After your shift ends", "score": 6, "replies": []}, {"body": "Grab what at Wendy’s 🤨", "score": 5, "replies": [{"body": "Your wiener out by the dumpster", "score": 2, "replies": [{"body": "Now we’re talking 😈", "score": 1, "replies": []}]}]}]}]}, {"body": "and you sold it already?\n\npaper hands", "score": 9, "replies": [{"body": "i put the principal in RKLB", "score": 7, "replies": [{"body": "Acceptable answer.  Looking like a lunch tomorrow as well", "score": 8, "replies": [{"body": "Rklb something I should invest in? 👀", "score": 1, "replies": []}]}]}]}]}, {"body": "How are you guys deciding to buy these calls ahead of time? Teach your fellow regards", "score": 65, "replies": [{"body": "Ouji board, crystals, palm reading, masturbation", "score": 121, "replies": [{"body": "Masterbation is like 1/365 times correct. I guess that one good choice could be worth It. Even if you get a bad prediction at least you got your nut off.", "score": 16, "replies": [{"body": "Palm reading IS masturbation.🤔", "score": 3, "replies": []}]}, {"body": "Or you know, the posted earnings reports calendar https://www.reddit.com/r/wallstreetbets/s/nBYyaded63", "score": 9, "replies": [{"body": "I thought Earnings usually ends in IV crush a lot of times?", "score": 3, "replies": [{"body": "Sometimes it does…sometimes it doesn’t", "score": 2, "replies": [{"body": "Most of the time it does result in IV crush*\n\nsometimes the lotto play hits (like OP).", "score": 3, "replies": []}]}, {"body": "Not if it's a 10% increase. \n\nUsually if stocks even after good earnings only gain like 5% so then you'd get hit by the iv crush pretty bad.\n \nGood example would be if you bet on Walmart instead.  Day right after earnings there was a pretty massive dip before it restarted its runup.\n\n75c walmart paperhanders would've seen their .35 turn into .13.", "score": 2, "replies": []}, {"body": "what happens when there is IV crush?", "score": 1, "replies": []}]}, {"body": "So what you’re saying is I should put my money in cava today because they have pretty good earnings from 2023 and q1 2024? Am I mistaken ?", "score": 3, "replies": [{"body": "Up 40% so yeah, should have", "score": 3, "replies": [{"body": "Maaaan you told me all late smh lol", "score": 1, "replies": [{"body": "Don’t worry, only paper traded it this week so I’m up a fake $2k", "score": 2, "replies": [{"body": "Where do you paper trade? I want to have a contest with some of my friends with fake money.", "score": 1, "replies": [{"body": "ThinkOrSwim platform with CharelsSchwab", "score": 1, "replies": []}]}]}]}]}, {"body": "lol I’m not saying you should put your money anywhere. All I’m saying is we aren’t just picking at random. The earning report calendar will show you. Cava will report then yes. Whether it goes big up or big down who knows! Good luck 😂", "score": 2, "replies": []}]}]}, {"body": "I start and stop as masturbation. That must be where I'm going wrong. 🤔", "score": 2, "replies": []}]}, {"body": "1. Find the earnings dates\n\n2. find ATM calls/puts\n\n3. Be regarded\n\n4. ???????????\n\n5. Post on wsb", "score": 34, "replies": [{"body": "Why atm though, way more expensive…", "score": 2, "replies": [{"body": "See step 3 pls.", "score": 16, "replies": [{"body": "Okay daddy-o", "score": 2, "replies": []}]}]}]}, {"body": "They gambled on earnings report.", "score": 16, "replies": []}, {"body": "Just look at the chart.\n\n If it's at the bottom: Get Calls. \n\nIf it's at the top: Get Puts. \n\nSimple", "score": 8, "replies": []}, {"body": "I bought TGT options in June that don’t expire until March totally on a whim and had been underwater since the purchase, but today I went from $4400 in the hole to $5000 in the green!\n\nhttps://preview.redd.it/tyzqkisdh4kd1.jpeg?width=1179&format=pjpg&auto=webp&s=b6c3b9c4ce6c15b38f580b8a65640f33c5f4f7ac", "score": 7, "replies": []}, {"body": "Gambling", "score": 10, "replies": []}, {"body": "Reading the tea leaves by smelling their own farts.", "score": 3, "replies": []}, {"body": "If You wanna be in the casino business , you follow the regards. \nIf You wanna be in the probability business , first you become autistic , then you throw your fucking tv and video games out, and you learn make your entertainment learning about the world around you, then you take that knowledge and evaluate stocks with it. Then you pick the ones you think are a good deal and that you think would help society. Then you lose 30 dollars for every dollar you make but hey at least you’re a knowledge autistic regard with a process who can write advice on Wall Street bets", "score": 3, "replies": []}, {"body": "Yolo. If it hits, you're up big. If it misses, oh well, you'll make the money back one way or another. Stop being scared to lose", "score": 2, "replies": []}, {"body": "There’s literally earnings reports here weekly. Zoom (ZM) reports after hours today. https://www.reddit.com/r/wallstreetbets/s/nBYyaded63", "score": 1, "replies": [{"body": "Zoom has to be dropping, but I didn't get a chance to make the play this week.", "score": 1, "replies": []}]}, {"body": "Leftover crayons we didn’t eat", "score": 1, "replies": []}, {"body": "Moms buy stuff at Target, what else do you need?", "score": 1, "replies": []}, {"body": "Cathie woods inverse", "score": 1, "replies": []}, {"body": "Also, when it all goes to shit, we don’t always post that part. But for every hit, you might have 4 or 5 misses, but you can still be winning when the hits are good.", "score": 1, "replies": []}]}, {"body": "How did you know to do this?", "score": 12, "replies": [{"body": "1. Go to earnings thread\n2. Flip a coin\n3. Wake up to a lambo or apply to Wendy’s", "score": 72, "replies": [{"body": "![img](emote|t5_2th52|4271)![img](emote|t5_2th52|4271)", "score": 9, "replies": []}]}, {"body": "this one a pretty simple bet. walmart had earnings last week and stock went up. target is essentially a nicer Walmart. \n\nmonday the stock was 145$. i bought calls for 152.50. so i wasn’t expecting it to shoot up 16%, but happy it did. OP what time did you sell?", "score": 7, "replies": [{"body": "Right away in the morning", "score": 3, "replies": []}]}, {"body": "Sir this is where you come to learn how to lose grandmas pension.", "score": 3, "replies": []}, {"body": "https://www.reddit.com/r/wallstreetbets/s/nBYyaded63", "score": 2, "replies": []}]}, {"body": "Love seeing these gain spike posts. Congrats!", "score": 11, "replies": []}, {"body": "Do you have any plays for Zoom?", "score": 11, "replies": [{"body": "Calls", "score": 15, "replies": [{"body": "I had the Zoomies too, bought some cheapy OTM calls and this pokemon appeared. Hopefully stays up at open tomorrow\n\nhttps://preview.redd.it/0wphukovs3kd1.png?width=1080&format=pjpg&auto=webp&s=272f0d3599c7286bce5c526e9ef83f267edd44ef", "score": 5, "replies": [{"body": "Were you able to profit or did iv crush bite you in the morning?", "score": 1, "replies": []}]}, {"body": "Any reason?", "score": 5, "replies": [{"body": "They’re not called Zoom Calls for nothing", "score": 50, "replies": [{"body": "This is the best answer anyone could have given", "score": 10, "replies": []}, {"body": "You son of a bitch, I’m in", "score": 7, "replies": []}, {"body": "You summbtch I’m in", "score": 5, "replies": []}, {"body": "Yea, I’ve never heard of anyone zoom putting", "score": 4, "replies": []}, {"body": "hell ya", "score": 2, "replies": []}]}]}]}]}, {"body": "Everything will be behind glass and it’ll be a massive hassle to shop there…. Calls to the moon.", "score": 5, "replies": []}, {"body": "Hi, i'm pretty new to investing can someone explain how did people who invested in TGT got such big gains when stock itself only gone up about 16%", "score": 9, "replies": [{"body": "Options,  not stock. ", "score": 6, "replies": [{"body": "Now that he learned of options, dude gonna lose his whole port", "score": 5, "replies": []}]}, {"body": "So a single option let's you control 100 shares.\n\nRight now target is trading for ~$160. You can buy a $160 call that expires tomorrow for about $150 (the $150 is called premium). That $150 gives you the option tomorrow to buy 100 shares at $160 no matter what the price is.\n\nLet's say it jumps another 16% so now it's trading at $185 tomorrow.\n\nWell you have right to buy 100 shares at $160 and since it's trading at $185 you automatically are up $25 ($185-160) a share or $2500 for the option. \n\nThis is how the gain percentage looks crazy compared to the 16%. You spent $150 and made $2500. You basically are up 1566% on your $150. \n\nNow let's say the opposite happens. It tanks to $145. Well tomorrow you still have the option to buy those shares at $160, but obviously you wouldn't since you can buy it at $145 market rate. So you just let it expire and you lose your $150 you spent to have the option to buy. \n\nPuts are the opposite, but to keep it simple most people start by understanding calls since it seems more intuitive for whatever reason.\n\nThere are legitimate strategies to minimize risk with options, but around here people just use them because of the high reward and relatively low risk (only being able to lose the premium).\n\nWelcome to the casino.", "score": 5, "replies": [{"body": "thank you alot", "score": 2, "replies": []}]}]}, {"body": "King shit ![img](emote|t5_2th52|8882)", "score": 2, "replies": []}, {"body": "They’re gonna take that money to Lulu", "score": 2, "replies": []}, {"body": "https://preview.redd.it/34edsctjf4kd1.jpeg?width=1179&format=pjpg&auto=webp&s=6c045a7259ff382745e2b39ffe66f4b9ad3fb68a\n\nI bought these in June and went from being $4400 down to being $5k up today!", "score": 2, "replies": []}, {"body": "Nice gains my brother.", "score": 3, "replies": []}, {"body": "What is a call and why does it make so much more vs reg investing in the stock. Any advise/answers appreciated .", "score": 3, "replies": [{"body": "A call option is a contract between a buyer and a seller to purchase a certain stock at a certain price up until a defined expiration date. \n\nHowever, most people here don’t exercise options like explained above, they just buy and sell them. They move up/down a lot more than the underlying stock.\n\nIf you want to learn more, just YouTube “options trading for beginners” or something", "score": 6, "replies": []}]}, {"body": "I'm curious, what strike did you buy? Was it OTM?", "score": 2, "replies": [{"body": "Hella out of the money 160 weekly I decided that based on walmart earnings and foot traffic to target. There was no way they wouldn't beat earnings. Walmart specifically said they saw an uptick in general merchandise. Now did I know it was going to 🚀  no but even if it went up 10 dollars I would have made profit", "score": 7, "replies": [{"body": "I bought one 540 ITM call... I wonder if I were to make more if I did 10 contracts OTM for the same price?", "score": 1, "replies": [{"body": "You definitely do out the money. I also looked at previous earning moves and how often earnings was beat", "score": 1, "replies": []}]}]}]}, {"body": "Yet another Robinhood Home Screen post that doesn’t show positions or fills", "score": 1, "replies": [{"body": "https://preview.redd.it/zg49q2bzy2kd1.jpeg?width=1080&format=pjpg&auto=webp&s=10310ae2382548cff1c6fdac917e44d197da654b", "score": 3, "replies": [{"body": "Damn, shouldn't have cancelled that first sale. Congrats though!", "score": 2, "replies": []}]}]}, {"body": "What about your PANW options?", "score": 1, "replies": [{"body": "I bought 3 put options based on some dd and got fucked only lost 100 dollars", "score": 2, "replies": []}]}, {"body": "Definitely", "score": 1, "replies": []}, {"body": "hey can you break this down for me what you did\n\nive been doing CC's and CSPs but your gains are dwarfing mine", "score": 1, "replies": []}, {"body": "I've been holding since it was at $23. Cashed out at $128 yesterday. \n\nWill buy the dip. There's gonna be a dip, right?", "score": 1, "replies": []}, {"body": "Nice!", "score": 1, "replies": []}, {"body": "What are we thinking for 11/20 earnings?", "score": 1, "replies": []}]}
