{"title": "Intel reportedly gave up a chance to buy a stake in OpenAI in 2017", "selftext": "", "id": "1en6ojz", "created_utc": 1723125507.0, "score": 660, "upvote_ratio": 0.96, "num_comments": 95, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 1 | **First Seen In WSB** | just now\n**Total Comments** | 0 | **Previous Best DD** | \n**Account Age** | 6 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": [{"body": "I use to work there and we always joked how Andy Bryant killed a proposal to buy Nvidia then got promoted to lead the board of directors.  \n\n Honestly, the only reason I'm bullish is because that type of mindset got replaced by the current CEO.   \n\nTheoretically they should start innovating again, but just laying off people because you suck at forecasting isn't looking very promising. ", "score": 1, "replies": []}]}, {"body": "OpenAI is a money losing business. The Azure bill would have killed Intel. That computing power is not cheap.", "score": 502, "replies": [{"body": "You’re getting downvoted but you’re absolutely correct. Microsoft didn’t given OpenAI cash, they gave them compute via Azure credits. Multiple things can be true simultaneously. OpenAI can both be making the most groundbreaking AI model in history and they can be going out of business while doing so.", "score": 222, "replies": []}, {"body": "Yup. Not necessarily a bad thing.  Outside of ChatGPT, OpenAI has been all over the place with product and half of what they made is just them copying others.\n\nGPTs = Poe  \nSearchGPT = Perplexity  \nDalle = SD / MidJourney\n\nThey have no vision, they don't know where to go, and LLMs as a technology seems to clearly be at a plateau.\n\nThe general public also doesn't like AI in general and adoption is low.\n\nThen, on top of all that you have Sam Altman's antics and subterfuge which leaves most people not trusting him.\n\nAnyone downvoting this is just some OpenAI fanboy", "score": 57, "replies": [{"body": "Sam \"Most Punchable Face\" Altman lmao. Dude looks like a failed tennis player.", "score": 31, "replies": [{"body": "![img](emote|t5_2th52|4271)", "score": 8, "replies": []}]}, {"body": "ChatGPT has other competitors true but how much money their competitors are making? The default AI/chatbot is them and they have almost entirely the business market share. They have not maybe the best models anymore but they're clearly going for market share which is more important.", "score": 6, "replies": [{"body": "No, it's not. If the technology doesn't mature into something that's more than what it is now, soon enough, then market share is irrelevant because they'll be broke. It's a dumb play especially considering how much resources they've wasted on all these substantially different products.\n\nI use AI regularly, I'm impressed with it, feels like science fiction to me, but among my friends and family I'm a minority.\n\n-They see it gets things wrong which translates into work for them\n\n-They know how it came to be -- by stealing others works and they all know artists and that's a bummer too.\n\n-They see the news of the overly harsh NDAs and roll their eyes at 'Techbro 1.0'\n\nLast but not least, OpenAI aka 'ClosedAI' as they're called has erroded SO much trust and with something like AI, something with the capability to manipulate you, imo trust is going to end up being king for these products and OpenAI lost it.\n\nFeel free to bet on OpenAI if you want, but I think it's a bad move.\n\nBtw I haven't even touched on how competitors are undercutting OpenAI.  Meta spending under a $100 mil to release opensource models that are almost just as good as GPT4, while OpenAI is burning billions... is an incredible thing for ClosedAI to overcome.\n\nThey're really in trouble my friend.  If they had a Steve Jobs at the helm, I wouldn't count them out, but Sam Altman is no Steve Jobs and in a year or so I wouldn't be surprised if he's more of a Steve Jobless.", "score": 10, "replies": [{"body": "Lol you're speaking like the other models are miles better than ChatGPT. It's all close to each other and GPT4 have been out for like a year and they using the compute for the next model. They are so much in front they don't feel the pressure. All the other models stole ftom the web, each and everyone of them. Now tell me which Fortune 500 companies signed a deal with those open source models?", "score": 3, "replies": [{"body": "No, I'm not. \n\nIt's not about performance. Meta is doing what they're doing to bleed customers from OpenAI.  They don't need to be better just competitive.  \n\nI didn't say only OpenAI stole from the web, I said 'ai' as in, generally.  You're right and everyone else believes that to, it's a problem for a lot of people.  \n\nI think it's a fair point they have F500 business, but if these opensource models are just as good less small and medium businesses will use OpenAI.\n\nEvery point I made was addressing forces that are making openai's goal of market share difficult.\n\nYou cheerleading openai doesn't affect me at all.  Do what you want.\n\nI wasn't trying to put you in a mood.", "score": 1, "replies": [{"body": "Put me in a mood? This is merely a discussion. If you didn't take it like that, that's on you. What exactly have Meta been doing to bleed OpenAi?", "score": 0, "replies": []}]}]}]}]}, {"body": "I'm not a fanboy but a data scientist. Sorry but all your points are just garbage. \n\nJust because you take an alternate view doesn't mean you're correct. If anything Open ai is trying everything the vertical has to offer and all they need is one another ground breaking product. We haven't even scratched the potential of GenAI. \n\nHeck many companies would buy a paid subscription of chat gpt to improve productivity.", "score": 1, "replies": []}]}, {"body": "Sounds like these Intel guys are geniuses, and just my luck I’ve got $700k lying around to buy the dip!", "score": 4, "replies": []}, {"body": "Microsoft is invested in OpenAi because if they give OpenAi 1 Mio $, they will invest it in Azure Computing power, which will turn up at Microsoft as revenue, boosting their stock more than 1 Mio $. And they will continue to do so because everybody likes propped up stonks.", "score": 3, "replies": []}, {"body": "Intel would have invested in the company, not paying its bills. MS would have invested in OpenAI anyways, providing Azure credits. It would have been one way for Intel to be a part of the future and be a forefront of AI tech. \n\nWho knows, Gaudi could have been developed earlier and better, perhaps being more competitive with NVDA and AMD. As it stands, Intel is a dying legacy company.", "score": 9, "replies": []}, {"body": "$20 a month for chat gpt-4 isn't profitable!?", "score": 5, "replies": [{"body": "Nah, I've seen Ed Zitron guessing they have about 12 month of runway left and needs to raise more funds in 3-6 months. [https://www.wheresyoured.at/to-serve-altman/](https://www.wheresyoured.at/to-serve-altman/)", "score": 11, "replies": [{"body": "It really depends on what they are spending their runway on doesn't it?\n\nIf they are spending billions on hardware that will generate future profits then it's a good thing.", "score": 3, "replies": [{"body": "Honest questions: Have they ever generated a profit? What could they change that could make them profitable?", "score": 5, "replies": [{"body": "How long did it take YouTube to make a profit?\n\n\nBut if they could generate full length feature films based off supplied assets and story boards, enable multi language dubs, fast editing, trailer creation, advertising etc.... I could imagine that being incredibly valuable.", "score": 1, "replies": [{"body": "I know I'm referencing the same source but Ed Zitron has been saying that Sora is terrible for video creation and there's no clear path to fixing the biggest issues, namely consistency between shots. \n https://www.wheresyoured.at/expectations-versus-reality/\n\nMulti language dubs would be interesting/useful. I was surprised to learn recently that those lyric trackers in Spotify are done manually, often by the artists themselves. If an AI could do that, it would be helpful.", "score": 4, "replies": [{"body": "First I'd say that people (including experts in the field) just didn't think Sora would be possible for decades even five years ago, so I'd take I'm not going to put much weight into what this person is saying. He also completely lacks any imagination if he thinks an alpha version of an unreleased product can't fix some of the issues he is talking about. Especially as film has many of the exact same issues but they have been solved at considerable expense (consistency between shots for example has a team of people who work to ensure this, and cost of filming a scene is reduced by teams who storyboard and meticulously plan shots long in advanced) - if a director tried to change a camera angle during a live shot it would be impossible, potentially the whole set would need to be rebuilt and it would take weeks and cost millions. So complaining about minutes and a few $ in power cost doesn't really make sense to me as a complaint.\n\n\nSo ignoring that and assuming these things can't be fixed (which I don't think is a valid point of view), it still has huge room to completely change film making forever. \n\n\nIn this scenario it might not replace big budget films, it could start a new genre of small scale film production. A creative idea could now potentially be made by an individual with a few prompts adjusting the script and visuals to tell their story. They might not have control over camera angles, or assets and some items might not be as consistent as they'd like but not everyone cares about that. The story is what's important.\n\n\nI could go on with many other ideas for the technology as it exists today, it's already changing how I work. And it's getting cheaper still - I'm still shocked at the cost of 4o-mini - it's amazingly cheap for what is does. Thousands of requests cost a couple of dollars.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Rises question how long before AI free model goes away and results are pre calculated/cached and populated.", "score": 1, "replies": []}, {"body": "Microsoft and Google are happy to lose money on these products for now, because short-term, who has what model which does what better is a sales pitch, and long-term the payoff is who wins the magic money printer of actually useful AI tools", "score": 0, "replies": []}]}, {"body": "It was a smart move. OpenAI isn’t profitable and only surviving because Microsoft subsidizes their cloud costs heavily. Intel doesn’t have as much money to burn and doesn’t own their own world leading cloud.", "score": 77, "replies": [{"body": "They could have kickstarted their AI ASIC business with applications. Intel had good chips, but absolutely sucked in software resulting in multiple failed products in the GPU/AI space.", "score": 11, "replies": [{"body": "Wishful thinking. Aside from Intel not being adaptable enough to do that due to mismanagement, Intel would still have to spend a lot and still lose out to Nvidia. As far as I know, the ASIC business hasn’t turned a profit for Microsoft and they were better positioned to take advantage of it.", "score": 9, "replies": []}]}]}, {"body": "Based on all the WSB comments and intel, I am pretty sure the intel bottom is in.", "score": 14, "replies": [{"body": "Intel doesn't have a bottom ask grandma", "score": 16, "replies": [{"body": "I think the billions of existing intel CPU owners in the world would suggest otherwise.", "score": 6, "replies": []}]}, {"body": "> bottom\n\nPost your positions!!!", "score": 1, "replies": []}]}, {"body": "L after L for intel", "score": 64, "replies": [{"body": "Int L;", "score": 44, "replies": [{"body": "Nice", "score": 1, "replies": []}]}, {"body": "At this point, I think that they just do it on purpose ![img](emote|t5_2th52|4267)", "score": 13, "replies": []}, {"body": "Its like at IBM or Kodak levels of inadequacies...", "score": 1, "replies": []}]}, {"body": "Of course they did. If they did something right, it was an accident.", "score": 25, "replies": []}, {"body": "Retardio", "score": 14, "replies": [{"body": "Should join r/wallstreetbets \n\n\"One of us... one of us...\"", "score": 5, "replies": []}, {"body": "solana mentioned in wsb", "score": 1, "replies": []}]}, {"body": "Intel fumbled the bag hard on this one. Back in 2017, they had the chance to snag a 15% stake in OpenAI for a cool $1 billion. But Bob Swan, the CEO at the time, didn’t think AI was gonna blow up anytime soon. \n\nFast forward to now, and OpenAI is a huge player in the AI game, thanks to ChatGPT and billions in investment from Microsoft. Intel’s AI game is lagging while Nvidia’s making bank. Talk about a missed opportunity!", "score": 16, "replies": [{"body": "I get the same Otellini vibes from when he passed on the iPhone back in the blackberry days.", "score": 7, "replies": []}]}, {"body": "Lol so add this to the list of deals they've fucked themselves over with... Apple, OpenAI, NVIDIA ...\n\nPlease BAN the word Intel... It's a shit company", "score": 17, "replies": [{"body": "It is an extremely shit company but it has potential to be great, thats what pains me.\n\nI am not going to invest 700k or anything into this company but I still assume it will get better by end of decade.", "score": 19, "replies": [{"body": "assume based on what? would you like a list of once great companies that had potential and don't exist anymore?", "score": 2, "replies": [{"body": "its a very important company to the US so even if it does badly I don't see them disappearing. they have the backing of the US government.\n\nThey invested tons of money in new fabs, this doesn't guarentee better profitability but still.\n\nNot gonna invest in them because even if I would bet the stock price will rise by 2030, I am betting on amd performing better.", "score": 6, "replies": [{"body": "i mean pretty fair. I guess they can also stay around and not be profitable. With general 'inflation' it'll be worth more on average in 2030, I still think gains will be well below market average though.", "score": 2, "replies": []}]}]}, {"body": "The 700k guy has been immortalized in the worst way possible", "score": 1, "replies": [{"body": "Poor guy ^(literally.)", "score": 1, "replies": []}]}]}]}, {"body": "The Next Xerox.", "score": 3, "replies": []}, {"body": "How did intel manage to literally miss out on all trends the last two decades ?", "score": 3, "replies": []}, {"body": "Whenever a company dies everyone always says what they could have done but they quite literally died because they did not have good decision makers. Hindsight can't run a company.", "score": 3, "replies": []}, {"body": "These comparisons are pointless. If it did buy a stake - it would probably shift OpenAI into a different direction and it wouldn’t be as successful as it is now.", "score": 3, "replies": []}, {"body": "They were right in that. These AI innovations are cash incinerators. The power they consume to do work is insane.", "score": 4, "replies": [{"body": "any idea as to how much..? \n\nas a regard who's still learning about the implications of AI, i'm curious if we're talking years or decades before they run into issues with cash", "score": 1, "replies": [{"body": "The primary, actually AI developing companies, will not run out of money.\n\nThe leeches tho, the companies using provided LLMs to run a business, will fade into obscurity as AI advances.", "score": 1, "replies": []}]}]}, {"body": "Int'L", "score": 2, "replies": []}, {"body": "And I give up a chance to buy the winning lottery numbers before it came out.\nWhat's the point?", "score": 2, "replies": []}, {"body": "How much money has OpenAI made?", "score": 2, "replies": []}, {"body": "Intel fumbling this too is so on brand for them. Fumbled the iPhone, fumbled cloud, fumbled GPUs and accelerators, fumbling AI currently. This is so on brand for them.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "You're ignoring the $3T company that sold the hardware for OpenAI. It's not Intel. This is why.\n\n\nYou belong here", "score": 5, "replies": []}]}, {"body": "It's the right decision. If OpenAI run by Intel, it's probably CPU based. What they have achieved isn't possible.", "score": 1, "replies": []}, {"body": "7 years ago is a long time ago. OpenAI probably would have been shit now too.", "score": 1, "replies": []}, {"body": "Intel is like Yahoo.", "score": 1, "replies": []}, {"body": "in 2017 wasn't it still a non profit open source?", "score": 1, "replies": []}, {"body": "Holy fuk everyone is dunking on Intel", "score": 1, "replies": []}, {"body": "Grandma thought heaven would be better than this", "score": 1, "replies": []}, {"body": "INTC is the boomer stock mentality personified", "score": 1, "replies": []}, {"body": "Just makes Intel CEO a mod already. There must be a strict rule about not posting religious stuff for him though", "score": 1, "replies": []}, {"body": "Shocking. Another inteLLLLLL", "score": 1, "replies": []}, {"body": "OpenAI is the new Tulips.", "score": 1, "replies": []}, {"body": "Don't care. More narrative for the bagholders.", "score": 1, "replies": []}, {"body": "Was that a wise choice?", "score": 1, "replies": []}, {"body": "Cool fuck intel right into the ground", "score": 1, "replies": []}, {"body": "At this point someone just needs to pit intel of it’s misery.", "score": 1, "replies": []}, {"body": "OpenAI the AOL of AI? Where’s my cds?", "score": 1, "replies": []}, {"body": "I saw a headline OpenAI could go bankrupt in the next year without enough funding.\n\nIt probably wouldn't make a difference if Intel invested in them.\n\nDoes anyone even talk about ChatGPT anymore?", "score": 1, "replies": []}, {"body": "Based off everything I know about openAI I think that was a smart choice. OpenAI has only now started making something popular, so intel would’ve been funding them for 6+ years without major developments. Additionally, Microsoft has the cloud infrastructure to support OpenAIs needs, Intel does not and would likely have been paying market rate to a cloud provider or building its own bespoke infrastructure, which would’ve been expensive.", "score": 1, "replies": []}, {"body": "I can't imagine OpenAI's employees thriving under Intel's management.", "score": 1, "replies": []}, {"body": "Might be a money losing business but them being associated with it would have probably pumped the stockr", "score": 1, "replies": []}, {"body": "To me this is none news. Like we never hear that Intel (or any other company) had a chance to buy a stake in a failing company. And declined we only hear of these when one of the companies grow big.\n\nLike if Netflix had failed I doubt we'd hear about Blockbuster not buying them.", "score": 1, "replies": []}, {"body": "That tracks. Terrible leadership", "score": 1, "replies": []}, {"body": "So this isn't a blockbuster not buying out NFLX for $1MM scenario?", "score": 1, "replies": []}, {"body": "Probably Intel’s only good decision", "score": 1, "replies": []}, {"body": "OpenAI is going to be irrelevant. They just showed the world what is possible and now everyone is looking for opportunities. \n\nAltman is such a creep anyway.", "score": 1, "replies": []}, {"body": "When intel wants to shoot themselves in the foot they never miss", "score": 1, "replies": []}, {"body": "Intel is the yahoo of chips", "score": 1, "replies": []}, {"body": "Where is Jerry Yang when we needed him.", "score": 1, "replies": []}, {"body": "Isn't openAI hemorrhaging money at a rate that dwarfs even the war in Ukraine?  There is no way any company could sustain that other than everyone's third favorite money printing machine, MSFT.", "score": 1, "replies": []}, {"body": "Intel should have bought Radeon.. \n\nWhy these company always run backward..", "score": 1, "replies": []}, {"body": "Thanks for this 2017 article man, trying to create bad sentiment huh?", "score": 0, "replies": []}, {"body": "It‘s trash.", "score": 0, "replies": []}]}
{"title": "NVDA will beat earnings again this month!", "selftext": "Just to be clear this is not financial advice, and there are more factors than an earnings beat that affect stock price, but this is why I think NVDA will beat revenue predictions of $28B on Aug 28th 2024.\n\nThis article https://observer.com/2024/06/nvidia-largest-ai-chip-customers/ lists MSFT and META as the 2 biggest customers of NVDA chips last year (they spent $9B in 2023). Their total capex for 2023 is $55.3B combined. Which means that they spent 16.2% of their total Capex spending in 2023 on NVDA chips alone. So I looked at their Capex for this last quarter, which is $22.04B combined, up from $15.17B combined in Q2 2023 (up 45% YoY). The article also states that these 2 along with AMZN, and GOOGL make up a little less than 40% of all NVDA chip sales in 2023. So, I looked at their numbers as well. AMZN and GOOGL in Q2-2024 spent $30.80B on Capex, up from $18.33B in Q2 2023 (up 68% YoY). If we use the 16.2% of their capex rule on NVDA from 2023 then combined the 4 companies spent $8.56B in Q2 alone this quarter on NVDA chips.\n\nhttps://preview.redd.it/fw6ulcq1nhhd1.png?width=606&format=png&auto=webp&s=c5f045bd5d7c8d10238567c37837319ed8ca71e3\n\nBut I think with such a huge increase YoY on Capex spending that the total % spent of capex on NVDA chips is closer to 30% at least. Which would mean they spent $15.82B on NVDA chips last quarter. Looking at NVDA’s Q1 earnings they reported $22.5B in datacenter chip sales Q1. Meaning potentially 40% of their customer base has already purchased 75% of their total revenue in chip sales from Q1 2024 in Q2 2024. NVDA in their first quarter presentation is expecting $28.0B in total revenue for Q2 2024, which is 7.52% higher than what they reported in Q1 ($26.04B). Yet their biggest customers are reporting an avg increase in Capex spending of 19.33% from Q1 to Q2 in 2024. \n\nhttps://preview.redd.it/ezyilod4ohhd1.png?width=846&format=png&auto=webp&s=e0db445fd539a08346afa26a840fd2253e9e0140\n\nI think this is a no brainer beat of the predicted $28B in revenue. Yet impacts to profit margins, chip shortages, and guidance changes of 2025 that are unknown mean the price action can't be accurately predicted. Invest at your own risk. I would love to hear others opinions on this upcoming earnings for NVDA and what they think could be reported.", "id": "1eneky5", "created_utc": 1723144390.0, "score": 227, "upvote_ratio": 0.9, "num_comments": 97, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 8 | **First Seen In WSB** | 10 months ago\n**Total Comments** | 458 | **Previous Best DD** | \n**Account Age** | 2 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)", "score": 1, "replies": []}, {"body": "Well the actual question is not how well their earnings will actually be, but rather will they outperform the incredible high expectations of investors?", "score": 194, "replies": [{"body": "Earnings are already baked in.  Guidance is what will kills it", "score": 38, "replies": []}, {"body": "exactly, I think most investors already price in a beat in their head. Thats where guidance and production delays can really move the stock.\n\nI do think at this current price of $105, that their forward PE ratio is fairly valued, as long as they beat, a major sell should not be the case.", "score": 28, "replies": [{"body": "when will the earnigs release be exactly (sry too lazy to look it up rn xD )?", "score": -81, "replies": [{"body": "If you just said “when earnings” then I can relate to that laziness but what you typed took more effort than just looking it up 😂", "score": 12, "replies": [{"body": "When earnings", "score": 10, "replies": [{"body": "Easiest upvote ever ", "score": 2, "replies": []}]}]}, {"body": "Aug 28th after close", "score": 14, "replies": []}]}]}]}, {"body": "Of course Nvidia will beat earnings. Jensen has on purpose set guidance such that he can beat it. Just take a look at yahoo finance to see how he has done this over and over again.", "score": 47, "replies": [{"body": "I even noticed how Zuckerberg was guided by Jensen during their discussion at siggraph.  Zuckerberg shortly afterwards had his conference call and nailed it. META had a really nice pop to the upside the next day.  I'm guessing that NVDA will similarly have a very nice pop-up after the earnings call. It's going to burn a lot of bears.", "score": 8, "replies": []}]}, {"body": "Never bet against the Leather jacket", "score": 34, "replies": [{"body": "I see a cult has started to form for Jensen. Next thing, the dude gonna buy one of those social media possibly Facebook.", "score": 3, "replies": [{"body": "Not fb but ya possibly", "score": 1, "replies": []}]}]}, {"body": "I’m praying my Aug 30 call prints ", "score": 19, "replies": [{"body": "What price?", "score": 2, "replies": [{"body": "$200", "score": 3, "replies": [{"body": "![img](emote|t5_2th52|4275)![img](emote|t5_2th52|4640)", "score": 19, "replies": []}]}]}, {"body": "When did you buy it and what strike?", "score": 1, "replies": []}]}, {"body": "Omg!..when I hear this kind of analysis. I feel like I should be buying puts on NVDA for its earnings. But my cat says I should buy calls. I don't know what to do.", "score": 56, "replies": [{"body": "what does your cat say about RDDT", "score": 17, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "I dont mind it, lets see how much it costs", "score": 1, "replies": []}]}, {"body": "do you like rollercoasters? If so RDDT it the one for you xD", "score": 0, "replies": []}]}, {"body": "why not both... \n\nBut Cats have always right", "score": 3, "replies": []}, {"body": "Both sides", "score": 2, "replies": []}, {"body": "Call the cat and put some dinner out for him/her.", "score": 2, "replies": []}, {"body": "could you link me to better analyses?", "score": 2, "replies": []}, {"body": "Just wait till your cat tells you to “zoom out”… evil little creatures", "score": 2, "replies": []}, {"body": "Buy puts and prepare your application for working at the nearest kebab shop", "score": 1, "replies": [{"body": "Then.. I should be listening to my cat.", "score": 2, "replies": []}]}]}, {"body": "mfs will beat them and that shit is gonna go sideways or sink", "score": 18, "replies": [{"body": "yeah, poor guidance or earnings beat already priced in could goes this to go flat post earnings. I do think with the 25% drop from ATH that not much room below if a beat does happen", "score": 3, "replies": []}, {"body": "Looking at you TSM", "score": 1, "replies": []}]}, {"body": "Why is this not priced in? NVDA has beaten for how many quarters?", "score": 6, "replies": [{"body": "I think it went down with the market uncertainty and drop. People took profits who are afraid of recession.", "score": 3, "replies": []}, {"body": "There was a down draft opportunity before the last earnings call for people to go long.  Because of the Trump comments about Taiwan, and Amazon AWS comments about AI monetization, it put fear into the AI trade before this earnings release season.  What's baked into the number is risk of poor earnings, but what's not baked into the stock price is a solid revenue story.  This will catch Bears and Bulls by surprise.", "score": 1, "replies": []}]}, {"body": "Brain says puts so imma buy calls", "score": 7, "replies": []}, {"body": "Forward guidance will be what matters most", "score": 6, "replies": []}, {"body": "Sooooo, this is financial advice and I should bet my life saving on 0DTE’s on the day QR’s come out?", "score": 3, "replies": []}, {"body": "Some idiot said \"not financial advice\".  Drink!", "score": 3, "replies": [{"body": "PUT YOUR HANDS UP wolf_man007!!! POLICE ARE ENROUTE! PREPARE TO BE BOOKED FOR PROVIDING ILLEGAL FINANCIAL ADVICE!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 5, "replies": []}]}, {"body": "Obviously gonna beat earnings but they have to CRUSH expectations to get the pump everyone is hoping for", "score": 3, "replies": []}, {"body": "Nice call. Especially if more bear sentiment builds on semis", "score": 4, "replies": []}, {"body": "Sooo I'm smooth brain what's the price prediction on earnings", "score": 2, "replies": [{"body": "No clue, depends on a lot of other factors. But earnings should come in strong", "score": 1, "replies": [{"body": "Got it Nvidia to null", "score": 1, "replies": []}]}]}, {"body": "If it drops ima drop 70k on leaps", "score": 2, "replies": [{"body": "I'm definitely adding to my shares everytime we go lower", "score": 2, "replies": []}]}, {"body": "Share price doesn’t reflect todays value, it reflects the future value of the company. NVDA may outperform today but will they continue to outperform?", "score": 2, "replies": []}, {"body": "I love buying at the top and holding a bag!\n\n_seriously, please go up_", "score": 2, "replies": []}, {"body": "They should beat earnings...the question will be more about the guide when they report.", "score": 2, "replies": []}, {"body": "My $120 Sept 6 calls are really hoping you’re right!", "score": 2, "replies": []}, {"body": "The moon is already priced in so don't get too wet yet", "score": 2, "replies": [{"body": "Been hearing this all year", "score": 2, "replies": []}]}, {"body": "My fear is that they might have poor guidance. Could be reduced demand, but could also be capacity ceiling.", "score": 2, "replies": [{"body": "Exactly what I think too. They'll beat for sure, but guidance will not be what the street wants to hear.", "score": 2, "replies": []}, {"body": "reduced demand? how could that be when there’s currently to much demand…", "score": 2, "replies": [{"body": "Whoever put orders - those are done. Now what else then? How much sales can you do if you don't ship product?", "score": 0, "replies": [{"body": "Guys, have you even seen the videos that NVIDIA has put on their Website - AI section regarding supply chain?\nThey're not just supplying for AI they're fully using AI in their business / procurement as well using NIM.\n\n\nI am sure if there are any delays / supply concerns NVIDIA has planned it in well advance and always is two steps ahead.\n\nLet me just share the link to this one video I saw on Nvidia's website and I was blown away.\n\n\nhttps://www.youtube.com/watch?v=a9O0JipIrb4", "score": 3, "replies": []}, {"body": "The ones who buy need to buy more…also there are many who can’t get any right now. There’s more demand than supply, but if you don’t want to believe it try getting your own or even renting a GPU on the cloud. My company was able to get a single A100 from google allocated to us. ", "score": 2, "replies": [{"body": "Ok, so lets say you order and it goes to the queue. This is still not revenue - you won't pay until delivered.\nWhen did they promise you availability if none is available now?", "score": 1, "replies": [{"body": "they are still delivering hoppers…", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Puts it is", "score": 1, "replies": []}, {"body": "Probably.", "score": 1, "replies": []}, {"body": "Based on what I’ve been seeing with earnings over the past month I’d say puts but betting against nvdia doesn’t seem to work out well for ppl.", "score": 1, "replies": []}, {"body": "Bought a couple put to hedge", "score": 1, "replies": []}, {"body": "Positions?", "score": 1, "replies": [{"body": "I have had shares for awhile, that I slowly add to on dips with plans to hold long term. But I also have a handful of Aug 30 calls that I'm playing in case there is a short term rally to earnings", "score": 5, "replies": [{"body": "Definitely playing those Aug 30 calls for the upside surprise.", "score": 1, "replies": []}]}]}, {"body": "Do your revenue calculations factor in unrealized revenue from delayed Blackwell deliveries? Assuming Nvidia isn’t paid until the chips are received by customers", "score": 1, "replies": []}, {"body": "Shut up you dingo", "score": 1, "replies": []}, {"body": "Just the post i need to see on wsb before i buy some put on Nvidia", "score": 1, "replies": []}, {"body": "Shit", "score": 1, "replies": []}, {"body": "But it is sell off season, beating earnings won’t matter.", "score": 1, "replies": []}, {"body": "NVDA's earnings don't matter, don't you get it? We know they're going to crush, but will it be by enough, will the guide higher? Honestly, this trade (short-term) has asymetrical risk. If they truly crush I see them maybe moving upwards, but probably not reaching new ATH, for now. If they don't beat \\*enough,\\* we're going to see a biblical level of slaughter. I just can't see myself holding this beyond a day out from earnings, the risk just isn't worth the possible reward in my mind.", "score": 1, "replies": []}, {"body": "For this kind of earnings play, when do y’all buy in and exp date?", "score": 1, "replies": [{"body": "if you did want to play I would recommend playing a rally up until earnings, any options through earnings will get theta and IV crushed. so either Aug 30 or Sept 6 calls with the plan to sell before earnings Aug 28", "score": 1, "replies": []}]}, {"body": "https://preview.redd.it/mmztlvat2qhd1.jpeg?width=1290&format=pjpg&auto=webp&s=157184865ee279aff0e81e635088242fdbecf380\n\nI hope so😿", "score": 1, "replies": []}, {"body": "I’m thinking they beat on earning and the stock drops, cause nothing makes sense anymore ![img](emote|t5_2th52|52627)", "score": 1, "replies": []}, {"body": "Priced in.", "score": 1, "replies": []}, {"body": "Delays can be very expensive, a small hiccup in guidance and it sends NVDA reeling.", "score": 1, "replies": [{"body": "For sure, if NVDA hadn't already dropped 25-30% from highs j wouldn't touch it with a 10ft pole. But at this price a lot of risk has been removed and a lot of upside added", "score": 10, "replies": []}]}, {"body": "Im scoopin a handful of 8/30 80P's this shit cratering", "score": 1, "replies": [{"body": "Nvidia Puts for Granny!!!", "score": 6, "replies": []}]}, {"body": "gunna be flat\n\nwatch, IC gunna be the proper play", "score": 1, "replies": []}, {"body": "I feel like you jinxed it", "score": 1, "replies": []}, {"body": "Goddamit! Was planning to get some calls. Now PUTS it is!!", "score": 0, "replies": [{"body": "Make sure you post your loss porn when they beat all expectations.", "score": 5, "replies": [{"body": "Well Well well", "score": 1, "replies": []}]}]}, {"body": "Stfu", "score": -2, "replies": []}, {"body": "Already priced in", "score": -2, "replies": []}]}
