{"title": "NVDA call risk of holding through earnings?", "selftext": "Picked up these two 11/15/24 110c on that nice dip a few weeks ago (the only time I wanted to pay the longer call prices). My general strategy is to buy mid-long and sell about half the position to cover the rest if it gains 50-100%, or exit before 30-45 DTE especially if theta goes much above ~0.15. This has treated me well with about 100% overall account gain in 6 months. I know it’s a lot of luck too. \nI think the conservative thing would be to sell one of these two calls now before earnings on Weds to cover the remaining one and capture a 20% gain. Then, I’d let that remaining one ride to capture any further upside.\nHowever, given they have a Nov expiry (and it’s NVDA, and still well below the ATH) it may be good to keep both since the expiry is almost to next earnings and it could run up quite a bit the next couple months. How would you make this decision, and with what factors?\n\nI’m generally familiar with the Greeks but not necessarily how to use them well and what levels apply to different position setups/decisions.\n( just reading my own writing now it comes off as desperate and clingy to baby’s first NVDA long calls lol. )\n", "id": "1f1t8bn", "created_utc": 1724691533.0, "score": 222, "upvote_ratio": 0.97, "num_comments": 104, "comments": [{"body": "I think with the market on a knife’s edge basically dependent on which way NVDA goes post earnings, it would probably be wise to take your win and start planning for next week.", "score": 117, "replies": [{"body": "Semi's down 2% today on NVDA earrings concerns. The IV is fucking Bananas on the front contract. Dip and reset with a bigger bag. I am rolling a Double Calendar until Tuesday/Wed to smoke the Vol Crush and Theta. Gone before receptionist opens the Conference line on wed. Wait for people to dump the shit out of the Vol leading up to this one.", "score": 9, "replies": [{"body": "What’s a double calendar?", "score": 8, "replies": [{"body": "A double calendar is when you sell a call and a put, expiring soon like 3-10 days, and then buy a call and a put at the same prices but longer expiration, like 21-30 days.\n\nThe idea is that the short legs will decline in theta (value) more quickly and you close at a profit.\n\nIf your stock stays flat, you can profit 10-15% in a week.\nThe risk is if the stock moves significantly in either direction.\n\nBenefits are no margin, and max loss is only whatever you paid for the long call and put", "score": 8, "replies": []}]}, {"body": "I was off the. Crush would be Thursday.", "score": 2, "replies": []}, {"body": "I’m in the same position - my shorts on my NVDA calendar expire this Friday (longs 9/13)\nYou think I should close before earnings?\n\nImportant note: I have 4 contracts, but I bought an extra contract on both call & put side for huge moves", "score": 1, "replies": []}]}, {"body": "YO, could have rolled up to call spread for profit lock and keep your position risk free. So I own shares and trading for 26 years. I use a Diag. Calendar to lock in thru earnings. Sold Otm call 3 weeks out for 8$,  used that call credit to buy 120 - 110 put spread 1 week expiry for protection, No risk to hold thru earnings. Learned free stuff on YouTube tackletrading.", "score": 1, "replies": []}]}, {"body": "Obligatory “good enough to screenshot, good enough to sell”", "score": 216, "replies": [{"body": "Totally agree your up 120% get the fuk out and enjoy profit. Always a bull market somewhere.", "score": 29, "replies": []}, {"body": "cramer said nvda earnings arent gonna be impressive. u betta sell", "score": 0, "replies": [{"body": "Did he blow those crazy horns machines he has when he say all those “clownish” things .. I just wondering?", "score": 7, "replies": []}, {"body": "He told a story about when he ran a hedge fund and he wanted to sway things in his direction. He would make something up like \"oh I heard the new iPhone is got issues lots of problems\" tell this to \"friend\" in a hedge fund or whatever. Sounds a little like this.", "score": 2, "replies": []}]}]}, {"body": "Nobody ever went broke booking profits...", "score": 53, "replies": [{"body": "Also IV is highest right before earnings, so it might be a really really good time to take some profits", "score": 3, "replies": []}]}, {"body": "Definitely would take profit.\n\nIf you still have FOMO.\n\nBuy like 5 shares with the profit.", "score": 42, "replies": [{"body": "The downside is bigger than the upside.", "score": 5, "replies": []}]}, {"body": "You’re making 100%. Don’t be a pig.", "score": 32, "replies": [{"body": "Oink", "score": 6, "replies": []}, {"body": "OP, would you walk past $2.7k if you found it on the sidewalk", "score": 2, "replies": [{"body": "If you saw a money tree would you cut it down? 😜 (I sold one call, kept the other)", "score": 2, "replies": [{"body": "The Options Tree can die in seconds 😅", "score": 2, "replies": [{"body": "Hey my garden", "score": 1, "replies": []}]}]}]}, {"body": "To be fair, pigs get fat, hogs get slaughtered. Lol", "score": 1, "replies": []}]}, {"body": "You already won the trade… ", "score": 22, "replies": []}, {"body": "Definitely sell, even if NVDA is green after earnings the calls will be crushed with the volatility collapse. Worst case scenario and NVDA plummets and you lose all your gains and then some.", "score": 12, "replies": [{"body": ">Definitely sell, even if NVDA is green after earnings the calls will be crushed with the volatility collapse.\n\nThis isn't true for deep ITM calls like these. There's about $1 worth of extrinsic value in these contracts so if the share price stays the same and IV goes to zero they will lose around $1 of value. Biggest risk for OP is if the share price tanks, which I personally doubt.", "score": 5, "replies": []}, {"body": "Spoken like a True genius. If they come in anywhere near estimates the price is going to F\\*ck off to South Africa. It is already happened today given the Advance decline across the broad market. I waiting for the Theta decay tomorrow. Then I am sipping beers on Wed and watching the Fireworks.", "score": 5, "replies": []}, {"body": "These are Nov calls purchased when IV was lower.  TOS shows elevated IV for this week but Nov is much lower (and won't dip as much after earnings).  If it goes to $135-150+ in Sept/Oct he'll regret selling now.  His idea of selling 1 and holding the other seems solid.  \n\nah yeah, other commentor nailed it\n\n> The drop in IV will not impact these contracts much at all.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "These options are ITM, so the extrinsic value (time + IV) is calculated as market price of option - intrinsic value. The drop in IV will not impact these contracts much at all. There are calculators on the internet where you can plug in numbers and see what happens under different scenarios but it's all pretty much guess work.", "score": 2, "replies": []}]}]}, {"body": "In the same boat with $130 9/20 expiration. My plan is to sell the day of earnings before close", "score": 9, "replies": [{"body": "They are likely going to sell into the call. Today it was down 2%. so it is already happening IMO. it take time to unload big positions", "score": 2, "replies": []}, {"body": "Everyone’s plan", "score": 1, "replies": []}]}, {"body": "The IVx is 135% on the Aug 30 Contract . It is going to Vol Crush by like 30-40% on Thursday after earnings.  Taking your contract Vol down 6-10%, losing money. Your safe bet is watching the Vol Spike on Tues/Wed. Then sell before earnings. Why take the risk when your paid already. Or, Be a crazy APE and hope it Moons to 140+ on Earnings report. If it does Moon,  Vol would have crushed before Open and you sell for less on a zero move, and loose a lot on a down one.\n\nI suspect it will be a muted move up considering the hype. I would sell and reload for cheaper. If you believe it is going up after. You will be able to get back in for less Vol risk and still be Deep in the money, if you want to be long the stock. No brainer. I am sure some brains will try and reason otherwise.", "score": 6, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "May have bought some calls, and held onto through earnings and regret it. sounds like the iv crush could roughly be 10% on top of say maybe the %40 loss the earning estimator shows a new stock price? I’ll be ok in long run but as someone else said here, no better way than to learn than under fire for me.  \n\nFrom what I can tell not something that will take you down to 0 but is something that can kick you hard when you’re down (or up)?\n\nThis was most informative comment to me also so thank you for explaining how you did!", "score": 1, "replies": []}]}]}, {"body": "I have a December expiry position. I’m holding until then", "score": 4, "replies": [{"body": "you're beyond this earing play unless it is real bad. I would still be out unless your deep OTM. The IV is to good not to take profit and reload.", "score": 2, "replies": [{"body": "Should’ve done that", "score": 1, "replies": []}]}]}, {"body": "You’re up a 119% 🙄", "score": 5, "replies": []}, {"body": "Sell and buy a higher strike out the money for less, that way you pocket profit/ risk less and buy more contracts with a higher percentage return", "score": 3, "replies": []}, {"body": "I’d wait until Wednesday afternoon to decide. You’d have two things working in your favor: Nvidia’s possible gap up on Wednesday, as well as increased IV right before the earnings helping you sell these calls at a higher premium. If you’ve held it so far, hold it until Wednesday and make a judgment call. \n\nNvidia is likely to trade at least 10% up or down after the earnings, and most signs point to up, but by Wednesday you’d be at a better profit if not the same, imo.", "score": 3, "replies": []}, {"body": "You won!! Take the money and run!", "score": 5, "replies": []}, {"body": "Take the money, the stock is already deep in the money so you aren’t going to catch any of those crazy exponential gains people hope for holding calls through an er, it will basically move with the underlying. If I was you I wouldn’t sell I would exercise but that’s personal preference and capital availability.", "score": 5, "replies": [{"body": "Good take. I think I’ll sell one for sure but may be able to exercise on the other. I generally hear never exercise options since you lose extrinsic value but that is less important for deeper ITM right? Also then you don’t have to pay tax right now with exercising. Any other exercise-advantages you’re thinking?", "score": 3, "replies": [{"body": "You nailed the main ones, deep itm have almost no extrinsic if any, nvidia might right now with the crazy iv but not worth worrying about. Only huge advantage you didn’t list is you can hold shares in perpetuity, especially if they are all cash and not bought with margin, so if er didn’t go well you’d just be holding a bag for the best stock on the market instead of having calls get crushed", "score": 2, "replies": []}]}]}, {"body": "Sell it. You're way passed the strike", "score": 5, "replies": [{"body": "Nothing wrong with being Deep ITM but the Play is IV and that doesn't matter in his position. Take the money and run.", "score": 3, "replies": []}]}, {"body": "you can always hedge and sell calls at a higher strike.", "score": 2, "replies": []}, {"body": "I am sitting on 115c and the premiums are so high that it makes no sense to roll up and take some profits.  I would sell enough to take out the premium and the play through earnings.  You can always sit on it for a few months with those longer dated options", "score": 2, "replies": []}, {"body": "I would close and recast after ER.", "score": 2, "replies": []}, {"body": "Would you like $5,000 today or would you prefer to wait two days and possibly make a little more or possibly lose all of it.\n\nSell it FFS", "score": 2, "replies": []}, {"body": "Literally up 100% lol", "score": 2, "replies": []}, {"body": "100% gain is enough. Sell half and hold half or sell all and be happy with 100% gain bearing the S&P ytd.", "score": 2, "replies": []}, {"body": "You can’t fly if you don’t jump first!", "score": 2, "replies": []}, {"body": "Get out before you get IV crushed which always happens after earnings", "score": 2, "replies": []}, {"body": "roll up. sell your 110 call and buy an atm call. you bank some cash and risk the rest on earnings", "score": 2, "replies": []}, {"body": "There's a million ways to play this. I would de risk sell both options and possibly buy some shares if you still wanted some risk. You'd still make a little more money if it goes up but lose a lot less if it goes down.", "score": 2, "replies": []}, {"body": "Suggest selling one on Wednesday before  Nvidia reports earnings and keep the other one.", "score": 2, "replies": []}, {"body": "Very low chances they go out of the money, still have a lot of duration left to them, small chance that NVDA doesn't go up significantly after earnings so I guess the risk is small. The only real \"risk\" here is whether IV crush will reduce the value of the contracts to the point where whether you sold before or after earnings it would be more or less the same, but selling before came with less risk. But I doubt it. \n\nBasically if you lose on this we're all losing, market's crashing.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "At this point you should be asking why wouldn't someone be bullish on NVDA earnings? It's been ripping all year due to AI and the only thing people are afraid of is that we've topped out. But they're selling everyone else the hardware that drives this craze and these sales don't happen overnight, so I'm guessing they're flinging chips like hot cakes and will keep doing so for months so if nothing else sales will be good.", "score": 2, "replies": [{"body": "They legit have no other competition either. AMD doesn't even come close. All these tech companies are trying to hit the next breakthrough with AI . First one who does wins.", "score": 2, "replies": []}]}]}]}, {"body": "After today, I’d sell. You could maybe see what happens tomorrow but no way I’d hold through earnings", "score": 1, "replies": []}, {"body": "You mean you bought LEAPS right?", "score": 1, "replies": []}, {"body": "Sell.", "score": 1, "replies": []}, {"body": " Rules of Acquisition  89: \"Ask not what your profits can do for you, but what you can do for your profits.\"", "score": 1, "replies": []}, {"body": "I would dump these even with positive earnings it's likely to drop first you could cash this in and buy it back if it dips", "score": 1, "replies": []}, {"body": "I didn't sell a few weeks back when I was 400% on my nvidia calls, ended up having to take a fraction of that. \n\nHow much are you looking for really?", "score": 1, "replies": []}, {"body": "I would sell. The upside isn’t worth the potential IV crush etc", "score": 1, "replies": []}, {"body": "Nice", "score": 1, "replies": []}, {"body": "You may get burned by IV crush. If you bough these awhile ago, your price is probably going to be inflated by IV before earnings (at the best value, even with price dipping a bit).\n\nOne idea: if you think NVDA is going to continue it's run, hold up until earnings and sell after a good morning/afternoon push the day of earnings. The next day, IV is going to crush and you can pick up more more November calls or whatever you want.", "score": 1, "replies": []}, {"body": "Man I’m up like 75% on Jan 105 calls and having the same dilemma lolll", "score": 1, "replies": []}, {"body": "Sell as soon as possible. That’s a nice trade, don’t mess with it.", "score": 1, "replies": []}, {"body": "I’m bullish this week. Especially after today’s results. Sold puts but imma regarded ape.", "score": 1, "replies": [{"body": "Roll", "score": 1, "replies": []}]}, {"body": "I would get out and enjoy the gains", "score": 1, "replies": []}, {"body": "Smart investing is believing in your investment will remain profitable and increasing futurewise..  Otherwise,  why would you invest to something you dont think will have given value (in return) . of your time to think about it ? \n\nNo investor has beaten the simple concept strategy of W. Buffett in comparison till tbis time.. \nPeace!Succeed!", "score": 1, "replies": []}, {"body": "Cut in half", "score": 1, "replies": []}, {"body": "Take profit roll up if you want or make a spread maybe depends how you fell", "score": 1, "replies": []}, {"body": "I would sell one before earnings and hold the other.", "score": 1, "replies": []}, {"body": "I'd either sell one or roll both to a higher strike, that way you secure profit while still having the huge gains potential", "score": 1, "replies": []}, {"body": "NVDA setup as PUT", "score": 1, "replies": []}, {"body": "NVDA has continued to beat expectations on both earnings and revenue quarter after quarter. Eventually they’re gonna miss. Expectations are very high. If that happens it will be really bad. Let’s also consider that at some point the institutions are either going to get tired of the stock or just take their profit. Institutions move on from stock that’s when it can lose 50% of its value or more.", "score": 1, "replies": []}, {"body": "I have NVDA but they only give me .10 as dividend. Im bout to sell that shit", "score": 1, "replies": []}, {"body": "Just closed my LEAP synthetic longs.", "score": 1, "replies": []}, {"body": "As a little guy (sub-$10k account), I decided the sensible thing to do was [take the 59% profit](https://imgur.com/a/Bq8JcDZ). Hard to pass up the allure of the possible earnings moon, but learning that profit is profit.", "score": 1, "replies": [{"body": "Yours was barely a week out from expiry so that is a good choice since there’d be no time to recover if earnings went badly.", "score": 3, "replies": [{"body": "Yeah, the contract was up to 80% profit at one point last week, and I had that exact thought that any draw down was likely to stay down. I had visions of grandeur of 3-digit profit percentage after earnings, but comments in this thread and others influenced me to hold the one I have now versus hoping for 2 in the bush after today", "score": 1, "replies": []}]}]}, {"body": "Sell sell sell, or lock profits and selll", "score": 1, "replies": []}, {"body": "Thanks for the insights everyone. I sold one. I am holding the other as house money in case some crazy moves happen after earnings or Sep/Oct. also am considering possibly exercising - It’d be nice to hold 100 shares to do some covered calls. I only have about 50 shares currently across a few accounts.", "score": 1, "replies": []}, {"body": "Dont do it , take the money", "score": 1, "replies": []}, {"body": "Everyone here is saying sell or roll, so inverse them and hold is probably going to be the right move.", "score": 1, "replies": []}, {"body": "Zero risk. NVDA $147 post earnings", "score": 1, "replies": [{"body": "What's your position?", "score": 1, "replies": []}]}, {"body": "Take off some and leave some", "score": 1, "replies": []}, {"body": "Ask yourself how you would feel if the trade moved against you. So would you feel worse seeing your trade move further up after you sell or loose more because you didn't sell ?\n\nThe good thing about a highly popular stock like NVDA is that you can always buy it later. I personally don't see it establishing itself passed the 130 mark any time soon.\n\nThe big cats 🐈 will pull the rug on retailer traders soon as they've done before and you'll find yourself regretting not taking any money off thr table. \n\nThe other option is to set a tight stop ✋ order and leave it to chance. This way you could potentially capture more profits should it reverse on you at some point. \n\nMay the odds ever be in your favor ✨.", "score": 1, "replies": []}, {"body": "-2x 8/30/24 call credit spread 140/150 \n      Delta: -30 Theta: 97\n\n-7x 8/30/24 put credit spread 115/110\n      Delta: 56 Theta: 104 \n\nReady to potentially dump the call spread before market close tomorrow.\nOpen to feedback or criticism lol", "score": 1, "replies": []}, {"body": "You’re already deep in the money. Do nothing.", "score": 1, "replies": []}, {"body": "Take profit and buy another call with some of your profit if you’re confident. Obviously account for what you’ll have to pay in taxes when tax season comes", "score": 1, "replies": []}, {"body": "Research what iv crush is and decide if you want to take on that risk profile as well as decide a strategy. Each person dictates the risk we take and there's always a winning play", "score": 1, "replies": []}, {"body": "I hope he sold….", "score": 1, "replies": [{"body": "I hope he didn't", "score": 1, "replies": []}]}, {"body": "Wait until Thursday", "score": 1, "replies": []}, {"body": "\"I'm generally familiar with Greeks\" ... No, no you're not", "score": 0, "replies": [{"body": "U mad bro?", "score": 1, "replies": []}]}]}
