{"title": "5 ways to lose your money", "selftext": "# \n\nhttps://preview.redd.it/9nwl3te8m6v41.png?width=1420&format=png&auto=webp&s=b216f230800c49aa1a34b4b622e3d131efd516f3\n\n# 96K -> 41K - Mostly $BA / $SPY / $LK\n\n&#x200B;\n\nLet's begin this conversation to say that I've lost a bit  of my money so far. This is not to throw a pity party, but I find that giving some insight into my losses may help someone else not lose theirs. These will probably be repetitive to most, but i'm hoping to help one retard out of making the bad decisions I've made.\n\n&#x200B;\n\n1. **Over Trading.**  Sure, a lot of you think \"OH I GOT 25K IM GOING TO MaKe So MUcH BaNk!\" this is absolutely not true without a good foundation. I used to think PDT rules were bullshit, until I injected 100k into my TD account and started trying to pick every stock I could think of and play the waves.*Tip: Focus on a few and master the charts.*\n2. **Wealth TRULY does go from the impatient to the patient.**  A lot of money was in the right idea, but in the wrong execution. Once you understand basic TA on charts, you can make a more educated guess on where the stock may head, but you have to wait for it to play out. I sometimes I sell my  trade within 10-15 minutes only to find 20 minutes later it starts to work in my favor. Not to say it works every time, but it's like the ability to count cards in blackjack. You won't win every time, but you have a better hand than the guy next to you.  *Tip: Lower your position size to keep your emotions in check.*\n3. **Understanding the underlying assets for ETFs, and what decay means.**  This is mainly for $USO retards. Don't trade what you don't know. A lot of people see $USO and go OH THAT STOCK is way down and I should invest before it goes back to $10 again!*Tip: Learn about decaying etfs, what the underlying assets are, and what they consist of. Also, stay away from $USO*\n4. **Learn your trading style.**   This is huge because I think most people who are fairly new to investing don't understand their style yet. Are you a day trader? Swing Trader? Long Term Trader? not knowing your style will make you create bad positions. I took positions for a longer term trade and traded them in a short span. Buying leaps then selling them 2 weeks later.*Tip: Understanding your style, and trading based on the style that makes you comfortable.*\n5. **It's good to have guidance and learn from other people, but make sure you do your own homework.**  I lost 10k in about 5 minutes because I saw some fucknut on twitter say \"OH $BA TO THE MOoOnn!\" - played a large position in a short frame. Lost it without recovery.*Tip: You have to do your own homework, in order to get that bread.*\n\nThere are people that do stocks and get extremely lucky ignoring these types of rules. You may be one of them, and good for you. But I hope some of these help someone out there, because in the end - my losses may help some of your gains.\n\nTL;DR - Make your tendies.", "id": "g8gd9b", "created_utc": 1587915368.0, "score": 94, "upvote_ratio": 0.9, "num_comments": 59, "comments": [{"body": "*6. PDT rule IS bullshit.  And your own 100k example exactly proves why it doesn't work.  Then again, this was never PDT's true intention anyway.", "score": 24, "replies": [{"body": "What is PDT true intention?", "score": 11, "replies": [{"body": "To push you into losing money by enforcing bad trading habits, courtesy of the establishment.\n\n* Hold a trade overnight to avoid a PDT count?  You get fucked by a gap down.\n\n* Limited to 3 daytrades a week?  Now you have to consider whether X or Y trade will make enough returns to be worth 1 of your 3 trades, instead of just taking profit on both.\n\n* Trade going against you and you want to cut losses early because you were wrong?  Now you're considering holding until it really blows up in your face because otherwise, you'd have to waste a day trade just to not lose money.\n\n* Try to switch to a cash account to get around PDT?  Enjoy being fucked even worse with 2-day stock trade settlements.  Yes, options settle faster, but they generally have higher bid-ask spreads, which also restrict what you can trade on.  (And for RH users, they're not allowed to do options on cash accounts either.)\n\nPDT's so bad, I had to move to a cash account, just to try and break all these bad habits.\n\ntl'dr The establishment knows PDT hurts you and loves it when you lose money to it.  Makes you easier to control.  That's why there's no PDT laws against casinos, lotteries, sports betting, etc., even though you can easily lose all your money there too.  Because they know that the stock market is the real ticket out of whatever situation you're in.", "score": 35, "replies": [{"body": "I too had to take one of my accounts and turn it into a cash account because it was in PDT jail. I tried trading future options with it because of no PDT, but they are so expensive that, because of the account size, I would continuously puke the trade up too early. Going to cash allows me to trade SPY instead, which is a much gentler and kinder trade and I don't puke up my trades anymore.", "score": 4, "replies": []}, {"body": "This is literally me every day. If I somehow get to 25k I probably wont cash out just so I can avoid PDT. I leave a fuckton of money on the table every week working around PDT.", "score": 2, "replies": []}, {"body": "Was it worth going to the cash account? There's no going back once you do it, right?", "score": 2, "replies": [{"body": "Although I do miss the short-selling and spread leverage, being able to move in and out of any trade at any time is imo, still the least restricting alternative to get around PDT.  So breaking those bad habits from PDT would be a godsend.\n\nWith TDA, I can open separate accounts and freely move money back and forth between my margin and cash account.  They generally finish those transfers within the same day too.  Best part is I can still save a tiny amount of money in my margin account for micro e-mini futures or small credit/debit spreads.  So far, I'd say it's worth it.\n\nIf you're talking about RH, you'll have to e-mail them to see if it's possible for you to open a separate cash account to transfer to and from, instead of their converting crap.", "score": 1, "replies": []}]}]}, {"body": "I am also interested to hear from people who were in the smoky room with the SEC insiders in 2001.", "score": 5, "replies": []}, {"body": "It’s to help financial institutions these are all cucks", "score": 1, "replies": []}]}, {"body": "I would disagree with this sentiment. I use photography as an analogy... you can now take 50000000 photos a second and maybe get 1 good photo, but when you have film with a set number of photos say, 24 ... you have to stop and think about your photo before you shoot.", "score": 0, "replies": [{"body": "Except 50,000,000 photos make it much more likely to capture at least several good photos because you can find the exact one you want, even while the scene is happening in real time.\n\nBut with only a limited amount of film, you're much more likely to be stuck with inaccurate and bad photos because you did not capture those few instances where it would be good.  And while you were stuck deciding whether to risk your chances now or later, you just missed that opportunity.\n\nBut go ahead and tell everyone that a few photos work so much better than an actual recording camera, whether for evidence or otherwise.", "score": 2, "replies": [{"body": "You don’t understNd the analogy. Why do you think smart money uses homework to understand the value of an asset? You think hedge funds just blindly invest in every stock they can to hope it sticks???", "score": 0, "replies": [{"body": "Why else would you not want PDT then, \"smart money\", if you're so sure of yourself?  Hmm?\n\nUsing your logic, even smart money would benefit from PDT.", "score": 1, "replies": [{"body": "People who only have less than 25k - I can mostly assure you can’t afford to lose 25k. Lol it’s meant for protection. But we all have our opinions!!", "score": 0, "replies": [{"body": "The country can't afford to continuously bail out \"smart money\" whenever they lose way more than 25k either.  Sounds like you really use some PDT \"protection\" then, \"smart money\"!", "score": 2, "replies": [{"body": "Do you even understand what PDT is? Lollllll", "score": -1, "replies": [{"body": "I could ask you the same thing.  Because since it's so \"good\" to you, why not just have it enforced on yourself and everyone else, even the rich?", "score": 1, "replies": [{"body": "That’s exactly what I said in my first point. Go back and read. I over traded , which is why im losing money", "score": 0, "replies": [{"body": "No, you lost money because you chose to NOT utilize your unlimited day trades by cutting your fucking losses the instant they hit 4 fucking digits.  You said so yourself: You lost $10,000 in 5 minutes on BA because of POSITION SIZING, NOT overtrading.\n\nPDT wouldn't save your dumb ass then.  Because under PDT, you'd be pushed into going all-in just to make your 3 daytrades for the week actually count.  And under PDT, you'd be pushed into holding this way past -$10k, fearing a 3-month ban if you don't.  Both of which would've been worse than what you did, when you were NOT under PDT.\n\nYou don't understand a goddamn thing about PDT unless you've been crippled by it like the rest of us have.  You think you do?  Try it with <$20,000 in a margin account.  And keep withdrawing to keep it under that amount, if you actually do make profits.  See how well that works out for you.  Walk the fucking walk.", "score": 1, "replies": [{"body": "Bro you need a hug, and a math lesson. 10k does not equal a 50k loss. \n\nSpend some times with friends and family. Find a support group for your hate.", "score": 0, "replies": [{"body": "\"Bro\", you sucking at trading is completely your own fault, since you didn't have the PDT handicap.\n\nYou really think PDT would help you, trade under PDT yourself just like the way I said and see how much you really love it.", "score": 1, "replies": [{"body": "Enjoy staying sub 25k your whole life.", "score": 0, "replies": [{"body": "Don't wanna walk the walk, huh?  Don't worry, at the rate you're going, you'll be sub 25k yourself in no time.\n\nEnjoy your losses and the PDT you love so much, retard.", "score": 1, "replies": [{"body": "I lost 50k and I can still confidently say you’re a loser. Lmao", "score": 0, "replies": [{"body": "A **loser** would be someone who **loses 50k**, then hates on others for his own fuck ups.  Keep on hating, loser.", "score": 1, "replies": [{"body": "So sad man. Try some positivity in your life. No one is hating here. I was giving some advice on how I lost my money. If it doesn’t apply to you, then move on.", "score": 0, "replies": [{"body": "> I was giving some advice on how I lost my money. If it doesn’t apply to you, then move on.\n\nYou mean like how PDT doesn't apply to you, yet you think you're somehow experienced enough to \"give advice\" on something you've never actually experienced yourself?  Try again.", "score": 1, "replies": [{"body": "Where the fuck do you think I started retard. Do you think I just magically popped 100k out of my ass?", "score": 0, "replies": [{"body": "> Do you think I just magically popped 100k out of my ass?\n\nAnd I quote:\n\n> I injected 100k into my TD account\n\nSo yeah, basically you did.  Your argument is invalid.\n\nNice \"positivity\" you're preaching, retard.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": ">**Wealth TRULY does go from the impatient to the patient.**\n\nTell this to all the dIaMoNd HaNdS people who lost 90%+ of their account.", "score": 19, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "True, but anyone who bought puts any time the market was in the 220-260 range are feeling pretty screwed right about now even if they had May expiry, and that's not exactly short expiry if they were bought within the last couple months.", "score": 2, "replies": []}]}, {"body": "Personally I think too many people shorted the market and if all came through fruition, there would have been no liquidity, here comes in jpow to prevent the almost uncontrollable. Who knows what they will do again but they will obviously do everything it takes. Trump make it rain.", "score": 1, "replies": []}, {"body": "Nothing is 100%. People who have diamond hands though have a much better win percentage than those who don't. There are a lot of factors here, including position size, time to expiry, not having any hedges, no stop losses etc.", "score": -1, "replies": [{"body": "that saying was about long term appreciating assets, i dont think Warren buffett was talking about waiting 20 minutes longer to buy/sell ur speculative financial derivate's because TA says so. \n\nAnd the idea u have an edge over the market (like counting cards gives u an edge over the house) simply because ur patient and follow basic TA is laughable.", "score": 4, "replies": [{"body": "Macro or micro you can still use the principle. The point is, where I failed was having the balls to hold through some downswings. Even in the short term.\n\nThe shorter the expiry, the more it can swing either direction.", "score": 1, "replies": [{"body": "Yes that is hindsight bias, it could have gone down even more right after u sold it just as easily and u wouldnt have mentionted it.", "score": 1, "replies": [{"body": "Yes, nothing is fool proof.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Would you say one should focus on looking for call and put opportunities or specialize in one or the other.", "score": 7, "replies": [{"body": "That depends on your style. But the elite are flexible, the profitable are one sided. The losers are neither.", "score": 9, "replies": [{"body": "This is a fantastic saying funny and so true.", "score": 2, "replies": []}]}]}, {"body": "Bad trader tries giving advice. I pass", "score": 5, "replies": [{"body": "What happened to this sub?", "score": 0, "replies": []}]}, {"body": "No. 2 is crucial. I could have made little bit extra or lost less on nearly all of my trades when I started out if I only waited a few more minutes.", "score": 3, "replies": []}, {"body": "Fuck you, Shoresy!", "score": 3, "replies": [{"body": "Fuck yer entire fuckin life ya piece of shit!", "score": 3, "replies": []}]}, {"body": "Me:\n\n4k -> 14k (Wow! I'm good at this! WTF are greeks? Don't care)\n\nPlays 10,5k into maximum IV options expiring same month\n\n14k ->3,5k\n\nOk... let's not fuck this up again\n\n3,5k -> 4k (holding over the weekend)\n\nTo be continued...", "score": 3, "replies": []}, {"body": "God you gotta be stupid to lose 10k because one shill on twitter said a stock is going to the moon.", "score": 2, "replies": [{"body": "That’s why this is a loss.", "score": 0, "replies": []}]}, {"body": "So you giving out advice when you lost 50k, fuck off.", "score": 1, "replies": [{"body": "I posted my failures to learn from them retard", "score": 6, "replies": [{"body": "calling me a retard when your down 50k and claim you have some sort of knowledge on how to make money. you are the retard", "score": 2, "replies": [{"body": "He really isn't claiming he knows everything or teaching a class on how to make big bucks.. Seems like he's giving some pointers from his losses.", "score": 4, "replies": []}, {"body": "Oh you can't read either. Your parents must be proud.", "score": 3, "replies": []}]}]}]}, {"body": "Holy crap man, this is my experience to a T. The biggest thing that got me was being bullish on a stock, but selling my long dated calls early. My impatience would lose my good gains, and make me take loses that would have been gains had I just waited a bit longer.\n\nWhen you get options, you are VERY likely to see red at several points, but if you were right it should go green eventually. The biggest issue is getting cold feet super early and getting out. That's also a great point about downsizing your positions. If you're yeeting 1/5th of your account into a call, then freaking out when it shows -20%, then jumping out only for the stock to soar towards your strike in a few days, you got both ends of the dildo (selling for a loss AND missing out on profit). If your position was a much more modest 5% of your portfolio, you'll feel a lot less emotion towards that -20%., because it would only represent 1% of your portfolio. Nobody cares if their account shows 1% down on the day.", "score": 1, "replies": [{"body": "The worst thing we can do is not learn from our mistakes.", "score": 1, "replies": []}]}, {"body": "I had been arguing for years that USO has no right calling itself an “ETF”. That thing is a piece of shit ETN. You can’t base your price of a “fund” on futures contracts of a commodity and call it an ETF. If the commodity doesn’t have a spot price (like gold does), then it can’t be called an ETF (with a serious face).", "score": 1, "replies": []}, {"body": "Come back after you've recovered using your own advice", "score": 1, "replies": [{"body": "Yeah for sure! Slowly but surely.", "score": 1, "replies": []}]}, {"body": "Thanks for the post", "score": 1, "replies": []}]}
{"title": "Airbus CEO Warns Workers It’s Bleeding Cash and Cuts Are Needed. Boeing jobs cuts this week.", "selftext": "[deleted]", "id": "g8i4pm", "created_utc": 1587921156.0, "score": 245, "upvote_ratio": 0.97, "num_comments": 57, "comments": [{"body": "BULLISH!!!!!", "score": 107, "replies": [{"body": "[deleted]", "score": 28, "replies": [{"body": "Brace yourself: Bailout is coming", "score": 5, "replies": []}]}, {"body": "Priced in obviously. But yeah SUPER BULLISH!!", "score": 6, "replies": []}]}, {"body": "I have calls so this is great news for me", "score": 79, "replies": [{"body": "Worked for Starbucks and Uber", "score": 9, "replies": []}, {"body": "6/19 300c here", "score": 3, "replies": []}, {"body": "EADSY $20c 5/31", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 164, "replies": [{"body": "100% accurate", "score": 51, "replies": [{"body": "When is it ok to get angry about executives doing executive things and then firing blue collar workers to save their asses?", "score": 34, "replies": [{"body": "[removed]", "score": 28, "replies": [{"body": "What in all seriousness can blue collar working people do?", "score": 14, "replies": [{"body": "Unions used to work. Or vote.", "score": 26, "replies": []}, {"body": "Vote for candidates who have their class interest in mind and scrub their brain hard to forget trickle down.", "score": 14, "replies": [{"body": "Hard to do when both parties fuck over blue collar workers (in the usa at least)", "score": 0, "replies": [{"body": "I agree dood. Both parties tend to fuk the workers when it comes to where the money goes.", "score": 2, "replies": []}, {"body": "I agree, we/they had a shot with Bernie...But old libs have MSNBC brain so they chose creepy Joe.", "score": 0, "replies": []}]}]}, {"body": "Unionize.", "score": 3, "replies": []}]}, {"body": "What kinda power do you think blue collar workers have to change anything about this system great job victim blaming autist", "score": 0, "replies": [{"body": "They can go on strike. I don’t know about you, but how many people do you think can build an aircraft", "score": -2, "replies": [{"body": "So you place fault on the machinist building planes for Boeing’s wrongdoings not the board members actually making these decisions.", "score": 0, "replies": [{"body": "No, but you asked what the workers can do about it. And I said they can go on strike", "score": 3, "replies": [{"body": "Going on strike in the SPEEA Union is not as easy of a thing as it sounds.", "score": 2, "replies": [{"body": "Yeah, to be honest, I have absolutely no idea whatsoever about aircraft manufacturing and unions.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "When you are not the executive.", "score": 1, "replies": []}, {"body": "Never dude. You don’t stare at graphs of blue collar worker happiness.", "score": 1, "replies": []}]}]}, {"body": "Lol if any corporation had a rainy day fund large enough to support something like this they wouldn’t be a good business", "score": 2, "replies": [{"body": "I'm quite sure, Apple has ridiculous USD reserves that could qualify for this purpose", "score": 4, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I understand, it’s just hard to pinpoint where the “fail” come in here imo. An executives salary isn’t causing the companies to require a bailout or fire regular workers, unforeseen circumstances cause it. You can’t really blame any company for what’s going on right now and how they’re being affected. But then again some companies do take advantage of the payouts, so it’s a tough line to draw.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "There’s no point in firing an executive, especially someone who’s objectively good at their job, just because of a situation like this. Your argument seems to be that those executives should make less, which I agree with especially if it helps pay other workers better, but that isn’t really what the initial point was about.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Europe can't afford to lose the only BA competitor. Air travel industry can't afford to lose Airbus while BA planes are having issues.\n\nSo fucking bullish it hurts my butt.", "score": 23, "replies": [{"body": "The world can't afford to lose the only BA competitor. But that doesn't mean equity investors should be bailed out.", "score": 7, "replies": []}]}, {"body": "[deleted]", "score": 21, "replies": [{"body": "yeah but look at the discount rate and all, i expect a drop then a face ripping rally. Gonna try to make some good deals there, but 100 or so shares and then sell put premium when its crashin\n\nthen calls", "score": 3, "replies": [{"body": "Whats the timing?  I think AA/Delta have to go up as travel opens.", "score": 2, "replies": [{"body": "depends on how we go through this week, might buy some shares around noon tomorrow or I might wait till earnings.", "score": 1, "replies": [{"body": "No puts tomorrow? You think er is priced in?", "score": 1, "replies": [{"body": "i MIGHT do one but im sure the premium is fucked up\n\nedit: I dont want to time a top or a bottom exactly also, and id rather buy in if afterhours gets railed (which it might or might not)", "score": 1, "replies": []}]}, {"body": "Why not sell a put if you're planning to get the shares anyway.   Might as well get some premium out of it unless you know when is the bottom.", "score": 1, "replies": [{"body": "thats actually exactly my plan: \nlooking to buy shares, collect premium as I sell puts on strength/extension, then use premiums to buy some calls too.\n\nDepends on how we open and all but I'm actually hoping for a gap down so put holders on our sub can print AND i can follow through with my plan.", "score": 1, "replies": []}]}]}, {"body": "If you want to play it safe, just buy in intervals, buy a few shares next time it drops 5%. Personally think options are too hard to predict for Boeing, just cuz of the random spikes when big banks are buying in bulk.", "score": 1, "replies": []}]}, {"body": "That's where you see how much the US market is pumped\n\nAirbus has been trading on it's lows for the last month, it's now revisiting the lows around 50\n\nBoeing jumped 60% like a madman and is yet to revisit the 90-100 area", "score": 1, "replies": []}]}, {"body": "Yep my RTX calls are ruined", "score": 1, "replies": [{"body": "I would not be so sure.", "score": 1, "replies": [{"body": "Earnings tomorrow, hope they announce crazy high dividends.  Their policy isn't known since the merger.", "score": 1, "replies": []}]}]}]}, {"body": "Less employees means less expensive.\n\nBullish", "score": 12, "replies": []}, {"body": "dont worry\nJPows right here", "score": 7, "replies": []}, {"body": "Boeing 400 ENd of Month!!!!!!", "score": 5, "replies": []}, {"body": "PrICed iN", "score": 5, "replies": [{"body": "Logic says puts. But jpow says calls.\nSo calls.", "score": 1, "replies": []}]}, {"body": "Can these fuckers tank already so I can buy some cheap shares", "score": 3, "replies": []}, {"body": "Good luck laying ppl off in France...", "score": 2, "replies": []}, {"body": "Fuck Airbus... and your shit helicopters too", "score": 3, "replies": []}, {"body": "Friday priced it in already, which means these news will bring green Monday.", "score": 1, "replies": [{"body": "Facts", "score": 2, "replies": []}]}, {"body": "Lower operating costs. To the MOOOOON 🌝", "score": 1, "replies": []}]}
{"title": "Researchers can confirm autism if you own these stocks", "selftext": "1) DKNG\n\n2) MESO\n\n3) GE\n\n4) BA\n\n5) USO\n\n6) AAL\n\n7) DAL\n\n8) INO\n\n9) NEX\n\n10) F\n\nSource:  [https://robintrack.net/popularity\\_changes?hoursAgo=72](https://robintrack.net/popularity_changes?hoursAgo=72)\n\nTDLR: if you own at least 1 of the 10, you're mildly autistic. If you own at least 5 of the 10, you're off the autism spectrum...on the wrong side. ", "id": "g8na2m", "created_utc": 1587937827.0, "score": 52, "upvote_ratio": 0.84, "num_comments": 66, "comments": [{"body": "BA to the moon", "score": 38, "replies": [{"body": "After chapter 11 lmao", "score": 4, "replies": []}]}, {"body": "What if I own U?", "score": 15, "replies": [{"body": "You called, master?", "score": 17, "replies": [{"body": "*massa*", "score": 6, "replies": []}]}]}, {"body": "Agree....\n\nExcept shut your whorish mouth about GE. One of the oldest companies in existence. One of the original listees on the market.\n\nGE is the life blood of this country.", "score": 22, "replies": [{"body": "I own ge, but I sell after 5-10 cents up, which is almost daily.", "score": 10, "replies": []}, {"body": "Dinosaurs were old too and look what happened. Don't worry, I'm sure GE will survive...after they wipe out the shareholders", "score": 6, "replies": []}, {"body": "Pennsylvania Railroad paid out a dividend for over 100 years. Look for it now.", "score": 4, "replies": [{"body": "It’s right there, I just gotta roll a 6 to land on it.", "score": 1, "replies": []}]}, {"body": "The Oregon pension fund just bought a bunch of GE stock so someone else agrees with you.", "score": 3, "replies": []}, {"body": "All good things must end", "score": 1, "replies": []}, {"body": "US Steel was in the Dow for 100 years too, but now it ain't worth a shit.", "score": 1, "replies": []}]}, {"body": "USO should really be #1", "score": 10, "replies": [{"body": "It's still #1 on the weekly change chart. So you got something right. RH holders increased from 62k users all the way to 196k users.", "score": 4, "replies": []}]}, {"body": "Got calls on DKNG. What's that make me?", "score": 10, "replies": [{"body": "Smart.", "score": 13, "replies": []}, {"body": "Yea when I’m not losing money on the market I’m handing money to Draftkings. Or at least I was when we had sports", "score": 4, "replies": []}]}, {"body": "I need to look in the mirror", "score": 9, "replies": [{"body": "[me too](https://images.app.goo.gl/Efymh2azVTymtcN57)", "score": 2, "replies": []}]}, {"body": "DKNG is the next SPCE. Fully jacked riding short term calls for the next week, gonna end up in a mansion or a shelter", "score": 9, "replies": []}, {"body": "Looks like a high quality diverse portfolio. Literally can’t go tits up.", "score": 9, "replies": []}, {"body": "MESO makes me cum", "score": 8, "replies": []}, {"body": "Own 3 but sold my 4th (INO) for a nice profit.  Bought it at 5.12 and sold for a bit short of 15 in early March.", "score": 4, "replies": [{"body": "That would make you a confirmed autist. Congratulations!", "score": 3, "replies": []}]}, {"body": "I placed an order today for a decent stake in DAL. Mid to LT hold. Should I cancel it?", "score": 4, "replies": [{"body": "Don't doubt your vibe ..", "score": 1, "replies": []}, {"body": "In Fed we trust. It'll go either down or up...nobody knows.", "score": -1, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "F for F call hodlers...", "score": 3, "replies": []}]}, {"body": "I own shares of AAL and DAL with intent to make money over 1-5 years. Have a leap on USO, but was only $70 when I bought. USO is straight stupid but why are the airlines bad with a long term outlook?", "score": 3, "replies": [{"body": "Possibly because they might still file for bankruptcy? I dont know...but I bought DAL too...", "score": 1, "replies": [{"body": "I doubt it. DAL is fine, but sure AAL carries some risk.", "score": 2, "replies": []}]}]}, {"body": "Phew... Only own 4 of them", "score": 3, "replies": []}, {"body": "BA is going tits up. Calls all day.", "score": 3, "replies": [{"body": "Good luck 🍀", "score": 2, "replies": []}]}, {"body": "Dkng makes sense, it was just listed", "score": 3, "replies": []}, {"body": "I own zero of them, I like RTX, DOW, and CARR", "score": 2, "replies": [{"body": "Look at this smarty pants over here", "score": 2, "replies": [{"body": "now that you've said that they'll all crater, thanks obama", "score": 1, "replies": []}]}]}, {"body": "No one here owns stocks retard. It’s all in options.", "score": 2, "replies": []}, {"body": "AAL to sell calls against", "score": 2, "replies": []}, {"body": "How come every stock I pick ends up on a shit list? I don’t get it I’m pissed it happens every time I lose so much money fuck ‘Mercia", "score": 2, "replies": []}, {"body": "US stock please. \n\nEven I want to exercise my autism, i don't know how to get on the train.\n*****\n\n\n*[wut?](https://www.reddit.com/r/WutbotPosts/)* | *[source](https://reddit.com/r/wallstreetbets/comments/caiaas/camsing_hong_kong_down_80_after_chairman_arrested/etarcsz/)*", "score": 2, "replies": []}, {"body": "Got puts on MESO after the pump. 12 person study, compassionate use selection bias, it's a stem cell therapy for pediatric GVHD (rare disease), etc.", "score": 2, "replies": []}, {"body": "Oh shit , I got some GE.", "score": 2, "replies": [{"body": "We got em!", "score": 1, "replies": []}]}, {"body": "So... I’m safe with JNUG? Thank god.", "score": 2, "replies": []}, {"body": "I own puts on aal, do I have autism?", "score": 2, "replies": [{"body": "I have calls. Earnings will be a coin flip. Market knows it’s bad but will it be worse or better than expected. I’m going to sell half before market ends today.", "score": 1, "replies": []}]}, {"body": "How could you say INO?", "score": 3, "replies": [{"body": "INO nothing?", "score": 2, "replies": []}]}, {"body": "If I only hold 3 can I still claim Disability?", "score": 1, "replies": [{"body": "Yes, thank you for your service.", "score": 3, "replies": []}]}, {"body": "Where’s DPZ", "score": 1, "replies": [{"body": "DPZ not autistic enough. Most RH users can't afford $350+/sh so they spend money on the \"good deals\" that are cheaper.", "score": 2, "replies": []}]}, {"body": "Hahahaha just read this. \n\nhttps://www.barrons.com/articles/oregons-pension-bet-big-on-tesla-and-ge-stocks-what-it-sold-retirement-51587651610\n\nGe is picking up", "score": 1, "replies": []}, {"body": "DKNG next meme stock I’m 1/10 tistic", "score": 1, "replies": []}, {"body": "Weird I have autism but I have zero interest in any of these especially USO.", "score": 1, "replies": []}, {"body": "what about my LK calls?", "score": 1, "replies": []}, {"body": "Hahahaha..LK.", "score": 1, "replies": []}, {"body": "i own all of those my wealth manager is a smart guy. also got gild amazon and bunch of others ba kinda fucked me tho", "score": 1, "replies": []}, {"body": "MESO mooned last week.", "score": 1, "replies": []}, {"body": "DAL went down like 75% back around 2008 financial crisis. This is corona which is way worse for air travel.\n\n&#x200B;\n\nI am hoping to grab it under $10.\n\n&#x200B;\n\nAnd stay away from AAL. That airline is going to go BK/merge with another airline.", "score": 1, "replies": []}, {"body": "The only shares I own are LK -- WRINKLE BRAIN CREW UNITE!!", "score": 1, "replies": []}, {"body": "LOL.", "score": 1, "replies": []}, {"body": "In INO we trust", "score": 1, "replies": []}]}
