{"title": "Softbank to WeWork: Plz Stop", "selftext": "[article](https://finance.yahoo.com/news/softbank-urges-wework-shelve-ipo-221255644.html)\n\nSoftbank is finally realizing they can't invest in any shit company and take them public for massive profits anymore..\n\nRecession confirmed", "id": "d1ybi1", "created_utc": 1568068333.0, "score": 135, "upvote_ratio": 0.95, "num_comments": 81, "comments": [{"body": "SoftBank Vision Fund is just a massive money laundry scheme for massive quantities of dirty money from the Saudis and other bad peeps, change my mind.", "score": 122, "replies": [{"body": "Probably, they invest in everything", "score": 25, "replies": [{"body": ">article\n\nIts like an index fund for rich people", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 18, "replies": [{"body": "Rothschilds are lizard people, change my mind 🦎 🦎 🦎", "score": 8, "replies": []}, {"body": "Why would we, you are correct.", "score": 12, "replies": []}]}, {"body": "Why would Saudis have dirty money? Selling oil is not an illegal activity.", "score": 17, "replies": [{"body": "No but they can take in dirty money from other bad players and chalk that up to oil profits", "score": 13, "replies": [{"body": "They have no need to \"take in dirty money\". They have oil money.", "score": 1, "replies": [{"body": "They can have both money", "score": 10, "replies": []}]}]}, {"body": "When your country doesn't have an independent judiciary, you don't have to worry about things being illegal.\n\nYou have to worry if they're profitable.\n\nOne of the problems with corruption is that there's no limit to human greed, there's only a limit to how much political change can happen within the next 5 years. Revolt's entirely possible, so is a coup, terrorism, sanctions, criminal prosecution, someone declaring war, etc.\n\nOil will run out in 2045. Without oil, the Saudi economy will die.", "score": 8, "replies": []}, {"body": "Oil RIG\nOil PUMP\nFault TRAP\nHorizontal DRILLING\nINJECTION well\nDOWNSTREAM", "score": 1, "replies": []}, {"body": "They stole ARAMCO from the USA and refuse to take it public", "score": 0, "replies": []}]}, {"body": "How does that scheme work?", "score": 2, "replies": [{"body": "Lots of overbilled design and construction costs paid to shell companies like the dozens that Neumann already owns. Not to mention that when money is being converted from one national currency to another there are lots of ways that dirty money can be laundered", "score": 6, "replies": [{"body": "WeWork uses a host of companies to arbitrage the concept of LLC, no? I.e. they have an SPV for each long term lease and if that lease goes tits up they just bankrupt the LLC and move on. The reason why landlords do not require collateral from the parent is because WeWork is so big they can bully landlords.", "score": 7, "replies": [{"body": "Well, that and these two other things:\n\nEveryone that owns serious commercial real estate is lying on their taxes so that they don't have to pay actual tax rates on federal income and local property taxes. Most people change the depreciation/repair costs up 10x.\n\nBecause everyone's lying, no one needs to rent out their space, as the government is essentially paying them to keep it empty, at least until some ridiculously wealthy person decides to rent it out.\n\nRemember, the IRS has 12,000 agents for the entire country. And after 7 years, they ALWAYS settle for around 10% of back taxes.", "score": 2, "replies": []}, {"body": "Yeah see now you’re picking up what I’m puttin down", "score": 1, "replies": [{"body": "Well such SPVs are not illegal, and per se not money laundering schemes. Though morally dubious to some. Elisabeth Warren complains about such schemes.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "WeWork works primarily in real estate, which is one of the easiest industries to fabricate expenses around things like construction and design. Totally makes sense", "score": 16, "replies": []}, {"body": "LOL via wire... You think the Saudi government just phones up SWIFT and arranges some USD to send to Japan?", "score": 10, "replies": [{"body": "Zelle", "score": 4, "replies": []}, {"body": "yea", "score": 1, "replies": []}]}]}, {"body": "Facts.", "score": 1, "replies": [{"body": "No not really", "score": 1, "replies": [{"body": "Also true. They're really just poor investors.", "score": 1, "replies": []}]}]}]}, {"body": "If soft bank doesn't think you should ipo you're very shit", "score": 64, "replies": [{"body": "Imagine what would tough bank say?", "score": 41, "replies": [{"body": "A kick up the arse and demand a 60Bil valuation.", "score": 6, "replies": []}]}, {"body": "Softbank gets to exit first and joined in the last raise at $47 billion. If their IPO where they get to exit is at $20 billion then they clearly don't want that IPO.", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 26, "replies": [{"body": "The CEO ALWAYS get his cash.\n\nBtw your flair is the greatest", "score": 33, "replies": [{"body": "Your flair is kinda lame, honestably.", "score": 16, "replies": [{"body": "/u/fonzy541\n\nNot sure who originally flaired /u/blaked_baller but congratulations, you get to choose a new flair for him.\n\nBonus points if you make it extra gay.", "score": 10, "replies": [{"body": "\"Sucks SoftBanks SoftDick\" \n\nAlliteration for extra gay.", "score": 15, "replies": []}, {"body": "someone change it, idk how I got this one", "score": 4, "replies": [{"body": "Be grateful. It’s better than not having flair.", "score": 4, "replies": []}]}, {"body": "\"Blue Autist\"", "score": 4, "replies": []}, {"body": "I propose \"That boy ain't right\"", "score": 1, "replies": []}]}]}]}, {"body": "LOL, Victoria (Taylor) got off that fuckin' train at just the right time...\n\nWent to work for LinkedIn on August 12. I guess after getting fired from Reddit by Alexis, and spending 4 years at WeWork watching them burn stacks of cash, she saw the writing on the wall.", "score": 1, "replies": []}]}, {"body": "WeWork doesn't even own the most important part of the entire business (the actual real estate). The CEO and his buddies own the real estate. WeWork just leases the property long term and sells shorter term higher rate leases and tries to take the cut in between. I say tries because they have only lost money. Literally any REIT is a better investment", "score": 23, "replies": []}, {"body": "That’s what happens when you invest in a Vision Fund created by squinters", "score": 154, "replies": [{"body": "This is amazing", "score": 35, "replies": []}, {"body": "As an asian, fuck you.\n\nAlso, have an upvote.", "score": 23, "replies": []}, {"body": "God this comment is top WSB", "score": 19, "replies": []}, {"body": "fuckin lol!", "score": 4, "replies": []}, {"body": "Ong hahaahah", "score": 1, "replies": []}]}, {"body": "This has nothing to do with the recession you retard. It’s just a shit company that shits Japanese money everyday.", "score": 36, "replies": [{"body": "There is no “the recession” ya tard!", "score": 9, "replies": []}, {"body": "And Saudi money.", "score": 2, "replies": []}]}, {"body": "Overblown. Softbank pyramided $2billion at a higher valuation and with the value slashed now has a 1bil paper loss.", "score": 15, "replies": []}, {"body": "They are already taking some losses on uber and other investments that went public. If wework drop after IPO at low valuation, you can imagine the panic selling of their holdings (uber etc) they have to do to fill the holes in the vision fund.", "score": 14, "replies": [{"body": "More like the panic hedging like they did with Nvidia. Masa bought Fortress for a reason.", "score": 6, "replies": []}]}, {"body": "lol, just to maintain the paper gains to have credibility for their version 2.0 fund", "score": 11, "replies": []}, {"body": "WeCancel", "score": 21, "replies": [{"body": "Ayyyooooo!", "score": 2, "replies": []}, {"body": "WeDontWork", "score": 1, "replies": []}]}, {"body": "WeWork is flat out shit. I’d cash out that billion and take the loss. Because if this makes it to market it’s going to be the next movie pass.", "score": 10, "replies": [{"body": "They couldn't get out of that shit right now even if they wanted", "score": 4, "replies": []}]}, {"body": "Fuck all your hot-takes. You’re all just jealous of rich chads. \n\nhttp://www4.pictures.zimbio.com/gi/Adam+Neuman+Canadian+Prime+Minister+Justin+Ba76QBziSBcl.jpg", "score": 8, "replies": [{"body": "Looks like a pool boy and a closeted dad for a gay porno.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "All those who failed didn't IPO afaik. So cheap money to be made by the CEO, and SoftBank hoped some retailers would be BEYOND dump to buy that bag.", "score": 2, "replies": []}, {"body": "Because they said they were special and the market responded yes for like a decade because people thirsty for the next hot thing in tech are scared of missing out and so are just as easy herded as you would sheep.", "score": 1, "replies": []}, {"body": "Isn't the WeWork CEO the one renting out the offices to WeWork?  I'm still trying to figure out the legalities of that", "score": 1, "replies": []}]}, {"body": "Softbank holding the bag on their WeWork shares", "score": 6, "replies": []}, {"body": "So if you're Softbank, how the fuck do you get a refund from this dumpster fire?", "score": 3, "replies": []}, {"body": "Softbank is a favoured investor and can exit before everyone else. Of course if you invested at a $47 billion valuation and We is talking about $20 billion then leaving early doesn't help you.", "score": 4, "replies": []}, {"body": "WeWork to Softbank: no u", "score": 3, "replies": []}, {"body": "We Worthless.", "score": 3, "replies": []}, {"body": "WeWork will definitely be the catalyst that finally bursts the bubble and causes the next recession.\n\nThere are so many non-profitable starts ups right now that are essentially just Ponzi schemes. Early investors invest with the intention of offloading their shares to the next person down the road. Early investors don't give a fuck about profitability. It's all about growing a userbase. Uber, Lyft, BYND are the most obvious of these but there are a staggering amount of companies that fit this criteria.\n\nNow that we see Softbank absolutely failing with this strategy, investors are going to finally question this \"large userbase = value\" belief. Adam Neumann is low key the next Gavrilo Princip.", "score": 5, "replies": [{"body": "Remember when GoPro was through the fucking roof and a company could have a sky high valuation based on one shitty product as opposed to artificially low prices and an attempt at a market corner?", "score": 3, "replies": []}, {"body": "This is the dumbest shit I've read.", "score": 4, "replies": [{"body": "Out of all the posts on this subreddit, I'm honored that you think mine is the dumbest.", "score": 4, "replies": []}]}]}, {"body": "lol, watch WeWork ask Softbank for more money when WeWork posts massive losses in a few years.", "score": 7, "replies": [{"body": "...they're asking for more money right now.", "score": 10, "replies": []}, {"body": "A few years?\n\nMate I’d call the current losses massive but ok.", "score": 3, "replies": []}]}, {"body": "SoftBank the most autistic of all", "score": 1, "replies": []}, {"body": "WeWork has to IPO otherwise the scam doesn't work and Mossad doesn't get paid. They will IPO at 10B if they have to. Money is money. Softbank is just an angry bag holder", "score": 1, "replies": []}]}
