{"title": "There seems to be some misunderstanding about short selling.", "selftext": "tldr; short selling also works to the advantage of longs. Shorts and longs are not enemies.\n\nShorting a stock only temporarily increases downwards momentum.\nShorts and longs start selling at the same time. The shorts are aiming for a profit because they anticipate a correction for the overbought condition of the stock while the longs wants to lock in profits or want to avoid losses when some of them bought at the top and are at an immediate loss.\nBut once a stock is getting to a point where it becomes oversold, longs and shorts work together again to support the price at the bottom. The longs want back in (or want to buy extra to average down) because they can buy the stock cheaper as before and the shorts want to cover to lock their profits. So both parties are buying at this point.\nSo they work together on an upside momentum surge.\n\nShort story, longs and shorts are not enemies. Blaming shorts (selling as an opening transaction) is just as stupid as blaming longs (selling as a closing transaction) getting out in order to lock in profits or take losses.\nOn the contrary, without shorts, there would be no cushion at the bottom. Longs DON'T HAVE to buy and can stay on the sidelines while shorts HAVE to buy to close their position and to lock in their gains. \nSo if nobody is willing to buy (shorting prohibited as Musk wants or longs hesitating to get back in), there is only one way to go for the stock and it is down (no demand).\n\nOther advantages of shorting for longs is that analysts/investors on the shorting side are on the lookout for signs of a created bubble (too much optimism), see through too optimistical forecasts and figures, or even uncover fraud and lies.\nSome stock do too well when the investors are positive and get a beating when the economy or the figures falters.\nShorting helps to keep the growing curve of the stock at a healthy rate.", "id": "9lw998", "created_utc": 1538835438.0, "score": 5, "upvote_ratio": 0.58, "num_comments": 97, "comments": [{"body": "Sometimes the shorts take it too far, i’ve seen it happen in regards to other company’s aswell. Shorting isn’t bad, but sabotaging company operations should be illegal in my opinion.", "score": 9, "replies": [{"body": "That's indeed a complete other matter. And yes, that should be illegal.", "score": 5, "replies": []}, {"body": "This. Making false and misleading statements while holding a short position should be illegal", "score": 5, "replies": []}, {"body": "> sabotaging company operations should be illegal in my opinion\n\nThat is most definitely illegal, what are you talking about.", "score": 2, "replies": []}]}, {"body": "It's not the mechanics of the stock market that Elon is complaining about.  It's the misiniftomation and media campaign these shorts wage against companies that does the real harm.", "score": 25, "replies": [{"body": "Tesla also has a misinformation campaign all day every day - their website and CEO. Tesla website makes bold claims about Autopilot. I’m open to hear feedback from current tesla owners on how AP stands against the claims Tesla makes on its website. The CEO making claims about profitability is also misinformation. ", "score": 18, "replies": [{"body": "Dedicated blogs to pump Tesla news 24h and speculate. \n\nTesla has received for more help from the media over it’s life than it has been hurt by it.", "score": 13, "replies": [{"body": "Indeed we all know how it works in Teslas favor but will never see EM complain about that. ", "score": 4, "replies": []}, {"body": "Depends whether you buy the \"any publicity is good publicity\" philosophy. There are plenty of EV/Tesla-specific publications that are solidly in the pro-Tesla camp, but the sheer amount of negative press coming from large news publications like Bloomberg/CNBC/NYT is WAY out of proportion to the amount they deserve relative to other auto-makers IMO, which is probably why I still get friends asking me if Tesla hasn't already gone bankrupt.", "score": 1, "replies": []}]}, {"body": "Those are what's called forward looking statements and have the correct disclaimer...", "score": 7, "replies": [{"body": "What about AP features on the website? Tesla made hundreds of millions on it making false advertising. ", "score": 8, "replies": [{"body": "What is false about it?", "score": 7, "replies": [{"body": "Self driving capabilities, sensors ‘seeing’ 360 around the car. Processor that’s way better than humans. Any Tesla owner, if believes that all this is true, should drive their cars blindfolded. I’ll be even happy if EM drives Tesla on LA streets blindfolded. This is just what website says. They’ve made promotional videos in which Tesla detects red lights, stop signs, etc. Teslas can’t do that. ", "score": 20, "replies": [{"body": "Link?  Everything you claimed sounds like what they have currently.  They never claimed full self driving.", "score": 2, "replies": [{"body": "https://www.tesla.com/en_GB/videos/autopilot-self-driving-hardware-neighborhood-long%20%20?redirect=no\n\nHow can you say they have it currently. They couldn’t detect motorcycles up until now. Not sure if they detect cyclists and pedestrians. I’ve seen videos in which Tesla runs red Light’s as it doesn’t detect them. Tesla users themselves claim that AP is finicky often to sometimes. ", "score": 13, "replies": [{"body": "I don't think they've ever said, 'hey if you buy this you will have FSD right now!'  They have been upfront with what their software can currently do that is available to the mass market.  Don't care if a few Tesla owners say it \"can be finicky\". Other assisted driving software out there is straight up trash.", "score": 1, "replies": [{"body": "Will have, will prove, will do this and that, is all false advertising. This video is 3 years old and the cars don’t do what it claims. They may do 50% or even 75% of what it claims but it is still hyping things up.\n\nMoreover, Tesla recently put out safety report making bold claims. Why don’t they take financial responsibility if any Tesla vehicle gets into an accident to prove that it is so “safe” than a human driver.", "score": 12, "replies": [{"body": ">Moreover, Tesla recently put out safety report making bold claims. Why don’t they take financial responsibility if any Tesla vehicle gets into an accident to prove that it is so “safe” than a human driver.\n\nLol", "score": 1, "replies": [{"body": "What’s so funny. It only makes sense if they put money where their mouth is. ", "score": 3, "replies": []}]}]}]}, {"body": "Don't take things out of context:\n\n[https://www.tesla.com/en\\_GB/blog/all-tesla-cars-being-produced-now-have-full-self-driving-hardware%20](https://www.tesla.com/en_GB/blog/all-tesla-cars-being-produced-now-have-full-self-driving-hardware%20)\n\n>All Tesla Cars Being Produced Now Have Full Self-Driving **Hardware**  \n>  \n>Self-driving vehicles **will play** a crucial role in improving transportation safety and accelerating the world’s transition to a sustainable future. Full autonomy **will enable** a Tesla to be substantially safer than a human driver, lower the financial cost of transportation for those who own a car and provide low-cost on-demand mobility for those who do not.\n\n&#x200B;", "score": -1, "replies": [{"body": "Did you see the video????\n\nThe car stops at stop signs, red lights, and is driving in the city. Show me a commercial tesla doing that today. And even the FSD hardware claim is misleading - there are reports to upgrade current or some cars to be able to have FSD capabilities. It was false advertising. ", "score": 8, "replies": []}, {"body": "Wait I thought they didn’t know and V3 is needed now. ", "score": 3, "replies": []}]}]}]}]}]}]}]}]}, {"body": "People will write articles regardless that has nothing to do with short sellers. Look at Uber, it’s not a public company, yet it receives a lot of negative news.", "score": 8, "replies": [{"body": "Not to the level that Tesla has faced.  In addition to garbage speculation about Tesla 'killers', car safety, factory conditions, parking lots of 100s of cars (lol), you also have people declaring they will be bankrupt, they are burning cash with nothing to show for it, bond prices, whatever else they can make up/dig up about financials.  A company with the product roadmap, revenue growth, and demand like Tesla should not have to defend every single minute thing that goes wrong with their company.  It's a company that has ~40k employees.  Stuff isn't going to go swimmingly 24/7 and yet, that is the standard that the media (and shorts) have held them to.  It's ridiculous.  That is the dark side of short selling that is not discussed when arguing why short selling isn't bad for the market.  I believe the Fairfax case has been posted here before that sheds light on how these hedge funds operate.", "score": 2, "replies": [{"body": "Tesla just posted a safety report. Do you or any tesla owner think it’s true? If true, Teslas insurance should be much lower and company should take financial responsibility if any tesla gets into an accident. ", "score": 11, "replies": [{"body": "Tesla started doing their own insurance in some instances for this exact reason...", "score": 4, "replies": [{"body": "Which instances? Doesn’t mean anything if this is not a standard offering. ", "score": 8, "replies": []}, {"body": "Oh great another capital intensive business for Tesla to get into.\n\nJust what Tesla needs.", "score": 9, "replies": [{"body": "They need that capital to build their own car carriers or whatever", "score": 4, "replies": [{"body": "Right!?", "score": 3, "replies": []}]}, {"body": "You don't really need to invest before offering insurance. Having access to the car video data also makes it much simpler to shift claims to the insurer of whomever caused the damage.", "score": 0, "replies": []}]}]}]}, {"body": "It's a highly valued stock that is popular with retail investors. They want to know these things. It isn't like some kind of conspiracy from short sellers, which is why you seem to be implying. ", "score": 3, "replies": [{"body": "Hahahahahaha", "score": 0, "replies": []}]}, {"body": "https://www.wsj.com/articles/uber-to-pay-148-million-penalty-to-settle-2016-data-breach-1537983127\n\nhttps://www.bloomberg.com/news/articles/2018-09-12/uber-accused-of-saving-500-million-a-year-by-cheating-drivers\n\nhttps://www.wsj.com/articles/uber-faces-federal-investigation-over-alleged-gender-discrimination-1531753191\n\nGuess it’s all those shorts making that up.\n\nThis is not unique to Tesla.", "score": 9, "replies": [{"body": "That is 3 articles on another controversial company.  You can't claim Tesla is covered fairly by cherry picking 3 negative news articles about private company X.  That's pretty funny of you tho, lol.", "score": 6, "replies": [{"body": "What you’d have preferred I chose Theranos?\n\nWhat about Lime? I can find bad news for them too.\n\nPoint being, it’s not the shorts that are writing these articles.", "score": 11, "replies": [{"body": "No, they just feed their \"information\" so the media can write it.  How many short sellers have been quoted in articles that insinuate that they are the subject matter expert.  Hint: it's a lot.", "score": 3, "replies": []}]}]}]}]}, {"body": "Not nearly as many. but Uber is taking food off of the plates of the taxi commission.\n\nYou need a new comparison.", "score": 0, "replies": []}]}, {"body": ">It's not the mechanics of the stock market that Elon is complaining about.\n\nI disagree.\n\nhttps://twitter.com/elonmusk/status/1048012161002270720\n\n>There is no rational basis for a long holder to lend their stock to shorts, **as it dilutes the shareholder base** & gives the short a strong incentive to attack the company by whatever means possible, including regulators\n\nhttps://twitter.com/elonmusk/status/1048013467247042561\n\n>Where this breaks down is in passive index funds, which constitute most of the market. The holders of those funds, mostly small investors & retirement funds, don’t realize that their stocks are being lent to short sellers, **diminishing their true equity return.**\n\nhttps://twitter.com/elonmusk/status/1048015756569407488\n\n>The big funds can & will, as they’re suffering a net loss. Index managers like Blackrock pocket make excessive profit from short lending while pretending to charge low rates for “passive” index tracking.", "score": 7, "replies": [{"body": "The key here is \"attack the company by whatever means possible, including regulators\".", "score": 1, "replies": [{"body": "Nobody forced Elon to commit securities fraud.", "score": 13, "replies": [{"body": "No legal ruling entity (i.e. a judge) had ruled that he committed securities fraud.  ", "score": -1, "replies": [{"body": "No legal ruling entity has ruled that he didn't commit securities fraud either.", "score": 14, "replies": [{"body": "I think the law of the land states innocent until proven guilty.", "score": 3, "replies": [{"body": "This is a civil case.", "score": 17, "replies": []}, {"body": "He settled though, and is paying a fine.\n\nDo you really believe that finding was secured and was subject to only a shareholder vote? After only 1 45 minute meeting with the Saudis?", "score": 6, "replies": [{"body": "I think he believed he had Saudi's, his own stake in spaceX, existing shareholders, and maybe other sources.  I don't think Elon thought for a second he couldn't raise the money.  Raising money is one of his best skills.", "score": -1, "replies": [{"body": "> I don't think Elon thought for a second he couldn't raise the money. Raising money is one of his best skills.\n\nis very much different from \"Funding secured\".\n\nI mean, if he tweets tomorrow that he is taking apple private by buying it out for 10 trillion dollars, certainly that is false. \n\nWhat he did was clearly lie, which he has gotten away with. As he does again and again.", "score": 4, "replies": [{"body": "Trying to paint him as a liar lol.  I hope you were one of the people that got margin called.  There's been nothing in Elon's past that adds up to him being a liar for the sake of self profit.  He has a very clear mission which is why he has so many supporters.  This man witnessed 3 failed rocket launches and went for it for a 4th, which was successful.  He will never give up.  And the people betting against him are going to see just how tenacious he is.", "score": 1, "replies": [{"body": "Self driving a solved problem, FSD, coast to coast autonomous drive, cross country summon, driverless Tesla network taxi service. I can go on.\n\nOr are they all just forward looking statements? He clearly has been misrepresented Tesla's autonomous capabilities and continues to do so.\n\nIf he comes out tomorrow saying that modelY would not need batteries as they are working on nuclear fusion and would put a fusion reactor in every car, surely you'd call him a liar? Or would that be fine too?", "score": 1, "replies": [{"body": "They are absolutely forward looking statements, lol.  You know what else is a forward looking statement?  \"Tesla will go bankrupt in 20XX\"  All sorts of critics and shorts been saying this for a decade plus.  Should they be prosecuted too because that kind of stuff moves share price?", "score": 1, "replies": [{"body": "The CEO can openly lie to hype up the stock price and all is well with the world?\n\nAnd I'm not arguing for imprisonment/prosecution, but just the recognition that Elon Musk is a snake oil salesman.\n\n", "score": 1, "replies": [{"body": ">Elon Musk is a snake oil salesman.\n\nHahahahaha.  Hahahahahaha", "score": 1, "replies": []}]}]}]}]}, {"body": "Yes it’s 100% back tracking, he had no funding. And he obviously couldn’t raise it or the deal wouldn’t have fallen thru.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": ">Shorting a stock only temporarily increases downwards momentum.\n\nFor as long as the short ~~buying~~ selling continues the downward momentum continues. This can be done indefinitely.\n\n>So they work together on an upside momentum surge.\n\nTo reach that conclusion you used a whole lot of assumptions. They make sense in theory but in practice they don't.\n\n> Shorts and longs start selling at the same time.\n\nHUH? Longs don't sell. Day traders and people into the stockmarket sell when they can realize profits but that is only a part of the market. Longs hold their position or buy.  \n\n>The shorts are aiming for a profit because they anticipate a correction for the overbought condition of the stock while the longs wants to lock in profits or want to avoid losses when some of them bought at the top and are at an immediate loss.\n\nYou are talking about only a part of the market that is partying with the money of longs. That down force may be the tipping point that very negatively affects the company and the longs who are not interested in selling. Shorting gives no upward pressure.\n\n>But once a stock is getting to a point where it becomes oversold, longs and shorts work together again to support the price at the bottom. \n\nI 100% guarantee you that if company hits a roadblock while down and the company loses value the shorts won't buy until the upswing  is safe. They will just walk away with a smile and fat pockets while the longs lose. You speak as if the shorts coming back in to exert upward pressure is a certainty. That's very wrong.\n\n>The longs want back in (or want to buy extra to average down) because they can buy the stock cheaper as before and the shorts want to cover to lock their profits\n\nThe longs never left. Surely some might buy more when low, but that is not part of the \"balance\" you purport.\n\nThe short will sell and only go back in if they think things look good. If they don't, they move on to the next victim and the longs pay.\n\n>Short story, longs and shorts are not enemies.\n\nOf course not. They just have the exact opposite interests. Longs want the stock to go up, shorts want the stock to go down. \n\n> Blaming shorts (selling as an opening transaction) is just as stupid as blaming longs (selling as a closing transaction) getting out in order to lock in profits or take losses.\n\nA long that sells is no longer a long.\n\nA long (or long position) is the buying of a security such as a stock, commodity or currency with the expectation that the asset will rise in value.\n\nRead more: Long (or Long Position) | Investopedia https://www.investopedia.com/terms/l/long.asp#ixzz5TBjlOULK \nFollow us: Investopedia on Facebook\n\n> On the contrary, without shorts, there would be no cushion at the bottom. \n\nThe existence of this cushion is entirely dependent on things working out. If things look bad, shorts won't be there for cushion. Longs will be there tho.\n\n> Longs DON'T HAVE to buy and can stay on the sidelines while shorts HAVE to buy to close their position and to lock in their gains.\n\nThis is mostly hedged against. Sure some crazy people will go in for more than they should risk, but for the most part the penalty is already accounted for and part of the daily business.\n\n>Other advantages of shorting for longs is that analysts/investors on the shorting side are on the lookout for signs of a created bubble (too much optimism), see through too optimistical forecasts and figures,\n\nHUH? Optimism is a very powerful force that is good for a company! Why would you want to keep it down? The market rules and optimism is the very foundation of a bull market. Quite frankly that argument is demented if it holds true anywhere important. Have you any clue how hard a company must work to create optimism and how easy is to gain pessimism?\n", "score": 2, "replies": [{"body": "> For as long as the short buying continues the downward momentum continues. This can be done indefinitely.\n\n'Short buying'? Or do you mean shorts selling?\nNo, this can't be done indefinitely. To maintain a downward trend, the demand has to be kept lower than the supply. Either the shares available for shorting dries up, or the longs jump in because they think the stock is oversold or undervalued.\n\n> To reach that conclusion you used a whole lot of assumptions. They make sense in theory but in practice they don't.\n\nAnd why not? When does the shorter realizes his profit? When he closes his position.\nIs he interested in keeping the price down? No, because all traders/investors make money on PRICE MOVEMENT. \nShorters want and need to cover and the bigger the positions, the sooner they will lock in in steps. Shorts are at the highest risk at the bottom because if the trend reverses, they might need to cover with uncontrollable slippage where profits evaporates and might even change to losses.\n\n> HUH? Longs don't sell. Day traders and people into the stockmarket sell when they can realize profits but that is only a part of the market. Longs hold their position or buy.\n\nLongs don't sell? How do they realize their profits?\nHow do they cut short losses? By maintaining their position and riding it all out till the stock goes delisted?\n\n> You are talking about only a part of the market that is partying with the money of longs. That down force may be the tipping point that very negatively affects the company and the longs who are not interested in selling. Shorting gives no upward pressure.\n\nShorting (selling more shares) doesn't indeed give upward pressure. But the covering does.\n\n> I 100% guarantee you that if company hits a roadblock while down and the company loses value the shorts won't buy until the upswing is safe. They will just walk away with a smile and fat pockets while the longs lose. You speak as if the shorts coming back in to exert upward pressure is a certainty. That's very wrong.\n\nShorts sell shares because they think the stock is overvalued, overbought, ...\nIf the company 'hits a roadblock' on the way, then yes, this is a confirmation of their thesis. There is no need to cover at that point. That's correct.\nAnd you claim the 'real investing longs' don't even sell when the fundamentals change?\nDid the fundamentals change because the stock attracted shorters, or did the stock attract shorters because the fundamentals where indeed flaky?\n\nYou might point to a few companies in history where shorters indeed were responsible for a downfall, but there are a multitude of stocks that down the drain because longs pumped it way above what was healthy.\nThere is a graveyard of companies that were pumped by investors while thinking the economic laws didn't apply to them (see the tech bubble).\n\n> The longs never left. Surely some might buy more when low, but that is not part of the \"balance\" you purport.\n\nLongs that never sell under any circumstances deserve to lose all their money.\n\n> The short will sell and only go back in if they think things look good. If they don't, they move on to the next victim and the longs pay.\n\nYou seem to think that positions can be build and maintained indefinitely?\nAgain, shorts are not interested in keeping a stock down. Money can only be made during a price movement and AFTER covering.\nShorts have the same goal as do longs which is to make a return in investment that covers the risk.\n\n> Of course not. They just have the exact opposite interests. Longs want the stock to go up, shorts want the stock to go down.\n\nIf one has a simplistic view on the market, yes.\n\nBut your 'real investing longs' do profit from the dips as well, no? It was a well heard mantra of the Tesla longs these days: \"Buy the dips!\".\n\n> A long that sells is no longer a long.\n\nAnd a short that covers is no longer a short but is on the buying side. Surprise!\n\n> A long (or long position) is the buying of a security such as a stock, commodity or currency with the expectation that the asset will rise in value.\n\nSo when shorts cover, their buying is not attributing to the demand leading to higher quotes?\n\n> Read more: Long (or Long Position) | Investopedia https://www.investopedia.com/terms/l/long.asp#ixzz5TBjlOULK Follow us: Investopedia on Facebook\n\n> The existence of this cushion is entirely dependent on things working out. If things look bad, shorts won't be there for cushion. Longs will be there tho.\n\nLOL\nHow do existing long positions support the quote?\nOnly new orders/transactions have an impact on price.\nEither the shorts start to cover which trigger longs to think the downtrend has come to an end, or the longs jump in and the shorts are forced to lock in their profit.\n\n> This is mostly hedged against. Sure some crazy people will go in for more than they should risk, but for the most part the penalty is already accounted for and part of the daily business.\n\nCan you elaborate?\n\n> HUH? Optimism is a very powerful force that is good for a company! Why would you want to keep it down? The market rules and optimism is the very foundation of a bull market. Quite frankly that argument is demented if it holds true anywhere important. Have you any clue how hard a company must work to create optimism and how easy is to gain pessimism?\n\nYeah, there were never bubbles before. /s\n\n", "score": 4, "replies": [{"body": ">'Short buying'? Or do you mean shorts selling?\n\nYes of course, short selling.\n\n>No, this can't be done indefinitely. To maintain a downward trend, the demand has to be kept lower than the supply. Either the shares available for shorting dries up, or the longs jump in because they think the stock is oversold or undervalued.\n\nFirst. By the mere fact of drying up available stock to short there is a negative pressure. Many shorts causes uncertainty. Uncertainty is bad for business. That is simple and obvious.\n\nSecond. Short selling has always been done indefinitely. Only in over simplistic theory it stops. Surely, as shares dry up the transaction volume decreases significantly, but the transactions keep happening as shorts lose out to interests rates and margin calls. \n\n>Longs don't sell? How do they realize their profits? How do they cut short losses? By maintaining their position and riding it all out till the stock goes delisted?\n\nBy their  definition, longs don't sell. The act of selling makes them shorts. Most stocks belong in long positions that barely change. They are bought with the hope they gain value over time.  \n\nPeople that sell and buy a stock they like or know engage in both long positions and short positions. That's a lot of people and a significant portion of the shares, but a minority. Then there are short sellers. What short sellers do is a side bet with an institution.\n\n>No, because all traders/investors make money on PRICE MOVEMENT.\n\nSigh. You are talking about a very small amount of investors as if they were the majority.\n\nLet's see TSLA as an example. From [here](https://finance.yahoo.com/quote/tsla/key-statistics/)\n\nShares Outstanding: 170.59M \n\nFloat: 127.52M (Already 25% of the shares are mostly long)\n\n% Held by Insiders:\t25.19% (mostly long)\n\n% Held by Institutions: 59.53% (mostly long and whenever they go short the price will show it)\n\nShort % of Float (Sep 13, 2018): 28.51% ( That's a big number)\n\nAvg Vol (3 month) 10.25M (8% of the float. Most of the value of the company is backed \n by the longs. The daily and weekly price has little impact on the long. The risk introduced by short selling nets longs no benefit.)\n\n\nWhat you describe as everyone doing money is a small percent. In the mean time the short sellers justify the risk of their existence by pretending all investors trade based on the short term price. Nah.", "score": 1, "replies": [{"body": "\n> First. By the mere fact of drying up available stock to short there is a negative pressure. Many shorts causes uncertainty. Uncertainty is bad for business. That is simple and obvious.\n\nSo there can't be negative pressure? All on the same boat forever till the arrival at the end of the rainbow?\nShorts don't cause uncertainty. Flaky fundamentals will do that.\n\nAnd in case of Tesla, you can short on the shaky fundamentals and thanks to Musk, one can also short on Musk now.\n\n> Second. Short selling has always been done indefinitely. Only in over simplistic theory it stops. Surely, as shares dry up the transaction volume decreases significantly, but the transactions keep happening as shorts lose out to interests rates and margin calls.\n\nDude, no offence but I'm not sure you have a basic understanding how markets work.\nWhen I say that shorting comes to a halt (because shares dry up or longs start to get in) I'm not talking over time, but the extension of downward price movement.\n\nIf shorts get margin calls and have to cover, they BUY shares just as longs are BUYING who want back in because they think the stock is oversold or undervalued.\n\n> By their definition, longs don't sell. The act of selling makes them shorts. Most stocks belong in long positions that barely change. They are bought with the hope they gain value over time.\n\nOK, now it's obvious.\nA long selling his shares because he wants to take a profit is now a short? Care to explain?\n\nYou are lucky not all investors think the way you do (buy and never let go) or one could only get shares at an IPO and the price would never go up (or down).\n \n> People that sell and buy a stock they like or know engage in both long positions and short positions. That's a lot of people and a significant portion of the shares, but a minority. Then there are short sellers. What short sellers do is a side bet with an institution.\n\nBS\n\n> Sigh. You are talking about a very small amount of investors as if they were the majority.\n\nWhere did those hero investors get their shares from? The IPO of a market player willing to stand on the other side?\n\n\n", "score": 3, "replies": [{"body": ">So there can't be negative pressure? All on the same boat forever till the arrival at the end of the rainbow?\n\nThere are enough negative pressures around to add one more as a basic part of the trading mechanism. Short selling destroys value for longs.\n\n>Shorts don't cause uncertainty. Flaky fundamentals will do that.\n\nBS . Short sellers cause uncertainty by their very existence. That short sellers are highly encourage to cause even more uncertainty through the media makes it even worse.\n\n> If shorts get margin calls and have to cover, they BUY shares just as longs are BUYING who want back in because they think the stock is oversold or undervalued.\n\nAll this happens after the market is artificially lowered by short selling.\n\n>OK, now it's obvious. A long selling his shares because he wants to take a profit is now a short? Care to explain?\n\nYou seem to be ignoring this. When longs sell their shares they are no longer longs.  Surely a small amount of market players are bullish on Tesla but they still take advantage of the dips and peaks. For the time they buy and hold they are short term longs but when they sell or short sell they stop being long. They are more properly described as bulls. Longs requiere a long position. Buy and hold. \n\nWhen a long sells they stop being a long, BY DEFINITION.  A long  expects the price to go up. If they sell, they were not expecting the price to up, thus no longer longs.\n\n>You are lucky not all investors think the way you do (buy and never let go) or one could only get shares at an IPO and the price would never go up (or down).\n\nAgain. You are ignoring the fact that most institutions don't day trade with their positions. Institutions can hold a stock for decades. Between institutions and restricted shares most shares  do not change hands often. \n\n>People that sell and buy a stock they like or know engage in both long positions and short positions. That's a lot of people and a significant portion of the shares, but a minority. Then there are short sellers. What short sellers do is a side bet with an institution.\n\n>BS\n\nNot BS. It is a simple truth. Most of the stock price is made up by longs who can't or won't change their position because of investment strategy or market regulations. Only a small part of the market engages in profiting from the short term upside down of a company. Most of the market does not play the little up and down game with the shorts. Longs gain nothing from this artificially added volatility but risk is added to their investment.\n\nShort selling is terrible for investors, specially if the SEC can't enforce the law on short and distort schemes. \n\n>Where did those hero investors get their shares from? The IPO of a market player willing to stand on the other side?\n\nI'm not sure if you are playing dumb or you honestly can't understand a simple evident truth. Most of the stock market do not play the shorts game. Most of the value of a stock comes from longs who are HOLDING, not from the daily noise. Short selling adds noise, volatility and downward pressure for no benefit to longs. That's even without accounting for the psychologic incentive to distort markets for financial gains.\n\n", "score": 1, "replies": []}]}, {"body": ">Longs that never sell under any circumstances deserve to lose all their money.\n\nI have circumstances to sell. 15 years or Tesla abandoning the mission. Do I deserve to lose all my money?\n\n>But your 'real investing longs' do profit from the dips as well, no? It was a well heard mantra of the Tesla longs these days: \"Buy the dips!\"\n\nNot all of them. Most longs don't buy the dips. As much as institutions, insiders, employees or Tesla itself would like to buy the dips they can't. Individual investors can buy the dips though, but that requieres additional investment. That is not balance. That could be wiped out by things like high incentive to short and distort.\n\n> Shorts sell shares because they think the stock is overvalued, overbought, ... If the company 'hits a roadblock' on the way, then yes, this is a confirmation of their thesis.\n\nIf the roadblock is caused or made worse by the effect of short selling on a stock then this is a very expensive risk for longs. \n\n>LOL How do existing long positions support the quote? Only new orders/transactions have an impact on price. Either the shorts start to cover which trigger longs to think the downtrend has come to an end, or the longs jump in and the shorts are forced to lock in their profit.\n\nLOL You are looking only at the last two digits of the price. Long term investors makes up most of the price. Frequent traders are the noise. Short sellers are merely a downward force.\n\n>This is mostly hedged against. Sure some crazy people will go in for more than they should risk, but for the most part the penalty is already accounted for and part of the daily business.\n\n>Can you elaborate?\n\nSure. Short selling is very high risk investing, mostly because of margin calls and interest. It is also a great hedging tool. So for the most part when short sellers lose it's high risk money anyway.\n\nAnyone short selling with more than they should will likely be weeded out of the market the longer they stay.\n\n>Yeah, there were never bubbles before.\n\nYep and they were not the end of the world. When the bubble bursts some companies recover, others go bankrupt. When companies enter bubbles but instead of the bubble popping the company breaks through we don't call them bubbles anymore.", "score": 1, "replies": []}]}]}]}, {"body": "I recommend listening to Quoth the Raven.  His [most recent podcast](https://quoththeraven.podbean.com/e/quoth-the-raven-74-elon-musk-trolls-the-sec-and-calls-short-sellers-value-destroyers/) explains the role short sellers play in the market, and he talks about Tesla frequently (almost half his pods).   He can be sensationalist at times on the bear side, but he is even-keeled in this one.  \n\nEntertaining, funny, and one of my favorite pods. \n\n**Two drink minimum to listen required**\n\n", "score": 2, "replies": []}, {"body": "Tesla shorts are not behaving as you suggest.\n\nhttps://teslamotorsclub.com/tmc/threads/elon-musk-vs-short-sellers.118431/", "score": 1, "replies": [{"body": "So basically pumping the stock is OK. The other was around is not.\nSelf-fulfilling prophesies do work as well going up. \n\nLook at some fora. \n\n- According to some, Musk didn't do anything wrong and the SEC should leave him alone because 'he is saving the planet'.\n- The SEC working for the shorts.\n- The SEC had a more negative influence than the tweets\n- ...\n\n\n", "score": 7, "replies": [{"body": "Sorry the SEC and the DOJ are investigating Tesla not the shorts. ", "score": 1, "replies": [{"body": "^ \n\n", "score": 1, "replies": []}]}]}]}, {"body": "I'd agree with your post if there was more equilibrium in the shorts vs longs. The weight of the shorts in TSLAs case is more than just market mechanics. They are having to fend off industries and funds that are trying to destroy them. That shit even gets into Reddit.  Theoretically, I believe you have very good points. In practice, it's a tool for bigger fish to destroy the little fish. Thank god TSLA is starting to become a big fish....\n", "score": 1, "replies": []}, {"body": "Short selling when high and buying back when low is fine. But what about the trend seen in TSLA stock where the longs are holding, and short are selling at the lowest resistance, constantly?   Pressuring the stock down.    If those short have the kind of capital to pressure down like that just for the sake of it forcing some unsecured holders buying the FUD to sell, isn’t that kind of a systemic problem? Also if Longs don’t want to get more stock...", "score": 1, "replies": []}, {"body": "The short position in Tesla is far beyond the normal level expected from optimal market Dynamics. Tesla shorts are anomalous.\n\nhttps://teslamotorsclub.com/tmc/threads/elon-musk-vs-short-sellers.118431/", "score": 2, "replies": [{"body": "Tesla attracts short sellers because there is a lot of volatility and liquidity.\n\nShorts can keep a certain part as a fixed position while another part is used more dynamically. Thanks to the volatility, the dynamic part made already a good amount to offset all risk of the static part of the position.", "score": 6, "replies": [{"body": "If the Tesla short position is so normal I'm sure you can find many examples of similar short positions in the market. ", "score": 0, "replies": [{"body": "You're probably implying shorters want the stock to reach $0?\nWell, shorts need to cover at some point.\n\nIf trading is halted, they can't get out of their position. \n\nLongs should embrace the shorts. The shorts will guarantee that 35 million shared will be bought at some point.\nAnd if they need to cover, the price can go up very quickly.\n", "score": 4, "replies": [{"body": "The shorts think they can force the shares low enough to trigger the repayment of the convertible debt in cash rather than equity. They think this will crater the stock and make them money. This short term arbitrage is the exact opposite of the rationale for short selling.\n\nTesla shorts are seeking to extract the long term value of Tesla right now by impairing future earnings in perpetuity/a really long time. Longs should want them dead not embrace them.\n\n Efficient markets are weighing machines not voting machines. Shorts are like voters watching a reality TV show Longs are in Tesla to support the long term electrification of transport and enable renewable energy generation through battery storage. Shorts are trying to get something for nothing. Longs are trying to make something worthwhile. \n\nI predict that Q3 cashflow will be positive to the tune of almost a billion dollars. I also predict that shorts will make up a new reason Tesla sucks after that.\n\nMaybe you should read this and reevaluate your opinions about how and why you belong on this planet. http://la.utexas.edu/users/hcleaver/368/368vebleninstinct.html\n\n", "score": 2, "replies": [{"body": "The market isn't interested in why you take any position (short or long).\n\nEach participant has his own reasons, fears, risk tolerance, strategy, funding, ...\n\nThe convertible debt is a risk Tesla decided to take. \nWould you be as kind to ICE-manufacturers as to Tesla? 'Or do they need to die'?\n\n", "score": 5, "replies": [{"body": "If there was a 27% short position in Ford it would probably go out of business the next day. The purpose of the market is to efficiently distribute capital from investors and maximize econmic benefit. That's why it has regulators and strict laws govern activity in the markets. Tesla is an example of short sellers exploiting the rules. This is evident in the fact that there is no precedent in the history of modern markets to the present case. The closest is the case of VW, where predatory shorts we're eventually squeezed and the stock went up 300%. \n\nThe market is not a casino and those who treat it that way should be excluded. Just as non accredited investors are excluded from private investments. The popularity of ETFs has led to a situation where fund managers can act against the interests of the people who trust them to curate their investments. It's time for regulators to plug this hole. ", "score": 0, "replies": [{"body": "Can you explain why Ford would go bankrupt overnight if there was a 27% short position in Ford?\nHow would that play out?\n\nHow are shorts exploiting the rules? What is illegal?\n\nLike I said, the market isn't interested if you 'believe in Musk' or you short because you can't stand him.\nThe market isn't interested if you scalp for pennies or buy shares for your retirement.\nBesides, if the market is not a casino, then longs shouldn't invest in Tesla.\nShort-term investors might take smarter 'bets' with less risk in Tesla than a believer holding stock because Musk is allegedly saving the world.\n", "score": 2, "replies": [{"body": "Ford has a very large cash burn and an absolutely massive debt load. A giant short position combined with a full court assault in the press and with existing investors a la Tesla would impair Ford's credit worthiness and make there heavily leaveraged operations more expensive. Unlike Tesla who can easily grow their way out of their problems Ford's business is shrinking and much more vulnerable to predatory shorts. \n\nThe shorts are exploiting the rules by borrowing shares that would never be lent out if the lender actually had a financial interest in Tesla. Share lending by middlemen is a glaring flaw in current market regulations. \n\nThe market does care if capital is being deployed inefficiently.  Because the regulatory rules prohibit companies from operating in public markets without participating in existing exchanges it is absolutely necessary to ensure efficient capital distribution through fair and timely regulatory changes.\n\nIf an investor owns shares but the decision to lend those shares is not theirs but is the purview of a middle man with zero long interest in the success of the company then their incentives are misaligned with the investors they serve and a moral hazard exists. This moral hazard is on display with Tesla. If the decision to lend shares was up to the investors in Tesla then now would be an excellent time to repatriate shares and cause a short squeeze. In fact if shorts knew that they were borrowing shares from actual shareholders rather than disinterested middle men then they would never have put on a 27% short position for fear of a squeeze. The shorting mechanism is broken and needs to be addressed.\n\nIf you think being long Tesla is like betting in a casino you need to do more DD on the company.", "score": 1, "replies": [{"body": "You claimed bankrupt overnight. Why would that happen if Ford crashes on Monday for 50% just because the Stock is steered down?\n\nShorts can direct the downward trend, but they need to cover to make money. \nSecondly, shorts can direct a downward trend, but they can't keep the price down. To keep a price down, more selling has to be done, but if there are no more willing to sell (longs) or the available shares to short dries up, the route upwards in complete open.\nThird, would the fundamentals be changed of Ford it that would happen on Monday? No, therefore there will be longs who want to jump in because the stock is oversold or undervalued.\n\nDid shorts bug you before or is just because Tesla is under fire?\n\nSo you claim it is a smart move to go long Tesla all the way? Have you seen the volatility? \nThe so called investors that ride the waves because they 'believe' in the company take more risk on them than the short term traders who know what they are doing.", "score": 2, "replies": [{"body": "Ford depends heavily on it's credit rating to fund it's operations. A decline in Ford's percieved credit worthiness impairs it's ability to operate in an extreme case Ford, which is already struggling, would be unable to fund itself due to the cost of borrowing\\downgrades. \n\nIf, like Tesla, the shares of Ford to be shorted were widely available and loaned out by fund managers with no long interest in the company. There would be no need to cover until Ford was forced to declare bankruptcy.\n\nI have no problem with shorts as long as shares being lent are under the control of the owner and the incentives to lend are ones that induce managers and brokerages to act in thier long clients' interests.\n\nI have been bothered by broker shenanigans in the past when one of my stocks Biosyntech declared bankrupcy and my shares magically transitioned from the Canada to US exchange. My broker TD Waterhouse apologized for the error but didn't explain how it happened. I later learned that they probably lent out my shares without my consent. I switched brokers. \n\nThe particular reason that the Tesla short position bothers me is that it is so outrageously huge that it is begging to be squeezed. Any rational long would be driving up lending rates, but because funds and brokerages are not actually longs they act against their long client's interests. I recommend everyone reading this switch their accounts to a broker or buy a fund that explicitly rejects this practice.", "score": 1, "replies": [{"body": "You're describing a company that attracts shorts because of flaky fundamentals.\n\nA downgrade doesn't happen based on how the price moves.\n\nAgain, shorts are interested on price movement because it is price movement that increases their profit.\nMaintaining a short position is risky. Maintaining the full position at the bottom is flat out insane. \n\nShorts make just as (smart) longs a risk profile. Maintaining a large short position at the bottom is not worth the risk since further downward price movement is low while the risk is too high (a fully loaded spring).\n\nWhen the real bottom is reached, trading might be halted. Do you think not being able to over is beneficial to shorts?", "score": 2, "replies": [{"body": "Absolutely. The shorts are piling on Tesla because of their convertible debt maturity problem. If Tesla is forced to pay that money back in cash it will severely hamper their growth for years/forever. If they pay it off in shares then the Model Y will probably come out a year earlier. Shorts are impairing Tesla's vulnerable position but a rational long would drive up the rates on loaned shares and generate a short squeeze at this point.  This can't happen in the current environment because disinterested third parties control the lending desks all while telling the people that allow them to hold their shares they are working in their interests.\n\nIt would greatly benefit Tesla longs to switch their investment holdings to a broker or fund that doesn't lend their shares without consent.\n\nFord has very vulnerable finances and therefore is a prime target for this type of one sided, insane (in a fair world) predatory short attack.", "score": 1, "replies": [{"body": "Of course the shorts are on Tesla because of their vulnerability.\nDid the shorts bring them there? \n\nDo you prefer a growing bubble on shaky grounds with irrational people claiming Tesla will be at $4000/share within a few years?? ", "score": 1, "replies": [{"body": "The latest irrational person to claim that Tesla will be at 20x in 2030 is Ron Baron, one of the greatest analysts of all time. \n\nI welcome shorts when the lenders actually own the shares. If I buy a share and the fund or broker lends it out without my consent it makes shorting much less risky since the likelihood of lending rates rising and share availability declining is much less that if the actual owners of the shares make a decision to lend or not lend their shares. \n\nWhen a fund sells an investor equities and then lends out that investor's shares and collect the interest for themselves, they have defrauded that investor and forced tem to take the loss associated with the increased selling pressure without the gain of the interest accrued. Not only that, but the true owner of the shares can't decide not to lend. It's a lot like your property manager lending out your apartment while you're away and keeping the money. Totally wrong.\n\nThis basic problem is a growing moral hazard and should be eliminated through regulation. ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I think that the compliant from Musk and long is that a lot of false stories are printed in the media abd recycled om a regular basis with a view to forcing the Tesla share price diwn and more generally damaging Tesla.\n\nThese stories often feature prominent short sellers and often match the timing of large hare sell offs.\n\nThe SEC does nothing about inaccurate stories and possible manipulative tactics on the bear side. Probably becase the law doesn't allow it,\n\nBut IMO all that is happening is that the wild ride is increasing the chances people on both sides will lose a lot of money.\n\nShorts have picked the wrong target IMO, Tesla is a strong company that should be about to turn the corner and post good results. So basically my advice to longs and Elon is calm down wait and buy some Champagne.", "score": 1, "replies": [{"body": "There is a big difference WHO is making up stories. Longs will be foretelling too optimistic views and short too bearish.\n\nIt is a complete other matter when the stories, halve truths or in case of Musk, blatantly fraud or market manipulation in the function of a CEO. ", "score": 2, "replies": [{"body": "Regardless all public claims about a companies financials should be able to be supported by evidence.\n\nMost of what Chanos says is totally incorrect, yet he is allowed to endlessly repeat the same crap unquestioned by the interviewer.\n\nIn the end Tesla is fine, but this kind of manipulation could put a weaker, but saveable , company out of business. Costing people money, costing jobs, costing the US taxpayer, all because lies repeated endlessly by the right people are never challenged.", "score": 1, "replies": [{"body": "How would that work?\n\nAnd would it work on the other side as well? No more forecasts of companies, because they can't support them by evidence?", "score": 2, "replies": [{"body": "Simply if a statement is made on a program that represents itself as giving market advice, or informed financial commentary on a firm, the SEC can ask for supporting evidence.\n\nThere is evidence to support company forecasts as they should have plans in place aimed at those targets.\n\nIn contrast if they interview me on CNBC and I claim \"Ford will go bankrupt tomorrow\", I have zero evidence to make that claim. If media organisations report my claim when they should reasonably know I have zero evidence, they are also culpable. Because if media organisations want to fact check my claim, it should take them no longer than 30 minutes,  or perhaps only 5 minutes.\n\nOr are you saying everyone can make any false claim they like, and any financial losses incurred are simply bad luck?\n\nIf that was true, the SEC should not bother with action against Elon.\n\nI would draw the line a  social media sites, and commentary by regular low profile people. No reasonable person would assume that is sensible financial advice from informed sources.\n\nPlaces like Bloomberg and CNBC are (perhaps incorrectly) assumed to be credible sources that can be trusted.", "score": 1, "replies": [{"body": "So the overly optimistic people that recently claimed Tesla stock should go to $4000 within a few years and another claiming Tesla could be a trillion Dollar company within a few years should be locked up?\n\nThe Asset Pricing Model and other models that value the current price of stock can't be used any more because they count several years in the future.\nOr is only a positive valuation allowed and not a bad one?\n\nAll bonds AAA status? A junk-rating is a bad signal we can't allow, no?\n\nThe SEC has to be dismantled? Any claim is bad news but because it can't be proven before it went to court, they should go.\n\n...\n", "score": 1, "replies": [{"body": "No they just need to be able to provide some evidence for their claims.\n\nIf bonds are rated the rating company has a formula.\n\nAll I am questioning is deliberately false claims with a view to market manipulation. The other alternative is finance journalists could do their job and ask people to substantiate their claims.\n\nIt is not the case that only claims by Elon move the market. The market and the finance media are being used as instruments to attack Tesla, that is not there intended purpose.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Tesla's valuation is also far beyond the normal level expected of a company of that size. ", "score": 3, "replies": [{"body": "Tesla is a growth company. Their valuation is in line with other companies that have demonstrated similar sales growth.\n\nCompanies like Ford and GM can barely grow and are actually more likely to shrink because the market for their cars is getting smaller. There will not be enough batteries in the world to replace thier ICE sales for the next decade at least and even if they switched to EVs they would only be treading water, since they are sacrificing their ICE sales for EVs.\n\nIn a rational market shorts would be piling on the ICE manufacturers and longs would be driving up the interest rates on borrowed shares to cause a short squeeze.\n\nHere is an excellent presentation from a Stanford Prof on what is in store for the ICE manufacturers. https://youtu.be/2b3ttqYDwF0", "score": 0, "replies": [{"body": "> Tesla is a growth company. Their valuation is in line with other companies that have demonstrated similar sales growth.\n\nWhat other car companies have similar growth and valuations? You can't compare Tesla to tech companies because scaling up a car company is way more expensive. Tesla's growth hasn't increased profitability because their business model doesn't scale.", "score": 6, "replies": [{"body": "Tesla's growth has increased profitability. The margin on all their differentiated product lines except Tesla energy has increased steadily over time. If you project existing trends into the future it is clear that Tesla will be cash flow positive and profitable in Q3.\n\nTesla's business does scale because their battery costs have declined 20% per year. That basically guarantees icreasing gross margins of 2k per car or so for the next few years. Tesla's scale comes from a vertically integrated battery play (as well as self driving software). Since Tesla's costs are declining at a rate ice manufacturers can only dream and they are on track to control 150 of a planned 354 GWh total gloval battery supply by 2020. They will have enough batteries to continue to grow sales and margins for many years to come.\n\nWatch the video I liked above to understand more.", "score": 1, "replies": [{"body": "> Tesla's growth has increased profitability.\n\nNot enough profits to pay their debts or pay for continued expansion. The model 3 was paid for by high interest bonds. There's no money to grow to build the Y, the semi, the pickup truck etc. ", "score": 2, "replies": [{"body": "I strongly suspect you will be proven wrong about this in short order.\n\nKeep in mind that everyday Tesla improves their manufacturing efficiency and every day their battery business (the main cost of an EV) gets bigger and cheaper. This is the worst they can ever do. The competition can never improve because they can't make money from EVs while cannibalizing their ICE sales.", "score": 0, "replies": [{"body": "> The competition can never improve because they can't make money from EVs while cannibalizing their ICE sales.\n\nIn the same way, the Model 3 can cannibalise the S, and the Y can cannibalise the 3. Cars are expensive, where is Tesla going to find the billions needed for its new factories?", "score": 3, "replies": [{"body": "That argument doesn't hold.  Camry sales don't cannibalize Prius sales.\n\nPeople want a midsize sedan or a full size sedan,as evidenced by Q3 sales.  Model S and X sales are up over Q2.\n\nCar companies survive on financing/leasing revenue. If used car prices drop because people want EVs then all these companies go out of business.  If you watch the youtube video I linked you will understand my point better.\n\nTesla can raise money from banks and investors who understand their business model and think that the company will put the money to good use growing the valuation of the enterprise.\n\nThe real question is: why would anyone lend money to Ford.  It is a disaster waiting to happen.  Hopefully Tesla can pick up a couple of their factories at auction.\n", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}
