{"title": "Anyone still have a bull case for AMZN?", "selftext": "It seems like AMZN has a lot going against it:\n\n- Higher wages for warehouse workers\n\n- Consumer spending power looks to be going down, people typically don't get their necessities from Amazon\n\n- AWS has some big growing competitors(msft and goog)\n\n- On top of all this a high pe ratio\n\nI know this is all surface level so please tell me where I'm wrong.", "id": "t99qoi", "created_utc": 1646717995.0, "score": 11, "upvote_ratio": 0.63, "num_comments": 44, "comments": [{"body": "AWS is the dominant cloud player and growing rapidly. Yes they have competition, but cloud is a growing sector and there's enough room for competition. As someone who works in tech I don't see MSFT passing their market share anytime soon and even if they did it wouldn't necessarily be too concerning so long as AWS's growth remained strong.\n\nHigher wages and fuel costs impacts AMZN more than some of the other tech companies, but I worry about the other big tech players for other reasons. If there's a recession AAPLs earnings will drop significantly as people and business will be less likely to spend on high-end devices. Yes, AAPL has the money to weather the storm, but it will be a rough period for them. Another thing I worry about were there a recession is ad spend. Ad spend would also drop significantly in a recession and this would hurt FB and GOOG. Relatively speaking I think MSFT and AMZN are a bit more defensive at a time like this because cloud infrastructure spending is less likely to be cut.\n\nYou're right that AMZN has a slightly higher PE than other big tech names, but I would note it has a lower EV/EBITDA ratio than MSFT and at 21, it's roughly inline with what other big tech names are trading at. Relatively speaking many of the big tech names (AAPL, MSFT, GOOG) are trading at their highest valuations for many years while AMZN is trading at it's lowest in many years. FB is the only big tech name that looks more attractive from a valuation perspective, but it's also the lowest quality big tech name in my opinion.\n\nI'm just comparing relative risks and valuations of big tech names here. It's possible all of big tech is overvalued, but if I was going to buy a big tech name right now it would probably be AMZN. That said, I don't think you can really go wrong with owning AMZN, MSFT, GOOG or AAPL long-term. Near-term all of tech like much of the market is going to continue to struggle. If you're asking for a bull case for AMZN over the next 6 months I would agree it's hard to see, but over the next 2-3 years a strong bull case is there and this is probably one of the best times to buy AMZN in years.", "score": 19, "replies": [{"body": "Good stuff here. I guess I have been a bit worried about MSFT eating into their cloud market share since MSFT is already so huge in enterprise software, but it's probably unfounded as there is plenty of room for growth for everyone. I think I'll remain invested in both.", "score": 0, "replies": []}]}, {"body": "You're tripping. Amazon is gushing cash w no end in sight.", "score": 23, "replies": [{"body": "You didn't pay attention to the last earnings did you ? Except for The RVN investment and AWS , AMZN lost money.  And as the largest fleet operator in America. The soon to be 6$ gas isn't going to help them.", "score": 2, "replies": [{"body": "Did you reply to the wrong comment?", "score": 1, "replies": []}]}]}, {"body": "AWS is the cloud reference, and most big companies have at least two cloud vendors to work with. That is your bullcase. My bear case is not that they need to pay higher wages, but the fact that they treat their employees like crap, from the warehouse worker to top developers they are all treated worse than the competition and eventually it will bite them back, but that is not something an investor needs to worry today when the company dropped 20% YTD. Thing is with so many companies on discount today I would put money elsewhere.", "score": 7, "replies": [{"body": "Who told you they treat us like crap?", "score": 2, "replies": [{"body": "My friends and former colleagues who gave up on vested shares just to get out.", "score": 6, "replies": [{"body": "Why would you give up on vested shares?\n\nI think you meant granted shares, but you get grants on a rolling basis, as part of your total comp package. So yes, they had to give up on their salaries once they quit.", "score": 3, "replies": []}]}]}]}, {"body": "Don't forget high gas prices to throw in the mix.", "score": 6, "replies": [{"body": "And chip shortage.", "score": 4, "replies": []}]}, {"body": "I am concerned about this as well. Considering moving it to AAPL or SCHD. It would cause me to take a loss though.", "score": 5, "replies": [{"body": "Don’t go to APPL it may help for a split second but it’s very very inconsistent the best time to get APPL is right before they come out with a new product", "score": -12, "replies": [{"body": "I have 1100 shares of aapl.  It has been by far the most stable stock I own.  I will keep adding and holding.  Amazon is my second to worst performer.  So, I am thinking I may just suck up the loss for Amazon and buy more aapl while its down.  SE comes out today.", "score": 1, "replies": [{"body": "When I had appl it was very inconsistent so this is suprising to me thx for letting me know", "score": 1, "replies": []}]}]}]}, {"body": "https://www.ft.com/content/aaced9d6-5f2a-466d-aec1-b85c7572c1a3\n\n“We really don’t see a meaningful slowdown in customers moving to the cloud,” Selipsky said.\n\n“We’re really still near the beginning of the overall shift to the cloud,” he added, pointing to estimates that about 5 to 15 per cent of IT workloads have moved from companies’ own in-house data centres and on to infrastructure such as AWS, Google Cloud or Microsoft Azure. “In the fullness of time, the vast majority of them will move to the cloud.”\n\n“AWS, which was first launched in 2006, has long dominated its market. In its most recent rankings, IT research group Gartner estimates it has a 45 per cent share, more than double its next nearest competitor, Microsoft.”\n\nSo, only 5-15% of IT workloads have been moved to cloud so far. That’s a hell of a lot of room to grow into. Especially if you consider AWS is clearly the market leader, with the largest share of the market. Of course, it’s reasonable to assume that they will probably lose market share as the market grows, but there’s so much room for that market to grow that loss of market share probably won’t be too much of an issue, especially as AWS debatably has the best infrastructure of the largest cloud firms.", "score": 2, "replies": [{"body": "Very nice. AWS is what I like most about AMZN, so I'm thinking I'll hold onto it.", "score": 1, "replies": []}]}, {"body": "I’m not sure I agree with this, but I feel like tje bull argument is:\n\n“It’s Amazon”", "score": 5, "replies": []}, {"body": "I can’t speak for the stock price but Amazon is spending 6 billion to buy MGM studios. The company isn’t going anywhere anytime soon.", "score": 2, "replies": []}, {"body": "Yes..higher wages=>longer staff retention, decreased training costs\n\n\nA lot of people do get necessities from Amazon actually\n\n\n\n\n\nAmazon prime membership going up to $160\n\n\nPossible split", "score": 3, "replies": [{"body": "Higher wages are happening because they are forced to do it, don't think it will lead to higher retention.\n\nYes people do get necessities but many use it only for luxuries(such as electronics) which is true for most people I know, though I know this is anecdotal.\n\nA split would be nice.", "score": 2, "replies": []}, {"body": "> Possible split\n\nnot as long as jeff is alive", "score": 1, "replies": [{"body": "heh", "score": 1, "replies": [{"body": "I’m shook.", "score": 1, "replies": []}]}]}, {"body": "Higher wages is only good for skilled labor. A lot of the salary wages increases are going to ware house work where it is worse to have worker retention. It’s cheaper to pay people the minimum And have them quit and hire new people at starting salary. If they stay you then need to pay bonuses and raises. At a company with the size and scale of Amazon training costs are negligible and are a fixed cost. You’ll always be training new people. But if you keep all your workers then you need to keep paying them more over the years.", "score": 1, "replies": []}]}, {"body": "For earnings less than a month ago, Consensus EPS was $3.81.  Amazon was up against a tough YOY 4th quarter comparison because Dec 2020 had an “Amazon Day” and 2021 didn’t. 2020 4th quarter EPS was over $10.  Market figured that mark couldn’t/wouldn’t be eclipsed in 4th quarter 2021.\n\nEPS came in at $27.95.", "score": 0, "replies": [{"body": "iiuc, that EPS is misleading- it includes gains from RIVN.  If AMZN hasn’t divested, pull up a chart of RIVN and project how its tanking market value will impact next quarter’s EPS.", "score": 10, "replies": [{"body": "Even when you take the Rivian gain out, it was still double the consensus projected EPS", "score": 3, "replies": []}]}, {"body": "That was entirely from Rivian gains. Watch it go negative next quarter", "score": 2, "replies": [{"body": "it was not entirely. without the rivian gains they'd still beat the eps by far", "score": 3, "replies": []}, {"body": "It was not entirely from Rivian gains.  Saying that means you don’t know the actual numbers.", "score": 4, "replies": []}, {"body": "“Amazon posted profits of $14.3 billion, nearly doubling year-over year despite heavy spending in the December quarter, thanks to strong results in its cloud division and a gain of $11.8 billion in the value of its stake in Rivian Automotive following the electric vehicle maker’s initial public offering.”", "score": 1, "replies": []}]}]}, {"body": "Amazon broke out of a key trendline support yesterday. It could hit $2200", "score": 0, "replies": []}, {"body": "Higher wages for warehouse workers is not something to be included in a bear case for a company of Amazon's size. It's a benefit for them to not have a revolving door and wasting time with constant union concerns.", "score": 0, "replies": []}, {"body": "AAPL is a way better play. Just from the CEOs and top employees pay in comparison. Jeff does a lot of selling and has been for the sake of Blue Origin, which so far has little to show for it.", "score": -4, "replies": [{"body": "Jeff isn’t even the ceo anymore lmao", "score": 5, "replies": [{"body": "Didn’t say he was.", "score": 1, "replies": []}, {"body": ">Jeff isn’t even the ceo anymore lmao\n\nJust to share knowledge, A chairman is technically higher than a CEO. A chairman can appoint, evaluate, and fire the CEO. The CEO still holds the highest position in the operational structure of the company, and all other executives answer to the CEO.", "score": 1, "replies": []}]}]}, {"body": "Higher wages for workers: this is industry wide, better for whoever automates. Who's the best at automating warehouse work?\n\nConsumer spending down: possible but that's the point of locking people in with prime, and their selection wins when half the stores in your area are out of goods...\n\nMSFT/googl competitors: true for AWS. Amazon also created themselves an area to compete with Google (ads) and it's their fastest growing profitable business. Google wins search but Amazon is still the top place people search for buying things (Google loses there). It's a fight, you're right though.\n\nPe: doesn't matter really.\n\nYou're half right but dig into your ideas more, some could be bull cases too.", "score": 1, "replies": []}, {"body": "Warehouse automation will mitigate wage issues long term", "score": 1, "replies": []}, {"body": ">Higher wages for warehouse workers\n\nThey’re replacing workers with robots\n\n>Consumer spending power looks to be going down, people typically don't get their necessities from Amazon\n\nPeople do buy necessities from Amazon \n\n>AWS has some big growing competitors(msft and goog)\nAs I understand it, the cost of switching is expensive \n\nThey may face other headwinds but I don’t think these threee points are a strong basis for any thesis about the company.", "score": 1, "replies": []}, {"body": "Amazon is a dead company", "score": 1, "replies": []}]}
{"title": "Is it a good or bad time to start buying?", "selftext": "So I have been reading around on Reddit about the stock market since December and have not done any investing yet.\n\nBetween everyone’s different opinion on how the future will be with a possible economic shake up.\n\nBut from what I am seeing stocks have been on a downward trend from a high from covid.\n\nI don’t know much but my opinion is it might be a bubble that might pop but it seems like it has slowly been losing air instead of popping.\n\nIt sounds like it might go a bit lower for some stocks but it seems a lot of it will stay low for awhile and slowly increase until a normal upward trend.\n\nI am hoping we don’t have a recession and it seems more unlikely than likely that it will happen.\n\nI also have some money to invest still that is just sitting since I probably shouldn’t use it to buy a car and my government student loans won’t have interest for a few years.\n\nSo what should I buy into and where would I start Vanguard? Or something else?", "id": "t9ih45", "created_utc": 1646751112.0, "score": 11, "upvote_ratio": 0.74, "num_comments": 40, "comments": [{"body": "Don’t listen to Reddit.", "score": 19, "replies": [{"body": "Therefore, listen to reddit", "score": 6, "replies": [{"body": "Listen to Reddit, but don’t listen to Reddit.", "score": 1, "replies": []}]}]}, {"body": "I’ve been just DCA’ing regularly either weekly or bi-weekly.", "score": 7, "replies": [{"body": "What does DCA mean?", "score": 1, "replies": [{"body": "Dollar cost average\n\nEssentially: just invest on a regular/monthly schedule. Fixed dollar amount every month", "score": 8, "replies": []}, {"body": "Dollar Cost Averaging.  It’s a strategy that avoids trying to either ‘time’ the very top or the bottom.  Since that is a near impossibility to accurately accomplish.  For example: if you want to buy 20 shares of a company. Rather than buy all 20 shares at once, you could buy 5 a week for 4 weeks and ‘average’ out the cost you pay.", "score": 8, "replies": []}, {"body": "Go for VOO/QQQ or similar index ETFs, learn more about them, do DCA with it.", "score": 2, "replies": []}]}]}, {"body": "Here is the thing with Mr Market: If you buy cheap companies, with a big margin of safety -  economics can deteriorate and you still make good returns. \n\nBen Graham's strategy was deeply influenced by the 1929 crash and the great depression. So it does work. \n\nJust be sure to study enough. \n\nIf you buy into an ETF. Just DCA every month on auto pilot. Might loose money over a decade or even two, but if you have 30 years till retirement you should be fine.", "score": 6, "replies": [{"body": "I have more like 50 years to retirement", "score": 0, "replies": [{"body": "Just buy stocks every month. The fluctuations in price are relatively insignificant on that time horizon", "score": 7, "replies": []}, {"body": "How old are you? 15?", "score": 1, "replies": [{"body": "18", "score": 1, "replies": [{"body": "I’d suggest you try to retire earlier than 65, especially if you’re only 18. I’m 29 and just started investing last year in stocks and crypto and landed a great job(no college). If all goes well, I should be retiring by age of 55. But hoping it’s 50.", "score": 1, "replies": []}]}]}]}]}, {"body": "Good time. Sadly I bought Thursday. Oh well", "score": 3, "replies": []}, {"body": "some things are up, bad for buying. \n\nsome things are down, good for buying.", "score": 6, "replies": []}, {"body": "All stocks are going into a correction. Time to buy some good/growth stocks at the discount price. See the value of the company and decide. TBH it may go down even more pre-pandemic level", "score": 4, "replies": [{"body": "SPY 330 is not happening without WW3 or some kind of major black swan event", "score": 2, "replies": [{"body": "You forgot to include rates hike", "score": 2, "replies": [{"body": "Lmao", "score": 1, "replies": []}]}]}, {"body": "That’s what I was thinking which is why I would just buy a small amount to start with I guess", "score": 1, "replies": []}]}, {"body": "Good time to buy. AT&T is dropping because of a merger in the works. Making stock purchase affordable", "score": 2, "replies": []}, {"body": "check the charts. scroll out. check again. decide.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "A few problems with this. The average is around 16 and we’re currently around 23. So that’s not almost double, it’s not even 1.5x.\n\nThe other problem with this is that it takes into account years when stocks were way undervalued because very few people were in the market. I’m talking late 1800s/early 1900s when the S&P traded at like 6x earnings. It’s like comparing modern sports numbers to numbers from the 1800s. It’s not really useful.\n\nLastly, the growth rate and quality of S&P 500 companies is significantly higher today than it has been historically. When the largest companies in the index are growing at 20% and have 25% net margins you have to account for that. 50 years ago, the largest companies were growing at like 2-3% per year with much lower margins.", "score": 8, "replies": [{"body": "There are more positive factors as well though from a market standpoint: there was far less regulation then, there were yields on savings accounts, and the dollar was backed by gold.  Most importantly the world was far more delineated.  Countries sourced and manufactured their own goods.\n\nIt's not comparable in reverse either.  The PEs back then weren't suppressed by lack of participation, but by the fact that the stock market wasn't the only sanctioned means for passive income generation.\n\nAs such, the historical average is still applicable in my mind.  23x is still high.  It still applies.  Especially in a \"service based economy\".   PEs are far too high considering the lack of commodity company presence and production in the S&P.  People don't drop dead without internet.  But they do starve and die without food and water.  And without fertilizer there is no food and without natural gas there is no fertilizer.\n\nLooking back and saying that PEs were too low then in revisionist.  PEs are too high because there are no actual goods being produced.", "score": 1, "replies": [{"body": "So you’re effectively saying that without Russian natural gas we’re going to be sent back to the stone age? Food shortages may come in certain lower income nations. But this is not going to significantly effect the US. It has inflationary pressures in the short term, but it’s not going to cause any major issues and it’s certainly not going to cause people to lose the ability to feed themselves.", "score": 0, "replies": [{"body": "No.  I am saying that the price of food has a major correlation to the price of fertilizer.  Russia exports more fertilizer than anybody.  Scarcity of food drives prices higher.  Food is more valuable than tech.  Likewise, so is energy.  It will significantly affect the U.S. because there are major environmental headwinds on increasing supply.\n\nRestaurants and leisure take the first hits, then the poorest, and then upwards through the middle class.  The government steps in and says any profit is too much profit.  So a power grab.  And at best sideways movement on the S&P.  Profits won't be allowed to be maximized due to the immediate effect of what the profits have impact on.  As such, inflationary spiral due to lack of investment since there is no money to be made.  The entire situation is terrible.  Not stone age, but certainly not good for shareholder capitalism.  Especially due to the lack of will to navigate regulatory environments and reshore most of the commodity supply chain and manufacturing base.  It will take years not months to flush globalisation out of the U.S. and Europe and isolate bad actors.  And by then it likely won't matter.", "score": 1, "replies": []}]}]}]}]}, {"body": "I think it’s time for me to unsubscribe from this subreddit… 9/10 posts are “should I go all cash” or “is now a good time to invest”. I mean seriously…………", "score": 1, "replies": []}, {"body": "There’s a squeeze in USWS??? That’s usually a good time", "score": 1, "replies": []}, {"body": "Uvxy for when this shit crashes.", "score": 1, "replies": []}, {"body": "It is the best of times, it is the worst of times", "score": 1, "replies": []}, {"body": "Buy the market (like VT) and keep buying over time. Then it’s always a good time to buy.", "score": 1, "replies": []}, {"body": "Nobody knows flip a coin", "score": 1, "replies": [{"body": "„uıoɔ ɐ dılɟ sʍouʞ ʎpoqoᴎ„", "score": 2, "replies": [{"body": "Lol", "score": 1, "replies": []}]}]}, {"body": "It’s always a good time to buy. It’s always a bad time to sell.", "score": 1, "replies": []}, {"body": "Good time, I will add tomorrow", "score": 1, "replies": []}, {"body": "Best time was yesterday.", "score": 1, "replies": []}, {"body": "My friend. It depends what you are buying.", "score": 1, "replies": []}]}
{"title": "Top 5 stocks for to hold until 2030.", "selftext": "Lots of negative sentiment in the market as of late, justified none the less. Sure a lot of people are exiting the \nMarket or moving to so called ‘safe stocks’ and looking to get back into tech in the future. I’m however sticking with my plan, wether it’s the right move or not only time will tell.  \n\nAnyway, sold of some dead weight and averaged down into my highest conviction stocks. Sure, there’s more room to fall, and I’ll use my pay checks to average down. \n\nMy top picks to outperform the S&P over the next 8 years are as follows.\n\nGoogle \nTesla \nNvidia \nMicroStrategy \nTeladoc.", "id": "t9mg3l", "created_utc": 1646761634.0, "score": 14, "upvote_ratio": 0.73, "num_comments": 45, "comments": [{"body": "I still really like Apple, Microsoft, and Amazon.", "score": 22, "replies": [{"body": "Yup. MSFT and AAPL are smart stocks to buy and hold. Even with the sell off, they will climb back up again", "score": 9, "replies": []}]}, {"body": "SE, ABNB, CRM, MRVL, FB", "score": 9, "replies": [{"body": "SE at 50.", "score": 3, "replies": []}]}, {"body": "Google\nGoogle\nGoogle\nGoogle\nGoogle", "score": 16, "replies": [{"body": "Murica", "score": 1, "replies": []}]}, {"body": "Google I can go with, they have such a strong balance sheet they can weather almost any storm so you're essentially betting on them continuing to innovate at least enough to keep up with emerging sector trends in that period. \n\nI want to like Tesla but I can't make the numbers work. There is so much growth already priced in (price/book is at 28). It feels like it's a totally binary play - they become the biggest automaker in history and you do well, or you take an absolute bath when their market share tops out and the music stops. \n\nOther than tech I'd look at defence companies favoured in Europe. Basically all of Europe is looking at rearming which should mean strong order growth in 6 to 24 months given procurement lead times and decade long revenue streams.", "score": 7, "replies": [{"body": "You’re completely Ignoring batteries, Tesla won’t be known for making cars in 30 years", "score": 2, "replies": []}, {"body": "Main reason I’m in Tesla is for their developments in AI. They’re leading the field along with Google in my opinion and will fill a massive hole in Labour shortages with the Teslabot.", "score": 3, "replies": [{"body": "This sub is lost on Tesla, dw what you’re saying is accurate", "score": 4, "replies": []}]}, {"body": "> It feels like it's a totally binary play - they become the biggest automaker in history and you do well, or you take an absolute bath when their market share tops out and the music stops.\n\nHave you heard of Apple?  They do not have majority market share for phones, but they make most of the profit.  In 2030 Tesla will have 20-25% of the market, but 90%+ of the profits.", "score": 0, "replies": [{"body": "I'm not anti Tesla at all, I think they are doing extraordinary things and I want to be in on it, I just can't rationalise it to myself. The Apple comparison is exactly what I'm talking about. Apple is a company that has reached a point of terrific profitability, market share, track record, balance sheet, etc. for well over a decade to become both the most valuable and most profitable company in the world. Its price says investors are convinced it will continue to grow. There is no higher yardstick. Apple has a market cap 3x Tesla's while it's profit is 11x Tesla's. The gap between those two multiples is the amount of growth already priced in assuming Tesla reaches Apple levels of performance one day. Or in other words as a retail investor intending to hold the stock I'm going to pay the person I buy it from as though that growth had already happened, and only when it goes beyond that point do I see upside. It doesn't matter if the revenue comes from batteries, AI, robots or whatever, that's still the basics and it seems off to me.", "score": 7, "replies": [{"body": "It’s like comparing Apple to orange Teslas", "score": 1, "replies": []}]}, {"body": "So they’ll be twice as big in terms of market share as the current largest manufacturer, and do it in only 8 years. They’re currently not in the top 15. Don’t worry, the market will beat them raising their production 20x in 8 years. 100% reasonable projections!", "score": 0, "replies": [{"body": "Look at much less volume Tesla does and then look at how much money they make. They’ve already passed ford and gm is next", "score": 3, "replies": []}]}]}]}, {"body": "Well, here we go again. Downvotes incoming. \n\nEnergy infrastructure will almost certainly do well on a 10 year period. KMI, ET, ENB, etc.", "score": 7, "replies": []}, {"body": "INTC, PYPL, FACEBOOK, GOOGLE AND SHOPIFY", "score": 9, "replies": []}, {"body": "Pessimistic take: One of the 5 should relate to the ever increasing obesity in America … MCD, KO, YUM, STZ", "score": 3, "replies": [{"body": "Funny you mention obesity. My play is UNH….you’ll always need healthcare", "score": 3, "replies": []}]}, {"body": "FB JOBY GOOGL JNJ DIS", "score": 3, "replies": []}, {"body": "Zoom, Facebook, Alibaba, Coinbase, Astra Space.", "score": 3, "replies": []}, {"body": "Russian ruble all day", "score": 5, "replies": [{"body": "😂", "score": 1, "replies": []}]}, {"body": "It would be past 2030 for me.  #1 would be Google.  But really all the big five.  Google, Apple, Amazon, Microsoft and FB.", "score": 4, "replies": [{"body": "Why would you figure the largest companies would continue to repeat?  If you look at the largest companies in any decade and look at the next decade very few ever repeat.  It is more likely then not these will be the ones that DON'T outperform.", "score": 3, "replies": []}]}, {"body": "AAPL, TSLA, MSFT,", "score": 6, "replies": []}, {"body": "Can you outperform the s&p500 with buying just one of those stocks? Like google or Tesla? For guys like me who don’t have an awful lot to invest", "score": 2, "replies": [{"body": "Yes probably, with Google.", "score": 4, "replies": []}, {"body": "You could buy fractional shares?", "score": 2, "replies": []}]}, {"body": "AAPL\nMSFT\nTGT\nSQ\nAMZN", "score": 2, "replies": []}, {"body": "Google, Tesla, Amazon, and Berkshire Hathaway are run by very smart investors and business people. I can't really put anyone else in there, but I'm sure they exist. Howard Schultz of Starbuck's was another one.", "score": 2, "replies": []}, {"body": "MRVL, ABBV, PRU, EPD.", "score": 2, "replies": []}, {"body": "AAPL, MSFT, AMZN, LMT, and DM.", "score": 2, "replies": []}, {"body": "TESLA", "score": 4, "replies": []}, {"body": "SQ SHOP BABA TGT ABNB", "score": 1, "replies": []}, {"body": "I think Omni channel marketing and e-commerce will have a big growth period.\n\nSo goog, msft,pypl, adbe,CRM\n\nHm: amzn, shop, etsy", "score": 1, "replies": []}, {"body": "Lordstown motors is a no brainer if you are a risky investor.  Buy, hold and don’t listen to the noise.", "score": -7, "replies": []}, {"body": "PYPL, ZM, NIO, AMD, NVAX", "score": 1, "replies": []}, {"body": "LIT, SMH, SCHD, and SCHG.", "score": 1, "replies": []}, {"body": "APPL NVDA AMD GOOG MSFT", "score": 1, "replies": []}, {"body": "\"My top picks to outperform the S&P over the next 8 years are as follows.\"\n\nGood luck only 20% of all stocks outperformed the index in the last 10 year period.  So, you have a 80% chance of picking an underperformer.    Link below...\n\nhttps://www.morningstar.com/articles/1035348/how-many-stocks-beat-the-indexes", "score": 1, "replies": []}, {"body": "I agree on teledoc. It’s been taking such a beating lately too.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "t9q4qx", "created_utc": 1646771453.0, "score": 11, "upvote_ratio": 0.74, "num_comments": 40, "comments": [{"body": "Typically you’re advised to invest consistently no matter what the market is doing, for the long term.", "score": 25, "replies": [{"body": "So, does a three-fund KISS approach of SPY, LQDI and BCD look good? They have low exp ratio and seem not too volatile.", "score": 5, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "That was very enlightening, thank you. Not rude at all, I'm here for the knowledge!", "score": 3, "replies": [{"body": "Reddit threads are not best place to build a foundation of knowledge. You want to invest money, great. You can open a broker account in minutes and go shopping. It tempting to wade in and get started. But if it was as easy as looking at charts and expense ratios everyone would be rich. Personally I did exactly this under the guise of “getting my feet wet” and it resulted in three things:\n\n- I invested mostly in bonds mostly, so for three years thought my investments were safely trucking along. Later I realised, for my age, this was an overly risk averse position and I had lost three years worth of growth. \n- I wasn’t actually confident in my understanding to commit serious money (ie my savings).\n- I ended up investing in a U.K. equity fund (Woodford) which later was mismanaged and liquidated. \n\nIn 2020 I read a book called “Smarter Investing” by Tim Hale. While it’s not the bible, for those looking how to get started, it’s not far off. I recommend you read it before you commit your 140k and waste your time or lose money.", "score": 2, "replies": []}]}]}, {"body": "I’m not familiar with them. Why did you pick them?", "score": 1, "replies": [{"body": "1 yr return wasn't as bad as everyone else, low exp ratio, and the 10 year outlook did not look very choppy. I'm ignoring 3/5 years because of the recent growth.", "score": 2, "replies": []}]}, {"body": "I think this way: Since QQQ dropped 21% from ATH, it has potential to go same level in next 12-24 months. \n\nI would prefer to invest in QQQ, SMH, XLF for a long hold.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "QQQ has ER 0.2%, while VTI has 0.03, but see the growth side. When QQQ growth is faster than VTI growth, the effect of ER is penny side.\n\nI just go with index (\\^NDX) related QQQ as growth will be (IMO) too good. \n\nYou may please do your DD before investing.", "score": 2, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 13, "replies": [{"body": "So true! It pained me selling oil stocks today for 80-180% profit but it allowed me to buy low on a lot of other stocks; hope it all works out!", "score": 5, "replies": [{"body": "Smart move", "score": 3, "replies": []}]}]}, {"body": "You may want to check your math on the first one.", "score": 5, "replies": [{"body": "Thank you lmao \n\nAlso OP - what it all comes down to is no one can predict the short term. Only you know what you want in the long term. Invest accordingly - I am holding and have continued DCA'ing throughout the last couple months in companies I believe in. No one can guarantee you short term market results, unless you know some people in very high places. I cant speak to that though, so I invest and wait.", "score": 3, "replies": []}]}, {"body": "Why so much in bonds? You're so young mate... throw it into VTI, VOO, and VSUX and chill.", "score": 6, "replies": [{"body": "Was poor all my life. Afraid of downturns :D", "score": 4, "replies": [{"body": "That kind of mindset will keep you from getting rich. You must embrace **calculated** risk.", "score": 5, "replies": []}, {"body": "Fair enough but you don't need to be afraid of downturns for at least another 20 years. Get more conservative with bonds when you're closer to actually wanting to use the funds. I'm a bit younger than you (31) but personally I see zero utility for bonds in my portfolio for a looooong time.", "score": 6, "replies": [{"body": "Thanks for the advice, really appreciate it!", "score": 1, "replies": [{"body": "Caveat to the previous advice, you have to know yourself. Long term, throwing it in a well diversified basket of equities and you should have significantly more money after a couple decades. However, if the ups and downs bother you and you think you’ll panic sell, it may not be the best choice for you. The best thing would be to overcome that fear, but only you can judge if you can.\n\nEdit: typos induced by Apple predictive text behaving very differently to the Android I was used to.", "score": 1, "replies": []}]}]}]}]}, {"body": "The best time to buy is when everyone is selling.\n\nDon't invest in bonds. VTI should be your base  investment (60%). You can go riskier from there. And don't sweat a temporary loss. Just keep averaging down as you save more money.", "score": 3, "replies": [{"body": "How do you see VTI vs SPY?", "score": 2, "replies": [{"body": "They are overwhelmingly the same thing. VTI is the total US market, the S&P 500 is the largest 500 companies (which make up something like 85% of VTI).\n\nFwiw, if you’re not planning on selling options, IVV or VOO are slightly better S&P 500 funds as they’re lower cost in terms of management expenses. SPY isn’t exactly expensive, but it’s pretty close to a free lunch to go with IVV or VOO.", "score": 2, "replies": []}, {"body": "VTI is more diversified and has a lower expense ratio.", "score": 1, "replies": []}]}]}, {"body": "It’s the best time to buy when the market is down.", "score": 3, "replies": []}, {"body": "🤦‍♂️🤦‍♂️ you’re 35 fear should play 0 part of your investment strategy and so with they said keep it in savings because you can’t handle anything other than the safety of a bank.", "score": 3, "replies": []}, {"body": "I bought more VTI today,  gonna do it again next week,  and the week after that and probably keep buying it until I die :)", "score": 4, "replies": []}, {"body": "I'd say now is absolutely not the time to dump a lump sum into equities.\n\nOld money riding it out and only losing paper gains is fine, but if you lump sum now, there is a *substantial* risk that it immediately goes underwater and doesn't break even potentially for years.\n\nThe bottom is likely 3-15 months out, and it's unlikely that the market is going to rip out of it like in 2020, because nobody is going to be printing money.\n\nYou aren't going to miss a rip. Just be patient until we get a demonstrable bottom put in.", "score": 0, "replies": [{"body": "You are the definition of scared money.", "score": 4, "replies": [{"body": "Eh, not really.\n\nI buy and sell on a mean reversion strategy based on historical data. There's not much emotion about it.\n\nI called the top early last year, so it underperformed, but I'm beating the S&P500 significantly YTD so far because I have an 80% cash pile ready to deploy.  Even with the relative underperformance, it was still right in line with average expected growth.\n\nAnd I mean...I have some bags, too. It's not 100%.  I have some JETS and FLWS shares sitting at -40% that I'm still holding.\n\nI'm not fearful at all. If anything, I'm a little giddy waiting for what I can buy at a discount.\n\n(Right now, we're below where I went 80% cash, so I still consider it  good call, even if it wasn't perfect.)", "score": 1, "replies": [{"body": "Are you going to hold 80% cash for 15 months (your guestimation of the bottom)?", "score": 1, "replies": [{"body": "I don't have a timeline. It depends on how fast it declines to target deviations.\n\nE.g. right now, 2 StDev off the 10-year growth trend for the S&P500 is 3365.  2 StDev below the mean deviation from the 200-wk MA is 3480.  Those are good buy targets.  Fair value would be at-growth or at-mean (4000 and 4150, respectively).\n\nThe S&P 500 PE ratio is currently 24.37, but the trend (fair value) is at about 21, which would be S&P 3688. That's a fair value target.  Evercore has a prediction down to 3700 and Goldman down to 3600, so that's not a wild estimate.\n\nBut those are today targets.  All of the trendlines are increasing over time, so the longer the correction continues, the higher the targets go, unless we hit real crisis territory and the 200 weekly MA starts trending down (which hasn't happened since 2008).\n\nAlso, I still swing trade in and out of things that are hitting their own valuation targets regardless of what the general market is doing (e.g. I recently bought 3M).", "score": 2, "replies": []}]}]}]}, {"body": "Until the beginning of the recovery is just a dead cat bounce. Then a bull trap. Statistically, people don’t time this with any sort of regularity. Don’t become a statistic.", "score": 1, "replies": []}]}, {"body": "You'd rather wait until it's back to ATH to buy?", "score": 0, "replies": []}, {"body": "Maybe align some in gold among other ppls suggestions", "score": 1, "replies": []}, {"body": "I m 25% down, but in for long, now is time to buy, wait for few more days to see if it dips again after new Russia oil sanctions by USA, but buy n hold.", "score": 1, "replies": []}, {"body": "If it was me I would do something like:  70% SPY, 15% LQDI, 15% total bond fund.  Don't pick an asset allocation based on the flavor of the month economic issues (commodities).", "score": 1, "replies": []}, {"body": "keep in savings, wait until no turmoil, or DCA $500 each month for your amount for 20+ years, you get sure win.", "score": 1, "replies": []}, {"body": "I'm doing both. In the last real recession I continually tried to make some money (I don't do options, so that wasn't an option) and it was a waste of time. \n\nSo this time around I'm slowly getting back in but keeping way over 50% in cash and eventually some CD's. I'm retired, so this works for me.", "score": 1, "replies": []}, {"body": "None. Throw 25-50% of you money into VT which is a total world Index fund. Start out by maxing out your tax advantage accounts and keep buying biweekly until youre ready to retire. Many people here suggest VTI but that is only the US market which has outperformed in the past but in the future will probably underperform against international as the rest of the world moves into the middle class. VT has the US and the rest of the world and it has a tiny expense ratio of .08%", "score": 1, "replies": []}, {"body": "I’m in a similar position as you, with similar funds available.\n\nI am currently 100% cash and ready to start deploying. I’ve debated between individuals stocks, cross sector/industry etfs and consolidated portfolio of etfs and stocks. I’ve landed on the following:\n\nQQQ - 30%\nSPY - 30%\nGOOGL - 20%\nCASH - 20%\n\nI will average into each position. Each position large enough to sell covered calls against to generate passive income with exposure to the appreciation. \n\nDecided to consolidate due to simplification. I’m likely not going to beat the market with a portfolio of stocks, but I can match it and top it with option premium.", "score": 1, "replies": []}, {"body": "3*25% + 20% + 2*5% = 105%. Maybe try maths first and then invest 😅✌🏻", "score": 1, "replies": []}]}
{"title": "Tesla China February data: Wholesale: 56,515 Export: 33,315", "selftext": "", "id": "t9e18z", "created_utc": 1646735809.0, "score": 179, "upvote_ratio": 0.99, "num_comments": 43, "comments": [{"body": "Greater than November on a shorter month that has a holiday.", "score": 54, "replies": [{"body": "[This response](https://twitter.com/micjasaria/status/1501142872841592839?s=20&t=_tMICdRGLsyLVsx__8m2lw) makes some good comparisons according to different time scales:\n\nFebruary 2022: Wholesale 56,515\n> February 2021: Domestic 18.318 + export 5314 = wholesale 23.632\n\n> Q4 2021 first two months: 107.250 wholesale\n\n> Q1 2022 first two months: 116.360 wholesale", "score": 29, "replies": [{"body": ">Q4 2021 first two months: 107.250 wholesale  \n>  \n>Q1 2022 first two months: 116.360 wholesale\n\n&#x200B;\n\n![gif](giphy|8sZXkUPVwka3u|downsized)", "score": 24, "replies": []}, {"body": "Meanwhile Barron’s is running the headline “Tesla’s China sales dropped.  Tesla stock rose anyway”.  And in the article made the statement “Tesla’s February 2022 number increased more than 200% from the 18,318 sold out of the Shanghai plant in February 2021. The growth is impressive, but year over year comparisons aren’t that meaningful. “\n\nLike, the fuck!?", "score": 7, "replies": []}, {"body": "Thanks, there's effectively no possible comparisons to make Feb numbers look bad. Obviously could always be better but it beats every comparable metric.", "score": 4, "replies": []}]}]}, {"body": "Dunno how many days they lost due to holidays, with 3 days closed it’s like /25*365 =825k run rate.", "score": 19, "replies": [{"body": "Just to be clear, the above run rate actually get bigger with less days in the month and there are not 365 working days in a year, not even in China.\n\nAll in all, it seems that the Q4 forecast that just Shanghai and Fremont can easily accomplish 50% growth  production in 2022., actually closer to 1.4 M cars. If there are no more shortages or unexpected roadblocks, a bull scenario may easily go up to 1.7M cars in 2022", "score": 17, "replies": []}, {"body": "Based on comments from the Q4 call, I am starting to believe that Tesla in China is currently rate-limited by suppliers. Thus if they get more parts they can assemble more cars, even if less working days in the month. Big things ahead!", "score": 4, "replies": [{"body": "definitely supply limited", "score": 1, "replies": []}]}, {"body": "Consistent with recent months.", "score": 2, "replies": []}]}, {"body": "Makes sense. Short month and new year holiday.", "score": 13, "replies": []}, {"body": "https://twitter.com/kelvinyang7/status/1501108565184069634?s=21", "score": 12, "replies": []}, {"body": "What was expected?", "score": 9, "replies": [{"body": "Well depends who you are. If you are a super bull then in line to >50% growth yoy. If you are a bear then you should be scared specially if you were on the boat saying that Tesla growth story was going bust this year.", "score": 16, "replies": [{"body": "Can someone do safety checks on Mark and Gordon!", "score": 8, "replies": [{"body": "I called and they are not picking up, someone should really stop by their place....", "score": 4, "replies": []}]}, {"body": "😂", "score": 2, "replies": []}, {"body": ">If you are a bear then you should be scared specially if you were on the boat saying that Tesla growth story was going bust this year.\n\nHow could a person think this and also have the required intelligence to use a keyboard and communicate using language?\n\nImagine Tesla growth going bust.\n\nThey are better cars, that dont use gas, during climate change emergency times. (not saying you think that, just wondering how literally any non troll could think it)", "score": 1, "replies": [{"body": "Listen to Mark Spiegel, that dude just went short again. Somebody should put him in a suicide watch list", "score": 2, "replies": []}]}]}]}, {"body": "lol Gordon Johnson is back at it saying China has a demand problem and Tesla \"made a mistake by ramping another international plant (Germany)\". This dumbass shared a chart, which clearly shows the 1st 2 months of the quarter are for exports, while the 3rd is for local deliveries. Yet on the 1st and 2nd month of every quarter he claims China has a demand problem. How stupid can you be? Your own chart that you created shows that you are wrong.\n\nhttps://mobile.twitter.com/GordonJohnson19/status/1501134663749980160", "score": 9, "replies": [{"body": "Gordon’s not stupid, he’s a liar.  There’s a difference.", "score": 10, "replies": []}]}, {"body": "Is it good or bad?", "score": 4, "replies": [{"body": "It’s good, short month.", "score": 8, "replies": [{"body": "and Chinese New Year", "score": 10, "replies": [{"body": "Yes that too", "score": 1, "replies": []}]}]}]}, {"body": "How? February 28 days and Chinese new year? Man the Chinese workers are built different.", "score": 3, "replies": []}, {"body": "Demand cliff.", "score": 3, "replies": [{"body": "Watch them back pedal and saying that the cliff is next year because reasons.", "score": 7, "replies": [{"body": "Reminds me of Max Kellerman and the Brady cliff. He is gonna fall off a cliff. Goes on to play like 6-7 more years, every year a MVP level, goes to 3 more super bowls and wins 2.", "score": 1, "replies": []}, {"body": "But it is a cliff, they just got the perspective wrong. We are at the very bottom of this cliff.", "score": 1, "replies": []}]}, {"body": "Technically they weren’t all that wrong. However, they’re not at the top of said cliff looking to fall down, they’re at the bottom and ascending upwards.", "score": 5, "replies": []}]}, {"body": "This seems pretty good to me?", "score": 1, "replies": []}, {"body": "LOL. such great news threw us under $790 at opening", "score": 0, "replies": [{"body": "There's a few other things going on in the world affecting the stock price ya know...", "score": 1, "replies": [{"body": "nah, it's a nice green atm", "score": 1, "replies": []}]}]}, {"body": "Run rate > 1M !\n\n(56,515  +  33,315)  ×  12 = 1,077,960", "score": -6, "replies": [{"body": "Wholesale includes export.", "score": 12, "replies": [{"body": "Oh.\n\nOkay :-(", "score": 5, "replies": []}]}]}, {"body": "Anyone know how many days Giga Shanghai was operational in February?", "score": 1, "replies": []}, {"body": "For reference, last year for the month of February, they sold 18,318 vehicles. 210% YOY growth for February.", "score": 1, "replies": []}, {"body": "Hard to beat efficiency of Chinese manufacturing", "score": 1, "replies": []}, {"body": "So does that mean total production was around 56k or 90k?", "score": 1, "replies": [{"body": "56", "score": 2, "replies": []}]}]}
{"title": "Serious Question: “Priced In”", "selftext": "Why is it that only negative news is “price in”? \n\nExample: CPI is incoming and the common theme from the bullpen is “it’s priced in”. \n\nWell, on the flip side, what if all good news and upside has already been priced in? \n\nYou never hear anyone say, “well, I think all the upside is priced in already”, it’s ALWAYS about negative news and downward movement that’s “priced in”.  \n\nWhy? \n\nI’m curious what you highly sophisticated traders think about this, and look forward to hearing from the Rhodes Scholars of WSB.", "id": "t94mgo", "created_utc": 1646701510.0, "score": 22, "upvote_ratio": 0.78, "num_comments": 40, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|4 months ago\n**Total Comments**|106|**Previous DD**|\n**Account Age**|4 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=t94mgo)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=t94mgo)", "score": 1, "replies": []}, {"body": "This term is just news channel BS, they don’t have any news on rebounds so priced in is all they can say to calm down average jo", "score": 17, "replies": []}, {"body": "Its just idiots trying to sound like they know what they are talking about. No one knows what they are doing.", "score": 29, "replies": [{"body": "This sounds like the best answer. Now let's have the smartest idiot contest.", "score": 14, "replies": []}, {"body": "Trueeeeee", "score": 2, "replies": []}]}, {"body": "The market is directed by an enormous amount of factors but here’s my opinion on how it breaks down:\n\n40% Fundamentals - consisting of 20% profits/earnings reports and future earnings. 20% remainder is the uncertain becoming certain. This is the part that really makes up the argument for “priced in”\n\nThe other 60% of the market is purely psychological. It’s human emotion, FOMO, and typically can’t be quantified. This is the part of the market that makes everyone think it’s illogical and unpredictable.\n\nDepending on events and the lack of certainty, or the lack of emotion attached to the market, these weightings fluctuate.\n\nTypically though anytime something “uncertain” becomes “certain” or known, the market melts up because of a decrease in volatility, and a decrease in human emotion as there is now less “market anxiety” if you will.", "score": 7, "replies": [{"body": "Thanks for the explanation.  I completely agree with the psychological aspect of the market and really think that the retail traders that have been added to the market will only make emotions a more volatile catalyst in the future.", "score": 3, "replies": []}]}, {"body": "CPI isn’t priced in for over 8% inflation", "score": 9, "replies": [{"body": "Next month fuel prices will really hit the inflation measure. No so much this round", "score": 2, "replies": [{"body": "As someone who works in the energy investment sector I don’t think anybody knows what is coming. The administration things we can just drill our way out of this.  The problem is while we were under attack from green investment groups fighting for pension funds to cancel their energy investments Covid hit. Many of the companies I work with on a daily basis laid off a lot of their staff and those folks moved on to other sectors. We cannot hire enough people to drive trucks lay pipe and work rigs at the moment. Another problem is that even if you wanted to drill wells, there’s no where to buy the pipe. Unless you already have orders or can afford to put 50% down and wait six months you’re not getting it.  Please ignore any typos as this is all done with voice text and my redneck accent doesn’t mesh well with Siri.", "score": 11, "replies": [{"body": "[removed]", "score": 8, "replies": [{"body": "![img](emote|t5_2th52|4276)", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|4271)", "score": 1, "replies": []}]}, {"body": "All I heard was my buy more calls", "score": 1, "replies": [{"body": "Imagine not being long oil right now. 😬", "score": 5, "replies": [{"body": "Idk just ask Cathie wood 😂", "score": 2, "replies": [{"body": "![img](emote|t5_2th52|8881)", "score": 1, "replies": []}]}, {"body": "Too late for me imo but you guys have made me aware of what to look for next time to be an early investor.", "score": 2, "replies": []}]}]}, {"body": "id or ban, post your work identification badge with letterheard or you will be banned!", "score": 1, "replies": []}]}]}, {"body": "AGREED! But the number of folks I talk to you today that believe otherwise was astonishing.", "score": 1, "replies": []}]}, {"body": "The issue is that, since October 2021, there isn't any more new good news to price in.  That was the last time there was new good news to price in. Now only new bad news to price in that gets worse by the week. Hence most stocks go down.", "score": 4, "replies": []}, {"body": "Sounds like selective memory. Plenty of good news are priced in too.", "score": 10, "replies": [{"body": "I disagree, but nonetheless, thanks for the reply.", "score": 1, "replies": []}]}, {"body": "Did you not see the major indices today? They got absolutely slaughtered. I'm not understanding your point. More often then not good news gets the old \"priced in\" mantra.", "score": 2, "replies": []}, {"body": "Its a term for idiots that cant explain a dead cat bounce when in reality its just big money preping you for rug burn by IV crush", "score": 2, "replies": []}, {"body": "Negative feedback has a 5x impact on the human psyche.  In one study they looked at athletes they found wins sat with players for about 2-3 days, losses stayed on players minds for 14+ days (interestingly great athletes have very little difference between win/losses.  They have selective memory it seems).  This feedback loop has evolutionary roots, as negative has the ability to kill you, we are more preoccupied by loss and the negative.\n\nBecause of this psychological disparity we tend to \"price in\" negative news, as we always will let the losses weigh heavier than the wins.  What you are perceiving isn't wrong, but it does have deep psychological roots.", "score": 2, "replies": [{"body": "Now this is what I’m here for.  Thank you for that. I would also recommend that you look into the brainwave study recently done on Liverpool FC. It’s really interesting…", "score": 2, "replies": []}]}, {"body": "I think what’s not priced in is 0% GDP growth for the US in the first quarter. Stagflation is a real possibility that has no good answers. Powell done fucked up good and the instability he’s subjecting us to is criminal.\n\n [Here is the link the Atlanta Fed GDP NOW Estimate for Q1](https://www.atlantafed.org/cqer/research/gdpnow)", "score": 2, "replies": []}, {"body": "What does priced in mean? The other day I was walking down the street and saw $20 on the ground. Now a stupid ape would take the money but I'm a smart ape and know that the market has already priced in opportunities like this. Otherwise I'd be witnessing a violation of the efficient market hypothesis and we might have to admit that we don't have a particularly good model for predicting why markets behave as they do.\n\nSo, as a good and smart ape, I left the money. Some sucker is going to make a rookie error when he sees that money.", "score": 2, "replies": []}, {"body": "I hear all the time some piece of good news is already priced in. What are you talking about willis", "score": 2, "replies": [{"body": "I’d say it’s 8/1 negative to positive being “priced in” by talking heads.  Just my take Gary.", "score": 0, "replies": []}]}, {"body": "If you don’t think good news is also priced in, you probably shouldn’t trade anymore", "score": 2, "replies": [{"body": "Solid…", "score": -1, "replies": []}]}, {"body": "Everything is priced in, that’s the nature of the financial markets. People are mostly concerned about negative catalysts being priced in as it has the most serious implications right now. The question a couple weeks ago was if an invasion was priced in because that had huge downside potential. You could ask if positive news is priced in but usually instead of asking things like that people just ride the wave of good news.", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|8883)", "score": 0, "replies": []}, {"body": "do i have to say it\n$&$)$&&$&&@\"&$&))", "score": 1, "replies": []}, {"body": "It's all priced in, all the time", "score": 1, "replies": []}, {"body": "Upside DOES get priced in. This is why sometimes you see stocks run up right before earnings release.", "score": 1, "replies": []}]}
{"title": "Pfizer files form 25 to delist from the NYSE", "selftext": "[removed]", "id": "t9hrsi", "created_utc": 1646749068.0, "score": 0, "upvote_ratio": 0.35, "num_comments": 42, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|11 months ago\n**Total Comments**|545|**Previous DD**|\n**Account Age**|11 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=t9hrsi)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=t9hrsi)", "score": 1, "replies": []}, {"body": "Wow you belong here, top notch retard. Did you try to apply as a mod?", "score": 12, "replies": []}, {"body": "doesn‘t this just concern their 0.25% notes due in 2022 which it clearly states on the form?", "score": 11, "replies": [{"body": "Yes. OP fails at DD.", "score": 13, "replies": []}, {"body": "apparently yes.  I saw it being discussed, and just fired away.", "score": 0, "replies": [{"body": "my comment was obviously a rethorical question", "score": 1, "replies": [{"body": "Frank show your calls lol", "score": 2, "replies": []}]}]}, {"body": "part of my reason for posting is for someone smarter than myself to explain it.", "score": -10, "replies": [{"body": "go fuck yourself then. educate yourself you fucking donkey.", "score": 6, "replies": [{"body": "thanks have a great day!", "score": 1, "replies": [{"body": "delete the post\n\nand don‘t come back", "score": 0, "replies": []}]}]}]}]}, {"body": "why would they do that they were at their peak\n\nis it bc they dont think their stock can rise again or what?", "score": 4, "replies": [{"body": "I honestly don't even want to share why I think, as this entire thread will turn into a shit show", "score": 3, "replies": [{"body": "just say it nobody gives a shit about internet points and if ppl say that ur a retard but u were right in the end then u got the last laugh\n\nand if u are wrong then ppl will tell u why and so u know\n\nu got like nothing to lose but ur time to type out ur thoughts bb", "score": 3, "replies": [{"body": "Plandemic 😉", "score": 2, "replies": []}]}, {"body": "All my hugs.", "score": 0, "replies": []}, {"body": "New exchange?", "score": -1, "replies": [{"body": "interesting thought", "score": 2, "replies": []}]}]}]}, {"body": "\"Expires March 2018\"", "score": 3, "replies": []}, {"body": "Lmao you are stupid. This doesn’t mean what you think it means. Post history says it all too 🥴", "score": 2, "replies": [{"body": "Ummm they are delisting from the NYSE\n\nhttps://www.sec.gov/Archives/edgar/data/78003/000087666122000258/xslF25X02/primary_doc.xml", "score": 1, "replies": [{"body": "These are 0.25% bonds, smoothie. Do you know what those are?", "score": 1, "replies": [{"body": "What's with the idiotic smoothie comment. Wow you are sooo hip with the smooth brain comment. \n\nAnyways thank you. I missed it at the bottom and have never read one of these before.", "score": 0, "replies": []}]}]}]}, {"body": "Earlier sharp-eyed commenter spotted that this is only the 0.25% bonds due 2022.\n\nNothing to see here, folks.", "score": 3, "replies": []}, {"body": "The date says expires in 2018 in the top right lmao. Stop spreading fake fud", "score": 2, "replies": [{"body": "and the other date says 3-7-2022.  https://www.investopedia.com/terms/s/sec-form-25.asp", "score": 5, "replies": []}]}, {"body": "Lawsuits incoming", "score": 1, "replies": [{"body": "Yeah... them and MRNA are about to feel some pain.  \nWonder who benefits from this... NVAX and OCGN?", "score": 0, "replies": []}]}, {"body": "Wait what am I missing here? Is Pfizer really trying to delist? Why hasn’t their stock plummeted after hours yet?", "score": 1, "replies": [{"body": "no.  It was bonds which were paid off.  I shared it too quickly because it was the first time I thought I had ever found a scoop for WSB.  based on the HORRENDOUS safety data which they were forced to release recently, and wanted to hide for 70 years, I do not see a strong future for PFE.", "score": 3, "replies": []}]}, {"body": "Puts?", "score": 0, "replies": []}, {"body": "So wait, what happened? They aren't delisting?", "score": 1, "replies": [{"body": "the bonds were delisted.  But based on the first batch of documents they were forced to release (they tried to hide them for 70 years) the company won't be far behind the bonds", "score": 1, "replies": [{"body": "So you think the company will delist? Or people will just start to pull out ?", "score": 1, "replies": [{"body": "I think that once the truth about the pfizer shots given under EUA are known, and once the public figures out that pfizer themselves KNEW that they were causing harm, the execs will be lucky not to be dragged into the street and shot", "score": 4, "replies": []}]}]}]}]}
