{"title": "Clearly many many people borrowed money to buy Tesla shares, guaranteed to go up to 420.", "selftext": "[deleted]", "id": "95qj33", "created_utc": 1533765627.0, "score": 128, "upvote_ratio": 0.97, "num_comments": 43, "comments": [{"body": "No one on here would do something that retarded right? ", "score": 72, "replies": [{"body": "I saw another guy do that in wsb earlier today", "score": 64, "replies": [{"body": "https://www.reddit.com/r/wallstreetbets/comments/95otw7/just_borrowed_232k_at_600mo_interest_to_buy_623/", "score": 29, "replies": []}, {"body": "Yeah i seen that as well. And to make a profit of like 29k. I dont see the risk reward there but hey fuck em. Maybe it works out for em. ", "score": 24, "replies": []}]}, {"body": "https://www.reddit.com/r/wallstreetbets/comments/95fz7o/420_gain_for_118k_on_tesla_options_today/\n\nMoney came from taking out a second mortgage originally.", "score": 23, "replies": [{"body": "Literally bet the house, holy shit.", "score": 25, "replies": [{"body": "The house always wins, I've been to the casino enough times this man has a solid plan. ", "score": 5, "replies": [{"body": "That is smart, playing with house money", "score": 6, "replies": []}]}]}, {"body": "[deleted]", "score": 10, "replies": [{"body": "This got me thinking... can’t you?? ", "score": 6, "replies": [{"body": "I don't know about a woman, but you surely can fuck a fellow wsb cardboard house owner and discuss how you can take a mortgage on that cardboard.", "score": 4, "replies": [{"body": "More free money for Uncle Elon so you can upgrade to reinforced cardboard. ", "score": 2, "replies": []}]}]}, {"body": "You just lower your standards brah. Then you're good. Some ...technically \"women\" will even pay you for sex...", "score": 1, "replies": []}]}, {"body": "You should see someone about your gambling addiction. ", "score": 2, "replies": []}]}, {"body": "I bought Tesla fds ", "score": 2, "replies": []}, {"body": "when Elon can't get funding, he will be suing Elon's ass.", "score": 1, "replies": []}, {"body": "Lmfao wow. He shoulda took that loan and shorted it. Elon musty is going to the klink with a bag of long longs while his stock falls flat on its ass. ", "score": -6, "replies": [{"body": "This the real dd... long $TSLA!", "score": 3, "replies": [{"body": "To be honest im to big of a bitch to make any move on it right now. But if i were to get drunk and get on robin hood. I would absolutely short it. ", "score": 1, "replies": []}]}]}]}, {"body": "With so many YOLOing for $420 private sale & so many outstanding shorts about to get burned...It makes you wonder regardless of outcome if this could be a domino to start a larger financial market meltdown. ", "score": 26, "replies": [{"body": "\"I remember the crash of '18. It all started when the CEO of an electric car company trolled some shorts on twitter.\"\n\nThat'd be some shit.", "score": 66, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "u mean like trade wars?", "score": 4, "replies": [{"body": "What, the Chinese Iron Bank always collects on its debts?", "score": 3, "replies": []}]}]}, {"body": "Honestly it doesn't even sound that crazy compared to what's going on these days.", "score": 1, "replies": []}]}, {"body": "TSLA doesn't have the market cap to sway anything.     \n    \nEven TSLA-related stocks won't be affected by any of this. ", "score": 4, "replies": [{"body": "I think he's right tho. There's an attitude, or exerburence, if you will about financial markets now. People, except for r/personalfinance, are hungry for risk.", "score": 2, "replies": [{"body": "Hey c'mon, let's be fair: personalfinance takes risks all the time. They take the risk that their pathetic returns are outpaced by inflation. ", "score": 7, "replies": []}]}, {"body": "plus us tards can afford to lose our bets without changing our economic habits", "score": 1, "replies": []}]}, {"body": "One side is bound to get shafted but you have a perceived finite promise of a 10 percent buy out garuantee from musk. The contingencies have yet to see the light of day... ", "score": 2, "replies": []}]}, {"body": "Idk how you can be *that* sure of an investment. It's not the amount that scares me. It's the loan. ", "score": 3, "replies": []}, {"body": "This guy is an idiot", "score": 2, "replies": []}, {"body": "Oh man. This can’t be real. ", "score": 2, "replies": []}, {"body": "is any tsla priced under 420 just free money at this point?", "score": 2, "replies": [{"body": "No, otherwise the share price would be at or very close to $420.  There is no guarantee that Musky will get the shareholder vote to take $TSLA private.  And he might be full of shit to squeeze the shorts anyway", "score": 4, "replies": [{"body": "funding is secured tho", "score": 7, "replies": [{"body": "But the shareholder vote to actually allow him to take $TSLA private isn't", "score": 3, "replies": [{"body": "No, funding is secured. You have to understand ", "score": 10, "replies": [{"body": "Funding is secured", "score": 6, "replies": []}]}, {"body": "if you own shares in tsla you obviously have a secret man crush on elon. they don't want it to end but they'll never say no to him", "score": 5, "replies": []}]}]}]}, {"body": "yes, minus a multiplier reflected by *odds of this happening*", "score": 2, "replies": [{"body": "memes always come true most of the time", "score": 1, "replies": [{"body": "of course, I have no doubt this shit will happen. There are certainly enough billions in the world to want to take this private; I bet they're lining up at the door. ", "score": 1, "replies": []}]}]}]}]}
{"title": "Spotify Doomed to fail (Due Diligence​ inside)", "selftext": "Spotify is going to tank at least 67% in 1-3 years. My Due Diligence.\n\n**Disclosure: I am trying to get a margin account to get approximately $5000 in long puts but the process of getting a margin account is taking a while.**\n\n*“The streaming services have a bad situation, there’s no margins, they’re not making any money,” he said. “Amazon sells Prime; Apple sells telephones and iPads; Spotify, they’re going to have to figure out a way to get that audience to buy something else.”*\n\n*-Jimmy Iovine (head of apple music & former prolific music industry exec)*\n\n**I want to warn investors that Spotify stock will fall and I suggest everyone short spotify (long put or short stock).**\n\nCurrent short interest: Approx 1.32%\n\nCompetitors Streaming: Spotify (Premium and free tier), Apple Music (Premium), Youtube Music (Premium and free tier), Soundcloud (Premium and free tier), Tidal (Premium and free tier), Pandora (Premium and free tier), Amazon music (Premium), Prime music (free w/ Prime), Deezer (Premium and fee tier).\n\nBuying Music: Itunes, CDs\n\n**Facts to understand before Due Diligence:**\n\n“2/3rds of all music sales comes for three companies”\n\nLabels: Universal, Warner, Sony\n\nIn the Itunes era Steve jobs forced the pricing of singles at $1. In the music streaming era, Labels/Artists and Publishers/Songwriters/Composers get paid fees when music is streamed called: Performance and Mechanical. Most of the rates are determined by Pseudo-government back entities except for the performance fee for the labels/artist, which is negotiated (still not even a penny). The economics is that Music Suppliers( artist/labels/publishers/songwriters/composers) all complain that they make absolutely no money, ie Taylor swift meltdown b/c of spotify, Tidal being created.\n\nStreaming Services have two tiers free and premium. Free tiers make absolutely no money for Music suppliers. Another thing about the music industry is that music streaming companies negotiate their own payouts with labels/artist. To give an idea on the payout rate Tidal>Apple>Spotify>Youtube. Youtube pays a paltry amount and the argument is if music is banned on Youtube people will post unofficial songs anyway then no money will made and Youtube will not be sued because (I can’t find the exact phrasing online) Youtube is a new innovative medium and is therefore protected in both European countries and the US from liability. Therefore Youtube has very low payouts becauses ads amount to very little revenue. Spotify has 75 million Premium members and 95 million members in its free tiers. The free tier dilutes the amount of money Music suppliers get. Apple music has 50 million users including free two month trials and has no free tier, which means it pays the most out besides Tidal.\n\n“90% of its revenues from premium service subscriptions and 10% of its revenue from advertising via the company's free, limited-access service.”-Merrill Lynch on Spotify\n\n**Due Diligence**\n\nThe facts are very important to understand before making an investment decision. The music industry is beginning to grow again but revenue is at approximately 18 billion compared to 24 billion in 1999 (not including live performances). What does this mean? The internet has almost decimated the profitability of the music industry. Artist are unhappy and so are record labels with how much they get paid to the point that new legislation is constantly being introduced through lobbyist to reform the music industry.\n\n**Porter Five Forces**\n\n**Supplier Power**\n\nLabels/artists are suppliers who are forced to accept lower amounts of money for their music because of the internet BUT will still be insanely tough negotiators for their music. Not having control of your suppliers is bad for profits. Since streaming services can’t create music/ successful artist, they will essentially never have control over their suppliers.\n\n**Competition**\n\nNext the industry has has numerous competitors and is looked at as a value added service for larger companies ie google, amazon, apple. Therefore a lot of competition makes negotiating power with music suppliers very bad especially if there is an industry leader, Apple, which does not have a free tier which means they pay more per stream. This means labels have a strong negotiating power when dealing with Apple’s competition. Spotify’s size is replaceable in the long term and therefore their negotiating power based on their size is severely mitigated.\n\n**Substitute Product**\n\nA substitute product for streaming is illegally downloading music or just listening to youtube. Therefore, raising prices of the streaming services from $9.99 is impossible b/c dont want consumers to leave platforms. Also, Steve Jobs is notorious in the music industry because he was able to negotiate $1 per song on the guise that it was a way for the music industry to recover from napster. However, when given the option consumers no longer bought albums with undesirable songs, which caused a rapid decline for the music industry. Therefore, Apple will probably not budge for a while with raising its 9.99 price anyway because Apple is focused on the happiness of its consumers on iphones and macs not labels/artists or making money on streaming.\n\n**Buyer Power**\n\nThe nail in the coffin for Spotify is that all music streaming platforms have the same content. Because exclusive music content is negative for PR, Apple has moved away from it. Spotify could never really afford exclusive content from the get go. Therefore, all music streaming platforms have the same content and the only way they can really differentiate themselves is through music curation, which is very trivial for most consumers and I suspect all services will have a huge curation focus eventually.\n\nFurthermore, switching costs from platforms are very low and there is only monthly subscriptions.\n\n**Fin**\n\nWhen spotify’s multi year deals current streaming rates with labels end, they will be drained of all profits they believed they were eventually going to make after negotiating. Spotify’s only real value is that they have 200 million people who use their platform. There business will however never run a profit. I would value Spotify’s eventual subscriber of paying and non paying users (est up to 280 mill) at 3-10 billion dollars (valuation includes 10% of Tencent Music ownership). Therefore my best case scenario estimate is that spotify is **320%** overvalued. Therefore, I recommend long term puts and shorting before earnings. If you have any long position on Spotify you have been **warned**. This industry is worse than the airline industry.\n\n**For more info**: Here is an excellent article that has a wrong opinion but has great facts to better understand the numbers of the spotify and the streaming industry.\n\nr/[http://www.goodwatercap.com/thesis/understanding-spotify](http://www.goodwatercap.com/thesis/understanding-spotify)\n\nUniversal sells 100% stake 600 mill, Warner unknown stake, Sony sells half stake for 750 million.\n\nEdit: Correction Warner sells entire stake for 500million, Universal has an unknown stake", "id": "95rft7", "created_utc": 1533772566.0, "score": 19, "upvote_ratio": 0.68, "num_comments": 43, "comments": [{"body": "I stopped reading when you said you have a hard time getting margin for $5k.", "score": 72, "replies": [{"body": "Lost me at $16B after the Age of Piracy being a \"decimated industry\"  \n  \nEdit: To add  \n  \nFree users earn just as much money for music creators/owners as premium users, if not more. 1 premium play = 1 free play. And have you heard about this little thing called ad revenue? Free users probably make more for Spotify.  \n  \nCompetition in the industry is not a bad thing yet. Amazon music is garbage and a prime add-on, Apple music is only preferred by iPhone users (a small % of smartphone owners), and did you really include Deezer in this conversation??  \n  \nSpotify is popular because it's cross-platform, has basically everything, and is a solid service.  \n  \nAlso technicals really don't matter for new companies. It's all shit momentum which Spotify has tons of.", "score": 8, "replies": []}, {"body": "[deleted]", "score": -33, "replies": [{"body": "I have $12 in assets, I’m 12 and use RobinHood.", "score": 44, "replies": [{"body": "Hooo leee fucking shit. I died laughing ", "score": 10, "replies": []}]}, {"body": "R/iamverysmart", "score": 39, "replies": []}, {"body": "How many dicks?", "score": 18, "replies": []}, {"body": "If you have 55k in assets, why are you using margin to buy puts? ", "score": 17, "replies": [{"body": "[deleted]", "score": -18, "replies": [{"body": "Robinhood son. ", "score": 18, "replies": []}]}]}, {"body": "Merrill Edge is horrible for getting approved for margin. I got approved overnight at TD Ameritrade with $10k in my account", "score": 2, "replies": []}, {"body": "I have 56k in assets, I'm 21 and I use mommy's JP Morgan private banking.", "score": 1, "replies": []}]}]}, {"body": "I remember when this sub was gung ho on shorting it on IPO day. Good times.", "score": 24, "replies": [{"body": "I don't remember that. I remember people splooging over M I L L E N I A L S who only use spotify or some super top mind dd. classic wsb", "score": 2, "replies": [{"body": "https://www.reddit.com/r/wallstreetbets/comments/89fusv/spotify_makes_its_nyse_debut_at_16590_per_share/", "score": 2, "replies": []}]}]}, {"body": "Spotify merged subscriptions with Hulu and opened up the way for podcasts to be the cleanest podcast source with exception to Apple app.\n\nI think Spotify will tread water or rise. This is a market where $Snap exists.\n\nAlso, trying to secure $5k margin for this?", "score": 13, "replies": [{"body": "Spotify makes less money when merge will subscriptions with HULU... Also podcast are very accessible through ie soundcloud or apple for FREE... Difference is there is only one SNAP, there are tons of Spotify clones...", "score": -8, "replies": [{"body": "Spotify currently has a price to sales of 6, with revenue doubling in the span of two years, if they maintain similar growth and equal price to sales the stock price could easily double. Keep in mind Netflix, another market leader in entertainment industry, has a price to sales of 11. I would be greatly surprised to see a market leading growth stock to be trading below a price to sales of 5. You are suggesting Spotify will hit a price to sales near 2. I am sorry but that is simply ridiculous. What is more realistic is a possible 15% pullback, honestly even that could go either-way, as it could also easily go up another 15%.", "score": 6, "replies": [{"body": "In OPs worst case scenario opinion, couldn’t one of the leaders just buyout spotify and cause the PPS to go even further..? Idk I thought OP raised some points but it is without a doubt the most well known streaming source specifically for music, at least from what I’ve seen. ", "score": 1, "replies": [{"body": "If Spotify were to be bought by a company it would be a tech giant, possibly Amazon or Google. It is not about the service really, it is more about the name and popularity.", "score": 1, "replies": [{"body": "Yeah thats why I dont see it going down anytime soon. ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Spotify calls.got it", "score": 12, "replies": [{"body": "Would've been a good call too lol", "score": 1, "replies": []}]}, {"body": "Wow all this DD and you couldn't settle on 69%? I can't trust anything you say.", "score": 11, "replies": []}, {"body": "This is a very bad idea buddy. I'd really recommend you do not buy puts. You're gonna get fooked.\n\nIndustry is growing 30% a year without signs of stopping.\n\nSpotify grew it's paid subs by 10% last quarter.\n\nThey have a 95+ retention rate, it's higher than netflix's.\n\nThey'll turn 6 billion this year - 7+ billion next year.\n\nThe free service is not there to make money, view it as marketing budget - it has a 40% conversion rate (Free sub becomes a paid almost half the time)\n\nMusic industry grew 8% last year, growth is increasing. Streaming caused this turn around - the studios love streaming. \n\nAll streaming platforms have the same content... until they dont. Spot will be in a position to sign it's own artists and increase margin.\n\nSpotify has started to venture into touring artists associated with it's popular playlists - which has been very successful so far.\n\nYoutube cannot be banned but the 'value gap' as it's known is the primary issue for the studios to tackle. Spotify pays the music industry $20 per user, youtube pays less than $1. Industry wants to team up with streaming platforms to win users from youtube. \n\nMain point is that just because a company loses money now, or will do for the next few years, does not mean it will lose money for ever. Companies based on distribution have a tipping point... once they turn profitable, there's no going back and they start printing money. Yes there are shite tech companies out there (see snapchat) but Spotify is not one of them", "score": 8, "replies": [{"body": "Just wanted to add that Baillie Gifford American B class - one of the top performing mutual funds of the last 15 years, and is currently on a tear, added 12,000,000 shares over the last 2 months.", "score": 3, "replies": []}]}, {"body": "I actually think you’re right. I think Spotify is insanely over valued. The only thing that’s driving this stock is growth (like oh so many stocks). That’s all investors care about at this point in time. There’s a lot of competition out there and as long as they’re growing the user base the stock will continue to rise. However, that will only last so long. Eventually investors will want to see them implement a strategy for turning those users into profits. They’ll need to figure out how to turn a profit at some point. At what point that ends up being, is up to investors. To be successful they’ll need to dominate the industry, like a Netflix, and figure out how to better monetize their users (maybe they’ll be able to leverage their user numbers in future negotiations? They pull in ad revenue from their free users. How much, I have no idea.). It’s definitely a tough road ahead imo, BUT they’re adding users and establishing themselves as THE  music streaming service. They’re also engaging in strategic partnerships that are aimed to help engrain them into your life. At this stage they’re doing what they need to in order to grow. That’s all that their  investors care about right now. These next few years are definitely going to be interesting (look at Netflix, Tesla, etc) Good luck, I think it’s a toss up. I wish I had the balls to short them. ", "score": 4, "replies": [{"body": "Agree 100%. But I just don't know the right timing to short. So I'm not putting money in.", "score": 1, "replies": []}]}, {"body": "Oddly enough, stumbled on this article. Haven’t dove into it yet, but it’s looks to be Spotify’s take on how they will compete/survive.\n\n[Spotify’s Playlist for Global Domination (not a sounding link)](https://www.fastcompany.com/90205519/spotifys-playlist-for-global-domination) ", "score": 3, "replies": []}, {"body": "Wow as a full-time musician I never ever would have guessed anyone would ever say this. Spotify is the bee’s knees. I get so much value from that app it is stupid.  I’m on vacation right now in Bosnia and Hercegovina with my wife’s family and I’ve been jamming to 70’s and 80’s Bosnian classic rock with my friends here on Spotify. They have everything. You can download and listen offline, you can make and discover others’ playlists. My first job 2 days after I get back is a wedding where I will have to play specific requests during breaks. I’m sending our set lists to the band now via a Spotify playlist.  I used to use multiple platforms to achieve all of this since I didn’t always make as much but this one $600 wedding will pay for my subscription for quite awhile. Then the next day I will do it again. I know I’m a power user but Spotify is the shit. You can claim that spending a dollar means you get to keep the song forever but the only way you would be saving there is if you listened to the same songs over and over. One gig is 40+ songs. The average person knows thousands. I dunno y’all just trying to give my DD after putting the zillion hours and 15 hard ass years of studying and music school and all that ish. I know other ppl don’t need as much as I do but you should cuz music is the shit. ", "score": 4, "replies": []}, {"body": "Hey /u/KeyserSoze275 your post is now on the [WSB DD list. Click here to read more DD.](https://new.reddit.com/r/wallstreetbets/search?sort=new&restrict_sr=on&q=flair%3ADD).\n\nIt's important that anything marked DD is useful information for other traders. No shitposts, short and vague guesses, unexplained news links, etc. If you misused the flair please change it so people don't come here and be disappointed. You might be banned otherwise.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "$AAPL LONG TIME ", "score": 1, "replies": []}, {"body": "i used to think spotify was great until i switched to google play. Bigger catalogue of the random artists I listen to compared to Spotify which at times do not have the full discography and it also comes with youtube red, no commercials. ", "score": 1, "replies": []}, {"body": "Wow, you are very retarded.", "score": 1, "replies": []}, {"body": "Their employees agree with you. Read this: [https://news.ycombinator.com/item?id=13570707](https://news.ycombinator.com/item?id=13570707)", "score": 1, "replies": []}, {"body": "Great DD. Spotify is great service but not so great a company. \n\nOnly hope is they get bought out but even then all the established players have already invested billions in their own services. ", "score": 1, "replies": []}, {"body": "Something that has always bothered me about spotify is that I am paying $5 a month (student discount) for the access to music. It bothers me that if I so chose to leave the service, I will no longer have access to music. At that rate, I rather spend $5 per month buying music and keeping it forever. I am also only paying for it once as opposed to being perpetually tied to a subscription service. ", "score": 0, "replies": [{"body": "But then for the first year you only have access to 60 songs? 120 songs in two years. That's obviously a terrible model. The streaming music services are here to stay IMO. Spotify might not make it but the idea does for sure ", "score": 6, "replies": []}, {"body": "You can extract your library/playlists from Spotify.\n\nhttp://www.playlist-converter.net\n\nI used this when I migrated from Spotify to Apple.", "score": 1, "replies": []}]}, {"body": "This is a great insight to the music industry and specifically Spotify. \n\nTwo questions:\n\n1: What sparked the flame for such due diligence and what was your process for acquiring such valuable information which most investors are unaware of?\n\n2: Why have you blessed us with such valuable due diligence? Do you not understand the purpose of this sub (whether this is sarcastic or not is totally up to the reader).\n", "score": -6, "replies": [{"body": "I’ve heard this same thesis on Motley Fool a couple of times, usually with Pandora as well. It’s probably right, but who knows when the dominoes fall and if Spotify doesn’t reinvent something along the way to get around this obstacle.", "score": 5, "replies": [{"body": "I thought the internet destroying the music industry was an amazing insight. I never really realized. But not being able to control your suppliers never ends well long term. I don’t see a viable path to profitability for Spotify unless they reach some sort of exclusivity with artists, which is nearly impossible to do.", "score": 0, "replies": []}, {"body": "Difference is pandora market cap is 2 billion. Spotify is 32 billion. Also I didn't write this in the article but Spotify did a direct listing, which when I wrote this article I realized it was like Spotify were trying to hide these insights from banks, IMO.", "score": -2, "replies": [{"body": "You don’t hide stuff from banks, you hide it from auditors. Banks charge fees for IPOs.  You fuckin autistic?", "score": 6, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": " gotcha, so its a selfish motive😂 perfect for WSB", "score": 1, "replies": []}]}]}]}
