{"title": "Everybody right now", "selftext": "\"I won't jump in till the market starts doing well again\"\n**Market starts doing well**\n\"I'm afraid to jump in, everything is overvalued and too expensive, I'm gonna wait for a crash\"", "id": "7w52qx", "created_utc": 1518099572.0, "score": 178, "upvote_ratio": 0.95, "num_comments": 105, "comments": [{"body": "This is why you just buy every month and hold, dollar cost averaging. ", "score": 97, "replies": [{"body": "I did that for awhile. I'm not so sure about things now so I'm doing the following.\n\n* cashed out of shorter term things\n* took profit where capital gains are to be had\n* shifted tax advantage accounts into more bonds (shift back if things crash hard enough; not withdrawing soon)\n* pay down debts instead of investing (had low rates)", "score": 7, "replies": [{"body": "Problem has been bonds; shitty issues with even shittier yields. It's been tough for a good long while now.", "score": 1, "replies": []}]}, {"body": "Yeah you were investing in 2000 and the years before. The stocks kept falling and people kept on buying the $VISA's of that day. Guess what. They lost millions. \n\nI am just saying, play each stock to its merit not \"oh.. it dipped.. buy!!\"", "score": 19, "replies": [{"body": "Are you comparing Visa ($V btw, I can't find an actual $VISA) a worldwide, established, profitable company with shit like pets.com? ", "score": 11, "replies": [{"body": "Trust me there were plenty back then. Visa is a good stock for growth but anyone telling you any stock is bullet proof has not been investing long enough. There were stocks that everyone said HAD to be growing and so they kept buying and the suffered. My point is do not blindly buy stocks thinking they'll go up FOR SURE. ", "score": 1, "replies": []}]}, {"body": "Just buy a total market fund and it won't be a concern.", "score": 2, "replies": [{"body": "Look at a company like AMD. They are an actual company, they make a huge amount of computer chips. Decent investment right? Well in 2000 they hit $50. They got close to that again before the 2008 recession. But normally they reside in the 5 to 10 dollar pricing. Even now at $11.22 they have a p/e of 347!.\n\nBuying an index fund when you have to own such overpriced stocks doesn't make sense to me, and certainly didn't make sense in 2000", "score": 1, "replies": [{"body": "Wait I'm confused, are you saying don't buy an index fund because of the behavior of one specific stock? That argument doesn't make sense to me.", "score": 3, "replies": [{"body": "Why would you buy an index fund that has companies in it that are above your risk tolerance? Maybe just buy the companies that have lower p/e especially in the current economic environment ", "score": 1, "replies": [{"body": "What do you mean? The whole point of investing in index funds is to spread out the risk specifically so you avoid the situation you described with AMD. Pretty much any broad market index fund is going to be much less risky than any individual company stock, with the possible exception of Berkshire Hathaway (or other similar companies.)", "score": 2, "replies": [{"body": "So it's like having a peanut allergy so you just buy 1 of every thing at the grocery store that way the chance of eating peanuts is pretty low. Or you could just buy the groceries you want?", "score": 1, "replies": [{"body": "No, that analogy doesn't work at all for multiple reasons. The biggest one is that in your situation the penalty for eating a peanut is the same, an allergic reaction. Whereas in my scenario having one bad stock in a fund has very little impact on the price of the fund. ", "score": 1, "replies": [{"body": "Well if you only have a mild peanut allergy it's no big deal.  You will just throw away the peanuts and write it up as a loss.  At least you didn't have to go shopping since you just had them send you 1 of everything.", "score": 1, "replies": [{"body": "I'm not really sure what you are trying to say. The analogy makes even less sense if it is a mild peanut allergy.", "score": 1, "replies": [{"body": "Why's that?", "score": 1, "replies": [{"body": "In the index fund scenario we are talking about owning a bad stock. Owning a bad stock individually is horrific for the owner. On the other hand owning an index fund that happens to include that same bad stock as part of it's portfolio isn't nearly as bad because the bad stock is only a small part of the portfolio. \n\nIn your grocery store analogy the penalty for buying the peanuts individually or as part of a large group of other groceries is exactly the same, you have an allergic reaction.\n", "score": 1, "replies": [{"body": "> In your grocery store analogy the penalty for buying the peanuts individually or as part of a large group of other groceries is exactly the same, you have an allergic reaction.\n\nNo, if you have a mild allergy you just throw away the peanuts.  People with mild peanut allergies can go to a grocery store that sells peanuts without an allergic reaction.  They can also have bagged peanuts delivered to their house along with 1 of everything else.  They just have to throw it away or sell it to their neighbor at a loss, because they don't want it.  \n \nSimilarly I don't want to own every stock in an index fund, I prefer to have control over what I own just like when I go to the grocery store.\n\n>Owning a bad stock individually is horrific for the owner. \n\nWho said you should only buy one stock? \n\nIt's not healthy to eat 100% carrots as your diet either.  But that doesn't mean you should buy 1 of everything from the grocery store.", "score": 1, "replies": [{"body": ">No, if you have a mild allergy you just throw away the peanuts.\n\nThis is another reason the analogy doesn't work. You can't throw away a stock  \n\nIn your original comment you were using the example of one particular stock (AMD) as a reason to not buy an index fund. My first response was just pointing out how silly it was to disparage an entire index fund based on the performance of a single stock within the fund. \n\nNow after re-reading one of your later comments I see that what you are actually suggesting is that an investor should invest in a bunch of good companies rather than an index fund (please correct me if I am wrong.)\n\n There are a couple of flaws with this idea:\n\n1. You have to purchase the stocks of an awfully large number of companies to get anything even close to the low level of risk involved in a large index fund. This means that an investor is going to have to invest multiple thousands of dollars in a large number of transactions. By contrast a investor can in invest like $200 in an index fund in only one transaction.\n\n2. In your idea you also have to be able to successfully pick the good companies. This requires a good amount of due diligence. Most people do not have the time or desire or ability to do proper due diligence on enough companies to be well diversified.", "score": 1, "replies": [{"body": "Buying an index fund does not make you well diversified.  You need gold/commodities, bonds(muni, treasury, corporate), foreign investment(developed, non developed), and real estate(local, abroad).  \n\nI get your argument that an index fund is easier, just as it is easier to have the grocery store send you 1 of everything as opposed to learning and choosing the right foods for you.\n\nAnd essentially you can throw away a stock by short selling it if you own an index fund. Not everyone knows how to do that though so I get it.  \n\nPersonally I'd rather just pick and choose like at the grocery storem", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "You’re making my point for me. Index funds have far less risk than any one individual company. ", "score": 1, "replies": [{"body": "Obviously it depends on the company. Since the index fund had some very risky companies in it it would be more risky than the least risky company in that fund.", "score": 1, "replies": []}]}]}]}, {"body": "Please don't make me remember that...", "score": 0, "replies": []}]}, {"body": "This is what I do, and I've found I don't even get concerned with the day-to-day anymore. Very liberating. ", "score": 7, "replies": [{"body": "Yep, and as long as you rebalance the portfolio every year - you're golden.", "score": 5, "replies": []}]}, {"body": "DRIPs are great for that.", "score": 2, "replies": [{"body": "Yep.", "score": 1, "replies": []}]}, {"body": "Dollar cost averaging is not the most efficient way but it works because it's built on a system of discipline. You don't want to dollar cost averaging in a bear market. The problem is most people don't know how to determine the trend. ", "score": 0, "replies": [{"body": "Most people don’t know how to predict the future. Yourself included. ", "score": 18, "replies": [{"body": "Don't have to predict the future to determine the trend. As I was telling someone on Tuesday, the confluence of resistance made a failed reversal a high probability. You increase the probability of success when you trade with the trend. \n\nhttps://www.reddit.com/r/stocks/comments/7vsb0f/the_main_reason_for_friday_and_monday_dip_was_due/dtuwx96/", "score": 5, "replies": [{"body": "So how far down are we going after today then. I think S&P500 hits 2650 then tanks even more.", "score": 2, "replies": [{"body": "2580 then 2540 if that fails. Trend just turned negative so it's going to neutral or downside action until the next major support level unless the fundamental picture changes", "score": 2, "replies": [{"body": "Good call. Looks like it hit 2640 then right down to 2580.\nI think we're in for another 5% - 7% decline this week.", "score": 1, "replies": []}]}]}]}, {"body": "I can tell you the market is going to drop tomorrow\nMost of us can see reality ", "score": 3, "replies": [{"body": "The spending bill is mostly for the military.  Increasing military spending didn't work for Bush.  Their only chance to prevent a recession was to put that money in domestic infrastructure, but the vast majority will be funneled to a few defense contractors.", "score": 1, "replies": [{"body": "Yep. LMT, BA, RTN, HRS and ITA. Got em' all over the last few months  so it'll work for me. ", "score": 1, "replies": []}, {"body": "I'm a God of War now \n\nMarket summary > Raytheon Company\nNYSE: RTN - Feb 9, 2:43 PM EST\n203.01USD **Price increase 4.42 (2.23%)**\n\n\n\nShares US Aerospace & Defense ETF (ITA)\nNYSEArca - Nasdaq Real Time Price. Currency in USD\n\n**189.44+1.09 (+0.58%)**\n\nMarket summary > Northrop Grumman Corporation\nNYSE: NOC - Feb 9, 2:46 PM EST\n331.12USD  **Price increase7.29 (2.25%)**\n\n\nMarket summary > Lockheed Martin Corporation\nNYSE: LMT - Feb 9, 2:58 PM EST\n337.21USDPrice **increase2.91 (0.87%)**", "score": 1, "replies": []}]}]}, {"body": "I buy my portfolio whats cheap for the given year and maybe buy some others to try to balance it out if its taking a big chunk of my portfolio eventually.", "score": 1, "replies": []}]}, {"body": "i thought DCA is not good in an uptrend but good in a down trend? ", "score": 2, "replies": [{"body": "Buying the dip while an asset is reverting to the mean in an uptrend is good. Moving your money to other assets is good in a bear market. DCA was something peddled by Motley Fool during the dot com era as an easy way to beat the market. DCA works only if the intrinsic value of the asset you're buying is higher than the price of the stock. ", "score": 5, "replies": [{"body": "Whoa, that's radical. Did you go to Wharton? ", "score": 2, "replies": [{"body": "No but I did stay at a Holiday Inn Express last night", "score": 4, "replies": []}]}]}, {"body": "No, you should mindlessly do the same thing no matter what the reality of the world is ", "score": 2, "replies": []}, {"body": "The whole point of DCA is you do it no matter the trend...", "score": 1, "replies": [{"body": "yes but if you have a large sum its better to put it all in as early as you can in an uptrend. and in a downtrend if you DCA you lose less ", "score": 2, "replies": []}, {"body": "For people who can't be trusted to save. ", "score": 1, "replies": []}]}]}, {"body": "It works really well for the people administering your funds. If it weren't for dollar cost averaging you'd see your balance going down AND they make less in fees. ", "score": 1, "replies": []}, {"body": "I don't know why you're being downvoted. There have literally been tens of studies showing DCA is full of shit, and if you're too lazy to do the research of which stocks to buy, lump sum investing (buying a SP 500 fund at a given time of the year) is superior to DCA every month or whatever period you decide to use. \n\nGod I really fucking hate 90% of homo idioticus sometimes, if our species vanished off the face of the Earth I wouldn't blink an eye.", "score": 1, "replies": [{"body": "Due to the ease of DCA, many people \"invest\" using the strategy. They take it as a personal attack by pointing out the flaws in a strategy they may implement.", "score": 1, "replies": []}, {"body": "> God I really fucking hate 90% of homo idioticus sometimes\n\nI'm thinking the average IQ here is below the mean. onow what DCA actually is and think throwing good money after bad is a bright idea. ", "score": 0, "replies": []}]}]}, {"body": "You hold until it crashes... ", "score": 1, "replies": [{"body": "I buy more. I got balls of steel when it comes to buying in down markets. I made out quite well in the 2008-2009 financial crisis. ", "score": 1, "replies": []}, {"body": "[removed]", "score": 0, "replies": [{"body": "what?\n", "score": 1, "replies": []}]}]}, {"body": "Only if you wait on a big sum of money right now and wait. If you invest X% of your paycheck every month then no, that's not DCA.", "score": -3, "replies": [{"body": "I might have the wrong idea about DCA, but why would investing a set amount every month not be DCA?", "score": 6, "replies": [{"body": "It is DCA. by definition.", "score": 2, "replies": []}]}, {"body": "How is investing money on a monthly basis for 30 plus years regardless of the market performance, not dollar cost averaging?", "score": 4, "replies": []}, {"body": "> If you invest X% of your paycheck every month then no, that's not DCA.\n\nI don't think you understand what DCA is.", "score": 5, "replies": [{"body": "I don't know how to format but here it is... From Wikipedia:\n>\"Dollar cost averaging is not the same thing as continuous, automatic investing. This confusion of terms is perpetuated by some articles (AARP,Motley Fool) and specifically noted by others (Vanguard). The argued weakness of DCA arises in the context of having the option to invest a lump sum, but choosing to use DCA instead. If the market is expected to trend upwards over time, DCA can conversely be expected to face a statistical headwind: the investor is choosing to invest at a future time rather than today, even though future prices are expected to be higher. But most individual investors, especially in the context of retirement investing, never face a choice between lump sum investing and DCA investing with a significant amount of money. The disservice arises when these investors take the criticisms of DCA to mean that timing the market is better than continuously and automatically investing a portion of their income as they earn it. For example, stopping one's retirement investment contributions during a declining market on account of the argued weaknesses of DCA would indicate a misunderstanding of those arguments.\"\n\n\nSo carry on with the downvotes now...", "score": 2, "replies": []}]}]}, {"body": "Not the most efficient way to invest, and quite frankly its a waste", "score": 0, "replies": [{"body": "If you have a long-term outlook, it is efficient. Take emotions out of the equation, pick a low-fee index fund, and just keep buying. Time is your friend.", "score": 1, "replies": []}]}, {"body": "Right. If I invest $ in the market next month and at the end of the month it's worth $90 I should repeat that every month because \"TIME IN THE MARKET BEATS TIMING THE MARKET\". Even when it's a falling market\n\nDo that every months and you'll have an average of $90. Don't do it and you'll have an average of $100. \n\nLike a gambler who bets more after every hand he loses so he can recoup his losses. ", "score": -1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "> dollar cost averaged in\n\nROFL \n\nBuy high sell low. ", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Absolutely, yes. Now go away ", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "All these different screen names are MOSTLY different people, not the same person\n\nThe ~10% perma bears are not “everybody”", "score": 14, "replies": []}, {"body": "I am personally guilty of this, I dont sell but I strictly buy really stable stocks when the market is dropping, instead of the volatile ones I'd buy if it was good.  So instead of catching something taking a large dip I accrue \"safe\" stocks.", "score": 10, "replies": [{"body": "Who is safe, exactly? ", "score": 2, "replies": [{"body": "Low PE companies with stable dividends.  Boring stocks.", "score": 14, "replies": [{"body": "Would you mind sharing your fav stocks? Or any index or ETF you like that represents this? SCHD?", "score": 1, "replies": [{"body": "Bank stocks tend to be pretty conservative and go up with interest rates.", "score": 1, "replies": []}]}]}, {"body": "Companies that have long track records and quite likely dominate their market. \n\nBA, Microsoft, Costco, Visa etc. \n\nMany bank on Amazon too, but I feel currently it’s a debatable buy at the price. \n\nI work in digital marketing and saw the catalyst that caused Amazons current growth - they entered google shopping advertising. They’d previously written it off and stuck to search advertising and now they’re shitting on all retailers globally. \n\nThey jumped from 0% market share to 40-50% across some big international retailers I work with and caused all sorts of destruction. \n\nA lot of people don’t have that context though, so they assume it’ll continue to rocket.\n\nThey’re also causing damage to some brands by causing a race to the bottom. \n\nI think amazons long term goal is to dominate google advertising and force retailers into amazon advertising instead. It’s a dangerous game. ", "score": 3, "replies": [{"body": ">  they entered google shopping advertising. They’d previously written it off and stuck to search advertising and now they’re shitting on all retailers globally.\n\nDoes this mean that they never showed up in Google shopping ad before? Did they have some kind of a deal?\n\n> They jumped from 0% market share to 40-50% across some big international retailers I work with and caused all sorts of destruction.\n\n40% market share of the supplier for these retailers? Care to explain a little on this please?\n\nThis actually sounds like good reasons to be bullish on Amazon.", "score": 3, "replies": [{"body": "Amazon did their own research and concluded that search advertising, the text ads you see on google, was their best avenue. End of Q3, they decided that was wrong. \n\nThey previously held no markshare in the shopping ads, the pictures with prices, and absolutely exploded on the scene by November. \n\nShopping is a huge revenue driver and success is typically dictated by the price. Naturally, amazon destroys its competition here. \n\nI think the expectation of another surge is priced in, but amazon isn’t likely to replicate another boom like that. It’s like a initial boom from a retailer doubling their number of stores.\n\nI therefore am cautious on amazon. Add in that some of my clients are going to brands telling them that amazon pricing strategy is destroying their brand and it could go tits up. \n\nOf course, I am certainly not trying to say I know better than the market. Price is often dictated by more factors than the sample size I have access to. \n\nFor me, I’m going to avoid until it drops further then invest. Amazon long term will certainly be a winner. \n\nIf amazon is able to dominate google advertising and force retailers onto its own advertising platform, t generate a huge amount of revenue. \n\nThat’s assuming google doesn’t do something about it though. ", "score": 2, "replies": [{"body": "Amazon is doing well because it operates with very small margins.  There e-commerce business isn't very profitable at the moment.  Walmart has higher margins.\n\nAnd I don't see them being able to raise costs.  People go to Amazon because it's cheap, if a company like Walmart is able to undercut them (with ecommerce) customers will flee.\n\nAWS is very profitable for Amazon though.", "score": 2, "replies": [{"body": "Enron used to operate on really small margins, too.", "score": 2, "replies": []}, {"body": "That's my point, they're driving retailers on to their own advertising platform.\n\nOne of the retail clients I worked with saw more money come through Amazon than their own site in some countries. That was a huge YoY difference. \n\nWe're talking movements like YoY marketing costs up 40% whilst YoY revenue down 30% etc. Amazon really shat on some industries this year when they went into Google shopping. ", "score": 1, "replies": []}]}]}]}]}, {"body": "Think JNJ", "score": 1, "replies": []}, {"body": "GE, only goes down so you know exactly what you are getting.", "score": 1, "replies": []}]}]}, {"body": "Ive found that with a couple years of experience, Ive been mostly chill about the markets. Sometimes I get up in the morning and sip my coffee and watch  the the seas of red. Other times I get up and watch my profits soar. Overall Ive been able to remind myself that its just money, and whatever happens happens. As long as the fundementals are there, Ill keep holding. ", "score": 8, "replies": []}, {"body": "I bought into the S&P 500, the fact that stocks are at pre-tax reform levels tells me it's a good buy. Although tax reform was somewhat baked into stock prices by the time it passed, actually passing it should have a big effect that is not now reflected in stocks. ", "score": 3, "replies": []}, {"body": "I made money from grubhub!", "score": 3, "replies": []}, {"body": "Hopefully this is the double bottom before the stocks head back up higher and then I'll be laughing about my profits after this.", "score": 4, "replies": [{"body": "I hope so too ;_; I bought some on Monday after the baby dip and regretted it hahaha. Still gonna buy some today, and just holddd", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Good luck with your time machine.", "score": 17, "replies": []}, {"body": "All major Tech companies have provided very good earnings, when is that correction supposed to happen if they keep on growing? Might still be a few years. ", "score": 11, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Doesn't that only mean that their future growth is priced in? Does it really matter if the stock hits the value its supposed to have in a year now or in a year? ", "score": 0, "replies": [{"body": "Problem is a lot of these have earnings for the next 10, 20, 30 years baked in.", "score": 1, "replies": []}]}]}]}, {"body": "then you'll be waiting for a very very very long time", "score": 4, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "The Nasdaq has gone from 7505 to 6983 since Friday, a ~7% drop. If the Nasdaq goes down another 15-20% you can @ me.", "score": 2, "replies": [{"body": "That will happen in ten days at this rate.", "score": 2, "replies": [{"body": "Right, because past performance is a predictor of future results. /s", "score": 2, "replies": [{"body": "ofcourse not. but.... staircase up, elevator down.  Look at weekly on spy.", "score": 1, "replies": []}, {"body": "You're right of course. Since I made that comment the market has fallen even further. It's now five days away.", "score": -1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I will be messaging you on [**2018-08-08 21:50:29 UTC**](http://www.wolframalpha.com/input/?i=2018-08-08 21:50:29 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/stocks/comments/7w52qx/everybody_right_now/)\n\n[**CLICK THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/stocks/comments/7w52qx/everybody_right_now/]%0A%0ARemindMe!  6 months) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! dtyc7z8)\n\n_____\n\n|[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/)\n|-|-|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "[deleted]", "score": 22, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "For the market to drop an additional 20%  you would need an economic disaster to occur, which currently, has no indication of happening. ", "score": 5, "replies": []}, {"body": "Does this apply to CCP Index funds/ETF choices ?", "score": 1, "replies": []}]}]}]}, {"body": "Do not base off insane highs, base off you think it should be. ", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Exactly. This isn't a correction. This is a tiny dip. We are all waiting for the real correction. *Then* it's time to buy.", "score": -1, "replies": []}]}, {"body": "Doing well?", "score": 1, "replies": []}, {"body": "I'm making my shopping list to buy some more dividend growth stocks. I should be loading up in a week or two.", "score": 1, "replies": []}, {"body": "People can only see as far as tomorrow. If you are investing for the long haul just take a portion of your paycheck and keep buying. I came to the realization I won't touch my stocks until I retire so I rebalance during times like these. Went to cash a week ago and now I'm rebuilding a new portfolio slowly. If it keeps going down then yay! Just building more future potential. Dividend yields become greater. Patience and being able to block out the noise. Also embrace the lessons the market is teaching right now. Pay attention to all the moving parts.", "score": 1, "replies": []}, {"body": "Crash", "score": -1, "replies": []}]}
{"title": "R-E-L-A-X", "selftext": "Even with this latest plunge, the Dow is still 200 points above where it was at its lowest on Tuesday.  If it loses another 1,100 points, we'll be taken back to the dark, dark days of...mid November, 2017.  We've been in store for a correction, and now's as good a time as any for it given consternation about inflation and bond rates.  Even if the Fed does raise rates PE ratios, on the whole, would still be roundly better than they were not too long ago.  \n\nUnemployment is low.  People are buying shit.  Fundamentals are the best they've been in a decade plus.\n\nIf you're on this sub you're probably in it for the long haul anyway.  So,\n\nR-E-L-A-X.", "id": "7w7roj", "created_utc": 1518121051.0, "score": 348, "upvote_ratio": 0.93, "num_comments": 222, "comments": [{"body": "Pretty certain it's time to keep adding to my portfolio. I've got 30 years till retirement. Time is my best friend. ", "score": 155, "replies": [{"body": "Catching a falling knife is always tricky, but I’ve usually enjoyed it even if it moves lower from there.\n\nThat being said, stock prices are out of whack with earnings these days and the fundamentals say this market is nearly as overvalued as it was in 1999 and 1968.\n\nOr at least it was before the new tax rates kick in. That should help dampen the fall.", "score": 25, "replies": [{"body": "Well good thing the market still went back up after 1999 and 1968, those in it for the long haul have nothing to worry about", "score": 7, "replies": []}, {"body": "> Or at least it was before the new tax rates kick in. That should help dampen the fall.\n\nOr hasten the recession. Ultimately inequality can only get so high before the next recession. The middle class isn't buying more because they are much wealthier, they are buying on credit, some of them thinking their taxes would be cut in half. Instead interest rates are going to have to rise to pay for all the extra debt the tax cuts give the wealthy.  Ultimately the tax plan enriches shareholders who won't shy away from parking their money in foreign assets once peak consumption hits and the recession starts.\n\n", "score": 23, "replies": [{"body": "That tax cut stimulus deepens the debt, and now they are saying it will cause inflation that causes the next recession. All the while no real benefits for the middle class, except maybe a 1 month stock market boost. That measly tax cut people receive would be eaten away by inflation. Tax cuts don't do anything if the rest of the market doesn't comply. Would be sad if the tax cuts are so poorly timed it does absolutely nothing.\n", "score": 7, "replies": [{"body": "I think you're wrong, tax cuts will make a huge impact and we haven't seen anything yet. Let it adjust and then watch it grow to heights we can't imagine. Don't miss out. Max out before late April.", "score": 3, "replies": []}]}]}, {"body": "No it’s not just invest in things that actually make money. ", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "The Nikkei is a poor measure of overall market performance. It's price weighted, like DIJA. The performance of the Nikkei index isn't representative of the overall stock market or economy of Japan.", "score": 3, "replies": []}, {"body": "The Minessota Fed Governor thinks Japan did it right and he's more and more vocal. He wants to raise bank capital requirements and otehr things. He smiles at the prospect of a market decline ", "score": 2, "replies": [{"body": "but why tho?", "score": 3, "replies": [{"body": "He hates America. He's a Bernie Bro", "score": 4, "replies": []}]}]}]}, {"body": "[deleted]", "score": -9, "replies": [{"body": "Send us the memo when you know at what time it’s supposed to bottom.", "score": 25, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "it does if you know what to look for.", "score": 2, "replies": []}]}, {"body": "people don't want to hear your honesty, they only want to hear that it will all be ok and they will be rich one day!", "score": 4, "replies": []}]}]}, {"body": "Youz guys need an economic model. Stocks don't live in a vacuum with P/E the only variable. \n\nPresent Value of a stream of income. What else effects that?   Think, Think.\n\nIf the cost of capital goes up does that impact growth, the growth that went into forward loking P/E estimates. \n\nMore than 1 moving part folks", "score": 44, "replies": [{"body": "Are you talking about the opportunity cost of holding equities when bonds are becoming more attractive?\n\n", "score": 5, "replies": [{"body": "I'm talking about earnings not being all that matters. Yes traditional bonds, especially long maturity bonds,  are down.\n\nOf course there's the basic opportunity cost of holding a depreciating asset. Can't sell because the stocks going do0wn? That money might be better somewhere else rather than just eroding.  ", "score": 3, "replies": [{"body": "Especially when margin accounts are the highest in history.", "score": 5, "replies": [{"body": "That's not going to help \n\n            ", "score": 4, "replies": []}]}, {"body": "Bond yields are up.  I mean it's what you would expect when you increase the supply of bonds to pay for all the extra debt. \n\nOwning any US based asset might be a bad idea right now though.  The dollar keeps falling and I don't see it going back up any time soon. We have much less respect internationally and other countries are preying on that.", "score": 1, "replies": [{"body": "Oh come on. They finally respect us after the weakling Obama ", "score": -16, "replies": [{"body": "Russians like America more. They actually liked Bush better too.  But basically every other country preferred Obama.  Also for whatever reason both Bush and Trump saw the dollar decline under their watch. Obama saw it strengthen.  A small part would be reduced tourism, buy ultimately I'd say it was the expansionary policies of Bush and Trump.  Spending a lot of money on new wars hurt the dollar.  Trump wants to spend a lot on a wall and is spending more on servicing government debt.\n\nAlso who is weaker than Bush?  I mean the guy didn't even attack saudi arabia after their citizens attacked our country .  He couldn't even get bin laden. The weakest president ever", "score": 5, "replies": [{"body": "every other country smiled at Obama as he gave away everything. \n\nNo one respects some who has no self respect.\n\nYep, Bush made the biggest blunder in modern American history ", "score": -3, "replies": [{"body": "I mean obama didn't triple the deficit like reagan.  In fact obama cut the the operating budget debt down considerably.  So he didn't give away our country like the fiscally liberal republicans.  Not to mention none of his supreme court picks voted for unlimited bribery.  Those were all republicans who gave away the country to the highest bidder. \n\nAlso bush didn't just get confused and invade the wrong country.  It wasn't a blunder. He's own treasury secretary said Bush asked his whole cabinet to help him find a connection to Iraq. This was something he wanted to do long before he lied about WMD's. It's not a blunder if it is a contrived, calculated, lie.\n\nSo why do you think the dollar did better under Obama than the last two republicans?", "score": 5, "replies": [{"body": "I'm not actually reading past the first sentence. This is for /r/ploitics or /r/thedonald \n\nLet's leave the politics out of it and just stick to insulting each other over finance ", "score": -1, "replies": [{"body": "If you think finance isn't affected by deficits tripling under republicans then you are wrong. If you think finance isn't affected by spending trillions on the Iraq war instead of domestic infrastructure you are more wrong.  \n\nDo you really think that politics doesn't affect the stock market? I think you might have a serious deficiency in reasoning.\n\nAnswer the question: why did the dollar do better under oBama than Bush or Trump?  If you can't answer that you have no business being involved in finance.  Just give your money to someone else to manage.", "score": 3, "replies": [{"body": "Seriously, Go back to /r/politics", "score": 0, "replies": [{"body": "Seriously.  You are blissfully ignorant if you think politics doesn't affect the stock market. Look at the spending bill the republicans pushed today.  It is mostly military spending.  How well did that work for the stock market under Bush?  ", "score": 2, "replies": [{"body": "Stop stalking me you freak", "score": 1, "replies": []}]}]}]}]}]}, {"body": "So you think insulting every other country except Norway will get you respect? We live in a world that is getting more and more closer to each other. Respect others is the only way moving forward.", "score": 2, "replies": [{"body": "Some countries are shitholes.  No one insulted 'every other country except Norway'. Only extreme lefties are offended. Now takes this crap back to /r/politics ", "score": 1, "replies": [{"body": "Anything against Trump you think is lefties, you are what, 2 years old old man? I am not from this country, I am not lefty. I am only telling the truth about how other people think about your president.  Shut up your hole and learn something asshole. ", "score": 3, "replies": [{"body": "That's articulate", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "If you start looking at the entire stock market as a whole with different metrics, because the old and consistently great metrics show you something you didn't like, maybe you're just trying to not see the truth.\n\nP/E is not a great indicator to see if something is overvalued in a specific sense, maybe operating cash flow is better because they have a ton of assets relative to the market cap, and depreciation kills its P/E. Maybe it's focusing on growth and is not trying to become profitable. But as a market as a whole, P/E is a great indicator to see if a market is overvalued. And it's screaming that right now. \n\nHistorical average is like a P/E of 15, but we're at like 32. So a 50% correction is very realistic. But that is terrifying to many people, so the market likes to pretend it's not a correct metric and pretend the crash won't come. Yet every single crash before, P/E was a great indicator. Why does today get to be different?", "score": 2, "replies": [{"body": "> If you start looking at the entire stock market\n\nYou have to look beyond the stock market", "score": 2, "replies": []}]}]}, {"body": "ohmagod.. panic panic panic.\n\n(lowkey I'm actually looking for a good entry point for some cash I have parked so keep discounting this shit for me)", "score": 30, "replies": []}, {"body": "Be greedy when people are scared and scared when people are greedy 🙃", "score": 39, "replies": [{"body": "WTF everyone around me is greedy AND scared!", "score": 55, "replies": [{"body": "*looks at portfolio* \n\n“What if I’m just sad?” ", "score": 26, "replies": [{"body": "Well then that makes me happy, I guess.", "score": 3, "replies": []}]}, {"body": "That’s me :D", "score": 2, "replies": []}]}, {"body": "Flash Sale!", "score": 8, "replies": []}, {"body": "There is way too much optimism yet. We've only been reset a few months, when people were still saying the market was highly overvalued. When the market is starting to set investors back by years, that's the time to get greedy. ", "score": 12, "replies": [{"body": "I agree with you. I was just being lighthearted with my post given the whole bitcoin ordeal and the market lately. Personally I think it’s way too soon to get greedy; the market hasn’t taken a real “hit” and a correction seems very likely sometime this year. ", "score": 9, "replies": [{"body": "I agree with you. This market has a ton of downward potential. It's like watching a slow train wreck. Young investors who haven't seen a big market crash before are more impressed than they should be by what has happened so far, and less impressed than they should be by what might happen next.", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "In the exact same boat as you but losing to you by a percent. Everyone here seems to say the market is going nowhere but down. Personally, the money I invested is set aside for just that, investments. It's not how I make my living, it's my retirement in 30 years. At that point I probably won't even remember this blip. I have a limit order sale set for my initial investment +2%. Yes, I'm 9% off from that right now, but it will hit eventually whether it takes a week or a year. Opportunity cost is of little care to me as this isn't how I earn my living and I have a job that prevents me from trading during market hours.", "score": 2, "replies": [{"body": "You probably won't remember this blip. Do you know how you would remember? If you sold when the market was a little bit down, and then bought in again when the was a waaay down. You would remember a move like that for the rest of your life.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Be afraid, be very afraid", "score": 1, "replies": []}, {"body": "Buy into this 9% decline", "score": 1, "replies": [{"body": "Meh, I think I’d rather wait for it to dip a little more. Sitting on some IRA $ I wanna invest haha. F", "score": 2, "replies": [{"body": "Lol. Yeah.", "score": 1, "replies": []}]}]}]}, {"body": "I’d be more relaxed if I didn’t just put $50k into the market -_-", "score": 35, "replies": [{"body": "and this shows the psychological benefits of DCA into the market.", "score": 21, "replies": [{"body": "I could have gone in slower, but with commissions etc. I wanted to just put it all at once. ", "score": 6, "replies": [{"body": "You are worried about $5 commissions when you are investing $50k? Even if you invested it in 10 $5K chunks, you would be loosing 0.1% to commissions. ", "score": 12, "replies": [{"body": "I tend to go into the market as soon as I have cash, better to be invested than sit on the sidelines. ", "score": 5, "replies": [{"body": "You just suddenly acquired 50k?", "score": 2, "replies": [{"body": "My dad’s brother had passed away a few months ago and had left me some money. Finally got the estate settled. ", "score": 20, "replies": [{"body": "Sorry for your loss. Good luck brother.", "score": 21, "replies": [{"body": "You too brother", "score": 7, "replies": []}]}, {"body": "You'll come out ahead, just take the long position.", "score": 4, "replies": []}, {"body": "sending you positive vibes, to the moon with your portfolio", "score": 6, "replies": []}]}]}]}]}]}, {"body": "> physiological \n\n*psychological", "score": 1, "replies": []}]}, {"body": "http://awealthofcommonsense.com/2014/02/worlds-worst-market-timer/\n\nThis should calm you down.", "score": 5, "replies": []}]}, {"body": "Is Aaron Rodgers in here? :)", "score": 6, "replies": [{"body": "If so, that's a buy!", "score": 1, "replies": []}]}, {"body": "I'm relieved that it's finally here. I've spent too much time stressing about whether or not it would arrive.", "score": 17, "replies": [{"body": "I disagree that this will be the \"it\". The economy is going too strong and companies performing too well. \n\nSure maybe we'll drop another 10-20% but I doubt much lower than that", "score": -2, "replies": [{"body": "Another 20% makes it a 30% crash.", "score": 20, "replies": [{"body": "Which is still only a loss of just over a year of gains. A 30% crash is much less of a big deal when your up 25% in just the past year.", "score": 8, "replies": [{"body": "That’s actually not true - gains and losses do not move net/net. If you invest $1 and return 25% you’ve got $1.25, then if your account drops 30% you’re down to $0.89 - you’ve lost all you’ve gains and then some! ", "score": 7, "replies": []}]}, {"body": "So what? Is the sun going to fall out of the sky? ", "score": -5, "replies": [{"body": "Who knows, but I know for certain that while I'm in cash like Warren Buffett is, it is not at risk. ; )", "score": 4, "replies": [{"body": "Just at risk for runaway inflation ", "score": 5, "replies": [{"body": "Exactly. Wherever you park your currency there are always risks involved", "score": 1, "replies": [{"body": "Nothing compared to the crash that's coming tomorrow.", "score": -4, "replies": [{"body": "Remindme! 24 hours\n\nShow face if the market is up tomorrow and dont go into a cave hiding. ", "score": 4, "replies": [{"body": "I will be messaging you on [**2018-02-09 23:13:34 UTC**](http://www.wolframalpha.com/input/?i=2018-02-09 23:13:34 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/stocks/comments/7w7roj/relax/)\n\n[**CLICK THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/stocks/comments/7w7roj/relax/]%0A%0ARemindMe!  24 hours) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! dtyh8cq)\n\n_____\n\n|[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/)\n|-|-|-|-|-|-|", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "He was WRONG", "score": 2, "replies": []}, {"body": "Cramer, duh", "score": 3, "replies": []}]}, {"body": "Sooooo.... What happened? ", "score": 1, "replies": [{"body": "I was wrong just like every other stock know it all. Took positions into a few places, mostly defense ; )", "score": 3, "replies": [{"body": "You showed up. I respect you good sir. :)", "score": 3, "replies": []}]}]}]}]}, {"body": "Nothing like the 30% loss that's coming.", "score": 0, "replies": []}]}, {"body": "Warren Buffet bought a shitload of Apple last summer; so did I (relatively speaking lol)...  He is a buy-and-hold type of guy, so I'm assuming he is still holding those shares.  So am I.", "score": 2, "replies": [{"body": "Yeah, but he's also on the most cash he's been on in a while, he's definitely an insider, hint hint.", "score": 2, "replies": [{"body": "The fact that he is sitting on a lot of cash, yet he STILL bought a 5% stake in Apple leads me to believe he will hold Apple for quite some time.  Plus, Apple is also sitting on a boatload of cash.  Hint hint.", "score": 1, "replies": [{"body": "Don't get me wrong, I still plan to take positions, and $AAPL at 156 is decent, other than them I'm looking at defense stocks that will be resilient after the budget passes.", "score": 2, "replies": []}]}]}, {"body": "Warren Buffet buying stock alone can stabilize it. \n\nI wouldn't go thinking that you can duplicate his success, other than invest in well-known properties and sit on it forever.\n\nNote: however, investing in the exact same stock he does, is not a bad idea!", "score": 2, "replies": [{"body": "Long BRK.B?", "score": 1, "replies": []}, {"body": "He says you shouldn't copy his investments and if you want to then you might as well invest in berkshire.", "score": 1, "replies": []}]}]}, {"body": "I hold plenty of dry powder as well, never a bad idea to have cash on deck for opportunities. ", "score": 1, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Yes warren is holding billions, somewhere in the neighborhood of 110 billion. Only Apple has more cash on hand", "score": 5, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Something something Berkshire Hathaway", "score": 1, "replies": []}, {"body": "Berkshire reported in September cash holdings or equivalents of 108 billion.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I didn’t think there needed to be clarification between warren and Berkshire. 99.9% of investors would have understood what I meant.\nSorry for the confusion.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "Can we get some share repurchase announcements.", "score": 5, "replies": []}, {"body": "Do you have any insight as to what this means for investors with LJM Fund? Is the money invested gone, or is there a chance it could build back up over time? ", "score": 9, "replies": [{"body": "Realized volatility is significantly higher than implied volatility, that's a bloodbath for $LJMAX. From my quick perusal they're selling options trying to arbitrage a premium out of it, not a positive outlook for recovery any time soon in my limited opinion.", "score": 2, "replies": [{"body": "[LJM Partners Letter](https://imgur.com/a/HfTJH) \nThank you - just received this correspondence from them as well. ", "score": 2, "replies": [{"body": "Thanks for sharing- kind of crazy that the website said “Superior returns for patient investors” as a tag line then the fund has a large position in the VIX.... hypocrisy at its best.", "score": 1, "replies": []}]}]}]}, {"body": "I bought into the S&P 500, the fact that stocks are at pre-tax reform levels tells me it's a good buy. Although tax reform was somewhat baked into stock prices by the time it passed, actually passing it should have a big effect that is not now reflected in stocks. ", "score": 6, "replies": [{"body": "So the supply of government bonds will go up by about 3% more than the extra profit shareholders will make from the tax cuts. If shareholders reinvest on high p/e stocks then yes the market will keep going up.  But if they buy the extra government bonds (which someone has to) then the stock market would actually lose 3% from the tax bill.  \n\nEssentially the tax bill will only boost the equity market if the resultant increase in bonds is bought by people who weren't going to buy US stocks instead. \n\nThis is basically algebra.  All the tax bill has done is increase the supply and incentive to buy US bonds.  I'm not sure how that benefits the stock market in the long run?", "score": 7, "replies": [{"body": "That's a great point, and admittedly I wasn't thinking of valuations in terms of the supply and demand of stocks and bonds, though it is helpful to think of it that way. I was thinking more in terms of the value of the companies you are buying into with discounted cash flow analysis https://www.investopedia.com/university/dcf/. For example, assuming the government policies don't affect the underlying growth rate of companies (which I know is a big assumption, but it's something too hard to predict), let's say you have a company with earnings of $450 and a cost of capital of 4.5%, they would be valued at $1000. It looks like the cost of capital will increase to 5% after the Fed raises rates to 2%, so for that company to have the same valuation it will have to increase earnings to $500, or by about 11%. That's about the average increase in earnings from U.S. companies, according to this report: https://www.ft.com/content/9eef31ba-e13d-11e7-8f9f-de1c2175f5ce\nSo maybe the Fed's increase in rates and tax reform will just about cancel out, at least in terms of the corporate tax reform provisions discussed in that article (repatriation, lower corporate rate, etc.). However, I'm betting on infrastructure spending, immediate expensing, lower rates for individuals, and the new pass-through deduction to also increase earnings.", "score": 2, "replies": [{"body": "There are a lot of factors that probably vary by industry or company.  So if i want to pick a company i think will do worse i need all of what? \n1. Essentially companies with a lot of debt\n2. Company without much foreign sales or profits assuming the dollar keeps falling\n3. Company already paying low AF taxes\n4. Company that relies on middle class or poor people given we are at record level of consumer debt, and tax reform doesn't help them much\n\nAm I missing some other factors here? Basically I need to short a company that mostly has domestic profifs, lots of debt, and would normally get sales through poor and middle class people's credit lines.", "score": 3, "replies": []}]}]}]}, {"body": "Listen here Aaron Rodgers... seeing almost double digit percentage losses sucks regardless of how much you made prior. :(", "score": 3, "replies": []}, {"body": "I’ll be laughing so hard when tomorrow it will dump more than 5% and the real panic begins. ", "score": 3, "replies": []}, {"body": "I'm relaxed because my portfolio has done better than the market. Nothing puts a smile on my face like beating the market. As long as I can beat the market I want it to go down. All of my lowballed buy orders have executed. Plus I have another 15% of my portfolio in two bonds that will mature in 3 months and a year. I'm calm as a clam, cool as a sea cucumber. ", "score": 3, "replies": []}, {"body": "Easy for people to say relax when its other people's money", "score": 8, "replies": [{"body": "Yeah or people like OP who probably went from a 200% profit to 180%.\n\nPeople who bought this year are fucked for months/years coming", "score": 1, "replies": []}]}, {"body": "When the S&P has a pe hovering around 30 you know stocks are overbought.  Market will slide some more until overall market pe gets into the 18-23 range.\n\nCompanies are healthy, just stock price went too high, too fast.\n\nJust hold and DCA into your favorite index funds while the market evens out..\n\nIt’s not going down forever, just like it won’t go up forever.", "score": 4, "replies": [{"body": "Where do you get 30 from? According to seeking alpha, on January 4th the S&P had a pe of 22.88 (sorry, can't post link on this sub). On January 4th the S&P was 143 points higher than at closing today.", "score": 3, "replies": [{"body": "Forbes article, maybe the street or yahoo finance. But I swear it was in the past week or so, since the market has gone down", "score": 1, "replies": []}, {"body": "Also, what was it at the end of January, there was a lot of gains in January. ", "score": 1, "replies": [{"body": "Maybe if earnings changed significantly too, but those are based on a trailing average that wouldn't have changed much. I think the current pe should be abt 21.5", "score": 1, "replies": []}]}]}]}, {"body": "Lost a lot of my portfolio, ~10% in the last week. Really hurts to look at my portfolio right now. Trying to talk myself into buying more QQQ & SPY and buckling up for the ride", "score": 2, "replies": [{"body": "you could buy vertical spreads for a more defined P/L profile", "score": 1, "replies": []}, {"body": "Those are the two I ride out in my IRA. I'm seriously considering buying more of those indexes in my brokerage. Just remember why you own those two in the first place, particularly QQQ. Great fucking companies that aren't going anywhere. Hold strong buddy.", "score": 1, "replies": []}]}, {"body": "I really hope your right. Good for me is the money I have in my portfolio is money I do not need to touch for the next 3 years. I have never been through a big market collapse whilst having money invested in stocks. How long do those collapses last?\n", "score": 2, "replies": []}, {"body": ">  We'll be taken back to the dark, dark days of...mid November, 2017.\n\nlol. and a nice way to put it in perspective.", "score": 2, "replies": []}, {"body": "Fuck wish I sold my shit last week. Stuck on weed stocks before the dip ", "score": 2, "replies": []}, {"body": "Yes, please, buy stocks.\n\nI need a bounce to cover my losses.", "score": 2, "replies": []}, {"body": "Fuxk you mean relax, i will loose a year of growth, fuck is that suppose me act like nothing?", "score": 2, "replies": []}, {"body": "Unemployment already being low also means that there isn't much room for growth, and also inflation. Continue to panic. ", "score": 3, "replies": [{"body": "The labor force participation rate has a lot of room to grow.", "score": 4, "replies": [{"body": "The baby boomers are retiring and they're a large percentage of the population. It's not going to grow until they start dying in droves.", "score": 1, "replies": [{"body": "That wouldn't be actual *labor force* growth either, just a decline in non-workers.", "score": 2, "replies": []}, {"body": "That doesn’t make sense ", "score": 1, "replies": []}]}]}]}, {"body": "Well, economy is sure good and recovering. But still, Market is very pricey.\n\nThere is a strong correlation between value and price.\n\nValue (fundamentals) are great. But Price are still very high.\n\nTherefore, the ratio between value and price is still not attractive despite the current fundamentals and what's ahead.\n\nCan't predict how far will it drop or when it will rebound. But i think it's time for patience and prudence.", "score": 3, "replies": []}, {"body": "I got in $MSFT at $94 LOL. Holding for the long run so it's not the biggest deal but I'm still a dummy to buy in late January when everything was clearly overbought.", "score": 2, "replies": [{"body": "you could have made the same argument on Jan 1st, but still have made 7% by Jan 31st", "score": 2, "replies": []}]}, {"body": "\n\n   C-A-P-I-T-U-L-A-T-E", "score": 2, "replies": []}, {"body": ">Unemployment is low\n\nNot for me... ;_;", "score": 2, "replies": []}, {"body": "I noped out, other suckers can take the 40%+ crash that's happening, not this guy.", "score": 2, "replies": [{"body": "Or you can miss out on another 20% year and then another after that. ", "score": 11, "replies": [{"body": "Or you could just sit a week or two and wait for volatility to recover in figure out what direction the market is going in. Going cash doesn't mean you lose the ability to look at the market at all.", "score": 1, "replies": [{"body": "Then you run the risk of missing out on a big jump and then where are you at? If the market goes up 7% tomorrow what is your plan?", "score": 1, "replies": [{"body": "OTM calls could work pretty well for that. You could day trade as well and see what you can do on each day while exiting out if things turn south. I'm beating S&P by about 15% this year by just taking profits when I can.", "score": 1, "replies": []}]}]}, {"body": "Not gonna happen, crash is overdue not just a correction.", "score": -12, "replies": [{"body": "Overdue based on what? The economy is BOOMING. \n\nJust because it's been 10 years doesn't have any relevance to the current state of the economy. ", "score": 19, "replies": [{"body": "Stocks are psychological for many add in algotrading which pull triggers automatically, stocks!=economy. A crash can happen with a good economy as you are bearing witness to.", "score": 5, "replies": [{"body": "I don't care if my share prices drop as long as my dividends keep being deposited into my bank account. ", "score": 5, "replies": [{"body": "Same. I’m still making 4K a year on dividends. Even if my portfolio just went from +10% -> 0%", "score": 1, "replies": []}]}]}, {"body": "It's The Business Cycle ", "score": 2, "replies": []}, {"body": "Guys the housing market is fine \n\n~2006", "score": 2, "replies": [{"body": "If you got into the housing market in 2006 you were still ahead even during the 2008 crash", "score": 1, "replies": []}]}, {"body": "Booming based on what?", "score": 1, "replies": []}, {"body": "Economy is fine, the stock market is not, not based on the economy alone.", "score": 0, "replies": [{"body": "I don't care if my share prices drop as long as my dividends keep being deposited into my bank account. ", "score": 1, "replies": [{"body": "OK. We understood that the first time.", "score": 4, "replies": [{"body": "I don't care if his share prices drop as long as his dividends keep being deposited into my bank account.\n\n", "score": 3, "replies": []}]}]}]}]}, {"body": "Zero chance of a “crash”. Fundamentals are way too strong.  If we saw companies missing earnings and downgrading guidance...maybe.  ", "score": 2, "replies": [{"body": "General Electric, a company that's been a household name for over 100 years, founded in the late 1800's, has been plummeting for over a year.\n\nTesla is burning through cash at extreme rates and is unable to produce vehicles at any sort of significant rate.\n\nSnapchat, a $23 billion company lost over 500 million in 2016.\n\nThere are a lot more examples of companies that are one bad economy away from disappearing. Right now the economy is great, but in a capitalistic society, we move in cycles. After the rise comes the fall. It may not come for a while, but it will come. And some of today's largest companies, which are in fact losing money and posting terrible financials, may very well disappear. \n\nThey have hype and favorable economic conditions now. But eventually they won't. And soon, the tone will change from hype to despair. Only when we enter a recession and the dust clears will we realize that these companies were never good.", "score": -1, "replies": [{"body": "GE is a mismanaged POS that will be split off until the stock goes to $0. Tesla is still a speculative growth stock. The same with SnapChat. These are hardly the examples I would use to describe the health of US companies. ", "score": 8, "replies": []}]}]}, {"body": "CNBC is now letting 20% slip into the conversation ", "score": 1, "replies": []}]}]}, {"body": "It's not wrong to take profits. That's what people are doing. Unless you are selling at a loss then your a rook and should get an index fund.", "score": 10, "replies": []}, {"body": "> I noped out\n\nThat's called capitulation ", "score": 3, "replies": [{"body": "Call it what you like, I took profits and I am zero risk at the moment while stocks and your investments capitulate.", "score": 1, "replies": [{"body": "I capitulated the last week of Jan. I was a 'weak hand'", "score": 3, "replies": []}]}]}]}, {"body": "It's really doesn't not helping when the DOW goes down 4.15 percent and the media calls it a market crash.", "score": 3, "replies": [{"body": "We are taking about a 10% correction over the last week. It’s definitely headline news in the business world. ", "score": 10, "replies": []}]}, {"body": "If in doubt just follow the \"age in bonds\" rule. ", "score": 1, "replies": [{"body": "Only if it's ATM call options on 3x leveraged bond ETFs then maybe", "score": 2, "replies": []}]}, {"body": "No, EVERYONE PANIC!", "score": 1, "replies": []}, {"body": "My suggestion would be C-L-I-N-C-H. ", "score": 1, "replies": []}, {"body": "If anything, it could be a decent time to buy.\n\n", "score": 1, "replies": []}, {"body": "I really hope that the Dow manages to stabilize itself a little bit now, it levitates slowly towards the 24 but right now the buyers just can not get through. If there'll be another avalanche we might slowly slip into a bear market and it will take a while to recover. Besides interest rates there's nothing that speaks for falling markets except the nonsensical low volatility rally over the past few months, it's like a little bubble that just busted.", "score": 1, "replies": []}, {"body": "No need to get all Aaron Rodgers on us. ", "score": 1, "replies": []}, {"body": "What stock is that?", "score": 1, "replies": []}, {"body": "I'd like to thank whoever picked up my BOTZ this morning during teh dead cat bounce. Don't worry you'll only have 'unrealized losses' as long as you bury your head in the sand ", "score": 1, "replies": [{"body": "Yeah, I'm the loser here. Because whoever bought it doesn't have to 'realize their losses'\n\n\nMarket summary > Glb X FUNDS/ROBOTICS & ARTIFICI\nNASDAQ: BOTZ - Feb 9, 12:30 PM EST\n23.42 USD Price **decrease 0.39 (1.64%)**", "score": 1, "replies": []}]}, {"body": "At what point do they shut down the exchange?", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "I mean, there's a time for R-E-L-A-X-ing and a time to hold tight.  Given that the impetus for the current self-off / correction / whatever you want to call it is that *job growth and wages are too high*, coupled with handwringing over the Fed *maybe* raising interest rates like 25 basis points more than they would have, I'm not too concerned.  The market is generally healthy and gives good return when the fundamentals are there.  Right now, I think the fundamentals are there.  Things will level off soon.", "score": 1, "replies": [{"body": "I agree. Have a little bit of cash on the sidelines waiting for the right time to hop back in. I'm thinking if we stabilize and get a string of a couple of good days I may hop back in. I already have my 401k and IRA maxed so getting some good entry points for some big name stocks in my brokerage that are simply dropping because everything is dropping screams opportunity to me. Or just getting the SP500 could be a safe bet. I have a long time horizon so I think that when markets drop like this its a lucrative opportunity to make so good money in the long term. If it drops a lot more it'll be hard not to jump in especially if it goes down another 5-10%. ", "score": 1, "replies": []}]}]}, {"body": "Fundamentals have changed. This is worse than a correction everything is down 10+ percent. People should take profits and leave for a while. Seriously this isnt getting better for a long time.", "score": -13, "replies": [{"body": "What fundamentals changed? How long have you been in the market?", "score": 29, "replies": [{"body": "Look I get you want everyone to relax and not panic sell but its not happening. We are in for a steep decline and anyones best bet would be to buy any sort of bounce tomorrow. \n\nFundamentals have changed - rising interest rates. Market valuation is way too high. Margin debt is insane right now. \n\nI would love everyone to calm down but it wont happen. I project another 10+ percent slide for until march-april.", "score": -5, "replies": [{"body": "lol who said I wanted everyone to relax? You didn't answer my question, how long have you been in the market? ", "score": 8, "replies": [{"body": "Ive been in the market a few years. Im currently only holding SPY Puts and SNAP puts. Up over 100% today, mainly sitting on cash though.\n\nTreasury Yields are nearing 4 year highs, lower unemployment, inflation, I'm almost certain we see another 1/2 rate hikes. \n\n", "score": -6, "replies": []}]}]}]}, {"body": "Just ride the puts down. There is money to be made. And honestly if you're in it for the 10+ year holds then just turn your TV off and maybe go outside for a while. ", "score": 5, "replies": [{"body": "You mean I shouldn't be day-trading my retirement accounts?  ", "score": 4, "replies": []}]}, {"body": "> This is worse than a correction everything is down 10+ percent\n\nIsn't this is literally what 10% correction mean?", "score": 14, "replies": [{"body": "I mean this is worse than a 10% correction because it will continue", "score": -2, "replies": [{"body": "Ah. I thought maybe you had some argument as to *why* this will continue other than your conviction. Never mind.", "score": 11, "replies": [{"body": "I would love to know what would be a reason for reversal? I hope I am wrong that would be great for everyone.", "score": -1, "replies": [{"body": "Here are the reasons that I have:\n\n- Earnings are strong and growing across the board, so no reason for a big decline / bear market / recession\n- So far this has been textbook copy of two 10% corrections in recent memory. Initial dip to the low (Friday, Monday), followed by a small failed rally (Tuesday and first half of yesterday), followed by a rally down but not taking out lower lows (Second half of yesterday, today). If I'd be into predicting future business I'd say gap up tomorrow that fades over the course of the day, next week there will be a rally that goes to a higher high than yesterday. After that there will be one more big selloff that actually goes to equal or slightly lower lows than Monday, and at that point that'd be the bottom and the end of correction, and the place to go long.\n\nCould be wrong of course, I don't have such a strong conviction as you seem to have. But I do have the past to compare to.", "score": 10, "replies": [{"body": "Guess we will find out together.", "score": 6, "replies": [{"body": "That we will :)", "score": 3, "replies": []}, {"body": "Take a look at Alibaba's recent earnings. They crushed earnings especially with their revenue and cloud growth. They only missed EPS by .2 cents..\n\nBUT the stock is getting absolutely hammered. I wouldn't say their fundamentals have changed a bit. I agree with the OP.. Relax. Buy on the dip, not just BABA, anything with strong earnings and fundamentals. 10 months from now you'll thank yourself", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": ">A correction is a reverse movement, usually negative, of at least 10% in a stock, bond, commodity or index to adjust for an overvaluation.\n\nAccording to Investopedia\n\nIt just hit about 10%. It's those that exit now that lose and don't regain their money that lost.", "score": 5, "replies": [{"body": "Or, if it goes to -20%...they scalped some profit and left the table for a bit to buy in at a better spot.", "score": 5, "replies": [{"body": "Correct, but it's all really speculation. A stock market crash is unanticipated so no one really knows for certain.", "score": 3, "replies": []}]}]}, {"body": "Agreed im waiting for shit storm to clear to get back in.", "score": 3, "replies": []}, {"body": "I agree, but bulls are ignorant and naive about bad news - they feel personally threatened and have severe tunnel vision.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Since last friday?", "score": 3, "replies": []}, {"body": "IRobot...", "score": 1, "replies": []}, {"body": "$LRCX is down 25%. Because of that, it's now my largest position. There's many stocks that are substantially lower. ", "score": 1, "replies": [{"body": "Me too god dam.\n\nCould have sold the bounce a while back at a small loss.\n\nNow im just going to hold screw it.", "score": 2, "replies": []}, {"body": "One of my largest positions too... bought before Friday", "score": 1, "replies": []}]}, {"body": "Google is down 15% from its peak.", "score": 1, "replies": []}, {"body": "MSFT is down 5% today, 10% from its peak.  Though its at where it was 3 months ago, so.", "score": 0, "replies": []}]}]}, {"body": "Without fear and without greed, looking at the data I'd say it's wiser to simply exit the market now and wait for when prices stabilize again a bit lower.\n\nThere's always time to slowly enter again and market is due for a crash since a long time now.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "no. Hold.", "score": 2, "replies": [{"body": "1.5% is nothing.  \nYou've got people here who're looking at 5-10%", "score": 3, "replies": [{"body": "I’m down 20% over the last month; please don’t sell down 1.5%. you will survive.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Yeh relax. You lose money in the stock market by jumping in and out short term. In the long term with a decent company you will make money. Just relax and weather the storm. ", "score": 2, "replies": [{"body": "I applaud all the decent and clear cut advice amidst what is as facetious a comment as I care to make without crossing into trolling. Seriously, thank you!", "score": 1, "replies": []}]}]}]}, {"body": "1.49% is pretty typical, 3% is a bigger day. 5% is full panic mode", "score": 2, "replies": []}]}, {"body": "Yes the economy is fundamentally strong, but stock prices have been GROSSLY overvalued for a long time. ", "score": 1, "replies": []}, {"body": "I've been playing this market with about 50-60% on the sidelines for the last couple years. Definitely have lost opportunities to make money, but downside is limited. I want to be able to make moves when the market becomes cheap again. I feel it is still overvalued and close to the top of the business cycle. I would look at value over growth stocks in the market now with potential inflation on the horizon.", "score": 1, "replies": []}, {"body": "If you're not buying this dip on margin you're a weak hand!!! ", "score": 1, "replies": [{"body": "lmao\n", "score": 1, "replies": [{"body": "TIME IN THE MARKET BEATS TMNING THE MARKET!! Especially when it's in a nose dive.", "score": -4, "replies": []}]}]}, {"body": ">  Fundamentals are the best they've been in a decade plus.\n\n[We're in for a recession, then](https://www.youtube.com/watch?v=e4KY39jLdu4)\n", "score": 1, "replies": []}, {"body": "Relax?\n\nIf you guys had any idea how much trouble the economy is actually in, things that some people (like Schiff) have been saying for years.. you guys would be panicking right now. Our economy has literally been held up by morphine and scrap wood for too long. Keynesian / Commie mentality has been messing with true capitalism and true free-market values, and this hybrid in play for so many decades is bound to come crashing down. On a long enough time span, the free-market ALWAYS wins. It's simply nature.\n\nThis could be a nice correction, which would be healthy.. but it could be much much worse, such as the Greatest Depression.\n\nIf you're not holding gold, silver, and water - you're basically an idiot.\n\nINVEST in the market sure, but have your foundation at home prepared.. time is running out.", "score": -16, "replies": [{"body": "Look at all of Schiff's Mutual funds, they all have performed like dog shit. \n\nHe makes a million predictions of doom and has been right on a couple.\n\nIf you listened to his advice you'd have missed out on all the market gains from 2008-2017 as he was bearish the whole way. \n\n\"A broken clock is right twice a day\"\n\nHe's charming and convincing, i'll give him that.", "score": 10, "replies": []}, {"body": "\\>4.1 percent unemployment\n\n\\>80% of companies beat their 2017 earnings projections\n\nGuyz the next Great Depression is imminent", "score": 15, "replies": [{"body": "All of that was built on cheap interest rates and easy financing. That is after  about $12+ trillion in Global QE  which the central banks  are reversing.  \n\nhttps://www.cnbc.com/2016/06/13/12-trillion-of-qe-and-the-lowest-rates-in-5000-years-for-this.html\n\nIf this growth in asset prices was fueled by that then reversing it is going to make it fall. That's why the markets are reacting to interest rate hikes, globally.  \n\nLook at the Market Cap ($2.3 trillion) of companies that are considered Zombies (companies that rely on debt to just stay afloat).\n\nhttps://qz.com/1141732/one-in-every-10-american-companies-is-a-zombie/", "score": 5, "replies": []}]}, {"body": "In other words: PANIC, EVERYONE!  WE’RE GONNA LOSE EVERYTHING!  Great advice", "score": 4, "replies": []}, {"body": "Schiff? Lol ", "score": 3, "replies": []}]}]}
{"title": "Who here has quit their real life job to do this instead, getting lucky while everything was in perma-rally, and now doesn't know what to do?", "selftext": "Asking hypothetically of course. Have only slept like 4 hours a night since Monday though. The constant scheming and trying to weasel new ideas, but nothing is gonna work as good as just shorting VIX did.", "id": "7w4scq", "created_utc": 1518096751.0, "score": 210, "upvote_ratio": 0.97, "num_comments": 171, "comments": [{"body": "yeah i made 10X my day job working 1 hour a day putting in trades in the morning and hitting the gym before coming home to see the take profits levels triggered and gains. Another 2 hours before lunch for DD, financial modelling and strategy making for my next degenerate big play for the next day and snooping for some possible scandals. Drink heavily from 3pm onwards and get laid so much my nuts hurt. \n\nJust lost 50% of my account during the march of the machines last week. I don't even know if I should liquidate and start a lemonade stand and aggressively bolt-on takeover other stands in the city until my market cap hits 10% and i raise capital for an ipo before i dividend recap for some gainz.", "score": 293, "replies": [{"body": "Yea hopefully I don't have to start Ubering again haha", "score": 107, "replies": [{"body": "Aeeeeey fellow Uber bro. Might have to go back to being the youngest Uber driver in my area this weekend since the market is shitting on my gains. ", "score": 32, "replies": [{"body": "So basically your strategy relies on the market going up forever. Good luck.", "score": 15, "replies": []}, {"body": "I don't know if this needs to be said but holy shit. GAINS FROM THE MARKET SHOULDN'T BE INCOME.\n\nThis is basic investing 101. Like, you can ask a 5yr old who just learned what the stock market is and they'll tell you you're an idiot for trying to do that.", "score": 67, "replies": [{"body": "Obviously, you’re lost sir. ", "score": 110, "replies": [{"body": "Give him time. He'll come around. ", "score": 5, "replies": []}]}, {"body": "Chill out Dad, I'm in college and still live with mama and papa bear. I don't need this money until mid to late may. Plus it's only a couple k and I can make it back in 2-3 weeks if I lose it all.  ", "score": 29, "replies": [{"body": ">  papa bear\n\nYou should look for \"papa bull\"", "score": 32, "replies": []}, {"body": "Sure you will.", "score": 15, "replies": []}]}, {"body": "Nah you can do it if you're good, my dad did for decades.  He didn't start out with nothing, though. ", "score": 4, "replies": []}, {"body": "What? Where do you think retirement income comes from? Those people are doing the same thing, just passively and on a longer time horizon.", "score": 6, "replies": []}, {"body": "You do realize this subreddit is literally a kiddiepool of autists complete with the piss puddles and shit stains. ", "score": 2, "replies": []}, {"body": "But we pay taxes on it, so that counts as income", "score": 2, "replies": []}]}, {"body": "Shit, we really were in the irrational exuberance phase.\n\nI know what sub I'm on, but people really quit their jobs for this, lol.", "score": 6, "replies": [{"body": "I can remember the 90’s dot com bubble. I remember seeing stories on the news of people with no investing background becoming day traders and making $100k/yr. Surely that was the kiss of death for the market.", "score": 6, "replies": []}]}, {"body": "Yeah I don't want to go back, I want those days to be behind me.", "score": 1, "replies": []}]}]}, {"body": "This is why I come to WSB.  Fuckin CLASSIC.", "score": 38, "replies": []}, {"body": "And now you realize you werent some savvy genius.. your financial modeling was you drooling on a piece of paper and longing anything in a bull market gives easy gains", "score": 19, "replies": [{"body": "Yeeeaaapp, my first year or so was like 50% losses because I had just seen the Big Short, aaaand I went against the market. Then I went bullish and was drowning in gains, feeling like a genius. Now look at me, soiled in my own filth.", "score": 15, "replies": []}, {"body": "Well to be fair I am a full graduate of wallstreetprep and I am an Investment banking equities analyst at Goldman Sachs interviewee (by phone) and I use a fountain pen for my modelling", "score": 3, "replies": []}]}, {"body": "Respect ", "score": 2, "replies": []}]}, {"body": "The real trick is doing it while you're at your actual day job.\n\nThat way you always have a steady income to lose.", "score": 86, "replies": [{"body": "401Tendies", "score": 10, "replies": [{"body": "I feel recently like it’s been a 404 tendies not found kind of week. ", "score": 4, "replies": []}]}]}, {"body": "Futures are green bro. Get some zzz's and we'll handle it for you 💪💪", "score": 64, "replies": [{"body": "Gimme all dem strong hands, carry me to victory", "score": 18, "replies": []}, {"body": "Jinxed it...", "score": 13, "replies": [{"body": "I handle pre-market. Somebody else is on mid-day duty. 🤷‍♂️", "score": 24, "replies": [{"body": "fuck that guy", "score": 13, "replies": []}]}]}]}, {"body": "“There’s always a bull market somewhere” - Cramer\n\n", "score": 63, "replies": [{"body": "It's just always wherever my money isn't", "score": 94, "replies": [{"body": "You should look at the Thai Exchange...every trade ends in a happy ending....or you get fucked by a lady boy", "score": 3, "replies": []}]}, {"body": "Ohhh so that's what those things that allow you to flip your monitor around are for. ", "score": 8, "replies": []}, {"body": "\"There's always a bear market in my portfolio\" - r/wsb probably", "score": 4, "replies": []}, {"body": "\"Roulette. All you have to do to win huge is choose the right number.\" - Some Guy Sucking Dick In The Alley Behind The Casino", "score": 3, "replies": []}, {"body": "Yes, and it's called Live Cattle Futures, Hillary Clinton is an expert there.", "score": 7, "replies": []}, {"body": "Yeah but any bull can be bear. Just look at the entire s&p 500 tanking the moment this place turned it into a meme stock", "score": 2, "replies": []}]}, {"body": "My job quit me, I brought my expenses down to $150 a month, and I just need to scrape small daily wins to pay the bills.\n\nRest of my time is spent exercising and hanging out with friends", "score": 27, "replies": [{"body": "so you went from 2 energy drinks a day down to 1? nice man, i miss living with my parents", "score": 44, "replies": [{"body": "I use to go to the variety store and buy 1 redbull for 4$ because I could walk and I dident give af. Now that my portfolio is down 4% in past 2 weeks I now drive to a gas station and buy 3 redbulls for 6 $ . I also started counting all my change and and looking for things to sell around my parents house that they won't notice is gone. All this to scramble up more cash to buy the dip .", "score": 9, "replies": [{"body": "I like the way you think! Sell there car. Roll the dice. ", "score": 4, "replies": []}, {"body": "hustle it", "score": 1, "replies": []}]}, {"body": "keep talkin lil boy, i'm poolside in chile as we speak\n\nyou slaving at your desk while your girlfriend tells you what to buy her", "score": 2, "replies": [{"body": "Since you never got laid you can save a bundle on gifts and condoms. ", "score": 13, "replies": [{"body": "been there done that m8. also last i checked \"yourtechguy\" is noy exactly a convincing reddit username for someone who is banging worthwhile chicks\n\nalso 2018, buying gifts for anyone, LOL stay cucked manbaby", "score": -4, "replies": [{"body": ">Not working in tech\n\n>Not making bank for <40hrs week\n\nLol now I know why you're active in /r/fasting", "score": 5, "replies": [{"body": "worked in tech for 4 years. fired for exposing illegal pay practices.\n\nstay cucked mate. you live in a high cost of living city. you are overweight. you have soyboy black rim glasses. you are working in an industry that will be outsourced.\n\nima stay right here in the third world making third world wages with no commute and friends that really care about me", "score": -2, "replies": [{"body": "Our president likes to call those places 'Shitholes'", "score": 3, "replies": [{"body": "our president can say whatever he wants as long as he doesnt fuck up the power of the american passport", "score": 0, "replies": []}]}, {"body": "It's nice to hear your mom loves you even when you're a chubby twink. GAINZ from momma's nipple. ", "score": 3, "replies": [{"body": "you don't know me, bitch nigga!", "score": 1, "replies": []}]}]}]}, {"body": "> banging worthwhile chicks  \n  \nThere ain't a bitch alive worth this nut.  \nFucking rookies.", "score": 2, "replies": [{"body": "long vr porn", "score": 3, "replies": [{"body": "\\**high five*\\*", "score": 2, "replies": []}]}]}]}]}, {"body": "Translation: Eating at Chili's with my mom. We'll head to the YMCA later for tendies and laps. ", "score": 3, "replies": [{"body": "we aint got no chili's in the third world lil boy!!! mama's an alcoholic and i dont talk to her much", "score": 1, "replies": []}]}]}]}, {"body": "Do you recycle what you eat back into yourself?", "score": 15, "replies": [{"body": "A 1 person human centipede.", "score": 13, "replies": []}, {"body": "ironically i do daily intermittent fasting and i've dropped from 195lbs to 145lbs in less than 4 months\n\nfood is cheap though bro especially in thailand. less than a dollar a day if you really develop thai tastes", "score": 1, "replies": [{"body": "Being broke and malnourished is not ironic bruz", "score": 13, "replies": [{"body": "**Save a 3rd World WSBer** ^^^\\(R\\)  \n  \n\n[*🎵🎵 in arms of the angels...*]  \n  \n\nSponsorship starts at $30 a month – less than a dollar a day. You will help change the lives of malnourished degenerates in need of gainz around the world. If you can spare more than $30 (holy shit, that's alot of tendies) we'll send you an honorary autistic wolf mask to wear while livestreaming your daytrades. ", "score": 4, "replies": []}]}, {"body": "\\> loses 50 pounds and is malnourished from having no money to buy food\n\n\"It's called intermittent fasting bro\"", "score": 8, "replies": [{"body": "What the fuck did you just fucking say about me, you little bitch? I’ll have you know I graduated top of my class in the Navy Seals, and I’ve been involved in secret raids on Al-Quaeda, and I have over 300 confirmed kills. I am trained in gorilla warfare and I’m the top sniper in the entire US armed forces. You are nothing to me but just another target. I will wipe you out with precision the likes of which has never been seen before on this Earth, mark my words. You think you can get away with saying shit to me over the Internet? Think again, fucker. As we speak I am contacting my network of spies across the USA and your IP is being traced right now so you better prepare for the storm, maggot. The storm that wipes out the pathetic little thing you call your life. You’re fucking dead, kid. I can be anywhere, anytime, and I can kill you in over seven hundred ways, and that’s just with my bare hands. Not only am I extensively trained in unarmed combat, but I have access to the entire arsenal of the United States Marine Corps and I will use it to its full extent to wipe your ass off the face of the continent, you little shit. If only you could have known what unholy retribution your little “clever” comment was about to bring down upon you, maybe you would have held your tongue. You didn’t, and now you’re paying the price, you goddamn idiot. I will shit all over you and you will drown in it. You’re fucking dead, kiddo.", "score": 2, "replies": []}]}, {"body": "Thailand? I thought you were in Chile?", "score": 6, "replies": [{"body": "currently in chile, did a few months last year in thailand and i will be back there in march. came to chile to try out the andes when it was warm for trekking", "score": 1, "replies": []}]}, {"body": "You’re either a manlet and/or are severely malnourished. ", "score": 2, "replies": [{"body": "5'10 only built 4 chinks", "score": 3, "replies": [{"body": "And 145? Sorry you aren’t guilt. That’s physically impossible. ", "score": 1, "replies": [{"body": "thats the joke, im only attractive to asian women cause im so lean", "score": 2, "replies": []}]}]}]}]}]}, {"body": "how long have you been at it?", "score": 4, "replies": [{"body": "He is 14.", "score": 17, "replies": [{"body": "[deleted]", "score": 36, "replies": [{"body": "I just shot SBUX out of my nose.", "score": 11, "replies": []}]}]}, {"body": "Almost 8 months now my friend, i'm in Chile right now and next month i'll be in Thailand. keep them expenses low and make sure you have some savings to fall back on.\n\nironically i didnt choose this life but i was basically blacklisted from my profession", "score": 1, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "salesman that exposed highly illegal company business practices", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "HAH, I wish. The company I used to work for basically built the NSA from the ground up. But I didn't expose state secrets or anything. All of my (complaints) were regarding non-payment of commissions and wages and overtime and etc\n\nthe big boss responded by firing me, my manager, and my entire team\n\ni searched long and hard for a job that paid more than break even, but the northeastern USA is basically too expensive if you want to have a sliver of fun in your 20s\n\nSo, Chile and Thailand have been really good to me!!!", "score": 5, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "hahahahaha i am wayyy too much of a lil bitch boy to go anywhere near hookers and blow in thailand\n\nthai prison is not a fun place to be", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "hookers are legal, but you usually have to talk to their pimp at the bar. can be a man or a woman depending on how the local mafia run the scene. you pay them and she goes home with you, but now you're on their radar. people get hit with like $2,500 \"karaokee bar tabs\" and if you don't pay....\n\nand then basically anything involving drugs in SE asia, you're on your own. they'll hang you if they get the chance", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "hahahhaahaahaha. dont worry about it bro. give it a shot one day, theres a 99.9% chance nothing crazy will happen.\n\ntbh it was the best decision ive ever made in my life. obviously it sucks not making a real US salary anymore of like 3-4k a month, because id be living like a king in any third world country. but still, the life is very peaceful and ive never had any problems whatsoever. no muggings, no people ripping me off, no trouble with the cops, nothing.\n\ni walk around at night and feel safer than i would in chicago. i buy a meal for $1-2. my cell phone is cheaper and faster than verizon, no contract. im honestly struggling to think of any problems. maybe if you are an old man in chile you will be targeted for a pickpocketing. but if you stay out of the bad neighborhoods (just like you would in NYC or chicago or like, all of memphis and detroit and gary indiana), everything is completely normal and people are usually happy to help.\n\ni always tell my friends that if your career implodes in the US, come live a permanent vacation in thailand or chile (where i am currently for a few more weeks)", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "chilenas are not the easiest. my tinder game has not precisely been successful, but the ones you do meet are genuine and friendly. \n\nthailand's food is second to none, in terms of price and quality. chile's food is comparable to Columbus, Ohio.....", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Columbus is so painfully mediocre in everything it does, ahhahaha. and that is sometimes how i feel here too. like, \"wow this is kind of cheap and kind of good but theres just so many small things holding this country back\"\n\nthai girls are awesome, if you treat one very nice then they will be a very loyal friend, unlike literally every western chick who wants the world and will make your life a living hell.\n\ntons of lady boys XDDDD hahah but they're only performers. they perform at cabaret shows, at specific bars. only western chicks go to see cabaret show, its a tourist scam.\n\ngo go bars however are where you can buy a prostitute from mamasan (old woman pimp) and watch girls shoot ping pong balls out of of their pussy. avoid if you dont like seedy places lol\n\nmy apartment is in chiang mai in the north. calm and friendly, totally different from pattaya\n\nmessage me anytime my man", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "outside of those places thailand is a wonderful country and the seedy stuff is easy to avoid :)))", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "fucking empanadas, cheese, meat, and bread (specifically marraquetas) is all these people know, dead ass lol\n\nbut in my neighborhood theres a lot of grocery stores, lider, unimarc, oxxo, tottus etc. it's basically the USA but everyone only speaks spanish", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "it's a bit of a mixed bag here- to be honest, this is not the best place to live long term as the prices are still a bit high and in general south america is much less friendly than SE asia\n\nbut the mountains are world class and the lifestyle is very very western. expensive to fly here though, like 1k roundtrip", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "nice i will check it out!!! punta arenas (puntarenas in chileno speak lol) is about $200 roundtrip from santiago, 4hr plane ride. i was really considering going but im lazy and we have plenty of high ones here by santiago, like cerro el plomo and cerro pintor, which i did :)\n\nargentinian gaucho is really top notch ;))))))\n\nbut as with everything i would say, if you want to go, go! do it! life is short, you can work when you are old!!!! everyone will judge you for it- so be it", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Special Ops. Don't push him. He can crush you with one key-stroke. ", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 133, "replies": [{"body": "This is like peak /r/bodybuilding and WSB shitposting.", "score": 89, "replies": [{"body": "I don't know the details, but if you look closely at this guy's stats you can see that he is hilariously imbalanced.  His max bench is 5 lbs less than his squat... he probably has no idea wtf he is doing in the gym and got all his workout ideas from YouTube.\n\nSimilarly, I would expect his portfolio to be lit up like a Christmas tree because he is just another brainless drone following the Flavor of the Week.  The funny thing is, out in the general public this turd could pass for a \"fit\" guy or a \"legit trader\" but in reality his gainz are still in the novice territory.", "score": 63, "replies": [{"body": "Well yeah, that's why it's firmly in the /jerk/ territory, which is why I hope he isn't serious. The creatine comment especially makes me think he's joking. But yes his lifts are extremely unbalanced if he's being for real. Good thing normies have low standards.", "score": 18, "replies": [{"body": "Some supp companies actually recommend 10mg/day.  He might just be autistic tho.", "score": 10, "replies": [{"body": "Oh I'm sure, just the way he presented it like a golden ticket to being huge was hilarious.", "score": 3, "replies": [{"body": "Do people not check usernames of who is replying to them?", "score": 16, "replies": [{"body": "On mobile, fucking lol", "score": 8, "replies": []}]}]}]}, {"body": "Check out the usernames.  OP and the guy that called him out are the same guy.", "score": 7, "replies": [{"body": "Yeah I saw that, fucking awesome.", "score": 9, "replies": []}]}]}, {"body": "But you are both /u/Theocletian.  Did you forget to switch accounts?", "score": 9, "replies": [{"body": "Maybe he developed dissociative identity disorder as a coping mechanism.", "score": 16, "replies": [{"body": "You mean,that you developed that? What the fuck.", "score": 9, "replies": [{"body": "Social media and the lack of medication makes the transition extremely easy.", "score": 12, "replies": []}]}, {"body": "https://i.imgur.com/seh6p.gif", "score": 4, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "My own basement.  I still own the house tho so I don't have to claim neckbeard status on my tax forms.", "score": 5, "replies": []}]}]}]}, {"body": "Hey faggot why are you talking about your workout routine so much?", "score": 128, "replies": [{"body": "I think it could be a thinly veiled cry for help.", "score": 83, "replies": [{"body": "I thought it was an obvious cry for help.    ", "score": 20, "replies": []}, {"body": "Well you're one that posted it so maybe you could tell us? Did you forget to switch to you alt? ", "score": 2, "replies": []}]}, {"body": "I don't understand most of this.\n\nWhy did the cat die? Is he saying his bench max is 205 lbs? What the fuck is \"winter beach season\"? I was feeling like shit about my losses but now I'm just confused af, so...thanks I guess?", "score": 14, "replies": []}, {"body": "Wanker’s portfolio is nothing worth bragging about and he may have made more sticking to his job, so the gym’s the only thing he can tell this sub about.", "score": 21, "replies": []}]}, {"body": "fake and really fucking gay", "score": 15, "replies": []}, {"body": "Were you pimping your cat or something? Who would hire a cat?", "score": 12, "replies": [{"body": "YouTube is the main cat employer, IIRC.", "score": 14, "replies": []}]}, {"body": "Wall of text with no TL,DR. Quotes don't count as TL,DR fag", "score": 10, "replies": []}, {"body": "HUGE FAGGOT HERE FOLKS", "score": 8, "replies": []}, {"body": "You are my personal hero", "score": 8, "replies": []}, {"body": "thank you for your service", "score": 7, "replies": []}, {"body": "Holy shit you’re a super fag for 100 different reason in a single post. Bravo!", "score": 7, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Right, of course.", "score": 4, "replies": []}]}, {"body": "your lift ratios are so out of whack lol. surprised you didn't plateau on bench while your squats and deadlifts properly configured.", "score": 8, "replies": [{"body": "Whoa whoa whoa. Are you going to tell me that it is wrong to take generic advice and try to jam it to fit a program that is clearly not working for me personally but still continue on blind faith alone while neglecting the obvious warning signs indicating a lack of growth in key areas?\n\nBecause that is exactly how I approached stocks and look at where I am at now.  Trying to understand the fundamentals is just a waste of time... how can I go wrong when I do the exact same thing that other people do??", "score": 20, "replies": []}, {"body": "for a powerlifter yes out of wack. but for an aesthetic, body builder who is all upper body and wimpy legs.. he is on point!", "score": 7, "replies": [{"body": "one of the things is I feel like there are many people who don't respect proportionality, and only go after size size size and end up looking goofy ", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "2/3/4, roughly", "score": 2, "replies": []}]}]}, {"body": "I can’t believe this ain’t pasta", "score": 4, "replies": []}, {"body": "please continue your story..", "score": 3, "replies": []}, {"body": "You only ever dled 2 plates? What a fucking narp", "score": 3, "replies": [{"body": "I DL two plates by farting.", "score": 2, "replies": []}]}, {"body": "I too have found working out to be good for trading. It gives you patience and pain tolerance (physical and mental...mental pain is physical pain, and physical is mental). The brain is not a separate part of you, it is part of the bodily....physical health is mental health. ", "score": 3, "replies": [{"body": "It has been shown that a good exercise regimen coupled with a diet of healthy fats helps to improve brain function.\n\nFats are metabolized into ketone bodies, one of which is beta-hydroxybutrate and the action of this particular one past the blood-brain barrier has been shown to stimulate the production of brain-derived neurotrophic factor.\n\nCoupled with the idea that strength training naturally boosts serum test levels and that successful traders often have higher test and we have a winning combination.\n\nFirst time I am 100% srs on this sub.  You are absolutely right on.", "score": 3, "replies": [{"body": "Glad there's other gym bros here. I started about a year ago and has been a great thing in my life. ", "score": 3, "replies": []}]}]}, {"body": "Creatine, Not even once...", "score": 3, "replies": []}, {"body": "RIP cat. ", "score": 3, "replies": []}, {"body": "> thanks to the lifts and shorts\n\nShorts?", "score": 1, "replies": []}]}, {"body": "I couldn't even make gains in perma-rally.\n\nGood thing I'm a NEET so I didn't quit my job.", "score": 14, "replies": [{"body": "LOL!", "score": 1, "replies": []}]}, {"body": "Obviously if you went long on a rally, you just short it all now you scrub.", "score": 11, "replies": [{"body": "Oh is that all it is! Jee Whiz oh boy! I would buy puts but they are hella expensive right now, if they cool down a bit with the absurd premium I'll totally load up.", "score": 4, "replies": [{"body": "Premium doesn’t matter unless you plan on holding to the end", "score": 3, "replies": [{"body": "I tend to do that, too stubborn to sell for a loss, so I hold till -99%, and then realize I'm fucked.", "score": 1, "replies": []}]}]}]}, {"body": "I didn't even get to that, I quit school on my senior year of college. ", "score": 8, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "My father kicked me out of the house and i had to crash with a friend temporarily. I borrowd his sofa and I’m best friends with his  wife I can tell .", "score": 3, "replies": []}]}, {"body": "Well if you were gonna get a Bachelors in Psych or something, which is what I have, it won't count for shit anyway. I have minors in Anthropology and Economics too, also useless.", "score": 3, "replies": [{"body": "I was actually just memeing I graduated with a bs in nursing and pretty much I can find work anywhere. I can quit tomorrow and In 2 days I can be hired in another city in the same state.", "score": 10, "replies": []}]}]}, {"body": "1. I wouldn't consider 'living in mom's basement while never showering' a job.    \n2. Even if it was, you wouldn't have to quit it to play day trader dress up all day.", "score": 6, "replies": [{"body": "What if i have a room upstairs too and shower infrequently but regularly?", "score": 3, "replies": []}]}, {"body": "I started off trading in 2010, back when even a WSB'er can make money on the market. Made a fuckton of money just buying and holding GLD calls, and then September 2011 happened and I had to get a day job. \n\nI jumped back in the market in late 2012, made a killing on solar stocks, then 2014 happened.\n\nSince then, I invested $100k or so in normie index funds but I still have some play money I YOLO trade with every once in a while. Made a good amount on VLKAY after the scandal and a few other obscure stocks, but lost on so many other small trades. Such is the way of the WSB autist.\n\nI can't put an exact $ figure on my overall net gain, but it's decent...mainly because of the normie portfolio, not the trading lol", "score": 6, "replies": []}, {"body": "Sorta. I own my own business but I put it on the back burner the past year and a half. Had an awesome run with this market, now I'll likely go back to passive investing and work on the business again.", "score": 12, "replies": [{"body": "wut r u a fgt", "score": 10, "replies": []}]}, {"body": "How much of a cushion did you have when you retired? You can always go back to work and it’s not a loss until you sell. Long $Regn.", "score": 9, "replies": [{"body": "I ain't retired, I'm just retarded", "score": 80, "replies": [{"body": "How much of a cushion did you have when you retarded?", "score": 28, "replies": [{"body": "Roughly 15k, down to about 9k right now... Still got a lil bit, enough for me to find a job before I can't afford rent.", "score": 12, "replies": [{"body": "Fuck dude, good luck.", "score": 10, "replies": [{"body": "gonna need it", "score": 4, "replies": []}]}, {"body": "That's not enough money to trade for a living. Go back to get a job.", "score": 9, "replies": []}]}]}, {"body": "lol thx for the gold, glad my pain sustains you", "score": 1, "replies": []}]}]}, {"body": "Can somebody explain to me how good trading VIX was? Was it just small gains each day and you’d trade in and out of the position?\n\nWhat kind of money were people making?\n\nThanks!", "score": 3, "replies": [{"body": "Yeah, basically the VIX was steady in the 10-13 range (13 was considered high) for a bunch of years. In the last year it's dipped into the 9s and even touched high 8. Basically, you wait for that special time of every month when VIX touched 12 or so, load up on a ton of 10/11 FD PUTs and let it ride. It worked alllmost every time. You could make 10-50% profit when the market inevitably calmed down, which it did every time until now. This time may be different...I hope not because I'm pretty balls deep into some puts as we speak. Luckily they are a few months out, but a full on recession would blow me out of the water. Say a prayer for me. ", "score": 7, "replies": []}]}, {"body": "Haha.  It only gets harder now bois. ", "score": 4, "replies": [{"body": "It's almost like I should know what I'm doing for this", "score": 7, "replies": []}]}, {"body": "Short OTM puts.", "score": 2, "replies": []}, {"body": "Jokes on you; I trade at the day-job.", "score": 2, "replies": []}, {"body": "The market has to fall 20% over a 2 month period from its 52 week high to be a bear market.  Its still technically a bull market.", "score": 3, "replies": [{"body": "It's not even a correction yet.  For that to be the case, it should be 10% below the high.  We're only at 8.5% at most so far.", "score": 1, "replies": [{"body": "Right.  I dont know why people are complaining.  It was the longest period since 1930 without a drop of 5%.  I believe next year will be a bear market.  All I have to say is that the fed better postpone interest rate hikes for maybe another quarter. A 15 year mortgage is 4% now and in October 2016 I refinanced at 2.875% I think they are going up too quick\n", "score": 5, "replies": [{"body": "People are complaining because many don't have much experience / knowledge with regards to this type of volatility.  I remember how I used to be whipsawed some decades back when these things happened.  But arming yourself with information or just experiencing these things enough times and you'd be able to put this all in perspective.  If we get a bear, then that would be actually interesting.  Not sure if the Fed will postpone.  They will do what they will do, unfortunately.", "score": 2, "replies": [{"body": "I don't have decades of experience with the market but I do have an MBA so I'm more equipped than the majority of people on the market. You don't need brains to buy securities only the money.", "score": 2, "replies": []}]}]}, {"body": "Update. Down 10.1% in last 5 days.\n\nhttps://imgur.com/a/cBPUw", "score": 6, "replies": [{"body": "GL to all faggots.", "score": 3, "replies": []}]}]}]}]}
{"title": "5 Reasons To Be Seriously Concerned About This Market", "selftext": "**1) Rising Interest Rates**\n\nThis in and of itself is not a serious concern. But the manner in which it is happening should be something to pay attention to. [As the yield curve continues to flatten](https://www.bloomberg.com/news/articles/2018-02-06/does-a-flattening-yield-curve-mean-recession) the prospect of a 2019 Recession grows more and more.\n\n**2) Increased Volatility**\n\nThe time of suppressed volatility is categorically over. I seriously doubt that we will ever see volatility fall below 12 for at least another 3-5 years. This low volatility environment has made many people complacent and as it continues to rise, the fear in the market will follow.\n\n**3) Market Valuation**\n\n[The current market P/E Ratio is at 32.10](http://www.multpl.com/shiller-pe/), the highest it has been since December 1999. This is likely a result of massive overextension in popular tech names that have P/E Ratios of over 50 in this environment of irrational exuberance.\n\nAnother concern is the Market Valuation to GDP ratio. This is also known as the \"Buffett Ratio\". This ratio has NEVER been higher than it is right now and should be a serious concern in terms of valuations in this market. \n\n**4) Margin Debt**\n\nI seriously believe that this is one of the greatest concerns in the market today. [The stock market is currently being propped up by $600 Billion of completely fake money in the form of margin debt.](https://www.advisorperspectives.com/dshort/updates/2017/12/27/a-look-at-nyse-margin-debt-and-the-market)\n\n**5) Warren Buffett Cash Balance**\n\nThis one is more anecdotal but I find it to be the most concerning. At the moment, [Billionaire investor Warren Buffett is sitting on a $109 Billion Cash pile](https://www.fool.com/investing/2017/11/07/warren-buffetts-109-billion-cash-problem-how-much.aspx). I've got a really bad feeling that he is waiting for something awful to happen before scooping up cheap shares from weak hands. \n", "id": "7w63pm", "created_utc": 1518108178.0, "score": 1167, "upvote_ratio": 0.98, "num_comments": 358, "comments": [{"body": "This too smart fo' this sub.", "score": 864, "replies": [{"body": "I know what do they think this is /r/respectableMoneyMakingAndProtectingYourAssets\nI believe they enjoy the company of men exclusively. ", "score": 123, "replies": [{"body": "> I believe they enjoy the company of men\n\nWho doesn't?", "score": 52, "replies": [{"body": "I know, right? We're all faggots here. ", "score": 28, "replies": [{"body": "Liking women is gay", "score": 16, "replies": [{"body": "It's only gay if you finish", "score": 7, "replies": []}, {"body": "Nothing more straight than two men having sex. All muscle and testosterone. None of that girly kissy shit. ", "score": 4, "replies": []}]}, {"body": "At least some of us are faggots with standards. I for one like my tendies peppered. And idiots who believe the bullshit \"market narratives\" they see in the business news deserve what they get.\n\nThe retarded radio yesterday was blaming the whole correction on a 2 percent US wage growth report. Sure thing, assholes. Stocks are deep in the red from London to Frankfurt to Shanghai and Tokyo because some faggots American department of labor stat was boring...\n\n", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 51, "replies": [{"body": "you can go to /r/weedstocks where everything is just about to burst upwards any day and anyone that sells anything is just an idiot with weak hands", "score": 43, "replies": [{"body": "That sub is toxic as fuck. But my weedstocks have leveled off and have been finishing green. ", "score": 2, "replies": []}, {"body": "Short ACB", "score": 1, "replies": []}]}, {"body": "/r/ooer seems your speed!", "score": 6, "replies": []}, {"body": "WSB is a shadow of it's former self", "score": 1, "replies": []}]}, {"body": "Totally agree.  I stopped reading after item #2 because they hadn't referred to anyone as a fag.  ", "score": 52, "replies": [{"body": "Jerome Powell is a fag. Wanting to slow the money printers", "score": 2, "replies": []}, {"body": "The use of fag and/or faggot is barometer of a good subreddit page. ", "score": 1, "replies": []}]}, {"body": "Or maybe opposite. Now that this sub is getting cautious, its perfect time to buy. ", "score": 6, "replies": [{"body": "shh!", "score": 1, "replies": []}]}, {"body": "Stupid stock bitch couldn't make I more smarter.", "score": 1, "replies": []}]}, {"body": "Can you just tell me in one sentence what to buy. ", "score": 284, "replies": [{"body": "Buy everything. Losing money is fine.", "score": 155, "replies": [{"body": "So buy Micron? Got it", "score": 54, "replies": [{"body": "The fuck is a Micron? The only things you should invest in is AMD, NVDA, and MU", "score": 48, "replies": [{"body": ">MU\n\n\nThat's Micron. Unless your satire went over my head.", "score": 37, "replies": [{"body": "Short answer: yes\n\nLong answer: whoooooooooshhhh ", "score": 77, "replies": [{"body": "short answer: yes\n\nlong answer: yeeeeeeeeeeeeeeeeeessssssssss", "score": 18, "replies": [{"body": "You cannnnn put it on the boooooarrrrrddddd\n\n\n#YUESSSSSSS", "score": 1, "replies": []}]}]}]}, {"body": "Those must be the phang stocks people keep talking about rite", "score": 1, "replies": []}]}]}]}, {"body": "Yolo 3x leveraged bear ETFs", "score": 27, "replies": [{"body": "Made 10% on $SDOW today alone. In at 19.00 and out at 21.00.\n\nEdit: in my 401(k) for yolo cred.", "score": 9, "replies": [{"body": "Your 401k lets you day trade?", "score": 4, "replies": [{"body": "That way no one can ever retire", "score": 18, "replies": []}, {"body": "Our self-directed option is run through TDA and works just like a regular brokerage account with no options or margin.", "score": 2, "replies": []}, {"body": "capitalone iras let you do (some) options even :)\n", "score": 2, "replies": []}]}]}]}, {"body": "SPY puts.", "score": 14, "replies": [{"body": "not with that iv. SPY put spreads.", "score": 10, "replies": [{"body": "If spy continues to drop (making your puts worth more) IV will also likely increase (making your puts worse even more). This risk here is that we trade up, or sideways (while IV goes down). \n\nBuying calls is where IV will seriously fuck you up, because as they increase in value, IV will drop, and your position will tread water even as you get closer to ITM. ", "score": 5, "replies": [{"body": "Yeah trading sideways is what I don't like. Small movements will still kill iv and make your options worthless fast. ", "score": 1, "replies": []}]}, {"body": "You don't want crushed?", "score": 3, "replies": [{"body": "not today daddy. ", "score": 2, "replies": []}]}]}]}, {"body": "All in SNAP. Then take out a loan and put all of that in on MU. ", "score": 8, "replies": []}, {"body": "Walmart", "score": 7, "replies": [{"body": "Not memey enough", "score": 1, "replies": []}]}, {"body": "http://www.3xetf.com/bear/", "score": 4, "replies": [{"body": "I was just reading this a few days ago.  Can I point out that Financials had the largest decline while consumer staples were holding up well.  That is a very bad sign.  When Credit Suise and CBOE rebound will this be over. ", "score": 1, "replies": []}]}, {"body": "Suneq", "score": 4, "replies": []}, {"body": "SH", "score": 2, "replies": []}, {"body": "For the short term (day trade) $UVXY grows as the market panics. ", "score": 2, "replies": []}, {"body": "Snap puts!", "score": 2, "replies": []}, {"body": "MRES, potassium iodide and SPXU on margin, loans, one of your testicles and a kidney", "score": 2, "replies": [{"body": "I did buy potassium iodide and SPXU this week!  ", "score": 2, "replies": []}]}, {"body": "Futures contracts are hugely leveraged so I would say those. I don't what exactly but it seems like a good way to make money if you guess right.", "score": 1, "replies": []}, {"body": "Ammo", "score": 1, "replies": []}, {"body": "RAD", "score": 1, "replies": []}, {"body": "Bitconnnneccctt", "score": 1, "replies": []}, {"body": "Hold ", "score": 1, "replies": []}, {"body": "TL;DR: Buy dollars with stocks.", "score": 1, "replies": []}]}, {"body": "Nice post.  I also am in a similar mindset, I’ve been in cash since December.   Unfortunately I missed out on some nice gains, and have no idea when to get back in.   ", "score": 123, "replies": [{"body": "You also missed out on some huge losses and corrections", "score": 118, "replies": [{"body": "Yep", "score": 20, "replies": [{"body": "I blew up my account from all-time highs down to the basement floor in a day. Locked out AH and couldn't bail when the ship was sinking. You'll be fine.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Werd ", "score": 1, "replies": []}]}]}, {"body": "This is the truth. I got out at the close of Monday and would have been just as well if I had gotten out in Dec.\n\nThis time next year it might look like I timed the peak pretty much perfectly. Or not, who knows. ", "score": 13, "replies": []}, {"body": "Since getting in December, the losses I've gotten haven't outweighed the gains", "score": 1, "replies": []}]}, {"body": "\"I made my money by selling too soon.\" - Bernard Baruch", "score": 19, "replies": []}, {"body": "BTFD", "score": 3, "replies": []}, {"body": "Two years", "score": 2, "replies": []}, {"body": "January gains were already completely wiped out. You did the right thing. ", "score": 2, "replies": []}]}, {"body": "I like it. I'm in a similar mindset. But to take profits now and turn account into mostly cash or hope for it to come up a bit?", "score": 144, "replies": [{"body": "I've closed all.my calls (except the ones down 99% lol, rip spx/qqq unless we explode green for the entire next week)\n\nI've sold out most of riskier and volatile shares like SQ/NVDA...gotta lock in profit for now can always buy back later\n\nLiterally the only thing I'm holding is JPM , V and LMT lol. All safer and not nearly as swing as tech stocks I was holding.\n\nThere's literally no reason to buy shit right now. Zero signs of an reversal, not even close acctually, zero good outside fundamentals  news...rates are shit bond market shitting the bed, Treasury concerns, fed concerns, Trump concerns, \n\nThere's too much noise and too much volatility. It's as simple as that. I'm in like 70% cash now and happily waiting. \n\nCall me a pussy or whatever the fuck you want, at least I'm not losing sleep at night worrying about major swings. \n\nThis is not a time degenerate retailers should be playing options. Even professional traders are gonna have tough times in this volatility. \n\n", "score": 125, "replies": [{"body": "As a bear, this types of knee jerk, fear based reactions get me so hard.\n", "score": 98, "replies": [{"body": "Meeee too friend, I've got a RAGING clue right now.", "score": 38, "replies": []}, {"body": "I have 10 different holdings in companies I think are all very solid companies. Out of all of them over the past week the one that has by far been the most resilient is Amazon. I am down 2.84% with Amazon while the average of the other 9 is 6.53%.\n\nI was thinking, this probably can tell me a few things. First, Amazon, although people say over and over again \"its overvalued\", there's something about it that makes investors *really not want to sell this company*. Another thing is the actual price of a single share (being around $1,400) makes it so the ownership is mostly institutional investors and not weak hand retail investors and new novice investors.\n\nI think the combination of those two things is why its performing so much better than average on a downturn.", "score": 18, "replies": [{"body": ">That feel when people talk about an equities movement over the course of a week as an indication of it's long term value\n\n*hnggggg*\n\n>there's something about it that makes investors really not want to sell this company\n\nPerhaps because so much institutional money is tied up into products like SPY that they literally cannot sell\n\n>Another thing is the actual price of a single share (being around $1,400) makes it so the ownership is mostly institutional investors and not weak hand retail investors and new novice investors.\n\nBRK and GOOGL have shown that a stock refusing to split has almost no impact. ", "score": 4, "replies": [{"body": "You are a contrarian. I bet I could bring up any point, even if you previously held that same opinion you would find a way to disagree with it.\n\n>That feel when people talk about an equities movement over the course of a week as an indication of it's long term value\n\nCause this has just been your average week right? Nothing notable about the last week?...  \n\nMore appropriately titled *\"That feel when you talk about an equities movement over the biggest correction in the past 9 years as an indication of its long term value\"*\n\n>Perhaps because so much institutional money is tied up into products like SPY that they literally cannot sell\n\nThe other holdings I have are also in SPY...\n\n>BRK and GOOGL have shown that a stock refusing to split has almost no impact.\n\nExcept that's factually wrong: https://www.investopedia.com/articles/investing/073015/stock-splits-and-their-volatility-effect.asp\n\n>Multiple researchers have proven that stock splits effectively lead to increased volatility. Desai, Nimalendran and Venkataraman examined sample splits consisting of 366 split accouterments by 41 firms listed on the NASDAQ (NDAQ\nNDAQ\nNasdaq Inc\n75.21\n-2.67%\n \nOf course we could both be wrong, its not a perfect science. But I think they are not unreasonable to assume these could be actual factors in it.", "score": 4, "replies": [{"body": "Meh, believe whatever you want, I've been wrong plenty of times. But I think relying on how Amazon has performed over the last week as an indication of it's value is ridiculous, and I don't think that's just my opinion, anyone in finance would say the same. ", "score": 3, "replies": [{"body": "You can read my edited comment above.", "score": 1, "replies": []}]}, {"body": "Get this factual discussion bullshit out of r/wallstreetbets", "score": 1, "replies": []}]}]}, {"body": "That's very convincing. How many shares are you trying to dump?", "score": 1, "replies": []}]}, {"body": "It's great because they are doing it to themselves", "score": 4, "replies": []}, {"body": "I’ve had a boner since Friday. ", "score": 1, "replies": []}]}, {"body": ">JPM \n\nBanks (at least STT and GS, I don't follow all of them that closely) have been moaning about low volatility affecting trading profits for a while now. I think this could really be profitable for them, but if the profits aren't enough they'll probably fall hard after Q1 earnings release. Not really sure how to play it, but it's definitely gonna be interesting.\n\nEDIT: I just remembered I also heard Blackrock complaining about low volatility, so I assume asset managers will be happy about this as well.", "score": 8, "replies": []}, {"body": "I'm in a bio I'm close to. ITOT and international market one. They're both for saving for a house. Planning on buying a house in a year or two. If market is still shit then I can always hold off. ", "score": 7, "replies": []}, {"body": "I changed my 401(k) contribution from 16% to 6%, and completely stopped funding my Roth IRA. That roughly $5,000 I'm going to pocket and buy myself something nice instead of waste away on this crash. ", "score": 2, "replies": []}, {"body": "being mostly cash rarely makes sense if you have the ability to use options. you can still be in the market and experience somewhat limited gains while limiting your exposure to market risk with otm puts on index funds like the S&P.\n\n>Even professional traders are gonna have tough times in this volatility.\n\nno they are not. they are already hedged, you can bet on that.", "score": 1, "replies": [{"body": "Oh I know but that requires constantly watching and keeping an eye on what's happening because the swings are violent and big..\n\nI have a QQQ put I bought last Friday that's up big now and cancelled out a number of my losses so I'm slightly even. \n\nBut people who aren't professionals don't have time to sit and watch charts and graphs all day...to play with options...which is 100% all on timing. \n\nIf you miss the boat, you are fucked. In that sense it's better to be in cash if you know for a fact you don't have the time to babysit these charts. \n\nYou cannot play options in this current volatile market unless you absolutely have full focus on the tape. You can't be at work and gambling like that. ", "score": 2, "replies": [{"body": "> constantly watching\n\nNo it doesn’t, I’m not sure if you don’t understand options, but that’s not how protective puts or collars work. Protective puts are spending a small premium (probably a couple percent) to protect your principle in the event of a crash. Collars just offset the protective put with covered calls.\n\nSPX options are European exercise, you can’t get assigned randomly. A collar strategy also doesn’t require constant monitoring. \n\nYou are thinking of buying / selling uncovered options to make a profit, which yes, is risky and requires watching all day long. I am talking about using options to hedge, which is to *reduce* risk. Protective puts are basically a set-and-forget strategy.\n\nFor example, a protective put would be buying 1 put at 10% out of the money, on 100 SPX shares that you actually own. There’s no risk of losing big there. If the market tanks you sell your put. If it tanks and comes back up before you could sell your put, well, you don’t really need that protection do you?", "score": 1, "replies": []}]}]}]}, {"body": "don't do either of those things. instead, buy a collar. you buy OTM puts that protect a percentage of your principle. these are called \"protective puts\". then you sell OTM calls, or \"covered\" calls.\n\nexample: buy 20% OTM puts - this protects 80% of your principle. well, it actually protects more than 80%, because options have theta and vega value, so in a crash, you might protect 82-85%. then, you can sell 10% OTM calls. this allows you to still experience up to 10% gains, over whatever time period you choose, but you collect premium for the calls and therefore it makes your protective put cost less money.\n\nadded bonus that SPX calls are european exercise style which is great when you're short the call. it means if the call goes in the money (over 10% gains) you have the chance to buy it back before it gets exercised\n\n\nthis is basically a way to allow yourself the chance to participate in some market gains, but also hedge against massive losses.\n\ndownside is you need multiples of 100x shares for whatever you're hedging. you **can** use something like SPX options to hedge a portfolio that isn't exactly SPX in and of itself, but you have basis risk to worry about there (your hedge instrument not tracking the underlying well)", "score": 5, "replies": []}, {"body": "I turned all to cash except disney this morning. Disney fell anyway. Obviously.", "score": 1, "replies": []}, {"body": "Its like catching a knife, but this time, YOURE THE KNIFE", "score": 1, "replies": [{"body": "Haha exactly. Need to sell when everyone’s buying and buy on days like yesterday. ", "score": 2, "replies": []}]}]}, {"body": "Let's review:\n\n1.  Most professionals would find this to be the most concerning of the five points.\n\n2.  There's already a lot of \"fear\".  If we're looking at emotions, we are still far away from irrational exuberance.\n\n3.  Snap, Tesla and Amazon may have stretched valuations, but I'm all in tech and every name I own has a PEG ratio of less than 2.  This is not 1999.  Tech companies are making tons of cash and this is only increasing.\n\n4.  YUP\n\n5.  True, but his biggest complaint for years is that his company is now too big to take on meaningful acquisitions", "score": 135, "replies": [{"body": "You're going to get \"PEG\"ed by 2 bears.", "score": 59, "replies": []}, {"body": "SNAP and TSLA just defy reason at this point. ", "score": 25, "replies": [{"body": "Both are propped up by hopes and dreams. The difference is TSLA has a proven monetization model and the hope is that they get there. SNAP has no reliable monetization model and the hope is that they figure out a way to monetize. Valuations of internet companies are about to plummet. ", "score": 6, "replies": [{"body": "It took twtr how long to make monkeys fly?", "score": 3, "replies": []}]}, {"body": "How about Shopify then...", "score": 1, "replies": []}, {"body": "the entire tech sector ", "score": 1, "replies": [{"body": "Idk. Data is king, and these few companies basically have a monopoly on it, and they know how to use it. They know more about you than your own mother, and they are only getting better at it. I just think long term the majority of these companies are going to continue to thrive.", "score": 8, "replies": []}]}]}, {"body": "> Snap, Tesla and Amazon may have stretched valuations, but I'm all in tech and every name I own has a PEG ratio of less than 2.  This is not 1999.  Tech companies are making tons of cash and this is only increasing.\n\nProblem is that internet companies make their money selling ads. They sell ads based on view numbers that are massively inflated by bots. One day, the old companies will get tired of paying for bot views. \n\n", "score": 20, "replies": [{"body": "So they are going to stop advertising?  Where else will they put ads?", "score": 7, "replies": [{"body": "That's what newspapers said ", "score": 12, "replies": [{"body": "Are you really comparing newspapers to the internet?", "score": -1, "replies": []}]}]}, {"body": "Online advertising is measured by performance. It doesn't matter to me how many views are real vs bots, I'm only looking at price per conversion.", "score": 7, "replies": [{"body": "Not really, it depends what youre targeting. Facebook sells ads by impression or by conversion ", "score": 3, "replies": [{"body": "Whether I pay by impression or conversion, I'm analyzing the success based on cost per conversion. How many bots there are is really of no consequence to me. ", "score": 1, "replies": [{"body": "But that implies your goal is a conversion. ", "score": 1, "replies": [{"body": "It does. If you're wondering if I'm unique in that, ask yourself why the entirety of growth in marketing spending the past few years has come on Google and Facebook's platforms.", "score": 1, "replies": [{"body": "That's what Im saying. All the growth is there, but a lot of it is artificial.\n\nIt's like when magazines tried to save themselves by offering 3 years of free subscriptions. They massively inflated their subscriber numbers in order to sell ads at a higher price.\n\n(It didn't really work). ", "score": 1, "replies": [{"body": "You say it's artificial but you provide no support for that idea. Almost everything on Facebook and Google is performance-based. The bots simply don't matter. Even companies just doing awareness advertising are still measuring results with actual consumers. Money in, results out. The number of bots involved in the process doesn't matter.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Bot views are P R I C E D  I N", "score": 3, "replies": [{"body": "Not if theyre vastly underestimating the number of bots ", "score": 2, "replies": [{"body": "Dear Faggot,   \nThere is something known as the Efficient Market ~~Hypothesis~~ Truth. This means that the market knows everything, and values everything accordingly, and therefore everything is P R I C E D   IN.", "score": 1, "replies": [{"body": "No, it's called defrauding investors. ", "score": 2, "replies": []}]}]}]}, {"body": "You're wrong. There may be 'bot views' but there are far deeper metrics that go into advertising and marketing. ", "score": 1, "replies": [{"body": "Not if youre paying per impression ", "score": 1, "replies": []}]}]}, {"body": "Number 4 sounds very alarming to a noob investor like me. The derivative market is a lot bigger than the stock market, with a few big red days, wouldn't the margin debt kinda collapse over people being margin called?", "score": 9, "replies": [{"body": "To understand number 4 I should be able to count up to 600 billion.  \nAnd I can't, so that point is invalid. ", "score": 30, "replies": [{"body": "Checkmate athiests", "score": 12, "replies": []}]}, {"body": "Number 4 is also one of the biggest causes of the 1929 crash. Everyone was buying stocks with borrowed money because the market always goes up after all, and they were all programed to BTFD and forget about it.", "score": 12, "replies": [{"body": "People were 4x as leveraged in 1929 as they are now, this is peanuts.", "score": 23, "replies": [{"body": "Hold my beer", "score": 24, "replies": []}]}]}]}, {"body": "regarding number 5, i need to investigate his logic on that. if that mother fucker started a startup competition with even just 1b USD (1% of his cash), he would create the biggest innovation program for 10,000 starving 20-somethings like me\n\nkeeping capital locked up is generally a waste when its on the scale of billions", "score": 7, "replies": []}, {"body": "Yeah unemployment is low and companies are constantly reporting better earnings. I don't see why the stock market can't be slightly overvalued and this interest rate increase just causing a minor correction. Nobody worried about any of these things in the bull market. The more I read on here about people selling the more I know to buy cause we are at /r/wsb ", "score": 1, "replies": []}, {"body": "> True, but his biggest complaint for years is that his company is now too big to take on meaningful acquisitions\n\nWhich is unintentionally ironic since his modius operandi is to buy entire undervalued companies (there's no such thing as too big in warren buffett's world)... but I completely understand why dividend issuers, who have been identified as being management retards, want to throw shade his way.\n\nEventually berkshire hathaway will become the American chaebol", "score": 1, "replies": []}, {"body": "What a crazy complaint. My company got too big and I don't know what to do now ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 43, "replies": [{"body": "I should have added that the Shiller P/E Ratio works on a trailing 12 month basis. \n\nAnd companies had solid earnings growth in 2007 until they didn’t anymore. The earnings growth is going to be propped up by the tax cut for the next couple quarters but when the Democrats take the House and Senate this fall all hell is going to break lose IMO.\n\n", "score": 12, "replies": [{"body": "The Democrats are very unlikely to win both houses. They might win the house but the Senate is very unlikely.", "score": 12, "replies": []}, {"body": "> And companies had solid earnings growth in 2007 until they didn’t anymore.\n\nWhere is the giant asset bubble that's going to burst and the systemic debt that brings down the house of cards? Comparing this to 2007/8 is inappropriate. The GR was caused by something totally different in terms of risk taking. \n\nAnd the Democrats? They won't be able to repeal the tax bill even if they take both houses. What more stimulus do you think the market needs at this point from the government? ", "score": 5, "replies": []}, {"body": "> I should have added that the Shiller P/E Ratio works on a trailing 12 month basis.\n\nthe market discounts the future - Shiller P/E has always been like looking in the rear view mirror ", "score": 1, "replies": []}]}, {"body": "You are off on the important question. It should be - do companies have solid enough earnings and growth when considering the discount rate to justify the current price. The market is currently providing its opinion on that. For too long the market was only asking your question and all it took is a little spike in the rates to remind that there are other factors in a valuation.   ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 26, "replies": [{"body": "Shiller is not going to 20. The current 8-year CAPE is still 27.5. Higher than any time other than before the Great Depression and the dot com bubble. \n\nAnd I feel the need to point out that doing an 8-year analysis is blatant cherry-picking. There are bad years in any 10-year period of time, that's not an unusual circumstance.", "score": 9, "replies": [{"body": "Preach Chigga ", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 76, "replies": [{"body": "I fully expect an end at some point, but there's too much good happening in the US market at the moment.  Corporate tax cuts, changes to tax on repatriation of cash are both huge.\n\nIf you are willing to sit out for potentially another year or even two years of good growth to avoid a crash, I guess that's a personal choice. ", "score": 7, "replies": []}]}, {"body": "Thanks just bought 100k", "score": 28, "replies": []}, {"body": "MORTGAGED MY HOUSE ALL IN ON SPXS SEE YOU ON THE OTHER SIDE BITCHES", "score": 52, "replies": [{"body": "Finally someone gets it!", "score": 16, "replies": []}]}, {"body": "My understanding about Buffett's money is that it's hard for him to find opportunities. It may be this, but it's hard to find something that will generate money when you need it to be so big", "score": 27, "replies": [{"body": "It's hard for him to find opportunities on the public markets, but there will be always be opportunities for investment.\n\n[Look at all his moved after the financial crisis](http://www.canadianbusiness.com/lists-and-rankings/warren-buffett-berkshire-hathaway-biggest-acquisitions/). \n\nBuffett is diligently biding his time, as he has done for decades, and waiting for value.", "score": 13, "replies": [{"body": "HE EATS MCDONALDS EVERYDAY AND HES NOT OCHOCINCO.\nHE'S GONNA DIE!!!", "score": 9, "replies": [{"body": "In over 80 years of modern market history there hasn't been one example of Warren Buffet dying. \n\nSpread your FUD elsewhere. ", "score": 35, "replies": []}]}]}]}, {"body": "This is a correction.  We are hopefully going to double bottom out here.   Its a reminder that uncertainty and volatility in the market are back and trading options could wipe you out very quckly when you are wrong. ", "score": 44, "replies": [{"body": "[deleted]", "score": 15, "replies": [{"body": "Not when shit stocks like grub twtr snap are rallying. ", "score": 22, "replies": [{"body": "I'll never buy options.  Buying options could mean you could end up holding only your dick.", "score": 12, "replies": [{"body": "Only if you ONLY buy options.\n\nI know this is WSB and all, but people just go full YOLO here.", "score": 9, "replies": []}, {"body": "What if you already lost your lil dickie. Asking 4 friend. ", "score": 2, "replies": []}, {"body": "Wise words man.", "score": 1, "replies": []}, {"body": "\"what's a spread?\"", "score": 1, "replies": [{"body": "The true retards would say something like Nutella.", "score": 1, "replies": [{"body": "long $NUT", "score": 1, "replies": []}]}]}]}]}, {"body": "Ill say it time and time again.  This subs retardation never ceases to amaze me.  Check /es futures over the SPX.  We have not hit the low from Monday night.  [link](https://dwq4do82y8xi7.cloudfront.net/widgetembed/?symbol=es1!&interval=4H&symboledit=1&toolbarbg=f1f3f6&hideideas=1&studies=&theme=White&style=1&timezone=exchange)", "score": 4, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Ok Ill give a serious reply.  You can play around with the time intervals, the 4h or 1h will make it easier to see.  The low monday night which is counted as part of the Tuesday trading day.  (I think anything after 5:15pm EST) was 2530.  \n\nSo we do have another 2% or so to fall before we can say double bottom.  Im not going to try and predict what happens.  But with these types of things, its really important to think of the markets as a 24/5 beast, rather than a 9:30-4:00 trade.  Especially when volatility starts going through the roof, and you're going to try to play the moves.  \n\nSo yes, we have not yet double bottomed.  From the time of your comment, we still had 3 or 4% yet to fall.  Still 2% away and it looks like we get there after all.  Gl", "score": 3, "replies": []}]}, {"body": "no longer true lol", "score": 6, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "That was on Tuesday, though. You said Monday night. Sounds like you need to do some more [research](https://en.wikipedia.org/wiki/Names_of_the_days_of_the_week) yourself", "score": 2, "replies": []}]}]}]}, {"body": "Triple bottoms are a thing, right?", "score": 1, "replies": []}]}]}, {"body": "6) China's Market\n\nChina's market is heavily influenced by the US market. The reason is because the Chinese have tons of money in it. China is the largest foreign holder of U.S. Treasury bills, bonds, and notes. China buys U.S. debt to support the value of the dollar. This is because China pegs its currency (the yuan) to the U.S. dollar. It devalues the currency when needed to keep its export prices competitive. Also note the China market is being held up by the Chinese government stimulus spending. That stimulus spending is slowly going away.", "score": 59, "replies": [{"body": "China remains our biggest wildcard. I trust none of their data. ", "score": 25, "replies": [{"body": "[deleted]", "score": 18, "replies": [{"body": "I think the Chinese have trouble trusting Chinese data...", "score": 14, "replies": []}, {"body": "smart man . i did the same. China is #1", "score": 3, "replies": []}, {"body": "How so? I frequent Beijing and feel probably the same as you. Anyone telling you China is third world is out of touch and is accepting the western propaganda without question. ", "score": 2, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "Yeah it really is amazing. I travel there for business about 12 - 15 times a year and see everything you're talking about. If you only got your info from reddit you would think that most Chinese people live in caves and gave never seem a road or a car. ", "score": 8, "replies": [{"body": "> If you only got your info from reddit you would think that most Chinese people live in caves and gave never seem a road or a car.\n\nThe majority of them still live in poverty. Only around 30 million live lives we would consider middle class, if I remember correctly, though those figures were from 2013.", "score": 1, "replies": []}]}, {"body": "this really puts china's rail infrastructure into perspective:\n\nhttps://www.constructiondive.com/news/ca-bullet-train-costs-increase-to-67b/515003/\n\n15 years for a single line in CA - $60+ billion \n\nvs. \n\nChina connecting the entire country in 15 years for $500 billion \n\n\n", "score": 4, "replies": []}]}, {"body": "> Frequents Beijing\n\n> China isn't third world\n\nThat's cute buddy. Try visiting the tier 4-5 cities in China, the minor towns, and villages that make up 90% of China. Most of China is classified as being third world. ", "score": 19, "replies": [{"body": "the tier 3 cities are the most interesting, they show the most signs of explosive growth. high rises, luxury cars, western fast food stores popping up everywhere\n\n", "score": 9, "replies": []}, {"body": "Yeah so third world that those people have more affordable health insurance that the majority of Americans and have access to public transportation. ", "score": 3, "replies": [{"body": "> Yeah so third world that those people have more affordable health insurance that the majority of Americans\n\nIs that why they go outside of China for health care if they have the means? You are very ignorant. China has so many people the state run health care doesn't give a shit about the individual. People die waiting in China. Rural areas of China and even some cities people are afflicted with diseases that have been ERADICATED in the west. Don't believe me? Go to your western doctor and ask what vaccinations you should have before going to China. You'll find the list to be quite surprising.\n\n> the tier 3 cities are the most interesting, they show the most signs of explosive growth. high rises, luxury cars, western fast food stores popping up everywhere\n\nThey are extremely volatile. The explosive growth and free market they are getting a taste of is antithesis to the modus operandi of the Communist party. That's why Xi Jinping is doing a big corruption stamp out. He's not happy about this and he wants the Chinese people to behave perpetually like worker ants than as individuals. \n\n> My entire point is that China isn't just competitive in labor anymore. They have a growing middle class and anyone trying to tell you they don't is lying flat out. \n\nThey have a growing middle class which is creating lots of social tension. I wouldn't bet on China long term. Eventually one of those educated middle-class Chinese men is going to come along and suggest that the Communist Party isn't so great. More people will agree with him. If you know anything about Chinese history, you should be aware that China pretty has never had a peaceful transition of power. If China was stable like you claim, Xi Jinping wouldn't be trying to stamp out as many opponents as he could while reinforcing the old school communist ethics his predecessors were beginning to abandon.", "score": 7, "replies": []}]}, {"body": "My entire point is that China isn't just competitive in labor anymore. They have a growing middle class and anyone trying to tell you they don't is lying flat out. ", "score": 1, "replies": []}]}, {"body": "Lol. Have you been outside of Beijing?     \n    \nMost of China remains 3rd world.", "score": 0, "replies": []}]}]}]}, {"body": "7) Government policy\n\nGovernment unable to sit down and set out a god damn spending plan. Constantly raising the debt ceiling is NOT the answer. They can't even work out the budget and are passing temp budgets just to avoid a shutdown. ", "score": 53, "replies": [{"body": "8) Pension crisis....\n\nHELLO you fucks. GE is about to go belly up because they have a fucking $30B dollar hole in their balance sheet, then these fuck heads went bankrupt(https://www.nytimes.com/2018/01/15/world/europe/carillion-bankruptcy-outsourcing-britain.html)\n\n\nThis shit is about to get real and no one is talking about it.", "score": 31, "replies": [{"body": "wow... this is big\nWith the massive construction in the UK about to come to a stop, because this company has so many projects.\n\nBad things are coming. \n\nNot to mention with the Brexit that is causing EU banks to leave the UK (which most of these construction projects were for these banks) This is bad for the economy.", "score": 5, "replies": [{"body": "Spring is right around the corner, ideal time for warfare. World-wide economic crisis will likely trigger wars. South Korea and North Korea are holding hands right now, this isn't going to end well.", "score": 2, "replies": []}]}, {"body": "GE is gonna go belly up due to poor management and selling/spinning off profitable companies (poor management). ", "score": 4, "replies": [{"body": "Yeah, and a pension crisis is inherently a management problem. One that just about everyone has. Most importantly government.\n\nhttps://www.bloomberg.com/news/articles/2018-02-07/as-ge-breakup-talk-heats-up-a-31-billion-problem-is-overlooked", "score": 2, "replies": []}]}]}, {"body": "Hey hey hey now, they're doing important things.  Like passing massive unfunded tax cuts.", "score": 63, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "can't have a spending problem if the government is shut down and can't spend\n\nhttps://i.imgur.com/Fr7eo7I.png", "score": 8, "replies": [{"body": "Which is why a government shutdown would actually be a good thing. Especially if they proposed a balanced budget.", "score": 5, "replies": []}, {"body": "Doesn't impact nondiscretionary spending which is 70% of the budget.", "score": 1, "replies": []}]}, {"body": "Says you", "score": 2, "replies": []}]}, {"body": "So now they need tax funds in order to fund tax cuts?\n\nYou are ruined, man.", "score": 2, "replies": []}, {"body": "You can only drain so much blood from a cow my friend. At some point it's time to stop being a glutton so your kids can have some blood too. ", "score": 1, "replies": []}, {"body": ">unfunded tax cuts\n\ndirect taxes on individuals is retarded", "score": 0, "replies": [{"body": "Especially at the federal level, frigging phoney republicans.", "score": 2, "replies": []}]}]}, {"body": "8) My balls itch\n\nThis has happened historically right before every recession ", "score": 13, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "they... raise the debt ceiling... bad idea\n\nand set unlimited spending until 2019.. after the 2018 midterm elections..", "score": 4, "replies": [{"body": "[deleted]", "score": 14, "replies": [{"body": "Just borrow more money; that's the solution. /s", "score": 5, "replies": []}]}, {"body": "Shouldn’t have a debt ceiling anyways. It’s one of those weird things only Americans have so they can create artificial crisis. ", "score": 4, "replies": []}]}]}, {"body": "8)/r/wallstreetbets\n\nWSB meming the market", "score": 1, "replies": []}]}, {"body": "I can definitely get on board with this concern.", "score": 4, "replies": []}, {"body": "China unpegged its currency around 2009.", "score": 1, "replies": []}]}, {"body": "This better be some bullshit bc I heard on CNBC that this is a correction and I'm planning vacations.", "score": 15, "replies": [{"body": "Vacation to the dump.", "score": 15, "replies": [{"body": "It's the way she goes.\n\nSometimes she goes, sometimes she doesnt.\n\nIt's just the way she goes.", "score": 8, "replies": [{"body": "The shit winds are ah stirring.  ", "score": 2, "replies": []}, {"body": "shes gone", "score": 1, "replies": []}]}]}]}, {"body": "The thing is I'm not sure if I should cut my losses at this point or wait for it to rebound. The losses are pretty minimal at the moment but it feels kinda bad that I am leaving at -5% when I could have left at +10% a week ago.", "score": 16, "replies": [{"body": "Better to cut out when you choose to rather than trying to cut out at “only a 10% loss”", "score": 8, "replies": [{"body": "I bailed at -5% for everything. Fuck this market.", "score": 4, "replies": []}]}]}, {"body": "Jesus, this is scary. I just got interested in this fucking game, but good thing I haven't done shit yet.", "score": 44, "replies": [{"body": "This is a good time to get interested. Pay attention and learn about why these things are happening. If you can handle her at her worst, you'll deserve her at her best.\n\nPlus, if we crash into another recession, it will be the perfect time for you to buy in!", "score": 100, "replies": [{"body": "\"If you can't handle me at my dipiest you don't deserve me at my mooniest.\" \n \n -- The Market", "score": 71, "replies": []}, {"body": "I thought the stock market could tank without causing a recession? ", "score": 15, "replies": [{"body": "Most of the time the stock market crashes before a recession, but the crash does not cause a recession. Investors read warning signals in the economy and cash out before the dangers come to fruition.", "score": 17, "replies": []}, {"body": "Nope, you're mistaken. It's either a bull market or recession. If there is an in-between, then you're not truly YOLOing.", "score": 7, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Okay will do. ", "score": 2, "replies": []}]}, {"body": "Yes, but a tank causes recessions often\n\n> Recessions generally occur when there is a widespread drop in spending (an adverse demand shock). This may be triggered by various events, such as a financial crisis, an external trade shock, an adverse supply shock or the bursting of an economic bubble.\n\nFrom wickerpedia", "score": 1, "replies": []}]}, {"body": "Lmao I was taking high school economics during the '08 crash. My teacher kept saying how profound a situation it was and how lucky we were to learn about it as it was happening ", "score": 11, "replies": []}]}, {"body": "Yeah, best choice is to go into SOLID low yield earners and keep cash at hand then jump into a paper account to try and learn a bear market. It's actually a good time to start because lots of people start in a bull market and get top cocky not knowing how brutal it can get.", "score": 15, "replies": []}, {"body": "This time last year people said the exact same thing. Goldman said there would be 90 trading days in 2017 before the market went South. ", "score": 12, "replies": []}, {"body": "Oh Jesus! u/erinadic is finally interested in investing! \n\n***BUBBLE BUBBLE BUBBLE!!***\n\nLong $ROPE boys.", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 37, "replies": [{"body": "SNAP...", "score": 39, "replies": [{"body": "If Benjamin Graham were alive, and he saw SNAP today, he would kill himself.", "score": 31, "replies": [{"body": "na he would be sendin dic piks on his snap with dog filter under usersame DaddyBenjiG and slayin' hoes", "score": 18, "replies": []}, {"body": "I just had to stop myself from inappropriately LOLing in the office.", "score": 2, "replies": []}, {"body": "Some might call that an intelligent investment.", "score": 1, "replies": []}]}]}, {"body": "Wait so this whole time i was supposed to be investing in hopes that I don't make money? Now i see why its buy high sell low! Now I get investing wisely but there's always going to that factor of how much your willing to gamble on a  company's success in the long term.", "score": 4, "replies": []}]}, {"body": "4) 600B of debt is a significant but small portion of the aggregate NYSE/NASDAQ exchange market cap.\n\n5) Buffet gets more money than he knows what to do with, for all we know that cash pile could be the result of some massive put spread.", "score": 13, "replies": [{"body": "> 4) 600B of debt is a significant but small portion of the aggregate NYSE/NASDAQ exchange market cap.\n\nBut it's not going to stop at 600. ", "score": 2, "replies": []}]}, {"body": "6) everyone who saw this movie back in 2008 is profiting with their bear bets", "score": 13, "replies": []}, {"body": "LALALALALA I CAN'T HEAR YOU LALALALA", "score": 8, "replies": []}, {"body": "Regarding number 2, it's much deeper than increased volatility. Volatility has been kept artificially low for years, and has become a player in the field when it was always supposed to just be an outside statistic.\n\nThe entire historic Bull market was driven by artificially low volatility (calm, always rising markets).\n\nThe volatility was kept super artificially low using all sorts of trading techniques and tools, including and especially due to corporations buying their own shares.\n\nThe market \"experts\" believed that by using machine trading and other modern trading tools, volatility, and therefore risk, would be a thing of the past.\n\nConsumers were buying stocks with borrowed money (which is historically cheap to borrow right now) and then using margin on TOP of that.\n\nThey did this because the market was ALWAYS going steadily, reliably up. So it seemed like a no-brainer, plus savings accounts and bonds barely gave you any money back, and stocks seemed so safe. Record low volatility, after all.\n\nOn Friday, the low-volatility bubble popped. Volatility came back HARD. This wiped out tons of people who had put their life savings in volatility indexes like $XIV. $XIV in particular got hit so hard they shut it down, and everyone's shares became worthless.\n\nIt's going to get much, much worse is my opinion. Historic. \n\n[*This volatility expert predicted everything that is happening right now, check out this podcast with him.*](https://www.macrovoices.com/360-chris-cole-volatility-and-the-alchemy-of-risk)\n", "score": 6, "replies": []}, {"body": "People who link to the fool should be banned", "score": 6, "replies": []}, {"body": "I keep shaking my head at all the \"but muh economy fundamentals\" arguments. \n\nYeah, the economy is doing great. The economy and the stock market are two different things though. The stock market can be overvalued when the economy is doing well (in fact, isn't that when it's the most likely to happen?). \n\nMarket valuation has been OMGWTF high for over a year now. It's a powder keg just waiting to blow. ", "score": 12, "replies": []}, {"body": "Because you posted this, we're going to hit all time highs next week. ", "score": 19, "replies": [{"body": "I would love to be wrong", "score": 19, "replies": []}]}, {"body": "No.5 is not something to worry over, buffet himself says he doesn't try to time the market.", "score": 4, "replies": [{"body": "Points 2-4 are all valid reasons however, interest rates shouldn't cause too much concern for security markets.", "score": 4, "replies": []}]}, {"body": "Very informative. OP is still a faggot ", "score": 6, "replies": []}, {"body": "Between interest rates, the fed, and the small correction this week causing all this volatility, what makes you think volatility won’t go back down within the next few months? There must be some other big factor to actually start a recession. Where did you find the info about the margin debt?", "score": 8, "replies": [{"body": ">  There must be some other big factor to actually start a recession\n\nVery few people actually predict the causes for a recession or market downturn before they happen. It's likely a reason no one is thinking about (or can't do anything about, like passive investing). ", "score": 13, "replies": [{"body": "Yall wont believe me... but. In Walmart checkout line in 2007, I was waiting, looking at my phone or whatever. Guy behind me, Thick Russian accent \"Excuse me. Can you hold my place?\" meaning he forgot something and Walmart is snail pace lines so I nodded he ran off to go get it. \n\nGuy came back and we started chatting. Russki was a professor at local university. Economics or something, began ranting at me about how our entire economy was about to collapse and there were shoddy regulations with big banks. I was a college tawt so I wasnt as seriously curious as I should have been. \n\nGuy saw this and, out of gratitude for thanking me for holding his place and chatting with him, reallllly tried to underscore just how fucking fucked we were. Got really emphatic. Explained everything as best he could to idiot college me. \n\nliterally got so invested in telling me that it was all gonna crash that as I wheeled my cart out to my car, he was telling me that I needed to shore up any money I had and get out of the country.\n\nAmazing. ", "score": 19, "replies": [{"body": "That’s an awesome story...I wish I met people like that today. Fuck man", "score": 2, "replies": []}]}]}, {"body": "The most likely cause is going to be the artificially low unemployment rate propped up by government support for failing industries combined with the extremely high rate of underemployment. Add the student loan bubble on top of that and the economy is about to go to shit.\n\n\nEdit: Second time was supposed to be underemployment, not unemployment", "score": 4, "replies": [{"body": "You are going to have to explain in more detail about this artificial unemployment. Also while I see the student debt being an issue I can’t really see it being even close to the effect of the whole subprime loan issue from 08. I would be curious to see the numbers associated with student debt though.", "score": 1, "replies": [{"body": "Sorry, I meant to say underemployment the second time. The low unemployment rate is propped up by the huge underemployment rate. The jobs keeping the unemployment rate low are shitty, superfluous, and likely to be automated in the near future. The house of cards is not going to stay up for much longer.", "score": 1, "replies": []}]}]}]}, {"body": "Wow every time we get a minor correction people go into fear monger mode. Calm the fuck down. The market will correct some for interest rates and overbullishness. Expect another 5% drop then back to schedule bull run. ", "score": 6, "replies": [{"body": "I'm always in fear monger mode. Market corrections are just the only time anyone actually listens.", "score": 4, "replies": []}]}, {"body": "Here's the average stock market returns:\n\n1926-1956: +10.77%\n1956-1986: +9.63%\n1986-2016: +9.99%\n\nStop trying to panic people with your own fears.", "score": 4, "replies": [{"body": "Who’s panicking?\n\nThe Stock Market is the greatest instrument of wealth creation ever created in the long term.\n\nIn the short term, it can be very volatile and dangerous. People have to pay their mortgages, car payments, and all their other life expenses. Losing all your money betting on a late-cycle bull is not always a good idea.", "score": 4, "replies": []}]}, {"body": "A response to #4. 600B seems like really insignificant. Yeah it's a decent amount of margin debt in absolute numbers, but the US total stock market cap exceeds $20T, it's maybe 5% of the whole market. In today's equivalent margin debt in 1929 would have exceeded $2T, far more leveraged than we are now.\n\nI think the biggest risk is really that for years now there's really been no alternative to equities and regular investors are about ready to cream their pants at 2.85% rates in bonds since we haven't even been able to get that for 10 years.", "score": 7, "replies": []}, {"body": "lol i was warning of a stock market crash here a week ago and was laughed out the room. You're all a bunch of faggots.", "score": 6, "replies": [{"body": "Nobody listens to a bear when a bull market has a full head of steam. I only made this post today because I knew that this is the only time that anyone would actually listen.", "score": 8, "replies": [{"body": "True, you're right about that! It's kind of hilarious and ridiculous though, how a week ago everyone here was laughing at people like you and I, and now they're all crying and fearful.\n\nWake up people. Stocks go up, stocks come down. They went up for too long, time to pay the piper. It happens every. single. time. you see these stock brokers and traders, who should know better and actually understand these things, all dumbfounded when crashes happen. Of course a crash is going to happen, even if this isn't one, a crash WILL happen, sooner than later. It *always* does and *always* will.", "score": 7, "replies": []}]}]}, {"body": "youll know when the correction is over because youll fewl like vomiting in your trash can", "score": 3, "replies": [{"body": "That was last week.\n", "score": 3, "replies": []}]}, {"body": "I'm not selling anything but over the next year I definitely am going to build up my own cash pile. This market right now is way to unpredictable. ", "score": 3, "replies": [{"body": "and here i am putting more money into it...", "score": 3, "replies": []}, {"body": "Same. Paid off my student loans with profits taken from last year and am now building up cash with the money budgeted for the payments.", "score": 3, "replies": []}]}, {"body": "Autists on r/wsb having an intelligent discussion about the markets???. Is this upside down day?", "score": 3, "replies": []}, {"body": "I'm sittin' on my own cash pile as well, but its no where near $109 billion. But I want this crash to happen so I can deploy it. BURN BABY BURN!", "score": 5, "replies": [{"body": "I make 26k a year. I'm anxiously waiting for rock bottom so I can scoop in and pick up whatever earnings there are to be had. I was in high school during the 07-09 market, but I watched closely. I'm so ready for these discounts. ", "score": 4, "replies": []}]}, {"body": "I actually went on all cash Last Friday....my friends all advised against it, but I'm locking in 30% overall portfolio gains....and my friends are now down 15-20% on their individual stocks...JDST to the moon, though. ", "score": 4, "replies": [{"body": "I lost \"only\" $500 by going all cash Friday. Would have been down thousands if I had not. I always prefer to cut losses early than wait until I am bag-holding so big a of a bag I just have to hold the bag of shame.", "score": 4, "replies": []}]}, {"body": "TLDR sell APPL and FB, buy BRK,B", "score": 2, "replies": []}, {"body": "SPY 280 calls FEB 16th got it", "score": 2, "replies": []}, {"body": "I'm really glad I panicked and sold all my stocks on monday :)", "score": 2, "replies": [{"body": "Lucky. I jumped back in Tuesday and got fucked Thursday. Still up 10% though from trading $VXX", "score": 1, "replies": []}]}, {"body": "I just had a fleeting thought of Warren Buffet buying 109 F-35 Joint Strike Fighters and becoming the world's most advanced air force just because he can. ", "score": 2, "replies": [{"body": "Maintenance costs will bury him in debt.", "score": 5, "replies": [{"body": "Can't be worried about maintenance costs when you don't own the planes anymore after Father Time has claimed his old ass.\n", "score": 2, "replies": []}]}]}, {"body": "Short the market then you pussy", "score": 2, "replies": []}, {"body": "Calling it now: We got our 10% but it isn't enough. On Friday, people will buy into this dip as people say we've corrected. Just like today, anyone who sees gains from these plays is going to want out at the first signs of weakness, be it Monday or Tuesday. This time it won't just drop 2-4% though. It will be a massive one day loss, ala black Monday. The above factors mentioned by OP all mean that P/Es must come down. Even at current valuations a lot of stocks still need to shed a lot of weight if their values are to reflect this. The fact we've now dropped 1000 points twice in a week's time should tell you that this is just getting going. Personally, I think anyone buying these dips is going to get absolutely slaughtered. \n\nEdit: *What I meant to say is:* YOLO all in TVIX tomorrow open on false sense of stability/support, sell on the inevitable crash next week. No balls, you won't", "score": 2, "replies": [{"body": "One of the concerns that I have that I could have added to the volatility point is the worry I have about how insanely fast we dropped 10%.\n\nRight now it looks like a healthy correction, but what people don’t seem to realize is that unless we have a massive bounce tomorrow, this will be the worst week on Wall Street since September 2008. Markets don’t just collapse like this unless there is something abnormal going on underneath. My hope is that all these VIX speculations are what is forcing many fund managers to sell so precipitously. But my fear is that it could be something much more nefarious that we won’t hear about for several weeks.", "score": 1, "replies": [{"body": "I'm with you.", "score": 1, "replies": []}]}]}, {"body": " #3 is CAPE, not the current PE ratio. It goes back 10 years - i.e. including the meltdown in 2008. PEs are high, but nowhere near as high as this number suggests.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Lol I just made a comment reply about this.\n\nThe actual economy is going to suffer from gridlock in Washington when Democrats take the House and Senate.", "score": 2, "replies": [{"body": "It's basically gridlocked now.\n\nThe market prefers gridlock, because it removes volatility.", "score": 6, "replies": []}]}]}, {"body": "4 and 5 are the only ones that really concern me:     \n\n1. Interest rates are still really low, we have a long way to go. Ideally they should be higher in a healthier economy. I don't understand the yield curve theory enough to critique, but it's definitely one of those 'historic results do not guarantee the future' kind of things.    \n2. The machines own volatility. They'll make it what ever they want without it being any indicator.    \n3. Most of the market is still well with in normal PE ratios. Heck Apple and Intel are at 17 and 20. It's the hype stocks which are inflated. Also, I wonder if the backwards looking earning calculation of the Schiller PE ratio is problematic when you back a high growth period right after a low growth period. There's a lot of room for the general market to absorb investment as individual stocks to playout.    \n     \nEven the last two might not be of huge concern.    \n4. Margin debt. Fucking Robinhood. I wonder how much of this is institutional vs individuals. Depending on where the margin holders are distributed, they might be able to absorb taking losses. Additionally, if a lot of that margin is held in the inflated PE companies, that could work itself out as big write off that has little impact on feedback mechanisms in the market.    \n5. Buffet only buys deals. Him having cash is less him expecting a crash, and more the market just being expensive. It's two different things.", "score": 2, "replies": []}, {"body": ">> This one is more anecdotal but I find it to be the most concerning. At the moment, Billionaire investor Warren Buffett is sitting on a $109 Billion Cash pile. I've got a really bad feeling that he is waiting for something awful to happen before scooping up cheap shares from weak hands.\n\nI find this one to be the least concerning. Aside from the fact that $109 billion is only a fraction of his portfolio these days, he's stated many times that the primary reason he's holding cash is for the flexibility to engage in large acquisitions. That doesn't give me the sense he's counting on a crash anytime soon.", "score": 2, "replies": [{"body": "$109B is only a fraction of his portfolio?? What do you mean by that? Their market cap is $500B. Isnt that pretty huge?", "score": 1, "replies": [{"body": "It's about one fifth. \n\nhttps://www.mathsisfun.com/definitions/fraction.html", "score": 1, "replies": []}]}]}, {"body": "Yield curve mattered in the 1960s when gold was money and the markets were not 100% fiat like the counterfiat we get lent from our broke ass government. BTFD and stop watching CNBC", "score": 2, "replies": [{"body": "I’m sorry but you’re just dead wrong.\n\nAre you trying to tell me that [the inverted yield curve in October 2007](https://www.clevelandfed.org/our-research/indicators-and-data/yield-curve-and-gdp-growth/yield-curve-archives/yc-20071031.aspx) didn’t correctly predict the 2008-2009 Financial Crisis? Fiat money has nothing to with with investor sentiments about the short term outlook of the Stock Market and the Economy more generally.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I’ve been at 50% cash since the beginning of the year and I’m probably going to increase that to 60-75% before the end of this week. I think it will be at minimum a 20% correction.", "score": 1, "replies": []}]}, {"body": "Alright so you've got a whole bunch of points that say the market's overvalued and that we could hit a drop in 2019. It is early 2018.", "score": 1, "replies": [{"body": "If you want my prediction I think we’ll trade sideways for most of this year and I think we’ll have significant downward pressure this fall.", "score": 1, "replies": []}]}, {"body": "Yeah. Looking like the fed back asset bubble is ending. 😞 ", "score": 1, "replies": []}, {"body": "I think it will just go back to 'normal', instead of the Janurary free money.\n\nExcept for margin debt, none of those are particarlly conerning and unseen before", "score": 1, "replies": []}, {"body": "man i should really try to invest in this buffet guy", "score": 1, "replies": [{"body": "There you go:\nhttps://www.marketwatch.com/investing/stock/brk.b", "score": 1, "replies": []}]}, {"body": "where are my quaaludes when i need them?!", "score": 1, "replies": []}, {"body": "While I agree that anything short term is probably a mistake (option plays), long term markets stay irrational only so long.\n\nStocks are expensive, but my question for you is: what asset class has any value and requires almost no time-investment?\n\nThe best thing one could do right now is what all the billionaires are doing (going into space or building nuclear fusion), but it requires a billionaire to organize a competing project. \n\nWithout projects like the above (they have a lot of government help typically, too), you have http://richardheinberg.com/bookshelf/the-end-of-growth-book. ", "score": 1, "replies": []}, {"body": "Given the strength of the economy, it's only a matter of time before the market steadies. This is just a blip (I hope).", "score": 1, "replies": []}, {"body": "The Fed had to stop quantitative easing so that when the lack of quantitative easing triggers the next recession they can implement quantitative easing to get us back to the point where we don't need quantitative easing anymore.", "score": 1, "replies": []}, {"body": "It's also time to short Australia", "score": 1, "replies": []}, {"body": "So what you're saying is puts?", "score": 1, "replies": [{"body": "* “Markets can remain irrational longer than you can remain solvent”*\n\n-John Maynard Keynes", "score": 1, "replies": []}]}, {"body": "> I seriously doubt that we will ever see volatility fall below 12 for at least another 3-5 years. \n\ngod i fucking hope so ", "score": 1, "replies": []}, {"body": "Apple still sitting on their buyback cash. Waiting for their company to crap along the market dump, than go private and hostile acquire Amazon & Google.", "score": 1, "replies": []}, {"body": "The rule is to have a PEG ratio less than 1. You’re already passed the threshold of fairly valued to over valued. ", "score": 1, "replies": []}, {"body": "I THOUGHT YOUR MOM SAID YOU COULDNT BE ON WSB ANYMORE U/HIGHSCHOOLHERO2", "score": 1, "replies": [{"body": "No, they just took half of my money and said that I’ll get it back at the end of the semester if my grades are better. I thought they were going to take all of it but they left me with half and I have been investing it.\n\n\nThey don’t even know that I post on WSB.", "score": 2, "replies": [{"body": "Very sneaky, well played. I hope you crushed January and avoided being crushed in Feb", "score": 1, "replies": [{"body": "I crushed it in January and I’m sort of getting crushed right now in February.\n\nI thought I was being defensive in some blue chip stocks and I was wrong. There was nothing safe from this correction.", "score": 1, "replies": [{"body": "It's kind of b*tch how (mostly) all equities positively correlate in a correction. Good news, stocks are 10% off!", "score": 1, "replies": []}]}]}]}, {"body": "You may have meant u/HIGHSCHOOLHERO2 instead of U/HIGHSCHOOLHERO2.\n \n ---------------------------------------\n \n^^^Remember, *^^OP ^^^may ^^^have ^^ninja-edited.* ^^I ^^correct ^^subreddit ^^^and ^^user ^^links ^^with ^^^a ^^capital ^^R ^^^or ^^U, ^^^which ^^are ^^^usually ^^unusable. \n \n ^^**-Srikar**", "score": 1, "replies": []}]}, {"body": "1) A short recession in 2019 is certainly possible. What's more likely imho is that the Fed simply continues to dangle the threat of interest rates rising to keep the market going the direction it wants it to.\n\n2) Volatility is great for making money. Especially volatility in volatility. Even better.\n\n3) This is actually interesting. What you've seen happening over the last 20 years tho is the market learning to price the future in a lot more, a lot faster, and a lot more effectively. Generally now when news actually happens the market has already priced that news in so once the news happens, the market is already reacting to still more future news. The economy is good and will continue to grow. The market is actually recognizing that.\n\n4) This simply means that people have more confidence in the future than they have in right now. As long as rates are low, people will continue to inflate the market with cash. See #1.\n\n5) Meh.", "score": 1, "replies": [{"body": "3) I’m not sure that people are as good at predicting the future as they think they are. Especially in the midst of a raging bull market that seems like it will never end.\n\n4) They will have to start raising rates soon. Wage growth in the most recent jobs report is the first inflation flag that we’ve seen in years. I also think that we’re seriously overestimating the economic benefits of the tax cut to our GDP. I could be wrong, but I don’t see our GDP growing at 4-5% like the Atlanta Fed has predicted it would.\n\nI can imagine a scenario in which Trump bullies Powell into keeping rates artificially low, but that will only bring more trouble down the road.", "score": 2, "replies": [{"body": "all that shit will be priced in in the next two weeks, if not sooner...", "score": 1, "replies": []}]}, {"body": "> 3) This is actually interesting. What you've seen happening over the last 20 years tho is the market learning to price the future in a lot more, a lot faster, and a lot more effectively. Generally now when news actually happens the market has already priced that news in so once the news happens, the market is already reacting to still more future news. The economy is good and will continue to grow. The market is actually recognizing that.\n\n#3 - I think for #3 we are all going to be in for a surprise. imo corporate america has stretched the average consumer too much and the economic fundamentals don't make sense. we have high national debt and to erode it away need to look to higher rates, that will only stretch the consumers even more (to the breaking point imo) - looking forward to seeing what is in store ahead though, interesting times. ", "score": 2, "replies": [{"body": "you do you bae", "score": 1, "replies": []}]}]}, {"body": "My man running the inverted pump and dump... keep up the worx my hypebeast", "score": 1, "replies": []}, {"body": "Since Warren buffet is 90 years old and apparently lives off McDonald’s and Coca Cola, if he does scoop up pretty much “everything” and dies is that basically the stock market equivilent of taking your ball and going home?", "score": 1, "replies": []}, {"body": "I know this isn't the wsb stance but holding instead of panic selling is much smarter but feel free to sell so I can buy some stock for sale ", "score": 1, "replies": [{"body": "I never said to sell. I would actually seriously discourage panic selling.", "score": 1, "replies": [{"body": "Ah I reread and saw I missed the tidbit at the end about Warren waiting for weak hands to sell. ", "score": 1, "replies": [{"body": "If people have been in the market for several months my advice would be that you should probably take some chips off the table tomorrow when the market bounces but I would definitely advise against completely jumping ship.\n\nThere’s a good to fair chance I’m completely wrong about all of my concerns that I posted here as well as the other 10 I didn’t post because I didn’t have time.\n\nSelling everything directly after a 10% drop isn’t just ill-advised, it’s downright retarded.", "score": 1, "replies": []}]}]}]}, {"body": "Once again big players are gonna make a killing scaring you pussyfoots out", "score": 1, "replies": []}, {"body": "So just be smart and short the s&p500", "score": 1, "replies": []}, {"body": "Damn MrTrader1 you got us all. Please turn the market back into a bull now thanks ", "score": 1, "replies": []}, {"body": "Since you seem to like Buffett, how about this quote?\n\n> Be fearful when others are greedy and be greedy when others are fearful\n\nSeems to me like it's time to be greedy. ", "score": 1, "replies": [{"body": "It was also Buffett who said:\n\n> \"Only when the tide goes out do you discover who has been swimming naked.”\n\n\nRight now there’s a lot of people that are naked. If you honestly think people are fearful right now you’re crazy. Everything I’ve seen is rambling on about “strong fundamentals” and “buy the dip” as if [this isn’t EXACTLY what people were saying back in 2007.](https://youtu.be/2E4gFUPznFI)\n\nI hope I’m totally wrong about this and that the correction is over, but there are some questions that have yet to be answered before I can say I’m comfortable with buying more here. I should also add that I’m not saying to sell because I believe that the market is always a good place to be over the long-term.", "score": 1, "replies": [{"body": "Of course no one knows what's going to happen, but I really don't see what would prompt continued selling. \n\nThere is no catalyst. The economy is firing on all cylinders. There's no housing bubble, there's no serious over-valuation, and there's plenty of earnings growth. \n\nThat's all I really need to stay in. Trying to time long term trends I don't think it's possible. \n\nIf you have profits, it might be a good idea to take them and wait it out, and I think we're seeing a lot of that. I wouldn't sell anything for a loss right now though. ", "score": 1, "replies": []}]}]}, {"body": "Damn it this makes too much sense!!! Fuck you, Fuck this sub, Fuck the market IM OUT !!!!", "score": 1, "replies": []}, {"body": "> This is likely a result of massive overextension in popular tech names that have P/E Ratios of over 50 in this environment of irrational exuberance.\n\nSo let them fall. My AMAT is 14 P/E. So is AVGO. CELG is at 13, and REGN at 16 despite a huge beat. And we all know poor MU has a P/E down around 6. \n\nIf some stocks are overvalued let them correct. For everything to get hit is silly.", "score": 1, "replies": []}, {"body": "I don't get it. Can I have dank version please? ", "score": 1, "replies": [{"body": "buy high sell low", "score": 2, "replies": []}]}, {"body": "market going up I threw more money in last. night - we hit correction levels, and everyone expected a correction before return to normalcy, so everyone else will be doing the same correctly thinking this was the bottom.\n\nthat's my DD yolo", "score": 1, "replies": []}, {"body": "you know, i wasnt thinking too much about the margin debt but what a problem this could cause should the market crash. Brokerages would be fucked. I myself have robinhood gold $2,000 being used completely but I could cover it if I needed to. I am sure many others couldnt because they didnt care about the risk", "score": 1, "replies": []}, {"body": "just buy the fucking dip you faggots", "score": 1, "replies": []}, {"body": "Food for thought the VIX hit an all time low back in 2007 and remember how great times were after that...", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Since I made this post the yield curve has become much flatter which is extremely concerning and makes it more likely than not that we will have a recession next year.\n\nOn the other hand, after I made this post, Buffett opened a massive position in AAPL and bought back a large chunk of his own stock.\n\n", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Considering how much worse 1, 3, and 4 have gotten I wouldn’t be so confident lol\n\nI’m going all cash next week and then I’ll be out until I see a good opportunity.", "score": 1, "replies": []}]}]}]}, {"body": "you forgot #6\n\nYou're a faggot", "score": 1, "replies": []}, {"body": "6) P O S T E R   I S   F A G  \n\nGo back to r/stocks and actually make money, dumbass.", "score": 1, "replies": []}, {"body": "Down 11% off the high and counting. I think we are gonna go to 20% correction territory. I need stocks to go up a tad bit tomorrow so I can sell all my shit.", "score": 1, "replies": [{"body": "And 20% is technically bear-market territory 🐻 ", "score": 2, "replies": []}]}, {"body": "The only thing I disagree with is your use of the CAPE as your only measure of valuation for the market. What the CAPE captures is the 2008 earnings on the S&P which were terribly negative, just about the worst ever actually. Once this rolls off the CAPE may actually drop substantially given the recent earnings of S&P 500 companies which could put it in line with the longer term average and not look nearly as overvalued as it currently does. If you look at other valuation measures though we are still overvalued, about 1SD away from the mean on P/E, P/B, P/CF, EV/EBITDA, etc. \n\nOverall, this post is certainly accurate on a lot of measures. But the one thing I think too is that his correction is happening because we have too much good news, ironically.", "score": 1, "replies": [{"body": "I think that’s a fair criticism.\n\nBut I also think that the Buffett Ratio (Market Valuation to GDP) is showing that this market is more expensive than at any other time in history. There’s no doubt that the economy is doing good, but it’s not doing nearly as good as the market is valuing it at.", "score": 1, "replies": []}]}, {"body": "[removed]", "score": -2, "replies": [{"body": "Please seek mental help.\n\nNothing you just said makes any sense.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Reynolds or generic??????", "score": 1, "replies": []}]}, {"body": "\\*Watches Mr. Robot once*", "score": 2, "replies": []}]}, {"body": "Great post", "score": -1, "replies": [{"body": "Same to you. Very insightful.", "score": 5, "replies": []}]}, {"body": "Wrong sub beeotch. ", "score": -4, "replies": [{"body": "The market for Karma disagrees.", "score": 1, "replies": [{"body": "Don't get sensitive bro ", "score": 1, "replies": [{"body": "Sorry. Didn’t mean to hurt your feelings there buddy.", "score": 1, "replies": [{"body": "Feelings are for your mom.", "score": 0, "replies": []}]}]}]}]}]}
{"title": "$NVDA EARNINGS THREAD: NVIDIA Reports Q4 Adj. EPS $1.72 vs $1.16 Est., Sales $2.9B vs $2.68B Est.", "selftext": "$NVDA EARNINGS THREAD: NVIDIA Reports Q4 Adj. EPS $1.72 vs $1.16 Est., Sales $2.9B vs $2.68B Est. ", "id": "7w89dq", "created_utc": 1518124946.0, "score": 233, "upvote_ratio": 0.98, "num_comments": 125, "comments": [{"body": "These are amazing numbers. Of course it's not as good of a company as snapchat but atleast make back the losses, pls ", "score": 266, "replies": []}, {"body": "Holy fuck", "score": 120, "replies": [{"body": "MY SAVOIR ", "score": 22, "replies": [{"body": "This entire markets savior. We might actually have a green S&P tomorrow ", "score": 21, "replies": [{"body": "I hope not. I’m leveraged against it. ", "score": -8, "replies": [{"body": "Thank you for your sacrifice. ", "score": 30, "replies": []}, {"body": "You're like the dude who walks up to the craps table and bets the Don't Pass line. ", "score": 13, "replies": [{"body": "Sure 2 1000 point drops in a week definitely signs of good times to come. ", "score": 8, "replies": []}, {"body": "The Don't Pass Line bet is a legit bet. You just aren't allowed to cheer about it, clap about it, talk about it, or wish quietly for it. You will shut the fuck up and take your money while avoiding eye contact with the rest of the players. \n\nThat's all we ask. \n", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Me looking at after hours after buying Nvda this morning https://m.imgur.com/gallery/70ieYN2", "score": 73, "replies": [{"body": "Very accurate. They just need to hold through", "score": 6, "replies": [{"body": "Earnings killed it. I'm holding out no matter what I HAVE FAITH IN OUR GLORIOUS LEADER JENSEN HUANG ", "score": 8, "replies": []}]}, {"body": "it dropped. ", "score": 1, "replies": [{"body": "So did the entire market bud I ain't skurred it'll prob drop more ", "score": 1, "replies": []}, {"body": "Gotta have faith g! ", "score": 1, "replies": []}]}]}, {"body": "I LOVE NVDIA HOLY FUCK I LOVE THIS COMPANY", "score": 34, "replies": []}, {"body": "Wow. I don't know why the fuck I invest into anything else. I went from - 10% end of day to +20% after hours. \n\nFuck an index fund, put it all in NVDA and sleep tight.\n", "score": 25, "replies": []}, {"body": "[deleted]", "score": 58, "replies": [{"body": "Imagine if the overall market wasn't collapsing, probably would be hovering around $300.", "score": 39, "replies": [{"body": "debatable. if market didnt tank it would have run to 280 in anticipation and it could have just sat there.", "score": 12, "replies": []}, {"body": "Looks like I finally made a good play. ", "score": 2, "replies": []}, {"body": "I have a limit sell at 300, 20x leverage.  Let's gooooooo!!!!!!", "score": 1, "replies": [{"body": "Where and how do you get 20x leverage? That's some impressive shit", "score": 1, "replies": [{"body": "200 in my account, pulled 1,800 off credit for robinhood gold which puts me to 4,000", "score": 3, "replies": [{"body": "Thanks for answering the question, that makes perfect sense", "score": 3, "replies": []}]}]}]}]}, {"body": "So bitter", "score": 1, "replies": []}]}, {"body": "LET ME SUCK YOU DRY DADDY JENSEN", "score": 33, "replies": [{"body": "Get in line!", "score": 15, "replies": []}]}, {"body": "Wow with earnings like that this bad boy may just stay even", "score": 12, "replies": []}, {"body": "Andrew Left can suck my dick.", "score": 29, "replies": [{"body": "Fuck that dude his track record with nvidia is laughable i swear he's just buying on the dips he causes. Fucking coward ", "score": 14, "replies": []}]}, {"body": "The market better fucking be up tomorrow", "score": 14, "replies": [{"body": "https://i.imgur.com/RHJLKW6.png", "score": 4, "replies": []}]}, {"body": "hope it's enough to save them, in any other market they would be on the march to $300 with upgrades tomorrow in te $350-$375 area, here they will be lucky to hold $220 /sad", "score": 21, "replies": []}, {"body": "Damn. Glad I bought last min shares", "score": 10, "replies": []}, {"body": "I'm so sorry I set a stop-loss on you, please come back", "score": 11, "replies": [{"body": "Haha I sold a few days ago too. I'm trying to close my margin this week and I really didn't want to risk the er. A bit annoyed, but at the end of the day profits are profits. Can't make money if you don't sell some point and I've been burned far too many times holding on. ", "score": 1, "replies": []}]}, {"body": "Price all over the place AH - up marginally to 223 ", "score": 11, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "HOLD FOREVER. ", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": []}, {"body": "https://i.imgur.com/RHJLKW6.png", "score": 1, "replies": []}]}]}, {"body": "jesus christ, just saved my portfolio", "score": 9, "replies": []}, {"body": "phew. almost got margin called.", "score": 7, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "https://i.imgur.com/RHJLKW6.png", "score": 1, "replies": []}]}, {"body": "They just destroyed the earnings. Forecast looks great, issuing more dividends and shares buy back. And beat projected earnings for the past quarter by 30%", "score": 7, "replies": []}, {"body": "Boys.... We have lift off ", "score": 7, "replies": []}, {"body": "NVDA might actually save the market.", "score": 5, "replies": []}, {"body": "This is better than sex, my goodness. Please God don't let this thing tank on market open tomorrow.", "score": 6, "replies": [{"body": "https://i.imgur.com/RHJLKW6.png", "score": -1, "replies": []}]}, {"body": "Big beat is probably expected. It's all gonna be about guidance on the call.", "score": 6, "replies": [{"body": "Might as well do an amzn tomorrow. Gap up and trend down all day. Macro seems to be king at the moment, all the tech stocks just follow nasdaq/spy.", "score": 2, "replies": []}, {"body": "They guided higher already.  The call should stoke the rally more. ", "score": 1, "replies": []}]}, {"body": "That’s an insane beat. Forecast looking at 2.84b to 2.96b vs estimates of 2.46b. We’re finally going to have a green market tomorrow losers. ", "score": 6, "replies": []}, {"body": "Honest to god the best company in the world right now. Fucking 5 steps ahead of everyone else, leveraging every emerging tech market. AI and driverless could be both bigger than the impact of the internet. Love it. Bought at 216. I’m modelling 30% EPS for 2019 (and this is conservative) and at ~50 PE we are talking 1.6x PEG... in-line with peers still!! And they are building a P L A T F O R M - entrenching them further. Incredible story. \n\nBuy. The. Fucking. Dips. I want the whole market to fucking fall out specifically so I can buy this shit up. ", "score": 6, "replies": []}, {"body": "+10.86% seems weird to me since good numbers mean -10% the next day this week. ", "score": 7, "replies": []}, {"body": "Bought 15k worth and was confident in my DD. Wiped my losses for the day. I see 275 soon ", "score": 4, "replies": []}, {"body": "BOUGHT 88 SHARES TODAY.\n\n88MPH TO THE MOON.", "score": 4, "replies": [{"body": "Congrats man ", "score": 1, "replies": []}]}, {"body": "I can't believe this is falling from highs AH. ", "score": 4, "replies": []}, {"body": "That's cute, now I'm at breakeven with my calls for the premium I paid if the price stays the same by expiration. Keep going, baby.", "score": 3, "replies": []}, {"body": "This my favorite stock in the whole wide world ", "score": 3, "replies": []}, {"body": "$240 NVDA calm down, anymore and ill nut ", "score": 3, "replies": [{"body": "$1 AWAY FROM ALL TIME HIGH ", "score": 1, "replies": []}]}, {"body": "Oh my god fucking thank you, I am deep into SPXL right now and this will off set some losses.", "score": 3, "replies": []}, {"body": "I finally wanna be alive", "score": 3, "replies": []}, {"body": "this is why diversification is for suckers ", "score": 3, "replies": []}, {"body": "Ah that's good. They are making money. This should drop the share prices nicely. Everyone knows you need to post massive quarterly losses like Tesla and Snap if you want to make money.", "score": 3, "replies": []}, {"body": "In at 229 in after hours, out at 243 in after hours. I'm not holding shit overnight these days.", "score": 3, "replies": []}, {"body": "Barely a pop, fuck", "score": 6, "replies": [{"body": "Up 11% now AH", "score": 3, "replies": [{"body": "check again", "score": 4, "replies": [{"body": "lollll", "score": 1, "replies": []}]}]}]}, {"body": "TENDIES!", "score": 2, "replies": []}, {"body": "It just went back to the level of early last week. Meh..", "score": 2, "replies": []}, {"body": "JENSEN \"YOU THINK YOU CAN GO RED ON MY GODDAMN WATCH?\" HUANG\n\n\n\n1T BY 2020", "score": 2, "replies": []}, {"body": "Damn man. Almost bought some distant calls but thought \"naw 15% is too high a move\"", "score": 2, "replies": []}, {"body": "God bless my 257.50s I got for 2 friggen dollars when we were -1000 points the other day thank u papa nvda ", "score": 2, "replies": [{"body": "Holy shit what's your expiry", "score": 1, "replies": []}]}, {"body": "When to sell?", "score": 2, "replies": []}, {"body": "jezus nvidia is killing it ", "score": 1, "replies": []}, {"body": "wowww crushed it", "score": 1, "replies": []}, {"body": "BIG BEAT", "score": 1, "replies": []}, {"body": "To the moon!!", "score": 1, "replies": []}, {"body": "Is this enough to live up to people's already super-inflated expectations? What's the guidance?", "score": 1, "replies": []}, {"body": "sold a few days ago on bad news. A bit sad, but as they always say, can't be sad about taking profits. ", "score": 1, "replies": []}, {"body": "Just hold, dont sell. This will see $300 when the dust clears which should be soon even tho every day right now is hellish. ", "score": 1, "replies": [{"body": "https://i.imgur.com/RHJLKW6.png", "score": 6, "replies": [{"body": "Accurate ", "score": 1, "replies": []}]}]}, {"body": "Holy shit. Which fucker is selling, Jesus Christ", "score": 1, "replies": []}, {"body": "Now we're cooking. It's above the high of the day. Please hold until tomorrow and follow through. ", "score": 1, "replies": []}, {"body": "I think I just came", "score": 1, "replies": []}, {"body": "Hopefully NVDA will save SOXL tomorrow", "score": 1, "replies": []}, {"body": "NVIDIA WILL BE OUR MARKET SAVIOUR\n\nPRAISE BE 🙏🙏🙏🙏🙏", "score": 1, "replies": []}, {"body": "C'mon bby", "score": 1, "replies": []}, {"body": "Sure is pouring it on in the aftermarket. I expect it to still tank at open tomorrow.", "score": 1, "replies": []}, {"body": "5% tax benefit now from the tax bill.  Even more tendies coming next quarters.  Stock just jumped another 4 points on that I think.", "score": 1, "replies": []}, {"body": "How does the invidya beat the EPS so damn much? ", "score": 1, "replies": [{"body": "Can't keep up with demand for their premium products ", "score": 2, "replies": []}, {"body": "Big improvement in GM too.. way above what I modelled. Another big opp from better channel management, they capture none of the stronger pricing power that retailers have. ", "score": 2, "replies": []}]}, {"body": "Good thing I pussied out on those last minute calls", "score": 1, "replies": []}, {"body": "Those are incredible numbers. Hopefully this lifts the stock market tomorrow ", "score": 1, "replies": []}, {"body": "why the fuck is it not moving to the moon right now then?", "score": 1, "replies": [{"body": "it is, but wait for guidance, I am jealous (holding AMD instead)", "score": 5, "replies": [{"body": "I put $5k into each stock last year.  Haven’t touched either since.  AMD is ~$4k and NVDA is ~$12k.", "score": 14, "replies": [{"body": "good choice", "score": 2, "replies": []}, {"body": "Did something similar, although I traded both and have proceeded to make much less money than you. So more effort for less money. ", "score": 2, "replies": []}]}, {"body": "I said this 7 months ago \"Was in @ 148, will long til 200\".\nGlad I didn't sell @ 200.\nAMD keeps having bad luck or it really sucks who knows...", "score": 1, "replies": [{"body": "They keep beating earnings and then proceed to not see positive movement in their share price. It's maddening. ", "score": 1, "replies": []}]}]}, {"body": "price adjusts fully after call and guidance", "score": 1, "replies": []}, {"body": "High val vs. other semi and general market shittiness right now. This fucking thing is the next Intel but better ran ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Asking the real questions, I'll settle for half the gains nvda gets.", "score": 2, "replies": []}]}, {"body": "Jensen Huang is my dad.", "score": 1, "replies": [{"body": "Daddy", "score": 1, "replies": []}, {"body": "ZaDdI", "score": 0, "replies": []}]}, {"body": "lets hope this boosts the market tomorrow\n\n(it won't )\n\n:(\n\ngood thing I bought aapl yesterday instead of this... FML", "score": 1, "replies": []}, {"body": "what a healthy P/E", "score": 0, "replies": []}]}
{"title": "I'm from the year 2050 here to calm your fears about the stock market", "selftext": "I decided to take a visit to 2018 to see what market sentiment is like and I find a bunch of fags freaking out about a small correction. Buy the dip you fools, I would kill to get $FB at $170 before the 2020 Zuckerberg presidency.\n\nHere's a timeline for those that are interested:\n\n11/2018 - AAPL reaches $ 1 trillion market cap \n\n8/1/2019 - Start of the North Korean War, markets drop 5%\n\n8/2/2019 - End of the North Korean War, markets rally till EOY\n\n2020 - Zucc wins the election, it is believed social media was a big factor. Trump leaves office having accomplished Dow 30k and screaming fake news at his opponent\n\n2023 - Mathematician proves that P=NP, making all digital currency worthless. The outflow of cash causes a new rally in the stock market.\n\n2027 - Tech is 60% of US market cap. The Nasdaq breaches 20k. FANG replaces the Dow as the new headline index\n\n2028 - Zucc leaves office with $FB trading at $1500\n\n2029 - AMZN price reaches par with BRK.A\n\n2031 - Unemployment reaches 50% due to automation, S&P falls to 5k support\n\n2034 - President Bezos and his AI cabinet announce UBI, making unemployment irrelevant, S&P rallies 30%\n\nlate 2030s - NFLX becomes wildly successful with its virtual reality dive games. If you die in the game you die in real life.\n\n2040 - AMZN finishes 10 year plan, successfully acquiring 70% of companies in the S & P 100\n\n2042 - AMZN acquires GOOGL, which owned the other 30% of the S & P.\n\n2044 - GOOGL's Singularity (tm) wins the presidential election\n\n2048 Q3: AMD announces earnings beat, stock falls to $10 support\n\n2050 Dec 12: Last time I checked, the S & P was at 24,200.\n\n\n\n\n", "id": "7w9cd1", "created_utc": 1518134170.0, "score": 859, "upvote_ratio": 0.97, "num_comments": 135, "comments": [{"body": "[deleted]", "score": 706, "replies": [{"body": "I though it was bull shit until I saw this.", "score": 233, "replies": [{"body": "Same", "score": 27, "replies": []}]}, {"body": "Dude speaks the truth", "score": 24, "replies": []}, {"body": "What about $MU?", "score": 7, "replies": [{"body": "One perfect horizontal line until the end of time. Never up and never down. ", "score": 53, "replies": [{"body": "Made me lol", "score": 3, "replies": []}, {"body": "AKA Trader's Curse", "score": 1, "replies": []}, {"body": "Is there any way to bet on *in*volatility of a stock??", "score": 1, "replies": [{"body": "Yea, XIV.\n\nlol.", "score": 3, "replies": []}, {"body": "Condor", "score": 1, "replies": []}]}]}]}, {"body": "My sides", "score": 3, "replies": []}, {"body": "That was my greatest \"WTF\" of 2017", "score": 1, "replies": []}]}, {"body": ">2048 Q3: AMD announces earnings beat, stock falls to $10 support\n\nDis is how I know it's real.", "score": 248, "replies": []}, {"body": "Even in the future we get fucked by $AMD", "score": 87, "replies": []}, {"body": "Quality shitpost", "score": 59, "replies": [{"body": "The highest of shitposted quality. ", "score": 15, "replies": []}]}, {"body": ">2023 - Mathematician proves that P=NP, \n\nBig if true. How do I play? Long SNAP?", "score": 50, "replies": [{"body": "This kills the world, btw.", "score": 15, "replies": [{"body": "Yeah I don't think any of the other stuff OP mentioned would happen. If P=NP then we know nothing. ", "score": 3, "replies": []}]}, {"body": "If P=NP well, fuck", "score": 6, "replies": []}]}, {"body": "Mr future, can you tell me when will I lose my virginity?", "score": 78, "replies": [{"body": "Mid 30s to an AI sex bot. But she leaves you after robots win equal rights in 2039.", "score": 295, "replies": [{"body": "but I'm already late 30s. Was I born too early?", "score": 62, "replies": [{"body": "2030s you old man", "score": 261, "replies": [{"body": "Perfect!", "score": 35, "replies": []}, {"body": "What a save!", "score": 40, "replies": []}, {"body": "So there's a chance", "score": 1, "replies": []}]}]}]}]}, {"body": "Saving this shit to cause a paradox when my calls expire worthless, when will Reddit ipo", "score": 79, "replies": []}, {"body": "Nice try Russia...", "score": 21, "replies": []}, {"body": "Wow looking out 32 years and you're still talking about the same 5 stocks.", "score": 19, "replies": [{"body": "Well yeah.  Its still /wsb", "score": 5, "replies": []}]}, {"body": "So long $AMZN $ROBO $BOTZ? Got it.", "score": 19, "replies": [{"body": "hehe this one thinks FB is irrelevant", "score": -2, "replies": [{"body": "AMZN goes to 300k assuming BRKA does nothing. With past returns for BRKA being prologue, AMZN goes for a million plus. FB being 1500 is irrelevant ", "score": 2, "replies": [{"body": "Meh, buy SNAP", "score": 6, "replies": []}]}, {"body": "Oh shit, good point. Long $FB Long $ZUCC", "score": 2, "replies": []}]}]}, {"body": "Mr. Future, can you tell me what happens to weed stocks?", "score": 13, "replies": [{"body": "MJX to $420", "score": 43, "replies": [{"body": "mu?", "score": 4, "replies": [{"body": "Moving sideways indefinitely", "score": 9, "replies": []}]}]}]}, {"body": "What day in 2019 does NVDA cross $1 trillion market cap? ", "score": 10, "replies": [{"body": "tomorrow", "score": 11, "replies": [{"body": "Do you think this is a god damn joke? ", "score": 18, "replies": [{"body": "Yes", "score": 11, "replies": []}, {"body": "Yes", "score": 5, "replies": []}]}]}]}, {"body": "Posts like these are what we should be sending to the aliens ", "score": 9, "replies": [{"body": "posts like these are why aliens dont visit us", "score": 9, "replies": [{"body": "Speak for yourself", "score": 1, "replies": []}]}]}, {"body": "tl;dr 2048 Q3: AMD announces earnings beat, stock falls to $10 support", "score": 16, "replies": [{"body": "Ill still be selling puts and calls against it", "score": 8, "replies": []}]}, {"body": "What can you tell me about my calls mr.future", "score": 8, "replies": []}, {"body": "Remind me! 32 years", "score": 9, "replies": []}, {"body": ">8/1/2019 - Start of the North Korean War\n\nWho are they at war with if it's not a continuation of the Korean War? ", "score": 4, "replies": [{"body": "KWII", "score": 5, "replies": [{"body": "Kiwi?\n\nI solved the scramble. Weird the best Korea attacks New Zealand of all other places.", "score": 7, "replies": []}]}]}, {"body": "why cant i find any 2048 puts?", "score": 7, "replies": []}, {"body": ">2020 - Zucc wins the election\n\nNot with [this hard hitting expose out there](https://youtu.be/Ew9oewvyd0M).  Sorry WSB, the only autist you're getting in the White House is Barron.", "score": 5, "replies": []}, {"body": "What's my pets.com sock puppet worth in 2050?", "score": 4, "replies": []}, {"body": "> 2029 - AMZN price reaches par with BRK.A\n\nDoes that mean, long AMZN or short BRK.A?  Just want to be sure.", "score": 5, "replies": [{"body": "super confused by this one too. Meh, buy MU", "score": 8, "replies": []}, {"body": "You probably want to short BRK.A because you're Andrew Left", "score": 2, "replies": [{"body": "Yes, given Buffet is getting pretty old, this is a logical thing to do.\n\nAlso don't forget, Spotify is committing fraud and needs to be investigated by CDC or FTC or SEC, whatever. Short $SHOP.", "score": 1, "replies": []}]}]}, {"body": "I believe this.   All of this.   ", "score": 3, "replies": []}, {"body": "When does Warren pass?", "score": 3, "replies": [{"body": "2020s, but Buffett's consciousness is digitally uploaded to a supercomputer in 2030 by Renaissance Technologies. ", "score": 20, "replies": [{"body": "Ah yes I believe they call him Tendiebot. ", "score": 13, "replies": [{"body": "Slowly cooked tendies bot.", "score": 3, "replies": []}]}]}]}, {"body": "Mr futureman will the Sixers make it to the Finals?", "score": 3, "replies": []}, {"body": "Needs more china", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "i have seen this before", "score": 1, "replies": []}]}, {"body": "If this doesn't fucking happen, I'm finding you in 2050 and punching you in the face.", "score": 3, "replies": []}, {"body": "What happens with weed stocks", "score": 2, "replies": []}, {"body": "Someone really wants sword art online", "score": 2, "replies": [{"body": "$NFLX did a dive adaption of SAO in 2037 but everyone died on the first floor. Shares fell around 20% until the next earnings beat and everyone forgot about it.", "score": 3, "replies": []}]}, {"body": "[Hmmmm](https://imgur.com/gla067m)", "score": 2, "replies": []}, {"body": "This is GOLD. Do I buy gold? ", "score": 2, "replies": [{"body": "Jesus I forgot early 21st century Barbarians actually traded metals", "score": 3, "replies": []}]}, {"body": "I come from further into the future to warn you all about this post. Do not trust this guy.", "score": 4, "replies": []}, {"body": "You are no John Titor.", "score": 4, "replies": [{"body": "El Psy Congroo", "score": 5, "replies": [{"body": "Be careful, CERN is watching us.", "score": 3, "replies": []}]}]}, {"body": "Can you check XOM for me?", "score": 1, "replies": [{"body": "XOM to $1.83.  FSLR to $37,921 before it's bought by AMZN in 2037.", "score": 2, "replies": []}]}, {"body": "...what...what about $MU?", "score": 1, "replies": [{"body": "It finally reached 40 and went back to its crease after 22 minutes", "score": 5, "replies": [{"body": "Yeah, but what about MU?", "score": 2, "replies": []}]}]}, {"body": "Thank you for your service!", "score": 1, "replies": []}, {"body": "What about the $MUcketship?\n\nHas the cycle kicked in for it yet?", "score": 1, "replies": []}, {"body": "Mr Future, there is a frenzy in Canadian Weedstocks, could you tell me the future.\n\nThank you future man.", "score": 1, "replies": []}, {"body": "!remindme 8 months", "score": 1, "replies": []}, {"body": "\n>2048 Q3: AMD announces earnings beat, stock falls to $10 support\n\n>2050 Dec 12: Last time I checked, the S & P was at 24,200.\n\n TL DR \n\nLong AMD and SPY calls/puts for 30 more years", "score": 1, "replies": []}, {"body": "These all seem possible. ", "score": 1, "replies": []}, {"body": "nice try fucko:\n\n1) no mention of $MU \n\n2) no mention of whether I marry Yellen-bae even though the little paper fortune teller thing I made said I would\n\n3) u called it $AMD and not $Ayymd\n\nthis guy is C O C O A P U F F S", "score": 1, "replies": []}, {"body": "AMD $10, this guy must be legit", "score": 1, "replies": []}, {"body": "I mean, one of these is bound to come true...", "score": 1, "replies": []}, {"body": "So long Robot Lube.......or as we like to call it $lube", "score": 1, "replies": []}, {"body": "Why did you take the time to write all this shit? There has to be a creative writing sub you can go to. ", "score": 1, "replies": []}, {"body": "I came back from 3057 to see if $GE ever made it back above $12.  They had a hard time after the Tesla model three fell back to earth and crashed into GE’s headquarters in Biloxi in 2496 spreading a lunar SARS plague for the better part of 509 years.  ", "score": 1, "replies": []}, {"body": "Seems like autism is still a thing in 2050.", "score": 1, "replies": []}, {"body": "TSLA makes only one car a year after promising to make a trillion. Stock soars 25%, reaches all time high of $30,000 after Muskbot  sends a telepathic tweet from outer space. ", "score": 1, "replies": []}, {"body": "P=NP and my BAC goes to 0", "score": 1, "replies": []}, {"body": "So... long AMD?", "score": 1, "replies": []}, {"body": "This is bullshit we all know trump is getting 2 terms", "score": 1, "replies": []}, {"body": "This sounds like a zerohedge article haha ", "score": 1, "replies": []}, {"body": "Remindme! 32 years", "score": 1, "replies": []}, {"body": "Some say MU is still hovering around $42 in 2050. Can you confirm that?", "score": 1, "replies": []}, {"body": "Fake, no mention of SNAP at 800 billion market cap.", "score": 1, "replies": []}, {"body": "So what happened to Apple after this year? First company to go from 1 trillion to zero?", "score": 1, "replies": [{"body": "Only people in my time who use smartphones anymore are 60-70yo millennials in retirement homes who don't even know how to hook up a brain computer interface (LOL). ", "score": 2, "replies": [{"body": "I'll have my brain engineered to process perfectly in order to evolve with the elite of humanity. Nice try.", "score": 1, "replies": []}]}]}, {"body": "You should get a job", "score": 1, "replies": []}, {"body": "Goddamnit. SEC about to shut us down for insider trading after this. Thanks.", "score": 1, "replies": []}, {"body": "Google gets the last laugh I see", "score": 1, "replies": []}, {"body": "Why don't you just give me a list of horses to bet on? ", "score": 1, "replies": []}, {"body": "How was p=np proven and four years later the tech sector is 60% of economy?", "score": 1, "replies": [{"body": "You don't need cyber security when the Zucc administration tracks your every move.", "score": 1, "replies": [{"body": "So the purge went flawlessly", "score": 1, "replies": []}]}]}, {"body": "Lol get fukt NK", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Because you touch yourself", "score": 7, "replies": []}, {"body": "Hi, am from the future. It is because you are too tan. ", "score": 5, "replies": []}, {"body": "He's from the future, not from the past. This is something like someone from 1991 asking you (from 2018) \"Who killed JFK?\".", "score": 1, "replies": []}]}, {"body": "You, I like you", "score": 1, "replies": []}, {"body": "Mr. Future I appreciate you giving us this heads up, if I may ask where will MU be at the end of this year? \n\nDo I kill myself or do I buy a bitchin new car?", "score": 1, "replies": [{"body": "Mmabet69, money always comes and goes, but a life can be lost only once. [Chat right now](https://suicidepreventionlifeline.org/chat/), or call us at 800-273-8255.", "score": 2, "replies": [{"body": "I'm gunna actually kill myself because of this message bot, thanks", "score": 2, "replies": [{"body": "Peace!", "score": 5, "replies": []}]}]}]}, {"body": "2022 - Elon Musk departs from the Earth in the Falcon UltraHeavy. TSLA stock rallies to $2,000 at the hope of a new CEO capable of manufacturing the Model 3 at a rate at least on par with the Boeing 747-8.", "score": 1, "replies": []}]}
