{"title": "Amazon to Launch Shipping Service to compete with FedEx and UPS.", "selftext": "", "id": "7wcxid", "created_utc": 1518177119.0, "score": 368, "upvote_ratio": 0.98, "num_comments": 179, "comments": [{"body": "[deleted]", "score": 111, "replies": [{"body": "It baffles me that Bezos is the richest man in the world yet an incredible amount of his employees are on food stamps and the working conditions are deplorable during peak seasons. I would never want this guy running a healthcare company which he jut started with Buffett and Jamie Dimon. Now he’s going to start a company that’ll compete with ups and fedex...probably pay workers an unlivable wage so that he and the top line of this company can benefit the most. ", "score": 62, "replies": [{"body": "Customers come first. Whatever it takes to get them low prices. Last guy who pursued that strategy also became the richest man in the world.\n\nAt least Amazon has good customer service.", "score": 37, "replies": [{"body": "Sam Walton was the richest guy in the world?", "score": 4, "replies": [{"body": "As of August the Walton family fortune was $145bn. Way more than Daddy Bezos. ", "score": 2, "replies": [{"body": "Just shows how rich you can get when you don't sell much stock and aren't charitable", "score": 6, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "El Chapo ", "score": 26, "replies": [{"body": "+1 true", "score": 4, "replies": [{"body": "grande if verdad", "score": 3, "replies": []}]}]}, {"body": "sam walton maybe?", "score": 7, "replies": []}, {"body": "Bill Albert Gate Einstein", "score": 16, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "I'm just being dumb, ignore me. ", "score": 5, "replies": []}, {"body": "They did make computers cheap which changed the world for the mostly better", "score": -1, "replies": []}]}]}, {"body": "The Waltons?", "score": 3, "replies": []}, {"body": "Vladimir Putin", "score": 3, "replies": []}, {"body": "Pablo Escobar Walton", "score": 3, "replies": []}, {"body": "Erwin Schrodinger", "score": 1, "replies": []}]}]}, {"body": "Had to doublecheck what sub I was in, Amazon engineers are making good money btw", "score": 13, "replies": [{"body": "But less compared to other companies of the same tier (Facebook, Google, Netflix, etc)", "score": 5, "replies": [{"body": "Ehhhhh, kind of. Not as often as you’d think. Amazon really fuckin loves to compensate with stock, so their base is shit but (eventually) their stock vestments are insane. Not to mention idk if you guys checked amazon’s prices. But if you had 100k in stock vesting in 2018 since working in 2013 it’d be worth 500k. Shit is bonkers.\n\nThat being said that payment schedule makes it harder to leave. If someone really wants to poach you they just can end up paying the future stock bonus value though.\n\nAny developer at amazon is earning their base in amazon stock after 6-8 years or so. That ends up being 260-400k depending on how much amazon’s shares have appreciated. Not as ludicrous as some compensation but we can’t all get the mythical 600k Netflix offers.\n", "score": 1, "replies": [{"body": "Yeah, I've heard of their unusual vesting schedule. I think it was 5/15/40/40 or something like that, but it was definitely back-weighted. \n\nI've also heard that Amazon factors in 15% yearly appreciation of their stock into the RSU compensation, and appreciation tends to be greater than that. At the same time, though, the stock of their peers also appreciate quite well and they tend to offer a higher pay upfront. ", "score": 1, "replies": [{"body": "Yeah, a bit more appreciation than that ;). It's been like >50% lol. It's back-weighted but in the end you get top ups so you end up getting about the same amount of stock every year. It just sucks to leave...but if some company really wants you they'll match the lost stock anyway.\n\nIf amazon stock starts hittin' that 0-15% gain level then their pay will be mediocre...until then it's p fuckin good.", "score": 1, "replies": []}]}]}, {"body": "Oh no I only make $120k instead of $170k Jeff Bezos is such a cheap bastard!!\n\nFuck off ", "score": -6, "replies": [{"body": "That's actually a huge difference.\n\nSource: Was AMZN employee", "score": 13, "replies": []}]}]}, {"body": "The turnover rate is still a problem, from what I hear ", "score": 2, "replies": []}]}, {"body": "Not exactly a perfect heuristic but salary is INVERSELY proportional to number of people who can step into your role effectively.\n\nAnyone can pack a box, labor availability drops price.\n\nFew can lead corporations, labor scarcity raises price.\n\nDo you pay more than the marked / demanded price for anything?", "score": 15, "replies": [{"body": "Exactly. If people want to pay more than the market rate, I’ll sell them any stock they want at a 10% premium, just let me know. ", "score": 5, "replies": []}]}, {"body": "is this satire", "score": 6, "replies": []}, {"body": "And what's equally baffling is that, aside from AWS, his company doesn't really make much of a profit.", "score": 6, "replies": [{"body": "wut", "score": 1, "replies": [{"body": "#AND WHAT'S EQUALLY BAFFLING IS THAT, ASIDE FROM AWS, HIS COMPANY DOESN'T REALLY MAKE MUCH OF A PROFIT.", "score": 10, "replies": [{"body": "what", "score": 2, "replies": []}]}]}, {"body": "*Plugs ears and closes eyes* DON'T READ THE FINANCIALS! BEZOS IS GOD AND TAKING OVER THE WORLD! AMAZON CAN ONLY GO UP!!!!", "score": 1, "replies": [{"body": "THEY CAN SHIP PACKAGES, MAKE MOVIES, SELL GOODS,  SELL DRUGS, AND SERVICE YOUR CAR!!!!", "score": 2, "replies": []}]}]}, {"body": "Pretty much indicative of most corporations in the world. Shareholders are of utmost importance and employees while assets are actually viewed more so as liabilities. Clearly he knows how to get him and his execs fucking rich though so he's achieving the 21st century American dream. ", "score": 2, "replies": []}, {"body": "Doesn't this make perfect sense, actually? You don't get to be the richest person in the world by being generous. ", "score": 2, "replies": []}, {"body": "Can you cite a source for this? My buddys sister got hired ay Amazon out of college making 70k", "score": 3, "replies": [{"body": "Pretty sure he's talking about the lower jobs, like the Amazon warehouses. ", "score": 18, "replies": []}, {"body": "Don't have a source for his comments (which are perpetuated on every Amazon, Tesla, and other large business threads) but here's a link to average wages of different positions on Glassdoor. \n\nhttps://www.glassdoor.com/Hourly-Pay/Amazon-Hourly-Pay-E6036.htm\n\nThe lowest I've seen is customer service rep at $11.17, and floats around $13 for low skill labor jobs. ", "score": 3, "replies": []}]}, {"body": "Oh my skillset is scanning barcodes, I should have everything boo friggity hoo", "score": 2, "replies": []}, {"body": "Who's the idiot the guy giving out the food stamps or the guy gaming the system.", "score": 1, "replies": []}, {"body": "Its a free market bro, if the employees could make more money elsewhere they would take another job. Shitty employment is better than no employment. Its the governments job to set set a proper minimum wage.\n\nAmazon has indirectly lowered the prices most users pay for all kinds of products. By aggregating all sellers/products, improving price comparing and transparency and also collecting and sharing an incredible amount of customer reviews, the customers win. \n\nAmazon still has a fuckload of salaried employees, just like JPM and Berkshire. That means paying for many healthcare plans, which are getting really fucking expensive. That means all 3 of these companies have a very strong incentive to lower the cost of health care. \n\nAlso don't overestimate the \"company\" that Bezos, Jamie Dimon and Buffett started. No real commitments or resources have been set, sounds like a moonshot to me.\n\n\nComparing Bezos net worth with his employees is not really a apples to apples. Bezos has pretty much held onto most of his amazon share. Its not like he's outright paying himself some obscene salary. Is Bezos supposed to sell his Amazon shares and give it to his employees?", "score": 1, "replies": []}, {"body": "Why does that baffle you. That's literally why he's the richest person", "score": 0, "replies": []}, {"body": "IIRC, Bezos takes home ~80k a year in salary. Most of his money comes from stocks & equity. \n\nNot saying his workers shouldn't be paid more though. ", "score": 0, "replies": []}]}]}, {"body": "Wait for FedEx and UPS stock to drop, buy cheap calls, wait for inevitable rebound, sell calls for big profit. ", "score": 140, "replies": [{"body": "That’s exactly what I did with Walmart and Target after Amazon bought Whole Foods.  Easy money", "score": 55, "replies": [{"body": "Kroger was a good play too. ", "score": 22, "replies": [{"body": "It was until I held too long KR dipped and my calls expired worthless lol", "score": 10, "replies": [{"body": "Ouch, happens to the best of us", "score": 4, "replies": []}]}, {"body": "COST was epic", "score": 7, "replies": []}, {"body": "Same here ! Congrats", "score": 3, "replies": []}]}, {"body": "this", "score": 2, "replies": []}]}, {"body": "Sell at holiday season ", "score": 13, "replies": [{"body": "> holiday season\n\nThis last holiday season was massive for UPS.  There was so much shit being sold online that it was taking 2 or 3 days for packages to arrive that were normally next day.  Even next day air packages had no guarantee of arriving on time.  I still don't understand how UPS didn't make shitpiles of cash from that.   Their stock seems to suck despite them basically owning the shipping business compared to their competitors. ", "score": 23, "replies": [{"body": "How much of that shipping was from Amazon? ", "score": 7, "replies": [{"body": "I'll give you a hint: 90% of holiday US online retail shopping was Amazon. IIRC this is between thanksgiving and xmas. ", "score": 11, "replies": [{"body": "I would believe this number.  I spoke with a UPS sales rep who was basically driving around trying to smooth things over with retailers like my company who were dealing with major delays and issues due to the massive volume.  He told us that volume spiked 50% over the highest levels they'd ever seen, and from a period between black friday and new years day.  The volume was just incredible. ", "score": 6, "replies": [{"body": "It was hell. I was working 18 hrs/day 7 days a week. I live 45 minutes from work and they paid to put me up in a hotel 10 minutes from the hub to cut my 1.5 hour commute down to 20 minutes so i could function.", "score": 9, "replies": [{"body": "Sorry to hear you worked so much. But do you know where these shipping parcels come from? Why the spike this year, Amazon or just general E-commerce?\n\nThanks.", "score": 3, "replies": [{"body": "Amazon was big for sure but everyone with an ecomm exposure was kicking: Walmart, Kohl's, Best Buy, JC Penny even.\n\nWalmart was neck and neck with Amazon as far as the number of direct loads we picked up at my hub. I don't have a broad enough view of the network to answer with any real certainty regarding totals.", "score": 3, "replies": []}]}, {"body": "Yeah dude they work you guys hard.", "score": 2, "replies": []}]}]}]}]}, {"body": "> I still don't understand how UPS didn't make shitpiles of cash from that.\n\nCompany's biggest cost is the obligations to its employees in the form of salary/benefits/insurance/preventative costs/education etc... also to deliver more packages they need more equipment (trucks, employees, just ordered 14 more jets on the latest earnings call iirc) plus when the work load reaches such a level it's impossible to deliver everything on time so there's profits lost there. It's a double-edged sword.\n\nIf Amazon is taking a serious shot at this this they'll probably treat their workers like dog shit in both working conditions AND salary, although that's just my personal prediction", "score": 2, "replies": []}]}]}, {"body": "Problem with the environment right now is that nothing is cheap.", "score": 3, "replies": []}, {"body": "The only issue with UPS rebounding is the whole year has been bullish and it's back to where it was at the start of 2017. Guess we'll see if it tumbles way the fuck down and then rebounds back to that point. ", "score": 1, "replies": []}, {"body": "fuck i just put 10K into fedex at 268", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 59, "replies": [{"body": "[deleted]", "score": 45, "replies": [{"body": "You see, kids these days, they don't know what the jazz is all about ", "score": 20, "replies": [{"body": "Grandpa, black people don't listen to jazz anymore.", "score": 5, "replies": []}]}]}, {"body": "Right? If this is meant to compete with UPS and FedEx it'll need to either be dirt cheap or the quality of the drivers will need to go way up.\n\nSeeing AMZL on a shipment is like seeing \"IT'S CANCER\" on a chest x-ray.", "score": 5, "replies": []}, {"body": "Absolutely fucking hate AMZL. Half the time the package is delivered to the wrong address. The other half of the time it just doesn't get delivered and they lose track of it.", "score": 1, "replies": []}, {"body": "IMO Amazon is a ticking time bomb in general. Their organization is totally unfocused and lacking in core competencies besides making their market cap grow. \n\nI can understand certain things like shipping, or whole foods, but wtf do cloud co.puting and entertainment have to do with their model? Bezos is trying to be like Buffet, but the difference is that Buffet segments his companies and lets each one manage itself. \n\nThere is just no reasonable way a single executive management team can focus on and grow all these departments.\n\nThe whole thing screams \"GE\" all over again. ", "score": -4, "replies": [{"body": "Cloud computing is easily their biggest strength and makes sense for an online company with tons of traffic that needs to never go down. ", "score": 20, "replies": []}, {"body": "I know you have no idea what you're talking about because AWS is one of their strongest lines of business.", "score": 18, "replies": [{"body": "That doesn't matter on the long term, what matters on the long term is that it is disjointed from their online retail core competency. Executives who are experts in one area cannot be experts in the other. \n\nThis is called scope creep and has murdered countless large entities before them, the most recent of which is GE.", "score": -3, "replies": [{"body": "That's why AWS already has [its own CEO](http://fortune.com/2017/11/29/amazon-web-services-andy-jassy-cloud/).", "score": 9, "replies": [{"body": "Sweet. Now talk to me about Amazon video, and their healthcare venture, and their logistics venture, and their grocery venture. \n\nAmazon has a smaller cap than Apple and yet is insanely more horizontally integrated. Apple = focused, well managed company, Amazon = ADHD kid playing \"business tycoon\" buying any unrelated industry they can afford.", "score": -2, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "All electronics. Unlike Amazon.", "score": -1, "replies": [{"body": "Haha no, they build ships, own a fucking theme park and an insurance company ", "score": 4, "replies": []}, {"body": "You mean Samsung Electronics is all electronics. They practically operate an entire country's breadth of industries.", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "Well they initially built out AWS to make amazon.com a better website. After building it for themselves they thought that other people may want a similar service and that's when AWS became a product. Since then it's grown into the industry leader and it has its own CEO (Andy Jassy) and organizational structure under the parent amazon corporate entity. \n\nTL:DR - you don't know what you're talking about", "score": 12, "replies": [{"body": "So... thanks for the history lesson. Would you like me to give you a history lesson on GE? Because it doesn't make a difference why they got into 20 different businesses. What matters is that entities that stretch their competencies out like that fail.\n\nAWS succeeding today doesn't matter on the long term, what matters on the long term is that it is disjointed from their online retail core competency. Executives who are experts in one area cannot be experts in the other.\n\nThis is called scope creep and has murdered countless large entities before them, the most recent of which is GE.\n", "score": -6, "replies": [{"body": "Why are you assuming the executives in charge of AWS are also in charge of the retail business?", "score": 9, "replies": [{"body": "Because Amazon has a single CEO. By definition, one executive is in charge of:\n\nAn entertainment company\n\nA logistics company (new)\n\nA grocery company\n\nAn online Retailer\n\nA cloud computing company\n\nA health insurance company (new)\n\nIt's preposterous.\n\nCompare that to Apple, or Microsoft, or Netflix, or any other titanic company.", "score": -4, "replies": [{"body": "You are pretty fucking stupid.  I can't tell if you're trolling or not", "score": 8, "replies": [{"body": "Nice retort.", "score": -2, "replies": []}]}, {"body": "Berkshire has one CEO, but its subsidiaries have their own CEOs", "score": 3, "replies": [{"body": "Amazon does not have that structure. Major difference.", "score": 0, "replies": [{"body": "In your head does Bezos just work 24 hours a day making all the decisions for all his business segments?  Never defers to the judgement to the people he's appointed to run these businesses?", "score": 3, "replies": [{"body": "No, in my head the fucking structure of Amazon is such that each of these departments is vertically integrated in fucking Amazon.\n\nUnlike Berkshire Hathaway which is a holding company with clearly segmented, easily saleable separate entities. Do you really not understand the fucking difference between Amazon and Berkshire Hathaway?", "score": 1, "replies": [{"body": "You don't think they have separate specialized teams for each business segment?", "score": 2, "replies": [{"body": "I do but so does Microsoft, for xbox, office, windows, and surface. The difference is that microsoft has a coherent structure while Amazon is a hodge podge of randomly assorted, totally unrelated industries.", "score": 1, "replies": [{"body": "I don't see why that's an issue if you hire people who know what they're doing. \n\nAlso making an Xbox has nothing to do with making office software.", "score": 2, "replies": [{"body": "It has a hell of a lot more to do with making a tablet, that uses windows, and has office preloaded, than a *healthcare company* has to do with *UPS and FedEx*", "score": 0, "replies": [{"body": "> I don't see why that's an issue if you hire people who know what they're doing.\n", "score": 1, "replies": [{"body": "Increases costs. Its a fundamental of business. It's why we dont have a single monolithic monopoly across all industries.\n\nEcon 101: specialization is more efficient. Hence: assembly line", "score": 0, "replies": [{"body": "Lol ok assembly line you got me beat. You're smarter than everyone you should short AMZN.", "score": 2, "replies": [{"body": "Here you go, dumbass. Literally econ 101. Graduate fucking high school before you discusd finance:\n\nhttps://www.khanacademy.org/economics-finance-domain/microeconomics/choices-opp-cost-tutorial/gains-from-trade-tutorial/v/comparative-advantage-specialization-and-gains-from-trade", "score": 0, "replies": [{"body": "You realize the last time Amazon vertically integrated they ended up creating the market leading service in cloud computing and web hosting right?\n\nGood thing no one at Amazon watched fucking Khan academy or AWS wouldn't exist.", "score": 2, "replies": [{"body": "Youre willfully ignorant and deliberately creating a dtrawman. \n\n", "score": 1, "replies": [{"body": "Hey everyone, this guy can't spell either!  This is the funniest joke account I've ever seen.  The Gentlescholar, aka the Village Idiot. I'm not kidding, every single thing you've written in here is mindnumbingly naive and misinformed.  You seem to have learned words that you don't really know how to use correctly, and concepts that are beyond your grasp.  I hope things work out for you because the business world is clearly not your forte. ", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "I thought AWS was under a separate LLC?", "score": 1, "replies": [{"body": "To explain this because everyone here was dropped as a baby, Berkshire owns Precision Casting. That is a totally independent company, it has no relationship or bearing on the rest of Berkshire. The staff there work for Precision Casting. The management of Precision Casting has no concern with Berkshire's real estate holdings. \n\nAWS is clearly integrated within Amazon. It's staff show up to work for Amazon. Executive management coordinates with Amazon's executive to integrate other elements with the AWS. It is *part of Amazon*", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Did you just compare AMZN to GE? I don't even know where to begin, but I will say AWS is the only reason I want to reinvest. I sold at 1400, and do agree the price is extremely inflated. The idea they don't deserve it is hysterical. Margins were 3.5 instead of low 2ish. Honestly, you've given me a bit more calm in these days. At least it allows me to blame incredibly stupid retail investors like yourself instead of rates, bonds, vix, margins, etc. ", "score": 4, "replies": []}, {"body": "STFU I worked for AMZN. its an amazing company, best management ever. The overall strategy of amzn is to try and capture as much of people spending as possible by given them great service and price. They make mistake (remember the phones ? ) but not many. ", "score": 2, "replies": []}]}]}, {"body": "It was only a matter of time, I'm going to stop being a degenerate and just go all in Amazon for the rest of my life ", "score": 90, "replies": [{"body": "All in IRA gains at $900. Best choice of my life. Guess I can send my kids to college now. ", "score": 24, "replies": [{"body": "Holy shit that was a solid move. Can I ask how much the IRA started with?", "score": 15, "replies": [{"body": "$900", "score": 36, "replies": [{"body": "Sorry. Thought you cashed out a IRA and bought the Amazon stock at 900. Congrats either way.", "score": 5, "replies": [{"body": "That is what happened. The dude u just replied to is not the same guy. ", "score": 9, "replies": []}]}]}]}, {"body": "So you sold?", "score": 1, "replies": [{"body": "Holding. If it falls again, I’ll add more. Correction or not. \n\nAlso, HEDGED with TVIX this years IRA contribution (some of it anyway). While the rest of you boys losing money, I’m UP. \n\nProtip: risk management. ", "score": 6, "replies": [{"body": "Atta boy.  You stay with it, son.", "score": 5, "replies": []}, {"body": ">  risk management.\n\nWhat's that?", "score": 3, "replies": []}, {"body": "Not sure if serious but tvix is like...not a good hedge. Puts are better.", "score": 1, "replies": []}]}]}]}, {"body": "I'm 50% and if I hadn't diversified the other 50% I wouldn't have lost about 20k. Plus the gains...", "score": 1, "replies": []}, {"body": "They've been talking about this for at least a year, it's not a surprise. ", "score": 1, "replies": []}, {"body": "Makes sense, they're poised to take over the god damn world. What's the point in fucking about with diversity when you can buy this once the market gets its shit together and ride it for an eternity. Now if they ever declare a dividend then it's game over everyone else. ", "score": 1, "replies": []}]}, {"body": "Amazon already has their own delivery service and it sucks. They hire anybody it seems in my area, and often, they aren't trained well. When I lived in a high rise apartment, they'd constantly leave packages outside of our building to get stolen by homeless people.", "score": 39, "replies": [{"body": "Which is weird since they usually pride themselves on customer service. Wonder if this is something they'll address.", "score": 6, "replies": [{"body": "TBF if that happens, they would just ship you a new one in 2 days, So they probably see that as acceptable loss for cheap labor. ", "score": 7, "replies": [{"body": "Which makes no sense because it is way, way worse to do that than pay barely more per hour (ups warehouse workers are not that much more expensive than amazon gig workers) and not have to deal with the customer service bureaucracy plus new product plus reshipping plus some small percentage of customer attrition due to bad experience.", "score": -1, "replies": [{"body": "Can you prove that? I’m guessing they did the math.", "score": 12, "replies": []}, {"body": "For all we know AMZL is an internal threat to UPS/FedEx in order to hold UPS/FedEx at lower agreement prices for them and we are just being used as pawns. \n\nIf they agree to (110% arbitrary and bullshit numbers here) a $2B agreement with each company, and then they implement their own they may be able to force UPS/FedEx to cut their agreement even further down to maybe $1B or less per year, or UPS/FedEx risks losing a full $2B they were expecting in revenue. If that costs Amazon a few million dollars in replacement merchandise, and a few “free” months of their prime service to some customers, it could drastically come out far in advance. \n\nAMZL is fucking bullshit from a consumer standpoint, but it may make perfect sense from and corporate standoff standpoint. ", "score": 2, "replies": []}]}]}]}]}, {"body": "Amazon better watch out or they're going to get Teamster'd and have little Hoffa all up in their shit.\n\nGood luck, it's a tough space to break into, just ask DHL who had some experience. I reckon if anyone can pull it off it will be Amazon though.\n\nAs an operations manager at UPS for 15 years i might just be dropping them a resume.", "score": 12, "replies": [{"body": "Right now they use an uber-like app which is why you see so many stories of shitty service.", "score": 4, "replies": [{"body": "[Quite literally](https://youtu.be/t7646MddF00) ", "score": 6, "replies": [{"body": "LOL I was waiting for someone to link this", "score": 4, "replies": []}]}, {"body": "If they are trying to market this service to business customers that kind of shit (hahaha) isn't going to fly.\n\nBusiness customers expect and demand professionalism and consistency. An Uber like infrastructure is not very conducive to that.", "score": 3, "replies": []}]}, {"body": "The hubris a lot of these companies display is mind-numbing.", "score": 3, "replies": []}]}, {"body": "Amazon is the new Standard Oil but at least they have cool stuff.", "score": 8, "replies": [{"body": "East India Company had cool stuff.", "score": 6, "replies": [{"body": "they were SPICY", "score": 3, "replies": []}]}]}, {"body": "UPS and FedEx should raise rates to put pressure on Amazon. There is no way SWA can match economy of scale of UPS, Fedex without incurring huge debt. Internet companies fall flat on their face when dealing with real world logistics and costs that can't be automated or outsourced. You still need a ton of trucks, planes, and benefited workers to deliver to your door.", "score": 15, "replies": [{"body": "This would be very clever but super risky. ", "score": 3, "replies": [{"body": "where's the risk?", "score": 1, "replies": [{"body": "For one, legal risk. The other, the usual cartel risk where massive benefit potential exists if one betrays the others.", "score": 1, "replies": []}]}]}, {"body": "That's very smart, took a couple of read throughs to get it fully. Would almost require collusion between the two, however.", "score": 2, "replies": []}, {"body": "This would be anti-competitive and very litigious for Fed Ex and UPS. They can't raise rates on a specific vendor's delivery and not raise rates on everyone else. ", "score": 2, "replies": []}, {"body": "Isnt that partly how Netflix murdered Blockbuster's attempt at streaming video service?", "score": 1, "replies": []}]}, {"body": "Fuck it I think its time to sell my kidney for calls. ", "score": 7, "replies": []}, {"body": "They should buy the USPS. ", "score": 7, "replies": []}, {"body": "what is the point where it becomes a monopoly? Didn't that steel guy get in trouble because he owned even the trains that moved his steel?\n\nEdit: I guess Amazon doesn't make most of the products their selling", "score": 5, "replies": [{"body": "It's true they hardly make anything and they are probably giving other company's a kick in the ass. So I doubt the government will step in. Although if they continue the pace they are at for the next 10 or 20 years it's only a matter of time before people will start to lobby against them. I hope that clarifies things…. but please do not let this extensive clarification distract you from the fact that in 1998, The Undertaker threw Mankind off Hell In A Cell, and plummeted 16 ft through an announcer’s table.\n\n", "score": 2, "replies": []}]}, {"body": "Why is it flat ?", "score": 5, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Yeah, picking up now, time to back up the truck", "score": 3, "replies": [{"body": "Lol.  Goddamn, I mean LOL.", "score": 2, "replies": []}]}]}]}, {"body": "Amazon doesn’t run things well so this new delivery service is going to be pretty crap.", "score": 5, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "I've never had any of my prime orders come late", "score": 5, "replies": [{"body": "AFAIK Amazon already has their own distribution to door fulfillment which sucks. Packages in Boston are shipped through Amazon branded vans that consistently miss their 2day prime delivery by an extra day or two. I think I have a free year of prime at this point. ", "score": 2, "replies": []}, {"body": "Depends on your post office. I don't think I've ever had my post office deliver a package on time. They've also failed to deliver stuff multiple times and just marked it as delivered on the tracking info, so I contact Amazon, they send me another one, and then 3 days later the original one shows up. The postal service is the epitome of federal government incompetence and inefficiency.", "score": 1, "replies": []}]}, {"body": "Your idea of usps is outdated. They're very reliable. I used to ship 25-50 packages per day and maybe one per month was late.", "score": 0, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "It is not branch dependent. You can track your packages, your local branch has little to do with on time delivery.\n\nMore likely, you do not label your packages correctly, or do not articulate your address properly for others to correctly label your packages.", "score": 0, "replies": []}]}]}]}, {"body": "Every.Single.Time\n\ndown 3.15%", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "it's not good, it's AMaZiN", "score": 21, "replies": []}]}, {"body": "I don’t think amazon realizes just how much capital this could require of them it’s so much more than let’s buy more planes and trucks and deliver our shit and other people’s shit. I’m sure they’ll be successful because apparently they can do nothing wrong \n\nI’m also saying this because I’m bag holding Ups hard right now. ", "score": 2, "replies": []}, {"body": "Everyone in the comments saying “I thought they already had their own” are you guys talking about Lasership? I’ve got a package from them once or twice, and they come in whatever vehicle like you guys are saying.\n\nThey are only on east coast though, I think. Maybe there’s another thing I’ve never seen?", "score": 2, "replies": [{"body": "Once had a PS4 delivered in a beat-up minivan. The driver's entire family was with him it appeared. But hey, Amazon got it to me the same day the order was placed. ", "score": 2, "replies": [{"body": "That is extremely weird. ", "score": 1, "replies": [{"body": "I order monster energy on auto once a month on Friday and it always comes on Sunday by some dude in a van lmao (east coast).", "score": 1, "replies": []}]}]}, {"body": "I remember getting \"Lasership\" a few times on the East coast, but I don't recall the vehicles.\n\nHere in DFW (Texas), you often get assigned shipments from a carrier marked \"AMZL.\" This is like a shitty Uber for package delivery. Joe Schmo can sign up for a delivery area, picks up packages at a fulfillment center, and then delivers them.\n\nPros:\n\n* Cheap\n\n* They have a cool app that lets them take a photo of where they left the package\n\nCons:\n\n* The drivers do not know what they're doing, ESPECIALLY when shipping to a business\n\n* The drivers are known to just leave packages at main entrances to apartment buildings instead of at the actual dwelling unit\n\nIt's exactly the kind of service you'd expect if you paid someone peanuts to execute logistics.", "score": 1, "replies": []}]}, {"body": "I've known this  for months", "score": 2, "replies": []}, {"body": "This is old news. Amazon said this months ago. ", "score": 2, "replies": []}, {"body": "Could have sworn they had shipping services already. What exactly has been bringing me my Prime Now orders?!", "score": 1, "replies": []}, {"body": "How do I short the US postal service?", "score": 1, "replies": [{"body": "Move to Mexico?", "score": 2, "replies": []}]}, {"body": "What happened to purchasing $XPO? It shot up like 30% a few months ago and stayed there simply on the news that Amazon or Home Depot might buy it.", "score": 1, "replies": [{"body": "came here to ask about this. \nIm guessing this is bad for XPO?", "score": 1, "replies": []}]}, {"body": "This is called \"diworsification\".", "score": 1, "replies": []}, {"body": "Their drivers are gonna be living the good life getting 12$ an hour in LA.", "score": 1, "replies": []}, {"body": "Fucking finally. Gawd Bezos, I get it takes years to plan this shit out but CUM AWN. ", "score": 1, "replies": []}, {"body": "They provide free fertilizer for your lawn with every package delivery.", "score": 1, "replies": []}, {"body": "What fuckin sub am I in? LateStage plebs coming through and fuckin spewing complete garbage. \n\nGet some marketable fuckin skills, contribute to a 401k and IRA, you’ll stop being poor. It’s NOT hard. \n\nIf you squandered that free fuckin education from K-12, blame your fuckin parents. Retards. ", "score": 1, "replies": []}, {"body": "Inb4 a billion AWS and SWA typos in analyst reports", "score": 1, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Why?  I like FedEx, and if the price is right, ill throw money that way.", "score": 1, "replies": []}]}, {"body": "Meanwhile fucking BABA is playing games with their bullshit logistics", "score": -1, "replies": []}]}
