{"title": "What is your best buy of the year so far?", "selftext": "For me, it was Boeing. I initially placed my low ball limit order of $105 when the stock was trading at around $140. I was not expecting it get filled anytime soon but SEC investigation came out and it went all the way down to ~$102. I was worried for a while but it went back up later in the day. \n\nIt's been going back up almost everyday and now I'm up over 25% in a bit over a month, not to mentioned the 4% dividend :)", "id": "4b189z", "created_utc": 1458351238.0, "score": 28, "upvote_ratio": 0.89, "num_comments": 92, "comments": [{"body": "AMD. Got in at 2.17, out at 2.70", "score": 12, "replies": [{"body": "Now it's 2.9", "score": 1, "replies": [{"body": "1.81 here :)", "score": 2, "replies": []}]}, {"body": "Same here, but I'm holding for the long-term as I believe this will hitting 4 or 5 later this year. Still, only have 4k in it though. ", "score": 1, "replies": [{"body": "haha I'm a student. I only had like 1.5 in it...i'm building consistant gains though", "score": 1, "replies": []}]}]}, {"body": "SWHC.  Guns rule.", "score": 5, "replies": [{"body": "> SWHC\n\njesus that's a nice looking chart!", "score": 1, "replies": [{"body": "I got in at 12.00.  Still riding!", "score": 1, "replies": []}]}]}, {"body": "UWTI at $1.35 a few weeks ago. Up over 100% return, which is a nice fat $95.", "score": 5, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Right? I bought 2 in at 166 wish I took all available cash I had and shoved it into tsla", "score": 2, "replies": []}]}, {"body": "CAT +15% plus a sweet dividend", "score": 3, "replies": [{"body": "I envy you man. I sold CAT at the beginning of the year for tax harvesting intending to buy back after a month. I thought I would wait for $55 but it kept going up as I was ready to buy back.\n\nI hope it crash again :]\n\n", "score": 1, "replies": [{"body": "I'd buy more on a downturn. Also, I've done real well on Ford", "score": 1, "replies": []}]}]}, {"body": "Bought Pfizer at $29.35 and have a .37% gain so far xD", "score": 3, "replies": [{"body": "I also have PFE at average price of $29.47 that I bought back in 2014. I was up over 20% at some point but I held on. Ideally, I would like it to be higher after holding it for nearly two years but I'm ok because of that sweet 4% dividend.", "score": 1, "replies": [{"body": "I bought it right before that big run up a month ago or so I should have sold but I'm looking for long term holding ", "score": 1, "replies": []}]}]}, {"body": "$ARO", "score": 3, "replies": []}, {"body": "FCX at $3.99 too bad I sold at $7.15", "score": 3, "replies": []}, {"body": "I'm up 40% since January. Rode $NEM up from $16 to $25. Got in $AMD at 2.05 and out at 2.37. Now I'm in $TSLA at $195 and $WDC at $44.37. Still holding TSLA and WDC. Each is about 40% of my portfolio.  ", "score": 2, "replies": [{"body": "Damn! Would you mind telling how many years of investing experience you have so far to get to this point? ", "score": 0, "replies": [{"body": "Honestly I just got lucky. I've been investing for about 8 years now. I picked NEM because people run to gold when the economy is in trouble. I picked AMD because their new graphics card had promising results and I can't imagine them dropping out of the tech world. I got in TSLA because they are way ahead in the electric vehicle field. I don't think there is a high barrier of entry to this market but they are building the giga factory which gives them an edge on batteries. I plan to sell at 240/250. I choose WDC because data grows exponentially with the internet and new technology. The slowdown cycle in the market has been priced in and it should be all up from here. With the acquisition on Sandisk, they have a comprehensive portfolio of hard drives and flash storage. WDC is a winner man.  \n\nAnyway, my whole portfolio totals too $15k and I'm 25 y/o. I've been watching stocks since highschool and have had some hard lessons in risky bets. I'm certainly not a role model investor.", "score": 10, "replies": [{"body": "Tesla was such a good buy, but I think holding too long is risky. Competition in the EV (and driverless inevitably) is going to ramp up so quickly between now and 2020. Not sure if Tesla will hack it against the motor giants, but my fingers are crossed for you sir!", "score": 1, "replies": []}, {"body": "/u/SlyWhiteGuy look your pm please", "score": 1, "replies": []}]}]}]}, {"body": "$opk in at ~10.00 and i expect it to blow up in 2 weeks", "score": 2, "replies": [{"body": "why's that? just a gut feeling or are you basing that on something? biotech has been shit all year so far", "score": 1, "replies": [{"body": "fda approval for rayaldee", "score": 2, "replies": [{"body": "looked into this a little bit, looks like a very promising medicine! essentially no side effects noted in any of their trials and met all of their primary measures. The only competition won't be up for approval until august and has a significantly higher side effect profile. From what I can find, it looks like they expect an decision from the FDA by the end of March?\n\nI think I'm going to buy a little Monday morning and see. good info.", "score": 1, "replies": []}]}]}]}, {"body": "AT&T and up until the past two days, Sprint", "score": 2, "replies": []}, {"body": "Bought LNCO back when it was at 50 cents... Sold when it hit 1.8 and cried in happiness for the next few days ", "score": 2, "replies": []}, {"body": "$AMD, $ABX, $NEM, $AG", "score": 2, "replies": [{"body": "Can you explain ^", "score": 1, "replies": [{"body": "Explain what?  \n\nI own $AMD at a cost average of $2.25, I bought $AMD as a flier that I think could easily be a 10-bagger if things go right.  \n\nI bought $ABX, $NEM, and $AG because the US economy is an over-leveraged disaster built on cheap money and the FED can't actually afford to raise rates like they claim they will (the meeting last week was a prime example of back-tracking from them which I believe will continue for the rest of 2016 until eventually they cut rates back to 0 again and start QE4).", "score": 0, "replies": [{"body": "Very very interesting. Why are you going after gold copper and silver companies? How does the US economy correlate with your strategy?", "score": 1, "replies": [{"body": "As the value of the dollar gets destroyed, the price of commodities tends to rise.  \n\nSee what happened to the price of gold during QE1-3?  Well I would personally bet my left arm we will see QE4 before we ever see the FED raise rates beyond 1% (I doubt we will ever even get back to 1%).\n\n", "score": 1, "replies": []}]}, {"body": "Talk to me about $AMD.  If what exactly goes right, will it reach 10", "score": 1, "replies": [{"body": "They have made a ton of investment in VR that competitors like Intel and nVidia haven't so if VR becomes as big as some people believe it might in the next 5 years I think it adds alot of value to AMD.\n\nThey have also started to corner the market for console gaming hardware, and are attempting to become the leader for PC gaming as well. \n\nOn top of those 2 specific markets that I think could add a lot of revenue for them in the coming years, the Zen processor looks to be very promising performance wise in general and could be a very profitable product for them for years to come.\n\nWith that said I still see AMD as a total flier/longshot in general and if you're looking for slow steady gains it's not the stock you want to buy.", "score": 1, "replies": [{"body": "So it sounds like you are in $AMD for the long run. (Years)", "score": 1, "replies": [{"body": "I might take some off the table at $3, but beyond that yes.", "score": 1, "replies": [{"body": "Do you see yourself looking at any companies to hold for a shorter amount of time that look promising?", "score": 1, "replies": [{"body": "Even though most gold/silver stocks have already doubled I think there is plenty more upside left.\n\nI also like oil and still see some value there, but since oil has recently recovered so much many of those stocks aren't quite as appealing anymore.  $HP was a steal in the $40's for instance.\n\nKeep in mind I'm just some random guy, not an expert.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "$TSLA. Bought at $180 it's $225 right now", "score": 3, "replies": []}, {"body": "Maybe WMB - up 20% over a little over a month + double digit dividend.", "score": 1, "replies": [{"body": "I doubt a 14% dividend is sustainable.", "score": 1, "replies": []}]}, {"body": "Go pro... Bought in around 9.90 ish should of sold when it hit 13 but holding on for now ", "score": 1, "replies": [{"body": "I honestly don't even think that $GPRO has found its bottom yet. Good luck my friend.", "score": 2, "replies": []}, {"body": "Good for you... I bought it when it was 30usd... ", "score": 2, "replies": []}]}, {"body": "My best purchase this year is NSR, at +25% since Jan 19 when I purchased.  Although that being said, since I started this particular portfolio (mid Jan), it's up a little over 11% with all stocks in the black. Good run thus far", "score": 1, "replies": [{"body": "Nice! It feels great to beat the market isn't it?", "score": 1, "replies": [{"body": "Sure does - I've been using the strategy in \"the little book that beats the market\"\n\nName checks out ", "score": 1, "replies": [{"body": "Lol, I thought you were joking but I look it up and the book actually exist! Thanks for sharing.", "score": 1, "replies": []}]}]}]}, {"body": "88E", "score": 1, "replies": []}, {"body": "ZION at low 20s. I wrote an ATM call against it and have been slowly rolling up each month. Up near 25 percent, although I haven't closed out the trade yet.", "score": 1, "replies": []}, {"body": "CMI. 14% gain over the week and a half I held it.", "score": 1, "replies": []}, {"body": "IBM on Feb 15th, up 19% since then.", "score": 1, "replies": []}, {"body": "AMD, double dipped on the current run. In at 2.30, out at 2.46. In at 2.31 and out at 2.70.", "score": 1, "replies": []}, {"body": "Fedex. Bought at $128.88, now $163.71. Up 27% in under 2 months.\n\nNVIDIA went from $27.83 to $33.81. Up 21.5% in the same time. ", "score": 1, "replies": [{"body": "I've been doing well with NVIDIA too. What do you think about Pascal? Are you going to hold?\n\nI also did real well with Hess. Bought in around 42 and it's up to around 53-54. ", "score": 1, "replies": []}]}, {"body": "I traded CPXX from 1.53 to 2.30. Then the \"cherrypicking\" streetsweeper bullshit article came out so i was too cautious to re-enter. CPXX is at 8.70 now. Oh well, gains are gains.", "score": 1, "replies": []}, {"body": "BNS.TO - I am up 20% so far", "score": 1, "replies": []}, {"body": "FCX.  I wish I bought in at 3.00 but I bought in at 4.50 and held while it dropped then sold at 9.50.  Waiting for it to drop back down again.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "Fortum, finnish energy company. P/E 2.5 got in at 11-year low at 11€. A steady 15% rise so far, more will surely come. Fundamentals are solid. ", "score": 1, "replies": []}, {"body": "CYS. Bought at $5.94, sold 6 weeks later at $7.84.", "score": 1, "replies": []}, {"body": "JUNO. In at 27. Still holding at 39. ", "score": 1, "replies": []}, {"body": "SDRL\n\nBought in at $3.58 and doubled up at $1.85, then sold during the short squeeze at $5.99 a couple weeks later. 120%", "score": 1, "replies": []}, {"body": "Writing SPY puts with June expiration has worked out really well so far. ", "score": 1, "replies": []}, {"body": "GGG got in at .20, still holding at .40 ", "score": 1, "replies": []}, {"body": "Up 35% on etp, up 20% on kmi, up 12% on pypl.\nDoing better this year than I did all last year.", "score": 1, "replies": []}, {"body": "ATW,  6.92 to 9.50 in two days. Love when people start covering their shorts.", "score": 1, "replies": []}, {"body": "Portfolio up 20% overall with the majority coming from:\n\nGNW: 2.38 to 3\nWG: 1.38 to 2\n\nI have a good feeling GNW can reach 5. I bought back in at 2.80. Going to ride until 4 and reassess.", "score": 1, "replies": []}, {"body": "TSLA in at 162.77 ", "score": 1, "replies": []}, {"body": "Baba at 62 about 3 weeks ago now almost 77", "score": 1, "replies": []}, {"body": "SPH bot late Dec. $24 then the $.88 divi and sold in March for $29\nYes I know the stock is now at $30", "score": 1, "replies": []}, {"body": "3/14/16 10:18:28 BUY +600 CPXX 1.6498 LIMIT\n3/14/16 16:33:01 SELL -600 CPXX 7.80 LIMIT", "score": 1, "replies": []}, {"body": "GE (up ~29%), CVX (up ~26%), PG (up 22%), T (up 18%).  Those are all long term buy and holds.  They all pay a solid dividend and are strong companies.  There is really no surprise that they are the best performers in my portfolio consistently.\n\nOn short term buys, I made over 20% on Rjet, Twtr, FCX, glncy.  But those are all pretty junky stocks that were bought with the intention of somewhat quickly selling on a pop.", "score": 1, "replies": []}, {"body": "In early February I bought $LVS (+19.7%), $BKS (+ 14.9%), $TUP (+ 15.9%) and $FUN (+ 15.3%). Doing pretty well after just 6 weeks. ", "score": 1, "replies": []}, {"body": "My best purchases so far this year have been RDSB at $37.10 and DIS at $88.30. Not quite 52 week low for either, but very close for both.", "score": 1, "replies": []}, {"body": "WYNN and WNDW", "score": 1, "replies": []}, {"body": "MTZ Mastec, doubled existing position on Feb 26th.\nBought at $16.12, now $19.87", "score": 1, "replies": []}, {"body": "CPXX. Bought at 1.20 got out at 8.30. Will never see those kind of gains ever again", "score": 1, "replies": []}, {"body": "$EPE made 80% on this trade. It was literally printing money that day. ", "score": 1, "replies": []}, {"body": " goog and googl have saved my portfolio. Worst buy of my life was FRE and FNMA. Watch out for falling knives! (Ouch!)", "score": 1, "replies": []}, {"body": "HGU. got in at $15 sold in and out last sold at $35 , got back in at 31.   Gold ETF \n\n", "score": 1, "replies": []}, {"body": "KRN.TO - in at .89, out at 4.00", "score": 1, "replies": []}, {"body": "CHK 2 weeks ago $2.94 out at  $4.38", "score": 1, "replies": []}, {"body": "National bank bought at 36,10,  its 43,91 now 17 %  ,baytex at 2,75$ around 80 % now and think it could go up to 15$ easily whitin a year if oil recover like it seem to do right now. start investing a month ago happy of my choice , i also bought enbridge but only + 5% now, my only looser is couche tard right now , i got in at 61,38 and its been very volatile and down to 56,82.....tought it was my safer investment lol, ", "score": 1, "replies": []}, {"body": "$FCX. Bought it mid January @ $4.34. Still holding... For now. ", "score": 1, "replies": []}, {"body": "TVIX  ", "score": 1, "replies": []}, {"body": "$CRDC\n\nin at 1.45. Out at 4.08.", "score": 1, "replies": []}, {"body": "Probably CVX in August at $71.  ", "score": 1, "replies": [{"body": "Nice. I got into CVX at $85 and it's been great to me as well.", "score": 3, "replies": []}]}, {"body": "MSFT ,TSLA and CRM .. TSLA of course being the most dominant . ", "score": 1, "replies": []}, {"body": "$AAPL (bought at $100); LNKD (bought at $115, sold at $122); MSFT (bought at $51, sold at $54).", "score": 0, "replies": []}]}
