{"title": "wtf is happening? every news I read points towards a crash, but the market keeps going up!", "selftext": "", "id": "4exbu4", "created_utc": 1460735453.0, "score": 43, "upvote_ratio": 0.94, "num_comments": 94, "comments": [{"body": "And my local news assures me that rapists and killers now own my town, yet I haven't gotten killed once. ", "score": 80, "replies": [{"body": "Raped tho?", "score": 47, "replies": [{"body": "Only by $SUNE", "score": 71, "replies": [{"body": "Well you deserved it then, you slut.", "score": 27, "replies": [{"body": "If you go out with a slutty portfolio like that you're basically asking for it", "score": 20, "replies": [{"body": "my portfolio is not an invitation ", "score": 12, "replies": [{"body": "Well, I'm coming over, anyway.", "score": 8, "replies": []}]}]}, {"body": "confirmed", "score": 3, "replies": []}]}, {"body": "Literally asking for it.", "score": 14, "replies": []}]}]}]}, {"body": "Because every news you read is from zerohedge :P", "score": 28, "replies": [{"body": "Zerohedge... horrible website, but absolute required reading for your sanity when you're short everything. ", "score": 19, "replies": []}, {"body": "Be careful.  Austrian School is to economics as Jenny McCarthy is to immunization theory.", "score": 11, "replies": [{"body": "So Keynesian then?", "score": 2, "replies": []}]}, {"body": "This is my favorite comment in some time", "score": 5, "replies": []}, {"body": "They have produced some valuable insights, but mostly completely shite\n", "score": 3, "replies": []}]}, {"body": "The market is rebounding from the last little panic at the beginning of the year. It's just going back to where it was. Everyone knows shit *will* hit the fan, but that could be in a month or a year. No reason not to make money, but you can tell people are more jumpy. Personally I think June/July will be an interesting time for bears, maybe not the apocalypse but it's gonna be a rough couple of months.\n\nEdit: Also it's tax return season, so spending is bolstered.", "score": 13, "replies": [{"body": "So why does everyone *know* shit will hit the fan? What is going to cause it to? Economic global events? Insolvent investment firms (like 2008)? I know people think that a LOT of companies are overvalued, based on the fact that their stock price has gone up but the companies haven't increased their revenue stream, but if people believe that's what the stock is worth, then that's what it's worth. I'm curious to your opinion as to why it is inevitable that shit will hit the fan. Dodd-Frank, while not going so far as to break up the banks, put a lot of checks and balances in place that are regulating these bank's actions. This article says that since 2008, [The fed were responsible for 93% of all market movements](http://tradinggods.net/trading-gods-blog/the-fed-responsible-for-93-of-stock-markets-movement/). It seems to me that since Yellen keeps being so dovish, the market will continue to climb. \n\nOil will climb back up, even as developed countries cut their consumption, because developing countries will increase their consumption, at least for the time being. Too many countries are dependent on oil as a revenue source to *not* curb production to increase prices. \n\nOn top of that, where else will people put their money? The US market is seen as not healthy, but its healthiest in the world. No one is rushing to put their money in the EU, especially with the refugee crisis going on. China is so full of corruption and party politics that international investors don't trust it. Investors sure as shit aint buying treasury bonds. In my mind, the US market only tanks if there is something *better* to put your money into, and nothing really comes to mind.\n\nSorry for the paragraph, I just don't know why everyone thinks the market will tank soon, so I'm interested in hearing some reasons. ", "score": 17, "replies": [{"body": "[deleted]", "score": 28, "replies": [{"body": "Very well written....you might be the only one who graduated college in this sub. YOLO-Fucking-Diem", "score": 9, "replies": []}, {"body": "This message has been removed because your OTC limit has exceeded. If you feel this is an error please message /u/xBonerDetective with a brief explanation to petition this automated judgment imposed on your post. Este mensaje ha sido removido porque ha excedido su límite de OTC. Si usted siente que esto es un error por favor envíe un mensaje a /u/xBonerDetective con una breve explicación para peticionar esta sentencia automatizada impuesta a su contribución.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 6, "replies": [{"body": "> I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.\n\nTraduccion, por favor.", "score": 2, "replies": [{"body": "\nits the same message, but i Spanush", "score": 1, "replies": []}]}]}, {"body": "Thanks again for the detailed response. It seems like that in order to prevent shit from really hitting the fan, serious political and societal change has to occur. One, more money needs to be distributed to the lower and middle class. An avenue for them to make money is essential to be able to buy whatever the upper class is selling. That can be cars, houses, whatever. More money needs to be given to the lowest end of the totem pole so that the economic machine can keep turning. \n\nSecond, I think we need to rethink a service economy. Like you said, a service economy doesn't work without a production economy, but you also stated that we are more interconnected and international than ever before. It seems to me that any one country doesn't *need* production in their own country, but needs a way to generate value. What I'm really thinking of is things like Twitch streaming or baseball or some other form of entertainment. You could argue that a person streaming is producing something, in that they are producing entertainment from nothing but their own mind. If people want to pay for that, that could drive the economy. The infrastructure to deliver that entertainment needs to be set up an maintained, and that gives people jobs and a steady source of income. \n\nOne problem I see with a purely manufacturing economy is that eventually, you run out resources to produce with. We haven't hit that threshold yet, but eventually, you run out of rare earth metals to make shit with. And you run out of people to sell it to. Entertainment is a nearly unlimited resource and has almost unlimited demand, people need shit to do. That's why I think sectors like Esports have a HUGE potential upside. Infrastructure to put it on and continue to hold events will cost money, therefore will make money for the people putting it on. But what that means is that the people at the top needs to start paying the people who provide that service more. Taking a Starbucks barista as an example of a service job, we need to pay them enough to make a living and have extra spending money. They are the ones who go to concerts and to sports games and spend money to prop up the service personnel. \n\nIt seems that too much money goes to the top of the pyramid and we see it as their reward for the leaders working so hard. But not enough is given to the facilitators along the way. People aspire to be that person at the top, taking from the revenue stream and not giving back to the workers below. It's a well known fact that wages have stagnated, when adjusted for inflation, but how do you solve that problem? IMO, Costco is what more companies need to strive to be like. High pay for their workers, leading to spending power but also a desire to work at Costco. If you are being paid well to be a manager at your local store, and the culture is to give back, more people will want to work there. \n\nHow do you change a culture that expects disproportionate returns  when one is put in charge? I don't really have any answers for that. Life is short so when people are presented with the opportunity to provide well for their family and screw over people they will never meet, they choose money 99% of the time. \n\nI'm rambling now, thanks again for the response. Given me a lot to think about. ", "score": 3, "replies": [{"body": "Social policy is bit beyond the realm of investment advice. What will be needed to even begin to correct for domestic market inefficiencies is a second new deal. I do not expect that to occur this year, but in the near future i.e. by 2020. That said I think the rising retiree generation coupled with automization and initial climate change will start to have a noticeable effect on economic activity.\n\nIn terms of economic inequality, from a purely practical point of view the demand of millions of people and 100 are not remotely comparable. The economies of scale that can be realized from important growth industries under a market of a million consumers is far above the growth we can expect in an economy dependent on marketing to 100 people. It's a conceptually simple problem.\n\n>One problem I see with a purely manufacturing economy is that eventually, you run out resources to produce with. We haven't hit that threshold yet, but eventually, you run out of rare earth metals to make shit with.\n\nMy point was more about the relevance of commodity based economies to the overall health of the world economy. I'm not advocating a particular emphasis, merely that the limit to world economic growth is tied in the long run to production of goods since they are the most thermodynamically limiting i.e. it takes more energy to make shit than it does to sell a service.\n\n> Entertainment is a nearly unlimited resource and has almost unlimited demand, people need shit to do. \n\nIt's gonna get cheaper, eventually we'll see the unity of service, that is you'll have one pipe to the your house, the internet, for all telephone, television (with something approaching al le carte channels), gaming, and web related needs. It will be a utility. Also cloud or networked services will be far more predominate.\n\n> It's a well known fact that wages have stagnated, when adjusted for inflation, but how do you solve that problem?\n\nIt's a fallacy of composition problem (macro 101, you can even see it as a tragedy of the commons). One business cuts wages to remain competitive, that's prudent; all companies cut wages, that's a recession. The free market can't fix this problem because it's beyond the scope of their individual incentives. A government policy that rebalances capital accumulation be it constructive fiscal spending ([shit that gets you more shit](https://en.wikipedia.org/wiki/Guns_versus_butter_model):health care, education, infrastructure, energy), increased minimum wage, increased EITC, universal basic income, or other.\n\n>But not enough is given to the facilitators along the way.\n\nAgreed; I'll just say the traditional macro response is Savings = Investment, that is the rich save their money which is in turn invested growing the economy. This only works if we assume the velocity of money is irrelevant, which by fed statistics is at all time lows.", "score": 2, "replies": []}]}, {"body": "No mention of global warming? Of dwindling resources and growing population? Of long tail geopolitical risks?", "score": 1, "replies": [{"body": "That's not gonna happen this year; wait til we get closer to 2030.", "score": 4, "replies": []}]}, {"body": "But what about the zombie apocalypse?", "score": 1, "replies": [{"body": "Well that can happen at any time, so really you should always be ready.", "score": 1, "replies": [{"body": "I watched the Walking Dead. I'm good to go", "score": 1, "replies": [{"body": "[My Man!!](https://i.imgur.com/BG3Owl3.gifv)", "score": 1, "replies": []}, {"body": "RIP T-DAWG", "score": 1, "replies": []}]}]}]}, {"body": "Drunken autism is best autism.", "score": 1, "replies": [{"body": "Like you hang out with people you experience an emotional connection with faggot.", "score": 3, "replies": []}]}]}, {"body": "Well I wrote you a nice lengthy reply and it was deleted. Go SUNE.", "score": 4, "replies": [{"body": "I took screenshots of it and they are on my mobile. I'll upload it to imgur and will share it once I go home.  Thanks for sharing your thoughts", "score": 2, "replies": []}, {"body": "na it's there, at least in my inbox. Thanks for the detailed response. I read it once but will definitely mull it over a couple mores times.", "score": 2, "replies": []}]}, {"body": "Personally I picked up some puts today on the offchance that OPEC causes a catastrophe in oil - but my bigger goal is just to make a profit on a retrace, since we're nearing major resistance.  \n\nI don't *know* that we're going to crash, but even if we don't I think there's a good chance we bounce off 2100 and back down to 2000 over the next few months.  I'm not buying FDs, so they have 10 weeks to capture a decent size move on the downside.\n\nThat said, I did pick up $1k of far OTM puts just in case some drastic downside happens - it's a small bet compared to my main lot and it won't take much to cover the loss even if nothing bad happens in the market.\n\nI'm pretty hedged though, because a couple of my big positions are long LEAPS - so if the market goes up strong and all these puts tank I'll still be recovering the money from them.", "score": 2, "replies": [{"body": "I put my money where my mouth is, I've got SPY calls from January which I'll close out for a 60-75% gain, but I also have puts against SPY and QQQ which I expect to pay out 50-100%+ at least. I'm gonna go leveraged against the euro once my calls pay off. That said my short positions have a little less than 2 years to return.", "score": 1, "replies": [{"body": "Yeah I was hoping for a 50% return in the next couple months on these puts, unless the market continues it's turtle-paced trudge upward past the all time highs.  If everything goes to shit again then I'd end up making a lot more, but 50% was my goal.\n\nI considered buying longer dated, but the prices just really don't make it worthwhile imo.  At 2 years out you need a pretty big fall just to make a decent return (or a quick one so that theta doesn't eat much premium in the meantime).  I looked at the Jan 2017 ones, which seemed okay, but I can't see it taking that long to retrace a bit.", "score": 1, "replies": [{"body": ">Yeah I was hoping for a 50% return in the next couple months on these puts, unless the market continues it's turtle-paced trudge upward past the all time highs. If everything goes to shit again then I'd end up making a lot more, but 50% was my goal.\n\nYou need a trigger event which, to me, doesn't seem plausible in the near term. We're still in an eye of the hurricane lull as people wait to see what's up. I think there are some binary events that will push things, at least volatility if not a greater magnitude change.\n\n> considered buying longer dated, but the prices just really don't make it worthwhile imo. At 2 years out you need a pretty big fall just to make a decent return (or a quick one so that theta doesn't eat much premium in the meantime). I looked at the Jan 2017 ones, which seemed okay, but I can't see it taking that long to retrace a bit.\n\nFor me I can see an \"acceptable\" return at a 10% decline which would be comparable to what we saw at the beginning of the year. A 20% decline would net me a 100% return on intrinsic value alone. For a typical recession the bottom would be on the order of a 30% decline with a surprising number of expectations for the next downturn to be substantial (not saying this is well established, but 2001 and 2008 saw at least 30% declines). I think we pushed off the second great depression in 2008, I could see it being worse. I actually worry about not being able to collect because of possible social upheaval.\n\nTo put things in perspective, had you bought an index of the S&P500 after the recession of 2008, you would have seen a roughly 66% return IIRC. I'm at 60% minimum after three months on the calls, and I'll clear 100% on the puts in at most two years if there's a mild recession. It's good money at a relatively low risk, especially if you consider a bank's interest let alone a \"good\" average stock return of 7%.", "score": 1, "replies": []}]}]}]}]}, {"body": "> Edit: Also it's tax return season, so spending is bolstered.\n\nSpend the tax returns on SUNE, after getting tax credits due to capital losses from SUNE.  Gift that keeps on giving.  Rinse and repeat every year.", "score": 21, "replies": [{"body": "you don't get a tax credit for a capital loss. It's a deduction against actually who gives a fuck about learning on this sub. \n\nBuy SUNE", "score": 12, "replies": [{"body": "Mah man.  For the purpose of this sub you get tax credit.  Each stock loss is treated like an extra depended.", "score": 2, "replies": []}]}, {"body": "Note the use of the word \"spend\" instead of \"invest\".", "score": 6, "replies": [{"body": "Fuck you ", "score": 0, "replies": [{"body": "Please. At least when you go spend your money on an iPhone you get to have your shitty phone. At the end of this purchase, you'll be left with nothing.", "score": 3, "replies": []}]}]}, {"body": "Gift that keeps on giving... Sure you're not thinking of the herpes?", "score": 2, "replies": []}]}, {"body": "If you got taxes back", "score": 1, "replies": [{"body": "This is in the aggregate, I don't care what you pay in taxes.", "score": 1, "replies": []}]}]}, {"body": "They don't bop you over the head when you expect them to bop you over the head.  They wait until you're not worried about being bopped over the head.  \n\nThen they bop you over the head.", "score": 8, "replies": []}, {"body": "So you've been waiting since 2009 for the crash? Keep on waiting. Those that think trend is friend have been weeeeeeing for 7 years.  Your crash will come some day don't worry.and on that day you will finally be able to say you were right all along. ", "score": 11, "replies": [{"body": "cyprus, greece, ukraine, syria, oilcalypse, russia, donald trump, sanders, terrorism, chilean miners... all were survived by our friends the stocks.  \n\nwhat news will finally cause the crash? ask @zerohedge. he will know.", "score": 8, "replies": []}]}, {"body": "Nobody trusts this market but without a downward catalyst its just been status quo for a while.  I've been sitting here holding a bag for 3 weeks.\n\nI'm hoping once that event happens we have a nice, sharp downward move in pretty much everything.  ", "score": 4, "replies": []}, {"body": "I sold everything energy yesterday. Since you never know, I'm not even fucking with bear etf's. ", "score": 5, "replies": [{"body": "I'm balls deep in a bear", "score": 16, "replies": [{"body": "You are now a moderator of /r/sexwithbears.", "score": 18, "replies": [{"body": "Thank you. That's the one thing missing in my life", "score": 8, "replies": [{"body": "You're welcome.", "score": 1, "replies": []}]}, {"body": "oh my god...Why did I click on that. I didn't  think it was real. That's the most disturbing thing. ", "score": 3, "replies": []}]}, {"body": "Way to uncertain for that imo.", "score": 2, "replies": []}, {"body": "Excuse me bear... bear fucker! Do you need assistance?", "score": 1, "replies": [{"body": "Not really, I'm man enough to handle it alone! You are welcome to do a DP if you want", "score": 1, "replies": []}]}]}]}, {"body": "Your perspective is flawed as your inferior mind can not comprehend the way the financial world actually operates. This advice seems to help many experiencing cognitive dissonance: Go fuck yourself. \n ", "score": 3, "replies": []}, {"body": "my thought is that the fear is being baked in.  The last two huge dips we had may be all we see.  Heading sideways for a bit now.", "score": 2, "replies": [{"body": "Present fear of future uncertainty is overpriced.  ", "score": 1, "replies": []}]}, {"body": "its not really a crash as much as its gold value increasing.", "score": 2, "replies": [{"body": "My advice: exit from the back door quietly and never come back here again. ", "score": -1, "replies": []}]}, {"body": "The question I want to ask is why VIX is going down when the market is going down. I mean VIX cash is going up but VIX front month futures are down.", "score": 2, "replies": [{"body": "Same boat. I've been averaging down all day waiting for it to pop. Maybe next week?", "score": 1, "replies": []}]}, {"body": "Because the data keeps showing that the doom & gloom is overstated.\n\nRaw material demand and supply are rebalancing and prices are coming out of the dumper, China appears to more stable than it was a few months ago, and a crony crone seems more likely than not to win the White House.\n\nLook for things to remain calm until the next surprise.", "score": 2, "replies": []}, {"body": "Question - I see comments that I post but none of my new posts appear. Am I doing something wrong?", "score": 3, "replies": [{"body": "Your posts show \"Removed\"", "score": 1, "replies": [{"body": "is his username displayed as [Pedophile] for anyone else?", "score": 4, "replies": []}]}, {"body": "Shadow banned from posting? New account? Mods like to fuck with new people.", "score": 0, "replies": [{"body": "you are mistaken, you probably triggered automod. we got no time to spend manually removing posts just to fuck with you", "score": 3, "replies": []}]}]}, {"body": "The crash is a little over hyped which is why this will drag on for a bit before it truly falls. If the crowd was always right (timing and scope) with the market the vast majority of us would be millionaires. ", "score": 1, "replies": []}, {"body": "News trying to manipulate.\n\n\"Don't fight against the big guys, just follow them.\" -Anon", "score": 1, "replies": []}, {"body": "Because you don't write articles about the commet that passes earth you write articles about the meteor with a 1 in a million chance of destroying it.", "score": 1, "replies": []}, {"body": "Journalists are low paid labor who need \"sources\" to do the thinking for them.  In business \"sources\" are in banks and hedge funds because they're the smartest.  But these smart \"sources\" tell journalists the opposite of the truth so they can buy/sell in the other direction thus making profit.\n\nSee: All CNBC reporting during 2007 about the financial crisis BEAR STEARNS IS SOLVENT, IT CAN NEVER GO BANKRUPT!!!!!", "score": 1, "replies": [{"body": "This. Literally do the exact opPosite of what market watch says", "score": 1, "replies": []}]}, {"body": "When the market shrugs off bad news like that, it is telling you something", "score": 1, "replies": []}, {"body": "#FUD gets clicks", "score": 1, "replies": []}, {"body": "From a trading perspective the initial move off the 1810 level in February was a move off a support level and a huge amount of short covering. After that it was people chasing the rally and this idea that oil was stabilizing. The move was almost completely against fundamentals, but traders gonna trade. Also of note, net inflows ahead of tax day and the 401k IRA deadlines. It'll be an interesting few weeks after Doha, considering the air is kinda thin up here in the S&P 500. ", "score": 1, "replies": []}, {"body": "There won't be any crash this year no matter what! It is an ELECTION year therefore politicians will make sure everything will look good. Enjoy trading! \nNext year, it could happen depending on he is elected as president ;) \nKeep trading until November, and perhaps December and enjoy your money making machine called \"Wall Street\" :)", "score": 1, "replies": []}, {"body": "Don't forget crashes are usually preceded by immense greed.", "score": 1, "replies": []}, {"body": "Lmao don't listen to the news. \n\n\nThink about it like this if 70% of people think the market is going to crash and it never does than slowly they move from bear to bull. The longer it stays flat the less likely it is for a crash. Crashes are usually short and fast like banging your mum. So as those bears start changing their mind and more people are buying and the market goes up, this causes more bears to turn bull and the market go higher. If it's fast it's called a squeeze. If it's slow then that's just the normal direction of the market. ", "score": 1, "replies": []}, {"body": "I'm almost inclined to believe that the big players know what's going on/have insider scoop and they believe the deal is going to go through.", "score": -4, "replies": [{"body": "Which deal", "score": 1, "replies": [{"body": "He's talking about the Disney, EA deal/post above. Retard is misposting.", "score": 7, "replies": []}]}, {"body": "Output freeze? I mean any lukewarm news will make it stay stable or pop. But Russians were not too optimistic about deal anymore either and that smells trouble. I'm going w fundamentals here but if I'm wrong I will be missing out on about 5-7k in profits after closing all my long oil positions ", "score": 1, "replies": [{"body": "cant trust one thing russia says tbh. they are probably using it as leverage. they will fight tooth and nail against it. eventually everyone will convince them to be on board. then they will finally give in if everyone else also agrees. then reports a month later will show they ramped up output and didnt do shit.\n\njust\n\nlike\n\nlast\n\ntime", "score": 1, "replies": [{"body": "Good point. I'm hoping for another point to buy in in about two+ weeks time.", "score": 1, "replies": []}]}, {"body": "Me too. I've closed my positions and made off pretty well so far.\n\nVERY concerned about buying in next week, as if my theory stands correct all the big players will be selling off after Sunday.", "score": 0, "replies": [{"body": "To me this is the same cycle as jan get. I think we'll see more dwti movement as more people realize what's coming. In something we tend to be ahead of the curve on wsb by we're fucking the ETFs from behind", "score": 0, "replies": []}]}]}]}]}
