{"title": "Tesla Model 3, 115k orders in the first 24 hours.", "selftext": "The stock is going to the fucking m00n!!!!", "id": "4ctt1u", "created_utc": 1459483177.0, "score": 51, "upvote_ratio": 0.88, "num_comments": 74, "comments": [{"body": "$115,000,000 in preorder reservations BEFORE THE CAR WAS UNVEILED. Holy shit.", "score": 28, "replies": [{"body": "It is April Fools Day......", "score": 2, "replies": [{"body": "The shorts are about to get foooled ;D\n\nSHORT SQUEEEZEEE mmmmm", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 23, "replies": [{"body": "Autopilot hardware and safety features.  Not the self driving software.  Its the same way they sell the S today.", "score": 8, "replies": [{"body": "I thought you can unlock autopilot for $2.5k?(on the S) ", "score": 4, "replies": [{"body": "DLC", "score": 19, "replies": [{"body": "you wouldn't download a car", "score": 19, "replies": []}]}]}]}]}, {"body": "I'm not invested into TSLA, but if I was, I would look at their FS and see where a majority of their expenses are incurred. If it's primarily into R&D, their profit margin is going to be enormous, if it's a lot of depreciation expenses and operational expenses, less so until they streamline their production and supply chain.\n\nAlso I wonder how long it will take them to streamline production; Apple for the Iphone bought every single manufacturer, shipping and freight carriers quotas in their 1st year to make the Iphone production and cost efficient. I hope it's something Elon talks about in their forward guidance.", "score": 11, "replies": [{"body": "They spent 882M last year. 718M of it was R&D.", "score": 15, "replies": [{"body": "spending most on R&D is awesome", "score": 16, "replies": []}, {"body": "holy shit, might have to actually invest then.", "score": 8, "replies": []}, {"body": "Where are you getting that they spent 882M last year?\n\nI don't see it on google finance: https://www.google.ca/finance?q=NASDAQ%3ATSLA&fstype=ii&ei=ho_-Voi1JZjTjAH5q57YAw", "score": 1, "replies": [{"body": "I read it on a finance site that was covering the release event. Unfortunately, there have been so many articles that have been posted since then that I'm having a hard time finding it again.", "score": 1, "replies": []}]}]}, {"body": "That's where they diverge from most traditional companies, they're all R&D. Huge percentage", "score": 8, "replies": []}]}, {"body": "Currently trading at $246 pre market. Wow", "score": 10, "replies": [{"body": "I wonder how much it will move intraday. I really wanted to sell. 246 isn't enough for me to bust my nut.", "score": 3, "replies": [{"body": "I feel like everyone with these new all time high price targets are just gonna make me miss out on locking in gains", "score": 2, "replies": [{"body": "The faggot's dilemma", "score": 10, "replies": []}]}, {"body": "it'll max out today around $255 I bet and then there will be a huge selloff.  I think Ima put a limit order in for $255-260", "score": 1, "replies": [{"body": "Fuck it I'm selling by end of day I'm too impatient", "score": 1, "replies": []}]}]}, {"body": "Sold my calls at market on open. Most of this information is priced in. Entry and exit points, faggots.", "score": 3, "replies": [{"body": "If I'm reading the chart right, you did well son.", "score": 1, "replies": []}]}]}, {"body": "I don't know what to think. I'm just sitting on 20 shares I got near peak and almost crawling out of my seat.", "score": 7, "replies": [{"body": "*Find out how this one trader makes RobinHood wish they had a fee structure*", "score": 19, "replies": []}, {"body": "well you'll be able to certainly cut your losses today (is my guess). ", "score": 1, "replies": []}]}, {"body": " 150,000 preorders now. 115,000 blind preorders. $5b potential sales. Which car company did that.. ever? ", "score": 11, "replies": []}, {"body": "ALL ABOARD THE HYPE TRAIN BOYS", "score": 8, "replies": []}, {"body": "Will be see what the action does tomorrow. I have to think some of this was priced in. Good if you're a weekly $TSLA holder. Better get the bubbly on ice. ", "score": 2, "replies": []}, {"body": "before anyone even saw it. hype levels of clean fusion.", "score": 2, "replies": []}, {"body": "Update: 150k pre orders now. http://techcrunch.com/2016/03/31/tesla-sold-115k-model-3-preorders-before-anyone-even-saw-the-car/", "score": 2, "replies": []}, {"body": "make fake pre-orders - wait for pumping - short it - cancel pre-order", "score": 2, "replies": []}, {"body": "What is with all the \"24 hours\" talk? Didn't they open in store pre-orders the same day and online opened an hour and a half before he announced the #. So it's really like 12 hours of in-person and 1.5 hours of online...", "score": 1, "replies": []}, {"body": "*kanyeshrug* imma buy just 1 share and she how that goes.... YOLO", "score": 1, "replies": []}, {"body": "That's great. GM sells 10 million cars a year. Maybe someday if Tesla comes close to that number, their stock won't be overvalued as fuck. That won't happen, though. ", "score": -2, "replies": [{"body": "GM sells cars that explode, shut off randomly, etc. No one buys a GM car sight unseen. 115k people did just that with Tesla. Someday in the not too distant future, GM will be begging tesla to buy its factories for the cost of land underneath. Those things being in detroit, basically $5 in yayo.", "score": 6, "replies": [{"body": "They didn't buy a car. They put a refundable deposit down on one. Nevertheless, yes Tesla makes nice cars, no one will argue that. Can they make cars and be profitable? That is the important question what no one is here is asking. They haven't come close. They are a boutique car maker and that is it.  \n\n\nGM, Toyota, etc despite their faults, have huge infrastructure, not limited to thousands of dealerships vs the 100 or so Tesla has. If your Tesla breaks down just how close is the nearest dealership to fix it? Not far if you live in SF but most of the country is left hanging. That is a lot of customers less interested. \n\n\nSome people here really just seem to *want* Tesla succeed because they are fanboys first. This is an investment subreddit. Judge by the fundamentals and not how cool their new car is. \n", "score": 4, "replies": [{"body": "You want fundamentals? I got burnt a couple months ago thinking it was overvalued: Those forward estimates aren't a joke. They did $1.8B in revenue in their last quarter, missed estimates and shot through the fucking stratosphere.\n\nAn additional potential $3-5B next year and you scoff? Facts: A Gigafactory that is operational and has the capacity to fill 300K orders by next year [500,000 by 2020], and a foundation of nearly $1B in R&D laid in advance to efficiently streamline all three cars in the coming year?\n\nEven IF they are off by a few months or miss projections by 20%, once they're profitable, their stock is going to be over $400 thanks to those looking forward and you'll be here sucking on your stubborn foot ... among other things I'm sure ;)", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "What part of the country do you have to live in for your battery to freeze?\n\nThey started in luxury, but the Model 3 is for the mainstream. Easy to mistake to dismiss it as a toy for rich people, but look at the trend, they are growing like no other ", "score": 2, "replies": [{"body": "I am just pointing out a flaw since he was pointing out flaws with other vehicles. Batteries need a constant charge to keep from freezing. So if someone who owns a Tesla drains there battery completely dead during winter then that's not going to be good because it will freeze and ruin the battery. As long as they don't drain there battery then it will be fine but i can see countless people doing this. Tesla's have worse range in cold weather too there won't be no 200+ miles.\n\n> \"A 100 percent fully charged battery will not freeze until approximately minus 76 degrees Fahrenheit. A fully discharged battery can freeze at or around 32 degrees,\" \nhttps://www.cars.com/articles/2014/02/can-a-car-battery-freeze/#j4FuWVZtDy47MFhG.99", "score": 1, "replies": [{"body": "That's a lead-acid battery which contains mostly water (sulphuric acid) and lead. Lithium or NiCd/NiMH batteries do not freeze.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Shorting the shit out of this before close -- pt2 of announcement will be massive disappointment performance wise after X & S models", "score": 0, "replies": [{"body": "Risky move. Thanks for your money. ", "score": 4, "replies": []}, {"body": "What do you even mean by performance wise?", "score": 1, "replies": []}, {"body": "when is part 2?\n", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -7, "replies": [{"body": "At least? What are you a fortune teller?", "score": 11, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Nah, he's literally a fortune teller. It's how he makes money to bet against TSLA", "score": 3, "replies": []}, {"body": "Wall Street?  More like Railroad Ave.", "score": 2, "replies": []}]}]}, {"body": "Thats not how any of this works.", "score": 6, "replies": []}, {"body": "Someone is short...", "score": 5, "replies": []}, {"body": "can we just stop with this for 1 fucking day?  the bears just dont fucking get it, and maybe never will.\n\ngoogle \"selling the why\" by simon sinek if you want to learn more about why this phenomenon is happening.  \n\nhearts and minds.\n\n\n\n", "score": 3, "replies": []}, {"body": "Ok", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -8, "replies": [{"body": "THEY CANT PRODUCE THE SHIT THEY SOLD LAST YEAR", "score": 5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "The thing is that the current rate won't continue. Have you been to their plant? Nearly 1/2 of it is just empty vacant space. Plenty of room to add another 2 lines to manufacture model 3. They're building S and X at such a slow pace because they're unable to obtain batteries in a timely fashion. Things will be different when the gigafactory goes online.", "score": 1, "replies": []}, {"body": "something is wrong with them, this is risky eoq attempt to get that share price back up", "score": -1, "replies": []}]}]}, {"body": "1,000 dollars * 115k orders is 115 million dollars. IN 24 HOURS. ", "score": 1, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": ">  You need to ask where the other 385k orders are going to come from\n\nSame place all the iPhone sales that took place after launch day came from.....\n\n", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Tesla trades like a tech stock, because it is one.\n\nYou expect everyone whos going to buy a Tesla in the next 18 months to sign up on launch day?", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Ok man.  What tesla just did is drop an amazing fully electric car into competition with the 3 series BMW, the most purchased car in California.  They are no longer competing with low volume M cars, 5 series, and 7 series.  They are in the price range of the most successful luxury car ever made.\n\nIn 2014 BMW only sold 142,232 3 series.  Tesla just got 80% of that in 24 hours.  If you dont see the value in that then you are an idiot.", "score": 2, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Yes it is. That's a great observation.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "It  was 115k orders before anyone even saw what the car looked like. Let's see what the stock does tomorrow.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "That's a good point.", "score": 2, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Unless I missed something, they're fully refundable and transferable to a model S, X and I'm assuming model Y if it's announced before your 3 is delivered.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": []}]}]}, {"body": "Or they get paid vacation time?", "score": 1, "replies": []}]}]}, {"body": "Go be a faggot in a different circle jerk", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "Isn't the point to buy the rumor and sell the news? Its up $15 in AH. Scale that up to whatever you could have bought in at... I only got in 2 days ago.", "score": 1, "replies": []}]}]}]}]}, {"body": "We already have a thread for this.", "score": -22, "replies": [{"body": "That's okay, theres 10 posts about SUNE everyday and look at how shitty that stock is.", "score": 28, "replies": [{"body": "Yeah because I love seeing that too\n\nWhy have two parties when we can have one party nigga.", "score": -12, "replies": [{"body": "We can just make this the pleb party", "score": 2, "replies": []}, {"body": "Where did you get a party nigga? I want one. All my niggas are the plain ol' boring type. Tell me where to find a party nigga.", "score": 2, "replies": []}]}]}, {"body": "What the fuck you're a mod?", "score": 5, "replies": [{"body": "Hey it's me ur brother", "score": -6, "replies": [{"body": "Maybe if you sticky a tsla  thread it would help. r the Donald does that and it works well. ", "score": 0, "replies": []}]}]}]}]}
