{"title": "$TSLA earnings report in 2 weeks boys, time to buy in before their first profit", "selftext": "", "id": "4u8r0r", "created_utc": 1469289319.0, "score": 13, "upvote_ratio": 0.69, "num_comments": 54, "comments": [{"body": "In a show of confidence, Elon Musk uses an autopilot-navigated vehicle to arrive to the Tesla conference call. The car mistakes a fat person on a bench for a speed bump. Elon Musk escapes the scene on foot while wearing a swastika blazer and punching a 9/11 fireman. \n\nTesla up 3% after hours. ", "score": 101, "replies": [{"body": "Lol good shit", "score": 5, "replies": []}]}, {"body": "Why does this not have a Shitpost tag", "score": 12, "replies": []}, {"body": "Tesla and profit.  \nThat's like a fucking oxymoron.", "score": 27, "replies": [{"body": "Short it to the dark depths of hell", "score": 4, "replies": [{"body": "Not every shitty company makes a good short.", "score": 4, "replies": [{"body": "I wouldn't call it a shitty company. More like revolutionary company.  \nEventually, they will turn profitable and gain a huge market share, but it costs a lot.  \nSelling cars nowadays with a minimal profit/loss can be seen as an investment into getting autopilot data.  \nI have no doubt Tesla gonna be big in the next 10 years. It's just too unpredictable in a short term.", "score": 3, "replies": [{"body": "> I have no doubt Tesla gonna be big in the next 10 years. \n\nI do. Even if Tesla is 100% right about the direction of the car industry, someone else can still come along and do it more cost effectively. Every car company is investing in self-driving tech right now.", "score": 5, "replies": [{"body": "BMW", "score": 1, "replies": []}, {"body": "Eventually yes, they will probably be replaced, but right now with the way they are pioneering both electric vehicles, energy infrastructure, and autopilot in vehicles it's a safe bet that they will have a large market share in the mid future. Plus as far as costs go they built the Giga Factory that will enable them to be the lowest cost battery producer.", "score": 1, "replies": [{"body": "I like Tesla but honestly BMW are on the way... Wait for the serious Korean and Japanese in 5 years... Maybe Chinese... The problem I see for Tesla is that they need quick massive sale to Cash in on their advance that won't last a decade, but their plan is too futuristic for politics and people to be adopted quickly...", "score": 1, "replies": [{"body": "BMW is five years out on Autodrive. Fully electric will take longer. No threat.", "score": 2, "replies": []}]}, {"body": "> but right now with the way they are pioneering both electric vehicles, \n\nSo are a bunch of other companies. Toyota, Ford, GM all have their own electric car and autopilot research divisions. They also have long histories of designing and releasing new models.\n\nTesla is just the most flashy right now.", "score": 1, "replies": [{"body": "Equating their electric vehicles to tesla's electric vehicles is kinda like equating my house to Hugh Hefners house. We both have houses yes, but I'll be damned if I wouldn't rather live in Hugh's house.", "score": 1, "replies": [{"body": "The difference is that Hugh Hefners house has already been built.\n\nTesla's model 3 is all hype and prototypes right now.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "What makes you think they are going to turn a profit?", "score": 7, "replies": [{"body": "He's long the stock.", "score": 15, "replies": [{"body": "That's dumb", "score": 6, "replies": [{"body": "You smell dumb", "score": 5, "replies": [{"body": "Pretty accurate ", "score": 3, "replies": []}]}]}]}, {"body": "The gigafactory (huge flat cost) is going operational on July 29th, Model 3 shipments are only slightly below goal, with production ramping up exponentially. Take a look at their financials and tell me what you think. ", "score": -5, "replies": [{"body": "wth are you talking about? There are no Model 3 shipments.", "score": 6, "replies": [{"body": "Goal was one shipment.", "score": 3, "replies": [{"body": "They missed the goal. The Model 3 outside the Gigafactory on Friday's grand opening was just a shell with no internals. Some reporter took a picture of the hollow underside.", "score": 1, "replies": []}]}]}, {"body": "Except a factory isn't a flat cost at all. You have large input costs to run it ", "score": 6, "replies": []}, {"body": "It's a capex so it's capitalized and depreciated. That's how financial accounting works.\n\nAlso, it's still very expensive to run a factory day to day ", "score": 2, "replies": []}, {"body": "It just does not make sense. They make next to nothing on the model 3 and sell everything else at a loss. Okay great, they can make 2K cars a week but how does that justify a $30 billion market cap? ", "score": 2, "replies": [{"body": "the battery factory reduces the cost of their packs by 30%\n\nand you're correct that a $30 B MC isn't justified right now, however that's a bet for what Tesla 2025 is worth. ", "score": 0, "replies": [{"body": "Even if that's what it is worth in 2025 how does that equate to any significant upward movement in the stock at 2016 prices?", "score": 8, "replies": [{"body": "It's an early investment at a bargain to what might be the #1 car company by revenue in late 2020s.", "score": -2, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "You don't have to be innovative with electic vehicles, they existed for decades and are far simpler to construct than any car with a  combustion engine. It's not even close, I mean EVs barely have any moving parts, there is no sophistication or thought in engineering required. To think that companies like BMW, Volkswagen, Ford, GM, Daimler can not come up with an EV is just being delusional considering they have built cars ten times harder to construct in the past.\n\nNow that we know every toddler can build an EV, why aren't these better car companies making some? It's because the margins are horrible and you lose the majority of service revenue as there are no moving parts that require servicing (at least regulary, brake pads last forever in EVs).", "score": 4, "replies": [{"body": "You are right but your final explanation is wrong IMHO.\nThey are slowly moving to electric because they have experience with failed or commercially unsuccessful vehicle, they see Tesla going in a corner with their autopilot that will take a decade to be fully capable and authorized everywhere.\nThey were feeling the rush before the autopilot thing and model x final release.\nNow they see Tesla will have to face a problematic vehicle (model X) before it is even talking profit...and will have to lobby States countries etc for years.\nKnowing that a car makers usually take 4 to 6 years to release a model. I would guess the German will release around 2019/2021.", "score": 1, "replies": []}]}, {"body": "Tesla is somewhat innovative but there is nothing new about electric cars. The way they make cars is cool but it doesn't really matter too much. They can innovate all they want but it won't add up to shit if they don't make money. \n\n\nAnd you cannot compare making cars to renting fucking movies to people. It's a considerably more complex industry not only in making millions of cars every year but doing so at a profit in a highly competitive industry.  The scale on which F GM and co make cars (and profit) makes Tesla look like a bit if a joke. You can't just waltz into that and say I'm going to rethink how all of this is done and expect to make money. \n\n\n", "score": 4, "replies": []}]}]}, {"body": "For your sake I hope you are right. Would suck to see that stock get diluted and get demoted to fukboi status. ", "score": 3, "replies": [{"body": "Oh I got in at $25 (2010?) and sold at $240, then rebought at $170", "score": 4, "replies": [{"body": "Lol. Well forget everything I just said. Good call back then. ", "score": 2, "replies": [{"body": "They were less convincing back then, I think they were days away from bankruptcy at a few points lol.", "score": 1, "replies": [{"body": "That's how to find ten baggers. I bought a bunch a Ford stock when they were on the brink of BK/bailout and funded my undergrad/grad school with it. ", "score": 2, "replies": []}]}]}, {"body": "You got proof on that? ", "score": 1, "replies": []}]}]}, {"body": "Late 2020s, are you serious? You would have said early 2020s I would have said you were optimistic but in 10 years ? You don't know much about cars or this industry...", "score": 1, "replies": [{"body": "I work in the industry.", "score": 1, "replies": [{"body": "And you believe you can project what the car market will look like in 10+ years ?", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "You're own reasoning doesn't support your claim that they will be profitable for THIS earnings report. Those reasons are fine for the future. But right now the \"below goal\" thing is the one that is relevant to this earnings and it's a negative blow not a positive.", "score": 1, "replies": []}]}]}, {"body": "Delusional", "score": 5, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "http://i.imgur.com/rxFI7wF.jpg     \nYour post has been automatically removed because of pedophilia. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}]}, {"body": "Is OP a duplicate account of F。S。C。??", "score": 1, "replies": []}]}, {"body": "Not gonna post a profit they keep investing heavily for new growth", "score": 3, "replies": []}, {"body": "This shit isn't seeing a profit until (in my opinion) at least 2018. Also, GFY", "score": 3, "replies": []}, {"body": "Profit? I highly doubt that happens", "score": 2, "replies": []}, {"body": "Tesla will miss, so you should go long", "score": 1, "replies": []}, {"body": "What are you fucks buying in at ", "score": 1, "replies": []}, {"body": "This is a fucking troll", "score": 1, "replies": []}, {"body": "Buy OTM calls bro. Get rekt.", "score": 1, "replies": []}]}
