{"title": "Housing crash coming? What stocks can we ride? Please have a look at this guys data and explanation, insightful", "selftext": "", "id": "mcvq54", "created_utc": 1616670525.0, "score": 0, "upvote_ratio": 0.25, "num_comments": 28, "comments": [{"body": "There won't be a housing crash this year.  Inventory is low and banks do diligence on buyers.", "score": 9, "replies": [{"body": "I’m sorry, I certainly don’t want or think we’re going to slump, but the last thing on this green earth I will put any reliance on, is a bank’s due diligence, never, but least of all in this era of free money.  They’re doing worse than they did in 2006.", "score": 2, "replies": [{"body": "Doing worse?\n\nIn 2006, you didn't even need a down payment or a job.  Your credit didn't matter.", "score": 1, "replies": []}]}, {"body": "I hope your right seriously but allowing people to finance a bid war house at 50k plus over fair market or even assessment value does not seem like smart investment procedure or protection. And I'm not talking about 500k homes where it would only be a 10% hike I'm referencing the average first time starter home listed for 130k going for 180k and assessment at 110k your 70k in the hole before you move your couch in.", "score": 0, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Correct. There can be a contingency stating the seller will cover any additional cost the bank doesn't cover. The seller should be aware of this and look at offers that have this contingency.", "score": 2, "replies": []}, {"body": "Realtor here. You’re correct. In order for the bank to give the loan in that instance someone has to pay the difference between the loan value and appraisal value.", "score": 0, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "No it’s not. however banks are giving out loans a bit more Willy nilly than they were a few years ago. I think the housing market is going to get hit hard. But not in 2021. Still too much demand. Supply however is a big issue", "score": 3, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "I don’t think we’re looking at 2008 crash levels. I personally think we’re going to see a hard fast swing To a buyers market. A correction if you will. \n\nAt some point interest rates HAVE to rise. While people are protected from their mortgages doubling and tripling overnight this time, it’s going to do one if two things: cause banks to further loosen their lending, or cause a sudden decrease in the buyer pool. In scenario one, the foreclosures would start 6-12 months later, bringing prices down. In scenario two, demand goes down, and so does this overinflated market value. Millions of homeowners are now upside down in the tens of thousands. Even if they don’t get foreclosed on, they won’t be able to sell for years, leading to a very long term market supply problem on top of the rising interest rates. People will simply quit moving. \n\nTwo things that could stop both problems potentially: a minimum wage hike could negate rising interest rate issues. We’d still have our current supply problems though, with a now larger buyer pool. The big thing we need right now that will stop the housing market from going into correction levels is NEW affordable housing. There’s very little new construction going up, and what is is not in the average first time buyers range. If we could get a good amount of supply quickly, and affordably, I think it would do wonders to even this market out. \n\nKeep in mind I’m just an idiot on Reddit.", "score": 2, "replies": []}]}]}]}]}, {"body": "From my understanding people are putting larger and larger down payments on houses. In some cases up to 50%. I think Millennials are pushing this trend because too much debt scares us.", "score": 1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Not everyone is struggling just because of the pandemic and that includes the middle-class. My Lifestyle hasn't changed at all, if anything I have increased wealth.", "score": 2, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "What about this year or last has been common, what exactly about this housing market is common? You can doubt me all you want I don't care go read an article or try to buy a house.", "score": 1, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "First literal Google search discusses how larger down payments are becoming more common during bidding wars and a housing shortage... and while a 27% increase may not be half of the full price it's still a hell of a lot and in some cases half still does happen.....\n\nI'm done, bye\n\n\nhttps://themreport.com/daily-dose/03-24-2021/how-covid-19-has-changed-the-buying-and-selling-process\n\nDown payments\nThe median down payment on a home during the last six months was $40,987, up from $32,261 during the same period a year earlier. That’s an increase of 27%, or nearly $9,000. The typical homebuyer made a down payment equal to 15.9% of the sale price, compared with 15.3% a year earlier.", "score": 1, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "at this point it's obvious you're illiterate and just wants to complain at someone. I never mentioned any dollar amount I said a percentage. Good day.", "score": 1, "replies": []}, {"body": "By the way 40000 and 50000 are very much near to each other 🤦‍♂️", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Not sure what part of the states you guys are talking about, but over here in California is nuts. Problem seems like regular joes are starting to compete with investors buying cash. There is no way a regular person would be able to compete with deep pocket investors. Check this article out.\n\nhttps://www.google.com/amp/s/www.wsj.com/amp/articles/if-you-sell-a-house-these-days-the-buyer-might-be-a-pension-fund-11617544801", "score": 1, "replies": [{"body": "Non-AMP Link: [https://www.wsj.com/articles/if-you-sell-a-house-these-days-the-buyer-might-be-a-pension-fund-11617544801](https://www.wsj.com/articles/if-you-sell-a-house-these-days-the-buyer-might-be-a-pension-fund-11617544801)\n\nI'm a bot. [Why?](https://np.reddit.com/user/NoGoogleAMPBot/comments/lbz2sg/) | [Code](https://github.com/laurinneff/no-google-amp-bot) | [Report issues](https://github.com/laurinneff/no-google-amp-bot/issues)", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I don't see a crash this year but with the mortgage payment forgiveness in effect I'm afraid people believe they will not have to pay missing payments back. So home owners will have to refinance the debt against there already over market value home if they capable ie good credit score work history etc. Or mortgage lenders will begin to charge interest and demand payment on 18 months plus of deferred payments making payments unreasonable and leading to foreclosure. Also I have seen first hand the  everyone gets approved procedure back in place for many first time buyers. Offering approval at overvalued prices no payment savings verification and the carrots to refinance at a later date once better credit and payment history is established. Sounds familiar 😊", "score": 3, "replies": [{"body": "Yep. This. At some point, the government is going to have to stop forcing landlords to operate without collecting rent and banks can’t keep allowing people to not pay mortgages forever but many who are not paying now won’t be able to catch up. That is likely to be very problematic.", "score": 2, "replies": []}]}, {"body": "Keep an eye on building permits at census.gov. \n\n[US Census building permits.](https://www.census.gov/construction/bps/)\n\nThey are a leading indicator and are released every month. I use thinkorswim and in the economic data section you can see it graphed out on a chart.", "score": 3, "replies": [{"body": "Nice I will keep a tab on this thanks", "score": 1, "replies": []}]}, {"body": "The housing market crash in 2008 wasn’t a cyclical crash like we often see in the stock market. There were things fundamentally being done wrong. \n\nI’m sure there will be a correction in the housing market at some point due to economic fluctuations but a crash like 2008 is far from that.", "score": 1, "replies": []}]}
{"title": "AbbVie Inc. (ABBV) Has anyone actually seen the financials of this company? FIRST DD", "selftext": "[deleted]", "id": "mcl00u", "created_utc": 1616631498.0, "score": 22, "upvote_ratio": 0.79, "num_comments": 21, "comments": [{"body": "I’ve got 20 shares of ABBV. I think they’re a steal at $100. 5% dividend too", "score": 12, "replies": [{"body": "I bought ABBV because of their dividend and did some DD which resulted in me buying more because I now believe in them. Great overall long term pick.", "score": 3, "replies": []}]}, {"body": "Bought some 320 shares right after it spun off ABT in 2013... sitting on ~300% gains and I think a 15% YoC dividend so I don't even look at the share price or the fundamentals anymore as it's just 1% to 1.5% of the portfolio. I remember back in 2013, 2016 was portrayed as a humira patent cliff", "score": 5, "replies": []}, {"body": "Fun fact about the “other companies selling HUMIRA” (or any biologic medication that is) is technically they won’t be “generics” but a biosimilar and unlike a generic medication there is no law indicating the price must be cheaper than the brand name product. So yes there will be more competition once the patent is up BUT the ABBVIE brand medication will not become obsolete like many other name brand medications.", "score": 5, "replies": []}, {"body": "On a different level, I worked on a construction project for them.  Great people.  Super well organized.  They have meetings, for pre-meetings, to prepare for real meetings.  They are a very dialed in company.", "score": 6, "replies": [{"body": "DD from  a construction guy!!! LMAO", "score": 0, "replies": [{"body": "So what?", "score": 1, "replies": []}]}]}, {"body": "Or just hold the companies that hold the companies", "score": 4, "replies": []}, {"body": "Nicely done! Good lookin DD!", "score": -1, "replies": []}, {"body": "I went with ABT instead given their more diversified business and the risk to ABBV of drugs going off patent in the next couple of years. Are you accounting for that in your DD? In other words, what does their product pipeline look like?", "score": 1, "replies": [{"body": "I love and hold both ABT and ABBV. Both undervalued.", "score": 2, "replies": []}]}, {"body": "How do you think of the debt they have?", "score": 1, "replies": []}, {"body": "Definitely on my radar", "score": 1, "replies": []}, {"body": "Beware the patent cliffs", "score": 1, "replies": []}, {"body": "Own both ABT and ABBV, ABT is a slow and steady investment, ABBV jumps around and is more risky.\n\nIf you looking for more stable medical company, go for ABT.", "score": 1, "replies": []}, {"body": "I have a long position with shares but after that drop last week I also got 40 $103C 4/1 at $1.71. Worth $1.81 today, probably will sell tomorrow if it’s up and buy more shares.", "score": 1, "replies": []}]}
{"title": "Are stocks bought and sold between individuals or the brokerage? How does the price go up and down?", "selftext": "Say I buy 1 Apple stock on Charles Schwab for the market price of $200. Did that come from someone else selling the stock for $200 (that’s what I figure) or did I buy it from Schwab? If it’s between people, than that means for every buy there is a sell, in which case it seems the supply and demand would always be an equilibrium. I figure supply and demand is ultimately the reason for how the price moves, but how exactly does that work? More people offer to sell the stock so the price goes down even before they the sale goes through? How is it that there’s always buyers and sellers available? Is there ever a time where basically nobody wants to sell apple so buyers can’t buy, or nobody wants to buy apple so sellers can’t sell? If it’s through the brokerage, how is it getting all those stocks?\n\nIf the market price is exactly 200 and I buy 1 share how much would the new market price move up or down? Perhaps we have to know how many shares their are in total? What is that called when I look it up?  \n\nI’ve been doing plenty of stock trading lately but I’m realizing idk how this is all going down beneath the surface. Details on how exactly this all works is much appreciated!", "id": "mcl06w", "created_utc": 1616631514.0, "score": 14, "upvote_ratio": 0.76, "num_comments": 26, "comments": [{"body": "They are traded between buyers and sellers whether that been individuals or institutions.  Most trades are done through limit orders not market orders and those limits set the price.  If you say you are willing to buy something with a limit of $200 and someone else is wiling to sell it for $200 or less it will trade at $200.  However if no one is willing to sell it for less that $201 then no trades happen until someone gives in and agrees to buy it for $201 and then $201 becomes the new price.  The same thing happens on the way down where someone is willing to sell it lower than the current price because no one else is willing to buy it at the current price.  If you place a market order you are saying you want to buy/sell no matter what the price is so it will trade at the closest bid/ask which is just someone else's limit order.  Supply and demand set the price because of more people want to buy than sell the buyers will give in and pay higher prices.", "score": 12, "replies": [{"body": "Mmm so really limit orders is how I should think of all this. So if there’s more buy orders than sell orders the price goes up because sellers end up giving in to the buy orders? \n\nSo let’s say a bunch of buyers have limit orders at 199 and there’s only a few sellers at 201, I don’t imagine buyers would get it cheaper when there’s many of them? Perhaps my example isn’t realistic, but what would be realistic in that situation?", "score": 1, "replies": [{"body": "That is pretty much it but really it is a matter of who is more desperate.  Do you wait for it to come down and miss buying?  Do you wait for it to go up and miss selling?  So theoretically it is who flinches first not which side has more but usually knowing there are more buyers than sellers will give the sellers more resolve and the buyers less.", "score": 4, "replies": [{"body": "Also, how do differing amounts work? Say I want to by 1 stock at 200 and someone else is selling 100 of those stocks at 200. Do I buy just one of his?", "score": 2, "replies": [{"body": "Yes.  And if he is only selling one and you are buying 200 you will get get a partial fill for one at that price and depending on your limit may fill the rest at a slightly higher price based on the next ask in line or otherwise you will be the new bid at that price for 199 shares that may fill if someone else puts in an order that meets it.  If you have access to Level 2 quotes you can see all of the orders and the quantities.", "score": 3, "replies": []}]}, {"body": "I see, so let’s say tons of people want Apple for about 200, then there’s more buyers and less sellers, then I guess the sellers get away with selling for higher prices (201,202 etc) since there’s not many sellers and many willing buyers. Once people buy for 201 and 202, that becomes the new standard market prices so sellers start offering at 203?\n\nCan I see all this on Schwab? Can I see limit orders and sell orders and then choose say a buy order I like and by that sell order?", "score": 2, "replies": [{"body": "Any quote will have bid/ask/last bid is the highest limit buy order outstanding and the ask is the lowest limit sell order outstanding.  If you have level 2 quotes you can see the whole order chain of all the orders.\n\n[https://www.brokerage-review.com/expert/level2/charles-schwab-level-2-quotes.aspx#:\\~:text=In%20order%20to%20qualify%20for,be%20enabled%20on%20your%20account](https://www.brokerage-review.com/expert/level2/charles-schwab-level-2-quotes.aspx#:~:text=In%20order%20to%20qualify%20for,be%20enabled%20on%20your%20account).", "score": 2, "replies": []}]}]}, {"body": "If there's a bunch of buy limit orders at 199 and a bunch of sell limit orders at 201, in a closed system nothing would happen. No trades would execute. Basically a gridlock. \n\nBut the thing is there are so many people trading that there will also be a plethora of market buyers and sellers for a stock like aapl. Every second or so there will be people placing market orders which means \"buy this for the cheapest I can\" or \"sell this as fast as possible to the highest bidder\"\n\nI understand your questions in your post , but the thing is there are so many transactions going on that it's hard to analyze like you are trying.\n\nRather, think of it this way. Millions of orders are entered into the system. Some market buys, some limit buys, some market sells, some limit sells. And then a giant software system runs the analysis and pairs buyers with sellers and determines which stocks exchange hands. It's too big of a system to work it through on paper and pencil.\n\nIf youve ever sold a large amount of stock at market you'll see this in action. Sell like 500 shares of AAPL and you'll see \"37 executed at 200, 28 executed at 199.6, 62 executed at 199.2\" etc. You're basically pacman \"eating\" the buys on the way down. And the opposite for buying a large amount of stock. Buy 500 of any stock and likely you will get shares for sublle penny differences.\n\nThere are also market makers who buy and sell anything, and are paid to do so, to provide liquidity.", "score": 3, "replies": [{"body": "Mmm thanks this is really insightful! So if I want to buy 500 apple shares, I’m probably getting it from many different people doing sell orders at slightly varying prices? Same with sales? And since there’s so many people involved we can be sure our orders will execute and not be left having bought only 499 shares when we asked for 500?", "score": 2, "replies": [{"body": "Exactly. If you buy 500 shares at market, you will very likely see several \"tax lots\" in your account. Each lot will have some number of shares and the price paid for that lot. For a very popular stock like aapl the prices will be close to identical. \n\nAlso note that liquidity is critical here, which is a result of the stock popularity. You've used aapl in your example and questions which is extremely popular stock. Tons of volume.\n\nIf a stock has little volume and trading activity, the \"gaps\" between each of those buys or sells, could be dollars instead of pennies.. Also market orders may very dangerous! Liquidity and volume makes prices sane. If you lack volume then the gaps in market orders can get out of hand quickly. \n\nAll this is also why it's scary to place a market order before the market opens or the night before. You might get Effed at the open because the price tanks etc", "score": 2, "replies": []}, {"body": "BTW the answer to one of your other questions is \"float\". Float is the number of shares of the company that's publicly traded. IE a stock might be 70% publicly traded because original founders own 30% of it.\n\nLately with the GME nonsense \"% of float that is short\" has been a popular metric. That means what % of the float %\tare borrowed (for shorting)", "score": 2, "replies": []}]}]}]}]}, {"body": "It’s like electrical theory, no one actually knows how it works.", "score": 15, "replies": [{"body": "Haha!", "score": 2, "replies": [{"body": "It's similar to the south park episode where they explain where the simpsons show ideas come from.", "score": 1, "replies": []}]}, {"body": "I know how both work. Actually.", "score": 1, "replies": []}]}, {"body": "There's many parties/players involved in the stock market; and some entities play multiple roles (for example, a brokerage may also be a market maker and hedge fund). I'm aware of the following below:\n\n1) retail investors - people like you who use brokerages to perform trades. Retail investor trading only make up between about 15% to 30% of the market transactions (ref: [https://www.usnews.com/news/top-news/articles/2021-01-29/factbox-the-us-retail-trading-frenzy-in-numbers](https://www.usnews.com/news/top-news/articles/2021-01-29/factbox-the-us-retail-trading-frenzy-in-numbers) ).\n\n2) dark pools - performs algorithmic trading on large transactions (and additionally hides \"bids\" and \"asks\"). This is a service that is provided for wealthy clients (e.g., hedge funds).\n\n3) market makers - use algorithmic trading to create liquidity in the stock market. They make money on the spread between the bid and ask. They engage in the practice of payment-for-order-flow, because it helps them determine the \"bid\" and \"ask\" price. Note, they may hold excess shares.\n\n4) institutions - hedge funds, mutual funds, banks, etc.", "score": 4, "replies": []}, {"body": "Long story short there are different types of orders when you buy a stock. For example if you buy at market there’s some wiggle room in the price and is executed at the quickest time of delivery, but your price isn’t entirely locked in. Limit orders you set your price floor or ceiling and are put into a transaction queue until the underlying value gets to that point. Generally brokers will protect you to match your order with the closest available one. \n\nSo let’s say you try to buy a single share of AAPL at $200, you’ll likely just get on the first available purchase order that meets sufficient volume to execute. You won’t pay $200, but I wouldn’t make it a practice of it. This could become a VERY dangerous practice if you were to buy in large volumes on a smaller less active share. The ticker reflects the last transaction price. If demand is low and price comes down to meet supply it’s red and vice versa. If the price were precisely $200 and you bought for $200 nothing would change. Changes reflect a differential in what’s being paid and what’s asked.\n\n**TLDR** At a very fundamental level a stock’s price is really only driven by supply and demand.\n\nThere’s a lot of interesting theory behind it depending on your interest in mathematics and statistics. A lot of the terms thrown out so often now, <insert squeeze or sell off here> are just edge cases of extreme activity of limit demands and supply. This is why I’ve found GameStop interesting as an example. Theoretically there’s a limit to any share value relative to the underlying equity, growth, implied risk, sentiment, and any other factor. Then if you abstract it a bit to a buyer and seller level this changes at an entirely different level since many people are deterred by a stock like Berkshire or Amazon with high cost. \n\nAs an example of a completely recalled estimate I made a few weeks ago so numbers won’t be perfect. At $350 a share and around 70m in outstanding shares with ~$6.5bn in revenue GME’s market cap to revenue ratio was 3.79. As a contrast, Amazon is around $3.1k with around 440 million shares floating (which don’t rotate as often) and $386.1bn in revenue so a ratio of around 3.526. Effectively GME was more valued than Amazon without any of the intrinsics. When people boast pipe dreams and expectations of $1000+ this is why I found it interesting that people valued a company well beyond that ratio. There are definitely other factors, but at it’s core I find that to be an indicator of a price limit. Nobody looking solely at business expectations and growth prospects would value the two companies equally.", "score": 4, "replies": []}, {"body": "Sometimes you'll trade directly with another retail trader. Other times you'll trade against an institution, like a hedge fund. \n\nBut more often than not, a market maker is on the other side of your trade.\n\nhttps://www.investopedia.com/terms/m/marketmaker.asp", "score": 2, "replies": []}, {"body": "Your broker sends it to the exchange where the market makers fill orders and then your broker makes the change to your account. Much of it is done very fast electronically", "score": 1, "replies": []}, {"body": "A brokerage is exactly what the name suggest, a broker. It pairs a seller with a buyer. For pairing, you can look at volume. Obviously with higher volume it will be easier to pair buyer with a seller. The bid/ask price is where you can see the price people are willing to buy/sell at\n\nYes if there are no buyers and sellers then the stock price will remain the same. For your example in Apple there will always be a buyer and seller at the right price", "score": 1, "replies": []}, {"body": "Pick up the book “stocks for dummies” it will teach you all the basics rather quickly.", "score": 1, "replies": []}, {"body": "Your order to buy a stock can be executed by your broker transmitted to market makers or through their own inventory.  On your trade confirmations, it should state whether it was an agency transactions (sent order to market makers) or a principal transaction (firm's inventory).   Either way, they are supposed to get you the best possible price.  As for the movement of the price, it all depends on supply and demand.   More sell orders, stock goes down.  More buy orders, stock goes up.", "score": 1, "replies": []}, {"body": "Stock brokers pair sellers with buyers, where stock dealers(market makers) have some amount of shares so they can sell and buy, which is probably required by regulation. Stock dealers are like car dealers that have new cars in their dealership, they have shares in their account. Those dealers are the investment banks that help companies to do IPO. For example, Fidelity is a client (institution client), it also functions like brokerage, but I don’t think Fidelity is a dealer. GS, JPM, etc are dealers as well as brokerage, they are also institution clients(mutual funds, ETF, etc).", "score": 1, "replies": []}, {"body": "If Schwab makes a market in that ticker, you may trade with them. Or you may trade with another market maker, or anyone in the world.\n\nFor every buy there is a sell. Market makers are not inventing it out of thin air, and their need to hedge or lay off or cover the positions they end up in to make the market constitutes one of the largest supply-and-demand drivers.\n\nIf there were no market makers there would be many more times when stocks would be illiquid (nobody to trade with).\n\nWhen you buy 1 share \"at market\" you are accepting the bid/ask on the order book. If that is 1 cent away from the last price, you move the price a penny; if it is a dollar away, you move it a dollar. If it is 10,000% away, that's how far you move it.\n\nIf you make a limit trade, and someone fills your order, and your quoted price was different from the last price, that also moves the price.\n\nThere is no pricing algorithm. The price listed is simply the last price paid by a buyer to a seller, whatever one quoted and the other executed the trade at.\n\nSo when you trade, don't look at the last price. Look at the bid and ask to see what you're really trading at.\n\nNow, way down below the surface is the clearing and settlement system. When a trade is made, each side has 2 days to deliver cash or shares to settle the trade. But in the electronic system virtually every share is always in the clearinghouse (DTCC) and only the identities of their owners change in ledger entries. The cash really does move, though. The market tells the clearinghouse who traded, and when the seller's broker gets the cash from the buyer's broker they tell the clearinghouse they got it, and the clearinghouse changes the ledger for the shares.\n\nAlso, often the shares aren't in your name, they're \"in street name,\" meaning your broker is the name in the clearinghouse ledger (and the investor relations ledger at the company that issued the stock), and the broker keeps track of which customers notionally own what portion of the shares. That further simplifies the processing by the market and clearinghouse and takes a ton of risk out of the system by relying on the broker's resources instead of a million individuals'.", "score": 1, "replies": []}, {"body": "Schwab, TD etc are brokers. They broker a transaction, but the actual transactions happen through market makers (there are three big ones, as far as I know). So no, I don't believe you are trading directly with another buy/seller, but it doesn't matter. The concept is the same.\n\nAs for what determines the price, it's the same as anything: supply and demand. The more buyers there are for something, the higher the price. More sellers, price goes down.", "score": 1, "replies": []}, {"body": ">Say I buy 1 Apple stock on Charles Schwab for the market price of $200. Did that come from someone else selling the stock for $200 (that’s what I figure) or did I buy it from Schwab?\n\nYou bought it from someone selling it at $200. Charles Schwab likely routed your order to a market maker/exchange for execution. \n\n>I figure supply and demand is ultimately the reason for how the price moves, but how exactly does that work?\n\nhttps://www.investopedia.com/ask/answers/040215/how-does-law-supply-and-demand-affect-stock-market.asp#:~:text=The%20law%20of%20supply%20and%20demand%20is%20a%20theory%20that,a%20security%2C%20and%20its%20price.&text=The%20law%20affects%20the%20stock,that%20make%20up%20the%20market.\n\n\n\n>More people offer to sell the stock so the price goes down even before they the sale goes through?\n\nNo. The sale has to go through before it can move the price. \n\n>How is it that there’s always buyers and sellers available?\n\nMarket makers can and will intervene to create liquidity in a stock. They buy when people sell and sell when people buy. \n\n>Is there ever a time where basically nobody wants to sell apple so buyers can’t buy, or nobody wants to buy apple so sellers can’t sell?\n\nNope. Apple is one of the most liquid stocks on the Nasdaq, so you will have little/no trouble finding a buyer/seller.\n\n>What is that called when I look it up? \n\nShares outstanding.", "score": 1, "replies": []}]}
{"title": "WMT DD best stock in my portfolio?", "selftext": "\\*disclaimer: this is my first DD... I'm taking time out of my office job to hear thoughts about my analysis.\n\nLooking at my portfolio that I built in the past 4 months, WMT seems like the most undervalued stock.\n\nI am not talking about any get rich quick stocks. Looking at you TSLA, PLTR, NIO, GME. (although I am invested $20k in these stocks and am about 20% down)\n\n# 1. Why it will win in the next few years\n\nThe market volatility is here. We don't know if it's going to stay, but I am unsure about investing heavily in tech. I want a company that can weather the storm. Grocery/food retailer, especially low-cost chain, seems like a great place to invest in since their business model will bring even more customers in challenging times. The $1400 stimie is a boost that will flow into this sector while we move past the pandemic. 'WIN' here doesn't mean doubling stock price in the next few years. 'WIN' is beating the market. My goal is 4%+ annual.\n\n# 2. On-line business model\n\nLet's be frank here. Walmart doesn't have the greatest online presence. They are trying their best with Walmart+, but it's not there yet. Good news is that I don't think their online presence is 'priced-in', which means that the current valuation of the company doesn't account for how big it can actually get. The company still makes great revenue and margin in the space and there's room for growth.\n\n# 3. Current valuation\n\nThe stock is currently down about 10% since the ATH (all time high) in Dec 2020. Not gonna lie, grocery stores did get a boost during the pandemic since a lot of people cooked more meals at home, but look at the 50 day moving average. The stock moved higher faster than anticipated, but it's trending well with the average line in the right direction. In the past 5 years, the stock has dipped below 50-day moving average a very few times.\n\nWhile we are at it, let's look at some of the fundamentals:\n\nPE: 28.14\n\nPS: 0.67\n\nPB: 4.66\n\nThese are some of the lowest number I see in my portfolio right now.\n\n# 4. Is there a bear case?\n\nFrom what I can see, very little. If WMT is down, I am pretty sure the whole market will be down. I also don't foresee them making poor business decisions in the coming future that will cause WMT to inverse the market growth.\n\n# 5. Is there a better alternative?\n\nMaybe Costco? but Walmart fundamentals are better with higher performing chart data. (I own Costco as well).\n\nTLDR: WMT has solid fundamentals, is down 10% for no reason, is seriously undervalued right now, there's no bear case, no rising competition, potential huge growth with online presence, it's a BUY.\n\n\\*not financial advice. I can't do DD. I am terrible at stock picking. Tell me why I am wrong.", "id": "md20ir", "created_utc": 1616689090.0, "score": 15, "upvote_ratio": 1.0, "num_comments": 25, "comments": [{"body": "> From what I can see, very little.   \n\nIsn't a P/E of 28 the \"bear case?\" A company can be *amazing* and still *overpriced*. \n\nWalmart could grow year upon year, but a P/E that high doesn't need regular growth, they need break-out growth. Keep in mind retailer's margins aren't tech company margins, even most of Amazon's profit comes from AWS.   \n\nIs Walmart a good buy? I have absolutely no idea, but you're definitely betting on something big at the current price and there absolutely could be a correction (in particular as they're priced like growth rather than value).", "score": 5, "replies": []}, {"body": "*>We don't know if it's going to stay, but I am unsure about investing heavily in tech. I want a company that can weather the storm*\n\n&#x200B;\n\nWe don't? Is the internet going to collapse? You better hope not, because then Walmart would be screwed, too.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "10 miles is 16.09 km", "score": 1, "replies": []}]}]}, {"body": "WMT has barely beat VTI in the past 5 years (WMT 93% vs VTI 92%), and has done much worse against VTI in the past year which was one big bull run (WMT 22% vs VTI 63%), and in which WMT had an advantage of lockdown and people buying a lot at grocery stores and not eating out. Why do you think it will beat VTI over the next 5 years?", "score": 5, "replies": [{"body": "mainly because of the dip we see right now with WMT.\n\nInstead of comparing the 5 year data, compare the time when WMT had dips:\n\nNov 2015: Walmart dropped 30% from ATH. To date, WMT had 126% increase, VTI 94%.\n\nMay 2018: Walmart dropped 20% from ATH. To date, WMT had 59% increase, VTI 44%.\n\nYou can't time the market, but at least you can buy dips.", "score": 5, "replies": [{"body": "Yeah but thats with the added risk of execution on walmarts part (versus full market performance), hoping the revenue doesnt dip more than expected (faster openings, people dining out). Suggestion being, that WMT all time high could be factors including lockdown boosting WMTs sales, which could take a downturn now. Performance in lockdown for WMT shouldve been higher with the advantage it had but it was less than half of it. If it cant win in conditions suited for it, what confidence can you have in revenues expected to decline? the market also isnt rational.. next time they see a big dip in revenues, WMT could dip again (even with expectation priced in). For individual stocks to grow more than the market, there have to be big catalysts, not just price action. \n\nWhy wont you bet on amazon or apple versus walmart? theyre on the exact same dip with revenues not expected to slow down as much and have beat the market in any time frame?", "score": 1, "replies": [{"body": "I just think the valuation of amazon and apple are very high right now especially with the potential seasonal rotation. I think MSFT is a better buy than those two. \n\nI agree mostly with your first paragraph. I also own VOO to track the market as owning a single stock like you say carry a risk.", "score": 1, "replies": [{"body": "Apple PE is 32 versus WMT 28 - apple with growth revenues and WMT with declines. How do you think Apple is overpriced and WMT isnt? if WMT maintains the same PE, if its revenues/earnings dip, so will its share price. Only way the share price increases with dip in revenues and earnings is its PE increasing - what makes you think it will?", "score": 3, "replies": [{"body": "With Apple, I am not comparing PE. I am factoring in seasonal rotation.\nAlso, we can't compare PE of a tech company vs a food retail. \n\nThe reason why I think MSFT is a better buy than Apple is because of it's diversification of the business. I get that PE for Apple is slightly lower than MSFT, but again, factoring in the seasonal rotation, I think diversification in the business is good.\n\nDon't get me wrong, I don't think anyone will go wrong with picking Apple or Amazon over WMT. In fact, in the long run, they may very well get better returns. At this point in time tho, I like the dip I see with WMT.", "score": 1, "replies": [{"body": "When you say seasonal rotation, do you mean 4-6 months at best? are we talking short term holds for all this or more than a year?", "score": 1, "replies": [{"body": "should have said sector rotation.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Does that include dividend?", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I agree on both of your bear cases. However, I don't think those two factors are big enough to actually lower the value of the stock when compared to the market.", "score": 2, "replies": []}]}, {"body": "i've been holding WMT for a month, and it hasn't moved at all.\n\npiece of shit", "score": -3, "replies": [{"body": "Well my other stocks have moved down, so not moving is pretty good", "score": 4, "replies": []}, {"body": "A whole month?", "score": 2, "replies": []}, {"body": "Lmaooooooooo", "score": 1, "replies": []}]}, {"body": "WMT seems like a solid bet, might add some. I’m also new to DD so I don’t really have any criticism, enjoyed reading this!", "score": 1, "replies": []}, {"body": "Its not really an “in-depth” DD. Would be nice to actually break down P/E, EPS etc to justify a certain price", "score": 1, "replies": [{"body": "You are totally right.", "score": 1, "replies": []}]}, {"body": "Said it before and I’ll say it every chance I get, I would pick TGT over WMT any day", "score": 1, "replies": [{"body": "TGT is solid", "score": 2, "replies": []}]}, {"body": "BJ has a PE half of Walmart’s and is growing rapidly", "score": 1, "replies": []}, {"body": "I’m in on wmt. Their online business will be big time.", "score": 1, "replies": []}, {"body": "I wouldn't say Walmart is over or undervalued at the moment. I bought some recently during the dip. The dip is largely financial institutions shuffling their investments around, causing a correction and I'm hoping it'll pick up over the next 6 months. Walmart did really well during the pandemic, being an essential grocery store. It has a bit of room to grow but not as much as others. In terms of worldwide expansion, Costco is starting to enter markets like China whereas Walmart is mature in most major markets so online/ pick up is really where it can gain additional business. I think the target price for this year is probably near the all time high earlier in the year. Most grocery stores are safe investments for the next year because there is still uncertainty about covid worldwide. Vaccines are not reaching outside the US fast enough and if there are additional lockdowns or new variants, Walmart will continue to do well in sales. Just buy, hold, check back in 6 months.", "score": 1, "replies": []}]}
{"title": "Is Tech Toast?", "selftext": "I need advice about the short-term future of tech stocks.  \n\nBack in August, I stuck $25K in a moderately risky, tech-heavy portfolio.  By early February, I was up almost 130%.  Over the last two months, however, the portfolio has cratered and I’m currently left with about 25% profit.  \n\nThere’s a possibility that I’ll need the money in six months.  (This is just my fun money account, not my retirement.)  Should I let it ride on tech in the hope of a short-term rebound?  Or should I take the profit now before any further collapse? \n\nIf it helps, imagine typical tech names:  AAPL, AMD, NVDA, SQ, TSLA, etc.", "id": "md64aw", "created_utc": 1616700079.0, "score": 0, "upvote_ratio": 0.44, "num_comments": 28, "comments": [{"body": "Some of y’all ‘round these parts are greedy AF. You have 25% profits. That’s a win. Take the damn win.", "score": 38, "replies": []}, {"body": "Is tech toast? technology industry will be around for ever and it will keep growing, tech is still the future. do not be scared of a little red.", "score": 17, "replies": []}, {"body": "Stop listening to delusional people on reddit about diamond hands. If you are up over 100% on a trade or investment, you take profits, i dont care how much you love the stock, you take profits and leave some to ride as house money.", "score": 47, "replies": [{"body": "That's what I do too. Some people give me shit but my 1st rule is to not lose", "score": 13, "replies": []}, {"body": "no. i am up currently up about 35,000% on appl in the last 20 years and im still not selling.", "score": 11, "replies": [{"body": "Those shares aren’t going to do much for you in the grave", "score": 9, "replies": [{"body": "I think apple is the best company on the planet, not only do I think it is currently, I think it will only get better in the future and I think it has the best executives in the world, and the most forward thinking. I have no reason to sell any shares in the company, I have several other positions that I have sold off when I wanted to change investments or needed money, however I have never considered lowering my position in apple", "score": 2, "replies": []}, {"body": "That dividend tho", "score": 1, "replies": []}]}]}, {"body": "Facts", "score": 4, "replies": []}]}, {"body": "If you need the money within months, just take it out now since you still have a profit. If you are stuck when you need the money then you would feel shitty. Just dont fomo when things go up between now and then. That's the market, but your real life obligations come first.", "score": 9, "replies": []}, {"body": "If you need the money in 6 months, how is it \"fun money\"?", "score": 7, "replies": [{"body": "“Need” is probably the wrong word.  \n\nIt’s money that would otherwise be sitting around in a savings account somewhere.  However, I’m considering using it to invest in some real estate at the end of the year.  So I’m trying to gauge whether people see more upside or downside to tech on that timeframe.", "score": -1, "replies": [{"body": "Ask a car manufacturer if he will sell more cars in the next months.\n\nAsk an athlete if he wins the next sports competition.\n\nAsk stock 'experts' if stocks rise.\n\nThey will all say yes.\n\nFact is tech is still considered high risk currently. Especially with Covid and the chip shortage tech can have a really awful year or it just goes up. Nobody knows.", "score": 5, "replies": []}]}]}, {"body": "I’m not an expert but my opinion would be to move it to something less volatile (like an industrials or s&p500 etf) if you may need the funds soon. \n\nI think short-term, tech is simply higher risk higher reward. So you may miss out on superior returns, but if you need the funds, I’d go with less volatility. \n\nAlthough given it’s 6 months away, rather than a shorter term need, I think there’s an argument to be made for tech.", "score": 6, "replies": []}, {"body": "Tech in 10 years? Very bullish.\nTech in 6 months? Yeah, probably toast.\nI'm in a similar position as you. Sold most positions at even less than 25% profit but profit nonetheless, because I might want to use the money this year. I spent about $250 on cheap puts for Sept/Oct from now, in case of a market crash (figured low risk, possibly high reward).", "score": 6, "replies": []}, {"body": "No", "score": 5, "replies": []}, {"body": "Heck no recovery soon", "score": 9, "replies": [{"body": "Heck! No recovery soon.", "score": 2, "replies": []}]}, {"body": "just remember if you take it out now, next year you are going to be paying taxes on short term capital gains. so make sure you factor that into your decision :)", "score": 2, "replies": []}, {"body": "Scared money dont make money. The truth is no one knows where the market will be in 6 months. There could be a new covid variant that stops everything, inflation could rocket, a war could break out, or nothing drastic happens. The outlook is the economy will pick up and tech may boom again as it always does. If you need the money, take what you need and leave what you can handle losing.", "score": 2, "replies": []}, {"body": "25% gains in like 7 months? Try sticking your money into a money market account rn, you'll get .5% if you're lucky", "score": 2, "replies": []}, {"body": "100% sell if you need the money in 6 months. Anyone who says otherwise is an idiot", "score": 1, "replies": []}, {"body": "Wait until 2nd week of May. If it still isn't going up, maybe cut half of positions.", "score": 1, "replies": []}, {"body": "Whats your cost basis on AMD and AAPL", "score": 1, "replies": [{"body": "$112 and $84, respectively.", "score": 1, "replies": [{"body": "I don’t think you understand what respectively means here. Not a bad position in Apple btw.", "score": 0, "replies": [{"body": "Same lol", "score": 1, "replies": []}]}]}]}, {"body": "Out of the one's you've listed I would take profits but let AAPL ride until its next keynote as new hardware will be announced and potentially an Apple car or car partnership. Keynote should spike it up, then sell. \n\nI'd keep SQ long term as most new businesses will continue to use their services while older business could transition over.", "score": 1, "replies": []}]}
{"title": "Here is a Market Recap for today Thursday, March 25, 2021", "selftext": "**PsychoMarket Recap - Thursday, March 25, 2021**\n\nStocks rose on Thursday, shaking off three consecutive days of losses in yet another volatile trading session. Market participants continue to monitor recent comments from Federal Reserve Chair Jerome Powell, the Treasury yield, and the coronavirus situation in Europe. \n\nIn an interview with NPR's Morning Edition Thursday morning, Federal Reserve Chair Jerome Powell doubled down in his assertion that the Fed remained strongly committed to targeting 2% average inflation over time, and said that any eventual pullback in Fed support would be done \"gradually over time, and with great transparency.\" This is the latest in a long string of comments from Powell and other monetary officials, like Janet Yellen, that point to the maintenance of accommodative monetary policies for the foreseeable future. \n\nHowever, despite Powell’s consistency in his statements, many market participants continue to fear that coming inflationary pressures could cause the Fed to tighten monetary policy earlier than expected. Tim Quinlan, senior economist at Wells Fargo said, “This will be the first time that every country in the world is emerging from recession simultaneously. And the Fed and other policymakers are banking on this idea that it’ll be a relatively short strain on supply chains but eventually, things get up and running again and you can get the input components to where they’re most needed.” \n\nThe 10-year benchmark Treasury yield continues to hover around 1.6%, falling from 1.75% earlier in the week. Despite the decline, the Treasury yield remains at elevated levels compared to 12 months ago, with the expectation that the yield will continue climbing as the economy reopens and recovers. Gabriela Santos, JP Morgan global strategist said, “We think long-term bond yields are just in a pit stop here in what’s going to be a multi-year move higher. Ultimately, we do continue to think that it will harm the more speculative or expensive parts of the market like tech and really benefit the more cyclical \\[sectors\\] and especially the parts of the market that can benefit from a steepening yield curve”. We agree, after the outsized growth in growth and tech stocks last year, it’s time for cyclical and reopening stocks, many that remain well below pre-pandemic levels, to recover as the economy gradually reopens.\n\nWe agree, rising Treasury yields hurt high-growth stocks the most because these companies require a lot of capital to fund their growth and expansion and generate most of their cash and earnings years down the road. Future cash decreases in today's dollars as rates increase partly because investors have more opportunity to earn bigger returns from assets paying higher interest and dividends right now. Higher yields make it more expensive to borrow capital. It’s important to remember that despite rising yields, the benchmark 10-year yield remains at historic lows, roughly half what it was five years ago. \n\nEarlier in the week, German Chancellor Angela Merken announced a new five-day lockdown over Easter. She then extended the measure for a month, citing a rise in coronavirus cases and and a reduction in the availability of ICUs. UK prime minister Boris Johnson on Tuesday said the third wave currently sweeping Europe was likely to \"wash up on our shores.\" Tough new fines to deter international travel were announced on Tuesday.\n\nThe rise in cases comes in tandem with flaring concerns regarding the safety of the AstraZeneca vaccine. Several countries have suspended the distribution of AstraZeneca’s coronavirus vaccine following reports of blood clots. Moreover, earlier in the week the, US Data and Safety Monitoring Board said AstraZeneca may have used outdated information in their report and provided an “incomplete” assessment of the efficacy of their vaccine ([Report by the Associated Press](https://apnews.com/article/astrazeneca-vaccine-reputation-missteps-01332124d4c18aba556a53b1a57bcc84)).  In a late-night news release Wednesday, AstraZeneca said it had analyzed more data from that study and concluded the vaccine is 76% effective in preventing symptomatic COVID-19, instead of the 79% it had reported earlier in the week, [insisting the vaccine was “strongly effective” against the virus. ](https://apnews.com/article/astrazeneca-vaccine-strong-protection-us-rift-466726258e5e546550907f123f67763d)\n\n**Highlights**\n\n* First-time unemployment claims fell to 684,000 last week from 781,000 a week earlier. Claims are now at the lowest point since mid-March of last year.\n* The never-ending saga continues, with shares of Gamestop (GME) jumping more than 50% today after report less-than-stellar earnings on Tuesday. Other meme stocks like AMC also gapped up in sympathy\n* Gamestop (GME)informed the U.S. Securities and Exchange Commission Wednesday that eight members of its board are expected to depart the company, in the companies continued push to switch their business strategy. \n* Chinese consumers and the country's ruling party have lashed out at Western clothing companies and threatened boycotts, as brands find themselves caught in the crossfire of sanctions over alleged human- rights abuses in northwest China. Nike (NKE) stock slid 4% on Thursday while shares in fellow sporting-goods retailer Adidas (ADDYY) tumbled 6%. \n* Lordstown Motors said on Thursday that it has received a request from the Securities and Exchange Commission for information related to its merger following a report by short-seller Hindenburg Research.\n* British electric van and bus startup Arrival Ltd will announce investments in more \"micro-factories\" throughout 2021 as it expands its global manufacturing presence, executives said on Thursday. Electric vehicle company Arrival has staged what is believed to be the biggest ever stock market listing for a UK tech company after completing its merger. Company started trading today as well.\n* **\\*\\*Please note that current stock price was written in the morning and does not reflect intraday changes.\\*\\***\n* Accenture (ACN) target raised by Susquehanna from $290 to $325 at Positive. Stock currently around $267\n* Aptive (APTV) target raised by Royal Bank of Canada from $168 to $174. Stock currently around $140\n* Boeing (BA) target raised by Susquehanna from $250 to $300 at Positive. Stock currently around $239\n* Alibaba (BABA) target raised by Truist Securities from $326 to $330 at Buy. Stock currently around $230\n* Chipotle (CMG) target raised by Wells Fargo from $1677 to $1775 at Overweight. Stock currently around $1422\n* Equitable (EQH) target raised by Morgan Stanley (MS) from $34 to $44 at Overweight. Stock currently around $31\n* Fedex (FDX) with two target raises. Stock currently around $268.\n   * Goldman Sachs from $356 to $365 ay Buy\n   * Raymond James from $305 to $310 at Outpeform\n* Nike (NKE) with three target raises. Stock currently around $133\n   * Royal Bank of Canada from $160 to $165 \n   * Credit Suisse from $162 to $176\n   * JP Morgan from $170 to $176\n* Restoration Hardware (RH) with too many target upgrades to list. Consensus price target around $600 at Outperform. Stock currently around $485\n\n“In my view, the biggest investment risk is not the volatility of prices, but whether you will suffer a permanent loss of capital. Not only is the mere drop in stock prices not risk, but it is an opportunity. Where else do you look for cheap stocks? - Li Lu", "id": "md828q", "created_utc": 1616705371.0, "score": 105, "upvote_ratio": 0.97, "num_comments": 21, "comments": [{"body": "this morning i woke up and thought\n\nahhh fuck, we're crashing again. \n\nevery time i buy, it dips. Not a single goddamn winner buying this dip", "score": 19, "replies": [{"body": "You just need to give it time, the market has been exceptionally hard recently. The market hasn't rallied yet so not surprising your positions may not be doing too well given all the volatility.", "score": 1, "replies": []}, {"body": "Yeah, I got crushed. I'm considering doing the opposite of what I should do, maybe that will work?  LOL", "score": 1, "replies": [{"body": "This is not a good idea, the best thing to do is have patience and go long in companies you really believe in", "score": 1, "replies": []}]}]}, {"body": "Thanks for the daily recap!", "score": 9, "replies": [{"body": "My pleasure, thanks for taking the time to read it!", "score": 1, "replies": []}]}, {"body": "thanks for the info", "score": 5, "replies": [{"body": "My pleasure! Thanks for taking the time to read the recap", "score": 1, "replies": []}]}, {"body": "You get my my upvotes every day. Thank you for your service", "score": 0, "replies": [{"body": "Appreciate that my friend! Thank you for the support and taking the time to read the recaps", "score": 1, "replies": []}]}, {"body": "GME has a chance to become a decent turn around stock to hold the more moves they will execute. They're not revealing it yet, which I think is a smart move; let them handle it in closed doors.", "score": -14, "replies": [{"body": "It's stark how GME is seen in it's own sub and rest of subreddits.", "score": 3, "replies": []}, {"body": "Yea Gme does at maybe 30-50 dollars.", "score": 1, "replies": [{"body": "I'll buy more at that price. Gonna safely assume you are comparing the stock to Blockbuster which has zero comparison with it.", "score": -5, "replies": [{"body": "No I'm comparing it to its financial valuation.", "score": 8, "replies": [{"body": "Hey now! Let’s not get crazy", "score": 1, "replies": []}]}, {"body": "Dude, the stock is trading at levels that would make sense AFTER they've fully completed a total revamp of their company. It's like pricing Virgin Galactic as if they've already traveled to and begun colonizing Mars.\n\nThe current price is waaaaay ahead of itself. \n\nI know this is like trying to argue with a flat earther but I can't help but to try", "score": 1, "replies": []}]}]}]}, {"body": "Thank you for the recap. Very helpful!", "score": 1, "replies": [{"body": "My pleasure! Glad you found the recap helpful", "score": 1, "replies": []}]}, {"body": "Thanks for all the work.", "score": 1, "replies": [{"body": "My pleasure! Happy to be of help", "score": 1, "replies": []}]}]}
{"title": "Finding the best buy (basic DD/ discussion): AMD, AMAT, NET, QCOM", "selftext": "[removed]", "id": "mdbpzi", "created_utc": 1616716043.0, "score": 20, "upvote_ratio": 0.89, "num_comments": 21, "comments": [{"body": "He shoots, he scores! Nothing but NET.", "score": 16, "replies": []}, {"body": "QCOM now faces competition from Apple, who historically has been a major customer.\n\nApple announced they are working to make their own 5g tech in house.", "score": 11, "replies": [{"body": "They might,  in the future,  but as of right now AAPL is buying BOTH the chips and the licenses from QCOM.  If in the future AAPL starts making its own chips,  they still have to buy the licenses from QCOM.   That's why the settlement was such a massive win for QCOM.", "score": 4, "replies": []}]}, {"body": "Where were you up until July of last year when QCOM was dirt cheap?  I stopped buying in January of 2019 because it was already my largest holding 150% of my normal.   Anyway, I sold 2/3 after the run up but I'm still holding a normal size position for me (100 shares at this price) .  \n\nQCOM is solid,  all the companies that deal with them hate the way they sell IP separately from chips and can therefore sell chips at a discount. However,  QCOM survived all the court challenges and have the only functioning 5G capability after IBM dropped out. When AAPL capitulated they signed a five year contract (going off memory here because it's late).  They are very powerful and make money,  lots and lots of money. \n\nRisks, well,  now that all the legal stuff is settled and they have long term contracts and are the undisputed leader in mobile tech, all that is priced in,  why would it do anything other than go up slowly paying a pittance for dividends (was 5% before).  \n\nAlso,  medium term,  IBM could make a better 5G chip (haha), or AAPL could make their own chips ( after the contract expires because they're well-known for making chips haha).\n\nI bought my first set of shares in March of 2015 when their CEO made comments about starting to look at ways to cut costs (this is a normal part of every other business,  but They make too much money to care before that) so the last risk is that they don't have an culture of cost control and the stress is gone.   I held onto a double sized position until after the last earnings call when they didn't raise the dividend.   Dividends impose discipline. \n\nSo yes,QCOM is the best out of the group,  but I'm only keeping it because I want to keep a little exposure to tech.", "score": 6, "replies": []}, {"body": "All by NET are in SMH. Plus you get MU and TSM too. And lots others.", "score": 5, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Thoughts of SMH vs PSI? Apologies if this has already been discussed.", "score": 1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Thanks and agree. Also looked like SMH went Intel and PSI went AMD in top holdings.", "score": 1, "replies": []}]}]}]}]}, {"body": "The P/E for AMD also concerns me but they’ve got solid revenue growth. I’ve been buying a share every time it dips $2 and my average cost per share is still $88 lol", "score": 2, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "AMD P/E is only like 38 according to TDA and Finviz. Where did you get 236", "score": 8, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "can confirm TDA lists it at 38.41x PE", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "webull reading these comments like: 🥸🥸", "score": 3, "replies": []}]}]}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "AMDs PE almost halved after last earnings report it’s under 40 they are absolutely killing it.", "score": 2, "replies": []}]}]}]}]}, {"body": "Qcom for the 5G play and PE only 23.  Then AMD, once tsm figures out their shit and gets amd chips made full scale they will kill it.", "score": 2, "replies": []}]}
{"title": "Volkswagen as the Next Tesla Is Firing Up Stock Investors", "selftext": "[deleted]", "id": "mclyjz", "created_utc": 1616634267.0, "score": 1, "upvote_ratio": 0.53, "num_comments": 23, "comments": [{"body": "What seems to be missed here is: why does it have to be competitive with Tesla?\n\nIt is enough if VW pulls over buyers from RAV4, CRV -> ID.4, or Golf -> ID.3.\n\nIt doesn't matter if Tesla is the fastest, people will still be buying the Audis, Polestars, VWs, Skodas etcetc.\n\nThis is what we want, no? Electrification.", "score": 11, "replies": [{"body": "In the end, the competition is between ice and ev", "score": 7, "replies": [{"body": "Exactly.", "score": 3, "replies": []}]}, {"body": "Absolutely thanks to tax and incentives shenanigans (i believe) you can get a ID.3 in Switzerland for 29'850 CHF (58kWh version). This is quite a good deal for a everyday EV IMO. \n\nVW likely does not make profits at this price. But it's great for EV adoption.", "score": 3, "replies": []}]}, {"body": "Volkswagen will still be around even if they're making less competitive cars.  And really that term \"next Tesla\" is misleading since the next Tesla \"could\" be volkswagen, but a race between Usain bolt and a bunch of toddlers would still have a toddler in second place.\n\nIt's also like how I don't understand why mitsubishi is still in business and selling cars.  There's just people that will want some here and there.", "score": 4, "replies": [{"body": "It's kind of odd how tribal people are with cars.\n\nLike there are also saab, who the fuck buy saab? You barely hear of them. But there are people who swear by them!\n\nWhile researching this comment I read they are no more.\nFine.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 13, "replies": [{"body": "I don’t think VWs current touch screens preclude them from being able to make eventually 5-10m+/yr EVs. The demand for EVs is higher than the supply, and Tesla won’t be producing 100% of the world’s batteries, so Vw and several other automakers are going to be able to make EVs at scale, unless one of them makes widespread robotaxis first, and even then it would take a while to make car ownership obsolete and to make the multi-company EV market consolidate based on robotaxi primacy", "score": 5, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "It still boils down to who can acquire enough batteries. That's the end goal.", "score": 2, "replies": []}]}, {"body": "how many EVs can they manufacture in 2021 with the amount of batteries they're able to source?  how much in 2022?", "score": 1, "replies": []}]}, {"body": "You underestimate how many people either don't want a tesla for different reasons, and how many people are fine without a good touchscreen or just CarPlay. They are used to garbage computers and just don't care.", "score": 2, "replies": []}]}, {"body": "I test drove an ID4 in Florida today. I don't see how it's competitive with a tesla. Won't be available at scale for a long time.", "score": 7, "replies": [{"body": "> Won't be available at scale for a long time.\n\nYou know that there are currently 3 factories producing it? Zwickau, Anting(ramping up), Foshan (ramping up) and starting in 2022 Chattanooga?", "score": 1, "replies": [{"body": "I've followed vw's grandiose plan fairly close. All powertrain PowerPoints aside it boils down to execution of the plan. It'll be months before you can take delivery according to the sales guy. \n\nTo be honest it's an inferior product to the model y. Even with the tax credit.", "score": 2, "replies": [{"body": "> It'll be months before you can take delivery according to the sales guy. \n\nFor the US, okay. The US is only the third biggest EV market worldwide. In Europe for example the ID.4 is already sold in significant numbers.", "score": 1, "replies": [{"body": "Also being delivered, at large.", "score": 2, "replies": []}, {"body": "Sold to their own dealerships?", "score": 2, "replies": [{"body": "Good meme. Do you know how dealerships operate? They buy cars from manufacturers to sell them afterwards. Not a really a hard concept to understand. Important to note that not a single dealership has the obligation to buy unwanted cars from VW...", "score": 1, "replies": [{"body": "Good luck to H Diess and VW group. Hope to see a good race!", "score": 2, "replies": []}]}]}]}]}]}, {"body": "What part specifically? The brand is known and liked, the quality is probably more consistent, some people like the design, etc.\n\nGive us specifics please! We haven't test driven it 🤓", "score": 1, "replies": [{"body": "Cons: No frunk, underpowered, wierd control interfaces, low range. $38k with tax credit", "score": 2, "replies": [{"body": "They advertise it as 530 km of range and Tesla as 505km - now I don't believe that for a second, but the average consumer has no idea.", "score": 1, "replies": []}]}]}]}, {"body": "Remember all of those iPhone killers?  (Droid, Windows Phone, HTC, blackberry) These are the so-called “Tesla killers”.  None of these competitors will make it.", "score": 2, "replies": []}]}
{"title": "Apple (AAPL) Patents a LIDAR System With a Waveform Design for the Apple Car", "selftext": "", "id": "md3475", "created_utc": 1616691965.0, "score": 19, "upvote_ratio": 0.83, "num_comments": 20, "comments": [{"body": "Doomed ?", "score": 16, "replies": [{"body": "Can they dock a spacecraft to the ISS?", "score": 22, "replies": [{"body": "Such a perfect answer!", "score": 6, "replies": [{"body": "It’s a question because I see a question mark.", "score": 0, "replies": [{"body": "It was a rhetorical question ;)", "score": 3, "replies": []}]}]}]}, {"body": "Totally.", "score": 2, "replies": []}]}, {"body": "Is it just me or does an apple logo on a car kinda look weird?", "score": 9, "replies": [{"body": "shit rendering. apple logo stuck on Hyundai prophecy concept.\n\n&#x200B;\n\n[https://images.app.goo.gl/9pTWEEJ4w8k8mNeJ8](https://images.app.goo.gl/9pTWEEJ4w8k8mNeJ8)", "score": 6, "replies": []}, {"body": "Far too big IMO.", "score": 1, "replies": []}]}, {"body": "Caution: you need a special, expensive, adapter to use this LIDAR. It connects to the USB-C and can be daisy chained to the adapter that controls the AC.", "score": 6, "replies": [{"body": "You can’t charge the car and talk with earbuds at the same time either.", "score": 2, "replies": []}]}, {"body": "Glhf", "score": 2, "replies": []}, {"body": "Does that go on the shelf with the solar panel touch screens from like 4 years ago?", "score": 1, "replies": []}, {"body": "Good luck to them. Genuinely want them to success (and I'm not even an Apple fan), but seeing them fail could also be entertaining (I ashamed of myself)", "score": 1, "replies": [{"body": "Totally. Exciting to watch regardless of the outcome", "score": 1, "replies": []}]}, {"body": "Need to find slave workers to make it. Assemble in China.", "score": 1, "replies": []}, {"body": "Lidar sensor range decreases as the mileage increases - that is the Apple waveform.", "score": 1, "replies": []}, {"body": "Bullish.", "score": 1, "replies": []}, {"body": "Tesla should make their windows lidar diffusing. 1. Protects drivers eyes, 2. Well you know..", "score": 1, "replies": []}, {"body": " 8 years of project titan and nothing to show off.", "score": 1, "replies": []}]}
{"title": "New York City's fleet of Tesla Model 3 yellow cabs is growing quickly", "selftext": "", "id": "md6wuk", "created_utc": 1616702228.0, "score": 142, "upvote_ratio": 0.99, "num_comments": 25, "comments": [{"body": "I live here in NYC and drive around frequently and i can say I'm seeing more and more of these", "score": 23, "replies": [{"body": "it’s a no brainer when you compare the numbers on paper", "score": 13, "replies": [{"body": "I haven't seen the numbers on paper. Got a link?", "score": 1, "replies": [{"body": "Fuel is about half price. And you don’t idle your engine. \n\nOh, and the ride is amazing compared to an ice car.", "score": 4, "replies": [{"body": "> Oh, and the ride is amazing compared to an ice car.\n\nHow so? It's still a NYC cab ride, right?", "score": 2, "replies": [{"body": "Smooth, quiet, no power delay, no gear changes, no vibration, corners well.  Regen braking is smooth and consistent also.", "score": 1, "replies": []}]}]}]}, {"body": "With all the miles they drive it's astounding to me there aren't a lot more of them", "score": 1, "replies": []}]}, {"body": "When FSD arrives they will be well positioned", "score": 3, "replies": []}]}, {"body": "To me a Y would make a much better cab.", "score": 16, "replies": []}, {"body": "Puke is a lot easier to clean on Tesla synthetic seats too.", "score": 8, "replies": [{"body": "I’ve spoken to the tesla engineers, and there’s a funny story there. The door trims are engineered to keep puke from going inside the door trims, after one of the engineers had a bad experience in college.\n\nHe said he had an old Toyota pick up truck and one of his friends was really drunk and there’s a police officer on the other side of the parking lot. They weren’t gonna drive anywhere but they also weren’t gonna walk anywhere and go anywhere in front of a police officer. So they just sat there in the truck. His friend puked but didn’t make it all the way outside of the door, and ended up puking all over the door. His friends puke ended up getting inside of the door and he had to take the Toyota to the dealership where they could open the door up and hose the puke out.\n\nKind of a weird scenario, but nice to know that Tesla thought of it. Those pull cups can take it.", "score": 17, "replies": []}]}, {"body": "City mileage is the best for these things. Average taxi miles in nyc per 12 hour shift is 180. 30 minutes max charge time at a super charger. \n\nAverage mpg of new cabs are 33mpg which isn’t bad, but at lets say $3.50 per gallon 180 miles in gas would cost about $20. 180 miles at a super charger would be like $10-$12, so essentially 50% savings. But if they figure out a way to get cheaper energy then those savings just get better and better.", "score": 8, "replies": [{"body": "I’m sure they charge them at the lot not at a super charger", "score": 1, "replies": [{"body": "They could install super chargers at their lot.", "score": 1, "replies": []}]}]}, {"body": "Great !!! Hopefully the trend catches up and spreads to other cities as well. This move will generate all important data needed for TSLA to have successful robo taxies in future.", "score": 6, "replies": []}, {"body": "Wow. When do they become robotaxi's??", "score": 3, "replies": [{"body": "Probably 5-7 years", "score": 2, "replies": [{"body": "So you're basically saying: 🚀🚀🚀", "score": 2, "replies": []}]}]}, {"body": "Getting to much of a taxi image for Tesla's might hurt consumer sales locally.", "score": 2, "replies": [{"body": "I disagree. In Europe a lot of the cabs are Mercedes Benz. Nobody bats an eye and it doesn't hurt sales.", "score": 3, "replies": [{"body": "Weeeeell, my uncle does get teased for owning a “Berlin taxi”.", "score": 1, "replies": []}]}]}, {"body": "Where do they charge inside the city? How many miles does a New York cab do per day?", "score": 1, "replies": [{"body": "My guess would be back at the garage if it's overnight, or a Supercharger otherwise.", "score": 1, "replies": []}, {"body": "> New York cab do per day\n\nLess than you think.  Lots of time waiting at lights and in traffic.", "score": 1, "replies": []}]}]}
{"title": "BREAKING: Moody's has upgraded the ratings of Tesla Inc, corporate family to Ba3 from B2, senior unsecured to B1 from B3 and speculative grade liquidity rating to SGL-1 from SGL-2. The outlook changed to positive.", "selftext": "", "id": "md9fy2", "created_utc": 1616709228.0, "score": 206, "upvote_ratio": 0.99, "num_comments": 24, "comments": [{"body": "This is very good. Still maddening that they're not investment grade though. They have had what, 6? Profitable quarters now. And have more cash on hand than they have debt.", "score": 46, "replies": [{"body": "Big penalty for high growth.", "score": 31, "replies": [{"body": "What do you mean?", "score": 5, "replies": [{"body": "Credit rating agencies apply a big penalty when rating high growth companies.\n\nThis isn't Tesla specific - it's a historic pattern they are careful about.", "score": 26, "replies": [{"body": "Makes sense. We know Tesla is going to need billions for all their plans. We just don't know how many billions it might be.", "score": 8, "replies": [{"body": "Not that many billions. Considering that they have 10b plus sitting on the  balance sheet plus btc holding. Also the company has become (increasingly) profitable so it can finance own growth organically.\n\n\nThe upgrade also insulates Tesla from the yield jittery to some extent by lowering its borrowing cost. Once it is upgraded to investment grade it will be much more insulated from long term Treasury rate.", "score": 5, "replies": []}]}, {"body": "I see, thank you!", "score": 2, "replies": []}]}]}]}]}, {"body": "This relates to one of the catalysts Gary Black listed for his $950 pt. Although he is expecting investment grade before year end.\n\nThe upgrade also insulates Tesla from the yield jittery to some extent by lowering its borrowing cost. Once it is upgraded to investment grade it will be much more insulated from long term Treasury rate.", "score": 18, "replies": [{"body": "Oh shit, you follow Gary Black too.", "score": 1, "replies": []}]}, {"body": "This is excellent", "score": 13, "replies": []}, {"body": "Still junk grade but moving up. Need to clear the threshold to investment grade\n\nHere’s a rating guide. https://twitter.com/sawyermerritt/status/1375201722121998346?s=21", "score": 8, "replies": []}, {"body": "I wish I I knew what this meant. But since most are happy, I am happy", "score": 7, "replies": [{"body": "If Tesla wanted to borrow money, they can pay a lower interest rate because a (somewhat questionable) 3rd party rates them as less risky.", "score": 13, "replies": []}]}, {"body": "I like the stock!", "score": 13, "replies": [{"body": "But do you like the bond", "score": 6, "replies": [{"body": "Moody's does.  So that's something.", "score": 7, "replies": []}]}]}, {"body": "This is laughable, such a dead rating system that rate something like Exxon with Aa2 - a shit company that is about to be erase from existent by Tesla.", "score": 7, "replies": []}, {"body": "New high ‼️tomorrow Friday ‼️", "score": 3, "replies": [{"body": "We can only hope", "score": 2, "replies": []}]}, {"body": "Let’s go 🚀", "score": 3, "replies": []}, {"body": "Nice ☺️🚀", "score": 3, "replies": []}, {"body": "HAWT 🚀", "score": 1, "replies": []}, {"body": "It’s no longer junk!", "score": 1, "replies": []}]}
{"title": "Tesla ordered to have Elon Musk delete anti-union tweet", "selftext": "", "id": "mdavsx", "created_utc": 1616713418.0, "score": 0, "upvote_ratio": 0.42, "num_comments": 24, "comments": [{"body": "Why do you have to delete a tweet if it's true, your options would go to the Union for disbursement, I'm sure they'll want their \"cut\"", "score": 6, "replies": [{"body": "I suspect it is considered illegal because it's retaliatory.", "score": 1, "replies": [{"body": "But is it retaliation? He’s saying the the union decides how the shares are distributed because they negotiate compensation etc, which could potentially mean you lose a portion of what would be your shares to other members of the union. That’s not retaliation if it’s what you voted for, but I don’t really know the details of what their vote would mean just asking a hypothetical. \n\nI think they made him delete it for being a scare tactic not retaliation.", "score": 3, "replies": [{"body": "He is clearly talking about the fact that other companies with the UAW do not have stock options for their employees , which he even clarifies [in this next tweet](https://twitter.com/elonmusk/status/999415738967277568?s=19)\n\n >Exactly. UAW does not have individual stock ownership as part of the compensation at any other company.", "score": 2, "replies": [{"body": "That’s what I figured, but for the sake of my lack of knowledge on how a company transitions to one with a union would the employees simply lose their stock options because they unionized? I don’t believe they can simply do that, but I’m sure they’d stop giving them out anymore after. They’d probably also find a way to prevent a liquidity event that could make restricted units ever pay out to prevent vested and unvested RSUs expire worthless.", "score": 0, "replies": [{"body": "I do not think they are talking about taking away previously granted, unvested options, but removing them from standard comp packages. Which is fair IMO.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "They're raising a 2018 tweet back from the dead? Now, after the stock has gone up like 20X? \n\nExactly what is the goal here? To make Tesla employees want to unionize and miss out on possible future stock options?", "score": 3, "replies": [{"body": "lol.  unionized employees can have stock options.", "score": 2, "replies": [{"body": "Not if they unionize through UAW, who has a track record of not allowing individual stock ownership in ANY of their existing agreements with companies", "score": 5, "replies": []}]}]}, {"body": "Correct me if I am wrong. If they value union so much why not just leave and work at Ford or GM.", "score": 4, "replies": [{"body": "If you want to join a union you should quit your job and move across the country to a workplace where workers are already union represented? That's not how it works. Anyone can join and form a union and engage in collective bargaining.", "score": 11, "replies": [{"body": "Why is this a one-way street, though?  There are plenty industries that *mandate* union membership, regardless of whether you want it or not.  If you don't want to join the union, the response is basically \"well go work elsewhere, but it won't be this industry.\"\n\nI say this from first hand experience.", "score": 3, "replies": [{"body": ">I don't want to collectively bargain I think I can stand on an even footing with a large multinational with an army of lawyers and contract negotiators.\n\nSure okay.", "score": 1, "replies": [{"body": "Or how about, \"I'm young, and don't have need of the 'benefits' that come along with union membership, and I can't afford to pay the union dues, especially when the Union won't require my employer to pay me the Union Mandated wages for my position.\"  \n\nThe Union is shit at representing it's members, and the employer is shit at honestly representing my job classification, which the union was aware of, and didn't care about.\n\nYou honestly go around thinking that Union = Good in all circumstances?  Sure okay.", "score": 2, "replies": []}]}]}, {"body": "Unionizing is a fundamental right. It's like saying if you like free speech so much why don't you just move to a country that has free speech?", "score": 6, "replies": [{"body": "Or if you dont like unions then move to somewhere like Colombia where factory workers get killed for trying to form a union.", "score": 0, "replies": []}]}]}, {"body": "That is too sensible. Let people “vote with their feet.”", "score": -6, "replies": []}]}, {"body": "Union is a fat, uninspired lazy worker's best friend.", "score": 2, "replies": [{"body": "Yeah... some jobs are just uninspiring, yet needed for society...", "score": 1, "replies": []}]}, {"body": "Look this article if you dislike CNBC : https://www.reuters.com/article/us-tesla-nrlb-musk-idUSKBN2BH3BV", "score": 1, "replies": []}, {"body": "Union us screwing the workers today.", "score": -2, "replies": [{"body": "Maybe like 15 years ago this 20 year old was working front desk at a gym I managed and he also got a job at Starbucks in a Safeway or something like that. It was union and he eventually got a quarter raise or something, then he was set to join the army so he left Safeway and my gym, but that got pushed back and when he tried to go back to Starbucks they wouldn’t hire him at his old rate, but the union wouldn’t let him take less pay than he had before, so he couldn’t get his job back. I think he worked for me again though, but all of this was so long ago I don’t remember.", "score": 1, "replies": []}]}, {"body": "Did the tweet get deleted? It’s a sweet opportunity for Musk to troll these pro-union turds.", "score": 0, "replies": []}, {"body": "Unions are garbage and celebration of the lazy and incompetent", "score": 1, "replies": []}]}
{"title": "What did I do wrong?", "selftext": " I recently started trading options - I know options in theory in detail (as a finance major), but never traded before before of the inherent risk and my inability to devote substantial time to trading during the day. I do have a retirement + brokerage account. however I have come to realize that I need passive income.\n\nI know that there is a learning curve when it comes to trading options but I am finding it difficult to find a footing. My goal is to start small and have smaller targets - I recently financed my car purchase and I would like to cover my monthly payments and other overheads (\\~$700-800) through profits in my options trading account.\n\nAfter reading about option trading strategies I have realized that option wheel is a better strategy for longer term. For starters, I opened a ToS account to start simulated trading. I have wherewithal to put $10000 in my live account which makes me ineligible for expensive stocks which are over $100. However, just to try out this strategy I place 3 trades in my simulated trading account.\n\nMarch 16: Made three trades:\n\n1. Sold AAPL puts at $122 Strike March 19 Delta of 22 - Stock price was around $125 at that time\n2. Sold PLTR puts at $24 Strike March 19 Delta of 27 - Stock price was over $26\n3. Sold TQQQ puts at $90 Strike March 19 Delta of 24 - Stock price was over $95\n\nFast forward on March 19, all three trades ended up in the money. I realize that these stocks have high beta relative to each other but I got all three stocks assigned, which would have blew up my account. If you look at all three stocks today, they are substantially down than last week and it would take a lot of time to get out of the hole.\n\nHow do ppl usually play this strategy? Go for low vol stocks like T etc.? But premiums on those are quite low because of low vol. Is it too ambitious to expect $700-$800 nominal return per month on a $10k account using options strategy? Any advice would be appreciated.\n\nI also tried unusual options activity trading strategy, but it has a 50-50 win loss ratio.", "id": "md6sz1", "created_utc": 1616701931.0, "score": 2, "upvote_ratio": 0.67, "num_comments": 20, "comments": [{"body": "Your strikes are too tight.  A 10% price move on pltr, is nothing.  A 5% move on QQQ is nothing, a 2% move on Apple is nothing.  You had 3 days to expiry vs. the recommended 30-45 days you had no room to move.  One down day and you were hosed.", "score": 16, "replies": []}, {"body": "So I would say your biggest problem was doing 3dte trades.  If you don't have the time to monitor your trades throughout the day then you shouldn't be entering weeklies risking more capital than your account can cover if you get assigned.  If you are going to leverage a margin account you either need to do monthlies so that one or two bad days don't blow up your account or be in a position where you can monitor and adjust your trades throughout the day.", "score": 11, "replies": [{"body": "This. There was nearly zero theta left which means you were just directly leveraging the moves of the underlying. That's swing/daytrading. A longer DTE yields a larger percentage of the premium as time value and allows your (hopefully existent) analysis of direction on the underlying to play out. \"I know PLTR will go up from here, but not which day it will choose to do so, so I will give my strat 35-55 days to mature\".\nI know you are looking for monthly income, but think of it like bond laddering and expect the income to build as the ladder is built out. You won't be recieving maximum income until you are cyclically taking the profits from early trades and re-entering new positions. At that point you can start skimming income out of the account for other purposes.", "score": 7, "replies": []}]}, {"body": "You didn’t do anything wrong in the sense of error... the underlyings just went against your trade. Technically, the mistake was selling naked.\n\nGenerally with the wheel strategy you sell cash secured puts, and will eventually be assigned. Then you sell covered calls until it gets called away. \n\nSo don’t sell more puts than you can afford to be assigned on.", "score": 8, "replies": [{"body": "Thanks. That is correct and the only reason I sold three puts was because this was paper trading account. But if I were to sell AAPL puts for instance or TQQQ puts for that matter with a live account I would have been in a very big hole by now and it would take me a month or more to recoup.", "score": 3, "replies": [{"body": "Yup! If You figure out how to avoid the trades were the market moves against you… Let me know!", "score": 8, "replies": []}]}]}, {"body": "Consistent 8% every month for every year returns would be world class. So, dont rely on it, for sure. \n\nYou asked what you did wrong. While you could have maybe moved the strike price lower on each, the short answer is if the market goes south, that's that. Sometimes the answer is simply ... that's life.\n\n You also could look to roll the puts out. Certainly on Apple that would be a no brainer.", "score": 7, "replies": [{"body": "This about the 8%. That'd be 100% ROI yearly to cover your $800. \n\nI do use super short DTE sometimes when it makes sense, but I expect low returns on them, like 0.5% on a few thousand dollars at most. I think selling options are rarely the best choice for a single strategy. I sell CSPs, run condors, credit and debit spreads, long term holds, and CC. It's less finding stocks in the right position to fit your strategy and more using the correct strategy to fit the stock in the position that it's in. Lately I've been looking at dozens of charts a day/week and make maybe 3 or 4 trades total for the whole week, outside of CC against my long positions. \n\nIf you have $10k, I'd honestly take $7500 and put it in some other types of trades and using the $2500 to sell options. I didn't even think about selling CSPs until my account was big enough to take assignment and a 10% loss on that assignment and it just be a bad day. Not saying that you can't or shouldn't.\n\nI still don't touch anything above $150 strike unless deliberately trying to establish a long position. \n\nAlso, good job starting on paper. I still paper trade all the time. No point in practicing something you're not sure about with money. \n\nI'm gonna say it. Why is your car $800/month? That's a bad investment right there. Unless \"other overheads\" aren't car related?", "score": 2, "replies": []}, {"body": "That makes sense, rolling on safer stocks could work. Thanks", "score": 0, "replies": []}]}, {"body": "Nothing that others haven't pointed out already but the errors I see are:\n\n*  Too close to expiry. This means very little premium collected and if the underlying moves against you there's no chance of recovery. Sell 30-45 dte, close at 50% profit.\n\n*  Too leveraged. You are trading $24,000 nominal underlying in a $10,000 account (ignoring the fact that $9000 of that is already triple leveraged). Most people trade cash secured (nominal value of underlyings < cash in account)\n\n*  Too correlated. Everything you were trading was some variation of high priced Tech stocks. This is one of those 'it works until it doesn't' things. It's been working very well for the last year. Uncorrelated (or less correlated) underlyings can all crash at the same time (see March 2020) but there is less chance of them all dropping.", "score": 4, "replies": []}, {"body": "First part of the wheel is selling a cash-secured put.\n\n$10,000 is not enough cash to cover AAPL @ 122, PLTR @ 24, and TQQQ @ 90.", "score": 3, "replies": [{"body": "Thanks. I was trading via paper account just to try out what works and not", "score": 1, "replies": []}]}, {"body": "Return expectations need some calibration. Gotta use that detailed knowledge of option theory. I imagine looking at the greeks would've given you a heads up that there was a good chance your options would end up ITM.", "score": 3, "replies": [{"body": "Simply looking at charts would have alerted him to this fact.", "score": 2, "replies": []}]}, {"body": "You need to spend a lot more time thinking about how to reduce your downside risk.\n\nI mean many dozens of hours.", "score": 3, "replies": []}, {"body": "Did u mean to buy puts?", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "He learned from class, meaning he memorized some formulas. I was a finance major and was also shocked at how much I sucked when I started paper trading.\n\n8 years working on the buy-side just made me feel dumber and less confident in my ability to predict the future. I generate returns that beat the market, but I spend a ton more time thinking about hedging than looking for ways to make gains.", "score": 1, "replies": []}]}, {"body": "Then sell them when the stock price drops. For profit.", "score": 1, "replies": []}, {"body": "I only sell a put when I'm trying to get assigned. And even then I'm starting to do it less and just buy shares. What do most people do when their underlying is down. So far I've been just waiting for it to not be down then I sell a 30 day cc at a nice premium. But I won't always have confidence in it coming back so soon. Do you sell one anyways why it's down or maybe sell a shorter time frame so if it goes up you can then lock in a longer time frame?", "score": 1, "replies": []}]}
{"title": "15 Tesla Semi electric trucks are expected to be delivered to PepsiCo this year", "selftext": "", "id": "md1y8a", "created_utc": 1616688928.0, "score": 181, "upvote_ratio": 0.96, "num_comments": 25, "comments": [{"body": "So they’re semi electric or they’re electric semis?", "score": 30, "replies": [{"body": "Pretty sure Electric Semi’s lol", "score": 12, "replies": []}]}, {"body": "Hopefully not rolling it downhill", "score": 26, "replies": [{"body": "Got that reference 👍🏻\n\nEdit: thx for my 1. award ⬆️", "score": 8, "replies": []}, {"body": "Have you not seen the videos of it on the highway?", "score": 2, "replies": [{"body": "OP. This was a joke regarding (I think) Nikolas ceo rolling a car without a motor down a hill and filming it to make it appear as if the company is making progress when in fact they are fake as shit. The ceo also then disappeared after lying over and over about orders and all types of stuff. This is just ny vague recollection", "score": 7, "replies": [{"body": "You forgot the part where the companies revenue for an entire year was the cost of installing solar panels on the roof of his house.", "score": 4, "replies": [{"body": "WE ARE A PRE REVENUE COMPANY BROTHA", "score": 2, "replies": []}, {"body": "Oh yeah that was a big one. Thanks!", "score": 2, "replies": []}]}]}]}]}, {"body": "I like Pepsi.", "score": 7, "replies": [{"body": "This is a Wendy’s.  No Pepsi, Coke.", "score": 1, "replies": []}]}, {"body": "do they have the driverless feature?", "score": 4, "replies": [{"body": "i’m sure they’ll have the capability, gettin large companies like this on board should help the push towards fully driverless cars eventually, i’m sure they’d love to not have to pay as many drivers", "score": 3, "replies": []}, {"body": "On Joe Rogans recent podcast with Elon, Elon said they would most likely have a “follow” feature before “auto-pilot”.\n\nEssentially a captain truck/driver, and a line of trucks that follow behind, and mimic the movement.", "score": 2, "replies": []}]}, {"body": "Coke > Pepsi", "score": -2, "replies": [{"body": "Personally, I prefer root beer", "score": 4, "replies": []}]}, {"body": "15 out of the millions of diesel ones. I know it takes time but this doesn’t mean anything as of right now.", "score": -4, "replies": [{"body": "This is just the beginning, I bet next order is for 100 at least", "score": 11, "replies": [{"body": "The order is already for 100. This is what Tesla's able to build and deliver now. It's all about cell supply. The 500 mile range semi will use the same cells as TEN Model S. That's $180k revenue for 1 semi or $800k for 10 LR AWD S... or $1.2M for 10 Plaid S.\n\nOr 13 Model 3 Perf for $727,870.  \n\n\nEDIT: Which tells us two things.  1: Cell supply has to be carefully applied to products.\n\n2: Tesla's new 4680 cells are really really going to cut costs to allow this.", "score": 7, "replies": [{"body": "Then I had a damn good bet 😂 (I didn’t read the whole article just posted it here ASAP)", "score": 2, "replies": []}]}]}, {"body": "I think Pepsi is experimenting. Imagine if they love it.", "score": 3, "replies": []}]}, {"body": "take an updoot", "score": 1, "replies": []}]}
