{"title": "Are we in a bubble? Time to short soon?", "selftext": "", "id": "6rsdy4", "created_utc": 1501947365.0, "score": 1893, "upvote_ratio": 0.94, "num_comments": 153, "comments": [{"body": "How to short humanity?", "score": 331, "replies": [{"body": "Use CRISPR to make weaponized viruses. Then purchase some call options on pharmaceutical and medical stocks.", "score": 248, "replies": [{"body": "Long umbrella corps ", "score": 94, "replies": []}, {"body": "Confirmed illuminati. ", "score": 14, "replies": []}]}, {"body": "Invest in insurance.", "score": 30, "replies": [{"body": "If a lot of people die insurance has to pay out... Insurance should want everyone to live longer and keep paying premiums", "score": 10, "replies": [{"body": "True", "score": 1, "replies": []}]}]}, {"body": "[The Armageddon Trade. Short the S&P 500](http://www.npr.org/sections/money/2015/03/06/391023353/episode-608-shorters-gonna-short)", "score": 6, "replies": []}, {"body": "Long cancer.", "score": 3, "replies": [{"body": "Long pig?", "score": 2, "replies": []}]}, {"body": "Zyklon B", "score": 14, "replies": [{"body": "Fritz would like a word with you", "score": 1, "replies": []}]}, {"body": "Long global warming", "score": 10, "replies": []}, {"body": "Invest in soda cap.", "score": 2, "replies": []}, {"body": "Historically we as a species were much taller than we are now. We've been shorting ourselves for a long time. ", "score": 2, "replies": []}, {"body": "You guys are the best part of Reddit. Seriously! ", "score": 1, "replies": []}, {"body": "Short enviroment", "score": 1, "replies": []}, {"body": "looks like it started getting shorted a while ago.\n\nsource: http://data.worldbank.org/indicator/SP.DYN.TFRT.IN", "score": 1, "replies": []}, {"body": "Procreate more niggers", "score": -117, "replies": [{"body": "Don't be like this", "score": 89, "replies": [{"body": "Sorry, procreate more basketball Americans ", "score": -49, "replies": [{"body": "Shieeettt", "score": 21, "replies": [{"body": "I laughed, am I a faggot now", "score": -6, "replies": [{"body": "You've always been a faggot.", "score": 25, "replies": []}]}]}]}]}]}]}, {"body": "Actually, same faggot here in another thread dropped a pretty good theory that everyone (by that i mean retail plebs - not us) is just going to keep dumping money into index funds so the market will be boring as fuck. Then something is gonna happen and the market will dip, and the pussies will pull out of funds, which means the funds need to sell holdings and the downward price pressure continues. \n\nIt's a perfect feedback loop. Keep an eye on fund flows and index prices, and make sure your trigger finger is ready", "score": 174, "replies": [{"body": "As soon as someone from WSB closes all his positions, the markets will skyrocket again. No need to worry.", "score": 153, "replies": [{"body": "They'd have to be well diversified to have an effect on the broad markets. Ain't nobody here buying into that diversity shit. ", "score": 17, "replies": []}]}, {"body": "So short stuff?", "score": 4, "replies": []}, {"body": "wut", "score": 2, "replies": []}, {"body": ">Then something is gonna happen and the market will dip, and the pussies will pull out of funds, which means the funds need to sell holdings and the downward price pressure continues.\n\nWhy does it mean funds have to sell holdings?\n\nYou are referring to indices, right? They basically just mimic S&P and what not.", "score": 8, "replies": [{"body": "I'm a bit fuzzy on the details and I've never worked at an index fund, but as i understand it the funds (and when I say funds, yes I am referring to things like SPY which tracks the S&P500) basically work like this: the ETF has a relationship with large broker-dealers such that they can exchange ETF shares for the underlying assets (i think they can also exchange for cash if it comes down to it). The broker-dealers then can sell the ETF shares into the market where retail plebs like you and me buy them.\n\nThis means the broker-dealers in the market provide liquidity - if people are selling off SPY then the broker-dealer can buy them up while concurrently selling short the underlying securities, and at the end of the day (or whatever the terms of their agreement are) they exchange the block of ETF shares they bought (providing liquidity to you and me) for the underlying securities they sold short with the fund directly, covering their shorts - and probably making a few bps in between.\n\nSo the TLDR is that if people start selling off the funds, then the funds (or technically their B-D partners) have to start selling off the underlying securities to cover 'redemptions'. It works the same in reverse, which I think is probably why indices have rallied pretty good in the last while - tons of money has been flowing into index funds", "score": 9, "replies": [{"body": "bps?", "score": 2, "replies": [{"body": "Basis points", "score": 2, "replies": []}]}]}, {"body": "> Why does it mean funds have to sell holdings?\n\nYeah the funds don't have to sell holdings. If the ETFs were being sold back to the fund manager then they would, but ETFs are exchange traded funds, so when they are sold there is always a buyer on the other side who does not have to be the fund manager.", "score": -1, "replies": [{"body": "Technically yes, the ETF fund itself probably doesn't transact on the open market for their fund units so they don't buy/sell the underlying in order to sell/buy the fund units. It doesn't work like a mutual fund where the NAV is always known and you can automatically redeem at the known NAV.\n\nThe funds do partner with market makers who provide liquidity and can exchange fund units for underlying though - and I'm sure there are lots of other ways of doing it too.\n\nAt the end of the day, if the funds holdings weren't tracking the funds outstanding units you'd have a significant arbitrage opportunity, so things must balance.", "score": 1, "replies": []}]}]}, {"body": "Fear is stronger than greed, which is why corrections are faster and deeper than overvaluations. ", "score": 2, "replies": [{"body": "My investment strategy disagrees.", "score": 1, "replies": []}]}, {"body": "It won't be that big a deal for the broader market ETFs. Where the impact will be is in large ETFs that have low liquidity in the underlying or high leverage. For example high yield bond ETFs are problematic in a selloff because there's no liquidity in that market so sudden selling causes unusually large moves in the underlying bonds.\n\nThe biggest area to watch will be leveraged ETFs and especially the short VIX products. Covering those leveraged positions (and VIX is already based on options) will also cause massive problems in that part of the market.", "score": 2, "replies": []}]}, {"body": "3/10", "score": 68, "replies": [{"body": "thats being generous ", "score": 23, "replies": []}]}, {"body": "According to my calculations, we've been in a bubble for the past 5 years.\n\nMy calculations are shit.\n", "score": 15, "replies": []}, {"body": "it should cap at around 9billion so we good for now", "score": 31, "replies": [{"body": "How do you not see a problem with that when the economy is based on exponential population growth? Supplement social security and healthcare costs with the larger number of young people. \n\nHmmm...", "score": 16, "replies": [{"body": "Young people will pay. By the time they are old they will be dead because all they did was work.", "score": 20, "replies": [{"body": "That's capitalism for ya!", "score": -11, "replies": [{"body": "le capitalism is bad meme", "score": 21, "replies": [{"body": "Lol, for the people downvoting me, I was being sarcastic.  Please, downvote yourselves.  The person says \" they're gonna die young because they're always working!!\"  I'm making fun of that.... I work every day all day yet they seemingly think there's something inherently wrong with that.  I'm poking fun at that.  Maybe I'm bad at jokes or ya'll need to chill ur vindictive internet warrior nuts...", "score": -6, "replies": [{"body": "A /s would have helped if that were the case. Also: Poe's Law", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Linear scale faggot.", "score": 65, "replies": [{"body": "[redacted]", "score": 30, "replies": [{"body": "ok we're a bubble", "score": 20, "replies": []}]}]}, {"body": "http://www.sci-corp.com/en-us/index.page \n\nInvested in a similar European company back in '38 ... made a killing.", "score": 12, "replies": [{"body": "I invested in a company who sold [these](http://www.macrotecengineering.com/incinerators/?gclid=EAIaIQobChMI0vnGw4fB1QIVhAJpCh0UDgIxEAAYAyAAEgLKu_D_BwE) to some short dude with a funny mustache, and also made a killing.  Like 6,000,000. ", "score": 10, "replies": [{"body": "Not 6 gorillion?", "score": 1, "replies": []}]}]}, {"body": "Artificial Intelligence will pop that population bubble fast. No longer a need for all those \"useless\" laborers. ", "score": 23, "replies": [{"body": "People still gon' keep fuckin'.", "score": 13, "replies": [{"body": "Until the become educated.  Then they stop, like in Japan and a lot of Europe.\n\nMeanwhile India is pumping out billions of Pajeets.", "score": 14, "replies": []}, {"body": "[deleted]", "score": 10, "replies": [{"body": "Dem nukez", "score": 3, "replies": []}]}, {"body": "Yes, let them fuck.  That's why we are sterilising them all with the HPV vaccine.  And, thanks to Bill Gates, most of the 3rd world as well.  That's how you short humanity in just one generation.", "score": 5, "replies": []}, {"body": "But they won't be having kids. ", "score": 2, "replies": []}]}]}, {"body": "It's never not a bad time to not short. ", "score": 15, "replies": [{"body": "[deleted]", "score": 34, "replies": [{"body": "Not bad doesn't necessarily mean good.", "score": 2, "replies": [{"body": "yeah but if it's not bad, then it's the opposite of bad, which is good, but if 'not bad doesn't necessarily mean good' then good isn't the opposite of bad. Which raises the question, what is bad, and how is the opposite of not bad, not good.", "score": 1, "replies": []}]}]}]}, {"body": "When you posted this did you laugh at yourself?", "score": 132, "replies": [{"body": "wHeN yOu PoStEd ThIs DiD yOu LaUgH At YoUrSeLf?", "score": 570, "replies": [{"body": "[removed]", "score": 40, "replies": [{"body": "If you did, did you take vid? I'd like to watch", "score": 19, "replies": [{"body": "[removed]", "score": 11, "replies": [{"body": "Monetize nudes and buy calls ", "score": 13, "replies": []}]}, {"body": "And I'd like to touch myself while watching", "score": 1, "replies": []}, {"body": "https://youtu.be/vorisrBfdTs", "score": 1, "replies": [{"body": ">[**Chris Korda - I Like to Watch [3:59]**](http://youtu.be/vorisrBfdTs)\n\n>>An uplifting song from the leader of the Church of Euthanasia following the 9/11 attacks. The original video is even less safe for work :D\n\n> [*^QuPongo*](https://www.youtube.com/channel/UCZhg2AV6Pb9y4GIq4EwLpfQ) ^in ^Music\n\n>*^61,869 ^views ^since ^Dec ^2008*\n\n[^bot ^info](/r/youtubefactsbot/wiki/index)", "score": 1, "replies": []}]}]}]}, {"body": "Holy shit ", "score": 4, "replies": [{"body": "Nice username. Quick question: Physical Removal of Central Bankers, all politicians, and the stupidity known as democracy? How far do ya go?", "score": -2, "replies": [{"body": "Anyone who sexually identifies as an international Bolshevik \n\nSo yeah to start with  \n\n", "score": 2, "replies": []}, {"body": "DAE Dork Enlightenment?!?", "score": 2, "replies": [{"body": "Was asking the guy with the name \"Physical_removal\"", "score": 1, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "I should probably get around to changing my name.", "score": -1, "replies": []}]}]}]}]}]}]}]}, {"body": "[deleted]", "score": 46, "replies": [{"body": "damm bruh you scary", "score": 30, "replies": []}, {"body": "The only thing pushing people into war is a lot of people forget or never experienced how sucky it is. ", "score": 35, "replies": [{"body": "[deleted]", "score": 30, "replies": [{"body": "What you are describing is the plot to fight club, next you'll be starting underground fight scenes, then blowing up credit card companies.\n\n\"We’re the middle children of history, man. No purpose or place. We have no Great War. No Great Depression. Our Great War’s a spiritual war… our Great Depression is our lives. We’ve all been raised on television to believe that one day we’d all be millionaires, and movie gods, and rock stars. But we won’t. And we’re slowly learning that fact. And we’re very, very pissed off.\"\n\nJust channel your inner Tyler ", "score": 30, "replies": [{"body": "Well, Chuck did strike a nerve with the book concept.", "score": 4, "replies": []}]}, {"body": ">Advanced society is it's own kind of hell. Fuckin office. Really? \n\nI like the people I work with. An office is only really awful if you don't enjoy socializing, or if your office is unusually weighted towards shitty people (though if that's the case, you should first ask if maybe it's you that's shitty). Frankly if someone is the kind of person that thinks going around killing people is more \"fun\" than socializing with other human beings, well, I think that person is basically fucked in the head. I don't doubt they exist, but those people have a fundamentally problematic world view that really ought not to be celebrated. ", "score": 8, "replies": [{"body": "I'm actually bemoaning the fact that human beings like war.  You do, you just don't know it.  It's been observed many times.  That's not celebrating.\n\nAlso, socializing is not the issue.  The office is personally repressive.\n\n\"you should first ask if maybe it's you that's shitty\"  Did you get that from a mug, or a calendar?  \n\nI would question your sincerity as a human being if you think that the socializing that is acceptable in a modern office, vapid, shallow, generic as it must be, in order to facilitate harmony among the masses, is entertaining.  There are only 2 or 3 acceptable subjects, none of them of interest to me.  Sports.  Home Improvement.  Family.\n\nPolitics, Sex, and Religion, or anything remotely related to them, off the table, unless you work in an office where everyone shares an opinion on those subjects, in which case, you and your entire office are Fascists.  Which would make your office full of shitty people, and I would indeed be the odd man out.  ", "score": 1, "replies": []}]}, {"body": "Dat sound like fascism talk.", "score": 3, "replies": [{"body": "You mean the Boss at the Office?  Yes, that is Fascistic.  Fascism is a marriage between Government and Business where the individual has no real power.  \n\nJust like your modern offices.  You have to follow their social mores (which are artificial and suppressive of each individual), imposed on you by business and government both.\n\nFor example, if you said \"Well, women are weak, usually not good leaders, and don't belong in the military\", you will be fired, and the government may show up to throw you in jail for Hate Speech (actually will in Europe).  \n\nSo yes, that Boss, and the Office, is Fascist.\n\nI'm an American Individualist.  Which is why The Office is a horror show.", "score": 0, "replies": [{"body": "you sound pretty immature. should everyone go around telling each other exactly what they think of them? and organizations will still run successfully? grow up.", "score": 2, "replies": []}]}]}, {"body": "This really hurts me as my job just started rolling out \"cultural imperatives\" that they want us to focus on and somehow apply to our jobs. They literally want us to change the way we think and how we live our lives to try and better the company. What a load of shit.", "score": 1, "replies": [{"body": "You sound fake.", "score": 2, "replies": [{"body": "You got me... I actually don't exist.", "score": 1, "replies": []}]}]}, {"body": "One of the more disturbing things I've read on this sub\n\nDot dot dot... dot dot", "score": 1, "replies": []}, {"body": "Bad troll is bad. ", "score": -3, "replies": []}]}]}, {"body": "For numbers that large, who are the antagonists ?", "score": 6, "replies": [{"body": "I think it's mostly going to be starvation.  I don't think the war itself will do in over 10 million or so.  \n\nTake your pick.  If Russia gets it on with the West, Russians are going to drop like flies from malnutrition.  China, same thing.  They are utterly dependent on Western food.  SE Asia.  Africa.  \n\nGonna be a lot of skeletons, living and dead, IMO.\n\nThe US can feed the PI, SEA, maybe even a lot of Africa.  Gonna need more ships though.  We will, I think we're still The Good Guys.  But we can't do it all and I don't believe Europe actually learned their lesson.  \n\nRussia didn't.  The PRC hasn't learned a gd thing.", "score": 14, "replies": [{"body": "Well coming from Australia I would suggest AUS/NZ will (perhaps blindly) follow the USA.\n\nI was leaning more on the Zionist/kalergi endeavour to create a Islam vs everyone war to facilitate the destruction of the temple mound and rebuilding of the temple of Solomon.\n\nNot even suggesting I believe this shit, but there are people in power of foreign policy who either do believe in end times myth, or are paid by people who do.", "score": 7, "replies": [{"body": "Australia will blindly follow the US, not sure about New Zealand. We told the US to shove Iraq up their ass after all.\n\nMaybe if National win in September, doubtful if a Labour/Green coalition wins.", "score": 2, "replies": []}]}]}]}, {"body": "> I don't know where it's coming from. Maybe some damned thing in the Balkans?\n\nSomeone's been listening to Hardcore History", "score": 5, "replies": [{"body": "Nah, never heard it.  It's the trademark saying about WWI, shows the irony of the breakdown of Bismarckian diplomacy.", "score": 2, "replies": []}]}, {"body": "Tensions are always high. Nothing ever happens.\n\nSome people just secretly want a war so they can feel what it's like.\n\nMaybe it's some hidden psychological agenda to add misery to their life because peace is so dull to them\n\nEdit: and my suggestion to them is to hop on the next ferry to their Middle East ", "score": 3, "replies": []}, {"body": "Long $LMT and $BA", "score": 3, "replies": []}, {"body": "> I've finally concluded we are about to have another world war.\n\nAre you not going to explain why? Go on!", "score": 1, "replies": []}, {"body": "Not necessary. \n\nMaybe world war, or famine, or pandemic outbreak, whatever it is that reduce world population, population would not bounce back this time. Because all the machines that are replacing human in all aspects, human are becoming more and more redundant.\n\nIt will be a much better world with less human and more machines.", "score": 0, "replies": [{"body": "Thats not how human drives work.  ", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "That's ghengis Kahn too. ", "score": 3, "replies": [{"body": "*Khan\n\nBut I believe Khan was 13th century. The decline seen in this graph (if it is accurate) is 14th century. \n", "score": 3, "replies": []}]}]}, {"body": "Don't short. Just start loading up on defensive stocks (health care, Pfizer) etc...\n\nThings that do well in bear markets", "score": 4, "replies": []}, {"body": "Spread rumors all over the internet of Trump calling Kim a fatass. The nukes will be in the air by no time ", "score": 4, "replies": []}, {"body": "honestly dude think about the grocery stores not having food.\none big thing and we are fucked majorly. mad max style chaos.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Hah, stupid! The oceans are full of it.", "score": 17, "replies": [{"body": "investing in desalination tech*", "score": 4, "replies": []}]}]}, {"body": "Time to invest in a war son.", "score": 3, "replies": [{"body": "Long nukes", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "[wow u r like so smart](https://upload.wikimedia.org/wikipedia/commons/f/f2/World_population_growth_%28lin-log_scale%29.png)", "score": 5, "replies": []}]}, {"body": "Guys don't worry we can feed and house everyone if we all just live in shacks and eat beans. What's important isn't making quality of life high, it's making sure we can support as many shitties as possible. ", "score": 5, "replies": []}, {"body": "The worst part is this is mostly Africa contributing. ", "score": 6, "replies": []}, {"body": "https://www.youtube.com/watch?v=4e8Qd81brk0", "score": 2, "replies": [{"body": ">[**Eiffel 65 - Living In A Bubble [5:04]**](http://youtu.be/4e8Qd81brk0)\n\n>>LIVING IN A BUBBLE\n\n> [*^Bliss ^Corporation*](https://www.youtube.com/channel/UCgsj4WI-t6bLuovqX-2k1tA) ^in ^Music\n\n>*^245,814 ^views ^since ^Dec ^2009*\n\n[^bot ^info](/r/youtubefactsbot/wiki/index)", "score": 2, "replies": []}]}, {"body": "short $red", "score": 2, "replies": []}, {"body": "Hitchhikers Guide to the Galaxy. ", "score": 2, "replies": []}, {"body": "Yeah, timing the bust created by low interest rates and the mispricing of risk is a bitch though.", "score": 2, "replies": []}, {"body": "The seriously wealthy make money regardless of bubble. Bubbles or extreme events create steeper gains, right?", "score": 2, "replies": []}, {"body": "To the moon!\n\n^(... is literally where we'll need to go in a few years when we run out of space)", "score": 2, "replies": []}, {"body": "Short yourself for a guaranteed profit", "score": 2, "replies": []}, {"body": "Using technical analysis, the population will hit 100 Billion in 2030", "score": 2, "replies": [{"body": "Well problem with that is as people get better conditions, they start having 2 kid families instead of 5. Only 20% of people now will have more than 2 kid families and the number is going down quickly. It's been estimated that population will peak under 10 billion because of that effect. And that will happen somewhere near 2050. Extreme poverty will be solved before that anyways.", "score": 1, "replies": []}]}, {"body": ">iNb4 school shooting becomes an economic incentive  ", "score": 2, "replies": []}, {"body": "The replies in this thread about an in pending world war are on point.  I am replying here so my post can be memoralized when future generations refer back to this clairvoyant thread.  ", "score": 2, "replies": []}, {"body": "what happened in 1400?", "score": 2, "replies": [{"body": "Great question! Decline from 1300 to 1400 is likely form the bubonic plague.  \n\n1400 roughly marks the start of the renaissance. So that explains the bounce-back. \n\nTake this next bit with a grain of salt (I'm no historian) - but what you're actually seeing in the graph is the printing press (invented 1440). This is the *true* beginning of the information age. That's when we really began to be able to share information universally. ", "score": 3, "replies": [{"body": "thanks! :)", "score": 1, "replies": []}]}]}, {"body": "People keep saying there's plenty of food to feed another 3,5,10 Billion (the number varies). But the system is \"priced for perfection\". What happens if India's monsoons fail 2 seasons in a row? Instant 150+ Million starving people. No one factors in a black swan event. Which is part of the whole definition, I suppose. And so let's say we get another 5 Billion. Then what?\n\nThe biggest known, factual limitation is \"Peak P\". When we hit that limit, it's game over. Some say that's not for hundreds of years but I've seen sober extimates of 20 years.\n\nhttps://en.wikipedia.org/wiki/Peak_phosphorus\n", "score": 2, "replies": [{"body": "**Peak phosphorus**\n\nPeak phosphorus is a concept to describe the point in time when humanity reaches the maximum global production rate of phosphorus as an industrial and commercial raw material. The term is used in an equivalent way to the better-known term peak oil.\n\nPhosphorus is a finite (limited) resource that is widespread in the Earth's crust and in living organisms but is relatively scarce in concentrated forms, which are not evenly distributed across the Earth. The only cost-effective production method to date is the mining of phosphate rock, but only a few countries have significant reserves of it.\n\n***\n\n^[ [^PM](https://www.reddit.com/message/compose?to=kittens_from_space) ^| [^Exclude ^me](https://reddit.com/message/compose?to=WikiTextBot&message=Excludeme&subject=Excludeme) ^| [^Exclude ^from ^subreddit](https://np.reddit.com/r/wallstreetbets/about/banned) ^| [^FAQ ^/ ^Information](https://np.reddit.com/r/WikiTextBot/wiki/index) ^| [^Source](https://github.com/kittenswolf/WikiTextBot)   ^]\n^Downvote ^to ^remove ^| ^v0.24", "score": 1, "replies": []}]}, {"body": "It's time to short the Indians, Africans, and the Chinese.", "score": 6, "replies": []}, {"body": "Got a good chuckle out of me. ", "score": 1, "replies": []}, {"body": "Don't forget to buy the WW3 nuclear dip.\n\nBuy when there are ashes in the streets.", "score": 1, "replies": []}, {"body": "I mean isn't Yellowstone projected to erupt in the next 20 years?", "score": 1, "replies": []}, {"body": "nope, we stand on the cusp of greatness", "score": 1, "replies": []}, {"body": "One day a year you can kill anyone, or be killed! ", "score": 1, "replies": []}, {"body": "Now all we need to do is push politicians all around the world to lobby for ww3.\n\nr/wallstreetbets all has bunkers so it's all G.", "score": 1, "replies": []}, {"body": "Time is always too short", "score": 1, "replies": []}, {"body": "time to start putting up more walls. We demand orda! In sections. I nominate myself to be section 8.\n\n\nKeep section 1 down below.\nYou know.. like in the Justin Timberlake Movie, Not like Game of Thrones.. no need for slaughter. ", "score": 1, "replies": []}, {"body": "We need to nuke China", "score": 1, "replies": []}, {"body": "Use log scale", "score": 1, "replies": []}, {"body": "Compound that with like 3 billion people going from that quaint range of marginal subsistence to quickly starving up to a developing economy.. all of them making shit and spending shit", "score": 1, "replies": []}, {"body": "Not bad doesn't mean the *opposite* of bad. If I say something isn't hot that doesn't mean it's cold. There are more than two options. If something's not bad it could be neutral which isn't good.", "score": 1, "replies": []}]}
