{"title": "Someone explain the TSLA love", "selftext": "Periodically looking through this sub I have noticed one thing, almost everyone's optimistic viewpoint of Tesla. OK i get it, they could be at the size of GM, Ford, Toyota etc. They could become the premier electric car company in 50 years. They could revolutionize a couple more things down the road. However, what is the time frame for these possibilities to become realities? It won't be next year. It wont be in five years. Maybe 15? Maybe 25?\n\nFor comparison TSLA market cap is only half of Fords. TSLA revenue is $2,013,000,000. Fords revenue is $146,917,000,000.  [70X] \n\nMy reason for posting this is this; someone explain to me why this is the most discussed stock on this sub and why do people think the stock can only go up? From my perspective, the stock is valued extremely high in relation to where the company is today. For the people that aren't planning on holding this stock for the next 20 years (which I am not saying either way is a great idea) , the \"greater fool theory\" seems to be extremely applicable. All up for debate tho! Not trying to bash TSLA but i just wanted to start a discussion on how this stock is viewed as a 5 star investment when the underlying company itself relies heavily on debt financing and doesn't make a profit.", "id": "2dlnub", "created_utc": 1408071208.0, "score": 16, "upvote_ratio": 0.72, "num_comments": 74, "comments": [{"body": "For me and just about everyone else, it's all based on Elon. He's an innovator doing things no one else is. I own both Tesla and Solarcity stock and they've been consistent gainers for me, up 19% and 26% respectively. Short simple answer but it's what I look at.", "score": 15, "replies": [{"body": "Okay... so, what price would you *not pay* for either of those 2 stocks?\n", "score": 7, "replies": [{"body": "And this I think is where I think both of those have already gotten away from themselves.  Could they be worth it longer term?  I personally don't know.  Some people are willing to try for the speculation, but I think people believe the change is going to happen faster than it will.  I suspect there are more than a few people who are invested in the company because they like the car, and as you have pointed out, after they bought the car/saw the car, they would have invested the same # of $ if it were double the market cap... but again just conjecture on my part.  These defy math stocks are tough ones to be sure.  Potential upside if everything works out is insane.  I am still kicking myself for not getting into Netflix at 90 after the run up from 60, but I figured I missed a good chunk of the run up... that said, I wouldn't have held on until now anyway, as it would be hard for me not to take a double in a year lol.", "score": 3, "replies": [{"body": "All the talk about the valuation being sky high right now is completely wrong, Tesla has guided for a production rate of 100k/y at the end of next year, that is more than $10B of sales with a gross margin of around 30% and a very likely continued high growth, the stock would be a bargain at that point at this price. Tesla haven't even begun to tap into the very large energy storage opportunity that will arise over the next decade given the shift to sustainable energy.\n\n>These defy math stocks are tough ones to be sure\n\nInvesting isn't as simple as looking at the current P/E.", "score": 2, "replies": [{"body": "TSLA sold 22,477 cars in 2013 at $70k a pop, how in the world are they going to sell 100k cars at $100k each by end of next year?\n\nI also doubt they will be able to maintain a 30% gross margin as they expand.", "score": 1, "replies": [{"body": "You are confusing the MRSP with the ASP, the ASP is above $100k for the Model S and the X will be 10% more expensive. Tesla has guided for a production rate of 100k/y by the end of next year. So you believe producing 100k of a specific vehicle is more expensive per vehicle than producing 50k? Well ok, but it's wrong. If you are talking about gross margins for their Model 3 then that is 3 years out, and a whole other story, they also don't need 30% gross margins on this vehicle to grow into their market cap and much further, even though I think they will get close given the quality of their product and their moat.", "score": 1, "replies": []}]}, {"body": "Agreed.  Tesla isn't the same situation, but I know blackberry would have been a steal given the ever expanding high end cell phone market in 2006, but new unimagined competitors came on the scene to blow them out of the water.  If Tesla really is the apple of the car industry, I don't know.  But you have to assign some probability on your expected outcomes if you assign a 100% chance of Tesla hitting all targets then you are probably underweighting the risk involved imho.  That said, I never got into FB when it was in the teens but am looking at it in the 70's oddly enough.  Some people were willing to risk they would figure out mobile, others were not.  The ones taking the risk got a huge payday.  But it certainly wasn't a sure thing.", "score": 1, "replies": []}]}]}]}, {"body": "That's a scary thought no offense... If he gets hit by a bus what happens to your investment? ", "score": 3, "replies": [{"body": "At this point,  the tracks are laid.  AAPL is still around post Steve.", "score": 2, "replies": [{"body": "AAPL has one of the strongest financials of any company, has multiple high-margin products and has a very steady cash flow and pretty much unlimited money for future innovation. All this was there by the time Steve died.\n\nDon't compare TSLA to AAPL.", "score": 1, "replies": []}]}]}, {"body": "> He's an innovator doing things no one else is. \n\nSo based off of that, what could he create in the next 5 years that will justify your valuation? The amount of innovation he would have to do to justify investing in Tesla *today* is absurd for anybody.\n\nI agree with all of the positive sentiments about Tesla and Elon Musk, but the valuations are still totally insane even in the best case scenarios.", "score": 2, "replies": []}]}, {"body": "Elon Musk gives me irrationally high amounts of confidence. Look at what he's doing with SpaceX. Look what he's already done with Tesla. The man is awe inspiring, he will be in the history books without question. \n\nThe value built into TSLA is based on the near future promises and prospects of the company (looking a couple years ahead). But what I think we investors see is \"the next big thing\". If TSLA isn't making a large portion of cars on the road ten years from now, they will at least be working with other manufacturers in some capacity. And if TSLA and GOOG make some sort of deal on self driving cars, I can't imagine what the stock price will do on that day.\n\nI'm holding TSLA for a long time, YEARS. I dont' care if it goes up and down a bit along the way, I'm very confident that with Elon Musk at the helm, this company will soar.", "score": 5, "replies": [{"body": "How much of a premium do you think the stock has because of Elon? So say he were to be hit by a bus, what's the stock worth then? Can this company run without him? ", "score": 3, "replies": [{"body": "I wouldn't want it without him in charge.", "score": 3, "replies": []}, {"body": "Look up the valuation of Tesla by Aswath Damodaran on his blog. I think he pegged the value of Tesla, based on fundamentals, right around $67/share. ", "score": 2, "replies": []}]}]}, {"body": "Cult of Personality", "score": 11, "replies": [{"body": "Dammit, beat me to it!\n\nLook at the top upvoted comments in this thread--cult of personality just about covers it.", "score": 3, "replies": []}]}, {"body": "Revenue is one metric. Earnings is more important. Growth is another. \n\nWhy do you say TSLA is expensive? P/E? PEG? Free cash flow?  \n\nAlso, markets are forward looking. So you say it is expensive compared to where the company is today.  Imagine the company wasn't pumping money into growing sales by 15% QoQ. What would their earnings be?  How does that compare to their evaluation?\n\nFor has 150B in sales but only 5B in operating profit because they have tiny margin and spend boatloads on marketing to convince people to buy their stuff. Tesla spends zero dollars advertising and still has a 28% GM which is going to go higher with scale. So they could achieve the same 5B in profit with only 20-25B in sales probably. \n\nWhen it comes to consumer products, margin is everything and Tesla is killing it. \n\nIf you guess out their volume expansion on G3 and margin expansion on S/X it's easy to see them doubling share price again. \n\n", "score": 4, "replies": [{"body": "> Why do you say TSLA is expensive? P/E? PEG? Free cash flow? \n\nCan you think of any metric by which TSLA is not overpriced?", "score": 4, "replies": [{"body": "Pretty much every metric you can find come 2017.  Which is why we call it speculation.\n\n", "score": 2, "replies": [{"body": "> Pretty much every metric you can find come 2017.\n\nThat's such a non-answer. Justify any metric in 2017 giving them their current valuation, any one at all. The only way they could physically grow fast enough to get that valuation would be if they merged with another auto manufacturer, but if they did that they would dilute the stock.", "score": 5, "replies": [{"body": "Even Facebook could justify their valuation basing off of its current growth trends... TSLA is just out of this world.", "score": 4, "replies": []}, {"body": "^ I think you hit the nail on the head.  It isn't that Tsla is a bad company or that it doesn't deserve a higher than \"rational\" valuation due to the expected growth and % chance it will happen, it is at what level do you say, ok this is just silly... I mean at 1000 per share, all else being equal, I wonder if it were somehow there for a few weeks if we would see some buyers... I suspect we would, just desperate to not miss out on the run up to 2,000 or 3,000... for me, I'll take the low hanging fruit for now, I don't need to turn into a giraffe to get the high leaves, esp. with the overall market at these levels.", "score": 2, "replies": []}]}]}]}]}, {"body": "Im feeling like. People overvalue tsla vs solar city though. The real value is in solar generation and storage, not the cars", "score": 5, "replies": [{"body": "Actually, the value in solar isn't making picks and shovels, [it's in managing the picks and shovels while they dig holes all by themselves.](http://www.eenews.net/stories/1059981337)\n\nLet's help big solar keep those feed-in tariffs as high as possible...  ", "score": 3, "replies": []}, {"body": "Or solar ON cars", "score": 1, "replies": []}, {"body": ">Selling Batteries will make us rich!\n\nSaid no one ever. Batteries are not luxury goods and it has little brand recognition. Any margin they may enjoy will quickly diminished on face of competitions.", "score": 0, "replies": [{"body": "Competition will not easily catch up to the gigafactory economies of scalr.", "score": 1, "replies": [{"body": "Except competitions already exists. There is one in just about every major nations, and some are being sponsored by their respective states.\n\nAnd there are dozens of sizable automobile manufacturer that aren't just doing nothing. I expect partnerships and releases of similar electric cars within next few years", "score": 0, "replies": []}]}]}]}, {"body": "\nI summarize it as so: Google is to IBM what Tesla may become to Ford\n", "score": 4, "replies": []}, {"body": "The current value is justified only looking 2 years into the future: selling 100,000 cars in 2016 = ~10 billion revenue, with a ~ 15% profit margin = ~ 1.5 profit. With a 20 multiple you get the current 30 billion value.", "score": 4, "replies": [{"body": "Does it scare you that the model x was delayed from 2013 until now 2015? To sell 100k cars they are going to have to have the model x and a cheaper model come out... To do so all by 2016 sounds a bit ambitious. ", "score": 5, "replies": [{"body": "Only the s and x. Just to clarify, 100k is their official guidance for 2016.", "score": 1, "replies": [{"body": "that's a little ambitious imo... ", "score": 1, "replies": []}]}]}, {"body": "Okay, so let's break this down:\n\nTSLA doesn't have the production capacity to build 100,000 cars yet, but will magically acquire this at no cost.\n\nThen they will sell 100,000 cars in one year, and will have increased the price to 100,000 (a pretty huge boost). This is of course despite the fact that they're expecting their cheaper car to be a bigger seller in the future.\n\nTheir net profit margin after *all expenses* (including massive growth) is going to be 15%, which is pretty much unheard of in the automotive industry.\n\nFor the next 2 years, the valuation of TSLA isn't going to change at all... <--- this would mean two years of unheard of growth (not even the kind predicted by the most optimistic of TSLA analysts) has already been priced into the stock. I'm pretty sure that's the definition of overvalued.", "score": 1, "replies": []}]}, {"body": "The stock went up nearly 200% since it first arrived on my radar and is still trending upward. The car is the safest production auto ever produced. The car is badass and sleek and sexy and amazing to drive. The next car looks even better. They are challenging the b.s. model of how cars are sold. There is massive technical innovation. The product is selling well. Elon Musk has big, subversive, progressive plans. What's not to love?", "score": 1, "replies": []}, {"body": "It's about progression of our entire civic society in general. Elon has created the means for generating a new, electrical, automotive industry. It's pretty obvious now that climate change is real, and is a huge problem that we have to over come as a species. Tesla has built the foundation to begin a new technological revolution in the way we use power and electricity, albeit just transportation, but the applications of his battery technology are endless, and the start of our society in becoming energy independent from fossil fuels. Yes the power has to come from somewhere and that somewhere is still going to be mostly from coal, but there is real, measurable benefit to be seen from cutting gas as a means of transportation. It is the first company of its kind in the grand scheme of things. This may seem grandiose, but the benefit to mankind is real. That to me is worth the investment. It gives me hope.", "score": 1, "replies": []}, {"body": "I think it is impractical to think the future of cars will only be electric litium ion batteries. One thing I have always took with renewable energy of the future is that not one will be dominant like how oil and coal is today. It will be a combination of multiple renewable sources to power the world of the future. I hold that belief when it comes to automobiles that there will be multiple types of vehicles. I think that tesla will be a major player but to think automakers that are establish won't keep up is foolish. Overall I think that tesla is overvalued and will suffer a major correction in the next two years. I would love to hear back on any criticism because this company is very interesting for me to watch as I do wonder when if I should buy in. ", "score": 1, "replies": []}, {"body": "10 words or less:\n\nDAE Elon Musk = Iron Man?\n\n------------\n\nIn 5-10  years when(not if, but when it actually will be by then) Tesla is a major player, and *if* everything goes *well* above expectations, it's valuation *might* be fair... if it doesn't trade above today's trading levels. It makes no sense from a fundamental standpoint to buy it now\n\nBut basically, if you trade on technicals alone in the short term (ballsy move):\n\n~~CLEGANE~~**TESLABOWL, GET HYPE!**", "score": 1, "replies": []}, {"body": "Basically because Elon Musk is the human of the century :D. ", "score": 0, "replies": []}, {"body": "This submission has been randomly featured in /r/serendipity, a bot-driven subreddit discovery engine. More here: http://www.reddit.com/r/Serendipity/comments/2dmkzv/someone_explain_the_tsla_love_xpost_from_rstocks/", "score": 0, "replies": []}, {"body": "Because Tesla's are the shit. Next question please", "score": 0, "replies": []}, {"body": "Just like anything else on Reddit, just circlejerk until the next circlejerk comes along. \n\nthis sub may as well be renamed r/tsla or r/aapl\n\n(r/alibaba may be in the running soon)", "score": -2, "replies": []}, {"body": "Because the model X will sell ten times what the model S sold.", "score": -1, "replies": [{"body": "I don't think so. It's going to be more expensive. The model E, which is supposedly coming after, is going to be around $30k. That's the one that is going to really explode in sales. ", "score": 4, "replies": [{"body": "yeah notice I said the model x will sell ten times.\n\nThe model 3 will sell 1,000 times the amount.\n\nI mean the first full production runs they are currently planning with the gigafactories are 100K cars per year.", "score": -1, "replies": [{"body": "The gigafactory isn't a car factory.", "score": 2, "replies": [{"body": "oh they got plans for another one for those after they exhaust the space they have in their current one. The still have space for more production lines. ", "score": -1, "replies": [{"body": "That doesn't make it a car factory. It's a battery factory.", "score": 2, "replies": [{"body": "THEY HAVE ROOM FOR MORE CAR FACTORY AT THEIR CURRENT FACTORY AND I HAD THEY HAD PLANS TO BUILD YET ANOTHER FACTORY.\n\nI didn't say anything about the battery factories.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "If he can keep it as close to $30k as possible and increase range while decreasing recharge time, ICE only auto companies are fucked.... ", "score": 2, "replies": []}, {"body": "Even if sales really are going to increase tenfold - that's still less than 1 million cars sold. Wouldn't justify the current valuation, if you ask me.", "score": 2, "replies": [{"body": "oh yeah and they also will be the largest li-on producer in the world by a huge margin, so there is that.\n", "score": 1, "replies": []}]}, {"body": "Can someone explain to me why the model x isn't out yet... It was originally suppose to come out in 2013 now 2015... ", "score": 1, "replies": [{"body": "Short answer is they want it to be perfect. A whole new class of vehicle.\n\n\nLonger answer, both Elon and the car's designer are perfectionists from what I hear and there is also the possibility that the X was extended due to design modifications to be put into place for a possible future self driving retrofit. But that is just speculation.\n\nTruth is though they want it to sweep every car award out there. They really do.  So we wait.\n", "score": 1, "replies": []}]}]}, {"body": "Think about this,  if tesla in three years sells as many cars as ford.  Iit's easy to argue that it's valuation will be a lot higher than for a couple of reasons.\n\nFor arguments sake let's say the price of production and sale price are the same for both vehicles.  Tesla doesn't loose margins on dealerships.\n\nSecond this would mean tremendous growth for a number of years.  When valuing a company the one with the larger production and sales growth is obviously worth a lot more than the Business as usual company.\n\nFord has a tremendous obligation paying pensions to a large number of employees which have retired and no longer have anything to do with production.  This is a a huge financial burden.  Since tesla is so young they won't have pensions obligations for decades.  I could be wrong but I do not thing their workers are unionized .\n\nLastly tesla is about innovation. They won't stop at cars,  they could easily be thought of a tech and battery company.  During the day your solar panels run your house and charge you tesla battery. At night when the panels aren't producing juice and you know you're not going anywhere tomorrow why not have the electricity in your car battery power your appliances making you grid independent?\n\nApplications such as these are a by product of new tech. What if new battery tech allows you to drive 800 miles on a single charge.  ICE would no longer even be a competition to tesla.", "score": -2, "replies": [{"body": "> if tesla in three years sells as many cars as ford\n\nThere is no way for Tesla to get the kind of capital required to increase their production to that of Ford within 3 years. Maybe 10-15 years. 3 years is absurd.", "score": 2, "replies": [{"body": "You're missing the point of what I said.  Tesla in no longer just about cars.  The applications of movable batteries you can charge and use anywhere is literally incomprehensible right now.  But in the 30 years this company might not only make ice obsolete but also out power distribution system.\n\nBlackberry was top shit for how long?  Within a couple of short years of the iPhone coming out they're in the gutter.  True innovation doesn't wait for everyone to get on board. They just plow right through those that don't.", "score": 0, "replies": [{"body": "That's erroneous. The point isn't whether TSLA will be a successful company or not. It's whether it is a good investment or not.\n\nA simpler example would be a sandwich. What you are doing is saying, \"it's delicious, it's going to nourish your body, it's got fiber, and protein, and carbs, and fats, it's a complete meal, it will help you build muscle and prevent disease.\" What I'm saying is, \"Yea, but it's a $100 sandwich.\"", "score": 3, "replies": [{"body": "That's a terrible example actually.  A sandwich gets eaten and that's it done.\n\nHow much would you pay for Alaska without knowing anything about it.  What if you find out there is oil fields there would that change your valuation?  What if you soon hear diamonds and gold are plentiful with possible access to ocean bridge connecting to Asia?\nSee what I'm getting at,  you are using today's metrics without discounting future potential.  We can disagree here and I beleive it makes for a healthy discussion.  I think I would love for someone to sway my opinion away from tesla and save me from the financial consequences of owning the stock.", "score": 0, "replies": [{"body": "Ok. I have an Alaska sized piece of land with all of the things you have described. I am charging $100,000,000,000,000. Would you buy it?\n\nThe object is erroneous. The value vs. the price is what is important. You continuously avoid what I am saying by saying, \"But it's a great [insert object].\" Nobody disagrees with that. People disagree with it's valuation. You refuse to address that.", "score": 2, "replies": [{"body": "Ok; so let me ask you what you think the fair value of tesla is?", "score": 1, "replies": [{"body": "Somewhere between $120 and 160 today. That's my forecast of hitting EPS of 10-15 in the next 1-3 years and a continued growth rate afterward of around 75% with no dividend for the foreseeable future.", "score": 2, "replies": [{"body": "Lol, you think Tesla will have a P/E of less than 15 in the coming years with a 75% growth rate? And you are lecturing others on valuation, I dont even know what to say.", "score": 0, "replies": [{"body": "P/E is not EPS.", "score": 1, "replies": [{"body": "I know. But you gave Tesla a fair valuation of 120-160 today, lets say $140 then, give that a standard 7% a year increase over the next 3 years and we are at $171 which will equate to a P/E of 11-17 or on average less than 15 as I wrote (on an EPS of 10, 2/3 of that with an EPS of 15 obv.).", "score": 0, "replies": [{"body": "I gave them a fair valuation of 120-160 based off an expectation that in the next 2-3 years they will have profits in the range of 1.8B based off their expectation of selling 100k cars annually with an average car price of around 75k and profit margins of around 25% and an expected growth rate of 50-100%. It has nothing to do with P/E ratio or any sort of expected stock growth. That is my valuation for their intrinsic value of the company.", "score": 1, "replies": [{"body": "First of all their ASP is north of $100k right now with the Model X expected to be at least 10% more expensive than the S so your 75k ASP number is far off.\n\n>It has nothing to do with P/E ratio or any sort of expected stock growth.\n\nYour numbers implied a P/E of less than 15, and ofcourse P/E is a key metric in deciding a company's valuation. Along with the future expected growth ofcourse, if you completely ignore P/E and growth your valuation is completely useless", "score": 0, "replies": [{"body": "> First of all their ASP is north of $100k right now with the Model X expected to be at least 10% more expensive than the S so your 75k ASP number is far off.\n\nThe MSRP of their best selling model is $70,000, and their model E is where I expect most sales to be coming from. You can lecture me about my valuation all you want, but it's plenty thorough and I'm not backing down from it.\n\n> Your numbers implied a P/E of less than 15, and ofcourse P/E is a key metric in deciding a company's valuation. Along with the future expected growth ofcourse, if you completely ignore P/E and growth your valuation is completely useless\n\nP/E isn't part of my valuation. I use graham's formula slightly modified. It's entirely dependent on EPS, growth rate, and dividend rate. P/E ratio is both too simplistic and too redundant with EPS to matter in my valuation.", "score": 1, "replies": [{"body": "Lol, what do you think is the most relevant number, the actual average sales price of around $105k or the MSRP of $70k?\n\n>and their model E is where I expect most sales to be coming from\n\nYou talked about 1-3 years out, now Tesla guides for a production rate of 100k/y at the end of next year, this is more than a year ahead of their Model 3 launch so those are clearly Model S/X sales which have an ASP north of $100k. If you think Tesla will sell 100k cars a year after Model 3 launch then you are the biggest sceptic I have encountered, and is either implying that Elon is lying when he talks about the insatiable demand or expecting some serious macro economic problems.\n\n>P/E isn't part of my valuation. I use graham's formula slightly modified. It's entirely dependent on EPS, growth rate, and dividend rate. P/E ratio is both too simplistic and too redundant with EPS to matter in my valuation.\n\nWhat. P/E is simplistic and redundant, but EPS isn't, EPS is obviously only relevant relative to the stock price. Talking about a company having an EPS of 10 gives you no idea of how the company is priced, the number only means something when you compare it to the SP which gives you the P/E ratio.\n\nIn your last post you wrote that your valuation has nothing to do with growth, now you say its a core part of your valuation. So you do think a fair valuation for Tesla is a P/E of less than 15 with a growth rate of 75%? Please point me to current market opportunities even close to this.", "score": 0, "replies": [{"body": "Essentially what this all boils down to is that you're butthurt that an educated opinion differs from yours.", "score": 1, "replies": [{"body": "How is your opinion educated when you don't even know how simple valuation metrics like P/E works? I advice you to learn the basics before engaging in valuation discussions.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "I'm only asking because I wanna know if you think it's overpriced by a factor of 2 or 10 or 100", "score": 1, "replies": [{"body": "Closer to 2. I'm very optimistic about Tesla's ability to revolutionize stuff. I think their major potential is actually in their distributed charging network, and licensing their charging systems as standards (though I'm not sure how that's affected by releasing their patents). There is no doubt in my mind that Tesla will be a successful US auto manufacturer also. Pretty confident they'll be a significant part of the market relatively soon (2-5 years), though I don't think they'll ever sell as many cars as GM or Ford.\n\nJust can't justify current valuation for investing today despite moral support.", "score": 3, "replies": []}]}]}]}]}]}]}]}]}
