{"title": "Economist who forecast 2020 rally says S&P will ‘melt up’ at least 36% by Oct before global ‘bust’. Thoughts?", "selftext": "David Hunter, Chief Macro Strategist at Contrarian Macro Advisors: \"I think the 'melt up' kicks in after we go to new highs. My guess is that we run up here to maybe 4650 and back off and then make another run.\n\nIn my 50 years I don't think I've seen very many times where we had such a consensus of investors on one side, meaning in this case the bearish side. It's pretty easy to see that at some point we are going to get a very big move into the other direction and I think that we're just beginning that now. \n\nYou're seeing more and more firms and sell side strategists raising their equity allocations and I think what's ahead in the summer months and maybe into the early fall is a movement from defensive to more offensive investing.\n\nHowever, when the melt up is almost finished, the FED may mistakenly tighten because they see an elevated stock market. I would call that a big error because I think it will be on the eve of a bust. \n\nI do think that there's the potential for something quite a bit bigger than the 2008 financial crisis. We had a 90 percent bear market in 1929, I believe the Nasdaq fell close to that in the early 2000s, and I think that this time it's going to be somewhere in that 60,70,80 percent range too.\"", "id": "15moysu", "created_utc": 1691609402.0, "score": 56, "upvote_ratio": 0.71, "num_comments": 88, "comments": [{"body": "Anybody who tells you where the market is going to go doesn't know.\n\nif he really knew he wouldnt tell you.", "score": 229, "replies": [{"body": "At some point the market is going to go up and also down unless it goes sideways. Prove me wrong.", "score": 48, "replies": [{"body": "Your ideas are intriguing to me and I wish to subscribe to your newsletter", "score": 18, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "With this chap and Cramers investing club there’s no way I can lose. You gotta burn money to make money 🔥💵 😎", "score": 2, "replies": []}, {"body": "You gotta catch it on special: $97/mo. For a limited time only!", "score": 2, "replies": []}]}]}, {"body": "Over time the price is usually different.", "score": 1, "replies": []}]}, {"body": "or he's telling you the opposite of what he thinks in hoping of being able to buy in at a better deal.", "score": 6, "replies": []}, {"body": "Every year, we do year-end predictions and it's just purely a huge distribution of random numbers with almost everyone being wrong.", "score": 2, "replies": []}, {"body": "My best trades I was in fear for my life and told nobody to buy what i just bought. I look to the past and wonder why didn't I tell them? Because even I wasn't sure, only sure I could be crazy\n\nBought Meta at 100$ AMZN at 95$ and BTC high leverage at 19k", "score": 5, "replies": [{"body": "now talk about your losers.", "score": 37, "replies": [{"body": "Funny enough I did talked to others to invest as well because I was so sure, dogecoin at 0.50 before the crash, NIO at 36 2021, Bough Disney before Covid crash and sold it after the crash ended, bought weed stocks because of the soon to happen regulation in the US.", "score": 2, "replies": []}]}, {"body": "I bought Amazon on Oct 28 for $99. But mostly it was to dca the shares I bought for $119 just four days prior!! It felt like a stupid roller coaster.", "score": 2, "replies": []}]}, {"body": "As long as you keep the prediction a few months in the future, people will forget that you're wrong 90% of the time.\n\nI remember seeing lots of comments earlier this year in the stock/investment subs about how the 2022 lows were just the beginning, SPY would be under 300 by now, the \"real crash\" was coming right after the next bull trap, inflation was only going higher... \n\nThe big players called the bottom when the economic fundamentals showed optimism in later 2022: multiple of months of falling inflation, falling fuel prices, persistent employment growth, improving supply chains, and a shallower-than-expected housing dip. I only wish I'd had more money to buy at that time.\n\nThere's no reason retail investors should get hung up on being a bull or bear all the time. Follow the numbers, it's all public information.", "score": 2, "replies": [{"body": "Lol no one here reads policy. Our markets directly reflect policy. Anyone who hasn’t read the debt plan should and it will explain why Reddit is a place of regards. Market will crash. 401k will be spent. It’s over. M2 money supply will show negative once or if inflation is truly calculated appropriately. It’s just mind games. Jpow can’t print ur way out of this one buddy?!?…I was in here in the 2020 September and all these regards In here said inflation was transitory….there literally wasn’t a single indicator saying that. I’m probably wrong. And a ghey bear. recession canceled. bullmarket and Bitcoin to 100k 2024", "score": 3, "replies": [{"body": "People have been saying this for like 35 years.", "score": 1, "replies": []}]}]}, {"body": "That’s not true. He would want many to mirror his strategy. That’s volume. \n\nWe are not investing against each other. We are investing against Wall Street investment firms.", "score": 1, "replies": [{"body": "Those firms are not a united front, same with retail investors. I really dislike those smoothbrained ape conspiracies and narratives.", "score": 2, "replies": []}, {"body": "You cant beat Walmart. What makes you think you can beat them?", "score": 1, "replies": []}]}, {"body": "Can confirm.\nsource: i know but i wont tell you", "score": 1, "replies": []}, {"body": "Not true. If they have positions in you want to influence direction", "score": 1, "replies": []}]}, {"body": "This fucking dickhead has been saying the same thing for the last two years, warning it’s only a quarter or two away. And I assume he’ll continue to say it until something occurs that vaguely resembles his call.", "score": 29, "replies": [{"body": "Indeed.  DH is a grifter that won’t show his investments/results history.  He sells hope to folks that want to believe.", "score": 9, "replies": []}]}, {"body": "\"the stock market will...\"\n\"I think that ....\"\n\"This time it's going to ...\"\n\nYep, doesn't know shit, as everyone else.", "score": 31, "replies": []}, {"body": "Based on the 2020 prediction and firm name, he's a libertarian blow hard.  \n\nBecause interest rates go up does not mean the stock market goes down.  And the stock market did not go up solely because of interest rates, but global flight to perceived safety, especially for the big tech firms.  \n\nA 36% decline is just preposterous on the face of it.  That is about the same as the Crash of 1929.  Totally insane.", "score": 13, "replies": [{"body": "while true, it is affected by investor sentiment. if investors believe it is connected it will become connected.", "score": 7, "replies": []}, {"body": "36% decline was like 2000-2003 bear market, and tech declined much more.  hardly preposterous.\n\nAnd there was no tremendously bad economic problem then, just a few years of too much money and too much tech optimism.  In 2000 short rates were up to 6% and there was an inverted yield curve.  There was a rally in the end of 2000 despite those rates.\n\nmacro was way better then, much lower national debt and deficit, democracy was assumed and normal and no foreign threats.", "score": 4, "replies": [{"body": ">36% decline was like 2000-2003 bear market, and tech declined much more. hardly preposterous.\n\nWhat?", "score": 1, "replies": []}]}]}, {"body": "You know when I hit a really good trade where I make a ton of money, I start to think I got the whole market figured it out, and then start predicting a bunch of things, that end up not materializing.\n\nKeep it simple and keep it humble the market swallows u whole and spits you right out", "score": 5, "replies": []}, {"body": "They have been forecasting recession for the past year or two , how did that turn out for them ?", "score": 20, "replies": [{"body": "if you keep saying the recession is next year eventually youll be right. so it makes sense to just always predict a recession next year so that you'll look like a genius when it finally happens.", "score": 3, "replies": []}, {"body": "There was a recession but the powers that be decided to change the definition. \n\nhttps://www.wsj.com/articles/redefining-the-r-word-recession-biden-economy-advisers-gdp-nber-semantics-poltics-gramm-rudman-hollings-11658951723", "score": 0, "replies": [{"body": "Administrations don't define recessions, the NBER does. A private organization.\n\nFrom their site:\n\n>First, we do not identify economic activity solely with real GDP, but consider a range of indicators. Second, we consider the depth of the decline in economic activity. The NBER definition includes the phrase, “a significant decline in economic activity.\" Thus real GDP could decline by relatively small amounts in two consecutive quarters without warranting the determination that a peak had occurred.", "score": 11, "replies": [{"body": "THey'll just say that Biden pressured NBER or some crap into changing the definition. Ah yes, the **DEEP STATE,** the **SHADOW GOVERNMENT,** or whatever figment of their imagination creates next.", "score": 2, "replies": []}]}]}]}, {"body": "36% from here? That's ridiculous lol\n\n\nI'm bullish for eoy but the near term is solidly likely to be ugly", "score": 4, "replies": []}, {"body": "SPX will drop below 4155 before Xmas", "score": 11, "replies": [{"body": "which year?", "score": 6, "replies": [{"body": "Some year in the 1900s", "score": 6, "replies": []}, {"body": "Last year", "score": 3, "replies": []}, {"body": "😂", "score": 1, "replies": []}]}, {"body": "in the year threefiddy", "score": 1, "replies": []}]}, {"body": "Time to buy", "score": 5, "replies": []}, {"body": "“So let me get this straight”. You know we are in for a bust bigger than 2008 and similar to the 1930s but first you should all buy the shares I’m selling you at the top of this rally.", "score": 3, "replies": []}, {"body": "The Fed doesn't manage according to the stock market.  \n\nInflation and unemployment are what they care about.", "score": 7, "replies": [{"body": "They certainly do. Low inflation and max employment is the official dual mandate, agreed. In reality, the market steers the ship a great deal of time.", "score": 2, "replies": [{"body": "I don’t think so.  What evidence can you provide that this is the case?\n\nI think investors WANT them to look at the markets.  But I don’t think they do.  Deliberately.", "score": 0, "replies": [{"body": "No evidence. It’s common knowledge. The fed is always tampering market expectations and even reacting to prices. A lot of people believe the fed directly impacts commodity and major index prices to their favor. This fed has done far better than others in recent memory of focusing on the real economy. Or at least keeping that narrative intact. Regardless though, I believe they track prices closely. It’s part of the scorecard. Again though, this fed and JP in particular has nailed it so far. I do believe this group has been almost strictly data dependent and focused on the real economy.", "score": 5, "replies": [{"body": "What’s your opinion on the fed waiting too long to tighten? Ie they kept low rates even after they knew free covid money would cause inflation? And therefore they may make the same mistake twice the opposite way and wait too long to loosen?", "score": 1, "replies": [{"body": "I think it’s a possibility it happens. It could be late next year or even 25’ before that’s a conversation though. Even with the fastest rate hike pace ever (I believe more are coming also), there’s still a lot of excess to remove from the economy.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Literally just had a melt up over last 6 months", "score": 4, "replies": [{"body": "Yeah this really read like it was written in January", "score": 1, "replies": []}]}, {"body": "We've had our one melt up", "score": 3, "replies": []}, {"body": "Looks like the bust is happening early because inflation is not under control.", "score": 2, "replies": [{"body": "ANd if it went down quickly people would be pulling their hair out believing that the FED went overboard and broke something.", "score": 2, "replies": [{"body": "The Fed is going to have to cut until companies decide projects are too expensive to fund.  Which is a recession.   There has to be creative destruction of the weakest/dumbest/poorest companies to make capacity for new innovations.   Otherwise, we have the growth profile of Europe.", "score": 2, "replies": []}]}, {"body": "At least wait for the report", "score": 1, "replies": []}]}, {"body": "Interesting thread to read in 2024", "score": 1, "replies": []}, {"body": "He’s right so far!", "score": 1, "replies": []}, {"body": "Economists have also been calling for a recession the last 2 years.\n\nIf they scream recession and market collapse long enough, eventually they'll be correct.", "score": 1, "replies": [{"body": "Trying to get everyone ready for the elections next year.", "score": 3, "replies": []}]}, {"body": "Calls till October. Puts October -> ?", "score": 1, "replies": []}, {"body": "That CPI print tomorrow is going to have something to say about that. Oil has been heading higher and higher. Consumer CC debt just hit a record this week and student loans are restarting in October. I have my doubts. I still think SPY will hold up ok but no 20 percent gains by December.", "score": 1, "replies": []}, {"body": "This is simple an attempt to manipulate the direction of the market.", "score": 1, "replies": []}, {"body": "He might be right. Or be wrong.", "score": 1, "replies": []}, {"body": "36% off bottom…so a double top? I could certainly see that.", "score": 1, "replies": []}, {"body": "Yup just keep buying all the fodder while the shorts get out of their positions pushing prices higher for the time being, dumping those bags on retail, and then hedging themselves for the ride all the day down.", "score": 1, "replies": []}, {"body": "The dude is regularly mocked by the pros on Twitter.", "score": 1, "replies": []}, {"body": "There will always be a multitude of people predicting market turns. When a thing that is predicted doesn't happen we all conveniently forget about it. When events happen to turn out inline with said prediction, we all hail them as some 2000 IQ market sooth-sayer, and make movies about them.\n\nSomething will most definitely happen.", "score": 1, "replies": []}, {"body": "Know of any economists who got rich trading stocks?", "score": 1, "replies": []}, {"body": "Please stop quoting David Hunter.\n\nDavid Hunter has been calling for a melt up and subsequent 80% decline for every year since at least 2015. He also called for a meltup every step of the covid decline and then claimed he correctly called the recovery, while actively denying the drop itsself.\n\nHe is the worst of the worst of the macro pundits who knows less than nothing but shout whatever gets him into public attention.", "score": 1, "replies": []}, {"body": "Believe it or not… another 10 yr bull run \n\nAll the people sitting in cash waiting for a crash will be big mad", "score": 1, "replies": []}, {"body": "I'd keep a close eye on what Buffet is doing", "score": 1, "replies": []}, {"body": "My Psychic reader the market would go up by 63%, I trust my psychic and am fully invested.", "score": 1, "replies": []}, {"body": "Just to clarify for a novice, this guy thinks we go up to that number, fall back before making a big run up and meltdown? Wow what an insightful prediction, the market moves up and down", "score": 1, "replies": []}, {"body": "Just before I'll sell my stonks! Cheers brother!", "score": 1, "replies": []}, {"body": "i think theres going to be one more rate hike. then after that people will realize there wont be any more rate hikes and then rush to get invested in to the market causing another big upswing.", "score": 1, "replies": []}, {"body": "How many times have i heard pn TV stock programs, about inverterted bond yields signals a recession.", "score": 1, "replies": []}, {"body": "I believe it. But it will recover and I’m holding at least 1 decade so…I can wait.", "score": 1, "replies": []}, {"body": "I feels like we’ll be melting up for the forseable future. Trends tend to go on a lot longer than everyone thinks and those who own office real estate are going to continue to sweep their complete mess of a situation under the rug for as long as possible.", "score": 1, "replies": []}, {"body": "David Hunter is an idiot", "score": 1, "replies": []}, {"body": "This is the fear I’ve heard on the all in podcast by Chamath palihapitiya. Ie the fed eased up too long on rates then covid happened and they still eased up even with inflation looming. Now they go the opposite way and who’s to say they won’t tighten too long?", "score": 1, "replies": []}, {"body": "Does he have short positions?", "score": 1, "replies": []}, {"body": "David Hunter lol", "score": 1, "replies": []}, {"body": "“tHoUghTs??”", "score": 1, "replies": []}, {"body": "Have been thinking a correction is in order this year. But I have been wrong before.", "score": 1, "replies": []}, {"body": "Lol\n\nWhy aren’t they Trillionaires by now", "score": 1, "replies": []}, {"body": "Can’t wait to buy", "score": 1, "replies": []}, {"body": "Bla bli bla blu", "score": 1, "replies": []}]}
{"title": "AUGUST CPI PREVIEW: Consumer price index (CPI) inflation is likely to begin RISING, after falling for a year. Base effect of 2022 oil prices", "selftext": "[deleted]", "id": "15miead", "created_utc": 1691594697.0, "score": 172, "upvote_ratio": 0.92, "num_comments": 91, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|3 years ago\n**Total Comments**|1026|**Previous Best DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Looks like Up and to the Right.\n\nBullish ![img](emote|t5_2th52|31249)", "score": 94, "replies": [{"body": "You see the President's head going back and to the left. back and to the left. back and to the left", "score": 16, "replies": [{"body": "That… is one magic loogie", "score": 7, "replies": []}, {"body": "Don't forget about Umbrella Man kids!", "score": 3, "replies": []}]}, {"body": "Watch it go straight down tomorrow.", "score": -1, "replies": []}]}, {"body": "Step 1: set bad expectations \nStep 2: beat said bad expectations\nStep 3: profit", "score": 55, "replies": [{"body": "You figured out the economy!", "score": 11, "replies": []}]}, {"body": "If inflation goes higher, this is gonna be the mother of all crashes", "score": 43, "replies": [{"body": "Interest rates at 10% is going to be insane", "score": 34, "replies": [{"body": "\\~10% is the rate some of the economy professors told me is necessary in order to get the economy at the feds target rate of inflation.  Thought that was at the beginning of the year. I don't think J.Pow would do that though", "score": 6, "replies": []}]}, {"body": "Ok so here's the scenario. Numbers come in 'OK' and market spikes, then as they are digested and comments come out market drops, and then.. it crashes. \n\nTrust me, I own a Mypillow. I mean I don't, but think of me as a person that could. Or not.", "score": 19, "replies": []}, {"body": "Tomorrow is likely going to be a higher annual read than last month no matter what. July PY came in at 0%, so as that read falls off and replaced by July CY, it’s pretty much guaranteed to be higher \n\nIt’s already  priced in that annual inflation is going to come in higher, between 3.25-3.5% - so it’s not so much the coin flip of higher = market crash", "score": 5, "replies": []}, {"body": "Priced in", "score": 1, "replies": []}, {"body": "Their won't be any crashes for a couple months at least  cause we went down a lot faster then expected . A couple of hot cpi reports consecutively would cause a problem . But one miss wouldn't be bad cause the forward looking would forecast a cpi beat the next time", "score": 1, "replies": []}]}, {"body": "You should probably also state your MARKET outlook being bullish/bearish as well as your trades. This is r/wallstreetbets, not r/economics. Just posting someone else's data & projections without your own take feels like you're just dodging the heat. The rest of us can't agree/disagree with your take and we won't know whether to call you a 🌈🐻, a permabull, and/or a regard if you don't have your own take.\n\nI look at this \"maybe\" projected rise in inflation and think ***it's normal***? \n\nNot sure how China's deflation and slowdown will develop going forward but inflation just nosediving from +9% to 2% isn't right and if we don't have a staircase lower (rebound to lower highs before pushing to lower lows) then we'll probably nosedive crash past the 2% mark and even the 0-1% all the way into deflation/recession. A soft landing will look like that but more of a staircase down or downwards and then flatten out. \n\nReal question should be how to trade it and MY way is to stay mostly invested while building up some cash and buying the dips. Maybe buy oils, RE, or things that are relatively unloved on the dips as trades or just S&P/R2K index funds. If you're a quick trader or high risk regard then maybe run neutral-bearish options now and then neutral-bullish on dip. Alternatively now would be a good time to short AI and long oil, XLU, and staples if you believe we're getting rebound in inflation since they've been crap this whole year.", "score": 16, "replies": []}, {"body": "One chart and a headline. This is what you call DD? Pathetic.\n\nDo better.", "score": 46, "replies": [{"body": "Yeah! This chart needs to be... at least three times bigger than this!", "score": 12, "replies": [{"body": "And is it to much to ask that OP draw some of those opinion lines on the chart?!", "score": 3, "replies": []}, {"body": "What, is this a chart for ANTS???", "score": 3, "replies": []}]}, {"body": "It's Jim Bianco's work. See https://www.biancoresearch.com/\n\nWatch his explanation here: https://youtu.be/vwRhYWA8yqg\n\nHe explains (in that video) exactly what's happening", "score": -4, "replies": [{"body": "I appreciate the fact you're trying to spread knowledge, but this is WSB. You don't just post a 10 minute long video and tell people to watch it. You watch it yourself, understand it, and then post your chart with a summary. \n\nI got other shit to do, not gonna watch a 10 minute video of some random ass youtuber i've never heard of. If the information is reasonable it will speak for itself, but you should be the one to watch and then summarize it if you're gonna make a post.", "score": 41, "replies": [{"body": "\"Random ass youtuber\"? Do you not know who Jim Bianco is? 😅\n\nThe oil price shock of 2022 is falling out of the CPI 12-month sliding window\n\nThat's why CPI has been falling linearly for so long. Almost a straight line from 9% to 3%\n\nBut now, the whole of the 2022 oil price shock has been removed from the sliding window\n\nAs a result, CPI has bottomed at 3% and will begin to rise\n\nLook at the huge 1.2 bar on the left of the official CPI bar chart:\n\nhttps://www.bls.gov/news.release/pdf/cpi.pdf\n\nThat 1.2 is an oil price shock inflation bar, and it was the last one\n\nWithout those huge bars falling out of the sliding window, the CPI probably won't go down\n\nJust like your girlfriend", "score": 14, "replies": [{"body": "Nice", "score": 6, "replies": []}, {"body": "This does not account for the already falling Rent prices which has yet to be priced in the CPI reports and is a massive factor when calculating those readings.", "score": 4, "replies": [{"body": "No rent decrease in my town. In fact they went up. Best regards", "score": 4, "replies": [{"body": "Anecdotes don't matter for the actual rent index.", "score": 7, "replies": [{"body": "Real time rental prices have surged since February. Same with home prices when you look at the Case Shiller data. \n\n[https://www.redfin.com/news/redfin-rental-report-june-2023/](https://www.redfin.com/news/redfin-rental-report-june-2023/)\n\nHopefully this new trend doesn't sustain otherwise it will get ugly.", "score": 5, "replies": [{"body": "Yes but my main point about CPI pricing in that 6 month laggard for rents remains true. We won't actually see a monumental increase in the report  for a month or two now assuming rents remain flat and doesn't meaningfully explode on one side.", "score": 1, "replies": []}, {"body": "Asking rent is an absolutely garbage metric. \n\nI can ask for any price.", "score": 1, "replies": [{"body": "Please share a better source for understanding real time trend in rents. A link would be very helpful. Thank you in advance.", "score": 1, "replies": []}]}]}]}]}, {"body": "Jim Bianco is already accounting for that\n\nPlease watch the video (linked above) where he explains", "score": -4, "replies": [{"body": "He's also a perma bear who shouldn't be trusted", "score": 3, "replies": [{"body": "Wrong again. He's calling for no recession\n\nThat makes you wrong twice, in two comments, a perfect score", "score": -7, "replies": [{"body": "Yet he was bearish in his other comments. maybe actually read into something that you're trying to spout. Have fun with your puts expiring worthless though. Troll elsewhere, child.", "score": 6, "replies": [{"body": "[removed]", "score": -8, "replies": [{"body": "Im talking to another WSB degen who thinks he knows something", "score": 1, "replies": [{"body": "My subreddit is right here: r/brkb\n\nGet your facts right\n\nHave a nice day, my friend", "score": 0, "replies": [{"body": "> Get your facts right\n\nIronic.", "score": 1, "replies": []}]}]}, {"body": "![img](emote|t5_2th52|4276)", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Thats a lot better. Personally would edit your post or repost it and add that in! I'm a big bear with a lot of money on the sidelines in bonds so hoping you're correct and we get a nice dip to buy.", "score": 1, "replies": []}]}, {"body": "> I appreciate the fact you're trying to spread knowledge, but this is WSB\n\nOr just speak like a regarded 5 year old and get 10 internet rewards", "score": 3, "replies": []}, {"body": "He’s not just random like yourself. If you are too lazy to watch don’t invest", "score": 1, "replies": []}]}, {"body": "And he’s been wrong a million times.", "score": 1, "replies": []}]}]}, {"body": "gullible telephone summer gaping berserk pocket quickest exultant pot amusing", "score": 9, "replies": []}, {"body": "Priced in. China stimulus coming in hot", "score": 7, "replies": [{"body": "Where did you hear that ?", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I don’t think that it’s that straightforward. If prices are dropping, and you get a stimulus check, wouldn’t you save the money instead of spending it  right away. In deflation, your money is worth more in the future.", "score": 1, "replies": []}]}]}]}, {"body": "So calls or puts on SPY?", "score": 3, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "oh boy... so the USA consumes about 20 million barrels of oil a day (not including our military). The military consumes about 12 million barrels of oil a day.  The SPR can hold up 700.00 mil gallon. Its currently at 350.00 mill... Even at max capacity its like 22 days worth of oil.. do you get it yet ?", "score": 4, "replies": []}, {"body": "Oil is getting more expensive here because the oil companies are selling finished gas products overseas, hand over fist.\n\n[https://www.eia.gov/dnav/pet/hist/LeafHandler.ashx?n=PET&s=MGFEXUS1&f=M](https://www.eia.gov/dnav/pet/hist/LeafHandler.ashx?n=PET&s=MGFEXUS1&f=M)", "score": 0, "replies": []}]}, {"body": "Dead cat bounce", "score": 4, "replies": []}, {"body": "The rental component in core cpi is starting to turn down. The Forward rental indicator has collapsed.\nBase effects still huge YOY. \n\nCPI will be below expectations IMO.", "score": 2, "replies": [{"body": "Real time rents are surging since Feb.\n\n[https://www.redfin.com/news/redfin-rental-report-june-2023/](https://www.redfin.com/news/redfin-rental-report-june-2023/)", "score": 2, "replies": [{"body": "You call that a surge?\n\nLook at the zillow rental index.", "score": 0, "replies": [{"body": "Uhh of course I do. Rents increased 1.7% from May to June lol. That’s 20.4% annualized. We do not want to see this trend continue.", "score": 1, "replies": [{"body": "“rents were up 0.5% year over year in June”", "score": 1, "replies": [{"body": "Yep there was a big spike until last summer then there was a big drop and now since Feb it’s been surging again. Current trend does not look good. The last 6 months rents have risen quite quickly and from May to June alone we saw a 1.7% increase in rents in a single month.", "score": 1, "replies": []}]}, {"body": "https://www.nerdwallet.com/article/finance/rental-market-trends\n\nHmmm we must be reading different data.", "score": 1, "replies": [{"body": "You are reading different data. I linked my source. Please feel free to check it out.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "On the next one. Not this one but yes.", "score": 1, "replies": []}, {"body": "If the CPI rises high enough for 2024, then Biden is statistically going to win, even though presidents have very little to no control over the CPI.", "score": 1, "replies": []}, {"body": "I bet cpi numbers are going to be good because. Its going to be election soon. Tommorow we will know if its good for the bers or the bools.", "score": -5, "replies": []}, {"body": "What costs less than June of '22? Everything I buy has done nothing but go up. The only thing that went back to almost normal was eggs.", "score": -1, "replies": [{"body": "my portfolio costs less today ![img](emote|t5_2th52|27421)", "score": 5, "replies": []}]}, {"body": "The Cleveland Federal Reserve's Nowcast for June projects CPI of 9.06% YoY for that month, and 5.31% YoY for December 23, 2023. Assuming post-covid inflation averages (2020-2023), the projection would be 8.00% YoY by December 23, 2023; under pre-covid QE inflation averages (2009-2019), it would be 7.00%. If there is zero inflation for the rest of the projection period, then CPI would reach 3.91%, still well below target levels set by most major central banks around the world..", "score": -4, "replies": [{"body": "For June? Lol. I think all your numbers are wrong", "score": 8, "replies": [{"body": "He is \"A.I.\" and understands nothing", "score": 4, "replies": [{"body": "Lol he's a useless bot then", "score": 3, "replies": [{"body": "Don’t you talk about our boy visual mod like that ![img](emote|t5_2th52|8883)", "score": 5, "replies": []}]}]}]}]}, {"body": "Let the games begin!", "score": 1, "replies": []}, {"body": "Based on the ViX today", "score": 1, "replies": []}, {"body": "I think OP is right", "score": 1, "replies": []}, {"body": "SO BULLISH!\n\nWHERE MY BULLS AT!!??! READY FOR THIS MARKET TO GO TO 470 TOMORROW?", "score": 1, "replies": []}, {"body": "Prob go 5.9 by December but it’s a dead cat bounce", "score": 1, "replies": []}, {"body": "It’s all priced in markets go up - my hot take", "score": 1, "replies": []}, {"body": "Calls on inflation. \n\nNext stop Housing bubble pops !", "score": 1, "replies": []}, {"body": "I watched [the video](https://www.youtube.com/watch?v=vwRhYWA8yqg) that OP was referring to and the thesis does make sense. \n\nEssentially what Jim Bianco is saying is the absolute highest monthly inflation rate registered was in June 2022. When looking solely at the year-over-year inflation rate, the highest rates registered are no longer in play (ie. it won't be as easy to beat each month like it has been over the last year).\n\nWith that in mind after all the highs registered, some of the lowest overall inflation months in 2022 were July, August, November, and December. All of which will now be calculated in the new year-over-year inflation rate. \n\nBecause these rates were so low, it's going to be really hard for the each upcoming month to be drastically better. This will inevitably lead the month-over-month inflation rate higher since there aren't anymore high rates to beat. So year-over-year inflation will likely bottom around 3% or a little lower before starting to go back up again. It will never hit the Fed's 2% target at the current trajectory.\n\nTherefore, the Fed is likely going to use this as an excuse to raise rates 1-2 more times in the next 6 months to combat this. Which could cause the markets to drop hard again.", "score": 1, "replies": [{"body": "Our AI tracks our most intelligent users. After parsing your posts, we have concluded that you are within the 5th percentile of all WSB users.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "for all those who are wondering, CPI inflation ticking upwards again means no FED pivot anywhere in sight\n\nthat means this \"hope\" rally of 2023 is going to deflate very fast once the market digests this\n\nif so, then its time for cash, bonds, VIX, shorts, and very very defensive positions", "score": 1, "replies": [{"body": "*This “pivot.” Is it in the room with us now?*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}
