{"title": "[META] Is there a single female member of this community?", "selftext": "Not sure why this thought came to mind today but I feel like we're all men in this place. Any females here? And can I have your number please?", "id": "3oqxph", "created_utc": 1444844063.0, "score": 59, "upvote_ratio": 0.91, "num_comments": 116, "comments": [{"body": "If there are, they have some balls.", "score": 64, "replies": []}, {"body": "[deleted]", "score": 139, "replies": [{"body": "I like educated individuals like myself ", "score": 7, "replies": []}, {"body": "Ha ha ha ", "score": 1, "replies": []}]}, {"body": "Your mom must be around a lot, the way people here keep getting fucked. ", "score": 83, "replies": [{"body": "r u the guy from xbox live that fucked my mom???", "score": 38, "replies": [{"body": "Which guy?  You're going to have to be more specific.", "score": 23, "replies": []}]}]}, {"body": "I remember there was a user named Xx_MissInvestorQueen_xX. Convinced everyone he was a \"she.\" Had a lot of people defend \"her.\" I ended up swindling him over PMs and he admitted he was a dude.\n\nedit: Found the screenshots. It was XxGrannySmithXX and then Miss_Investor_Queen.", "score": 14, "replies": [{"body": "Bro- you know that has to be the \"young_millionaire\" on ST that everyone is fucking dumb enough to believe is a chick. When you call \"her\" out she instantly blocks you. Best part is, they switched their name to \"Mr_Investor\" or something. You can go back to convo's and see dudes saying \"you're so fucking hot\". It's great for screenshotting/mocking. ", "score": 1, "replies": [{"body": "I know who you're talking about lol the picture of the girl is mad hot", "score": 1, "replies": [{"body": "Yeah, and completely fake. ", "score": 1, "replies": []}]}]}]}, {"body": "Female lurker. Can't say I participate in this type of trading, it's just one of a couple subs I subscribed to in the interest in learning more about investing, finance, the stock market, etc. I'm not going to lie, I think about 98% of you are idiots who have access to way more money than you should considering the apparent development of your ability to analyze risks and make smart decisions...\n\nEdit: Based on the fac that I haven't been downvoted yet, at least you guys are self aware. Either that, or each of you just thinks that everyone else is an idiot. ", "score": 13, "replies": [{"body": "> access\n\nmost of us earn the money ourselves we don't just have a magic card that gives us access to funds. but yes 98% of us are idiots, me included", "score": 7, "replies": [{"body": "Bernie Sanders gave me $250k from the money tree to get started, that's why I'm voting for him.", "score": 3, "replies": []}, {"body": "I know that most of you earn your money - I just still stand by the fact that apparently you guys shouldn't have access to your own money (for your own good)", "score": 1, "replies": [{"body": "probably true but YOLO", "score": 2, "replies": []}]}]}, {"body": "As an idiot, can confirm most of that. But I earn my money 9-5 every day at Subway so I resent the trust-fund baby implication there kid.", "score": 2, "replies": [{"body": "I responded to another comment like this already. I understand that my comment may have come across that way, but honestly my opinion doesn't really change regardless of whether you earned the money yourself or not. In fact, it might be worse. ", "score": 1, "replies": [{"body": ">but honestly my opinion doesn't really change regardless of whether you earned the money yourself or not. In fact, it might be worse. \n\nAh - but imagine the same inability to assess and allocate for risks irl. Idiot or no - my money and I are awesome company at casinos and bars.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 28, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "[deleted]", "score": 16, "replies": [{"body": "Where did you learn to YOLO on HL? I didn't see HL at all on WSB", "score": 3, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Where did you get the idea from? What is your source?", "score": 1, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "If she got the inside scoop, why not!?", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "bro, gold is a gravy train right now. The almighty peter schiff was on point, just start putting GDX, GLD calls now while you still can with 5x leverage.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "send nudes", "score": 29, "replies": [{"body": "God that is the laziest fucking joke possible. Just totally predictable and unoriginal. ", "score": -33, "replies": [{"body": "Well, I was referencing this post on the front page: https://i.imgur.com/NuwcRUy.jpg\n\nSorry I'm not as original and unpredictable as you PortfolioCancer.", "score": 24, "replies": [{"body": "Bruh- he's coming in to be a hoe savior. He is going to win her over with friendship and be her shoulder to cry on when Chad ThunderCock breaks her heart. Damn, it's like you don't even know female strategy. ", "score": 15, "replies": [{"body": "Ah the white knight. He is not the savior she deserves. He is the savior she needs.", "score": 10, "replies": [{"body": "look at his flair.", "score": 3, "replies": []}]}]}]}, {"body": "*unsheathes katana*", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "[deleted]", "score": 20, "replies": [{"body": "what the fukkkkkkkkk we have a HARVARD WOMAN HERE BOYS. she's smarter than all of us plebs. what was your SAT score like 69420?", "score": 14, "replies": []}, {"body": "So...come here often? 🐶😳", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I see you like gainz and yachts too. 😎", "score": 5, "replies": []}]}]}, {"body": "Well I'll be looking through all students currently attending harvard for your picture.\n\nI'll be back in a few days.", "score": 8, "replies": [{"body": "While you're at it, you should make a website that allows Harvard students to look at two people on campus and vote on which one is more attractive. ", "score": 6, "replies": [{"body": "Maybe add a functionality were people can sign up and add each other as friends and like different photos people post?", "score": 5, "replies": []}]}]}, {"body": "HBS?\n\nAlso, Jesus Christ, did you take that photo on a print of Starry Night or some shit?", "score": 3, "replies": []}, {"body": "The old \" how do you know if someone went to Harvard\" joke", "score": 3, "replies": []}, {"body": "do u like charts bby ", "score": 0, "replies": []}, {"body": "epic photoshop skills - jesus christ - is that what they fucking teach you at harvard?", "score": 1, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "your inbox must be a magical place right now :)", "score": 7, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "I will grant you a flair that will ward off the plebs", "score": 4, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": " i am going to pretend it is some book promoting pegging. makes this line of thought so much better", "score": 1, "replies": [{"body": "You need pegging flair.", "score": 2, "replies": [{"body": "god damn it, stop that", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "What you need to do is write /r/wallstreetbets and your username on that little paper to verify. Boobs is a +.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "All hailz the yolo queen boys.", "score": 1, "replies": []}]}]}, {"body": "Pretty and Harvard huh? Good for you.", "score": -2, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "That tag is lyfe", "score": 2, "replies": []}, {"body": "Just Do It ^^TM", "score": 1, "replies": []}]}]}]}, {"body": "Terrible. ", "score": -2, "replies": []}]}, {"body": "[deleted]", "score": -12, "replies": []}]}, {"body": "My sis is a doctor and I asked her opinion on many of the sketchy biotechs recommended on here.\n\nThe one she liked the most was TPIV, but she was too much of a pussy to actually invest.\n\nI did though, one of my few winners", "score": 17, "replies": []}, {"body": "No but I can tuck my dick in real well if you want me too", "score": 8, "replies": []}, {"body": "Girls can't trade in the market.  This is why brokers ask for your gender before approving your account. ", "score": 32, "replies": [{"body": "Broker here...\"never pitch the bitch\"", "score": 31, "replies": [{"body": "that's jokes", "score": 5, "replies": []}, {"body": "check your privilege u cis white gender scum!!!", "score": -6, "replies": []}]}, {"body": "lmaooooo hilarious. that is absolutely brilliant", "score": 6, "replies": []}, {"body": "well that isn't true", "score": -6, "replies": []}]}, {"body": "[deleted]", "score": 15, "replies": [{"body": "idk im a man and im pushing for that shit.......... are you saying you have two x chromosomes?\n", "score": 11, "replies": []}, {"body": "As well as female health. I love the Female Health Company.", "score": 4, "replies": []}]}, {"body": "You'll eat your dick sandwich and like it you gaybo", "score": 16, "replies": []}, {"body": "You lookin' for a wife to ride on your sweet ass yacht?", "score": 10, "replies": [{"body": "i already have a wife in continental america but apparently im allowed having one for nautical time as well?? looking into this with my lawyers", "score": 25, "replies": [{"body": "We go on this booze cruise around here.. it's in the bay but we consider it \"international water/maritime law\".", "score": 1, "replies": []}]}]}, {"body": "What if most of the people here are ladies and they just act the way they do to mess with you?", "score": 4, "replies": []}, {"body": "My sister thinks investing is a great way to lose money.\n\nShe's right.", "score": 6, "replies": []}, {"body": "Bro, this isn't the place to try to pick up chicks. They like tall guys anyways, not short ones.", "score": 5, "replies": [{"body": "What about if I hold song position? ", "score": 1, "replies": [{"body": "If you a thug in da club, errybody know. Errybody.", "score": 2, "replies": []}]}]}, {"body": "[youtube says 7% of my traffic from this site is female](http://imgur.com/UZaOKUh)", "score": 4, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "German and Russian chicks, nice.", "score": 3, "replies": []}]}, {"body": "Half of them clicked by accident. \n\nHalf of half are men. \n\nHalf of half of half are their bothers/husbands/boyfriends using their accounts for learning proposes. \n\nSo, 2.5% are actual female traders.\n", "score": 1, "replies": [{"body": "[doesn't matter still counts](https://www.youtube.com/watch?v=lQlIhraqL7o)", "score": 1, "replies": []}]}]}, {"body": "I'm a fine biddy with big ol' tits hmu", "score": 10, "replies": [{"body": "foig", "score": 5, "replies": []}]}, {"body": "Lurking counts, right?", "score": 6, "replies": [{"body": "Creepy bitches lurk", "score": 1, "replies": []}]}, {"body": "[Sadly, it is a sausage fest around here...](https://youtu.be/9Wl_uQOABxg)", "score": 3, "replies": []}, {"body": "For the right amount of capital I'll be whatever you want me to be, mate", "score": 3, "replies": []}, {"body": "Hi. ", "score": 3, "replies": [{"body": "no way", "score": 3, "replies": [{"body": "You want proof?", "score": 1, "replies": [{"body": "nudes?", "score": 0, "replies": []}]}]}]}, {"body": "Yes. Been investing for 2 decades now, covering all markets.", "score": 3, "replies": [{"body": "niiiiiiiiice", "score": 2, "replies": []}]}, {"body": "There's a real bitch named Emily floating around here. ", "score": 9, "replies": [{"body": "The .10c queen", "score": 5, "replies": [{"body": "0.10 gain on 0.50 is 20% yo!! GOTTA GET THAT MONEY!", "score": 8, "replies": [{"body": "The queen has said make it so..you peasants! .10c RECORD setting.\n\nNow bow to your Queen....Unless you make .11c gains", "score": 1, "replies": []}]}]}, {"body": "Rude.  She is cool af.", "score": 1, "replies": []}, {"body": "/r/em1lyelizabeth ", "score": 0, "replies": [{"body": "you mean /u/em1lyelizabeth? first of all isnt that the name of the girl from clifford the big red dog?", "score": 10, "replies": [{"body": "Unfortunately :\\", "score": 14, "replies": []}]}]}]}, {"body": "Paging Miss Emily.", "score": 8, "replies": [{"body": "Not sure why you got downvoted on this...", "score": 8, "replies": [{"body": "Haters gonna hate.", "score": 4, "replies": [{"body": "fuck you. ", "score": 2, "replies": [{"body": "go fuck yourself <3", "score": 11, "replies": [{"body": "no u", "score": 4, "replies": [{"body": "kk", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Just Hillary Clinton so no.", "score": 7, "replies": []}, {"body": "If you can't find one here,  then try r/stockmarket because stock-jok-e is a pretty cool chick ", "score": 2, "replies": []}, {"body": "Woman here.", "score": 2, "replies": []}, {"body": "I'm pretty sure that like 60% of all options traders are women and the other 40% are computer algorithms written by men trying to predict women trading patterns (hint: impossible).", "score": 2, "replies": []}, {"body": "me", "score": 1, "replies": []}, {"body": "I don't identify with gender calling it's so hot right now. Good try", "score": 1, "replies": []}, {"body": "Female lurker. I don't trade like this, I'm just here for the YOLO.", "score": 1, "replies": []}, {"body": "hahaha", "score": 1, "replies": []}, {"body": "Most females who trade have higher test levels than the average women.\nThey are basically men with vaginas.\n\nYou need high test to do risky behaviors.\n\nOur ancestors did it with their lives. We do it with even riskier investment. Our money.\n", "score": 1, "replies": []}, {"body": "Women don't have to yolo. They watch us yolo then marry the guy with the biggest gains.", "score": -2, "replies": [{"body": "Tell that to the billionaire female hedge fund managers of the world. Or the women that make a living trading. Or just about any woman in finance. Also, some women prefer to marry other women.\n\nYOLO!", "score": 9, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": ">You make any money here?\n\nYeah I've got like fifty fucking yachts and shit. It's pretty legit.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "yeah just go all-in on the following and you'll do fine:\n\namd, amda, avxld, bgmd, blfs, labu, and tbev.\n\nedit: how did that tbev shit slip in there? oh well, buy it anyway!", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "I see you only speak Douchebag.", "score": 5, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "I thought you couldn't read Unicorn or Dog. How are we communicating right now?", "score": 3, "replies": []}]}]}]}]}]}]}
