{"title": "What websites/blogs do you follow for picking stocks?", "selftext": "Last month, I made %50 profit by QCOM-apple agreement by following tech news, therefore I miss the oppurtunity to buy appl cheap. I have no idea about other industries. is there any useful accurate website for such occasions. or should I watch just mainstread media and some ordinary economy blogs?\n\n&#x200B;\n\nNote : I'm not talking about ''10 stocks to buy in 2019'' or ''123 stocks to boom in 2035'' kind of shit. \n\n&#x200B;\n\nthank you all.", "id": "bippmq", "created_utc": 1556545863.0, "score": 182, "upvote_ratio": 0.95, "num_comments": 68, "comments": [{"body": "Apple+, google News, Reddit news and investing subreddits\n\nI keep an eye out for supply / demand changes with commodities, changes with tariffs and trade barriers, trends and hype that change with consumer demand. I'm mostly in industrial and commodity stocks, because that's what I'm most familiar with. \n\nTrading economics also has a calendar stats releases, and earnings releases that I find pretty helpful. Even if they're behind by an hour or two sometimes.", "score": 48, "replies": [{"body": "What's unique on Apple+ ?", "score": 3, "replies": [{"body": "Apple news + gets me access to magazines like Newsweek and Forbes", "score": 1, "replies": []}]}, {"body": "What are some good investing subreddits?", "score": 1, "replies": [{"body": "beginner: \n\nr/investing, r/stocks, r/personalfinance, \n\nless beginner:\n\nr/SecurityAnalysis, r/thewallstreet, r/options\n\nthe dark side:\n\nr/wallstreetbets", "score": 6, "replies": [{"body": "The force is strong with this one", "score": 1, "replies": []}]}]}]}, {"body": "I'm an amateur value investor and I publish a blog where I share my analysis on various companies every now and then. Usually I'll do a valuation and say if a stock is under/overpriced.\n\n- [Costco](http://jeffsinvestmentblog.com/post/179090549496/fair-value-costco) (overpriced in Oct)\n- [Walmart](http://jeffsinvestmentblog.com/post/177710286506/fair-value-walmart) (underpriced in September)\n\nI sometimes write about judging the value of a stock in-general: [Fundamental Analysis - 2019 Field Guide](http://jeffsinvestmentblog.com/post/184465662806/fundamental-analysis-2019-field-guide)", "score": 43, "replies": [{"body": "As someone just starting, I found your blog to be clear and useful. Thanks", "score": 9, "replies": [{"body": "Youre welcome!", "score": 1, "replies": []}]}, {"body": "What type of valuation models are you using ?  I gave your blog a brief read over .", "score": 2, "replies": [{"body": "[Discounted Cash Flow](https://www.investopedia.com/terms/d/dcf.asp). I take up to 10 years of free cash flows, find the average rate of growth, then project it 5 years into the future, then discount (usually 8%, just below avg. market return) to today. That gives me the present value of future cash flows. I then take that number, and divide it by the number of shares outstanding to get the present value per share. Then I take an additional 20-40% off of that number (depending how much confidence I have in the projections) to get a safe estimate of fair value. That number is how much I would be willing to pay for the stock.", "score": 12, "replies": [{"body": "Why don't you find the correct WACC to find the intrinsic value or use APV, this seems a little rudimentary, plus you don't take into account a lot of other things?", "score": 3, "replies": [{"body": "> Why don't you find the correct WACC\n\nTo find WACC, you must find the Cost of Equity, which for a stock, requires CAPM, which includes the stock's Beta, which is a measure of how the stock price has correlated with the market. I'm trying to find instances where the market is wrong, so I find it counter-productive to incorporate market beta into my evaluation.\n\n> use APV\n\nWhat is APV? Maybe I could try it\n\n> this seems a little rudimentary, plus you don't take into account a lot of other things?\n\nYes. I try to make sense of the financial picture in broad strokes. I might miss some things but with a margin of safety I can afford to be a bit wrong. What things would you look at that I may have missed?", "score": 8, "replies": [{"body": "> then discount (usually 8%, just below avg. market return) to today\n\n> To find WACC, you must find the Cost of Equity, which for a stock, requires CAPM, which includes the stock's Beta, which is a measure of how the stock price has correlated with the market. I'm trying to find instances where the market is wrong, so I find it counter-productive to incorporate market beta into my evaluation.\n\nI hope that when you finish your CFA level 1, you will come back to this post and cringe at how dumb you sound.", "score": 2, "replies": [{"body": "Every now and then somebody in finance will tell me I'm doing it wrong, but they never explain why. \n\nMaybe I'm just so far off the mark that they don't want to bother. Could be. I am just learning as I go. Or maybe the finance industry is full of jerk-off money boys who do whatever they're told and have no idea what any of it means, just reacting to anything that looks different. Without a critical thought or a shred of creativity, they look to my background. \"Does he have more clout than me?\" should not enter into a discussion of investment analysis, but for these losers it's the central question. They just say \"it's not  done that way\" because nothing scares them more than being apart. That doesn't scare me. You think I'll look dumb, and maybe I do to you, but to somebody who actually knows what they're doing (the Buffetts, Shillers, and Mungers), they'll recognize a genuine attempt, and that sometimes looking dumb is essential to personal growth.\n\nMaybe if you wanted to have an actual discussion, you might say \"I downloaded a DCF template excel file and it has WACC\" or \"My supervisor expects me to fill out this excel template\" or if you really knew, you could tell me why I should use WACC to incorporate market beta into my valuation.", "score": 1, "replies": [{"body": "Because you discredit WACC, a widely used and easily customisable theory, based on the fact that one option of calculating cost of equity involves an input that utilises a market correlation factor to estimate an asset's rate of return. Then, you go and choose a discount rate based solely on the average market return.", "score": 2, "replies": [{"body": "> Because you discredit WACC, a widely used and easily customisable theory\n\nyou still harp on the fact that im doing something different. its a cowardly argument. if wacc so easily customizable maybe you could offer a better formula? or are you just posturing?\n\nif you invest in one stock, you forgo market returns. Therefore, the avg market return is also the opportunity cost of capital.  its simple but i think it serves its purpose", "score": 0, "replies": [{"body": "WACC is customisable because there are many ways to calculate cost of equity and cost of debt. The \"better formula\" as you say would depend entirely on the circumstances of the firm that is being valued and an informed investor would tailor their approach accordingly, i.e. not using the same discount rate for every company. The fundamental theory behind WACC is simply that a company has two ways to generate capital; equity or debt. Thus, we discount cash flows using both cost of equity and cost of debt proportioning based on the firm's capital structure. Basically, the discount rate here is supposed to represent the rate of return required by investors in order to invest in the set of assets generating the cash flows. You can't simply use the average market return as that doesn't reflect the risk of the investment at all.", "score": 2, "replies": [{"body": "really appreciate you taking the time to explain what you see amiss with the method", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Thank you for posting this .20-40% seems like a large chunk but if it works for ya keep it up.  I’m interested in these processes and find them useful .", "score": 1, "replies": []}, {"body": "for the average rate of growth, do you use past data or analyst estimates?", "score": 1, "replies": [{"body": "Past data. In the end, the question I answer is \"If the ten-year trend continues, this is the value of future cash flows\"", "score": 1, "replies": [{"body": "How about you take the past data and analyst estimates then compare, take the lesser of both?", "score": 1, "replies": [{"body": "Maybe, yeah", "score": 1, "replies": []}]}]}]}]}]}, {"body": "So what do you like right now Jeff?", "score": 1, "replies": [{"body": "I'll get back to you on that", "score": 1, "replies": []}]}, {"body": "Hey just wanted to say your blog is very good and I'm sorry for being an asshole.", "score": 1, "replies": []}, {"body": "*commenting to save for later*", "score": 1, "replies": []}, {"body": "That's nice that you're promoting your blog (against sub rules btw), but the question was *where* do you get your news.\n\np.s: it's not nice, I'm being a passive-aggressive little shit.", "score": -11, "replies": [{"body": "OP was asking for blogs for picking stocks. I write a blog for picking stocks.", "score": 5, "replies": [{"body": "I appreciated your contribution. And also am shamelessly commenting to save for later : )", "score": 3, "replies": []}]}]}]}, {"body": "/u/SoRefreshing", "score": 25, "replies": [{"body": "One of us. One of us.", "score": 6, "replies": []}]}, {"body": "It seems too mainstream perhaps, but I have learned so much useful stuff from Google News under Technology.  It aggregates tech news well, IMO.\n\nGoogle news has a business and stock section that is not very useful.\n\nAlso... Step 1: delete the politics section from your google news, it is all biased trash.", "score": 36, "replies": []}, {"body": "[deleted]", "score": 8, "replies": [{"body": "Seeking alpha is still v opinionated but good insight nevertheless", "score": 4, "replies": [{"body": "Seeking alpha has some auto publishing of transcripts that can be helpful, find a few analyst and follow them. \n\nStockTwits is literal stock herpes: bots, clueless people trying to pump. Take a grain of sand to be worth more.", "score": 1, "replies": [{"body": "Stocktwits was nice a few years ago but you are so right. Now its just bots, ads and clickbait. Crazy thing is even though i don’t use it i still haven’t deleted it yet.", "score": 1, "replies": []}]}]}]}, {"body": "I subscribe to the WSJ, paper edition.\n\nSometimes I hang the stock page on the wall and throw darts at it.", "score": 9, "replies": []}, {"body": "I usually do value trading on large market cap stocks. Find a large stock that's dipping below some SMA's (usually like over a year, then six months, then a month) and if it's a fortune 500 you simply judge whether it's going to get better with recent news (I look for controversy, it never lasts- but avoid anything that dips in quality) Sometimes I legit just bet.                    \n\n\n\nIt's a pretty good strategy. I suggest reading \"little blue book that beats the market.\" where he runs analysis on it.", "score": 7, "replies": []}, {"body": "www.8-ball-magic.com/", "score": 9, "replies": []}, {"body": "following!", "score": 2, "replies": []}, {"body": "I've found some of my best investments by reading the paper. I also use SA, but only very few writers on that site actually know what they are talking about so the site is best for earning summaries and general news. I keep a running tab of about 40 companies that I like in finviz, and they have a news aggregation feature. Your broker might give you access to morningstar reports which I think are solid.\n\n&#x200B;\n\nIts not exciting and its slow but reading the newspaper is my favorite source. You have to read between the lines though, good investment opportunities don't slap you in the face.", "score": 2, "replies": [{"body": "Your local library may provide free use of Morningstar online. I just used mine today.", "score": 1, "replies": []}]}, {"body": "That's a fairly good question... would be interested in the resulting answers :)", "score": 1, "replies": []}, {"body": "Good question, one is like to know as well.", "score": 1, "replies": []}, {"body": "It's not what you're asking, but I think Apple is still a bit cheap. Not as strong a buy as before the 30% run, but still a buy. We'll see what guidance after market close on Tuesday does.", "score": 1, "replies": []}, {"body": "As another said a Google news. I also cruise Reddit for pick ideas. I found this a few days ago on Reddit which I will start using  [https://www.tipranks.com/analysts/top](https://www.tipranks.com/analysts/top)", "score": 1, "replies": []}, {"body": "I follow Seeking Alpha.", "score": 1, "replies": []}, {"body": "Cnbc", "score": 1, "replies": []}, {"body": "\\> Last month, I made %50 profit by QCOM-apple agreement by following tech news \n\nYou mean you got lucky that the agreement happened the way it did. Could have easily not gone your way.", "score": 1, "replies": [{"body": "I read news about intel cant produce 5g until 2021, and qcom is the only one 5g producer in the world.\n\n&#x200B;\n\nApple had no choice to aggree deal with qcom, not sure its right logic tho", "score": 5, "replies": []}]}, {"body": ".", "score": 1, "replies": []}, {"body": "My nieces and nephews. What they eat, drink, and what apps they use", "score": 1, "replies": [{"body": "Good idea, I never thought that way.", "score": 3, "replies": []}]}, {"body": "Try cramer in action alerts plus", "score": 1, "replies": []}, {"body": "You can try theancientbabylonians.com", "score": 1, "replies": []}, {"body": "Save", "score": 1, "replies": []}, {"body": "Kiplinger.com - easy to navigate, very user friendly, and a ton of great information.", "score": 1, "replies": [{"body": "I second Kiplinger. I am subscribed to their paper newsletters at work... It's full of great information!", "score": 1, "replies": []}]}, {"body": "Investing City is pretty dank. Recommended smartsheet at 25 and MDB at $35 and more. Also got a cool email newsletter. All that shit helped a new investor a ton so yeah give it a look if you want. wsb is also not bad", "score": 1, "replies": []}, {"body": "Dividend Sensei on Seeking Alpha - weekly articles with incredibly detailed and valuable info on a wide variety of dividend stocks.  I've learned so much in the last three months from these articles.  Can't recommend them enough.", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": []}, {"body": "Motley Fools:  fool.com", "score": 0, "replies": [{"body": "Pay forum or generic page?", "score": 1, "replies": [{"body": "Well, you can access their site for a lot of stock info and join for free.  However, for their newsletter you have to pay.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "I will be messaging you on [**2019-05-02 15:21:13 UTC**](http://www.wolframalpha.com/input/?i=2019-05-02 15:21:13 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/stocks/comments/bippmq/what_websitesblogs_do_you_follow_for_picking/em2anve/)\n\n[**CLICK THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/stocks/comments/bippmq/what_websitesblogs_do_you_follow_for_picking/em2anve/]%0A%0ARemindMe!  3 days) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! em2awas)\n\n_____\n\n|[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/)\n|-|-|-|-|-|-|", "score": 1, "replies": []}]}]}
