{"title": "YOLO $DIS Puts", "selftext": "", "id": "bceywl", "created_utc": 1555083418.0, "score": 78, "upvote_ratio": 0.93, "num_comments": 65, "comments": [{"body": "Do you hate money?", "score": 39, "replies": [{"body": "Waiting to get spanked with these iron hands.\nHere is an update: https://imgur.com/0Lswgdr", "score": 15, "replies": [{"body": "how does losing $7.5k in 30 minutes feel?", "score": 16, "replies": [{"body": "Not too bad. Better than 30K loss on ACB", "score": 15, "replies": [{"body": "What were you thinking? Analyst upgrades are going to start pouring in. If you bought at the top this would have been a good idea but you didn't.", "score": 8, "replies": []}, {"body": "Uh...are those really the only two options?", "score": 5, "replies": []}]}]}]}]}, {"body": "I'm with it. Nothing rockets 15% in a day and stays there. \n\nIts 6.99 a month. Small potatoes to disney.", "score": 27, "replies": [{"body": "That's the entire strategy. Today they have 0 subscribers.\n\nGet em in cheap, then raise the price over time. NFLX did the same thing.", "score": 14, "replies": []}, {"body": "In addition \n>The new service won't be profitable right away. Disney CFO Christine McCarthy revealed near the end of the presentation that Disney+ won't be profitable until fiscal 2024. The platform expects to be spending $2 billion a year by 2024 on original content.", "score": 5, "replies": [{"body": "Don't they already pump out a ton of original content.  I think they have like 3 cable channels and the rights to 80% of my childhood...  Any new original content will have multiple revenue streams.  As cable dies, they will be able to shift things to their streaming platform.   If they can make hulu into a viable challenge for adults/regular tv they might even be able to salvage ESPN (god ESPN sucks since Disney took over).", "score": 3, "replies": [{"body": "Disney was also a strong part of my childhood, however, nowadays I see my kids watching people on YouTube acting in Roblox and subtitled cartoons despite having the exact channels I had growing up. Disney channels content isn't there anymore. Movies yes. Channel no.", "score": 1, "replies": [{"body": "So their ratings have fallen off?  Or this is just based on what you see your kids doing?", "score": 1, "replies": []}]}]}]}, {"body": "Also not when they start at 6.99..roll it out globally and spread their brand even more than they have. Then scaling their price slowly just as Netflix did as they produce more content (hopefully quality content).", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": ">I can give you multiple examples of stocks (including large caps) that go up 15% in a day, and then not only stay there but continue to go up the next trading day.\n\nAnd yet you didn't.", "score": 9, "replies": [{"body": "Look at lulu", "score": 3, "replies": []}]}]}, {"body": "Hey man, did you look at Disney today?", "score": 1, "replies": [{"body": "Yup. Just trying to make the inverse wsb strat alive.", "score": 2, "replies": [{"body": "It’s alright, just know I wasn’t trying to be a dumbass. Volume/price continuation is common on large moves for big stocks like this, which is why I was discouraging people from buying puts ¯\\_(ツ)_/¯ Hope you avoided this one!", "score": 1, "replies": [{"body": "I may be dumb, but at least I'm also a pussy. Only bought 2 contracts", "score": 2, "replies": [{"body": "Thank god man, and you aren't dumb just ignoring some indicators (that aren't always reliable). I'd rather be a pussy with some money then a broke tough guy.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "TIL the US has 3 billion people", "score": 7, "replies": []}, {"body": "Uhmm your percentage is very off... the US has like 400 million people MAX.", "score": 3, "replies": []}, {"body": "Ok and that's 2b at those numbers. Less than 3% of their yearly revenue.  Not to mention they admitted themselves they won't be profitable with this service until the mid 2020's AND its costing them 1b a year to operate.", "score": 1, "replies": [{"body": "I don't think the value is in the short term.  I think what it does is give them an alternative platform for their content as cable slowly sinks...  They don't need rapid growth, just something viable.", "score": 2, "replies": []}]}]}]}, {"body": "If you bought at market open, you would be up bigly", "score": 12, "replies": []}, {"body": "A true hero. Posting his losses vs the MickeyDickie gain porn.", "score": 8, "replies": []}, {"body": "OP - Please sell these puts, Disney is about to break higher. If you want buy back in later when they're cheaper, don't be any dumber than you already are.", "score": 8, "replies": [{"body": "Disney went up $1 in less than 5 minutes since I posted this. OP abandon ship, don't hang onto stupidity.", "score": 4, "replies": [{"body": "About to rally over $129 and it's not even 1:30 yet.", "score": 2, "replies": []}]}, {"body": "Yea can confirm, even my twitter has some tweets about buying DIS. It's rare for my feed to see big foreign stock talk.", "score": 2, "replies": []}]}, {"body": "Look ma a true austist in the wild.", "score": 4, "replies": []}, {"body": "Was wondering where the losses were. Way to be a sport.", "score": 4, "replies": []}, {"body": "We re playing against each other on opposite courts. I’m buying NFLX calls and hoping for the current patterns to hold till Monday. Godspeed brother", "score": 5, "replies": [{"body": "How do you think this will affect NFLX?", "score": 1, "replies": [{"body": "NFLX is down 6% atm, directly because of the DIS announcement. At 350$ res I think it drops lower tomorrow as DIS moves higher or continues to hold. Further dropping Netflix. Allowing me to load up on cheaper calls. Because I think Netflix destroys Q1 (tues)and throws down the gauntlet coming in at over 150 mill subs in follow up of the Disney announcement", "score": 4, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "Tomorrow is Saturday. It's not going to move at all.", "score": 7, "replies": [{"body": "Agreed. Sorry. Realized I had the day wrong. Thought this was Thursday. So i bought the position. If it drops Monday I’ll double down on it and wait for ER on Tuesday.", "score": 1, "replies": []}]}, {"body": "Take your logic and get out of here. I’m just planning to double down on the position if it drops here, because I’m waiting for ER on the 16th and I think it’s going to be spectacular", "score": 1, "replies": []}]}]}]}, {"body": "Godspeed.", "score": 1, "replies": []}]}, {"body": "This man is allergic to money", "score": 3, "replies": []}, {"body": "iron balls, hope you get paid on these, fuck this massive gap up", "score": 3, "replies": [{"body": "Hoping for that correction on Monday.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "F", "score": 2, "replies": []}]}]}]}, {"body": "What time did you buy that you’re already down 4K?", "score": 2, "replies": [{"body": "10 minutes ago", "score": 5, "replies": [{"body": ":|", "score": 1, "replies": []}]}]}, {"body": "Forgot to include, but these are $128 puts.", "score": 2, "replies": []}, {"body": "We should be allowed to buy calls on your losses. ez m$ney", "score": 2, "replies": []}, {"body": "Would it not be better to buy Monday ready for the gauntlet as opposed to now?", "score": 2, "replies": []}, {"body": "What a fucking autist\n\nLove it", "score": 2, "replies": []}, {"body": "what comes up must come down, right??? right???", "score": 2, "replies": [{"body": "There's no way $DIS is going to be able to keep this momentum up. People will cash out next week. Bears went on vacation this week. They'll be back on Monday.", "score": 4, "replies": [{"body": "yeah, a vacation to disneyland and the feds", "score": 3, "replies": []}]}]}, {"body": "I bought only 1 put for like $200. It will correct itself. But I’m hesitant on it. I already made $9000 from the calls.", "score": 2, "replies": []}, {"body": "ALwAyS iNvErSE WSB", "score": 2, "replies": []}, {"body": " I’d be right there with you,  but Robin Hood is cucking me and won’t let me buy any options due to margin maintenance yesterday", "score": 1, "replies": []}, {"body": "F", "score": 1, "replies": []}, {"body": "I am with u on this one. IMHO it will dip before another rally.", "score": 1, "replies": [{"body": "Monday funday 🙃", "score": 2, "replies": []}]}, {"body": "OP please update.", "score": 1, "replies": [{"body": "I can only afford the walmart frozen food aisle chicken tendies now.", "score": 1, "replies": [{"body": ":( You'll be whole by the end of the week OP.", "score": 1, "replies": []}]}]}, {"body": "Must be a hedge vs shares and you don’t want to pay commissions on it amirite\n\nJk, you’re just autistic", "score": -2, "replies": []}]}
