{"title": "A Closer Look at Ulta, There Might Be Potential", "selftext": "After walking into the ULTA with my girlfriend yesterday, I was blown away at the operation they have going on there. There was a lot of people and I saw it as a possible investing opportunity. So, I went home and looked up the financials. \n\nFirst off I am always a little standoffish about retial stores. And although they have an online presence, they are moslty situated in shopping malls and centers. So that always makes me a little worrisome. Now, if they partnered with Amazon, could be a whole different story. \n\nUlta is interesting because they have signs of, from what I can see, great capital allocation. Large ROE, No dividend (which acceptable with consistanly large ROEs), and No Debt! \n\nBut they do have the margins of a retial store. The gross margins are below 40%, which is the level I like to see. And their net margins are below 10%. \n\nOverall, I like what they are doing capital wise but the margins and the over looming storm cloud of the retial bug will keep me away for now. \n\nHow about you? ", "id": "8q1fjr", "created_utc": 1528643737.0, "score": 24, "upvote_ratio": 0.79, "num_comments": 20, "comments": [{"body": "Check this guy out! He has a girlfriend! ;)", "score": 64, "replies": [{"body": "How does he have money to invest?", "score": 47, "replies": [{"body": "He returned some Ulta products", "score": 18, "replies": []}]}]}, {"body": "You have recency bias. There's Sephora and competition in every other department store. Women love beauty shops so they won't die out completely, but they're not going to boom in sales for any reason, any time soon. Just because a ship is staying afloat, doesn't mean it's a ship worth spending money on. ", "score": 17, "replies": [{"body": "/thread", "score": 1, "replies": []}]}, {"body": "Target and others are coming after ULTA. I like them but use caution", "score": 2, "replies": []}, {"body": "ulta has potential but retail can be so flaky. there are companies like amazon that could take over the cosmetics market and online subscriptions further impacting sales from physical stores. i'd approach with caution.", "score": 2, "replies": []}, {"body": "You’ve missed the run up. And don’t expect it to hit 300+ again. US growth is running out of stores to put. ", "score": 4, "replies": []}, {"body": "Ulta is a very solid company financially.  If I had the money right now and got a good buy point, I'd scoop it up instantly.", "score": 2, "replies": [{"body": "Interesting the slow death of malls doesn't scare you away?\n", "score": 1, "replies": [{"body": "It's not hurting them now for whatever reason.  Same thing with Burlington.", "score": 2, "replies": []}, {"body": "Ulta stores are much less dependent of shopping malls compared to Sephora, its biggest competitor. Their founders actually avoided malls when building the business model. It’s quite visionary, especially when they announced their plan to open at least 100 new stores nationwide this year.", "score": 1, "replies": []}]}]}, {"body": "I do like this stock as they have benefited from the selfie generation but I question what influence Amazon has on the stock price... ", "score": 1, "replies": [{"body": "I think he is referring to moving operations and selling there products on amazon for more business ", "score": 2, "replies": []}]}, {"body": "It’s the Toys R Us of make up.", "score": 2, "replies": [{"body": "Proof that you've never shopped there.", "score": 2, "replies": [{"body": "I stood in there on my phone twice.\n\nIt’s a place you can discover something then buy online for cheaper.\n\nLike Toys R Us.", "score": 2, "replies": [{"body": "Well that's cuz people don't know about Ulta's reward program. One is closing down stores nationwide and the other is opening stores nationwide. One is chopping down jobs and the other is providing more jobs. One is drowning in debt and the other has no debt. ", "score": 1, "replies": []}, {"body": "They have a lot of exclusive products. You're just rambling", "score": 1, "replies": []}]}]}]}, {"body": "Amazon Death Star", "score": 2, "replies": []}]}
{"title": "Break from uni and work to save capital to profit from recession in 2-4 years or keep at uni and hope for geater autism potential in the future?", "selftext": "[deleted]", "id": "8q01dr", "created_utc": 1528627414.0, "score": 0, "upvote_ratio": 0.13, "num_comments": 25, "comments": [{"body": "Easy.  Drop out of college, get a job at your local macdoes and you'll already be doing better than half of this sub", "score": 18, "replies": []}, {"body": "The autism potential is nearing its limit", "score": 13, "replies": []}, {"body": "I really hope you’re not really thinking about this. \nIn all seriousness, stay and get your degree... \n\nKnowledge is what generates money. You’re getting a chem degree which is not a bullshit degree, you can make decent money with it. From what I’ve heard it’s not amazing starting pay, but your income will shoot up with a masters and experience. More importantly it gives you something hopefully fun and rewarding to you to do everyday. \n\nYou’ll make more money with that degree than working any other non-college/trade school educated job. Then you have that money to gamble on stocks since it is disposable income. \n \nI would not trade my engineering degree for $1,000,000 right now. It might seem like a lot, but over the course of your life you’ll make more with a degree and investments from that steady income. I also enjoy my coworkers and it keeps my mind active. Get the degree. \n\nNot having that safety net of an income will also make you trade irrationally and emotionally to try to stop losses or make losses back quickly. Having that higher income also let’s you have greater starting capital so you can take better positions. ", "score": 14, "replies": []}, {"body": "\"An investment in knowledge always pays the best interest\" - Benjamin Franklin   \n\nStay in school.  It is the best time you will ever have.  I have a chemistry degree.  Jobs will be easy for you to find, because everybody drops from chemistry.  Stay away from laboratory settings, as lab chemists have an increased incidence of nasty cancer.  ", "score": 18, "replies": [{"body": "What fields would you recommend working in then?  \n", "score": 2, "replies": [{"body": "See if you can't angle towards computational chemistry. Follow big data buzz words and find ways to ram rod them into your work. That way when you're looking for a job people will ask,\n\n\n\"what qualifies you for this position?\"\n\n\"I used tensor flow to predict the properties of chemical systems, searching for...\"\n\nAnd you won't even get tensor flow out of your mouth before they offer you a 6 figure job.", "score": 13, "replies": []}, {"body": "Hard math. Actuary. Chem. Biology. Data. Cyber security. Become a wind turbine technician and make $35 a year. Stream yourself playing Fortnite with your tits out. Find your muse. Do what works. Kill your wife and bury her in your backyard. Stop looking at me like that. Why do you think I'm paranoid? I need to return some video tapes. ", "score": 5, "replies": [{"body": "Problem is as the more i get into chemistry the more i dislike it. Additionally there are only two main Industrys for chemists in my country lab testing for primary industrys, and drug production nether of which i have much interest in. ", "score": 1, "replies": []}]}]}]}, {"body": "What would be your major ", "score": 5, "replies": [{"body": "Chemistry ", "score": 3, "replies": [{"body": "Youll be able to walk into a lot of jobs with that stem background! Even investment banking.", "score": 3, "replies": []}, {"body": "If you really like trading and want to do it on a daily basis there should be no reason to goto college. Just make sure you’re a consistent trader first ", "score": 1, "replies": [{"body": "As much as i kind of like the idea of trading after a bit \nof reading and research value investing seems to make more cash in the long term so this is the strategy i'm planning to use.  Would you still recommend taking a break?  ", "score": 2, "replies": [{"body": "No, don't be retarded. Finish uni and if you want to trade full time after, trade.\n\nIf trading doesn't work out, you are going to regret leaving uni\n\nI think most of us on this sub have jobs and trade on the side, I know I do", "score": 14, "replies": [{"body": "Trading on a side never ends well. ", "score": 1, "replies": [{"body": "Why? ", "score": 2, "replies": [{"body": "Because you will miss lots of important news, you will not have time/energy to analyse. ", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "College first, yolo later. \n\nJabronis have been calling a market crash, pullback, recession for literally the past 6 years. \n\n\"Until such time as the world ends, we will act as though it intends to spin on.\" -Nick Fury", "score": 2, "replies": []}, {"body": "Do you have a job lined up right now, or is this a theoretical question?", "score": 1, "replies": [{"body": "I have a job lined up (allready working part time and have been offered fulltime)  that pays 20 an hour with the ability to work 60 hour weeks, if i want to and will be getting a 1-2 dollar raise every 3 months. ", "score": 1, "replies": []}]}, {"body": "Why 2-4 years? Maybe its 2-4 months, 2 years is very optimistic and 4 is just madness. Don't even think to leave a university. The amount of money you will save will be miserable and its unlikely you will become a millionaire shorting the stock market. ", "score": 1, "replies": [{"body": "If it’s months you won’t have enough saved. But counting on something that can’t be predicted accurately, what if it takes 6 years and you sit around waiting? Then the value is in quality of life during that time- do you want/need a break from school?\n\nIf you hate college and there’s a job you want to do which has good enough pay and opportunity without degree (..?) THEN it’s a good decision because it could bring fulfillment. But if you *want* to study chemistry and get $$$ job, why not do that?\n\nI was at the house of a retired chemist once.. he had this amazing ranch, a huge woodworking  studio and like.. whatever he wanted obviously. and what’s my point? I don’t think he needed to drop out and invest first. His huge chemist salary set him up for life.", "score": 2, "replies": []}]}, {"body": "I performed work in the environmental chemistry (pollution clean up) field where reviewed documents, performed soil, groundwater, and surface water sampling, and wrote reports. \n\nI also had other careers that involved researching and writing. \n\n", "score": -2, "replies": [{"body": "Sounds boring as fuck", "score": 4, "replies": []}]}]}
{"title": "Can I wear a Goldman Sachs duffel bag if I don't work there?", "selftext": "[removed]", "id": "8q0s12", "created_utc": 1528637229.0, "score": 38, "upvote_ratio": 0.84, "num_comments": 27, "comments": [{"body": "They're all over eBay.\n\nWhat's the desirability factor of an employee at a large investment firm? Just wear a fucking Chipotle shirt: you'll make more friends and impress the same amount of people. ", "score": 57, "replies": [{"body": "[deleted]", "score": 15, "replies": [{"body": "The whole internet at your disposal and only two kinds of duffel bag exist for you?", "score": 71, "replies": []}, {"body": "> adidas or goldman sachs\n\nOh man, ask /r/malefashionadvice which bag is better.", "score": 23, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Almost every post is so full of fucking cringe. Nothing fits and their posing stances are hilarious. Bunch of dweebs. ", "score": 17, "replies": [{"body": "I know right learn how to fucking pose, posers!", "score": 11, "replies": []}, {"body": "They told some guy that women wouldn’t judge him if he wore nail polish and told me I didn’t know what I was talking about when I said they were delusional.", "score": 8, "replies": []}]}, {"body": "worst sub ever, they spend $10K on undies and faded jeans and think they are cool and ahead of curve", "score": 7, "replies": []}]}]}, {"body": "Get yourself something nice.  [Here's some on sale](https://www.ssense.com/en-us/men/sale/duffle-bags).", "score": 5, "replies": []}, {"body": "The gray Adidas one looks way nicer. If you get the GS one it's like waving a giant flag that says you're gay for pay", "score": 3, "replies": []}]}]}, {"body": "I would rather wear a Lehman, Enron or Bear Stearns shirt. Would get more people interested.", "score": 32, "replies": [{"body": "[removed]", "score": 23, "replies": []}, {"body": "JT Marlin for me pls", "score": 3, "replies": []}]}, {"body": "Yeah dude fuck clothes, wear a duffel bag. ", "score": 6, "replies": []}, {"body": "I’d wear Axe Capital.", "score": 12, "replies": [{"body": "Same.", "score": 2, "replies": []}, {"body": "Hell yeah", "score": 2, "replies": []}]}, {"body": "Can you be any less of a genius? Making the rest of us seem autistic and I don't like that. ", "score": 5, "replies": []}, {"body": "Not sure what you plan on doing with it, but people at the airport won't give a damn, nor neither will people at the gym.", "score": 3, "replies": []}, {"body": "only on Chanukah ", "score": 3, "replies": []}, {"body": "Is this not America? You can wear whatever the fuck you want.", "score": 2, "replies": []}, {"body": "Only if it made with plastic and you wear it around your head ", "score": 2, "replies": []}, {"body": "I have some nice leather satchels. One is from banana republic i forget where the otber is from.\n\nHonestly I prefer neon fanny packs. lit af.", "score": 4, "replies": []}, {"body": "I got a GS north face from a wholesaler. It might be weird if someone asked but idc, shits nice. ", "score": 1, "replies": []}]}
{"title": "Smokin' hot PM tendies with $PM", "selftext": "Thinking of going for a synthetic long position on $PM tomorrow. Sell slightly in the money puts and buy at or slightly OTM calls for July expiry. It's near 52 week low, they raised dividend Friday which seems bullish for earnings coming up Jul 20 which is now at over 5% yield, it's started to pop in price short term, at historic support levels currently, etc. Please let me know why I'm gay for making this trade. \nEdit: f'd up the title so that's one in the gay column already.", "id": "8q2hs2", "created_utc": 1528653098.0, "score": 14, "upvote_ratio": 0.84, "num_comments": 18, "comments": [{"body": "My Grandfather smoked his whole life. I was about 10 years old when my mother said to him, 'If you ever want to see your grandchildren graduate, you have to stop immediately.'. Tears welled up in his eyes when he realized what exactly was at stake. He gave it up immediately. Three years later he died of lung cancer. It was really sad and destroyed me. My mother said to me- 'Don't ever smoke. Please don't put your family through what your Grandfather put us through.\" I agreed. At 28, I have never touched a cigarette. I must say, I feel a very slight sense of regret for never having done it, because your post gave me cancer anyway.", "score": 35, "replies": [{"body": "Downvoted for the repost ", "score": -3, "replies": [{"body": "It's pasta, it's supposed to be reposted", "score": 17, "replies": [{"body": "Touche ", "score": 2, "replies": []}]}]}]}, {"body": "The product kills the customer, sounds sustainable.", "score": 2, "replies": [{"body": "They sell other products you know. Like stuff that gets you addicted to being unaddicted, also asian Vapes that burn baby cigarettes.", "score": 0, "replies": []}]}, {"body": "I bought don'some calls on Friday. I'm still new at this options thing. What is your play with itm puts? You think it will go down in the short term? ", "score": 1, "replies": [{"body": "he’s selling puts", "score": 4, "replies": [{"body": "Ahhh read it too fast. Thanks", "score": 1, "replies": []}]}, {"body": "Sell puts to collect premium to offset cost of purchasing calls. Betting stock will go up and I can buy back the puts or they expire worthless.", "score": 3, "replies": [{"body": "yeah I'll buy those puts from you buddy", "score": 2, "replies": [{"body": "How much lower do you think the stock can go with the yield as high as it is for a company with forecasted growth last quarter that just raised dividend Friday? Also it's near 52 week low at historic support level. Shitty products I'm in agreement but I'm just looking at the trade.", "score": 1, "replies": [{"body": "What goes down doesn't necessarily come back up. Not an in industry as dead as tobacco.  Nobody is looking to enter long into this, and anybody who has been long in this stock has to be looking for an exit point.\n\nThat industry is getting fucking destroyed from all angles right now. Vaping, high taxes, marijuana, restrictions on public smoking, and just being unfashionable among young people.\n\nI can't see any sort of sustainable run being made because any spike is going to be a very tempting exit point for anybody who's been long in this stock.\n\nAnd now I've just talked myself into definitely buying puts when the market opens tomorrow", "score": 2, "replies": []}]}, {"body": "I hope you got some after open today", "score": 1, "replies": [{"body": "I did, I'm up 6% so far\n\nI'm getting fucked by MU but at least tobacco sucks", "score": 1, "replies": []}]}]}]}]}, {"body": "How do you feel this afternoon?", "score": 1, "replies": [{"body": "BoA just put out some negative guidance or at least reiterated negative guidance despite some developments in India and the dividend raise. Even though I'd be trading derivatives and not actually purchasing the stock still didn't want to profit off shit that kills people. Part of me rationalized that I'd be taking the profits from the people long the stock but fuck it. Not worth the karma.", "score": 1, "replies": []}]}]}
