{"title": "Weekends are fucking boring", "selftext": "There's nothing to trade. My penny stocks are doing nothing right now, TSLA isn't fucking me in the ass, I swear I'm about to go to a casino to get rid of this tick. What do you degenerates do to relieve yourselves?", "id": "43gcmo", "created_utc": 1454193986.0, "score": 157, "upvote_ratio": 0.93, "num_comments": 117, "comments": [{"body": "what the fuck am I supposed to compulsively check every 5 minutes to destroy my relationships and responsibilities and cause hypertensive crises", "score": 139, "replies": [{"body": "This guy gets it", "score": 36, "replies": []}, {"body": "Futures and Israeli stock market, no?", "score": 8, "replies": []}, {"body": "This guy fucks", "score": 16, "replies": []}]}, {"body": "[deleted]", "score": 114, "replies": [{"body": "This comment brought to you by DraftKings, use promo code YOLO for 10% off", "score": 88, "replies": [{"body": "everyone i know who plays draftkings fantasy gets cheated on by their gf", "score": 48, "replies": []}]}, {"body": "When is the next opportunity to bet against Ronda Rousey. 100% convinced the gon get her ass whooped twice.", "score": 5, "replies": []}, {"body": "Broncos should be able to cover. Carolina has had a weak schedule so Vegas / bettors think they're better than they are.", "score": 10, "replies": [{"body": "Spread was 6. I bet the money line at something crazy like 2.4", "score": 5, "replies": [{"body": "Bovada has alternate lines, one that caught my eye was Broncos -7.5 for a 5.5x payout", "score": 3, "replies": []}]}, {"body": "Denver has one of fastest def i've ever seen, DL & LB particularly. They are athletic enough to make crest white strips throw from pocket, they'll pull it off.", "score": 3, "replies": [{"body": "As long as they lock out the QB run and don't fuck up defending the wildcat I don't see Carolina producing much offense.\n\nI can also see the Broncos D getting into Cam's head [like this](https://www.youtube.com/watch?v=6YZkYXGQDEs)", "score": 3, "replies": [{"body": "me too, he's all smiles when everything is going his way, but doesnt seem like he has the fortitude of a champion.", "score": 1, "replies": [{"body": "Absolutely. I feel like he proved that at Auburn.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "how do i get tested for protective instincts ", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "thats the hottest she ever looked, he should have tried to smash. 0% in savagery.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Horse-racing is still a thing right? \n\nI bet horse-racing whilst on a yacht is a thing?", "score": 4, "replies": [{"body": "Is an horse a athlete?", "score": 8, "replies": [{"body": "You Can Discover Everything You Need To Know About Everything By Looking At Your Hands", "score": 1, "replies": []}, {"body": "Is a horse an instrun mentttt?", "score": -1, "replies": []}]}, {"body": "His mother was a mudder!", "score": 3, "replies": []}, {"body": "What kind of leather are you gonna get on your horse?", "score": 1, "replies": []}, {"body": "Plebs. If you yoloing hard enough you will be the owners of the horses not just betting on them.", "score": 1, "replies": []}, {"body": "On TwinSpires you can bet ~20hrs a day, 7 days a week. Start in Ireland and UK around 5am Eastern, end in Australia around 1-2am Eastern. Occasionally you can get some Hong Kong races too. ", "score": 1, "replies": []}, {"body": "Horse racing can be good if you're good with statistics and have a lot of discipline. You know, I guess it's not all that different from investing.", "score": 1, "replies": []}]}]}, {"body": "Gotta bet on that U.S. politics my man. [Betting on Trump being the nominee.](https://www.predictit.org/Contract/838/Will-Donald-Trump-win-the-2016-Republican-presidential-nomination#data)", "score": 28, "replies": [{"body": "I'm in for Rand Paul in Iowa.... YOLO\n\nhttp://i.imgur.com/R3wO8zg.jpg", "score": 20, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Real", "score": 7, "replies": [{"body": "where are you at ?  gambling on politics in US is illegal i thought.  Otherwise I would have YOLO'd on Obama reelection", "score": 5, "replies": [{"body": "https://www.predictit.org/\n\n\"A project of Victoria University of Wellington, PredictIt has been established to research the way markets can forecast future events\"", "score": 4, "replies": [{"body": "Finally something to replace intrade. ", "score": 1, "replies": []}]}]}]}]}, {"body": "I'm honestly thinking about betting on Bernie winning the New Hampshire caucus. Thoughts?", "score": 2, "replies": [{"body": "It's priced in that he wins NH, something like $100 to win $10.\n\nBetting on HRC in NH is way more yolo.", "score": 5, "replies": []}, {"body": "I'm not up enough on the Democrats game in there to make a suggestion. I have thought about buying Sanders for giggles.\n\n", "score": 7, "replies": [{"body": "> Austrian economics, predicting Rand Paul winning Iowa\n\nDo you know anything about anything? Serious question.\n\nEDIT: [Found my answer.](https://www.reddit.com/r/financialindependence/comments/41kns1/how_do_you_view_your_career/cz54jtw)\n\nEDIT 2: If you think Rand fucking Paul, who's polling at **5%**, is going to win Iowa, I can only assume you live in Flint and are still drinking the tap.", "score": 30, "replies": [{"body": "Zing.", "score": 5, "replies": []}, {"body": "Look, someone stalking me on reddit. I'm flattered! Don't get too jealous of me now \n\nFyi fag the point of this sub is the yolo, feel free to partake or gtfo. See you on the moon", "score": -3, "replies": [{"body": "Dull, ignorant, AND slow witted. The rightwing trifecta!", "score": 1, "replies": []}]}]}, {"body": "New Hampshire polls:\nBernie Sanders 58%\nHRC 38.6%\n\nMaking a bet on Bernie Sanders winning NH is a bit more than a shiggles play, dude is rolling in the polls there and Vermont is his home turf. ", "score": 1, "replies": []}]}, {"body": "Good possibility.", "score": 2, "replies": []}]}, {"body": "Oh boy. You need to start predictitbets", "score": 0, "replies": []}]}, {"body": "Can I short people? I don't think that the republicans will let trump get the nomination. I don't know who will win but I don't think it will be him. ", "score": 7, "replies": [{"body": "Yes, you can specifically bet on Donald Trump not winning the Nomination", "score": 14, "replies": []}, {"body": "Not only can you short the donald but its currently at around 50/50 odds so its pretty good odds in my opinion (predictit anyway).", "score": 2, "replies": []}, {"body": "you're delusional", "score": -1, "replies": []}]}, {"body": "Oooohhh this looks promising\n", "score": 2, "replies": [{"body": "Except there's an $850 limit per \"bet.\" Not exactly big money to be made, unless it's in lieu of your RH account, of course.", "score": 5, "replies": []}, {"body": "im ACTUALLY UP ALMOST 90%\n\nAND IM NOT LOWER CAPSING THIS BITCH BC ITS ALREADY TOO LATE", "score": 3, "replies": []}, {"body": "Makes sense. In all probability, he's going to win Iowa. Once that happens, it would be surprising if it didn't go up at least a little.", "score": 2, "replies": [{"body": "Trump might not win Iowa. His state director is a friend of mine and they have literally 0 ground organization last time we talked (~2 weeks ago?). \n\nCruz tripped on his cock in the last debate without Trump to fight against even though he has a great ground game there I am doubtful. Rubio really shined. Rubio also got 2nd place with the youth straw poll. \n\n40% of Iowa voters said they would be willing to change their votes during the caucus based on speaker skill. ", "score": 1, "replies": [{"body": "lol you got downvoted for making a valid point, sorry that happened\n\nI'm glad I didn't bet on Trump!", "score": 2, "replies": [{"body": "He is going insane because he hired business people to run the ground game not political ones. Fucking hilarious. ", "score": 2, "replies": []}]}]}]}, {"body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/slatestarcodex] [In all probability, \\[Trump's\\] going to win Iowa. - \\/u\\/chaosmosis](https://np.reddit.com/r/slatestarcodex/comments/44hur0/in_all_probability_trumps_going_to_win_iowa/)\n\n[](#footer)*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*\n\n[](#bot)", "score": 1, "replies": []}]}, {"body": "Smart man.", "score": 2, "replies": []}, {"body": "Fucking WA state man. Can't even use predictit.org? Weak. ", "score": 1, "replies": []}, {"body": "I'm all in for Cruz.  Let's hope it pays off.\n\nLet me just say, buh since jeb in SC while it's cheap.  I think that's the state he starts being taken seriously again.", "score": 1, "replies": []}, {"body": "It will be Rubio. ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 48, "replies": [{"body": "IVE BEEN DRINKING SINCE 10 AND JERKED OFF TWICE", "score": 53, "replies": [{"body": "That's impressive that you\n\n1) Started drinking at the age of 10 and\n\n2) Only jerked off twice in your life. ", "score": 18, "replies": [{"body": "you sound like an ex gf", "score": 11, "replies": []}]}, {"body": "twice?  noob. ", "score": 6, "replies": []}]}]}, {"body": "bitcoin 100x futures at bitmex.com and ether shorting on poloniex.com", "score": 16, "replies": [{"body": "> bitmex.com\n\nIt wont let me trade bc Im in america, is there any workaround?  Whats the risk if i put a diff country?", "score": 1, "replies": [{"body": "Okcoin.com 20x. 796.com 50x", "score": 2, "replies": []}]}]}, {"body": "Fucking research....loads and loads and loads of it. Confirm your picks, find new ones, study the overall market and global news....", "score": 17, "replies": [{"body": "This is normal advice, go away. Rephrase it to \"watch my tim sykes dvds\" and you can stay.", "score": 25, "replies": []}, {"body": "Stz was one I just found.", "score": 2, "replies": []}, {"body": "APPZ to the moon!", "score": 1, "replies": []}]}, {"body": "Honestly, I'm about to drive to a casino to play in a small poker tournament. You nailed it on the head.", "score": 17, "replies": []}, {"body": "Tinder, OkCupid, and POF. Fuck em for sport.\n\nYou should never have to sleep alone, only if you want to.", "score": 15, "replies": [{"body": "I thrash in my sleep like a blender, it's really unfortunate guys I invite over", "score": 4, "replies": [{"body": "Donkey Punches man.", "score": 2, "replies": []}]}, {"body": "What if OP has herpes :(", "score": 2, "replies": [{"body": "Ribbed for her pleasure.", "score": 10, "replies": []}, {"body": "setup a short position with chick", "score": 1, "replies": []}]}]}, {"body": "Also when do I get fancy flair claiming I have autism or something?\n\nEdit: I'm pretty damn drunk", "score": 11, "replies": [{"body": "People who are autistic can't tell. \n\nHere to help.", "score": 8, "replies": []}]}, {"body": "Invest in Asian markets. Cuts the weekend down by 12 hours!", "score": 11, "replies": [{"body": "how would one do that from the Americas", "score": 1, "replies": [{"body": "Most brokers that don't start with the words \"Robin\" have access to international exchanges like Tokyo, London, Hong Kong, etc.", "score": 5, "replies": [{"body": "MMMmm i've only used Zecco / TradeKing/ Robinhood / Schwab so maybe that's why I didn't realize it", "score": 1, "replies": []}]}]}]}, {"body": "Rock climbing", "score": 4, "replies": [{"body": "Never been outside thou", "score": 8, "replies": []}, {"body": "Cock climbing? ", "score": 0, "replies": []}]}, {"body": "bet race horses", "score": 3, "replies": []}, {"body": "Bro's, yall need some hobbies or some shit, there's no reason obsessing over it on the weekend. Try some archery, not much recurring cost unless you break shit. Or fishing, from the shore anywhere you can, I prefer ss yololmao my sturdy vessel. Read all the things. And play poker, casino house rake is 5 max on a 1-2nl, stay tight aggressive and take down hands", "score": 3, "replies": [{"body": "My hobby is fixing people's grammar. YOLO, my bro's!", "score": 2, "replies": []}]}, {"body": "You could.. get into murders and executions..", "score": 2, "replies": []}, {"body": "Try some commodities/futures. Most trade 24/7. Forex trades 24/5 so you still can't do that on a weekend.", "score": 2, "replies": [{"body": "Can't you trade forex on other markets, so there's only a few hours on Sunday you can't trade?  Otherwise, bitcoin is 24/7", "score": 1, "replies": [{"body": "All I know is that on FXCM I can't trade from Friday afternoon to Sunday afternoon. You can't even put in orders for execution when trading resumes. Other than that it's 24 hours per day.", "score": 1, "replies": []}]}]}, {"body": "there's some easy money here\nhttps://www.predictit.org/", "score": 2, "replies": [{"body": "Ya, no \n\n\"Note: There is no fee to deposit funds into your account. Withdrawals are subject a 30-day holding period after your initial deposit and a 5% processing fee. We do not store your credit card information.\"", "score": 13, "replies": []}]}, {"body": "bovada.com", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "What do you guys use it for? Poker? Sports betting?\n\nI used it once for poker since you can't play in WA and it froze my card bc of the charges to China.", "score": 1, "replies": [{"body": "Carbonpoker.ag I use my cards (credit and debit) and they never completely freeze my acct. They may call or email asking if I made the transaction but they never freeze it. Alot of US players in there. Instant funding. Everything from no limit hold em to sports betting.", "score": 1, "replies": []}]}]}]}, {"body": "I replay old data to pratice my trading.", "score": 1, "replies": [{"body": "What do you use for that?", "score": 2, "replies": [{"body": "Ninjatrader", "score": 1, "replies": []}, {"body": "thinkback", "score": 0, "replies": []}]}]}, {"body": "Give me your money and I might give it back.", "score": 1, "replies": []}, {"body": "Trade Bitcoin futures. Okcoin 796 bitmex", "score": 1, "replies": []}, {"body": "im with you man im headed across the border to oklayolo and putting it all on black", "score": 1, "replies": []}, {"body": "Trade forex. You'll never go bored.", "score": 1, "replies": [{"body": "You will on Saturdays and most of Sundays", "score": 1, "replies": []}]}, {"body": "You already said it : I go to a casino. Blackjack is way better odds than playing $AMDA or even fucking $UVXY these days for that matter.", "score": 1, "replies": []}, {"body": "trade bitcoin, thats open on weekends.", "score": 1, "replies": []}, {"body": "dream of the life you'll lead after your yolo works out\n\nnow go to all that shit and pay for it monday with risky trades", "score": 1, "replies": []}, {"body": "Trade crypto currencies. It never stops http://coinmarketcap.com/currencies/", "score": 1, "replies": []}, {"body": "fuck around with crypto currencies", "score": 1, "replies": []}, {"body": "that's what Casinos are for.  YOLO all weekend bro", "score": 1, "replies": []}, {"body": "If you had money you would spend it on weekends pleb ", "score": 1, "replies": [{"body": "But I have to have money to spend money to make money", "score": 1, "replies": [{"body": "You don't have enough for both activities ", "score": 1, "replies": []}]}]}, {"body": "Compulsively checking email, reddit, facebook, and my tire pressure.  And jerking off a lot.", "score": 1, "replies": []}, {"body": "Trade crypto currencies", "score": 0, "replies": []}]}
