{"title": "Is it worth investing in stocks with only $1000?", "selftext": "I been watching the stock market for a year now and have been wanting to invest. My question is should I bother investing 1k or do I need to invest more money. My dad tells me I should invest my 5k, but I rather save that for when I transfer from cc, which will be soon. I don't care how much I make off the market as long as its profit.  I am a college student so for me 1k is what i am willing to risk or lose. My goals are to buy around this time and sell like later down the year. It would be like a long-termish investment. Also what's the best trade website I should use? I was thinking of Merill Edge.\n\n Those wondering what stocks I'm looking at: Solar city, apple, bank of america, Tesla, hp (both its stocks), T-Mobile, Macy's, agthx, Qualcomm, Ferrari, Intel, Honda, Volkswagen, fb, gmc, Microsoft, Macy's, southwest, etc\n \nPLEASE NOTE: I am not gonna invest in ever single one of these rather a select few.", "id": "4276xb", "created_utc": 1453491837.0, "score": 34, "upvote_ratio": 0.84, "num_comments": 109, "comments": [{"body": "Robinhood is a free trading app. Dont use anything else if your a college kid. Im a student as well and I'm only investing $500 and its super easy to use. Don't have to deal with all the bullshit.", "score": 30, "replies": [{"body": "Can you talk more about this?", "score": 6, "replies": [{"body": "https://www.robinhood.com/about/\n\nCan anyone else vouch for this?  I'm kind of hating myself right now for not knowing about this.", "score": 7, "replies": [{"body": "Yeah I can vouch for it. The downsides I've noticed:\n\n1. Sales and deposits take 3 days to clear.\n\n2. All trading must be done on the app.\n\n3. No research available (I have other avenues to I don't mind this much. \n\nBenifits\n\n1. Free trades", "score": 12, "replies": [{"body": "sales ALWAYS take 3 days to settle in cash accounts; not a downside to robin hood ", "score": 9, "replies": [{"body": "[deleted]", "score": 17, "replies": [{"body": "They are actually in the process of rolling out Robinhood instant, which as far as I understand is free for everyone and they loan you up to 1k for you to use as your funds settle. ", "score": 4, "replies": []}, {"body": "[deleted]", "score": -6, "replies": [{"body": "No, it is not freeriding.", "score": 4, "replies": []}, {"body": "It's only free riding if you sell it before the funds settle. In Merrill Edge, I can buy with unsettled funds right away but can't sell the shares I just bought until the funds from the sale clear. I consider this a significant advantage over RH (but generally not as significant as the $7 ME charges per trade, so I end up using RH).", "score": 3, "replies": []}, {"body": "No. This is called a proceeds transaction.", "score": 0, "replies": [{"body": "maybe where you trade, but thats not an industry term", "score": -2, "replies": [{"body": "I'm S7 licensed in the last 12 months. It's verbatim FINRA's terminology.", "score": 4, "replies": [{"body": "im S7 licensed 9 years and 24 for 8.  it may be on the tests (i think i saw it in my series 55??) but nobody uses that term.  i think it is oddly specific to trading something out to purchase something the dealer makes a market in, but i cant remember my 55 i was drunk.", "score": 1, "replies": [{"body": "It literally refers to selling a security and using the proceeds to fund the purchase of another security in the same day.\n\nIf you work somewhere where brokers are doing a lot of transactional business, you'll hear the term thrown around constantly because they're trying to circumvent the 5% rule.", "score": 1, "replies": [{"body": "post a link that says that.  i worked options/daytrading service desk 6 years nobody called it that.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "With other brokers, I can buy with unsettled funds right away but can't sell the shares I just bought until the funds from the sale clear. I consider this a significant advantage over RH (but generally not as significant as the $7 Merrill charges per trade, so I end up using RH).\n\n", "score": 2, "replies": []}, {"body": "With my brokers (2) I can trade and withdraw cash balances from trades at market close. Not sure how it is with others. But for that reason, robinhood has a large shortcoming for me. That and it's not offered in my Country...", "score": 1, "replies": []}]}, {"body": "Robin Hood is very limited besides just research.\n\nYou can only trade stocks long.\n\nBut it's what I currently use and very good for starters.", "score": 1, "replies": [{"body": "You can trade ETF's that short the market. ", "score": 5, "replies": [{"body": "Yeah good point", "score": 1, "replies": []}]}]}, {"body": "can I trade options with it?", "score": 1, "replies": []}]}, {"body": "I've been using it and it's way simple. You'll definitely want to open an account with another broker like TD Ameritrade for the research benefits, though.  ", "score": 2, "replies": [{"body": "I have a TDM account so I do have the research benefits. Is there any downside to using Robinhood as well?", "score": 1, "replies": [{"body": "I'm no expert since I've only been using it for a little over a week but it is just a mobile app which really limits your ability to do much other than links to news stories and quotes. It just has a few basic transactions as well. No calls, puts, or options. ", "score": 2, "replies": [{"body": "Oh ok thanks for the help. It seems good for just getting the basics down though. Once you are spending more money, a $10 flat fee isn't that bad and you can go to TDM or somewhere else.", "score": 1, "replies": [{"body": "Yeah, I just put $10 on my robin robinhood account just so that's it's my real money and I get a feel for how things really work. Using paper money on think or swim was too unrealistic with 200k to invest. $10 will only really let me buy penny stocks which everyone on this sub seems to hate but if I lose it all it doesn't matter since it was only $10. I actually made a 40% return on my $10 this week though. Haha \n", "score": 0, "replies": [{"body": "What did you invest in to make a 40% gain. That's pretty good for penny stocks. They usually crawl or drop", "score": 2, "replies": [{"body": "I invested in one of reddits most hated stocks. GBSN. I rode it from about .20 to .29 ", "score": 1, "replies": []}]}]}]}, {"body": "It doesn't automatically reinvest your dividends.  You have to manually do it.", "score": 1, "replies": []}]}]}]}, {"body": "I am a little late to this thread, but I use robinhood and have been using it for the past 6 months. I am extremely new to buying stocks myself but so far RH has been very user friendly and quite straight forward. I have not tried to sell anything yet so cant say much about that and the other comments about not being able to use unsettled cash is true. The graphs tracking the stocks are not very good though and extremely basic.", "score": 1, "replies": []}]}, {"body": "Robinhood is great especially if you're just learning. I have a very small amount invested much like you, investing small is an excellent low stress way to learn how everything you've read gets applied in the real world. ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I haven't received any tax forms from them. Lucky for me you only pay taxes on gains. :(", "score": 7, "replies": [{"body": "And tax breaks for losses", "score": 2, "replies": []}]}, {"body": "their clearing firm makes the 1099s, and they usually fuck a whole slew of em up and are slow to correct.", "score": 2, "replies": []}]}, {"body": "I recommend you stay in cash for a little while and see what happens with the market. It's awfully scary right now.. Keep saving more and then use Robinhood to buy no fee ETFs. Keep adding a little bit of money each month and you'll end up a wealthy person one day.", "score": 1, "replies": [{"body": "Yea the whole setup and days thing will take some time. I set it up, just have to wait a couple of business days. Not in a rush to invest. Thanks for the lookout though.", "score": 1, "replies": []}]}, {"body": "Is there a European alternative for Robinhood with little to no commission for small scale investing? (500-1000$)", "score": 1, "replies": []}, {"body": "I will check it out thanks for the input!", "score": 1, "replies": []}]}, {"body": "With that little capital, I suggest using RH. Commissions would eat you alive. Take a look at NVDA if you're looking for growth, RLYP for a YOLO.", "score": 12, "replies": [{"body": "NVDA is on my list, the glory days when it was $18! I'll check Robinhood out,  and that RLYP Stock thanks for the information!", "score": 3, "replies": [{"body": "2nd tip: Dont take stock advice from someone on reddit, or really most places on the internet", "score": 16, "replies": [{"body": "This comment is pretty ironic.", "score": 4, "replies": []}, {"body": "Stocktwits, yahoo message boards, investors hub, all places to stay away from unless you want to buy into their lies and lose money. ", "score": 3, "replies": []}, {"body": "He'll thank me later ;)", "score": 2, "replies": [{"body": "Yeah, they'd be up 8% right now. You're welcome.", "score": 1, "replies": []}]}]}]}]}, {"body": "As long as you keep transaction fees around 1% or lower it's fine. \n\nGotta start somewhere.", "score": 4, "replies": []}, {"body": "Yes. \n\nProbably you're not going to make much money off whatever you buy but the experience will be invaluable and potentially start you on your way to investing more money, hopefully smartly. \n\nPlaying simulated stock portfolios will always be slightly different from playing with actual money because the moves you make will always slightly deviate with that extra pressure. \n\nI say do it. Just to get your toes wet", "score": 9, "replies": [{"body": "whenever someone asks me to help the learn the rules of a sport he didn't grow up playing, i start by having the person bet on a game. even for a small and insignificant bet, the person become so much more engaged and remembers a whole lot more about what is going on during the play. ", "score": 6, "replies": []}, {"body": "Will do, and I agree it is a different ball game. ", "score": 2, "replies": [{"body": "Once you take emotions out of the equation it becomes a lot easier and whole of a lot less stressful", "score": 2, "replies": []}]}, {"body": "what experience is he really going to get? He's going to put in a couple market orders, most likely, hold the stocks for about a year as he said, then sell. Really not the most complicated thing in the world. ", "score": 1, "replies": [{"body": "During that time, hey might check in on the financials of his investment.  He might search for news and gain a deep understanding of the companies he holds stock in.  I think it's worth it.", "score": 1, "replies": [{"body": "I agree , if he does all that it's worth it... Assuming for some reason he doesn't get a huge loss on this investment. If he's just buying and holding for months though, literally doing 1 buy order and 1 sell order. Yeah, that's honestly not much experience at all. ", "score": 1, "replies": []}]}]}]}, {"body": "It is worth starting, from a learning standpoint.  It's a whole different ballgame when you actually have skin in the game.", "score": 4, "replies": [{"body": "Very true thank you!", "score": 1, "replies": []}]}, {"body": "Does anyone have any advice for someone that can't use Robinhood?\nI'm up in Canada. ", "score": 3, "replies": [{"body": "Questrade is 5$ per trade. Some others have similar fees, just avoid the banks, they charge much more.", "score": 3, "replies": []}]}, {"body": "totally acceptable and I do it pretty often when I know the stock has lots of movements (swing trading) if I see a pattern then I may go in for more", "score": 2, "replies": []}, {"body": "I had an extra $500 that I had sitting in my savings and I've always wanted to try my hand at stocks. Did a ton of research and found a reputable energy company. I've made $160 in three days off my $500 thus far. I'm not looking to \"get rich quick.\" Just wanting to see if I can make a little something with money that wasn't doing anything but sitting around. I'm using Robinhood on my iPhone. \n\nLong story short, if you have it available and you would be ok with completely losing all of it, why not. \n\nNGL is the stock by the way. Check them out.", "score": 4, "replies": [{"body": ">  I've made $160 in three days off my $500 thus far.\n\n**disclaimer**: *results not typical*", "score": 18, "replies": [{"body": "That is 100% correct and I don't mean to convey it as otherwise. I just wanted to point out to OP that he still has the opportunity to make money/learn about stocks, starting off with a smaller sum. ", "score": 2, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "30% return every three days is small potatoes? How come you aren't the worlds first trillionaire?", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "30% return compounded every three days on $500 would make you the richest man on earth by orders of magnitude in under a year. I would not say that is typical.", "score": 2, "replies": []}]}]}]}]}, {"body": "You trust Robinhood? \n\nCurious by the way. ", "score": 1, "replies": [{"body": "Robinhood is good app is you want free commission. The only problem is the delay between transaction from what i heard.", "score": 5, "replies": [{"body": "That's why I stick to limit orders and never market. That way I know what I'm paying and any blip or change that happens isn't going to screw me into suddenly buying higher than I wanted or selling at a loss on accident. ", "score": 1, "replies": []}, {"body": "My buys and sells go through in less than 3 seconds ", "score": 1, "replies": [{"body": "As far as the transaction goes, they are fine. But the purchase dates and settlement dates on the statements are taking way longer to process. I sold some shares back on December 23rd to offset gains for tax purposes, but they were not on my December statement. Hopefully they will be reflected on my 1099 for 2015 or else I will pay some extra taxes.", "score": 1, "replies": []}]}]}, {"body": "For someone who is just getting into the game like myself, it's a decent option. I use lots of other tools for research and comparison but I use RH for trades. ", "score": 3, "replies": []}]}, {"body": "I will Checkout Robinhood and that stock. Thanks for the info!", "score": 1, "replies": []}, {"body": "160 in three days, Jesus how much was the stock per share ", "score": 1, "replies": [{"body": "It was $8.46 at the time and is now $12.21. ", "score": 1, "replies": []}]}, {"body": "If you made $160 on $500 in three days, you are taking on LOADS of risk.  ", "score": -6, "replies": [{"body": "Take a look at NGL. They're selling low because of oil but are very reputable. I'll attach a screenshot. \n\n\nEdit \nhttp://imgur.com/smep5sF", "score": 3, "replies": [{"body": "Wow", "score": 1, "replies": []}]}, {"body": "That's a 30% move in 3 days.  He wasn't buying low risk stocks", "score": 2, "replies": [{"body": "I bet he wouldn't say that.", "score": 1, "replies": [{"body": "Well he's obviously a market guru at this point.  I'll put up a market order to buy what he's selling", "score": 2, "replies": [{"body": "I'm not making fun.  It's just when you put in a winning order, you do think you're a guru, but something that goes up that quickly can go down even faster.  Just trying to make a point here.", "score": 2, "replies": []}]}]}]}, {"body": "Oh man, you're making more money than I am, you're being way too risky!  Jealous idiot.", "score": 2, "replies": [{"body": "I am many things.  Jealous of $160 isn't one of them.", "score": 5, "replies": []}]}, {"body": "Uh no. That's not how that works. Large price jumps don't strictly occur on high risk stocks. They can occur on nearly anything. ", "score": 1, "replies": []}]}]}, {"body": "Yes! I started with $1K. Use Robinhood app to avoid trading fees and pick something reasonably priced. I originally invested in ATVI when it was at ~$18 a share. F right now is ~$12 a share. Stocks like that which are solid and yet not expensive. I would've loved some DIS but with the amounts I invest, I wouldn't be able to purchase much at ~$90-100/share. Just my 2 cents.\n\nEdit: what I originally looked for was a company I was familiar with, had good financials, and was under $35/share.", "score": 2, "replies": [{"body": "I'll check out Robinhood, thanks for the input. Yea i will look at companies around that range as well.", "score": 2, "replies": []}]}, {"body": "Ira and Roth ira are free for trading in etrade", "score": 1, "replies": []}, {"body": "Investing, yes. Trading, no", "score": 1, "replies": []}, {"body": "I've been using Robinhood for my $100 Christmas money. So far I'm up $50 in 2 weeks. It requires a lot of research on my end, but it's working out well.", "score": 1, "replies": [{"body": "Where do you primarily research? That's a great return.", "score": 1, "replies": [{"body": "Google and my gut. My husband is scared I google \"stocks to \"buy\". I'm not very good at phrasing what I want properly, but it's working. I usually write down 20 signs and add them to my phones basic stock ticker. I look at the graphs and decide which 2 or 3 to buy. After I buy I watch it and set up boundaries for low/high and reevaluate if it starts going up. However, my low stays because I'm unwilling to go down with a sinking ship.  I have no idea what I'm doing, but it's pretty fun. It's at least paying for my Starbucks addiction. I have used half the profit to buy Ford stock for dividends. It's higher interest than my sons savings plan and cheap enough an average person can buy multiple shares. I did learn about Ford and dividends from the subreddit. ", "score": 2, "replies": [{"body": "Wow, you got lucky and seem to be a quick learner at the same time. I've been unlucky with the more ambiguous stocks I've found through Googling for stocks to buy, but I'm glad it's been working for you. I'd tell you to consider investing with more money since a 50% return is phenomenal but not necessarily repeatable. Out of curiosity, which stocks propelled you to a $50 profit?\n\nI lost an opportunity to profit ~50% from Tesla a few months ago since I just held the stock after taking the advice to hold stocks long-term even if they fluctuate in price, but I regret not pouring more money in then selling for the 50% profit.", "score": 2, "replies": [{"body": "Started with WTW I bought at $18 sold at $24. That started the addiction. I got NXTD? at .63 sold at $1.20, GBSN at 0.12 sold at .24, AMDA at .10 and sold at .13, AMD at $1.78 sold at $2.15. I'm missing a few, but our combined order history is an OCD persons nightmare. My son is homeschooled and while I make lunch his job is to watch the market. I give him the prices and he sells for me. The amount of orders is more than I expecte. Sorting through it isn't happening this late at night.                                                                                   I'm afraid to hold on to anything so I understand your fear. I couldn't imagine buying a real stock like Tesla though. To me being able to even buy that is a huge achievment in life.                                      I highly doubt this luck will continue. At this point I'm just trying to see how long it lasts. My husband turned into a competition and I refuse to lose. Sorry for formatting and grammar. I'm on my iPhone and I'm not an expert user.", "score": 3, "replies": []}]}]}]}]}, {"body": "Yes, for educational purposes. If you're just picking a bunch of companies you've heard of and like, you won't get much out of it. If you educate yourself on due diligence, starting with a small amount of money is a perfect way to get started.", "score": 1, "replies": []}, {"body": "Yes, as a learning experience.", "score": 1, "replies": []}, {"body": "Let's see. Realistically, the market is pretty turbulent right now, so if you're lucky and patient, you can expect a swing of 10% or so. That's $100, of which about $16 will be spent on actually executing trades (on e.g. Fidelity). Is it worth it? Up to you. I think it's worthwhile, just for the experience, if you can afford to lose $1000. Then there's the issue of some brokerages having minimums, but I think you can find one which doesn't have a minimum. As to which stocks to pick, if we knew that for sure, we wouldn't be posting here. :-)", "score": 1, "replies": []}, {"body": "Nah. Bitcoin on the other hand.", "score": 1, "replies": []}, {"body": "No, it is not. Commission fees will eat you.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "What are some good ETFs you would recommend? ", "score": 1, "replies": []}]}, {"body": "Even though commissions are the biggest pain in the ass with little capital, using a broker with a good platform works better(for me anyways) at making money.\n\nMost people here are not going to like what I have to say but buying itm options and scalping the underlying stock based on momentum isn't too difficult to make a couple hundred bucks a week with a 1,000 dollars.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "your looking for /r/wallstreetbets fam", "score": 1, "replies": []}, {"body": "I see some people are saying yes, but you wont make much. Here is my story. $1,000 saved from working when I was 13. Dropped it into a penny stock around $.26 and sold it 5 months later at $3.00. 5 months $10K profit. It can happen and does happen all day long. I did the same thing with Facebook when they dropped the ipo and tripled my money in less then a year. Do your research and you could turn that $1,000 into a nice fat retirement fund in 10 years or so. Good luck!\n", "score": 0, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "The price of a stock means absolutely nothing. Your price basis in a stock means something. If you have $100 in a $5 stock and it increases 5%, that's the same as purchasing 1 $100 stock that increases 5%. ", "score": 5, "replies": [{"body": "This. I posted this a few weeks back:\n\n$100 w/1 share with a 2% move is $2. \n$50 w/2 shares with a 2% move is $2 total, or $1 per share. \n$20 w/5 shares with a 2% move is $2 total, or $0.40 per share.\n$10 w/10 shares with a 2% move is $2 total, or $0.20 per share.\n\nThere are loads of great companies, don't get caught up thinking more shares with your budget is better.", "score": 2, "replies": [{"body": "That is a very good point! ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Well obviously, but that's totally besides the point. That's just said because generally a speaking a $1 doesn't have stellar ratios and what not. My statement is just an example of how price basis is what matters in % movements. I'm not talking about risk, volatility, etc", "score": 1, "replies": []}]}]}]}, {"body": "Buy GPRO for all 1k. It's super cheap now. It was 80 in the summer and now it's 10. I'm sure it will go back up to at least 50 by the summer.", "score": -3, "replies": [{"body": "Im going to assume this is sarcasm. There sales are not doing the best, even though they own the market. I want to buy stocks in different sectors", "score": 5, "replies": [{"body": "The veracity of GPRO's downward spiral has been unfounded. GoPro had its second highest revenue quarter in its history in the first quarter of 2015 with revenue of $363 million.", "score": 1, "replies": []}, {"body": "Lol TSLA is in red profit wise yet but it has grown a lot since in IPO. Gopro is at least profitable. ", "score": 0, "replies": [{"body": "GoPro is also losing ground to companies like DJI, Blackmagic, and RED as companies are making smaller, lighter, higher resolution, higher quality cameras. GoPro may eventually recover, but considering that their drone deal with DJI just fell through I'm not sure how soon. Some of their recent products just pale in comparison to competitors existing products and that's not a good sign. The company just doesn't seem to have effective management right now.\n\nDisclaimer: I'm here in /r/stocks as a newbie to learn; I am no expert investor.\n\nSource: I work in the camera business and no one has anything good to say about GoPro right now. They haven't put out a competitive product in a while and what I've seen upcoming looks weak.", "score": 1, "replies": []}]}]}]}]}
{"title": "Well, this is going to suck.", "selftext": "[deleted]", "id": "425q7j", "created_utc": 1453472773.0, "score": 89, "upvote_ratio": 0.92, "num_comments": 197, "comments": [{"body": "My puts are worth 2 cents... ", "score": 38, "replies": []}, {"body": "This is why I love selling puts. Sold 181.5 puts on spy yesterday. The theta and IV crush has them valued at half a cent now. No need to play market direction just the volatility. I'll be eating my words when one of these times the black swan just dicks me ", "score": 19, "replies": [{"body": "Naked?  That's so risky right now, well done.", "score": 10, "replies": []}, {"body": "You called?", "score": 1, "replies": []}, {"body": "You trade like a winner.", "score": 1, "replies": []}, {"body": "Couldn't you avoid getting ass raped by the black swan by buying the underlying and then selling puts like they're going out of style?", "score": -1, "replies": [{"body": "that's the same directional play, so no", "score": 2, "replies": [{"body": "My mistake, I meant shorting the underlying. ", "score": 1, "replies": []}]}]}]}, {"body": "Welp, I'm done with stocks/options for a while. That just took out what I had left.", "score": 20, "replies": [{"body": "Did you sell? Bro, IV right now will make your shit worthless. See what the day brings. ", "score": 4, "replies": [{"body": "Yeah I sold, they were 186 puts that expired today. I fucked up the other day, they were worth so much when SPY bottomed around 182.xx but it would have been my 4th day trade that week so I held.", "score": 8, "replies": [{"body": "Ah shit bro.. That's a bad situation. You got hit with the IV though. ", "score": 4, "replies": []}, {"body": "If you trade on a cash account you can have as many day trades as you would like. Options settle next day so it's the best way to do it.", "score": 2, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Not on cash accounts, PDT only affects margin accounts. My personal account is a cash account for this very reason.", "score": 4, "replies": [{"body": "Or just get limited margin approval and trade your heart away", "score": 1, "replies": []}, {"body": "I don't think that's true. I'm not on a margin account and still got flagged once. ", "score": 0, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I said sorry, they said it's OK, but don't do it again unless you can have an account that is in line with PDT requirements. ", "score": 3, "replies": []}, {"body": "You have to ask the broker to unflag your account. If it happens too many times you are locked out of trades for I believe 45 days.", "score": 2, "replies": [{"body": "I believe my TDA notice said 90 days or getting a 25k balance. They do a one time courtesy unflag though.", "score": 3, "replies": []}]}]}, {"body": "I have no idea why you were flagged. I use OptionsHouse and have never had a problem placing 10-20 trades in a week. \n\nIf you google it, you'll find that the law does not apply to cash accounts, however it may be different at different brokerages? ", "score": 3, "replies": [{"body": "Weird. I use Schwab and got a call from them after 3 day trades. ", "score": 4, "replies": [{"body": "That's odd, it could be a Schwab rule but I have never been notified by OptionsHouse for any day trades on my cash account.", "score": 1, "replies": [{"body": "You know, I only use Schwab because my checking account is linked with them and I've already been approved for the trading that I do. Is optionshouse a platform worth switching to? I've heard their rates are hard to beat, but their interface has been slacking when they merged with the other company. I'm on the fence between them or TD for the platform. I pay something like 10 bucks a trade and then a couple cents per contract with schwab. ", "score": 1, "replies": [{"body": "I think that OptionsHouse's platform gets ripped to shreds for invalid reasons. While I do believe that TOS is many times superior, I pay 4.95 per trade and .50 per contract on options and 4.95 flat rate on equity transactions. I definitely was drawn in for the rates and stayed because the platform is more than acceptable.\n\nIf you wanna check it out for yourself you can make an account and not fund it but still be able to demo the platform in paper trading. TOS has the same option if you want to compare the two. ", "score": 1, "replies": []}]}]}]}]}, {"body": "It is very true. ", "score": 1, "replies": []}]}]}, {"body": "Am I missing something here, why are you not allowed to day trade? Are you forced to hold long or something? ", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": ".. and apparently only in the states.", "score": 2, "replies": [{"body": "So pattern day trading is fine in the UK?", "score": 1, "replies": []}]}]}, {"body": "You have to have a much higher minimum balance, depending on broker but usually 25k, for a day trading account.", "score": 2, "replies": [{"body": "So if I only have 2 to 5k in an account, then what are my options? I can still buy a stock at the beginning of a day and sell by the end on an upswing right? But the difference between my account and a fay trading is the 3 days to settle?\n", "score": 1, "replies": [{"body": "It's FINRA mandated for risk management, [wikipedia explains it](https://en.wikipedia.org/wiki/Pattern_day_trader). \n\n>I can still buy a stock at the beginning of a day and sell by the end on an upswing right?\n\nIf you do this more than 4 times in 5 biz days, you will be flagged as a day trader, and account will be marked as such, requiring 25k balance.", "score": 3, "replies": [{"body": "Ok thanks for the info. I didn't know that at all. So my account is basically classified as a long account or something? Like almost bearish to an extent?", "score": 1, "replies": [{"body": "Not sure what you mean by that.\n\nThere are a few other people talking about a cash account.  I'm actually not sure what that entails, as I've only had margin accounts which is what a broker will typically set you up with.\n\nEdit:  Sorry I've been a little confused as well as I don't trade equities which have a settlement period.\n\n[Tradeking has a little on day trading in a cash account](https://www.tradeking.com/faqs/trading/cash-trading#buyselltime)", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "Pretty sure you still need 20k", "score": 0, "replies": [{"body": "You don't and the margin requirement is 25k.", "score": 2, "replies": []}]}]}, {"body": "Consider it a learning fee.", "score": 1, "replies": [{"body": "Tip: don't try and actively trade while you're on vacation doing things", "score": 2, "replies": []}]}]}, {"body": "Hey one can you explain what exactly happened to OP?\n\nHe bought puts, IV went up, so their values should go up, no?\n\nI'm confused ", "score": 1, "replies": [{"body": "I'm the OP. When you have Puts and the price skyrockets, your value instantly drops..hard.  If the price of the underlying drops very fast, the put value will increase more than if it was a slow move. Hope that helps. ", "score": 1, "replies": [{"body": "Ah. Thanks I'm aware of options I just didn't know what happened. \n\nDid the underlying go up? Was it theta decay? What caused to lose money.", "score": 1, "replies": [{"body": "Yes.. SPY went way the fuck up.  Use Google.", "score": 2, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "I had about 3k last Friday. So not enough to cry about it.", "score": 3, "replies": []}]}]}, {"body": "[It can only get better from here, right??](http://i.imgur.com/4HxEbLO.png)", "score": 10, "replies": [{"body": "Ah fuck. Maybe if you buy 2k contracts now it'll even out.", "score": 7, "replies": []}, {"body": "That's what happens when you're a sheep. ", "score": 0, "replies": [{"body": "Considering I'm still massively in the green thanks to my foray into put options, I'm quite happy with things overall.\n\n", "score": 8, "replies": []}]}, {"body": "Someone is gonna have to wack Obama for that to turn green ", "score": 0, "replies": []}]}, {"body": "You know what the worst fucking part is. Amazon apple and other huge fuckers have their earnings next week. Could keep this mother fucker going till the end of the month. \n\nMy asshole is too far gone to decide what to do. ", "score": 14, "replies": [{"body": "Yup.. It's like you don't want to eat this loss because it looks horrible.. But, it could even get worse. Haven't decided yet either. ", "score": 8, "replies": [{"body": "Amazon earnings are going to detonate the market.. we rally now and maintain support.. thursday night they report.. friday and the following week we go down fucking hard.. im telling you.. amzn the world's most favorite company is going to disapoint and the market is going vomit.", "score": -5, "replies": [{"body": "How would they disappoint? ", "score": 10, "replies": [{"body": "I might be completely guessing here, but margins on Amazon Web Services might not meet expectations. Microsoft cut prices on Azure recently, there might be signs that the cloud is overbuilt. ", "score": 6, "replies": [{"body": "That would be lovely.", "score": 7, "replies": []}, {"body": "Absolutely!!..not only that but there entire aws is built on sillicon valley start ups that are going to crash an burn.. aws is a turn and burn commodity that requires new companys to buy the space from all the old start up that go out business... how many large companies use aws.. my guess is none and  its all start ups with vc funding", "score": -4, "replies": [{"body": "Doesn't Netflix use AWS?\n\n\nYes.  [Yes they do](https://aws.amazon.com/solutions/case-studies/netflix/)", "score": 9, "replies": [{"body": "https://aws.amazon.com/solutions/case-studies/?nc2=h_ql_ny_livestream_blu\n\nYeah, looks like all silicon valley start ups.  Adobe, Novartis, Dow Jones, NASA.  Not to mention like 500 other gov't entities that rely on AWS.  \n\nShorting AMZN generally has been a terrible play if you look at past history.  ", "score": 6, "replies": []}]}, {"body": "Hey now, my blog is on aws.  And my analytics report doubled this past week, from 8 page views to 16.  Granted half of the new 8 are russian spam sites but come on, double!\n\nMy bill for this huge burst of new traffic from aws will be in the tens of cents.", "score": 7, "replies": []}, {"body": "AWS is used by a literal shit ton of small-to-medium sized companies. ", "score": 5, "replies": []}, {"body": "Holy shit there is so much wrong with this post...get ready for that ban", "score": 3, "replies": []}, {"body": "Man you are so wrong.", "score": 3, "replies": []}, {"body": "Increasingly aws is being used by large institutions for more and more things. No one wants to run their own hardware if they can help it. ", "score": 2, "replies": []}]}]}, {"body": "NFLX earnings were great and still tanked. You could argue that it was because the market was tanking but they're not at pre-earnings even with this bounce. The momo seems to be dying.", "score": 5, "replies": [{"body": "exactly!", "score": 2, "replies": []}, {"body": "Yeah, Netflix has been pretty weak the last month already. Definitely the weakest out of the FANG stocks anyway..", "score": 1, "replies": []}]}, {"body": "They disappoint me all the time by earning $200M and having a market capitalization of $350B.  I know, I know, it's all about growth and the future and blahblahblah options blahblah - but, seriously.  They're way overvalued.", "score": 5, "replies": [{"body": "Yeah, but people love them both as a stock and as a company. A lot of owners are customers too. ", "score": 3, "replies": [{"body": "No doubt about that, dude.  That'll only get you so far.  And by \"so far\" I mean less than a $350B market cap.", "score": 3, "replies": [{"body": "greater fools theory\n\n", "score": 2, "replies": [{"body": "Always in play.", "score": 2, "replies": []}]}]}]}, {"body": "Nonsense, destroying an old industry takes years of investment. Amazon is taking on dozens of markets giving them a few decades isn't asking too much. I'd be more concerned if they show a massive profit... means they aren't maxing their future potential and I'd consider unloading some commons.", "score": 1, "replies": [{"body": "\"Giving them a few decades\" - now that's funny.\n\nDo you see how much the world has changed in the last decade?  Can you imagine what's going to change in the next TWO decades?  There will be competitors and they will come from all sides with things we can't quite envision yet.  Profits for the new \"few decades\" are already priced in to the stock in any case.", "score": 1, "replies": []}]}]}, {"body": "Retail is dead.. chrstmas was a bust.. 4qrtr gdp will be basically flat.. baltic dry index and transports have crashed... the first card processor to report amex is down in significantly on lower guidence.. if people arent buying things and nothing is shipping and card processors are making less as retail both in stores and online implode then amzn is going to dissapoint in a big way and when the highest flying stock in the index does that it will take market with it..  im 100% convinced and you know im all in on this trade.", "score": 3, "replies": [{"body": "http://www.theverge.com/2015/12/28/10672894/amazon-holiday-sales-2015-devices-record-breaker\n\n\n>More than 3 million people joined Amazon Prime in the third week of December alone, 200 million items were shipped for free to Prime subscribers, and more than two times as many Amazon devices were sold than last year as part of Amazon's 2015 holiday season\n\n300 million dollars in one week for prime memberships lmao", "score": 3, "replies": [{"body": "1 month trail is free. You don't know how many will keep the Prime. ", "score": 2, "replies": [{"body": "A shit load of those people.  Because people are lazy and they don't remember to cancel subscriptions.  Not to mention Prime is like crack if you haven't ever used it.", "score": 2, "replies": [{"body": "There are many frugal people. ", "score": 0, "replies": []}]}, {"body": "It doesn't matter. Are you fucking retarded? Do you think they'll report their net subscribers this quarter? No.", "score": 4, "replies": [{"body": "\n\nAre you fucking autistic? He linked an article to how many subscribers where from holidays\n\n>More than 3 million people joined Amazon Prime in the third week of December alone\n\nGo back to fucking r/all", "score": -1, "replies": [{"body": "I don't think you know how to read, check who I replied to.", "score": 0, "replies": [{"body": "You replied to me ", "score": 1, "replies": []}]}]}]}]}, {"body": "And they'll pay a shitton more than that to meet their obligations of two day shipping, etc.  Has anybody worked out that kind of basic math over there in Seattle?", "score": -2, "replies": [{"body": "Lol.  I'm sure no one has thought of calculating shipping costs.  You're a real pioneer.  ", "score": 9, "replies": [{"body": "Hey, I do what I can.", "score": -1, "replies": []}]}]}]}]}]}, {"body": "AMZN earnings are going to be stellar.", "score": 2, "replies": [{"body": "What makes you think that?", "score": 1, "replies": []}]}, {"body": "Not going to happen man, but might be opportunity to buy back in after. Been meaning to touch base with you...I get the feeling I'm the butt of a joke here, so not as active", "score": 1, "replies": []}]}]}, {"body": "I am really praying on some good Apple earnings.", "score": 2, "replies": [{"body": "Total opposite here. Hoping they get their dick smashed so the entire market crumbles including Amazons earnings. Long term holder on both though. But puts need profit now. ", "score": 2, "replies": [{"body": "I really think that Apple with have acceptable earnings and sky rocket. Apple is actually an underdog right now and I am so hyped for them to release some stupid high earnings figure. I also have 115 calls for Feb that are deep red right now so I may be biased...", "score": 5, "replies": [{"body": "I have some Mar 120 calls that are almost back to even today", "score": 5, "replies": [{"body": "I unfortunately got in a long, long time ago. My cost is averaged to about 1.94 and the calls are at .25...", "score": 3, "replies": []}]}, {"body": ">I really think that Apple with have acceptable earnings and sky rocket.\n\nApple plummets even when their earnings are good though.", "score": 1, "replies": [{"body": "Normally I would agree but I think that right now the expectations are so low that we actually have a chance for a big swing. ", "score": 2, "replies": []}]}]}]}]}]}, {"body": "When wsb is short you go long", "score": 8, "replies": [{"body": "Exactly. Best time to snipe a cheap stock.\n\nMade my papa a lot of $$ with ATNM.", "score": 2, "replies": []}, {"body": "WSB does not influence a single one of my trades.. err, well besides TPIV because resume is the man. ", "score": 0, "replies": [{"body": "Seriously, I boarded the TPIV train for a thousand bucks and I can't even tell you why. ", "score": 2, "replies": []}]}]}, {"body": "Call me retarded, but I avoid being short/inverse as much as I can. I have much more \"luck\" going long than betting the market will go down. ", "score": 4, "replies": [{"body": "Well, the bull market is nearly seven years old. It has gone up more than it has gone down. If you go short, you better get your timing right. Really right. ", "score": 3, "replies": []}, {"body": "That's because the market has been extremely bullish, and would randomly hit some speed bumps.  I need to clarify, I am not bull or bear on the market as a whole. That's too macro for me to bother with. When I trade options, they are usually just intra-day. I RARELY hold them for more than 24 hours. I just look for movements in relation to fib and s/r lines. More times than not, it's an easy 20% on small moves. On a new laptop so I don't have screenshots of the setups I'm referring to. ", "score": 1, "replies": []}]}, {"body": "Everyone is so convinced we're going to continue lower, like it's a given. It isn't, no matter how obvious it may seem. Everything is oversold right now. We could easily have the same sort of reversal we did after the August downturn.", "score": 7, "replies": [{"body": "You are still looking at it from a micro perspective. Pan out man.. Not oversold ", "score": 7, "replies": [{"body": "The market is one of the few investments providing common people with a return though, so it isn't surprising that it would become progressively more inflated - particularly when their directed 401ks are in vanguard index funds.", "score": 2, "replies": [{"body": "Everyone seems to be forgetting that we're still practically ZIRPin' it right meow", "score": 1, "replies": []}]}, {"body": "No kidding.  We're in a seriously deflationary environment.  Long term, we're headed lower.  IMFO.", "score": -1, "replies": []}]}, {"body": "A bull market for seven straight years will give indications of \"oversold\" no matter what it actually is.", "score": 2, "replies": [{"body": "I know we've crafted a great narrative for overvaluation, global economic slowdowns, etc. But regardless, none of those are actual proof that we're headed towards a more serious correction or recession. We've already had a major pullback, and there's nothing that says that a continuation of the bull market from here is impossible. This correction may just be a correction.\n\nEdit: I'm not totally bullish myself fwiw, but I'm not bearish enough to discount this possibility.", "score": 3, "replies": [{"body": "I'd agree.  I think we're in for a bit of sideways movement in the trading channel.  I think we'll get up to ~2000 on the S&P, but then we come back down and test this resistance again.  ", "score": 1, "replies": []}]}]}]}, {"body": "1. Don't know what fundamentals you have in mind to keep shorting the market (besides seeing a high school kid do it) after the market was down ~8% YTD. Even if there is a fundamental, there has to be a bit of bounce action. I have different fundamentals (divergence between $HYG & $JNK from the Indices) (bond market vs equities). One of these fuckers is right. Either bonds rally or equities fall. My bet is equities fall (so far so good).\n\n2. If you do believe we are going to keep going lower, than this rally is lead by oil. \n\n3. I find this chart dank. http://i.imgur.com/MLtax8v.png that was posted before the 500 point swing day we had earlier. (many people belittled this during the day)\n\nHang in there.... I guess", "score": 13, "replies": [{"body": "Numb nuts, I've been shorting it for months before some high school kid ever strolled in. I don't pick a fucking direction, I take what the market gives. I've been buying calls for months too. I just day trade options. I got caught in a bluff. Happens to anyone. ", "score": -2, "replies": [{"body": ">I don't pick a fucking direction, I take what the market gives. \n\nGet ready to order some lube. Market is gonna give you a phat one. \n\n> I've been shorting it for months \n\n\nGuess broken clock was finally right. \n", "score": 17, "replies": [{"body": "Rekt", "score": 16, "replies": []}, {"body": "Are you always such an absolute faggot?  I doubled my account in the last few weeks. I'm taking a hit today. Nobody bats 1,000.", "score": -4, "replies": [{"body": ">Are you always such an absolute faggot?\n\nI mean, are you always shorting the market? lol\n\n> I doubled my account in the last few weeks\n\nWhat about the past year? :)", "score": -1, "replies": [{"body": "Got reemed hard last year on the obvious. My trades besides that were solid. Takes a big man to mock people taking a huge hit. At least I'm vocal about my trades instead of talking a big game behind a keyboard.  ", "score": 7, "replies": [{"body": "> Takes a big man to mock people taking a huge hit.\n\nMore like questioning why have you been constantly shorting the market for months.  The first words out of your mouth was to me to day was \"Numb nuts\". As if I'm supposed to keep track of your trades. \n\n>At least I'm vocal about my trades instead of talking a big game behind a keyboard\n\nI guess you're talking out of your ass instead of a keyboard?\n\nWhatever, seems like you're in a shitty mood from your trades to get clear answers about your fundamentals for shorting the markets \"for months\". \n\nCheers.", "score": 7, "replies": [{"body": "As I said before, I DAY TRADE options. I have no stance if it's crashing or going to break ATH's. I simply trade intra-day movements. I've been trading calls/puts on SPY for the last few months, not because some high school kid made some profitable trades. \n\n\nOn Wednesday, I thought the bounce was a bluff. It was a badly executed trade. ", "score": 1, "replies": []}]}, {"body": "Vocality (all options): \n\nLong USO (Long dated) - maybe the roll will affect this negatively, but at least it isn't OIL, amiright\nLong TPIV because WSB says to, no good reason other than fuck it and YOLO\nShort DXJ  Exp Jan 2017\nShort EWJ Same expiry, but turns out DXJ is better for this, was my experiment to see which one is the go-to. It's DXJ ppl. \nShort LQD for fun, Exp long dated\nShort WMT because ppl of Walmart\n\nIn all market value is about 10k. Yup. High school kid smoked me. Oh well. ", "score": 1, "replies": []}, {"body": "Big ups to you for manning up on the for realz tip.", "score": -1, "replies": []}]}]}]}]}]}]}, {"body": "This is why I'm glad my options expire in Feb and March; the market is all over the place...however, I believe it will be going lower as an overall trend", "score": 2, "replies": [{"body": "I don't know, this is a pretty strong bounce. 1901 is a pretty important spot for ES. It just about tagged it this morning. ", "score": 1, "replies": [{"body": "This reminds me of the rally we had on January 14th. I remember that oil rebounded, JPM had good earnings, everyone was suddenly bullish again before we had another couple of days of agony before today. ", "score": 2, "replies": [{"body": "This doesn't feel quite the same.  It would if we didn't clear and hold 1881 from the 19th. The strong move on the 14th didn't break the close of the 12th to buck the trend.", "score": 2, "replies": []}]}, {"body": "We shall see, I bought a few more puts this morning, but that will be all I buy for a while", "score": 2, "replies": []}, {"body": "Ok so I'm back. My fucking anus hurts man. Still planning on holding. If I sell now I lose *at best* 66%, at worst more like 80%. Fuck that bullshit, I don't believe in this rally. I may be an idiot (by may, I mean I *am* an idiot), but I will continue to believe. \n\nPaper trades are easy because no risk right? No stomach-dropping feeling when things go the wrong way. So I'm going to pretend this is a fucking paper trade and continue to believe.\n\nGiven how low I've already gone, the worst I can do by continuing to hold is lose what amounts to not much money, whereas the upside is huge since I still have 3 weeks (feb 19 expiry) to get back to green or at least a little less deep red.", "score": 2, "replies": []}]}]}, {"body": "FOMC next week:\nhttp://www.federalreserve.gov/monetarypolicy/fomccalendars.htm", "score": 2, "replies": []}, {"body": "I opened a short position on oil at 31.60, see if I can ride this down to 31 ish", "score": 2, "replies": []}, {"body": "You were right about kodi though, so thanks.", "score": 2, "replies": [{"body": "Fucking great right?", "score": 1, "replies": [{"body": "Yeah, sort of. Think I need to upgrade my internet or sumthin", "score": 1, "replies": [{"body": "Constantly buffering? Google Jodi fire stick buffer fix. ", "score": 1, "replies": [{"body": "I did the fusion thing, and I have a hard time finding a stream on 1channel...I need to do some reading on it. Anxious for futures...", "score": 1, "replies": [{"body": "Get Genesis, Stream All the Sources and Phoenix. \n\n\nYeah.. I don't think there are any catastrophic events..", "score": 1, "replies": [{"body": "Thanks man, I'll look into those. \n\nJust curious how it was going to open, especially oil. Think I'm just going to ride my xiv and uwti for the week...could always change my mind though", "score": 1, "replies": [{"body": "Look for CL to keep bouncing off that $32.70 range.  ", "score": 1, "replies": [{"body": "Huh? Wti 32.7?", "score": 1, "replies": [{"body": "Light Sweet Crude Futures.", "score": 1, "replies": [{"body": "$35 is my target for now, but not in a hurry to sell yet. ", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "Relax.  Everything that was true when the market bottomed around 1900 in Aug/Sep is worse now.  The bottom is lower.\n\nI'm in there with you (but I didn't open until the three day rally...admittedly...)", "score": 2, "replies": [{"body": "Saw your post, smart fucking move.  Now that I've had a day to process, I think you are correct. I opened way too early and essentially panic sold after that very strong day. I'm still holding a few contracts.. May actually add some more come Monday, depending on the action.  Check out the article I posted.. Makes some good points. ", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "I did that yesterday.. This is not a suckers rally.. damnit. \n\n\nOnly hope here is that the VIX Puts bank hard.. ", "score": 6, "replies": [{"body": "This could run until about the high 194's on SPY, maybe 194.50-194.75 somewhere in there, looking at the highs on the 13th. If these gains hold today, that's where I would be looking for the next short opportunity, probably Monday or Tuesday. But look out above if that's taken out because then we're probably headed to 200.", "score": 3, "replies": []}]}, {"body": "Why not sell a call spread. You'll profit if the market goes down and you'll also get paid theta every day.", "score": 3, "replies": []}]}, {"body": "I got a series of SPY puts this week and next week... I go to bed every night praying to /u/World_Chaos for a market crash and burn.", "score": 3, "replies": []}, {"body": "Nice hedge! On the bright side, next week will probably be another selloff. No doubt today's pop was a short squeeze.", "score": 2, "replies": [{"body": "I just don't want to hold these over the weekend. Fucking Theta and who knows what kind of bullshit will be taken with a green light. ", "score": 1, "replies": [{"body": "I hear you. The market is too squirmy right now and if we weren't in the middle of such a negative-narrative earnings season then I think the psychology of \"we've bottomed\" would set in. Hopefully we'll drop enough to cover that theta loss. :$", "score": 2, "replies": []}]}]}, {"body": "When do your puts expire? I think the market will rally for a few days, but if China blows up again in the news, it could go down. What was your strike?", "score": 1, "replies": [{"body": "The Chinese govt may interject money back into their market to prop it up. It'll fall eventually.\n\n\nVIX March\n\n\nSPY Feb 12", "score": 3, "replies": [{"body": "I'd hang onto it for another week. Then again, I don't really play options beyond having a basic understanding of them, so don't take any advice from me. ", "score": 1, "replies": [{"body": "Theta is a killer. I'll let the IV calm down and see where we stand. ", "score": 2, "replies": [{"body": "Right, time decay... If your strike is too low then yeah, there might not be enough time for shit to go down far enough to save you. ", "score": 1, "replies": [{"body": "I just need a sharp downward movement. It'll get me close enough to handle the loss.", "score": 2, "replies": [{"body": "Given yesterday's huge rally in the Asian markets, today's rally looks pretty durable. \n\nBut it could be a sucker's rally and we'd be down on Monday on some bad news. Up to you. ", "score": 3, "replies": [{"body": "I'm going to see what the afternoon brings.  This is a very weak open. ", "score": 2, "replies": [{"body": "I've got 185 puts Feb monthlies... So torn as to hold over weekend RE: theta.\n\nAny thoughts?", "score": 1, "replies": [{"body": "Wish I could give you some solid advice.. but we both lost our paddles. \n\n\nStill haven't decided. For the last 2 weeks you could actively see the market being shorted. Now, it looks like covering or it's actively being pumped. Need that to subside.. very soon", "score": 1, "replies": [{"body": "I feel for you.\n\nI too, was hoping it was a false rally. I was going to go long on vix in the morning, and quickly was dissuaded. Now Im sitting on $20 vix puts and spy calls that Im holding over the weekend.", "score": 1, "replies": [{"body": "What expiry on the VIX puts?  If they are longer term, they are trading off a different contract for the VX. ", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Did you manage to get out of that VIX put you got last week? I saw you say it was behaving weirdly.", "score": 1, "replies": [{"body": "Nope, still holding which is a good thing. My positions are now hedged. ", "score": 1, "replies": [{"body": "Is it still green? I tried to buy a few but the order wouldn't take for some reason. It seems pretty high liquidity.", "score": 1, "replies": [{"body": "Has to be in increments of .05.", "score": 1, "replies": []}]}]}]}, {"body": "feb 05 $186 puts\n\nreally just hoping for enough of a pullback in the day to almost break even and get out ", "score": 1, "replies": []}, {"body": "Damn, son.  Shit was already reversing Wednesday afternoon.  I picked up some favorable $SPY 190/194 March bullish call spreads for $1.40 when $SPY was around 185.  Now already approaching 191.", "score": 1, "replies": [{"body": "Thought it was a bluff.  I was wrong. ", "score": 1, "replies": [{"body": "If I had a nickel for every time I wrongly called a bluff.....I'd have more money than what's left in my TDA account. ", "score": 4, "replies": []}]}]}, {"body": "How much are you under?", "score": 1, "replies": []}, {"body": "FUCK IT time to buy some calls. YOLO. Need to make up for it", "score": 1, "replies": [{"body": "Yeah.. definitely reverse directions.. How could that backfire..", "score": 3, "replies": [{"body": "Works every time 10% of the time", "score": 4, "replies": [{"body": "It's a strategy that always works until it doesn't.", "score": 3, "replies": []}]}]}, {"body": "This is exactly what people think. \n\nOh STRONG move up! Time to buy calls! \n\nSTRONG move down, time to buy puts! \n\nIt's the opposite, guys. ", "score": 1, "replies": [{"body": "Idk man, buying puts got a lot of profit these past two weeks", "score": 1, "replies": []}]}]}, {"body": "Gold is in the positive now and 10-Y T-note yield is going down as well.\n\nMight be a signal of a saving grace for you.", "score": 1, "replies": [{"body": "Dat inverse relationship", "score": 1, "replies": []}]}, {"body": "Use this chance to buy MCD puts for next week. Reason being the fucker is sitting only ~2% off it's all-time high. Who the fuck they think they", "score": 1, "replies": [{"body": "Hmm this is interesting, not many companies left standing at their all time highs. ", "score": 1, "replies": [{"body": "I'd be wary of going against MCD though, especially if that minor recession all those bears are talking about comes to fruition. If there is one restaurant chain that will still be standing, it will be MCD.\n\nDisclosure: I eat at MCD a couple of times a month because it's a cheap way to eat out with the fam (and some friends, if they are cheap enough). One McChicken for less than $2? Sold!", "score": 1, "replies": [{"body": "Haha I thought they were selling Water for more than Coke nowadays. I haven't eaten there in years. I call it pseudofood, or foodlike substances with condiment flavorings. ", "score": 1, "replies": [{"body": "Weird, I used to think they were disgusting as a kid, but I've come to appreciate them as an adult. Only their value menu is good, everything else is crap for the money though. ", "score": 1, "replies": []}]}, {"body": "The thing with MCD is that they own the bulk of that real estate and trust me, it's all primo.  MCD will pay steep prices to get prime corners.\n\nIf they start downsizing, spinning off, selling property and buying back shares, etc, the value of that real estate is large.\n\nThey're not just the name on the sign, they own it all, franchisees are just renters.", "score": 1, "replies": []}]}]}]}, {"body": "At one point today was up almost 100% since buying in on GUSH earlier this week.  I timed the oil bottom just right. \n\nYOLO", "score": 1, "replies": []}, {"body": "Get them IDRA calls or long it. You were the one who told me. I loaded up. This is a sleeping giant.", "score": 1, "replies": []}, {"body": "I said before that it feels like WSB is a good indicator of things going the reverse the direction. I actually do think that when the general trader sentiment is one direction because then a lot of the market movement has moved past a news-oriented/fundamental trends and is being exacerbated by momentum traders who have pushed things further than they should be so any profit-taking/covering could easily set off a big swing in the other direction.", "score": 1, "replies": [{"body": "It's the telephone game on a greater scale. By the time everyone is on the line, the message has changed. I get that, but WSB has zero influence on my trading; honestly.  I switch between calls/puts every week and day depending on the underlying movement. Just got caught. ", "score": 1, "replies": []}]}, {"body": "#LOWER FOR LONGER!!!!!! \n\n\n\nThis bounce was probably related to bounce in crude. Now idea why crude is up 20% in two days. I have bearish positions for Friday expiration. \n\n\n\nGod be with us all!", "score": 1, "replies": [{"body": "Shorts were covering their bets. The fundamentals of oil have not changed. Probably wise to go short IMO. ", "score": 2, "replies": []}, {"body": "Think you're right. ", "score": 1, "replies": []}]}, {"body": "bought SPY puts that expired today 2 days ago on the open. Was trying to get in on the action all week but my money took forever to clear by options house. Bad move.. first option trade. I also bought XLE puts which got crushed. I doubled down and bought some Jan 29 XLE puts for next week.", "score": 1, "replies": []}, {"body": "markets are gonna keep tanking. keep yoloing", "score": 1, "replies": []}, {"body": "For clarifiction because everyone seems to be confused on what the PDT rules are. You can only make 3 day trades per 5 days.\n\nIF your account is below $25k and you break the PDT rule you can not day trade with unsettled cash for 90 days or until you bring your balance to $25k (whichever comes first).\n\nHowever you will still be able to use unsettled cash to buy. You just can't sell (day trade with it). IF you do another day trade while on the 90 day restriction then you can no longer use unsettled funds to purchase. You will have to wait until your cash settles to buy (options settle overnight, stock takes 3 days)\n\nYou are not by any means \"locked\" out of your account for any amount of time.\n\nNext time OP if you're in that situation sell and take the profits. It's not a big deal if you break the PDT rule.\n\nEdit: and like u/Not-so-bad- said this only applies to margin accounts, not cash accounts. Basically if you break the PDT rule on margin you are put back on a cash account. You can still trade though (and day trade with settled funds).", "score": 1, "replies": []}, {"body": "Hold as long as you can. We're in a bear market any rally we have is temporary. Its only because they switched oil contracts for March and everyones all excited that things will be good by then. It wont. They will all realize this shortly and next week will tank. ", "score": -5, "replies": [{"body": "But.. you love AVXL and how well did that work out?\n\n\nI have very conflicting opinions here. Haven't decided yet.", "score": 3, "replies": [{"body": "I learned from my short burn. :)", "score": 1, "replies": []}]}]}]}
