{"title": "Will be putting a little under 26k into $AAPL tomorrow at the open. See you all on the moon in a few years.", "selftext": "[deleted]", "id": "40ccql", "created_utc": 1452449203.0, "score": 115, "upvote_ratio": 0.92, "num_comments": 189, "comments": [{"body": "RIP", "score": 91, "replies": [{"body": "[deleted]", "score": 22, "replies": [{"body": "[deleted]", "score": 105, "replies": [{"body": "Steve Wozniak is still alive so it's ok.  ", "score": 11, "replies": []}, {"body": "> What if Steve Jobs dies or something?\n\nYou're saying that knowing he's dead but living on in all our hearts right bro?\n\nHe'll never die while WE KEEP THE DREAM ALIVE.", "score": 4, "replies": []}]}, {"body": "OP: I'm a professional trader and have had AAPL on my screens every day for 20yrs.\n\nI am NOT a 100% Technical Trader, but I do note major pivots.\n\nSimply be aware that AAPL at approx $95 \n\nis a 50% retracement of its alltime H at about 945; and its 2x Low at 380. Using PreSplit numbers obviously.\n\nIgnoring many other facets such as News, Earnings, tone of the Tape, etc and from a purely technical commentary, 50% retracements are watched by pros very closely.\n\nIf they hold, great, we go up.\n\nIf they fail, pro Longs will sell and pro shorts will come in.\n\nSummary: $95 is a 50% retracement, and worth paying attention to given you are 100% going all in.\n\nLastly: you are 20, np - great to want to learn to trade/invest\n\nhowever, you have not seen commodity tech pricing in your life so far.\n\nSince your teen years, iPhones cost $600-800 each and every refresh cycle. that's all you have experienced. \n\nWhat you have not lived through is :\n30 years ago, VCRs when they came out cost $1000 and within a decade cost $100-200\n\n20 years ago, a Desktop computer cost $3000; and within a decade cost $1000.\n\nLaptops used to cost $2000-3000; and now are $400-900\n\nFlat Panel TVs when they came out cost $3000-4000 and are now $500-$800.\n\niPhones cost $600-$800 from their introduction to now. \n\nThat price point simply will not last in the years to come, it's impossible from a commodity price point.\n\nWhy does all the above happen? After a few years, the tech within that product no longer advances very much; plus market saturation; thus the price slowly drifts lower.\n\nSince iPhone is 60-65% of AAPL Net profits, what happens to iPhone impacts AAPL.\n\nI am not implying your trade is good or bad, simply to mention a facet of the industry you have not experienced due to your age.\n\nEDIT to add an hour later: OP : please note : currently I am flat AAPL (had been bearish for several weeks); but as AAPL is basically at 95; and with the US Futures markets about to open in 5 minutes; and who knows how'll be open Monday morning; and AA kicks off Earnings Season on Monday; then Bank earnings duuring the week.\n\nWe are at a Pivot point : in AAPL; and the Tape here at SPX 1920 - go up hard, go down hard - I will simply trade the tape: Good trades everyone \n\nEDIT at602pm : Well US Futures just opened, and for right now, Bearish remains correct : ES SP500 futures are at new Year Lows here at 1904-8 ; which means SPX right now is about 1912 (and under 1920 pivot); Shorts may push for that magical 1900 level; \n\nWe HAVE seen many times a large gap down Monday and that proves to be a buyable bottom; but this time, we are just about to start US Earnings : and they are not expected to be very good. Now 604pm, ES new Year low 1902 -10", "score": 129, "replies": [{"body": "iPhones are priced high because of branding though no?\n\nAlso what the shit do I do when iPhone is the start of a sentence. Do I capitalize it or not? God damn it.", "score": 22, "replies": [{"body": "Honestly that should probably have you more scared. Apple is able to capitalize on the demand for the iPhone because of the brand recognition. Brands come and go, fashions/trends change. I'm not saying that's happening or is going to happen, but when it does it can happen quickly.\n\nApple as done well at promoting its products in the past, but having 60% of your profit coming from one product still scares me.", "score": 10, "replies": [{"body": "I think the Apple brand is strong, but what's really going to help them maintain market share (and pricing power as a result) is the appealing user interface, and simplicity when transitioning to another apple product.  Why switch to android when your Apple ID lets you transfer all your purchases, contacts, and other media with the touch of a button?", "score": 6, "replies": []}, {"body": "It's honestly misleading to refer to successive generations of Iphones as even being the same product.  They used to sell phones, then they sold phones with cameras, now they sell computers that fit in your pocket.  Personally I think the company that will rule over the next 10 years will be the one that's able to wed their mobile device with immersive VR the best.  That's speculation but if we're talking about profits going down due to products growing obsolete, the end is definitely nowhere in sight on mobile tech.", "score": 6, "replies": [{"body": "I never said that every iPhone was the same product, I said that they have one product that produces 60% of their revenue. No one is going out and buying and iPhone 4 from Apple right now, they're buying an iPhone 6. It may very well be a different product, but it's still the iPhone 6/6s that is making up that revenue stream. That being said, the difference between iPhones and their competitors have narrowed since the iPhone launched. The question is, will the market share that Apple holds narrow as well? It's certainly not right around the corner, as Apple still seems to have the most user-friendly interface and their products are well made. That being said, it's naive to think the iPhone can't fade as a fad just as quickly as it arrived. Remember when Blackberries were 20% of an admittedly much smaller smartphone market?\n\nhttp://www.statista.com/statistics/263439/global-market-share-held-by-rim-smartphones/\n\nDo I think Apple will go down the path of RIM? Personally, no, not at all. At least not to the same extent. I'm more playing devil's advocate for those that believe Apple is an infallible company that will never lose market share. ", "score": 2, "replies": [{"body": "I agree with you. Apple is a one product company and that product is becoming a commodity. You can buy a Nexus 5X for one-half the cost of an iPhone 6. It has almost all the usability of an iPhone for one-half the cost. The timer is ticking at Apple.\n\nNo Steve Jobs = No game changing devices\n\nHistory is repeating itself. The corporate guys took over after Jobs was kicked out the first time and about ran the company into the ground because Jobs wasn't following \"traditional\" corporate philosophies. \n\nJobs came back and made Apple special with unique products starting with the iPod. then iTunes, then the iPhone and iPad. They are coasting now but have such a huge bankroll they will be around for a long time.", "score": 3, "replies": []}]}]}, {"body": "Yeah you know you're right. Those are some good points.", "score": 4, "replies": []}]}, {"body": "I believe Apple can continue what they have done for 20yrs which is carry a higher price tag on their product line. I personally do not believe that AAPL products are superiour in a hardware/software sense, but that doesn't matter. (Disclaimer: Thinkpad      fanboy and am not a Mac laptop fan)\n\nSo yes, moving forward I could easily see an iPhone carrying a higher price tag than every other smartphone; but what will the average smartphone sell for 3 years from now? 5 years from now? I strongly doubt it will be $800", "score": 2, "replies": [{"body": "I have an x240 and an Air. How should I feel?", "score": 2, "replies": [{"body": "I've been a Thinkpad fanboy since the early 1990s so I am a tad biased, lol.\n\nSeriously asking: were you a fan of the Trackpoint before you bough the Air? For me, I cannot use a laptop or any keyboard without that little red Trackpoint nub\n\nTyped from my Thinkpad while watching NFLX on my iPad Mini", "score": 1, "replies": [{"body": "I've always owned a Thinkpad, so I get the bias. I bought the Air around the time Lenovo started fucking with the Thinkpad keyboard & Trackpoint experience.\n\nTbh, I expect to have one of each from here on out, though if forced to choose I'd go Thinkpad. The Air touchpad really compensates for the Trackpoint in ways every other PC laptop trackpad experience has fallen flat, but the Mac keyboard is still missing keys you simply must have for Excel.", "score": 2, "replies": [{"body": "I fully understand, Lenovo truly was fucking things up by fully trying to copy Apple's laptop. It appears Lenovo has heard the angry fury from its users given what they are showing at CES and upcoming and returning to what made Thinkpad a Thinkpad.\n\nThe upcoming X1 Carbon looks yummy", "score": 2, "replies": []}, {"body": "So you used the Thinkpad first then went to Air. OK...\n\nDo you type a great deal? Are you a fast touch typist?\n\nI would so miss the Trackpoint. Perhaps because I used Thinkpads in the 1990s long before a Trackpad ever showed up. Muscle Memory gets used to certain things I guess :)", "score": 2, "replies": [{"body": "> So you used the Thinkpad first then went to Air. OK...\n\nI don't think it is that surprising, given where Lenovo was [headed](http://arstechnica.com/staff/2014/01/stop-trying-to-innovate-keyboards-youre-just-making-them-worse/) at the time. I use both the Air and the x240, for different purposes, now. I am tied to the Windows ecosystem, though Excel 2016 has made a significant stride towards actually being able to choose between the two on even footing.\n\n> Do you type a great deal? Are you a fast touch typist?\n\nYes. I hate the chiclet keyboards that both Apple and Lenovo have adopted, but I know they're here to stay.\n\n> I would so miss the Trackpoint. Perhaps because I used Thinkpads in the 1990s long before a Trackpad ever showed up. Muscle Memory gets used to certain things I guess :)\n\nI'm still not 100% on the trackpad and I hit keys occasionally while hunting for the Trackpoint on the Mac when I'm zoning out. That said, I think the Trackpoint exists at least in some small degree to compensate for piss-poor trackpads on PC laptops in general. I find the Air trackpad to be exceedingly easy to use and easily the most natural experience, as far as such things go. That said, I'd choose the Trackpoint over the Mac trackpad, though a combination would be ideal...\n", "score": 2, "replies": [{"body": "thanks for a detailed comparison....", "score": 2, "replies": []}]}]}]}, {"body": "Apple is a lot more than hardware. ", "score": 1, "replies": [{"body": "AAPL net profit is approx 60-65% iPhone sales. Fact. \n\niPad, AppleTV, Mac = all hardware.\n\nApple Music, Apple App store = not hardware", "score": 1, "replies": []}]}]}]}]}, {"body": "\"iPhone\" is the proper name. You don't ever capitalize the 'i'", "score": 2, "replies": []}, {"body": "> iPhones are priced high because of branding though no?\n\nConsumers are running out of money. They won't be priced so high for long... they'll be figuring out how to pay their bills.", "score": 1, "replies": []}, {"body": "umm, I am not a member of the Grammar Police; however, due to the term 'iPhone' being a known product, it is a noun. Thus you are starting a sentence with a noun and using its correct spelling. So I think you are just fine there. :) \n\nI hope I have been able to ease your large concern and worry in this matter.\n\nPlease send tree-fifty as proper renumeration for my service in this matter. ", "score": -3, "replies": []}]}, {"body": "with regards to the price:\n\nhow much does the subsidization of the phone factor into it? all of the other products you mentioned did not have a subsidy, but phones do from their providers.", "score": 3, "replies": [{"body": "Until recently, to most people getting a new smartphone, they were not paying its actual price of 600-800, they were paying $200-300 and renewing their contract for an extra 2 years.\n\nUSA Cell phone carriers are moving away from that model; and going to BYOP. Europe never really had this model to begin with.\n\nBut going forward, USA smartphone buyers will be seeing the $700-800 price tag for a new iPhone; and for some, having sticker shock.\n\nAbout the only \"new\" tech thing I can see on the horizon is VR ; and that seems to be some years away yet.", "score": 4, "replies": []}]}, {"body": "Wtf that's the highest quality comment wsb has ever seen. I'm in shock. Thank you sir", "score": 3, "replies": []}, {"body": "When is the Mac going to follow the rest of the PC industry? Why didn't iPods end up in the bargain bin? Why aren't iPads sold for $40 in a back alley behind CES like every other 'commodity' tablet? It's not a sure bet that iPhone will become a commodity because Apple is a fucking weird thing", "score": 2, "replies": [{"body": "I fully agree that Apple products are perceived by most shoppers to be worth premium pricing. My topic thread was about now that smartphones are at that special point where this years model is not that different from last years model - plus, USA cell phones companies are moving away from that $200 subsidy and to BYOP\n\nso what does that mean going forward a few years (not a few months, a few years)>\n\nI simply was drawing on what happened to other tech from the last 30 years : VCR, DVD player, Large screen TV sets, flat panel computer monitors, spinning hard drives, SSD storage, cost of Storage in general (USB Thumbdrives), PC computers, laptop computers, etc.\n\nWhy should smartphones be any different?", "score": 3, "replies": [{"body": "I want to preface that I agree with you on the sentiment that if Apple doesn't change, it will fall into the same pattern of its predecessors.   \n\nHowever, one thing I feel you may have overlooked is Apple's is successful due to its ease of use.   What made the first Mac popular?  Ease of use.   iPod?  It was the iTunes integration.  With iPhone, they own both the sw and HW, and are able to make things more seamless.  Apple can start making decisions that you would make anyway, thereby saving you time.  They current do this every sw rev.   \n\nHave you used an android recently?   I was forced to use one at CES this year and I was lost.   It was clunky, items were in places you wouldn't expect.   Now granted, I am used to an iPhone, but I'm fairly tech savvy and have worked in the field.  It wasn't as intuitive.    \n\nAll the technologies you have written were replaced by new better HW.   Faster.   Cheaper.   Smaller.   But the software remained mostly the same.   Beta-vcr-dvd.  Same process....insert media press play.   We are now in a paradigm where the entire system needs to be evaluated because without its search and recommendation algorithms Netflix is just blockbuster.  \n\nApple owning both sw and hw always gives them an advantage over the rest.   Apple will also be able to create low end variants that have all the nice features of iPhone, but with cheaper component cost.   This way, I still see their iPhone sales growing with margins staying fat, since Apple is a even more impressive operations company than product company.   But that's for another day.  \n\nAs of now, I don't see the consumer prioritizing how fast they get their content vs how they consume it.   Unless it's battery life, which is only so they can consume for longer and more on their phone.  If I used my current iPhone the way I used my first, it would last weeks.   \n\nToday the hardware just needs to facilitate the transaction now.   The hardware isn't the main seller anymore, the design is (Sir Jony Ive--who you must respect).   Most consumers don't know or care about anything they can't interact with (screen, battery life, physical design).  So they can put in the same spec components, that are now in a smaller footprint, in the same phone, increase battery a little, slap a new shiny design on it and sell another 90 million a quarter.  \n\nSo as long as they own the entire ecosystem (iPhone hw, sw, iTunes, watch, Apple Pay, etc) your iPhone is just a device you need to have because you want the ecosystem.    And there are always more people to bring into the ecosystem.  \n\nNow the challenge becomes how do you adapt to the new ways the consumer wants their data.  Especially since consumers of all ages are using the product.   Do you make it for dad or the daughter?   Student or professional?  Apple is hoping the watch can do that, and for the most part it can.  The trend now is companies focusing on filtering the data to what is actually important to you.   But as we move to a more connected world, we soon will have sensors all over the house that will report back to a central server in your house that reports to the cloud to your watch all the important notifications like your dog took a shit on your rug and the roomba smeared it around, but it went ahead and called the cleaners because the odor sensor went off ;-)\n\nTl;dr. Apple is a complex beast.  Consumers are even more complex.  ", "score": 4, "replies": [{"body": "Um...How do you explain the looks of the extended battery for the iPhone? Must respect Sir Jony Ive?\n\nWho's brilliant idea was it to have the stylus plug in at a 90 degree angle for charging on the iPad Pro? That's some really great design work there!\n\nThey are losing it because Jobs is dead.", "score": 1, "replies": [{"body": "Can't argue with you on those products, but I'm referring to the ecosystem as a whole, and that being the reason people buy Apple.   Those products seem out of place.\n\nAs for losing because Jobs is dead?   Thinking a company like Apple was run by 1 person, is false.   You really need to work at the company, in order to understand how it all comes together.  Not trying to be a dick, just saying Apple is more complex than that.   Simultaneous vertical and horizontal integration has lots of moving parts.  ", "score": 1, "replies": []}, {"body": "Steve Jobs released the puck mouse, the iPhone 4 with a \"bad\" antenna and a glass backplate, the mighty mouse and the magic mouse, and a host of real dogshit software. It's not reasonable to say current Apple is any worse than previous Apple.\n\nIt might be, but I don't think there's enough evidence yet.", "score": 1, "replies": []}]}]}, {"body": "Because the software is incredibly different and exclusive to iPhones.\n\niPhones have a software ecosystem with a bunch of exclusive services. VCRs, DVD players, storage, and computers either do not or don't have compelling enough services to matter.\n\nThe software on iPhones is very compelling.", "score": 1, "replies": []}]}, {"body": "Not being snarky but a real-world reason why 3-4-5 year old iPads, iPod Touch are not sold is because that non-replaceable battery simply dies. And thus, the actual product is now useless and holds zero value.\n\nI have an iPad3 whose battery no longer holds any charge from hard use; and only works if plugged in to its charger. What's that worth to someone ? $40?", "score": 2, "replies": [{"body": "I'll give you 10$", "score": 3, "replies": []}]}]}, {"body": "I agree with you that the next 6 months are going to be difficult for AAPL but I think it's one of the best stocks out there if you had a gun to your head and had to buy something (I myself prefer to wait it out until the dust settles). It's P/E ex-cash is only around 9 and this seem more along the lines of a slow growing hardware company. Can it go lower? Absolutely, and things don't look good based on it's supply chain. However, I think a higher valuation than a slow growing hardware company is justified in my opinion. I do think that the company gets too many people that take an extreme view of it one way or another. Either it's going to go to $150 or it's going to go the way of Blackberry. I don't see either very likely in the near to medium term. One of the criticisms of this company is that it's revenue is disproportionately from iPhone however this has more to do with how successful the iPhone is and not a reflection of other new products such as the watch being a failure. I think the estimate is that they sold 7 million watches and this is impressive for a brand new product however it is drowned out due to the size of the iPhone revenue. Due to scale, the company can also keep the R&D budget low as a percentage of revenue but still dedicate a lot of money to R&D and out innovate it's competitors. It's revenue is also somewhat annuity-like because of loyal customers that continue to upgrade their iPhones either when a new one comes out or 2 years depending on the level of loyalty.", "score": 2, "replies": [{"body": "I agree with much of what you said.\n\nI am a professional Trader - I am neither a PermaBull nor PermaBear on any index or specific equity.\n\nBut since Dec 2015 FOMC Meeting I have been seeking more Swing Shorts, esp on stocks that had a stunning 2015 : AMZN NFLX PCLN AAPL FB TSLA GOOGL \n\nI've been trading long enough to know there are always cycles, up and down on the tape.\n\nFrom March 2009 to last fall's New Highs , that's 6+ years of UP.\n\nNow we have the Fed's first rate hike.\nNow we have China issues.\nDow Transports leaking lower all year.\nCommodity prices continue downward due to slower China demand.\n\netc etc.\n\nNote: I'm not an APPL bear, hell, last Thursday at the bell I Longed AAPL DEC08 calls and placed a sell to close at Friday's open. I will happily go Long or Short in a quick trade but I like keeping Macro views in my head\n\nThere's no doubt there's massive brand loyalty to Apple. \n\nBut going forward, in my view, those $800 iPhones will be selling for $400-500 in the years to come; and Android selling for $300-400", "score": 1, "replies": [{"body": ">But going forward, in my view, those $800 iPhones will be selling for $400-500 in the years to come; and Android selling for $300-400\n\nI would agree that there will be less pricing power in the future but I might disagree as to how quickly this would occur. If you use PCs as an example, they would sell at high prices for 15-20 years until the mid 90's when vendors like Dell started to really slash the prices on them. They'd keep prices high by continuously adding more MHz, memory and disk space so people wanted to pay extra for the new Pentium when all their friends had the 486. I also think that smartphones might be able to do this by putting in more content and features, for example foldable smartphones, 5G when it comes out, or features you and I haven't even thought of. This is stuff that Apple and Samsung would tend to be able to take advantage of ahead of the curve due to their scale.", "score": 1, "replies": [{"body": "Iphone 1 came out in 2007 I believe,  but it wasn't until iPhone 3 or 4 until \"everyone\" had one which was like 2010 or 2011\n\nso lets say smartphones became mainstream in 2010-2011\n\nPC computers were out in early 1980s, but didn't hit mainstream until 1999-2000 in the home. They were in offices of course long before that. Just like Blackberry was very common in Enterprise in the 1990s-early 2000s; but smartphones were not mainstream until 2010 in the personal space.\n\nso we have 5 years of phones at $600-800\n\nyou are correct, who knows when the price will go down; but it's a given it will; even with new tech such as foldable screens which LG was showing recently. VR with some crazy holograms..... \n\nBut.......... I am hard pressed to remember the last time some major tech company came out with something unexpected.\n\n iPhone 1 back in 2007 slightly comes to mind\n\nBut that's basically 10 years ago, and I cannot think of ONE major tech product that \"came out of no where that amazed and wow'ed the world\" /grins/ Hell, Dick Tracy comics had a smartwatch in what? 1950s?", "score": 1, "replies": []}]}]}, {"body": "for one, I am NOT a buy it forever investor, I am a Trader.\n\nBut if you put a gun to my head as you stated, I'd pick NFLX or even AMZN over AAPL to buy-and-hold for 2-3 years.", "score": 1, "replies": []}]}, {"body": "Who expects earnings to be very good?", "score": 1, "replies": [{"body": "people going long stocks who have earnings this month :) /s", "score": 1, "replies": []}]}, {"body": "Solid read, and I agree with this sentiment. I'll also add is that what investors I spoke with wanted was for China growth to continue pushing Iphone sales. Unfortunately, this seems like no longer the case with [Foxconn](http://www.reuters.com/article/us-apple-iphone-idUSKBN0UJ1WE20160106) (Apple supplier) reporting a slow-down during the holidays. \n\nLet's also not forget the issues with the Apple watch not catching on, which investors were never keen on in the first place, and the slowing of Tablet sales (due to the over-saturation in the market and stiff competition from $MSFT). I believe Apple will have problems down the line with their brand's staying power due to the competition coming up with products that are simply more impressive and unique in the phone market, and even now in the tablet sector (Opinion). Of course, Apple can change this sentiment easily, but they'd have to impress with an actual upgrade of their next Iphone cycle and in my honest opinion an acquisition of a new technology like $FB did with Oculus Rift (Virtual Reality). \n", "score": 1, "replies": [{"body": "Thanks for your kind words.\n\nI also factor in what I've felt for a long time. Mr Cook is a world-class COO, huge respect. But he's not a cult CEO who can inspire insane ideas and thinking. Also, Mr Ive who is a truly brilliant designer; BUT not at the sake of design wins all engineering arguments. I swear Mr Ive would be delighted to have a 2mm iPhone with battery life of an hour, and be so thin you couldn't even hold it - but it's 2mm thick and simply lovely.\n\nDisclaimer: I hate , simply hate, the look and feel of Mr Ive's redesigned iPhone and Tablet iOS\n\n", "score": 1, "replies": []}]}, {"body": "To preface I don't completely agree with OP or your stance on Apple. You make points that are all true and OP should take note of. Your stance does not take into account the possibility/probability Apple gets into/creates a new niche in the tech market. You are right about the declining costs of laptops, phones, etc. that 10 years ago were out of many customers price range but now props up Apples revenue while its costs and demand are decreasing. So yes tech in their current products can't advance too much more and market saturation hurts them but you do not care at all in your post about the next big product for Apple. If OP buys Apple not because of the success of the iPhone but buys on the confidence Apple will be a market leader, I think it is a good buy. But if OP is buying because he thinks the iPhone will continue increase stock price that is a bad trade in my opinion. I completely agree Apple will remain bearish but there will be a time soon that will become a great time to enter in Apple long. The change in the cable tv business model is coming and if Apple is smart they will spend some of that small cash pile they have and take control of the market when it shifts to an a-la-carte pay model. I believe Apple will take that market which will make up and advance the stock even with even with a drop in iPhone revenue within the next few years. ", "score": 1, "replies": [{"body": "Apple has sorta given up the a-la carte TV model (other than say ESPN and Disney which of course Mr Jobs owned more DIS stock than AAPL stock - so AAPL and DIS products have played nice together.\n\nIt's why so many TV shows on ABC (DIS owned) have a love fest with Apple products sometimes. (Modern Family comes to mind).\n\nThe TV/movie business saw how Apple took over the music space. imo, there's no way in hell the TV/movie business will allow Apple to control a-la carte TV model and \"take it over\". TV/Movie business can sell to all of them : Apple, Amazon, NFLX, Google , etc etc; and use the negotiation power of having 1 product with many buyers.\n\nThat said, even though Apple has not released a 'wow' no-one-saw-that-coming product in 10 years - yes - Apple is one of the few companies which might be able to. \n\nThat said , do I wish to park $ into something that hasn't happened in 10 years but 'might' someday? nope.\n\nAll that said, I might be taking a Long on AAPL at any time - I let the the Tape tell me, guide me; not what I 'think' it should do.\n\nRight here: AAPL 95ish is a double bottom and 50% fib\n\nsimple: AAPL goes up or down from here, and the tape will tell me which; and I don't care which direction it goes, just that i'm on the right side of the trade.", "score": 2, "replies": []}]}, {"body": "> That price point simply will not last in the years to come, it's impossible from a commodity price point.\n\nFinally, someone fucking understands. iPhone production has been cut, Android is becoming a serious threat (finally), and there is no real revolutionary changes between product cycles.\n\nAll these things are pointing to lower pricing OR/AND introduction of a permanent iPhone C tier. To Maintain volume (if that's apple goal, volume) or eventually conversion to a \"luxury\" brand of phones due to their high quality products, brand name, and price point.\n\nApple is at interesting crossroads if it doesn't give us something breathing revolutionary that no else has. \n", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "in that comment, pivots (outlined somewhere within that long post)", "score": 1, "replies": []}]}, {"body": " But one important thing you are forgetting is the iPhone is subsidized, on a contract, and that's what keeps the price the same", "score": 0, "replies": [{"body": "umm no, not so much. All the US carriers are/or have moved away from the subsidy model; so most people are now looking at $700-900 phones (with state sales tax)", "score": 2, "replies": [{"body": "Leasing still exists, though, which is all subsidies ever were.", "score": 1, "replies": []}, {"body": "No most of them are moving towards 25 dollars a month kind of options ", "score": 1, "replies": []}, {"body": "Isn't Apple offering from it's own stores, phones for some $32/month with option to get a new phone every year? ", "score": 1, "replies": [{"body": "I don't know the precise math, but yes they do.\n\nLets see, iphone 6 : $750 or $37.50/month \n\n$37.50 x 24 months = $900 / so you are paying $900 for the $750 phone spread out over 2 years which is quite frankly very high finance charge)\n\n\n(this is Apple's fine print and it's not clear to me what they mean by 'installment agreement' )\n\nRequires an installment agreement or a 2-year contract and plan (which may include restrictions on switching service providers and roaming, even after contract expiration); sold separately to qualified customers. Credit check required; must be 18 or older; upgrade or activation fee from your wireless service provider may apply. Wireless service is provided by and is the sole responsibility of your wireless service provider. Some capabilities are not available in all areas and depend on your wireless plan and service provider network. Service may not be available in all areas or at the signal strength, rates, speeds, or bandwidth as demonstrated. Some features may require added fees. Contact your wireless service provider for more details. Customers who want to upgrade from another phone or replace a previous-generation iPhone should check with their wireless service provider for pricing options. For those who are not qualified customers, are not eligible for an early upgrade, are purchasing an unlocked iPhone, or wish to buy an iPhone as a gift, see your carrier, an Apple Retail Store Specialist, apple.com, or an Apple Authorized Reseller for pricing. In CA and RI, sales tax is collected on the unbundled price of iPhone. Wi‑Fi Internet access required for some features; fees may apply. Use constitutes acceptance of Apple’s software license agreement. Warranty information is also available at www.apple.com/legal/warranty/iphone. Unauthorized modification of your iPhone software violates the software license agreement. Inability to use an iPhone due to unauthorized modifications is not covered under your warranty.", "score": 2, "replies": [{"body": "Yeah but people are stupid as fuck and suck at math. They see NEW IPHONE 35/MONTH and swipe.\n\nPoint is it won't be treated like the $700 consumer good it is.", "score": 1, "replies": []}]}]}]}]}, {"body": "Wat", "score": -1, "replies": []}]}, {"body": "How much of your portfolio is this? What type of trade?", "score": 7, "replies": [{"body": "[deleted]", "score": 18, "replies": [{"body": "You're a fool. At least put $5500 into a Roth IRA first. ", "score": 11, "replies": [{"body": "Huh?  He can buy apple inside of his Roth.  Roth is an account type, not an investment. ", "score": 3, "replies": [{"body": "He seems to be implying he's going to take all 26k from his brokerage account and put it directly into AAPL. That's not a Roth. ", "score": 2, "replies": [{"body": "That doesn't matter. You can transfer securities directly to a Roth. I did it last week. My IRA is at the same brokerage as my taxable account and I can easily transfer cash or shares into the IRA.", "score": 1, "replies": []}, {"body": "Ah. Well, hopefully he buys $5500 worth of his shares within a roth. ", "score": 1, "replies": []}]}]}]}, {"body": "You're putting you're ENTIRE college savings into one stock? Have you spent any time reading about investing? Jesus. ", "score": 30, "replies": [{"body": "Did you get lost? This isn't /r/investing", "score": 61, "replies": []}, {"body": "[deleted]", "score": 15, "replies": [{"body": "Epic YOLO right here. Your face should be on the banner. Or maybe just the returns of your portfolio over the next few weeks.", "score": 29, "replies": [{"body": "[deleted]", "score": 30, "replies": [{"body": "A man is not u/pmiller503  \n\nA man is no one.", "score": 6, "replies": []}, {"body": "[deleted]", "score": 10, "replies": [{"body": "BOOORRRRRING", "score": 21, "replies": []}, {"body": "Then what am I supposed to do with this magic 8-ball?", "score": 2, "replies": []}]}, {"body": "Please give us an update tomorrow.", "score": 1, "replies": []}]}]}]}]}, {"body": "Lmao. Better gamble all your savings away on a terrible bet. YOLO!!\n\nOn a serious note: What makes you think this could possibly be a good idea while the entire stock market is collapsing and $AAPL is just getting worse?", "score": 11, "replies": [{"body": "Because AAPL isn't actually getting worse fundamentally, the market is just retarded?", "score": 16, "replies": [{"body": "Good answer.  I agree.", "score": 8, "replies": []}, {"body": "Well, the market isn't retarded. It is still on a 20%+ bubble from all the QE. It is entirely fake. If they were to raise rates to 3-5%+ as they should be we'd be in a depression in a month worse than that ever seen in history. Easy money BS market. Still tryna make YOLO money off of it though. If they're selling our futures we may as well try and earn it back.", "score": 3, "replies": []}, {"body": "I thought AAPL lost a 1% market share last year?", "score": 1, "replies": [{"body": "If by lost you mean gained over 2% market share, then yes", "score": 1, "replies": [{"body": "Oh wow I don't really follow them much, not my area of interest, so what caused AAPL to decline in share price even though they were up at the end of 2015? \n\nI only ask for educational purposes, I know this is WSBs but I can try!", "score": 1, "replies": [{"body": "AAPL is perpetually hated by news writers. There's a whole lot of FUD spread about them off rumor. That's really it. All analysts have a much higher target price than Apple is trading at today.\n\nIf you actually follow AAPL's stock movements though, they go through these bearish phases at least once a year, blow out earnings, destroy more stock with buybacks and then all the sudden the FUD dies down.\n\nIt's really stupid, but there's a whole lot of effective manipulation on AAPL from the bear thesis side. My guess is it's so effective because people don't understand Apple's business model at all on Wall Street.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "TSLA would be a much better stock to check back on in a few years. It's going to be a wild ride with this stock but ultimately it will dominate. (bracing for blowback...)", "score": 7, "replies": [{"body": "TSLA is simply riskier. It will go up or down more than AAPL will. More yolo for sure, but \"better\" is not the best description.", "score": 3, "replies": [{"body": "We'll agree to disagree?", "score": 1, "replies": []}]}, {"body": "Why? Just look at the competition. Big autos are going to crush Tesla. ", "score": 1, "replies": [{"body": "We could go back and forth about if they will or will not, sure. But the reason they are getting into this market is because of the dominance/success of the Tesla. They will eventually catch up but as of now they are years behind in tech and charging station infrastructure. \n\nTesla will be the Model-T of our lifetime, it's the first of its kind and it's a huge success that will set the standard/pace of the entire industry for some time to come. Sure others will eventually catch up but this vehicle will go down in history as the one that change it all and isn't likely to ever be crushed by the big guys.  If fact, it will be one of the big guys. ", "score": 1, "replies": [{"body": "> Tesla will be the Model-T of our lifetime, it's the first of its kind and **it's a huge success** that will set the standard/pace of the entire industry for some time to come. Sure others will eventually catch up but this vehicle will go down in history as the one that change it all and isn't likely to ever be crushed by the big guys. If fact, it will be one of the big guys.\n\nHow is it a huge success? I think you are being obscenely generous to how you believe Tesla will perform in relation to all other car companies. This isn't 1920, either. Tesla is still having trouble in plenty of states with how their cars are sold. What have they really done recently besides have their reliability questioned and other weird stuff happen, [like asking some owners to stop using their Superchargers so much?](http://www.teslamotorsclub.com/attachment.php?attachmentid=90271&d=1439395043)", "score": 1, "replies": []}]}]}]}, {"body": "Your just buying the stock or doing an option?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "hard to go wrong at that price really. \n\nim just kinda new to the sub and thought it was mostly options around here.", "score": 1, "replies": []}]}]}]}]}, {"body": "I'll put you in a coma so you don't have to worry about your stock for a few years. ", "score": 1, "replies": []}, {"body": "I bought 25 grand worth of Apple stock back in 2007-2008.  That stock is now worth around 300k.  Enjoy, and don't listen to the naysayers :)", "score": -1, "replies": []}]}]}, {"body": "The moon? From 26k in a 500B company? If Apple reached a 1 trillion market cap, you will have 50k.\n\nget the fuck out of here, you are only impressing 20 year olds with your 5 figure balance.\n\nLoad up on the weeklies, or even LEAPS, or leave", "score": 82, "replies": [{"body": "[deleted]", "score": 61, "replies": [{"body": "Why? He's not wrong. ", "score": 5, "replies": [{"body": "Thats basically what he said.", "score": 69, "replies": [{"body": "lol", "score": 4, "replies": []}]}, {"body": "You must be on mobile", "score": 6, "replies": [{"body": "Baconreader shows flairs", "score": 2, "replies": []}, {"body": "oops yeah i was on my phone", "score": 1, "replies": []}]}]}]}, {"body": "the threads here prove that at 80% of this sub has a sub 5 figure portfolio so OPs doing pretty well based on your logic there ", "score": 6, "replies": []}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "OP should really just put $26k into Apple Call's instead.", "score": 17, "replies": [{"body": "OTM weeklies..", "score": 12, "replies": [{"body": "like really out of the money weeklies", "score": 2, "replies": []}, {"body": "Yes please. The market isn't entertaining enough as is.", "score": 1, "replies": []}]}]}]}, {"body": "Do weekly OTM Call options instead. \n\nYou wont have to wait a few years for the moon - you will be there by Tuesday afternoon", "score": 8, "replies": [{"body": "[deleted]", "score": -7, "replies": [{"body": "I don't have a big problem with this investment, more the reasoning. \n\nIf you want big gainz - take advantage of the leverage that options give you. ESPECIALLY since you have conviction about the timing of your investment. That's a clear sign that an options trade could be a bigger gain.\n\nIf you want a return over five years, then why not get some diversity to protect you? Apple is a great company, but five years is a long time for things to change in the technology marketplace. Check out BlackBerry stock price from 5 years ago to see how bad things can go. At $AAPLs current price, it's hard not to at least take a look at $QQQ (I think 10% of holdings are Apple stock)\n\nOverall, I support the trade because it's a good company, and your buying at a discount from a couple weeks ago. Just putting a few more thoughts out there. \n\n1. Consider entering the position via cash secured puts since you are pretty well capitalized. Pocket some premiums on your way in instead of rushing straight in Monday. This stock went down in 2013 when everything else went straight up. Lots of reason for a thoughtful entry point. Why not get paid to pay the price you want for the stock?\n\n2. Consider selling covered calls once you are in, or as you enter the trade. You should have over 200 shares, enough to make some weekly paper that you could funnel back into your position along with your dividends. Apple is an active stock with a thriving weekly options market. ", "score": 19, "replies": [{"body": "This^", "score": 3, "replies": []}]}, {"body": "Are you retarded from all those football hits to the head? All in SUNE you won't regret it", "score": 7, "replies": [{"body": "I actually think SUNE is looking good at this price. That being said I'll wait until the market settles a bit before I buy in. SUNE is a true YOLO stock, it's either going to be worth at least $30/share or it's going to be worth $0. The market sold off SUNE over its share issuing and debt restructuring, but in the long run I see those as positives. The short-term pain was necessary in this case.", "score": 2, "replies": []}]}, {"body": "No worst case  is this bitch goes to zero ", "score": 2, "replies": []}, {"body": "> I guarantee 5 years from now I will have a decent return on this investment.\n\nlol", "score": 1, "replies": []}]}]}, {"body": "In 2000 I had my dad move 10k of my \"college fund\" out of a Janus mutual fund and solely into apple. I was just about to enter high school. Most dads don't listen to their kids, I'm grateful mine did. \n\nRode\n\nThat\n\nMotherfucker\n\nTo\n\nThe\n\nMoon. \n\n\nCollege paid for and then some. \n\nGood luck OP. See you here soon. ", "score": 29, "replies": []}, {"body": "Kid loves his iPhone. Thats enough due diligence for this subreddit anyway. Dont blame him though, he's concussed. ", "score": 38, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Then he would be putting the $26k into weekly AAPL call options, which is an entirely different level of YOLO. That is, unless fs was just paper trading.", "score": 10, "replies": [{"body": "Is there a way to paper trade options? I want to learn to trade options", "score": 2, "replies": [{"body": "thinkorswim papermoney", "score": 5, "replies": []}]}, {"body": "Nah francis was for real man. You can still watch archives of his streams on yt", "score": 1, "replies": []}]}]}, {"body": "Idiot", "score": 6, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Chairman Mao is having a word with the op.\n\nhttp://imgur.com/0fzMFnI", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 25, "replies": [{"body": "While the thing you're doing is textbook crazy per \"investors\", this is probably one of the mildest, least yolo things you can do with your money.  Tell everyone who gives you shit to go fuck themselves.\n\n\nWorst case you're down 20% in 6 months because the market crashed.", "score": 18, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "I know this is late, but so were you - your entire thesis relies on shit that hasn't happened yet.  Seriously it's like the doomsdayers at Amazon saying they'll never make money.  It gets old.", "score": -1, "replies": []}]}, {"body": "Watch China crash and a Fonebook (yes faggots that's the Facebook phone) launch in a month. Apple tanks because half of their future earnings potential is China and 60% of their current earnings are derived from iPhone sales. Calling it now. Don't fuck this up Zuckerberg\n\n", "score": 6, "replies": []}, {"body": "Yeah but this YOLO doesn't have an exciting upside. Like where the fuck is AAPL going? They got nothing up coming and been living off the same phone for 7 years. ", "score": 2, "replies": []}]}]}, {"body": "I think this is a good investment. Its got a low P/E and when you factor in the 200+ billion in cash an even lower P/E. It pays a dividend. The company is positioning itself to be a part of every aspect of our existence from TV and living room to when you get in your car. Over the long term this is a great investment.", "score": 4, "replies": []}, {"body": "fuck yah, my boy pmills\nid suggest buying OTM call options instead and only yolo like 4-5k :)\nJan 29 Calls at 105$ strike might be a good idea...wink", "score": 5, "replies": []}, {"body": "If you really want to YOLO, put it all in $AAPL calls.", "score": 3, "replies": []}, {"body": "YOLO", "score": 6, "replies": []}, {"body": "/r/investing. ", "score": 3, "replies": []}, {"body": "Come on dude, put that shit in NVDA.", "score": 3, "replies": []}, {"body": "Ahh yes.  The 100% portfolio bet.  Why don't you add a bit of leverage to it?", "score": 3, "replies": []}, {"body": "I believe in you OP. I think NVIDIA is a better choice though because they basically have a monopoly. Same with Intel. ", "score": 3, "replies": []}, {"body": "God speed, young yolo'er", "score": 5, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "In which stock?", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Who cares about the iPhone anymore? You just invested in Apple and you failed to realize that the only reason their dumbass hipster corporation is afloat is because of the global sheepery that follows the dumb iPhone brand. That being said, I did write this comment on an iPhone. Still.", "score": 20, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Because the company currently derives like 60% of its earnings from the iPhone. There are plenty of things that could go wrong for Apple in the next 5 years. IMO from a macro perspective this is a terrible time to invest in Apple. Best of luck to you though", "score": 6, "replies": []}, {"body": "since the introduction of iPad 1 many years ago - which I freely admit was an amazing device for that price point; and instantly drove AAPL much higher as I recall buying Long Calls at MARKET during that keynote (and smart people never buy a fast moving option at MARKET) but indicates the stock depend when iPad1 hit\n\nSince iPad1 - what 'wow' has AAPL came out with? \n\nPlease don't say SmartWatch, please don't say AAPL SmartCar (iCar) in a few years. ", "score": 2, "replies": []}, {"body": "I'd still wait at least until this marketwide shitfest is over, AAPL isn't done falling...", "score": 1, "replies": []}]}]}, {"body": "I am not agreeing or disagreeing with your AAPL views.\n\nI will point out the cliche history repeats is often true; but very hard to see it in real-time vs backward looking.\n\n1980s : Sony ruled the tech product space : Period. They made great shit for a high price. It was worth that higher price given their quality. .............. They blewup\n\n1990s-early 2000s : BBRY BlackBerry : Company invented smartphones, ruled corporate america in the phone space. Back before most individuals owned an expensive personal phone. \nThey got lazy, rested on their laurels; and blewup. \n\nIBM: inventor of the bloody PC : outsourced too much labor into 3rd world countries, spent money on stock buybacks rather than more productive use of their money. Not blown up, but stock has been dead money for years, making new multi year lows with no turn-around in site.\n\nYHOO Yahoo.com one might say they were one of the inventors of what we now call the 'net - Amazing website in the mid to late 1990s - Other than their $ in BABA, their stock price itself is basically at $0\n\nAOL: ruled the world in the mid to late 1990s, look what happened.\n\nI am not in any fashion suggesting AAPL will blow up in the next 5-10 years; but stocks you know now were either non-existing 10-15 years ago or were very unknown my most. Such as GOOGL NFLX TSLA FB \n\nFrom 2008 to 2009 AAPL declined 50%\n\nFrom 2015 high to now, AAPL has declined approx 30%\n\nAny stock that can decline 30-50% in one year is violative (duh) and thus carries Risk making it impossible to predict 5 or 10 years out.", "score": 9, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "yes, I was trading in 2008-2009 and have fond memories of AAPL printing 200 on the first trade day of Jan 2009 and then going under 100 by March 2009; doing a massive double bottom to $85 in March 2009.\n\nAAPL was at $85 when they shocked and introduced iPhone1 \n\nThat said, how do you know we are not going to have a repeat (to a lesser degree) of 2008 here in 2016.\n\nYes, in 2008 AAPL went down very very hard with the Tape.\n\nBut what if that repeats again? (NOTE: not repeat NOT saying it will; but asking 'what if')\n\nWhat if the SPX loses 1850 and goes down to 1500-1600 and takes AAPL down to 65-70. Possible if China is indeed blowing up, if oil remains in the low 30s or even approaches $25; if earnings are terrible, if another more serious terror event takes place, etc. \n\nA good trader knows they cannot predict the future - but must ask themself what-if scenarios ; and trade/hedge accordingly \n\n", "score": 1, "replies": []}]}]}]}, {"body": "AAPL", "score": 2, "replies": []}]}, {"body": "proof?", "score": 2, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Tree fiddy?", "score": 4, "replies": []}]}]}]}, {"body": "But why waste that money on a company with a P/E around 10, a price to cash per share of like 2.5 and insanely loyal userbase?  Literally everytime a fucktard analyzed their supply chain and said they'd miss earnings they were right... Don't double check, just take my word for it.  Guaranteed to continue down. ", "score": 5, "replies": []}, {"body": "Dude.  I dunno why I didn't do that.  I have 21 k.  I will do the same.  We can be appl twins", "score": 2, "replies": []}, {"body": "Put more than 26k, thats what the margin is for.", "score": 2, "replies": [{"body": "Fucking with margin = The true YOLO", "score": 1, "replies": []}]}, {"body": "ITT: people giving actual investment advice\n\n/u/pirate2012 talking sense\n\ni don't even know who we are anymore\n\n/r/wheredidtheYOLOgo", "score": 2, "replies": [{"body": "if it helps your need for YOLO - Friday Dec 31 2015 PCLN JAN08 1275 puts were $5, and hit $115 one week later on Friday Jan 08 2016.\n\nIs $5 to $115 in one week enough YOLO for you? :)\n\nOne can YOLO with some thought put into it..........", "score": 1, "replies": []}]}, {"body": "Please wait If you're in this for the long haul. There's a higher risk if it going much lower than making huge gains. ", "score": 2, "replies": []}, {"body": "I have never wanted aapl to tank as bad as I do now.", "score": 2, "replies": [{"body": "Why are you being a fag to OP? :(", "score": 20, "replies": []}]}, {"body": "What are you planning to do? Feb calls?", "score": 1, "replies": []}, {"body": "For max effects long the last January weekly 120's", "score": 1, "replies": []}, {"body": "At least take a couple weeks/months to scale into the position..If the S&P goes down a lot this year there will be a huge difference in your cost basis and future returns", "score": 1, "replies": []}, {"body": "Put half of that in Apple(this will still count as a Yolo), keep the other half and invest it in tranches over the next 12 months...\n\nAlso: Emphasis on long term here...The market can stay irrational much longer than you think, Apple might show healthy earnings 27th Jan and still drop to P/E<5", "score": 1, "replies": []}, {"body": "You should get some SBUX while you're at it, and come back in a few years to.", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "If there is another blood bath this week I'ma load up. I'd say if it gets to $55 or lower buy the hell out of it", "score": 1, "replies": []}]}]}, {"body": "Did you decide to do it because of [the stupid website](http://newinvestordaily.com/what-would-it-be-worth/) in /r/dataisbeautiful?  See you on your yacht!", "score": 1, "replies": []}, {"body": "This is fantastic. ", "score": 1, "replies": []}, {"body": "get long on gold stocks dude, appl is gay", "score": 1, "replies": []}, {"body": "That's no rocket, that's a probe", "score": 1, "replies": []}, {"body": "Buy SUNE pussy", "score": 1, "replies": []}, {"body": "Hahaha, see you at $90 before Q2 2016.", "score": 1, "replies": []}, {"body": "AAPL is still  $700 pre split", "score": 1, "replies": []}, {"body": "Stop being a baby and get some options exposure. I want to see dat leverage ratio up to at least 10x.", "score": 1, "replies": []}, {"body": "AAPL. Enjoy your losses rofl. ", "score": 1, "replies": []}, {"body": "But why apple?    \nPick something cooler.", "score": 1, "replies": []}, {"body": "Why aren't you leveraging all that money in options? ", "score": 1, "replies": []}, {"body": "so did you buy calls or the stock?", "score": 1, "replies": []}, {"body": "As much as I wanna see you YOLO as a college student using student loans too ... \n\nDon't forget the basics. \nBreaking a fundamental rule in riding one stock. \n\nIf you're smart as you say you are you could pick 5 winners ", "score": 1, "replies": []}, {"body": "people seem to think that when a price goes down its a better value.", "score": 1, "replies": []}, {"body": "iPhone production cut by 30%, iPhone accounts for 65% of profits, numerous downgrades...yeah this sounds like a great long term investment... ", "score": -1, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "I don't read either...these figures are common knowledge. Information was dispensed through numerous outlets...now stop acting like a little girl.", "score": 3, "replies": [{"body": "100000% agree bro. Literally never have the predictions made using their supply chain been wrong.  I mean, except basically every quarter for the last four years... if you throw out all that date the model totally works!", "score": 6, "replies": [{"body": "Lol this is different, iPhone 6 is seriously lacking innovation, to the point where people are actually taking it back because it's so boring. People always do this, they think companies are just too huge to fail. http://www.techinsider.io/iphone-6s-was-the-most-boring-iphone-2015-10  ", "score": -1, "replies": []}]}, {"body": "Then you also now that fiscal q3 iphone numbers weren't cut, just the q2 numbers because there is a lot of invetory left from q1?  Then you have downgrades of like 5-10 bucks on price targets of 120-160 bucks. Moreover we are also in the S cycle with the lowest improvements over the previous iphone(6) we ever had. Apple also has a P/E of about 7 ex-cash.  \nGo fuck yourself.", "score": -2, "replies": [{"body": "Go all in...we'll talk in a few months. :-)", "score": 1, "replies": [{"body": "Why would I go all in ? Unlike you I am not a retard.", "score": 1, "replies": [{"body": "Don't be a pussy.", "score": -2, "replies": []}]}]}]}]}]}]}, {"body": "Just as we are entering another economic crisis that will lead to folks having less disposable income for luxury products you are going to buy into a luxury product manufacturer?", "score": -1, "replies": [{"body": "Yeah pretty much.", "score": 6, "replies": []}, {"body": "We are not entering an economic crisis.  China and Europe have been recurring havens of shit in the past 7 years.  \"We\" =! United States.  Globalization doesn't mean automatic crisis in America when China and Greece are getting dickniggered.", "score": 2, "replies": [{"body": "Even if there isn't a crisis looming in the USA, it's not the only country buying said luxury products. \n\nhttp://www.telegraph.co.uk/finance/newsbysector/mediatechnologyandtelecoms/electronics/11567022/Apple-sells-more-iPhones-in-China-than-US-for-first-time.html", "score": 2, "replies": [{"body": "Doesn't matter.  Most rich people stay rich during (or get richer by taking advantage of) crises.", "score": 0, "replies": []}]}]}]}, {"body": "godspeed on your YOLO and possibly bad investment", "score": 0, "replies": []}, {"body": "http://blog.alphaarchitect.com/2014/09/09/how-many-stocks-should-you-own-the-costs-and-benefits-of-diversification/", "score": 0, "replies": []}]}
