{"title": "Help with an UPS Iron Condor Gone Wrong.", "selftext": "I'm looking for some help on a trade I started back in September before earnings for UPS, the underlying had broken through my put sides and I ended up rolling for some credit to Dec 18th. I'm unsure how to continue to roll or close these trades without suffering a huge loss. I'm using IBKR for my brokerage and mostly trading from the IBKR mobile app. I'm somewhat comfortable with the desktop IBKR Trader Workstation. I'll lay out the two current trades in UPS (current premium in parentheses):\n\n**Trade 1**\n1 UPS 165p Dec 18 (1.53)\n-1 UPS 170p Dec 18 (3.89)\n-1 UPS 165c Dec 18 (5.00)\n1 UPS 170c Dec 18 (2.23)\n\n**Trade 2**\n1 UPS 165p Dec18 (1.53)\n-1 UPS 175p Dec 18 (7.45)\n-1 UPS 165c Dec 18 (5.00)\n1 UPS 175c Dec 18 (0.93)\n\nAny guidance or suggestions would be greatly appreciated.\n\n\n\n\n\nEdit: here is a screenshot of the positions. $1.39k settled cash but only $26 buying power.\n\nhttps://imgur.com/gallery/5tktJvG", "id": "kc28wc", "created_utc": 1607825923.0, "score": 2, "upvote_ratio": 0.75, "num_comments": 12, "comments": [{"body": "This isn't a condor this is two short box spreads (that are pretty failed given the premiums vs the width of the spread). In theory if you can hold to expiration without being early assigned your credit from the spread should basically equal or come close to your max loss on a spread.\n\nIf you have the collateral to cover early assignment you should be able to take early assignment and hopefully close out each spread with minimal slippage.\n\nThe issue is going to come down to how many of these spreads did you end up selling and how much slippage are you going to take trying to close out your options when the price is fluctuating. If you only have 1 of each trade just hold it to expiration and take a small loss when you close it out on expiration and hope slippage doesn't screw you over too badly.", "score": 3, "replies": []}, {"body": "I think u shouldn’t use UPS to ship irons , they gave your iron in short boxes , this is bad for irons special condor ones", "score": 3, "replies": []}, {"body": "I think with the market likely to go up Monday due to the release of the Covid vaccine. You probably should sell all the purchased and sold calls as soon as you can. Consider getting an order ready for sale when the market opens if you see UPS rising in the premarket.\n\nOn the put side, I would wait and see what happens Monday. Your sold 170 put should go out of the money if the stock rises sharply. Your sold 175 put could go out of the money if things get crazy next week. \n\n**If the market keeps going up** your sold puts should keep losing value and you **might** want to hold the puts to Friday as they will keep losing value. If either sold put goes out of the money it should be closed along with it's protecting put in case the market turns down.\n\n**If none of this makes sense to you then the smartest thing is to just close out  the whole trade as soon as possible.**", "score": 2, "replies": [{"body": "This makes perfect sense. I'll try closing out the call credit sides before they go further ITM leaving the put credit spreads to go OTM and closing them to avoid any risks of retracement in the underlying.", "score": 1, "replies": [{"body": "Ok hang in there and let's hope that works out.\n\nIn the future ask for help early on if you think something is getting away from you. The sooner you identify a problem the more choices you have to fix it.\n\nBest of Luck", "score": 2, "replies": [{"body": "Thank you, I appreciate the advice! In retrospect, I definitely should have made this post earlier.", "score": 1, "replies": []}]}]}]}, {"body": "I'm a little confused. In one you put on a strangle around $165. Then in two you sold an in the money put at $175?\n\nYou were hoping the stock would increase in price beyond $175? And these are two separate trades you rolled from September. And now both your call sides are in the money also?\n\nAnd the prices by the options are what you paid/earned when you bought the spreads? Or are these current prices?", "score": 1, "replies": []}, {"body": "Can you post a screenshot with any personal info blurred instead?", "score": 1, "replies": []}, {"body": "May I ask where you learned this peculiar variant of the ‘Iron Condor’? 🤔", "score": 1, "replies": [{"body": "Maybe calling this current trade an iron condor would be incorrect, but my initial trade in September was an IC.", "score": 1, "replies": []}]}, {"body": "close the position go after another opportunity", "score": 1, "replies": []}, {"body": "There’s no fixing... whatever you managed to do with those boxes. Just take the L and get out of those positions.", "score": 1, "replies": []}]}
{"title": "Going naked", "selftext": "It seems counter intuitive on the surface but I am finding that when trading neutral strategies, defined risk is riskier than undefined risk. For example, if I have an iron condor with $10 or $20 wings, the best management strategy I can do is roll the untested side up to an iron butterfly and then wait and hope that the underlying moves back towards the centerpoint. If the underlying continues moving toward the long option, there’s not even positive theta to look forward to.  I can only hope to cut losses by adding more risk with an additional directional short or add static deltas with a stock purchase. I trade smaller with defined risk because I may have to add additional position risk and would only really opt for a wide Iron Condor over a strangle in order to cap buying power reduction on something like an Amazon.\n\nWith a strangle, I can roll up or down to keep deltas near zero, always collecting additional credit. I can roll out and re-center the strikes and can even spend some premium to go inverted and then recenter when uninverting later. Best of all, looking at a position with 30 or 40 positive theta is a thing of beauty. \n\nReally I hate giving in on a losing trade.  When playing both side with naked options, losers can usually be managed to scratch or a very small loser. With defined risk, it is pretty much just a wait and hope without much recourse based on short term direction of the market.  \n\nDo what you feel comfortable with, don’t take on more risk than you feel you can manage, but learn all you can and consider things in a way you may not have.", "id": "kceusu", "created_utc": 1607881312.0, "score": 4, "upvote_ratio": 0.75, "num_comments": 11, "comments": [{"body": "**Defined** = Peace of Mind = No adjustment/rolls = Lower Probability of Profit = Better ROC\n\n**Undefined** = Higher Risk = NEED for adjustment/rolls = Higher Probability of Profit = Crappy ROC (because of higher BPR)", "score": 4, "replies": [{"body": "Peace of mind comes from a personal perspective. I worry much more about defined risk positions that have gone bad because there isn’t much I can do to fix them.", "score": 1, "replies": [{"body": "Yes, but if your underlying goes bankrupt or is taken over your max loss is defined. A single one of these instances with an undefined position could blow up your account. That's what I mean by peace of mind, not whether you find them better or not, that is a matter of preference.", "score": 1, "replies": [{"body": "True. There’s always a chance of some earth moving event. That’s why trading small means the world.  Trading options on a company that has a reasonable risk of going bankrupt is just gambling.\n\nROC is higher on defined risk, but one or two max loss outcomes cuts into P/L significantly.   Defined risk seems more like a gamble on your opening assumption being correct.  \n\nI find that trading companies that have strong balance sheets and have highly liquid options, with high implied volatility, leaves a worthwhile risk to reward ratio.", "score": 0, "replies": [{"body": "I agree with you. However, to paint the whole picture and just in case anyone is starting out with very little capital it's worth mentioning that defined risk allows them to start using options strategies that would be unavailable to them if they used their naked counterparts.\n\nFor traders with capital and experience, there is no doubt, especially if you are focusing on option-specific bets (vega, theta, etc), that naked (or as close to naked as possible) is the way to go.", "score": 1, "replies": [{"body": "Awesome discussion. Thanks! I too will always recommend people start with small defined risk trades. The closing sentence in the OP was a “only do what you are comfortable with” cover.  Believe me, I have a ton more to learn, just thinking out loud and hoping to trigger some discussion and debate.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "FWIW, I just purchased a nice 15-year dataset of EOD SPY option prices and have been backtesting various basic options strategies on it, and the only ones I found to be consistently profitable are those involving selling naked :/\n\nGranted I‘ve only tested buy-and-hold-to-expiration strategies so far, no rolling/adjustment, but definitely opened my eyes to how biased the options market is against those without adequate margin to hold naked positions. Can’t wait until I hit $100k and start using portfolio margin to take advantage of that.", "score": 3, "replies": []}, {"body": "> but I am finding that when trading neutral strategies, defined risk is riskier than undefined risk. \n\nIn my experience, 90% of so-called risky outcomes for directionally neutral strategies comes from **using a neutral strategy on an underlying with a large or uncertain trading range.** Soooo many people overlook the pre-condition that a neutral strategy is intended for an underlying that is expected to be in a *narrow* trading range for the holding time. This is particularly true for strategies like iron butterflies or short straddles, where there has to be a pretty solid, fact-based conviction for the underlying to hit a specific price before expiration. How many iron flies and short straddles on GME, PLTR, TSLA, and other extremely volatile meme stocks lately? Too many.\n\nAnother way to look at this is that for a directional strategy, you only have to get the direction right. For a delta-neutral strategy, you have to get *both direction and magnitude right*. \n\nIs it then any wonder that people seem to have low win rates on such strategies?\n\n> Really I hate giving in on a losing trade. \n\nThat's a systematic error. Loss is the consequence of risk, and risk is how we make money trading options. Don't try to win every trade, that's crazy. Instead, shoot for a high frequency of trades and a good average win rate. Make your money on base hits, not swinging for the bleachers.", "score": 2, "replies": [{"body": "I’m usually not skilled enough to pick a direction. If I am bullish and we stay in a bull market then great, but market pullbacks really hurt from counter price movement that is usually accompanied with an increase in volatility, a double whammy. Actually prefer to lean a little short at the portfolio level to hedge. \n\nRegarding neutrality, I agree with you on the premise of delta neutral strategies and underestimating trading ranges. ATM straddles are not my cup of tea. Strangles however at 1SD have a very positive win rate provided you adjust aggressively when things begin to move.  I think that the key here is active management. Collecting credit is king. At the end of the day, if my credit collected is more than the cost to cover then I don’t care where the position sits in the range between a call and put provided that there is enough extrinsic value to counter assignment risk along the way. There is a time to close undefined trades at a loss if there isn’t enough short vol remaining in the trade. Other than that, the trade usually comes around eventually. \n\nThe short strangle is more appealing if you believe that prices usually reverts to a long term mean. Thanks, appreciate the discussion here.", "score": 1, "replies": [{"body": "I agree with you that iron condor wings are mostly worthless and I really dislike how sites like Tastytrade call iron condors a defined risk strategy.\n\nI'm not a fan of having my short calls and puts run over and the idea that buying two wings within 3 points of your shorts is somehow a good thing is pretty ridiculous.\n\nBetter to push the wings way out to save money if you need them for your spreads or go without the wings if your broker allows it.\n\nAnyway, its good to hear from someone that is taking control. Best of luck.", "score": 1, "replies": []}]}]}, {"body": "I only use defined on high price tickers due to increase of buying power, i agree with you.  Runaway stocks can blow your month though zm earnings really nailed me and i lost money that month even going inverted", "score": 1, "replies": []}]}
{"title": "Weekend IV Report - Tickers with LOW Implied Volatility and lower premiums", "selftext": "What's up fellas at Options. I made a tool called [FD Ranker](https://www.swaggystocks.com/dashboard/stocklabs/fd-ranker) that logs the average IV of popular tickers. The tool is inclusive of almost 1,000 tickers now.\n\n**What is this tool good for**\n\nI posted in ThetaGang the list with HIGH IV options which is great for running the wheel or selling options. This list is an inverse of that list and displays tickers where IV is pretty low, thus, purchasing calls will likely be cheaper. For example, AAPL implied volatility right now is near the lows and almost back to the pre-March lows. Remember a low IV can go lower and a high IV can go higher. Do your DD before entering any positions!\n\nIf you guys find this list useful (it's my first time posting this here), I can make this a weekly/weekend thing. I like doing it on Sundays so I can prepare for the trading week ahead.\n\n# Low IV Tickers List\n\n\\*Some of the market cap data is off, so always double check before entering any plays! Also, the \"next earnings date\" data will resume starting in January, 2021 (very soon).\n\nPlease note this list is only inclusive of the more popular tickers mentioned around Reddit. If you want to see the full list and filter by ticker, check out the tool in the link at the top.\n\n&#x200B;\n\n|Ticker|Market Cap|Stock Price|IV (%)|Next Earnings Date|\n|:-|:-|:-|:-|:-|\n|VZ - Verizon Communications Inc|250B|$60.38|16%|N/A|\n|SPY - SSgA Active Trust - SSGA SPDR S&P 500|320B|$366.09|17%|N/A|\n|PG - Procter & Gamble Co.|338B|$136.56|18%|N/A|\n|PEP - Pepsico Inc.|200B|$144.79|19%|N/A|\n|HSY - Hershey Company|22B|$149.34|19%|N/A|\n|WM - Waste Management, Inc.|48.8B|$115.20|20%|N/A|\n|KO - Coca-Cola Co|229B|$53.48|20%|N/A|\n|MCD - McDonald\\`s Corp|155B|$207.36|22%|N/A|\n|COST - Costco Wholesale Corp|166B|$375.02|22%|N/A|\n|WMT - Walmart Inc|416B|$147.02|23%|N/A|\n|TM - Toyota Motor Corporation - ADR|246B|$151.16|23%|N/A|\n|CSCO - Cisco Systems, Inc.|187B|$44.22|23%|N/A|\n|YUM - Yum Brands Inc.|32B|$105.84|23%|N/A|\n|MMM - 3M Co.|100B|$174.00|23%|N/A|\n|ORCL - Oracle Corp.|182B|$60.56|24%|N/A|\n|BMY - Bristol-Myers Squibb Co.|137B|$60.70|24%|N/A|\n|JNJ - Johnson & Johnson|403B|$153.16|24%|N/A|\n|V - Visa Inc - Class A|441B|$206.32|25%|N/A|\n|MO - Altria Group Inc.|79.9B|$43.06|25%|N/A|\n|SNE - Sony Corporation. - ADR|119B|$94.70|25%|N/A|\n|IBM - International Business Machines Corp.|111B|$124.65|25%|N/A|\n|QQQ - Invesco Capital Management LLC - Invesco QQQ Trust Series 1|147B|$301.07|25%|N/A|\n|HD - Home Depot, Inc.|285B|$264.65|25%|N/A|\n|KR - Kroger Co.|24.3B|$31.41|25%|N/A|\n|TXN - Texas Instruments Inc.|147B|$160.49|26%|N/A|\n|WORK - Slack Technologies Inc - Class A|20.7B|$42.23|26%|N/A|\n|ABT - Abbott Laboratories|190B|$107.20|26%|N/A|\n|SBUX - Starbucks Corp.|120B|$102.80|26%|N/A|\n|T - AT&T, Inc.|221B|$31.00|26%|N/A|\n|IWM - BlackRock Institutional Trust Company N.A. - BTC iShares Russell 2000|54.7B|$190.10|26%|N/A|\n|MSFT - Microsoft Corporation|1.61T|$212.49|26%|N/A|\n|GILD - Gilead Sciences, Inc.|76.2B|$60.66|26%|N/A|\n|GOOG - Alphabet Inc - Class C|1.12T|$1776.38|27%|N/A|\n|DE - Deere & Co.|80.1B|$255.72|27%|N/A|\n|GOOGL - Alphabet Inc - Class A|1.12T|$1768.75|27%|N/A|\n|DPZ - Dominos Pizza Inc|15.1B|$383.53|27%|N/A|\n|UNH - Unitedhealth Group Inc|320B|$336.14|27%|N/A|\n|BX - Blackstone Group Inc (The) - Class A|43B|$63.88|27%|N/A|\n|TGT - Target Corp|86B|$171.99|28%|N/A|\n|LOW - Lowe\\`s Cos., Inc.|116B|$158.17|28%|N/A|\n|MA - Mastercard Incorporated - Class A|324B|$327.35|28%|N/A|\n|DLTR - Dollar Tree Inc|25.1B|$106.73|29%|N/A|\n|EA - Electronic Arts, Inc.|39.4B|$135.85|29%|N/A|\n|UPS - United Parcel Service, Inc. - Class B|120B|$168.34|29%|N/A|\n|CAT - Caterpillar Inc.|97.4B|$179.71|30%|N/A|\n|INTC - Intel Corp.|204B|$49.77|30%|N/A|\n|BK - Bank Of New York Mellon Corp|35.6B|$40.35|30%|N/A|\n|CVS - CVS Health Corp|93.7B|$71.54|30%|N/A|\n|GS - Goldman Sachs Group, Inc.|82.6B|$239.64|30%|N/A|\n|ATVI - Activision Blizzard Inc|64.7B|$83.76|30%|N/A|\n|FIT - Fitbit Inc - Class A|1.77B|$7.21|31%|N/A|\n|JPM - JPMorgan Chase & Co.|364B|$119.47|31%|N/A|\n|HPQ - HP Inc|31.8B|$23.18|31%|N/A|\n|DELL - Dell Technologies Inc - Class C|51.9B|$71.64|31%|N/A|\n|BAC - Bank Of America Corp.|247B|$28.52|31%|N/A|\n|ADBE - Adobe Inc|228B|$474.75|32%|N/A|\n|BABA - Alibaba Group Holding Ltd - ADR|716B|$264.19|32%|N/A|\n|CMG - Chipotle Mexican Grill|36.4B|$1301.22|32%|N/A|\n|DD - DuPont de Nemours Inc|48.7B|$66.41|33%|N/A|\n|MS - Morgan Stanley|115B|$63.34|33%|N/A|\n|EBAY - EBay Inc.|33.8B|$49.13|33%|N/A|\n|AMZN - Amazon.com Inc.|1.56T|$3110.74|33%|N/A|\n|AZN - Astrazeneca plc - ADR|142B|$54.30|33%|N/A|\n|AAPL - Apple Inc|2.08T|$121.88|33%|N/A|\n|TTWO - Take-Two Interactive Software, Inc.|21.9B|$190.25|33%|N/A|\n|DIS - Walt Disney Co (The)|318B|$175.95|34%|N/A|\n|FB - Facebook Inc - Class A|781B|$273.21|35%|N/A|\n|LOGI - Logitech International S.A.|15.5B|$89.72|35%|N/A|\n|AMAT - Applied Materials Inc.|80.6B|$88.03|35%|N/A|\n|NOW - ServiceNow Inc|105B|$537.83|35%|N/A|\n|NKE - Nike, Inc. - Class B|172B|$137.34|36%|N/A|\n|HSBC - HSBC Holdings plc - ADR|108B|$26.50|36%|N/A|\n|BKNG - Booking Holdings Inc|85.6B|$2084.50|36%|N/A|\n|PYPL - PayPal Holdings Inc|251B|$213.19|36%|N/A|\n|QCOM - Qualcomm, Inc.|163B|$143.54|36%|N/A|\n|FOXA - Fox Corporation - Class A|17.4B|$29.34|36%|N/A|\n|BIDU - Baidu Inc - ADR|56.2B|$161.36|37%|N/A|\n|GOLD - Barrick Gold Corp.|40.7B|$22.89|37%|N/A|\n|CRM - Salesforce.Com Inc|204B|$221.62|37%|N/A|\n|WDAY - Workday Inc - Class A|39.5B|$219.16|37%|N/A|\n|WMB - Williams Cos Inc|26.6B|$21.86|37%|N/A|\n|XOM - Exxon Mobil Corp.|185B|$43.70|38%|N/A|\n|NFLX - NetFlix Inc|222B|$502.05|38%|N/A|\n|TSM - Taiwan Semiconductor Manufacturing - ADR|540B|$103.76|39%|N/A|\n|DB - Deutsche Bank AG|21.9B|$10.63|39%|N/A|\n|C - Citigroup Inc|123B|$59.00|39%|N/A|\n|PZZA - Papa John\\`s International, Inc.|2.8B|$84.64|40%|N/A|\n|NVDA - NVIDIA Corp|322B|$519.09|40%|N/A|\n|ULTA - Ulta Beauty Inc|15B|$265.08|40%|N/A|\n|LULU - Lululemon Athletica inc.|43B|$344.52|41%|N/A|\n|JD - JD.com Inc - ADR|120B|$82.30|41%|N/A|\n|TEAM - Atlassian Corporation Plc - Class A|30.6B|$231.63|41%|N/A|\n|GM - General Motors Company|60B|$41.87|41%|N/A|\n|LVS - Las Vegas Sands Corp|43.3B|$56.71|41%|N/A|\n|ARKF - ARK ETF Trust - ARK Fintech Innovation ETF|1.36B|$48.18|42%|N/A|\n|WFC - Wells Fargo & Co.|120B|$29.07|42%|N/A|\n|MTCH - Match Group Inc. - New|38.4B|$147.64|42%|N/A|\n|WBA - Walgreens Boots Alliance Inc|35.9B|$41.55|42%|N/A|\n|ICLN - BlackRock Institutional Trust Company N.A. - BTC iShares Global Clean|3.18B|$23.62|42%|N/A|\n|F - Ford Motor Co.|35.2B|$9.02|43%|N/A|\n|SPLK - Splunk Inc|24.9B|$154.76|43%|N/A|\n|PCG - PG&E Corp.|23.7B|$11.98|43%|N/A|\n|BP - BP plc - ADR|74.4B|$21.95|43%|N/A|\n|ZNGA - Zynga Inc - Class A|9.38B|$8.71|43%|N/A|\n|MELI - MercadoLibre Inc|79.9B|$1592.61|43%|N/A|\n|ALLY - Ally Financial Inc|12.7B|$34.03|44%|N/A|\n|ARKW - ARK Investment Management LLC - ARK Next Generation Internet ETF|4.47B|$143.77|44%|N/A|\n|VALE - Vale S.A. - ADR|89.1B|$16.84|45%|N/A|\n|LUV - Southwest Airlines Co|27.1B|$45.70|45%|N/A|\n|EXPE - Expedia Group Inc|16.7B|$122.86|46%|N/A|\n|WDC - Western Digital Corp.|15.5B|$50.99|46%|N/A|\n|CHGG - Chegg Inc|10.6B|$81.51|46%|N/A|\n|PFE - Pfizer Inc.|228B|$41.09|47%|N/A|\n|OKTA - Okta Inc - Class A|30.6B|$252.36|47%|N/A|\n|GE - General Electric Co.|97.8B|$11.13|47%|N/A|\n|FDX - Fedex Corp|76B|$289.91|47%|N/A|\n|DBX - Dropbox Inc - Class A|7.11B|$22.30|47%|N/A|\n|MU - Micron Technology Inc.|78.8B|$70.48|48%|N/A|\n|SHAK - Shake Shack Inc - Class A|3.31B|$86.41|49%|N/A|\n|DOCU - DocuSign Inc|42.1B|$224.77|49%|N/A|\n|UBER - Uber Technologies Inc|92.8B|$52.42|49%|N/A|\n|AMD - Advanced Micro Devices Inc.|110B|$91.54|49%|N/A|\n|TWTR - Twitter Inc|40.9B|$51.43|49%|N/A|\n|UAA - Under Armour Inc - Class A|6.72B|$17.17|49%|N/A|\n|RH - RH - Class A|8.37B|$431.18|49%|N/A|\n|ESTC - Elastic N.V|12.3B|$141.35|49%|N/A|\n\n&#x200B;", "id": "kcfg47", "created_utc": 1607883206.0, "score": 36, "upvote_ratio": 0.91, "num_comments": 17, "comments": [{"body": "Thanks!", "score": 4, "replies": []}, {"body": "This is fantastic, thank you. How are you calculating IV for each stock since the IV changes based on expiration and strike? I would love to be able to sort IV by expiration as I usually only buy LEAPS", "score": 5, "replies": []}, {"body": "Is the IV a rank, percentile, or just the index?", "score": 3, "replies": [{"body": "Just the index, not IVR.", "score": 2, "replies": []}]}, {"body": "One reason we can speculate the volatility of Hershey's might go up, is that they were caught buying cocoa beans on options exchanges, trying to avoid buying from the facility set up with anti-child labor protections.\n\n1. Hershey's options purchases of cocoa beans send beans up higher 6 days ago: https://www.morningbrew.com/daily/stories/2020/11/22/cocoa-futures-skyrocket-thanks-reported-hersheys-trade\n\n2. None of this gets much notice, including when West African countries busted Hershey & threatened reprisal, except after the dispute is \"settled\" and Hershey's stock price actually ROSE for that reason 3 days ago: https://www.cnbc.com/2020/12/07/stocks-making-the-biggest-moves-in-the-premarket-iac/interactive-ford-eastman-kodak-more.html. So far, Hershey's just sees net gains due to its bad behavior.\n\n3. But in the past couple of days, Hershey's child-labor cocoa beans buys is starting to get some attention. See this NBC article yesterday: https://www.nbcbayarea.com/news/national-international/the-war-on-cocoa-hershey-co-accused-of-not-upholding-sustainability-efforts-in-west-africa/2421880/\n\nPersonally, I think Hershey's needs to be called out for its child labor cocoa beans buys, because it's not the first time it's been caught trying to undercut basic price controls in what is already one of the lowest-wage regions of the world, with or without child labor.  They also were called out for child labor chocolate in 2019:  https://www.washingtonpost.com/graphics/2019/business/hershey-nestle-mars-chocolate-child-labor-west-africa/\n\nThis is literally just brutally greedy behavior, because it's practically impossible to find labor that is cheaper than what these workers already make with the price controls. \n\nI'm seriously considering attacking Hershey stock on one of Reddit's forums, because they have been continuing to engage in this behavior. Stockholder activism is sometimes the only way these companies change abuses. \n\ntldr; Hershey's has been secret-buying child labor cocoa beans on options exchanges this year, and has been a problem behind child labor cocoa for years, in fact. It stock deserves some volatility right about now. This is a heads up I might post a rant about Hershey's behavior, asking for stockholder activism next week.", "score": 7, "replies": [{"body": "Not really sure this is the right place for your political opinion about child labor. I feel like that screed could have been left out, but thank you for this info on why it might be a good idea to buy a strangle on Hershey.", "score": -10, "replies": [{"body": "It's not entirely a political opinion, tho. Child labor in West Africa is illegal, and Hershey's been actively circumventing market and government protections against child labor for years. \n\nThis kind of issue is known as [an ESG risk](https://www.morningstar.com/features/esg-risk)", "score": 7, "replies": [{"body": "Which is fair enough. Like I said, I appreciate the info about how engaging with child labor may affect their stock price.", "score": 2, "replies": []}]}]}]}, {"body": "The top half of this table looks like my dividend portfolio, and the bottom half looks a lot like my wishlist.", "score": 2, "replies": []}, {"body": "Dbx low iv is over to the moon moday.", "score": 1, "replies": []}, {"body": "You're the best swaggy thanks for these. Found some real good LEAP gems here.", "score": 1, "replies": [{"body": "What you buying?", "score": 1, "replies": [{"body": "VZ PEP KO MCD COST TAK WM MO. Companies I believe will be doing well or better in 1 or two 2 years. It's like planting a little money tree and watching it grow lol.", "score": 1, "replies": [{"body": "So you are doing end of 2021 and 2022 call expiration?", "score": 1, "replies": [{"body": "21 for some 22 for others. Anything below 1.00 is easy pickings. Even if I don't think it will hit that strike, the contract itself will be worth considerably more in a year or two time. I don't plan to actually hold any of these shares. Or, maybe I get lucky like with one of my PLTR leaps. Turned .83 into 15.00 and still have a year to go! Leaps are some of the best ways to maximize profit while minimizing risk.  Just requires patience", "score": 1, "replies": []}]}]}]}]}, {"body": "Thanks and it would be amazing to have it weekly, perhaps on Thu or Wed to take the weekend as potential advantage.  Thanks", "score": 0, "replies": []}]}
{"title": "Questions about Tesla covered calls", "selftext": "The IV on the TSLA deep OTM weeklies are pretty high. I usually just sell everything naked and I do pretty well.\n\nBut its risky without having shares\n\nI am Thinking about buying 500 shares of TSLA at the next large drop day or days. Hopefully anywhere between $500 to $550 a share. \n\nAnd with that I am planning to sell 25%-30% OTM calls every week for premium. Should be apx $3000 to $5000 a week in premiums. If the stock goes past my strike, then I will lose out on some potential profit but I will be up a boat load on stock still. And obviously if Tesla stock falls to $100 I am beyond screwed but ya.\n\nThoughts???", "id": "kck8n9", "created_utc": 1607898195.0, "score": 4, "upvote_ratio": 0.75, "num_comments": 18, "comments": [{"body": "Why not just sell Cash secured puts at 500-550 and enjoy some of that high IV now? If you're comfortable owning TSLA at that price anyway this is your best route.", "score": 2, "replies": [{"body": "That is very true. So if i sell 5 puts at 500 strike for this friday. And it goes to $490, i will be assigned the 500 correct?", "score": 1, "replies": [{"body": "Yes. You have an obligation to buy the underlying at your 500 strike.", "score": 0, "replies": [{"body": "Not bad", "score": 0, "replies": [{"body": "Not at all. You'd be looking at a net credit of over 2 grand. Only downside is if $TSLA doesn't come back down for a while you'll miss out on potential gains. It sound to me like that's not a big issue because you're not comfortable with the current price.", "score": 0, "replies": [{"body": "Exactly, I am just worried that the stock might go to $400 even because it has such a run up recently, with the EV ride up and all", "score": 0, "replies": [{"body": "I'm worried about that too which is why I don't hold TSLA. Lol.", "score": 2, "replies": [{"body": "We will see what happens in the next month or two", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Nothing wrong with that. If you want to go even further with leverage, just learn how to set up a PMCC or call diagonal spread. I find you can typically leverage 2:1 compared to covered calls. This means you can collect 2x premium taking in the risk of having an option instead of shares.", "score": 1, "replies": [{"body": "Which call and what expiration would you recommend to buy for 500 shares", "score": 1, "replies": [{"body": "I would do actual research and backtesting before entering. But I would enter \n\n+8 TSLA 1/2022 200c \n-8 TSLA 1/15 650c\nNet debit: $365.20\n\nYou are able to collect against 8 calls against your 5 (if you were to use your capital for ITM LEAPs).\n\nThis is (imo) a good middle ground. You have no upside risk while giving yourself protection. For this trade, you break even on 1/16 if TSLA is at $555. Even if TSLA is below $555, you can continue shorting 8 calls against your position until next year", "score": 1, "replies": [{"body": "[-8? Nice. I'm a bot lol.](https://www.reddit.com/r/dankmemes/comments/k8wqdp/behold_your_funny_new_number/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)", "score": 1, "replies": []}]}]}]}, {"body": "I've been selling calls on TSLA [for a while now](https://i.gyazo.com/b387c1a9c3686927547fdd8d2c1df0d6.png). Got \"caught\" last week.  I simply rolled it up until it expired worthless last Friday. Currently, my only open position is -2 TSLA Dec18 525p. I sold that when TSLA fell 7% in one day last Wednesday.", "score": 1, "replies": [{"body": "You arent going as deep OTM as I would but then again I will be using $250k so maybe thats why i can go deeper and still catch good premiums", "score": 1, "replies": [{"body": "You can find good premium that far out?\n\nI usually just sell near the stock's ~2-3 week high/lows.", "score": 1, "replies": [{"body": "For now Tesla is showing high IV, lets see how long it lasts", "score": 1, "replies": [{"body": "I’d be careful. I’ve been sitting out for the past few days due to VIX spiking", "score": 1, "replies": [{"body": "Yes I feel you. I might sell the $450s instead of $500s for the next few weeks on TSLA. We will see", "score": 1, "replies": []}]}]}]}]}]}]}
{"title": "Wait to invest in Tesla? [Newbie]", "selftext": "I'm still very new and learning so please excuse me.\n\nLooking at Tesla stock it shot up around Nov 18th, would it be a sensible idea to wait till it corrects itself back to its pre Nov 18th path? \n\nWould this be a pretty standard way of thinking regarding any stocks? If they are rising, wait for them to fall again before buying? \n\nI own a few stocks and they all fell after I bought them which can be expected I suppose but I think those were some bad timings on my side. So now I'm not buying anymore until I've learnt some more. \n\nAny advice appreciated, any golden/simple rules I should follow? \n\nThanks!", "id": "kc8kor", "created_utc": 1607856221.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 16, "comments": [{"body": "Hello! It looks like you might have submitted a post about getting started, looking for book/YouTube/podcast recommendations, or another commonly asked question on /r/StockMarket. To help new investors and traders with these questions, we created a comprehensive [market toolkit](https://github.com/ckz8780/market-toolkit) which has lots of resources for new and experienced traders alike. Here are some direct links in it that you might find useful:\n\n- [Getting Started](https://github.com/ckz8780/market-toolkit#getting-started)\n- [Books](https://github.com/ckz8780/market-toolkit#books)\n- [YouTube Channels, Talks and Speeches](https://github.com/ckz8780/market-toolkit#youtube)\n\nThe phrase or keyword that triggered this response was \"**Newbie**\". Here's [a customized link that will search the whole subreddit](https://www.reddit.com/r/StockMarket/search?q=Newbie&restrict_sr=on&sort=relevance&t=all) for the same topic.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/StockMarket) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Tesla has went up a lot prior to November as well it was 300 went to 1700 split into 5 to around 340 and is now up to 620 or so.\n\nit’s like your investing in Tesla pre split at 3200 and beginning of year it was at 300 so use your own judgement and invest accordingly.\n\nI wouldn’t touch Tesla now. But I also wouldn’t touch it at 900 pre split so like I said use your judgement.", "score": 8, "replies": []}, {"body": "It depends on how your tolerance of risk is.", "score": 5, "replies": []}, {"body": "I was in the same boat for months and i missed out big time obviously. I just bought 6k USD worth of shares at 610$ and i will keep increasing my position. I believe TSLA is going to go up, i am a long term investor as well. 42% of new cars that are being sold here in Norway was electrical vehicles in 2019. Of these the most sold was Tesla Model 3. This is only going to increase with time", "score": 3, "replies": [{"body": "Electric vehicle percentages will increase while Tesla's percentage of that increase will decrease.  Tesla will never equal the sales of the top 10 car manufacturers combined. Currently they sell in a year what one of the top 5 sell in a month.", "score": 1, "replies": [{"body": "Hardly any other manufacturers other than volkswagen have a defined plan for producing over a million EV's a year by 2025. Tesla will do that in 2022. Everyone will always be trying to catch up to Tesla, and that will create a race to acquire batteries. Tesla went out on its own to redesign the battery from the ground up for massive scales and dramatic cost reductions. That's why they will still stay ahead in EV production throughout the entire decade.", "score": 2, "replies": [{"body": "\"Ahead\" and 95% of the market are two very different terms.  Currently Tesla is priced for the latter.  I agree that Tesla will remain a force in EVs.  That's not what we are discussing", "score": 1, "replies": []}]}]}]}, {"body": "There is no clear answer to your question. Tesla is a very volatile stock and if you should have some strong conviction to hold this stock. It is a very promising company with a great future. First, figure out what kind of trader you are? Are you an investor or a trader?  if you are a trader, you are looking to take profit quickly and if your trade doesn't work sell it quickly and move on to the next stock. Tesla is part of S&P now, and the funds will be buying this stock before 21st December so we should see some upward movement in short term but after that, I can anticipate some sell-off. As I said earlier Tesla is a very volatile stock and If I have to trade this I would buy it using progressive exposure. Meaning first buy 25% of your position and if your trade is profitable add more if not sell it with the stop loss in place. Hope this helps.", "score": 2, "replies": []}, {"body": "Learn to buy on DCA. I bought some $82 a few months ago, added more every time there is a correction.  They added 20% more new issuances so there is dilution.", "score": 2, "replies": []}, {"body": "Its a ridiculous bubble and if you bought now you would have to wait years for the market cap to make sense. This is assuming Tesla does all the things we think they will do to remain competitive in that timeframe (I actually believe they will but not with 100% certainty). Just to give you an idea of how overvalued they are check out this Google sheet I found comparing all car companies https://docs.google.com/spreadsheets/u/1/d/1HflVng6sYIb6Gs4pOKiDGtqU5YJ2-hgdM4pRNaT62gs/htmlview \n\nDo you really think tesla is worth more than the top 10 other car manufacturers? Go stand on the street right now and look at how many cars are there, how many tesla's do you see, and how many Tesla's would you have to see to justify its current market cap. There are people here saying that you should hold long term and not trade and I actually think the opposite, if you buy set a stop or trailing stop loss and take advantage of the momentum, alternatively wait for a volume climax and the first sell down and short the counter trend rally placing a stop loss at above all time high. Don't buy and hold all the way down as this bubble deflates over the next few years.", "score": 3, "replies": [{"body": "Tesla will be well on its way to a multi trillion dollar company in a few years. They are the definition of a disruptive technology company and they plan on 50% year over year growth in battery production throughout this decade. Next year will have 2 more plants online, dojo will be activated which is an exaflop supercomputer designed for machine learning to teach self driving vehicles that's twice as powerful as the current fastest supercomputer, semis are coming soon, new production methods that lead to dramatic cost reductions at scale, continued improvements in manufacturing improvements with every new vehicle line and building, massive grid scale battery projects that could lead them to becoming an energy provider outright and some of the best engineers on the planet are working for Tesla.\n\nRight now may sound expensive, but Tesla is so far ahead of the competition right now that's it not even funny. Tesla will be producing over a million EV's by 2022, and some companies don't even plan to have a million EV's until 2025-2030. Right now Tesla can eat all the market share they want, and we are only a few weeks away from the FSD release that can drive people to work. \n\nThat said, Tesla may drop next week, but it's support keeps establishing a higher baseline, so I don't ever expect it to go below $400 again unless the entire market crashes.", "score": 2, "replies": [{"body": "Its market cap is higher than the top 10 car companies. All their assets, all their revenue, all their future growth. You are banking a lot on what Tesla could be rather than what it is. \n\nThen you say it could drop to 400 which is a pretty hefty dent for anyone buying now. And then you say as long as the market doesn't crash which isn't exactly out of the question since it happens roughly every 10 years. \n\nOnce again not saying Tesla isn't on track to being a very large company in 10-20 years but it's not there now and buying now to break even in 10-20 years is not a good investment strategy.", "score": 0, "replies": []}]}]}, {"body": "Do you want to hold it or trade it?\n\nI don’t know about trading it but I think it’s very likely Tesla will keep doing it’s thing in the long run.", "score": 1, "replies": []}, {"body": "And what if it doubles after inclusion? Point is nobody knows what will happen.", "score": 1, "replies": []}, {"body": "Just bear in mind that 20-30% of the float market cap will be locked away forever by the funds tracking and benchmarked to the S&P 500.\n\nJust DCA and hold forever.", "score": 1, "replies": []}, {"body": "Just wait till space x is offered", "score": 1, "replies": []}]}
{"title": "Will PYPL be in trouble if SQ allows Cash App to make online payments?", "selftext": "[deleted]", "id": "kc1xk0", "created_utc": 1607824732.0, "score": 10, "upvote_ratio": 1.0, "num_comments": 16, "comments": [{"body": "If cashapp gains a competitive advantage, paypal will just enable the same functionality.", "score": 7, "replies": []}, {"body": "Food for thought, I’m in my late 20s and everyone I know still uses Venmo to send money to others, rather than Cash App", "score": 12, "replies": [{"body": "Only heard of CashApp on WSB.  Everyone I know in Midwest uses Venmo.", "score": 6, "replies": [{"body": "Also in the Midwest, everyone uses Venmo", "score": 1, "replies": []}]}, {"body": "Everyone I know uses Cash App or Zelle. Fact is we don't know alot of people.", "score": 3, "replies": []}, {"body": "Early '20s and Venmo is so widely used it's become a verb similar to zoom", "score": 3, "replies": []}, {"body": "Me too", "score": 2, "replies": []}, {"body": "Also late 20s and no one I know uses either of them.. it’s quite a geographic thing", "score": 2, "replies": []}, {"body": "I believe it's tied to the geographical area that you are in", "score": 2, "replies": []}, {"body": "I’m in my early 20s and didn’t even know of either. Over here we usually pay in either pints or bank transfer, if it’s a substantial amount", "score": 1, "replies": []}]}, {"body": "I love both PYPL and SQ for a long time was invested in both. Just last month I sold all my PYPL. Adding SQ on pullbacks.", "score": 2, "replies": [{"body": "Whyd you sell?", "score": 3, "replies": []}]}, {"body": "You can already make online purchases with Venmo.", "score": 2, "replies": []}, {"body": "The answer to this question actually lies in the form of a company.\n\nPaysafe is the modern papal and is going the acquisition route to do just that, compete with PYPL", "score": 2, "replies": []}, {"body": "[removed]", "score": 0, "replies": [{"body": "eBay no longer uses Paypal", "score": 1, "replies": []}]}, {"body": "I’m in my 30’s and i feel like a boomer already", "score": 1, "replies": []}]}
{"title": "Regarding tesla stock price", "selftext": "I have sold tesla stock around $550.00 levels 1 month ago and my position is in loss of around $ 6000.00 I need your view on the stock price shall I book loss or not or I hedge my position let me know view on stock price in short term due to its inclusion in s& p on 21 dec 2020", "id": "kc37gm", "created_utc": 1607829705.0, "score": 0, "upvote_ratio": 0.29, "num_comments": 18, "comments": [{"body": "How did you manage to lose money on TSLA?", "score": 14, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Yup", "score": -4, "replies": []}]}, {"body": "I have not loss my position is still open", "score": 1, "replies": [{"body": "Close it out while you still have the chance, also check my posts history on why 😉", "score": 2, "replies": [{"body": "I agree.", "score": 2, "replies": []}]}]}]}, {"body": "If you shorted back at $550 and didn’t sell on the massive dip to $588 or $566 last week you messed up.", "score": 3, "replies": []}, {"body": "Tesla is going up in the long term. Around inclusion I think it’s going up. Afterwards, it might go down.", "score": 2, "replies": []}, {"body": "I'm a Tesla skeptic, but this stock is not worth messing with. I feel as if buying shares and going long is playing with fire, but I also think shorting it is playing with fire, even if we've seen it work at times. \n\nYour best hope for not taking at least some kind of loss here is likely \"get the NASDAQ to break down and book a couple days of near 2% losses\"...not something that I'd rule out, but I'm skeptical that happens (maybe we have started another 8-10% drawdown considering that we're probably overdue for something like that, but more information is needed here, one week of losses can just be one week).", "score": 2, "replies": []}, {"body": "I like sell do not want to buy this stock", "score": -4, "replies": [{"body": "lol then why are you asking for view on the stock? Company is growing and will continue to grow. Not sure what your issue is - either hate / jealousy / simple stupidity but you’ll keep losing your money. Have fun doing it.", "score": 5, "replies": []}, {"body": "Bad idea", "score": 1, "replies": []}]}, {"body": "its real value before slit is $3000 , good luck if you can’t hold a year or longer", "score": 1, "replies": []}, {"body": "How in the world did you lose money on Tesla stock? Did you like buy at $600 and sell at $550?", "score": 1, "replies": [{"body": "I like to sell this stock", "score": -1, "replies": []}]}, {"body": "We’re gonna crush you son. Buy it back before it’s too late.", "score": 1, "replies": []}, {"body": "Rip. Before s and p addition? What", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "If it goes to 1000, there'll be buyers", "score": 1, "replies": []}]}, {"body": "If you can hold until 22nd December then hold. Will likely dip to below 550 once inclusion hype wears off. But, until then, it might keep going up. If it reaches 700$ do you have the funds to keep your position open? Can you afford to risk that much? \n\nMaybe cut your losses now and then short on 21st/22ns Dec once stock starts dropping.", "score": 1, "replies": []}]}
{"title": "Crosspost from /r/undervaluedstonks: My personal list of ETFs and stocks that will benefit from the recovery from COVID-19 (USD and CAD)", "selftext": "[deleted]", "id": "kcdzhb", "created_utc": 1607878549.0, "score": 1, "upvote_ratio": 0.54, "num_comments": 11, "comments": [{"body": "Uh, the real estate market is huge danger. The eviction moratorium expires in 2 weeks and reporting states that 40 million people are currently at risk for eviction. The foreclosure moratorium currently has been extended to January 31st but the problem with continually pushing it back without any kind of relief is that it makes it so there are more and more foreclosures that are stacking up to be done in at the same time. If they start foreclosures in February, they have almost an entire years worth of foreclosures on top of new foreclosures this coming year both from the normal rate that happens and from the economic impact of Covid.\n\nOn top of this we are likely going to be going through 3-4k deaths a day for several straight weeks with a chunk of those resulting in home sales in the next year.\n\nIn short, this is not a safe industry to invest in right now. As far as the travel and entertainment, note that we are still at the beginning stages with of the second round of outbreak and the US government has already completely fumbled the vaccine procurement while also backing the vaccine patents so that we can't manufacture more.", "score": 4, "replies": [{"body": "I’m a longer term investor, of course there are still hurdles in the short-medium term, but given a long term horizon, I’m confident that things will improve.\n\nI don’t mean to sound too philosophical or anything, but this is what humans do, we solve problems and adapt, I have full confidence that we’ll recover in the long term.", "score": 2, "replies": [{"body": "You must not be long enough term to remember how people solved the problems in the housing market in  2008", "score": 0, "replies": [{"body": "And in the long run, the stock market still recovered from 2008, not sure what your point is, I’m just sharing what I know, take it or leave it🤷‍♂️", "score": 2, "replies": [{"body": "For a long term retirement plan you are absolutely correct. These indexes will all absolutely rebound. I'm just saying there should be a caviat not to invest all you money at the same time in these and that it might take several years to make a profit.  You kind of said that but I thought it should be more explicit.\n\nI actually appreciate the knowledge and might actually look at investing in a couple of these in coming months", "score": 0, "replies": []}]}]}]}]}, {"body": "The biggest risk for airlines is their debt pile up from the pandemic inactivity. They will need bailout or massive debt restructuring. That goes for entertainment as well.", "score": 2, "replies": [{"body": "Airlines make a fortune being credit card companies now with everyone traveling on credit. They are probably enjoying people not being able to pay off their last trip. Them getting bailouts was unnecessary and I don't buy they are in trouble. They are booking hundreds of flights for vaccine shipments as we speak. United, Delta and American all asked for clearance to carry 5X regular capacity of dry ice in preparation", "score": 2, "replies": []}]}, {"body": ".", "score": 2, "replies": []}, {"body": "I wouldn’t touch any of these with an analysis on recent balance sheet damage vs how much positive effect pent up demand is going to be.\n\nWay too many posters here go under the simple assumption that if business returns to pre Covid revenues, the stock price will return to pre Covid values.", "score": 2, "replies": [{"body": "I never said I expect stock prices to return to pre covid values, that’s a strawman argument. \n\nNo risk no reward, I’ve made 20-30% returns from these industries since Oct, but I can understand why different people would have different opinions.", "score": 3, "replies": []}]}, {"body": "JETS, I wouldn’t touch that with a 10 meter stick. Rayray is fine though.", "score": 1, "replies": []}]}
{"title": "The Dot Com Bubble? How fast did the stocks fall? First hand experiences?", "selftext": "[deleted]", "id": "kce086", "created_utc": 1607878622.0, "score": 6, "upvote_ratio": 1.0, "num_comments": 9, "comments": [{"body": "Slow rot over months. Different time. No real revenues.", "score": 12, "replies": [{"body": "That’s not too bad if you have shares, thank you for the insight!", "score": 0, "replies": [{"body": "It will still play with your mind\n\nYou keep telling yourself its just a small dip until its too late", "score": 8, "replies": []}]}]}, {"body": "Slow and painful.  It wasn’t like the crash this year.", "score": 6, "replies": [{"body": "Ooo gotcha, so ppl had a chance to take their money out lol, unless you had calls, I’m guessing", "score": 1, "replies": [{"body": "You had a chance but you don’t know if it was a dip, correction, or crash. If you pulled out and it was only a 10% you were sol. It’s easy to look, hindsight 2020.", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "I wouldn’t focus so much on P/E for Tesla. It’s more important of an indicator for businesses who have completed their growth lifecycle and are focused almost completely on maximizing profit.\n\nThat being said. Super volatile at this point. Could be up or down 50% in the next month. Not due to any changes in the underlying business but due to market speculation.", "score": 2, "replies": []}, {"body": "Zm, Dash, Abnb, Snow, Nio, Nkla, Gme, Shop", "score": 1, "replies": []}]}, {"body": "I was an up and coming finance wiz. Top 2% out of my very prominent European university with a masters in finance. Had done my internships at Bloomberg and a Swedish investment firm, designed for greatness I went to work for Deutsche Bank’s analyst desk in London. Ok that was a little sarcastic, but still true. \n\nOne year later it’s all over. Then further furled by the Amex and Enron scandals it all slowly degraded, everyone was buying “the dip”. Fully leveraged, expensive trading (I had friends who owed several thousands of dollars in trading fees).\n \nIt was a shit show. There are a lot of things that remind me of that. Not so much the valuation of existing companies, but the IPOs. Jesus. In-browser advertising company got listed. Turnover of 1,3 million usd per year. Market value of 300 million instantly. Boom!", "score": 1, "replies": []}]}
{"title": "Amazon, Panasonic and Recycling Start-Ups Prepare for Battery Wave Tsunami", "selftext": "https://www.cnbc.com/2020/12/12/amazon-panasonic-preparing-for-demand-of-battery-recycling.html\n\n“Inside every smartphone and tablet lies a dense brick with a dark and complex history: its battery. The lithium that ferries charge back and forth likely started out in South American salt flats, where months of evaporation consumes millions of tons of water in some of the world’s driest regions. The cobalt that buffers the material against the ravages of daily recharging probably came from the Democratic Republic of the Congo, where children have allegedly been maimed and killed extracting it from the ground. To gather the assorted atoms and fashion them into a working battery may have required thousands of people from perhaps a dozen countries. Then, after a few years of use, spent devices often end up in landfills and incinerators. \n\nAs lithium-ion batteries stand poised to jump from handheld devices into cars, trucks, and homes, entrepreneurs and academics are racing to find a way to reuse the hard-won materials. Investors are betting millions that a Nevada company, Redwood Materials, can mine electronic waste for metals. A competitor, Li-Cycle, aims to crack the logistical puzzle of transporting batteries. Others are developing the technology to rejuvenate dead batteries without breaking them down fully. By attacking the problem on all fronts, the teams work toward one goal: transforming exhausted batteries into a valuable resource.”", "id": "kch8mc", "created_utc": 1607888786.0, "score": 34, "upvote_ratio": 0.9, "num_comments": 13, "comments": [{"body": "> The lithium that ferries charge back and forth likely started out in South American salt flats, where months of evaporation consumes millions of tons of water in some of the world’s driest regions.\n\nHow does the author think evaporation works? Where do they think the water goes?", "score": 14, "replies": [{"body": "What they are saying is that the water is going into this process instead of agriculture or people. Any waste water from this process that doesn't evaporate can end up polluting the rivers. \n\nWater scarcity and use is a big issue down there. Some of the rivers are literally sucked dry by this process and agricultural.", "score": 10, "replies": []}, {"body": "Lmfao. “It DESTROYS water” umm.. should we tell them?", "score": 3, "replies": [{"body": "Consume is not the same as destroy. If I consume water, it still exists but is in a different and unusable form... unless you want to drink my urine.", "score": 9, "replies": [{"body": "You can't use saltwater for agriculture either.", "score": 1, "replies": [{"body": "Except for marine agriculture.", "score": 2, "replies": []}]}]}, {"body": "When water evaporates outside there's not a lot you can do to get it back", "score": 1, "replies": []}]}, {"body": "I'm going to take a wild guess on this one: The Sky", "score": 3, "replies": []}]}, {"body": "The dirty secret is that EV are not any more environmentally friendly than ICE.", "score": 3, "replies": [{"body": "EV cars as an isolated system are obviously cleaner than ICE cars, what you meant to say was the way we charge the EV cars and source energy for the cars is still fairly dirty, however that is a pretty fixable problem but gas and oil will always be dirty energy sources", "score": 14, "replies": []}, {"body": "How so?", "score": 6, "replies": [{"body": "batteries are very resource intensive and create a lot of environmental waste which is difficult to recycle", "score": 1, "replies": []}]}, {"body": "Yup, it’s just to get everyone connected to the grid and in automated cars controlled by Big corporations\n\n/s", "score": 1, "replies": []}]}]}
{"title": "My worst performing stocks, what to do with them?", "selftext": "Here they are (ordered by total amount lost):\n\n&#x200B;\n\n||\\*\\*% loss\\*\\*|\\*\\*Loss (USD)\\*\\*|\\*\\*Current value (USD)\\*\\*|\n\n:--|--:|--:|--:|\n\n|MTH|28|1380|3549|\n\n|IQIY|15|876|4812|\n\n|Dansk bank|29|876|2145|\n\n|Nokia|18|840|3827|\n\n|CGC|50|552|552|\n\n|RDS|7|432|5739|\n\n|Lufhansa|12|420|3023|\n\n|Evofem|43|324|429|\n\n|Ehealth|7|300|3986|\n\n|Astrazenica|10|252|2268|\n\n|Akamai|10|240|2113|\n\n|Imagine AR|35|204|379|\n\n|RKT|27|168|454|\n\n|DIC asset|7|168|2377|\n\n|Lazr|6|144|2256|\n\n|||||\n\n|\\*\\*Totals\\*\\*|\\*\\*16\\*\\*|\\*\\*7176\\*\\*|\\*\\*37909\\*\\*|\n\nI have some negatives in other stocks like microsoft and tdoc, but I am long on these, so not worried.\n\nWhat would you do regarding these stocks if you were me? Which ones will you keep? Which ones will you hold?\n\nIf I just go screw it and sell all of them, I will lose around 7K, but I get like 38K to invest somewhere. Some peace of mind in checking all these from time to time, but don't know for sure where I will put the 38K for sure... maybe just put on some low risk ETFs and forget about it? \n\nPS: currently I have only 4 ETFS and all are doing quite OK:\n\nGlobal x and robotics : 50% up, 8.9K (total value)\n\nIQQH: 10.3%, 7.8K\n\nVanguard VUSA: 6.3%, 2.82K\n\nWCLD: 22%, 10.1K", "id": "kcjl2y", "created_utc": 1607896082.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 12, "comments": [{"body": "‘Cut your losses quickly and let your winners run’.  Is some of the best advice I was ever given and I pass it on to you.", "score": 9, "replies": [{"body": "do you also add to the winners or just let them run....?", "score": 1, "replies": [{"body": "I always find that a tough call to make.  Lately I’ve been adding to my position in ICLN with very good results.  However, I’ve totally burned myself being greedy and doubling up just before a pullback.  I think it depends on the amount of real confidence in the stock, if it’s a company with genuine growth and stability then buying more is probably a good plan.  If it’s a meme stock that’s being driven by hype then not so much.  I’m still hammering out strategies in this department and have been for years.", "score": 1, "replies": []}]}]}, {"body": "3 options. \n\nSell them all. Take the loss. Put money into somewhere else. \n\nBuy more, and average down your ACB. \n\nHold on to it and wait/hope it recovers to what you bought it for.", "score": 6, "replies": [{"body": "Thanks!\nAny view on the specific companies that I listed? Which one do you think are kinda hopeless (either probably wont recover or it will take ages)", "score": 1, "replies": [{"body": "Depends on your view on a stock and confidence you made the right picks\n\nWhen I buy something and it goes down I love to buy more because I'm getting it at even more of a discount than I was in the first place", "score": 4, "replies": [{"body": "Yep, when you actually enjoy buying a dip is when you know you've done enough due diligence.", "score": 3, "replies": []}]}]}]}, {"body": "I do not hesitate to sell top 5 losers.", "score": 3, "replies": []}, {"body": "sell 3k of loss for end of year", "score": 1, "replies": []}, {"body": "Let it all ride on $RKT", "score": 1, "replies": []}, {"body": "Sell all and buy Amazon", "score": 1, "replies": []}]}
{"title": "PFE, UPS, FDX, BNTX", "selftext": "These four companies are involved in developing and delivering the first batch of public covid vaccines, arriving tomorrow Monday the 14th.\n\nThoughts on these stocks potentially rising, or have they already in a \"buy the rumor, sell the news\" situation?", "id": "kck2to", "created_utc": 1607897674.0, "score": 3, "upvote_ratio": 0.72, "num_comments": 11, "comments": [{"body": "AVTR will be supplying all vaccine manufacturers raw materials to make vaccine. Been steadily rising. No massive boom tho.", "score": 4, "replies": []}, {"body": "I bought PFE this summer, not necessarily as a vaccine play, just it seemed like a cheaper way to access pharmaceuticals. Needless to say, I’m happy with the short term performance. \n\nNot sure if buying it now that all the good news you could have been wanting to hear is already announced makes as much sense. I’m not selling, so obviously I hope for continued upside, I’m just not sold on adding more money to the position at current prices either. \n\nI could be wrong on every count, so this is just my opinion.", "score": 2, "replies": []}, {"body": "you're missing TMO, they supply the freezer on those vaccines", "score": 1, "replies": []}, {"body": "MRNA will almost certainly climb, as the U.S. just agreed to buy 100 million doses.", "score": 0, "replies": []}, {"body": "Walgreens (WBA) will be involved in administrating vaccines as well. \n\nThis is my pick for a vaccine play given the stock is undervalued imo and has a good turn around opportunity. \n\nPlus ~5% dividend which is nice. Let me know what you think if you look into it", "score": 1, "replies": [{"body": "Grabbed calls on CVS on Friday, already up 13%", "score": 1, "replies": [{"body": "bought 5x $80c 1/15 last Monday. down 40% :)", "score": 1, "replies": []}]}]}, {"body": "I bought ONEM. It plays a role in vaccine distribution and it’s also a growth company.", "score": 1, "replies": [{"body": "$INO has had decent reviews in phase1 and 2 but haven’t heard anything from them in the last 6-8weeks. \nInteresting to see if they can get their vaccine for Covid", "score": 2, "replies": [{"body": "They probably will but by that time there will be so many competitors, and vaccine is low priced anyway. They won’t make money, and they won’t have hype (because all the hype goes to early approval).\n\n\nI don’t bet on vaccines but on companies that distribute the vaccines (aka give people the vaccine shots) like ONEM or CVS.", "score": 1, "replies": []}]}]}, {"body": "Interesting play here is $BDX, they are the  largest supplier of syringes   and still undervalued. Options are cheap.", "score": 1, "replies": []}]}
{"title": "I draw with crayons so you don't have to. Last week I closed up $1,250 or $1.5% while the market dipped 1%. Tickers on the watchlist this week: HYLN, NIO, U, OSTK, WKHS, CODX", "selftext": "[deleted]", "id": "kclawm", "created_utc": 1607901700.0, "score": 42, "upvote_ratio": 0.73, "num_comments": 10, "comments": [{"body": "Lots of work for 1%. I did nothing and got 5%.", "score": 14, "replies": [{"body": "It can also be a fun hobby? There are probably weeks where his gains are more than yours. This isn’t a pissing contest.", "score": -1, "replies": []}]}, {"body": "[deleted]", "score": 10, "replies": [{"body": "nice work!", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": -6, "replies": [{"body": "1% is a good return last week. I would kill for 1% consistently every week.  \n  \n  \nIs this comment supposed to be informative or something?", "score": 16, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "Sweet. You get me 1% every week and I'll make you a billionaire.\n\nThat being said the big algos all do this already at an extremely sophisticated level. I don't think this is either novel nor valuable though it is entertaining.", "score": 3, "replies": []}]}]}]}, {"body": "Where can I copy your PLTR play 🤗", "score": -1, "replies": []}, {"body": "I love these updates! Thanks :)", "score": 1, "replies": []}, {"body": "it looks like you play mostly off of technical analysis + supply and demand zones. What % of your decision making is based on fundamental? Is it possible to be a mostly TA trader? because my brain is more geared towards TA vs fundamentals.", "score": 1, "replies": [{"body": "Not much on fundamentals realistically. Look at PLTR, does it deserve $50b market cap? Here I am selling puts on that.", "score": 2, "replies": []}]}, {"body": "I really appreciates these thank you.", "score": 1, "replies": []}]}
{"title": "Where, oh Where is the Semi Plant, oh where oh where could it beeee? 4680 baby!", "selftext": "So it was implied in the Q3 report that the semi production facility was not going to be in Texas nor California.....\n\nI've watched two interesting videos on Semi manufacturing plants (so I am now an expert /s) and it looks like it isn't as big as of a line as a car line (Freightliner and Kenworth)\n\nSince Austin will probably be focused on Ys and Cybertrucks first, my guess is that Tesla is already in preproduction of the Semi trucks somewhere else.\n\nNevada battery plant?  My initial guess would be no, because mixing a truck mfg plant with clean room scale battery production would probably cause too much disruption.\n\nSo where did those two Semis of Tesla's come from?  There is no way that they haven't started a line somewhere, so someone knows,.....\n\nTSLA could easily have purchased an empty plant on the down low.  \n\nI believe that TSLA will announce shipments of semi's long before the Cybertruck, especially if today's rumors of S and X refreshes containing 4680s is true, as having the  4680 available was pretty much a prerequisite for the Semi and the reason for the semi launch delay.\n\nMy guess is that Tesla will wait till after S&P inclusion to announce first quarter Semi deliveries so as to not further spike the inclusion price and to support the new higher price we will see after inclusion.", "id": "kc2gs2", "created_utc": 1607826781.0, "score": 18, "upvote_ratio": 0.69, "num_comments": 18, "comments": [{"body": "Likely the Semi prototypes were built in the prototype facility near the Fremont plant.\n\nIt would be out of character for Tesla to be scheduling such product announcements around what it would do to the stock price. I am not saying it is impossible, just out of character.\n\nAlso, Semi production will be waiting on the new battery production. We need to ask Musk about when they will start testing a Semi prototype with the 4680s structural design.", "score": 19, "replies": []}, {"body": "Former truck driver. Class 8 trucks are not exactly complicated and manufactures share a lot of off the shelf parts. The frames are just two parallel C beams, axles and brake systems are often shared, not to mention the engines and transmissions. It would make a lot of sense to just buy rolling chassis to build on.", "score": 6, "replies": [{"body": "Well axles, engines, transmissions, and brake systems on a TSLA semi, by definition, would all be different.  \n\nThe only things I would think that TSLA might not change are c beams,  the connection plate and the wheels.  The Semi is supposed to have 4 motors, with regenerative braking, so the normal brakes a Semi has would be overkill.", "score": 10, "replies": [{"body": "Pretty sure they will need full mechanical braking capability (air brakes) just in case Regen fails. It's a regulatory requirement.", "score": 12, "replies": []}, {"body": "They will likely use the same brake systems, spindles, front axles, fifth wheel, steering etc. There is no reason to reinvent the wheel for parts that won’t effect range and performance.\n\nThe air brake systems will have to  be standardized due to DOT regulations.", "score": 7, "replies": [{"body": ">\tThere is no reason reinvent the wheel\n\n*Tesla enters the chat.*", "score": 11, "replies": [{"body": "Tesla can design whatever they want, but they're not going to sell many of their fancy new wheels if the DoT won't allow them on the roads. \n\nFor example, disc brakes are just now making their way into US semis.", "score": 1, "replies": []}]}]}]}]}, {"body": "Its likely going to be at GF Nevada.  \n\n\n[https://electrek.co/2020/02/19/tesla-semi-giant-building-giga-nevada/](https://electrek.co/2020/02/19/tesla-semi-giant-building-giga-nevada/)", "score": 2, "replies": []}, {"body": "The new factory in Austin is huge.  The property they’re building it on is even huger.  Like, they could build 5 Austin Factories on the land they own there.  Semi production will be in Austin, I’d bet money on it.", "score": 2, "replies": []}, {"body": "Did you know that Semi Trucks aren't as regulated safety wise as passenger vehicles?  In other words, from my limited research, semi trucks are not crash tested.\n\nWhile I would expect that Elon would indeed do some semi  truck destructive testing before commercial launch, the timeline for doing so and the ability to do so without governmental filings that would \"leak out\" the launch date expectations could be why we don't really know where in the process the semi truck is currently.", "score": 1, "replies": [{"body": "> Did you know that Semi Trucks aren't as regulated safety wise as passenger vehicles?\n\nSort of accurate I guess, but pragmatically speaking not really all that important for reasons that follow.\n\n> In other words, from my limited research, semi trucks are not crash tested.\n\nThis is inaccurate. They are tested, just by the SAE, not the government. \n\nTesting procedures are shown here: https://www.nhtsa.gov/sites/nhtsa.dot.gov/files/812061_heavytruckinjurycountermeasures.pdf\n\nWhile it's an NHTSA study and document, they're discussing SAE testing processes. \n\nThe actual reality is just a few hundred drivers die in the US every year in crashes (see previously linked document for sources on that), which is astonishingly low when you consider the sheer quantity of hours they spend on the road. When even a good portion of those could be saved if drivers just wore seatbelts, there's the kind of place truck safety is at.\n\nReally, it's passengers in vehicles that are in accidents with trucks that are more likely to come off worse in an accident, but that's a whole other discussion.", "score": 5, "replies": [{"body": ">Really, it's passengers in vehicles that are in accidents with trucks that are more likely to come off worse in an accident, but that's a whole other discussion.\n\n\nYou mean \"that's just physics\". When BIG truck and little car collide, truck doesn't lose", "score": 2, "replies": []}]}, {"body": "The semi? The semi has a lower battery revenue / FCF yield per unit output than the others so their deep backlog of orders haven’t been tapped yet. This was a battery constraint thing not a delay on the semi for design/ manu/ testing.", "score": 1, "replies": []}]}, {"body": "What first quarter of Semi sales? Are there any?", "score": 1, "replies": []}, {"body": "They will make semi’s at Fremont and later Austin I thought.", "score": 1, "replies": [{"body": "There isn't room to mfg semi's in Fremont.  Austin is a possibility, but if so, it could put off commercial launch till 2022 or later.\n\nMore importantly, if you read the Q3 report, if TSLA planned to mfg semi trucks in Austin, they would have said so in the provided chart.  Instead they specifically listed it separately from Texas as United States (Semi and roadster too)\n\n[https://tesla-cdn.thron.com/static/4E7BR9\\_TSLA\\_Q3\\_2020\\_Update\\_P0Q85U.pdf?xseo=&response-content-disposition=inline%3Bfilename%3D%22TSLA-Q3-2020-Update.pdf%22](https://tesla-cdn.thron.com/static/4E7BR9_TSLA_Q3_2020_Update_P0Q85U.pdf?xseo=&response-content-disposition=inline%3Bfilename%3D%22TSLA-Q3-2020-Update.pdf%22)\n\npage 7 chart", "score": 1, "replies": [{"body": "I'm calling it now, he has an underground facility somewhere. The facility making it is either with The Boring Company or SpaceX.. he's been known to house companies together.\n\nMy thesis abstract: big piece of machinery with other big pieces of machinery, is it really going to stick out? He has the semi hauling the boring company equipment.\n\nSandy Munro hasn't done a tear down of a boring machine yet.. I wonder how many pieces are related.\n\nMy belief is that the semi is already here.. not just the way mainstream is expecting it.", "score": 2, "replies": []}]}]}, {"body": "I cant see semi truck’s being produced until FSD is 100% sorted- FSD trucks would be the main sales point.", "score": 1, "replies": []}]}
{"title": "Tesla to employees: refresh at home. Tesla to line: refresh at factory.", "selftext": "", "id": "kc3fx1", "created_utc": 1607830648.0, "score": 59, "upvote_ratio": 0.98, "num_comments": 10, "comments": [{"body": "Elon likes to drop Easter eggs. I think the email telling Model S/X line employees that it’s time for them to refresh signals a refresh for the S/X. \n\nWe knew this was coming before the tri-motor S anyway, so not surprised by the timing.", "score": 24, "replies": [{"body": "Great catch. He does love these little hints. Pretty clever choice or words", "score": 12, "replies": []}, {"body": "Don’t look too deeply into it. E’s hints are usually more cryptic", "score": 2, "replies": []}]}, {"body": "Normally I would say this is a reach but tbh there's not really any other reason to use that word in this context.. it must have a second meaning", "score": 17, "replies": [{"body": "Narrator: it did", "score": 8, "replies": [{"body": "Not that I disagree, but I'd love to see some evidence that a refresh is indeed coming.", "score": 2, "replies": [{"body": "Its due for a refresh. Check the Elon Musk Conspiracy theories.", "score": 3, "replies": []}]}]}, {"body": "Yeah, the fact they had to say “or we could mean this totally different thing” kinda days a lot", "score": 2, "replies": []}]}, {"body": "Thank you", "score": 6, "replies": []}, {"body": "Awwwwwww yeahhhhhhh", "score": 2, "replies": []}]}
{"title": "Texas Governor Greg Abbott on Tesla's new Austin Factory", "selftext": "", "id": "kc7qx2", "created_utc": 1607851461.0, "score": 6, "upvote_ratio": 0.62, "num_comments": 14, "comments": [{"body": "4 month old article", "score": 4, "replies": [{"body": "Yeah. Tesla's stock value is double that now.", "score": 1, "replies": []}]}, {"body": "What are these freedoms he refers to that Texas is adding exactly?", "score": 2, "replies": [{"body": "Perhaps the freedom to ban direct Tesla sales and keep the existing ~~stealership~~ dealership structure?", "score": 3, "replies": []}]}, {"body": "Elon has said what the motivations for building in Austin were, no need to guess at them. It had nothing to do with the state of Texas.\n\nIt was the University of Texas (and the workforce it creates), some culture, and affordable property. It is a great engineering school because it has a huge endowment that mostly came from oil that was found on a massive land donation.\n\nSo the irony is Tesla is in Austin because Oil. To say the state regulations or tax incentives were involved is revisionist.", "score": 5, "replies": [{"body": "That's some s3xy irony imho. Tesla is using engineers educated by oil profits to accelerate the transition to green energy", "score": 5, "replies": [{"body": "We are all here because of oil. It has brought us here and we now recognize that it will destroy us and we decide to change. But change is hard. Harder for some than others.", "score": 5, "replies": []}, {"body": "This is not really new.  Michigan was a big horse-drawn carriage state before it became the center of the auto industry for a reason.", "score": 5, "replies": [{"body": "Michigan became an auto industry magnate because Detroit was in the wood stove industry and had an easy supply of iron ore from Minnesota and the Upper Peninsula via the great lakes.  Unlimited steel and plenty of industrial infrastructure/labor", "score": 2, "replies": []}]}]}, {"body": "You forgot no state income taxes.", "score": -1, "replies": [{"body": "Wasn't a primary factor in choosing location of factory.", "score": 1, "replies": []}]}, {"body": "It doesn't cover everything, but Elon does actually talk quite a bit about the difficulty with business and regulations as opposed to say Texas. I wouldn't call this revisionist as much as focusing on part of what Elon says.", "score": 1, "replies": []}]}]}
{"title": "Tesla Tequila unboxing. Speaking of 3x value increase...", "selftext": "", "id": "kcarsv", "created_utc": 1607866826.0, "score": 42, "upvote_ratio": 1.0, "num_comments": 11, "comments": [{"body": "i swear tesla branded products are the grown ups supreme", "score": 11, "replies": [{"body": "It's my first Tesla \"Toy\" purchase. I've been too busy snatching shares the past year. I'm a sucker for a fancy adult beverage though and a huge Tesla bull so it's the perfect marriage of some shit I need to have.", "score": 1, "replies": [{"body": "just make sure you don't spend $1k on a fucking brick", "score": 1, "replies": [{"body": "Lol yeah no problem. I paid $250 for this and it was instantly and is still worth $600 so I think all around it's a pretty solid buy. Even if I just drink it to celebrate a big Tesla stock goal.", "score": 1, "replies": []}]}]}]}, {"body": "Those are the hands of a seasoned trader", "score": 3, "replies": [{"body": "It's only one hand but yeah not inaccurate.", "score": 1, "replies": []}]}, {"body": "Can you use it as a decanter?", "score": 3, "replies": [{"body": "Hmmm good question. I'm not an expert on that but I don't see why not.", "score": 2, "replies": [{"body": "Some tequila bottles have an  aerators. That would be a problem if i buy the empty bottle next time comes out for sale...", "score": 1, "replies": []}]}]}, {"body": "have the shorts increased in value much? I am still waiting on the 10 pairs I ordered.", "score": 2, "replies": [{"body": "Only 10? Pffffttt... Rookie numbers.", "score": 1, "replies": []}]}]}
{"title": "Decided to open up a Robinhood and spend $300 on Pfizer stock, gonna hold it for 4-6 months and hope for a small return. I know it's a boomer move, but hey I'm a noob and this seems like a safe bet. Thoughts on what PFE will do guys?", "selftext": "[removed]", "id": "kc0kzk", "created_utc": 1607819685.0, "score": 0, "upvote_ratio": 0.27, "num_comments": 18, "comments": [{"body": "This is way below the threshold for discussion. Maybe try another sub", "score": 24, "replies": [{"body": "r/smallstreetboomerstocks", "score": 1, "replies": []}]}, {"body": "Probably get more returns from a hooker with no teeth, good luck!", "score": 11, "replies": [{"body": "God that sounds so hot rn", "score": 2, "replies": []}]}, {"body": "Don't look at the max chart", "score": 6, "replies": []}, {"body": "You’re asking advice & that too for shares in WSB? 😯\n\nKindly GTFO to r/investing r/finance", "score": 8, "replies": [{"body": "[deleted]", "score": -7, "replies": [{"body": "We think you should gtfo", "score": 10, "replies": []}, {"body": "It's best to exit now. This is not a good place for you. Gamble options, and post loss porn. Kindly... As been told.", "score": 1, "replies": []}]}]}, {"body": "Buy GME trust me. I've done more dd outside of the sub.", "score": 4, "replies": []}, {"body": "You bought this a lil late. Get GME and wait.", "score": 3, "replies": []}, {"body": "It may go up a little Bc of vaccine news, but will likely go down in the long-term. How much higher can it possibly go?", "score": 1, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "Lol\n\nTSLA to $2000 before this happens", "score": 2, "replies": []}]}]}, {"body": "Hey so the threshold for posting on this sub is way higher than 300 in shares. But anyway you'll be fine. Wont have huge gains but doubtful you'll lose any money", "score": 1, "replies": []}, {"body": "In three or four weeks I bet we see a post from OP like “I’ve got pfe 50c expiring Jan 30 how fucked am I should I buy pltr instead?”", "score": 1, "replies": []}, {"body": "Sorry, your post has been removed by vote. Please don't delete the post if you think it's not spam as it may be approved later.\n\n___\n\nYou can either contact moderators or vote to restore this thread and punish the volunteer moderators responsible for spamming your post in the daily [WSBVoteBot action log](https://www.reddit.com/user/WSBVoteBot/posts?sort=new).", "score": 1, "replies": []}, {"body": "Ban", "score": 1, "replies": []}]}
{"title": "UAL, AAL, and PFE gains", "selftext": "[deleted]", "id": "kc29id", "created_utc": 1607825992.0, "score": 53, "upvote_ratio": 0.93, "num_comments": 16, "comments": [{"body": "I’m on AAL $30 2023 : wish me luck", "score": 10, "replies": [{"body": "definitely will hit by 2023. covid will be done by end of 2021/early 2022", "score": 9, "replies": []}]}, {"body": "I don't think anyone banned you for that. Those are all well within our market cap limits and stuff.\n\nWhat'd the ban message say? Was it a temp ban for a short shitpost submission about QS?", "score": 6, "replies": [{"body": "my bad, the ban was on the RMG play that i posted", "score": 3, "replies": []}]}, {"body": "What do you think PFE will do on monday?", "score": 4, "replies": [{"body": "ur guess is as good as mine. vaccine = good news (but priced in?). stimmy could go either way (but most likely bad news bc politicians get paid to do nothing)", "score": 6, "replies": []}, {"body": "Not much. Probably go down a bit.  Pfizer is showing great results but takes minus 70 storage. When the other vaccines that don’t need as much tender loving care for distribution PFE will shit the bed just like gilead", "score": 0, "replies": []}]}, {"body": "profit taking plus shake out on friday. Rip ;/", "score": 3, "replies": [{"body": "Profits are just a number until u close but friday was rip", "score": 2, "replies": []}]}, {"body": "PFE will get squeezed to 50+ in the next few weeks or even days. That wedge is getting tight.", "score": 5, "replies": [{"body": "$rope if it does. Already closed out. Gains are gains", "score": 6, "replies": [{"body": "Gains R Gains indeed.", "score": 5, "replies": [{"body": "U have calls? Dipped friday", "score": 3, "replies": [{"body": "Waiting too see how the overall market plays into Monday. Calls will be bought if we are strong green Monday.", "score": 3, "replies": [{"body": "Buy high sell low 👍", "score": 3, "replies": []}]}]}]}]}]}]}
{"title": "Long DISNEY for the next 2 weeks! GREAT RISK TO TENDIES RATIO", "selftext": "[deleted]", "id": "kce6ex", "created_utc": 1607879161.0, "score": 23, "upvote_ratio": 0.73, "num_comments": 15, "comments": [{"body": "[deleted]", "score": 59, "replies": [{"body": "Quick before IV settles", "score": 13, "replies": []}, {"body": "You're on WSB and you doubt the power of retard strength. Scared money don't make money.", "score": 10, "replies": [{"body": "You're stupid if you think you're not gonna get fucked by IV after such a run. Dumbass play should have jumped on it Thursday knowing last year investor day shot DIS by around 10%. I knew that and my scared dumbass still didn't buy the calls. Too late now", "score": 9, "replies": []}]}]}, {"body": "That run up after the initial pop is retail investors chasing.  The drop after was institutions selling.   Your thesis works well for next year.  Buy into it.  Not after it", "score": 8, "replies": [{"body": "Got 2 weeks of retail chasing last year after investors day. Analyst upgrades coming this week.", "score": -3, "replies": [{"body": "I wouldnt be too quick to hope for upgrades they are losing money while reaching ATH.", "score": 4, "replies": []}]}]}, {"body": "Disney is like a black hole that eventually we all will be disney.", "score": 6, "replies": []}, {"body": "DIS will probably be red tomorrow when open, then will be green again on Tuesday", "score": 6, "replies": []}, {"body": "$DIS 200 EOY 🚀🚀🚀🚀🚀", "score": 7, "replies": []}, {"body": "Disney+ to roll out 20 new Marvel and Star Wars series over the next few years\n\nThe company plans to launch ‘roughly’ 10 Marvel series, 10 Star Wars series, and 15 live-action, animation, and Pixar series on Disney+", "score": 6, "replies": []}, {"body": "Disney going to take a HARD HIT on Monday and TANK!", "score": 1, "replies": []}, {"body": "The mandalorian is literally the only good thing to watch on disney+", "score": 1, "replies": []}, {"body": "I got a put Friday midday, went up too high in my opinion", "score": 1, "replies": []}, {"body": "There were PT increases on Weds and Thurs, expecting more Tuesday AM", "score": 1, "replies": []}, {"body": "I agree, i'm quite bullish on disney. I summarized my investment thesis here in case you are interested [https://mymoneytree.me/2020/12/28/why-i-bought-shares-in-disney/](https://mymoneytree.me/2020/12/28/why-i-bought-shares-in-disney/)", "score": 1, "replies": []}]}
{"title": "The distribution begins: what to do.", "selftext": "[deleted]", "id": "kck6jb", "created_utc": 1607898009.0, "score": 6, "upvote_ratio": 0.66, "num_comments": 20, "comments": [{"body": "The fuck is a share?", "score": 15, "replies": []}, {"body": "Bought fed ex at $90. I’m going to be selling. It went from undervalued to overvalued pretty quickly", "score": 6, "replies": [{"body": "Yup had over 1k and sold most last week.", "score": 1, "replies": []}]}, {"body": "LYV makes no sense to me. No shows til next fall... how can it be so high?", "score": 4, "replies": [{"body": "Right?!  A family friend works for Live Nation and him and most of the employees have been and will still be furloughed for a while.\n\nYet, it grew from the slump to its all-time high despite reduced earnings and no concerts", "score": 3, "replies": []}]}, {"body": "As another WSBer said: it starts with P and ends with RICED IN", "score": 4, "replies": []}, {"body": "Freezer stocks are where the money's at.  RSCF is a pure play.  They own Cryometrix \nhttps://cryometrix.com/index\n\nThis other freezer stock TZPC went from $0.01 to 20.00 freaking dollars in a month!", "score": 3, "replies": [{"body": "Shhh I didn’t buy this one yet.", "score": 1, "replies": []}]}, {"body": "Actual schizophrenia. \n\nTalks himself out of distribution plays in his own distribution DD (there wasn’t one anyway so good job)  then goes on a tangent about airliners, cruise vacations and concerts", "score": 5, "replies": [{"body": "I’ve had fedex and ups shares for the past 4 months. I sold them last week. I’m not going to recommend anything I personally think is overvalued.", "score": 0, "replies": []}]}, {"body": "What makes you think I’m not an elderly, at-risk, essential worker you fuck?", "score": 2, "replies": []}, {"body": "How about MCK as primary COVID vaccine distribution for all vaccines except Pfizer. Meaning Moderna, etc....?", "score": 0, "replies": []}, {"body": "Keep in mind a lot of those beverage companies didn’t get paid or are owed a lot of money from restaurants that closed temporarily or went out of business.", "score": 1, "replies": []}, {"body": "Who is providing security to these trucks ?", "score": 1, "replies": [{"body": "Paul Blart", "score": 1, "replies": []}]}, {"body": "Fedex can't deliver shit , they are operated af", "score": 1, "replies": []}]}
