{"title": "Massive drop in IV on options today?", "selftext": "There seems to be a massive drop in IV on options today for Dec 11th. Looking especially at SQ and MSFT. Some of them went from 90% to about 50%. Any reason why?", "id": "kbkf9z", "created_utc": 1607755054.0, "score": 0, "upvote_ratio": 0.43, "num_comments": 14, "comments": [{"body": "Please delete useless and incorrect posts.", "score": 7, "replies": [{"body": "lmao okay loser.", "score": -3, "replies": []}]}, {"body": "Expired", "score": 9, "replies": [{"body": "Lol", "score": 4, "replies": []}, {"body": "The options i was looking at were expiring in 2022 though?", "score": 1, "replies": [{"body": "You were looking at options expiring today if it was Dec 11.  Options expire on fridays. In 2021, it would be Dec 10.\n\nEdit:  2022 will be Dec 9", "score": 2, "replies": [{"body": "check out, MSFT 235 SEPT 17 2021, went from 71% IV to 27%. Am i going crazy or do you see it too?", "score": 0, "replies": []}]}, {"body": "Probably using that money to take punts in other stuff. I think it's time to buy MSFT calls.", "score": 1, "replies": []}]}]}, {"body": "What strike? I doubt they dropped that much if they are 2022.", "score": 3, "replies": [{"body": "MSFT 235 SEPT 17 2021\n\n\nSQ 230 JAN 21 2022", "score": 3, "replies": [{"body": "What did you find out? Anything? I’m curious too", "score": 1, "replies": []}, {"body": "I don't see it dropped that much in my data. When you say it dropped from 90% to 50%, what does that exactly mean so we are clear?", "score": 1, "replies": []}]}]}, {"body": "I see they went from 25% to 139%.", "score": 1, "replies": []}, {"body": "When in the day did you look? Given its so long dated its possible when you looked they either hadnt tightened up yet or if it was post close, electronic market makers pull their markets at the close often, so a wider market will appear to have lower IV bids and higher IV offers, and mid IV can get distorted higher or lower if one side of the quote is artificially higher or lower. In general, theres no reason for a dramatic drop in IVs on friday in megacaps so likely something off here on the markets you were looking at", "score": 1, "replies": []}]}
{"title": "Are Tesla puts too expensive?", "selftext": "[removed]", "id": "kbn5m4", "created_utc": 1607769803.0, "score": 6, "upvote_ratio": 0.72, "num_comments": 13, "comments": [{"body": "If you think the stock will go down you can use put debit spreads to save some money which is the same setup as these gentlemen are suggesting with calls.\n\nThough I wouldn't bet against Tesla right now. Pfizer's virus vaccine just got emergency use approval so I would expect the whole stock market will go up Monday.", "score": 19, "replies": [{"body": "Sounds like a Tesla 40 dollar move kinda day. Tesla likes Monday’s too.", "score": 7, "replies": [{"body": "Do you think musk shutting down the X and S lines will hurt Tesla?", "score": 1, "replies": []}]}, {"body": "Thats what I'm hoping for Fter this weeks crash of nio and tesla j pulled out acoulle small calls on both of them dated to exp. On the 31st of December.", "score": 1, "replies": []}]}, {"body": "Most people agree that TSLA's stock price is too high and a big correction is likely to take place. But people have collectively lost billions betting against TSLA this year. At some point, the people who buy puts will be right and they'll make good money. But nobody knows if or when that correction could take place. So for me, yes, TSLA puts are too expensive. You're basically betting that the market will suddenly become rational after spending so much time being irrational.", "score": 4, "replies": []}, {"body": "Yes, calls only", "score": 6, "replies": []}, {"body": "Too expensive for me to buy options here. I am selling premium though.", "score": 2, "replies": [{"body": "Do you mean you are selling calls/puts?", "score": 0, "replies": [{"body": "Yes.", "score": 0, "replies": []}]}]}, {"body": "I will not want to get caught losing for the sake of thinking it will go down. Too much stake built in the premium. For example. Jan 15 puts at $580 the premium is 51.85!   I will rather put the money elsewhere to make sure I use it effectively.", "score": 0, "replies": []}, {"body": "I will rather sell premium.", "score": -1, "replies": [{"body": "Why bother answering questions on stuff you're not knowledgeable on?", "score": 0, "replies": []}]}, {"body": "You can use a debit spread or a ratio spread to reduce the premium, although a ratio spread is going to change the risk profile depending on your ratio.\n\nThe options are priced expensively because the market is expecting a big move. You can't say whether it's too expensive or not without comparing it against your own expectations. If you don't think Tesla is going to move as much as the market is pricing in you could sell a call credit spread for a bearish position instead of buying puts.", "score": 1, "replies": []}]}
{"title": "Is it possible to calculate an option spread's 100% weighted expected value?", "selftext": "After trading only calls and puts for the past 2 months I'm now trying my hand at bull put spreads on recovering sectors such as cruise lines and airlines. So far the expected value calculations Ive found online have only used the simplistic expected value calculations and don't account for the profit or loss possibilities between break even and the two strike prices\n\nI've been trying for the past few hours to see if a spread can be calculated to have a positive expected value with a full 100% weight in the Expected Value calculation.\n\nMy calculations are rough, and absolutely wrong, but I cant find a solution anywhere on the web. I also only have access to interactive brokers delta instead the OTM or ITM probabilities of thinkorswim. \n\nFor example, if you issue a bull put spread on AAL- American Airlines (selling $16 strike put, buying $15 strike put) with an expiration of Jan 15, 2021, you get the following options chain and deltas:\n\n&#x200B;\n\nhttps://preview.redd.it/ikdggwtxar461.png?width=1675&format=png&auto=webp&s=db0333ddd636a677e2c736c359ef96f350c633d1\n\nAssuming you buy and sell at midpoints your max potential profit (credit) is \\~$42, the probability of obtaining your max profit is the inverse of delta on the $16 strike short leg, meaning 64.7%\n\nyour max loss $-100 is reached when your long $15 strike put is ITM, meaning the delta of 26.5%.\n\nBased off of simplistic expected value calculations you get:\n\nEV=(0.647 \\* 42) + (0.265 \\* (-100))= 0.73903509 = meaning you should expect to make $0.71 cents on this spread trade\n\nStatistically you should take this spread trade every single time across thousands of opportunities and you would make money in the long run. However, if you add up the weights in the expected value calculation you only account for 91.2% of possibilities.\n\nThere is an 8.8% left over chance that the stock could fall anywhere between $15 and $16 at expiration and even touch the break even point where no money is made at $15.58. The problem is that there are an infinite number of calculations to add the final 8.8% weight to the expected value calculation. There's probably been 100 million people who already found the solution but for some reason I cant find it online, can anyone point me in the right direction or let me know if there's a way to find the delta at $0.25 intervals, such as the unlisted strike prices $15.25, $15.50, $15.75?", "id": "kbpnlv", "created_utc": 1607782091.0, "score": 6, "upvote_ratio": 1.0, "num_comments": 13, "comments": [{"body": "Spreads are priced pretty efficiently that their EV is very close to zero. You, as a retail trader, will have to give the opposite party (most likely a MM) an edge to get inti the trade. So most of the time, you will get a fill with a negative expected value. \n\n**The basic math and some corrections:**\n\n> EV=(0.647 \\* 42) + (0.265 \\* (-100))= 0.73903509 \n\nFirst, Your max loss is not $100. It's only $100 - $42 = $58.\n\nThen, **delta is only an approximation of the probability of expiring ITM**. This approximation diverges if there is **long DTE or high IV.** AAL has around 95% IV which is pretty high, this cased the PITM to diverge significantly from delta.\n\nFor the $16 strike: delta is about 0.36, while PITM is around 48% (POTM \\~ 52%)\n\nFor the $15 strike: delta is about 0.28 while PITM is around 39% (POTM \\~ 61%)\n\nThese numbers are based on ToS's calculations.\n\nLet's now calculate your EV with these more accurate numbers:\n\nEV = 0.52\\*$42 + 0.39 \\* (-$58) = $21.84 - $22.62 = **-0.78.** So you would expect to lose around $0.78 per trade over the long run. As expected your EV will be very close to zero. And it will be a little worse when you account for slippage (if you're not getting filled at the mid price).\n\n**Exact EV calculation:**\n\nIf you want to calculate the exact EV you will need to integrate the PoP(X) \\* Profit(X) over the distance between $15 and $16. Which is not an easy task to do. Instead, you can assume that EV of the profit and loss between the strikes is zero and ignore that. Especially that $15 and $16 are pretty close together.\n\nAnother idea is to discretize the problem by slicing the distance between $15 and $16 into discrete intervals (say $0.01 apart). Use BSM to calculate POTM of the hypothetical strikes in between ($15.01, $15.02, etc.) and your EV between $15 and $16 would be the summation of each PoP \\* Profit at this point.", "score": 4, "replies": []}, {"body": "Yeah, this is a common problem. It is easy to estimate the expected value of the max gain and max loss but for the gray area in between (the spread between max gain and max loss), although it is trivial to estimate the probabilty, it is a challenge to estimate the expected value.\n\nI have always looked at that problem as dealing with a well-defined tranche of the stocks log-normal distribution (calculated by using an Euler's exponent of the core growth rate distribution assumed to be normal) by using a proprietary brute force calculation that I think is very accurate.\n\nI am currently working on a model that will allow that segment to be calculated by traditional integration using (in Python/Numpy) the scipy.integrate.quad method. Because that method requires a lamda function, I am finding the implementation of the lamda function into a Numpy environment a little challenging.\n\nI hope to get this done by mid-January (it is not the only thing I am working on). After testing, I will likely release the method (since most of what I do is open source).", "score": 2, "replies": []}, {"body": "Try [options profit calculator](http://www.optionsprofitcalculator.com )\n\nNot sure if it will answer what you are looking for but it's worth a try. \n\nUs your image from IB or Tradestation?", "score": 1, "replies": [{"body": "The image is from tradestation. Ill try fooling around with that site, looks good", "score": 2, "replies": [{"body": "Sorry to bother you but I am thinking of switching to TS from TOS due to lag and slippage. Are you happy with TD and what data packages do you subscribe to?", "score": 1, "replies": [{"body": "Srry i was up way too late while making this post, my broker is Interactive brokers, and their software name is ‘trader workstation’. Right now i dont have a real time data package which is $4.95 per month, but on my account if i reach more than $10 in commission per month i get real time options price data for the rest of the month, which is good enough for now. Interactive brokers just had a complete server outage last monday which lasted 3-4 hours at market open. The community was pretty pissed and i lost a lot of confidence in interactive brokers.", "score": 1, "replies": []}]}]}]}, {"body": "[second half of comment added a few minutes later]\n\nThere are also three sticky issues to consider:\n\n1.  Should your model take into account your estimate of slow drift as estimated from recent historical data, which is not possible using a BSM model unless it is modified? Mine does because it does not use BSM. Important because if this drift is positive (typically the case), then it raises the probability of max gain and lowers the probability of max loss for a put credit spread.\n\n2. To estimate expected values, which volatility measure should you use? I think that carefully-measured recent (like 30-day or 90-day) estimated daily (not annual) historical volatility instead of the option's IDV should be used.\n\n3. Finally, the ultimate question for all of these models ... how to account for tail event probabilities (although far less important for spreads than it is for, say, strangles either long or short)?\n\nI am curious about your opinion for issue (2.). [edit: clarity]", "score": 1, "replies": [{"body": "I've actually just started the process of learning Python through Google Coursera/University of Michigan. My first goal is to create a script/API that will automatically scrub through the option chains of S&P 500 stocks. It would apply an EV calculation to each spread and highlight results with positive expected values. It looks like we have the same issue of not wanting to ignore the insignificant but still important unknown profits/losses. That 8%-10% of unknown data could be the the difference between a buy decision.\n\nWhile I completely lack the experience with coding that you have, a sharply skewed lognormal distribution would have to be carefully observed, as the difference between a  positive and negative expected value could be the result of a biased view of the coder.\n\nI'm glad I posted this though because it amazes me that such a seemingly simple calculation isn't provided by brokers. Your post has given me hope to continue learning.\n\nAs for volatility, I'd probably experiment with using a short term historical data (30 days) if I were planning to calculate and trade credit spreads with 14-25 days until expiration. I could be wrong but it seems like using short term recent data would be more significant when issuing short term spreads. When going beyond 35+ days till expiration, long term historical data would give a better long term outlook.\n\nDo you have a place where you upload your open source code? I'd like to review some of your past work, and keep updated on your future projects.", "score": 1, "replies": []}]}, {"body": "The market isn't 'mathematically perfect'. No model will achieve the accuracy your seeking. There's to many unknown factors.", "score": 1, "replies": [{"body": "These models are all stochastic. They accept bias, imperfection, odd behavior, and the like. They do not necessarily even accept the notion of efficient markets, other than to say that the markets often tend toward efficiency. \n\nOP is not looking for precision or accuracy. He is looking for an estimate ... in this case, an estimate of probabilities that he knows will have a wide range and possibly biased.\n\nThat has always been the nature of these kinds of models. That is the nature of Black-Scholes-Merton. That is the nature of the Greeks, of the Delta, the Gamma, and IV. And yet probably 90% of the people on this sub use them.", "score": 1, "replies": [{"body": "The nature of models like Black-Scholes is what I was attempting to point out. I mean, they're handy to make estimates but so many traders treat them like gospel. Lack of understanding and over reliance on the greeks cost me a little money when I first started trading options. Luckily I'm cautious when exploring new areas of the market and researched how these models were formed. \n\nSo, I attempt to point it out...", "score": 1, "replies": [{"body": "OK. Yeah, I agree that many traders come to over-rely on these models. And caution and skepticism are probably more healthy than not. I get your point.", "score": 2, "replies": []}]}]}]}, {"body": "Try [www.hedge-app.com](https://www.hedge-app.com).  Provides analysis and backtesting of any strategy.", "score": 1, "replies": []}]}
{"title": "Is short selling a self fulfilling prophecy? TSLA", "selftext": "Michael Bury (famous for short selling of housing market  2008 financial crisis) has said he is going to short TSLA.  My question is, since he is an influential person, when investors hear that he will be shorting it, lots of people will sell, thus will drive the share price down?  Do you think we will see a dip in TSLA if Bury goes ahead with his claim of shorting it?", "id": "kbwre9", "created_utc": 1607806518.0, "score": 5, "upvote_ratio": 0.73, "num_comments": 17, "comments": [{"body": "[deleted]", "score": 15, "replies": [{"body": "Also the market can remain irrational longer than you can remain solvent.", "score": 3, "replies": []}, {"body": "Now tell that to a patient going in for surgery", "score": 0, "replies": [{"body": "why? it doesnt apply there", "score": 4, "replies": [{"body": "Past performance is no guarantee of future results. \n\nYou’re cute to think that surgeries are without complications and that results of one patient translates to another.", "score": 2, "replies": [{"body": "Hush, kids dont like it when you tell them the truth!", "score": 1, "replies": []}, {"body": "who said there is a guarantee of surgeries without complications?\n\nyou cannot even comprehend two sentences properly and want to start a discussion. give me a break.", "score": 1, "replies": []}]}]}]}]}, {"body": "If you are going to short Tesla, you want to wait until after the 18th.", "score": 7, "replies": []}, {"body": "Could be. Again Tesla has had a huge run up since the announcement to the S&P. I would not at all be surprised if we see the stock price drop 10-20% or even 40% (like the recent post-split drop). Question is, is Tesla going to keep crashing down to 0 (as most people compare Burry’s bet to the ‘08 housing crash)? I think not.", "score": 4, "replies": []}, {"body": "Tesla is much different than the housing crisis in 2008...", "score": 5, "replies": [{"body": "Tesla is way more overvalued.", "score": 4, "replies": []}]}, {"body": "Influence can absolutely play a role. But it requires shifting a lot of minds in this instance. Not sure he will have that level of sway over Tesla bulls.", "score": 2, "replies": []}, {"body": "I heard it wasn’t about the money,                                       \nit’s about sending a message.", "score": 2, "replies": [{"body": "You must roam around r/wallStreetBets \n\nEdit:corrected link", "score": 2, "replies": [{"body": "Very correct sir!", "score": 2, "replies": []}]}]}, {"body": "You'd hope that the reason this fellow may be shorting a stock is better than his confidence in his own persuasion skills.", "score": 1, "replies": []}, {"body": "I’d wait till 21, bc it’ll be added on 18 and all the companies must buy TSLA shares and that’s heavy inflow and it might inscrease share price 5-20% I wouldn’t wanna be short side, after 21 maybe everything is done now all in", "score": 1, "replies": []}]}
{"title": "NIO, Xpeng, and Li Auto Are Not the Next Tesla. Why It’s Time to Unplug From Chinese EV Stocks", "selftext": "[deleted]", "id": "kbg8qa", "created_utc": 1607737670.0, "score": 1, "upvote_ratio": 0.52, "num_comments": 13, "comments": [{"body": "This was a lot of text that says nothing. They don't have to be the next TSLA to be good for day/swing trading, they only need volume which they have. Learn how to play stocks both ways, not just long.", "score": 18, "replies": [{"body": "Yea that guy would make a great politician.", "score": 2, "replies": []}, {"body": "Quite a lot of text indeed. After skimming the first few paragraphs I realized I was only 1/5 of the way done. I can’t tell if this much text means they’re shorting or they care about me a lot. I’ll pretend it’s the latter.", "score": 1, "replies": []}]}, {"body": "They’re obviously not the next Tesla but in the EV space they’re the biggest competitors to invest in.\n\nNorth American EVs (outside Tesla) are way behind the Chinese evs. Also secondary offerings hurt the short term stock price but they can improve the companies financials long term. \n\nI remain bullish on NIO, XPEV and LI long term but it’s expected that stock prices will go up and down. Would not be shocked if all 3 of these companies were 3x the price end of next year", "score": 6, "replies": []}, {"body": "Thanks for wasting my time reading this", "score": 3, "replies": []}, {"body": "I dont see rockets or positions, yoloing NIO.", "score": 2, "replies": []}, {"body": "Kind of depends how long you want to hold them though. Sure they have gone done some and may go down again in the next couple months. But the growth is there if you want to hold them for years.", "score": 1, "replies": [{"body": "The source is the same guy who posted an opinion piece that NIO’s stock is actually in a good place according to analysts yesterday. Think the writer just wants to follow market sentiment for clickbait.\n\nhe seems to bounce around a lot saying all 3 are doomed because 1 or 2 have a specific issue and even made it a point that the CCP is favoring EV to be half the market in 15 years but never elaborated. Personally, I’m more interested in the next couple months with NIO ready for new announcements in January and all 3 companies having a major in flow of cash in the upcoming year. His point of lack of scalability is exactly why they’re selling more shares. \n\nI don’t think any are the next Tesla as that would be almost impossible to achieve today, but they are cutting a piece of the market that will continue to grow despite quality of the company. Even if they weren’t innovative, they’re slowly becoming a necessity.", "score": 7, "replies": []}]}, {"body": "The big, big difference is that Tesla is at least 5-10 years ahead with their self driving AI modeling.  Tesla has a decade of self driving data from millions of cars, which will take the Chinese companies a long time to collect the data from scratch.  I wouldn't trust Chinese self driving tech until 2030 at least.\n\nThe minute Chinese quality self driving AI starts killing people in foreign countries, the shit will hit the fan.", "score": 0, "replies": [{"body": "Couldn't agree more. When real self driving AI hits the USA, shit will hit the fan also. The amount of jobs lost in the taxi cab, shipping, truck driving, etc along with a growing and longer living population is going to create a larger wealth disparity.\n\nI don't think China is looking to create AI self driving cars, labor is cheap and those jobs create a larger middle class. They mostly care about the pollution aspect.", "score": 3, "replies": []}, {"body": "I have a feeling self driving AI for NIO is heavily heavily funded by the Chinese government, who is unbelievably rich. Tesla doesn’t have that level of R&D in my opinion.\n\nEdit: Beijing is so incredibly advanced in every other sector and their growth is so bloody fast it’s crazy. They got to where we are with their space program a lot faster than we got here. I’m a strong believer China is investing more in technology than America is. Mostly because their R&D is state owned(communism) and ours comes down to the limits of private companies.", "score": 2, "replies": []}, {"body": "i dont see as tesla autopilot being the best arou d. YouTube comparison between GM Cruise and tesla autopilot. Please share with us If you have information that disproves that tesla is the better out there", "score": 1, "replies": []}]}, {"body": "Eventually some Chinese EV companies will be much bigger than Tesla.\n\n1. China's car market is 170% the size of the US right now.\n2. China says that they want 50% of the market to be EV by 2030. That is much more likely to happen in China than the US since the US has a lot of vested interests in the gas powered auto industry that will fight it. Also, there is much more skepticism regarding climate change.", "score": 1, "replies": []}]}
{"title": "I hope I didn't go wrong.", "selftext": "So today I bought 20 shares of ABNB at $150 thinking it is good for a hold (few months, snowflake) and it did what I should have expected.  As an offset (not even close) I bought 1 share of TSLA at $600.  It is the only share I own.   Testing the waters.   I think I gave myself a good one waiting on ABNB.", "id": "kbhaln", "created_utc": 1607741672.0, "score": 0, "upvote_ratio": 0.2, "num_comments": 13, "comments": [{"body": "I still think Snowflake is in for a huge drop below ipo price in the not to distant future.", "score": 4, "replies": []}, {"body": "You’re not gonna get any real reassurance here man, but I think you’ll be okay if you just close your trading apps and wait a few months.", "score": 7, "replies": [{"body": "Thanks, but I didn't lock in all my funds.   I still have play money.  I did deals i felt i would be comfortable with, and ok if I took some loss.", "score": 1, "replies": []}]}, {"body": "I bought 10 shares bro. As others have mentioned. Think long term here and enjoy the ride. Im expecting to hold this at least for 2 years. Best of luck", "score": 2, "replies": [{"body": "I have an order in for 20 shares for TSLA Monday. It obviously will go up from 600 right? Didn't Salesforce climb until inception, to even a few days after? TSLA should be similar? Or am I just retarded.", "score": 1, "replies": []}]}, {"body": "$139.25 at closing", "score": 2, "replies": []}, {"body": "That’s the thing, no one knows for sure which way any stock will move. Do your best due diligence and diversify your holdings. Best of luck!", "score": 1, "replies": []}, {"body": "RemindMe! 3 months. \n\nCause I haven't panic sold.", "score": 1, "replies": []}, {"body": "you’re about to get eaten up by the bankers lol", "score": 1, "replies": []}, {"body": "You went wrong. I’ll buy from you when it dips and you panic selling.", "score": 1, "replies": [{"body": "🤣", "score": 1, "replies": []}]}, {"body": "RemindMe! 3 months\n\n“Hi I’m from the future, I’m here to tell you that your about to be ass fucked on at least one of those trades.”", "score": 1, "replies": [{"body": "I will be messaging you in 3 months on [**2021-03-12 23:50:55 UTC**](http://www.wolframalpha.com/input/?i=2021-03-12%2023:50:55%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/stocks/comments/kbhaln/i_hope_i_didnt_go_wrong/gflywn6/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fkbhaln%2Fi_hope_i_didnt_go_wrong%2Fgflywn6%2F%5D%0A%0ARemindMe%21%202021-03-12%2023%3A50%3A55%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20kbhaln)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}
{"title": "Pfizer stock", "selftext": "Now that the FDA has approved the Pfizer vaccine , is it too late to get into the stock Monday or next dip ? It still doesn't seem to have run up that much and seems fairly valued and set to surge? I know the approval is probably priced in to a degree but do you see some growth in price in the coming months . Moderna approval is on the horizon but it has already gone up significantly more then Pfizer.", "id": "kbhdew", "created_utc": 1607741987.0, "score": 1, "upvote_ratio": 0.57, "num_comments": 14, "comments": [{"body": "If you’re reading about it, it’s probably old news to the institutional traders and wiseguys.", "score": 10, "replies": []}, {"body": "Sell the news.\n\nEdit: if the vaccine is available for free to millions of Americans, that’s not the same as selling millions of doses, as the sale will be government subsidized and not at retail markup, like other pharmaceutical drugs.", "score": 6, "replies": []}, {"body": "I would not count on there being a big pop. The big pop is probably already baked in", "score": 10, "replies": [{"body": "Agreed. I've been thinking about it, but once it hit $40 I figured the best has already come", "score": 3, "replies": []}]}, {"body": "I wouldn’t; it’s priced in already. It may even go down more later as Novavax should have efficacy results in January (possibly mid-December) and their vaccine had the strongest immune response with sterilizing immunity in all the monkeys upper airways. It only needs normal fridge temps, has milder injection side effects, and potentially can be combined with their flu shot approved in March. \n\nSo if NVAX comes out with >90% efficacy, it’ll be a clear front runner and may knock down the others a bit. Who knows how it’ll play out but for me there’s too big a chance of downside for PFE. \n\nAnd yes my NVAX shares are ready for some good results 🤞🏻", "score": 3, "replies": []}, {"body": "Pfizer market cap is very high making it hard to move to begin with. Couple that with a huge billions float and outstanding shares, means that $1 price movement takes a lot of volume. Which is why moderna fluctuates a lot more with way lower float. Look at tesla, yes they are almost a trillion dollar company but their float and outstanding shares are lower than most similar large companies so price movements are more aggressive. Plus ppl sold the news and it gives ppl seizures lmao", "score": 2, "replies": []}, {"body": "The vaccines are not about making much money, so they don’t necessarily translate to higher stock price, the vaccine is a two dose regimen, they have a large portfolio of medicine people take daily for life with a higher per dose profit margin. \n\nIt is kinda like Mercedes winning a car race, it is about showing off their R&D chops rather than about making money directly.", "score": 2, "replies": []}, {"body": "It boggles my mind why this stock hasn't reached the stratosphere yet...", "score": 1, "replies": [{"body": "Because Pfizer is a blue chip....their claim to fame was viagara. You won’t see large price movements with them as you will with Moderna and Novavax", "score": 3, "replies": [{"body": "Viagara? You think they would be up then...", "score": 5, "replies": []}]}]}, {"body": "You will not see a huge spike as it takes A LOT to move this stock as the float is massive at 5B shares and the revenue this will generate is small relative to their total revenue - different for MRNA obviously. PFE will continue to grind higher with more approvals and deals with other countries around the world.", "score": 1, "replies": []}, {"body": "Love PFE for a long term play.", "score": 1, "replies": []}, {"body": "I’d expect PFE stock to be a pet rock unless you just like the dividend yield", "score": 1, "replies": []}]}
{"title": "How to take advantage of companies moving to Texas?", "selftext": "Companies like Tesla and Oracle are leaving California for Texas. This is because of tax rates, right? Are there any tickers I could look into to take advantage of this migration to Texas, or is there another avenue of investment? Thanks for any and all replies.", "id": "kbhnkp", "created_utc": 1607743065.0, "score": 18, "upvote_ratio": 0.82, "num_comments": 19, "comments": [{"body": "[deleted]", "score": 18, "replies": [{"body": "Haven’t looked into it yet but that’s probably the move, wondering if it’s already up", "score": 2, "replies": [{"body": "Up 13% a year", "score": 3, "replies": []}]}]}, {"body": "Buy some rental properties there ?", "score": 9, "replies": [{"body": "Just dont hang on to it too long. When texas is as blue as the sky from all those people voting the same way it'll be another mass migration.", "score": 15, "replies": []}]}, {"body": "Texas municipal bonds?  I'm just spitballing.", "score": 5, "replies": []}, {"body": "its becasue california is turning into a steaming shithole. and taxes are nice too", "score": 27, "replies": [{"body": "Texas is hot as hell and there are definitely parts that are 100 percent shithole.", "score": 20, "replies": [{"body": "Proud Texan here. Pound for pound Texas has more shithole than not. We make some great postcards but if you throw a dart at Texas map, odds are your’re going to hit a spot that’s not worth slow down for.\n\nDrove around California two years ago, up/ down four times: my god, that was one of the shitholeless places I’ve ever seen. Once we stopped the car and I said, “look baby- something ugly.” It was just a generic strip center with an asphalt moat, devoid of any charm, novel only cuz it was lonely in the ocean of eye candy that is California.", "score": 9, "replies": []}]}]}, {"body": "That’s not a tangible enough to overcome the fundamentals and/or any other whim of the market. Go buy residential real estate in Austin if you want exposure. But they are already in a double bubble so good luck with that too. See what I mean?", "score": 3, "replies": []}, {"body": "Tesla has not relocated to Texas. Elon Musk changed his residency to Texas. Huge difference.", "score": 5, "replies": [{"body": "He made plans to move most of his operation to Texas/Nevada:\n[article](https://www.google.com/amp/s/www.bbc.com/news/amp/technology-55246148)", "score": 8, "replies": [{"body": "Claim to plan to move and actually move are two very different things. There is a lot of posturing going on in order to extract concessions. Moving a HQ and manufacturing facilities is no small feat. It is expensive and takes lots of planning and time. I see no evidence of that happening right now.", "score": 1, "replies": [{"body": "Fair, but he is building factories there and I’m trying to get in on the general trend of tech companies looking towards texas", "score": 7, "replies": []}, {"body": "Tesla might not leave(at least not quickly), but this almost certainly signals they arent expanding in California.", "score": 1, "replies": []}]}]}]}, {"body": "Land in ATX is in a decades long mega boom.", "score": 2, "replies": []}, {"body": "Nothing. Too small for commercial REIT sector, unless they purchased properties through one specific company.", "score": 3, "replies": []}, {"body": "They’re moving because Texas is the best state\n\nPeople from cali downvoting me lol", "score": -1, "replies": [{"body": "It is the \"stickiest\" state - people who are born there are the least likely to leave out of all the states in the union.", "score": 5, "replies": []}]}, {"body": "California should ban Tesla and lol at Elon. Tesla would shat itself without the 6th largest economy in the world ....tax dodger Elon", "score": 0, "replies": []}]}
{"title": "If the bubble bursts...", "selftext": "After reading through this sub and others discussing the stock market, I imagine many of you are in the same boat as me thinking this gravy train that is the current stock market can’t last forever. I (30m) had a goal of hitting 100k in my retirement accounts by the time I hit 30. Unfortunately, the timing of COVID caused me to just miss my goal by a couple weeks before my 30th birthday when the market took its big dive in March. However, I took that drop as an opportunity to buy and just hit 200k. I know full well that a significant portion of that money (~40-60%) could be lost when the market comes to realize the current state of the world’s economy as a result of the pandemic. But like the path I previously took in March at the start of the pandemic, I’m starting to stock pile money to buy when the correction happens (expecting in roughly 12-18 months). Should you have a stock pile of money when the next correction happens, what sectors and/or stocks are you eager to scoop up? \n\nI personally approach the market as purely long-term investment opportunity and am not looking for the quick turn and the risk that comes with that. I understand most on here will point to SPY and VOO for the best options or other general index funds for long-term investing; however, I’m wondering what some of your long-term, potential home run swing ideas are. I’m curious on your all’s thoughts regarding those companies that may not be well known enough right now but have the opportunity to change the world should their vision take flight. I’ve personally tried to shape a majority of my investing around companies that are pointed towards the future. \n\nLooking forward to hearing everyone’s ideas!", "id": "kbhxxc", "created_utc": 1607744175.0, "score": 16, "upvote_ratio": 0.75, "num_comments": 19, "comments": [{"body": "Blue chips... even if they dip, they’ll come back in a year or two. KO, JNJ, PEP, MSFT, etc.\n\nDRIP the dividends and let it keep buying more shares.", "score": 16, "replies": [{"body": "I’d say this is the safest strategy. I feel that DRiP is underestimated. \n\nEven though I’m in the same boat, I still buy the shit out of T when it dips and just wait again. Dividend bread and butter. KO, JNJ, PEP, MSFT they’re not going anywhere any time soon.", "score": 4, "replies": [{"body": "It’s not underestimated, it’s factually proven to provide a smaller ROI than investing in growth.  Buying dividend stocks at current prices is a safe and low profit move.  If you had bought dividend stocks back in March at the lows - well you’d have something to talk about.\n\nThis is what I did and have extremely strong dividend stocks like $dow handing me a 10% yield.  Absolutely ridiculous!  And I use that equity position as part of my maintenance to sell stupidly otm puts for even more return.", "score": 6, "replies": [{"body": "Depends on your risk tolerance tho... blue chips might not have strong growth, but they’re more stable and tend to grow with the market. It’s great for people who aren’t on top of their investments nor know much about the market.\n\nEven big growth can fizzle out and drop, so for that strategy you have to be more on top of it. Depends on what OP wants to do I guess.", "score": -1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Dividend Reinvestment Program", "score": 1, "replies": []}]}]}, {"body": "Dividends are the best...makes holding until the next market pop soooo sweet", "score": 4, "replies": []}]}, {"body": "Who knows when the crash is coming. Pandemic is waning. It still could be a few years until some other disaster hits. You can still pull out some funds and go into index funds if you want to be safer at this point. That way you still collect on dividends to ride out bumps", "score": 11, "replies": [{"body": "Yeah I am suspicious of this market but nothing I watch is flashing a huge crash.  There might be a normal pullback so make sure to keep cash on hand.  Normal years 10-20percent dips are where the gains come from but you need cash to take advantage.", "score": 1, "replies": []}]}, {"body": "If you feel like there is an inevitable crash coming soon then pull your gains now", "score": 6, "replies": []}, {"body": "Maybe there is a bubble, but here’s the thing, everyone has been saying there is a bubble since March. And yeah, they are probably right, however no one knows when the bubble is going to pop, and in the mean time you can miss out on some serious gains.", "score": 4, "replies": []}, {"body": "No bubbles are popping until interest rates rise, which won’t be for years. You have to be insane to not have your money in the market right now.", "score": 2, "replies": []}, {"body": "If you are saving for retirement, why do you care about a crash? Even 2008 only lasted a couple years, yet this account you’re going to keep buying into until you’re 60+", "score": 3, "replies": []}, {"body": "I keep around 20% in cash in case of a good buying opportunity. That can take the form of a new IPO/Direct Listing/SPAC, investment property, dollar cost averaging, etc.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "If there was ever a bubble...", "score": 1, "replies": []}]}, {"body": "Hehe, just curious why do you need to specify you are not just 30 but 30m? This isn’t a doctors office or a dating service. Help me rationalize this, the only explanations I come up with are not good 1) securely hoping for a PM from an impressed lady 2) sexist (God forbid they think I’m 30f) . Do you think the advice will be different depending if you’re m or f?", "score": -4, "replies": []}, {"body": "I think keeping cash is just as speculative as timing stocks tops and bottoms which I can’t do. So my opinion on that is ignore the volatility and invest long term riding out the waves. When march happened, yeah I wished I had tons more cash to put back in at the bottom. I knew it was a great opportunity. But I would have also had to predict that from about 1 1/2 years prior which would not have happened. And if I thought 2-3 years prior or greater that a crash was coming, I would be behind by missing out on the gains pre crash. So for right now, will 2021 be a big crash? Or 2024? Because I will likely be behind if I keep cash out and its 2024, or worse- its like 10 yrs later.", "score": 1, "replies": []}, {"body": "as someone who was in the internet magic money burst of 2017 (which was essentially and 80% drawdown) its not that bad.  we had a community spreading memes etc.  We just dug out of the hole and came back stronger.\n\nI've learned that memes and videos dictate stonk price.  those with the best ones will go up the most.", "score": 1, "replies": []}, {"body": "Diversify internationally, get a global market screener and a list of countries by GDP and quality of life.\n\nThen go down both lists and buy the best dividend paying companies in those markets.\n\nOnce you reach the top 10% of both indexes job is done, go to sleep happy in the thought that the only thing that can hurt your investment some alien ashole deciding that they want to play the script of Independence Day...", "score": 1, "replies": []}]}
{"title": "$net", "selftext": "What does everyone think about net? Its releasing a new product right and and has great q3 earnings. Is the same expected for q4? I bought $90 calls that expire in July, and am trying to look at it, but with the steep growth I'm getting worried about a crash. Is this high growth rate sustainable? Or will there be a correction soon?", "id": "kbj97b", "created_utc": 1607749640.0, "score": 3, "upvote_ratio": 0.67, "num_comments": 13, "comments": [{"body": "NET and Apple partnered up recently for privacy internet protocol so that’s good.", "score": 12, "replies": []}, {"body": "Does NET go down anymore?", "score": 7, "replies": []}, {"body": "net only go up", "score": 5, "replies": []}, {"body": "Got in at 35 it really has 🚀 since then", "score": 6, "replies": [{"body": "Me too. Thanks to this subreddit. \nI've learned that this Reddit is usually great with tech all around. Very hit or miss with pharma.", "score": 3, "replies": [{"body": "What are some of your next picks/plays considering this?", "score": 1, "replies": [{"body": "I liked APPS and PD. Got in a few months ago though. And love CLSK longgg", "score": 1, "replies": [{"body": "I got out of my net options and into apps yesterday morning. It's been pretty good since.", "score": 2, "replies": [{"body": "Good luck!!!", "score": 1, "replies": []}, {"body": "How bout dat CLSK??", "score": 1, "replies": [{"body": "Didn't do it, prob would of made 75%+ today lol. Still up a nice 30% on my apps calls.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Momentum and sustained expectation for the future will carry the stock upward. As for whether or not it will inverse a possible red market, no one will know. Regardless, I think it's a great hold.", "score": 3, "replies": []}, {"body": "I think you are OK. It needs to show more earnings.", "score": 2, "replies": []}]}
{"title": "Unpopular opinion had to share", "selftext": "Replying to another post I felt I needed to share this with some of you.  It helped put things in perspective for me earlier this year.  As I continue to refine.\n\n1.  If you are buying a stock based on it's fundamentals then holding it for a few weeks or months before selling, you are not an investor, you are trading the stock.  Minimum of a year to even begin calling it an investment....\n\n2.  If you aren't beating the SP500 (at least, preferably the Nas100) as a benchmark, you are NOT a successful trader or investor, and have no business giving advice.  Just because you've made x $ doesn't mean you are a wizard, I think everyone is up on the year unless you are just completely incompetent.  \n\n3.  If one of you stocks did not exists (aka tsla, Nio, etc.) You wouldn't be profitable (so take away all your profits from that one stock and see if you still are still ahead of the benchmark sp500) then you aren't a profitable trader or investor.   \n\n4.  If you aren't tracking your progression and don't actually know the answer to the previous 2 questions.....  Well I just hope you learn something new in the next year when everything calms down again, because you are about to give everything back  chasing the good ol days when you made a grand in 1 day. \n\nHopefully this helps at least 1 person to step back and track their strategies.  Full disclosure, I sell options as a trading strategy (uncorrelated assets) and hold equities for investment in my self directed IRA...  I rarely trade stocks anymore and make very consistent gains and rarely have red weeks.", "id": "kbnkap", "created_utc": 1607771974.0, "score": 0, "upvote_ratio": 0.32, "num_comments": 19, "comments": [{"body": "Interestingly, this is basically just a list of descriptions and not actually helpful for stepping back and tracking strategies at all. No wonder your opinions are unpopular.", "score": 8, "replies": [{"body": "Sounded like OP was trynna act smart to me...", "score": 3, "replies": []}, {"body": "I see your point.  It was meant more for some of the posts I've seen more frequently where people are taking on way more risk and then getting skiddish because of \"success\" they are trying to replicate.  I'm betting we can all be empathetic to that feeling.  \n\ni wasn't going to write an entire guide because what I do is quite complex for someone who is just use to picking companies they see value in.  \n\nMore of a warning that if you buy a stock for \"investment\" then scare off when it drops two days later 10% then you really have a terrible plan mixing and matching strategies.", "score": 2, "replies": []}]}, {"body": "I do not agree with #3. As an investor, many times your gains are carried by just one or two stocks for the year and that is perfectly fine. That also applies to the S&P, with MAGA-F carrying the largest weighting. If they don’t perform well, neither does the S&P.", "score": 7, "replies": []}, {"body": "#2 is just a Result Oriented Thinking trap. The idea that you can’t be right unless it you can prove it with the resulting success is just simply untrue, in stocks and in life. \n\nIf I pick a good stock with good fundamentals and it all looks correct on paper and then it turns out the CEO chokes on his dinner or has a big scandal, that doesn’t mean I made the wrong choice to invest in that stock. \n\nThe point also implies I have to ALWAYS be beating SP500, despite the fact that the point before criticized the idea of a short timeline. Is my advice more or less valuable now compared to three years from now if I’m not making money at the beginning but I am at the end?", "score": 6, "replies": [{"body": "...does anyone know why my first paragraph is large font and bolder?", "score": 6, "replies": [{"body": "!!  I know!! You used bold to emphasize an idea or point :) :) :)", "score": 1, "replies": []}, {"body": "Lol did the same to me. Started with # bolds it", "score": 1, "replies": []}]}, {"body": "Eh, with this kind of year and the past 3 years being uncharacteristic in their bullishness...  I'm not saying you won't EVER be successful.  It's the whole point I was trying to make.  Step back and really ask yourself, would I have just been better off throwing it all in an index fund and walking away.  If the answer is yes, you need to step back and reevaluate you criteria.  \n\nMany people here are both investors and traders but most on this forum seem to use the terms interchangable to meet their current sentiment for their stock.  \n\nI do feel your point is applicable to long term investment.  You don't have to beat the sp500 every week, but I'd say you need to be every year or two.", "score": 1, "replies": [{"body": "I tend not to agree with #2 either. Not everyone has the same goals. And goals change. My goal changed last year because of where I am in life and what my family's plan is for the future. Today I favor capital preservation and income generation so reducing draw down risks while maintaining consistent gains are how I trade and invest.\n\nGood points though and I'm glad you shared it. Hopefully others can benefit.", "score": 1, "replies": []}]}]}, {"body": "3 is just stupid. Can we also take away the biggest gainers for the S&P? Or do we have to handicap ourselves by only removing our biggest gainers? Why does the benchmark have to be S&P 500? It’s just an index. What if my investment plan is to be more bond heavy and risk adverse? Why would I benchmark against a stock index? \n\nNow that you’ve doled out all this advise post your holdings and returns to allow us to consider if you qualify per your own requirement #2", "score": 4, "replies": [{"body": "Don't even know how I'd do that, but I'm up 26% on the year short term option trading (I aim for .5% a week on a 37k account) my long term is up about 100% but I have to say I don't trust a lot of the gains since I did catch a bit of the aapl, tsla, and some other heavy tech company run ups, then trimmed right before softbank did it's shinanigans by coincidence for a realestate deal.  So by my own rules I would say I'm actually not the best investor, just lucky, but I'm still working on it.  (Trader, I'm confident in my abilities, though I can do better.  I'm just cautious because of how I had to climb back after the first drop in Feb.)\n\nIt's kind of my point though and why I'm not advising anyone to follow any of my investments.  My trades, you can, but it's complex if you aren't fluent in options and different future products.\n\nI'm far from a lot of traders, and I've been on the losing side in the past, and I have to say this has been the easiest year to make money I've ever experienced and should have made more but I waited too long to go short, then too long to go long, but I'm way ahead of the sp500.  My long term is beating the nas, but not by much if you take out tsla and aapl.  (46% is pretty rough for a diversified portfolio).  \n\nI'm just reading way too many people giving advice when you clearly can tell from how they phrase and word things they are pretty new to this and taking way more risk than they understand in addition to confusing investor and trader.", "score": 1, "replies": []}]}, {"body": "I totally agree, except for the obsession to beat the market. I don't think the main goal of investing is to beat the market, because the are millions of markets. As example, I invest in dividend growing stocks that I will keep for the next 30 year at least (unless the firm does not match anymore the standards that made me invest into it). \nI mean, Warren Buffett said it best: first rule, don't lose money. Second rule, stick to the first one. Of course everyone wants to beat the market but in the end who really cares? There is no prize for it. So enjoy the gains and do whatever it takes to not lose money. \n\nAnd if you are a trader, it's the same rule: who cares about the market? It's about the strategy, because that is going to let you gain money over time.", "score": 3, "replies": [{"body": "If you already have massive amounts of capital, I think having a solid dividend strategy is good or at a retirement age where there is no need for growth.  I think anything better than .3% like a \"savings\" account is better.  I just read a reddit post from years ago where the person was asking how to claim 50k in losses because he was a day trader.  I couldn't help but laugh and say, yea, that's not a day trader, that's an active gambler.", "score": 1, "replies": []}]}, {"body": "Sounds like someone trying to justify their portfolio while everyone else blew past them. The number one thing about investing, is don’t give a damn about how well anyone else did, you invest for yourself and should only need to be confident and happy with your own performance. Only the new generational children investors compete for “% gains” when the reality is a percentage means nothing until it’s cashed at which point it’s “$ gains”.", "score": 2, "replies": [{"body": "I do have a friend that hit tsla big and was super excited he was blowing my portfolio and trading out of the water.  But it took a few months and exactly what I told him to play it cool happened and he was back to square 1.  I will admit some of the 500% gains are a bit fomo ish but I know what my strategy is about and it's a slow burn but consistent.  \n\nAll my short term is rotating about every two weeks, it's rare I hold a position more than that.  But long term, yes I agree with the percent doesn't matter till it's cashed.  \n\nBut I think you agree with me that people are misusing the investment and trading terms.  So many piled into Nio at the top and meant to trade it, then sold when it came down or bag held because suddenly their trade became an investment.  \n\nI just wish I had stepped back earlier in my trading because once I really sat down with myself and started keeping good track of how I was doing my current strategy was plain for me to see.  I stopped goofing around and shooting for short term price action and went with a profitable premium selling strategy.  It's not for everyone and I don't preach one thing in particular, but it works for me.", "score": 1, "replies": [{"body": "Absolutely agree with you many don’t seem to understand the difference between investing and trading, but never judge yourself based off someone else’s luck! If you’re happy where you’re at that’s what matters !", "score": 1, "replies": []}]}]}, {"body": "Controversial opinion : I agree!\n\nThat being said I’m beating the S&P even if you take out my 2 best performing trades(although that does put a significant dent in my YOY gains... and I have never held a stock longer than 3 quarters in 5 years (I tend to take my profits and run)\n\nMy personal policy is if I get 5% in a month on a trade  I’m perfectly happy to cash out. If I get more even better, but I won’t overstay my welcome hoping for 100% gains even if they do happen (ex TSLA which I have always avoided like the plague)", "score": 2, "replies": []}, {"body": "This is bull 🍌", "score": 1, "replies": []}]}
{"title": "How much can we expect PFE to jump?", "selftext": "Just want to get some advice. Currently have 15 shares. Wanted to get thoughts from people... Could we could see Pfizer numbers upwards of what we are seeing for MRNA? I’d expect some sort of jump on Monday consider the FDA Approval last night.", "id": "kbqndm", "created_utc": 1607786003.0, "score": 1, "upvote_ratio": 0.67, "num_comments": 13, "comments": [{"body": "There is a 0.000000% chance that Pfizer goes anywhere near Moderna's share price.  It's basically impossible due to number of shares outstanding.", "score": 9, "replies": [{"body": "Thank you!", "score": 2, "replies": []}]}, {"body": "They are a bigger company with less to gain then Moderna. Which explains why you won’t see as big of a price jump and have not to this day. I also hold Pfizer and would be happy to see a gradual price increase come Monday", "score": 3, "replies": [{"body": "That’s what I figured. I realize PFE doesn’t have all their eggs in one basket like MRNA does, so it makes sense.", "score": 1, "replies": []}]}, {"body": "I got into PFE at about $35. It's slowly and steadily worked its way up, and I would expect that to continue. It's not gonna be the volatile rocket that MRNA is, although I will hold both for a long time as PFE is just a good stable company and MRNAs technology will open many doors for them long term.", "score": 2, "replies": [{"body": "Thank you sir! I ended up selling my MRNA @ 145...but profit is profit right!", "score": 1, "replies": []}]}, {"body": "I think BNTX is the play", "score": 2, "replies": []}, {"body": "I honestly can't see PFE breaking $48 any time in the next year.", "score": 1, "replies": [{"body": "Ok thanks! I was considering picking up more if we thought it could jump ....but I’ll probably just hold my 15 shares for now.", "score": 1, "replies": []}]}, {"body": "$45 tops within 12 months imo. I got in around 35 a few months back for a seemingly good valuation and sold some 12/31 $40c to lower my basis a bit further (potential covid bump was the cherry on top). I’ll probably be forced to sell on expiration though", "score": 0, "replies": []}, {"body": "You know that BNTX developed the „Pfizer vaccine“ right?", "score": 0, "replies": [{"body": "I did not...", "score": 1, "replies": []}]}, {"body": "PFE is slow. But a good long term investment. Solid yield too. I see PFE at 45 by this years end. Vaccine will help create positive market sentiment towards Pfizer", "score": 1, "replies": []}]}
{"title": "Best commission free brokerage that offers fractional shares and a robust mobile/desktop app", "selftext": "Not sure if this is really a reasonable thing to be looking for, but I've been paper trading on webull and thinkorswim for a while before actually investing. I've grown to love the extensive feature set albiet challenging at first. I was going to use TD Ameritrade until I found out they do not offer fractional shares, and I really want to invest in amazon and other companies that I cannot afford to buy whole shares of. Are there any good commission free brokers that offer fractional shares and a really good interface? preferably both desktop and mobile\n\nTLDR; fractional shares, commission free, with thinkorswim type interface?", "id": "kbtmkc", "created_utc": 1607796274.0, "score": 1, "upvote_ratio": 0.67, "num_comments": 11, "comments": [{"body": "I use Fidelity to trade but I have couple of hundreds of dollars in Webull  and I like their interface better than Fidelity. \n\nSo trade with Fidelity and track with Webull.", "score": 3, "replies": [{"body": "This is exactly what I do", "score": 1, "replies": []}]}, {"body": "I like schwab. Wish I could see a bit more on mobile but combined with their PC platform I love it.", "score": 2, "replies": []}, {"body": "Robinhood is fine on desktop for executing fractional, commission-free trades. Not the best chart though, but you can always track in whatever chart you want, and trade on a separate platform.\n\nI usually consult the Thinkorswim chart before executing a trade in Robinhood. Best of both worlds.", "score": 1, "replies": [{"body": "Im looking online, are there any prerequisites to having real time data in TOS? Some reddit threads are saying you have to have a funded account with money in it to be able to use TOS. I never had that problem but i never really dove deep into it.", "score": 1, "replies": [{"body": "Maybe. I'm not day trading, so not worried about slight data delays.", "score": 1, "replies": [{"body": "What is a slight delay? if its like 30 minutes its not a big deal but if it was a lot more ill probably lean away", "score": 1, "replies": [{"body": "I'm pretty sure it's a 20 min delay. Not a big deal for multi-day/week/month positions. \n\nNot sure how to legally circumvent the delay, but it doesn't effect my current trading style.", "score": 1, "replies": [{"body": "There is a way they mentioned in the threads, contacting support about 60% of the time they just give it to you free", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Fidelity has been solid for me", "score": 1, "replies": []}, {"body": "I’ve liked Robinhood. It does go down from time to time but I’m also not a day trader so it doesn’t really bother me if it gets bogged down for an hour or two on a heavy trading day.", "score": 1, "replies": []}]}
{"title": "I’ve recently come into about 10k I didn’t have before", "selftext": "As the title suggests I’ve come into $10k I didn’t have before and I’m looking to grow it. I was looking for some advice or what you would personally do if you were in my shoes. I was thinking of buying some Tesla/amazon stocks but I don’t know if it’s too late to profit from that. Thanks for the advice!", "id": "kbuqgu", "created_utc": 1607799881.0, "score": 5, "upvote_ratio": 0.78, "num_comments": 19, "comments": [{"body": "I would read and inform myself outside of reddit most likely.", "score": 15, "replies": []}, {"body": "If I was in your position I'd split my portfolio into two parts. 5k for ETF investing  and 5K for picking individual stocks. \n\n&#x200B;\n\nETF portion: 1k in VOO, 1k in VTI, 1k in ARK fund (I like ARKW), 1k in QQQ or VGT, and then take 1K and find a sector specific ETF. Think about the economy and where you see it going in the next 10 years. What tech or type of business do you see being a growing part of our daily lives and way of doing business? If you can't decide or don't feel comfortable in your pick, perhaps just distribute the remaining 1k to other ETF's.\n\n&#x200B;\n\nIndividual companies: 1k in TSLA, 1k in Amazon (those are the two companies you have high conviction in)-- then pick 3 other companies. Pick a combination of blue chips and disruption stocks.\n\n&#x200B;\n\nThat's what I would do but also if you have a really high conviction that TSLA and AMZN will continue to grow, stick to your guns. Always stick to your guns if you have a high conviction. It's your life, your money and wouldn't you rather go down because you stuck to your guns than miss out on a huge gain because you let other people talk you out of your idea?", "score": 6, "replies": []}, {"body": "Better to get stakes in multiple early or mid stage, even pre-IPO companies via online platforms rather than buying listed stocks with hyper inflated PE ratios.", "score": 4, "replies": []}, {"body": "Ask yourself: Should Tesla be worth way more than General Motors, Volkswagen, Daimler, BMW, Ford, and Volvo combined? Because, at the moment, Tesla costs more than all those companies added together. I think that this is insanely expensive.", "score": 8, "replies": []}, {"body": "I would buy 10k worth of tsla first thing Monday morning if I was in your position.", "score": 0, "replies": [{"body": "Take this advice with a grain of salt and a trailing stop loss. Google “trailing stop loss” if you don’t know what that is", "score": 8, "replies": []}]}, {"body": "if you're buying tesla or amazon now, just dollar cost average it.  open a RH account (or any of the free, zero commission online brokerages) and buy stock slices at a weekly rate.  instead of plopping 10k into shares of 2 companies all at once, spread out the money over time.\n  \nprices fluctuate (and sometimes even go down), so by spreading it out over weeks/months you get an average price per share and mitigate your risk of buying at all time highs.", "score": 0, "replies": [{"body": "Don’t trust this guy.. he said stocks go down which is completely untrue", "score": 2, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "what does CPaaS stand for?", "score": 1, "replies": [{"body": "Communication platform as a service. It’s a cloud communication platform.", "score": 2, "replies": []}]}]}, {"body": "Just put it into an index fund and be happy with almost guaranteed gains", "score": 1, "replies": []}, {"body": "You need to go to Wallstreet bets and ask for their help. They can tell you what to yolo it on. You can also put it in an ARK ETF and let it grow and be safe.", "score": 1, "replies": []}, {"body": "Try doing lots of personal research before listening to people on reddit honestly. That being said I’m going to partially go against that and suggest looking into index funds especially if you’re inexperienced in the market. Best of luck", "score": 1, "replies": []}, {"body": "70 % VOO 20 %VGT 10 % ICLN.  Good luck.", "score": 1, "replies": []}, {"body": "Buy ARK calls\nLet Cathie work her magic\nProfit", "score": 1, "replies": []}]}
{"title": "“Passive Indexing is best for 99% of Americans” /yawn", "selftext": "That other thread is quite scary how many awards its gotten for unoriginal content. Ever heard of Dr. Michael Burry? In that you guys will create an indexing bubble? “Its guaranteed profit of 6.5% annually after inflation! Compounded gains of double your investment every 7 years! Theres no risk or downside, go 100% on equities! Everyones doing it! Why aren’t you?”\n\nI didn’t really learn anything from that thread. “Passive indexing is right for 99% of Americans”. This has been said and brought up so many times here and youtube. These threads are regurgetated and spammed so many times, you might as well be a Robot.\n\nPlease come up with new thoughts and ideas, instead of spammed Mantras. Try for once in your life going against the grain or the herd. Oops wait this is Reddit... aka Hive Mind.", "id": "kbz1nr", "created_utc": 1607814143.0, "score": 0, "upvote_ratio": 0.4, "num_comments": 14, "comments": [{"body": "michael curry never heard of him what does he do?", "score": 9, "replies": [{"body": "Dr. Michael. Burry. Look him up.", "score": -5, "replies": [{"body": "Any relation to Michael Curry?", "score": 11, "replies": [{"body": "Yes they're brothers.", "score": 4, "replies": [{"body": "Ah yes the 3rd and 4th brothers the Curry family along with Steph and Seth", "score": 3, "replies": []}, {"body": "What about steph curry?", "score": 2, "replies": []}]}, {"body": "Hearing his name is really making me crave Indian food.", "score": 1, "replies": []}]}]}, {"body": "Doesnt he play for the Golden State Warriors?", "score": 1, "replies": []}]}, {"body": "Gonna have to agree and disagree\n\nAgree that passive investor spam is annoying. If your only plan is to DCA into voo for the rest of your life, why do you come on here in the first place. Also, believe it or not, it is in fact possible to beat the market. “The market” isn’t some super powerful entity, it’s just the collective average of every equity. People fail because of fomo, panic selling, chasing already pumped stocks, etc. Also not everyone’s goal is to beat the market. \n\nAlso the “even professionals can’t beat the market”. Is a load of bs. First of all, hedge funds aren’t trying to beat the market, it’s literally in the name, so I lose brain cells every time someone uses that argument. There are also a lot more restrictions for institutional investors than there are for retail. Also, once you have more capital, you’re more restricted in what you can invest in. Buffett can make a 500% return on a small cap but it will barely move the needle on his portfolio. \n\nDisagree that it isn’t the safest strategy for most. Most people don’t want to spend time researching and keeping track of multiple stocks, so an etf is best.\n\nAlso, people get too caught up in their investment returns imo. Really, the primary focus should be on investing as much as possible over time so that your money is working for you. Instead of getting caught up in percentages and jerking yourself off because you got 3% this month while the spy got 2%.", "score": 6, "replies": []}, {"body": "Do you have a reason you think passive investing is a bubble or are you just referencing burry cause you think it makes you sound smart?\n\nAlso who said the returns were guaranteed or riskless? Do people actually say that?", "score": 6, "replies": []}, {"body": "Please come back in 30 years and show us your over performance", "score": 6, "replies": []}, {"body": "Index investing is great. You don’t have to do it, but it’s a safe & easy way to grow your $$$ over time.", "score": 6, "replies": []}, {"body": "Many Americans aren’t smart enough to make above what the 500 will return.", "score": 0, "replies": []}, {"body": "Its the same old echo chamber response that gets awarded 100 times over because it confirms their bias.", "score": 1, "replies": []}]}
{"title": "Which ETF to choose from these given choices?", "selftext": "Hello everyone\n\nI am from Switzerland and here we have the choice to pay 6800$ a year into a retirement account. That money does not get taxed and i save about 1800$ in taxes that way. This money can not be withdrawn until i am 60 or if i will buy a house or start a business.\n\n\nSome new startups nowadays allow to invest this money in ETF too. I went with VIAC because they allow up to 97% of the money to be invested in ETF while most other have a 75 % max. Viac has a preset called \"Global 100\" and they advise to use it. Its very switzerland heavy though and i feel like switzerland is ruining my possible gains. Can someone pls give me any advice on which of these to pick, to get the best possible performance? Some ETF are limited by a max. percentage i can choose.\n\n\n\nThis is Global 100 recommended by VIAC:\n[Factsheet](https://viac.ch/wp-content/uploads/VIAC-Global-100-DE.pdf)\n\n\nThis is what im currently using and i made 28 % profit since i invested 6800$ in april. I feel like a lot more couldve been gained since then.\n\n\nThese are all the options, percentages and product costs i can choose from. It only lets me use just a percentage of each. If i choose too much of one, it sometimes limits me using another. For example Crop S&P 500 is 35 % max. and nasdaq 100 is also 35 % max. If i use 35 % of Nasdaq 100 though, it only lets me use 25 % of S&P 500. \n\n\nI think it only limits me within categories. I can use 35 % Switzerland and still use 35 % Nasdaq 100 and 20 % emerging markets. \n\n\nI can always use about 40 % of CSIF World ex CH hedged - Pension Fund Factsheet, no matter how much % of the others i am using.\n\n\nI would really appreciate any advice.\n\n**Switzerland:**\n\nCSIF SMI Factsheet / Max. 20 % / Cost 0%\n[Fact sheet](https://amfunds.credit-suisse.com/ch/de/institutional/fund/detail/CH0033782431)\n\nUBS ETF SLI Factsheet / Max. 35 % / Cost 0 %\n[Factsheet](https://www.ubs.com/2/e/files/RET/FS_RET_CH0032912732_CH_DE.pdf)\n\n**Industrial Nations:**\n\nCSIF Europe ex CH / Max. 35 % / Cost 0.01 %\n[Factsheet](https://amfunds.credit-suisse.com/ch/de/institutional/fund/detail/CH0037606552)\n\niShares Core S&P500 / Max. 35 % / Cost 0.07 %\n[Factsheet](https://www.ishares.com/ch/qualifizierte-investoren/de/literature/fact-sheet/cspx-ishares-core-s-p-500-ucits-etf-fund-fact-sheet-de-ch.pdf)\n\nSIF Canada / Max. 35 % / Cost 0.01 %\n[Factsheet](https://amfunds.credit-suisse.com/ch/de/institutional/fund/detail/CH0030849613)\n\nCSIF Pacific ex Japan / Max. 35 % / Cost 0 %\n[Factsheet](https://amfunds.credit-suisse.com/ch/de/institutional/fund/detail/CH0030849654)\n\nCSIF Japan / Max. 35 % / Cost 0 %\n[Factsheet](https://amfunds.credit-suisse.com/ch/de/institutional/fund/detail/CH0030849647)\n\nCS Global Dividend Plus / Max. 35 % / Cost 0.12 %\n[Factsheet](https://amfunds.credit-suisse.com/ch/de/institutional/fund/detail/LU0439730705)\n\nCSIF US - Pension Fund / Max. 35 % / Cost 0%\n[Factsheet](https://amfunds.credit-suisse.com/ch/de/institutional/fund/detail/CH0030849712)\n\niShares Nasdaq 100 / Max. 35 % / Cost 0.33 %\n[Factsheet](https://www.ishares.com/ch/qualifizierte-investoren/de/literature/fact-sheet/csndx-ishares-nasdaq-100-ucits-etf-fund-fact-sheet-de-ch.pdf)\n\nCSIF World ex CH - Pension Fund / Max. 60 % / Cost 0 %\n[Factsheet](https://amfunds.credit-suisse.com/ch/de/institutional/fund/detail/CH0030849712)\n\nCSIF World ex CH hedged - Pension Fund / Max. 60 % / Cost 0 %\n[Factsheet](https://amfunds.credit-suisse.com/ch/de/institutional/fund/detail/CH0198191493)\n\nCSIF World ex CH Small Cap - Pension Fund / Max. 60 % / Cost 0.09 %\n[Factsheet](https://amfunds.credit-suisse.com/ch/de/institutional/fund/detail/CH0214967314)\n\nCSIF World ex CH Small Cap hedged - Pension Fund / Max. 35 % / Cost 0.09 %\n[Factsheet](https://amfunds.credit-suisse.com/ch/de/institutional/fund/detail/CH0214968353)\n\n**Emerging Markets:**\n\nCSIF Emerging Markets / Max. 20 % / Cost 0.09 %\n[Factsheet](https://amfunds.credit-suisse.com/ch/de/institutional/fund/detail/CH0017844686)", "id": "kbzndz", "created_utc": 1607816303.0, "score": 5, "upvote_ratio": 1.0, "num_comments": 11, "comments": [{"body": "You can visit r/Bogleheads for mutual fund portfolios based on John Bogle’s philosophy of investing.", "score": 3, "replies": [{"body": "The forum had a good post regarding tech companies and how they were down 80% from the 2000s. This made me change my picks since i dont know how i would feel beeing 80% down.\n\nI choose:\n\n10 % SMI\n15 % S&P 500\n20 % Nasdaq 100\n20 % Emerging Markets\n32 % MSCI World ex CH hedged\n\nI feel like this will be a fine and diverse pick from these limited choives VIAC gives me, while at the same time im still 50% invested in the US where most of the profit comes from these times. \n\nDo you have an opinion on this?", "score": 3, "replies": []}, {"body": "Never heard of him but ill read it.\n\nThanks", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "What?", "score": 1, "replies": []}]}]}]}, {"body": "Dude.  I'm not gonna carry that choice.  That's your deal.", "score": -5, "replies": [{"body": "I am seeking advice please. It is my choice but im not too knowledgeable. I have done my research but since it only offers me given choices i am a bit lost.\n\nI currently chose:\n\n5 % iShares Core S&P500\n35 % Ishares Nasdaq 100\n37 % CSIF World ex CH hedged - Pension Fund \n20 % CSIF Emerging Markets\n\nAny opinion?", "score": 1, "replies": []}]}, {"body": "CSIF World Ex CH performs best over the next 30 years. I’ll buy you a beer in 30 years if I’m wrong..", "score": 1, "replies": [{"body": "I would have to go with the World Ex CH hedged because it lets me take more % of that one. Hedged means that its in Swiss francs instead of US Dollar. Atleast thats what google says. Is there any downside for me using hedged?\n\nIll take the beer offer though.", "score": 1, "replies": []}]}]}
{"title": "Tesla valuation: fair value = $825,000 per share / $782 trillion market cap", "selftext": "[removed]", "id": "kbh1tf", "created_utc": 1607740741.0, "score": 0, "upvote_ratio": 0.23, "num_comments": 16, "comments": [{"body": "I’ll sell you my shares for $725,000.", "score": 19, "replies": [{"body": "I’ll sell mine for that too", "score": 6, "replies": []}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "I'mma second that request.", "score": 9, "replies": []}, {"body": "Looks like OP has in 2050 Tesla selling 90% of the ~200M cars per year.  At 50x PE ratio discounted back to 2020 Tesla shares should be worth 1000x today.  So they his assumes linear car growth. If robotaxis happen we are near peak cars and unlikely to double by 2050.  Also Tesla going from 1% market share to 90% seems a bit extreme. \n\nWith robo taxis Tesla will gain a large amount of market share. But that will limit the cars produced. I think they are inversely correlated.", "score": 3, "replies": [{"body": "> I think they are inversely correlated \n\n  \nI agree, with robo taxies the market changes to miles driven and that is where robotaxies will dominate and they will se a much higher utilization than privately owned cars. You might have more miles driven over time but it will be on less cars than versus now when most people own one.  \n\n\nThe average car is utilized something like 5% of the time so if you can then bring that to something like 50% that means a million robo taxies can do the same work as 10million cars. Obviously very simplified but with massive robotaxi networks we will need less cars.", "score": 1, "replies": []}]}, {"body": "OP is a troll.\n\nAnother post of theirs:\n\nhttps://www.reddit.com/r/investing/comments/kbmqf3/anyone_else_shorting_tsla/", "score": 2, "replies": []}]}, {"body": "Too conservative", "score": 7, "replies": []}, {"body": "Fire sale!!!! I'll sell all mine for $250,000 each, but you have to act within the next hour.", "score": 7, "replies": []}, {"body": "I have no idea what this is supposed to mean.", "score": 6, "replies": []}, {"body": "Why not 4.3 quadrillions?", "score": 2, "replies": []}, {"body": "Lol no one here seems to understand. Op is saying Tesla will be worth 38X the 2018 US GDP.", "score": 2, "replies": []}, {"body": "Why not go for 150% market share? OP, stop it with this nonsense.", "score": 0, "replies": []}, {"body": "I'll sell you at a discount at only 500k per share", "score": 1, "replies": []}, {"body": "S curve does not apply to Tesla. Only a J curve applies.", "score": 1, "replies": []}, {"body": "YEP", "score": 1, "replies": []}, {"body": "i mean... the competition will have caught up to Tesla in 20 years with their own BEV offerings so this model is assuming a pure monopoly on car sales", "score": 1, "replies": []}]}
{"title": "Covered calls delta", "selftext": "Covered calls at .1 delta keep getting blown recently..\n\nBidu and Dis are the latest to do so last week... \n\nLooking for resistance levels doesn’t work for many stocks like dis because they’re at all time highs. \n\nHow else are you choosing covered call strikes if you want to hold the stocks long term or if you are running PMCCs?", "id": "kbr57m", "created_utc": 1607787801.0, "score": 5, "upvote_ratio": 0.78, "num_comments": 17, "comments": [{"body": "I wanna hold the stock but not married to it. Get assigned then do CSP to get it back. It's mindboggling you get called often with 0.1 delta.", "score": 7, "replies": [{"body": "Exactly. It’s really frustrating, because the premiums are so low at .1 delta that when it overshoots the way dis, bidu and Tesla did last week, it makes me rethink doing covered calls altogether for a while", "score": 2, "replies": []}]}, {"body": "How far out is your expiry? I generally add a bit to the last resistance level which has often not worked over the last 6 months.  There have definitely been some pretty frustrating moments even though I started my rule of only selling a call on big up days for the company.  Big as in 5+%.\n\nCan always push up and out.", "score": 3, "replies": [{"body": "Generally one or two weeks. \n\nTesla was unbearable when I pushed up and out so I’m also unsure of doing that anymore. \n\nSelling on up days only is something I’ve considered, but some of these stocks are just turboing week after week", "score": 2, "replies": []}]}, {"body": "That's the risk you are taking in the market, right?  At .1 delta 10% of the time your CCs are gonna get called away, and you're gonna lose some upside.  CSP back in once it starts to correct, or move to another underlying.  At the end of the day, you made profit on the premium and on the stock, no need to  FOMO about the unrealized gains you could have gotten on either.", "score": 3, "replies": [{"body": "Yes this works better CSPs, but it’s more complicated when it’s a PMCC on leaps. \n\nIt’s becomes harder to close the long leg without giving up even more profit because of the bid/ask spreads on leaps. \n\nIt’s very surprising that the .1 deltas are being hit so often. \nIt’s extra frustrating because with a PMCC, if the long leg isn’t closed, there’s always the chance the stock comes back down and the long leg goes down in value too negating the profits made on the way up while having locked the losses on the short leg already. \n\nRolling up and out isn’t always helpful either since the stocks like dis, Bidu and Tsla have just been making monstrous gains and not letting up", "score": 2, "replies": [{"body": "Oh, gotcha...missed that it was PMCCs.", "score": 1, "replies": []}]}]}, {"body": "0.1 Delta? Not even worth it. Just hold stock. If you're not selling 20+ Delta, you're barely even hedging, so why give up the gains? Sell closer for more credit or just ride the stock. Personally I sell about 30 Delta", "score": 3, "replies": [{"body": "Really? What’s your days to expiry? I used to do 20 deltas, they kept getting blown. \n\nSo I moved down to the 10 delta, when I say .1 that’s a 10 delta. They’re still getting blown. \n\nWhat stocks are you doing 30 deltas on that are actually working?", "score": 2, "replies": [{"body": "30-45 DTE\n\nBut remember, when selling a covered call, you want to get blown out on your short. Your max profit is to the upside, no risks there\n\nKeep in mind that Delta can be used as an approximation of how much you're hedging your position. 10 Delta is about 10% hedged, and so on. The difference between 100% and 90% isn't very much, so I dont really understand the benefit of selling the call at all. Especially if you keep getting blown out", "score": 2, "replies": [{"body": "The idea was to get additional income. Its usually up to an additional 20% ROI on the price of the original LEAP call even at 10 delta. \n\nAnd it was working well till recently. Just confused to how 10 deltas are being so easily blown.", "score": 2, "replies": []}]}]}]}, {"body": "DIS was just unlucky for CCs since the stock mooned 13% or something. \n\nI thought .1 deltas would be super safe. Maybe you have to look more at Technical Analysis along with deltas.", "score": 4, "replies": [{"body": "Had nothing to do with ta. There was an investor event akin to an earnings call. Those are always risky weeks.", "score": 2, "replies": []}, {"body": "This. But bidu and Tesla overshot too.. too many of these one offs lately making me rethink the whole strategy", "score": 1, "replies": []}]}, {"body": "You might want to look at different underlyings. I know there are juicy premiums on offer for high volatility stocks, but the IV is high for a reason. Sometimes slow and steady is preferable.", "score": 1, "replies": [{"body": "Absolutely, I’d want to look into this. \n\nI think spy and maybe even qqq would be a safer bet, what else would you look at for lower volatility?", "score": 1, "replies": [{"body": "If you're interested in index ETFs then I would suggest looking at IWM (which tracks the Russell 2000). There's much more sector diversification than either SPY or QQQ.", "score": 1, "replies": []}]}]}]}
{"title": "Pfizer Vaccine approved for EUA , thoughts for PFE on Monday?", "selftext": "[removed]", "id": "kbh6lp", "created_utc": 1607741245.0, "score": 7, "upvote_ratio": 0.82, "num_comments": 11, "comments": [{"body": "It's going to be flat.", "score": 5, "replies": []}, {"body": "Good news? Puts", "score": 12, "replies": [{"body": "I know in my heart you’re right, but I’m hoping in my portfolio and my calls that you’re wrong", "score": 5, "replies": [{"body": "The pump from the vaccine already happened, 6 months ago.", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "How many places you think will be buying freezers...I feel like the vaccine will be delivered almost to order not stored long term at locations", "score": 1, "replies": []}]}, {"body": "Dunno about PFE, but hope this and some kind of positive stimulus package news come in for gains next week.", "score": 2, "replies": [{"body": "It all hinges on Mitch McConnell having a heart attack before Monday.", "score": 4, "replies": []}]}, {"body": "Pfizer is a bunch of faags", "score": 1, "replies": []}, {"body": "BIG GREEN DILDO ALL OVER THE MARKET MMMM", "score": 1, "replies": []}, {"body": "How hopeless is my 135c for 1/18? I'm suffering here for being a retard", "score": 1, "replies": []}, {"body": "1/22 $50c 🚀", "score": 1, "replies": []}]}
{"title": "Estimates on PFE next week?", "selftext": "", "id": "kbh7m8", "created_utc": 1607741360.0, "score": 7, "upvote_ratio": 1.0, "num_comments": 13, "comments": [{"body": "Knowing PFE probably dip under $40 bitch ass stock", "score": 14, "replies": []}, {"body": "Boomer stock going to dip.", "score": 6, "replies": []}, {"body": "Priced in", "score": 4, "replies": []}, {"body": "Open enormous green then tank 5%.", "score": 5, "replies": []}, {"body": "My Jan 50c confirm that PFE is a shit stock.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "This really could be the play - RSCF went up 40% today.", "score": 3, "replies": []}]}, {"body": "With emergency use approval in both the US and Mexico this evening, all of us would be well served by packing a lunch, strapping in, and preparing for take off Monday morning.", "score": 2, "replies": []}, {"body": "It will get up to $45 next week.", "score": 2, "replies": [{"body": "This will be the new average price, plus or minus a few dollars, for at least a year.", "score": 2, "replies": []}]}, {"body": "Invest in Epipens.   \n\nCause that shit is going to make your throat seeze up faster then /u/hungdismemebreds new cell partner tyrone.", "score": 2, "replies": []}, {"body": "Pfe is shit", "score": 2, "replies": []}, {"body": "Man Pfizer ain't done shit. I bought in a few weeks ago 😂", "score": 1, "replies": []}, {"body": "Priced in before they had logistics issues so probably red", "score": 1, "replies": []}]}
{"title": "Anatomy of an Option Contract in 60 Seconds ft. AMD", "selftext": "[deleted]", "id": "kbi2w6", "created_utc": 1607744700.0, "score": 51, "upvote_ratio": 0.96, "num_comments": 13, "comments": [{"body": "I will yolo anything this man says", "score": 8, "replies": []}, {"body": "You son of a bitch, I’m in", "score": 5, "replies": []}, {"body": "I’m in", "score": 4, "replies": []}, {"body": "Retirement progress meter ☠️", "score": 3, "replies": []}, {"body": "Nobody here loves you, you retard. So tell me, for how much should I sell my son? and how far should I pour it all in in AMD?", "score": 3, "replies": []}, {"body": "Got it, big numbers buy small numbers buy more.", "score": 2, "replies": []}, {"body": "These videos are pretty helpful actually, but Jesus man slow the hell down", "score": 2, "replies": []}, {"body": "I was expecting a pltr video, wtf man...", "score": 1, "replies": []}, {"body": "You legend. I almost understand you. Jk\nStill thanks for the break down", "score": 1, "replies": []}, {"body": "The red AMD guy looks sus", "score": 1, "replies": []}, {"body": "Enough explanations for WSBers", "score": 1, "replies": []}, {"body": "Oh this that good good", "score": 1, "replies": []}, {"body": "Add more crayon", "score": 1, "replies": []}]}
{"title": "Buying Calls on Low Cap Recovery Stocks", "selftext": "So Monday will likely open red, sorry to be the \"bearer\" of bad news.  A lack of proper finance/business education in the majority of retail buyers has caused skyrocketing purchases of these low cap Dow/s&p stocks call purchases in anticipation of eua.  My parents are under the impression that the vaccine was approved when 95% efficacy was announced so the top is in.\n\nGood news has already been priced in to stocks but bad news is not.  *Bad news tends to front page*\n\n**So why are we going red?**\n\n1. no more new money in market from institutional investors until next year\n2. covid deaths are skyrocketing\n3. not enough vaccines for all medical personal in the near term **(Dec)**\n4. stimulus at an eternal impasse **(likely not till jan-feb 25th)**\n5. *Lockdowns have to be priced in for annual earnings* most investors will look into Q2 reports for expectations going forward into Q4 earnings.\n6. Bankruptcy is a distinct possibility and return to normal for some of these stocks will be delayed further than people anticipated **(CCL)**\n7. Some changes are likely permanent people may not return to the same habits even in 2022.  Losses and debt incurred are permanent and remain on balance sheets. **(bankruptcy)**\n\n**what about tesla?**\n\ntesla will likely jump to 660 Monday and hover around 610 till dec21st", "id": "kbnrxk", "created_utc": 1607773140.0, "score": 4, "upvote_ratio": 0.6, "num_comments": 19, "comments": [{"body": "Green Monday confirmed", "score": 33, "replies": []}, {"body": "The market doesn't care about covid deaths", "score": 27, "replies": [{"body": "This. Literally nobody (corporations are people too)  gives a fuck as long as its not interrupting their supply chain and their workers aren't suing over management running a betting pool on how many will get infected.", "score": 14, "replies": []}, {"body": "Every retiree that dies is money saved", "score": 2, "replies": [{"body": "I'm gonna be rich", "score": 1, "replies": []}]}, {"body": "It does. Just in hindsight. 2020 has been fronting profits from years in the future but the actual state of the world can't be avoided forever. Deaths and unemployment equates liquidity problems and a drop in participants.\n\nThe bag is just light because retard strength is in play but even retards need sleep. It's even likely that some of this forum probably has actually died and we just don't know.", "score": 2, "replies": [{"body": "Us overall death rates are up just over 1% yoy just like they have been every year since 2014. That means that COVID deaths has had net zero impact on death rates. Why would anyone who looks at big picture economic impact of death rates on stock valuation care when literally nothing has changed statistically from COVID deaths? Take a look at unemployment figures as well. Nov 2020 unemployment rate is equal to 2014 unemployment. 2009-2013 unemployment is worse than it is this quarter. Yes COVID has been horrible and will have a lasting impact on many things at a micro level but the US is doing extremely well at the macro level.", "score": 5, "replies": [{"body": "Where are you getting these statistics. The UN doesn't even have COVID numbers out. No one knows how many people it's going to kill, obviously, before the year is out and so none of the statistics I know of that are viable have any COVID in them. \n\nI don't even see how that would be logically possible unless you're saying that all the people who would have died of something else simply died of COVID instead.", "score": 0, "replies": []}]}]}]}, {"body": "Fri was just paper hand shakeout + Taking profit off the table\n\nMonday is going to be wild as fk.", "score": 8, "replies": []}, {"body": "Great thanks for ruining Saturday", "score": 6, "replies": []}, {"body": "I do see EoY selloffs on shit companies to offset gains for tax purposes.", "score": 2, "replies": [{"body": "interesting can you explain to me how this would work?", "score": 1, "replies": [{"body": "If a company is down, and investors don’t expect it to ever recover significantly, they might sell shares at a loss to offset their gains from stocks they sold at a profit and minimize their tax liability. Meaning that, if this theory is correct, stonks that are in the gutter will slide down the storm drain, basically.", "score": 2, "replies": [{"body": "Basically, yes. \n\nGood stonks are going to move around too. Say you are retarded and thought AAL had hit bottom at the end of 2019 so you bought in. Say you also had a stint of autism and bought AAPL at the bottom this past spring. AAPL is trading pretty sideways right now so you may want to sell both, wait 30 days to avoid wash sale rule, and reenter AAPL. This would let you use the loss on AAL to raise your effective cost basis for future AAPL gains.", "score": 1, "replies": []}]}, {"body": "The tax man has archaic and backwards rules which cause illogical economic moves to be profitable", "score": 2, "replies": []}, {"body": "Your losses offset your gains for tax purposes. So if AAA netted you $10K in realized short term gains and stock BBB has you at $5K in unrealized losses you can sell stock BBB, realize those losses, and only pay taxes on $5K in gains on AAA.", "score": 1, "replies": []}, {"body": "For further info Google \"tax loss harvesting\". If your limit is $3,000 there's no point to selling more to offset gains etc. Know the rules.", "score": 1, "replies": []}]}]}, {"body": "So  **🌈🐻** , what pray tell are your positions? I expect some juicy loss porn later this week, too.", "score": 1, "replies": []}, {"body": "CRSR 🚀🚀", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "kbpj6t", "created_utc": 1607781600.0, "score": 9, "upvote_ratio": 0.74, "num_comments": 17, "comments": [{"body": "The gayest bear of them all is shorting tsla. I'm afraid. :(", "score": 4, "replies": [{"body": "There aren't a whole lot of tsla shorters. But there will be alot of profit taking. \n\nJust a week ago, we were at 380-420. Trend is still upward but  you want a more gradual raise than a rocketship.", "score": 2, "replies": [{"body": "i think and hope there were enough profit takers since wednesday. time to get one last pump out of tesla.", "score": 2, "replies": []}, {"body": "Last time tsla was at 380 was October 30 before the presidential election when the entire market had taken a big dive for a while and before the sp500 announcement. Don’t expect to see it at that price range again unless there’s a large market correction or a major unexpected negative change to the business.", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Ok sure. For every buyer there’s a seller. So I guess if there’s a massive amount of buying for the indexes which everyone knows there will be then technically you’re right. There will be a massive buying spree and selling dump occurring at the same time. All that matters here is the push pull on bid/ask. So indexes buy in hard prices go up. They’ve bought from the sellers willing to sell to take profit or from the market makers. After all that churns out you really think there’ll be a significant cohort of sellers rushing to sell at lower prices to get out ASAP for profit taking alone? There will have to be some other impetus for a large sell off than just profit taking.", "score": 1, "replies": []}]}]}, {"body": "Sir. Nov 14-19 is 3 weeks ago. \n\n3 =! 1.", "score": 1, "replies": []}]}]}, {"body": "Waiting to pick up shares of AIV on the cheap for that fat divvy", "score": 3, "replies": []}, {"body": "Actually the opposite usually happens. People go long the stock that left and short the one that was added.", "score": 1, "replies": [{"body": "Why is that?", "score": 1, "replies": [{"body": "look, i’m bullish on tsla long term. but every single stock that has ever been added to SPX has dropped right after inclusion date.", "score": 1, "replies": []}]}]}, {"body": "So TSLA stonks no go up?", "score": 1, "replies": [{"body": "TSLA only go up", "score": 3, "replies": []}]}, {"body": "If I would be speaking to serious traders then I would say that you should not trade in extreme situations, that the sentiment is way to bullish since weeks, that statistically speaking most stocks pull down after getting into the S&P and that you never know what musk is going to Twitter tomorrow..\n\nBut since this is WSB I just wish you a lot of fun and an adrenaline kick", "score": 1, "replies": [{"body": ">most stocks pull down after getting into the S&P\n\nIs that true?  According to this study it isn't:\n\n[https://corpgov.law.harvard.edu/2020/08/13/does-joining-the-sp-500-index-hurt-firms/](https://corpgov.law.harvard.edu/2020/08/13/does-joining-the-sp-500-index-hurt-firms/)\n\n\"While joining the index has a transitory positive effect but no long-term effect on stock prices\"", "score": 1, "replies": []}]}]}
