{"title": "CRM options", "selftext": "I’m in a spread Jan 08 232.5/235. I’m thinking it will hit with flying colors and my charts looks really promising so I just want to hear you opinions.", "id": "kklkdq", "created_utc": 1609001452.0, "score": 14, "upvote_ratio": 0.83, "num_comments": 18, "comments": [{"body": "232.5?!  I disagree bigtime. CRM is a fantastic stock and is primed beautifully for a move up. After it sold off and pulled back it’s been consolidating along support and recently started moving up. I’ll be surprised if CRM doesn’t hit ATH within 3-6 months", "score": 5, "replies": [{"body": "I know it has a pretty good support and a big gap to fill but you’ll think it will reach 235 by Jan?", "score": 3, "replies": [{"body": "by January 15? Sorry I thought the other guy was just talking in general. I think there’s a decent chance it will hit 235. At the very least the chart has every indication of upward movement. Is it too late to roll it to February?", "score": 2, "replies": []}]}]}, {"body": "Bullish or bearish spread?", "score": 2, "replies": [{"body": "Bullish? What you think of the play?", "score": 4, "replies": [{"body": "CRM has been trading between 220-230 since beginning of December. As per the current trend chances of CRM going above 232.5 are little slim unless there is a catalyst.", "score": 1, "replies": [{"body": "Earnings?", "score": 2, "replies": []}]}]}]}, {"body": "Solid company and most people are bullish, especially with the current technical setup, but this seems like an aggressive timeline. This maybe 50/50 chance of hitting just because the market does irrational stuff sometimes. You can probably roll it out a week or 3 for a tiny debit and increase your odds quite a bit with a similar return (I'm assuming, haven't checked the chain).", "score": 2, "replies": []}, {"body": "Why don't you go for a different CRM? I have a small technological startup that I run on my own. I knew I needed to be well organized from the very beginning. But I had a small budget. So I was looking for free tools. I tried a couple of things including CRMs. In the end, I came across eWay-CRM ( [Outlook CRM Software that will Help Boost your Sales | eWay-CRM (eway-crm.com)](https://www.eway-crm.com/outlook-crm/) and tried the free version. After several months I switched to the premium one. However free eWay has all the functions and no limitations except for a data volume. Also, premium eWay is affordable. The trial is free, user friendly and you can customize it. This CRM is integrated with PowerBI and is connected to Excel. You get sales funnels and everything you need in a single place.", "score": 2, "replies": [{"body": "Thx for a great recommendation, I work for eWay-CRM. Client's recommendation is the best promotion for us.", "score": 2, "replies": [{"body": "eWay-CRM is great. I'm thinking about switching to a premium version", "score": 1, "replies": [{"body": "eWay is a good one", "score": 2, "replies": []}]}]}, {"body": "eWay-CRM", "score": 1, "replies": []}]}, {"body": "I have gotten in trouble with CRM - due to wild swings. My directional assumption with CRM always seems to be wrong.  However I am looking to put on a feb 19 strangle.  The IV is high and looking to sell the 200 put and the 260 call.  Weekly directional near term expiration is to risky for me.", "score": 3, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "Like to keep a delta neutral position.  220 is to close to the current price - I find it harder to manage if the stock price blows through the option strike.  You can wing it out to create an iron condor and it uses less buying power.  I have a large account so buying power reduction is not much of an issue for me.  Most likely will be closed out in a couple of weeks.  Will manage for 50% of net credit and then take off.  If the stock price moves wildly I will roll the untested side of the strangle always trying to keep the position delta neutral.", "score": 2, "replies": []}]}]}, {"body": "I don't like the trade. .  [https://www.tradingview.com/x/ek49A01q/](https://www.tradingview.com/x/ek49A01q/)\n\nPrice gapped down below the 100day MA beginning of the month, has not closed that gap or even made successful attempts.  20MA has crossed both the 50 and the 100 and is steeply approaching the 150.  The 50 looks to be going to cross the 100 soon as well.\n\nLong term RSI down trend from the peak in September.\n\nPrice has not broken out off the downtrend off the most recent high in November.\n\nOn a weekly chart [https://www.tradingview.com/x/j5lTCNyh/](https://www.tradingview.com/x/j5lTCNyh/) The MACD is falling fast with a bearish histogram. Still fairly extended above the zero line.\n\nIf I had to make guess here I would say the price wants to retest the very long term support line made from the top of the price channel going back a few yearsc(217-219). That is the spot to go long.", "score": 1, "replies": []}]}
{"title": "Expecting a stock to be volatile but am extremely bullish, do you buy 1 or 2 year leaps? Or both?", "selftext": "So I speculate that a stock is going to double or triple in the next 6 months to 2 years, but am expecting tremendous ups and downs before it gets to my target. Setting aside a small portion of my portfolio, what's the most profitable strategy to leverage momentum and gains? I'm fairly new to options, so looking for some input.\n\nI thought of potential strategies:\n\n1. Buy and sell small OTM calls closer to current dates, sell from IV momentum, use gains to bet large OTM 1 year leaps\n2. Buy and sell large OTM 1 year leaps, sell from IV momentum, use gains to bet larger OTM 2 year leaps\n3. Buy larger OTM 2 year leaps now, hold through huge ups and downs until no major catalysts in sight\n\nI'm guessing 1 is most high risk and reward, and 3 is least right? From my research, the general idea is that you can get the most gains if a stock shoots to the moon while your expiry is relatively short-term, so if you're predicting a huge breakout this year you should buy a 1 year leap. But with a decade winner stock, it'll go through several moons, in which case, it would be more profitable to buy and hold 2 year leaps for the most potential upside.\n\nThoughts? Since I don't have a crystal ball, would it make more sense to execute both strategies instead of choosing one over the other?", "id": "kksi08", "created_utc": 1609025580.0, "score": 6, "upvote_ratio": 0.72, "num_comments": 12, "comments": [{"body": "What I do with that sort of stock is buy shares OR ITM LEAPS, and then sell covered calls.  Every time the stock dips, I close those covered calls and wait for another uptrend and sell covered calls again.", "score": 10, "replies": [{"body": "How is this different from swing trading really?", "score": 3, "replies": [{"body": "The active part is the same, but I hold onto the underlying stock to not miss the absolute gains.  This lets me juice the gains by earning some short-term income along the way.  For instance, I believe in AMZN long term, but it has been trading sideways for months now.  So instead of being disappointed in AMZN being flat, I make money every couple of weeks as it peaks and then drops.", "score": 4, "replies": [{"body": "How is it different when the underlying shoots past your CC’s strike on expiry? Do you actively buy back the sold CC for a loss or you let your shares go? That’s what has bothered me, and I’ve been swing trading instead of selling CCs.", "score": 2, "replies": [{"body": "For stock I want to hold like this example, I’m selling wayyyy OTM, enough so that if my shares get assigned, I’m happy.\n\nAnd for the AMZN example, I sell $4000 calls.", "score": 3, "replies": [{"body": "That makes sense. I’m flying too close to the stock price.", "score": 2, "replies": []}]}]}]}]}, {"body": "This!", "score": 1, "replies": []}]}, {"body": "How high is the IV? If it’s way out there 90+, then OTM might still be a significant amount unless you think the expiration B/E is doable. \n\nHow is IV Skew? For your duration, are calls OTM higher IV than ATM? You can maybe wait for this to flip to take advantage of it, if it’s truly significant and you wanna go OTM. \n\nCan you afford an 0 extrinsic ITM call? And then create a diagonal by selling weekly to monthly calls against it at a target price level? This effectively could even reduce your cost basis to basically nothing by the time your profit time horizon rolls around.", "score": 3, "replies": []}, {"body": "It's still long calendars. 3.", "score": 2, "replies": []}, {"body": "You could consider the Poor Man Covered Call strategy consisting to buy a LEAP (for 2 or 3 years) being far ITM (delta > 0.7). This \"simulate\" a position in the shares. In all the time to expiration, you sell covered calls OTM (around 0.3 delta).\n\nThe premium collected from these covered calls will helps to compensate the decrease of the extrinsic value of the LEAP as time passes and due to the fact that, given your assumption, of a massive increase of the stock price.\n\nIn case of a covered call gets ITM, you can roll it for a credit or just take the loss.", "score": 1, "replies": []}, {"body": "One of the things I hate most is being right and not making money from it. For this reason, if I were in your shoes, I’d really want a position or strategy that makes money when the stock goes up. \n\nAnd getting called away on your position because you were more right than you though, sooner than you expected, sucks BIG time. \n\nYes, you could roll it and manage it but even that sucks because your gains are now suboptimal and you’re cursing yourself for playing your hands the way you did. \n\nGiven the stock is volatile, I’d probably look to sell premium any time I wanted to buy it so I don’t get fleeced on time value.  For example, in this scenario, I might write a long term, ATM put spread and use it to finance a long term, OTM call.  I’d likely also play with the duration on the long put in the put spreads (making it a diagonal) to try to maximize the time value I extract from the puts. Just be aware that leaving it naked could really eat into buying power.", "score": 1, "replies": []}, {"body": "2 year leap. Wait at least one year to collect the long term capital gains tax rate. Lower risk with the 2 year window and much lower tax rate.", "score": 1, "replies": []}]}
{"title": "New trader but take a look at my current and future picks!", "selftext": "Hi guys I’m new to these boards but have been following up for a while.  Im looking to start day trading I have 27k in my account but I don’t know where to start.  Not sure if anyone could help with that.  I’ve never day traded before but always wanted to learn.\n\nWhile I know the stock market has had one of its best years this year, with 2021 coming I wanted to drop a few picks I had in mind and wanted to see what you guys think.\n\nmy portfolio looks like this: (please remember I only started trading 6 months ago) \n\nPlease remember I am in for long term \n\n20k APPL (bought in September at $130) \n\n2k CRWD (bought in December at $175)\n\n2k Tesla (bought in august at split/$410)\n\n&#x200B;\n\n&#x200B;\n\nOk so here’s what I wanted to ask, I am looking for some new stocks I can buy around New Years.  I’ve been looking at Reddit boards and saw these stocks \n\nPLTR @ $27, is this stock still a buy at 27 if I plan to hold 1 year+? (thinking of buying $500 in shares)\n\nPLTR could be $50 6 months from now? Agree or disagree?\n\nSnap @ $50 looking at snap since I want to get into social media 1yr+ (considering buying $500 i shares) could be double at $100 a share in a year?\n\nICLN @ 27 , (energy etf)  thinking of buying because of Biden helping with energy and I like it with how many energy companies are there.\n\nI also hold some mutual funds and ETF and believe it or not ive made most my money there.  \n\n\nany advice on what I could or should do, appreciate it.\n\nplease reply \n\nthanks,", "id": "kknc1g", "created_utc": 1609007706.0, "score": 6, "upvote_ratio": 0.88, "num_comments": 20, "comments": [{"body": "Yo I am in hydrogen stocks. Ballard maybe", "score": 2, "replies": []}, {"body": "Buy EXROF and ABML. You can thank me later.", "score": 2, "replies": [{"body": "Both pump and dump stocks. I’ll pass.", "score": 1, "replies": [{"body": "Sweet, a new investor telling me what constitutes a “pump and dump”!! I know you didn’t do any research before you posted, or you wouldn’t be talking out of your ass.", "score": 2, "replies": [{"body": "They are both at their highs, so why would I buy either of those rn?", "score": 1, "replies": [{"body": "If you think they have no upside, you still haven’t done any research. Both are game changers with disruptive technology for green energy and EV’s. This last week a respected analysts said he expects EXRO to double early 2021. AMBL is a game change for lithium and recycling batteries and is backed by BASF. But, tell you what, I am done with you, you ask for advice and then talk shit about the advice given, without doing any research for yourself.", "score": 2, "replies": [{"body": " I did research them and they’re both listed as penny stocks.  Both seem to be very high-risk investments.  thanks anyway.", "score": 1, "replies": [{"body": "Pennys add up! I have 20k shares of ALPP @.64. I bought them on 11/27. Today’s close they are worth $93.200. Dollar to a donut I expect them to be worth $120,000 by end of February. Don’t be afraid of pennies, do some good DD and they can off really well.", "score": 1, "replies": []}]}, {"body": "i know right? good for you!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "If anyone wants to comment or be salty feel free just no baby boomer advice thanks!", "score": 1, "replies": [{"body": ">ICLN \n\nIs that no advice from or to Boomers?", "score": 1, "replies": []}]}, {"body": "Hey, if you are looking for a stock trading group that supplies training, mentor ship and a buy/sell algorithm, message me", "score": 1, "replies": [{"body": "Yeah you message too me if your gonna sell me some fake-ass algorithm that won’t make me sht lmao 😂", "score": 3, "replies": [{"body": "If that’s what you think but u are just assuming things which isn’t a good trait for a man", "score": 1, "replies": []}]}, {"body": "Im alooking for one, you msg me though. youre going to try and take money anyway, so get your customer.", "score": 2, "replies": [{"body": "Just did and I’m not taking anyone’s money lol", "score": 1, "replies": [{"body": "yeah this is sketch . goodbye", "score": 1, "replies": []}]}]}]}, {"body": "Nio!!!", "score": 1, "replies": []}, {"body": "I think PLTR is a good look. I got it at $10 but believe it has a lot of potential as a long term buy. Look at some of the tech etf like QQQ and XLK to get exposure to tech/growth positions that might have pricy pps. I really like AMD I think they will prove to outshine intel in the microchip game, they are way ahead.", "score": 1, "replies": []}, {"body": "Join Robinhood with my link and we'll both get a gift stock for the holidays! https://join.robinhood.com/rayfieh-a54662", "score": 1, "replies": []}]}
{"title": "Anyone Buying HOME?", "selftext": "At Home Group (HOME) is shaping up to be one of my recovery plays, strong past growth and P/S that’s been beat down through COVID and still trading less than half of the ATH. RSI sitting around 47 and MACD at -0.32 makes me think this is going to be a strong buy in Jan / Feb (or sooner) with a consistent uptrend through much of 2021. Thoughts?", "id": "kk967q", "created_utc": 1608942948.0, "score": 7, "upvote_ratio": 0.82, "num_comments": 11, "comments": [{"body": "Looks more like a sell candidate. Downward trend, trading down 6 of the last 10 days. Stock is down 26% in last 30 days. Can't seem to break resistance. Looks like better investments elsewhere.", "score": 1, "replies": []}, {"body": "Bought back in October at 17.15. Waiting for a profit to turn", "score": 1, "replies": [{"body": "You’re braver than I, but I’m highly confident you’ll make some healthy profit on this. There was much fuckery this year with dips, huge spikes and then sell offs but I’m thinking those who invest in early 2021 are going in it for the recovery play and not a pump and dump. I’m thinking PT $30 EOQ 2 ‘21 or sooner", "score": 1, "replies": []}]}, {"body": "Could be a nice solid gain with patience. It's pretty impossible to get interest in the market during covid but post covid this should gain lots of traction. Hedge funds are eating this up like nobody's business already.", "score": 1, "replies": []}, {"body": "Have few calls expiring Feb-19", "score": 1, "replies": [{"body": "Strike price?", "score": 1, "replies": [{"body": "$18 HOME @ 1.50", "score": 1, "replies": [{"body": "Very good, you’ll be ITM im quite sure I might buy some calls as well", "score": 1, "replies": []}, {"body": "You should love it at $18 @ 1.35? So will you add to your position?", "score": 1, "replies": [{"body": "I am planning to add more calls strike $18 to bring Down my $1.50 avg.", "score": 1, "replies": [{"body": "Where do you think the stock is heading?", "score": 1, "replies": []}]}]}]}]}]}]}
{"title": "THCB and Microvast!", "selftext": "I wanna know everything about THCB and Microvast, I read about Toyota's Solid State Batteries that could charge in ten min and had better range than Tesla batteries and I'm interested. Obviously my first choice would be quantum scape but I missed out. Here are my questions. I've also never invested in a \"merger\"(can't say the word mods will get mad) before.\n\n1. Is the merger for sure happening?\n2. When is the merger happening?\n3. Do they have potential to get as big as quantum scape?\n4. What are your thoughts on Microvast and", "id": "kkk0b6", "created_utc": 1608995562.0, "score": 13, "upvote_ratio": 0.72, "num_comments": 18, "comments": [{"body": "Thcb 📈", "score": 24, "replies": [{"body": "Very informative thank you very much!", "score": 10, "replies": [{"body": "I have a 100% ev related portfolio so I'm basically here to tell you to strap in before the rocket leaves earth 🚀", "score": 7, "replies": [{"body": "I agree EVs are definitely the future for cars but is this company gonna be part of that future is what I'm trying to figure out!", "score": 4, "replies": [{"body": "Same here. But the longer you wait, less money you make.", "score": 3, "replies": []}]}]}]}]}, {"body": "I would agree with everyone here as im heavily strapped in THCB as well but I would like to give you a fair warning that it is NOT a guaranteed done deal. Although THCB has alot of potential, its price right now is unprecedented, so there's much more risk getting in at this price point if the merger doesn't go thru. \n\nWith that being said, THCB TO THE MOON 🚀🚀🚀", "score": 9, "replies": [{"body": "Ok thank you like I said I'm new to spac don't really know what I'm doing would you say it's still a buy?", "score": 1, "replies": [{"body": "IMO, probably not. If merger goes thru it will pop and merger will probably go thru. However like I said its not a done deal yet, and the risk is alot. If you're willing to risk the biscuit then go ahead, but just know there's gonna be plenty more opportunities and it's okay to let it go.", "score": 3, "replies": []}, {"body": "it depends on your risk profile, if merger agreement is met, it will go up, if not, you will get $10/share price instead of whatever buy price you were in. Are you new to spacs only, or are you new to trading as well?", "score": 0, "replies": []}]}]}, {"body": "I would be glad to help answer some questions.\n\n1.\t⁠I spoke to the magic conch this morning and told me yes, the merger is 100% happening. Apparently the nice Chinese guy at microvast and fat American at thcb pinky promised they would.\n2.\t⁠Yesterday, China man and fat American got in bed yesterday and the big gay seccx. American man got pregnant with a Chinese butt baby and now we’re just waiting for it to leave the womb.\n3.\t⁠They do.. but only once we find out Obama’s last name.\n4.\t⁠My thoughts is it’s a company that makes batteries and im retarded.\n\nThank you for reading my DD", "score": 7, "replies": []}, {"body": "1. We don’t know if the merger is happening until the DA drops\n\n2. From what I remember the deadline for the merger was April so DA is expected by end of this month to end of next month cuz they should be doing it 2-3 months ahead of the deadline\n\n3. Microvast already has existing products whilst Qs is still in r&d so imo is should soar higher or equal to Qs \n\n4. 🚀🚀🚀🚀🚀", "score": 4, "replies": []}, {"body": "I would repost this in r/SPACs as well", "score": 1, "replies": [{"body": "Thanks I will!", "score": 1, "replies": []}]}, {"body": "I cant answer any of those questions but I can tell you that evs are the future. The demand keeps rising every year and many new ev companies are in the process of being listed. Invest in companies that provide software, batteries, and materials for producing electric vehicles and you cant lose in the next 2-5 years.", "score": 1, "replies": []}, {"body": "When I read about them, they seemed pretty shady and decided not to invest but now because of the success of QS, everyone is bullish on it ...", "score": 1, "replies": [{"body": "Can I ask what seemed shady about it I'm trying to avoid getting scammed?", "score": 1, "replies": []}]}, {"body": "THCB RMG ftw", "score": 1, "replies": []}]}
{"title": "Is research really necesary to win money?", "selftext": "First of all, i do my research, and you will make much more doing it than not, but i find it fun that every stock i bought (or thought about ) when i started under the following reasoning \"Hey apple sounds like a nice company im sure it will go up in next years\" did raise, and most of them are still good investments after researching them. \n\nMy point is i think anyone can make money by just diversifying and holding, im not saying they can beat the market, but certainly wont lose, i feel most people lose out of leverage or psychological pressure selling in red.\n\nAnd yet i find almost everyone \"afraid of losing everything\" in the stock market so they dont even give a try to it. I always try to tell them that as long as you are unleveraged and dont need the money soon it shouldnt be trouble. For example i got a friend that lost some just because he pulled it off a week after to go partying . So i assume people don´t invest cause they feel the future is too far away, like im 19 and it seems im the only one thinking about my 30s.", "id": "kkl7a3", "created_utc": 1609000142.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 14, "comments": [{"body": "Buying and holding is a proven strategy trying to time the market is pretty hard, that said I think we're in a crazy bull run rn and StOnKs OnLy Go uP so when this ends picking the right stocks to buy and hold might be a bit harder.", "score": 14, "replies": []}, {"body": "[deleted]", "score": 12, "replies": [{"body": "Why", "score": -4, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "Don't know about this, I started doing much better when I started treating the market like a big roulette wheel. Research stocks that have the highest probability of moving up and buy a calculated amount to minimize losses if your wrong.", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I'd hope so, that run from the bottom was insane, lol, definitely rode that wave. Your right, next year won't be the same but you adjust your estimates of the odds to fit the market. Bull, bear, flat... there are always opportunities, sometimes there harder to find and you change your approach to fit what's happening.", "score": 1, "replies": []}]}]}, {"body": "Oh sorry in spanish winning = earning job related xd", "score": 1, "replies": []}]}]}]}, {"body": "Almost Everyone wins in a bull market\nLong term research is needed because companies compete and their earnings and balance sheets constantly change\nRemember behind every stock is a company \nWhile short term the stock market is voting machine\nLong term it’s a weighing machine \nHope this helped", "score": 3, "replies": []}, {"body": "Rising tide lifts all. Easy being a ticker picker in a bull market. If you’re not beating the market with your picks then you’re better off buying an index fund and using your time on other stuff that matter in life. At 19 — > sex, drugs & alcohol \n\nOh...and not beating the market = losing", "score": 3, "replies": []}, {"body": "Many come to this site asking what to buy. They do not waste a minute place the order and go on doing what they were doing before. \n\nIt really boils down to how sophisticated one is analyze all the data, charting, ranking. No way to get around due diligence and understand there is ethics, tolerance psychology and discipline involved.", "score": 2, "replies": []}, {"body": "No research is necessary in a bull market", "score": 4, "replies": [{"body": "A lot of amateur investors on Reddit are gonna learn this the hard way", "score": 2, "replies": [{"body": "Not when the fed keeps pumping the market", "score": 1, "replies": [{"body": "From the guy who just said that AMC will be a good investment long term...yeah I think you’ve got a lot to learn", "score": 0, "replies": [{"body": "If they doesnt go bankrupt it’s a great investment", "score": 1, "replies": []}]}]}]}]}]}
{"title": "Musk Says It’s ‘Impossible’ to Take Tesla Private, Mulls New IPO - Bloomberg", "selftext": "", "id": "kknjvz", "created_utc": 1609008477.0, "score": 14, "upvote_ratio": 0.71, "num_comments": 12, "comments": [{"body": "Content is paywalled for me, but from what I can see before the wall goes up this looks like a Starlink IPO which is nothing to do with Tesla.", "score": 9, "replies": [{"body": "[Here you go.](https://archive.is/0MmCK)", "score": 5, "replies": [{"body": "Thanks, confirms this is about Starlink, not Tesla.", "score": 6, "replies": [{"body": "FYI I don't subscribe to bloomberg either, I just rely on archives. [Archive.is](https://archive.is/) is fantastic for this sort of stuff, just enter the URL of the paywalled article and 90% of the time you get access to it.", "score": 3, "replies": []}]}, {"body": "MVP in the comments", "score": 1, "replies": []}]}, {"body": "Paywalling is really annoying.", "score": 6, "replies": [{"body": "[Here you go.](https://archive.is/0MmCK)", "score": 4, "replies": [{"body": "Thanks. Hope everything time there is someone like you can send this. They are too greedy or I am too cheap to pay their half axx work article. If we listened yo boomberg probably missed all the up of tsla.", "score": 2, "replies": [{"body": "FYI I don't subscribe to bloomberg either, I just rely on archives. [Archive.is](https://Archive.is) is fantastic for this sort of stuff, just enter the URL of the paywalled article and 90% of the time you get access to it.", "score": 6, "replies": []}]}]}]}]}, {"body": "That article is surprisingly(refreshingly) short.  Most tweets from Elon generate at least 100 20 minute YouTube videos.", "score": 5, "replies": []}, {"body": "> Billionaire Elon Musk said it’s “impossible” to take Tesla Inc. private now even though he would have liked to spend more time on innovation.\n> \n> “Tesla public company duties are a much bigger factor, but going private is impossible now (sigh),” Musk said in response to a tweet saying he should optimize his time in areas such as innovation. “Engineering, design & general company operations absorb vast majority of my mind & are the fundamental limitation on doing more.”\n> \n&nbsp;\n\n> Engineering, design & general company operations absorb vast majority of my mind & are the fundamental limitation on doing more.\n> \n> Capital allocation is important, but low CPU load. Tesla public company duties are a much bigger factor, but going private is impossible now (sigh).\n> \n> — Elon Musk (@elonmusk)\n> December 25, 2020\n> \n> &nbsp;\n\n\n> Tesla shares, which were included in the S&P 500 index this week, have surged eightfold this year ahead of the addition to the benchmark measure. The gain is twice the advance of the next best performer on the gauge. The share price jump also created millionaires among its investors, and propelled Musk’s net worth by $132.2 billion to $159.7 billion, making him the world’s second-richest person, according to the Bloomberg Billionaires Index.\n\n> \n> Musk also said Starlink, SpaceX’s budding space-internet business, would likely be a candidate in his group to go public once its revenue growth becomes “reasonably predictable,” echoing similar comments by the company’s president to investors earlier this year.\n> \n&nbsp;\n\n> It will most likely make sense for Starlink to go public once the revenue growth is reasonably predictable\n> \n> — Elon Musk (@elonmusk)\n> December 25, 2020\n> \n> \n&nbsp;\n\n\n> Space Exploration Technologies Corp. has already launched more than 240 satellites to build out Starlink, President Gwynne Shotwell said at a private investor event in February.\n> \n> A listing would give investors a chance to buy into one of the most promising operations within the closely held company. “Right now, we are a private company, but Starlink is the right kind of business that we can go ahead and take public,” she said then.\n> \n> Investors have to this point had limited ways to own a piece of SpaceX, which has become one of the most richly valued venture-backed companies in the U.S. by dominating the commercial rocket industry.\n> \n> In addition to a contract from NASA for a version of its next-generation Starship spacecraft that can land astronauts on the moon in 2024, SpaceX also has an agreement with a Japanese entrepreneur for a private flight around the moon in 2023. And it will be ready to launch its first Starship flight to Mars in 2026, Musk said earlier this month.\n> \n> — With assistance by Dana Hull", "score": 4, "replies": []}, {"body": "Bloomberg put pay-wall around an article that forms it's basis from two tweets from Elon Musk.\n\nI feel sorry for anybody paying for such lazy content", "score": 3, "replies": []}]}
{"title": "Who has Boeing poots?", "selftext": "[deleted]", "id": "kka5wz", "created_utc": 1608946985.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 10, "comments": [{"body": "I got calls in Jets", "score": 3, "replies": [{"body": "Same, 6/18/20 $JETS $26c", "score": 3, "replies": []}]}, {"body": "Short short short", "score": 2, "replies": []}, {"body": "Stonks only go up, duh", "score": 2, "replies": []}, {"body": "My ba call will never print 😭", "score": 2, "replies": []}, {"body": "What if I had calls on Baba", "score": 1, "replies": []}, {"body": "1/29/20 $220c im at -20% f*ck boing", "score": 1, "replies": []}, {"body": "If there is a dip, I'm buying.", "score": 1, "replies": []}, {"body": "Haha my Calls are already worthless so might as well go down a lil more lmao.", "score": 1, "replies": []}]}
{"title": "On the road to recovery 😤", "selftext": "[removed]", "id": "kkalpx", "created_utc": 1608948819.0, "score": 15, "upvote_ratio": 0.7, "num_comments": 19, "comments": [{"body": "I'm gonna need a list of your positions right now so I can inverse it", "score": 4, "replies": [{"body": "You should inverse being alive", "score": -15, "replies": [{"body": "Lol nice one", "score": 5, "replies": []}]}]}, {"body": "This makes me feel a little better about myself", "score": 3, "replies": [{"body": "Itll be alright man", "score": 0, "replies": [{"body": "Keep it up 🙌💎", "score": 2, "replies": []}]}]}, {"body": "Looks very bearish to me. Puts on you.", "score": 3, "replies": [{"body": "You know what happens when you chase....", "score": 2, "replies": []}]}, {"body": "This is where you are. You can do it brother. Just stay away from pltr\nhttp://imgur.com/gallery/iqg9Suw", "score": 2, "replies": []}, {"body": "Downtrend reversal", "score": 3, "replies": []}, {"body": "New year, new you!", "score": 2, "replies": []}, {"body": "Yours looks eerily similar to mine \n\nhttps://imgur.com/a/xMbYP2I", "score": 1, "replies": []}, {"body": "I’m sure you thought the same thing in that section between the 3M and 1Y marker where it spiked up, too.", "score": 1, "replies": [{"body": "Thats the exact moment I decided to get into pltr\n\nNo more fomo stocks", "score": 1, "replies": []}]}, {"body": "Falling bullish wedge right here. Should be even after at least one yolo.", "score": 1, "replies": []}, {"body": "Well atleast your can write off most of your losses", "score": 1, "replies": [{"body": "Facts just gotta fill out that 8949 and schedule D", "score": 2, "replies": []}]}, {"body": "Square calls, done.", "score": 1, "replies": []}]}
{"title": "Yo 🌈🐻that predicted stock market will crash soon. I think cryptocurrency market will crash first if any. Don’t get me wrong, I invested in cryptocurrency too.", "selftext": "", "id": "kkce0s", "created_utc": 1608956380.0, "score": 0, "upvote_ratio": 0.3, "num_comments": 15, "comments": [{"body": "Noob", "score": 4, "replies": []}, {"body": "Where’s the money going to crash to with interest rates at dogshit?", "score": 2, "replies": []}, {"body": "Ban", "score": 3, "replies": []}, {"body": "If you retards and autists think stock market is overvalued now, cryptocurrency is over Pluto", "score": 0, "replies": [{"body": "Lol you are retarded, it has risen over its ATH after an economic downturn. It lived through exactly what should have killed it. On top of that MMs are jumping in at these fucking prices, this is the floor.", "score": 1, "replies": []}]}, {"body": "Yo you pussies read the title, I invested in cryptocurrency. 30% of my portfolio is in cryptocurrency dickhead", "score": -9, "replies": [{"body": "You have a 30% stake in something you think is overvalued. You are a true moron eh?\n\n\nDid OP return your PMs yet?", "score": 5, "replies": []}, {"body": "ok", "score": 2, "replies": []}]}]}
{"title": "Papa Elon: Combine SpaceX, Tesla, Neuralink, etc., into one mega-corp called \"X\" = 🚀🚀🚀", "selftext": "", "id": "kkcfsj", "created_utc": 1608956603.0, "score": 9, "upvote_ratio": 0.7, "num_comments": 15, "comments": [{"body": "[deleted]", "score": 21, "replies": [{"body": "Sure. MT while you’re at it", "score": 10, "replies": []}, {"body": "calls on CLF?", "score": 4, "replies": []}]}, {"body": "This is it boys.  Elon's original 1999 master plan taking us all to Valhalla\n\nAll aboard", "score": 11, "replies": [{"body": "Let's ggooooooo 🚀🚀🚀🚀🚀", "score": 3, "replies": []}, {"body": "It's like he planned this all out with X. He may be the original author of the \"same universe\" concept.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "Hey some of us are stupid", "score": 7, "replies": []}]}, {"body": "$musk", "score": 4, "replies": [{"body": "Would be the best ticker", "score": 7, "replies": [{"body": "All in 🚀🚀🚀", "score": 1, "replies": []}]}]}, {"body": "Ban for Business Insider link.", "score": 2, "replies": []}, {"body": "Combined company will be a MBA hatchery. Good for stocks but bad for Elon’s goal - From what he says.", "score": 1, "replies": []}, {"body": "Old news.", "score": 1, "replies": []}, {"body": "Clickbait title, nice", "score": 1, "replies": []}, {"body": "Calls on elons ego", "score": 1, "replies": []}, {"body": "Isn't this all based on the fact elon replied \"good idea\" on fucking twitter to some random who proposed doing this? seems like clickbait.", "score": 1, "replies": []}]}
{"title": "BA ⛳️", "selftext": "[removed]", "id": "kkefch", "created_utc": 1608965964.0, "score": 5, "upvote_ratio": 0.73, "num_comments": 10, "comments": [{"body": "This doesn't really matter, aircraft divert all the time for various reasons. I'd be more worried if someone told me MCAS failed again and another air craft took a nose dive.", "score": 3, "replies": []}, {"body": "Seems like a nothing story but they are under a microscope.", "score": 6, "replies": [{"body": "It would be a nothing story IF they weren't under a microscope", "score": 5, "replies": []}]}, {"body": "They really just aren’t catching a break lmao", "score": 2, "replies": []}, {"body": "according to the folks over at /r/aviation engines tend to have some niggles when coming out of long term maintenance. this is a nothing story but I wouldn't rush to buy back into ba. the global aviation industry is in the doldrums and will be for at least h1 21", "score": 2, "replies": []}, {"body": "The FAA put out a AD for the Max's engines around six months.\n\nThe AD is serious and flagged as potentially shutting both engines down during take off/climb out.\n\nAircraft are most reliable when they are flown regularly.  My prediction is that, over the next two or three years, there will be at least one max 8 that goes down taking everyone on board to their end.  That one inevitable outcome will doom the max 8.", "score": 2, "replies": []}, {"body": "Boeing doesn’t make engines Rolls Royce does.", "score": 1, "replies": [{"body": "GE makes the engines for Boeing 737 max and most Boeing planes. Airbus’ engines are mainly sourced from Rolls Royce.", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": []}]}]}, {"body": "This is a nothing story. Some people will panic sell on monday, we might see a 1-2% dip. get on it while you can.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "kkgkjk", "created_utc": 1608978789.0, "score": 10, "upvote_ratio": 0.78, "num_comments": 20, "comments": [{"body": "AMZN will soon buy MARS and Jeff will chill with papa Elon in electric powered e-commerce friendly space suits", "score": 9, "replies": [{"body": "LOL", "score": 1, "replies": []}]}, {"body": "AMZN is a no brainer.  It has been trading sideways through the whole holiday season, even with record levels of online shopping and with all the new online shoppers brought on because of lockdowns, it’s certain that AMZN will have record shattering earnings reports that are not yet baked into the share price.  I would buy now, don’t let the analysts steer the herds into AMZN before you.  By the time they report 4th quarter earnings the share price will have most of the gains factored into the price.", "score": 8, "replies": [{"body": "I agree, I have family that works there and I work for the company that does their last mile delivery. They have been doing it right for the most part. As for the split, Bezos has some weird vendetta against it. Maybe a sour taste from the last splits in the late 90's. Most of the new brokerages allow fractional shares so there is no extra pressure to push the issue.", "score": 3, "replies": []}, {"body": "I work for amazon, it’s been dead for past 3 weeks. Don’t know why just sharing what I’ve seen.", "score": 2, "replies": [{"body": "what's been dead", "score": 1, "replies": []}]}]}, {"body": "They’ve been rumoring about splitting for years. I wouldn’t count on it. Probably still worth a buy in if you have that kind of money to throw on it, it’s not like they are going anywhere.", "score": 5, "replies": []}, {"body": "Bezos says the n word and AMZN collapses to 0", "score": 4, "replies": []}, {"body": "Just wait for the stock split and ride the monster to tendie town", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Options for amazon are insanely expensive given 100 shares are 320k worth of equity. So unless you can time the split, or general increase, better off with stocks.", "score": 2, "replies": [{"body": "Ya fuck Amazon. That's how I lost everything he ain't lying. I'm riding SHOP now. Join me", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Yep, you would own .5! You don’t belong here", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yes but remember you own .5 of a stock that’s 600$ (so 300$) vs owning .1 of a stock that’s 3000$ (also 300$). It’s the same thing", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "The theory is that stock splits drive the price up post-split because shares are more affordable and thus more people can buy them. Thus even the announcement of a split drives the price up typically a few percent. However with fractional shares this really shouldn’t matter, but anyway, the splits generally cause the price to go up in the short term.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Or play spreads - gets the debit amount down to more affordable values", "score": 1, "replies": []}]}, {"body": "Probably a lot safer. But if you bought shares prior and they did a 4:1 split for example. Your 1 share would turn into 4. So you're single investment doesn't change at all until the stock price starts to change", "score": 1, "replies": []}]}]}, {"body": "Narrative will begin soon.   2/19's.   Once it moves, it moves.", "score": 2, "replies": []}, {"body": "2/19/21 4000C ganggg", "score": 2, "replies": [{"body": "In Robin Hood it says 6 percent chance of profit", "score": -1, "replies": [{"body": "Do u actually believe what robinhood tells you to scam their traders???", "score": 1, "replies": []}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "kklo5w", "created_utc": 1609001837.0, "score": 4, "upvote_ratio": 1.0, "num_comments": 10, "comments": [{"body": "I typed in \"stocks\" on the amazon and it had tons of options. Thought id share.", "score": 6, "replies": []}, {"body": "You can buy prepaid visa, 5 dollar charge,  then transfer to bank.", "score": 3, "replies": []}, {"body": "Sell them at a discount", "score": 2, "replies": []}, {"body": "Simple answer give them to me", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "61 cents on the dollar. PM me", "score": 2, "replies": []}]}, {"body": "Don’t listen to the comments trying to scam you. There are popular websites out there that exchange gift cards for money. Google them and make sure the verify that the website is legit through any other forum and you’ll be good", "score": 1, "replies": []}, {"body": "Give them to someone that would appreciate them...\n\n\n\n\n\n\n\n\n...for half price.", "score": 0, "replies": []}, {"body": "I’ll buy them at a discount and Venmo you.", "score": 1, "replies": []}, {"body": "Send them to me", "score": 1, "replies": []}, {"body": "Cardcash.com or eBay, the latter is slightly friskier. Full on naughty? Go Craigslist.", "score": 1, "replies": []}]}
{"title": "BA about to be grounded again", "selftext": "[removed]", "id": "kkn9nl", "created_utc": 1609007479.0, "score": 0, "upvote_ratio": 0.45, "num_comments": 12, "comments": [{"body": "It’s minor issue.  But yes, it will be grounded again for its structural frame issue.  Documented but not fixed.  Heavy short", "score": 6, "replies": []}, {"body": "Does management receive puts as compensation? For some reason $BA hates going up in value", "score": 3, "replies": [{"body": "It went up from 150 to 230 within a month or so wtf you talking about.", "score": 5, "replies": [{"body": "Yeah, this is the only bad news for $BA in the last year, huh?", "score": -1, "replies": []}]}, {"body": "Underrated comment", "score": 0, "replies": []}]}, {"body": "GE makes the engines, and this seems like an isolated issue for one plane.", "score": 4, "replies": [{"body": "Everything starts as an isolated incident, until it isn't. It could be, but they'll look at other planes, and ground them until they know for sure. They won't risk it again.", "score": -2, "replies": [{"body": "I’m an aircraft mechanic on Boeing jets. These type of issues are far more common then you would think. Hydro and fuel pumps go bad often. Especially when it doesn’t fly for more than a few weeks. Can’t imagine how long this shitbox was on the ground. As somebody mentioned before, it’s only the news because it’s a max.", "score": 6, "replies": [{"body": "Might be true, but public opinion can take it and run", "score": 5, "replies": []}]}, {"body": "Maybe, but I also think the media is just looking to make a big deal out of it because they can.  Read something else that said this wasn't anything uncommon.", "score": 5, "replies": []}]}]}, {"body": "Wrong lol", "score": 2, "replies": []}, {"body": "[I feel so sorry for then smh. ](https://imgur.com/a/uh2aJbs)", "score": 1, "replies": []}]}
{"title": "Need help, TSLA, IWM", "selftext": "[removed]", "id": "kkrshl", "created_utc": 1609023145.0, "score": 1, "upvote_ratio": 0.57, "num_comments": 10, "comments": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Well I've always won with IWM, I needed something friendly", "score": 2, "replies": []}]}, {"body": "Nobody tell him\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}, {"body": "Tesla to 700 next week", "score": 2, "replies": [{"body": "what makes you think that", "score": 5, "replies": []}]}, {"body": "Diamond hands the IWM", "score": 2, "replies": [{"body": "that was my plan, but there is much talking of sell of and being overbought", "score": 2, "replies": []}]}, {"body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**TSLA**|**$660**|**BUY CALL**|**2020-12-31**|**$16.18**|**$661.77**|**4762**|**17338**\n|**TSLA**|**$670**|**BUY CALL**|**2020-12-31**|**$11.29**|**$661.77**|**5111**|**12350**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckj6b3xnk1b830747xf3k4qpj) | [Track Record](https://www.pickmojo.com/user/drhalxx/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*Recorded after market close, will be recorded at the next market open if the premium is within 10% margin. My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "score": 1, "replies": []}, {"body": "What’s your p/l?", "score": 1, "replies": [{"body": "from the above positions? tsla is 1k down, IWM 1k up. Generally I don't want to talk about it", "score": 2, "replies": [{"body": "I’m just asking to get an idea of your situation to give you advice. I think you shouldn’t panic sell personally, they might recover leading up to the 31st. I don’t really know about IWM but Tesla could easily fly through 660, maybe hit 700 even, who really knows. Anyway good luck man, I’m just some random person on Reddit", "score": 4, "replies": []}]}]}]}
