{"title": "Results of my $7.5K TSLA YOLO from 3/21, cashed out today for $13.2K.", "selftext": "http://imgur.com/bvzvmxV\n\nI'd say my goal of turning my TSLA trades into a Tesla Model 3 is going pretty well :)\n\nCashed out because my trailing stop hit at $22. I think it will go higher but I wanted to protect my gains.", "id": "4dsikk", "created_utc": 1460054947.0, "score": 143, "upvote_ratio": 0.97, "num_comments": 66, "comments": [{"body": "time for 12k in tsla puts?", "score": 28, "replies": [{"body": "Hey bud, I wouldn't do that if I were you.\n\nA few years back I was interning at a retail brokerage doing your average run of the mill paper pushing work.  While I was there I got pretty close to the branch manager who had been working in investment companies since the early 2000s. He told me about a time his buddy had a close call with death after buying puts on Tesla. So obviously when you work at a brokerage you shouldn't be trading your personal account at work, but this guy always had his account pulled up and would quickly minimize the screen whenever someone would walk by. I guess he was feeling cocky one day because he sent out a tweet about initiating a short position in Tesla and grabbing some puts, using the hashtag #shortTesla. So that day he goes to Panera Bread for lunch and orders his usual cheddar broccoli soup in a Bread bowl. He eats about 6 spoonfuls before he starts coughing violently and falls over. Paramedics come to the scene and the guy is taken to the hospital on a stretcher. After running some tests they find out that he had a severe allergic reaction to the food. Now this guy had a very grave nut allergy, but obviously there shouldn't be nuts in that soup, especially because the people at that Panera know the guy( he was a regular) and took extra care to not serve him after handling any of the breads or pastries made with nuts. About a week after he gets out of the hospital he finds the receipt from the day he had the attack in his wallet. He glances over the little rectangular paper and what does he see? A small memo added under where the soup was rang up. What did it say, you ask? \"Are you nuts....? -E.M.\" ..... \n\nI shit you not that was one of the craziest things I've heard and I still think about it from time to time, like could it really have been elon? I guess we will never know for sure but one thing is certain: be careful shorting Tesla because one day elon musk may just short you.", "score": 74, "replies": [{"body": "This is a weird story to read because I have a nut allergy and go to panera for lunch all the time", "score": 17, "replies": []}, {"body": "EM did 9/11, confirmed", "score": 6, "replies": []}, {"body": "lol i have no idea whats going on\n\nalso i was joking that OP should put his profit back into puts. \n\ni am also considering some myself, but i love elon and am too scared atm. i want to believe.", "score": 4, "replies": []}, {"body": "God damn it Ripson", "score": 4, "replies": []}, {"body": "Wtf did I just read?? I thought you were going to say his position got squeezed whole he was in the hospital and he got a huge margin call or something!", "score": 1, "replies": []}, {"body": "Where's the Loch Ness monster??????????", "score": 1, "replies": []}, {"body": "Dude WTF is your deal with telling these fake ass conspiracy stories about TSLA and Elon?", "score": -15, "replies": [{"body": "If you think any of these non fiction accounts are fake then you have a world of pain coming your way buddy.", "score": 21, "replies": [{"body": "Bring it.", "score": -8, "replies": [{"body": "Either enjoy the banter or go back to your fucking shanty - most importantly, fuck you", "score": 13, "replies": []}]}]}]}]}, {"body": "I went with a longer term and farther out of the money call. No joke, I intend to hang onto this option for a while.  http://imgur.com/BxLiAQU\n\nI haven't gotten a feel for where the resistance is and what the cycle will look like yet for a shorter term play.  Probably going to stash half of it because I don't want to overexpose myself.  If I get too much money caught up in option investing (which is pretty much all that I do with my Tradeking Account) then I get far too emotionally involved in the market.\n\nBut yes... the hype is dying, the shorts are probably going to come stronger, and a put might be a solid play.  Just not for me at the moment...", "score": 4, "replies": [{"body": "youre going to get crushed on vega. If it stays flat, IV will drop slowing and your option will decay a ton. If it goes down, you will lose, and likely IV will drop as well, so a big loss. \n\nlets say in 90 days it drops to 220 again, with the theta decay and the price drop you stand to lose about 2500. which is over 50% loss, ouch there, but, lets say the IV also drops 20%, which is feasible, that contract will be effectively worthless. \n\nEither get out, or change to a spread of some kind, probably with that much theta, horizontal spread. That will make you much more vega neutral. ", "score": 5, "replies": [{"body": "Thanks - yeah I think I'll change my position today.", "score": 2, "replies": [{"body": "Did you change it? Looks like IV hasnt tanked a ton yet, ~5%, looks like you would be down ~$600 if you had kept it. Wondering what you did? Im actually thinking TSLA bearish mid term, in Chicago they are talking about taxing per mile instead of the gas tax, the incentives for electric cars are on the way out. \n", "score": 1, "replies": [{"body": "Yep. Bought an At the money January 2018 call, and sold a May 20 call at $280. \n\nWhat's weird to me is that the atm put for January 2016 has 10% more IV than my call, and is therefore worth more, even though it has about $3 less intrinsic value.", "score": 1, "replies": [{"body": "well i would think nearer term would have higher IV, generally speaking, i think the IV of individual contracts is tough to really look at, especially far out like that, the lower volume could do funky things. Its all part of a formula, so if the price is weird, something has to explain it, that thing is IV because time is fixed and price is set by the market. So generally a low IV would be a good buy, high would be a good sell.\n\n\nhowever, I would look at the IV of the \"stock\" which in my understanding isnt really the IV of the underlying, but rather the aggregate of the options.  You will want to look at that and look at where it is as opposed to its average level, or plot IV vs HV. If IV is above average, you would generally want to take selling positions, though I dont usually like unlimited risk, so ill take a spread, either bear call or bull put, then plan your strikes out so you get the most overvalued contract that will expire out of the money. I will tell you it is not nearly as exciting, but a much more consistent way to make money with options.", "score": 2, "replies": []}]}]}]}]}, {"body": "yea im eyeing it. i know what u mean with the trades. crazy swings now a days.", "score": 1, "replies": []}, {"body": "Dafuq?", "score": -1, "replies": [{"body": "Woof? (But seriously, if you have a question, be specific and I'll answer it.)", "score": 2, "replies": [{"body": "I guess that was pretty vague. My main question is what made you grab a call that far out? Is it a general faith in the company or is there a reason for that date? There are a lot of things that can happen in that time completely unrelated to the company or beyond their control that could have a seriously negative impact. ", "score": 4, "replies": [{"body": "Reasoning for the date is general faith in the company, to some extent, and also that date is just after the release date of the model 3. It's not so much that I believe in the company, but that I believe that other people will believe in the company, and that demand for this product is going to be huge.\n\nA couple other users have pointed me to calendar spreads. I may end up doing that instead.", "score": 5, "replies": [{"body": "so basically you read someone's DD about model 3 on wsb. Nicely done.", "score": 2, "replies": []}]}, {"body": "Keep in mind with options you dont pick an expiration close to the date you think there would be a catalyst, and you can buy and sell them at any time. Buying long term options you are effectively paying for a lot of time, the sooner it goes up the better, but if it goes up tomorrow, he would make more with a shorter expiration, but the shorter expiration will decay quicker. \n\nThe big mistake here is actually all about the IV. The IV is really high right now, and the OP paid for it in his option. When the IV drops, ie things stabilize, the value of that contract (and any contract) will tank. \n\nI would highly recommend a spread, probably horizontal in this case, as that will limit the OPs exposure to both theta and vega ", "score": 3, "replies": [{"body": "That's the advice I keep getting - looking into that and probably going to change my position.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Should have listened. Probably would have redoubled my money.", "score": 1, "replies": [{"body": "No time like now.", "score": 1, "replies": []}]}]}, {"body": "Good luck to you.  I just can't get the math to make sense on TSLA.\n\nThat option breaks even at $373 per share, which would put a market cap on TSLA of $50 billion, assuming they don't need to raise any additional cash by selling more shares before then.  They hope to sell what, 125,000 cars in 2017?\n\nGM has a market cap of 46 billion for reference.  GM sells around 10 million cars a year.", "score": 13, "replies": [{"body": "Don't worry. Many things in Wall Street don't make any sense. Just keep playing and hope you cash out some gains. \nCheers,", "score": 19, "replies": []}, {"body": "Efficient markets people would likely say its not being valued as an auto company, its valued as a tech company due to their battery tech etc", "score": 6, "replies": [{"body": "You mean panasonics battery tech...  Right?", "score": 5, "replies": []}]}, {"body": ">that option breaks even at $373 per share\n\nNoob question, but how did you do that math? ", "score": 1, "replies": [{"body": "It's for the one he posted in comments.  $350 strike call + $23 in premium.  At $373 the in the money portion = the original premium cost.", "score": 4, "replies": [{"body": "Oh okay I didn't see that one, thanks. But that's only if he wants to exercise the option no? Won't the value of the option go up very high as the stock price gets closer?", "score": 1, "replies": []}]}]}, {"body": "GM isn't innovating 3 different industries - Cars, Energy, Autonomous Driving software ", "score": 1, "replies": []}, {"body": "Thanks. Valuation is an incredibly difficult subject though. Just look at the value of Virgin Airlines for instance...", "score": 1, "replies": []}, {"body": "I'm right there with you.  I see it's current value at $80.  The rest is all speculation.  I wish I had the stomach for that kind of trade.  ", "score": 0, "replies": []}]}, {"body": "> https://www.reddit.com/r/wallstreetbets/comments/4be857/yolo_75k_on_tsla_lets_see_if_i_can_take_this_and/d18c4td?context=3\n\nBeing the top comment holder of this faggots old thread *cough* *cough*\n\nI would like an offering of $50 USD to the prince of nigeria (to jump start my robinhood acc c:)", "score": 3, "replies": [{"body": "If you really want $50 free and 20ish free trades, I can give you a link to start your own account at Tradeking.", "score": 1, "replies": [{"body": "[removed]", "score": 5, "replies": [{"body": "#[USER WAS BANNED FOR THIS POST]\n\n^^^^^*thanks,* ^^^^^*/u/opinion_is_unpopular*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Is Tradeking actually good and available to the UK? Robin hood is also not here in the UK but swag.\n\nAnyways, gimme tradeking anyway.", "score": 1, "replies": []}]}]}, {"body": "Congrats dude", "score": 3, "replies": []}, {"body": "Yup, I thought of you when I saw TSLA going up, and assumed you were going to pull out today. Today (Thursday) is when I would have pulled out, for sure.", "score": 2, "replies": []}, {"body": "Wouldn't buying a Tesla Model 3 with your profits be a terrible investment? ", "score": 2, "replies": [{"body": "By your logic, spending any money on anything that doesn't appreciate in value is a terrible investment.\n\nThe reality is, I'm converting monetary value into both physical asset value (the car is still worth something if I sell it) and the value that I get out of that physical asset: satisfaction from driving.\n\nSo really, I'm taking my monetary investment and converting it to a happiness investment.", "score": 3, "replies": [{"body": "You're a towel ", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Yeah bud no problem.\n\nLet's try to grasp at what I actually purchased when I purchased that call option.  I bought the right to buy stock at a specific price (strike price = $280) on a specific date (Sept of this year.)\n\nNow, there are 2 big players that are involved in valuing a stock.  Time value and intrinsic value.  Time value always decays as the option approaches its expiration date.  Intrinsic value is the value that the stock currently is above the strike price.\n\nObviously, I'm hoping the stock goes up.  Well up and above $280.  I bought my contracts when the stock was a little below $240.  The stock then increased in value to a little over $260.  Seems like it's climbing and it's well on it's way to over $280 by September right?  Exactly.  So therefore the contract increases in value.  And I sell it to someone else who hopes they can do the same thing as me.\n\nFor every dollar that the underlying stock goes up, the contract also goes up by some amount that is determined on the open market.  When I owned the contract, that amount was $0.30 increase in contract price per $1.00 increase in TSLA.  That amount is called delta. \n\nhttps://www.tradeking.com/education/options/strategies/long-call\n\nThe link explains what a long call is and some of the factors involved.  A long call is fairly simple and is a lot like owning the stock itself, just amplified because you have leverage.  When the stock goes up or down, my option value goes up or down.  Biggest difference that can come back to bite you is time decay.  Each day that passes, assuming the implied volatility of the stock stays the same, the option price is always shrinking closer to its intrinsic value.", "score": 3, "replies": []}]}, {"body": "OK", "score": 3, "replies": [{"body": "^ Comment of the year right here folks. Don't bother commenting anymore if you were going for it. This guy's got it on lock.", "score": 11, "replies": [{"body": "don't even pay attention to comments like this. \n\nespecially don't waste your life replying to them.", "score": 3, "replies": []}]}]}, {"body": "Fuck my luck.  Watching TSLA for a week, finally buy a call and it has a downtick day.", "score": 1, "replies": [{"body": "hahahaha", "score": 1, "replies": []}]}, {"body": "How's tony stark these days ", "score": 1, "replies": []}, {"body": "TSLA for me is a long term investment, short term its' a sell. They'll hit fulfillment issues in 2016/17, price will come down to around $150.", "score": 1, "replies": []}, {"body": "I envy you. \n\nStill waiting for my MNKD train...", "score": 1, "replies": [{"body": "Dude... get out of the MNKD train.  And if you're in SUNE get out of there too.  Unless you're an expert in that field and understand that market really well, I think playing that market is a bad idea.  For me, that means that I avoid biotech and pharma stocks, because I don't have a very good understanding of how those companies make money, because the U.S. health and health insurance systems are so convoluted and crazy.  I generally like technology companies, because I can look at a specific product, sometimes touch it, experience it, see how it is marketed, how it is sold and distributed, and get a pretty decent understanding of how those things work.\n\nThen I can make an informed decision for this question: Is this company undervalued?  Overvalued?  From that question I can make a rational trade.\n\nMNKD - I have no idea how to value that company, so I'll just stay away.\n\nTSLA - Right now TSLA is selling a 2 legit automobiles I can go and touch.  At worst it's a company that has a product that I understand.  At best, it's a company that has a future product that might just change both the transportation and the energy sectors.  I think it's tremendously undervalued.", "score": 3, "replies": []}, {"body": "side note:  if MNKD releases any news that isn't negative, the stock will skyrocket temporarily due to the huge emotional investments between wsb/marketwatch/stocktwits.  if you have calls, I'd definitely be doing hourly google searches throughout the day.", "score": 2, "replies": []}, {"body": "That train is taking forever to arrive again ain't it. ", "score": 1, "replies": []}]}]}
