{"title": "Tesla bids to buy Solar City", "selftext": "http://www.cnbc.com/2016/06/21/tesla-makes-offer-to-acquire-solarcity.html\n\nOpinions on what this means for SCTY/TSLA? \n\nJust a bluff?", "id": "4p76ip", "created_utc": 1466545824.0, "score": 52, "upvote_ratio": 0.93, "num_comments": 57, "comments": [{"body": "[deleted]", "score": 8, "replies": [{"body": "It means in the short term SCTY stock will go up tomorrow. If you have a position it may be a good moment to cash out as many will do so tomorrow.\n\nAs for TSLA it will be the exact opposite. It will go down tomorrow because it will cost a lot to buy Solar City and it may be a good entry point if you were planning on buying Tesla stock.\n\nIt seems Elon Musk is really planning on changing the whole world.\n\nEDIT: Looks like it's already doing what I said in after hours. May be a good time  right now to sell SCTY and buy TSLA if you can get shares.", "score": 10, "replies": [{"body": "Stock newbie here, *hypothetically* at what point does a stock-for-stock merger occur? Is it a good idea to buy into SCTY or TSLA? ", "score": 1, "replies": [{"body": "Nothing is for sure. The deal could fall through. No one knows. Maybe not even Elon. The CEO of Solar City may not want to sell, etc.\n\nBased on the news and the stock price, in my opinion it's a good time to buy TSLA right this moment, as it looks like the Solar City purchase is priced in. Also people will be buying and shorts will be covering tomorrow since a 10% drop in a single day for a large cap stock like TSLA is a lot of money and it looks cheap since it's under $200. There's also BREXIT going on too though, I don't know how much it will influence TSLA. It's hard to say.", "score": 2, "replies": [{"body": "It's is NOT a good time to buy TSLA.  Don't listen to this guy unless you wanna lose money ", "score": 0, "replies": [{"body": "So, when is it a good time to buy TSLA? When it's over $500 a share?\n\nAnd as I said, it's my opinion. If you think Elon is going to change the world, it's a good price to get in on. If you think he's a scammer, you should be shorting until it goes to zero.\n\nEDIT: TSLA just lost $4 billion in market cap. SCTY's market cap is $2 billion. Do the math.", "score": 7, "replies": [{"body": "> TSLA just lost $4 billion in market cap. SCTY's market cap is $2 billion. Do the math.\n\nSCTY also burns $700 M in cash every qtr. SCTY has a debt to equity of 400 %. SCTY is run by Musk's cousin, so there are a host of ethical issues. ", "score": 5, "replies": []}, {"body": "Option Straddle would be a great way of dealing with this volatility \n\nBut imo i think the only way is down", "score": 1, "replies": []}, {"body": "Yeah it's called don't  catch falling knives ", "score": 2, "replies": [{"body": "But you also don't want to chase profits... ", "score": 4, "replies": []}, {"body": "I guess we'll see what happens tomorrow.", "score": 3, "replies": []}]}]}]}, {"body": "CEO of solar city is Elons cousin. It's happening ", "score": 1, "replies": [{"body": "Yeah, looks like it is based on the price.", "score": 1, "replies": []}]}]}]}, {"body": "Couldn't it go even higher as people try to cover shorts they've been loading up on? If the actual price is 26-28, wouldn't we see the price migrate toward that until the votes happen?", "score": 1, "replies": []}]}, {"body": "Want to see other people opinion too. Been waiting for tsla to dip below 200 and now is the chance", "score": 1, "replies": []}, {"body": "Here's the norm:\nThe acquirer stock goes down\nAcquiree (being acquired) goes up", "score": 1, "replies": []}, {"body": "Well the billionaires who've been in this game for decades are letting TSLA go down, so you novices can buy into a shit stock or two.", "score": -4, "replies": [{"body": "Yeah, the stock is just crashing right now... /s", "score": 2, "replies": [{"body": "lulz", "score": 0, "replies": []}]}]}]}, {"body": "I own both.  I support the acquisition from both sides. Timing is interesting, but anything TSLA does right now gets amplified, and spun through the negativity cycle.", "score": 6, "replies": []}, {"body": "Would SCTY shareholder's be offered TSLA stocks then? ", "score": 3, "replies": []}, {"body": "Crazy news for me, I bought TSLA and SCTY some months ago and sold TSLA yesterday ahah", "score": 5, "replies": []}, {"body": "As someone that lost $7k from sunedison. FUCK SUNEDISON. FUCK SOLARCITY. FUCK SOLAR. FUCK THE SUN.  Sell all your shares in solar. It's fucking going down. SOLARCITY is one of the best ones out their and it can't survive without tesla crediting it's ass. Get out. So many better things to invest in. Put money in Nestle. Those fuckers will probably buy Coca Cola one day. ", "score": 12, "replies": [{"body": "The profits around investing in alternative energy suck.  They do.  That's not SCTY's fault.  It's the government and power industry creating rules for energy infrastructure to consistently limit the ability of innovators from ....innovating.  \n\nYes, these stocks suck.  But it's not the companies fault, its the complex and overly opaque regulatory bodies that make rules about these industries that keep them from being our primary source of power in America. Hell, the companies have done a damn good job at treading water when you look at all the bullshit they have to go through.", "score": 14, "replies": [{"body": "Agreed. That's why musk is doing this. So they can survive till things change ", "score": 3, "replies": [{"body": "I hope you're right.", "score": 1, "replies": []}]}]}]}, {"body": "Desperate attempt by Musk to avoid SCTY bankruptcy using TSLA shareholder dilution.  Hes already been using SpaceX to buy SCTY bonds.  Just a sophisticated game of revolving credit.  Borrowing money from himself to pay off debts.  The whole thing is gonna blow up in his face with shareholders footing the bill.", "score": 14, "replies": [{"body": "I agree with everything you say except for it blowing up in his face.\n\nIt is a sophisticated game of revolving credit.  His ultimate goal isn't to increase the price of stock, but to convert the world over to solar power, electric self driving cars, and to be able to colonize mars.  He's shuffling things around to make that work TSLA and SCTY might not look good to investors, but I'm long on TSLA.  Very long.  This upcoming dip is worth buying in more, IMO.\n\nSCTY sucks, but not because they have a bad business strategy.  They suck because the energy infrastructure in place in America consistently cock blocks innovators from implementing new ideas. ", "score": 20, "replies": [{"body": "> His ultimate goal isn't to increase the price of stock, but to convert the world over to solar power, electric self driving cars, and to be able to colonize mars.\n\nYa, that's not how finance works. ", "score": 4, "replies": [{"body": "It's how Musk works", "score": 2, "replies": []}]}, {"body": "So basically solar city and every other solar stock is doomed to fail because the environment won't let these businesses survive. So the eventual biggest company in the world, Tesla, will basically keep one of them alive till solar becomes a way of life ", "score": 1, "replies": []}]}, {"body": "Except for the fact that Musk recused himself from voting on the offer. This was voted on by Tesla's board unanimously. ", "score": 5, "replies": [{"body": "Hes doing that for legal protection.  It's naive to think he doesn't have influence on the boards.   It's his idea and  CEO of SCTY is his cousin!  I'm sure this plan was discussed ahead of time ", "score": 2, "replies": [{"body": "Of course Elon Musk can talk to the board. It's naive to think that the board can't also not listen to him because they think the move would hurt Tesla. They can disregard what Musk says if they want. ", "score": 1, "replies": []}]}]}]}, {"body": "Don't think it's a bluff. Whether it's a good move is a different story. It will allow TSLA to become more vertically integrated but at what price? ", "score": 2, "replies": [{"body": "2.8 billion.  I'm still long on TSLA.\n\nNext steps: The stock in TSLA dips.\nTSLA waits for a bit.\nAnnounces that the gigafactory is ahead of schedule.  Also announces that the model 3 will be on schedule for X reason.\nStock goes up again.\nModel 3 ends up being behind schedule.\nStock goes down.\nTSLA again announces some new innovation, such as the house battery or an innovative new development with Panasonic.\nStock goes up again.\n\nMusk holds onto his cards until the stock goes down.  Then announces innovative and world changing ideas.  Yes they're behind schedule and have logistical problems, but any company developing completely new tech has rollout problems.  These products are real and tangible at the end of the day, despite delays.", "score": 6, "replies": []}, {"body": "Apparently $2.8 billion.", "score": 3, "replies": [{"body": "And 2.5b in debt ", "score": 3, "replies": []}, {"body": "And debt. \n\nBut tbh I reckon it's a steal. Market leader in an emerging market and it's of immense value to Tesla. ", "score": 4, "replies": [{"body": "And debt.", "score": 1, "replies": []}]}]}]}, {"body": "TSLA is willing to pay a premium of up to $28.50 per share. Might be worthwhile to make a gain, especially since SCTY is trending down to $24.75 after its initial spike after close of $26.28. Any idea how long the merger could take?", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Musk isn't the CEO of solarcity, isn't his cousin? And he recused himself from votes on both sides, even though he's on the board. So essentially he doesn't have a say on whether its accepted on either end.", "score": 5, "replies": [{"body": "He isn't the CEO but is listed as a founder", "score": 1, "replies": []}]}, {"body": "Both are public companies.  And Musk is a big shareholder of both companies.  He doesn't \"own\" the companies.\n\nSCTY is probably insolvent and is about to go Chapter 11.  Musk would lose all the value from his shares.  Plus he uses his shares as collateral as personal loan.  If SCTY goes down, he'll get margin called and forced to liquidate his TSLA holdings which would cause a nosedive of TSLA price.  Using TSLA stock is a desperate measure to keep his net worth and Tesla shareholders are paying for it thru dilution.\n\n http://www.wsj.com/articles/elon-musk-supports-his-business-empire-with-unusual-financial-moves-1461781962\n\nEdit: Also SpaceX bought SCTY bonds which would get defaulted if SCTY goes under.\n\n", "score": 5, "replies": []}]}, {"body": "How would it affect the acquisition, if say, SCTY price shot up to $33? Are TSLA going to offer more? ", "score": 2, "replies": []}, {"body": "One of the most bizarre decisions I've ever seen. The street is absolutely going to thrash TSLA tomorrow.", "score": 1, "replies": [{"body": "Considering that the CEO is Lyndon Rive along with cofounder Peter Rive both being Elon musks first cousins, it isnt really that bizarre. ", "score": 2, "replies": [{"body": "It's bizarre for a business logic standpoint. ", "score": 2, "replies": []}]}, {"body": "Down 12% AH", "score": 1, "replies": []}]}, {"body": " Love Elon! He is for sure tired of the Stock circus and the shorties! He even mentioned that several times in interviews. Paybacktime!", "score": 1, "replies": []}, {"body": "Always happens to me. Sold 100 shares yesterday.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Serious question: do you think Musk is in it for the short term?", "score": 5, "replies": []}, {"body": "Solarcity has 2.5B of debt.", "score": 1, "replies": []}]}, {"body": "I just want TSLA to split so I can get in at a better price. I have tons of faith in Elon. Next generation Jobs, IMO. ", "score": -4, "replies": [{"body": "Wut?  You know that a split means nothing, right?", "score": 6, "replies": [{"body": "Maybe he can only afford one share. ", "score": 6, "replies": [{"body": "Maybe 2 after the split", "score": 6, "replies": [{"body": "Then just buy one share now...", "score": 1, "replies": []}]}]}]}]}]}
