{"title": "$900 Trillion derivatives market… will $4 Trillion be enough to bail it out?", "selftext": "Unlimited FED printing props up the market.\n\n**What if** ***unlimited*** **becomes** ***impossible*** **?**  \n\nNo one seems to care about the derivatives market for now. Its notional value is somewhere between $600 Trillion and $1500 Trillion.\n\nThe FED has injected approximately $4 Trillion so far. That seems huge but it is very small compared to the derivatives horror show.\n\nOK, derivatives depend on underlying assets. And those assets are supposed to be in control thanks the FED buying all junks out there.\n\nBut…\n\nA lot of things will go bankrupt in the next months. And those things have huge leverage ratios. It is not in the price yet since nobody really knows what derivatives actually contain.\n\n**What if the FED has to print $100 Trillion to keep the market up ?**\n\nThe US government will then have to choose between hyperinflation (and a civil war due to money destruction) or... let the market crash (I mean, something like -80%).\n\nIs there a third option ?", "id": "gwipir", "created_utc": 1591281621.0, "score": 59, "upvote_ratio": 0.84, "num_comments": 83, "comments": [{"body": "Are you The Money GPS", "score": 51, "replies": [{"body": "see on til tok", "score": 0, "replies": []}]}, {"body": "What comes after trillions??? Lol Great Depression", "score": 40, "replies": [{"body": "I wonder how the US would function with a quadrillion dollar injection.", "score": 12, "replies": [{"body": "Mint 1000 of those trillion dollar platinum coins and let’s find out. I will volunteer for the experiment.", "score": 15, "replies": [{"body": "I'll take ten of those.", "score": 7, "replies": []}, {"body": "Can I have one?", "score": 1, "replies": []}]}]}, {"body": "Zimbabwe knows", "score": 2, "replies": []}]}, {"body": "sshhhhh let's not talk about it yet. \n\n&#x200B;\n\nBrrrrrr for now.\n\n&#x200B;\n\nStart transitioning to crypto in wallets you own yourself.", "score": 33, "replies": [{"body": "Crypto don’t mean shit if there’s no power to run your wallet.", "score": 4, "replies": [{"body": "This isn't the walking dead. We'll still have power when America's collapse comes to fruition. The dollar just won't survive.", "score": 3, "replies": []}]}, {"body": "80% of my portfolio is crypto. I’m about to get rich", "score": 1, "replies": [{"body": "Nobody tell him", "score": 4, "replies": []}]}]}, {"body": "we can always fuck your wife ....", "score": 31, "replies": [{"body": "Vibrator go brrrrrr", "score": 27, "replies": []}, {"body": "Not cool stop playing fornite and go to sleep.....", "score": -6, "replies": []}]}, {"body": "$900 trillion is some sensationalised estimate of notional value. I.e it’s effectively meaningless if you consider most of it is interest rate swaps whose actual value will be a fraction of their notional value.", "score": 12, "replies": [{"body": "So I'm not an economist, but isn't that part of the fear? Securities that are quite literally worth next to nothing but are valued sky-high based on an underlying that could drop substantially, leaving trillions of dollars to evaporate due to huge amounts of leverage? Again I really have no idea, I'm asking more than telling", "score": 9, "replies": [{"body": "I’m not sure I understand, by definition at T0 an Interest rate swap is worth zero by design, whether it’s notional is 1 million or 100 billion. Most of them are used to hedge interest rate risk. They aren’t valued sky high, they are valued at fair value it’s just grossed up notionals appear large. Most derivatives are a zero sum game.", "score": 7, "replies": [{"body": "Did you actually type a sentence that has real meaning?  \nI have no idea what any of those words meant but I'll nod in agreement because my head hurts now.", "score": 3, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "I think I might get the basics of it. \nSo yeah it would \"look\" like a lot of money is owed / paid but it's not really.", "score": 2, "replies": []}, {"body": ">NotABritishGuy\n\nThanks for that long and interesting explanation. Quite complicated.  \nSo you say that 1 quadrillion market is a zero-sum-zero-risk game...  \nI still have some doubts that nothing could go wong.", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Thank you for that detailed info. That's the kind of info I hoped to get when posting here. A lot of food for thought. Difficult to understand but I'll re-read it again until I get it.", "score": 1, "replies": []}]}, {"body": "You are missing the point it’s not a 1 quadrillion market. Those values are relatively meaningless grossed up notionals that bear little resemblance to what counterparties owe one another. The actual liabilities are tiny in comparison and the real risk is counterparty risk I.e that one counterparty defaults and it has a knock on impact.", "score": 1, "replies": []}]}, {"body": "That sounds reasonable, I don't know that I'm talking about, but under your example, if only 1 party defaults on their mortgage, it's not a zero sum loss, it's a 50% loss of 200k. Multiply that across the whole economy, and it ends up being a lot of money.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Then why are they reporting $100 plus interest if it's interest only. I'm not blaming you, and fully admit I don't know what I'm talking about, I'm just asking, why are they reporting numbers that are totally unrelated? \n\nThe risk must be there, or it wouldn't be reported.\n\ni think it's like when I buy a stock for $100, and put in a stop loss at $90. With a straight face, everyone will say that my risk is limited to 10%, which is true, but there are circumstances where I could lose 100%. \n\nI'm positive there are some circumstances where the risk is much higher than you suggest. It might be hard to define, which is expected with anything complex. The risk doesn't go away, it's just tougher to see.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I know you're smarter than me. But I'm not an idiot. There's no free money without risk. My example is totally valid for explaining the difference between likely risk under normal circumstances and possible risk under strange circumstances. I'm not explaining the risk away. I think there risk is there, just hard to see.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I guess I just struggle to see how derivatives can be zero sum, especially when we have derivatives based off of other derivatives. Who is on the other end of that and will benefit equally if it goes tits up? I guess I could try googling this stuff but it makes my brain catch on fire", "score": 1, "replies": [{"body": "Most derivative have two counterparties with equal and opposite positions, where one gains the other loses.", "score": 2, "replies": []}, {"body": "I now see why some of these finance types are so filthy rich, their bull sh-tting are incredible.", "score": 1, "replies": []}]}]}]}, {"body": "Yea, I mean what is op even talking about!! Fucking lol!", "score": 2, "replies": []}]}, {"body": "There are papers about how the derivative market is manipulated. Fed don't have to rescue that market. If they provide enough liquidity, banks can manipulate market to their favour. Why do you think fed raised repo operations to $500 billion and duration to 30 days?\nI am actually making a DD about it. Will post it on coming Saturday.", "score": 9, "replies": [{"body": "Oooh I wanna read this", "score": 2, "replies": []}]}, {"body": "biggest bull trap in history about to go down... recovery could be ugly boys", "score": 22, "replies": [{"body": "At this point I literally see no other course than something equally as crazy as this recovery happening to equal the craziness of crazy for Newton's law of crazy on insane super unrealistic market recoveries.  The greed and euphoria on buying is a sure sign shits a coming but who knows when", "score": 7, "replies": []}, {"body": "I have already FoMo'ed.", "score": 7, "replies": []}]}, {"body": "Damm you sound smart ! You tell us I'll follow you blindly..\nSpy 100 puts ?", "score": 8, "replies": []}, {"body": "Whoa that's a lot of ink", "score": 6, "replies": []}, {"body": "This is probably why my etherium has been climbing. I should probably buy more before it blasts off.", "score": 6, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "That's what fed has pumped in between asset purchases and stimulus programs. Are you even awake?", "score": 5, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Trump said between the law pasted, and what the Fed did, it was $6.2 trillion. The law was for $2.2 trillion, leaving $4 trillion for the Fed. \n\nIs Trump a valid source? (I can't tell if I I'm kidding when I ask that)\n\nhttps://m.youtube.com/watch?v=METboNwsQaQ", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "I think, in case of a crash, the crypto market would also crash. But it would be one of the first and fastest to recover.", "score": 5, "replies": [{"body": "No , BTC will form the biggest green dick pattern you will ever see. $1 million per BTC min.", "score": 4, "replies": []}, {"body": "Because gold and silver usually crash during a period of inflation.", "score": 1, "replies": []}]}]}, {"body": "well said", "score": 2, "replies": []}, {"body": "They are just printing paper. Sure there aren’t enough trees on earth to print to infinity but it will still be a lot of money.", "score": 2, "replies": [{"body": "JPOW said they also print digitally", "score": 8, "replies": [{"body": "Printing digitally just means adding more zeroes to the ledger.", "score": 1, "replies": [{"body": "They will need more COBOL programmers soon.", "score": 1, "replies": []}]}]}]}, {"body": "Actually the fed injected a small percentage of the $4 trillion. Over 95% left still available", "score": 2, "replies": [{"body": "Do you have a source for that?", "score": 1, "replies": []}]}, {"body": "What? That's the sum of the notional value of all derivatives. It's like adding the entire valuation of a company to the price of each share of stock. That's like saying each share of AAPL is worth a trillion. It makes absolutely no sense. The actual derivatives market is worth much less than that, [like 12 trillion](https://www.investopedia.com/ask/answers/052715/how-big-derivatives-market.asp). The Fed is ready to pump **33% of the entire derivatives market**. That's an incredible amount.", "score": 2, "replies": [{"body": "You should really say nothing makes sense any more.", "score": 2, "replies": [{"body": "I think it makes sense. All you need to do is remember the Fed has taken over propping the market up through liquidity until the economy is able to get back to propping it up. As a result, nominal value of the market has become inflated, maybe forever. \n\nThink of it this way: a store has 10 pies and there are 10 customers. Each customer has a one dollar voucher. Each pie will end up $1. Now someone tosses another dollar voucher at each of the customers. Suddenly the customers have $2. They'll eventually bid $2 for those pies. You're still getting one pie, but it's now $2.\n\nThe eventual handoff between the Fed and the economy is where we might see a dip.", "score": 1, "replies": [{"body": "I agree with your last point, but the Total Market Capitalization in the USA is 147.3% of GDP, and GDP includes non profits and government spending, so liked I said, nothing really makes sense anymore.\n\nhttps://ycharts.com/indicators/us_total_market_capitalization\n\n\"Typically, a result that is greater than 100% is said to show that the market is overvalued, while a value of around 50%, which is near the historical average for the U.S. market, is said to show undervaluation. If the valuation ratio falls between 50 and 75%, the market can be said to be modestly undervalued.\"\n\nhttps://www.investopedia.com/terms/m/marketcapgdp.asp", "score": 1, "replies": []}]}]}]}, {"body": "Key word notional value. Having the ‘right’ to buy something is not the same as actually owning it. The market value is still only somewhere around 15-20 trillion for derivatives which is well under the total amount of global assets so i think we should be chillin. Key words in that sentence being should be.", "score": 2, "replies": []}, {"body": "Notional value is not relevant here - the market value of  these derivatives are somewhere around $8-10 trillion (ie the notional value of SPY 6/17 350C is $35,000, but market value is probably $50-$100)", "score": 2, "replies": []}, {"body": "Since they can just buy new keyboards when the \"0\" key wears out,  unlimited isn't really impossible.  As to your second point, stocks will inflate as much as anything else, be sure to own some.", "score": 1, "replies": []}, {"body": "So SPY puts 6/12 @ $50?  Got it", "score": 1, "replies": []}, {"body": ">A lot of things will go bankrupt in the next months.\n\nLike what? Other than companies that were on shaky ground to begin with like JCP, businesses have access to so much cheap debt at this point, even more soon enough once Main Street Lending comes into play, that I don't see who'll be going bankrupt. States are opening up, old people are dying in droves from covid so even GE gets a release on some of its long term care woes, and so on.", "score": 1, "replies": [{"body": "Owners of the malls and strip malls won't do well. \n\nPeople aren't paying their rent, that's a major issue.\n\nAt some point the Fed will need to unwind all this, or are we thinking free money will go on for infinity?", "score": 1, "replies": [{"body": "Regular malls have been dying pretty much everywhere already though. Obviously they may die faster with this, but I think a lot of their weakness has been priced in at this point. JCP was already a penny stock before this bankruptcy.\n\nStrip malls usually have grocery stores, Walmarts, Targets, etc. as anchors and they're all doing just fine. Shoppers are going to those much more reliably. Some chains within strip malls may be hurting, but I don't see that strip mall owners would be facing nearly as much rent collection issues as regular malls.", "score": 1, "replies": [{"body": "The news is saying just the opposite about small businesses. Many will never reopen.", "score": 1, "replies": [{"body": "Small businesses are able to get PPP, EIDL, and soon Main Street Lending Program loans. PPP is forgivable and the other two are what, 3.75%-4.25%? When often small businesses unless able to get something through SBA were getting 15-20% at best, or a hell of a lot worse (I own a small business so speaking from experience on that).\n\nYes, that's not free money other than PPP, but EIDL and MSLP have no payments for a year. If a business can't survive with those, it was on the brink of death before covid anyways.\n\nSure, some business owners will be blissfully unaware of those and never talk to anyone who could tell them about those and basically ignorantly let their business die when it could've lived. I just don't think it'll end up being a lot of business owners when all is said and done.\n\nThe only way small business bankruptcies would end up affecting markets other than Russell is if it drags down larger businesses with it, and at the moment, especially with everything the Fed is doing, I just don't see many major bankruptcies happening. JCP, HTZ and AMC were all hurting really badly before covid. They might've lasted another half a year to a year tops if not for covid. I don't see them affecting anything. The closest to a market-affecting bankruptcy IMO would've been airlines or car manufacturers, but it's looking like they'll be pulling through.", "score": 0, "replies": [{"body": "Blaming the victims doesn't make the problem any less. And what programs help those without enough insurance to help cover all the damage from the riots?", "score": 1, "replies": []}, {"body": "🤑\n\nhttps://www.businessinsider.com/25000-us-stores-to-close-in-2020-crippling-malls-2020-6", "score": 1, "replies": [{"body": "Many of those are chains consolidating, as they mentioned where they mention towards the end 4,000 stores closing with many of them being the 3 chains they mentioned, none of whom are out of business (yes, not even JCP who is in Chapter 11 bankruptcy, not Chapter 7), and as I mentioned before, regular malls have been dying already, as was evident when in that article they said the closures last year was a record.\n\nThis year would've still been a record even without covid, and while covid will certainly further along more closures, it's not as if these store locations in malls were doing wonderfully prior to now. It's like AMC - huge brand that may end up going bankrupt, which sounds like covid is really bad, til realizing they lost a fuckton of money last year as well and were already dying a slower death that covid simply has quickened. People don't realize there are always SOME bankruptcies that happen in the normal ebbs and flows of the economy.\n\nWhile the funding measures I mentioned won't prevent them all, they will prevent a lot of ones that would've happened. Main Street Lending Program especially if it takes off. A business can literally get 6 times annual earnings in funding and not have to make any payments for a year and then interest-only payments for a year after that. You can't tell me for most small businesses that wouldn't save them. Most small businesses have at most a couple months of expenses in their bank account, and this puts 6 years of expenses in their bank account. EIDL itself puts 4 months of expenses in their bank account, so even that makes a big difference.", "score": 1, "replies": [{"body": ">Main Street Lending Program especially if it takes off.\n\nGood point. I wonder why investors aren't picking up on this yet.", "score": 1, "replies": [{"body": "It's not really been made available yet as far as I'm aware (they've supposedly urged eligible lenders to start lending but they've not published a list of eligible lenders, lol). I know about it as I've been following it to get a loan for my small biz since it's just about the cheapest debt we could ever get and would be pretty hard to not make money on.\n\nI'm not sure it's really all that bullish whereby it'd affect investors. But I think things like this has been why HTZ and the like haven't gone to 10 cents even when they've filed for Chapter 11, because cheap debt is flying all over the place and they may be able to weather the storm given that.\n\nRealistically, the market got propped up with all sorts of shit and is a lot weaker than the SPY price would indicate, but it's not as if that's going away anytime soon, so just have to understand you're playing in a rigged game.", "score": 1, "replies": [{"body": "I agree. Biden is way up in the polls, and the market isn't worried at all, so people must think the easy money will continue either way", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "I'm guessing $40trillion. It's 10x what the last one was and that was 10x the one before.", "score": 1, "replies": []}, {"body": "this question is stupid, derivatives are not investments at the notional value, they are bets on the underlying market which represent a fraction of the notional value", "score": 1, "replies": []}, {"body": "So who mounted you on their wall today?", "score": 1, "replies": []}, {"body": "This sub is so stupid shows you dont know how derivatives work", "score": 1, "replies": []}, {"body": "There is a third option. Hype up team hustle no sleep gang and force people to work for free for a while. \n\n\nWait. People are already doing that.", "score": 0, "replies": []}, {"body": "900 trillion 😂? People, please do not believe anything without sources.", "score": 0, "replies": [{"body": "Seems about right. Derivatives market is always much higher than underlying.", "score": 0, "replies": [{"body": "So the derivatives market is 10x higher than the GDP of every country in the world combined?", "score": 3, "replies": [{"body": "Yes, it’s the notional value. And it’s more likely in the quadrillions than trillions. Much of that would never be realistic though due to derivatives acting lore like insurance, but that’s the notional value", "score": 3, "replies": []}]}]}]}]}
