{"title": "$TSLA Weekly Detailed Discussion - June 22, 2020", "selftext": "\nThis thread is to discuss news, opinions, analysis on anything that is relevant to $TSLA and/or Tesla as a business in the longer term, including important news about Tesla competitors. Do not use these threads to talk about daily stock price movements, short-term trading strategies or results, use the Daily thread(s) for that.  Be sure to link relevant sources to further the discussions of any idea or news-item raised. \n\nPlease send feedback to the moderators, as this may or may not become a consistent thread.", "id": "hdo9j6", "created_utc": 1592813941.0, "score": 14, "upvote_ratio": 0.94, "num_comments": 80, "comments": [{"body": "So we know Tesla's [skunkworks](https://www.cnbc.com/2019/06/26/tesla-secret-lab-building-battery-cells-to-reduce-panasonic-dependency.html) lab is on Kato road in Fremont and is developing the new 'Roadrunner' cell production line that will likely be toured on battery investor day.\n\nThis March 2020 [transport evaluation](http://www.fremont.gov/DocumentCenter/View/44020/Attachment-17) document for the Kato road building reveals,\n\n* A \"project, which redevelops/repurposes the two existing buildings and adds additional floors \\[second and third\\] for primarily manufacturing purposes\".\n* \"The redeveloped site will accommodate the following employees and job functions: 45 research and development employees and up to 425 manufacturing employees, spread over several shifts Monday through Friday.\".\n\nThe March 20th 2020 [environmental report](http://www.fremont.gov/DocumentCenter/View/44014/Initial-Study-to-Addendum-and-Mitigated-Negative-Declaration?bidId=) reveals,\n\n* \"Tesla expects that construction of the entire Project, including structural modifications to the Kato building, installation of all mechanical and manufacturing equipment, and assembly operations, can all be accomplished in approximately **3 months**.\" - So the battery line could be **operational very soon**.\n* \"Tesla plans to have approximately 100 employees working on a shift schedule (with two shifts per day), along with an additional approximately 70 employees working a standard workweek schedule (8am to 5pm, Monday to Friday) in support of Project, at any one time **The facility is expected to operate 24 hours a day, 7 days a week. Manufacturing activities will take place continuously except for occasional maintenance windows.** The more R&D-focused activities will primarily occur Monday through Friday, 8am to 5pm.\n* \"A total of **470 employees** will be assigned to the Project site, as follows:\n\n1. 45 employees will work 8am to 5pm on weekdays, primarily in R&D-related functions\n2. 25 employees will work 8am to 5pm on weekdays, primarily in manufacturing-related functions\n3. The remaining **400 employees will work in shifts**, such that there are **100 employees working at manufacturing** and production operations at any given time, **all day, every day**. Shifts change at 6am and 6pm daily.\"\n\nSo if I'm reading this right, Tesla is expecting to turn their Kato road building into a 24/7 battery manufacturing facility within 3 months from March 20th. 400 employees will work in shifts, so this doesn't seem like a small operation, but I'm interested in others thoughts.\n\nAlso I found it interesting the existing first floor \"battery manufacturing and R&D facilities \\[are\\] known as TERA\" which could be short for Terafactory, showing their ambitions for the battery lines.\n\nIf anyone can find more information on the current building progress on the additional 2 levels at Kato road we can extrapolate how close they are to the start of manufacturing.\n\nDoes this seem like merely a pilot battery production line to you guys? 400 employees working 24/7 7 days seems like full-scale battery production to me.", "score": 23, "replies": [{"body": "I suppose it's the definition of pilot line where people are getting caught up.  To me, this is a production line.  I don't know if it's necessarily to the scale that they'll do in the future, but these batteries are intended to go into vehicles.  \n\nPeople are talking about moving the production to another site later, but that seems like poppycock to me.  \n\nWhy shut down a money printer (battery line)?  With regards to production at other sites:  It will take time to duplicate this line.  And why duplicate it before it's been optimized?  \n\nAll this is of course my opinion.", "score": 6, "replies": [{"body": "Appreciate the insight man, pretty exciting to see them setting up their very own production line!\n\nThere is a table with expected electricity usage for the new RR line, but I'm not sure if it tells us much more than you've already outlined in your videos. Curious what \"De-Hu\" and \"CW Use\" could be though.\n\n[https://i.imgur.com/mmcygiA.png](https://i.imgur.com/mmcygiA.png)", "score": 3, "replies": [{"body": "Probably dehumidifier.  Working with lithium means you have to remove moisture.  Not sure about CW.", "score": 2, "replies": []}]}]}, {"body": "Tesla 47700 Kato Road and 1055 Page Avenue Improvements \n\nProject Attachment 1.6 – **Energy**\n\n[http://www.fremont.gov/DocumentCenter/View/44017/Attachment-6?bidId=](http://www.fremont.gov/DocumentCenter/View/44017/Attachment-6?bidId=)\n\nMaybe [u/Giesige](https://www.reddit.com/user/Giesige/) could look at the given table and provide any of his expert insight on the new roadrunner (RR) process they have outlined and whether the electricity usage confirms there's no drying process. Also what is \"De-Hu\" and \"CW Use\"?\n\n[https://i.imgur.com/mmcygiA.png](https://i.imgur.com/mmcygiA.png)", "score": 5, "replies": []}, {"body": "**Kato road project site and floor plans.**\n\n[http://www.fremont.gov/DocumentCenter/View/44015/Tesla-Addendum-and-MND-Figures](http://www.fremont.gov/DocumentCenter/View/44015/Tesla-Addendum-and-MND-Figures)\n\n/u/Giesige you might be interested in the first floor plan which shows the layout of the cathode/anode/assembly/washing/formation.", "score": 5, "replies": [{"body": "Thanks man!", "score": 3, "replies": []}]}, {"body": "Looking at the street view on google maps, I would never have thought they were going to turn that into a significant manufacturing facility.", "score": 3, "replies": []}, {"body": "24x7 shifts does sound more like manufacturing than development.\n\nFor comparison, according to [Wikipedia: Giga Nevada](https://en.wikipedia.org/wiki/Giga_Nevada) Gigafactory 1 planned for 6,500 employees and had 7,700 in 2019. Unclear how much is batteries vs drive units.", "score": 2, "replies": [{"body": "Could be determined by looking at the number of Panasonic employees.", "score": 2, "replies": []}, {"body": "Yup also given this is just cell manufacturing and it's entirely automated, I could see 100 employees per shift being enough even for large scale production.", "score": 1, "replies": []}]}]}, {"body": "Battery day is NOT a hard milestone. It's an announcement of the progress in the battery R&D.\n\nDelay in battery day doesn't mean that the progress in R&D has stopped or delayed. More delay in battery day could simply enable them to show and/or claim more progress in R&D when the day finally arrives.\n\n* *Roadrunner* project is a pilot cell line. This line is likely focused only to a few intermediate steps that Tesla is trying to improve or invent. The future goal would be to move from pilot R&D line to full integration in a Gigafactory and then copy-paste the same line in all current and future Gigafactories.\n* They could also show progress on cell-to-pack design without giving away too much secret sauce.\n* They might have test-rides for a Semi or Model S prototype which will have amazing range and cycle-life numbers.\n* I believe Tesla won't reveal any specific details on the cell chemistries, energy density or price/kWh because they'd want to keep a few important cards close to their chest.", "score": 13, "replies": [{"body": "\"Baterry day is going to be mindblowing\"", "score": 3, "replies": []}, {"body": "I think they will announce a new lower price/kWh.", "score": 1, "replies": [{"body": "It wouldn't blow any mind, unless it's spectacular improvement", "score": 1, "replies": [{"body": "I mean, if they announce that they broke $100/kwh at the pack level while also announcing a huge ramp of those cells, I think that would be pretty mind blowing to most of wallstreet and to retail that doesn’t follow as much. It’s kind of suspected that they will, but it would still be huge news to have a confirmation of that.", "score": 2, "replies": []}]}]}, {"body": "Roadrunner a pilot cell line? With 400 employees running 24/7.", "score": 1, "replies": [{"body": "Yes. \n400 number is what they submitted as part of the study. They’d want to be conservatively high in their estimation. \n\nAlso, pilot manufacturing lines by their nature are less automated and more labor intensive.", "score": 2, "replies": []}]}]}, {"body": "Last week I learned about dark pools on this reddit:\n\n[https://www.reddit.com/r/teslainvestorsclub/comments/hbq5gf/half\\_a\\_billion\\_worth\\_of\\_shares\\_purchased\\_and\\_or](https://www.reddit.com/r/teslainvestorsclub/comments/hbq5gf/half_a_billion_worth_of_shares_purchased_and_or)\n\nNow, I can't stop wondering if dark pools could be used by the S&P 500 funds to rebalance their portfolios when TSLA gets included, so that they can avoid pushing the stock price up.\n\nSurely they must already be aware that Tesla's S&P inclusion is just a matter of time. So why wouldn't they already load up on the stock in their own private dark pool?\n\nAre there any rules or regulations that would prevent them from doing so?", "score": 7, "replies": [{"body": "You have it right. Institutions won’t be fighting on the open market for shares.\n\nHowever, the pool of available shares will decrease substantially because so many more shares will need to be held by institutions. I’d expect an increase in volatility, especially on upward movements, as there are fewer shares to fight over. Of course, with this stock, volatility is so high who will notice?", "score": 2, "replies": []}, {"body": "The price will still be pushed up as there is only so much supply and it’s likely many institutions would be trying to do the same thing", "score": 2, "replies": [{"body": "^\n\nIt basically reduces the float so long term result is the same", "score": 2, "replies": []}]}, {"body": "also: I imagine that s&p500 addition would cause many more retail investors to take Tesla a bit more seriously", "score": 1, "replies": []}, {"body": "I’d highly recommend that you read flash boys by Michael Lewis! I had read it when it came out a few years ago, but I gave it a re-read when that post came around. It’s fascinating learning more about how our crazy markets work nowadays", "score": 0, "replies": [{"body": "Thanks for the tip, I’ll have a look at that!", "score": 2, "replies": []}, {"body": "Just finished the book. It was a fascinating read indeed. Whilst reading I was assuming/hoping that those trading techniques would have been forbidden by now. Only to find out afterwards that things haven’t changed 😕\nThanks again for the tip! I’ll only be using limit orders going forward...", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "This has nothing to do with battery day. This happens in every quarter. They have all the production on ships or semi trucks in the first couple of months. Most of the deliveries happen in last month i.e 8-12 week from now. \n\nIf the change in estimate happened today then they must have the US order backlog of greater than 8 days going into the next quarter.", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Great article, thanks.", "score": 1, "replies": []}]}, {"body": "Hey guys, I am wondering where does APAC cars come from? Probably Fremont but I'm wondering if it may come from Giga Shangai. Any info if they will deliver any there. I am currently doing my delivery estimate.", "score": 3, "replies": [{"body": "Currently Fremont. Shanghai currently only supplies Chinese buyers. I would expect that to change in the future when they're up to full production.", "score": 1, "replies": []}]}, {"body": "Hi everyone, I am wondering, do anyone know/ ave educated guess on which percentage of buyers take the 7 grand FSD Option? I am doing Q2 Preview earnings and it's a very important data.", "score": 3, "replies": [{"body": "[Troy's estimates for FSD take rate for Q1 based on his sheets](https://twitter.com/TroyTeslike/status/1263122226234175489?s=20): \n\n>Model 3 FSD take rate in Q1: 10.4% SR+ 34.4% LR/P    \n>  \n>Y has no SR+ yet. So, correct comparison would be 34.4% vs 51%. My best guess for the difference:    \n>  \n>•More die-hard fans among early buyers   \n>  \n>•Y is more expensive. Take rate increases with vehicle price. S/X have even higher rates", "score": 4, "replies": [{"body": "Seems reasonable, but how did he know Q1 Take rate? I know it's complex but I would personally remove 10-30% of the take rate as less people in China and Europe take the feature as not very advanced.", "score": 1, "replies": [{"body": "He has a spread sheet where buyers input their information. You’ll find it if you scroll up on the tweet that I linked earlier", "score": 1, "replies": []}, {"body": "The everyday astronaut was talking about this. In US it's 30%. Worldwide it's far lower. But not sure by how much.", "score": 1, "replies": []}]}]}, {"body": "Saw an article or news clip that said it's at 25%, I don't have the source handy unfortunately.", "score": 1, "replies": []}, {"body": "Very region-dependent, just as FSD capabilities", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "Yawn.", "score": 1, "replies": []}, {"body": "Not really. Car tech is not even close. It’s a joke. \n\nWould you use a Nokia with a good sound system? Haha.", "score": 1, "replies": [{"body": "If I was desperate enough, you bet!", "score": 1, "replies": []}]}]}]}, {"body": "question for those who have their own long-term valuation models: how have you calculated future Depreciation and Amortisation?\n\nin my own model, I've previously only included an EV/EBIT ratio though am now considering calculating future EV/EBITDA", "score": 2, "replies": [{"body": "You could get more sophisticated but just holding D&A/Revenue constant would be a quick and easy way to do it. If you're forecasting balance sheet too you could actually tie it to the relevant asset values. Could introduce a downward/upward trend to that ratio, etc", "score": 5, "replies": [{"body": "I'll give that a shot, thanks. I'm not too intent on being super precise, it was mostly to give a rough EBITDA in addition to EBIT.\n\nif I were to analyse other growth companies' past DA expenses, are you aware of a more efficient way than reading years of balance sheets for multiple companies?", "score": 1, "replies": [{"body": "Nope. Besides their income statements of course. This is my bias but I prefer to just look at cash flow", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I really dig that ID Buzz and hope it makes it to market.  Not sure I'd take it over a cybertruck, but I really like it.  I think it will/would have broad appeal -- the price is going to be important (should it ever see the light of day).", "score": 2, "replies": []}, {"body": "Vaporware! (only slightly ironic)", "score": 1, "replies": []}, {"body": "Yeah, cool for one of the last 3 VW bus prototypes that have been promised over the last 20 years.  Two of them were EVs.  None of them were anything beyond vaporware.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "~~I've approved this comment, but there's a word-for-word identical comment that was also in the spam filter from /u/Polygon_Thoughts. One of the two of you **must** send an explanation to the mods to clear this up, as spamming is a banable offense.~~\n\n~~Pinging /u/Danvtec6942 for awareness.~~\n\nAll resolved.", "score": 2, "replies": [{"body": "Sorry. that was my mistake. When my first post got blocked because of my account being to new, I tried reposting using an older account. It was not the intention to double post/spam. \n\nStill new to the whole posting on reddit thing...", "score": 3, "replies": [{"body": "Gotcha, that makes sense. The automod catches comments within a certain criteria of age or account karma and puts them in the spam queue, but we check it a few times a day for the most part and approve things that were caught in error. This reply, for example, was similarly caught.\n\nThanks for the reply; keep commenting where relevant and we'll keep approving it, the issue will resolve itself soon.", "score": 4, "replies": []}]}]}]}, {"body": "No one has been talking about the price increase to Full Self Driving on July 1. Elon has always said the price would significantly increase as more features roll out. The price increasing could mean that new features are about to drop, and better autopilot will mean a material change for the company.\n\n/u/tesladaily , /u/stevenmarkryan", "score": 1, "replies": [{"body": "There is an FSD update around the corner, I believe it was reported as it's own article here a few days ago? It's basically FSD goes through green lights without prompting the driver provided their is a lead car. So still stopping on green if no car in front. How I interpreted it anyways.", "score": 4, "replies": []}, {"body": "Intersection auto stop and go is maturing and will soon warrant the extra cost. June 30 marks the end of the quarter and a price increase on July 1st pushes for more FSD purchases this quarter. It's just natural timing.", "score": 2, "replies": []}, {"body": "I don't think so. If you watched Head of AI recent presetnation, you should know that they release features as soon as it's safe and they aren't really receiving orders from Musk so no reason from them to do such a strange thing.", "score": 1, "replies": []}]}, {"body": "With every day that goes past Elon's commentary on Covid-19 looks more and more idiotic & irresponsible.\n\nThis *will* affect his reputation, and the public view of Tesla (as being so identified with him).\n\nAnd the thing is, he didn't have to say anything about it at all. What an idiot.", "score": -6, "replies": [{"body": "I think his commentary was mostly correct. The risk this virus posed was overblown, and the economic damage was definitely undervalued.", "score": 10, "replies": [{"body": "I disagree that the risk the virus poses is overblown.  We need to be realistic about the threat and proceed with care.  Otherwise we get what we're seeing now: a resurgence in the US -- not in Europe or Asia (at least nowhere near the scale we're experiencing it here in the US).  Because we can't be bothered to practice hygeine and care, we're looking at another shutdown.  So, I don't put the blame on the WHO, I put it on those who call it just a flu, say when you're numbers up, you're number's up, etc., and then gather without masks.  They're the ones causing the next shutdown.", "score": 1, "replies": []}, {"body": "There wouldn't have been the same level of economic damage *if* the potential risk the virus posed was appreciated early on and early action was taken. It is immensely foolish to think there was a choice between economic damage and containing the virus. Could have taken an early, fairly small economic hit by shutting down early and saved ourselves the vastly greater economic hit from being in denial.  Instead, Elon described this as 'panicking'. He has truly been an idiot on this matter and, where I once respected him, I now see him as deeply flawed (but still a great & visionary engineer who has brought great advancement in renewable energy and spaceflight). And I think this pandemic does present existential risk to Tesla, and I don't think Elon has yet really clued on to that. Not the so-called 'panic'; the virus itself.", "score": 1, "replies": [{"body": "I agree.", "score": 2, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Removed for the last sentence. To discuss here, you must discuss civilly.", "score": 2, "replies": []}]}]}]}, {"body": "Not at all.. support your argument. The panic was absurd. Shutting down parts of country that was not truly involved and extending shutdowns when there was virtually no virus were all monumentally stupid. This can be controlled if people dont freak out, wear a mask, and follow reasonable precautions. He is perhaps the most sane person on Twitter regarding COVID-19.", "score": 7, "replies": [{"body": "Yeah the US is exemplary at controlling covid-19...", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "We also shut down the entire economy well after the virus had spread to every corner of the country. It was completely senseless and ineffective approach.", "score": 2, "replies": [{"body": "Yeah I'm kind of with you on this. \nAnd Sweden hasn't shut down at all.They need to tell us who is most at risk and protect those people. I've seen articles saying that if you're 40 and under and in perfect health your chances of dying are 0.01% or 1/10000. To put that in context that's less than the chance of dying in a car crash this year in USA. I feel like we don't have the appropriate information to make an informed decision. And they started this whole thing by saying if you get it you might die. They need to give us actual figures so we can assess the risks.", "score": 2, "replies": [{"body": "Every other commercial and YouTube ad right now should be how important masks are to keeping country running.  Trouble is every person and organization lacks credibility because the popular belief is so divorced from reality and no one knows what to think or who is not completely full of shit. Ideally WHO and cdc fills this role. CDC screwed the country over because they couldn’t make a test and did allow other to in time.  WHO screwed up massively in making stuff up about masks and inducing panic by giving completely inaccurate fatality rates and pretending like the virus could be contained when it was out of box before anyone realized it. Bad scenario.", "score": 1, "replies": [{"body": "This is like a do-over; hopefully we'll learn this time", "score": 1, "replies": [{"body": "Pretty much", "score": 1, "replies": []}]}]}]}, {"body": "The problem was not the shut-downs -- we reacted like the animals we are and we opened back up.  The problem is that so many are not social distancing and wearing masks, proving that they're incapable of handling a pandemic correctly.  I'm talking about the US, not Asis nor Europe, both of which have open factories, restaurants, etc., and far fewer cases than the US.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "And now undermining the public's faith in testing:\n\nhttps://twitter.com/elonmusk/status/1277507826529660928\n\nUnfortunately the signs are not good that he's going to shut up. Or even make a better effort to educate himself before commenting (which is of course hard to find the time to do when you're running two very demanding companies but that's just one more argument for why he should shut up).", "score": 1, "replies": []}, {"body": "He posted this today:\n\nhttps://twitter.com/elonmusk/status/1276385991616389121\n\nDespite his arrogant statement about it being 'signal' it's really not; it's mostly noise. Rich people (and yes, Tesla owners are still mostly rich people) returning to driving their cars is not significant news. In fact, it could be seen as a negative sign in that people are starting to move around more when it's still mostly not wise to do so (not in the US at least). It's also insensitive of him to make the boast when poor people, people who can't afford Teslas, are much more bearing the brunt of this disease.\n\nSo, he can't help himself and I doubt he will shut up. He thinks he knows better than others on Covid-19 when actually he continues to only demonstrate that, *on this matter*, he is a complete fool.", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I take your point about the graph just being data. What bothered me was the framing he put around it.", "score": 1, "replies": []}]}]}]}, {"body": "Indeed, complete idiot. If only someone smart were running Tesla, SpaceX, Boring, and Neurallink. Then we'd finally have some deep innovation happening", "score": 1, "replies": [{"body": "Your attempted sarcastic dig completely misses the mark. You should have noted where I praised Elon below in this thread for his outstanding achievements with Tesla & SpaceX (and I remain a big fan of what those two companies are achieving). However, being smart in one domain does not necessarily transfer across to another domain and *in the domain of public health* Elon has proved himself profoundly ignorant, deeply lacking in empathy and highly irresponsible in his public commentary.\n\nPeople who think for themselves are able to hold nuanced views of other people, recognising the bad and the good. Other people, unfortunately, become cultists and blind followers. Such people do not help the person they blindly follow; indeed, it is kind of a betrayal, both of themselves and of the person whom they put on a dais.", "score": 0, "replies": [{"body": "You shouldn't label someone an idiot when they do one stupid thing. By that logic, we'd all be idiots.", "score": 2, "replies": [{"body": "Calling someone an idiot means they are acting idiotically in the given context. Pretty much everyone understands that I think. But if you want me to be very clear, no, I do not think Musk is an idiot overall. He's obviously operating at a near genius level in the engineering domain.\n\n> By that logic, we'd all be idiots.\n\nI've certainly been an idiot on numerous occasions in my life, and happy to admit it.", "score": 1, "replies": []}]}]}]}]}]}
