{"title": "Stock Watch List June 1, 2020", "selftext": "Good morning, here's my watch list\n\nGap Ups: AAXN, AESE, CRWD, DKNG, FSLY, GAN, LLY, SWBI, TSLA, VSTO, VTIQ, WORK. WRTC, ZM\n\nGap Downs: PFE\n\nSPY steady grinding higher, stance on stocks bullish as long as SPY holds over the 200 Day Moving Average. Most stocks gapping today lack a good catalyst and many are overbought, some of the gaps could be exhaustion gaps so be aware of what stocks you are trading and what direction you are trading them as stocks that are overbought will have less opportunities to go long the more they get extended. Business as usual. Good luck trading today\n\n&#x200B;\n\nI am not holding any positions in any of the stocks listed above. The purpose of this list is to \"watch\" for opportunities intraday in order to capitalize on short term and intermediate fluctuations in price", "id": "gujypt", "created_utc": 1591015358.0, "score": 183, "upvote_ratio": 0.93, "num_comments": 89, "comments": [{"body": "[removed]", "score": 31, "replies": [{"body": "He doesn't mess with them penny stocks.", "score": 9, "replies": [{"body": "They can be pretty sketchy sometimes. Not the best in terms of safe investing unless you know they have a good future. GNUS will no longer be a penny stock in the next month or so if you ask me but that’s just my opinion.", "score": 9, "replies": [{"body": "I’ve not heard of it. But will do my on DD.  What makes you think that though", "score": 4, "replies": [{"body": "They are releasing their channel called Kartoon Channel. The ceo is the creator of many cartoons we know to this day I believe he co created around 20 different cartoons. They also have merchandise like toys and clothing that are opening as well on the 15th. Look up Andy Heyward.", "score": 7, "replies": [{"body": "Also will be releasing Stan Lee's last project and already has partnered with amazon and Alibaba", "score": 3, "replies": [{"body": "I didn’t even know that! Thanks for the info.", "score": 2, "replies": []}]}]}]}]}, {"body": "Not a penny stock anymore", "score": 1, "replies": []}]}, {"body": "Hold on to it if you can it moving up", "score": 9, "replies": [{"body": "I’m all in on this stock. June 15th it’s about to blow out of the water", "score": 9, "replies": [{"body": "Why's that?", "score": 6, "replies": [{"body": "It’s a digital distribution platform of children’s TV shows.", "score": 6, "replies": [{"body": "Yep just to add on here. Genius Brands already has shows that can be found on Nickelodeon/Nick Jr. If you have kids I'm sure you've heard of a few of them. On June 15th they are releasing their own app/platform, so many of us expect it to really take off after that. (Although it's already been steadily climbing the last 2 weeks or so.)", "score": 5, "replies": []}]}]}]}]}, {"body": "I have no strategies that go by fundamental analysis, but I did get into GNUS today because I had seen it around here, and then my wife randomly mentioned it as a new thing on the horizon for the library she works at so I bought 100 shares, very small percent of my portfolio since I'm not a fundamental guy, but I figured on holding it until the launch June 14th (Got in at $2.53 this morning), see what it does on a daily basis after launch.  Any whisper of bad news and I'll drop it.  Even if it is a long term \"loser\" for me if it blows up.  \n\n  \n\nI'm a bit concerned about the timing of it, it's late to the \"everyone at home\" game, since most stay-at-home is ending, but with a possible second wave on the horizon and being educational in nature I don't think it's a huge risk.", "score": 3, "replies": [{"body": "I did the same thing today... I'm scared !!", "score": 7, "replies": [{"body": "I mean, it's up another 0.57 today, it'll likely continue a slow climb until launch, unless they make some announcement about a delay or something.  I really don't think it's a risky stock until after launch.  Just be vigilant with it and at any sign of a major pull back just drop it.  At worst you can jump back in to a bottom if it starts rising again.", "score": 3, "replies": [{"body": "Thanks Budddy!!!!!", "score": 3, "replies": []}]}, {"body": "Me too!", "score": 2, "replies": []}]}]}, {"body": "Yessssssir. June 15th is the day the app comes out. After that, this shit is taking offfff (I hope)", "score": 4, "replies": []}, {"body": "This is what I come to this sub for. Affordable stocks with big potential. Thank you sir.\nAlso nice name", "score": 2, "replies": []}, {"body": "Got in at 1.410 .  Interested to see where this goes. June 15th baby. Let’s see some green.", "score": 2, "replies": []}, {"body": "Upon a quick view on the charts, at one point it was over $200, what happened? Is it gonna crash again like that in the future?", "score": 2, "replies": []}, {"body": "[deleted]", "score": -3, "replies": [{"body": "What makes you say that? Their website seemed pretty well set up to me.", "score": 2, "replies": []}]}]}, {"body": "Like $GAN and $WORK myself not a bad list you got there though. I'll pick up DKNG again when it dips into the ~$35 range", "score": 28, "replies": [{"body": "I've said this twice about DKNG at lower price. Decided to buy in at 33.80 and I'm glad I just did it.", "score": 47, "replies": [{"body": "Bought in at 400@29 and sold @39 Friday too steep of a climb too fast for me. If it settles back down I'll grab some more Id like the mid to low 30s price an some slower climbs towards 50 as  sports open but we will see what the rest of the market wants lmao", "score": 13, "replies": [{"body": "Weird strategy to sell at 39 if you want to buy back in the mid 30s. Its a difference of a few bucks, and at this point it is going up a few bucks every day so you're missing these gains in the meantime.", "score": 13, "replies": [{"body": "Sold to buy into $GAN at open with the initial inv. along with profits I made off  $DKNG", "score": 4, "replies": [{"body": "I did the same thing, bought 43 @ 23.14 and I’m feeling pretty good. I could see this doubling within a few months, especially when sports come back into play", "score": 3, "replies": [{"body": "Some good MLB news will send them all going up but still got NHL playoffs rolling so slowly but surely the rest of the sports will pick up not to mention eSports and people underestimate that entire market.", "score": 3, "replies": [{"body": "Agreed! Igaming is the future of gambling. They only have licenses in 3 sports. I don’t see how this stock can lose you any money right now. When all the sports come back, I could see the stock doubling even tripling. Why bet DKNG when you can invest in GAN which is essentially betting on the entire gambling industry instead of one company.", "score": 2, "replies": []}]}]}, {"body": "Fair. I own both and don't see myself getting rid of either any time soon.", "score": 2, "replies": []}]}]}]}, {"body": "Same as you here , but I bought it at $38 and it is still going up. I'm really curious how long this rally is going to be , but I think the stock really has potential to double until November. Holding it long", "score": 6, "replies": [{"body": "100% agree. I said this 3 weeks ago and im up 65%. Have a 12% trailing stop on it but might even make that lower. My 12mo price is around $38 and it’s blowing past that. I’m not buying anywhere above $30. I bought this as a slow growth and it’s taking off like the Goodyear blimp.\n\nEdit: cost basis $26", "score": 6, "replies": [{"body": "I bought when it was still $DEAC, wish I  bought more... up 106% so far.", "score": 5, "replies": [{"body": "That’s sick haha", "score": 1, "replies": [{"body": "Cost here was $28, DKNG has a lot more than fundamentals pushing it up, especially without even reporting earnings.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "DKNG is on the list because it is extended/overbought and gapping up which could possibly provide a potential short opportunity", "score": 8, "replies": [{"body": "Thanks for the tip! It's been a nice little profit so far once it topped out!\n\nWhat do you think the price target on the short should be?", "score": 1, "replies": [{"body": "I'm mainly looking for short opportunities for day trades because it is overbought. If I were to hold a short on a strong stock, like this my first target would be around short term moving averages to see how it reacts. It really has potential all the way back down to around $18, even $10 as there's no real support anywhere. There is rising moving averages though so those would be temporary.", "score": 2, "replies": [{"body": "Yeah I don't trust the TA on DKNG tbh because it's a meme stock and nothing matters on any analysis lol. \n\nI took a nice $100 profit today. May buy back in if it gets back up above $43 again. \n\nI'm a little skiddish with stocks like these after getting wrecked by zoom lol\n\nWhat's your method for determining if a stock is overbought? I've similarly been having success like this but I have mainly been focused on the stocks that I know how they behave. I've done well with ENPH being a long and then shorting it. Riding it back up, shorting back down.", "score": 1, "replies": []}]}]}]}, {"body": "Man I bought DKNG that first day of IPO, and for about the last month or so I've been heavily regretting not buying more. Before it hit $30 I was really waiting for it to drop back into the $25 range. I'm starting to think I shouldn't hold my breath and just get more now.", "score": 3, "replies": [{"body": "I’m exactly the same...", "score": 2, "replies": []}]}]}, {"body": "VTIQ should rocket crazy tomorrow after its merger  and become NKLA", "score": 10, "replies": [{"body": "Why do you think so? Don’t mean that in a rude way I am just uneducated about the merger.", "score": 2, "replies": [{"body": "1) they do have a high amount of interest of investors from all over. 2)Sure Hydrogen is a complex source, but with how everything is shifting, the change for a set infrastructure as well as potential future federal resources to provide 3)larger growing talent pool of energy engineers 4)The stock market doesn't makes sense and its about to go up for no stupid reason.", "score": 5, "replies": []}]}, {"body": "I saw the spike... I'm wondering if I should go in..... ANYONE ELSE HAVE ADVICE FOR VTIQ.  Is it too late for my broke ass?!", "score": 2, "replies": [{"body": "I would gamble on it, it'll be worth it.", "score": 5, "replies": []}]}]}, {"body": "I picked up CRWD and DKNG last week. Feel pretty good about CRWD. Might sell DKNG.", "score": 7, "replies": [{"body": "Right on", "score": 1, "replies": []}]}, {"body": "DGLY is kicking it today", "score": 12, "replies": [{"body": "Fuck, my order didn't go through at $1.20 and I had to buy at $2.26........missed out on that first jump, but hoping it keeps going!!", "score": 8, "replies": [{"body": "same :(", "score": 2, "replies": []}, {"body": "I bought 15 at $.88 last week. Put in an order for 20 more at $1.10 Friday afternoon. Didn't go through and market opened this morning so fuck that. \n\nI put in another order for 20 at $2.15 but doubt it goes through.", "score": 1, "replies": [{"body": "Damn, doof call on that $.88 last week!! Well I'm still holding out hope that it keeps on rising. Hopefully you get that dip and have your order go through!", "score": 4, "replies": [{"body": "Yeah I mean I don’t have enough capital to really be messing with stocks this volatile. I have had a few thousand in ETFs for a few years but just got into the stock market last week. Beginners luck I think. \n\nPart of me hopes the order doesn’t go through and I can just ride this $.88 price to a quick $30-40 profit on the 15 shares. Free money.", "score": 2, "replies": [{"body": "I hear ya. Well best of luck regardless! We're in it to make a decent profit!", "score": 3, "replies": [{"body": "That’s the goal!", "score": 3, "replies": []}]}]}]}]}]}, {"body": "Don't know much about DGLY and its industry, is it because of protests?", "score": 2, "replies": [{"body": "Digital Ally. They make body and window cams. So yes. I bought it the day of the Floyd shooting at $.88. Hit highs today of several dollars, believe it got close to $5. Currently sitting around $2.30.", "score": 2, "replies": [{"body": "Thanks for explaining! Also congrats on the gains!", "score": 2, "replies": [{"body": "Not many gains, I bought a small amount of shares. I just entered the stock market last week so I am still learning! Beginners luck!", "score": 9, "replies": [{"body": "I entered roughly 6 months ago. It's super interesting early on. Enjoy it!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Do you post this everyday ?", "score": 6, "replies": [{"body": "Every day the market is open", "score": 2, "replies": []}]}, {"body": "Yessss DKNG and FSLY have been amazing for me ever since I bought, up every day.", "score": 4, "replies": []}, {"body": "The more people talk about a stock, the further away you should stay. DKNG is way too overhyped right now", "score": 3, "replies": [{"body": "When a stock is extremely overbought and gapping up like on this list, we look for short opportunities.", "score": 1, "replies": []}]}, {"body": "Why is it important to watch \"gap ups\" or \"gap downs\"?", "score": 3, "replies": []}, {"body": "I have my eyes on pfe, They will spinoff their generic component, it might be good to buy more pfe to accumulate shares of their spinoff.", "score": 2, "replies": []}, {"body": "Thank you!", "score": 2, "replies": [{"body": "You're welcome!!", "score": 1, "replies": []}]}, {"body": "Sunk a few hundred into ZM and its bumped 40% since then. Every week debating whether to just snag the profit but it keeps going up.", "score": 2, "replies": [{"body": "Snag part when in doubt. Worst case, lock in the 40% increase and let the rest ride.", "score": 7, "replies": [{"body": "I'm worried about the price-earning ratio making the company overvalued. It's ridiculously high. I think it's going to shoot up in the morning tomorrow but then it will decrease heavily. I was heavy on ZM during early March but now I feel like it's maximized its price potential. I don't really see any huge changes to their platform that will allow them to reach heavily. I believe it will hover at 150-160 for the time, potentially lower.", "score": 2, "replies": []}]}]}, {"body": "Bought CRWD a few months ago. 67% Up, do people recomend Sell, hold or buy?", "score": 2, "replies": [{"body": "Keep with Earnings tomorrow, think it will hit 100 prior tomorrow and follow zs and take off", "score": 5, "replies": [{"body": "Thanks bro", "score": 1, "replies": []}]}]}, {"body": "Dkng is such a bubble, people who jump in now: read up about 2001/2002 tech bubble..", "score": 3, "replies": []}, {"body": "No one talking about VSLR? It dipped for a while but now it’s climbing..", "score": 1, "replies": []}, {"body": "Thank You Dr. Burry...SPWH\n\nIt took two years but I’m happy with the result", "score": 1, "replies": []}, {"body": "ONEM", "score": 1, "replies": []}, {"body": "No options for GNUS?", "score": 1, "replies": []}, {"body": "Got it at 1.40 it’s projected to easily pass 4.00 I would buy and hold I currently am up $700 huge potential I recently started doing stocks this reddit and the tools/ math for probability is at the tip of ur hands it’s such a big spike there is no forecast for this. My bet is to hold and wait for June 15th even tho a quick buck might sound nice high risk high reward 🙂 (4.50 median expected)", "score": 1, "replies": []}, {"body": "$RGR", "score": 1, "replies": []}, {"body": "I bought TBIQ at $30.90 this morning and I had to chase it for a whole minute a whole 50 cents until my order filled! The company is going to do quite well I believe it's going to jump on Wednesday because they're merging with Nikola a company that is competing with Tesla and their cars look gorgeous. It jumped 7% since my purchase this morning and the only other company I have as much faith in is this one is genius. I have a feeling that both of those are going to rise up a lot", "score": 0, "replies": []}]}
{"title": "Long $AMZN", "selftext": "[removed]", "id": "gukbb5", "created_utc": 1591016790.0, "score": 2782, "upvote_ratio": 0.97, "num_comments": 83, "comments": [{"body": "This sounds like some Lex Luthor & Joker movie plot", "score": 146, "replies": [{"body": "Bezos does look like Lex. I wonder if he took down superman already using blue origin.", "score": 35, "replies": [{"body": "lex isnt stupid enough to lose 40 billion in a divorce rape tho", "score": 18, "replies": [{"body": "Maybe is part of his plan.", "score": 6, "replies": [{"body": "So getting caught was part of that?", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Well, she was also working at the quant investment fund", "score": 2, "replies": []}]}]}]}, {"body": "He’s already bald so he fits the role for Lex", "score": 8, "replies": []}, {"body": "I can imagine the Penguin and his shit ice bird army throwing literal bird shit at Barnes and Nobels.", "score": 2, "replies": []}]}, {"body": "Sending pallets of bricks via prime to protests to take down the brick and mortars.\n\nCant lose.", "score": 106, "replies": [{"body": "Literally throwing their own buildings back at them. Kind of cannibalistic", "score": 16, "replies": []}]}, {"body": "amazon doesn't care about brick and mortar, their next strategy is probably selling logistics and SaaS to brick and mortar, Their strategy has always been to enable small businesses to take out medium or large competitors.", "score": 54, "replies": [{"body": "This. People complain about Amazon “killing small businesses”, but in reality a lot of the vendors selling on Amazon *are* small businesses, or at least smaller than their brick and mortar competitors like Walmart or Target. Platforms like Amazon give small business a way to compete now that brick and mortar retail has been dominated by larger chain stores.", "score": 43, "replies": [{"body": "This is contrary to my understanding that Amazon finds popular products by small vendors, creates their own ‘Amazon Brand’, pushes the existing product down search rankings and sells their own.\n\nHave you ever heard of that?", "score": 26, "replies": [{"body": "that is a small segment of their whole ecosystem.", "score": 19, "replies": [{"body": "Well yeah, nobody sees the original anymore", "score": 3, "replies": []}]}, {"body": "Some of that happens, but before Amazon knows to make their own brand of an item if they are interested (just like your grocery store will make their own brand of certain things) people will still buy the highest reviewed item or brand item they find loyalty with (Duracell vs Amazon batteries for example.. it's not like theres a lot of people going to duracell.com or something).\n\nAlso small business owners typically have the tiniest fraction of Amazon's traffic so it's likely a lot more exposure even if Amazon does make their own brand.  And because there's so many prime subscriptions that means free shipping on small items which is hard to compete with on their own store.", "score": 5, "replies": []}, {"body": "I make up my own facts and then argue.", "score": 12, "replies": [{"body": "To be fair the comment I responded to didn’t produce any solid evidence for their own assertions.\n\nI can at least find a few news articles on this topic. I seem to remember a Planet Money episode about it as well.", "score": 9, "replies": []}]}, {"body": "That's standard competition, and not what the op was suggesting imo. The prior OP was talking about the overall platform being a SHOP-loke haven for small merchandiser entrepreneurs, not new product creators. I partially agree with that claim.", "score": 2, "replies": []}, {"body": "I doubt they'd artificially rank their own products higher, but what they can do is sell at a lower markup, since they don't lose money on fees to themselves. They can all buy ads for their own products for free, which does show up at the top of search listings.", "score": 1, "replies": [{"body": "They can also exclude the competitive product from being “Prime”, basically making it a pariah.", "score": 4, "replies": []}]}, {"body": "Yours is the correct understanding. Everyone trying to defend it has their ass so far up the invisible hand that it's technically oral at this point.", "score": 0, "replies": []}]}]}, {"body": "Until those small businesses become the big biz and then amazon really turns the screws lol.", "score": 1, "replies": []}]}, {"body": "Two words. Commercial. Insurance. #fundingsecured\n\nEdit: A lot of you really are some dumb mthrfckrs 🤣", "score": 35, "replies": [{"body": "Yeah but it’s still presumably more market share for amazon while the brick and mortar stores rebuild. \n\nBrick and mortar won’t get all those customers back.", "score": 13, "replies": [{"body": "Not the point. The point is that these businesses were already struggling and now they get to cash in checks and receive supplemental income during reconstruction. If they were struggling with the commercial rent then they just found a way to climb out of the hole while also waiting for things to return to a normal for the summer. WiN.", "score": 8, "replies": [{"body": "So....they're gonna use the insurance money they get to pay their rent....now, what money do they use to fix their looted store?", "score": 4, "replies": [{"body": "Do you people not have insurance? Insurance at least good commercial liability would pay for everything commercial insurance usually has a cap in the millions and covers the leasing of the building while they are closed for repairs.", "score": 7, "replies": [{"body": "It’s a bunch of stupid high schoolers and college freshman that think they now know everything cause they bought their first car.", "score": 4, "replies": [{"body": "I think you mean their 2 dads bought it for them", "score": 5, "replies": []}]}]}, {"body": "Commercial insurance typically has stuff in it regarding interruption of business, so the claim would include a few months of future rent.", "score": 4, "replies": [{"body": "There are GOP bills to limit liability exposure for insurance issuers, if I'm not mistaken. Beware.\n\nhttps://www.insurancejournal.com/news/national/2020/05/15/568729.htm", "score": -1, "replies": []}]}, {"body": "They pay to fix the building and then thru supplemental income from disruption of business they can pay off past expenses. That’s on top of potential gov money they could’ve received.", "score": 1, "replies": []}]}, {"body": "This post is literally about amazon", "score": -1, "replies": [{"body": "The post is a joke. I made a joke. I then clarified on my joke after a comment on my joke cause my joke was actually based in truth and reality. The post is about Amazon. But comments are about comments. Welcome to Reddit small brain.", "score": 1, "replies": []}]}]}]}, {"body": "One word. Deductible.", "score": 5, "replies": [{"body": "Bunch of words. 1.7 trillion dollar government pandemic plan to small businesses.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "That one actuary who saw the writing on the wall.", "score": 3, "replies": []}, {"body": "Exactly. The chance that the insurance industry actually covers their insured is practically zero, especially when the anti-socialist capitalist crew demands government assistance. “Stimulus” isn’t socialist, right?!?", "score": 1, "replies": [{"body": "Insurance industry will cover what is in their contract.  This isn't a gotcha moment.  Read your insurance contract and figure out if you're willing to face those exclusions.", "score": 1, "replies": []}]}, {"body": "You presume I commented that without knowing insurance. 😂🤣 bye bye 👋", "score": 0, "replies": []}]}, {"body": "short brk? who sells small business insurance??", "score": 2, "replies": [{"body": "Most insurance agencies do. It’s large commercial that is more exclusive.", "score": 1, "replies": []}]}, {"body": "Have you heard of deductables?", "score": 1, "replies": [{"body": "There are so many answers to this honestly. So if you aren’t even aware of one of them then you probably aren’t worth the time it would take to explain.", "score": 1, "replies": []}]}, {"body": "Faux news quickly retracted that the stores had insurance lol.", "score": 1, "replies": []}, {"body": "They wont get their money until months later at which point many wont be able to survive.", "score": 1, "replies": [{"body": "They won't get Jack shit, u/thorsbew24 is right.", "score": 1, "replies": []}, {"body": "This is true in some cases, but not with these.", "score": 1, "replies": []}]}]}, {"body": "Free shit for everyone doesn't help amazon imo. People gonna just be reselling shit on craigslist and facebook  marketplace at cutthroat prices. Target and the rest are likely insured and probably happy they can just write this shit off. The biggest losers are the  restaurants who lose weeks months of sales.", "score": 5, "replies": []}, {"body": "this but un-ironically", "score": 5, "replies": []}, {"body": "Kick em while they're down", "score": 4, "replies": []}, {"body": "Speaking my language. As for me and my household, we own a very disproportionate portfolio of Amazon.", "score": 3, "replies": []}, {"body": "Today was recycling day in my neighborhood.. Almost every house has amazon boxes and or chewy boxes.. chewy.. burns my ass i didnt get them a few months ago:/", "score": 3, "replies": []}, {"body": "Long amzn? You son of a bitch, I’m in", "score": 3, "replies": []}, {"body": "Search your WaPo headlines you know it to be true.  Also those leaked documents from the Amazon conglomerate about race and unionization.", "score": 7, "replies": []}, {"body": "AMZN doesn't need to literally destroy competition to figuratively destroy competition", "score": 4, "replies": []}, {"body": "FAKE NEWS!!!", "score": 7, "replies": []}, {"body": "Its a lot more believable than the rest of the conspiracies floating around.", "score": 2, "replies": []}, {"body": "Everything is so wild right now that this idea doesn’t even sound too crazy", "score": 2, "replies": []}, {"body": "I'm thinking 8/21 3000, looks pretty saucy", "score": 2, "replies": []}, {"body": "Lmao", "score": 2, "replies": []}, {"body": "Lmao genius!", "score": 2, "replies": []}, {"body": "Small business seem to be the ones protests protect. Target or somthing corporate they dont give a shit.", "score": 3, "replies": []}, {"body": "Brick and mortar was already dead before this", "score": 1, "replies": []}, {"body": "Amazon delivery trucks are getting fucked too. Saw a video where people just threw the driver out and ransacked it completely.", "score": 1, "replies": []}, {"body": "They would do a lot more damage if they started a second waive lockdown which is probably a lot easier work .", "score": 1, "replies": []}, {"body": "They don’t need riot to wipe out brick and mortar, beervirus is doing a great job at it", "score": 1, "replies": []}, {"body": "I think the riots should take down a few amazon supply centers to be fair and support equality in it's fullest form, also because amazon is a shitty company that doesn't care about their employees and is slowly destroying the global economy one box store at a time and I feel like it's already too late but I digress.", "score": 1, "replies": [{"body": "All the fulfillment centers are in the middle of industrial parks way the f out there", "score": 2, "replies": [{"body": "....it wasn't a real request...really?", "score": 1, "replies": []}]}]}, {"body": "Question for me is, who manufactures Americans CS gas, cause they are using it like candy.", "score": 1, "replies": []}, {"body": "amzn trucks are getting looted as well", "score": 0, "replies": []}, {"body": "This is incredibly insulting", "score": 0, "replies": []}, {"body": "I uh, doubt it will work.", "score": 0, "replies": []}, {"body": "Amazon closed some of its shipping centers because of the riots. Your logic fails.", "score": -4, "replies": [{"body": "When has Amazon had an issue with short term losses?", "score": 8, "replies": []}, {"body": "Which ones?  I didn't hear anything about that", "score": 1, "replies": []}]}, {"body": "Will the followings change your mind?\n\nTumultuous June -- ‘Cleansing correction’ could spark a 10% drop or more within weeks, Federated’s Phil Orlando warns [https://www.cnbc.com/2020/05/21/cleansing-correction-may-strike-stocks-within-weeks-phil-orlando.html](https://www.cnbc.com/2020/05/21/cleansing-correction-may-strike-stocks-within-weeks-phil-orlando.html)\n\nStupid to jump on the rally bandwagon? Mark Cuban thinks so -- Market is overvalued during pandemic [https://decrypt.co/29063/mark-cuban-suggests-stocks-are-overvalued](https://decrypt.co/29063/mark-cuban-suggests-stocks-are-overvalued)\n\nBoA Is Stupid? Why is Bank of America Betting Against This Rally? [https://stocknews.com/news/spy-why-bank-of-america-may-be-right-about-betting-against/](https://stocknews.com/news/spy-why-bank-of-america-may-be-right-about-betting-against/)\n\nBoA gives 4 reasons it turned tactically bearish on stocks after a 30% rally [https://markets.businessinsider.com/news/stocks/stock-market-bearish-bofa-gives-reasons-tactically-after-rally-2020-5-1029203921](https://markets.businessinsider.com/news/stocks/stock-market-bearish-bofa-gives-reasons-tactically-after-rally-2020-5-1029203921)\n\nGoldman: U.S. stock market rally from March lows won’t last [https://www.marketwatch.com/story/heres-why-the-unloved-but-welcome-us-stock-market-rally-from-march-lows-wont-last-goldman-says-2020-06-01-910308](https://www.marketwatch.com/story/heres-why-the-unloved-but-welcome-us-stock-market-rally-from-march-lows-wont-last-goldman-says-2020-06-01-910308)\n\nGoldman Sachs says stocks will tumble 18% in the next 3 months — and lays out 6 risks it thinks investors are ignoring [https://markets.businessinsider.com/news/stocks/stock-market-outlook-6-reasons-for-more-selling-goldman-sachs-2020-5-1029188273](https://markets.businessinsider.com/news/stocks/stock-market-outlook-6-reasons-for-more-selling-goldman-sachs-2020-5-1029188273)\n\n\\- Goldman Sachs expects the S&P 500 to close the year 2% higher, but not before enduring an 18% plunge over the next three months.\n\n\\- The stock market's recent leap from late-March lows is best attributed to investors' \"fear of missing out,\" the team of analysts led by David Kostin wrote on Friday.\n\n\\- The S&P 500's lofty valuation faces several near-term threats before economic stabilization in the third quarter pushes it higher, the firm added.\n\nGoldman Sachs thinks a big correction is coming... [https://fortune.com/2020/05/12/goldman-sachs-thinks-a-big-correction-is-coming-so-far-investors-arent-buying-it/](https://fortune.com/2020/05/12/goldman-sachs-thinks-a-big-correction-is-coming-so-far-investors-arent-buying-it/)\n\n&#x200B;\n\nThis is the trap awaiting the stock market ahead of a grim summer, warns Nomura strategist [https://www.marketwatch.com/story/this-is-the-trap-awaiting-the-stock-market-ahead-of-a-grim-summer-warns-nomura-strategist-2020-05-05](https://www.marketwatch.com/story/this-is-the-trap-awaiting-the-stock-market-ahead-of-a-grim-summer-warns-nomura-strategist-2020-05-05)\n\nCraig Johnson, Piper Jaffray & Co Chief Market Technician: meaningful market correction could be coming [https://www.cnbc.com/video/2019/07/23/johnson-meaningful-market-correction-could-be-coming.html](https://www.cnbc.com/video/2019/07/23/johnson-meaningful-market-correction-could-be-coming.html)\n\nStock Market Crash Round 2 Is Coming. Sorry, folks, but we're in the midst of a bear market rally with further downside to come. [https://www.fool.com/investing/2020/05/14/opinion-stock-market-crash-round-2-is-coming.aspx](https://www.fool.com/investing/2020/05/14/opinion-stock-market-crash-round-2-is-coming.aspx)\n\nHere's Why Two Market Sell-Offs Are Coming This Year, Top Advisor Says [https://www.investors.com/etfs-and-funds/etfs/market-correction-why-two-market-sell-offs-coming-year-top-advisor/](https://www.investors.com/etfs-and-funds/etfs/market-correction-why-two-market-sell-offs-coming-year-top-advisor/)\n\nUS-China War will trigger a crash soon? Expect a sharp correction before market forms a bottom: ‘Cues for the markets will come from the global situation’... [https://economictimes.indiatimes.com/markets/expert-view/expect-a-sharp-correction-before-market-forms-a-bottom-ajay-bagga/articleshow/75559699.cms](https://economictimes.indiatimes.com/markets/expert-view/expect-a-sharp-correction-before-market-forms-a-bottom-ajay-bagga/articleshow/75559699.cms)\n\nU.S. stocks are trading at pricier valuations relative to corporate profits than at any point since the dot-com bubble in 2000 and these measures are flashing warning signs, even when completely ignoring the short-term impact of the COVID-19 epidemic and instead focusing on next year’s economy, analysts warn. [https://www.marketwatch.com/story/the-stock-market-is-pricier-than-its-been-since-the-dot-com-bubble-even-as-earnings-forecasts-continue-to-plunge-2020-05-06](https://www.marketwatch.com/story/the-stock-market-is-pricier-than-its-been-since-the-dot-com-bubble-even-as-earnings-forecasts-continue-to-plunge-2020-05-06)\n\nThere was already what he refers to as the “Central Bankers’ Bubble” before the coronavirus. “We’ve seen this movie before: sky-high real estate prices, sky-high stock market prices and a giant debt bubble,” Kirsner said. “We know how this movie is going to end, we just don’t know when.” [https://www.huffingtonpost.ca/entry/second-stock-market-crash-coronavirus\\_l\\_5ebddf9bc5b698a29045d35e](https://www.huffingtonpost.ca/entry/second-stock-market-crash-coronavirus_l_5ebddf9bc5b698a29045d35e)\n\nBear market rally or new bull?\n\n\\- Going by the conventional Wall Street definition, the S&P 500 will remain in a bear market unless and until the index recovers to the February high.\n\n\\- Nearly 70% of the participants in Bank of America’s monthly global fund manager survey called the recent rebound a bear market rally.\n\n\\- The 2020 market top differs in character with a typical bear market.\n\n[https://www.cnbc.com/2020/05/22/bear-market-rally-or-new-bull-breaking-down-the-market-after-another-winning-week.html](https://www.cnbc.com/2020/05/22/bear-market-rally-or-new-bull-breaking-down-the-market-after-another-winning-week.html)\n\nThere’s a 72% Chance That We’re Nearing a Major Stock Market Correction\n\n\\- The S&P 500’s trading range suggests a drop on the horizon.\n\n\\- There are plenty of sell-side triggers coming up.\n\n\\- The market lacks commitment, and that means one misstep could set off an avalanche of selling.\n\nThe stock market's flimsy rally is going to come crashing down according to 72% of similar markets in the past.", "score": -3, "replies": [{"body": "Outdated info:\n\n[Goldman Sachs rolls back pessimistic outlook for American stocks.](https://i.redd.it/bmc38bk0ha251.jpg)", "score": 2, "replies": []}]}]}
