{"title": "Why it was always going to be a v shaped recovery", "selftext": "In late March I posted to here and r/options (gross) that I foresaw a v shaped recovery and wanted to buy LEAPS on everything hardest hit (restaurants, oil, live entertainment, etc.)\n\nhttps://www.reddit.com/r/wallstreetbets/comments/fpnc8r/the_stuff_dreams_are_made_ofthe_opportunity_for_a/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nmy two main theses for going long and predicting a v-shaped recovery:\n\n1. If you’ve ever done a DCF valuation you know that one down year doesn’t affect a company’s valuation that much. Hell, even if you’ve never done a DCF, you know many of these companies have been around for decades and will be around for decades more. the prospect of one down year shouldn’t take 60% to 80% off your market cap unless you’re levered to the hilt. \n\n2. It’s Donald Fucking Trump. He will do anything to get re-elected. He’s not gonna let the economy be in the shitter come November 3rd. This is a guy who’d never run for President, never held public office, never served in the military, who you’d get laughed out of polite conversation for suggesting he might win, who beat Jeb Bush, Ted Cruz, Marco Rubio, and Hillary Clinton in a single election cycle. Of course it was gonna be a v-shaped recovery. I know this sub dislikes him but betting against him has been a losing bet for the past 5 years.", "id": "ha29zf", "created_utc": 1592307348.0, "score": 7, "upvote_ratio": 0.56, "num_comments": 87, "comments": [{"body": "[deleted]", "score": 14, "replies": [{"body": "DCFs are easy and pretty useless in the current economy with this degree of uncertainty of future periods\n\nRetard just finished his online finance degree and thinks he knows more than Buffett", "score": 1, "replies": []}, {"body": "Retard thinks DCF’s are hard to do. Also no one really uses them tbh, mostly just comps / multiples. EV / EBIT, EV / EBITDA", "score": -10, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "I never said I “can do a DCF” like it’s some sort of accomplishment or like it’s what the market is trading off. DCF’s, like most forms of valuation, are make believe anyway. If a company wants a valuation, a banker can find some sort of metric to get them there. Look at WeWork’s community adjusted EBITDA\n\nThe point is that the concept that underpins a DCF (perpetuity growth) is the same concept that tells you that a company’s equity value shouldn’t crater by 80% because of a seasonal virus that results in one year of shit revenues (unless the company is insanely levered)\n\nIf your dad is gonna give you $1 a year for the next 100 years, but one year it’s 30 cents instead of a dollar, should that stream of cash flows suddenly be worth 80% less?", "score": 0, "replies": [{"body": "I understand your point, but it's completely wrong. Explain then, using your logic, how LVS went from $135 in 2007 to under $1.50 in 2009. That is a 99% drop. Or an even better example is CCL, who went from $51 in late 2007 to $15 in late 2008 - a 70% drop, when revenues (and profits) were just as good as the previous year. In 2008, CCL bookings were still at [105% max capacity](https://www.cbsnews.com/news/carnival-cruise-ignores-recession-continues-ship-building/).", "score": 1, "replies": [{"body": "A financial crisis is very different than a pandemic. A pandemic is more like a natural disaster. A defined problem with a relatively defined timeline and relatively defined measures you can take to mitigate it.\n\nA pandemic is like you own a restaurant and you have to shut down in person dining for a few months (but can still do deliveries) and then reopen with lower capacity. A financial crisis is like you own a restaurant and most of the value is in the building which is worth $1m and you owe $600k on it but it turns out the building is actually only worth $250k and you owe $600k on it and the bank is seizing it on Tuesday.\n\nIn 2008, LVS was losing $1,000 a second and Sheldon Adelson had to lend the company a billion dollars of his own money so I don’t think you’re right about their financials being the same", "score": 2, "replies": [{"body": "That is why I said CCL is a better example. Even so, it doesn't justify LVS dropping by 99 fucking percent LOL. Leaving aside LVS though, what about CCL and virtually every other super profitable company? CCL dropped 70% in one year - from $51 to $15. Bookings, revenues and profits were actually very slightly up YoY. There are dozens of these types of examples from 2008.\n\nAlso, I agree that a pandemic is different than a financial crisis. Still though. COVID is different because it caused one quarter of closures, and we all know how the debt machine works. It doesn't stop or pause, which causes companies to take on much more debt thus heavily increasing the risk of bankruptcy...which is the same as a financial crisis.", "score": 2, "replies": [{"body": "Well maybe long this recovery and short the seemingly impending financial crisis. Also maybe CCL & LVS valuation was something insane on a multiple basis pre-2008. Would also have to look at the balance sheets at the time", "score": 1, "replies": [{"body": "No financial crisis when the Fed is backstopping everything while the government hands out money. Should cause inflation but that will take a while and is a topic for another discussion. My point is this is the reason why everything is going up and will continue to go up, not because of DCF models. A one year loss (even a few months) **does** matter because imagine the debt pile up (as we saw in the case of Hertz and dozens of other companies).", "score": 2, "replies": [{"body": "if you are overlevered like HTZ / CHK sure", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "No one is running DCFs in this market my man. How do I know? CAPE is outrageously high. Market has moved away from a valuations methodology and moved into price momentum. Think about it like selling/buying art. No intrinsic value, just the idea that someone will pay more tomorrow for it. I know this is true as you couldn't put a DCF together with even best case scenario to generate valuations seen on BA, airlines, half the restaurants, draft Kings, PTON, etc. \n\nDonny doesn't have as much power as you think. First, you need fiscal stimulus, which Mitch has taken a wait and see approach. Secondly, even if they did get it, people forget how much revenue/earnings come from non-US companies. ECB is in ruins. Good luck spuring Japan, who was fighting deflation in a growing global economy. \n\nFollks are super optimistic imo. Consumer behaviors are changing.", "score": 22, "replies": [{"body": "Dow futures up 1,000 points. Do you want to be right or rich", "score": 7, "replies": [{"body": "Cool so do weekly calls. I'm game. Just hope the music doesn't turn off the week you decide to to big.", "score": 2, "replies": [{"body": "I think of it as having a directional view of where the market is going overall (and not changing that view unless there’s a really compelling reason). So if I think the market is heading up, buy calls 1 to 3 months out (or weekly if I want to be super aggressive). If the market is down 800 points on a given day, rather than get spooked and sell, use it as an opportunity to buy cheap calls or short VIX", "score": 1, "replies": [{"body": "Agreed. If VIX hits 28 again I'm buying calls again. \n\nIm usually theta gang - so I'm fine with the market moving either way", "score": 1, "replies": [{"body": "Yeah the worst thing I see on here is people who jump from one market view to the other and get fucked in both directions. If you remain long you will eventually catch the market on a day when it nearly limits up If you remain short you will eventually catch the market on a day it nearly limits down \n\nIf you switch back and forth it’s less likely that you’ll time it right and more likely that you’ll get screwed in both directions", "score": 1, "replies": []}]}]}]}]}, {"body": "Fair, I’m not saying everyone should create a DCF before every trade, just that the same principle that underpins a DCF (assuming that something grows in perpetuity) would also suggest that a single down year ought not wipe away 70%, 80% of your equity value (unless you are insanely overlevered)", "score": 2, "replies": [{"body": "Something something, the markets can stay irrational longer than you can stay solvent.", "score": 3, "replies": []}]}, {"body": ">Think about it like selling/buying art. No intrinsic value, just the idea that someone will pay more tomorrow for it. \n\nI'm getting this tattooed.", "score": 1, "replies": []}]}, {"body": "But it hasn’t really been a v shaped recovery for the hardest hits sectors (so far). Finance, entertainment, restaurants airlines etc are still scraping the bottom. The overall market being very heavy on tech and services has seen a V shaped recovery though.\nThose hard hit sectors will come back, on after another, airlines probably last if ever.", "score": 5, "replies": [{"body": "PLAY is up 4x off its lows\n\nMGM is up 3.5x off its lows\n\nPENN is up 9x\n\nObviously it’s nearly impossible to catch the local bottom, but even just buying or dollar cost averaging around the reddest days you’d be way up, especially on LEAPS", "score": 1, "replies": []}]}, {"body": "EAT is still down about 30%, heading upward all the time. Still some great buys out there.", "score": 2, "replies": []}, {"body": "[removed]", "score": 2, "replies": [{"body": "When did Trump run for President before?", "score": 1, "replies": [{"body": "He talked about planning to run previous times, but I don’t think he ever actually did the paperwork to run.  They were most likely publicity stunts.", "score": 2, "replies": [{"body": "Yeah he teased it a few times", "score": 1, "replies": []}]}, {"body": "2020 and 2024", "score": -1, "replies": []}]}]}, {"body": "wwwwwwww shaped recovery.", "score": 2, "replies": [{"body": "To some extent, sure.\n\nBut PLAY is up 4x off its lows\n\nMGM is up 3.5x off its lows\n\nPENN is up 9x\n\nPretty much every oil stock up 2x\n\nMany other examples. Obviously it’s nearly impossible to catch the local bottom, but even just buying or dollar cost averaging around the reddest days you’d be way up, especially on LEAPS. Maybe it’s because most people here trade options but it usually takes a very long time for most stocks to 2x or 3x of 4x. Many have done so in a matter of weeks", "score": 1, "replies": []}]}, {"body": "I don’t know what you typed here but I know that as long as Donald Pump is in office nothing will make stonks go down short of WW3 which is why my entire portfolio is in Dave and Busters.\n\nRip grandma", "score": 2, "replies": [{"body": "Hahahahaha", "score": 1, "replies": []}]}, {"body": "Hmm this post doesn't have the amount of down votes I thought it'd have.... you even referenced he who shan't be spoken lest a tidal wave of down votes is what you seek.... hmm... sentiment so mixed lately...", "score": 2, "replies": [{"body": "Yeah people are very weird about him", "score": 1, "replies": []}]}, {"body": "Donnie Pump won't let that shit slide.", "score": 2, "replies": []}, {"body": "This guy gets it. The only reason we're even in this kangaroo bullshit is because of all the short interest not sold before it started going back up. I'd bet a shit ton of that interest is held by Chinese banks too. When it hit 3,200 all the gains disappeared over night when the Asia market's are trading. I'm bullish until October and then I'm going to start trying to figure out who's going to win and I'll base my next move on that. We could easily have had a V shaped recovery but for some reason people are obsessed with crashing the economy. Its really morbid when you think about it.", "score": 2, "replies": []}, {"body": "All these idiots going to ruin the economy pump 5 trillion or so now of printed money. Inflation for a decade here we come jpow is a scarred bitch idiot. Trump tells him what to do", "score": 3, "replies": [{"body": "You sound like you are about to go return some video tapes.", "score": 12, "replies": [{"body": "Without rewinding !!", "score": 8, "replies": []}]}]}, {"body": "We aren't even in the third inning of the Covid19 crisis.", "score": 2, "replies": [{"body": "Is this comment from March?", "score": 2, "replies": [{"body": "Nope, in March the highest cases reported in a day were less than half of what we had yesterday.  And, we were locked down...", "score": 2, "replies": [{"body": "Coronavirus is over. Racism killed it. Try telling people to lock down and not work to feed their families after they’ve seen politicians and healthcare professionals support protests with thousands of people packed shoulder to shoulder. Whether the protestors were masked or not, no one will listen to shutdown orders anymore", "score": 1, "replies": [{"body": "!remindme 1 month", "score": 3, "replies": [{"body": "Politicians and public health advocates have lost all credibility. Imagine if you’re someone who shut down their business or lost a loved one to cancer and couldn’t be with them in their final moments and couldn’t have more than 10 people at the memorial? Then you see pictures of a 10,000 person BLM protest (not saying BLM isn’t a worthy cause) and see the same people who told you to shut down your business and said you couldn’t gather for a memorial of over 10 people supporting or even attending this protest? You think they’re gonna listen to a lockdown order again? It’s over. Like a quarter of the deaths are in New York State. 42% of the deaths are in nursing homes. In the event of a second wave, they will simply isolate the old", "score": 1, "replies": [{"body": "Why are you booing him? He's right. He's not saying it's a good idea, he's just saying getting lockdowns to work again is unlikely.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "He isn’t going to win the election...", "score": 4, "replies": [{"body": "Did President Hillary Clinton write this?\n\njk he might not. but he wasn’t supposed to win the last one either. so everything he’s done: 2 Supreme Court justices, dozens of young federal judges who are lifetime appointments, tax cuts, etc. is something that was never supposed to happen in the first place", "score": 2, "replies": [{"body": "One of those judges just gave the finger to the christianists.", "score": 1, "replies": [{"body": "Eh, he’s a textualist, it happens. Christians would never abandon Trump because Christians find the alternative to be so terrible. In many minds a Dem presidency means abortions for every teenager and men in every women’s bathroom", "score": 1, "replies": [{"body": "Funny story, \"sex\" was added to the Civil Rights Act by a segregationist who thought it would be a \"poison pill.\"", "score": 2, "replies": [{"body": "What’s his name", "score": 1, "replies": [{"body": "https://lmgtfy.com/?q=who+added+sex+to+the+civil+rights+act+of+1964", "score": 1, "replies": [{"body": "What’s that website? That’s not bing?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Lmao imagine that’s your reason to re-elected a person and you wonder why people don’t think trump has a chance. He couldn’t even get more vote than Hillary Clinton, one of the hated politicians of all time. The fact he appoints judges is the mere fact supreme court justices decided to retire lmao. Also tax cuts to the heavily towards the 1 percent and higher corporations doesn’t ignite the average person to vote for Trump...", "score": 1, "replies": [{"body": "I mean this isn’t r/politics\n\nMy point isn’t that he will get re-elected, although he probably will. My point is that before the crisis, Dow was nearing 30k and he was running on the economy. He would do anything to salvage the economy. It sounds like you are upset he won and could win again. That is what r/politics is for", "score": 1, "replies": [{"body": "I don’t disagree with the fact that we will do anything to salvage the economy but if he does it is going to spike inflation or hike tax prices...", "score": 1, "replies": [{"body": "In the long run we are all dead", "score": 1, "replies": [{"body": "So what is the move???? Spy calls??", "score": 1, "replies": [{"body": "I think there’s something to be said for this “kangaroo market” meme. On the super red days, buy relatively short dated OTM SPY calls. Sell them on the green days", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "Like him or not, it’s best to just see reality on this point. There’s virtually no chance he loses re election.", "score": 0, "replies": [{"body": "And what’s your proof???", "score": 0, "replies": [{"body": "Same proof as anyone who says he will lose. Can’t tell the future. But he will have all fall to campaign on a strong economic recovery, and defeating the virus that was supposed to end the world. He’s still very strong in the swing states, doesn’t matter at all how many people in Cali and NY don’t like him. I’m not trying to say I prefer it one way or the other, but a Biden win would be a massive upset at this point. Just looking at the situation realistically.", "score": 1, "replies": [{"body": "As we know how useless polls are from the 2016 elections, I think I will change my stance to it’s anyone’s game... I don’t like Biden but I will vote for him...", "score": -1, "replies": [{"body": "The polls (that were done) were actually pretty much correct. The problem was there were very few polls in WI, MI, PA because everyone assumed those were \"safe blue\" states. The polls of the swing states were as good or better than historical performance.", "score": 1, "replies": []}]}, {"body": "what strong economic recovery? the stock market doesn't equal economic recovery... still have 40+ million people unemployed and these numbers they keep reporting that are beating what's expected... who's setting the bar SO low that it's so easy for us to beat and rally? and the virus hasn't been defeated... many states seeing their first huge wave. he is NOT strong in swing states. not sure what news you watch, oh wait probably fox by the narrative your speaking. clearly you do prefer it one way. who are you kidding?", "score": -1, "replies": []}]}]}]}]}, {"body": "> He’s not gonna let the economy be in the shitter come November 3rd.\n\nThe stock market is not the economy, you idiot.", "score": 2, "replies": [{"body": "Sorry, he’s not gonna let the “stock market” be in the shitter come November 3rd.\n\nThey’re not the same but they are related. And clearly I meant the stock market since this is a sub for betting on the stock market. Are you always this pendantic online or did you buy short dated puts?", "score": 2, "replies": [{"body": "My point is that it's a shitload easier to juice the stock market than it is to actually fix the economy. Watching rich people get richer isn't going to win the votes of all those Americans who are out of a job. \n\nBut since Mango doesn't understand that, I do expect that he will do anything and everything to keep stocks pumped - that's why I'm long in this market, at least for the next few months.", "score": 3, "replies": [{"body": "Many people don’t see a huge difference between the two. If anything one is a lagging indicator of the other. Or one is a leading indicator of the other. And I don’t think Mango can recite the classics from memory or anything, but what he can do seems to have worked for him for 74 years", "score": 1, "replies": [{"body": "You seem like you think Mango has been in complete control of things all along, as opposed to dancing on the head of a pin this entire time.", "score": 2, "replies": [{"body": "It doesn’t matter if it’s intentional or it’s luck. If it’s luck, he’s on just about the luckiest streak anyone’s ever been on. From winning the R nomination to beating Hillary to Mueller to the impeachment no one remembers to killing Abu Bakr Al Baghdadi to killing Soleimani it’s quite the streak and not something I’d bet against", "score": 2, "replies": [{"body": "Eh, Bernie Madoff seemed like he was on a hell of a winning streak too.", "score": 1, "replies": [{"body": "Yeah but he was literally cooking the books. I don’t see the correlation. If it was luck to beat Jeb / Tes / Rubio / Hillary / Mueller / ISIS leader / Iran shadow general / impeachment (that happened?) pass tax cuts / appoint 2 Supreme Court justices / appoint dozens (hundreds?) of federal judges then that’s some fucking luck. Or maybe just some good people around you", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "V-shaped recovery isn't referring to markets. It's referring to the economy. The economy is the only thing that impacts everyone. Markets don't do shit for poor people.", "score": 2, "replies": [{"body": "Ok well I meant the markets, and it seems the people in that thread disagreeing meant the markets too", "score": 3, "replies": [{"body": "Retard", "score": 1, "replies": [{"body": "Do you think this sub gives a shit about poor people lol it’s literally a sub for betting on options that expire within hours ahahahaha keep buying puts have fun with that", "score": 1, "replies": [{"body": "No but I think your gay and retarded.", "score": 1, "replies": [{"body": "You’re*\n\nWhat’s your cash app. I will use all my gains from betting on a v shaped recovery to put you in a grammar class", "score": 1, "replies": [{"body": "No cashapp. I'm no e-thot", "score": 1, "replies": [{"body": "Venmo?", "score": 1, "replies": [{"body": "No venmo. I'm not an e-thot.\n\nI primarily use cash or precious metals to pay people.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "What’s your portfolio like since? Did you put your money where mouth is?", "score": 1, "replies": [{"body": "I’m up but not by nearly as much as I should be. I didn’t end up buying LEAPS. Instead I bought calls 1, 2, 3 months out. Dabbled in some weeklies. And also tried to short Zoom a couple of times lol. But I 2x’d a couple of weeks ago and have been doing pretty well since. It should have been 3x, I sold some things a day early (or even hours early) that went on to 3x or 5x or even 10x after I sold them. I put my $ where my mouth was but didn’t commit to it as much as I should have. Got spooked by a couple of the super down days and also since I didn’t get LEAPS I was more susceptible to those blood red days (but also more green on the greenest days).\n\nAlso took me some time to figure out how best to express this view. For example I got in Shell because I wanted oil exposure. But Shell is an extremely low beta stock. Took me some time to find stuff like ERX and MRO and OXY and FANG that can move up 10% even 20% in a single day", "score": 1, "replies": []}]}, {"body": "Yeah Id be retired if I bought calls with my puts profits... hindsight 2020", "score": 1, "replies": []}]}
