{"title": "Ultimate Guide to Selling Options Profitably PART 14 - The Six Characteristics of an Option", "selftext": "# This post will teach you the basics of how to properly conceptualize options in your mind. \n\n# It will then teach you how to translate the idea of what an option is into what you see in your brokerage. \n\n*This is the noob friendly post I should have started the series with :)*\n\nI say this because if you want to trade options, you need to firstly understand and be able to conceptualize what an option is. \n\n**Note**: If you want to read the other parts of my series, [Click Here](https://classic-desert-4cb.notion.site/Ultimate-Guide-to-Selling-Options-061ca90e28cc494eb855de5ce398af7e)\n\n# Simply put, options are a financial instrument. \n\nThey are not a strategy. They are not inherently better than stocks, or futures, or forex, or bonds. \n\nThey serve a particular purpose in the market, just like each of the others.\n\nThe reason many smart retail traders are attracted to options is because of what they give you exposure to. \n\nOr more simply put*: the different ways you can make money trading them.*\n\nAs you dive deeper into the product, you will come to realize that they are an extremely versatile product that can let you express almost any view or idea you have in the market. They are pretty cool. \n\nBut in order to dive deep into options, you first need to be able to conceptualize what an option is. Let's get started.\n\n# There are 6 characteristics of an option.\n\nRegardless of what option you are trading, they all have the same 6 characteristics that define them.\n\nThese characteristics are:\n\n1. An option is a contract\n2. Created between two people\n3. That gives the purchaser the right to buy or sell a stock\n4. At a set price\n5. In a set time frame\n6. For a premium\n\nThese 6 characteristics will help you conceptualize what an option is and how it works. Let's break them down!\n\n# 1) An option is a contract..\n\nWhen you buy or sell an option, you are not trading the stock itself. The options market is actually separate from the stock market. When you trade in the stock market, you are actually exchanging a piece of the company with others. But in the options market, when you make a trade, you are creating a contract.\n\n# 2) Created between two people..\n\nMost people think about option trading as \"*them VS the market\"*. They aren't really wrong when saying that, because the market determines the prices of the options you see, but I do think people internalize that wrong.\n\nWhen a we say it's \"*you VS the market*\", it's not the same as \"*you VS the house*\" at a casino.\n\nYou see, trading is not like blackjack, where all the players sit down and play against the casino.\n\nRather, it is more like poker, where all the players are *playing against each other* at the same table, betting on the events that will be unfolding.\n\nSo whenever you are placing a trade, if you break a market down to it's micro transactions, there is actually someone on the other side of that trade. \n\nIn the options market, there are two players in every transaction: The person who writes/creates the contract (seller) and the person who purchases the contract (buyer).\n\nWhether you are the buyer or the seller, there are many different players that could be on the other side of your option contract, but we will save that for another post. \n\n# 3) That gives the purchaser the right to buy or sell a stock..\n\nThe contract that the option buyer purchases gives them the right to buy or sell a stock. \n\nThis also means that by selling an option, you have an *obligation* to fill the order if the buyer chooses to exercise the contract.\n\n# 4) At a set price..\n\nIn the options world, this is called the strike price. So for example, you might buy an option contract from someone that gives you the right to buy Apple stock at $160.\n\nThis  is written into the contract. Different contracts will have different strike prices. \n\nNow let's stop and think about this for a second. Would it make sense for an option contract to go on forever? If they did, it wouldn't really make sense to sell them (you'd have a lifetime of risk, for one time pay!).\n\nSo that brings us to the next characteristic of an option.\n\n# 5) In a set time frame..\n\nOptions don't last forever. The contracts have a deadline, at which time they expire. Going back to our Apple example, you might buy an option contract that gives you the right to buy Apple at $160 in the next 30 days.\n\nBut there is one more thing we need to take into consideration. We know why someone would buy an option now. It gives them the right to buy or sell stock, at a set price, within some timeframe.. \n\n*But why would anyone sell an option?* *Why would someone give you that right?*\n\n# 6) For a premium!\n\nPurchasing options is not free. The reason someone would sell  an option is because they get paid to do it.\n\nSo if we revisit our (hypothetical) Apple example, this is what the full picture would look like:\n\n***You could buy an option contract from someone that gives you the right to buy Apple at $160 in the next 30 days for a price of $15.***\n\n# Now that we can visualize what an option looks like, let's learn some industry lingo.\n\nLet's turn the picture we created into what it actually looks like when you are looking at the options market.\n\n# 1. Contract = option chain.\n\nYou go into your brokerage to see it. It is literally a list of all the different contracts you can trade for a stock. When you want to buy or sell a contract, you come here and you pick the one you want to buy or sell.\n\n&#x200B;\n\nhttps://preview.redd.it/hbik7upgd2381.png?width=2870&format=png&auto=webp&s=ec39722a5be106be076163b75150b1bce269023e\n\n# 2. 2 people = bid/ask.\n\nThe way you can really understand that there is someone on the other side of you trade is the bid and ask. these are the prices that someone is willing to either buy a contract at (bid) or sell a contract at (ask). Every contract has a bid and an ask price.\n\nThink of it like you are standing in a market, and someone is standing there saying \"ill buy an apple contract for 1 dollar\" and someone else is there saying \"ill sell an apple contract for $2\".\n\nIf you want to buy an option, you engage with the person on the ask side. If you want to sell an option, you engage with the person on the bid side. And sometimes, someone might actually meet you in the middle if you try to buy or sell somewhere in between those two price!\n\nThe buyers and sellers act as supply and demand for the contract, and depending on the buying and selling pressure, that's how we get the \"market price\" for the contract!\n\n&#x200B;\n\nhttps://preview.redd.it/t57y0x43e2381.png?width=2410&format=png&auto=webp&s=f995ec29e64a621fbc9bd49a00d79455365dbf77\n\n# 3. Right to buy, right to sell = calls and puts.\n\nA call is what we call an option contract that gives the buyer the right to buy a stock. \n\nA put is what we call an option contract that gives the buyer the right to sell a stock.\n\nOn most brokerage set ups, the left side of the option chain will be the calls and the right side will be the puts.\n\n&#x200B;\n\nhttps://preview.redd.it/1tu6hrv0f2381.png?width=2412&format=png&auto=webp&s=a9169a55102c42f6c8727122e3650c384f5751ab\n\n# 4. A given price = strike price\n\nWhen you look at an option chain, each row is different contract that is listed. Each of these contracts that you see will have a number in the middle of the chain. $115, $120, $125... etc.\n\nThese are the prices that the contract gives the buyer the right to get the stock at! Each contract has a different stock price that the contract is based on.\n\nEach strike price is the price you have the right to buy/sell the stock at for the options on that row.\n\n&#x200B;\n\nhttps://preview.redd.it/81fcxhvzf2381.png?width=2412&format=png&auto=webp&s=57b332c5cca7ac83f966d5cb0b5f45b207750d49\n\n# 5. Time frame = expiration date\n\nNot all option contracts expire at the same time. Depending on the stock, you could have options that expire in 1 day, 7 days, 30 days... 2 years.. the list goes on.\n\nWhen you look at the option chain, you will see that there are a bunch of different contracts listed under different dates. The date you see are the expirations for those contracts!\n\nWhen you select the expiration you want to look at, it will open up the list of all the options expiring on that date.\n\n&#x200B;\n\nhttps://preview.redd.it/5wvhdrypg2381.png?width=2392&format=png&auto=webp&s=d7ac97a4b61308cd5d6a0273516ee6d4fb5a58cb\n\n# 6. Premium = Price\n\nFor each contract, there is a price associated with them. The price what someone is either willing to buy or sell the contracts for! Where do you see the price on the option chain? Well, it's the bid and the ask! You can see how much someone is willing to pay for a contract, or how much someone is willing to sell it for, right on your brokerage.\n\nThere is a lot that goes into pricing options, but for now, all you need to remember is that options are not free. There is a price associated with them.\n\nImagine you are standing in a marketplace. The bid is like osmoene else standing there looking to buy a call option for (as in the below picture) $11.90. \n\nThe ask is someone else in the marketplace saying that they will sell that same option for $12.60.\n\nThere is a gap between what the buyer wants to pay and what the seller will accept. You can sometimes purchase or sell in the middle of these two by making an offer in the middle! Trying to get something for the best price is what we call \"working your order\". \n\n&#x200B;\n\nhttps://preview.redd.it/8dn9d470i2381.png?width=2418&format=png&auto=webp&s=8d385572c8b7e7bc56e9834a9b3688c87316c456\n\n# Conclusion\n\nSo let's recap the 6 characteristics of what an option is by writing out a sentence for our Apple example.\n\n*You want to buy a call on Apple's option chain that lets you buy Apple at a strike price of $160. The contract will expire in December 2021. There is someone willing to sell it to you at the \"ask\" price for that contract, for a premium of $15.*\n\nI hope this post makes it clear what an option contract is. With this as a basic understanding of how the product functions, we can move forward into some of the intricacies related to the product and the opportunities that they create. \n\nHappy trading,\n\n\\~ A.G.", "id": "r7bkie", "created_utc": 1638463577.0, "score": 276, "upvote_ratio": 0.92, "num_comments": 37, "comments": [{"body": "Nice! Can you drive deeper in the Greeks please", "score": 9, "replies": [{"body": "Yep! :)", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Agreed! \n\nOr, the best strategy is the one that you haven’t heard of, because no ones giving you their edge :P", "score": 2, "replies": []}]}, {"body": "Hm you make it sound like buyer and seller are bound to each other at time of writing, which - as i understand - is not the case but a randomized process controlled by the clearing house is used. I see this issue here with people, and i used to think that too, that if I sell a contract with a certain break even, I should not worry about it being (slightly) ITM and being assigned \"since the buyer would not want to excercise before reaching break even\", which is exactly not the case due to the random assignment from the clearing house. So the \"buyers\" break even might be totally different from yours. But correct me if I am wrong.", "score": 5, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "Good stuff larry", "score": 4, "replies": []}, {"body": "Are there any QQQ euro style options?", "score": 1, "replies": []}]}, {"body": "Contracts can be sold off before expiration, thus technically changing the person on the other side of the trade. But with regards to early assignment, it's a common misconception that this is an inherently bad thing for option sellers. In reality, you get to keep the remaining extrinsic value. The only real risk is overnight if you get exercised and can't balance your book right after.", "score": 5, "replies": []}]}, {"body": "This seems like pretty basic stuff for Part 14? Where is the content referenced in the title, the guide to selling options profitably?", "score": 3, "replies": [{"body": "It is! This is going to be an all inclusive guide by the end. I didn't start it with that being the intention, but it's what it has become. I didn't include basics at the start, but I needed to get them done.. so here they are :)\n\nClick the link at the top of the post. It'll take you to a notion with a list of all the other parts on reddit.", "score": 1, "replies": []}]}, {"body": "Amazing!", "score": 3, "replies": [{"body": "Thank you very much!!", "score": 3, "replies": []}]}, {"body": "and AlphaGivith again! 👍", "score": 4, "replies": [{"body": "hahaha :)", "score": 3, "replies": []}]}, {"body": "Following to read later.", "score": 2, "replies": [{"body": "hope you enjoy it!", "score": 2, "replies": []}]}, {"body": "This series is fantastic!!! so much value for a beginner. Not all heros wear capes bro", "score": 2, "replies": [{"body": "Thanks a lot man. Lots more to come too!", "score": 2, "replies": []}]}, {"body": "Thanks AG, we appreciate it. Are we gonna get a guide on how to pick stocks and what indicators to look for on whether to buy calls or puts?\n\nAnd perhaps some option trading strategies like credit or debit spreads would be cool for the small account peeps under us.", "score": 2, "replies": [{"body": "Hey! Thank you. A lot of the things I have focused on are how to find an edge. I am not a big fan of the common indicators used in the retail space. I basically look to capitalize on risk premiums and mispricings. I pretty much answer this question:\n\n\"The market is saying this option is worth $XXX.XX, What do I think it's worth?\"\n\nIf I think it's worth less, it's a sell. If I think it's worth more, it's a buy.\n\nLot's of different approaches we can apply to answer this, but I typically use 1) a statistical forecast of vol 2) compare to historical metrics 3) compare to similar stocks 4) a qualitative analysis of why the market is pricing things the way it is.", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Good add on here !", "score": 1, "replies": []}]}, {"body": "<3\n\nOpening a position means that you are starting to engage in a new trade.\n\nClosing a position means that you are ending a trade that you are currently in.\n\nSince you can be a seller or a buyer of options, the different orders are for the different actions you can take.\n\nIf you want to sell an option, you are opening a new position where you sold. \"Sell to Open/ STO\". You will now be -1 option, since you sold one (you had 0 before, right?\n\nTo stop engage in that sell, you need to buy an option since you are -1 option. That will close your position. So you would \"Buy to Close/BTC\". This will give you +1 option. \n\n\\-1 + 1 = 0, you now have no position. \n\nBTO STC is the same thing but for the buyer.\n\nDoes that clarify?", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "hahaha I thought about that too.. but there will always be fish to feed on :)", "score": 1, "replies": []}]}, {"body": "I love this series. One thing I'd like to have would be like a cheat sheet or checklist that we can use once we finished the series. \n\nThings to check before opening a position. Management with so many DTE, adjustments when, etc", "score": 1, "replies": [{"body": "Good idea. It will be a very extensive check list though haha", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "No you are not. Because you are not a seller of options really. You “sold to close”, meaning you have net 0 position.\n\nA seller “sells to open”, and have a net -1 position. Because of this, they “owe” a contract, is the easy way to think about it", "score": 1, "replies": []}]}, {"body": "very concise and easy to understand piece, thank you so much sir!", "score": 1, "replies": [{"body": "My pleasure! :)", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "My pleasure. I just discovered notion. It’s cool. I plan to make it look much better over time too!", "score": 2, "replies": []}]}, {"body": "Amazing breakdown, very easily digestible, and most of all it’s specific to the major concepts to look at when trying to define what an option is. Bravo", "score": 1, "replies": [{"body": "Thank you very much!", "score": 2, "replies": [{"body": "You’re welcome, this is the first of your posts that I’ve ever seen but I’m going to look at all the rest because of the structure behind how the information is displayed and also the information itself. So really, thank you 🙏", "score": 1, "replies": [{"body": "Use the notion link at the top of this post. It’ll show u all my other posts! Thanks again :)", "score": 2, "replies": []}]}]}]}, {"body": "The expiration date is a dead end if the value stays flat thus leading into worthless expiry or can that be extended somehow with another contract or some rollover method ?", "score": 1, "replies": [{"body": "It’s done. Rolling is just buying another contract. It’s common in retail space but the reality is it’s just opening a new position", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "It’s actually not too tricky but it’s very important.\n\nThank you very much!", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah a lot of times you’ll be trading against a market maker who maintains the bid ask but understanding who fuels demand on either side can give cool insights. It’s basically one of 3 groups: retail, institution, or insider. Putting labels on the groups is important because then you can try to understand their motives", "score": 2, "replies": []}]}]}]}]}
{"title": "Visa and Mastercard", "selftext": "Tickers: **VISA,** **MA**\n\nThey are both down 20%+ from their highs this year, improving the margin of safety. They still have a huge moat (each of these companies maintain operations in 200+ countries).\n\nBoth have a small dividend. Visa authorized an increase in theirs last week, with Mastercard doing the same yesterday. Mastercard has also approved a new $8B share repurchase program.\n\n**Visa and Amazon Dispute**\n\nFor Amazon in the U.K, Visa cards only account for 7% of transactions, the smallest share of all card purchases. Amazon U.K primarily uses Mastercard for payments. For Amazon in the US, Visa is the dominant card.\n\nThey have specifically targeted the country that would impact them the least. Visa has also faced much more impactful restrictions from companies such as Walmart and Kroger and they ended up settling those disputes privately. It's clearly just a negotiation tactic from Amazon.\n\n**Interest Rate Risk**\n\nThese companies derive revenue from client services, data processing, cross-border transactions, and value-added services, such as licensing fees. Meaning they have less exposure to interest-rate risk as they neither earn revenue from or bear any risk tied to the interest or fees paid by cardholders.", "id": "r6ygbi", "created_utc": 1638418319.0, "score": 82, "upvote_ratio": 0.92, "num_comments": 36, "comments": [{"body": "Long-term V investor here, slowly building PYPL however V and MA still have the competitive moat for now", "score": 59, "replies": [{"body": "If you look at etfs IPAY and XLF, all payment sectors, and finance sectors are down with correction mode. All companies under this ETFs are corrected.  \nThis is normal rotation of market. This qtr highest sales, transactions will be higher and they all make money. Market corrected heavily. \n\n  \nWhen S&P recovers all these recover to peak level by Jan 15th when results are about to be declared.\n\n  \nEverything here is cyclically made by market.", "score": 22, "replies": [{"body": "Hope you are right... Ty for clarification", "score": 3, "replies": []}]}, {"body": "I just don't understand Paypals moat... It doesn't really seem to have one at all, and from what every person I've asked, they all have negative experiences with paypal as a whole, I get the valuations cheaper then it has been for a while but I'd feel much safer just holding V.", "score": 6, "replies": [{"body": "PayPal definitely has a moat... Pick a random retail company and fill out a cart and see how your able to pay... PayPal is everywhere and built in to the internet at this point", "score": 12, "replies": [{"body": "[deleted]", "score": 10, "replies": [{"body": "there are many ppl who do not have a credit card myself included who use pypl because they will debit my checking acct.", "score": 3, "replies": []}, {"body": "That's my point, I don't see that as a moat at all, I find VISA a much better company with a MOAT, being more a tug of war with Mastercard rather then a battle with every fintech imaginable like paypal, slowly losing market share.", "score": 2, "replies": []}, {"body": "I don't because PayPal delivers your data set with address and name as well as payment options in several forms including cards, cash accounts, and credit ... I am holding visa heavily but don't count pypl out", "score": 2, "replies": []}]}, {"body": "Affirm is taking that moat away IMO they have massive partnerships and not only make $of the customers but the company they partner with … they carry the debt the Amazon and ebays don’t want and they pay them for it", "score": 1, "replies": []}]}, {"body": "Paypal is garbage. Stay with V.", "score": 0, "replies": [{"body": "Not sure I agree. They’re improving, they’ve added crypto and will likely continue to improve the features of this and crypto currencies available through PayPal. They also own Venmo which is profitable and growing. They recently added the ability to have purchase protection when using Venmo to pay for services or goods.\n\nVenmo revenue per year\n\n2017 $160 million \n2018 $200 million\n2019 $300 million\n2020 $450 million\n2021 $900 million estimated\n\nVenmo annual payment volume Year\tTotal payment volume (TPV)\n2014 $2.3 billion\n2015 $7.5 billion\n2016 $20 billion\n2017 $34 billion\n2018 $62 billion\n2019 $101 billion\n2020 $159 billion\n\nVenmo users Year\n2015 3 million\n2016 5 million\n2017 10 million\n2018 23 million\n2019 40 million\n2020  52 million\n\nVenmo valuation estimates\n2013 $0.1 billion\n2018 $15 billion\n2020 $38 billion", "score": 5, "replies": [{"body": "this.  all of this.   100%", "score": 2, "replies": []}]}, {"body": "Link a phone-pay app to a checking account\n\nThe credit card leeches gave us two reasons to dump them.\n\nFirst, they artificially inflate the price of everything by charging a high fixed+percentage fee even on small purchases.\n\nSecond, the processing terminals that they've installed in every merchant in the country are garbage for chip processing. Phone apps are done usually before you've even tapped the phone on the box, while a Mastercard transaction takes 20-30 seconds to finish, when it isn't failing to read the chip.\n\nFuck 'em.", "score": 2, "replies": [{"body": "Exactly credit cards are like the opposite of the fintech people here love and all the benefits get charged elsewhere.   \nThey are leeches", "score": 1, "replies": []}]}]}]}]}, {"body": "Not sure about MA, but everyone in Norway uses Visa. We don't use cash and i haven't actually seen cash for a few years. I'm guessing most countries are behind in that regard, but as more and more switch to cashless, Visa will be bigger. \nLong V", "score": 35, "replies": [{"body": "In Germany, they are getting rid of so called a giro card and replacing them with a debit card or a credit card (Visa or Maestro). Long V too.", "score": 15, "replies": []}]}, {"body": "This seems like an ideal time to build up positions with V and MA. The same day news of the Amazon-V brouhaha emerged MA dropped along with V.\n\nThings might be changing with emerging fintech companies but the fact of the matter is V and MA are both behemoths that are expecting some rosy quarters in the immediate future.\n\nBeen snagging calls on both dated for three to six months out.", "score": 15, "replies": []}, {"body": "How easy is it for any of the fintechs to remove V or MA from the equation though? Even if I'm using Paypal, Venmo or Apple Pay my card is still linked and V or MA is still getting their cut.", "score": 13, "replies": [{"body": "Exactly.", "score": 1, "replies": []}]}, {"body": "You mentioned margin of safety but only really talked about price. What do you think the value of the company is? At the current P/E is it not overvalued and likely to fall further before becoming a buy?", "score": 4, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "> I think you are better off in investing in more innovative fintechs.\n\nCan you give any reasons why?", "score": 10, "replies": [{"body": "Not done any proper DD by any stretch but I've interviewed with Fintechs and for a start they're meant to be cheaper and faster. Other startups are trying to offer more holistic payment solutions as well, particularly with regards to international payments and transfers. Wouldn't be surprised if they're both complacent with their positions in the market.", "score": 1, "replies": [{"body": "I sold V and INTC for the same reason: Contracting margins for the next few years", "score": 1, "replies": []}]}]}, {"body": "MA is innovative? They just partnered with companies so that people can have payment cards where they can instantly convert their coins to traditional fiat currency", "score": 1, "replies": []}]}, {"body": "It's tough, yes they have a large moat, but the internet and mobile payments and digital wallets changes a lot. There are a lot of growth stocks out there that reduce friction beyond what VISA / MA offer. That being said, I think they still have the edge in the medium term.", "score": 1, "replies": []}, {"body": "Long term they are loosing moat with new fintechs charging a lot less. My company went from paying 3% with visa to 1.5 with a new provider", "score": 1, "replies": []}, {"body": "I held MA for a really short amount of time and I own a MA card, but honestly, not sure about the long term future of these companies.\n\nI have my bank's app which allows me to transfer money to others based on phone number and directly from my bank account. Last time I was at the dentist, I paid using that. Same as last time I purchased something from a website I am not familiar with, don't have to risk putting in my credit card number.\n\nI don't know what both V and MA are doing in terms of innovation but NFC (what most people call WiFi or touch) in credit cards is not safe either, they can be charged even while you are walking in the street. Pretty sure they can also be copied.\n\nI don't really use my PayPal account but I think it would be a superior payment technology in the future than both credit card giants.", "score": 1, "replies": []}]}
{"title": "British FDA approves $VIR Covid drug that cuts death & hospitalization by 79%, may 'work' against Omnicron", "selftext": "New drug Sotrovimab is approved by MHRA (British version of FDA) for 12 and over with mild-to-moderate Covid who is at risk of developing serious illness. \n\n* It is a drug developed in partnership by VIR biotechnology ($VIR) and GlaxoSmithKline ($GSK).\n\n* [VIR CEO](https://news.sky.com/story/sotrovimab-new-covid-drug-which-cuts-risk-of-hospitalisation-and-death-by-79-approved-for-use-in-uk-in-people-aged-12-years-and-older-12484329): \"Sotrovimab was deliberately designed with a mutating virus in mind. By targeting a highly conserved region of the spike protein that is less likely to mutate, we hoped to address both the current Sars-CoV-2 virus and future variants that we expected would be inevitable\"\n\n* MHRA: \"**It is too early** to know whether the Omicron variant has any impact on sotrovimab's effectiveness but the MHRA will work with the company to establish this.\"\n\n* VIR & GSK say early tests show the drug \"**retains activity** against key mutations of the new Omicron variant.\"\n\n* The drug is a 30 minute treatment.\n\nI say \"may work against Omicron\" because it really depends on what $VIR means by \"retains activity.\" That sounds like a technical term so if anyone here is a medical researcher who knows what that means please chime in. \n\nIs $VIR an investment opportunity? The bull case:\n\n* Obviously if it works vs Omicron it may blow up. It's already up 14% today.\n\n* Even before today's news US has already [ordered $1 billion](https://www.reuters.com/world/us/united-states-signs-about-1-bln-order-gsk-vir-covid-19-antibody-drug-2021-11-17/) worth of this drug in mid November. \n\n* It is already authorized for emergency use in US. EU approval is pending (not sure about EU).\n\n* $VIR [claims](https://www.reuters.com/business/healthcare-pharmaceuticals/gsk-vir-covid-19-antibody-muscle-injection-effective-intravenous-shot-2021-11-12/) this therapy may also work as a shot in the arm \n\nIs $VIR worth investing in? The Bear case:\n\n* Why did it go up as high $83 in January? Why is it down in the dumps at $50 right now? What happened. \n\n* $VIR is a one-trick pony. Unlike Moderna which has lots of other things in its pipeline.\n\n* This therapy sounds promising, but if Pfizer delivers their drug (which promises 89% and can be taken at home) and it also works against Omicron then would $VIR be anything special?\n\nIs it possible that both $VIR and $PFE are worth investing in because there's going to be a huge roadblock in production so they won't really be competing against each other? I'm trading Pfizer and VIR but not sure what to do here.", "id": "r76kqs", "created_utc": 1638448726.0, "score": 159, "upvote_ratio": 0.91, "num_comments": 36, "comments": [{"body": "WTF does \"may work\"? suppose to mean?   \nWe still haven't had a single death from Omicron. So what's up with this bs headline. \n\nIs the media, pharmaceutical companies and FDA this broken that they have to pump non-news? \n\n\"May work\"   \nDoes doing nothing count as a \"may work\" as well? Since doing nothing apparently works pretty well as we haven't had a single Omicron death.", "score": 26, "replies": [{"body": "> WTF does \"may work\"? suppose to mean?\n\nReuters says \"[GSK says tests indicate antibody drug works against Omicron](https://www.reuters.com/business/healthcare-pharmaceuticals/gsk-says-tests-show-antibody-drug-works-against-omicron-2021-12-02/)\". \n\nI added the \"may\" since, like I said in my post, I'm not sure what \"retains activity\" means.\n\nWSJ uses slightly different language: [Glaxo Says Its Covid-19 Antibody Drug Is Likely Effective Against Omicron](https://www.wsj.com/articles/glaxos-covid-19-antibody-drug-found-to-be-effective-against-omicron-11638441696)\n\n>Early laboratory studies suggest that a Covid-19 antibody treatment developed by GlaxoSmithKline PLC and Vir Biotechnology Inc. is effective against the Omicron variant, the companies said, setting it apart from similar therapies that appear to work less well against the highly mutated strain.", "score": 2, "replies": []}, {"body": "Just my opinion.  \n\nI think he means “it works against known variants.  It may cause side effects or may not be effective in certain populations.”\n\nThis is CYA for “yes it works but everyone is wired a bit differently.  So we need more testing for effectiveness.”\n\nNeed more test subjects please.", "score": 2, "replies": []}, {"body": "The media has been filled with speculation about Omicron and what they think they know to fill the 24 hour news cycle. In reality, we won't concretely know anything for weeks.", "score": 2, "replies": []}, {"body": "If they say it does work then we have a treatment for covid, which would mean we wouldn’t need vaccine mandates, which would mean all those vaccines produced and not used would be the opposite of profit, which would mean Pfizer would be pissed", "score": 1, "replies": [{"body": ">Pfizer would be pissed\n\nPfizer is making vaccines *and* antivirals. So they covered both scenarios.", "score": 1, "replies": []}]}]}, {"body": "There's a dramatized documentary on these developments from the life experience of Thomas Cruz. It was his second mission which was  considered impossible by the IMF", "score": 6, "replies": [{"body": "I feel like there's a good joke here that wooshed by me. Is there some connection between this stock and mission impossible?", "score": 1, "replies": []}]}, {"body": ">British FDA approves $VIR Covid drug that cuts death & hospitalization by 79%, 'may' work against Omnicron\n\nFix that for you", "score": 3, "replies": [{"body": "Thanks that might be better.", "score": 1, "replies": []}]}, {"body": "As far as investing goes, I think the \"buy on the rumor, sell on the news\" theory can apply here. You never know though, maybe the company will have a big success here and that will help them build up more successes", "score": 2, "replies": []}, {"body": "This aint news.", "score": -13, "replies": [{"body": "The approval [literally just happened this morning](https://www.gov.uk/government/news/mhra-approves-xevudy-sotrovimab-a-covid-19-treatment-found-to-cut-hospitalisation-and-death-by-79). How much fresher do you want your news lol.", "score": 19, "replies": []}]}, {"body": "If u don't know I can't tell u.", "score": -14, "replies": [{"body": "Whatever insights you may have is welcome. I'm here to discuss and learn.", "score": 3, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Yeah, the majority of Reddit is a hivemimd wasteland.  They keep calling it horse dewormer because that's what they're told to call it.  We give horses ibuprofen but we don't call it horse anti-inflammatory.   They also conveniently ignore the fact that he got better very quick", "score": 2, "replies": []}, {"body": "Are you talking about Joe Rogan? He said he took monoclonal antibodies, but how do you know he specifically took Sotrovimab and not one of the other ones? They are not all the same.", "score": 2, "replies": [{"body": "You may be right, it was the only drug specifically mentioned in the article I linked though.\n\n> Joe Rogan got it. So did Texas Gov. Greg Abbott.\nMonoclonal antibody therapy is one of a handful of treatments with emergency use approval from the Food and Drug Administration for the treatment of COVID-19.\nCurrently, it’s only available to high-risk patients with a doctor’s referral.\nAccording to the FDA — “Monoclonal antibodies are laboratory-made proteins that mimic the immune system’s ability to fight off harmful antigens such as viruses. Sotrovimab is a monoclonal antibody that is specifically directed against the spike protein of SARS-CoV-2 and is designed to block the virus’ attachment and entry into human cells.”", "score": 3, "replies": [{"body": "Ah I see, got it thank you.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "thought these were roids very disappointing", "score": 1, "replies": []}, {"body": "But does it shrink your pp?", "score": 1, "replies": [{"body": "Doctor: \"We have no data about the risk of pp shrinkage sir, it wasn't studied, but it reduces your risk of dying by 79%, and without it, you could die within five days\"\n\nAmerican male patient: \"Ok well, this is obviously unsafe, I'll face this disease on my own, thank you very much!\"", "score": 1, "replies": []}]}]}
{"title": "Square/Block or PayPal", "selftext": "Hi everyone - with the recent dip in payment platforms and offerings, I think there is an opportunity in either of these stocks. What is your opinion on either of these?\n\nPayPal is sitting at 184 as of this morning and square is sitting at 190 so I thought they are fairly comparable for the purpose of the discussion.", "id": "r7byg5", "created_utc": 1638464628.0, "score": 21, "upvote_ratio": 0.85, "num_comments": 31, "comments": [{"body": "PYPL, holding boat load of 2023 calls+shares, as it is working with Amazon-venmo integration from Jan 2022 onwards.", "score": 17, "replies": []}, {"body": "Keep in mind share price does not mean market cap. \n\nPYPL has a market cap of $220B, while SQ has a market cap of $89B.\n\n&#x200B;\n\n>PayPal is sitting at 184 as of this morning and square is sitting at 190 so I thought they are fairly comparable for the purpose of the discussion\n\nSo, don't be fooled. PayPal is valued at 2.5x as much as Square", "score": 7, "replies": []}, {"body": "I bought PayPal hope it will recover nicely", "score": 12, "replies": []}, {"body": "I’m already a block holder and plan on adding more to my bag. I think they have a lot of different things going on especially in the blockchain space  and now there CEO is going to 100% focused on the company", "score": 17, "replies": [{"body": "I don't understand why they made the hateful decision to confuse consumers with their garbage corporation and H&R Block. Are they trying to gain a ghetto edge by associating themselves with a company that has locations in so many bad neighborhoods and employees a lot of trashy people?", "score": -13, "replies": [{"body": "I’m not confused.. I don’t anyone that calls H&R Block just Block.. Block is a great name if your involved in the blockchain technology space", "score": 13, "replies": []}, {"body": "Poe’s law…!…?", "score": 1, "replies": [{"body": "Huh? Intentionally creating consumer confusion is illegal. Block has been around for a long time, is very well known, and has tons of locations.", "score": -6, "replies": []}]}]}, {"body": "Are they doing anything with blockchain other than buying crypto?", "score": 1, "replies": [{"body": "From what I understand there working on having there own exchange.. using blockchain", "score": 4, "replies": []}]}]}, {"body": "For long term, PayPal, no question. Block has a long way to go to prove itself, although you may benefit from short term swings, I have no idea how SQ plans to execute in an overly saturated sector.", "score": 11, "replies": [{"body": "Square will be one of the largest companies in the world by 2026", "score": 11, "replies": []}]}, {"body": "Why choose one? Just buy both.", "score": 6, "replies": []}, {"body": "paypal finally has a good day in months I kind half expect it go -10% becasue of this tomorow.\n\nSquare is up A LOT if you look from last year before corona, payall as well but not as much.\n\nI would say they are both somewhat overvalued even do they clearly have fallen a lot. \n\nI personally plan to re-enter into e.g square if it goes down more under 200, today I had a order if it would kept crashing down a bit more.", "score": 7, "replies": []}, {"body": "As a user - Square.  Fuck both PP and Venmo - Cash App is the only one I use.", "score": 4, "replies": [{"body": "Block*", "score": 1, "replies": []}]}, {"body": "Paypal is good long term. They fill the gaps that the main processors (V, MA, etc) miss and they cover international areas where banking isnt easy. V and Paypal basically compliment each other.\n\nSQ remains over priced imho and investors greatly over estimate its business. Most dont realize that there are hundreds of merchants who offer the same thing SQ does and did offer the same service long before SQ came around. SQ just made it slightly easier and had marketing power the smaller processors didnt. This is why many non-tech savvy people dont know about the alternatives.\n\nThough for the record I had absolutely no problem using a normal merchant when I ran my businesses and practically all of them offered a strip you can use with your computers (pre smartphone) as well as traditional machinery and a online API. This was as far back as 2000... When Blackberries became a thing you could also get a swipe thing for them.\n\nA normal merchant services offers far lower fees than SQ does. This is why I just dont get why anyone uses it. Its purely lack of knowledge. The only possible reason one might prefer SQ for merchant services is if you have stupidly low volume... to the tune of maybe a couple hundred a day. In this case, sure... SQ makes sense. Otherwise, you would be a fool not to get a normal merchant. Just call Costco for theirs. This is why I just dont get how SQ is growing... are businesses really that dumb? I just dont get it...", "score": 6, "replies": []}, {"body": "As someone who has no position in Block, would now be a good time to open a position? I know the market is always forward looking, so I assume Block is reacting to the interest rate hikes now rather than when the interest rate hikes actually happen. Is this accurate?", "score": 2, "replies": [{"body": "If your thinking about it  just do it…", "score": 0, "replies": []}]}, {"body": "I think this square drop is a huge over reaction. But I'm now a bag holder so I'm biased...", "score": 2, "replies": []}, {"body": "100% Block", "score": 3, "replies": []}, {"body": "The block is hot. Definitely a better buy, though I heard somewhere on reddit about a Venmo/Amazon partnership that might cause a boom?", "score": 0, "replies": []}, {"body": "I own both. You could pick up some pypl at this level, but dont go all in. Save some cash to buy more at 180/175 with a stop loss bellow 175. If pypl does hold support here and gets above 200 then you can really hit the buy button.\n\nAs for SQ dont touch it right now. its too early to tell what will happen to the company and stock with Jack driving the bus to crypto. Not sure how i feel about it actually. Anyway its too early to make the call.", "score": 0, "replies": [{"body": "Buy at 180/175 and set a stop loss at 175? Sounds like a great plan 😅", "score": 3, "replies": []}]}, {"body": "I have a little bit of V. Wondering if it makes sense to add to V position or take a new position in paypal. Torn between buying new stocks vs adding to old ones. Top 10 takes up big part of my portfolio. But I have lot of stocks with little bit invested.", "score": 1, "replies": []}, {"body": "Both!!", "score": 1, "replies": []}, {"body": "Both will do well. Square seems to be more innovative. I just noticed you can gift stocks to other users today. I think that will be huge in adopting new customers since there are a lot of people who are hesitant to get into the markets at these highs. I definitely  would have used this to get some friends into it and bought them some stock that pays a dividend to teach them about it.", "score": 1, "replies": []}]}
{"title": "Apple Car project sees latest staff turnover as ex-Tesla engineer leaves for air taxi startup", "selftext": "", "id": "r747sa", "created_utc": 1638439648.0, "score": 44, "upvote_ratio": 0.88, "num_comments": 32, "comments": [{"body": "Haha, that render is a Renault concept car with an Apple badge. It still has the Renault logo shape on the front", "score": 43, "replies": []}, {"body": "Tesla is the Apple car but on steroids.\n\nIdk why people expec apple to make a car. They also don't expect Ford to make a smartphone.", "score": 28, "replies": [{"body": "Tesla is actually way closer to make his own smartphone than apple would be to make his car.", "score": 13, "replies": [{"body": "They could sell model 3 screens as 15 inches tablet with very little effort.", "score": 10, "replies": [{"body": "And a beautiful cloth for cleaning it  😂", "score": 12, "replies": [{"body": "what about a 999$ stand :D", "score": 4, "replies": [{"body": "what about a $45,000 stand for the tablet that also drives you places", "score": 3, "replies": [{"body": "&#x200B;\n\n![gif](giphy|d3mlE7uhX8KFgEmY)", "score": 2, "replies": []}]}, {"body": "Stand for the cloth right", "score": 2, "replies": []}]}]}, {"body": "I think it would be a great product to integrate the powerwall, the solar panels or roof, with auto bidder. You could even manage the card from it. I wonder if it would be the ultimate smart home appliance if you add Z-wave and ZigBee support", "score": 2, "replies": []}, {"body": "15 inches is 38.1 cm", "score": -1, "replies": []}]}, {"body": "Seriously. They already make large tablets running their own OS, relatively trivial to scale that down to a phone size. Nothing new just smaller components. Building a car requires all sorts of new capabilities for apple.", "score": 1, "replies": []}]}, {"body": "I like Apple but would never ever buy a car from them.", "score": 2, "replies": [{"body": "Announcing the all new Apple car v2 now with high definition headlights….we think you’re gonna love it", "score": 4, "replies": [{"body": "Getting that thing repaired is gonna cost you a kidney", "score": 2, "replies": [{"body": "Apple care +", "score": 3, "replies": [{"body": "Lightning charge connector doubles as a headphone jack.", "score": 1, "replies": []}]}]}, {"body": "v4, and now we reinvented to turn signal, it is a small handle, that you move in the direction of your turn, isn’t it amazing? \n\nHaha, no offense, I’m a big fan of theirs", "score": 2, "replies": []}]}]}]}, {"body": "Been saying from the beginning: Apple car won't work. Their business model and internal structure is the opposite of the future and surviving automotive sector.", "score": 12, "replies": []}, {"body": "I’m not even sure it’s useful to post it … but just to say that Apple Car will probably never be a thing", "score": 6, "replies": [{"body": "A lot of good money wasted", "score": 2, "replies": []}]}, {"body": "Tesla is the new apple", "score": 4, "replies": []}, {"body": "It's obvious people see the project is in shambles and want to move to where they can have more fun and likely a bigger bonus, rather than being part of the troop of desperados trying to catch up with Tesla...", "score": 5, "replies": []}, {"body": "I remember in 2014 I thought Apple would buy Faraday Future and make that the apple car. Tbt", "score": 4, "replies": []}, {"body": "I dont understand the Apple obsession with a car.", "score": 3, "replies": [{"body": "Data, software subscription margins, and a leg up in a sector that legacy auto is dying in, leaving room for a power vacuum that's not Tesla and Chinese BEVs.", "score": 3, "replies": [{"body": "> and Chinese BEVs\n\nApple doesn't even make their phones - Foxconn does.  Foxconn is doing BEVs. :)", "score": 3, "replies": [{"body": "But no supplier for BEVs wants to work with Apple, because Apple's business model is to dump everything onto the OEM suppliers and then use their sheer size to set an asymmetric contract where they reap 90% of rewards with none of the responsibility of failure.\n\nBasically Apple with their EV wants to be able to extract huge software margins on each car and then when an accident happens claim \"well, we didn't build the car, so it's not our fault.\"\n\nApple could get away with this with phones and tablets because if they break, nobody dies. Can't do that with cars and no company wants to put their neck on the execution block just to be an Apple OEM for their BEV. That's why every single deal with them has fallen through. It's a different industry with a different breed of regulatory scrutiny and Apple is ilequipped to handle that. The only other way is to do it all themselves. But building a BEV is actually really hard. It's like 10,000x harder than building a phone. We'll see if Apple can own the entire stack and responsibility of failure and succeed.\n\nSteve Jobs got away with yelling at the customer for holding their phone wrong due to an antenna issue. Apple will get sued into the ground if they try that shit because their car drove itself off a cliff and killed a family.", "score": 6, "replies": []}]}]}, {"body": "Car industry is old, stuck to its ways and ripe for disruption. However it looks like Tesla and the Chinese got to it first; Apple may have taken too long.", "score": 2, "replies": []}, {"body": "Steve Jobs said he wanted to make one before he died of Ego Cancer.", "score": 2, "replies": []}, {"body": "It expands their TAM. On paper, they have all the pieces. I don’t understand why they wouldn’t try to make a car.", "score": 1, "replies": []}]}, {"body": "... Air taxi?", "score": 1, "replies": []}]}
{"title": "Is selling OTM leaps a good way to make passive income on my shares without losing them?", "selftext": "[deleted]", "id": "r7hsym", "created_utc": 1638480508.0, "score": 1, "upvote_ratio": 0.56, "num_comments": 34, "comments": [{"body": "Theta decays much faster the closer to expiration you are.\n\nSelling CC's will def generate income from your shares, but you'll generate more over time selling calls that are closer to expiration than you will selling leaps.", "score": 13, "replies": [{"body": "Ya so the closer the more money I make but the greater the risk of losing them. \nI guess it’s all priced in at the end of the day", "score": 1, "replies": [{"body": "Not exactly. Look at the wiki. The theta decay curve is not much until about 45 DTE. \n\nSo you don’t want to sell a year out and collect nearly no theta for 10 months. Plus price movements over the course of a year a much more difficult to predict correctly than for a month.", "score": 7, "replies": [{"body": "Or one-2 day expiration covered calls might be better. \nKeeping an eye out for ex div dates and earnings etc.", "score": 2, "replies": []}, {"body": "So basically There is no way to do so without risking losing your shares?", "score": 1, "replies": [{"body": "I sell covered calls on my bag holding PENN shares and its a great income driver. Making $500-$900 a week selling weeklies. Take a standard up week % move on AAPL and sell at the strike above that % so you most likely wont get assigned. Or you can roll up/out if you get closed to being assigned, which Ive had to do a few times and either breakeven or come out above on the roll. The weekly also gives you less time for the stock to move so you are less likely to be assigned.", "score": 3, "replies": [{"body": "Wow that’s smart. So basically set a rule like within 1-2 buck for example. \n\nIf the shares are close to my strike price within 1-2 dollars buy back to break even and roll out to the next week. \n\nHave you ever lost money doing this strategy?", "score": 2, "replies": [{"body": "Not to start a fight with previous commenter, but they’re over-simplifying a little and glossing the risk. \n\nI also sell weeklies. Many sell 30-45 DTE. The closer your strike you sell is to the stock the better premium. To keep a safe bet that you’re not going to lose your shares you won’t make much, but you’ll make something. Choose a delta you’re comfortable with. \n\nYou can’t always roll out your options into another reasonable contract without taking some loss. But your loss is essentially offset by increased share price. You’re just losing that gain on one side or the other. \n\nHave you read the whole sub wiki? It has a lot of info to answer all your questions.", "score": 2, "replies": [{"body": "I have not read it yet. I think it’s just not a good idea to do this with apple. I think this strategy is probably better with stocks im not married too. \nCan’t have your cake and eat it too I suppose.", "score": 1, "replies": [{"body": "I’ve had to roll a few times and haven’t lost money. Don’t mean to be over simplistic just making the comment and if you (the OP) has questions based on that we’d go deeper. Yes, prems are greater the closer to the current price which makes sense from a risk/reward perspective. If you get too close and stock goes over your strike you might have to pick farther out than the next week hence the roll up AND out. If you actively manage it your risk of getting assigned when you don’t want to is minimum IMO.", "score": 1, "replies": [{"body": "You’re right, didn’t meant to imply otherwise. Just that there is some risk there that can’t be avoided entirely. \n\nI do pretty much this as well. On my aapl shares no less.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Someone on the other side buying your calls is buying a chance to call them out and sell with a profit.", "score": 2, "replies": []}]}]}, {"body": "Recently starting selling CC on my 10+ year old AAPL shares...it's stressful to say the least. I'd prefer to not get assigned...sold some 170 strike 12/17 exp last week and have been biting my nails ever since. If only I'd had the balls to sell them yesterday when they were essentially ATM, I'd be deeeeep in profit, but alas, here I am still at a loss but patiently waiting for theta to bring me to the promised land. Be prepared to make adjustments.", "score": 2, "replies": [{"body": "I’m in a very similar situation to you, but my 12/17 was at the 175 strike price and I bought back at a profit. Hang in there!", "score": 2, "replies": []}]}, {"body": "AAPL is a strong company and likely will exceed whatever long dated leap you sell or it will be so far out of the money that you are making pennies.  You also can't roll anywhere near as effectively as you're already taking away your chance to roll out", "score": 1, "replies": []}]}]}, {"body": "I am married to my wife however I want them to be productive and make me passive income with a low risk of having them called away.", "score": 7, "replies": [{"body": "Have you tried rolling her?", "score": 8, "replies": [{"body": "Only if I can receive a credit for the roll.", "score": 2, "replies": []}]}, {"body": "Where on the crazy/hot scale is she? https://i.imgur.com/8w9G7BS.jpg", "score": 2, "replies": []}, {"body": "Deal", "score": 1, "replies": []}]}, {"body": "Don't do it!  Selling LEAPS is the worst as the time decay won't amount to anything until the last 2 months or so, so you'll wait all that time to see any meaningful returns only to close because you don't want your shares called away . . .\n\nIf you are married to your shares then don't have an affair with covered calls as it may end poorly . . .", "score": 7, "replies": []}, {"body": "Sell at 45DTE", "score": 5, "replies": [{"body": "your user flair would disagree", "score": 3, "replies": [{"body": "If you go long, leaps are the way…", "score": 2, "replies": [{"body": "I’m with you fam", "score": 5, "replies": [{"body": "Get the ones ATM… they have the best balance between delta leverage, gamma and vega", "score": 2, "replies": []}]}]}]}]}, {"body": "Here’s what will happen. You’re going to sell otm calls for whatever period of time, it doesn’t matter. You’re going to make a small amount of income. In one day, week or month at some point the price of AAPL will spike and blow thru your strike. In order to keep your shares you’re going to buy back the call wiping out all of your passive income gains. If you’re lucky you’ll be able to roll it out to a much longer date to break even. However, guess what usually happens when stock prices spike. They tend to fall back to the trend line. So after you’ve spent the money to close the contract wiping out your menial gains, you’re then going to lose money when the share price falls back. Don’t do it. The meager income isn’t worth it.", "score": 3, "replies": [{"body": "This seems to be the most reasonable response.", "score": 1, "replies": []}]}, {"body": "Selling leaps what?  Call or puts?  Only one of those results in you losing your shares if exercised.  \n\nSelling any options more than 60 days out is not advised…as there can be too much market volatility for little theta decay", "score": 2, "replies": []}, {"body": "Covered strangle. You'll generate more income and if you would like to hold shares long term, you be likely to assigned on puts as well as calls so have a better chance of holding your shares long term compared to covered calls.", "score": 2, "replies": []}, {"body": "Sell low Delta weeklies or monthlies.  Time decay is too low if you go beyond 2 months.", "score": 2, "replies": []}, {"body": "1 minus delta yes.", "score": 1, "replies": []}, {"body": "Upgrade to a portfolio margin account and stick to low delta options for optimal returns with low risk.", "score": 1, "replies": []}, {"body": "Have you heard of the poor man’s covered call?  That might be something you should try learning about.", "score": 1, "replies": []}]}
{"title": "Daddy JPow - The Hawk in Dove’s Clothing", "selftext": "I know a bunch of you are wondering why your calls went from +420% to -69% over the last few days, so this will help you understand how the market works and why 🌈 🐻 puts print from time to time. Nobody gives a fuck about valuations, nobody gives a fuck about hedgies and shorts, and absolutely nobody gives a fuck about Omicock variant. \n\nAll it comes down to is what the fed is doing. Literally that is the whole story. Oh, you thought JPOW getting another term was going to save us? Some of you are too young and too new to this shit to remember the end of 2018 where the father of money printers himself scared the markets into a -20% drop because of how aggressively he was going to raise rates. This guy is a rate hawk at heart, and is all too happy for there to be a reason to stop QE. Trump yelling at him and Covid kept JPOW and his interest rates at bay, but now that he isn’t running for re-election and there’s a real reason to slow the printers, it’s coming sooner than most expect.\n\nFor those of you who don’t know how this works, when the fed keeps interest rates at 0, it forces people to go into stonks because bonds and savings accounts don’t yield anything. The main driver behind this move is to stimulate the economy by allowing people to get cheap leverage to buy things and encourage businesses to borrow for expansion. Another thing they’ve been doing is buying treasury bonds from freshly printed dollars, which pumps money into the system and holds longer dated bond rates down. The lower the rates the less people care about valuations and what is actually happening in the world. It’s also why good news for the economy actually can have the opposite effect on the markets because a better economy requires less QE. \n\nSeeing as JPow is looking turn off the spigot when he recently mentioned they want to accelerate tapering bond purchases and drop the word ‘transitory’ from inflation, the 2018 Powell has returned. So what’s the play? Growthy shit will get hit the most, but everything has been riding the feds money printing boner for the last 18 months. If they don’t change their tune, expect more carnage.\n\nTldr - if you like money, don’t fight the fed", "id": "r6wayd", "created_utc": 1638411974.0, "score": 92, "upvote_ratio": 0.92, "num_comments": 33, "comments": [{"body": "As a closet gay bear, I’m in for this roller coaster.", "score": 35, "replies": []}, {"body": "I'm old enough to remember 1975-85 interest rates, and earlier. The market changes. Constantly.  \n\nI agree, the FED has so totally distorted the market that it's totally cloud cuckoo.", "score": 25, "replies": [{"body": "In my part of the world, My grandparents and parents were balling with their fixed deposits", "score": 4, "replies": [{"body": "FDs?", "score": 2, "replies": [{"body": "Yup fixed deposits", "score": 1, "replies": []}]}]}]}, {"body": "even growthy shit that is already down like 70%+ on the year though?", "score": 16, "replies": [{"body": "It can easily go lower, never underestimate how low shit can go. Look at what everyone was saying about baba in the first half of the year.", "score": 3, "replies": []}]}, {"body": "And Evergrande might default on 12/5. I've been buying FOTM FD puts since Monday in expectation of this downturn and will take profits on Friday (via spreads so I can profits if it continues to tank). And use some of those profits to buy OTM FD calls for 12/10 to prep for the likely after hours wire that is sent to avoid default.", "score": 12, "replies": [{"body": "Whats on 2021-12-05 ?", "score": 3, "replies": []}, {"body": "What ticker is this?", "score": 4, "replies": []}]}, {"body": "So what do we buy smart guy", "score": 9, "replies": [{"body": "USD will likely go up, so that’s the most obvious one. You can buy puts on/short very growthy shit like cathie stocks. Just listen to JPow for clues and if he says never mind to faster tapering, then go back to calls.", "score": 4, "replies": []}, {"body": "In true WSB fashion, I did neither of these things. Only thing I did right was dump half my portfolio at the end of last year and hedge with SPX Credit Spreads and covered calls.", "score": 1, "replies": []}]}, {"body": "He’s right. Anyone over 40 saw this movie in 2000.  Growth stocks get obliterated first (dot.coms in 2000, today Cathie Wood stuff), then they kick Big Tech in the nuts (intc, csco, mot in 2000, today it will be Faang) then they lightly smack around whatever’s left.  Amzn dropped 96% from 1999-2001 as rates inched up.  If rates start going up growth = death, tech = pain, value = survival.", "score": 9, "replies": []}, {"body": "ok take my upvote", "score": 4, "replies": []}, {"body": "Tesla calls I’m in", "score": 6, "replies": []}, {"body": "JPowell the gains goblin", "score": 6, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|28|**First Seen In WSB**|2 years ago\n**Total Comments**|105|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/f9cuob/tlt_calls/) [x](https://www.reddit.com/r/wallstreetbets/comments/m34j47/farm_gang/) [x](https://www.reddit.com/r/wallstreetbets/comments/f5tt9a/spce_put_selling/) [x](https://www.reddit.com/r/wallstreetbets/comments/fcu0r0/coronavirus_suspected_in_riverdale/) [x](https://www.reddit.com/r/wallstreetbets/comments/gad99j/xle_dd/) [x](https://www.reddit.com/r/wallstreetbets/comments/f1xgdc/actual_free_tendies_with_xbit/) [x](https://www.reddit.com/r/wallstreetbets/comments/q8qo8l/toasty_tendies_ahead_tost/) \n**Account Age**|5 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=r6wayd)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=r6wayd)\n    \nHey /u/doublemctwist1260, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 1, "replies": []}, {"body": "Dis good dd. Maybe some charts with dickz and more insults next time. I bought puts after i read this.", "score": 2, "replies": []}, {"body": "Put on Tesla, I tried 10k a year, now it is time", "score": 2, "replies": []}, {"body": "Why does lower rates mean people don’t care about evaluations? Genuinely curious thanks", "score": 2, "replies": [{"body": "Companies are priced for future growth. The cheaper debt is, the more they can borrow for insane growth essentially for free with how low rates are. This is why companies can trade at ridiculous valuations for a very long time in these conditions.", "score": 3, "replies": []}]}, {"body": "Can’t wait for a crash so I can buy up everything.", "score": 2, "replies": []}, {"body": "Take a Valium and chill", "score": -1, "replies": []}, {"body": "It will take years for fixed income to start becoming attractive, even if rates go up by a couple dozen bps in the next few months.", "score": 1, "replies": [{"body": "Considering how cheap it is to finance growth, even a small increase in yields will hurt the growthier shit. It doesn’t take much considering the current state of valuations.", "score": 1, "replies": []}]}, {"body": "Fed tapering tho, so your rate hike is a few months out. Fed still buying fk ton of bonds music still plays", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4276)", "score": 1, "replies": []}]}
{"title": "Apple Tells Suppliers iPhone Demand Has Slowed as Holidays Near", "selftext": "", "id": "r6wtm5", "created_utc": 1638413474.0, "score": 62, "upvote_ratio": 0.85, "num_comments": 38, "comments": [{"body": "So the newest iPhone isn’t that much different than the previous model?  That’s crazy", "score": 46, "replies": [{"body": "Shocking i tell you. Shocking!", "score": 2, "replies": []}]}, {"body": "Apple is going to be riding the new MacBookPro wave for 3-5 years.", "score": 18, "replies": [{"body": "Are Macs sold at large amounts? I thought people knew their overpriced hardware. Even for Apple", "score": 2, "replies": [{"body": "Apple is now using their own ARM processors called system on a chip (SoC) which has the ram, gpu, and processors all on one chip.\n\nHere are the benefits\n\n\\- Much better performance compared to Intel\n\n\\- Vertical integration  means not paying Intel or AMD anymore\n\n\\- New architecture is making all software companies to build for the new SoC\n\n\\- All the companies with intel based Macs are now going to be upgrading\n\n\\- A lot of unhappy MBP users holding out their old MBPs are upgrading left and right\n\n\\- Ridiculous battery performance\n\n\\- Even PC people on YT are giving credit to Apple for amazing performance\n\n\\- People like me are upgrading because nobody wants to own or buy Intel based MBPs", "score": 19, "replies": [{"body": "New MBP is so good that everyone with the old ones have to upgrade. They are so good that the upgrade is huge over every previous model without the M1.\n\nAnd the speakers are night and day better, so even the casual user with cash will upgrade.", "score": 7, "replies": [{"body": "Personally i think the opposite, when competition on PC have moved on to high refresh screens, external GPU’s, user replaceable everything (including RAM, SSD’), expandable peripherals etc, Apple is making their Pro machines less “Pro” and hoping to shaft the gullible buyer with fancy marketing. M1 is efficient, but the architecture comes at a steep cost, no longer can you run windows and “pro” software on your mac as the m1 simply doesn’t support it, plus the SSD and Ram is practically un upgradeable and any issues down the line will require you to replace the entire main board. Its really a shitty device for any “pro” worth their salt.", "score": 3, "replies": [{"body": "I agree that lack of upgradability is a limiting factor, but I think you are taking a limited view of what “Pro” work is targeted to. PC workstations and servers running Windows or Linux are already dominant in many of the fields that would require beefy discrete GPUs (CAD, AI/ML) or highly upgradable storage/RAM (rendering, NAS, databases, webservers, IT infrastructure).\n\nWhat Apple means by “Pro” are either very small businesses, people who work for companies with enough money that they can just use remote cloud/on-prem compute resources, or people who just need to run Microsoft Office/Chrome and like Apple’s brand/UX. For all of the users Apple is targeting, a computer not getting in their way is much more important than that computer being itself capable of the most computationally demanding tasks they may need computers for. Apple is focusing heavily on features to make their computers not get in people’s way: long battery life, no fan noise, Airplay/Airdrop/Handoff/Personal Hotspot, automatic display calibration, really good audio/display subsystems, TouchID, etc. \n\nI am a software developer, and I write Linux software using my Mac. I just push my code to a server, so my computer doesn’t have to be insanely capable itself. We have dedicated hardware for our most demanding workloads, I just login into that remotely when I need 256GB of RAM to do something. Everyone at my work is issued a Mac, and this is very common in organizations with a lot of young professionals, even those that have PC towers under everyone’s desk to run whatever crusty Windows applications the business absolutely depends on. Go to any university, and I bet you will see like 90% Macs - these are the “Pros” who Apple is and has been targeting.\n\nI think you are focusing too much on the specs and not really considering what people actually want from their computers they carry around. User experience is far more important than specs. The set of users that just want the most frictionless computer to do creative work, send some emails, or browse the web while at home or travelling is a much larger set of “Pros” than those who need a 3070, 128GB of RAM, and 8TB of storage in their laptop", "score": 0, "replies": [{"body": "You are referring to very niche use cases and if you notice, all your stuff is reliant on windows machines and the mac is merely and accessory in your workflow. In the real world, this is an unnecessary expense to large corporates in a majority of sectors apart from IT and this is why Apple still holds a tiny fraction of the PC market worldwide.", "score": 0, "replies": []}]}]}]}, {"body": "And MBP designs have been shit between 2017-2020 so a lot of people are using 2015-2016 models (more ports, no stupid Touch Bar, etc…)", "score": 1, "replies": []}]}]}]}, {"body": "I checked the Verizon website and they are back ordered into January. Kind of a mixed message.", "score": 11, "replies": []}, {"body": "My family all got iPhone 13 and iPhone 13 Pro Max and are back ordered until end of January.", "score": 8, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Bought them all on release day up to the 11. Its like 2 years old now? It's fine.", "score": 0, "replies": []}]}, {"body": "Blood bath confirmed for Tomorrow, no one can hold SPY now.", "score": 9, "replies": [{"body": "CNBC has futures up, which is weird because all Bloomberg can talk about is how hedge funds are dumping and Asia is down.", "score": 9, "replies": [{"body": "Another open high, free fall, close lower maybe.", "score": 12, "replies": []}, {"body": "Yup pump the futures so dip buyers smell blood, then once they are all in by mid day pull the rug", "score": 6, "replies": []}, {"body": "Future is a lie, it is a bear trap.", "score": 2, "replies": [{"body": "It was weird how it happened. It showed them down at the close, they all went gray, then there was a blink and they all turned green after hours around 6:15.", "score": 0, "replies": []}]}]}, {"body": "Or ya know apple can fall and spy can rise", "score": 0, "replies": []}]}, {"body": "Well shit. My family just upgraded for four new iPhone 13 pro Maxs. I guess we’re the ones driving the market. But the trade-in values for the old phones were soooooooooo good.", "score": 3, "replies": []}, {"body": "They run this story every fucking year at this time. Usually it’s Digitimes or equivalent, but Bloomberg has really gone down the toilet in recent years.", "score": 3, "replies": []}, {"body": "Wonderful News!", "score": 2, "replies": []}, {"body": "![img](emote|t5_2th52|4263)", "score": 2, "replies": []}, {"body": "This is what happens when you price a phone as much as an old used car.", "score": 0, "replies": [{"body": "People will give up their cars before they give up their phones...", "score": 4, "replies": [{"body": "Truth.", "score": 0, "replies": []}]}]}, {"body": "Because everyone who wants one has one and you made too many fucking models.", "score": 0, "replies": []}, {"body": "Title is sensationalist garbage.\n\nDemand hasn’t slowed, but the demand forecast for the holidays has been lowered based on inflation. / covid concerns…. Yet even the new forecast predicts a 6% sales increase for first 3 months of the year. Which is excellent'", "score": 0, "replies": []}, {"body": "News posts **must be market moving** and contain **new** information. Please avoid editorializing the title. \n\nIf your post doesn't meet the requirements above, please delete the thread before a mod sees it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|20|**First Seen In WSB**|1 year ago\n**Total Comments**|25|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/r61h7w/bull_bear_cases/) [x](https://www.reddit.com/r/wallstreetbets/comments/g3ippg/serious_gambling_guide_for_the_next_two_weeks_420/) \n**Account Age**|4 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=r6wtm5)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=r6wtm5)", "score": 1, "replies": []}, {"body": "Sold mine last month at $152-153 ish.", "score": 0, "replies": []}, {"body": "What for the first quarter tesla numbers are going the opposite direction as predictions.", "score": 0, "replies": []}, {"body": "Have people finally decided to stop buying the same phone each yr?", "score": 0, "replies": []}, {"body": "Stock was just raised to $200 PT", "score": 0, "replies": []}, {"body": "I’m using an iPhone Xs and have seen absolutely no reason to upgrade over the last three generations.  There have been zero new features of any sort that add any value for me. Marginally faster processor and better camera don’t matter to me. I’ve already got 12 MP and I haven’t noticed any slow down at all over the past 3 years.", "score": 0, "replies": []}, {"body": "Lol yeah thats why i cant just walk into a store and buy an iphone 13 pro", "score": 0, "replies": []}]}
{"title": "Apple Tells Suppliers iPhone Demand Has Slowed as Holidays Near", "selftext": "", "id": "r76kef", "created_utc": 1638448693.0, "score": 14, "upvote_ratio": 0.68, "num_comments": 35, "comments": [{"body": "If you think iPhones are the reason AAPL touched $170, you were probably touched as a child", "score": 27, "replies": [{"body": "I enjoyed this comment so much I wanted to say I hope your have a great rest of your day & a wonderful holiday season. 🤝", "score": 3, "replies": []}]}, {"body": "Ah, so there’s a reason it’s tanking other than an 85 rsi? My 160 weekly puts I bought yesterday are gonna be on fire at open. Wonder if I should sell or not (probably yes)", "score": 6, "replies": [{"body": "IF they decide to keep the market up they will buy AAPL.", "score": 4, "replies": [{"body": "Not at a nearly 3T market cap and rsi near 90", "score": -1, "replies": [{"body": "Stranger things have happened. Short this bad boy 2-3 weeks out w/ options.", "score": 1, "replies": [{"body": "Yea, agreed. I just knew it was gonna tank along with spy so I got cheap weeklies (only .17 yesterday, .7 at close, and god knows what they’re gonna be at open, maybe 2?) that I wouldn’t mind losing.", "score": 1, "replies": []}]}]}]}, {"body": "AAPL is dangerous when it’s down because people have been programmed that share price doesn’t matter with it", "score": 2, "replies": [{"body": "I’m a wimp and sold 20 seconds after open. I’ll take 14x one day returns every time and you’re probably right that it’s going green", "score": 3, "replies": [{"body": "I found with IV spike that’s generally best for all options but definitely puts", "score": 2, "replies": [{"body": "You’ve noticed it’s different with puts vs. calls? I’ve just noticed that the iv is a bitch and a half and if you called it right you should just take your shit and run while you still have shit to run with", "score": 2, "replies": [{"body": "Usually stocks drop at open and IV spikes so holding a put all day is a time bomb especially with AAPL", "score": 3, "replies": []}]}]}]}, {"body": "I’m probably selling right at open :)", "score": 1, "replies": []}]}]}, {"body": "Aapl down bigly premarket", "score": 2, "replies": []}, {"body": "Bulli... Oh shit, it's almost like the underlying economy is not very strong and the money printers slowing down...", "score": 1, "replies": []}, {"body": "That's what happens when you make a more expensive phone and 95% if the people who buy it are sitting at home collecting unemployment😅", "score": -6, "replies": [{"body": "Most people who are unemployment buy an android not apple..", "score": 9, "replies": [{"body": "Lol no.\n\nApple is a poor person image retaining product.\n\nIt's all about showing off how much money you have. Guess what kind of person feels a need to show of? \n\nA rich person?\n\nOr some poor fucker collecting unemployment. \n\nSpoiler: it's the poor fucks who want to appear rich.\n\nSmart people use androids.", "score": -9, "replies": [{"body": "This is perhaps the most retard thing I’ve read in a week.\n\nIOS users on average earn more and are generally more educated than Android users. There are countless studies on the matter. Pick one.\n\nThis is coming from a guy that uses and likes both of them for different things.", "score": 4, "replies": []}, {"body": "Lmfao it’s just a ****ing phone get over yourself 😆\nPeople have preferences, you think people actually give a **** what other people are using?\nYou actually think smart people use one type of phone? Lmfao last time I checked even the stupidest people use android, has nothing to do with intelligence, it’s just a phone. Not the cure to world hunger 🤣", "score": 2, "replies": []}, {"body": "Smart people use android oh fan boy alert😂 im making proper money and use a old iphone 7 😂 im not unemployment or poor😂😂😂", "score": 1, "replies": [{"body": "Keyword here is old. \n\nTheres a whole crowd of morons who must purchase the latest phone otherwise they wont appear as rich as they want to be.", "score": 2, "replies": [{"body": "That is a huge reach and you know it. You sure you’re not annoyed with your classmates? :)\n\n(Maybe I’m nuts but a cellphone isn’t wealth)", "score": 0, "replies": [{"body": "That's how youth sees it, they don't even use it for anything but instantaneous and Facebook? \n\nI'm not saying wealthy people don't buy it. I'm saying that specifically poor people are a massive consumer of apple products. \n\nDo you have any idea how many morons i know who can not afford neither rent nor food yet they spend a couple of months of rent for the latest iPhone and then starve?\n\nThe answer is a lot.", "score": 1, "replies": [{"body": "In the same way that broke people buy bmws and can’t afford anything else maybe? That’s poor decision making that keeps you poor and I’d blame financial literacy and literal idiocy before I’d use that as reason to call a company shit lol. \n\nTo say smart people only use one OS is real short sighted and comical at best. I do not know your morons but I’m aware they exist. I don’t think it matters whose taking your money if you’re that uneducated.\n\nTell the peeps you know to dream bigger I suppose.", "score": 1, "replies": [{"body": ">Tell the peeps you know to dream bigger I suppose.\n\nIve given up on that. No amount of reasoning would do any good, they are the victim in their own head and everyone is to blame. \n\nHave had multiple discussions with people running IOS in university engineering setting then being mad that a lecturer requires you to use a program that requires windows. At least have the brain capacity to sideload the one OS they ask you to have in order to be compatible. \n\nA lot of those people stopped halfway through the education.", "score": 1, "replies": [{"body": "Haha I absolutely feel you man. My apologies for coming off the way I did. \n\nI remember babying a lady friend in college thru her first non osx laptop it was amazing how frustrated she got. (She’s a smart cookie just not her forte)\n\nI enjoy my dumb phone for what I do (sftp/adding torrents/various apps/ pictures sharing) I won’t pretend the file management is nice or anything though! Certainly doable but not what I could do with my droid. I do think it makes for a better phone overall. You just have soooo much more possibility with a droid but I do like when apple does something it does do it well.  Take her easy!", "score": 1, "replies": [{"body": "> Haha I absolutely feel you man. My apologies for coming off the way I did.\n\nIts understandable. The way I worded it implied all who buy it are poor which obviously doesn't add up. And that isnt what I was trying to say.", "score": 1, "replies": [{"body": "Not about wealth friend. \n\nMaybe I need to try the latest droid but I’ve been droid my whole life and I’ve only been happy with my phone rooting romming and lots of effort for things that worked half the time. I appreciate the idiocy of this just works crap. It does just work and I’m 3 years on this phone. Gaming or private trackers or whatever seems to work just fine. My remote control apps work better actually. Apple silicon is exciting. Much love dude!", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "News posts **must be market moving** and contain **new** information. Please avoid editorializing the title. \n\nIf your post doesn't meet the requirements above, please delete the thread before a mod sees it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|31|**First Seen In WSB**|1 month ago\n**Total Comments**|120|**Previous DD**|\n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=r76kef)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=r76kef)", "score": 1, "replies": []}, {"body": "This was obviously true during earnings when the stock should have tanked but someone wanted my puts worthless.", "score": 1, "replies": []}]}
{"title": "NIO: Addressing Near-Term Risks.", "selftext": "**Call to Action**\n\nDrawing attention to the key downside risks of NIO, intending to highlight risk in two areas: company risk and sector risk. The intent is to better inform and understand the view on the stock, moderating excessive exuberance, leading to a more solid, objective foundation for further analysis and discussion.\n\n  \n\n**Highlights:** NIO’s company-specific risks stems from a lower production ramp compared to competitors, the lack of own manufacturing capabilities, and comparatively lower investment in research and development. The EV sector is vulnerable to credit and funding risk as companies must establish capital-intensive investments to rapidly scale up production to gain market share. \n\n***Company Risk - Production***: Until the NEOpark facility is completed, NIO will not have its own production capabilities. The most recent news reports production capacity at the Hefei plant to be at around 10,000 vehicles per month, a production number that NIO has only hit twice so far this year (Sept and Nov). December will be an important gauge to see if the 10,000 monthly number is sustainable, as well as how the product mix will shift after the introduction of the ET7 in 1Q22. \n\nNIO’s production line expansion to 20,000 units monthly is expected to finish in 1H22; with extra shifts, this would expand to 25,000 units monthly. However, in the short term, both LI and XPEV have outpaced NIO in month-to-month deliveries. It remains a question whether LI and XPEV’s production expansion will outpace NIO’s own production expansion.\n\n***Company Risk – Research and Development***: NIO saw a pullback after the assisted driving feature on the ES8 caused a fatal crash. Comparing among the top three EVs in China, NIO is a laggard in the industry, with XPEV and TSLA having more mature assisted-driving technologies. While TSLA has had both time and experience with the research and development of self-driving technologies, the same cannot be said when comparing XPEV and NIO. Using same-size comparisons, in 3Q21 XPEV’s R&D spend was nearly double NIO’s (22% of revenue vs 12%). In 2Q21, XPEV’s R&D was 23% of revenue vs NIO’s 10%. In 3Q20, XPEV’s R&D was 32% of revenue vs NIO’s 13%. The difference is so large that XPEV has outspent NIO in R&D in all three periods, in absolute currency. While refraining from a direct relationship between R&D spending and results, the lack of R&D spending still does not inspire confidence.  \n\n***Sector Risk***: Any increases in the interest rate environment will negatively impact EV startups by discounting future growth and increasing the cost of capital investment. Established auto manufacturers like Ford and Stellantis have strong ICE-Auto portfolios which generate sustained income (in the near term), and financing capabilities that allow them to weather any turbulence. Startups don’t have this capability. This makes EV stocks especially vulnerable to any disruption in the liquidity/funding chain (see <$2 NIO in March 2020) and to increases in the cost of capital. Going forward, valuations of hyper-growth EVs should more resemble capital-intensive tech-hardware, in order to better reflect the needs of production, scaling, and investments.", "id": "r7dlwm", "created_utc": 1638469146.0, "score": 3, "upvote_ratio": 0.55, "num_comments": 34, "comments": [{"body": "Are you saying there is no hope for NIO bag holders ?", "score": 4, "replies": [{"body": "I'm addressing the Risks of investing in NIO. Doesn't change the fact I'm positive but makes clear the risks involved.", "score": 2, "replies": [{"body": "Gotcha .. what’s you take on BLNK?", "score": 1, "replies": []}]}, {"body": "Not much unless they leave China.", "score": 0, "replies": []}]}, {"body": "As soon as Didi delists and completes their move to HKE and the media start reporting on how many honest hard working americans lost money on Didi, then NIO is going to die hard.\n\nInstead of buying back the ADR's at IPO price, they decided to be snakes and delist and got HKE. ultimate rug pull literally in less then 1 month. Polititians are going to rip up all these other companies and Baba, Nio, all going to be collateral damage.", "score": 2, "replies": [{"body": "Viewing the issue objectively, DIDI had this coming. They really did manage to piss off both the Central Government and the Federal Government at the same time. Truly an impressive feat.  \n\n\nOn the other hand, NIO will be at a discount if they don't get rekt.", "score": 3, "replies": []}]}, {"body": "Would the SEC news about moving a step closer to delisting any chinese companies that do not fully disclose their books be another risk to mention as well?  It appears to be causing a slide right now.", "score": 2, "replies": [{"body": "What's happening?", "score": 1, "replies": [{"body": "https://www.bloomberg.com/news/articles/2021-12-02/u-s-regulators-move-step-closer-to-delisting-chinese-companies", "score": 1, "replies": []}]}]}, {"body": "Nice post. Tempering the wind in the sails….", "score": 2, "replies": []}, {"body": "NIO is the next Mitsubishi of the electric car industry.", "score": 3, "replies": [{"body": ":(", "score": 2, "replies": []}]}, {"body": "don't forget about this, probably the biggest threat. You have to have them hairy to put money in Chinese stocks\n\n[https://www.bloomberg.com/news/articles/2021-12-02/u-s-regulators-move-step-closer-to-delisting-chinese-companies](https://www.bloomberg.com/news/articles/2021-12-02/u-s-regulators-move-step-closer-to-delisting-chinese-companies)", "score": 0, "replies": []}, {"body": "I personally think NIO can’t survive in China.", "score": -3, "replies": [{"body": "I’m the opposite. I believe it’ll be the only one to thrive in China", "score": 11, "replies": [{"body": "You need to book a trip to China asap", "score": 1, "replies": [{"body": "Why do you feel thst it wont survive in china?", "score": 1, "replies": [{"body": "1.They want to be a Chinese tesla but they are inferior than several Chinese brands in mainland. \n2.their operating cost is just too high due to the battery swap operation.\n3.they actually bought AV system from mobile eye, that they don’t have any in house development system unlike they claim\n4. Their cars are just average with premium price. \n5. They still can’t produce their own cars yet.", "score": 1, "replies": [{"body": "Are nio cars very uncommon in china?", "score": 1, "replies": [{"body": "They only delivered like 4000 cars in October 2021, it is like a tiny dust in Chinese market. No one could even know what the fk is their car.", "score": 0, "replies": [{"body": "I mean when tsla started they also sold few cars. How do you expect any new car company to sell more than that. Tesla only started doing much better once they entered chinese market. I feel that you might be biased against nio. Not that you shouldnt be. You have a right to have yer opinion. But every point u made makes me believe you dont understand how auto companies work.", "score": 0, "replies": [{"body": "You need to visit China and see how business can work there. Tesla is an unicorn, NIO is not.", "score": 1, "replies": [{"body": "The fact that you think a company only delivered a few thousand cars means its incapable, is enough to tell me you dont understand how businesses work. If you go back and check the data on tesla. You will see even tesla struggled early on. They delivered very few vehicles. They eventually figured out how to get good amount of deliveries done. They arent at great production levels like legacy automakers even now. But its okay. I understand your point and yer bias against it. No point disucssing with you. Have a good day sir", "score": 3, "replies": [{"body": "Stop comparing NIO to Tesla. Lmao, Elon basically founded the electric car industry, he is the first and the only first.  A copy cat like NIO won’t survive a model like Tesla. I could recommend you to take some business courses widely available in MOCC.  Again, stop thinking NIO is Tesla. No Chinese could consider NIO is a equivalent to Tesla. Just the Tesla brand would worth the premium, NIO isn’t.\n\nAnd there are lots of Chinese EV company has massive produced EV already. You are just so naive that NIO is the only option there.", "score": 1, "replies": [{"body": "Elon didn't even found Tesla. what a shill", "score": 1, "replies": [{"body": "I said he found the electric car industry not the Tesla. If it is not him, the whole world might not adapt to electric car in 2021. ICE companies want to keep ICE cars as long as possible. \n\nYou can keep your “NIO” thesis, but copy cat generally can’t do well. NIO isn’t a disruptive innovator, either.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "$CLOV to 1000...YOLO", "score": -1, "replies": []}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|11|**First Seen In WSB**|11 months ago\n**Total Comments**|33|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/r7dlwm/nio_addressing_nearterm_risks/) [x](https://www.reddit.com/r/wallstreetbets/comments/n4xon5/nio_after_earnings_analysis_and_valuation/) [x](https://www.reddit.com/r/wallstreetbets/comments/obnfa3/nio_q2_earnings_preview_new_news_june_delivery/) [x](https://www.reddit.com/r/wallstreetbets/comments/lwarj5/molsoncoors_beverage_co_tap_dd_eps_valuation_and/) [x](https://www.reddit.com/r/wallstreetbets/comments/lwax0x/molsoncoors_beverage_co_tap_dd_eps_valuation_and/) [x](https://www.reddit.com/r/wallstreetbets/comments/mzc1t3/edwards_lifesciences_nyse_ew_q1_earnings_and/) [x](https://www.reddit.com/r/wallstreetbets/comments/noficl/weekend_dd_ev_market_and_analysis/) [x](https://www.reddit.com/r/wallstreetbets/comments/n15j46/my_predictions_for_nio_q1_earnings_and_results/) \n**Account Age**|3 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=r7dlwm)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=r7dlwm)\n    \nHey /u/TheAbyssBlinked, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 1, "replies": []}]}
