{"title": "What are your top 3 stocks to own during a recession?", "selftext": "A recession could be around the corner in the next few upcoming years, i want to hear what stocks you would hold during that period. Thanks for any input!", "id": "c50xn3", "created_utc": 1561429881.0, "score": 0, "upvote_ratio": 0.25, "num_comments": 13, "comments": [{"body": "Literally just VTI", "score": 9, "replies": []}, {"body": "Lockheed Martin\n\nRoyal Dutch Shell\n\nProctor & Gamble", "score": 6, "replies": [{"body": "A defense company? Why?", "score": 2, "replies": [{"body": "Because its customers (governments) have deep pockets and don’t care about debt. They buy bombs, planes, and rockets in a good economy and during recessions. They are the perfect customer.", "score": 12, "replies": []}, {"body": "There has only been a reduction in military/defense spending from 2011 to 2012-2017, but it has been rising from that reduction. It is a hawkish military spending Congress, so I don't see another reduction anytime soon too.", "score": 2, "replies": []}]}]}, {"body": "UTI", "score": 3, "replies": []}, {"body": "PM \n\nPeople always start smoking in a recession.", "score": 3, "replies": []}, {"body": "The idea of a recession is not so simple that you can pre-plan the best way to invest through it.  The circumstances must be known first.", "score": 3, "replies": []}, {"body": "During a recession I would buy as much vti or vtsax as I could and bank on it during the recovery period.", "score": 2, "replies": []}, {"body": "Disney - Nostalgia: mankind’s second greatest weakness\n\nPepsi - Soda and Lays, two things people love\n\nAmazon - one day shipping and easy access to spend money on things you don’t need. Also good at evading taxes", "score": 2, "replies": []}, {"body": "A recession has been around the corner for the past four years.", "score": 2, "replies": []}, {"body": "Generic Drugs?", "score": 2, "replies": []}, {"body": "CHTR - no one is canceling broadband, pay TV margins are low so even if pay TV losses continue - it's not that impactful to the bottom line, cash flow/share growing 20%, management will buyback a ton of stock if the stock goes down during a recession, and Tom Rutledge and Liberty are top notch managers", "score": 1, "replies": []}]}
{"title": "MSFT will plunge, Jefferies analyst says", "selftext": "https://www.barrons.com/articles/microsoft-stock-will-plunge-analyst-says-51561472607\n\nMicrosoft stock will drop significantly because of its elevated valuation, according to Jefferies.\n\nThe back story. Microsoft shares (ticker: MSFT) have risen about 35% this year due to investor enthusiasm over the company’s Azure cloud-computing business and its success in selling software subscriptions such as Office 365.\n\nIn April, the company reported better-than-expected fiscal third-quarter earnings results.\n\nWhat’s new. Jefferies analyst John DiFucci on Tuesday reiterated his Underperform rating for Microsoft stock, predicting weaker-than-expected profitability for its Azure cloud-computing business—and comparing it unfavorably to Amazon.com ’s (AMZN) Amazon Web Services.\n\n“Azure will probably never see the margin broadly expected due to cultural and technical factors,” DiFucci wrote. “We believe that Microsoft, the stock, is materially overvalued.”", "id": "c59yzl", "created_utc": 1561475488.0, "score": 4, "upvote_ratio": 0.67, "num_comments": 16, "comments": [{"body": "MSFT is trading down 2% currently. The projected price of $80-90 a share seems far too low.", "score": 13, "replies": []}, {"body": "lmao sure.  But whatever.  If it drops a lot then most of my money would be directed at MSFT", "score": 11, "replies": []}, {"body": "Good, I hope this article makes people sell so I can buy up more. The increase of the share price is not just as result of the companies investment in the cloud, but their overall strategy. They are one of the #1 developer communities, with open source being a top priority. They have a money making machine with the subscription based enterprise software and individual license model.", "score": 7, "replies": []}, {"body": "This analyst has had an underperform rating on MSFT since 2014. Yet the stock still moved on his report.", "score": 4, "replies": []}, {"body": "\"Plunge\" - Most retailers don't want there SaaS products they buy on AWS for obvious reasons. MS is a clear alternative.", "score": 5, "replies": []}, {"body": "That's nuts.  It doesn't matter if AWS stays the leader; it's a high growth field with room for many players, and anyone already running MSFT software will feel compelled to use Azure.  AWS is much more targeted towards open source solutions.  Then with 360, MSFT is positioned very well.  29.5 P/E is hardly \"materially overvalued\".", "score": 3, "replies": [{"body": "I don't think you are doing stocks for a long time.\n P/E 30 is by objective standards very high, especially for a stock that most consider value and not miracle growth.\n\nIn dont have a strong case for or against MSFT but 30 is pretty high up there. Remember this isn't weed or vegan beef.¯\\\\\\_(ツ)\\_/¯", "score": -4, "replies": [{"body": "That's not that high for Technology, dude.", "score": 6, "replies": [{"body": "Its not bout Tech or Financials or Utility. 30 is objectively a high PE for a VALUE stock.", "score": -4, "replies": [{"body": "I'm not sure MSFT should be considered a \"value\" stock at this juncture. They are growing revenues by 10-15%, which is certainly not in line with traditional value names like banks, consumer staples, and big pharma, which grow at 1-2% YoY.", "score": 6, "replies": []}, {"body": "I redefined value to be any company Id buy that Id keep to let my grandkids inherit", "score": 1, "replies": [{"body": "U know what if you think P/E 30 \"is not that high\", that now that the P/E is 29 u should put serious funds into it because its a bargain.", "score": -1, "replies": [{"body": "They are my largest holding out of 58 holdings.", "score": 1, "replies": []}, {"body": "Umm huh.  Well, personally, I bought 10 Jan 2020 120 Calls @ 17.49 when MSFT was almost exactly at the low today, so I suppose I did put some funds into it (17.5k worth) to leverage 1,000 shares.  I'm already up almost 3%, so much thanks to the dimwit analyst!", "score": 1, "replies": []}]}]}]}]}, {"body": "I've been doing stocks for a few decades bud... historic P/E on MSFT is around 25.  29.5 is not \"materially overvalued\" as it grows faster and adapts to more of a SAAS based model and strong cloud growth.  Perhaps you haven't been around long enough to understand that P/E ratios are highly relative to growth rate and future earnings?  ¯\\_(ツ)_/¯", "score": 1, "replies": []}]}]}, {"body": "Doubt it will plunge but I am surprised how well MSFT is doing from a share price standpoint.\n\nCompare to Google.    In 2018 Google paid huge fines and still made more money then MSFT has ever made in a year since it was founded in 1976.\n\nPlus Google is growing at about 20%.   Yet Google is worth less money than Microsoft.\n\nOr compare to Apple.   Apple made over $60 billion last year.", "score": 1, "replies": []}]}
{"title": "Anyone here going long on stocks such as $QQQ ?", "selftext": "Seeing that we're coming up on the end of this Prosperity cycle and should start to head into a recession at some point, are any of you going long on ETFs that short the economy? If you look at QQQ's 5 year it might not be a bad idea to just take a risk and drop a $1,000 to $2,000 in for shits and giggles. Worst case scenario you're out a couple Grand, best-case scenario you make about $10,000 or more.", "id": "c5c7xz", "created_utc": 1561484571.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 11, "comments": [{"body": "Why is the expense ratio so high? Right now I'm putting $53.85 every weekday into VTI and the expense ratio is 0.03%.", "score": 5, "replies": [{"body": "I personally like QQQ a lot. A strong growth ETF. I’ve had positions in qqq and vti since early 2018. To put things in perspective vti is +9.5% and qqq is up 12%. The expenses ratio is higher because it’s just more actively managed. 3% difference year over year, compounded over a decade makes a huge difference and is worth the expense in my opinion, but VTI is still a good conservative pick.", "score": 1, "replies": [{"body": "Hmmm. How is QQQ different from VTI? Is Nasdaq also companies in america?", "score": 1, "replies": [{"body": "Positions within QQQ are more actively traded within the ETF. That’s why the charge a higher expense fee. So they dump underperforming stocks quicker and therefore the overall portfolio under the ETF SHOULD (and has for me) outperform VTI or the S&P ETFs.", "score": 1, "replies": [{"body": "Hmmm. I have just looked into qqq and they are like a baby VOO with only 100ish holdings and are very tech heavy. I'll probably stick with 100% VTI and not split my pie.", "score": 1, "replies": [{"body": "Nasdaq 100 (QQQ) and S&P 500 (VOO) are different indices, though there is some overlaps since S&P 500 includes companies listed on the Nasdaq.", "score": 1, "replies": [{"body": "I read up on Nasdaq and its very tech like VGT", "score": 1, "replies": []}]}]}]}]}, {"body": "Why VTI over VOO? More total market exposure? They are very similar return wise", "score": 1, "replies": []}]}]}, {"body": "If you think the market will go down , it’s SQQQ you want to hold .", "score": 2, "replies": [{"body": "I'm long VXX.  Biggest gamble I've ever made, but this market is about to crash.", "score": 1, "replies": []}]}, {"body": "I like VGT almost just as much as QQQ any idea why it’s not as popular?", "score": 1, "replies": []}]}
{"title": "Tesla community mobilizes to help in Elon Musk’s end-of-Q2 push: Here’s why they do it", "selftext": "", "id": "c5b7ic", "created_utc": 1561480584.0, "score": 38, "upvote_ratio": 0.83, "num_comments": 14, "comments": [{"body": "This sort of community backup is unprecedented. I get that Tesla needs to handle its own, but it's quite a positive indicator to see current owners rallying behind Tesla. What other large companies can make a claim to something like this?", "score": 7, "replies": []}, {"body": "Maybe some of the volunteers are shareholders? You could say part owners are pitching in to help ;)", "score": 2, "replies": [{"body": "I agree,\n\n if Shorts can pend their free Time trying to bankrupt the Company so can Bulls do the opposite", "score": 3, "replies": []}]}, {"body": "Its mainly the us because of tax incentives", "score": 4, "replies": []}, {"body": "Volunteering for a for-profit corporation is nuts.", "score": -9, "replies": [{"body": "There are plenty of non-profits that end up pocket-lining while barely helping the world so I wouldn't draw that broad of a stroke.", "score": 13, "replies": [{"body": "Yes there are bad non-profits you can donate time and money to. Duh. But ALL for-profit corporations are bad to donate time and money to where there is no return.\n\nI'll be extra super clear: Volunteering for a for-profit is stupid AND illegal for almost all cases.\n\nGet paid for your work, you fucking goobers.", "score": -4, "replies": []}]}, {"body": "well TSLA doesnt turn a profit soooo", "score": 11, "replies": [{"body": "That's not what for profit means.", "score": -7, "replies": [{"body": "woosh", "score": 10, "replies": [{"body": "An unfunny joke isn't the same as a woosh, buddy.", "score": -7, "replies": [{"body": "you seem angry", "score": 4, "replies": [{"body": "Yes dumb, unfunny attempts at jokes make me furious you found my weak spot.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "These people can be shareholders or they may consider Tesla  to be more than just a company and more like a movement or a revolution for a better Earth. Anyway, let them be they are not hurting anyone.", "score": 1, "replies": []}]}]}
{"title": "Short Interest of TESLA decrease to 41M as of 6/14", "selftext": "As of 6/14/2019, TSLA short interest decrease to 41,459,902 compared to 43,664,833 5/31/2019.\n\nLink to the short interest:\n\n[https://www.nasdaq.com/symbol/tsla/short-interest](https://www.nasdaq.com/symbol/tsla/short-interest)\n\nThe path is pretty clear:\n\nAs of 5/15/2019 37,569,877 TSLA shorted with price at 230, after two weeks shorting the stock price reduce to 185 with interest 43,664,833 which is 6M more shorted stocks.\n\nAfter two weeks recovery, the stock price rise to 215 but only 2M were recovered.\n\nTwo possible scenarios, shorts keep pushing the stock like this week and the short interest keep piling up.\n\nOr shorts try to recover but every buy back result into double speed pull back of the stock price.", "id": "c5er3x", "created_utc": 1561494729.0, "score": 13, "upvote_ratio": 0.74, "num_comments": 14, "comments": [{"body": "[deleted]", "score": 5, "replies": [{"body": "This guy is collecting data from all kind of media then calculate the short interest by his own hypothesis.\n\nThe only known entry for trustable short interest is from NASDAQ website.", "score": 9, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Why? I guess may he is trying to sell his product?\n\nYou have to be very very cautious on all the information in the internet.\n\nCompared to internet, even Elon musk himself is much more trustworthy.", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "He has an algorithm for estimating short interest based on market data. He is not basing it off of tweets or something.", "score": 5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You have to be critical...like who it ElectrikDonuts anyways? And do they taste good or do they shock you?", "score": 1, "replies": [{"body": "drive a tesla and you will learn what electric donuts are.  Otherwise, yes", "score": 1, "replies": [{"body": "lol - gotcha, got me a TM3 LR AWD, haven't tried donuts yet....bring on the snow!", "score": 2, "replies": [{"body": "Actually wouldn’t mind snow for the same reason, lol", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "what's the total amount of outstanding TSLA convertible bonds? Because that needs to be subtracted from the short interest.", "score": 2, "replies": [{"body": "I believe for the convertible, they are not counted", "score": 1, "replies": []}, {"body": "Not all convertible bond holders are short though.", "score": 1, "replies": []}]}, {"body": "Could you clarify the last paragraph in your post?", "score": 1, "replies": [{"body": ">  shorts try to recover but every buy back result into double speed pull back of the stock price. \n\nYeah I'm wondering what this means?", "score": 1, "replies": [{"body": "Well what I’m trying to say is simple mathematics. For every one million stocks shorted, the stock price decline by 7.5. However, for every 1 million stocks buy back, the stock rise about 15.  Basically TSLA stock at sub 200 level is very hard to short.", "score": 2, "replies": []}]}]}]}
{"title": "Tesla wins tariff exclusion on imported aluminum", "selftext": "https://www.cnbc.com/amp/2019/06/24/tesla-wins-tariff-exclusion-from-uesla-wins-tariff-exclusion-request-from-us-commerce-dept-to-waive-10percent-tariffs-on-imported-aluminum-from-japan-used-in-manufacture-of-battery-cells--govt-documen.html\n\nSorry for that amp link btw bois", "id": "c510bs", "created_utc": 1561430221.0, "score": 117, "upvote_ratio": 0.96, "num_comments": 11, "comments": [{"body": "Kinda clickbait as per usual.\n\nTL;DR: Tesla won a tariff exclusion from the U.S. on the imported Japanese aluminum it uses in its battery cells. The Commerce Department answered Tesla's request for the waiver per a document dated June 5 and in its response they said \"[the aluminum] is not produced in the United States in a sufficient and reasonably available amount or of a satisfactory quality,\" Reuters reported. [Reuters link here](https://www.reuters.com/article/us-tesla-aluminum-tariff/u-s-waives-tariffs-on-japanese-aluminum-for-tesla-battery-cells-idUSKCN1TP2JY) The waiver will last one year.", "score": 19, "replies": [{"body": "Yes, this news came out during market hours and the stock only slightly reacted. Figured it wasn’t a huge deal to TSLA.", "score": 6, "replies": [{"body": "GS cucked them by reiterating their sell rating at like $153. Classic GS manipulation. Puts then calls", "score": 4, "replies": []}, {"body": "To the upside, just kind of business as usual - if it was getting taxed you would’ve seen a small dump.\n\nFear is garnering a far stronger reaction in this market.", "score": 2, "replies": [{"body": "Yup totally agree", "score": 5, "replies": []}, {"body": "For sure. The waiver was the thing that held the line. 10% tariff active would have meant an -x% drop", "score": 1, "replies": []}]}]}]}, {"body": "I think this only saved them a few million for the year. Better than nothing but kind of a drop in the bucket for them", "score": 14, "replies": []}, {"body": "Chances are news are late so probably they're taking profits already.", "score": 9, "replies": []}, {"body": "Yay I sold a put!", "score": 16, "replies": []}, {"body": "Transparent Aluminum here we come", "score": 4, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Did you?\n\nBecause that doesn't look like a link to me, and it does mention amp. \n\nAlso, no, not fixing it from mobile.", "score": 2, "replies": []}]}]}
{"title": "UPS instead of FDX, makes sense?", "selftext": "UPS FD puts are way cheaper than FDX FD puts ... when FDX shits the bed tonight, shouldn't UPS follow ? Especially since UPS is not as down as Fedex. And valued way more expensively. What's wrong with my train of thoughts?\n\nI know this isn't really DD but it's more DD than most of the shit posted here, so I flair it DD.", "id": "c5amza", "created_utc": 1561478290.0, "score": 10, "upvote_ratio": 0.79, "num_comments": 14, "comments": [{"body": "But fdx will be up 10% AH. Why? Because everyone expects it to shit the bed.", "score": 8, "replies": [{"body": "Yeah honestly it might just be pRiCeD iN", "score": 1, "replies": [{"body": "10+ articles out about how FDX is going to tank on earnings, buy puts free $$$$$$$$$$444.", "score": 2, "replies": []}]}]}, {"body": "China is singling out Fedex. That’s why you see the disparity. While they are generally correlated, they are much less so now and likely will be for the immediate future.", "score": 4, "replies": []}, {"body": "Not sure this logic will work. FDX and UPS are service based and relies heavily on their infrastructure and agreements. You're probably thinking this because of the what happened with Chip stocks. I don't think they behave the same way.", "score": 5, "replies": []}, {"body": "If you can answer this, yes.:\n\nApart from your autism, what are the factors affecting the industry and not just FedEx?\n\n&#x200B;\n\nDisclaimer: You might be totally right. I just don't see the relation between potential of FedEx drilling and its industry. Wouldn't people use UPS more if FedEx keeps sending Huawei phones back to its sender?", "score": 2, "replies": [{"body": "FDX announced deep discounts to fill it’s planes, hurting the margins. UPS will have to follow. Maybe i should include UPS earnings and not go fd ...", "score": 1, "replies": [{"body": "Amazon logistics is expanding pretty quick doing pick ups for 3rd party sellers and every single e commerce seller on amazon ( a lot of fucking packages ) will not need Fedex or ups in the next couple years .  I am a large third party seller in NY and according to my Fedex rep amazon has stolen almost every single one of her e-commerce accounts that sell on amazon.", "score": 3, "replies": []}, {"body": "Well UPS following is in future tense, it won't affect this earning. \n\nAnd how's UPS's planes doing? are they lacking cargo's too?", "score": 2, "replies": [{"body": "People just go for the cheaper between the two i think, so if fedex discounts UPS is affected day one", "score": 2, "replies": [{"body": "True, but I still don't think that's going to affect this earning and not enough relation to tank together. \n\nI don't think the world will react to discount news as immediately you think. You only know because you're following the market. I would personally just stick to whichever one I kept going to unless the competitor all of the sudden goes \"50% off!\". Even then, I don't have anything to ship. \n\nBig businesses don't have the flexibility to just get up and turn their back on UPS. Individuals are most likely oblivious of this news until the word gets around. Small business will probably be the fastest to react. \n\n&#x200B;\n\nAgain.. you might be totally right. I don't even follow FDX/UPS. Only thing I know about them is what you just told me and the huawei stuff. I'm just share my thoughts, hopefully it helps you in some weird way.", "score": 2, "replies": [{"body": "Totally does man! Good convo", "score": 2, "replies": []}]}]}]}]}]}, {"body": "So what’s happening is it gonna open downwards tomorrow or rocket", "score": 2, "replies": []}]}
