{"title": "Highest credit naked puts", "selftext": "What’s your go to for selling puts achieving the maximum credit? Trying to avoid the high prices names and looking for stuff under $50.\n\nThe usual comes to mind:\n\nMU \nAMD\nFSLY\nWDC\n\nDoes anyone have any other lower priced stocks that offer higher credits for selling puts?", "id": "c5tyfa", "created_utc": 1561575313.0, "score": 21, "upvote_ratio": 0.93, "num_comments": 14, "comments": [{"body": "I've been using Barchart naked put screener with good results", "score": 11, "replies": [{"body": "Is that part of the free or premium service ?", "score": 4, "replies": [{"body": "I use the free screener\n\nhttps://www.barchart.com/options/naked-puts\n\nI use it for suggestions and sell puts on stocks from companies that I am familiar with and wouldn't mind owning if I get assigned and ones that have high liquidity.", "score": 12, "replies": [{"body": "Sweet ! Guess I overlooked that when u was poking around on there a short while ago.", "score": 1, "replies": []}, {"body": "Love the barchart screener. It's a very useful/helpful tool.", "score": 1, "replies": []}, {"body": "How do they screen stocks to put in the list?\n\nI just use the highest IV options and go from there. The sane ones are usually on page 2. \n\n\nhttps://www.barchart.com/options/highest-implied-volatility/stocks?page=1", "score": 1, "replies": []}, {"body": "Nice suggestion, how do you use the screener? Is it showing good candidates for selling naked puts on? Once you have identified one, do you then do further analysis? If so would be grateful too have an insight into your method. Thanks.", "score": 1, "replies": []}]}]}]}, {"body": "It changes over time.  This week I sold puts on WDC, APA, MPC, and SLB.", "score": 4, "replies": []}, {"body": "Although it's out of your described price range, TSLA gives some ridiculous premiums because of the IV. I was looking at puts that were like 20% OTM that were still giving nearly $1k in credit.\n\nAlternatively, you could do the IV / credit trade by doing vertical spreads. Although it gives you a reduction in potential credit, you can do trades on more expensive stocks like TSLA while still getting some credit. Check them out bruh. You can sell call or put spreads depending on the direction you think it would go, then sell at ~30-50% profit (typically what I go for, same with the guys at TastyTrades).\n\nhttps://www.investopedia.com/terms/v/verticalspread.asp", "score": 4, "replies": [{"body": "TSLA and BYND are great right now.", "score": 3, "replies": []}, {"body": "If Robinhood had naked puts i'd be riding Tsla to the bank non stop.", "score": 1, "replies": []}]}, {"body": "BYND is ridiculous. Spreads suck but the premium is yuge.", "score": 3, "replies": []}, {"body": "You can have a look here:\nhttps://financecube.de/en/optionsearch\nIts working with end of day data. So you may wanna have a look at the data tomorrow", "score": 1, "replies": []}, {"body": "LK and TLRY\n\nedit: sold a few YETI puts lately which did well too.", "score": 1, "replies": []}]}
{"title": "r/Stocks Daily Discussion Wednesday - Jun 26, 2019", "selftext": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing\n  * [Corporate News](https://www.streetinsider.com/Corporate+News)\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n  * [Economic data](https://www.streetinsider.com/Economic+Data)\n  * [FED](https://www.streetinsider.com/Fed) - Federal Reserve news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?sort=new&q=Rate+My+Portfolio+-+r%2FStocks+Quarterly+Thread&t=all&restrict_sr=on).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+technicals%22&restrict_sr=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+options%22&restrict_sr=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+fundamentals%22&restrict_sr=on&sort=new&t=all) Friday.", "id": "c5n4t6", "created_utc": 1561536518.0, "score": 4, "upvote_ratio": 1.0, "num_comments": 16, "comments": [{"body": "So I have 2k dollars and thought about buying shares. I would be willing to accept some risky pics. Should I try it or wait some time? If I should try, can you recommend some companies? Maybe some emerging ones with high potential? Thank you!", "score": 1, "replies": [{"body": "Don't do it today big events this weekend and the market is in an 'overbought\" condition. \n\nWe're due for a 10%or more pullback this summer\n So of 10% matters to you be patient\nPatience is money.\n\nHint: Never invest on the trite 3 - 5 word phrases you jear in hetr.\n Especially if they rhyme\n\nCheck out r/thewallstreet or wallstreetbets for better info", "score": 3, "replies": [{"body": "Didnt get that Hint part, can you explain please? Thank you!", "score": 2, "replies": []}]}]}, {"body": "Awesome,  finally dump my Nvidia without a loss", "score": 1, "replies": [{"body": "What are your main reasons for selling out? I haven't fully researched the company, just interested to see the main problems with it from a seller's point of view because from a glance I was slightly interested in it's growth potential", "score": 1, "replies": []}]}, {"body": "Why are small caps so weak this year?  Can anyone explain?  IWM just stuck around 150 while SPY and QQQ hit ATH.", "score": 1, "replies": []}, {"body": "Can someone explain to me what happened with HEXO?\n\nI bought in early in its life and cheerfully watched it rise consistently to $8.20/share. I decided, mistakenly, to hold on convinced the gains would only increase with the life of the company and continous pro-weed legalization.\n\nInstead now it has been dropping consistently to the point of loss despite profits. I honestly cannot understand what's going on behind the scenes to cause this devalue. I know I'm ignorant and apparently messed up on this stock, but I'm curious to learn from it from more experienced traders.", "score": 1, "replies": [{"body": "i would ask weedstock subtreddit this question.", "score": 2, "replies": []}, {"body": "Basically all the Canadian weed stocks have been getting crushed lately. CGC's underwhelming earnings are likely to continue to weigh heavily on Canadian LP's for the short term.\n\nI still believe Hexo is a good long term play.", "score": 2, "replies": []}]}, {"body": "What would be a good buy in price for Microsoft?", "score": 1, "replies": [{"body": "Honestly because the company is managed so well and the industry still has plenty of growth I'd be happy starting to slowly build a position at this price and may do so, if you're looking for a long term safe-ish tech stock I wouldn't hold my breath waiting for the price to drop significantly", "score": 2, "replies": []}]}, {"body": "Tried to post a thread, but got deleted. Copying here\n\nFrom Canada, over 18\n\n\nI want to start investing in stocks and ETF's. I'd like something with a really low or non-existent minimum and fee. Also looking for something that makes it easy to transfer/withdraw money. I just want to put in a couple hundred right now to test everything out.\n\nI've read that there's also wealthsimple and questtrade . Questtrade seems to have a low/non-existent fee if I buy stocks/ETF's and a $5-$10 range for selling.\n\nI was reading the wiki, and I'm looking into a \"robinhood\" account. It seems like I can trade ETF's and stocks with them. Although it says \"theyre sometimes slow\", which I'm not sure what that means.\n\nWealthsimple I can't get a clear answer if I can trade both ETFs/stocks.\n\nAny suggestions greatly appreciated", "score": 1, "replies": [{"body": "I use Wealthsimple Trade for stocks and I really like it.", "score": 1, "replies": [{"body": "So for wealthsimple, there's no fees for trade? Unless Im a Canadian and buy an American stock and then get charged the exchange fee + 1.5%? It the total fee shown before the trade goes?", "score": 1, "replies": [{"body": "Exact. I haven't jump on the Micron bandwagon because of that fee. It can be a pain for short term gain, so Im mainly looking into TSX", "score": 1, "replies": []}]}]}]}, {"body": "How do I determine price rally on my own? I was trading ETC today, got out when it was 9.40 before the big crash, but I could've waited a bit to sell when it was around 9.70. I only sold because a website I googled told me there was going to be a price rally at around 9.56 lol.", "score": 1, "replies": []}]}
{"title": "Visa vs Walmart stock?", "selftext": "[deleted]", "id": "c5v0me", "created_utc": 1561579519.0, "score": 2, "upvote_ratio": 1.0, "num_comments": 12, "comments": [{"body": "Visa", "score": 6, "replies": [{"body": "I second Visa. I'd rather put my money on Visa than Walmart. Visa is well Visa and Walmart just sells discounted everything.", "score": 3, "replies": [{"body": "Walmart also is Amazons biggest competition.  Free 2 day and next shipping without a subscription service.  Grocery delivery.  They have a lot invested in blockchain and AI.   They have one major competitor\n\nVisa has competition with MC, Amex, PayPal, Square, crypto and now Facebook Libra.", "score": 1, "replies": [{"body": "Nope. Square still uses V,MA. Paypal still uses V,MA. Facebook libra is nowhere and people don’t pay with crypto in their local coffee store. Even if they did, it will be contactless in the macro. Guess who owns contactless cards and is hugely invested in crypto. Long V,MA.", "score": 5, "replies": [{"body": "so the correct answer is $5k in Visa and $5k in Walmart", "score": 5, "replies": [{"body": "5K in Visa, 5K in MA.", "score": 2, "replies": [{"body": "Outstanding move.", "score": 1, "replies": []}]}]}]}, {"body": "If Walmart gets AI cashier checkouts then it will blow up in the market. But unless it does that I dont see how it can grow much", "score": 1, "replies": [{"body": "Walmart/Sams are already rolling it out\n\nhttps://www.forbes.com/sites/quickerbettertech/2018/11/04/first-amazon-now-walmart-goes-cashier-less-and-other-small-business-tech-news-this-week/#5f1922bd4424", "score": 1, "replies": []}]}]}]}]}, {"body": "Definitely visa.", "score": 1, "replies": []}]}
{"title": "Strong Q2 Deliveries Could Drive Tesla Stock Higher, Analyst Says", "selftext": "", "id": "c5koah", "created_utc": 1561520939.0, "score": 35, "upvote_ratio": 0.9, "num_comments": 13, "comments": [{"body": "Colin Rusch is a very bullish analyst (just based on target price), but his notes have been the most accurate IMO. Recall on [May 20th](https://www.cnbc.com/video/2019/05/20/teslas-guidance-achievable-says-oppenheimers-rusch.html) he maintained that Tesla's guidance was achievable, at a time when TSLA was sinking below $200, confidence down, and consensus expectations to miss guidance.", "score": 17, "replies": []}, {"body": "I could say that too", "score": 12, "replies": []}, {"body": "And the opposite could drive it lower", "score": 8, "replies": [{"body": "Weak deliveries are out of the question and strong deliveries drive price higher. The effect from just meeting expectations is unknown.", "score": 8, "replies": [{"body": "Yes, they don't have to beat their personal record to still have strong deliveries. Strong deliveries are already in the bag, which I consider 80k+. That's 100%+ growth YoY!", "score": 5, "replies": [{"body": "Remember that the company sand-bagged Q2 on purpose last year to avoid triggering the reduction in federal subsidies.  They produced 12,571 more vehicles than they delivered that quarter.  If they had actually delivered all of the cars they produced in Q2 last year, and they match their delivery record of 90,966 in Q2 this quarter, YoY would be 70.5%.  Still very impressive, but not 100%.  \n\nAlso, the Model 3 ramp was still in process in Q2 last year - they only produced 2,200 per week during that quarter.  In Q3 last year they got the rate up to 4,100 per week, which will make the YoY comparisons much tougher going forward.", "score": 1, "replies": []}]}]}]}, {"body": "And in other news, water is wet!", "score": 2, "replies": []}, {"body": "[removed]", "score": -21, "replies": [{"body": "This kind of sarcasm is what I don’t like seeing in this sub. It contributes absolutely nothing of value to the conversation.", "score": 17, "replies": [{"body": "The contribution is just a reminder that many here are falling into a cognitive trap, where the quality of an analyst’s opinions are directly proportional to his price target on the stock.\n\nI know it ain’t going to be a popular thing to say.", "score": 4, "replies": [{"body": "My issue isn’t that your opinion is unpopular, it’s with with the way you said it. There were better ways to get your point across in a more civilized way.", "score": 4, "replies": []}]}]}, {"body": "Hey I understand that you're trying to say this sub behaves like a hive mind, enforcing each other's opinions, the stronger the better, and ignoring everything else, but please try to understand that not every sub is like realtesla.", "score": 21, "replies": []}, {"body": "For the record, I'm a bull who thinks many analysts are acting fraudulently and their statements have been vapid lately. My response to the headline in this post was \"what a stupid statement\".", "score": 1, "replies": []}]}]}
{"title": "$PM is a buy", "selftext": "* tons of people are addicted to nicotine, and the rate isn't decreasing especially after juuls hit the market. \n* they're investing lots of money into a product that competes directly with vapes like juul and they have the resources to market it effectively. I even just saw a tv add by PM last week. that's a first for me! when's the last time you saw a nicotine product commercial on tv by a big tobacco company? they must have lobbied like crazy and won big. \n* mission winnow (PM) is the future and 2020 is ferrari's year.\n* the increase in nicotine addiction by way of vapers inevitably will lead to a bigger cigarette market. while they are modernizing their products, new customers for their flagship products will continue to increase.\n* the P/E is fairly low, and the div aint bad either.", "id": "c5l3yz", "created_utc": 1561523211.0, "score": 2, "upvote_ratio": 0.58, "num_comments": 14, "comments": [{"body": "Was solid DD till you mentioned 2020 being Ferrari's year.. DD is now trash.", "score": 5, "replies": [{"body": "I was 100% on board until that statement. Fuck the French GP and their shitty lines.", "score": 2, "replies": []}]}, {"body": "I've been keeping my eye on it too, honestly waiting for them to take a bigger cut out of the emerging marijauana industry. They have all the the setups to easily box and manufacture joints. Weed is probably going to save their business one day when the western world quits tobacco and only poor people remain smoking. If they are too conservative I won't invest. Tobacco is a dying business. If they are unable to change with the times, then I will invest in a company that will. Even if there is a strong base of consumers.", "score": 4, "replies": [{"body": "I kind of brought up Mission Winnow in jest, but I do actually think it's an important part of their re-branding effort. It's basically saying they're moving away from combustion products. Do you think that's a big enough example of them changing with the times, or will you def wait it out until you see them dive into the cannabis industry?", "score": 3, "replies": [{"body": "Nicotine is still nicotine. Will be taxed to hell in so many countries that it will just be fazed out.", "score": 2, "replies": [{"body": "Gov will take their cut regardless if the product is cannabis or nicotine, so I’m not convinced by that argument.\n\nEdit - especially where I am the sin tax is very high on tobacco, but lots of people still buy it. I think you’re right that it’s probably mostly a poorer demographic, but my point is taxes don’t really curb addiction", "score": 2, "replies": [{"body": "nicotine kills people, marijuana has at least not sufficiently been proven to. Nicotine is not trendy or new, marijuana is trendy and new. Nicotine currently gets the sin tax, and I agree marijuana is taxed as well,  but I differ in my opinon democrats are far more favorable to marijuana than nicotine. Nicotine has a lot of bad sentiment built up towards it.", "score": 2, "replies": []}]}]}, {"body": ">the increase in nicotine addiction by way of vapers inevitably will lead to a bigger cigarette market. while they are modernizing their products, new customers for their flagship products will continue to increase.\n\nI would argue that fleeing combustion is not their saving grace, although it is their main plan.  They will need to evolve beyond that in some way.  I dont see tobacco making the long play.\n\n&#x200B;\n\nThey seem to be stuck on this:  [https://www.pmi.com/smoke-free-products/iqos-our-tobacco-heating-system](https://www.pmi.com/smoke-free-products/iqos-our-tobacco-heating-system)\n\n&#x200B;\n\nI'm not sure I can get on board unless they make a larger play in MJ.  What the fuck do I know though?\n\n&#x200B;\n\nEdit:  Also fuck this company and big tobacco.", "score": 2, "replies": [{"body": "What the fuck is that thing. It looks like it's gonna be a big chunk of plastic and metal weighing down the end of my 2 inch cigarette. It's all bad.", "score": 1, "replies": []}]}]}, {"body": "It’s only poor people who I see smoking these days anyways. And the edgy young adults who still think they’re kids and their band is gonna hit it big one day", "score": 2, "replies": []}]}, {"body": "2020 is Ferrari's year? \n\nHAHAHAHAH bad DD, how can I short this op specifically?", "score": 5, "replies": [{"body": "You beat me to it. I was in until I read that. I don’t know a lot but I know 2020 is not Ferrari’s year.", "score": 4, "replies": [{"body": "If a recession hits it’s going to be walking and public transport year lmao", "score": 1, "replies": []}]}]}, {"body": "This post was flaired as DD so it's on the DD list. [Click Here to read fresh WSB DD.](https://new.reddit.com/r/wallstreetbets/search?sort=new&amp;restrict_sr=on&amp;q=flair%3ADD).\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}
{"title": "AMD and G20", "selftext": "Soo Tarifman will probably do his thing and this time could be worse since it might be the last chance for a deal, due to China sitting out till the next US election.\nHowever, Ryzen and stuff is coming up.\n\nDo we play this time?\nShould we play?\nI'm absolutely lost.", "id": "c5nc4j", "created_utc": 1561538256.0, "score": 6, "upvote_ratio": 0.88, "num_comments": 19, "comments": [{"body": "All in bois, 40 on 8/7", "score": 12, "replies": [{"body": "Literally can’t go tits up", "score": 7, "replies": []}, {"body": "I'm tempted to ride this autistic train just for the ride.", "score": 2, "replies": []}]}, {"body": "Imo the stable geniuse in chief is about to go bersek over JPow and Mueller and in his desperation starting to bully China before the negotiatios to show strength. During the G20 he will ramble about great progress but I can hardly imagine any trader actually believing him", "score": 7, "replies": [{"body": "Well I kinda expect this to be valued into market already, he let us down so many times on this topic.", "score": 1, "replies": []}]}, {"body": "Looks like Mnuchin has slaughtered my SPX puts that were up about $9000 yesterday. 90% complete doesn’t mean anything when China says it’s 100% or 0%. Oh well. Tendies aren’t real unless you take them. \n\nI still think China’s best move is to wait out Trump, knowing that the next president will be a big pussy in this negotiation. They will make their best move.", "score": 4, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Bernie is a cuck as demonstrated by support for Hillary\n\nBiden is a pedo literal Obama holdover\n\nWarren is a fake Indian plagiarist\n\nBeto \"Robert Francis ORorke\" is a drunk burglar who married a billionaire heiress \n\n...and the dems will bury the best candidate, Tulsi Gabbard. \n\nIf I were a betting man, which I am, I'd go long Trump 2020", "score": 0, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "5x SPX 2950 puts, July 10th expiration.", "score": 1, "replies": []}]}]}, {"body": "I've seen people claim G20/china talks wouldn't matter since Ryzen is releasing. They're very wrong.", "score": 4, "replies": []}, {"body": "https://imgur.com/a/zAYfoix", "score": 3, "replies": [{"body": "^(Hi, I'm a bot for linking direct images of albums with only 1 image)\n\n**https://i.imgur.com/tyEeRRO.jpg**\n\n^^[Source](https://github.com/AUTplayed/imguralbumbot) ^^| ^^[Why?](https://github.com/AUTplayed/imguralbumbot/blob/master/README.md) ^^| ^^[Creator](https://np.reddit.com/user/AUTplayed/) ^^| ^^[ignoreme](https://np.reddit.com/message/compose/?to=imguralbumbot&subject=ignoreme&message=ignoreme)^^| ^^[deletthis](https://np.reddit.com/message/compose/?to=imguralbumbot&subject=delet%20this&message=delet%20this%20es2ued6)", "score": 1, "replies": []}]}, {"body": "90% complete", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Yeah this was reported as “is”, instead of “were”. \n\nAt least now we know the value of “is 90%” versus just “there’s a path” appears to be 60 points in Dow futures. This is no news at all.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Well it looks like it worked, even if it’s nothing.", "score": 1, "replies": []}]}]}]}, {"body": "They said that last time", "score": 1, "replies": []}]}, {"body": "Ryzen might do well, but Navi is going to be meh.. So i have confused feeling about this.", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "I don't disagree with the statement but its not a home run at all like the CPUs. At 7nm, they are barely competing with NVIDIA, that is a not a good sign.", "score": 1, "replies": []}]}]}]}
{"title": "CRM Part 2", "selftext": "This time it's personal/Electric bugaloo.  There was a lot of interest on CRM calls a few days ago.  What are your updates?  Still holding?  You bail? what are your strikes/expiration.  I'm at 7/12 155C.", "id": "c5wui5", "created_utc": 1561587050.0, "score": 3, "upvote_ratio": 0.8, "num_comments": 18, "comments": [{"body": "Lost like $400, call expiring Friday should've cut my losses but not a loss until I sell right?\n\nEdit: Call expires Friday not tomorrow lol", "score": 5, "replies": []}, {"body": "I got lucky and sold my short put spared and shares before the drop.", "score": 3, "replies": []}, {"body": "Holding. Should’ve sold, I have the exact same call as you", "score": 2, "replies": [{"body": "When'd you buy? Mine was Monday and yesterday was fucking rough.  At least we got a while before the expiration.", "score": 1, "replies": [{"body": "Last week or something I only bought 2 calls nothing major", "score": 2, "replies": [{"body": "Yeah, that's not too bad.  I may double down.", "score": 2, "replies": []}]}]}]}, {"body": "7/26 160. Holding still and just hoping to recoup some of my losses at this point.", "score": 2, "replies": []}, {"body": "Looking to enter. Feel like the momentum is just dead right now.\n\nIf the markets didn't have that opening pump, this would have been an ugly day for CRM. It didn't pop at all and rally at open. Seems like investors are staying away for now. \n\n$150 didn't hold so I didn't enter. Still want to but I don't think I'm entering anything less than August expiration. July is too close.", "score": 2, "replies": []}, {"body": "9/20 $155, down 20%. Not gonna lie, frustrated as fuck but I'm holding.", "score": 2, "replies": [{"body": "Sell it when CRM hits $135s this summer.", "score": 1, "replies": [{"body": "Press F to doubt", "score": 2, "replies": [{"body": "You're only saying that because you're holding a losing position. Winning in this game is knowing when to hold and when to fold.CRM is going to get wrecked. It lost support (which was tested many times, $150ish) next support is like $133-134.", "score": 1, "replies": []}]}]}]}, {"body": "What about that nice comeback at the end of today’s session?! Back to its 200 moving average. Anyone else feeling encouraged?", "score": 2, "replies": [{"body": "Hell yeah, this is definitely moving in the right direction", "score": 1, "replies": []}]}, {"body": "I sold everything 1st five minutes monday, glad I did. However, this drop has nothing to do with CRM. People are just trimming back growth stocks. All clouds, SHOP, ETSY, everything growth related is being scaled back ahead of G20. In comparison to other growths, percentage-wise CRM didn't drop that much. These stocks will be the ones to be in after trump xi meeting (along with semis). They'll probably get their losses back in a day though, so you'll need to have calls or shares on friday if you think outcome will be positive for trump xi meetings.", "score": 3, "replies": [{"body": "I lost pretty much all my money on this guy. I can’t believe I was up at the beginning of the week. I held like a bitch. Now $3K down. Granted, some of that is 7/12 calls, but a good chunk was also $155c for 6/28.\n\nThe bump today gave me a sliver of hope, but it’s not looking good.", "score": 1, "replies": []}]}]}
