{"title": "Selling puts every day or earnings season - Week 1 update.", "selftext": "\n\nSee link for reference post: https://www.reddit.com/r/wallstreetbets/comments/8vbinw/july_earnings_strategy/\n\nBasically go all in selling FD puts on companies announcing earnings the next day to collect sweet IV gains. I’m retarded and didn’t factor in after hours/before open when making the original list so the actual plays on each day will differ, but you get the idea. What I ended up playing last week:\n\n10 Jul – PEP https://imgur.com/a/rGuJZO1\n\n11 Jul – FAST https://imgur.com/a/0okc992\n\n12 Jul – DAL Bought 20 back before remembering to get screenshot. https://imgur.com/a/ne0QYEt\n\n13 Jul – C, WFC, JPM https://imgur.com/a/WotxCwU https://imgur.com/a/CR5pbJH https://imgur.com/a/nzhzZ7K\n\nFirst week in total: https://imgur.com/a/Z3dgV3I\n\nPretty good start to the season, FAST really helped out, and my worst play (financials) ended up pretty much breaking even. Plans for next week:\n\n16 Jul – BAC\n\n17 Jul – NFLX\n\n18 Jul – MS\n\n19 Jul – AXP\n\n20 Jul – MSFT\n\nI might start playing a little more conservative and start selling ATM/OTM depending on the stock because I’m a pussy and have some gains to protect, but we’ll see what happens.\n\n\nI'm retarded so forgive formatting.", "id": "8ym07m", "created_utc": 1531503313.0, "score": 61, "upvote_ratio": 0.92, "num_comments": 63, "comments": [{"body": "Many WSBers' money ended up in your pocket. It is our blood ...", "score": 51, "replies": [{"body": "Do none of y'all sell premium to pay for FDs?  ", "score": 2, "replies": []}]}, {"body": "I got harassed here suggesting risk averse people with accounts ~$200k and above could sell covered puts, but I like it.  I was told it was a great way to lose everything when I suggested selling puts on MSFT.  Yes, really, MSFT would not only drop $5 in a week but then after I got assigned MSFT would fall to $0 before I could sell.\n\nI did it with AMD and a few others for months and never lost a dollar.  I just don't have the capital to make \"decent\" money anytime soon.  \n\nNice shit man.  If you get burned on earnings and get assigned, you could sell covered calls, or go sell puts on stable stock not during ER season just OTM and still make 0.5-1% return on your investment per week.", "score": 29, "replies": [{"body": "There's certainly risk, solid companies have taken dives before, but I'm not too worried about it with these companies. Even a 10% dive, which would be massive, would end up being about 8% after my premium, and I've already made that in four plays. I don't plan to do this forever, just gonna make a run this season and see what happens.", "score": 6, "replies": [{"body": "Not to mention you can just hold the shares until it recovers. I only sell puts for companies I'd be willing to own. ", "score": 13, "replies": []}, {"body": "Right, and then once you own the shares, you just keep selling OTM calls until assignment, then rinse and repeat. ", "score": 6, "replies": [{"body": "but the gains are made so *slowly*", "score": 4, "replies": [{"body": "LOL, exactly why these autists have no interest in strategies like this. ", "score": 3, "replies": []}]}]}]}, {"body": "If you were selling puts and MSFT dropped $5 wouldn’t that screw you? You would have had to buy the outs back at a higher cost", "score": 3, "replies": [{"body": "[deleted]", "score": 32, "replies": [{"body": "what's a microsoft?", "score": 4, "replies": []}, {"body": "Wasn’t judging was just trying to understand why  he was saying MSFT dropping was a positive. Still don’t get what he meant. ", "score": 1, "replies": [{"body": "If the realized drop doesnt match with the implied drop from the options before earnings day. Then the options they've sold have the potential to be cheaper then when they sold it", "score": 4, "replies": []}]}]}, {"body": "Not if youre selling well OTM.\n\nAlso nothing we do is risk free, but it’s less risky than many of the plays here.  That’s my point.  Also you still have shares, so it’s not just a loss of money and nothing else.", "score": 5, "replies": []}]}, {"body": "Bruh that's only if you are ok with a trade becoming an investment lol.\n\nNothing wrong with that, but if you go in thinking I'm going to make 10% a week, then you get assigned and suddenly your portfolio is down 10%, what do. You can't try again with a different company, but you risk losing more. Or you can hold and pray for the best, but like I said, that's when your trade becomes an investment.", "score": 2, "replies": [{"body": "Not sure where I said it was risk free nor did I say anything contrary to what you’ve posted but I agree with you.", "score": 1, "replies": [{"body": ">  If you get burned on earnings and get assigned, you could sell covered calls, or go sell puts on stable stock not during ER season just OTM and still make 0.5-1% return on your investment per week.\n\nThis part is problematic. Once you get assigned, presumably with your entire equity since you are looking to make decent ROI, you have basically no more collateral for your stable stock puts if you get assigned AGAIN. You would be taking on leverage. \n\nIf the stock falls significantly, OTM calls above your basis is basically worthless so you can't recoup your investment. Also if you do sell a call against your assigned long stock position, you are forced to hold your stock position during the time frame, to prevent a spike up and lost money AGAIN, meanwhile the stock can continue to tank. You can close the whole thing loss at any time of course. \n", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Any stable stock will have low premiums, and you will keep winning until one day it fucks you like XIV.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Good job, it you are going to do this more often it would be helpful to get a margin account. You would only see a buying power reduction of 20% of share price and the option premium for selling atm puts instead of 100% of the share price you are doing.\n\nThere is no difference in risk if you don't use the additional buying power, but you will collect interest on the unused cash and you will have more settled funds in your account making withdrawing it easier.", "score": 6, "replies": []}, {"body": "i was gunna say if those puts went ITM you gunna need alot of cash to buy shares. then i saw your last screenshot.", "score": 5, "replies": [{"body": "Lol", "score": 2, "replies": []}, {"body": "Could also buy cheap puts a couple strikes below the ones you sell to limit your downside and therefore unlock more leverage for the play. ", "score": 1, "replies": []}]}, {"body": "Thots on NFLX? Puts for 7/16 post-market?", "score": 4, "replies": []}, {"body": "how big of an account do you need to sell puts profitably? ", "score": 5, "replies": []}, {"body": "Without calling me a fag, can you explain to me how this works.  Please don't call me a fag.", "score": 13, "replies": [{"body": "It's like buying puts, but you sell them instead.", "score": 35, "replies": []}, {"body": "Queer", "score": 7, "replies": []}, {"body": "First, you sell cash covered puts.\n\nAnd then you collect the premium.\n\nGenerally, as long as the stock doesn't tank after earnings, you make money. ", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Then you are forced to buy the shares, but owning the shares of a well respected company at a discount due to the premium already collected isn’t the worst thing in the world. ", "score": 5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You sell the put before it expires. If you do that, you usually won’t be assigned. If you are assigned, you call your broker and work it out with them. I’ve never heard of an instance where they won’t work with you to sell the put even though it was exercised. ", "score": 1, "replies": []}]}]}, {"body": "Then you become a WSB mod. It's win-win", "score": 4, "replies": []}]}]}, {"body": "[deleted]", "score": -2, "replies": [{"body": "They're not naked, they're cash secured from the looks of it.", "score": 9, "replies": []}]}]}, {"body": "Meh, I bought fngu last week and went back to bed. Same thing.", "score": 3, "replies": []}, {"body": "That's crazy you made money on FAST", "score": 3, "replies": [{"body": "selling put = bullish. so yes, of course he made tons on FAST", "score": 3, "replies": []}]}, {"body": "So basically if a company has earnings on Friday, I'd sell a put on Thursday when the iv is the highest and then but back to close on Friday when the iv crush happens? Would a loser strike price still result in a profit with the iv crush?", "score": 2, "replies": [{"body": "Depends how far it goes, ideally you sell on tickers where iv is overblown versus previous earning and no obvious tail sign event", "score": 2, "replies": []}]}, {"body": "Question:  why aren’t you going delta neutral and selling strangles? More capital intensive, sure, but much higher win probability, no?", "score": 2, "replies": [{"body": "Too much risk with that to throw my whole stack around, plus I like being on the bullish side.", "score": 5, "replies": [{"body": "You could always try putting on jade lizards to limit risk to the upside. Maybe worth thinking about for next season. Looking forward to seeing how things shake out for you this season. Good luck!!", "score": 1, "replies": []}]}, {"body": "Isn’t the margin requirement 20% anyway? ", "score": 1, "replies": [{"body": "Buying power for naked options is a weird complicated formula based on underlying price / distance OTM / moon phase. I literally have no idea what the req is each time until I go to fill an order. ", "score": 2, "replies": [{"body": "It changes as price move too, but to start its usually 20% ", "score": 1, "replies": []}]}, {"body": "20% of what...? Share price?", "score": 1, "replies": [{"body": "https://tastyworks.desk.com/customer/en/portal/topics/1016092-bp-effect-margin-requirements/articles", "score": 1, "replies": [{"body": "Exactly. It's not 20%. It's the whichever  of the following is the largest x 100 per contract:\n\n> * 20% of the underlying price minus the out of money amount plus the option premium\n* 10% of the strike price plus the option premium\n* $2.50\n\n\n\n", "score": 1, "replies": [{"body": "my point is selling a call won’t add much more bp requirements unless you’re much more farther otm than the put you’re selling", "score": 1, "replies": [{"body": "Yep, you're absolutely right (just tried a few different examples to convince myself). BP effect is pretty much the same on a single short put or on a short strangle. So again -- I can't really understand the desire to only write a directional short before earnings. To each his own. ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Are you selling the puts ATM? OR how far OTM?", "score": 2, "replies": [{"body": "All so far have been slightly ITM or ATM, might go OTM if I'm not as confident.", "score": 1, "replies": []}]}, {"body": "Whats your plan for NFLX now that it's down a fuck ton?", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "This is not the same strategy as you lmao, it's the opposite. He's writing FD's, not buying.", "score": 1, "replies": []}]}, {"body": "The cash required to sell puts is insane on robinhood, you end up with only like 1-2% returns on the collateral, right? ", "score": 1, "replies": [{"body": "Depends on how aggressive you want to be with your strike prices. You could hit 5-10&#37; if IV is high and you sell ITM/ATM contracts. But then you'd pretty much have to guess the direction correctly to make a significant amount of money. Also if you get 1-2&#37; returns per transaction then you can easily push 20&#37; a year with a sufficient number of trades. ", "score": 5, "replies": []}]}, {"body": "Yeah I’ve mostly been selling puts, vertical spreads , and IC recently. Generating consistent profit ", "score": 1, "replies": []}, {"body": "That $14.6k gain for the week isn't entirely due to this option writing strategy is it? Unless I'm retarded and can't do math, the total premiums collected for selling the puts in the screenshots is around $5k.", "score": 1, "replies": []}, {"body": "So, at what strike did you sell your NFLX puts...? 😬", "score": 1, "replies": [{"body": "It was ATM so 397-402 im assuming. I'm wondering if he's still gonna be ahead with the IV crush.", "score": 2, "replies": [{"body": "Not a chance. The sudden drop ATH is barely going to dent IV for another day...maybe two. I went delta neutral for NFLX, so if it comes back a little over the next 48 hours, I should get out alive.", "score": 1, "replies": [{"body": "Yep I am in the same boat. Looks like it has come back up a bit in premarket", "score": 1, "replies": []}]}]}, {"body": "Between 400-410. Next day opened down almost 20k, but closed down less than 3k due to the monster rally.", "score": 2, "replies": [{"body": "Man--do you realize how lucky we all were with that one?  I went delta neutral, but was at 360/440. Was able to get out with a tiny (~15%) profit, but I was sweating hard. \n\nOn the other hand, I got completely fucked by CSX today. Couldve walked with a wash at open, but got greedy (and maybe got lulled into it by NFLX the day before), and ended up with \"only\" a 150% loss. ", "score": 1, "replies": []}]}]}, {"body": "$BAC tho?  This one really doesn't add up for me.", "score": 1, "replies": [{"body": "Chart look weak, I wouldn’t sell put for the given premium imo", "score": 1, "replies": []}]}]}
