{"title": "Are there any Canadians here? Wondering about your housing market situation.", "selftext": "[deleted]", "id": "8x1jw8", "created_utc": 1531057883.0, "score": 32, "upvote_ratio": 0.89, "num_comments": 64, "comments": [{"body": "ban all foreign buyers", "score": 57, "replies": [{"body": "Wish we did that in the US decades ago. ", "score": 21, "replies": [{"body": "Even just in the major est and west coast cities. Also, a vacancy tax on these empty Chinese and Russian owned apartments. ", "score": 23, "replies": [{"body": "It's a game of whack a mole. Montreal is starting to heat up because of new regulations in Toronto and Vancouver. \nThe federal government needs to step in to protect the quality of life of residents.", "score": 9, "replies": [{"body": "A lot more Chinese buyers in Ottawa now too. ", "score": 2, "replies": []}, {"body": "Fuck the residents. I want my gains.", "score": 1, "replies": []}, {"body": "My old working class family home in Montreal was already worth 1M$ a decade ago. Chinese buyers have nothing to do with it.", "score": 2, "replies": [{"body": "https://business.financialpost.com/real-estate/mortgages/chinese-inquired-about-us1-45b-worth-of-canadian-properties-last-year-juwai\n\nStats, not anecdotes\n\nWait, this is WSB. Anecdote away.", "score": 8, "replies": [{"body": "Last time I was in Canada I saw a moose", "score": 3, "replies": []}]}]}]}, {"body": "I will vote for you. ", "score": 2, "replies": []}]}]}, {"body": "Then how we gonna scam Chinese like we did in 2008?  AIG", "score": 1, "replies": []}, {"body": "NZ doing this. Not changing shit\n\nThough tbf it’s easy asf to get residency to buy one. One of the ways is an investment visa. Though it’s a limited quota.", "score": 1, "replies": []}, {"body": "Stupid. Will be a shock when this accomplishes exactly nothing.", "score": 1, "replies": []}]}, {"body": "Real estate prices in Toronto and Vancouver have gotten to ridiculous levels, and the banks seem to be pretty happy giving out the loans to do it. People making ~$80,000 per year taking out mortgages on $900,000 houses is common. \n\nEven in a mid size city of about 300,000 people where I live houses are selling for 20% over ask in less than a week.\n\nSure seems like a bubble to me", "score": 39, "replies": [{"body": "This isn’t accurate.\n\nFirst, real estate laws are provincial so each of those cities is different, being in BC and ON respectively. \n\nIn BC, for example, a socialist government has been elected and cooling the housing market has been part of their platform. There is now a foreign buyer’s tax for the Vancouver region and an empty homes tax municipally, along with a second home tax provincially. Collectively these have slowed things to a relative halt, with minor price decreases in the last six months.\n\nThe comment about banks giving money away to just anyone isn’t accurate either. 10% down is the minimum for institutional lenders and most want 20% without mortgage insurance. The province also introduced new legislation to require additional stress testing on payments to ensure people can pay their mortgages in the event of a 5 year benchmark rate increase or a 2% rate increase, whichever is higher. This has also cooled things while also reducing the risk of widespread default.\n\nAll of this has been put in place to plateau prices, prevent a bubble, and discourage foreign and domestic speculators.\n\nI can’t speak for ON since I don’t live there but I gather they have some very similar policies and laws.", "score": 14, "replies": [{"body": "This is accurate but here in Toronto even after the stress test I'm seeing houses go over 10-20% above asking still.", "score": 5, "replies": [{"body": "Just because a house sells over asking doesn't mean it's a bubble.... This is an intentional tactic used by real estate agents to induce bidding wars and pump their own stats. If your house is worth 1 million and I offer it for sale at 800k and won't accept offers until next week you can see how that might create a frenzy ", "score": 8, "replies": [{"body": "Fair point. I wasn't replying to the bubble question per say. Just the fact that  things haven't slowed down. Even significant increases year over year don't automatically signal a bubble imo.", "score": 1, "replies": []}, {"body": "Have you seen how high Canada’s household debt to GDP is?\n\nIt’s a bubble.\n\nHave you listened to how petrified the BOC is about raising interest rates because of this issue? Right now our currency is getting destroyed because we literally are unable to raise rates.", "score": 1, "replies": [{"body": "People have been saying the housing market has been in a bubble for years now, I'm not disagreeing with you because the GDP to debt and BOC statements are both true. I think what the government and the BOC are trying to do is to get the housing market under control before there is a downturn in the economy... It's race against time IMO because they've realized that people have been over leveraging themselves and treating their equity like a personal ATM machine. When you suddenly can't just refinance your home every year to cover your bad debts that's when we have a problem, and I think you are starting to see the first signs of that right now. Depending on when the next recession happens, I believe that will be the time that the \"bubble\" pops. And the thing this time around as opposed to the 2008 recession is that they will have little to no options on how to soften the blow, rates have been so low and the Canadian economy which used to be so based on Oil has become more focused on real estate as a portion of GDP. \n\nPeople can't refinance their mortgage anymore, they can't afford there mortgage payments when the rates go up, they're forced to sell there homes, lots of other people are in a similar situation, supply exceeds demand, prices come down, people don't have the extra money that they did when prices were going up 20-30% a year, people spend less money, less money being spent is less income for other people, and the cycle goes on until we \"bottom out\". \n\nIt would be great for first time home buyers but the government absolutely doesn't want this scenario to play out... To many people who have homes would essentially lose everything", "score": 1, "replies": [{"body": "I agree people have been saying the Canadian housing market has been in a bubble for a while now.\n\nThe difference is the Fed is putting pressure on the world by raising interest rates and speaking hawkishly. That’s the main difference than what’s been happening the past 5-10 years.\n\nSo the BOC is in a rundown. Either hike with the Fed or see the CAD die.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "If the house flips for 20&#37; in a week, it's probably the salesperson lowballing the previous owner before selling it himself at market rate.", "score": 5, "replies": [{"body": "Ding ding", "score": 1, "replies": []}]}, {"body": "I don’t think that scenario pass the stress test. ", "score": 2, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "www.mongohouse.com\n\nCreate your own database...", "score": 1, "replies": []}]}]}, {"body": "Most housing markets are approaching bubble status. But everything is fine. ", "score": 9, "replies": []}, {"body": "Fucking liberal minds ... fuck the first time buyer while allowing the investor to continue plunking down on 3-4 condos at a time.\n\n\nDoing what Singapore did with a sliding scale of higher taxes on the 2nd, 3rd, 4th home would have been a much better solution, but no.. that would be far too intelligent for Kathleen “wynning” Wynne in a political election cycle... even though they ended up losing so badly that the party was almost rendered null.\n\nInstead of cooling the housing market and making it affordable they have created a forever renter market whereby rents are too high to save for a down payment AND the rules are stricter for a first time home buyer.  Oh and to top it off; let’s create rent control rules implemented far too late in the cycle which cause rents to jump 20% overnight.   So much #Wynning\n\nYou literally cannot want a better scenario as an investor.", "score": 12, "replies": [{"body": "It's really simple. The problem is not caused by \"investors\" owning 4 condos, that's just a symptom of any hot housing market.\n\nThe problem is caused by [zoning](https://i.imgur.com/PxFgWZt.jpg). This is Vancouver's zoning map. Yellow is the zoning where only free standing houses are allowed. Blue is where other stuff can be built. Relaxing zoning is the first step to alleviating the housing market. Second step is removing existing property taxes and replace them with a 100% Land Value Tax. This cause home owners to shit their pants, because their land is now worth more because skyscrapers can be built on it, AND they have to pay 100% of the land's value to the tax coffer each year. It's a double whammy. Third, curbing Canada's population growth would also help. If you keep your [immigration rate](https://i.imgur.com/kvr3hlR.png) at 1% YoY, you need to keep building new houses.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "The municipality needs to get their ass kicked immediately for the sake of the national economy. Housing crises like this provide a real threat to Canada's economic prosperity.", "score": 1, "replies": []}]}]}, {"body": "Ford is there now. He can fix the mess. ", "score": 4, "replies": [{"body": "Shhhhhh don’t let /Toronto see this or else you might get banned.", "score": 3, "replies": []}, {"body": "> Ford is there now. \n\nBwahahahah!\n\nThat fucking dishonest imbecile was only electable because he was running against Wynne !\n\n> He can fix this mess\n\nOMG ... Bwahahahah!  Stop.. Please - Stop or I'm gonna piss my fucking pants.\n\n\n", "score": -1, "replies": []}]}, {"body": "It’s also very hard to evict tenants. This can contribute to rising rent prices as this risk to the landlord is factored in.", "score": 1, "replies": []}]}, {"body": "I worked in the real estate game last year, the banks have introduced a stress test which means that even though the posted rate you qualify for would mean you could afford this house, the stress test rate means you cannot, so you can't buy this house anymore. Foreign buyers tax has cooled off the really hot markets (Toronto, Vancouver). There are still crazy stories about multiple offers and things going way over asking but a lot of the times the houses being offered for sale should be listed for 1 million and are instead listed for sale at 800K with no offers until a week from now, this creates a frenzy of offers on offer night and the goal is to ultimately get 1-2 people fighting it out for the property. (IMO this is pretty gross, there should be some sort of law or legislation so you know what the other person is offering to avoid signifigantly overpaying for a property).\n\nNow the banks before would be very happy to loan you money but now that the government has made an effort to \"cool off\" the housing market, if you go to apply for a mortgage of over 500k (which is pretty much standard in Toronto and Vancouver) you can put as little as 5% down on the amount under 500k but anything above 500k you have to put 10% down. Once you get into million dollar plus properties (which is a lot of homes in Toronto/Vancouver) the banks want to see 20% down. \n\nAll of these efforts have had slowing effect on the buying and selling that was frequently being reported on in 2017. \n\nNow here is my personal opinion and something I witnessed a lot while I was working. People who bought homes in these hot markets back in 2010-14 saw the prices of there homes essentially double or even triple, a lot of these people began to speculate that this would continue, they took out the equity they had made (on paper) in their homes, and used that money to put a down payment on an investment property. People did this over and over again until they're so over leveraged that if the value of house prices doesn't continue to go up OR even worse actually declines/a downturn in the economy, well you can see the sort of problem that can arise. Even people who are not over leveraged treat their home equity like its a personal ATM and it's not hard to see why when each year your house has (on paper) made more money then you.  ", "score": 3, "replies": [{"body": "There are a bunch of people in a subdivision asking the developer for their money back because they bought the houses at the peak, gave payments to the developer, and now the prices fell a bit. They want their money back, developer told them to fuck off. ", "score": 2, "replies": [{"body": "Yeah I heard they were considering a class action lawsuit if I'm not mistaken..? ", "score": 1, "replies": [{"body": "I can't find the article about it anymore, but I don't think it would work. If the developer would give back the money, then other people would be asking for their money back if they want to get out of their sale agreements. It would pretty much set a precedent. IMO, they shouldn't get their money back, it's their own fault for trying to time the real estate market. ", "score": 1, "replies": []}]}]}]}, {"body": "Toronto/Vancouver are not the same as the rest of Canada. So when you say is Canada bad, well which parts? Calgary is getting hit hard right now. Condo's are not selling.\n\nToronto on the other hand, everyone wants a house but can't afford it because it's too expensive, so they live far outside of Toronto to get a house. Rent is insanely high so everyone is looking for a condo, but the market is really hot for condos so the price goes over ask. The second house prices come down, those condo owners are selling to buy houses. There is nothing wrong in Toronto.", "score": 3, "replies": [{"body": "Its not just condos in calgary. Houses too. People were buying during that frenzy a couple years back and now the price of the market is 20-30% lower in many areas then when they bought and they wont sell at old prices. \n\nCouple houses in my area been for sale for 2 years+ right now and theyre asking for like 70k more than what its currently worth. \n\nAnyone i know under 40 who bought a house hates life right now, while renters are laughing. ", "score": 1, "replies": [{"body": "If condo prices go up, then the house prices naturally should go higher. If condo prices start declining so will house prices.", "score": 1, "replies": [{"body": "The condos havent moved much compared to houses from the areas ive looked at. Many of the condos are in the ritzier neighborhoods so they dont drop as much. Middleclass areas though had 450,000 houses taking a 100,000 hit and still not selling. A lot of the housing in the city is older and no one has done work on it, so they really got hurt even more.", "score": 1, "replies": []}]}]}, {"body": "Its not just condos in calgary. Houses too. People were buying during that frenzy a couple years back and now the price of the market is 20-30% lower in many areas then when they bought and they wont sell at old prices. \n\nCouple houses in my area been for sale for 2 years+ right now and theyre asking for like 70k more than what its currently worth. \n\nAnyone i know under 40 who bought a house hates life right now, while renters are laughing. ", "score": 1, "replies": []}, {"body": "Its not just condos in calgary. Houses too. People were buying during that frenzy a couple years back and now the price of the market is 20-30% lower in many areas then when they bought and they wont sell at old prices. \n\nCouple houses in my area been for sale for 2 years+ right now and theyre asking for like 70k more than what its currently worth. \n\nAnyone i know under 40 who bought a house hates life right now, while renters are laughing. \n\nRetail/commercial space is being hammered too. I work in construction industry and so many buildings just cant find people. Downtown esp.", "score": 1, "replies": []}]}, {"body": "I thought all the Canadians were banned?", "score": 3, "replies": []}, {"body": "Ching chong. Ching chong ching.", "score": 6, "replies": []}, {"body": "I paid $440k last June for a 1200sqft townhouse.  Exact same layout as mine just sold for $600k", "score": 2, "replies": [{"body": "Where", "score": 2, "replies": [{"body": "roughly an hour east of vancouver", "score": 1, "replies": []}]}]}, {"body": "Vancouverite here, the housing stock is held by mostly locals who actually live here, with some portion empty by overseas investors.\n\nI think there is a bubble, but I think that the only areas that will be significantly affected by a crash will be areas away from major urban centers.\n\nFor example, I'm in the market for a condo right now and I see a large amount of stock (11 two bedrooms two baths 500-800sqft condos for sale) at my alma mater, which is situated on a mountain 30 minutes from civilization for $550k CAD. It used to be that the students would purchase one to live in, do their degree and then sell the condo which has appreciated by the time they're done their education. However, I'm not sure if it makes sense to do it anymore considering the uncertainty of the RE environment. I expect such areas to take a large hit, or people to just rent it out with an extremely low yield ($1-1.5k a month probably).\n\nThe thing with Vancouver is that it is a desirable city to live in. Even if RE corrects I do not think it'll be significant as people could just rent it out and drive rental prices down and so people can save up again for RE.", "score": 2, "replies": []}, {"body": "The housing market is somewhat cooling down here, with most market listing prices falling in the last 2 months.", "score": 2, "replies": []}, {"body": "You should read about Australia's.", "score": 3, "replies": [{"body": "nah australia's smarten up already. 15&#37; tax on foreign purchases and foreigners must live in the property. immigration is also tougher than canada's. on the bright side, canadian homeowners are getting some nice fat chinese commie tendies ", "score": 3, "replies": []}]}, {"body": "I have not seen any major red flag in Toronto. I think the rent and house price is pricy but have not yet reached anywhere close to 2007-2008 US level....\n", "score": 1, "replies": [{"body": "We are at that level again in California those who bought 2010 already at least double ", "score": 1, "replies": []}]}, {"body": "Actual snow beaner here\n\nI'm living in a neighboring city if Vancouver - 30 minute drive - same skyrocketing prices. \n\nHere's my anecdote;\n\nI've been watching condos and townhouses for rent/sale for the last 3 years. This one area I've been watching had 1 bedroom suite going for an easy an easy 6-800k this time **last year.** \n\nThe cheapest one I saw was 389,000 **this month.**\n\n\nFurthermore, avg cost of 1bdrm basement suites and bachelor pads have dropped about $200/mo since the massive pump about 6+ months ago. \n\nAgain, this is just anecdote from watching Craigslist/Padmapper and having moved last year as well as house hunting currently. \n\nTLDR: Buy puts on Van housing \n", "score": 1, "replies": [{"body": "Reverse WSB if you want to make money.", "score": 1, "replies": []}]}, {"body": "Reading all this makes me so glad I don't live in a US coastal or major Canadian city. Just took a note for $305 at 4.0%  for 4/3,2, 2300SF on a 9000SF lot.", "score": 1, "replies": []}, {"body": "Take a look at RE loans as a proportion of total portfolio in major canadian banks and you will realise how massively exposes some of them are.", "score": 1, "replies": []}, {"body": "with 1 million immigrants coming in the next 3 years who are highly skilled the market will have lots of buyers than sellers.", "score": 1, "replies": []}, {"body": "I don't think your going to pull off a Canadian version of the big short.\n\nThe US housing bubble was all over the country - in Canada the bubble is mainly confined to 2 cities - and there are steps being taken to let some of the air out.\n\nPlus there is mortgage insurance required for buyers with minimum down payments and the banks are not as poorly run as in the US at the height of the 2009 bubble.", "score": 1, "replies": []}]}
