{"title": "Shouldn't gopro rise back up in the stock market as drone/camera technology gets more popular?", "selftext": "I see that gopro isn't doing as good as people said that it should, but shouldn't it be doing better when drone technology becomes more popular? \n\nAlso what are some good companies to invest who make hoverboards, or whatever the hell the kids are on every time I pass them in Walmart. (You lean forward on a board with wheels and it goes around 5mph)", "id": "3yhl2h", "created_utc": 1451280740.0, "score": 9, "upvote_ratio": 0.74, "num_comments": 13, "comments": [{"body": "As of right now Gopro doesn't have a drone on the market, it's hard to have any market share when you don't have a product on the market. As for cameras they have been trying to get a consumer base like Apple where people buy a new iPhone every time they come out regardless if they need one. So far customers haven't seen a need to replace their Gopros like their iPhones. \n\nThe hover boards you are referring to (the ones that catch on fire) are made by some Chinese company and are of poor quality. Every other product I see is too expensive without mass production and the companies are pre-IPO.", "score": 7, "replies": [{"body": "Agree 100% on the hover boards. They are all basically made in the same Chinese factories and have pretty low QC standards. I highly doubt we will see an IPO of a overboard company.", "score": 2, "replies": [{"body": "Right. There isn't a single company that makes those 'hoverboards' See [NPR's Planet Money](http://www.npr.org/sections/money/2015/11/27/457404184/episode-666-the-hoverboard-life) on them.\n\nThere's already legislation in place for the hoverboards too, which will slow their growth in large cities. And finally, they are too faddish for me to ever be interested in.", "score": 1, "replies": [{"body": "Some places (nyc for example) have had police state that they are categorizing then under laws that don't strictly apply. They don't care, it's known the law doesn't move fast enough, so they don't care if the law says it has to have handlebars if the rest of it is materially the same.\n\nI'd imagine they're banned pretty fast.", "score": 1, "replies": []}]}]}, {"body": "THEIR GOD DAMNIT merry christmas", "score": 1, "replies": []}]}, {"body": "\"I see that gopro isn't doing as good as people said that it should\"\n\nPeople who were trying to hype it up in the first place. Hype stocks that are just hype are like this: escalator up, elevator down.\n\n\"but shouldn't it be doing better when drone technology becomes more popular?\"\n\nIt would have to have one first and I think this is really an example of a problem that I see on here where people extend hope that X company will do X (GoPro will get into drones, for example.) Then you get, \"They'll get into drones, it'll be huge!\" There's no guarantee that they will be successful at all in drones and people are jumping to all of these conclusions when they don't even have one on the market. Also, the company has not done well enough with its current line-up to warrant such enthusiasm about future products or *potential* products.\n\nThe whole thing of them going on QVC also did not do the brand any favors - that's been mentioned more than a few times in recent reports.\n\n\"hoverboards, or whatever the hell the kids are on every time I pass them in Walmart. (You lean forward on a board with wheels and it goes around 5mph)\"\n\nMaybe do some research on what's been happening with these before investing.\n", "score": 5, "replies": []}, {"body": "I have a few shares at a cost average of $17.50ish.\n\nGoPro has no debt, millions in the bank, and a good brand.  I think they are run like shit and their product line is lacking, but I'm hopeful they will eventually enter new markets and they have plenty of runway in the meantime.\n\nI wouldn't be surprised if we hit $15 before we hit $20 again but I'm not in the business of missing my entry trying to guess the bottom.", "score": 2, "replies": []}, {"body": "ThE FCC recently announced that drones over 0.55 lbs will have to be registered with a name and street address.  I'm guessing that this will put a damper on the drone market in the next year.  Maybe not, but people aren't going to be as inclined to buy them to do stupid shit when there is more of a risk/penalty to it.  0.55 lbs is pretty small.", "score": 2, "replies": [{"body": "Will there be a registration cost or a simple form?", "score": 2, "replies": [{"body": "\"A nominal fee\" and what I've seen so far doesn't state how it's done, just that it has to be registered at the time of sale and it has to be a street address, not a post office box.", "score": 2, "replies": []}]}]}, {"body": "low guidance and slow sales. I'll remain on sidelines for now. I'm not seeing current price as an entry point", "score": 1, "replies": []}, {"body": "Why not invest in promising emerging drone companies. [Lift RC](https://www.liftrc.com/) is one I've been waiting to go pub.", "score": 0, "replies": []}, {"body": "Right now GPRO's price is really where it should be, 'cause all the hype around their cameras is over. But, I'm expecting a huge bounce back in 2016 'cause there are some really great products on the way.\n\nInvesting in hoverboards? For me, it's similar to investing in GPRO 'cause there is a huge hype around this thing right now, but in a year or so, when people will realize that it's useless technology the popularity of these devices will sharply fall.  ", "score": 0, "replies": []}]}
{"title": "Alpha test anyone?", "selftext": "Hey, putting together a site where you can put through automated trades. Mostly finished, but wanted to test it. If you have interactive brokers or tradier, and want to play around with it please PM me.\n\nsite: Investfly (http://www.investfly.com)", "id": "3yhguh", "created_utc": 1451278572.0, "score": 9, "upvote_ratio": 0.74, "num_comments": 9, "comments": [{"body": "Ugh, I hate sliders...\n\nOtherwise, this sounds cool. What guarantees do we have you won't steal our algos or \"strategies\", though? ༼ ༎ຶ ෴ ༎ຶ༽", "score": 3, "replies": [{"body": "Fair concern. I believe in integrity and doing the right thing. Also if people don't have faith that we won't steal, then no one would use it which sort of defeats the whole purpose of it. \n\nAlso we have a legal agreement saying we won't. ", "score": 1, "replies": [{"body": "Do you have a newsletter set up for when you have the paper trading thing online? I'd like to try that, or backtesting if you will have the data for it.", "score": 1, "replies": [{"body": "Paper trading is up right now. You just have to create an account to access it. \n\nWe'll have backtesting up in the next update which should be in about 2 weeks. ", "score": 3, "replies": [{"body": "K.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "don't have to know how to code. more as a set of augmented tools, for traders hough", "score": 1, "replies": []}]}, {"body": "Can you make this work with options? I would be very interested.", "score": 1, "replies": [{"body": "The technology is the same. Stocks are a simpler starting point. Also worried about illiquidity in options, and the additional analytics that mus be implemented to make sure traders aren't getting ripped off with large implied vol moves. ", "score": 1, "replies": []}]}]}
{"title": "Once more unto the breach...", "selftext": "After reading for about an hour of *retarded* reddit commentary in /r/wallstreetbets and /r/investing (mostly /r/investing), here are the takeaways (yet again).\n\n༼;´༎ຶ ༎ຶ ༽\n\n* KBIO is already delisted, despite the fact that Nasdaq plans to delist it on the 30th.\n* Martin Shkreli is worth $750 or whatever shit, except that the SEC allegation is that his hedge fund had that much in the bank account.\n* People defaulting on student debt en masse will cause a bubble to burst, despite the fact that it's impossible to discharge student debt in a bankruptcy.\n* It's possible to interchangeably use \"it's\" and \"its\" (and similar contractions) because grammar is just an inconvenience to writing. JUST DON'T WRITE!\n* Shkreli \"price gouged\" patients, instead of insurance companies -- (except that isn't the case, and...) virtually every pharma in existence today was doing the exact same thing.\n* That ([and other things](https://www.reddit.com/r/investing/comments/3xvzm8/turns_out_martin_shkreli_was_telling_investors_he/cy9e5j2)) also makes Shkrelli an asshole, whereas taking out almost [$50m in compensation as CEO of another far bigger price-gouging company](https://www.reddit.com/r/investing/comments/3y339h/walt_disney_chairman_and_ceo_bob_iger_saw_his/) makes you a saint.\n* Shkreli is the modern-day Bernie Madoff, despite never having run an actual ponzi scheme or losing hundreds (?) of billions of dollars for investors.\n* $35 a barrel is the absolute minimum oil prices can go to, despite there being no such law.\n* KBIO is now worthless, despite it not being worthless.\n* Comcast just made its old lines magnitudes faster [just with a software upgrade](https://www.reddit.com/r/investing/comments/3yem32/comcast_just_had_a_major_breakthrough_that_could/), except for the part where it's not just Comcast and [it's not just a software upgrade](http://corporate.comcast.com/comcast-voices/worlds-first-live-docsis-3-1-gigabit-class-modem-goes-online-in-philadelphia) -- the relatively new and expensive infrastructure was just inefficient to begin with.\n* Warren Buffet has made Berkshire Hathaway apparently [20% yearly](https://www.reddit.com/r/investing/comments/3ye8cd/can_anyone_suggest_companies_that_produce_warren/) (dubious statistics), but is [too irresponsible](https://www.reddit.com/r/investing/comments/3y4ccn/how_to_invest_my_dads_retirement_fund_400k/) to be an \"investor\".\n\nSHOUT-OUT TO https://www.reddit.com/r/investing/comments/3y7gxf/everything_you_know_about_martin_shkreli_is/.", "id": "3yhvjt", "created_utc": 1451286541.0, "score": 0, "upvote_ratio": 0.44, "num_comments": 11, "comments": [{"body": "Aaaaand you're a condescending douche. ", "score": 12, "replies": [{"body": "This guy is too privately educated to be in WSB", "score": 5, "replies": [{"body": "D:\n\nヽ༼ ಠ益ಠ ༽ﾉ", "score": -1, "replies": []}]}, {"body": "And you know what, when it comes to money, I like people to try to be more attentive. ༼ ͒ ̶ ͒༽", "score": 0, "replies": []}, {"body": "True.", "score": -2, "replies": []}]}, {"body": "Here's my attempt at proving your post all at once:\n\nahem..\n\nKBIO is delisted because Marzin Skerhlikilwikileaki, the modern day Madoff--or the wolf of pharma, as it were--has a nigh zero net-worth. The student loan bubble was caused by the responsible investor and former Miss Teen USA, Warren Buffet, owner of recently upgraded Comcast--who is also a fortune teller, who foresaw oil bottoming out at $35. Since Warren Buffet is never wrong about anything ever, we can rationally conclude that oil will in fact bottom out at $35. The bubble will burst because of Obamacare and loan defaults. Short $AAPL because 2016 is the year of $BBRY, and Elon Musk is unimpeachable.\n\nIts the truth. #Trump2016", "score": 4, "replies": [{"body": "Let it be!", "score": 1, "replies": []}]}, {"body": "If Shjreeklili isnt gay then why you sucking his dick so much?\n", "score": 3, "replies": []}, {"body": "Another winning post from you. I just knew it had to be about Shkreli or contractions, but both? Fuck off. ", "score": 5, "replies": []}, {"body": "* people still confused what causes inflation and deflation", "score": 1, "replies": [{"body": "Unreal.", "score": 1, "replies": []}]}]}
