{"title": "Historical Options Data, Help!", "selftext": "Hey guys,\n\nNew here, wanted to know if you could possibly help me out. I am in a Financial Derivatives class where we do reports on 4 corporations throughout the semester. My companies are AXP, MSFT, TM(on TSE), BCS(on LSE). I need to retrieve options data for pricing of puts and calls from 2 dates 5 years ago, 2 dates 3 years ago, 2 dates one year ago. Once I get the premiums I then need to price out ITM ATM OTM calls puts straddles strangles etc. and how they would have performed to date if we bought them at that time. \n\nMY PROBLEM: I can not seem to get a hold on the options data from 5 years ago, 3 years ago, etc. I don't want to pay for them but I am seemingly having no other choices... can anyone help me get this data?\n\nThanks a lot! Mike", "id": "3vbbcl", "created_utc": 1449169426.0, "score": 6, "upvote_ratio": 0.99, "num_comments": 9, "comments": [{"body": "Thinkorswim has it.  I believe they offer a trail/demo version of the platform.  It might not have all of the data that the full version has, but it's worth a look.", "score": 1, "replies": [{"body": "Does having access to a bloomberg terminal help me?", "score": 1, "replies": [{"body": "A terminal will only have historical option chains for the past 90 days. You can view these at MSFT Equity OMON <GO>.\n\nIf you need farther back than that, you can use my site at [getvolatility.com](https://www.getvolatility.com). You can enter the trades you want to price historically in the Trade Analyzer and it will show you how much they would have cost to put on daily going back to 2009. It'll also show you payoffs of those strategies historically. I'm happy to walk you through it if you like.", "score": 2, "replies": [{"body": "I have signed up! Thank you! Now I am looking around, how would I find the cost of calls/puts at different strike prices from 2010 let say?", "score": 1, "replies": [{"body": "Here's MSFT as an example. Go to the Trade Analyzer here [https://www.getvolatility.com/trade/equity/useq.msft/](https://www.getvolatility.com/trade/equity/useq.msft/) and enter the first option you want to backtest. By default it will have a 3 month expiry ATM call in the portfolio. The second chart on the page shows its price historically. It currently costs about 5% of underlying whereas in 2009 it was north of 10%. You can hover over the chart to extract exact dates. If you need prices in $, just multiply the price % by MSFT price on that day.\n\nYou can change the portfolio to anything you want and run the same analysis (e.g. straddles, different maturities, etc.)\n\nHope this helps!", "score": 3, "replies": [{"body": "Certainly helped alot, not my last question is how would I get data for Toyota and Barclays, as they are not on here? Also, I basically need the option chain data for the dates of the past. Is this possible?", "score": 1, "replies": [{"body": "Awesome, glad it helped! I unfortunately don't have Toyota and Barclays available. Right now there's the top 600 stocks by option trading volume on the site (and 30 or so futures markets). There's isn't a way to get the raw historical chains; it shows the historical option strategy price time series for your inputted strategy.", "score": 1, "replies": []}]}]}]}]}, {"body": "I know bloomberg is awesome, but I've never had my hands on one.", "score": 1, "replies": []}, {"body": "Bloomberg has the data", "score": 1, "replies": []}]}]}]}
{"title": "Rate Hike", "selftext": "Since this rate hike is basically happening, just waiting on confirmation (weep wop ya heep meep /r/kmasprs) What is the market expected to do if the rate hike happens. Will there be new found confidence in our strong economy and a surge in trading for a day or two? Or will it crash as we realize the demise of the rest of the world's economy?", "id": "3v8gw2", "created_utc": 1449113600.0, "score": 2, "upvote_ratio": 1.0, "num_comments": 10, "comments": [{"body": "hey Ill just conform for you jig. Forecasted to see dip followed by continuous shitty sideways market. \n\nEdit: *WEEP WOP*", "score": 3, "replies": [{"body": "Weep confirmed. ", "score": 1, "replies": []}]}, {"body": "Peering into my crystal ball:\n\nMaybe a slight dip on announcement day, followed by a bull for months.", "score": 2, "replies": []}, {"body": "Where does your mum live, OP?  Imma need a place to live", "score": 2, "replies": [{"body": "What why", "score": 2, "replies": []}]}, {"body": "My guess is a slight dip upon announcement, followed by a move back up, run flat for a bit and shit the bed in Jan. \n\n\nShiensh.", "score": 1, "replies": [{"body": "😭 shit the bed in Jan? So get some Jan 15 puts?", "score": 2, "replies": [{"body": "I'd probably get some Jan 16, but my time inverted options aren't approved yet.", "score": 4, "replies": [{"body": "Ah fuck neither are mine. Eta dec 31 9999. Guess I'm out of luck", "score": 1, "replies": []}]}]}]}]}
{"title": "(Meta) Fellow YOLOers, what's your age?", "selftext": "[deleted]", "id": "3v8tld", "created_utc": 1449119729.0, "score": 3, "upvote_ratio": 1.0, "num_comments": 10, "comments": [{"body": "How old r u op? *ASL?*", "score": 5, "replies": [{"body": "not telling u bby", "score": 1, "replies": []}]}, {"body": "You put fuck you as an option on WSB....", "score": 3, "replies": [{"body": "My question is why he bothered to asterisk it out.", "score": 2, "replies": [{"body": "I didn't, they censored me.", "score": 1, "replies": []}]}]}, {"body": "I'm 13?", "score": 3, "replies": []}, {"body": "Really???  I'm the only one to vote \"fuck you\"!", "score": 1, "replies": [{"body": "As of now, the results show 18% of 199 votes for \"Fuck You\"", "score": 1, "replies": []}]}, {"body": "gay and fairly heavyset", "score": 1, "replies": []}, {"body": "15 and 3/4... it counts okay.", "score": 1, "replies": []}]}
{"title": "Shout out to all my SCTY n*ggas", "selftext": "We making mad gains. Look at that pm. Jump in while you still can.", "id": "3v9wwl", "created_utc": 1449147300.0, "score": 17, "upvote_ratio": 0.85, "num_comments": 14, "comments": [{"body": "I imagined myself buying this when it was at 26 a couple weeks ago.\n\nMy imaginary gains are up to 40% already. Can't wait to take my imaginary friends for a cruise on my imaginary yacht.", "score": 9, "replies": []}, {"body": "Solar powered yacht to the moon. ", "score": 6, "replies": []}, {"body": "Finally.", "score": 2, "replies": []}, {"body": "OMFG!!!! I'm almost break even.", "score": 2, "replies": []}, {"body": "Choo chop mufukus.  I'm in this bitch in every vehicle we have", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Yeah, positive", "score": 1, "replies": []}]}, {"body": "In for 20% gain so far. How high do you see this going? What are your PTs?", "score": 1, "replies": [{"body": "60 by the end of the month. ITC is being decided in Paris and will probably get extended.\nSomething like 600bill going into renewable energy. Dollar down, oil will go up cause of Seria conflict and possible ISIS terrorist responsible for California shooting. Oh and Seria said they would slow down production.", "score": 2, "replies": []}]}, {"body": "I'm all in with all the money I have! 2 shares baby!  ", "score": 1, "replies": []}, {"body": "Appreciate the tip yesterday, I got them $35 weeklies at 0.19. All about dem 1,000% gains! ", "score": 1, "replies": []}, {"body": "Jan 30 calls 700%", "score": 1, "replies": []}, {"body": "Bought SCTY early Oct\n\n\"It will be an environmentally responsible choice\"\n\nCried in corner for two months\n\nHeld on for fuckall reason\n\nFelt some consolation past two days\n\nRealize still down $1.5k\n\nhttps://pbs.twimg.com/media/B5MDNSXIYAARfkE.jpg", "score": 1, "replies": []}, {"body": ">We making mad gains. \n>\n>Making back SCTY losses.\n\npass ;)", "score": 1, "replies": [{"body": "I didn't lose anything, averaging 27.75.", "score": 2, "replies": []}]}]}
{"title": "WSB start buying puts on Apple", "selftext": "Seriously, do it.", "id": "3va9xu", "created_utc": 1449154091.0, "score": 3, "upvote_ratio": 1.0, "num_comments": 16, "comments": [{"body": "I'm going to need to see some proof that you are not a teenager and that you in fact have a cash account. ", "score": 17, "replies": [{"body": "I didn't use the word YOLO? ", "score": 4, "replies": [{"body": "your user is the name of a pokemon.", "score": 0, "replies": [{"body": "Pokemon is 20 years old and WEEDLE is a gen one pokemon.  So logically I'm 30 years old if the average 10 year d was playing gen 1 pokemon 20 years ago.", "score": 7, "replies": [{"body": "That about does it for me; just bought some puts. ", "score": 13, "replies": [{"body": "Your DD is lazier than Snorlax. Your account balance will be swimming with the Magikarp soon. ", "score": 1, "replies": []}, {"body": "Wait till it spikes mid day, buy, sell before close or at open. ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "This based on insider info or YOLO intuition?\n\nHint: just say yes and I'll buy", "score": 2, "replies": [{"body": "Because I've been buying them mid day and selling before close and it keeps on working. ", "score": 2, "replies": [{"body": "Looks like another winning day for you.\n\nMay I ask what options specifically you've traded last few days? I.e. what strikes and time horizons you've been using. Looks like pretty much any put would have made money but curious if you're going for cheap plays (out of the money with short time) or something else.", "score": 1, "replies": [{"body": "January 115 puts", "score": 1, "replies": []}]}]}]}, {"body": "Good call.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Puts = down.", "score": 4, "replies": []}, {"body": "Dude, how does buying a put sounds optimistic to you?", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Aw, how cute.", "score": 1, "replies": []}]}]}]}]}
{"title": "$DIS - Mickey and Han just stuck a lightsaber up my account's ass.", "selftext": "", "id": "3vacs8", "created_utc": 1449155461.0, "score": 7, "upvote_ratio": 0.89, "num_comments": 10, "comments": [{"body": "The ability to lose ESPN subscribers is insignificant next to the power of the force.", "score": 6, "replies": [{"body": "I hope so, I'm in with 20% of my portfolio at $114", "score": 1, "replies": [{"body": "I bought $10K worth at 113.50", "score": 1, "replies": []}]}, {"body": "SW was bought by the darkside sir. The empire has a very good board of directors. But that mouse is going to rob everyone.", "score": 1, "replies": []}]}, {"body": "I am in at 13.10. May the power be with us all.", "score": 2, "replies": []}, {"body": "Me too bruh.  Held through the first two days but couldn't stomach a third, dumped it a few days back at 114 UL for a nice loss of around 40%.\n\nWe should start a support group.", "score": 1, "replies": []}, {"body": "Please hold me.... 115 calls for next friday....", "score": 1, "replies": [{"body": "Bruh. I know OTM yolos are hot in this sub, and \"stops are for pussies\" but....", "score": 1, "replies": [{"body": "I bought these when it was at 114.6...", "score": 1, "replies": [{"body": "Well then good luck and may Brodin bless you with sweet gains", "score": 0, "replies": []}]}]}]}]}
