{"title": "Christmas came early thanks to Tesla", "selftext": "http://i.imgur.com/nZWUnBd.png\n\n$7900 gainz on a $18,850 investment = 42% in about an hour and a half. \n\nAnyone else coming to the moon with me? Fueling up the space yacht now. ", "id": "3pk5ab", "created_utc": 1445382440.0, "score": 54, "upvote_ratio": 0.89, "num_comments": 40, "comments": [{"body": "youre going to keep it overnight after it going up that much?", "score": 10, "replies": [{"body": "Yes, YOLO bro. It went down a bit in after market but I don't see it going below $210 tomorrow, hopefully onward and upward after the plebs sold out today. Even if it goes down I'll sell for at least $5000 profitz.", "score": 9, "replies": [{"body": "On the Oct 23s, you've got about $1100 of time decay loss ahead of you just by holding another day. That's 20% of your gain on that tranche. Custom shock in the image below is just moving time forward one day and keeping everything else constant. If you want to stay long TSLA, I'd consider rolling out to a farther expiry while also booking some of those profits.\n\n[http://i.imgur.com/IRF6fmQ.png](http://i.imgur.com/IRF6fmQ.png). Source: [Volatility](https://www.getvolatility.com)", "score": 14, "replies": [{"body": "I think I made out alright. Just sold my Oct 23s in the 214s for a nice profit. I'll check out that volatility site in the future. Thanks man! ", "score": 3, "replies": []}, {"body": "Thanks for the heads up. ", "score": 1, "replies": [{"body": "No problem. It was a good trade. Don't let those gains slip away!", "score": 7, "replies": []}]}, {"body": "ELI5?", "score": 0, "replies": [{"body": "/r/investing bye\n\nok wait that was me being an ass again. options decay in value over time, his options are going to decay in value very quickly unless he chooses different options.", "score": 5, "replies": [{"body": "Stick to your guns pussy this is wsb not some explanation for plebs shithole", "score": 2, "replies": [{"body": "seems there is disagreement there, my flair being exhibit a", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I don't know what TSLA does but at some point I must have bought some shares..Worked out I think..http://imgur.com/2Z862CG", "score": 10, "replies": [{"body": "How do you not know what Tesla does if you're on reddit?", "score": 13, "replies": []}, {"body": "Sure, you made more money than he did, because you have more capital, but he destroyed you on %. ", "score": 2, "replies": []}]}, {"body": "Can someone explain to a newb what's happening here.", "score": 6, "replies": [{"body": "He bought call options on TSLA near the bottom of its price today. Buyers of call options have the right to purchase stock at a given price, the strike price. These contracts are obviously very sensitive to how TSLA's price moves, because as it rises, your calls are more valuable. (They are also susceptible to interest rates, expectations of volatility, etc.) But long story short, the October 23 calls struck at 207.50 that he purchased have a ton of leverage (gamma) embedded into them. This is because if TSLA closes below 207.50, those options are worth nothing on Friday, but if TSLA closes above 207.50, they are worth however much TSLA is above 207.50. So as TSLA moves around 207.50, the value of these options will fluctuate greatly. For every day that goes by, the expected range that TSLA can trade by Friday in decreases, and the value of the calls also drops. Essentially, he bought the calls when they were cheap and they rose in value significantly because of their embedded leverage (short-dated options have more gamma) as TSLA rallied a little bit off its lows. Hope this makes sense.", "score": 18, "replies": [{"body": "Thanks so much, that makes a lot of sense!", "score": 2, "replies": []}, {"body": "/u/corwinstephen are you familiar with calculus derivatives? Delta is the first derivative of the stock price, while gamma is the second derivative.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "he bought calls....", "score": 2, "replies": [{"body": "What are calls? ", "score": 2, "replies": [{"body": "These are the things you need to google or use the sidebar. \"Call Option\"", "score": 2, "replies": []}]}]}]}]}, {"body": "take your profits man, Don't over do it. Great Trade. ", "score": 3, "replies": [{"body": "Thanks man. ", "score": 2, "replies": []}]}, {"body": "Congratz congratz.", "score": 2, "replies": []}, {"body": "Fuuck. I still haven't gotten around learning how to trade options in freaking ToS. These gainz are insane.", "score": 2, "replies": []}, {"body": "So confused it dropped 6% and u made cash buying Calls?", "score": 2, "replies": [{"body": "Options are weird...that's all you need to know...", "score": 4, "replies": [{"body": "Bitch I ain't some rookie, my real job got in the way of my YOLOing this week I didn't watch the stock at all ", "score": -9, "replies": []}]}, {"body": "I bought these when it dipped down around 203. ", "score": 5, "replies": []}, {"body": "Check out tasty trade its hands down the best video library to learn options", "score": 5, "replies": [{"body": "So fucking stupid bro, I know options I didn't realize the stock ranked below 203.5 ", "score": -10, "replies": [{"body": "Check out investopedia, they have good info about options", "score": 8, "replies": [{"body": "Oh nice I'm new to options I'll check it out! Thanks 🌽", "score": -4, "replies": []}]}]}]}, {"body": "It was down over 9% at one point.", "score": 2, "replies": []}, {"body": "He bought them when tesla was down 9% likely, and the share price gained through the day", "score": 1, "replies": []}, {"body": "he bought weeklies calls at supposedly the right time at the bottom of selloff", "score": 0, "replies": []}]}, {"body": "I need to learn options I'm only long TSLA. sigh", "score": 1, "replies": []}, {"body": "Nice trade. I never have the balls to go short on the crazy story stocks even when they are absurdly overvalued", "score": 1, "replies": [{"body": "he went long calls at bottom(hindsight) of sell off", "score": 6, "replies": [{"body": "Such a simple idea...Yet almost never done.", "score": 2, "replies": [{"body": "A chance to buy TSLA at a 10% discount due to one negative review by Consumer Reports.  \n\nIn Jan 16 calls until next pop. ", "score": 1, "replies": []}]}]}]}]}
