{"title": "Amazon's culture is reportedly so hard on working parents that some people don't mention their kids or display family pictures", "selftext": "https://www.businessinsider.com/amazon-working-parents-daycare-2019-3\n\nAmazon is a notoriously demanding employer, according to some of its employees.\n\nIt's easy for women to be sidelined after having kids, but it also happens to new dads, one former Amazon employee recently told Business Insider.\n\nA group of mothers who work at Amazon want the company to help them address this by providing backup daycare services, similar to what other tech companies offer.\n\nBackup daycare services help working parents when their primary childcare provider isn't available but it might not address the tech industry's bigger problems.", "id": "axeqa3", "created_utc": 1551746266.0, "score": 502, "upvote_ratio": 0.89, "num_comments": 174, "comments": [{"body": "Amazon would be smart to offer some kind of day care... my local gym does...", "score": 149, "replies": [{"body": "Amazon care👍👍", "score": 68, "replies": [{"body": "Now included with Amazon Prime.", "score": 46, "replies": [{"body": "What does the return policy look like??", "score": 27, "replies": [{"body": "Only within 30 days. Or just ask the manufacturer to take it back and find a different manufacturer. ", "score": 7, "replies": []}]}, {"body": "With Amazon USDA choice as well? ", "score": 2, "replies": []}]}, {"body": "I'd like to return this baby.", "score": 12, "replies": [{"body": "That’s okay, we’ll just send you another. You can keep the one you have!", "score": 10, "replies": []}]}, {"body": "Will they accidentally send me the wrong kid and let me keep it when I talk to support to send me the correct child?", "score": 2, "replies": []}, {"body": "Yeah when you get hurt at Amazon that's where you go (former employee)", "score": 2, "replies": []}, {"body": "Including *Amazon Custody* with Same Day shipping!", "score": 1, "replies": []}]}, {"body": "Amazon would just turn it into a sweatshop.", "score": 11, "replies": [{"body": "This is an episode of better off ted", "score": 4, "replies": [{"body": "Miss that show.", "score": 1, "replies": []}]}]}, {"body": "They do offer daycare help through an FSA. It's pretty good, too.", "score": 2, "replies": []}, {"body": "You are an unfit mother. Your children will be placed in the custody of Amazon. Amazon, fuck you, I’m shopping. ", "score": 2, "replies": []}, {"body": "All those little kids could easily be taken to the Amazon Warehouse and do some work, like their parents. Imagine having a triple income thanks to Amazon!", "score": 1, "replies": []}, {"body": "[deleted]", "score": -21, "replies": [{"body": "Hahaha he thinks paychecks are like taxes ", "score": 20, "replies": []}, {"body": "They won’t pay you less to provide a better benefit to people who want it. They already pay you as little as they believe they can. ", "score": 25, "replies": []}, {"body": "This is almost as dumb as people who complain about paying public school taxes if they don't have kids", "score": 11, "replies": [{"body": "No, it’s worse. He’s running under the assumption that somehow he will be paid less due to childcare for someone else. It doesn’t work that way at most places with childcare. It’s factored into Employee costs, but they still have to compete in the marketplace for employees, and so can’t not pay good people and expect them to stay. \nThe taxes, yeah you will definitely take home less. ", "score": 6, "replies": []}, {"body": "[deleted]", "score": -15, "replies": [{"body": "Don't even bother people. This guy is as steriotypical of an incel as they come. Check his post history. ", "score": 8, "replies": []}, {"body": "What abt the fat asses that file for short term diasability??? Empoyees gonna slack!", "score": 7, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 82, "replies": [{"body": "Not yet*", "score": 10, "replies": []}]}, {"body": "Obviously the experience in Amazon will diverge a lot for different roles, such as software engineers and workers.", "score": 39, "replies": [{"body": "[deleted]", "score": 37, "replies": [{"body": "Yup. Lots of friends work at Amazon and  their workload and environment rely almost exclusively on the team. ", "score": 3, "replies": [{"body": "I also think AWS is just more chill across the board. I have a number of friends that work there, across a variety of their sales teams, and work/life balance doesn’t seem to be a problem at all.", "score": 1, "replies": [{"body": ">My friend works there as a dev for AWS. He says experience will vary GREATLY depending on who your team lead is. Dept to dept, same applies. Some teams/depts have tight rope balancing goals, etc. you may or may not have a chill boss.\n\nNot my area of AWS. Shitty manager and can't move teams. I left last week. ", "score": 1, "replies": [{"body": "I’m sorry to hear that :( It sucks to have to look for a new job because you’ve exhausted all options where you currently work. Have you found somewhere else yet?", "score": 1, "replies": [{"body": "Yes, and am so happy!", "score": 1, "replies": []}]}]}]}]}, {"body": "Amazon treats every team as independent. Each team is 3-10 people and there isn't a corporate policy that directs how each team should function.", "score": 1, "replies": [{"body": "That’s partly why it’s done so well. Making blanket rules across a huge corporation leads to a lot of compromises, inefficiencies, and unhappy employees. ", "score": 3, "replies": [{"body": "It also leads to a lot of failed management", "score": 0, "replies": [{"body": "Well, no system is perfect as humans are imperfect. But smaller management teams lead to more tailored policies that fit the needs of the team best.  If there is bad management it affects less people than broad corporate rules that affect everyone. With smaller teams the bad management can be weeded out and changed more quickly . It’s also easier to ask to get transferred to a different team to avoid the bad actors. Almost survival of the fittest management style.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Well at every other company people with children often get preferential treatement. “Can’t work late tonight, gotta pick up my kids.” Meanwhile single people get screwed. At least that’s my anacdotle experience from the three companies I’ve worked for.", "score": 217, "replies": [{"body": "What you(and others) need to do is say \"can't work late tonight, I got a life to deal with\".\n\nEmployers pay for your time, and so long as you're actually working during that time you don't owe them more.\n\nIf projects are running late consistently it's due to poor scheduling.\n\nOf course since managers are treated as superiors rather than as facilitators they'll just try to shift blame and shit is fucked.", "score": 92, "replies": [{"body": ">What you(and others) need to do is say \"can't work late tonight, I got a life to deal with\".\n\nYeah this didn't work for me. Was only met with \"Yeah but she has to pick up her KIDS\"  They definitely get special treatment.  But I agree it is the schedulers fault. ", "score": 25, "replies": [{"body": "You know what’s the difference? \n\nA child can’t possibly be left alone on her own. Any parent knows that.\n\nThat woman that *had to* pick up her kids was going to leave to pick her kids. One way or another. The manager says “yes”. She leaves for her kids. The manager says “no”. She says “fuck you” and leaves for her kids. \n\nNormal people won’t leave their children behind because of a shitty job or shitty manager. They will leave the shitty job/manager behind for their children.  \n\nEdit to make my point clear: the trouble is that you are not setting the boundaries correctly.  *Parents learn through the responsibility of having a child to impose limits and boundaries on their employers.*", "score": 32, "replies": [{"body": "Why can't parents pay for day care? Pretty sure on statement of work that employee must work overtime when asked by the supervisor. Everyone need to share the burden equally, can't have the same person doing OT all the time (unless he doesn't mind it) ", "score": -14, "replies": [{"body": "I don’t know where you live or what contract you work under. I don’t have any kind of “after hours” work on my contract.\n\nFYI I pay north of 30K euros a year on daycare.\n\nThat is however besides the point: you can’t expect to tell someone “look figure out someone to ,within 2 hours, pick up your kids at the daycare, bring them home, cook, feed, shower and put them to bed”.\n\nIf my manager would tell me that, the company would:\n\n1. Get a lawsuit that they are sure to lose; (I work in Europe, sane laws over here);\n2. Lose an employee.", "score": 10, "replies": []}, {"body": "They do - but if it runs into the evening, then the daycare Center needs the kids out. You can’t usually get last minute pick ups for your kid, and it also creates massive safety issues that the daycare Center doesn’t want to be liable for (giving a child to the wrong person, etc). ", "score": 6, "replies": []}, {"body": "I pay 26k per year for child care so fuck anyone that says yea go find more, no fuck you and figure out a way for the company to win.", "score": 9, "replies": [{"body": "A little north of 30k here for my two!\n\nWith the place charging you BY THE MINUTE if you are running late to pick them up. So you get fucked on both ends work and daycare.", "score": 6, "replies": [{"body": "Holy shit, I’ve never wanted kids less.", "score": 3, "replies": []}]}, {"body": "I mean... you chose to have a kid though...", "score": 1, "replies": []}]}, {"body": "Let me offer another point of view: this “work late hours whenever the boss asks for” can only ever function if you have another parent as a “stay at home parent” being full time in charge of children.\n\nIf both parents are going to work (which is in the interest of society since they will contribute more to it), then jobs need to accommodate to the fact that people will still want to raise their own children, in other words, that people will leave on time to pick up their kids from (expensive as hell) daycares in time to cook, dine, shower and put them to bed. \n\nPS: Not having children is not sustainable “society wide”. ", "score": 2, "replies": [{"body": "Not having children if you can't afford them is very sustainable and regrettably rubs everyone the wrong way when told \"Maybe you shouldn't have children.\" Under population would solve a lot of problems right now.", "score": 1, "replies": []}]}, {"body": "That's why you don't take a salary job. An employer cannot FORCE you to work more than full time.\nThank the Union for that.\n\nAlso, why doesn't the workforce Unionize?", "score": 2, "replies": []}, {"body": "Having kids is taking on a burden for the good of the society. \n\nLook into it.", "score": 0, "replies": [{"body": "lol Having kids is a selfish act.  By all means, have your kids but don't pretend you're bringing a little half clone of yourself who's mind you mold to your favor and who you're having to bring *yourself* joy is actually a selfless act for society.", "score": 2, "replies": []}, {"body": "Yea cause there aren't enough breeders out there.", "score": 1, "replies": [{"body": "Is that what you call your parents?\n\nReddit is honestly fucking littered with misanthropic incel-lites. If a specific social issue does not touch them personally, then they say fuck it, I don't want that shit.", "score": 6, "replies": [{"body": "No, I love children, I just think people who don't acknowledge overpopulation is an issue are delusional. \n\nAlso yes I do call my parents that because I was raised to have open discourse with people who don't take everything personal. ", "score": 0, "replies": [{"body": ">I just think people who don't acknowledge overpopulation is an issue are delusional. \n\nWith most of the world aging, and the developed world in the throes of serious demographic crisis, \"overpopulation\" isn't a problem - wasteful use of resources is. \n\nAnd this is amply addressed by technological progress, and each human being mindful about recycling and his consumption habits in general. WAY before you call anyone names, you ought to be fucking recycling, maybe have less red meat, don't buy useless shit, turn off lights when you don't use them, etc. \n\nAnd fucking lol, you call your parents \"breeders\". Sure you do. Do you also have a 8-inch dong?\n", "score": 1, "replies": [{"body": "Buddy. I don't drive, I moved to one of the most recycling nations of the world BECAUSE it takes care of itself, I make clothing last 2 years a time. The number one problem facing the world is overpopulation. Google anything from the studies done by both Sweden or one several years ago that was smothered from the US. So yea keep on keeping on champ. You seem really angry, maybe try less meat?\n\nI actually have stepped back and said \"Hey, how can I help the species.\" But I suspect this falls on deaf ears.\n\nEdit: Also, breeder isn't name calling, it's an adj. that describes someone who has done something. You have an assumption about tech. progress that you're using to validate your argument, tech has not always moved forward and to presume it shall continue to do so is presumptuous. But you are right that scarcity is the issue.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I am assuming you do not have a kid or else you would not have made such a comment.", "score": -1, "replies": []}]}]}, {"body": "What I was getting at is more like \"That's not my problem or her problem:  it's YOUR problem since you set an unrealistic timeline\". And then you gtfo of there.\n\nOf course if you're in a country where you don't need cause for firing, you're basically fucked.\n\nVOTE", "score": 8, "replies": []}]}, {"body": "> If projects are running late consistently it's due to poor scheduling.\n\nYeah, but honestly I prefer working 70-hour weeks occasionally to getting chewed out.", "score": 1, "replies": [{"body": "More importantly, does your compensation justify the occasional 70-hour week? ", "score": 20, "replies": []}]}, {"body": "This only works if you're an hourly employee. Any job that salaried where it's expected to work more than 40, good luck. ", "score": 1, "replies": [{"body": "Well one way to get around this is make yourself valuable enough that they do it your way or the high way. Or you unionize. Or you live in a place with reasonable employment laws where you can’t be fired because you didn’t work more beyond the normal 40.\n\nYou may not get payed overtime, but 40 hours is still the standard workweek and if doing more is routine, something is wrong(on the flip side I will happily work extra from time to time when I foreseeable shit hits the fan. Other than that though, 8 hours and I’m gone. Group 1 yay)", "score": 0, "replies": []}]}]}, {"body": "[deleted]", "score": 16, "replies": [{"body": "Good luck to you. I don’t say those things because I think people should be able to spend time with their children. I think companies should be responsible for paternity and maternity leave, and generally offer a better work life balance for everyone. ", "score": 9, "replies": []}]}, {"body": "Thats the case with many fellow shipmates in the Navy. Since we are on a salary basis and not by the hour it just sucks as a single guy to be working late.  Married sailors are paid more and work less.  I don't blame them because everyone wants to be with their families and it's a fair thing to want as much as possible while in the military. \n\nIt just gets depressing as the single sailor working late into the night with no one to come home to. Though its different for every rate (Navy designation/rank), some are worse than others.", "score": 12, "replies": [{"body": "How do married service members make more money? ", "score": 2, "replies": [{"body": "Basic allowance for housing, basic allowance for subsistence, family separation pay when deployed. It can come out to an extra 1500 a month easily. ", "score": 10, "replies": [{"body": "Already covered BAH, separate rats covers how much it costs to eat at the chow hall and nothing more. \n\nEdit: if you think it’s such a pay bump why don’t you get married and see how much more money you have", "score": -7, "replies": [{"body": "Are you really going to say there isn't a bump if you're married? Cause I'm pretty sure you and I know people (especially double military spouses) that get married for cash. ", "score": 3, "replies": []}, {"body": "I mean, you basically said that the missing pay doesn't matter as long as you're cool with never leaving the base. ", "score": 5, "replies": [{"body": "Or that’s not what I said. ", "score": 0, "replies": []}]}, {"body": "And this is why the divorce rate is so high in the military...", "score": 5, "replies": []}]}]}, {"body": "For lower enlisted its guaranteed BAH, as well as a higher amount than same rank counterparts for single military guys that get approved (E6 for most branches/locations). They also get family separation pay and higher dislocation allowances.", "score": 2, "replies": [{"body": "Bah doesn’t matter if you live on post. Family separation is only paid to deployments over a certain length and moving allowance pays to move. It’s disingenuous to say married soldiers get paid more. ", "score": -5, "replies": [{"body": "That makes sense. \n\nMy focus was on sailors in the Navy though. Deploying underway for greater than 30 days, which is almost always, allows separation pay. We are authorized to live off base in the Navy (At least most Naval Bases), so BAH always matters for us. I wasn't trying to generalize the military in bulk, sorry for the misunderstanding.", "score": 4, "replies": []}, {"body": "Some branches don't let you live off base without being married. That alone is a powerful motivator.", "score": 1, "replies": []}]}]}]}]}, {"body": "Those companies suck then. We get 2 months bonding leave after a child is born but it's offered to both men and women, and everyone is expected to perform their job regardless of marital or parental status. ", "score": 4, "replies": []}, {"body": "Something like that happens at the restaurant I work at. It’s not fair someone else gets to leave early when the work isn’t done because they decided to have kids. ", "score": 19, "replies": [{"body": "Soooo say you have a newborn, problem solved. If they call you a liar tell them your dog/cat identifies as a new born baby and they should check their provilege at the door", "score": 17, "replies": [{"body": "Boomer tier comedy ", "score": 13, "replies": []}]}, {"body": "[deleted]", "score": -39, "replies": [{"body": "Your comment is so ironic that I can’t tell if you’re just saying this for shit and giggles or you’re actually being serious.", "score": 8, "replies": [{"body": "[deleted]", "score": -16, "replies": [{"body": "I’m an 18 year old college student who works in a restaurant and browses this sub frequently. Just because I don’t have the money to invest doesn’t mean the knowledge and keeping up with the market isn’t a useful trait. It’s a personal hobby and a good one at that.\n\nAs for his point, just because you have kids doesn’t mean you deserve to work less for the same pay compared to someone who doesn’t have kids. Kids are a choice that should be made once you are financially stable and can handle the responsibilities of a child and work. Take your elitist bullshit somewhere else and don’t make assumptions about someone’s future based on their current job. One of my former coworkers who used to attend the same college I did graduated a 2 years ago and makes 350k as a mechanical engineer. Worked at the restaurant till the day he began his career.", "score": 3, "replies": []}]}]}]}]}, {"body": "You might think you're getting screwed but then you have a kid and you realize that despite having way less freedom with your schedule, you have vastly more freedom with your life.", "score": 12, "replies": [{"body": "I agree with what you're saying. Kids do take up a lot of time, but what merits shifting that burden to others?", "score": 8, "replies": [{"body": "Exactly all these parents in here acting like they're helping society by having kids. I am single and have trouble getting weekends off because of my coworkers with kids.  Guess when the best time to go out and meet someone to have my own kid is?  But also I wear condoms because I can't afford daycare in my dreams.  It is not my fault you chose to have kids, or worse were to irresponsible not to, but will act like they're this great responsibility others should recognize you for.   Also to add on top I have a peripheral neuropathy my boss can hardly be bothered to understand why I might need a day off, but Karen's kids needed to be watched so she gets it off.   Parents entitlement is a problem", "score": 11, "replies": [{"body": "The attitude there is \"My kids become your problem.\" Uhhhhhhh how about no? If anything having more kids is detrimental to the world and especially the environment. Have your kids, I don't care but stop acting like it's a noble cause that I should be applauding you for.", "score": 5, "replies": []}]}]}, {"body": "The person that chose to give up their \"life freedom\" should have to live with the consequences of their actions. Isn't that what being an adult is supposed to be?", "score": 12, "replies": []}, {"body": "And that has nothing to do with the work place. The solution is to not be shitty to any of your employees, regardless of who they have at home.", "score": 2, "replies": []}, {"body": "Exactly. Parents aren't going home to fuck off of work. They are going to their second jobs, and there's no calling sick into that one. If rather be child free and have the luxury of complaining about parents who get to leave work sometimes. I'd have a whole lot more free time lol", "score": 3, "replies": [{"body": "In terms of work, is there any difference between \"fucking off\" in your free time and raising children in your free time? ", "score": 2, "replies": []}, {"body": "> **If rather be child free** and have the luxury of complaining about parents who get to leave work sometimes. **I'd have a whole lot more free time** lol\n\nWhat an awful parent you must be.  You're envious of the people who have a sense of personal responsibility and self control that you don't.  They looked into the future and the cost of having children and opted out, or opted out until they could afford children (in every aspect).  You said fuck it, I'll have them and bitch about the consequences when they arrive.  And now that's exactly what you're doing.\n\n", "score": 2, "replies": []}]}]}, {"body": "Or just go home after working the hours agreed to in your employment contract. ", "score": 5, "replies": []}, {"body": "I think it’s fair that all else equal, someone who chooses to dedicate a significant chunk of their livelihood and time to developing the next generation gets cut some slack", "score": 6, "replies": [{"body": ">so others should be penalized for their choice? ", "score": 0, "replies": [{"body": "Most people have children. Imagine telling people, no you can't leave if your kids are sick. You would never be able to hire ANYONE. Who is penalized by conforming to your job description? I work incredibly hard because I have children. Co-workers should not be able to manipulate the situation to be extra lazy, that is bad management not another employee being penalized. ", "score": 8, "replies": [{"body": "Expecting not to have to pick up your slack because you got a day off for your kids when I can't get one off to reschedule my own doctor's appointment but we're lazy? Lol. This is the self centered type of crap parents fall into, nobody else has responsibilities that can match \"mah babies\"", "score": 8, "replies": []}, {"body": "The ego on some of the parents in this thread is astounding.  You think you're god's gift to the word because you fucked without a condom.  People who chose not to have kids so that they could use that time in other ways are under absolutely no obligation to cater to your life choices.  It's like telling someone without children they should help pay for yours because children are expensive and they have the extra money.  Fucking delusional.", "score": 2, "replies": [{"body": "You can’t read the bottom component of my post and think I’m delusional. You want to fight about someone and I completely agree with all of it. Get the fuck out of here dumbass. I said working under bosses that favor parents is dumb = bad management.\n\nYou must be too stupid to fucking read. ", "score": 0, "replies": []}]}, {"body": "The problem really isn't people with kids, it's that the average worker just gets royally screwed. Bosses don't usually feel comfortable telling someone they can't leave because their kid is sick, but if the employee is sick they can go get the fuck back to work, thank you very much. ", "score": 0, "replies": []}, {"body": "A flexible company is great and all but I've experience plenty of \"Joe and Suzy have kids so.... you're staying late b/c you dont have kids\". That's being penalized and is unfair. Joe and Suzy could arrange for care.", "score": 0, "replies": [{"body": "Quit and don’t work under idiotic conditions ", "score": -1, "replies": []}]}]}, {"body": "I don’t think you understand what penalized means. ", "score": 1, "replies": [{"body": "Whats your definition? Is someone being assigned extra work b/c they dont have kids not a form of being penalized for not having kids? ", "score": 4, "replies": [{"body": "No, it’s giving you extra opportunity to contribute and develop. \n\nIf it means you have to work more hours than required, that’s on you for not saying no to responsibilities beyond what you can handle in your given week. \n\nNot to mention I’ve never actually seen this happen in real life. Maybe it’s different in other fields, but if people have to leave early or come in late for any reason - kids, dentist, sick spouse, whatever - they just make up for it at some other time or finish their work from home ", "score": -5, "replies": []}]}]}]}, {"body": "[deleted]", "score": -20, "replies": [{"body": "“Most kids are accidents”\n\nGot a source there? ", "score": 9, "replies": [{"body": "[deleted]", "score": -7, "replies": [{"body": "Well the only people I know that have kids did so on purpose. Neither of those is representative of “most” people. We both have a very selective group of people we’re drawing from. \n\nhttps://www.guttmacher.org/fact-sheet/unintended-pregnancy-united-states\n\n“In 2011, nearly half (45%, or 2.8 million) of the 6.1 million pregnancies in the United States were unintended. Specifically, 27% of all pregnancies were “wanted later” and 18% of pregnancies were “unwanted.””\n\nSo less than half are unintended, and I’d argue that the 18% is the important number although some of that 27% may be considered “accidents” rather than “we started trying because it can take a while but really we would have preferred it happen 6 months later” so it’s somewhere in the 18-45% range. \n\n“Stop having kids so the 4th largest city in America can have better traffic” is a ridiculous sentiment. We need to have a birth rate that replaces our death rate for economic stability. ", "score": -2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I have problems because my friends are smart? What kind of logic is that? \n\n", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Lol ok dude. Hope your week gets better. ", "score": 1, "replies": []}]}]}, {"body": "*YOOOOOOOOOO!!!!* It's your **8th Cakeday** sleekgreek! ^(hug)", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I forget exactly how it goes, but there’s two types of people: the ones who shit on others, and the ones who clean it up. ", "score": 1, "replies": []}, {"body": "Sounds more like people who say No don’t have to work late. Have you tried it?", "score": 1, "replies": []}, {"body": "If you work more do you get paid more? If so, does that make it easier?", "score": 1, "replies": [{"body": "Generally salary jobs do not pay overtime. ", "score": 1, "replies": []}]}, {"body": "It all shakes out. Im a dad with two young kids. Yeah i get to miss some days at work to take care of a sick kid or take them to an appointment or something. I also don't have shit for free time. I went from having 7 or 8 hours of the day i could do fucking anything i wanted to outside of work to having like an hour or two after the kids are asleep. By that point i am dead tired myself. \n\nOn the weekend i can go REALLY crazy and have 3 or 4 hours to myself after the kids are asleep! But i still have to get up early because 5yr olds don't sleep in...\n\nI get to sleep in one night a week. That means 6 out of 7 days of the week i am waking up to an alarm clock way before i want too.\n\nWhat im saying is, I'd take being free when im off work over having kids but getting the luxury to take care of them away from work sometimes.\n\nGrass is rarely greener on the other side.", "score": 0, "replies": [{"body": "Damn having kids sounds like a sucks lol", "score": 1, "replies": []}, {"body": "Sounds like you regret having kids or youd look forward to seeing their precious faces.  Your coworkers never asked you to have them. Your envy of someone with free time is a result of your decisions, but you seem to think those decisions deserve to interfere with others \"freetime \".  Like people without kids are just free all the time", "score": -1, "replies": [{"body": "I love my kids more than anything in the world. Seriously. I have a love for my kids that is unmatched with anything I've ever felt for another person or thing. I love those kids so much its fucking scary. I WISH I didn't love them, that'd be awesome if I could just be like \"going for milk see ya\" and never come back. But I never could. Losing the kids would hurt far more than losing my own wife. When I travel for work, the first three days are nice. Then I miss them like crazy and want to get back home. \n\nThat doesn't mean they aren't a pain in the ass most of the time, and totally derail whatever dreams or aspirations you had before they were born. Life is complicated, they can be both. Who in their right mind WANTS to spend all day cleaning up spilled yogurt, changing diapers and forcing medicine down a thrashing kids throat when they are sick? Trust me I'd rather be at work dude. And after work I'd rather sit down and play guitar or build a model airplane or some shit instead of watching Blippi videos on youtube for an hour while trying to convince my kids to eat something remotely healthy. \n\nMy leaving work to take care of them sometimes doesn't interfere with other people. How would me leaving work early interfere with others' free time? Unless they had to cover a shift or some shit? I work full time in an office my dude.\n\nThe bottom line is life doesn't revolve around work. People with kids have a lot more responsibility than just to themselves or their company. They have families to raise and sometimes that requires us to leave work to go take care of something.\n\nSome people get really bent out of shape about that for some reason. I've had to tell a boss not to make me choose between work or my family because I'll choose family every single time.", "score": -1, "replies": [{"body": "\"My leaving work early to take care of the sometimes doesn't interfere with other people. And if it did, TOO BAD\"  \n\nExactly my point, parents act entitled to mess up other peoples time and if they complain \"too bad, I'm a parent\".  You say they derailed your dreams and aspirations but you seem to not care about others.  I get paid shit and use some of my free time with a second income source/ hobby I barely make money from but is my dream to do full time.  Other people can get time off for their kids but I could never ask time off to produce.  \n\nHow does leaving early not interfere with others?  Unless you work independently as opposed to the \"team\" I'm on then your working on the same project other people are,  if you're not around someone else picks up YOUR slack, it's that simple\n\nEverything about your comment screams self centered to me ", "score": 1, "replies": [{"body": "Taking care of sick kids isn't \"time off\", you fucking tool. I checked out other similar comments you're making on this thread and it's pretty clear you are young, naive, and absolutely full of shit.\n\nYou are entitled to take a fucking vacation if you need one.", "score": 0, "replies": [{"body": "Just because I am young does not mean I am naive to the reality that my coworkers with children are considered to have more legitimate reason to leave work than i am when i have to reschedule a doctor's appointment but cannot for over a month while my coworkers get off early for their kids.  \n\nAnd yes taking care of sick kids is time off from work, unless you are taking care of them while doing your work.  That is simple truth whether you want to accept it or not\n\nI have 10 vacation days in a year because I'm the new guy, I'm actually not really entitled to one considering I have to use some of those days for doctors visits to cope with a neuropathy, or because I'm not well because of my neuropathy.\n\nBut yeah your sick kids matter more than my neuropathy because my boss has kids but can barely be bothered to listen to me explain why i need time off to go to a doctor who is a specialist with limited availability", "score": 2, "replies": [{"body": "It sounds like you have a shitty job and/or a shitty situation. Or at least a shitty boss. That's tough and I'm sorry about that.\n\nIf I was in your shoes, and your boss was a hard ass about me needing to take care of my kids...That wouldn't sit well with me. I've had to tell a boss not to make me choose between work or my family. I think you would be fair and saying you shouldn't need to choose between your health or work.\n\nI hope things improve for you. I'm sorry I called you a tool.", "score": 3, "replies": [{"body": "It's hard man, nobody takes chronic pain seriously but kids? KIDS!  \n\nAnd I thought this would be better than my last job, it's my first full time job but I want so badly to go back to being part time.  I'll be off my parents insurance soon though and cant afford a doctor without fulltime for benefits.  I cant even think about having kids and it makes me bitter, I'm sorry too that I'm an ass sometimes ", "score": 3, "replies": [{"body": "I get that, I think you're right. People have this perception of chronic pain being a sign of weakness or lack of drive or work ethic or some shit. Rather than a chronic health condition that people suffer with. I think we have a toxic work culture in large parts of the West. It doesn't help that things like income inequality, healthcare costs and the wealth gap are as bad as they are. It makes it so society at large REALLY puts a heavy burden on your shoulders if you have a chronic medical condition. It's totally unfair.\n\nI guess the silver lining is, it usually gets better. With age and experience usually. People will respect your opinion and principles more in your late 20s and 30s, that's how it seemed to be for me anyway. ", "score": 1, "replies": []}]}]}]}, {"body": "\"Time off\" is literally time not at work so you're absolutely in the wrong there. No one made you have kids, if you don't stop patting yourself on the back it's going to start hurting. ", "score": 2, "replies": [{"body": "I don't get that, \"no one made you have kids\". No one said your parents had to have you either. You should watch a really cool documentary called Children of Men. Without kids and people procreating there wouldn't even be a point to life on this planet for us as a species. What other reason do you think all this shit exists? For your pleasure? ", "score": 0, "replies": [{"body": "Not my point at all. I’m saying that if you specifically didn’t have kids that there’s not going to be a shortage so you can stop acting like you’re singlehandedly saving the species. You’re acting too self important, being a parent is not a noble act and to be frank most parents suck anyways so you’re more likely to fuck the world up more by raising shitty narcissists. This is a general statement, I’m sure you’re a good father and am not saying otherwise.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Yeah but picking up late at daycare, you negate any Benefit for of overtime worked\n\nLet me know when you get there and want to be offered to stay late and lose money", "score": -2, "replies": []}, {"body": "The only one getting the \"preferential treatment\" is the child. The parent isn't leaving work to enjoy free time, it's to go be a parent to their child. If you would force the parent to stay at work the one who would suffer would be the child. All \"benefits\" allowed to parents, be it parental leave, subsidized daycare or petty stuff like priority boarding on airplanes, it's all done for the benefit of the children.", "score": 0, "replies": []}, {"body": "[deleted]", "score": -10, "replies": [{"body": "Incel?", "score": 3, "replies": []}]}, {"body": "Could not agree more.", "score": 0, "replies": []}, {"body": "Aww poor you, are you going to be late to the bar?  Dinner with friends?  Might have to catch a later movie?  Tell me more of your childless struggles...", "score": -1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "No, I wasn't a parent until I was 36. I've worked over 30 jobs since I was 14 in various industries. Never once was I inconvenienced or screwed over by a co-worker because of kids. It's just a shitty trope you're spreading that has little or no basis in reality. It's just a shitty attitude to have thinking that people with kids are an inconvenience to you and whatever company you're working for. \n ", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Things are amazing for me at home, thank you very much /u/emphatic_meh \nOf course I would have noticed if someone ever took advantage of having kids. I've worked in manufacturing, multiple restaurants, government, advertising, and entertainment.  And it is a trope that is used to divide people.  It's just like Trump making low income people mad at welfare recipients and immigrants.  The powers that be want us to punch down and across, not up.  ", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "So when I was single and never noticed parents taking an advantage of work perks, I was the guy taking advantage of parent perks?  Your logic is sound.  Get some sleep bro.", "score": 1, "replies": []}]}]}]}]}, {"body": "I'm not advocating my self importance in any way. I'm just saying that demonizing parents is a shitty view to have. We should be banding together against these corps to demand better conditions for everyone. ", "score": 1, "replies": []}]}]}]}, {"body": "So is this going to increase my shipping cost?", "score": 12, "replies": []}, {"body": "[deleted]", "score": 27, "replies": [{"body": "What do you expect from a journalist media that has a worse record than the national enquirer. ", "score": 3, "replies": []}]}, {"body": "Interesting, one of my friends works for them and has for years...he likes it", "score": 21, "replies": [{"body": "Is he a parent?", "score": 8, "replies": [{"body": "I worked there, and was a parent.  For the most part, it was fine. Fantastic, even. I had issues with Amazon while I was there, but not their attitudes towards parents.", "score": 30, "replies": [{"body": "Thanks for responding", "score": 7, "replies": []}]}, {"body": "Oh god...this is turning into that south park episode....", "score": -35, "replies": [{"body": "[deleted]", "score": 23, "replies": [{"body": "If you want my honest answer: I found it pointless to try to debate something trivial with an overly-chauvinistic soccer dad.  ", "score": -15, "replies": []}]}]}]}, {"body": "Interesting, one of my friends worked for them and he had for years... He did not like it.", "score": 1, "replies": [{"body": "But he liked it enough to continue? Isn't that kinda the balance?", "score": -1, "replies": []}]}]}, {"body": "I work for Amazon, I make a ton of money with a flexible schedule and theres a daycare in the building, it's really not bad", "score": 12, "replies": [{"body": "What do you do there? I feel like a lot of these horrible Amazon working condition are about the blue collar have there.", "score": 9, "replies": [{"body": "That might be true. I work there as well as a Blue Badge (salaried, software dev engineer). The culture is pretty great at my level but I really don't know what it's like to work in a warehouse.", "score": 3, "replies": []}, {"body": "Wharehouse, it's really not bad and I've talked to many in orther wharehouses, it's just a vocal minority the media grabs", "score": 1, "replies": []}]}]}, {"body": "I interviewed with Amazon and got an offer when my wife was 5 months pregnant. Almost straight up accepted it before I thought of researching the corporate culture. Glad I dodged a bullet!", "score": 2, "replies": [{"body": "Or you might have missed a great opportunity.", "score": 53, "replies": [{"body": "There are certain companies that I feel would make your resume shine and grab attention if you can get them on your resume. I am thinking Amazon is one of those.", "score": 2, "replies": []}]}, {"body": "Amazonian.\n\nI came on a while after my wife and I stopped making babies.  I have to say, I am envious of the paternity time in play today.  I had 2 weeks at my former employer.  Younger men are getting close to a month.", "score": 10, "replies": []}, {"body": "Everyone told me the military was terrible and all everyone does is bitch about it, but honestly I’ve had a blast these last 7 years. My job is fucking cake. Easy money. ", "score": 2, "replies": [{"body": "The job being too easy is part of the reason many shy away. Easy = boring to some.", "score": 2, "replies": [{"body": "This.", "score": 1, "replies": []}]}]}]}, {"body": "Bazos can't get away with this forever", "score": 2, "replies": []}, {"body": "Lol, paternity leave is out of scope of discussion at amzn ", "score": 1, "replies": []}, {"body": "Business Insider is littered with clickbait.\n\nGlassdoor at least can shed a bit of light on position, benefits, etc.\n\n[https://www.glassdoor.com/Reviews/Amazon-Reviews-E6036.htm](https://www.glassdoor.com/Reviews/Amazon-Reviews-E6036.htm)", "score": 1, "replies": []}, {"body": "I am amazed that Amazon's stock continues to hold up despite these reported conditions. Most likely due to who owns the majority or shares not caring or knowing something we don't.", "score": 1, "replies": []}, {"body": "Work is work. Family is family. What's with people's obsession of bringing family stuff to work.  ", "score": 1, "replies": []}, {"body": "I love my job and will not leave because of the flexibility they allow me for my family. I am so thankful they are accommodating to me and my family.  I have a young kid and my mother is suffering from a brain disease. I’m glad I don’t have the extra stress of a demanding or inconsiderate boss. ", "score": 1, "replies": []}, {"body": "Google and Amazon though are the most desired places to work by young people.    Google wins the 30 and under.   Amazon 31- 35.\n\nhttps://www.cnbc.com/2018/09/12/23000-millennial-and-gen-z-workers-listed-their-dream-employers.html", "score": 1, "replies": []}, {"body": "churn and burn bby", "score": 1, "replies": []}, {"body": "Work for Amazon. Worked in a lot of different roles across many spaces including fulfillment and corporate. This is muckraking and a complete lie. We give new parents 4 months paid leave. Even fathers. And fathers can use if whenever they want I’m different size chunks. It’s a big company. I’m sure some bosses are generally harder on teams than others. But this is false reporting ", "score": 1, "replies": []}, {"body": "The more I learn about Amazon the less I like them", "score": -1, "replies": [{"body": "Amazon is the worst version of Walmart. I have many friends left supposedly higher paying Amazon job to take lesser paid jobs outside, because of the stressful work environment. ", "score": 3, "replies": []}]}, {"body": "The proles have to work harder so Dear Leader can buy another megayacht!", "score": 1, "replies": []}, {"body": ".....but then how will Bezos continue to make billions? He deserves his billions. He “earned” his billions. He is entitled to his billions.", "score": 1, "replies": []}, {"body": "The amazon hate is so ridiculous. Nobody gives a shit about anybody’s kids give me a break", "score": -26, "replies": [{"body": "More that it's not even true in a general sense.", "score": 2, "replies": []}, {"body": "Easier to hate on big dogs then saying \"Joe at the general store didn't give Sally time off.\" Cause no one cares or will read.\n\nThat said, I honestly have no experience with their culture, but a big company like that and with their disbursement of teams, it's likely to vary a lot. ", "score": 1, "replies": []}]}, {"body": "This thing was never Microsoft. CEO lacks discipline and when you employ blue collar you can bet your ass that you'd be hit with negative PR.\n\n1999 Microsoft is still king , when the US Govt has to step in essentially saying : \"you're winning too much\" it means that you've successfully avoided any obstacle on your path, they did all that employing just engineers.\n\nAmazon seems like they are electing to smash into obstacles (or create their own such as Bezos' divorce and affair) especially in the past year/year and a half.", "score": -1, "replies": []}]}
{"title": "What's going on with TSLA ?", "selftext": "Store closures, model Y reveal, stock declining. Whats going on with this company? Any thoughts?", "id": "axnh62", "created_utc": 1551805671.0, "score": 250, "upvote_ratio": 0.91, "num_comments": 217, "comments": [{"body": "store closing - not a growth company signal. They have fired 15% of their employees and 30 high ranking people have left in the last 6 months. CFO, COO and others I believe. They also had $1b bond to pay in cash too. ITs a mess all around.", "score": 280, "replies": [{"body": "they paid the bond. ", "score": 71, "replies": [{"body": "And lost 20% of their cash. Pretty sure that is the catalyst that is pushing the stock down. Investors were offered equity instead of cash and they declined. Typically investors take equity in a situation like this. \n\nI am long Tesla around $200 and have been telling myself for years that if they fell below $150, yet still hand a similar outlook as current;  I would be adding to my position in a major way. \n\nLots of uncertainty with Tesla as of now. ", "score": 22, "replies": [{"body": "The convertible bonds were priced at $360. Investors would not choose to convert their bonds to a stock at a price of $360 when they can buy the stock for less. ", "score": 9, "replies": []}, {"body": "Ok, all that aside, what do you see going forward that puts Tesla as a potentially $500-$1000+ stock?", "score": 5, "replies": [{"body": "He says he doesn't see that happening now", "score": 8, "replies": [{"body": "Sounds like a great risk reward trade off", "score": 2, "replies": []}]}, {"body": "Long term, maybe but uncertain. I don’t think you can ever predict a stock to run from $200 to $1000. We would have to see serious changes in the political landscape and green energy. ", "score": 0, "replies": [{"body": "You can try to. People feel like it's less of a reach when you have a guy like Musk in charge, which may also be their downfall. You have to remember that Tesla isn't just going to be a car company in the upcoming future. ", "score": 2, "replies": []}]}]}, {"body": "Tesla is gonna die within 5 years.  At least that's the bet I have with a buddy of mine.  I don't see the company lasting, it's the Apple of cars... expensive, overpriced, and if a recession hits, you can say goodbye really quick.  People aren't gonna be spending money on that.", "score": -15, "replies": [{"body": "But Apple itself had only recently hit it's record high after almost 10 years...", "score": 7, "replies": [{"body": "Uhhh... I'm comparing the companies, not their stocks.", "score": -17, "replies": [{"body": "Yep, this is it. This is the dumbest thing I’ve read all week.", "score": 9, "replies": []}]}]}, {"body": "Apple is the leader is phones , so Tesla being the apple of cars = Tesla 4000", "score": 2, "replies": []}, {"body": "Overpriced? The cars pay for themselves ", "score": 2, "replies": []}, {"body": "Only issue with this thesis is, people who are close to hitting hard times with money do not buy tesla, they buy ford, GM, and another shit car that looks great in the parking lot but sucks everywhere else.", "score": 4, "replies": [{"body": "Ya, I'm saying Tesla is gonna go out of business, we're agreeing... I don't know what the issue is.", "score": 3, "replies": []}, {"body": "Why are Ford and GM shit cars? They make good trucks and decent electric cars. Not to mention their sports cars are popular ", "score": 1, "replies": [{"body": "Old one I had always had a love affair with the mechanic. Maybe my mechanic was banging it. Who knows.", "score": 1, "replies": []}]}]}, {"body": "AHHAHAHA i have a bet with my friend too saying the same thing, 5 years and all. I think Tesla is gonna die too.  Yes they may bring some innovation to the market but it’s nothing Porsche or Audi or Volvo can’t do better imo. ", "score": -2, "replies": []}]}]}]}, {"body": "And China blocked imports of the model 3", "score": 51, "replies": [{"body": "supposedly they have let them through now.", "score": 57, "replies": []}, {"body": "Model 3s are innChina they have stopped the release of 1600 cars due to improper labeling ... whatever the F that means . Hopefully they get this sorted out soon sounds like a paper work issue or I didn’t get my “cut” issue lol . \n  They were getting back on track with the expansion into The Chinese market. I wonder if  the stalled trade talks have anything to do with this . ", "score": 36, "replies": [{"body": "[deleted]", "score": 14, "replies": [{"body": "It’s already open source ", "score": 2, "replies": [{"body": "Is Tesla software open source? Any way the standard range model 3 could be modified for longer range?", "score": 1, "replies": []}]}]}, {"body": "I've read that the labeling issue is that Tesla sent a bunch of warning labels for components in English instead of Chinese. If Tesla resolved the issue with the stuff at the ports, then that means that someone's going to have to go through all of those cars and swap the labels before sales.", "score": 7, "replies": []}, {"body": "China's making some form of agreement", "score": 0, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "True but nonetheless", "score": -1, "replies": []}]}]}]}]}, {"body": "Hasn't their debt to cash on hand ratio been dropping beyond expectations though? I feel like there's a ton of short seller hype in the air. ", "score": 7, "replies": [{"body": ">I feel like there's a ton of short seller hype in the air.\n\nWelcome to the most crowded trade on Wall Street.", "score": 27, "replies": [{"body": "Wait I’m high, what does that phrase mean?", "score": 9, "replies": [{"body": "A crowded trade is a trade with a huge amount of participants, which could cause liquidity issues [in this case] when they have to cover. Over twenty percent of Tesla's float are shares held short.", "score": 11, "replies": []}]}]}]}, {"body": "engine resolute outgoing versed jeans mountainous kiss deserted chubby employ\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 12, "replies": [{"body": ">„Order now, get your Tesla in 4 weeks.“\n\nIf you mean the Standard Range Model 3, that is a misunderstanding. (To be fair, Tesla could have been clearer. Their \"communications\" operation has never been good, has it?) But is there really any doubt it means *the first ones may get to to customers in 4 weeks*? Musk said in the press call held for this news that reservation priority is being honored, so how soon someone who doesn't have a reservation can get it depends on how many reservation holders order (within, presumably, the next few weeks. This is a bit awkward, as Musk admitted, due to the surprise nature of the opening of orders. Probably this was quite a recent and quick decision and not entirely worked out -- IOW standard Tesla procedure. There is plenty of evidence that at least  the \"closing stores\"/online-only sales part was, e.g. reportedly new retail leases being signed about a month ago.)\n\n&#x200B;\n\nThat doesn't mean the demand picture is clear and rosy, though. In that press call Musk said he expects reservation holders to get their cars by end of June, which would seem to imply that a lot more reservations have evaporated than what we last heard (a while ago) or what I think many expect.", "score": 1, "replies": []}, {"body": "Odd.  I got mine literally the same day I ordered in late April this year.", "score": 1, "replies": []}]}, {"body": "most of these arent new news tho.. wonder why they are having an impact now. andrew left just went long on tesla too rofl", "score": 1, "replies": [{"body": ">andrew left just went long\n\nWell, 4 1/2 months ago. [https://citronresearch.com/citron-reverses-opinion-on-tesla/](https://citronresearch.com/citron-reverses-opinion-on-tesla/)", "score": 1, "replies": []}]}, {"body": "They did just pay the bond... in cash", "score": 1, "replies": [{"body": "he said *had*", "score": 4, "replies": [{"body": "But since they did it’s not a \"problem\" anymore so why mention it anyway, I don’t see any reason to do so...", "score": -1, "replies": []}]}]}]}, {"body": "The store closures seems to be directly tied to the delivery problems with the 3 role out.  People who tried to pick up their 3's at the store frequently complained about the utter confusion around the delivery of the vehicle.  Meanwhile, the home delivery are the most popular with buyers because the company is only dealing with you at time of delivery, your not standing around waiting for them to finish cooking the pizza, its right there ready to eat.  Elon isn't afraid to change course when something isn't right.  We've seen it time and time again.  I for one won't be betting against the billionaire whose spaceship just docked with the space station.  ", "score": 114, "replies": [{"body": "Also, 80% of Teslas sold without a test drive. Now, that might be because people put down a down payment 2 years ago, so what’s the point in test driving, but still. ", "score": 33, "replies": [{"body": "I literally ordered a tesla last Friday and am getting one tonight. It's extremely easy ordering it. I also have 7 days to drive it around and if I don't like it, I can return it. \n\nedit: ITS A DEMO CAR??? WHY AM I BEING TOLD THIS NOW. \n\nEdit 2: ok... it was a floor model car but after seeing it In person I still love it so keeping it lol", "score": 45, "replies": [{"body": "I wish I could do this with literally any other car company.  Instead you get uninterested sales people that don’t want to put miles on their showroom vehicles for test drives.  \n\n", "score": 15, "replies": [{"body": "Uninterested? Dude, they make money off of you. My fiancée and I were practically begged to drive cars around, and our budget is $10k.", "score": 5, "replies": []}, {"body": "You obviously haven't tried buying a vehicle worth more than $80K before. ", "score": -7, "replies": [{"body": "Literally tried to test drive a ls500h with a sticker price of 85k and the dealer said no. \"We only have two cars and don't want to put miles on it. We only do test drives if you're serious.\" I replied \"I'm serious\". And he answers \"I'll need to talk to my boss first, he's not here today\". This is probably why my next car will be another Tesla", "score": 6, "replies": []}]}]}, {"body": "wait... the car they ship to you for 7 days to test is DEMO car?\n\nI was kinda wondering what they do with the inventory of returned cars", "score": 5, "replies": [{"body": "Sorry I’m not clear. The car that I was sent used to be a model car. Honestly I’m in love with it and will keep it!", "score": 7, "replies": [{"body": "Is it true that when you stop stepping on gas, instead of coasting, it will begin braking? Thanks", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": ">regenerative braking\n\nWhat does that mean? Thank.", "score": 1, "replies": [{"body": "When the vehicle brakes, it uses the energy to charge the batteries a little.", "score": 2, "replies": []}]}]}, {"body": "Yeah it does, it's freaky at first.. actually it still is lol. ", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Sorry I’m not clear. The car that I was sent used to be a model car. Honestly I’m in love with it and will keep it! Also it has like 36 miles so not a big deal. They gave me a 300 dollar discount ", "score": 0, "replies": []}]}]}, {"body": "Exactly this. Majority of sales are completed online, and without test driving the car. If there arent test drives going on, and you cant even testdrive the car at the retail locations, whats the point? Telsa is looking to save money anywhere they can at this point, focusing on delivery and service. Its becoming less of a boutique service and more of a legitmatie contender in the vehicular space. \nOnce there's competitive growth from other compianies, they might get into trouble. ", "score": 12, "replies": [{"body": "So they drop prices on S & X with like 20% on average in Europe. \nHow will that affect Residual values ?\nHow will it affect the bottom line ? \n\nSeems a bit desperate to drastically lower the cars. Even more interesting that in the blog only 6% was mentioned as an average decrease.\n\nOntop of this announcing unveiling of model Y and supercharging 3.0.\n\nAgain why would you reveal everything at once in conjunction to the large price dumps?", "score": 2, "replies": [{"body": "People talk about this as if traditional automaker don’t come out with newer model every year. All they do is slap on a new sticker and called it price drop or whatever.\n\nYou pay for it at the time of purchase just like any other car. If you bought Subaru at November of 2018, that would be 2018 vehicle while 1 week later, 2019 will pop up. Do people complain that hard over 2019 model being lower price? Or Toyota for slapping Avalon onto Camry? We both know they are similar model, and one is just super cheap. \n\nPeople just like to single out Tesla. The only legitimate concern is store closing.", "score": 8, "replies": [{"body": "Consistency is the key. It's knowing roughly what you can expect the value of your car to be worth after X time. ", "score": 1, "replies": [{"body": "What consistency? You do realize the price change all the time right? Special offers was made from dealers All the time. The next guy who buys at November usually pay a lot less than the previous guy for the same year model!\n\nHere is a question, do everyone even pay for the same price for the same year model? \n\nHave you look at truecar.com? The price range is so insanely wide with some people paying couple grand less. The only thing Tesla did was being transparent about it.\n\nYou might even be buying a car where Subaru already lowered their price, yet dealership charge you the old price anyway. ", "score": 3, "replies": [{"body": "Yes. But If I hade a company I would like to calculate against a Residual value.\n\nOf tax purposes as liftning VAT through leasing etc.\n\nAnd it's not normal that you introduce the next Model year of the Audi A7 and drop the price on it  with 30% what your describing is rational and normal but it's not what I meant.\n\nYes and discounts make the RV end up generally lower as an affect.", "score": 1, "replies": []}]}]}]}, {"body": "It's funny how people want the guys to be cheaper so they would be at sand price points as ICE cars, but when Tesla lowers prices it is seen as a bad sign.\n\nI honestly don't get it, lower prices on electric cars should be a good thing.", "score": 1, "replies": [{"body": "You are right in essence about lowering prices is a good thing for affordability.\n\nBut there is more to it.\n\nA 6% decrease is not drastic and have a less impact on residual values of current cars.\n\nBut a 20-30% decrease is ALOT and will heavily impact Residual values and current cars value.\n\nWhen talking about affordability again, it's important to know that residual values are fairly consistent and not to low. Most customers in Europe would be looking at RV and calculate their total cost of ownership over a given time.\n\nAs a short term effect ALOT of customers will take massive depreciation. they could either accept that they lost 30% over a night and realise that cost by selling trading their car or they can keep it for 3 more years to lower the cost of ownership.\n\n\nHigh residual values has been a main driver for people to afford the car.\n\nSo we're does Tesla get affected ?\nWell as customers might have buyback agreements Tesla might end up having to buyback vehicles over a extended period of time were there would be a guaranteed loss.\n\nCustomers getting burnt by the slash of price would perhaps lose trust to continue their relationship especially fleet customers how has the big chunk of cars at hand.\n\nTo summarize a drastic price decrease most likey comes from the company having to take drastic measures.\n\nWhat that means Idk...\n\nBut...\n\nit could have drastic affects on the bottomline going forward...\nPerhaps a refresh or facelift is about to pop up ?\n\n", "score": 2, "replies": []}]}]}]}]}, {"body": "To be honest I feel like closing their stores is penny smart but dollar stupid. Ideally they'd have stores where you can test drive, and have salesmen that can answer your questions and help you purchase a car.\n\nLet me ask, how many people are willing to buy a car online or buy a car without going for a test drive? I may be old fashion, but I for one am not. And while I might not like standing around for them to finish \"cooking the pizza,\" I can tolerate the wait when making a large purchase like buying a $35,000+ car. My understanding is that Tesla currently has a supply problem. And if they can't meet their demand, then closing the stores might save them money is near term. But in the medium and longer terms after they've solved their supply problems, I suspect that the fact that they don't have a physical presences will turn away many potential buyers. ", "score": 5, "replies": [{"body": "They still are providing test drives, and they have the 7 day, 1000 mile return policy.  You are right though, it might not work out, but that's the exciting part of investing in a company like tesla, they are trying new things and not afraid to fail. ", "score": 3, "replies": [{"body": "You still need to get financing and insurance before getting the car. So if you buy the Tesla and return it, well now you have an auto loan that needs to be paid off immediately and an insurance policy you're probably stuck paying  for the remainder of the term. The situation only works if you're 100% on board with getting a Tesla, but if you need to reach out to customers that would need convincing, there's enough of a barrier that it will likely prevent them from risking it on a Model 3 vs buying an EV from Audi once they become available.", "score": 3, "replies": []}]}, {"body": "To be honest in this day and age I tend to look up a lot of youtube reviews of a vehicle before I buy.  I probably spent a good 5 or 6 hours checking out reviews when I went to purchase my motorbike so a test drive isn't really something that I care all that much about.  That being said when I got the bike before I handed over any money I made sure the layout was a good fit for me.", "score": 1, "replies": []}, {"body": "I did. I bought all 6 of my other non Tesla cars right after a quick 15 min test drive to make sure nothing was wrong since they were private party used cars. I feel with YouTube and internet research in general you have can have a very very good idea of how you'll like or dislike a certain product before you even see it in person. ", "score": 0, "replies": []}]}, {"body": "This. Essentially the market is not buying the official reason for the store closures. Lots of Redditors are, however. ", "score": 5, "replies": []}, {"body": "Elon meme admirer!", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 11, "replies": [{"body": "I bought when it dipped in early Jan at $300... Fist bump I guess? ", "score": 4, "replies": []}, {"body": "Look at Amazon stock Jan 2014.  It traded at 404 a share.  In Jan 2015 it was down to 289.  Its 1672 today.  How many early investors sold at 289, losing 25%?  Companies that change the world do it in sudden jumps with dramatic highs and lows.  The question isn't what is it trading at today, the question is will this company change the game.  ", "score": 3, "replies": [{"body": "You are a genius. Tesla compared to Amazon.  What is next Chipotle and Microsoft?", "score": 2, "replies": [{"body": "lol", "score": 1, "replies": []}]}]}]}, {"body": "This is a pretty good read re: TSLA. Covers a lot of what people are saying in the comments.\n\n[http://adventuresincapitalism.com/2019/03/03/cookin-books-tesla-style/](http://adventuresincapitalism.com/2019/03/03/cookin-books-tesla-style/)", "score": 7, "replies": []}, {"body": "Some people that were holding large amounts of Tesla stock sold it to buy a Tesla car which they can finally afford now.\n\nThe stock price is at a total Buy right now.", "score": 84, "replies": [{"body": "Lol", "score": 23, "replies": [{"body": "This sub is a joke. Why does it even exist, if that's the quality of \"DD\" that goes on? It's like WSB but without any of the entertainment value.", "score": 3, "replies": [{"body": "What does DD stand for?", "score": 1, "replies": []}]}]}, {"body": "how much are you buying", "score": 6, "replies": [{"body": "20 bucks", "score": 29, "replies": [{"body": "Thats notta lotta doe.", "score": 4, "replies": [{"body": "I agree. I’m gonna buy 32 bucks worth. ", "score": 6, "replies": []}]}, {"body": "I might pick some up when they hit that.", "score": 1, "replies": []}]}]}, {"body": "Why is this upvoted, it's total bullshit or do I don't get the sarcasm?", "score": 5, "replies": [{"body": "It’s a mixture of sad truth and sarcasm, while also simultaneously shedding a little light humor ", "score": 5, "replies": []}]}, {"body": "This....is not what happened. ", "score": 0, "replies": []}]}, {"body": "Tesla have made the $35,000 Model 3 as soon as possible.\n\nThe market, overall, has completely mis-read the recent price drops across their vehicles. The market thinks demand is slowing and Tesla is cutting prices to increase demand.\n\nIn fact, the cost per kWh of their batteries is decreasing along an exponential cost curve, and economies of scale are coming in to play. Tesla is passing on these savings as soon as they can. The battery cost is going to CONTINUE to fall, indefinitely. This means margins will continue to climb and Tesla will continue to have the option of lowering costs (the battery is by far the largest cost item in their vehicles).\n\nMoving to an online-only sale model is a masterstroke. The market has misread this as desperation, but Tesla have done it to assist in lowering prices.\n\nThis is the tightest Tesla will be financially for their forseeable future. Q1 2019 will probably be the last month Tesla does not show a profit, period.\n\nHardly a single analyst, except for ARK's Catherine Woods understands the big play here:\n\nTesla's fleet of cars is going to become part of an autonomous, on-demand transport network like Lift/Uber. Owners will be able to add their cars to the fleet when not in use and Tesla will take a clip of all rides, AND Tesla can also produce it's own vehicles to add directly to the fleet. \n\nTHE MORE TESLAS ON THE ROAD, THE MORE THEIR COMPETITIVE ADVANTAGE IN AI SELF DRIVING PULLS FURTHER AHEAD. \n\nNo one else has CLOSE to the amount of miles driven. If memory serves, Tesla has more than 30x as many miles of data than anyone else.\n\nEstimates put them about 3 years ahead of the competition in self driving AI... and their new. GPU is 2000% better than the NVIDIA chip they were using..", "score": 142, "replies": [{"body": "RemindMe! 1 year\n\nIf their cost/kWh is falling (it's not exponential...) then they could've kept the same prices and had more profit, which would've enabled them to invest in more projects and also pay down their debt and bond payments. Seems like there must be some desperation, as they're not selling as many cars and demand has waned. If demand was still high, then they'd be publishing numbers about how many people have \"pre-ordered\" and are waiting for deliveries.\n\nTheir \"on-demand transport network\" is going to be hampered because not everyone wants to lend out their $100,000 car to be driven around by random people. And if this ever came to fruition, ICE cars would beat Tesla because it takes a while to charge Tesla cars, compared to ICE cars that can be filled up and put back in service much faster. \n\n> Estimates put them about 3 years ahead of the competition in self driving AI... and their new. GPU is 2000% better than the NVIDIA chip they were using..\n\nWhy the hyperbole?", "score": 46, "replies": [{"body": "> they could've kept the same prices and had more profit, which would've enabled them to invest in more projects and also pay down their debt and bond payments.\n\nThat was never the plan. The plan was to maintain profit margins while reducing cost to $35,000, what Elon sees as a truely affordable, high quality EV. \n\nThe store closures were simply because they don't do anything, people buy Teslas online most of the time and it allowed them to bring the $35k model 3 to market a few months earlier. Q2 2019 and onwards is now expected to be profitable.\n\nTesla isn't about driving demand, they don't have the capacity yet to need demand. They have 3 global factories at various stages of construction, which when complete will further cut global prices. They're still working through a backlog of car orders (roughly about 225k out of 500k) and with the new model Y/roadster/Semi/Pickup lines using the same architecture in the next few years they can easily redirect resources if one model begins to lack demand.\n\nTesla really have put themselves in a fantastic market position. As Stevenmarkryan said they have years on their rivals. Volvo for example are expecting to release a model 3 spec equivilant EV at the same cost as Tesla in 2022+. Thats at least a 3 year lead. Tesla do their own battery chemistry, construction, AI hardware, and software in house. They have a lot of control over their market.\n\n> ICE cars would beat Tesla because it takes a while to charge Tesla cars \n\nValid but Gen 3 superchargers can add 100 miles of range to a model 3 in 10 minutes. If it is a case of charging enough to get home, 5 minutes of your time at a supercharger may all be that is necessary.", "score": 22, "replies": [{"body": "Your nvda comment is total crock.", "score": 2, "replies": [{"body": "My NVDA comment? ", "score": 1, "replies": [{"body": "yes, NVDA is the stock ticker.", "score": 1, "replies": [{"body": "I didn't mention Nvidia though. ", "score": -1, "replies": [{"body": "I understand.\n\n&#x200B;\n\nTheir in-house AI isn't better than competitors. Batteries, in certain cases. AI driven by video cards, absolutely not.", "score": 1, "replies": [{"body": "They are currently expecting a 10 fold performance increase on hardware 3 and expecting it to be able to be level 3/4 by end of year. Introduction of new architecture should be a catalyst for the cars self driving. ", "score": 2, "replies": [{"body": "That's not going to happen. I hope it happens, but it won't.", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "I wouldn’t ever use a supercharger if I owned a Tesla. That kills the life of your battery.", "score": 0, "replies": [{"body": "Used properly it does not.  I have owned a model 3 for almost a year now and I've used many a supercharger.  I still have the exact same battery life as I ever did.  \n\nIf the driver is not smart, and they drain their battery to 0, then charge it to 100% on a SC then you've got a point.  However, all of this is clearly explained in the manuals and falls squarely on owners to responsibly operate their vehicle.  No different than other considerations that there are to be made in ICE cars.  (Not driving til you're on fumes because it's bad for the fuel pump for example)  ", "score": 4, "replies": [{"body": "Trickle charging is used because it’s better for batteries. Also, if Tesla uses Li-ion batteries, you’ll get the most life out of it by keeping the charge between 50-60%. Of course, no one does that", "score": 1, "replies": [{"body": "Again, this is something clearly explained in the manual and upon buying your car.  The number is actually 20-80% to keep your battery between.  Tons of drivers do this and it's very easily controllable in the car.  \n\nI will reiterate again that used properly and thoughtfully there is nothing about the charging infrastructure built by Tesla that suggests intelligent use is particularly bad for your car, and you're spreading FUD.  Especially evidenced by the fact that Teslas automatically gate the amperage down when they're within danger windows of battery charging. It boggles my mind that people think Tesla didnt consider this stuff when they made the cars.  They know far more about their specific battery technology than either you or I.  I will also point to the fact that nearly 20k miles into ownership I have seen 0 degradation of my battery.  \n\nI think you're repeating things you've heard, but that they are not 100% accurate per company documentation and per mine and many other's experience.  It is also implied in your responses that ICE cars dont experience degradation when used improperly, which we both know is false.  ", "score": 3, "replies": [{"body": "Fair points. And regardless of implication, literally everything degrades faster when used improperly. I actually got my information from researching cell phone batteries, which are likewise Li-ion, so scaled down Tesla batteries. They work the same from a chemical standpoint, thus any information pertaining to Lithium ion batteries is widely applicable. Accordingly, I don’t charge my phone above 65%, never let it reach zero, and I turn off programs running in the background to reduce power load drawn from the battery at once. \nI like to think of it like cleaning your car. If you polish your car too much, you’re going to wear down your clear coat and then you’re screwed.", "score": 2, "replies": [{"body": "Glad you can concede the points.  As an owner of the vehicle and shareholder of the company some of the FUD being spread gets annoying.  Because so many of the ignorant masses are so willing to soak it up and regurgitate it as a way to attack the company.  There are plenty of things to criticize Tesla for, but the constant inaccuracies or misrepresentations are annoying.  \n\nTesla has their own specific battery technology and chemistry, so I dont know if cell phone comparisons are fair after a certain point.  I had some similar concerns when I bought mine, but as compared to my cell phone experience the Tesla battery, hardware and software experience has been incomparable.  ", "score": 1, "replies": [{"body": "Don’t get me wrong, I love Tesla. I’d love for them to be profitable, but I won’t invest until they have positive EPS", "score": 2, "replies": [{"body": "That's a reasonable stance to take.  I personally love and hate the FUD because it provides some excellent opportunities to accumulate (like right now).  I believe the current is shifting beneath the surface and BEV is going to radically grow in the auto industry.  Especially when gas prices go back up.    It may get a whole lot more expensive when that happens.", "score": 2, "replies": []}]}]}, {"body": "If it helps the real world battery performance loss that people have seen is 5% over 500,000 miles. The model 3 uses better battery chemistry so should be even less than that. \n\nShould really be fairly negligible in reality. So much so that I wouldn't consider it a reason to not utilise the supercharger network. ", "score": 1, "replies": [{"body": "Awesome ", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "I will be messaging you on [**2020-03-05 19:52:22 UTC**](http://www.wolframalpha.com/input/?i=2020-03-05 19:52:22 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/stocks/comments/axnh62/whats_going_on_with_tsla/)\n\n[**CLICK THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/stocks/comments/axnh62/whats_going_on_with_tsla/]%0A%0ARemindMe!  1 year) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! ehv354s)\n\n_____\n\n|[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/)\n|-|-|-|-|-|-|", "score": 6, "replies": []}, {"body": "RemindMe! 1 year", "score": 5, "replies": []}, {"body": "Because the pre-order comment was something to brag about when they couldn't fill orders. They can fill orders now, so they don't have a huge backlog to show people when their sales are disappointing like they used to be, because they didn't have the cars to sell before. ", "score": 5, "replies": []}, {"body": "What hyperbole? If you're talking about the GPU, the 2000% is the amount that has been provided by Tesla / Elon Musk.", "score": 3, "replies": []}]}, {"body": "Lol if you work in self driving industry, you would know we are years away from that. ", "score": 8, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "[deleted]", "score": 38, "replies": [{"body": "Like those people should be rightfully insulted. ", "score": 3, "replies": []}, {"body": "[deleted]", "score": -9, "replies": [{"body": "You just need a phone to get that job tbh", "score": 1, "replies": [{"body": "Smartest thing said in this thread, no doubt.", "score": 1, "replies": []}]}]}]}]}, {"body": "Yep. If you would work in the self-driving industry you would know exactly how many years we away from that.", "score": 1, "replies": []}, {"body": "Genuinely curious here. I'm not sure what your point is. Everything I mentioned in my post is about how well positioned Tesla is for the future.\n\n", "score": 1, "replies": []}, {"body": "Self Driving launched in May 2016 in the Netherlands and Oct 2017 in the US.", "score": -4, "replies": []}]}, {"body": "Not to mention the more cars they make the cheaper their batteries become. The cars are actually wrappers for batteries. When Tesla batteriy packs hit sub 75$/kWh the market opportunities in energy storage are as large or larger than the car market. The cars are actually just a way to scale battery costs to open new storage markets.", "score": 4, "replies": [{"body": "Yeah, I mentioned economies of scale though I didn't play out its wider implications in energy storage (the market is big and will be gargantuan).\n\nThere's another piece of the puzzle. The acquisition of Maxwell Technologies (underway). Their dry cell battery tech looks likely to increase energy battery density by 2-3x long-term, double battery life AND reduce costs further.  This acquisition may be one of the biggest plays Tesla makes.. and one that no one seems to REALLY get. \n\nI see 3 scenarios playing out:\n\n1. Tesla gains an unassailable lead in battery tech for years until (if ever) a superior tech is invented by a competitor. Then Tesla either acquires them, or is unable to.\n2. Tesla's battery tech is so good that it's competitors buy batteries direct from Tesla, who can manufacture at scale  due to a handful of gigafactories. Let's be real here. If you are an auto company moving into the EV space, do you invest $100,000,000s in R&D in an attempt to develop your own comparable battery tech, and potentially stall your progress for YEARS while the EV market explodes exponentially, or do you buy from Tesla and focus on making a great vehicle as soon as you can?\n3. Tesla open-sources the battery tech in the future\n\n", "score": 2, "replies": []}]}, {"body": "RemindMe! 1 year", "score": 2, "replies": [{"body": "Remind me! 3 years", "score": 2, "replies": []}]}, {"body": "Robo-taxis: would you rather call a car owned by some random owner, or a car custom-built for robo-taxis and owned by the company like [Zoox](https://twitter.com/zoox)?\n\nThink betting on Tesla winning robo-taxis when they're so far from that business today is a very risky bet. So many people going after that space.", "score": 2, "replies": [{"body": "1. I won't mind. Especially if it's one of the safest vehicles ever produced (lowest risk of injury in crash) and ESPECIALLY if it has the best AI.\n2. I'm not betting on them WINNING transport as a service. They don't need to. Cost per mile is looking to be about 10% vs that of car ownership. Pause to consider that.. the size of the transport as a service market is going to be STUPENDOUS. Tesla will take a slice. Even 2-5% of this market will be ludicrous.", "score": 2, "replies": []}]}, {"body": "Tesla gets exponential increases in demand with linear decreases in stock price.\n\nHowever, margins are based on a constant factor, so linear decreases in price has substantial cuts on margins. You can exceed the constant to go into the negative.\n\nI read somewhere that Tesla might be wanting an influx of cash since they just paid nearly $1 BIL on a loan.\n\nWhat no one is mentioning is that Tesla still has $2.5 BIL cash and equivalents to spare.\n\nI think you are over-exaggerating the reductions in cost Tesla will see. Elon likes to run a tight, highly competitive ship.\n\nTesla isn't competing at this level because they want to. They're doing it because they feel they have to.\n\nIt is the mission of the company, and only remaining highly aggressive toward price, production volume, quality, attractive vehicles, new tech, self-driving, etc. will keep them in the lead.\n\nTesla has plenty of driving data, but no services for it yet. Once Tesla has enough cars on the road, they can start charging monthly fees for services around their self-driving capabilities, cameras, security feature, etc. Hopefully.\n\nAnd from there, increase their service capabilities to the autonomous taxi fleet.\n\nIt would be ideal from a monetary standpoint for Tesla to slow down, but that only makes sense in the short-term. In the long-term, if they don't continue to compete, they will be beaten by another auto manufacturer soon.\n\nThe Model 3 is still 50% more expensive than a new Toyota Camry. Costs have been reduced to make Teslas affordable to upper middle class people, and Tesla's leasing terms are reasonable, but they are still not best costs in the market.\n\nYou are paying more for the EV and even more for autonomy. They need the cash, need they buyers, need to stay competitive, need to continue reducing costs.\n\nFor the rest of his life, Elon Musk will probably never sleep.", "score": 3, "replies": [{"body": "“Autonomous taxi fleet”.  Pardon me while I guffaw.", "score": -2, "replies": [{"body": "They have to at least try. Same with Uber and Waymo.", "score": 1, "replies": [{"body": "Have to at least try?  What does that mean?", "score": 0, "replies": [{"body": "They have to try to move toward an autonomous taxi fleet. They already have competition. The levels of autonomy and what it takes for individual vehicles to achieve it is already mostly known.", "score": 1, "replies": [{"body": "Oh, it’s known all right.\n\nhttps://www.reuters.com/article/autoshow-geneva-autonomous-electric-idUSL5N20S64F", "score": 1, "replies": [{"body": "I know that article has input from a global car executive, but their comments are BS. Europe is sadly not interested in being an innovator here. They'll be happy to come in once American or non European countries solve the big problems.\n\nIMO we need to consider autonomous driving an effort of national interest. We paid for the highways. We continue to pay for them, in fact. Paying for the infrastructure necessary for self driving will put the American economy even further in the lead.\n\nThat's just my opinion. It's based on an ideal of efficiencies and technological leaps I believe will result from making these efforts.", "score": 3, "replies": [{"body": "I completely agree. The safety benefits are enough of a motivator alone. But add in decreased insurance and fuel costs and a large country like America and you get a major benefit for going to autonomous driving. ", "score": 1, "replies": []}]}]}]}, {"body": ">that  \r\n>[th at; unstressed th uh t]    \r\n>1.    \r\n>*(used to indicate a person, thing, idea, state, event, time, remark, etc., as pointed out or present, mentioned before, supposed to be understood, or by way of emphasis):*    e.g **That is her mother. After that we saw each other.**", "score": -1, "replies": []}]}]}, {"body": "Just want to confirm, you ARE aware that Tesla has discussed it's plans for the transport as a service fleet, right?\n\n", "score": 1, "replies": [{"body": "Plans.  Right.  Yes.", "score": 0, "replies": []}]}]}]}, {"body": "This is the most delusional anti-China post ever. All you had to do was leave Tesla for Nio’s earnings today at 7pm EST and then return to Tesla \n\nOr not Tesla will be fine\n\nSeems like most companies are guiding for a stronger Q2 than Q1 2019", "score": 2, "replies": []}, {"body": "RemindMe! 1 year", "score": 2, "replies": []}, {"body": "Tesla will never be able to operate a fully autonomous network with the tech their autopilot works on. They're not willing to admit it, but it's an open secret in the industry. Not even cars with LIDAR are working right, and they are objectively better at self driving than Tesla's ever will be.", "score": 0, "replies": [{"body": "\"Never\" is a dangerous word.", "score": 5, "replies": []}, {"body": "Am I right to say you believe the hardware is more important than the software in terms of fully autonomous driving?\n\nThis is not the case. The challenge now is not improving sensors, or having more, it's improving the AI which is interpreting the date from the sensors.\n\nEvery single Tesla on the road is feeding data back to base. Every mile driven. Every action taken by a human driver in every situation a Tesla encounters is being used to train their self driving AI. \n\n\n\n", "score": 2, "replies": []}, {"body": "> Not even cars with LIDAR are working right, and they are objectively better at self driving than Tesla's ever will be.\n\nThis is an extreme statement. How could cars with a certain type of sensor be objectively better than the cars a company could ever produce?", "score": 1, "replies": [{"body": "Because the cars that have LIDAR also have the same types of sensors Tesla's have. Tesla's have inherently less information to base decisions off of.", "score": -1, "replies": [{"body": "That is not true at all. The only good thing about lidar is sensing near objects around you. It has no way of detecting under raining or snowing conditions. Camera is like your eyes, it can see through rain and snow with further distance. Technology is so far out that cameras can have night mode.\n\nLidar is useful now since imagery recognition is not yet mature. As Tesla continues to develop, lidar becomes more useless. Besides, Tesla already operates vehicles on highway conditions all around the world dealing with various driving cultures and weather conditions. It can already change lanes. Then the next step is tracking traffic lights and stop signs.\n\nAlso lidar can’t detect color or even the material of the object. Lidar lacks resolution. A plastic flying over, lidar can only detect an object and cannot determine whether that is a rock or paper. While camera can see it as a plastic object. \n\n", "score": 4, "replies": []}]}]}]}, {"body": "You are telling all the secrets. As an awe struck doe eyed Tesla fan boi, who buys on dips(seriously). Let the haters hate while I buy in the $280’s or 90’s and wait it out. \n\nDon’t forget the acquisitions that will add to the savings. As they bring cost down by bring more in house. ", "score": -2, "replies": [{"body": "I kept plenty of cards close to my chest. Can't give it all away... ;)\n\n", "score": 3, "replies": []}]}, {"body": "RemindMe! 1 year", "score": 0, "replies": []}, {"body": "RemindMe! 1 year", "score": 0, "replies": []}, {"body": "I think it relates more to their insurmountable debts maturing in about a year. Without a major new cash infusion or buyout they have a hard deadline on paying debts that they are not on track to have the money for.", "score": -1, "replies": [{"body": "Curious. What are you basing these comments on? How much debt is to be repaid in about a year? How much profit (or lack of) do you expect the company to render in that time?", "score": 1, "replies": []}]}]}, {"body": "They have done a 180 on stores and seem to be making some reactionary announcements. Its likely that demand in Europe and China isn't as high as they hoped...couple that with softening US demand and the outlook isn't the greatest at the moment. \n\nI still see this as short team noise and I will not bet against Musk as long as he is running this company. ", "score": 19, "replies": [{"body": "The SEC is doing their best to undermine your last part. ", "score": 5, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "I am convinced Tesla would be a far more viable company in the long run without Musk.", "score": 2, "replies": []}, {"body": "I don't disagree?", "score": 1, "replies": []}]}, {"body": "Actually I think it’s Mr Musk doing his best.  Maybe he should consider not committing securities fraud.", "score": 6, "replies": []}]}]}, {"body": "This might explain part of today's decline:\nhttps://www.marketwatch.com/story/teslas-stock-sinks-after-barclays-slashes-target-to-lowest-on-the-street-2019-03-05?mod=newsviewer_click", "score": 6, "replies": []}, {"body": "Personally, I like what Tesla is about and the change the company is pushing broader society to adopt, like embracing electric automobiles for the masses--in my opinion, it's a noble pursuit and a fun company to watch from the sidelines. But why from the sidelines? From an investment standpoint, the fundamentals just aren't there. Tesla struggles with profitability, operates on slim margins, has high levels of debt, more speculative and hopeful investors than rational ones, and generates a negative return on assets, equity, and invested capital, for starters. Not to mention that competition is catching up; competitors with a much stronger balance sheets, resources, and experience are producing fully-electric vehicles with comparable quality. Management at Tesla has been a merry-go-round with a host of key executives contributing to the high turnover rate of employment in important positions, which is not good from a strategic standpoint. Operationally, they've historically been struggling with meeting manufacturing output, and they're notoriously difficult with processing customer returns, which is another sign that the company is still in the very early stages of its life cycle. In sum, I like what Tesla is about and want to see them succeed--but its stock just carries way too much risk and not enough sense in order to warrant my investment. There are so many better picks an investor can make over Tesla, and it doesn't necessarily mean they dislike the company--myself included.", "score": 3, "replies": []}, {"body": "glad I got out when I did tbh", "score": 3, "replies": []}, {"body": "Ever heard of a company being overvalued? Tesla can be the future that doesn't mean it won't lose half its value ", "score": 5, "replies": []}, {"body": "Waiting for it to drop to 250 to buy.", "score": 5, "replies": []}, {"body": "Since SA articles are blacklisted, here's the plaintext from one that explains it really well. I've got no affiliation w/ this author, just thought it was a well written article and I tried to post it but the post was automatically removed. Yay censorship! Anyway, good explanation of exactly why TSLA took a dump after their \"positive\" news:\n\n------------------------------\n\nSummary\nTesla hosted a very secret conference call in conjunction with its Thursday announcement about $35,000 Model 3 and closing most of its stores.\n\nA transcript of this secret call has found its way into the public domain. I provide links to it. You were not supposed to read or hear this.\n\nTesla gave new profit and loss guidance, as well as contradicted its written $35,000 Model 3 delivery estimate - June instead of 2-4 weeks from now.\n\nAsked about the $35,000 Model 3 profit margin, CEO Elon Musk said “we’re not going to answer questions like that.”.\n\nHowever, the report from the Deutsche Bank report merely hours thereafter says that Tesla provided precisely this guidance to them privately.\n\nLooking for more? I update all of my investing ideas and strategies to members of Auto Insight For Wall St.. Start your free trial today »\n\nLast Thursday afternoon, news started coming across the tape about a company that was closing almost all of its stores, laying off employees, and cutting prices dramatically in what seems like a fire sale. Sears, I wondered?\n\nNot quite. It was that $50 billion market cap company, Tesla (TSLA): $35,000 Tesla Model 3 Available Now.\n\nIn order to elaborate on the matter further, Tesla organized a secret conference call to which only a few of its most loyal fans were invited. You might have thought that Tesla being in recent hot water with the SEC would have meant that Tesla should have avoided keeping the dissemination of most important new guidance to a small selected group, but no. Quoth The Raven commented as follows: Quoth the Raven on Twitter\n\n“By the way is $TSLA hosting a secret conference call where they’re doling out material guidance and ducking questions on margin? And if so, sans an 8-K, how does that not violate securities laws?”\n\n-- Quoth The Raven, aka Chris Irons\n\nHowever, the attempt to keep this conference call’s full contents shielded from the investing public did not succeed any better than former National Security Advisor Michael Flynn’s telephone call with the Russian Ambassador in January 2017. Within approximately 24 hours, Paul Huettner had transcribed an audio recording of the secret conference call:\n\nPaul Huettner, CFA on Twitter\n\nIf you prefer a Google Drive link to Paul Huettner’s transcript of Tesla’s secret conference call, here it is:\n\nTesla Call Transcript (2.28.19).pdf\n\nIt didn’t take long for The Los Angeles Times to point out one of the glaring inconsistencies in this selective disclosure from Tesla and its CEO: Tesla website and Elon Musk differ on Model 3 delivery dates. Two weeks? Four months?\n\nBasically, the Tesla web site says that you can get a $36,200 (including delivery charge) Model 3 in 2-4 weeks, but Musk said on the call that it’s June - which is clearly not 2-4 weeks from now. LA Times sought clarification from Tesla on this matter, and the company said that Musk’s word on the secret conference call was the accurate timeline.\n\nThis is beyond asinine. What Tesla is saying is that its 2-4 week estimated delivery time - which you can see by simply going to Tesla’s web site and click to configure a Model 3 - is apparently false information. The correct information? Only provided on a secret conference call to a tiny number of Tesla’s closest fans. That’s what Tesla admitted to The LA Times.\n\nWhy would Tesla do this? I have absolutely no idea, but one suspects that Tesla wants people who visit its web site to be tempted to hand over $2,500 while believing that they will get a car in 2-4 weeks. Then, on the conference call, Musk forgot about that bait-and-switch and told what he knew to be the truth - that June is the correct estimate.\n\nJust think about it: How on Earth do you get a custom-made car built and delivered in 2-4 weeks? Assuming nobody is ahead of you in line, 2-4 weeks can be a typical all-in delivery time across the country. Surely Tesla isn’t suggesting that demand is so low that there's almost nobody else ordering this new $36,200 vehicle?\n\nThen there’s that other thing…\n\nOne of the questions near the end of the secret conference call was this: “What is that Tesla’s profit margin on each and every $35,000 Model 3 sold?” Musk responded: “Yeah. We’re not going to answer questions like that. Next question.”\n\nOK, so Tesla doesn’t want to get into the subject of the $35,000 (plus $1,200 delivery charge) Model 3 margin, in speaking to a group - even on a secret conference call.\n\nHowever, the following day - March 1 - Deutsche Bank analyst Emmanuel Rosner published a report for DB’s clients called “SR M3 Likely Addresses Issues; Questions Now Back To Margin.” In this report, DB writes as follows:\n\n“In our follow-ups with the company, management outlined a high level bridge to maintaining profitability which includes savings from higher fixed cost absorption…Tesla indicated that initially, the $35k Model 3 will generate a positive cash gross margin (gross profit plus depreciation of approximately $1,500)….”\n\nWait a minute! Why is Tesla providing this information selectively to Deutsche Bank? Hours before this report was published, on the secret conference call, CEO Musk said that he is not going to answer questions like that. However, apparently in an even more secret private dialogue between Tesla and Deutsche Bank, Tesla provides this highly important information in the most selective manner possible.\n\nDid any of Deutsche Bank’s competitors get this information too? Did Goldman Sachs? Did Morgan Stanley? I have no idea. One thing is clear: The investing public never got to hear this information, and in this case even the secret conference call participants were told that Tesla is “not going to answer questions like that.”\n\n...Except in private dialogue with Deutsche Bank, apparently.\n\nBottom line: Where is the SEC on all of this?\n\nWe are barely scraping the surface here, but immediately we find three things:\n\nOn a secret conference call with outsiders, Tesla provides new profit and loss guidance.\n\nOn the same secret conference call, Tesla massively contradicts its new Model 3 delivery times - four months instead of 2-4 weeks - and then confirms that what was said on the secret call is the accurate information. Still, as of this writing, Tesla’s Model 3 order site reflects the information Tesla told LA Times is incorrect.\n\nIn a private dialogue with Deutsche Bank, Tesla provides gross margin guidance for the $35,000 Model 3 specifically, immediately after having said on the conference call that it was “not going to answer questions like that.”\n\nThe only conclusion that most investors, who are not part of these privileged management conversations, can say for certain is: Tesla is the boss in the relationship with the SEC, tossing around a submissive SEC staff like a dog owner with a tiny pup on a leash.", "score": 10, "replies": []}, {"body": "It's a good time to buy TSLA ( I am buying more).  The news is full of FUD to drive the price down.  The stores closing is just streamlining and cutting costs so they can sell their cars as cheap as possible.  All of their sales have gone through the website ordering system, even if you went into the store.  So the stores were not really necessary.  The China Gigafactory will be producing cars in a few months and volume production is expected by the end of this year.  The Model Y targets the biggest auto segment in north america.  They just acquired Maxwell Technologies; their dry cell chemistry offers a 15% to 50% improvement in energy density over current Lion batteries.   Also Tesla keeps cranking out grid scale batteries and the solar roof is on the way (still testing long term durability, targeting 50yr lifetime) . ", "score": 9, "replies": [{"body": "Solar roof still “on the way”, huh?  Hey, don’t stop believin’, man.", "score": 0, "replies": [{"body": "Do you think that it will not arrive?", "score": 2, "replies": [{"body": "I’ve rarely been so sure of anything in my life.", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Hey, I can dig it, man.  I’m more of a fan of utility-scale solar, but to each his own.  \nMore to the point, the Buffalo factory has been largely exposed as a massive scam.", "score": 1, "replies": []}]}]}, {"body": "Lots of lay offs and a big empty parking lot.", "score": 2, "replies": [{"body": "That’s a good indicator.", "score": 1, "replies": []}]}]}]}]}, {"body": "It's simple. The stock was overvalued and the market is correcting itself to more accurately reflect the offering TSLA brings to consumers and, more specifically, investors. \n\nTSLA is not a stock of reason, as it is priced emotionally. Some people will hear they're closing stores and they'll want out, not knowing that most of their sales are done online, and Tesla's cars are a different field than ICE vehicles all together. Primarily, they don't appeal to everyone, as not everyone's commute can handle the limited range or charging requirements. So why have a bunch of stores for people to test drive and compare your vehicle when the vast majority of consumers are not your target market? If someone wants a Tesla, they'll find a way to test drive from Tesla. \n\n People want to believe in electric vehicles, because they believe electric vehicles are the future. They want to believe in AI for the same reason. I imagine most people who are heavy in TSLA do not believe it is a short term hold. ", "score": 8, "replies": [{"body": "Tesla - market cap $47.7B, sold 350K cars in 2018.\n\nFord - market cap $34.9B, sold 6M cars in 2018.\n\nYou can't explain that!", "score": 8, "replies": [{"body": "you just did eggplant 🍆 they are over valued BUT I think in 5 years Tesla is going to be worth north of 500B why? Because batteries are going to be cheaper. That's a fact. And people will be educated into buying an ev. Right now Tesla is grossly overvalued based on what we have. But if the market comes down to it's senses it could be a very good buy. This is the apple, amazon, Netflix of stocks. If you guys missed that run Tesla will for sure do it. Just don't miss sleep because your stock will be down 50%. Shit happens.", "score": 4, "replies": []}]}]}, {"body": "It’s a liquidation right in front of our eyes.\n\nBring on your downvotes ", "score": 9, "replies": []}, {"body": "This question could’ve been asked at any time in the past two-plus years and the answer would always be something different. ", "score": 2, "replies": []}, {"body": "Model Y SUV will be a hit with the suburban soccer moms", "score": 2, "replies": []}, {"body": "They wanted to release another model so they spell out S, 3, X, Y. Elon you dawg ", "score": 2, "replies": []}, {"body": "Store closures to save money, bringing overall prices down and increasing sales.\n\nElon isn't afraid to stop when something isn't working and make big changes to continue to expand.\n\n&#x200B;", "score": 4, "replies": [{"body": "yeah really? I don't understand why it dipped so hard at all. Its a smart decision.", "score": 1, "replies": []}]}, {"body": "Alot of issues. The biggest one is... A ton of competition coming in the next 12-24 months at favorable price points by respected brands. ", "score": 2, "replies": [{"body": "The problem I don’t think it’s the competitors. The problem is the executive management.", "score": -1, "replies": []}]}, {"body": "After so much noise regarding the China market, fired such a big amount of people and high positions left... Would say is a terrible sign for us. I've watched multiple interviews with Elon Musk where he explains what costs they have and all that was expected to happen. In Europe they have a massive competition but still have some belief in him as he has experience in getting out of bad situations and still he is capable ish to run and focus on multiple companies.", "score": 3, "replies": [{"body": "There is absolutely no competition in Europe. There are a couple of other eclectic vehicles but are not even close to Tesla (in experience, mileage or price). \n\nThe only car that was really popular in the Netherlands at the end of 2018 was the Jaguar ipace which sold 2700 vehicles in December 2018 and 14 in January 2019. The only reason for this is incentives. \n\nThe current model 3 is too expensive for Europe. In the Netherlands the price of the model 3 was € 64.000 / $ 70.000 for the cheapest model with red color and the rims changed. \n\nIf the price of the cheaper model 3 will become ~ € 40.000 then it will be, for sure, a huge success in Europe but everybody is waiting for the lower priced versions of the model 3. ", "score": 5, "replies": []}]}, {"body": "Elon Musk, their CEO, was called to be held in contempt by SEC, though he always seems to find his way out of terrible PR and situations similar. ", "score": 1, "replies": [{"body": "That’s because the tweet he got in trouble for was directly out of the recent earnings statement. SEC fucked up on that one and nothing will come from it. ", "score": 1, "replies": []}]}, {"body": "Bearish formation, nothing really weird.", "score": 1, "replies": []}, {"body": "The store closures are because Tesla plans on getting to the point where 100% of the cars are bought online and delivered. ", "score": 1, "replies": []}, {"body": "Loss of confidence in the celebrity CEO.", "score": 1, "replies": []}, {"body": "This stock made no sense for years now.", "score": 1, "replies": []}, {"body": "I’m all in favor of closing down the stores. Most of there sales are online and it’s not like that’s going to change any time soon. People simply don’t have time to go to drive to a dealership to wait hours before getting there car.", "score": 1, "replies": []}, {"body": "I've been looking for an excuse to test out a new app I've been playing with a stock I'm not holding!\n\nScore: 26/100\n\nQuality: 29\n\nValue: 11\n\nMomentum: 38\n\nLooks extremely over priced to me and the future momentum is below average too. I'm still glad I didn't pick Tesla up, feels like an investment in Musk but this isn't a startup!\n\nMaybe if you believe in the company vision I guess you would buy into it.\n\n&#x200B;", "score": 1, "replies": []}, {"body": "Stock price swing of TSLA is nothing new. It’s the drama queen of stocks. JMO but I think it will survive LT. I’m sure there will be more ups and downs ahead, which is why even if you are a long term believer, I wouldn’t suggest holding it long-term when you can buy at one of the big dips and just wait till one of the peaks and sell. I’m hoping it dips a bit more so I can buy it and do it again. Look at the drop from june to oct of last year. Everyone thought the world would end. Fundamentally it’s way overpriced, which is why we are all so nervous, but then so was/is Amazon. If it does run into bigger problems everyone will say “oh look, see I told you, it was never going to succeed.” Funny I didn’t hear the same rhetoric before GE shit the bed. It can happen to any company, but unfortunately as a Joe stock investor, you won’t know til it’s too late anyway. ", "score": 1, "replies": []}, {"body": "Socks are down because of possible EU Tarifs if Trump imposes some on them. ", "score": 1, "replies": []}, {"body": "I get the thinking around self driving and a robot taxi service.  That is incredibly disruptive.\n\nBut how is a new feature for a car to sell more cars that disruptive?\n\n", "score": 1, "replies": []}, {"body": "Nobody trusts Musk to finish a project. He's always been a double edged sword for them.", "score": 1, "replies": []}, {"body": "Musk is capable of tanking his own stock with weird tweets and accusations. Who remembers him accusing a Brit of being a Pedo? Or taking the company private? Or attacking the SEC for normal regulatory activities?\n\nSecond, the numbers of cars Tesla makes is tiny compared to any of the major manufacturers. And guess what? They're all going into electric cars in a big way.  \n\n\nThird, Musk is a bit of an eccentric genius asshole. Firing people for no reason. Raging out. And then his other companies? The Boring Company is a joke. It's never going to work. Pure fakery. Space X is pretty cool, amazing, but it's also bleeding money with an unsustainable burn rate.   \n\n\nWhere does all his financial flim flammery end? You can't keep racking up more debt forever. ", "score": 1, "replies": []}, {"body": "Too much drama to be investment grade.", "score": 1, "replies": []}, {"body": "Pretty simple. Massive amounts of debt.", "score": 1, "replies": []}, {"body": "Seems like they're just not making enough profit. If my memory serves me correctly, they've mentioned that they will not turn a profit this quarter, which is concerning - if they aren't profiting now, when will they ever? How much longer before they finally \"optimize\" their manufacturing process?\n\nStores closing is a huge red flag for me tbh - definitely not a sign of growth. It seems like in the past a lot of passive buyers were converted after a demo/test drive. Sure Tesla will save money in rent, but I feel like in the long term this will weaken the brand strength. Less casual test drivers = less buzz. Less storefronts = less presence. Sure you might still be able to test drive a Tesla where they bring one to your door, but only motivated buyers already considering Tesla as their next car would probably go through the trouble.\n\nLastly, cutting the price of the Model 3 I feel like alienated their most recent buyers. Imagine if you had just bought the car two months ago how angry you'd be that the value of your car dropped $10-20k in that measly amount of time. And new buyers would probably be hesitant to buy, wondering whether there is going to be another sudden price cut\n\nJust my two cents. I'm a Tesla fan and love the cars, but the future doesn't look too bright imo. Change my mind!", "score": 1, "replies": [{"body": "No profit this quarter is due to paying off a big debt and making some new big investments to expand production. Nothing wrong with that, they have money to spend and growing is still a priority.\n\nOptimizing. They've been optimizing all the time and have finally reached the point where a $35k model 3 can be produced profitably. \n\nThe vast majority of sales were already made online, most of stores were essentially pointless. They will only keep showrooms that get high amounts of foot traffic. Who knows how this will develop long term, but right now having stores is not efficient.\n\nI'm awaiting delivery of my model 3 quite soon and of course wondered if I would get some change on my order that I haven't paid for yet. I have gotten a message that they will add autopilot for free which is nice. I did want those features. Also if I understand their return policy correctly I can use my brand new car to a week and return it if I'm not happy.\n\nAs the stock drops I'm buying more of it. If there's no profit this quarter which is likely, I would guess it drops a bit more. But I still believe it's going to recover again, then drop again etc... I'm playing the carousel, earning a little with every hill and valley.", "score": 6, "replies": [{"body": "Ah I didn't know about them paying off debt. Seems alarming though that the shutdown of stores is coming so soon after widespread layoffs.\n\nBut yea Tesla is a fun one to short. And in a very very long term I think they'll be fine, but the current stock price seems so high. Expectations for the company are astronomical", "score": 0, "replies": [{"body": "The layoffs has nothing to do with being unprofitable. On the contrary, they got the production processes efficient and sent home all the extra people that were only needed for the big push. Right now they don't need all those people. It wouldn't be smart to keep thousands of workers on standby twiddling their thumbs while they wait for the next growth spurt. But I think as they start working on the next vehicle and growing production of all the current products they're going to hire more people quite rapidly.", "score": 2, "replies": []}]}]}, {"body": "80% of people who bought a Tesla didn’t do a test drive. So it doesn’t make much sense to ha e tons of stores open. I have had 8 people rent mine off Turo bc they were going to buy one and just wanted to spend some time alone with one for a weekend. ", "score": 2, "replies": []}]}, {"body": "Reality's finally kicking in.", "score": 0, "replies": []}, {"body": "3 card shuffle,  they have been cooking books, and this is slowly being realized..\n\nThere is a reason why every cfo resigns soon after taking job.\n\n\nThey are bankrupt and trying to hide it", "score": -1, "replies": [{"body": "Do you have any evidence of this ?    I've been predicting this for a long time", "score": 4, "replies": [{"body": "No evidence, just connecting the dots between a company not making money, heavily in debt, huge cash burn, closing stores, etc and the real red flag is all the executives, especially those close to the financial statements are leaving in rapid fashion. That is a huge red flag. They are cutting corners to dodge bullets come earnings time. \n\nI would not invest in this stock at all, way too many red flags", "score": 3, "replies": [{"body": "Only one CFO hes left. Well, two", "score": 3, "replies": [{"body": "And several VPs and other executives", "score": 3, "replies": [{"body": "[http://adventuresincapitalism.com/2019/03/03/cookin-books-tesla-style/](http://adventuresincapitalism.com/2019/03/03/cookin-books-tesla-style/)", "score": 3, "replies": []}]}]}]}]}, {"body": "Why would idiots downvote this and hide it.\n\n&#x200B;", "score": 4, "replies": [{"body": "Tesla has a lot of fans, but I think it’s a reasonable bear argument ", "score": 2, "replies": []}]}]}, {"body": "Securities fraud loser.  Get in.", "score": 0, "replies": []}, {"body": "It's funny that everyone is betting against Tesla, they did it before and they will do it again. Other car companys are starting to get into EV's because of Tesla remember that.", "score": 0, "replies": []}, {"body": "Elon musk trolling tweeting he”ll build like some amount of car in an instant LOL and they did an investigation.  And then they found out it was a joke so Elon musk had to clarify on Twitter ", "score": 0, "replies": []}, {"body": "They take any profits from model sales to invest into the next. S to X to 3 now to Y. People freak out about declining revenues.\n\nElon embarrasses the shareholders with his eccentric personality. \n\nI think the company is fine. Just growing pains.\n\n", "score": -1, "replies": []}]}
{"title": "$TSLA Daily Investor Discussion - March 05, 2019", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Q419 Earnings Official Thread](https://www.reddit.com/r/teslamotors/comments/alewpn/tesla_q4_2018_financial_results_and_qa_webcast/).\n", "id": "axj3rh", "created_utc": 1551776675.0, "score": 12, "upvote_ratio": 0.94, "num_comments": 185, "comments": [{"body": "Bond yields back over 8%: http://finra-markets.morningstar.com/BondCenter/BondTradeActivitySearchResult.jsp?ticker=C705185&startdate=03%2F05%2F2018&enddate=03%2F05%2F2019&postData=%7B%27Keywords%27%3A%5B%5D%7D&startDate=&endDate=&showResultsAs=B&debtOrAssetClass=&spdsType=", "score": 11, "replies": []}, {"body": "At times I'm bullish, other times very pessimistic investor in TSLA.\n\nBut just like the market I'm starting to realize that  while Tesla did achieve it's mission of accelerating sustainable transport it never had the mission of making money for it's investors - and that statements such as \"profitable every quarter going forward\" don't necessarily hold true, the auto industry is very tough.  It's very likely that Tesla remains a \\~50B company for quite some time despite making good , even great products. I can only imagine the internal struggles, layoffs, departures, deadlines, backlog of email unanswered.\n\nI own TSLA stock for 3 years and also own a Tesla. But loving the product does not mean the stock is a good investment, had I invested in another company I'd be 30-40% wealthier today.", "score": 18, "replies": [{"body": "Here's the thing: you can think Tesla is a great company with great products while also thinking that the bull thesis 70-80 Billion dollar market cap was utterly absurd.  \n\nIt's a company with some very shaky fundamentals, a lot of debt,  occasionally unstable upper management, and it's in a traditional manufacturing industry (no matter how much it wants to be seen as a Silicon Valley tech company) with tight margins and massive capital requirements.  \n\nI think the latest announcements are a return to sanity.  The 350-380/share and climbing price points were justified by an assumption that Tesla would rapidly and immediately rewrite all the rules in the auto industry.  That just hasn't happened, and doesn't appear to be on the immediate horizon.\n\nTesla doesn't become a bad company with bad products at a 250/share price, nor does that sort of price fall mean bankruptcy or any nonsense like that.  The earlier mispricing reflected flaws in the market, not Tesla.    ", "score": 8, "replies": [{"body": "> Tesla doesn't become a bad company with bad products at a 250/share price, nor does that sort of price fall mean bankruptcy or any nonsense like that. The earlier mispricing reflected flaws in the market, not Tesla.\n\nAgreed.  Even a $200 share price would give them the same market cap as Ford, a company that churns out billions in profits every year.  ", "score": 6, "replies": []}, {"body": "Yup, 100%.\n\n&#x200B;", "score": 0, "replies": []}]}, {"body": "Yep -- this has turned into a slog. Whether this is a good *10 year* investment will basically depend on whether they manage to hit an escape velocity vs. competition or whether they all more or less draw even with each other.\n\nI don't think most competitors have a chance, although a couple might do ok. It could literally be another 2-3 years before this is obvious though.\n\nUnfortunately I think Tesla management is just not that good or this game would have been over already.", "score": 1, "replies": []}]}, {"body": "Serious question, no trolling from bears please\n\nDid Tesla/Elon violate Reg FD by holding that private conference call and not releasing a transcript? If so, what are the repercussions?", "score": 8, "replies": [{"body": "I'm a bear, but I won't troll you.\n\nInstead, I'll answer your question with a question.\n\nQuestion: Why do most companies release material information through approved channels (IR website, SEC website, etc.) and then host a conference call with analysts/media afterward, on a publicly accessible conference call?\n\nAnswer: Reg FD.\n\nNow, look, there is a Reg FD violation every single day, probably many times a day. I'm certain that small companies regularly cross boundaries because they barely have a compliance department. IR workers at large caps mess up and say things they shouldn't to people they shouldn't because people make mistakes.\n\nIt happens. It's like jaywalking. Jaywalking is illegal, but unless you really go out of your way to be annoying to a police officer, you aren't going to get in trouble for it. \n\nThe problem here is that Tesla is already under the SEC microscope. Musk has already gone on the biggest news program to basically say \"F the ~~police~~ SEC.\" He's already settled with the SEC for stock manipulation, and he's under their watch now.\n\nMatt Levine at [Bloomberg](https://www.bloomberg.com/opinion/articles/2019-02-20/elon-musk-can-t-help-himself) summed it up really well:\n\n>What on earth would you do here if you were the SEC, though? The SEC has a settlement with Tesla, approved by a federal judge, requiring the company to “implement mandatory procedures and controls to oversee all of Elon Musk’s communications regarding the Company made in any format … and to pre-approve any such written communications that contain, or reasonably could contain, information material to the Company or its shareholders.” \n\n>Tesla has made it absolutely clear that it never intends to comply with that settlement, that it will continue to allow Musk to make material public statements without any sort of controls whatsoever, and that no lawyer can ever tame him. **Don’t get me wrong, this is funny, and I enjoy it, but it is also a genuine problem for the SEC. It is hard to enforce securities laws against everyone else if you’re openly letting a high-profile CEO ignore them.**\n\nEmphasis mine.\n\nThe SEC doesn't want to ruin Musk. Everyone forgets that they could have done that when he backtracked on the first settlement offer they gave him. They didn't. They just upped the settlement amount, which, for a billionaire CEO who could have been barred from being an exec at any public company if the case went to court, is a relatively small difference. This may be controversial, but the SEC was actually pretty nice to Musk, all things considered.\n\nBut the SEC does want to be taken seriously, and to do that, it means aggressively enforcing the laws against the most high-profile lawbreakers.\n\nWas it a Reg FD violation? I am not qualified to say. But I do know that Reg FD is exactly why companies do not disclose material information in the way that Tesla just did. \n\n\n\n\n\n\n", "score": 8, "replies": []}, {"body": "This is actually a very complicated question and I seriously doubt anyone in here is qualified to answer it properly.\n\nThe long and short of it is that it very much depends on what was discussed, and whether the brief discussion of certain things was an \"accidental disclosure\" that they remedied.\n\nWhat I *can* say with some confidence is that it was stupid and unnecessarily antagonistic towards the SEC at a time when that's the last thing Musk needs to be doing.  They'll certainly at least look into it, and there was no reason at all for musk to encourage that now of all times.\n\nedit: According to transcriptions I've read, investor relations specifically asked people not to record or transcribe the the call with Elon present, and then Tesla Communications specifically told people after the call that no transcript or recording would be released.  I'm still leaving my answer at \"it's complicated\", but I'm leaning more towards \"they really fucked up here\" than I was before.  I was under the impression that this was a mistake, but it seems to have been deliberate and that does change things.", "score": 6, "replies": [{"body": "The decision not to make it public seems to be deliberate, but Elon talking about Q1 profitability was most likely a mistake or miscommunication. The whole thing being deliberate doesn't make much sense as it doesn't seem beneficial to them in any way.", "score": 3, "replies": [{"body": "> The whole thing being deliberate doesn't make much sense as it doesn't seem beneficial to them in any way.\n\nI meant \"deliberately not releasing a transcript\" (and therefore violating reg fd), not deliberately trying to deceive.  They intended to not make transcripts available, even after the mistake.  \n\nI completely agree that it's not beneficial to them.  It was an unforced error.  I had assumed that they had intended to make transcripts available and simply didn't, or simply hadn't considered the issue at all.  The fact that preventing the release of transcripts was deliberate policy is not a good look.", "score": 3, "replies": [{"body": "I don't know if we are talking past each other here but you make it sound like they made a deliberate violation by not releasing the transcript. However, not releasing it is not a violation on its own as they are allowed to have media-only calls or events.\n\nThere are certain kinds of information that they are not allowed to disclose in such a way and the only I've heard from that call is Elon's answer to the question about Q1 profit. They could have caught that and then release the transcript on their own afterwards, but not doing so seems nothing more than a simple mistake.", "score": 2, "replies": []}]}]}]}, {"body": "Shouldn’t be as bad as the fraud allegations last August over the take private. But it’s the culmination of the items that may make them take a harsher stance on him.", "score": 5, "replies": []}]}, {"body": "Barclays downgraded their price target to the lowest on wall street, I assume that's for the sudden drop.", "score": 9, "replies": [{"body": "It's the China news. Halted all sales of Model 3's until the labeling issue is addressed, probably a temporary setback but still a strong move by Chinese regulators and a sizable misstep from Tesla.", "score": 4, "replies": [{"body": "It's both.", "score": 1, "replies": []}]}]}, {"body": "Tesla dropping their price after competitors announce and price their tech is a bold move. Building an EV may have looked promising due to the huge price gap between Tesla and others, and now side by side a lot of the alternatives are priced pretty close to that of a Tesla.\n\nWhile it might cut down on margins I think it was a good call.", "score": 10, "replies": [{"body": "But they have the demand. Why drop the prices when there’s demand especially when the company needs cash. ", "score": -1, "replies": [{"body": "> But they have the demand\n\nDo they, though?  That's the million dollar question, and the market is not as convinced that they do as it was a few weeks ago.", "score": 12, "replies": [{"body": "EM said so. ", "score": -1, "replies": [{"body": "I thought he said he didn't know what the demand was.", "score": 2, "replies": [{"body": "\"There's demand, people just can't afford it\". Well Mr. Musk, I have demand for a private jet, I just can't afford it. ", "score": 6, "replies": []}]}, {"body": "EM has said positive things about demand, but he hasn't given concrete (and legally binding) numbers that truly support that yet.  \n\nSay what you want about Musk, but he's just not trustworthy when vaguely hyping something.  ", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "That’s true. ", "score": 1, "replies": []}]}, {"body": "Does he really have a choice? We're down 15% in less than a week on the mere suspicion that there might be a problem with demand, imagine the bloodbath that would ensure if he came out and said \"ugh yeah, we are seeing a definite demand problem for the 3 so we'll cut prices in an attempt to rectify the situation\".", "score": 0, "replies": [{"body": "Well then he’s lying? Which is even worse because that’s misleading the investors. ", "score": 4, "replies": [{"body": " What do you think he would be actually actually lying about if demand was lower than expected, though?  He's not given out any solid data that demonstrates current demand at all.\n\nIt's not illegal to hype something.  He says things like \"the demand for Model 3 is insanely high. The inhibitor is affordability.\"  That's a true statement, he's not lying or  (technically) misleading investors.  It's also utterly useless, because of course demand is insanely high if price isn't a concern.\n\nThey also talk about future estimates and guidance, which are opaquely determined and inherently tricky to get right.  They notably haven't given solid information on what's actually happened so far when it comes to demand.\n\nYou have to carefully parse Elon.  He's very smart and his public statements are not always meant to honestly inform.", "score": 1, "replies": [{"body": "It’s like saying demand for a Rolls-Royce or a Ferrari is insanely high if price isn’t a concern. \n\nThat statement is meaningless. \n\nLet’s agree to disagree on his smartness. Smartness involves having common sense. ", "score": 2, "replies": []}]}]}]}]}]}, {"body": "IMO they have demand in the form of reservations... nothing is stopping customers from seeing a \"better\" deal, cancelling the reservation and going elsewhere. Dropping the prices will make other options not so good.\n\nFrom an investor standpoint I don't like it, but the main reason I invested in Tesla is because they're doing good for the environment. ", "score": 2, "replies": [{"body": "You shouldn’t be investing in a company just because of environmental reasons. Start planting trees - that’ll be better use of your money than in Tesla. Tesla is not as green as everyone thinks. All the processes and batteries pollute, a lot. ", "score": 7, "replies": [{"body": "Environmental is part of the reason... Tesla has a lot of upside in their energy, FSD, and automotive sectors. ", "score": 3, "replies": [{"body": "I’ll disagree with you on all of them and let’s leave it there. Hope you don’t resent investing in the end. ", "score": -2, "replies": [{"body": "No one can see the future, and somebody will lose... time will tell.", "score": 3, "replies": []}]}]}]}]}]}]}, {"body": "I read some TSLAQ Twitter posts and I now understand bear mindset better.\n\nI thought that bulls are encouraging themselves all the time. But what is happening at TSLAQ is nuts - almost none counter arguments - everybody in the same camp. It could drastically change perception of involved people - they live in a bubble. Tesla is really in huge trouble there. \n\nBTW That's widely different from bull places - almost everywhere are bears and are spreading their thesis.\n\nI need some mental break after reading that TSLAQ because I got frightened. ", "score": 5, "replies": [{"body": "To be fair the comparison would be when TSLA hit 370 here.", "score": 6, "replies": []}, {"body": "I had a similar experience at realtesla recently. I went there to search for some facts and alternative viewpoints, the but hyperbole was rather toxic. There is definitely hyperbole on the bull side too, but often it's positive, lofty, and easily brushed off. I suppose the part that feels so horrible at realresla is the negativity. Such strong desire to see something fail.\n\nI was disappointed as I was hoping to find an additional source of news, but had to unsubscribe after reading too much pure doom sentiment. I suppose this happens if you are heavily financially vested in the demise of an entity.\n\n&#x200B;\n\nedit: word", "score": 4, "replies": [{"body": "So pretty far back, enoughmuskspam kinda invaded realtesla. It was featured on the side bar of enoughmuskspam for a long time. That lead the community to be a little more “toxic” as you might describe it.\n\nMost of the active users on realtesla are knowledgeable. But it has its spin, and embraces it. Some of the users there are great.", "score": 4, "replies": [{"body": "The knowledgeable part I believe. I actually went looking there bc of you, bot. I thought I would find more rational people like yourself posting and discussing their views, but the overall flavor there is aggressively bitter.", "score": 2, "replies": [{"body": "Even I tone it down here. I’ve said it here before, but it’s shitty to try and take victory laps on other people’s losses. Long or short.\n\nI have a belief about the stock, others may not share that. We should be able to discuss it without taking shots at each other.\n\nFor me it’s compounded by the fact that I believe Musk is not doing right by the shareholders and isn’t acting in their interest. So I have some sympathy on days like today. I am truly baffled as to why he continues to tweet out information.\n\n(Plus I took a beating on NIO today after hours, so thats a good reminder of how down days feel)", "score": 8, "replies": [{"body": "I agree with you on that. The majority of us have little to no ability to an affect stock prices. Seems odd when people attack or fight over differing opinions. Many of the arguments I've read seem to start with one side stating an opinion as fact, which triggers the other. Sad really.\n\nRecent events definitely support your belief about Musk and shareholders.\n\nSorry about your NIO play.", "score": 1, "replies": []}, {"body": "PS: I'd appreciate hearing your views on NIO. I made a thread so perhaps others can learn from it too [https://www.reddit.com/r/teslainvestorsclub/comments/axvbpf/what\\_can\\_we\\_learn\\_from\\_nio\\_earnings/](https://www.reddit.com/r/teslainvestorsclub/comments/axvbpf/what_can_we_learn_from_nio_earnings/)", "score": 1, "replies": []}]}, {"body": "> I thought I would find more rational people like yourself posting and discussing their views, but the overall flavor there is aggressively bitter.\n\nIt used to be excellent, now it's less so. You're right, people are bitter. And circlejerky. I think a part of that is that when it started it was more about the business and less about the stock, but after Funding Secured it's pretty much impossible to separate those two topics. And since a lot of people are trading it, it can get vicious. It seems even worse at places like the TMC investor forum, but it's too bad that it's like that regardless.\n\n(For what it's worth I've traded TSLA in the past, am bearish now, but haven't had a position one way or another in a long time. I follow the company almost obsessively though because it's at the intersection of like four different topics I'm interested in.)", "score": 1, "replies": [{"body": "What are the topics that you're interested in?", "score": 1, "replies": [{"body": "The automotive industry, technology generally, corporate governance, stock speculation, etc...\n\nTesla combines it all!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I think that’s a huge problem. People sit in their own bubble. It’s not just Tesla. Social media drives that, and even promotes it in the way, that’s how it’s analytics work.\n\nTwitter is one of the worst, because you only follow people not ideas. It means you only see one side of the story. You have to actively know to go seek out other sources and add them.\n\nIs issue that makes it worse with Tesla and TSLAQ is the doxxing. They have started banning people due to doxxing.", "score": 6, "replies": []}, {"body": "You've described twitter in general, though.  It's probably the least productive and most outrage prone social media outlet.  ", "score": 1, "replies": [{"body": "I got a lot of useful information from Twitter. It's really good if you want to be up-to-date on some topic.\n\nFB is only photos of friends and some mainstream buzz. ", "score": 2, "replies": []}]}]}, {"body": "Just hoping that the stock settles here at 270ish to make a comeback another day :)", "score": 3, "replies": []}, {"body": "It is interesting to read the Tesla Masterplan Part Deux, almost 3 years later: [https://www.tesla.com/en\\_EU/blog/master-plan-part-deux?redirect=no](https://www.tesla.com/en_EU/blog/master-plan-part-deux?redirect=no)\n\n&#x200B;\n\n* **Create stunning solar roofs with seamlessly integrated battery storage**: solar roof is as much vaporware as it was in 2016\n* **Expand the electric vehicle product line to address all major segments**: they are well on track to complete this goal with the Y, Truck and Semi coming out \n* **Develop a self-driving capability that is 10X safer than manual via massive fleet learning:** EAP is only marginally better than AP1, NoA is still very beta\n* **Enable your car to make money for you when you aren't using it:** after 3 years this seems to be as far away as ever \n\nIt shows that Tesla is ambitious but we need to take their predictions with a big grain of salt. I wonder how this will look one year from now, hopefully they will have made more progress on FSD and Solar.\n\nI also wonder how much of this is already priced into the current share price.", "score": 6, "replies": [{"body": "The things you say are as far away as ever, I'd say instead that they are 3 years closer to being reality than they were in 2016. \n\nHow much more time they will take, I don't know, but I also don't think people were expecting them to be fully realized by 2019.", "score": 8, "replies": [{"body": "Fair point. It is hard to tell what is going on behind the scenes, especially with Autopilot ", "score": 2, "replies": []}]}, {"body": "Wow I guess some people are never happy.  Their plans from three years ago look to be well on track to me.  Were there some wrong turns that have lost some time?  Yup.  Were it not for Tesla where would we be looking for a powerwall or a nice electric car or safer driving or self driving?", "score": 1, "replies": [{"body": "> Were it not for Tesla where would we be looking for a powerwall\n\nLG Chem?\n\n> or a nice electric car\n\nNissan?\n\n> or safer driving\n\nVolvo?\n\n> or self driving?\n\nWaymo?  \n\nTesla hasn't exactly been first in any of these things.  Maybe the nice electric car, as admittedly the early Leafs were pretty ugly.", "score": 8, "replies": [{"body": "Exactly, you make my points for me.  I'm not driving a Leaf and neither was anyone else.  Volvo knows how to make a safe car but can't take the next steps required because those aren't about engineering, they are about FSD technology.  Waymo doesn't sell cars.\n\nMy point is we'd be reading the news and wondering if anyone was ever going to put the things together required to really advance the ball.  We'd still be looking under the hood of our BMW and wondering why it's pretty much the same as it was 20 years ago.", "score": 7, "replies": [{"body": "> I'm not driving a Leaf and neither was anyone else.\n\nMore people are driving Leafs than Model 3s though.\n\n> Volvo knows how to make a safe car but can't take the next steps required because those aren't about engineering, they are about FSD technology.\n\nMeh, Volvo is well on its way to achieving their goal of zero fatalities by next year: https://money.cnn.com/2016/01/20/luxury/volvo-no-death-crash-cars-2020/\n\n> Waymo doesn't sell cars.\n\nNo, but they will license their technology to companies that do.  \n\n> My point is we'd be reading the news and wondering if anyone was ever going to put the things together required to really advance the ball.\n\nAnd my point is Nissan was building Leafs at volume before Tesla was building Model 3s, Volvo has been at the forefront of safety for decades, and Waymo was working on FSD since 2009.  Has Tesla pushed EVs forward?  Sure.  But lets not pretend they are the single force driving innovation in the automotive industry.", "score": 2, "replies": [{"body": ">More people are driving Leafs than Model 3s though.\n\nI think by this point the Model 3 should be quite close to the Leaf.\n\n[https://insideevs.com/top-5-electric-cars-cumulative-sales/](https://insideevs.com/top-5-electric-cars-cumulative-sales/)\n\nThat is from the start of December, we've had 3 months of extra sales of the Model 3, it's has (or is going to) catch the Leaf soon.", "score": 3, "replies": [{"body": "No way has the Model 3 caught the Leaf yet.  They were behind by 122k when that article came out.  Nissan is still selling Leafs too.", "score": 1, "replies": [{"body": "I don't know when, but the TM3 will catch the Leaf, it's not if, but when ... I'm too busy to calculate the when, so I'll just let it happen.", "score": 3, "replies": [{"body": "Sure, but as I said more people are currently driving Leafs than Model 3s.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": ">Develop a self-driving capability that is 10X safer than manual via massive fleet learning: \n\nA Tesla is probably the safest way of being on the road right now. \n\n\n>Enable your car to make money for you when you aren't using it\n\nI think Tesla might be the one with the most real miles with assisted driving, maybe waymo has more. Tesla will catch up fast with the volume of cars coming on the road. \n\nIt's not priced in yet, try adding uber/lyft and some other companies in the share price if it will truly work. ", "score": 2, "replies": [{"body": "> I think Tesla might be the one with the most real miles with assisted driving, maybe waymo has more. Tesla will catch up fast with the volume of cars coming on the road.\n\nAssisted driving won't allow your car to make you money when you aren't using it.  You need actual FSD for that.  Until we start seeing videos like this, the idea of renting out your Tesla when you are at work is just a distant dream: https://www.youtube.com/watch?v=6tiyZXKwdOA", "score": -1, "replies": [{"body": "Okay hands up everyone who bought either their Tesla or their TSLA stock in the hopes that they could run a mini taxi service someday.", "score": 1, "replies": [{"body": "Apparently Morgan Stanley's valuation of the company includes $17.7 billion for the Tesla Network: https://techcrunch.com/2018/09/04/morgan-stanley-teslas-autonomous-ride-sharing-network-is-worth-one-tenth-of-waymo/\n\nNot sure if Adam Jonas will be on here to raise his hand.", "score": 4, "replies": []}, {"body": "I don't think it was actually a driver of car purchasing, but it *was* a significant driver of the stock price for a while there.\n\nThat's why we're seeing the price come down - the share price of 380 didn't reflect a company that was very good at making electric cars.  It reflected a company that was on the cusp of transforming the nature of car ownership, the auto industry in general, power generation, and who knows what else.\n\nThat just isn't looking that likely anymore, at least not in the immediate future.  Just getting a brand new electric car company off the ground has proven hard enough.  And we're seeing the stock price reflect that.  A Tesla that just continues doing what it's done so far might still be a good company with good long term prospects, but it's not an 80 billion dollar company.", "score": 2, "replies": []}]}]}]}]}, {"body": "**How much does Tesla have in the bank?**\n\nhttps://ftalphaville.ft.com/2019/03/05/1551787633000/How-much-does-Tesla-have-in-the-bank-/\n\n\nNo pay wall:\nhttps://outline.com/XxYD5a", "score": 12, "replies": [{"body": "Downvoting this makes zero sense. It's a well-written article that has been thoroughly researched and avoids making blanket statements.\n\nIt's obvious that Tesla's Q4 cash number was window-dressed. They had somewhere between 1.5-2 billion actual cash, paid 920 million off, and now definitely have less than 1 billion remaining. That's why they rolled over the 180 million debt, that's why they're closing almost all of their stores (after opening many of them in December) and that's why they rushed the Model Y announcement which took the wind out of the Model 3 SR release. Oh, and that's why they're selling the SR at either no margin or a loss.\n\nDeepak has said in the past that Tesla needs a minimum of 1 billion on hand to function. They're almost certainly well below that right now.\n\nThe bear case has never been more likely. It's more likely than it was in Q2 2018, which Musk himself admitted was \"weeks away\" from bankruptcy. This is a subreddit for investing, and if you're holding Tesla stock I'd advise you to begin thinking as an investor, not a fan.", "score": 14, "replies": [{"body": "Was the Y introduction really rushed? Elon said a year ago it would be middle of March 2019, and now it's the middle of March 2019.", "score": 14, "replies": [{"body": "He initially said March 15. It'll be on March 14. If that's not rushed, I don't know what is.\n\n/s", "score": 11, "replies": [{"body": "You forgot to take Elon time into account", "score": 0, "replies": []}]}, {"body": "As the other person said, the way the Tweet was worded it did not seem like it was something well thought out as a date. As in there was nothing official. Now it could have been that he meant it but no one actually knows.\n\nNow that said, assuming there is strong demand for the Model 3, it would not make any sense at all to announce the Model Y so far out from production. The Model Y announcement would surely convert people who may have been looking to buy a Model 3 into buying a Model Y but now instead of $35k- $70K or whatever, they only get a $1k deposit for a car they won't be able to make for at least a year or so (unless they have a surprise announcement about a production line being ready to go but I doubt that).\n\nThem announcing the Model Y so soon might mean that they need a fast influx of a lot of cash and they are betting on getting 500k-1m deposits at $1k each.\n\nIt is unclear what is actually happening but the sudden rollout of the $35k Model 3 (with false delivery estimates on the site), the sudden closure of stores with little notice, and the sudden announcement of Model Y, seem like desperate moves. \n\nI am going to hold on to My shares right now because I still believe in the mission but I'd be damned if I was not slightly concerned.", "score": 1, "replies": []}, {"body": "Announcing it close to the date that Musk pulled out of his butt a year ago isn't an accomplishment. It's rushed because they cut all CapEx to the bone 2 quarters ago and factory/product development has been severely limited. That's why it's rushed; Tesla is nowhere near being ready for production.", "score": -7, "replies": [{"body": "Well, considering it shares 76% parts resemblance with Model 3 and the fact that they've started tooling on the remainder, I'd say that it's at least somewhere near being ready for production, which is a whole lot more than \"nowhere\" :)", "score": 6, "replies": []}]}]}, {"body": "You should apply the same caution as the authors of that article. As they explained, it's just one way of analyzing Tesla's cash situation with many potential sources of error.", "score": 12, "replies": [{"body": "Correct. Tesla's cash on hand is unequivocally less than reported, based on their actions and the growth-negative steps they have been forced to take. The specific number is difficult to pin down because Tesla is so opaque with their reporting, but the trend is clearly bearish.", "score": 3, "replies": [{"body": "Do you know they were forced to do it? I'm not sure. Maybe it's because they could. Any real information (vs. conjecture) very welcome (vs. not welcome).", "score": 2, "replies": []}]}]}, {"body": "[removed]", "score": 5, "replies": [{"body": "Removing - this comment is too vague and fear provoking.", "score": 1, "replies": []}]}, {"body": "It's complete rubbish. It's balancing blatant \"go straight to prison\" fraud from musk and a big chunk of his finance team against assumptions on how Tesla handles it's money as though they are equivalent in likelihood.", "score": 2, "replies": []}, {"body": "It’s the messenger not the message ", "score": 2, "replies": []}]}]}, {"body": "Man... looking at 3-day trend, it looks like mainstream has, like, no faith in the company. Jesus.", "score": 4, "replies": [{"body": "Actually 'mainstream' has quite a bit of faith. They are the ones buying. It is institutes that are selling.", "score": 2, "replies": []}, {"body": "It might be more accurate to say that the mainstream has *less* faith in the company than it did before the latest round of announcements.\n\nIt's still not getting killed.  Tesla's history is one of impressive volatility between ~270 and ~350.  We've seen this play out before, and I wouldn't be surprised if we're back to ~300 by the end of the week.  \n\nI just don't anticipate a major market correction outside of the historical range without firm numbers.  The Q1 earnings report might be a bloodbath, though.", "score": 2, "replies": [{"body": "Daily candle is starting to look extremely bullish what with a hammer forming on volume and bouncing hard off the 270 resistance.  Time to see what the last hour does.", "score": -2, "replies": [{"body": "Welp", "score": 1, "replies": []}]}]}, {"body": "Dude, \"Tesla news\" suffers from the same problem that this subreddit has. Most of the sources and writers are either paid or have an agenda. It's overwhelming the amount of repeat posters inundate this place with their viewpoint. 50% of the posts/comments center around a minority of just a few. Intellectual discussion is sacrificed for content, imo.", "score": 2, "replies": [{"body": "Then post the news, so we don’t have to.\n\nNo you just want to critique the active users.\n\nOnce you do post news, then people comment and you get drug in the middle of it.\n\nAgain with the paid shill comment I see snuck in.", "score": 1, "replies": []}]}]}, {"body": "Fidelity customers (retail) are buying the dip today!\n\nBuy orders: 3,210\n\nSell orders: 1,518", "score": 5, "replies": [{"body": "Wonder what institution is selling?", "score": 4, "replies": []}]}, {"body": "270 is probably a good time to buy although its always a little hard to catch a falling knife.", "score": 5, "replies": [{"body": "Im gonna buy more at 250.", "score": 2, "replies": [{"body": "That is an extremely unlikely probability.", "score": 2, "replies": []}]}, {"body": "great description. I sold half my stake at 310- am tempted to get back in for quick gain (need the cash for April/May) but damn it's just too frightening ", "score": 1, "replies": [{"body": "> need the cash for April/May\n\nPlaying the stock market with cash you need. Foolproof strategy, because what could go wrong...", "score": 6, "replies": [{"body": "It's literally free money", "score": 4, "replies": [{"body": "can't go tits up", "score": 3, "replies": []}]}, {"body": "lol well this is why I'm not doing it ", "score": 0, "replies": []}]}]}]}, {"body": "Technicals are just a tool and should never be trusted 100% or even close to it. That being said, I have found weekly trendlines to be incredibly powerful. We are touching a weekly trendline 6 years in the making right now. We've tested it 3 times before and bounced off it strongly each time. We've wicked under it plenty of times, but I find it highly unlikely that we will close on Friday below $270 FWIW.\n\nhttps://i.imgur.com/NLXXosX.jpg\n\nEdit: My interpretation is that if we close the week below $270, I will be worried. However, if we prove that the trend is still intact we will bounce HARD. Likely new all time highs in a matter of weeks. Just my opinion.", "score": 4, "replies": []}, {"body": "Things are not looking good for my March 15 $350 calls .. ", "score": 3, "replies": [{"body": "Better hope for one hell of a Model Y announcement.", "score": 4, "replies": []}, {"body": "Should've bought Puts instead. :P", "score": 3, "replies": []}]}, {"body": "All the bears are trying to make a case for TSLA’s downfall while so many good things are happening. It’s unbelievable.\n\nTSLA is setting up perfectly to be catapulted to 350.", "score": 6, "replies": [{"body": "I think you have to accept Tesla is behaving reactively right now.  They should not be advertising two week deliveries unless it is true.   And if it is true thats even worse.  I think Tesla will survive but it's naive to say it's all is unicorns and rainbows right now.", "score": 21, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "typo ;)", "score": 3, "replies": []}]}]}, {"body": "Can you provide reasoning on your belief?", "score": 2, "replies": [{"body": "New car = good\n\n35k M3 = good\n\nNew supercharger = good\n\nDebt paid cash = good\n\nChina factory = good\n\nSale model change = good", "score": 6, "replies": [{"body": "Some things are good for the consumer but not for the investor. \n\nA new car is exciting as a tesla fan - however its a gigantic money sink in a time when demand worries are in the minds of most investors.\n\nA 35k model 3 is good for the consumer, but  until we hear what sort of margins we're getting, we can only be cautious if Tesla are taking a loss/tiny profit on it.\n\nI'm bullish, but we're getting pretty close to my bailout price so i'm pretty concerned. ", "score": 7, "replies": []}, {"body": "First of all: I agree with you on your views. I personally think the markets have been overreacting a lot these last few days.\n\nHaving said that, I do see how it's possible to have a different view on those points. Allow me to play the devil's advocate with some counter arguments (some better than others):\n\nNew car = Are current cars not generating enough demand? Will the new car cannibalize on existing cars / potential near-term orders? Lots of capex involved.\n\n35K M3 = What's the margin? Are they selling at a loss? Is there no demand for the higher trim variants?\n\nNew supercharger = Expensive to roll out / upgrade old ones. Competitors are already at 350 kW.\n\nDebt paid cash = Less cash on hand, meaning we're closer to bankruptcy.\n\nChina factory = More debt. Is there demand in China with local competitors arising? The factory completion is far out and even then they'll need time to ramp up.\n\nSales model change = No demand confirmed by no need for stores. No stores means people won't be buying cars. Massive costs involved in laying off sales people and closing stores. This will be the third round of lay-offs in a short period of time.", "score": 4, "replies": []}, {"body": "I still fail to see how price haircuts are a good thing. It's a pretty clear sign that people weren't buying at a higher price. It's not good for margins.", "score": 3, "replies": [{"body": "Would be interested in real information about demand? Do you have any? \"It's pretty clear\" does not convince everyone.", "score": 2, "replies": [{"body": "Sure, Elon himself said that there is demand, but people can’t afford it. IE there isn’t demand at higher prices, so prices have been dropped to stimulate demand.", "score": 5, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Then why were the premium trim prices slashed as well", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "I doubt that someone waiting on a $35k model 3 would buy a Model S now that its 10k cheaper. ", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "last journey to 250-ish was reverted back to 350 in just three days\n\nsomething similar might happen again after mid-march, lets say on the news of donnie getting china deal signed, elon getting sec-2.0 situation resolved and leaked production/deliveries data for Q1\n\n&#x200B;\n\nP.S just watch for the moment when bearish fanfaronade reaches its peak, that will be the moment of reverse\n\n&#x200B;\n\n&#x200B;", "score": 0, "replies": []}]}]}, {"body": "Bought 10 more end of 2019 call options. Sigh, I'm supposed to play it safer from now on, but the sp at 274 was just too good an offer. Tesla double up round 2 here we go!", "score": 2, "replies": []}, {"body": "Wish I had some more capital, looks better than ever.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Strong support at 270", "score": 3, "replies": []}, {"body": "I really doubt it.  It will bounce around in an essentially irrational way between 250 and 300 without new news imo.  \n\nThere are a lot of ways to interpret the information we have right now, and until q1 earnings we won't have anything close to real answers.  Until then I think we're just looking at a *ton* of volatility and people getting burned trying to make cute plays.\n\nI don't think we'll see a true market correction to a lower range than the historical bounds unless the Q1 report has some scary stuff in it.", "score": 3, "replies": []}, {"body": "$259 I think is the resistance wall, haven’t checked in a while.", "score": 2, "replies": []}, {"body": "Lol what, it didn't even hit 244 with much more fud and with a year of increasing losses behind it. ", "score": 0, "replies": []}]}, {"body": "https://twitter.com/elonmusk/status/1103017584188780544?s=21\n\nOh damn he needs to stop tweeting. ", "score": 2, "replies": [{"body": "https://twitter.com/russ1mitchell/status/1103027977376296960?s=20\n\nLA Times confirming that this was 100% intentional. And 100% stupid. \n\nMusk is 100% screwed.", "score": 4, "replies": []}, {"body": "What is going on? Shorts are super active. \n\nOn Twitter there are so many new accounts which I have to mute to see any meaningful conversation.\n\nWhy so big involvement right now? Just before Model Y... and so many EV \"concepts\" from competition.", "score": 4, "replies": [{"body": "Shorts are winning right now, of course there are more of them. Just like you see more bulls when the stock is 350+", "score": 2, "replies": []}, {"body": "Tesla is mobilizing, they are pretty much getting ready to flood the Chinese and European markets within a few years. \n\nThey have dramatically changed their strategy. Shorts would like to think it’s a desperation move. I would rather put my faith in the smartest brain of the bunch, you know, that of the person that can actually think outside the box. Can you imagine how it is as a competitor when you have a competitor opening stores and they suddenly they go web only? While you have the press saying it’s a risky move you can be sure other car manufacturers are looking at this and wondering if they should also adapt to the evolving customer shopping practices.\n\nMusk just seems to be looking ahead on the longer term. In a society that is 100% connected, where automation exist everywhere, where FSD is becoming a reality, just Why would you need stupid stores that cost a fortune to keep running?", "score": 4, "replies": [{"body": "Or they are thinking \"good reminder why we use franchised dealerships.\"", "score": 4, "replies": [{"body": "They are selling all the cars they make, there is a waiting list, I have a friend that has been waiting for 2years. They don’t even need to advertise. Everyone thinking that Tesla has problems selling cars is kidding themselves.\n\nYes, this is a transition period, but really what is being put in place is going to accelerate market penetration.", "score": 0, "replies": [{"body": "Tesla thinks they have problem selling cars otherwise they wouldn’t have lowered price on *all their models*.\n\nThey had to lay off people and literally close shops to do that, so don’t tell me they dropped the price just to be charitable.", "score": 0, "replies": [{"body": "Dude they’ve been saying for years that their goal was to lower the price to 35k. Just last January they were criticized for not having a 35k option. Now with the removal of the tax credit it’s the best time to do it. It has absolutely nothing to do with demand.\n \nhttps://www.cnbc.com/2019/01/08/teslas-model-3-was-2018s-best-selling-luxury-car-in-us.html", "score": 2, "replies": [{"body": "How much can you miss the point by? Nobody was saying anything about the $35k car, it's the part that they dropped price on *every single trim* that's worrying. Why would they drop price on the Long Range, AWD and Performance versions if they have a wait list? Model S and Model X also saw dramatic price cut, up to 40% in some countries.\n\n>https://www.cnbc.com/2019/01/08/teslas-model-3-was-2018s-best-selling-luxury-car-in-us.html\n\nYeah, that's 2018, let's take a look at 2019 now shall we?\n\nhttps://insideevs.com/tesla-model-3-sales-u-s-january-2019/\n\nhttps://insideevs.com/february-2019-u-s-ev-sales-recap/\n\nYep, in December they sold 24000 Model 3, and in Jan they sold 6500, and Feb 5800, it's a complete collapse as far as month over month goes after the tax credit expired.\n\nAt its current rate Tesla will sell less Model 3s in the whole first quarter than the single month of December from last year.", "score": 3, "replies": [{"body": "You know someone is trying to deceive you when he's comparing 2019 **US** numbers (when most of the sales went overseas) with 2018 (US only) numbers.", "score": 1, "replies": [{"body": "2019 US numbers (when most of the sales went overseas) with 2018 (US only) numbers.\n\nThat doesn't matter, since it's the extra cars they couldn't sell anyway they shipped overseas, judging by the absolute lack of supply shortage in the U.S. They sold as many as they could in the U.S. The extra production capacity went overseas. \n\nIt's obvious that the demand for the U.S. market has slowed down drastically, now the question is whether the international demand can make up for it in the short term. Judging by the huge price cut suddenly, it seems like they were caught a bit off guard by the lack of demand internationally as well.", "score": 1, "replies": []}]}, {"body": "It's over 3 times the numbers of January 2018 year to year. Not sure what you are expecting. They are soon going to have double the production. \n\nAnyway it has little to do with demand. They shifted their focus to Europe in January.\n\nAs for profit margins yes sometimes it's a sacrifice companies must do. Removing the tax credit was retarded. Where I live there is a 8k tax credit for a Tesla.", "score": 1, "replies": [{"body": "> It's over 3 times the numbers of January 2018 year to year. \n\nNo kidding it's 3x January 2018, that's before they even ramped up production in any meaningful numbers. Did you also know it's infinite times the numbers of January 2017?\n\n>They are soon going to have double the production.\n\nWhat are you talking about? They are producing way more cars than they sell right now, that is a fact.\n\n>Anyway it has little to do with demand. They shifted their focus to Europe in January.\n\nNot true, you can order a LR Model 3 in the U.S. and get it delivered within 2 weeks, there is absolutely no supply constraint. European order numbers have also been very disappointing so far. \n\n>Anyway it has little to do with demand. \n\nLet's see the numbers when this quarter close, I'm betting on less than 35000 Model 3 *total* for the whole quarter worldwide vs. 60k+ of Q4 2018.", "score": 2, "replies": []}, {"body": "> As for profit margins yes sometimes it's a sacrifice companies must do. \n\nThis is an _investing_ sub. You used the word _sacrifice_. Here's the thing: investors don't like when companies sacrifice things like margins.\n\nYou seem to have a one-track mind. I caution you that investing emotionally is a bad idea. I've been messing with the stock market for decades and still fall into that trap, too. It's hard.", "score": 1, "replies": []}]}]}, {"body": "Musk normally would have carefully crafted a beautiful, public unveiling of the $35k car. A conference call with a grouchy Musk (\"not talking about that stuff <margins>, next question\") in which attendees were asked not to record or provide a transcript is the opposite of that.\n\nRegarding the article you posted, the market is forward looking. Great job by Tesla selling so many cars in 2018 but there's a reason every auto manufacturer has insane capital expenditures to constantly be building the next new thing.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Overreaction much?", "score": 1, "replies": [{"body": "https://www.investopedia.com/terms/r/regulationfd.asp", "score": 2, "replies": [{"body": "\"Non-intentional sharing of such information must be promptly followed with public disclosures.\"\n\nMinor slip about a topic they did not mean to discuss in that call. I'd say it was an unintentional disclosure and they are now (as per Elon's tweet) following it up with a public disclosure after the mistake was brought to their attention.", "score": 3, "replies": [{"body": "Not sure that’s good enough when he is already in trouble.\n\nThat tweet certainly isn’t going to help things. \n\nWe’re gonna see article about this tonight.", "score": 2, "replies": [{"body": "I will not surprised if we see more people overreacting to it in a similar manner.", "score": 1, "replies": [{"body": "Like the SEC?", "score": 3, "replies": [{"body": "That would be surprising.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "That would be boring. ", "score": 1, "replies": []}]}, {"body": "This is an example of a company I would like Tesla to merge with (or buy)\n\n[http://kohilowind.com/kohilo-wind-vortex-tech/](http://kohilowind.com/kohilo-wind-vortex-tech/)\n\nSimilar to Maxwell. but on a much smaller scale, the company has interesting tech.\n\nWhere I see a big opportunity for Tesla is in domestic scale wind generation to complement Solar + batteries.\n\nWhat is needed is a system that looks aesthetically pleasing, but is also robust and efficient.\n\nIn summary the Maxwell merger was a good idea, they should look for similar opportunities, other companies with unique technologies.", "score": 1, "replies": []}, {"body": "295 at end of day.", "score": 1, "replies": [{"body": "just checked the stock ... we are going to need a big swing to get to 295 ...", "score": 6, "replies": [{"body": "New prediction: 250 at end of day.", "score": 0, "replies": [{"body": "Ha, back to to almost 280...\n\nPlease send me your daily predictions so i can options trade them! ", "score": 3, "replies": []}]}]}, {"body": "Bold call.  Looks pretty flat in pre-market at the moment.", "score": 1, "replies": [{"body": "I'm interested if the high volume keeps up. It sounds like people are starting to doubt the stock, perhaps short interested has greatly increased? Maybe as the volume decreases to regular levels we'll see it start to go up again.", "score": 1, "replies": [{"body": "Over 2 million shares traded in 10 minutes so far today....", "score": 2, "replies": [{"body": "At the average trading day volume in just an hour. I guess funds are cutting their losses or people back on the short train?", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": ">\tQuestion - if share price drops to 200, would it easier or harder for Tesla to go private?\n\nAll other things equal, it would be easier, because it would be cheaper to buy out shareholders.\n\nRealistically it would probably be more difficult because whatever factor prompted the share price collapse (declining margins, who knows) would scare off potential buyers.", "score": 3, "replies": []}, {"body": "Easier since it would cost much less to purchase the company. ", "score": 3, "replies": [{"body": "This isn't necessarily true.  It certainly would cost less, but shareholders have to agree to the final price.", "score": 2, "replies": [{"body": "You don't think shareholders would agree to a lower price if the stock was $75 lower than it is today?  ", "score": 3, "replies": []}]}]}, {"body": "Easier -- more potential buyers and less of the value is speculative.", "score": 4, "replies": []}, {"body": "If the stock drops that much, it’s a real concern if Musk will get margin called. That would be a huge setback for an attempt to go private.", "score": 4, "replies": [{"body": ">  If the stock drops that much, it’s a real concern if Musk will get margin called.\n\nThe mythologies that get stuck into people's heads when they read too much TSLAQ is funny.", "score": 2, "replies": [{"body": "https://www.forbes.com/sites/jimcollins/2018/05/18/musk-has-heavily-leveraged-his-holdings-of-tesla-while-teslas-financial-leverage-has-jumped/#11779f8f7099\n\nSay what you want, it’s a real concern if the stock drops too much. Is it at $200, maybe not it could be lower. But that’s in the ball park.", "score": 6, "replies": [{"body": "It's completely irrelevant.", "score": -1, "replies": [{"body": "Then why does the company put it as a risk factor in their filings with the SEC?  ", "score": 9, "replies": []}, {"body": "At this price yes, at the price he asked about no.", "score": 3, "replies": [{"body": "\"Hey boss, I was just checking our high networth individuals, based on our calculations we should margin call Elon Musk.\"\n\n\"Elon Musk? How much is he leveraged compared to his networth?\"\n\n\"Umm, about 200 million of 20 billion, so 1%?\"\n\n\"And you want to margin call him?\"\n\n\"I guess so?\"\n\n\"...\"", "score": -2, "replies": [{"body": "You joke but this literally happens. See Mike Pearson and Aubrey McClendon. \n\nBesides which, margin loans are regulated and you’re going to run into FINRA problems if you don’t enforce your margin requirements.", "score": 7, "replies": [{"body": "The point is so what if it happens, it would just be a funny anecdote Musk tells Larry Page. Not the game ending disaster which TSLAQ makes it out to be.", "score": 1, "replies": [{"body": "It wouldn't be the end of the world, but it would be a problem and there's no sense trying to pretend otherwise.\n\nWhat I'd be worried about if we were near the relevant share price is not so much the margin call itself, but what a desperate Musk might do to try to avoid a margin call.", "score": 4, "replies": []}]}]}, {"body": "If the stock goes to $200 Musk isn't worth $20 billion anymore.  Which is exactly why the margin call exists.", "score": 8, "replies": [{"body": "He'd be worth $17B - $24B depending on SpaceX valuation.", "score": 3, "replies": [{"body": "Then he can put his SpaceX equity up as collateral.", "score": 1, "replies": []}]}, {"body": "If the stock goes to 200 then he would be worth like 17 billion.  ", "score": 2, "replies": []}, {"body": "Oh no, he's leveraged 0.01333 instead of 0.01 now, the horror! He better start applying for food stamps.", "score": 1, "replies": [{"body": "It is enough of an issue that the company includes a risk factor about it in their filings with the SEC.  I'm sure you know better than Tesla and the company's providing Musk with the financing though....", "score": 10, "replies": []}]}]}]}]}]}]}, {"body": "> The mythologies that get stuck into people's heads when they read too much TSLAQ is funny.\n\nYeah, fucking idiots reading the company's 10-K: \n\n> __Elon Musk has pledged shares of our common stock to secure certain bank borrowings. If Mr. Musk were forced to sell these shares pursuant to a margin call that he could not avoid or satisfy, such sales could cause our stock price to decline.__\n\n> Certain banking institutions have made extensions of credit to Elon Musk, our Chief Executive Officer, a portion of which was used to purchase shares of common stock in certain of our public offerings and private placements at the same prices offered to third party participants in such offerings and placements. We are not a party to these loans, which are partially secured by pledges of a portion of the Tesla common stock currently owned by Mr. Musk. If the price of our common stock were to decline substantially and Mr. Musk were unable to avoid or satisfy a margin call with respect to his pledged shares, Mr. Musk may be forced by one or more of the banking institutions to sell shares of Tesla common stock in order to remain within the margin limitations imposed under the terms of his loans. Any such sales could cause the price of our common stock to decline further.", "score": 6, "replies": [{"body": "this is a good point so i'm keeping it.", "score": 6, "replies": [{"body": "But also keeping the post above me that does nothing but insult someone for actually reading the companies SEC filings?  I thought we were going to start moderating the content on here that is just baseless insults?", "score": 1, "replies": []}]}, {"body": "Items like this are a great example of cognitive dissonance. There is mental discomfort when holding pieces of contradictory information, so the mind tries to resolve it by discarding plain facts like you posted.", "score": 3, "replies": []}, {"body": "Feel free to believe that this has anything to do with the value of the stock in actual practice or the likelihood of a buyout. You believe all kinds of dumb shit depending on the thread.", "score": -2, "replies": [{"body": "Thanks for adding to the discussion!", "score": 1, "replies": []}]}]}]}]}, {"body": "If it drops to 200 now, Elon most likely gets margin called.", "score": 4, "replies": []}, {"body": "Answer: Neither.\n\nBasically all large automakers are public. Being public is almost a necessity because access to debt/equity capital at a low cost is critical to the business. \n\nTesla is unlikely to go private at any price because it would put them at a competitive disadvantage in sourcing capital. \n\n", "score": 1, "replies": [{"body": "Couldn't the same be said of Dell?  They had no trouble raising a colossal amount of debt in connection with that take-private. ", "score": 2, "replies": [{"body": "I'm talking about debt to finance operations, not financial leverage. \n\nDell is a pretty capital light business. It only had $2.1 billion in PP&E prior to going private. \n\nTesla has $11.3 billion in PP&E excluding the solar business. That number will only go up over time, and Tesla will want to finance that as inexpensively as possible, which means accessing the public debt markets as a public company with public company reporting.\n\nLeasing, if it ever gets around to that, will also necessitate being public to get inexpensive borrowings to fund it.", "score": 1, "replies": [{"body": "I think the point is the same even if you are talking about financing to fund working capital though.  Companies like Bechtel, Koch Industries, etc. are pretty capital intensive and I doubt they are paying a premium for their revolvers.", "score": 1, "replies": []}]}]}]}]}]}
{"title": "Tesla Model 3 custom suspension to be resolved soon", "selftext": "", "id": "axngni", "created_utc": 1551805598.0, "score": 143, "upvote_ratio": 0.92, "num_comments": 93, "comments": [{"body": "woah bro didn’t know you could read spanish", "score": 295, "replies": [{"body": "I’m Chinese and I read wallstreetbets only because the sub is the funniest of all Reddit. Happy to finally post something haha.", "score": 141, "replies": [{"body": "Why is the PRC pushing really hard to electrify the vehicle market? \n\nIf a fraction of a percent of the Chinese buy a Tesla over the next decade, it's going to make the American market look like a drop in the bucket.  Then Musk's allegiance will be financially turned against America and for China, as capitalism demands.\n\nShould we be concerned about China trying to steal our man away by harnessing his agnostic allegiances and dime store ideologies on climate change?", "score": 22, "replies": [{"body": "My guess is China now heavily relies on oil importation since we don’t have much oil reserve. And we want to change this situation so that we can be more economically independent from oil producing countries. Don’t worry about Elon. His ultimate dream is SpaceX. He’s all yours.", "score": 37, "replies": [{"body": "Good answer.  When the American and Chinese Astronauts land on Mars, and the ramp comes to rest on the Martian soil, and the entire world is watching, how do we decide who gets to step down first and narrate the video feed?  ", "score": 12, "replies": [{"body": "Haha, guess SpaceX will be arriving there earlier. Actually I think American people have been misguided by Trump about the competition. The majority of Chinese people and Chinese companies are still struggling to increase life standards. It’s really sad that Trump set China as a competitor to fuel nationalism in US. Chinese people are not that retarded to spend time competing with US and it’s absurdly apparent that US is advanced in every way by decades. We actually think it’s funny that US people do believe that Huawei has the kind of technology to use a rice-kernel size device for “spying”. If we have that technology, why would we import almost all chips from US? Sigh.", "score": 30, "replies": [{"body": "Exactly what a Chinese mole would tell us!! ", "score": 31, "replies": []}, {"body": "> We actually think it’s funny that US people do believe that Huawei has the kind of technology to use a rice-kernel size device for “spying”.\n\nYou don't have to be a security expert to to design hardware capable of spying. In fact, the opposite is sometimes true. If your software or hardware happens to have a bug, and that bug happens to be a security vulnerability, then all Huawei has to do is not patch the bug, and boom they have hardware capable of spying, even though they didn't directly design it that way. Then when the bug gets discovered, they play dumb acting like they didn't know about it and patch it immediately, while moving on to abusing the next bug. Preventing huawei from spying with their hardware is as possible as writing 100% perfect, bug-free software.", "score": 9, "replies": [{"body": "Got what you mean. But Bloomberg did report that China used a tiny “device” implanted in electronic products for receiving and sending information back to China, and even provided a picture of it. The device looked exactly like a tiny plastic part used broadly in electric products and is sold for 20 cents only. Anyone that know how many chips China imports every year would know how absurd it is to assume China is capable of producing such technology. I’m sure Trump knows it, as he’s negotiation with China includes some trillion-dollar worth chip deal. We can’t help but think of the time when Bush held a bag of white powders and claimed it was the mass destructive weapon owned by Iraq. Anyway, I don’t mean to argue anything here as I believe everybody has one’s own rational judgement. Just want to say there doesn’t need to be so much “competition” air :P", "score": 4, "replies": [{"body": "\"If your opponent is of choleric temper, seek to irritate him. Pretend to be weak, that he may grow arrogant. \" 1:22 Art of War, Sun Tzu ", "score": 5, "replies": [{"body": "Haha nice. You studied this better than 99% Chinese people. Believe it or not, what I said is real. No need to lie during random chat on reddit. ", "score": 5, "replies": []}]}]}]}, {"body": "This almost sounds like I could be friends with China, but according to Trump they are stealing from us! SAD!", "score": 5, "replies": [{"body": "You believe a Chinese commentor on reddit?", "score": -3, "replies": [{"body": "The question is why you immediately choose not to believe me? I can understand you though as I know it’s the information you receive every day. hope one day you can visit China and see for yourself whether it is a monstrous country and people that you heard of : )", "score": 9, "replies": [{"body": "Why don’t you answer my comment with the questions?", "score": -4, "replies": [{"body": "????", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Just push over the dude in front of you and dive o to that sweet sweet red soil", "score": 3, "replies": []}]}, {"body": "so NIO is what youre saying", "score": 5, "replies": [{"body": "NIO is a shit car. Haha. Road test shows its actual range is 180 km in winter. All the NIO stock is purchased by foreigners as in China NIO has become some kind of joke. I wish you could read the road test stories posted by NIO owners. They are so funny. There are much better EVs than NIO in China, like BYD which Buffett has invested in. ", "score": 28, "replies": [{"body": "> Road test shows its actual range is 180 km in winter.\n\nThe NIO rumors show it to be a substandard car but vastly lower range in the winter, is unfortunately, a reality for all electric vehicles.", "score": 5, "replies": [{"body": "You are right, but NIO is more severe than other EVs though. An easy way to look at it is that comparing with a Tesla, the NIO car is heavier but has less battery. Of course also because there’s engineering difference on battery management. ", "score": 4, "replies": [{"body": "Good Thing i sold with 30% Profits xD", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "> because they don’t have access to the exhaust heat an engine produce\n\nthat isn't how heaters work in normal cars\n\nit's the temperature effect on batteries", "score": 6, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "just making sure - and the heater in a tesla is actually fairly efficient all things considered, the drain on range is again mostly due to the cold's effect on batteries", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "uh, what? this isn't even close to correct\n\nICE cars use heat from the engine coolant to produce heat for the cabin, so in that sense yes they're turning what would otherwise be waste into comfort\n\nbut in EV you're taking stored battery power and running it through a resistor + blower setup, which is nowhere near 100% efficient", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "i'm talking about how much potential energy is lost in converting stored electrical energy to heat and also using efficiency colloquially to reference how using battery power for heat makes the car less efficient in terms of eMPG", "score": 1, "replies": [{"body": "All electric heaters are effectively 100% efficient. It could be argued that ICE heat, because its a neccessary by product of operating the engine, is a 100% efficient cabin heat as well.", "score": 1, "replies": []}]}]}]}, {"body": "Heat pumps have >100% efficiency. Waste heat from the motors is free heat. 100% efficiency is the worst possible efficiency in this context.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "lol well shit. didn't know that bit. puts on NIO then. ", "score": 2, "replies": [{"body": "Hope you have done so. It’s down 18% after hour haha", "score": 3, "replies": []}]}, {"body": "could you link a few of those reviews?", "score": 1, "replies": [{"body": "[This one is most popular.](https://www.igeewa.com/chanye/2018/25584.html)  But the author holds negative attitude to all EVs, so he might have exaggerated a bit. ", "score": 4, "replies": [{"body": "LOL this shit is hilarious...  Here's hoping NIO stays above 9 by Friday so I don't get assigned, lol", "score": 1, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "You have to be a special kind of autist to think Chinese people don’t know about democracy or pollution.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Right, and you do have good coal reserves to generate electricity.  ", "score": 1, "replies": [{"body": "Water power actually. Coal reserve is also small.", "score": 3, "replies": []}]}, {"body": "I thought it was Caz the air in China cause more cancer than /rh", "score": 1, "replies": [{"body": "One of the small reasons maybe, as the air pollution has the most to do with the coal-burning heating system during winter. It’s getting better the past couple of years as the country is shifting to natural gas fast. Maybe in 5- 10 years the air quality will be just fine as most places in the world. ", "score": 3, "replies": []}]}]}, {"body": "Probably because of the smog( https://en.m.wikipedia.org/wiki/Pollution_in_China)", "score": 2, "replies": []}, {"body": "The wealthy will buy Teslas, and there is a sizable number there in Tier-1 coastal cities.  But vast majority will buy cheaper domestic EVs.  Let's not forget that the definition of \"middle-class\" is different in China.  They earn a fraction of what American middle-class takes home.", "score": 1, "replies": []}]}, {"body": "Isn't Reddit blocked by the Fire Wall? \n\nI'm telling Xi.", "score": 7, "replies": []}, {"body": "Señor Chang? ", "score": 2, "replies": []}, {"body": "Dude, that literally reads: “I can eat my own dick or make Tesla calls and get ass raped” ", "score": 1, "replies": []}, {"body": "Heres the obligatory copy pasta for chinese users. 动态网自由门 天安門 天安门 法輪功 李洪志 Free Tibet 六四天安門事件 The Tiananmen Square protests of 1989 天安門大屠殺 The Tiananmen Square Massacre 反右派鬥爭 The Anti-Rightist Struggle 大躍進政策 The Great Leap Forward 文化大革命 The Great Proletarian Cultural Revolution 人權 Human Rights 民運 Democratization 自由 Freedom 獨立 Independence 多黨制 Multi-party system 台灣 臺灣 Taiwan Formosa 中華民國 Republic of China 西藏 土伯特 唐古特 Tibet 達賴喇嘛 Dalai Lama 法輪功 Falun Dafa 新疆維吾爾自治區 The Xinjiang Uyghur Autonomous Region 諾貝爾和平獎 Nobel Peace Prize 劉暁波 Liu Xiaobo 民主 言論 思想 反共 反革命 抗議 運動 騷亂 暴亂 騷擾 擾亂 抗暴 平反 維權 示威游行 李洪志 法輪大法 大法弟子 強制斷種 強制堕胎 民族淨化 人體實驗 肅清 胡耀邦 趙紫陽 魏京生 王丹 還政於民 和平演變 激流中國 北京之春 大紀元時報 九評論共産黨 獨裁 專制 壓制 統一 監視 鎮壓 迫害 侵略 掠奪 破壞 拷問 屠殺 活摘器官 誘拐 買賣人口 遊進 走私 毒品 賣淫 春畫 賭博 六合彩 天安門 天安门 法輪功 李洪志 Winnie the Pooh 劉曉波动态网自由门", "score": 0, "replies": []}]}, {"body": "Custom suspension Model 3? \n\nCould I get 4-engine AWD, 33” BFG All-Terrain K02’s, 16” ground clearance, 20” long travel, and have it ride like it’s on titties please?", "score": 1, "replies": [{"body": "Thats call the new offroad ariel atom. Look it up", "score": 1, "replies": []}]}, {"body": "It’s actually Portuguese ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 183, "replies": [{"body": "Still more DD than we usually do. Long TSLA", "score": 57, "replies": []}, {"body": "180KW is the spiciness of the kung pow chicken ", "score": 10, "replies": []}, {"body": "*Hi human!* It's your **3rd Cakeday** chandlervincent! ^(hug)", "score": 1, "replies": []}]}, {"body": "Good thing you underlined that. Otherwise I would've been completely lost....", "score": 64, "replies": []}, {"body": "I’m the OP. The photo is the official custom advice on why model 3s are suspended. I know you can’t read Chinese so here is the fact: some US staff of Tesla made careless mistakes on the custom sheets and missed several Chinese- language labels which the custom requires. Now China has agreed solutions that allow Tesla to correct the mistakes without shipping the cars back. Hopefully it’ll resolve soon. [here’s Reuter’s news](https://www.reuters.com/article/us-china-tesla-response-idUSKCN1QM1WY) \n\nA key mistake is that 177 AWD model 3s were labeled as performance versions. This time it has nothing to do with the trade war, but only Tesla’s own staff to blame. ", "score": 63, "replies": [{"body": "OP, seriously appreciate this, as well as your take on BYD vs NIO. If you have any more DD I'm all for it.", "score": 23, "replies": [{"body": "Thanks. But I’m no expert of EVs. Just read some reviews while waiting for a Shanghai-made Tesla Model 3. The current common opinion i heard is that most local new EV manufacturers will face serious challenge when Tesla factory starts producing Model 3s, especially since Tesla recently cut prices in China, which means local manufacturers will lose the price advantage while they don’t have other advantages. I’m not sure if China will launch any policy then, as it’ll be pretty unbelievable that China just watches local manufacturers die.", "score": 10, "replies": [{"body": "Ah gotcha. Well, very appreciative of the information. I agree it would be strange for China to let their local manufacturers die off.\n\nDo you know anything about BYD and how their cars are selling? A friend of mine has a fairly large position in BYD and I'm curious to know more from someone who actually knows how to read Chinese :D", "score": 4, "replies": [{"body": "Oh there are so many BYD in China (maybe like 1 every 25 cars?), partly because in some large cities, to get a license plate for a gas car one needs to attend a lottery draw or be on the waiting list, but one can get EV license plate immediately or at least much easier. BYD cars (used to) have rather ugly designs, cheap price, various models, and pretty solid ranges (not as good as Tesla though). it seems they hired the designer from Mercedes (or some other famous brand), and the design of the newest models look OK to me. I’m pretty sure that they’ll be the No. 1 competitor of Tesla in China for model 3s, as all new manufacturers currently start with relatively luxury models (like Tesla did in early days), and BYD already have mature models in similar price range with Model 3. The advantage of model 3 is still the much prettier looks and Tesla the (used to be a luxury) brand. While the advantage of BYD is the relatively bigger size than model 3 (like small SUV which many Chinese families like).", "score": 7, "replies": [{"body": "Solid. Thank you very much for this info!", "score": 5, "replies": []}]}]}]}]}, {"body": "Awesome, thanks for explanation!", "score": 5, "replies": []}]}, {"body": "better luck next time SEC lurkers ", "score": 17, "replies": []}, {"body": "The red lines really helped me here", "score": 13, "replies": []}, {"body": "I read the title and thought it meant something about problems with the suspension systems that the actual vehicles were using.\n\nI am not a smart man.\n\n^^^^^^^^^^^^^^^(Does&nbsp;that&nbsp;mean&nbsp;I&nbsp;fit&nbsp;in&nbsp;here?)", "score": 12, "replies": [{"body": "Sorry for my Chinese English haha", "score": 8, "replies": []}]}, {"body": "All I understood was WARNING", "score": 8, "replies": [{"body": "It says the warning sign on the brake fluid container should have a Chinese label but doesn’t, which should be quite easy to fix though. ", "score": 12, "replies": []}]}, {"body": "this feels illegal", "score": 5, "replies": [{"body": "The pic has been circulated by Chinese model 3 buyers on social media for a while. I don’t see a “classified” mark on it though.", "score": 9, "replies": [{"body": "joking", "score": 3, "replies": []}]}]}, {"body": "Great flair.", "score": 3, "replies": []}, {"body": "The Chinese flair is a good touch", "score": 3, "replies": [{"body": "The mod adds that haha", "score": 5, "replies": []}]}, {"body": "I cannot speak French", "score": 3, "replies": []}, {"body": "Can someone translate these moonrunes? ", "score": 4, "replies": []}, {"body": "Can I still get arrested if I read the above, but didn't understand a goddamn thing?", "score": 2, "replies": []}, {"body": "Quality DD.", "score": 3, "replies": []}, {"body": "Amazing DD, thanks", "score": 4, "replies": []}, {"body": "let me translate that for you bicc boi: \n\nConfucious say, 6400 SAT score (4X1600) will make you successful and you will one day be able to buy a Model 3. But you need to study hard and get your medical license or WARNING you will be frying kung pao shrimp 177 years at the local E3DP5 Chinese restaurant. If you go this way you will have no monies and will have to run in a human hamster wheel to generate either 202kW or 180kW to fuel your rent.  \n\nTrust me, this is exactly what it says.  ", "score": 3, "replies": [{"body": "Lol", "score": 3, "replies": []}]}, {"body": "End of second line says \"4 dumplings for 16.00\" don't order at this restaurant it's a scan. ", "score": 2, "replies": []}, {"body": "I came here for the comments.", "score": 2, "replies": []}, {"body": "I lived there for a year, and cant even use chopsticks! Fuck reading ", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Bought dip @ 275ish, it literally cant go tits up", "score": 1, "replies": []}, {"body": "Fuck dips. Bought the NIO ‘dip’ and it dipped more. ", "score": 1, "replies": []}]}, {"body": " Why did you underline the tattoo pictures?", "score": 1, "replies": []}, {"body": "Elon musk just wants to land on Mars and have a slow ramp just like from rick And morty. ", "score": 1, "replies": []}, {"body": "I'll take an order of general tso's, 2 crab rangoon and a side of honey mussy", "score": 0, "replies": []}, {"body": "Sorry I don't speak Communism", "score": 0, "replies": []}, {"body": "Yosogadesu!", "score": 0, "replies": []}, {"body": "...this is a cookbook though", "score": 0, "replies": []}, {"body": "As a tesla call holder, I \n\n\n\n\n\n\n\n\n\n \n\n\n\n\nread all your posts in a Chinese accent. I’m sorry", "score": 0, "replies": []}]}
