{"title": "My Coinbase analysis", "selftext": "# Should I Buy Coinbase Highlights\n\nCoinbase was one of the most highly anticipated IPO’s on the NASDAQ in 2021. The company has over $180billion of assets on the platform and over 68 million users worldwide.\n\n**About**\n\nCoinbase is one of the go-to platforms for people wanting to invest in crypto the easy way. Coinbase was one of the first platforms to make cryptocurrencies easy for people to buy and sell.\n\nThe previous method prior to Coinbase involved terminal commands and remembering lengthy codes. A slide from one of the companies pitch decks illustrates this perfectly.\n\n**Coinbase Stock Price**\n\nCoinbase is listed on the NASDAQ under the ticker symbol COIN (COIN:NASDAQ) and currently trades on a market capitalisation of US$51.26 billion with a stock price of $243.\n\n**Coinbase IPO Price**\n\n* **What was the Coinbase IPO Price?** Coinbase completed its direct listing on the NASDAQ with a reference price of $250 when it IPO’d back in April 2021.\n* **What date did coinbase IPO?** Coinbase IPO’d on April 14 opening at $381 before briefly topping $400. \n\n**Coinbase Latest Financial Report**\n\nThe group in the quarter generated over $2.0 billion in net revenue, including $1.9 billion in transaction revenue and over $100million in subscription and services-based revenue. Net income for the quarter was $1.6 billion and Adjusted EBITDA was $1.1 billion.\n\n>**As volatility and crypto asset prices are highly correlated with trading**  \n**revenue, the crypto market environment heavily influenced our Q2 financial results.**  \n*Coinbase Q2 FY21 Report*\n\nThe above quote from the group seems to indicate that a period of volatility also means that trading volumes will be higher, it is assumed that the group means both highs and lows in the underlying crypto’s encourage users to trade more often.\n\nIn the groups, 2Q21 report to the market Coinbase points out that As of March 31, 2021, Assets on Platform totalled $223 billion, representing 11.3% of the total market capitalization of crypto assets.\n\nAs the industry develops over time, we expect this to increase as Institutional companies will start committing more of their funds into crypto. We are only really at the tip of the iceberg when it comes to institutional participation in crypto.  \n\n**Coinbase Income Statement 2Q21**\n\nCoinbase has increased its key metrics from revenue, gross profit and net income across the board since releasing its first set of quarterly results in June 2020.\n\nThe AGR on Coinbase Income is over 4000% since their first set of quarterlies, whilst we can’t see this continuing we see no reason why income cannot grow at large double-digit multiples until at least 2023.\n\n**Is Coinbase Reliant on Bitcoin?**\n\nIn group financial reports the dependence on trading volume in relation to Bitcoin has decreased over time with trading volume in other crypto-assets now higher than Bitcoin. Interestingly Ethereum Trading volumes as of 2Q21 have now also outstripped BTC, this is potentially due to the higher volatility of the crypto.\n\n**Coinbase Fundamentals**\n\n* **PE ratio (TTM):** 17.91\n* **Price to Book (PB):** 13.80\n* **Price to Sales:** 10.4x\n* **PEG Ratio:** 0.99x\n* **EPS (TTM):** 13.58\n\nThe company has a PE ratio of 17.91x and a price to sales ratio of 10.4x. The PE ratio of 17.91 sits below the average NASDAQ PE Ratio which is currently around 28x, the group P/S ratio, however, sits above the NASDAQ Average of \\~5x\n\n**Peer Comparison**\n\nSquare and PayPal currently trade on P/E ratio’s of 249x and 67x respectively. COIN stock for comparison is trading on a P/E of 17.91x. Coinbase Stock is also trading at a similar P/S ratio, however, generating significantly more EPS than SQ or PYPL.\n\n**Coinbase Stock Competitors**\n\nCoinbase has a number of competitors internationally:\n\n* Binance\n* Robinhood\n* Blockchain\n* Bitrex\n* Bitfinex\n\nCoinbase has no publicly listed competitors in which to compare their valuations other than Robinhood (however these companies are also generating revenues in significantly different ways).\n\nInterestingly enough, although Binance is not a publically listed company we can obtain data through the companies ‘burning’ of their BNB token.\n\nOutlined in the original Binance Coin whitepaper, the company pledged to burn BNB tokens equal to 20% of its quarterly profits. With BNB tokens valued at $390 million burned this quarter, Binance should have made close to $2 billion in profit since April.\n\nWe see an advantage in COIN Stock being the only publicly listed company on the list with a focus directly on crypto. Our reasoning for this is around institutional and high net wealth individuals and the perception of trust in the company.\n\nWe see as more and more institutions look to invest in the crypto-economy they will seek stability and trust in whom they are conducting business with, as COIN Stock is publicly listed we believe this creates a higher perception of trust.\n\n**Should I Buy Coin Stock – Key Business Risks**\n\n1. Coinbase may not be able to trade every asset on our centralized exchange for regulatory reasons\n2. Erosion of the companies transaction revenue due to increased competition\n3. Declining interest in crypto-economy, however the reverse is also COIN Stocks key upsides.\n4. Hacking of the system\n\n**Key Upside Opportunities**\n\n* Increased growth of the crypto-economy as a whole (think of Google in the 2000’s, as the internet grew, so did google)\n* Subscription based revenues to continue growing at large rates\n* Release of NFT platform on Coinbase (Potentially buying OpenSea)\n* International Expansion into Japan and Germany (Flagged in Q2FY21)\n* Increased traction of Coinbase USDC (StableCoin)\n\n**Ownership Structure**\n\nCoinbase stock is owned predominantly by the General public at 40.9% with individual insiders and institutions taking up the next largest slices of the structure at 23.6% and 22.5% respectively.\n\nCEO of Coinbase Brian Armstrong is the largest individual holder in COIN stock with 17.12% of the float. Co-Founder Fredrick Ehrsam also continues to hold large portions of Stock. Other notable holders include **ARK Invest** and the VC firm Andreessen Horowitz.\n\n**Summary**\n\nThe only real negative we hear around the investment community is the risk of new participants into the space, however, we believe Coinbase is potentially 5-years ahead of any competition based on the below:\n\n1. Coinbase Cloud, allowing devs and users to intergrate and develop platform ontop of COIN’s ecosystem and hooking directly into the platforms API’s\n2. The trust of Institutions in Coinbase, as more and more institutions seek exposure to crypto assets, they will typically rely on the most trusted solution.\n3. As the only publicaly listed crypto company of this nature we believe institutions will be attracted to the perceived ‘security’ of COIN Stock over other competitors\n\nCoinbase Stock has continued to generate significant growth in revenues and earnings over the past 8 quarters, with a significant turning point in the last year. We believe Coinbase Stock will continue to surprise the upside and see the potential for significant growth from institutional demand in the crypto-economy in the near term.\n\nCOIN Stock has spent over 7 years developing systems and overcoming challenges that the company now plans to commercialize through the use of the Coinbase Cloud Platform. We see this move as the Amazon of the crypto world and will provide the tools required for other companies to build products on top of.\n\n&#x200B;\n\nLet me know your thoughts and if ive missed soemthing", "id": "pqyjww", "created_utc": 1632014267.0, "score": 56, "upvote_ratio": 0.76, "num_comments": 104, "comments": [{"body": "I just don’t see how coinbase stock could be a better investment than just buying bitcoin itself. That’s my dilemma at least. Every time I consider buying COIN I talk myself into using that money to buy bitcoin lol", "score": 87, "replies": [{"body": "Since COIN allows users to trade in many cryptos, and collects a fee per transaction, the company makes money as long as crypto-trading is a thing, even if Bitcoin tanks or doesn’t have much volume. Also they are getting into crypto loans now, if the regulators allow it. It’s a more diverse investment than Bitcoin alone. Will it reach dramatic highs and lows as Bitcoin does? Probably not. But that makes it a more attractive investment for those with a lower risk appetite.", "score": 53, "replies": [{"body": "I’ve yet to see coinbase stock rise on a day btc is in the red. Seems at least for now, they move in tandem, only btc more dramatically", "score": 32, "replies": [{"body": ">  Seems at least for now, they move in tandem, only btc more dramatically\n\nI think this is what makes $COIN a great opportunity. The market seems to have tied it to BTC price, but mostly on the downside. They're still a market leader with great financials, and I think they're heavily downplaying their Q3/Q4 results. They had a record Q2 even while most cryptos saw a decline of 40-50%. Since then the crypto market cap has at least doubled..", "score": 24, "replies": [{"body": "100%", "score": 8, "replies": []}]}, {"body": "Noted.", "score": 8, "replies": []}, {"body": ">\tI’ve yet to see coinbase stock rise on a day btc is in the red.\n\nLook at the June chart comparison", "score": 2, "replies": []}]}, {"body": "While they may make money on trading, even if cryptos are tanking, you can bet the market will sell COIN stock whenever cryptos start to lose value.", "score": 5, "replies": [{"body": "If", "score": -1, "replies": [{"body": "When not if. All markets go through bull and bear cycles", "score": 1, "replies": []}]}]}, {"body": "This is the exact reason people don't use Coinbase. Why pay a fee to trade crypto when you don't have to. There are plenty of unlisted companies that let you buy and trade crypto with no fees. Only newbs to crypto use a centralized financial institution to trade crypto. The whole point of crypto is to be decentralized.", "score": -2, "replies": [{"body": "The only platform I'm aware of that doesn't have a trading fee is Robinhood, but you can't transfer your crypto off that platform. Even decentralized exchanges have fees. Which platforms are you talking about exactly?", "score": 9, "replies": [{"body": "Not saying others don't charge fees, but there are lots options to obtain crypto that aren't centralized and tracked, like direct purchase of crypto via crypto ATMs, vendors, and person to person trades. Just adding to the DD that Coinbase has a lot competitors that the general public isn't aware of yet because it's so new. The big players aren't necessarily going to choose Coinbase as their broker for crypto.", "score": -1, "replies": []}, {"body": "also wootrade has 0 fees.", "score": 1, "replies": []}]}, {"body": "They're the RobinHood of crypto. Simple UI attracting the masses. They have the absolutely highest spreads and fees on the market, they disabled buying BCH back in 2017 to force the price down just like RH with the meme stocks early this year. They blocked buy this year too when BTC had a massive dip preventing people from capitalizing on the dip with \"technical errors\" as the excuse, just an extremely convenient timing for the glitch. It's a cancer tumor on the crypto market.", "score": 6, "replies": []}, {"body": "> There are plenty of unlisted companies that let you buy and trade crypto with no fees. \n\nLike what? \n\nEvery exchange that isn't a scam charges fees. How in the world do you think the company is able to operate?", "score": 2, "replies": []}, {"body": "Fees are much lower on Coinbase Pro", "score": 2, "replies": []}, {"body": "How many of those companies use ACH so they don’t have ridiculous wire fees? An easy to use mobile app? Don’t require an intermediary to convert from fiat to a shared cryptocurrency so that one can trade?", "score": 1, "replies": []}, {"body": "But that’s it. The “noobs” you so politely refer to are the average investor. Coinbase represents an easy access point into crypto for the general public.", "score": 1, "replies": []}]}]}, {"body": "Agree but I think it’s less riskier. Also their market is different than just Bitcoin which is a more diverse with other crypto to make it safer. I’m definitely long on coin base and 240 for it is a bargain", "score": 10, "replies": [{"body": "Funny I was spending my weekend doing research on COIN as I want to start my position next week", "score": 1, "replies": []}]}, {"body": "The people who made money consistently during the gold rush were not the people rushing for gold. It was the people selling the equipment.\n\nBetting on companies that benefit from a rush is way more stable an investment than trying to strike gold yourself", "score": 7, "replies": []}, {"body": "Because you are making the same mistake as most others, you think all Clinbase is is a crypto exchange and all it has to offer is Joe and Jill trading bitcoin back and fourth to each other. Do a deep dive into Coinbase cloud and then tell me how you think.", "score": 3, "replies": [{"body": "90% of their revenue is from trading", "score": 3, "replies": [{"body": "Thats because Coinbase cloud is early days, they're still building out the infrastructure. You have 2 choices in my opinion. \n\n1. Invest early while everybody thinks Coinbase is just an exchange and will only make money from fees on Joe and Jill trading between each other.\n\n2. Invest after Coinbase has developed their cloud infrastructure and Joe and Jill trading crypto between each other makes up a tiny fraction of their revenue, by which point the price will likely be significantly highly.\n\nI might be biased because I'm invested but for me it's as clear as day what Coinbase is trying to achieve with Coinbase cloud.\n\nInvest now at $50b market cap or in 10 years at $500b market cap its your choice. Of course there's risk Coinbase flops and doesn't succeed but this is a risk with most new companies.", "score": 6, "replies": [{"body": "ELI5 what Coinbase cloud will allow its customers to do?", "score": 2, "replies": [{"body": "Any company that either wants to use blockchain services (like payments, loans, credit cards, smart contracts, staking) etc can use Coinbases API suite for seamless integration. Or if they want to build their own crypto services they can use Coinbases API suite and get instant access to Coinbases enterprise solutions and customers.\n\nThink how hard it was in 2000 to get a high traffic website up and running. You needed databases, servers, hosting, you had to manage security and updates and permissions and configure all the shit yourself, and most of this was done with code. Then came AWS which revolutionised the process.\n\nDo you have any idea how difficult it is to launch your own blockchain solution / service? I'm not talking about a shitty token on èthereùm, I'm talking about a full scale network or service? It's so much work... Coinbase will allow large businesses to deploy their product with minimal knowledge of blockchain tech using Coinbase cloud in a very simple fashion.\n\nI highly recommend reading the documentation https://www.coinbase.com/cloud", "score": 11, "replies": [{"body": "Thanks for the response. I’m a programmer and am yet to look into it, but was curious as to your thoughts. Much appreciated.", "score": 1, "replies": []}]}]}]}, {"body": "90% of Amazon's revenue used to come from online book sales, what is it now?", "score": 3, "replies": []}]}, {"body": "Coinbase is just an exchange. You can trade one crypto for another or against real money.\n\nThere is nothing else!", "score": -1, "replies": [{"body": "And Google is just a search engine, Facebook is just a social media site, Amazon is just an online retailer.\n\nCoinbase cloud, which is in very early stages is setting itself up to be the AWS of crypto. Yes its early days but their API suite and enterprise solutions will allow everyday companies to easily give their customers access to crypto services without having to create all the infrastructure themselves.\n\nWhy do you think companies all around the world use Azure or AWS or Visa or Google instead of creating their own? It's because it's way more convenient to ise existing solutions. \n\nThe reality is IF crypto succeeds, which is looking more and more likely, Coinbase will be a behemoth retail investors will look back in a decade and slap themselves for not realising the potential, in the same way people slap themselves for not investing in Apple or Google back in 2010.", "score": 10, "replies": []}]}]}, {"body": "I might be off base here but owning 100 shares of COIN and selling covered calls could maybe be more profitable, depending on BTC price of course.", "score": 2, "replies": []}, {"body": "The fact that Bitcoin has no real use would just have COIN beating it right away", "score": 1, "replies": []}]}, {"body": "Robinhood shouldn’t be considered a real competitor because you can’t “withdraw” your crypto from Robinhood. \n\nAlso if you’re researching these companies. Look into the fees they collect from “staking”. Coinbase charges the highest in fees and has a huge user base.", "score": 17, "replies": [{"body": "> Robinhood shouldn’t be considered a real competitor because you can’t “withdraw” your crypto from Robinhood.\n\nSame thing with Paypal right?", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "Government just signed a contract with them. Their second", "score": 3, "replies": [{"body": "I believe the govt became a customer with coinbase to use their on chain analytics software IIRC. That deal was unrelated to the issue surrounding the lending project which is still an ongoing situation. The US govt is a large entity, I think it was either DHS or ICE that wanted the analytics software and it is the SEC that is angry about the lending product, not a lot of correlation between those groups.", "score": 1, "replies": []}]}]}, {"body": "“Coinbase has a number of competitors internationally:\n\n• Coinbase”\n\nI stopped reading, lol\n\nEdit: long Coinbase anyway", "score": 22, "replies": [{"body": "Lmao", "score": 5, "replies": [{"body": "In all honesty competitors you missed quote a few key ones with bitfinex and bittrex being quite small compared to exchanges like crypto.com, kucoin and okex\n\nThe latter two you can also work out their revenue roughly as they have similar tokens to binance (kucoins for example actually gives 50% of revenue to its holders)\n\nThis is my concern point which is from an actual exchange volume coinbase isn't even in the three biggest exchanges list and every month it drops further", "score": 5, "replies": []}]}]}, {"body": "[deleted]", "score": 19, "replies": [{"body": "Agreed but they recently said they were committed to hiring 3000 dedicated customer support staff.", "score": 3, "replies": []}, {"body": "People said the same thing about Robinhood and here we are…", "score": 6, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "I think you are underestimating how valuable UX is to the marketplace.", "score": 4, "replies": []}, {"body": "You are exactly right and yet they are still the go to option for a lot of people. Even experienced people. Going back to your previous comment, a lot of people thought that Robinhood will not be able to keep up once every other firms adopted commission free trades but they have even though their customer service sucks. I see something very similar with COIN here.", "score": 0, "replies": []}]}]}, {"body": "Binance is already superior in every possible way.", "score": 1, "replies": [{"body": "Yeah, find me a single US / European institution that will trust CZ with their clients money in an unregulated company registered in the Cayman Islands...\n\nYeah, ain't gunna happen. In fact Binance in my opinion is far more likely to LOSE market dominance to Coinbase because as crypto develops and retail traders account for less and less of the volume, Binance will lose more and more market share to Coinbase.", "score": 9, "replies": []}]}, {"body": ">Once someone pulls together a better option\n\nAlready plenty of better options, but I'm assuming you mean until one goes public. I've used Coinbase, Gemini, Kraken, Binance, Crypto.com, the whole lot of the big exchanges available in the USA.\n\nKraken has, by far, best-in-class support service. You can get on live chat support with an actual human who knows WTF they are doing, and I've never had to wait more than 2-3 minutes; usually they respond within 30 seconds.\n\nCoinbase support is utter ass, Gemini is only marginally better. If a financial services company doesn't offer either insta-chat or phone support, it's whack.", "score": 1, "replies": []}]}, {"body": "With all the \"hackings\" and similar companies owners vanished with all the crypto (thodex In turkey, ceo \"goes missing\" with 2 billion worth of customers funds) and similar shady stories I think buying the coin directly would be much safer.\ngl nonetheless", "score": 4, "replies": [{"body": "If you are interested in those stories you should check out the podcast ‘exit scam’ - it was a pretty good listen.", "score": 2, "replies": []}]}, {"body": "I bought COIN near their 52 week low back in May and have been watching them since. While they are related to BITC, they do go up on BITC down days and go down on BITC up days. I'm a believer in them and think in the long term this play will pay out, but it has been a wild ride. I'm holding until they are above 300, then setting a trailing stop loss.", "score": 5, "replies": []}, {"body": "One thing you’ve missed is that insiders have been selling shares like crazy. Andressen horowitz and the co founder has been selling a lot.\n\nI do think Coinbase is a solid long term hold, the big challenge is they need to diverse from having all their revenue from Bitcoin trading", "score": 7, "replies": [{"body": "I agree but I pretty much forgive insider selling for the first 1-2 yrs post IPO, definitely in the first year. After that it's not a great sign though.", "score": 3, "replies": []}, {"body": "They're trying to launch their lend product. That could be another nice income stream if it's approval. Might be a hard battle though.", "score": 2, "replies": []}, {"body": "Yeah I did notice a lot of selling", "score": 1, "replies": []}]}, {"body": "If I believed in crypto like bitcoin or ethereum, I would just buy the tokens themselves, instead of seeking an indirect relationship from Coinbase.  The biggest issue with Coinbase is that their commission/transactions are so high.  That is not sustainable as other crypto brokers have lower, more competitive rates.  Due to competition, Coinbase is going to have to lower their fees and that's going to be a real blow to their current profit margin.", "score": 3, "replies": []}, {"body": "Would you mind posting this to /r/coinbaseshareholders?", "score": 5, "replies": [{"body": "Thx", "score": 2, "replies": []}]}, {"body": "$COIN to the moon! It’s been a great investment for me but I waited to get it below $240 and then averaged down and bought more.", "score": 6, "replies": [{"body": "I bought on Day 2 and am still down, but it’s okay. I’m long. I think I’ll get more.", "score": 4, "replies": [{"body": "You’ll be fine, I would average down on the days bitcoin is down though.", "score": 3, "replies": []}, {"body": "I'm 32% down. $363 average", "score": 2, "replies": [{"body": "$500 stock in 1 year.", "score": 2, "replies": [{"body": "Hope so!", "score": 2, "replies": []}]}]}]}]}, {"body": "I own it. I use it. I like it. I will buy more. Great analysis!", "score": 8, "replies": [{"body": "Thxx", "score": 1, "replies": []}, {"body": "Same", "score": 0, "replies": []}]}, {"body": "https://cryptopotato.com/coinbase-secures-another-millionaire-deal-with-the-us-government-to-use-its-blockchain-analytics-software/", "score": 2, "replies": []}, {"body": "Wait... What was the question?", "score": 2, "replies": []}, {"body": "Based on their financials, growth, and profits, it's under valued. If it wasn't crypto people would've piled on. I think people are afraid of the increased competition which will reduce their profits, but maybe the bigger worry is that crypto will crash and take Coinbase with it.", "score": 2, "replies": []}, {"body": "It cant be compared to paypal. As you know paypal uses FIAT CURRENCY, not a digital currency that 0.001% people actually use to buy stuff. Coinbase valuation should be 1/10th of the size of paypal.", "score": 2, "replies": []}, {"body": "I've owned this stock for brief periods of time and follow it almost every day, just to check in on it, and see what's happening with it. The one thing that I've noticed, is that the stock can trade in a pretty wild range compared to similarly priced stocks (not market cap but just share price). The daily spread of the stock is quite large, and therefore, it's actually a somewhat decent daytrading opportunity. It also tends to gap up or down every single morning to some degree. Jumping into COIN a few minutes before close can be nicely profitable, because you can often get a gap up the next morning, of course, it can easily swing the other way as well.\n\nOne strategy I was thinking of employing with COIN because of it's continued volatility, is to basically merge both a daytrading and longterm investing strategy with the stock. Combining daytrading, swing trading as well as long term holding. How does this work? Well, basically you daytrade or swing trade as you normally would, but you simply don't worry about taking any losses.\n\nWhy?\n\nBecause you convert to a longterm investor if you're down in the stock. Now...   Certainly you'd only want to do this type of thing, if you're really willing to \"ride or die\" with Coinbase long term. So, if you feel like you'd be perfectly fine owning Coinbase stock for the next 5 years, why not take full and total advantage of all the daily and weekly volatility? You can buy and sell, over and over again. Will the stock ever drop dramatically hurting you in the process? Yes. So...  if you don't like seeing paper losses piling up, then maybe this isn't the stock for you.\n\nHowever, my counter is that the stock dropping in price isn't actually the most dangerous thing that could happen. The 52 week low is $208. If it drops anywhere near that, it's a tremendous buying opportunity, so in my opinion, harsh drops should be welcomed as accumulation opportunities, or a chance to lower cost basis. Or both.\n\nThe real danger, is that you happen to jump out of the stock, and the moment you jump out, it goes on a tremendous explosive run, and you feel like you just can't get back into the stock. Then, it moves into an entirely new trading range, never to see the 220's, 230's, and 240's ever again. Maybe never seeing the 250's ever again.\n\nThat's really the biggest danger that you might have to deal with if you try to play Coinbase in this manner.", "score": 5, "replies": [{"body": "assuming cryptos don't get regulated or fail, all stock have a chance of falling\n\nor as another said, you're assuming no competitors rise up either", "score": 1, "replies": []}, {"body": "What about selling covered calls on COIN?   Premiums are insane", "score": 0, "replies": []}]}, {"body": "Retail investors, and even some professional investors, are vastly under estimating the potential of Coinbase Cloud. They are setting themselves up to be the AWS / Google etc of the crypto ecosystem.\n\nCoinbase will be SO much more than a crypto exchange in the coming years and people made the mistake thinking Amazon was just a book store and Google just a search engine will likely make the same mistake with Coinbase.\n\nIf they execute things in the right way and I believe they will with a CEO like Armstrong at the helm, Coinbase could easily be a trillion dollar company in 10 or 15 years.", "score": 4, "replies": [{"body": "Trillion? That would mean that they would have to grow ~35% every year for 10 years straight. \n\nApple, Amazon, Google and Microsoft have had CAGR < 28% for ten years. Trillion is way too big to achieve in 10-15 years.", "score": 3, "replies": [{"body": "2000% returns is a lot and highly ambitious I agree but if the crypto ecosystem takes off like I'm thinking it will and Coinbase is the go to platform every western business uses I can totally see Coinbase skyrocketing in share price.\n\nCoinbase is already stupidly under valued (because its being held back by bitcoin uncertainty. I genuinely believe Coinbase is a legit once in a generation stock. It will join the ranks of the mega cap tech stocks faster than I think most people anticipate.", "score": 3, "replies": [{"body": "Possible, but not at 35% CAGR rate.", "score": 1, "replies": []}]}]}]}, {"body": "bullish on $COIN. They keep adding new services which adds new lines of revenue. Believe it or not, they just sold their in-house software to the US govt. Maybe they will be a software play as well? \n\nI think they need to work on upgrading their servers and investing in Customer support. If they can work that out, I have no doubt this could be one of the largest financial institutions in the world", "score": 4, "replies": [{"body": "What in-house software did they sell to the USG?", "score": 1, "replies": [{"body": "https://cryptopotato.com/coinbase-secures-another-millionaire-deal-with-the-us-government-to-use-its-blockchain-analytics-software/", "score": 2, "replies": []}, {"body": "it’s some blockchain tracking software. Don’t know the full details", "score": 1, "replies": []}]}]}, {"body": "The problem is will crypto trading fee becoming free like robinhood, then how coinbase continue to grow.", "score": 3, "replies": [{"body": "How’s robin hood continue to make money. When you control as large a % of the market as COIN you can continue to make money one way or another", "score": -9, "replies": [{"body": "Lol what?", "score": 6, "replies": []}]}]}, {"body": "They’re shady crooks", "score": 2, "replies": []}, {"body": "Coinbase probably has many unlisted competitors for cryptocurrency trading, like bitmart. Coinbase kind of centralizes cryptocurrency, so this may turn away crypto investors that want to hold on to a physical and private crypto wallet. \n\nThe software that Coinbase is licensing is an interesting revenue stream that adds value.", "score": 2, "replies": [{"body": "You can use a hardware wallet with assets purchased on Coinbase", "score": 1, "replies": []}]}, {"body": "One thing nobody has mentioned yet is that it is only a matter of time before there is more regulations on the crypto markets. When that happens the players that can provide crypto services AND play by the rules stand to make big money. IMHO Coinbase is likely to be one of those players.", "score": 1, "replies": []}, {"body": "Anything to get this stock back to $400 I’m all for.  Bought 70 shares at $410 and still holding because i fucked myself with GME and AMC by selling when it dropped 75%.", "score": 1, "replies": [{"body": "Patience. Time is your friend.", "score": 5, "replies": []}, {"body": "Smh come on man. Gotta do better than that.", "score": 1, "replies": []}, {"body": "Me 40 at average $363\n\nMy 1st batch was at $393. There must be thousands like us waiting patiently.", "score": 1, "replies": []}]}, {"body": "Service and security suck. My account got hacked for $1000 and CB refuses to accept fault!\n\nwasn’t accessed from any ofmydevices which are known to CB, now 3 months later still can’t access my account for other $2500. They won’t cash out my $2550 and I will not chance another security breach.  Had to sign onto the class action suit and file a case with the FBI.", "score": -2, "replies": [{"body": "You really think someone would hack coinbase to steal only $1000 from just you? It would be a 99.99% chance you didn’t have the right security set up or had your password stolen", "score": 23, "replies": [{"body": "This", "score": 7, "replies": []}]}]}, {"body": "Bitcoin with $50 transaction fees has no utility at all. So if you think coinbase is reliant on that one crypto then its a bad investment.\n\nAlternatives cryptos (Cheap transaction fees / Scale on chain for the entire world) could overtake Bitcoin, make coinbase viable, but they have so much more upside it is just worth just buying them outright.", "score": -2, "replies": []}, {"body": "Snake oil seller. I wouldn't touch.", "score": 0, "replies": []}, {"body": "How many COIN investors were actually into crypto currency back in 2017 and remained in crypto THROUGH the 2018, 2019, and most-of-2020 bear markets?\n\nCrypto has followed a general 4-year bull to bear market cycle. Most of these COIN investors have no idea what they're in for during the 2-year crypto winter.", "score": 1, "replies": []}, {"body": "Coming from someone who’s invested in COIN at 299 and waiting until it reaches that height again, no don’t do it. Unless it starts clearly taking off I wouldn’t recommend. Found out the hard way it’s inflated right now. Give it time", "score": 1, "replies": []}]}
{"title": "How would you manage 500k USD?", "selftext": "Imagine you get 500k USD. Assume it's all your net worth and you don't  have other assets like property, just a job with a monthly income of $  3,500 after taxes. How would you use that capital with a 10-year horizon  with the idea of ​​preserving and increasing it? I was thinking using  the Warren buffet strategy as the market is so expensive: 40% cash and  60% stocks. I would have 200k in the bank and invest 300k in an etf like  VOO or VTI. The 300k invested in a single lump sum. If there is a crash  I would have money available ready to continue making DCA plus more  income from work. I would continue renting since I am not interested in  buying properties as prices are through the roof. What would you do differently?", "id": "pr7a8d", "created_utc": 1632055600.0, "score": 1162, "upvote_ratio": 0.92, "num_comments": 761, "comments": [{"body": "I wouldn’t hold more than 6 months of monthly expenses in cash. The rest, I would spread over the safest, most fucking boring ass ETFs I could, some well-established stocks, a few index funds, and me? I’d “gamble” with maybe 5% on good potential up-and-coming companies in industries that show a strong promise of growth and expansion.\n\nYou have to have an emergency fund. There’s simply no telling what can happen day to day, and risking your livelihood just isn’t an option nowadays. I just got hit by a car 6 weeks ago and am unable to work. Luckily, I had an emergency fund to cover my bills or I would be colossally FUCKED.  $15-20k in cash is not going to make you rich invested over decades. Why risk it? It’s worth more if it’s kept close to insulate you in case of unforeseen circumstances. It simply doesn’t make sense not to. \n\nFidelity, Vanguard, & TD all offer their own (as well as assess to) any and all small return/low risk ishares type shit to park good money in. They’re a great option to have as far as “safe” plays that will mostly keep pace with the markets and still not over leverage you as far as risk. \n\nThe well-established individual stocks will always be a good play so long as you don’t get caught up in every little detail of day-to-day pricing. Anything in the top 20 of the S&P will keep you right on pace with the greater economy, and give you some security and reassurance that you’re getting the most out of your money. \n\nThe “gambling” is what will keep you interested, educated, and give you potentially the most bang for your buck. I’m not talking about YOLO’s into some Foreign penny stock. I’m talking about common-sense plays that’s anyone who doesn’t have their head in the sand. Electric cars. 3D printing. Green Energy. Shit like that. These are budding industries that are obviously going to grow and expand over the next decade. Which companies will rise to the top? Who the fuck knows, but it’s sure as the weather that there’s a garage out there with the next Jobs, Bezos, or Musk out there right now. Why not try to catch it, and learn a little in the process?", "score": 1286, "replies": [{"body": "Lol at boring-ass ETFs. Not wrong.", "score": 313, "replies": [{"body": "It’s embarrassingly true.", "score": 72, "replies": []}, {"body": "I love me a good boring ass ETF that I know will get me a return", "score": 52, "replies": [{"body": "Like what?", "score": 1, "replies": [{"body": "I like my QQQJ", "score": 3, "replies": []}, {"body": "VTI, or VOO. Can't really go wrong with either of the Vanguard ETF's", "score": 1, "replies": []}]}, {"body": "What kind of return should one expect on a \"boring ass\" ETF ? 4-5% ?", "score": 1, "replies": [{"body": "S&p historical average is 10%", "score": 1, "replies": []}]}]}, {"body": "$IDNA", "score": 2, "replies": []}, {"body": "If you’re invested in SPY and there’s an event like Black Monday 1987 you loose more than a fifth of your investment in a day and 1/3 of it within two months. If you want to sort of preserve your money buy government bonds or invest in a assets that have physical value.", "score": 0, "replies": [{"body": "Yeah, but he’s parking this money. He doesn’t need it and he ain’t using it. If you stayed in on Black Monday, you’d be doing really, really fucking awesome right now.", "score": 10, "replies": [{"body": "You’re right. But everyone is dreaming about “what if I saved my money in cash and invested at the bottom of Black Monday.”  \n\nWhen in reality they would miss out on timing the bottom and likely be too scared to buy in anyway.", "score": 7, "replies": [{"body": "“Buy the dip” with your gambling account. \n\nLeave everything else alone.", "score": 5, "replies": []}]}]}]}]}, {"body": "After being unemployed for 12+ months, having an emergency fund is imperative.", "score": 73, "replies": [{"body": "After being unemployed for 12 months I discovered I needed far less of an emergency fun than I thought", "score": 49, "replies": [{"body": "good for you, that means your living costs are low. I myself feel I could (live) very cheaply, though it is good to have some excess in case of emergencies like a roof leak or a surprise hospital bill, one time high expenses", "score": 24, "replies": [{"body": "Very true. Whenever life’s going good, you can expect something to go wrong in your car", "score": 2, "replies": []}, {"body": "\n>I could love very cheaply\n\nThis is true. Those gold-lined condoms are a rip-off.", "score": 1, "replies": []}]}, {"body": "Do you own the place where you live", "score": 3, "replies": []}, {"body": "If that’s the case, add up all that you did need, add 20% to it, and that’s the new emergency fund amount.", "score": 2, "replies": []}, {"body": "What about Heath insurance", "score": 2, "replies": [{"body": "Gubment", "score": 2, "replies": []}]}, {"body": "That's me, only thing is that I lived very frugally, my expenses can waver a lot, if I end up deciding to do lifestyle upgrades, like traveling more. Pandemic was different, since we saved a particular amount, since everything was closed, so most of us barely did much for several months anyway.", "score": 1, "replies": []}]}, {"body": "Did you apply for disability, sorry to ask I am in the same situation.", "score": 1, "replies": [{"body": "No, just Obama Care and medicaid.", "score": 1, "replies": []}]}]}, {"body": "That was a nice read. Thanks", "score": 80, "replies": []}, {"body": "One other thing I would add; with that sort of money, I would try to DCA into positions. Dumping $500k now and the market crashed next month could set you back years. Instead put in say $50k per month until you’ve moved the whole thing into position.", "score": 52, "replies": [{"body": "I’m ready to drop 100k on qqq, DCA required?", "score": 0, "replies": [{"body": "I wouldn’t say “required” as it could make a couple percent difference in either direction DCAing over say 2-3 months.     \nOnly you know your tolerance to that level of shift, and depending on your expected timeline, and how much you can regularly add to that. It may well be a largely insignificant difference long term", "score": 2, "replies": []}]}]}, {"body": "'15-20k in cash is not going to make you rich over the decades'\n\nhmm, you just sold me on having an emergency fund of some kind. I've always heard it as important, but this helps solidify it in my mind, thanks", "score": 50, "replies": [{"body": "An emergency fund is one of THE most important financial decisions you can make. It should be your step 0 in gaining financial independence, especially before gambling in the stock market.", "score": 63, "replies": [{"body": "100% agree. I recently lost my job and my Emergency Fund means I have nothing to worry about this side of Christmas. The stress level right now if I didn’t have it would be through the roof, now I can take a bit of time to find work, that I actually will enjoy doing, and not worry that the mortgage won’t be paid or kids won’t be fed", "score": 2, "replies": []}]}, {"body": "Emergency fund is CRITICAL!  Keeps roof over your head, lights on, and food on the table without hitting your credit cards.  Glad you're doing it!", "score": 14, "replies": []}, {"body": "I mean for real. If you’re constantly, consistently investing over time, why not have a lil pile of cash to violently throw at whatever emergency that comes up? It is supremely liberating in more ways than not. And-you never miss a budget if you do keep one. You can keep paying bills and investments without so much as a blink. \n\nIt just makes sense.", "score": 20, "replies": [{"body": "I agree with you in a much bigger way - we have been trading sideways within 1% of all time highs for a minute, that was the chance to go to cash. There is/was no way in hell we were going to get another 20% gain from that point without a dip - you absolutely should have pulled money out to use for days like this one.\n\nI think we will have a weird week as the US debt ceiling this unfolds. China will bail out their companies soon (if not today).. the US debt ceiling is just politics but will cause us some choppy trading. Time to start shopping for deals", "score": 2, "replies": []}]}, {"body": "I've never had a *cash* emergency fund. My emergency fund is in the form of low risk securities.\n\nIt has worked wonderfully for the times I really needed the money. \n\nToday, the SPY needs to tank \\~20% to return to the amount that I originally invested.", "score": 1, "replies": [{"body": "that is a pretty safe investment, and importantly it's also fairly liquid. I'd say that qualifies", "score": 1, "replies": []}]}]}, {"body": "Before I even scrolled down my instant first thought was,  very carefully.  Then I read your reply and was so pleased to read a great,  thoughtful, and common sense response.", "score": 6, "replies": [{"body": "Thank you, sincerely. It means a lot when someone compliments me. \n\nI appreciate it.", "score": 8, "replies": [{"body": "It seems like you need a hug Daegoba.\n\nVirtual hug coming your way! You are a truly wonderful human being and you are killin’ it!!!\n\nHeck, you are awesome at everything, except for the things you’re not!", "score": 2, "replies": [{"body": "Thank you! This was wonderful to wake up too!\n\nToday will be a good day!", "score": 1, "replies": []}]}]}]}, {"body": "I love this response", "score": 7, "replies": []}, {"body": "I would do the exact same.\nBuy boring etfs like VOO and build a good 3-6 months emergency fund!", "score": 10, "replies": []}, {"body": "Any suggestions of boring ass ETFs with small return/low risk to park your emergency fund?", "score": 5, "replies": [{"body": "It’s not a good idea to invest your emergency fund. \n\nI know, I know. Inflation, blah blah blah. Listen:\n\nAgain, 3-6 months expenses isn’t going to make you rich over the years. It will, however, fix your car/HVAC/water heater/etc immediately. It will also pay your bills two months down the road when you get laid off during the recession, and thank god you didn’t invest it, because thanks to the market crash, now you’re not down 30%. \n\nI’d recommend an ETF, but if I did, it would immediately crash and you’d blame me.", "score": 21, "replies": [{"body": "\n>I’d recommend an ETF, but if I did, it would immediately crash and you’d blame me.\n\nTruth.", "score": 10, "replies": []}, {"body": "Haha I would not! But thanks!!! (:", "score": 5, "replies": [{"body": "The best \"boring\" ETFs in my opinion are VTI, VXUS and SCHD in some combination.  They are highly diversified and have low fees.\n\nVTI is basically the entire market of US stocks in accordance with market share.\n\nVXUS is the same thing for everything outside the US.\n\nOwning these two in some combination 50/50, 60/40, or 70/30 will give you all the diversification you will ever need.\n\nSCHD is the best divided fund on the market in my opinion.  If you are looking to add some income to your investment and/or if you are nearing retirement it could be a good one to add to the VTI/VXUS mix.  I would not recommend divided investing to a young person because the taxes drag your long term gains.  But, it can definitely be valuable for retirees.\n\nDiversification and patience works in almost any market.  The world economy will eventually be bigger than it is today even if money shifts from one place to another.", "score": 2, "replies": [{"body": "What's a divided fund? That's a new one to this noob. Thanks in advance", "score": 2, "replies": [{"body": "I think OP meant dividend.", "score": 3, "replies": [{"body": "Ah, thanks. Still learning what are new terms and what are typos. Haha", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Series I bonds", "score": 1, "replies": []}]}, {"body": "Agree, although I would favor beaten down dividend paying stocks to give you some price support in the event of a market downdraft - think CAG, KFT, K in food stocks, LMT in industrial/defense, WHR for consumer durables, MRK for pharma, C and UNM in financials, XOM and EPD in energy.  These will give you an income stream and are trading at depressed multiples, so they shouldn't get hit too hard in a correction.", "score": 11, "replies": [{"body": "Fuck it: if I’ve got a job like OP says? I’d just re-invest the dividends too.", "score": 2, "replies": []}]}, {"body": "Any good 3D Printing ETFs?", "score": 6, "replies": [{"body": "I mean, yeah, but if I tell you, they’ll immediately tank and you’ll hate me. \n\nUse the research option from Fidelity. It’s surprisingly good.", "score": 14, "replies": []}, {"body": "It's always important to remember that an impressive technology is not the same thing as a good financial investment.", "score": 7, "replies": []}, {"body": "PRNT", "score": 2, "replies": []}]}, {"body": "You don't recommend having your emergency fund in a HYSA?", "score": 2, "replies": [{"body": "No. It’s for emergencies. Not investing.", "score": 1, "replies": [{"body": "HYSA means high yield savings account. I don't know much about online savings accounts but I'd have to assume they're pretty liquid and safe.", "score": 4, "replies": []}]}]}, {"body": "Great advice.", "score": 2, "replies": []}, {"body": "This is a fantastic answer.", "score": 2, "replies": []}, {"body": "Would you give some examples of well established stocks or boring ass ETFs? when a crash comes, all of it crashes. Otherwise it wouldn't be a \"market\" crash. That's the point of holding some cash in overextended situations, isn't it?", "score": 2, "replies": [{"body": "The only cash you should be holding is your emergency fund. You shouldn’t hold cash trying to time the market. If you just fucking have to, use your 5% Gambling account. Roll everything else on an investment schedule, constantly and consistently. Fuck a market crash. Invest through that bitch.", "score": 1, "replies": [{"body": "Thanks for your reply man, I really appreciate it. I'm new at all this, so I could still really use some names for boring ass ETFs. Everything I see here in reddit is the super risky extra growth stuff.", "score": 2, "replies": []}]}]}, {"body": "Where do you keep your emergency funds and savings for a house down payment?", "score": 2, "replies": [{"body": "Emergency fund goes into a safe or a safety deposit box. It’s a bro I of money. Keep it someplace safe. \n\nA house down payment is in its own savings account. You shouldn’t worry about it growing interest either. You’re gonna use it before it makes you any money anyway.", "score": 1, "replies": []}]}, {"body": "Yup multiple etfs and you will be a millionaire with ease in no time", "score": 2, "replies": []}, {"body": "This. This guy knows", "score": 2, "replies": []}, {"body": "I think this is hilarious to read when every day i see people talk about timing the market and be fully deployed, buy VOO…\n\nYou’re right, preserving capital with a safe return is the goal once you have accumulated wealth. The path to accumulating it needs more risk but once you have some money you need to protect it \n\nI got flamed here two weeks ago for saying i shifted to a large cash position.. not one person asked my age, how much money i still had deployed etc.. All i got was a bunch of memes about timing the market \n\nI wake up this morning seeing that I haven’t lost 20k that I otherwise would have and now i can go shopping for deals..", "score": 2, "replies": [{"body": "Sweet, sweet sweet, Mental Revenge.", "score": 2, "replies": []}]}, {"body": "[removed]", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Stay true to yourself! You’re on the right track!", "score": 1, "replies": []}]}, {"body": "This and also sell calls/puts on stocks that you like and collect the premiums. Easy money", "score": 2, "replies": []}, {"body": "I am in a similar position as the OP, but with a bit more cash (620k) and a higher income (currently at \\~16k after taxes, I hope it can continue since I work in tech). I also have \\~ 90k that I can invest in another country, possibly in real estate, and \\~ 100k in a 401k. Renting, but not inclined to buy where I live (HCOL). 10-year horizon, but it could be 7.  \nGiven my situation, would your recommendations change?", "score": 1, "replies": [{"body": "1) Have an emergency fund of 3-6 months. \n\n2) Be debt free. Totally. No exceptions. \n\n3) Invest 15% of your income into those boring ass ETF’s or good, growth-stock mutual funds. \n\n4) Buy a house to live in. Do it. It’s cheaper and generates more wealth than renting. 15 year fixed with 20% down is the Big Dick move. **HOUSE PAYMENT NO MORE THAN 25% OF TAKE HOME PAY**. I heard you, but listen to me: there is no quicker way to become wealthy than with a paid-for home. \n\n4) Max out saving for your future expenses (cars, kids college, etc) Shit you know is coming. Dump the rest in investments, ROTH, and HSA accounts (tax free, BITCH!)\n\n5) Set a goal of 10-15 times your annual salary. This is a long, years-of-work goal. This is the number it takes to retire with investments paying you your annual salary, roughly. \n\n6) Congratulations, if you achieved 1-5, you’re now a Millionaire, and can live out the rest of your life, regardless of age, exactly however the fuck you want. Winner.", "score": 2, "replies": [{"body": "Fantastic, thank you!", "score": 2, "replies": []}]}]}]}, {"body": "I'd start a biotechnology company and go public with no product and no revenue.  Instant billions", "score": 253, "replies": [{"body": "[deleted]", "score": 89, "replies": [{"body": "Lol", "score": 3, "replies": []}, {"body": "hahahah my thoughts", "score": 1, "replies": []}]}, {"body": "Or an EV company with 0 cars produced and go public for instant billions (Nikola/Rivian).", "score": 2, "replies": [{"body": "so many landmines out there", "score": 2, "replies": []}]}]}, {"body": "Warren Buffett's strategy isn't to sit on cash. He needs to keep a cash reserve because he owns an insurance company. His trades are also worth billions of dollars so emulating him is a bad idea since you're not Warren Buffett and your situation is nothing like his. \n\nTake Buffet's advice and invest in index funds. There are target date funds you can use, so pick a retirement date and find the right fund for you. Then take his other bit of advice and don't touch your investment. Investors often lose money by panicking, don't do that. \n\n\nAs far as cash goes, it would be prudent to see what happens with the debt ceiling at the end of the month. If the Republicans go balls to the wall and decide to essentially veto the Democrats spending plan things might get interesting. I would hold onto some cash until the debt ceiling is raised or suspended but I wouldn't hold onto too much. Maybe invest half now and the other half after.", "score": 146, "replies": [{"body": "He also keeps cash on hand in cash a good buying opportunity arises.\n\n*Cash on hand in case a good buying opportunity arises*", "score": 20, "replies": [{"body": "I also keep my cash on hand in cash.", "score": 7, "replies": [{"body": "Hahah it fucking is. Damn auto correct 😂🤷🏻", "score": 1, "replies": []}]}, {"body": "I would advise against keeping cash on hand that's not part of your emergency fund unless you really really know what you're doing. 9/10 times you'd have had a better return if you invested all your cash upfront vs invested some of it and the rest sat idle until a good buying opportunity.", "score": 1, "replies": [{"body": "I'd have to agree. I personally am fully invested with a couple grand in cash on the side. luckily for me, I really know what I'm doing haha (double major Econ  and Finance)", "score": 1, "replies": []}]}]}, {"body": "Things indeed might get extremely interesting.", "score": 3, "replies": []}, {"body": "There's nothing wrong with DCA'ing in part of his investment over the future.  Yes most market highs do lead to further market highs, but we have a million indicators of problems RIGHT NOW.  In Chinese business, in the American market, in financial institutions, in hedge fund corruption.  In housing prices.  In a Canadian election on Monday that may determine housing policy over the next decade.\n\nLeaving a percentage on the table right now is a legitimate and prudent strategy and you don't have to be a billionaire for that to be true.", "score": 1, "replies": []}, {"body": "I wouldn't suggest the time horizon funds. They are typically actively managed which usually means higher costs. Compounding interest is the miracle of investing. Compounding costs is the opposite of compounding interest so you should look for the cheapest funds that offer the returns of your liking. VOO and VTO are pretty low cost funds that attempt to mirror the S&P or the entire market, respectively.", "score": 1, "replies": []}]}, {"body": "OP, we get it, you just inherited 500k. Just be upfront about why you want to know 😂", "score": 66, "replies": [{"body": "Asking for a friend", "score": 4, "replies": []}, {"body": "Wasn't exactly slick. I mean I understand wanting to hide it but he couldve easily made his post less obvious.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 112, "replies": [{"body": "Finally someone in this thread that's honest", "score": 51, "replies": []}, {"body": "He said 500k, not 500m.", "score": 13, "replies": [{"body": "Used lambo, mid grade coke, lesser grade hookers.", "score": 38, "replies": [{"body": "Never cheap out on the quality of your drugs.", "score": 8, "replies": [{"body": "Or hookers, both have repercussions.", "score": 6, "replies": []}, {"body": "Cokes expensive but the fent is free", "score": 2, "replies": []}]}]}]}]}, {"body": "VTSAX and chill", "score": 26, "replies": [{"body": "Those 37% in a year look pretty nice", "score": 1, "replies": []}]}, {"body": "If your horizon is 10 years? No cash (it’s trash). 60% large cap index fund, 20% international stocks, 10% growth stocks, 10% tax advantaged bonds like munis. Do nothing for 10 years and then look at my balance.", "score": 351, "replies": [{"body": "so VT?", "score": 32, "replies": [{"body": "VT and chill ;)", "score": 14, "replies": []}, {"body": "VT is the shit. Id like to move all of the cash i have spread across foreign and us funds into just VT but I'll get hit with cap gains for selling unfortunately.", "score": 1, "replies": []}]}, {"body": "If this 500k is qualified then the munis should never be used. If it’s non qual, then based on the returns, corporates are yielding higher than munis in their TEY. Their income level doesn’t create a tax issue so I’d stay out of munis. On the higher end, that 10% allocation would yield 1,750 at 3.5%.", "score": 57, "replies": [{"body": "What do you mean with qualified?", "score": 1, "replies": [{"body": "Qualified refers to accounts that are tax deferred - employer sponsored retirement plans like 401k, 403b, 457, or IRA accounts, or annuities, and variable life insurance. These vehicles won’t generate taxable income from capital gains, dividends, and/or interest payments. Munis are never suitable for a qualified account because their non taxable status is irrelevant to a tax deferred/qualified account.\n\nNon qualified refers to taxable accounts. An individual brokerage that will generate capitals gains, dividend, and interest tax liabilities. Munis are suitable for this type of account because the account is taxable and Muni bond interest payments typically aren’t if their in-state and non-AMT generating\n\nTo add: Trust accounts also being non qualified. Trusts with millions in them would be ideal for Muni investing because of the income tax rates on trusts", "score": 6, "replies": []}]}, {"body": "You know, I just don't see the argument for corporate bonds right now.\n\n1. Corporate bonds don't pay that much more than leveraged, closed end muni bond funds (which pay 3.5% - 5.5% tax free at an acceptable level of risk), whereas leveraged bond funds can borrow money for their leverage dirt cheap right now.  \n2. I'm averaging 4.8% on my closed end, tax free bond funds right now, mainly because half of them invest only in investment grade munis and those pay under 5% annual yield.  \n3. Preferred stock of high cashflow companies with solid businesses are paying much more than corporate bonds, for taxable fixed income. I'm averaging 8.4% coupon rate for preferred shares with a $25 coupon value trading at a premium of about $0.50 - $1.50 above the coupon value.", "score": 1, "replies": []}]}, {"body": "> Do nothing for 10 years and then look at my balance.\n\nPerhaps rebalance to the original ratios every 6 to 12 months.", "score": 33, "replies": [{"body": "Taxes though. Meh", "score": 26, "replies": [{"body": "excellent point. I was thinking of my tax advantaged accounts so didn't even occur to me.", "score": 15, "replies": [{"body": "Ah, gotcha. Yeah, makes sense in accounts without taxes.", "score": 8, "replies": []}]}, {"body": "Couldn't one rebalance without selling by simply changing allocation on their monthly DCA?", "score": 1, "replies": [{"body": "The original advice doesn't involve DCA, but yeah, you can rebalance that way, it just takes longer.", "score": 1, "replies": []}]}]}]}, {"body": "But if no cash and there is a crash? Its not better to have a cash reserve like 10-20% to buy dips?", "score": -27, "replies": [{"body": "Opportunity cost will, on average, always be higher than what you might potentionally lose in a crash", "score": 30, "replies": []}, {"body": "Imangine letting the market climb 30% to take advantage of a 20% crash.", "score": 76, "replies": [{"body": "That’s why I only wait till a 30% crash after a 20% climb. Rookies.", "score": 34, "replies": [{"body": "Interesting, thanks from a noob.", "score": 3, "replies": []}]}, {"body": "And then not even investing at -30% because everyone says it’ll go -50% and then finally jumping in when it’s back to -5%.\n\nEveryone thinks they can invest in a crash but you don’t know when it’ll stop crashing and you’ll get in too early or too late.", "score": 11, "replies": []}]}, {"body": "Everyone thinks they are going to buy the bottom of the dip and sell at the very tippy top of the market.\n\nIts a childs dream for people who don't know any better.", "score": 32, "replies": []}, {"body": "Time in the market not time the market", "score": 41, "replies": [{"body": "But what if I have a time machine", "score": 0, "replies": []}]}, {"body": "Leaving a small proportion (5-10%) is fine if it makes you feel better for crashes.", "score": 5, "replies": [{"body": "In a 20 percent crash, some stocks will be 80 percent off.\n\nI hold a small cash position to take advantage of really outrageous discounts generally and that chunk might be my best outperforming chunk. \n\nResults may vary, but I bought some great stocks at severe discount and I’ve just let them run because their so very green.\n\nAlso it can come in handy if you lose your income or need an unexpected need of cash (car crash, hospital bills, etc.). You won’t have to sell your stocks at a discount if they are down.", "score": 11, "replies": [{"body": "This is the correct take. Buffett has a treasure chest for a reason.", "score": 2, "replies": []}, {"body": "You should have a separate cash emergency fund with 3-6 months of expenses that is not used in investing.", "score": 1, "replies": []}]}]}, {"body": "> But if no cash and there is a crash? Its not better to have a cash reserve like 10-20% to buy dips?\n\nworth noting, a \"crash\" doesn't necessarily mean you can buy stuff cheaper than you can today.\n\nVOO is currently at a little over $400 a share. lets say there's a 20% crash this week and it drops to $320. this is STILL more expensive than the $305 it was trading at a year ago on 9/18/20.\n\nalso worth noting, while some people will likely freak out over the notion, you always have margin as an option to buy dips, then pay it off. if you weren't carrying a balance pre-crash, you can safely have access to like 20% of your portfolio value as a \"buy the dip\" fund.\n\nkeeping large amounts of cash on hand like the 200k you mentioned in OP (40% of 500k) for a \"what if\" is going to be a net negative due to opportunity cost.", "score": 6, "replies": []}, {"body": "You are not wrong to hold cash. Reddit skews younger and many people’s only exposure to a crash was the v shaped crash and unprecedented recovery last year. There have been several lost decades in the market.\n\nIf you do hold cash, it’s to mitigate risk which will very likely result in a lower return over that decade. It’s not to time a bottom. That won’t work. \n\nYou should also look at the target date funds. It’s a good starting point to get an idea of what others are doing. Or just buying a target date fund if you want to just buy and forget. Those funds take care of rebalancing so you can be totally hands off. \n\nhttps://fundresearch.fidelity.com/mutual-funds/summary/31617R704", "score": 8, "replies": []}, {"body": "I don’t know why this is getting downvoted.  No one literally no one should put 100% of their net worth into the market.  The people that are saying this have no life experience.", "score": 3, "replies": []}, {"body": "The fact that this is so downvoted is kind of absurd to me, it's a totally reasonable question to ask. I understand the point of the zealots who preach \"time in the market beats timing the market\" and they aren't wrong, but this doesn't mean you can literally hold no cash ever. It also doesn't mean that there are no considerations to be taken if there are fears of a crash in the near future.\n\nIf you're a relatively conservative investor and want to put most if not all of your portfolio in index funds that's great, but I'd be weary of tossing it all into the market as a lump some at this time. Another approach is to dollar-cost-average (DCA), or invest a percentage of that lump sum every week or month until it's all invested. The benefit of this is you can take advantage of volatility in the market rather than just riding it out.\n\nThe timeframe you choose to do this over is up to you. If you do it too quickly it may defeat the purpose because you end up having all or most of your money in the market before it potentially crashes, and if you do it too slowly you end up losing more from lack of time in the market than you would of you just rode out the crash. You could also decide to do something like invest half up front then DCA the rest over a year or so.\n\nWhatever you choose, it might be worth doing some math to compare against hypothetical crash scenarios to see what approach is optimal given your tolerance for risk/reward and investment timeline. If you don't expect to touch this money for a while (5-10 years) then you're probably better off just investing most/all of your portfolio up front as people are suggesting, I just wanted to point out that there are other approaches that are valid as well.", "score": 1, "replies": []}, {"body": "Hence why you have protective put positions in case of black swan events.", "score": 0, "replies": []}, {"body": "time in the market beats timing the market", "score": 1, "replies": []}]}, {"body": "Yes, but also diversify in time.  Average in to the market, dont go lump sum.", "score": -16, "replies": [{"body": "I have heard it is often bette to just lump sum into the market if the investment period is long (10+ years)", "score": 12, "replies": [{"body": "This is if you Know your investment period will be long\n\nA lot of beginners don't know how they react to a market panic. They plan a 10+ year horizon, and lump sum into an ETF.\n\nThe market crashes.\n\nThey panic sell.\n\nDoes everyone on here know how they react to a lump sum that crashes? This is why dca is sometimes better; statistically worse but gives you peace of mind and pragmatically you might do better overall.", "score": 1, "replies": [{"body": "On average its probably beter to lump sum, but don't know if that holds true with the market being high like it is. Not predicting a crash to be clear. But missed gains hurt a he'll of a lot less than unrealized losses and could very well prevent a panic sell witch would make the losses realised.", "score": 0, "replies": []}]}]}]}, {"body": "How risky is it to have 100% of you money inETFs? I am thinking about doing the same because i hate real estate but everybody tells me to buy real estate as well.", "score": 1, "replies": []}]}, {"body": "If it was me, I would take out a big fixed-rate 30 year mortgage and buy a nice house despite the high prices.  Institutional investors are snapping up many of the nicer homes for sale and there are good reasons why they are doing it.  The Fed only has 2 choices right now, crash the economy or inflate prices.  If they crash the economy you will lose on the house, but probably not as much as you would on stocks.  If they inflate, your house with that low interest long term mortgage will be a fantastic investment.", "score": 213, "replies": [{"body": "I have to agree here. 5% inflation is getting paid 50k for owning a million dollar house.\n\nThere are a lot of 6 million dollar homes that are empty around here as investments. Outside of a certain price range it could be a gamble, but where there is still demand, it is a great investment before rates go up.\n\nWhen rates go up, home values will come down slightly, so better to get in quicker to take advantage of inflation, rather than at the end.", "score": 70, "replies": [{"body": "I own a mortgage where at current inflation levels, the bank is paying for my mortgage.", "score": 30, "replies": [{"body": "I really like the way you put this, but as someone who works in banking and with mortgages just about anyone who has gotten a mortgage in the past year has gotten in the same boat as you. BUT, you have to look at it from a banks perspective: all that money they have sitting around they could either put in the fed and get 0.15% interest, they could buy up bonds and get a similar rate, or they could start giving out more mortgages and suddenly get an ~2-4% return on their money. So, even though with inflation right now a person with a good credit score can basically get free money by getting a mortgage, from the banks perspective that’s okay because they’re still getting exponentially higher returns than they would if they just put it with the fed or bought bonds", "score": 20, "replies": [{"body": "And don't forget. It's not the banks money, it's their customers. Pay .01% on checking and make 2.5% on the loan. Free money.", "score": 3, "replies": []}, {"body": "Absolutely. Still… 2.7% 10-year interest only mortgage I am getting paid for my home’s appreciation in 10 years. Thank you Papa Powell.", "score": 7, "replies": [{"body": "Oh yeah and I’m not denying that at all, it’s a great deal and if you’re able to you should absolutely get a mortgage right now. Just pointing out that it’s also not as bad of a deal for the banks as it seems at first glance", "score": 2, "replies": [{"body": "double edged sword, home prices are also very high. And although everyone assumes they will keep going up, and that rates will keep going lower, the opposite could happen.", "score": 2, "replies": [{"body": "This is the secret. I got a screaming deal on my property and on my mortgage. It’s the absolute perfect storm. Moved in 2019 when the market was high but not insane. Low balled the owner when they were trying to sell a high value property in October (terrible month for RE sale) and waited patiently. 45 days later got a call from the agent asking if I could improve my offer, I said no. The offer I gave them was my final offer. They took it wanting me to close in 30 days, my bank miraculously closed in 27 days since I had all my\nDocuments in order. House has appreciated over 45% since. No inventory and highly desirable neighborhoods will do that. I just got lucky 20 times over. The offer I gave them was the best we could really do and since they had moved already they wanted to dump the house… i would never sell the property now and would never buy anything in this market. Prices are completely out of control. So much so I contemplated selling the house and renting for 2 years… SO didn’t love my idea…", "score": 2, "replies": []}]}]}, {"body": "Unless the housing market crashes", "score": 1, "replies": [{"body": "The crash would have to be catastrophic to hurt me. In this case, I would be worried about other issues outside a mortgage. Prices are coming down for sure, but it won’t be like 2008 because of lending standards being much tighter.", "score": 1, "replies": []}]}]}, {"body": "With fractional reserve banking you can lend out more cash than you have and make returns on cash not even in your vaults. Can’t beat that.", "score": 1, "replies": []}]}, {"body": "Dang nice", "score": 5, "replies": []}]}, {"body": "That is makes it a bad investment… you want to buy low sell high. Refinancing is easy relatively cheap. You want to buy when rates are high and have them go down. I’d rather pay higher interest than be underwater", "score": 4, "replies": [{"body": "Yeah but house prices may never go down. And interest rates might never be this low again. My house went up in value 150k in the last 3 years, it's worth the risk IMO.", "score": 9, "replies": [{"body": "We bought our house 2.5 years ago and it went up 340k.  I believe house prices will stabilize, but will not go down by much.", "score": 3, "replies": []}, {"body": "Damn 150 k in 3 years 😳😳", "score": 1, "replies": []}]}, {"body": "When interest rates increase, the cost of buying a house increases. It has the net effect of reducing house values. They recover, but if try to buy right before they go up, you will end up with less house than you could have gotten. You can see this for yourself on Zillow. Check out their calculator on any house. Look at the monthly payments for their default interest rate, now add 1% to that rate and see what the payments become. People buy less house with higher rates. It would be better to buy now than in a year or two. While the Fed keeps rates low, we will have inflation, which is bad for money in the bank or stocks. If it is in real estate, inflation will increase its value. Also, inflation is great for low interest long term debt.", "score": -8, "replies": [{"body": "When interest rates increase the buying power of the entire market decreases proportionally. The net effect is that rates have very little impact on the amount of house you can buy, they really only matter when you refinance.", "score": 7, "replies": [{"body": "Rising interest rates will reduce your home value. Thus it is not so good to buy immediately before rates are raised.\n\n[Here is one of thousands of articles](https://www.investopedia.com/ask/answers/correlation-inflation-houses.asp) about this subject.", "score": 1, "replies": [{"body": "Yeah that matters to the seller, but for the buyer the opposite is true. If the rates are high, the buyer benefits long term.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Stocks would likely recover faster though, within a couple years.\n\nEDIT: But, i would also strongly consider getting on the housing ladder for security, maybe a good sized deposit on something worth 200-300k where I live is a good family home.", "score": 35, "replies": []}, {"body": "[deleted]", "score": 7, "replies": []}, {"body": "Or buy a cash flowing rental property. In my market 125k down gets you a decent quadplex plus some cash to rehab it slightly to get higher rents. Then you get appreciation and probably an extra $600-1000 in cash flow. \n\nEdit: if you’re worried about managing it, you can pay a company to do that for 8-10% of your gross rent.", "score": 16, "replies": [{"body": "This is my wife and my current strategy. For the above 500k a sizable building could be purchased in some markets. We were looking at a 25 unit building listed for 1.1 million getting 600-700 per unit per month in rent. That’s some cheddar", "score": 9, "replies": [{"body": "40k per unit!? And each unit rents for 700. Wut? Something doesn’t add up here.", "score": 9, "replies": [{"body": "It has to do mostly with cap rate and area value, you don’t buy apartment buildings for short term if you know what you are doing, the valuation holds up. This is nearby to Seattle, so there’s lots of economic growth in the area.", "score": 1, "replies": []}]}, {"body": "Well you could buy a lot of those apartment houses now considering many of the tenants are not paying rent and then you would have to deal with multiple evictions. Also you have a chance of many residents getting together and protesting for one thing or another the climate in apartment dwellings happens to be the landlord is the bad guy lets not pay him. One and two family homes the way to go in the long run there is always a buyer when it comes time to sell", "score": 9, "replies": [{"body": "This exact thinking is what I like to see in the marketplace. Keep thinking it’s a bad business :)", "score": 0, "replies": []}]}, {"body": "Crazy I found a 15-20 unit in OH. For like $150k that needed a little work done. I should’ve jumped on that", "score": 3, "replies": [{"body": "Depends on what the market is like in the area, but yeah that sounds really undervalued", "score": 2, "replies": [{"body": "True but it would’ve been a nice investment . Even if was charging $500 per unit . That’s a nice flip . You’d see ur money back in about  3 years", "score": 1, "replies": [{"body": "Yeah, couple other factors to consider is how many of those units you can actually lease out, if the market won’t support the 15 units being leased then that’s a problem. A 15 unit building in Schitts Creek wouldn’t rent fully, so it can become a challenge on that front\n All different factors of the pricing structure.", "score": 1, "replies": [{"body": "That is true", "score": 2, "replies": []}]}]}]}]}, {"body": "I mentioned to my wife earlier that a real estate deal fell in my lap and would like to Buy it.  She quickly gets negative and very risk averse.   Im getting really annoyed.   We would have been so far ahead if we purchased the deals I have brought her over the years.", "score": 1, "replies": [{"body": "What’s interesting is how low risk real estate really is, if you do your DD and buy something you can hold through a downturn that is well positioned in a decent area you will make money it will just take time. Why do you think with increased stock volatility people buy homes? We already own two homes and have size-able equity positions in both and rent one out. I can tell you for a fact though, buying homes took 50k in down payments and closing costs and turned it into 1million plus net worth.", "score": 2, "replies": [{"body": "Beautiful.   Thanks for sharing", "score": 1, "replies": []}]}]}]}, {"body": "Where the heck is your market?", "score": 1, "replies": [{"body": "Sorry I meant with the 125k down you can buy a 450k property. My market is Harrisonburg Virginia.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Not sure what you mean? $150 pure cash flow per door is pretty attainable.", "score": 1, "replies": []}]}, {"body": "What market is this? I will buy tickets to it now.", "score": 1, "replies": []}]}, {"body": "I wouldn't buy a house, buy farmland, and share crop it out.", "score": 13, "replies": [{"body": "Have you looked into farmland REITs?", "score": 2, "replies": [{"body": "Nope but now you have me interested. We have a guy at work that just works for fun money, he inherited enough farm land acreage to pay his property taxes and bills, plus extra investing money. I think it’s 100-200 acres.", "score": 1, "replies": []}]}, {"body": "That's an interesting idea...  anyone here have experience buying and leasing farmland without farming experience?", "score": 2, "replies": [{"body": "I can ask my buddy at work. He share crops out his farm land to pay his property taxes and bills for the year.", "score": 2, "replies": [{"body": "Would love to get some insight into this... i've been eyeing some spots, but seems like alot of govt programs and tax considerations", "score": 1, "replies": [{"body": "He said he leases out 190 acres and has it dumped into reinvestment accounts. I asked how much per acre but he wouldn’t say. But he said the biggest issue he has, he has to maintain the land. He gets a cut of the profit from the crops but the maintenance of the land eats into it(he hires it out)", "score": 1, "replies": []}]}]}]}, {"body": "Have you heard of acretrader", "score": 1, "replies": []}]}, {"body": "\\+1 on this. I wish I had a free award today to give.", "score": 0, "replies": [{"body": "Just give some good advice instead!", "score": 6, "replies": [{"body": "I am too young to give advice. I am learning.", "score": 8, "replies": []}]}]}, {"body": "Nice!!", "score": 1, "replies": []}, {"body": "Am I missing something? With inflation - don’t goods and services become more expensive too? Hence negating the benefit of capital gains that come strictly from inflating value? Wtf are we talking about here cause I’m lost", "score": 1, "replies": []}, {"body": "Seems like a huge gamble to test your assumption on.  Plus with a house op has to worry about upkeep, maintenance, tenants if he wants to cash flow it, etc. A house is great but OP might just want something he can set and forget so in that case index funds are the clear choice.", "score": 1, "replies": []}]}, {"body": "Buy a house, install grow rooms, buy some seeds and start making some tax free $$$", "score": 82, "replies": [{"body": "Yeah for real. They yield on corn has went up 300% in the last 5 years!", "score": 75, "replies": [{"body": "Corns' got nothing on spinach. My basement is wall to wall spinach starts can't wait to harvest and get that $$$$. Power bill is kinda high but it should work out in the end.", "score": 20, "replies": [{"body": "Can you tell me more about this? I saw grow rooms and assumed you guys were talking marijuana. I have a serious need to lower my effective tax rate. How does this investment strategy work?", "score": 5, "replies": [{"body": "Wanna lower your tax, I’m not sure how it works where you are but I could probably grow sprouts here and be classified as a primary producer. Also gives you a business to funnel other income sources through…", "score": 1, "replies": [{"body": "I’m in the US, State of Oregon. Do you grow on farm land or in a grow room within a house like a previous comment stated?\n\nIs “primary producer” something important in the tax code?", "score": -1, "replies": [{"body": "It was a joke", "score": 1, "replies": [{"body": "Wooosshhhh went right over his head lol", "score": 1, "replies": []}]}]}]}, {"body": "You need to generate schedule C income - basically a 1099 - if you have this auxillary income you can then deduct your expenses - including a portion of your home that you use to generate the income.", "score": 1, "replies": []}]}]}]}]}, {"body": "Yolo it into some 75x leveraged trades. Go big or go home😂😂", "score": 166, "replies": [{"body": "Go big or go homeless**", "score": 168, "replies": [{"body": "This dude knows what’s up. Either be filthy rich or homeless. I take my chances😂😂", "score": 25, "replies": [{"body": "Filthy rich or just filthy", "score": 26, "replies": [{"body": "Good enough for me😂", "score": 1, "replies": []}, {"body": "Food stamps or yacht", "score": 1, "replies": []}]}]}, {"body": "With 3,5k monthly income after taxes you won't go homeless", "score": 6, "replies": [{"body": "This isn't a lot of money especially in many metros in America. Median-ish income. Just saying. But yeah, you won't go homeless. \n\n(I guessed from the comma in 3,5k that you may not be American lol)", "score": 1, "replies": [{"body": "Medianish income is 3,5k? And i repeat, you have 3,5k in hand left after taxes and other deductions are applied? No way that is true, i am indeed European but that doesn't sound right", "score": 1, "replies": [{"body": "You're right. I meant in the metro areas. It varies so much, though, geographically. Midwest vs CA for instance. Also within states -- Austin, TX vs outside the metro triangle in TX\n\nHealth insurance premiums being deducted can make a substantial dent for some, none for others (if the company covers the entire premium). But federal taxes withheld and social security, etc., don't add to that much monthly at that income level. Some states have considerable state taxes; NYC has income taxes (!!); TX, FL have none\n\nI also think 3.5K for an individual is middle class living in those metros vs, say, 7K for two earners, which can go a lot farther with split costs. But that's the same everywhere\n\nIt's a middle class salary, depending on where you live", "score": 1, "replies": []}]}, {"body": "It isn't a lot of money but it might be nicer to live a secure, working class lifestyle in small town USA then share a roach-infested studio apartment with 3 other people in a major metro area for the same money.", "score": 1, "replies": [{"body": "Depends on the metro area. 3.5K in hand after taxes can get you, with maybe 1/2 to 2/3 of your income, a studio apartment almost anywhere in America (except Bay Area). It's expensive and not ideal, but plenty of people pay through the nose for housing. And some jobs aren't remote and require working near those cities. It's a trade-off that plenty of people make. At minimum wage, you'd be looking at sharing a meh apartment (oof)", "score": 1, "replies": [{"body": "True that, housing can be expensive in order to have that high of an income. After housing costs however, the cost of other commodities remains pretty much the same. If you want for example to buy an rtx 3080ti it is just 1/3 of your income or a nice new car can be just half your annual income. \n\nCompared to my middle class situation of 1,3k euros with just 220 euros for rent, a new rtx 3080ti is all my monthly income and a new car is 3 times my annual income", "score": 1, "replies": [{"body": "One thing that's become increasingly true here, though, is that the stuff that really determines the quality of your life -- healthcare, education, housing, childcare -- have skyrocketed in price, while yes, consumer goods are incredibly cheap here thanks to favorable trade deals, low taxes and tariffs, cheaper labor, etc. You can only eat so many things at restaurants and drive only so many cars and need only so many phones, though lol. But good quality health insurance that will keep you from bankruptcy in the event a life threatening problem? That's the dream. And it's scarce and expensive\n\nIf you're at a certain income level with a good enough healthcare plan, it doesn't matter and you'll benefit from both high quality healthcare and have whatever material stuff you want. But the number of people that applies to when, for example, the costs at a private or even good quality public college have become what they are now? Not that many\n\nAll of which is to say, while no one is saying making 1.3K euros a month is ideal, the overall life you enjoy is probably preferable to what's attainable for many in America. The numbers don't really reflect it and averages can cover up the median life and the stress involved for people who are not too far away from financial ruin (or already in debt) without safety net for, say, healthcare IMO. There's some happy medium between having uber subsidized healthcare and all the other \"goodies\" (in quotes, because I think they're seen as premium goods here and really shouldn't be when in other industrialized countries they're just taken for granted as a right) that are to large extent paid for by taxes and having all this \"stuff\" that's cheap precisely because we've lost so much ground in taxation for one thing (cheaper labor means cheaper products at, say, Walmart, but that comes in part from lower taxes across the board for corporations, which used to pay for, well, a lot of public goods). A really cynical person would even say that it's just bread and circuses to keep us nicely distracted with cheap gadgets and large happy meals, and who knows, they may be right", "score": 1, "replies": [{"body": "Still that is not the case in our country, maybe in Sweden or Norway or Netherlands or wherever but definitely not where i live. Public education is a joke, if you even want to have a chance to enter a public university you must pay a lot during your highschool years for extra education because the public high schools are just a joke and don't even prepare you for the exams\n\nAs for healthcare, yeah if you brake your arm or something the public hospitals will patch you up but nothing more than that. Expensive health costs like teeth surgery, cancer treatments and the like are not covered by the public hospitals or if they are covered, it is the bare minimum\n\nIn our shithole of a country we get the worst of both worlds really. A shit ton of taxes and public services that are just a joke. Just to get how bad it is, i and my 1,3k euros are considered lucky by a lot of people really, most people in my age don't come close to 1k. \n\nHopefully i will be joining a European agency early next year and move abroad to a country with similar expenses but three times my current salary", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Lambo or food stamps\n\nLFGooo", "score": 1, "replies": []}, {"body": "Lambos or food stamps.", "score": 1, "replies": []}]}, {"body": "Bill Hwang enters the chat", "score": 10, "replies": [{"body": "Love that guy LOL. But I honestly would have stopped at 10-100 million lol. That guy had no limit.", "score": 1, "replies": [{"body": "It’s all thanks to the power of the Holy Spirit", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 13, "replies": [{"body": "Only if you are a pimp and a drug dealer😂😂", "score": 5, "replies": []}, {"body": "😭😭😭 whatttttttt", "score": 1, "replies": []}]}, {"body": "All these fools talking property for security or low risk ettfs, and I was beginning to lose hope until I saw this. This guy knows whats up!!", "score": 2, "replies": []}, {"body": "You’re lost. WSB is over there.", "score": 1, "replies": [{"body": "Got me laughing on directions. :)", "score": 1, "replies": []}]}, {"body": "How would someone do this? Asking for a friend.", "score": 1, "replies": []}]}, {"body": "I would put 200k on spy and 100k on stock picks. use the rest 200k for DCA. everyone talks about a crash now, which means spy $500 in no time :)", "score": 51, "replies": [{"body": "Voo lower expense ratio then spy", "score": 10, "replies": [{"body": "Is $VOO the best S & P 500 ETF? In your opinion? I’m my opinion it is with $IVV being the best listed on the ASX. But for a fund listed on US markets $VOO is great", "score": 1, "replies": []}]}]}, {"body": "I have about that much in the market with 50k in AMD, 50k NVDA, 50k microsoft, 80k amazon, about 100 in random stuff, and the rest in index.  those four are my long term growth stock, and the index is what it is.  no idea if it helps you but its working out well for me so far.", "score": 32, "replies": [{"body": "I’m curious, what are some of your random holdings? If you don’t mind listing them all, that’d be awesome", "score": 3, "replies": [{"body": "Alphabetical, and some are just a few hundred dollars or a few thousand on a lark. apam, apgmf,aslrf,avgo,bb,bldp,crlbf,cstm,curlf,deck,dis,ggb,google,hexo,hdghf,mdmd,mrna,nflx,pltr,nio,sfm,snap,swks,tesla,wtrh,zenyf", "score": 3, "replies": [{"body": "Thnx! Bro, I like your core and periphery picks. Do you ever have the urge to keep adding more in goog? I always keep coming back to it. I do like dis but have yet to to pull the trigger. Their content is highly engaging. I do like NIO and own it, but lately have been eyeing and adding more to LCID as another to include in the ev play, rounded off with tesla of course ha.  I was a pussy and went with msos in the mj sector, though curaleaf is a good one.", "score": 1, "replies": [{"body": "I think we all get urges to put money in stuff some times.", "score": 1, "replies": []}]}]}]}, {"body": "Add $LULU and costco.", "score": 1, "replies": [{"body": "I was looking at costco last month, but haven't pulled the trigger.", "score": 2, "replies": []}]}, {"body": "Why AMD?", "score": 1, "replies": [{"body": "you seriously have to ask that??? its doing amazing and growth is beating analysts quarter after quarter.", "score": 3, "replies": []}]}, {"body": "I align with 50 AMD and 80 amzn but would skip the rest … instead I would put 50 in PLTR. And keep rest in cash to wait and see.", "score": 0, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "39 going on 40", "score": 3, "replies": []}]}, {"body": "What index?", "score": 1, "replies": [{"body": "and fidelity zero large cap, and vanguard real estate etf", "score": 2, "replies": []}]}]}, {"body": "1. Buy a single detached house.", "score": 36, "replies": []}, {"body": "See my username", "score": 7, "replies": []}, {"body": "5% cypto, 25% for investment property (downpayment), 27.5% VOO, 22.5% QQQ, 15% individual stocks, 5% cash", "score": 33, "replies": [{"body": "Wouldn’t that QQQ etf have a lot of overlap with VOO or am I missing something?", "score": 2, "replies": [{"body": "Whats the problem with overlap? Only reason I see is that its not as diverse as it seems but that doesnt matter as both are already diverse enough to be basically same risk as market.", "score": 1, "replies": [{"body": "I think the downside to overlapping funds/ETFs is paying operating fees twice", "score": 2, "replies": [{"body": "Yea having more of a stock or portfolio of stocks that you like is good of course, but why pay double fees and have to dollar cost average into two different positions? Something I’m missing, perhaps one hedges the other in a way?", "score": 1, "replies": []}]}]}]}]}, {"body": "500k in BRK-B", "score": 13, "replies": [{"body": "Or 1 BRKA and a rest in B? Lol", "score": 3, "replies": [{"body": "I mean why overcomplicate it", "score": 2, "replies": [{"body": "For the voting right. The one right", "score": 3, "replies": []}]}]}]}, {"body": "I would put some in AAPL, MSFT and an index fund.", "score": 12, "replies": [{"body": "this", "score": 5, "replies": [{"body": "definitely this", "score": 1, "replies": []}]}]}, {"body": "Keep 6 months or cash emergency on hand at least. Then invest $100k into an index fund and never touch it. Sell Puts on all the other stocks you like to collect premium on your bag of cash plus get into a cheaper price. Imagine selling puts on $300k worth of capital a week, you will likely pull in $2k per week in premium at a minimum going for safer OTM cash secured puts", "score": 6, "replies": [{"body": "What i would do", "score": 1, "replies": []}, {"body": "What companies would you put such option trades on?", "score": 1, "replies": [{"body": "Most important criteria has to be that you want to own that stock for a long term because if you get assigned you want to be ok with that. Or you can always keep rolling out the put if you want to avoid assignment. For me I like to do companies that I believe have a good future but are a little riskier. For instance I love selling puts on PLTR, also RBLX and Chargepoint. I figure the SP500 is the exposure to all the stable stocks and with puts I like getting exposure to disruptive markets or cool companies I actually like", "score": 2, "replies": []}]}]}, {"body": "Tesla my esla", "score": 17, "replies": [{"body": "This is literally my biggest holding right now, with a small percentage in VTI", "score": 2, "replies": []}, {"body": "Ok, Jer 🤣", "score": 0, "replies": []}]}, {"body": "500k in Tesla.", "score": 11, "replies": [{"body": "This is the top option.", "score": 4, "replies": []}, {"body": "This", "score": 1, "replies": []}]}, {"body": "To answer this question you really need to focus on financial planning and incorporating your retirement goals along to determine the level of risk you should be taking. I think your strategy is ok but you need to think of a lot more than just investment types. There’s account, titling, retirement account, 401ks, all to be considered. You should try to be maxing out all of those account each year. If it were me (26 M) I’d DCA the $500k periodically (based on days I deem to be attractive entry points in the market) over the course or 1 or 2 years depending on what the market conditions are. Since the money is going to be in the market for 35 years (retire 61) I feel comfortable being patient on the entrance point. Id add to my current stocks but also work on acquiring a good diversified basket of 75-100 stocks.", "score": 14, "replies": []}, {"body": "Personally I would only buy a house if I want to live in one, not as an investment. It's not a bad investment but I prefer stocks. Another consideration is if you're planning to monthly add money to your investment account and if you'll need to get some cash out in the next 5 years.   \n\n\nI think 80% in indexing sounds reasonable. That leaves you $100K for more riskier stuff and picking stocks, if that something you think you can do well. If not then better to put at least 90% in indexes. If indexing is you main strategy, read JL Collinsnh's stock series on his blog. He's big on indexing and has different recommendations of ETFs and bonds combo based on the situation. He's not a fan of international ETFs but I don't think it's a bad idea to allocate at least 20%.  Good luck.", "score": 4, "replies": []}, {"body": "I'd put/keep it all in cash or cash-equivalents to start and \"slowly\" move it to these investments:\n\n70% slow and boring, -- think bogleheads three-(or four-) funds (total stock, total bond, total international (and perhaps a \"total REIT\")). And within this \"bucket\", I'd skew 47% US stocks (vtsax), 13% Intl. stocks (vtiax), 7% real estate (vgslx), 33% bonds (vbtlx) (which seems arbitrary! but loosely comes from \"67% non-bonds, 33% bonds\" + \"as much as 10% of your non-bonds in REITs\")\n\n20% invested in \"your domain\", whereby I mean an area where you have perhaps above average skill or insight into the domain. For instance, you might be a chip designer or developer staying abreast of new technologies and companies that might profit from same; or you might be in the cloud-technology domain, spotting new disruptive companies; or you might be in the energy industry with hands-on (no, not \"insider trading\") knowledge of breakthrough technologies, etc.\n\n10% frivolous and reckless, ... searching for ten-baggers, chasing rumors. I.e. looking for the next Amazon, etc. For me, at the moment, this is RECAF (I know nothing, I just jumped on the bandwagon) and RR/RYCEY (fingers crossed a great company makes a comeback, ... not like that time I bought Kodak on every dip all the way down into bankruptcy... :/ )\n\nNow, by \"slowly\", yes, DCA, ... OR buy into them when/if they dip below 200-moving average, or below Bollinger bands, etc.\n\n&#x200B;\n\nAs far as the monthly income, ... I'd simply add what you can/wish each month into the cash or cash-equivalents pot refilling it as you move from cash bucket to above investments.\n\n&#x200B;\n\nMy $0.02.", "score": 4, "replies": []}, {"body": "Throw it into the video game company for me", "score": 9, "replies": []}, {"body": "Put $40k per month into the market. If it dips 5%, raise to 50k per month. If it dips 10%, raise to $60k per month, if 15%, then $70k. \n\nRepeat until fully invested.", "score": 21, "replies": [{"body": "[Data does not support DCA](https://www.pwlcapital.com/wp-content/uploads/2020/07/Dollar-Cost-Averaging-vs-Lump-Sum-Investing.pdf)\\-ing as being better to a lump sum.", "score": 19, "replies": [{"body": "Normally, I would agree, but the market is high and is likely to correct before the end of the year.", "score": -6, "replies": [{"body": "You're right. It will correct. But I've been reading headlines predicting a correction in the next 6 months for like a year now. Clearly hard to time it. I forget who said that's market's can stay irrational for a surprisingly long time. Anecdotally, I front loaded my ROTH in March '20 instead of $500/mo over the year, and I'm really glad I did.", "score": 14, "replies": [{"body": "Keynes.\n\n“The markets can remain irrational longer than you can remain solvent.”", "score": 9, "replies": []}]}, {"body": "What makes a market high, PE? What happens when the inflation trickles up to inflated earnings? Hmm.. PE drops??", "score": 3, "replies": [{"body": "There’s lots of calls for a drop in the market. Each day, it is slightly more likely. \n\nAs for “inflation trickling up to inflated earnings”, it doesn’t really work that way. Inflation typically leads to lower PE ratios and higher costs. I think you just mean that earnings might continue to rise, and I’m sure they will, but not at a fast enough rate, and markets tend not to move sideways. They either March higher or lower.", "score": 0, "replies": [{"body": "How do you determine a market is high?", "score": 3, "replies": [{"body": "Just following the news. Just about every major bank is calling for a correction from boa to jpm and ms Deutsch and citi.  PE’s can always go higher, so it’s really not the indicator of a top. But the Fed announcement later this week could be the impetus the market needs to fall. And if it isn’t this week, tapering will likely happen before year end.", "score": 0, "replies": [{"body": "News headlines say a lot of stupid things.", "score": 6, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": []}]}]}, {"body": "I would not keep anything in cash and I would not invest it in stocks all at once.  I would keep a balanced mix of index funds and short term govt bonds and invest the funds in equal increments over the course of the next 12 months.  Any cash on hand waiting to be invested I would put in treasury insured p-notes. (TIPS).  I would rebalance my portfolio once every 18 months.", "score": 9, "replies": [{"body": "TIPs are inflation protected not insured. All treasury debt is backed by full faith and credit of the US gov.", "score": 7, "replies": []}]}, {"body": "Housing prices are through the roof, but so is the stock market. I would consider putting a percentage towards a rental for residual income. Plus it’s very likely you will get your initial investment back when you sell in 10 years.", "score": 4, "replies": []}, {"body": "I mean if you don’t have any analysis skills, VOO or VTI suits you. If you do, 20-30 3-5% positions on stocks that the market is discounting and have solid growth potential", "score": 4, "replies": []}, {"body": "Even my 6 months of monthly expenses are in a stock that will likely not go down.  I can liquidate all holdings when I need to, but still have growth and dividends while it sits there.", "score": 4, "replies": []}, {"body": "Time for a property", "score": 3, "replies": []}, {"body": "Yolo it into a random penny stock that people on reddit are hyping up because they won a single government contract.", "score": 4, "replies": []}, {"body": "Microsoft shares.", "score": 4, "replies": []}, {"body": "Tsla, Amazon,  apple, Google Facebook msft for 5 years... Then move it all to high-ish dividend stocks and retire.     Retire in 5 years.   My plan anyway", "score": 3, "replies": []}, {"body": "I'd load up with Games and Movies!", "score": 15, "replies": []}, {"body": "I would be tempted to put it all on MSFT and AAPL. Or AMZN with Tesla", "score": 9, "replies": []}, {"body": "I understand about high prices on buying a home as well especially curre try with inflation being so high, home costs are up16 percent. However, paying rent is just paying off someone else's early retirement. Buy when you can and what you can afford. Real estate is not a bad investment if done properly.", "score": 17, "replies": [{"body": "Real estate, interesting subject. A year ago, with low rates, \"high\" inventory, it was the perfect timing. Fast forward to this year. Inventory is low. Prices are high (my house almost doubled in 1 year Oo), buyers have liquidity and mortgage rates are still low. Stock market is very high, such as comodities. Buyers come from high paying job areas (NY, CA, ...) and spend big bucks on real estate in more \"remote\" or vacation areas, betting on the spread and long term use of remote work. Also, new housing has slowed a lot due to multiple shortages (workers, material).\n\nThere s nothing wrong in doing nothing until all this frenzy cools off.\n\nI doubt there will be a housing market crash though. A correction, maybe, with prices stagnating. But a crash, doubtful. For this to happen, renters need to default on their payments, owners need to default on their payments, etc. It could be triggered by a massive job loss, but, unless of a new variant or a black swan, I dont see it coming.\n\nStock market will keep rising for three main reasons:\n1) low interest rates\n2) government checks (dont think about just the US, the whole world invests in US stocks, and a big chunk of Europe, although slowing down on payments, still maintains employment compensation)\n3) TINA\n\nI m almost in your shoes. I invest in startups in my field of work (medtech), putting between 25 and 50k each. My goal is to have 5 to 6 investments in early stage. Was going to buy beach property for rental but decided to wait (price doubled in a year, rent potential increased as well but not as much). I looked at purchasing a condo in town, but getting a renter s permit nowadays can be a hassle in my area. Invested about 100k in stocks in march 2020, buying the second big dip, not planning on buying more unless of a nice deal. I am not a financial advisor, weall have different goals/expectations/lifestyles.", "score": 7, "replies": [{"body": "Can you tell me more about investing in medtech startups? I'm on the verge of losing my job and looking into all opportunities. This sounds like my jam. Thanks!", "score": 2, "replies": [{"body": "Hmmm. If you are losing your job, I suggest you secure another steady source of income, unless you live in an overly \"generous\" European country.\n\nI dont know all the details of your life, so, no judgement here on what you decide ;-)\n\nAbout medtech: I ve worked in this sector for the past 10 years so I came to know investors, entrepreneurs, etc. I started by joining a specialized investment funds, putting 30k on the table. Their goal is to invest in startups in pre seed level. I came to meet more investors and see more decks and was allowed to invest in some interesting ones outside of this fund (as personnal investment).\n\nAgain, not knowing where you live makes it difficult to give you some precise help. Some countries have tax credit or tax free accounts to create a portfolio geared towards investing in startups.\n\nNot financial advice, just telling you what I did.", "score": 3, "replies": [{"body": "I work for a healthcare (EHR/PM) software company (US) and have for the last 12+ years. It was a startup when I started. I am leaving/severance due to some internal legal issues of the CEO where I was put in the middle. \n\nI recently sold my home and will be getting a settlement so actively looking to join a startup as an investor and/or employee. \n\nI guess my question is... What type of medtech startups are you working with?\n\nIdeally, I'd like to not have a boss anymore. \n\nJob seeking has all but exhausted me and every opportunity seems to be a dead end.\n\nI appreciate your time and response!", "score": 1, "replies": [{"body": "Ok, so I understand better. I think I know which company you work for. Right now I look at startups that have a simple product but solve a real problem. For exemple: interoperability solutions, data valuation solutions, direct to patient interaction, safe code execution (such as homorphism, etc...). Since we are both from that sector, we know some of the recurring issues our clients are still facing. That s what I try to look for, on top of the usual things (market size/ready, projected sales, business model, team, target, potential vertical/horizontal growth, ...).", "score": 2, "replies": []}]}]}]}, {"body": "From the 1991 housing bottom to 2000, prices rose 50%.\n\nFrom the 2012 bottom to 2021, prices have risen 50%. \n\nWill we necessarily repeat 2000->2008? No. But I think something similar will occur.", "score": 1, "replies": [{"body": "I wouldnt be so sure. Past performance isnt in any way a guarantee of future performance.\n\nMany factors come to mind:\n\n1) demographics. Should always be the #1 fundamental when making this type of bets. Lower birth rates, if not sustained by immigration, will result in a stabilization and ultimate decline in population. Less people, less buyers, but also higher burden on social dues (taxes). Read \"Empty Planet\", mindblowing.\n\n2) social. Younger generation seem to stay longer inside the family nucleus (basically, younger generation stay at their parents' longer than previous generations). I see a shift in the way to consume real estate similar to the way cars are consumed (leasing vs purchasing)\n\n3) economic. Inequalities seem to have stretched further since 2008,atleast in western world. The trend does not seem to change. This means fewer and fewer families will be able to affoard purchasing a house, or become eligible for mortgage.\n\n4) social bis. Work habit will, at least, temporarily change. Once workers have tasted remote work, it will be difficult to make it back at the office 100%. I think wages, unless top executives and rare talents, will stagnate for this reason \"ok if you want to move from SF to STL, but at best I freeze tour salary for X years, at worst you get a pay cut, because.\"\n\n5) political. Rising tensions with russia and china, rising trend of self isolation of the US, middle east crisis. China sneezes, Europe gets sick.\n\n6) climate. Climate change will/may force us to rethink or link to the place we live. People will need to relocate to places with less drasting climate impact (drought, hurricanes, floods, blizzards, tornado...). We are not all equal when it comes to climate change exposure.\n\n\n7) black swan. By definition, something we do not know.\n\nAnd of course none of this could occur, inflation could keep on rising, bringing housing prices up with it. I just dont see salaries keeping up at the same or even near rate of increase, thus further worsening inequality and disparity in access to housing,and putting tensions on the housing market.", "score": 1, "replies": []}]}]}, {"body": "I prefer to use that money to invest in the stock market. Property is a hassle, too many fees ,taxes and not liquid enough imho", "score": 17, "replies": [{"body": "Understandable for sure.", "score": 3, "replies": []}, {"body": "Where I live in Florida, we pay almost nothing in property taxes and I could flip my house in a week if I wanted to. It would also rent for double the mortgage.", "score": 0, "replies": [{"body": "In today's market. Doubt it was the case 10 years ago. And who knows what it will be like 10 years from now?", "score": 11, "replies": []}, {"body": "Where’s that?", "score": 3, "replies": []}, {"body": "Florida is arguably the worst state to buy a house in right now.", "score": 4, "replies": [{"body": "Why is that? More people move to Florida than any other state. During the pandemic, we had even more people than usual trying to buy houses here. Tampa and Naples are on every list I can find of the countries hottest real estate markets.", "score": -2, "replies": [{"body": "That means it would have been a great time to buy 1-1.5 years ago. You listed a bunch of red flags for buying right now.", "score": 2, "replies": [{"body": "There isn't a bad time to buy property in Florida. SW FL was a hot market 3 years ago, it's a hot market today and it will be a hot market 3 years from now. If you're looking at a 10+ year horizon, you could close your eyes, pick a random house on zillow anywhere in the southern half of FL, and make good money.", "score": 0, "replies": []}, {"body": "ik someone who bought down there in jan. 2020. home value up around 40% in just over 18 months, its madness", "score": 1, "replies": []}]}]}]}, {"body": "That’s a lot different than Texas. Most middle class families pay about 10% of their income in property taxes.  \n  \nHow does that work? Suppose your family income is $100k and your home is worth $300k. Assume property tax is just over 3%. That’s $10k, 10% of your income.", "score": 2, "replies": [{"body": "> Assume property tax is just over 3%\n\nwhich is quite the assumption given that in texas specifically, since that's the state you brought up [is](https://www.businessinsider.com/personal-finance/average-property-taxes-every-us-state#7-texas-45) 1.8% on average (with a median home price of $172k).\n\nthe typical texas property tax bill is roughly 1/3 of your hypothetical $10k. now, just become someone **chooses** a city with higher rates, that doesn't negate that it's not the norm.", "score": 4, "replies": []}, {"body": "My county is .95%, also the \"assessed\" value of my house is about 1/3 of what it's actually worth.", "score": 3, "replies": [{"body": "Oof. In my area (Cypress), property taxes are pushing 4% before the homestead exemption. And the assessment is spot on for what the house is worth. Our tax escrow is about the same monthly as our mortgage.", "score": 1, "replies": []}]}]}]}, {"body": "Rent is typically much higher than a mortgage and upkeep, however.", "score": 1, "replies": []}, {"body": "Property taxes and interest on your mortgage are tax deductible. Depending on your income bracket, at the end of the year, you may find you're out of an pocket less than you spend on rent for a decent home. No stress of a landlord telling you what to do. The option to improve your property to add value, or rent a room to add income. You can always take out a HELOC or similar financing on a home with equity, providing you a source of emergency funds.", "score": 1, "replies": []}]}]}, {"body": "Just fine, I'd manage with it just fine.", "score": 6, "replies": []}, {"body": "I would 80% VT or VTWAX, 20% BNDW, check back in 10 years.  Keeping 6 months of expenses in best HYSA I could find.", "score": 3, "replies": []}, {"body": "Buy property to live in and invest the rest", "score": 3, "replies": []}, {"body": "50k tacos", "score": 3, "replies": []}, {"body": "One good formula: \n\nA = Your age\n\nL = Life expectancy\n\nC = Total Assets/Capital you have\n\nI = %ge you should risk for growth\n\nI = ((L - A)/L)\\*100\n\n  \nExample: if you expect to live 80 years and you are 30 now, I = ((80-30)/80)\\*100 = 62.5%  \nIf you have 550k, you should invest 62.5% of it, 312.5K in growth and invest the remaining in inflation proof assets. Holding cash kills it slowly.\n\nOf that 62.5%, you should divide into 4 or 5 equal parts and invest them into increasingly growth oriented assets. Don't exclude home if you expect to live in the same place for 5 years.", "score": 3, "replies": []}, {"body": "We opened intelligent portfolio at Schwab and draw a monthly withdrawal. Schwab uses etfs", "score": 3, "replies": []}, {"body": "Buy large amounts of physical crude oil barrels and then refuse to sell them in US Dollars, prompting negotiations for whatever you want or the immediate invasion of your oil supplies by the US government", "score": 3, "replies": [{"body": "I want $1 million and a helicopter.", "score": 1, "replies": []}]}, {"body": "I would put $450K in VTI and $50K I'd use for a down payment on a ~~house~~ investment property", "score": 3, "replies": []}, {"body": "NTSX is a favorite ETF with slightly greater gains than VOO with built-in downside cushioningX Compare to VOO: https://www.portfoliovisualizer.com/backtest-portfolio?s=y&timePeriod=4&startYear=1985&firstMonth=1&endYear=2021&lastMonth=12&calendarAligned=true&includeYTD=false&initialAmount=500000&annualOperation=0&annualAdjustment=0&inflationAdjusted=true&annualPercentage=0.0&frequency=4&rebalanceType=1&absoluteDeviation=5.0&relativeDeviation=25.0&leverageType=0&leverageRatio=0.0&debtAmount=0&debtInterest=0.0&maintenanceMargin=25.0&leveragedBenchmark=false&reinvestDividends=true&showYield=false&showFactors=false&factorModel=3&portfolioNames=false&portfolioName1=Portfolio+1&portfolioName2=Portfolio+2&portfolioName3=Portfolio+3&symbol1=NTSX&allocation1_1=100&symbol2=VOO&allocation2_2=100\n\nHow it works:\n\nhttps://www.wisdomtree.com/-/media/us-media-files/documents/resource-library/investment-case/the-case-for-the-efficient-core-fund-family.pdf\n\nDo a search for NTSX on Reddit; it’s favorite among both Bogleheads and even LETF fans.", "score": 3, "replies": []}, {"body": "50% Invest on the safest stocks. 10% use for fun. 40% open a business", "score": 3, "replies": []}, {"body": "For starters I’ll say that I’m 22, I’m not an expert, I’ve read a few books, did my poking around online, and have a few grand worth of stocks that has been successfully growing. I am by no means an expert .That being said, what I’d do is take 50k right off the bat and just set it aside for any emergency. Id make a rule that as soon as I take money out, number 1 priority is to replace it. As far as stocks, I’d put 75k into spy, scatter 300k into ETFS and other blue chips, and take the remaining 50k for riskier plays (think the biomedical field, any penny stocks that look promising). This is assuming you’ve got an IRA or 401k (or both). If I didn’t have an Ira, I’d max it out with the full 6 grand every year starting as soon as possible.", "score": 3, "replies": []}, {"body": "Clear debts than etf fund that matches S&P or FTSE and forget about it for 20 years", "score": 3, "replies": []}, {"body": "Poorly", "score": 3, "replies": []}, {"body": "Poorly.", "score": 3, "replies": []}, {"body": "Pick a number on Roulette and throw all of it down.", "score": 3, "replies": []}, {"body": "Why don't you buy Berkshire Hathaway B stock?", "score": 5, "replies": [{"body": "It’s enough for BRK-A", "score": 6, "replies": []}]}, {"body": "You put it in to a dividend stock w a 5% yield and make 25k a year", "score": 4, "replies": [{"body": "[deleted]", "score": 0, "replies": []}]}, {"body": "COKE and WHRS", "score": 8, "replies": []}, {"body": "Buy $qyld an chill\n\nBank 10-11% dividends each year and live off of that or reinvest it", "score": 5, "replies": [{"body": "Actually you’d be poorer if you chose QYLD over SPY or VOO. \n\n\nLooking at the historical returns with dividends reinvested for QYLD, if you invested $10,000 on December 13, 2013, you’d have $18,813 today. If you had invested that into SPY, you’d have $28,848.", "score": 21, "replies": [{"body": "Of course you're right, historically NASDAQ has outperformed qyl.\n\nBut qyld is much much less volatile and lets you sleep at night while QQQ has much more downside", "score": 0, "replies": [{"body": "> Of course you're right, historically NASDAQ has outperformed qyl.\n\n\n\nVOO & SPY are S&P500 index funds. \n\n\n> But qyld is much much less volatile and lets you sleep at night while QQQ has much more downside\n\nIf you want to compare it to QQQ. Then that’s an even worse comparison for QYLD. In the same time frame as my comment above; QQQ (from a 10k investment) would be worth $47,430 today with dividends reinvested. Compare that to QYLD which would be worth $18k.", "score": 4, "replies": []}]}]}, {"body": "Just be aware that the taxes and accounting is a little bit complicated with holding QYLD in a taxable account.", "score": 5, "replies": [{"body": "Isn’t holding it in your Roth IRA a non taxable event?", "score": 1, "replies": [{"body": "Yes, but no one said anything about a Roth before. I was just mentioning that if you are holding it in a regular account, it’s a little complicated. Definitely better for a tax advantaged account.", "score": 5, "replies": [{"body": "I just needed clarification. Thanks!!", "score": 1, "replies": []}]}, {"body": "> Isn’t holding it in your Roth IRA a non taxable event?\n\nliterally nothing about the OP implies a roth, and in fact, implies the exact opposite where he's saying \"i have 500k, what should i do with it\".", "score": 0, "replies": []}]}]}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Why tho?\n\nIf you are going ETFs why not just track S&P 500?\n\nBetter performance, more diversification, and lower expense ratios (.15% is low for QQQM but  VOO is .03%)\n\nbtw just asking, not arguing. Love to see different rationale then my own.", "score": 11, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "Thank you very much.", "score": 2, "replies": []}, {"body": "This is an argument that the past performance of the Nasdaq predicts its future performance.\n\nThe problem is that one can always find outperformance in retrospect. If you pick any 3-decade period and look at the top performing sector compared to the total market, the top performing sector will beat the market dramatically.\n\nBut there’s no reliable way to predict what the top performing sector will be in advance.\n\nIf you have data which suggest that when a sector outperforms over a 3-decade period, it will likely outperform again over the next 3-decade period, then you would be on to something. But just noting past outperformance is not sufficient.", "score": 1, "replies": []}]}]}, {"body": "Is there a reason to pick QQQM over QQQ? I feel like they're the same, granted QQQM is still relatively new, so suppose it has those benefits.", "score": 1, "replies": []}]}, {"body": "- 6 month emergency fund\n- buy a house if you aren't in one already\n- buy another house as rental property OR just straight land somewhere where there will be future growth\n- most of the rest do ETFs \n- save a little for YOLO trading plays \nThis is obviously horrible advice since I'm not a financial advisor, but it's what I'm doing in a similar position to you", "score": 4, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "I mean yeah around here where I'm at in Texas I could definitely find 2 and have cash left over. I wasn't really referring to paying cash though", "score": 3, "replies": []}]}]}, {"body": "I’d start flipping houses. Start very small, get a loan for let’s say 150k house from the bank, use the cash that I have to fix it up and make it real nice (let’s say it’d cost around 30-50k then i’d sell the house for way more than I bought it. After that you basically go bigger with each hunt and u’d become a millionaire in few years", "score": 4, "replies": [{"body": "There are no houses in the market..lol", "score": 2, "replies": []}, {"body": "Yes not to be a bummer but typically flipping houses works best (acquisition wise) during a sideways or slightly down trending housing market.", "score": 1, "replies": []}]}, {"body": "I would probably still just throw it all into American weedstocks lol", "score": 4, "replies": []}, {"body": "Putting it all in YYY gets you almost 4k/mo in dividends.\n\nThanks for coming to my Boomer AF TED Talk.", "score": 5, "replies": [{"body": "Half YYY, half QYLD.  Gotta diversify.", "score": 1, "replies": []}, {"body": "And now OP pays 22% in taxes on most of that $4000/month since they are already right at the top of the 12% bracket for their $3200/month income from the job.\n\nSo they actually get $3120/month from YYY after taxes...and then do what with it? \n\nIf they don't need it to buy things they will just reinvest it...after paying $880 in taxes for no reason. Lol. \n\nIn reality they should just invest in low-volatility growth ETFs or mutual funds and sit on it, and then live off the dividends once they retire so that they won't get bumped into the higher tax brackets so easily. \n\nWith a 500k lump sum and a current monthly income that pays the bills, OP does not need dividends. \n\nThey need wealth preservation and long-term reliable growth with minimal volatility.", "score": 1, "replies": []}]}, {"body": "Invest in air fryers", "score": 4, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "What fund out there is any good? Most of the 1.25x funds out there have major liquidity issues and are a mess at tracking the underlying index", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "That doesn’t address any of the issues I brought up…", "score": 1, "replies": []}]}]}]}, {"body": "I’d buy something that more or less matches my rent if it’s a similar sized space or bigger. Ideally spending no more than 300k in an area with room to grow. I’d take the rest and buy LCID and leave it alone. I’d sell as needed if there was an opportunity to pick up rentals. I’d like to replace my income with rental property and quit my day job.", "score": 2, "replies": []}, {"body": "No differently than I do now, 1-5 stocks. Just would like to increase the 10Y, if you really need 500K after 10Y might want to hold just bonds. If it wont hurt you that you might have less by then then either SPY or if you understand what you are investing in and at least have a corporate finance bachelors go stocks.", "score": 2, "replies": []}, {"body": "If you are renting then you should absolutely put 20-25% down and buy a home instead.  Ignore the millennials whose only experience has been the RE collapse of \\~2008.  Why on Earth would you pay others to build up THEIR capital rather than yours?  Perhaps now isn't the best time, but then stocks are also pricey here.\n\nNot sure where you read that Buffett likes 40% cash.  I'm almost positive that isn't true.  There's no reason to go 40% cash unless you are more of a trader like I am.\n\nReally the best investment right now IMO is a business, but that requires business skill and a solid, solid feel for what works and what doesn't.", "score": 2, "replies": []}, {"body": "All Weather Portfolio", "score": 2, "replies": []}, {"body": "I just turned 32 today, so id probably smash 400k of it into SPY and another 100k into a diversified REIT portfolio.\n\nI still feel like 32 is young enough to drive it into SPY/VOO", "score": 2, "replies": []}, {"body": "I would invest it in the S&P500 Index tracking stocks.  It's a solid long-term investment that rebalances for risk and growth for you.  Assuming a 10-12% return you'll have around 1.3M in 10 years.  I made a spreadsheet, calculator and a [video](https://www.youtube.com/watch?v=e9aag_iPRLo) describing the process of becoming a millionaire. With a 500K starting point you should be able to get to 4-5M in 20 years. On a 40 year horizon you can retire with 30M+ taking a conservative approach. \n\nHolding anything in cash is a waste, esp. if you have an income and don't need the instant liquidity. Financial planners will tell you that the S&P500 isn't a balanced portfolio but these are the same financial planners that can't achieve a comparable return over 10 years.", "score": 2, "replies": []}, {"body": "I'm not going to waste any energy on telling you where to park your money there's plenty of other people who are doing that. However I will impart some wisdom such as for Generations people have been saying housing was too expensive fast forward housing even during the downturn if you held onto it like most of your parents do you will have made %200 to 300%+ on your down payment. As for stocks it has been proven if you put your money in the S&P 500 index and others over long term investing you would have made very nice profits and probably become financially independent. Sometime back when I first started to watch Microsoft it was $43 and it was never going up always going sideways or down and I thought it was too expensive fast forward to today it's a $300 stock. Lots of luck with your investment I hope your returns are enjoyable", "score": 2, "replies": []}, {"body": "I'm 30. I'm putting 250 in spy and 250 in q's and retiring early.", "score": 2, "replies": []}, {"body": "Throw it in NDMO and keep recycling the dividend until retirement.", "score": 2, "replies": [{"body": "That fund has a not so great looking chart. What’s your reasoning that it is a good investment?", "score": 1, "replies": []}]}, {"body": "no dividend stocks?", "score": 2, "replies": []}, {"body": "first. dont make a decision on what to do with $500k based on what u read from internet strangers. \n\ngo buy several books on investing. read, study, and become educated.\n\nwhatever u do, do it slowly and diversify", "score": 2, "replies": []}, {"body": "I’d manage it into some slug lines, a pent house suite in the Luxor or the Aria, blackjack 1k a hand with crystal champagne and a 30yr old whiskey chaser….. all topped off with some ridiculously overpriced escorts (maybe 2 or 3) for one or two hours back at the suite around 6 am…… that would do it nicely", "score": 2, "replies": []}, {"body": "Very interesting!  Taking into consideration that we don't know your age, where you live, your family situation, your knowledge and experience in investing, your educational level, or your risk tolerance,  the answer for each of us factors in those conditions for investing and living.  Since your looking at  10 year horizon I'm assuming your young. You didn't say how wealthy you wanted to become.  With all that I would look at being correct in what I do and stay with big capitalization stocks.  A big influence for me is that I have a high tolerance for risk.  Right now I would put  about 400K into Ford Motor Company and the other 100K into solid proven growth stocks.  Those would be my cash substitutes.  No cash. No real estate.  My first move would be to double my 500K.  FORD  is an easy double by the end of 2023.  How you invest in FORD would be determined by your risk tolerance. If you think what I have said so far is too risky and is not diversified enough, then  you should buy as many shares of FORD common stock as you are comfortable with, paying all cash, and put the shares away for two years.  If you can handle a little more risk, buy maybe 700K of FORD common in a margin account putting up the 400K. For me, and I would never recomend this strategy to anyone else,  I would buy FORD January 2023 Calls, 15.0 strike price,  and write covered calls against that position for two years, taking the premiums and buying more calls going out as new options became available, staying deep in the money. I would spend the next two years studying maybe 100 stocks, and putting together a \"life plan\", and make the next step in about three years depending upon where the country is economically and politically,  and what your personal situation is then.  I would also read books about compound interest and watch YouTube videos by Cathie Woods.  I personally would never invest in a lot of stocks she does, but having said that, I like the way she thinks, and her approach.  For instance,  Tesla is her largest holding.  I love Elon Musk and I think he is one of the most brilliant people on the planet, but I would never Invest in either Tesla or SpaceX . Overpriced and too volatile.  Anyway, I could go on . . . .  Good luck . . . I wish you well !!", "score": 2, "replies": []}, {"body": "40% cash is a complete waste. Keep and emergency fund and go all in on broad market etf’s.", "score": 2, "replies": []}, {"body": "Max your 401k or IRA until fully invested, then convert to ROTH.  This may take you some years and hat remains should at least double your net worth with tax free returns for life for you or your hiers.", "score": 2, "replies": [{"body": "Why not just start funding a Roth IRA? Why convert and pay tax?", "score": 1, "replies": [{"body": "Because while you are working you need to defer taxes.  Why pay taxes earlier than necessary?", "score": 1, "replies": []}]}]}, {"body": "r/thetagang it the whole way making 5k a week until something catastrophic happens and it blows up", "score": 2, "replies": []}, {"body": "Put into long SPY calls since our stock market is broken and doesn’t run on fundamentals", "score": 2, "replies": []}, {"body": "Would YOLO to do a million, probably lose part of it.", "score": 2, "replies": []}, {"body": "Alll on reddddd!", "score": 2, "replies": []}, {"body": "SPY", "score": 2, "replies": []}, {"body": "Probably still not too large a sum to put into strategies on www.stockmixology.com", "score": 2, "replies": []}, {"body": "Given your preconditions, here's my strat:\n\nI'd buy a house, live in it, and renovate it. I'd consider moving to a place like Cleveland, because houses here in Juneau could eat up that whole budget. So whatever is left in cash, I'd probably just sit on and wait for another massive crash, dump it into blue chips, and chill until the next election.\n\nThat seems to me to be the safest route. And if you got a decade to wait, why not do it?", "score": 2, "replies": []}, {"body": "Just got published, I thought it could ft perfectly: The Biggest Mistakes Home Buyers and Sellers Make https://www.wsj.com/articles/biggest-mistakes-home-buyers-sellers-make-11631735058", "score": 2, "replies": [{"body": "What I wouldn't do with 500k: subscribe to paywalled articles", "score": 1, "replies": [{"body": "Hehe, me neither!", "score": 1, "replies": []}]}]}, {"body": "I would finance a house and put 50% in spy and the other 50% I would do the wheel on the safest companies and etfs to pay off the financed house then when it is payed off I would just retire", "score": 2, "replies": []}, {"body": "Start by donating me 10%.", "score": 2, "replies": []}, {"body": "Really well", "score": 2, "replies": []}, {"body": "I would put some into outlet.finance then probably the rest into stocks.", "score": 2, "replies": []}, {"body": "It also as a lot to do with your age / profile. How old are you?", "score": 2, "replies": []}, {"body": "How dumb would it be to place 75% in mutual funds, and 25% in a managed account, all equity mutual funds, with as much of diversification as possible, planning to ride out the dips and waves for 20+ years? You can call me a moron.", "score": 2, "replies": []}, {"body": "Put it all in Shift Technologies, wait 10 years and become very rich.", "score": 2, "replies": []}, {"body": "$100k TSLA\n$100k Bitcoin\n$100k CRSP\n$100k (My dividend hop stocks)\n$50k Ethereum\n$50k Cardano", "score": 2, "replies": []}, {"body": "Keep risking it in oversold stocks.", "score": 2, "replies": []}, {"body": "Invest 100k on something that will give you 10% yearly, and spend this 10k each year on vacation, assuming you go two times per year and spend 5k each time. Invest anither 100k on more riskier stocks and the rest of the funding invest on big promising companies like tesla, apple, microsoft etc.", "score": 2, "replies": []}, {"body": "A lot of money to start and time = dividend paying stocks. Banks and REITS.", "score": 2, "replies": []}, {"body": "Build out emergency fund to what would make you comfortable, whether that's 3,6, or 12 months is up to you. A sliver would go into an international trip whenever COVID is done. Rest would go into the S&P 500 where I'd likely pull out a sliver each year to fund additional vacations.", "score": 2, "replies": []}, {"body": "Use margin and buy 50k shares of America Airlines, then sell on the money CCs every week for a consistent, compounding weekly return of 2%", "score": 2, "replies": []}, {"body": "Never have that much cash in the bank doing nothing. There are much safer places that won’t make you insane amounts but it will be safe. Don’t ever let money sit and not make money.", "score": 2, "replies": []}, {"body": "I would first take care of my past due bills. \n\nThen, the one way I would “splurge” would be by purchasing the entirety of a home office/tech work wishlist I have on Amazon, totaling at approximately $1,500. I would also move into a much nicer apartment or house, but would still not buy a home as I don’t make enough to sustain that kind of purchase right now. (When I say “much nicer,” I simply mean, “not the shoe box that has mold issues I currently reside in,” but also not something ridiculously expensive.) I might be persuaded to change this part of the plan. I might also consider buying a nice ass RV outright, instead. \n\nI would then get help from someone that knows a *lot* more than I do about stocks (I’m still learning) and Roth IRAs and invest accordingly. \n\nI would continue to live off of my monthly income, like I do now, making no big changes (aside from the fact that $3,500/month is more than I currently make *before* taxes, so I’d have a bit more to put into my savings and spending accounts). \n\nI would likely keep 100k in the bank for spending on things we need/want but have been putting off, like a new bed, paying off my car loan ($14k), medical bills etc., and I’d put 150k in savings/my emergency fund (of various types), while investing what was left (the majority). Mostly, this would mean not living paycheck to paycheck for the first time in my life, not having to pick and choose which bills to take care of on a month to month basis, and being able to go grocery shopping without stressing out, while also setting myself up nicely for the future. Isn’t it insane to consider that some people make this amount every year, but if I were to have the same amount given to me just one time, it would change my entire life? I spend a lot of time thinking about stuff like that.", "score": 2, "replies": []}, {"body": "Stick it in QQQ", "score": 2, "replies": []}, {"body": "I just realized I'm actually doing this already...\n\nThe large majority is in S&P 500, some in international, some in semiconductor ETF. Small amount is in MSOS, ARK funds, and TAN. I have an individual account with ~$170K that I do options on to earn income, highly recommend that if you'd like income from the stock.", "score": 2, "replies": []}, {"body": "Buy a rental property. Set aside 6months of savings.\nRemaining in VOO, ARKK, VNQ, VHT. Don't time the market just buy it when u have cash.", "score": 2, "replies": []}, {"body": "400k to IBM, and 100k to growth stock.", "score": 2, "replies": []}, {"body": "Most people don't realize their largest asset is actually their future income. If I was you I'd do a couple things:\n1. Get with a financial advisor and tax advisor \n2. Spread your money out smartly with the help of professionals. \n3. Your still young, look into and lock in a \"Return a Premium\" life insurance policy can do 10/20/30 yrs (trust me you want to get locked in before you're uninsurable) \n4. I wouldn't put all your investments in 1 ETF. Pick a couple. Do an ESG one, an overall market one, a blue chip one, etc. \n5. 2.5%-5% as \"play money\" as the other bright gentleman said \n6. I would only keep 30-40% in cash. Cash does not earn interest. In my opinion it's better to be fully invested but the cash position in short-term safe assets than purely in just cash. \n7. Open a Roth IRA if you don't have one and max out EACH YEAR YOU CAN", "score": 2, "replies": []}, {"body": "I would go all into spx500 and then go to sleep", "score": 2, "replies": []}, {"body": "Buy a property so you don't have monthly shelter expenses", "score": 2, "replies": []}, {"body": "50k in Apple, 50k in Microsoft, 50k in Amazon, 50k in Google, 25k in NVIDIA, 25k in AMD\n\nThe rest 250k in cash to DCA with", "score": 2, "replies": []}, {"body": "Poorly. Judging by how I’m handling my current portfolio, I would probably handle that one poorly.", "score": 2, "replies": []}, {"body": "Tezos", "score": 2, "replies": [{"body": "What is that? An nft company? I saw them advertising NFT on youtube", "score": 1, "replies": []}]}, {"body": "With the help of an advisor", "score": 2, "replies": []}, {"body": "S&P 500. Set it and forget it.", "score": 2, "replies": []}, {"body": "put it under the biggest mattressI could find, like maybe a California King sized one.", "score": 2, "replies": []}, {"body": "Move to the Philippines and live the rest of your life filled with hoes and 12 houses that you can rent out to people or just put it Spy 500 and live your life in peace ✌️ you can literally drink and not have to worry about anything at all whatsoever.", "score": 2, "replies": []}, {"body": "I would let my good friends at the ree ree sub dictate what to do", "score": 2, "replies": []}, {"body": "Day trade and swing trade and make a metric fuck tons!!!", "score": 2, "replies": []}, {"body": "I would buy a house. Not all in cash. But at least a 20% down. That’s generally the number one way to provide wealth in the long run. plus, you pay yourself every month with the mortgage payment. Take the remaining $400,000 and invest into SCHD/JEPI/DGRO/VLUE and use those dividends to pay the mortgage if you want.", "score": 2, "replies": []}, {"body": "scared money no make money, find a play, that you have 100% conviction that it will move a direction and go all in.  whether its up or down. must win!", "score": 2, "replies": []}, {"body": "Put it in the Spx for a year. Not all of it of course", "score": 2, "replies": []}, {"body": "Keeping about 3-4x your salary in the bank just because seems imprudent to me. Nothing to do with a crash at all. \n\nI might take 200 out to redo our home search, this time with a much bigger down payment that would let us get some more space.", "score": 2, "replies": []}, {"body": "I'd buy a house in _________, California and wait ten years.", "score": 2, "replies": []}, {"body": "Shitload of blow. Hookers too.", "score": 2, "replies": []}, {"body": "15% cash. 10% in gold and silver ( physical). 50% stock etf ( all world ), 20% bond etf ( something that has both corporate and government  bonds).5% for something a little bit more risky: find some promising mega trend for the next 10 yrs and buy a couple of growth stock.", "score": 2, "replies": []}, {"body": "I just YOLO'ed more than this into AAPL and tanked the stock. I didn't think it was possible for my bad juju to tank a large company like AAPL... but my bad juju knows no bounds!\n\nBut I will hold this for 10 years and will probably do very well.", "score": 2, "replies": []}, {"body": "This isn’t going to be a popular answer but I inherited money in 2020 and just let some financial advisors that I trusted run the account. It is doing way better than I imagined and I don’t ever worry about it. That account acts as a stabilizer and then the money I invest from my income can be used for the more risky stuff which is the fun part anyways. \n\nIf that is not your cup of tea you can always start with the boglehead strategy and branch out from there.", "score": 2, "replies": []}, {"body": "Markets conditions are feeling very toppy. Valuations are stretched and cannot be sustained IMO. Liquidity is slowing down, with even more liquidity leaving the market as the Fed tapers and then stops QE. \n\nI would not keep the 200k in your bank. This money is being eaten by inflation. While I am cash right now in my account, I am waiting to deploy it once valuations come back to reality. I am also going long/short on earnings and certain trades. \n\nOne thing to consider is just making a little bit. You do not need to go way out on the risk curve. If you can keep the money it will change your life as you can get yield off it. So much of WSB yolos their funds until they lose them and never cash out. \n\nBonds are trash. You need to be in equities or waiting to be on equities on a dip. I think the S&P is the only thing that was not corrected this year but sentiment is very bearish. Everyone is calling for a correction. \n\nAdvice: stand by and wait until we hear from the Fed. We also need to know what is being done about the debt ceiling, and what the tax situations is going to look like. Tax increases will dramatically hurt earnings. So will inflation. \n\nEdit: I am sitting on 850k in cash.", "score": 9, "replies": [{"body": "To you I say . . .  look at FORD!  Look at product line and demand.  FORD owns something like 10-15% of Rivian, which will go public in the next 6 months and a large interest  in many other high tech and automotive companies.  I don't  think you have any downside risk investing in FORD.", "score": 3, "replies": [{"body": "This I will agree with. But I will also say Ford has been trading flat for awhile. Investors are not interested in buying “boomer stocks”. Same with GM. Ford is a value stock in my mind.", "score": 2, "replies": [{"body": "I think Ford is really cheap right now too", "score": 1, "replies": []}]}]}, {"body": "Yeah i know having a lot of cash on the sidelines is tough...", "score": 4, "replies": []}, {"body": "I just liquidated all my ETFs (S&P500, IQQQ) and stocks exactly because of this. The gains this year make me happy enough to sit on the cash for a few months without worrying about inflation.\nI am still looking for a great low-risk inflation hedge though.", "score": 2, "replies": [{"body": "Play earnings! Do not look at earnings as a coin flip. Companies are paying higher wages while facing high costs. These companies will miss expectations while some will hit. You can get quite a bit of yield if you know what you are doing. Equity valuations need to come way down", "score": -6, "replies": []}]}]}, {"body": "100k into a house for yourself or a 2nd home / vacation home and VRBO it.\n\n400k into USDC @ 12% a year\n\nDone and done.", "score": 5, "replies": [{"body": "This guy knows what's up. \n\nWhere's your 12% usdc I can only find 8.7 tops now", "score": 2, "replies": [{"body": "CDC with card rewards on a 3 month lock up", "score": 1, "replies": []}]}, {"body": "Usdc where, Coinbase?", "score": 1, "replies": [{"body": "Cb pays the least atm for usdc", "score": 1, "replies": []}]}]}, {"body": "Spend all of it in 3 months and off myself", "score": 4, "replies": []}, {"body": "Two words.  Options trading.  You’ll either be multi-millionaire or on welfare.  Good luck.", "score": 3, "replies": []}, {"body": "Lambo", "score": 2, "replies": []}, {"body": "I’d spend half buying shares and calls for GME. The other half go all in buying shares of ABT", "score": 2, "replies": []}, {"body": "Hook and blow", "score": 3, "replies": []}, {"body": "No one here can say what to do with your money because it depends on YOUR goals. If you said I have 500k and I want to invest half relatively safely with a 10% YoY yeild for the next 20 years then people would be able to give you decent advise.", "score": 2, "replies": []}, {"body": "Real Estate. In my opinion best way leverage and create passive income. If your smart u can easily buy Realestate for 1.5 up to 2 Million with 500k.", "score": 2, "replies": [{"body": "That's a lot of mortage he has to deal with which makes it a bit riskier.", "score": 3, "replies": [{"body": "That’s y he only lends 66% - usually I try to lend 100%. But at the end that’s the beauty of this strategy, u can adjust it to your personal „willingness to take risks“ and can lend only 50% or 33% or nothing.\nIn my opinion it’s less riskier to lend 66% than 33% or nothing, because you end up with more apartments, with distributes the risk.", "score": 1, "replies": []}]}]}, {"body": "Why not just buy 500k of Berkshire Hathaway and call it a day.  Its very likely BRK will do better than the ETF and probably a lot better than 200k cash in a bank and since they have a range of investments, just buying them alone already gives you good diversity and access to one of the most brilliant stock pickers/ money managers of all time.  Its true that even BRK has down years, but with a 10 year time horizon, that's enough to ride out the short term fluctuations.\n\nIf it were me, I'd invest it in about 15 different stocks (or stock like things) I like, but I've got enough experience doing this that I can avoid most of the mistakes and get a good return.  I wouldn't put that much of it in BRK because I figure I can invest 500k better than even Warren Buffett can invest 100 billion - this may or may not be true.", "score": 2, "replies": []}, {"body": "i would save 100k and throw the rest in $clov cuz #fuckit #fullsendornosend", "score": 2, "replies": []}, {"body": "Give it to my dad", "score": 2, "replies": []}, {"body": "I would spend \n100ooo on a house.\n 100000 bugger sugar for me.\n 100000 on Asian hookers.\n 100000 on H for the hookers (I don't do drugs)\n99979 on weed\nAnd 20 on weed stocks\n1 dollar to snort the coke thru", "score": 2, "replies": []}, {"body": "If this the position your in and you would like to get into a passive investment pm me and I can tell you about what field of work I’m in fill you in on what it takes and the roi not asking for you to send me no money or some scam shit lol", "score": 2, "replies": [{"body": "Invigeron?", "score": 1, "replies": [{"body": "No mmj", "score": 1, "replies": []}]}]}, {"body": "Put it all on $lcid", "score": 2, "replies": []}, {"body": "Take $50,000 out as an emergency fund. Should cover a year or worth of expenses just in case. $300,000-$400,000 buy a house outright. Throw the rest into VT or VOO. Now you have no rent, $3500 a month $500 for property tax, $500 for groceries, $500 to Roth IRA to max it out yearly, $300 to HSA, $700 for cars and insurances and maintenance, $500 eating out, and you’ll have $500 left to put into whatever jar you want (vacation fund, kid’s college, taxable account, fun money).\nNow this might not bring the most ROI on money but you basically just live on zero stress from now on. No debt, no mortgage, stable income, fully utilized tax advantage investment vehicles, and still have money leftover each month? Sounds good to me.", "score": 2, "replies": []}, {"body": "Right now, buy GameStop.  \n\nAfter the crash. \nBuy blue chip dividends", "score": 2, "replies": []}, {"body": "I'd start off by buying a modest house. Even if you lose the rest, you still have a home and a steady income. I know you said you didn't want to buy a house, but how much of your income goes to rent a month? That's just gone and you have nothing to show for it.", "score": 2, "replies": [{"body": "He does have flexibility with renting though. With a home you are stuck there for a long long time. Not saying you’re wrong, but people always act like there aren’t any pros to renting. It’s inferior to owning generally but there are some perks", "score": 1, "replies": []}]}, {"body": "I would buy a small house for around 150-200k. You are losing so much money paying rent and owning nothing in return. Put half of the remaining money in VTI and then a little ARKK and QQQ or individual stocks.", "score": 2, "replies": []}, {"body": "SPY Call, Same day expiry, otm", "score": 1, "replies": []}, {"body": "250k in Tesla. Sell covered calls against it for 10%+ cash generation. 100k in Bitcoin. 100k in Ethereum. 50k in a crypto called Luna ;) Not financial advice, this is just similar to my portfolio split!", "score": 1, "replies": [{"body": "Why luna? I like vtho", "score": 1, "replies": []}]}, {"body": "I would put most of it in a savings account. Investments are only for money I can afford to lose. I feel a lot more secure if most of my money isn’t in a place where it could be lost.", "score": 1, "replies": []}, {"body": "Qqqm / Vgt mainly with some qqqj , smh , Arkk , BTC.", "score": 1, "replies": [{"body": "Doesn't seem very diversified.", "score": 1, "replies": []}]}, {"body": "Buy a home, wait 6 months to a year then use your equity to build a diversifed portfolio of investments that you feel will yield a good return over your ten year goal.", "score": 1, "replies": []}, {"body": "$3500 a month? Wtf dude?!", "score": 1, "replies": []}, {"body": "Buy a house.", "score": 1, "replies": []}, {"body": "Buy a house", "score": 1, "replies": []}, {"body": "I would put more than 60% in stocks (like ETF's). If I thought I was smart enough, I would time the market, and move money between cash and stocks. I would diversity with more than just two ETF's and mutual funds. If Congress passes the $5.5 trillion spending debacle, I would scrap those plans, and invest the best way I could to deal with hyper inflation.", "score": 1, "replies": []}, {"body": "Doing the same thing I’m doing now", "score": 1, "replies": []}, {"body": "Before you invest, wait. As the market is going right now, there seems to be a 10% 20% correction.", "score": 1, "replies": []}, {"body": "Ban me cuz I know this is the stock sub but All I can think of is Defi staking but that’s just me. Making 10k a month on a 100k staking is pretty damn nice. Can’t get that with stocks. Research it. I’m not saying throw it all in but do your research and decide.", "score": 1, "replies": []}, {"body": "I would put it into government bonds. They yield less than stocks, but has the advantage of providing passive income with literally zero effort. The other option would be to wait for the next barish of the real-estate market and spend the money on some sweet deals. TL:DR: not on stocks at all.", "score": 0, "replies": [{"body": "Or just sit it in the SPY  asap because it’s just as passive as bonds (while actually making money) and being time IN the market beats TIMING the market.", "score": 2, "replies": []}]}, {"body": "Me personally? I would buy stocks and write covered calls on them. \n\nIf I was as worried as you are about a crash you can try to do zero cost collars or something similar for downside protection. \n\n500k is a lot and you can accumulate enough shares to be able to make them work for you", "score": 0, "replies": []}, {"body": "I always imagined this,,, i will buy super duper deep in the money calls leaps on spx,,, like the last available ditm call with 99 or so delta,,, will keep it rolling yearly", "score": 0, "replies": [{"body": "How does that end up looking retroactively, just curious? If you didn’t do this frequently, I.e. every month instead of every day, is there a potential for you to just get the timing wrong by chance or would that not matter much?", "score": 1, "replies": [{"body": "It is a big risk, and timing can be wrong.", "score": 1, "replies": [{"body": "If you had enough money to open one every week or minute for maybe ten years would that level out the risk and amplify gains versus just buying the stock?", "score": 1, "replies": [{"body": "Not sure. options and stocks are like apple and oranges, both are different games", "score": 1, "replies": [{"body": "So what’s the appeal of a deep ITM call?", "score": 1, "replies": [{"body": "Same as any other options strategy…", "score": 1, "replies": []}]}]}]}]}]}, {"body": "\" ,,, \" isn't grammar btw. It's noise.", "score": 1, "replies": []}]}, {"body": "Very carefully", "score": 0, "replies": []}, {"body": "Cash gang till the bubble bursts", "score": 0, "replies": []}, {"body": "I'd pay my house off, get an education so I can get a job that pays way more than 3500 / month, and invest what's left over spread across 70% low risk, 30% higher risk stuff.", "score": 0, "replies": []}, {"body": "Is hire a wealth consultant", "score": 0, "replies": []}, {"body": "sell options on mega cap stocks with good fundamentals", "score": 0, "replies": []}, {"body": "Invest most 99.99% on an up and coming company like Lucid motors", "score": 0, "replies": []}, {"body": "Art.", "score": 0, "replies": []}, {"body": "Gamble all of it into $CEI hoping it hits $5", "score": 0, "replies": []}, {"body": "I would drive around in a G-wagon, and take it off road sometimes.", "score": 0, "replies": []}, {"body": "As of right this moment....I'd keep about 50k cash. I'd put 100k into gold (probably $OUNZ), buy 100 SPXS 16 calls for Jan 19 2024, 200k into Gamestop (split 25/75 between Fidelity and Computershare), and 50k into AMC. But that's just me.", "score": 0, "replies": []}, {"body": "If i was given 500k and was making 3500 a month i would save the 500k for retirement and not stress in the meantime", "score": 0, "replies": []}, {"body": "First off...need to have tax strategy as well as investment strategy. \n\nInvestigate how much you can invest in your Roth, and fun max your 401k/HSA. \n\nOver ten years get as much as you can into a Roth, and 401K. \n\nInvestment choice....easy. Just be the market. SP500 fund, Nasdaq Fund, etc. Very little cash. Have a Credit card for emergencies.", "score": 0, "replies": []}, {"body": "Probably rent Alcatraz and do a Hawaiian Tiki theme party just to flex my muscles to a bunch of Silicon Valley assholes", "score": 0, "replies": []}, {"body": "I’d buy some real estate for sure!\n\nBut that’s just me.", "score": 0, "replies": []}, {"body": "Normally I would keep about 10 k liquid and put the rest in low fee index funds to s and p and nasdaq\n\nBut with a crash inevitably coming, I would do that with zero to 25%, and start dollar cost averaging in 5 % a month after at least a 30 % correction\n\nAlso, consider buying a small place to live with current very low mortgage rates", "score": 0, "replies": []}, {"body": "Not financial advice. \n\nIn a bull market, Buy shares in lots of 100 in bluechip stocks. Sell calls for weekly/monthly premiums.\n\nIn a bear market, buy the dip and DCA over time. Slowly accumulate shares. Possibly sell puts to acquire shares for discounted prices. \n\nMange your risk based on your personal tolerance.", "score": 0, "replies": []}, {"body": "SPY, QQQ,  VT, XLRE, XLV, GOOGL, AAPL, GOOG, NFLX, NVDA, AMD, MSFT, SQ, SE. Cash, Treasury Notes, Crypt o.", "score": 0, "replies": []}, {"body": "In such positon I would look for inverse correlation and additional income via covered calls in my portfolio.\n\nFor example I would set up a portfolio made of three buckets:\n\n1) safe haven - AAPL, MSFT, etc. (but not really whole FAANG)\n\n2) meme stocks - this is not a joke as those tend to behave in opposition to the market, so in case of crash, they should be protecting the portfolio - (GME, AMC, CLOV). Also, they are quite volatile, so there a good premium for writing a covered call.\n\n3) speculative or beaten up stocks with great potential - uraniun, China companies, EV, etc.  - here you can write a CC during a heavy bull run to gain good premium or just wait for a good/target price.\n\n&#x200B;\n\nYou can like spent 30-50% to try it and I think you would do pretty well.", "score": -1, "replies": []}, {"body": "NFTs bruh", "score": -4, "replies": []}, {"body": "I’d put some in some solid dividend paying stocks", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": []}, {"body": "I’d invest in stocks.", "score": 1, "replies": []}, {"body": "Right now, I'd just slowly put money in and see what's up with the Fed taper and this Evergrande stuff, apparently they have their hands in a LOT of stuff and we may not see them get bailed, or even if they do, China could default on a few things they owe money to.  Cash could be king for the next few months, might be able to buy at much cheaper prices.   If the Fed says they won't taper and there's a big pop, then I'd probably put in a big chunk ASAP to broader market ETFs and maybe some of the beatdown growth stocks, some of the ARK Moonshot ETFs etc.", "score": 1, "replies": []}, {"body": "VTI mostly, VOO, some SCHD and walk away.", "score": 1, "replies": []}, {"body": "ETF and REITS 80% of them and probably 20% into something like Microsoft and then work for one or more year at my job and then quit and live off my dividends or in my case would work on my projects and passions and try to make money through them, since I now have a safety net.", "score": 1, "replies": []}, {"body": "Tqqq", "score": 1, "replies": []}, {"body": "Wear you suggest if the best option in this market. I would wait the year out to buy indy the funds as there may be more volatility on the horizon. Cash is safe for now. I would not make any major moves until China evergrande debacle is resolved or the fed makes a final decision on bond buying programs.\nNot advice, just me rambling  out loud.", "score": 1, "replies": []}, {"body": "Same way I would manage 5k or 10k- 90% stocks/ 10% bonds, rebalance yearly or every 6 months.", "score": 1, "replies": []}, {"body": "QQQ and then sell covered calls against it using the same formula that QYLD uses. Use some of the profit to buy puts with a goal of 7% return per year. After ten years you’ll have a million dollars and you can just move it all to SPY and do a 4% draw forever.", "score": 1, "replies": []}, {"body": "200k in the quadfecta. 200k in a target date fund. 100k in option/thetagang plays.", "score": 1, "replies": []}, {"body": "I’m in close to the same situation. I would trade the 500K account, but that’s after years of study. Maybe a growth stock ETF or MF.", "score": 1, "replies": []}, {"body": "Take from the 500k enough to pay your bills for 9 months. Split the remaining into 33% cash, 66% stocks or investments. I’d just buy SPY. And I’d sell CSPs against SPY that are ATM to enter the market and also with the 33% cash I would sell CSPs at a way OTM price, the goal being to just get some interest and only get assigned if there is a fire sale. Otherwise, rebalance the cash and stock.", "score": 1, "replies": []}, {"body": "> Assume it's all your net worth and **you don't have other assets like property**, just a job with a monthly income of $ 3,500 after taxes.\n\nfor starters, fix that.\n\n> I would continue renting since I am not interested in buying properties as prices are through the roof. \n\nthe problem with this logic is that just because they are \"through the roof\" doesn't mean they will come down. waiting will likely just cause you to pay more. not that memes should dictate these kinds of decisions, but there was a meme recently that sums it up perfectly. it had the caption \"buyers waiting for the housing market to crash\", then it had \"buyers: <annual team photos of tom brady over the last 20 years\".\n\nrenting is just throwing away money. you could be putting that money towards something you own rather than putting into something that someone else owns.", "score": 1, "replies": []}, {"body": "I'd buy a rental", "score": 1, "replies": []}, {"body": "Read \"Your Complete Guide to Factor-Based Investing\" by Larry Swedroe \n\nChoose a factor allocation\n\nEither identify vehicles to tap into the factors yourself or have someone help you do the same\n\nSpeak to a tax adviser as to the most tax efficient way to invest in your chosen allocation\n\nInvest 90%, leaving 50k as a rainy day fund (16 months off work with no change in lifestyle)\n\nUse any income from investments to bring portfolio back to target allocation\n\nUse any windfalls to do the same\n\nRetire when monthly income from investments are twice current after tax take home income", "score": 1, "replies": []}, {"body": "If you're in an area where houses can be had for 500kish, I'd get a duplex, for $1m, 200k down. Live in one side, rent the other.\n\nThe other $280k go all in s&p index. Don't bother with bonds, they are pointless on this 10yr horizon. I guarantee you it will be up from where it is now in 10 years even if temporarily goes down by 30% in the middle.\n\n$20k cash emergency fund. Cash is trash but you need to have enough on hand to deal with new roof kind of problems.", "score": 1, "replies": []}, {"body": "10 years? \n50% - SPY S&P 500\n20% - QQQ tech Nasdaq\n10% - gold \n20% - MSCI world index\n\nGo back to work for 10 years... \nRetire rich.", "score": 1, "replies": []}, {"body": "People keep suggesting ideas that are way to complicated. Buy a etf that pays a decent dividend but still grows overtime. Literally 5 seconds of work and have fun spending the dividend on your life. Maybe put some divs back in but enjoy life and no work at all", "score": 1, "replies": []}, {"body": "I’d just buy SPY.", "score": 1, "replies": []}, {"body": "Buy land, take a mortgage and build a house.  This gives you security and credit.  Let's call that $150k.  Keep $50K liquid for emergencies: HYSA, liquid CD, etc.  Spread the remaining $300k over VOO, VTI, and maybe an international.", "score": 1, "replies": [{"body": "where can you buy land and build a house for 150k?", "score": 3, "replies": [{"body": "Lala land 😂😂😂", "score": 2, "replies": []}]}, {"body": "You can't even buy a bathroom for $150k in LA lol. If this guy makes $3500 after taxes and says he has no chance on buying a house I'm sure he lives in a city.", "score": 1, "replies": []}, {"body": "Here in central Florida, you can still buy 5 acres for $50k-60k.  $90k for a deposit on a $200k mortgage to build the house.  My house cost $145k to build 10 years ago - 1690 sq ft on one acre.  Total cost - less than $200k.", "score": 1, "replies": []}]}, {"body": "I would use it to buy rental properties in an area that people vacation at and vrbo them. Interest rates are still at the lowest in history and they are only going to go up.", "score": 1, "replies": []}, {"body": "Buy a home for Airbnb in Salamanca NY, sell cash covered puts on robinhood stock. Repeat", "score": 1, "replies": []}, {"body": "I would run a massive wheel farm", "score": 1, "replies": []}, {"body": "Similar to this but more aggressive. I'd probably also invest in real property for rentals and set up recurring revenues outside of stocks. Get square on some federal debts. And I'm going to Greece.", "score": 1, "replies": []}, {"body": "Honestly, I would go with a brokerage. Fwiw, I am very happy with investment firm.", "score": 1, "replies": []}, {"body": "AGNC", "score": 1, "replies": []}, {"body": "Draftkings.  Not the stock. A 5 leg parlay.", "score": 1, "replies": []}, {"body": "Dump it all into SDC monday premarket.", "score": 1, "replies": []}, {"body": "I have a bit more than that. I have delta, Boeing, palantir, stn,  bank of America, rklb, spy, airbnb, and a few mutual funds. I also have about 5k in options per year.", "score": 1, "replies": []}, {"body": "Id buy dividend stocks, keep 20k on a seperate bank account known as emergency fund.", "score": 1, "replies": []}, {"body": "I think I may just buy a house first out right, and make an emergency fund and say screw it. A fully paid off house is really hard to beat in my opinion. I realize you can make more through stocks but the security of a fully paid off house would make you sleep like a baby at night and is still a appreciating investment.", "score": 1, "replies": []}, {"body": "Give it to me and I will show you", "score": 1, "replies": []}, {"body": "Voo", "score": 1, "replies": []}, {"body": "Simple.  Whoever’s paying the biggest dividend with hope it will always be going up.  Collect those checks.", "score": 1, "replies": []}, {"body": "Buy $200k of Amc 100k on oct 15 SDC 8-9 strikes 200k real estate", "score": 1, "replies": []}, {"body": "Wayyyyyy too much cash. 10% cash is all you should keep MAX. If you are pessimistic of the stock market, you may look to things like bonds from very healthy companies like Apple.", "score": 1, "replies": []}, {"body": "Index annuity", "score": 1, "replies": []}, {"body": "Yeah I would risk about 70% of it.", "score": 1, "replies": []}, {"body": "So you to waste so much purchasing power with holding cash in an inflation rich environment lol. This is such a lazy post.", "score": 1, "replies": []}, {"body": "I’d keep 6 months of expenses on hand, take another 5-10% for spending money, take another 10% to use as a capital call reserve, and then put the rest into multi family housing. The right development groups generate 10-15% annual returns and you can use the depreciation to offset taxes. If the same developers are worth their salt you’ll also be able to get tax credits and other tax benefits from things like solar power and possibly special financing from local government. The trade value of the equity itself will increase 3-4x. In other words $375,000 of invested cash into stabilized Multifamily housing would generate $45,000 a year + tax benefits and if the property or your equity in it was ever sold, you’d like make $700,000 to $1,000,000 depending on the market cycle and prices at the time.", "score": 1, "replies": []}, {"body": "Buy a house outright, keep 6 months living expenses in cash, and the rest in gold, silver, and platinum. Every month I’d add to the metal stack, not worry about the market and be happy.", "score": 1, "replies": []}, {"body": "0 DTE SPY puts", "score": 1, "replies": []}, {"body": "Do exactly what you did but only hold 20-25k in the bank", "score": 1, "replies": []}, {"body": "10 years in length could be very limiting. You’d need to invest in relatively safe investments. If your time line was 20, or more, years then it opens up a lot of additional options.", "score": 1, "replies": []}, {"body": "Risk it all on SPY Weeklies", "score": 1, "replies": []}, {"body": "Buy a house and at least have a roof over your head, pay off debts if I had any, and invest the rest, plus have some cash on hand just in case.", "score": 1, "replies": []}, {"body": "I would have dinner with Jay Z", "score": 1, "replies": []}, {"body": "here's how I manage my money.\n\nSet aside a emergency fund for atleast 6months of expense. 10% cash, 10% LEAPS in semiconductors sectors (preferably monopolies like $ASML and $TSM), 10% option income strategy (CC,CSP,Wheel strat), 30% small cap equal weighted etf $EWSC, 30% $VOO/$SPY, and lastly 10% of your favorite company (I believe investing in something you like and use everyday, and it general makes investing more fun). \n\nwhy this allocation? \n\n60% in small cap and large cap is somewhat a normal allocation for long term. the reasoning for equal weighted in small cap is because I don't think there is a particular winner that justifies a bigger allocation with its market cap so far. It would make more sense to have them equal weighted to obtain a consistent return with lower volatility. and SPY is just your staple great long term etf. \n\n10% in cash is great for buying dips or the gamble itch. The idea is sometimes you get that FOMO but you can't quite shake it off, but you also don't have spare cash. you might be thinking of selling some of your stocks for you gambling rush, and that would end up realizing some of your gains and is taxable. IF your not a gambling addict and frequent wsb browser, having a 10% cash on the side is great when new deals come up. overcorrections and dips are easy money for you to pick up. \n\n10% in $ASML and $TSM because these are the bottlenecks to your major tech company products. First movers advantage, high margin, cash cow. atleast 1yr to expiration on the call. Preferably, ITM calls, and roll it forward when its about to expire to take profit. \n\n10% option income (this requires a more active role in it, if you prefer something more passive you can just do dividends, or make it 40% SPY). theta gang strat, look for high IV to sell, avoid low liquidity. aim for 5-10% in the first year. take a more conservative approach to it.\n\n10% in your favorite stock. This should be something you know very well, it can be something related to the industry you work in that you have more insight than others. or it could just be your favorite brand. for me, I bought $SHAK, because I love their shack burger and its simple as that. \n\nhave fun.", "score": 1, "replies": []}, {"body": "Keep some money between 50k-75k in cash. \n\nBuy a multiple rental unit place and live there, then lease a new car. Invest the rest of the money into stuff. Mostly AMD/msft/apple/AMZN/nvda.", "score": 1, "replies": []}, {"body": "Robo-traders.\n\n[Schwab Intelligent Portfolios](https://intelligent.schwab.com/)\n\n[Marcus Invest](https://www.marcus.com/us/en/invest)\n\n[Fidelity Go](https://www.fidelity.com/managed-accounts/fidelity-go/overview)\n\netc. \n\nObviously put like 6 months worth of expenses in to a high interest savings account, just in case. Beyond that, high interest savings are really useless right now since the FED refuses to raise interest rates. The best of the high interest savings accounts earn like 0.50% right now. And property is highly volatile / over valued.", "score": 1, "replies": []}, {"body": "Be a full time daytrader! Glta!!!", "score": 1, "replies": []}, {"body": "$500k worth of weekly options.", "score": 1, "replies": []}, {"body": "I would put it all in the stocks and like others are saying in broad ETFs. There is no reason to increase your emergency fund if you already have one.", "score": 1, "replies": []}, {"body": "Personally. \nIf I had debt I'd pay that off first. I don't so I'm not factoring that in. If I didn't have a 6 month emergency fund I'd fund that as well, I do so I'm not factoring that in either. \n\nIf I didn't have a retirement account I'd open a roth IRA and max out this year and last year in either VTSAX or VFIAX . That's only 12k.  \n\nI'd want to keep some cash Just for a market crash. I like to use 10-30% so let's split that and save 20% (100k) JUST to deploy whenever there is a correction. You'll need a watchlist of stocks you like or you could just plan to buy the SP500 steadily over time and a little more when it corrects. \nSo that's 112k down, 388k left.\n \nAgain this is personal. Not financial advice. \n\n100 shares of TSLA, for 75k. Then I'd sell covered calls on those to increase portfolio value and lower cost basis. I like TSLA for the next 10 years. So even if my covered calls go in the money I'd roll them or execute and just sell cash secured puts on TSLA (look up the wheel strategy for more info.) Very lucrative on Tesla. \n\nPretty sure I can't mention it in this sub without this getting deleted. But I'd want to be in a certain \"alternative\" asset. \n50k in the first highest by market cap and 50K in the second highest by market cap. I think this asset will do well in the long term\n\n213k remaining.\n\nPersonally I'd use up 100k of that on real-estate. I'd find a $350k - $400k single family home or duplex, put 20%down so 70-80k.  If it's in good enough condition as is. Rent it out.  You'll have passive income and someone else paying down your mortgage. Just put asside enough for taxes and repairs. If it's not in good enough condition use the extra 20-30k to fix it up a bit first. \n\n113k remaing. \n\nAssuming you now have no debt. Maxed out tax advantage funds, an emergency fund, cash on the side for a market correction, \"alternative\" assets, and real-estate generating passive income. \n\nIf you are a simple pain free kinda guy, throw that last 100k into the SP500, or into some dividend aristocrat ETF.  If you want to maximize your return and do some research, try your luck, pick a basket of 8-12 individual companies and invest the 100k throughout them. \n\nYou've got 13k remaining. A solid portfolio. Plenty of cash. Buy yourself something nice. I recommend a stainless steel Rolex at MSRP if you can find one. It'll go up in value the day you buy it and it's a great piece to own.  If you're not into watches. Do whatever you want with the 13k", "score": 1, "replies": []}, {"body": "First, set up an emergency cash account with $10-20k emergency cash. Next, invest the rest into a low-cost, diversified index fund. After that, sit back, relax, and watch your money grow in a safe, diversified, manner.", "score": 1, "replies": []}, {"body": "Have your emergency fund. Be boring with elf's but maybe sprinkle in some aggressive ones too. Also, make sure you dollar cost average the initial lump some over a few months. It is the way.", "score": 1, "replies": []}, {"body": "30% in stocks. 20% in savings. 50% on a rental property, or possibly a couple of flips first.", "score": 1, "replies": []}, {"body": "VWRL or any other world index with no more than 50-60% US and more than 2000-3000 stocks", "score": 1, "replies": []}, {"body": "How old are u", "score": 1, "replies": []}, {"body": "Personally. \nIf I had debt I'd pay that off first. I don't so I'm not factoring that in. If I didn't have a 6 month emergency fund I'd fund that as well, I do so I'm not factoring that in either. \n\nIf I didn't have a retirement account I'd open a roth IRA and max out this year and last year in either VTSAX or VFIAX . That's only 12k.  \n\nI'd want to keep some cash Just for a market crash. I like to use 10-30% so let's split that and save 20% (100k) JUST to deploy whenever there is a correction. You'll need a watchlist of stocks you like or you could just plan to buy the SP500 steadily over time and a little more when it corrects. \nSo that's 112k down, 388k left.\n \nAgain this is personal. Not financial advice. \n\n100 shares of TSLA, for 75k. Then I'd sell covered calls on those to increase portfolio value and lower cost basis. I like TSLA for the next 10 years. So even if my covered calls go in the money I'd roll them or execute and just sell cash secured puts on TSLA (look up the wheel strategy for more info.) Very lucrative on Tesla. \n\nPretty sure I can't mention it in this sub without this getting deleted. But I'd want to be in a certain \"alternative\" asset. \n50k in the first highest by market cap and 50K in the second highest by market cap. I think this asset will do well in the long term\n\n213k remaining.\n\nPersonally I'd use up 100k of that on real-estate. I'd find a $350k - $400k single family home or duplex, put 20%down so 70-80k.  If it's in good enough condition as is. Rent it out.  You'll have passive income and someone else paying down your mortgage. Just put asside enough for taxes and repairs. If it's not in good enough condition use the extra 20-30k to fix it up a bit first. \n\n113k remaing. \n\nAssuming you now have no debt. Maxed out tax advantage funds, an emergency fund, cash on the side for a market correction, \"alternative\" assets, and real-estate generating passive income. \n\nIf you are a simple pain free kinda guy, throw that last 100k into the SP500, or into some dividend aristocrat ETF.  If you want to maximize your return and do some research, try your luck, pick a basket of 8-12 individual companies and invest the 100k throughout them. \n\nYou've got 13k remaining. A solid portfolio. Plenty of cash. Buy yourself something nice. I recommend a stainless steel Rolex at MSRP if you can find one. It'll go up in value the day you buy it and it's a great piece to own.  If you're not into watches. Do whatever you want with the 13k", "score": 1, "replies": [{"body": "For what it's worth this is basically me.  No debt, 1 year of all living expenses set asside, I've got a rental property, all tax advantage accounts are maxed out in either VTSAX or VFIAX, about 15 individual stocks, plus some \"Alternative\" assets (again don't want to get deleted for mentioning). I keep 10-30% of my net worth in cash and use it to buy assets when they drop in price significantly. And I sell cash secured puts and covered calls on (some of) my individual positions.\n\nI'm up 180k in the last 12 months so.. your mileage may vary. Not financial advice.", "score": 1, "replies": []}]}, {"body": "Pay off my house and my low credit card debt put some in my retirement and put some in savings and continue to live my life but at a more comfortable pace...", "score": 1, "replies": []}, {"body": "When I get to that point in my life, I’ll let you know, until then I won’t juggle hypotheticals.", "score": 1, "replies": []}, {"body": "Damn... reading these comments is Starting to mm think Im over exposed.", "score": 1, "replies": []}, {"body": "I would spend every penny on MSOS !!! Cannabis about to boom for the next 5 years", "score": 1, "replies": []}, {"body": "250K in SP INDEX, 250 in cash, wait for 10% correction, then 50K every 2% drop past 10% in the SP INDEX FUND.", "score": 1, "replies": []}, {"body": "Put it all into $AMP.X", "score": 1, "replies": []}, {"body": "I would invest in some investment books and read them carefully.", "score": 1, "replies": []}, {"body": "Annuities.", "score": 1, "replies": []}, {"body": "FIE.\n\nWould pay me around $2800 a month.", "score": 1, "replies": [{"body": "In dividends? What's the ticker, I don't see any FIE meeting those numbers", "score": 1, "replies": []}]}, {"body": "Definitely buy a house, first of all. Then I’d put whatever was left into the S&P 500", "score": 1, "replies": []}, {"body": "Take half and buy spy weeklies on a down week", "score": 1, "replies": []}, {"body": "Poorly", "score": 1, "replies": []}, {"body": "20% green energy ETFs, 30% VOO, and 50% fixed income for the first five years, then rebalance the asset mix to 75% AAA+ fixed income and 25% VOO for the last 5 years. You may get an average of 6% per year compounded?\n\nYou can't preserve your principal and gain much at the same time. If it's a true 10-year time horizon, your focus should be on the former.", "score": 1, "replies": []}, {"body": "Buy the dip", "score": 1, "replies": []}, {"body": "I would focus more on increasing my income than creating an ideal portfolio if my take home pay was a meager $3500/mo, to be honest. Getting that to $4k or $5k/mo would be more important to me than lucking into a high-returning portfolio.", "score": 1, "replies": []}, {"body": "I'd go 50% cash then 25% selling ATM puts on SPY and then 25% on a div portfolio. Buying a house is a decent choice too.", "score": 1, "replies": []}, {"body": "All into spce", "score": 1, "replies": []}, {"body": "VTI 90% and 10% gamble", "score": 1, "replies": []}, {"body": "Defi. Osmo LP pools have insane APY with huge bullish upside.", "score": 1, "replies": []}, {"body": "I would DCA half of the 300k and invest the other half over two years. VTI and VXUS", "score": 1, "replies": []}, {"body": "Carefully.", "score": 1, "replies": []}, {"body": "I’m lost on why the stock market is the way to go, If I had $500k I would watch weekly/biweekly crryto dips that average 10-20% drops and buy on the dip.", "score": 1, "replies": []}, {"body": "I’d throw it all in RKLB and watch it turn into a couple million in a few years.", "score": 1, "replies": []}, {"body": "Roth-IRA. Alot of it. Like alot. Max the shit out. Then the rest into a savings account with growth interest. Then pay off debt. The rest. Save save.", "score": 1, "replies": []}, {"body": "I agree with you on not buying. In general returns on stocks are higher over time, clearly. Further, house prices are through the roof, so it is not a refuge from the storm. \n\nI am keeping a lot of cash as well on the side. That is a good idea. I would spend some time investigating investments that can withstand the upcoming crash. It is not a long menu of options. There are some hedged ETFs. There are individual companies that look robust and are going to grow irrespective of the market. \n\nIt takes a lot of research. The good news is that while you are doing your research your opportunity cost is very low in that it seems that you find the market a bit too risk to enter at the moment.", "score": 1, "replies": [{"body": "Sorry when I said \"upcoming crash\" this is just my personal opinion. Most people disagree so you can ignore it.", "score": 1, "replies": []}]}, {"body": "It looks like a sound strategy, with a caveat and a couple of tweaks:\n\n- If you are 30 or younger and don't plan to retire soon, probably putting a higher percentage like 80% in a boring ETF instead of cash is a better idea. You have time to recover from crashes. If you want to retire within the next 10-15 years, probably 60-70% stocks is correct.\n\n- Which ETF? I would prefer VT (or something like VTI+VXUS) rather than VOO/VTI, just because the rest of the world exists and has good companies too. Diversification doesn't hurt.\n\n- What to do with cash? Except for 6-12 months *expenses* (not income) really \"in the bank\" as an emergency fund, I would invest everything else in a savings account or I-bonds or whatever you have available that doesn't yield exactly 0% minus inflation.", "score": 1, "replies": []}, {"body": "I would yolo it all into weekly meme stock options and then post a picture on r/wallstreetbets", "score": 1, "replies": []}, {"body": "Dont listen to all that BS, especially about emergency funds. Just sell cash secured put at low enough price of Tesla. You can do that weekly and generate 2-3k a week\n\nIf the price stays above the strike price, you keep the premium received and don’t have to buy the stock at strike price. If not, you buy the stock at discount and the start selling covered calls with the same returns.\n\nThe beauty of this, the obligation to buy lasts only a week if you sell weekly puts. You don’t have to do every week, it is up to you", "score": 1, "replies": []}, {"body": "I'd buy rentals not as much money but far more consistent and doesn't drop half its vaule over night but say it does as long as there's renters in it your good and there will allways be renters", "score": 1, "replies": []}, {"body": "If you don’t have any idea or you’re too busy to manage it, the best bet is probably going to be to find an investment manager who can take it and manage it for you.\n\nIf you don’t want to do that, index funds. But you’ll probably do better over time letting someone who knows what they’re doing manage it for you.\n\nThat’s what I did when I got access to an account my grandparents had set aside for me that had about 400K in it. Now it’s sitting just shy of 700K.", "score": 1, "replies": []}, {"body": "It really depends on how much cash i think I'd need and how soon. That would determine how much I'd put in a high interest (lol) savings and the rest would be put in a simple 3 find portfolio, allocated based on that.", "score": 1, "replies": []}, {"body": "By being happy", "score": 1, "replies": []}, {"body": "I would buy a house first and use a 20% down payment, then I would hold 6 months of expenses in a savings/money market. I would leave 10k spending money. The rest would be invested/stored in the brokerage account, investing the majority of the money in funds/etfs. Leaving probably 10-20% cash in the brokerage, that would range as it's managed.", "score": 1, "replies": []}, {"body": "GLD;SLV;FAZ", "score": 1, "replies": []}, {"body": "I know we're on a stocks subreddit, but the stock market is simply too hot now. \n\nI would buy property or land and watch it double in 5 years. \n\nThe index funds could lose 40% then wait 10-14 years to recover. This happened in 21 years ago", "score": 1, "replies": []}, {"body": "SPXL and chill, on a 10 year horizon you'll be able to have around 24%/year with medium risk", "score": 1, "replies": []}, {"body": "I would live on the pay check as best I could and use a firm like Fisher to manage the 500k.  If I am not talented enough to make more than 3500 a month, no way am I talented enough to manage 500 k.", "score": 1, "replies": []}, {"body": "drugs, a lot of drugs", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": []}, {"body": "I have about that much in my portfolio and it’s basically like 90% index fund, 9% handpicked stocks and similar stuff and 1% cash. \n\n40% cash is wayyyyyyy too much. 40% cash is appropriate if you are getting ready to retire or you already have more than enough to live comfortably in for the rest of your life. \n\n300k at 6%/yr for 30 years is 1.8 million, 500k at 6%/yr for 30 years is 2.8 million. That’s leaving a lot of money on the table. 1.8 million dollars sounds like a lot, but in 30 years with inflation it’s a little less than I would want to retire on. \n\nNow, if the market does 8%/year, then that 300k becomes 3 million, which is enough to retire in for me at least, but I don’t want to absolutely count on the market doing 8%. Plus, I would rather retire with 5 million than 3 million, not that it would make a huge difference to my happiness, but it’s not a trivial amount of money.", "score": 1, "replies": []}, {"body": "Honestly I would buy property, and if I was single, rent out two rooms in whatever house I buy for consistent monthly income to fund a brokerage account after homeownership expenses.\n\nWhatever is left over, throw it into an S&P 500 index and call it a day.\n\nProperty values are through the roof, but in all likelihood man not come down, and if the do… good luck timing the market.\n\nBut if you don’t want to do that. Find a handful of boring as fuck etfs, and let that money grow.", "score": 1, "replies": []}]}
{"title": "LCID Motors", "selftext": "My bull case for LCID: Just came out with great news that they have a longer range than Tesla, has now found support at the 200 day MA, with huge green volume and a clear change in momentum and the most bullish sign of all imo, the 14 period EMA on the daily just crossed above the 20 period MA. This thing has a short interest of 41% with the highest call written at 30. I don't normally post on here but this seems like a stock WSB would love, so here it is.\n\nhttps://preview.redd.it/ut7tpujvego71.png?width=569&format=png&auto=webp&s=070b811d3fe9be8140f369ead59d90d8607b5827", "id": "pr735w", "created_utc": 1632054791.0, "score": 218, "upvote_ratio": 0.82, "num_comments": 169, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|2|**First Seen In WSB**|18 minutes ago\n**Total Comments**|0|**Previous DD**|\n**Account Age**|7 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=pr735w)||", "score": 1, "replies": []}, {"body": "Short interest and TA drawing as validation? Yeah I’m not that dumb lol", "score": 140, "replies": [{"body": "You telling me you don't like losing money?", "score": 45, "replies": []}, {"body": "I was in this 6 months ago and got LEAPS, leaped ship as soon at that shit converted to LCID ticker. \n\nGood luck retards. Good company just needs a bit more time, and good ol slow organic growth to shake lose the short retards.", "score": 15, "replies": [{"body": "Bought in a while back when it dropped to $18.xx. Offloaded it at $20. I don’t trust this ticker, but I think below $19 is okay for a swing trade. There’s solid support in the $20 to $21 range.", "score": 2, "replies": []}, {"body": "You lucky dog.", "score": 1, "replies": [{"body": "Hope y’all make out better than I did, profit wise. Cheers", "score": 1, "replies": []}]}]}, {"body": "What do you mean this is not the next short squeeze?", "score": 1, "replies": []}, {"body": "r/agedlikemilk", "score": 1, "replies": []}]}, {"body": "THIS DUDE DREW A RESISTANCE LINE ON VOLUME", "score": 37, "replies": [{"body": "This is the funniest shit I've ever seen LMAO", "score": 3, "replies": []}, {"body": "Maybe he's going short", "score": 2, "replies": []}]}, {"body": "Did this dude draw a resistance line on *volume*", "score": 59, "replies": [{"body": "Looks like he did. Maybe this is the training I've been missing!", "score": 2, "replies": []}, {"body": "No. That's macd histograms.", "score": 2, "replies": []}, {"body": "I think it's a trend line.", "score": 1, "replies": []}, {"body": "My crayon 🖍 does that sometimes", "score": 1, "replies": []}]}, {"body": "I’ve had the stock from Jan and it hasn’t given much profit :/ still holding though", "score": 26, "replies": [{"body": "It won't until they start delivering vehicles", "score": 29, "replies": []}, {"body": "Been holding just as long and have averaged down the entire way. I'm in holding 1500 at 20 per so be patient young Skywalker... profits ahead they are.", "score": 7, "replies": []}]}, {"body": "upvoting for probably the laziest attempt at real DD i've ever seen on WSB", "score": 19, "replies": []}, {"body": "Just yolo this last friday some $22.5C Jan 21 2022 🚀🛸", "score": 13, "replies": [{"body": "That's not a YOLO that's a safe play LOL", "score": 16, "replies": [{"body": "@ what premium?", "score": 0, "replies": [{"body": "[deleted]", "score": -5, "replies": [{"body": "What kind of answer is that? He is asking what a good premium is for the 22.50c", "score": 1, "replies": [{"body": "Hint hint", "score": -8, "replies": []}]}]}]}, {"body": "Agree . I cant see it going below .", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 13, "replies": [{"body": "Thats awesome! Ballsy to be blunt. Hopefully you set a Stop Loss!", "score": 2, "replies": []}, {"body": "They definitely have their place, unless they somehow manage to go bankrupt or something stupid like that. Interesting to see how they'll keep up with the deliveries once the cars actually start hitting the road. Kinda want to believe they can do what they say and start deliveries by end of the year and buy Jan calls, but might just play it safe and go as far as May.", "score": 2, "replies": []}, {"body": "Any retard with a design or marketing degree can set up an auto exhibit tho lol", "score": 1, "replies": []}]}, {"body": "There is some definite technical action in store for this stock.\n\nLong term fundamentals are a bit more janky as it's stock price has outperformed and then tanked several times. \n\nIt has some high end vehicles but how many $100k+ ev cars can it sell and how much profit does it make per car?", "score": 14, "replies": [{"body": "Well they already have 14,000 cars on pre-order just imagine when people get their hands on these and experience them. 0-60 in 2.5 seconds plus really long range, first ever car with Dolby Atmos built in, over 20 speakers, 3d sound controls( left,right, front,back,up,down) tons of cameras plus lidar, quality interior materials, plus built in seat massage, quick changing, two way charging ( can use your car as a generator in power outages) Epa range just got confirmed deliveries are around the corner I'D estimate a month or less.", "score": 14, "replies": [{"body": "For 100k wouldn't people just get the Plaid S for 1.9s 0-60?", "score": 9, "replies": [{"body": "You don't get the range Lucid has with tesla. Also as far as people hounding the price. Show me any production car with 1,000 hp that's cheaper", "score": 8, "replies": [{"body": "Hummer EV", "score": 1, "replies": []}, {"body": "You don’t need it with Tesla supercharger network", "score": -4, "replies": [{"body": "From what I heard supercharger lineups can get huge", "score": 0, "replies": []}]}]}, {"body": "Tesla build quality isn’t worth the price tag. I’m hoping LCID gets this right. \n\nDisclaimer: I’ve $5k on this ticker.", "score": 2, "replies": [{"body": "Hmm isn't Tesla's build quality issues due to them not having manufacturing experience? What would make Lucid, an even newer manufacturer better than Tesla in that regard?", "score": 1, "replies": [{"body": "That’s a loaded question. Is like me saying, if Tesla’s tech is so good and their performance is so impressive why is their build quality so bad? It’s like they can’t be bothered to put their cars together well when they can do harder stuff well (batteries, drivetrain, etc). \n\nAll I’m saying is this: I hope Lucid has learned from Tesla’s growing pains and I hope it is reflected on their production vehicle once it is released. I am a stakeholder but I’m also a potential client and would love to have a well put together luxury EV that doesn’t have awful panel gaps and horrid paint work.", "score": 3, "replies": [{"body": ">It’s like they can’t be bothered to put their cars together well when they can do harder stuff well (batteries, drivetrain, etc).\n\nI highly doubt Tesla just decided yeah, let's not bother with build quality, let's just focus on tech. Tesla has the resources, they can raise $7b with a 1% dilution that will instantly be bought up.  It might just be a legitimate challenge as a newer manufacturer.", "score": 1, "replies": [{"body": "I agree with you. They have the resources and are smart people no doubt. My entire point is it was a slippery slope statement, just like your prior question.\n\nI hope Lucid has taken notice of Tesla's growing pains and made efforts to avoid those pitfalls. If all we get is another \"Tesla\" with a different badge it will be very disappointing.\n\n&#x200B;\n\n>they can raise $7b with a 1% dilution that will instantly be bought up. It might just be a legitimate challenge as a newer manufacturer.\n\nand I would probably be one of the first to buy, I already own a fair amount and will continue to accumulate both TSLA and LCID", "score": 2, "replies": []}]}]}]}]}]}, {"body": "This is a long term play and I am staying away until they prove they can actually make a great car. Making a good car won't be enough considering the market they started with. Nothing you listed separates Lucid from other vehicles enough to warrant such high expectations. The valuation is way too high for this stage of their incubation period. I foresee someone buying them out before they reach a critical mass as Tesla alone has done within the EV space.", "score": 2, "replies": [{"body": "I don't think they are going to be bought out unless it was a stupid amount of money. The Saudis already made a huge mistake with TSLA and will not want to make it again.", "score": 2, "replies": []}, {"body": "Everyone compares them to tesla like you can't profit of company growth along the way. Its like if they aren't producing enough cars and don't have a almost 700b valuation then they're not worth their time of day. I held my small amount of tesla stock (all i could afford at the time) for 5-6 years bought in at $50 years later I went through a 5 to 1 stock split and cashed out at a much higher stock price for $60,000.\n\nI'm holding 2,000 shares of lucid for 3-5 years maybe more", "score": 2, "replies": [{"body": "I'm sure you will do fine with Lucid, assuming they deliver like Tesla did. I don't think you'll duplicate your Tesla gains on Lucid but I would be happy for you and America if it did. America needs more competent car makers.", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": -1, "replies": []}]}]}, {"body": "I bought LCID on the fundamentals of it being a luxury EV that will be successful.\n\nIf the TA supports upward momentum, great, but I'm holding regardless.", "score": 43, "replies": [{"body": "Care to share those fundamentals that will make them successful?", "score": 9, "replies": [{"body": "My opinion is nothing.  Bank of America gives LCID a $30 PT and calls it a combination of Tesla and Ferrari.\n\nhttps://finance.yahoo.com/news/lucid-is-a-combo-of-tesla-and-ferrari-bof-a-analyst-202738043.html\n\nEdit: Unbelievable that this is getting downvoted with snide comments.  You think Bank of America analysts don't do fundamental analysis to arrive at their price targets?", "score": 15, "replies": [{"body": "Holy shit you're a proper retard", "score": 5, "replies": []}, {"body": "Lucid may be a great company, but quoting BofA ANALcysts is worth a downvote. Might as well quote Crymer. MSM promotes the pumps/interests of their clients, which are institutions, not retail readers. That's why you're getting downvoted.", "score": 1, "replies": []}, {"body": "This did not age well", "score": 1, "replies": []}, {"body": "\"Fundamentals\"", "score": 0, "replies": []}, {"body": "BofA PT has nothing to do with fundies lmao", "score": 1, "replies": []}]}, {"body": "Lol I love how he posts an article on yahoo finance that was published 3 days ago as his fundamental analysis for holding the stocks for months. This sub is too much sometimes.", "score": 2, "replies": []}]}, {"body": "If tesla has pivoted from their expensive luxury models to the cheap 3 there is a reason ( even before chip issues ) \n\nLucid is charging wayyyyy too much for nothing special . \n\n100-150k you get the plaid or  the porsche EV \n\nFull disclosure I have a tesla but can admit they are built so poorly. When I’m ready for luxury I’ll be getting that porsche or maybe a german brand if they release Something nice", "score": 13, "replies": [{"body": "Porsche *or* German eh?", "score": 19, "replies": [{"body": "Toyota or Japanese!", "score": 15, "replies": []}]}, {"body": "> If tesla has pivoted from their expensive luxury models to the cheap 3 there is a reason ( even before chip issues )\n\nThat's kinda a dumb assessment. Tesla started with \"Luxury\" cars because you have to do so. High margin at first then you streamline your production to be able to produce low margin cheap cars. And Tesla always sucked on the quality control. \n\nLucid's CEO was the Chief Engineer behind Tesla's cars (Model S daddy's) and he was previously working for Jaguar and Lotus. More than Musk, he knows how to make cars, he knows how to make good cars. And now he has the EV with the longest range ever produced.\n\nBiggest issue for this stock is to be already valued at 30~40billions while no car has been released yet. But it is the case for all the EV companies right now.", "score": 15, "replies": []}, {"body": "This was my thought too. But man, those Mercedes are FUGLY.\n\nThe Audi eTron GT RS is decent, the Porsche Taycan is obviously nice but the range is terrible. There just aren't very good options right now.", "score": 1, "replies": []}]}, {"body": "Same here. I bought in a couple of months ago and added again at 19 a few days ago.", "score": 4, "replies": []}, {"body": "You should look at the \"fundamentals\" of Luxury Sedan sales over the last decade.", "score": 1, "replies": []}]}, {"body": "LCID is a good short and long term option. I hold it in my IRA for longterm and my play account for short term", "score": 9, "replies": [{"body": "This 1000000000%", "score": 2, "replies": []}]}, {"body": "Bull case. The Saudis like money", "score": 8, "replies": [{"body": "Correction, Saudis love to blow a whole bunch of money on short-lived experiences. They are not known for being miserly investors. Talk to Warren Buffett if you want a better take", "score": 2, "replies": []}]}, {"body": "20% more range for 200% the cost of a Tesla. Great news.", "score": 14, "replies": [{"body": "And they still haven't delivered it yet. That 20% could be an estimate in an area that has 0 air resistance or whatever. They can do anything to manipulate the numbers.", "score": 2, "replies": []}, {"body": "Basically. The thing is also absolute trash through the corners because they overloaded the suspension with batteries and and put on skinny tires to keep the range up. The motor trend puff piece accidentally used an clip of it sliding sideways out of a relatively low speed corner just because it lost grip due to the bad suspension and tires. If everyone thinks it's going to be a performance car, they should be asking why it doesn't have a time around the nurburgring yet. They did some laps of Laguna seca with a prototype a few years ago, and it was worse than the model 3. Lucid's release version will be even worse still and cost 3x as much and have no maintenance/support or charging network", "score": 1, "replies": []}]}, {"body": "I posted a very exhaustive DD on Lucid about a month ago and it was somewhat poorly received. I took took that as validation at the time--If everyone agreed it would mean we're too late. Since most people thought I was wrong then I feel it means we're still early.\n\nVery long and very deep in LCID. Keep it up OP.", "score": 11, "replies": []}, {"body": "Yolo lucid", "score": 3, "replies": []}, {"body": "Hopefully their production showcase on September 27th show they can pump out quality cars. May the technical analysis astrology gods and epa catalyst, short squeeze printer go brr.", "score": 3, "replies": []}, {"body": "LCID market cap is at ~37B\nAnd they don’t have the sales yet\n\nEither it’s priced in or it’s overvalued enormously.\n\nIts not $TSLA that has the FSD, satellite/ internet service, solar panels, brick sales and soon to create personal robots. \n\nYou will see a meaningful return on your investment in a few years .", "score": 3, "replies": [{"body": "My exact thoughts. 37 billion with no vehicles sold. Might just be the most over hyped and insane valuation I have seen. I can only say at this point its over priced garbage.", "score": 1, "replies": []}]}, {"body": "I bought lucid instead of Tesla not only because I am a retard, but because of their battery tech. My prediction is they will start licensing this battery tech (now that is official they get ranges of 520 miles) to the big guys. Because who doesn’t like making money off of proprietary technology!", "score": 8, "replies": [{"body": "What is unique about their battery tech?", "score": 2, "replies": [{"body": "It's not so much the battery tech, it's the drive train itself. \n\nIt's miniaturized far beyond what others are doing which allows it to be far more efficient and lighter.", "score": 3, "replies": []}, {"body": "Nothing, it’s just a bigger battery", "score": -3, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": []}, {"body": "180 shares and 14 calls (already in the money). I am holding shares long term and will sell the calls in October. September 27th they have scheduled visit to their amp1 manufacturing facility for media and few selected customers. I think that will drive the stock higher and may be first deliveries happen around the same time. Let's see, I am bullish short term and long term", "score": 2, "replies": []}, {"body": "If this gets below 20 again I’m buying leaps", "score": 2, "replies": [{"body": "That's what I did on the last panic sell off from the pipe lockup expiring. Working out spectacularly so far.", "score": 2, "replies": []}]}, {"body": "brb , selling the house, wife, cars, second house, third house, fourth house, girlfriend, mistress and the office bitch i on bang on fridays to go all in LUICCCCDDD. Moon time!!", "score": 2, "replies": []}, {"body": "Puts on lucid. Got it.", "score": 2, "replies": []}, {"body": "\"Just came out with great news that they have a longer range than Tesla,\"\n\n1. You can buy a Model S LR which will have similar performance to the Dream Edition R. The Model S LR costs $90K vs the Lucid Air Dream Edition R, at $169K. So about $80K more for that extra 100 miles of range. \n2. With a Tesla you have access to the Supercharger network, which means the extra range is less important for most buyers.\n3. In a year or two, as Tesla moves to 4680 structural cells, they will be able to offer matching or better range while reducing their cost to make the cars. As it is, the Lucid has about a 10% efficiency benefit over the Model S. The move to 4680 cells, are estimated by Tesla to improve efficiency by 30% (50% if you add in their proposed to changes to the Anode and Cathode) yet reduce cost significantly.\n4. Lucid's lower priced cars (the Pure and the Touring) are not going to be produced for another year or two. The Touring has similar range to the S LR, but lower performance and costs more, the Pure has less range and performance and costs a little less. Simply put, those cars are barely or not at all competitive. By the time they come out, the 4680 cells should already be making their way to Tesla's cars and any range or efficiency lead that Lucid claims should be long lost.\n\nNot saying Lucid cannot be a success, just be very careful about getting excited about some details versus assuming they will be another Tesla.", "score": 2, "replies": [{"body": "This is all assuming Elon can deliver. FSD was initially promised for release in 2016... still beta.", "score": 1, "replies": []}]}, {"body": "Oh baby I’ve already YOLOd five of the 1-1-2022 40c. Time to make some big bucks!", "score": 0, "replies": []}, {"body": "Lol, i am not touching any EV stock until they start delivering in thousands. For any good company, there will be a correction to its right value so that institutions can load up. Time will come for lucid too.", "score": 1, "replies": [{"body": "Have fun buying much higher", "score": 3, "replies": []}]}, {"body": "Everyone loves green candles", "score": 1, "replies": []}, {"body": "Throw this whole post away. Whatever YouTube video you watched that told you to do this, unsubscribe.", "score": 0, "replies": []}, {"body": "Too expensive and will run into the same problems as Tesla… Ford and GM will dominate the EV landscape in a few years. I moved money into ARVL trying to find a niche", "score": -5, "replies": []}, {"body": "Highest call written at 30..what expiry date  are you talking about?", "score": 0, "replies": []}, {"body": "I made a killing in the medical device company that had a similar ticker last year. Now there is nothing to see here.", "score": 0, "replies": []}, {"body": "Just buy $TSLA instead", "score": 0, "replies": []}, {"body": "Doesn't the car have an MSRP of $170,000 while performing worse and everything but range than the model s plaid? How many people really want to spend that kind of money for a worse performing car while only getting better range as a trade-off? Do people in that bracket really care about range enough to forgo the tican turbo s or the plaid?", "score": 0, "replies": [{"body": "For the same reason someone would buy a rolls royce.", "score": 2, "replies": [{"body": "people buy RR because of A) luxury, which Lucid isn't on the same level as cars half its price, and B) the name, which Lucid does not have.", "score": 0, "replies": []}]}]}, {"body": "that range does not mean shit", "score": -2, "replies": []}, {"body": "The valuation of LUCD is insane and that's why I am out. 37 billion company with 0 vehicles delivered? No thanks jeff.", "score": -1, "replies": []}, {"body": "so how many cars have they sold?", "score": -2, "replies": [{"body": "RemindMe! 1 year", "score": 3, "replies": [{"body": "I will be messaging you in 1 year on [**2022-09-20 16:53:05 UTC**](http://www.wolframalpha.com/input/?i=2022-09-20%2016:53:05%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/pr735w/lcid_motors/hdlzohq/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fpr735w%2Flcid_motors%2Fhdlzohq%2F%5D%0A%0ARemindMe%21%202022-09-20%2016%3A53%3A05%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20pr735w)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}, {"body": "Well you can throw your tea leaves out of the window. We are crashing and they didn’t warn ye..", "score": -2, "replies": [{"body": "Say again?", "score": 3, "replies": []}]}, {"body": "Whats the mpg of the air vs the S? Making longer range isnt a big deal you just increase the weight by shoving more batteries", "score": 1, "replies": [{"body": "🤦‍♂️ clearly you haven't done your research the CEO basically said the exact same thing and said \" anyone can put more batteries in a car to increase range \"dumb range\" what sets lucid apart is their efficiency so you can go further with less. \nThey have patented motor and battery systems unlike any other watch some YouTube videos that show comparisons to tesla. Lucids are up to 17% more efficient than tesla so if put more batteries in a tesla and Lucid, Lucid will best tesla every time as far as range is concerned.", "score": 6, "replies": [{"body": "The higher voltage system DOES have the capability to improve mileage efficiencies, but since the other EVS for the most part have not yet standardized on this, Lucid is going to be constrained to using lower volume subsystems that are developed with a higher per-unit engineering cost. Either that or they will have to develop them internally, which for the expected number of units they plan to sell, is going to hit their overall profitability. How does Lucid plan to add FSD? are they going to subcontract to Tesla or try to do it internally? Where are they going to get the AI engineers? How much time will it take them? Lucid talks the talk about also being a Energy supplier etc. like Tesla has already done profitably, but what is their expertise? Tesla has opened their patents up for all to utilize because Tesla's goal is to save a planet; not make a fast buck. Lucid just feels like they want to market themselves as Tesla Lite, and enjoy the stock valuations long enough for the management team to make a killing. Once you get past the hype, nothing is believable until they deliver a great car and show that it is selling for more than it costs to make and hype.  Tesla doesn't need to advertise their products, especially with Super Bowl ads.", "score": 1, "replies": [{"body": "As far as FSD Lucid has been working for a few years on what they call( Dream Drive) they also have great connections with regulators in that field. We are supposed to hear more on that soon. As far as their charging platform is concerned with their longer range you won't need to charge as frequently but also the charging infrastructure is moving towards higher voltage. Tesla 400v platform will be considered outdated soon.", "score": 2, "replies": [{"body": "Where has Lucid been getting their FSD input data from? I'm happy they have a cool name for it, but marketing will only get them so far.", "score": 1, "replies": []}]}]}]}, {"body": "Well since it's an EV there's no MPG. You're looking for m/kWh. Lucid gets 4.6 m/kWh while the Tesla Model S follows behind at 4.0 m/kWh. Lucid is at least 15% more efficient in this metric alone. You can read it all in my long-winded DD [here](https://www.reddit.com/r/CCIV/comments/pasdl9/my_bullish_bet_on_lucid_motors_a_better_dd/).", "score": 2, "replies": [{"body": "Whats LCID plans for a mass market M3 equivalent? Rivian truck reviews seem great", "score": 2, "replies": [{"body": "Like the M3 tank? Well, Peter has said they're looking to move their technology into aviation (eVTOL), marine, agricultural and industrial, so a Lucid tank is technically in the cards.", "score": 1, "replies": [{"body": "Model 3", "score": 1, "replies": [{"body": "Yeah just messing with you. I assume by Model 3 equivalent you mean a cheaper larger volume vehicle? That is further down the roadmap. I don't believe Lucid will ever release a truly \"cheap\" model since they are marketing themselves as a post-luxury brand, and that would only serve to dilute their brand value. To that end, however, the company does plan to license out their technology to other manufacturers who can use it to make cheaper vehicles, but not under the Lucid banner. This is one of three parts to the company strategy as outlined by Peter Rawlinson (vehicles, energy storage systems \\[ESS\\], and technology licensing).", "score": 2, "replies": []}]}]}]}]}]}, {"body": "https://www.dailylucid.com/post/lucid-motors-is-on-the-cusp-of-deliveries", "score": 1, "replies": []}, {"body": "I’m bullish on LCID, but WTF is this?!?", "score": 1, "replies": []}]}
{"title": "Evergrande FUD, What the China property market really looks like, what the CCP does, and why it will be a NON issue in general", "selftext": "From [r/baba](www.reddit.com/r/baba):\n\nThere are ~30 *major* China property companies. Guangzhou R&F has the most leverage. Actually, of the China government's 3 \"red lines\", G R&F is the worst off. \n\nThese are the CCP's policies. Evergrande can *still* increase debt by +5%\n\nHow did Evergrande get into this position? Due to my former life as a equities PM, I've been investing in China property for 13 years. \n\nEvergrande diversified into non-core businesses, like healthcare, water, sports, tech. They've had the among the higest debt for *many* years.\n\nWhy is it being singled out by the media now?\nBecause while Guangzhou R&F, Greentown have higher debt, Evergrande's margins and profits are worst.\n\nAlso profits have fallen off the cliff  at -$1.2bn losses 1H'21. (vs -3% year-on-year growth estimated for the sector)\n\nWhat happened in the past to high leverage property companies? They were quietly \"faded out\" to a non-event\n\n1) Anbang - $310 bn assets including Waldorf Astoria (NY). Failed restructuring. China government seized control. $5bn valuation at the firesale, vs #Evergrande $4 bn now\n\n2) HNA - purchased prized property assets in debt fueled growth,including investing in Hilton & as the top investor of Deutsche Bank. $200bn debt it couldn't pay. Chairmain Founder 'fell' and died on holiday\n\n3) Dalian Wanda - China's largest mall developer, bought Atletico Madrid & AMC. $6bn debt due 2020. Tycoon (former richest Asian) lost -$32bn salvaging the company\n\nMoral of the story? Nothing dramatic happens. These companies get \"managed\".\n\nIn China, the largest banks are State Owned Enterprises. These issues are gradually resolved with moralsuasion or a phone call from the CCP.\n\nIn the West, the government doesn't have these \"one phonecall\" tools. This is what Western media doesn't grasp.\n\nThe CCP is extremely smart and will do anything to ensures social and financial stability.\n\nCredit Market impact: As in the past, the CCP will \"manage\" the deleveraging process. Just like the media FUD on Anbang, HNA, Dalian Wanda -- likely no shock waves are going to happen in China's credit markets.\n\nFinal comment: I spoke to 2 Bloomberg reporters last week. Their bonu$ was dependent on how much their stories could impact a company's stock price. \n\nSo don't believe everything you read.\n\n[Original tweet source](https://twitter.com/asiahodl/status/1439523847305302017?s=20)", "id": "pres5t", "created_utc": 1632080104.0, "score": 168, "upvote_ratio": 0.68, "num_comments": 180, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|9|**First Seen In WSB**|9 months ago\n**Total Comments**|303|**Previous DD**|\n**Account Age**|8 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=pres5t)||", "score": 1, "replies": []}, {"body": "There are some major difference here between Evergrande and Anbang. \n- Anbang bought up a bunch of valuable companies from all around the world that actually made money. In Anbang's case they jailed the chairman and ran the business for him to gradually sell off those valuable assets. The individual parts of Anbang still was able to cover the debt through liquidation, people got paid back and functional business units sold to other owners around the world. It was a successful wind down. Check out: https://www.insurancejournal.com/news/international/2020/02/21/558983.htm\n- Evergrande got into businesses they would not be successful in (see their EV stint) so do not have valuable assets that outweigh the debt. Like many of China's property developers they bid up the price of land above market value since they believed their development would make it worth more. Now they have a bunch of partially developed buildings on overpriced land. Not going to get much from that.\n\nEvergrande is a different situation, it's much more dire.", "score": 158, "replies": [{"body": "You sound confident so I’m gonna believe you", "score": 59, "replies": []}, {"body": "From what I've read, this is a good take.\n\nI've also seen estimates that the 300 billion debt Evergrande is carrying is just that of their bonds.\n\nThis would not take into account debts to contractors, customers, and their own employees (!).", "score": 9, "replies": []}]}, {"body": "In a country where you can disappear people, they do have a lot more levers than we do.", "score": 114, "replies": [{"body": "I prefer that fraudsters were severely punished instead of bailed out. These people destroy millions of lives directly and indirectly.", "score": 29, "replies": []}, {"body": "They execute people for financial fraud, it's fucked up there over there. We're cool here, we'll fine you a small amount like Ken Griffin. Meanwhile, if we were in China, they would just disappear him, erase him off every search engine, every photo, replace him, and act like nothing happened.\n\nDifferent culture there for sure.", "score": 45, "replies": [{"body": "Cancel Culture takes a whole new meaning over there", "score": 25, "replies": []}, {"body": "If Ken Griffin was Chinese he wouldn’t be disappeared. He’d probably be the minister of CCP financial policy and China would be ahead of USA economically.", "score": -2, "replies": [{"body": "Holy shit ken griffins Reddit account!", "score": 38, "replies": [{"body": "You think CCP is a bunch of super friendly dudes who love all of their citizens and shoot rainbows out their buttholes? or a bunch of dudes like Ken Griffin?", "score": 0, "replies": [{"body": "Ken you should ask Pooh bear if he’ll take u in", "score": 15, "replies": [{"body": "Maybe your mom is Ken Griffin and he pooped you out. Maybe you’re just a giant poop baby like Bono Vox.", "score": -11, "replies": [{"body": "Definitely an interesting theory", "score": 13, "replies": []}, {"body": "How's Forex and the junk bond network treating ya?", "score": 3, "replies": [{"body": "I find it amazing that only retards on wsb can think that when someone says that Ken Griffin would fit right in with the CCP who are a bunch of oppressive genocidal Ponzi scheme asset manipulators that my comment is somehow interpreted as me being pro Kenny G. \nHow’s eating crayons and blowing your paycheck on 0 dte otm Gme calls treating ya?", "score": 1, "replies": [{"body": "No, wsb is sick of the useful idiots unwittingly playing into the hands of politicians who want to regulate the market any dumb way they can, just so they can say “I took on Wall Street” on the campaign trail.", "score": 1, "replies": [{"body": "Ape no get u point?", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I’d rather have Kenny running my country than Apes", "score": 0, "replies": []}]}]}, {"body": "nah, he would refuse to share his Mayo with Xi and get gulag archipelago'ed", "score": 2, "replies": []}]}]}, {"body": "Sums up a lot right here!", "score": 3, "replies": []}, {"body": "They shutdown a city of millions and force tested/vaccinated millions in a week to contain covid. Yes, they have access to many extra levers.", "score": 7, "replies": [{"body": "These vaccines are safe and effective.", "score": 4, "replies": []}, {"body": "Ughh the dream for you am I right", "score": 1, "replies": [{"body": "Pretty big leap there. No idea how this relates", "score": 7, "replies": []}]}]}]}, {"body": "I'll buy a put and a call and if it goes wrong it'll glitch my graph and ill call robinhood support and get a refund.", "score": 32, "replies": [{"body": "Sounds interesting,  tell me more", "score": 6, "replies": []}]}, {"body": " Evergrande's implosion is super bullish for Chinese real estate", "score": 14, "replies": [{"body": "Demolition stocks are going to be bullish.", "score": 8, "replies": []}, {"body": "Please explain", "score": 1, "replies": []}]}, {"body": "People are looking for a “black swan” event. I’m not saying it’s coming, but before the 2008 crash did mainstream folks even hear about CDOs and credit default swaps? Let alone know what they do?\n\nThe thing with back swans is we never know when they’ll show up in the pond, and when they do, where they came from.", "score": 50, "replies": [{"body": "A literal black swan showed up in tienmen square 2 weeks ago….", "score": 4, "replies": []}, {"body": "If covid couldn't bring the market down for more than a couple months, then a Chinese Ponzi scheme sure as shit won't stop this retard strength. That said, this will probably slow down the Chinese housing market for a bit, and there is definitely money to be made on the short side in the near term.", "score": 15, "replies": [{"body": "you must be new. what are you, 14 yrs old?", "score": -10, "replies": []}]}, {"body": "Yeah but what you're not taking into account is that the amount of information your average tard can get their hands on in 2021 is about 10x that of 2007/2008.\n\nYou can't compare the two. If WSB existed in 08 you would've had a bunch of retards banging on about CDOs and swaps. Burry and handful of others figured it out but back then people were still using fuckin fax machines. Different times", "score": 3, "replies": [{"body": "I agree we can’t compare the two. That’s my point. Each black swan is unique. I think if there’s another crash (which if enough people believe then it’ll come because people literally create the markets). The market isn’t some piece of nature that follows natural orders. It’s a reflection of humans", "score": 2, "replies": [{"body": "Yep. So every time people freak tf out about something to try to save their money, boom we got a crash", "score": 2, "replies": []}]}]}, {"body": "I thought it was pretty good", "score": 1, "replies": []}, {"body": "it’s gamestonk", "score": 0, "replies": []}]}, {"body": "So monday YOLO evergrande, check", "score": 54, "replies": [{"body": "Bitch is still going to sink but the ammo room isn't going to blow.", "score": 7, "replies": []}, {"body": "That's the thing he's not saying that at all, he's just providing a very clear and valid reasoning behind why the media and many here are fear mongering the shit out of Evergrande.", "score": 9, "replies": [{"body": "I know, are we not allowed to make jokes anymore?", "score": 24, "replies": [{"body": "It's hard to tell who is joking and who is certifiably retarded, the ratio is usually like 50-50.", "score": 33, "replies": [{"body": "Now I am in doubt, that YOLO could work hmmm", "score": 5, "replies": [{"body": "Stocks down 80% might be worth buying a few for giggles to possibly own the Chinese Enron.", "score": 8, "replies": [{"body": "Make sure you ask them to mail the physical stock certificate.", "score": 2, "replies": []}]}, {"body": "Only Yolo half.", "score": 5, "replies": [{"body": "then it's not a yolo though lol", "score": 6, "replies": [{"body": "YOLO half but match it with margin.\n\nThen when you lose it all, file for bankruptcy and get the debt written off. Easy.", "score": 4, "replies": [{"body": "Seems that is Evergrande business plan.", "score": 3, "replies": []}]}, {"body": "Well, if we are 50 tard and 50 wrinkles... one can Yolo half.", "score": 2, "replies": []}]}]}]}]}, {"body": "Last I checked, we aren't in China. So you are free to do anything.", "score": 3, "replies": []}]}, {"body": "Wsb is 80% retards who will buy any stock name they see a long paragraph paired with it and 19% semi smart investors 1% actual investors", "score": 8, "replies": [{"body": "Just tell me which stonks to buy fuckface", "score": 13, "replies": []}, {"body": "don't forget the rockets", "score": 1, "replies": []}]}, {"body": "This.", "score": 4, "replies": []}]}]}, {"body": "There are better options than investing in China right now.", "score": 44, "replies": [{"body": "Look at OPs posting history to understand the motivations here.", "score": 41, "replies": [{"body": "Holy crap that's a lot of baba posts.", "score": 49, "replies": [{"body": "Tankie's gonna tankie", "score": 3, "replies": []}]}]}, {"body": "Is there worse places to invest?  Maybe African nations north Korea or Russia. What rights do you have as a shareholder to a Chinese company... 0 they don't even recognize you as a legitimate shareholder.  Fuck the ccp", "score": 8, "replies": [{"body": "I still think Russia is undervalued TBH. \n\nThe natural resources that country possesses are insane.  Oil, gas, minerals, food, access to all oceans … barely tapped. \n\nAs the world continues to demand more and more, Russian resources are going to be very valuable.", "score": 1, "replies": [{"body": "Yes but you can invest in Canada to get all that and have a lot more confidence that you have rights as a shareholder.", "score": 1, "replies": []}]}]}, {"body": "Believe it or not, this is the best time to buy Chinese stocks. Remember “buy when everyone is fearful”?", "score": -5, "replies": [{"body": "But everyone is fearful about SPY, I’d rather buy that - And I did.", "score": 17, "replies": [{"body": "literally nobody is fearful of SPY\n\nretail accounts all time record highs, margin leverage all time highs, literally everybody is talking about stocks, everbody over the age of 18 has some equity invested etc.", "score": -7, "replies": [{"body": "Have you been around here the past week?", "score": 8, "replies": [{"body": "Wsb =! Market sentiment", "score": 3, "replies": [{"body": "WSB alone, no. What about all the other trading/stocks subs? The overall sentiment has been fear of a crash, correction or slow/sustained bleed out.\n\nRegardless I don’t base my buying in based on Reddit (unless it’s play money I’m fine gambling away) but this last week on several subs has been that of fearing a downturn in one way or another.", "score": 2, "replies": [{"body": "That's fair I think, but saying everyone is fearful is really reading to much into it. Numbers speak louder than words and spy has been climbing higher and higher, people have been buying every dip since the outbreak, the average person on the streets is talking stocks to each other. That's more indicative of greed imo than the fear you see on forums", "score": 2, "replies": [{"body": "True, but if you notice the SPY P/C ratio at close on Friday, there were more puts than calls. TD Ameritrade/Thinkorswim is showing 1.219 Puts per 1 Call. Numbers mattering (as we both agree) tells me that more are anticipating/fearing a fall more than a climb.", "score": 1, "replies": [{"body": "Forgive me if I'm wrong, since I don't normally look at that metric, but don't puts generally always have more volume since they are bought as a hedge by the big boys?", "score": 1, "replies": [{"body": "Most of what I’ve seen, in shorts and in SPY, there have generally been more Calls than Puts. I however have only been trading since January, and only 3-4 months of that have been options, so I can’t say for certainty how long that has been the case.", "score": 1, "replies": []}]}]}]}, {"body": "I do think to some extent wsb does capture retail sentiment. With 10M members it would be hard not too. It's always an easy bet to bet on America.\n\nIt's why I was bullish at the bottom last year. Fear on here got so ridiculous I started buying. As long as I see people scared, unwilling to invest and continously calling the top, I'll feel good about spy.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Not if the reason to be fearful is valid.", "score": 3, "replies": [{"body": "Then, explain why many billionaires are now buying up $BABA and other Chinese stocks by the truck load?", "score": 2, "replies": [{"body": "I'm long BABA but where are you seeing this?\n\nIn Q2, Institutions sold $47B worth while only buying $7.64B.\n\nhttps://www.marketbeat.com/stocks/NYSE/BABA/institutional-ownership/", "score": 3, "replies": []}]}]}, {"body": "If you don't understand how a foreign government works don't invest in companies thats based there. Seems like you don't know how the Chinese government works. Money is not their main objective it is control they will sacrifice anything even going to their economic downfall in order keep control.", "score": 4, "replies": [{"body": "So you shorted Chinese stocks when they are at all time low?", "score": -5, "replies": [{"body": "No I dont touch chinese stocks or short them", "score": 3, "replies": [{"body": "Then, why are you here? LOL. Bears. 🤦‍♂️🤡", "score": -7, "replies": [{"body": "Yoloing on stocks and options that are not chinese lol", "score": 3, "replies": []}]}]}, {"body": "[removed]", "score": 2, "replies": [{"body": "LOL. You are a 20-year-old boy who lives with his parents, and you shorted Chinese stocks? 🤦‍♂️", "score": 1, "replies": []}]}]}]}]}]}, {"body": "This is copium if it was a WSB post", "score": 17, "replies": []}, {"body": "Jesus, this is 1/4 bull, 1/4 China pandering, 1/4 tin-foil hat qanon, 1/4 desperation.", "score": 62, "replies": [{"body": "You had me till q-anon then had me again at desperation.", "score": 11, "replies": [{"body": ">Final comment: I spoke to 2 Bloomberg reporters last week. Their bonu$ was dependent on how much their stories could impact a company's stock price.\n\nThis is the qanon part.", "score": 30, "replies": [{"body": "Uh I know many people who write articles in entertainment AND local news (Chicago and NYC). As fucked as it is they DO get more recognition and bonuses DIRECTLY related to how many clicks and interaction/shares an article gets. They spend a ridiculous amount of time making the headline as controversial as possible. \n\nTraditional reliable journalism has been dead for years. It's like the people who still believe all the people who went to Harvard and Yale are brilliant when half of them paid their way in or simply had the connections.\n \nThat is NOT conspiracy it is FACT. And you really think financial news is above that lolol? Especially when analyst price targets from the top investment banks can go from $90 to $50 to $5 in a span of less than a year?", "score": 14, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "So you are saying a Bloomberg article titled “Powell’s secret gay lover reveals the Fed Chairman has been actively working on  tapering policies while attending swinger parties at the Yellen’s household” would hit the click jackpots?", "score": 3, "replies": [{"body": "Sounds like you have the makings of a mini series for daytime TV", "score": 4, "replies": []}]}]}]}, {"body": "That is standard bullshit untold conspiracy MO. Nothing new. Qanon is crappy conspiracy of child demon dungeons and 5g.", "score": 2, "replies": []}]}]}, {"body": "I think the point is more that the world economy won't crash than buy Chinese stocks.", "score": 2, "replies": []}, {"body": "Damn it now I have to read it.", "score": 2, "replies": []}, {"body": "Not really, as much as the CCP sucks, bullet 1) type logic is being ignored by all the 'sky is falling' because of Evergrande chicken littles.\n\nThe tinfoil hats are being worn by all the bears hoping that Evergrande creates some worldwide apolocalypse worse than 2008 so their broke asses can take their 3 stimmies and what's left of their past 1.5 years unemployment checks and double them to a whopping 10k profit, it's ridiculous. \n\nWe will all see soon enough, come back here when we do ok?", "score": 3, "replies": [{"body": "haha you are so right..\n\npeople missed the covid dip are now hoping on Evergrande colapsing stock markets and spreading FUD everywhere hahaha", "score": -7, "replies": [{"body": "Yeah sometimes I forget this subreddit is 99% retarded because of the 1% outstanding due diligence posts. \n\nI mean even the retards make me laugh with clever posts sometimes.\n\nBut then reality kicks in an I remember where I am as many of the responses on this post reveal. \n\nTons of people shilling some scam pump and dump or just desperate for easy riches and think a recession is the best way for it.", "score": 3, "replies": []}]}]}]}, {"body": "Correction: China will do anything to hold their power by enforcing extreme public order, at the cost of everyone's human rights and economic mobility.", "score": 23, "replies": [{"body": "Tiananmen square residents agree with you.", "score": 1, "replies": []}]}, {"body": "All your houses belong to us now. $YANG to the moon 🚀", "score": 7, "replies": [{"body": "Correct Chinese English is “ All your houses ARE belong to us”", "score": 2, "replies": []}]}, {"body": "Sounds like the the FED\n\nNothing is gonna happen\n\n*SOMEDAY IT WILL THO*", "score": 7, "replies": []}, {"body": "\"The CCP is extremely smart... \" and will have to let it go bc confidence is gone.", "score": 9, "replies": []}, {"body": "The guy whose Twitter thread was tweeted by Burry commented on the Twitter thread posted here and mocked it, just fyi", "score": 3, "replies": []}, {"body": "Asian investor of 13 years posting here.\n\nYeah, I’m not interested in your book and I don’t feel like losing money. 99% of the guys here (rips statistic out of ass) will leave here if they hit big and realize the bragging ain’t worth it.", "score": 13, "replies": [{"body": "hey buddy, check the link in posted at the end of fhe threat, is the original source.. im just posting the info here", "score": -14, "replies": []}]}, {"body": "I see CCP agents are shilling double overtime to keep their foreign bag holders from dumping bags.\n\nAlso time to short the fuck out of this.", "score": 5, "replies": [{"body": "Few months too late", "score": 1, "replies": []}]}, {"body": "Who invests in China? 😂 place is a shit show with government corruption", "score": 15, "replies": [{"body": "Most everyone a lot richer than you.", "score": 16, "replies": [{"body": "This.", "score": 3, "replies": []}]}]}, {"body": "I agree.  Picked up some leaps on a 3x bull china fund which I’m not allowed to mention last week.", "score": 5, "replies": []}, {"body": "The ccp is very smart. You really get the sense that they understand how to message to investors, particularly fickle western investors.", "score": 4, "replies": []}, {"body": "“The CCP is extremely smart”; this is the biggest lie of the 2000s. They don’t know what the fuck they’re doing; most of the people in the CCP have little formal education in finance or economics, that’s the main reason why they take over businesses instead of just starting them themselves. China has tricked the world into thinking its a superpower but it’s nothing more than smoke and mirrors; most of the wealth they claim to have has no backing.", "score": 6, "replies": [{"body": "You're incorrect- China actually has the advantage of population. Which means a small proportion of educated people would be more people than what we have in America.", "score": 1, "replies": [{"body": "Did I say the population or the CCP? China doesn’t have a meritocracy; they’re just putting rich peoples children in power and they’re becoming increasingly dumb each generation.", "score": 1, "replies": [{"body": "That's somewhat incorrect, actually. China uses a social credit rating system paired with district schools. \n\nI'd imagine in richer areas the schools are better, but that doesn't mean everyone at those schools is rich. And on top of that, Asian culture is very focused on education- much more so than in America.", "score": 1, "replies": []}]}]}]}, {"body": "Might be just an excuse to crash property market.", "score": 2, "replies": []}, {"body": "When strong appear weak.", "score": 2, "replies": []}, {"body": "So uhh, calls or shares it is?", "score": 2, "replies": []}, {"body": "All I see is this is a big fucking deal. I wouldn’t simply discount it was “FUD”… it can, and will, have some serious side effects. I appreciate your optimism though!", "score": 2, "replies": []}, {"body": "Didn’t the Anbang ceo get killed by the ccp?", "score": 2, "replies": []}, {"body": "I just paid for my brother's wedding and got my  mom a new house....WALAHI WSB DID THOSE", "score": 2, "replies": []}, {"body": ">The CCP is extremely smart and will do anything to ensures social and financial stability.\n\nBro, the biggest foreign policy story in America this week was the Chinese Department of Defense had such bad intelligence and such a misunderstanding of how America works that they thought Trump was going to just nuke China out of the blue back in November.\n\n> Final comment: I spoke to 2 Bloomberg reporters last week. Their bonu$ was dependent on how much their stories could impact a company's stock price.\n\nLol.  What kind of “bonus” does a Bloomberg reporter get?  Do those losers even make $75 a year in total comp? 🤣😂🤣", "score": 2, "replies": [{"body": "Yeah OP seems a tad bit delusional", "score": 2, "replies": []}, {"body": "That's more than Evergrande employees get", "score": 1, "replies": []}]}, {"body": "Its certainly getting media attention and causing FUD. Markets hate FUD. I'm joining the gay bear gang. 🌈 🏳️‍🌈 🌈", "score": 2, "replies": []}, {"body": "\"Buy the stock, he said to me\" - Brave Spartan", "score": 4, "replies": []}, {"body": "OK…everything’s cool in China.\n\nWhat about Western Evergrande investors?", "score": 4, "replies": [{"body": "theyll get .25 on the dollar 😂", "score": -5, "replies": [{"body": "I doubt they will get anything.", "score": 7, "replies": []}, {"body": "CCP feeling generous?", "score": 2, "replies": []}]}]}, {"body": "NGL, first thing that caught my eye was “water sports tech”.  Piqued my curiousity", "score": 3, "replies": [{"body": "![img](emote|t5_2th52|4275)", "score": 2, "replies": []}]}, {"body": "OP larping as someone who knows... doesn’t know jackshit...\n\nLook it’s bad enough you put money in yourself stop trying to suck others in", "score": 3, "replies": []}, {"body": "Buy OPAD !", "score": 0, "replies": []}, {"body": "Remind me on Thu when they default.", "score": 1, "replies": []}, {"body": "Welp, crash confirmed", "score": 1, "replies": []}, {"body": "Wouldn’t that e good for us in America?", "score": 1, "replies": []}, {"body": "Apparently Evergrande is talking about paying back debts with hard assets instead of cash (actual liquidation) . I don't know why you are pumping so hard, maybe you bought at the top and you're hoping this sub can provide enough buying pressure to help unload your bags. The fact is, Western big money is dumping and dumping hard. It isn't FUD, it's reality. You can put on your tinfoil hat all you want, no one is jumping in that endless pit with you. Sorry man, just take the loss now and avoid being financially ruined by this investment.", "score": 1, "replies": []}, {"body": "Who cares if it's FUD. If it makes us money FUD all the way.", "score": 1, "replies": []}, {"body": "They built multiple city with zero inhabitants...  And had their rube citizens sink all their savings in. \n\nXi's utopia is going great", "score": 1, "replies": []}, {"body": "Is this you? Or are you copying and pasting on behalf of the ccp?\n\nhttps://twitter.com/asiahodl/status/1439523847305302017?s=21", "score": 1, "replies": []}, {"body": "How about western companies deeply engaged in the chinese market? HSBC is a big (mortgage) lender in China and might be left behind by the ccp. \n🐻gang is buying OTM Puts on HSBC", "score": 1, "replies": []}, {"body": "I knew these “media blitz” stock stories were all about manipulation…..unbelievable.", "score": 1, "replies": []}, {"body": "Biggest retard on wsb goes too.... OP!", "score": 1, "replies": []}]}
