{"title": "What would it take for Apple to lose their top 10 spot in the S&P500?", "selftext": "As you know, apple has been the biggest company for quite a while now. It is very difficult for me to envision them losing this spot for like the next 20 years at the very least.\n\nWhat do you guys think it would take for Apple to drop out of the top 10 in the s&p500?", "id": "pg78n3", "created_utc": 1630544319.0, "score": 508, "upvote_ratio": 0.92, "num_comments": 410, "comments": [{"body": "Probably a situation similar to IBM where other companies come up and apple didn't get with the times.", "score": 701, "replies": [{"body": "That’s a good point. Also, their closed ecosystem was nearly their undoing in the early 90s before Jobs came back with iMac, leveraging BSD for OSX, that lead to the iPod and the iPhone. And they are heading down that road again with the M1 and no repair ethos to sustain their shitty retail stores.", "score": 172, "replies": [{"body": "Then they'll drop into near bankruptcy and 20 years later redesign the tricorder that can charge itself by absorbing extra carbon form the air while all embedded into your brain so you can AR 24/7 the world for a subscription or VR live with monster from pokemon +\\-.", "score": 83, "replies": [{"body": "got a napkin?", "score": 26, "replies": []}]}, {"body": "> no repair ethos\n\nIt boggles my mind that this has not deterred people from buying apple products. \n\nI recall going into the \"genius bar\" and they concluded that repair would cost $1,300 after a week+ of testing. I searched more for the problem online and found it was a firmware bug that got fixed for $10 software.", "score": 12, "replies": [{"body": "Many people aren't interested in repairing their own stuff anyway.  And many just replace their phone every year or two, regardless of how well it's working. Frustrating, but people are lazy.", "score": 13, "replies": [{"body": "It's a step further though. Apple actively makes repair inaccessible.", "score": 4, "replies": []}]}]}, {"body": "The M1 isn’t a “closed ecosystem”, it just doesn’t offer 32-bit compatibility afaik, which is pretty ancient architecture, tbh. Being able to use mobile apps on your computer is pretty cool, I think. It just won’t run old games. The trade-off for better performance and heat makes it worth it IMO.", "score": 13, "replies": [{"body": "Not necessarily. M1 requires some programs to be re-written to run natively because it uses a different architecture than x86.", "score": 5, "replies": [{"body": "No it doesn’t it has built in translation for x86 apps\n\nAlthough I don’t think anyone is talking about M1 specifically when they say a closed ecosystem.", "score": -1, "replies": [{"body": "For now it does", "score": 1, "replies": [{"body": "Why do you think apple would get rid of Rosetta 2 they just spent a shit load of resources developing it. I’m sure at some point several years from now when they’ve been done manufacturing x86 macs for a couple year they’ll start to wind down support. Last time they made an architecture transition Rosetta was supported by new MacOS releases for 5 years.", "score": -1, "replies": []}]}]}]}, {"body": "What percent of their customers care about what chip is in the phone compared to all of the other UX considerations apple is really great at making. I get chip technology allows for some of those things to run, but I have struggled with understanding why we need something so powerful in our phones for the average user. \n\nTldr: I don’t think bad chips could tank apple", "score": -1, "replies": []}]}, {"body": "I think their closed ecosystem will be their downfall. As tech expands and doversifies various uses will become very more integrated and they won't be able to keep up with \"the apple version\" of each new thing. You can already see this in the ridiculous notion they think that they are going to have a car. They will either have to open their ecosystem up alot to outsiders or step down from that top position.", "score": -2, "replies": [{"body": "Huh? Basically every mid-level new car in the US has Apple play.", "score": 5, "replies": []}, {"body": "Au contraire, their ecosystem is incredibly frictionless and makes it hard to leave. All of their products have huge synergies and take away a lot of complications. And the billions they print every week don’t lie", "score": 0, "replies": [{"body": "Again I'm talking about the future but by all means don't read what I said.", "score": 2, "replies": [{"body": "Everything Apple is ridiculous until they do it and everyone follows. No better example than the AirPods and removing the headphone Jack from phones. If *that* didn’t sink them I really wouldn’t bet against them. \n\nBut hey, go short and prove me wrong", "score": 0, "replies": [{"body": "Why would I short apple? They're a fantastic company. I'm not saying they aren't. I'm saying they're closed ecosystem will become a liability. Airpods are hardly impressive or innovative. And yes they idea they will build a full scale production car is ridiculous. The automotive market is unbelievably hard to break into and they will fail.", "score": 2, "replies": [{"body": "Their closed ecosystem made them the most valued company so idk what you’re thinking about. \n\nCar might fail but who cares. They have money to burn and its investment in innovation. Not all innovations have to succeed. Amazon famously hopes some of their innovations fail bc it means they are pushing to the max. Safe companies don’t succeed (cough ibm)", "score": 0, "replies": [{"body": "What got them here won't get them there. The post is asking what will cause their fall out of the top 10 and I gave my opinion and reasoning.", "score": 2, "replies": [{"body": "What I don’t think you understand is the network effect and how it applies to an ecosystem of products. Every product that apple adds has a network effect onto the whole ecosystem. An example is find my device. Cool with an iPhone, but when you add your MacBook, AirPods, your relatives devices it becomes much more powerful. Same with the cloud and seamless backup of all your data. All of these products decrease *friction*, which as we know is one of the (if not *the*) most motivating user benefit. A good example of this is people paying out their ass for a 5 min takeout delivery. \n\nSo back to apple, every time they decrease user friction through a new product offering, they decrease the chance that a user abandons them for a decentralized ecosystem. So I don’t buy your thesis that their closed ecosystem will be their downfall. It’s the same with Google, Google cal, docs, drive, gmail, spreadsheets etc.. I don’t even know who the competitors are bc id never consider switching bc it’s so convenient to have all my emails, docs etc.. in one place. If I have a new device I just sign into my chrome account and *everything* is there. That’s extremely powerful. Even if I thought Google was some evil company I wouldn’t care bc the experience is so convenient. Maybe others won’t admit that, but that’s the reality.", "score": -1, "replies": [{"body": "Ok", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "If Apple can do a car, Tesla can do a phone.", "score": 181, "replies": [{"body": "People said the same about Intel and smartphones, and we all know how that went...", "score": 144, "replies": [{"body": "Hold on, let me just take down a note on my Newton...", "score": 83, "replies": [{"body": "Eat Up Martha?", "score": 8, "replies": []}]}, {"body": "[deleted]", "score": 29, "replies": [{"body": "> That's because Intel mobile chips were always power hungry. They couldn't get a day standby time or whatever horrible battery life it was. \n\nThe Intel PXA270 XScale processor (which was an ARM implementation) in my old Palm Treo 650 gave me 2-3 days of battery life. They sold the XScale IP to Marvell later on.", "score": 16, "replies": [{"body": "yea this. i have an hp ipaq somewhere that did pretty good on battery life.", "score": 2, "replies": []}, {"body": "Intel's previous management teams have got to be some of the most foolish people to walk the planet. They've passed on so many golden eggs in the past.", "score": 1, "replies": []}]}, {"body": ">Tesla wouldn't make their own chip, \n\nThey are trying.\n\nhttps://www.tomshardware.com/news/tesla-d1-ai-chip", "score": 9, "replies": [{"body": "No. They did.  Their HW very 3 is their own silicon.  Not GPUs. Also, they've passed power on for the dojo chip, so they succeeded a second time.", "score": 8, "replies": []}, {"body": "That one is very specific for neural net AI training, basically ASCI.  Could Tesla build their own ARM chips, to make a cell phone?  Sure, but they wouldn't build their own chip from the ground up just for a cell phone.  Because what you are implying is that they would build their own machine code, compiler, and then software stack to deal with translation from typical ARM code that uses for something like Android.\n\nThe only way they would design their own chip is they also made their own phone software, which would require quite the investment with the chip.  Could it happen?  I don't think it would until you see them make an announcement to recruit designers specific for this, or when they start hiring such people.\n\nThere are still issues with the onboard software to their cars.  Licensing ARM, designing an ARM chip, and customizing Android would be the most likely route to Tesla phones.", "score": 2, "replies": []}]}, {"body": "And their own OS? Because if they are just using Android, what's the point.", "score": 1, "replies": []}]}, {"body": "And Microsoft. Just disastrous phones.", "score": 1, "replies": []}]}, {"body": "If you can dodge a wrench, you can dodge a ball", "score": 29, "replies": []}, {"body": "Apple is not a phone, they are an ecosystem which forces you to buy the phone…", "score": 70, "replies": [{"body": "[deleted]", "score": 94, "replies": [{"body": "I agree that they don’t force you into their content aggregation model… but once you’re in, it’s arduous for the consumer to get out of it.", "score": 33, "replies": [{"body": "That’s true. As an apple user all my life I can’t imagine getting something from a different company. I have loads of memories stored since I got my first ipod. To go over to a different os would disconnect me from loads of data like emails and saved passwords(All of which I can export but it’d be a major pain in the ass to do so).", "score": 8, "replies": [{"body": "I think it goes beyond just emails and saved passwords. Switching from any phone to a competitor requires transferring data.\n\nThe difficulty switching away from Apple products is also because they different products work well together. Using AirPods Pro and opening the case to see battery life on your iPhone, or receiving phone texts on your mac, or configuring the Apple Watch with your phone, are all features that would be lost.\n\nAnd even after replacing all Apple products, the competitors don’t offer these features or integrate them in a more uncomfortable/difficult to use way.", "score": 4, "replies": [{"body": "The only ones that can offer similar functionality is Samsung and now they're adopting similar strategies to Apple. Some of the new galaxy buds features are only open to galaxy users, lack of repairability, removal of microSD/3.5mm etc.", "score": 1, "replies": []}]}]}, {"body": "And that’s a bad thing right?… right?", "score": 1, "replies": []}]}, {"body": "They don’t force their users yet so many of them are in the ecosystem. That’s why Apple is good at what they are doing. People like their products. \n\nAs for my answer to the question, Apple will no longer be a top dog when they stop innovating. I can’t see why that would ever happen consider their history, leadership, company structure, and top notch employees, but hey, the day where innovation stops is the day Apple falters.", "score": 35, "replies": [{"body": "im not trying to hate or anything but honestly i havent seen Apple be innovative in a while lol", "score": 8, "replies": [{"body": "What do you mean? They innovated by removing the headphone jack and created the 100 dollar Airpods", "score": 8, "replies": []}]}, {"body": "iPhones innovative? Basically Apple is relying on the ecosystem and iOS at this point because their phones are years behind their competition in terms of innovation. While they might be \"innovative\" in other segments, I think they will eventually end up like Nokia if they keep raising prices with no innovation.", "score": 1, "replies": [{"body": "Uh…several products have came out after the iPhone. And it doesn’t matter what other companies are doing, I don’t see a serious competitor right now for the iPhone. And no, they won’t end up like Nokia no matter how you want it to happen.", "score": -1, "replies": [{"body": "I don't care tbh, but since Steve jobs died, their innovation has gone down significantly. Iphone is far behind most other flag ship phones in terms of tech, the competition still doesn't offer enough yet to be worth switching over for most Apple users, but just like the generation switch from mobiles to smartphones, people will eventually use foldable phones if they can provide the same durability and price in a few generations. If Apple doesn't magically appear with a foldable version or something similar, which seems unlikely because they've not created a true new phone in years, then they will lose in the end, because who wants the latest iPhone when all your friends has a pad in their pocket. Today foldable phones is still premium products for a select few early adopters, but it likely won't be the case in 4-5 generations.a", "score": 3, "replies": [{"body": "I agree and competitors are all making their own ecosystems as well. Amazon gave me some money to start using their kindle, Amazon music, and Amazon photos. Google has similar services - just hasn’t paid me yet.   \n\n\nEventually their ecosystem will just be one of many available and with the premium costs Apple keeps demanding, the cost of switching over to a competitor becomes more appealing.", "score": 3, "replies": [{"body": "Indeed, and it's actually quite easy to migrate between ecosystems today. I tried iphone in 2018 after having android for a few years, then switched back in 2020 to Android, had no issues what so ever migrating data, and only some slight inconveniences with my airpods not having 100% functionality. Even the OS is quite similar today. Still think there needs to be some significant functionality upgrade for people to make the switch though, for example a massive screen in a portable format. For me it was enough with no notches on Galaxy to be worth it. For me seeing an iphone screen today with that ugly black thing blocking the screen feels like looking back at some old thick brick smartphone with 4 inch display compared to a slick modern 6 inch zero border phone.", "score": 2, "replies": [{"body": "Yeah and you can also live between ecosystems. For example, I do everything mainly on an iPad, but use Amazon’s ecosystem through their apps instead of Apple’s ecosystem.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "While I have a decent chunk of my portfolio in Apple and over the last decade plus I too, have never owned any other product aside from an iPhone. I think there are a lot more solely iphone only customers.", "score": 6, "replies": [{"body": "Same", "score": 3, "replies": []}, {"body": "I’m slowly acquiring all the products. I reckon this happens with a lot of people. iPhone, AirPods, Apple Watch, MacBook, iPad, Apple TV.. they all work so well together", "score": 2, "replies": [{"body": "I agree, I know they do work well cause everyone I know loves their products. Shit I got my 86 year old grandma a network compatible Iwatch so she didn’t have to have the heavy phone in her pocket for her morning walk and she absolutely loves it. I just don’t use tech much. I’m in my mid thirties and I’ve never even owned a personal computer since college haha.", "score": 0, "replies": [{"body": "You’re probably happier than most people with all the gadgets!", "score": 1, "replies": []}]}]}]}, {"body": "You don’t seem to understand the premise of the ecosystem. If you have an iPhone and you want a portable pair of headphones you’re likely to choose the Apple AirPods. If you have an iPhone and you’re interested in a smart watch you’re likely to choose the Apple Watch. Once you have the AirPods and an Apple Watch, you’ll probably buy an iPhone as your next phone as well.", "score": 10, "replies": [{"body": "The other side of this is that they make good products. \n\nThe Apple watch is one of the best smartwatches, same for their AirPods which generally rate high on any comparison site. \n\nPeople would move away from the \"ecosystem\" if the products were crap.", "score": 6, "replies": [{"body": "They're balancing the scale of price, function and comfort. At this point both price and function is falling behind the competition. While Samsung is approaching their 4th gen fold, Apple still has that ugly notch on the screen with redicilous pricing. It will take a while but eventually people will want the new standard functions and leave the Apple ecosystem behind. I think maybe gen 7 or 8 of Samsung fold with lower pricing might be the turning point where people feel as they are missing out on functionality seeing their friends with practical, affordable, durable and foldable pads in their pockets. So they don't actually need to be crap, just outdated.", "score": 3, "replies": []}, {"body": "Nah, they have ok products but far from great. They're \"jack of all trades\" and meant to be easy to use for a toddler or a technofobic boomer, anyone who knows how to Google answers will get more mileage out of competitiors...if they try.\n\n\n\n\n\nAny fitness band will outlast Apple Watch and be better for workout, they'll support wireless pay, good apps etc and last weeks not a day (Garmin is the king). Or Xiaomi if you're on a budget, most features at 1/10th or less of the price. Or any big more expensive brand that caters to *all kinds of different users and needs* due to competition. I can buy anything, even noname products from Ali and they'll work with android/pc/whatever... Only apple hates standards and competition.", "score": 1, "replies": [{"body": "Look I have an Iphone, Garmins Fenix 5 and Jaybird headphones. I'm not just riding Apple because I buy their gear because a lot of the time I don't. \n\nBut depending on what you need it for, an Apple watch can be a much better option for someone than a Garmin which are much more focussed towards being a pure activities based smart watch. \n\nSame with the headphones, the AirPods Pro are probably some of the best on the market but there are better ones for running in, so I got those. But for most people that just want a pair of wireless headphones then they are great options.", "score": 2, "replies": []}]}]}, {"body": "Sounds a bit like “if you give a mouse a cookie”", "score": 1, "replies": []}]}, {"body": "Same", "score": 1, "replies": []}, {"body": "Do you still need iTunes to transfer your own photos off your phone?", "score": 1, "replies": []}, {"body": "You are not the target Apple Customer.    They thrive on the people who are “all in on the eco system”, music, TV, News, iPad, iPhone, watch, lap top, earbuds, speaker, WiFi; etc all seamlessly connected under their proprietary cloud and hardware.", "score": 1, "replies": []}]}, {"body": "Also a lifestyle brand at this point.", "score": 5, "replies": []}, {"body": "What? You can't have an ecosystem without hardware to deliver it. iPhone alone is almost half their revenue and hardware in total is about 80%.", "score": 16, "replies": []}, {"body": "Weird - I have an iphone and nothing else from Apple and my g/f has an amazing m1 macbook - and an android phone.  Weird.", "score": 2, "replies": []}, {"body": "Got a second gen iPod nano when they were new for Christmas. Had to set up an iTunes account and here we are 15’ish years later 2 iPods, iPad, 4 iPhones and a watch later all because I had money invested in the iTunes Store.", "score": 4, "replies": []}]}, {"body": "Ppl would buy an apple car. Would you buy a Tesla phone ?", "score": 15, "replies": [{"body": "Making cars is hard. What experience does Apple have that makes you think their car will be good?", "score": 11, "replies": [{"body": "Making internal combustion cars is hard.\n\nElectric cars are far more straight forward machines.\n\nHonestly \"car brands\" as we know it are going to be changed substantially as electric becomes dominant. Engineering differences are minimal compared to variants of internal combustion engines.\n\nThere will be huge suppliers of electric engines and batteries and chassis and then the \"car brands\" will likely just slap exteriors/interiors around them.", "score": 12, "replies": [{"body": "Is Electric Cars are easier to make then why is GM recalling every Bolt on the road today?\n\nMaking a car is hard. I'm skeptical Apple will ever achieve more than a niche in the very high end luxury car market.", "score": 3, "replies": []}, {"body": "Electric cars are simple in operation but still challenging to design. From a systems perspective every little design choice affects range and aging, both extremely important numbers for customers.\n\nFrom the crash and safety point of view it's still very unchartered territory for many OEMs, and their old design guidelines don't work anymore.\n\nRegarding the changes over time of brands, any disruption will cause some brands to fade and some to be born, but anyways the ICE market was pretty stagnant regarding development. The huge suppliers + OEMs slapping on a badge was already true. Excluding engine manufacturing, OEMs literally just stamp out some metal and assemble the plethora of supplied bits and bobs.\n\nWe might see full platform + top hat as an end result but it'll still be analogous to engine + chassis architectures currently used.\n\n\nSource: I see this shitshow at work lol", "score": 2, "replies": []}, {"body": "Neither ICEs nor E-Motors are hard. ICE is a 100 year old technology that's very well understood and very cheap to make.  \n\nIt's the other bits of the car that aren't the powertrain (chassis, ride, NVH, comfort, durability, etc.) which are the difficult part.     \n\nAlso, Apple's famous reluctance to let literally anyone else service their products won't fly in the auto space very well.", "score": 1, "replies": []}, {"body": "Make, not hard? Lol sure. Are you one of the people who say 'the competition is coming' regarding Tesla? Because they haven't. And aren't. Because 'make' is one thing. 'Make competitively' is something else.\n\nDifferent supply chain. Different engineering talent. Higher focus on efficiency.", "score": -1, "replies": [{"body": "You are wasting your time with these basement engineers and automotive entrepreneurs.", "score": 0, "replies": []}]}]}, {"body": "for me personally, if it was cheaper and had more or less the same features that's it.", "score": 2, "replies": [{"body": "Knowing apple its not going to be cheaper", "score": 27, "replies": [{"body": "Knowing Apple it doesn’t need to be and it would still sell better than the existing alternative options. See the AirPod.", "score": 7, "replies": [{"body": "Airpod is better than most of the other options though, at least for Apple users (it was at least when it launched, and then had enough of a first mover advantage).", "score": 3, "replies": [{"body": "Just like how the iCar (if that is the name) would be better for Apple users. They are not going to make a car that has poor integration with their ecosystem.", "score": 1, "replies": [{"body": "Apple has long stopped using the i-branding for new products.    \n\nBut a car's principal purpose is not to be an extension of your computing device, but to ferry you from place to place. That's why in this case the ecosystem would very much be a secondary issue if they don't get the car part right.", "score": 4, "replies": []}]}]}]}]}]}, {"body": "Money", "score": 2, "replies": []}, {"body": "A extensive a out of experience and drive in making a positive user experience, outside of that they can pretty much hire anyone they need.", "score": 0, "replies": [{"body": "r/ihadastroke", "score": 5, "replies": []}]}, {"body": "That’s why apple is trying to go the smart route and partner with an established auto maker\n\n&#x200B;\n\nElon went the hard way, and is realizing the manufacturing difficulties of building a car", "score": 0, "replies": [{"body": "Well they shipped their millionth car the other day and project to build another 750k this year, so I suspect they may have got the hang of it by now", "score": 2, "replies": [{"body": "No, 1 millionth model 3. The 1 millionth car came a good deal before that.\n\nAlso 2021 expectations are around 850k fyi.", "score": 2, "replies": []}]}]}, {"body": "Apple has deep experience with supply chain integration.\n\nTim Cook is a master in overseeing worldwide production processes.\n\nApple’s design department melds industrial design with jewelry like appeal.\n\nApple product(s) *fit and finish* and manufacturing tolerances are world class.\n\nApple’s got the cash to bring a vehicle to market without cutting corners.", "score": 0, "replies": []}]}, {"body": "Hell no. I wouldn’t even buy a Tesla car.", "score": 3, "replies": [{"body": "The anti-fanboy nature of some people regarding Tesla is reminiscent of the Apple hate I would see in the early 2000s.", "score": 0, "replies": [{"body": "Except Apple had utility, and that was way before it came out wiith smartphones, so it was a UNIX/High performance PC company. So trying to compare it with a stock supported by shallow pop consumerism, is ridiculous.\n\nBesides, the whole premise behind Tesla is an oxymoron: \"Tesla: How to make a car that has a bigger carbon footprint and negative environmental/resources impact than a lifted monster cab pickup\"", "score": 0, "replies": [{"body": "Not seeing the parallels between Apple and “shallow pop consumerism” is ignorant at best. Apple computers were never considered high performance. They were considered to be overpriced and for hipsters that didn’t own a “real PC”. Apple paved the way for “shallow pop consumerism”.\n\nI’m assuming you’re younger than me by a good bit or you’d remember this.\n\nI own stock in both companies to be clear.", "score": 1, "replies": [{"body": "I think you're the one who is ignorant about the Apple products in 2000. It was a technical programming UNIX nerd's and high performance digital graphics artist computer company, unpopular with consumers, before the iPhone took off in the 2010's. Most people didn't even own smartphones until after the mid-2010's and portable music lists were on dirt cheap mp3 players. Steve Jobs led the transition to unix-based MacOS, which made the programming geeks who liked Apple's high performance computer architecture very happy.\n\n> Apple's financial losses continued and the board of directors lost confidence in CEO Gil Amelio, asking him to resign. The board asked Steve Jobs to lead the company on an interim basis, essentially giving him carte blanche to make changes to return the company to profitability. When Jobs announced at the World Wide Developer's Conference that what developers really wanted was a modern version of the Mac OS, and Apple was going to deliver it, he was met with thunderous applause. Over the next two years, major effort was applied to porting the original Macintosh APIs to Unix libraries known as Carbon. Mac OS applications could be ported to Carbon without the need for a complete re-write, making them operate as native applications on the new operating system. Meanwhile, applications written using the older toolkits would be supported using the \"Classic\" Mac OS 9 environment. Support for C, C++, Objective-C, Java, and Python were added, furthering developer comfort with the new platform.\n\nPeople who weren't computer engineers didn't even understand Apple's high performance computer architecture. That's why so many kids grew up building hack Windows PCs (and still do). The only thing that has made Apple popular since the mid-2010's was its BSD Unix operating system stability, and that's when people who weren't able to do their own IT support began to switch from buggy, unstable Windows PCs to Apple. \n\n> I own stock in both companies to be clear.\n\nApparently, your owning stocks doesn't necessarily mean that you understand the companies whose stocks you own.", "score": -1, "replies": []}]}]}]}]}, {"body": "Would they? An apple car sounds so dumb to me...", "score": 2, "replies": []}, {"body": "How good is the phone? And how much does it cost? And how does it compare for the price and quality up against other phones?\n\nEdit: LOL at being downvoted in r/stocks for asking for details.", "score": 0, "replies": [{"body": ">What would it take for Apple to lose their top 10 spot in the S&P500?\n\nIt will answer the calls for you..!", "score": 1, "replies": []}]}]}, {"body": "I don’t think Apple is doing a car. I believe they’re partnering with car brands that will then implement Apple technology inside the new cars.", "score": 2, "replies": []}, {"body": "no, if something massive and popular that is new comes, thing is that IF it comes apple may build it, be it VR, AR, car, Bot etc", "score": 1, "replies": []}, {"body": "Apple can do more than cars. What about personal rockets for our trips to outer space? Remember when computers required a million dollar budget and only corporations and colleges had them? Then they became affordable for personal home usage.", "score": 0, "replies": []}, {"body": "Truest thing i'vre read today", "score": 0, "replies": []}, {"body": "If you can dodge a car, you can dodge a phone", "score": 0, "replies": []}, {"body": "no they can't. For starter, Apple is money to do anything lol", "score": 0, "replies": []}, {"body": "Elon musk is smarter than doing phones, he could invade the space or make a military private satellite AI network.", "score": 0, "replies": []}, {"body": "Pffff thats a laughable take. Elon is slowly realizing some of his ideas are a little more difficult than he thought.. good luck beating apple in the smart phone market", "score": -1, "replies": []}, {"body": "tesla can't even do a car.", "score": -1, "replies": []}]}, {"body": "Their market share has pretty much been decreasing for years now but global growth has kept them increasing overall sales.  Wonder how much longer that will last though?", "score": 3, "replies": [{"body": "There's still a whole lot of world left. Only 50ish percent of people in China have a smartphone and  Apple has about an 8% market share. Add in India then swing around to African countries... Apple can keep growing internationally for a long time.", "score": 4, "replies": [{"body": "Only if Apple is able to sell at a much lower price point or come out with a real budget iPhone (even more than the se) which would risk them losing their luxury status. Unless they create a subsidiary that creates low budget iPhones under a different name.", "score": 1, "replies": [{"body": "There's always uncertainty. I simply pointed out they have plenty of room to expand.", "score": 0, "replies": []}]}]}]}, {"body": "Or government splitting Apple into 5 companies", "score": 2, "replies": []}]}, {"body": "Many said the exact same about GE, ExxonMobil, IBM, Cisco, AT&T, HP, Intel, etc. etc. etc.\n\nApple didn't start getting big until the iPhone came out in 2007, 14 yrs ago. Is it that hard to believe anything can happen in the next 20 years?\n\nGuess what the biggest company was 20 yrs ago in 2001... GE at 405 billion market cap. Microsoft was second at 290 billion. Apple was nowhere near top 10 at 8 billion.", "score": 330, "replies": [{"body": "I guess my question would be -- is it hard to spot the decline? For example, can we look into the history of GE, Intel, or HP and pinpoint a specific 1-3 year time frame when we can tell they are losing marketing share and not innovating enough to be a top tier company?\n\nOr is it impossible to tell when you're the frog slowly boiling.", "score": 93, "replies": [{"body": "It depends, sometimes it's mistakes compounding overtime, other times it's one big mistake that costs a company.\n\nXerox is a good example of a great company that made one huge mistake that lost them a ton of money. Xerox could have been one of the big tech companies of today if their management hadn't been so short sighted.\n\nXerox used to have some of the most highly advanced computer technology of the time, and they did basically nothing with it, which allowed other companies like Apple and Microsoft to leapfrog them. Why did Xerox do nothing with all their highly advanced computer technology? Because their main line of business was selling paper, and they believed the hype from their computer people that the future was heading towards a paperless office. Xerox couldn't have that, they had to protect their legacy paper business, so they tried to keep the technology a secret for the most part.\n\nA lot of the Xerox tech people got fed up with Xerox doing nothing with their groundbreaking technology, so they went to work for Steve Jobs and helped develop that technology for Apple instead.", "score": 140, "replies": [{"body": "They were the first to invent the computer mouse!!!", "score": 37, "replies": [{"body": "I believe they had the first graphical user interface too", "score": 10, "replies": [{"body": "Yes, the Xerox Alto was revolutionary", "score": 1, "replies": []}]}]}, {"body": "Limitless paper in a paperless world.", "score": 25, "replies": [{"body": "Real business happens on paper. Write that down.", "score": 11, "replies": []}]}, {"body": "That's a great example. Thank you for sharing that.", "score": 22, "replies": []}, {"body": "In the Steve Jobs biography, Steve recounted being given a tour of Xerox headquarters in the late 1970s or early 1980s, where they freely showed off all sorts of innovative technology they were working on such as the computer mouse and GUI - ideas that Steve promptly stole  and integrated into Apple.  \n\nWith a little more foresight, and perhaps some intellectual property lawyers or non-disclosure agreements, Xerox could have licensed the technology to Apple and been the equivalent of Adobe today. Instead, they’ve just puttered sideways for the past 20 years after being decimated in the tech bubble.", "score": 3, "replies": []}, {"body": "There's a long list of companies who failed because of the desire to protect a legacy business despite obvious signs it was getting replaced. Xerox is a great one, but there's also Kodak and IBM (protected mainframes far too long before pivoting at 5secs to midnight), Nokia, Blackberry etc. \n\nAnd of course there's the situation right now with most legacy car manufacturers, Toyota in particular. \n\nThe problem with disruption is it happens fast, just ask Nokia. Or look at the number of cars on the road in 1906 vs 1912 (pretty sure that's the right dates, but if not there was a like 5 year period where cars went from a handful to tens of thousands to \"everywhere\" same as smartphones)", "score": 3, "replies": []}]}, {"body": ">\tOr is it impossible to tell when you're the frog slowly boiling.\n\nYou can’t tell untilll the competition is successful, then it’s too late.\n\nCould anyone say Sony lost its spot as the top portable audio player brand, before the iPod?\n\nCould anyone predict RIM would no longer be the top smartphone brand before the iPhone?", "score": 9, "replies": []}]}, {"body": "[deleted]", "score": 34, "replies": [{"body": "That’s why I buy SP500. You no good no more? You OUT!", "score": 40, "replies": [{"body": "This is probably the best analogy you can make about S&P funds and why they have been invincible for years. They shuffle out underperforming tickers", "score": 22, "replies": [{"body": "This and also I dont care if you are $1000B evaluation and 1000000% growth potential and hyped and whatnot, if you don’t turn a profit for 4 quarters you ain’t in the club.", "score": 3, "replies": []}]}]}, {"body": "I believe Apple actively works against that. They’ve learned from other companies shortcomings and are willing to innovate and adapt. The satellite 13 phone will surely eliminate the need for 3rd party carriers like att and Verizon. \nThat’s their next move, I guarantee. Don’t pay Tmobile. Buy the phone and data plan straight through apple. \nDrivers license was approved to be stored\nOn iPhone today in many states.\nWatch will monitor temperature, heart activity, fucking ovulation peaks for women. The watch will become huge with health care.", "score": 28, "replies": [{"body": "Satellite service will not eliminate the need for carriers, it's a fallback service for when cellular isn't available.", "score": 17, "replies": [{"body": "To start sure. But let’s say 5 years from now they can have 5G speeds anywhere on the planet through their satellite service? Might sound like a dream right now but that’s definitely where their heads at", "score": 5, "replies": [{"body": "To believe this you have to understand absolutely nothing about electromagnetic waves.  \n\nService from space for a relatively small number of users at any one time?  Yes this can be done.  For the entire population?  No.\n\n5G requires *more* service point density and *shorter* signal distances, as is the norm with new wireless technologies and this is because of physics.", "score": 16, "replies": [{"body": "That's not true, 5G includes lower freq bands as well that will have more range (though less bandwidth). Space isn't that far away.\n\nCheck out what is happening with synthetic aperture (radar) imaging right now. Satellite arrays with beam forming (and an absolutely massive investment to scale up) can absolutely reach every single person on earth if we choose to go that route. I doubt it'll ever be cheap enough, but the physics is trivial.", "score": 1, "replies": [{"body": "People want more bandwidth, not less.  The debate here is that some people think cellular carriers will be made obsolete soon because everyone will have service just as good or better via satellites.  That isn't going to happen.  \n\nI'm aware of beam forming, regardless of cost it can't serve bidirectional links to millions of people in a city with anything close to as much bandwidth per user as a mesh of adjacent cells closer to the ground.  With very low bandwidth at high cost to build?  Sure maybe.", "score": 2, "replies": [{"body": "You'd be surprised what can be done with synthetic aperture receivers. Basically the same thing as beam forming but in reverse. Bi-directional high frequency links using normal cell phones have already been demonstrated. The bandwidth can be done.\n\nI agree that it's unlikely, at least from a cost point of view, and especially in the near term (next 20 years). But it's absolutely physically possible, and the technology already exists (heck, millimeter wave is already dominant in satellite links). It's just a matter of scaling, and that just means money (and lots of it). If you really want good coverage and high bandwidth around the world, it might be the only way... Musk et al seem to agree.", "score": 0, "replies": []}]}]}, {"body": "You don’t think that can change? Or better yet you don’t think they can eventually make a better technology than 5G that can be beamed down to everyone’s phone?\n\nWasn’t that long ago that internet on the phone seemed impossible", "score": -10, "replies": [{"body": "Wireless communication, with any technology at all, only scales to a certain number of users within a certain area because of interference.  Cellular devices are actually told by the towers how much transmission power to use to avoid adding noise to the neighboring cells.\n\nFor ground to satellite communication, in a populated area there are too many users who are essentially the same distance to any given satellite, so they have to share the same point of access and share airspace and bandwidth.\n\n1 million people in a city today are served by well over 1000 cell towers.  One satellite would be essentially the same distance to all of these people and many more.   It's possible to design a satellite based system that can serve a very large number of two-way network links but the speed each user would get would be orders of magnitude less than a more local cellular (as in, made of mostly separate \"cells\") technology where each user has a much larger fractional share of the total bandwidth available at their current access point.", "score": 10, "replies": [{"body": "Wifi calling on several apps has begun, and with the advent of zoom and other video conference apps, I’m sure the same concept can be applied to simple audio calls. Starlink is creating an entire plethora of a satellite network, and with Google Fi beaming wifi with I think a hot air balloon system 3 years ago(it was huge news then) why can’t the cellular network companies be killed off by transitioning to wifi calling. It’s already active and the tech exists. All that’s left is to decrease lag, increase range, and scale up. It’s basically what CAN kill Verizon, Exxon and all their companies if they don’t evolve or rely solely on the cellular revenues, don’t you think?", "score": -1, "replies": [{"body": "And soon your TV remote will control time itself so you can rewind reality and change the past!\n\nI feel like I'm responding to an army of bots trying to manufacture hype.", "score": 1, "replies": [{"body": "Buddy what I said is already happening. It’s not some unrealistic fiction  of the future or hype. Have you not heard of wifi calling?", "score": -1, "replies": [{"body": "Do you not understand that WiFi service and cellular service have *millions* of access points across the globe because that is *required* because of the laws of physics?\n\nEM waves interfere with each other, there are many techniques to deal with this and share bandwidth but fundamentally to scale beyond a small group of thousands of users you must physically separate the signaling into localized areas that just overlap at the edges.\n\nThis is what WiFi mesh networks do.  This is what cellular networks do - in fact it's the reason they are called \"cellular\" as in made of \"cells\".\n\nThese designs are based on the laws of physics.  You can't just \"scale it up\" so 1 satellite can serve everybody in reach under it.  It's physically impossible.   \n\nAnd most of latency for satellite communication is the *speed of light* transit time, that isn't changing.\n\nIf you like to imagine what the future will be like, you might want to learn some physics.  It doesn't cost anything, Khan Academy has a ton of lessons starting from the basics.", "score": 1, "replies": []}]}]}]}]}, {"body": "> You don’t think that can change?\n\nYeah, the laws of physics can’t change. In order to get the same bandwidth as cell towers, you need many many times the number satellites as cell towers GLOBALLY today because of population distribution.\n\nThat’s not even taking into account limited bands that can be used that go through the ionosphere.", "score": 3, "replies": [{"body": "We’ve had tv service run by satellites for 20 years, we’ve had satellite radio for over 10 years. I have no doubt someone will figure out cellphone data service for satellites.", "score": 1, "replies": [{"body": "I'm sure you also have no doubt that someone would figure out how to create a perpetual motion machine or travel faster than light.", "score": 2, "replies": [{"body": "Or when computers were the size of conference rooms and trying to fit them inside a phone in everyone’s pocket. We’re not even talking about technology that doesn’t exist it actually exist but is just too large and not scaleable… yet", "score": 0, "replies": [{"body": "!remindme 5 years", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "You’re streets behind", "score": 1, "replies": []}]}, {"body": "I’m a huge appl bull. It’s my largest position.\nBut I really believe they not only set the standard but, also take the next step in many aspects of technology.", "score": 8, "replies": []}, {"body": "Agreed. Wearables are a major growth area for Apple.", "score": 2, "replies": []}, {"body": "Man that's an great example and move.thabk you for sharing that insight.", "score": 1, "replies": []}, {"body": "[deleted]", "score": -4, "replies": [{"body": "[you really don’t think this will be fully functional in 2-3 years?](https://www.engadget.com/apple-rumored-iphone-satellite-support-emergency-calls-messages-092538075.html)", "score": 7, "replies": [{"body": "No. I have a satellite messenger. Unless it's something completely unrelated to satellites, a real satellite device is extremely slow and heavy. It's one thing receiving location data. It's a different beast sending back a signal. The antenna is massive. The iphone would not look like an iphone anymore.", "score": -2, "replies": [{"body": "Low orbit communication satellites will fill the sky soon. \niPhone 13 will be able to make emergency calls and send text messages using this network. In 3-5 years Apple will position itself to no longer rely on carriers.", "score": 5, "replies": []}, {"body": "Have you see cell phones from 15-20 years ago?", "score": 1, "replies": [{"body": "[No, I’m only 14. What’s a computer?!](https://youtu.be/pI-iJcC9JUc)", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Yes, but you need at least a plausible theory as to why Apple would be on a MAJOR downtrend. It’s silly to say because we had examples of GE, IBM, etc. therefore the same thing would happen to Apple.", "score": 3, "replies": [{"body": "Why are you down voted", "score": 3, "replies": [{"body": "Because bears like to downvote simple questions that challenge their bearish takes.", "score": 0, "replies": []}, {"body": "Because these things are not foreseeable.  Can you tell me which phone brand you will buy 10 years from now?  Which car brand you will be driving?", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "But did those companies try to actively adapt to change? It seems like a lot of these big companies are aware of a lot of these huge mistakes. It's not a secret confined to redditors.\n\nAll the big companies have a wide range of products and services that are big now or could potentially be big in the future.", "score": 1, "replies": []}, {"body": "Oh so because you got hit by a car a year ago it means you will get hit by a car this year? That’s dumb.", "score": -3, "replies": [{"body": "Yes", "score": 2, "replies": []}]}]}]}]}, {"body": "I keep pointing out that most of Apple revenue comes from iPhone or adjacent products and services.\n\nImagine if some other company suddenly comes up with the next great leap in smartphones.", "score": 6, "replies": []}, {"body": "Next big company is WISH. Everyone loves some cheap Chinese toys so parents don't have to spend 1000$ on Toys'R Us or Gamestop. Lol jk no downvotes", "score": -2, "replies": []}]}, {"body": "What would it take? I can do it. I just have to buy their stock", "score": 243, "replies": [{"body": "Thank you for your sacrifice", "score": 13, "replies": [{"body": "I haven’t even bought the stock yet. Maybe it’ll really tank if I buy some…", "score": 1, "replies": []}]}, {"body": "Please do not, I have a lot of Apple", "score": 7, "replies": []}]}, {"body": "China kicking them out of the country entirely. That would do it. 19% of their sales the past 9 months. Plus the [majority of their suppliers](https://www.theguardian.com/technology/2021/jun/03/apple-uses-more-suppliers-from-china-than-taiwan-for-first-time-data-shows) are there.", "score": 247, "replies": [{"body": "Why would China do this", "score": 66, "replies": [{"body": "Rising tensions with US is most probable imo", "score": 127, "replies": [{"body": "[deleted]", "score": 96, "replies": [{"body": "This is a good point.", "score": 21, "replies": []}, {"body": "[deleted]", "score": 27, "replies": [{"body": "You could say that for all the companies that rely on Chinese manufacturing.", "score": 8, "replies": []}]}, {"body": "They been moving supply lines out. With the supply chain shock I would expect that to accelerate.", "score": 11, "replies": []}, {"body": ">\tMost of the iphone is made in china. \n\n[I wouldn't call 4.6% most.](https://asia.nikkei.com/Business/Technology/iPhone-12-teardown-showcases-South-Korean-parts-makers)\n\nMost parts are made in Korea, the US, Japan and Taiwan. They're just shipped to and assembled in China.", "score": 15, "replies": [{"body": "Also, more and more Apple products are beginning to be assembled in Vietnam.", "score": 5, "replies": []}]}, {"body": "If they pushed their own brand, maybe? It's not likely in the near future, but op did ask about the next 20 years.", "score": 2, "replies": []}]}, {"body": "China unemployment rate will be skyrocketed. Unlikely they will do this.", "score": 2, "replies": [{"body": "Oh i doubt China would screw over its citizens and stop growth for the sake of the party's ego. No way.", "score": 3, "replies": []}]}, {"body": "Oh yeah, just push em out over tensions. How?\n\nForcibly? I don’t get where people come up with this magical outcome where all of a sudden the US and China are at war. People want money and power and a working relationship yields more to both. That’s the reality.", "score": 1, "replies": []}]}, {"body": "Like US and huaweis...", "score": 13, "replies": [{"body": "Lol those weren’t gonna make it here", "score": 1, "replies": [{"body": "The US also kicked Huawei out of Europe.\n\nAnd Huawei was actually very successful in Europe. Half the 4G equipment came from Huawei and their phones were also sold by most major retail stores.", "score": 8, "replies": []}, {"body": "Not sure, there's much hype when P30 pro and it was when security issues whispers came o.O\nBtw The Chinese are more nationalistic", "score": 3, "replies": [{"body": "Not always. Sometimes, when a product has entrenched itself, the Chinese prefer that product over their own nationalistic brands. Take Coca-Cola for instance. China has tried multiple times to market their own colas, but to no avail; people just prefer Coca-Cola.", "score": 6, "replies": []}]}]}]}, {"body": "At some point the CCP may decide it is worth the short term pain in order to force the majority of the Chinese populace to use hardware built by a state-controlled entity.", "score": 2, "replies": []}, {"body": "Cause they can", "score": 0, "replies": []}, {"body": "They arent going to, it would effectively usher in a full blown economic war and both countries have nothing to gain from that. Its one thing to not allow, say netflix, INTO your market, its another to kick out the second largest manufacturer of smartphones. Tariffs and Unionization are a realistic threat (what killed american auto industry).", "score": 1, "replies": []}, {"body": "If they want to make one of their own companies an apple. But there is no incentive yet. Unlike google and amazon would have, apple doesnt destroy competitors. China is fine with competition as long as their own companies can develop", "score": 1, "replies": []}]}, {"body": "Only 19% of sales is not going to crash them down below jpm market cap of 450b. Apple losing 19% of sales and dropping 2 trillion of market cap would be way over reaction and would be super undervalued.", "score": 14, "replies": [{"body": "It's not just 19% of sales. It's also most of their growth opportunities", "score": 7, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "No, Apple has the cash to build new supply chains in the rest of Asia to replace China in 6 months to a year.", "score": 0, "replies": []}]}, {"body": "The real damage is that it would cost more money to build the products if they can't build them profitably in China.", "score": 0, "replies": [{"body": "They definitely have the cash to invest in other Asian countries. Still would not drop them down 2 trillion in market cap.", "score": 0, "replies": []}]}]}, {"body": "Honestly not too far fetched. Apple is shoveling shit for the CCP now regarding the privacy stuff, but I could see it", "score": 9, "replies": []}, {"body": "Still top 10 on s&p, but it would be a good start! Unfortunately that would pimp slap the spy and nasdaq and wreck the rest of my portfolio so I can't root for it", "score": 4, "replies": []}, {"body": "nah, China could kick them out and even though their costs would go up 1000x, everyone in California would still buy the products", "score": 1, "replies": [{"body": "Strong disagree. Very few would pay 2000 for an iPhone, no one would pay 10k for an iPhone. Even a 50% increase in production costs would likely destroy their stock price, and seriously compromise their long term solvency. They might survive but they'd be out of the top 10 for sure.", "score": 1, "replies": [{"body": "you clearly don't live in California..", "score": 1, "replies": []}]}]}, {"body": "Getting kicked out of China would be devastating for Apple, but [they also assemble iPhones in India](https://techcrunch.com/2021/03/09/apple-starts-assembling-iphone-12-in-india/) and a few other places in smaller volumes. It make sense to diversify some of their manufacturing regardless of the political situation in China.", "score": 1, "replies": []}, {"body": "So much this!\n\nUnlike Facebook / Google which do not have much dependence on China, Apple and Tesla are very exposed to China (both as a market and via the supply chain). Any restrictions on access to the Chinese market would halve valuations (since China is also where a lot of growth is coming from). \n\nUS regulations, for example, breaking the App Store monopoly will not be sufficient IMHO, because it would impact competitors too. Though Samsung / LG have lower control and lower App Store rev, so would be hurt less.", "score": 1, "replies": []}, {"body": "When I interviewed to work on the iPhone OS in 2008, I realized that Apple had figured out how to secure their phone against being ripped off by Chinese ‘shadow’ production (where China builds duplicate factories to rip off Western interlopers). \n\nIf China *could* master the software development, they already would have supplanted Apple. Same for Korea.", "score": 1, "replies": []}, {"body": "Apple has been one of the biggest beneficiaries of Huawei being unable to procure chips made with US technology and or equipment.", "score": 1, "replies": []}]}, {"body": "I don’t think Apple will be at the top forever. No company stays at the top forever. \n\nAnother company comes along and will beat it. \n\nThere have been oil companies that people said ‘well we will always need oil, so they’ll always be up there’\n\nThere have been product companies like P&G who own 90% of what you buy who you’d think would never be out of the top\n\nThere have been tech companies like Cisco & IBM and people thought tech was here to stay, it was but someone better will always come along.\n\nWho knows what the next big market cap will come from.", "score": 61, "replies": [{"body": "How hyped up was IBM in comparison to apple? Were they ever #1 to the extent of apple?", "score": 13, "replies": [{"body": "[deleted]", "score": 21, "replies": [{"body": "Exactly this. Apple's brand power is unprecedented---to the point where they don't even fucking need to write their name on their physical stores; a giant half-eaten apple is all it takes. \n\nThey've also earned it, though. I still don't understand how they flawlessly manage a hardware business at that ridiculous scale.", "score": 13, "replies": []}, {"body": "It is the moat. The moat is wide and deep.", "score": 3, "replies": []}]}, {"body": "IBM was so huge that 8 out of 10 programmers used to go work for IBM.\n\nIBM was so huge that they used to purposely overbid on jobs so that that their competition could win enough of them to keep IBM just under 80% of the market share. Because if they got any bigger they knew that the US government would probably try to break them up under anti-monopoly laws.\n\nSo yeah, a lot of people loved IBM, you practically had to use them at one point.", "score": 7, "replies": [{"body": "To be fair, IBM stock isn’t bad. Almost 5% dividend", "score": 2, "replies": []}]}, {"body": "> Were they ever #1 to the extent of apple?\n\nYes, in the early 80s before the PC clone wars decimated their profit margins.  The famous expression in the businesses community at the time was _\"[Nobody gets fired for buying IBM](https://www.forbes.com/sites/duenablomstrom1/2018/11/30/nobody-gets-fired-for-buying-ibm-but-they-should/?sh=1571971748fc)\"_", "score": 1, "replies": []}]}, {"body": "> There have been tech companies like Cisco & IBM and people thought tech was here to stay, it was but someone better will always come along.\n\nI think we’re all waiting for that *next brand of technology* and I’m not sure if anybody knows what that is. The Internet of Things had a bit of buzz but then I think people realize that a smartwatch isn’t as a necessity as a smartphone. Nothing has surpassed the smartphone yet and AAPL is still king of the smartphone, at least in the US.", "score": 1, "replies": [{"body": "True I should have said those version of tech companies were here to stay.\n\nThe next big thing no one knows, maybe not technology as we view it. Bio, Genomics, vertical farming, it’s probably talked about not being something that will catch on a bit like other companies. Remember apple was nearly bankrupt before Jonathan Ives and Steve Jobs reformed the business in 97", "score": 2, "replies": []}]}, {"body": "It’ll be Tesla", "score": -3, "replies": [{"body": "Tesla has nothing the general public can buy. One that has a family to support.", "score": 4, "replies": []}, {"body": "I’d say the next big company will be one you don’t even think that much about", "score": 0, "replies": []}]}]}, {"body": "It would take 10 companies becoming more valuable than them.", "score": 139, "replies": [{"body": "Exactly. It can happen without Apple doing anything wrong. Look at the way the climate is headed. Apple is not a part of solving that problem and frankly the biggest companies in the world should be the ones focused on solving the most important problem.", "score": 31, "replies": [{"body": "The most important problem is how to get a better camera into a phone", "score": 26, "replies": []}, {"body": "There’s no charger in the box bro, they’re obviously single handedly defeating climate change", "score": 5, "replies": []}]}, {"body": "Thanks Sherlock.", "score": -20, "replies": [{"body": "He right tho", "score": 14, "replies": []}, {"body": "You mock them yet it would be incorrect to tell them they are wrong.", "score": 1, "replies": []}]}]}, {"body": "Discovered that the satellite i-phone causes incurable brain cancer.", "score": 30, "replies": []}, {"body": "they run out of apples", "score": 40, "replies": []}, {"body": "Time", "score": 14, "replies": []}, {"body": "I really don't see how unless Tim Apple decided publicly to punch a baby every year for next 10 years", "score": 18, "replies": []}, {"body": "[deleted]", "score": 19, "replies": [{"body": "$1K in apple IPO would be worth $1.15 mil today", "score": 17, "replies": []}]}, {"body": "An iPhone that explodes and kills everything within a 100 mile radius.", "score": 13, "replies": [{"body": "nuclear powered iphones would certainly be a sure way to *nuke the stock* hehe", "score": 9, "replies": []}, {"body": "Strong disagree. This would be evidence that Apple is using miniaturized nuclear technology, undetected, in current consumer tech made by the million. This would be saying they have technology that far exceeds every government on Earth combined, and could easily defeat the existing world order in open conflict if required - like the Spanish decimation of the native Americans in central America.\n\nIf this happens, I would immediately shovel my life savings into their stock. Immediately, without hesitation.", "score": 2, "replies": []}]}, {"body": "The mostly likely factor may be a break up of the company. Although there's as good or better reasons for breaking up the other top 10 companies.\n\nOr x years from now the top 10 is dominated by AI and/or distributed companies that are way bigger.", "score": 17, "replies": [{"body": "I thought losing Steve jobs would start a decline for them but I was 100% wrong", "score": 10, "replies": [{"body": "1033% wrong you could say", "score": 21, "replies": []}]}, {"body": "This is the right answer.  Some sort of voluntary or forced breakup that spun off devices, media (music, movies, TV+), and the App Store (including payments).  That would knock Apple out of the top 10, but one or more of those “baby Apple” companies might quickly climb back in.", "score": 5, "replies": []}]}, {"body": "Major chip shortage, materials shortage, lawsuits, real competition.", "score": 11, "replies": [{"body": "I thought the propietary M1 chip was to be able to produce their own chips, in their own foundaries.", "score": 1, "replies": []}]}, {"body": "I don’t think they drop out of the top 10 for a very long time, but I think AMZN GOOG and MSFT from the trillion club can knock Apple out of first, something like NVDA too. TSLA as well if they succeed in many of their smaller ventures today.", "score": 25, "replies": []}, {"body": "The stock price going down", "score": 10, "replies": [{"body": "Brilliant assessment", "score": 11, "replies": [{"body": "Thanks", "score": 1, "replies": []}]}]}, {"body": "all it takes is for Tim Cook's successor to be *really, really* poorly chosen. \n\nlike, imagine the whole \"Alex Trebek\" / \"Jeopardy Host\" successor drama and multiply that by a *billion* as to how drastically bad the incorrect choice of CEO could be for Apple. \n\nThe thought of a Mike Richards type working at the top of Apple... \\*shudder\\*", "score": 11, "replies": [{"body": "Even Steve Ballmer couldn't kill Microsoft, I think they'll be fine for the next decades.", "score": 7, "replies": []}]}, {"body": "If the US passes a law similar to South Korea requiring them to allow competing payment providers on their app store, it could happen due to the impact it could have on their earnings.", "score": 14, "replies": [{"body": "Not enough to knock them out of top 10 sp500. That would mean they drop below jpm which is at 450b. A 2 trillion drop from apple won't happen from that", "score": 16, "replies": []}, {"body": "Apple services is valued roughly 1 trillion on the high end. Even if that goes to 0 they are still a 1.5 trillion dollar company. Nice try", "score": 6, "replies": []}]}, {"body": "People would have to be willing to use windows laptops and android phones.\n\n\n Honestly I got a MacBook for work and I really gave it a chance before I decided that it wasn't really all that good. I felt like it got in my way more than it was easy to use. I would seriously wager that if you wipe people's memory that the Apple products today wouldn't win out, people are just used to the UX/UI and because of that they won't leave Apples walled garden. They're not bad products but imo they're not the must buy products that they were during the early 2000s.", "score": 12, "replies": [{"body": "Are you me? I also have a MB Pro at work and find it gets on the way more than it helps. I prefer using my work desktop (a company variant of Linux) 100% of the time", "score": 4, "replies": [{"body": "Get Scroll reverser and rectangle!", "score": 1, "replies": []}]}, {"body": "I fucking hate how we have to use Macs for literally one piece of software that's developed by an Apple fanboy.\n\nDesigner software is garbage in that way.", "score": 1, "replies": []}, {"body": "Apple is good at making a closed system for dumb users where it is hard to fuckup badly, that is most people. If you want flexibility you wont use their system.", "score": 1, "replies": []}]}, {"body": "Most probable scenario? Apple does fine but not great, gets surpassed by Microsoft, Google fb, amazon. Then China takes over: if the first big 6 are going to be Chinese 20 years from now, Apple won't be in the top 10", "score": 7, "replies": []}, {"body": "I just can't see it happening unfortunately. The amount of Americans that wank over that brand is frankly scary.....", "score": 3, "replies": [{"body": "Not just Americans, my dads rich friends from India always ask him to bring the latest phones and laptops everytime he visits.", "score": 1, "replies": [{"body": "UK too", "score": 2, "replies": []}]}]}, {"body": "Why do you want to know? \n\nIt is **very unlikely** that Apple would lose such a spot in the S&P500. Number one reason that would happen (*if it happens*) is if they don’t continue to innovate and introduce *new* category of products. \n\nThat is a simple answer.", "score": 16, "replies": [{"body": "It's not as unlikely as you Apple fanboys think. 20 years is a long time.", "score": 43, "replies": [{"body": "Seriously. The top 10 biggest companies in 2001 looks way different than now. Only Microsoft has stuck around.\n\nThe top 10 will look very different 20 years from now and there’s a very high chance Apple is no longer #1.", "score": 22, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Is it though? Microsoft is incredibly diversified and their products are geared much more towards enterprise. If someone came up with a product that made the iPhone obsolete or even just much less popular, Apple would lose out massively just based on one product.", "score": 21, "replies": [{"body": "Apple has a strong brand. They can slap an apple logo to any product and the fanboys will still buy them", "score": 5, "replies": [{"body": "But the fanboys will simply get old and die.\n\nWhen there is a better product, then the teenagers who weren't a fanboy to begin with will simply buy the superior product. \n\nThat may be Apple or may not.", "score": 4, "replies": [{"body": "But the fanboys are people from all generations though? None of the fanboys will be dying within the next 30 years . Also I see so many teenagers asking their parents to buy them apple phones, watches and earpods", "score": 6, "replies": []}, {"body": "If there is any age group of people that is MOST brand conscious it’s teenagers. They’d be the last to jump ship. 20 somethings would lead the way, just like they did in 2007 with the iPhone. They’re young enough to adapt but old enough to have the capital to buy the latest and greatest.", "score": 4, "replies": []}]}]}]}]}, {"body": "While I agree, would you also concur that almost everything has been merged and made a subsidiary of bigger corporations that have more influence and money than companies in 2001?", "score": 1, "replies": []}]}]}]}, {"body": "If Steve Jobs was found roaming around a vacation spot after faking his death", "score": 3, "replies": [{"body": "i would argue if that happens, AAPL will be the first company to break $3 T by pure hype alone.", "score": 15, "replies": []}]}, {"body": "Apple dropping the ball on mobile releases due to supply chain constraints. That'd shake up some investors.", "score": 2, "replies": []}, {"body": "When it loses its \"luxary\" status and cannot distinguish itself from \"ghetto\" Android", "score": 2, "replies": []}, {"body": "I actually think Apple’s moat is significantly lower than a lot of the mega-cap companies.\n\nApple is able to charge huge markups for its product due to its amazing branding, innovation in design and new technologies, and it’s user-friendly ecosystem.\n\nIt would not be particularly surprising for me if Apple missed the boat on the next big piece of consumer tech, and/or loses its reputation for ease of use and quality.\n\nFrom there 4-6 years of below average performance would have it fade out.", "score": 2, "replies": []}, {"body": "People to realize they are overpaying for anti-consumer tech and that android is just as functional but cheaper.\n\nCatastrophically bad pr incident that makes people drop the brand and explore alternatives.", "score": 12, "replies": [{"body": "You think Apple is the only anti consumer device manufacturer? Virtually every phone on the market is made with planned obsolescence in mind", "score": 8, "replies": [{"body": "Yeah but you can get a solid Android device at half the price", "score": 4, "replies": []}]}, {"body": "This guy got jokes.", "score": 7, "replies": []}, {"body": "[deleted]", "score": -6, "replies": [{"body": "Yes, they are more functional. They have way more features and are just as easy to use. In fact, most new iPhone features are just thing that android added 3 years ago. I can’t even split screen two apps at once on iPhone.\n\nI have an iPhone right now but I’ll be switching back to Android soon. Android has better hardware and better software for a cheaper price.", "score": 8, "replies": []}, {"body": "I'm the only person in my family who uses Android - the rest use iPhone. I'm also the only one who can add additional memory on a whim (SD card slot) and have a system-wide parametric eq on my phone. So definitely not 'just as functional' but definitely more functional.", "score": 3, "replies": [{"body": "[deleted]", "score": 20, "replies": [{"body": "none taken. I get what you're saying. I was just baffled that Apple doesn't allow its users to run a proper eq other than the non descriptive presets. As for the longevity - I've been using Android phones since 2011 and never had a problem with a phone lasting a long time (I usually update the phone once every 3-4 years). As for the ecosystem, I'm not a fan of Apple OS, but I get that so many are.", "score": 2, "replies": [{"body": "I use my phone 90% of the time for Reddit and the best Reddit app is on iPhone :/", "score": 4, "replies": [{"body": "Hmm. I'm using the reddit app on my android right now. 0 complaints, but I have no experience with the ios app. To me they look identical.", "score": 3, "replies": [{"body": "Now a days most popular apps on android are very good, but a few years ago android was an afterthought and not very good for apps like Instagram and Snapchat. My last phone was an android and I liked it more than iOS in most aspects, but what brought me back to iPhones was iMessage. As someone in their 20's in the US, you get actively excluded from group chats if you don't have iMessage.", "score": 6, "replies": [{"body": "Yes, that's definitely true.", "score": 2, "replies": []}]}]}, {"body": "Reddit Is Fun says hi", "score": 1, "replies": [{"body": "I’ve used it and it doesn’t hold a candle to Apollo.", "score": 1, "replies": []}]}]}]}, {"body": "So you started by saying that androids are less functional, and now that you've been proven wrong on that point you're moving the goalposts and saying that \"99% of people\" don't care about the functionality of androids? So does functionality matter or not? Cos it seemed to matter when you thought iphones had more functionality than androids, but you've conveniently deemed that functionality to be irrelevant now that you've been proven wrong. As far as a phone that always works and will last you 5-6 years, android phones certainly offer that and at a much lower price point than iphones. So far the only coherent point you've made is that you like being able to use apple's software ecosystem. That's fair, but that's also a very subjective point - not everyone likes Apple's walled-garden approach so I'm not sure that you can count it as a point for iphones if we're speaking objectively.", "score": 1, "replies": [{"body": "Jeez it’s just a phone bro, no need to get this deep in an argument over it.", "score": 1, "replies": [{"body": "Nah its reddit u gotta throw hands", "score": 1, "replies": []}]}]}]}, {"body": "I had a Galaxy S9 that went to shit after a year,My iphone 11 is strong and smooth as ever after two years  .\n\nNobody cares about your extra SD slot or whatever, Iphone is more sustainable .", "score": -1, "replies": [{"body": "I used S7 for 3 years with 0 issues. Currently using S10e with no problems for the past 2.5 years. As for 'nobody cares about SD slot' - I laugh whenever someone complains about running out of memory on their iphone and having to delete photos/videos.", "score": 2, "replies": [{"body": "There's something called Icloud you know? If you run out of space in your Icloud, you can have so much space for 1 dollar a month.", "score": 1, "replies": [{"body": "Sure. There is also Google drive. All I'm saying is that ios is in no way superior to android.", "score": 2, "replies": []}]}]}, {"body": "Meanwhile my Galaxy S8 worked perfectly until I dropped it last month and cracked the screen, else I'd still be using it, while my friends iPhone stopped charging after a year. \n\nStop being silly.", "score": 1, "replies": []}]}, {"body": "I have had so many android phones go to shit after a year, The only phone that has lasted with proper performance for me is an Iphone.\nI don’t get your take, People would have already moved if Apple was so predatory and android was so good, You didn’t discover something new, This has been an argument since android came out but guess what,Apple keeps going", "score": -5, "replies": [{"body": "Apple has an absolutely brilliant marketing department.", "score": 9, "replies": [{"body": "I ve seen Android fanboys turned to Apple entusiasts  once their companies gave them an IPhone. There's a reason why so many companies trust the IPhone.", "score": 1, "replies": [{"body": "That shift happened around 2010-2014 and yes, Android was crap back then - definitely not polished enough.", "score": 1, "replies": [{"body": "Isn't IPhone safer regarding the download of apps? Isn't it better the IOS regarding privacy, denying apps from tracking you down if you choose this option? Isn't Iphones face recognition unparalleled?The iPhone  is expensive and you get what you pay for.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Some prefer local storage to cloud.", "score": 3, "replies": []}, {"body": "You can't re-use that memory on your camera or other electronic device though.", "score": 1, "replies": []}]}]}]}, {"body": "Except androids are just as expensive. iPhones are available from 400$ to 1100$.\n\nJust cause they arnt selling 200$ phones doesn’t mean they have less value. iPhone last way longer and retain their cbalue for resale better too.\n\nIt’s about preference man not what’s better", "score": 1, "replies": []}]}, {"body": "ITT: Bezos, Sundar and Satya lurking and drawing up plans to be executed.", "score": 4, "replies": []}, {"body": "Going bankrupt!!", "score": 3, "replies": [{"body": "Didn’t think of that one. Good job.", "score": 3, "replies": [{"body": "More of a joke, I’ve had APPL since 1998! The company is one that consistently adapts into every emerging market for possible growth. They’re patenting & creating more accessories, IOS automotive interfaces, I don’t see Apple falling out of the S&P top 10!! All honesty", "score": 1, "replies": [{"body": "I was double downing on your joke. Unfortunately I don’t have Apple stock.", "score": 2, "replies": []}]}]}]}, {"body": "For CNBC to highlight their slave/concentration camp labor use in China.", "score": 2, "replies": [{"body": "Known factor. Didn't cause a drop. All time high or near it.\n\nI just don't think there is much growth left. Maybe some. Maybe we will have 8 trillion dollar companies in the future and that will be normal.", "score": 4, "replies": [{"body": "no need for the market cap to increase that much for the share price to rise more than the market: stock buybacks.", "score": 1, "replies": []}]}]}, {"body": "Maybe a recession.  I dont think a device that doesnt really get any better model to model is winning any awards for in-elasticity in demand.  Though I just bought a 2.5 year old phone, so maybe I just dont understand how other people think.", "score": 1, "replies": [{"body": "Trust me. I’ve seen MILES a difference from the iPhone 6 to the XR that I have now.", "score": 3, "replies": [{"body": "I mean thats a phone from 2014, it had a 720p screen and 1gb of ram.  This 2.5 year old phone I just bought has a bezel-less 4k screen and 8gb of ram.\n\nSo I'm more comparing say the iPhone 11 to the 12 and beyond.  Rams maxed out, screen is maxed out, CPU wont improve much and is largely unnoticeable, so what else is left to improve?", "score": 4, "replies": [{"body": "I think they could improve resolution and get to 8K streaming. Who knows. They always seem to figure out something to add or improve", "score": 1, "replies": [{"body": "Sure, its statistically imperceptible, and you're still likely to run into a wall in not that many years.", "score": 1, "replies": [{"body": "I don’t agree. There I always some new trend that comes up.", "score": 1, "replies": [{"body": "Sure, its still a risk I would say.  Something to consider, as theres no guarantee.  Some things dont get progressively better forever, and if they are taken over its sometimes by another company.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Memstocks go moon", "score": 1, "replies": []}, {"body": "I remember when people thought the same thing about AT&T. Telephone was bullet proof.", "score": 1, "replies": []}, {"body": "I think what a lot of people are forgetting is the marketing genius of Apple. Apple is as iconic a brand as Coca-Cola and as fashionable as Chanel, in a way that Microsoft (or Samsung or Android) simply aren’t. That kind of image is a far more elusive nut to crack than simply producing excellent products. The best tech doesn’t always win in the market… as Betamax could surely tell you.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Nvidia is the best in Artificial Intelligence by far.", "score": 3, "replies": []}]}, {"body": "people to stop drinking their coolaid ?", "score": 0, "replies": []}, {"body": "You do know Apple almost went out of business before Steve Job returned, right?\n\nGE is WAY more diversified back then compare to Apple today and they lost their top spot.\n\nNot sure about top 10 but Tesla for sure will overtake ANY company to become number 1 if they get to level 5 autonomous vehicle first.\n\nThat's just one clear example and I am sure there are lots of other company could do the same.", "score": 0, "replies": []}, {"body": "[removed]", "score": -15, "replies": [{"body": "Lol", "score": 1, "replies": [{"body": "I was just being funny :(", "score": 2, "replies": [{"body": "You made me laugh, but sarcasm doesn’t translate well on Reddit because there are too many stupid people who actually believe that here.", "score": 1, "replies": []}]}]}]}, {"body": "In the short-mid term? Maybe if the US government breaks them up for anti-trust reasons. Or some absolutely insane scandal.", "score": 1, "replies": []}, {"body": "AT&T was the top company not so long ago. Government actions and failure to adapt to changing market conditions can change things for tech companies.", "score": 1, "replies": []}, {"body": "Apple wouldn't have to lose anything.  New companies would just have to come in stronger.", "score": 1, "replies": []}, {"body": "If they don’t make good on their promise to make the glasses or if they fail to meet green energy expectations then they will assuredly be knocked down a bit.", "score": 1, "replies": []}, {"body": "Tim Cook is not anymore the CEO and they replace him with a John Sculley-like. Sometimes history rhymes.", "score": 1, "replies": []}, {"body": "A financial hack that empties millions of IPhone user digital Wallets - ouch", "score": 1, "replies": []}, {"body": "The only way Apple loses this much value. Say over 2.2 trillion, is if something replaces the cell phone and Apple doesn’t evolve with the times. I don’t see this happening any time soon. The iPhone is literally part of everyday life for so many people I don’t see something replacing it anytime soon. It would be tough for us to imagine what would come next just like 100 years ago people would never believe you the stuff you could do on a phone today or even the concept of stuff like a cloud service/App Store.", "score": 1, "replies": []}, {"body": "antitrust suit", "score": 1, "replies": []}, {"body": "Tim cook doing molly on stage", "score": 1, "replies": [{"body": "if he does. I'll buy more", "score": 1, "replies": []}]}, {"body": "It would take 10 more successful businesses to move Apple out of the top 10", "score": 1, "replies": []}, {"body": "Global EMP, sending the world back into the stone ages", "score": 1, "replies": []}, {"body": "A big lawsuit...", "score": 1, "replies": []}, {"body": "When they start making products that aren't so attractive to consumers anymore", "score": 1, "replies": []}, {"body": "The next generation of mobile phones. Like what happened to Nokia, BB and other companies when the iphone came", "score": 1, "replies": []}, {"body": "Literally the only thing stopping them at this point could be regulation if they're broken up under anti-monopoly rules.", "score": 1, "replies": []}, {"body": "!RemindMe 20 years", "score": 1, "replies": [{"body": "I will be messaging you in 20 years on [**2041-09-02 07:31:17 UTC**](http://www.wolframalpha.com/input/?i=2041-09-02%2007:31:17%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10/hbaftar/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2Fpg78n3%2Fwhat_would_it_take_for_apple_to_lose_their_top_10%2Fhbaftar%2F%5D%0A%0ARemindMe%21%202041-09-02%2007%3A31%3A17%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20pg78n3)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "World war 3", "score": 1, "replies": []}, {"body": "Commoditization of their key lines - particularly smartphones and tablets.\n\nIn 20 years if a top line cell phone can be sold for $200 instead of $1000 it’s going to cut revenue and margins. They can get away with selling $1000 phones when others are $600, $800 or whatever, but they are anchored by the price of their competition. If the Motorola’s, LG’s and huawei of the world start selling near peer devices for 5 or 600 less apple will have to drop prices.  I was frankly surprised at how easily people accepted the $1000 phones when prices had been stable or declining in real terms for years. This won’t go on forever. Just like PC’s, Laptops and TV’s  mobile phones and tablets will drop down in price over time.", "score": 1, "replies": []}, {"body": "The biggest risk is that smartphone upgrade cycles start getting longer and longer. Smartphones get so good that people stop upgrading as frequently because their phone is already great. Same for smartwatches, etc. Apple will be perfectly fine when this happens, but growth would slow.\n\nSame thing happened to computer upgrade cycles. How often do people upgrade their desktops or laptops? I'm using a 6 year old laptop that's still got years of life.", "score": 1, "replies": []}, {"body": "Critical thinking classes and a cultural shift from the way a lot of people see prestige.   \n\n\nApple value is in brand, so as long as their products are expensive and other companies will keep on creating new ideas that apple can merge into prettier things, apple is not going anywhere.   \n\n\nYou can search for a test where they did neural scans on apple customers and they relate to apple brand like to an actual person that they like. When compared to Samsung - noting happened. So apple value is not built on rational numbers so you should follow culture shifts not what the company does itself.", "score": 1, "replies": []}, {"body": "Not the answer you may expect but if Apple were to no longer be 'cool' that could significantly hurt them. If something happened to the public image of Apple or it became 'uncool' to kids to buy Apple then another brand could easily swoop in and charge higher margins for a name brand that people want to display and use as a status symbol. This has happened to many fashion brands that could once charge a premium but are now undesirable.", "score": 1, "replies": []}, {"body": "when they stop making an insane amount of profits every single day", "score": 1, "replies": []}, {"body": "A lot more sellers than buyers", "score": 1, "replies": []}, {"body": "What they are doing now. Nothing new, just stay the course. One day people will realize the product itself is mediocre and not worth the apple tax. Then they would just be another data cloud company.", "score": 1, "replies": []}, {"body": "Apple doesn't necessarily have to do anything wrong, they just have to stop growing.\n\nThe thing with Apple is that their products have pretty much peaked.\n\nIn the early days of the iPhone, the generational differences were massive. Second gen introduced GPS, turn-by-turn navigation, and the app store. Third gen introduced multitasking, FaceTime and the front-facing camera. That incredible pace of innovation ultimately translated into growth, both in market share and in value.\n\nFlash forward to 2020 and what did we get? A slightly higher resolution display that nobody but phone nerds will ever notice, and new color options. It's not their fault, it's just that smartphones are boring now - even an entry-level Huawei phone satisfies all of the needs of the average consumer and more.\n\nThis trend is playing out across all of Apple's products. Think about the differences between Panther and Leopard, versus the differences between Catalina and Big Sur.\n\nI don't expect Apple to shrink any time soon (it would take a lot to dislodge the average Apple consumer from that ecosystem) but I do think that they are going to stop growing. Ripe markets like renewable tech, AI, and electric cars have far more room for innovation and growth than venerable markets like smartphones and operating systems.", "score": 1, "replies": []}, {"body": "1 bad product launch", "score": 1, "replies": []}, {"body": "Tesla to make eye contact “phones”.", "score": 1, "replies": []}, {"body": "iDildo, shaped like an apple with a bite taken out", "score": 1, "replies": []}, {"body": "If there are more sellers than buyers", "score": 1, "replies": []}, {"body": "AAPL is too big to lose.", "score": 1, "replies": []}, {"body": "If all the iPhone 13 explode within 100days of use..", "score": 1, "replies": []}, {"body": "people get to know their planned obsolescence through hidden cam recordings of executivies boasting about it while on crack", "score": 1, "replies": []}, {"body": "CSAM and fanboys stop buying their iPhone. But fanboys are fanboys so low possibility", "score": 1, "replies": []}, {"body": "I don't know what the answer is, but I do love questions like this.  It's so difficult to predict black swans, by their very nature.  I ask myself the same question about all of the mega caps.  For several, amzn/goog/msft, I feel like their biggest threat is anti-trust but honestly if you compare what msft went through in the 90s, these guys are having a walk in the park and plus I think if some sectors of amzn and goog were forced to spinoff, that could be a big plus for shareholders (I'm looking at you, aws).", "score": 1, "replies": []}, {"body": "The only crappy apple product I have has is my 2018 Mac mini that has proven to be unstable despite seeming to have well more power than my last 5 apple computers.\n\nI have a souped up iMac replacing it and if that has issues I might go another direction.", "score": 1, "replies": []}, {"body": "More governments doing what South Korea just did.", "score": 1, "replies": []}, {"body": "A robbery- seriously they have 200B cash on hand. Number 10 is JP Morgan per investopedia. Their annual revenue is 120B and market cap a little over 400B. Apple’s market cap on this site was 2.2T.", "score": 1, "replies": []}, {"body": "Maybe if reddit bears keep posting.", "score": 1, "replies": []}, {"body": "AAPL will eventually fall out of the top 10.. What will it take? Time.. consumer tastes change, etc.. By 2050, its safe to say that AAPL won't be in the top 10\n\nIn 1990 the top five were General Motors, Ford, Exxon, IBM and General Electric. At one time, I believe Phillip Morris was the biggest company in the world.. \n\nas you can see.. changes occur", "score": 1, "replies": []}, {"body": "Me to buy more shares.", "score": 1, "replies": []}, {"body": "Not investing enough in R&D. Which they aren't compare to their competitors. But the good thing for apple is shit load of cash and juggernaut revenue/profit margin. They can evens start from scratch in any business if done right lol\n\nNext big wave is going to be in space of advance AI/robotics/Quantum computing. So will depend what kind of consumer grade products companies come out with and how well Apple responds to it.", "score": 1, "replies": []}, {"body": "It's been declining prestige-wise since Jobs' death.", "score": 1, "replies": []}, {"body": "I don't think it's an entirely unthinkable scenario in the next 20 years. Apple has been far from an innovative company ever since they introduced the iPad, is largely milking their existing infrastructure and slowly increasing prices instead of driving costs down. Those kinds of companies don't tend to stick around the top for long.", "score": 1, "replies": []}, {"body": "Terrorist attack. Sadly.", "score": 1, "replies": []}, {"body": "All it would take is Apple to stop being a fashion company", "score": 1, "replies": []}, {"body": "Everybody says they won’t because IBM, GE, bla bla bla bla.\n\nBut fuck, this big tech companies seem to cover many industries and want to cover more. Look at apple and the so called apple car or FB and all the VR shit they are developing.\n\n\nWhat if in 20 years they rule the world like in those dystopian movies.", "score": 1, "replies": []}, {"body": "If there was a company that made stretchable metal/expanding display phones that can be squeezed down to a tiny phone and stretched to a tablet. All other phones become useless.", "score": 1, "replies": []}, {"body": "spending a shit ton of time touting privacy, and then betraying that privacy and destroying years of trust in a matter of minutes. south korea is the first country that will be the beginning of the end of apple's massive profits. one thing that could save them from the app store reduction in income, is a glucose monitoring watch", "score": 1, "replies": []}, {"body": "Remove the external charge port from their phone, forcing everyone into bluetooth headphones and wireless charging.  And that's if their new iViolate system of constantly scanning your media to upload doesn't do it first.", "score": 1, "replies": []}, {"body": "The world ends because we are killing it. Thats about all.", "score": 1, "replies": []}, {"body": "If they included chargers back in their boxes /s", "score": 1, "replies": []}, {"body": "Won't happen until a new technology disruption occurs.", "score": 1, "replies": []}, {"body": "I think the main thing is their dependence on Chinese assembly plants. The most likely (not likely, just highest likelihood) thing that crushes them would be major conflict between china and the west. If China wanted to hurt the west and in particular the US badly and didn't care how badly it hurt it's own people (a decision that's very much like a wartime decision, but open conflict isn't actually required) then shutting down that supply chain would turn off Apples profits like a faucet.\n\nEdit: typo", "score": 1, "replies": []}, {"body": "Maybe something like a privacy invasion leak.", "score": 1, "replies": []}, {"body": "Apple is at the top because it’s products hold influence in the way we define our identity. \n\nI’ll reduce my ownership of Apple when I see any number of companies begin to claw back market share of human identity.", "score": 1, "replies": []}, {"body": "Early market entry for something that is so distinct in the marketplace. Wont be taken down for a verrry long time but to answer your question - global interference (i.e China bans Apple products)", "score": 1, "replies": []}, {"body": "Going back in time and unreleasing the IPhone", "score": 1, "replies": []}, {"body": "For people to collectively realize they aren’t worth more than 1/10 of the US gdp", "score": 1, "replies": []}, {"body": "It would take 10 more valuable companies", "score": 1, "replies": []}, {"body": "You are underestimating how long 20 years is. I can almost guarantee Apple will not be a top 10 stock by market capitalization at any point during 2041.", "score": 1, "replies": []}, {"body": "When people finally realize it is stupid to pay 2K every year for slightly better version of the same phone. But the  fan boys and fan girls are strong in this brand... Sadly", "score": 1, "replies": []}, {"body": "The exclamation point reinventing of the internet to move on from the hashtag (+-#!) And a phone maker to come up with incredibly secure new technology that shows the truth over the preferred echochamber agreement that underlines the current paradigm of phone use that all are operating with today.", "score": 1, "replies": []}, {"body": "New TPhone from Tesla that projects holograms", "score": 1, "replies": []}]}
{"title": "$TSLA Daily Investor Discussion - September 02, 2021", "selftext": "# This is the daily fun thread/chat. 🥳🚀\n\nAll topics are permitted in this thread.\n\nSee our Monthly thread for more in-depth discussions about news/thoughts/opinions about Tesla.\n\n^((This thread should not be construed as investment advice or guidance.))", "id": "pgb42q", "created_utc": 1630558821.0, "score": 12, "upvote_ratio": 0.88, "num_comments": 147, "comments": [{"body": "This FSD beta video at 18:30 shows the car enter a portion of the road that had all the lane markings removed, but FSD still shows on screen where the lane lines should have been and drives down the road without issue. I’d love to see blue cruise or any other “FSD” product out there in this situation to see how they handle it. \n\nhttps://youtu.be/lIHnU9cNoD0", "score": 10, "replies": [{"body": "However, it didn't detect the hazards lights...", "score": -6, "replies": [{"body": "Well it didn’t do anything about the situation in the time that it sat there. Maybe it would have eventually driven around. But I couldn’t really see what the traffic was behind the car. Getting out of those situations is tricky when everyone behind you keeps pulling out leaving you stuck.", "score": 1, "replies": [{"body": "I would think the animation would show it on the screen that it's a disabled car with hazard lights.", "score": -3, "replies": []}]}]}]}, {"body": "TSLA looking at 740 right now...\n\n![gif](giphy|uVR1p77lDFyvwJNl77|downsized)", "score": 10, "replies": [{"body": "Haha 😂 \n\nBtw. I read today that we need to close above 745 for the next leg up ? Can someone confirm that ?", "score": 4, "replies": [{"body": "Pivot Point 1st Resistance Point\t740.30\nPivot Point 2nd Level Resistance\t746.50\nPivot Point 3rd Level Resistance\t751.02\nhttps://www.barchart.com/stocks/quotes/TSLA/cheat-sheet", "score": 5, "replies": [{"body": "Super nice ☺️ thx 🙏", "score": 3, "replies": []}]}]}]}, {"body": "The Tesla community is unequivocally the most positive, least toxic, and fact based community I’ve ever been apart of. Love it man", "score": 18, "replies": [{"body": "hell yeah💖", "score": 5, "replies": []}]}, {"body": "NIKOLA SHARES UP 5.3% PREMARKET AFTER SIGNING DEAL WITH BOSCH GROUP TO BUILD FUEL-CELL POWER MODULES\n$NKLA\n\n😂 people still believe in this 💩", "score": 17, "replies": [{"body": "Maybe GM will partner with them again. Fuel cells gotta be less explody than batteries, right?", "score": 8, "replies": [{"body": "You are on something here 🧐. Probably good time to buy NKLA or GM \n\n/s", "score": 4, "replies": [{"body": "GM ANNOUNCES NORTH AMERICAN ASSEMBLY PLANT SCHEDULING ADJUSTMENTS DUE TO SEMICONDUCTOR SHORTAGE\n$GM\n\nIs this shit all day long ? I don’t remember one week without this kind of announcement ? 🧐", "score": 3, "replies": []}]}, {"body": "Nothing with hydrogen in it has ever exploded. Ever.", "score": 1, "replies": [{"body": "Yeah, just look at hydrogen bomb... Oh wait!", "score": 1, "replies": []}]}]}, {"body": "A rational market would dump Bosch stock because of that, partnering with a proven fraud of a non company", "score": 5, "replies": [{"body": "Bosch is private.", "score": 5, "replies": [{"body": "Oh it is", "score": 1, "replies": []}]}]}, {"body": "Bosch to do hydrogen powered dishwashers?", "score": 2, "replies": []}, {"body": "As far as I can tell, it looks like Nikola are going to manufacture fuel cells in their plant using Bosch design and technology.\nCould not locate any press release from Bosch though.", "score": 1, "replies": []}]}, {"body": "The opening of Gigafactory Berlin and Austin will be big catalysts in Q4. Booked a trip to Germany in October to visit Gigafactory Berlin.", "score": 7, "replies": [{"body": "Hoooo hey there. Nice video you did on YouTube. And I hope to meet people from our sub in Germany as well 🤞", "score": 3, "replies": []}]}, {"body": "Reserved my yeti-motor cybertruck yesterday.  Posted this yesterday too lol.   Much excite.", "score": 8, "replies": [{"body": "Nice ! 😃", "score": 2, "replies": [{"body": "I’m guessing 2023 for mine", "score": 3, "replies": []}]}, {"body": "Stainless steel sasquatch", "score": 1, "replies": []}]}, {"body": "The upcoming wide release of FSD beta 10.1 could be the biggest step forward in automated driving yet.", "score": 6, "replies": [{"body": "Yeah, if they're confident about releasing it to the public  it must be good", "score": 6, "replies": []}]}, {"body": "Well guess I was right. It was a 🐻 trap this morning. \n\nPeople will just [FOMO at ATH](https://twitter.com/nitzao/status/1433453153408663557?s=21) 🤷‍♂️🤦‍♂️", "score": 6, "replies": []}, {"body": "[deleted]", "score": 10, "replies": [{"body": "Yes please!", "score": 2, "replies": []}, {"body": "That would be seriously nice 👍🏻👍🏻", "score": 1, "replies": []}]}, {"body": "Do you guys want a good one 🤣 ?\n\n[Rumor](https://www.macrumors.com/2021/09/02/apple-car-toyota-visit-2024-production/)\n\nFeels like we see this every time Tesla is going up 🤣", "score": 5, "replies": [{"body": "Apple making an electric car in 2024 would be like Samsung making their first smartphone in 2018. \n\nPersonally, my brand loyalty to Apple is wearing thin. I’ll probably always use an iPhone and Mac, but I’m not a fan of most of their other offerings and their walled garden has pushed me to use other products that I like more such as Alexa because Siri is hot garbage even 10 years after launch.", "score": 10, "replies": [{"body": "I wonder if there's an effect that I'll call \"self overbranding\" that consumers tend to avoid. Here's what I mean:\n\nI get the Apple phone+watch+laptop combo for easy digital integration. But the car doesn't really tie in so well - any kind of car-device integration I can imagine is already being done with CarPlay or Android Auto.\n\nSo then buying an Apple car is simply buying Apple just for the brand. And that makes you start looking weird. It'd be like someone that's a fan of Tommy Hilfiger wearing his jeans+top+socks+undies+jacket+shoes+neckerchief all in one go. That's just a bit strange.\n\nSo the Apple car would really need to knock it out of the park in terms of style+range+autonomy for this to not be at least a little bit of a factor in some consumers' purchase consideration.", "score": 4, "replies": [{"body": "Shit. All my clothes and cars and liquor are Tesla at this point!", "score": 4, "replies": []}]}]}, {"body": "\"monocle battery tech ™\" is the new Ultium ™", "score": 3, "replies": []}]}, {"body": "https://old.reddit.com/r/teslainvestorsclub/comments/pe2hn5/some_thoughts_on_tesla_factory_placement/haveoqp/\n\nDid you know that Tesla has a motor R&D office in Greece?", "score": 3, "replies": [{"body": "Article is from 2018, does it still exist?", "score": 1, "replies": [{"body": "Google maps suggests that it existed as of 2020.", "score": 1, "replies": []}]}, {"body": "I knew they had one, no news about it lately though.", "score": 1, "replies": []}]}, {"body": "https://www.reddit.com/r/BoltEV/comments/pfxuv3/got_a_surprising_call_today/?utm_medium=android_app&utm_source=share", "score": 4, "replies": [{"body": "as a MY & Bolt owner Bolt Reddit is now too much fun-there used to be GM brand loyalists in that Reddit trashing/trolling Tesla even though the topic of discussion has nothing to do with Tesla. But this past 2 weeks they're lying so low with their tails between the legs.", "score": 18, "replies": [{"body": "[oh dear, this was posted seriously and not as a joke…](https://www.reddit.com/r/BoltEV/comments/pfvau2/networked_smoke_alarm_in_the_back_seat/?utm_source=share&utm_medium=mweb)", "score": 9, "replies": [{"body": "Not sure why he needs this, seems overkill. Aren't Bolt owners supposed to watch their cars charge? /s 😜", "score": 4, "replies": [{"body": "Poster said that it is because even though parked outside garage, it is close to other flammable things including a wood sided house. Better to wake up and call the fire department.", "score": 1, "replies": [{"body": "I would do the same if I was an owner. I was being snarky. Added /s to my comment.", "score": 3, "replies": []}]}]}, {"body": "Bolt owners == smoke detector experts", "score": 3, "replies": []}]}]}]}, {"body": "Strongly considering selling almost half my shares to snag my first LEAP around 750 or 800 strike. Decided at last minute to wait until later this month for 9/2023’s. Thoughts about buying a new LEAP date right as it opens?", "score": 4, "replies": [{"body": "Taxable event", "score": 5, "replies": []}, {"body": "Totally depends on how you feel about the current price relative to future price. Personally, I like buying LEAPS deep in the money. Deep in the money options are more expensive, but there’s less cost of extrinsic value, plus something at like a .8 delta has room to comfortably sell some low delta monthly covered calls against it without worrying about my deltas getting screwed up. Dunno if that’s relevant to you, but just my thoughts. Rock on!", "score": 3, "replies": []}]}, {"body": "Pretty volatile today...", "score": 4, "replies": []}, {"body": "sad premarket. Another (slightly) red day incoming?", "score": 3, "replies": [{"body": "Lots of selling & capping, I suppose in preparation of \"poor\" China August numbers?\n\nProbably \"only\" 8k units were delivered locally in China in August:\n\n- Tesla Shanghai was still producing for other markets in much of the month,\n- and then they had a couple of days shutdown due to component shortage, which they used opportunistically to upgrade lines for higher volume Model Y production.", "score": 6, "replies": [{"body": "damn..  it will be >$700 again... ?", "score": 2, "replies": [{"body": "*This comment has been edited in protest to reddit's API policy changes, their treatment of developers of 3rd party apps, and their response to community backlash.*  \n  \n&nbsp;  \n[Details of the end of the Apollo app](https://old.reddit.com/r/apolloapp/comments/144f6xm/apollo_will_close_down_on_june_30th_reddits/)  \n\n---\n[Why this is important](https://i.imgur.com/E7jSWf1.jpg)  \n\n---\n[An open response to spez's AMA](https://old.reddit.com/r/ModCoord/comments/145l7wp/todays_ama_with_spez_did_nothing_to_alleviate/)  \n\n---\n[spez AMA and notable replies](https://old.reddit.com/r/SubredditDrama/comments/145beas/spez_ama_discussion_thread/)\n\n&nbsp;  \nFuck spez. I edited this comment before he could.  \nComment ID=hbarsgp Ciphertext:  \n>!qivZeDrTwFgCOYEgI3l7b5NZvuShkcRqzE+V7q0C8vChZjTZ5TT5sXPcp+/Knw==!<", "score": 3, "replies": [{"body": "OOM ATM", "score": 1, "replies": []}]}]}]}, {"body": "Could that be a 🐻 trap ?", "score": 3, "replies": [{"body": "yeah i never trust those premarkets.   they are easy to manipulate.  (relatively speaking...)", "score": 1, "replies": []}]}, {"body": "perfect, so I can buy one more stock with my internship money at a lower price", "score": 1, "replies": []}]}, {"body": "Back in the green!", "score": 3, "replies": [{"body": "It is?", "score": 1, "replies": [{"body": "No", "score": 0, "replies": [{"body": "yes no yes no yes no etc. :)\n\nHovering around zero.", "score": 3, "replies": []}]}]}]}, {"body": "Maybe a dumb question, but all those who aren't in the beta program are on FSD v8 right?", "score": 3, "replies": [{"body": "No, we're not on FSD at all. Still on the Autopilot stack", "score": 4, "replies": []}, {"body": "I think so, the \"button\" is supposed to give acces to the beta", "score": 2, "replies": []}, {"body": "I think so, the \"button\" is supposed to give acces to the beta", "score": 2, "replies": []}, {"body": "I think so, the \"button\" is supposed to give acces to the beta", "score": 1, "replies": []}]}, {"body": "surprised how not active this thread is anymore these days...", "score": 5, "replies": [{"body": "Yes I was just thinking about that. Usually it gets kinda wild on the upswings.\n\nMy guess one of the main reasons is that people are not quite ready to release their exuberance into irrational territory until we see a more definite sign that we are breaking out of current range. \n\nAlso remember a lot of new members contributed to the sub activity  near ATH having just opened their TSLA positions. We probably have lost those who did not hold, and the rest not quite out of despair yet.\n\nLastly, other tickers are more popular with the WSB crowd who are then flooding the respective other subs", "score": 4, "replies": []}, {"body": "/u/Nitzao_reddit, maybe give us one of your fancy gifs to liven things up for today?\n\nPS - I'm about to head out on vacation for two weeks so won't be very active. I'll miss you guys! 💗💗💋💋💗💗", "score": 4, "replies": [{"body": "Sorry busy after this run up after AI Day … still mind blown about how the stock will go in the next decades.\n\nPS : take care of yourself 🥰\n\n![gif](giphy|67ThRZlYBvibtdF9JH|downsized)", "score": 10, "replies": [{"body": "Cheers mate, and thanks for the gif!", "score": 4, "replies": []}]}]}, {"body": "Stocks been flat for 9 mths", "score": 2, "replies": []}]}, {"body": "Glad to see the stonky is going to the right direction :)", "score": 5, "replies": [{"body": "Stonky go pop?", "score": 1, "replies": []}]}, {"body": "That 740...", "score": 2, "replies": [{"body": "So strong. But we'll beat it", "score": 3, "replies": []}, {"body": "We've bumped it 3 days in a row now. Time to crash through... Lets go!", "score": 2, "replies": [{"body": "Friday is the weekly crash, as per the schedule.", "score": 1, "replies": [{"body": "Except last week. But yes, will probably fall tomorrow. Sigh.", "score": 1, "replies": []}]}]}]}, {"body": "Do you think Tesla will make new short shorts 😂 ? ![img](emote|t5_n9evv|3993)", "score": 2, "replies": [{"body": "I want Tesla to sell an official Cybertruck Cracked Window Decal.", "score": 4, "replies": []}, {"body": "naw. those are yesterday's memes.", "score": 2, "replies": []}]}, {"body": "Does anybody have any thoughts on Tesla producing their own semiconductor chips?", "score": 2, "replies": [{"body": "Not likely as it’s super hard to tackle, take times and lot of capitals.\n\nBut if the chip shortage is something that continue overtime, Elon will make the decision to do it as he doesn’t want to be stopped for Tesla and also for SpaceX.", "score": 4, "replies": [{"body": "exactly- an inability to get chips will not be allowed to derail his dreams for Mars, long term", "score": 2, "replies": []}]}, {"body": "very unlikely", "score": 3, "replies": []}, {"body": "Doubtful. More likely continued expansion of long term contracting.", "score": 3, "replies": []}, {"body": "Musk tweeted that he would if it became a real problem, but that he would much rather continue to contract out. Power tweet for sure, because he's ordering massive, consistent and increasing orders of semi-conductors from producers... He's a golden goose for them, and the only one who could actually do it himself if they fail him.", "score": 3, "replies": []}, {"body": "First q is what really causes the chip shortage. It’s not a lack of fabs nor increased demand. Is it something that Tesla could even bypass by rolling their own?\n\nI do think there is merit to them vertically integrating more parts that they currently get from 3rd parties but building or buying their own chip fab is probably not the solution to any of that. Designing their own replacements where it makes sense and getting those fabbed inna foundry - the standard business model - is probably a much better path, and the lead time on that is also pretty long.", "score": 2, "replies": []}, {"body": "They don't have nearly the resources or expertise to do this.", "score": 2, "replies": [{"body": "😒 they have the $$ they could hire anyone they want. \n\nDoes it make sense, probably not. But check yourself.", "score": 3, "replies": [{"body": "It would be almost impossible to hire the talent for this. Just the talent acquisition would itself require a huge shift in focus away from battery manufacturing, let alone spinning up a fab. We're talking $25 billion and like 6 years away to get a 3 NNm plant going in 2027; It would be just affordable but would crush Tesla's growth plans.", "score": 2, "replies": [{"body": "For sure. 6 years is the limiting factor.", "score": 2, "replies": []}]}]}]}]}, {"body": "oooofff, ya hate to see a green to red day.\n\nputs still on sale.", "score": 4, "replies": [{"body": "Exactly the same pattern as the last 2 days. Hopefully we see the power hour rebound yet again. $740 is proving to be a wicked resistance. I saw that between 740 and 750 is max pain for the options market.", "score": 6, "replies": [{"body": "i think max pain is bullshit, personally.", "score": 2, "replies": [{"body": "you win.", "score": 1, "replies": []}]}]}, {"body": "![img](emote|t5_n9evv|3980)", "score": 6, "replies": [{"body": "wut", "score": 1, "replies": [{"body": "I don't know what these colon # # # # colon posts are that I've seen lately. Are they color codes my browser isn't translating? Some meme I haven't seen yet?", "score": 3, "replies": [{"body": "They're a new kind of emoji. If you're using old.reddit.com they don't work.", "score": 6, "replies": [{"body": "thanks", "score": 3, "replies": []}]}]}]}]}]}, {"body": "Please stay above $700 until next split!", "score": 3, "replies": [{"body": "We will never have a split below $1000-1500 you know", "score": 3, "replies": [{"body": "yes but what I meant was: go up until $2000, then split again (and we go back to $200, if it's a 10x)", "score": 1, "replies": [{"body": "The stock won't split at 700 or below. Price is too low, so if it makes you feel any better. It'll always be above $700 when it splits.", "score": 1, "replies": []}]}]}]}, {"body": "ill get downvoted and called a teslaq like i always do in here but I'm pretty happy to see any news regarding Apple and the EV game.  I'm of the belief that iron sharpens iron and Apple is the first company that could give Tesla *real* competition.\n\nTheir brand loyalty is second to none (except maybe to Tesla lol) and for all of their transgressions/misdoings they can engineer the fuck out of a piece of metal and develop very easily accessible/user friendly software.  They literally have tens of billions of dollars to burn (that legacy automanufacturers dont have) that won't impact their bottom line or growth in the other sectors of their business model.\n\nElon has said it multiple times - An electric car is basically a computer on wheels.  Apple doesn't know automobile manufacturing but they have so many more intangible assets and nothing to pull them back like legacy car manufacturing does.\n\nI say all that to say - doesn't really impact my long term valuation of Tesla but I hope Apple being in the game takes Tesla to the next level in terms of QC and customer service with increased competition from a silicon valley rather than a detroit approach to car manufacturing.", "score": 4, "replies": [{"body": "People say this, but google had a 10 year head start on FSD and couldn't compete.", "score": 12, "replies": []}, {"body": "Apple hasn't innovated or taken any risk since Jobs died. They will not make a car until Cook leaves.", "score": 15, "replies": [{"body": "Not going to argue this but I think that's a simple take.\n\nInnovation and risk aren't on a binary decision tree but falls on a broad spectrum.\n\nElon has even said it himself (check out the Sandy Munroe interview @ the Tesla facility) - there were things that they used to do  in terms of their engineering, innovation, and risk that they just can't do anymore.\n\nIs Apple still as risky and innovative now as they were before Steve Jobs?  Hell no.  But to say that apple lacks innovation and/or risk-taking is pretty disingenuous.", "score": 0, "replies": [{"body": "Name the last piece of apple software what wasn’t full of issues? I’ll wait…", "score": 0, "replies": [{"body": "That's a loaded question...\n\nIt's like going into RT and them saying \"name the last time  there wasn't XYZ\" \n\nMan is there a sub for people who like Tesla but aren't full on hard for Elon?  Lol I can't have legit conversation about the future of the company in either forum", "score": 1, "replies": [{"body": "Of course its a loaded question.. \n\nYou can have a conversation but that requires honestly engaging with the comments you get. \n\nApple software has been a shit show for many years now. \n\nApple hardware: look at all the hardware service programs they had to put out over the last 5 years. Real, your device is fucked issues. \n\nJust take the mac keyboard as an example, “we super fucked up, oh well better keep doing the same thing every single year for five fucking years”.", "score": 2, "replies": []}]}]}, {"body": "Apple got its hype with the iPhone, it's way overvalued as people keep buying the brand & virtue signaling more than the products themselves (they would go elsewhere otherwise).\n\nThe quality has gone to shit and the price up, I don't know how long it will last but stupidity being limitless, I wouldn't short Apple any time soon ofc.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "If Tim Apple ran Tesla, there wouldn't be any Tesla cars as there is no Apple car... \n\nHe is great at executing Jobs plan and that's why he's got the job but Jobs roadmap has come to an end and Apple is only iterating for a couple of years already.", "score": 1, "replies": []}]}, {"body": "Apple Glass will be the next thing to tell us if they can still innovate. It will either be transformative or a glorified iPhone accessory.", "score": 0, "replies": [{"body": "We are still talking about their AR VR glasses after the VR hype has died... Interesting!", "score": 1, "replies": [{"body": "VR and AR are very different use cases. AR is much more applicable to the real world and there are multiple tech companies working on them. It will likely be the next compute paradigm.", "score": 0, "replies": [{"body": "Sure as proven with Google Glass or Microsoft Hololens.", "score": 1, "replies": []}]}]}]}]}, {"body": "Prototype is easy... Mass manufacturing is difficult.\n\n\nUnless apple finds a way to vertical integrate, it will be tough to make a car with Tesla kind of margins.", "score": 8, "replies": []}, {"body": "I welcome Apple to the EV game if it secures a nail in the coffin for Ford and GM.", "score": 4, "replies": [{"body": "It's already done, it just needs to play out at this point.\n\n* Check debt loads vs Tesla\n* Legacy Auto hasn't released anything competitive with Tesla yet\n* By the time they do FSD will have gutted chunks of the direct sales business model\n* Legacy Auto is probably losing money on each EV they sell, while Tesla has the highest margin per car\n* Tesla is increasing the margin they make on each car\n* Legacy Auto's profitable ICE business sales decline are accelerating\n* Legacy Auto's has no ability to innovate quickly\n\nIt's over.", "score": 3, "replies": []}]}, {"body": "My issue with Apple and them potentially making an apple car is that they simply do not have the top engendering talent that Tesla has. Apple decided to outsource a lot of manufacturing to China and simply design great product’s instead. Although they have great products and great design they are just too bad at engendering and actually building things. As Elon says production is the hard part.", "score": 4, "replies": []}, {"body": "First of all, you have my upvote. \n\n[In 2016, Elon thought Apple will a be “direct” competition](https://youtu.be/mZapfmWPxl4). He said Apple will be at volume-production by 2020. \n\nI pretty sure if you ask Elon again he will have a different opinion. Elon will probably say that self-driving is the main differentiating factor, and in longer term manufacturing is will be most sustainable advantage for Tesla.\n\nI think Apple is serious about cars and they have God’s own bank-account to survive significant cash burn for many decades. They have the right kind of design and customer-experience focus to make good vehicles. \n\nProblem is Apple is too late in the game. By the time, their vehicles is out, Tesla will have significant lead in autonomy. Apple will not have a the first-movers advantage that they enjoyed with iPod and iPhone. Tesla will be well placed to undercut Apple’s specific vehicle type very early because they will be easily make up for that with FSD subscription margins. \n\nPeople will still buy Apple cars but Apple won’t be able to dominate the market or have any first-mover network-effect which they’re used to having. \n\nBy the time Apple reaches any serious volume production, Tesla will have bigger fishes to fry than just worrying about personal vehicles. Semi, Robotaxis, logistics, bots, AI, energy etc. And probably more optionalities will emerge such as VTOL taxi, boats, drones, delivery services etc.\n\n“Pace of innovation is all that matters in the long run” - Elon", "score": 3, "replies": []}, {"body": "Just more \"competition is coming\". Who cares if Apple sells a few overpriced cars. \n\nIt has taken Apple to long to get into EVs. They will have zero impact on Tesla since they will be selling very few cars compared to Tesla.", "score": 3, "replies": []}, {"body": "Too late IMO :/. I hope that they can create something but I really doubt they will be a real threat. I hope to be wrong. I welcome competition if this is not BS that try to slow down innovation", "score": 3, "replies": []}, {"body": "Apple used to be a war time company but it is not anymore.", "score": 6, "replies": []}]}, {"body": "We got blasted by the remnants of Hurricane Ida in NYC and surrounding areas. Hopefully it doesn’t put much of a damper on $TSLA. It’s been a disaster for a lot of peoples basements here. Hope you guys are doing well.", "score": 2, "replies": [{"body": "Philly highways shut down too", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Interesting.... His view seems to be that FSD won't be a factor in 2025, as most/all luxury brands will have their own FSD, so people won't care about it as much/won't be priced into the stock price.\n\nUmmmm... I find it VERY hard to believe that any other company will have their own FSD in 2025.", "score": 7, "replies": [{"body": "I’ve seen the common opinion amongst certain analysts/fund types that there may be a short term advantage for a company or two, but that long term investing should see FSD as becoming commoditized software.\n\nI think they are wrong. But that is what they think.", "score": 2, "replies": [{"body": "They are treating FSD like antilock brakes, airbags, seatbelts, and anything else that can typically be added to a vehicle design refresh. In the past it seems like most competitive features are spread out to all brands over a couple year timeframe. But FSD isn’t that simple of an addition unless they buy the software and hardware from Tesla. \n\nApparently none of these analysts watched AI day, and/or they have no understanding of the technology involved or how the tech industry works. It’s bizarre to see how clueless or in denial they are.", "score": 2, "replies": [{"body": "This is really the most compelling feature of Tesla's FSD implementation that hasn't been adequately talked up.  If they manage to get it work, its effectively moated.  You can't reverse engineer what they'd have done with their AI to make it work on your own vehicles.", "score": 1, "replies": [{"body": "The most is gigantic too because nobody else will have Dojo so they can create their own FSD all they want, but how are they going to get the training anywhere close to what Tesla does? Dojo is going to make the Tesla lead on FSD insurmountable.", "score": 1, "replies": []}]}]}]}, {"body": "I'm doubtful even tesla will have actual FSD (without driver being responsible) by 2025, other than in a few markets maybe.", "score": 2, "replies": [{"body": "assuming you mean L4/L5 autonomy, the clock will start ticking once DOJO is running, so late 2023/early 2024 is my estimate.", "score": 2, "replies": [{"body": "Yes I mean when you're allowed to take your hands off the wheel and take a nap", "score": 1, "replies": []}]}]}]}, {"body": "Gary is amazing ❤️🙏🇺🇸", "score": 4, "replies": [{"body": "Agreed. And I say that while I disagree with Gary's take on FSD growth and the Tesla PR department.", "score": 5, "replies": []}]}, {"body": "Don't you know that you get downvoted into hell if you mention Gary in this sub. Had to learn this the hard way too 2 days ago when I posted a link to it.", "score": 1, "replies": []}, {"body": "Did he said something about the fact that we don’t need PR departement if the stock goes up and the fact that Bitcoin is up so it’s not a problem now ? 😹", "score": 0, "replies": [{"body": "He said stuff people like, and finished off with, buy my ETF.", "score": 2, "replies": []}]}]}]}
{"title": "$TSLA Daily Thread - September 02, 2021", "selftext": "Fun chat. No comments constitute financial or investment advice. ⚡ 🔨", "id": "pgcueq", "created_utc": 1630566853.0, "score": 31, "upvote_ratio": 1.0, "num_comments": 784, "comments": [{"body": "Here's why a dude got a bolt instead of a model 3\n\n1) Model 3 too sporty and fast\n\n2) I'm too big\n\n3) I like buttons\n\n4) I dont drive far so i dont need superchargers\n\n5) Elon evil bad man", "score": 23, "replies": [{"body": "6. he bought it for his wife's boyfriend", "score": 11, "replies": []}, {"body": "One of the Bolt owners, justifying why they prefer the Bolt:\n\n* Tesla supercharging network is awesome, but I never travel so don't really care about that.\n* When I'm traveling, there will more likely be GM parts available in small towns if I break down.\n* I *know* GM will be around in 10 years; Tesla I'm not so sure about.", "score": 8, "replies": [{"body": "🤡🤡", "score": 5, "replies": []}, {"body": "Lmao, the third point I am opposite on", "score": 5, "replies": []}, {"body": "Tesla is already a decade older than GM", "score": 1, "replies": []}]}, {"body": "We happen to like buttons too, you know 🤑", "score": 6, "replies": []}, {"body": "Another thing people brag about is chemistry. They don't want cobalt or to support child work, yet they buy cars from manufacturers that still use cobalt and boycott the only company (Tesla), which actually brings things forward. People love greenwashing.", "score": 4, "replies": []}, {"body": "One of the comments listed \"Unions\" as a reason to get a Bolt over a 3", "score": 5, "replies": []}, {"body": "()", "score": 2, "replies": []}, {"body": "I thought you were joking and trying to think of stupid reasons, but I just saw this on the bolt Reddit. Now it's even funnier", "score": 2, "replies": []}, {"body": "hmm I actually like bolt. I'm into pyrotechnics.", "score": 1, "replies": []}, {"body": "5 should be 1 by their logic", "score": 1, "replies": [{"body": "🍌", "score": 3, "replies": [{"body": "😳", "score": 1, "replies": []}]}]}, {"body": "They like to brag about their piles of ashes.", "score": 1, "replies": []}, {"body": "I did a bolt because it was insanely cheap. I hate it", "score": 1, "replies": []}]}, {"body": "Found a lost cat this afternoon, the girl was crying of happiness. Feels good to do a good deed.", "score": 23, "replies": [{"body": "Cat caught a new human", "score": 7, "replies": []}, {"body": "👍", "score": 3, "replies": []}]}, {"body": "https://twitter.com/stekkerauto/status/1433320303585894420?s=21\n\nVW plans to offer EV subscriptions: ID.3 to the tune of €499/month for a min. duration of 6 months. 800km/month included, as well as taxes, insurance etc.\n\nThey'll be using \"3000 young used ID.3 and ID.4 **from their own fleet**\" 👀\n\n\n\n\nSo… these are the cars that VW bought themselves that made TSLAQ think VW had insane EV sales? Seems like it.", "score": 16, "replies": [{"body": "I can do 4 euros a month best offer", "score": 4, "replies": []}, {"body": "inventory they can’t get rid of", "score": 1, "replies": []}]}, {"body": "Make tsla $900 again", "score": 16, "replies": [{"body": "This matters", "score": 6, "replies": []}]}, {"body": "This poor fool\n\nhttps://www.reddit.com/r/BoltEV/comments/o361os/bolt_or_model_3/h2kx03c?utm_medium=android_app&utm_source=share&context=3", "score": 15, "replies": [{"body": "boomers always think what they've seen their whole lives will continue indefinitely.", "score": 9, "replies": []}, {"body": "Lmao thats actually hilarious \n\nGood find", "score": 6, "replies": []}, {"body": "This would make a good leopards ate my face submission.\n\nHere he is [one month later ](https://i.imgur.com/ZKF1lgA.jpg) (you have to show them being sad for ate my face).", "score": 5, "replies": []}, {"body": "RIP", "score": 5, "replies": []}, {"body": "Let's all reply with 'This aged well'. I started.", "score": 4, "replies": [{"body": "Shit, I didn’t see this. Typed ‘F’ in the thread anyways", "score": 1, "replies": [{"body": "That's totally fine as well.", "score": 1, "replies": []}]}]}, {"body": "Lol", "score": 3, "replies": []}, {"body": "I laughed when he said he was unsure if Tesla would be around in 10 years. I \\*absolutely lost it\\* when he said GM will be 😂", "score": 4, "replies": []}, {"body": "Only GM customers can be so retarded that literally 100% of their EV sales are now ticking firebombs that can't even be used properly while still thinking that GM will be around in 10 years and Tesla not", "score": 4, "replies": []}, {"body": "Fucking idiots", "score": 2, "replies": []}, {"body": "u/Achilies3 spittin' fire lol", "score": 1, "replies": []}]}, {"body": "Spoke to a guy I kinda work with as we were the only guys who drive EVs. He told me how shitty his roadtrip from Switzerland to southern Italy was in his Jaguar I-Pace (with 400 km range at a price of 110k lmao). I asked him why he decided to get the I-Pace. He said he knew he wanted his next car to be an EV but his criteria were 1) the new car couldn't be a Tesla and 2) since his previous car was a Range Rover he wanted a car from the same company. Imagine spending more than twice the price of a Model 3 for an inferior car. What an absolute cuck.", "score": 16, "replies": [{"body": "Sounds like the typical Jaguar driver, EV or not lol", "score": 5, "replies": []}, {"body": "At most Tesla will capture 25% market share. This allows for 3/4 people to be idiots", "score": 4, "replies": [{"body": "80% is how i like it.", "score": 1, "replies": []}]}, {"body": "Why no Tesla?", "score": 3, "replies": [{"body": "\"I want to be unique\" is my interpretation", "score": 5, "replies": [{"body": "Quite an expensive unique then 😣", "score": 5, "replies": []}, {"body": "🪦 \n\nThis is a bizarre twist regarding car ownership that some people have been sold that the car you drive is expression of personality.\n\nI honestly think this attitude is absent in younger people and older people will get over it as there is really only one game in town.", "score": 6, "replies": []}, {"body": "\"I want to be unique... just like everybody else.\"", "score": 4, "replies": []}]}]}, {"body": "What a cucksocking asshole retard", "score": 1, "replies": []}]}, {"body": "This guy took the long way to the right answer but at least he got there in the end.\n\nhttps://www.reddit.com/r/BoltEV/comments/pgq8ns/goodbye\\_everyone\\_it\\_was\\_nice\\_while\\_it\\_lasted/", "score": 14, "replies": [{"body": "He basically tried everything in his power to avoid a Tesla", "score": 10, "replies": [{"body": "He even admitted he regrets not going Tesla sooner, it really happened, at the very end of that long-ass post.", "score": 5, "replies": []}]}, {"body": "Lol. That dude is gonna pull more bolt blazers over. They're gonna bring even more over. We already know how this works. This is our design.", "score": 3, "replies": [{"body": "The guy sure is never buying another GM again. God forbids he learns about Tesla as a company and do a bit of research on it, buys a bit of stocks, makes a few hundred thousands in profits…", "score": 6, "replies": [{"body": "🤣", "score": 2, "replies": []}]}]}, {"body": "They thing is, GM and Ford cars are crappy, even if we are just talking gas burners...everything feels cheap, the electronics/info screens are dated as hell, Tesla is the smartphone to the old ass Nokia brick phone (except those actually were tough and dependable)", "score": 2, "replies": []}]}, {"body": "\"*The value of a fully electric autonomous fleet is going to be gigantic, boggles the mind really. That will be one of the most valuable things that is ever done in the history of civilization.*\"\n\nGuys is this a good investment opportunity?", "score": 11, "replies": [{"body": "I don´t know I think it needs LIDAR and I really like GM too look at the PE ratio", "score": 10, "replies": [{"body": "Hmm yes good points", "score": 5, "replies": []}]}, {"body": "You can't trust what Elon says. He's obviously a fraud, and also very unintelligent", "score": 5, "replies": [{"body": "Yeah I don't think he's been successful in anything before, I probably shouldn't listen to him", "score": 3, "replies": []}]}]}, {"body": "Gf is meeting the parents for the first time today. Will be interesting to see who makes the first joke about my Tesla being the other woman in my life", "score": 13, "replies": [{"body": "Just stare them right back in the eye and tell them the Tesla likes it rough.\n\nThen go back to eating steak or whatever.", "score": 7, "replies": [{"body": "😂", "score": 2, "replies": []}, {"body": "Very, very sturdy.", "score": 1, "replies": []}]}, {"body": "Just name it Mike Ditka", "score": 6, "replies": [{"body": "Found the boomer", "score": 2, "replies": [{"body": "Lmao \n\n\nNot even close, am millennial", "score": 2, "replies": []}]}]}, {"body": "Tell them your favorite command for the other woman in your life is, “open up your butthole”", "score": 2, "replies": [{"body": "“I’m just glad both of my ladies respond to the same command”", "score": 8, "replies": []}]}, {"body": "69? Nice.", "score": 1, "replies": []}]}, {"body": "Happy Thursday cultists  \nR3 751.02  \nR2 $746.50  \nR1 $740.30  \nS1 $729.58  \nS2 $725.06  \nS3 $718.86  \nmPv $712.50  \nL2 $750 & $800  \nGiddyup", "score": 12, "replies": [{"body": "Support and resistance prices look tighter than usual. It’s only a 30 dollar spread too to bottom.", "score": 3, "replies": [{"body": "Yep we were at a $100 spread maybe a couple of weeks ago maybe a bit longer, thought I had pointed that out.  The slow grind up without any big down days or big gap downs (8/13 - 8/16) helps tighten the range for support and resistance", "score": 1, "replies": []}]}, {"body": "Ooh, decimals. Fancy", "score": 2, "replies": [{"body": "Oh yeah forgot to mention, you earned decimals.  YW", "score": 2, "replies": []}]}, {"body": "Mind the nasdak chart, getting toppy down day soon.", "score": 1, "replies": []}, {"body": "Also note there is large open interest for calls at 750 combined with a long weekend so doubt that will be overcome this week.", "score": 1, "replies": [{"body": "Doesn’t that mean potential pin at $749?", "score": 1, "replies": [{"body": "I think they won’t even let it get close.\n\nLooked at selling calls this morning for 750 and not worth the time. $85 per call right now!", "score": 1, "replies": []}]}]}, {"body": "Wow support all above $715!! 🤩", "score": 1, "replies": [{"body": "We continue the melt up.  Not rockets, but a nice uptrend", "score": 1, "replies": [{"body": "It’s a strange new world…but I’m digging it!  Could see this continuing as we approach the end of Q3 and onto an even stronger Q4. And oh yeah… FSD button 😱!", "score": 1, "replies": [{"body": "Q3 should be quite strong, daily trading volume is picking up, Austin and Berlin coming online and beginning to ramp will help.", "score": 1, "replies": []}]}]}]}, {"body": "Always appreciate this. Thanks man 👍", "score": 1, "replies": [{"body": "Sure, np.", "score": 1, "replies": []}]}]}, {"body": "Can one of you purchase 100 billion worth of Tesla over the next two weeks so this thing goes up and I can get richer?", "score": 12, "replies": [{"body": "Currently working on an algorithm to siphon. 0001 cents per transaction worldwide per day to a private offshore account. Should be able to buy 100 bln of tesla with that.", "score": 6, "replies": [{"body": "Great, thank you", "score": 5, "replies": []}, {"body": "this is the plot to the movie Hackers, isn't it?", "score": 5, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Yeah office space.", "score": 6, "replies": [{"body": "Damn it feels good to be a gangsta\n\nhttps://youtu.be/hIoPlLEXM2Y", "score": 3, "replies": []}, {"body": "You inspired me to write today’s poll question", "score": 1, "replies": []}, {"body": "superman 3, derivatives", "score": 1, "replies": []}]}]}]}, {"body": "I want my Swingline stapler", "score": 3, "replies": [{"body": "I don't have your stapler Milton.", "score": 2, "replies": []}]}]}, {"body": "Let me check under my bed", "score": 6, "replies": [{"body": "Thanks try not to keep the 100 bil under your bed again because of inflation and robbers. It will be safe in tesla though.", "score": 2, "replies": []}]}]}, {"body": "for how many years will ford blame declining sales on chip shortage?", "score": 13, "replies": [{"body": "2 weeks", "score": 6, "replies": []}, {"body": "7 to 10 years", "score": 3, "replies": []}, {"body": "Just 2 and then they will claim bankruptcy, under which they will abandon their ICE vehicle production assets and will restructure their business towards 100% EV production.", "score": 3, "replies": [{"body": "But they will pull themselves up by their bootstraps and finance the whole thing themselves.\n\nJk, lol, you are gonna pay for it with your taxes while JB laughs into a microphone while incoherently rambling about what a bad hombre Tesla is.", "score": 6, "replies": []}, {"body": "This sounds like a pretty smart path forward for them to be honest. Not that’s it’s ideal, but under the circumstances kinda makes sense.", "score": 3, "replies": []}]}]}, {"body": "another solid day of hodling in the books", "score": 11, "replies": []}, {"body": "Chevy Blaze", "score": 11, "replies": [{"body": "funny how I'm not seeing these stories plastered all over the websites I use that always lambast Tesla....", "score": 5, "replies": []}, {"body": "GMC Blazer was ahead of its time", "score": 3, "replies": [{"body": "Chevy blazer. GMC Jimmy is the equivalent. Funnily enough later replaced by the GMC Yukon", "score": 3, "replies": [{"body": "Woopsie\n\n\nIt's been a minute since those were on the road", "score": 1, "replies": []}]}]}]}, {"body": "Sawyer is live tweeting info from an all hands on deck meeting apparently \n\nhttps://twitter.com/sawyermerritt/status/1433586546393878533?s=21", "score": 11, "replies": [{"body": "DUDE. Elon wants to go to mars himself in a decade.\n\nAka he hopes TSLA will be such a massive self-propelling behemoth that Elon is able to step away, start selling off his shares in massive tranches to properly fund the mars colony, and still have tesla be able to succeed at their mission of forcing the world to convert to clean, renewable energy \n\nTSLA 20T market cap by 2030 guaranteed 👌", "score": 11, "replies": [{"body": "I like the cut of your jib.", "score": 5, "replies": [{"body": "20T *does* only means an average growth of 50% per year between now and 2030\n\nIf anyone can accomplish that, it's tesla", "score": 2, "replies": []}]}]}, {"body": "Everything sounds about what we expected. The no steering wheel compact would be pretty insane but that to me plan for production in 2023-2024 whereas otherwise I would expect end of next year.", "score": 7, "replies": [{"body": "Unless they are planning something drastic with the seat arrangement, the steering wheel is an easy retrofit. Already need the steering mechanism and the servo for FSD, attaching the wheel itself is trivial if it turns out to be necessary.\n\nNo steering wheel would especially seal the deal in terms of profits because 100% of units sold will have software margins.", "score": 3, "replies": [{"body": "Steering wheel in the frunk for emergencies.", "score": 3, "replies": [{"body": "Retractable yolk***", "score": 1, "replies": []}]}]}]}, {"body": "I really hope they don't eliminate the wheel and pedals. As nice as fsd would be, I like driving.", "score": 4, "replies": [{"body": "If I'm reading the tea leaves there, these are not going to be sold to consumers. Robotaxi models.", "score": 8, "replies": []}, {"body": "If it happens they will never be sold to consumers. These would be Tesla owned robotaxis.", "score": 7, "replies": [{"body": "The 25k car is such a huge deal though for a lot of consumers to go Electric. Limiting them to robotaxis would be the wrong approach imo. There always need to be a way for manual control of the vehicle.", "score": 3, "replies": [{"body": "It serves the mission to make them robotaxis asap. Actually one of my four valuation model scenarios is a 100% focus on robotaxis after current capacity is installed. We don't want a Tesla being sold doing 10k miles per year when it can be doing 60k miles per year and displace ICE car miles that way. It is not our mission to make the most unit sales, it's to get the most amount of miles driven to electric. Robotaxi is the only way to do it this decade.", "score": 7, "replies": [{"body": "100% on board for robotaxi asap, but this car needs to be sold to regular people as well. It's the income gap car that's needed to end ice. Nobody is buying a shit chevy spark for 16k when you can get a model 2 for 25k fully electric.", "score": 3, "replies": [{"body": "If they aren't robotaxis then they aren't ending ICE. It is really a terrible allocation to put potential robotaxis in the hands of customers that then say \"nah not gonna let anyone else drive it\".\n\nSelling 1 car to a consumer is like having 6 but throwing 5 away. Yes consumers will have to wait, but this is a fleet multiplier just too important to throw away. Again, we do not need them to buy cars, we need them to drive miles in an electric car.", "score": 3, "replies": [{"body": "Brilliant way to keep the 25k car from cannibalizing sales too", "score": 3, "replies": []}, {"body": "I agree with you, but nobody really can afford to use a taxi rurally. Urban it makes sense for sure. These cars need to be able to get into everyone's hands.", "score": 1, "replies": []}]}, {"body": "I’m with adorable elderberry on this one. Even if it looks like a good move compared to today’s cars it will be bad relative to possibilities available then. In robotaxi world no one will buy a low end  micro car.", "score": 6, "replies": []}]}]}, {"body": "Way more profit potential with Tesla keeping them as their robotaxi fleet", "score": 3, "replies": []}, {"body": "For a 25k commuter vehicle, all you need is a screen that let's you input your destination, and maybe rank preferred parking areas. If you want the privilege of \"driving\" a vehicle it's gonna become considerably more expensive, like horses after cars became a thing\n\n> There always need to be a way for manual control of the vehicle.\n\nOnce it's undeniable that cars drive better than humans, this is gonna become a heavily debated topic. I just hope it ends with manual control not being entirely banned", "score": 3, "replies": []}]}]}, {"body": "In the future FSD will be the default and the FHD (full human driving) package will be an add-on or monthly subscription to get access to the hidden steering wheel and pedals.", "score": 3, "replies": [{"body": "i need the steering wheel and pedals in case of apocalypse", "score": 2, "replies": []}]}, {"body": "You just wouldn't buy the Model 2, other Models will still have it for quite a while at least.", "score": 2, "replies": []}]}, {"body": "This is pretty much what I expected.  The “Model 2” name never made much sense, as this would imply a 2nd Generation platform.  \n\nNormally I discount Sawyer’s tweets, but his reporting this time seems within the realm of reason", "score": 5, "replies": [{"body": "I really hope it’s the Model Q as a final blow to the bears", "score": 2, "replies": []}]}, {"body": "Oof 2023 cybertruck. Oh well. Accumulation phase anyways.", "score": 4, "replies": [{"body": "No surprise there really", "score": 3, "replies": []}, {"body": "probs means my RHD australian model will be 2024 minimum", "score": 1, "replies": []}]}, {"body": "LMAOOO model 3 is a troll??????? Fucking epic", "score": 5, "replies": [{"body": "LOL Ford started the trolling. They trade marked \"model E\" specifically so tesla couldn't use it, on the basis that it sounded too similar to \"model T\"\n\nElon was set on having his SEXY models tho, so he followed through in the proper nerd way- S3XY", "score": 4, "replies": []}]}]}, {"body": "i'm still blown away by ai day and the progress/methods used for fsd.", "score": 9, "replies": []}, {"body": "5th interview in the guy tells me he “thinks” owning individual stocks is not allowed for this role. He was shocked at how quickly i told him that’ll be a dealbreaker", "score": 9, "replies": [{"body": "\"I only want this job so I can buy more stocks!\"", "score": 5, "replies": [{"body": "lol \"i want this job so i can write about tesla to buy more tesla!\" was the conversation in a nutshell", "score": 4, "replies": [{"body": "Definitely rough to find this wrinkle out at the 5th interview. Good luck!", "score": 5, "replies": [{"body": "Thank you!", "score": 3, "replies": []}]}]}, {"body": "https://youtu.be/WQr-rUSSmr0", "score": 2, "replies": [{"body": "Of course.", "score": 2, "replies": []}]}, {"body": "“I want de job for more STONKS!”", "score": 1, "replies": []}]}, {"body": "I got you bro. I'll start an ETF that only contains TSLA shares and leaps for a management fee of 0.69%", "score": 5, "replies": [{"body": "Not bad idea.", "score": 3, "replies": [{"body": "The Active Tesla Options ETF that trades shares, calls, leaps, sells put and covered calls on TSLA only.", "score": 2, "replies": [{"body": "I'd pay 0.69% for someone who wants to actively make me more with options in TSLA than me doing it myself. Make this happen.", "score": 1, "replies": []}]}]}, {"body": ".69% of infinity!? pshhh", "score": 2, "replies": []}]}, {"body": "You have to pick between building wealth or climbing the corporate ladder. It's really dumb that some firms don't allow their employees to invest in stocks or enforcing a long restricted stock list.", "score": 3, "replies": [{"body": "i'll just climb the stonk ladder if that's the case, work at wendy's in the meantime", "score": 6, "replies": []}, {"body": "I don’t believe In Climbing the ladder I feel like everyone is waiting for that next promotion and chases the carrot. I love how he said that was a deal breaker right away. Most places are manipulative and are lying", "score": 3, "replies": [{"body": "You can potentially miss out millions by chasing that corporate carrot. He made a wise choice.", "score": 3, "replies": [{"body": "💯", "score": 1, "replies": []}]}, {"body": "I found out real quickly in the restaurant industry that life’s not fair and employers will lie to you. Might as well stay there while i wait for my riches if i can’t stonk elsewhere, at least there are celebrities and drugs 🤷‍♀️🤷‍♀️", "score": 3, "replies": [{"body": "Yes take care of your workers and they will work\nHarder for you means nothing anymore… but I’ve had a few good bosses anyway but they are rare.", "score": 1, "replies": []}]}]}, {"body": "It is awkward that I’m richer than all the fossils in my dept.", "score": 3, "replies": [{"body": "Awesome...imagine they restricted you from investing in Tesla. lol.  Wonder why you're still working for the man though. You want that pension?", "score": 1, "replies": []}]}, {"body": "Why disclose at all? It’s your personal finances.", "score": 1, "replies": [{"body": "Firms do this to prevent conflict of interest. You can hide your personal finances but you might get fired or fined if they find out.", "score": 1, "replies": [{"body": ">\tif they find out\n\nI don’t tell anyone about my personal finances, and it has nothing to do with job expectations. People get weird when you discuss money.", "score": 1, "replies": []}]}]}]}, {"body": "How did they react? \n\nFor a job writing about personal finance that’s crazy, they should definitively know from interview 1 whether you can invest in individual stocks or not", "score": 3, "replies": [{"body": "he was kind of taken aback and told me to ask the recruiter, that he's not sure of that. i think he's mistaken personally, the recruiter had never heard anything about it either way and said she'd get back to me. \n\ni think the conflict would be i expressed interest in writing about tesla et al. but i can steer clear if that means having both tsla and job. it's not like a stock-recommendation site sooooo.... yeah i agree seems like it would be crazy", "score": 4, "replies": []}]}, {"body": "I'm personally switching to minimum match and just managing my own", "score": 3, "replies": [{"body": "i've yet to go fully corporate so i haven't had the pleasure of those restrictions [yet]. but that seems like a good move lol", "score": 2, "replies": []}]}, {"body": "What kind of role is that, some sort government policy making or related business?", "score": 2, "replies": [{"body": "Editorial role in personal finance. Im hoping/thinking that he was mistaken, but we’ll see 🙄🙄", "score": 5, "replies": [{"body": "Tell them you might pump but you dont dump.", "score": 5, "replies": [{"body": "lmao", "score": 3, "replies": []}]}, {"body": "Hmm that one is tricky.  Good luck.", "score": 3, "replies": [{"body": "Thanks!", "score": 2, "replies": []}]}]}]}]}, {"body": "On one hand CT delay sucks, on the other hand, think of all the extra 40-80k that stays in TSLA for another year!", "score": 11, "replies": [{"body": "Dafuq you gonna sell chairs to buy the truck for? Haven't you ever heard of an auto loan?", "score": 3, "replies": []}, {"body": " Woah woah… you should never sell an appreciating asset for a depreciating one.", "score": 1, "replies": []}]}, {"body": "Fuck the steering wheel", "score": 10, "replies": [{"body": "All my homies HATE the steering wheel", "score": 8, "replies": []}]}, {"body": "Just saw my first model S plaid in PA today (and it wasn’t on fire). Bullish", "score": 8, "replies": []}, {"body": "Tare down that wall! 🧱", "score": 9, "replies": []}, {"body": "approaching cost basis of my last major buy tranche from back in Feb\n\n💎🤲", "score": 9, "replies": [{"body": "Come on 800's!!", "score": 2, "replies": []}, {"body": "🚀", "score": 1, "replies": []}]}, {"body": "UPDATE: yesterday I mentioned that Fidelity increased my margin requirement on TSLA to 60%. \n\nI threatened to leave. They are lowering it to 40%. But they don’t want me to spend all the extra margin on TSLA.", "score": 9, "replies": [{"body": "39% it is", "score": 7, "replies": [{"body": "Sounds reasonable", "score": 3, "replies": [{"body": "yup and thanks", "score": 2, "replies": []}]}]}, {"body": "Don’t they know it’s about to moon?", "score": 6, "replies": [{"body": "I’ll call them back 🌝", "score": 4, "replies": []}]}, {"body": "Shit! They only gave me 50% fuckers", "score": 6, "replies": [{"body": "Time to renegotiate", "score": 3, "replies": [{"body": "As long as we stay above $200 I don’t think will be an issue.", "score": 2, "replies": [{"body": "🤑", "score": 2, "replies": [{"body": "I just didn’t want to get margin called on stupid rules that make no sense.", "score": 2, "replies": [{"body": "There’s an easy arbitration play in SPACs trading under NAV. But at $9.8-9.90 before merger vote. Vote yes to merger. Then elect to redeem your shares for NAV (~10.20). Make 2-3% every few weeks.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Even when your portfolio is over 100% tsla?", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Love it", "score": 2, "replies": []}]}]}]}, {"body": "I don’t even want to mention what degiro offers to all 100% TSLA portfolios…", "score": 3, "replies": [{"body": "Tell me", "score": 3, "replies": [{"body": "Basically 100%, its listed as a class C type stock, therefore its more like 90%", "score": 3, "replies": [{"body": "Man that could be a loaded gun pointed directly at your financial well being with some people....", "score": 2, "replies": []}]}]}]}, {"body": "Robinhood 25% 😏", "score": 2, "replies": [{"body": "Those guys are savages. Love that app. If they drop margin to 1.25%, I would go back.", "score": 2, "replies": []}]}]}, {"body": "Imagine if every other ev manufacturer outside of China had to stop sales and recall their cars, without an available fix, due to possible battery defect #lg\n\n\nWe've analyzed their recall, sir, and there is a danger. Should I have your golden parachute standing by?", "score": 8, "replies": [{"body": "This article is interesting\n\nhttps://www.thedrive.com/news/42140/ford-was-caught-off-guard-by-mustang-mach-e-gts-popularity\n\n in that Ford is appearing to learn certain things like \n\n\"But probably the biggest [lesson learned] is vertical integration. We need to be involved in battery production, we can’t just buy batteries,\" - Jim Farley\n\nAnd yet they continue to fail to commit:\n\n\"Ford's battery capacity demand is estimated to be equal to Volkswagen's at 240 GWh by 2030.\"\n\nLess than a tenth of Teslas planned capacity", "score": 4, "replies": [{"body": "One Mache fire and bankwupt", "score": 5, "replies": []}, {"body": "Actually it’s a lot for them, enough for 5.5 mil cars. Tesla is making batteries for 60 mil cars.", "score": 4, "replies": [{"body": "I forget Teslas ambition dwarfs the competition 🤔\n\nEdit: 2020 - Ford worldwide 4.2 million units.", "score": 3, "replies": []}]}]}, {"body": "If GM was actually the leader of the EV race they would have killed the momentum and delayed the transition by another decade with their incompetence. Thankfully they’re way behind and Tesla is leading the charge.", "score": 4, "replies": []}]}, {"body": "Saw a Bolt parked on a driveway in my neighborhood. RIP", "score": 8, "replies": [{"body": "Set it on fire overnight, no one will even ask how it happened, they'll just be surprised it didn't happen sooner.", "score": 9, "replies": [{"body": "😂 😂 😂", "score": 3, "replies": []}, {"body": "Alternatively spray it down with a fire extinguisher immediately as a precaution 😁", "score": 3, "replies": [{"body": "Not gonna help, these battery fires have internal oxygen supply. Nothing can be done.", "score": 3, "replies": []}]}]}, {"body": "Call the cops on them", "score": 7, "replies": [{"body": "Maybe the Fire Inspector?", "score": 5, "replies": []}]}, {"body": "Get that shit on the street! Disgrace to EVs", "score": 4, "replies": []}, {"body": "Drop off a smoke detector for them to hang on mirror", "score": 3, "replies": []}, {"body": "Should make a scene. “Would someone please think of the children!!”", "score": 5, "replies": []}]}, {"body": "The battle of 740 is being fought by a record low number of people", "score": 7, "replies": []}, {"body": "just found this [interesting pin](https://i.imgur.com/PeiqTu0.jpg) in a drawer", "score": 8, "replies": [{"body": "Lol", "score": 5, "replies": [{"body": "Think I got it at an SEG convention (Society of Exploration Geophysicists). Was sadly in the business back then.", "score": 3, "replies": []}]}]}, {"body": "Ai stack, software stack, training stack all I care about is my tsla stack", "score": 7, "replies": [{"body": "Tsla stack is best stack\n\nBut I just want my button stack so I can experience the AI stack, software stack and training stack and our tsla stack goes 🚀\n\nIt's a virtuous cycle rly", "score": 1, "replies": []}]}, {"body": "My father seems pretty set on buying an ID3.\n\nI've encouraged him to rent a Tesla for a few days and try a roadtrip using both superchargers and non-superchargers.\n\nI'm thinking this might convince him to spend the extra on a Y.\n\nAny other suggestions?", "score": 8, "replies": [{"body": "Buying a non-Tesla EV is like tying a rope around your legs. ID3 is worse than Tesla in every possible way and a poor value overall. \n\nMy bet is he will change his mind and go for a Tesla. Btw, don't forget to tell him about the resale value of Teslas.", "score": 9, "replies": [{"body": "It’s like buying a DROID when the IPhone came out, except you are self inflicting the pain on yourself (IPhone was AT&T exclusive for years at least in defense for those users).", "score": 3, "replies": []}]}, {"body": "Resale much better on Y, cheaper long run", "score": 7, "replies": [{"body": "One of the more important things people forget when buying things.", "score": 1, "replies": []}]}, {"body": "A test drive usually does it", "score": 4, "replies": [{"body": "They drove the Y and liked it but found it was too fast lol\n\nThey'll need to set all the settings to geriatric 😐.\n\nThey do all kinds of long road trips and I think that's where the ID3/4 will really fall apart.  Just not a good solution for their needs but he thinks all the Tesla fans are just exaggerating and I think the FUD is impacting them.\n\nI'll just tell them to not visit me with anything with pouch batteries.  It's just not safe.", "score": 2, "replies": [{"body": "Keep it locked in Chill mode for them. Good luck going on a road trip in an EV in anything other than a Tesla", "score": 5, "replies": []}]}]}, {"body": "show him a video of FSD beta in action. That should do it.", "score": 2, "replies": []}]}, {"body": "Anyone else want to take a dump on Taylor Ogan’s face? That guy is so arrogant and rubs me the wrong way.", "score": 9, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "No way… I’m going to eat PF Chang’s for a month straight and cave his face in with 20 courics.", "score": 5, "replies": []}]}, {"body": "its pretty punchable. there are more punchable faces though. but yeah ill dump on it", "score": 4, "replies": []}, {"body": "Yup. In and around his mouth.", "score": 2, "replies": []}, {"body": "Basically anyone named Taylor if I'm being honest. Your mother was clearly a cunt", "score": 2, "replies": [{"body": "I can get behind Taylor Swift", "score": 2, "replies": [{"body": "Yeah I'd let Taylor swift sit on my face too", "score": 1, "replies": []}, {"body": "She's gained a bit of weight lately. Covid 19 lbs", "score": -1, "replies": [{"body": "Just don’t get under her then 😂", "score": 2, "replies": []}]}, {"body": "Fair point.  Exception proves the rule", "score": 1, "replies": []}, {"body": "She got what she deserved", "score": 1, "replies": []}]}]}]}, {"body": "CT delay makes sense, given his tweet about supply chain issues. Make the thing you can make with the stuff you have. Demand not slowing. Maybe it’s 4680 delay, but Tesla will still be growing their revenues and profits, so not a big worry…", "score": 8, "replies": [{"body": "Extremely excited CT rez holder here, I agree 100%.", "score": 6, "replies": [{"body": "Same. But happy for the delay bc I can have a chance at getting more money.", "score": 3, "replies": [{"body": "They're going to crank out some fk'n Ys though. 🤑", "score": 6, "replies": [{"body": "Thats how I'm getting more money", "score": 4, "replies": []}]}]}, {"body": "I bet it's also delayed pending that metal factory next door 🤔", "score": 2, "replies": [{"body": "Wouldn't suprise me a bit if that was part of it.  It's fun watching the pieces fall into place.", "score": 3, "replies": []}]}]}]}, {"body": "Tits", "score": 7, "replies": [{"body": "What is: jacked to the", "score": 8, "replies": [{"body": "800.85", "score": 5, "replies": []}]}]}, {"body": "our stonk is drawing ever so close to another facerip... it's just a matter of when.\n\nQ3/Q4 earnings will be undeniable in and of itself\n\nfsd beta is out, looks promising, improvements should accelerate\n\naustin/berlin....\n\nthis thing is a tinderbox waiting for a match", "score": 7, "replies": [{"body": "I still can't believe all this growth and margin increase has been done with two factories, and two much bigger ones will come online and ramp at basically the same time", "score": 4, "replies": []}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Manipulation?", "score": 2, "replies": []}, {"body": "Yup. Stock price has gone up 60 points since I bought a March 2023 and it's about break even :)", "score": 2, "replies": []}]}, {"body": "[https://www.reddit.com/r/BoltEV/comments/pg5puu/relocated\\_to\\_the\\_hoa\\_club\\_house/](https://www.reddit.com/r/BoltEV/comments/pg5puu/relocated_to_the_hoa_club_house/)\n\nThis is how you'll be treated if you own a GM electric car", "score": 7, "replies": [{"body": "That's one way to handle the HOA Karen", "score": 2, "replies": []}]}, {"body": "Bolt owner think they have OTA updates because his range decreased: https://www.reddit.com/r/BoltEV/comments/pgirz0/did_they_apply_the_patch_to_all_bolts_how_can_you/\n\nI find this hilarious", "score": 7, "replies": [{"body": "lol aw come on.. I feel bad for him/her..\n\nImagine how much they're going to love their first Tesla", "score": 2, "replies": []}, {"body": "They justify keeping the car by parking it further from their house so if it burns, they won't be in danger.  What in the actual fuck??  The rationalization by these weirdos is cultish.", "score": 2, "replies": []}, {"body": "[this](https://images.app.goo.gl/UNP4Hj78GFF7q1kL9) stopped working working so I assume it had an over air update to protect me.", "score": 4, "replies": []}, {"body": "https://www.reddit.com/r/BoltEV/comments/pgirz0/did_they_apply_the_patch_to_all_bolts_how_can_you/hbbj1sb?utm_medium=android_app&utm_source=share&context=3\n\nMight kill more than just the range... 😳", "score": 1, "replies": []}]}, {"body": "Why the fuck is CNBC writing articles about whether Elon musk gives a shit about abortion laws. It’s ridiculous", "score": 7, "replies": [{"body": "Fake News to get outrage clicks.  CNBC is Fake News and I encourage all investors to boycott their content", "score": 5, "replies": [{"body": "Ah PLTRmon coming back to TSLA. ❤️", "score": 1, "replies": []}]}, {"body": "Clicks we need clicks!", "score": 2, "replies": []}]}, {"body": "https://twitter.com/WR4NYGov/status/1433451128155430913?s=19\n\n🤯", "score": 6, "replies": [{"body": "Hmm. Well there's going to be a lot of billionaires in this sub at that point.", "score": 9, "replies": [{"body": "no one will be left on the sub, everyone will be sipping mai tais with naked super models", "score": 9, "replies": [{"body": "Can confirm", "score": 1, "replies": []}]}]}, {"body": "Even Warren thinks he’s too optimistic. LMAO!", "score": 8, "replies": [{"body": "It's funny because 40% till 2030 is only 14T when Warren says it'll be 200T by then", "score": 5, "replies": []}, {"body": "Wow 😮", "score": 1, "replies": []}]}, {"body": "And I thought Waren was the ridiculous valuation guy", "score": 6, "replies": []}, {"body": "Lol 1000x", "score": 0, "replies": [{"body": "Each share would be like a million?", "score": 2, "replies": [{"body": "A bunch of us would be multi billionaires", "score": 1, "replies": [{"body": "What would 1 dollar get you lol", "score": 1, "replies": []}]}]}]}]}, {"body": "https://www.reddit.com/r/BoltEV/comments/pa3q7a/firerecall_faqroundup_2/hbdly5j/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3", "score": 7, "replies": [{"body": "Definitely non-stop karma (in traditional sense) in that sub. Lutz and his cronies talking shit about Tesla. Brain dead consumer needed their buttons and manual ac vents.", "score": 8, "replies": [{"body": "The bolts are spontaneously combusting and they have 8 factories shut down and we still can’t buy puts against this company yet LOL", "score": 4, "replies": [{"body": "Maybe time for some otm monthly Ford puts for when the Mache is recalled", "score": 2, "replies": [{"body": "🤔", "score": 1, "replies": []}]}]}]}, {"body": "Spicy! Well done", "score": 5, "replies": []}]}, {"body": "Initially, the ID 4’s battery pack, which is comprised of 288 pouch cells in 12 modules, will be produced by South Korea’s LG Chem. But once ID 4 production shifts to Chattanooga, Tennessee, in 2022, the batteries will be supplied by SK Innovation\n\n⏲️💣", "score": 6, "replies": [{"body": "I think Mach-E also uses them", "score": 4, "replies": [{"body": "Ford and vw sweating bullets rn", "score": 6, "replies": [{"body": "I mean this one could just end them right here right now", "score": 4, "replies": [{"body": "Imma go spread fud in the id4 and Mache subreddits about the battery fire potential.", "score": 9, "replies": []}]}]}]}, {"body": "RIP", "score": 2, "replies": []}, {"body": "So should we be expecting recalls soon or is this simply showing that GMs engineering is subpar", "score": 2, "replies": [{"body": "If what gm says about the tab and separator is correct then they all need recall", "score": 4, "replies": [{"body": "What will be the straw that beaks the back of VW Group.", "score": 2, "replies": []}]}]}]}, {"body": "no one on the corner got swagger like us, swagger like us, swagger like us....", "score": 7, "replies": []}, {"body": "Got confirmation for pickup of our p100d for Sunday. Bought back my CCs for this week. A nice 10% day would be welcome tomorrow to finish the week 😀", "score": 7, "replies": [{"body": "Congrats man!", "score": 3, "replies": []}, {"body": "Exciting!", "score": 3, "replies": []}]}, {"body": "Russ Mitchel has some bull shit out. It is interesting how the investigation into autopilot is officially regarding 12 event in which drivers claimed that they were using autopilot, many of which just using known facts can quite easily be excluded as events that autopilot was engaged. But then fucktards like Russ state that the events were involving autopilot with no qualifications. He loves to deceive. How does he keep his job.", "score": 7, "replies": []}, {"body": "Went to go pick up dinner tonight. Man and his daughter stopped by and asked about my Y. Directed them to the nearest location for a test drive. Before he left, he asked how much and was pleasantly surprised it was not $100k 🐂🐂 here’s to hoping we gain another family member!!", "score": 7, "replies": [{"body": "If that isn't enough just step on the accelerator once for them and it's a done deal", "score": 3, "replies": []}]}, {"body": "Elon sounds really impressed by FSD V10.\n\nI feel like it holds more weight than some of his previous declarations about V9 and V9.2, which I suspect were made before he personally tested them. I think he's already driving V10.", "score": 13, "replies": [{"body": "Was thinking the same thing", "score": 5, "replies": []}, {"body": "Elon Musk: \"I mostly run alpha software in my car, which is not meant for public consumption. A few days before release, I switch my car to what public will experience.\"\n\n[https://twitter.com/elonmusk/status/1433230003949371392](https://twitter.com/elonmusk/status/1433230003949371392)", "score": 3, "replies": []}, {"body": "He also just reiterated in a tweet that V10 is a step change improvement", "score": 3, "replies": []}]}, {"body": "Can't wait for the day where my tesla drops me off at a given location, I get out and it drives itself to the nearest parking lot and parks itself", "score": 6, "replies": [{"body": "Well that's the thing, it won't drive to the nearest parking lot. It would drive to a cost and space effective parking lot, likely large multi floor parking garages in cities coupled with automated charging. Could practically reduce the required parking space at dense areas to 0.", "score": 4, "replies": [{"body": "This sounds like a robotaxi overflow parking and not private personal vehicle future. Otherwise, the wait time could get annoying and congested waiting for a far away summon. \n\nValet lots will turn into: Personal Vehicle pickup.", "score": 1, "replies": [{"body": "I mean for the occasions where you know how late you'll leave like work etc it doesn't matter where the car is parked, and if you go to a restaurant or something you either just take a robotaxi there or you take the a short robotaxi to where your car is parked", "score": 1, "replies": []}, {"body": "Meh. Seems like a pretty simple solution would be to set a departure time. So if you’re going to the movies you can say, “be back in 90 mins” so it goes and charges for an hour then comes back and waits for you. Easy.", "score": 1, "replies": []}]}]}, {"body": "obligatory: 2 weeks", "score": 2, "replies": []}]}, {"body": "Wonder if any tsla shorts got a bolt and literally burned.", "score": 7, "replies": [{"body": "If only we could harness their screams monsters, inc style.\n\nFun fact: to scream out enough energy to heat up a quarter liter of coffee to 50C it would take 1 year, 7 months, 26 days, 20 hours, 26 minutes and 40 seconds.", "score": 7, "replies": [{"body": "How many screams to power a Tesla?", "score": 1, "replies": []}]}]}, {"body": "The traditional 60/40 portfolio will likely neither grow in excess of inflation nor provide much downside protection.\n\nTime to 60 tsla 40 crypto", "score": 7, "replies": [{"body": "60% TSLA, 40% TSLA", "score": 14, "replies": [{"body": "60 calls 40 shares", "score": 7, "replies": []}]}, {"body": "That’s about what my portfolio is. Although over the last few days it’s closer to 55/45 Tesla bitcoin/stx", "score": 1, "replies": []}, {"body": "That's just about my strategy: 60:25:15 TSLA:ETH:BTC", "score": 1, "replies": []}]}, {"body": "Tesla will take your chips thanks GM\n\nGeneral Motors to temporarily halt production of nearly all US plants due to pandemic-related chip shortage overseas\n\nhttps://apple.news/A_Iv5ggTaSDKh1cX7YB1qFg", "score": 6, "replies": [{"body": "All your chips, are belong to us", "score": 8, "replies": []}]}, {"body": "Well.. rumors starts again..\n\nApple preparing mass production of apple car by 2024 - CNBC", "score": 5, "replies": [{"body": "https://en.m.wikipedia.org/wiki/Apple_electric_car_project\n\nMass production imminent since 2014.", "score": 9, "replies": []}, {"body": "Shaping up to be a massive dud. Especially if they partner with Toyota", "score": 4, "replies": []}, {"body": "The longer Apple waits, the more legacy ICE will be desperate to make a deal with them. \n\nApple would want complete control, I don't think that fits well with Toyota's M.O.\n\nRegardless of what happens seems like this is many years away still.", "score": 2, "replies": []}]}, {"body": "fuck I hate Ford so much, I hope the company and stock fucking die.. piece of shit bullshit company", "score": 5, "replies": []}, {"body": "Apple should just resell NIOs with carplay in the USA as apple cars", "score": 7, "replies": [{"body": "shhhhhhhh", "score": 5, "replies": []}, {"body": "If Apple ever ends up pulling the trigger on cars, something like that will probably happen.", "score": 3, "replies": []}]}, {"body": "Mm meower makes a good point of the financial incentive to releases the button 9/24", "score": 6, "replies": [{"body": "Recognize deferred revenue in Q3?", "score": 6, "replies": [{"body": "Yes", "score": 3, "replies": []}]}]}, {"body": "The week ending on 9/17 has 857k options expiring, representing 8.9% of all the outstanding shares. The week after that has 43k open interest. Waiting for those to expire and free us from this fuckery.", "score": 12, "replies": [{"body": "Believe 9/17 is a witching week hence bigger volume difference.", "score": 1, "replies": []}]}, {"body": "I can only imagine the kind of havoc the apple watch is causing cardiologists. Apparently apple never learned about pretest probability. For every clinically significant arrhythmia the watch catches, it causes thousands of false positives, unnecessary testing, catheter procedures and a few deaths from complications. Gj Tim cuck. there's a reason we dont x-ray everyone and play where's the tumor.", "score": 11, "replies": [{"body": "TIL", "score": 5, "replies": []}, {"body": "Being a rads, I feel like ED panscans everybody and their mom (or cat) who walks through their doors, but yes, I agree with you about apple.", "score": 2, "replies": [{"body": "Sounds like Tim cook runs your ED", "score": 1, "replies": []}]}, {"body": "Axelrod-Capital-level short waiting to happen.", "score": 1, "replies": []}, {"body": "Any thoughts on $SENS Senseonics 180 day CGM.  FDA approval is expected in the next couple quarters.", "score": 1, "replies": [{"body": "I don't mess w biotech. If a Tesla is complicated a cell and a person is next level. Too easy to get cucked by the FDA or some weird side effect.", "score": 1, "replies": []}]}, {"body": "[Oil Change!](https://youtu.be/JMpgeMoQS7o)", "score": 1, "replies": []}]}, {"body": "What percentage of Cybertruck orders you think will go to fulfillment? \nHere in Australia it is pretty rare to see a F-150 cause it’s so big, mainly see land cruisers. If the cybertruck is about the same size as a F-150 I don’t think people know how big it actually is", "score": 4, "replies": [{"body": "Almost nobody in Western europe has a truck unless they use it for work. Maybe people will order CT as a meme but I don't think it will have wide adoption outside the US", "score": 9, "replies": [{"body": "it won't fit on our narrow country lanes lol", "score": 3, "replies": []}, {"body": "Cybertruck doesn't care", "score": 1, "replies": [{"body": "Literally", "score": 2, "replies": [{"body": "Cybertruck doesn't care about anything", "score": 2, "replies": [{"body": "It will fuck you up", "score": 2, "replies": []}]}]}]}]}, {"body": "I want to see it in person first (also in Australia)", "score": 2, "replies": [{"body": "It will be awhile before it gets here. I know people that ordered about 10-15 CTs for robotaxi, but then where do they store it?", "score": 1, "replies": [{"body": "I wouldn't want to sell my tsla yet to buy a CT. If it takes until late 2024 for it to get to Australia that's fine with me", "score": 1, "replies": []}]}]}, {"body": "Lol Australia is gigantic and you don't have big vehicles?\nCT order fulfillment rate depends on robotaxi status vs the regional locations of pre-orders.\n\nBTW robotaxi status also calls into question will Tesla allow CTs to be on robotaxi network at all.\n\nSoftware Engineer - Tesla Bot https://g.co/kgs/Wm9RKQ\n\n>Build a software stack that will control multiple types of mobile robots/vehicles, including Tesla commercial vehicles (M3/MY/Semi)\n\nI'm going with 90% cancellation if no robotaxi period for CT. If robotaxi isn't yet ready and CT is included, 70% reduction. If robotaxi is a thing, 0% reduction.", "score": 1, "replies": [{"body": "I tweeted Elon\n\nhttps://twitter.com/valiryon/status/1433337364059869192?s=20", "score": 1, "replies": []}]}]}, {"body": "When’s this volume game going to change?\n\nSuspect no one really wants to be involved till infrastructure bill passes, new factories open, FSD beta button is public, and the stars and planets are aligned. Guess a virgin sacrifice wouldn’t hurt either.", "score": 6, "replies": [{"body": ">Guess a virgin sacrifice wouldn’t hurt either.\n\nwhere bjorn?", "score": 2, "replies": []}, {"body": ">Guess a virgin sacrifice wouldn’t hurt either.\n\nI vote for Mark Spiegel", "score": 2, "replies": [{"body": "Might upset the gods with how dirty he is.", "score": 3, "replies": []}, {"body": "Not a virgin, he catches bear dick on the reg", "score": 3, "replies": []}]}]}, {"body": "Lithium stocks go brrrr", "score": 5, "replies": [{"body": "I swear you’re invested in everything man", "score": 3, "replies": []}, {"body": "the lithium must flow!", "score": 3, "replies": []}, {"body": "Which ones?", "score": 1, "replies": [{"body": "the usual ALB SQM PLL LTHM", "score": 1, "replies": []}]}, {"body": "LIT ETF FTW. My second largest holding behind TSLA. Has been carrying my portfolio the last 6 months!", "score": 1, "replies": [{"body": "LIT is a beast", "score": 1, "replies": []}]}]}, {"body": "🚀", "score": 4, "replies": [{"body": "^🚀", "score": 3, "replies": [{"body": "this", "score": 4, "replies": [{"body": "Agreed       .", "score": 2, "replies": []}]}]}, {"body": "🍆", "score": 2, "replies": []}]}, {"body": "GM engineers exploring root cause of Bolt fire issue:\n\n[https://youtu.be/Nc0jJOTi0Eo?t=853](https://youtu.be/Nc0jJOTi0Eo?t=853)", "score": 6, "replies": [{"body": "Thermal expansion and contraction of pouch cells resulting in compromise of the separator and short circuit of the cell, leading to thermal runaway.", "score": 4, "replies": [{"body": "many cars use LG pouch cells, but only GM's blow up. Must be shitty GM parts or something.", "score": 6, "replies": [{"body": "This is true, but nearly all pouch cell cars have had issues. Gm and Hyundai cells by LG. Porsche also. Limited amount of Taycans around but quite a few fires so far. Same cells.", "score": 5, "replies": [{"body": "Ruh roh", "score": 4, "replies": []}, {"body": "Yeah Porsche has done an amazing job burying their fire stories.", "score": 4, "replies": []}, {"body": "Leafs have pouches, as do most hybrids I thought?", "score": 2, "replies": [{"body": "Older leaf cells were lithium magnese oxide, lower power density from the new lithium magnese cobalt chemistry. Likely that swelling and thermal expansion and contraction didn't really occur in the lower energy density cell chemistry. Kind of like the LFP cells tesla is using. The chemistry itself is much safer than a high nickel cobalt combo. The cars also produce very little in current draw. Original leaf was 147hp. Basically the higher the stresses on the cell (current draw, charge speeds, charge capacity and discharge) all play a factor into how much that cell expands and contracts.", "score": 1, "replies": [{"body": "Hmmm ok\n\n\nI'm pretty up to date with cylindrical cells but pouches I've not spent much time on.  I was really big into RC and LiPos though so I get the swelling aspect.  Those things were extremely sensitive to even the slightest bit of overcharging, high current, improper storage, or shock/puncture damage\n\n\nHad to charge them in a damn cast iron dutch oven.  They are kind of the other extreme but same concept I guess", "score": 1, "replies": [{"body": "Pouch cells basically are separated by an aluminum film. That's really all the protects the cell. If you look up a expanded cell, you'll see why you really wouldn't wanna use them in a car from a safety aspect.", "score": 1, "replies": []}]}]}]}, {"body": "VW uses the same, right?  No issues so far?\n\nI wonder if it's just a question of time.\n\n💣", "score": 1, "replies": [{"body": "There's other factors at play of course, but yeah time will tell. Pouch cells are preferred for more energy density in smaller packs but sacrifice cell stability depending on application. 4680 really will address all the issues between cell types in one cell that combines the best of all. High density, ease of cooling, rapid discharge and charge without thermal issues, structural protection. It really will be revolutionary.", "score": 1, "replies": []}]}]}]}, {"body": "Quite obviously", "score": 3, "replies": []}, {"body": "It could be a lot of things, it’s really hard to pin one down. Bad software is also very likely. All those different ECU’s from different manufacturers trying to work together…. there are a fuck ton of potential failure points.", "score": 3, "replies": [{"body": "Someone (GM) didn’t do their FMEA. 💀", "score": 3, "replies": [{"body": "Over time we’re going to learn that extreme vertical integration is the only way to avoid catastrophic failure in high volume EV production.", "score": 4, "replies": []}]}]}]}, {"body": "😂 clicked link", "score": 5, "replies": []}]}, {"body": "Hoping V10 really pushes smart summon since it’s one stack. I need it to pick me up from my mailbox.", "score": 5, "replies": [{"body": "I look forward to the new depths of human laziness FSD will allow us to achieve.", "score": 7, "replies": [{"body": "WalE sausage people in our future?", "score": 5, "replies": [{"body": "Hard to say because drugs, gene manipulation, low calorie good tasting food and cosmetic surgery will also see some amazing improvements.", "score": 3, "replies": []}]}]}]}, {"body": "Besides all the unrealised gains i made so far - I learned A LOT of different and valuable stuff.", "score": 4, "replies": [{"body": "Some of the people on this Reddit will help you get rich if you listen to them and learn from them", "score": 8, "replies": [{"body": "And some of them will do the opposite. The trick is figuring out whom to listen to", "score": 6, "replies": []}, {"body": "Aren’t you in class right now?", "score": 4, "replies": [{"body": "I’m a lifelong student of TSLALounge", "score": 2, "replies": []}]}, {"body": "we just speculate around here.", "score": 1, "replies": []}]}, {"body": "And the friends you made along the way.", "score": 6, "replies": [{"body": "yes <3", "score": 1, "replies": []}]}, {"body": "If im gonna make it , its because i stood on the shoulders of the internet.", "score": 5, "replies": []}, {"body": "we got PHDs and MBAs in tsla even tho elon doesnt care about those", "score": 4, "replies": []}]}, {"body": "Lora is so quick to respond on any Elon tweets which can be spinned negatively but anything positive and she is on vacation.", "score": 5, "replies": []}, {"body": "Dad is considering buying a Tesla to turro it out. He doesn't drive much. Is turro flooded with teslas now or would he get a good ROI?\n\nE: he lives in Washington DC", "score": 5, "replies": [{"body": "You can look on Turo app.\n\nI’ve been thinking about it for the nyc area. Would be nice to have Tesla for weekend trips but for commuting etc., it is worthless to have any car here so if I could pay for car with renting out that would be sweet. I’m about 15 mins ($18 Uber ride) from EWR so I’m sure I could get airport business.", "score": 3, "replies": []}, {"body": "I think it entirely depends on where he lives.", "score": 2, "replies": []}, {"body": "DC has a lot due to NoVA and MD.", "score": 2, "replies": []}]}, {"body": "https://youtu.be/voOdM-GUXac\n\nManny Khoshbin just got his brand new Plaid S", "score": 6, "replies": [{"body": "If you have over 1M subs and no Plaid, you are doing something wrong.", "score": 4, "replies": []}]}, {"body": "Very tempting to do some manupulation. Buy a Mache, buy a bunch of F puts a dollar otm. Set Mache on fire. Call news. Sell puts.", "score": 4, "replies": [{"body": "I’ve been trying to test drive one so I can let blues clues crash and give me a bruise cruise. Let’s line this up and make it happen back to back", "score": 6, "replies": [{"body": "Don't tell the shortseller enrichment commission", "score": 2, "replies": [{"body": "But please let us lounge poors know in advanced so we can get in on the action?", "score": 1, "replies": []}]}]}, {"body": "The stock would probably go up", "score": 5, "replies": []}, {"body": "I don't think this even classifies as illegal, it seems its only illegal to pump but not to force a dump", "score": 3, "replies": [{"body": "Same shit that susquehana asshole pulled w the plaid fire.", "score": 3, "replies": []}]}, {"body": "We can start a TL hedge fund and make profits by committing vast amounts of fraud", "score": 2, "replies": []}]}, {"body": "Beware guys, kolodny's got a fresh pile of diapers on deck, and you know how she can get after a few.", "score": 6, "replies": []}, {"body": "Guys guys!  I have very important news!   [ABBA](https://reddit.com/r/Music/comments/pgm7le/abba_will_release_a_new_album_first_time_since/) Just released 2 brand new songs!", "score": 5, "replies": [{"body": "Heck ya!", "score": 2, "replies": []}, {"body": "They're pretty good!", "score": 2, "replies": [{"body": "Would you say they’re banger?", "score": 2, "replies": [{"body": "Don't Shut Me Down could be", "score": 1, "replies": []}]}]}]}, {"body": "Ugh hope saywer is 10000% wrong about CT delay. I want.", "score": 5, "replies": [{"body": "Timeline sounds about right to me. First model y ramp then cybertruck. Consistent w timing of fsd v4", "score": 7, "replies": [{"body": "Thought time was planned for 2022 volume nit 2023", "score": 1, "replies": [{"body": "Takes a few q to ramp no matter what", "score": 3, "replies": []}]}, {"body": "And 4680 is definitely going to be needed for ct", "score": 1, "replies": []}]}, {"body": "What did he say? I don't have Twitter.", "score": 1, "replies": [{"body": "CT now delayed to end of 2022 with volume production starting  in 2023", "score": 1, "replies": [{"body": "I guess that let's my 12 shares I currently set aside to go towards the CT grow in value. Market won't like hearing this new though at the same time. Hopefully FSD crushes it.", "score": 3, "replies": [{"body": "DUDE! Its such a bad bargain, selling chairs for CT. Just get a loan, thug it out for 5 years… but don’t sell a rising asset for a depreciating one.", "score": 2, "replies": [{"body": "I've set the shares aside specifically for CT. I'll exercise 1 or 2 of my leaps to hodl for retirement.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "teesssslllaaaaaa", "score": 5, "replies": []}, {"body": "Shame, shame, shame\n\nhttps://imgur.com/gallery/aU75BOY\n\n🤣🤣🤣🤣", "score": 4, "replies": [{"body": "Pain.", "score": 3, "replies": [{"body": "❤️❤️❤️❤️", "score": 1, "replies": []}]}, {"body": "Furst tits 800.85 by Friday confirmed", "score": 1, "replies": []}]}, {"body": "Pretty sure Tesla wins the franchise wars, homeless will live in the sewers and we won't fuck for real anymore.", "score": 4, "replies": [{"body": "And eating at taco bell", "score": 3, "replies": [{"body": "Don’t forget the 3 shells.", "score": 2, "replies": []}]}]}, {"body": "Hello. I’m here for the breadsticks. I was promised breadsticks.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 4, "replies": [{"body": "I liked Gary's point about there still being a lot of fund managers who are underweight, and that they will increasingly be under pressure to buy as the stock rises, sorta similar to the short squeezes we saw in 2020.", "score": 4, "replies": []}]}, {"body": "‘Tis a good day. Let’s go!", "score": 4, "replies": []}, {"body": "TSLA thesis:\n\n1. Elon;\n2. TSLALounge\n\n.", "score": 3, "replies": [{"body": "3. Rob", "score": 5, "replies": []}]}, {"body": "a nice slow, steady SP rise induces maximum sleep loss for the shorts & haters", "score": 5, "replies": [{"body": "Death by slow boil", "score": 3, "replies": [{"body": "🦞🔥", "score": 1, "replies": []}]}]}, {"body": "https://youtu.be/IFACrIx5SZ0\n\nShould I do a gif of this making fun of OEMs\n\nThinking about doing a voice over. Suggestions?", "score": 5, "replies": [{"body": "lmao", "score": 1, "replies": []}]}, {"body": "V10 is supposed to be one stack to rule them all, right? If FSD behavior like moving over within the lane is used on highways, highway driving will be really close to lvl 3/4. Main thing is just moving over for semis", "score": 5, "replies": []}, {"body": "Just a reminder: All charts green (:", "score": 5, "replies": [{"body": "The 6mo has become bearable again", "score": 3, "replies": []}]}, {"body": "Gotta say whoever designed the model 3 HVAC was hopefully fired cuz it stinks up every 6 mo and is hard to clean.", "score": 3, "replies": [{"body": "Mine smells like I took a shite in the vent. But I tell everyone it’s great and has no issues 🤫", "score": 3, "replies": []}, {"body": "Mine took two years to get smelly. Cheap $55 or so mobile did it for me", "score": 3, "replies": [{"body": "Same. Just had my filter and system cleaned.", "score": 1, "replies": []}]}, {"body": "same problem on my Oct 2020 Y too", "score": 2, "replies": [{"body": "Just cleaned my evaporator for the first time on my 2019 Model 3. It's that damn cover with that one damn screw. 🤨 Seriously considering this. \n\nhttps://youtu.be/8P-V4IVdpyo", "score": 2, "replies": []}]}, {"body": "I keep hearing about this problem but I haven't noticed it at all in my car. I did get the filter changed about a year ago.\n\nOr my sense of smell is shiit", "score": 1, "replies": []}, {"body": "I run the AC for a bit before I get in the car and it seems to help me avoid the smell most of the time.  Still ridiculous to have to constantly battle a smelly hvac system though", "score": 1, "replies": []}]}, {"body": "740 is not even that attractive. Why the drama. Come on stonky, you belong elsewhere .", "score": 4, "replies": []}, {"body": "Knock knock knocking on $740s 🚪", "score": 3, "replies": []}, {"body": "Bosch doing a good job not making chips", "score": 3, "replies": [{"body": "I’m dealing with them everyday. These guys go on vacation half the time and complain they don’t have time to get things done.\n\nhttps://youtu.be/BC8PQPvQS-o", "score": 5, "replies": [{"body": "Germans are very efficient. Google it.", "score": 6, "replies": [{"body": "This is what the search came up with:  https://g.co/kgs/VfJP1w", "score": 2, "replies": []}]}, {"body": "Inefficient and 🌈", "score": 5, "replies": [{"body": "They make mediocre cars...", "score": 3, "replies": []}]}, {"body": "I'm german and I've worked 2 years in Hamburg as a Software Dev. I can't even explain, how annoying that was. Germany is not innovating. Germans don't like changes and if you dare want to change a 20-year-old tech-stack, you are an asshole. So many useless meetings with no message. You need permission for every little shit you do and ask for meetings, do daily's, weeklies, moving your table 1 inch, making coffee, breathing, living, existing.\n\nWelcome to Germany :)", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Don't get me wrong fuel cells could make sense in some applications like aviation but only on medium to long haul jets, and even so I believe synthetic fuels would probably make more sense, where batteries simply cannot carry enough energy, and we already have all of the infrastructure built out to carry kerosene", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Whats Toyota bringing to the table? Lol", "score": 6, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Plus free fuel coupons.", "score": 2, "replies": []}]}, {"body": "A kitchen duh", "score": 5, "replies": []}]}, {"body": "In a sane world, that would be bad news for apple", "score": 4, "replies": []}, {"body": "There is a very slim to 0 chance Apple makes a car by the end of the decade", "score": 5, "replies": []}, {"body": "But akio said we would run out of electricity", "score": 5, "replies": []}]}, {"body": "*shakes fist at the sky*", "score": 4, "replies": []}, {"body": "I'm seeing this trading pattern today. Bullish?\n\nhttps://imgur.com/a/RpnYp11", "score": 5, "replies": [{"body": "Very bullish. Everyone knows that can only mean a third boob is imminent.", "score": 2, "replies": [{"body": "Two weeks!", "score": 1, "replies": []}, {"body": "we already had three boobs today, can't wait for the fourth one.", "score": 1, "replies": []}, {"body": "We've had two boobs, yes, but what about third boobsies?", "score": 1, "replies": []}]}, {"body": "800.85 cresting the horizon", "score": 2, "replies": []}, {"body": "We are doing sideboobs since a while. Lets get that erecting now!", "score": 1, "replies": []}]}, {"body": "Everybody start pumping, we gotta get this sucker green by EOD\n\n8=✊=D", "score": 3, "replies": [{"body": "On it Sir!", "score": 2, "replies": []}, {"body": "fine, i'll transfer some money and buy", "score": 1, "replies": []}]}, {"body": "Imagine selling covered calls before the button comes out", "score": 4, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "FSD take rate is only 15% according to surveys. If that number goes to 50% because of a good button, or subscriptions massively increase, that’s more margin for end of Q3, beginning of Q4. Wall street looks for recurrent software margin in their models.", "score": 5, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Tbh, i also think that delays are priced in, and actually delivering on the button isn’t. I think if analysts can visible see their friends using FSD beta and try it out themselves, stonk go uppy", "score": 2, "replies": []}]}, {"body": "I don't think there will be a \"good button\" on first release.\n\nItll be a little better than it is now, but still have to watch it like a hawk because it'll still messes up too much (which is totally okay at this stage)\n\nIf anything it'll turn people off. We waited for this? It's not worth 10k or the monthly fee!\n\nAnd then it'll get better and better and better and it'll do it at a reasonable pace and then one day it'll be even better than autopilot today.\n\nThat's when it'll bring in the new subs.\n\nEdit: 1-2 years for shut up and take my money status.", "score": 3, "replies": []}]}]}, {"body": "What about $1600 strikes?", "score": 2, "replies": [{"body": "Maybe after button. Even if the stock wouldn’t hit 1600, I’d bet you could make a higher premium post button.", "score": 3, "replies": []}]}, {"body": "Button won’t impact stack until we start seeing uptick in take rate.", "score": 0, "replies": []}, {"body": "Yea I closed all mine out over the past couple weeks and am just chillin looking to buy another leap soon", "score": 1, "replies": []}]}, {"body": "https://www.youtube.com/watch?v=JCllPQ3O8Lo\nthe king of all vaporware", "score": 3, "replies": [{"body": "Lol yeah I'm sure the car will look just like that when it comes out.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": []}, {"body": "not gonna lie, the interior is sexy.. Hope Tesla makes something like this one day lol", "score": 4, "replies": []}, {"body": "Didn’t even bother with the fake center console that will nothing like the concept. Bravo.", "score": 1, "replies": []}, {"body": "Maybe but I actually really dig the exterior styling except for the rear end.", "score": 1, "replies": []}]}, {"body": "Sawyer peddling his info on clubhouse right now.", "score": 6, "replies": [{"body": "Everyone on this sub probably read through that list and was like “yup,yup, knew that, sounds right”…and he’s got breaking news on every platform 🥴😂.", "score": 2, "replies": []}, {"body": "whats he saying", "score": 3, "replies": [{"body": "All the stuff he tweeted. It’s bunch of qelon all talking about it.", "score": 5, "replies": []}]}]}, {"body": "BTC | ETH | ADA 🔥🔥🔥\n\nDon’t say I didn’t warn you. I called Tesla buying Bitcoin before it happened and Tesla re-accepting BTC is imminent. By year end. 100k BTC is not a meme. \n\nLFG.", "score": 9, "replies": []}, {"body": "Filth", "score": 3, "replies": [{"body": "You're 9th. Late night? Sleep is for the weak! 🦾", "score": 2, "replies": [{"body": "Yeah can’t sleep, \"bolted\" some bread and was checking a bit of news from this retarded planet. \n\nFFS people need to go back to reading fucking books.", "score": 2, "replies": [{"body": "What's bolted some bread... You lit bread on fire? That's fucked up.\n\nI gotta read this: https://www.amazon.com/dp/0321751043/ref=cm_sw_r_cp_apa_glt_fabc_EY5S5GGZS8JSRTJ1RXA6 (I have 1-3 I read the first chapter, get excited, piss my pants and forget who I am thusly can't make progress /s)", "score": 1, "replies": [{"body": "Ugh I wish I had time to spend reading something like that", "score": 2, "replies": []}]}]}]}, {"body": "https://youtu.be/oQqRxoUUPks", "score": 1, "replies": [{"body": "He stole my target year from my projection chart, but his charts aren’t nearly as good as mine. 😜\n\nGotta show you my latest update on my charts...", "score": 3, "replies": [{"body": "He's going on and on lol and the ads... I'll take your chart any day.", "score": 3, "replies": []}]}]}]}, {"body": "PM red? 😱\n\nTime to live in a cardboard box…", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "You lost me at \"GM robo-taxies\"", "score": 6, "replies": []}]}, {"body": "I’m wondering now if Friday Doom has shifted to Thursday Doom/Friday Fakeout.\n\nThis is part of my thesis that the institutions are using the massive amounts of trading data they get from Robinhood and other sources to train models of investor behavior, so they can more efficiently mess with our heads. As soon as we recognize a pattern, the institutions change it up.", "score": 3, "replies": []}, {"body": "snip... snap... snip... snap", "score": 3, "replies": [{"body": "🤖bleep bloop🤖… retail profits detected… 🤖 activating counter-rise algorithms🤖", "score": 2, "replies": []}]}, {"body": "Someone talk me out of buying a June 2023 $1400C", "score": 3, "replies": [{"body": "Money is just another trap that you can fall into, and the accumulation of it shouldn't be your lifelong ambition. Jk with that hippy shit, but you did ask for someone to try.", "score": 4, "replies": []}, {"body": "I'll try.\n\nJust buy shares instead.  No downside, plenty of upside.\n\n🤷", "score": 4, "replies": []}, {"body": "Wait for September chain.", "score": 3, "replies": [{"body": "Sept 13. Soooo faaaar away!", "score": 1, "replies": []}]}, {"body": "Macro", "score": 2, "replies": []}, {"body": "delay it", "score": 1, "replies": []}]}, {"body": "When do China august numbers come out?", "score": 3, "replies": [{"body": "My guess tomorrow morning.", "score": 1, "replies": []}, {"body": "Most likely middle-end of next week", "score": 1, "replies": []}]}, {"body": "Where all the volume goes????", "score": 3, "replies": []}, {"body": "Idk… all these battery fires, idk if I should invest in car companies like Tesla /s", "score": 3, "replies": [{"body": "Idk.  Chevy is really blazing the way.", "score": 4, "replies": [{"body": "Sick burn 🔥", "score": 4, "replies": []}, {"body": "Yeah! I read good reviews about it at the BoltEV subreddit…", "score": 2, "replies": []}]}]}, {"body": "MMs suppressing calls because they know what’s about to happen.", "score": 3, "replies": [{"body": "👆🤑", "score": 1, "replies": []}]}, {"body": "When will my model 3 get the OTA update for fire/bomb mode to compete with the bolt?", "score": 3, "replies": [{"body": "\"Camp\" is best you'll get", "score": 5, "replies": [{"body": "Hmmm", "score": 1, "replies": []}]}]}, {"body": "From Toyota to GM, VW, Hyundai, Honda, etc, Tesla is turning all of the   \nICE cars into classic cars/antiques/collectible (or not) trinkets   \novernight!", "score": 3, "replies": []}, {"body": "dogecoin millionaire guy going \"all in\" on cardano now", "score": 3, "replies": [{"body": "OD’ed in Haitian toilet stall is my end game theory.", "score": 3, "replies": []}, {"body": "👀", "score": 1, "replies": []}, {"body": "Hope he remembers to pay 500k in taxes before his position is worth nothing", "score": 1, "replies": []}]}, {"body": "Holding $740 is all Burry and the shorts have. Time to take it from them", "score": 3, "replies": [{"body": "Wouldn’t be surprised if Burry closed his posistion. His thesis was a surprise taper/interest rate increase which is clearly not happening now. Might be a little early but not a surprise big jump", "score": 2, "replies": [{"body": "His thesis is Tesla is a car company like Toyota and gm.", "score": 2, "replies": [{"body": "No it wasn’t. His thesis was oriented around macro (aged surprise response to inflation) and he saw Tesla and ARK as largest targets impacted if his thesis was correct since the majority of its SP has future performance baked in", "score": 1, "replies": [{"body": "Remember all the tweets he deleted comparing Tesla to automakers", "score": 2, "replies": [{"body": "Sure but his original thesis was macro then he found targets over the next 6-12 months. Tesla is an auto company in 2021. May be something else in 2022 and beyond but in 2021 his thesis is correct.\n\nIf feds had surprised tapering and lifted interest rates, you can bet TSLA would be under 500, 400 or even less. Tidy profit considering he probably bought in April around 750", "score": 1, "replies": []}]}]}]}]}]}, {"body": "If you had fallen into a coma watching this stock in March you would assume you hadn't missed anything.", "score": 3, "replies": [{"body": "That's actually kind of in line with my theory\n\n\nSP pumped the stock way too much, and we're basically back to where we would have been without it being a \"thing\"", "score": 2, "replies": [{"body": "But I was able to end up $800K ahead by selling some absurdly priced covers. It worked out well here.", "score": 1, "replies": [{"body": "I attempted the same but I timed it extremely poorly\n\nHad to keep rolling them up and out like 5 separate times.  Gonna get killed in taxes", "score": 1, "replies": []}]}]}]}, {"body": "pls $1200 2023", "score": 3, "replies": [{"body": "Uhhhh 1200 2022 is highly likely.", "score": 5, "replies": [{"body": "Highly likely low", "score": 3, "replies": [{"body": "2023 I have forecast 1800.", "score": 3, "replies": [{"body": "Well my 2023 forecast is 7850, so yeah\n\nEdit: Lol, in case it wasn’t clear this comment was sarcastic. Pulling random crazy valuations outta your ass and posting them on Reddit ain’t investment advice.", "score": 1, "replies": [{"body": "I'll take yours over mine.", "score": 1, "replies": []}, {"body": "I love you if you are right.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I wonder where that 10K gain I had this morning went. Someone somewhere took it from me.", "score": 3, "replies": []}, {"body": "🐎💩", "score": 3, "replies": []}, {"body": "The volume on leaps has been incredible.\n\nFor months now I've watched the leaps I hold have like 10-20 trades in a day. Today there are 687.", "score": 3, "replies": [{"body": "That stonk up / leaps down pattern of this week probably plays a role in that.🤑", "score": 3, "replies": []}, {"body": "are you profit in your leaps or still red", "score": 1, "replies": [{"body": "All my leaps were bought the day of SP inclusion, so my average is down -3k per contract. It has been a lot worse than it is now, but it’s still rough to be underwater on them. Still expect to get paid well of course.", "score": 1, "replies": []}]}]}, {"body": "Becoming one with the manipulation and FUD 🧘‍♂️", "score": 3, "replies": []}, {"body": "Call writers keeping us down.", "score": 3, "replies": [{"body": "They hate us cause they anus", "score": 3, "replies": [{"body": "They heinous cause they anus", "score": 2, "replies": []}]}]}, {"body": "Go RKLB", "score": 3, "replies": [{"body": "Well played", "score": 2, "replies": []}]}, {"body": "Go Spotify", "score": 3, "replies": [{"body": "We're you the guy that bought then I did?", "score": 1, "replies": [{"body": "I think we both got it off the YTD bottom… iirc", "score": 1, "replies": [{"body": "I was around 210. I remembered someone commenting about it with me here. I'm debating taking profits on my calls (but kinda want to exercise and own 100 shares)  so unsure.", "score": 1, "replies": [{"body": "It was me! Idk about options too much.. I’ll be keeping it for 2 quarters at-least. Kinda like the long base it has had so far", "score": 1, "replies": [{"body": "Yea I bought 2 220 strike calls for Jan 2022. they obviously have an expiration coming up. I'm up 6k (200%) on them. \n\nDebating selling a 300 strike for 1k and if we drop I'll have some downside protection, and also if we hit 300 and it's called away I'll make money up to 310", "score": 1, "replies": [{"body": "Something like [this?](https://imgur.com/a/1rrzj6b)", "score": 1, "replies": [{"body": "Basically!", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Anyone has a link to the Tesla tons of co2 saved counter?", "score": 3, "replies": [{"body": "You mean the 2020 impact report?", "score": 2, "replies": [{"body": "No there is a live counter somewhere on Tesla’s avoided carbon emissions.", "score": 3, "replies": [{"body": "I don't know, sorry!", "score": 1, "replies": []}]}]}]}, {"body": "manupulation clear as day", "score": 3, "replies": []}, {"body": "https://www.theguardian.com/technology/2021/sep/01/collector-buys-fake-banksy-nft-for-244000", "score": 3, "replies": [{"body": "I honestly don’t get nft’s for physical objects. The nft offers no certainty regarding the meat space object. There could be 5 million nfts for one object and object does not need to be authorized/authentic. Maybe I’m just too old to understand…", "score": 4, "replies": [{"body": "You’re not. I’m as techie as they come and some of this NFT stuff screams outright scam.", "score": 5, "replies": []}]}]}, {"body": "Just realized today is Thursday and not Friday lol", "score": 3, "replies": []}, {"body": "I have christened my MX: Nostromo\n\n\nHope I do not have to destroy her to kill off a xenomorphic lifeform though", "score": 5, "replies": [{"body": "bring a cat with you at all times", "score": 2, "replies": [{"body": "👀", "score": 2, "replies": []}]}]}, {"body": "That's quite the premarket recovery.\n\nStill fake", "score": 3, "replies": []}, {"body": "Fsd is really gonna ruin the aspirations of zoning and mass transit reformers\n\nAll of these people talking about reforming zoning laws, I get that. They are right, it is ideal. But what underpins the housing supply issue is transportation. You render transportation super convenient and super cheap and in most places, it will drastically increase the accessible housing supply.\n\nI have a friend who is absolutely correct in stating that the ideal city is one where housing near the city core skews heavily away from single-family housing. And it relies primarily on mass transit. Dense, walkable neighborhoods. I completely agree. Zoning is definitely a hot topic right now. I have multiple friends who post about it.\n\nI don’t think any of them are ready for a cheap, insanely convenient, and easy solution that fits within the current transportation paradigm. It’s going to take the wind out of the sails from a lot of these arguments.", "score": 5, "replies": [{"body": "Bicycles and bicycle friendly infrastructure FTW. Go Netherlands!", "score": 4, "replies": [{"body": "American cyclists are all dicks though", "score": 2, "replies": [{"body": "Cycling in the Netherlands (at least regular commuter biking) looks a lot different from the dudes who are hunched over their bikes trying to break land speed records on public roads\nhttps://cdn.nos.nl/image/2019/12/07/612360/1024x576a.jpg", "score": 3, "replies": [{"body": "Oh I'm aware\n\n\nIt looks lovely there", "score": 2, "replies": []}]}]}]}, {"body": "I eagerly await the documentary \"who killed the parking lots?\"", "score": 2, "replies": [{"body": "Autopilot", "score": 2, "replies": [{"body": "Autopilot murdered my family's pay to park income", "score": 1, "replies": []}]}]}]}, {"body": "Fourth", "score": 2, "replies": []}, {"body": "Why is my m3 still on 2021.12.25.7, I’m weeks behind the update schedule it seems", "score": 2, "replies": [{"body": "I got an update last night haven’t seen car wash mode (pre update) but I would never use that", "score": 1, "replies": []}, {"body": "Here you go my friend:  https://cleantechnica.com/2019/11/12/tesla-tip-how-to-get-latest-software-update-immediately/", "score": 1, "replies": [{"body": "Think that that's myth, never worked for me in the last 2 years", "score": 1, "replies": [{"body": "Worked for me. 🤷‍♂️", "score": 1, "replies": []}]}]}]}, {"body": "Wow coinbase is basically dead money. Just chops between low 200s and high 200s. I keep debating getting some but can't buy it over Tesla or BTC.", "score": 2, "replies": [{"body": "I like Coinbase a lot as a company and have been using them since 2015 but can’t justify buying anything else besides Tesla right now. Coinbase is cool but they’re not on the verge of releasing FSD.", "score": 4, "replies": [{"body": "Ya plus have you looked at the coinbase subreddit. There are apparently terrible customer service", "score": 1, "replies": [{"body": "You usually only hear negative stories never positive ones relating to customer service. I’ve enjoyed their platform but have never needed to contact customer service. \n\nI’m sure they’re a good company to own long term but I feel that right now TSLA is king.", "score": 4, "replies": []}]}]}, {"body": "You can buy bitcoin with 0 fees from strike.", "score": 1, "replies": []}, {"body": "I'm a customer, not a shareholder", "score": 1, "replies": []}]}, {"body": "Day #3 of NQ underperformance?", "score": 2, "replies": [{"body": "Rotation into vAlUe sToCkS confirmed", "score": 1, "replies": []}]}, {"body": "Lithium making wealth today", "score": 2, "replies": []}, {"body": "Anyone know how much Tesla makes from their superchargers?", "score": 2, "replies": [{"body": "Bout tree fiddy", "score": 3, "replies": [{"body": "tree fiddy million a year?", "score": 3, "replies": []}]}]}, {"body": "Anyone know the results of MKBHD’s time-trial competition?", "score": 2, "replies": [{"body": "I believe the 3 was 30 minutes after the ice and mach e had charging issues and was about 4 hours post ice.", "score": 6, "replies": []}, {"body": "Main takeaway was that Ford has no reliable charging infrastructure.", "score": 2, "replies": [{"body": "https://i.imgur.com/UfGLMoI.jpg\n\nNot sure about that.", "score": 1, "replies": [{"body": "lol", "score": 1, "replies": []}]}]}]}, {"body": "160.00 till my leaps are itm. Nom nom nom", "score": 2, "replies": [{"body": "Congrats sir! You will be very 🤑", "score": 1, "replies": [{"body": "They are in a Canadian rrsp. How do I exercise these? Lol. Move in kind to non registered and use margin to exercise?", "score": 2, "replies": [{"body": "Sell some to exercise the rest makes most sense. I did this when I was not conditioning margin. It worked out well.", "score": 1, "replies": [{"body": "Makes sense. Could leave the money in rrsp then tax free. Depends on value per call nearing expiry. Obviously a large runup would be the best time to sell.", "score": 2, "replies": []}]}]}]}]}, {"body": "740 wall, gat dam it! lets go! harder!", "score": 2, "replies": []}, {"body": "Looking at some solar options, wish Tesler serviced my area.", "score": 2, "replies": [{"body": "I believe we are about 4 years from TeslaBot servicing your... area.", "score": 6, "replies": []}, {"body": "same. looking to build a house and Tesla is not an option for me at the moment.", "score": 2, "replies": []}, {"body": "+1 Tesla said my townhome wouldn’t be a viable option. I want dem power walls.", "score": 2, "replies": []}, {"body": "Tesla wouldn’t do my roof because of clay tiles even though my parents said they would change the roof for the Tesla panels. We ended up paying some other people for the job", "score": 2, "replies": []}]}, {"body": "Lol the call action really looks like they have no idea what direction to take it.", "score": 2, "replies": []}, {"body": "RIP macro", "score": 2, "replies": [{"body": "Bjorn's curse", "score": 2, "replies": []}]}, {"body": "So government getting paid to suck up all Tesla’s technology then give it to the competitors or what lol. What a crock of shit.", "score": 2, "replies": [{"body": "It's the people not the tech. Give gm teslas stuff and their people would be dumbfounded", "score": 2, "replies": [{"body": "It's the tip of the spear not entirely the people.", "score": 1, "replies": []}]}]}, {"body": "Seems like a nice bottom at 731.\n\nWould be a shame if. . .", "score": 2, "replies": []}, {"body": "Mehhhcro", "score": 2, "replies": []}, {"body": "This shit don't phase me", "score": 2, "replies": [{"body": "Faze. Or maybe you have ice in your veins they don't change to liquid phase despite the market.", "score": 3, "replies": [{"body": "Ice in my veins 🥶", "score": 1, "replies": []}]}]}, {"body": "Bankwupt!!", "score": 2, "replies": []}, {"body": "Can anyone share what’s behind this paywall?\n\nhttps://www.businessinsider.com/what-5-former-tesla-execs-learned-from-the-company-2021-8", "score": 2, "replies": [{"body": "Since its inception in 2003, Tesla has done everything from design to manufacturing to production in a manner unfamiliar to the legacy auto industry.   \nSome of it has worked, and some of it hasn't. The company finally turned its largest-ever profit earlier this year — even with a debilitating chip shortage and pandemic-induced production disruptions — largely by employing more creative business strategies. On the other hand, Tesla is often controversial, given CEO Elon Musk's public persona, and is plagued by problems stemming from its Autopilot feature — so much so that the US government has opened a federal investigation into incidents with the driver-assist system. Even Musk said recently that the latest version of his Full-Self Driving software is \"not great.\"  \nThe unpredictability of it all has led to many learning lessons for Tesla alums. Here's what five former Tesla engineers say they learned during their time at the company and from Musk, and how they're applying it to their new ventures.  \nGreg Reichow, partner at Eclipse Ventures  \nGreg Reichow spent six years at Tesla from 2011 to 2016, at one point serving as vice president of production. Reichow, now partner at early-stage venture capital firm Eclipse Ventures, said he learned from Tesla that unconventional ways of operating a business can be an effective strategy for success.   \n\"There are no absolutes when you think about what is the right way to go build a business,\" Reichow told Insider. \"It's much more around being grounded in what kind of differentiated product do I need to build and then, how do I optimize my company to go deliver that in a way that other people have not been able to?\"   \nAt Tesla, Reichow said the optimization for the company wouldn't come from efficient manufacturing.   \n\"What ultimately mattered for that product was building a car that was dramatically different than the other cars that were on the market,\" Reichow said. \"It had to integrate a lot of new technologies at speeds that the auto market had never done before.\"   \nGene Berdichevsky, founder and CEO of Sila Nanotechnologies  \nGene Berdichevsky, who was Employee No. 7 at Tesla, said the primary lesson he learned from the company — even before Musk became synonymous with it — was that doing something unique requires self-sufficiency and a willingness to start entirely anew.   \n\"Baked into Tesla's DNA from day one was this notion that you just can't rely on \\[anyone\\] outside of your own four walls to invent,\" he told Insider earlier this year. \"You have to do it from first principles, and you have to do it in-house, and you have to do it from scratch. That attitude led to a lot of innovation, because these technologies were so immature.\"  \nBerdichevsky is now the head of Sila Nanotechnologies, a company working to replace the graphite in EV batteries with a silicon-based anode material. The startup is challenging major players like Panasonic and LG Chem in the booming EV battery space.   \nRob Ferber, chief technology officer at Xos Trucks  \nRob Ferber, a founding member of Tesla, said the company prepared him in the way of customer relations.   \nFerber, who has also spent time at Virgin Hyperloop, is now CTO at electric truck startup Xos, a five-year-old Los Angeles based company electrifying the commercial vehicle space. It has already signed preliminary contracts with UPS and FedEx.   \n\"Listening to the customer, having direct, real-time interactions with the customer, is certainly not a new lesson, but it is one that people forget frequently,\" Ferber said.  \nFerber takes the same approach with his customers now. He says conversations driven by demonstrations of technology are most effective.   \n\"The way that you have that conversation most typically, most effectively, frequently, involves putting something into the customer's hands and letting them use it,\" he said.  \nAnil Paryani, CEO of Auto Motive Power   \nAnil Paryani spent five years working on the battery algorithms for the Model S and Roadster at Tesla. He later founded EV battery charging and energy management startup Auto Motive Power (AMP) and serves as its CEO.  \nParyani says Tesla taught him the importance of having an innovative mindset.  \n\"Tesla has vertical integration,\" he said. \"If they want to do something, they're not reliant on suppliers. When I was at Tesla, we worked with quite a few suppliers that just couldn't deliver high-quality product and on time and with innovation.\"  \nThat experience influences Paryani's approach. As head of a brand new industry supplier that's trying to attract the attention of major automakers who are often grounded in tradition, Paryani applies the lesson he learned that success lies in thinking differently.  \n\"A lot of the OEMs are looking at components rather than complete solutions,\" Paryani said. \"The mindset on the traditional side needs to change.\"  \nPeter Carlsson, CEO of Northvolt  \nPeter Carlsson, founder and CEO of top battery startup Northvolt, spent four years at Tesla, including time as the company's vice president of supply chain.  \nHe said working for Musk taught him it's good to challenge his preconceived notions. This lesson followed Carlsson when he left the company in 2015 to develop optimized battery cell chemistry.   \nCarlsson found, even with several years of industry experience under his belt — notably at chipmaker NXP Semiconductors, Ericsson and others — that there were always areas to learn and grow.  \n\"Elon taught me a number of things,\" Carlsson told Insider earlier this year. \"I thought I was a really seasoned operations and supply chain guy, and he just questioned these assumptions that \\[I\\] learned during \\[my\\] career. Are they as relevant today as they were five or 10 years ago?\"", "score": 11, "replies": []}, {"body": "Just use “reader view”. Problem solved.", "score": 3, "replies": [{"body": "Where’s that?", "score": 2, "replies": [{"body": "Most mobile browsers have the option. On iOS press the “aA” button on the top left in safari.", "score": 2, "replies": [{"body": "Thanks. Was on desktop before.\n\nCuts off after 2 paras.", "score": 2, "replies": [{"body": "Mine still only shows 2 paragraphs on safari", "score": 1, "replies": [{"body": "Hmm looks like you’re right. They’ve been cracking down on this.\n\nStill works on the Apollo browser. I have it set to default load the reader view.", "score": 2, "replies": []}]}]}]}, {"body": "🤷🏼", "score": 1, "replies": []}]}, {"body": "you're the best! thanks for the tip!", "score": 2, "replies": []}]}]}, {"body": "I hope Abbott screwing over Texas with covid and sharia law being passed there doesn’t hurt Giga Austin too much.\n\nThere aren’t many tech workers I know in SF that would move to such a place now, myself included.\n\nTexas economy is about to be fucked hard.", "score": 7, "replies": [{"body": "Texas made a Taliban move", "score": 12, "replies": [{"body": "yeah pretty much", "score": 1, "replies": []}]}, {"body": "I'm not a tech worker, but personally I refuse to even *travel through* Texas, forget moving there\n\nOf course, once they change their weed laws I might change this stance... but I definitely wouldn't live there\n\nA tip line for reporting people who might be having an abortion in violation of what a bunch of old white fucks feel should be allowed? Gtfo here with that outdated sexist authoritarian bullshit", "score": 6, "replies": [{"body": "In a lot of counties you can’t even buy beer on a Sunday in Texas. Someone should tell them that’s like 50% of the weekend that they banned alcohol sales.", "score": 4, "replies": [{"body": "Lolololol. You think just *sunday* without alcohol sales in **some** counties is bad?\n\nDid you know it's illegal to serve alcohol (like at a bar or restaurant) between the hours of 2am and 8am in the state of Massachusetts? (Not just some counties) Oh yeah, that's only Monday through Saturday.\n\nJust don't forget that it's also illegal to sell alcohol from a packie/grocery/convenience store between the hours of 11pm and 8am.... oh yeah that's also mon-saturday.\n\nSunday, you can't start serving or selling alcohol until 10am, not 8. Just keep in mind that this is very progressive for them; it was noon, not 10am, until about 7 years ago when the law was changed\n\n\nBut hey, alcohol is a poison and it's ingestion has no medicinal value. Restricting alcohol sales is nothing compared to *locking people up* with countless reports of major civil rights violations **over a fucking medicinal WEED**", "score": 2, "replies": []}]}]}, {"body": "It's not going to get fucked hard. Just because you want something to happen doesn't make it happen.", "score": 2, "replies": []}, {"body": "Lol you’re kidding right?", "score": 6, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "In the last *day*?", "score": 0, "replies": []}]}, {"body": "What a great way to get all the SJW’s to move out of Texas back to CA LOL.", "score": 2, "replies": []}, {"body": "What is this sharia law in Texas?", "score": 1, "replies": []}]}, {"body": "So, word on the street is Dave Lee used the Afghan families as drug mules?\n\nEdit: Haha, should have posted trigger warning.\n\nDave Lee is totally wholesome, the Anti-Bjorn.", "score": 4, "replies": [{"body": "Yes he said using drugs is the only way to see the essence of things", "score": 4, "replies": []}, {"body": "I love watching Dave Lee on Refugees", "score": 4, "replies": [{"body": "He is collaborating with Good Soil Investments.\n\nChecks all the boxes right there", "score": 1, "replies": []}]}, {"body": "Master of all trades.", "score": 2, "replies": []}, {"body": "Lol, maximum opportunist if true 🤪", "score": 2, "replies": []}, {"body": "Lol fake news here in TL?", "score": 3, "replies": []}, {"body": "Lol. Are you kidding me.", "score": 2, "replies": []}, {"body": "I laughed.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Nah… I’m perfectly happy with them when they’re happening in the 700s. Was much worse lingering around the low 600s.", "score": 9, "replies": []}]}, {"body": "F&G Gang represent", "score": 2, "replies": []}, {"body": "CHPT up 12% in premarket", "score": 2, "replies": [{"body": "Yes they had negative earnings. We don't lose money anymore so no one likes us", "score": 2, "replies": []}, {"body": "Doing less than a quarter billion in revenue per year, plan to roughly 10x that over the next 5 years assuming they can maintain prices. Gross margins are about 25% now so the price per **gross** profit is 12x right now if the price doesn't move. Tesla is at roughly 6x 2026 gross profit without even including all the AI applications like the bot and robotaxis. \n\nOh and Tesla also has a charging business. It seems like people are really making an effort to buy everything that is not TSLA despite paying a hefty multiple.", "score": 2, "replies": [{"body": "People will always seek something novel. Probably traders piling in as well.", "score": 2, "replies": []}]}, {"body": "I would be very worried for CHPT as a company when superchargers get opened to all OEMs", "score": 1, "replies": []}]}, {"body": "Any updates on 3.5T bill coming in ?", "score": 2, "replies": [{"body": "Probably not they’re all on vacation until Tuesday", "score": 3, "replies": []}]}, {"body": "If the button is by request and I don't get it I will be pissed. You can't sell me an acceleration upgrade and not expect me to floor it at every light.", "score": 2, "replies": [{"body": "Not sure it’s technically “the button” if it’s by request.", "score": 4, "replies": [{"body": "*\"public opt in request button\"* per elon", "score": 3, "replies": []}]}, {"body": "I think the button will be virtually unfiltered", "score": 3, "replies": [{"body": "I hope so", "score": 3, "replies": []}]}, {"body": ">You can't sell me an acceleration upgrade and not expect me to floor it at every light.\n\nThat's exactly what they expect haha", "score": 2, "replies": []}, {"body": "They may also be using the \"opt in\" to target problematic regions. They want safe drivers yes, but they also need data in tough to drive places. They may not want someone who just does highway driving, they may want inner city driving in certain cities more as those have more edge cases.", "score": 2, "replies": [{"body": "I think they probably do this filtering internally. Just let the guy be happy with his highway driving and just ignore his data.", "score": 5, "replies": []}]}]}, {"body": "I wonder how companies like AutoZone will survive in 5 or 10 years. Seems like more than 50% of their inventory is ICE vehicle specific. I hope they're working on the transition to EV.", "score": 2, "replies": [{"body": "And the oil change shops RIP", "score": 3, "replies": []}, {"body": "Considering that moving parts will be reduced I say autozone, oreilys, advance are all done. Just look at much they make off oil and batteries...gone.", "score": 3, "replies": []}, {"body": "they're gonna be auto-pwned", "score": 3, "replies": []}, {"body": "People will always need blinker fluid", "score": 2, "replies": []}, {"body": "ICE cars are not all going to magically disappear.", "score": 1, "replies": []}]}, {"body": "Just think about all the preorders getting placed today for cybertruck. Definitely looking like 2025 for them.", "score": 2, "replies": []}, {"body": "/u/anono-mon looks like we mistimed the alibaba bottom haha", "score": 1, "replies": [{"body": "Never know. Is ok to miss it. Still could crash again", "score": 1, "replies": [{"body": "After that sell off a bounce, started tiny tiny amount in at 162 to 157, have a few limit buys increments down that did not hit. Should be interesting few months. May drop again.", "score": 1, "replies": []}, {"body": "Definitely could. Looks like Xi is setting up Beijing stock market, which means maybe some favor is coming to Chinese stocks.", "score": 1, "replies": []}]}]}, {"body": "https://youtu.be/WWcwp2kxp6I\n\nGreat video review of OEM's and tax credit not helping them....because they already have it and sales are garbage.  TSLA will benefit to the moon!!!", "score": 1, "replies": [{"body": "Probably why it won't happen\n\nWhat's GM going to do, make a million Bolts?", "score": 2, "replies": []}]}, {"body": "Gali’s hair transplant coming along nicely.", "score": 1, "replies": [{"body": "Did he get one? Lol", "score": 1, "replies": [{"body": "Besos is next", "score": 3, "replies": [{"body": "Ball sack hair transplant", "score": 4, "replies": []}]}, {"body": "My “research” says yes.", "score": 3, "replies": []}]}]}, {"body": "Good day to pickup leaps or shares?", "score": 1, "replies": [{"body": "yes", "score": 6, "replies": []}, {"body": "\"Let me check if it is a good day to buy Tesla leaps and shares\"\n\n*checks pulse on neck*\n\n\"Yes! It is indeed!\"", "score": 4, "replies": []}]}, {"body": "That morning dump is truly inevitable", "score": 1, "replies": []}, {"body": "Stop the count!", "score": 1, "replies": []}, {"body": "[https://www.youtube.com/watch?v=lP4gCHpP7NE](https://www.youtube.com/watch?v=lP4gCHpP7NE)\n\nfuck yeah been waiting for this", "score": 0, "replies": []}, {"body": "The situation with 7-11, it's worse than I thought: [CIA Interrogation](https://youtu.be/BhGo3IbTNP0)", "score": 0, "replies": []}, {"body": "Premarket real and heterosexual", "score": -6, "replies": []}, {"body": "Will giga Texas have trouble hiring people since the taliban took over women’s bodies there? All the liberals will be moving back to CA in droves!!", "score": -11, "replies": [{"body": "Wha?", "score": 5, "replies": []}]}, {"body": "Looked away for a few minutes and came back to this. What da f*ck just happened?", "score": -1, "replies": [{"body": "Macro", "score": 1, "replies": []}]}, {"body": "I'm bored. There's things I could do. Like sleep. Or a project. But I'm choosing boredom.", "score": 1, "replies": []}, {"body": "Fruit lowering its 30% app charges for media apps…", "score": 1, "replies": []}, {"body": "Too much extrapolation by Gary from Elon’s tweet. \n\n$TSLA FSD Beta 10 will be released midnight next Friday night, and a public “opt in request button” for any FSD owner (260K in US) will be available 2 weeks later (end of 3Q). Full FSD roll out should happen by year-end, permitting significant step up in FSD def rev recognition.", "score": 1, "replies": [{"body": "You don't think they will do the mass rollout by year end?", "score": 2, "replies": [{"body": "One step a time, let them release the opt-in button first. Gary is already talking about regulatory approval and stuff.", "score": 2, "replies": []}]}, {"body": "Goddamnit Gary", "score": 1, "replies": []}]}, {"body": "Unemployment data better than expected so the Macro is good today.", "score": 1, "replies": [{"body": "Bearish. Pandemics and high unemployment are bullish", "score": 3, "replies": []}, {"body": "If it’s too good then taper starts earlier. But good to see", "score": 2, "replies": []}]}, {"body": "Crazy premarket across the board today. NKLA up 7%!!", "score": 1, "replies": [{"body": "Fool cell deal", "score": 2, "replies": []}]}, {"body": "Plan for a bit of red tomorrow. Typically traders don’t like holding over long weekend.\n\nAlso big open call volume at 750 so don’t expect that wall broken till next week if we’re lucky", "score": 1, "replies": []}, {"body": "🍼🚀🍼🚀🍼🚀", "score": 1, "replies": []}, {"body": "https://imgur.com/a/C7HIvqF\n\nHoboken flooded. Crazy", "score": 1, "replies": [{"body": "Yeah NY will be wiped off the face of the Earth eventually.", "score": 3, "replies": [{"body": "At least I know where high ground is for future real estate investments.", "score": 1, "replies": [{"body": "Nowhere around there will be a very good idea.\n\nAlso keep in mind, in 50 years the ocean will be dangerous to human skin. Beaches will lose their appeal. Should read New York 2140 by KSR.\n\nWas central park high ground?", "score": 1, "replies": []}]}]}, {"body": "[This guy lemonades] (https://www.instagram.com/reel/CTTMwKChLTn/?utm_medium=copy_link)", "score": 2, "replies": [{"body": "😂", "score": 1, "replies": []}]}, {"body": "I have an online friend whose been a professor at Fordham since the 70s. He said classes are canceled Manhattan is expecting like 10-15 inches of rain", "score": 1, "replies": [{"body": "I made it to work. Just had to go around the floods.", "score": 1, "replies": []}]}]}, {"body": "Super low volume to start the day", "score": 1, "replies": [{"body": "(Cue trumpet) Wah wah waaaaaaaaaaaaahhhhhh", "score": 1, "replies": []}]}, {"body": "Slight IV bump. Need moarrrr\n\nEdit: agedlikemilk. Womp", "score": 1, "replies": []}, {"body": "Would be amazing on Cybertruck for Mars or off-roading.\n\nhttps://www.reddit.com/r/interestingasfuck/comments/pg9u68/nasa_glenn_research_center_reinvented_the_wheel/", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Tesla can make it work", "score": 1, "replies": []}]}, {"body": "that is really cool", "score": 2, "replies": []}, {"body": "Yet for some reason they chose not to use them on Perseverance. I’m still not fully certain why, but I believe they just didn’t want to use untested technology.", "score": 2, "replies": [{"body": "I don’t think the tech is ready yet, it’s just really cool.", "score": 2, "replies": []}]}]}, {"body": "huge volume spike at 10am go Tesla!", "score": 1, "replies": []}, {"body": "Usual afternoon fade", "score": 1, "replies": []}, {"body": "Thinking about buying an 8 week gamble call options on Oct 1. Playing deliveries, earnings, maybe a stock split and I’m wondering if there are any major car shows etc that Model AF prototype could be announced (remember hearing some rumblings a few months back about something in China)\n\nObviously will see how next few weeks go so opportunity could pass but thinking about it.\n\nWhat do others think here on this gamble? Would you to ITM or OTM and if so, how much?", "score": 1, "replies": [{"body": "Do the 11/19 so you can include the earnings report runup imo or wait for the options that include that to open up. If they shock with deliveries i'd expect high expectations for earnings coming off Q2.", "score": 3, "replies": [{"body": "If we smash earnings and it sells off the day after like Q2 it will take extreme restraint on my part not to back the truck up and LOAD up on options for the following week expiry.", "score": 1, "replies": []}]}, {"body": "i don’t think the strike matters if it’s in october it’s pure gamble imo", "score": 2, "replies": []}, {"body": "They probably won’t announce deliveries oct 1. Lately they’ve been announcing the day after so likely oct 2.\n\nAnnual meeting is 10/7 so that could potentially some announcements.\n\nThen who knows about earnings cause they’ve been changing it up lately.", "score": 2, "replies": [{"body": "Picking Oct 1 - as it’s a Friday and deliveries could come in over the weekend.\n\nForgot about shareholder meeting. Not expecting a lot but does include a year in review typically. Not sure if board meeting is attached so could be some additional discussion but that hasn’t stoped Elon before", "score": 1, "replies": [{"body": "Yeah but if you pick a 10/1 exp then you wouldn’t get any benefit from deliveries if it gets announced 10/2. You’d have to pick the 10/8 or later exp. personally when playing around deliveries/earnings I would buy the next monthly so 11/19. That way would benefit from price move but not get killed by theta or iv crush immediately", "score": 2, "replies": [{"body": "I think he's saying he will buy stuff on Oct 1, not buy now with Oct expiration", "score": 2, "replies": [{"body": "That makes more sense now", "score": 1, "replies": []}, {"body": "Ding ding ding ding :-)\n\nYes. That’s what I’m thinking. Assuming we don’t blow up before then and have more downside risk. \n\nTake a gamble on a window of potential opportunity. Happy to miss and take it with core investment but thought why not.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "What up tsla", "score": 1, "replies": []}, {"body": "Feels like yesterday or the day before", "score": 1, "replies": []}, {"body": "What happened to macro suddenly?", "score": 1, "replies": []}, {"body": "Nasdaq taking a big dump....its stinky.", "score": 1, "replies": []}, {"body": "[Once you got your chairs, sit on it for a while] (https://youtu.be/LJtNHs4BfYg)", "score": 1, "replies": []}, {"body": "I get migraines when tsla is red", "score": 1, "replies": [{"body": "Buyraines", "score": 1, "replies": []}]}, {"body": "George C. Marshall has an interesting Vita.", "score": 1, "replies": []}, {"body": "I guess 740 is a sell wall then?", "score": 1, "replies": []}, {"body": "Y u do dis", "score": 1, "replies": []}]}
