{"title": "Elon tweets: Tesla Semi Truck ready to unveil in september", "selftext": "https://mobile.twitter.com/elonmusk/status/852580027178696704\n\n\nCan't stop. Won't stop.\n\n^^Edit: ^^accurate ^^flair ^^is ^^accurate", "id": "6574yl", "created_utc": 1492106366.0, "score": 192, "upvote_ratio": 0.94, "num_comments": 95, "comments": [{"body": "[deleted]", "score": 156, "replies": [{"body": "Mother fucker. Nearly made me fall off the bike laughing with that comment (stationary gym bike btw).\n\nI'll drink my own piss if that happens.", "score": 15, "replies": [{"body": "you won't have a  choice. they will make all of us drink our own piss in the name of conservation ", "score": 5, "replies": [{"body": "Heck.", "score": 3, "replies": []}]}]}, {"body": "What makes you think that ISIS can override the illegal hacking that NSA already has on those trucks", "score": 7, "replies": [{"body": "We need iRobot code ", "score": 2, "replies": [{"body": "We need Will Smith ", "score": 3, "replies": [{"body": "We got Jayden Smith instead.", "score": 3, "replies": []}]}]}]}, {"body": "Sweden won't be happy with this news", "score": 14, "replies": [{"body": "Given its welfare programs, it will probably be happier than nearly any other country with news about automation...", "score": 7, "replies": []}, {"body": "Given its welfare programs, it will probably be happier than nearly any other country with news about automation...", "score": -1, "replies": []}]}, {"body": "Automation will make those Attacks impossible", "score": -6, "replies": [{"body": "*inescapable\n", "score": 15, "replies": [{"body": "You clearly have no idea how autonomous vehicles work", "score": -7, "replies": [{"body": "You clearly lack imagination. Computers do what we design them to do. There is nothing impossible about malevolence. \n\nRealistic? No (well, hopefully). But the man made a joke. You clearly have no idea how jokes work. ", "score": 17, "replies": [{"body": "Joke?  I see no humor.", "score": -18, "replies": []}]}]}]}, {"body": "If it is possible to connect to the software of the vehicle, then it is possible to hack the software and take control, strong encryption, which I hope is what is used, makes it nearly impossible, but not totally so.", "score": 4, "replies": [{"body": "Yes.  But they are using trucks because they are easy to steal and run people over.  When they become automated this will no longer be the case.  Hacking the system will not be an option for the run of the mill terrorists.", "score": 1, "replies": []}]}]}]}, {"body": "So who wants to start a business building trailers lined on the outside with solar panels? ", "score": 32, "replies": [{"body": "Edit: original estimate is all wrong, fuck you google.\n\n****\n\nRough estimate, panels on the roof extends the range by ~~80~~ 20 miles.\n\nFull size trailer has about 40 m^2 roof area, giving you ~~40kw~~ 8kw output in ideal conditions.\n\nA normal truck might have a range of 1000 miles on 200 gallons of fuel, assume the Tesla is similar, so it will have about 4 megawatt hour battery pack.\n\nAt 50 mph it takes 20 hours to use up the 4Mwh, which is 200kw average power, or 4 kWh per mile.\n\nAdding 8 hours of sunshine at ~~40kw~~ \n8kw extends the range by ~~320kwh or 80 miles or 1.6 hours.~~ 64kwh or 20 miles.", "score": 19, "replies": [{"body": "It's been years since I worked in shipping and logistics but when we put those aerodynamic flaps on the back of our trucks, the change in fuel economy was a tiny fraction per trip. However when multiplied across our entire fleet saved tens of thousands. Eighty miles is substantial. Not to mention the benefits of using these on refrigerated trailers. It may actually be plausible ", "score": 22, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "My only solution to that was suggesting a trigger that would enable the flaps over a certain speed. I don't know if the company ever implemented the idea, I told them to go screw", "score": 6, "replies": []}, {"body": "> The issue with those flaps on the back of trucks are drivers who ~~forget to open them~~ don't want to look like faggots\n\n", "score": 2, "replies": []}]}, {"body": "what flaps", "score": 1, "replies": [{"body": "http://www.stemco.com/qbin/1831.jpg", "score": 2, "replies": [{"body": "Why do they need to be deployed? Isn't it possible to just stock them on and leave em there?", "score": 1, "replies": [{"body": "If you open your cargo doors without closing them that's extra swing room the flaps would move in. They're going to be jutting out.", "score": 2, "replies": [{"body": "So automatically open them at <60mph, actually I don't see why they would cause any problems at any moving speed. Then again I'm no expert. ", "score": 2, "replies": [{"body": "I'm pretty sure they're like manually undone. And even in that case you'd still have to close them in order to open the doors.", "score": 2, "replies": [{"body": "Oh ok when I heard deploy I thought automatic. I figure now that is they were automatic they would be more of a liability than an asset. ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "20 miles. Sorry.", "score": 1, "replies": [{"body": "No problem, 20 miles is still a substantial gain. With the falling cost of panels it still may be beneficial to companies with larger fleets, especially those operating in the mid-west. ", "score": 1, "replies": []}]}]}, {"body": "That is an insanely optimistic analysis. \n\n40kW? With solar panel efficiency, more like 8kW in optimal sun conditions. Not to mention converter losses. So, say 7kW. Thinking its 7kw consistently in the light is optimistic as well.\n", "score": 5, "replies": [{"body": "How much power does a good solar panel generate in full sun?", "score": 2, "replies": [{"body": "Around 20%.", "score": 3, "replies": [{"body": "Oh god damnit you're right, fucking google.", "score": 3, "replies": []}]}]}, {"body": "Not to mention weight, and aerodynamic changes. Solar panels on vehicles isnt a new concept, it's just one that has never been sensible.", "score": 2, "replies": []}]}]}, {"body": "The panels would need to be recessed on top so they're not crushed when stacked on top of each other.", "score": 1, "replies": [{"body": "Shipping containers are different from over the road trailers and would require a different design. Over the road trailers don't have detachable wheels/bases. The 'e-vans' and 'straight frame' trailers that I worked with were not stackable, they are practically a thin walled shell.\n\nhttp://atandsonline.com/new/wp-content/uploads/2011/04/trailers-vs-containers.jpg\n\nThe trailer on the left is where my idea would work best. The wheels are not detachable as it is intended to be pulled behind a semi only. The one on the right is the stronger, although smaller and heavier shipping container.", "score": 3, "replies": []}]}, {"body": "Also you're a dumbass, Tesla will put Tesla solar panels on Tesla trailers to go with the Tesla truck.", "score": -3, "replies": [{"body": "You do know in the hauling biz, the tractor and the trailer are owned by different people.", "score": 2, "replies": [{"body": "Tesla trailer leasing has a great deal for you.", "score": -3, "replies": [{"body": "Are Tesla bulls this stupid?\n\nThe shipping containers are cheap and practically disposable.  That part is already packed and gets placed on the trailer to be hauled to destination where it's unloaded\n\n\n\n", "score": 4, "replies": [{"body": "What percentage of truck freight mileage involves intermodal containers?", "score": 2, "replies": []}]}]}]}, {"body": "Or they would buy out the company and put the idea to use themselves. After all, that is why they acquired Solar-city. While it's possible they're already working on this idea it isn't matter of fact ", "score": 0, "replies": []}]}]}, {"body": "I like how he announced this in the middle of the day when the market started going down. \n\nElon Musk stock market manipulation confirmed. ", "score": 25, "replies": [{"body": "Elon confirmed day trader.  Damn, that's actually some shit.\n\nI wonder if he actually comes up with \"press releases\" scheduled for every few weeks or every time there is negative press to bump the stock back up.\n\nI feel like Tesla is essentially a biotech pump and dump on the grandest scale.  They even do equity offerings and nobody gives a shit.", "score": 10, "replies": [{"body": "Tesla's moat is all about the liability side of the balance sheet. When you have access to unlimited cheap financing you can get away with a lot of shit.", "score": 3, "replies": []}]}]}, {"body": "Sold my Tesla this morning god I'm on a role.", "score": 22, "replies": [{"body": "what kind of role?", "score": 12, "replies": [{"body": "Selling right before it pops. Held Back for like a month and sold the day before it popped.  Oh is see, a spelling joke.", "score": 14, "replies": []}]}, {"body": "was in at 180, sold 2 days ago at 308 weeeeee", "score": 2, "replies": []}]}, {"body": "Pure confidence man misdirection.\n\nDon't you think the if the Model 3 was going well we'd be hearing about that?\n\nDecades before we have the infrastructure to serve electric semis.\n\nFervent demand is here, now, for the model 3 that Musk has described. No infrastructure needed for all those middle class daily commuters. The Model 3 is basically the end game, EVs for the masses. \n\nWho wants to bet the Bolt already ate their lunch by coming in at $35k, and you'll never buy a model 3 for less than $42k?", "score": 14, "replies": [{"body": "Agree: it is plausible that Elon wants to soften the blow on the inevitable model 3 delay.\n\n\nDisagree: you are seriously underestimating Tesla. They would have to be retarded to build a electric truck without infrastructure.\n\nMy prediction: this unveiling will be as much about the new truck charger network as it is about the truck itself. They are probably installing megawatt charging stations at major shipping hubs as we speak. (Amazon warehouses??)\n\n>Tesla announces partnership with Amazon to convert their entire distribution network to electric self driving trucks by the end of 2019. TSLA soars to $500, AMZN $1600", "score": 5, "replies": [{"body": "> TSLA soars to $500, AMZN $1600\n\nThis is why the rest of the world is just in awe of the US Stock Market. Crazy levels of innovation / showmanship / business acumen / hype. And then, follow up, Amazon really does deliver. Telsa cars are actually amazing. ", "score": 2, "replies": []}]}, {"body": "Tesla 3:  The iphone of electric cars. Where you can have the \"same\" car as management with your floor mopping job. Therefore, it might still sell, even at a premium. Question is, how many people want to buy a car that cant be used off grid and with a life expectancy of 15 years tops?", "score": 6, "replies": [{"body": "I'd be in the market if it comes in at a genuine $35k, but I'm not going to be their beta tester.", "score": 2, "replies": []}]}, {"body": "Not at all saying the model 3 wont be late, because it most likely will be, but within the past few weeks there have been more and more test Model 3's driving around getting spotted. That says nothing about if they are ready to go into more final production, but its more than the nothing we had ~1-2 months ago.", "score": 1, "replies": []}, {"body": "I have read studies that electric would be a great alternative for trash trucks do to the stop and go. So they wouldn't need the same infrastructure that an OTR truck would. You just need chargers at the terminal.", "score": 1, "replies": []}]}, {"body": "https://mobile.twitter.com/adampickering_/status/852580156015333377\n\nwish it was me. ", "score": 2, "replies": []}, {"body": "Rumours that TSLA is going for planes in 2020", "score": 2, "replies": [{"body": "Electric planes are an interesting trick. Wonder if they would be more like high flying drones - not for people or passengers - like the NASA Helios prototype: https://www.nasa.gov/centers/dryden/news/ResearchUpdate/Helios/\n\nA giant soaring wing, all-electric, ideally would never land (eventually would, as parts wear out or it becomes obsolete). Could work like a low-altitude satellite.", "score": 2, "replies": []}]}, {"body": "So what's up, I keep hearing all this about TSLA being garbage, they keep going up. What's with the hate?", "score": 2, "replies": [{"body": "1. It's extremely overvalued financially and from a technical standpoint. \n\n2. Most quarters they don't turn a profit. \n\n3. It's at all time highs, and if you look at their 5 year history it's very cyclical, goes up to 280-290, drops down to 180.\n\nIt's a very hype-based stock. They missed their quarterly quota by about 33%, but it was still the most cars they had sold/made before so it went up anyway.", "score": 3, "replies": [{"body": "Sorry, my point was you should LOVE this company, because every few months you get the chance to buy cheap, and buy even more later when it takes a hit again. Trend won't change until something major comes up that shake up the industry even more than it has,  but when it does you won't get the chance to buy up shares for discounts anymore.", "score": 2, "replies": []}, {"body": "Hype-based though they may be, it's hype that runs the big jumps in the markets (at least from what I have seen, people tend to react before they think in this arena as much as.... sigh everything. Humans, why you so dumb!?). \n\nThat cycle you are talking about looks a lot more like an upward trend with a lot of volatility, which kind of makes sense if they are over-hyped, and I agree that they are. But I don't see any sudden drops that didn't recover quickly and keep going pushing up. He's not going down any time soon. His electric big-rig could CRUSH the natural gas ones, and they were supposed to be the future. Instead of fueling for 45 minutes with a gigantic hose, they could pop-and-swap batteries in minutes, while they monitor the route and actions of their self-driving hyper-safe truck. Eventually, truckers won't even be necessary. Within 10 years the entire industry could be radically changed (sorry blue-collar guys, but we don't lament the death of the switch-board operator or the assembly line worker anymore. You gotta adapt too).\n\nAs for most quarters not turning a profit, just knowing what I know about Tesla, it makes me think that Elon puts a TON of money back into R&D and expansion, which, yeah. Not great for profits right now, but really great for profits down the line. It makes more sense than pulling every cent you can out to appease shareholders, just to leave them holding the bag when the business collapses from lack of investment in expansion. And expansion is what they need. They are gunning for manufacturers that have steered the production of cars for over a century.\n\nBut this is a company that is supposed to be about the profits right?\n\nI get it now. But I still think that Elon is on to something that makes all the other car companies sweat. He has beat them to the punch in a market that is sexy and cool and sells them the future they grew up dreaming about in the 80s and 90s and it does it NOW. They can't compete, and it's because his infrastructure is outpacing theirs at rates they can't hope to match. Pretty soon he'll be selling all-electric cars that cost the same as a Scion, and then they will be fucked. \n\nHate for now, but smart bet is on Musk, IMHO. ", "score": 1, "replies": []}]}, {"body": "Haters gonna hate", "score": 7, "replies": [{"body": "Fair enough lol", "score": 1, "replies": []}]}]}, {"body": "Had to cover my shorts at $302.50. Sad moments are sad.", "score": 4, "replies": [{"body": "Stormy weather there in Shortville, eh?", "score": 13, "replies": [{"body": "Shorted at $308, covered at $302.5. Keep the hype going, bring it to $350. The higher, the easier ;)", "score": 3, "replies": []}]}, {"body": "Buy Ford", "score": 7, "replies": [{"body": "Dont have a driving license. \n\n$GM is better tho. \n\nWill never take an advice from Musk anyways.", "score": -5, "replies": [{"body": ">Dont have a driving license\n\nWas I supposed to have a pilot's license when I bought $BA? ", "score": 19, "replies": [{"body": "No. If you had one you would've purchased $ERJ.", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Hype early, deliver late?", "score": 2, "replies": []}]}, {"body": "I'm starting to think we're living in the prequels to Transformers.", "score": 1, "replies": []}, {"body": "GG US economy. No Re", "score": 1, "replies": []}, {"body": "I love his during market time tweets. ", "score": 1, "replies": []}, {"body": "we're unveiling unveilings now?", "score": 1, "replies": []}, {"body": "what amazing is that the tweet was at 1:51 and it was still under $300 at 1:53....unreal opp to buy calls right there...gotta follow him on twitter lol", "score": 1, "replies": []}, {"body": "Just bought three shares because fuck you that's why", "score": 1, "replies": [{"body": "Err fuck made an offer on 3 shares, my bad I'm new", "score": 2, "replies": [{"body": "Stop embarrassing yourself, Frank.", "score": 2, "replies": []}]}]}, {"body": "Some nice benefit will be the torque for climbing, the regenerative braking, idle engines not taking a lot of power ... ", "score": 1, "replies": []}, {"body": "Puts at $280 - it will find resistance there but can't stay where it is now unless we consider tweets now part of fundamental analysis :)", "score": 1, "replies": [{"body": "I absolutely do consider comments from the CEO to be part of fundamental analysis ", "score": 2, "replies": []}]}, {"body": "How is this the most valuable car-maker in the US?", "score": 0, "replies": [{"body": "It has the highest market cap that's it. ", "score": 1, "replies": []}, {"body": "Government loans", "score": -2, "replies": []}]}, {"body": "[deleted]", "score": -1, "replies": [{"body": ">God I wish I had money\n\nFTFY", "score": 3, "replies": []}]}]}
