{"title": "Buy MSFT or wait until after earnings??", "selftext": "I like the way Microsoft has trended but I'm worried about buying now with earnings coming out on the 27th. Currently, I dont have any, but had some money, and thought it might be a safe buy. Thoughts?", "id": "mvu9dj", "created_utc": 1619054564.0, "score": 25, "upvote_ratio": 0.83, "num_comments": 66, "comments": [{"body": "You know I was thinking the same thing when Microsoft was at 200 about 8 months ago, I pulled the trigger and don’t regret it. I’m sure you won’t either.", "score": 30, "replies": [{"body": "Same here. I tried to buy at $213 , then waited for earnings, and now I bought at $258. This happens a lot  . So if you really believe in the company buy it at whatever and hold it as long as you can .", "score": 7, "replies": []}]}, {"body": "MSFT is a longterm hold. Longterm holds, by definition, are not subject to trying to time entry points. \n\nDecide how much of your capital should go toward MSFT. Every time you add capital to your portfolio, immediately put your predetermined percentage toward MSFT. \n\nThat’s the only thought you should ever apply toward MSFT. Ever.", "score": 56, "replies": [{"body": "This is my dilemma. Every month if nothing else is discounted, just buy MSFT regardless if its at ATH?", "score": 9, "replies": [{"body": "Good stocks tend to be ATH most of the time. If they aren't, how does the market go up over long periods of time?\n\nIf you are fine with the market cap given the balance sheets, then you shouldn't try to time the purchasing. MSFT implied market cap is currently $1.97 Trillion. If you don't agree with it after looking at the balance sheet, then don't buy. If you think MSFT will be a much larger company in the future, then buy if you believe MSFT will return more than the general market.", "score": 21, "replies": [{"body": "Thanks very much! I appreciate the thorough explanation", "score": 1, "replies": []}, {"body": "> Good stocks tend to be ATH most of the time. If they aren't, how does the market go up over long periods of time?\n\nA Peter Lynch video was posted just yesterday saying on average a stock oscillates 50% in a year up and down.\n\nRest of your advice is legit i suppose, if people understand the implications of valuation.", "score": 1, "replies": [{"body": "Even during covid the average fortune 500 company didn't oscillate 50% up and down. That would imply a 100% total net deviation from the mean over an annual period. Blue chip stocks didn't even fluctuate at half that level.", "score": 2, "replies": [{"body": "You're free to argue with Peter about that, I'm just paraphrasing his words - and you're adding your own spin with the implication.\n\nhttps://novelinvestor.com/stocks-can-fluctuate-widely-year/\n\n> I think most surprising was the average range was about 56% (median at 46%)\n\nHere's one person's findings with data from google finance. Regardless how you interpreted my paraphrase, i'll bet you didn't anticipate such variation huh.", "score": 1, "replies": [{"body": "You're still not making a valid point though.\n\nShowing a 52 week period inclusive of a black swan event like global lockdowns arising from a pandemic cannot be extrapolated to infer a general rule of thumb. Surely you comprehend that. \n\nAnd MSFT is not even in the categorization that experienced that anomalous degree of volatility anyway (by your own table). \n\nIt is much less surprising that, given the extremity of the macroeconomic backdrop, smaller companies would be de-risked and then reloaded in portfolios, as their bankruptcy risk and extended viability amidst what was initially a totally opaque pandemic response were much lower than massive multinationals like MSFT", "score": 1, "replies": [{"body": "Doesn't matter if it's a black swan event, investor panic or some bad news outlook for companies which doesn't come true.  If you look in the past, every year has some scare in one direction or another.", "score": 1, "replies": [{"body": "\"Some scare\", sure. \n\nYou're arguing for 50% standard deviations. You're just wrong. Even in the one year you are using it to claim it was true in.", "score": 1, "replies": [{"body": ">\"You're arguing\"\n\n>my first reply was literally \"there was a link recently on lynch affirming this\"\n\nGo argue with Lynch and fuck off, troll.", "score": 1, "replies": [{"body": "Better luck next time", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "This also was my dilemma in february, I was worried to buy close to ATH at 240. But today I am glad that I jumped in as we are at 260 so far. And I am ecpecting them to beat earnings forecast.", "score": 1, "replies": []}]}]}, {"body": "If you're that worried buy half now and half after.", "score": 30, "replies": [{"body": "Best advice...", "score": 6, "replies": []}]}, {"body": "If your intentions are to hold long term, why worry about minute things like this?", "score": 43, "replies": [{"body": "Agree. There isn't a bad time to buy MSFT", "score": 26, "replies": []}, {"body": "I came here to say this exact same comment. This is a buy and hold. Don’t worry about a little fluctuation in the short term.", "score": 8, "replies": []}, {"body": "That’s a good point. Was gonna get it then not touch it for the duration of grad school. Might be the move", "score": 1, "replies": []}, {"body": "exactly, wait for a pullback at most.", "score": 1, "replies": []}]}, {"body": "MSFT - my best short term performing long term stock.", "score": 6, "replies": []}, {"body": "MSFT isn’t going anywhere but up in the long-term. Buy and HODL.", "score": 6, "replies": []}, {"body": "My intuition says wait till earnings. MSFT has ran up in past couple of months so there will probably be sellers come earnings.", "score": 10, "replies": []}, {"body": "To add what many have said, MSFT is probably one of the better priced tech stocks. That said, the tech sector is in a bubble and if they fall, they will all fall. Keep that in mind.\n\nOn a fundamental level, MSFT has some headwind. The shift to cloud applications is actually not good for MSFT which thrives on enterprise computing and windows software. A cloud based setup is a lot like the old mainframe and dummy terminal approach of old days and in this case, the mainframe is worldwide access. This inherently means that you can do without Windows Servers in a lot of use cases. What used to be a staple (domain controller + active directory etc) is no longer required and as applications move to the internet.\n\nInternet servers and services (cloud) are easier and cheaper to manage. This is the main threat to MSFT. I know plenty of companies that simply use Google applications instead of rolling out Office. I know some companies who no longer bother providing a PC for everyone. That was unheard of not that long ago. Though I dont think thats a major threat due to office's legacy dominance, it is an example of how a cloud based app can replace MSFT software. There used to be a time when Outlook was a staple, now I am not even sure who uses it any more.\n\nYes MSFT itself is a cloud player, but Google and Amazon ate a ton of market share and other companies are trying to muscle in especially overseas where they have sentiment from their governments.\n\nAll in all, I like MSFT. I think they will be fine and I am sure they will keep buying stuff to stay relevant. But its not all roses and they made bad decisions in the past and are almost always a little behind the pack on innovations (though not as bad as IBM or Oracle). Beware of sector valuations.", "score": 11, "replies": [{"body": "I think this is rather wise, but let me pushback. There was always free Libre, and professionals can't even handle that Office clone.\n\nI could never recommend to anyone with a workforce larger than 50, maybe less, to bother training a professional environment on something other than Onedrive if they're used to Office. Training staff is extremely difficult, don't waste your effort on that with the Office suite.\n\nNow people tend to know Drive more, that is a very worthy competitor, except there's not a desktop solution. Enterprise has a long time before they actually prefer browser over apps.\n\nYou're telling me you know people who aren't working off laptops? Organizations of scale still want desktop or laptops. We have more than one per employee. The only problem here is that they last longer than before, but that's why we have more than one I guess.\n\nIf anything Microsoft needs to learn how to market, Teams is so much better than Zoom yet they lost that one. Teams is still the enterprise choice, however (in my work experience, admittedly), and Microsoft always has been more about enterprise than consumer.\n\nI'm a PS5 and Swith user here btw, never had an xbox!", "score": 6, "replies": [{"body": "Yes legacy is definitely a thing. This is why I still like MSFT. Its hard to shake their foothold.\n\nBut what I am seeing is young companies using phones and tablets without any need for a PC. Exception is for people who actually have to write lengthy reports but not everyone needs to do that. Many workers just need access to reports, emails and corporate communication like Slack or similar.\n\nI friend of a friend once called me to help with some IT stuff at their business about 2-3 years ago. They ran a... not sure what they are called... but basically they do loans for bail and such, and they have about 50 workers or so. But the entire office only has about 5 desktop computers and for funny reasons... one is just for powerpoint presentations, another to look at their security cameras and the rest are used by managers.\n\nWhen you watch the workers, they all use their phones. Some use a tablet and they all just use google docs and actually do the typing on their phone (to my horror but young gens seem used to this and using dictation). They are able to do this because their applications and dbs are all cloud based so they dont need any sort of processing power nor much memory since it all runs on the servers and they just see the output. It is what it is. 20 years ago, each person would have at least one full wintel system and there would be a domain controller and some network equipment. Not any more.\n\nWhere I work now (programmer/admin), I would say that 25% of our guys really dont need a PC at all and the rest of us are remote... no need for any MSFT products in our organization for any sort of administrative purpose. We use Google for spreadsheets and tech docs, slack for communication, and our production is almost entirely Linux based. We do still use VS for programming and we release software for windows so MSFT still has a footprint but its nothing like it was 20 years ago.", "score": 2, "replies": [{"body": "That's crazy. I appreciate you. Unfortunately, we are both going off personal experience (which can be valid and is a Buffet strat, right?) and aren't about to divulge where we work or anything.\n\nObviously I have email on my phone, but I hate it. Feels unprofessional. It's obviously way less efficient. I don't know what businesses you know are emailing off phones, they just sound really small, and not typically the Microsoft demographic in the first place, even if they did need more Microsoft in the past.\n\nI'll bet on Microsoft using their cash mountain to learn advertising and do better in retail (losing to Zoom was unacceptable, but that's room to grow in the future, and Zoom also grew by being shady) before they really care about losing some small business hardware sales.", "score": 1, "replies": [{"body": "Its because email has been marginalized by software like Slack and plain texting. Sure we still email, especially outside our organization, but most emails tend to be within our organization so the sheer number of emails has probably fallen off the cliff.\n\nYes it feels less professional but didnt our parents say that about email vs calling or sending a letter? I just roll with it.", "score": 0, "replies": [{"body": "Well yeah but what is a business doing if it isn't emailing outside the organization? I consider Slack a separate tool, and organizations with 365 have a better tool there called Teams.\n\nThere is no way in hell email numbers are going down, I don't need to look that one up being involved in security.\n\nMicrosoft is enterprise, I don't understand who you are consulting or supporting.", "score": 3, "replies": [{"body": "> yeah but what is a business doing if \n\nMost communication is internal... thats where Outlook had a foothold and now its practically gone. Obviously, there is a greater need to talk to coworkers than outside folks to get work done. It used to be that I sent 5-20 emails a day to various people internally. Now I send maybe, a 1-3 emails a month internally and its usually just to accounting for legal reasons.\n\nPretty sure person to person email is likely down a lot. Automated email is probably up as more applications are made but that doesnt help MSFT. Spam is likely up too but doesnt help MSFT either. But you are probably right that its up overall. I dont monitor this.\n\nTeams is good but was late to the show. Same legacy argument applies.", "score": 1, "replies": []}]}]}]}]}, {"body": "Middle schools nowadays use iPad/chrome and google docs/sheets/meet, etc. The students now will be in future work force, and their experience would likely favor systems other than Windows. I develop using both Windows and Linux, and I prefer Linux as it is faster and engineer friendly. Microsoft may be still a good company to invest in next few years, but its glory has gone.", "score": 1, "replies": [{"body": "Yes, I would also guess the poster I was talking to is dealing with schools. \n\nWe'll see, the transition for schools to Google started well before Micrsoft's been hitting all time highs. I think their combination of production + history + cash will help them make up for their shortcomings, but it's a debate at least.", "score": 1, "replies": []}]}]}, {"body": ">There used to be a time when Outlook was a staple, now I am not even sure who uses it any more.\n\nI work in the automotive industry and every OEM, supplier or company i deal with uses Outlook.", "score": 1, "replies": [{"body": "Yep legacy is a thing. Its why I still like MSFT despite the negatives I list. Its really hard for established companies to shift, especially bigger ones. They do at times, but its slow and by then, MSFT usually has a competing product so they just stay with what they know.", "score": 1, "replies": []}]}]}, {"body": "buy a small amount now, and after earnings if it dips within the weeks then avg down. It is at ATH rn", "score": 2, "replies": []}, {"body": "The way you should do it is to buy and then add more again over time. Maybe it will be lower then. But the fact is that you're buying a great company, and great companies aren't cheap. Hold it for 10 years and the company will do amazing things. It won't matter over that period whether you bought at 260 or 230.", "score": 2, "replies": []}, {"body": "Msft usually dips after earnings regardless of the announcement. Or at least that’s what I’m told, by higher ups at Msft. It seems to be a common trend a lot of the people who have been there for a long time think.", "score": 2, "replies": [{"body": "what's the deal with earnings? if they are positive (more profit than anticipated), stocks go down? and if they are negative then what? I know there is implied volatilty, but how do you determine how it will affect the stock?", "score": 2, "replies": [{"body": "What I’ve always heard them say is msft goes up before earnings drops after regardless and then it bumps back up in fallowing weeks. I would back test it because it might just be one of those things that people just think there.", "score": 1, "replies": []}, {"body": "People already expect good earnings and buy shares according to that belief, if they get what they already expected then there is no incentive to buy more or hold longer as they would feel there are better opportunities elsewhere.", "score": 1, "replies": []}]}]}, {"body": "IMO MSFT will be in a lull for the next couple years. Too much competition and they are due for a correction", "score": 0, "replies": []}, {"body": "If you have a 401K thru employer that follows the sp500 why are you buying Msft or apple?  they are 2-trillion dollar companies!   if you’re picking stocks why not pick something that can 5x?  be forward thinking live a little.  Hell over the next 5 years DraftKings or Roblox will get you better returns than Microsoft I dare somebody to say I’m wrong on that.  \n\nHave some balls people", "score": -9, "replies": [{"body": "Have my upvote because I agree and saw you had -3 already.   But in Op’s defense, Microsoft is uniquely positioned to continue growth through the next 10 years, and there’s not really a good alternative to the exposure it gives you.   I personally don’t own any aside from what’s in VOO or spy, but msft is a pretty safe pick that balances growth with risk, and maybe that’s all he or she wants right now.\n\nTo the Op:  I like to sell puts around earnings if I want the stock and think it may tank.  You get the premium plus the stock if you gauge it right, or just the premium if it takes off and goes up.  it can be a really good entry play against the high IV that comes with a pending earnings announcement.", "score": 2, "replies": [{"body": "I don't know why people think MS is *positioned for growth* or if that expression implies certainty like i understand it.\n\nTo me Microsoft has peaked in some areas and is driving growth in a lot of separate products, looking to synergize them like apple is. This horizontal expansion looks great on paper but it also puts them at odds with specialized companies whose job is to deliver solely on one front. Nadella's off-hands approach has improved decentralization enough to increase quality of products but whether they'll win their 1-1 battles against mighty competition is far from a certainty.\n\nBuying MS is like putting money into AMZN, CRWD, WORK all in one and hoping they'll beat the compounded package with an integrated offering - which is fine, it's a good bet that's so far winning - but it isn't a guarantee.\n\nThe gaming sector in particular is very tricky and while Game Pass is a great proposition, we've yet to see a strong response from the competition on it.", "score": 1, "replies": [{"body": "There are no guarantees, and I don’t personally own MSFT stock.   I do think it’s a pretty safe pick that will continue to grow though, and as someone else pointed out they’re supplying the technology that tech relies on.   I’m not that familiar with all the Microsoft game plan but I see future expansion and revenue growths in cloud, app hosting, military applications, gaming, and remote education.   They have the talent pool and revenue to be successful in basically whatever they choose to work on, I wouldn’t bet against them for sure.", "score": 1, "replies": []}]}]}, {"body": "im 100% certain someone said the same thing about nkla", "score": 1, "replies": [{"body": "Nikola, who never had a product, compared to a company that has 100 million kids interacting or a company that is the leader in a new industry partnering w the NFL and billion dollar investors.\n\nOk chief, you do you.  You probably thought Amazon and Facebook were dumb because of their profit losing operations from the early days.  \n\nHistory doesn’t repeat but it rhymes - have fun entering MSFT at 2T valuation.", "score": 0, "replies": []}, {"body": "Yeah that was probably me.  But I also hold MSFT", "score": 1, "replies": []}]}, {"body": "Totally financial advice you should take up there /s", "score": 1, "replies": []}, {"body": "Your principle is accurate, your examples are flimsy at best. Which is why people are right to spend some money on MSFT. \n\nThe owner of DKNG could say something racist or political and permanently cut its valuations. \n\nWhen today’s 10-yr-olds are 13, their younger siblings could decide that Roblox is for old people and some new crowdsourced everything video game platform will become the new hotness. \n\nThere are a near infinite number of finicky possibilities that could undercut your picks. In the meantime, MSFT will be busy growing 20-50 percent per year. \n\nEvery year. \n\nBecause dkng and rblx need MSFT. And the new shiny things that replace those companies will also need MSFT. It’s the premier shovel company in the tech gold rush.", "score": 1, "replies": [{"body": "MICROSOFT traded FLAT for 12 of the last 15 years you great fool!!", "score": 1, "replies": [{"body": "12 years ago called. It wants its comment back.", "score": 1, "replies": [{"body": "Hey boomer You think Msft is going to be 5 trillion in 5 years more power to you.  I’m going for more realistic gains.  If you are about 40 years old or younger don’t waste your time horizon on companies that already went parabolic.   Have a brain and realize you 401 k is conservative you can make money on Unity and Teladoc", "score": 2, "replies": []}]}]}]}, {"body": "Your wrong", "score": 1, "replies": []}]}, {"body": "MSFT is a long term hold. Their business is blowing up. I am convinced any short term drops end with the stock ultimately setting new ATHs for those who don’t have a super short time horizon.\n\nBought MSFT last year with the plan to hold for years to come, and watch the returns pile up.", "score": 1, "replies": []}, {"body": "Half before. Half after", "score": 1, "replies": []}, {"body": "What is your horizon? For short term speculation, be aware that MSFT has the habit of dipping after earnings. For long term holding, just buy. Waiting has no point", "score": 1, "replies": []}, {"body": "If you are in for short term, dont pick micro, if you long term, you go for it. Entry price doesnt matter much in that case.", "score": 1, "replies": []}, {"body": "STRONG BUY!!!", "score": 1, "replies": []}, {"body": "I saw a video yesterday where a guy analyzed MSFT shortly and he noticed one thing and that‘s honestly the only thing to know about MSFT \n\nIn the last 5 years it has dipped 2 times below it‘s 200day average and one was Corona. So lets rather say once in 5 years. \n\nJust buy MSFT whenever this company just raises in price as u watch", "score": 1, "replies": []}, {"body": "Buy now. Cloud is on fire. Picked up some very large Fortune 100 clients recently.", "score": 1, "replies": []}, {"body": "Depends. Do you want to pay more later on or get in now and get gains. They did get a good size govt contract recently. News is always looking good for them.", "score": 1, "replies": []}, {"body": "250s looks like a good entry, 245 would be a great price based on the charts.\n\nEarnings will drive the price up so might want to buy before that", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "mw5p7w", "created_utc": 1619100900.0, "score": 37, "upvote_ratio": 0.79, "num_comments": 57, "comments": [{"body": "Just follow me and do the exact opposite of what I do, and you'll do great!", "score": 19, "replies": [{"body": "I feel that. I'm thinking of buying X company, but I think I'll hold off. X company goes on to have a week of 5-25% gains daily... Shit.", "score": 3, "replies": []}]}, {"body": "If you really like MSFT and AAPL but are looking for an ETF, take a look at Vanguard’s Information Tech ETF, VGT. I sold it last year because I already owned shares of MSFT and AAPL, but if I remember correctly, those two make up 40-50% of the fund, and the rest is spread around a little more. \n\nDo your own research and look at the company weights in the fund. Single stocks can provide more upside, but ETFs usually aren’t going to crater if you want to protect your downside a bit.", "score": 35, "replies": [{"body": "Actually you can (in theory) choose individual stocks that will do just the same thing as what you said an ETF will do: have less upside but more downside protection.  Defensive stocks are probably even more conservative than most ETFs, actually, but with even less upside potential.  So it's something like Growth stocks -> ETFs -> defensive stocks in order from highest risk / highest reward to lowest.\n\nI haven't crunched the numbers or looked at historical data, but it seems to make sense.", "score": 4, "replies": [{"body": "That’s what I do. What you are saying is basically a basket approach. If I want to own a bank basket (which I did last summer), I just bought shares of PNC, JPM, BAC, C, WFC, and USB. I have sold off everything except BAC and USB since, but I agree that the most flexible approach is picking your own stocks if you have the time and mindset for it.", "score": 4, "replies": [{"body": "Indeed, your original comment was spot on, just wanted to add that little footnote.", "score": 2, "replies": []}]}]}]}, {"body": "22 year old investor here, i’ve made a lot of fuckin mistakes so here is what i’d say so you can avoid some suffering:\n\n1. Pick companies you actually know, so you’re not just speculating price as your only logic to selecting the stock. Seriously, i’m dumb as hell and didn’t do this at first. You’ll lose money 9 times out of 10.\n\n2. Don’t be hesitant investing in ETFs. It’s hard to beat the market. I think today is the only day in the last 3 months where my stocks have outperformed VOO (the only ETF in my portfolio).\n\n3. Microsoft and Apple are good choices. Barring a market collapse, they’re almost ensured to increase in value. I wish i had those in my portfolio.\n\n4. Pick sectors you believe in and know shit about. For example: I know a lot about the EV market through my job, so I own a lot of EV stocks and they’ve done wayyyy better than the rest of my portfolio. If you want EV stocks, go with Nio, Ford, GM, Tesla, or Stellantis. I own 3 of those, i won’t say which tho so you aren’t biased in case u wanna pick some EV stocks.\n\n\nHope this helps dude, good luck", "score": 35, "replies": [{"body": "You should rotate China EV into aerospace before you find out what phase of the China Hustle you find yourself in.", "score": 1, "replies": []}]}, {"body": "Sorry bro, all I got are these 22 year old investor tips. Come back next year kid.", "score": 8, "replies": []}, {"body": "VTSAX", "score": 18, "replies": []}, {"body": "SCHD, DGRO 2 great etfs to own.\nWhen buying etfs looks at their positions that they hold and percentage of holdings.\nCost average slowly into them.", "score": 5, "replies": [{"body": "These are my two largest holdings.  Love them.", "score": 1, "replies": []}]}, {"body": "95% $SPY\n5% Play side folio", "score": 5, "replies": []}, {"body": "ETF’s are a good option if you want something broad that tracks the market as a whole. I’m a big believer in investing in what you know. Look at things you use a lot and think are high quality then invest in the companies behind them.", "score": 10, "replies": [{"body": "What are ETFs and how do I invest in them?", "score": 5, "replies": [{"body": "A collection of stocks (sometimes bonds or other securities) packaged together and sold under a ticker on an exchange.\n\nExchange Traded Funds. QQQ and SPY are good examples of index ETFs", "score": 7, "replies": []}]}]}, {"body": "Coming from a new investor who’s lost 5% already: \nPut 90-95% of your money into an ETF like all world, or s&p500, realistically it doesn’t matter, and put the remaining % into well researched company(s) that aren’t in the etf of your choosing", "score": 4, "replies": []}, {"body": "Open a Roth IRA and put $6k per year ($500 per month if you wanna space it out) into VTI. Live your life.\n\nOpen an individual brokerage account if you want to invest more than $6k every year, and add in some VXUS both for the international tax credit as well as exposure to markets outside the US. Personally, across all of my investing, I’m about 75/25 VTI/VXUS.", "score": 5, "replies": []}, {"body": "You could take a look at PayPal. Has a significant market share in the fintech industry which will be an ever bigger sector as we move on to a cashless world. They also own other companies like Venmo. Their balance sheet is good, solid financials and they are growing at a rapid pace in every area, hence the fairly high current P/E of about 75. You should do your own DD too, but this is just my short opinion on the company.", "score": 7, "replies": [{"body": "I like PayPal and agree with most of your analysis. However, it’s too expensive for me but it’s getting close. A PE of 75 is just too much.\n\nHowever, the OP is just starting out. Recommending any single stock over broad indexes doesn’t have his best interest at heart.\n\nIf this was a rock climbing thread and someone asked advice starting out... what would you say if someone advised him to start on Everest?", "score": 1, "replies": []}]}, {"body": "ETFS:  VOO or VTI would be a good start.  Make that your \"core\" ETF and then pick some other ETFs that you think will outperform the overall market.  I'm bullish on the ARK funds, PBW, SOXX, XITK", "score": 5, "replies": []}, {"body": "VOOG - Vanguard S & P 500 Growth ETF\n\nIt has been up about 9% past month. It has been rock solid during the market tech decline this past March. Also MSFT and AAPL are good solid picks.", "score": 3, "replies": []}, {"body": "If you really want very long term stocks that you won't look at for the next several years. Then yes MSFT and AAPL are good stocks.", "score": 3, "replies": []}, {"body": "VTSAX/VTI. Actively invest into it whether at the start of the year or monthly. Years down the line, you'll be greeted by a treasure chest.", "score": 3, "replies": []}, {"body": "Start a roth IRA, max out roth ira first. \n\n&#x200B;\n\nSafe:\n\nfbgrx - fantastic well run growth fund. better than SPY and others mentioned here. do this and nothing else if you dont want to think.\n\nbayry- leading biotech for genetically engineered crops. share price took a hit in the last few years, is ready for a rebound as it pays off its debts (it has been steadily paying down its debts). I am buying this as long as its below 25.\n\nSFM - sprouts farmers market. \n\nAMD- any buy below 82 is a good buy imo, the lower the better.\n\n&#x200B;\n\n&#x200B;\n\nHigher risk higher reward, HITIF, TLGRF, PYR\n\n&#x200B;\n\nPlease do your own diligence, dont take my word for it.", "score": 3, "replies": []}, {"body": "Investigate companies that coincide with your field of interest, tools, cars, hardware, shoes etc.\nRead lots.\nA few months of paper trading is invaluable.\nIf your considering long plays, consider shifts in economy, peoples spending habits. Ie : if your home place is going into lockdown do you think netflix usage will go up? Will there be more uber deliveries etc.\nRead lots.\n\nEat, sleep read repeat.", "score": 4, "replies": []}, {"body": "Just buy companies you like", "score": 2, "replies": []}, {"body": "CNR the tickr is different on US exchanges but search it up. CNR is Canada National Railroad. The stock recently plummeted 7% on news and is one of the safest stocks to have money in whether there is a global pandemic or a recession. CNR has recently talked about buying an American railroad company. I think for a young investor who is also working full time CNR is a safe and great place to put some cash for low to moderate returns. I am not sure on their dividends you’ll have to check that out too. :)", "score": 2, "replies": []}, {"body": "VTI and FTEC. VTI is a whole market ETF and FTEC is a tech ETF that carries a large amount of MSFT and AAPL.", "score": 2, "replies": []}, {"body": "I only know stocks that are good for 25+ investors.. sorry pal", "score": 5, "replies": []}, {"body": "I’m 22 and invested in risky long term stocks because I don’t see the point of being invested in safe value. But if you’re fine with 7% a year, then just buy big companies in s&p500 or ETFs", "score": 2, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Lol. It’s not that difficult to make 20%", "score": -1, "replies": [{"body": "Yeah says you during the largest bull run ever seen. 2020 was an anomaly", "score": 2, "replies": [{"body": "I’m not including 2020. A lot of people have made 20% a year before this bull run", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "So everyone becomes a billionaire if they average 20%?😂Not everone has capital to invest so they become billionaires even though they beat the market every year", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Not many people can begin with 10k", "score": 0, "replies": [{"body": "True. But understanding Why is important.\n\nPeople with physical or metal disabilities have a harder time than most. A failed education system and parents without the proper skills also limit options. Sometimes things don’t work out.\n\nBUT it is a mistake to believe that “not many”  people can’t put together $10k. Most people in America could put it together if they were motivated. \n\nit‘s hard work and feels difficult to become a saver.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Etfs would be my suggestion for instant diversification. Even something like a roboinvester like Wealthsimple is a great option.", "score": 1, "replies": []}, {"body": "Buy Square and PayPal. You have lots of time for them to grow into the trillion dollar companies they’ll eventually be. MasterCard and Visa are also good bets in payments if you’re risk appetite isn’t high enough for SQ/PYPL. Honestly you could own all them and by 2030 you’ll be well over 3-4x returns.", "score": 0, "replies": []}, {"body": "I also recommend SWTSX in case you can’t or don’t want to pay the $3k min for VTSAX. Another alternative for VTI/VOO is Schwab’s SWSTX/SWPPX.", "score": 0, "replies": []}, {"body": "[deleted]", "score": -5, "replies": [{"body": "I like VIOO. It follows the S&P 600 small cap stocks. It make me feel like I know something.", "score": 2, "replies": []}]}, {"body": "Come join us at trailerparkbets on discord.A lot of us came from wallstreetbets as we got tired of nonsense conversations. It has helped me learn more about what and when to invest in and how to read charts etc. pretty solid. PM me for invite. I still do enjoy WSB too.", "score": -8, "replies": [{"body": "Boiler room bets", "score": 2, "replies": []}]}, {"body": "I recommend SPYG and SPGI. Put $20 in each week. You will have a lot saved by the time you want to retire.  It will take a while for the returns to look like much, but when you get to around 45 years old you will see them explode.", "score": 1, "replies": []}, {"body": "Research a good list of companies you love and buy when not overvalued", "score": 1, "replies": []}, {"body": "Vti / Qqqm = has apple and Microsoft + more", "score": 1, "replies": []}, {"body": "CNR and or CP.", "score": 1, "replies": []}, {"body": "Honestly, I would wait and buy stocks for a 22 year old investor...jp jp\n\nIt is hard to say what to buy, because that just depends on timing and how patient you are..You should study some fundamental (what to buy) and Technical (when to buy) analysis...Then look at stocks and EFT....odds are apple and Microsoft will do well into the future...\n\nbut this the biggest point and something everyone in your position should know....don't take advice from random people on the internet....", "score": 1, "replies": []}, {"body": "Videogames, weed, electric vehicles, and semiconductors manufacturers. Retire at 30.", "score": 1, "replies": []}, {"body": "ETF's are for paper hands, you should be trading futures and currency. \n\nETF's are good but if you have full time job, and you are planning for your future, I would just buy index funds. But if you want some thrill, as other people said buy what you like. For example, I really like snapchat, I personally use snapchat alot. So I have lots of shares in it. But I also researched it. Also obviously what I said in my first sentence is a joke. Happy trading.", "score": 1, "replies": []}]}
