{"title": "Autotrader.com is pure garbage. They released a list of the 10 best electric cars for 2021 and Tesla isn't even in the list.", "selftext": "", "id": "mreisp", "created_utc": 1618492857.0, "score": 374, "upvote_ratio": 0.95, "num_comments": 64, "comments": [{"body": "If you dig down a little deeper you will recognize that Autotrader.com is run by [Cox Automotive](https://en.wikipedia.org/wiki/Cox_Enterprises). Their mission consists of \"vehicle remarketing services and digital marketing and software for automotive dealers and consumers.\"\n\nSo, with Tesla not paying a single dollar for marketing they don't have a reason to include them in any of their rankings.", "score": 91, "replies": [{"body": "[deleted]", "score": 65, "replies": [{"body": "Nice finding. Thanks.", "score": 16, "replies": []}, {"body": "Cox automotive is a privately owned company", "score": -2, "replies": [{"body": "Just because they are a private company doesn't mean they don't have an obligation to let people know when the products they produce for our consumption are influenced by advertising spending. If there isn't a legal obligation then at the very least there is a moral obligation that Congress and the FTC need to codify into law.", "score": 13, "replies": [{"body": "I don’t disagree with you from a moral standpoint. But from a legal standpoint they don’t have to from my understanding. This should 100% be changed.", "score": 2, "replies": []}]}, {"body": "They have no obligation as to make a statement as a company.\n\nThey do as a news/ journalistic group. If they are going to write \"news\" about something they are invested in or a competitor they should put up a notice that says \"we have a financial interest in the news we report\" so people know there is a bias.", "score": 3, "replies": []}]}]}, {"body": "> So, with Tesla not paying a single dollar for marketing they don't have a reason to include them in any of their rankings.\n\nNot merely \"don't have a reason to include\" but rather \"reasons not to include\". Subtle difference.", "score": 3, "replies": []}, {"body": "No dealers either", "score": 2, "replies": []}, {"body": "Every publication basically. ESP auto as they’re in with the dealers and Tesla has no dealers. And they’re 100% bought as you say.", "score": 1, "replies": []}]}, {"body": "Lol you'll notice tesla hack jobs posting articles all over. My favorite is Motor junkie's top 20 reasons not to buy a tesla.", "score": 107, "replies": [{"body": "Autotrader is paid to push buyers to dealerships. Tesla doesn't pay to play their silly retail games.", "score": 125, "replies": [{"body": "I.e. ranking in Autotrader articles is **\"pay to play\"**.\n\nAlso, the company that owns Autotrader.com (Cox Automotive) is a major investor in Rivian. Totally no conflict of interest there.", "score": 52, "replies": [{"body": "Tech blogs do this, too.  When I worked at a startup, we paid TechCrunch to do an article on us for our launch. I think it was $10,000", "score": 13, "replies": []}, {"body": "As are most rankings. From VPN or Antivirus to Insurance or Cars.", "score": 5, "replies": []}, {"body": "They also own Kelley Blue Book.", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 49, "replies": [{"body": "“Legacy agenda pushing”. What they do and did isn’t considered journalism by any stretch of the imagination.", "score": 17, "replies": []}, {"body": "> I like to call them “legacy journalism”.\n\nMore like \"paid shills\"; you can safely ignore everything from them, there are better sources of news.", "score": 7, "replies": []}, {"body": "To me, the silver lining is that it’s keeping the stock price low so I can buy more.", "score": 6, "replies": []}, {"body": "Sadly, legacy journalism is dead - real, actual journalism. This is the new age of journalism, courtesy of the internet and social media, where everyone just wants clicks and views pushing their bullshit agendas.", "score": 3, "replies": []}, {"body": "I have absolutely no notion why a reporter would want to put their name on such an embarrassing article like the one OP provided. We can laugh about AutoTrader being bought and paid for but how desperate does the 'journalist' need to be? Is anyone even tweeting at them to ask the obvious?", "score": 3, "replies": []}, {"body": "This is a great thing for us, by them speaking out like this, we know their agenda and can work around or against them easier.  It's like when rotten tomatoes gave a 0 rating to Dave Chapelle.... he later won awards and announced he won and killed a part of the social justice agenda, also completely revealing how corrupt and biased rotten tomatoes is.  This is good stuff, these people spreading mis info arent as clever as they think.", "score": 2, "replies": []}]}]}, {"body": "Most every publication, including the “awards” like jd power, are pay for play. Since Tesla doesn’t buy advertising, they are ignored.", "score": 35, "replies": [{"body": "My feeling is this enhances the test drive effect, where the customer is even more taken with Tesla’s offering when they are finally exposed to it than they would have been because they were hardly considering Tesla beforehand, or worse, had negative feelings about Tesla.\n\nThis happened to me back in 2018 when I was shopping for a new car. \n\nI was well aware of Tesla at the time *(The first Tesla I saw in real life was Jon Favreau’s on the set of commercial we were shooting—I cant remember what year it was but it was very early on and I had wanted to have one ever since.)* But I didn’t even consider a Tesla, mostly because I perceived it to be out of my price range, and although I will stretch to purchase something as invaluable as I now know a Tesla to be, at the time I just didn’t rate it as such. Mostly due to ignorance.", "score": 6, "replies": [{"body": "Wow. Did you meet Jon Favreau?", "score": 3, "replies": [{"body": "Nope", "score": 1, "replies": []}]}]}]}, {"body": "Hilarious, they'd rather include PHEVs than include Tesla. Tried commenting but it won't post. Surprise.\n\nThe list isn't even based on anything. I think even Bolt owners would agree the EUV isn't going to be #1, even in a world where Tesla doesn't exist. The ID.4 at number 8 is just misinformed.", "score": 35, "replies": [{"body": "Yea I tried too. This site is complete trash, anyone who is making a car purchase decision (which is a big decision for most people) based on anything this website has to say is seriously stupid.", "score": 11, "replies": []}, {"body": "Listicles are pay for placement. You think someone objectively measured the traits of all these vehicles?", "score": 2, "replies": []}, {"body": ">In alphabetical order, here are the best electric cars for 2021:", "score": 2, "replies": []}]}, {"body": "that's why Elon calls them, \"Ransom Companies\". Relax and put on the Chill Mode.", "score": 15, "replies": []}, {"body": "They are paid", "score": 9, "replies": []}, {"body": "[In other news , Model 3 is MotorTrend's #1 Best Compact Luxury Sedan to Buy in 2021](https://www.motortrend.com/features-collections/best-luxury-compact-sedans/)", "score": 9, "replies": []}, {"body": "3 PHEVs made the list lol pure trash auto trader, just call it the sorta ok 10 electrified vehicles for 2021 that our sponsors would like you to buy. FTFY", "score": 5, "replies": []}, {"body": "Hilarious. A Prius is on their list of best EVs. They are a joke.", "score": 7, "replies": []}, {"body": "That's bizarre. They just wrote a [positive review of the Model Y a few weeks ago](https://www.autotrader.com/car-reviews/2021-tesla-model-y-review).\n\n>The 2021 Tesla Model Y is a strong contender in the EV crossover/SUV arena.", "score": 3, "replies": [{"body": "even that is a lie though, the model Y is easily the best in category by a mile, not a \"contender\"", "score": 3, "replies": []}]}, {"body": "Tesla refuses to buy ads in mainstream media. Media retaliates by ignoring or lying about Tesla", "score": 3, "replies": []}, {"body": "What do you expect from a site that sells used cars on it?", "score": 3, "replies": []}, {"body": "Wow, you'd think to save face and at least pretend like they're not just a marketing website that they'd make the Model S #9 on the list or something.", "score": 3, "replies": []}, {"body": "Obviously because Tesla isn't an EV. It's a car people actually want to buy.", "score": 5, "replies": []}, {"body": "Wack", "score": 2, "replies": []}, {"body": "Autotrader is owned by COX cable.  Not only is Elon disrupting their auto business, he's also coming for their internet business. They HATE him.", "score": 2, "replies": []}, {"body": "It still surprises me that people don’t realize these are primarily paid lists. When I was on the chamber of commerce years ago we paid a lot to get awarded the worlds most beautiful beach. As others have pointed out, this is paid lead generation to drive traffic to dealership sites.", "score": 2, "replies": []}, {"body": "Autotrader survives and lives off ads from dealerships and sponsorships so why would they have an objective agenda especially when Tesla doesn't advertise and is anti-gas", "score": 2, "replies": []}, {"body": "Thanks for making sure I never do business with this publication ever", "score": 2, "replies": []}, {"body": "Good job linking to the article giving them the hits they want", "score": 2, "replies": []}, {"body": "This really hasn't stopped me from doing my own reading and test driving to very easily determine that Tesla should be #1 on that list.\n\nEver driven a Nissan Leaf? Fuck me. Still horrendous. I used to work as a mechanic there. \n\n\n Nissan is 10 years behind on interior. The early generations of the Leaf were cool because yay, innovation! But they have not gotten better in terms of interior..\n\n\nThe Kona/ioniq feel tin canny. \n\n\nI actually haven't been in a new Volt, but if it's like any other Chevrolet pile of shit I've driven in the last 20 years, it's going to be cheap flimsy plastic.\n\nWhat's Volvo's market share like in this space? I've NEVER seen a Volvo electric/hybrid in real life in PNW Canada.", "score": 2, "replies": []}, {"body": "Cox automotive owns, Manheim Auto Auctions and other dealer management systems, Autotrader and an investor in rivian. I wouldn’t take this seriously at all...they are incented to slow down the transition to EVs as much as possible to pivot and protect their business.\n\nWhy would anyone take this seriously for leaving TSLA off the list anyways? Lol", "score": 2, "replies": []}, {"body": "When’s the last time you used auto trader to buy a vehicle? Bahahahahahaha!!!", "score": 1, "replies": []}, {"body": "Wait, there are people who use autotrader.com? Sad, pitiable people.", "score": 1, "replies": []}, {"body": "I wonder if it’s because nobody sells used Tesla’s on autotrader.com.", "score": 1, "replies": []}, {"body": "Lol 8 out of 10 consumers in the US disagree", "score": 1, "replies": []}, {"body": "Why would they be on a list that they don’t pay to be on?!", "score": 1, "replies": []}, {"body": "that's because Tesla doesn't pay for marketing as they believe the product markets itself. Autotrader sells ads and people who sponsor or buy get listed. they probably send a survey out after they get all of the sponsors for the article to rank them according to the survey audience but that's as far as they need to go. marketing 101", "score": 1, "replies": []}, {"body": "These articles are paid for by specific companies. They left Tesla out because they were paid not to add them in the article.", "score": 1, "replies": []}, {"body": "10 best electric cars that also spend on advertising.", "score": 1, "replies": []}, {"body": "What a joke.", "score": 1, "replies": []}, {"body": "Tesla doesn't pay them.", "score": 1, "replies": []}, {"body": "Maybe it’s just a title error. “The 10 worst selling electric cars of 2021”", "score": 1, "replies": []}, {"body": "Quickest way to lose their creditability.", "score": 1, "replies": []}, {"body": "They made it abundantly clear that it's a joke list by including the Leaf.  Even leaf owners hate the leaf.", "score": 1, "replies": []}, {"body": "There is a lot of information hiding and it's not just with Tesla.", "score": 1, "replies": []}]}
{"title": "Buy DFEN, RTX, LMT, and BA calls", "selftext": "[removed]", "id": "mr6bi3", "created_utc": 1618456013.0, "score": 49, "upvote_ratio": 0.75, "num_comments": 58, "comments": [{"body": "Jesus Christ what a morbid post. I love it.", "score": 65, "replies": []}, {"body": "Remember the last time Russia walked in and took part of Ukraine and nobody did anything?", "score": 32, "replies": [{"body": "Ukraine remembers. Cyka Blyat", "score": 14, "replies": [{"body": ">cyka\n\nсука is not the same thing as \"cyka\". Write \"suka\" instead next time :)", "score": 7, "replies": [{"body": "bad bot", "score": 1, "replies": []}]}]}]}, {"body": "Seems retarded. I'm in.", "score": 27, "replies": []}, {"body": "Hey, this seems familiar. Now we only need one of them to bomb a port and we can get this shit rolling.", "score": 13, "replies": []}, {"body": "Remember when Russia blew up that Ukraine ammunition dump with a quadcopter and a incendiary device, causing a billion dollars worth of lost munitions?  Putin is about to Make Ukraine Russia Again.\n\nYou didn't think VVP was going to let Biden hang on to all that Ukrainian gas money after he kicked his boy out of the whitehouse, did you?", "score": 10, "replies": []}, {"body": "\n\nGot in to LMT at 328. Wish I had gotten some more \nhttps://www.reddit.com/r/investing/comments/la7g07/_/", "score": 8, "replies": []}, {"body": "Does PLTR fit in this?", "score": 14, "replies": [{"body": "Come now lol. $PLTR will be on the front lines", "score": 14, "replies": []}, {"body": "It shoots from the moon mate", "score": 6, "replies": []}, {"body": "LOL no.....", "score": 1, "replies": [{"body": "dOeS PltR fiT iN tHiS? lmaoooo", "score": 1, "replies": []}]}]}, {"body": "Oh shit DFEN is on clearance ill take some of that", "score": 7, "replies": []}, {"body": "DFEN is a highly leveraged depreciating asset. Just because it fell some 70% last year doesn't mean it will go all the way back even if all the defense holdings go back to pre-covid levels. I do like the idea of buying BA and RTX though for the long term. Too slow for options.", "score": 5, "replies": [{"body": "The chart shows DFEN is back to ath", "score": 0, "replies": [{"body": "ATH is so.ewhere in the 70s, retard", "score": 4, "replies": []}]}]}, {"body": "I have been in RTX and LMT for a long time as a divided investor and now WSB has got ahold of them😔", "score": 5, "replies": [{"body": "I have been in GME for a long time as a multiply investor and now WSB has got ahold of it 🐒🚀🌑💎🙏", "score": 1, "replies": []}]}, {"body": "If you're going to buy all of those you should consider ITA, defense ETF as well", "score": 4, "replies": []}, {"body": "America declare war on Russia LoLLLLLL", "score": 4, "replies": []}, {"body": "[deleted]", "score": 13, "replies": [{"body": "This is true. Three of the eight challengers in the ongoing Candidates tournament are Russian. The tournament is being held in Yekaterinburg, Russia as well. Russia cares deeply about chess.", "score": 7, "replies": []}, {"body": "I just heard spanking and as I am bullish on that shit would like to know which options I should yolo", "score": 5, "replies": [{"body": "Maybe your favorite transportation company: personal vehicles, holiday passenger ships/planes/trains, resource carriers, or space faring rockets?", "score": 1, "replies": [{"body": "Haha I tricked you fucker! It's always GME! No banana for you", "score": 1, "replies": []}]}]}, {"body": "Normally, I might entertain this (primarily due to how thin Russia is spread due to demographics), but this time, thanks to covid, I think there's a lot of idle manpower that would be better spent taking land than wondering why their boss god has failed them.", "score": 3, "replies": []}, {"body": "\n\nPutin is stupid and cares about chest", "score": 5, "replies": [{"body": "And spearfishing", "score": 3, "replies": []}]}, {"body": "I just wanna shoot some Europeans, dude", "score": 1, "replies": []}, {"body": "Guys you really should not open this topic. You are young, playful, everything's easy for you. This is an another thing. It's not Snowden and not even secret services archives. Better not to get into that. Seriously, any of you would deeply regret. Close the topic and forget what was written here. I fully understand that this post incites additional interest, but I far the curious - stop. The rest will just not see it.", "score": -6, "replies": []}]}, {"body": "any position suggest？", "score": 1, "replies": [{"body": "Currently in RTX 11/19 80c", "score": 2, "replies": [{"body": "thank you", "score": 3, "replies": [{"body": "Shut the fuck up bitch", "score": 35, "replies": []}]}]}]}, {"body": "Putin tried to steal a superbowl ring from an owner while he was visiting Russia. Putin asked the guy to see it, put it on and walked away. I don't remember how the guy got it back, moral of the story, Putin will be Putin.", "score": 1, "replies": []}, {"body": "Thanks for the pick. I’m going to buy calls that expire on the 16th. Do you think that’s enough time for one of our nukes to crack Russia?", "score": 1, "replies": []}, {"body": "You say slog rebound on DEF but it’s around the ATH for the last year", "score": 1, "replies": [{"body": "Are u autistic? The ATH is like 76", "score": 2, "replies": []}]}, {"body": "Yep, the Military Industrial Complex has got their stooge back in the Big House after being somewhat shut down for 4 years.  Bullish Death and Destruction.", "score": -1, "replies": []}, {"body": "dont forget about NOC and KTOS. DFEN is the cheap option but has some shit companies at the bottom of its holdings", "score": 0, "replies": []}, {"body": "Thanks. Just bought some calls for July. Good luck", "score": 1, "replies": []}, {"body": "Are we looking at the same DFEN Bc it looks like it’s been the highest in like a couple years?", "score": 1, "replies": [{"body": "Yes, ath was a few years ago.  It's a 3x leveraged ETF so massive losses will require even larger subsequent gains to get back ath.  The underlying stocks will have been a better investment.  I.e. Underlying stocks drops 30%, this etf drops 90%. So say $100 each at beginning, drops to $70 vs $10 for this ETF.  The underlying stock gets back to $100 with just a 43% gain.  The 3x ETF with 3x those 43% gains still way down below the $100.  DFEN is not a good longterm investment if OP thinks that's what's up by comparing to 2 years ago.\n\nDisclaimer: I bought DFEN a month ago at 22.31 and sold a few days ago at 22.50.", "score": 1, "replies": []}]}, {"body": "*Cries in law against investing in foreign weapons manufacturers*", "score": 1, "replies": []}, {"body": "Sounds strange given the stalling budget increase in DoD by the new administration, but could work out if Russia goes cray cray, tracking your bets here [https://www.markovchained.com/profiles/view/reddit:SouulFood](https://www.markovchained.com/profiles/view/reddit:SouulFood)", "score": 1, "replies": []}, {"body": "NBC is a joke", "score": 1, "replies": []}, {"body": "Yeah, I've been pounding around this for quite a while.   \nIdentified standard DoD contractors, compared what has happened to them during 2014 (that's when RU went full moron on UA). And guess what. Nothing. Nadda. Nicht. I guess as long as US doesn't declare the open war or at least troop deployment somewhere in the hot zone those stock aren't moving. Well, yeah, they are good for sure, just like any other boomer stock which is here around for >40 years.", "score": 1, "replies": []}, {"body": "Positions?", "score": 1, "replies": []}, {"body": "I bought leaps on BA and LMT once Biden took office. I completely agree.", "score": 1, "replies": []}, {"body": "Some say Putin put troops on Ukraine just cause he's leveraged to the tits on these", "score": 1, "replies": []}]}
{"title": "Cattle Futures - buy the dip?", "selftext": "Don't know what to buy? Buy SPX/SPY/ES and don't look back. Jeez how many times do we have to teach you, old man? \n\nHave a bit of spare change left? Consider buying some cattle, whose drop in the last few days does not make sense in light of faster economic growth and higher feed prices. \n\n[June 2021 Futures](https://preview.redd.it/6e9ns0kpbdt61.png?width=1360&format=png&auto=webp&s=6e7e8427c27f04cc3e75c42e700a162fcf97aa08)\n\n1. For cattle, the most important factor quite honestly is the supply. More cattle than what is demanded (domestically or internationally) means subdued prices. Right now, this is the primary driver, as [young calves raised in late 2020](https://www.ers.usda.gov/topics/animal-products/cattle-beef/market-outlook/) in anticipation of economic recovery in early 2021 are showing up on the lots. As of right now, demand is OK - just OK with Americans coming back to restaurants, even though the rest of the world isn't. Like what was driving oil prices (up to yesterday when the IEA upgraded all forecasts), the rest of the world is significantly lagging the US in recovery. \n2. Feed prices are critical to cattle as well (namely corn and soybeans). These have been on a tear in the past few weeks due to fewer than expected planted acres, and the current cold front across the midwest. If the feed becomes too expensive, it becomes more costly to fatten cattle, making less available to market, especially for the June contract as the time to fatten is now. \n3. The backlog is about to end. The massive oversupply has been in play for about 6 months already - from October to April. Every commodity has seen the same cycle post-pandemic - a massive depressing of prices, only for the entire market to realize they've been too pessimistic, and then sudden rally. \n\n&#x200B;\n\nIt seems like cattle is one of the last agri laggard - corn, soy, hogs and lumber have already punched through the roof. I'm heavily in corn gang, but overall I'm bullish all soft commodities. Buy a few contracts and see what happens, and I'll be sure to report back when I find 18 metric tons of beef on my front porch.", "id": "mrj8si", "created_utc": 1618506774.0, "score": 47, "upvote_ratio": 0.77, "num_comments": 60, "comments": [{"body": "Please, don't forget to close your long future positions before maturity, unless you own a ranch...\n\n[Edit: you know, you should not post this here. Because I'm pretty sure, in 1 or 2 months, we will see a dumb ass post a selfy with cows because he didn't know he had to close his position.]", "score": 79, "replies": [{"body": "What do you mean I can’t have cows in my apartment? I don’t see cows listed on the lease agreement.", "score": 28, "replies": [{"body": "screenshot x 200,000 banana peals #@!$%\\^.", "score": 4, "replies": []}]}, {"body": "Well they could just buy feed from the guys who forget to close their corn future contracts.", "score": 9, "replies": []}, {"body": "The edit made my laugh more than it should have.... that's some gourd shit.", "score": 6, "replies": [{"body": "Also, I secretly wish it comes true.", "score": 2, "replies": []}, {"body": "Late reads may lead to that. I'm currently going through the posts and finding some pretty good ones...", "score": 1, "replies": []}]}, {"body": "I want that to happen so so so bad. For the record, if you hadnt said anything, I could have easily been one of those dumbasses", "score": 3, "replies": []}, {"body": "hahaha, 'selfy'.\n\nnice.\n\nyour advocating responsible trading ? wrong subreddit kiddo #$@%\\^%&.", "score": 2, "replies": []}]}, {"body": "This DD is very moooving, but I got some inside info on orange juice futures and am currently balls-deep there", "score": 32, "replies": [{"body": "The crop report, Mortimer!", "score": 17, "replies": [{"body": "I feel like it's gonna be a good day for pork bellies", "score": 10, "replies": [{"body": "I hope this is /s because lean hogs are currently limit down -3c", "score": 3, "replies": [{"body": "i actually wish i followed this advice when i saw the movie before xmas, trending down now so yes /s", "score": 4, "replies": []}]}]}]}, {"body": "Bull or bear?", "score": 5, "replies": [{"body": "It's oranges, obviously there will be a squeeze. Bull all the way.", "score": 7, "replies": [{"body": "Anyone know what the weather is like in Florida? Is there an impending frost, flood or fucking comet? I needed to know 🧐😆🍊🍊🍊", "score": 2, "replies": []}]}]}, {"body": "OH NO. first pun spotted.", "score": 1, "replies": []}]}, {"body": "The ornamental gourds guy is shaking right now.", "score": 16, "replies": []}, {"body": "But for real, what ticker tracks cattle futures?", "score": 10, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Well I don’t want to invest in pork bellies, frozen concentrated orange juice, soybeans, or salt.  I want to invest in cattle futures...is OP tryin’ to tell me to go buy some freakin’ cows and hope they’re worth more soon?  Cuz fuck that!!", "score": 5, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "New Germany Fund? Not sure how that is related to beef but I'm in for some calls. /s", "score": 1, "replies": []}]}]}]}, {"body": "I found something mildly cow-related and said fuck it and picked up some contracts. 5/21 $95c on $MOO. If nothing else it's within the current trend line for that ticker and the contracts were cheap.", "score": 6, "replies": [{"body": "Now THAT IS WHAT I’M TALKING ABOUT!!  Buying that shit now!!  Moo muthafucka!! 🐂🐂🐂🐂🐂", "score": 6, "replies": [{"body": "you are very bullish on cows.", "score": 1, "replies": [{"body": "MOOOOO!!!   \n\nActually, my grandfather was a cattle rancher and he had about 200 cattle at any given time...dirt poor otherwise and never could compete with the titans of cattle ranching.  It’s almost impossible to win that game because the big boys don’t need to succeed on the same timeframe as the little boys, so they just wait you out and control the price.  Really tough industry to play in.", "score": 1, "replies": [{"body": "As son of cattle farmer totally agree. Still living in thier farm after my dayjob as accountant going to help them in  any way they can. Its only 10 heads of cattle but they do not have more land or health for more. I suppoet them in work and money. But we know its not profitable as big farmers with hundreds of cows ruling all buyable land. They do it as its they live they dont know anything else", "score": 2, "replies": [{"body": "The one truly good thing IMO about raising cattle is that you have a connection to the land and a surety of one of your three major needs (food) on hand at all times.  I sincerely wish your parents the best and you are a good son to support them how you do!  🍻", "score": 1, "replies": [{"body": "Indeed. Living in farm taught me all survival skill. From firemaking to carpently and farming.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Why wouldn’t  you do $93 expiring in June it’s the same price", "score": 1, "replies": [{"body": "Where are you looking? The June $93c have a $2.60 ask and no bids. There's also zero open interest.", "score": 2, "replies": [{"body": "You’re right, robinhood is shit, I really need to move all my shit over to ToS", "score": 3, "replies": [{"body": "Lol I actually picked those up in Robinhood. Moved most of my money to fidelity but still have some to play with in RH.", "score": 1, "replies": []}]}]}]}]}, {"body": "COW tracks lean hogs and livestock.", "score": 1, "replies": []}, {"body": "Just buy the futures, or CFDs on the futures", "score": 1, "replies": []}]}, {"body": "It literally can't go udders up!", "score": 6, "replies": []}, {"body": "🐂💎💰", "score": 6, "replies": []}, {"body": "I sold one of my calves yesterday for 450 bucks", "score": 7, "replies": []}, {"body": "I love this post!", "score": 5, "replies": []}, {"body": "Step 1: buy futures\nStep 2: buy beef \nStep 3: profit\n r/zerocarb", "score": 3, "replies": []}, {"body": "I would not buy cattle futures unless you are in it for the long. With China telling it's population to cut back on meat by about 50% as well as upcoming Impossible IPO the only direction cattle will go for a little bit is down.   \nSure in the future it will likely be an expense only for the rich but that's a risk. I am a retarded ape tho so it's not financial advice.", "score": 2, "replies": [{"body": "Actually I was thinking it's not for the long term - just for meats to re-adjust with the rest of the agri and softs complex... even cocoa is up. \n\nYeah long term I think meats are going down because exports aren't going to help, and all the Texan farms I pass are heavily preparing for a blockbuster Q3 and Q4... which prob won't happen.", "score": 3, "replies": []}, {"body": "The username makes think this guy is biased.\n\n(![gif](emote|free_emotes_pack|stuck_out_tongue)![gif](emote|free_emotes_pack|sunglasses)", "score": 3, "replies": []}]}, {"body": "Are you Hilary Clinton?", "score": 2, "replies": []}, {"body": "Oh my mooo", "score": 2, "replies": []}, {"body": "Amish apes trying to get bananas lol", "score": 4, "replies": []}, {"body": "You probably could’ve put the ticker somewhere in your post", "score": 4, "replies": [{"body": "/LE is in his screenshot.", "score": 2, "replies": []}]}, {"body": "Its what Hillary would do", "score": 2, "replies": [{"body": "Wow I remember that post.", "score": 2, "replies": []}]}, {"body": "Cattle is being curbed for farting too much and is why alternative meats are taking off as the givernment is activity reducing cattle in the United States. Also,  there’s a wild card here. Cattle and other livestock companies are being drove out for a select few to control the beef. Costs of livestock and raising them is quickly if not already blowing up to where there’s most likely not going to be any new farmers entering this field as they cannot compete with Africa and other countries who are supplying the beef (if it is beef) in the United States. This will be an interesting play to watch unfold over the next few months to years. Additionally I believe Bill Gates is the largest owner of farmland in the USA now and China for some reason is buying up land in the USA including farm land. Gates is working with companies to bring more alternative beef to the plate as they work on the crazy climate change agenda so who knows what changes will be coming soon as is why I’m\nBullish on BYND -", "score": 1, "replies": [{"body": "Gates' farmland is just being rented out to farmers, he's not farming directly. It was a real estate investment. It's unrelated to the alternative beef work he's doing.\n\n[Source](https://www.reddit.com/r/IAmA/comments/m8n4vt/im_bill_gates_cochair_of_the_bill_and_melinda/grid8pt/)", "score": 3, "replies": [{"body": "Yes, but what are those farmers farming?", "score": 0, "replies": [{"body": "whatever they want, mostly, as long as it grows in that particular part of the country", "score": 3, "replies": [{"body": "It’s mainly for seed and biofuel “science”.  Plant proteins are going to be a major development IMO as they’re working toward a global market especially on USA and China", "score": 0, "replies": []}]}]}]}]}]}
