{"title": "Google Could Acquire Tesla For $1,500 Per Share On Its Way To $2 Trillion Stock", "selftext": "", "id": "f1q1hp", "created_utc": 1581340025.0, "score": 34, "upvote_ratio": 0.72, "num_comments": 84, "comments": [{"body": "[deleted]", "score": 168, "replies": [{"body": "[deleted]", "score": 30, "replies": [{"body": "Would it even be his decision, does he hold a majority of the stock?", "score": 3, "replies": [{"body": "Above 20%, so he only needs 30% of the other investors to be on the same page to pass any decision", "score": 15, "replies": [{"body": "And I'm pretty sure he'd get much more than 30% of the other investors on board if he says he's leaving if they vote to sell to Google.", "score": 25, "replies": []}, {"body": "we forgot that tesla workers and elons first partners (and alies) together own at least 50%\n\nthere is no danger", "score": 2, "replies": []}]}, {"body": "I thought Telsa operated on a super majority and need 67% vote for anything. With Elon's 20%, Ron Baron, Larry Ellison, Ballie Gifford and other insiders it doesn't take much to to get to the 34% vote the can squash anything Elon doesn't want.", "score": 4, "replies": [{"body": "right 100% elon+top employees, and a hand full off the guys (his friends and alies) you mention is enough.\n\nI would say the company is under control, no metter who buys shares in it -elon and elons team are in 100% control here .", "score": 2, "replies": []}]}]}]}, {"body": "Yeah hard pass, tho the article is vaporware anyway. I would however not be against some kind of partnership regarding NN/AI if Tesla keeps the IP, not sure which form it could take without diluting tho or if Google even has grey matter (or computing power) to spare either.", "score": 6, "replies": [{"body": "I think Google has much more to gain from a partnership like that than Tesla would.", "score": 7, "replies": []}]}, {"body": ">Typical Forbes mal-informed fluff piece published to show something, anything, preferably misdirecting people from the facts  \n>  \n>First, Elon Musk has specifically said they have all the capital they want, and the only constraint is the difficulty of finding engineering talent of required caliber.  \n>  \n>Second, Tesla is NOT producing high end cars for the sake of it, they are producing them in order to fund lower priced cars, which is going according to plan, re new Chinese R&D center tasked with the next Z car.  \n>  \n>Third - Tesla is already producing cars as fast as is feasibly possible - witness Shanghai, Berlin Giga factories, and Texas next .. that's already insane warp speed. Money helps, but at this point would only gum up the works. Better solution would be to clone Elon \\\\s", "score": 4, "replies": []}, {"body": "Nice try Google.", "score": 3, "replies": []}]}, {"body": "hahaha. thanks for the laugh Forbes. Elon needs a laugh on his busy day. Buying what will be the largest company in the world on a discount. Those bright people at Forbes coming up with clever ideas everyday.", "score": 54, "replies": []}, {"body": "Tesla will be able to buy Apple one day.", "score": 20, "replies": [{"body": "in 4 years", "score": 1, "replies": []}]}, {"body": "Posting the link is not a endorsement!", "score": 41, "replies": []}, {"body": "So many reasons this won't happen. Elon isn't building Tesla to sell for a profit. He has a vision and mission for this company that's greater than profit.", "score": 37, "replies": [{"body": "Yup this is the main thing and that Tesla doesn’t need anything from google.  It self sufficient now.  If it wants goggle talent it can pay for it now.", "score": 7, "replies": [{"body": "They may need self driving help, am I wrong?", "score": 2, "replies": [{"body": "Yes you are wrong.", "score": 1, "replies": [{"body": "I really hope so too. But I'd be disappointed if it ended up to be that Tesla took a long time to get there, and it all could have been sped up with Google's help.", "score": 1, "replies": [{"body": "They are totally different approaches.   Googles approach is simpler.  If anything google could use Tesla’s video based AI tech.", "score": 1, "replies": [{"body": "It's not about approach. It's about new engineers, facilities, resources, assets, etc.", "score": 1, "replies": [{"body": "Well it is about approach because the types of engineers, facilities, resources and assets need are different depending on the approach.", "score": 1, "replies": [{"body": "Google are so big, I'm sure they could accommodate properly if they really wanted.", "score": 1, "replies": [{"body": "...could. But why would Tesla want to?  I agree google would have gain but I don’t see what Tesla would get.", "score": 1, "replies": [{"body": "It depends all on Elon's personal goal. Does he want to bring autonomous faster to an average consumer? If he's ok with his pace, then they have nothing to gain. It's just, in my peasant opinion, it's going to take very long for Tesla to do it alone.", "score": 1, "replies": [{"body": "Google would not be faster to the average consumer.  Waymo is not to the average consumer.  Tesla is targeting the average consumer and they have the resources needed for it already.  They have 6 billion in the bank and are continually developing the dojo and other training parts...along with a rewrite of the code.  Elon said they were already spending money has fast as they could intelligently.\n\nI am still confused why you think google has more or better applicable stuff.", "score": 1, "replies": [{"body": "> I am still confused why you think google has more or better applicable stuff.\n\nIt's just I heard that tesla is hiring, and having access to a giant pool of very talented engineers doesn't hurt. Plus, again my peasant opinion, LIDAR will still be needed eventually.\n\nAlso, more of minor things at this moment, but will be crucial once self driving becomes real: Google has an excellent voice control assistant, Tesla depends on Google for Maps, Google offers a ton of other services like Shopping, news, search, messaging, Play Store, Gmail, Android, etc. Once people will have the luxury not to focus on the road, they will be free to do all this other stuff.", "score": 1, "replies": [{"body": "To your first part...Tesla can hire from google if they wanted.\n\n2nd part Tesla would want their own thing to make money off of.  An App Store for instance.   Plus they like to be vertically integrated.  There is a reason they don’t use CarPlay or AndroidAuto.", "score": 1, "replies": [{"body": "If Tesla would be vertically integrated, their software products will be confined to their cars. \n\nIn the future, as more and more things go digital, people will want a seamless digital experience in every aspect of their lives. Amazon/Apple/Google will be turning towards the automotive industry for full integration.", "score": 1, "replies": [{"body": "Why do you say it will only be in their cars?   I am not sure how you have any evidence of that.   They already have an app that connects to the car, solar,Powerwall.  New home Charger is WiFi.   If they wanted to why couldn’t they do home integration?", "score": 1, "replies": []}]}]}, {"body": "And to this very important point, LIDAR is completely unnecessary to solve self driving. This is clearly still up for debate, but Tesla has already developed the visual learning system to create a digital 3D environment using only cameras. Watch the lectures by Andrew Karpathy and focus on some of the stuff Elon says in the thirdrowtesla podcast about 3D vision.\n“Progress disappoints in the short term but surprises in the long term.”  As soon as the hype around autonomy dies down, Tesla will release their functional full self driving and it will blow your freakin mind.", "score": 1, "replies": [{"body": "The thing with LIDAR that I heard is that you can put it on objects that are outside of the car as well, which may communicate with cars and really help them \"see better\" in their area. But as you say, maybe Tesla wouldn't even need that kind of vision reassurance.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "I’ve done a lot of research on this but I am pretty dumb...  I believe that Tesla has a huge advantage in terms of the amount of data that they have access to. However, they do not have the ability to store all that data. If they had google’s quasi-unlimited storage capacity, their machine-learning system would learn how to drive quicker. So, you are right to say that google has some assets that would be valuable to Tesla’s goals. However, if google does not acquire Tesla, Tesla will be the first to market with autonomy and will make multiple trillions of dollars by themselves. In other words, google would have to pay a lot more than $1,500 a share to buy Tesla because Elon expects Tesla to be worth we’ll more than a couple trillion dollars.", "score": 1, "replies": [{"body": "> if google does not acquire Tesla, Tesla will be the first to market with autonomy\n\nYeah I think that this is undeniable. It's just, up to Elon on how long they want to take, even with them being the leader inevitably.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I don’t see how this benefits TSLA, they’re bounds ahead of GOOGL with autonomy", "score": 27, "replies": [{"body": "Based on what? Everything I’ve read says waymo is much more capable than Tesla’s FSD with the caveat that it uses expensive LIDAR and only operates in certain areas. I’ve never heard anyone say Tesla is categorically better... I believe in the visual based approach and I think Tesla has a good chance to overtake waymo. But no one is making the argument Tesla is “bounds ahead of google” on autonomy.", "score": -5, "replies": [{"body": "Hahaha.  You just mentioned the two biggest problems.  1 cost to have a large fleet(cost is coming down though) and having to be kept on strict routes and areas.   You could say waymo is farther ahead if the goal is to do a demonstration.  But I would argue Tesla is farther ahead for wide scale adoption which is where the money is.", "score": 20, "replies": []}, {"body": "Lidar costs are falling rapidly. I’ve seen some sensors under $100. With the potential of robotaxis the sensor costs will be a rounding error in profitability.", "score": 3, "replies": [{"body": "LIDAR costs where never a problem for robotaxis because even at $50k per car it would still be profitable.", "score": 4, "replies": []}, {"body": "I thought those $100 lidar were short range ones. You would still need long range ones I thought and those are probably still expensive", "score": 1, "replies": [{"body": "The $100 lidar has a narrow field of view and poor resolution. It may be useful for some applications where you want to create 3d models of some stuff that is not moving. Not very useful for self driving cars.", "score": 3, "replies": []}]}]}, {"body": "Last month I drove 3 hours in my model 3 without touching the steering wheel or the pedals on the highway", "score": 1, "replies": []}, {"body": "You must be reading a lot of trash then 🤷‍♂️", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -3, "replies": [{"body": "Depends on how you measure it. Google could be ahead objectively in a head to head with the tech right now but behind in the sense of who is gonna get to commercial lvl 5 first.\n\nI tend to think this stuff is still 3+ years off maybe substantially more but that Tesla almost certainly gets there first. Until the software works, who is ahead doesn't much matter and might even be ahead in the wrong ways.", "score": 1, "replies": [{"body": "They'll be commercial level 5 the moment they start charging for rides without any drivers. Even if its in a geofenced area. And that will happen this year.", "score": 1, "replies": [{"body": "They were going to drive cross country without driver intervention and decided not to because the exercise was a contrivance that had little long-term merit. Whether they decide to do a highly curated lvl 4 geofenced experiment will depend on whether there is something they can learn from it. I don't think they will do such a thing simply to convince naive customers and investors that they are winning or near full autonomy. That's more GM territory.", "score": 1, "replies": [{"body": "Its divide and conquer. They will expand and grow the geofenced areas but no reason they can't already start pulling in revenue.", "score": 1, "replies": []}]}]}]}]}, {"body": "> they’re bounds ahead of GOOGL\n\nAnd still bounds behind, in full scope of things. TSLA being a leader doesn't mean they'll reach full autonomy faster. it just means they'll be the first ones to do it. \n\nAnd what's Elon's goal? Be a market leader, or bring this technology faster to regular people?", "score": -1, "replies": []}]}, {"body": "[deleted]", "score": 26, "replies": [{"body": "This.", "score": 4, "replies": [{"body": "I disagree with Apple's intentions...", "score": 3, "replies": []}]}, {"body": "I remember Apple trying in 2013.   Elon had no comment regarding the meeting with Apple.  But I would guess he did not agree to the terms of having Apple completely run the show.", "score": 1, "replies": []}]}, {"body": "Everyone is dismissing this out of hand. It depends on how much Musk would rather focus on SpaceX. He's flat out said many times he didn't want to run Tesla. At $1,500 per share, this would give Musk roughly $51 billion that he could further sink into SpaceX and an easy out in terms of stepping down as CEO of Tesla. \n\nI fully get the sentiment. I'm long Tesla and plan on holding for at least 10 years. I'd much rather see Musk run the company for the next 20 years than the company be acquired.", "score": 13, "replies": [{"body": "He said that in the earlier years before Model 3.  I bet now that he’s put so much of blood, sweat, and tears into getting over the Model 3 hump, that he doesn’t want to hand over the keys to his baby to anyone yet.  And there are more exciting things he probably wants to see thru like battery step change, robotaxi, and GF4.", "score": 2, "replies": []}]}, {"body": "If Elon were to sell his baby, which i don't thin he ever would it would be for wayyyy more than this low ball offer.", "score": 4, "replies": []}, {"body": "The best thing about this pure-speculation article is how it further displays the foundational assumptions and framing that random financial types have about Tesla.\n\nThe assumptions about Tesla here remind me of similar assumptions that I consider to be false, such as the EV market remaining a tiny percentage of total vehicle market for many years and hence competition will eliminate Tesla rather than just add to total market.", "score": 4, "replies": []}, {"body": "Nah. Zero chance", "score": 3, "replies": []}, {"body": "Can't they just buy enough (public) stocks to take control?", "score": 5, "replies": [{"body": "I for one would never sell at that price. But I will make bank with options with the spike it causes if they attempt to do it.", "score": 6, "replies": []}, {"body": "Depends on the amount of float there is. Also once they own a certain percentage of the shares they would have to announce. Also as the float get bought up, it drives up the price of what is left.", "score": 3, "replies": []}]}, {"body": "So, this is Forbes saying Tesla is worth at least 1500…", "score": 3, "replies": []}, {"body": "Elon would be crazy to accept that.", "score": 3, "replies": []}, {"body": "I’m not selling my shares below 20k. Good luck with that!", "score": 3, "replies": []}, {"body": "I believe that for eternity battery tech was held back by big oil, and that Tesla staying independent is only way to see big gains in near future. I really really hope Tesla never gets sold.", "score": 2, "replies": []}, {"body": "Stock went up > 6% in pre-market, so this wasn't 'FUD' and there is no reason to complain to the SEC, right?", "score": 1, "replies": []}, {"body": "Google would be better off acquiring Rivian at this point.", "score": 1, "replies": []}, {"body": "Lol, there's no way Elon lets this happen. He wants more control, not less. And definitely doesn't want to be answering to Sundar.", "score": 1, "replies": []}, {"body": "Hmmm will Elon sell his baby for 250B vs its current 130B when he believes it's going to be a few T? (X)doubt.", "score": 1, "replies": []}, {"body": "Bahahaha", "score": 1, "replies": []}, {"body": "There's precious little on this list for things Tesla gets out of the deal. I don't think Google's engineers would add much and they don't need the cash", "score": 1, "replies": []}, {"body": "I hope Elon doesn’t sell. Google would kill his vision. Look at Waymo and their approach to solving FSD issues.", "score": 1, "replies": []}, {"body": " GOOGL suck, they can't even make a good mobile phone. \n\nAdded a radar on Pixel 4 for what?\n\nNothing other than making you swipe your hand like an idiot. \n\nGOOGL engineer seem to be have no plans and do not know what they should do", "score": 1, "replies": [{"body": "Somehow their engineers know how to make products that generate $40-50B in profit/cash flow and serve billions of people with almost no downtime and without breaking a sweat.", "score": 1, "replies": [{"body": "*what idiots*", "score": 1, "replies": []}]}]}, {"body": "Geee imagine that happening and Elon becoming CEO of Google. It would be awesome!\nGoogle has most likely the most fandom for Elon and Tesla after Tesla and SpaceX. I know, I'm one of them", "score": 1, "replies": []}, {"body": "Typical Forbes mal-informed fluff piece published to show something, anything, preferably misdirecting people from the facts\n\nFirst, Elon Musk has specifically said they have all the capital they want, and the only constraint is the difficulty of finding engineering talent of required caliber.\n\nSecond, Tesla is NOT producing high end cars for the sake of it, they are producing them in order to fund lower priced cars, which is going according to plan, re new Chinese R&D center tasked with the next Z car.\n\nThird - Tesla is already producing cars as fast as is feasibly possible - witness Shanghai, Berlin Giga factories, and Texas next .. that's already insane warp speed. Money helps, but at this point would only gum up the works. Better solution would be to clone Elon \\\\s", "score": 1, "replies": []}, {"body": "Not likely - Dont give them clicks.  \nGoogle cant even manage to come up with a consistent SMS Application, imagine trying to tell Elon what to do lol", "score": 1, "replies": []}, {"body": "Yeah right. Elon and I won't sell out", "score": 1, "replies": []}, {"body": "Is there a list of the largest shareholders? Doesn’t Elon only own something like 20% of Tesla?? I’m concerned about the possibility of a hostile takeover attempt in the future. Would also be good to know just what percent of Tesla shares are being actively traded", "score": 1, "replies": []}, {"body": "and then google would F\\^$#%\\^$ it up like they did youtube's corporate side.", "score": 1, "replies": []}, {"body": "I’m sorry, but I hate google. It’s an evil company plain and simple.", "score": 1, "replies": []}, {"body": "Market manipulation at it's finest.", "score": 0, "replies": []}, {"body": "It should have been apple. I think it is too late now. How many 150b$ companies get acquired? This is like a giant telco merger but they merge to reduce redundancies which isn't the case here.", "score": 0, "replies": []}, {"body": "Fuck off google dont need you. Dont want you.", "score": 0, "replies": []}]}
{"title": "Major Chinese Cities Return to Work, Cautiously", "selftext": "Cities like [Shenzhen, Shanghai and Beijing](https://www.scmp.com/news/china/society/article/3049740/chinese-cities-keen-get-back-work-coronavirus-concerns-grow) will return to work amid the coronavirus outbreak, although schools and universities will remain closed until further notice.\n\n> Companies that did reopen their doors must ensure their workplaces were properly ventilated and avoid using centralised air conditioning systems because they could help spread the coronavirus, the government said.\n\n> To help with the massive influx of people back into the city, 16 checkpoints have been set up at the Hongqiao transport hub in central Shanghai, which links the airport to the intercity high-speed rail network and local subway network.\n\n> On workdays, between 1.2 million and 1.5 million pass through the hub. Authorities in the city said they were alarmed that more than 100 people passing through the Hongqiao hub in the last few days had had a fever.\n\n>Several major employers in Shenzhen have already announced they will not be restarting production on Monday.\n\n> Foxconn, a contract manufacturer that produces iPhones for Apple, told its employees not to return, and has even refitted some of its production lines to make face masks for its workers.", "id": "f1i60f", "created_utc": 1581295224.0, "score": 118, "upvote_ratio": 0.95, "num_comments": 87, "comments": [{"body": "Put a bunch of people back in a factory together because they couldn't afford to not have them working? This literally can't go tits up.", "score": 163, "replies": [{"body": "It’s ok. The CCP has the people’s best interests in mind.", "score": 57, "replies": [{"body": "So does Tesla", "score": 8, "replies": []}]}, {"body": "priced in", "score": 7, "replies": [{"body": "How? if the markets are at highs?", "score": 11, "replies": [{"body": "They could be at higher highs", "score": 28, "replies": [{"body": "The lower high priced in the higher high.", "score": 3, "replies": []}, {"body": "The only higher high is the amount of fuckin weed tu_test_bot is smokin", "score": 1, "replies": []}]}]}]}, {"body": "Literally everything's fine. All my companies facilities are pretty much clean rooms. Nobody in there is going to spread it to anyone trust.", "score": 2, "replies": [{"body": "Except the people in the chain that have to ship the shit.", "score": 7, "replies": [{"body": "Yeah really lacking low skill labor in the workforce. Maybe if it kills enough people it will help out with our unemployment problem in the states.", "score": -1, "replies": [{"body": "Who do you know wants a job and can’t find one?", "score": 1, "replies": [{"body": "I don't know anyone but unemployment exists.", "score": 1, "replies": []}, {"body": "Himself probably", "score": 1, "replies": []}]}]}]}]}]}, {"body": "What a fucking terrible decision.", "score": 77, "replies": [{"body": "Can't tell if this is a shit post, but can we really expect one of the world's largest and fastest growing economies that literally every other economy massively relies on to just come to an indefinite grinding halt?\n\nIt would kill more people than this dumb virus ever would", "score": 5, "replies": []}, {"body": "For bears.", "score": 32, "replies": [{"body": "This isn't about the market jackass. How many people do you think will get sick and die because of this decision?", "score": 14, "replies": [{"body": "This is wsb, everything is about the market. You must be a bear?", "score": 69, "replies": []}, {"body": "Well, a lot", "score": 35, "replies": []}, {"body": "> sick and die because of this decision?\n\nnot many, the death rate isn't that high and most of the deaths have been elderly/people already unhealthy.\n\nunless these factories are full of diabetic 70 year olds...", "score": 6, "replies": []}, {"body": "I mean it’s China there’s literally 2 billion bullets in the chamber", "score": 5, "replies": [{"body": "Damn that's dark\n\nI mean, it's true, but dark.", "score": 1, "replies": []}, {"body": "Imagine FDs were 90 days. Imagine how your frame of reference would change as a result. You wouldn't be thinking about 'today' or 'this week,' you'd be thinking about months from now.\n\nTry it. Do some quick math, and think 90 days ahead. How many deaths do you think there are likely to be, and where?", "score": 0, "replies": [{"body": "America is a different beast dude, the day we get a pandemic the world is over", "score": 5, "replies": [{"body": "I agree if this was happening in the US there would be much more world-wide panic, but you are overly discounting Chinese importance. They have a global GDP of 17% that's #2 behind the US, if they come to a halt for a month or two we will all feel it.", "score": 6, "replies": [{"body": "That 17% matters to the world only if they can get a piece of it. When it is all walled up, like it is in PRC, it is not that big a deal. Then, only the trade volume matters, and there when the Chinese lose other emerging countries win.", "score": 9, "replies": [{"body": "What? Bro stick to TSLA calls/puts.", "score": -1, "replies": []}]}, {"body": "Piece of shit country.", "score": -1, "replies": [{"body": "Thanks for adding to the discussion.....", "score": 1, "replies": []}]}]}, {"body": "Agree to disagree, homie. This is going to get much, much worse.", "score": 4, "replies": [{"body": "I hope your dumb bear ass bought puts", "score": 8, "replies": []}, {"body": "If China stops all production then the repercussions for the CCP might be worse then them dooming their citizens", "score": 3, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": -3, "replies": [{"body": "This is the same retarded statement spewed in this sub. I could go on about the much higher mortality rate, the rate of spread, and the supply chain implications if this increase. Im in calls and puts cause ik this market is retarded. \n\nBut you wouldn’t listen cause StOnKs OnLy Up", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "You literally said “like someone having the flu” retard\n\nAnd you actually believe China’s official numbers too lmao", "score": 6, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Lmaoo. Can’t win an argument with any critical thinking skills and goes back to the bear insult when I’m not even a bear. I buy puts and calls to make money, not 1 side", "score": 1, "replies": [{"body": "I don't think gay boi is an insult on this sub, it's kind of a given", "score": 3, "replies": []}]}]}, {"body": "The US didn’t shut down their workforce with 50 million infected and 12k dead to h1n1 but it would be a problem for you if China decided to get their workforce back to work after their annual break.\n\nYou’re touting critical thinking and calling bullshit on China numbers but you wouldn’t even consider the rate of spread and mortality in other countries who are much more open about their health statistics LMAO", "score": 3, "replies": [{"body": "Ah yes. Comparing the most advance country in the world with the best healthcare infrastructure to 2nd and 3rd world countries. 500iq", "score": -6, "replies": [{"body": "Most advanced country with the best healthcare infrastructure according to which ranking? This site is fucking dumb in general but you’re something else. \n\nThe USA don’t even come close to Singapore, Germany, Taiwan or Japan in healthcare and they are pretty good at keeping mortality and infection rates under control. Use those numbers if you actually want to keep yourself informed. H1N1 was a fucking disaster in the USA but obviously stonks only go up.", "score": 2, "replies": [{"body": "What I meant from healthcare infrastructure is the capabilities and advance healings. Obviously counties in Europe, Japan, etc could have a better infrastructure due to their population and country size. But in terms of doctors and medicine, USA would be the best. \n\nI have been to many Asian countries, China, Singapore, Japan and those statistics you pull from websites don’t mean shit. The best possible care for serious conditions is the US. \n\nI’m didn’t say the best at handling infections.", "score": 0, "replies": [{"body": "So you wanna double down on being fucking retarded, as if having the “best doctors and medicine” mean shit when it comes to fighting infectious diseases. These countries didn’t even flop anywhere near as hard as the US during h1n1, I’m sure they’ll keep a lid on this shit too.", "score": 3, "replies": [{"body": "Hey fucktard, stop being so full of yourself and read the response. Im fucking arguing about healthy infrastructure in general not the handling of infectious disease. \n\nYou changed the topic from my original comments on China to other countries healthcare rankings which has nothing to do with what I said. The population density and health standards in China is dirt fucking levels compared to the US\n\nIf you fucking think the US handling is bad, wait till we get the real numbers from the cluster fuck from China. You probably never left your fucking room and spew internet numbers and BS without real world interactions. I’ve been to China, HK, and in the region.", "score": 1, "replies": [{"body": "I’ve been to the fucking states too what’s your point? Lmao typical neckbeard who’s in a bubble thinking that getting off a plane means you’ve seen shit. My point was pretty clear in the beginning but you’re bringing in “best doctors and medicine” as if that’s any relevant so I’ll break it down for you.\n\nEveryone knows that China is under reporting shit, either deliberately or because they’re overwhelmed to the point where they can’t keep track or both. Their hospitals are full and anyone else who needs serious medical attention will probably die as a result too. Getting their workforce back to work was still the right thing to do. The CCP acted reasonably fast this time, I mean sure they could have done it even before CNY eve but their response has been praised by WHO and I wouldn’t be surprised if this disease blows over in half a year. If you’re so sure that China’s going to depopulate and bring equities down then please post puts or gtfo instead of claiming some insight into things you don’t understand.", "score": 1, "replies": [{"body": "Lmao you’re so full of yourself you don’t read my response so I’m done talking. Maybe you’ll notice that I was born outside the states and have been to many Asian regions, China, the state’s, Canada, etc. but nah keep getting mad and thinking your right lmfao.\n\nAnother retard who didn’t read the original statement of me holding short term calls and long term puts lmao I’m done with your clown ass", "score": 0, "replies": [{"body": "Nono please come back and post your positions you fucking pussy. You think that you’ve been to many Asian regions and that makes you fucking special and insightful LMAO.\n\nYou’re talking about “implications” on the supply chain and mortality rate while the government got their workforce back to work on time with other countries showing that thus far the deadliness of this disease is overblown. It’s obviously going to be worse with China but they’re still better prepared compared to back during the SARS and H1N1 periods.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "> I didn’t compare it to the flu dungus fucktard\n\n>  it’s like someone having the flu\n\n#bull(shit) logic", "score": 1, "replies": []}]}]}, {"body": "If you believe China. Which you should not", "score": 3, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Literally twice that number of people die from car accidents in China daily. China gets a new disease outbreak every few years, world hasn’t ended yet.", "score": 3, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Every disease outbreak gets worse. Then a month later, it’s fixed, and everyone forgets about it. The real retards are anyone who thinks Coronavirus is any different than all the other disease outbreaks in recent memory. China literally did the same “build a hospital in a week” thing for fucking SARS in 2003.", "score": 3, "replies": [{"body": "[deleted]", "score": -1, "replies": [{"body": "Lmao your username is literally “buy GE”, fucking boomer stock. Go change your diaper grandma.", "score": 6, "replies": []}]}]}]}]}]}]}, {"body": "Do you know where you are?", "score": -1, "replies": []}, {"body": "Who cares? They're just a resource.", "score": -2, "replies": []}]}, {"body": "Not hardly. This means the virus will potentially get to spread further. Economic catastrophe potentially.", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": 11, "replies": [{"body": "Yup, I’ve been to the “clean room” factories and they’re still elbow to elbow.", "score": 1, "replies": []}]}, {"body": "What if this virus was created by a Chinese grade schooler that just wanted one day off from school but now it's gotten out of hand?\n\n(Schools closed until March last I heard)", "score": 23, "replies": [{"body": "Sounds like he'd be smart enough to work instead -- oh wait, all the jobs are now shut down...now, how'd that happen?", "score": 2, "replies": [{"body": "Buellish", "score": 2, "replies": []}]}, {"body": "Kids all over the US are googling \"How do you catch a bat?\"", "score": 1, "replies": []}, {"body": "Cylons", "score": 1, "replies": []}]}, {"body": "BTFD", "score": 4, "replies": [{"body": "what dip? our calls r good", "score": 1, "replies": []}]}, {"body": "Make sure I got this right, people can have few symptoms for 2-14 days (the case in Germany the Chinese woman reported,  the few days she was there taking pain meds for muscle pain and general lethargy) then will get sick for upwards of of a couple weeks? \n\nAlso it can be spread through contact or just inhaling the virus from a nearby infected person (who I assume would need to breath or cough?).\n\n\nYup what could go wrong with throwing a couple million people in confined spaces (couple million to start, tens of millions with a week or two)", "score": 11, "replies": [{"body": "Great let’s have more people get sick.\n\nThis might be the final blow to the CCP. Lives will be sacrificed but for the greater good. Muslims will be freed from Xinjiang camps and Hong Kong will achieve universal suffrage and get their human rights back.", "score": 6, "replies": [{"body": "This is far from a final blow to the CCP. This may slightly reduce their power in the short term but rest assured their human rights violations will continue for another 100 years.", "score": 3, "replies": []}]}, {"body": "Also, I don't think we have to worry about some Chinese person, who potentially doesn't have much money saved or spent that money during the last two weeks of quarantine, and needing to go to work even though they may or may not feel unwell....", "score": 0, "replies": []}]}, {"body": "$AAPL gonna drop short term get ready to pick some up on the cheap.", "score": 7, "replies": [{"body": "Yup sold all my AAPL shares (I got in at 300). \n\nFigured it will dip in the short term.", "score": 2, "replies": []}]}, {"body": "Great. All I care is monday is green... I'm going to hell aren't I?", "score": 7, "replies": []}, {"body": "Cash gang", "score": 7, "replies": [{"body": "Cash ban", "score": 2, "replies": []}, {"body": "Gold gang", "score": 2, "replies": []}, {"body": "Lick my gooch, pussyboi", "score": 1, "replies": []}]}, {"body": "Market 30,000 here we come", "score": 2, "replies": []}, {"body": "Luckin Coffee took a nose dive, I assume the outbreak shut down Luckin Coffee Spots but the price climbed back up. Stupid virus dropped LK from $50 to $35! On top of a company scandal! I am surprised that the whole company hasn't tanked completely!!", "score": 1, "replies": [{"body": "Liquidity injections are a powerful thing", "score": 2, "replies": []}]}, {"body": "People going back to work but \"all public places\" are closed:\n\nhttps://www.reddit.com/r/China_Flu/comments/f1kh2t/breaking_beijing_closes_all_public_places/\n\nMake up your damn minds son.", "score": 1, "replies": []}, {"body": "This makes me think short term bull since it sounds like business is back to usual, but the risk is this jump starts the beer spread all over again because it just takes one individual who is sick and needs the money to live. How many of these people do you know show up to work sick? Now imagine this at the scale of China's population and density.", "score": 1, "replies": []}, {"body": "Whoa whoa whoa. Sure I want my iPhone but not with bits of killer virus in it.", "score": 1, "replies": []}, {"body": "fake news", "score": -2, "replies": []}]}
