{"title": "China PMI just out, worse then 2008 crisis.", "selftext": "https://www.scmp.com/economy/china-economy/article/3052985/coronavirus-chinas-factories-activity-plunges-all-time-low\n\nChina’s official manufacturing purchasing managers’ index (PMI) dropped to 35.7 in February from 50.0 in January, below 38.8 figure reported in November 2008\n\nThe non-manufacturing PMI – a gauge of sentiment in the services and construction sectors – also dropped to 29.6 from 54.1 in January, the lowest since November 2011\n\nWithin the official manufacturing PMI, China’s export order sub-index dropped to 28.7 from 48.7 in January, while imports fell to 31.9 from 49.0.\n\nBloomberg and average esimate is around 45,it seems people are still underestimating the scale of the problem and monday should be a red day again.\n\nAlso someone with beer virus you should get a ride on AAL flights to Las Vegas, have fun at those CZR and WYNN casinos and stay for the weekend, remember to buy pus tho :)\n\n\nEdit 1: Since this is not a normal financial dysfunction but instead a physical crisis, this should tell us that the global supply chains where things are being assembled in china are collapsing, this is the first real crisis companies in the world truly faced since 2008 in a more globalized world then ever, so have fun guys. \n\nEdit 2: Those bear fur are very fluffy and cozy now , im just gonna sleep on it for a while\n\nEdit 3: https://www.reddit.com/r/China_Flu/comments/f94eq3/my_impressions_from_shanghai_china_one_month/?utm_medium=android_app&utm_source=share \n\nyou could see this post for some insights on how china is still at wartime status, factories/transports are still shut down.\n\nEdit 4: Gay bulls seems to not realize that the pmi reported today is worse then 2008, which is a new record low and the dow just down 13% from peak which is only back to 2018-2019 prices. \n\nShanghai index from 6000 at peak drops to 2000 in 2008 ,btw.", "id": "fb5smu", "created_utc": 1582943136.0, "score": 191, "upvote_ratio": 0.96, "num_comments": 82, "comments": [{"body": "You know shit is getting real when fake ass made in China numbers are low", "score": 237, "replies": [{"body": "That means the real number might actually be in the 10s.", "score": 70, "replies": [{"body": "It might even be in the -10s!", "score": 9, "replies": [{"body": "Hell, China might not even be real, but a thing made up by savy Japanese buisness men!", "score": 7, "replies": []}]}]}, {"body": "Yeah wtf they basically make these up and they’re still fucking terrible....this is pod racing if I’ve ever seen it", "score": 28, "replies": []}, {"body": "Haha, they are definitely sandbagging.", "score": 9, "replies": []}, {"body": "Instead of buying calls, bulls should start buying some lubes.", "score": 4, "replies": []}, {"body": "Lmao like this number matter\n\nChicken Fuckers 🐔", "score": 7, "replies": []}]}, {"body": "[deleted]", "score": 52, "replies": [{"body": "I like lentils tbh", "score": 25, "replies": [{"body": "Lentils with ground beef and rice is the shit", "score": 10, "replies": [{"body": "see mujadara", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "No u", "score": 8, "replies": []}]}]}, {"body": "[removed]", "score": 7, "replies": [{"body": "Mmm...sodium", "score": 1, "replies": []}]}, {"body": "Potatoes, unless your irish.", "score": 3, "replies": [{"body": "Ah the Irishman’s dilemma...\n\nDo you eat the potato now or wait for it to turn into vodka first?", "score": 3, "replies": [{"body": "Mother?", "score": 1, "replies": []}]}]}, {"body": "Have you tried deez?", "score": 2, "replies": [{"body": "I prefer almonds", "score": 1, "replies": []}]}]}, {"body": "but but but.... that's manufacturing! Surely Chinese services are still a go?\n\nEdit: LOL JUST KIDDING\n\n>The non-manufacturing PMI – a gauge of sentiment in the services and construction sectors – also dropped to 29.6 from 54.1 in January, the lowest since November 2011", "score": 26, "replies": [{"body": "Manufacturing PMI is a bit skewed. LITERALLY They were manufacturing less than 50% of what they were because they had to stay at home. It’s not because they didn’t have the orders etc", "score": 3, "replies": [{"body": "Btfd", "score": 1, "replies": []}]}, {"body": "Plenty of room to go back up once this all blows over next week", "score": 1, "replies": []}]}, {"body": "Oh please oh please do a 5% limit down Sunday evening.", "score": 13, "replies": []}, {"body": "Bat aids was the gift from god China was waiting on one of the unintended consequences of the one child policy was that now there are way more old people than young and the young aren’t having many children if at all.  The Ponzi scheme needs fresh workers to pay for the old so what do? You engineer bat aids to have a severe enough symptoms to take out 1/5 to 1/4 of everyone over 75 this allows the ponzi to keep going a few more decades.", "score": 36, "replies": [{"body": "I think their saying now the virus originated from armadillos or anteaters", "score": 7, "replies": []}]}, {"body": "Hahahah. RIP bulls. If you went long today you’re a fucking dumb ass. 🤡🐃💀🙏🏻\n\nGUH!!!", "score": 21, "replies": []}, {"body": "That’s is great news for my YUMC pits!", "score": 10, "replies": []}, {"body": "Oh we’re fucked fucked huh?", "score": 9, "replies": [{"body": "Just gay bulls, bears are fluffy now again.", "score": 12, "replies": []}]}, {"body": "Fuckers lie all the time and they try to crash the markets on purpose?\n\nFfs get to the printers.", "score": 6, "replies": [{"body": "They trying to make some money by buying the dip.", "score": 4, "replies": []}]}, {"body": "Got word today from supplier with direct contact to China factory.  40% of workforce was under quarantine.  Gov gave them ok to get rolling again. They were starting to get things back up and running today turning on equipment. (Metal casting forging and heat treating).  I was told they plan to be near 100% staffed Monday and parts are only delayed 2weeks.  I'm in on calls further out.  This will blow over like a fart in a hurricane. V shape recovery incoming.", "score": 5, "replies": [{"body": "Yeet.\n\nThis is good for my calls, finally.", "score": 2, "replies": []}]}, {"body": "Earlier in the week, I had a post talking about how I had it all figured out — but mods censored my lukewarm autism.\n\nBasically, it was a rant about how the Chinese are the real winners here, because they just cut off all information and make things look ok, but not prohibitively bleak while everyone else panics, the government controls market sell offs. The Chinese Government can shakedown billionaires to keep their bond market stable, whereas the US bond market is fraught with so much hesitation bonds issuance has slowed a lot this week. \n\nBut for China: This is bad to acknowledge, and we should assume that it’s worse in reality. \n\nThis goes out to our homies who got absolutely fucking torched in the last 15 minutes today by bulls. You were right, people with more money than you were just retarded.", "score": 7, "replies": []}, {"body": "Last support on NASDAQ, Dow and S&P already broken.", "score": 5, "replies": []}, {"body": "Don’t you know this is nothing like the 2008 crisis. SPY will be back at 325 on Monday obviously 😂", "score": 20, "replies": [{"body": "325 monday then 270 Tuesday, then 315 Wednesday, then trump closes markets Thursday then Tesla 6000 Friday, then Bynd headquarters gets nuked over the weekend and we gap up 20 dollars next Monday.", "score": 29, "replies": [{"body": "Ohhhhhh right right right. Wait I thought we all blast off on SPCE’s ships to mars the next Monday. Guess I got my days mixed up", "score": 7, "replies": [{"body": "Is it 2025 already? Fuck", "score": 2, "replies": [{"body": "You missed the leap year. We leaped years ...", "score": 5, "replies": []}]}]}, {"body": "So VIXY calls then", "score": 1, "replies": []}]}, {"body": "And coronavirus will be gone by next week 🙄🙄🙄", "score": 10, "replies": []}]}, {"body": "\"THANK\" YOU FUCKER", "score": 3, "replies": []}, {"body": "What happens if they can't afford to continue buying our debt?", "score": 3, "replies": [{"body": "What do you think social security is for?", "score": 1, "replies": []}]}, {"body": "Buy calls on $ASHR... Lots of Yuans up the butt make for good gains.", "score": 5, "replies": [{"body": "Wtf...ASHR isn’t yuan hedged. If they printed some ungodly amount of yuan to wipe away this massive crash, then yuan  would be worthless, so in USD you’d still not make money. Printing shitty currencies no one wants isn’t a magic button to make stocks go up.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "That’s not going to happen anytime soon, and that’s really the whole point; until this shit blows over the global economy is going to continue losing steam. Judging from the parabolic increase in cases outside of China (and because nobody with a brain trusts China’s numbers anyway) we are just getting started here.", "score": 5, "replies": []}, {"body": "All of their businesses will be bankrupt by the time they can get shit running again.", "score": 3, "replies": []}, {"body": "Well wuhan is still burning bodies and pmi is way below what average esimate is, so mostly red monday, who knows when things get back normal?", "score": 4, "replies": []}, {"body": "Oh, and then when they all start catching and spreading again? You can hold this for over a month - still spreading btw, and even then, you're able to catch covid-19 shit again if someone spreads it over.", "score": 1, "replies": []}]}, {"body": "Considering it has been known that Chinese factories have been closed for a while, I would say this is priced in", "score": 9, "replies": [{"body": "It's priced in assuming all the quarantines are successful and no new ones are needed.", "score": 6, "replies": [{"body": "https://www.seattletimes.com/seattle-news/health/2-new-coronavirus-cases-emerge-in-washington-in-king-county-and-snohomish-county/\n\nNot working, 80 percent of people are not affected (just sick at home or go-to work Anyways, mild symptoms) and still spreading it.  That 80% are never tested.  Only people that are knocking on heavens door or are being quarantined due to travel history are being tested.  TWO WEEKS AND THIS SHIT IS GOING TO BLOW THE FUCK UP. \n\nP.S. I've need naughty to day being a 🌈🐻", "score": 5, "replies": [{"body": "And it doesn't leave your system after being sick. All these people think you recover and then you're immune. Hell fuckin' no. If you don't get sick again during the time you're still holding, all it takes is someone spreading it back for you to be at risk again. Until a vaccine is out and ready to go, people will be spreading and catching over and over again.", "score": 2, "replies": [{"body": "There is only a single known case where this happened. Don’t spread FUD", "score": 1, "replies": [{"body": "And to boot, they think it was a botched test and the person was still sick when they were discharged.", "score": 2, "replies": []}]}]}, {"body": "Yeah and they're starting to reopen factories.  Outbreak 2.0 in two weeks.", "score": 1, "replies": []}]}]}, {"body": "Expectations were a 15-20% drop not 30%. Downward. Trend. Starting after Monday’s rally. Brief as it may be.", "score": 11, "replies": []}]}, {"body": "Priced in \n\nAnd even so it means nothing to us last time their PMI sucked we rallied", "score": 6, "replies": [{"body": "You gotta look ahead my dude, china numba 1 supplier in the global supply chain.", "score": 1, "replies": [{"body": "We already knew their PMI would suck on coronavirus problems", "score": 1, "replies": [{"body": "Watch the media headlines on Monday, ' worse than expected PMI' blah blah blah.", "score": 2, "replies": []}]}]}, {"body": "Priced in? That’s what people were telling right before shit went down this week. As far as I see this: the only thing that now is priced in is the disruption of supply chains.\n\nStill missing is everything that’s going to happen in the US. I expect another -10% from this point on.", "score": 0, "replies": []}]}, {"body": "One horseman of the apocalypse at a time, folks.", "score": 2, "replies": []}, {"body": "But what do i buy tho", "score": 1, "replies": []}, {"body": "Already priced in", "score": 1, "replies": []}, {"body": "What? Is this suppose to scare us? Pfffftt.. TQQQ calls, all in", "score": 1, "replies": []}, {"body": "I don't need to buy pus I can make my own", "score": 1, "replies": []}, {"body": "Please please let this be priced in.", "score": 1, "replies": []}, {"body": "S&P Futures up 1%....why", "score": 0, "replies": [{"body": "Futures are closed until 5:00 Sunday night. That’s AH from today", "score": 21, "replies": []}]}, {"body": "[deleted]", "score": -5, "replies": [{"body": "Not priced in", "score": 9, "replies": [{"body": "[deleted]", "score": -7, "replies": [{"body": "This week and next week and the week after that.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": -10, "replies": [{"body": "? this is pro bear", "score": 9, "replies": []}]}]}
{"title": "The Case for Bears and Bulls", "selftext": "Bears: \n\n* [Local testing now fixed - new cases will be announced](https://www.usatoday.com/story/news/health/2020/02/29/cdc-fixed-glitch-allow-state-locals-test-coronavirus/4906318002/)\n* [U.S. cases already being announced with an unknown source - can't trace back and stop the source](https://www.nbcnews.com/news/us-news/number-coronavirus-cases-unknown-source-growing-u-s-n1145781)\n* The current market has been a bull market for an unprecedented amount of time. Market correction has historically lasted at the very least a month before stabilizing - it has only been a week\n* [A vaccine would take over a year to come into effect based on regulatory requirements](https://www.cnn.com/2020/02/28/health/coronavirus-vaccine-and-treatment-development/index.html)\n* Compromised immune systems will continue to be an issue as cold weather persists through this time of year\n\nBulls:\n\n* StOnKs aLwAyS gO uP", "id": "fbd10z", "created_utc": 1582985532.0, "score": 216, "upvote_ratio": 0.95, "num_comments": 87, "comments": [{"body": "We just had the largest retreat in equities since 2008 in 5 trading sessions. Even with Chinas low PMI, factories are already restarting. Majority of those new SK cases can be traced to 1 city and were part of a cult. Yes, 3 cases of community spread is concerning but now comes the question of what is or isnt priced in. In other words, I'm high as fuck", "score": 68, "replies": [{"body": "Damn guy, sometimes.. i want to just get high and think more.\n\nHere is one for you. US infected china to force American companies out and move to other countries.", "score": 18, "replies": [{"body": "Agreed", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "We didn't. A death already. But regardless. It is a bio weapon", "score": 3, "replies": []}]}]}, {"body": "Doesn't matter if shipping routes around the world continue to be fucked and cargo storage supply doesn't magically go up.", "score": 3, "replies": []}]}, {"body": "Ah Bull Trap, my favorite kind of music.", "score": 28, "replies": [{"body": "So... My account won't be blown up?", "score": 2, "replies": []}]}, {"body": "I'm a bear, but how about the Fed? Or the US housing market heating up (which typically signals increase in consumer confidence)?", "score": 45, "replies": [{"body": "What can the fed do about a 30% loss in production out of China for a month? Or people staying in-doors and not spending money for a month?\n\nAre people really this dumb?", "score": 58, "replies": [{"body": "Trump seems to think the answer to your question is, \"a lot\"", "score": 29, "replies": [{"body": "Trump is just America's Joe C", "score": 2, "replies": []}]}, {"body": "There’s a weird camp that’s like “If it doesn’t make you shit bloody stool out of your eyes, it’s clearly overhyped.” \n\nShit doesn’t need to be Ebola to fuck up businesses profits.", "score": 17, "replies": []}, {"body": "People are also overvaluing when a fed cut happens. Some guy was calling for 50 points tomorrow night. Imagine the fed doing this, followed by a massive sell-off when the inevitable headline pops. The \"silver bullet\" won't mean anything, and people will freak out even more b/c the conventional wisdom will have failed. Enjoy the ride down, wait for the virus to get under control, and enjoy the ride back up.", "score": 7, "replies": []}, {"body": "Saw something yesterday that the White House is considering a tax cut to help 🤣🤣", "score": 5, "replies": [{"body": "Classic.", "score": 1, "replies": []}]}, {"body": "I agree with you, I'm just saying there are more reasons that bulls have than just \"stonks go up\"", "score": 3, "replies": [{"body": "“wE’rE dEALing WItH tHiS VIruS vERY wELL iN OUr cOnTRy”", "score": 4, "replies": [{"body": "It’s just a flu bro", "score": 2, "replies": []}]}]}, {"body": "To add, ~40% rely on their paycheck every week to support themselves and have no real savings. They will essentially be forced to work out of fear of becoming impoverished. It doesn't matter if they have orders for self-quarantine, I guarantee Trump will not provide them with social security for the time they are supposed to be quarantined, meaning many people will be going to work with the virus. That's even more disastrous than the workforce being absent because of a quarantine.", "score": 3, "replies": []}, {"body": "Fed makes holding cash more expensive and borrowing cheaper. This pushes cash into higher risk assets chasing returns. That’s how the fed affects junk bonds and equities.  Fed policy can easily prop up the stock market despite supply chain issues.", "score": 2, "replies": [{"body": "You're a fucking idiot.", "score": 2, "replies": [{"body": "Unsure if that means I’m too autistic for wsb or not autistic enough.  Either way, thank you for the kind words, good sir.", "score": 2, "replies": []}]}]}, {"body": "All China has to say is people are going back to work and 1000 points up.", "score": 2, "replies": []}]}, {"body": "As a consumer, I've always lacked confidence.", "score": 15, "replies": []}, {"body": "We're near the end of a real estate cycle anyways. This is really the perfect storm.", "score": 26, "replies": [{"body": "It's a. Convenient setup. Stop being religious about markets and just embrace the puts for now", "score": 14, "replies": []}]}, {"body": "Nah the fed can attempt to prop the market up temporarily.  But doing so only accelerates the negative momentum.  And the housing market has had unsustainable gainz for years now and is also soon to go cold.", "score": 7, "replies": []}, {"body": "All the 80+ retirees will die, spurring and overage of empty retirement homes", "score": 7, "replies": [{"body": "I hope that's the case so I can afford a home but the cost of helping them will probably do more damage to the country as a whole.", "score": 2, "replies": [{"body": ">I hope that's the case so I can afford a home but the cost of helping them will probably do more damage to the country as a whole.\n\nYou hope more people die, so you can live in a house?\n\nWow, markets are going to move where there are gonna move, but you may want to take a look at yourself.", "score": -3, "replies": [{"body": "of course I don't really hope that people would die. I am just hoping for a decrease in home prices.", "score": 5, "replies": [{"body": "Fair enough", "score": 1, "replies": []}]}, {"body": "fuck off, we want ours", "score": 1, "replies": []}]}]}, {"body": "Yuck, don't want a retirement home. Too sterile and too many old people", "score": 1, "replies": []}]}, {"body": "Also super tuesday this week. I had my money on puts anyway thinking the dem nominee annoucement would scare the market into the red", "score": 6, "replies": []}, {"body": "You guys think it will really keep tanking down? I say this holding puts over the weekend but unless another global economy gets quarantined ie. China I believe she'll just slowly bleed out until global companies can get their feet under them again", "score": 2, "replies": [{"body": "If it doesn't bleed on Monday, we can expect a fall mid-march as that's when supply shortages are really going to hurt(Source: Harvard Business Review)", "score": 3, "replies": [{"body": "Except the stock market is based on speculation. If supply chains are back online a quarter of negative growth means literally nothing as everyone knows the company will be making significantly more profits next quarter when they're back to baseline.", "score": 1, "replies": [{"body": "If supply chains go back online it will be for like two weeks, max. Too many people are going to come to work with the Corona, and then w/ the two week incubation period of people working and touching people and products, after two weeks china is fuk again.", "score": 1, "replies": []}]}]}]}, {"body": "cutting rate kills virus is the logic i suppose", "score": 2, "replies": []}, {"body": "Its going to ring very hollow and may actually drive the markets further down", "score": 1, "replies": []}, {"body": "The Fed's been pumpin  for the last 4 days, did nothing. We're at the end of a cycle. What else you got?", "score": 1, "replies": [{"body": "Rate cuts and more repo. Same things they've been doing the last four years", "score": 1, "replies": []}]}, {"body": "The virus k/d ratio is skewed towards affecting boomers and older generations more severely. These generations proportionally own the largest amount of real estate in US(other than investors and foreign companies). What do you think happens when these ppl die in mass and the housing market is flooded with property supply acquired through inheritance? Housing prices and values will drop, affectively fucking anyone who bought a new property within the past year or so. Also interested to see if high boomer populated areas are affected at a more sever rate and become less retirement centers and more ghost towns if it got really bad. If that happened then we would have pockets in the US of heavily devalued properties entering the market due to a massive long term decrease in economic activities and boomer spending. You can't spend when you are dead. \nAlso work in real estate and most would be surprised how many ppl sell inheritance properties. Usually to cover bills, debt or have a Windfall of cash instead of dealing with hassle of renting or owning a new property.", "score": 1, "replies": [{"body": "Also what how are ppl going to be spending money if they go into massive medical debt due to corona?", "score": 1, "replies": [{"body": "Just don't be poor", "score": 2, "replies": []}]}]}]}, {"body": "So do I buy calls or puts?", "score": 18, "replies": [{"body": "DiViDeNd StOnKs", "score": 31, "replies": [{"body": "Thats thata doing but then again i am a soy boy", "score": 5, "replies": []}]}, {"body": "Yes", "score": 6, "replies": [{"body": "Do the Boglehead", "score": 1, "replies": []}]}, {"body": "both? ever heard of OTM hedging?", "score": 3, "replies": [{"body": "Fucking facts\n\nBuy the dip in your 401k, then buy puts in your yolo account. It’s not even a yolo at this point, just good investing 🤷🏼‍♂️", "score": 5, "replies": [{"body": "Preach", "score": 1, "replies": []}, {"body": "Increased my contribution to max this past paycheck.\n\nPuts on spy monday.", "score": 1, "replies": []}]}]}]}, {"body": "The case for bulls:\n\nInverse WSB", "score": 20, "replies": []}, {"body": "1. Bulls already knew more case would be announced\n2. It would be impossible to go back in time and uninfect people anyway\n3. Yes, but now we have corrected\n4. Anything can be fast tracked\n5. It's warming up", "score": 6, "replies": []}, {"body": "Im glad I’m on the right side of history", "score": 9, "replies": [{"body": "\"Yes of course I supported corona, children. You see this glorious bear market today? It was only possible because your grandpa hid corona patients in the attic and his puts under the floorboards. They searched our house twice and if they had found them... they would get them on trains and... treat them. This recession would have been over and me and you grandmother, our whole family... bankrupted immediately. But... I never collaborated with bulls or the health authorities during these years. Everyone else did, but your grandpa knew that it was wrong and evil!\"", "score": 19, "replies": [{"body": "Bulls are really another level of dumb", "score": 4, "replies": []}]}]}, {"body": "More cases gonna be announced. They havent done proper testing so there is going to be a huge batch of confirmed cases that will lrock the boat. Load up on puts  bois.", "score": 4, "replies": []}, {"body": "the long term impacts on global supply chain aren't even close to being factored in.  Hard for anyone who sells things to make money when there isn't anything to sell.  Q4 earnings estimates are going to be a bloodbath for a lot of major retailers.", "score": 3, "replies": []}, {"body": "It was a high velocity week\n\nCold weather doesn’t equate to compromised immune systems", "score": 8, "replies": [{"body": "Wow what a normie way of sayin \"it was a fucking shit show\"", "score": 7, "replies": [{"body": "Market roller coaster.\nWeeeee and down we go and up and a looping and weeeeee again.", "score": 3, "replies": [{"body": "Must have missed the part where it went up", "score": 2, "replies": [{"body": "Look at the last 20 minutes on Friday", "score": 3, "replies": []}]}]}]}]}, {"body": "lol i fuckin feel sorry for the fucks that bought calls at the end and are on here fucking acting like geniuses..", "score": 6, "replies": [{"body": "Monday may be green and bulls will take profit but no way it stays up all of next week", "score": 2, "replies": [{"body": "hey man don't you see us on here working the fucking weekend to drill deep to deflate? help or gtfo", "score": 6, "replies": []}]}, {"body": "If you don’t think Donald pump, will at least make sure the pre-market is green, you’re the retard my friend.", "score": 2, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Sounds about right....", "score": 1, "replies": []}, {"body": "Annnnd the bulls have it!", "score": 1, "replies": []}, {"body": "Who are the most at risk from COVID-19? Men more than women. Older men. Just like the older men that run everything that has anything to do with investing.", "score": 1, "replies": []}, {"body": "I hope this shit lasts a month. I'd like to retire in April.", "score": 1, "replies": []}, {"body": "Perma bulls forgot how fast the bear will come into screw you. The only reason it pumped Friday was so people could buy cheaper puts", "score": 1, "replies": []}, {"body": "Yup, just look at how inviting SPCE looks to get in at the bottom....BTD lmfao", "score": 0, "replies": []}, {"body": "Inverse this 🌈🐻for max gainz", "score": -2, "replies": []}]}
{"title": "Panic means down a lot more then 4% intraday. We saw preparing for a pandemic last week. When reacting to a pandemic happens bears can retire if they play it right. Wait for down 5-7%", "selftext": "[deleted]", "id": "fbigz5", "created_utc": 1583007797.0, "score": 81, "upvote_ratio": 0.95, "num_comments": 89, "comments": [{"body": "For someone who has traded through 2 crises here are some pointers:\n\n1. Increased volatility goes both ways. You can have 5% down, then immediately 2% up then 2% down etc. You can make a lot of money if you time it right and have a good broker that doesn't GUH when you try to exit\n2. Protection on both sides (calls and puts) will get very expensive up to the point where delta becomes soooooo small. At that point, the big money will stop buying them. Result? Calmness. \n3. You will get 5% days at first, but in the long grind, it will only go down like 1% a day. If you bought puts when it was 5% down and volatility decreases to 1%, you will get fucked. \n4. Also, not recommending to sell VIX because of the adage markets can remain irrational for longer than you are liquid. \n\nSo.... there's a lot of money to be made these weeks. Be nimble, and go buy a yacht with all the profits once you see things calm down.", "score": 107, "replies": [{"body": "Strike and date mr. brain", "score": 46, "replies": [{"body": "7% OTM AAL Puts, April 17\n\n5% OTM AAL Puts, Mar 13 (the real lotto ticket)", "score": 45, "replies": [{"body": "What else you got? Give me more!", "score": 8, "replies": []}, {"body": "Interesting idea. You’re one of the good ones.", "score": 3, "replies": []}, {"body": "When did you buy?", "score": 2, "replies": []}, {"body": "Got 3/19 17.50p. Up400% gonna  let them  so  some more...", "score": 2, "replies": [{"body": "There is no 3/19 expiration for AAL", "score": 3, "replies": [{"body": "KA2YQW (german)", "score": 2, "replies": []}]}]}, {"body": "What about Puts on XLE?", "score": 1, "replies": []}]}, {"body": "SPY 240 april 17, get a few weeks of shit earnings to help drive everything down", "score": 1, "replies": []}]}, {"body": "You're mostly saying how not to do it. But what is the strategy you recommend? \n\nI've lived through the dot com bubble and vowed to myself to never miss a recession again. I've thought for 10 years on a proper strategy.\n\nNow the time has come and everything is grey as fuck. I realize whatever plan I had, it's shit. There's this big gap between retroactively knowing what you should have done and doing it while it's happening, with the means that are available to you.", "score": 17, "replies": [{"body": "I planned for this but am more risk averse than I realised. In Jan I altered my superannuation (401k) defensively, out of shares. Out of shares and into property and infrastructure. My timeline is 12 months+ of crash. 2008 took 459 days to bottom putting us at May 21.\n\nOnce I see Monthly RSI bottom out I’ll shift my whole portfolio to geared growth and increase my salary sacrifice into super. I’ve also done the same for the wife and we have $20k ready to grab up some bargains.\n\nIn hindsight I should have shorted or used puts and made a thousand percent more", "score": 9, "replies": [{"body": "I think 2008 was very drawn out, because of the state of the financial sector. I think this one will be more violent and then move over into a sideways market.\n\nI also believe we could go down to DJI 15000. Maybe some options with long ex dates, like summer 2021, are a good play.\n\nOf course not swinging severely limits your profit potential, as you're simply sitting on your initial investment.", "score": 10, "replies": [{"body": "A bear market is a bull market upside down. Most people can't swing a bull market. What makes you think bear markets can be easy", "score": 2, "replies": [{"body": "The market tends to fall faster and more aggressively as people freak out compare to a bull market in general not being as violent.", "score": 2, "replies": []}]}]}]}, {"body": "I don't understand wtf you're saying\n\nBut I'm agreeing with OP that the worse isn't over yet. When it starts to be over, what I said would usually be seen.", "score": 1, "replies": []}, {"body": "Oh yeah...there is no certainty right now. It means markets go down and keep going until good news. After weeks that are so bad we never have got a vshaped recovery. More like huge losses to come. \n\nWe haven’t even had dumb politicians throwing out terrible ideas that make the market fall more the way John McCain tanked markets", "score": 1, "replies": []}, {"body": "I saw the dot com crash and the housing market bubble as well. \n\nFor this one I went long UPRO and SSO on Friday. \n\nI know what you mean - it is scary to do it when it is actually happening. It was like ... puke... buy... throw up more... buy more. \n\nI felt more comfortable in leveraging an index (spy with 2x and 3x in this case) vs individual stocks or options. I just have to be right on the direction and don’t have to worry about expiration.", "score": 0, "replies": []}]}, {"body": "I like this guys brain", "score": 5, "replies": []}, {"body": "Ya wtf mods blocked my post about IBKR. People trading with wet noodle brokers like Robinhood is insane. Especially with options. Yay saved a buck in commission but overpaid $20 per contract LOL.", "score": 5, "replies": [{"body": "I'm using IB. Since the market opens at 3.30am local, I'm thinking market orders on some puts make sense. Or is that crazy?", "score": 1, "replies": [{"body": "Not crazy...prolly gonna do the same within an hour of the market opening. At least 500$ but maybe $1000", "score": 1, "replies": [{"body": "Yeah. I really dont want to be awake at 3.30am. I can probably stay up a bit late and cross my fingers that no amazing news lands in the hour or two before open. Trump will still be asleep so I think we will be ok.", "score": 1, "replies": []}]}, {"body": "Crazy. Spread is bananas at market open.", "score": 1, "replies": [{"body": "Not at the open, I said sometime an hour after it opens", "score": 1, "replies": []}, {"body": "Thanks for that thought! I might just have to wait up since it's so volatile.", "score": 1, "replies": []}]}]}]}, {"body": "This was really useful. Wow.  Thanks", "score": 2, "replies": [{"body": "Useful how? Your welcome though. Good luck", "score": 1, "replies": []}]}, {"body": "You sob I’m in. Strike price and ticker you 🌈🐻", "score": 1, "replies": []}, {"body": "I'm thinking April VIX puts should hit pretty hard.", "score": 1, "replies": []}, {"body": "So how would you approach this day trading? \n\nI'm working this on 7k Tesla stock. Planning on selling at market open and rebuying 5% down the first day. \n\nThis is my first real run.", "score": 1, "replies": [{"body": "I loved Tesla for the last decade up until last week. I’m fearful it will sell off so I sold my positions. I’m 20% options and 80%cash. My options are about 80% puts on dis, xle, qqq and spy and I own calls on PayPal but they are almost worthless considering I bought them Monday or Tuesday. \n\nComing into the week I owned enphase, google, Nflx and Boeing. I sold some Wednesday so I could short over the weekend and the rest Thursday so I’d have cash Monday to put to work.", "score": 1, "replies": []}]}, {"body": "Do you have a blog I can follow blindly and print tendies?", "score": 1, "replies": []}, {"body": "so wouldn't spreads benefit here then if you can't sell naked?", "score": 1, "replies": [{"body": "Sure if you play it right. Gonna take balls", "score": 1, "replies": []}]}, {"body": "Could you explain #2 and delta?\n\nAlso when and how to know this", "score": 1, "replies": []}]}, {"body": "Just remember all that when WSB becomes an echo chamber on something (aka all you bulls that now call yourselves bears), the market can whipsaw the other way. \n\nI read things like someone died in the US from corona, and retards here think that means Spx drops 5% Monday. People are expecting deaths, sipshit, and when the market takes a bath like last week, you could have lots of money coming in just due to the rapid reversals. Be smart, be safe, happy tendie making - these markets are a once in a 5 year opportunity for us.", "score": 29, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Being tactical mid day. Bought calls that were up over 120% and closed on Friday. Will wait to see which direction the wind goes. \n\nIf vix stays above 40, ill be selling iron condors with like a fat 2700-3200 spread to get some nice theta.", "score": 2, "replies": []}, {"body": "Any calls should be sold once profitable imo. \n\nI’m definitely bullish once we are through this but playing short dated calls will be dangerous.", "score": 1, "replies": []}]}, {"body": "Don’t waste it. Easy to say and hard to do I know.", "score": 1, "replies": []}, {"body": "You could also have a shitload of banks calling in margin loans which will cause forced selling and real capitulation", "score": 1, "replies": []}]}, {"body": "Thank you for the insights... This is my first active Options trading in such a volatile market and point blank... $4k is now $177k and I'm holding a nice full house.  \n\nThese pointers will really help and I'm already reformulating my strategy for the next week.\n\nTHANK YOU!!!!", "score": 16, "replies": [{"body": "Remember to pay yourself before anything crazy happens never forget pimp", "score": 18, "replies": [{"body": "I keep telling people my gains are 95% due to playing plague inc.  No one on this board would hurt playing a few games and then extrapolating the details.", "score": 5, "replies": []}]}, {"body": "How long it take turning 4 into 177?", "score": 5, "replies": [{"body": "Monday to Friday", "score": 9, "replies": [{"body": "Wow. What did you play?", "score": 1, "replies": [{"body": "SPY Puts laddered all the way down", "score": 2, "replies": [{"body": "What exactly does laddered all the way down? \n\nThat takes balls to hold all week", "score": 0, "replies": [{"body": "This is not a strategy that can be duplicated this week and if at any point the market had rallied for more than two days I would have been slaughtered. \n\nThe specific market conditions that led to these gains also fell apart in the last 15 minutes and my positions decreased by over $100k.  \n\nIn short what I did was move my positions out a few days and a bit lower in the market while increasing my total puts.  \n\nI do not recommend this strategy unless some very specific conditions occur Monday.  And I don’t as of now believe they will.", "score": 6, "replies": [{"body": "Lol I have to ask. What specific conditions? \n\nSomething like...3 more community spreads over the weekend and the first American death?", "score": 1, "replies": [{"body": "How the news has been reporting and halting reports on Corona, Market reactions and denial on the news as it's released, Option pricing formulas not matching true option value.", "score": 1, "replies": [{"body": "So the conditions look good for your trade so far right?", "score": 1, "replies": []}, {"body": "I’m looking out to may and options that would be ITM should we see around a 30% drop in the next month. Maybe roll them into lower strokes to take a profit every so often", "score": 1, "replies": []}, {"body": "Just got a case in Rhode Island. \n\nLook out below", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "I’m hoping to do that with my 4000 this week. I was not near as sure all week.", "score": 1, "replies": []}]}, {"body": "Something something circuit breakers fuck the government", "score": 13, "replies": [{"body": "watch, circuit breaker is the next thing. \n\n\n𝕄𝔸𝕂𝔼 𝕆ℝ 𝔹ℝ𝔼𝔸𝕂𝔼ℝ 𝕄𝕆ℕ𝔻𝔸𝕐\n\n\nHaha, I’m in danger.", "score": 11, "replies": []}]}, {"body": "I hope we see 10% on Monday so my $270 puts dont go to 0", "score": 11, "replies": [{"body": "3/2?", "score": 2, "replies": []}, {"body": "Hey I might’ve sold you those at $1.2 40 minutes before the spike", "score": 1, "replies": [{"body": "I don't think so, I've had them for a while. I was just buying \\*more\\* today which was why I couldn't sell em", "score": 1, "replies": []}]}]}, {"body": "No dead cat bounce means fucking puts=$$$", "score": 5, "replies": [{"body": "Maybe Friday at close WAS the cat bounce.", "score": 5, "replies": [{"body": "Idk my guts says no but I'm retarded with adhd so im probably wrong  and you should just do the opposite of what I think.", "score": 2, "replies": [{"body": "Naw, we drilling to China.", "score": 1, "replies": [{"body": "I'm gonna be knee deep in.bat soup and chinese hookers fresh off the boat.", "score": 2, "replies": []}]}]}, {"body": "Too small of a bouncr", "score": 2, "replies": [{"body": "Small cat meens small pp", "score": 1, "replies": []}]}]}]}, {"body": "What is the conclusion and recommendations here sir? I'm holding puts.", "score": 6, "replies": [{"body": "That’s a good place to be. \n\nPandemics don’t cause V-shapes recoveries. \n\nI think we just get bad news over and over again for at least a month. It’s so hard to say but I believe the market will behave similar to 2008 after the initial selloff", "score": 2, "replies": []}]}, {"body": "Soooooooo spy puts...ya we got that...", "score": 2, "replies": []}, {"body": "Are u gay?", "score": 2, "replies": [{"body": "Autistic", "score": 2, "replies": [{"body": "arent we all?", "score": 3, "replies": []}]}]}, {"body": "If the market goes down 7% in a day a circuit breaker would trigger and trading would halt temporarily.", "score": 2, "replies": [{"body": "Says who?", "score": 2, "replies": [{"body": "Google \"trading curb\".  Its the  🌈🐻  safe word.", "score": 1, "replies": []}, {"body": "The government of the United States of America. Look up circuit breaker.", "score": 1, "replies": [{"body": "What do I do then? After I look it up.", "score": 1, "replies": [{"body": "You, dare I say it, be informed.", "score": 1, "replies": [{"body": "Ignorance is bliss.", "score": 1, "replies": []}, {"body": "Looks like you like your commas but here’s a quick lesson. What’s it say without them “you be informed” so if you would like to appear smart to people you never will see or hear or touch or feel maybe change it to “you, dare I say it, get informed” then w o commas it says “you get informed” which is a much more digestible way for the brain to comprehend such data", "score": 1, "replies": [{"body": "Valid points you makin. Spitting straight facts. Thanks, I’ll keep that in mind for next time. 😅", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "totally agreed. the market has panicked yet Wait for the panic sells and then stop shorting.", "score": 1, "replies": []}, {"body": "puts into what for lottery chances of crash? TQQQ? SOXL? SPXL?", "score": 1, "replies": []}]}
