{"title": "MSFT Gains for today. 50k in, 20 more tomorrow. Up about 60k in the last month.", "selftext": "", "id": "f242dg", "created_utc": 1581400425.0, "score": 123, "upvote_ratio": 0.98, "num_comments": 78, "comments": [{"body": "You should roll it into closer expirations", "score": 31, "replies": [{"body": "Why? He’s good", "score": -2, "replies": [{"body": "Maybe", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 21, "replies": [{"body": "How much did you put in", "score": 4, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Aaaaand it’s gone", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Atta boy", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I jumped today on msft train. Rip your tendies", "score": 12, "replies": [{"body": "Weaponized autism. Nice", "score": 3, "replies": [{"body": "Tendies for days Microsoft 2/21", "score": 2, "replies": [{"body": "Microsoft 2/21 is going to make me rich or bankrupt me. Cant wait", "score": 1, "replies": []}]}]}]}, {"body": "Ahh schwab account.", "score": 5, "replies": []}, {"body": "Yesss a Schwab account me too!\n\nFinally not robinhood", "score": 3, "replies": [{"body": "Not many of us.", "score": 2, "replies": [{"body": "What do you guys use to track your options through schwab ?", "score": 1, "replies": [{"body": "Like...options that I’m currently in?\n\nI have a couple screens up with streetsmart edge up all day. I’m in IT so numbers moving fast, red and green, they think I’m hard at work.\n\nThe app is only good the day after you buy. It shows pricing for the day not what you bought at. But you’re day change is accurate from the main screen.\n\nI never place orders on the app. It’s no bueno.\n\nAnd.... if I’m not at my computer, I just watch the stock. I can usually tell how fucked I am by the price movement", "score": 1, "replies": [{"body": "Agreed do you use any back tracking software ? Do you export your current positions to a software or all through street smart positions ?", "score": 1, "replies": [{"body": "Negative.  StreetSmart is pretty powerful. However, morning order executions are getting a little worse with all the volatility.  And if you check my post history, got screwed pretty hard last week.", "score": 1, "replies": [{"body": "I’m just kinda talking about like tracking ur portfolio ? Can you do a beta weighted tracker on street smart?", "score": 1, "replies": [{"body": "This might help\n\n\nhttps://www.google.com/amp/s/amp.reddit.com/r/options/comments/9of2xz/question_for_schwab_streetsmart_edge_users/", "score": 2, "replies": [{"body": "Thank you", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "take your profit", "score": 3, "replies": [{"body": "Ignore this man", "score": 1, "replies": []}]}, {"body": "I’m up 400% on 200 3/13 calls", "score": 1, "replies": [{"body": "Im a newbie to this, what exactly are you saying?", "score": -1, "replies": [{"body": "He made some tendies", "score": 4, "replies": []}, {"body": "he purchased an option that is set to expire on the date 3/13. that option gives him the right to buy Microsoft's stock at 200 dollars anytime uptill expiration. as Microsoft's stock goes up, the option increases in values. aka hes making good tendies.", "score": 2, "replies": [{"body": "And if it doesnt hit 200 and doesn't sell he's fucked right?", "score": 1, "replies": []}, {"body": "interesting, thx.", "score": 0, "replies": []}]}, {"body": "Did you know that there are thousands of websites that will tell you everything you need to know?", "score": 0, "replies": []}]}]}, {"body": "Enjoy ur mf birthday with ur sick gains bro", "score": 1, "replies": []}, {"body": "You magnificent retard", "score": 1, "replies": []}, {"body": "Happy Cake Day!", "score": 1, "replies": []}, {"body": "How do you screenshot on schwab?", "score": 1, "replies": [{"body": "Open the app, on iPhone just hold both side buttons", "score": 1, "replies": [{"body": "Fuck they have security block on Android", "score": 1, "replies": [{"body": "That’s stupid. \n\nWell I’m all in now. 70k in. Position worth 87k", "score": 2, "replies": [{"body": "Adding to MSFT calls", "score": 1, "replies": [{"body": "Yeah. Bought some spce for fun. Bynd yesterday. \nTesla put is barely green from losses today", "score": 1, "replies": [{"body": "I have 27k in msft, baba, jd", "score": 1, "replies": [{"body": "Good plays", "score": 1, "replies": []}, {"body": "I imagine a little msft red will shake out people", "score": 1, "replies": [{"body": "it dipped twice and dropped harder the second time...should've bought calls rn", "score": 1, "replies": [{"body": "I hit it again.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "I am still super new to stocks, can somebody explain what this screenshot is showing? For example the dates are future dates.", "score": 1, "replies": [{"body": "Options with long dated expires. Not FD’s because I’m a pussy.", "score": 3, "replies": []}]}, {"body": "God damnit. I wish I had the ballz for bigger peepee play", "score": 1, "replies": []}, {"body": "I like how the app comes with a warning view at the bottom for \"Bubble Chart\".", "score": 1, "replies": []}, {"body": "Bigger gains for shorter dates bruh. Liquidate and bank it all on 2/21 . Literally free money bro", "score": 1, "replies": [{"body": "No thanks. Bigger losses for shorter dates. I'm happy with steady gains.", "score": 1, "replies": []}]}, {"body": "SHEESH", "score": 1, "replies": []}, {"body": "Not aging well. Bought in more options on a semi dip. Down 10k\n\n&#x200B;\n\nEdit down 16k at close", "score": 1, "replies": [{"body": "F", "score": 1, "replies": [{"body": "Long expires. Hit it again tomorrow.", "score": 2, "replies": []}]}]}, {"body": "F again", "score": 1, "replies": [{"body": "Down 5,700 on this today.\n\nAs of right now, I've wiped out about 22k, all in gains from these previously.  I've averaged down, but not today because I didnt have settled cash.", "score": 1, "replies": []}]}, {"body": "What would be good calls to buy tomorrow ? I’m new but I know buying calls of MSFT is the thing to do . Helppp ! Never messed with options before", "score": -6, "replies": [{"body": "Don’t. Just don’t.", "score": 3, "replies": []}, {"body": "Is this sarcasm?", "score": 6, "replies": []}]}, {"body": "I don’t really know how options work yet but I really want to get into it. Consider I’m an absolute noob, are there any good option choices in your opinion right now, or did I miss the train?", "score": 0, "replies": [{"body": "MSFT has dipped multiple times today. I'd keep watching. You can get these cheaper on the dip.", "score": 1, "replies": []}, {"body": "missed the train. research options before you start buying you can fuck yourself pretty big if youre new , its buying a contract to buy 100 shares", "score": 1, "replies": []}]}, {"body": "So many msft braggers here\n\n\nTop is near", "score": -8, "replies": [{"body": "How can there be a top if stonks only go up", "score": 14, "replies": [{"body": "They *sometimes* go sideways", "score": 7, "replies": [{"body": "Ye Oil is going to the abyss atm, when China opens again I'll put some yolo certificate 10x leverage on that fucker", "score": 1, "replies": [{"body": "UWT calls for u son REEEE", "score": 2, "replies": []}]}]}]}, {"body": "Show us all your puts then 🐻🐨🐼", "score": 1, "replies": []}, {"body": "Yea I know, I got puts lol. They are bound to go down soon. Usually when they hit their ultimate high, they go down, and then back up again afterwards.", "score": -2, "replies": [{"body": "Solid wsb level DD", "score": 0, "replies": [{"body": "Lol i got downvoted but I was right!", "score": 0, "replies": [{"body": "All you said was the stock goes up and down. You can't be wrong if you say that", "score": 1, "replies": [{"body": "No lol , reread please. I said I got puts. Puts on an option means you think it will go down and my next sentence indicated the trend of that stock.", "score": 0, "replies": [{"body": "Some people on here don't understand anything about trading, to them it's gambling. Your knowledge won't even get through to them on the first try. And you were absolutely right, you must've made thousands today.", "score": 1, "replies": [{"body": "Lol i know, I clearly said I got puts. I guess they had no idea what that meant since that translated to me saying about stocks going up and down (?)", "score": 0, "replies": []}]}, {"body": "I know what puts are. Your entire reasoning of buying puts was \"the stock goes down after reaching its all time high\" \n\nObviously it goes down after reaching the all time or it wouldn't be an all time high.", "score": 1, "replies": [{"body": "Ok, that's the simplified way to explain it. You can look at the Greeks too but the Greeks tell you a point in time. To predict the future you look at the trend of the stock. I'm pretty sure he was dumbifying the reasoning. And also, he was specifically talking about msft.", "score": 1, "replies": [{"body": "The trend of the stock is upwards. Buying short expiration puts on a stock like MSFT is 100% gambling", "score": 0, "replies": [{"body": "Um no, long trend is upwards. Short trend is 55% up and 45% down. Obviously some people are short term traders and some are long term traders. This guy is 100% correct in most of his predictions (looking at his history). He's a short term traders and indicated that he doesn't buy more than 2 weeks out from current date in discord. He's clearly a day trader and also proved he makes thousands in discord.", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}]}
{"title": "AMD LONG To Mars DD", "selftext": "Alright, fellow autists, new and ready to be screwed but here's some AMD DD for you schmucks. Inverse me cause I'm totally off my rocker and my day job has nothing to do with stonks or trading. You've been warned.  \n\n\nAMD having recently broken resistance at 50 is looking to scale even greater heights. Its lining up a very strong run-up for 2020, having ripped market share from Intel in Q4 2019 and Q1 2020.  \n\n\nBreaking down into points for all the illiterate:  \n\n\n**POINT 1: APPLE CURRENTLY TESTING AMD CHIPS IN MACBOOK PROs**  \n\nDevelopers have found snippets of code suggesting that Apple developers were testing AMD chips within the kits. [AMD new chips are almost exactly the multi-core solution](https://www.digitaltrends.com/computing/why-apple-should-ditch-intel-for-amd/) apple need and If this pans out they may replace Intel in the near future\n\nThis leads us nicely into the next point...\n\n**POINT 2: APPLE WANTS TO DITCH INTEL**  \n\nIntel has famously suffered from shortages leading to Apple blaming them in slumps in sale in [May 2019](https://www.techradar.com/sg/news/apple-blames-intels-processor-shortage-for-slump-in-mac-sales). They still can't get their shit together and [cant even confirm  if they can meet 2020 production.](https://marketrealist.com/2019/12/intels-cpu-shortage-impact-chip-giants-pc-makers/).  \nThey even wrote an [apology letter.](https://www.zdnet.com/article/intel-sorry-for-pc-chip-delays-but-we-just-cant-meet-demand-for-cpus/) Apple are looking to jump ship and AMD are starting to look like a luxury yacht. [Expect a JUNE 3rd Announcement at Apples Developers conference](https://www.tomshardware.com/news/apple-may-start-selling-macs-with-amd-cpus)\n\n**POINT 3: AMDs THREADRIPPERS ARE SETTING WORLD RECORDS**  \n\nOverclockers are using [threadrippers to clock in 5,548.71MHz.](https://www.techradar.com/news/amd-ryzen-threadripper-3990x-overclocked-at-55-ghz-is-setting-world-records) This is a day after release, with overclockers till continuing to tweak and optimize their rigs. Expect top tier sales from this bad boy from PC geeks worldwide\n\n**POINT 4: AMDs are in BOTH the PS5 and in the XBOX Series X**   \n\nBoth console giants are will be utilizing [AMD processors in their consoles](https://www.techradar.com/sg/news/could-amd-smartshift-be-the-ps5-and-xbox-series-xs-secret-sauce-for-8k-gaming). What else do I have to explain? Its videogames everyone and their uncle is gonna have one.  \n\n\n**POINT 5: AMD WILL STILL BE RELEASING COMPETITIVE GPUS (BIG NAVI) AND CPUS (ZEN3)**\n\nRumors of a GPU releasing March 3 (supposedly an RTX2080 TI Killer) have been circulating, we may not see this date but [Su BAE herself has confirmed a 2020 release](https://www.tweaktown.com/news/70025/amd-ceo-dr-lisa-su-confirms-see-big-navi-2020/index.html).  \n[ZEN 3 Architecture was also confirmed by Queen Su](https://www.techradar.com/news/amd-zen-3) and will upgrade the company's mobile offering substantially.\n\nEND OF POINTS  \n\n\nBased on all the above, I believe AMD will see tremendous progress as a company and in its stock price. If it can survive any negative corrections, we may never see these prices again. If you want to YOLO on *actual* company doing disruptive things in its industry this is it.  \n\n\nDISCLAIMER: I don't currently own any positions in AMD all my money is with SATYA for 20/3. I am planning to roll tendies into AMD once I have closed  \nI am looking at \n\n20/6 80c\n\n18/7 80c\n\nLEAPS @ 80c-90c\n\nDISCLAIMER 2: I am not your financial consultant, broker or investment advisor I am a random stranger on the internet and am not liable for any of your bad decisions. Gamble at your own risk \n\nThank you for coming to my TED talk now go out there and get some tendies boys", "id": "f2bdwd", "created_utc": 1581441101.0, "score": 152, "upvote_ratio": 0.95, "num_comments": 83, "comments": [{"body": "P R I C E D I N", "score": 96, "replies": [{"body": "Unironically though, most of this has been priced in for months. That’s why the $30-$50 jump occurred in the first place.", "score": 33, "replies": [{"body": "Yea I meant it both ways.  I used to work with a chip provider to Apple and while Apple requires their suppliers to be hush hush about what socket they're working on or competing for (internally they refer to them by code names), by the time a teardown comes out saying where every chip is from, everyone has known for a while.  There's a lot of people who need to be hired to get into this position (usually from competitors) and all these product managers and marketing managers like the sound of their own voice.", "score": 11, "replies": []}]}, {"body": "Nah, not really.", "score": 2, "replies": []}]}, {"body": "Bro I dumped all my Microsoft this morning for AMD.\n\nSORRY SATYA, SUE BAE IS MY MONEY MACHINE NOW.", "score": 51, "replies": [{"body": "You're gonna be sorry when Satya-bro delivers us unto the land of milk-and-honey battered tendies\n\nMicrosoft to 210", "score": 37, "replies": [{"body": "I R O N H A N D S", "score": 14, "replies": []}, {"body": "If this happens I'm getting a new house. To the moon!", "score": 1, "replies": [{"body": "Pretty sure we're either at the bottom of today's dip, or very close to it. I bought more calls during the drop, don't regret it at all. I foresee more gains.", "score": 1, "replies": [{"body": "I bought before the dip but I am confident that all will be corrected pre-market tomorrow.", "score": 1, "replies": []}]}]}]}, {"body": "Friendship ended with MSFT. AMD is now my friend", "score": 2, "replies": []}]}, {"body": "*aggressively points at CSCO*", "score": 17, "replies": [{"body": "Why though", "score": 3, "replies": [{"body": "Su Bae is on their board now.\n\nIf you believe in Su Bae, you believe in CSCO", "score": 3, "replies": []}]}]}, {"body": "#PRICED IN AT 40. WELCOME TO 1690 A.D.", "score": 13, "replies": []}, {"body": "AMD will have a small dip and then go right back to huge gainz. I'm waiting until next week, then dropping more cash.", "score": 21, "replies": [{"body": "All in for queen sue", "score": 6, "replies": [{"body": "You wrote that whole long dumbass post filled with info that’s been known for months if not years and you can’t even spell her name right. Good job", "score": 7, "replies": []}]}, {"body": "Didn't they already have the small dip? Get in now!", "score": 3, "replies": [{"body": "yea they dipped from the coronavirus scare but now it looks like another bull run is gonna happen", "score": 2, "replies": []}, {"body": "Yes, the dip already happened. People saying it was so corona are retards, it dipped and consolidated below 50 after Q4 earnings.  \nThis is the start of another glorious bull run.", "score": 1, "replies": []}]}]}, {"body": "Thanks for the DD (Dunkin Donuts)", "score": 13, "replies": [{"body": "Welcome sir remember to grab your coffee on the way out", "score": 12, "replies": []}]}, {"body": "If beer virus breaks out in Taiwan you're screwed. All AMD's chips are made there now, just like Nvidia.", "score": 11, "replies": []}, {"body": "Oh now you fucks are on the AMD train after you abandoned Su Bae after ER?", "score": 16, "replies": [{"body": "That’s how amd works. You can’t hold through earnings but buy the dip right after. That shit is literally a full proof strat.", "score": 13, "replies": [{"body": "This time is was extra dippy due to the beer virus. TO THE MOON!", "score": 7, "replies": []}]}, {"body": "Her picture is still framed on my endtable..", "score": 10, "replies": [{"body": "Do you look at it while beating the stick?", "score": 3, "replies": [{"body": "No thats what i pay hookers for.", "score": 2, "replies": [{"body": "Do they look like Su Bae?", "score": 2, "replies": [{"body": "That's actually not a bad idea...", "score": 7, "replies": []}]}, {"body": "Look at you big spender.", "score": 0, "replies": []}]}]}]}, {"body": "This literally happened every single ER for years. Autists don’t learn, that’s why we’re both autistic and retarded 👌", "score": 1, "replies": []}, {"body": "Post ER is BTFD always on AMD", "score": 1, "replies": []}]}, {"body": "WSB to start pumping AMD because algos", "score": 8, "replies": [{"body": "I'M ON BOARD WITH THIS IDEA.", "score": 3, "replies": []}]}, {"body": "Sir, this is a MacDonald.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 12, "replies": [{"body": "but this is Wendys", "score": 7, "replies": []}, {"body": "I wonder how many people here actually work at MacDonalds 🤔", "score": 4, "replies": [{"body": "Nobody, cos it’s ‘McDonald’s’", "score": 2, "replies": []}]}]}, {"body": "So.... puts?", "score": 10, "replies": []}, {"body": "amd = a million dollars", "score": 5, "replies": [{"body": "Literally, check out the surgeon on the other post!", "score": 3, "replies": []}]}, {"body": "counter to point 5: AMD's current driver situation for GPU's is a fucking nightmare. A fair amount of the user base has been RMA'ing and returning them in favor of Nvidia which currently has zero driver issues to speak of. Theyre rapidly losing consumer confidence from long time users in that sector (myself included).\n\nI agree with the rest of your points though", "score": 6, "replies": [{"body": "IMO AMD has historically had more driver issues than Nvidia. I stopped buying AMD cards 10 years ago because of that.", "score": 2, "replies": [{"body": "Yea but the releases since the 5700xt have been exceptionally aweful. My whole machine will just shut itself the hell down like i flipped the power switch on the back if i try to launch some new games that use direct x 12 (outerworlds being the one that pissed me off the most), or occasionally when doing gpu intense tasks (3d rendering, extremely detailed 3d CAD, slicing elaborate STLs for 3d printing) I do get occasional black screen where i have to hard restart the machine as well to get everything to come back just randomly for seemingly no reason as well. The rest of the rig functions perfectly, and did before i pulled my 1070 out, reformatted windows, and dropped a red devil 5700xt in there.\n\nThese are known issues that have actually gotten worse for some people since the Adrenaline 2020 release, and AMD hasnt commented on them at all other than to acknowledge their existence. It doesnt inspire much confidence in me, in fact it makes me want to ebay my red devil and go grab a 2070 super....", "score": 1, "replies": []}]}]}, {"body": "The stock didn't move in 2013 when the PS4 and and Xbox One were announced and released", "score": 4, "replies": []}, {"body": "Best DD all day.", "score": 3, "replies": []}, {"body": "I was autistic and sold both my $48 calls yesterday.", "score": 3, "replies": [{"body": "Same", "score": 1, "replies": []}, {"body": "RIP theres hopefully still a chance if we see a dip in the coming weeks", "score": 1, "replies": []}]}, {"body": "You son of a bitch, I’m in", "score": 2, "replies": []}, {"body": "Im set to sell all mine if AMD hits $60\n\nMake a cool 3.5k", "score": 2, "replies": [{"body": "$60 is nice, but $75 is even nicer. Give it a year and we'll be looking at when $100 might happen.\n\nSelling is probably a good idea, then use it all on leaps.", "score": 1, "replies": []}]}, {"body": "What what you are saying is that my apple and amd stocks and gonna go the big stonke", "score": 2, "replies": []}, {"body": "Hi! I'm new to options trading. What does 20/6 80c mean??", "score": 2, "replies": [{"body": "He means his strike price is at $80 Call with an expiration of June 20.", "score": 3, "replies": [{"body": "So how does he profit with this play??", "score": 1, "replies": []}]}]}, {"body": "I’m with you bro. I’m in $3500 on the next dip. That’s all I can bet 🤷‍♂️", "score": 2, "replies": []}, {"body": "Time to buy some leaps", "score": 2, "replies": [{"body": "See you on the moon 🌕", "score": 2, "replies": []}]}, {"body": "Yea you may be right it could double again.. that’s why I have straight calls as well.", "score": 2, "replies": []}, {"body": " you’re on to something here.", "score": 3, "replies": []}, {"body": "On point 4: while this is promising, google it launching/promoting Stadia which may cut some portion of the gaming market share. IANAE by any means, but I think it's worth mentioning. In the same fold, consider that AMD was very vague about their data center and server business model, so it could stand to reason that if they don't make up the market share in the data center/server area, combined with potential loss of revenue from console sales, it may not break even in the overall gaming market. \n\nThis is just my speculation, though and if you don't like it you can read the sticky comment below.", "score": 3, "replies": [{"body": "Eat my dongus you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 22, "replies": []}, {"body": "Stadia uses amd gpus", "score": 6, "replies": []}]}, {"body": "at this point willing to be SU BAEs personal foot slave", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "I think it’s a good time to sell calls at a high strike.. people are excited about the stock so they are willing to pay big premiums but I feel like it might have a slow year due to the fact it was up 100% last year and was one of the best performers in the market...\n\nI’m doing call credit spreads so i don’t limit my upside too much..", "score": 1, "replies": [{"body": "Previous performance does not affect future performance. Besides Stadia, PS5, and XBOX X series currently use AMD Chips already which will be added to the ER of AMD.", "score": 2, "replies": []}]}, {"body": "I knew some of these things. I was gonna say I need more amd, short put spreads and covered calls it is. Maybe some leaps.", "score": 1, "replies": []}, {"body": "this smells of tendies.... You better post your positions the minute you buy so I can match them later you bastard", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Too poor for that. My portfolio is only 230$ lmao", "score": 1, "replies": []}]}]}, {"body": "Hey I’m new to stock and I have been wondering what does 20/6 80c or 18/7 80c mean? Was looking at MSFT and saw the same type of numbers too", "score": -5, "replies": [{"body": "The \"c\" at the end of the number means \"Chad\". We all aspire to be big dicked Chads, so always buy any available Chad option to maximize gains.", "score": 7, "replies": []}, {"body": "Alright, apparently 90c, the c refers to the strike price. And you can sell options before they hit their strike and still make a profit--according to theta decay, which means the father they are from expiration the more they're worth. That's all I know.", "score": 2, "replies": []}, {"body": "[removed]", "score": 2, "replies": [{"body": "This guy is fucking with you cause he knows you're new, don't listen to him.", "score": 6, "replies": []}]}]}]}
{"title": "Went all in on MSFT and SPCE calls today. Did I just ruin myself again or tendies? I need your expert opinions.", "selftext": "[removed]", "id": "f2f0sg", "created_utc": 1581455132.0, "score": 55, "upvote_ratio": 0.88, "num_comments": 82, "comments": [{"body": "Yes. you're fucked. You bought 11-month OTM calls and the stock dropped a measly 2% today. You've owned the contracts for all of 6 hours.\n\nYou should sell all tomorrow right as market opens. You're money is gone. You did a stupid thing. You'll never make gainz.\n\nOh also, no, you're fine. STFU and hold through the dip and stop being a worried little bitch boi.", "score": 232, "replies": [{"body": "[deleted]", "score": 28, "replies": [{"body": "It makes 0.26% of a difference.", "score": 58, "replies": [{"body": "I drink piss in my martini", "score": 14, "replies": [{"body": "ok bud. Don't forget to put your helmet on.", "score": 5, "replies": []}, {"body": "Now that’s a dirty martini 🍸", "score": 3, "replies": [{"body": "Imma fuck yo bitch (ooo)", "score": 1, "replies": []}]}, {"body": "Why?", "score": 1, "replies": [{"body": "It's sterile and he likes the taste.", "score": 1, "replies": []}]}]}, {"body": "It’s actually 13% of a difference tho", "score": 1, "replies": [{"body": "If you're taking 0.26% of 2% and not 100%.", "score": 2, "replies": []}]}, {"body": "Maths", "score": 1, "replies": []}]}]}, {"body": "I feel personally attacked...\n\nJk you right, I need to hold and not be a worried little bitch gurl.", "score": 5, "replies": []}, {"body": "Thanks for the motivation. And I will do my best to stop being a worried little bitch boi and to become a calm big bitch man.", "score": 3, "replies": []}, {"body": "Exactly.", "score": 2, "replies": []}, {"body": "I came here to say this. Well done.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 58, "replies": [{"body": "They make options that expire later than the same week?", "score": 15, "replies": []}, {"body": "[deleted]", "score": 11, "replies": [{"body": "life favors the bold, I’m rooting for you dawg", "score": 12, "replies": []}, {"body": "Well played. You got this.", "score": 3, "replies": []}]}]}, {"body": "I think you earned yourself that extra point good sir.", "score": 34, "replies": []}, {"body": "That's disrespectful to Microsoft. Sell me those $300 calls for 1/15/2021, I'll show you how it's done.", "score": 35, "replies": [{"body": "Tbh I could spend the free money better than you", "score": 7, "replies": []}]}, {"body": "Ban for being an attention-whore", "score": 30, "replies": [{"body": "This was really more a cry for help. I think I'm coming to the realization that I'm a degenerate gambler.", "score": 0, "replies": [{"body": "lol degenerate gamblers don’t buy leaps dude", "score": 2, "replies": [{"body": "I guess this is my attempt to reform myself. \n\nSo far I lost all my savings trying to day trade biotech penny stocks, selling two week puts on high IV companies I knew nothing about (one went bankrupt and wiped me out), and buying weekly calls that didn't pan out. As you can see I'm pretty good at this.", "score": 0, "replies": []}]}]}]}, {"body": "From some of these comments I think this is a comedy group", "score": 15, "replies": [{"body": "This is serious business.", "score": 12, "replies": []}, {"body": "That may be the best part about this damn subreddit, that or the daily minor SEC infractions, tough to decide", "score": 6, "replies": []}]}, {"body": "Dude you don't know what you're doing. You may as well just go to a casino and play the roulette table.\n\nIf you want to feel like you have a can't lose strategy no one has ever thought of before: Put $1 on red...if it loses, then double it on red again. Keep on doing that until you make back the $1 and then rinse/repeat. The odds of you losing like 12 times in a row are very low; so this strategy can't lose.\n\nFor your education:\n- Theta isn't very relevant on the very long dated options you purchased.\n\n- The problem is that even if MSFT goes up 2% tomorrow, you're hardly gonna get any gain on your option. The same is true if it drops 2% as well actually.\n\n- If you have a specific reason to get LEAPs beyond just \"shorter term burned me last time\" then okay....but I doubt that you do.\n\n- April/May and/or 2/28 would have been better plays on MSFT today\n\n- You should NOT have gone in on SPCE today. It was up a lot yesterday and was up a lot today. You should have waited for it to be down for the day.\n\n- IV is high on both of these right now. Who knows when it's going to go down on either.", "score": 13, "replies": [{"body": "Thank you for your insights. You make some good points.\n\nAnd you're right that I don't entirely know what I'm doing. That's why I'm reaching out to the masterminds here to see if I've screwed myself again. All I know for sure is that I'm a degenerate gambler and should probably stop.", "score": 1, "replies": []}, {"body": "LEAPs are almost always good idea... SPCE has massive growth potential, while MSFT is a steady grower, and will probably hit strike proce by then. Weeklies generally require catalysts unless you're using calendar spreads for steady profits (usually), while LEAPs require no specific catalyst, since the market's natural state is up. Unless we find ourselves in recession, he'll be printing by exp. date.", "score": 0, "replies": []}]}, {"body": "OP, in all honesty you should forget about these positions for a couple of months and just let time do it’s thing.", "score": 11, "replies": [{"body": "Prob best answer here", "score": 4, "replies": []}, {"body": "My gut tells me this is the right answer. I will do my best to forget about these positions for a while. In reality, I will probably check Robinhood 100 times a day and give myself heart palpitations for the next year.", "score": 2, "replies": [{"body": "The first time you drop $400 in a day on the contracts you’ll be tempted to sell so that you don’t lose more money. \n\nYou MUST have patience and you MUST ride the ups and downs. Today my SPCE calls went up 30% and then dropped to -5% and it was tempting to sell and prevent from losing more, but 5 hours later they shot back up to 30%. \n\nYour contracts are good for a year. You have PLENTY of time for any losses to recover so don’t let yourself get stressed if in 1 day or 1 week or 2 months you’ve lost money.\n\nDiamond hands ✊🏻💎", "score": 2, "replies": [{"body": "✊🏻💎", "score": 2, "replies": []}]}]}]}, {"body": "Why the fuck would you buy 2 contracts for $840? Your SPCE call will be in the tendies all day everyday, but fuckin A man lmao", "score": 9, "replies": [{"body": "I have no idea why I do these things. I hope space is real because if flat earth turns out to be true, then my SPCE calls are screwed.", "score": 1, "replies": [{"body": "Holy fuck you might actually be a retard. Look, calm down. Patience is key in this shit. If you bought them that far out, try not to check your phone 24/7 like the rest of us. It will help your stress a bit", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 7, "replies": [{"body": "Help me", "score": 1, "replies": []}]}, {"body": "I literally doubled my position on msft at the end of trading. 40xmsft 182.5c 2/28. \n\nThis is the way.", "score": 5, "replies": []}, {"body": "[deleted]", "score": 13, "replies": [{"body": "To be fair almost every day in the last 6 months have been new ATH for Microsoft.", "score": 11, "replies": []}, {"body": "I have the opposite problem I think. My brain keeps telling my hands to fold my position, take profit, cut losses, etc., but my retard hands won't listen as my money slowly goes down the drain. Next thing you know I'll be on Stocktwits for that next hit of hopium to convince myself to keep holding because tomorrow we are going to the moon where there will be lambos full of blow and hookers.", "score": 1, "replies": []}]}, {"body": "$SPCE is going to the moon got earnings next week I believe and apparently its expected to be good.", "score": 8, "replies": [{"body": "Think earnings are today", "score": -3, "replies": [{"body": "Both wrong - 2/25 - next week is the barclays conference", "score": 7, "replies": [{"body": "Oh gotcha thanks", "score": 3, "replies": []}]}]}]}, {"body": "You’re gonna be fine. Hold on tight tho, the seas be stormy 🏴‍☠️", "score": 3, "replies": [{"body": "No 👀- guaranteed tendies, choice of sauce", "score": 1, "replies": []}]}, {"body": "The only way you can fuck this up is to sell earlier than November.", "score": 3, "replies": []}, {"body": "How disciplined can you be with LEAPs?\n\nI own both and went for monthlies which I intend to roll if all goes well.", "score": 3, "replies": []}, {"body": "Did you mean to write 2020 above?  The year is 2020 not 2021.", "score": 3, "replies": []}, {"body": "You guys all got long calls on MSFT, my retarded ass places a 190 Call 02/19... I think im fucked", "score": 3, "replies": []}, {"body": "OP did the smartest thing he could by not buying FDs and buying next year fucking call options and he’s having an anxiety attack.\n\nThis fuckin guy is so dumb he doesn’t even know he did something smart", "score": 5, "replies": [{"body": "This is one of the nicer things anyone has said to me.", "score": 2, "replies": []}]}, {"body": "Yeah sell them thats what I was thinking, I was just like yeah this guy made a huge mistake he should totally sell all of that please sell", "score": 2, "replies": []}, {"body": "Well since you bought LEAPs your not gonna be doubling or tripling your money from one big jump.. but your also not gonna lose all your money anytime soon.. just hold them and if the stocks do above average this year you will do fine... \n\nIf you truly want to go all in for a huge return you have to buy much shorter out and lower strike..\n\nI have MSFT LEAP’s that expire June 2021 and I’m up over 300% already so they can work out real nice..", "score": 2, "replies": [{"body": "That's good to know. And nice on your LEAPs! That's awesome. Do you have an exit strategy or goal ROI?", "score": 1, "replies": []}]}, {"body": "\"expert opinions\"", "score": 2, "replies": []}, {"body": "I have a good feeling about this guy. I think ill follow you when I sell my DIS calls next week", "score": 2, "replies": []}, {"body": "I got some $190c 01152021", "score": 2, "replies": []}, {"body": "Only thing you need to be worried about is what color ferrari you'll be picking out while your young and hot wife is making you sandwiches son", "score": 2, "replies": [{"body": "That's what I'm saying. Are we taking your yacht or mine to the gala?", "score": 2, "replies": []}]}, {"body": "SPCE is easy money. MSFT will be close.", "score": 2, "replies": []}, {"body": "Sold my SPCE calls so it should moon. You're welcome.", "score": 2, "replies": []}, {"body": "your spce contract is worth $4.05 now\nso u r getting some gains?", "score": 2, "replies": []}, {"body": "Wtf Microsoft after hours blowing up", "score": 3, "replies": [{"body": "Are we even looking at the fans Microsoft?", "score": 1, "replies": [{"body": "Dog my shit blew up for a sec after hours and said it was up $2.70 after hours then went back down like a min later.", "score": 1, "replies": []}]}]}, {"body": "Weak. Get something medium short term. The money printing party ain’t gonna last forever.", "score": 1, "replies": []}, {"body": "!Remindme 280days", "score": 1, "replies": [{"body": "I will be messaging you in 9 months on [**2020-11-17 22:14:50 UTC**](http://www.wolframalpha.com/input/?i=2020-11-17%2022:14:50%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/f2f0sg/went_all_in_on_msft_and_spce_calls_today_did_i/fhca4dr/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Ff2f0sg%2Fwent_all_in_on_msft_and_spce_calls_today_did_i%2Ffhca4dr%2F%5D%0A%0ARemindMe%21%202020-11-17%2022%3A14%3A50%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20f2f0sg)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}]}, {"body": "Please get rid of the Normies", "score": 1, "replies": []}, {"body": "Your gay", "score": 1, "replies": []}, {"body": "Leaps are great if you have more than one account and use one of them to hold nothing but long-term stuff. Also, leaps are great if anything tanks a lot.", "score": 1, "replies": []}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. Find more YOLOs here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da. \n\nYOLO flair is for dank trades only. If you misused the flair please change it. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}, {"body": "I am brand new to this terminology, can someone please explain to me what \" $30 SPCE Call 1/15/2021 - I paid $380 for the contracts at $3.80 per share. \" and \" $240 MSFT Call 1/15/2021- I paid $820 for the contracts at $4.10 per share. \" means please?", "score": 0, "replies": [{"body": "Options. They're priced at say, $1 for a 3/20 $100 strike.\n\nThis means that the buyer is betting that the stock will hit $100 by 3/20. They buy the contract for $1/share x 100 shares. So they buy the contract for $100.\n\nIf the stock hits the strike price or exceeds by 3/20, the contract holder can buy 100 shares for the $100 price, even if the stock is at say $110. The contract holder profits $10/share because they can buy for $100 and sell immediately for $110.\n\nMost people just buy the contracts to sell without exercising the right to buy. The contracts fluctuate in value based on the likelihood of the stock hitting the strike price.\n\nFor the MSFT contract, OP bought 2 contracts which is why he paid $820 instead of $4.10.", "score": 3, "replies": [{"body": "Thank you, that all makes sense. The only question I have is, I see Microsoft is at 184.44 so where does the $4.10 figure come from?", "score": 1, "replies": [{"body": "The market price for the contracts.", "score": 1, "replies": []}]}]}, {"body": "It means they bought a contract giving them the *option* to buy (number of contracts x 100) shares of SPCE at $30 a share before or on 1/15/2021. They paid $3.80 per share for the contract so in this case they bought 1 contract for $380.", "score": 2, "replies": []}]}]}
{"title": "Let’s see some loss porn on those MSFT calls", "selftext": "[deleted]", "id": "f2g93h", "created_utc": 1581459723.0, "score": 54, "upvote_ratio": 0.92, "num_comments": 88, "comments": [{"body": "Anyone with a brain has calls farther out than 2 weeks and therefore have not realized any losses yet. This is just a courtesy stop on the way up for any last retard bears to get on the train to tendieland.", "score": 120, "replies": [{"body": "No one has a brain here", "score": 14, "replies": [{"body": "I think that’s the point", "score": 3, "replies": []}]}, {"body": "People keep telling me to sell because of theta but I don’t know how bad that effects my 3/6 $195 and $200 calls I bought on friday. Better to hold for gains or sell to avoid losing money from theta? How bad will theta or time decay or whatever fuck me???", "score": 9, "replies": [{"body": "Hold them janks. Gonna print you some tasty tendies.", "score": 7, "replies": []}, {"body": " [https://www.optionsprofitcalculator.com/calculator/long-call.html](https://www.optionsprofitcalculator.com/calculator/long-call.html)\n\nThe calculator isn't perfect but it's pretty fucking good.", "score": 8, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "This sub is full of retards. How retarded can you be to think you would find big brain players here? This is a get rich quick sub and we are here to buy calls.", "score": 9, "replies": []}, {"body": "It does take into account theta, you retarded autist. The table of returns gets lower or higher depending on the day the underlying stock reaches a given price. That's theta.\n\n&#x200B;\n\nGo back to kindergarten.", "score": 11, "replies": []}, {"body": "Umm.. It kinda does? Because Theta is related to time, so just look at the change in profit at the same price point as you move right across the table. Because the Horizontal axis of the table is days of the month.", "score": 6, "replies": []}]}]}]}, {"body": "Started last week. Still figuring out my own method of gaining tendies.\n\nMade an EXAS call ending this week I'll most likely lose on.\n\n2 weeks, let alone 1 week calls WILL NOT be my future M.O", "score": 11, "replies": [{"body": "Same situation here. There’s a reason the options near expiry or way OTM are cheap. Theta fucks the poor mercilessly", "score": 1, "replies": []}]}, {"body": "Wait u guys buy calls 2 weeks out?", "score": 8, "replies": [{"body": "Lol", "score": 3, "replies": []}, {"body": "they're too expensive", "score": 3, "replies": []}]}, {"body": "If you buy anything that expires in less than 10 trading days you better be willing to lose it all", "score": 3, "replies": []}, {"body": "Bitchcoin please !!! You cold... You’ll get baptized if you don’t think this market is a day to day thing at this point.", "score": 0, "replies": []}]}, {"body": "down $50.00\n\ndo you know how many value meals at mcdoanlads that is? \n\ntying my noose as we speak", "score": 33, "replies": []}, {"body": "r/all got flushed", "score": 26, "replies": [{"body": "Worth it", "score": 1, "replies": []}]}, {"body": "I lost over $5000 in MSFT calls...all of them have an expiry of 2/21. Looks like my tits are going up...", "score": 51, "replies": [{"body": "ur fine with 2 21 just be patient, 2 14 on the other hand...", "score": 34, "replies": [{"body": "That’s what people keep telling me", "score": 6, "replies": [{"body": "panic sells + investigation is causing a reactionary dip so dw", "score": 9, "replies": [{"body": "ITS NOT AN INVESTIGATION ITS A “STUDY”!", "score": 2, "replies": []}]}]}, {"body": "I want to believe", "score": 5, "replies": []}]}, {"body": "$2200 here brother, same expiry.\n\nBack to the moon tomorrow though, just you wait", "score": 14, "replies": [{"body": "i got 2/14 expiry smh- but I bought them like 3 weeks ago so im not that fucked", "score": 3, "replies": []}]}, {"body": "Strike price?", "score": 4, "replies": [{"body": "$196.07", "score": 3, "replies": []}, {"body": "Strike: $187.50 \nBreak even: $191.45", "score": 2, "replies": []}, {"body": "197.5", "score": 1, "replies": []}]}, {"body": "Let's see them tits", "score": 1, "replies": []}, {"body": "2/28 202 & 210 for me.\n\nI’m not dead yet", "score": 1, "replies": []}, {"body": "Do some puts to stop the bleeding", "score": 1, "replies": []}]}, {"body": "Waited until this morning to buy my $200 3/20 calls. Autist confirmed.", "score": 30, "replies": [{"body": "Lmao", "score": 7, "replies": []}, {"body": "There's still time my fellow chromosome-lacking shell of man!", "score": 3, "replies": []}]}, {"body": "Lost $65.00 on 4 calls of MSFT $200 2/21", "score": 10, "replies": [{"body": "$200 2/21 yikes", "score": 6, "replies": [{"body": "Wasn’t it $194 two days ago? It was the peak but don’t act like he’s absolutely mental. Just slight retardation.", "score": 1, "replies": []}]}]}, {"body": "Not MSFT, but taken down due to the same reasons. AAPL C $350 Apr 17\n\nhttps://imgur.com/t1iXFiM", "score": 11, "replies": [{"body": "You're off the topic, considering banned", "score": 13, "replies": []}, {"body": "Don't want to alert you or anything, but you might be fucked.", "score": 2, "replies": []}]}, {"body": "Something told me to take some profit this morning and move on, glad I did.", "score": 9, "replies": [{"body": "Can I borrow something?", "score": 6, "replies": []}, {"body": "Same lol. Right after the peak. Glad that 24/7 market studying the past month paid off for once.", "score": 2, "replies": []}, {"body": "I should've too, but I got too greedy. Damn.", "score": 2, "replies": []}, {"body": "Is there a way to set up a limit order for options? I don't see it in the same place as they are for regular stocks. Or do you just go to sell, input the price you want for it, and wait?", "score": 1, "replies": [{"body": "Sure, and stop loss too, how you do it depends on your brokerage.", "score": 1, "replies": []}]}]}, {"body": "Doubling down and buying more calls tomorrow. Idgaf", "score": 14, "replies": []}, {"body": "I got 2/21 200c and 2/28 195c. Bought at 187 today but wish I would've held back till it dropped more. The more you know..", "score": 7, "replies": []}, {"body": "We'll see tomorrow. Basically went all in on MSFT calls near end of day with 8k. Plan to dump another 3-6k tomorrow if it dips more. I've made a lot the past month and a half so kinda going bigger than usual here", "score": 6, "replies": []}, {"body": "iTs liTeRaLly fReE mOneY", "score": 11, "replies": [{"body": "Even more so now", "score": 10, "replies": []}]}, {"body": "Riding support\n\n[https://www.tradingview.com/x/R7nFmfQU/](https://www.tradingview.com/x/R7nFmfQU/)", "score": 8, "replies": [{"body": "you and this chart have given me lots of hope. How reliable is this? and how can i learn to do this myself?", "score": 2, "replies": [{"body": "Never trust a man that uses heikin ashi bars", "score": 1, "replies": [{"body": "read up on it. i see what you mean. thx for letting me know.", "score": 1, "replies": []}]}]}]}, {"body": "It's awfully quiet in here folks", "score": 3, "replies": [{"body": "They had one day of downsies. And not that much really, just puts us back where we started yesterday. Not much loss to be had, esp for people with 30-45+ day expirations.", "score": 1, "replies": []}]}, {"body": "Lost %50 of my 2/14 192.5c", "score": 5, "replies": []}, {"body": "I’m done 200 with 185 $ calls 3/20 lol", "score": 4, "replies": []}, {"body": "Lost 500 bucks today but they're 3/15 through 3/27 calls so Imnot fuckingleaving!", "score": 3, "replies": []}, {"body": "Made a decision to FOMO shares instead of calls. Probably the wisest thing I did. \n[here](https://imgur.com/gallery/VoZkUR0)\n\n\nOnly down 250 bucks cause I kept buying the dip.", "score": 3, "replies": [{"body": "Way more shares than I was expecting", "score": 5, "replies": [{"body": "Dip* ok 10 shares..... dip* ok 10 more shares..... dip* dip dip dip dip", "score": 3, "replies": []}]}]}, {"body": "I sold on the spike, nothing to post here", "score": 3, "replies": []}, {"body": "I sold at $188 and made my first ever tendies", "score": 3, "replies": [{"body": "Congrats. It only gets worse from here.", "score": 1, "replies": []}]}, {"body": "Loss porn? I'm down 15% today but my 6/19 $190c pre ER are still up 426.96% (that's so close to $420.69 I can TASTE IT)", "score": 2, "replies": []}, {"body": "$200 MSFT calls for 2/21, LETS DO THIS!", "score": 2, "replies": []}, {"body": "https://imgur.com/VVHpBwN\n\nBoring day. Still up 2k", "score": 3, "replies": [{"body": "Better than rainy day", "score": 2, "replies": []}, {"body": "Ur fucking rich.", "score": 2, "replies": []}]}, {"body": " [https://imgur.com/a/HxYVXi1](https://imgur.com/a/HxYVXi1)", "score": 1, "replies": []}, {"body": "Sold 2 contracts today for a small profit but still ended up down a bit.. [ msft $210 5/15 & $220 6/19 ](https://imgur.com/a/hMFi3UG)", "score": 1, "replies": []}, {"body": "Glad I locked in $6K on MSFT before it took a shit on itself", "score": 1, "replies": []}, {"body": "Down $300 but I've got until April for it to recover", "score": 1, "replies": []}, {"body": "Here you go. Enjoy.\n\n\nhttp://imgur.com/gallery/cWZzNG6", "score": 1, "replies": []}, {"body": "[If you play them out 30 plus days isn’t that bad](https://i.imgur.com/ATqPu4V.jpg)", "score": 1, "replies": []}, {"body": "actually eeked out a small gain panic selling on that first big 5 min drop at open and then just turned back around and bought more at the end of the day. wish me luck", "score": 1, "replies": []}, {"body": "Down about 3k but still up like 10k overall. Mostly 3/20 and 4/17 exp. plenty of time for more tendies", "score": 1, "replies": []}, {"body": "Up 4 k brother", "score": 1, "replies": []}, {"body": "would i be retarded to buy some MSFT 3/6 $200 calls?", "score": 1, "replies": [{"body": "Look at this smart motherfucker. Fuck this guy.", "score": 1, "replies": []}]}, {"body": "I still have gains because I bought them a week ago.", "score": 1, "replies": []}]}
