{"title": "Noob question for a beginner. are Tesla, AMD, and Nvidia good investments?", "selftext": "[removed]", "id": "oun4vl", "created_utc": 1627659984.0, "score": 6, "upvote_ratio": 0.64, "num_comments": 74, "comments": [{"body": "Hello! It looks like you might have submitted a post about getting started, looking for book/YouTube/podcast recommendations, or another commonly asked question on /r/StockMarket. To help new investors and traders with these questions, we created a comprehensive [market toolkit](https://github.com/ckz8780/market-toolkit) which has lots of resources for new and experienced traders alike. Here are some direct links in it that you might find useful:\n\n- [Getting Started](https://github.com/ckz8780/market-toolkit#getting-started)\n- [Books](https://github.com/ckz8780/market-toolkit#books)\n- [YouTube Channels, Talks and Speeches](https://github.com/ckz8780/market-toolkit#youtube)\n\nThe phrase or keyword that triggered this response was \"**Noob**\". Here's [a customized link that will search the whole subreddit](https://www.reddit.com/r/StockMarket/search?q=Noob&restrict_sr=on&sort=relevance&t=all) for the same topic.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/StockMarket) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "I would recommend going into a broad market index fund such as VTI or something similar. \n\nYou’ll still be buying the “cool” stocks such as apple, tesla, Msft but in a more balanced way. \n\nOnce you understand your goals, time horizon and expand your knowledge then start going after individual stocks.", "score": 11, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "Based off the limited input you’ve shared I really can’t encourage them enough as it seems you are very green in regards to investing. \n\nTo answer your question, it’s not very low profit from index funds. Index funds as a whole typically target average annual returns around 8%. Which I am happy with. \n\nLet me ask you a question. What returns do you expect to make annually on your investment?", "score": 9, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Reread it and shit this was a waste of my time. Beuno Suerte OP. Lol", "score": 3, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Bro, people that make millions and millions of dollars and handle billions of dollars can't predict if a stock is going to go up, down, or sideways.  Why do you think reddit can help you and if it was as easy as you're wanting it to be wouldnt we all be billionaires?", "score": 3, "replies": []}, {"body": "You have to think about what 8% yearly compound growth will do to an account over a period of years. The stock market is not a get rich quick scheme. Start investing with $500, but keep adding to it Monthly and you'll be shocked by how fast it grows. 5-10 years later you can look back and be proud.", "score": 2, "replies": [{"body": "[removed]", "score": -2, "replies": [{"body": "Dude go find a gambling sub then. Good luck on winning the lottery.", "score": 5, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Yea then just take that. If you want to add s a bit more risk you can also try industry indexes like tech for example which has been returning more than market for the past decade. There is also the nasdaq index which has more tech weight than the s&p.", "score": 1, "replies": []}]}]}, {"body": "It's also not realistic.\n\nA job in an office may seem ridiculous compared to movie stars who make tens of millions.  But for every movie star there are thousands who tried and failed, and millions who work an ordinary job and manage to get by.  Is there any reason you think you could be the one in millions who could achieve that kind of success, even though almost everyone who tries it ends up failing?\n\n8%/yr doesn't sound exciting, but it works.  That level of return means that getting in early and continuing to save you can have a comfortable retirement some day, almost guaranteed.", "score": 2, "replies": []}]}]}]}, {"body": "[removed]", "score": 0, "replies": [{"body": "You are about as likely to be hit by a meteor as you are to get 30% returns a year  longterm.  Nobody does that.", "score": 3, "replies": [{"body": "[removed]", "score": -1, "replies": [{"body": "If you've only got $500, buy up the cruise stocks now and HODL until next summer.", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Carnival, Royal Caribbean. \n\nCruises will be canceled soon, meaning no customers, meaning lower prices.\n\nBy next summer, 100% of people won't give a fuck about Covid as opposed to the 50% that still do now, and everything will go back to normal.", "score": 1, "replies": []}, {"body": "On a side note, if you really want to gamble, buy long term call options and risk it all.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[removed]", "score": -1, "replies": [{"body": "Look, I have a friend who study medicine and trade and he thinks PFE is the best pharma investment ATM, I think GOOGL and MSFT are  among the best tech investments ATM. But all the time someone is wrong. Not an investment advice. So you can bet on individual companies or buy broad index fund SP500, that has an expected return 4÷ per year in the next 10 years (slower growth or bear market highly possible), according to John Boggle.", "score": 1, "replies": []}]}]}]}]}, {"body": "Everyone has different needs and focus.  There are riskier funds that provide an interesting return.  Principal’s CMNWX is one, Vanguard has a very similar one.  Likely all the brokerages have one or more.  But things like age, goals, research decide these things, especially so if it’s a retirement account.", "score": 1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "Good.  You must start somewhere.  That you’re even considering The Market at your age is good.  Like that other person wrote, the funds are for you right now.  They have a bunch of companies within them, and there is much to learn by simply watching.  Consider the money lost to you personally.  Leave it in the account and learn what you will simply by watching.  Graduate, become employed, invest more as you go along.  You’ll do fine.", "score": 1, "replies": []}]}]}]}, {"body": "I like funds because I self guide my accounts/positions, funds are not usually as volatile, and why not take advantage of a professionally managed fund with good history?  So I agree with your suggestion.  But I did buy a tiny bit of AMZN at the surprising low this morning because … I could.  Studied it for a couple weeks, understood the dip, bought.  Feel pretty good.  First straight stock purchase.", "score": 1, "replies": []}]}, {"body": "K, supply and demand. say, If the masses are bullish on tesla the demand increases and (most of) the supply doesnt because they like the stock and want to keep it, the price per share will go up because to buy it you’re going to need to pay up to the sellers price as they are in control, same goes if the masses were bearish (not a positive outlook) there would be more supply (to sell) and less demand to buy so price would drop to meet the price that buyers would do business with them. With that said, events & catalysts themselves don’t move nothing, it’s the reaction or run up to them that you get price changes IF the masses deem it worthy to play, either side long or short. If some rooms didn’t pump certain news for penny stocks they wouldn’t go because there wouldn’t be the demand (in this case a pump). So “it should increase” isn’t a guarantee, think in probabilities. It probably will but you never know, don’t anticipate, react. As for finding companies that are good to invest in for the long term that can net you triple baggers 100%+ers charting doesn’t mean anything compared to financials for investing, BUT mix them together so for your entry use the weekly and monthly charts not daily you’re INVESTING not trading there’s a difference (if you plan to trade you need to learn a lot more)I don’t use indicators anymore but something traditionally used for entries by hedge funds and investors is the 200 SMA & the 72 SMA, and then use the financials to find what company is suited best for long term GROWTH key word growth you need them to grow so they have more potential market cap and market share, growth comes in many forms from companies just getting going and from who’ve been but maybe are in current down trend but have potential as they made management changes and got their financials into place (paid off some debt, more cash on hand, etc.). Year over year growth and quarter over quarter growth is what you want to see and the more the better as your investment would churn more of a profit faster, keep in mind the tax on capital gains.   I like AMD but I’m not big on NVDA and TSLA for investing but I play all of them, traded $AMD today. Tesla is great but people are buying for Elon not as much the cars itself, but that’s me any questions let me know. You can ignore me if you want to maybe someone finds it useful 💼", "score": 5, "replies": []}, {"body": "Well this is the top, then", "score": 4, "replies": []}, {"body": "amd is the best one to invest in right now, but i’d wait for it to drop to 80$, then go in (not financial advice)", "score": 3, "replies": [{"body": "[removed]", "score": -1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "then go with corsair, it was trading at 44$ just a few months ago, now it’s at 28$, great price to buy in imo, also the company is amazing, i bought most of their products and they’re top quality. \n\nps: i’m also invested in this stock.", "score": 1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "What ever the price is that’s how much it’s worth, so if it’s $28 and if it goes down to $20 you lose $8 for how ever many shares you bought at $28", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "It goes up and down from buying and selling MILLIONS of people are buying and selling if someone likes the company they will spend more money the stock goes up, if people don’t like the company and have stock they will sell cheaper to get rid of it as soon as possible", "score": 1, "replies": []}]}]}]}, {"body": "Love to see this. I was just thinking about Corsair and bought a couple of calls yesterday. Glad to see someone else agrees with my sentiment here.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "I have Tesla and AMD in my forever long portfolio and added bigly again last year’s sell off markets dip. I hope this answers your questions.", "score": 0, "replies": []}, {"body": "[deleted]", "score": 0, "replies": []}, {"body": "Almost anything tech especially the big names in their respective industries are good to look into.", "score": -2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "I have some partial shares of tesla(stash app) and i have a share of Nvidia both have done pretty well for me.", "score": 0, "replies": [{"body": "What is stash?", "score": 1, "replies": [{"body": "This word/phrase(stash) has a few different meanings. You can see all of them by clicking the link below.\n\nMore details here: <https://en.wikipedia.org/wiki/Stash> \n\n\n\n*This comment was left automatically (by a bot). If something's wrong, please, report it in my subreddit:* r/wikipedia_answer_bot \n\n*Comment `wab opt out`(without any other words) to opt out (wab stands for wikipedia answer bot). Note: you are opted in by default*\n\n*Really hope this was useful and relevant :D*\n\n*If I don't get this right, don't get mad at me, I'm still learning!*", "score": 1, "replies": []}, {"body": "Its an app similar to robinhood. Just doesnt offer crypto like robinhood does. I like it so far", "score": 1, "replies": [{"body": "Is stash the one where you pay monthly and it rounds down your bank account?", "score": 1, "replies": [{"body": "Never heard of rounding down but it has a monthly membership thingy only 9$ a month for what i have", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "I like Invidia. Not so hot on AMD, even though they have great product. Tesla is Tesla.", "score": 1, "replies": []}, {"body": "Ya hood is to GME AMC and tesla just buy what you want and robinhood is the best they halted stocks to lower the price so we could buy the dip only paperhands are mad at hood don’t be like those losers buy and hold", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Good question GME is hard to buy into but it’s getting closer to a good buy in it’s in dip now but soon will turn around. Robinhood is great app for trading stocks", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Dude get robinhood it’s the goat of goats", "score": 1, "replies": [{"body": "DONT listen to this guy robinhood sucks get Public.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Timing matters. Often investors buy on the top by accident.\n\nExample I have BABA in 2 separat accounts. Cost basis from 1 was $280(ouch) while another 1 was $135.", "score": 1, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "how about starting with penny stocks and workin ur way up the ladder to bigger and more higher dollar stocls. their are under cover golden penny stocks that havent yet hit their prime.", "score": 1, "replies": []}, {"body": "Yes", "score": 1, "replies": []}, {"body": "So, you are not asking about trades but investments. Therefore my answer is: read about how to calculate the intrinsic value of a company, read about how to read a financial statement, and only then invest in individual stocks. To start lightly I can recommend some YouTube: Sven Carlin, Everything Money (more on the value side of investing) and Joseph Carlson (more growth/dividend based).\n\nIf you do not want to do all of that, buy an etf instead. Lower risks, 8-10% return, almost zero effort needed.\n\nYou talk about \"going up several 100%\" etc, shamefully investing is much more boring than that. If you want to gamble instead of investing, maybe (probably) losing everything but maybe not, check out r/wallstreetbets and r/penny stocks, download Robin Hood, and have fun while it lasts.", "score": 1, "replies": []}, {"body": "I personally like LCID", "score": 1, "replies": []}, {"body": "I dont know why this stock hasn't drawn more attention. I know that there is a lot of folks out there that are looking to make quick 💰 🤑 💸  . I think this one might be the big play while we all watch the rest go down in flames with the Delta Variances scare that is happening. Im all ready balls deep into this one so im not asking for advice. The price target is a 500% upside and good news coming out weekly. With volume as high as 200 mil multiple times this week there has been substantial movement upwards. If we could get behind this one it will go far. \n\nNo shorts to worry about which means that there won't be hedgies that will manipulate this. \n\nJust trying to help others out.", "score": 1, "replies": []}]}
{"title": "Favorite Long Term Holds", "selftext": "I’m a long term investor. My strategy is to buy deep ITM leaps multiple years out. I then sells calls against it (PMCC). I will also never invest in meme stocks. \n \nI currently have leaps in LMND, TTD, AAPL, AMD\n\nWhat are your favorite long term stocks?", "id": "ounw01", "created_utc": 1627662323.0, "score": 47, "upvote_ratio": 0.88, "num_comments": 78, "comments": [{"body": "AAPL, TTD, UPST, and love/hate with ETSY.\n\nEdit: CRWD and TEAM have been good to me. Wish I’d bought more.", "score": 20, "replies": [{"body": "Given what happened to Amazon sales after covid reopening, I'd watch Etsy from side until their results are out. I sense couple of quarters of pain from them. I got out at 190. Will be back at 150s, if at all", "score": 7, "replies": [{"body": "Possibly. I’m at $192 basis with an open $3.70 call. Wedbush issued a “strong earnings beat” whisper earlier today. I guess we’ll just see. I’m in it for the long haul though. A few slow quarters won’t bother me.", "score": 1, "replies": []}]}, {"body": "been wanting to mess with etsy. may be time to dance with her again.", "score": 3, "replies": [{"body": "Honestly, I think it’s gonna perform long term.", "score": 3, "replies": []}]}, {"body": "Take a look at Pinterest (PINS) also.  I love me some Becky stocks.", "score": 1, "replies": [{"body": "I added 100 at 58 this morning… Average dropped to 64. I’ll sell calls at cost until next August to break even 🙄", "score": 2, "replies": []}]}]}, {"body": "SPYX, the sp500 without fosil fuel stocks", "score": 14, "replies": [{"body": "Good man", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 11, "replies": [{"body": "Since my account is still smaller i like to use stocks with higher IV than the ETFs.  I will eventually do the same with SPY and QQQ.", "score": 4, "replies": []}, {"body": "You are certainly going to beat Buy and Hold since even deeply ITM LEAPS can still provide you with decent leverage", "score": 2, "replies": []}]}, {"body": "What delta calls are you selling against the leaps, And what cycle? Monthly?", "score": 5, "replies": [{"body": "I generally stick to a delta around .30-.40 and will roll if I need to. I mix it up with time frames. Anything from weekly to monthly. I try to do a little technical analysis to predict the price movement. Generally I stick with the monthly", "score": 5, "replies": [{"body": "I just set one up on my paper account for Apple. Bought the June 17 2022 35 call, sold the august 27 150 call. Let’s see how it plays out 😊", "score": 4, "replies": []}]}]}, {"body": "$FUV for CCs.", "score": 4, "replies": []}, {"body": "TQQQ", "score": 3, "replies": [{"body": "all hail", "score": 3, "replies": []}]}, {"body": "I’m long all your companies as well. But I don’t think I would run a PMCC on these ones, so I’ve got some questions.  \n\nHow long have you been running PMCCs on them? It’s usually a strategy for a more mildly bullish outlook, but these companies are very bullish imo. Have the short calls capped your gains? Does the premium at least make up for that?", "score": 7, "replies": [{"body": "PMCC with a leaps as the long are great for the stocks like Apple that are blue chip growth.  They kind of always grind up over time rather than explode.  For APPL I sell right outside the expected move and slowly roll up the leaps side after big up days to realize some profit, don’t really recommend that because of taxes but I can’t really help myself.  If I see a nickel on the tracks I’m grabbing it", "score": 6, "replies": [{"body": "Oh yeah AAPL for sure would be a good one, might be my next one myself actually. I’m more asking about LMND, TTD and AMD, but my coffee hadn’t kicked in yet so I didn’t specify them hah", "score": 3, "replies": [{"body": "Just selling farther OTM and roll when needed. I never let my leaps get called away.", "score": 3, "replies": []}]}, {"body": "Noob here.  Just curious what happens when the call you wrote gets exercised in a PMCC situation? Don't you have to deliver the stock that day?", "score": 1, "replies": [{"body": "Yes, the broker will assign you a short position. If you don’t have buying power in the account to cover the short position and close for a loss you will need to sell your leaps to cover. But good news if your assigned on your short call your long call is printing.  This is what they SHOULD do. I say that because I never had a robinhood account but from my understanding they don’t let you short so I think they will probably just liquidate the leaps for you or give you a margin call. FYI it will not be as scary as you think. You will just need to close the leaps for a profit and buy to cover the short", "score": 1, "replies": [{"body": "Oh I use Schwab anyway.  Thanks for the reply.", "score": 1, "replies": []}]}]}, {"body": "Been looking at AAPL myself for LEAPs. Can I ask, how do you decide on what the expected move is?", "score": 1, "replies": [{"body": "The expected move is based off of the volatility for that options cycle. Honestly couldn’t tell you the exact formula but I am sure google would pull up a good investepedia article.  But, tastyworks has the expected move built in on its platform so I just use that.", "score": 1, "replies": []}]}]}]}, {"body": "MSFT, and COST. MSFT is basically a hedgefund with how diversified they are and how much cash they have on had. COST just won't stop growing and their customer loyalty is insane.", "score": 3, "replies": [{"body": "MSFT reminds me of an ETF because of how many streams it has", "score": 5, "replies": []}]}, {"body": "Sell quarterly puts on vix (15 point basis, adjust for leveraged efts) iv spikes recently on the index for vix, plus shit looks fucky in monetary markets wont be to \"normal\" levels anytime soon", "score": 3, "replies": []}, {"body": "TSLA", "score": 3, "replies": []}, {"body": "only $tsla", "score": 3, "replies": [{"body": "I got rekt on a tsla leaps. Bought in at $840 and I never recovered.", "score": 2, "replies": []}, {"body": "I got rekt on $tsla leaps. Got in at $840 and still have not recovered.", "score": 1, "replies": []}]}, {"body": "I have a question about PMCC - when the calls youre selling expire ITM, do you close both the long call and short call? or only close the short call?", "score": 2, "replies": [{"body": "Depends on if you think the stock is going to continue running up or not. If so, I personally close the entire position and re-enter with higher strikes for each (and later expiry for the short call). If you think the price has peaked, you could just take a bit of loss and roll your short call out at the same strike.", "score": 4, "replies": [{"body": "What? It should be the other way around.", "score": 2, "replies": [{"body": "How so? If it keeps running up then your net delta goes to 0.", "score": 2, "replies": []}]}]}, {"body": "My goal is to keep the leaps long term because I only trades stocks I believe in.  So I sell deeper OTM stocks to try to prevent this. But if it ends up ITM, I will buy it back and sell a new option at a higher strike(otherwise knowing as rolling the option). If you need more information on rolling  options there are a lot of great videos on YouTube.", "score": 2, "replies": []}, {"body": "Before closing the short leg, look to see if you can roll for a credit. I just did that today with my $14 call for F, rolled to the 8/13 $14 strike for a $28 credit.", "score": 2, "replies": []}]}, {"body": "AAPL UNH SPXL TQQQ and rebalance equal weight 1-2 times a year", "score": 2, "replies": [{"body": "> SPXL \n\nwhy this instead of upro?", "score": 2, "replies": [{"body": "Because I found that product first. Trading volume is close enough on either one so no wrong choice for shares. However options are better on UPRO with more all the weeklies. SPXL just has monthly.", "score": 2, "replies": [{"body": "If you asked me why upro instead of spxl I'd say because I found upro first hah. Happy sailing levered friend.", "score": 3, "replies": []}]}]}]}, {"body": "Tsla NVDA EXPI PLTR SQ. CCs keep the lights on.", "score": 2, "replies": []}, {"body": "SOXL\n\nthank me later", "score": 3, "replies": [{"body": "I mean you could have told me back in 2012 :)", "score": 5, "replies": []}, {"body": "do you sell options on it? i replied to this post with TQQQ hah and sell strangles on it. perhaps ill diversify into some soxl or start throwing my premium in there and selling strangles on it too. its got 84% correlation with TQQQ so a bit of diversification there", "score": 2, "replies": [{"body": "i want to keep it long term so i sell CCs and roll up/out on big green days", "score": 1, "replies": []}]}, {"body": "What's the scoop on them?", "score": 1, "replies": []}]}, {"body": "NVDA, TSLA, and MSFT", "score": 3, "replies": [{"body": "only $tsla.  sissies have diversified portfolio.", "score": 4, "replies": []}]}, {"body": "Tesla", "score": 3, "replies": []}, {"body": "I have either leaps or 100+ shares of: \n\nAAPL\n\nMSFT\n\nAMD\n\nNET (been running really hot, I could see a pullback after earnings. But they're web infrastructure is crucial for how most websites/apps run)\n\nMVST (could be a mistake but I think the value is there)\n\nBB (meme, sure, but a legitimate company and my cost basis is \\~$5.50/share)\n\nPLTR (also memed but I think their work/product will be more and more utilized moving forward. Cost basis is below $20 and I'll probably sell some shares when it rises above $25 again)\n\nICLN (you don't need to choose this ETF but clean energy is clearly a long term hold as it will be absolutely critical moving forward).", "score": 3, "replies": []}, {"body": "short VXX for ever and ever baby", "score": 2, "replies": [{"body": "You Buy puts or sell call spreads?", "score": 1, "replies": [{"body": "Naked short,  short put.  Basically a CC but going down", "score": 1, "replies": [{"body": "You've been selling puts on vxx, and this has made you money 'for ever and ever'. You have to explain how this works. I've made money on VXX buying calls (and only during the beginning of covid on this side) and puts, but have no idea how selling puts on a decaying asset consistently makes you money. Looking at the premiums right now, and I don't seen anything of value there.\n\nI can see how the strategy would have worked over the last month, but the last year looks like it would be a bloodbath.", "score": 1, "replies": [{"body": "it's like a covered call, but downwards, right?\n\njust naked short at $40, for instance, then sell the 36P or 38P at 30DTE. If the put expires, good for you. If the put assigns, you get your $2 + premium.", "score": 2, "replies": []}]}]}]}]}, {"body": "Nvidia, Apple, Microsoft, Maersk and Nike have given consistent returns for me", "score": 1, "replies": []}, {"body": "NVDA is my most recent one", "score": 1, "replies": []}, {"body": "My long terms are AMD, PINS, CIBR, NIO, RBLX, SOXL, SQ and TQQQ\n\nI sell CCs and all of them.  My strategy is to make 5-10% on an annualized basis.  I sell calls less than 14DTE at greater than 10% above the underlying.", "score": 1, "replies": []}, {"body": "SPY of course", "score": 1, "replies": []}, {"body": "CVS. The volatility is so low on it right bow even though they are growing faster than normal.", "score": 1, "replies": []}, {"body": "After losing a lot of money on bad trades ($pins recently came to mind and sold at a loss) I finally settled on buying $aapl leaps for 2023.", "score": 1, "replies": [{"body": "Now aapl will stop its bull run.", "score": 2, "replies": [{"body": "Dang it just my luck 😢", "score": 1, "replies": [{"body": "I’m sitting in the sidelines waiting for AAPL to drop back to $120 to pick up a LEAPS option there 🤣🤣", "score": 2, "replies": []}]}]}]}, {"body": "MSFT", "score": 1, "replies": []}, {"body": "MSFT, AAPL, CHV, ABBV", "score": 1, "replies": []}, {"body": "SQ COIN DAL F", "score": 1, "replies": []}, {"body": "Yawn\nInovio is HPV\nNOT SARS-COV-2", "score": 1, "replies": []}, {"body": "JPM, LMT, RTX\n\nDefense contractors and banks. At least we can say unlikely to go tits up. \n\nMSFT, XOM\n\nFor some diversification.", "score": 1, "replies": []}, {"body": "This is a good topic! NVDA AMD, CLF, they seem like good swing trade stocks or for PMCC.\nCLF is pretty hot in the meme world right now so I may have to wait.", "score": 1, "replies": []}, {"body": "F PYPL and GE\n\nAlthough I would be weary of GE as it may not go anywhere for a *long* while", "score": 1, "replies": []}, {"body": "Amd sucks for leaps very difficult to roll a call out and up for a credit. In comparison rolling out and up works way better on snap, pton, rblx, riot.", "score": 1, "replies": []}, {"body": "I’ve done it on PLTR but IV dried up so I moved into SOFI. Leaps IV% is 50 while monthlies IV% is 85.", "score": 1, "replies": []}, {"body": "aapl, nvda, amd", "score": 1, "replies": []}, {"body": "I have SOFI, PLTR, XPEV, and COIN as leaps. I’ve only been option trading for a year (including theta gang). I love leaps from a delta perspective, but I’ve (obviously) never held them all the way to expiration.\n\nI hate a few of these have meme status, since SOFI is a great fintech and PLTR has Peter Thiel backing.", "score": 1, "replies": []}]}
