{"title": "Skill vs Luck - How do you know when you have some skill and not just luck", "selftext": "How do you know when you have developed a real skill in this game versus just riding a rising tide? \n\nMarket is up, premiums are good. Throw a dart, sell a .2 delta put, close at 50% and keep positions small seem like it is really working now but is it working because I know what I am doing or working because I'm in the right place at the right time. \n\nI have out paced the market but what does that mean. Will I only know if I have skill when we enter a bear market and I'm still making gains? How do you know you have skill versus just being lucky?", "id": "ol4bjp", "created_utc": 1626390792.0, "score": 57, "upvote_ratio": 0.91, "num_comments": 69, "comments": [{"body": "This is a good question. I'm going to answer by using an analogy to poker.\n\nYou can't possibly expect to win every hand. But you can learn which hands are good to play, what your odds of winning are, how big to bet for the best pot odds and many other things. To be profitable, you need to play lots of hands and play them well.\n\nIt's fine if you played a hand well and lost, that's an expected outcome. It's not fine if you played a hand poorly and won, that's luck. Don't let your wins reinforce how you play. Examine all your plays and repeat the ones you played well, regardless of the outcome.", "score": 144, "replies": [{"body": "Well said. The difference between an average trader and a good trader is knowing when to cut your loses. A lot of times I see people here trying to force every trade to be a win when in reality they would have been better off closing at a loss and deploying their capital else well. There’s a reason why poker players tend to be pretty good at stock trading.", "score": 33, "replies": [{"body": "Early on I was the guy trying to force every trade to be a win. In retrospect, it was because my trade sizes were way too big, so a loss would eat up a significant portion of my account.\n\nNow I mostly stick to spreads and PMCCs. My typical max loss is 2% or less of my account value on spreads, and I close out calls if they breach 150% of my premium collected.", "score": 1, "replies": []}]}, {"body": "The most important lesson to take from poker though, is that some people play poorly and win. You need to analyze your wins also, because there are millions of poker players who think they are good (and are not) because of some wins that were actually suboptimal plays/decisions. Do not just scrutinize your losses. Scrutinize your wins and ask if you truly won the most, and if your play was actually good - even though you won.", "score": 11, "replies": [{"body": "You can be a fish and make money over the short term but over the long term the leaks in your game will eventually crush you. I think this is applicable to trading honestly. Not all positions will win, and knowing when to bail is a very important asset. \n\nHaving played poker for most of my uni life as a living, you learn that losing a few big blinds pre is better than busting off on garbage by forcing plays. Not getting into stupid spots > getting out for cheap >>>>>>>>> rebuying because of greed/ego.", "score": 3, "replies": []}, {"body": "Poker is the perfect analogous skill, because as you say you can win a hand or even a session but if you played sub-optimally you should be critical. The easy example is this: you can have winning hands or situations but not extract maximum value from that situation and in that moment even though you won the hand, you actually played poorly. Options are really no different, they provide probability of winning but not guarantees, you have to recognize good situations and maximize those because they are limited, and recognize bad situations and get out of them, no matter what has happened prior to it. In poker you call it getting new information, so even if you have sunk a bunch of money into it, once you know your actions will be unprofitable you need to get out of that situation even if it locks in a loss. The difficult part isn’t saying it, it is doing it. Emotional intelligence and discipline is the hardest part in both endeavors and your worst enemy isn’t who you are playing against or the market, it is yourself. You can’t control the first two but you can control your actions.", "score": 3, "replies": []}]}, {"body": "You gotta know when to hold them, know when to fold them, know when to walk away, know when to run.", "score": 7, "replies": []}, {"body": "That’s best explanation.", "score": 4, "replies": []}, {"body": "Also bank management.", "score": 4, "replies": []}, {"body": "Perfect, love it! I totally read this in Tom Sosnoff's voice (whether or not this was influenced by Tastytrade).", "score": 3, "replies": []}, {"body": "I like that book Thinking in Bets by Annie Duke", "score": 2, "replies": []}, {"body": "This is a good way to look at it although it’s much harder to know what the optimal play was in trading than in poker. The rules of poker don’t change. The rules of the market (in terms of what works — think growth outperforming tech then flip flopping every decade or so) change all the time. \n\nWe can look at backtests and say, for example, RV > IV for X time period, but that doesn’t mean that will hold true going forward. In that case, is it still “correct” to bet on RV > IV going forward? Or should we be doing more research into how that might be changing? This is the part I have the most trouble with and the hardest to map coming from a poker background.", "score": 2, "replies": [{"body": "Complex adaptive systems eh? There's always more info to learn. Just pick up everything you can, verify it isn't gambler's fallacy, and try and learn from all your losses", "score": 1, "replies": []}]}, {"body": "As someone who both plays poker and theta, this is a great analogy.", "score": 2, "replies": []}, {"body": "All of this is my opinion: a little surprised people are giving you awards for this.\n\nThe thing is, you're not learning how big to bet or how to bet big for the pot odds.  In fact, trading things like the wheel in a 10 year bull market, and then (hypothetically) **switching to a bear market is like switching from Poker to** **Baccarat** \\- the same skills do not apply. None of what you learned is going to apply. Escalator up, elevator down. Volatility expands massively in a crash, and you're essentially unhedged when the bath tub empties.\n\nThe OP is correct in saying s/he's worried that it's just throwing darts, because unless you're running quant, you literally are trading on emotions and feelings possibly with some baby stats or math.\n\nIf you start developing a real hedging strategy where you're losing money but protecting against risk, then you've \"leveled up\". Until you're doing this, you're simply a lucky retail trader.", "score": 2, "replies": []}, {"body": "This is f*cking genius. I love it. Request permission to use this logic on myself and others.", "score": 1, "replies": [{"body": "You’ve always had permission.", "score": 2, "replies": []}]}]}, {"body": "You know it's skill versus luck when you come out of a correction ie 10-20% drop off indices and your account is barely down. \n\nEveryone can play Theta in a bull market. Real traders do it in all market conditions", "score": 22, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "You know you can short a stock and sell a put. Basically reverse cc strategy. Why can't you use that in a bear market?", "score": 1, "replies": []}]}, {"body": "Theta strategies are not meant to be used in all conditions. Diversification in your strategies is important so you don't get blown out by a black swan.", "score": 2, "replies": []}]}, {"body": "I stopped giving a shit about skill a long time ago. All i care about is making profits on balance and not blowing up.", "score": 19, "replies": [{"body": "This.\n\nAs long as account balance grows, why does it matter? There's no such thing as all luck and no such thing as all skill. Everyone needs luck. More skill creates more luck 🖖", "score": 3, "replies": []}]}, {"body": "If you beat S&P index yearly every year. That’s skill", "score": 18, "replies": [{"body": "That part isn't very difficult. Go all in SPY. Sell a few OTM SPX puts. You've now beaten SPY for the year.", "score": 18, "replies": [{"body": "What happens if the market crashes? Did you have \\~400k set aside for every contract you sold? You just beat SPX's losses for the year by buying the dip on leverage", "score": 7, "replies": [{"body": "If SPX goes to 0, then money would be the least of your concerns.", "score": 9, "replies": [{"body": "you can still lose money even if spx doesn't go to 0 though?", "score": 1, "replies": []}]}]}, {"body": "If the SPY increases by a higher percentage than the premium from your collateral then you actually miss out as that collateral could have been invested in the SPY. Not to mention that you are being taxed short term gains each time you profit from selling a put", "score": 2, "replies": [{"body": "Sell a naked put because SPY is the collateral.", "score": 6, "replies": []}]}]}, {"body": "even that doesn't prove anything. there are fund managers that beat the market by almost 5x for even as long as a decade before eventually going in the red 30%+ per year. \n\nunfortunately beating the market for even a decade doesn't show you have skill.", "score": 1, "replies": [{"body": "I didn’t say beat the market every year until you don’t. I said beat the market every year. When you lose, it becomes apparent that you didn’t have skill.", "score": 1, "replies": []}]}]}, {"body": "You'll know when you don't have to ask the question. \n\nAlso, there is no skill, only risk management.", "score": 46, "replies": [{"body": "Risk management is a skill", "score": 15, "replies": []}, {"body": "Yep it all comes down to survival and whether you survive depends on your risk management.", "score": 6, "replies": []}]}, {"body": "Calculate your portfolio alpha. That’s good enough of a sniff test. You need to know if you have returns in excess of your risk relative to a benchmark.", "score": 7, "replies": []}, {"body": "When you consistently lost money? That's skill\nWhen you consistently make money? That's luck", "score": 16, "replies": [{"body": "I am one of the most skilled traders in the market", "score": 24, "replies": [{"body": "My aunt once told me red is the best colour, Redredred, repeat red enough times it will lose its meaning.", "score": 5, "replies": []}]}, {"body": "This is the way", "score": 2, "replies": []}, {"body": "This doesn't even actually hold either though. There were fund managers within the last few decades that beat spy by as much as 2x for as long as a decade, then went on to lose a lot of it back in the years following.", "score": 1, "replies": []}]}, {"body": "Just assume it is all luck and work to create a system that maximizes that luck on n a consistent and continuous basis.", "score": 5, "replies": []}, {"body": "A very smart man once told me. \"Luck seems to find those that are best prepared\"", "score": 5, "replies": []}, {"body": "Skill would be working your way out of a shitty trade, luck is anytime the trade goes the right direction.", "score": 9, "replies": []}, {"body": "I've stopped trying to beat the market. I just try to benefit from the market.", "score": 2, "replies": []}, {"body": "There is skill in knowing that this is all based on luck.", "score": 2, "replies": []}, {"body": "Analysts are not always right. Risk managers need to be always right. If you have good risk management, that is skill.", "score": 2, "replies": []}, {"body": "It’s all about Risk management and following the Kelly Criterion.", "score": 2, "replies": []}, {"body": "Luck = throwing a dart or guessing if a trade might be good.\n\nSkill = you know all the potential outcomes of a trade before opening it and are completely confident the trade will result in a profit and does nearly all the time.", "score": 4, "replies": [{"body": "Literally this. The level of due diligence and risk management is what separates skill from luck. The level of skill will show how consistent someone is making money, because they manage their trades and reduce risk of ruin. People who are lucky simply YOLO with no exit strategies and hope their trades work, and then cry if they don't.", "score": 7, "replies": [{"body": "I would also add, knowing why you make each individual trade, and your own rationale behind it, as well as when you plan to exit the trade and actually secure profits.", "score": 3, "replies": []}]}]}, {"body": "Imma keep it simple, if you completed Year one of options trading with executing trades on a weekly / monthly basis and is beating the S&P. maybe your currently 40% luck / 60% skill. The goal over a period of time is to get to 80% skill / 20% luck. \n\nFrom nurturing talents, new career position or graduating seems like every 3-4 years is the sweet spot. \n\nGreat question but expect to get punched in the face. The skill is too then keep executing even thought you know the punch is coming and it won’t stop can’t stop.", "score": 1, "replies": []}, {"body": "Isn't the bear market of all bear markets that's coming our way mean we have to invest in more puts than calls?", "score": -4, "replies": [{"body": "Sure, you do that.", "score": 7, "replies": [{"body": "I'm still learning! I only buy calls because, for the past ten years, stonks only go up...", "score": 0, "replies": [{"body": "Just don't bet on a market crash until it begins. Chicken little is wrong so much about the market it is unbelievable", "score": 4, "replies": [{"body": "Most definitely. I am done trying to time the next crash. I try to swing volatility. I do some Boglehead 💩 because, well, those 6% gains over 25 years are something. Some dividend BS because I've seen (in some folks' portfolios) what twenty-five years of dividends can provide! But really trying to make options my part-time job. An extra 10% of my salary?\n\nThese dumpy Thursdays followed by Friday rallies have been quite a sight to see. Still learning options though. I am starting to think options are the way...", "score": -1, "replies": []}]}]}]}, {"body": "Maybe off topic but id say a less risky bear strategy would be a bear call spread/call credit spread.", "score": 2, "replies": []}]}, {"body": "If your method is coherent and has been working for a long time let's say a decade I think you could start talking about skill. Academically speaking you would do a students t test.", "score": 1, "replies": []}, {"body": "find out if u r trading a + expectancy strat or a negative one.", "score": 1, "replies": []}, {"body": "Don’t rely on skill when gambling. Only luck matters. Skill is not to sit at the table at casinos.", "score": 1, "replies": []}, {"body": "The difference between luck and good has absolutely nothing to do with your returns. It's entirely how you manage, adjust and understand risk.  We are in the risk game here at thetagang. Returns are a byproduct.", "score": 1, "replies": []}, {"body": "seems like those who are more skillful tend to have luck on their side.", "score": 1, "replies": []}, {"body": "A little bit of both. \n\nChoosing the assumption on the stock is luck. \n\nManaging the trade and discipline is skill\n\nTastytrade has studies showing similar results with fundamental, technical and guessing.", "score": 1, "replies": []}, {"body": "Short answer? If I'm not being paid by HF, then it's all luck.\n\nI'm retarded and I managed to make money in this market.", "score": 1, "replies": []}, {"body": "20+ years of market outperformance", "score": 1, "replies": []}, {"body": "Repeatability. The more times you succeed, the lower the chance it was down to luck.", "score": 1, "replies": []}, {"body": "It’s hard to say. Pure efficient market hypothesis adherents would go so far as to say no one has skill and that any outperformance is due to luck.\n\nPersonally I think skill is probably something that exists. If you’re consistently beating the market, in BOTH bull and bear markets, you may be exhibiting skill. However, there’s always going to be some people just getting lucky. I don’t think you can empirically say that skill caused out performance no more than you can say a hurricane was caused by climate change (as opposed to the hurricane would’ve happened anyway).", "score": 1, "replies": []}, {"body": "Easy... a large sample size of data points.", "score": 1, "replies": []}, {"body": "Skill works well over the long term, luck does not.", "score": 1, "replies": []}]}
{"title": "As someone who is bullish on $RKT this is what I will be looking for next month in Q2 earnings to stay bullish and what upside surprises could be in the earnings", "selftext": "$RKT FUD is mainly revolved around interest rates rising and price war with competitors. While I think these are valid risks to earnings growth I believe $RKT is equipped to weather the storm better than anyone else as long as they use their brain and not just aimlessly go for more market share with advertising without balance. Here is what I think $RKT should be aiming for next earnings call to ease these concerns:\n\n1. Boast about their record triple digit % growth in Rocket Homes and Rocket Autos. I believe if there will be any upside surprise next earnings it will come from these two areas. With housing prices and auto prices still on the rise I think the revenue will only compound to the upside if triple digit growth in these revenue streams continue. Showing revenue growth in these two areas will prove to investors $RKT is not only a company that will make money when interest rates go down for people to refinance. I will first and foremost need to see high % growth in both of these areas to stay bullish.\n2. Rocket Homes. I want to hear in more detail how they plan to leverage their Rocket Homes app to compete and beat Zillow at their own game. I want them to give some data on how app users are behaving for example, downloads per month growth, number of clicks within the app, time spent on app, ect. Rocket Homes has the ability to get your loan through the app and find a real estate agent having a one stop shop for purchasing a home. Zillow is catching on and now offering loans through their app. Rocket Homes should be looking for ways to steer real estate agents away from Zillow and onto Rocket Homes along with consumers.\n3. Rocket Autos. Rocket Autos as far as I'm aware does not have an app yet. I want to hear some detail revolving how they plan to streamline this process direct to consumer through an app similar to how Carvana got into the game. When they do Rocket will have a unique advantage to Carvana because they can offer the loan and financing through the app, similar to Rocket Homes, so when people go to buy a car so they know what they can afford. I think a timeline on when they expect to launch the app would be necessary for shareholders to be in the loop on or at least where progress stands to confirm they are going down this road (pun intended).\n4. I love the Amazon logic of \"we are going to take as much market share as possible by lowering our prices and taking a lower gain on sale to win market share\" BUT I do think there is a balance and that balance can come from lowering their ever growing marketing expense line on the income statement. We've all seen Rocket Company commercials, PGA sponsorship, signs at sporting events, ect. I would love to see marketing get trimmed down in order to deliver positive or constant earnings growth in order to win the price war with $UWMC faster because I do think $UWMC will eventually drop the broker ultimatum (which is only hurting mortgage brokers not $RKT). By the way I am not against $UWMC before you start hating on me I think you can make money on both of these stocks I just like $RKT better because of all of their revenue streams and direct to consumer access.\n5. Finally as an alternative to point 4 about lowering the marketing budget to increase earnings would be to initiate the up to $1 billion share buy back program they announced last November. AMD share buyback was a huge catalyst for the stock to move from $75 to $90 and I think it would be a big catalyst for $RKT as well.\n\nBottom line is $RKT needs to begin caring about their shareholders and flexing a little more for the beast company that it is. This is a company that can be insanely more profitable than it currently is if it wanted to be but it's currently choosing to forgo profit to reinvest and grow their current business and new revenue streams. Either deliver earnings or show us you're going to win big in these 3 markets.\n\n&#x200B;\n\nhttps://preview.redd.it/1cdlic7ibab71.png?width=840&format=png&auto=webp&s=a7187c88c22bc71bd332d7bc8add749fb8925f58", "id": "okisq3", "created_utc": 1626313710.0, "score": 134, "upvote_ratio": 0.87, "num_comments": 76, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|31|**First Seen In WSB**|4 months ago\n**Total Comments**|236|**Previous DD**|[x](https://www.reddit.com/r/wallstreetbets/comments/nvjqdz/rkt_financial_statement_analysis_from_the_mind_of/) [x](https://www.reddit.com/r/wallstreetbets/comments/okisq3/as_someone_who_is_bullish_on_rkt_this_is_what_i/) [x](https://www.reddit.com/r/wallstreetbets/comments/nngu9q/ok_guys_i_know_rkt_posts_get_deleted_in_here/) [x](https://www.reddit.com/r/wallstreetbets/comments/nngzpg/ok_guys_i_know_rkt_posts_get_deleted_often_but/) [x](https://www.reddit.com/r/wallstreetbets/comments/nnrnbm/ok_guys_i_know_rkt_posts_get_deleted_often_but/) \n**Account Age**|5 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n    \nHey /u/Spleaster, **positions or ban.** Reply to this with a screenshot of your entry/exit.", "score": 1, "replies": [{"body": "It wont let me post a screenshot in the comments but I added it to my post", "score": 1, "replies": [{"body": "I think u can post to ur profile", "score": 1, "replies": []}, {"body": "imgur is something you can also use to link a photo", "score": 1, "replies": []}]}]}, {"body": "I want to shit on RKT but then I see I own 2,000 shares of pltr.", "score": 57, "replies": [{"body": "Sorry for your loss", "score": 9, "replies": [{"body": "2024. We ride", "score": 7, "replies": [{"body": "🚀", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "I’m at 26.50 just averaging down little by little. If it goes sub 20 I’m buying as much as I can", "score": 3, "replies": []}]}, {"body": "I ain’t all that far away myself, got 1,000 shares of PLTR with an average cost of around $30.00.", "score": 2, "replies": []}]}, {"body": "Share buyback to ease the pain. Crush earnings and make us rich", "score": 20, "replies": []}, {"body": "RKT - my #1 BAE", "score": 20, "replies": []}, {"body": "I'm retarded but it's literally got Rocket in its name, so I'm in!", "score": 20, "replies": [{"body": "Glad ppl are starting to understand ![gif](emote|free_emotes_pack|give_upvote)", "score": 6, "replies": [{"body": "This is about to liftoff back to $20", "score": 5, "replies": []}]}]}, {"body": "RKT is like marriage. Unpredictable and you better have a high tolerance for abuse", "score": 17, "replies": []}, {"body": "Just bought $60k worth this week. This is getting ready for liftoff 🚀", "score": 14, "replies": [{"body": "I’m with you buddy!", "score": 2, "replies": [{"body": "Welcome onboard! We’ll enjoy this rocket together 🚀", "score": 1, "replies": []}]}]}, {"body": "Short term my crayons say RKT is due for a bounce. RSI cooled off a bit today but was beat to hell recently.", "score": 15, "replies": []}, {"body": "I’ve got too much in RKT to not stay committed 🚀", "score": 13, "replies": [{"body": "True fuckin dat", "score": 2, "replies": []}]}, {"body": "To the damn moon", "score": 21, "replies": []}, {"body": "Can’t wait to put an onion in my bum when it hits 80", "score": 11, "replies": []}, {"body": "I used to own rocket mortgage. Now I own rocket luggage.", "score": 29, "replies": []}, {"body": "I'm really fed up with rkt. It's been trading sideways for few months,. Every time it goes up, it will go back down", "score": 22, "replies": [{"body": "Every time I breath in it comes out, I’m tired of this shit!", "score": 21, "replies": [{"body": "You too?! And check this-every time I eat I need to take a dump wtf man, right?", "score": 11, "replies": [{"body": "Were you guys waiting for the sHoRT SquEEZe? 😆", "score": -2, "replies": []}]}, {"body": "Ever tried buying $ROPE?", "score": 3, "replies": []}]}, {"body": "OP was also [left](https://www.markovchained.com/assets/view/RKT?position_id=3129) on the moon it seems.", "score": 2, "replies": []}]}, {"body": "So rkt auto is in testing phase when I went asking rocket about it.  They will release it customer facing for all their current customers and new users at some point. Was told to keep an eye out. \n\nThey are making that revenue on a handful of select users.  Just wait till the flood gates open. \n\nDon’t forget the organic sites like for sale and other companies running on their tech.", "score": 8, "replies": []}, {"body": "I own uwmc stock, but I think both stocks have a lot of upside. Every time their earnings come out they seem to get a bump and with refinances skyrocketing again that means profit will be good for this quarter and next quarter. Also people are finally realizing this isn’t a bubble and more housing inventory is becoming available and the inflation fud is dying down.", "score": 12, "replies": [{"body": "yesss exactly", "score": 4, "replies": []}]}, {"body": "Already that time of the quarter for RKT posts?", "score": 11, "replies": [{"body": "Thats what someone says every week -- but they come every week.", "score": 1, "replies": []}]}, {"body": "I remember the last surprise earnings...\n\nSpeaking of which, y'all remember the dude that dumped his savings into weeklies, lost everything, w a kid on the way? I wonder how the hell hes doing. Said he was gonna take a part time gig at Wendy's or Uber or something....", "score": 3, "replies": [{"body": "Oh my gourd! \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "I'm cool with the marketing spend. With the other product offerings, you just want to get people in the ecosystem so they'll eventually use RKT for other large purchases down the road. Sacrifice profits now, make more later.", "score": 2, "replies": [{"body": "Yea I agree but if revenue decreasing short term gotta stay profitable to keep stock from falling", "score": 1, "replies": [{"body": "Who cares? Sure it may fall a little short term but that market share would have exponentially larger positive effects long term. Due to a high retention rate, market share means huge profits for RKT over the lifetime of a customer after the initial hit in customer acquisition cost. Additionally, larger market share increases the ability to create network effects, which would further increase profits while lowering future customer acquisition costs.", "score": 2, "replies": [{"body": "Listen I agree with what you’re saying in theory. Reality is they had more cash than they knew what to do with last time and did the special dividend. I would rather see higher earnings or share buy back as opposed to higher dividend. Also I think law of diminishing returns kicks in for marketing after awhile", "score": 1, "replies": [{"body": "My guess is that the dividend was in part meant to shake the shorts off and/or reduce the need for insiders to sell shares (there haven't been huge amounts of insider selling, I'm guessing the dividend helped with that since when you are in upper management your primary way of getting paid is with stock)", "score": 1, "replies": []}]}]}]}]}, {"body": "Ya idk how to not own this company as PE of 7 and forward PE of 8-9", "score": 2, "replies": []}, {"body": "No offense but you went over the so called “catalysts” that everybody is touting in chats rooms about RKT. No\nReal DD per say. Good luck though.", "score": 2, "replies": []}, {"body": "The problem with the price war with UWMC is that UWMC has higher margins and faster closing times by quite a bit. They can dig deeper and still make money on loans whereas RKT will need to use their loan diversity to make up for the reduced revenue on mortgages and refis.", "score": 1, "replies": [{"body": "They both can eat and will.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Earnings BEFORE that one went to $40 though...", "score": 1, "replies": []}]}, {"body": "Too bad $UWMC is bending them over like your wife’s boyfriend.", "score": -14, "replies": [{"body": "Their shit stock is even worse and that’s saying a lot.", "score": 8, "replies": [{"body": "Yeah you’re right. For now. !remindme 6 months", "score": -2, "replies": [{"body": "For a moment I thought you said remind me at 6$ which will be pretty soon lol.", "score": 7, "replies": [{"body": "Well at that price, the dividend is like 7% so I’ll go full yolo! How much is the dividend for $RKT?", "score": 0, "replies": [{"body": "Oh boy I’m not sure you understand where the dividend is coming out from and why a company chooses to pay dividend to start with. Why are they paying a dividend? Can’t they use all that money to steal a bigger market share?", "score": 6, "replies": [{"body": "UWMC has $1.6B cash on-hand and is literally running out of ways to give it back to shareholders. “Our balance sheet is a fortress” - Mat Ishbia.\n\nI’m expecting a dividend increase within 1 year.", "score": 3, "replies": [{"body": "Don’t get me wrong I own the stock in my portfolio. It just isn’t what you make it to be. You are 100% correct though, they are running out of ways to give back to the shareholders thus the dividend. Companies that don’t see opportunities to grow rapidly offer a dividend so the shareholders a patient with slow growth if any. The dividend is paid out of the net profits. That’s why you don’t expect a dividend from Tesla, Apple, Amazon and the rest. You expect them to keep growing.", "score": 8, "replies": [{"body": "The share buyback alone can buy back 42% of the float at this share price. And that won’t even put a dent in their balance sheet. I truly think this is a huge opportunity, and have $250k of my own money where my mouth is.", "score": 6, "replies": [{"body": "-", "score": 3, "replies": [{"body": "dIVeRsIfIcAtioN", "score": -1, "replies": [{"body": "uh what", "score": 1, "replies": [{"body": "Diversification bro.", "score": 0, "replies": []}]}]}, {"body": "Everything is ok with moderation. \n\nBtw I’ve seen YouTube comment threads where some bots had similar conversations pumping some obvious bull trap, shit stock. So you have to do a little DD yourself, just a little but you got to.", "score": 1, "replies": []}]}, {"body": "Good luck.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Oof this didn’t age well.", "score": 1, "replies": []}]}]}]}, {"body": "I’m looking forward to your wife sucking my PP. bullish DD like her titties on me", "score": -12, "replies": []}, {"body": "Dance party now?", "score": 1, "replies": [{"body": "hell yea", "score": 1, "replies": []}]}, {"body": "You still in $RKT? What’s your 2022 outlook?", "score": 1, "replies": [{"body": "I'm still in RKT except I sold my 2022 options at a loss and rolled them to Jan 2024 options for $25 strike. Idk what's going to happen but im still holding as I believe the company still has more cash to make things happen like the true bill purchase", "score": 1, "replies": []}]}]}
