{"title": "Will stocks boosted by recent Pfizer vaccine news likely go up again with Moderna?", "selftext": "Alright so title is pretty self-explanatory but, just out of curiosity: shouldn't the stocks that went up after the vaccine effectiveness announcement also go up after Moderna announces its vaccine's effectiveness?\n\nGiven that Moderna's vaccine is about equally effective, that is. Especially since they have already dropped significantly since the first news and should just be additionally encouraged by the news of a next vaccine.\n\nEDIT: I recognize that the next potential boost will be weaker than the Pfizer one, and I also am mostly curious whether stocks like AMC will go up again in your view.", "id": "jsv9r6", "created_utc": 1605190419.0, "score": 41, "upvote_ratio": 0.91, "num_comments": 26, "comments": [{"body": "Probably but I don't think it will as much as Monday.\n\nWe were heading up anyway on Monday (overnight futures had ran up a lot), mix in vaccine news and that shot things to the moon.", "score": 19, "replies": []}, {"body": "Someone tell me why I'm bag holding GILD please", "score": 13, "replies": [{"body": "Depends on your purchase price", "score": 4, "replies": [{"body": "Bag holding implies a bad one?", "score": 3, "replies": []}, {"body": "Not *that* bad, ~$63 I believe.", "score": 1, "replies": [{"body": "Not that bad. I guess. Do you have any compelling reasons to sell?", "score": 1, "replies": [{"body": "Not really, my problem is probably that I haven't done as much research for them as I do for other companies so I feel a little less safe.", "score": 1, "replies": []}]}]}]}, {"body": "Gilead and their purchase of KITE will treat you well long term", "score": 2, "replies": []}]}, {"body": "Yes, but not as much", "score": 4, "replies": []}, {"body": "Hope Pfizer gets pumped again, looking to dump it", "score": 4, "replies": [{"body": "Same!! I regret not selling it the other day", "score": 3, "replies": []}]}, {"body": "They'll be boosted again when/if the Pfizer vaccine gets FDA approval. Which is supposed to be announced near the end of this month, if they get it (which is likely). The vaccine is actually being approved for emergency use. So if you can vaccinate the high risk people, and stop Covid from being lethal, you're in a much better position. \n\nIn my opinion, countries are likely going to race to get their vaccination rates up high (probably >70-90%). And then the countries with high rates will form 'travel bubbles'.", "score": 3, "replies": []}, {"body": "Btw pfizer didn't develop the vaccine the only helped to test it for the german company Biontech", "score": 4, "replies": [{"body": "Right, my bad", "score": 2, "replies": []}]}, {"body": "When is moderna announcing?", "score": 2, "replies": [{"body": "Next week as far as I remember", "score": 2, "replies": [{"body": "Where’d you hear this?", "score": 1, "replies": [{"body": "https://www.google.com/amp/s/thehill.com/homenews/administration/525558-fauci-predicts-data-from-moderna-covid-vaccine-within-a-week%3famp", "score": 2, "replies": [{"body": "Thanks!", "score": 1, "replies": []}, {"body": "So that means in two weeks we’ll have posts on reddit claiming the data is faked/hedged/unimpressive and pointing to insiders selling stock after the announcement.  Got it.", "score": 1, "replies": []}]}]}]}]}, {"body": "is astra zeneca a different vaccine? they have promising results on the horizon too.", "score": 2, "replies": []}, {"body": "Absolutely. It's just PR.\nMRNA is very good.\nEarnings are forecast to grow 3.34% per year.\nMRNA exceeded the US Biotechs industry which returned 29.8% over the past year.\nTrading at 11.81x Price to Book ratio.\nCan't say what a fair price is but I'm holding to at least $100.", "score": 2, "replies": []}, {"body": "Pretty unlikely. We already have Pfizer's vaccine and the market likely expects Moderna's to also show good results, although if it does not, then I expect the market will drop pretty big.", "score": -1, "replies": []}, {"body": "I just bought a $70 put on MRNA. I see them going back to $55 or lower. There's no way they're going to get a brand new type of vaccine developed AND approved. Nor are they in a great position to help with the manufacturing of vaccines like Pfizer's.", "score": -1, "replies": []}, {"body": "Is Moderna supposed to announce something about their vaccine any time soon?", "score": 1, "replies": [{"body": "Yeah next week I think", "score": 2, "replies": []}]}]}
{"title": "Does anyone else think there could be another crash due to potential lockdowns/covid?", "selftext": "[deleted]", "id": "jt0djj", "created_utc": 1605206639.0, "score": 7, "upvote_ratio": 0.69, "num_comments": 25, "comments": [{"body": "Just look on the bright side, if a crash happens, get everything you wanted at a discount.", "score": 39, "replies": [{"body": "This. If you time it right too, you can probably turn a decent profit with puts, if you're into that kinda stuff.", "score": 7, "replies": [{"body": "Indeed.", "score": 2, "replies": [{"body": "Indubitably", "score": 3, "replies": []}]}]}]}, {"body": "Downturn? Yes. Crash? No. We know what Covid is. We have vaccines coming. We have learned to cope somewhat. And trump is gone (sort of). It will not fall off a cliff like it did", "score": 23, "replies": [{"body": "Vaccine or not there has been some serious lasting damage inflected on the economy. Massive unemployment does not turn on a dime and people aren't just going to instantly start going back to how we were in the before times.\n\nAny time in history before this and the market would have shit a brick due to the numbers we are experiencing these last 9 months", "score": 2, "replies": []}, {"body": "[removed]", "score": -1, "replies": [{"body": "How many other companies are releasing positive vaccine news? If it was only Pfizer ok but now you’re talking global conspiracy", "score": 1, "replies": []}]}]}, {"body": "It really comes down to how long the lockdowns last. If citizens apply the guidance, it’ll be more like last March. However, my guess is most wont abide by the procedures given lockdown fatigue.    That’ll keep positivity rates elevated and Rt above one which will push lockdowns into the spring. Longer lockdown = more likely the market will sell off.", "score": 4, "replies": []}, {"body": "Not really.  The crash happens because of uncertainty, more than because of a lockdown.  We'll have less uncertainty moving forward.", "score": 8, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Bob Marley", "score": 8, "replies": [{"body": "And the Bailouts", "score": 4, "replies": []}]}]}, {"body": "Nothing to the scale we experienced.  Maybe a slump.  Maybe the opposite of the the Monday/November 9th spike.\n\nDo I think there will be another lockdown?  Yes, in some capacity.  Covid growth is completely out of control.  I’d anticipate a coordinated, federal mandate.", "score": 8, "replies": []}, {"body": "I think there will be another substantial dip before a vaccine is released.\n\nIf Biden retains his win, he will impose a shut down and that’s when we’ll have a huge dip. That’s when you should buy again before the vaccine is released", "score": 5, "replies": []}, {"body": "I think crashes are unexpected by nature, you don't anticipate them. As someone said if there is a crash its reason will go beyond lockdowns. Two things you can expect if there are serious and long lockdowns in Europe, the US and maybe India and Japan are declining oil prices, which correlate with index prices, and the S&P struggling to get to new ATH and maybe not getting there until 2021. Hypothetical reasoning, not investment advice.", "score": 2, "replies": []}, {"body": "Crash happened because we thought that virus was maybe the end of us...we had videos coming from China of people literally dying in the streets, finally it’s not so terrible and people expect a vaccine, so if a crash happens COVID won’t be the sole responsible", "score": 3, "replies": []}, {"body": "Not really. We more or less know what to expect from a lockdown so it wouldn’t shock the market again.", "score": 2, "replies": []}, {"body": "If there is another potential dip it will most likely not be close to as bad as before. Keep in mind a lot of people politicized the virus and used it to their own advantage to make Trump look bad but both sides are guilty of fucking with the economy to blame others. The election is pretty much seen as over by most politicians so now that game is also over. There may be a shutdown but a minor or temporary one now that hopes of a vaccine are becoming more apparent ALTHOUGH, not guaranteed. That being said, id still be careful investing in stocks that are overvalued or inflated at the moment.", "score": 2, "replies": [{"body": "Trump did a great job making himself look bad.", "score": 3, "replies": [{"body": "Well duh but the point still stands", "score": 2, "replies": []}, {"body": "I can hear him taking credit for how bad he makes himself look already 😂\n\n\"Tremendous job I did, making myself look bad. Nobody else could have done it. People tell me \"wow, we haven't seen someone make themselves look this bad, maybe ever\".\"", "score": 0, "replies": []}]}]}, {"body": "Nobody knows, covid might be a worse pandemic next year (hopefully it won't happen, report of mutated mink covid is bad news however). Just be ready to panic sell and slowly buy as market recovers. \n\nIn mean time trade small and hope that the vaccines can overcome this pandemic eventually. Look at how long it took to eradicate polio (still haven't) and smallpox (took almost 200 years) even when we had the vaccines. Also with such viruses, it might reappear years later from animal reservoir. \n\nIn short, black swans from pandemic is highly likely, as to what form or shape is anyone's guess.", "score": 1, "replies": []}, {"body": "A lot of people are saying downturn yes, crash no but at what point during this event does the economic impacts for an extended duration truly begin to take hold in the stock market? What if this problem persists for 3 more years and millions of people are left scraping for money during that time frame? Surely there has to be a significant impact that will bleed into the market with cold hard numbers.", "score": 1, "replies": []}, {"body": "The interesting thing is that lockdowns are already starting (Chicago just issued a stay at home order, for example) and yet the markets aren't reacting strongly.  I wonder if this is just misplaced optimism that these are just sporadic efforts that will be isolated to certain areas and short-lived.  Maybe it's also lingering optimism from the Pfizer news - people thinking, \"Damn, it's getting bad out there but a vaccine is just around the corner.\"\n\nI don't think there will be a crash anywhere near like what we saw in March but I wouldn't be surprised to see some more volatility as we waver between bad COVID headlines and positive vaccine news.", "score": 1, "replies": []}, {"body": "No. Tech stocks are the backbone of the market and they only benefit 10x because of the lockdown.", "score": 1, "replies": []}, {"body": "I don't think a crash will happen, either nothing will happen or there will be a down trend..", "score": 1, "replies": []}]}
{"title": "\"Covered Strangles\"", "selftext": "Hello theta warriors! I am sure you all had a great year unless you got greedy like me and lost most of your gains. I am back to sticking to my \"rules\" and doing very well for myself. Recently while watching one of my favorite youtube  channels (projectoption is the channel name) I saw a video about \"covered strangles\"\n\nNow, as we know puts cannot really be \"covered.\" If you sell a put and it expires ITM, it does not matter if you own 100 shares, you have to buy 100 more at the strike you sold it at. BUT they still call this method \"covered strangles\" where basically you pick a solid stock that does not have MASSIVE swings but grows and has decent premiums (I am doing it on Apple right now) and you buy at least 100 shares of it, you sell a monthly covered call 10% OTM as well as a monthly put 10% OTM.\n\nBest case scenario, it does not hit the call or put strike and you just keep the premium. Worst case on the call side is your shares are called away for a 10% gain plus the premium collected, on the put side you are buying 100 shares on a 10% dip which is a big dip for a blue chip stock like Apple.\n\nI did this with Apple and if I keep the premiums from my December 18th $107.50 put and my Dec 18th $130 call I just added 20% to my holdings. \n\nBig players make big bucks using this method and am just wondering if anyone here also sells covered strangles and if so, on what stocks?\n\nI have a fairly big account, very big with margin but I try not to use much of it so sadly I can't be buying 100's of shares of all the names I like. I am probably going to start doing this on ETFS like SPY, QQQ and maybe IWM", "id": "jt0ed9", "created_utc": 1605206700.0, "score": 5, "upvote_ratio": 0.69, "num_comments": 29, "comments": [{"body": "Short puts can be covered...with a short stock position.  It’s called a covered put.\n\nEdit:  Keep reading for entertainment, lol.", "score": 6, "replies": [{"body": "I know this. Short sellers regularly sell puts to try and bring their costs down. Personally I do not short stocks and if I did, I would probably just buy a call for insurance", "score": 1, "replies": [{"body": ">Now, as we know puts cannot really be \"covered.\"\n\nThen remove this sentence because, as you \"know,\" puts can be covered.\n\nNext time, don't be afraid to admit that you learned something.  Your fairly big account with very big margin (to use your hilarious language) will thank you.  Don't conflate money and knowledge.  It didn't provide any credibility to your inaccurate post.   :)\n\nEdit:  As others have pointed out below, you have quite a bit of learning to do.  Hint:\n\n> You really need to think of these trades as a sum of its parts.", "score": 5, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "Cute response, keeping learning :)\n\nThis is priceless:\n\n>Personally I do not short stocks\n\n&#x200B;\n\n> I have shorted stocks plenty of times and read my post again moron", "score": 4, "replies": []}]}]}]}]}, {"body": "First sell CSP ..then if assigned, start selling CC..if the stock price keeps creeping dowwards too much that you cannot get good premium for your current stock break even or better (CC strike), you sell another CSP now at lower price..you benefit from IV expansion and now just collected more premium to lower your cost basis... if the price keeps getting lower and you get assigned for more stock with that new put, **you just lowered your cost basis with more cheaper shares.**  Then you can continue selling lower strike CC that is still break even in total on your shares break even with more calls and premium.\n\nWinning !!", "score": 17, "replies": [{"body": "Btw, who the fuck down voting this golden advice? LOL", "score": 3, "replies": []}, {"body": "LOL!!!!\n\nHave infinite money and keep on selling CSP’s as the stock declines!   Just use more money!!!", "score": 5, "replies": [{"body": "Yeah, as the stock plummets, just buy more and average down! Once you near an average of $1 a share, you have beat the market.", "score": 5, "replies": []}, {"body": "Thats the spirit !", "score": 1, "replies": []}]}]}, {"body": "if your shares get called away it's actually the best case, not the worst case.", "score": 4, "replies": [{"body": "No, keeping them and the premium from the calls and the puts is best case scenario, then selling more calls and more puts. But yes, out of the 3 outcomes having my shares called away would be the best other than keeping the shares and the premiums", "score": 2, "replies": []}]}, {"body": "Yes, I do this on blue chip stocks AAPL being one of them. I am long 400 shares of AAPL and short 11 DEC 108 strangle. I always short ATM as theta is highest there and I get to keep more premium. If you are doing this keep cash away for buying the assigned stocks at the strike price you shorted.", "score": 3, "replies": []}, {"body": "I do this when assigned and the stock has dropped quite a bit from the strike.  It reduces my basis and then I write 2x calls going forward.  I ONLY do the covers strangle once after assignment.  Not repeatedly.  For me, I do a lot of wheel trades on indexes and indexes ALWAYS come back up.   Some stocks can take forever, but indexes usually recover faster.   \n\nIt can be a bit more capital, but that is why I only do it once after assignment and ONLY when the stock is falling hard.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "> When I enter a fully covered strangle, I use futures to simulate the short position because it's much cheaper. \n\nInteresting... I'm not OP but I would love to know more about this. Would you mind giving an example of using futures?", "score": 1, "replies": []}]}, {"body": "How is a covered strangle any different than 2x CSP (or 200 shares + 2 CC)?", "score": 1, "replies": [{"body": "Huh? A CSP is a cash secured put. You do not need to OWN the shares to sell puts. You need to own shares to sell covered calls\n\nselling 2x CSPs is selling two puts.... where do the covered calls come in? You need to OWN 200 shares to sell two covered calls...", "score": 0, "replies": [{"body": "CSP and CC are synthetic equivalents.  Selling a strangle against 100 shares gives you a CSP and a CC (a covered strangle).\n\nCovered strangle = 2 short puts = 2 covered calls\n\nThey're synthetic equivalents of each other.", "score": 5, "replies": [{"body": "You really are not making any sense or telling me anything I do not already know\n\nYou do not need to OWN shares to sell cash secured puts or to sell a strangle is my point!\n\n You can sell a strangle without owning ANY shares using naked calls which many people (not me) do. You can also sell CSPs on any stock you want without owning it\n\nThat is why there is a difference between a COVERED strangle and a strangle", "score": -2, "replies": [{"body": "You really need to think of these trades as a sum of its parts. A short put is basically stock replacement. This is what synthetically makes a CC = Short put. In both scenarios you are leveraging 100 shares to sell premium with a bullish assumption. \n\nNow because of this, a covered strangle has the same profile of simply doing 2x short puts, which is all he is saying. There is no point in doing this if you don't care about owning stock. \n\nAlso ps. covered puts do exist if you short shares", "score": 8, "replies": []}]}]}, {"body": "The csp you sold lock up your buying power. The CC only lock up maintenance cash. Which is 25% for Apple. You get more bang for your buck buying 200 share and sell the lower delta cover call. 100 share of Apple only lock up 3k a csp lock up 12K", "score": 1, "replies": [{"body": "It hardly ties up any buying power at all man and what do you mean a CC ties up maintenance cash? Selling a covered call uses no extra buying power or maintenance excess. Maintenance excess is more important than buying power...  I have well over 100k in buying power and buying shares barely uses any of it. \n\nI get margin called if my maintenance excess goes into the negative which can happen if I sell too many puts and they end up in the money. I have never run out of buying power but I have gotten margin called for being negative on maintenance excess when I was a newb.\n\n I sell puts in a margin account. Selling puts in a cash account is just crazy, uses way too much buying power. Margin is a great tool if used safely (I never use even close to half of my available margin)", "score": 1, "replies": [{"body": "If you’re selling put in a margin account that doesn’t lock up your cash then you’re selling naked not csp(maybe). A csp mean that you can take assignment . Tasty Work let you do this with a small account even if you’re not an experience trader. Other brokerage requires a large account and typically need level 3-4 to sell naked. \n\nSay you have 20k and Aapl is at 100$ you can buy 200 share and your maintenance is 5k that give you 15k left over to trade with depending on your brokerage. If you sell 2 csp you would have zero buying power as it lock alway your 20k. For most people selling CC is a better use of capital. I’m just not seeing the benefit of selling a csp. \n\nI do see the benefit of selling a naked put. Say your already long aapl at 100 now it’s at 110. So you sold a naked 100$ if it go up it’s your to keep. If it goes down then you sold your other investment/go on margin to get them at 100 partially finance by the put. I think it a good strategy to ultimately go long On more of the stuff you like at a lower price point.", "score": 1, "replies": []}]}]}]}]}, {"body": "Sounds capital intensive.  A covered strangle in apple means you have $11,500 tied up in stock, and another $11,500 lying around waiting to be used to cover your short put.\n\nWhy not instead do an Iron Condor, or a long diagonal call spread (PMCC), or maybe a jade lizard.  These use less capital.", "score": 1, "replies": [{"body": ">Why not instead do an Iron Condor, or a long diagonal call spread (PMCC), or maybe a jade lizard.  These use less capital.\n\nSpreads in general suck ass in many ways. Good for the broker thou ! KISS is the way.", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}]}]}, {"body": "What are some strategies you like instead of spreads?", "score": 1, "replies": [{"body": "CSP / CC, mostly wheeling", "score": 1, "replies": []}]}]}, {"body": "I have the capital to do all of those things. And, I do not need to use $11,500 to cover my short put... I sell in a margin account. I do not even need 1/4 of that. \n\nI do sell iron condors. I used to mess with PMCCs but no longer touch them as involves buying options which I do not do anymore. I had some success with them, completely paying off my leaps by selling calls against them but I also got fucked a few times when the stock jumped up in price but I had a sold call open that I had to buy back for a loss to be able to sell the long call\n\nI always make sure I never use more than half of my available margin. Selling puts in a pure cash account is crazy, takes up way too much buying power", "score": 1, "replies": []}]}, {"body": "PLTR - 12/18 15p/16c - 3.40 premium\n\nI do this method often and it prints, especially on stocks you want to own.", "score": 1, "replies": []}]}
{"title": "$NOK and $MSFT investors, found this while doing some late night DD on LinkedIn.", "selftext": "", "id": "jsmkyy", "created_utc": 1605149205.0, "score": 41, "upvote_ratio": 0.86, "num_comments": 28, "comments": [{"body": "[deleted]", "score": 10, "replies": [{"body": "Nokia just brought on this new CFO Marco Wiren last month. He seems like a really sharp CFO. Corrected CEO Lundmark in the Q3 conference call when the CEO accidentally reported a lower guidance range. This CFO also just reported a 75,000 share insider purchase. Last month, industry analyst CSS Insights published its own buyout analysis of Nokia by $MSFT or $INTC: https://www.forbes.com/sites/barrycollins/2020/10/05/microsoft-in-the-frame-to-buy-nokia-again/?sh=6299ceda7228", "score": 10, "replies": [{"body": "Wonder if they want to try phones again? Nokia made most of them last time", "score": 3, "replies": [{"body": "Nokia has not for years been directly in the business of selling cellphones, except for earning royalties from the company that bought the right to brand Nokia phones, HMD Global.", "score": 4, "replies": [{"body": "MSFT killed Lumia but after that earnings call disaster that took NOK below 4, it might be a cheap lotto", "score": 7, "replies": []}]}, {"body": "They got that contract with nasa. So if I had to guess I'd say their going into some type of data move not phones", "score": 3, "replies": []}]}]}]}, {"body": "Quality illuminati type DD", "score": 9, "replies": [{"body": "Check out this Glassdoor job posting from last week for a North American Legal Counsel: “Preferably knowledge and experience with Federal, State & Local governmental contracts, including knowledge of and experience with US Government Federal Acquisition Regulations (FAR).” Recall the recent $600M DOD contract awarded to NOK, $ERIC, $T for 5G testing and now news out this week about stepping up DOD contracts, the mother lode of which was the MSFT $10B JEDI contract. [Nokia NAM Legal Counsel job posting](https://www.glassdoor.com/partner/jobListing.htm?s=234&guid=00000175ba88d0a2a6679a623db9415a&jobListingId=3661393209&pos=101&ao=938917&src=GD_JOB_AD&cb=1605152329898&cs=1_b6107425)", "score": 6, "replies": [{"body": "Alright then. How much leaps to buy. $10000?", "score": 6, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Lol nice position. I probably won't buy 10k if I do proceed with this, any risk I might take won't affect my livelihood.", "score": 3, "replies": [{"body": "I suppose I could flag this YOLO. That’s why I’m up stalking LinkedIn profiles lol. Did the same DD for $NIO when it was almost bankrupt and paying employees with stocks. Watched at 2am every night for any sign of a FB post from China to make sure their power was still on. 🤞", "score": 5, "replies": []}]}, {"body": "Care to share your cost basis?", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I suddenly don’t feel so bad bag holding 4K shares at 3.41. \n\nDo your bags feel heavier over time as you watch airlines and cruises take off? (No pun intended)", "score": 2, "replies": [{"body": "No, I more than make up for losses. Have NIO, PLUG, TSLA, SPCE, AAPL. Not interested in small percentage moves.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Using LinkedIn to do did🤯 youre a wizard wtf", "score": 5, "replies": [{"body": "TY too kind. You can see if insiders are bailing or who they start networking with to find clues about sales or mergers. Also the CEOs post stuff to each other so you can see that they actually are respected in the industry, compared to bearish media hit pieces. Also Glassdoor job postings and employee reviews tell a lot. Like I said, even NIO a simple cat video at 2am was all I needed to know the company was still alive and planning to deliver cars.[Nokia NAM Legal Counsel with Government Acquisition law experience](https://www.glassdoor.com/partner/jobListing.htm?cb=1605159371660&ao=938917&pos=101&guid=00000175baf4438699059723d9b8c540&src=GD_JOB_AD&s=234&cs=1_54cbdb5e&jobListingId=3661393209)", "score": 6, "replies": []}]}, {"body": "Where do you think NOK will be by Friday 11/20?", "score": 2, "replies": [{"body": "Will be close but still early in the week and daily volumes have been strong. High call volume at $4 and I believe we may be above that by then. 🤞", "score": 1, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/Mr_Doghouse don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "I thought Microsoft already owned Nokia.\n\n[Knowledge](https://www.theverge.com/2016/5/25/11766540/microsoft-nokia-acquisition-costs)", "score": 2, "replies": [{"body": "No, MSFT bought the phone division, then sold that to HMD Global. Nokia is now one of the largest multinational telecommunications equipment/enterprise/technology companies in the world.", "score": 8, "replies": [{"body": "So then Nokia is just a B2B. I don't understand the price of that stock at all.", "score": 4, "replies": [{"body": "Much more than that. You can get some idea from these press releases.[Nokia headlines](https://www.nokia.com/about-us/newsroom/press-and-stock-exchange-releases/)", "score": 3, "replies": [{"body": "Then why is the price so atrocious? It seems like a productive company.", "score": 2, "replies": [{"body": "Nokia started to lose market share to Huawei, ERIC, and Samsung under leadership that languished for the past 10-15 years, falling behind in 5G R&D during that time and diluting shares. This year, a new CEO and CFO are trying to turn the company around. Of course, all this in the middle of a new 5G revolution, space race, seismic industry shifts with the Huawei bans.", "score": 3, "replies": [{"body": "So ... NOK 10 Calls 2023?", "score": 3, "replies": [{"body": "Unfortunately I only hold long positions. Any options experts chime in? I think $10 might be too optimistic. In fact today there was an opposite alert, but those change all the time and it was wrong because the price went up to $3.75 after the alert: “On Wednesday, shares of Nokia (NYSE: NOK) saw unusual options activity. After the option alert, the stock price moved down to $3.66. (Wrong)\nSentiment: BEARISH\nOption Type: SWEEP\nTrade Type: CALL\nExpiration Date: 2022-01-21\nStrike Price: $3.00\nVolume: 1124[Options alert 11-11-20](https://finance.yahoo.com/news/analyzing-nokias-unusual-options-activity-145119840.html)\nOpen Interest: 31836", "score": 1, "replies": [{"body": "Well, I guess I just thought that maybe if the company buys back some shares within the year and actually shores up value then it would be a handy 10 easily. You can't even buy 10s tmk though. It doesn't go that high for that stock.", "score": 2, "replies": [{"body": "Would be super excited with that $AMD kind of turnaround. I suppose I was lucky with NIO and PLUg. (Not to mention SPCE on this board.) Anything is possible if the new management succeeds. 👍", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}
{"title": "Let's Have a Serious Discussion", "selftext": "&#x200B;\n\n[  ](https://preview.redd.it/lscaxzl8rqy51.png?width=1152&format=png&auto=webp&s=30b6b9f75952e9bf1399f1c7190a77576a902c39)\n\nI could have added bear gang but we all know they don't need help getting out of the closet.\n\nSo, lets talk WuFlu. The numbers we've seen in the past few weeks have absolutely obliterated all previous records with the introduction of sustained cold weather for the first time since we all hunkered down and put $10k on SPY 200P 4/20. Jpow rammed his fat printing cock up all our asses and we screamed in glee and agony; confused by the pleasure of getting the money fucked out of us.\n\nA lot of bulls got a taste of the forbidden fruit, they wondered if they might also be a little bit bear inside. But as soon as Jpow finished blowing his first load, all the bulls loaded up on TSLA weeklies hundreds of dollars OTM, desperate to ride that cock rocket to the moon. Quick! they said, AMZN 2200c 6/4! ZM 250C 7/17! Screaming 'daddy yes!' as they desperately clung to the throbbing veins of Jerome's phallic federal fury.\n\nYes, they got tendies, and yes the bears may even be asexual now, too afraid to even take a position in fear of the mighty jpow raw-dogging. But what does that say about you, bulls? Are you ready to embrace that you might even be gayer than the bears? Has Jerome pushed you so hard that you're the sub and you don't even know?\n\nFood for thought. I am actually interested to know what all you homos think is going to happen. If current trends continue, we're well over 300k cases a day by Christmas. You know the current administration is gonna let it all burn to hurt the new administration. I'm not sure they will pass a stimulus for the general population. They might for select businesses though, with a tiny little nugget for the rest of us gambling addicts.\n\nWho will be the losers then and who will be the winners? No wrong answers, you're all fuckin gay.", "id": "jsonk8", "created_utc": 1605157399.0, "score": 26, "upvote_ratio": 0.76, "num_comments": 28, "comments": [{"body": "I can’t read", "score": 30, "replies": []}, {"body": "Didn't read anything but the last question:\n\nLosers: poors\n\nWinners: rich.", "score": 25, "replies": []}, {"body": "You're a fucking poet", "score": 17, "replies": []}, {"body": "So buy foreign stocks like Nio?", "score": 15, "replies": []}, {"body": "If death hits 3k which surpass the April ATH, it might get ugly. Infection numbers don't mean much with so many testing being conducted everyday. With a death ratio like COVID, back in Mar and Apr real infection number should be even higher than what we are seeing right now. \n\nAmeritards are cold blood tendy zombies, nobody cares anymore especially when you are making crazy gains while a \"small\" portions of the people are suffering. I love it.", "score": 7, "replies": [{"body": "Yea. That argument worked for the majority of the epidemic. But we have completely doubled the 7 day average daily cases in less than 4 weeks with no meaningful increase in testing. Positivity rates through the roof. Give it another month to get colder with no preventative response. \n\nCould be worse than current optimistic projections. I’m thinking some overleveraged midcaps and meme stocks could fold. Small cap insurance companies etc. \n\nFor example: Boomers dying early, at work, etc with healthy life policies both personal and employer provided could be a death choke on liquidity.", "score": 5, "replies": []}]}, {"body": "Fears of the second wave shutting down the economy are the main reason I got into NIO in the first place... I figured if USA goes tits up I won't go bankrupt. \n\nI'm gonna do puts on the American economy sometime after Christmas", "score": 7, "replies": []}, {"body": "No idea. But I can give you my worthless opinion; no matter how bad the virus gets, the market won't drop significantly. Just sideways volitility before the next bull run. We've already seen that the virus doesn't hurt the trillion dollar companies that move the markets. So while retail and restaurants might be in danger of a significant down turn, the market as a whole is not.", "score": 6, "replies": [{"body": "I'll counter with another worthless opinion. We hit 300k/day conservatively by the new year. At that point health systems across the world are overloaded and we're seeing 6-10k deaths a day. We now know who will be resilient after the first drop. Good gay bull opportunity.\n\nBut who was resurrected by the stimulus? Who is so debt leveraged that they will be completely fucked in two months?  I really don't have the time for real DD until after December but I'm curious  what the answer to this scenario is.", "score": 2, "replies": [{"body": "We'll just rotate back into tech and still be in the bull run", "score": 7, "replies": []}]}]}, {"body": "We got an excellent hint when Pfizer announced their progress. Stocks that dropped will do great as we are forced to isolate longer. Stocks that jumped will trend down, but all will reverse violently once the vaccine is confirmed regardless of infections and deaths.", "score": 3, "replies": []}, {"body": "Cases spike like crazy, lot of boomers die, some leftie states shutdown, right states are Hunger Games. There may be some drops, but nothing like February. The Almighty Printer wins.", "score": 5, "replies": []}, {"body": "Wonderful autism", "score": 2, "replies": []}, {"body": "Tech will always be a winner. This aint 2000 or 2008. In 2000, the market took a shit because companies had insane valuations when they weren't making any money. In 2008, the backbone of the stonk market (banks) were in full meltdown mode. That brought everyone else down, even when it wasn't warranted ($CCL is a great example, and there are **many** of these...from $50 to $15 even though bookings and occupancy were at 100% fucking capacity).\n\nMy point is that only individual businesses will suffer. If the banks are fine and tech is still printing, who tf cares about aviation, cruises, hotels and commercial real estate? Those businesses will suffer but the overall market will be just fine.\n\n**Winners**: tech, banking/payments, BIG oil (long term, even with Biden), large hotels (long term, e.g. Hilton), consumer goods\n\n**Losers**: commercial real estate, cruises (too much debt, doubtful they will all survive and good luck picking the one that does), aviation (same as cruises)", "score": 2, "replies": []}, {"body": "No one gives a shit about WuFlu, it was a hysterical ploy to get Trump out of office. Now he’s gone no one cares.", "score": 2, "replies": [{"body": "I may be autistic but you’re downright retarded", "score": 1, "replies": [{"body": "Tru\n\nOk, we live in a “shiny ball” “squirrel” society, each distraction is given out to the masses for political purposes. \n\nPoint being, WuFlu served its purpose for the election. Now that it’s over $WFLU is going to tank.", "score": 1, "replies": []}]}]}, {"body": "Big brain people know buying puts on AMZN is the way to go right now.\n\n[https://www.investors.com/news/technology/amazon-stock-european-commission-antitrus-violations-amzn/](https://www.investors.com/news/technology/amazon-stock-european-commission-antitrus-violations-amzn/)", "score": 1, "replies": [{"body": "AMZN has retard strength. Pretty sure investors have up to a minor genocide priced in already.", "score": 2, "replies": []}]}, {"body": "Retard wanted to type. Didn’t bother reading though.", "score": 1, "replies": []}, {"body": "Title is a massive turn off", "score": 0, "replies": [{"body": "I could not possibly give less of a shit how turned on you are", "score": 3, "replies": [{"body": "But you said we are all gay", "score": 3, "replies": []}]}]}, {"body": "Unless he got mad that I gave away the free $9 turkey I won, I doubt it. Noah was cool.", "score": 1, "replies": []}, {"body": "I read the title, I look at pic, I like.", "score": 1, "replies": []}, {"body": "Nothing changed between March and November except testing numbers /s\n\nNew therapeutics that are effective. Better knowledge of the disease and metabolic conditions it can induce. Basic staff experience of treating patients. Effective vaccines out in weeks to months. Trump/GOP put out 3 stimis - the Biden bus will definitely put out another", "score": 1, "replies": []}, {"body": "Market has never cared about case counts or deaths. It will continue to not give a shit. The Fed put is in, big money knows that they will get bailed out if anything happens. High-yield bond prices are at historic highs in the middle of a recession, a growing pandemic, and uncertain political climate. People are tripping over each other to get record-low returns on fucking junk bonds, and it's because they know Powell will overpay for the privilege of holding their bags if anything happens. With few exceptions public companies will always be able to get more cheap credit that they can use to keep kicking the can down the road.", "score": 1, "replies": []}]}
{"title": "Pfizer CEO Albert Bourla sells 62 per cent of his shares on same day as vaccine announcement", "selftext": "&#x200B;\n\n[YUP BOYS, TIME TO BUY PUTS.](https://nationalpost.com/news/world/pfizer-ceo-albert-bourla-sells-62-per-cent-of-shares-same-day-vaccine-announcement-made)\n\nhttps://preview.redd.it/euj14cw12sy51.png?width=2140&format=png&auto=webp&s=82004c2dcd18ddd240534673e242aa6672681275", "id": "jsrqxa", "created_utc": 1605173155.0, "score": 16, "upvote_ratio": 0.65, "num_comments": 21, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|1 year ago\n**Total Comments**|44|**Previous DD**|\n**Account Age**|4 years|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n**Vote Spam (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_spam&message=jsrqxa)|**Vote Approve (NEW)**|[Click to Vote](https://www.reddit.com/message/compose/?to=VisualMod&subject=vote_approve&message=jsrqxa)", "score": 1, "replies": []}, {"body": "Boomer reaction time, news has been out and posted 100 times old man", "score": 26, "replies": []}, {"body": "#PER\n\n.\n\n.\n\n\n.\n\n\n.\n\n\n.\n\n\n.\n\n\n.\n\n\n.\n\n.\n\n\n.\n\n#CENT", "score": 9, "replies": [{"body": "Lol", "score": 3, "replies": []}]}, {"body": "Who gives a fuck he arranged it months ago", "score": 9, "replies": [{"body": "With this announcement likely also. I'm not a scientist or an SEC agent, but I'm sure stonks go up in a pandemic when you have this news likely", "score": 3, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Holy fuck this sub is retarded. Have you ever heard of SEC filings?", "score": -1, "replies": [{"body": "Who tf cares about a SEC filing, if you control when the news goes out then you get to manuiplate the stock price to coincide with your sale\n\nIf you aren't slightly skeptical that the timing of a massive sale from the CEO just so happened to be *perfectly* timed with the voluntary press release of release of extremely positive data, well, ok lol. Quite a convenient coincidence", "score": 5, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": ">who decides when the news gets published? the CEO.\n\nSEC filings ... Are... Published.. by law. \n\n>so what reverse insider trading is now legal or what?\n\nWhat the fuck is that? Reverse racism's retarded cousin?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Oh fuckkk I see what you're saying. Yea I guess only the CEO of one of the largest drug companies could have guessed that a drug company would have developed a vaccine during a pandemic. It's not like anyone could have seen those filings back in August and predicted that Pfizer would make an announcement approx 1-2 days before the CEO sells 60%+ of his shares. What a bunch of fucking cucks!", "score": 2, "replies": [{"body": "Hi, big retard here. Do people follow SEC filings to gain insight into where the stock could lead and does that work more than it doesn't?", "score": 3, "replies": [{"body": "No one here does that lol", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "It may have nothing to do with the company...\n\nThe ceo may have been under huge stress, the board cracking the whip day and night for months. Trying to manage the largest inflow of new hirees ever, all the fda boureaucratic coordination, not to mention the difficulties of engineering the vaccine, dealing with scientists, appeasing stakeholders.\n\nThis is a tough job, and the guy is only human. He may have simply been frustrated with his position, and looking for a good moment to exit. Selling your shares before you step down is only natural.\n\nLet the poor man retire in peace.\n\nI say calls because governments still work in 1100s feudal fashion and pfizer will be getting gov contracts for the foreseeable future.", "score": 6, "replies": []}, {"body": "Yeh so. I would do the same. Be stupid if you didnt!", "score": 3, "replies": []}, {"body": "Why is the stock so flat considering they came up with a vaccine?", "score": 3, "replies": [{"body": "No published peer reviewed studies = this is essentially gossip.", "score": 3, "replies": [{"body": "Didn't they also announce they were going to sell the vaccine with low margins and wouldn't make huge profits off of it?", "score": 1, "replies": []}]}]}, {"body": "Priced in", "score": 2, "replies": []}, {"body": "Banned", "score": 1, "replies": []}, {"body": "I think you misunderstood, Pfizer CEO had a vaccine announcement planned for the day he initiated a stock sale. Nothing wrong here 😬", "score": 1, "replies": []}, {"body": "How dare he make money!! Seriously get off this sub if you think this is a problem. You're a hypocrite and you don't deserve money.", "score": 1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "jsxkad", "created_utc": 1605198119.0, "score": 7, "upvote_ratio": 0.82, "num_comments": 22, "comments": [{"body": "Yeeeeeet", "score": 3, "replies": []}, {"body": "Dude, how are you so sure?\n\nActually. Stonks only go up. I'm in, x20, same calls", "score": 3, "replies": [{"body": "To the moon I guest🚀", "score": 2, "replies": []}]}, {"body": "I’m in. 25x 17.5c 11/20", "score": 2, "replies": [{"body": "Lets do this🚀", "score": 2, "replies": []}, {"body": "Exact same 🙏🙏🙏", "score": 1, "replies": []}]}, {"body": "Wtf is this. I'm in", "score": 2, "replies": []}, {"body": "You think it's going up 8% in a week?", "score": 2, "replies": [{"body": "Yes🚀", "score": 1, "replies": [{"body": "Godspeed, retard", "score": 1, "replies": []}]}]}, {"body": "I don’t know what this is but I’m in", "score": 2, "replies": []}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/zupooli the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**STWD**|**$17.5**|**BUY CALL**|**2020-11-20**|**$0.07**|**$16.445**|**1674**|**480**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckhf1swda97oj0770d1a206tl) | [Track Record](https://www.pickmojo.com/user/zupooli/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**", "score": 1, "replies": []}, {"body": "Yolo with my last $70 available", "score": 1, "replies": []}, {"body": "Cashing out at $19?", "score": 1, "replies": [{"body": "Ye", "score": 1, "replies": []}]}, {"body": "Ok, fine. Figured I should finally try options. Just bought a single contract, lol. Baby steps.", "score": 1, "replies": [{"body": "It’s my second option lol", "score": 1, "replies": []}]}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/zupooli the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Idk why I listened to this advice but I got me some good gains today😭", "score": 1, "replies": [{"body": "Your welcome dawg", "score": 3, "replies": []}]}, {"body": "Ngl I lost faith but when I woke up this morning around 9 I nearly shit myself. Was 75 contracts deep.", "score": 1, "replies": []}]}
{"title": "Me when 🌈🐻 tell me to sell my NIO shares because it’s gunna crash", "selftext": "", "id": "jt0766", "created_utc": 1605206129.0, "score": 155, "upvote_ratio": 0.94, "num_comments": 20, "comments": [{"body": "This shit has retard strength like nothing I’ve ever seen", "score": 58, "replies": [{"body": "It’s like tesla but with even more retard strength", "score": 18, "replies": [{"body": "true dat.", "score": 3, "replies": []}, {"body": "It's worse than PRPL", "score": 1, "replies": [{"body": "I’ll be honest I enjoyed seeing actual DD here that didn’t just involve rocket ships. I don’t think 90% of the NIO folk have done any real DD about the stock. It just went up and it made them money. Which I’m cool with since that is what this sub is all about, just saying I enjoy a high functioning autist here every once in a while", "score": 4, "replies": []}]}]}]}, {"body": "I shouldn’t have sold my shares at 15 and at 25 and at 32 🧍", "score": 21, "replies": [{"body": "I sold at $7 lol, up from $5.40", "score": 14, "replies": [{"body": "Damn that'd be a 10 bagger with shares if you held long enough.", "score": 4, "replies": []}, {"body": "I sold at $5.18 up from $2.14. Was holding onto a small amount of it for about a year and sold it cuz I got bored of it", "score": 2, "replies": []}]}]}, {"body": "Everybody panic sold yday", "score": 13, "replies": [{"body": "Can’t sell if you don’t have a sell button 🚀🚀", "score": 17, "replies": [{"body": "Robinhood is down for minor technical errors", "score": 5, "replies": []}]}]}, {"body": "260 @ 20.00", "score": 4, "replies": []}, {"body": "I’ll sell when it hits 100", "score": 5, "replies": [{"body": "weak", "score": 5, "replies": []}, {"body": "when it hits tesla's peak.. $2000's", "score": 5, "replies": [{"body": "At 2k the market valuation would be as high as Apple bruh.", "score": 1, "replies": []}]}]}, {"body": "Next up BYDDF.", "score": 1, "replies": []}, {"body": "Don’t you mean Wong?", "score": 1, "replies": []}, {"body": "this aged well", "score": 1, "replies": []}]}
{"title": "Pfizer Deals Rolling In", "selftext": "[deleted]", "id": "jt0ucg", "created_utc": 1605207980.0, "score": 11, "upvote_ratio": 1.0, "num_comments": 26, "comments": [{"body": ">FDA will never refuse this vaccine, especially under Mango.\n\nHe's on his way out. Probably thinking of ways to fuck up the economy so that he can later say \"you have it good under me.\"", "score": 6, "replies": []}, {"body": "I am down from days ago but holding this motherfucker full death.", "score": 3, "replies": [{"body": "In before spike or after?", "score": 2, "replies": [{"body": "After lol", "score": 5, "replies": [{"body": "gonna be a hundredare don't you fucking worry my guy", "score": 4, "replies": [{"body": "Thanks... May such words be wise and blessed by God so i can make money", "score": 2, "replies": []}]}]}]}]}, {"body": "20m in revenue won’t do much to a company with as much market capital as Pfizer. It is nothing close to what they’d get from making a successful vaccine, but that has been priced in at this point. Pfizer=boomer stock that lacks the sizzle. Go GILD if you want to go long. They bought IMMU and are creating a vaccine with S Korea through IMMU and it is the biggest vaccine company that isn’t releasing trial news. Buy it because when people figure out the true value it should be in the $200+ range within a year 300+ in 4 years if their cancer treatment gets a liver cancer approval instead of just stage 4 breast cancer(100% survival rate in a specific type of breast cancer) treatment approval.", "score": 2, "replies": [{"body": "20m in revenue? If they charge $50 a dose, they've got a 50% profit margin on 20m+ VACCINES alone, so half a billion dollars. Also, 20m vaccines itself is probably way light, because between Australia and Israel they already are on contract for 17m doses.\n\nLong GILD is unrelated to post.\n\nedit: $40 a dose.", "score": 2, "replies": [{"body": "GILD is also a pharmaceutical company with a vaccine in the line similar to Pfizer. You should probably do more research on the pricing of the drug instead of spouting numbers out of your ass. Drugs like vaccines will have a fixed price, and that fixed price will be offset by the losses suffered from giving the vaccine away for free to third world countries(have already announced they would do so through the Bill and Melinda foundation). I think Pfizer already announced their vaccine would be $17 x2 doses for first world countries. Good luck on your investment, the split is going to do more for the stock than the vaccine will.", "score": 1, "replies": [{"body": "\"drugs like vaccines have a fixed price\" that's not how anything works. Pfizer will charge what they desire, but they desire the volume and to be first to the fucking table. They've committed to a sweetheart deal in hopes that it makes the FDA more apt to approve. This isn't some gout drug, it's a vaccine solution for a global pandemic.\n\nGiving away vaccines for free wouldn't be through a foundation. The Gates foundation will be paying for them at low cost. Why fucking give them away if someone else is getting the credit. It'll eat into \"profits\" if third world countries *would* be paying for them, but hot take: they fucking wouldn't be without help. If anything else, economies of scale reduce cost, and they sell vaccines for cost which they wouldn't have sold in the first place.\n\nper [https://globalnews.ca/news/7453397/biontech-pfizer-coronavirus-vaccine-price/](https://globalnews.ca/news/7453397/biontech-pfizer-coronavirus-vaccine-price/)\n\n>In July Pfizer had agreed with the U.S. government the supply of 100 million doses of its potential vaccine at a price of $39 for a two-dose immunization, or $19.5 per dose, with the option to sell another 500 million doses under conditions to be negotiated separately.\n\nThe split locks in fucking tomorrow, so if there was a run, it would be happening RIGHT FUCKING NOW.\n\nagain, long GILD is a different topic, but you are misguided on the Pfizer vaccine. how about Provide some info on GILD vaccine", "score": 1, "replies": [{"body": "$19.50 per dose is a lot closer to $17 than $70(your original number before you double edited). I should point that out just in case your on the wrong side of the spectrum.        \n\nThe gates foundation would be paying for them at cost which would certainly eat into profits because they are less likely to be able to produce as many profitable vaccines in the same time period. It’s basic math. The market dropped out quite a bit with high 2/5 yr bond yields. I think it was institutional profit taking before a pump tomorrow(cyclicals and CSCO).       \n\nSome people might view the two companies as valuable as separate entities than as a combined company. There’s a reason why a company would split up into two different companies and it’s usually to become more profitable if it isn’t due to government oversight.        \n\nAre you the type of investor that sells when you hear about layoffs?       \n\nEdit to put a phrase in parenthesis related to his original post.", "score": 1, "replies": [{"body": "Nobody said $70, you fucking tool. I usually don't argue with people, but you are a fucking exception to the rule. I said $50, you said $34.\n\nThe gates foundation PAYING for additional vaccines day 1 eats into profits, but I promise the people at Pfizer scheduling vaccine purchasing are smarter than you and have also figured that out. Day 1 they aren't going to Congo tribes, and it's amazing it has to be spelled out for you.\n\nThe people who view the company as more profitable as two companies would be getting in now, because again, the shares come for **free** TOMORROW. the 13th is date of record. What you're saying doesn't actually reflect market behavior, so I don't know why the fuck you think anything you're saying holds water.\n\nAre you the type of investor to say you were right even when the market behavior shows you that you were wrong?\n\nFinally, WHERE IS THE GILD VACCINE INFO. LINK IT. PUT UP OR PLEASE, SHUT UP. Your first batch of bullshit is still out there stinking up the place with no support.\n\nedit: You're the one sneak editing, shit for brains.", "score": 1, "replies": [{"body": "Nope I definitely said $17 per dose. I never said $34 per dose you fuckwitted retard. When you have positive returns on investment lmk.         \n\nI agree that the people at Pfizer scheduling the manufacturing of the drug are smarter than me. I also think you’re too dumb to realize there is a such thing as manufacturing capacity. Day 1 the vaccine will be going to the most vulnerable, and Pfizer has announced that third world countries would get their vaccine at a similar rate to first world countries as long as they have the ability to distribute the vaccine.          \n\nThe shares aren’t necessarily free, it will come at a cost of cutting down Pfizer’s main stock price. At least that’s what their media announcement said as the company is a spinoff.       \n\nGo ahead and scroll through my comment logs.        \n\nLook up immunomedics vaccine info. If you’re too dumb to do proper Dd then you’re too dumb for me to help any further. Learn to hit those rotations and recognize insider manipulation of prices.", "score": 1, "replies": [{"body": ">$17 x2 doses\n\n= $34. You really are fucking dense aren't you. and if you meant $17 for both, then you're dense AND talking out of your ass about the stated price.\n\nPfizer is going to roll it out to the countries that are paying a premium for them, as is typical with standard supply and demand. Probably Germany prioritized because of funding.\n\nAnd yes, you are correct about the drop of Pfizer stock after the split. Not before. To call the vaccine news spike on Monday standard market \"rotations\" is absolutely naïve and I regret giving anything you said any credence at all. You're so damn smart that you are able to spot insider trading for a mile away? Bullshit. a hindsight 20/20 trader,\n\nMy account looked pretty fucking good when I sold the SAME FUCKING PFIZER CALLS on Monday for +250%, which I'm back in for. Check post history, cuz there's only like 4 of them. I'm not gonna dig through your comment history for source links that you aren't confident enough to provide yourself, because they must be worthless. You don't want the people around you to win, and that fucking sucks. If it was real and good, you'd be itching to tell everyone about it.\n\nListen, I hope things go well for you on GILD, but Pfizer will spike. full permission for a told you so if it doesn't.", "score": 1, "replies": [{"body": "“$17 x2 doses” so in short it is $17 per dose. Congrats you’re so fucking stupid you can’t do basic math.        \n\nIf I’m talking out of my ass, how did I know the price but you didn’t? You should go ahead and check their media announcements about vaccine distribution.        \n\nIf I’m a hindsight trader, perhaps you should check my comment history. Ive probably lost more money than your account is worth on 1 set of puts only to make it back off of a single swing trade.         \n\nThe spike actually wasn’t from vaccine news as much as you’d think. It was more from 2/5yr bonds rising by .10 basis points(.6-.7) which drove the cyclical market up. You should check out how the bond market effects the stock market. Why do you think EVERY biomedical stock peaked on Monday and not just Pfizer? Are you that fucking stupid? Oh wait, we’re sitting here having this conversation so you are obviously that retarded.       \n\nCan you please explain the trading setup of your Pfizer calls? When did you buy/what price/how many and when did you sell/at what price/how many so I can double check the options charts on Webull to see if it did indeed happen? I have been charting Pfizer for a while waiting for the perfect setup, but haven’t found it. Sure Pfizer can go up, but don’t expect it to skyrocket unless every other cyclical is going up, in which case you would’ve made significantly more on oil, airline and banking as far as which cyclicals you should’ve invested in to maximize profits(their calls should get depleted too because of the upcoming split/merger).        \n\nI’m not so smart I can spot insider trading. I use market insider, different black box and rumor mills, and news sources. I believe Pfizer’s specifically was a news source so I was technically later than the RICH people.        \n\nI don’t pull up my comment history and point to specific posts because it is literally a mine full of gold. Check how many followers I’ve picked up in the past month, and that’s with a 1 month ban for calling the mods retarded fucking fags(ban was for a utility company and they thought I was promoting an otc company).          \n\nI don’t tell people my strategies and such because then the banks know exactly what “average” investors like myself key in on. When we make money the banks lose money, that is something that is important to remember. I’ve had to change my investment strategy 2 different times since posting them on Reddit. I won’t post my 3rd strategy and see if this will last for a year or more. I’d be more than happy to tell people my strategies if they paid me and ensured that I got all credit for giving them guidance on their investment theory/plan. No point telling people exactly what to look for if I’m not going to get credit and they’re going to say it was all them(ive watched a currency trader lose money after I stopped giving them information because they were bragging about how good they are and refusing to give me credit).          \n\nAlso something to note: history has a tendency of repeating itself. The timeline you choose to study can greatly effect your investment strategies because almost everything works on a swing when markets are functioning “normally.” Such is the adage of “stock market always goes up.” If you can choose the right week/month/year/set of 4 years to follow you will figure out a pattern tendency. The market “correction” already happened and is in the middle of happening. The rotations to cyclical and back to tech have to be completed before the economy will tank.      \n\nIf you’re all in on Pfizer, good luck on limited gains boomer cause I believe dividends have already been paid out for this q.", "score": 1, "replies": [{"body": "Jesus fucking Christ I hope this is an act. You’re arguing that you were even more wrong than I’m giving you credit for. The agreed on price was $39 per double dose, 19.50 each.\n\n“The average investor like myself and big banks key in on” next you’re gonna tell us about your online IQ test right?\n\nPull your finger out of your ass. Post a screenshot and prove me wrong.", "score": 1, "replies": [{"body": "So now you’re gonna misquote? Are you phrase dyslexic? That explains your mental ineptitude.              \n\nI don’t post full value of my accounts because people I know irl follow me. I’m not tryin to tell the world my full value, but if you went through my comment history you might find some bread crumbs.", "score": 1, "replies": [{"body": "Damn but you ARE willing to say it’s a lot huh? Discretion is key.\n\nWeak shit my guy. Try less.", "score": 1, "replies": [{"body": "ROFL nothing you said makes sense. I suppose that’s what happens when certain people aren’t willing to admit they’re wrong and need to find an outlet.", "score": 2, "replies": [{"body": "Yeah, I noticed that too.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "I hate to say that  but the vaccine is \"priced in\". It won't be a big surprise imho. On the downside, pfe will face a strong competition...all in...I think it's a sell", "score": 0, "replies": [{"body": "How is it priced in? Up $1 from prior to the news on Monday. Vaccine has nearly 2 fold efficacy compared to what was expected.", "score": 3, "replies": [{"body": " Get some calls and you will see how \"priced in\" it is !", "score": 1, "replies": [{"body": "I’m in 6k", "score": 1, "replies": [{"body": "good luck bro !", "score": 2, "replies": [{"body": "Appreciate it man", "score": 2, "replies": []}]}]}]}]}]}]}
{"title": "Moderna $MRNA won’t stop", "selftext": "Hear me out. Moderna is most likely the next company to come up with the COVID vaccine. Pfizer is a huge company that works with a lot of different drugs (208.72B). So, even though they were the first vaccine to show up, there shares did not rocket as hard as some other smaller companies might have.\n\nNow, Moderna was the first actual pharma company that suggested using m-RNA, and are now close to a vaccine in their own right. They have a market cap of (34.74B). Not nearly as big as Pfizer. But, if the vaccine that they test comes out and proves more effective than the 90% result that the Pfizer vaccine showed, it will be the most dominant vaccine.\n\nThe population does not care so much about the logistics of how the vaccine will be shipped or handled. If it has a higher effectivity compared to the other vaccines, that will separate it from 2nd place and below. \n\nPer articles online, Fauci has said he expects this vaccine from Moderna to come out in a matter of days, not weeks. If it does prove more effective, $MRNA will most likely shoot up to $120-130. \n\n$MRNA +5 105c 12/24", "id": "jt3b2z", "created_utc": 1605215410.0, "score": 6, "upvote_ratio": 0.8, "num_comments": 21, "comments": [{"body": "I just hope it’s not coming tomorrow,I bought puts today lol", "score": 9, "replies": [{"body": "For my sake, I hope it comes out tomorrow.", "score": 3, "replies": [{"body": "Downvoted ,I’m just kidding ,if it comes out tomorrow after market I’m fine ,I just hope is not pre market like last time", "score": 2, "replies": []}, {"body": "most likely -monday-wednesday.  wednesday is probably pfizer eua", "score": 1, "replies": []}]}]}, {"body": "It’s hard for a vaccine to be more than 90% effective. But they may have an advantage over Pfizer in terms of storage temp. Also Russia announced its vaccine using 1960 vaccine technology was 92% effective.", "score": 3, "replies": [{"body": "The Russian vaccine is actually only 42% effective, but 50% of those in the trial fell out of a window before completion.", "score": 2, "replies": []}, {"body": "Wow. Okay Russia is a natural freezer of a country though haha. Hopefully, Moderna can pull through as the No. 1 vaccine manufacturer.", "score": 1, "replies": []}]}, {"body": "congrats my guy", "score": 3, "replies": [{"body": "Thanks bro", "score": 2, "replies": []}]}, {"body": "Sexiest DD ive ever seen, this guy must work for Moderna", "score": 2, "replies": [{"body": "Holy shit bruh. I hope yall fucking joined", "score": 1, "replies": [{"body": "I got royally fucked buying 11/20 100C on open", "score": 2, "replies": [{"body": "I think this is where operation diamond hands begin.", "score": 1, "replies": [{"body": "I don't know.. do you there's any hope for it to print before 11/20?", "score": 1, "replies": [{"body": "I think the stock will go up. But the greeks are what you need to worry about", "score": 1, "replies": [{"body": "I break even at 103 on expiration, friday. I think I need to be out of this trade by tomorrow with whatever win or loss I have. Theta is high at 0.6 and I don't trust if the good sentiment will last till Friday.", "score": 1, "replies": [{"body": "Yeah. That is why I dont mess with short term options. It’s just way too risky. If you have the balls, then go for it", "score": 1, "replies": [{"body": "Yeah, it was kind of a yolo, I'm not proud. Being that autistic I lost big money on this trade. I usually sell options, this was the first one I attempt buying like an idiot.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/joshroflee don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Was it a 100p? If so, good job. If not, sorry for your loss", "score": 1, "replies": []}]}, {"body": "$156, how high will it go?", "score": 1, "replies": []}]}
{"title": "Li up 14% after market. Maybe I can get a Tesla tomorrow?", "selftext": "", "id": "jt5bep", "created_utc": 1605221826.0, "score": 10, "upvote_ratio": 0.79, "num_comments": 20, "comments": [{"body": "Dam that’s nuts lol", "score": 8, "replies": [{"body": "Yeah lol", "score": 2, "replies": [{"body": "One hell of a play", "score": 2, "replies": [{"body": "Thank you!", "score": 1, "replies": []}]}]}]}, {"body": "Li about to steal the meme race with a come from behind victory. Weekly calls up like 5000% tomorrow 😂", "score": 3, "replies": [{"body": "Tbh when Li first IPOd talk was they were the more luxury brand vs Nio. Nio was just bigger with gov backing plus Baas. Had shares for awhile but let em go too soon lol.", "score": 2, "replies": []}, {"body": "Li is going tight behind NIO", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Hope keep going up tomorrow and let me have time to  get all my tendies. Just just XPEV today", "score": 1, "replies": []}]}, {"body": "Props man props. Li's going to moon with earnings.", "score": 2, "replies": []}, {"body": "I’m with you on the Nio 50c 11/13. Godspeed retard", "score": 2, "replies": [{"body": "Oh god he’s gonna get fucked on that one", "score": 1, "replies": []}]}, {"body": "So much for my puts 🤪", "score": 1, "replies": [{"body": "Your puts will help me get over 10k😆", "score": 1, "replies": []}]}, {"body": "Take your money and run dude; Li auto is sketchy as fuck. Not at all like NIO", "score": 1, "replies": [{"body": "https://www.lixiang.com/news.html", "score": 3, "replies": [{"body": "I am less skeptical...", "score": 1, "replies": [{"body": "Gonna do research first", "score": 1, "replies": [{"body": "I was trying to look at some youtube videos of the car, but there is only a few videos of the car itself, the rest are on the CEO or the stock itself. I just feel like if they were selling a lot of cars, there would be more than reviewers driving them.", "score": 1, "replies": []}]}, {"body": "How does their website make you less skeptical especially when starting from a place.of fuck that sketchy company? Lol", "score": 1, "replies": []}]}]}, {"body": "https://www.lixiang.com", "score": 2, "replies": []}]}]}
