{"title": "Covered calls", "selftext": "I'm looking to get into some covered calls to generate a little more income. I'm looking at LMT, BA, DE and HCN. what stocks do you guys like to do this strategy on?", "id": "5t05ph", "created_utc": 1486649305.0, "score": 7, "upvote_ratio": 0.77, "num_comments": 29, "comments": [{"body": "Why would you do this over selling puts?", "score": 5, "replies": [{"body": "I am just looking at different ways to generate a little more from my investments without adding a boat load of risk. ", "score": 1, "replies": [{"body": "I understand that, however the risk and payout is the same. If you already own the shares, then it makes some sense to sell the calls at this point in time. Your post made it sound like you didn't own any yet and were looking to get a position opened. Selling puts is a single leg therefore lower commission for most people. It also does not require the full amount of capital to buy the x*100 shares. Payout and risk is the same, as one strategy is just synthetic of the other. Looking at a P/L chart for both may help explain my point. When you get assigned on the put, at that point sell calls. then when you get assigned on the calls, start selling puts again.", "score": 8, "replies": [{"body": "OK thanks this is exactly what I was looking for. I have not entered positions at all. I am in the process of doing a complete portfolio adjustment to a more responsible set up. I am currently consolidating funds into one account and doing research. I am exploring different strategies if you have any other advise I will listen.", "score": 2, "replies": []}, {"body": "also depends on whether or not he wants to participate in upside. Since OTM options are the most traded and most liquid, if he's selling puts they're probably OTM, and if he's selling calls they're prob OTM.\n\nATM, I'd sell puts since there's less commission, and lower chance of getting exercised early.", "score": 1, "replies": [{"body": "It just comes down to position delta the way I see it. If you are selling OTM puts you are trading a lower delta than ITM. So if you wanted more upside participation you could match the put delta to that of a covered call.", "score": 1, "replies": []}]}, {"body": "Is the drawback of this strategy the increase in margin requirement if your put gets assigned? If you were to do this with say, GOOGL or even FB you would need high 5 digits in margin to cover the underlying when you are selling the calls.", "score": 1, "replies": [{"body": "You always need to keep in mind the value of the underlying you're trading. A covered call position would require enough capital initially to purchase the sets of x*100 shares. Going with the put strategy, you require less initial margin, however if you start selling more than you have the power to buy, you are increasing your leverage. All depends on what your intention/strategy is.", "score": 1, "replies": []}]}, {"body": "OK so I am looking at Boeing here and and there a bid price on the strike price $162.5 (trading @$164.87 currently) of $1.85 with expiration date of March 10th. So if I want 500 shares I want to sell 5 puts for $925. And if the price dips I get assigned them at that price and I keep the $925? THEN sell the covered calls? I know there is no such thing as a free lunch on wall street but this has me cautiously optimistic here.", "score": 1, "replies": [{"body": "Yes, that would be a way to get long stock.  Keep in mind however if it drops to say 120$ you're still on the hook for that 162.5 price.  I'd want make sure that that size of position fits into my account and doesn't eat up all my available buying power.", "score": 2, "replies": []}, {"body": "This is a comment in response to another tastytrade \"free money\" post a while back - I believe it was referencing AAPL:\n\n> Here's an example: in order to overcome the commissions/taxes on a small trade, you need to sell puts on volatile underlyings. being generous, say with the stock at 95, you sell 90 puts.\n\n>Then Aug. 2015 or Jan. 2016 happens, and the stock craters to 70 in a week, you're assigned. If you come up with 9k per contract, you gain 1.50 in premium and you own stock, and you're down 20 on it.\n\n>OK no problem, you can just sell calls to \"reduce your basis\" - but you can't get any premium anywhere near your stock purchase price, so you sell calls at 75. Then the next month, like Sep. 2015 or Feb. 2016, happens and the stock bounces back to 95. Stock is called at 75, you gain another 1.50 in premium and you locked in a loss of 15 on the stock.\n\n>Anytime you ever hear or say the words \"pretty much guaranteed\", it isn't.", "score": 1, "replies": [{"body": "Oh god I'd never do this with AAPL. I was actually looking at GM if it corrects a bit. If I get put the shares pay dividend of 4% or something. Or Boeing I don't see that not doing well under a Trump administration. \n\nTo your point as I am still trying to learn. If I sell cover calls in your scenario and the underlying starts moving against my interests could I not just buy the call back?", "score": 2, "replies": [{"body": "GM gapped 5% today - it ran what, 25% in a month starting in Nov.?  Not exactly low-vol - and if it were, the premia would be too small.\n\nI'm not saying the strategy can't work - just make sure to understand it, and take the time to study real prices, including all real costs, and closely watch them develop over a few trading cycles.  Don't take the TT stuff as sufficient - it's easy to look like a hero if you never post actual P/Ls, actual acct. balances, and actual entry/exit dates, ignore commissions, taxes, exercise fees, margin, and conveniently forget to talk about losses.\n\nOn the calls, sure you can buy them back, but at a loss, and maybe a significant one if you get a move like AAPL in Aug. 2015 (or GM, today?), plus costs.", "score": 1, "replies": [{"body": "Couldn't I also let them get called away? I picked GM because they had that tasty dividend should things turn south. ", "score": 1, "replies": [{"body": "Yes if you sell covered calls, and they expire ITM, you can let the shares get called away.  Your gains on the stock are limited to the strike price obviously, and the strike may be significantly lower than your stock purchase price.  And you may have an assignment fee, depending on the broker.\n\nThe problem is that doing this (sell put, acquire stock, sell covered calls against stock you now own), while it sounds great in theory, can be very different in the real world when all costs are taken into account.  Further, if you look at actual premia and spreads, you'll see that many times you need to work with options very close to ATM and in volatile underlyings that can lead to the whipsaw situation above.  Sure it can be used profitably, just be sure you understand all the numbers and don't take the tastytrade stuff at face value.", "score": 1, "replies": []}]}]}]}, {"body": "How else could I protect against this? Would buying a lower strike price put at the time of higher strike sale? ", "score": 1, "replies": [{"body": "You can buy a lower strike put, that would be a put spread - that's a different strategy.  Generally not one used when the goal is to acquire the underlying shares, but it can be used to do that depending on the strikes chosen:\n\nhttp://www.theoptionsguide.com/bull-put-spread.aspx", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Dividends for me.", "score": 1, "replies": [{"body": "It gets priced in, so you still can walk away with the same amount either strategy.", "score": 1, "replies": [{"body": "I think you're right. Ok, what if your bullish and want to write an OTM but still capture an increase in the equity. A secured put won't capture the gain in the underlying, only the premium earned.", "score": 1, "replies": [{"body": "By doing this you are creating 2 similar positions with different delta. A higher delta position will move more with underlying movement. So you would need to sell a put that has equal delta to the covered call in your original thought. If you sell an OTM put it will have a lower delta, therefore your payoff graph wont match, but will be shifted. If you are bullish, selling a put ATM or ITM wont be an issue. If it does move against you, it will move at the same rate a covered call would. and if the stock goes up, you will capture that movement this way.", "score": 1, "replies": []}]}]}]}]}, {"body": "Sell both calls and puts ", "score": 2, "replies": []}, {"body": "HCN doesn't really have a liquid options market.  The others are OK, but my preference would be BA due to better liquidity.  I haven't worked out the correlation but I'd assume BA and LTM have a reasonably strong relationship since they're in the same industry.", "score": 2, "replies": [{"body": "Yes I was looking at them because fearless leader seems to be wanting to ramp up the military a bit. Thought I could grind them for covered calls for a while.", "score": 1, "replies": []}]}, {"body": "Make sure you pick securities with good liquidity in the options market. When you write covered put/calls you want to collect a reasonable premium for time value. Illiquidity means 1) You'll have to play with the bid/ask posted by the market makers which are seldom favorable, and 2) You'll have a hard time taking out the trade before expiration date.\n\nEDIT: To reiterate what others have posted, considering writing puts if you don't own the securities yet. ", "score": 1, "replies": [{"body": "OK great!! Thanks for pointing me in the right direction. I'll go study what you have suggested and I'll paper trade it a bit and see how it goes. Thanks again. ", "score": 1, "replies": [{"body": "Great. Keep in mind that a problem with paper trading is that you'll possibly get filled on illiquid trades that just wouldn't happen in real life.\n\nLooking at the names you posted, BA has good liquidity on the standard expiration dates (Mar 17, for example). ", "score": 1, "replies": [{"body": "OK so I'll use BA as a test case for the paper trade (after I study more about what you recommended).", "score": 1, "replies": []}]}]}]}, {"body": "Here's the only problem I have with selling calls these days.  Volatility is rock bottom, which means the market is generally grinding up.  It would stink if you had calls written against your long stocks in a bullish market, it would be particularly stinky if you'd gotten a nickle for your call, and ended up giving up $1 on the stock.  \n\nDon't get me wrong, I'm not suggesting one try and time the market or time volatility, but it can pay to attempt to be tactical (easier said than done).\n\nLike others are saying, selling puts (and spreads and condors and other short strategies) is where it's at.  I've been doing it for about a decade, in up markets, down, sideways, recessionary....it always works.  As long as you're consistent, understand your risk (manage it), diversify, and BE CONSISTENT.  I can't stress that last one.  \n\nI have buddies that'll ask for a trading idea, they take one of my 12...they get one that's a loser and they cry.  I show them that 9/12 were winners, with net positive gains....consistency!!!  \n\nAlso, keep in mind some puts will be BIG losers, like 100-400% of your initial premium.  This will inevitably happen and is all part of reason why you need to be consistent.  ", "score": 1, "replies": []}]}
{"title": "Buying NVDA Now?", "selftext": "Am I absolutely stupid for thinking that buying NVDA today before the earnings report is a smart move? Is everyone shorting it? Is NVDA safe at all to buy? I'm totally torn.", "id": "5t26hi", "created_utc": 1486668226.0, "score": 10, "upvote_ratio": 0.73, "num_comments": 22, "comments": [{"body": "It's about 25% of my portfolio; in at an average of $118.05\n\nLet's hope for those good earnings!", "score": 3, "replies": [{"body": "Hold for years...", "score": 4, "replies": []}, {"body": "That's a high fucking average ", "score": 9, "replies": [{"body": "Just bought like a couple days ago for the earnings release.\n\nWas in ~$108 a while ago and sold after the spike to $113", "score": 2, "replies": [{"body": "Me Too.", "score": 2, "replies": [{"body": "Good luck to us; I like the username.", "score": 2, "replies": []}]}]}]}, {"body": "RIP \n\nCalled it.", "score": 0, "replies": [{"body": "Ends in the green after hours rip your prediction ", "score": 1, "replies": [{"body": "Holy shit hahaha when I made that edit it was -8%", "score": 1, "replies": []}]}]}]}, {"body": "Just bought 27 shares, yolo right?", "score": 3, "replies": [{"body": "NVDA is a very safe bet, nothing to worry about. ", "score": 1, "replies": []}]}, {"body": "You'd better hope it's a tremendous earnings report if you're buying it today after the run its had.  I'm definitely not saying it won't be/can't be, but I think if it is slightly disappointing after the run it has had it will definitely pull back. If the quarter is another home run I think you could see the FOMO (and there's already so much FOMO here) ramp up big time as I think many people believe that - despite the fact that this is a good long term story - that it's overdone short-term. They have another insane quarter after the last insane quarter (which saw this go up 25% in a day) and people are going to go nuts.\n\nFOMO = fear of missing out.\n\nAlso, as someone else noted, no one's saying you have to buy all you want to buy at once.\n", "score": 2, "replies": [{"body": "I think it's a nice day to take your profits and let a little dust settle. ", "score": 1, "replies": []}]}, {"body": "Always remember, everyone bought NVDA because of what they DID. Buying today you're buying it because of with it WILL DO. Completely different perspectives if you got in at $90 vs $118. However, if you can look long term 2018+ I think it's still a smart move, but with the run up to earnings you have to expect a lot of people cashing out on 300% gains even with a top and bottom beat. ", "score": 3, "replies": [{"body": "I got in near $27. Just keep on holding.", "score": 4, "replies": [{"body": "Hoped I could buy more on a dip, but there wasn't one. They say don't buy up when you're up, but feels like holding a ticket for American Pharaoh.\n\nAMD?", "score": 1, "replies": [{"body": "I have some AMD too but I got in way later than I should have so I've been light on it. Should have looked at it more when I was buying $NVDA", "score": 1, "replies": []}]}, {"body": "Same. Avg ~$31 now. Still holding onto the initial investment, but might sell off some this week for some biotech. ", "score": 1, "replies": []}]}]}, {"body": "Looks pretty bad now, though I think people are still gonna buy it. ", "score": 1, "replies": []}, {"body": "I try to avoid buying things in the middle of their price climbs. Could there be a bubble? Might it pop?\n\nI try to avoid risky situations these days. I can set myself back wayyyy to far, especially with not enough knowledge of the company and news.", "score": 1, "replies": []}, {"body": "NVIDIA Corporation's PT raised by Mizuho to $130.00.", "score": 1, "replies": []}, {"body": "Nope, buying right before earnings is the best time because you get in right before the big pop.  Most efficient gainz:time.", "score": -4, "replies": []}]}
{"title": "A$M$D Price Leaks in /r/AMD", "selftext": "[deleted]", "id": "5swuas", "created_utc": 1486601513.0, "score": 54, "upvote_ratio": 0.93, "num_comments": 25, "comments": [{"body": "Why the fuck did they leak before NVDA earnings, I want the cake and to eat it too", "score": 20, "replies": [{"body": "the Intel stunt from earlier?\n\n[Intel Trump love fest]\n(https://twitter.com/realDonaldTrump/status/829410107406614534)", "score": 8, "replies": []}]}, {"body": "Saw this too, was leaked way earlier in the day might be why amd held aside from nvda earnings.", "score": 7, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "I just want another dip sub 13 so i can go large and hard", "score": 10, "replies": [{"body": "Go large now so you don't miss it. Add more if it dips, you'll kick yourself if you miss the jump", "score": 2, "replies": [{"body": "Im not too worried about it if it jumps off this it will pull back closer to launch pr consolidate then its gunna either tank or sky rocket again depending on ryzen benchmarks. Also still have until q2 or q3 for financials in which will be anotber catalyst", "score": 1, "replies": []}]}]}]}]}, {"body": "just in case it disappears . . . http://archive.is/bU5vP", "score": 9, "replies": []}, {"body": "The next aapl right here. Get your yachts fellas", "score": 9, "replies": [{"body": "Already started lookin at marinas", "score": 4, "replies": []}]}, {"body": "Sooooo buy amd? ", "score": 4, "replies": []}, {"body": "I wonder if these are the legits price. Seems insane.", "score": 3, "replies": [{"body": "better fucking be because I bought 2k shares after this post", "score": 3, "replies": []}]}, {"body": "Intel is F U C K E D this year. And next. Hey Intel fags, hope those modems work out! Oh wait, your modems suck too!\n\nFeelsGoodMan", "score": 3, "replies": []}, {"body": "Wait so what is a good price haha ", "score": 2, "replies": [{"body": "People thought that AMD would price ryzen at least 500, so if its sub 400 that's insane ", "score": 13, "replies": [{"body": "honestly if it only out-performs the 6600k and 7700k by small margins then the 365 dollar price is exactly competitive. \n\nand if it doesn't outperform the 6600k and 7700k in benchmarks then gg amd i don't see myself buying it lol go fuck yourself for making shitty comp procs again amd ahahaha\n\nalso, i don't give a shit about 8 cores, the 1800x will prolly lose in single core performance benchmarks. 7700k will prolly still be better for gamin, but it won't matter because everyone bottlenecks at the lack of a good 4k graphics card these days. ", "score": 1, "replies": []}]}]}, {"body": "Fuck if this is real. Buy fucking more amd stat. ", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Skylake is 4 core. These are 8 core cpus. Performance wise, they'd be comparable to this.\n\nhttps://www.newegg.com/Product/Product.aspx?Item=N82E16819117645", "score": 10, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "Except these are actual cores not that Bulldozer crap. ", "score": 17, "replies": []}, {"body": "That's because bulldozer cores aren't actual cpu cores, they're more like alu clusters. To keep this from being too confusing,it's better to say that, basically, one bulldozer core > 1/2 actual cpu core. As for 6 cores vs 4 cores in general, that really depends on the applications. For workstations, you definitely want more cores. For games....it depends. \n\nIt used to be, cpus with more cores would perform worse in games. This isn't because adding more cores hurts the cpus ipc (instructions per cycle) or anything, it's just because more cores = more heat = higher clock speeds. But if you took, for ex, a 4 core cpu and an 8 core cpu on the same architecture, and ran them both in a game that didn't use more than 4 threads, both cpus would perform exactly the same.  \n\nNow that that's out of the way, it really depends on the game. Older games aren't well threaded, so the generally scale better with clock speeds (again, assuming the 2 cpus in question have similar ipc) than thread count.  That's not the case with newer games, though. Multicore cpus are becoming mainstream and games are starting to adjust to that. DX12 and vulcan actually scale extremely well with thread counts. but, it's better to show than to tell so, here's a comparison of a 6800k clocked at 4.3ghz and a 7700k clocked at 5ghz. Keep in mind that this is 1080p, where the cpu is going to be more of a bottleneck. \n\nhttps://youtu.be/VdVc8APD0ts\n\nSo what you're seeing is that despite Kabylake's ipc being 5% higher than broadwell's, and the 7700k being clocked at 5ghz, the 6800k is still able to keep up with it. \n\nHere's another one comparing the 6900k to the 6700k, keep in mind that they're both at stock frequencies, so the 6900k is at 3.2ghz while the 6700k is at 4.2. Despite the 1ghz difference, the 6900ok is still able to keep up with the 6700k in the games they tested in. \nhttps://www.youtube.com/watch?v=Vw5efX9zAds\n\nSaying cores don't matter in games might have been accurate a few years ago, but that isn't really the case now. ", "score": 6, "replies": [{"body": "for video games it's going to be all about that 4k gamin and right now the bottleneck is at the GPU and not CPU and nvidia is going to price gouge the fuck out of 4k cards making their stock shoot up to 200 and i wont buy their card because i am morally opposed to spending over 200 dollars on a graphics card but i'll buy their stock...\n\n\nanyways procs really don't matter as much right now, but moving forward more cores def will help", "score": 3, "replies": [{"body": "Personally, I don't see a point in 4k gaming. I like having 100+fps and right now, no gpu can do that in 4k so I prefer 1440p. \n", "score": 3, "replies": [{"body": "i just play in 1080p, 144hz works fine for me lol but cs i play at 1024 reso like it's 1996 or some wack shit", "score": 1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "This is the most recent 8 core they've made, and there's only a 5% ipc dif between Broadwell and Kabylake.", "score": 4, "replies": [{"body": "78xx and 79xx will be Skylake-E, not Kabylake based. The enthusiast platform lags behind by one generation but uses the current generation's model number (for some weird fucking reason?).", "score": 3, "replies": []}]}]}]}]}]}
{"title": "Would it be stupid of me to go all in on AMD over the next year+?", "selftext": "[deleted]", "id": "5sy8lg", "created_utc": 1486618895.0, "score": 10, "upvote_ratio": 0.77, "num_comments": 22, "comments": [{"body": "Why not just buy Jan 18 or 19 calls? ", "score": 9, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "First your asking us how to trade, now you're asking us to find the price for you as well?  Fuck man, need me to call your broker and place the order too?", "score": 21, "replies": [{"body": "Stroke his dick while you're at it", "score": 12, "replies": [{"body": "I just had a brilliant idea for a new investment company.  I need some startup cash with no hope of ROI and some people with professional level dick stroking ability.  I think I'm in the right place for both.", "score": 6, "replies": []}]}]}, {"body": "Jan 19: 12 strike premium is a little north of 5, 15 strike about 4, 20 strike a little less than 3, 25 strike around 2. Based on current IV and price, hitting $20 this year is within 1 standard deviation (if I calculated that right), so if you really believe in them I would just go long on Jan 19 calls and wait. ", "score": 3, "replies": [{"body": "Buy $2 January 18 calls and sell $12 January 18 calls. Cost you $6.80 if you fill or I'm sure $6.50 if you put the order and let it get filled. Then wait for 50% gainz", "score": 2, "replies": []}]}]}]}, {"body": "yes", "score": 15, "replies": [{"body": "No", "score": 8, "replies": [{"body": "maybe", "score": 6, "replies": [{"body": "so", "score": -1, "replies": []}]}]}]}, {"body": "It would have been smart to go all in a while back. People on this sub were nutting all over AMD when it was priced between $1.80 and $4 (and mass media / everyone else was saying GTFO if you owned it). My advice is to not go all in, lurk more, and then consider trading.", "score": 4, "replies": []}, {"body": "In 2000 a bunch of people did that and it worked out for them. I say go for it.", "score": 4, "replies": []}, {"body": "My \"portfolio\" is always limited to 1-3 stocks at a time. \n\n\nThat being said....\n\n\nThe only advice I'm giving you is if you go this route you better spend a lot of time doing a lot DD on what you plan to buy, and know when to bag hold and accept a 20% loss. \n\nBest of luck to you if you do it, post proof too ;)", "score": 3, "replies": []}, {"body": "Yes. Plz do it.", "score": 2, "replies": []}, {"body": "your kinda late to the party.", "score": 3, "replies": [{"body": "You're*", "score": 8, "replies": [{"body": "Yer.", "score": 1, "replies": []}]}, {"body": "I don't know. Intel just stated today that they were pro Trump. We see from Nordstroms being anti Trump pays off. So if people boycott Intel over this AMD is their other choice.", "score": -6, "replies": [{"body": "Ur a fuckin retard", "score": 8, "replies": []}]}]}, {"body": "It depends on how Ryzen does. If it's on-par with Intel offerings in the server space from a power efficiency/pricing perspective, then buy, buy, buy!", "score": 1, "replies": []}]}
{"title": "Why is Cramer a piece of shit?", "selftext": "[deleted]", "id": "5t0ltk", "created_utc": 1486654230.0, "score": 23, "upvote_ratio": 0.76, "num_comments": 19, "comments": [{"body": "[deleted]", "score": 29, "replies": [{"body": "[deleted]", "score": 13, "replies": [{"body": "I just named myself this because I played in middle school, and was a big part of my identity. Barely play anymore since I got to college, I wish I could do what you do", "score": 6, "replies": [{"body": "Well, you're on WSB. Time to learn a new instrument. Folks here play the skin flute. ", "score": 7, "replies": []}, {"body": "[Never too late to practice son! hehe Good ol Frank](https://www.youtube.com/watch?v=pHO-dEF_Ads)", "score": 2, "replies": [{"body": "I've always been more partial to Glen miller type jazz, but I LOVE me a good JJ Johnson as well, and there's something about Carl Fontana that just makes me feel good when I listen to him\n\nI'll definitely look this guy up, though. That's some good stuff", "score": 2, "replies": []}]}, {"body": "Selling reddit name swaps", "score": 1, "replies": []}]}, {"body": "Musicians cared about money? I thought people become musicians because they don't like money", "score": 3, "replies": [{"body": "Keep in mind where we're at. This subreddit is about passionately losing money.", "score": 4, "replies": []}]}, {"body": "Mahler 3 or ban", "score": 2, "replies": [{"body": "Mahler 3? I sold AMD yesterday after I was in @ 9.81. We be playing some Haydn's The Creation of bling bling. Some Beethoven Ode To Joy up here.", "score": 1, "replies": [{"body": "Ah, I see you have made it into Valhalla. May your trombone enjoy the sounds of the Rheingold you have earned.", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 12, "replies": [{"body": "Ew", "score": 1, "replies": []}]}, {"body": "Big house or nah", "score": 3, "replies": [{"body": "Not mansion huge, but definitely big. He lives on a street, not some secluded property. If I had to guess, his property was probably about 50 yards wide by 60ish yards deep", "score": 3, "replies": []}, {"body": "http://virtualglobetrotting.com/map/jim-cramers-house/view/google/", "score": 2, "replies": []}]}, {"body": "Cosmo Kramer lives by my house", "score": 3, "replies": []}, {"body": "Summit?", "score": 2, "replies": []}]}, {"body": "he also told people that he wasn't going to touch CXW when it was at 24 a month or two ago. now its 31. Cramer doesn't know how to money. He's the american fsc, people just watch him to jump around and yell like a  monkey.", "score": 13, "replies": [{"body": "he is a weatherman for stocks....he guesses and ignores when he was wrong and celebrates when he is right.", "score": 14, "replies": []}]}, {"body": "Cramer is show biz. He's fun to watch, but there are stats out there and... you're better off doing the opposite of what he says.", "score": 5, "replies": []}]}
{"title": "Expectations for Nvidia ER?", "selftext": "I'm expecting some good news from Nvidia. The deal with tesla especially got me rock hard for the upcoming quarters. Do you guys think we'll reach 130 tomorrow? ", "id": "5t0ne2", "created_utc": 1486654673.0, "score": 19, "upvote_ratio": 0.84, "num_comments": 23, "comments": [{"body": "It's not going up. I'm guessing it's going to stay flat or move slightly down.\n\nOptions do imply a 10% move in either direction, though, so plan accordingly. ", "score": 6, "replies": [{"body": "itl go up when they 4k video cards", "score": 2, "replies": []}, {"body": "Are you not factoring in the forecasted revenue they are going to talk about? Autonomous cars are going to to be a big thing. ", "score": 2, "replies": [{"body": "Well, people already think they will beat the bottom and top lines for this coming quarterly report. You are right, it's going to be all about how Nvidia guides. And Nvidia has always guided conservatively enough so that they always beat on earnings and revenue by a few percent, so such a scenario might happen again this quarter. \n\nRight now, price action is kind of bearish (at least over the last two or three days) so people are taking their gains in anticipation that they are not going impress enough. NVDA going down a few percentage points is not a completely remote possibility. ", "score": 6, "replies": []}]}, {"body": "If they miss earnings it's going to fall like a rock. This shit is so over hyped right now. ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "It's all about the guidance though. Unless they beat massively (IMO last quarter was just a one-time fluke) this will stay flat or even go down. ", "score": 7, "replies": [{"body": "[deleted]", "score": 9, "replies": [{"body": "What do you have riding on earnings?", "score": 3, "replies": [{"body": "10k in that Sexy babe", "score": 4, "replies": [{"body": "Same baby, 81 shares at $52.50 back in july.\n\nThe NVDA train has no brakes", "score": 2, "replies": []}]}]}, {"body": "This guy fucks ", "score": 8, "replies": []}]}]}]}, {"body": "Unless they beat expectations by ALOT i think this goes down to 115 and stays flatish", "score": 9, "replies": [{"body": "Do you think the 970 lawsuit settlement will impact their quarterly earnings at all? They have to pay $30 to everyone who purchased the GeForce GTX 970 GPU.  I don't hear it talked about very much outside of PC gaming sites.", "score": 5, "replies": [{"body": "People already know about that for ages now.", "score": 10, "replies": [{"body": "Doesn't mean it won't effect earnings or sentiment.  The stock market doesn't move base on facts, it moves based on idiots making stupid decisions.", "score": 2, "replies": []}, {"body": "When did they start paying out the settlement money?", "score": -1, "replies": []}]}, {"body": "I own a 970! Where do I sign up for my money?", "score": 3, "replies": [{"body": "https://www.gtx970settlement.com/Home.aspx\n\n", "score": 2, "replies": [{"body": "Neat! \n\nEdit: claims deadline ended. ðŸ™", "score": 2, "replies": []}]}]}, {"body": "People always say things are priced in but I believe these kind of things get priced in when they are announced, now of it causes them to miss expectations (doubtful) then i could see them dropping", "score": 1, "replies": []}]}]}, {"body": "[this is my play for tonight](http://i.imgur.com/lvCa7G7.jpg)\n\n\nTomorrow at open I'm buying a shit ton of calls/puts based on earnings.\n\n", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "35 here, yolo", "score": 1, "replies": []}]}, {"body": "Bag holding 450 shares here God speed \n\nwww.imgur.com/fPzq9Jq ", "score": 1, "replies": []}]}
{"title": "TIFU How should I tell my wife I lost all of our savings?", "selftext": "When I yolo'd all our money on Apple puts by accident and now almost $40,000 is gone from our savings and now we can't afford the home we were going to buy. Every month for the past 2 years I have made some simple investments with no issues at all. Today (well last week) I went to buy some calls and I clicked puts instead. I did not even know I did that until I was checking my bank records and moving some money from one account to another. I called the bank that has my brokerage account and I was told that I agreed to the terms when I submitted the trade. While they agree that it's wrong that they can't give me back my money but they have rules to follow as well. Now the hard part, I have to tell my wife that it's all gone. On one hand I could probably buy a nice furry suit (and mask) but on the other hand we're now broke. I have such a sinking feeling and lost my hope for the future. I really screwed this one up. I know my wife is understanding and there won't be any kind of a yelling match going on but I know she is going to be really bummed out. It took a few years to save the money and now we are back to square one. I have made many mistakes in my life and some were financial mistakes but this one is the grand daddy of all mistakes. I'm really lost.... TL;DR How do I tell my wife all our money is gone and we can no longer buy a home..", "id": "5t1sj8", "created_utc": 1486664743.0, "score": 2, "upvote_ratio": 0.51, "num_comments": 23, "comments": [{"body": "GTFO re-posting piece of karma whore. ", "score": 32, "replies": [{"body": "I edited it you fuck boy", "score": 7, "replies": [{"body": "Wow, what a twist. ", "score": 7, "replies": []}]}]}, {"body": "proof or ban", "score": 10, "replies": []}, {"body": "Nice shitpost. ", "score": 8, "replies": []}, {"body": "Dont tell her, make a yolo call on $GILD and get the money back", "score": 6, "replies": []}, {"body": "She'll know when she sees the blood everywhere and your lifeless corpse on the recliner.", "score": 9, "replies": []}, {"body": "At least in this (fake) circumstance you actually fucked up. Accidentally paying off a high interest debt is like accidentally being a responsible adult. \n\nWhich is probably the only way I'll ever be one. ", "score": 3, "replies": [{"body": "Yeah that was the least TIFU of all time. Today I made a 100% ROI. Aren't I dumb?!?!", "score": 1, "replies": [{"body": "I think a 0% roi is seeing your money back, but because of interest his roi is whatever he would have paid in interest. So a 7% guaranteed roi (assuming since he said \"high interest\"). \n\nGuaranteed. He just beat what a lot of investors hope for without any risk. \n\nIt's not a fuck up unless there's actual value lost. If I break even on a stock I don't think I fucked up. And this fucker got 7%+. ", "score": 1, "replies": [{"body": "Good assessment, yeah I probably stated that wrong. But we both agree lol.", "score": 2, "replies": []}]}]}]}, {"body": "Admit it, you're lying to yourself. You intended to buy puts, bought puts, and now living a lie to cover up the responsibility.", "score": 5, "replies": []}, {"body": "How do you trade 40k and dont check if you bought puts or calls? Why did you buy otm with that amount?\n\nIf your story is real, it must really suck... could have had that Yacht with calls.\n\nBetter risk management next time and you might get your money back with slower trades.", "score": 4, "replies": [{"body": "YOU GOT ME BITCH", "score": 1, "replies": []}]}, {"body": "Since this is WSB do this.\n\nDon't tell her and instead max out your credit cards or get a line of credit from the bank (or both) and then put it all on the line with some July $12 AMD calls.\n\nor, take the safe route and just quit eating out and save up and you will get there eventually.", "score": 2, "replies": []}, {"body": "ask /u/blackdowney", "score": 1, "replies": [{"body": "Ask /u/theycallme1 ", "score": 1, "replies": []}]}, {"body": "I didnt even know what i was doing until i payed off all my wifes debt. How can i tell her without her getting upset? :( ", "score": 1, "replies": []}, {"body": "you no longer have to when she dumps you eventually and divorces your ass . . . ", "score": 1, "replies": []}, {"body": "Proof? ", "score": 1, "replies": []}]}
{"title": "$AMD", "selftext": "[deleted]", "id": "5t2ce6", "created_utc": 1486669754.0, "score": 39, "upvote_ratio": 0.84, "num_comments": 22, "comments": [{"body": "WELCOME TO AMD MONEY WITH JIM CRAMER", "score": 18, "replies": []}, {"body": "So what type of yachts you fags buying when this hits the moon tomorrow?", "score": 10, "replies": [{"body": "I'm in the red 2.46% with this today, so I'm hoping for something better tomorrow.", "score": 11, "replies": []}, {"body": "This was already out yesterday, not much impact", "score": 5, "replies": [{"body": ">implying AMD follows the laws of time and space", "score": 16, "replies": []}]}, {"body": "Why do you think it'll hit the moon tomorrow? ", "score": 1, "replies": [{"body": "It takes investors at least a day to realize it when [Intel shits the bed](http://www.cnbc.com/2017/02/09/intel-intc-warns-lower-data-center-profit-margins.html).", "score": 3, "replies": []}]}]}, {"body": "Filled at 13.5 today...let's see where this puppy goes.", "score": 4, "replies": [{"body": "I joined at 13.44, and it's still falling. dammit.", "score": 2, "replies": [{"body": "I'm confident though it with ryze with the launch of Ryzen here. Hang on. ", "score": 1, "replies": [{"body": "Looks like we made some money today. Still haven't gotten my commission fee paid back, but we'll see.", "score": 1, "replies": [{"body": "There's always tomorrow. ", "score": 1, "replies": []}]}]}, {"body": "Any close in the green is good enough for me. Big things to come!", "score": 1, "replies": []}]}, {"body": "You and me both. Let's ride this like the titanic. ", "score": 1, "replies": []}]}, {"body": "Hype creates bubbles but I love AMD. I'm just afraid of too much hype causing a mass reaction of selling when something doesn't go the right way.", "score": 9, "replies": [{"body": "If nvda has bad report after hours and the hype train keeps running on these > $500 processors I see this hitting 14 a share tmrw", "score": 7, "replies": [{"body": "maybe... other way around. if nvda doesnt impress (and its not, as of writing, down %2 ah), folks will move profit from nvda into amd. at least i would.", "score": 5, "replies": []}]}]}, {"body": "I would hereby like to request flair relating to the massive sack of AMD I'm holding. Mods can check my post history for proof. If anything, I'm only going to add more to my position in the future.", "score": 4, "replies": [{"body": "I propose \"diddles his penis to Lisa Su\"", "score": 2, "replies": [{"body": "Sounds as good as any other ", "score": 1, "replies": []}]}]}, {"body": "LETS GOOOOOOOOOO", "score": 2, "replies": []}, {"body": "2018 calls gonna be $$$$$$", "score": 1, "replies": []}]}
{"title": "NVDA EARNINGS THREAD", "selftext": "Crybabies welcome", "id": "5t2xds", "created_utc": 1486675388.0, "score": 26, "upvote_ratio": 0.75, "num_comments": 27, "comments": [{"body": "Well tickle my balls and call me edward, only god can control this stock", "score": 9, "replies": [{"body": "Edward!", "score": 14, "replies": [{"body": "....what about the other part of the arrangement", "score": 3, "replies": [{"body": "Taken care of", "score": 6, "replies": []}]}]}]}, {"body": "I lost 12% of my portfolio because of fucking jaynug and was walking back to class, defeated. Thought about quitting.\n\nThen I saw NVDA drop to 109, snagged it. Plz YOLOGOD save meeeeeee \n\nEdit: http://m.imgur.com/hwqgUye  ", "score": 8, "replies": [{"body": "3hunnid nice pick up for a stroll ($NVDA-116)", "score": 3, "replies": []}]}, {"body": "Why did this sink like a rock? Da fuq", "score": 14, "replies": [{"body": "Coming back up in the afterhours... But dunno what the reaction will be like tomorrow. ", "score": 7, "replies": [{"body": "I think it will open in the green tomorrow.", "score": 2, "replies": [{"body": "#It is green in after hours. Up almost $1.", "score": 2, "replies": [{"body": "Not anymore, shit", "score": 1, "replies": [{"body": "Closed my positions. Preserving capital with that one. I have limited patience, even though my expiries were March3.", "score": 1, "replies": []}]}]}]}, {"body": "Seems like the trigger happy algos caused the dip. Then again I didn't read the earnings report. ", "score": -1, "replies": [{"body": "They beat both top and bottom line by a few percentage points. We'll need to see guidance first but methinks this will be slightly down but overall flatish tomorrow. ", "score": 3, "replies": [{"body": "This is what I'm thinking will happen. We'll see relatively flat price action tomorrow and my calls will be worthless.  ", "score": 2, "replies": []}]}, {"body": "Woulda been sick to get in on that 106 dip. ", "score": 2, "replies": []}]}]}, {"body": "Sank before announcement. Looks to actually be up post-announce. ", "score": 3, "replies": []}]}, {"body": "naw, this was good news.  wait for cc\n\nand why can't i ever stick my plans:\n\n>yup i might set a limit buy at 105 just to catch retard algos on a beat.  and if it's a miss, oh well i'm down 5% max on the hottest stock of 2016 for a week until i break even \n\n>edit:  maybe i'll spread it out in thirds at 105, 110, and 115\n\ni ended up getting in SOXL and NVDA intraday thinking this plan sucked since all my plans always suck ", "score": 3, "replies": []}, {"body": "what's the theory on citron?\n\nseems like they announced short positions so they could cover in the low 100's after probably fucking up in the 90's", "score": 3, "replies": [{"body": "Citron gave up on their short position (and the flawed thesis on which it was premised) like 3 weeks ago.", "score": 2, "replies": []}]}, {"body": "ITS COMING BACK BABY\n\nE: DAMN", "score": 2, "replies": [{"body": "What?!", "score": 1, "replies": [{"body": "I have it bouncing from -0.45% down to green. Tomorrow will be interesting.", "score": 2, "replies": []}, {"body": "Like /u/MRPguy said, it bounced back up to almost green but has now dropped again. ", "score": 1, "replies": [{"body": "Green again.", "score": 1, "replies": []}]}]}]}, {"body": "\"$NVDA beats the Estimize EPS Consensus by 24c and the Estimize Revenue Consensus by $35.79M\"", "score": 2, "replies": []}, {"body": "Guys, [it's a wrap](http://m.nasdaq.com/article/earnings-reaction-history-nvidia-corp-800-follow-through-indicator-97-sensitive-cm745753). According to that article 100% of the time NVDA drops during AH after earnings, it drops an extra 6%. This happens 100% of the time. Gotta love authors that draw conclusions with sample sizes of one. ", "score": 1, "replies": []}]}
{"title": "Let this be a lesson to you all", "selftext": "Never buy an overhyped stock pre earnings, it almost always drops. The proper time to buy NVDA was after AMD earnings, it went up around 6%. In other words, its earnings was already PRICED IN.", "id": "5t2zte", "created_utc": 1486676013.0, "score": 0, "upvote_ratio": 0.28, "num_comments": 24, "comments": [{"body": "there it is\n\ni was waiting for rear admiral hindsight's input\n\nthank you", "score": 40, "replies": [{"body": "I almost gave up on humanity until i found captain hindsight, now the world is full of flowers and tits.", "score": 12, "replies": []}]}, {"body": "Tell that to the people who played AMD earnings and won, faggot", "score": 20, "replies": []}, {"body": "Fuck you it's down $.40 now", "score": 6, "replies": []}, {"body": "nvda about to go green. \n\nhow many millions u got in the bank since your advice almost always works?", "score": 6, "replies": []}, {"body": "It's already back up you turd\nAnd now down rip ", "score": 4, "replies": []}, {"body": "Eh I'm just sick of people here thinking that EPS is the only number that matters.  So much \"they beat EPS, why are they going down?!\"", "score": 2, "replies": [{"body": "In the case of NVDA expectations were already so high that it was priced in a week in advance already. ", "score": 5, "replies": [{"body": "I don't remember anyone saying that this morning", "score": 5, "replies": []}]}, {"body": "They beat eps, q4 revenue and q1 guidance. They beat on every metric the only problem is no one is surprised. ", "score": 4, "replies": [{"body": "revenue beat was too small", "score": 1, "replies": [{"body": "See above - this isn't AMZN, champ.  No one gives a shit how much cheap revenue NVDA can bring in the door.  It's called pricing discipline.  As long as NVDA keeps running 60% profit margins, they can skate by on revenue every single quarter for all I care.  \n\nA 60% profit margin is what allows companies like NVDA to outlast and outgrow their competitors (like AMD), which couldn't post a 60% profit margin in their wildest fucking fantasies.", "score": 1, "replies": []}]}]}, {"body": "Yeah, buddy, we all know that EPS is not the ONLY financial metric in the universe.  But it's sure as fuck the most important one.  This isn't AMZN - no one gives a shit about how much low margin revenue you bought in the door.  Grow up, Peter Pan.", "score": 1, "replies": []}]}, {"body": "The proper time to buy NVDA was a year ago. Pretty much anytime after that has been exceptionally risky, no matter if it's continued to go up or not.", "score": 2, "replies": []}, {"body": "Look at this faggot who was trying to use a legit tech stock as a pump and dump. Some of us are looking for real gains in the long term. If you're looking to make your daily pennies go back to JNUG/JDST UGAZ/DGAZ speculation.", "score": 3, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "1v1 me on my yacht in 5 yrs. ", "score": 2, "replies": []}]}]}, {"body": "Haha. It's bouncing from green to -0.45% after hours now, so let's see what happens, shall we?", "score": 1, "replies": []}, {"body": "Yeah but what if it didn't drop?", "score": 1, "replies": []}, {"body": "#Wow. Massive 1% drop. Whatever will we do. Those who bought calls that expire tomorrow should have been wiser.", "score": 1, "replies": [{"body": "I almost forgot to shit my pants over this cataclysmic drop.", "score": 1, "replies": []}]}, {"body": "Don't be a dipshit.  The proper time to buy was mid-2015.  You aren't teaching anyone a \"lesson\" here.  Just wanted to make sure you knew that your post was not insightful in any way.  What lessons are you going to teach us next?  Buy low, sell high.  Carry an umbrella in the rain.\n\nYou're just embarrassing yourself.", "score": 1, "replies": []}, {"body": "NVDA now up in after-hours.  Any other lessons you want to teach us, Professor Ass-Hat?", "score": 1, "replies": []}, {"body": "why didn't you post this earlier? Thanks captain hindsight", "score": 1, "replies": []}, {"body": "Something something post before earnings not after like a raging faggot.", "score": 1, "replies": []}]}
{"title": "NFLX puts because of mass Trump supporter cancellations? I'm guessing earnings will miss because of Dear White People. Thoughts?", "selftext": "", "id": "5t33vr", "created_utc": 1486677083.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 21, "comments": [{"body": "People will cancel from outrage and sign back up due to boredom. ", "score": 11, "replies": []}, {"body": "i sincerly doubt it will matter.", "score": 2, "replies": []}, {"body": "Buy calls everyone buying puts. Inverse WSB.", "score": 2, "replies": []}, {"body": "Did the shit storm start during the previous Q, or after the fact. \n\n\nI'm a white racist male republican.. I have netflix because I like to watch documentaries. I don't really give a shit about their political views blah blah", "score": 6, "replies": [{"body": ">white racist male republican\n\nSoo redundant ", "score": 9, "replies": [{"body": "Icwutudidthere", "score": 1, "replies": []}]}, {"body": "it started a month or two ago when netflix ceo came out saying trump's presidency is going to be bad for america\n\nso netflix has already lost a couple subs for Q4 ER", "score": 2, "replies": [{"body": "Ah.  Now how many actually cancelled and didn't take the \"free month\" offer.  ", "score": 3, "replies": [{"body": "this is why racists win", "score": 1, "replies": [{"body": "I like winning. ", "score": 2, "replies": [{"body": "If you ain't first, you're last", "score": 1, "replies": []}]}]}]}]}, {"body": "Subscriber numbers are at record highs. There is no shit storm.", "score": 2, "replies": []}]}, {"body": "Stranger Things is my shit. I ain't canceling. IDGAF if some trump dick riders get all offended by some faggot PC show that probably won't last two seasons. ", "score": 3, "replies": [{"body": "This ^  \n  \nLet 'em have their 'tard show for smarmy laughs.  \nIf we demand censorship the t'rrorist win.", "score": 1, "replies": []}]}, {"body": "There are less die-hard Trump supporters then you think. Most people are not going to cancel their subscriptions because of this shit. However Netflix streaming library sucks dick rn imo, so I guess we will have to see", "score": 1, "replies": []}, {"body": "agreed, and before more is covered about it is when you should pull the trigger.  THE_DON is cancelling subs, the preview on youtube is massively disliked, roughly 3k:48k last i checked yesterday\n\nsubscription growth should start slowing more significantly than previously projected", "score": 1, "replies": [{"body": "Isn't all significance psychological?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}]}, {"body": "Do you think Trump supporters are just as retarded as the libs and going to burn bridges and throw fecies at a company they liked because of a show they supported?\n\nNetflix has very ambitious growth goals. I'm keeping them.", "score": 0, "replies": [{"body": "I'm a Trump supporter but I'm not cancelling my Netflix subscription. I've seen more detractions from Netflix today than I saw from the Starbucks boycott last week. I figure sub growth might slow, to some extent", "score": 1, "replies": [{"body": "I voted for daddy too, and I'll be watching me some 'flix tonight. Fuck the haters, I'll take the stock discount. Netflix will grow without them and the underlying product is fantastic.", "score": 1, "replies": []}]}]}]}
