{"title": "Things I wish I knew before I started jnvesting", "selftext": "I’m still a new investor and I want to give some advice to new investors too about things I wish someone told me. If y’all have any other advice let me hear it.\n1. Don’t panic sell- just because a stock has a bad day don’t panic sell and lose your money. If you truly believe in your stock, it will go back up.\n\n2. Starting out invest in ETF’s- this is probably the thing I wish I could’ve been told. ETF’s are like and mutual fund but you can buy it anytime during the day. They r a safe way to consistently make money. They won’t lose you money(if you pick a good one) in the long run. \n\n3. Don’t buy a stock because someone said to- I have fallen victim to “hype” stocks that I think will be the next GME, but ultimately fall 50%. I’m down about 20% in my portfolio because I bought into stocks that are sketchy.\n\n4. Stay away from options- some new investors may not know what it is and it should stay that way. It is the equivalent of gambling. \n\n5.crypto- crypto is very volatile and u could lose your whole investment in a day. I wouldn’t say you shouldn’t invest in crypto, but be smart. Also don’t buy DOGE it’s literally a meme.\n\n6. Don’t invest money that your aren’t prepared to lose- the stock market is unpredictable sometimes. A new pandemic could occur or a world war could breakout or another Great Depression could happen. We don’t know when or how, but the market could crash at any time, so don’t invest money that you aren’t prepared to lose. \n\nHopefully this will help someone:)", "id": "nj9xar", "created_utc": 1621783441.0, "score": 152, "upvote_ratio": 0.85, "num_comments": 58, "comments": [{"body": "Make a plan, and stick to it!", "score": 32, "replies": [{"body": "yes, this. When I took over my account after my father passed away, I thought I had a plan, but I kept changing the plan. It's a good idea to do some paper trading for a while as you develop your plan so that when you finally do start actually investing real money, you aren't changing your plan when real money is involved. My father taught me everything he knew and I was a bit cocky when I started. I wish he had made me do some paper trading while he was teaching me.", "score": 11, "replies": []}]}, {"body": "Go all in on a shitcoin, got it.", "score": 23, "replies": []}, {"body": "If you are feeling euphoric, consider derisking some profits into cash. If you are feeling scared, start putting money into solid investments. So much money to be had if you can inverse your emotions.", "score": 16, "replies": []}, {"body": "\"If you truly believe in your stock, it will go back up.\"\n\nI'd edit out that line. Wall Street--and life--is littered with broken dreams.", "score": 14, "replies": [{"body": "This.", "score": 2, "replies": []}]}, {"body": "What I wish I could tell my former self: investing takes time. It is not about making a quick buck.", "score": 9, "replies": []}, {"body": "“Investing” mindset vs “trading” mindset should sort a bunch of these points out friend. Closely followed by having a plan (or at least a loose framework) that you are acting on.\n\nETFs aren’t safe necessarily and options aren’t gambling..\n\nIf you’re building a wood house vs a concrete house takes different plans and tools. Same with the markets. How you’re going to build a retirement account, is different than a trading account which is different than a passive income account. There is no one size fits all from my experience.", "score": 8, "replies": []}, {"body": "Or alternatively do whatever the fuck you want to do with your money. But remember it’s your responsibility, no one elses", "score": 7, "replies": []}, {"body": "Options are definitely not for beginners. However to say they are like gambling is not true. If you understand how to use them effectively they can reduce risk in your portfolio as well as generate consistent returns throughout the year.", "score": 13, "replies": [{"body": "Yeah I was directing this towards newbies tho. Later with more experience it wouldn’t be a bad idea", "score": 9, "replies": []}]}, {"body": "Options can work with Etfs as they are less likely to see volatility assuming you have enough time on them. Buying Leaps in SPY, IWM, or QQQ can multiply your returns with less risk as the funds are well diversified.", "score": 4, "replies": []}, {"body": "Nice", "score": 3, "replies": []}, {"body": "I think another point is to \"stick with what you know\". If you've followed certain companies (or even entire industries) closely (either professionally or as a hobby / personal interest), you know all the ins & outs, the good & the bad... So you're already ahead of the curve...\n\nJumping in some other industry that you know absolutely nothing about is just asking to get your ass kicked. Learn it first instead of just slapping down some money because FOMO.", "score": 3, "replies": []}, {"body": "#1. How to spell “investing”", "score": 3, "replies": [{"body": "Lol u r the first person to bring that up", "score": 1, "replies": []}]}, {"body": "keep some $ on the side to bail\nyourself out/ avg down", "score": 5, "replies": [{"body": "I agree. Just because a stock drops doesn’t mean it’s a bad buy.  You should use the opportunity to dollar cost average and if you don’t have any capital left on the side you won’t be able to.", "score": 2, "replies": []}]}, {"body": "Thanks for the advice. I just started and i put 70% of my money into VTI and the rest into stocks I find interesting like DIS, AMD, TTCF, NIO", "score": 2, "replies": [{"body": "I’m in NIO too hopefully EV’s make a rebound the second half of this year", "score": 0, "replies": [{"body": "I bought at 33 I’m pretty hopeful", "score": 1, "replies": [{"body": "Wow lucky you. I bought in February😭", "score": 1, "replies": []}]}]}, {"body": "#TTCF", "score": 1, "replies": []}]}, {"body": "\"don't buy doge\"\n\"don't buy bitcoin \n\"don't by ethereum\"\n\nk", "score": 2, "replies": []}, {"body": "Number 1---- Never, ever get emotionally involved with a stock...  Watch it, follow it's moves, get in low, sell higher.   Day trade, swing trade.   Unless you are looking for dividends.. 3M, etc. I stay in energy because Biden is prez, and he will fuck things up in this arena.   Thank you old man, demented Prez.    I don't short, too risky!", "score": 2, "replies": []}, {"body": ">Stay away from options- some new investors may not know what it is and it should stay that way. It is the equivalent of gambling.\n\nWell, I say learn about covered calls.  It's a great way to make a little extra money on the degenerate gamblers.  Somebody will, why not you?\n\nMy only advice about crypto is to not go all-in on it.  Also, I wouldn't take anything other than bitcoin too seriously as a long-term investment.", "score": 2, "replies": [{"body": "I think ethereum is long term too and in the future polka dot and cordano too", "score": 1, "replies": []}]}, {"body": "+the only stock worth buying is $GME.", "score": 8, "replies": [{"body": "And if one uses their rent money, they will now have enough to throw a party.", "score": 5, "replies": []}, {"body": "This is the way", "score": 1, "replies": []}]}, {"body": "\\#4-a  I second that. The strong opinionated recommendations often come with a motivation. They often do the same at each site or sub. Be aware of their motivation and check their karma credential and award points.", "score": 2, "replies": [{"body": "Pump and dumps come in various shapes and sizes. My first hard lesson in the market 5ish years ago. It’s more than just on Reddit from my experiences.", "score": 3, "replies": [{"body": "The P&D is strong on twitter.", "score": 2, "replies": []}, {"body": "Many so called DDs try to overwhelme you with sales, data, upside potential. Professionally done. They come to this site down vote your opinion hard to force others to agree. They often blasted most at peak price time and disappear after market tanked.  One stock I bag hold was from a lending new stock.  The precise timing looks suspicious. I wonder some hedge fund companies are involved.", "score": 1, "replies": []}]}]}, {"body": "Use your judgement and anlysis and do not get pressured into something you have doubts. If it does not right trust you own judgement.", "score": 1, "replies": []}, {"body": "Doubled down on #5 I like it", "score": 0, "replies": []}, {"body": "You couldn’t be more wrong about #1 and #2. Re read your #6 rule and reconsider your first two. \n\nA depression isn’t likely, but like you said, possible. In that scenario your money would depreciate and possibly not recover for years, if ever.\n\nBelieve in what you buy but don’t get emotionally tied to it. Set stop losses so you know your worst case scenario if something unexpected happens.", "score": 0, "replies": [{"body": "I would say they r contradicting. All I’m saying is if u have a bad day or couple bad days you shouldn’t freak out. And why wouldn’t you want to start out with and ETF is rlly safe?", "score": 3, "replies": [{"body": "Depends on the ETF. They are all subject to the market risk you describe in #6. \n\nIndividually they all have their own risks too. Everyone saw SPAK as virtually risk free when it was introduced. I agree ETFs are a good option to invest in sectors and avoid individual company risk, but I wouldn’t say that broadly “they won’t lose you money”.", "score": 1, "replies": [{"body": "The long term growth for a good etf is positive. In short term you might lose money bud I’m just talking long term. I probably should’ve specified that", "score": 4, "replies": [{"body": "Long term too. There is no risk-free investment. This bull market just makes people believe that’s the case.", "score": -1, "replies": []}]}, {"body": "Why/who in the world thought the etf SPAK was risk free?? Its literally only spac's the ultimate crap shoot i really can't imagine any person thought that didn't come with high risk.", "score": 1, "replies": [{"body": "I think some people saw SPACs at $10 IPOs as risk free with only upside potential. A basket of them would take advantage of that upside without the research or guesswork. I don’t agree with it, obviously many SPACs will fail in time.", "score": 1, "replies": []}]}]}, {"body": "I know what you mean on #1. I see way too many people who buy a stock and after a week, they sell it because it's going down. It depends on the stock. If you do your research right and invest in a reputable company, that stock should come back up. But if it's just some fly by night thing (like a deli in NJ) you might want to get rid of that.", "score": 1, "replies": [{"body": "Lol yeah I bought a chinese blockchain that mines dogecoin. That should be enough info to know how that went", "score": 1, "replies": [{"body": "bummer", "score": 2, "replies": []}]}]}, {"body": "You should've given examples of 'safe' commonly referred to etfs(spy, vti, schx etc.), not all etfs are safe and some are very sector specific.", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": -8, "replies": [{"body": "Idk about right now bc it’s extremely volatile and it could drop even more but in the near future I would", "score": 5, "replies": []}]}, {"body": "Whew! Good thing I'm investing!", "score": 1, "replies": []}, {"body": "Also, understand the tax implications of selling stock: LTCG vs. STCG, Wash sales, tax loss harvesting, etc. That alone can save you some big money.", "score": 1, "replies": []}, {"body": "My biggest takeaway through five months is risk management is key. Good risk management allows you to kinda learn on the job.", "score": 1, "replies": []}, {"body": "Are there any recommended resources for beginners? Like what to look for in company when buying, key indicators you should sell, etc.", "score": 1, "replies": []}, {"body": "“Don’t buy Doge” not the way sir!\nEveryone tries to make a few bucks but not to get rich within a week. \nMy advice to everyone is before putting money in the market, you should first understand the basics of how the market works. Always start small don’t get tempted small steps can take you far.\nI like Doge", "score": 1, "replies": []}, {"body": "Good advice. Always define your investing objectives and keep with them.", "score": 1, "replies": []}, {"body": "you will get killed when you first start, you will earn up is down, left if right, nothing you do will make sense.", "score": 1, "replies": []}, {"body": "You forgot to add “how to spell” on the list!", "score": 1, "replies": [{"body": "Man cut me some slack in typing with one hand😭", "score": 1, "replies": []}]}, {"body": "Hey there, are you a young aspiring investor looking to get experience and knowledge around the stock market? I have an eBook that will give you key fundamental building blocks on your way to becoming a confident investor, interested? \n\nthe eBook is available here ✅\nhttps://gumroad/l/investingearlyebook", "score": 1, "replies": []}]}
{"title": "We shouldn't be worrying about inflation. Instead, we should be worrying about deflation", "selftext": "Before you jump to conclusions, and say \"OP, you're retarded\", I behold to you the DJI/GME ratio:\n\nhttps://preview.redd.it/qa1e6ke91y071.png?width=1482&format=png&auto=webp&s=a294f7df1b76278df88b4a6311188d306f668612\n\nI called out the clear bubble of the Dow Jones Index last month, and all people could say was \"uSe A lOg grapH\" or \"Compare it to gold\". Well I did one better, I compared it to GME. People have always called GME the \"new gold\", and I think it's only fair to view it in the same light. The findings are scary. As you can see above, the ratio follows very close to that of inflation. It then slows late 2019. This can probably be blamed on the Fed saying they were wrong, according to the Guardian. From here, it only gets worse. Covid dropped numbers significantly (No surprise), but the ratio is yet to recover. I don't know how tf you're supposed to deal with deflation, but stop ignoring the signs people. This is a log graph. Now there's nothing to hide.", "id": "njiptu", "created_utc": 1621808039.0, "score": 116, "upvote_ratio": 0.76, "num_comments": 66, "comments": [{"body": "I’ve been a lumberjack my whole life. I don’t even see one log in that graph you retard.", "score": 156, "replies": [{"body": "This one's on me. I didn't know what log to use, so I panicked and left it out altogether.", "score": 42, "replies": [{"body": "Use the ones in the toilet after eating a Wendy’s spicy chicken sandwich", "score": 15, "replies": []}]}, {"body": "Yo, can I get me some of those overpriced 2x4s tho?", "score": 8, "replies": [{"body": "Hah no seriously those prices are insane", "score": 3, "replies": []}]}, {"body": "I've cut trees for the last 10 years or better, residential not logging. We had emerald ash borer that wiped out all the ash trees and people would literally beg us to cut them 10 years ago. Now there are only maples left that have a similar bug that kills them. But there are probably more tree companies and equipment than I've ever seen in my life here, just with this coronavirus...\n\nEquipment is more expensive than I've ever seen. \n\nI'm cutting trees for sometimes better money but most of the time probably less money.\n\nWhy not both...", "score": 4, "replies": []}, {"body": "I too sleep all night and work all day", "score": 3, "replies": []}, {"body": "I never thought of a log joke like that one. This one is for sure going to my math repertoir of catchy puns and one-liners.", "score": 1, "replies": []}]}, {"body": "#im concerned about this too. my nuts always deflate after blowing a load", "score": 50, "replies": [{"body": "My 23 year old friend has a huge ego and high blood pressure. He could use a  little deflation.", "score": 7, "replies": []}]}, {"body": "Cathy Wood’s Reddit account finally exposed.", "score": 31, "replies": [{"body": "I'm not Cathy Woods. I'm just another random redditor.\n\nOn another note, do you know the best way to protect against inflation? Ark ETFs. The higher the fee, the stronger the protection", "score": 6, "replies": [{"body": "“I am not the droid you’re looking for”", "score": 1, "replies": []}]}, {"body": "She makes me hard.", "score": 2, "replies": []}]}, {"body": "I think I need to worry about my physical health because ya’ll be jumping around with new theories so much I’m getting whiplash", "score": 17, "replies": []}, {"body": "I think its funny you think we’d understand any of that😂", "score": 36, "replies": [{"body": "this is a shitpost", "score": 22, "replies": [{"body": "Still doesn’t mean I understand it though😂", "score": 3, "replies": [{"body": "So buy more GME?", "score": 19, "replies": []}]}]}]}, {"body": "\\-makes shitpost\n\n\\-doesn't elaborate\n\n\\-![gif](emote|free_emotes_pack|sunglasses)", "score": 20, "replies": []}, {"body": "finally an ounce of reason on this subject", "score": 10, "replies": []}, {"body": "If $GME is the new gold and if we are going to get deflation, wouldn't GME tank?", "score": 5, "replies": []}, {"body": "I just hope this is a shitpost. \n\nLmao we are not in a period of deflation.", "score": 7, "replies": [{"body": "The charts don't lie. They never do", "score": 7, "replies": [{"body": "You havent gone grocery shopping?", "score": 1, "replies": [{"body": "Not yet. You need something?", "score": 7, "replies": []}]}]}]}, {"body": "[removed]", "score": 4, "replies": []}, {"body": "We should be prepared to take advantage of the secular bull market we're in.", "score": 3, "replies": []}, {"body": "We should be worried about the state of this sub", "score": 3, "replies": []}, {"body": "Debt deflation. Happened in 08. Will happen this time as well. \n\nhttps://www.investopedia.com/terms/d/debtdeflation.asp", "score": 3, "replies": []}, {"body": "OP, you’re retarded", "score": 3, "replies": []}, {"body": "Inflation bad.  Deflation way worse. \n\nEdit: there are few of any ways to deal with deflation effectively. I do not see any signs of deflation though. What exactly is causing you to suggest deflation?", "score": 6, "replies": [{"body": "It's a shitpost but honestly it's not such a crazy thing to see deflation next if this inflation is actually transitory.\n\nIf supply ramps up and starts to meet demand again but demand drops bc of other factors (unsustainable wage growth, helicopter money, economic slowdown) whatever, major world factors, it's not impossible. Bond markets are not pricing in inflation and we'll see what happens with interest rates and taxes.", "score": 4, "replies": [{"body": "Totally missed the flair. Thx", "score": 2, "replies": []}]}]}, {"body": "Who uses log charts...? Although you're not wrong. If you add a wrinkle to your brain and use a semi-log graph and superimpose the dollar value onto the GME you'll find that the fed are going to anounce that $1=$7.30 on 20th September at 2:14pm.", "score": 6, "replies": [{"body": "I’ve been looking for this info day and night for weeks.  I haven’t slept for at least 84 hours but now that we finally know, I think I’ll allow myself a quick nap.\n\nEdit1: Oh God, you left out the year!  WHAT YEAR?", "score": 6, "replies": [{"body": "Every year.\n\n$1=$7.30\n\nBy 2031 $1 will equal $429,762,582.97036 in today's terms.", "score": 8, "replies": []}]}]}, {"body": "Wb reflation, stagflation ??", "score": 2, "replies": []}, {"body": "but deflation = lower prices, and lower prices = more gme per dollar, how is bad", "score": 2, "replies": []}, {"body": "I personally think the fed authorized naked shorting after 08.  In kind of a wink wink deal with hedge funds.  Think about it, dilution of everything from stocks to gold certificates.  They could literally print all they wanted and if those assets were getting diluted then there’d be no proof of inflation.  The hedge funds just got to greedy.  Explains why they never really raised interest rates in the last 10 years and golds only gone up 150$ an oz since 11 while the fed printed twice the money that was ever in existence since then.", "score": 3, "replies": []}, {"body": "I’ve always been under the influence that negative interest rates/deflation would benefit growth and tech stocks. It would most likely hurt cyclicals the most, but cyclicals have a chance to take off in a deflationary environment IMO because they can start to refinance their loans at lower interest rates.", "score": 2, "replies": [{"body": "Edit. Deleted my comment. Just leave it at deflation can be very bad. Google it.", "score": 2, "replies": []}]}, {"body": "Said this to my ex girlfriend the day after she got her boobs done", "score": 1, "replies": []}, {"body": "Stonks?", "score": 0, "replies": []}, {"body": "DOES ANYONE KNOW THE PE RATIO ON NASDAQ AND DOW TODAY? I do know sp 500 is 44.", "score": 0, "replies": [{"body": "Just look tomorrow", "score": 1, "replies": []}]}, {"body": "Found Cathie “Jesus take the wheel” Woods account.", "score": 0, "replies": []}, {"body": "Someone’s been listening to too much of Cathie Woods", "score": 0, "replies": []}, {"body": "Momma cathie agrees with you. She’s effectively betting on deflation instead of inflation", "score": 0, "replies": []}, {"body": "Cathie Wood thanks you for your service in spreading the good news", "score": 0, "replies": []}, {"body": "Legitimately what point are you making here? Seems very inconclusive. Please elaborate.", "score": 0, "replies": [{"body": "Hedge inflation with gme", "score": 3, "replies": []}]}, {"body": "No, we should be concerned that centralized economics is inflating all your assets away and taking your power away", "score": -1, "replies": [{"body": "No, we should be concerned that deflation is real and it's giving me more power. That's always a bad thing. I can barely run 5km, what makes you think I could run the country?", "score": 2, "replies": []}]}, {"body": "op youre retarded", "score": 1, "replies": []}, {"body": "Dude that means my money will be worth like... a lot.", "score": 1, "replies": []}, {"body": "And retardation the biggest ation of all", "score": 1, "replies": []}, {"body": "This is the most retarded thing I have ever seen. The graph should be finger painted.", "score": 1, "replies": []}, {"body": "Hyper inflation is here. Who writes this shit?", "score": 1, "replies": []}, {"body": "That’s why log prices skyrocketed recently. Interesting.", "score": 1, "replies": []}, {"body": "I went straight to OP you’re retarded", "score": 1, "replies": []}, {"body": "You trying to say the inverse of fears bc of what cathie woods say? Okay echo chamber nice \"DD\"", "score": 1, "replies": []}]}
