{"title": "$TSLA Daily Investor Discussion - January 24, 2019", "selftext": "Use this thread for casual $TSLA related discussion and investor links.  This thread should **not** be construed as investment advice or guidance.  Remember, be friendly, [genuine](https://www.reddit.com/r/teslamotors/comments/8rc3jg/be_genuine/), and welcoming.  Please ping the mods with feedback and remember to report comments and posts that violate rules.\n\n[Q3 Earnings Official Thread](https://www.reddit.com/r/teslamotors/comments/9r1iru/tesla_tsla_third_quarter_2018_results_and/).\n", "id": "ajamny", "created_utc": 1548320667.0, "score": 15, "upvote_ratio": 0.91, "num_comments": 94, "comments": [{"body": "I bought my first TSLA shares ever today, after hours. Dipped my toe in with a whole 3 shares. (I don't have a big portfolio...obviously...) Don't think I've ever been this apprehensive about an investment. I live in San Antonio, TX, and over the last few months I'm seeing more and more Tesla's around town. Whenever I park next to one, if I see the owner I'll just ask them 'hey, how do you like your car?', and every single one has something along the lines of 'oh my god, it's the best car I've ever driven. I'll never drive anything else.' This has piqued my curiosity. When I saw on CNBC the downgrade, and saw the stock decline recently, thought maybe this is a time to jump in.\n\nBeen doing research over the last couple weeks, and just blown away at how all over the place the Tesla takes are. Seems like bears \\*hate\\* Elon Musk. I just don't get it, esp. all the Theranos/fraud comparisons I've read. Seeing all they've accomplished though, it's reminding me of how people kept saying for years and years that Amazon would never make it...'so wildly overpriced', and look where they are now.\n\nMy take, on what I've researched so far, is Tesla is either going to be the dominant transportation and energy company of the next 50 years, or they're going to flame out in a grand fashion. Definitely hoping it is the former. I really hadn't understood their intent, 'accelerating the world's transition to sustainable energy'. I think that's pretty cool.", "score": 19, "replies": [{"body": "Saw your post on r/ stocks, I’ve been investing in tesla since they IPO’d. My favorite stock to follow. Don’t panic sell!", "score": 9, "replies": [{"body": "Gonna do my best to hold, even if it sinks. Will probably buy more. I’ve watched hours of Elon Musk interviews lately, as the biggest criticism I keep reading is that he is some snake oil salesman and I just don’t see it. I really wish Alphabet would buy them and fund their aspirations but with Elon’s view on their AI efforts, skeptical it will happen. But otherwise I think it’d be a perfect fit.", "score": 2, "replies": [{"body": ">  I keep reading is that he is some snake oil salesman and I just don’t see it\n\nYeah. You are normal. Just keep in mind that online a handful of crazies with a lot of time on their hands can create a disproportionate sense that their opinions are common.", "score": 6, "replies": []}]}]}, {"body": "As with anyone with such grand ambition like Musks's you will get people on the opposite end of the spectrum supporting him.  Agree on your outlook of Tesla's future, apart from the flame out part. If tesla did go bankrupt i have no doubts a buyout would occur. \n\n&#x200B;\n\nWelcome to the wild ride of being a TSLA owner. Just be ready for wild unexplained swings and try not to let emotion get involved in your trading. ", "score": 6, "replies": []}, {"body": "it's funny, I hear this all the time, how all TSLA owners LOVE their cars\n\nbut then I visit a short seller's twitter account and all I see are pictures of TSLA cars rolled over in a smoking pit of fire ", "score": 4, "replies": [{"body": "I understand. I've been trying to decide over the last couple weeks, spending time on Reddit, watching YouTube vids, Seeking Alpha articles. The narrative on them is all over the place. But this is definitely a case of from what I've started to observe, on the ground...seems like they're getting more popular and people dig them. I guess the other thing that's been nagging at me is 'if the other companies can do it...why haven't they?' They've had years to make something to compete. How Toyota or Honda don't have something by now really blows my mind.", "score": 2, "replies": [{"body": "> I guess the other thing that's been nagging at me is 'if the other companies can do it...why haven't they?'\n\nThe short answer is:-\n\n* They need batteries to make EVs.\n* It isn't as easy as it looks, and hence takes time\n* They are wary of out competing their ICE models.\n\nHowever, I think we have turned the corner and other car companies are now generally serious about building good EVs and getting more serious by the day.\n\nHowever the risk of competition impacting Tesla anytime soon is minimal for the following reasons:-\n\n* Demand for EVs will grow faster than supply.\n* Tesla product is better, and their cost base for batteries is lower.\n* Other car makers don't have batteries at present to build high volumes of EVs\n\nNot that Tesla is immune to competition for ever, but they do have time to get their act together.\n\nIn terms of flaming out it can only happen via a major self-inflicted wound, and/or a general economic downturn.\n\nThe media narrative is that they are a dysfunctional company in crisis, the leads people to think a flame out is likely.\n\nOn the contrary, I think they  are generally smart and know what they are doing in terms of long term goals and product development. Where they seem to struggle is with aggressive schedules and attention to detail.\n\nThey could improve in lots of areas, but I don't think they are dysfunctional or poorly managed.\n\n&#x200B;", "score": 7, "replies": []}, {"body": "Ignore the Seeking Alpha articles. They are filled with shorts but that shitt yt site is not a market mover. ", "score": 2, "replies": []}]}, {"body": "To be fair, everyone loves their Tesla until something goes wrong (rework/accidents) and it sits in a service center for three months. \n\nTwitter also has a lot of pissed off owners, too, not just ridiculous pictures of burning cars. \n\nObviously, I’m a short, so take my bias for what it is, but the service problem is going to be a really big deal if it isn’t squared away soon. ", "score": 4, "replies": [{"body": "I spoke to my coworker today who’s two brothers both own Tesla’s. I asked him about how they get serviced and he said if it isn’t something they can do OTA they send a flat bed truck with a loaner car to you until yours is fixed. That sounded pretty cool. He did say both had to wait a bit to get their cars serviced, but apparently both of their issues were minor. One a glove box issue and another mirror related.", "score": 5, "replies": []}, {"body": "interesting, that sort of sends me two mixed signals then\n\none, is that TSLA quality may be suffering from the rushed production\n\ntwo, it's that when they get their shit together, the demand will be there, because people love these cars... ", "score": 2, "replies": [{"body": "Yeah. When they get their stuff together, and when they get price points down to $35k without sacrificing much margin, sure, Tesla will sell these things like crazy. \n\nAll those things are much easier said than done. ", "score": 2, "replies": []}]}]}, {"body": "Almost as if the short seller had a financial incentive to see the stock lose its value :thinking:\n\nJust wondering why it's \"funny\"", "score": 0, "replies": [{"body": "lol i mean these twitter accounts are mostly just circle jerks of short sellers talking to other short sellers and confirming whatever biases they may have ", "score": 5, "replies": []}]}]}]}, {"body": "Well friends,  and u/flufferbot01,\n\nI am still very much around :) and long Tesla.  Haven't sold any.  Never thought we would dip this low before earnings.  The layoffs do NOT concern me.  I believe Elon is playing the long game.  He wants a profitable $35k model 3 and and inexpensive model y.  He isn't afraid of what that looks like short term.  \n\nI believe q4 will be very profitable, only slightly less profitable than q3.  I believe between US, Europe, and China there is plenty of ongoing demand for models S and X and the high end model 3.  I own one.  It's worth every penny.  I even think demand for higher end Tesla's will increase over time.\n\nWe will learn a lot more at q4 earnings.\n\nOh and I can't wait for remote control style summon.  Also don't forget Larry Ellison is now on the board and in for 1 billion. \n\n&#x200B;", "score": 17, "replies": [{"body": "He’s alive! We have proof of life.\n\n(We’ve also proved he isn’t a jinx, because the stock fell even when he wasn’t projecting a huge rise.)", "score": 12, "replies": [{"body": "hell, even I want him to go back to predicting 350 just so we can get some reversal on the current trends ;)", "score": 5, "replies": [{"body": "I want him counting down to earnings, and building the excitement.", "score": 4, "replies": []}]}]}, {"body": "Advanced summon sounds like the coolest thing ever. I'm dying to hear more about it and hopefully have it soon™️", "score": 3, "replies": []}]}, {"body": "Why is following this company so much fun? Its like you’re living vicariously through Elon himself lol.", "score": 13, "replies": [{"body": "Its because it is both the future and run by someone who is afraid of not taking risks.", "score": 13, "replies": [{"body": "Elon does feal the fear, as per his interviews, but he just takes the risks anyways.", "score": 2, "replies": []}]}, {"body": "Their Cars are like Roller coaster, Their Stock is even more so.", "score": 3, "replies": []}, {"body": "Not fun. Being concerned with constant negativity and missteps. ", "score": 3, "replies": [{"body": "Be happy, don’t worry. It’s nothing you can control.", "score": 4, "replies": []}, {"body": "It's a pattern.  1-2 weeks before earnings wall st. will fo this.  Will happen in another 3 months before it pops on earnings again. ", "score": 3, "replies": [{"body": "Generally true, but I think q1 will be the exception where earnings doesn't rally the stock as much.  q2 and beyond should in theory be good again, but q1 is the one where US demand is kind of stagnant and before China/Europe really goes full blast.", "score": 2, "replies": [{"body": "Possibly.  Q1 report will come in 3 months.", "score": 1, "replies": []}]}, {"body": "The stock sank after Q417 and 1Q18 earnings were released.  I guess it is a \"pattern\" if you consider something that happened twice after not happening the previous two times a \"pattern\".", "score": 2, "replies": [{"body": "Guess we'll see what happens in a week.  Good luck, lol.", "score": 3, "replies": [{"body": "/u/wlee1014 /u/peacockypeacock If you want to bet on it you can go to /r/highstakestesla", "score": 0, "replies": []}]}, {"body": "Last day of Q3, Elon wrote a letter to employees saying they were close to profitability. It turned out they already were quite profitable on that day.  You never know with Elon until the numbers actually come out. ", "score": 1, "replies": [{"body": "Yup, totally agree.  Assuming the stock will jump on earnings when it has actually fallen after earnings 5 out of the last 8 releases seems silly to me though.  ", "score": 2, "replies": []}]}]}]}]}, {"body": "Following this company has replaced all tv watching for me. It’s a crazy story.", "score": 2, "replies": []}]}, {"body": "#4 TRADING DAYS UNTIL EARNINGS\n\n([Wed, Jan 30](http://ir.tesla.com/news-releases/news-release-details/tesla-announces-date-fourth-quarter-and-full-year-2018-financial))", "score": 10, "replies": [{"body": "couldn't come faster. The markets want answers from Elon to some tough questions. Looking forward to see how he responds.", "score": 7, "replies": []}]}, {"body": "oh wow is that green. we meet again.", "score": 12, "replies": [{"body": "Don't jinx it dude.", "score": -1, "replies": [{"body": "I think some FUD will come for weekend. Waiting for opportunity :-) ", "score": 1, "replies": []}]}]}, {"body": "A few thousand bucks in pending to my account and will go straight to TSLA. Let's hope I get them before the lunch hype.", "score": 14, "replies": [{"body": "Same dude ", "score": 1, "replies": []}]}, {"body": "There's going to be so much volatility up and down for at least the next couple of years that not playing with options is almost criminal... For the record I'm long and am not messing with options but oh man.\n\n\n\n$TSLA to $300 hype let's go! ^^/s ^^$5k/share ^^when?", "score": 7, "replies": []}, {"body": "**Elon Musk expected to address Tesla's capital needs - FBN**\n\n> • Elon Musk is likely to address Tesla's (TSLA) capital needs, including the looming $920M convertible notes payment, on the company's upcoming earnings call, according to Fox Business Network's Charles Gasparino.\n\n> • Sources tell Gasparino that the company has enough money to make the $920M payment.\n\n>• Previously: Spotlight burns bright on Tesla's $920M wildcard (Jan. 19)\n\n\nElon Musk expected to address Tesla's capital needs - FBN http://www.seekingalpha.com/news/3425714", "score": 6, "replies": [{"body": "And in other news.\n\n* 2.97 billion is more than 920 million\n\n( stole this comment from TMC forum)", "score": 8, "replies": [{"body": "Oh I’m right there with you... I don’t see how things could ever be as bad as not having the funds. Hell they were required to have 1B and some change at the end of the year.\n\n(Yes I believe they have the cash on hand, not even I am that bearish)\n\nBut he doubled down. So weird \nhttps://twitter.com/cgasparino/status/1088536969427202048?s=21", "score": 5, "replies": [{"body": "I have a hunch that Elon wants to launch an all out EV assault on the auto industry. I wont be surprised if they raise a couple of billions in Q2 with new stocks. That combined with cash on hand, start investing aggressively in multiple new production lines for multiple products simultaneously. During ER call, Elon might set the expectations for not being profitable for next few quarters. He's a man in a hurry. ", "score": 3, "replies": [{"body": ">I have a hunch that Elon wants to launch an all out EV assault on the auto industry. I wont be surprised if they raise a couple of billions in Q2 with new stocks. \n\nI took Elon's last set of performance targets as a reset, an opportunity is there they were not expecting, so they are shooting for it.  \n\nBut I think they also want to mainly fund grow organically off cash flow, and grow at a slightly slower pace retiring debt as they go. Possibly occasionally taking on more strategic debt.\n\nA repeat of Q3 give about $500 per quarter that can be directed towards growth, get China GF, Europe GF, Model Y + Tesla Energy ramped - $500 Million per quarter and a few strategic loans should be sufficient to do that.\n\nWhen they have that, they can then divert $1 billion per quarter to expansion as cash should be at least double Q3 2018. \n\nI think an equity raise all comes down to Model Y, it is 50/50, but my hunch is that they will not do  it.\n\nEssentially, I don't think they are far off being able to repeat Q3 2018 on a regular basis.\n\nI know bears will tell you otherwise, and we may get a strong indication in the upcoming earnings call. \n\nWhen Tesla says I'm wrong, I'm wrong.", "score": 2, "replies": [{"body": "They’ll be leftover with about $4b in cash and cash equivalents at the end of q4. Which will be reduced to around $3b after paying March debt with cash. There is no reason to slowdown the growth, unless they have a crystal ball which is predicting a global recession coming soon. ", "score": 1, "replies": [{"body": "I just think they will want a buffer until they are able to burn off short interest .. $420 should do it. :)", "score": 1, "replies": []}]}]}]}, {"body": "Question out of the blue: What do you expect from the Q4/Q1 earnings calls? What are you expecting in terms of profit?\n\nI saved [this link] (https://www.reddit.com/r/teslainvestorsclub/comments/ah91pg/tesla_to_cut_workforce_by_7/eechbp7/) of a peacock prediction (mine is there as a reply, fair's fair) but I might as well canvas for a few more.\n\n/u/stockbroker, do you want to chime in? Anyone want to share some predictions? I don't expect miraculous answers, but it could be fun to look back on.", "score": 1, "replies": [{"body": "I need to make the projection thread again. Been lazy this Q", "score": 4, "replies": []}]}]}]}]}, {"body": "I think Every 6 months they would have a mass layoff of a few %.\n\nSo folks will need to take this as a norm.\n\nTesla is a very young company and their working style is definitely not for everyone. You have to hire a lot and trim a lot to get the best workers.", "score": 3, "replies": [{"body": "You'll trigger people when you call Tesla a young company. Let's call them young at heart.", "score": 6, "replies": [{"body": "15years is still very young in the automotive industry. The old guys are a century old.", "score": 2, "replies": [{"body": "Heh. That's not the definition you had in mind in the first comment. Admit it.", "score": -1, "replies": [{"body": "I have to call you out for not-a-mind-reader. I want to call Tesla still in Startup mode and I know that will trigger people.\n\nTesla is breaking into the entry level luxury car market, and soon the mass market. That to me is very much like a startup business model.\n\nI compare apples to apples. Tesla and SpaceX are both a very young company in their industry.", "score": 2, "replies": []}]}]}]}, {"body": "I'm not sure that plan will attract the best talent in the long term. \n Ford is paying all hourly workers a $7,600 profit sharing bonus: Tesla is firing 7% of its workforce every 6 months without cause.  Who would you rather work for?\n\n ", "score": 2, "replies": [{"body": "If thinking positively, they might have accepted a lot of people, and then fired the not-so-talented ones. Some companies do it.  Though they might also pissed some talented people off and lose them anyway.", "score": 3, "replies": [{"body": "Yes, I completely agree with that.  There are many companies that follow a similar model (banks are a good example).  The problem is if Tesla employs that model they are going to need to otherwise make themselves a more attractive place to work.  People will only accept the added risk of being fired if they are compensated more, get better benefits, etc. Generally that means Tesla will have a higher cost of labor.", "score": 1, "replies": [{"body": "If I recall correctly, Tesla has a huge application list.  It's tough to get on there.  And they grew like 37 percent new hires for m3 so they probably needed to trim it back a little. I'm long calls so I'm biased.", "score": 2, "replies": []}]}]}, {"body": "If I want to work with talented people then I'd rather work for Tesla.\n\nThe downside of working in an environment where people don't get fired is that you gotta work with those people who probably should be fired.", "score": 10, "replies": [{"body": "There is a difference between firing people for cause and culling 7% of your workforce because the company is struggling to turn a profit.", "score": 7, "replies": [{"body": ">culling 7% of your workforce because the company is struggling to turn a profit.\n\nI'm sure they will give their reasons for the layoffs in the earnings call, and this will not be the reason.\n\n&#x200B;", "score": 2, "replies": [{"body": "They gave the reasons in the letter announcing the layoffs.  It was because the company will struggle to turn a profit going forward.", "score": 0, "replies": [{"body": "> As a result of the above, we unfortunately have no choice but to reduce full-time employee headcount by approximately 7% (we grew by 30% last year, which is more than we can support) and retain only the most critical temps and contractors. Tesla will need to make these cuts while increasing the Model 3 production rate and making many manufacturing engineering improvements in the coming months. Higher volume and manufacturing design improvements are crucial for Tesla to achieve the economies of scale required to manufacture the standard range (220 mile), standard interior Model 3 at $35k and still be a viable company. There isn't any other way.\n\nYou need to keep in mind there were trying to justify laying off staff.\nYou will also notice a lot of staff have been laid off on Model S/X production.\nI'm expecting the earnings update will provide more detail on the layoffs, the lower Q1 profit is in part caused by the layoffs IMO. \n", "score": 3, "replies": []}]}]}, {"body": "Sure, but I'm saying it is actually nice to work in an environment that demands high performance and fires when that demand isn't met.\n\nBad places to work are the ones where the firings are random.  ", "score": 1, "replies": [{"body": "Sure, but what I am saying is an employer can demand high performance and fire those that don't cut it without slashing a big percentage of their workforce every 6 months just to try and maintain profitability.  \n\nYou are creating a false dichotomy.  The choices aren't just \"Company demands high performance\" or \"Company never fires anyone\".  ", "score": 8, "replies": []}]}]}]}, {"body": "Wouldn't this long term employee also be concerned by a profit drop at Ford of >50% from last year?\n\nhttps://www.detroitnews.com/story/business/autos/ford/2019/01/23/ford-profits-down-more-than-50-percent-2018/2657790002/", "score": 4, "replies": [{"body": "Not if they keep increasing pay.  Also, sort of funny that you think employees at a company that posted a $3.7 billion profit last year should be worried about job security (reminder, Tesla lost $1 billion in the same period).  ", "score": 4, "replies": [{"body": "Ford’s future planning doesn’t inspire a lot of people. Yes they posted a profit last year but they’ve also killed off all of their sedans to focus on trucks and suvs. I would suggest although trucks and suvs traditionally have sold well it isn’t environmentally sustainable to continue to sell higher fuel consumption vehicles and if a recession hits or gas prices rise significantly the only vehicles Ford is planning on manufacturing going forward won’t be selling. ", "score": 2, "replies": [{"body": "I doubt gas prices are ever really going up considerably again.  It just costs too little to extract oil now, and demand has pretty much peaked as efficiency gains are made across the transportation industry.  Ford is also trying to push more fuel efficient versions of its trucks and SUVs as hard as it can.  ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "So I bought another 15 shares the other day at 293 and here we are at 283.  I hate that I am at a loss on those because this is the biggest loss I've taken on TSLA.  I know, it isn't much, but I honestly didnt expect to drop below 290.  Thing is, now I'm thinking about putting another 10k or so into the stock at this level.  Am I crazy?  Is this a bad plan right now?   It is part of some downpayment money for a house, which I probably wont buy until the market turns, but I also kinda want the money available.  What to do?", "score": 2, "replies": [{"body": "U bought and it went down $10, sounds pretty standard to me. Just get over it and be patient, more than likely it will come back. $293 was a great time to buy IMO.", "score": 6, "replies": [{"body": "Exactly. You need to re-adjust your expectations if you think you can just make an extra 100 in a couple days consistently and everything will be fine. Give it a few months. Many people have to stick in the Markets for years. Just forget about the skin you have in the company. \n\nWhile you're waiting, choose another stock to follow. ", "score": 1, "replies": []}]}, {"body": "My personal opinion: Spend it on your house.  Don't stress yourself out on money you could or could not make.  Use it on your personal needs first and invest money you don't *need* in the near future.\n\nI've made the mistake to stretch myself thin by being a little too over zealous with investing.  It's not fun.  Sometimes it works out and sometimes it doesn't.  I'm not a person who handles high levels of stress in day to day life too well, so to each their own.", "score": 5, "replies": [{"body": "Yeah the problem is I know I'm not going to buy a house at these levels, and while I've got cash laying around I'd like it to go to work for me.  I used this strategy in the back half of last year and was able to add another 5.5k to my downpayment money, so I'm kinda riding that wave but also trying not to get greedy.  \n\nI appreciate the conversation tho.  Good to hear devils advocate side of things, which is why I posted.  Not sure why someone downvoted", "score": 2, "replies": [{"body": "I mean, if you aren't going to use the money in the near future, invest it in something safe that you will still get gains on.  That wont hurt either.  It just all depends on the amount of risk a person wants to take is what it amounts to.", "score": 3, "replies": []}]}]}, {"body": "Yeah dude, totally spend your housing money on a risky stock.  That seems like a completely reasonable plan.", "score": 12, "replies": [{"body": "As I outlined in the OP, it is only a part of the downpayment money and I'm in a stable situation.  Just looking for some dialogue with others who know the stock is all.  Dont mind hearing a negative stance on the decision, but could honestly deal without the condescension.  I didnt arrive at the point I'm at in life by making stupid, reckless decisions, and I always try to weigh the other side.  So there's really no need for a condescending attitude.", "score": 4, "replies": [{"body": "Totally agree. Its good you're being pro-active. My advice (really, honestly) just chill out. The share price WILL fluctuate. Up and down. That's a given. You bought at a good price. Chill and wait. ", "score": 4, "replies": [{"body": "Thanks.  I bought 25 at 285.50.  Looks like we are in a trend reversal on the daily right now and I'm banking on a good boost from earnings so heres hoping!  Appreciate the feedback as it helped me decide just how much to risk.  ", "score": 2, "replies": [{"body": "I'll be completely honest. Don't bank on anything. \n\nSell if your comfortable with the amount of profit you make. Don't sell if you'll make a loss, you'll be fine. Just a matter of time. \n\nRemember: Timing the market will never work as well as time IN the market.", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Yes, but a few days is not something to be concerned about. Even more so if it's a company you believe in ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "This goes back to your own personal finances. If I had the capital I think TSLA is a great buy at these levels but I feel like I'm already personally invested as much as I can be. If you have a million sitting and doing nothing, 10k sounds cool to put in, sure :) ", "score": 3, "replies": []}, {"body": "Are you a doer? You only have ONE chance to invest that money at this time! How would you feel if in 5 years Tesla’s worth $1000 and you didn’t invest because you were a lil bich? Yeah that’s what I thought, let those nuts hang and invest, but don’t be stupid, invest like 3k out of that 10 or whatever you are comfterable with it. ", "score": 3, "replies": []}, {"body": "It's not a loss if you don't sell.", "score": 1, "replies": []}]}, {"body": "Weird price action today. Tiny rollercoaster up and down. ", "score": 2, "replies": [{"body": "Not much of a rollercoaster for Tesla.  This is super calm before earnings.  Wonder how Mon, Tues, Wednesday will look.", "score": 3, "replies": [{"body": "Most likely veeeeeery slow growth as investors gain confidence. Think it will hit 290 prior to earnings. ", "score": 2, "replies": [{"body": "It will be higher than $290 I bet since we're already there.  We have 4 trading days before earnings.  My thinking is it goes up a bit more.  My bet is $310 to $320 before earnings.  I'm long calls.", "score": 2, "replies": [{"body": "Given the late push today, wouldn't be surprised at another 340 run tbh", "score": 1, "replies": [{"body": "340 prior to earnings or after?", "score": 1, "replies": []}]}]}]}]}, {"body": "It's mostly day traders and algorithm putting money in and out. They like volatile stocks.", "score": 2, "replies": []}]}]}
