{"title": "AMD lot of open interest at 90 calls strike for last few days", "selftext": "&#x200B;\n\nhttps://preview.redd.it/thn1ad634ah71.png?width=1007&format=png&auto=webp&s=71356acf82b30cb7883e310bd56f58d165698c93", "id": "p43uf1", "created_utc": 1628927455.0, "score": 10, "upvote_ratio": 0.69, "num_comments": 26, "comments": [{"body": "Thanks for sharing", "score": 3, "replies": []}, {"body": "Lol what was it leading up to the 7/29 spike? Missing 2 weeks of data…", "score": 2, "replies": []}, {"body": "what should i buy?", "score": 3, "replies": [{"body": "Books on investing", "score": 63, "replies": [{"body": "Good One.", "score": 3, "replies": []}]}, {"body": "Ligma.", "score": 1, "replies": []}]}, {"body": "I do understand the importance of the options chain when analyzing a stock move, but without any catalyst for the move I don't believe it make any sense. If earnings were nearby or any news release was expected maybe, but just any other day I don't think is relevant. I'll may be completely wrong, would love to hear somebody with more experience than me on this matter.", "score": 1, "replies": []}, {"body": "Will it trigger a squeeze if they are executed? Or will it trigger a sell off for ppl taking profit??", "score": -20, "replies": [{"body": "Definitely a squeeze candidate. You should buy all you can afford. Hodl! /s", "score": 21, "replies": [{"body": "Lmao", "score": 2, "replies": []}]}, {"body": "Idk man. I’m worried more about the recession after the fed stops printing money.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -25, "replies": [{"body": "You think that’s fun, wait until you turn that 6k into 1k. That’s when the real fun begins", "score": 24, "replies": [{"body": "It did. My bad. Really don’t know what I’m talking about. Just took a different angle on the reply and made a goddam fool a myself.  Anywho for what it’s worth, apologies", "score": 2, "replies": [{"body": "It’s all good man, I was just trying to be funny. Even the pros take a beating here and there. Just keep learning from your mistakes and most importantly develop a risk management strategy so that once you make gains you don’t give them right back", "score": 2, "replies": [{"body": "What kinda strategy do u use? This is me learning 😂", "score": 2, "replies": [{"body": "I’m pretty new too man. I have about 5 months under my belt and fortunately I am net positive. Generally I look for low IV ITM calls or Puts on companies that I already hold stock in. I buy contracts that expire sometime after whatever the next catalyst is earnings, shareholder meetings, etc. and then I either try and make some money off the IV pop or hold if I’m super confident the stock is going to move the way I think it will. Generally I make an options play with 1-3% of my portfolio value and then if shit doesn’t go my way I GTFO ASAP.", "score": 2, "replies": [{"body": "Thanks man. I am net positive as well. Taking that cash and Actually about to buy a bot to trade currencies and bank cash daily that way.", "score": 2, "replies": [{"body": "Good luck. Remember to save some for the tax man.", "score": 2, "replies": []}, {"body": "Bro. Thank you.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": -27, "replies": [{"body": "\"I'm new btw..\"\n\n\"Let me teach you something..\"\n\nWhen a 50 handicap golfer gets one par.", "score": 12, "replies": [{"body": "I’m new to trading. But I know how to create wealth by supporting the successes of others instead of being envious of it. 🙄", "score": -10, "replies": [{"body": "Think my comment just flew right by your head. Best of luck.\n\nEdit: also, no one is envious of your gains. Being a part of this sub for a while, i can tell you, you are a tiny fish. Dont try to act like you know the secret to trading, ask a lot of questions, read what more successful traders are doing and saying and have a humble mentality.", "score": 3, "replies": [{"body": "Yeah, this guy says \"let me teach u real quick\", which is condescending and then adds that others are envious. The nerve on this guy.\n\nBy learning from the best, it sounds more like he. Finally finished reading the Secret or Rich Dad Poor Dad (which is a waste of time to begin with). In any case, the market has enough lessons for everyone.", "score": 4, "replies": []}]}]}]}, {"body": "Ha dude I don't think you understand his comment 😬 wow", "score": 1, "replies": []}]}]}]}, {"body": "Thx.", "score": 1, "replies": []}, {"body": "I may end up losing money on both my put credit spread and my put debit spread on AMD because it refuses to leave the 104-108 range. I have a real talent for choosing the worst possible strikes.", "score": 1, "replies": []}]}
{"title": "PayPal (PYPL) Lookin wedgy", "selftext": "[deleted]", "id": "p40a1d", "created_utc": 1628910765.0, "score": 13, "upvote_ratio": 0.86, "num_comments": 15, "comments": [{"body": "[deleted]", "score": 1, "replies": [{"body": "What do you mean?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I'm all for filling that gap and then some.", "score": 3, "replies": [{"body": "Are we still talking about stocks?", "score": 5, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "I picked up a good amount of $310 10/15 calls Tuesday. They've been bleeding but I have faith in em.", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I think they're gonna turn out nice. I see a jump to a ath.", "score": 2, "replies": []}]}, {"body": "Lol I thought I was stupid for making same call but, hopefully we both land in the money. 🤑", "score": 2, "replies": [{"body": "Hopefully", "score": 2, "replies": []}]}, {"body": "It was a bloodbath these past two days. I have 2 10/15 calls for 280. Hopefully we didn't bone ourselves!", "score": 1, "replies": [{"body": "I dumped mine yesterday for a loss. Glad I did.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Bearish pennant 🥶 I’d go long above 280 if the volume is there", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "That’s a pattern, it’s a bearish pennant. Consolidation getting tighter after a strong drop but unable to reach new highs/lows. \n\nIf it gets voided by a strong move up, that’s bullish and I’ll buy in. You see it all the time on SPY, it will throw out a bear flag then break out upside and hit new highs.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "No problem. Good luck. It’s on my watchlist for sure now", "score": 1, "replies": []}]}]}]}, {"body": "I know what you're saying about the bearish pennant.\nBut historically looking at the 1yr that seems to be the pattern. Drop followed by consolidation then shooting up. Do you think the pennant or the historical trend would be more important?", "score": 1, "replies": [{"body": "Dunno, anything can happen. A straddle could be a good play there. Or just wait for it to break and make a definitive move to either side, ideally with volume", "score": 2, "replies": []}]}]}, {"body": "Love gme", "score": 1, "replies": []}]}
{"title": "Follow The Money - Understanding Sectors And Adapting To Every Market Condition", "selftext": "#  I. Introduction\n\nI think the **hardest part about trading is that the market is constantly evolving**. We are creatures of habit, as a result we get complacent and think we can find a single, comfortable strategy that works an infinite amount of times. This is almost never the case; different market conditions call for different approaches. By combining this post with my last, you should **obtain a basic understanding of how you can read market conditions, and adapt with the market.**\n\nIf you [read my previous post](https://www.reddit.com/r/wallstreetbets/comments/p1x0ls/follow_the_money_how_to_catch_every_rotation_and/), you now know when money is flowing into equities, and when it is flowing into bonds, the dollar and other safe havens. You also know about the different indexes, and what basket of stocks they carry. You even know about some interesting correlations that have arisen recently related to tech and a risk off rotation.\n\nIn this one - I'm going to take it a step further, and dig a little deeper, showing you all how to tell exactly which types equities money is flowing to, and **how to use that to generate high probability trades.** In this era of passive indexation, **you are almost never just buying one stock**. You are buying one stock - and every stock correlated to it.\n\nTo avoid this phenomenon - you need to understand the different different sectors present within the market. Equities all belong to at least one of these - **and will usually track the rest of the stocks within their respective sectors quite closely.** \n\n# II. The Eleven Sectors That Define The Market\n\nThere is generally believed to be eleven different sectors that equities belong to. In this section, I'll detail what each one is, **the ETF you can use to track it**, and what environment it usually outperforms in.\n\nAlso, there's two main categories for stocks: **cyclicals - which follow the business cycle, and non-cyclicals - which perform the same year round.**\n\n# 1 - Energy (VDE)\n\n**What It Is -**\n\n\"The energy sector is a category of stocks that relate to producing or supplying energy. The energy sector or industry includes companies involved in the exploration and development of oil or gas reserves, oil and gas drilling, and refining. The energy industry also includes integrated power utility companies such as renewable energy and coal.\"\n\n\\- *Investopedia*\n\nBasically, this sector is dominated by the oil industry. You will notice renewables will hardly effect it's price movements a vast majority of the time. While many are trying to shift away from oil, it will likely be a massive part of our economy and our market long into the future.\n\n**When It Outperforms -**\n\nIn most situations - the energy sector is cyclical. This means when our economy is doing well and expanding - it will perform well. When it isn't, the reverse is true. Because it is dominated by a commodity, energy companies also have no issue passing on inflation to their consumers. However, keep in mind this one is a bit special because of OPEC and their ability to influence price.\n\n\"OPEC is a cartel that **aims to manage the supply of oil** in an effort to set the price of oil on the world market, in order to avoid fluctuations that might affect the economies of both producing and purchasing countries.\"\n\n*- Investopedia*\n\nBasically, they have most of the oil, and fix the prices to their liking. This can have some unforeseen effects on the market, so if you are trading energy you definitely want to monitor their movements.\n\n# 2 - Materials (VAW)\n\n**What It Is -**\n\n\"The basic materials sector is an industry category made up of businesses engaged in the discovery, development, and processing of raw materials. The sector includes companies engaged in mining and metal refining, chemical products, and forestry products.\"\n\n\\- *Investopedia*\n\n**When It Outperforms -**\n\nThe materials sector is cyclical. It is sensitive to changes in the economy and tracks it pretty closely. This is another sector that can easily pass inflation onto their consumers due to the nature of their products. It's also going to be especially sensitive to any changes in the supply and demand of raw materials worldwide.\n\n# 3 - Industrials (VIS)\n\n**What It Is -**\n\n\"The industrial goods sector includes stocks of companies that mainly produce capital goods used in manufacturing, resource extraction, and construction. Businesses in the industrial goods sector make and sell machinery, equipment, and supplies that are used to produce other goods rather than sold directly to consumers.\"\n\n\\- *Investopedia*\n\nBasically, the materials sector passes raw materials to the industrials sector - which converts them to products used to manufacture the final products passed on to consumers.\n\n**When It Outperforms -**\n\nBecause it is so closely tied to how much companies are producing - this sector is also cyclical. This is yet another sector that can pass the costs of inflation onto their consumers. Subsequently, due to it's close ties with the materials sector - it will be especially sensitive to the supply and demand of raw materials.\n\n# 4 - Consumer Discretionary (VCR)\n\n**What It Is -**\n\n\"Consumer discretionary is a term for classifying goods and services that are considered non-essential by consumers, but desirable if their available income is sufficient to purchase them. Examples of consumer discretionary products can include durable goods, high-end apparel, entertainment, leisure activities, and automobiles.\"              \n\n\\- *Investopedia*\n\nEssentially, anything broke people can't afford, like those who went all in on WISH calls before earnings, goes in this basket.\n\n**When It Outperforms -**\n\nBecause it depends on the income of consumers - this is also a cyclical sector. When the economy is thriving, people will have more money to blow on non-essential goods, like $120 Lululemon shorts, or tickets to Disney World.\n\n# 5 - Consumer Staples (VDC)\n\n**What It Is -**\n\n\"The term consumer staples refers to a set of essential products used by consumers. This category includes things like foods and beverages, household goods, and hygiene products as well as alcohol and tobacco. These goods are those products that people are unable—or unwilling—to cut out of their budgets regardless of their financial situation.\"           \n\n\\- *Investopedia*\n\nBasically the opposite of consumer discretionary - these are things people **NEED** not things that they **WANT.**\n\n**When It Outperforms -**\n\nThese are non-cyclical, or defensive - which means regardless of how the economy is doing they will perform more or less the same. This means when the economy is taking a turn for the worst, they will generally outperform the other sectors. This doesn't mean they are immune to business cycle changes entirely, but they are certainly much less affected by them.\n\n# 6 - Health Care (VHT)\n\n**What It Is -**\n\n\"The healthcare sector consists of businesses that provide medical services, manufacture medical equipment or drugs, provide medical insurance, or otherwise facilitate the provision of healthcare to patients. The healthcare sector is one of the largest and most complex in the U.S. economy, accounting for close to a fifth of overall gross domestic product (GDP). The U.S. healthcare sector benefits from a strong system of medical research and development, in cooperation with the higher education system and the technology industry. The aging U.S. population and the advancing senescence of the Baby Boomer generation are driving ongoing strong demand in the healthcare sector.\"\n\n\\- *Investopedia*\n\n**When It Outperforms -**\n\nThis one is a bit complicated because there are a few industries within the sector, namely: medical equipment, drug R&D, and health insurance. The sector is non-cyclical - but each industry has it's own quirks.\n\nThe drug industry in particular often moves independently of everything else on the market, because it is highly dependent on new developments and news pieces related to potentially groundbreaking treatments. Health insurance and medical equipment is usually non-negotiable regardless of the business cycle - so it will outperform in times of economic distress, and generally perform the same year round.\n\n# 7 - Financials (VFH)\n\n**What It Is -**\n\n\"The financial sector is a section of the economy made up of firms and institutions that provide financial services to commercial and retail customers. This sector comprises a broad range of industries including banks, investment companies, insurance companies, and real estate firms.\"\n\n\\- *Investopedia*\n\n**When It Outperforms -**\n\nBanks involve the supply and demand of money. They make money through fees and interest rate spreads. Banks perform well during economic expansion when companies and individuals are borrowing money. One of the main drivers of borrowing/lending is interest rates. In a rising rate environment (observed through TNX, TLT, US treasury yield curve), banks will outperform. They pay short term rates (front of curve) on their deposits, and lend money to companies or individuals at a higher interest rate (further out on the curve) capturing a difference or \"spread\" on interest paid vs received. Understanding treasury yields and how they are related to the daily price movements in the financial sector is a great place to start.\n\n# 8 - Information Technology (VGT)\n\n**What It Is -**\n\n\"The technology sector is the category of stocks relating to the research, development, or distribution of technologically based goods and services. This sector contains businesses revolving around the manufacturing of electronics, creation of software, computers, or products and services relating to information technology.\"\n\n\\- *Investopedia*\n\nThis one really needs no introduction.\n\n**When It Outperforms -**\n\nThis is a bit tricky due to some correlations that have arisen from 2020 onward. For most of history - most tech stocks were cyclical. However, due to COVID, extremely low interest rates, and some other factors - these assets are now being rotated into during a risk off environment - and are seen as a safe-haven. Who knows if this will stand, but it's important to understanding when money will flow there **today.** More on this can be found in my previous post, where I go into detail on this phenomenon.\n\n# 9 - Communication Services (VOX)\n\n**What It Is -**\n\n\"The telecommunication sector is made up of companies that make communication possible on a global scale, whether it is through the phone or the Internet, through airwaves or cables, through wires or wirelessly. These companies created the infrastructure that allows data in words, voice, audio, or video to be sent anywhere in the world. The largest companies in the sector are telephone (both wired and wireless) operators, satellite companies, cable companies, and Internet service providers.\"\n\n\\- *Investopedia*\n\n**When It Outperforms -**\n\nThis is another non-cyclical sector. Whether the economy is good or bad - people aren't going to give up communicating with each other. In today's world, everyone needs a phone - even if it's a flip phone - and everyone needs internet access. One of the interesting parts of this sectors is that it is comprised of both growth names and income names. While the larger names are more consistent with dividends, the smaller names often have more room for capital appreciation and earnings growth.\n\n# 10 - Utilities (VPU)\n\n**What It Is -**\n\n\"The utilities sector refers to a category of companies that provide basic amenities, such as water, sewage services, electricity, dams, and natural gas. It is a large sector, and an important part of the U.S. economy, with a market capitalization of over $1.5 trillion (as of March 2021). Although utilities are private, for-profit companies, they are part of the public service landscape—providing as they do such staples for daily living—and are therefore heavily regulated. Investors typically treat utilities as long-term holdings and use them to generate a steady income for their portfolios.\"\n\n\\- *Investopedia*\n\n**When It Outperforms -**\n\nYet another non-cyclical basket of stocks. Regardless of the business cycle, demand for utilities almost always remains constant. These are some of the most stable stocks on the market - so WSB is probably better going to forget they exist moments after reading this post.\n\n# 11 - Real Estate (VNQ)\n\n**What It Is -**\n\n\"Real estate is the land along with any permanent improvements attached to the land, whether natural or man-made—including water, trees, minerals, buildings, homes, fences, and bridges. Real estate is a form of real property. It differs from personal property, which are things not permanently attached to the land, such as vehicles, boats, jewelry, furniture, and farm equipment.\"\n\n*- Investopedia*\n\n**When It Outperforms -**\n\nLike most industries, real estate involves the supply and demand of property, both residential and commercial. Real Estate is closely related to changes in construction or development, but also heavily influenced by interest rates. Most participants are using Loan to Value (LTV), anywhere from 60-85% of the total property value; therefore, interest rate changes will impact participants' ability to borrow. Thinking through these variables, its safe to assume that real estate performs well in low interest rate environments, low-moderate commodity prices for construction, population growth, and government (both local and federal) infrastructure support. When rates rise, the debt burden increases and money is hard to borrow; which ultimately affect the ability to invest in new projects or purchase homes.\n\n# III. Practical Applications\n\nTo use all of this information - and convert it to probabilities I can use to trade - **I perform technical analysis on each sector ETF using the 1 year 1 day chart (swing trade timeframe)**. If one is breaking out of a large setup - I can assume money is going to move there in the future. If others are forming nice setups - I know to add them to my watchlist.\n\nAfter identifying a sector that is likely to become strong in the near future - **I then filter it further by finding particular stocks within the sector that have similar setups**. I usually look through the top holdings of the ETF pertaining to the sector. I do this because individual stocks are more volatile than sector ETFs and more liquid - which means there is more money to be made. If a particular stock is lagging behind the sector, it can also mean there is even more to gain than in the case of another name.\n\nYou can take this one step further and combine information from my previous posts by identifying whether we are risk on, or risk off. Cyclicals are generally going to outperform while we are risk on. Non-cyclicals will generally outperform while we are risk off.\n\n**Example -**\n\nLast week - I noticed financials were breaking out of a large falling wedge on the daily chart. This has a bullish bias - and indicates price will make a strong move in the near future. I didn't have to scan the ETF for this one, since all the stocks in it are household names.\n\n[ VFH \\(Financials\\) 1 Year 1 Day ](https://preview.redd.it/c9isx12qnch71.png?width=2233&format=png&auto=webp&s=7ea5f70bfaea3e9a7a6e9b37cb133bed430bb13e)\n\n \n\nI also noticed BAC had formed a bull flag. This was all the information I needed to enter some October Calls which I closed today for a nice profit.\n\n[BAC \\(Financials\\) 1 Year 1 Day](https://preview.redd.it/trr7v51tnch71.png?width=2233&format=png&auto=webp&s=7cd316b28a0484700373b57eef62bd4b2e875331)\n\nLastly, ZB was trending downwards and yields were rising. This was an environment banks outperform - which means it enforced my probability of success even more.\n\n[ZB \\(Bonds\\) 1 Year 1 Day](https://preview.redd.it/fzn8g9hxnch71.png?width=2233&format=png&auto=webp&s=abfc5484b4b55c9f35f7d42a8c82dcb2c1898bfd)\n\nYou don't have to use technical analysis. This is just my preference. Many people use complex fundamental and economic analysis to determine these rotations. The important thing is understanding the environments particular sectors will outperform in.\n\n# V. TL;DR\n\nThere's **11 sectors** within the stock market.\n\nThey are:\n\n1. Energy **(VDE, Cyclical)**\n2. Materials **(VAW, Cyclical)**\n3. Industrials **(VIS, Cyclical)**\n4. Consumer Discretionary **(VCR, Cyclical)**\n5. Consumer Staples **(VDC, Non-Cyclical)**\n6. Healthcare **(VHT, Non-Cyclical)**\n7. Financials **(VFH, Cyclical)**\n8. Information Technology **(VGT, Cyclical Most Of The Time)**\n9. Communication Services **(VOX, Non-Cyclical)**\n10. Utilities **(VPU, Non-Cyclical)**\n11. Real Estate **(VNQ, Cyclical)**\n\nEach one will be rotated into depending on different market conditions. Understanding this is important to being able to make money at any given time. I perform technical analysis to determine when each is being rotated into, but you can use any analysis you want.", "id": "p4b8cb", "created_utc": 1628958679.0, "score": 245, "upvote_ratio": 0.98, "num_comments": 27, "comments": [{"body": "Excellent post on a topic that is for some sort of reason not often talked about.", "score": 13, "replies": []}, {"body": "This is a fantastic write-up.  Thank you!", "score": 5, "replies": []}, {"body": "Well written. As a 12 year pro trader I do the same but a lot of people don’t think about what part of the cycle we are in. Just putting them all overlaid on 1 chart every week shows how much they vary from week to week as the big boys jump from sector to sector and most people either chase them or do nothing and hold till they die.", "score": 4, "replies": []}, {"body": "Thanks for the easy to read breakdown.", "score": 7, "replies": []}, {"body": "Great post, thanks for sharing 🙏 but as a newbie...\n\nPlease could you explain the following paragraph a little more, particularly what you mean when you say \"yields were rising\" (and how you discerned that), and what \"an environment banks outperform\" means? \n\n> ZB was trending downwards and yields were rising. This was an environment banks outperform - which means it enforced my probability of success even more.", "score": 2, "replies": []}, {"body": "That is a must read, thank you!\n\nI think that semiconductors have matured to a point that can be a separate sector, the market cap of nvidia, amd, qualcomm and intel adds up to more than the market cap of utility sector", "score": 4, "replies": [{"body": "Perhaps - but they are considered a part of the technology sector - which has a bigger market cap than all the others by far", "score": 1, "replies": []}]}, {"body": "U rock! ✌️🙏\n\nCan you post something about options? Options for newbies?\n\nIm thinking about tryin a free demo from my broker in order to see whats up 😅", "score": 2, "replies": [{"body": "I got this.\n\nOptions are like stocks but cheaper and if you buy them you get hella rich\n\nEZ Lambo", "score": 8, "replies": [{"body": "😂😂", "score": 1, "replies": []}, {"body": "versed shelter tub scary slim worthless dog quarrelsome detail recognise\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*", "score": 1, "replies": []}]}]}, {"body": "sell everything . jump to AMC", "score": 0, "replies": []}, {"body": "Did you just steal this from wsb", "score": 1, "replies": [{"body": "Actually I posted it on WSB before this lmao", "score": 4, "replies": [{"body": "Ah yea username checks out", "score": 4, "replies": []}, {"body": "I was gonna say, either way I don't really care. It's interesting and I dont really ever look at WSB", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "In a way I do because which ever of the top holdings that are breaking out with the sector are going to be the industry that is leading it", "score": 1, "replies": []}]}, {"body": "Great writing! Why did you close your trade, given that your calls had still lot of room to grow?", "score": 1, "replies": []}, {"body": "Posting here so I can find this Monday morning on the work pooper", "score": 1, "replies": []}, {"body": "Thanks, straight forward and put together well.", "score": 1, "replies": []}, {"body": "Just buy low and sell high.", "score": 1, "replies": []}, {"body": "Great post! I'm a new trader and been studying a lot about this.", "score": 1, "replies": []}, {"body": "Thank you. This post comes at the perfect time as I currently enhance my momentum trading strategy by focusing mainly on hot sectors. \n\nDo you have any further resources on market/sector awareness? Things like blogs, videos maybe even books? Let me add, i’m not a macro guy. I solely focus on price action.", "score": 1, "replies": []}, {"body": "Thank you so much for this!", "score": 1, "replies": []}, {"body": "Very nice writeup. One comment on the correlation between the sector and the participants. \n\nWhen an ETF takes off, i.e. breaks up, some stocks have already covered some nice gains. And some will always be laggers. So you are left with the followers. \n\nIt's not easy to bet on the early gainers, but I guess it's easier to spot the followers.", "score": 1, "replies": []}, {"body": "Great stuff, but I think can get quite complicated for some to implement.  But of course I encourage hard work, but at the end of the day, it’s critical to learn how to control FEAR.  So many traders who end up in a winning trade, take their profit too early, when they should be adding to their position.  And on the other hand they tend to buy stocks that seem to be on Sale.  Until these mistakes are mastered it doesn’t matter how much DD you do.  Staying in a good trade and adding to the position requires having to withstand that sinking feeling in your stomach.  Embrace that feeling it’s part of winning.", "score": 1, "replies": []}, {"body": "this is easily the best post on this sub-reddit", "score": 1, "replies": []}]}
{"title": "Help/advice please", "selftext": "So my current portfolio is: TQQQ 37%, AAPL 7%, MSFT 7%, NVDA 7%, IIPR 7%, ABR 7%, V 7%, ABBV 7%, SBUX 7% and NOBL 7%. \n\nI know I’m tech heavy and know the risks of the leverage etf, but should I diversify for the sake of diversifying into sectors that I don’t have or should I focus on investing in what I know/use? I’m 33 btw if that helps and this is in a Roth. Thank you for anyone taking the time to read and answer.", "id": "p3xtpp", "created_utc": 1628901043.0, "score": 9, "upvote_ratio": 0.77, "num_comments": 20, "comments": [{"body": "Is it too late to jump into this portfolio?", "score": 11, "replies": []}, {"body": "You should buy Costco and shw to balance out retAil gains", "score": 3, "replies": [{"body": "I was looking into Costco. It’s on my watchlist. Thank you", "score": 2, "replies": []}, {"body": "A literal straight line up, and starting to g  egg detached from historic fundamentals. Rethink tjat", "score": 1, "replies": []}]}, {"body": "If you know what you own and are comfortable with the prospects. You should be happy with it, if you are not awake at night thinking about it , you ar good", "score": 3, "replies": [{"body": "That’s a good way to see it. Thank you so much", "score": 1, "replies": []}]}, {"body": "Is Tqqq overweight from gains?", "score": 3, "replies": [{"body": "Yeah I got in around may of this year and it’s been great", "score": 5, "replies": [{"body": "Good stuff.  I’d probably lower my exposure to it a little bit by selling of about half of it and buying a vanilla broad market etf. If the party continues, it will be back to about 1/3rd of your holdings in no time, and if the market flattens or drops you’ll be glad.", "score": 4, "replies": [{"body": "Solid advice. Tqqq is leveraged etf and one bad week could be dangerous for OP's portfolio at current allocation.", "score": 4, "replies": []}, {"body": "Sweet. Thank you for the advice. Will be looking into some this weekend", "score": 1, "replies": []}, {"body": "Hope you took this advice!", "score": 1, "replies": []}]}]}]}, {"body": "Feels like deja vu from a post yesterday. Had to check if it was the same user. I’ll make the same comment. \n\nWhy di(worse)ify your portfolio if there is no need to. What you are describing is FOMO. FOMO is garbage and has no place in the investing world.", "score": 3, "replies": []}, {"body": "This is an excellent portfolio.", "score": 4, "replies": [{"body": "Thank you", "score": 1, "replies": []}]}, {"body": "Rather than Costco, look at Target", "score": 2, "replies": []}, {"body": "One question, what’s your interest rate hike hedge here?", "score": 2, "replies": []}, {"body": "I’d throw in TMF since you are comfortable with the leveraged etfs.", "score": 1, "replies": []}, {"body": "DKNG", "score": 0, "replies": []}]}
{"title": "Looking for a calculator that will tell you the current value of stock purchased decades ago", "selftext": "This calculator must be able to look up its historical price as well as account for any splits since then.\n\nExample: I purchased 1000 shares of MSFT in 2001. The calculator will know that I purchased for roughly $31/share. It has split once since then 2:1. This means I now have 2000 shares. Today it trades for $293/share. So my 1000 shares from 2001 valued at $31000 is now worth $586000. \n\nBut I want a simple calculator to do this for me without having me do all the research.", "id": "p40yqz", "created_utc": 1628913568.0, "score": 15, "upvote_ratio": 0.79, "num_comments": 27, "comments": [{"body": "If you make one. You’ll profit", "score": 27, "replies": [{"body": "It definitely exists somewhere unless it’s just a thing where everyone assumes someone already made it so no one actually tried", "score": 12, "replies": [{"body": "Well if you find it lmk", "score": 3, "replies": [{"body": "I’d gladly pay an annual fee for this service.", "score": 5, "replies": [{"body": "How much?", "score": 0, "replies": []}]}]}, {"body": "This is my exact point. It has to exist somewhere", "score": 1, "replies": []}]}]}, {"body": "Can I suggest that you also post this on another subreddit - one about learning computer programming?  I'm learning programming (just started) now and I see there lots of people who have learned to program already but they need a small project to get better.  They just might take up the challenge.", "score": 6, "replies": [{"body": "True but it seems like such a basic thing that one should already exist. If I wanted I could easily build one in excel. It’s really basic algebra and yahoo has all the data for free.", "score": -7, "replies": []}]}, {"body": "This may be close, but I think it assumes you reinvest your dividends, which you did not mention. [https://dqydj.com/stock-return-calculator/](https://dqydj.com/stock-return-calculator/)\n\nBut splits are supposed to be taken into account, unless they split very recently.", "score": 4, "replies": []}, {"body": "Microsoft has one at https://www.microsoft.com/en-us/Investor/stock-calc.aspx\n\nBut of course it works only for MSFT.", "score": 3, "replies": []}, {"body": "Well if you now how much money you invest into the stock you could put into PORTFOLIO VISUALIZER's back testing. It will also calculator dividends. You can't pick the exact day though just the year unfortunately. Also your brokerage should have it all on file so they can report it the the IRS for taxes. Might be worth it to just ask them", "score": 3, "replies": []}, {"body": "Ask Elizabeth Warren", "score": 2, "replies": []}, {"body": "Just look at the adjusted close prices,  that accounts for dividends,  splits,  etc.  Yahoo finance is one option.", "score": 3, "replies": []}, {"body": "Ummmm doesn’t the internet tell you the current value of the stock and then you just use a regular calculator to multiply your number of shares by the current value?\nEdited to be slightly less smug.", "score": 0, "replies": [{"body": "No need to be a smug jerk", "score": 5, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "But what’s there to do? If you know how many shares you have, just multiply it by the current value. It’s not like the stock splits and you never know about it. They contact you and adjust your shares! I think either I’m confused or OP is really overthinking this.", "score": 2, "replies": []}]}, {"body": "It doesn't factor in stock splits", "score": 1, "replies": []}]}, {"body": "You can add your holdings to Yahoo Finance", "score": 1, "replies": []}, {"body": "Have you tried Fastgraph? It's not free", "score": 1, "replies": []}, {"body": "How much are you willing to pay?", "score": 1, "replies": [{"body": "I shouldn’t have to pay it’s a pretty simple calculation I just don’t end to have to be putting each historical data point from yahoo", "score": -3, "replies": [{"body": "Well then write a program to do it your self. Scraping financial data from a program is not free like when you go to a website as a user.", "score": 3, "replies": [{"body": "Computer is broken and only  have my cellphone. Web scraping is pretty simple now and it’s not even that, yahoo literally gives you the clean data connection for free.", "score": -6, "replies": [{"body": "No it doesn't there api cost money last time I looked you could scrape once or twice before you are blocked. You don't know what you are talking about.", "score": 2, "replies": []}]}]}]}]}, {"body": "Probably not what you meant, but your question literally describes the stock market quotations in any newspaper or financial website, no?", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Thanks", "score": 1, "replies": []}]}, {"body": "[https://dqydj.com/stock-return-calculator/](https://dqydj.com/stock-return-calculator/)\n\nThis isn't what you're talking about? I usually use it for kind of the same thing.", "score": 1, "replies": []}]}
{"title": "Would you rather own a small number of Amazon/Google stocks or all-in VTI/VOO?", "selftext": "Let's say you had a choice between holding for a decade 2 Amazon stocks OR 4 Google (alphabet) stocks OR 25 VTI (or 15 voo if you prefer that), what would you choose? Keep in mind that is with DRIP enabled - not that DRIP matters for Amazon/Google.\n\nI don't want advice, but to figure out where people stand. I argue with myself and others over this so I would be curious to hear others. It's essentially a question of focus vs diversification, and I realize that people have different views.", "id": "p41g50", "created_utc": 1628915632.0, "score": 6, "upvote_ratio": 0.66, "num_comments": 19, "comments": [{"body": "All in both VTI and VOO. Sure, if I have extra cash, AMZN and GOOGL are good picks for individual stocks.", "score": 20, "replies": []}, {"body": "Hard to say. Right now google and Amazon have been around for a while now. The question is how much more growth is in their future? Will there be regulatory risks? My portfolio consists of google and Microsoft, some QQQ, and the majority in SPY. \n\nIdeally I could sell google and Microsoft in the near future if some of the fundamentals change, but you can always hold SPY and QQQ, because the stock mix in those ETFs will change automatically over time.", "score": 9, "replies": []}, {"body": "VOO is safer but GOOGL still seems undervalued right now with huge growth still to come.", "score": 8, "replies": []}, {"body": "25 VTI", "score": 5, "replies": []}, {"body": "As Roger Gibson wrote in his excellent book, \"Asset Allocation\", \"Diversification means always being unhappy.  You will always wish you held more of the winners and less of the losers\".  That quote will answer why you are struggling with finding the answer.  Once someone decides to diversify you are GUARANTEEING you will not hold outperform someone out there who will be holding the next Amazon/ Google stocks in the next 20 years.  The reason to do it is making sure you don't hold the next IBM/ sears/ kodak/ Amercan express/ etc....", "score": 2, "replies": [{"body": "yes but with sp500 you own ALL of the growth companies too, when you pick yourself yourself you may not pick the right growth company that may not succeed, for every amazon/google there is 10 that fail. (just look at dotcom or car era in the 1970s)", "score": 1, "replies": [{"body": "Agreed thus the hold the losers with the winner remark above.  What folks don't realize is about 5% of the index is responsible for ALL the gains of the index each year.  So one can decrease the volatility to near the index by adding 20-40+ stocks of the same type, but the issue is one would still lag the index over any extended period of time since missing out of the best 5% stocks each year would seriously lag long term returns as compared to its index.  \n\nBeebower/ hood/ brinson and the followup beebower/ singler/ hood seminal articles proves the fallacy of individual stock investing.  It looked at the top ?100 or so pension fund managers in the U.S. (means they access to the best research/ minds/ tech) and looked at the returns over 10 year period.  The second article was a follow up period over the next 10 year period to make sure it wasn't a fluke.  The results:  The alpha generated by the pension fund managers was NEGATIVE for security selection (picking stocks) AND market timing (getting in and out based on whatever valuation metrics they like to use).  That means they SUBTRACTED from the returns even without getting into Loads/ ER/ transaction costs/ taxes/ etc...", "score": 1, "replies": []}]}]}, {"body": "I have both 😂", "score": 2, "replies": []}, {"body": "Vti", "score": 2, "replies": []}, {"body": "For the passive person it's the ETFs. For the actually be they'd probably want Google, AMZN isn't too hot atm.", "score": 1, "replies": []}, {"body": "In this case, I'd rather pick VTI/VOO over those particular 2.\n\nIf it was AAPL/MSFT vs. the index on the other hand, I'd go with the 2 stocks.", "score": 0, "replies": []}, {"body": "In this case - VOO", "score": 1, "replies": []}, {"body": "VTI and VOO are safer, but won’t go 50% any year like AMZN and GOOG", "score": 1, "replies": []}, {"body": "With fractional trading, each share can be broken down into tiny numbers. Number of shares no longer matters anymore.\n\nYes I have 1 share of Amazon, but I also have 1000 shares of (Amazon*0.001).", "score": 1, "replies": [{"body": "I'd love to be able to sell covered calls on it though, too bad you need a small fortune to do that", "score": 1, "replies": []}]}, {"body": "My situation is similar to you. I only have stocks in 6 companies  and I doubt to add VTI or VOO... \n- Apple\n- Alphabet\n- Adobe\n- Microsoft \n- Nvidia\n- Paypal\n\nAny suggestions?", "score": 1, "replies": [{"body": "Those are great companies. All of them. I think you are in a great position - I would recommend adding a bank stock (I'm big on Bank of America based on fundamentals). You could probably add a small amount of clean energy etf for long-term play (I have ICLN). Keep in mind that you have to pay attention to stocks - you might have to sell a company down the road. There is no guarantee all of these companies are still good stocks to have in 10yrs. Case: IBM was spectacular in the 80s/90s (arguably a top 5 stock to own), but they are not anywhere close today.\n\nIf you can afford it, VTI/VOO are great long-term holds. If you decide to add VTI or VOO, I would recommend VTI because it gives you some midcaps and smallcaps too. This you would probably never sell unless if you need the money down the road.", "score": 1, "replies": [{"body": "Thanks!\nI know I have to add some no tech stock to my portfolio for diversification. VTI is in my mind for the last 6 months.", "score": 1, "replies": []}]}]}, {"body": "Number of shares doesn't matter what so ever. Just $ amounts.\n\nI'd own VTI. You get nice exposure to both Amazon and Alphabet, but with great high performing diversification.\n\nEasy.", "score": 1, "replies": []}]}
{"title": "Why is Apple considered a technology company?", "selftext": "The majority of its revenue comes from hardware sales (iPhone, iPad , Macs, others). Shouldn't it be considered consumer cyclical or industrial?\n\nYou could argue about their other services, app store or \"innovation\" which is debatable. But still, other companies like Amazon for example, do offer services like AWS, Prime Video, Prime gaming, Ads and so on, but since it's largest chunk of revenue comes from online retail, they are considered a consumer cyclical company.\n\nThoughts?", "id": "p4f1z0", "created_utc": 1628971447.0, "score": 0, "upvote_ratio": 0.24, "num_comments": 23, "comments": [{"body": "Because they design their own hardware and operating systems.\n\nThe reason people buy the hardware is the software on it. \n\nAre Samsung, LG, Phillips, Sony etc not classed as tech companies? Of course they are.\n\nThis is a bonkers post, Apple are without a doubt a technology company.", "score": 26, "replies": [{"body": "Why is Google on communications and not Tech though? They make their own devices and software. Why is PayPal on Financials and not Tech if the reason people use it is the software they developed?\n\nI expect the post to be downvoted because people take things for granted. \"They make phones and software themselves, they should be tech\".\n\nTesla makes cars and it's own software, and they're very innovative, yet not classified as tech.", "score": 2, "replies": [{"body": "MSCI - the company/organization that decides puts them in \"internet services\" which is in that category. Amazon is put in \"ecommerce\" same with tesla in \"autos\" blame that company MSCI. but apple is a tech company, they sell hardware and software that is technology", "score": 3, "replies": [{"body": "Yeah well, since I most probably won't be able to get a response from them, that's why I ask here. I wonder what's the difference in the criteria. Like Apple, Google sells hardware and software but it's not included in the tech sector. Not saying one or the other belongs or not, just asking why the difference in classification. With so much experience in the industry, one would think MSCI has good reasons to do so", "score": -1, "replies": []}]}, {"body": "PayPal is an online financial service, Google don’t make any hardware.\n\nGoogle brand hardware.\n\nAlso who’s definitions are you using? TSLA, GOOG, AMZN, FB and AAPL are all listed as tech on my brokerage.", "score": 1, "replies": [{"body": "Both MSCI, Moody's and even websites like Finviz", "score": 1, "replies": []}]}, {"body": "You are thinking about this backwards.\n\n\"tech\" isn't a sector anymore. That's a joke. In this age, that's like calling \"good business strategy\" a sector.\n\nCompanies are tech because they build technology. In the coming 10 years, companies that do not build technology simply fails.\n\nApple is a consumer electronics company, but their tech is so superior to many competitors in consumer electronics that they aren't playing the same game. They build technology, thus \"tech\".", "score": 1, "replies": [{"body": "It's true, however companies that have arguably developed leading technologies such as Amazon with AWS, Prime Video, Alexa, or Tesla with self driving cars are still not tracked by technology funds like VGT or XLK because the companies are not classified into \"tech\".", "score": 1, "replies": [{"body": "That is just further showing how irrelevant the market of \"tech\" is.\n\nIn 10 years, the S&P500 will be \"tech\" as its innovate or die. It's the real world.", "score": 1, "replies": []}]}]}]}]}, {"body": "I'd argue the other way, that AMZN is a tech company and not a consumer cyclical. That classification was probably made when they first IPO'd and were only selling books online.", "score": 8, "replies": []}, {"body": "Technology is a very vast industry. Apple belongs there too, as they make consumer electronics and other technology orientated services.", "score": 5, "replies": []}, {"body": "They have created their own technology, no?", "score": 5, "replies": []}, {"body": "They were looked upon on the market like this until they proved they are not dependent on iPhone alone. Their PE ratio history proves that. They're technology company though, not going to write out obvious things.", "score": 2, "replies": [{"body": "https://www.investopedia.com/terms/t/technology_sector.asp https://www.nasdaq.com/market-activity/stocks/aapl this answers everything too", "score": 1, "replies": []}]}, {"body": "being a tech company means you cant sell hardware", "score": 2, "replies": []}, {"body": "Cuz it’s tech? Lmfaoooo", "score": 0, "replies": []}, {"body": ">The majority of its revenue comes from hardware sales (iPhone, iPad , Macs, others). Shouldn't it be considered consumer cyclical or industrial?\n\nthey make the majority of revenue from selling handheld supercomputers, not from selling clothes or industrial chemicals.", "score": 0, "replies": []}, {"body": ">but since it’s largest chunk of revenue comes from online retail, they are considered a consumer cyclical company. \n\nThat’s not what a consumer cyclical is…\n\nA consumer cyclical is a company that is affected by changes in the economic cycle. Steel and other building material stocks are a great example of this. \n\nPeople buy Apple products regardless of what the economy is doing.", "score": 1, "replies": [{"body": "Isn't online retail dependent on the economic cycle? \"Consumer cyclicals include industries such as automotive, housing, entertainment, and retail\" - From Investopedia", "score": 1, "replies": []}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "p411kp", "created_utc": 1628913877.0, "score": 0, "upvote_ratio": 0.22, "num_comments": 22, "comments": [{"body": "Wtd did i just read...", "score": 13, "replies": [{"body": "Idk what is more retarded. Thinking wish is a long term play or his pmcc strategy.", "score": 6, "replies": []}]}, {"body": "> I shall be the next DFV…\n\nExcept DFV was smart. Maybe work on that first.", "score": 14, "replies": [{"body": "Minor quibble but I did not like the past tense \"was\"", "score": 1, "replies": [{"body": "“did not” … how do you feel about it now?\n\nI did think about whether to was/is though. Didn’t want to imply he was dead, but he definitely seems to have decided against remaining a public figure, so that episode may be his one hit wonder. And, I mean, how do you follow that? Netting 10 baggers on cyclicals isn’t going to have the same excitement after his GME play.", "score": 2, "replies": []}]}]}, {"body": "Is this the best and most meta trading sub shitpost ever? Bc there’s no way this is real", "score": 8, "replies": [{"body": "You don’t think OP can be this dumb? Come on, give him some credit...he’s trying...lol.", "score": 4, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "It seems like you jumped back in with the goal of either making or losing as much money you could in as little time as possible, and in as many different ways you could.. and now you’re posting here, where I literally am just exploring got the first time but I can already understand that it’s a generally more conservative approach\n\nThe biggest thing is you say you can’t from a low income background. Me too and idk how I could possibly do what you describe without vomiting lol", "score": 4, "replies": []}]}]}, {"body": "Cocaine is a helluva drug.", "score": 7, "replies": []}, {"body": "Is this the shitposting section of wsb?", "score": 3, "replies": []}, {"body": "Bro I’m genuinely worried for you. \n\nSeriously…like you’re trying to make money too fast, and we all have been there and know how that ends.\n\nYou really SHOULD focus on paying back the loans so you eliminate debt and then trade.\n\nBut if you’re already down, can’t go back, and need a YOLO…the markets are about to get very spicy after next week.\n\nI would be a buyer of vol not short it. \n\nAlso UPST is a kingmaker stock, don’t lose money playing memes.\n\nAlso always play debit spreads, it’s just the safer way and if you get lucky, you get in and it pulls back so you can sell the short side for a win and then price goes in your favor so you get to double dip. Choose narrower strikes.\n\nI play narrower atm strikes with the intention to leg out of the short side if possible", "score": 2, "replies": []}, {"body": "> I shall be the next DFV.\n\n[starts out with an empty sap story instead of numbers]  Nope you will not. \n\n\n> True hu$tlers live forever....\n\nRIP", "score": 2, "replies": []}, {"body": "Too much greed is a killer. You should try to stay away from debt, margin and options. Perhaps, only buy ETF like QQQ, SPY, and VOO.", "score": 2, "replies": []}, {"body": "Look at investing in a different way, there is a thin line in investing and gambling, bro you are gambling. \n\nFirst advise I would give you is read trading books, and master your craft before you start to use all your money in real markets. \nYou need to step back and take a good look at yourself and look at your decisions. \n\nTrading is all about psychology and you are in the wrong path my friend. \n\nRead the book Trading in the zone \nIt will give you guidance on your path as a trader. \n\nThere are ways to make a lot of money doing this business but you need to learn how to become consistent. \n\nGood luck", "score": 2, "replies": []}, {"body": "Dude, you are a mess.  I feel for you.  You are not where you think you are.  Get help!", "score": 2, "replies": []}, {"body": "[deleted]", "score": -4, "replies": [{"body": "Bro you’re gonna be homeless", "score": 2, "replies": []}, {"body": "So let me get this straight.\n\nYou lost 80k of your own money (35k of which was cash loans from credit cards) and now you are down an additional 37k against another 70k worth of personal loans?\n\nTwo questions: What part of this is 'hustlin' and who the fuck in their right mind keeps loaning you monies?\n\nThey would be better served putting that cash into a shoebox and lighting it on fire.", "score": 2, "replies": []}, {"body": "Hustlers make money, not gamble with high interest personal loans…. You should have bought a classic car or something.", "score": 1, "replies": []}]}, {"body": "Well this makes me feel better about my returns, thank you.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}, {"body": "I admire your enthusiasm.", "score": 1, "replies": []}, {"body": "Go get ‘em Gordon Gecko!", "score": 1, "replies": []}, {"body": "I couldnt read all that… \nSo first do a OTM short put for your theta, then do a otm call for your WSB.", "score": 1, "replies": []}]}
{"title": "Peeping UWMC or PLTR for next wheel. Thoughts?", "selftext": "Depending on PM Monday, if I can get in low 8 high 7’s on UWMC I’m def buying a couple thousand and selling calls. PLTR had a pretty massive run from earnings and as well all know usually sell off after. CSP has shit premiums for PLTR so I might try to get in 22.5-23. Any input greatly appreciated OR a better option than both.", "id": "p491yf", "created_utc": 1628951463.0, "score": 15, "upvote_ratio": 0.82, "num_comments": 25, "comments": [{"body": "UWMC is my pick due to the divy. If you need to hold for long term on a share price drop at least you will get paid.", "score": 6, "replies": []}, {"body": "PLTR because it has weeklies. More volatile which is good for trading.", "score": 8, "replies": []}, {"body": "I trimmed my UWMC position Friday on the small run up. I had -40 8/20 puts at 7.5 and 9 strikes and  took some of the profit on the 9’s. Now -20 puts. Still have +1000 shares but my gut tells me that if / when it hits 10-12 a ton of bagholders are gonna unload. Just my take, I’ll also likely unload as CC premiums have been garbage all the time I’ve been holding the 1000. Ironically, I just got out of PLTR on the earnings run up. I don’t have an alternative play, but I’ll be watching this thread since I am literally exiting the two positions you are asking advice on! Good Luck either way!", "score": 4, "replies": [{"body": "CNK may be a good play. It is suffering from the Covid resurgence, but a solid company. Recent target of $18 from some analyst. But it only has monthly’s. X could also be a good play, they’ve had a recent surge so could be a good CSP target.", "score": 1, "replies": [{"body": "X sure is a volatile one. I bought in at 25, lost faith and sold a 25 call when it was like 21.xx and now it's way ITM.", "score": 1, "replies": []}]}]}, {"body": "IMO both tickers are backbone positions, meaning buy shares and hold, and don't be eager when you do buy shares.  I have 1000 UWMC at a cost basis near 7, and almost 1000 PLTR at a cost basis near 22.  If the share price moves below my basis I'll try to add another 500 of each.  However, if UWMC runs to 12 or PLTR breaks 30 before EOY I'll sell both and look to re-enter lower.\n\nI don't think buying or selling options on either are good plays, they just behave bizarrely and the premium isn't worth the risk.  I may sell puts at the 7&22 level to acquire shares, but not to wheel.", "score": 2, "replies": []}, {"body": "UWMC will bounce heavily back in Q4. Right now IV isn’t worth the risk.", "score": 2, "replies": []}, {"body": "Only between those two, I'd pick PLTR all day. I was a former RKT trader (UWMC competitor) and UWMC didn't have good vibes when I read their 10K and 10Q back in the day....plus I ultimately dislike SPACs.", "score": 2, "replies": [{"body": "SPACS are wack", "score": 1, "replies": []}]}, {"body": "UWMC had monthly options at 9 for 10 bucks  \n10 measly bucks  \n\n\nThe IV is too low when the stock isn't being hyped by WSB and depending on your entry point is a very heavy bag to carry.   \nNot an ideal wheeling stock at all", "score": 6, "replies": [{"body": "LOL, those options expire in 5 days and are 15% OTM :-P\n\nIts a 5% div stock with an IV of 60 for long dated expirations! \n\nWith this type of stock you can sell the 10$ Jan23 calls for that pay out 17% of the stock price, you will also get a fat 5% div, and there is 35% room for cap gains before assignment (all of which gets long term taxes).", "score": 9, "replies": []}, {"body": "You’re very right, thank you.", "score": 2, "replies": []}]}, {"body": "PLTR will drop. As it always does. I'd avoid it for CSP right now after the pop", "score": 6, "replies": [{"body": "CSP would be almost impossible to predict and I have a feeling it’ll hit low 22’s at least a\nand the premium for those is horseshit. Thank you . I’ll sit on my hands", "score": 1, "replies": [{"body": "Premium is indeed horseshit. Tried a csp had to go out to nov just to collect a measly 1.02. Probably just going to close early at 62% gain and look elsewhere. Also own 100 shares but calls aren’t worth crap so selling cc is pointless.", "score": 1, "replies": []}]}]}, {"body": "I am playing PLTR from the wheel and PMCC. The premium for weeklies is low. But my PMCC is making me $50-$100 a month as a synthetic dividend. Not bad for $2500 worth of leaps.", "score": 3, "replies": []}, {"body": "I have a PMCC on PLTR. Shot past my short strike, but still have a month to go.\n\nI think it's good as long as it doesn't tank like FCEL did me.", "score": 1, "replies": []}, {"body": "I would hold off wheeling until you see a dip to the 22 or 21.50 area. \n\nI sell 19p usually 35 DTE, PLTR\n\nTry to do it on days with 50 cent + moves to the downside, works all the time.", "score": 0, "replies": [{"body": "Very interesting. I’ll look into this", "score": 1, "replies": []}]}, {"body": "Like many others mentioned, wait for a pullback for PLTR, it's always trading between the 21-24 channel for the price trend, it doesn't not seem to stay past 25, usually for swing traders to take their profit and unload their bags.\n\nIt's definitely a perfect theta stock based on the past trend.", "score": 0, "replies": []}, {"body": "Yeah PLTR coming back at least $20-21", "score": -2, "replies": []}, {"body": "consider athx, super low share price but decent amount of risk taken off recently?", "score": 1, "replies": []}, {"body": "$9 Jan puts on UWMC", "score": 1, "replies": [{"body": "Decided to play safe bought at 7 sold at 7.4 nice few hundred bucks", "score": 2, "replies": []}]}, {"body": "I have doubts on PLTR. Their last quarter's statement showed they lose $0.50 on every $1.00 of revenue. They've burned through 75% of every dollar invested into it by backers.\n\nProducts and services are very popular when they're handed out for free, and competitors can't really compete with charity for the sake of growth. I'm not sold that either they'll make it or they'll produce profits comparable to other companies if they survive and start producing income", "score": 1, "replies": []}]}
{"title": "190c 9/17 $DIS", "selftext": "", "id": "p3y7f3", "created_utc": 1628902518.0, "score": 22, "upvote_ratio": 0.74, "num_comments": 21, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|1|**First Seen In WSB**|5 months ago\n**Total Comments**|5|**Previous DD**|\n**Account Age**|6 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "I just sold mine 9/17 180Cs for 100% gains.", "score": 13, "replies": [{"body": "At open?", "score": 1, "replies": [{"body": "Yeah.", "score": 6, "replies": []}]}]}, {"body": "Disney is a long play like miss Saigon or les mis.  Shares shares shares and fuck the bears (except pooh)", "score": 6, "replies": []}, {"body": "when did you buy those? at open today?", "score": 5, "replies": [{"body": "Looks like it", "score": 1, "replies": []}]}, {"body": "I got 100 of these and now down like 30%; naked and afraid now 😕😕😕", "score": 3, "replies": []}, {"body": "had the 180s luckily i it hit my limit at the open ($10) was able to sell half, other half finished down too.", "score": 2, "replies": []}, {"body": "Sitting with 5 - 8/20 $185 and 25 10/17 $201. Let's go mickey", "score": 2, "replies": []}, {"body": "Vix going up will help u", "score": 2, "replies": []}, {"body": "$dis dick", "score": 1, "replies": []}, {"body": "What did you end up doing with this?", "score": 1, "replies": []}]}
{"title": "BlackBerry to partnered with Amazon 🚀🚀🚀", "selftext": "", "id": "p4eemz", "created_utc": 1628969237.0, "score": 61, "upvote_ratio": 0.77, "num_comments": 29, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|3|**First Seen In WSB**|6 months ago\n**Total Comments**|26|**Previous DD**|\n**Account Age**|6 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20*h26cq3k*)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)", "score": 1, "replies": []}, {"body": "Priced in… this is old news https://investorplace.com/2021/02/bb-stock-amazon-partnership-massive/", "score": 36, "replies": [{"body": "Hahaha old ass news. If you’re investing in BB and don’t know about this partnership then yikes.", "score": 21, "replies": [{"body": "Move over everybody Mr. Big Shot “I actually research the stocks I own” coming through ...please 👉🏼🪑", "score": 17, "replies": []}, {"body": "I hear McDonald's is going to start selling Coca-Cola products!", "score": 5, "replies": [{"body": "And they're making a 20pc nugget!", "score": 2, "replies": []}, {"body": "The CEO of McDonalds is actually my neighbor and the other night I was just happened to be sitting outside her window in the bushes and I overheard Pepsi is going to close the deal, obviously not public knowledge yet so load up on PepsiCo 220c 9/3 while you can", "score": 2, "replies": [{"body": "Meta AF.\n\nYoloing RC Cola.", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": -10, "replies": [{"body": "Let me rephrase anyone who was going to buy and hold based on this news… already has… if they haven’t might be more productive to put their money elsewhere until there’s more (new) information on how much revenue this will actually generate.", "score": 2, "replies": [{"body": "So... Priced in", "score": 3, "replies": [{"body": "Yup lol", "score": 3, "replies": []}]}, {"body": "I'm still in BB shares but only because I can sell CC every week and take in some money and they have paid for themselves almost 2 times now.  I just keep selling them and they just keep floating and it's fine.  Anyone buying in is way behind the curve as that started 9 months to a year ago.", "score": 1, "replies": [{"body": "Yea that makes sense. Not knocking anyone for holding by any means. Just clarifying this is old news and would already be factored in... most likely not going to cause any near term increases.", "score": 2, "replies": [{"body": "Ya for sure, it can only help if earnings at some point are helped tremendously by this and that would be a ways away and  much of WSB is doing FDs and so a ways away is not all that helpful with next week.\n\nI do accept the donations every week.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "So what I’m hearing are BB leaps", "score": 7, "replies": [{"body": "Based on news from… last February?", "score": 6, "replies": [{"body": "Yeah but OP is the only one that read the article , market makers haven’t gotten around to it yet", "score": 2, "replies": []}]}]}, {"body": "Long term hold.", "score": 9, "replies": [{"body": "I wish it would be on my own terms tho", "score": 6, "replies": []}]}, {"body": "BB skeet skeet", "score": 4, "replies": []}, {"body": "One very key take away is the never previously mentioned analogy between Tesla and QNX/IVY.   \nTo paraphrase -\n\n '***Tesla currently has less that 2 million cars on the road, Blackberry's operating system \\[QNX\\], which IVY builds on, is imbeded in nearly 100 times more vehicles***'", "score": 1, "replies": []}, {"body": "Is this a catalyst or random news?", "score": 1, "replies": [{"body": "priced in or dropping on good news as is our proud tradition", "score": 5, "replies": []}, {"body": "this is old news from last february", "score": 1, "replies": []}]}, {"body": "News posts **must be market moving** and contain **new** information. Please avoid editorializing the title. \n\nIf your post doesn't meet the requirements above, please delete the thread before a mod sees it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}, {"body": "$11+ open \n\nPls 😭", "score": 0, "replies": [{"body": "They do make a decent run up every two to three months but I doubt that is Monday.  If it is the CC I sell will do well.", "score": 1, "replies": []}]}]}
