{"title": "An analysis of a potential Berkshire Hathaway rival", "selftext": "Berkshire Hathaway has dominated the market for holding companies for a long time. However, over the years, smaller and more exciting holding companies have emerged with refreshing new approaches. These small holding companies could seriously become something huge in the future. One play I'm looking at is MBHCF, a holding company which began in 2016 that is actively building a portfolio of profitable, earnings accretive, debt-free small to medium enterprises (SME) that are expected to have a higher-than-normal growth profile as part of a larger organization. The company's operating model leaves management of the acquired companies to operate autonomously and fully accountable to develop and grow their businesses.\n\n&#x200B;\n\n**PROS:**\n\n***Strong financials***\n\nThe company has a strong and competitive P/e ratio of 8 (TTM), revenue growth of 19% (from 2019A to 2020A) and gross margin of 20.9% (from 2019A to 2020A). P/b ratio is also healthy at about 0.3. They have produced surprisingly promising numbers despite the hit taken from Covid-19.\n\n***Dividends***\n\nThe company ended the year in profit despite being heavily disrupted by the Covid-19 virus. The dividend is paid out at $0.0059 per share, which is about 2% of the current share price.\n\n***Diversification***\n\nThe company has completed a total of 26 acquisitions so far, with 12 acquisitions in 2020 alone. The rate at which MBH is acquiring companies is impressive, and the acquired companies have very high profitability.\n\n***Small market cap***\n\nWith a market cap of just over 20M USD, there is huge growth potential for this company as it continues with its expansion model. Small cap stocks have historically produced greater annual returns than mid-cap and large-cap stocks due to greater growth potential and better returns in the long term.\n\n***Bullish estimates***\n\nAnalysts suggest that it could have a price target of $10 based on its financials and projected estimates, resulting in an upside of over 3000%.\n\nHere’s a link to the analyst report:\n\n[https://www.otcmarkets.com/stock/MBHCF/news/BUY-RATING-FOR-MBH-CORPORATION-PLC-AT-10-PRICE-TARGET?id=302215](https://www.otcmarkets.com/stock/MBHCF/news/BUY-RATING-FOR-MBH-CORPORATION-PLC-AT-10-PRICE-TARGET?id=302215)\n\nHowever, there are still things to consider when looking into such a stock. Here are some things I’m thinking about.\n\n&#x200B;\n\n**RISKS:**\n\n***Dilution of shares***\n\nThe total number of shares outstanding amounted to 70.5M at the end of 2020, up from 39.2M at the end of 2019. Dilution of shares is always a concern as it lowers the EPS. However, it is important to note that the extra shares were issued as payment to acquire companies, so this could very well be a strategic move if these acquisitions generate sufficient profit for MBH. Future profits could also be used to buy back shares to improve EPS.\n\n***Some concerning metrics***\n\nEBITDA and net income growth have fallen about 67% and 63% respectively in 2020 compared to 2019. Much of this is attributed to possible disruptions due to the pandemic and also the fact that the company is still relatively new and growing.\n\n***Uncertainty about post-Covid situation***\n\nWe all know how disruptive the Covid-19 situation is, especially to small businesses. It’s not certain if all companies are able to bounce back and operate at their full potential. As such, being an acquisition company, MBH is open to the risk of underperforming if their acquired companies face difficulty in recovering from the situation.\n\nIn conclusion, micro-caps are often risky. Whether you enter a position in this stock or not depends on how much you believe in the expansion model and future profitability of MBH. Personally, I believe it's a risk worth taking because of its prospects and financials. Going long term on this seems to be a decent play. What do y’all think?", "id": "ozvfw9", "created_utc": 1628350482.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 21, "comments": [{"body": "[deleted]", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Firstly, I apologize for misleading you or any other viewers of this post. When I say \"Berkshire Hathaway rival\", all I really meant was that this could take off the way Berkshire did, and since both are holding companies, I conveniently went with the phrase; like you said, the only competition here is for investors. MBH is not a mini Berkshire Hathaway - there are inherent differences in acquisitions and approach. This was really just a DD on a small acquisition company which could be, not definitely, but COULD be one as notable as Berkshire in the future. It is not a comparison post between MBH and Berkshire because I too recognize that the two are fundamentally different.\r  \n\r  \nSecondly, this is a company that just started in 2016, and 2020 was its only bad year because of disruption from Covid-19. Are you going to bash a new company for one bad year of earnings? Growth can definitely still be projected even if the company struggles to start well initially, and with such a huge disruption in 2020, it can be understood that the company struggles a little more. Listing out the pros and cons of something isn't the same as contradiction. Price is expected to go up IF the company and its acquisitions recover strongly from the pandemic's disruption (and this, of course, would mean that EBITDA and all other relevant metrics would slowly improve, and that it is possible that MBH starts buying back shares to protect their investors). Using a current metric to justify why the future is equally bleak in these circumstances is a little one-dimensional, don't you think? If your kid does badly for his first or second test because he was down with a fever, are you right to say that he'll definitely not do better in the future? The bull case for MBH is by no means a certainty, and there is a flip side to it which I have addressed as well.\r  \n\r  \n\"As such, being an acquisition company, MBH is open to the risk of underperforming if their acquired companies face difficulty in recovering from the situation.\"\r  \n\r  \nAlso, share dilution is actually not uncommon for holding companies just starting out, as shares can be issued as payment to complete the acquisition so the company can hold on to more cash. It could be strategic. Not that it definitely will be, but it could be. I've addressed this in the post as well.\r  \n\r  \nThere is considerable risk in this play and I acknowledge it fully. I'm not here to promote this company or force anyone to buy it. It's just a balanced evaluation of a small holding company, and you make it sound like I'm trying to preach that it's better than Berkshire Hathaway, or that it will become Berkshire Hathaway in the future.", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "It seems a big problem here is the comparison with BH. I will concede: MBHC is different from BH, and the two, like you said, are apples and oranges that shouldn't be directly compared with each other. This post is meant to be a DD about a small holding company which could be selling at a discount. Apart from the name, I have not included any analysis with regard to how this company is similar to BH because the two are fundamentally different; like you said, one is a safe model and the other is very risky. In retrospect, I probably shouldn't have included BH in the title if I wasn't going to compare the two companies, or I should have clarified somewhere in the post that this isn't meant to be a comparison of any sort.\n\nThe model of MBHC is inherently riskier than BH, and it is definitely concerning that certain metrics are declining. Can the company pick up and turn things around? That's not a question either of us can answer. I do have my own personal concerns when it comes to this play, which is why I am putting it on my radar for the time-being. I'm seeing if the numbers in 2021 and 2022 show that this EBITDA decline was a one-off, or if it was truly indicative of fundamental weakness. Call me forgiving, but I'd prefer to wait it out to see if it was truly the disruption from the pandemic that led to this sudden fall in EBITDA. That being said, revenue is still up from last year by about 19%. Revenue growth is still on an upward trend, so I wouldn't write it off just yet.\n\nOnce again, I have to reiterate: I respect Buffett and everything he's done with BH. The approach he took to grow this holding company into the most prominent one in the world is still unrivaled. It would be inappropriate to directly compare any holding company's model to that of BH. \n\nInvesting includes minimizing risk, and that is fairly true. However, there is a significant proportion of investors who prefer putting a small amount of money they can afford to lose into riskier plays. These riskier plays include penny stocks, microcap stocks, OTC stocks etc. which have more upside potential percentage-wise but of course, weaker financials and fundamentals at the moment. MBHC happens to fall into this category and I am merely evaluating if this is worth taking a calculated risk for. I hope the fact that I mentioned BH in this post is not taken personally; I care more about the numbers and the prospect alone for this particular company than any kind of comparison with BH. Hopefully I cleared that up.\n\nThat being said, thank you for your valuable input. I do feel more educated about holding companies and will definitely take note of more details when analyzing MBHC.", "score": 1, "replies": []}, {"body": "I understand that there are still considerable risks that you do not find worthwhile taking, however I think there are still valid points the OP mentioned that deserved some credits.   \n\n\nFrom its stock price and some readings I've done, it is clear that BH seems like a stock with greater potential and stability. In this regard, it is clear MBHCF's acquisition of different companies seem like a dwarf-like comparison. However, I think we can still consider the  fact that their company acquisition types varies across different industries - this may be something to look into as it seems to have a greater welding potential.   \n\n\nHowever flawed an analysis, I think we have to try to keep our minds open and watch a stock grow and learn from it!", "score": 0, "replies": []}]}, {"body": "I think nonetheless there are still credits to your argument. I think underperformance and covid-borne financial soil has made economical growth stiff. In some ways, MBHCF's strategies and growth models were proven effective regardless the quality of the outcome.   \n\n\nI get that investing in MBHCF sounds like a big risk as compared to the 'safer' stocks, but I guess we can all try to expand on our reading and let time prove the worth of MBHCF?", "score": 1, "replies": [{"body": "I agree. Time will tell if this company takes off like it should in the future. I agree that despite the implications of Covid-19, the company is still showing promising signs of growth. Let's see how this plays out in the future!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Annual dividend paid once/year - 2%: non-starter.  Price 28 cents and that is the lowest it has been in 5 years: non-starter.  Average volume - 3K - 5K/day - Red flag.  From Yahoo finance: \"It offers vocational training to early year sectors, as well as health, social, management, beauty, and sports education sectors; educational software solutions; commercial interior fit-out and construction contractor services; and aged care residential and taxi services.\"  Huge red flag all businesses that can have their customers shut down their subscription immeadiately.  \n\n Hit 4 big problems for me in 5 minutes work.", "score": 3, "replies": [{"body": "Nicely done. Not to mention that if I have to go to multiple places just to find accurate company financial data, that’s a HUGE red flag for me.", "score": 2, "replies": [{"body": "This I agree a little more. Would prefer it to be easier to obtain financial data for this company. However, one thing with OTC stocks is that it is often difficult to obtain reliable information about the company. Unlike stocks that trade on national exchanges, OTC companies aren't bound by the same disclosure requirements. About all that's required for a company to list on an OTC exchange is the completion of a listing form. \n\nAs of now, their main website and marketwatch are my go-to's for analysis.", "score": 1, "replies": []}]}, {"body": ">1. Dividends can increase over time if the company becomes more profitable. This whole post is just a discussion of whether it does reach its potential in the future.  \n>  \n>2. Price is low due to bad earnings in 2020 and share dilution to complete acquisitions. This is addressed already. The current situation is definitely sub-optimal, it's whether it ever takes off in the future that should be the main discussion.  \n>  \n>3. Volume is definitely expected to be low. This is a relatively early startup with close to no coverage and still trades on OTC.  \n>  \n>4. Being able to shut down your subscription immediately seems a little simplistic. So Spotify and Netflix could also all become unprofitable overnight?", "score": 1, "replies": [{"body": "\"Dividends can increase over time if the company becomes more profitable. This whole post is just a discussion of whether it does reach its potential in the future.\"\n\n\r  \n*Dividends can and do increase over time - that is not what I was stating.  I was stating that the equity had a very low starting dividend that it did not qualify for my needs. Also, it is hard to ramp up dividends when starting with so little a dividend.*\n\n\r  \nPrice is low due to bad earnings in 2020 and share dilution to complete acquisitions. This is addressed already. The current situation is definitely sub-optimal, it's whether it ever takes off in the future that should be the main discussion.\n\n\r  \n*Once again, not reading what I wrote in reply to you. The price of the stock has been in a downward spiral for 5 years according to Yahoo and is now at its' lowest point.  The stock price, over 5 years, shows that it is not well-regarded and seems to be on a losing trajectory.  Really do not care that  \"Price is low due to bad earnings in 2020 and share dilution to complete acquisitions.\"  It is obvious that this is a troubled stock for a long time regardless of current earnings and acquisitions.  This is not a great stock pick, for me,  unless it show that it can get its' price above $5 and keep it there & rising.  Raising the dividend also would not hurt.*\n\n  \r  \n This is a relatively early startup with close to no coverage and still trades on OTC.  *We agree.  It will be hard to attract other people to buy into this company.*\r  \n\r  \nBeing able to shut down your subscription immediately seems a little simplistic. So Spotify and Netflix could also all become unprofitable overnight?  \n\n*Apples & oranges.*  *Yeah they could because, in my opinion - yours maybe different, I invest in stocks where it is hard for the client to disentangle themselves from the service.  That is why I invest in utilities, cell towers, fiber, oil & gas, big name semiconductors, etc.*  \n\n*Netflix is a subscription service relying on people to pay for entertainment.  Today there is very little need to pay for entertainment when Pluto TV, Crackle, and others are free.  When consumers feel up against a wall financially what are the first things to go?  Newspaper & TV subscriptions, car buying, etc.  They will hold on to their electricity (buy utility stock ), cell phones (buy cell phone tower stock - not cell phone), and their present vehicle (no new cars & need for gasoline to power it - buy oil & gas pipelines).*  \n\n\n*MBHCF is a company accumulating all the assets that are easy to discontinue, if & when a recession or a hiccup in the economy comes along - \"It offers vocational training to early year sectors, as well as health, social, management, beauty, and sports education sectors; educational software solutions; commercial interior fit-out and construction contractor services; and aged care residential and taxi services.\"*  \n\n*So no it does not meet my criteria for a decent stock your mileage may differ.*  *Not even for a YOLO.   Their ability to become viable, for me, is non-existent or so far in the future that I cannot wait - 20 years or more.*", "score": 1, "replies": [{"body": "*\"Dividends can and do increase over time - that is not what I was stating. I was stating that the equity had a very low starting dividend that it did not qualify for my needs. Also, it is hard to ramp up dividends when starting with so little a dividend.\"*\n\nI can hardly see a low starting dividend as an immediate red flag, but fair enough. The ability to ramp up dividends is directly linked to the company's profitability. As of now, it's hard to tell for sure if the company ends up recovering in the future. Yet, revenue growth is still on the rise. Just something to note.\n\n*\"The price of the stock has been in a downward spiral for 5 years according to Yahoo and is now at its' lowest point. The stock price, over 5 years, shows that it is not well-regarded and seems to be on a losing trajectory. Really do not care that \"Price is low due to bad earnings in 2020 and share dilution to complete acquisitions.\" It is obvious that this is a troubled stock for a long time regardless of current earnings and acquisitions. This is not a great stock pick, for me, unless it show that it can get its' price above $5 and keep it there & rising. Raising the dividend also would not hurt.\"*\n\nYour \"downward spiral for 5 years\" is not valid at all as the price charts of MBHCF on any site only span from December 2020 onwards, which is when the stock was listed on OTC exchange. A stock can be declining for a few months; sure, it can be worrying but it cannot be compared to being in a downward spiral for 5 years, which it isn't. It is still not beyond any kind of reasonable logic for this stock to recover from its downward trajectory. The company's financials have only gone upward until it hit this stumbling block in 2020 when the virus broke out.\n\n*\"MBHCF is a company accumulating all the assets that are easy to discontinue, if & when a recession or a hiccup in the economy comes along.\"*\n\nThere is no certainty that these services will be discontinued. In addition, this assumption would bank on the fact that firstly, the acquired companies fail to do sufficient R&D to make their services more competitive in the present-day market, and secondly, MBHCF does not acquire more competitive companies to hedge against this risk in the future. I do not think that this scenario is probable, but we will see.\n\n*\"So no it does not meet my criteria for a decent stock your mileage may differ. Not even for a YOLO. Their ability to become viable, for me, is non-existent or so far in the future that I cannot wait - 20 years or more.\"*\n\nFair enough. I am not forcing anyone to buy or believe in this company. If this is not worth a buy based on your own assessment, it is completely fine. \n\nThank you for your input! Definitely got me thinking.", "score": 1, "replies": []}]}]}, {"body": "Nicely done. Not to mention that if I have to go to multiple places just to find accurate company financial data, that’s a HUGE red flag for me.", "score": 1, "replies": []}]}, {"body": "BH had been sitting on its hands for years now. Not the best example you want to bring up", "score": 1, "replies": [{"body": "It was only brought up mainly because it's the only name that most people associate with a successful holding company. At the end of the day, it isn't a comparison with Berkshire whatsoever.", "score": 1, "replies": [{"body": "On a side note, i think MBHCF could be a stock for you to consider to include as part of your ESG portfolio.   \n\n\nThey have recently won 5 stars for their ESG credentials. and getting into the 99th percentile of the nearly 2000 businesses in the Support the Goals database. It is an investment holding company with 25 companies in the portfolio growth so far.   \n\n\npenny for thoughts?", "score": 2, "replies": [{"body": "Looks promising indeed, hopefully they live up to their potential!", "score": 1, "replies": []}]}]}]}]}
{"title": "What stocks to do covered call with $2000-3000 in savings", "selftext": "[deleted]", "id": "ozo9di", "created_utc": 1628318139.0, "score": 4, "upvote_ratio": 0.67, "num_comments": 24, "comments": [{"body": "Multiple directions to go. Do you want a large amount of cheap shares that might spike to get assigned for solid return? Do you want a potential acquisition target (this just happened to me with SCR and previously with APHA)? Do you want something with high IV (used to be Tilray for me but the IV is a bit less now)? It's all viable. Also depends if you want to sell weeklies or if what you are buying only has monthlies. Really depends on what you believe in as a company. I sell CC on my whole portfolio and don't mind if I get assigned just move the money elsewhere. I sell strikes over my cost basis and will lower the cost basis as I go along. It really is a solid strategy. Then when I see larger plays where I need capital for options you can easily move out of the CCs and into your moves.", "score": 4, "replies": [{"body": "I am debating between buying a bunch of cheap shares and buying  stocks that I want to hold long term (PLTR in particular). My only concern is if I do the latter my portfolio will have a lot less diversification. \n\nDo you have any recommendation for cheap stocks that are great for CC?", "score": 1, "replies": [{"body": "I don't like to give particular stock recommendations. It's better if you have to right perception of the company. Generally invest in the companies you believe in where you would generally be ok lowering your cost basis as you go if it drops. Long-term that's the best way to approach it generally.", "score": 1, "replies": []}]}, {"body": "I have been doing that with HUT. What other stocks have you been doing it with? I don’t mind being assigned by selling cc. If the premium looks good I will roll to get some more return.", "score": 1, "replies": []}]}, {"body": "X, CLF, MT, LCID", "score": 8, "replies": []}, {"body": "UWMC has been good to me the past few months. Currently $7.50 with September $9c going for around $.2, more if you wait for a green day. \n\nPLTR is imo incredibly cheap right now trading at 21.93. Sept 17th $25c going for .6 right now. I like to sell further OTM because I would prefer to hold onto my shares. But if you want to wheel more then you could sell closer to ITM and get a lot more premium", "score": 3, "replies": [{"body": "PLTR is a stock I want to hold long term but I have been just kind of waiting for the dip. Do you think I should get in now and buy a 100 shares?", "score": 2, "replies": [{"body": "I personally like the stock at this price. I have 142 shares at 21.72. I started buying like 6 months ago and have been buying a few shares every week since then. I’m gonna keep buying shares as long as it’s under $30 and probably keep buying once it’s past that point. I’m a huge fan of PLTR and have my shares in an IRA so I plan on holding them for a long time and I’m just selling some far OTM cc’s for now. Just letting you know my bias before telling you what I think. All that being said I think if you have $2300 and want to start learning the process of selling cc’s then PLTR is a great choice. Its a strong long term play (imo) and it has a good chance of making you some money in the short term either through swing trading or selling cc’s. If you want to get in at a lower cost then you could sell some $20-22 csp and wait to get assigned. There’s a decent chance it will eventually get back into the low $20 range but idk", "score": 1, "replies": []}]}]}, {"body": "My suggestion is pick a stock you want to hold long term. If that $3000 worth of stock has at least 100 shares then you sell CC against it, if it isn’t 100 shares then don’t sell CC.", "score": 4, "replies": []}, {"body": "I personally like lucid for this.", "score": 3, "replies": [{"body": "Wheeling that right now.", "score": 2, "replies": [{"body": "I just upped my play on lucid from 200 shares to almost 800. Most are CSPs, 200 are CCs. I’m trying to build up to 1,000 shares by the time deliveries start", "score": 1, "replies": []}]}]}, {"body": "PSFE, F, NOK", "score": 2, "replies": []}, {"body": "Try cover calls on SOXL", "score": 2, "replies": []}, {"body": "Nok has had a recent pump in premiums. Can also enter on the CSP side of life too. Don’t necessarily have to start with CC", "score": 1, "replies": []}, {"body": "CNK, they felt some of the volatility when AMC was going crazy, but they are a good company.", "score": 1, "replies": []}, {"body": "RKT has earnings this week. Depending on what happens after that they might be worth a look.", "score": 1, "replies": []}, {"body": "Clf", "score": 1, "replies": []}, {"body": "Try PMCC MARA after 8/13\n\nTLRY SOFI with shares. Just avoid this week - it’s earnings reporting on all of them. \n\nYou should start with PMCC if you only have $3,000", "score": 1, "replies": [{"body": "Been selling december 50c against my mara shares for a while now", "score": 2, "replies": [{"body": "It’s an ATM machine. This week you may see those go ITM and then drop like a rock after earnings. That’s my play on the 8/20 calls", "score": 1, "replies": []}]}]}, {"body": "TLRY moved their Q2 earnings up. They were 07/28. Big green candles that day, but it's slid since.", "score": 1, "replies": []}, {"body": "Amc", "score": 1, "replies": []}]}
