{"title": "With the futures down 1.5% I am up majorly and will open up way green, far over 100k despite loosing on Netflix. I won't be posting anymore because although people have been nice this sub is run like shit with all the constant banning.", "selftext": "Rest in peace this market though. It [GDFR](https://youtu.be/F8Cg572dafQ). ", "id": "41slc7", "created_utc": 1453262656.0, "score": 71, "upvote_ratio": 0.83, "num_comments": 65, "comments": [{"body": "Looks like the mods list got a big cull. I think it might be safe for you to rise again.", "score": 29, "replies": [{"body": "Until the dicks go away and that nice subreddit style is back, about half the crazy jealous mods are gone the sub is fucked. Thats the main reason why I don't post huge explanations, everything just gets shot down like [back months ago](https://www.reddit.com/r/wallstreetbets/comments/38iogh/so_i_sold_the_all_the_puts_for_216k_sorta_weak/) when I tried to post. Now I just post some winning screenshots and everyone loses their minds. ", "score": 24, "replies": [{"body": "Vote for me and I will replace all the dicks with fruit that look like buttocks.", "score": 15, "replies": [{"body": "The peachoid must go Frank.", "score": 3, "replies": []}]}, {"body": "LOL, don't be a little bitch, just season your filet mignon with their salt.", "score": 6, "replies": []}, {"body": "I'm happy as long as you post the winning screenshots.", "score": 4, "replies": []}, {"body": "Lik e 150 mods were removed and your post was stickied, now let's see the screenshot of you breaking over 100k.", "score": 4, "replies": []}, {"body": "Winning screenshots just make everyone crazy because you seem to know something others here don't. If you want fans and less trolls post what you know and try to help. Eventually people will come around.", "score": 8, "replies": [{"body": "I agree. If things start looking better, and it doesn't seem close, I'd be happy to make well thought out posts. ", "score": 9, "replies": [{"body": "This is why i invited you to /r/yoloptions . i got tired of this community being run by shit mods. lets start a new one where we can all actually make some damn money.", "score": 6, "replies": []}]}, {"body": "\"Try to help\"\nLul", "score": 1, "replies": [{"body": "Exactly what a true troll would say", "score": 1, "replies": []}]}]}, {"body": "Mods aren't jealous we have seen bigger yolos and losses before.\n\nThe issue is you're flooding this place with plebs who think you're a Messiah from you're constant posts. Other people who have yolo'd usually wait till they are done with their trade idea to prevent this scenario of plebs flooding WSB from dank posts.\n\nAlso there were 150+ mods and I'm not denying that some plebs became mods (the great handout) and were jealous. But the general statement I said above is what the \"older community\" feels.", "score": 1, "replies": []}]}, {"body": "Theycallme1 no longer mod??? Paradigm shift here. World_Chaos lives up to his name", "score": 5, "replies": [{"body": "Crazy! Now I can correct his spelling without fear of retribution.", "score": 5, "replies": [{"body": "Stil carrey sum pull yew twat. ", "score": 4, "replies": [{"body": ":D you sunk my battleship.", "score": 4, "replies": []}]}, {"body": "win!", "score": 1, "replies": []}]}]}, {"body": "Can confirm, finally lost my mod status. It's OK, I had no power, nor wanted any. You know what they say, Mo Power No YOLO.", "score": 2, "replies": []}]}, {"body": "\"loosing\".  our high school god", "score": 24, "replies": [{"body": "I'm better at math", "score": 41, "replies": [{"body": "lol", "score": 2, "replies": []}]}]}, {"body": "aren't I one of the several hundred mods? can't I just keep you unbanned?", "score": 9, "replies": [{"body": "not any moar bb :(\n\nthey got rid of like 160 of the mods ", "score": 7, "replies": []}]}, {"body": "Late post, isn't a school night? ", "score": 12, "replies": [{"body": "I stay up almost every night watching the futures", "score": 19, "replies": [{"body": "Lol this nigga", "score": 12, "replies": []}, {"body": "SPY puts?", "score": 4, "replies": []}, {"body": "The future is your education. lmao ikr", "score": 3, "replies": []}]}]}, {"body": "You should definitely stay, you're doing something unprecedented here by making money.  I love the community here for all the dick jokes and fucking idiotic gambling, but some actual DD from a consistent winner that's not just paper trading would be a nice addition.  ", "score": 4, "replies": []}, {"body": "My savior my lord ", "score": 12, "replies": [{"body": "So, the question that nobody wants to know the answer to - how does teenage cock taste?  ", "score": 6, "replies": [{"body": "have you ever had red pepper flakes combined with avocado?", "score": 4, "replies": []}]}]}, {"body": "This is getting ridiculous.", "score": 8, "replies": [{"body": "No, not yet. ", "score": 9, "replies": [{"body": "It's just the beginning...", "score": 4, "replies": []}]}]}, {"body": "[deleted]", "score": 13, "replies": [{"body": "Some people don't want to wait until 50 to retire ", "score": 12, "replies": [{"body": "i sure as hell aint", "score": 4, "replies": []}, {"body": "I'm going to be done around 40 but that's mostly a function of savings rate.\n\nI'm not suggesting he stop, just that he take some off the table.", "score": 3, "replies": []}]}]}, {"body": "I'm pretty ditzy, but if you sold your puts, and you're losing on netflix, how exactly are you still gaining? I've looked over your latest reported trades, and it was that post saying you sold your puts and you're still holding netflix. Did you invest in anything else?", "score": 4, "replies": []}, {"body": "I think the majority of us are happy for you... please continue to post gains. That's what this sub is about.", "score": 6, "replies": []}, {"body": "don't worry bout it my nigga", "score": 3, "replies": []}, {"body": "Make your own sub. The plebs will follow.", "score": 8, "replies": [{"body": "I'll follow. Shit......", "score": 3, "replies": []}]}, {"body": "Please post back here an update in a month with your yacht. ", "score": 2, "replies": []}, {"body": "Lucky son of a bitch. Let us know if you lose it all", "score": 2, "replies": [{"body": "when", "score": 4, "replies": [{"body": "its only a matter of time", "score": 8, "replies": [{"body": "What's your plans for capital gains taxes?\n\nJust curious. ", "score": 2, "replies": []}, {"body": "Its.", "score": 1, "replies": [{"body": "Faggot. ", "score": 2, "replies": [{"body": "It's the 90s all over again! [Corporate advertising redacted for invoice non-payment...]", "score": 2, "replies": [{"body": "Corporate*", "score": 2, "replies": [{"body": "It's the accent.", "score": 1, "replies": [{"body": "Don't edit your post after the fact. Such a bitch move.", "score": 2, "replies": [{"body": "Lol.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "FUCKING RIGHTS BUD. KEEP IT GOING. LOVE U ", "score": 1, "replies": []}, {"body": "most people are happy...it shows that this game can be won. why would people be jealous of someone who's anonymous online? keep posting for the nicer people on this sub.", "score": 1, "replies": []}, {"body": "Would like it if you stayed, but understand your dilemma. Good luck on your future trades!", "score": 1, "replies": []}, {"body": "YAY!!! GO HIGH SCHOOL GAWDDD", "score": 1, "replies": []}, {"body": "hope you're covering now.\n\ni started to lose faith in my long position and took some puts out end of the day yesterday as protection.  rid of them now, enough of a gain to mostly cancel the loss my long position took, but we're oversold now--even the heavily suppressed VIX indicator points to that. ", "score": 1, "replies": []}, {"body": "#you're too cocky for this sub", "score": -14, "replies": [{"body": "That's what you came up with.. Too cocky?  He deserves to shit in everyone's cereal considering what he's accomplished. ", "score": 9, "replies": []}]}]}
