{"title": "Loving VIX plays, picked up $20 calls yesterday for $0.25, they're settling for $21.89 today. Over $10K in profit overnight.", "selftext": "", "id": "3zrw26", "created_utc": 1452115152.0, "score": 32, "upvote_ratio": 0.94, "num_comments": 76, "comments": [{"body": "Are those the calls that are expiring today?", "score": 4, "replies": [{"body": "Yes they settle at open.", "score": 4, "replies": [{"body": "Who did you trade them through? Do you have to trade the contracts through CBOE? Sorry, I'm new to VIX and trying to wrap my head around it. ", "score": 3, "replies": [{"body": "Standard brokerage", "score": 2, "replies": [{"body": "Cool. Congrats on the great trade. ", "score": 1, "replies": [{"body": "Thanks!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Way to go, man.", "score": 4, "replies": [{"body": "Thanks!", "score": 2, "replies": []}]}, {"body": "One hell of a gamble! Did you unload them or hoping for more?", "score": 3, "replies": [{"body": "No unloading, they were an overnight play. They auto exercise ITM as a cash settlement since there are no VIX shares.", "score": 3, "replies": [{"body": "I always wondered how that worked. Nice trade! ", "score": 1, "replies": [{"body": "That's why we have /r/options, share the knowledge if you have it.", "score": 11, "replies": []}]}]}]}, {"body": "Congrats mate! Well done, sucks for the person on the other side", "score": 3, "replies": [{"body": "Other guy was probably hedged and alright as well. Depends where they had these marked.", "score": 3, "replies": [{"body": "You got anything on the go Fletch?", "score": 2, "replies": [{"body": "I feel like this is becoming a theme with me but not doing much -- have a string of injuries that I'm getting taken care of via some major surgery and there isn't a good place for someone like me to clear right now with ICBC's departure from options. Wish I had better news. I might transition into something more management related. I'm becoming a dinosaur in this industry. \n\nSo no, it wasn't me on the other side of your trade. I wouldn't have hedged it hard if it was.", "score": 2, "replies": [{"body": "Health comes first bud! No need to worry about the markets right now anyways.  \n\nYeah I hope it was a bot! Blackswanned the seller for sure.", "score": 2, "replies": []}]}]}]}]}, {"body": "care to share your knowledge on what made you go for VIX?", "score": 2, "replies": [{"body": "China and oil.", "score": 3, "replies": [{"body": "My phone screen is cracked, so at first I thought it said \"China and Chill\"", "score": 3, "replies": []}]}]}, {"body": "what made you want to trade vix? I've been trading options for a month now and doing pretty good. But i only trade things i know, so now I want to know what and how to measure VIX. it's a volatility stock?", "score": 1, "replies": [{"body": "Ok, i think I know the answer \n\nhttp://www.investopedia.com/terms/v/vix.asp?layout=infini&v=3A", "score": 1, "replies": [{"body": "It tracks opposite SPX and expires Wednesday so Tuesdays are good overnight plays. Playing SPY weeklies on a Thursday is similar.", "score": 1, "replies": [{"body": "Plus Volatility has been on the upswing (I frankly didn't check SPX/SPY/etc.  but on others it has been trending that way)", "score": 1, "replies": []}, {"body": "> SPX\n\njust to clarify, when SPX were to say have a shitacular day, VIX would go up and vis versa?", "score": 1, "replies": [{"body": "Yes look at this morning.", "score": 2, "replies": [{"body": "That's not strictly correct. If SPX were to go up \"in channel\" then VIX will drop. If SPX were to go way the fuck up - a complete breakout - then VIX would also go up because it's measuring volatility. Because the current expected channel for SPX is slightly up or neutral it looks like SPX up = VIX up but that's not the full story.", "score": 2, "replies": [{"body": "naturally it can't be that simple of course. So lets say, I dunno, the chinese markets sucked again, and we can expect SPX to respond by going down tomorrow. Would a non foolish idea be to do a call tomorrow for VIX? Where do I find the expected channel for SPX?", "score": 1, "replies": [{"body": "If anything I'd buy VIX puts on open. SPX futures are down just over 1% so SPY will open in the low 196s. Oil bombing hard right now so maybe lower.  \n\nVIX option pricing works a little differently, it's not simply intrinsic plus extrinsic (theta/vega). There's averaging involved so price movement is inversely proportional to theta. ", "score": 2, "replies": []}, {"body": "China has already opened and closed limit down 7% btw", "score": 1, "replies": []}, {"body": "The VIX future trades 23.5 hours a day. It's already up quite a bit (1.50 at the moment). If you're looking to buy tomorrow, you're already too late.", "score": 1, "replies": [{"body": "what is the symbol?", "score": 1, "replies": [{"body": "http://www.investing.com/indices/us-spx-vix-futures-streaming-chart\n\nIf you want to watch the January, you can watch it here. VX is the ticker but most brokerages handle them differently than stocks. You might not be able to see it through your broker.", "score": 2, "replies": [{"body": "thanks.\n\n\n\nDidn't know VIX traded 23.5 hours a day. TD Ameritrade only shows during the day and AH.", "score": 1, "replies": []}]}]}]}]}, {"body": "Technically this is true but in practice this usually isn't the case.", "score": 1, "replies": [{"body": "I just wanted to make sure this guy knew the concept behind VIX, that is, it's not a leveraged SPX short or associated product.", "score": 1, "replies": [{"body": "I know, I upvoted your comment but wanted to make it clear to anyone else reading. For all intents and purposes the VIX usually does the opposite of what the SPX does but there are times when it doesn't happen.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Nice.  Did you trade the actual VIX options (vs. etf/etn)?\n\n", "score": 1, "replies": [{"body": "Yes VIX $20 calls", "score": 1, "replies": [{"body": "thanks-- I think I was being a bit daft.  I went to look them up in TOS and duh, they're gone since they expire today.", "score": 1, "replies": []}]}]}, {"body": "How do you select which play (call or put) to play? It looks like the last two weeks Calls would have shat all over your parade", "score": 1, "replies": [{"body": "I was actually setting up a 19/20 strangle and my puts didn't get a complete fill, only 10 contracts. China and oil tanking right now so much volatility.", "score": 1, "replies": [{"body": "Nice. So have you made the same play in previous weeks?", "score": 1, "replies": [{"body": "I've made a play on VIX right before expiry for the last three weeks if that's what you mean...", "score": 1, "replies": []}]}]}]}, {"body": "i wanted to play the VIX too, but was told that they're like futures. for example, today VIX is at 20.59, but feb's VIX is currently at 20.64? I'm not sure if that makes sense", "score": 1, "replies": [{"body": "VIX(VRO) settled at 21.89 this morning. Who knows what it will settle at in February.", "score": 1, "replies": []}, {"body": "Cash VIX is irrelevant -- the options trade off of the futures. What they usually show you as \"VIX\" (known as the 'cash') isn't what the options are based off of but rather a composite of S&P500 volatility. The futures converge with the cash at settlement however.", "score": 1, "replies": []}]}, {"body": "Well, based on the overnight futures action, it looks like your VIX options will get another bump for the settle price.  Mazel tov.", "score": 1, "replies": [{"body": "No they're finito yesterday morning... all I'll get is the 1.89. Jan 6th expiry.", "score": 1, "replies": []}]}, {"body": "You bought +/- 75 calls? \n\nThat's a hell of gamble mate. Investing nearly 2000$, and risking all of it. Well done, good call - but...", "score": 1, "replies": [{"body": "Yeah I know, had just made $4K on a different play and didn't care. Was worth the risk with the conditions.", "score": 3, "replies": []}]}, {"body": "The low for the $VIX 20 calls exp this Friday was 1.25 yesterday. How did you get filled at 0.25?  Or am I looking at the wrong contract?", "score": 1, "replies": [{"body": "Was Jan 6 expiry purchased Jan 5", "score": 1, "replies": []}]}, {"body": "Funny, I've always heard you should never trade VIX, just use it as an indicator. damn", "score": 1, "replies": []}, {"body": "22 calls for next week would have made some bank to day too.  ", "score": 1, "replies": []}, {"body": "Quick question, how many times have you put on this trade only to have them expire worthless? Just curious about your win/loss ratio %. Thanks.", "score": 1, "replies": [{"body": "Five VIX plays since start of December, only lost once.\n", "score": 1, "replies": [{"body": "Nice. Just from buying outright calls, not spreads or straddles?", "score": 1, "replies": [{"body": "Yeah calls and puts. Actually was trying to leg into a strangle on VIX but puts only got filled 1/10th. Worked to my favour anyway.", "score": 1, "replies": [{"body": "Lucky you, ha. Good trade anyway.", "score": 1, "replies": [{"body": "So much luck lately it's not even funny.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Did u play it again this week?", "score": 1, "replies": [{"body": "Yeah had 24 calls, no go today. $800 loss, no biggie. Would've been ITM if settlement was in the afternoon. VIX settled for $21.46 though. ", "score": 1, "replies": [{"body": "I went the strangle route(24/23), but only paper trading. I'm not really sure wth it is showing because it doesnt look like it settled, but when i checked thia mornig should have been up bc of the put", "score": 1, "replies": [{"body": "long strangle? and what expiry?\n\nEdit: You'll get $164/contract as cash in your account tomorrow if it was a $23 put expiring today.", "score": 1, "replies": [{"body": "Yeah. Long strangle expiring last night\n\nPart of the confusion is i actually did three different strangles to see what would happen. The 23/24 was done early afternoon at itm. At 3:30 i did another itm strangle and an otm strangle just to see what would happen\n", "score": 1, "replies": [{"body": "Ok well it takes a day for the cash to come through. Update tomorrow?", "score": 1, "replies": [{"body": "Will do", "score": 1, "replies": [{"body": "How'd you make out?", "score": 1, "replies": [{"body": "Not sure. Unfortunately i am stuck at the day job and the papertrading mobile platform isnt giving me the details. Will update this evening", "score": 1, "replies": []}, {"body": "So I can't figure out how to parcel out what the individual options worked out to be. I am able to see the overall p/l in VIX in my (paper trading) account statement, but it won't go in to deeper detail and I know I traded it prior to this past week... so I'll have to try again next week", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Which strikes?", "score": 0, "replies": [{"body": "$20 as I stated in the title lol.", "score": 1, "replies": [{"body": "Ah shit. So does that mean it settled with a 1.89 premium? I checked yesterday and didn't see it that high.", "score": 1, "replies": [{"body": "Yeah just check the CBOE link in the sidebar, under weeklies VIX/VRO.", "score": 1, "replies": [{"body": "Thanks, that was helpful. Let me see if I did the math right, did you buy 60 contracts?", "score": 1, "replies": []}]}]}]}]}]}
