{"title": "rip tesla tendies", "selftext": "", "id": "jt2qp9", "created_utc": 1605213637.0, "score": 829, "upvote_ratio": 0.98, "num_comments": 66, "comments": [{"body": "next stop 69. after that, 420. after that, 2100 with an announcement to split... and then battery day to mark the death of a company that will create generational bagholders.", "score": 108, "replies": [{"body": "Battery day was interesting. Really ended the hype.", "score": 40, "replies": []}, {"body": "Tesla is just in sleep mode bruv", "score": 20, "replies": [{"body": "The next time people ACTUALLY pay attention to Tesla is when people realize they have 3 Giga factories just opened up and they are at 80% capacity or more each. They just have to keep their name relevant until that point. No one can catch them right now", "score": 15, "replies": [{"body": "You underestimate Chinese productivity. Even Elon was impressed by it.", "score": 18, "replies": [{"body": "Elon has also compared its 420x42 difference between the stock, which might seem like something small to everyone but it seems hes not tweeted or mentioned any other EVs besides nio? Elon could see competition between both companies, one factor being Nios “cheap” battery switch method they got going on . I might be reaching but somethings there for nio \n-never underestimate the china men 😳 this is true", "score": 3, "replies": [{"body": "Tesla tried and failed at battery swap as well", "score": 8, "replies": [{"body": "That my frend is something i did not know, i am bull on nio a little more now", "score": 5, "replies": [{"body": "As a last ditch effort they tried to keep them juiced up with diesel generators lol", "score": 4, "replies": [{"body": "source for that?\n\nthe biggest reason for the \"failure\" of the pilot program was two fold\n\n1. Americans like to own their whole vehicle, so it didnt catch on very well. \n\n2. supercharger network already existed. essentially one service that was already in existence and people were used to doing was out competing a newer service. \n\nyou could say 3. was that they had to make appointments for the switch.", "score": 2, "replies": [{"body": ">1. Americans like to own their whole vehicle, so it didnt catch on very well. \n\nConsidering how many lease and ride share I am not sure \n\n\n>2. supercharger network already existed. essentially one service that was already in existence and people were used to doing was out competing a newer service. \n\nI realistically dont think this will be a realistic option if EVs are actually adopted at the scale they are predicting. Thats a big load on power demands. As is you are restricted with the amount of superchargers you can install on you property in some states. Imagine countries that already have rolling black outs to help manage energy demand. \n\n>3. was that they had to make appointments for the\n\nNio doesn't need to. People had to make appointments because tesla couldn't keep up with drive ups hahah the smoking tire podcast talked about this and mentioned the big lie ups for batteries charged by diesel generators.", "score": 1, "replies": [{"body": "Still would like a source. Not doubting it.\n\nPersonally I think swapping isn’t a good idea. But in China its more feasible nor necessary come future. \n\nBut NIO has sole support from CCP with battery swapping as per their tax subsidy. So NIO will do well with it for a while.", "score": 1, "replies": [{"body": "[hung it up 4 years ago](https://www.google.com/amp/s/www.teslarati.com/tesla-shuts-down-battery-swap-program-for-superchargers/amp/)", "score": 1, "replies": [{"body": "I don’t see anything about generators tho. That’s the bit I was wondering about", "score": 1, "replies": [{"body": "Ooohhh fuck hang on ill have to do some digging. There are lots of examples of them using them in place of actual superchargers [here](https://www.google.com/search?q=tesla.battery+swap+station+deisel+generator&oq=tesla.battery+swap+station+deisel+generator&aqs=chrome..69i57.18867j0j4&client=ms-android-samsung-gs-rev1&sourceid=chrome-mobile&ie=UTF-8)", "score": 1, "replies": [{"body": "That is kind of funny. Lolz. \n\nThis came up in the search too. https://www.google.com/amp/s/reneweconomy.com.au/tesla-ev-charged-with-diesel-generator-still-cleaner-than-conventional-car-61942/amp/\n\nReminds me of the video where they have a Toyota Tacoma pull a Tesla from 0% battery and regen charge the thing to near full and then drive the Tesla a longer distance to offset and gain mileage lol.", "score": 2, "replies": [{"body": "i've seen \"tesla trains\" as an actual proposition i think hahah you link up and get towed with a bunch of other cars. i wonder at what point you call that a $70k bus seat", "score": 1, "replies": []}]}]}, {"body": "[found it](https://dailykanban.com/2015/05/27/tesla-and-its-customers-find-its-not-easy-being-green/)", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "They probably ditched battery swap why? thermo management, weight reduction, structure design, weight distribution, production cost, swap station cost etc. Gosh does anyone on this sub has a stem degree?", "score": 0, "replies": [{"body": "Yeah, but there's one thing that matters most for Americans besides money and that's convenience.", "score": 2, "replies": []}, {"body": "degree in mechanical engineering. you understasnd as of now the power requirments on the grid to run superchargers to keep up with expected demand is literally impossible right? unless you are ready for rolling black outs like a third world country.\n\n&#x200B;\n\n&#x200B;\n\nalso, if they are able to swap batteries in formula e and it not be a problem, i am sure it will be enough for consumer cars without those concerns you listed. again, tesla tried and failed. they wouldn't have if they didn't see it as a solution", "score": 1, "replies": []}]}]}]}]}, {"body": "Lol as if other companies don't always have production capabilities. Ford is pumping out an f150 every couple seconds. It just took a while for them to develope entirely new vehicles or adapt brand new powertrains they deemed suitable and ready for market (something tesla doesnt). Plus demand is there. As it is only 1 tesla is in the top 10 highest selling EVs in the word currently? And right now the legacy manufacturers are announcing a new ev model every month and unlike tesla i actually have confidence they will build the ones they say they will lol", "score": 1, "replies": []}]}, {"body": "If I wanted a boring sideways fuck, I'd call up my ex.", "score": 1, "replies": []}]}, {"body": "People do talk about tesla as if car companies don't fold every decade lol no one is invincible.leastof all fraudulent companies...", "score": 1, "replies": [{"body": "Do what now?\n\n*sent from my Pontiac Grand Prix*", "score": 4, "replies": [{"body": "I'll dr race you in my Saab, Saturn, sunbeam, Spyker, or scion", "score": 2, "replies": [{"body": "*cries in Eagle*\n\n*sobs in Datsun*", "score": 3, "replies": [{"body": "Whimpers in  mercury\n\nMoans in British Leyland", "score": 1, "replies": []}]}]}]}]}]}, {"body": "i never bought calls before. should i buy $50 nio calls?", "score": 27, "replies": [{"body": "Their earnings are on tuesday. Expect the biggest spike on monday morning.", "score": 17, "replies": [{"body": "I know this is wsb but I'm still gonna say it, don't buy short-term calls betting on earnings:  \n\n### Implied Volatility Crush", "score": 40, "replies": [{"body": "I don't understand what IV crush actually means but I've learned that earnings don't mean what I thought they did.", "score": 24, "replies": [{"body": "Implied volatility can be thought of as a measure of uncertainty in the price. A stock can move +-x standard deviations because of unknowns like their earnings, pending regulations and most recently, the elections. Options are like insurance policies. The more vague the risk becomes the higher the premium. \n\nAs soon as the unknowns become known, there’s no need to price them as such and the IV drops and the option price drops with it (see vega). This happens for any kind of option so you shouldn’t really buy puts either unless the underlying is going to tank more than 8-10% or so to generate any meaningful profit. Selling options is the way to go.", "score": 6, "replies": [{"body": "This makes sense, thanks for the explanation. Doesn't selling options imply more risk though if they're exercised? e.g. I don't have several batches of 100 shares of stocks I'd sell options on.", "score": 1, "replies": [{"body": "Less risky.Selling options allows for a predetermined exit price + premium that you keep whether they buy or not.", "score": 0, "replies": [{"body": "Interesting - do you need more capital up front though?", "score": 1, "replies": [{"body": "I would only recommend selling calls on shares you own. So you would need at least 100, so yeah more capital involved.", "score": 1, "replies": []}]}]}]}]}, {"body": "IV crush means stonk is either flat or down or only up 5% or less on earnings", "score": 1, "replies": []}]}, {"body": "Many autists are going to learn what IV crush is. Theta gang getting ready to pound many asses", "score": 10, "replies": [{"body": "Or just sell the iv..", "score": 3, "replies": []}, {"body": "Yeah I'm not selling contracts on this shit. The premium is very juicy but I have no clue what'll happen at earnings.\n\nIts had an insane run up the past month so maybe we see big selloffs, or their ER is as good as XPeng and it moonshots like crazy.", "score": 1, "replies": []}]}, {"body": "IV crush really just is a technicality. IV crush often happens together with a big change in the underlying. Sure you'll lose on vega, but on average the expected delta gains compensate that.", "score": 1, "replies": []}]}, {"body": "So calls for Monday Puts for Wednesday.", "score": 2, "replies": [{"body": "Lotto tuesday.", "score": 2, "replies": []}]}]}, {"body": "60c 11/20 much better", "score": 2, "replies": []}]}, {"body": "Tesla a boomer stock now", "score": 21, "replies": []}, {"body": "You did not seriously think that a hobbit could contend with the will of Sauron? There are none who can.", "score": 12, "replies": []}, {"body": "Tesla is dead to me until I can actually buy the solar roof they've been \"selling\" for 2 years now.", "score": 9, "replies": []}, {"body": "Lol for real. Tesla went from $1500 a share all the way down to $417.  Who would want to invest in that.", "score": 39, "replies": [{"body": "Are you familiar with split stocks🧐", "score": -1, "replies": [{"body": "literally woooshed", "score": 19, "replies": []}, {"body": "You have the wrong kind of autism.", "score": 6, "replies": []}]}]}, {"body": "We have a new poster child", "score": 5, "replies": []}, {"body": "Lol hard in bed at the meme. Wife is confused.", "score": 4, "replies": []}, {"body": "thank u for this", "score": 2, "replies": []}, {"body": "Tesla is a boomer stonk now", "score": 2, "replies": []}, {"body": "Tesla went up 500% in a year. Man's just hibernating, buy now and y'all will see next year. !remindme 4 months", "score": 2, "replies": [{"body": "I will be messaging you in 4 months on [**2021-03-13 12:17:22 UTC**](http://www.wolframalpha.com/input/?i=2021-03-13%2012:17:22%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/jt2qp9/rip_tesla_tendies/gc5ae6k/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fjt2qp9%2Frip_tesla_tendies%2Fgc5ae6k%2F%5D%0A%0ARemindMe%21%202021-03-13%2012%3A17%3A22%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20jt2qp9)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "NIO is only 70B Tesla is 700B. 10x upside confirmed. 2000 shares in @6. No selling before 420 💎🤲🤲", "score": 5, "replies": [{"body": "TSLA is 390b", "score": 2, "replies": []}, {"body": "What if CCP fucks it up like BABA?", "score": 0, "replies": []}]}, {"body": "What about $LI? $Xpev ?", "score": 1, "replies": [{"body": "Those exist as well be but when you go through hot in wsb atm, most the posts are nio", "score": 2, "replies": []}]}, {"body": "This is more about collective degenerate gambling than EVs but I think we all know that. Anyways, buying more calls NIO to moon!", "score": 1, "replies": []}, {"body": "Elon is a WSB lurker and i bet he saw this and it made him super sad. Dont you feel like a piece of shit now?", "score": 1, "replies": [{"body": "ok Elon.", "score": 2, "replies": []}]}]}
