{"title": "What are your moves on AMD, TSLA, NVDA and ATVI these two weeks?", "selftext": "[deleted]", "id": "6qo51o", "created_utc": 1501504719.0, "score": 53, "upvote_ratio": 0.88, "num_comments": 57, "comments": [{"body": "> Tesla has earnings on Wednesday, which gives me the strong presumption there'll be a substantial dip the next morning.\n\n$TSLA is something I generally avoid; the volatility is too high for credit spreads even with that sweet, sweet premium, and the capital hold for covered calls is somewhat prohibitive.  It's just too erratic for my tastes, but then I'm not quite as much of a gambler as some of you.\n\n> Nvidia has earnings next week, which makes me assume there'll be a rather large run-up until then, but I'm unsure of what the word is on if they'll pull the same thing they did for Q1.\n\nI'm currently short a 140/145 put spread (8/18) that I hope to be able to exit out of after earnings, and I also have a 8/11 $170 covered call that I got on a buy-write at $158.\n\n> Activision is Thursday, which to me seemed like a viable ER to play, but I've seen a lot of word otherwise on a few different sites. Besides the usual \"Lol have you played Overwatch??\"\n\nI bought into $ATVI when tech dipped on Thursday.  My plan is to sell an 8/04 (or possibly 8/11, depending on premium) call before then, when I think I can get the most for it.\n\n> And AMD... Although we're past ER, they have/had announcements to share, with releases of new products coming fairly soon. I expected the news yesterday to have a huge impact on pre-market, but it's not really done much.\n\nFor me personally, Thursday taught me that I'm a little too heavily invested in US tech ($MU, $WDC, $NVDA, $ATVI, $SQ, $FN, $VEEV) so I'm not looking to add any positions there at the moment.  $AMD appears to be rallying pre-market, though, and I don't think it's a bad play, but I might wait for some of the selling pressure to fade before buying in if I were you.", "score": 18, "replies": [{"body": "AMD had a blowout ER and lost all of its gains in that tech dip. An overreaction on a typically volatile stock... Not unexpected, but it has plenty of room to run. Buy stock or Jan calls.", "score": 13, "replies": [{"body": "I think people have a very low bar for a \"blowout\". It was not a blowout. ", "score": 4, "replies": [{"body": "TIL 20% YOY Revenue growth isnt a blowout\n\nhttps://ycharts.com/companies/AMD/revenues", "score": 9, "replies": [{"body": "Yeah it is not, because we don't give a shit about YOY, we care about what has changed since last earnings. We already know that YOY revenue growth was going to be there.\n\nYou are exhibiting typical WSB retardation: BLOWOUT earnings means EXCEEDED EXPECTATIONS by a WIDE MARGIN. That is not what happened with AMD, or MU for that matter. They had solid earnings.\n\nYou want to see blowout earnings? Look at the stocks that went UP by 10%+ and stayed there.", "score": 5, "replies": [{"body": "EST Revenue was only supposed to be 1.15, they beat by 10%", "score": 4, "replies": [{"body": "the \"official\" estimate is NOT the fucking real estimate\n\nthe real estimate is reflected in the stock price. when the stock price goes down after earnings, that means it was not a \"blowout\" it was a disappointment.", "score": 1, "replies": []}]}, {"body": "If you don't use YoY to understand revenue growth you honestly might be fucking retarded.\n\nActually looking at your post history I know you're fucking retarded.", "score": 3, "replies": []}]}]}]}]}, {"body": "QQQ huge RSI negative divergence screaming sell since June dip as well.  APPL also downtrending short term on those fool buying the buffet news at 154-156. 15 area double top AMD even though I like company. AMD Still holding its trend-line though. I'm bullish other sectors but tech needs a haircut first.  Short MU above 31 and YELP at 33.50 as well currently. It's playing out like a bear flag bounce on tech in the ERs for aapl and others. We will get the euphoric stage of markets soon I feel. TSLA is a great short but hate options in it. Can still lose there even if correct. ", "score": 2, "replies": [{"body": "Hate options on TSLA? My god those are my favorite things to trade", "score": 2, "replies": []}]}]}, {"body": "buy the pre-er DIP everytime", "score": 29, "replies": [{"body": "Lol this actually works surprisingly well", "score": 9, "replies": [{"body": "worked really well for those who bought AMD pre-er dip. It was ridiculous i think it went -5pct and up 15pct after in a span of 5 mins :/ Regrets", "score": 5, "replies": [{"body": "my only regret is not averaging down when it was at 11 a few weeks prior, but with amd you never know", "score": 2, "replies": []}]}]}, {"body": "Pre earning dip as in hours before, or a day or so before? ", "score": 6, "replies": []}]}, {"body": "AMD: long\nNVDA: short\nTSLA: long\nATVI: long", "score": 13, "replies": [{"body": "thanks for the no fluff answer. makes it much easier to inverse", "score": 43, "replies": []}, {"body": "Shorting nvda? R u ok", "score": 10, "replies": [{"body": "Short term dip in nvda probable due to this influx of dank new amd hardware.  Would also short intel as the amd cpus are dank af too.  Everything will probably return to normal after people realise that the drivers are shit for amd gear, with a possible spike in amd stock price which coincide with release of enterprise hardware.  If we're talking v long term (years) I feel nvda will deploy full thrusters as they rocket into the stratosphere, fuelled by the rise of AI and automation.  Looking even further in the future we'll either have new robot overlords or be dead so none of this will matter anyway.  But at least we can buy artificial 3D printed tendies with our nvda gains at that point.  So I guess long ssys too.  ", "score": 3, "replies": [{"body": "Why would nvda benefit solely from AI and automation? Wouldn't more CPU heavy manufacturers like Intel and AMD benefit more? Just curious what you think.", "score": 1, "replies": []}]}]}]}, {"body": "Sold almost half my position in both AMD and NVDA in the rally for the first 30 mins of today.\n\nBeen in AMD since $4.40 and NVDA since $40.\n\nWas not impressed with Vega at all. Matching cards that have been out for over a year WITH THE SAME PRICE-POINT. Threadripper looks promising but they are hoping to capture up to 10% of the server market over several years. Vega is about to get lapped by Volta. I expect a heavy dip sometime between now and then and I'd prefer not to try and time it.\n\nNVDA has been on a massive rally for the past several months. I fully expect them to blow earnings the fuck out. A positive earnings doesn't mean the stock will go up though. I expect a lot of profit taking after earnings and a drop", "score": 4, "replies": []}, {"body": "Have ~2k in TSLA, if it gets to 370 before earnings I'll dump, but I don't see that happening. Otherwise I'm in it for the long haul.", "score": 5, "replies": [{"body": "Have 10k here. Help me.", "score": 3, "replies": [{"body": "You have 10k in TSLA or in cash?", "score": 2, "replies": [{"body": "In TSLA. I'm long as ever but I'm scurred for this week.", "score": 1, "replies": [{"body": "Don't think about it, or get out if you a lil bish.", "score": 10, "replies": [{"body": "I'm not pulling out. I'm in this for the money baby.", "score": 5, "replies": [{"body": "If you don't pull out shes in it for the baby money", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Bought back some of my covered calls on AMD on the dip. Still holding others.  Right now I'm in best case scenario range for my cc's.\n  \nHoping ATVI or NVDA dips so I can enter.  Don't like the buying either at current price.  Don't have the balls for a short play. \n\nStaying away from TSLA. ", "score": 3, "replies": []}, {"body": "Not sure what % of rev, but the NVDA GPUs sold out entirely in June because of cryptocurrency mining. Watching for a dip in the week to open a position. ", "score": 2, "replies": [{"body": "I do think profits could be huge here, even 1070s were getting hard to find and many people that would have looked at 580/1060/1070 level probably just went for a 1080 instead because it was all the same price anyway. ", "score": 2, "replies": [{"body": "That's an interesting idea with the 1080s...they weren't very efficient for mining. AMD cards sold out first, then the 1070s, so gamers bought 1080s which are probably higher margin products for NVDA. ", "score": 2, "replies": []}]}]}, {"body": "Bought AMD about 1.5 months ago at $11.09, sold last week at $15.55. Waiting to see if it drops back into the ~12 range to buy back in.", "score": 2, "replies": [{"body": "I'd be surprised if it dipped as low as 12 .. if it does I'm going all in on it, because it's going to shoot right back up.  \n\nI don't think they will do terribly well with Vega and expect a dip close to 13, then back up to 14 when the typical over-reaction wears off.", "score": 3, "replies": []}]}, {"body": "Lmao $TSLA always gets volatile at earnings bc investors always half expect a company 99% subsidized to actually be substantially profitable.", "score": 2, "replies": []}, {"body": "Was short TSLA, got out today, probably won't play ER.\nShort NVDA.\nNeutral ATVI. \nHaven't been in AMD, tempted to get long, or maybe just reading too much WSB.", "score": 2, "replies": []}, {"body": "\"Tesla has earnings on Wednesday, which gives me the strong presumption there'll be a substantial dip the next morning.\"\n\nAgreed, waiting for a dip and stabilization that occurs after and than I will be looking to add some shares. \n\nNvidia has earnings next week, which makes me assume there'll be a rather large run-up until then, but I'm unsure of what the word is on if they'll pull the same thing they did for Q1.\n\nIf Intel and AMD have given us some insight than I would expect another blowout quarter. Tough to say it is not baked in though and I might take sell depending on if it runs up to earnings. \n\nActivision is Thursday, which to me seemed like a viable ER to play, but I've seen a lot of word otherwise on a few different sites. Besides the usual \"Lol have you played Overwatch??\"\n\nActivision is one of my favorites, expect it to beat and raise guidance. I am big Call of Duty fan and this next one is highly anticipated. Plus they have been raking in so much money from micro-transaction.\n\nAMD could dip depending on the reviews of their new Vega GPU. Reviews will come out on Tuesday and so far from browsing the PC subreddits I would expect some bad news.    \n", "score": 4, "replies": []}, {"body": "buy buy buy buy!", "score": 1, "replies": []}, {"body": "The market doesn't really know what to do with TSLA right now. Everyone knows earnings will be bad so it's probably baked into the price. It all hinges on the model 3 sentiment, which seems like a solid \"meh\"", "score": 1, "replies": [{"body": "TSLA model 3 is like beating off to that video of Pam Anderson on napster and saving it for 'future use' because there wasn't much choice before broadband was a thing.  News and hype is so long and drawn out now (like the new NSX) that no one gives a fuck anymore when it arrives.  Same shit, new spin. \n\nMarket needs something new and bold to get off on where TSLA is concerned. . Better hope to God the semi truck announcement is hyped more than mcgregor vs. Mayweather or else this thing is going down faster than the 94 blue Jay's. ", "score": 3, "replies": []}]}, {"body": "AMD: Just entered a 5 day debit call spread 14-14.5 based mostly off technicals. Its at the bottom up an uptrend range. IV is relatively low. \n\nNVDA: hoping for a slight increase through friday. Just entered a 5 day credit put spread 162-165. IV is high so I wanted to sell some volatility. \n\nNo idea about activision. \n\nTSLA I'm waiting. If it drops to support level at 308, I'll go long in some manner. Might do it at $310", "score": 1, "replies": []}, {"body": "Hold everything.", "score": 1, "replies": []}, {"body": "Buying more MU", "score": 1, "replies": []}, {"body": "I think TSLA will go down, so I bought a 320/310 put spread that expires this week. If I'm right, it'll pay out around 2:1.\n\nI might AAPL might also go down, or at least not up that much, so I might sell a call spread. Haven't figured out the strike price / expiration yet.", "score": 1, "replies": []}, {"body": "I bought Sept 15 TSLA puts with a strike of $310. Already up a little. I'll hold until after earnings are released. \n\n http://imgur.com/RVlILJR\n\nAlso, I'm have a preorder on a Model 3 lol. Let's see how much of it I can finance by goofing around. http://imgur.com/OyRSP8R", "score": 1, "replies": []}, {"body": "lol, have you played overwatch?", "score": 1, "replies": []}, {"body": "I unloaded my TSLA at 350.00 or so after I had bought at 255. Its volatile, ER will affect the stock inversely to how it should go (down) because an single tweet from Elon. The moment it hits 300 I am buying and holding until 350. \n\nNVDA I unloaded just before their most recent earnings as well, tech is volatile at the moment so instead of feed into my fears that it will drop I sold half of my position, took some of my gains and feel good. \n\nPlaying earnings on these is a very inadvisable strategy in my opinion, they are three heavily momentum based stocks, and EPS usually is set at a higher rate due to this. If the growth rate is not maintained (even though for a stock like NVDA it is absolutely furious), it drops when it misses an astronomically high projected EPS.\n\nHold these up until earnings, look at MU and how many got fucked from that. I bought it at 26.78 and sold at 32.40 right before a shitty earnings, now I am wondering when is best to catch the knife. And I really should just move on and leave it alone. ", "score": 1, "replies": []}, {"body": "Praying AMD bounces back up.", "score": 1, "replies": []}, {"body": "I keep holding AMD and NVDA for sure. ", "score": 1, "replies": []}, {"body": "I got down voted for being a bear earlier but maybe y'all should join me, all opened this morning\n    \nhttp://imgur.com/F4pmqyh\n    \nTSLA will be closed tomorrow since I don't hold through earnings, SNAP is having a short squeeze despite everyone screaming about the lockup expiration.  Semi puts I plan to hold atleast through the week.", "score": 1, "replies": []}, {"body": "Long $AMD @ 14.46 average.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Lol, yes, avoid companies that make money, they're playing by the old economic rules. ", "score": 11, "replies": []}]}]}
