{"title": "There’s still time to get into gold at a decent price", "selftext": "I recommend buying 10% allocation or more into physical gold bullion or gold mining stocks. NUGT is a great way to make a lot of cash in this next gold bull market.", "id": "cttvu0", "created_utc": 1566458143.0, "score": 0, "upvote_ratio": 0.33, "num_comments": 33, "comments": [{"body": "No. I made this mistake too but NUGT is for upswings. There could very well come a time of consolidation for some months where you would lose anything you made by thinking it will only go up now. Buy GDXJ for gold price rising much. GDX if you think the gold price will rise but not that much and also for a pretty safe alternative. I recommend GDXJ", "score": 3, "replies": [{"body": "Those are gold mining companies not gold itself, beware they weight to spy differently then GLD", "score": 2, "replies": [{"body": "I know. The Junior Miners will rise with a rising gold price. Firstly the gold price might rise to a higher level for a longer time, making the smaller producers profitable longer term and secondly the higher gold price and dwindling resources of bigger miners will lead to a new MA wave.", "score": 2, "replies": []}, {"body": "Yeah a lot more leverage in the gold miners. That’s where you can increase your wealth, while with gold bullion it’s mainly preserving it. CEF is basically the better version of gld.", "score": 1, "replies": []}, {"body": "Should also beware that GLD and physical gold is taxes as a collectible (28%), compared to the dividend and long term capital gains tax of 15% for GDX and GDXJ.", "score": 1, "replies": []}]}, {"body": "I’m up over 100% on NUGT. Knew the gold price would start rising about 6 months ago", "score": 1, "replies": [{"body": "The first 100% are the easiest. Still don‘t recommend such instruments on here. Do it on Twitter", "score": 1, "replies": [{"body": "KL is a safer alternative if you’re scared. I’d rather bet against the shit economy than with it.", "score": 1, "replies": [{"body": "As you see I am recommending GDXJ, so this is betting against the economy. KL is great I agree", "score": 1, "replies": [{"body": "I do think we’re on the upswing, i think the new gold bull market has already started. Fed should keep cutting rates and continue to give us boosts as the economic data goes to shit.", "score": 2, "replies": []}]}]}]}, {"body": "Everyone is gonna go into gold now because of \"recession\" fear so I wouldnt be surprised if gold tanks before going up long term.", "score": 1, "replies": [{"body": "It’ll be stagflation, that’s what people don’t get. I wouldn’t touch bonds or US dollar. Gold greatest way to preserve purchasing power in the global currency war of endless stimulus.", "score": 1, "replies": [{"body": "Yep", "score": 1, "replies": []}]}]}]}]}, {"body": "Looking at investing in gold for a short term of 6 months, are any of these listed a good idea?", "score": 1, "replies": [{"body": "KL is good, NUGT generally rises a lot more than all the regular miners when they go up. I own both. IAG, AEM, etc", "score": 1, "replies": [{"body": "Thanks, I’ll have a look into them. Are you holding for the long term or short term ?", "score": 1, "replies": [{"body": "Long term.", "score": 1, "replies": [{"body": "Do you have any that you would recommend for short term 6months - 1 year, would love to look into some more", "score": 1, "replies": [{"body": "I mean the longer you hold the more you’re going to make in this scenario. I would just ride up the gold bull market as every starts to freak out during the recession/depression we’re going to enter. High inflation will explode gold prices when they start QE4 again. Way over 2000 an oz.", "score": 1, "replies": [{"body": "Interesting I might look into KL, how long are you looking at holding this for? Do you think it’s a good time to buy?", "score": 1, "replies": [{"body": "I’m gonna hold KL for quite a while. Probably 3-5 years. Maybe more we’ll have to see what opportunities arise. But it’s already very profitable at current gold prices. Yeah great time to buy.", "score": 1, "replies": [{"body": "Interesting, I’m new to investing. So I want to research into a few different stocks to diversify, and these will definitely be one them, do you think 10k start, and 200 a week investing into stocks is a decent amount to invest? Sorry for the dumb questions.", "score": 1, "replies": [{"body": "Yeah that’s good", "score": 1, "replies": [{"body": "do you think there is plenty of room for KL to grow? As they are reaching their peak production in these years,  will they go out and make acquisitions? If they don’t the share price won’t be sustainable?", "score": 1, "replies": [{"body": "Plenty of room to grow, the higher gold price that’s going to come soon will also raise earnings. Yeah they’ll make some acquisitions too they have no debt and ~500 million cash+.", "score": 1, "replies": [{"body": "Very interesting, do you think KL is overbought and due for a pull back anytime soon? Or is it a nice time to invest a few thousand after I do some more research obvs", "score": 1, "replies": [{"body": "I would invest. Tbh not much downside. All we have to do is wait until the election. We’ll see if trump can stretch the market long enough for re-election or it’ll tank due to years of low interest rates and malinvestment. Time is on our side.", "score": 1, "replies": [{"body": "And how bad do you think it’ll tank if all goes downhill?", "score": 1, "replies": [{"body": "It won’t, economy isn’t going to keep expanding. It’ll just fluctuate a buck or two here and there.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Why not just buy /gc??", "score": 1, "replies": [{"body": "Many on this sub treat options the way 17th century settlers treated witchcraft. Futures are probably on another entry in the book of souls to be avoided/feared.", "score": 1, "replies": []}]}, {"body": "Anyone think JNUG will get back over $100 this year? (Without funny reverse split games). This action the last 1-2 weeks is disheartening.", "score": 1, "replies": [{"body": "I think so, when gold goes to 1600 in the next couple of months it’ll fly back up there I’m hoping", "score": 1, "replies": []}]}]}
{"title": "The recession is back on, boys!", "selftext": "[removed]", "id": "ctyhe3", "created_utc": 1566485399.0, "score": 21, "upvote_ratio": 0.86, "num_comments": 30, "comments": [{"body": "Donny tried his classic pump tweet lol he’s so worried", "score": 12, "replies": [{"body": "Saw that and laughed 😂😂 so predictable", "score": 1, "replies": []}]}, {"body": "Tf happened now?", "score": 4, "replies": [{"body": "Inverted yield curve again", "score": 6, "replies": [{"body": "Whew! And here I was thinking my $SPY puts were fucked.", "score": 9, "replies": [{"body": "Buy some leaps while you’re at it", "score": 4, "replies": []}]}, {"body": "Thought it was the hawkish fed", "score": 3, "replies": [{"body": "Hawkish fed led to yield inversion", "score": 3, "replies": []}]}, {"body": "I thought it inverted \"again\" yesterday?", "score": 2, "replies": [{"body": "It inverted then verted now it’s inverting and staying inverted", "score": 3, "replies": [{"body": "Psh I can't see it staying inverted for too long. It shot back up before the fed put out the fire today", "score": 3, "replies": []}, {"body": "Fine. Staying inverted for like 30 minutes.", "score": 1, "replies": []}]}]}]}, {"body": "Yield curve inverts once again\nhttps://www.cnbc.com/2019/08/22/us-bonds-treasury-yields-tick-higher-ahead-of-jackson-hole-symposium.html?__source=iosappshare%7Ccom.apple.UIKit.activity.Message", "score": 3, "replies": []}, {"body": "idk just seemed to dump. trump jealous tweeted about germany's negative rates not long ago but i haven't seen anything else.", "score": 2, "replies": [{"body": "Yea we really dumped, the dow is down a whole quarter percent. Stock up on canned goods.", "score": 7, "replies": [{"body": "And the heavy rotten ham sandwich portfolio wins again.", "score": 2, "replies": []}, {"body": "A QP is a QP...", "score": 2, "replies": []}, {"body": "I mean relative to the time span and the past few days, yeah. Quick sell off, drop, dump... it's just semantics.", "score": 1, "replies": []}]}]}]}, {"body": "I could use a little more red ...", "score": 3, "replies": []}, {"body": "Glad I sold calls", "score": 3, "replies": [{"body": "I literally just sold some put credit spreads. Now I don’t know whether to close or ride to tomorrow lol", "score": 1, "replies": [{"body": "Things will bounce back, unless you sold FD I’d hold. But knowing this WSB, you’re probably screwed", "score": 2, "replies": [{"body": "$288/279.50 expiring tomorrow. I think it’ll hold. Maybe. I’m also bad at this so y’know", "score": 1, "replies": []}]}]}]}, {"body": "Buy gold, stock up on ammo and collect rainwater. Tariff man is hitting the gas as he's getting closer to the cliff.", "score": 5, "replies": []}, {"body": "I have MU sold covered calls and MU is green.......", "score": 2, "replies": [{"body": "I found out yesterday, one of Japan's master plan for war-ing with Korea is so that Samsung's chip making capability to depreciate, hence making MU and Toshiba's memories world domination once more.", "score": 1, "replies": []}]}, {"body": "I bought calls. I should start doing the opposite of what I feel. RIP 2K gains.", "score": 1, "replies": []}, {"body": "Why can't we have some meats?", "score": 1, "replies": []}, {"body": "This post is not aging well.", "score": 1, "replies": []}, {"body": "Heh... bulls (dumb money) are going to be losing a lot of money. I like it.", "score": 0, "replies": []}]}
{"title": "GPS(Gap) ER Calls", "selftext": "Summary: GPS expected EPS is 0.52 a full 30% less than last year's quarter. Although I think that they will go down from last year's quarter, 30% is extremely harsh and I expect an EPS of about 0.60-0.65.\n\n1.Their online stores are up. Old Navy and Athleta both experience an increase in search results over this last quarter compared to last years quarter. Only Gap itself is down(-8% in search trends), but Old Navy(+1.2%), which constitutes a majority of their sales, and Athleta(+2.6%) are up.\n\n2. Discount retailers like WMT and TGT have beat their earnings significantly. If other companies in the industry are any indicator of how companies do, then GPS will also beat earnings. Discount retailers are doing great right now and I would expect GPS to not do terribly.\n\n3. Their aversion to China. In their Q1 guidance they stated that they will be moving their supply chain out of China. I think that they will most likely continue doing that(why wouldn't they) and will have strong guidance for this quarter as they won't be affected by tariffs(something that would seriously harm their already slim profit margins).\n\n4. Gap would do well in a recession because they are a discount retailer. They were hit pretty bad during the last one, but if an upcoming recession were to happen, they would do better in it because they have significantly shifted further to discount clothing and consumer confidence is higher than last time. People still need clothes when they're poor and when they're poor they buy cheap clothes like perhaps from old navy.\n\nBasically, their physical retail sector would have needed to crash like 40% for the surprise to be near 0. This is pretty unlikely and I think that they'll beat the expectations by like 0.10-0.15.\n\nTLDR: GAP calls expiring tomorrow  \n\n\nhaha my eps guess was exactly correct", "id": "ctyjfy", "created_utc": 1566485648.0, "score": 11, "upvote_ratio": 0.92, "num_comments": 32, "comments": [{"body": "Puts because when I wore gap people called me Gay Ass Person in elementary school", "score": 24, "replies": [{"body": "Your boyfriend probably calls you that too.", "score": 11, "replies": [{"body": "Nah he says Great Ass and Penis", "score": 18, "replies": []}]}, {"body": "Gap was bought by middle class which was funny so you gay but also wealthy just like the mods here", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 4, "replies": [{"body": "Yeeeeep", "score": 1, "replies": []}]}, {"body": "Puts, many banana republic stores closed and GPS is definitely downsizing their brick and mortar stores. A 1.29% increase in old navy online search results is not significant when dicks sporting goods reported a 21% increase in online purchases today and they didn’t pop.", "score": 3, "replies": [{"body": "Closing unprofitable stores isn't bad.  I'm not betting that they'll grow, I'm saying that they won't lose as much money as the expected eps says they will.", "score": 0, "replies": [{"body": "Yeah but why would you buy full priced items when they’re always 40% off. I think if GPS stopped providing so many coupons and actually priced their clothes accordingly, there wouldn’t be a 30% decrease in expressed EPS", "score": 1, "replies": []}]}]}, {"body": "GPS is not a discount retailer by any stretch. Most of their brands (GAP, Banana Republic) are built around full-price sales. They're spinning off the only one that isn't (Old Navy): https://www.nytimes.com/2019/02/28/business/gap-old-navy-spinoff.html.", "score": 4, "replies": [{"body": "Every time I see a Banana it’s always doing a 40% of discount so that makes it a discount retailer", "score": 2, "replies": [{"body": "Yea, every time I see my friend he’s holding a football so he’s an NFL player.", "score": 2, "replies": []}]}, {"body": "\"Gap is aiming to complete the transaction in 2020\" So not in this quarter. And have you ever been to a gap? Look at their website right now, they have 40% off with 20% on top of that. It's always like that.", "score": 1, "replies": [{"body": "All retail is like that. JCP got fucked the moment they tried to not be like that and had to go back to that sort of shit with tail between their legs and the downhill slope was unstoppable by then.", "score": 2, "replies": [{"body": "Still, Gap is cheaper than average, and Old Navy, which constitutes a majority of their revenue, is growing and hasn't split off yet.", "score": 1, "replies": [{"body": "The only people a knew that shopped at gap were teenagers. The only teenagers I know now only wear athletic gear. LONG DICKS, SHORT GPS", "score": 2, "replies": []}]}]}, {"body": "[1] No, I don't shop at Gap, and I don't know anyone who does, which is most of the DD I need.\n\n[2] Discount retailer =/= anyone who runs a sale. Discounter retailers are traditionally classified as those with lower full-price items that occasionally run sales on top of the full-price. Retailers like Gap often get slammed during conference calls for exactly what you said, which is discounting full-price merchandise in a way that eats into margins. Just ask the fine folks at KSS.\n\n[3] I didn't say that the Old Navy transaction was going to be completed this quarter. There's just a clear two-headed-monster here. GPS's full-price brands aren't doing well, and most everyone agrees that Old Navy is the only valuable part of the portfolio. ER will highlight that. To people looking to buy GPS now as a way to access the Old Navy stock when it splits, that's fine. For everyone starting to think of GPS as a standalone set of brands, ER is going to highlight just how poor the performance among that set really is (with the exception of Athleta: https://www.businessinsider.com/athleta-ceo-success-reminder-gap-struggles-2019-7).", "score": 2, "replies": []}]}]}, {"body": "I'm playing the IV, selling before market close I think.", "score": 2, "replies": [{"body": "It’s only pricing in a 35cent move on earnings from my calculations", "score": 1, "replies": [{"body": ">my calculations\n\n*Checks flair*\n\n[X] Doubt", "score": 2, "replies": []}]}, {"body": "If I had done this a week ago when I was up $600, I would have been up $600 and not down $2000. \n\nSmart play.", "score": 1, "replies": [{"body": "It's looking like I will be up 30-40% heading into end of the day. I've got 4 contracts on it so debating whether to close them all or keep 1 in case they Nordstrom up or something. Nordstrom's increase today is crazy considering how lukewarm the ER was.\n\nI have a few ROST too which are up nearly 100% from yesterday, debating on what to do with those too. Ironically, what I lost on JWN puts I may have regained on seeing how IV spiked and caused options prices to shoot up end of day heading into earnings on those.\n\nI like doing things this way than trying to play OSTK post-halt today at peak IV (only 1 contract but I thought it was going to shoot up a lot more than it did and I'm down 80% on it). :/", "score": 1, "replies": [{"body": "I’m mad because I sold my Nordstrom calls around the open this morning. Should’ve held. If I was in your position I’d probably sell half the contracts.", "score": 1, "replies": [{"body": "Honestly, I wouldn't blame anyone for selling them. AH/PM they were going down from the 12% right after ER. I certainly didn't think with a lukewarm ER they'd ever get up 15-16% today.\n\nOn mine, I Just closed all but 1 of each. I doubt both will go south - 1 or both should do well on earnings. I'm more confident in ROST on that just because I think discount stores will own retail in all facets soon enough and ROST is more of a discount store than GPS, but we'll see.", "score": 1, "replies": []}]}]}]}]}, {"body": "Got my puts", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Click Here to read fresh WSB DD.](https://new.reddit.com/r/wallstreetbets/search?sort=new&amp;amp;restrict_sr=on&amp;amp;q=flair%3ADD).\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs [HERE](https://www.reddit.com/r/wallstreetbets/wiki/linkflair).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Had puts on URBN & JWN, was going to get puts on GPS as well -- now thinking about getting calls... fade me bros", "score": 1, "replies": [{"body": "lol I had the exact opposite plays", "score": 2, "replies": [{"body": "following you this time, my apologies ahead of time!", "score": 2, "replies": []}]}, {"body": "It's time to join bull gang", "score": 1, "replies": []}]}, {"body": "I regret not calling on LB, even though I was certain they'd crash.  I'll probably lose that.  And if they'd didn't wreck, I can't imagine GPS will.  But I have enough idea of that as a banana, and I don't taste as good.\n\nI did a 21.5c at .12.  I'm losing out on one tendie meal.", "score": 1, "replies": []}, {"body": "Bought 40 20c and sold 90 21c free IV money", "score": 1, "replies": []}, {"body": "Is this what they mean when they say Non-GAAP earnings?", "score": 1, "replies": []}]}
{"title": "Looks like Morgan Stanley stole our BECKY idea!", "selftext": "[deleted]", "id": "cu18c4", "created_utc": 1566497406.0, "score": 90, "upvote_ratio": 0.94, "num_comments": 29, "comments": [{"body": "How could they forget pins? Idk a single women who doesn’t have a pinest with 999useless dresses on it", "score": 58, "replies": [{"body": "WSB collectively fucking hates PINS which makes it a fantastic long. See all the shit talk in that $3.5M PINS post 👌", "score": 31, "replies": [{"body": "Ya but Becky loves that shit", "score": 12, "replies": []}, {"body": "I love PINS.  Wife finds great recipies on there all the time.", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "Should have had MS pin it on their board", "score": 3, "replies": []}]}, {"body": "flair fits accordingly", "score": 2, "replies": []}]}, {"body": ">MS observes that single women outspend the average household\n\nLmfao. Somehow this will be blamed on the patriarchy forcing them to buy those products", "score": 52, "replies": [{"body": "sTOp maKINg mE wANt tO bE PReTty", "score": 32, "replies": []}]}, {"body": "Shit does this mean it's over?", "score": 9, "replies": [{"body": "Don’t cry because it’s over, smile because it happened.", "score": 29, "replies": []}]}, {"body": "Morgan stole our $Becky!", "score": 8, "replies": []}, {"body": "Tesla? Do single women buy Teslas? All I ever see are nerds on YouTube jizzing in their Teslas", "score": 11, "replies": [{"body": "Yep, this is true. https://www.usatoday.com/story/money/cars/2019/07/08/tesla-electric-cars-women-elon-musk/1616632001/", "score": 1, "replies": []}]}, {"body": "My ex recently added to this statistic . 👌 I gotchu WSB fam", "score": 6, "replies": []}, {"body": "Ok what public company makes dildos and other sex toys? I think this is a good long term  play", "score": 2, "replies": []}, {"body": "This article convinced me to sell 1k of my CRM calls to ROSS. 5 minutes before close. Mega autist.\n\nAt least I still had 1k of CRM.", "score": 1, "replies": []}, {"body": "Target had such great Q2 because of their Vineyard Vines collaboration. My GF bought so much useless crap.", "score": 1, "replies": []}, {"body": "Go long on pharma companies too. Single women are much more depressed that partnered women. Tons of antidepressant and anxiety scripts are going to be written. Baby fever is real, it’s a women’s biological clock ticking away. When a women realizes that she wants children, but because she’s older having them will increase the chances of complications.... it’s a sad thing. So start buying calls on big pharma stocks my goyium. Plenty more autism causing vaccines to come as well. Which is caused from the thiomersol and aluminum hydroxide used in them", "score": 2, "replies": [{"body": "Nah son antidepressants are all genericised now and are as cheap as chips", "score": 1, "replies": []}]}, {"body": "Eww, Tesla is not part of the SHEconomy. It’s for weird internet nerds, typically male, that like Elon Musk and defend him vigorously", "score": 1, "replies": []}, {"body": "Sorry guys, my boss really liked the idea and I got a nice bonus for it, so...", "score": 1, "replies": []}, {"body": "the whole becky idea wasn't started here idiot", "score": -16, "replies": [{"body": "Hey! They are not idiots. They are retards. Being an idiot is a choice, these people are born retarded and I respect that.", "score": 25, "replies": [{"body": "Speak for yourself", "score": 1, "replies": []}, {"body": "The real question is, would a retard know if you called it an idiot?\n\nAnd would it be offended?\n\nI for one answer no, and I’m not sure, respectively.", "score": 1, "replies": []}]}, {"body": "I'm pretty sure I read about Becky like 3 years ago on here.", "score": 4, "replies": [{"body": "becky is nothing more than shopping trends of a consumer group, it's literally been looked at since forever", "score": -6, "replies": []}]}]}]}
