{"title": "I've been paper trading NVidia for about a month and making successful \"gains\"", "selftext": "[deleted]", "id": "1b82ogp", "created_utc": 1709739345.0, "score": 0, "upvote_ratio": 0.28, "num_comments": 55, "comments": [{"body": "yes, now that you've made fake gains paper trading, you are ready to buy NVDA near ATH and lose real money!", "score": 113, "replies": [{"body": "That's what people were saying when nvidia was $300 a share and there was a massive sell-off. When it dropped to $200 a share some were even saying it would take years to recover. Nvidia is possibly a bargain at $850 a share right now", "score": 21, "replies": [{"body": "me im one of those! i was close to jumping in 25k when it was 80, then again at 400 but i was scared.", "score": 5, "replies": []}, {"body": "Last time NVIDIA was at an ATH (end of 2021), it lost close to 70% in value (fall of 2021 to fall of 2022). Will it lose more than half its value in the near future? Probably not. Could it lose 5-10-15% ? Maybe, I can see it happening. As a rule, you should never invest in an ATH. Wait for a correction.", "score": -12, "replies": [{"body": "As a better rule, never time the market. For all we know, today’s highs are tomorrows low.", "score": 15, "replies": []}, {"body": ">As a rule, you should never invest in an ATH\n\nLmao. My two best performing stocks were bought at ATHs. Truly insane comment", "score": 11, "replies": []}]}]}]}, {"body": "\"just trade with this trend until it consolidates\"\n\noh boy\n\n\"the only risk that could happen is if the stock quickly tanks which is unlikely correct?\"\n\noh no.\n\nHere's the issue. You've been paper trading a stock that has been riding a bull wave. With no real money on the line, you're likely buying every dip and feeling those endorphins charging through your brain with every uptick. Feels great doesn't it!\n\nBut when you're in the real game, with real money on the line, your psychology messes with you. Oh no! NVDA went down 1%!!! Should you buy the dip? Those $1000 dollars you put in are now $990! Oh well, lets buy the dip!\n\nWait, what, another 2% drop? How long is this going to go on? Jim Cramer says NVDA is topped out!?!?!?! BENZINGA is warning of a high P/E!!!! OH NO SELL SELL SELL\n\nYou see where I'm going with this?\n\nYOU DONT KNOW WHEN THE \"trend will consolidate.\" YOU DONT KNOW \"when the stock will quickly tank.\" You need to develop either a long term mindset, where youre investing steadily and not really worrying about short term movements, or you need to have an exit target and stick to it no matter what. Both require discipline. If you believe you can spot \"until it consolidates,\" that tells me you don't have either of these mindsets or the discipline required. Stick to index funds.", "score": 11, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Lol", "score": 2, "replies": []}]}, {"body": "Alright thanks bro!", "score": 1, "replies": []}]}, {"body": "i mean Nvidia has been going up.", "score": 9, "replies": [{"body": "The trend will “consolidate” as soon as OP starts trading real money.", "score": 4, "replies": []}, {"body": "My penis also goes up when my girlfriend is around me. Goes down when she's not. I don't know how my penis works.", "score": 2, "replies": [{"body": "Looks like you know: girlfriend 👆 no girlfriend 👇", "score": 2, "replies": [{"body": "Money 👍 No money👎, my big brain penis also works like that", "score": 0, "replies": []}]}]}]}, {"body": "Yeah why aren’t you using real money?", "score": 3, "replies": [{"body": "Because people are saying don't trade with real money until you have traded for a minimum of 6 months and have a succesfull strategy. Yet trading Nvidia right now seems like a fool proof strategy.", "score": -5, "replies": [{"body": "Yes sink some real money in because paper trading doesn't mean shit until you have actual skin in the game.", "score": 17, "replies": []}, {"body": "Anyone who told you this is a fool. Paper trading builds false confidence and bad habits. \n\n\n\n>Yet trading Nvidia right now seems like a fool proof strategy\n\nActually nevermind, you're clearly not ready to trade for real", "score": 10, "replies": []}, {"body": "That’s crazy. I’d say you should never trade with paper money and only trade with real money. It teaches you a lot more lessons than paper.", "score": 4, "replies": []}, {"body": "There is no fool proof strategy.  We are all fools sometimes.  So, go ahead and trade — but don’t invest so much that your investment decisions are based on hope and fear.", "score": 2, "replies": []}, {"body": "Hahaha \n\nUpvote for you.", "score": 1, "replies": []}, {"body": "So much garbage in one comment…", "score": 1, "replies": []}]}]}, {"body": "Lol why are you paper trading with something that only goes up? What do you think you’ve learned", "score": 3, "replies": [{"body": "Honestly, trade the trend 🤣.", "score": 0, "replies": [{"body": "Yes but not the point. You don’t know if your system works. Whatever your trading on can’t fail if the stock goes one way so you’ve learned nothing about the system", "score": 1, "replies": [{"body": "We are on /r stocks, not r/ daytrading", "score": 0, "replies": []}]}]}]}, {"body": "Cool story.\n\nNow let’s hear about the unsuccessful paper trades you made.", "score": 2, "replies": []}, {"body": "If we all knew what was going to happen in the stock market, we'd all be billionaires!\n\nMy advice would be to just be careful with how much money you invest.  In other words, don't put your life's savings on the line.  Start with an amount that won't ruin your life, were you to lose it.  I only own 18 shares of NVDA.  15 were purchased when shares were around $200.  The last 3 I added right before they announced the last earnings (in the $600 range).   I think we'll see NVDA shares cross over $1000 relatively soon, but beyond that, I'm not sure what happens.  Will it crash by 50%?  Will it keep surging?  Only time will tell.", "score": 2, "replies": []}, {"body": "You haven't factor in the real emotional stress of losing hard earned money or avoiding the so called gambler's mentality. Next is to trade SMALL with real money, learn to diversify your portfolio, and rebalance it regularly. \n\nPaper money is a good start nevertheless.", "score": 2, "replies": []}, {"body": "TSMC could be a better play right now than NVDA.\nNot saying NVDA won’t keep growing, but it becomes more and more volatile.\nTSMC seems to have a better upside potential.\nYou don’t need an important experience to trade stocks if you stick to companies with good fundamentals.\nHowever, avoid playing with options until you have a long paper trading experience, or never get into options, it’s even better.", "score": 2, "replies": []}, {"body": "Don't trade, learn to invest. You're thinking too short term, you need to look at the bigger picture. No one knows what will happen that is why it's important to be **IN** the market as much as you can so that when gains happen, like you experienced with NVDIA, your money is not sitting on the sidelines.", "score": 2, "replies": []}, {"body": "Why exactly are you going to buy NVIDIA at this price?  What metrics are you using to justify the purchase?  Is it stock price or fomo or something else? ", "score": 1, "replies": [{"body": "The fact that it keeps going up? In my paper trading I'm just trailing my stop losses and it seems to be working out, I've only been stopped out twice.", "score": -2, "replies": [{"body": "Because it keeps going up is not a good reason to invest.  Look at their revenue chart quarter over quarter. Look at earnings report and look at guidance.  Based on those report back if you should still invest.  Also decide on what changes would make you sell.", "score": 5, "replies": [{"body": "I will look into that stuff thank you", "score": 2, "replies": []}, {"body": "They’re trading not investing", "score": 1, "replies": []}]}, {"body": "Invest your real money into VOO.", "score": 1, "replies": []}]}]}, {"body": "You wouldn’t be feeling this way if nvidia wasn’t on a tear… you happened to have picked a good stock on a ride. Don’t mistake luck for skill.", "score": 1, "replies": []}, {"body": "Nvidia may climb to $1k to $1200.  Reality that growth jump between last and present quarter.  Will not be repeated.  I doubt you will lose money, if you intend to hold 5 years plus.  It is a real possibility it may drop substantially next quarter.  As it is a real possibility earnings may drop.  I won't be selling my Nvidia.  I am in it for the long haul.  I am no longer bullish on it like I was even last October at $400 share.  Expecting the money to come in for those GPUs.  Even though the earnings from the H-100 GPUs may decrease.  I still see them as a strong hold.  We'll see if the Tegra 2 an AI dual-core AI optimized gpu for smart phones.  Or the A100X AI optimized GPU for telecom infrastructure takes off.  If either of those products do.  They will provide even more growth.  As we know the Tegra K1 and X1 chips for smartphones were a flop.  This time around the big difference is the AI.  Where their superior product may be in demand.", "score": 1, "replies": []}, {"body": "Should probably go to the other sub if ya wanna be regarded", "score": 1, "replies": []}, {"body": ">I mean the only risk that could happen is if the stock quickly tanks which is unlikely correct?\n\nHeh.\n\nAnyway, everyone is a financial genius in a bull market. Bear markets are where the wheat will be separated from the chaff.", "score": 1, "replies": []}, {"body": "Must be a genius", "score": 1, "replies": []}, {"body": "If you don’t mind me asking, what strat are you using? What numbers are you looking at? I’m doing my best to research and would love to know what you look out for.", "score": 1, "replies": []}, {"body": "If a monkey wiped his ass the newspaper and picked NVDA the monkey would have been rich too.\n\nSlowly ease into your system over a few years. And just when it seems like it's going great it's probably time to be really cautious.", "score": 1, "replies": []}, {"body": "There's always another \"start of the bull\" around the corner, so don't feel the pressure to rush. There's an NVDA type stock every single cycle.  \nThe thing about learning in this environment is everything is really easy. Moves up are huge, and a lot moves up together. The tricky part is understanding when things are beginning to cool off, and without a cycle or two of experience youll find yourself trying to force calls right into day after day of red.  \n\nDon't paper trade forever, but until you've spent time understanding how to build invalidations into your setups, and are diligent about them, know that you are going to gonna find yourself bleeding one day while everyone around you is patting themselves on the back for seeing the clues.   \n\nYour first bull market teaches you how to lose everything, but if you can stick around long enough to make it back while the market moves sideways, you'll be able to trade through anything.", "score": 1, "replies": []}, {"body": "Congrats! Just keep in mind we’re in the middle of the biggest bull run since 1971. We may never see a market like this again in our lives. Get excited for the downturn and see how you do then. Should be significantly more challenging. But only you can decide when you’re ready to invest. If history is any indication, one year from now the market will still be up. Dips will come though. They always do. 3-5/year on average and we haven’t had any!", "score": 1, "replies": []}, {"body": "paper trading should\nonly be if your under 18, barely anyone knows what there doing ever especially in the beginning best way is to start and learn by your mistakes", "score": 1, "replies": []}, {"body": "Don't go there.", "score": 0, "replies": []}, {"body": "No kidding I blindfolded my dog and told him to shit on a call on nvdia and we bought and made 3000 in one day.  Congratulations genius.   I’m surprised CNBC hadn’t called to have you on.  Fcking next warren Buffett.  I think they give out a trophy for best paper trader of the year.  You should enter.", "score": 0, "replies": []}, {"body": "you can exchange paper money for real money after you hit a highscore /s", "score": 0, "replies": []}, {"body": "Can I buy your course or join your telegram channel?", "score": -1, "replies": []}]}
{"title": "Autonomy to change Tesla's destiny forever.", "selftext": "Wake up if you are still sleeping on Full Self Driving. Imagine going back in time when everybody used dumb buttoned phones, and then smartphones came and took over the industry by storm with ridiculously high and swift adoption rates.  \nNon autonomous vehicles would be complete obsolete in coming years, restricting their use case to “fun-leisure driving“ and everything else in between with combined market share of less than 10 - 5 - 1 percentage points within a decade or two (run your imagination).  \n**Now ask, who in this world is going to run all those autonomous vehicles; our best guess Tesla and China. China in China (due to security concerns) and Tesla - rest of the world.**  \n\n\nWe cover Tesla and industry news, happenings and insights in our daily newsletter at 69shadesoftesla\\[DOT\\]com , join awesome & focused community of long term holders to find some support in these rough times!", "id": "1b822m8", "created_utc": 1709737851.0, "score": 0, "upvote_ratio": 0.42, "num_comments": 61, "comments": [{"body": "Owning Tesla.   Car and (a bit of) stock.\n\nAutopilot is only just OK.  Can't speak about EAP, because everyone that has it and that I ask about, just hates it.   So I haven't bought EAP.\n\nVision (parking sensors) is more or less OK.\n\nEasy stuff like auto wipers are just terrible.\n\nSo.  The leap to FSD seems a far stretch to me.  To put it politely.\n\nThe basic technology of the car (battery, SC, engine, road behaviour, quality) is very good.  And the question if Tesla will reach FSD, is not relevant.  They probably will, as with every other unrealistic goal that Tesla has reached until this day.\n\nThe question is that if and when Tesla reaches FSD, will it be on time (compared to what e.g. huawei is capable off already today), will it be avaible for the current technology stack, will Tesla have the power / knowledge / political saviness and leverage to allow it on the public roads, and in the assumption that all of this happens will it be available in a way people are willing to put money on the table for it.   Because reputation comes on foot, but leaves on a horseback.  And the way Tesla is put in the market now (no ads, and a CEO that doesn't stop undermining the company, customers paying for a service - FSD - that does not exist and that is not transferable to a future car) doesn't help building a good reputation.   I see a lot of peers with money not having Tesla as a brand in their \"evoked set\" (to put it in marketing terms) when buying a new car.  BMW, MB, Volvo, that's all in it, but Tesla?   This because they are not aware of the value proposition, or because the negative fuzz around the company and the CEO is just a red flag for them.", "score": 8, "replies": [{"body": "I talked to a Tesla marketing employee at a cybertruck event this weekend. I mentioned brand concerns to which they said “all publicity is good publicity”… \n\nto which my concerns are the same as yours as far as my peers’ view on the brand as a viable vehicle option come buying time.  \n\nI really hope that what I was told, was not from the top down.", "score": 2, "replies": []}]}, {"body": "Lmfao 🤣", "score": 4, "replies": []}, {"body": "Hahahahhahahahabaha\n\nMan you rubes deserve to lose every last dollar while Elmo laughs at you in Afrikaans ", "score": 9, "replies": []}, {"body": "Cameras don’t work for the auto wipers but sure that is the future of self driving. \n\nLet me guess it is one year away\n\nTell Elon I would rather have a horse than one of his crappy MAGA cars", "score": 10, "replies": []}, {"body": "https://preview.redd.it/djue9dnq4rmc1.jpeg?width=739&format=pjpg&auto=webp&s=7957e1bc38122cf6c6385b5cdc3d5839131806a3\n\nThi/s is how smart your Papa Musk is", "score": 5, "replies": [{"body": "Dude is the epitome of the stupid guy using words he doesn't even understand in random order to try and convince others he's smart. You know the guy, we all have at least one in our lives. Often too many...", "score": 1, "replies": []}]}, {"body": "Full self-driving cars will never happen until all vehicles are self-driving, communicate with each other, and infrastructure is massively upgraded.", "score": 4, "replies": []}, {"body": "I can't even tell if this is satire. I hope it is lol.", "score": 6, "replies": [{"body": "Full self driving is not only good, it’s better than 90% of first time drivers. But is improving at an exponential rate, every year that goes by, it’s ability to handle situations goes up by 10 years. 2025 it’ll drive better than the average 35 year old. The catch though? It never ceases to improve, it’ll drive better any human that has ever existed in a few years. \n\nSimilar to how chatgpt can write stories, or stable diffusion creates better and more abundant art today that 99% of artists. \n\nIt’s simple really, AI never stops improving!", "score": 3, "replies": [{"body": "\"All Tesla vehicles produced in our factory, including Model 3, have the hardware needed for full self-driving capability at a safety level substantially greater than that of a human driver.\"\n\n2016", "score": 6, "replies": [{"body": "This is how Tesla's FSD software is already superhuman in some areas - it has an attention span that is never distracted and always thinking and seeing the environment. No human can focus 100% of the time like Tesla's FSD can. Its reaction time is also exceptionally fast to the driving environment on the road.", "score": 2, "replies": [{"body": "Level 2 adas. Driver is still in control.\n\n0 self driving miles. ZERO. Not 1,000,000+ miles like Waymo and Cruise.", "score": 6, "replies": [{"body": "Rivian Automotive, Inc.\nEquity\nAuto Manufacturers\n10.86\n-89.87 (-89.22%) All Time. 🫣\n\nTesla, Inc.\nEquity\nAuto Manufacturers\n175.54 +173.95 (+10,919.46%) All Time. 🤤\n\n\nChili chili booom boom boOOM", "score": 0, "replies": [{"body": "**December 2015 \"**We're going to end up with complete autonomy, and I think we will have complete autonomy in approximately two years.\"\n\n**January 2016 \"**In \\~2 years, summon should work anywhere connected by land & not blocked by borders, eg you're in LA and the car is in NY\"\n\n**October 2016 \"**By the end of next year, said Musk, Tesla would demonstrate a fully autonomous drive from, say, a home in L.A., to Times Square ... without the need for a single touch, including the charging.\"\n\n&#x200B;\n\nAll muskrat lies.", "score": 5, "replies": [{"body": "Rivian Automotive, Inc.\nEquity\nAuto Manufacturers\n10.86\n-89.87 (-89.22%) All Time. 🫣\n\nTesla, Inc.\nEquity\nAuto Manufacturers\n175.54 +173.95 (+10,919.46%) All Time. 🤤\n\nBabchinchi", "score": 1, "replies": [{"body": "You so upset and triggered you just copy/paste the same response? I don't care if Rivian goes bankrupt but apparently you do.\n\n**April 2020 \"**we could see robotaxis in operation with the network fleet next year, not in all markets but in some.\"", "score": 3, "replies": [{"body": "Again with the English.  ‘Could’ is no definitive 😂\n\nWhat do this number say baby? \n\nRivian Automotive, Inc.\nEquity\nAuto Manufacturers\n10.86\n-89.87 (-89.22%) All Time. 🫣\n\nTesla, Inc.\nEquity\nAuto Manufacturers\n175.54 +173.95 (+10,919.46%) All Time. 🤤\n\nBHUGUBGUGA!", "score": 2, "replies": [{"body": "Over $600B market cap eviscerated. Who cares about Rivian? \n\n**December 2020**I'm extremely confident that Tesla will have level five next year, extremely confident, 100%\n\n&#x200B;\n\n**January 2021**FSD will be capable of Level 5 autonomy by the end of 2021\n\n&#x200B;\n\nLOL at that absolute that was an utter fail.", "score": 2, "replies": [{"body": "Here some definite numbers for you 😝 please explain me the numbers below? What mean?\n\nRivian Automotive, Inc.\nEquity\nAuto Manufacturers\n10.86\n-89.87 (-89.22%) All Time. 🫣\n\nTesla, Inc.\nEquity\nAuto Manufacturers\n175.54 +173.95 (+10,919.46%) All Time. 🤤", "score": 0, "replies": [{"body": "OK MAGA boy.", "score": 2, "replies": [{"body": "What mean dis number 10000% all time? Please explain me you fact checker\n\nRivian Automotive, Inc.\nEquity\nAuto Manufacturers\n10.86\n-89.87 (-89.22%) All Time. 🫣\n\nTesla, Inc.\nEquity\nAuto Manufacturers\n175.54 +173.95 (+10,919.46%) All Time. 🤤\n\n\nWhat a hug bumbarod?", "score": 0, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "My autowipers have the attention span of a horsefly.", "score": 2, "replies": []}]}]}]}, {"body": "Bro, half the Elon/tealaverse is just clowns like this pumping other clowns up with absolutely zero substance. That’s how the greatest hour of cards was built.\n\nNow it’s finally coming crashing down and the rubes at the bottom of the pyramid will be the ones that will hold 100 billion dollar bags, collectively. \n\nI wouldn’t recommend going too far down the rabbit hole but check out some of the Tesla pumpers on YouTube. Literally on a live stream 7 days a week pumping with no logic behind it. And rubes  not only buy it, they send the pumpers money too! Cults fascinate me. It’s like people barely making rent sending Trump money so he can do things that harm the same rubes even further. Just absolutely fascinating stuff…", "score": 3, "replies": [{"body": "Aren't they already bag holders of $600,000,000,000+? \n\nIt really is a cult isn't it? You got people on here saying Tesla will have a market cap of over 2T within the next couple years...", "score": 3, "replies": [{"body": "The internet opened up a world of cons that conmen previously could only run on people in their immediate vicinity. And also came with more risk as said people could grab you by the neck and end you.\n\nNow you have people sitting in Indonesia or whenever pushing maga, pushing Jesus, pushing Tesla and a 1000 other things. And there is never a shortage or rubes that’ll lock into one of the cults because thinking critically for yourself is too hard. ", "score": 3, "replies": []}]}, {"body": "Couldn’t agree more. But some of the devout are looking sideways and sneaking out the back of the church early", "score": 2, "replies": []}]}, {"body": "Rivian Automotive, Inc.\nEquity\nAuto Manufacturers\n10.86\n-89.87 (-89.22%) All Time. 🫣\n\nTesla, Inc.\nEquity\nAuto Manufacturers\n175.54 +173.95 (+10,919.46%) All Time. 🤤", "score": 2, "replies": [{"body": "“I really consider autonomous driving a solved problem,” Musk said “I think we are probably less than two years away.” 2015\n\n&#x200B;\n\n2015!", "score": 3, "replies": [{"body": "‘I consider’/‘I think’ in English, are assumptive statements involving cutting edge tech. But still…..\n\nRivian Automotive, Inc.\nEquity\nAuto Manufacturers\n10.86\n-89.87 (-89.22%) All Time. 🫣\n\nTesla, Inc.\nEquity\nAuto Manufacturers\n175.54 +173.95 (+10,919.46%) All Time. 🤤\n\n\nRivian is hot steaming doghhhshiiittt!!! 😂\n\nFLUSHHHHHHH", "score": 0, "replies": [{"body": "Look at the last 6 months.", "score": 3, "replies": [{"body": "[removed]", "score": -1, "replies": [{"body": "What is your cost per share?", "score": 3, "replies": [{"body": "Been holding a long time kiddo. So long that when it dipped close to 100, I was still averaging up. The specifics of which, are none of your Godamn stinky business.", "score": -1, "replies": [{"body": "I bet you don’t even have any shares. \n\nIf you do and bought so low you are not a good at investing. Think of the money you lost so far and it is only going lower. \n\nEach day for the next few years you turn your success into failure.", "score": 3, "replies": [{"body": "His post history shows hes only simping for Tesla/TSLA for less than a year so I'm betting you are spot on with your comment. Dude calls Elon his king and worlds great human...", "score": 3, "replies": []}, {"body": "[removed]", "score": 0, "replies": [{"body": "Are you a bot?", "score": 3, "replies": [{"body": "No, are you?", "score": 0, "replies": [{"body": "I am not the one posting the same thing", "score": 2, "replies": [{"body": "Is that what bots do? You sound like a bot.", "score": 0, "replies": []}]}]}]}]}]}, {"body": "You probably have 3 shares you bought at $400 and try your bestest to pump TLSA on reddit like a good little simp. Guessing you are barely out of your teens, sonny. You seem to only have become obsessed with TSLA/Tesla less than a year ago.", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Whats your avg price? Funny you won't respond to that. You only found out about Tesla a year ago and became obessed. Did you have a stroke?", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Whats your point? Most startups that make it have growth like that. And TSLA market cap crashed over $630B. Whats your point exactly? You sound like you had a stroke and just repeat yourself over and over.\n\nYou dont own any shares. Funny you worship musk but can't even tell anyone your avg price.", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "You sound like you are having a meltdown just like Muskrat is. You also have an alt account you praise yourself like \"Adrian Dittman\"?", "score": 2, "replies": []}, {"body": "Please please kiddo, explain just this. Shouldn't stock go up over the long term (last 3 years)?\n\nhttps://preview.redd.it/qvvdbbwqrrmc1.png?width=2093&format=png&auto=webp&s=b3197664029dbb3d14d1e694adaab52566e7e864", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "\"Hello. Image/Link submissions are manually reviewed due to spam control. -1B\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "You seem to think I care about Rivian lol. Good for you. \n\n&#x200B;\n\n\"All Tesla vehicles produced in our factory, including Model 3, have the hardware needed for full self-driving capability at a safety level substantially greater than that of a human driver.\" 2016", "score": 1, "replies": [{"body": "Rivian Automotive, Inc.\nEquity\nAuto Manufacturers\n10.86\n-89.87 (-89.22%) All Time. 🫣\n\nTesla, Inc.\nEquity\nAuto Manufacturers\n175.54 +173.95 (+10,919.46%) All Time. 🤤", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Brakakakacha!", "score": 1, "replies": [{"body": "“By the middle of next year, we’ll have over a million Tesla cars on the road with full self-driving hardware, feature complete, at a reliability level that we would consider that no one needs to pay attention,”\n\nOctober 21, 2019 Elon Musk", "score": 2, "replies": [{"body": "Rivian Automotive, Inc.\nEquity\nAuto Manufacturers\n10.86\n-89.87 (-89.22%) All Time. 🫣\n\nTesla, Inc.\nEquity\nAuto Manufacturers\n175.54 +173.95 (+10,919.46%) All Time. 🤤\n\n\nDogshit rivian FLUSHHHHH", "score": 1, "replies": []}]}]}]}]}]}, {"body": "V12 is a big step change in performance. Still a lot of regulatory hurdles. Wouldn’t be surprised to see a pilot program in Phoenix or SF within a year. But I’m not expecting coast to coast robotaxis until ~2026 at best.", "score": 0, "replies": []}, {"body": "[removed]", "score": 0, "replies": [{"body": "No", "score": 3, "replies": []}]}]}
