{"title": "NVDX / NVDL (NVDA 2X ETFs)", "selftext": "If I'm bullish on NVDA, why not just buy these ETFs instead of NVDA? Will they go 2x NVDA overall? What is the catch? (Still things I am learning.)\n\nThanks!", "id": "1bdd7e4", "created_utc": 1710288829.0, "score": 31, "upvote_ratio": 0.88, "num_comments": 101, "comments": [{"body": "As someone who owns both? It hurts when everything is down.. twice as much pain.\n\nAm I gonna stop or not? Probably not.", "score": 31, "replies": [{"body": "I own NVDA and NVDX. Yeah but that is really just a concern short term because I am bullish. Is there another catch?", "score": 7, "replies": [{"body": "Theres an expense ratio that the stock doesn't have. That and the 2x is red as well as green. If you can handle an expense ratio and 2x down on red days, go for it", "score": 9, "replies": [{"body": "The expensse does not really mean anything when it is up 2X nvda which I am very bullish on. Hmmm...", "score": 3, "replies": [{"body": "Yeah, but you asked for downsides. Red days are the biggest downside. No one had mentioned the expense ratio. It's not really a problem, but it's something to consider. I have some NVDY as well as NVDA and calls and leap calls.", "score": 6, "replies": [{"body": "What exactly is the expense ratio and how does that affect someone that holds NVDX? Isn’t it just buying a stock? Please enlighten me", "score": 3, "replies": [{"body": "NVDX uses options to increase returns and is actively managed. They charge a fee to do this. The expense ratio is 1.05%. That's high, but the way NVDA has gone this year, it's been worth it.", "score": 5, "replies": [{"body": "So does that mean when i sell the stock or i hold it i am charged 1.5% of he value?", "score": 3, "replies": [{"body": "No. With ETFs the daily rate is calculated and deducted each day.", "score": 2, "replies": [{"body": "So they are charging me 1.5%/365 days? So a part of the 1.5% management fee every day ?", "score": 4, "replies": [{"body": "No. That wouldn’t work very well. It’s averaged out over the total number of trading days per year.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Exactly.", "score": 1, "replies": []}]}]}]}]}, {"body": "Lol, been buying this instead of common stocks for months\n\nU gotta get used to the swings and decay though", "score": 15, "replies": [{"body": "Is that it? Well I might just sell my NVDA and buy this because I am very bullish on NVDA.", "score": 5, "replies": [{"body": "The catch is any irrational fear or profit taking short term might kill you.  2x down does not equal 2x up.", "score": 6, "replies": [{"body": "hmmm...", "score": 2, "replies": []}]}]}, {"body": "What does the decay mean?", "score": 1, "replies": []}]}, {"body": "Yup, i switched to NVDL back in mid January.\nMy “conservative” portfolio is now just 60% NVDL, 40% USD. I do have stop losses though on NVDL. But if you watch the drop it is easy to sell quickly, then rebuy at lower cost and see it go up again", "score": 12, "replies": [{"body": "Exactly what i have been doing. Panik sold last friday, back in as of this morning. \n\nThe truth tho is that I havent saved any money in the process. Prolly I lost some actually. Panic selling usually come with a loss. But now that the CPI got ingested all right, I think NVDA will run to its next price target of 1000$-1200$", "score": 11, "replies": [{"body": "It happens man i got too cocky and rebought too early friday afternoon, when stock was around $880, thought that was the floor. But then had to hold it since then as it went down and decayed some more. Luckily i had some other investments. I sold them and bought more NVDL to average down", "score": 4, "replies": [{"body": "I bought in at 870. I had premarket buys at 855ish but they didnt hit and I thought I might miss it. Sure enough went back to 855ish and bounced back. I could have known that based on the analysis but Im still learning.", "score": 2, "replies": []}]}, {"body": "This aged well (:", "score": 3, "replies": []}, {"body": "Oof I just bought the dip on friday/monday\n\nYeah next price target, then we will see where we are going. Might diversify more then, we will see. I think overall its up and up tho. Changing the world really.", "score": 1, "replies": []}, {"body": "Isn’t that just a wash sale???", "score": 1, "replies": [{"body": "What ??\n\nThere was no substantial loss and I wont put it for tax deduction at all", "score": 1, "replies": [{"body": "First of all what broker are you using? Most will automatically apply a W to the symbol and you can’t stop that. You also can’t avoid reporting your trade on your taxes, so how would you “not put in for a deduction” when it’s automatic? AFAIK any gain you think you are making is just going to be washed since you did it over the course of a weekend on the same exact ETF. You could have sold the LEFT and bought 2x NVDA but then you need more capital. You could also try selling NVDX and going to NVDL but its confusing to know what does and does not count as “similar”", "score": 1, "replies": [{"body": "Im in Canada\nIt’s not the same. Go school someone else", "score": 1, "replies": [{"body": "So defensive after I questioned your trading “strategy” but can’t even find a single website to back it up. A true wsb regard right here", "score": 1, "replies": [{"body": "I dont know why you school me, or even why you care, or how is it even your business. \n\nTopic was about how you manage, well or not, holding an x2 ETF in an all time high market.\n\nThis « loss » doesnt fit on my taxes cause I sold and bought in a TFSA account. There is no minimum time you can hold a security in the account.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "You pretty good at finding those stop loss points Im guessing then. Sometimes hard to find them because the institutions manipulate the areas for liquidity. With that 40% USD I would just buy dips and then take some profits at highs. Sometimes I get the stop losses right, like on events. Got it right before the earnings earlier and rebought lower. Otherwise sometimes I miss if its a dip on non-event days or whatever, so I try to just hold unless I want a specific play. I mean sometimes I also do some trading on top of that but Im still learning to trade, novice here so far.", "score": 1, "replies": []}]}, {"body": "Holding leveraged ETFs for the long term has a dampening effect if the stock goes down then up. It needs to go up more to make up for the downside. You should read more about it, I suck at explaining it.", "score": 11, "replies": [{"body": "Hmm. Alright. I will ask Chat GPT 😂", "score": 2, "replies": [{"body": "Don't ignore this. I've lost money on leveraged ETFs because of this. A lot of the advice you'll get is don't hold them longer than a day. They're for day trading.", "score": 4, "replies": [{"body": "Hmmm. It is only a small part of my portfolio. Ive still yet to look into it more and decide what to do. Holding the real stocks as about 90% of portfolio", "score": 1, "replies": [{"body": "I learned the hard way. I usually avoid them now unless I see some day trading opportunity.", "score": 5, "replies": [{"body": "Thats a good idea potentially", "score": 1, "replies": []}, {"body": "can you explain how you lost on them? I bought some 3x leveraged with playing around money six years ago along with the underlying index, such as tecl and xlk, tqqq and qqq, spxl and voo, and pretty much just didn't check it and certainly didn't sell until today, the leveraged ones are all up hundreds of percent from the unleveraged equivalent", "score": 1, "replies": []}]}]}]}]}]}, {"body": "You loose your money twice as fast ;)", "score": 9, "replies": [{"body": "Like I said, if I am bullish and assuming it goes up (it will go up).", "score": 6, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Hmmm. I guess I have to wrap my mind around it. If you care to explain further, please do so. :)", "score": 2, "replies": []}]}]}]}, {"body": "Amateurs. Buy NVDL calls. 🤡", "score": 9, "replies": [{"body": "Whats your style on that? Feel free to share", "score": 1, "replies": [{"body": "I bought deep ITM calls to avoid option premiums. Basically like buying twice as many shares with the same amount of money. I am not going to say it was a smart thing or that others should do it.", "score": 3, "replies": [{"body": "Cool thx for sharing I will look into it!", "score": 1, "replies": []}, {"body": "do you have a resource for someone who weants to learn about all this but just starting (calls options etc)", "score": 1, "replies": []}]}]}]}, {"body": "NVDX is pretty much all I buy. I own some NVDA stock but won't add anymore. Just gotta be able to take the good with the bad.", "score": 6, "replies": [{"body": "I see. Might have to switch on a dip.", "score": 3, "replies": [{"body": "Good luck!", "score": 2, "replies": [{"body": "Thx! u2", "score": 1, "replies": []}]}]}, {"body": "any reason for nvdx vs nvdl or nvdu", "score": 1, "replies": []}]}, {"body": "The only catch is that it goes 2X BOTH WAYS. I have sold and bought back twice already cause I am way more cautious. NVDX is 1% mgmt fee, too. \n\nNVDL has a divi I think ?", "score": 6, "replies": [{"body": "the divi is weird, there was only one dividend given last december, that’s it. the stocks app notes this as a 4.81% yield which is essentially a lie lol", "score": 1, "replies": []}]}, {"body": "**Why NVDL over NVDX or vice versa? What makes you guys pick one over the other?**", "score": 6, "replies": [{"body": "I'll speak to that NVDX has no dividends which for e is a bonus, no tax implications until i sell, and generally the dividends come out of the stock price. NVDU has an expense ratio of \\~2% while NVDL and NVDX have an expense ratio of \\~1%.", "score": 1, "replies": []}]}, {"body": "There is no catch as long as you’re bullish. This is the way to make money. I’ve had NVDX and NVDU (1.5 X leverage). NVDL is the best imo. Good luck 👍🏼🍀", "score": 4, "replies": [{"body": "Why even bother with NVDU if pure bullish?\nThanks!", "score": 1, "replies": [{"body": "Just to be exposed to less risk since it’s 1.5x leverage vs 2x. It’s up to you what your risk tolerance is. But yes, so it’s up to you how much volatility you’re willing to deal with.", "score": 3, "replies": [{"body": "Just looked at NVDL. Right now it’s down $180 dollars per share overnight? Can you explain? Doesn’t seem right.", "score": 2, "replies": [{"body": "Lol yes I just noticed that. My shares x6, so looks like a 6-1 split occurred here overnight. The whole idea was to make this affordable and with the price over $200 I’m guessing was the catalyst to split. Also may be a good indicator that NVDA has a good chance to split this year, rumors may be true.", "score": 2, "replies": []}]}]}]}]}, {"body": "Been buying and selling NVDL and SMH for the last month or so. SMH has more steady, stable growth while NVDL provides the excitement.", "score": 4, "replies": [{"body": "Have not heard of SMH. \n\nEdit: Oh I have seen this, just have not had it on my list.\n\nThis is a pretty good one. I would rather just pick the stocks myself tho. For example Im not super bullish on Texas Instruments right this moment. Honestly need to study more about all these companies tho. My TD acc is moving to schwab soon and apparently they have partial shares, so I can diversify a bit more accurately then.", "score": 1, "replies": [{"body": "I like regular stock ownership with no leverage, I used to be a swing trader with options, but the volatility can literally burn your adrenal glands out. I hold nvda, asml, tsm, soun, aisp, tsla and a small position in intel", "score": 1, "replies": []}, {"body": "My main criteria are pretty simple…is it a position that is a stable and is it moving in a manner where I can grab a quick 1%? Generally, I’ll buy any stock, ETF, or whatever that shows potential. Recently been trading SOXL (3x leverage semiconductor) and it’s been really good to me.", "score": 1, "replies": []}]}]}, {"body": "Bought in to NVDL back in Aug-Sept for abt $56k, it is up to $183k - waiting for 1 year mark to take profit … (have a little over 4000 shares since split) … acct shows up 190% (but really more than that because they gave a dividend at end of year that added abt 12% shares (dropped value of shares in doing dividend, but just rolled over dividend into shares) … havent done math for added shares, but up over 220% since purchased (in abt 6-7 months).", "score": 3, "replies": [{"body": "Interesting. I wonder what it would be in comparison to NVDA itself! I'm still wrapping my head around it. Some people swear against these ETFs!", "score": 1, "replies": [{"body": "If you think NVDA is going to increase in value for another year, then I would def invest in NVDL or NVDX … \n\nI noticed NVDX has slightly better growth than NVDL week to week (I bought abt 40 shares of NVDX just to see if I was seeing this right) … not usually very noticeable difference, but sometimes it is noticeable. I think it might be because NVDL is traded on 24 hr market (on Robinhood at least), but NVDX doesnt trade 24 hrs … one of the warnings leveraged stocks give is that if the trade sideways for awhile it can sometimes lower the price … so I wonder if NVDL being available on 24 hr market may slightly degrade it … not sure if that is reason for difference, but only difference I can see in two.\n\nI would suggest to take profit of at least 25%-30% each year because if NVDA ever has a 50% drop it could wipe out what is in a 2x leveraged stock like NVDL or NVDX … so gotta keep an eye out for some kind of horrific news that may cause a drop like that. (I couldnt see that happening without something just very negative like criminal activity happening - or fraud of some sort in bookkeeping being exposed - which I dont see that happening based on their size now - they seem to be legit killing it in their business). \n\nId suggest that if you do invest in a 2x leveraged ETF for a single company, that you have to pay daily attn to the news … not the kind of investment you can just put there and forget about. You “can” just leave it for a week or two, but very risky if you accumulate a big amt - and I am too OCD to not check every day many times a day.", "score": 1, "replies": [{"body": "Ive actually kind of fallen for the leveraged ETFs … my list of ones I invest in include: NVDL, NVDX, FBL (2x Meta), UPRO, XXXX, SPXL, CONL (2x Coinbase), BITX (2x Bitcoin), TQQQ, TECL, USD, MSFX (2x Microsoft), BULZ, FNGU, and SOXL.\n\nThe ones that are single company ETFs I check the news daily for those companies … the rest I just pay attention to the market in general. It is diversified chaos … but moves up fast when the market goes up … Warning though, back in Sept-Oct the market was bad and I lost close to 50% (this includes a big loss I had on a bad bet on a small cap company though) - on Oct 31 I was getting depressed, lol … but from Nov 1 to now my total portfolio has increased almost 500% … so total increase from Aug to now is 190% (including the losses in Sept/Oct).\n\nWhen they start lowering interest rates, I think we are gonna see some big growth in capital in the equities markets that has been sitting in bonds for the last 3-4 years in the bond market (those still shellshocked from the 2021-2022 drop who still have most of their money in bonds - over $9 trillion was removed from equities market back then, most put into bonds - and there is still a good percentage of that money still there in bonds)… So if the fed handles it right, we might have 2 years of incredible growth as that capital goes back into equities as those interest rates drop … Im betting long on that. \n\nThe leveraged ETFs keep me engaged in what is happening in the financial/business world because those ETFs can move very fast.", "score": 1, "replies": [{"body": "do you recommend delving into nvdl rn? i have 4 nvda stocks so im not very deep into it, but i have 1500 in free cash and im wondering if i should get some nvdx/l instead of nvda (also all that leverage is crazy, your risk tolerance must be through the roof lol… and im saying this as a 17 y/o)", "score": 1, "replies": [{"body": "Yea, Im more risk tolerant, but probly because I watch my stocks closely each day. I dont see a problem with NVDL or NVDX right now (over next year at least) … They have back orders, rolling out new and better product, and have had the best video graphics cards since 1999 at least (back when I used to play video games on my desktop). They have proven they will always attempt to make their product the best … and for whatever reason nobody seems to be able to catch them so far. Ive added some NVDX recently and have been holding NVDL for 7 months … some June 2024 calls for NVDL too … so yea, for me personally - I have more faith in NVDA going up than any other stock right now. Illl take some profit after 1 year mark though - cant be an idiot … something will eventually happen to slow NVDAs growth down - when that happens, there will be a pullback on price - I cant see it happening within the next year though. \n\nYou gotta make your own choices tho - it is a risk. Me, yes, I have been adding recently with NVDX and NVDL … when interest rates start getting cut, money will come from bonds market into equities market … that will happen over next 2 years - so if nothing else, that alone will drive up price for next year of all the big companies.", "score": 5, "replies": []}]}, {"body": "How has this been working for you so far?", "score": 1, "replies": [{"body": "Its been my best investment … big drops, but bigger gains.  Not for the faint of heart, for sure …", "score": 1, "replies": [{"body": "Some of those you mentioned (FANG, XXXX) are ETNs, which, if I understand correctly, can technically be called at any time at the current price, although I’d guess this is a remote possibility. Any thoughts on that?   \n\n What is your strategy with the LETFs, buy and hold or something more in depth?    \n\nAny thoughts on TECL vs TQQQ?  UPRO vs SPXL? \n\nI too like the new single equity leveraged ETFs (PITR, MSTU) but am ambivalent about the fact that T Rex and to a lesser extent granite shares are newish.  \n\nI agree with your experience, that the leveraged have been beating  out on buy and hold and DCA with especially buying the dips beat in the long term the underlying assets by several hundred percent, obviously when it’s down it’s more down and takes a while longer to recover but when does and if the market keeps going up even a modest amount my experience has been the same as yours….do you do this in a regularly taxable account btw?\n\n Which specific resources do you use to keep abreast of the financial news and  to research ?", "score": 1, "replies": []}]}]}]}, {"body": "It may be that NVDX doesn't pay dividends, which I prefer because it eats into the stock price and also counts as income even if I don't sell. However, NVDL has approx 6billion under management and NVDX approx 600 million, I don't know if it being a smaller fund in any way opens you to more risk. and yeah this i believe is not for someone who checks it often to sell", "score": 1, "replies": []}]}]}]}, {"body": "Why not buying warrants", "score": 2, "replies": [{"body": "What do you mean?", "score": 1, "replies": []}]}, {"body": "I have won all three.  Nvdl split after market.  So far so oooo good", "score": 2, "replies": [{"body": "Yay!", "score": 2, "replies": []}]}, {"body": "How much is now?", "score": 1, "replies": [{"body": "?", "score": 1, "replies": []}]}, {"body": "Did NVDL just drop $200?\n\nEdit: oooo", "score": 1, "replies": [{"body": "https://www.globenewswire.com/news-release/2024/02/28/2837493/0/en/GraniteShares-Announces-Forward-Split-of-NVDL-and-FBL.html", "score": 1, "replies": []}]}, {"body": "Just buy the stock", "score": 1, "replies": [{"body": "Why?", "score": 1, "replies": []}]}, {"body": "Can anyone speak to any reason to go with one over another between NVDU, NVDL, and NVDX?", "score": 1, "replies": []}, {"body": "Take this post down gatekeep!", "score": -2, "replies": [{"body": "🫣", "score": 3, "replies": []}, {"body": "More people in on it = more bullish!", "score": 0, "replies": []}]}]}
{"title": "NVDA for the win", "selftext": "[deleted]", "id": "1bdsqyw", "created_utc": 1710339882.0, "score": 88, "upvote_ratio": 0.82, "num_comments": 67, "comments": [{"body": "NVDA responded by tanking and pushing the NASDAQ lower. Some people might lose their option bets before they have the opportunity to make millions.", "score": 109, "replies": [{"body": "That’s my bad. I ran a $600 vertical spread on semis this morning and that tanked them all. I sometimes forget how powerfully wrong my instincts are.", "score": 20, "replies": [{"body": "You and me both. I bragged to someone about my AMD option doing well and that easily cost us all 2%", "score": 2, "replies": []}, {"body": "Except for ARM, which ticked up a couple.", "score": 2, "replies": [{"body": "I’m sure I’ll get it next time. My bull trades have big bear energy.", "score": 2, "replies": []}]}, {"body": "What expiry?", "score": 0, "replies": [{"body": "This Friday, so it might turn around. It was my monthly fun play money so I am not worried about it. I just found it funny that the semis pulled back so fast after I did my spread. Sometimes, all you can do is find humor in the ride.", "score": 2, "replies": [{"body": "I've noticed that whenever I put on a spread, the stock immediately stops moving in an upward direction and begins to act rather skittishly. I've been able to replicate this phenomenon time and again.", "score": 2, "replies": [{"body": "Algorithm trading baby", "score": 1, "replies": []}]}]}]}]}, {"body": "I probably shouldn’t have laughed as hard as I did.  😁", "score": 8, "replies": []}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Yup. Who do you think their exit liquidity is exactly...", "score": 2, "replies": []}]}, {"body": "Yeah this is coordinated market manipulation bullshit to liquidate positions to steal free money in short term options trading. \n\nThey should be investigated.", "score": -39, "replies": [{"body": "Or, it's tons of people taking profits now that there's obvious resistance after a 500% run up in 15mo?", "score": 30, "replies": [{"body": "Think micro scale; they manipulate the market for an hour and they can make tens of millions.", "score": -27, "replies": [{"body": "Manipulating the entire fucking market is hardly \"micro scale\".\n\nOccam's Razor man, people 5x their money in a little over a year and once it stopped closing higher **every single day** people decided to start taking profits.\n\nI'm one of them.", "score": 27, "replies": [{"body": "Your story doesn't fit what NVDA did tho", "score": -11, "replies": [{"body": "Why are you in an options sub when you can't even read dollar values on a [chart](https://i.imgur.com/WKDGiEA.png)?\n\nOr do you mean the lack of up/down until it stopped hitting ATHs every day? Because that's certainly [reflected here as well](https://i.imgur.com/HZcOdYC.png)....", "score": 8, "replies": [{"body": "That's proving my point lmao. You said once it stopped reaching highs every single day people took profits. That's not what happened. It reached all time high on Friday and then tanked same day and has traded sideways. No signs of people \"taking profits\" after it stopped hitting highs everyday. I'm just saying your story isn't aligned with what happened", "score": -6, "replies": [{"body": "People have been regularly taking profits since it pulled back from $735 to $680ish last month wtf are you on about?\n\nAnd what do you think has to happen for it to \"tank same day and has traded sideways\"?? Think that's just sentiment? That's sell pressure you nonce.", "score": 3, "replies": [{"body": "\"and once it stopped closing higher **every single day** people decided to start taking profits. \"\n\nJust gonna leave this here because clearly you have a loose grasp of what even you said", "score": -2, "replies": [{"body": "LOL!!! Bro you're pedantic af. That or super on the spectrum.", "score": 2, "replies": [{"body": "oh my god i actually have to hold your hand through this.\nyou were rebutting the tanking of NVDA not to manipulation but from a sell off saying \"once it stopped closing higher every single day people decided to start taking profits\"\nthat literally is not what NVDA did since the tank happened THE DAY OF its all time high at once, not \"days after it stopped closing higher\". And then it has  just been trading sideways - which also doesnt indicate profit sell offs. so neither real world scenario lines up with what you are theorizing\ni dont care about what the original guy said about manipulation, but your story is not a good counter to him and you are having an autistic time seeing that", "score": 0, "replies": [{"body": "Moving up and down 5-8% isn't \"moving sideways\" what are you even on about?", "score": 1, "replies": [{"body": "Oof okay now I know you're not an actual trader and just trolling lol", "score": -1, "replies": [{"body": "\"Actual trader\" bro you're being pedantic as fuck. At no point did I claim this to be my career. People are taking profits on NVDA so the price is no longer climbing every day. That you're SO FUCKING PEDANTIC that you have to criticize the minutia of my statement rather than being able to understand what I was saying proves to me you're an actual autist and just trolling.\n\nI held NVDA from 2020 and got out around $820 before it got anywhere near $900. Does making those trades make me \"not an actual trader\"? \n\nNobody gives a shit about how you feel dude. NVDA ran up, people are now taking profits. There's no denying that. Surprised a \"real trader\" has time to bicker of semantics on reddit. Actual joke.", "score": 1, "replies": [{"body": "Woah ding ding ding someone learned a new word in grade school today!\nThe fact you think someone holding you to what YOU commented is being pedantic is actually wild lmao. Pretty common grade school strategy: Say something wrong, someone calls you out for the exact thing you said, you whine and say why are you getting caught up in the words of what you said, learn new word of day after recess, use that word to accuse them of being \"pedantic\", repeat \n\nNVDA price at noon on Friday was the same price as it was today at noon. That's kind of the definition of trading sideways chief.\nI don't care about your point I didn't come in here to talk about your stupid point. Youre making rebuttals to someone on an online forum (the original comment) Those rebuttals are open to criticism. I saw you making false premises and all I did was point them out and you just immediately started swinging and got red eyed having to scream that you're right.   Take a breather", "score": 0, "replies": [{"body": "The tism is strong. Bet you've made a hobby arguing about idioms.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Yeah and casinos should be investigated for continuing to make money off people with gambling addictions.", "score": 4, "replies": [{"body": "If they are manipulating the outcome… yes, and unironically.", "score": 2, "replies": [{"body": "They do manipulate the outcome and regulators have a minimum payout frequency that the slot machines must pay to stay licensed. Random payout that always equals less than the pay-in.", "score": 1, "replies": []}]}]}, {"body": "Just taking my gains. Along with a few hundred thousand other traders.", "score": 3, "replies": []}]}]}, {"body": "Harvesting that skewed upside volatility is going to make a shitload of money for many players, yes.", "score": 18, "replies": [{"body": "Naked calls?", "score": 2, "replies": [{"body": "Sure, that would work. There's probably some calendar stuff you could do since the option chain seems a bit weird now *shrug*. Don't know the specifics of the industry but I'm sure NVDA at a trillion dollars is at the root of a ton of dispersion trades as well. I doubt professional firms just sell calls but I'm sure there is a playbook to cash that skewed vol.", "score": 5, "replies": []}, {"body": "Bad idea, spread maybe…", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": 68, "replies": [{"body": "I started managing my 66 year old MIL retirement savings, dumping half into NVDA. She is now preaching to her retiree friends and other family members about NVDA 😅", "score": 15, "replies": [{"body": "Dangerous thing to do. Yeah NVDA is going up but it can tank as easily. Anyone reading this: please don’t put half of your retirement into one stock ever", "score": 15, "replies": [{"body": "Mate, its stocks, not options. She knows the risks. Whats the worst case? lose 5-10% before stop loss kicks in?", "score": 4, "replies": [{"body": "I hope you’re a troll 😂", "score": 1, "replies": [{"body": "I think people are overestimating my poor MIL retirement savings.she got like 20K. 10K in NVDA is nothing", "score": 4, "replies": [{"body": "Honestly if that’s the case I guess it’s fair enough for now. Just watch it like a hawk. Nvidia is volatile", "score": 2, "replies": []}]}]}]}, {"body": "Correct, I put all of it there yesterday.", "score": 1, "replies": []}]}]}, {"body": "Than", "score": 2, "replies": []}, {"body": "> down then up", "score": 1, "replies": []}]}, {"body": "I am hoping it accelerates to 1100 through GTC.", "score": 7, "replies": []}, {"body": "Lol if you think price targets are real.", "score": 8, "replies": [{"body": "This.", "score": 1, "replies": []}]}, {"body": "Shoot it might that by next week. Haha", "score": 6, "replies": [{"body": "Hit that", "score": 2, "replies": []}]}, {"body": "Yes", "score": 6, "replies": []}, {"body": "This week is not bearish. Next week will be a time of healing for us bulls.", "score": 5, "replies": []}, {"body": "bofa deez nuts", "score": 7, "replies": []}, {"body": "Works til it don't, but Im guess split", "score": 5, "replies": [{"body": "Split didn't work for GOOG and AMZN. So yeah people thinking it will be some holygrail like will be in for a rude awakening", "score": 2, "replies": []}]}, {"body": "Quad witching week. Just be careful.", "score": 2, "replies": []}, {"body": "everyday some analyst of some institution or bank comes up with a new target ...  I think they have their time span set on like 5 min on the chart, and if they see the candle moving up a few points, they issue a new target like 5 points higher than the previous one etc…  ", "score": 2, "replies": []}, {"body": "none", "score": 1, "replies": []}, {"body": "AI AI AI", "score": 1, "replies": []}, {"body": "Once lofty targets start coming out…", "score": 1, "replies": []}, {"body": "SCV's printed today... also lightened some shares.  Watching the wide ICs tick.", "score": 0, "replies": []}, {"body": "Really? All two? BofA deez nuts?", "score": -3, "replies": []}, {"body": "I don't think this means what you think it means.", "score": -2, "replies": []}]}
{"title": "selling options with a $15000 account ", "selftext": "hi all! i have been researching options for the last few months and i think im confident enough to start trading with actual money after some success with paper trading. are stocks like wells fargo, citigroup, paypal and intel good stocks to do CCs/CSPs since they are cheap?", "id": "1be681a", "created_utc": 1710372165.0, "score": 32, "upvote_ratio": 0.86, "num_comments": 71, "comments": [{"body": "> good stocks to do CCs/CSPs since they are cheap?\n\nCheap share price is the worst reason to choose stocks for this. Develop a strong thesis behind a price target.", "score": 49, "replies": [{"body": "Cheap share price wouldn't necessarily make them good for CSPs or CCs, but it's more likely a requirement for the $15k account. Hard to do a CSP without much C.", "score": 20, "replies": []}, {"body": "i will take this into consideration, thanks for your suggestion!", "score": 5, "replies": []}]}, {"body": "What strategies have you used?\n\nWith small accounts, you are better off with spreads, as it limits your exposure and stretches your money further.\n\nA CSP for INTC 04/19 $40 put will tie up $4000 for a $64 premium\n\nA PUT credit spread for INTC 04/19 $40/$35 will tie up only $500 for a $56 premium. You now have $3500 for other positions.", "score": 29, "replies": [{"body": "i mostly have experimented with selling strangles that are OTM with around 0.15-0.25 delta as i’m pretty conservative. thanks for your input though, i haven’t tried out a credit spread before so i will try it out!", "score": 3, "replies": [{"body": "I dunno man...selling strangles to me means double the risk.. any sharp move, either side, and the strangles strangles you.", "score": 4, "replies": [{"body": "But with a strangle, you always have one side that is unchallenged.  And you can roll up the untested side to defend and/or bring in additional premium to protect the tested side of the trade.\n\n  \nOne of my favorite trades is actually to buy 100 shares and then sell a CC + an additional CSP.  You need to be willing to hold 200 shares of the stock for this though.", "score": 2, "replies": [{"body": "I assume you have to be really careful with the stock selection then, as this process can quickly lead to holding 200-300-400… and so on shares if the underlying keeps tanking", "score": 2, "replies": [{"body": "Well yes, but picking a stable stock that you're willing to own is the name of the game when selling puts.", "score": 2, "replies": [{"body": "The key is to find a stable stock which isn’t too expensive unless you have a large account", "score": 1, "replies": []}]}]}]}, {"body": "I guess thats where the name comes from\n\n\n\nSo my question is, what makes you straddle?", "score": 1, "replies": []}]}, {"body": "Make sure you study how to Defend Credit Spreads! You can get Run Over if the stock surges on your position.  Paper Trade is time delayed, and Not filled like Live Trades. HTHelps", "score": 1, "replies": []}]}, {"body": "I need to research these more. I have not been doing my options trading (cc/csp only) for long, so I have been nervous to branch out, but I have seen multiple recommendations for spreads. It seems like it might be a more efficient model.", "score": 2, "replies": [{"body": "I'm not so sure about being efficient, but it is definitely risk capped and helpful for smaller accounts.", "score": 7, "replies": []}]}, {"body": "This is the way", "score": 1, "replies": []}]}, {"body": "Your picks are pretty good. You want to sell puts on established companies, ideally with dividends. Avoid any unprofitable company, recent IPO, high flyer, or stock that is promoted often on WSB (e.g., SOFI or MARA). Boring is better.\n\nMost brokers have stock screening tools and ratings that are pretty useful at helping you avoid duds. An example of a highly rated stock is Comcast (CMCSA), which has an A rating at Schwab, 8.3 at Fidelity, and a Strong Buy on Seeking Alpha. It should be a great put-selling candidate. ASC and FOR are some other good ones.", "score": 19, "replies": [{"body": "thanks for your input! may i ask why companies that hand out dividends are better to sell options on?", "score": 3, "replies": [{"body": "Dividends show a company is profitable and cares about distributing wealth to shareholders.\n\nDividends help establish a bit of a floor because yield chasers will likely buy as the price declines and yield increases.\n\nDividend stocks tend to be less volatile, with lower beta and lower drawdowns.", "score": 10, "replies": []}, {"body": "For reference, are you referring to the wheel strategy (or triple income strategy). If you don’t know that strategy, I’d take some time to learn it and understand its pros and cons. \n\nI don’t have the longest trading history, but the believe dividend stocks are less volatile so you are less likely to get assigned. But naturally the premium yield is less. And in the case of CSP, you have money in escrow that’s not getting the underlying dividend. \n\nI think CC/CSP stock choices is based on your personal risk profile. If you find good videos on the wheel strategy, they will hopefully mention how the characteristics of the underlying affect your yields. ", "score": 2, "replies": [{"body": "A nice alternative to this that I like to employ given the higher interest rate environment to not have so much money set aside not earning interest is as follows:\n\nIn place of the CSP I will sell a Bull Put Credit spread (1 Short Put + 1 Long Put with lower strike price), and then use the capital that is freed up by the long put to buy shares of TBIL.  If my short put stays out of the money, my spread expires worthless and I keep the credit.  If my short put gets challenged and I have to take assignment, I simply sell my shares of TBIL to cover the cost of the shares.\n\nAn important note, I do not use the Put spreads to over leverage.  Meaning that I have enough capital in TBIL to cover assignment on all short puts.\n\nThis is not advice, just a strategy that I like that has helped me squeeze some extra income out of the strategy.", "score": 2, "replies": []}, {"body": "Open Interest on a Wheel stock is Essential!! 1000 or more. That's so you don't get trapped. Study, Study, Study!!!", "score": 1, "replies": []}]}, {"body": "while the above commenter is correct in explaining why dividend givers are good to hold (they make money, etc etc) exercise caution when buying into anything >3-4% annual dividend yield, as you may end up buying into a dividend yield trap. I would stick to dividend aristocrats, personally when using this strategy", "score": 2, "replies": []}]}, {"body": "I haven’t really understood the dividend piece despite it coming up now and again. Do you mind explaining why selling puts on dividend stock is good?", "score": 1, "replies": [{"body": "So when you get assigned and start selling calls you can collect divs as well. Granted you’re selling CSPs to accumulate shares and are okay with some leaving when CC gets assigned.", "score": 1, "replies": []}]}, {"body": "Wouldn't CC be better for dividend stocks so you get the dividend AND the premium?", "score": 1, "replies": [{"body": "Csp with cash held in a money market fund as your holding is good. 4.95% while you do CSP", "score": 4, "replies": []}, {"body": "Covered calls are the same as a short put, assuming you use the same delta.\n\nBut collecting dividends is fun, so you might prefer using a covered call. The only caveat is that you need to be careful to avoid assignment near the ex-dividend date.", "score": 3, "replies": []}]}, {"body": "How many quarters do you want to see profitable before you label them as profitable?", "score": 1, "replies": [{"body": "I just look at the ratings. If a bunch of rating agencies say a stock is profitable and give it a good rating, then that's good enough for me. They won't give an unprofitable stock a good score. Quant models, even the most basic ones, are far better at picking stocks than people are.", "score": 2, "replies": []}]}]}, {"body": "Ima give you the worst advice that may get downvoted but god has it worked for now two years for me. I want to preface this by saying any investment is a lot of luck, a lot of dd, and a lot of strategy. The best way to mess up is to become emotionally attached and lose focus.\nWhat I do.\nI have 20k now. I trade in margin. I make 1-3k in premium a month if not more. I have made more premium than stock gain ytd so far because well my stock hasn’t done the best or worse. \n\nMy strategy:\nI buy all in on one company I believe in. I run 3x my account value with margin so I’m trading on 60k of investable balance. (This is truly regarded wsb degeneracy but hear me out) I sell, depending on The stock sentiment direction and overall market, close to or otm calls with about 2-10% of possible upwards return. The premium I get is good. But this is where strategy comes in….\n\nI use calls and puts outside of the money to hedge a downturn or run. I hedge my margin because you can lose so much more if not. Now this eats into my premium sometimes but what I do get is protection (especially to the downside as I’m on margin) I still incur loss if I have a big drop but it’s a ton less than if I didn’t hedge\n\nAll in, it’s insanely stressful, insanely hands on, and I honestly make good return without the fear of losing it all. Again, I’m up this year solely because premium. I believe in my company but it’s going to be years until I see massive gains based on their road map and progress.", "score": 4, "replies": [{"body": "I want to see if im getting this right. You buy $60k of a stock using margin, sell ATM calls, with that premium you buy OTM puts on the same stock as a hedge?", "score": 2, "replies": [{"body": "Sounds like a collar:\n\n[https://www.investopedia.com/terms/c/collar.asp](https://www.investopedia.com/terms/c/collar.asp)", "score": 2, "replies": [{"body": "Omg there’s a name for it!!! This literally explains it. I also buy otm calls incase of black swan events. So yeah I cap myself. If I think there’s a ton of downside momentum, I’ll buy additional options to that side to give me more but at that point I’m gambling.", "score": 1, "replies": [{"body": "With the purchase of the further OTM call you're essentially still doing a collar you're just using a call credit spread to buy the long put instead of a short call.\n\nThe benefit of that play is that you're not giving up all of your potential upside if the stock blows past your short call.\n\nEdit. Fixed grammar", "score": 1, "replies": []}]}]}, {"body": "Precisely. Usually I sell otm calls though. I’d also like to note that I only do this when I think the stock has downside risks. It’s not a strategy for every stock.", "score": 1, "replies": []}]}, {"body": "Genuinely asking as im still learning. Youre saying you sell covered calls as hedges for your all in? Am i understanding right?", "score": 1, "replies": []}]}, {"body": "INTC has been doing good for me .. but i am not an experienced trader by any means", "score": 4, "replies": [{"body": "Same for me 🙌🏻", "score": 3, "replies": []}, {"body": "I will second that. Trading INTC has been great for me, so far.", "score": 3, "replies": [{"body": "Me Three", "score": 2, "replies": []}]}]}, {"body": "You need to find something you wouldn’t mind holding. Personally I like SoFi many hate it. You might like something that I would never touch. Find something you wouldn’t mind owning 100’s of.", "score": 3, "replies": [{"body": "sofi just droped from 9ish to 7.8 , seems the streets downgrade it together", "score": 5, "replies": [{"body": "Due to the dilution", "score": 2, "replies": []}]}, {"body": "SOFI should be something that you'd never touch.", "score": 0, "replies": []}]}, {"body": "Personally I have a few cheaper stocks that I feel are down lower than they should be. JBLU, WBD, & SOFI are decent ones to look at. Start small; just sell 1 contract per ticker and see how it goes. It’s much better to learn your lessons small first. Then scale up but to no more than 20% of your portfolio on any one ticker", "score": 3, "replies": []}, {"body": "INTC, PLTR, SOXL, BAC, AFRM, BITO. Some that I've been doing recently with good results.", "score": 4, "replies": []}, {"body": "AAL, SoFi, PLTR, CLF, CSWC, they are all decent and not very expensive.", "score": 2, "replies": []}, {"body": "TSM", "score": 2, "replies": []}, {"body": "They are reasonable candidates, especially if you are just looking for something for learning purposes. Wheeling may not be the best strategy for an account that size but it is a good way to learn the basics and get a feel for managing puts and calls. Just set realistic expectations. Wheeling in general is about small and consistent returns and does better in a bigger account.", "score": 2, "replies": []}, {"body": "I've added Intel to my rotation.  My thinking is to acquire 300 or more shares over the next year or so.\n\nI also think PLTR and SOFI both make sense for a small account right now.", "score": 2, "replies": []}, {"body": "You can find even cheaper ones with high premium and high IV. NIO, MSOS, HE, HOOD, SAVE, RIOT, RIVN.", "score": 2, "replies": []}, {"body": "FORD MOTORS!!", "score": 5, "replies": []}, {"body": "PLTR. Please do your own due diligence if you think $25 is a good price before considering.", "score": 1, "replies": [{"body": "isn’t it pretty volatile though? i have been told to stay away from it since the risk of assignment is very high. thanks for your feedback nonetheless", "score": 2, "replies": [{"body": "Always trust your gut, in this case stay away. PLTR is volatile, however they are growing at a steady pace and are cash flow positive. If you don't expect assignment while selling puts, I find it hard to believe you'll make money in the long run.", "score": 2, "replies": [{"body": "for PLTR do you sell 30-45DTE options? or weeklies?", "score": 1, "replies": [{"body": "I own shares and sell 14 dte calls with strikes at good profit taking range in case they get called away.  I am personally bullish. But that doesn't mean you should be too, just another ticker to consider.   For NVDA I used to sell 90 day puts, but since my personal target is $750 (forward pe of 30 on an eps of 25) I'm waiting for better entry.", "score": 2, "replies": []}]}]}]}]}, {"body": "Personally I'd recommend just making one or two leveraged plays on whatever index you want. (1256 contracts recommended) aka sell wide credit spreads that emulate naked positions.", "score": 1, "replies": []}, {"body": "One thing I have found, after a lot of success and failure, is to do stocks of items/services I frequently use.  What I have found is if I use the products or services, I am happier to own the stocks and are able to see if quality changes faster.  Additionally, I am much more likely to follow them and understand their business model.", "score": 1, "replies": []}, {"body": "I can say be careful of paypal around earnings", "score": 1, "replies": []}, {"body": "Does the answer to this question change depending on the account size? Say, if I have a $60k account? I've learned my lesson trying to trade options the degenerate way and don't want to blindly gamble anymore.", "score": 1, "replies": []}, {"body": "\"some success\"", "score": 1, "replies": []}, {"body": "Yes, you can.  As an example, GDX, F, PARA, EWZ, KWEB, BAC would give you a diverse set for that amount.", "score": 1, "replies": []}, {"body": "Volume and IV are the most important things too look at not being \"cheep\"", "score": 1, "replies": []}, {"body": "I have been selling CCs on $SOUN this week. Prob more than I should. But cost basis is in the 6’s. \n\nSold some $9-$10 strikes for $1.00 each. Already have some I sold earlier this week that are well ITM. But I’ll take the premium and small gains, now. I don’t look at the upside loss, only downside protection when I’m not looking to hold shares long term. \n\nAlso probably unpopular, but $UPRO is a 3x leveraged S&P with good premiums, and only $6700-ish investment.", "score": 1, "replies": []}, {"body": "My HSA account at Fidelity is like 12k. You have 15k. \n\nI sell puts mainly. This allows the whole amount to make 5%. So for you that would be 62.50 per month plus the put premium. \n\n15000/100 is 150 points of stock you can sell puts on. If a stock costs $50, that 50 points. A $20 stock is 20 points. That’s 70 points. \n\nI just trade a little more OTM (lower delta) than in my regular trading account. I take profit more quickly then in my regular account. \n\nCurrently I have a csp on DVN at 45 strike. I’ve rolled it I think 2 times. So I’m making a “killing”. I’m up 5.39% ytd. \n\nI sold a NTM 15 strike put on PLTR a month or so ago that I probably rolled once. That was really good. \n\nSLV has done Ok too. $30 here and $42 there, and soon we are talking real money. \n\nIt’s just a lot of small ball. Patience. Passing on decent opportunities for better opportunities. \n\nI can’t contribute to the HSA anymore. But if you are adding to your 15k, you get more choices. $300 more per month would make big difference. \n\nIf I get assigned on a put I’m selling cc’s ATM trying to get rid of them. \n\nThat my approach. Once it grows to 200k, I’ll trade differently.", "score": 1, "replies": []}, {"body": "Kweb is better than qqq", "score": 0, "replies": []}, {"body": "sell options means you are a genius in maths. Ordinary people like me only buy the price", "score": 0, "replies": []}, {"body": "SOFI, MARA, HOOD have been good to me so far.", "score": -1, "replies": [{"body": "MARA is not for the weak of heart though", "score": 3, "replies": [{"body": "MARA is straight up gambling idc what anyone says. People win big in Vegas on a regular basis.", "score": 3, "replies": []}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "1be6op1", "created_utc": 1710373327.0, "score": 19, "upvote_ratio": 0.71, "num_comments": 89, "comments": [{"body": "Last year it went down to about 110 then back up to 280 very soon after. It happens.", "score": 35, "replies": [{"body": "Oh crap you're right, yeah I forgot about that. I'd really like to be around healthwise within 5 years. Just imagine if it's a $1,000 stock by then...", "score": 8, "replies": [{"body": "Or imagine if it is a $40 stock in a year.", "score": 5, "replies": [{"body": "Never gonna happen.", "score": -1, "replies": [{"body": "I’ll come back in a few years. Retail bag holders already started to leave Tesla for nvda.", "score": 2, "replies": [{"body": "Sure, you can even come back in 6 months. I tried fsd 12.3, it's something else. Good luck.", "score": 0, "replies": []}]}]}]}, {"body": "If your putting majority of your savings into Tesla, your anyways in casino mode and going for broke. Options are 1) wise up and spread your risk (VTI, VSAX, etc) or 2) go for broke and hold.\n\nIn any case, stock is almost exactly where you bought it so why the vibe that you shouldn’t sell?", "score": 15, "replies": [{"body": "Agreeing with above. It’s much safer typically to put your money into a mutual fund or a high-interest savings account.", "score": 5, "replies": []}]}]}, {"body": "EV market wasn’t as competitive and interest rates didn’t take full toll yet. Interest rates ain’t coming down anytime soon.", "score": 2, "replies": []}, {"body": "I'm not that optimistic since the EV market is not as good as last year, unless there's a significant growth on energy business or a huge improvement on FSD.", "score": 4, "replies": [{"body": "Koreans and Chinese EV destroy Tesla. VW group will slaughter the premium market in due time.", "score": 1, "replies": []}, {"body": "I’m a little optimistic. I’m seeing more and more EVs around me. And when the next gen cheaper model comes out Hold on. You can barely get into a loaded kia suv for less than $40k so why not a model y?", "score": 0, "replies": []}]}, {"body": "Do it again!!", "score": 1, "replies": [{"body": "This made me lol", "score": 3, "replies": []}]}]}, {"body": "You uh, really are all or nothing. You always have a choice, never be afraid to walk away from an investment. Depends on your goals. At least you can sell covered calls. TSLA's immediate future is uncertain, I've been making money on it wobbling on the way down. I bought a chunk at 175 looking to sell at 200 again and I'm debating either buying more or a strangle.", "score": 12, "replies": [{"body": "Got it! Just curious, do you use a taxed account. I have a taxed account and when I swing a little I just try to make it worth it to cover the tax. Thanks", "score": 0, "replies": [{"body": "I do, though I don't think that has any weight on my plans.", "score": 3, "replies": []}, {"body": "What does this even mean? Any amount you make covers taxes the same and is worth it.", "score": 2, "replies": []}]}]}, {"body": "Is the money you allocated to it meant for the long-term or the short-term?  If it’s long term don’t stress the daily or weekly movements of the stock.  You’d be better off keeping an eye on the company itself and making sure it stays on track to achieve its long-term goals.", "score": 3, "replies": [{"body": "How do you recommend one keeps an eye on the company? Earnings reports, YouTube, news?? Thank you", "score": 0, "replies": [{"body": "Yes especially the 10-k and 10-Q reports.  Also listening to the earnings call is useful, listening to the way management says things can give more information than just reading it.", "score": 2, "replies": []}]}]}, {"body": "Stock will go great if Elon can follow through on 20% of his promises. But history says he won’t.", "score": 4, "replies": []}, {"body": "Never put all your eggs in one basket.", "score": 5, "replies": []}, {"body": "Now the world has shifted. It’s revolving around AI and NVDIA. Tesla is dead as investor company. You are just picking leftover bread crumbs. Feast is over move on.\n\nEdit: if you are betting on Elons AI robots, then it shouldn’t be Tesla , the robots may be finally delivered as part of separate company I am not sure.", "score": 4, "replies": []}, {"body": "What’s your thesis that $TSLA is worth more than $175 a share?\n\nPer Elon, on the last earnings call they have nothing new hitting earnings till 2026.\n\nTesla sales are struggling, even with price cuts.\n\nEarnings estimates are just starting to come down.\n\nTesla hit $100 while earning $4. It’s likely going to earning $2ish this year and no reason to think 2025 will be better.", "score": 4, "replies": []}, {"body": "Look like your loss is not that big to walk away if you need that money soon.", "score": 4, "replies": [{"body": "I'm not broke, just going to ride the waves through the storm.", "score": -2, "replies": [{"body": "Tbh sign out of your broker on red days.", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 7, "replies": []}, {"body": "I bought pre-pandemic, saw it go to ATH, didn't sell, and we're back here. It's ok just wait it out.", "score": 7, "replies": [{"body": "same. I'm so mad that I didn't sell when my money doubled. I feel so dumb", "score": 6, "replies": [{"body": "Yup I could’ve bought a model 3 and still have more money left than now", "score": 3, "replies": []}]}, {"body": "Ok", "score": 3, "replies": []}]}, {"body": "I think you made up your mind to hold long.\nBut, on the other hand…\n\nThe highest highs were built on hype and Elon’s charisma.\n\nThat’s not a thing going forward.\nCyberTruck failed as it was meant to be a low cost to produce car that could be very profitable and revolutionize the trucking industry.\n\nBut now it’s more of a vanity vehicle that cost quite a bit to make … and it’s not that useful as a truck.\n\nTSLA investors like to point to all the moonshots like optimus, dojo, FSD etc.\n\nBut, these are crowded fields with tons of competition.\n\nAnd these are moonshots! \nAnd if you want a lesson on tech moonshots Google X still has yet to make one make big money. \n\n\nTesla is a car company at this point and it’s valued like tech due to tons of promises that it would be.\n\nIts margins are shrinking and it’s dying in China.\n\nElon has lost the plot and is threatening to divest the R&D away from Tesla.\n\nAnd even as a threat…\n\nWhy does it hit a new high?", "score": 11, "replies": [{"body": "I’m bullish on Tesla as a company, but I also think the stock isn’t the best place to put free capital. Market cap of $500B+ seems plenty high for the foreseeable future. Sure, I still have a bit, but it’s not where I’d place a major bet.", "score": 4, "replies": [{"body": "Even if you believe in the company in the future…\n\nIt still is overvalued.\n\nIt’s valued as if it’s going to do to the auto industry … what Apple did to Blackberry.\n\nAnd if you’re smart you’ll realize that Apple leaving EV is a canary in the coal-mine moment.\n\nEVs may not be going anywhere. But, they ain’t a golden ticket to profit and there’s not enough room to innovate for the foreseeable future.\n\nAlso… Elon’s antics have lowered the cool factor of the brand.", "score": 9, "replies": [{"body": "Ok boomer", "score": -7, "replies": []}]}]}]}, {"body": "Check back in 5 years you’ll be golden", "score": 12, "replies": [{"body": "That's what I figured, just gotta keep up with my health...💀👻", "score": 2, "replies": [{"body": "[deleted]", "score": 11, "replies": [{"body": "And that’s with a stock like Microsoft, arguably one of the most impressive moats in the world.", "score": 2, "replies": []}]}]}]}, {"body": "You have to realize Tesla doesn’t trade like a real stock. It’s just a trading vehicle, like bitcoin. \nAs such, it’s not appropriate for your life savings. \nWorse, the fundamentals might actually be creeping into the story slowly, and the more that happens, the more it will trend down over time given the valuation nowhere remotely makes any logical sense whatsoever. \nIf I’m you I’d get out ASAP, and put your majority savings with a boring, professionally managed growth fund. \nYou need money you’re willing to lose to trade individual stocks especially volatile trading stocks like tsla.", "score": 3, "replies": []}, {"body": "I bought 700 at $257.5 early this year. It was from selling puts at that strike and got assigned the next day… I’d rather be in your shoes right now. lol", "score": 5, "replies": [{"body": "Man, same here. But I’m stuck at a 100 shares. Not cool.", "score": 3, "replies": []}, {"body": "Hot diggity damn!", "score": 1, "replies": []}, {"body": "Well if elon gains another 50 lbs we're fucked!", "score": 1, "replies": []}]}, {"body": "If you are planning to hold a for a long term I think you’ll be pleased", "score": 5, "replies": [{"body": "yeah, maybe FSD will finally be out of beta", "score": 2, "replies": [{"body": "20 years", "score": 1, "replies": []}]}]}, {"body": "Never ever ever concentrate most of your money in one stock.", "score": 2, "replies": []}, {"body": "Hold long. I am getting in today", "score": 2, "replies": [{"body": "Rock on, maybe by Christmas it'll be up brudder.", "score": 2, "replies": []}]}, {"body": "I’m also in at $175. I plan to hold and add on any dips.  It may dip in the short term but give it 6-9 months and this stock will be back up again, 12 month price targets are still above $300.  \n\nHere are some other reasons why the stock price will grow over time:\n\n1. $7,500 EV instant rebate program will continue to attract buyers \n2. Cybertruck halo effect \n3. Model 3 Highland US launch \n4. Model 3 Ludicrous upgrade launch \n5. New Elon Musk compensation plan \n6. Fed starts cutting int rates \n7. FSD V12 release to the public \n8. $25K-$30K Next Gen model \n9. Optimus production begins next year \n10. Tesla energy storage business \n11. Expanding supercharger network to all manufacturers", "score": 3, "replies": [{"body": "Yes, sounds good comrade.", "score": 1, "replies": []}]}, {"body": "Just wait it out. It always goes back up.", "score": 3, "replies": [{"body": "No it doesnt always go back up. ", "score": 8, "replies": [{"body": "Bro if you pull the lever on the slot machine you'll always make money \"eventually\". /s", "score": 3, "replies": []}, {"body": "If shiet like Meta and Netflix went back up then Tesla can, lol.", "score": 1, "replies": []}]}, {"body": "It'lll probably go back up, but how high. I am not sure if you use trend lines/channels, but TSLA hasn't broke the down trend line that started back in 11-4-2021; the mentioned line has been tested at least 7 times so far. If TSLA doesn't go beyond that line until the 25k car comes out or full FSD, we can possible seeing TSLA go lower for the foreseeable future.", "score": 1, "replies": []}]}, {"body": "lmfayo you TSLA bulls deserve all the shit that's still about to come your way!!! :D\n\nMajor correction to reality!!!  Sell or be SOLD!\n\n:D", "score": 4, "replies": []}, {"body": "My opinion\n\nhttps://preview.redd.it/b5u0iucxl8oc1.png?width=1088&format=png&auto=webp&s=0f41c88494157749664bcf2c19b88b5017286131", "score": 2, "replies": []}, {"body": "You didn't buy \"low\" you bought a stock in a downtrend on the way down.\n\nWe simply have no way of knowing how long this downtrend will last. Support at 175 was strong until it wasn't. Next potential support area is around 162.\n\nIf by some chance the April 2023 low of 152.37 is lost, it could be very bad as there is very little structure down to 100.\n\nI do not anticipate TSLA falling that much, but it has in the past, and might again. If you close your eyes and have a 2-3 year outlook you will probably be fine, as I believe TSLA will continue to be a leader. But if you are not prepared to weather a storm, you might reconsider your investment until TSLA can prove the \"dip\" is being bought.", "score": 2, "replies": [{"body": "Tesla was earning $4+ when it hit $100. Now estimates are $3 and on their way down.\n\nWhat if Tesla earns $2.XX this year? Or $1.50 (Morgan Stanley estimate).\n\nWhy would 2025 be better? What if it's worse?\n\nWhat will Tesla trade to then?", "score": 3, "replies": [{"body": "Valid points, though I do not really trust analysts in general.\n\nBut if growth has indeed slowed significantly, and Tesla is valued by Wall Street more as a car company than a tech growth story, then it is quite possible we see $100 again or even lower.\n\nIt is up to TSLA to convince the world they are an AI-driven growth company again.", "score": 2, "replies": [{"body": "Good call on $162! I was watching just under $161 from the last couple bottoms. Only short term, but that's where it stopped today.\n\nI agree with you on analysts, but usually because they are permanently bullish and adjust price targets to match the stock price (like Adam Jonas with Tesla). \n\nThey are a decent read into expectations for stock expectations though.\n\nLike right now with Tesla auto sales. Growth has slowed dramatically, visible with China and europe sales numbers, and coupled with price cuts is a recipe for terrible earnings through the end of 2025. Yet estimates were and continue to be too high.\n\nUltimately, I think it was easy to give Elon credit for all the future products while sales and EPS were rising. It's going to be a lot tougher if the opposite is happening.", "score": 1, "replies": [{"body": "I was surprised it got there so fast. I managed to catch most of it with TSLQ. The sellers clearly have control for now.\n\nI agree, Tesla needs to re-assert itself as a technology company. They may be doing a lot of innovation behind the scenes, but nothing has materialized. Just an aging line of cars and no shiny new models any time soon.\n\nThat said, they have a tremendous lead on the software, more data than anyone else, and thus should be able to capitalize on the AI wave. Elon should stop being distracted with OpenAI and focus on making Tesla an innovative company again.", "score": 2, "replies": []}]}]}]}]}, {"body": "Don't let people on reddit sway your thesis, you made a solid trade and it'll pay off. Everyone who wanted to sell already has. Even Meet Kevin just went short Tesla. Absolutely maximum fear market, very nice timing.", "score": 3, "replies": [{"body": "Maximum fear? 😂\n\nEarnings estimates are just starting to get cut. The fear hasn’t even started yet.\n\nUBS just cut this quarter 32% and they barely dropped 2024 and 2025 (they will later).\n\n$tsla went to $100 when it was earning $4. This year estimates are still at $3 and Adam Jonas cut his to $1.50.\n\nStaying above $100 this year would be lucky.", "score": 3, "replies": [{"body": "I bet the real panic starts when we're nearing $100. Elon will get margin calls at that point and will be forced to sell massive amounts of shares on the market.", "score": 3, "replies": []}]}, {"body": "Dudes already down and you’re patting him on the back saying he made a solid trade\n\nDo you not understand how ridiculous you sound?", "score": 0, "replies": [{"body": "Yeah 2 days later? He said he's holding long term, does 48 hours constitute a long hold for you? Are you gonna check back here Monday to tell me how bad the advice was?", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "\"Hello. Your submission has been removed. Your account must be older than 15 days old and have greater than 0 comment karma to submit a message. -4\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "In 2016 it was \"low\" at $150, pre-split. I wanted to put $10k on it, but I didn't commit to that thought.\nNow I regretted everyday. That $10k would have become 1mil.", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "\"Hello. Your submission has been removed. Your account must be older than 15 days old and have greater than 0 comment karma to submit a message. -4\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "At the very least buy some puts. You will be protected from a major drop, and can keep your shares. \n\nPersonally I would sell. Tesla has nothing going for it the coming years.", "score": 1, "replies": [{"body": "Why would someone buy puts rather than just selling some shares?", "score": 1, "replies": [{"body": "Let's you keep the shares while protecting you from downside risk.", "score": 1, "replies": [{"body": "When it goes up it wipes out your put position, has the same effect to just sell a few shares", "score": 1, "replies": []}]}]}]}, {"body": "Going all in on a notoriously volatile and overvalued single stock is a terrible financial decision. You’re much more likely to lose more value than to see any kind of positive return at $175. \n\nYou’re gambling with your savings", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "\"Hello. Image/Link submissions are manually reviewed due to spam control. -1B\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}, {"body": "TSLA is the worst performing stock in the S&P 500. I don’t think it’s a good time to invest until they get rid of Musk. So I’d be prepared to hold until he quits, gets forced out, or OD’s at least.", "score": 2, "replies": [{"body": "What if he gains 50lbs lol, I'm sure it'll dip to $75. Hopefully not.", "score": 1, "replies": [{"body": "I would wager it hits $100 before it hits $200", "score": 4, "replies": []}]}]}, {"body": "It is currently one of the most shorted stocks\n\n![gif](giphy|CaTW2QdtN3c0U)\n\nCan’t wait to see it burn some shorts soon", "score": 1, "replies": [{"body": "If you believe Tesla is \"one of the most shorted stocks\" then you are the perfect customer to baghold $TSLA. \n\nYou'll believe anything Elon says.", "score": 2, "replies": []}, {"body": "That’s not even remotely true lol", "score": 1, "replies": []}]}, {"body": "Meh people are always going to find reasons to doubt Musk, always have. If you have 3-5 years to ride on it you’ll be fine. $2T 2030", "score": -1, "replies": []}]}
