{"title": "Another $72k YOLO on MSFT (Calls)", "selftext": "[deleted]", "id": "hdspg4", "created_utc": 1592833883.0, "score": 144, "upvote_ratio": 0.92, "num_comments": 88, "comments": [{"body": "This guy again, lucked out last time. Let’s see if he can do it again", "score": 86, "replies": [{"body": "[deleted]", "score": 63, "replies": [{"body": "Why so deep ITM, why not 190s?", "score": 25, "replies": [{"body": "Possibly for the delta.", "score": 16, "replies": []}, {"body": "If you are asking me, I bought them when it was just barely OTM and then the price went up so now they are deep ITM.", "score": 1, "replies": []}, {"body": "If its deep in the money you have to pay more premiums?", "score": -13, "replies": [{"body": "Deep ITM would be lower premium but higher price. Intrinsic value exists for ITM options.", "score": 18, "replies": []}, {"body": "No, less", "score": 2, "replies": []}]}]}, {"body": "I am hesitant to rejoin the MSFT calls after selling most on Friday. Still have 5x 180c 1/15 and 1x 170c 1/15, I’m hoping it dips this week, I’ll be buying 190c if it does or maybe buying back my 180c", "score": 5, "replies": []}, {"body": "Good for you bro. I love seeing people make P.", "score": 3, "replies": []}, {"body": "well done", "score": 1, "replies": []}, {"body": "Paper hands", "score": 1, "replies": []}]}]}, {"body": "I know this dude is retarded cause he trades off of how much money he will make lmfao", "score": 85, "replies": [{"body": "Idk having an exit strategy sounds smart to me. The rest of these retards would be holding until 10x or more likely -100%", "score": 42, "replies": [{"body": "An exit strategy usually is based around technical price levels. People that trade off p/l don’t really ever make it. \n\nThe goal is to make proper trades and the side affect is money. \n\nYou never enter a trade saying “okay, I’m gonna stay in until I make $500”.", "score": 21, "replies": [{"body": "Sure, but at the same time you should know what your p/l will be at the price level you are targeting and at that point it does not matter which value you are monitoring. \n\nThat said it is much easier for us all to talk about our plays using price targets than p/l since p/l at the same price points will vary from person to person.\n\nI guess what I am saying is that I kind of agree with you, but also it doesn’t really matter.", "score": 9, "replies": [{"body": "Yeah but it’s different with options vs stock. \n\nSure if someone was trading stock they could target a certain $ amount cause it correlates to stock price directly. \n\nHowever options prices vary on a lot of different things that’s why I was saying what I said.", "score": 8, "replies": []}]}, {"body": "works for penny stocks, but i agree bad idea on bluechips with massive sell and buy orders.", "score": 2, "replies": []}, {"body": "It’s just one more multiplication. To each their own", "score": -1, "replies": []}]}]}]}, {"body": "72k in calls expiring in less than a month and you don't even know what a naked call is lmao", "score": 42, "replies": []}, {"body": "Do you know what a naked call is? Hint: it's not buying a call with your pants down, or just buying a regular call, retard. It's when you *write* a call without owning the underlying shares. Using the term wrong makes you look even more autistic. I hope you lose all of your cash.", "score": 97, "replies": [{"body": "Removed in protest of Reddit's API policy changes which are destroying third party apps. -- mass edited with https://redact.dev/", "score": 65, "replies": [{"body": "Yeah, had a good laugh, he thinks he's in r/options 🤣", "score": 25, "replies": [{"body": "Hey buddy I'm still waiting on the gain porn from your 25k yolo on HTZ 11.5c's. You never answered me after that. What happened dawg?", "score": 4, "replies": [{"body": "I'm currently drowning in tendies, can't hear you over all my gains.  But we can me to talk if you want, just meet me at the corner of 5th and 3rd Avenue, the back alley behind the vietnamese place, I'll be the guy in the yellow thong chowing down on tendies.", "score": 6, "replies": [{"body": "Just show us the loss porn man, come on. 25k on HTZ 11.5c 6/19's. You owe it to WSB you beautiful retard.", "score": 3, "replies": [{"body": "… so you think I'm beautiful? 😘", "score": 2, "replies": [{"body": "You know it, sexy. Now man up and post that loss porn. I'll drop a gold, too. So you know what we have is real.", "score": 1, "replies": [{"body": "I'm sorry man, yeah I was just kidding about before, the losses were pretty bad, I made a YouTube video about it, was going to post later tonight, here you go:https://youtu.be/IYa4tSfLx3o", "score": 1, "replies": [{"body": "I know it was you trying to sell all those 11.5s throughout the week. I saw like 2000 asks at one point and i laughed so hard i cried. I even tried to warn you, man. But you insisted i just didn't know how the market worked, lol. Priceless. Don't ever change, buddy.", "score": 2, "replies": [{"body": "Why do you have to rub it in, I'm losing my house because of that trade, my wife left me for her boyfriend, now I have to turn tricks behind krogers for $5 a pop to cover commissions bro", "score": 4, "replies": [{"body": "Hey my bad dawg at least you don't have a G5 to lose tho, amirite?", "score": 3, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "Can I still keep my pants off?", "score": 27, "replies": [{"body": "Only if you're stroking it.", "score": 1, "replies": []}]}, {"body": "Yeah - amazing how these guys don’t even know basic terminology and post their trades for people to follow", "score": 9, "replies": []}, {"body": "A naked call if when your having phone sex with your boyfriend. Is everyone actually retarded here or whut ?", "score": 5, "replies": []}, {"body": "Ban this fool for wishing no tendies on a fucking hero", "score": 10, "replies": [{"body": "Man I don't have to wish. If you cant make and lose $10k with pride you don't belong here.", "score": 6, "replies": []}]}, {"body": "Wait there is a difference between a naked call and a naked put? - this fucking guy probably", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 18, "replies": [{"body": "I got $212.50C 7/10...", "score": 2, "replies": []}, {"body": "Does the 220 strike count", "score": 1, "replies": []}]}, {"body": "that's it boys\n\nthe top is here\n\nWSB meme-ing MSFT 200s means it'll be at 140 again by mid-July", "score": 14, "replies": [{"body": "thank fuck. I can't stand looking at apple at 360", "score": 4, "replies": []}]}, {"body": "Puts the second MSFT hits 200", "score": 6, "replies": [{"body": "It’s your time to shine now", "score": 6, "replies": []}, {"body": "you gonna put your money where your dick is or what", "score": 3, "replies": [{"body": "I’ll buy a put tomorrow at open. Was out of cell reception most of the afternoon", "score": 1, "replies": [{"body": "Were you visiting your girlfriend that totally exists but we don't know her because she goes to a different school?", "score": 3, "replies": [{"body": "How did you know?", "score": 2, "replies": []}]}]}]}]}, {"body": "MSFT does not have calls expiring on July 15th.", "score": 6, "replies": []}, {"body": "What platform are you trading on?  \n\n\nI'm looking for a good way to trade US options from the UK.", "score": 5, "replies": [{"body": "It looks like Plus500", "score": 4, "replies": []}]}, {"body": "\"Naked\" calls.", "score": 10, "replies": []}, {"body": "This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/ZZ_x_Sleepy the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 4, "replies": []}, {"body": "Gl", "score": 5, "replies": []}, {"body": "Why that strike specifically?", "score": 3, "replies": []}, {"body": "You were just saying you were anticipating MSFT to drop to 190 today and then instead you bought calls? \n\nYour investment strategy makes absolutely no sense, but somehow you're lucking out", "score": 3, "replies": [{"body": "Welcome to wsb, take a seat.", "score": 6, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Based on your post history I’d recommend doing some self-educating before you continue what is clearly a gambling addiction as opposed to an investment strategy. You’re getting lucky now, but that’s really all it is, luck", "score": 3, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Yea looks like it. I mean you clearly have some understanding of investing, but as of right now your strategy seems to be mostly reliant on luck, which is fine, you seem to be aware that you are making high risk posts with little reason behind them given the flair you are posting under", "score": 1, "replies": [{"body": "t. -43% YTD expert", "score": 1, "replies": [{"body": "I know enough about investing to know that I have a lot to learn and would never post my trades which would give even less knowledgeable people bad advice. But I also know enough to not make risky and dumb trades like OP. I invest to make steady money over long periods of time, not to get a fix for my gambling addiction\n\nI usually track the S&P pretty well. Only been investing for about 4 years but I’m +3% over the S&P which is nothing sexy, but it’s good enough for me", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Sold just for a 10% gain? I am seeing MSFT going beyond 210 very soon.", "score": 2, "replies": []}, {"body": "You're actually insane, just know", "score": 2, "replies": []}, {"body": "This right here!\n\n90% of wsb is looking for that quick 10baggers but truth be told, non-retarded msft calls is the way to go\n\nMy only regrets is not buying more.", "score": 4, "replies": []}, {"body": "Does MSFT have earnings coming up or something?", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "Godspeed.", "score": 1, "replies": []}, {"body": "are these cfds on options?", "score": 1, "replies": []}, {"body": "Lol, risking 75k for 8k? I've made that for the last week risking only 3k per trade.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Because of theta you lose a % of your money everyday, at 50% of the duration of exp date it starts to move faster and the closer it gets to exp the less value the purchase have.\n\n\nSo on a 30 day exp you make more money in the first 15 day than the second 15 day.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Whoever wrote the option. Doesn't have to be a bank. Anyone can write an option as long as you have the collateral to cover it.", "score": 3, "replies": []}, {"body": "The broker probably", "score": 1, "replies": []}]}]}, {"body": "He’s not holding till expiration", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -10, "replies": [{"body": "Putting a call beneath the current price results in a high premium/cost of entry, but requires less increase in stock price to break even. \n\n Eg, op needs MSFT to reach $198.36 to reach a profit. If he bought $200 calls at the current price ($4.80), MSFT would have to hit $204.80.\n\nLarger buy in to lower risk.\n\nPlus these calls will never expire worthless unless the price drops beneath $180.", "score": 19, "replies": [{"body": "How often do you want to buy these vs. ITM or ahead of money even? If he buys them at $205 hoping to get $220 for example? Giga cheap but big risk but whats the generic rule?\n\n\nI guess there is a calculator somewhere for this", "score": 2, "replies": [{"body": "I have no clue. I'm shit at this.", "score": 2, "replies": []}]}]}, {"body": "Lmao this is some good fucking WSB shit right here.\nYou don't have to buy calls or puts out of the money", "score": 8, "replies": [{"body": "Yeah and you can also buy good calls that expire longer than 1 week or month from now", "score": 5, "replies": []}]}, {"body": "Calls are betting on the price rising, puts on the prices falling. Call options below or at the current share price are considered \"in the money\" which makes them worth more.", "score": -2, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Bird's eye view, most basic explanation. Of course it isn't that simple, but it's the general concept. \n\nr/iamverysmart is that way, douchebag.", "score": -3, "replies": [{"body": "Removed in protest of Reddit's API policy changes which are destroying third party apps. -- mass edited with https://redact.dev/", "score": 1, "replies": [{"body": "Are they intended to be JUST bets? No. But in this subreddit, are you fucking joking? They are regarded as bets in this sub. Options trading in the manner they are traded in this sub is 100% betting, this place is 100% a gambling ring. If you think differently, you're delusional.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "What's your logic for going for ITM calls?", "score": 0, "replies": []}, {"body": "Why ITM?", "score": 0, "replies": []}, {"body": "Why ITM?", "score": 0, "replies": []}, {"body": "You mean 180 put?? How is an itm call a yolo?", "score": -7, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Exactly", "score": 3, "replies": []}]}]}, {"body": "you must've been confused with tsla put", "score": 2, "replies": []}]}]}
