{"title": "Rebuttal to \"Zoom (ZM) stock analysis\" with an actual analysis", "selftext": "The highest-voted post of today was a post saying that Zoom is overvalued, linking to a \"stock analysis\". I was underwhelmed, so I suggest a counter-analysis.\n\n**Debunking the previous \"analysis\"**\n\nBasically, the only arguments were that: the earnings per share and the revenue per share are low. Both of which are usually irrelevant for an early stage company with a high potential for growth.\n\nThe earning per share are completely useless for such a company:\n\n* Amazon had very low profit, or had losses for a large part of their history (so P/E ratio was >500 for 3 years, with a quarter at 3,600 and 7 quarters at infinity P/E ratio, [source](https://www.macrotrends.net/stocks/charts/AMZN/amazon/pe-ratio)). The average annual return on Amazon stock was +35% since then (1,000% total)\n* Facebook had a P/E ratio of 1200 at their first quarter. Average annual return of +37% since then (933% total)\n* Tesla never made a profit, so their P/E ratio has always been infinite. But average annual return of +49% since their IPO (3,700% total)\n* Edit: I chose the most famous examples. But, because many commenters focused on those particular companies, I looked for random ones. Between tickers AAA and ACA, in the Russell 2000, I found Axon Enterprise, Ameris Bancorp, Asbury Automoative Group, ACADIA pharmaceuticals, and Axcelis Technologie. All traded with infinite P/E ratio, all of them were excellent buys at the time. P/E ratio doesn't mean anything by itself, especially for small and medium companies.\n\nI'm no financial analyst, but I think I can do better than that youtube video.\n\nThe first thing to do is to look at their 10-K (annual report)   \n[https://investors.zoom.us/static-files/09a01665-5f33-4007-8e90-de02219886aa](https://investors.zoom.us/static-files/09a01665-5f33-4007-8e90-de02219886aa)\n\nA good analyst would probably read the whole thing. I just went to page 38 to read this:  \n\n\n[Zoom financial statement](https://preview.redd.it/v7kbr2iqm7651.png?width=1528&format=png&auto=webp&s=48f585e9b90c2aa915048f6569b2cb9e0028ea45)\n\nHere, you can see that their YoY growth in revenue was +148% in 2017, +118% in 2018, +88% in 2019. So, if the pandemic had not happened I would have assumed a revenue growth of 60-70% in 2020. Which would mean a 1 billion revenue in 2020, without a pandemic. The \"practical investor\" video states \"suppose that Zoom does very well and their revenue for this year is 1 billion dollars\". So, their optimistic estimation with covid19 and everybody working from home and talking about Zoom is... my base expectation for the counter-factual \"no covid\".\n\n**Why $68 was a fair share price in 2019**  \nFor a company growing so fast, no one should care about their current EPS or revenue. Without the pandemic, you could imagine a $3-4 billion of annual revenue within 6 years. Compared to most companies, their cost of revenue is super low (20%). The research & development cost can scale pretty well (if you have 10 times more users, you can afford 10 times more software engineers, but you don't \\*need\\* 10 times more engineers). Same for \"General and administrative\". And their cost of sales and marketing would probably go down when they leave exponential growth (most of the revenue coming from recurring customers, it costs less to keep them than to get new customers). So, if they were dominant in that field, I could see them having a profit of 40% for their core business. They would probably use most of that do diversify, invest in new products,... (like Google is no longer just a search engine, profits from the engine funded their investments in other projects). But for an investor that's equivalent, that's money which grows the value of the company. In that situation, you would get $1.2-1.5 bn of profit/year.  Let's say they have an EPS of 20 then, that means a valuation of 24bn --> share price of $96 in 2026. So, if I want a return > 5%, I would pay at most $68 in 2019. Which was basically the share price back then.\n\n&#x200B;\n\n**Questions to ask now that there is Covid19**\n\nHow does covid change the company valuation? I don't think the personal use matters directly: those users are unlikely to get a paying account. And people will stop drinking over Zoom after the pandemic (at least not nearly as often). The money will come from professional accounts. But those free personal account can help as a marketing tool, getting people used to the tool, everyone talked about Zoom.\n\nThe questions are: \n\n1. For how long people are required/encouraged to work from home because of the pandemics\n2. Does this significantly change culture after the pandemics?\n3. What shares of the professional video conferencing does Zoom capture?\n4. What are their margin on revenue?\n\nMy estimates would be:\n\n1. Lots of variance, but I guess a large share of the jobs which can be done remotely will be encouraged to work remotely, at least part of the time, until enough people have been vaccinated to reach herd immunity (hard to predict but end of 2021 is reasonable).\n2. If it lasts for so long, many companies will have put things in place making remote work easier. People will have gotten better at this. Most people will return to the office, but I bet it will change the remote-work culture in a big way.\n3. That's the biggest interrogation mark for me. Because of the quality of product, tons of users used the free version during the pandemics (even though there are many other free services). So the name recognition is almost universal. When somebody will think about choosing a video conferencing service, Zoom will be on their mind. But they will only keep those users if they are worth it: they seemed to work better, but they have to keep their competitive edge.\n4. I'm not that worried about margin, their cost of revenue has consistently been under 20%. I don't see cost of cloud computing going up significantly. Their main cost has been sales and marketing. This is expected when you are in exponential growth phase, the percentage will decrease later. The main threat is if competitors push the price down. For this, they have to make a product good enough that companies will choose to pay for Zoom, rather than using free versions (like Microsoft teams included in office, or google meet).\n\n**Estimating the value**\n\nSo, is Zoom overvalued? To be worth $240 today, I would like them to be worth $300 in 5 years, in 2020 dollars (5% inflation-adjusted annual return). \n\nIf anything, the pandemics accelerate their growth, upfronts it.  In 5 years, they will be mature without easy room to grow in developed markets (at least for their videoconferencing product). So their value would come from their earnings, not expected growth. Price share of $300, means a company valuation of $83bn. To justify a $83bn valuation, I would like at least $4.1bn of profit (P/E ratio of 20), preferably $5.5 (P/E ratio of 15). Let's say $5bn\n\nWhat would it take to get $5bn of profit? I'll assume their cost of revenue stay at 20%, their administrative go from 10% to 5% (economy of scales), marketing goes from 50% to 20% (market is more mature), research and development stays at 10% (important to keep their edge). That means their profit could be 40% if they did not see investment opportunities. So to get $5 bn of profit, they would need $12.5bn of revenue.\n\nCan they get to $12.5bn of revenue (in 2020 dollars)? They price their main service at $20/month/host. So they would need 50 million paid accounts (less than that if you count higher priced items like zoom rooms). \n\nThose may be for people working from home, companies which have more than one office,... My guess is that most worker who could work from home, could benefit from good videoconferencing. Even if they work at the office, they might use it to meet with people in other buildings. In my previous companies, all our conference rooms were equipped with Zoom, we all had accounts, even though nobody was working full-time remote.\n\nBefore covid 5% of the workforce worked from home, both in the US and EU (total of 20 million). But 50 to 70% of people could work from home (so > 200 million people, just with US and EU). Counting the whole world, I could see 400 million regularly using videoconferencing for work (growing population, countries like China switching from manufacturing to service as they develop,...). Most won't need it often enough to justify paying for it. So free solutions will do for them. But I could see 150 million people paying for a good videoconference service, and 50 million of them choosing Zoom.\n\nIs it optimistic? Maybe. But if remote work grows, if colleges use Zoom for some classes,... Fifty million accounts is far from absurd. And, again, that's not counting their other products (right now: Zoom Rooms, Zoom Video Webinars, and Zoom Phone, maybe others in the future).  \n\n\n**Option play?**  \nThat's where I'm really not sure. It's not clear to me that Zoom is over or undervalued. But there is a lot of variance. If they become the dominant player, they are under-valued, if Microsoft crushes them with Team they are way overvalued. I don't see much middle ground. So I would probably do a straddle with deep OTM calls and puts very long-dated (like 01/2022). But, of course, the Implied Volatility of ZM is high, so those options are expensive.\n\nI bought some 01/2022 $160 calls when ZM was around $115 (just after the price crashed from Facebook announcement, I thought it was dumb, I don't see companies using Facebook for their video-conferences and that's where I see the money). But I sold those when ZM reached $150, for a 90% profit (if I sold today, I would have gotten > +300% profit). \n\nAgain, I'm not a stock analyst, and I don't have experience in the videoconferencing field.\n\nEDIT: Since I detail how I came up with the valuation. You can easily plug-in your own estimations of paid users in a few years, and return target (Eps when mature, return until then) to get to your esfimation of ZM value.\nEDIT 2 : Added other examples of good buys at infinite P/E ratio", "id": "hd31dn", "created_utc": 1592726181.0, "score": 501, "upvote_ratio": 0.96, "num_comments": 96, "comments": [{"body": "The difference between all the companies you mentioned with infinite PE is that they were trailblazers in their respective industries and expanded to other product lines after seeing tremendous growth in their core business.\nZoom has seen tremendous growth due to Covid in a compressed time-frame and have struggled with that growth due to server issues and privacy concerns.\n\nConcurrently, you have 2 large competitors ( Microsoft and Google) that will easily grab market share since Teams and Hangout are integrated with their clients existing product suite. Same with Webex through Cisco, a favorite in corporate setting. That is a significant headwind for Zoom.\n\nOn the consumer side, which isn't a money maker for Zoom, Facebook will definitely grab market share for the same reason, integration within social media.\n\nI think Zoom offers a slim product offering relative to its valuation and will only lose market share and revenue unless they can parlay to another product.\n\nPuts for me.", "score": 70, "replies": [{"body": "Exactly - what’s easier Microsoft and google to get into the Zoom business or zoom to get into Microsoft and Google biz - and at 63 billion it’s not a take over target like an instagram was for fb.   I own 1 put but want to buy more but I’ve been destroyed- \n\nIf the China spying  is true - will they put a floor on it?", "score": 14, "replies": []}, {"body": "Rather than hangouts, i’ve seen schools and universities use google meet. meets is essentially the next generation of google hangouts, except it’s purely for video calling. Meets is much more secure than zoom, simple to set up at every level, and easy to integrate into a google ecosystem. That makes it ideal for many schools, at least in my area\n\n\nI agree with the puts, i really don’t see what zoom does that’s so unique, and why it’s value is as high as it is. In my eyes it’s just an early arriver in the video conferencing space, and not one that can compete with titans like google and microsoft", "score": 9, "replies": [{"body": "Google meet is implemented into the classroom suite, so yeah zoom is losing a ton to schools", "score": 1, "replies": []}]}, {"body": "Can confirm on the free consumer side that people are moving away from zoom to fb video chats. Started with zoom but we organized the chats through FB, now we just hit the video chat button on the FB and don't need to bother with another service.", "score": 5, "replies": []}, {"body": "Disagree.\n\nSoon adopted oracle OCI for infrastructure scale a few months ago and tho most large companies have MS Office 365, I see more enterprise companies use slack and zoom as opposed to using teams - EVEN tho it’s FREE. So you can’t even pay some companies to use Teams. Google Hangouts is great for fantasy football drafts, no B2B business.", "score": 6, "replies": []}, {"body": "The fortune 100 company I work for with 15k employees just switched our virtual meeting software to Zoom from Webex. We are not allowed to use Facebook, LinkedIn or any other social media platform on our work computer. Most companies are  heading in this direction. Also, I just started taking classes online at my local university and our virtual counselor meetings are set up on Zoom. \nLastly, I have made a 262% return on Zoom stock when I bought last year after it IPO'ed.", "score": 1, "replies": [{"body": "A Fortune 100 company that uses Zoom and was using Webex? We moved away from Cisco Webex years ago and moved to Teams since a lot is done in office 365 anyway.\n\nSince I presume you also have Office 365, what's the advantage of Zoom?", "score": 3, "replies": [{"body": "For most meetings on Webex, everyone had to dial in. Imo hosting a webinar on Zoom is much better, I have had many issues in the past with lag time and attendees complaining about having to dial in or download an app to watch the webinar using webex and level 3.", "score": 2, "replies": []}]}, {"body": ">most companies are  heading in this direction.\n\nWhat is this based on?", "score": 1, "replies": [{"body": "My closest 10 friends that I grew up with that also work for top tech, real estate and fortune 500 companies also use Zoom for virtual meetings. I have asked, as I was interested in knowing meeting/conference tools they use for work.", "score": -1, "replies": [{"body": "Eh that sounds made up.", "score": 2, "replies": [{"body": "Take it as you want it! I posted my experience and as I mentioned I have made money investing in Zoom, not against.", "score": 0, "replies": []}]}]}]}, {"body": "I work for a fortune 60 company, we use webex but looks like we're transitioning to teams. I just don't see the corporate trend in favor of zoom. Zoom is pushing hard and 'buying out' competitor contracts and including those \"new accounts\" in their accounts receivable. I think they were able to capitalize on the whole Zoom fad, but there's no way it's sustainable. But what do I know, I'm a fucking 🌈 🐻 gaping hard from all my zoom puts.", "score": 1, "replies": []}]}, {"body": "I Zoom over a corporate connection from a top 5 blue chip and have zero issues", "score": -2, "replies": []}]}, {"body": "People seem to be missing the incredible value of a post like this.  Instead of being told WHAT to think (like we are so conditioned to do with instant gratification on the interwebs), OP is telling us HOW he thinks.  \n\nWell done.", "score": 212, "replies": [{"body": "Thanks! In the end that's really of what I'm trying to do here :).\n\nOther comments have made some great points, arguing why they think Zoom will not grow its user base by much. I'm not really disagreeing with those counter-arguments, they are reasonable. With your estimate of how much Zoom could grow, you could arrive at a different conclusion from mine in terms of Zoom's current fair value.\n\nIt also shows an optimistic but still reasonable view of Zoom's valuation. Even if you are bearish on Zoom, thinking about \"When would someone looking at the same indicators Frisouille did, notice that Zoom is overvalued?\" would help you time your puts.", "score": 46, "replies": []}, {"body": "So can you tell me how should I think?", "score": 4, "replies": []}]}, {"body": "I love these kinds of counter posts. We don't all have to agree, in fact to be more profitable we should all be looking for counterpoints to our theses to avoid confirmation bias.\n\nIf I make an in-depth analysis post, I always invite people to tear it apart so I can see the other side.\n\nGreat post!", "score": 34, "replies": []}, {"body": "I’m going to lay this out here:\n\nTeams will be integrated with Outlook by the end of next year. As in, they will be the same application. If you use Office, Teams will be included as part of the package.\n\nBeyond that, Zoom is not special. BlueJeans, Webex, Skype and half a dozen other products do the same thing to varying degrees at different price points.\n\nI don’t make a lot of predictions, but I will make this one: Zoom will be a legacy product within 5 years, unless it lives on as part of a Microsoft competitor’s productivity suite. Only Amazon or Google can save them.", "score": 16, "replies": [{"body": "I find google meet to offer almost identical features to zoom in a perhaps slightly less clear ecosystem. \n\nGoogle have been trying to integrate Meet more with Gmail and if they advertise it more on say the google front page, they could absolutely crush Zoom IMO. Particularly because Meet is free for everyone and has integration with Gsuite which probably a good chunk of companies already have (unless they buy into the Microsoft ecosystem which has MS Teams anyway), so I don't see why a company would opt for Zoom over these services.\n\n\nFor non-corporate customers, there's google Meet which again is free with your Google account, and you have Facebook's upcoming service along with Skype, Houseparty, Discord, etc.  \n\n\nWhen you have these platforms which already have established userbases, and particularly ones packaged with other things, I don't see Zoom gaining, or necessarily maintaining, a significant market share in corporate or consumer fields", "score": 6, "replies": [{"body": "This is another market space Ballmer-era Microsoft ceded to competitors. A decade of MSN Messenger, Windows Messenger, Office Communicator rebranded as Lync, then buying Skype, rebranding Lync as Skype for Business, then dumping Skype for Teams... the only thing worse than buying ZM would be having bagheld MSFT through that era.", "score": 3, "replies": []}]}, {"body": "I'll sell $ZM when my company stops using it. Ours is one of the few companies that use Microsoft (365), Amazon (cloud) and Google (cloud) products. And Cisco VPNs. Even then, our company decided to go with Zoom early in 2019. They have excellent enterprise support and coming up with Slack-like integrations and bots. Right now I'm developing a chatbot on it for an internal application. They have staying power.", "score": 9, "replies": []}, {"body": "1- To borrow from Apple, Zoom \"just works.\" Yes, you're right that anyone else can make video chatting applications, but ease of use is an incredibly important characteristic that's hard to quantify. Zoom has this. Other video chatting apps don't (at least not yet). \n\n2- Inertia. People (especially older people) don't want to learn 6 different video chatting apps.  They already know Zoom. If a client sends me a meeting invite for something that isn't Zoom, I groan.\n\n3- Network effects. Clients/customers/suppliers are already on Zoom. It doesn't benefit me at all if Teams/Hangouts adds 1000 new features but the people I want to video conference with aren't on it.", "score": 5, "replies": [{"body": "If microsoft teams can be joined by anyone with the link theres no reason they cant take over. Havent used that myself but multiple friends' companies use it and are all happy with it. Never hears anyone be happy about hangout and skype. \n\nTbh the main advantage of zoom is/was the fact you didnt need an account and could just join the link. Seems fairly easy to copy.\n\nWithout accounts theres no network effect.", "score": 1, "replies": []}]}]}, {"body": "The only question I have is “has zoom reached its revenue ceiling?” It is possible that they cannot grow anymore. Really covid 19 was the best thing ever for them. Also their moat is narrow. Skype and google video is also out there. Zoom needs to be innovative... and right now, besides their single product, I’m not sure what else they have in store. I struggle to see them growing any further. I also don’t think their revenues go down much unless they increase prices but eventually with one product, you hit a revenue ceiling with no innovations.", "score": 9, "replies": [{"body": "They bought Keybase.io. If ZM was based in a country with more freedom I would have applauded the move. Instead as a Chinese company I have lost interest in Keybase.io and have uninstalled it.", "score": 1, "replies": []}]}, {"body": "Honestly, I do not understand the value of their offering. They have so many competitors that have the mean to catch up to whatever they do different, but without the shown lack of concerns for security. For what it's worth,  we actually have a company-wide policy against Zoom. We just can't risk defaulting in our privacy contracts because of sketchy software.\n\nBut that's just my 2c.", "score": 8, "replies": []}, {"body": "[deleted]", "score": 25, "replies": [{"body": "Zoom is a commoditized SaaS. There are no barriers to entry and there are many similar products on the market. The valuation is absurd. Tech bubble 2.0.", "score": 26, "replies": [{"body": "Funniest part of this is that people have been saying exactly the same thing the whole way up.", "score": 6, "replies": [{"body": "Doesn’t mean they’re wrong. It just means that the market is currently irrational and we know that markets can remain irrational for long periods of time. \n\nIf you’re buying here, your only rational thesis is that there will be a greater fool to buy from you at a higher price. No sane investor would pay such a premium for a one trick pony company that has no moat and no brand loyalty.", "score": 6, "replies": [{"body": "No it doesn’t mean they’re wrong, it just means they’d rather be right than make money.", "score": 1, "replies": [{"body": "Everything depends on the desired risk/reward for each individual. Anyone who has a lot of capital need not take unnecessary risk, which is what you'd be doing buying ZM at these absurd valuations. \n\nBeing right can take a while, but if you're not shorting, you've got no skin in the game to care really. I have no position in ZM myself, nor would I short it via puts due to the high implied volatility, and thus, premiums.", "score": 1, "replies": []}]}]}]}]}, {"body": "Grpn was $300 at one point. It’s under a buck now (they just reverse split). Nearly zero barriers to entry. Same for video conferencing", "score": 10, "replies": []}]}, {"body": "Thanks for the write up, great read. I too have fallen into the bear argument of “a video meeting service has a PE of 10x that of Amazon”. That said their Covid revenue bump will propel them into 2021 with strength but I do believe this has or will plateau very soon. We are definitely past the period of exponential user growth and they still are not sharing how many of those are the free 40 minute licenses. They shocked the market and their name has become commonplace but at the end of the day I don’t see any competitive advantage that allows them to protect their market share medium to long term. So many companies are already fully integrated with Microsoft cloud suite that it only makes sense that they will eventually offer a better version of Teams with attractive pricing to compete/undercut. Their product is solid no doubt but when it becomes a question of budget I don’t see much brand loyalty personally speaking. \n\nSo the play imo, long dated puts are way too expensive and it probably isn’t moving anytime soon. I’ve had some success selling call spreads against it. Last week 280/290 calls ~30dte were fetching between $2.50-3.00 credit. That said I also have some 240/250 spreads that are currently ITM. Really looking for that pullback...any day now 😐", "score": 6, "replies": []}, {"body": "What happens when covid goes away?  This is a bet on covids work from home dynamic, and a bet that they have something so proprietary that no one could catch up.  High growth stocks indeed run up revenue early, but I believe their run up is shorter than most growth stories.", "score": 12, "replies": [{"body": "I think the goals of this analysis are way off base. If you want 5% inflation adjusted growth as your threshold for a good stock pick then throw your money in an index fund that has much less chance of imploding. \n\nI’m skeptical on a single product stock that’s not too well established because all it takes is one more bad move and the whole company is trash, especially when there are so many established big name competitors for professional use (teams, new chime and slack partnership, google)", "score": 4, "replies": []}, {"body": ">What happens when covid goes away?  This is a bet on covids work from home dynamic,    \n     \nNot invested in Zoom, nor do I have any strong feelings for or against it, but in regards to your question. At least here in my country, several larger companies (including our biggest IT company), have said that working from home will be permanently available to all their employees going forward. That includes after COVID is over and done with.           \n\nI would be surprised if my country was the only one with companies taking that position in a post-COVID world.", "score": 1, "replies": [{"body": "Puts on commercial office space reits", "score": 3, "replies": [{"body": "This is likely a better play than calls on zm.", "score": 1, "replies": []}]}]}, {"body": "To get to 50 million paying users, I see it as an \"or\" of your two propositions.\n\n- Either the market for professional video calls grows significantly after covid.\n- Or there is no significant long term change but Zoom is dominant. I don't have good numbers on how many people actually did videocalls before covid? How many paid?\n\nFor the first point, I don't think employees working from home are the only targets. If you have an office in NYC and an office in SF, you want a good software to communicate. That's why I'm using the people who \"could\" work from home as a target for potential client: if you \"could\" work from home, then you can do part of your job over zoom, whether it's with clients, collaborate with colleagues in other cities, to interview candidates,...\n\nI just think that the pandemics will make any of those interaction more normal, because they will have used them so much.\n\nAnd yeah, you can make a good argument they are overvalued (no defensible advantage, Microsoft team is better). I've just seen so many posts and comments based on P/E between here and wsb, I was fed up. The valuation is far from absurd.", "score": 1, "replies": []}]}, {"body": "Counterpoint:  all the examples you compared Zoom to have a dominant advantage in their space that is almost impossible to replicate.\n\n-Facebook: 2 billion user strong rage network where user base is untouchable\n\n-amazon: unbeatable execution and customer obsession as well as ability to instantly scale into and dominate any sector they want\n\n-Tesla: cult of fans who dream of sucking Elon dry and view him as a new age Jesus, unbeatable head start on autopilot that changes what a car is \n\n\nZoom: video chat that any relevant tech company can create and already as created in weeks (amazon chime, Facebook rooms etc)\n\n\nZoom going back to $100, don’t know when but it will", "score": 30, "replies": [{"body": "Those comparisons are just the ones from the top of my head to show PE ratio doesn't matter when you are fast-growing. So I chose the most famous examples. If you have historical data, you will find tons of companies justifying with a loss over a year (so an infinite EPS) which were good investments.  Zoom is fast-growing (pre-covid) and its valuation relies on an even faster pace of growth. To show it's overvalued, you have to convince it will stop growing fast in the future (which you do in the 2nd part of your post), the current EPS is irrelevant.\n\nThe companies I listed did a tenfold stock increase. No way Zoom does that (they won't get 500 million paid accounts). But could it grow 5% a year? \n\nAs you said, their competitors got serious. The question is whether Zoom can grow to ~50 millions paying customers despite the competition. They may have lost their competitive advantage. \n\nI would probably need the financial report from Q4 2020 to agree that Zoom is overvalued: it's possible they lose customers from Q2 to Q3 because of end of shelter-in-place, but I would expect them to start growing after that. They would need a minimum of 10 million paying users at the end if the year, with momentum, to justify their current valuation in my eyes (around $2bn of annualized revenue in Q4).", "score": 5, "replies": [{"body": "You did good analyst, but you make assumptions without reason. When you compared to companies that had low p/e such as Amazon they were battling brick and mortar stores and there wasn't a stronger competitor. With zoom their battle companies much bigger than themselves with better products. \n\nAssuming they go from 50 million paid subscriptions to 400 million is likely impossible. There are not 400 million companies that would want to use an Intherior product if they are going to be working remotely long term. Their free sample accounts and ease of use put them at an advantage short term, but long term there looks to be a loss of growth. They already started losing loading of paid users.during June and it looks like more will follow in July.\n\nTheir Q2 is going to be there best quarter.the company will ever have as businesses were fourced to find quick easy solutions to work remotely.  government enforced restrictions will be lifted causing a loss in users and user moving to better products such as Google's or.microsofts. \n\nOther than assumptions without backing data your targets and planning was really well thought out.", "score": 10, "replies": [{"body": "Yep, I don't know enough about that market to evaluate Zoom's product vs its competitors. My post says that, if you think that Zoom will get a good share of the market, its current valuation is reasonable. But I don't have anything to back up my assumption (I did not compare the product to its concurrent in any way in this post).\n\nAlthough, according to my calculations, Zoom only needs 50 million paid users, not 400. The figure \"400 million\" is the total amount of people who may use video call in a professional setting (whether they use a free or paid service), in 5 years, in the whole world. Zoom would only need to get 12% of this market.", "score": 0, "replies": [{"body": "I wish they would stop trying to hide their user numbers. They've gone from releasing paid subscriptions numbers to meeting atendees, which is very problematic. One paid subscription could have 20 employees in a meeting and 5 meetings a day. Their 1 paid subscription is going to be counted as 100 meeting attendees. Not to mention the free users are lumped into this calculation as well.\n\nLikey as you said we're not going to get their true paid subscription numbers until Q3 - Q4, but it doesn't make sense to start hiding them now.", "score": 9, "replies": [{"body": "Oh Zoom is absolutely going to tank at some point and the only reason is the competitive market.   But it could be 5 years plus for that to happen.\n\nZoom kind of reminds me of the rise of Second Life (Linden Lab).   2004-2006 they had an advanced technology and a small user base.  In 2006 they blew up to a massive userbase.  No one really knew what the monetary value was, but the active users and money flow showed some things.   But then suddenly,  userbase dried up as virtual worlds became commonplace.   The concept of Second Life is invaluable.  The monetary value of it currently is a fraction of a fraction of its peak.   And there’s nothing they can do to ever climb back up again.\n\nSo, Zoom, the technology has already been functional and usable for over a decade (Skype for example)... the corporate fad in February was Zoom.   People are using it because of work and because it’s currently present in their faces... but there is nothing special about Zoom.  There are no unique features and no special technology.   Just a market share which is based around users using.", "score": 6, "replies": []}]}]}, {"body": "When you say Amazon was battling brick and mortar.. One could make a case Zoom(and it’s competition) has taking a lot of market share from the airlines, especially business class. The growth here is undeniable. \n\nI do agree there is is only somewhat of a switching cost here, even for a huge enterprise, but they’re building a pretty good brand at this point and have some network effects going before other well funded companies can slow revenue growth.", "score": -2, "replies": []}]}, {"body": "My thing is yes financially they should make money. But they don't have alot to offer. Where is the next \" product\" that they can offer. You said zoom phones. Thats not a moat. Phones already got FaceTime zoom ect. They dont have any economic moat. And keep adding competition in vid conf and they will peak quickly and fade fast. I.m.o. but they are a meme stock right now. Its the cool train. But I don't see real growth. This may have busted their nut", "score": 2, "replies": []}]}]}, {"body": "Put?", "score": 3, "replies": []}, {"body": "I think you're correct that ZM's valuation depends on if Microsoft Teams takes significant market share or not. That's hard to predict, but I think it would make sense for Microsoft to try. Not sure how that would translate to options plays without news though.", "score": 3, "replies": []}, {"body": "The problem with your assumptions is that you assume Zoom is the only video conferencing app.\n\nThere is no barrier to entry for zoom and a lot of the enterprise software providers have competitors that could overtake them especially if it integrates better with existing suites. I expect Microsoft in particular will dramatically improve their conferencing.\n\nZoom has no plans for expansion outside of the video conferencing arena, which is a huge mistake. The best hope for their current valuation is that they get bought out.", "score": 3, "replies": []}, {"body": "ZM is wildly overvalued on every metric. Everything you said is worthless after “I’m not an actual analyst”", "score": 3, "replies": []}, {"body": "Amazon sold things cheaper than anyone else, and all the other companies did something unique.  \n\nWhat does Zoom actually do?  It is video chat, right?  So what's so special about it compared to Skype/MS teams/whatever?  Do they actually do anything unique, or is it just the famous name that the pandemic gave us?  \n\nNo, I never used Zoom because video conferencing has been around for 15 years now and I don't see why I should try Zoom now.  It seems like the chat programs; they get hot for a little while, and then disappear into the abyss.", "score": 3, "replies": []}, {"body": "The biggest concern with Zoom along with many other Tech companies is being phased out by the big already established companies.  Video conferencing is extremely competitive and Zoom doesn’t provide enough of a moat to say it’s a clear winner over the other options", "score": 2, "replies": []}, {"body": "I like your thought process but using Amazon as a comparison is worthless data point imo.", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Lol. Tldr: \"b-b-but tesla!\"", "score": 1, "replies": []}]}]}, {"body": "It's a well written. But op has made numerous assumptions to support his theory and have made comparison with such stories from different companies. Anytime I analyse or read a analysis I always look at the negatives that are written. But op only has glowing things to say even the rosiest companies have many things that could go wrong. So when someone doesn't mention any negatives I am skeptical of their interest either be this post or the other one calling for  puts. \n\nZm is not as rosy as it is portaied may be it will be but the core business it is having is not in any way a most for them as it's easily replicate by competition and already have done and in works.\n\n So to assume it will have competitive advantage over time from big starlwarts and continue the kind of growth Isa futile assumption. It's market share is most likely will be eaten away by other players so the next big thing is diversification that they will have to do to be competitive.unless we see that happening the valuation is going to be questionable.\n\nBiggest factor op missed is zm got this kind of valuation only because of covid ..if the business was rosy before it would have demanded atleadt relative premium before covid but it did not. That is the whole point of counter argument.\n\nDisclosure no position in ZM", "score": 2, "replies": []}, {"body": "But their customers already have the identical product free from Microsoft and Google.", "score": 2, "replies": []}, {"body": "Are you referring to this one? \n\nhttps://www.reddit.com/r/options/comments/hcqe46/zoom_zm_stock_analysis_put_option_volume/\n\nVideo-only DD is automatically suspect, in my book. Surprised it got so much attention. I didn't bother to watch it, myself.", "score": 2, "replies": [{"body": "I'm wondering if the people who upvoted it bothered to watch. People who are bearish on Zoom probably read the title and upvoted...", "score": 1, "replies": []}]}, {"body": "Hey feel so bad for people that buy puts on zoom. I’ve seen this discussion at least ten times. Everyone says zoom is overvalued, they buy puts, and the price keeps going up. It will only go up fellas. Just find a different stock.", "score": 2, "replies": []}, {"body": "Thank you", "score": 2, "replies": []}, {"body": "Many people on here were arguing and thinking Zoom was so overvalued at 100, 150, then 200. Lol. So many argued with me about the price and valuation of Zoom as I said it would go to 250. You know what, it’s going to 300!!", "score": 3, "replies": [{"body": "It's just so hard. With well-established companies, you can make an earnings estimate. Fast growing are way harder: how high can they grow? A start up during a pandemic, in a rapidly changing market... you could make the case for Zm to $50, or Zm to $500 and neither would be absurd to me.", "score": 7, "replies": [{"body": "Agree.", "score": 1, "replies": []}]}, {"body": "this is based off what? your 8 ball?", "score": 5, "replies": [{"body": "Lol.", "score": 1, "replies": []}, {"body": "20+ years of net positive trading and investing.", "score": -1, "replies": [{"body": "so 8 ball, ok.", "score": 7, "replies": []}]}]}, {"body": "Of course it will. This company hasnt reached its BC (Buying Climax) yet (considering that investors are still gauging covid 2nd wave sentiments). It would be interesting how investors would react when lockdown is lifted and vaccine is announced.", "score": 1, "replies": []}]}, {"body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/stonkfeed] [Rebuttal to \"Zoom (ZM) stock analysis\" with an actual analysis](https://www.reddit.com/r/StonkFeed/comments/hd60cm/rebuttal_to_zoom_zm_stock_analysis_with_an_actual/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*", "score": 1, "replies": []}, {"body": "I just said o look they tripled some of their results so ill just triple what the stock could be worth untill next earnings.", "score": 1, "replies": []}, {"body": "Their PBX capability(aka the ability to replace call trees and call routing including support call in centers) is the most important point. This makes them an actual competitor to Cisco and teams. They released it early in response to covid.", "score": 1, "replies": []}, {"body": "Simple question op: will you continue to use them if they charged you $? 95% of people I know would happily switch to the next free service. \n\nZM is hosted on AWS, does your opinion change if Amazon launches a teleconferencing app?", "score": 1, "replies": []}, {"body": "Eh, their technology is easily replicated is my issue with zoom. If teleconferencing is here to stay, google, Facebook, Microsoft can easily beef up their offerings. Zoom has nothing protecting their product from competition. Competition will come.", "score": 1, "replies": []}, {"body": "Best DD ive seen all week", "score": 1, "replies": []}, {"body": "This is a good post. \n\nTo understand this stock’s potential, look at Zoom’s corporate client list and see that it’s a whose who of the Fortune 500. you have to realize that the major technology companies have had this available for over a decade and have been unable to monetize it. Now Zoom is capturing corporate sponsorship and becoming the de facto professional video technology a la Microsoft was to corporate computing systems. \n\n\nZoom isn’t going away. In one month they went from a virtual nobody to a candidate for joining Webster’s dictionary. “I’m going to zoom *Grandma* “\n\nCost of sales will increase marginally and revenue growth will slow down. But major corporations will continue to pay for public licenses and will enable to public to receive it for free, thus creating their own market of a client base.", "score": 1, "replies": []}, {"body": "You better believe alot of IT companies are gunning to take down zm.  Anything really proprietary or wide moat about ZM?", "score": 1, "replies": []}, {"body": "Any reaction to Microsoft Teams trial release at the end of the month, with full release in fall?  And to zm free users loosing encryption?  U better believe Microsoft will not mess up the security features.", "score": 1, "replies": []}, {"body": "Profit estimates are unbelievably optimistic for what is just another conferencing app in a crowded space. There is nothing ground breaking about Zoom other than you don't need an account to use it. Is it a good product? Absolutely. So are five others. Tens of millions of people paying for video conferencing? Why? You can use Meet if your company also has a Google Business subscription. You can use Microsoft's apps the same way. \n\nNow, can the stock price go higher in this environment of \"stocks only go up\"? Sure, and if that's how you define that a company \"makes a killing\", then buy call options. Just remember that any analysis like this is irrelevant in the context of value investing since this company operates in a crowded space and does nothing to advance it on top of earning a few cents a share. From a speculative point of view you don't even need an analysis to justify gambling just like you don't weigh your odds before playing blackjack, you're going to do it anyway.", "score": 1, "replies": []}, {"body": "Zoom is another GoPro.  A way overvalued one trick pony.", "score": 1, "replies": []}, {"body": "Are you sure you’re not a financial analyst? You’ve done a great job here!", "score": 1, "replies": []}, {"body": "Wait they’re not growing fast though? They’re declining yoy... I’m confused", "score": 1, "replies": []}, {"body": "Long $ZM", "score": 1, "replies": []}, {"body": "I need clarification on the option play written about here. I thought straddles were ATM? What does a \"straddle with deep out-of-the-money calls and puts very long-dated (like 01/2022)\" referring to here then? If the calls are deep OTM then puts at the same strike will be deep ITM. Can anyone clarify? I'm not new to options but I cannot tell what OP is describing in terms of options strategy. Sounds to be directionally neutral but requiring a large move which a long ATM LEAP Straddle would do. But then there is nothing OTM about that.", "score": 1, "replies": []}, {"body": "I hate how Amazon is used as an excuse for any stock being over valued. Amazon's value to me has changed very little in the past five years, and their most profitable offering is a commodity (web hosting) with diminishing margins as most companies adopt cloud agnostic solutions.\n\nThere's no thesis that justifies the valuation of such a rinky dink operation. It's more than Tesla was before it surged. IMO Zoom's advertising strategy was to get established social media accounts to verb \"Zoom\". Given their large marketing budget have you actually seen any ads? That's what I thought. Somehow this shit worked. Sickening.", "score": 1, "replies": []}, {"body": "For the assumption about market growth you need to look at Teams, Webex, Skype for Business and Meet as these tend to be corporate staples. If zoom can pull accounts from underneath these, it's going to hit above your projected desired numbers. Fyi every company has a conferencing subscription even if not working remotely, you always need to deal with people not within your reach.", "score": 1, "replies": []}, {"body": "This is so professionally put together, You’re THE GOAT", "score": 1, "replies": []}, {"body": "you didn't even discount the cash flows.  this is nonsense.  please stop guys!  so many things wrong with this i don't know where to begin.", "score": 1, "replies": []}, {"body": "Id love to by options but they are super expensive", "score": 0, "replies": []}, {"body": "I saw you compare zoom to amazon then stopped reading. But thanks for your effort", "score": -11, "replies": [{"body": "Do you prefer one of the following: Axon Enterprise, Ameris Bancorp, Asbury Automoative Group, ACADIA pharmaceuticals, Axcelis Technologies? All public companies which traded for a long time with an infinite P/E ratio. All of those were excellent buys. And that's only for companies with a ticker between AA and AC in alphabetical order. Being a good buy while having a really high P/E ratio is super common.", "score": 3, "replies": [{"body": "Any company can get an infinite P/E ratio by losing money...", "score": 2, "replies": [{"body": "Yes, and losing money does not mean it's a bad company. You have to look at why they are losing money. One of the reasons why Zoom doesn't earn much is because of  how fast they make the company grow (including investments). Losing money is not, by itself, a bearish sign. A very high P/E ratio is not, by itself, a bearish sign.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -3, "replies": [{"body": "I have used the service, a lot. I haven't used many of their competitors (only skype, google hangouts, facebook videos, and bluejeans). It's hard to see if they will dominate that space or become irrelevant.\n\nI also don't see (yet) how they could grow up to be more than a videochat company. I am not sure they need to, 50 million users in 5 years seem high but not impossible (if they are the best paid service).", "score": 1, "replies": []}]}]}]}]}
