{"title": "Beginners, don't do anything stupid!!!", "selftext": "I know. It's red, everything went down for quite a lot and you might have lost a lot of money today, or did you??\n\nJust as you don't win anything until you cash out on your move, you don't lose anything until:\n\n1. The company you invested into goes bankrupt and liquidates your shares (extremely rare, predictable and easily avoidable if you're keeping up with news).\n2. **You cash out your loss. So, do not panic sell!**\n\nThe market will recover, even if it's going to take 1 week or a couple of months up to a year, it will happen at some point. **If you don't need the money right now**, just keep it invested, and also buy some more when it drops further.\n\nI saw a bunch of people today dumping, out of fear of a new recession wave, everything they had, including stocks at **Microsoft**, **Delta**, **TSMC**. **Those companies aren't going anywhere!** Even Delta has piles of cash to burn through for more than a year and the Feds are printing an loaning like crazy, and with close to zero interest on top of it.\n\nYes, the market was overpriced for the current economic, but that doesn't mean it won't be back up later on. **I will** and it is only a matter of time. \n\nI'm going to finish up with this, although Warren Buffet messed up quite a bit with some stocks. Try to remember and invest by his following quote: \"Be fearful when others are greedy and greedy when others are fearful.\"", "id": "h17wst", "created_utc": 1591909183.0, "score": 79, "upvote_ratio": 0.77, "num_comments": 93, "comments": [{"body": "You're trying to convince the population that's buying up Hertz", "score": 80, "replies": [{"body": "Or NKLA. It went up to 40B market cap, while having just promises with no product lol", "score": 34, "replies": [{"body": "> Nikola Motor Corp. has yet to sell a single car, has $0 in revenue, and doesn't expect to generate revenue until 2021.\n\n[tf are people thinking](https://markets.businessinsider.com/news/stocks/nikola-stock-market-value-soar-past-ford-fiat-chrysler-surpass-2020-6-1029298004)\n\n> Based on Nikola's 402.9 million shares outstanding, Nikola had a market valuation of as much as $31 billion in Wednesday trading. That surpassed Ford's market capitalization of $27.5 billion and Fiat Chrysler's market cap of $20 billion, according to data from YCharts. ...\n\n> While **Nikola has potential revenue** from pre-orders, **Ford and Fiat Chrysler have actual revenue** from selling millions of cars annually.", "score": 11, "replies": [{"body": "KInd of seems riskys, 2021 is still 6 months away, and NKLA will have income until a vaccine is on the market.", "score": 1, "replies": []}, {"body": "yeah but remember when amazon wasn't making money?", "score": -5, "replies": [{"body": "There’s a world of difference between zero income and zero revenue. If your business model is predicated on selling things, and you have no sales, I guess it doesn’t matter when Robinhood exists.", "score": 11, "replies": []}, {"body": "This is the industrial and manufacturing sector, not tech and e-commerce. It's a huge difference.", "score": 2, "replies": []}, {"body": "This is completely different. A pre product company that hasn’t even hired to capacity is not even close to a corporation that does high volume low margin. One has customers and handles a % of GDP. The other is a press release in a notoriously difficult business. If you don’t understand the difference you should exit your positions now before you lose it all. I’m serious.", "score": 2, "replies": []}]}]}, {"body": "Still appreciate the advice man😀", "score": 2, "replies": []}, {"body": "Easiest short ever.", "score": 2, "replies": []}]}]}, {"body": "I sold today became a) I still made money and b) betting that those specific stocks will go even lower and I'll buy them again", "score": 19, "replies": [{"body": "I just sold my two dumb stocks I bet on. Cashed out to get JP Morgan if they keep dropping more. \n\nBe careful with wash sales if you do that", "score": 2, "replies": [{"body": "Yeah, I just do it with my eh why not stocks. Good luck with JP Morgan", "score": 5, "replies": []}]}, {"body": "Is there a penalty/will you get taxed more for stocks if you hold it for less than a year?", "score": 1, "replies": [{"body": "In US I am pretty sure there is a tax cut if you hold them for over a year", "score": 3, "replies": []}, {"body": "Yes", "score": 2, "replies": []}]}]}, {"body": "Buy the derp.", "score": 17, "replies": []}, {"body": "Only thing everyone should be even thinking about selling are the highly speculative stock that have skyrocketed in the past couple of weeks. Corrections hit those the hardest. If the company is good, hold it. Everyone else will be cycling into those.", "score": 8, "replies": [{"body": "Does that hold include airline stocks? I'm new and put all of my chips on United, American and Spirit... I'm down 20% of my initial investment.  But all I need them to do is go up about $4 and I can cash out", "score": 3, "replies": [{"body": "Airlines will take some time to recover. AAL was extremely overvalued a week ago at 20$. They were at 27$ before the pandemic without a ton of debt and a looming bankruptcy...\n\nI don't see AAL going anywhere since the feds are basically saving them by burying them in credit, but it will be a long hold (up to a year IMO) before they go back to 20-22$. That's to say if nothing amazing happens during summer, like everyone forgetting about COVID-19 and started traveling again, and if there is no second wave of covid-19 in the autumn...", "score": 1, "replies": [{"body": "Damn $22 is exactly where I need them to get to so I can sell at a small profit. Good start today pre market.... hopefully something can happen", "score": 1, "replies": [{"body": "Then a bit of research beforehand would have helped you a lot. I will get there, but not anytime soon... \n\n&#x200B;\n\nIn the future, at least check the analyst requirements if you don't have enough time to actually educate yourself on economy/finance and then evaluate yourself based on the balance sheets.\n\n&#x200B;\n\nI'm not bashing on you btw, we all make mistakes, we all start somewhere, and some people don't have enough time to become active investors. If the latter is your case, that's what analyst ratings are for.", "score": 2, "replies": []}]}]}, {"body": "I'm new, too, and I bought LUV. I like its balance sheet, and from what I understand, it's a healthy airline company that will probably survive if others fail. I'm not sure if I'll invest in other airlines, but I'm definitely gonna pick up some more Southwest in this new dip.", "score": 1, "replies": []}]}]}, {"body": "[removed]", "score": 27, "replies": [{"body": "Ofc, if you need the money, or if you're not a beginner and you think it can be invested better, or the company is in a tough spot, but seeing people who just started trading 2-3 months ago dumping DAL, SYF, MSFT, TSM stocks just because of the panic is mindblowing.\n\n&#x200B;\n\nI honestly see any drop like this like an amazing oportunity to buy shares at a discount...", "score": 13, "replies": [{"body": "I've bought at this price, and I've generally been bearish throughout this rally. I assume it's just a pullback", "score": 2, "replies": []}]}]}, {"body": "Bought delta at 21 and I'm getting ready to do it again quick. Long on DAL", "score": 5, "replies": []}, {"body": "Tell tale signs of an imminent crash : sudden influx of beginners.", "score": 5, "replies": []}, {"body": "Dow bout plummet", "score": 3, "replies": []}, {"body": "Selling isn’t stupid. We need to cleanse the markets and rid ourselves of the zombie corps.", "score": 5, "replies": []}, {"body": "Sell before it all goes to zero", "score": 4, "replies": [{"body": "SPY 0 6/19 puts", "score": 1, "replies": []}]}, {"body": "Delta is garbage.  LUV is in a far better position.", "score": 3, "replies": [{"body": "I'm pulling my hair out bc on my third day ever in the market I put all of my chips on American, United and Spirit because I didn't know better. Am I toast?", "score": 2, "replies": []}, {"body": "LUV might be better, Spirit is ok too, but DAL is far from garbage... They have a crap ton of money to burn, to the point that although they are losing a lot now, they are looking to acquire bankrupt LATAM along with their debt...", "score": 2, "replies": [{"body": "Meant Delta is garbage relative to LUV.   My rankings of airpines from best to worst: LUV, JBLU, ALK, DAL, SAVE, UAL/AAL.\n\nJet Blue is the 'sleeper' b/c no one talks about it and they get extremely high customer satisfaction scores and has good cash/debt.  And big in the Northeast region.", "score": 3, "replies": [{"body": "True. JBLU is awesome :D\n\n&#x200B;\n\nOut of curiosity, why do you put UAL at the same level as AAL? I was thinking of them being close to DAL in terms of financials, but I honestly didn't spend much time researching them.", "score": 1, "replies": [{"body": "Actually I haven't looked at UAL's balance sheet.  I know that American had gone bankrupt.  I just know their cash burns have been heavy.  Maybe it wasn't right for me to put it together but doesn't matter really.  Kinda like when Buffett bought airlines, he bought them all b/c he didn't know which one would do well.  So I just grouped UAl with AAL.  These airlines have a long way to go to getting back to pre-covid levels.  I'm not touching.", "score": 1, "replies": [{"body": "AAL was looking for bankruptcy, but didn't actually go bankrupt because the feds stepped in and printed them out of the bankruptcy zone.\n\nFrom what I could tell, UAL, DAL and Spirit are pretty similar in terms of financials, asides UAL and DAL have major flight networks and that allows them to link up flights more easily than smaller airlines. This is especially nice since the government requires a certain number of flights to be maintained regardless of the load. \n\nThat hit hard for smaller airlines and caused Spirit and JBLU to shut down flights into some areas and focus more on specific zones in which they have enough routes, like JBLU does in the north-east.", "score": 1, "replies": []}]}]}]}, {"body": "Lol. Delta literally has news out today about a filing looking to renegotiate their debt. Part of the reason for the airlines tailspin. \n\nKnow another word for debt renegotiation?", "score": 3, "replies": [{"body": "That actually would definitely explain LUV’s fall from 40.5 to 33 over two days", "score": 0, "replies": []}, {"body": "The government is pushing out near-zero interest loans. They will most likely refinance their debt with government loans since they will pay a lot less interest on it.\n\nDAL has very strong financials, not as strong as other airlines like LUV, but strong enough to power through at least the end of this year, assuming they will be at a loss for the entire time...", "score": 0, "replies": [{"body": "Puhahahaha, companies do not refinance like you would refinance a mortgage. Gosh these young fellas are clueless.", "score": 0, "replies": [{"body": "What.", "score": 2, "replies": []}, {"body": "[https://www.investopedia.com/terms/c/corporate-refinancing.asp](https://www.investopedia.com/terms/c/corporate-refinancing.asp)\n\nPlease don't make a laugh of yourself...", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Just imagine for a second if you are some guy holding stocks and didn't sell before the March covid drop, would you sell right after the March drop? If yes, then you are losing lots and lots of money. The smart thing to do was to average down the stocks/companies you believe in and wait for their recover.", "score": 2, "replies": []}, {"body": "The best advice  \"**Be fearful when others are greedy and greedy when others are fearful.**\"\n\nYesterday was a great day for buying cheap stocks - PFE,  BRK.B, WDI (Wirecard AG)", "score": 2, "replies": []}, {"body": "Sell and learn the hard way. The faster you fuck up the faster you learn. Oh and buy up all the airlines, hotels, and casinos with the losses you have left after selling.", "score": 4, "replies": [{"body": "I'm brand new... only been trading since Monday. I'm scared to death about the airlines bc i put all of my chips on United, American and Spirit and I'm down 20% of my investment", "score": 0, "replies": [{"body": "Damn man. Yeah I feel like I woulda just chose 1 airline with the best balance sheet and took risk on that. Are you up on any of them? If so, maybe sell and roll into tech. Don’t sell because of 1 bad day but try to form a plan once it rebounds you break even points. And I was being facetious about airlines/hotels  for anyone who thought I was serious and isn’t in it - that’s not advised.", "score": 1, "replies": [{"body": "Yeah I'm learning a lesson. I hope it rebounds fast but if not I'll wait for it.... just bounce back at some point. Not trying to take a loss", "score": 1, "replies": [{"body": "No need to take a loss unless you think one will go bankrupt. At some point airlines will be flying like normal again, they just might stay down longer then other industries", "score": 2, "replies": [{"body": "Exactly! The mistake here is locking up a lot of money that you could use to invest in better companies, but you're not going to lose in the long run. This is ok for unexperienced traders, it's how you learn.", "score": 3, "replies": []}]}]}]}]}]}, {"body": "Before i invest whatever amount, I always imagine all these money on a table and: If I could take up a lighter and light it up, and if that wont affect me or my economy at all = Invest and hold regardless of red.\n\nGains can be greed, thats when i imagine gains as a money i never should have. So wont matter if it goes down 2K.", "score": 3, "replies": []}, {"body": "I'm pulling my hair out bc on my third day ever in the market I put all of my chips on American, United and Spirit. What do u think about the current airline stocks right now?", "score": 4, "replies": [{"body": "Trust me dude, everything else is just as fucked right now haha. It’ll swing back around, don’t worry about it and definitely do not sell those off just because they’re red. If you don’t need the money, let it ride across the valley until we hit the upside (may take a while though)", "score": 4, "replies": [{"body": "What's awhile?  Do you estimate it to be 6 months or longer? The market dipped today to about $4 less than my purchase price. I'm going that it spikes one day to a couple dollars above my purchase sell them all off", "score": 0, "replies": [{"body": "With how things are looking and how badly the media is hyping the Second Wave before it’s even really begun, if you need the money in a few months or want to move it into a different ticker, I’d probably sell when you go green. \n\nTravel is probably going to be shit-priced for a while due to this and the protests spreading COVID all over the place. Casinos I honestly couldn’t tell you though, they’re being weird", "score": 3, "replies": [{"body": "Hopefully we have 1 strong day soon that it moves up $5 or so and I'm gone. Not sure if that is even possible but I already put the alert in so it'll automatically happen", "score": 1, "replies": [{"body": "I’m expecting next Monday to be great if tomorrow is gross again. You weren’t around for it, but during the crash the Fed/JPOW got *really* good at offsetting bad news with good news. \n\nIf the market was meh on Friday, and there was a bunch of bad COVID news, they’d release some new financial bullshit that would turn the market green. They’d force states to push back unemployment number releases to coincide (like, hours apart at times) with something good.\n\nWe’ll come back from this", "score": 2, "replies": [{"body": "🤞🏽🤞🏽🤞🏽", "score": 2, "replies": []}]}]}, {"body": "I'm seeing a lot on airlines/travel. Would you group cruises like NCLH and Royal Caribbean into that same group with airlines? Bought back in April when everything was low. Pretty much doubled my money but now getting worried. Not sure whether to hold or sell at this point.", "score": 1, "replies": [{"body": "Good problem to have", "score": 1, "replies": [{"body": "So i guess the real question is, do I sell now, take my gains but pay the taxes on it, then reinvest? Or hold, as many people are saying and buy even more now that the market is going down. Obviously hold for 1 year plus to only pay capital gains.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Delta and all airlines can turn into penny stocks just like banks, insurance, and auto companies did during the GFC.\n\nStop advising noobs to baghold airlines. Buffet sold them for a reason. \n\nSell your shit stocks and buy QQQ and SPY-that's safe. Anything else you want to speculate on, do it with money you can afford to lose.", "score": 2, "replies": [{"body": "Most airlines like DAL, JBLU, LUV and Spirit aren't going anywhere. They can sit on a loss for months and not worry. Buffet messed up this time, twice. Don't treat him like a God because everyone makes mistakes.", "score": 1, "replies": [{"body": "Ah yes, we should listen to Mr. Reddit investor instead. Of course those airlines aren’t going to disappear, but they can go bankrupt or take years to recapture their 2019 revenue levels. That’s a piss poor investment if you ask me", "score": 1, "replies": [{"body": "If you barely started trading, I don't think you're knowledgeable enough to cut losses and reinvest. In most cases you will end up losing more when cutting the loss than you are gaining through reinvesting...\n\n&#x200B;\n\nWarren Buffet bought high and sold at the lowest twice, so yeah... he messed up. It happens...\n\n&#x200B;\n\nAside, he had good reasoning for trying to cut losses. When you deal with billions of dollars of investment, every day waiting for a stock to rebound is translated to millions of dollars in lost opportunities. As a beginner that's not applicable to you, and unless the company will never recover, or you really need the money now, it's better to just hold.", "score": 1, "replies": [{"body": "I'm happy Buffett cut airlines. I never liked that he was buying them in the first place because I don't think airlines are a good investment even before this pandemic. \n\n\nI don't know how much OP is investing, but sometimes cutting losses is a smart move, especially in this case where he's investing in an industry that may take *years* to recover and underperform as a result. I learned that when I first started investing 15 years ago. I view airlines as a purely speculative play and nothing more at the moment.", "score": 1, "replies": [{"body": "Yes, IMHO airlines were a bit overpriced before the pandemic.\n\nDon't get me wrong, selling is not bad overall, but when you just started trading 1-2 months ago, and you've only been in the green zone, you don't really know how to invest. You're unexperienced, and therefore it might be better to keep the money on the long run, even though it will take 1-2 years to profit from them, unless you need them right now.\n\nOfc, if you have all your money into airlines for some reason and you can't invest anymore, you should free up some of it to move around, but that's not the point here. The point is that I saw a bunch of panic sales for stable companies like MSFT/TSM/SYF/WFC/C that will be bank on track in no time. \n\nThere are a lot of people that just started trading and invested a serious bunch of their savings into a couple of high profile stocks, who got scared and sold at a loss for no reason...", "score": 1, "replies": []}]}]}]}, {"body": "Buffet is a long term in vestor, that is how you pay the least amount of taxes from your gains.\nAnd true long term in the next 5-10 years airline stocks will not see their all time highs at all, not with excessive debt load they already had and that keeps on getting more. Debt increases, profits and earnings per share decrease. Unless you are a tech out high growth company, earnings matter.", "score": 1, "replies": []}, {"body": "Companies can go bankrupt and still survive. In a bankruptcy, common stockhilders get wiped out, debt is restructured and company survives. \n\nAnother alternative is that share holders get extremely diluted like they did with etfc stock in 2009 as one example.\n\nYou need a history lesson on stocks. You don't know what the fuck you're talking about. You had some dumb luck with airlines and suddenly you're an expert.", "score": 0, "replies": [{"body": "Trust me, I know quite a lot about how they operate.\n\nMaybe I should have stated that your share/money is not going anywhere, that way you would have had no need of wasting time by explaining how a bankruptcy works... \n\nThose airlines are not in that position right now, especially LUV and Delta. They have no reason to do any of that because they aren't struggling as much as you think. Especially since the feds gave out near-zero interest loans to all of them. (Although this was mostly done to prevent the bankruptcy of companies like AAL)", "score": 1, "replies": [{"body": "Yeah, Buffet looked at the outlook and balance sheet and said this is not worth holding any longer. Too bad he didn't consult you first since you're clearly the expert. \n\nThe airlines are a pump and dump. They will rise on euphoria and crash when reality kicks in.", "score": 1, "replies": [{"body": "Funny how almost everyone agrees that he made a mistake right now, yet there are people like you who think he's an all-knowing God who never messes up. :)\n\nHe sold almost at all-time low. Do you really think airlines are valued at -80% their pre-covid price right now? Sure, they won't recover soon, and it doesn't look that good. It might be years for them to get back to the levels before the pandemic, but they are not worth ~80% less.\n\nThink rationally for a second. Emotions and fanaticism towards a certain investor is not ok...", "score": 1, "replies": [{"body": "They will drop substantially and stay at depressed levels for years. You can't run profitably on half capacity. Even with a vaccine on the horizon, damage will be done by then. It's all speculation.\n\nIf airlines are up with destroyed balance sheets and a ton of debt, other sound investments will still perform better on a relative basis. You can't rewrite the rules of valuations for just one sector.", "score": 1, "replies": [{"body": "They are getting unlimited funds from the government... Not only through loan, but through subventions and debt repayment as well. There is no way in hell they will go below the pandemic price. Air travel is already starting to ramp up, and in July it's estimated that the average occupancy level will be around 40-50%.\n\nCan we at least agree that Warren Buffet is an amazing investor, but he messed up selling at the bottom? If he had that permanent godly insight he would have held and sold on the rebound. \n\nI personally made buckets of money by buying AAL at 10$, HOLDING even when Buffet dumped, then selling at 21$ and buying lots of puts for 15/16$ by next week. Same for DAL. It was extremely predictable...\n\nWhy did the almighty Buffet sell at 9$ AAL just before the rebound if he is never wrong?", "score": 1, "replies": [{"body": ">Why did the almighty Buffet sell at 9$ AAL just before the rebound if he is never wrong\n\nBecause he had to move billions worth. \n\nYou're following the greater fool theory which can blow up over the long term. Call speculation for what it is... We all like to gamble once in a while but don't make believe you're doing anything intelligent. \n\nA loan still devalues the company and the free money leaves the door as soon as it comes in through payroll for non-productive employees. Have you seen the daily cash burn on airlines? \n\nDemand forecast for travel is dented. Debt has accumulated substantially. These companies are not worth what they were pre-covid.\n\nWe're living in a time where bankrupt stocks are seeing 500% surges in price and penny stocks are up 80% in the last month. Foolish to think that greater fool theory is not also applying to travel/leisure/physical retail.", "score": 1, "replies": [{"body": "Ofc they are not worth their pre-covid value, and won't be worth it for years. Let's take AAL, which is by far the worst. I sold AAL ASAP when it got to 20+. It won't be back there any time soon in my opinion, but it's not worth 8-9$ either. The real value always was around 12-14$ at minimum based on their balance sheet and the current context IMHO. \n\nI get what you're saying. There were A LOT of people saying \"Yeah!!! 25$ next week for AAL\", and I even saw someone saying \"30$ by end of month\" :| These guys must have been high on something when the wrote that... AAL won't be back to 27$ in at least a couple of years IMO, and that if there is not second-wave of COVID, and they do everything perfect.\n\nFor AAL Buffet started selling at 10$ and most likely ended it at 9$, if you check out the volume chart. That turned out to be a very bad move. He dumped everything at the all-time low.\n\nThese companies will get a lot of debt, sure, but they won't go bankrupt any time soon. That's because the interest on that debt is extremely small. They can pay the interest easily later on. \n\nHad AAL never got any loans from the government, they would have went under by now, but that didn't happen, and Buffet saw the balance sheet and the government aid (subventions, debt payouts & refinancing, near-zero interest loans), and still decided to pull out.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "I guess no one ever heard of a balance sheet.", "score": 1, "replies": []}, {"body": "Fuck I'm holding options never good I sold out of most of my short term ones for a loss.", "score": 1, "replies": []}, {"body": "Do we wait for few more days before adding any positions?", "score": 1, "replies": [{"body": "I follow the principle of \"averaging\" my investment.\n\n&#x200B;\n\nInstead of worrying and trying to catch the bottom of the curve (which is pretty hard to impossible to actually predict in most cases), I tend to invest in chucks along the way.\n\n&#x200B;\n\nFor example: I got some more shares of MSFT recently at 184, then 186, then 188, instead of going all in on a certain price point. I did the same for TSMC. Got some at 55, then 56/57, now I got some more at 55, the average cost being around 55.60. So I'm green overall due to averaging, even though I made some \"bad\" calls on the 57 high. \n\nSpreding out might not give you the same returns as a lucky bottom hit, but it's less risky and less prone to volatility.", "score": 1, "replies": []}]}, {"body": "Shhh I need some panic selling to reign in some way OTM puts.", "score": 1, "replies": []}, {"body": "The market was up on hopes of a quick recovery and MANY new investors getting into the market. We are going to see more downturn this month because the everything is opening hype train is done.", "score": 1, "replies": []}, {"body": "Yeah but my call tomorrow will never come back 😂", "score": 1, "replies": []}, {"body": "What you going to say to these people if they see a 50% retracement and no recovery for 10 years? A lot of these investors think long term investing is 12 months and are expecting 100% profit.", "score": 1, "replies": [{"body": "Ofc, if you invest in IVR for example, which sold 80% of their assets. Most of the companies I saw people dump are extremely well off. MSFT for example, and TSMC which is basically monopolizing the microprocessor market.\n\nAs long as you have invested in solid companies and didn't gamble on cheap options like HTZ, there is no problem.", "score": 1, "replies": []}]}, {"body": "Actually, I normally would agree with this post. But I suggest selling at least half of your stocks (also depends on multiple reasons). I have had many traveling stocks like AAL and CCL, but I decided to sell it all. I bought AAL when it was only $7. I will again \nrebuy if it hits that market again. I made a pretty decent earning from it and settled for it. This is because strictly traveling will not be continued for the rest of 2020 and has been official, but not publicly announced yet. This includes all cruises and limited flights. \nI really wish I could agree with this post and say to hold on to your stocks. But know when you are also getting greedy. This is not the time. It will be a rocky way back up and wouldn’t suggest any travel stocks just yet. Hoping by a few months we can again rebuy these lost stocks. Maybe (options) calls and puts would be a better fit for this situation instead. 100% all travel stocks will go down (hint hint).", "score": 1, "replies": []}, {"body": "I like this. new investor here with stocks. I sold AAL only 10 shares and broke even. I mainly got rid of them because i rather buy into well balanced companies and companies I actually like. I’m not even a fan of AAL 🤨🤨 happy investing", "score": 1, "replies": []}, {"body": "Thanks for the information.", "score": 1, "replies": []}, {"body": "This is terrible advice, don't pretend you know what your talking about. Valuations are 20 year high, imagine writing this in 2000 before the tech bubble bursts. What many people are noticing is the divergence between stocks and the real world economy, this is concerning and we don't know how this ends.  Telling people to hold because we will eventually reach these levels in 10 years is not sound advice.\n\n&#x200B;\n\nAdditionally starting your post with \"beginners\"  followed by bad advice is condescending", "score": 0, "replies": [{"body": "I explained in detail in some other comments that this only applies to unexperienced traders who sell strong stocks (like the example in the OP). It's one thing to sell LATAM and another to sell MSFT because they dropped a few points. As a beginner you would want to invest mostly in safe large market cap and stable companies anyways. \n\n&#x200B;\n\nLastly, I think you're the condescending one if you assume beginner is an insult. We were all beginners at some point and it's not like you are bad for starting something. Actually, it's quite awesome that a lot more people are starting to invest.", "score": 1, "replies": []}]}, {"body": "Sell sell sell", "score": -2, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "h0rnbk", "created_utc": 1591848112.0, "score": 65, "upvote_ratio": 0.94, "num_comments": 94, "comments": [{"body": "1st wave was free", "score": 55, "replies": [{"body": "xD", "score": 2, "replies": []}, {"body": "2nd wave has interest", "score": 1, "replies": []}]}, {"body": "I’m a doctor in Phoenix \n\nThey’ve enacted our emergency plans to increase capacity.  Our ICU is essentially full and that’s after they expanded it.  They’ve tripled the number of space for covid inpatients (not icu) in the last 2 weeks and that’s nearly full.  \n\nNOBODY here wears a mask.  Nobody.\n\nThe clubs, bars, restaurants, and pools have been packed.  Nobody here cares.   It’s gonna be a problem", "score": 90, "replies": [{"body": "me waiting for this ^^^^ doctor to hurry up and give me a prescription, get impatient and see why hes taking over an hour to get back to me about my small penis. See he's got wsb open on his computer and hes staring at his robinhood app on his phone.", "score": 29, "replies": [{"body": "Another 30 min for estrogen pills isn’t going to mess up your transition", "score": 40, "replies": [{"body": "🌈🐻 needs those pills", "score": 6, "replies": []}]}]}, {"body": "Scottsdale checking in. Girlfriend is a traveling nurse and there’s been 0 contracts. Day after Ducey lifted the ban and every A hole was at Maya without a mask I said give it a month they’ll pop up. Well, they’re popping up.", "score": 13, "replies": [{"body": "Yeah I live in old town with my girl.  We walked through saddle bag the first weekend the quarantine was lifted to see what the clubs were doing.  \n\nThere was zero rules and it was like corona never happened.  They were all packed shoulder to shoulder all day and night. Huge lines.  Crazy", "score": 6, "replies": [{"body": "Same. We tried a couple bars out. Haven’t been back since. There was places like goodwood that had slapdick setups but was virtually a free for all and then were was boondocks that actually ran a pretty tight ship.\n\nDoesn’t surprise me. It’s a lot of 21-24 year olds who just don’t give a shit and 40+ purebreds who wouldn’t pass a basic mathematics class but somehow know medicine. Insane", "score": 6, "replies": []}]}]}, {"body": "I’m in Phoenix too and can confirm, nobody gives a flying fuck here. It’s scary.", "score": 9, "replies": [{"body": "Probably because new Covid hospitalizations and deaths in AZ is actually way down.\n\nhttps://azdhs.gov/preparedness/epidemiology-disease-control/infectious-disease-epidemiology/covid-19/dashboards/index.php", "score": -6, "replies": []}]}, {"body": "I think you’re probably just a guy who bought some puts and is trying to convince everyone else. #fakenews", "score": 19, "replies": [{"body": "Had to prove it to get the flair", "score": 5, "replies": []}, {"body": "It literally is fake news.\n\nhttps://azdhs.gov/preparedness/epidemiology-disease-control/infectious-disease-epidemiology/covid-19/dashboards/index.php\n\nNew daily Covid hospitalizations in AZ is way down and ICU capacity is around 80%.", "score": -8, "replies": []}]}, {"body": "I'm on the Colorado River, we've become the getaway for everyone from California since they're still on stay-at-home orders. Went up to Laughlin and it was a complete joke trying to enforce any precautions. I've never seen the casinos so packed and maybe 5% of people were wearing masks. Nevada's going to get hit soon as well.", "score": 2, "replies": []}, {"body": "But what about the documentaries going around on YouTube with doctors and nurses saying it's fake!", "score": 2, "replies": []}, {"body": "One of my neighbors is a doctor, he told me a few days ago several hospitals are already past capacity, and they're preparing to start triaging incoming people over 80, and maybe 70. Does that match what you're seeing?", "score": 5, "replies": [{"body": "Yeah", "score": 3, "replies": []}, {"body": "https://azdhs.gov/preparedness/epidemiology-disease-control/infectious-disease-epidemiology/covid-19/dashboards/index.php\n\nNew daily Covid hospitalizations in AZ is way down, and ICU bed capacity is 80%.\n\nDon’t listen to this guy.", "score": -5, "replies": [{"body": "Normally I'd agree with your source, but Dacey has put strong limits in place on collecting and disseminating data on Covid. It makes it hard to trust any AZ controlled data source.\n\nLike I said above, one of my neighbors is a doctor who has said pretty much the same thing.", "score": 3, "replies": [{"body": "Hahaha.....\n\nYeh I’m going to trust the primary source of credible information over anecdotal information any day.", "score": 1, "replies": []}]}, {"body": "You Know you r spreading lies from a shitty website ?", "score": 0, "replies": [{"body": "A government department of health website which is the ultimate source of data for covid stats that is disseminated out....\n\nOr a guy on the internet saying he’s a doctor.....\n\nHmmm.... which is more credible...:?", "score": 2, "replies": []}]}]}]}, {"body": "[Bloomberg article confirms](https://www.bloomberg.com/news/articles/2020-06-10/second-u-s-virus-wave-emerges-after-state-reopenings)", "score": 1, "replies": [{"body": "Arizona department of health website actually confirms this as fake news.\n\nHuge decrease in new daily hospitalizations and new covid deaths in AZ.... ICU capacity only 80%.", "score": -1, "replies": [{"body": "I don't get it. Speak average ICU capacity at 80% mean there are lots of full ICUs?", "score": -1, "replies": [{"body": "It means there’s still 20% of capacity left. If you actually open the website I linked, you can see that the capacity has be holding fairly steady for the last two months.", "score": 1, "replies": [{"body": "What’s normal capacity for ICUs in AZ? Hard to gather meaning without some kind of comparison.\n\nIf normal icu capacity is 60% utilization that’s good, current covid would account for the extra 20% and the remaining 20% is a good buffer since theoretically covid  ICU patients could essentially double without overwhelming capacity.\n\nIf normal is 50% then that’s kinda muddier, would indicate that a doubling of covid ICU patients would push us 10% over capacity.", "score": 1, "replies": [{"body": "Did you open the website I linked? It gives the ICU stats all the way back to March.", "score": 1, "replies": [{"body": "I can’t read", "score": 1, "replies": [{"body": "Lol.\n\nhttps://azdhs.gov/preparedness/epidemiology-disease-control/infectious-disease-epidemiology/covid-19/dashboards/index.php\n\nLook at total new daily hospitalizations, new daily deaths, and icu capacity.", "score": 1, "replies": [{"body": "Didn’t see anything about icu capacity but I’m walking and on mobile. Which portal", "score": 1, "replies": [{"body": "I’m on mobile too and I can see it.\n\nClick on “hospital bed useage ....”\n\nThen scroll down.", "score": 1, "replies": [{"body": "Thanks- something must be going on with the website it’s not pulling data just a loading screen both on mobile and my work desktop.", "score": 1, "replies": [{"body": "Yeh I just tried looking at it again just now and there is a banner at the top of the page saying the website is down due to high traffic.\n\nIt’s either high traffic or they are updating the data that I saw to adjust it to something else.\n\nWe will see in a few hours.", "score": 1, "replies": []}, {"body": "Here’s a screenshot of the daily hospitalizations before the website went down.\n\nhttps://imgur.com/a/rjwTjYs", "score": 1, "replies": []}]}]}]}, {"body": "Sorry but where's the per hospital histogram. I see ventilator usage double from 20% to 40%. But the county map showed all the trouble was in one county. So again looks like averages when all the danger is on the upper extreme.\n\nEdit: the numbers there are just not the right numbers to look at. All modern websites don't measure themselves on average latency. They measure themselves in 99.5% percentile latency to focus on where the issue is. We have absolute numbers instead of rates per county.", "score": 1, "replies": [{"body": "Since you are having a hard time navigating an extremely simple website... I took a snapshot for you.\n\nHere’s a screenshot of the new daily Covid hospitalizations.\n\nhttps://imgur.com/a/rjwTjYs", "score": 1, "replies": [{"body": "Yeah that's still not a histogram. So here are my questions:\n\nHow many hospitals have more than 95% ICU bed occupancy \nHow many with 90-95%?\nSame for ventilators?", "score": 1, "replies": [{"body": "Total hospital ICU capacity is 78% full at last update. Surge capacity is also there. I recommend you watch the governors new briefing held yesterday.", "score": 1, "replies": [{"body": "So unless there is one hospital in all of Arizona the total does not provide any insight to my question. \n\nFor example assuming all hospitals have the same number of beds and there are 100 hospitals total. Then we can have 78 hospitals out of beds and 22 completely empty. We'd have a catastrophe on our hands in this scenario but it would have the same total hospital ICU capacity.", "score": 1, "replies": [{"body": "Like I said, I’d recommend watching yesterday’s briefing on this by the governor. If you actually want information rather than debating someone who is pointing you to state data.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Well one of my friends drowned while crossing a river with an average depth of 6 inches so 80% occupancy to me means 30% of hospitals are overflowing and 70% are in areas that haven't been hit yet", "score": 1, "replies": []}]}]}]}]}, {"body": "Wrong.\n\nOur hospitals ICU bed capacity is at around 80%.\n\nOur new daily Covid hospitalizations are way down right now per Arizona department of healths own data as is our daily Covid deaths.\n\nhttps://azdhs.gov/preparedness/epidemiology-disease-control/infectious-disease-epidemiology/covid-19/dashboards/index.php\n\nStop spreading misinformation.", "score": 2, "replies": [{"body": "Jesus whats with you people? It’s not only all over all the major media outlets, it’s also very googleable.\n\n\nhttps://www.google.com/search?q=covid+cases+in+arizona&ie=UTF-8&oe=UTF-8&hl=en-us&client=safari\n\nAnd in terms of full, I was speaking about my hospital.   Either way, most people would consider 80% nearly full.", "score": 2, "replies": [{"body": "I don’t have to google anything retard, I literally just gave you the state of Arizona department of Health website, which is the primary source of data for this.\n\nNew daily Covid hospitalizations WAY DOWN..... new daily Covid deaths WAY DOWN.... ICU capacity 80%.\n\nStop spreading misinformation.", "score": 2, "replies": []}]}]}, {"body": "Are you seeing a clear increasing trend in terms of number of Covid cases your side is seeing daily over the last 2 weeks?", "score": 1, "replies": [{"body": "Yes.  \n\nDaily new cases in Arizona are up like 500% in last 2 weeks", "score": 1, "replies": [{"body": "Try dividing that by 5 and you will be closer. With math skills like that, i wouldn’t be surprised if you have killed more patients than covid has.\n\nhttps://azdhs.gov/preparedness/epidemiology-disease-control/infectious-disease-epidemiology/covid-19/dashboards/index.php", "score": 2, "replies": [{"body": "According to your source, on May 25 we had 300 new cases,  yesterday we had over 1500 new cases. \n\n1500/300 =?\n\nDon’t be an ass on the internet for no reason.  Our cases are way up\n\nCan also find that info here \n\nhttps://www.google.com/search?q=covid+cases+in+arizona&ie=UTF-8&oe=UTF-8&hl=en-us&client=safari", "score": 0, "replies": [{"body": "Nice cherry picking.... take the rolling average of three weeks ago and the rolling average of the last seven days and you have a 100% increase.\n\nNot 500%.\n\nJune 8th only had a bit over 200 new cases.\n\nFurthermore new cases doesn’t indicate more or less total cases in the state.... it is a factor of testing policy, efficiency and targeting.\n\nYou look at total new hospitalizations and new deaths to actually know the disease burden.... and guess what? Both are way down.", "score": 2, "replies": [{"body": "I don’t care to argue this with you.  Arizona cases are way up.  And so are hospitalizations", "score": 0, "replies": [{"body": "New daily Covid Hospitalizations are way down. New daily Covid deaths are way down.\n\nhttps://azdhs.gov/preparedness/epidemiology-disease-control/infectious-disease-epidemiology/covid-19/dashboards/index.php\n\nStop spreading misinformation.", "score": 2, "replies": [{"body": "I’m not sure where you are seeing that info.  \n\nDeaths lag.\n\nHere’s a more succinct article about it.  But also as a physician in this hospital system which is huge, I get daily emails about it.\n\n\nhttps://www.google.com/amp/s/www.azfamily.com/news/continuing_coverage/coronavirus_coverage/banner-health-says-the-number-of-covid-patients-on-ventilators-has-quadrupled/article_fe3a5e4c-a9f4-11ea-839b-b316a6e451dc.amp.html\n\nThis article from 2 days ago\n\nRemember that although we are at 80% icu capacity from 60% on April 1, the hospitals have all increased their icu capacity and elective surgeries are still way down which often use icu.", "score": 2, "replies": [{"body": "Look at the “hospitalizations” tab and “deaths” tab, it’s a pretty simple site to navigate.\n\nhttps://azdhs.gov/preparedness/epidemiology-disease-control/infectious-disease-epidemiology/covid-19/dashboards/index.php\n\nThe ICU bed burden is not increasing from new covid hospitalizations (as proven by the data), it’s increasing from the secondary health issues caused by the shutdown and the latent demand for electives, now hitting the system.\n\nConfirmed test increasing or decreasing is essentially irrelevant to the true number of cases at this point as we know it vastly undercounts for the number of true cases. The variation fluctuates now mostly due to testing capacity, and the population sets targeted by testing.\n\nThe two metrics that are harder to game are the new daily hospitalizations and new daily deaths.... which are way down. New daily Covid hospitalizations are a quarter of what they were a few weeks ago.\n\nHospitalizations lag incubation time by about 5 days.... we are well within that period now where the spike in new reported cases should have translated to higher hospitalizations.... meaning that the spike in new cases has more to do with testing methods than being actually representative of the total number of cases in the state. This is basic stuff.", "score": 3, "replies": [{"body": "Web page won’t load for me on mobile.  I’ll trust you’re representing the numbers correctly as you seem to have a decently educated take on it.\n\nI can assure you there is a huge increase in covid inpatients as well as icu patients.  It must be a lag in reporting if numbers aren’t showing it.   It’s all the doctors are talking about  they’ve tripled the dedicated covid units in my hospital in last 2-3 weeks.\n\nIt’s all over the news.  Testing has been widely available for symptomatic people here for a month, so we haven’t changed our testing much as far as I know. \n\nI’m not intentionally misleading or misrepresenting the issue.  I chose a random day 2 weeks ago and then yesterday to get the 5x increase. \n\nI assure you it’s problematic here.  Good news is we are prepared as modeling showed a surge was coming, initially thought to be June 4 I believe.  \n\nNobody wears masks here and bars and shit are packed.  Also we have a large Mexican population who often have much more people living in the same house.  \n\nIt’s also been over 100 degrees here for 2-3 weeks and that did not show a decrease in cases.  Which is worrisome for this fall.\n\nI’ll leave it at that.  Agree to disagree.", "score": 2, "replies": [{"body": "I will give you the benefit of a doubt that you are seeing something that the actual data presented on the state’s department of health hasn’t picked up yet. It’s possible.\n\nCurrently the site is down due to increased traffic. Maybe they are updating bad data, if that’s the case than we may get on the same page.\n\nHowever, if daily new hospitalizations don’t show an increase a week from now presented on the state’s health departments dashboard, I’m going to go ahead and attribute this to another case of media driven drama of misleading and twisted news and misrepresented anecdotal evidence.\n\nAs it stands now, the data that we can see doesn’t justify the claims and fears, if it is accurate. And if I have to make an assumption, it’s safer to assume it is accurate.\n\nAgain, it’s pointless to look at new cases, this is gamed by testing methods, who is targeted for testing, and how much testing is being done. Look at new hospitalizations. If less people are coming to the hospitals, that’s a better indication of the overall number of infected, rather than tests being run.", "score": 1, "replies": []}, {"body": "Here’s a screenshot of the daily hospitalizations before the website went down.\n\nhttps://imgur.com/a/rjwTjYs", "score": 1, "replies": [{"body": "Should check again in a few days and see if that gets adjusted up.  It’s showing the opposite of what we are experiencing", "score": 2, "replies": [{"body": "Yup, will be following it.", "score": 1, "replies": [{"body": "I’m standing in the ER at my hospital in Phoenix talking to the ER docs 3 min ago.\n\nThey are having a massive increase in covid patients in last week.  Went from 4-5 a day.  To 50 today already at 2pm.  IM doctors saying admits are significantly up, like I said they were\n\nReporting is delayed apparently by a few days.\n\nThe Arizona website was down yesterday.  Haven’t checked today.\n\nThought you’d like to know", "score": 2, "replies": [{"body": "Thanks for the update.\n\nIt does appear that the AZDHS data panels are presenting lagging data which are retroactively updated. Pretty shitty data presentation without any disclaimers.", "score": 1, "replies": []}]}]}]}]}, {"body": "I’ll take the man with the doctrines as well as comparing daily cases posted for all to see.  AZ is in bad shape, people are to chillaxed, and Darwin will take care of the rest.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "I went to the emergency room (arrowhead hospital) 2 weeks ago for soar throat and chest pain. I was literally the only patient in there at 6am. My job had 4 positives in 2 weeks before I went. Nobody has been hospitalized though. I keep tetertottering between whether to be concerned. I totally expected multiple ppl at my job to die back in March but nobody has even been hospitalized. Fat old person was back in 2 weeks.", "score": 1, "replies": [{"body": "It’s a cold....", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": -4, "replies": [{"body": "Sigh...   come on man\n\nBecause they don’t kill themselves.  They spread it to their grandma and kill them and many other people.  \n\nI don’t care if people wear their seatbelts or not, but I do care about people driving drunk.", "score": 6, "replies": []}]}]}, {"body": "calls at open confirmed", "score": 9, "replies": []}, {"body": "Can confirm:  From Glendale, AZ and the chick I fuck occasionally when her kids are with her husband has the rona.", "score": 17, "replies": [{"body": "Username checks out. did you hear about that $400 million jackpot sold in glendale? Life changing numbers", "score": 7, "replies": [{"body": "All the tendies.....", "score": 1, "replies": []}]}]}, {"body": "You definitely belong here if you're buying AAPL calls at $350. That's some full ass retarded shit.", "score": 5, "replies": []}, {"body": "For the last time 2nd wave is priced in", "score": 21, "replies": [{"body": "🧐", "score": 7, "replies": [{"body": "😳", "score": 4, "replies": []}]}, {"body": "Go tell that to Jerome Powell who told us repeatedly that it is an unknowable maybe you can become. Fed chair and fix their data sets genius", "score": 7, "replies": [{"body": "I do too many drugs to be in charge of anything.", "score": 4, "replies": []}]}, {"body": "It’s not you retard... 2nd wave would drop all the forecast you retard...", "score": 4, "replies": []}]}, {"body": "Yeah didn’t you hear American Airlines keeps flying everyone around the damn country out of DFW while the other airlines and rest of the country chill the fuck out. All these boomers gonna be dead soon! Puts on airlines!", "score": 3, "replies": []}, {"body": "[hot weather on its own is unlikely to tame covid19](https://spacecityweather.com/revisiting-the-question-of-weather-and-covid-19-in-texas/)", "score": 3, "replies": []}, {"body": "I had no idea we had that many AZ retards in this sub. Yea no one wears masks here. Lots of old white people think that’s its nbd.", "score": 3, "replies": []}, {"body": "I live in Arizona, literally no one even wants to acknowledge the virus is real. It's a conservative hell-hole and even if 50% of our population died tomorrow, it'd somehow be \"Obama's fault\". Everyone would rather go out and say racist shit  to their Olive Garden server than stay at home.", "score": 7, "replies": []}, {"body": "Adds up, Tucson here. Haven’t been out to bars or shit since I’m at risk but I’d say when in normal stores like Walmart, maybe 1/5 of people wearing masks if that.", "score": 2, "replies": []}, {"body": "I'm mf ready", "score": 3, "replies": []}, {"body": "Couldn’t happen to any other well deserved state than Texas. That shithole", "score": -2, "replies": [{"body": "Hey Texas isnt soooo bad. I stayed there for several month. Food tastes better than other place, nice weather (not summer), nice people...", "score": 7, "replies": []}]}, {"body": "hopefully all the protestors get it", "score": -12, "replies": [{"body": "Make that just the rioters", "score": 8, "replies": []}]}, {"body": "Except Arizona’s Covid hospitalizations are way down....\n\nhttps://azdhs.gov/preparedness/epidemiology-disease-control/infectious-disease-epidemiology/covid-19/dashboards/index.php", "score": 0, "replies": []}, {"body": "So last month.", "score": -1, "replies": []}, {"body": "Msn and cnbc, the two most liberal media sources are reporting that two very republican states aren’t doing things right and are not well, what a shock. Don’t believe everything you read.", "score": -9, "replies": [{"body": "https://www.texastribune.org/2020/06/10/texas-reports-largest-single-day-increase-coronavirus-cases/\n\n\nhttps://www.fox4news.com/news/texas-has-surpassed-2000-hospitalized-coronavirus-patients-for-the-first-time\n\nhttps://www.fox10phoenix.com/news/arizona-hospitals-capacity-elective-surgery-may-stop", "score": 8, "replies": []}]}, {"body": "Keep your gay news to yourself. Corona can’t stop this market, we seem that for two month now. Long live the bull market.", "score": -2, "replies": []}, {"body": "3rd to 10000000th wave are price in.!", "score": -3, "replies": []}]}
{"title": "Bloody Red Monday Incoming", "selftext": "You faggots think that this dead cat bounce can fly forever? Even a plane needs to land to refuel, birds need to rest it's wings and Spaceships need to bring astronuts back to earth. Even JPow, knows that nothing goes up forever. He said so today.\n\n!RemindYourselves, SPY will correct back to $2762 to the penny by July.\n\nI am a gay bear from the future and I have come to give you tendies. I don't care of you go long or short, but $2762 is your key physiological level to keep an eye on. Don't listen to those dumb ass hedge fund managers calling for $3000 support. All those dumb ass do is buy overvalued stocks and pump them on CNBC (looking at TSLA). $2762 is your friend. I am your friend. Bears should collect profit at this level while bulls should go long here.\n\nElectricity is a rarity in the future, so I will log out for the time being. I will be back to give you the next play post July.", "id": "h0rydd", "created_utc": 1591849395.0, "score": 176, "upvote_ratio": 0.86, "num_comments": 98, "comments": [{"body": "He called me a faggot", "score": 203, "replies": [{"body": "He wasn't the first though, was he?", "score": 39, "replies": []}, {"body": "You’re a faggot", "score": 21, "replies": []}, {"body": "He's seen your future too.", "score": 3, "replies": []}, {"body": "Is he wrong? Faggot", "score": 5, "replies": []}, {"body": "F", "score": 1, "replies": [{"body": "A", "score": 3, "replies": [{"body": "G", "score": 3, "replies": [{"body": "G", "score": 3, "replies": []}]}, {"body": "N", "score": 1, "replies": []}]}]}, {"body": "You’re feelings must have hurt. Don’t worry, J Pow will print you some tendies", "score": 1, "replies": []}]}, {"body": "tsla $200, overvalued. \ntsla $400, overvalued. \ntsla $600, overvalued. \ntsla $1000, overvalued.\ntsla $2000, overvalued. U see where this is going?", "score": 91, "replies": [{"body": "$3000?", "score": 31, "replies": [{"body": "No, to Mars.", "score": 34, "replies": [{"body": "$4269", "score": 10, "replies": [{"body": "ayyy", "score": 1, "replies": []}, {"body": "Nice.", "score": 1, "replies": []}]}]}, {"body": "Undervalued", "score": 1, "replies": []}]}]}, {"body": "[deleted]", "score": 58, "replies": [{"body": "That makes a lot of sense. But nothing has made sense in this recovery so ima do the opposite", "score": 37, "replies": [{"body": "[deleted]", "score": 19, "replies": [{"body": "But I wanted more free money", "score": 12, "replies": []}, {"body": "But I only made $40....", "score": 3, "replies": []}]}]}, {"body": "You are thinking about it wrong. The market will go up all the way till the end of the election, and well after that as well.\n\nStonks only go up.", "score": 8, "replies": [{"body": "then we gonna get SPY400 by Oct LOLOL", "score": 2, "replies": []}]}, {"body": "If the markets are manipulated to make Trump look good, then it would make more sense to keep them going up and up you dingus.", "score": 0, "replies": []}]}, {"body": "Who the fuck does this Winnie the Pooh bear think he is?", "score": 45, "replies": [{"body": "Ooooh good one Christopher Robbin tendies", "score": 2, "replies": []}]}, {"body": "physiological is the exact wrong word for what youre trying to say", "score": 42, "replies": [{"body": "doesn’t know the difference between physiological and psychological but is smarter than hedge fund managers", "score": 43, "replies": [{"body": "Hedge fund managers are about half as smart as Trump.  Those are getting close to negative IQ numbers", "score": 9, "replies": [{"body": "Ironic.", "score": 2, "replies": []}]}]}, {"body": "Not in the future o_O", "score": 1, "replies": []}, {"body": "lmao he comes from the future where we have Robinhood 4D with corporeal supports and resistances", "score": 1, "replies": []}]}, {"body": "I am Gay Bull from the future and tomorrow unemployment numbers will skyrocket the market", "score": 94, "replies": [{"body": "Hi Gay Bull", "score": 30, "replies": []}, {"body": "if jpow saying he will do whatever he has to do to keep the economy up has us down 400 points in futures i cant see unemployment numbers helpin much but i do hope", "score": 18, "replies": []}]}, {"body": "New. Lows\nNew. Lows\nOoga booga ooga booga\nNew. Lows", "score": 13, "replies": []}, {"body": "Remind me 1 month", "score": 10, "replies": [{"body": "So, where's that SPY 270", "score": 2, "replies": []}, {"body": "**b1ackfyre**, kminder in **30 days** on [**2020-07-11 04:23:59Z**](https://www.reminddit.com/time?dt=2020-07-11 04:23:59Z&reminder_id=1a67cfcfd26e46d2b86c8b071def2f0b&subreddit=wallstreetbets)\n\n> [**r/wallstreetbets: Bloody_red_monday_incoming**](/r/wallstreetbets/comments/h0rydd/bloody_red_monday_incoming/ftnvqj6/?context=3)\n\n> kminder 1 month\n\n[**5 OTHERS CLICKED THIS LINK**](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder%20from%20Link&message=your_message%0Akminder%202020-07-11T04%3A23%3A59%0A%0A%0A%0A---Server%20settings%20below.%20Do%20not%20change---%0A%0Apermalink%21%20%2Fr%2Fwallstreetbets%2Fcomments%2Fh0rydd%2Fbloody_red_monday_incoming%2Fftnvqj6%2F) to also be reminded. Thread has 6 reminders.\n\n^(OP can )[^(**Set timezone, Update message, and more options here**)](https://www.reminddit.com/time?dt=2020-07-11 04:23:59Z&reminder_id=1a67cfcfd26e46d2b86c8b071def2f0b&subreddit=wallstreetbets)\n\n**Protip!** When you feel lazy to come up with reminder time, type `kminder your bullshit` to be reminded between 1 and 30 days from now. Cheers!\n\n\n\n*****\n\n[**Reminddit**](https://www.reminddit.com) · [Create Reminder](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder&message=your_message%0A%0Akminder%20time_or_time_from_now) · [Your Reminders](https://reddit.com/message/compose/?to=remindditbot&subject=List%20Of%20Reminders&message=listReminders%21)", "score": 1, "replies": []}]}, {"body": "Upvote because I'm gay", "score": 17, "replies": []}, {"body": "!RemindMe 1 month", "score": 7, "replies": [{"body": "I will be messaging you in 1 month on [**2020-07-11 04:27:30 UTC**](http://www.wolframalpha.com/input/?i=2020-07-11%2004:27:30%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/h0rydd/bloody_red_monday_incoming/ftnw192/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fh0rydd%2Fbloody_red_monday_incoming%2Fftnw192%2F%5D%0A%0ARemindMe%21%202020-07-11%2004%3A27%3A30%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20h0rydd)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 8, "replies": [{"body": "TA", "score": 9, "replies": [{"body": "Tits and Ass have no place here.  Y'all just hump dead possums.", "score": 9, "replies": []}]}, {"body": "Fibonacci retracement 50%", "score": 2, "replies": []}]}, {"body": "Why does everybody need to preface the word red with blood. Can you just stop", "score": 12, "replies": [{"body": "Welcome to WSB - the only place where where you can find reference to blood GREEN!", "score": 13, "replies": [{"body": "We prefer big green dildos thank you very much!!!", "score": 4, "replies": []}]}, {"body": "blood yea, Blood you're right.", "score": 1, "replies": []}, {"body": ">if jpow saying he will do whatever he has to do to keep the economy up has us down 400 points in futures i cant see unemployment numbers helpin much but i do hope\n\nban", "score": 1, "replies": []}]}, {"body": "300 is by far more strong psychologically than 276.20\n\nSmart money will take us slightly below 300 so that idiots panic sell and then we're going to moon.", "score": 6, "replies": []}, {"body": "Fuck a gay bear right in his gay ass", "score": 4, "replies": []}, {"body": "Yesterday bought June 19 320 puts so I would love to see a quick crash.", "score": 6, "replies": [{"body": "So how'd it work out? I had 100x 320p 6/12 that I sold yesterday after the JPow speech. Fuck my life", "score": 2, "replies": [{"body": "Oh man! Profit is profit, but I left too much on the table, and didn’t re-enter.", "score": 1, "replies": [{"body": "I didnt even profit, just broke even and cut em loose. I did buy more 300p 7/1 at open and im up 30% and still holding. Think we're in for more red days ahead", "score": 2, "replies": []}]}]}]}, {"body": "Red is up in China so this is bullish", "score": 5, "replies": []}, {"body": "I want what he’s smoking", "score": 4, "replies": [{"body": "I want his dead wife", "score": 0, "replies": [{"body": "can we fuck her corpse together?", "score": -6, "replies": [{"body": "Wtf is wrong with you?", "score": 7, "replies": [{"body": "so thats where WSBs red line is? necrophilia?", "score": 5, "replies": [{"body": "Necrophilia, what? No, I was referring to the heterosexuality - fucking disgusting!", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Ok, thanks mister from the future", "score": 3, "replies": []}, {"body": "Yea and April 6th was the last gay bear plunge just like you said! Ban this fagot", "score": 3, "replies": []}, {"body": "Brother. You forgot to price in the fed dawg. Those fuckers can make anything green", "score": 3, "replies": []}, {"body": "Buy the dip! Spy 420 confirmed. Printers secured", "score": 3, "replies": []}, {"body": "Thanks gaybear and don't stop being gay", "score": 3, "replies": []}, {"body": " RemindMe! 36 days \"Remind OP he's  🌈  \"", "score": 2, "replies": []}, {"body": "What are your gains since March big shot?", "score": 2, "replies": []}, {"body": "Everybody knows gay bears can't travel back through time, quantum mechanics forbids this!", "score": 2, "replies": []}, {"body": " This bull rally reminds me of XBT  in december 2017", "score": 2, "replies": []}, {"body": "Your support is base in bull shit! This bitch is going to 1800-2000 by the end of the year. Go actually read real shit stop watching Jim Cramer", "score": 2, "replies": []}, {"body": "QQQ has support at 220.  QQQ 7/17 220p holder here.", "score": 2, "replies": [{"body": "Same, hope these print", "score": 2, "replies": []}, {"body": "Not looking good this morning", "score": 1, "replies": [{"body": "Isnt the title Red Monday not Red Friday?  Relax.", "score": 2, "replies": [{"body": "Reddish :(", "score": 1, "replies": []}]}]}]}, {"body": "Time to short subprime crap like Credit Acceptance Corp. Their board have insider sold as much as they can after delaying their Q2 financial report. Citron and Muddy Waters have been calling the alarm on this for a while.\n\nhttps://fintel.io/n/us/cacc\n\nhttps://twitter.com/search?q=%24CACC&src=typed_query", "score": 2, "replies": [{"body": "This i like. Looking more into this. Would be a matter of time till ppl start defaulting on loans. Question is when?", "score": 1, "replies": [{"body": "The entire management sold out last Friday. I'd say this is going bankrupt pretty soon.", "score": 1, "replies": []}]}]}, {"body": "daddy would you like some sau sages", "score": 2, "replies": []}, {"body": "Remind me! 1 month", "score": 2, "replies": [{"body": "*Reddit has a 2 hour delay to fetch comments, or you can manually create a reminder on Reminddit.*\n\n**SinCityNinja**, kminder in **30 days** on [**2020-07-11 20:55:18Z**](https://www.reminddit.com/time?dt=2020-07-11 20:55:18Z&reminder_id=b65dff548e1341d6ae65698c42558921&subreddit=wallstreetbets)\n\n> [**r/wallstreetbets: Bloody_red_monday_incoming#2**](/r/wallstreetbets/comments/h0rydd/bloody_red_monday_incoming/ftqhrrt/?context=3)\n\n> kminder 1 month\n\n[**CLICK THIS LINK**](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder%20from%20Link&message=your_message%0Akminder%202020-07-11T20%3A55%3A18%0A%0A%0A%0A---Server%20settings%20below.%20Do%20not%20change---%0A%0Apermalink%21%20%2Fr%2Fwallstreetbets%2Fcomments%2Fh0rydd%2Fbloody_red_monday_incoming%2Fftqhrrt%2F) to also be reminded. Thread has 7 reminders.\n\n^(OP can )[^(**Add email notification, Update message, and more options here**)](https://www.reminddit.com/time?dt=2020-07-11 20:55:18Z&reminder_id=b65dff548e1341d6ae65698c42558921&subreddit=wallstreetbets)\n\n**Protip!** You can use the same reminderbot by email at bot[@]bot.reminddit.com. Send a reminder to email to get started!\n\n\n\n*****\n\n[**Reminddit**](https://www.reminddit.com) · [Create Reminder](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder&message=your_message%0A%0Akminder%20time_or_time_from_now) · [Your Reminders](https://reddit.com/message/compose/?to=remindditbot&subject=List%20Of%20Reminders&message=listReminders%21)", "score": 0, "replies": []}]}, {"body": "So about that, where's that SPY 270? I'm looking for it", "score": 2, "replies": []}, {"body": "!remindme 1 month", "score": 1, "replies": []}, {"body": "!RemindMe 36 days", "score": 1, "replies": []}, {"body": "I’m offended", "score": 1, "replies": []}, {"body": "Thank you **WALLSTREETBEARS**", "score": 1, "replies": []}, {"body": "You're three weeks too early my man", "score": 1, "replies": []}, {"body": "Why? Why do you give me hope?", "score": 1, "replies": []}, {"body": "12 hours ago, I read a post here that stocks will be more overvalued some more. Now, I got this post, what’s the way? Puts or calls? Need help", "score": 1, "replies": []}, {"body": "Everyone is talking about JPow and ignoring the real culprit here.\n\nMnuchin is a cheat and a scoundrel (Kmart, Sears) who has a $500 of billion secret slush find and a mandate from Trump to pump the stock market. There's zero chance he hasn't been backrooming deals with anyone he can find to tell them to buy everything they can and he'll protect them if it all falls apart.", "score": 1, "replies": []}, {"body": "birds does need to rest it is wings, good point.", "score": 1, "replies": []}, {"body": "OP is 🌈", "score": 1, "replies": []}, {"body": "Spy hitting low 3300s before retrace and there is support at 3080 next support after around 2875 i dont know what your talking about", "score": 1, "replies": []}, {"body": "Fucking gay", "score": 0, "replies": []}, {"body": "> birds need to rest it's wings and Spaceships need to bring astronuts back to earth \n\nThis is some terrible poetry/grammar/spelling. Not sure if this is an autist and I should listen to him or just gay. On one hand, he's missing an Oxford comma... so gay. Then the birds need to rest \"it is\" wings... so gay again. One the other hand, wrong spelling of astronauts may be a pun (but why? science is good). Also, the poetry is really bad, so maybe an autist.\n\nSorry, forgot where I was:  \nCall me a faggot one more time and I'll cum on your ass!", "score": 0, "replies": []}]}
{"title": "Normie Playbook: Analyzing a Failed Play", "selftext": "[deleted]", "id": "h0x71f", "created_utc": 1591873433.0, "score": 31, "upvote_ratio": 0.93, "num_comments": 90, "comments": [{"body": "I cannot express how sick to my stomach it makes me knowing i was right but was 1 week too early, and didn't have the capital to see the play through another week. Infuriating.", "score": 12, "replies": [{"body": "I hear you.  Early is still wrong, as they say, and unfortunately.", "score": 3, "replies": []}, {"body": "stupid bear, thanks for holding my bags, come again anytime", "score": -4, "replies": []}]}, {"body": "R/antstreetbets", "score": 6, "replies": [{"body": "I always laugh at any comment that contains ‘ant’ lmao", "score": 3, "replies": [{"body": "Ants in your pants ants in your pants!!! Dance dance dance you've got ants in your pants!", "score": 1, "replies": []}, {"body": "Yep, autistic af confirmed.", "score": 1, "replies": []}]}]}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}, {"body": "**EOD Positions**\n\n* 6/15 300p, two day trades, CLOSED and realized profit of $136\n* 7/1 310c, 6 contracts 5.08 average, OPEN currently an unrealized loss of $294", "score": 4, "replies": [{"body": "well everytime we have done these massive corrections, we have opened slightly down the next day to turn green some time in the afternoon, wonder if we will do the same tomorrow with it bottoming somewhere in between 295-300", "score": 2, "replies": [{"body": "I could see that. We never retested solidly the fib as support, we've been waiting to do that. I don't think there's enough momentum for us to crash through it, so it makes a likely stopping point.", "score": 1, "replies": [{"body": "i hope you and every TA on here gets crushed, so that you don't have the money to post stupid shit anymore", "score": -2, "replies": [{"body": "I mean this would realistically be someone having too little money to pay the internet bill / cell phone bill and so financially destitute that they would need to sell devices that post on Reddit to make ends meet....  Most homeless people I see have a cell phone. (I don't see many)", "score": 1, "replies": []}]}]}]}]}, {"body": "I'm into 10 6/19 295p at 5.65 average.  Now 15 at 5.61 average. Now at 20 with a 5.54 average.  Now 30 with a 5.36 average.  This is getting rich.", "score": 5, "replies": [{"body": "Still holding, down $3400", "score": 3, "replies": [{"body": "Betting big time on divergence and a retest.  Gulp.", "score": 3, "replies": [{"body": "Divergence not as negative.  Shit.", "score": 1, "replies": []}]}, {"body": "Conviction! 1m is dastardly overbought", "score": 1, "replies": []}]}, {"body": "I just cut 10 at 4.5, 20 at 4.35.  Realized big loss.  Will re-enter.", "score": 3, "replies": []}, {"body": "We broke lows, if bulls don't defend quick, panic is going to see us down to the 292 FIB.", "score": 2, "replies": []}, {"body": "Good luck! Do you plan to hold through the weekend?", "score": 1, "replies": []}, {"body": "Ended up back in mostly right where I exited, just didn't go for the ride.", "score": 1, "replies": [{"body": "holding over the weekend i presume?", "score": 1, "replies": [{"body": "No, sold out.  Mad as hell about today.  Going to sit out for a bit to stew.", "score": 3, "replies": []}]}, {"body": "Stopped out.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Less gain, less loss, less theta, longer timeframe to find an exit.  Many factors in picking a date.", "score": 2, "replies": []}]}]}, {"body": "SPY has some room to burn, how much price movement comes with that burn down to oversold is unclear.  I'm still looking at a test into 308, with 306 and 304 following as areas which flashed during the rise.  \n\nThe last few ticks of oscillator burn often come with sideways or even upwards movement, and we're nearing the point on SPY \\~-25 that I'd start looking for us to bottom (currently -10.25).  Possible entry long as soon as this afternoon.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "When we find a bottom, not there yet.", "score": 1, "replies": [{"body": "What other key levels are we looking at for former resistance? 306 didn't last, 304 is next, what other potential bottom are you observing?", "score": 1, "replies": [{"body": "For a daily low, I can totally see us bouncing at 304, chopping there the rest of day.  If that happen, I might not enter today.  Given we're where we are, 300 is in play, and after that there are retesting of the FIB levels around 295.  We'll find heavy support from 298 through 295 all the way through, I don't see any way we break that.  But if we do ...\n\nEither way, if you want to catch a bottom, given there is likely a significant rebound candle in our future worth multiple points, 296 to 295 is a really safe entry.  Above that, at this point who can say.\n\nThe oscillator at 3h is still sitting \\~-13, room to run.  The daily just fell below 60, but is still way overbought, so if you want to go full bear, south of 295 area gets interesting.", "score": 3, "replies": []}, {"body": "302 is 21 day VWMA as well, probably big resistance there", "score": 2, "replies": []}]}]}]}]}, {"body": "For anyone following my losses. I closed my Planet Fitness position. 6/19 70p 6 contracts bought at 1.97, sold for 5.9, total gain of $2358. That leaves my total loss on the prior trade at $698. If I factored in the day trading I did last Friday, I'd actually be ahead, though that wouldn't reflect how poorly that trade went.\n\nReality is, I got a little unlucky, and a little lucky. Unlucky in picking a very bad peak. Lucky in spotting a good stock to pair an index play with, setting a long enough strike where I had more flexibility, and then cashing in on the index crash via that stock when it eventually did turn over.\n\nSide note, I sold at 5.9, it ended the day at 6.25, so I probably could have done even better, but I started tight trailing stops when we neared what I thought the bottom was and it got hit.", "score": 3, "replies": []}, {"body": "**Position Update**\n\n* 6/15 300p, two day trades, CLOSED and realized profit of $136\n* 7/1 310c, 6 contracts 5.08 average, CLOSED at 5.8 and realized profit of $432\n* 6/19 312c, 7 contracts 3.03 average, CLOSED at 2.68 and realized loss of $245\n* 6/15 300p, 4 contracts 2.68 average, CLOSED at 2.2 and realized loss of $184.  \n* 6/15 300p, 4 contracts held for minutes for $28 gain.\n* Currently all cash, currently up a boring $167, the morning direction surprised me", "score": 3, "replies": []}, {"body": "Positive divergence on the 1m.  Negative on the 5m, 30m, 1h, etc.  Something is screaming there's a dump coming to me.  Need to find an entry, I'm not sure we're done running up.  306 or 307 is where I'd like to jump in.", "score": 3, "replies": []}, {"body": "Yeah I agree with you, I'm punch out some SPY calls if it dips under 310 and I'll catch the retard rally next week.", "score": 2, "replies": []}, {"body": "For anyone looking for a quick entry at bottom.  Divergence is still to the bear side on 1m chart.  Another retest and failure of 304 gives bulls an ability to regain control.  Breaking and resetting 306 could be a good entry.", "score": 2, "replies": [{"body": "The 1m oscillator is trending overbought, and has significant bear divergence.\n\nThe 5m oscillator is oversold, has just started an uptrend, but also has a bear divergence.\n\nIt's unclear to me if we've bottomed.  The 1h chart is pegged at -80!  Not a terrible entry, not without risk.  I'm going to open a $500 call position if we break 306, it's a gamble, not a thought out trade.", "score": 3, "replies": [{"body": "Appreciate your time for these thoughts and updates :)", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "If I were day trading, I'd be in puts, lots of volitility, direction unclear.  Still watching for near term bottom.", "score": 2, "replies": []}]}]}, {"body": "Positive divergence on 1m emerging, if it holds.  Edit: Looks like it couldn't turn upwards, back to neutral at the moment.", "score": 1, "replies": []}, {"body": "Negative divergence seems like it might be reestablishing.  Fun fight at 304.", "score": 1, "replies": []}]}, {"body": "Negative divergence really coming into the 1m chart.  Feel we're heading for a test of 300.  Bought 1 300p 6/15 at 3.03, consider it a day trade.", "score": 2, "replies": [{"body": "Out at 3.63.", "score": 1, "replies": [{"body": "is the divergence no longer valid, or did you just not feel like riding it down to 300?", "score": 1, "replies": [{"body": "Just taking profit.  Rode the oscillator down.", "score": 1, "replies": []}, {"body": "Negative divergence still very much in tact right now.  This push is weak.", "score": 1, "replies": []}]}]}]}, {"body": "Well, it looks like I'll be opening closer to up 50% than down.  It's challenging how much movement comes in AH, part of what forces you to guess.\n\nWe fell hard yesterday, so hard we broke channel.  Adam Mancini on twitter is my favorite financial follow, he drew the channel long ago, I've been watching it since.  What we don't know is does this crash have legs.  Two images:\n\n[https://imgur.com/jIkmosY](https://imgur.com/jIkmosY)\n\nThe above shows the broader channel, and us reaching back for it.  Anyone seeing a \\~6+ point overnight rally, given the broader rally, would be excused for thinking FOMO BUY!\n\n[https://imgur.com/ayyn68c](https://imgur.com/ayyn68c)\n\nJust remember, we dropped over 23 points in the past 3 days.  We broke all our channels, sliced through supports.  We now need to see, will we take it as a correction and rally, or will bears grab hold.  We can't say yet.  Regaining channel is step one.  Watching for flagging action is where I'll be, consolidation and chop below the channel that could signal we're not done.\n\nAt this point, I'd like to open above 305 for my call's sake, allow me to set stops, and then watch and react.  Notes:\n\n* 2h, 3h, 4h all oversold\n* 1d has a positive divergence of \\~7 points, 4h chart has a \\~23 point positive divergence\n* 1h trending neutral\n* While writing we bounced pretty much right off the ES channel bottom and saw us down over a 15 points", "score": 2, "replies": [{"body": "This latest run is neutral, 306 has formed as the first resistance layer bulls will need to break.  Holding 309 by EOD would mark a win for bulls.  Under 306 would feel bearish.", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Rock on.  Money isn't real till you realize it, protect it, decide what you're willing to let run.  Gonna be choppy.", "score": 1, "replies": []}]}, {"body": "Lots of positive divergence on the 1m, more tests of the channel should come before open.", "score": 1, "replies": []}, {"body": "Fighting the urge to sell out and lock gains.  I'm going to give it some rope, up around $1100 at open, I set a stop limit at 6.25 selling out down to 6.15, so it should lock at least $700 of gains, going to let it run otherwise.", "score": 1, "replies": []}, {"body": "Would love to see us rise to 312 and re-correct, could make some good money.", "score": 1, "replies": []}, {"body": "Chop coming in around bottom of channel.  Ran up to that 309 level I'm targeting for EOD, bounced down, makes a good next resistance.", "score": 1, "replies": []}, {"body": "Divergence looks positive and bullish thus far, including this dip.", "score": 1, "replies": []}, {"body": "Just opened 3 contracts 3.18 avg 312c 6/19 strike.", "score": 1, "replies": [{"body": "Got out of all at 2.68, loss of $245", "score": 2, "replies": []}, {"body": "Added 2, now 5 at 3.11 avg", "score": 1, "replies": []}, {"body": "Added, now at 7 at 3.03 avg.  Fighting divergence in the wrong direction, not cutting yet.", "score": 1, "replies": []}]}]}, {"body": "Added 4 contracts 2.68 average 300p 6/15", "score": 2, "replies": [{"body": "Will likely reenter around 306.  Edit to add that I'm attempting to catch a break of 300 and test to 295/292, which I now see as probably (though not definitive).  Price action seems to reflect consolidation, flagging, negative divergence still exists, though there are some mixed signals and direction still isn't set.  The fight goes on, but I think bears are winning.\n\nDownside is I've entered poorly, exited poorly, and generally wasted good positioning.", "score": 3, "replies": [{"body": "Added another 4 at 2.08, impatient.  tight stop set barely ITM, don't want to ride this one red given 5m oscillator position.  And stopped out for a $28 dollar gain.  Sigh.", "score": 2, "replies": []}]}, {"body": "Sold at 2.2, loss of $184.  Keep missing direction.", "score": 1, "replies": []}]}, {"body": "That’s a lot of stuff. Not reading. Hope you have puts", "score": 1, "replies": [{"body": "PLNT 70p 6/19 from my prior play, nothing on SPY.", "score": 2, "replies": [{"body": "Printing\n\n$65. Then $55. Good luck", "score": 1, "replies": [{"body": "I'm really between taking the profit today, or continuing to ride what I feel has more downward depth.  I'm likely going to set a stop a few hundred off open, then hopefully ride downward during the day before cutting by EOD.", "score": 1, "replies": [{"body": "Bulls will release every pharma pump ever today. So probably take some profit at key support levels for it \n\nBut with second wave talks. This one is prime for a huge pullback", "score": 1, "replies": [{"body": "I don't disagree, but with a 6/19 strike I'd need to reposition", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Are you hoping to cast Brad Pitt to that screenplay you wrote?\n\nSPY 310p 07/17 reporting \n\nOh and I'll prob get big heat for this fucker but idgaf. Tanker gang is the smart play if you want calls in this shit. People are going to like dividends and value when we dive into a correction of this bullshit bull run.", "score": 1, "replies": []}, {"body": "TL,DR all in IWM 7/21 130p", "score": 1, "replies": []}, {"body": "We are currently testing the FIB at 3121.25.  We bounced off it the first time and bounced to 3145.75, we punched further through the second test, bouncing now.  I don't think this holds as a support level, should punch through.", "score": 1, "replies": [{"body": "Punched Through", "score": 1, "replies": []}]}, {"body": "Got into another put.  1 at 4.1, 6/15 300p.", "score": 1, "replies": [{"body": "Out at 4.86.", "score": 2, "replies": []}, {"body": "Mostly into these out of boredom.  Waiting for a bottom, watching the ride, this much volatility it's easy to make money.  What I wouldn't give to have the time to day trade today, just not in the cards.\n\nVery interested to see what we do at 300.  All signs say we might push right on through it.  I'm going to look and see if I want to enter over the next 5-10.", "score": 2, "replies": [{"body": "looks like 300 was the bottom =/", "score": 1, "replies": []}]}]}, {"body": "We are setting up for a move into close.  I have no earthly idea what we do after that.\n\nThe 1 hour is beaten down to extreme levels.  The 2h is in freefall, so is the 3h, the 4h.  The 1d chart however still sits very oversold at 56.66 and shows a bearish divergence.\n\nThere isn't enough here to make a call.  I'm going to play anyways.  I'm going to assume we bottomed.  Looking at 7/1 calls in the 310 range.  Will update if I buy, expecting to.", "score": 1, "replies": [{"body": "Got into 4 contracts 7/1 310c.  Avg of 5.17.", "score": 2, "replies": [{"body": "Watching movement as we ride to EOD, a flash down breaking daily lows would have me realize losses and run, the minor trades early help buffer that risk.  EOD flash crash would worry me that this just isn't over.  300 is a mental level.", "score": 2, "replies": []}, {"body": "Into 6 contracts now at a 5.08 avg.  Could be a really bad idea, 295 is calling.  I think 300 or 295 is our bottom.  I'll average down into 295 if given the opportunity, have a feeling I will be.", "score": 2, "replies": []}]}, {"body": "You're confident that the lows will be in the 295-300 range, despite a strong sell signal from the Daily candle? Curious as to your thoughts.", "score": 1, "replies": [{"body": "No, I'm not confident.  But this is the most interesting market I've ever seen, so when I have a gut feel, I just play it.\n\nThe 1h oscillator was pegged at -84.28 on ES, the last time that happened was the crash, before that it was August of 2019 where it then bounced a furious 7 points and 16 points total over a 4 day run.  Before that was February in 2019 when it bounced about 6 points, but also started a month long run up 11 points without retesting that low.  We don't get here often.  Twice in 2020, twice in 2019.  I don't think this is another crash, saw a lot of support from 300 through 295, and decided to play a bounce before anything could confirm it might come.  I could wake up tomorrow and be down 50%, was OK with the risk.\n\nAt close, everything was pegged downward.  1h pegged.  2h, 3h, 4h in freefall.  Only the 1d didn't move much.  The only true information we had to go on was a bounce off 300 (I mean literally, today's low was 300.01).  We sold into close, but couldn't push past 300.  I was quite literally guessing, guessing that 300 marked a strong psychological support, and a good place for a bounce.  That bounce may evaporate by open, or maybe we reverse tomorrow and punch to 295, or maybe set new highs.  Dunno.\n\nSo, I wasn't sure, but I had a gut feeling, and I played it.  MACD on 1h and 2h showed a momentum swing the first candle in AH, and there are some trends now that at least give me hope I wasn't a total fool.", "score": 1, "replies": [{"body": "Thanks for the thorough answer, really good insight.", "score": 1, "replies": []}]}]}]}, {"body": "Can you describe what this oscillator thing is? Is it something you've written, or something that any trader can use on the right platform (such as ThinkOrSwim)?", "score": 1, "replies": [{"body": "It's something any trader can use on the right platform.\n\nI like tradingview's charts, so that's where you'll see most of mine come from.  The oscillator is a free indicator written by LazyBear.  It's called \"Indicator: WaveTrend Oscillator  \\[WT\\].\"  LazyBear didn't come up with the TA, but did make it available on tradingview's platform.\n\nI find it remarkably accurate.  It's lagging, but not by a ton, and it calls reversals really well.  I use it in coordination with the MACD, which is slower, but also does a good job at showing momentum.  It struggles the most ... wait for it ... in really strong momentum trends.  Which is exactly what caught me on the last play.  I thought given it was the 4th punch I was safe ... whoops.\n\nNo indicator is perfect, but this is still one of my favorites.  It helps me find divergence, helps me find tops, reversals, over bought/sold, and all with context to extremes.  Pair it with TA around supports, resistance, flags, wedges, consolidation, and moving averages and you've got something.", "score": 2, "replies": [{"body": "Am I correct in assuming that now that the line has crossed the signal line that SPY is in \"sell\" territory according to this oscillator right now?", "score": 1, "replies": [{"body": "Crossing 60 / -60 signals overbought or oversold.  The little plus signs switching from on top to below the line is a momentum shift, and that happening above 60 is a sell / buy signal.", "score": 1, "replies": []}]}]}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/kjtocool don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 0, "replies": []}]}
{"title": "Today Hurt", "selftext": "https://imgur.com/gallery/CmmgUyy\n\nMREITS fucked me. \n\nMeme stocks fucked me. \n\nBA fucked me. \n\nJPOW fucked me. \n\nOnly thing that hasn’t fucked me today is my gf, because she ran off to fuck her new boyfriend :(\n\n\nEdit: Don’t worry guys, I’ll be fine. I bought the dip today", "id": "h17yfj", "created_utc": 1591909316.0, "score": 242, "upvote_ratio": 0.97, "num_comments": 91, "comments": [{"body": "Somehow me selling my VXX calls at open for 100% gain instead of waiting for a 600% gain doesnt hurt as bad anymore", "score": 86, "replies": [{"body": "noob lol. vxx requires momentum, that train doesn't just pop off 14% overnight without a day long fest. I sold most of mine at 3:30, kept 1 of each date/strike for funsies", "score": 19, "replies": [{"body": "Yea yea i know. I got paper hands lookin at those tendies at open.", "score": 12, "replies": [{"body": "It’s hard. I think vxx tends to really build or not. I even bought a 6/12 36.5c for 0.51 this morning. Idk if vxx is ever great to hold overnight except like last night. If it goes green tomorrow at first, I’ll prolly buy more again. \n\n\nhttps://imgur.com/gallery/XCsX9Q8", "score": 5, "replies": [{"body": "Is VXX better than VIXY?", "score": 2, "replies": [{"body": "Can you do options on that one? I just always play with vxx but there’s another one that has options", "score": 2, "replies": []}]}]}]}]}, {"body": "Sold my 35 UVXY calls at open for +200% and they close at +1500% because I am a glutton for sucking at this", "score": 10, "replies": [{"body": "When I first started options I bag held through the  peaks and lost a bunch of my trades. Now I set stop losses like an intelligent person and they fucked me out of a couple grand today. Would rather cut gains short than diamond hands myself to 0$", "score": 8, "replies": [{"body": "It sucks, but a lesson I have learned is don't be greedy. TBH, I could not have conceived of today happening. Lesson here is, sell half.", "score": 4, "replies": [{"body": "Me either. I thought it was a flash sell off at open and was gonna be a slow crawl back up slightly", "score": 3, "replies": []}]}]}, {"body": "If someone said, give me money, and I will give you 200% return. You say?\nYou made the right decision. I do the same with options. I do miss few breakouts, but I prefer 70-200% consistent returns made from smart moves...", "score": 4, "replies": [{"body": "For sure. I'll take 200% gains all day...just...damn.", "score": 3, "replies": []}]}, {"body": "Sell them in batches.  \n\nSell to cover your initial, then one % than another.", "score": 2, "replies": []}, {"body": "I was considering buying uvxy calls instead of vxx calls. I probably should have but then again hindsight is 20/20. I probably would have had paper hands in that case.", "score": 2, "replies": []}]}, {"body": "Gains are gains bro", "score": 2, "replies": []}]}, {"body": "You guys are such bitches. Shit talking for months with all those gains and cry when you get a few days of losses. Us bears have been having our pussy pounded since March but have been happily taking it with pain pills the day after. Just take it like the bitch we all are and watch me recoup some of my ridiculous losses.", "score": 112, "replies": [{"body": "Lol straight up, I went from $13k to $300 so I've just been fat chilling until bear season began again", "score": 21, "replies": [{"body": "I went from 13k day before quad witching to 100,  🌈 🐻 brother", "score": 6, "replies": [{"body": "United we stand, but patience brother our time is upon us", "score": 2, "replies": [{"body": "I’m stuck in somewhat ass positions, but I think there is a chance they might print. They were illiquid options I bought like 3 months ago", "score": 1, "replies": [{"body": "Oh damn bro, I literally am just chilling on the sidelines. I ain't playing against the fed but like I said, I doubt printing money will save them this time. I feel like after this weekend we'll get a better picture", "score": 1, "replies": [{"body": "Yah it is what is is", "score": 1, "replies": [{"body": "It's just points anyways", "score": 1, "replies": [{"body": "Yah😔", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "You think this could be the start?", "score": 5, "replies": [{"body": "Too soon to assume so. Just 1 red day won't change things but then again, that's how this bull run was. Just look at the 2008 market crash, it picked up nearly to where it was then began dropping but slower same with the great depression.", "score": 11, "replies": [{"body": "Yesterday was red too", "score": 8, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "I know someone with red hair", "score": 2, "replies": []}]}]}, {"body": "The direction is definitely down, but short term puts probably aren't a great bet right now. The market has plunged 6% in three days. If you missed the big move, don't go chasing it.", "score": 5, "replies": [{"body": "Oh yeah the economy is clearly headed down but \"the market isn't the economy\"", "score": 4, "replies": []}]}]}, {"body": "What I do think is that this bull run was made 150% by J Powell & his printer but I doubt that trick will work a second time", "score": 3, "replies": []}]}]}]}, {"body": "Dude, did you buy options on margin or something, brokers don't allow that right?   How did you end up getting a negative value?", "score": 16, "replies": [{"body": "selling options probably", "score": 13, "replies": [{"body": "Oh right...", "score": 7, "replies": []}]}]}, {"body": "Looks like my grandmas EKG during the last few seconds of her life.", "score": 9, "replies": [{"body": "There are millenials, boomers etc., and then there are flatliners", "score": 2, "replies": []}]}, {"body": "This looks like a good place to post my BA [loss](https://imgur.com/gallery/Fn5LS0k) . I feel you dude\nEdit: your loss probably hurts alotttt more", "score": 6, "replies": [{"body": "BA is laying another round of people off here soon, and we're heading into Coronachan Bungaloo. Why ever did you think it was mooning?", "score": 3, "replies": [{"body": "I mean it was mooning for a minute lmao", "score": 3, "replies": []}]}, {"body": "Yeah today was not a good day to be bullish on BA 😪", "score": 2, "replies": []}, {"body": "tomorrow is a new day my friend", "score": 2, "replies": []}, {"body": "Fuckkk too early my man, gotta wait for it to drop then we go back in that shit again. It's literally a game of seesaw", "score": 2, "replies": [{"body": "Well I know now not to go all in at the top", "score": 1, "replies": []}]}, {"body": "you might actually make some of this back. check out futures and this graph: \n\n&#x200B;\n\n[https://twitter.com/TradingThomas3/status/1271232820296507392](https://twitter.com/TradingThomas3/status/1271232820296507392)\n\n&#x200B;\n\nGL MAN", "score": 1, "replies": [{"body": "I’d be happy to get 10-15 percent back at this point. Thanks dude", "score": 1, "replies": []}]}]}, {"body": "Charge your battery.", "score": 4, "replies": []}, {"body": "How did you manage to pull this off?", "score": 7, "replies": [{"body": "Listened to WSB", "score": 37, "replies": [{"body": "Nice.", "score": 3, "replies": []}, {"body": "\\#1 Rule of WSB:\n\n  Inverse WSB", "score": 3, "replies": []}]}]}, {"body": "did you sell covered calls?", "score": 5, "replies": []}, {"body": "I don’t understand why you fucking idiots play with margin", "score": 3, "replies": []}, {"body": "Dud you sell puts on margin? Like a lot of margin?", "score": 3, "replies": []}, {"body": "If it makes you guys feel any better, I took a $6K account down to $1K today.... Diamond hands it is, don’t really have a choice at this point.", "score": 3, "replies": []}, {"body": "OK. My $10K loss today doesn’t seem as bad now. Thanks OP.", "score": 3, "replies": []}, {"body": "Hey it's ok boo. \n\nI can still fuck you.", "score": 3, "replies": []}, {"body": "I too am curious how you managed this.", "score": 2, "replies": []}, {"body": "I'm sorry to tell you this but your gf moved on the moment you invested in meme stocks.", "score": 2, "replies": []}, {"body": "Time to delete the app and throw out your phone", "score": 2, "replies": [{"body": "Pawn the phone and but some calls!", "score": 3, "replies": []}]}, {"body": "how the fuck did you go negative", "score": 2, "replies": []}, {"body": "So what's your gameplan now?", "score": 2, "replies": [{"body": "Buy the dip", "score": 2, "replies": [{"body": "Good luck mate, just use that shit as a learning lesson since you already paid for it", "score": 5, "replies": []}]}]}, {"body": "Every day since April I’ve been able to relate so much more. Here I was thinking my ex girlfriend was pulling an April fools joke on me that just turned into a month after month marathon of shittery", "score": 2, "replies": []}, {"body": "Needs a NSFW tag. C'mon mate.", "score": 2, "replies": []}, {"body": "Hmmm", "score": 1, "replies": []}, {"body": "Were you leveraged to the tits? how tf did you do this", "score": 1, "replies": [{"body": "Nope. WSB told me stonks only go up :(", "score": 5, "replies": []}]}, {"body": "You make me feel so much better about my 6% drop.", "score": 1, "replies": []}, {"body": "GUH....\n\n\nRest in poverty, OP...", "score": 1, "replies": []}, {"body": "Damn u got crushed. Hope that was money u didn’t need.", "score": 1, "replies": []}, {"body": "my username should be the motto of this forum", "score": 1, "replies": []}, {"body": "Hurt so good", "score": 1, "replies": []}, {"body": "You fucked yourself there buddy", "score": 1, "replies": []}, {"body": "RIP", "score": 1, "replies": []}, {"body": "Just delete the app", "score": 1, "replies": []}, {"body": "Smith and Wesson stock was my only green, lol.  And Alpha Pro Tech which sank right after I bought but went up now that covid is back on the menu.", "score": 1, "replies": []}, {"body": ">I bought the dip today\n\nDon't worry about her, you're not the faggot.", "score": 1, "replies": []}, {"body": "Thank you for your service OP", "score": 1, "replies": []}, {"body": "> MREITS fucked me \n\nWhen the fuck did you start buying them? Tuesday?", "score": 1, "replies": []}, {"body": "In all seriousness - where do you find this much money to laugh and post about?", "score": 1, "replies": []}, {"body": "Literally blaming everyone but yourself.", "score": 1, "replies": []}, {"body": "[i tried to warn everyone](https://i.imgur.com/TaZxnYO.jpg)", "score": 1, "replies": []}, {"body": "😂fucking idiot", "score": 1, "replies": []}, {"body": "https://pasteboard.co/JcE0bt5.png\n\nBA was good to me. Stonks don’t always go up 🌝", "score": -2, "replies": [{"body": "Congrats !         and fuck you !", "score": 6, "replies": [{"body": "Fuck you more!", "score": 0, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Ok", "score": -1, "replies": []}]}]}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "It should say 65% of members are subs to WSB too", "score": 2, "replies": []}]}]}
