{"title": "What are some stocks that have not recovered from the dip yet, but you think have a high potential of recovery?", "selftext": "For instance, Wells Fargo was in the 50s before the pandemic broke out, and it still hasn’t crossed 30, while most tech stocks are back to their pre-COVID glory. What stocks do you think are still recovering from the dip, and are good to buy?", "id": "gw4ez9", "created_utc": 1591223713.0, "score": 39, "upvote_ratio": 0.88, "num_comments": 94, "comments": [{"body": "The stocks have recovered. My Portfolio has not", "score": 44, "replies": [{"body": "Smart investments, I see. Immune to market changes", "score": 39, "replies": []}, {"body": "I can relate :)))", "score": 3, "replies": []}]}, {"body": "EEX is at $2 AND WAS $12 before covid. as soon as confidence returns they will host a number of tradeshows that have got cancelled and return to the glory days. they also have $200m in insurance to cover the pandemic so will not go out of business.", "score": 45, "replies": [{"body": "Nice find!", "score": 4, "replies": [{"body": "they where recently upgraded by Goldman and another institution too", "score": 2, "replies": []}]}, {"body": "Great find I think this will definitely shoot up but don’t have to keep your money tied in just yet maybe wait a month or two until there’s some announcements on upcoming trade shows", "score": 3, "replies": []}, {"body": "Emerald exposition nice. Big in cannabis world too", "score": 3, "replies": []}, {"body": "Main concern here is that it could be sitting low for quite a while before recovering.", "score": 4, "replies": [{"body": "Check TA and moving averages. Looks like start of a bull run to me. Today up 9% before cooling down a bit", "score": 7, "replies": [{"body": "I'm not seeing it. Steady downturn for 5 years pre Covid and now it's back to almost pre Covid levels. It might run a bit more in the immediate while everything else is, but I dont see why I'd pick this over anything else.\n\nWhat do you see?", "score": 7, "replies": [{"body": "I also immediately notice debt to equity values of ~850% and a net margin of -200%.", "score": 1, "replies": []}]}]}]}, {"body": "Hey thanks for the post. I’m looking to find the source that they have insurance to cover the pandemic.  If you have any more info, it would be appreciated.", "score": 2, "replies": [{"body": "Found this- https://s21.q4cdn.com/496446833/files/doc_presentations/2020/Emerald-Public-Disclosure-Insurance-Update-May-19-2020.pdf", "score": 5, "replies": [{"body": "Thank you", "score": 2, "replies": []}]}]}, {"body": "It’s going to be at least a year before confidence returns. Even then, tradeshows attendance level will probably not hit precovid levels. Definitely some upside, just not to precovid price unless they increase profitability via lower operating costs.", "score": 2, "replies": [{"body": "Or by swallowing up the business of competitors who didn't have insurance and went bankrupt", "score": 3, "replies": []}]}, {"body": "The “glory days” are around $23, you think it’ll go back to that?", "score": 2, "replies": [{"body": "Probably not but 12 is good target", "score": 3, "replies": [{"body": "I bought in at $2.58 this morning. My friend, who tracks stocks, said it was a dumb buy and will go down to 2.02 beginning today. So I sold it at 2.53.... and it hit $3.15 today. Last time I listen to him. I’ll stick to Reddit for advice.", "score": 2, "replies": []}]}]}, {"body": "Well damn. I saw this post yesterday. I have all my cash tied up in other stocks so I was like ehh...I'll throw this 18$ in change I had just sitting around in the account at it. .....Now its its at 3.24 as I write this.......", "score": 2, "replies": []}, {"body": "They made 644mils loss in Q1 20' though.. kinda scary", "score": 1, "replies": [{"body": "Yeah covid sucks. At least their insurance offers some protection", "score": 1, "replies": []}]}, {"body": "Recommend to buy now or wait for a dip?", "score": 1, "replies": [{"body": "Nobody knows anything for sure. But i think it will reach $3 before any retracement. These whole numbers act like magnets.", "score": 2, "replies": []}]}, {"body": "Its printing. If you got in when posted you're up 20%", "score": 1, "replies": []}, {"body": "I like your idea looking at the 1 year chart, but showing the previous year looks like they were declining from 22 down to 10 the two years leading up to covid.  Which means I probably wouldn't have bought it pre-covid, which makes it harder to justify buying now.\n\nI still think you're right and it could easily go back to 8 or 9 as things get going.  I'm torn I guess.", "score": 1, "replies": [{"body": "9 bucks is still 300% return. How much more do you want?", "score": 2, "replies": [{"body": "Fair point, but I don't trust my rationalization for it", "score": 1, "replies": []}]}]}, {"body": "Did anyone else get in on this today? Very tasty. More upside to come", "score": 1, "replies": [{"body": "Me. Made $1200. Thanks.", "score": 2, "replies": []}]}, {"body": "Could not find EXX", "score": -4, "replies": [{"body": "U spelled it wrong", "score": 20, "replies": []}]}]}, {"body": "airlines (UAL, AAL, DAL, LUV, BA), casinos (PENN, LVS, MCRI), malls (SPG, KRG), banks (BAC, JPM, GS), oil (USO, XOM), cars (GM, F, TM) , hotels (MAR, MGM) and cruise (CCL, RCL).", "score": 14, "replies": []}, {"body": "US Airlines and Oil ETFs.  They will get bailed out if shit really hits the fan.", "score": 10, "replies": [{"body": "Which airline has a good entry point atm with safest risk from bankruptcy? I got Air Canada also.", "score": 2, "replies": [{"body": "LUV. Best balance sheet of any American carrier, and less exposed to international travel", "score": 3, "replies": []}]}, {"body": "\\^Ignore this, Airlines can go bankrupt and you lose everything.  Do you DD.", "score": 2, "replies": []}, {"body": "Any recommendations for oil ETFs?", "score": 1, "replies": [{"body": "iShares Global (IXC) has been doing really well.", "score": 2, "replies": []}, {"body": "Bahamas petroleum / BPC", "score": 1, "replies": []}, {"body": "USO??", "score": 0, "replies": []}, {"body": "I got into XLE around 38.  If the price of oil goes back up to $44, it should recover to where it was before the crash.", "score": 0, "replies": []}]}]}, {"body": "MITT\n\nA mortgage investment trust.\n\nI’ve been watching it, but not ready to touch it yet. Still a risky play. Maybe in another 4-6 months when we see unemployment numbers improve.\n\nHigh potential once the proper signals show up and no recovery yet.\n\nBe careful ;)", "score": 7, "replies": [{"body": "I agree with the Mortgage REITs. Haven’t come close to recovering though very little in terms of default rates. If we recover the way the market is projecting these should go right back up to where they were before.", "score": 5, "replies": []}, {"body": "I have swing traded MITT at least five times since the downturn. Same with MFA. So much volatility in the potentially bankrupt REITS.", "score": 2, "replies": []}, {"body": "Agreed can wait a couple more months", "score": 1, "replies": []}]}, {"body": "$RUTH , I’ve always had a good time there, it’s about half of pre corona value . Seems ready to pop off", "score": 3, "replies": []}, {"body": "DIS has slightly recovered but I think it will go even higher.", "score": 3, "replies": []}, {"body": "Mgm", "score": 8, "replies": []}, {"body": "Nrz", "score": 3, "replies": []}, {"body": "GEL", "score": 2, "replies": [{"body": "This one looks alright. What do you know about it?", "score": 1, "replies": []}]}, {"body": "BTN", "score": 2, "replies": []}, {"body": "Most oil and gas. Try NRGU for oil and gas to play safe.", "score": 2, "replies": [{"body": "I got 50 shares into NRGU, if it goes up to even 50% of what it was pre crash that is a huge profit.", "score": 1, "replies": []}, {"body": "Looked into this a bit. Prospectus says that it is meant for day trading and not to be held for long-term investing. Any idea why?", "score": 1, "replies": [{"body": "You are correct.  I look at it over the week and its recommended not to.  Do not hold these stocks.  NRGU is a leveraged take on the U.S. Oil and Gas industry. Specifically, the fund tracks three times the underlying index, which selects the 10 largest qualifying stocks and even weights them. NRGU charges a steep fee for such exposure; however, the product isn’t designed for long-term investors. The fund rebalances daily. As a result, compounding and path dependency make its long-term returns difficult to predict when compared with its underlying index.", "score": 1, "replies": []}]}]}, {"body": "WFC", "score": 2, "replies": []}, {"body": " Bahamas petroleum / BPC  - drilling starts in a few months and it's going to go sky high...get in while its low", "score": 2, "replies": []}, {"body": "Look at what the Fair Values are. Something Like C is currently around 55 with a Fair value of 72. That tells me there is room to still grow.", "score": 2, "replies": []}, {"body": "CIM. Buy lots and lots of it. It’s bout to splode.", "score": 2, "replies": [{"body": ">CIM\n\nThis did not age well", "score": 0, "replies": [{"body": "That was nearly 3 months ago idiot. It went up 35% that week. Fucking retard", "score": 1, "replies": [{"body": "It literally only went up 7% after you called it, five days after it was negative and still is", "score": 1, "replies": [{"body": "Yeah I remember that stock now. Moderately profitable pump and dump. I held that fucking thing for nearly 3 weeks before it took off. You’re really digging back thru the archives there.", "score": 1, "replies": []}]}]}]}]}, {"body": "PK\n\nHowever bit overpriced right now I’d wait for a dip\n\nEdit: but to bit", "score": 2, "replies": [{"body": "It hasn’t dipped below $9 in the past month don’t think it will go any lower now", "score": 2, "replies": [{"body": "The market is at 3100 if you believe this level is sustainable than sure, but any dips in the market and  the 4% up days will become 4% down days.", "score": 1, "replies": []}]}]}, {"body": "Eric", "score": 4, "replies": [{"body": "And NOKIA", "score": 2, "replies": []}]}, {"body": "ANAT", "score": 2, "replies": []}, {"body": "I like the Oil companies(already recovering but there's still time) , penny stocks with a decent potential. And air travels too. Whiting petroleum is under 1$ a share and before the crash was at a steady 8, for a few months,the other ones too but this had the biggest crash\n\nEdit. Just a small correction", "score": 2, "replies": [{"body": "I just read a little on Whiting. One is an article that came out today about its Chapter 11. None of what I found looked too promising. I was excited at first. But I don’t know now. Probably a ton I don’t know about it. But...Careful with that one I think.  I’d like to find some oil and gas that are ready to bounce though. Any others you’re looking at?", "score": 2, "replies": [{"body": "Well California resources is one, Callon petroleum, cenovus energy (im in the - with them currently though), oasis petroleum and tellurian(not very safe), these are the ones i found safe (personally) because most of them were steady (kinda) before they all crashed in Mar. Obviously no one can predict the future but i liked these personally, the other more expensive stocks weren't that impressive because they didn't crash as hard from what I've seen.", "score": 1, "replies": [{"body": "Ok thank you! Also looking at ETFs but it looks like all of the smart people already caught on. Ha", "score": 2, "replies": [{"body": "Id say there's still some time but its riskier and less worth overall, but if you got some leftovers(since its so cheap) why not, Sitting money is wasted money for me.", "score": 1, "replies": [{"body": "might do a few Jan Calls on Callon. I mean, They're super cheap.", "score": 2, "replies": []}]}]}, {"body": "Follow up to say thanks! Got into Callon yesterday after some reading. up 40% this morning in pre-market! Thanks!", "score": 2, "replies": [{"body": "I wanted to put more on Whiting but then saw Callon went better ahaha, got bamboozled", "score": 2, "replies": [{"body": "You still like Cenovus?", "score": 1, "replies": [{"body": "Well, i keep it because i didn't really buy a lot, mostly put the leftovers in it, but it doesn't seem like something very profitable comparatively to the others. But its okay yea", "score": 2, "replies": [{"body": "I gotcha", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "RCL and CCL", "score": 2, "replies": []}, {"body": "What ETFs would meet this definition? Due to working in a regulated role, i am unable to trade individual stocks without a lot of paperwork so I am looking for baskets that are depressed.", "score": 1, "replies": []}, {"body": "CCL for sure", "score": 1, "replies": [{"body": "Bought in @ $12 !", "score": 2, "replies": [{"body": "Good stuff. I somehow discovered them at $8. Screamed when Saudis bought in 2 days afterward", "score": 1, "replies": []}]}]}, {"body": "Boeing", "score": 1, "replies": []}, {"body": "TMDI looks great check it out", "score": 1, "replies": []}, {"body": "AAPL", "score": -7, "replies": [{"body": "Apple is pretty much at its 52wk high?", "score": 5, "replies": [{"body": "And they gonna keep going", "score": 2, "replies": [{"body": "And going and going!!", "score": 2, "replies": []}]}]}]}]}
