{"title": "BREAKING: Intel shares extend drop to session low, down more than 7.6%, after report says Apple is planning to move from Intel chips to its own Mac chips.", "selftext": "", "id": "8927t4", "created_utc": 1522691397.0, "score": 92, "upvote_ratio": 0.97, "num_comments": 57, "comments": [{"body": "God. Fucking. Damn it.", "score": 51, "replies": [{"body": "It shouldn't matter, Intel only owns USB technology amongst other things. I'm sure they haven't even released some tech to the public yet. I think they will be fine. they are still better processors than AMD anyway, they have just had horrible news lately! \n\nBut that is news, and the stock market plays on manipulation, so none of it matters anyway. \n\nJust by in the money puts right now. Or is it too late?  I don't own Intel shares anymore so I'm out.", "score": 6, "replies": [{"body": "> It shouldn't matter\n\nbut guess what? The people who trade the most on the market have no clue about how any sort of technology works. Look at the nvidia crash when they announced their *temporary* suspension of self driving car testing.", "score": 8, "replies": []}, {"body": ">  still better processors than AMD anyway\n\nThey have a larger market share and are able to bully AMD out of a lot of their biggest sales (server farms) with loyalty discounts and such, but AMD's newest line of chips definitely offers competition if not outperforms current Intel chipsets. ", "score": 7, "replies": [{"body": "Servers are moving to ARM architecture soon", "score": 1, "replies": []}]}, {"body": "[removed]", "score": 1, "replies": [{"body": "I feel like Intel has something big up their sleeves, and they haven't released it to the public. That's just a feeling.", "score": 1, "replies": []}]}, {"body": "I had sold a few puts to get the shares cheaper than what they were, but now they're damn cheap. I closed them just now because idk what will happen to INTC in the coming weeks.", "score": 1, "replies": []}]}]}, {"body": "Nice timing Apple, just take a giant shit while screaming racial slurs during the funeral procession that is today", "score": 39, "replies": [{"body": "Steve Jobs didn't die for this", "score": 14, "replies": [{"body": "Steve Jobs died for our gains, not this BS that's going on today", "score": 2, "replies": []}]}]}, {"body": "Jesus Christ tech is dead ", "score": 19, "replies": []}, {"body": "[deleted]", "score": 8, "replies": [{"body": "Should be. Intel has the best desktop/laptop chips *right now*, but they’ve been relatively stagnant with innovation over the last few years. The iPhone X is really close to a MacBook Pro in performance these days, Apple’s mobile processors are really good. If they built computer-scale versions of their mobile SoCs (like the X series chips in iPads, but larger), they’d have a very distinct advantage over competitors, and not only because they would no longer be beholden to Intel’s component pricing. ", "score": 8, "replies": [{"body": "And apple could pull this off.  The computers would be super power efficient too.", "score": 5, "replies": [{"body": "Absolutely. iPad battery life is already crazy, take that chipset and throw it in a laptop with 30-50% more space for the battery and you’ll have a machine that could probably last two full workdays with no charge. ", "score": 3, "replies": [{"body": "Well, I doubt it will last any time with no charge. Even Apple isn't that good.\n", "score": 1, "replies": []}]}]}, {"body": "> The iPhone X is really close to a MacBook Pro in performance these days\n\nYou can't compare benchmark of ARM vs x86 chips. They have vastly different architecture and instruction sets.", "score": 2, "replies": [{"body": "Of course you can benchmark them. Take a benchmark program, compile it for both architectures and run it. Apple did a platform change years ago on the Mac from PPC to x86. The latter offered faster processors, the former was closer to ARM. Problem was that it took vendors a while to recompile their software and the PPC emulator didn't run your software as fast as on native hardware of course. It also sucked to have one of latest PPC-Macs, since at some point no cross-compiled software was available any more, even though the PC was still fast enough.", "score": 2, "replies": [{"body": "I know you can benchmark that, but it is pointless to say Apple Axx is faster than Core xxx. I don't deny that ARM has great future.\n\nThe transition would be much more smooth than from PPC to x86, because Apple already has a great ecosystem built for iOS devices (running on ARM). Skeptical people often forget this. For iOS developers, it is easier for iOS developers to ship their iOS app to ARM Macbook.", "score": 1, "replies": [{"body": "Passmark has a good range of different benchmarks mimicking real world use (averaged), geekbench, Sunspider and cinebench (video editing) are good, too. It will depend on what you ultimately do with your processors, but these benchmarks provide a reasonable comparison basis. If intel is 2-3x faster in these tests, its safe to say that Intels CPUs are faster than Apples, too.", "score": 1, "replies": []}]}]}]}, {"body": "I've heard some stupid shit on this sub but this is fucking autistic even by wsb standards. Comparing the A11 to a Intel series chip (i5-i9 in the pros) is like comparing a car to a boat, sure they can both reach 20 MPH, the car may even go 100, but one of them is going to sink and I hope to god it takes your retarded ass with it.", "score": 1, "replies": []}]}, {"body": "Bought 5/18 calls this morning. Sure fucking hope it is!", "score": 3, "replies": [{"body": "I have 16 calls with that exp, all down at least 50%", "score": 7, "replies": []}, {"body": "Any special reason or just pure YOLOing?", "score": 1, "replies": []}, {"body": "Good luck buddy, but might be a bad trade.", "score": 1, "replies": []}]}, {"body": "Apple has a very long experience with manufacturing it's own chips, and they are always 6 months ahead of competitors on mobile processing power. \n\nVery feasible that in 2 years they will develop desktop-grade chips", "score": 1, "replies": []}]}, {"body": "Damn intel in second place for the race to 50 after sq. Can mu join them?", "score": 11, "replies": [{"body": "Race to 40*", "score": 15, "replies": []}]}, {"body": "Everyone remember the last supplier story that was correct?", "score": 6, "replies": []}, {"body": "Haha, long AMD. Where is my flair?", "score": 6, "replies": [{"body": "ARM based", "score": 6, "replies": [{"body": "\"There are many different types of chips and processors that go into Apple's products, both from Intel and competitors like Qualcomm, Broadcom and Arm. But Apple has increasingly looked to bring design of the most important chips — for things like artificial intelligence and augmented reality — in-house.\"\n\nDoes not day ARM but competition like them", "score": 2, "replies": [{"body": "All of Apple's in-house chips are still ARMs. ARM doesn't manufacture chips - they license their \"blueprints\" to many other companies, who then customise and integrate them in products.", "score": 8, "replies": []}, {"body": "[Business Insider](http://archive.is/HzBBy) says ARM, but I don't know where they got that since it's not in the source they link to.", "score": 0, "replies": [{"body": "no, they would retarded if they tried to use ARM for the architecture, it's inherently designed for thinware applications and low power solutions.", "score": 1, "replies": []}]}]}]}]}, {"body": "Lol I just loaded up on intel calls because it looked like the safest bet in this tech genocide", "score": 6, "replies": [{"body": "Naw that be amazon. Let’s be honest, what has changed other than trump shit talking them on twitter ?", "score": 5, "replies": [{"body": "theres a lot of stuff priced in for amazon. intel meanwhile is sitting on p/e ratio of < 25 even though it has the leverage to make money off of anything involving the chip boom.", "score": 8, "replies": [{"body": "No one cares about pe or mu would be worth like 300. Mu dropped like a bitch and has a forward pe of like 4.8", "score": 4, "replies": [{"body": "no, nobody cares about MU's PE, because they're not looking to expand when the sector is booming and everyone else is. they're content being stuck in potato land making memory modules", "score": 3, "replies": []}]}, {"body": "intel's ttm p/e is actually closer to 15, sub 15 forward", "score": 1, "replies": []}]}, {"body": "relevant flair", "score": 1, "replies": []}]}]}, {"body": "Any truth to the Chinese word for *Crisis* being *danger* and *opportunity*?", "score": 3, "replies": [{"body": "The Chinese word for \"crisis\" (simplified Chinese: 危机; traditional Chinese: 危機; pinyin: wēijī) is frequently invoked in Western motivational speaking as being composed of two Chinese characters respectively signifying \"danger\" and \"opportunity\". This is, however, largely incorrect, as the primary meaning of the character pronounced jī (simplified Chinese: 机; traditional Chinese: 機) is not \"opportunity\".[1][2] ", "score": 3, "replies": [{"body": "機=機會=Opportunity (i am a native Chinese speaker)", "score": 3, "replies": []}, {"body": "Funny thing 機 could mean \"opportunity\" in Jap.\n\nMaybe it meant the same in Chinese long time ago.\n\nNot sure. Want some Taiwanese to chime in in this. They use the oldest kanji.", "score": 2, "replies": []}, {"body": "Thank you!", "score": 1, "replies": []}]}]}, {"body": "I was right about shorting INTC, the problem is I was a year early. ", "score": 2, "replies": []}, {"body": "Holy wow these tech companies are posting some huge losses ", "score": 3, "replies": []}, {"body": "Isn't AAPL a relatively small percentage of INTC's revenue?  I'm pretty sure most of their money is made from HP, Acer, and enterprise stuff.", "score": 1, "replies": []}, {"body": "haha is AAPL going down from this news as well?", "score": 1, "replies": []}, {"body": "Shiiiiiiiiiiit", "score": 1, "replies": []}, {"body": "If anybody can successfully move their PCs from Intel to their own proprietary CPU it will be Apple. They've done it before with Power PC and it makes sense for them to have all their products run on the same CPU design. ", "score": 0, "replies": [{"body": "umm...power pc is IBM.", "score": 3, "replies": [{"body": "I think your AIM is off.\n", "score": 1, "replies": []}]}, {"body": "Agree. Huge Mac users, nervous as fuck, but I am sick of waiting *1000 days* for new Mac Minis for my hardworking employees. So I am somewhat hopeful.", "score": 1, "replies": []}]}]}
