{"title": "Motley Fool picks", "selftext": "[removed]", "id": "156a1av", "created_utc": 1690000086.0, "score": 0, "upvote_ratio": 0.29, "num_comments": 27, "comments": [{"body": "Sorry -- we removed your post or comment because it's low effort.  Please put effort into what you post to r/stocks.  Any of the following are considered low effort and will result in your post or comment being removed:\n\n* Posts or comments that rely on memes to get your point across\n\n* Posts or comments which are basic one/two sentence questions\n\n* Posts or comments that are similar to ones made several times recently\n\n* Posts or comments where no actual research was done before asking the question or starting the discussion\n\nIf you need more information on a stock, try looking it up on finviz.com or a business news website.  After that, come back and back up your statements with a source or provide a more in-depth question.\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules", "score": 1, "replies": []}, {"body": "when you see it in the news, you are already at least a week too late.", "score": 12, "replies": [{"body": "you do realize this post is sarcasm, right?", "score": -18, "replies": [{"body": "it's the internetz.  men are men.  women are men.  kids are fbi agents.", "score": 4, "replies": []}]}]}, {"body": "Dude Motley fool is thw worst. I am never renewing my pln. Bought their stock advisor and their rule breakers. Asked for a refund on the rule breakers but nothing available on stock advisor. Motley Sh1t", "score": 10, "replies": [{"body": "what’s your plan instead?", "score": -2, "replies": []}]}, {"body": "I tried motley cool and lost a bunch of money.  Absolute trash and a waste of time.", "score": 8, "replies": [{"body": "your time horizon is too short. invest, don’t trade", "score": -5, "replies": []}]}, {"body": "Motley Fool needs people like you to keep the lights on.", "score": 5, "replies": []}, {"body": "What do you think fool means???", "score": 4, "replies": []}, {"body": "[deleted]", "score": 13, "replies": [{"body": "results don’t lie", "score": -2, "replies": []}]}, {"body": "And what do I do with snowflake and unity.? Lost 50% so far. Another 2 motley hot picks.", "score": 7, "replies": [{"body": "hold both unless you need the money in the next five years. don’t add to U, add to SNOW whenever you like. don’t invest more than you need for your living expenses.", "score": -10, "replies": [{"body": "Don’t take the loss. I agree. Lt they have promise once the market, they serve starts to takeoff.", "score": 1, "replies": []}]}]}, {"body": "Aren't you up on most of those stocks? CRWD, ABNB and DDOG are great companies. Not sure what you're complaining about.", "score": 2, "replies": [{"body": "He is not complaining, he is humblebragging.", "score": 8, "replies": []}]}, {"body": "Crazy to think some times stocks go down before they go up…", "score": 2, "replies": []}, {"body": "Didn’t they ask you to hold at least 3-5 years?", "score": 0, "replies": []}, {"body": "the worst part is that because i’m so forward looking, i’m underweight NVDA, TSLA, AAPL, and MSFT and despite that i’m still outperforming the S&P by 14%. not sure how much longer i can take the beating, maybe i’ll throw in the towel and settle for negative YTD on SCHD cuz i’m a lightweight", "score": -6, "replies": []}, {"body": "Monthly DCA into\n\nUNG\nPHYS\nPSLV", "score": 1, "replies": [{"body": "those three average about -10% YTD. i’m up 34%. care to change your mind?", "score": -5, "replies": [{"body": "I’m up 200% ytd. Care to change your mind?", "score": 5, "replies": []}]}]}, {"body": "Any alternative ?", "score": 1, "replies": []}, {"body": "Problem with them is they need to release picks every month even when macro conditions and valuations say you should be patient.\n\nI like Motley Fool but only use it like another opinion. When I’m already looking at something and they rec it, then sometimes that’s the extra nudge,", "score": 1, "replies": []}, {"body": "The original Motley Fool investment scheme was to take the top 10 blue chip stocks and invest in the 9th and 8th because the top will eventually lose its status and just keep updating your choices based on this ad nauseum .  I don’t know who or what they are today, but they’ve always been kinda foolish, in my book.", "score": 1, "replies": []}, {"body": "\"Bear market?\"", "score": 1, "replies": []}]}
{"title": "Don’t fall for their trap", "selftext": "Ok listen, obviously the 2022 October/December lows was the bottom of this bear market so far. The market sentiment was so bad in Fall 2022 that it seemed like what March 2009 must have felt like. \n\nAll the articles and media headlines I was reading in December were “The End of the U.S. Dollar”, “Stock Market Will Crash 50%”, and “Get Ready for the Worst Recession Since 2008”. It was max fear. \n\nAt the all time lows last year, it seemed like the market was pricing in the near 100% probability of a recession \n\nWe all know the market has skyrocketed since January of this year. In the past 6 to 7 months the narrative has flipped. If the market continues to pump towards all time highs the market will soon price in the 100% probability that a recession WON’T happen. \n\nJust like with any two extremes the truth is  most likely in the middle. \n\nHistorically, with everything that happened since the pandemic, there should have been a severe economic downturn. We’re kidding ourselves that this time is the exception. \n\nWhat happened is that the media, YouTubers, and influencers were spreading fear for nearly two years that a recession was imminent. Recession fears were in the public’s mind so long that it affected consumer behavior, so there was a lot of cash on the sidelines. Companies preemptively spent over a year getting their balance sheets in order, tech companies especially had a lot of lay offs in 2022.  All of this ensured that a severe recession was not going to happen, or at least not on time. \n\nWhen everyone expects a recession it’s not going to happen \n\nThe worst, most severe recessions in history were the ones not enough people saw coming \n\nWhat’s going to happen is as markets pump to all time highs, and when the media starts assuring people that the recession was cancelled, people are going to let their guard down and the greed will blind them to the risks. When not enough people are anticipating the recession anymore, that’s when the recession comes and wipes us all out. \n\nNot sure if the market will reach new all lows worst than the Fall 2022, but it will still be stomach churning \n\nThe smart money in the market knows all this. It’s as if most of us haven’t learned out lesson from the bull market bubble of 2020/2021. \n\nIf you read this far then don’t fall for their trap. Protect yourself \n\nAlso, if you had cash lying around at the end of last year and you sold, you weren’t buying, or you weren’t at least interested in buying,  then you should stick to index funds and stop buying individual stocks. You either overestimated your risk tolerance, or you have no conviction in what you own", "id": "156q88f", "created_utc": 1690047387.0, "score": 2, "upvote_ratio": 0.52, "num_comments": 28, "comments": [{"body": "“They were wrong when they said to sell everything and hold cash back the , but I’m right when I say it now. Trust me bro.”", "score": 22, "replies": []}, {"body": "Or one could argue that we were in a recession or multiple recessions if you include covid and now we are in an expansion phase.\n\nIt seems to me like your argument is that 'we didn't see a recession so therefore one is coming up'. But, I feel that the recession already occurred and passed us. Inflation is also cooling.", "score": 33, "replies": [{"body": "Is there really that much room for expansion with unemployment so low? Serious question.", "score": 3, "replies": [{"body": "Yes, you may not need more employees but productivity per employee may increase over the next decade. This is especially likely given the improvement and integration of AI in many tools.", "score": 5, "replies": []}]}]}, {"body": "TL:DR: Nobody knows shit. Buy index funds.", "score": 31, "replies": [{"body": "You said options?", "score": 9, "replies": []}, {"body": "Exactly. Even if it goes down 50% it will bounce back. If it doesn’t it means China has eaten our lunch and our retirement accounts don’t even matter at that point", "score": -1, "replies": []}]}, {"body": "All feeling and no facts.", "score": 17, "replies": []}, {"body": "I will say the same thing I always do about this: I quite frankly don’t care what is going to happen. I will always find value and ways to invest into assets. I don’t care if we drop and make a new low or if we go make new all time high’s.\n\nIf you share this level of indifference, you won’t bother trying to predict the markets.", "score": 14, "replies": []}, {"body": "if you look at the charts comparing SPY to interest rates, recessions tend to happen after the fed pivots on interest rate hikes. the fed said they dont plan to pivot in 2023. to at least for this year we probably wont see a recession\n\ninterest rates are currently around 5.2%. until we see what happens when the fed pivots i dont think we can call game just yet. \n\nalso theres a global economic slowdown going on thats way bigger than just the US economy and the fed. the US is one of the few countries that more or less managed to reduce inflation.\n\ntheres a lot of optimism driving up the price of equities. while interest rates are high, theres still a lot of reasons to be cautious", "score": 4, "replies": []}, {"body": "I guess no one in the comments have seen any of the “July CPI will be the last favorable reading” \n\nMost big players are all predicting rising inflation YoY into the end of the year. Before finally cooling off.", "score": 5, "replies": []}, {"body": "We are in a literal technical depression if you believe that CPI is underreporting inflation by a wide margin (it is).\n\nWhat we have now is classic stagflation. People are excited about market gains that are likely only just breaking even after you factor in actual inflation. If it goes on for long enough the masses will catch on and I imagine that's when the real crash will happen.", "score": 4, "replies": []}, {"body": "If it looks like a recession and it quacks like a recession does it really matter if it is or isn’t? We experienced this with mass layoffs and tumbling stocks post COVID. Technically not a recession, but the impact for us plebs was the same.", "score": 5, "replies": []}, {"body": "TLDR: Just vibes bro.", "score": 3, "replies": []}, {"body": ">The market sentiment was so bad in Fall 2022 that it seemed like what March 2009 must have felt like.\n\nNot even close.\n\nIn March 2009, millions of people had lost jobs, and millions of people lost their homes and all their savings.  Among them were some of my friends and colleagues.  \n\nIt looked like the U.S. was sliding towards a new Great Depression, with bread lines and starvation next.\n\nThings were bad in the stock market in late 2022 and there was some inflation, but unemployment remained low and people could at least find work to feed themselves.  \n\nLate 2022 did not feel anywhere near as hopeless as early 2009", "score": 5, "replies": []}, {"body": "Most people seem to have already forgotten this moment. With a +19% index return, many are assuming it can finish +38%.", "score": 2, "replies": []}, {"body": "You must not remember 1999.  Prince remembers.", "score": 4, "replies": []}, {"body": "Fearful when people are greedy and greedy when people are fearful...", "score": 4, "replies": []}, {"body": "Even the biggest bear and recession fortune teller Mike Wilson said this week that he was “dead wrong” about economy. Sooo you probably have more info than him 🧐", "score": 2, "replies": []}, {"body": "how you protect yourself op? stick all cash to banks and collect that safe 4% ?", "score": 3, "replies": []}, {"body": "Sigh", "score": 1, "replies": []}, {"body": "Inflation was already in a downtrend in Jan, so it was a good time to buy:\n\n[https://www.statista.com/statistics/273418/unadjusted-monthly-inflation-rate-in-the-us/](https://www.statista.com/statistics/273418/unadjusted-monthly-inflation-rate-in-the-us/)\n\nThe only reason I was personally holding off was that the Feds were still upping rates and wasn't clear when/if they'd pause. \n\n&#x200B;\n\nRight now inflation is heading downwards and Feds have paused. So ppl are optimistic. All the other stuff is just spam/dramaqueens.", "score": 0, "replies": []}, {"body": "Wipes us all out huh? K", "score": 0, "replies": []}, {"body": "Recession kind of was here... So a chenge in definition took care of that.. So No worries.. \n\nShould New lows appear in future.. Redifinituon of that will go from market, crash, or collaps, and becomming coreection, or but the dip oppertunity..\n\nYou see... All fixed..", "score": -1, "replies": []}, {"body": "TL:dr Siss Boom Bah!", "score": -2, "replies": []}, {"body": "Last fall wasnt anywhere close to the panic of the 2008/09 recession. This sub doesn’t know real fear. I’m not worried unless I lose my job.", "score": 1, "replies": []}]}
{"title": "How many humanoid robots has Tesla already produced? The result surprised", "selftext": "", "id": "156oix5", "created_utc": 1690043235.0, "score": 0, "upvote_ratio": 0.49, "num_comments": 20, "comments": [{"body": "This reads like it was written by an AI.", "score": 10, "replies": [{"body": "Optimus Subprime is beginning to pull their own weight.", "score": 1, "replies": []}]}, {"body": "Shit article, answer is 5 or 6. Obviously it’s a prototype. Surprise.\n\nEDIT: And IIRC in the conference call it sounded like they didn’t even have all the Tesla actuators built, yet and those are going to be integrated into the next iteration in a month or two.", "score": 8, "replies": [{"body": "Wow 5-6.  . So surprising. NOT. Was expecting dozens.", "score": -1, "replies": [{"body": "You don’t build dozens of a product until you have gone through several iterations and nailed down everything and are getting ready for mass production.", "score": 2, "replies": []}]}]}, {"body": "Tl;dr\n\n5-6.", "score": 10, "replies": []}, {"body": "Didn’t musk say in q2 earnings he thinks they may be carrying out useful function in Tesla factories as early as next year ?", "score": 8, "replies": [{"body": "which really means 2-10 years.", "score": 1, "replies": [{"body": "XD", "score": 0, "replies": []}]}]}, {"body": "Surprised whom?", "score": 3, "replies": []}, {"body": "Why does it matter at this stage? Wake me up when the first one is working.", "score": 6, "replies": []}, {"body": "Whoever wrote article is saying 5-6 because that is the most we see at once in the video on Investor day.  They have no idea how many tesla bots have been built. \n\nIt is a junk article.", "score": 1, "replies": [{"body": "Elon said 5-6 on the earnings call this past week", "score": 2, "replies": []}]}, {"body": "Unless it can do laundry, this is just a rumba with legs", "score": 0, "replies": [{"body": "Not in the least. It will replace any Tesla factory employee performing a routine task, like restocking the component feeder trays for the KUKA arms, which will allow them to entirely eliminate the wasted footprint from safety cages, which will allow them to cram more capacity in the factories.", "score": 5, "replies": []}, {"body": "It is hard to rumba without legs...", "score": 9, "replies": []}, {"body": "There are simpler more productive tasks that give it value before doing laundry. \n\nLike building things.", "score": 3, "replies": []}, {"body": "You don’t think there’s any value in Tesla using these things in-house to do work? \nEspecially in Berlin", "score": 2, "replies": []}]}, {"body": "There’s one at the Scottsdale showroom. Or perhaps a fake? Anyone else have one?", "score": 1, "replies": []}, {"body": "No the result didn't surprise.", "score": 1, "replies": []}]}
{"title": "Wow. A ton of my 110 strike CSPs on AMD I STO roughly a month expired a bit above my strike price. Dunno if I should feel happy or upset about this. Yesterday was scary though.", "selftext": "", "id": "1565dhh", "created_utc": 1689986442.0, "score": 11, "upvote_ratio": 0.82, "num_comments": 27, "comments": [{"body": "Survived by the skin of your nutsack. Enjoy your weekend.", "score": 25, "replies": [{"body": "Lmao", "score": 5, "replies": [{"body": "Price went down to $109 yesterday. Your csp can still get called out right?", "score": 3, "replies": [{"body": "It really doesn’t matter the price, if you sell puts you can get assigned no matter the underlying price. In his case, even if the price is 115 his puts could still be assigned for 110, it’s just no buyer would be so silly", "score": 5, "replies": []}]}]}]}, {"body": "It's amd, never fear being assigned when mama Su is in charge", "score": 13, "replies": []}, {"body": "> Dunno if I should feel happy or upset about this. Yesterday was scary though\n\nMeans you probably picked the right strike for how you feel about AMD.", "score": 12, "replies": []}, {"body": "Now sell more at $100-105.", "score": 9, "replies": [{"body": "😄 maybe. I need to reevaluate my magical lines.", "score": 6, "replies": []}, {"body": "90-95", "score": 3, "replies": []}]}, {"body": "Happy.", "score": 5, "replies": []}, {"body": "Whether you were put-assigned to buy AMD or not, be pleased.  If you were not assigned, you can sell the 8/18/23 $100 CSP for $1.88.  If you were assigned, you can sell the 8/18/23 $125 covered call for $2.08.  Or choose different strike prices for more assignment risk or less.", "score": 3, "replies": []}, {"body": "I have 110 strikes expiring next week.", "score": 2, "replies": [{"body": "R.I.P.", "score": 2, "replies": []}]}, {"body": "That's a great trade, congrats!", "score": 2, "replies": []}, {"body": "A TON of AMD CSP's @ 110? That's a thicc portfolio, you sure you need to take this level of risk?", "score": 1, "replies": [{"body": "It definitely was risky though yesterday I was somewhat reluctantly willing to accept assignment today.", "score": 4, "replies": [{"body": "AMD is tricky too. I jumped in on an uptick at 120 no DCA or anything and was down significantly for weeks. \n\nIt'd go back to 117, I'd sell a CC, buy back out of regret and it'd drop to 110 again 😂\n\nI wanna jump back in before earnings but feel like I'll end up regretting it and bagholding again.", "score": 2, "replies": [{"body": "Could go either way at this point really. Wishing you the best!", "score": 2, "replies": []}]}]}]}, {"body": "A TON of AMD CSP's @ 110? That's a thicc portfolio, you sure you need to take this level of risk?", "score": -1, "replies": []}, {"body": "You have balls selling $110 strike. Congrats.", "score": 1, "replies": []}, {"body": "I’m getting assigned at $115 🤷🏽‍♂️", "score": 1, "replies": []}, {"body": "I sold a bunch of 110P for 8/25", "score": 1, "replies": []}, {"body": "I'm hoping to get assigned 200 shares on this strike will then hold over earnings and maybe just sell if favourable earnings", "score": 1, "replies": []}, {"body": "So the rest of your 110 CSP’s, the ones over a ton, what happened with those?  /S", "score": 1, "replies": []}, {"body": "Lessons learned to BTC when they reach 50% or 80% profit", "score": 1, "replies": []}, {"body": "Happy now and upset after the earnings on 8/1.", "score": 1, "replies": []}, {"body": "Ask yourself was it luck or skill?\nIf skill, do it again", "score": 1, "replies": []}]}
{"title": "Was the pandemic created because of having to bail out Baby Boomers?! The world may never know the real reason.", "selftext": "[removed]", "id": "156sqc3", "created_utc": 1690053631.0, "score": 0, "upvote_ratio": 0.32, "num_comments": 21, "comments": [{"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|4|**First Seen In WSB**|3 months ago\n**Total Comments**|150|**Previous Best DD**|\n**Account Age**|5 months|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n>TL;DR: Retirements are a fugazi, COVID was caused so the US government can print money to bail out baby boomers", "score": 1, "replies": []}, {"body": "What crayon brand are you eating? \nMight switch over", "score": 25, "replies": [{"body": "Vivid Violet just like my favorite Gatorade that I don't drink anymore.", "score": 1, "replies": []}]}, {"body": "You should try horse free glue instead", "score": 17, "replies": []}, {"body": "the flaw in this style of thinking is that you are assigning relation to unrelated things just because they happened in a sequence, despite there being more substantiated competing information that is incompatible with your relations\n\nin this case, you should understand the depth of what opportunists do. \n\nopportunists waited for Congress to be afraid of *anything*, and then presented their pre-written solutions. Covid stimulus was 1200 pages and they weren't written overnight.\n\nyour style of thinking is like suggesting your neighbor caused Covid for a million in PPP loans, when in reality they saw the opportunity for getting PPP loans and got them because they were offered at all", "score": 14, "replies": [{"body": "Exactly..this is how conspiracy theorists are born..people  are always attracted to some non existent hidden “secret” that could otherwise be explained by perfectly normal occurences..pandemics are not new, they have occured throughout the history of mankind…spanish flu, bubonic plague,the great plague of london etc..the only difference is that the world is alot more globalized today and a deadly pandemic like bubonic plague could potentially wipe out half the human population.", "score": 5, "replies": []}]}, {"body": "When QAnon meets WSB.", "score": 7, "replies": [{"body": "When dumbasses join Facebook", "score": 6, "replies": []}]}, {"body": "Please don't ever share your thoughts again.", "score": 5, "replies": []}, {"body": "You better stop trying to educate yourself because clearly you arent capable of doing it.", "score": 10, "replies": []}, {"body": ">I don't really know what you're trying to say here. COVID had nothing to do with printing money or bailing out baby boomers. The market has always been volatile and there will always be ups and downs. As for retirement accounts, they are a good way to save for the future, but you should never rely on them as your only source of income.", "score": 8, "replies": []}, {"body": "The internet is a window into human stupidity.  The latest polls are around 30% of Americans believe there is a “secret” conspiracy surrounding the Covid virus.  Newsflash to those who are scientifically illiterate- viruses have been around for millions of years and kill organisms.  Shit happens and we are just can try to survive.  Big thanks to Jonas Salk and the people who wiped smallpox out.  Economies keep going forward as best they can.  The boomers will die off like every other generation in human history.", "score": 7, "replies": [{"body": "Never know, but also i do beleive coivd happened because of virus. I forgot to add that in there. just added", "score": -3, "replies": [{"body": "I shouldn’t have been so rude, but I’m tired of listening to conspiracy nonsense that killed a lot of people because people wouldn’t wear masks indoors or follow medical advice.", "score": 0, "replies": [{"body": "You realize wearing a mask did and still does nothing against COVID and if you listened to medical advice at the time you would be wrong now… what a regard", "score": 4, "replies": []}]}]}]}, {"body": "Hey, you need to get another booster shot! Like the rest of us regards!", "score": 2, "replies": []}, {"body": "now i have seen everything. \n\nthat being said a lot lot bankrupt shxt was bailed out for sure. us capitalism in action since 2008!", "score": 1, "replies": []}, {"body": "The flaw in this way of thinking is that you assign unrelated things simply because they happen in order, even though there is more proven competing information that is incompatible with your relationship", "score": 1, "replies": []}]}
