{"title": "[New Shit] Morning Levels", "selftext": "I get this every morning from an IB (JPM), lmk if you guys want this shit or not. I don't format, I just copy pasta (no time). Only thing I do is bold a the section with #. I can't fit everything into 1 post so look below in comments for rest.\n\n#[Kek](http://i.imgur.com/L2Fdf9p.png)\n\n~~If someone wants the job of formatting & posting I can set up a new email account and you send the raw shit.~~\n\nEdit: not gonna do this every day but Monday and Friday so you get a \"feel\" for the week ahead and Friday so you go get a \"feel\" for wtf happened.\n\n-------\n\n#Morning Levels\n•\tUS futures are up 3 points \n\n•\tAsia: Japan Nikkei +0.66%, Japan TOPIX +0.52%, China +0.17%, Hong Kong -0.18%, KOSPI +0.27%, Taiwan -0.36%, Australia -0.10%\n\n•\tEuroStoxx 50 +0.55%, FTSE +0.19%, DAX +0.42%, CAC +0.48%, Italy +0.14%, Spain +0.29%\n\n•\tUSD (DXY) down 0.15%, EUR up 0.42%, GBP up 0.21%, JPY up 0.07%, CNY Onshore down 0.16%, CNH Offshore down 0.23%, AUD unch\n\n•\tVIX down 1.56% to 12.59\n\n•\tGold up 0.63% to $1,135.68\n\n•\tSilver up 1.39% to $16.18\n\n•\tCopper down 0.79% to $258.00\n\n•\tWTI Crude down 0.45% to $50.67\n\n•\tBrent Crude down 0.20% to $53.91\n\n•\tNatural Gas down 2.10% to $3.36\n\n•\tCorn up 0.14% to $3.57/bu\n\n•\tWheat down 0.43% to $4.08/bu\n\n•\tTreasuries 2yr yields are down ~1.7bps at 1.257%, 10yr yields are down ~3.3bps at 2.564% and 30yr yields are down ~4.5bps at 3.117%\n\n•\tJapan 10yr yields 0.068%, down ~1.2bps on the day\n\n•\tFrance 10yr yields 0.733%, down ~3.4bps on the day\n\n•\tItaly 10yr yields 1.812%, down ~0.9bps on the day\n\n•\tSpain 10yr yields 1.394%, down ~2.0bps on the day\n\n•\tGermany 10yr yields 0.312%, down ~4.6bps on the day\n \n#Trading Update\n•\tMarket update – Eurozone equities and US futures were both flattish for most of the early morning but staged a rally around 5:30amET (there wasn’t any headline that crossed the wire at that time).  There isn’t too much incremental news to talk about Fri morning as markets globally begin to quietly shut down for 2016 (there are only two major macro events left – Yellen’s speech Mon 12/19 at 1:30pmET and the BOJ decision Tues morning 12/20).  The big risk for US equities remains elevated political expectations – this isn’t a subject many want to talk about at the moment but the growing opposition to the GOP border adjustment proposal could threaten to undermine the entire corporate tax reform effort (this has been showing up in the press lately, including in the FT Wed morning and on Reuters Friday morning).  It won’t be until later in Jan (at the earliest) when various committees in Congress will start drafting legislation but investors are starting to pay a bit more attention to this risk.  Other than the outlook for US taxes, there weren’t many big headlines in the last 12-18 hours (from the perspective of domestic equities).  \n•\tCalendar - for Friday investors will be watching the US housing starts/building permits for Nov (at 8:30amET), comments from Fed’s Lacker (12:30pmET), and a bunch of analyst meetings (AGCO, CNC, HON, and MET).  Also Obama will hold his final press conf. of the year.  \n•\tEurozone equities – the major indices opened in the red but staged a rally beginning around 5:30amET and are now higher (up ~30-80bp).  Autos, tech, insurance, telecoms, and energy are all leading on the upside while banks, media, and retail lag.  Europe-specific news was pretty slow (esp. on the macro front).    \n•\tTreasuries – TSYs have a mild bid after the recent sell-off (2 and 10yr yields are down 1.7 and 4bp, respectively).  \n•\tFX – the DXY is off small so far Fri (by ~20bp) after surging Wed and Thurs.  The USD is in the red against most major crosses (the EUR is outperforming w/a 40bpbp rally).  The CNY fell further against the USD (by another 16bp).  \n•\tAsia – stocks saw mixed price action in Asia: Japan (TPX +0.52%, NKY +0.66%), HK (Hang Seng -0.18%, HSCEI -0.09%), mainland China (SHCOMP +0.17%, Shenzhen +0.95%,CSI 300 +0.17%), Taiwan (TAIEX -0.36%), Korea (KOSPI +0.27%), Australia  (ASX 200 -0.1%), and India (down 11-17bp).  There weren’t too many major Asia-specific headlines.  A few headlines crossed out of the China Central Economic Work Conference although none were particularly notable (a lot of the usual platitudes about holding growth in a “reasonable” range, etc.).  \n•\tChina/HK – mainland Chinese stocks rebounded on Fri (SHCOMP +0.17%, Shenzhen +0.95%) but still suffered losses for the week (SHCOMP -3.4%).  Nothing major occurred Fri although some of the headlines from the China Central Economic Work Conference helped to sooth sentiment.  Also a larger PBOC liquidity injection helped cool the recent domestic yield spike.  The main HK indices extended their losses (Hang Seng -0.18%, HSCEI -0.09%).  Within the Hang Seng laggard groups included REITs, telecoms, utilities, and staples (a lot of the “bond proxy” groups).  Energy stocks continued to have a bid (CNOOC +0.6%) while tech did well too (Lenovo +0.42%, AAC Tech +0.44%).  AIA Group and Galaxy both climbed >1%.  Property names were hit and China Mengniu Dairy sank after neg. earnings.  China Unicom saw profit taking.  \n•\tJapan – the main Japanese indices extended their gains (helped by the JPY slump on Fri although the currency is flat-to-up Fri morning).  Sector moves were interestingly mixed within financial space with Banks +1.7% outperforming while Insurers -1.3% lagged. Banks were broadly strong on JGB yield surge after BoJ's Rinban gave a negative impression to bonds market as they reduced the amount of JGB purchases from last time. Within Insurers, Daiichi Life +1.6% gained, while MS&AD -2.7% got hit as JPM's Tsujino rpts her preference for lifers over P&Cs. Otherwise, commodities including Metal +2.3%, Iron +0.7%, Oil +0.8% picked up from the reversion play as coal, crude price bounced.  Nintendo -4.2%, DeNA -6.8% slumped after releasing 'Super Mario Run'. Taiyo Yuden +3.3% rose after outside broker upgraded to Neutral. Park24 -0.7% slipped as FY OP ending Oct Y21.5bn missed Nikkei preview ¥24bn.  JPM's Sakagami rpts his bullish stance for overall market with his target of NKY/TPX for 2017 at ¥21k, 1,650pts respectively.\n \n#Top Headlines for Friday \n•\tUS taxes – border adjustment proposal faces growing opposition according to Reuters (http://reut.rs/2hB62br) – the initial post-11/8 market enthusiasm was underpinned by a cursory focus on the proposed cuts to statutory corporate tax rates.  However, investors in the last few weeks have spent more time focusing on the intricacies of the Trump/Ryan proposal and opposition to certain details, in particular the border adjustment idea, is growing.  This was the subject of a pg. 1 FT article Wed morning (“Republicans face corporate tax rebellion”) and is talked about in a Reuters article Fri morning (“U.S. tax reform proposal on border trade faces growing opposition”).  Border adjustments are a key piece of the GOP corporate tax reform agenda and rates may not be able to move materially lower w/o it (w/o border adjustments some think the whole House tax plan would “collapse”).  JPMorgan’s M Feroli wrote about border adjustments in this note (http://bit.ly/2gvBmHF) and JPM’s retail analyst Matt Boss discussed the impact of corporate tax reform on his sector in a note Fri morning (http://bit.ly/2gRoCw1).  \n•\tObama warned that the US will retaliate against Russia for hacking the US election.  “I think there is no doubt that when any foreign government tries to impact the integrity of our elections ... we need to take action” – Washington Post   http://wapo.st/2hCa6Wa   \n•\tLarry Kudlow has emerged as a leading candidate to become head of Trump’s White House Council of Economic Advisors – WSJ     http://on.wsj.com/2gQ7ANt   \n•\tTrump rally - the Dow’s 8% gain in the five weeks after Donald Trump’s victory is the biggest surge following any U.S. presidential election in history; history suggests the gains could continue – WSJ   http://on.wsj.com/2gR5TRy   \n•\tCompany-specific news update from Thurs night 12/15.  ADBE’s earnings overall were solid; the key metric is Digital Media ARR (Annualized Recurring Revs) coming in at $4.01B (vs. the St $3.97B).  The ADBE F17 income statement guide is a touch under the St but in general the result was solid.  JBL’s results were nicely ahead of the St (w/the AAPL-focused DM revs beating guidance) and the outlook was bright too (JBL saw a big after-hours rally).  ORCL continues to face the same dichotomy as before – the new cloud businesses are doing very well (non-GAAP SaaS/PaaS revs came in up ~89% CC which is nicely ahead of the 80% growth guidance) while the legacy ones suffer (legacy new SW licenses came in $1.347B vs. the St $1.44B).  PCLN announced that Glenn Fogel, the company's current Head of Strategy and Executive Vice President of Corporate Development, has been named CEO of the company and SABR has appointed Sean Menke as president, CEO and a member of Sabre's board.  Away from tech, CNC provided 2017 guidance and the EPS range 4.40-4.85 was light of the St (St is at 4.83); CNC cites increased healthcare uncertainty following the election for the subdued guide (CNC says if its Marketplace business performs inline w/’16 levels next year then EPS would be at the upper-end of guidance which is inline w/the St).  A judge has ruled that GILD must pay MRK $2.54B in hep-C royalties (per Bloomberg; GILD said it disagrees w/the decision and will appeal).  MET and TERP also had ’17 guidance metrics on the tape after the close.  DOW said it will exercise its option to convert all of the Series A preferred stock into shares of common stock (the conversion of all four million shares of Series A preferred stock, will result in an additional 96.804 million shares of outstanding Dow common stock).  GNC announced that all corporate stores will close on December 28 and reopen on December 29, when GNC will be providing customers a dramatically improved experience with the launch of One New GNC (#ONEnewGNC).\n•\tSanofi, Actelion – Sanofi is in advanced talks to buy Actelion and the firms are discussing a price around $275/shr; a deal could be announced as soon as next week – Bloomberg   http://bloom.bg/2hEttgZ \n•\tMDLZ - according to the NY Post, 3G Capital may be raising new money to pursue MDLZ.  3G is ready to close a new $10 billion fund.  KHC likely will not be involved in the deal.  NY Post.  http://nyp.st/2h7NQT9   \n•\tWhite House publishes its final annual economic report and outlines four key challenges facing the US economy: sluggish productivity growth, rising income inequality, a low participation rate, and “economic sustainability” (ensuring current growth isn’t robbing from future periods) – WSJ    http://on.wsj.com/2hA1xuX    \n•\tUS deploys tanks to bolster NATO in Europe – the WSJ discusses how the US has re-opened a Cold War-era storage facility in the Netherlands and restocked it w/tanks; “three years ago the last American tank left Europe; we all wanted Russia to be our partner,” said Lt. Gen. Ben Hodges, the commander of U.S. Army Europe. “My country is bringing tanks back…as part of our commitment to deterrence in Europe” – WSJ   http://on.wsj.com/2gPJrX6  \n•\tEurozone officials have pledged to ramp up their military spending, an action that is partly a response to Trump’s election – WSJ   http://on.wsj.com/2hCejJG   \n•\tChina’s state-run media reassures markets over Fed-related fallout; several articles in China’s financial press aimed at calming market anxiety related to Fed tightening – Bloomberg    http://bloom.bg/2hVnnrS  \n•\tChina – the gov’t said its monetary policy would be prudent and neutral in ’17 while fiscal policy will be proactive.  Preventing and controlling financial risk to avoid asset bubbles will be a priority, along with deepening supply-side structural reform – Bloomberg    http://bloom.bg/2gR4ASG    \n•\tChina “teapot” refineries - Beijing will not issue fuel export quotas for independent refineries next year.  The surprise policy shift could deal a “blow” to the upstart industry.  “Ending the scheme will hand control of the lucrative export business back to China's big four state-run oil majors” – Reuters    http://reut.rs/2hCfJUf   \n•\tChina's military has carried out its first ever live-fire drills using an aircraft carrier and fighters – Reuters    http://reut.rs/2hr5DI0  \n•\tFB moves closer to screening news – the WSJ discusses how FB is inching closer to a plan that would see it fact-check news in a bid to combat the rising “fake news” problem.  http://on.wsj.com/2gI4aZW   \n•\tHealthcare – Republicans plan to repeal the ACA and replace it w/a “universal access” plan.  “Our goal here is to make sure that everybody can buy coverage or find coverage if they choose to”.  Republicans are guaranteeing that the ~20MM people now receiving coverage under ACA won’t lose their plans after the repeal takes place.  Republicans have not settled on the details or the timing of their replacement plan.  NYT   http://nyti.ms/2h7KkYK  \n•\tDrug price control plan withdrawn – Medicare will drop a program that would have reduced payments for many drugs given to patients in doctors’ offices and hospital clinics.  NYT  http://nyti.ms/2h7HXFA  \n•\tPutin’s Revenge – Putin determined to win Cold War 2.0. He may be succeeding.  Politico   http://politi.co/2hEL7RG   \n•\tVladimir Putin wants a new world order. Why would Donald Trump help him?  Washington Post   http://wapo.st/2hVuCAd   \n•\tPreventing NATO-Russian Escalation – Project Syndicate   http://bit.ly/2hNRPZb  \n \n#Macro Update\n•\tThe same factors as before continue to exert upside influence on equity prices -Dec seasonality, a penchant to “chase” from people left behind by the post-11/8 rally, news/liquidity vacuums, Trump/Ryan fiscal/regulatory anticipation (this obviously remains the key driver of stocks), and solid nominal economic growth.  After the flash PMIs Thurs morning there really are no additional macro events left on the 2016 calendar (other than Yellen’s speech Mon 12/19 at 1:30pmET and the BOJ Tues morning 12/20) and thus the current optimism can continue propagating for another two weeks at least.  Sentiment remains upbeat on the prospects for stocks over the next two weeks into year-end (or until the inauguration on 1/20) although there certainly is evidence of rising skepticism behind the scenes and this may become more apparent once the year-end non-fundamental effects fade.  Elevated political expectations remain (by far) the biggest risk to the market and while it won’t be until early Feb when the various Congressional committees start producing rough tax reform drafts, investors are beginning to pay a bit more attention to some of the particulars of the Ryan/Trump agenda (specifically, the whole border adjustment issue, which was discussed in the Wed morning FT article “Republicans face corporate tax rebellion” and which JPMorgan wrote about here http://bit.ly/2gvBmHF, was one of the factors that weighed hard on apparel-linked names such as PVH, RL, COH, KORS, UA, URBN, JWN, TIF, etc., during Thurs trading).  The SPX is on pace to earn ~$116-117 for this year and the St pre-Trump was modeling ~$127 for ’17.  On ~$127 the current PE is elevated at ~17.8x but not ridiculous (although the ERP has compressed a lot more than the PE has risen of late given the move in TSYs – in Aug the ERP was ~420bp but that has since declined to ~300bp).  If the full Trump/Ryan agenda is implemented, it could eventually be worth ~$20 to EPS over the course of multiple years (as written about in this JPMorgan note http://bit.ly/2hmIsz9).\n \n#Calendar of events to watch for the week of Mon Dec 19\n•\tThe week of 12/19 will suffer from reduced attendance and liquidity but there are actually a bunch of earnings reports to keep an eye on, including: LEN (Mon morning 12/19), BBRY, CCL, DRI, FDS, GIS, KMX, NAV, VAL (Tues morning 12/20), FDX, NKE (Tues night 12/20), ACN, ATU, FINL, LNN, PAYX, WGO (Wed morning 12/21), BBBY, MU, RHT (Wed night 12/21), CAG (Thurs morning 12/22), and CALM (Thurs night 12/22).  In addition to the busy earnings schedule a lot of eco numbers are on the calendar, the most important of which will be US Nov PCE (Thurs 12/22 at 10amET), while Yellen is due to speak on the state of the jobs market Mon 12/19 (at 1:30pmET).  Finally, the BOJ decision (Tues morning 12/20) should be a non-event.\n \n#Catalysts for 2017 – big events to watch for 2017 (preliminary list – additional events likely to be added)\n•\tCES – the Consumer Electronics Show formally runs from Jan 5-8 in Las Vegas but “media days” take place Jan 3-4.  \n•\tUS Dec jobs report Fri 1/6.\n•\tJPMorgan Healthcare Conf.  Jan 9-13.  San Francisco.  Healthcare is one of the most hated sectors right now and this is one of the industry’s biggest events.\n•\tUS bank earnings season kicks off Fri 1/13 (BAC, JPM, PNC, and WFC all report that day).\n•\tEarnings - week of Mon 1/16 is the first big one of the CQ4 earnings season.\n•\tWorld Economic Forum 1/17-20 in Davos.\n•\tECB – first ECB decision of the year will occur on Jan 19.\n•\tTrump inauguration Fri 1/20.\n•\tTrump priorities – Trump will have a finite stock of political capital but a broad agenda, including tax reform (individual and corporate), infrastructure spending, deregulation (ACA, Dodd-Frank, fiduciary rule, etc.), immigration reform, trade deal adjustments, Supreme Court nominees (at least one).  What parts of the platform are prioritized and which get deemphasized?  \n•\tTrump fiscal specifics - what are the particulars of the tax reform bills – rates, deductions, etc.?  How will the fiscal priorities be sequenced?  Will corporate and individual tax reform get tackled separately, in which case the latter may not happen until the end of ’17 or early ’18?  Will Republicans utilize “reconciliation” to pass tax reform (which could limit the scope of fiscal stimulus given the need for any legislation passed in this manner to be deficit-neutral) or seek the support of some Democrats (which could dilute GOP priorities)?  Can Republicans secure relative unanimity in the Senate to even utilize reconciliation (the GOP will have 52 seats in 2017 but at least 8 of them could raise objections to some parts of the Trump fiscal agenda)?\n•\tFed appointment decisions – Trump has two appointments to immediately make to the Federal Reserve Board.  Also, Yellen’s term as Chair ends 2/3/18 and she will likely serve until that date although speculation of her replacement should kick into high gear around the spring/summer of ’17.  \n•\tForeign policy - does Trump unequivocally express support for important and historic US military alliances such as NATO?  What actions are taken in retaliation for cyberattacks waged against the US over the last several months?  Where does Trump go on his first foreign trips (these are usually seen as a signal of foreign policy priorities for any incoming president)?  Trump will quickly need to formulate specific policies w/regards to China and the South China Sea, North Korea’s nuclear program, and Russia’s behavior on its western border.  Does the recent antagonism towards China over the “One China” policy persist?  According to media reports, Obama has communicated to Trump how the NK nuclear program is the single largest foreign policy challenge facing the US.  Also it will be interesting to hear Trump’s view on sustaining the sanctions against Russia (for the unlawful seizure of Crimea) and retaining the Iran nuclear deal.  \n•\tJapan – there is speculation Abe could call elections in the Jan timeframe.\n•\tUS banks – the Fed will prob. publish the ’17 CCAR/stress test criteria around the end of Jan (the criteria was released Jan 28, 2016 for the last testing cycle).  \n•\tItaly – Italian Constitutional Court to hold hearing on legitimacy of Italian electoral law on Jan 24.\n•\tFed – first Fed decision of the year will occur on Feb 1.\n•\tNetherlands will have national elections Mar 15.\n•\tFed meeting – first press conf./dot plot decision of the year is Mar 15.  \n•\tG20 Fin Min/central bank governors meeting Mar 17-18 in Germany.  \n•\tChina’s National People’s Congress (NPC) usually takes place in mid-Mar; the gov’t will formally publish its 2017 economic objectives at this event.\n•\tUS debt ceiling - the debt limit has been suspended since late ’15 but is due to be reinstated on Mar 16, 2017.\n•\tEU Leaders Summit in late Mar – this could be the forum at which the UK formally triggers Article 50 (UK PM May has said she wants to trigger Article 50 before Mar).\n•\tDeutsche Bank US RMBS settlement (investors assume the final settlement will happen by the end of Q1 for an amount in the ~$4-5B range).\n•\tWFC’s “living will” – WFC will resubmit its living will in the Mar timeframe.  Normally this wouldn’t be a major event but if WFC’s living will is deemed inadequate again the Fed could raise the company’s capital requirements.  \n•\tFrance first-round presidential election Apr 23 (run-off is May 7).\n•\tUS Treasury publishes semi-annual currency report around Apr timeframe (investors will watch China designation closely).\n•\tUS gov’t funding – current spending legislation will keep the gov’t funding until Apr 28\n•\tG7 Leaders Summit May 26-27 in Italy.  \n•\tItaly – new elections are likely in the June timeframe.  \n•\tChina/MSCI - MSCI will announce the result of the China A shares inclusion proposal as part of the 2017 Market Classification Review in June 2017.  \n•\tG20 Leaders Summit Jul 7-8 2017 in Germany.  \n•\tGerman elections – the next German elections will be held between Aug and Oct 2017.    \n \n#Trump Transition \n•\tUS taxes – border adjustment proposal faces growing opposition according to Reuters (http://reut.rs/2hB62br) – the initial post-11/8 market enthusiasm was underpinned by a cursory focus on the proposed cuts to statutory corporate tax rates.  However, investors in the last few weeks have spent more time focusing on the intricacies of the Trump/Ryan proposal and opposition to certain details, in particular the border adjustment idea, is growing.  This was the subject of a pg. 1 FT article Wed morning (“Republicans face corporate tax rebellion”) and is talked about in a Reuters article Fri morning (“U.S. tax reform proposal on border trade faces growing opposition”).  Border adjustments are a key piece of the GOP corporate tax reform agenda and rates may not be able to move materially lower w/o it (w/o border adjustments some think the whole House tax plan would “collapse”).  JPMorgan’s M Feroli wrote about border adjustments in this note (http://bit.ly/2gvBmHF) and JPM’s retail analyst Matt Boss discussed the impact of corporate tax reform on his sector in a note Fri morning (http://bit.ly/2gRoCw1).  \n•\tTrump rally - the Dow’s 8% gain in the five weeks after Donald Trump’s victory is the biggest surge following any U.S. presidential election in history; history suggests the gains could continue – WSJ   http://on.wsj.com/2gR5TRy   \n•\tLarry Kudlow has emerged as a leading candidate to become head of Trump’s White House Council of Economic Advisors – WSJ     http://on.wsj.com/2gQ7ANt   \n•\tTrump tech summit – Kara Swisher has a full background article on the summit.  Trump apparently responded favorably to complaints about the H-1B visa program.  Re/Code  http://on.recode.net/2h7G1Ne     \n•\tHealthcare – Republicans plan to repeal the ACA and replace it w/a “universal access” plan.  “Our goal here is to make sure that everybody can buy coverage or find coverage if they choose to”.  Republicans are guaranteeing that the ~20MM people now receiving coverage under ACA won’t lose their plans after the repeal takes place.  Republicans have not settled on the details or the timing of their replacement plan.  NYT   http://nyti.ms/2h7KkYK  \n•\tTrump said he would nominate his longtime friend and lawyer David Friedman as U.S. ambassador to Israel – WSJ    http://on.wsj.com/2h7A4ja   \n•\tHousing - Scott Garrett, a House Republican who lost his re-election bid on 11/8, has met w/Trump and would like a role at the FHFA.  http://on.wsj.com/2gQcxpu   \n•\tHealthcare/taxes - repealing Obamacare would amount to a tax cut for the wealthiest Americans and a modest tax hike for some of the lowest earners – Bloomberg     http://bloom.bg/2gOY3HQ   \n•\tGoldman’s co-head of investment banking told CNBC that some form of corporate tax reform was a near certainty and the result should be improved sentiment, more M&A, and stepped up IPOs – CNBC    http://cnb.cx/2h5euvI  \n \nWashington – policy, economics\n•\tObama warned that the US will retaliate against Russia for hacking the US election.  “I think there is no doubt that when any foreign government tries to impact the integrity of our elections ... we need to take action” – Washington Post   http://wapo.st/2hCa6Wa   \n•\tWhite House publishes its final annual economic report and outlines four key challenges facing the US economy: sluggish productivity growth, rising income inequality, a low participation rate, and “economic sustainability” (ensuring current growth isn’t robbing from future periods) – WSJ    http://on.wsj.com/2hA1xuX    \n•\tStudent lending - the incoming chairwoman of the House Committee on Education and the Workforce said the gov’t should look to cut the amount of money made available for student lending – WSJ   http://on.wsj.com/2hTlMTB   \n•\tUS deploys tanks to bolster NATO in Europe – the WSJ discusses how the US has re-opened a Cold War-era storage facility in the Netherlands and restocked it w/tanks; “three years ago the last American tank left Europe; we all wanted Russia to be our partner,” said Lt. Gen. Ben Hodges, the commander of U.S. Army Europe. “My country is bringing tanks back…as part of our commitment to deterrence in Europe” – WSJ   http://on.wsj.com/2gPJrX6   \n•\tDrug price control plan withdrawn – Medicare will drop a program that would have reduced payments for many drugs given to patients in doctors’ offices and hospital clinics.  NYT  http://nyti.ms/2h7HXFA  \n•\tGeneric drug price collusion probe could expand following guilty pleas (this hit mid-day Thurs) – Bloomberg    http://bloom.bg/2gGzmII  \n•\tNYC/De Blasio – two separate grand juries have begun hearing testimony in connection w/De Blasio campaign fundraising investigations – NYT   http://nyti.ms/2hNFeoD   \n \n#Europe\n•\tBrexit - May assured her European partners that she would launch the two-year process by the end of March – Reuters    http://reut.rs/2hNu9UD   \n•\tBrexit – a senior UK official warned that Brexit negotiations could take as long as 10 years – NYT   http://nyti.ms/2hCjGsc   \n•\tBrexit – Eurozone countries reiterated a lot of their prior language w/regards to the Brexit negotiations and warned the UK that the country won’t retain access to the EU single market if it doesn’t accept free immigration – Reuters    http://reut.rs/2hNu9UD   \n•\tGreece – the country moves forward w/plans for a Christmas bonus as relations w/its Eurozone creditors deteriorate – Reuters   https://yhoo.it/2hAZ5a6     \n•\tGreece – the country’s central bank forecast 2.5% growth for the Greek economy in ’17 – Reuters   http://reut.rs/2hNAwrb    \n•\tEurozone officials have pledged to ramp up their military spending, an action that is partly a response to Trump’s election – WSJ   http://on.wsj.com/2hCejJG   \n•\tUK criticizes drug prices – Actavis UK broke competition law by raising prices on a drug by 12K % according to a competition watchdog finding – Reuters   http://reut.rs/2gIa2ly   \n \nAsia/Emerging Markets \n•\tChina’s state-run media reassures markets over Fed-related fallout; several articles in China’s financial press aimed at calming market anxiety related to Fed tightening – Bloomberg    http://bloom.bg/2hVnnrS  \n•\tChina – the gov’t said its monetary policy would be prudent and neutral in ’17 while fiscal policy will be proactive.  Preventing and controlling financial risk to avoid asset bubbles will be a priority, along with deepening supply-side structural reform – Bloomberg    http://bloom.bg/2gR4ASG    \n•\tChina – a larger than expected liquidity injection Fri from the PBOC helped calm Chinese bond markets and ease the recent yield spike – Reuters    http://reut.rs/2hB2uWv   \n•\tChina “teapot” refineries - Beijing will not issue fuel export quotas for independent refineries next year.  The surprise policy shift could deal a “blow” to the upstart industry.  “Ending the scheme will hand control of the lucrative export business back to China's big four state-run oil majors” – Reuters    http://reut.rs/2hCfJUf   \n•\tChina's military has carried out its first ever live-fire drills using an aircraft carrier and fighters – Reuters    http://reut.rs/2hr5DI0  \n•\tJapan - Japan plans to slightly reduce the cap on new government bond issues to the low 34 trillion yen ($288.18 billion) range for fiscal 2017 – Nikkei   http://s.nikkei.com/2hNURMH   \n•\tRussia/oil – all Russian oil companies will lower their output as part of the recent OPEC production agreement – Reuters   http://reut.rs/2gIfq8l   \n \n", "id": "5ioaf7", "created_utc": 1481895549.0, "score": 383, "upvote_ratio": 0.92, "num_comments": 92, "comments": [{"body": "Wow, please make this a regular thing ", "score": 150, "replies": [{"body": "rofl", "score": 2, "replies": []}]}, {"body": "Keep doing this.  \n\n ^fgt", "score": 92, "replies": [{"body": "Keep doing this.\n\nfgt\n", "score": 2, "replies": []}]}, {"body": "    user reports:\n    1: Which ticker to buy\n\nI hate you.", "score": 1, "replies": [{"body": "USER ATTEMPTED TO MODIFY FONT.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.* ", "score": 2, "replies": [{"body": "Freeze all motor functions\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "#I don't want to be rude but..[You have the charisma of a damp rag](https://youtu.be/bypLwI5AQvY) and the appearance of a low-grade bank clerk. And the question that I want to ask, that we're all going to ask, is ***\"Who are you?\"*** I'd never heard of you. Nobody on /r/WSB had ever heard of you. I would like to ask you, /u/dsbtc, who upvoted for you, and what mechanism? Oh, I know democracy isn't popular with you lots, and what mechanism the people of /r/WSB have to remove you? Is this /r/WSB democracy?\n\nWell, I sense, though that you are competent and capable and dangerous, and I have no doubt in your intention, to be the quiet assassin of /r/WSB democracy, and of the /r/WSB subreddit-nation-states. You appear to have a loathing for the very concept of the existence of us subreddit-nation-states - perhaps that's because you come from /r/investing, which is pretty much a non-subreddit.   \n\ntl;dr sftu  no body cares \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}]}]}, {"body": "Please don't change the font", "score": 3, "replies": []}]}]}, {"body": ">Gold up 0.63%\n\nStopped reading there. All I needed to know.", "score": 65, "replies": [{"body": "Lmao ", "score": 22, "replies": []}, {"body": "You know what to do. It's time. ", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 55, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "#YA THINK YOU'RE SO FUCKIN SMART DON'T YA YOU FUCKIN GIT \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 4, "replies": [{"body": "Da fuq", "score": 4, "replies": []}]}]}]}, {"body": "Keep doing this.  \n\n ^fgt", "score": 49, "replies": []}, {"body": "#Full catalyst list\n•\tFri Dec 16 – Eurozone trade balance for Oct.  5amET.\n•\tFri Dec 16 – Eurozone labor costs for Q3.  5amET.\n•\tFri Dec 16 – Eurozone CPI for Nov.  5amET.  \n•\tFri Dec 16 – US housing starts/building permits for Nov.  8:30amET.    \n•\tFri Dec 16 – analyst meetings: AGCO, CNC, HON, MET \n***************************************    \n•\tMon Dec 19 – China Nov property prices.  Sun night/Mon morning.  \n•\tMon Dec 19 – Eurozone construction output for Oct.  5amET.  \n•\tMon Dec 19 – Yellen to speak Mon Dec 19 on the state of the jobs market (1:30pmET) \n•\tMon Dec 19 – earnings before the open: LEN \n***************************************       \n•\tTues Dec 20 – BOJ rate decision (Mon night/Tues morning) \n•\tTues Dec 20 – earnings before the open: BBRY, CCL, DRI, FDS, GIS, KMX, NAV, VAL    \n•\tTues Dec 20 – earnings after the close: FDX, NKE, SCS \n***************************************       \n•\tWed Dec 21 – Eurozone consumer confidence for Dec.  10amET.\n•\tWed Dec 21 – US existing home sales for Nov.  10amET.  \n•\tWed Dec 21 – earnings before the open: ACN, ATU, FINL, LNN, PAYX, WGO    \n•\tWed Dec 21 – earnings after the close: CAMP, BBBY, MLHR, MU, RHT \n***************************************       \n•\tThurs Dec 22 – US Chicago Fed Activity Index for Nov.  8:30amET.\n•\tThurs Dec 22 – US real personal spending/income for Nov.  8:30amET.\n•\tThurs Dec 22 – US durable goods for Nov.  8:30amET.  \n•\tThurs Dec 22 – US Q3 GDP, PCE, personal consumption.  8:30amET.  \n•\tThurs Dec 22 – FHFA home price data for Oct.  9amET.  \n•\tThurs Dec 22 – US PCE for Nov.  10amET.    \n•\tThurs Dec 22 – earnings before the open: CAG \n•\tThurs Dec 22 – earnings after the close: CALM \n***************************************       \n•\tFri Dec 23 – US new home sales for Nov.  10amET.  \n•\tFri Dec 23 – US Michigan Confidence numbers for Dec.  10amET.    \n***************************************       \n•\tMon Dec 26 – BOJ minutes from 11/1 meeting (out Sun night/Mon morning)  \n***************************************       \n•\tTues Dec 27 – China Nov industrial profits.  Mon night/Tues morning.  \n•\tTues Dec 27 – S&P/Core Logic home prices for Oct.  9amET.\n•\tTues Dec 27 – US consumer confidence for Dec.  10amET.  \n•\tTues Dec 27 – Dallas Fed for Dec.  10:30amET.   \n***************************************       \n•\tWed Dec 28 – US pending home sales for Nov.  10amET.    \n***************************************       \n•\tThurs Dec 29 – US M3 money supply numbers for Nov.  4amET.  \n•\tThurs Dec 29 – US advance goods trade balance for Nov.  8:30amET.\n•\tThurs Dec 29 – US wholesale inventories for Nov.  8:30amET.   \n***************************************          \n•\tFri Dec 30 – US Chicago Purchasing Manager for Dec.  8:30amET. \n***************************************            \n•\tSun Jan 1 – China NBS manufacturing/non-manufacturing PMIs.  Sat night/Sun morning.\n***************************************              \n•\tMon Jan 2 – Eurozone Markit manufacturing PMI for Dec.  4amET.  \n***************************************                 \n•\tTues Jan 3 – US manufacturing ISM for Dec.  10amET.\n•\tTues Jan 3 – US construction spending for Nov.  10amET.  \n***************************************             \n•\tWed Jan 4 – Eurozone services PMI for Dec.  4amET.\n•\tWed Jan 4 – Eurozone CPI for Dec.  5amET.  \n•\tWed Jan 4 – US auto sales for Dec.\n•\tWed Jan 4 – FOMC minutes from 12/13-14 meeting.  2pmET.\n•\tWed Jan 4 – European trading updates: Next \n•\tWed Jan 4 – earnings after the close: RECN \n•\tWed Jan 4 – Citigroup Internet, Media, Telecoms Conf.  Jan 4-5.  Las Vegas.  \n***************************************               \n•\tThurs Jan 5 – Eurozone PPI for Nov.  5amET.  \n•\tThurs Jan 5 – US ADP jobs report for Dec.  8:15amET.\n•\tThurs Jan 5 – US services ISM for Dec.  10amET.\n•\tThurs Jan 5 – European trading updates: Persimmon \n•\tThurs Jan 5 – earnings before the open: MON, RPM, WBA \n•\tThurs Jan 5 – earnings after the close: PSMT, RT \n•\tThurs Jan 5 - Citigroup Internet, Media, Telecoms Conf.  Jan 4-5.  Las Vegas.  \n•\tThurs Jan 5 – JPMorgan 15th Annual Tech Forum at CES.  Jan 5.  \n***************************************                 \n•\tFri Jan 6 – Eurozone confidence numbers for Dec.  5amET.\n•\tFri Jan 6 – Eurozone retail sales for Nov.  5amET.  \n•\tFri Jan 6 – US jobs report for Dec.  8:30amET.  \n•\tFri Jan 6 – US trade balance for Nov.  8:30amET.  \n•\tFri Jan 6 – US factory orders for Nov.  10amET.  \n•\tFri Jan 6 – US durable goods for Nov.  10amET.       \n***************************************                   \n•\tSat Jan 7 – China FX reserve numbers for Dec.  Fri night/Sat morning.  \n***************************************                    \n•\tMon Jan 9 – Eurozone UR for Nov.  5amET.  \n•\tMon Jan 9 – US consumer credit for Nov.  3pmET.  \n•\tMon Jan 9 – earnings before the open: AYI, CMC \n•\tMon Jan 9 – JPMorgan Healthcare Conf.  Jan 9-13.  San Francisco.  \n***************************************                    \n•\tTues Jan 10 – European trading updates: Metro AG \n•\tTues Jan 10 - JPMorgan Healthcare Conf.  Jan 9-13.  San Francisco.  \n***************************************                    \n•\tWed Jan 11 – European trading updates: Sainsbury, Taylor Wimpey, Tullow Oil \n•\tWed Jan 11 – SIG holiday sales update \n•\tWed Jan 11 – earnings before the open: MSM \n•\tWed Jan 11 – earnings after the close: KBH \n•\tWed Jan 11 - JPMorgan Healthcare Conf.  Jan 9-13.  San Francisco.  \n***************************************                    \n•\tThurs Jan 12 – Eurozone IP for Nov.  5amET.  \n•\tThurs Jan 12 – US import price index for Dec.  8:30amET. \n•\tThurs Jan 12 – Yellen addresses town hall w/educators.  7pmET.  \n•\tThurs Jan 12 – European trading updates: ASOS PLC, Associated British Foods, Barratt Developments, Hays, Marks & Spencer, Richemont, Tesco\n•\tThurs Jan 12 – earnings before the open: TSM\n•\tThurs Jan 12 - JPMorgan Healthcare Conf.  Jan 9-13.  San Francisco.  \n***************************************                     \n•\tFri Jan 13 – US PPI for Dec.  8:30amET.\n•\tFri Jan 13 – US retail sales for Dec.  8:30amET.  \n•\tFri Jan 13 – Michigan Confidence numbers for Jan.  10amET.  \n•\tFri Jan 13 – earnings before the open: BAC, JPM, PNC, WFC \n•\tFri Jan 13 - JPMorgan Healthcare Conf.  Jan 9-13.  San Francisco.  \n***************************************                        \n•\tMon Jan 16 – earnings after the close: Rio Tinto \n•\tMon Jan 16 – US markets closed for Martin Luther King, Jr. Day  \n***************************************                        \n•\tTues Jan 17 – Fed speakers: Dudley \n•\tTues Jan 17 – earnings before the open: CMA \n***************************************                           \n•\tWed Jan 18 – US CPI for Dec.  8:30amET.\n•\tWed Jan 18 – US IP for Dec.  9:15amET.  \n•\tWed Jan 18 – analyst meetings: ASNA \n•\tWed Jan 18 – earnings before the open: C, GS, USB\n***************************************                           \n•\tThurs Jan 19 – US housing starts and building permits for Dec.  8:30amET.  \n•\tThurs Jan 19 – European trading updates: Ahold \n•\tThurs Jan 19 – earnings before the open: BBT, KEY\n***************************************                           \n•\tFri Jan 20 – Trump’s inauguration \n•\tFri Jan 20 – earnings before  the open: GE, KSU, SLB\n ", "score": 22, "replies": []}, {"body": "Shit so this is what it's like to have a bbt and a fistful of addys ", "score": 39, "replies": [{"body": ">COPY PASTA", "score": 18, "replies": []}]}, {"body": "how do I get on that email list?", "score": 10, "replies": [{"body": "Get a job in industry or get rich ", "score": 22, "replies": [{"body": "can you forward these to me if I give you me email?", "score": 3, "replies": [{"body": "That would be unethical as it states not to forward to anyone. \n\n#😎", "score": 32, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Something businesses and wall st embraces. ", "score": 10, "replies": []}]}, {"body": "well you can just hit \"reply\" button and put my email in there. says nothing about replies", "score": 2, "replies": [{"body": "It's not a reply if you never sent me something.", "score": 3, "replies": [{"body": "yea, just hit reply and put my email as a recipient", "score": 2, "replies": [{"body": "That's not how loopholes work", "score": 8, "replies": [{"body": "It will say \"RE:\" so I think he's on to something", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "I will volunteer to format it, pretty it up, whatever, and post it. What time will you send the raw data and what time do you expect it to be posted?\n\n*Edit Also putting it into a pdf and linking it as one report would be ideal for readability. Also, the PDF can be removed from where it is stored if an issue comes up that may cause you trouble. Otherwise all the systems that cache reddit data would expose it. Link to PDF would go to nowhere if an issue came up. Not bulletproof protection, but better than nothing. Hell, could add a password if you wanted.", "score": 8, "replies": []}, {"body": "This is amazing", "score": 6, "replies": []}, {"body": "This might be the gayest thing I've seen in WSB.\n\nTx", "score": 20, "replies": [{"body": "Don't be a homophobic faggot ", "score": 30, "replies": []}, {"body": "Wtf gave op the idea that we wanted this much information...ban him IMO", "score": -5, "replies": [{"body": "Seconded. ", "score": -6, "replies": []}]}]}, {"body": "Sure", "score": 5, "replies": []}, {"body": "Hey this is almost as good as the weekly fishing reports I get.", "score": 5, "replies": [{"body": "Gotta love those Phishing Reports. ", "score": 2, "replies": []}]}, {"body": "/r/investing called, they want their tryharding back.", "score": 7, "replies": [{"body": "Don't worry I'll send you right back since you trying hard with all your comments ", "score": 6, "replies": []}]}, {"body": "So, buy AMD? ", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Can confirm -- testing delivery now", "score": 1, "replies": []}]}]}, {"body": "Mod him pliz.\nEdit: Oh wait, I knew thiz guy alzeady.", "score": 3, "replies": []}, {"body": "I was literally just reading this from an internal email sent to me at my firm.  Never noticed the do not forward - I'm sure 100,000 people see this anyway.", "score": 3, "replies": [{"body": "Lul same ", "score": 3, "replies": [{"body": "Yeah so I'm submitting this injustice to the FBI. How fuckin dare you disclose these secrets to the peasants.", "score": 3, "replies": [{"body": "*SEC \n\nI believe in efficient market theory ", "score": 4, "replies": []}]}]}]}, {"body": "#Opinion/Interesting-but-not-immediately-impactful/intra-day boredom reading         \n•\tPutin’s Revenge – Putin determined to win Cold War 2.0. He may be succeeding.  Politico   http://politi.co/2hEL7RG   \n•\tVladimir Putin wants a new world order. Why would Donald Trump help him?  Washington Post   http://wapo.st/2hVuCAd   \n•\tTo Understand Trump, Learn Russian – NYT   http://nyti.ms/2h7RfBr   \n•\tPreventing NATO-Russian Escalation – Project Syndicate   http://bit.ly/2hNRPZb  \n•\tTrump may be borrowing Nixon’s ‘back channel’ strategy in his contacts with Russia – Washington Post   http://wapo.st/2hrfb5L  \n•\tA Trump Strategy to End Syria’s Nightmare – WSJ    http://on.wsj.com/2gI50FY   \n•\tAleppo’s fall is Obama’s failure – Washington Post   http://wapo.st/2hrjqy8   \n•\tChina Arms Its Great Wall of Sand – WSJ   http://on.wsj.com/2gId35B   \n•\tWinding Down Fannie and Freddie Is Easier Than It Seems – WSJ   http://on.wsj.com/2hVoVly   \n•\tThe Trump Cabinet: Bonfire of the agencies – Washington Post   http://wapo.st/2hES6tY   \n•\tJohn Podesta: Something is deeply broken at the FBI – Washington Post   http://wapo.st/2hNWTMV   \n•\tJill Stein has done the nation a tremendous public service – Washington Post   http://wapo.st/2gIjxRQ \n•\tBefore That Gilded Tower, Another President-Elect Had a Manhattan Home Base – NYT   http://nyti.ms/2gRYi3i   \n•\tThe U.S. Navy’s Redesigned Future Ship Still Won’t Fight - http://bit.ly/2hCr32V  \n•\tSo, Was Tom Clancy Right That the Soviets Could’ve Invaded Iceland?  http://bit.ly/2h7QUP6   \n \n#M&A/Strategic Actions\n•\tAllianz, Generali – Allianz is considering a bid for Generali’s French operations – Bloomberg   http://bloom.bg/2hNFsw6  \n•\tJ. Crew – some creditors are meeting w/lawyers to consider their options in order to prevent J. Crew from shifting assets – Bloomberg   \n•\tMDLZ - according to the NY Post, 3G Capital may be raising new money to pursue MDLZ.  3G is ready to close a new $10 billion fund.  KHC likely will not be involved in the deal.  NY Post.  http://nyp.st/2h7NQT9   \n•\tNUE - has agreed to acquire Republic Conduit, a leading manufacturer of steel electrical conduit in North America, from Luxembourg-based Tenaris S.A. for $335 million, or approximately 6x the average of its 2015 and projected 2016 EBITDA.\n•\tSanofi, Actelion – Sanofi is in advanced talks to buy Actelion and the firms are discussing a price around $275/shr; a deal could be announced as soon as next week – Bloomberg   http://bloom.bg/2hEttgZ \n•\tVRX - Valeant CEO will listen if there's 'inbound interest' in core businesses – CNBC   http://cnb.cx/2hVjof3   \n•\tYHOO, VZ – the WSJ discusses how the recent YHOO hack could put the VZ deal at risk.  VZ is watching closely to see if the news has an impact on YHOO’s business – if it does, VZ could push for a price cut or try to walk away – WSJ   http://on.wsj.com/2gR5nCP     \n \n#Financials\n•\tAllianz, Generali – Allianz is considering a bid for Generali’s French operations – Bloomberg   http://bloom.bg/2hNFsw6  \n•\tEuropean banks – Eurozone bank regulators have shifted their focus away from risky behavior and towards the paucity of profits – Bloomberg    http://bloom.bg/2gS0aZV   \n•\tFNMA, FMCC – the WSJ has an editorial w/suggestions on how to eliminate Fannie/Freddie w/o disrupting the housing market – WSJ   http://on.wsj.com/2gRbya2   \n•\tStudent lending - the incoming chairwoman of the House Committee on Education and the Workforce said the gov’t should look to cut the amount of money made available for student lending – WSJ   http://on.wsj.com/2hTlMTB   \n•\tUBS – the co is cutting nearly two dozen jobs in its Asian investment banking business – Reuters    http://reut.rs/2hVawG7   \n•\tWFC – the co will no longer offer employees bonuses tied to loans taken out by clients – WSJ   http://on.wsj.com/2hpFOb8    \n \n#Industrials\n•\tAMZN/Truckers – According to Business Insider, Amazon is building an “uber for truckers”, a new service that would increase its presence in trucking/logistics industry. The app, which is scheduled to launch in the summer of 2017, would also eliminate the need for a third-party broker which typically charges a ~15% commission (note this came out late during Thursdays trading and would be negative for CHRW). Business Insider https://goo.gl/t53s6w \n•\tBA, China – Boeing’s vice chairman highlights the importance of U.S.-China trade in regards to the company and jobs. He says that Chinese customers are expected to take delivery of ~30% 737s on order and are supportive of nearly ~150K jobs every year. Bloomberg https://goo.gl/ifgZeC \n•\tNX earnings – Decent print all around. EPS missed at $0.45 vs. st. $0.30 on revs of $249.1M vs. st. $250M. Gross margin was 24.4% vs. st.  25.2%. EBITDA was $34.6M vs. st. $33.9M on an EBITDA margin of 13.9% vs. st. 13.6%. Management also issued FY17 guidance and expects rev growth of 5-6% (implies $980.1M at MP vs. st. $964.6M). In an effort to improve margins and walk from lower margin business, management shed ~$15M of business in FY16 and expects to shed another $50-70M in FY17. \n•\tTSLA – the WSJ writes cautiously on Tesla, stating that just because the co. is currently the top electric car seller in the U.S. doesn’t mean that it will remain that way. Using a historical example, the article brings up the Ford Model-T, which dominated the car market early on only to be taken over by GM. Apple’s iPhone is another example of a product that did not enter a market first but dominated it. WSJ https://goo.gl/X1oFSZ \n•\tWMS – the co. announced that it is raising its quarterly dividend to $0.425/shr. vs. st. $0.42/shr. The co. also authorized a new $750M share repurchase program to replace the current $1B program, of which $575M has been completed. Press release \n•\tSWK, MAS, MHK, FBHS initiated outperform at Macquarie\n•\tTILE initiated neutral at Macquarie\n•\tOC initiated underperform at Macquarie\n•\tWERN, LSTR, HTLD, KNX downgraded to sell from hold at Stifel\n•\tKSU, CP upgraded to buy from hold at Stifel\n \n", "score": 2, "replies": []}, {"body": "#Materials\n•\tChina steel – some steelmakers in China’s top steel producing province are being forced to crimp output following a local government order as a result of pollution. Heavy smog will be in the region until Wednesday in which the curbs will then be lifted. Reuters https://goo.gl/zWE5jS \n•\tDOW – the WSJ reports that DOW has gained that right to convert $4B of preferred stock into common stock; ridding itself of a yearly $255M burden owed to Berkshire Hathaway and another $85M to Kuwait’s sovereign wealth fund. DOW plans to call for the conversion immediately, which should be completed over the next week or so. The move would require DOW to pay out ~$180M in ordinary dividends but would free up additional capital for other uses. WSJ https://goo.gl/5X6f4b \n•\tNUE - has agreed to acquire Republic Conduit, a leading manufacturer of steel electrical conduit in North America, from Luxembourg-based Tenaris S.A. for $335 million, or approximately 6x the average of its 2015 and projected 2016 EBITDA.\n•\tVALE, Fortescue – the CEO of Fortescue said that the planned alliance between the two iron ore majors was standing on shaky ground. The two wanted to create an ore blend for sale in China, but the CEO said that “Sadly, that has not gone as well as we would have hoped. We’re still in discussions with Vale, but I think it is looking less and less likely we are going to be able to do that transaction, which I think is a real shame.” WSJ https://goo.gl/v9al35 \n \n#Energy\n•\tAPC – the co. announced after the close on Thursday it now expects its five year annual oil growth CAGR to be 12-14%, up from its prior 10-12% growth rate (assuming $50-$60 oil). Additionally, the co. announced that its success in deepwater drilling off the Gulf of Mexico. Press release https://goo.gl/5gyKSq \n•\tChina “teapot” refineries - Beijing will not issue fuel export quotas for independent refineries next year.  The surprise policy shift could deal a “blow” to the upstart industry.  “Ending the scheme will hand control of the lucrative export business back to China's big four state-run oil majors” – Reuters    http://reut.rs/2hCfJUf    \n•\tIraq – the country is increasing its oil sales to the U.S., China, and India ahead of the planned output cuts in an attempt to dig a deeper foothold in the global supply market. Reuters https://goo.gl/6YdHKT \n•\tOPEC – Bloomberg highlights that OPEC nations are prioritizing market share in Asia while crimping supply to the U.S. and Europe as a result of their planned production cuts. Bloomberg https://goo.gl/mN53s3 \n•\tRussia/oil – all Russian oil companies will lower their output as part of the recent OPEC production agreement – Reuters   http://reut.rs/2gIfq8l   \n•\tTERP – The co. issued disappointing 2017 guidance after the close on Thursday. TERP expects FY17 CAFD of $120-160mm, below our prior estimate of $209mm. CAFD is expected to be weighed down y/y by reduced support from SUNE, debt amortization, and higher interest expense. We are adjusting our estimates accordingly. No major surprises on the balance sheet. Coster https://goo.gl/j4HDlv \n•\tPEG upgraded to overweight from neutral at JPM (full note: https://goo.gl/fbkOXS)\n•\tPOR upgraded to neutral from underweight at JPM (full note: https://goo.gl/fbkOXS)\n•\tDUK downgraded to underweight from neutral at JPM (full note: https://goo.gl/fbkOXS)\n•\tPEGI downgraded to neutral from overweight at JPM (full note: https://goo.gl/fbkOXS) \n•\tAPA, CLR, CRZO, CXO, NFX, RSPP, WLL, XEC downgraded to market perform from outperform at Wells Fargo\n•\tCNQ, SU initiated outperform at Wells Fargo\n•\tHP, TTI downgraded to sector perform from outperform at RBC\n•\tDO, ATW, FI, NE, OII, RDC, RIG downgraded to underperform from sector perform at RBC Capital\n \n#Gaming & Leisure\n•\tMPEL: This morning Crown Resorts said its further reducing its stake in Melco. https://goo.gl/aVftnQ  \n•\tJapan Gaming:  Fitch Ratings said that the international operator’s balance sheets are well positioned to handle the scale of investment Japanese officials could require for building casinos in the region. https://goo.gl/Dt0lCq \n•\tCruise lines: Goldman initiated on the cruise operators (CCL, NCLH, RCL) with neutral ratings. \n•\tLVS: Goldman initiated on Las Vegas Sands with a buy and added it to its conviction buy list; $68 pt. \n•\tMGM: Goldman initiated on MGM Resorts with a buy; $37 pt.\n•\tWYNN: Goldman initiated on Wynn Resorts with a neutral; $100 pt. \n \n#Media\n•\tYHOO, VZ: According to Reuters, Verizon is pushing for “major concessions” to its original deal as a result of the economic damage from the two hacks. Verizon is threatening Yahoo that it would go to court and argue there is a MAC if the deal is not repriced. The article notes that while no Delaware court has ever granted a merger termination based on a MAC, companies have successfully used this as a threat to renegotiate deals.  [Reuters]  https://goo.gl/SwLzbl \n•\tYHOO, VZ: Yahoo is forcing some of its users to change their passwords and this could put its deal with Verizon at risk given that at least some users typically drop services when they are forced to change their passwords. Verizon will determine whether it should walk away from the deal or push to lower the price based on declining user engagement that could come about as a result of this. [WSJ] https://goo.gl/OL69NK \n•\tVZ: Regardless of the outcome of the Yahoo deal, Verizon is not backing off of its strategy to build a mobile ads business to rival Facebook and Google.  The company is likely to do more digital media deals to increase traffic for its advertisers.  [Bloomberg] https://goo.gl/KxQ118 \n•\tInternet: 2017 outlook from JPM’s D. Anmuth: Top picks FB, NFLX, GOOGL. Smid-cap: YELP, MTCH. https://jpmm.com/research/content/GPS-2209194-0 \n•\tFOXA, SKY: Fox increased its offer for Sky three times before it was accepted, and while some holders still think the offer is low they are being pragmatic and would accept the deal. [Reuters] https://goo.gl/mAU14N \n•\tNLSN: NBCU top ad sales exec Linda Yaccarino told Nielsen that its TCR measurement tool “does more harm than good, and it’s not ready for release”. Yaccarino’s lack of trust in the product could keep other media companies from quickly adopting it. [Variety] https://goo.gl/u5YzSZ  \n•\tAMZN: According to BI, Amazon is building an upper like app for truckers that will match truck drivers with shippers. The app, which is scheduled to launch in the summer of 2017, would deepen its presence in the massive $800B trucking industry, and it would eliminate the need for third party brokers who typically charge a 15% commission. [Business Insider] https://goo.gl/8RoaUN \n•\tFB + News: The WSJ discusses how Facebook is inching closer to a plan that would see it fact-check news in a bid to combat the rising “fake news” problem. [WSJ]   http://on.wsj.com/2gI4aZW   \n•\tTech: Recode has a full background article on the tech summit.  Trump apparently responded favorably to complaints about the H-1B visa program.  [Recode]  http://on.recode.net/2h7G1Ne     \n•\tPCLN: Priceline announced that Glenn Fogel, the company's current Head of Strategy and Executive Vice President of Corporate Development, has been named CEO, effective January 1, 2017. Current Interim CEO and non-Executive Chairman Jeff Boyd, will assume the role of Executive Chairman of the Board. [Press release] https://goo.gl/ocV5vd \n•\tTencent + Music: Tencent is planning to expand its streaming music service, creating more competition for the likes of Apple and Spotify. [WSJ]   http://on.wsj.com/2hEcBH4   \n•\tNintendo: According to researcher SensorTower, Nintendo Super Mario mobile game topped the download charts in Japan, Germany, Australia, and the UK. [Bloomberg]  \n•\tNintendo: According to analytics firm Mobile Action, the game was the most downloaded iPhone app in the US. [Recode] https://goo.gl/JLEkGw \n•\tSABR: Sabre announced that its board appointed Sean Menke as president, CEO and a member of Sabre's board, effective Dec. 31, 2016.  Menke will succeed Tom Klein, who has served as president, CEO and board member since 2013. In addition, the board named Larry Kellner, currently the non-executive chairman of the board, as executive chairman, also effective Dec. 31, 2016. [Press release] \n•\tGOOGL: Cleveland Research initiated on Alphabet with a neutral. \n•\tSQ: Needham initiated on Square with a buy; $17 pt. \n•\tTowers: Guggenheim initiated on the towers (AMT, CCI, SBAC) with a neutral rating. \n \n", "score": 2, "replies": []}, {"body": "Sweet, so buy calls on banks, spy and continue to short gold. Thanks!", "score": 2, "replies": []}, {"body": "thanks for this my dude", "score": 5, "replies": [{"body": "Fuck off poser ", "score": 44, "replies": [{"body": "The only thing I pose in are super tight leggings so you feel stupid right now I bet", "score": 15, "replies": []}]}]}, {"body": "TLDR?", "score": 5, "replies": [{"body": "LONG SPY short JNUG", "score": 17, "replies": [{"body": "For real tho, is this cut and pasted or did you find and organize it all? I tried to read it all but I died", "score": 4, "replies": [{"body": "Accurate flair ", "score": 22, "replies": [{"body": "Oh, ok thanks anyway.", "score": 3, "replies": []}]}, {"body": "He hacked clinton's server and stole all this info", "score": 1, "replies": []}]}]}, {"body": "Buy more AMD", "score": 2, "replies": []}]}, {"body": "#Tech\n•\tADBE earnings; overall solid print; the headline income statement guidance for F17 is a bit below the St but in general this is a healthy report and outlook.  Revs $1.61B (vs. the St $1.587B).  EPS 0.90 (vs. the St 0.86).  Digital Media segment revenue was $1.08 billion (vs. the St $1.06B) with Creative revenue growing 33 percent year-over-year to $886 million.  Digital Media Annualized Recurring Revenue (“ARR”) to $4.01 billion exiting the quarter (vs. the St $3.97B), a quarter-over-quarter increase of $316 million.  Adobe Marketing Cloud achieved record revenue of $465 million.  For F17 they see revs $6.95B (vs. the St $7.073B), Digital Media revs up 20%, Digital Media ARR up ~25%, and Adobe Marketing Cloud revs up 20%.  They see F17 EPS 3.75 (vs. the St 3.83).  For FQ1/Feb they see revs $1.625B (vs. the St $1.648B) and EPS 0.87 (vs. the St 0.85).\n•\tFB moves closer to screening news – the WSJ discusses how FB is inching closer to a plan that would see it fact-check news in a bid to combat the rising “fake news” problem.  http://on.wsj.com/2gI4aZW   \n•\tJBL earnings; solid Q and guide; the AAPL-focused DM revs came in ahead of the St.  EPS came in 0.69 (vs. the St 0.64).  Revs $5.2B (vs. the St $4.91B).  EM revs came in $2.7B (inline w/guidance) while DM revs were $2.4B (ahead of the St $2.2B).  For FQ2/Feb they see revs $4.2-4.5B (vs. the St $4.36B) including DM revs down 2% Y/Y and EM revs flattish w/and EPS 0.35-0.57 (vs. the St 0.46).  “I’m really pleased with our strong first quarter results,” said CEO Mark Mondello. “In particular, we saw strength in our healthcare, packaging and consumer lifestyles businesses within our DMS segment, combined with yet another solid quarter of execution from our EMS segment, allowing us to deliver excellent results,” he added.  Looking ahead, we’ll remain focused on our multi-year financial objectives and longer-term enterprise goals, while following through on our commitment to return capital to shareholders, as previously communicated under our two-year capital allocation framework”.  \n•\tLMT takes stake in private chipmaker – LMT has taken a minority stake in IQ-Analog Corp., a chip designer targeting military communications and technology for next-gen cellphones – WSJ   http://on.wsj.com/2hVfdQj  \n•\tORCL earnings; mixed numbers but the SaaS/PaaS revs came in at +89% which is nicely ahead of the ~80% guide; the legacy SW license number came in on the light side; OMs were solid and EPS was a ~1c beat.  Total revs came in up 2% CC – this is within the 0-3% growth guidance.  EPS was 0.61 (ahead of the St 0.60 est. and vs. the St 0.59-0.62).  OMs were 42% (vs. the St 41%).  SaaS/PaaS revs came in up 89% CC – this nicely ahead of the ~80% growth guidance.  Cloud plus On-Premise Software Revenues were $7.2 billion, up 2% in U.S. dollars and up 3% in constant currency (they guided up 3-5%).  New SW licenses came in $1.347B (vs. the St $1.44B).  Total HW revs $1.014B (about inline).  Total revs $9.07B (vs. the St $9.115B).  They see FQ3 SaaS/PaaS revs up 82-86%, SW/cloud revs +4-6%, total revs up 3-5%, EPS 0.61-0.64.  For F17 they are raising the guide for SaaS/PaaS revs from 67% to 80% (the new outlook assumes Netsuits).    \n•\tSamsung Electronics – JPMorgan’s JJ Park is making positive comments (note out at 9amET Thurs morning).  We revise up our earnings estimates for 4Q16-FY18 upon significant upward revisions to the OLED business and raise our PT to W2.2M, implying 25% upside from current levels. We think a 4Q16 results beat (we foresee SEC delivering 4Q16 OP of W8.5T, above consensus), a sizable share buyback/cancellation (~W7T) in 2017, the GS8 launch and Apple’s new product launch (for which Samsung will provide components; contrary to market expectations, we expect Samsung will remain the sole display vendor to AAPL until at least 2018) will provide near- to medium-term catalysts.  http://bit.ly/2gEILRb   \n•\tSSNC - announced it has acquired Conifer Financial Services, an independent asset services firm for an aggregate purchase price of $88.5 million.  \n•\tTrump tech summit – Kara Swisher has a full background article on the summit.  Trump apparently responded favorably to complaints about the H-1B visa program.  Re/Code  http://on.recode.net/2h7G1Ne   \n•\tTencent – the co is planning to expand its streaming music service, creating more competition for the likes of Apple and Spotify – WSJ   http://on.wsj.com/2hEcBH4   \n•\tToshiba – profits at Toshiba’s chip division are expected to beat forecasts due to favorable FX moves and strong flash memory demand – Reuters    http://reut.rs/2gR7ab0   \n•\tYHOO, VZ – the WSJ discusses how the recent YHOO hack could put the VZ deal at risk.  VZ is watching closely to see if the news has an impact on YHOO’s business – if it does, VZ could push for a price cut or try to walk away – WSJ   http://on.wsj.com/2gR5nCP     \n \n", "score": 3, "replies": [{"body": "AMD isn't even on here.", "score": 4, "replies": [{"body": "Too busy going to the moon", "score": 3, "replies": []}, {"body": "So last week  for JPM", "score": 2, "replies": []}]}]}, {"body": "New? Check. Shit? Check.\n\n\nactually I appreciate the brief.", "score": 4, "replies": []}, {"body": "longest block of text in wsb history that doesnt mention one of our shit stocks", "score": 3, "replies": []}, {"body": "> • UK criticizes drug prices – Actavis UK broke competition law by raising prices on a drug by 12K % according to a competition watchdog finding – Reuters http://reut.rs/2gIa2ly\n\nShkreli? Is that you?", "score": 2, "replies": []}, {"body": "Your humanity is cost-effective. So is your suffering.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "adderall again? \n\nthanks anyway!", "score": 1, "replies": []}, {"body": "Me likey. ", "score": 1, "replies": []}, {"body": "Yeah....I like this", "score": 1, "replies": []}, {"body": "Oh man that's good shit. ", "score": 1, "replies": []}, {"body": "Yes please!", "score": 1, "replies": []}, {"body": "Maybe make a subreddit where you (or whoever you find to format for you) can post this daily?\n\nAlso, is there a way for those not in the industry to have access to stuff like this?", "score": 1, "replies": [{"body": "\n\n>Also, is there a way for those not in the industry to have access to stuff like this? \n\nBe an institutional investor.", "score": 2, "replies": [{"body": "Investor?", "score": 1, "replies": []}]}]}, {"body": "This is stupid. If you get the daily PB email it tells you trades fucking idiots. \n\nSource: i used to work there in PB...they send out trade emails that net you X% gain", "score": 1, "replies": []}, {"body": "Would people be interested in signing up to receive this via email? ", "score": 1, "replies": []}, {"body": "This shit gravy ", "score": 1, "replies": []}, {"body": "Okay this was good, thanks.", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "\nOnly autistics think retardation is funny.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "Cocaine is a hell of a drug.", "score": 1, "replies": []}, {"body": "If Obama could stop trying to start a war with a nuclear power right before leaving office, I'd really appreciate it. I mean it's just posturing and everyone gets that (or should) but still -- cool your fucking jets on starting wars on unsubstantiated rumors. Who do you think you are? George \"Dubya\" Bush?", "score": 1, "replies": [{"body": "What, invested in lightbridge too?", "score": 1, "replies": [{"body": "What does a nuclear consulting company have to do with it? Am I missing something?", "score": 2, "replies": [{"body": "They have a couple thorium projects which could be a nuclear alternative. I don't know what I was getting at though.", "score": 1, "replies": []}]}]}]}, {"body": "All this text, when the only question we want answered is which biotech is underpriced...", "score": 0, "replies": []}, {"body": "I get similar ones ", "score": 0, "replies": []}, {"body": "I feel I have just been fisted in my anus by a ton of bs reading this", "score": -5, "replies": []}]}
