{"title": "During the market crash, I achieved a +80% return on my Roth IRA for the year and then sold everything.", "selftext": "During the market crash, I achieved a +80% return on my Roth IRA for the year and then sold everything.\n\nI recognize this sort of luck is exceedingly rare and I don't plan to actively manage my Roth IRA on a regular basis long term. I only did so during the last few months because I had genuine worries about the direction of the market in February and was bullish on the reopening rally.\n\nCan someone give me an idea what (in percentage terms) I will owe in taxes this year for selling out of my Roth IRA?\n\nIf I were to actively manage my Roth IRA in the future (trading and selling multiple times per week) what is the annual return one must achieve to make the tax penalty worthwhile?", "id": "h977eb", "created_utc": 1592188116.0, "score": 5, "upvote_ratio": 0.65, "num_comments": 22, "comments": [{"body": "Uh. You get to keep all of that. It’s tax free. That’s like the entire point of a Roth", "score": 31, "replies": [{"body": "My dad told me if you sell out, you pay tax on the profits. But I’m now understanding you only pay tax if you withdraw it to your checking account. I guess that’s why he’s not up 80% and I am.", "score": -6, "replies": [{"body": "Is this post a joke?", "score": 3, "replies": []}]}]}, {"body": "You don’t get penalized or taxed if you buy/sell stocks in your Roth... you get penalized if you pull any money out of there before retirement age.", "score": 14, "replies": [{"body": "Do you have to hold a stock for a certain period of time in a Roth IRA account before selling it or can you sell a stock the next trading day after you buy it?", "score": 1, "replies": [{"body": "You can sell next day", "score": 2, "replies": []}]}, {"body": "You can withdraw your initial contributions w/o a penalty.  It's the gains that would give you a penalty if you withdrew early.", "score": 1, "replies": []}]}, {"body": "How do you actively manage a portfolio for an 80% gain during a massive 40% market crash and not know ROTH's are tax sheltered?", "score": 9, "replies": [{"body": "Guess I did too much coke and skipped chapter 1", "score": 2, "replies": []}]}, {"body": "You get to keep it all, assuming you don’t withdraw your capital gains before... I don’t remember what age...", "score": 1, "replies": [{"body": "59 1/5", "score": 2, "replies": []}]}, {"body": "if those money is still in your roth account there is no penalty.", "score": 1, "replies": []}, {"body": "Well done!\n\nI've done the same although didn't reach your numbers\n\nThe Fed is my favorite thing after anchovies pizza", "score": 1, "replies": []}, {"body": "As long as you don’t take out the earnings, there is no tax. You can take out as much of your contribution as you want, also tax free.", "score": 1, "replies": []}, {"body": "What platform do you use for your roth?", "score": 1, "replies": [{"body": "Schwab.", "score": 1, "replies": []}]}, {"body": "That’s not really all that smart. Now you have to wait till the stock price gets lower then when you bought in which means timing the market and possibly missing out on your capital gains and dividends.", "score": 1, "replies": [{"body": "Could be right. Don't fight the Fed is certainly an important thing to keep in mind. However, I believe many market risks lie ahead. A wave of bankruptcies, a Democratic blue wave,  Republican unwillingness to pass a new stimulus bill, a spike in unemployment after PPP expires, inflation, and of course a resurgence of cases (which could indeed lead to more lockdowns since it's the governors who decide whether lockdowns happen, not the president.)", "score": 2, "replies": [{"body": "Don't forget another critical adage: \"Sell in May, go away.\"", "score": 1, "replies": [{"body": "Also, remember that while many hedge funds were taken behind the shed during the market plunge,  many have also made their returns back by now and are positive for the year.", "score": 1, "replies": []}]}]}]}]}
{"title": "Tomorrow", "selftext": "So I heard that Dow futures dropped 3 hundred points today and I'm wondering, are we going to have a really shit day or somewhat shit day. Thoughts ???", "id": "h96l6a", "created_utc": 1592185789.0, "score": 2, "upvote_ratio": 0.6, "num_comments": 30, "comments": [{"body": "That's 1%. The media is just trying to spread fear. Buy the dips, have cash for deals that present themselves.", "score": 20, "replies": [{"body": "Always use the bigger number to scare people.", "score": 3, "replies": [{"body": "“Biggest drop in Dow history!” When in reality it was only 4% lol gotta love the media am I right?", "score": 4, "replies": [{"body": "sorry your right I need to do more research then just reading articles, sadly I believe the young investors like me will still fall for this.", "score": 1, "replies": []}, {"body": "To be fair 4% is weeks of price action in a normal simulation, but we glitching and we forgot about it lol", "score": 1, "replies": [{"body": "True. It was up 20% in a week at one point if I remember correctly. That’s a few years worth lol but the fact remains that when they say “largest point drop” it’s not really in relation to percentage, which is the important part.", "score": 1, "replies": [{"body": "Yeah im not sure why im loosing my time on such a beta post lol", "score": 1, "replies": []}]}]}]}]}, {"body": "its down almost 900 now 3%", "score": 1, "replies": []}]}, {"body": "Media trying to cause a quick sell off in the AM. Whales swoop in to buy bulk shares for cheap... leaving the rest to FOMO and buy back in at a higher price point...", "score": 12, "replies": [{"body": "This.", "score": 0, "replies": [{"body": "This!", "score": 1, "replies": []}]}]}, {"body": "I think the whole week will end flat.", "score": 8, "replies": [{"body": "I call it an okie doke.", "score": 2, "replies": []}, {"body": "Because the market just wants to see me rip my hair out at this point", "score": 1, "replies": []}]}, {"body": "I hope it tanks another 6%, honestly. This little reality check on Friday restored some of my faith in a return to rationality.", "score": 10, "replies": [{"body": "not sure if 6% is enough tho. It rallied way too quickly from the bottom.", "score": -1, "replies": [{"body": "You could use the counter argument that it rallied appropriately in terms of how quickly it dropped.", "score": 2, "replies": [{"body": "It rallied only bc FED pumped it though...", "score": 1, "replies": [{"body": "That’s only part of the equation.", "score": 2, "replies": [{"body": "The other part is people on their phones investing with pennies. The hardship is just beginning", "score": 1, "replies": []}]}]}]}, {"body": "Agreed, but it's likely not gonna retest that bottom at the same speed as the crash in March. But a consistent decline back down, and a slower more rational climb back up would give me the confidence to get back into the market.", "score": 1, "replies": [{"body": "yea i also doubt it will go more than 15% this time. We wont close the economy again, so yea.. but this volatility will last for a long time.", "score": 2, "replies": []}]}]}]}, {"body": "i dont understand why people are so angry when ever someone mention that the stock might crash or drop. I get fed is printing money, but for those of you young investor with mindset that the stock market will never drop again, you guys are shooting yourself in the foot. look at it from both sides and dont refute other peoples claim just because it doesnt allign with what you think. if you only think you are right you are gona get burned hard. Its like people investing in Hertz. what are you people even thinking? gambling your money in a game of musical chairs?", "score": 4, "replies": [{"body": "Hertz is a total pump from big money to suck in inexperienced investors whom will get burned. Same for NKLA", "score": 2, "replies": [{"body": "NKLA basically spent the whole week at 60 or above. Personally, I sold my initial investment and I’m holding some shares with house money now. I don’t know what to think of it at this point honestly—I certainly agree it makes no sense. But I don’t think it’s a P&D in the traditional sense?", "score": 1, "replies": []}]}, {"body": "I learned in past few months that we are dealing with so many rookies who poured in and are mirroring recommendations, completely blindly. \n\nWe are in for a drop to make all drops this week. \n\nOh yeah, and then add all the bearish technicals! Yummy!\n\nSpy puts, Vix calls.", "score": 1, "replies": []}]}, {"body": "I'm going to be taking a shit that day regardless. Maybe it'll be a good one or explosive diarrhea.", "score": 2, "replies": []}, {"body": "buy dem dips!", "score": 0, "replies": []}]}
{"title": "Barbra Streisand gives George Floyd's six-year-old daughter a shares in Disney (DIS)", "selftext": "[removed]", "id": "h9efp5", "created_utc": 1592220335.0, "score": 1, "upvote_ratio": 0.54, "num_comments": 23, "comments": [{"body": "Sooooo what’s his family worth at this point? $20 million and rising?", "score": 7, "replies": []}, {"body": "Most likely it will gain a lot more than 23% by then. For most stocks, the majority of the gains don’t come from dividends", "score": 3, "replies": [{"body": "True. And I am surprised that article didn’t mention this.", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Is that what happened to you?", "score": 1, "replies": [{"body": "It happened to me! 😭", "score": 1, "replies": []}]}]}, {"body": "Whole bunch of salty twats in the comments", "score": 9, "replies": [{"body": "Foreal imagine being mad that a rich person donated something to a girl who lost her father, violently on camera.\n\n\nRidiculous ass people in here", "score": 9, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "and your name is Chad.", "score": 7, "replies": []}]}]}]}, {"body": "I had no idea this sub was so full of hateful fucks", "score": 4, "replies": []}, {"body": "Some shitty mofos in comment section but it’s a free speech world so let’s karma do the work", "score": 3, "replies": []}, {"body": "What a load of shit", "score": -3, "replies": []}, {"body": "[removed]", "score": -6, "replies": []}, {"body": "lmao. What did she do to deserve this? Just because you're a victim, it doesn't make you a hero.", "score": -8, "replies": [{"body": "White guilt. All sorts of famous and wealthy come out of the woodworks and do this shit all the time.   Society are a herd of sheep and focus on whatever the media is pumping out.\n\n\nLook at the Kobe thing for example. You do know other people died in that helicopter crash but all you’ll hear is Kobe and his daughter. 7 other people...Yes, it’s horrible what happened but the media is going to pump what sells. It’s all bullshit.", "score": 8, "replies": [{"body": "Or maybe it's been so highly publicized that it touched the hearts of many people, including rich celebrities who have enough money to help make sure the affected child gets opportunities", "score": 4, "replies": []}, {"body": "In Toronto where Im from, a crazy black bitch recently had a mental breakdown and the police were called. While the police were trying to intervene, the dumb bitch jumped out the balcony and killed himself. Obviously the dumb bitch's family cried pOliCe BRuTaLITy! Da pOliCE kiLLeD OUR dAugHTeR!! An investigation later concluded that the bitch jumped on her own and that police were at no fault. Obviously the public being the retards they are raised money and gave it to the dumbass bitch's family totalling a couple tens thousands of dollars lmao. So this dumb bitch decided to kill herself and she is now a national hero? What a fucking joke.", "score": 0, "replies": [{"body": "There’s plenty of examples of that but since it goes against the narrative that people care about...nobody cares. It’s all bullshit.\n\nI knew someone that got their ass jumped in Philly. Bunch of black kids jumped a white kid. Nobody cared...basically he was in an area he shouldn’t have been. But reverse that and you’d have some justice warrior screaming to have those kids locked up and punished.", "score": 2, "replies": []}, {"body": "Who did that investigation?", "score": 1, "replies": []}]}]}]}, {"body": "Ooof lots of butthurt white people in the comment section. You love to see it", "score": -4, "replies": [{"body": "Hey this person can determine race from text! That's a neat trick!", "score": 6, "replies": [{"body": "Race from text, is that a new Android feature?", "score": 1, "replies": []}]}]}, {"body": "I hope Disney tanks now", "score": -12, "replies": [{"body": "Im a disney shareholder and even im hoping for this", "score": -1, "replies": []}]}]}
{"title": "Why the stock market needs to rally 100% or...", "selftext": "Why the stock market needs to rally 100% or bonds need to fall 60% to  match each other.  What ultimately determines  an assets price is it's return (combination of dividend/appreciation) to an investor and the likelihood that that investor will receive their initial investment back. As you can see from these to long term charts, the spread between bond yields relative to stock yields are at 70 year extremes. Given that the bond market is larger than the stock market, it is prudent to pay more attention to what's happening to bond yields than the stock market volatility. \n\n [https://www.macrotrends.net/1319/dow-jones-100-year-historical-chart](https://www.macrotrends.net/1319/dow-jones-100-year-historical-chart) \n\n&#x200B;\n\n [https://www.icis.com/chemicals-and-the-economy/2018/01/us-treasury-benchmark-yield-heads-4-30-year-downtrend-ends/](https://www.icis.com/chemicals-and-the-economy/2018/01/us-treasury-benchmark-yield-heads-4-30-year-downtrend-ends/) \n\n&#x200B;\n\nThis is obviously not a short term timing signal and as recent market volatility has shown, the retail-trader-heavy stock market is subject to extremes in emotional buying and selling but eventually, yield is yield and they will pull back to parity.", "id": "h9g4nv", "created_utc": 1592226897.0, "score": 10, "upvote_ratio": 0.65, "num_comments": 28, "comments": [{"body": "How about this take, both stocks AND bonds are in massive bubbles, way over-priced, and both are due to deflate. Perhaps one will a lot more than the other, but if you think a 60% sell off in bonds, raising interest rates quite a lot, wouldn't also cause stocks to tank... The situation could feed on itself, and both could go down a ton. Unless you're expecting hyper-inflation type scenario where stocks go up a lot, bonds go down a lot, and the price of everything else goes up much more...?\n\nAlso Fed / Central Bank manipulation is making no free market fundamentals matter since 2009.\\\n\nSo yeah, maybe stocks DO rally 100%, but so does the price of everything else you buy (if not more so..), meaning you gained nothing. Better than being in cash, definitely better than being in bonds which would get obliterated by such inflation, but your best place to be by far in that situation would be gold/silver, not stocks.", "score": 1, "replies": [{"body": "  \nYes on the inflation part. I expect the dollar to get hit hard. It's been filling out my favotite bear pattern since way before covid-19. From the perspective of us on deck a sailboat, bonds and stocks are rising like the man climbing the mast of a sailboat, but from the perspective of those on shore, the man is not rising at all as the boat he is on is sinking. Gold and silver are crap investments and always have been. Buy iron miners and oil companies with oil in the ground like OXY, Marathon, Oasis.", "score": 1, "replies": []}]}, {"body": "Rally is not happening anytime soon. Pay attention to what's happening around the world as well.", "score": -11, "replies": [{"body": "This didn’t age well", "score": 4, "replies": []}, {"body": "Reading all of these bullish posts makes me question my gut feeling that shit is about to hit the fan.", "score": 1, "replies": [{"body": "Actually, I advised 3 months ago that this was a 1987 style crash;\n\n [https://www.reddit.com/r/stocks/comments/fjrxyd/anyone\\_other\\_old\\_traders\\_smell\\_1987\\_happening/](https://www.reddit.com/r/stocks/comments/fjrxyd/anyone_other_old_traders_smell_1987_happening/) \n\nYou might want to check your charts and see how that one returned to new highs in 2 years.\n\n&#x200B;\n\nand I'm not a permabull either;\n\n [https://www.reddit.com/r/stocks/comments/esep5f/classic\\_blowoff\\_top\\_in\\_the\\_market/](https://www.reddit.com/r/stocks/comments/esep5f/classic_blowoff_top_in_the_market/)", "score": -5, "replies": [{"body": "In regards to this being similar to 1987, isn't there a big difference because of Covid this time around? I'm asking sincerely, for educating myself.", "score": 1, "replies": [{"body": "In 1987 we had an unrelenting rally. I felt the desperation to buy then but we never had a pullback. I was to green of a trader to understand the meaning at the time. The biggest lesson I learned from 1987 is it really wasn't much of a crash when you consider it only erased 1 year of  euphoria. There is a very important lesson there and it's not BTFD. If you want to learn about markets, you need to study this, I won't be giving the concept out but you can figure it out.", "score": 0, "replies": []}, {"body": "Covid19 is a set of symptoms purportedly caused by the SARS COV 2 virus. The symptoms are generic enough that nearly any illness could be considered potentially covid19 leading many to jump to assumptions without tests. This inflated the death toll.\n\nEliminating comorbidities... where people would have died of something else, anyways, and the danger is diminished further.\n\nNo test was up to snuff until March. Prior to March, they were literally using SARS COV tests. \n\nAntibody tests are still way too imprecise. Your immunoglobin develops a CR3022 protein to block the S spike protein from SARS COV 2. This is what the antibody test looks for. The problem is that all corona virus species and strains that affect humans have the S spike protein, albeit an amino acid or two off. The human body reacts the same. So, even the corona virus species that causes the common cold shows as positive for the antibody tests. This drastically inflates the cases.\n\nTo make matters worse, the next best test explains in its instruction manual that SARS COV will red as positive, as well, because the strains are so similar. These are PCR tests.\n\nThis means the only true test is a full genome sequencing. Last I checked, there are only 500 SARS COV 2 strains in the BLAST database.\n\nWhat this all means is that the media hyped intentionally faked models as fact and is trying to do so again. The media is powerful enough to cause a temporary pricing in, but more people are aware it is a scam, and are investing accordingly.\n\nPersonally, I put every spare dollar I had in the market when Tesla went under $400, and I had more than chump change.\n\nI cashed out many times on the way up, and heavily reinvested last Thursday,  because I know this second wave is a scam, too. So, while people are skeptical of my easily verifiable science, there is money to he made in getting ahead of the shills.", "score": -7, "replies": [{"body": "Overall death rate is up massively globally. You're simply wrong about questioning how much of an impact COVID is happening, and most of the dead are being tested, especially now (and those numbers ain't falling by much...).", "score": 4, "replies": [{"body": "My science is rock solid.", "score": -2, "replies": []}]}, {"body": "You used a lot of 'correct' language which may mislead any lurkers reading this thread but I don't think you know what you're talking about. \n\nI'm a bit tired now but would love to pick apart some of those statements you made because I'm curious of how you can talk so confidently about something you have a very basic understanding of.", "score": 3, "replies": [{"body": "Oh fuck off, look it up if you don't believe me.", "score": -1, "replies": [{"body": "'Covid19 is a set of symptoms purportedly caused by the SARS COV 2 virus. The symptoms are generic enough that nearly any illness could be considered potentially covid19 leading many to jump to assumptions without tests. This inflated the death toll.'\n\nNope, covid19 is the disease caused by SARS-CoV-2. It's not a set of symptoms that can be linked to other diseases, that's stupid.\n\n'Eliminating comorbidities... where people would have died of something else, anyways, and the danger is diminished further.'\n\nAgreed, unless you are one of the quarter of Americans that can be considered a risk group and you are under 65 you have less to worry about.\n\n'No test was up to snuff until March. Prior to March, they were literally using SARS COV tests.'\n\nThis isn't true at all? The genome was released from China early January and the RT-PCR tests came out shortly afterwards. It was available in the US by February. I don't know what your talking about with them using the SARS-CoV test? \n\n'Antibody tests are still way too imprecise. Your immunoglobin develops a CR3022 protein to block the S spike protein from SARS COV 2.'\n\nImmunoglobulin is a protein that is produced by immune cells, it doesn't do any developing itself...\n\n'This is what the antibody test looks for. The problem is that all corona virus species and strains that affect humans have the S spike protein, albeit an amino acid or two off. The human body reacts the same. So, even the corona virus species that causes the common cold shows as positive for the antibody tests. This drastically inflates the cases.'\n\nI couldn't find any evidence of that. Do you have a source? Also the S protein is quite distinct from other Coronaviruses that infect humans and is mostly similar to SARS-CoV which is irradiated so your statement doesn't seem that plausible. There is a higher false positive with this antibody test of up to 14% but there are also a number of false negatives for the conventional PCR test so I don't think the numbers are that off. Also given the bottleneck in testing I would say the number of true cases is a lot higher than the confirmed cases.\n\n'To make matters worse, the next best test explains in its instruction manual that SARS COV will red as positive, as well, because the strains are so similar. These are PCR tests.'\n\nOK but if someone has SARS-CoV then we have a massive fucking issue right? Like what are you saying with this point? Don't worry it's only another more deadly disease we thought we irradiated years ago!\n\n'This means the only true test is a full genome sequencing. Last I checked, there are only 500 SARS COV 2 strains in the BLAST database.'\n\nA) no, you don't need a full genome test to confirm the presence of SARS-CoV-2. The virus is unique enough that it can be detected by amplifying a small region of the genome. B) what is you point about the whole genome sequencing of 500 strains?\n\n'What this all means is that the media hyped intentionally faked models as fact and is trying to do so again. The media is powerful enough to cause a temporary pricing in, but more people are aware it is a scam, and are investing accordingly.'\n\nNo there is much credible data being released from reputable sources. You can question the medias interpretation of this data but not the data itself as an aggregate.\n\n'I cashed out many times on the way up, and heavily reinvested last Thursday,  because I know this second wave is a scam, too. So, while people are skeptical of my easily verifiable science, there is money to he made in getting ahead of the shills.'\n\n'Your science' is shaky and naive. It is also verifiably wrong. If I wasn't on my mobile I would post a bunch of links but to be honest just a quick Google on each of your points is enough for the layman. It's great that you're making money in the market, your success could be attributed to many things but it's definitely not because of your understanding of basic science.", "score": 2, "replies": [{"body": "Some people are doctors and infectious disease experts without a diploma or Uni, DON'T QUESTION THE RANDOM PERSON OM THE INTERNET! /s", "score": 1, "replies": [{"body": "What I would give for this guys confidence though", "score": 2, "replies": []}]}, {"body": "A disease is characterized by a set of symptoms, tard. Way to show you have no education right off the bat.", "score": 1, "replies": [{"body": "OK so why did you say 'Covid19 is a set of symptoms purportedly caused by the SARS COV 2 virus'. You are saying it IS a set of symptoms, I'm saying you are confused and that it is a disease CAUSED by the virus SARS-CoV-2. The symptoms can be used to diagnose the disease but you can still have the disease without the set of symptoms. \n\nMy background is science, but maybe you can educate me with your cool new take on how viruses work? You seem like you know what your talking about!", "score": 1, "replies": [{"body": "My background is neuroscience. So, now what?\n\nI literally just used publicly available information from Johns Hopkins and the test kit directions. It is all easily verifiable.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Why are all the investing subs so toxic? Guy literally just states his opinions and gets -10 instantly.", "score": 0, "replies": []}, {"body": "L O S E R", "score": -1, "replies": [{"body": "Says the loser.", "score": 1, "replies": []}]}, {"body": "Why do you open your mouth about something you are clearly unqualified to talk about?", "score": -6, "replies": [{"body": "They didn’t open their mouth they typed a comment. Now maybe they had their mouth open when typing the comment but that’s beside the point.", "score": 1, "replies": []}]}]}]}
{"title": "RE: a July earnings report blood bath, I'm feeling like I should exit all of my cruise/airline/retail/energy stock and sit half Amazon/half cash until at least August or so", "selftext": "[deleted]", "id": "h9igj3", "created_utc": 1592234723.0, "score": 17, "upvote_ratio": 0.77, "num_comments": 28, "comments": [{"body": "sold all my cruise lines already before the crash.\n\nmade bank off of them though.\n\nStill holding Boeing though. that I don't plan on selling anytime soon.", "score": 13, "replies": [{"body": "Boeing holds defense contracts with the DOD and pentagon too, not just commercial air travel.", "score": 5, "replies": [{"body": "yeah that's why I am holding.\n\nAlso,  SPACE-FORCE!!!\n\nhttps://boeing.mediaroom.com/2020-05-17-Boeing-built-X-37B-Launches-in-Second-Mission-for-U-S-Space-Force", "score": 4, "replies": []}]}]}, {"body": "So you intend on exiting the market & buying back in when things are back to nominal? Feel free, happy to buy your shares now.", "score": 54, "replies": [{"body": "Imagine believing you have special insider information to trade with because you know cruise line earnings will be down in Q2.", "score": 5, "replies": [{"body": "Of course earnings are going to be down: No shit! I'd even say they'd be zero. \"We\", or the market at least, is making very sizable bets on companies losing ~$1-5b a quarter. Can cruise lines stomach a loss for a quarter and rebound significantly afterwards? Can they raise debt in the short term?\n\nAre there going to be other opportunities to buy into CCL (and similar entities) at $9? $11? $14? $19? \n\nIs the opportunity cost of staying in worth it? \n\nThese are all personal questions to ask yourself, among a sizable list of other questions. There's no magic hat.", "score": 3, "replies": [{"body": "There is no magic answer, but there is more certainty about some of these things than some might be appreciating here.", "score": 1, "replies": [{"body": "Well, for the most part it's all built atop this to begin with:\nhttps://www.gao.gov/americas_fiscal_future", "score": 1, "replies": []}]}]}]}]}, {"body": "The sectors you just mentioned are all long holds especially cruises and airlines. You need to have a strategy when buying those stocks and if your goal was to make bank in the short term you miscalculated. Understand what you are buying and the shelf life needed for maximum value. Those stocks will go back up but it will take time. Amazon is solid so sitting on that is fine. Depending when you got in on the airlines and cruises, I suggest sit, unless you bought after the rise. And I’ll add this, ER reports for airlines count for ticket sales which usually is 3 months in advance of departure date. Tickets during the heart of corona for future travel were cheap as hell and a lot of people were scooping them up. Depending what airlines you own, the ER’s might not be as bad as you may think.", "score": 7, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "I have given that some thought but the airline industry as a whole will remain intact. It’s essential. Micro level single companies are the ones to watch out for. I wouldn’t touch a company like American Airlines due to their debt ratio. Companies like Spirit will survive since they don’t depend on business travel and offer a low cost base with a billion still in cash. Companies like Delta and United will survive based off their books. It really depends which airline you dive into. I don’t touch cruise lines because I agree, that could change forever but airlines will remain for the long haul.", "score": 5, "replies": [{"body": "That’s what they said about Pan-Am airlines.....", "score": 2, "replies": [{"body": "He just said that there are airlines he wouldn't touch. AAL is today's Pan Am.", "score": 1, "replies": [{"body": "I owned AAL up until February, so I don’t really know what I’m doing. I’d still rather buy Boeing or Lockheed Martin before any of the other airlines any day.", "score": 1, "replies": []}]}]}]}, {"body": "Normalcy bias is real.", "score": 1, "replies": []}]}]}, {"body": "This blood bath everyone has been talking about is dragging out for 3 months now", "score": 3, "replies": []}, {"body": "I suppose you bought airlines at a late stage . I bought jet blue in April for $8 plus , then it shot up to $10, didn’t want to risk to plummet when q3 results publish so I sold it for a decent profit", "score": 2, "replies": []}, {"body": "Time in Vs timing", "score": 2, "replies": []}, {"body": "i think you might be right. if you own airlines / cruises, pretty bearish after reading [this](https://www.zaginvestor.com/should-you-invest-in-airline-stocks-today/).", "score": 2, "replies": []}, {"body": "Sounds like a very good plan to me.", "score": 1, "replies": []}, {"body": "If you got in on all these stocks at good low prices, just hold until all this uncertainty is over and the companies recover, which they eventually will.", "score": 1, "replies": []}, {"body": "Good idea", "score": 1, "replies": []}, {"body": "sell sell sell", "score": 1, "replies": []}, {"body": "Definite blood bath", "score": 1, "replies": []}, {"body": "Earnings will make no difference", "score": 1, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "EPS ESTIMATE -800 dollars a share\n\nACTUAL -799 a share \n\nStock up 15% next day. \n\nLearn the system", "score": 6, "replies": []}, {"body": "Stocks shot up after disastrous Q1 earnings, why would Q2 be any difference. Majority of public companies pulled guidance so they won't even be talking about Quarter over Quarter or Quarter over Previous Year quarter performance.\n\nJuly is when you want to be in the market. Big hollywood releases are coming back (mulan & tenet) and sports are returning.", "score": 4, "replies": []}, {"body": "Of course. The whole world hasn't worked for 3 months", "score": -1, "replies": []}]}]}]}
{"title": "Let’s talk WMT (Walmart) - surpassed q1 earnings, stock has continued to fall since, thoughts?", "selftext": "Why is this? Isn’t Walmart set up to have a rocking q2 report with everyone buying so much more at the store these days? \n\nIsn’t Walmart at a great discount right now, or am I missing something?", "id": "h9mpjf", "created_utc": 1592248254.0, "score": 1, "upvote_ratio": 1.0, "num_comments": 24, "comments": [{"body": "They are trading at the same price they were at when the year started. Do you think they are a noticeably better company than when the year started?\n\nDont make this mistake of focusing on how a company moved immediately after earnings while ignoring all the other movements that have happened in a timeframe. The stock fell after earnings but it also went sharply up **before** earnings. The stock had jumped up 10% because of the pandemic (one of the few stores open).\n\nFrom the perspective of all of 2020, there hasn’t been a decline at all. If the stock price had just stayed flat at $118 instead of jumping up and then back down you probably wouldn’t even notice.", "score": 8, "replies": []}, {"body": "Walmart is like the one chick in high school no one wanted. Don’t wait until she ages- pluck that flower now!\n\nWait? That’s a tad suspect of me. Disregard the above and just give WMT your money! At $117 it is a great short or long.", "score": 6, "replies": [{"body": "That’s what I was thinking. You look at all these other companies doing far less and at much higher prices", "score": 4, "replies": []}]}, {"body": "I think they also merged/collabed with shopify for a better online shopping experience.", "score": 5, "replies": [{"body": "And that affected them in a bad way? Wouldn’t you expect good stock outcomes to come from\nThis type of news", "score": 1, "replies": [{"body": "No, i was implying that the merge may have a positive affect.", "score": 3, "replies": [{"body": "Right right", "score": 1, "replies": []}]}]}]}, {"body": "I'm a buyer and bullish on Walmart.", "score": 5, "replies": []}, {"body": "building a leap fortress one week at a time with plenty of money in the clip", "score": 3, "replies": []}, {"body": "I work at Walmart as a stocker and I'll give you my perspective, whatever it's worth. \n\nGrocery is selling and the shelves have a lot of holes. The profit margin of grocery is among the lowest in the store. I'm not sure why we can't keep the shelves full. We are selling a lot but it's not as much as a normal holiday season, which makes me think it's a supply side problem. \n\nThe general merchandise sales are down. They have come up a little in the last couple weeks but it is still noticeably down. Seasonal merchandise sales have dropped off a cliff though, and they are some of the highest profit margins in the store. We are getting back to school stuff in two weeks and I don't know how well that is going to sell. Schools in my area still haven't confirmed how school is going to work in the fall.\n\nBlack Friday has been less and less busy in recent years, and I can't imagine how it's going to look this year. Holiday food sales are also questionable. Will people buy more because they want the comfort of a holiday meal, or less because less people will have big gatherings? \n\nI still do the company stock purchase every paycheck, but I think wmt has a lot of uncertainty in its future.", "score": 4, "replies": [{"body": "Great thinking of you to buy in to the company with each paycheck. It’s not often that line level jobs get the option to invest in the company that they work for or can afford to go without that money. I appreciate your input and I do think that amazon is really stealing a lot of those high-profit items.\n\nPeople don’t 100% trust buying food on amazon, but that electric shaver, a laundry basket, a new bike? Yep amazon has that covered", "score": 2, "replies": []}]}, {"body": "I have very similar thoughts on them. They are being overlooked and I bought in anticipating how they plan to adapt (I believe they will).", "score": 3, "replies": []}, {"body": "I'm a buyer if they reach the low 100s again. Evaluation wise, they are a tad expensive right now. I'm looking for a pe ratio between 10-13 before I jump in. Annual revenue has been increasing year over year albiet it is slowing down. EPS, EBITDA, were all slowing down pre covid.", "score": 2, "replies": [{"body": "Thanks for the objective outlook!", "score": 2, "replies": []}, {"body": "Think KR is a good value buy?", "score": 1, "replies": [{"body": "Meh. Kr doesn't excited me. Beta is like 0.38 so this stock doesn't move much. Valuation wise, I think they are decent. Not expensive and not cheap. They do pay a dividend but again, it's nothing exciting. They seem to be cyclical. From a technical standpoint, I would jump in in the low 20s if they ever dip down there again.", "score": 2, "replies": []}]}]}, {"body": "It is one of the few stocks with with positive earnings and accettable PE ratio.\nI think price is correct now.", "score": 2, "replies": []}, {"body": "I’ve been eyeing this stock as well.  It’s actually trading slightly red YTD by about (-$1)\n\nIf it beat Q1 Earnings shouldn’t the price be higher than what it was at the beginning of the year? Just looking at the yearly chart. It has been growing every year, and it seems like they had a lot of growth in e-commerce (74%).  Maybe I’m missing something here, but was WMT overpriced when it began the year? Is it overpriced now? Not sure what the fair value of this stock actually is", "score": 2, "replies": [{"body": "Same!", "score": 1, "replies": []}]}, {"body": "You can only miss something when you’ve run the numbers and actually missed something.\n\nApart from your general feeling towards WMT, why do you think it’s undervalued based on your own fundamental analysis?", "score": 1, "replies": [{"body": "Well considering it’s huge market share outside of amazon, and the fact that everyone has been buying up groceries for 4 months straight now, disproportionately to previous times, I feel their earnings will show great results. \n\nLooking back at their previous earnings report they had a massive sell-off the day after earnings which is normal, but usually more normal for companies who perform badly. \n\nI guess I’m surprised by those results and figure that it’s under-valued given the amount of revenue they process. I guess it’s a different ballgame for grocers though as their margins are for more slim to tech. \n\nThey definitely have huge overhead with all the stores and the shipping they must go through.", "score": 1, "replies": []}]}, {"body": "Stochastics point to WMT being a short", "score": 1, "replies": []}, {"body": "Wmt is too stable.", "score": 1, "replies": []}, {"body": "what about their partnership with thredup too", "score": 1, "replies": []}]}
{"title": "Tesla deploys new Megapacks at 'WindCharger' project", "selftext": "", "id": "h9eqj1", "created_utc": 1592221589.0, "score": 160, "upvote_ratio": 0.99, "num_comments": 22, "comments": [{"body": "Another exciting part of the TSLA business!", "score": 32, "replies": [{"body": "For sure, I think a lot of people forget that Elon has said he expect the energy business side og Tesla will be as big as the EV part of Tesla", "score": 2, "replies": [{"body": "I’m not sure why people think Tesla is an EV company. They are a battery and tech company.", "score": 1, "replies": []}]}]}, {"body": "This is where I live. I'm really stunned and happy that this happened. It's oil country! The hockey team is called the OILERS after all. This is so great to see us developing some of our other natural resources\n\nEdit: Ok I checked, and although that is my power company this is sadly 5 hours south of me. LAME. Lots of wind in those parts though, this could do well", "score": 17, "replies": [{"body": "Looks like you’re on duty for drone updates then", "score": 13, "replies": []}, {"body": "Time to rename them the Chargers then.", "score": 10, "replies": [{"body": "Hahaa I can't wait for that day!", "score": 3, "replies": [{"body": "Wait? Nothing happens by waiting. Make it happen! Once the newspaper writes about it being active, send in a short well drafted letter making the suggestion. More appropriate for a better future and a very apt name for a sports team. They will publish it because it is original. (Don’t forget to mention Tesla :-))", "score": 4, "replies": []}]}, {"body": "What about the San Diego chargers. Although that is football", "score": 1, "replies": []}]}, {"body": "Can you make some pictures or videos?! 🤩", "score": 1, "replies": []}]}, {"body": "hell yeah", "score": 7, "replies": []}, {"body": "How much did this net Tesla when they did this in Australia? Possible profitable q2??", "score": 3, "replies": [{"body": "IIRC the Australia battery was initially sold at cost, there was barely any profit in it upfront.  although since then its been extremely profitable for the grid operator and they have since expanded. It was POC that has led to other utility scale battery deals too.", "score": 2, "replies": [{"body": "Is Tesla getting a cut of the profits then?", "score": 2, "replies": [{"body": "From my understanding, Tesla was not being paid fairly for it until recently when they came out with their autobidder product, and I don't think the project is profitable from day one because of lease accounting. I need to do more research, but Zack and Jesse from Now You Know on youtube will probably talk about it next week:\n\n [https://electrek.co/2020/04/17/tesla-completes-massive-expansion-big-battery/](https://electrek.co/2020/04/17/tesla-completes-massive-expansion-big-battery/) \n\n \"It has proven so efficient that it reportedly should have [made around $1 million in just a few days](https://electrek.co/2018/01/23/tesla-giant-battery-australia-1-million/) in January of 2019, but [Tesla later complained that they are not being paid correctly](https://electrek.co/2018/03/22/tesla-powerpack-battery-too-quick-to-get-paid/) because the system doesn’t account for how fast Tesla’s Powerpacks start discharging their power into the grid.\n\nThe system is basically a victim of its own efficiency, which the[ Australian Energy Market Operator (AEMO) confirmed is much more rapid, accurate, and valuable than a conventional steam turbine in a report ](https://electrek.co/2018/04/09/tesla-giant-battery-system-praised-energy-market-operator/)published in 2018.\"\n\n [https://electrek.co/2020/05/03/tesla-autobidder-new-product-electric-utility/](https://electrek.co/2020/05/03/tesla-autobidder-new-product-electric-utility/) \n\n \n\n>*\"Autobidder is succesfully operating at Hornsdale Power Reserve (HPR) in South Australia, and through market bidding, has added competition to drive down energy prices.*\n\nWhile it is known as the “Tesla Big Battery” because it uses Tesla’s Powerpacks, it is owned by Neoen, a French renewable energy company that also operates a wind farm next to the battery system.\n\nSo Tesla not only deployed the Powerpacks for them, but also provides them with this Autobidder software.\"", "score": 2, "replies": [{"body": "I remember reading that article back in January of last year. My understanding from that was that they were saying that the battery operation(for lack of a better term)  as a whole should have made that $1 million, not Tesla, and that the battery operation isnt being paid correctly by the grid, not that Tesla isn’t being paid correctly by Neoen. Did I read it wrong? Now that it’s pointed out, I can see either side of that.\n\nI’d definitely be interested to hear them talk about it on YouTube", "score": 1, "replies": []}]}]}]}]}, {"body": "Neoen plans world's biggest battery near Geelong. Neoen owns the current largest Li-Ion battery project - Australia's Hornsdale battery farm.\n\n[https://www.afr.com/policy/energy-and-climate/neoen-plans-world-s-biggest-battery-near-geelong-20200429-p54o96](https://www.afr.com/policy/energy-and-climate/neoen-plans-world-s-biggest-battery-near-geelong-20200429-p54o96)\n\n\"The $300 million battery will be capable of generating 600 megawatts of power – four times the size of Tesla's big battery at Neoen's Hornsdale Wind Farm in South Australia, or just less than half the maximum power output of the Yallourn coal-fired power station in Victoria's Latrobe Valley.\"", "score": 5, "replies": [{"body": "That’s behind a paywall. Are they going with Tesla again for the new battery that they have planned", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "No, it will need to be paired with renewables, or grid fed and used as a backup / balancer.", "score": 1, "replies": []}]}]}, {"body": "Je suis canadien", "score": 3, "replies": []}, {"body": "And in comes CleanSpark! 🤞", "score": 1, "replies": []}, {"body": "Curious to see what developments Tesla will make in the energy and battery business.", "score": 1, "replies": []}]}
{"title": "The Robinhood top 10 Daily Positions Bull ETF ($RTD)", "selftext": "Good morning ladies, gentlemen and fellow autists, have you ever wondered if the genius day traders in robinhood are netting positive or negative?\n\n# Well your questions are just about to be answered with the [Robintrack daily top 10 Positions ETF](https://github.com/kendricksin/robintrack_ETF/blob/master/robintrack_ETF.py) written by yours truly.\n\nThe code is long and inefficient, done within a period of 3 hours, poorly annotated, so please have a go if you like it.\n\n&#x200B;\n\n# How does this ETF work?\n\nBasically, this ETF measures the quality of the decision, when bought or sold relative to today (6/12).\n\nHere are some examples:\n\n**Example 1** \\- (buy low, now high): When bought = 5, today's price = 10, traded = 1 - 5/10 = 0.5\n\n**Example 2** \\- (buy, high, now low): When bought = 15 today's price = 10, traded = 1 - 15/10 = -0.5\n\n**Example 3** \\- (sold low, now high): When sold = 5, today's price = 10, traded = 5/10 - 1 = -0.5\n\n**Example 4** \\- (sold high, now low): When sold = 15, today's price = 10, traded = 15/10 - 1 = 0.5\n\nThis is a problem because you could have closed the position at better price point than today, but remember, this is just a hindsight algorithm.\n\n# Conditions:\n\n(1) Algorithm starts trading on 1/1 which is approximately the time where TSLA doubled and robinhood bois wet their pants.\n\n(2) Algorithm assume that you bought/sold the asset and diamond handed it till 6/12 (and closed the position), like a genius robinhood trader.\n\n(3) Only the top 10 increase/decrease in positions posted on [robintrack](https://twitter.com/robintrack) twitter page is considered.\n\n(4) Algorithm uses the Adjusted close from yahoo finance API (!pip install yfinance).\n\n(5) Only tickers mentioned more than twice (since 2019) are considered.\n\n# Findings:\n\n(1) Assuming you entered a $1000 position (long or short) each time a top 10 increase/decrease flashes in robintrack twitter, and closed all those positions today:\n\nYou would have only lost **$112k** after trading 3450 trades ($1k each).\n\n&#x200B;\n\n(2) The top gains are as follows:\n\nhttps://preview.redd.it/ysceetshd1551.jpg?width=1557&format=pjpg&auto=webp&s=5b877abd6c87e401c02ff17b59caced8c985329c\n\nObviously AAL, NCLH, and CCL yolos have paid off.\n\nApparently alot of JDST (gold bear 2x) and UGAZ (natural gas bull 3x) was sold at its peak.\n\n&#x200B;\n\n(3) Top GUHs are as follows:\n\nhttps://preview.redd.it/xxxr4cv2e1551.jpg?width=1588&format=pjpg&auto=webp&s=93bf4a71de4761e36f2457306fd20a3be66aa06c\n\nXSPA is an anomaly in yahoo finance.\n\nEnergy were pretty bad plays.\n\n&#x200B;\n\n(4) Hot tickers, that might be on your mind.\n\nhttps://preview.redd.it/8h7bur69i1551.jpg?width=1561&format=pjpg&auto=webp&s=20e875170015f387291b758f62ff79e14748bfcc\n\nThe combined decision making of RH trades made a 4x loss on NVDA, but also made decent gains on MSFT and NKLA.\n\nAlso, i did a check on MRNA (+2.2) & GILD (+0.7) it pays to join in the Biotech pump and dump simply following the RH masses.\n\n&#x200B;\n\n# Final Word:\n\nI am a novice coder, trained in mechanical engineering. If you have better ideas/suggestions please be kind. We are all here to make money.\n\n&#x200B;\n\n&#x200B;\n\n# TL;DR -\n\n# INVERSE ROBINHOOD\n\n(as if you needed a DD and data analytics to tell you that)", "id": "h9cmnl", "created_utc": 1592212188.0, "score": 102, "upvote_ratio": 0.94, "num_comments": 20, "comments": [{"body": "I've been hearing this logic being tossed around and then I realize I'm a RH autist and if I was to buy into this logic I would reverse the gains because I'm a RH autist and am contributing to this chaos theory therefore I should only buy call because stonks only go up and if I messed with chaos I'll be consumed by chaos and I'm a RH autist and I've learned that DD means nothing and stonks only go up and that I should but short terms calls only and I would upset the natural balance if I was to learn to trade smarter I would make money for my wife's bf and I dont like that guy so I should continue to use their money to fuel this dumpster fire because I'm a RH autist", "score": 46, "replies": [{"body": "keep doing it fellow autist you are moments away from becoming a legendary RH trader", "score": 10, "replies": []}]}, {"body": "ELI5 for the TLDR?", "score": 14, "replies": [{"body": "whenever you see top 10 increase in positions at robintrack, sell those.\n\nwhenever you see top 10 decrease in positions at robintrack, buy those.", "score": 33, "replies": []}]}, {"body": "Robinhood Top Movers Real time data. \n\nThey exercise higher volume than I thought \n\nhttps://robintrack.net/leaderboard", "score": 7, "replies": [{"body": "thx, gonna scrape this next, not sure if they have an API handle", "score": 3, "replies": [{"body": "I found it \nhttps://github.com/ameobea/robintrack", "score": 5, "replies": [{"body": "for my next trick, we trade weeklies based on RH popularity", "score": 8, "replies": []}]}, {"body": "Yeah we need to check it out & see how accurate it is", "score": 1, "replies": []}]}]}, {"body": "why top 10? why not top 15 or top 5", "score": 4, "replies": [{"body": "because  [https://twitter.com/robintrack](https://twitter.com/robintrack)  only tweets the top 10 increase/decrease", "score": 9, "replies": [{"body": "Just a tip, you don’t need to get the data from their tweets but instead can go to their website (robintrack) to view all the data.", "score": 10, "replies": [{"body": "what a fool i am :facepalm:", "score": 12, "replies": [{"body": "plan on increasing it more spaces?", "score": 1, "replies": []}, {"body": "And were supposed to listen to you? I’m 100% in", "score": 1, "replies": []}]}]}]}, {"body": "Do you remember how Top 8 in MySpace ruined friendships?", "score": 3, "replies": [{"body": "He wasn't born yet.", "score": 3, "replies": []}]}]}, {"body": "I HATE seeing a position of mine rise up in RH. But it is a fantastic sell indicator. Used it to bail on NKLA recently and felt great.", "score": 3, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/unikend don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Use VirtualBox to run Linux ;-)", "score": 1, "replies": []}]}]}
{"title": "A primer on valuing publicly traded growth-stage companies.", "selftext": "Seeing a lot of misinformation around ZOOM technologies ($ZM). WSB consensus is that this is overvalued, a bubble based on astronomical P/E. Maybe it is, maybe it's not, but this look at P/E or P/S is very misguided and misses the relevant drivers of valuation entirely. In fact it's a criminally bad fundamentals analysis. The error comes in the form of investments being put in the 'wrong' place on the financial statements, on the income statement hurting earnings, when in your DCF they should really be capitalized on the cash flow statement. \n\nDefinition:\n\nGrowth-stage company: A company which is reinvesting all or a significant majority of its earnings in order to generate more growth through capital investments, R&D, or SG&A. Within growth stage, we have companies whose investment takes the form of infrastructure and capital investment (early Walmart), and companies whose reinvestment takes the form of hiring engineers, salespeople, and product managers (early Facebook).\n\nA mature company: A company which is partially or totally focused on increasing earnings, and achieves this through some smart reinvestment of earnings alongside significant cost-cutting measures. Examples include pretty much any CPG company.\n \nCompanies which are capital intensive are required to generate earnings on the income statement so that they have actual money to reinvest in land, buildings, and equipment. If early Walmart had not generated cash flow, they could not have built more stores and they could not have grown. A very high P/E ratio would have signaled that the earnings potential was incompatible with the expectations baked into the stock price.\n\nOn the other hand, if investment takes the form of personnel, there is no need to actually generate earnings on the income statement in order to grow. Just enough cash + earnings to buy minimal equipment (can be very close to zero in the age of AWS), and the rest is spent on income statement expenses, and there does not need to be anything left over. Add in stock-based comp and this earnings can go negative while the cash position remains healthy. So if you take a P/E on this kind of company you get a nonsensical result. If I were a CEO at this kind of company I would try to sandbag earnings as long as possible so my stock-based comp can over time expand significantly resulting for large rewards for myself and my employees while suckers missed out on the opportunity. (Bill Gates has actually admitted to doing this).\n\nLooking at Zoom specifically, best metric to use is a DCF on gross profit less steady-state operating costs. Looking at purely a gross profit multiple we have around 100x, which will fall to around 30x-40x in just 12 months based on a growth rate of 150% and then further. We can say right away it's not a grossly overvalued company. Looking at where it traded pre-covid, it's potentially overvalued by a factor of ~2, and it could in fact be undervalued.\n\nThe drivers of valuation here are solely around the competitive landscape (Microsoft Teams being the biggest, also Zoom's current advantages/disadvantages factor in here), and the long term TAM of video-conferencing, as well as the 'stickiness' of the product -- this last one is especially important. Essentially these factors and the interplay between them will tell you whether this stock is overvalued or not. Zoom's GM is very strong which indicates a very strong business, and can't go up significantly from here. But fundamentally it's a very profitable business assuming that the aforementioned factors above can remain in its favor. \n\nI wouldn't be a buyer here given that the FAANG companies are gunning for it and I expect them to succeed eventually(stickiness determines tail value in the DCF/acquisition value and my belief is that it won't be great, but this is a model sensitivity), my advice is that it's not a short based on either fundamentals or momentum. There is no catalyst and there is no solid short thesis.", "id": "h9lzrg", "created_utc": 1592246066.0, "score": 15, "upvote_ratio": 0.83, "num_comments": 20, "comments": [{"body": "all that for no strike/expiry. \\*sad autist noises\\*", "score": 9, "replies": [{"body": "$420 6/19 C", "score": 3, "replies": [{"body": "all in", "score": 3, "replies": []}, {"body": "Your post says to sell puts though", "score": 1, "replies": [{"body": "I assure you good sir, it doth say nothing of the kind", "score": 1, "replies": []}]}]}]}, {"body": "You would be better off using the VC valuation method than the normal DCF valuation.", "score": 5, "replies": [{"body": "Is that where you pull a number out of a hat?", "score": 3, "replies": [{"body": "Find comparable companies to figure out multiples (usually EBITDA multiple), estimate market share they'll take, find terminal value, then do DCF using like 30-40% discount rate. But for the DCF, you only really care about terminal value because they'll hardly generate any material cash flow.", "score": 2, "replies": [{"body": "Seems reasonable. 30-40% discount rate seems pretty high though given that this is not a company that is in imminent danger of running out of cash. Also isn't terminal value really just proxy for an embedded DCF carried to infinity?", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "$420 6/19 C", "score": 0, "replies": []}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/Jowemaha don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "Everyone talking about ZM when it should be about ZI.", "score": 1, "replies": [{"body": "This right here is so true.", "score": 1, "replies": []}, {"body": "what about it? Think it moons like $ZOOM?", "score": 0, "replies": [{"body": "I don't think it rockets, but it's a good long term hold. Fee based B2B services are going to continue growing, and lead generation is about the most important thing during a downturn. I think we'll see them grow at the rate of SaaS.", "score": 2, "replies": [{"body": "So it's a LinkedIn competitor, right? Can be more specific than just SaaS.", "score": 1, "replies": [{"body": "That's exactly what it is, but since LNKD is no longer publicly traded, regular ol SaaS is the best comparison I can currently come up with since it's the closest we currently have.", "score": 2, "replies": []}]}]}]}]}, {"body": "that was a really long way of saying \"we hope they will make money later\"", "score": 1, "replies": []}, {"body": "https://trends.google.com/trends/explore?geo=US&q=Cancel%20zoom%20subscription", "score": 1, "replies": []}]}
{"title": "The Kangaroo Market is a trap!", "selftext": "The market makers want to condition you all to buy the dip. We will see one or two more selloffs. These will recover just as it did today. It will give everybody a false sense of security. \"I can just buy the dip. It has always worked. There is no need for hedging.\" When all of you are feeling comfortable in Kang Gang, Vix has declined and nobody is holding puts at the bottom of a dip anymore, thats when we finally drop to new lows. This way retail investors are left holding the bag, diamond handing their positions and finally selling at the bottom.\n\nPlay the Game, while it's still on. But beware, when the tune changes.", "id": "h9nsvi", "created_utc": 1592251671.0, "score": 108, "upvote_ratio": 0.89, "num_comments": 24, "comments": [{"body": ". We just get selectively released news to try and prop up the market. The rug pull is not preventable by the market movers when the avalanche gets going. The game for everyone in power is to keep the party going until the election.", "score": 58, "replies": [{"body": "[deleted]", "score": 25, "replies": [{"body": "I have small dick account but have been rotating settled funds so that I can do at least 1 FD a day and its worked from 350 to 1900", "score": 6, "replies": []}, {"body": "I'm going to go back to paper hands, I really thought we had the drop timed, but I guess not", "score": 4, "replies": []}, {"body": "How do you not lose money considering you close each day?", "score": 5, "replies": []}, {"body": "Gay", "score": 1, "replies": []}]}, {"body": "IDK man it can go on for years. The Shiller P/E ratio is \"only\" 28 on the S&P 500, it got up to like 80 in Japan before shit collapsed", "score": 4, "replies": []}]}, {"body": "Bears every other week: It's going down!\n\nBears the following week: It'll go down eventually and I'll have my vengeance!\n\n(I thought it was gonna crash this week too)", "score": 22, "replies": [{"body": "This market has the best comedic timing. It really knows how to make sure the bears don't give up and start buying calls.", "score": 7, "replies": []}]}, {"body": "The shittiest shitpost there ever fuckin was, I’m honestly impressed with the level of shit here", "score": 60, "replies": [{"body": "Thanks. I'm doing my best. BTW, why is the shitpost flair gone?", "score": 22, "replies": [{"body": "Be aware when the tune changes.", "score": 13, "replies": [{"body": "no u", "score": 2, "replies": []}]}]}]}, {"body": "Yep. This is the classic all mighty bear flag pattern. Keep buying the dip and boom. It's all gone.", "score": 12, "replies": []}, {"body": "Not sure where recover came from, several of the stocks are still going down or are flat, only some have had slight or significant increases back. \n\n&#x200B;\n\nHeck SPY and DiA only recently got back up and only went up by less than 1% at closing.", "score": 9, "replies": [{"body": "Yes but it screws options players. playing the ups and downs with actual shares is the only thing relatively safe for a little while.", "score": 15, "replies": [{"body": "Or option traders can stop over investing in indexes and switch to reliable stocks.", "score": 6, "replies": []}, {"body": "Or futures. Which turned around over night fucking all bears who held puts and couldn’t unload and were asleep with mama bear", "score": 3, "replies": []}]}]}, {"body": "A lot of shorts 🩳 were cleared out today. SQQQ and TZA had insane volume late last week. So I guess we’re going down when bulls are back in town.", "score": 5, "replies": []}, {"body": "I’m a singing Kangaroo and I’m from far away. I like to hop hop hop all day. So would you like to come and play? We’ll hop hop hop hop—what do ya say?!", "score": 5, "replies": []}, {"body": "You're so sure about this very specific plan but you can't tell me if it's going to be one or two more selloffs?  What exactly am I supposed to do with this?", "score": 3, "replies": [{"body": "Always hedge and play straddles after each selloff, instead of only puts/calls", "score": 1, "replies": []}]}, {"body": "Been trading since Jan and I'm convinced the market is a cuck fest on retail traders that don't know shit or how to do any analysis.", "score": 5, "replies": []}, {"body": "I think you're really overestimating the brand-new cringe normies. They're placing it all on household names like Nike and Microsoft.", "score": 2, "replies": []}, {"body": "....And blood will run like water and darkness will cover the land, while the bears roam free to devour our tendies", "score": 1, "replies": []}]}
