{"title": "[deleted by user]", "selftext": "[removed]", "id": "hdu32a", "created_utc": 1592838622.0, "score": 6, "upvote_ratio": 0.8, "num_comments": 21, "comments": [{"body": "They have 12.9 m customers and I never have a problem at least not yet.", "score": 6, "replies": [{"body": "Other than the login issues at open on Friday morning, I haven't had any issues with Schwab in ~10 years or so.", "score": 3, "replies": []}, {"body": "Lol don't get me wrong I don't think they're clueless troglodytes. I was just wondering if anyone else is encountering this specific issues.\n\nIf the derivatives desk picks up the phone quickly and does the trade for me I probably won't switch but I hope they get it resolved soon, I mean, I should be able to do this myself.", "score": 1, "replies": []}]}, {"body": "Since Schwab is buying out TD which used to be great and has started having bizarre problems in the last 2-3 weeks, this does not fill me with confidence.", "score": 4, "replies": []}, {"body": "I’ve had problem after problem with Schwab. Not Robinhood level of problems, but enough to make me want to move brokers", "score": 2, "replies": [{"body": "I have been fortunate, I really like them it just seems to be selling puts that has a weird issue where I cannot do the trades myself. And of course since I am new to it I find myself wondering if it's my own misunderstanding.\n\nI would hate to switch, I have been at Interactive Brokers, Scottrade, eTrade, Fidelity over the years...Charles Schwab feels the most like home to me.", "score": 1, "replies": []}]}, {"body": "thankfully havent had any clerical/technical errors. i have been trading with Schwab since 2018 and i like it so far.", "score": 2, "replies": [{"body": "I opened the account in November of 2019 (or maybe December), right after they announced the move to zero commissions. I was thinking about moving to Charles Schwab from Fidelity because of the sleeker interface, Fidelity has great customer service but their app is a bit lacking and the whole place feels less modern. But when the commissions were basically the same I didn't have a reason to switch. A few weeks later Fidelity also went to zero commissions but the switch and the fact that CS was first basically gave me the \"push\" I needed to go make the right move for me.\n\nPlus until recently I was focused on paying off debt, now that I just have it down to a couple of very serviceable payments I am switching gears to wealth accumulation and throwing money into the markets, especially since I know you only get shots at markets like this a few times in your life. My wife and I made the decision to take a bunch of money in March, April and May and throw it into the market, so far so good.", "score": 1, "replies": []}]}, {"body": "Are you using the web interface or StreetSmart edge or mobile? I have had Schwab for over 15 years, but only selling cash covered puts for the last 6 months. I have no issues(unless I am moving too fast and try to sell a naked call). Their system catches this and won't execute the trade. Their customer support is always pretty good, so I would just take some time and call to see if they can fix this on their backend.", "score": 2, "replies": [{"body": "Yeah, their customer service is really good so I just call and they're happy to help me out. Today was the second time so they said they would write a ticket with trade support and see if they can come up with what's causing it.\n\nI have the StreetSmartEdge program, but I was using the web interface. I just got the software a few days ago and I'm not quite comfortable with it. So I haven't yet used it to trade.", "score": 1, "replies": []}]}, {"body": "I did have some problems with cash requirements when I was running level 2 so I submitted for level 3.  Once I was approved for level 3 all the cash requirements issues went away.  I think they have some kind of issue with level 2 calculations.   Like you, I ended up calling the desk to get trades done.  Try getting approved for level 3 and see if it clears things up. \n\nI use Schwab and make a lot of options trades every month.  From the web interface and Smart Street Edge(SSE).  The web is a bit clunky so when I am making more complex trades I go to SSE.  SSE has other issues with options but works \"good enough\".  \n\nI was starting to look for another broker when I found they may buy TD.  Hopefully, TOS comes with it and replaces the crappy Schwab interfaces.", "score": 2, "replies": [{"body": "I applied for 3, they said I need $25K in the account to get it and they gave me 2. But that is good insight.\n\nMy goal is to get it up to $25K in the next twelve months, it's one of those things where I have more than enough overall in my portfolio but like a lot of people most of it is in other accounts (401(k), HSA, Roth IRA).\n\nThis is good insight, thank you for the comment. I have also wondered what it would look like after a merger, I've heard good things about TOS.", "score": 1, "replies": [{"body": "Until we know about TOS, I would recommend you use SSE.  Its much cleaner when executing trades.  Just be real careful when you change strikes or expirations.  It tries really hard to help and sometimes it just messes up your trades.", "score": 1, "replies": []}]}]}, {"body": "I had a similar glitch but it was due to an issue with rolling an account over from a different brokerage. Have you recently switched over to schwab?", "score": 2, "replies": [{"body": "That depends on how you define \"recently.\"\n\nI switched after Thanksgiving; about 6 months.", "score": 2, "replies": [{"body": "Gotcha. Yeah seems like sometimes the system has trouble recognizing a covered position on options. Their customer service is rock solid though", "score": 2, "replies": []}]}]}, {"body": "I had the same issue with Schwab. Long story short, they corrected it, but told me if i make more than so many trades a week, the \"money due\" will keep showing. My suggestion:\n\nYou wrote a 7/17 T option stk 28. So they lock $2,800. Buy a cheap OTM, in this case 20 at .03.  So instead of 2,800 being set aside, they will only set aside $800.", "score": 2, "replies": [{"body": "Interesting suggestion, I'll consider it. Feels kinda lame I'd have to buy an option I don't need just to get around their computer glitch. But you're right that does seem like it would work.", "score": 1, "replies": [{"body": "Whenever you come into that issue again, keep that under consideration. The far OTM i bought, i just thought of it as a small commission. Got that tip from the group /thetagang . If you are not a member already, you should consider joining.wish you success !!", "score": 2, "replies": [{"body": "Just joined, thanks!", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Lol what did I do", "score": 1, "replies": []}]}]}
{"title": "Making the switch to ETFs... here are my potential holdings. Let’s find gold", "selftext": "Built my bankroll swing trading and now it’s time to settle down and transfer my investments for the long haul. Love companies like NET, MSFT, DIS, RTX, DKNG, SHOP, TELSA. This would be my goal high risk high reward portfolio. \n\nI’ve always been anti ETF, seems like they never move and even if their biggest holdings do well they can go down.\n\nWell I cashed out my holdings in my trading app and am transferring to my big boy portfolio. Here are my holdings. \n\nFirst off screw spy and voo. Boring\n\nI went sectors I was interested in for example I love DraftKings and NET but who knows if the competition comes out of nowhere and eats them up. So let’s go with BETZ and WCLD\n\nSo here’s my ETFs I’ll be buying into and some of their top holdings.\n\nBUYZ- AMZN, SHOP, SE, BABA, Mercado-\nOnline shopping if the future\n\nWCLD- Fastly, ZM, DDOG, DOCU, Wix-\nEverything will be on the cloud \n\nBETZ- GAN, DKNG, Flutter, PENN-\nIt’s like investing in alcohol during the prohibition \n\nXNTK- Telsa, SHOP, AMZN, AMD, Activison, NVDA-\nWho doesn’t love those companies futures \n\nARKW- TSLA, SQ, PINS, ROKU-\nYou had me at Telsa and square leading an ETF\n\nARKQ- TSLA, 2U, Autodesk, Teradyne-\nIf telsa doesn’t moon one of these next gen stocks will\n\nQCLN- TSLA and bunch of clean energy stocks-\nShut up I like telsa and oil will go dry eventually right?\n\nIETC - Microsoft, Apple , FB, google-\nThis was my favorite MSFT heavy etf\n\nPPA- RTX, Lockheed, Honeywell, BA-\nDefense stock of choice\n\nFDIS- AMZN, HD, Nike, telsa, McDonald’s -\n30% Amazon\n\nPEJ- chipotle, DIS, PENN, LUV-\nFavorite Disney etf (IYC gets a shoutout here)\n\nSHE- PayPal, V, MA, Gilead, HD-\nMy banking etf with the most interesting holdings \n\nGERM- covid ETF-\nI always wanted to invest in the cure(it’s in here) \n\nPW- my REIT, holds greenhouses for solar energy and marijuana. And railroads. None of which will be affected much when people can’t pay mortgage or start working from home.\n\nI went out of the box, some of these ETFs aren’t priced super high and make it easier for me to keep adding to positions. I think the total holdings were very unique that help with the potential.\n\n\nEdit: PPH (my pharm etf) XLP (consumer)", "id": "hdk654", "created_utc": 1592795533.0, "score": 12, "upvote_ratio": 0.77, "num_comments": 30, "comments": [{"body": "I'm a big fan of PAWZ myself. Pet industry is very attractive. Idexx, Zoetis, Freshpet, Chewy, Merck. Love em", "score": 7, "replies": [{"body": "Pets are the future- pretty cool holdings too. Can I invest in a company to make my dog live forever", "score": 4, "replies": [{"body": "Crispr", "score": 5, "replies": []}, {"body": "I wish, I'd go all in", "score": 3, "replies": []}]}]}, {"body": "You have a very high concentrated bet on tech stocks. \nYou know they don't generally outperform right, and when they outperform greatly they tend to underperform later on. I don't know what your holding period Is or if this is all of your investment portfolio because if it is you should tone down tech. Boost consumer durables utilities and also stocks outside the US since other markets exist. Also gold is a pretty good diversifier", "score": 6, "replies": [{"body": "Thanks I’m looking long term. I will add gold and am looking into another healthcare and consumer sector I haven’t finished my DD to pick them . I am basically starting a new portfolio from scratch. And I’m heavy on the high risk high reward tech etfs.", "score": 1, "replies": []}]}, {"body": "big indexes and companies > sector etfs", "score": 3, "replies": [{"body": "Your not wrong, would you rather hold NET or FSLY for 5-10 years or WCLD or CLOU. I agree your probably better off investing in Microsoft than a Microsoft heavy etf. I should pick my spots with etfs I suppose. If I like Disney just invest in Disney etc", "score": 1, "replies": []}]}, {"body": "Bought BUYZ and GERM today.", "score": 3, "replies": []}, {"body": "bro the way you worded all this is fire 😂 “shut up you had me at tesla” 😂", "score": 3, "replies": []}, {"body": "All of these ETF's go well with under 40% over lap. That a look at these to add to your portfolio. \n\nVGT - .10 - APPL / MSFT\n\nMGK - .07 - MSFT, AAPL, AMZN, GOOG, FB\n\nFDN - .52 - AMZN - FB - PYPL - NFLX\n\nSOXX - .46 - Semiconductors\n\nWCLD - .45 - Cloud\n\nSKYY - .35 - Cloud (not much over lap with WCLD) \n\nIGV - .46 - Software Sector \n\nARKK, ARKW, ARKG, ARKF, ARKQ - Why not own them all?\n\nJKH - 0.30 - Mid-Cap Growth\n\nVBK - 0.07 - Small-Cap Growth\n\nMFMS - 0.85 - Outperforms both JKH and VBK but not many holdings and a much higher expense ratio.\n\nDGRO / VIG - For Dividend Growth\n\nITA - 0.46 -Aerospace & Defense", "score": 2, "replies": []}, {"body": "What platform are you buying these on? Can’t find most on mine", "score": 2, "replies": [{"body": "They are on both robinhood and TD Ameritrade.", "score": 1, "replies": []}]}, {"body": "QQQ MGK VUG SCHG in general.\n\nOr VGT ARK etfs (ARKK ARKW) a bit more specialized.", "score": 1, "replies": [{"body": "I’m in on the ARK’s and I just went with IETC over the top ones, check it out", "score": 2, "replies": [{"body": "CLOU is another cloud ETF you might wanna check that too. Also SKYY", "score": 3, "replies": [{"body": "Can’t go wrong with either. Love that they have twilio, shop and workday up there. WCLD was more diverse so I figured there’d be a few hidden gems in this “new” industry. Will consider CLOU but wanted to pick one", "score": 1, "replies": [{"body": "One more suggestion for Semiconductors: SOXX", "score": 1, "replies": [{"body": "This is the type of comment I was looking for", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Any idea why PW etf is up 20% today?", "score": 1, "replies": [{"body": "Nope, kicking myself for not investing more today. Glad my pick looks good today though", "score": 1, "replies": []}]}, {"body": "Got any Exit Strategy on GERM? I figured out that the sum of the stocks may drop drastically when one vaccine is chosen and the other 20 aren’t. I want to ride this ETF as far as I can, but any further advice is greatly appreciated.\n\nEdit: as of 7/17 I’m up 24% in less than a month. Thank you!", "score": 1, "replies": [{"body": "It’s actually a pretty diverse biotech stock. I wouldn’t worry about it. If moderna wins the vaccine race the others won’t stop. And moderna will skyrocket to offset the others initially going down. Most of the holdings aren’t vaccine companies so it’s pretty safe", "score": 1, "replies": [{"body": "Yeah, I’ve dissected the ETF a little. PFE AZN JNJ MRK , there are much bigger names which should keep it afloat.", "score": 1, "replies": [{"body": "The big holdings all went down pretty big today and germ stayed flat. Shows you it’s pretty safe", "score": 1, "replies": []}]}]}]}, {"body": "Don't sleep on PTH. PTH has some really good holdings in the innovative/momentum health sector.", "score": 1, "replies": []}, {"body": "I would love to see an ETF for US MJ MSOs but sadly there is none. There is one in Canada called HMUS. Are you interested in MJ stocks at all? Earnings season for the Big 4 US MSOs is coming up where they will report how they did Q2.", "score": 1, "replies": []}, {"body": "Did you check out QQQ?", "score": 0, "replies": [{"body": "Fantastic long hold but went with IETC because almost twice as much Microsoft exposure. Which is my favorite blue chip stock", "score": 2, "replies": [{"body": "Why not buy some outright to tilt the scales?  Since ETFs are so big and your share is so diluted, a few shares would double what you'd otherwise have.", "score": 1, "replies": []}]}]}]}
{"title": "Buying the Banks", "selftext": "I have been considering buying some of the big name bank stocks now that they seem to be in a good position to hold for long term. Anybody have a strong opinion on which is the strongest in the long term between JPM, BAC, C, USB? I have been leaning towards JPM, but with BAC down to $25 offers the opportunity to have a bigger position for the price...", "id": "hdma0v", "created_utc": 1592804608.0, "score": 2, "upvote_ratio": 0.75, "num_comments": 20, "comments": [{"body": "Alot of JPM love here, but the answer is BAC. Rather than make an argument for it I'll let Bill Nygren (one of the few value investors who saw Netflix and Google as undervalued) make the argument for me.\n\nHe has a good interview on The Investors Podcast episode 293. \n\nAlso on a site that tracks the best investors portfolios (dataroma.com). You can see that total amount invested in BAC by \"superinvestors\" is more than twice that of JPM.", "score": 7, "replies": [{"body": "Where can I find the podcast? Do you have a link?  I am also a big proponent of BAC, I would love to check out the podcast.", "score": 2, "replies": [{"body": "[here](https://youtu.be/1wXWx7W7dwY) is the YouTube link to the episode.", "score": 2, "replies": [{"body": "Thanks a lot mate!", "score": 2, "replies": []}]}]}]}, {"body": "JMP, but in the short and medium term I'd actually prefer C because its farthest from its 52 week high. Full disclosure I own both", "score": 4, "replies": []}, {"body": "Why just one? Why not JPM and some BAC and or C?", "score": 2, "replies": [{"body": "That was kind of my next thought as well. Always better to diversify at least a little bit.", "score": 2, "replies": []}]}, {"body": "Idk what the attraction is with banks? You save money there and take out real estate loans which are down at the moment. Large business loans are down too as covid.", "score": 2, "replies": [{"body": "I am talking about investing in the common stock of the banks, not putting money into the banks themselves. If you know a way to capitalize on investing in the low interest rates, I would be interested in hearing so!", "score": 1, "replies": []}]}, {"body": "Jpm", "score": 2, "replies": []}, {"body": "JPM", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "JPM", "score": 2, "replies": [{"body": "JPM", "score": 2, "replies": []}]}]}]}, {"body": "gay bear buffet sold JPM in may so", "score": 1, "replies": []}, {"body": "SMFG 🤫", "score": 1, "replies": []}, {"body": "I just am cautious because at the end of July 10 million people lose the extra unemployment money and that could land on the balance sheets of the banks auto loans home loans etc", "score": 1, "replies": []}, {"body": "Jpm is arguably the best run bank but it tends to trade at a premium. I like C better at this point I would add more in the low 40s", "score": 1, "replies": []}, {"body": "any love for Wells Fargo?", "score": 1, "replies": [{"body": "I just can't get behind them after all of the shady shit that keeps coming out about them. Obviously all banks are for profit monsters, but I know about Wells Fargo's demons because they've all been aired out.", "score": 2, "replies": []}]}, {"body": "Banks are trash", "score": -1, "replies": []}]}
{"title": "AMZN overpriced?", "selftext": "[deleted]", "id": "hdoinh", "created_utc": 1592815214.0, "score": 2, "upvote_ratio": 0.58, "num_comments": 21, "comments": [{"body": "You are buying an empire with AMZN. \n\nIf your a long term investor, then buy, hold, and don't look back.", "score": 3, "replies": []}, {"body": "its amazon. Just buy it", "score": 4, "replies": []}, {"body": "Amazon is always going to be overpriced by traditional value investing principles.\n\nI'd rather pay a premium for an incredibly high quality company like Amazon that just continues to grow and grow and is incredibly well positioned to continue to grow a lot more in the future rather than buy an undervalued company that is not of the same high quality as Amazon.\n\nPeople that are waiting for Amazon to be fairly priced will just continue to sit on the sidelines while this great company continues to take over the world. Just hop on the train and buy it already. No matter what price you buy it at, it won't take very long for Amazon to permanently grow past that price and never look back.", "score": 6, "replies": []}, {"body": "Yes it’s overpriced but buy it anyway", "score": 4, "replies": []}, {"body": "I said it was overpriced $200 ago, but it's still marching upward.\n\nAs long as Covid-19 keeps Americans indoors I think Amazon and Netflix are safe to buy, but they will both crash back down to earth real hard once there's good news on the virus front so you need an itchy trigger finger and jump on the \"sell\" button as soon as they announce a vaccine or another economic reopening.", "score": 4, "replies": [{"body": "Just to add:  I'm not saying Amazon would be a bad buy without Covid, Lord knows online shopping and media consumption is the wave if the future still and Amazon is at the forefront..  I just think the pandemic is artificially boosting the value of the stock, thus there will be a hefty correction as the pandemic winds down (probably a good $500 - $700 minimum).  If you're a long term investor, buy away but understand there will probably be a correction in the next year before it starts going up again, and it'll probably take a couple years to recover. If you're a short term investor then I think you should buy now but need to be ready to dump it at the first sign of good news.", "score": 2, "replies": []}]}, {"body": "I personally see it going to 3k but who knows", "score": 2, "replies": []}, {"body": "I will wait on a dip. Every so many weeks you see a glitch then you get in. One way to do it is  put an order good til cancel. YOu put it \\~5% below the market and you can make adjustment .", "score": 1, "replies": [{"body": "I keep saying that. But the dip never comes with AMZN.", "score": 1, "replies": [{"body": "All my purchases have been centered around 1600-1750s. Most recent was 3/13.", "score": 1, "replies": [{"body": "I am right there with you. I bought at $1710 and sold at $2400. Big. Oof. Slowly buying back in.", "score": 1, "replies": [{"body": "Good for you.", "score": 1, "replies": [{"body": "Eh. So so. I feel like an idiot.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "I learned to ride the wave. Keep an eye for price action and sell if it goes below what you are willing to risk. I bought AMZN 2 weeks ago and It’s still printing. Same thing with AAPL.", "score": 1, "replies": []}, {"body": "Does anyone here just have fractional shares in AMZN? It's way too pricy otherwise...", "score": 1, "replies": []}, {"body": "Amazon has been overpriced since 2000, but that does not mean it will drop. Historically, it is actually on the cheap side. You pay a premium to own a company with a leader like Bezos.", "score": 1, "replies": []}, {"body": "I think earnings will tell, the talk is their costs increased so much this quarter they may not post a profit, but the long term picture looks good... unless biden wins when corporate taxes will rise and antitrust issues may put breaking up the company back on Congress's agenda... Made worse if the Dems win the presidency and control of Congress. Microsoft is the winner here, less vulnerable to antitrust and totally geared to the post covid world", "score": 1, "replies": []}, {"body": "I said it was overpriced when it passed $1,000. I sold at that point right around when Brexit was announced....now look at it.", "score": 0, "replies": []}, {"body": "Honestly the next best thing would be to buy BABA which is like the amazon of Asia i personally just feel like it’s a little to late", "score": -6, "replies": [{"body": "Only 3% of IT departments leveraged the cloud prior to the crisis. AWS has room to run. Amazon still expanding its E-commerce empire and moving into Latin America and expanding in Europe. Africa largely unexplored territory....\n\nAmazon also building its own microchips now too.....\n\nZacks investment research has them growing earnings at 24% YOY for the next 3-5 years.\n\nSo what do you mean you “feel” it’s too little too late? Where’s your data or facts to back up how you “feel”?", "score": 5, "replies": []}]}, {"body": "Tesla is a better stock imo, whenver you think buying Amazon, Apple or Microsoft buy Tesla instead.", "score": -13, "replies": []}]}
{"title": "Interest shifting to foreign stocks as US equities hit full recovery prices", "selftext": "It appears to me that, unlike earlier in the COVID19 season, foreign equities aren't lagging behind US equities anymore, particularly in the past week. After looking around a bit this morning, I do find some confirmation of this, for example: \n\n* [BlackRock says it’s warming up to Europe, which it says may outgrow the U.S. in second half of the year](https://www.marketwatch.com/story/blackrock-says-its-warming-up-to-europe-which-it-says-may-outgrow-the-us-in-second-half-of-the-year-2020-06-22)\n\nMy thinking on this is two-fold: \n\nFirstly, US private corps, equities & corporate bonds have received the benefit of an enormous stimulus and practically unlimited backing by the fed and are earlier in their stock market values recovery curve than other countries' markets, so foreign stocks have room to run some more in their recovery.\n\nSecondly, the dollar is persistently the butt of disagreement over inflation/deflation threats as the result of the stimulus and economic contraction due to the pandemic. While one would expect massive inflation from so many dollars being printed, there's also deflation to consider due to possible recession, which is a function of market fundamentals driving prices and is not as divorced from the real economy as a fed-supported market recovery can be. The possibility of inflation and deflation also seems to be affected by how well the US economy does compared to other countries, making the USD a safe haven that foreign buyers will support, and foreign buyers of the USD reduce the risk of inflation. Nevertheless, there does appear to be a significant possibility of some weakening of the USD as other countries' economies begin to climb up their economies' recovery curve.\n\nA way to investors capture gains from the recovery of Europe does appear to be opting to invest in foreign stocks. But investing in foreign companies listed on the US stock exchanges as ADRs doesn't capture the currency inflation/deflation effects of a foreign investment, when the benefits of hedging vs a weakening of the USD in coming months should be one of the benefits of investing in foreign stock in these circumstances. In the past week, while looking at foreign stocks vs US stocks, my impression is that foreign stocks listed in foreign exchanges outperformed foreign stocks listed in US stocks markets, possibly because US-listed foreign stocks are subject to the same market sentiment & currency conditions as US-listed US stocks which saw some seesaw activity last week. \n\nPersonally, I have been tracking different investments in foreign stocks for a few weeks, and it seems to me that some foreign mutual funds and foreign ETFs that are not based on matching indexes, but are actively managed to select the best investments and outperform indexes, are performing better than index-matching mutual funds and ETFs. For example, Kraneshares ETF KWEB, invests in China tech stocks, and Kraneshares ETF KURE, invests in Chinese health company stocks, and they have outperformed China's broader indexes (as well as US markets, including NASDAQ) in the past week. This is also true of mutual funds, like Matthews Asia Innovators funds, MATFX, and MCSMX.\n\n[This chart compares the performance of KWEB, MATFX and MCSMX to the US market indexes SPX and NDAQ in the past month](https://imgur.com/YW1OGWR). Especially notable is how they continue to march up even though the US stock indexes appear to be slowing/consolidating near a local top in the past week. This is interesting because many US-listed Chinese stocks like BABA & JD appear to be following US market trends, which one would expect because they are held in US index ETFs and many US institutional investors also have them in their portfolios. This led to me take a second look at why the foreign ETFs and mutual funds were outperforming the US-listed foreign stocks that they supposedly hold. The answer appears to be that the more well-managed foreign ETFs and mutual funds are investing in these companies in foreign markets as local investors and not trading the US-listed stocks of these foreign companies. \n\nWhat that suggests is that we're already seeing the incremental effect of dollar inflation as part of the US market performance. And that investing in foreign stocks in well-managed, actively managed ETFs and mutual funds that are able to invest locally in foreign countries generates returns not only from room left to run in other countries' economic recovery, but that as those countries' economies strengthen, the weakening USD vis a vis those countries' currencies, that effect may make foreign stocks purchased on foreign exchanges in the other countries' currencies more valuable. A final consideration is, there is a chance of a very significant upside to holding foreign-currency-denominated stocks as [some of the more bold predictions of a weakening dollar predict a double-digit inflation move in the next few months](https://www.marketwatch.com/story/the-dollar-is-going-to-fall-very-very-sharply-warns-prominent-yale-economist-2020-06-16) (personally I see a big weakening of the USD in coming months as being possible but not inevitable, and the Fed will certainly try to fight that if it happens).\n\nI've enjoyed the 25% gains I've gotten from KWEB in the past month, and that continue to roll in. I'm now looking at very high quality, actively managed mutual funds that cover European and Emerging market stocks in a way that the funds hold the stocks as local investors, to break this approach out to other countries. As the Blackrock article, and some other suggest, it might be time to start following Europe's stimulus efforts more closely to assess what countries/companies that impacts the most. It takes more research to dig up good actively managed ETFs and mutual funds than it takes to invest in index funds, but it's not as challenging as trying to pick stocks in this fast-moving market environment.\n\nSo these are my thoughts, up for discussion. Feedback welcomed.\n\ntldr; investing in very well-managed, actively managed speciality foreign ETFs and mutual funds (and not index ETFs) is not only a way to capture returns from room left to run in other countries' recovery, but it's also a way to hedge/capture gains from some USD inflation occurring due to the massive stimulus, as some of them may offer foreign stocks purchased locally in foreign-denominated currencies so they are investments denominated in other strengthening economies' currencies, which should rise vs the USD in coming months.", "id": "hdq7nu", "created_utc": 1592823313.0, "score": 75, "upvote_ratio": 0.9, "num_comments": 24, "comments": [{"body": "Come buy our canadian shit folks.", "score": 21, "replies": [{"body": "Am Canadian, all my transfers that I've made into my broker account and converted to USD in the last few months have lost quite a bit of value due to all the printing. Wishing I stuck to CAD and bought Canadian stocks.", "score": 4, "replies": [{"body": "That's why I use the iShares XSP (IVV)  and XQQ (QQQ) for my S&P500 and Nasdaq index funds,  on TSX.  They're CAD (Canadian Dollar) Hedged. Most of my other stocks I've to go through NYSE and Nasdaq directly though.", "score": 5, "replies": [{"body": "What do you mean by CAD hedged? I would've thought since these are tracking US indexes a weak USD would still affect them the same even if you're buying them in CAD?", "score": 1, "replies": [{"body": "To make it short, currency hedged strategy indexes aims to eliminate the effect of currency fluctuations in the index. By factoring the impact of selling foreign currency forwards at the one month forward rate, the Hedged Indexes mitigate the currency exposures in the index compared to the 'home' currency.     \n\n\nYou can check charts and compare, they are twins.  Some don't like, you decide for yourself. I'm comfortable with that.", "score": 2, "replies": [{"body": "Interesting, thanks for the explanation.\n\nSo they would still be affected the same as the US indexes if foreign buyers stop buying US stock because of bad USD, but it won't just perform worse than the indexes because it's buying USD equity with CAD and USD is losing value.\n\nNot really a question just verbalizing it lol\n\nThanks!", "score": 1, "replies": []}]}]}]}, {"body": "Every country has been printing as well, and the foreign demand of USD has been increasing. Printing has done the exact opposite of decreasing the value of US equities.", "score": 1, "replies": []}]}]}, {"body": "I’m in Europe market. Most have direct correlation and also recovered as US.\nI don’t see any undervalued assets", "score": 15, "replies": [{"body": "Thank you! One thing I see as a positive is that the EU recovery stimulus discussed last week targets fundamentals of the European economies, including infrastructure. What do you think of the EU recovery plan being discussed?", "score": 5, "replies": [{"body": "In terms of would it affect the market further then the stimulus that was announced right after the pandemic hit - I don’t think so, it’s priced in.\n\nAlso I don’t think the european market will move further then the US assets due to the strength of dollar. Outside of us it is a valuable asset because institutions are taking in US bonds and need to service them with dollars. You are risking a lot with assets in euros", "score": 4, "replies": []}]}]}, {"body": "Well think about this.  Europe got hit by 'rona just like the US did.  Yet Europe rallied right with the US, when it was the US that was doing QE (look at all the times the US market got a bump from the Fed, and look at what happened in Europe markets at the same time.)\n\nSo when you think that it was the US market that was getting propped up, consider instead that the markets all trade together.  So it's no easier to pick a country to outperform SPY, than it is to pick a stock to outperform SPY.\n\nHeck it might even be harder, because at least you can pick growth stocks.  There's no \"growth country\" in Europe.  Not until they take a fall from 'rona, then bounce back.  Which is exactly what will happen with the US.", "score": 12, "replies": [{"body": "There are a lot of ways to analyze the situation, for sure. Which I why I posted it for discussion. It's really tough to sift through all the connections in a globally linked market. I think one thing that the article I had linked was focused on is the new pledge for Eurozone stimulus from Europe, which might boost Euro equities more because they have been, as you mentioned, riding the US stimulus coat-tails. But I'm not at all confident in these arguments, and am still weighing where to go with my portfolio in the next 2-3 months.\n\n> Heck it might even be harder, because at least you can pick growth stocks. There's no \"growth country\" in Europe. Not until they take a fall from 'rona, then bounce back. Which is exactly what will happen with the US.\n\nThis is a helpful comment. Thanks.", "score": 3, "replies": []}]}, {"body": "+1 Thank you for your insight. It's something I'm going to look into now.", "score": 11, "replies": []}, {"body": "I have been picked up small amounts of some Mexican and Latin American companies: CIB, BCH, CX, FMX.  They are getting hit later than the US and are in an earlier stage of recovery.", "score": 3, "replies": [{"body": "Thanks for the tips. I haven't looked at Latin America yet.", "score": 2, "replies": []}]}, {"body": "But in a way aren't other markets also correlated to the US market", "score": 5, "replies": [{"body": "yes, they are.", "score": 2, "replies": []}]}, {"body": "I'm leaning toward reducing my US equity exposure to increase Europe. They've done a much better job at flattening the curve, and part of me shudder about what will happen at end of July once the extra unemployment money stops being received and spent back into the economy. Crossing fingers that the powers that be come up with a solution for that, given that businesses aren't about to hire everyone back that they just let go.", "score": 2, "replies": [{"body": "Canada's done really well at flattening the curve too. Much better than Europe I'd say.\n\nWe're down to a couple hundred new cases/day, most of those being in QC and ON. Some provinces have 0 active cases for a while now. BC where the 3rd biggest city has less than 200 active cases.\n\nI live in Vancouver and the reopening is going great, places are busy but people are being fairly careful still. It's still difficult for restaurants and bars obviously due to reduced capacity. Tourism still taking a massive hit as only local tourism is allowed. (Some americans were fined 1200$ for taking pictures of Banff the other day lol)\n\nI don't know what this means investing wise, just thought I'd throw it out there because it seems like a lot of people throw Canada and the US in the same basket thinking COVID is just as bad here.", "score": 4, "replies": []}, {"body": "I have found investing in Europe to be a losing proposition, but more power to you.", "score": 2, "replies": [{"body": "Austerity definitely wasn’t the way to go in 2008, that’s established. But they’ve opened their safety nets, replaced lost income, and done better against Covid. Again; here I’m worried that after an initial burst of stimulus, austerity will take hold if only until politicians realize they need votes. \n\nI’m on the fence still. I’m definitely much more comfortable domestically in terms of that’s where I get my news etc", "score": 2, "replies": []}]}]}, {"body": "Vanguard’s VTWAX", "score": 1, "replies": []}, {"body": "I'm staying in cash until the market is not 100% Amazon and garbage. I'm going to be end up being like my great grandparents who lived through the great depression and put stacks of cash inside of the walls of their house because they didn't trust banks.", "score": -3, "replies": [{"body": "Wut?", "score": 2, "replies": []}]}]}
{"title": "What is fueling MSFT rally?", "selftext": "I've heard only about 20% of the revenue comes from windows. Is most of it coming from Azure and teams?", "id": "hdzkpu", "created_utc": 1592855932.0, "score": 0, "upvote_ratio": 0.44, "num_comments": 16, "comments": [{"body": "me having sold it", "score": 25, "replies": []}, {"body": "They shut down mixer and promoted FB gaming", "score": 4, "replies": [{"body": "Sounds lame", "score": 3, "replies": []}]}, {"body": "I think it's everything combined, solid company, solid revenue. People are banking hard on Teams, Microsofts' Slack \"killer\". Besides that they have Github, Visual Studio Code (used by many devs), Azure is being pushed hard and since Multi-Cloud is becoming a thing it's no longer just one Cloud for each company. And we're not even talking games. But does that answer their rally today? Not at all.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "You do know it reached 200 for the first time and theyre going toe to toe with apple on market cap?", "score": -8, "replies": []}]}, {"body": "Are you asking about the breakdown of Microsoft revenue, or you’re asking why the stock is going up?", "score": 2, "replies": []}, {"body": "Msft is a solid company, not some hipster lgbt company that doesn't do anything. Ahem Nikola and a lot of other ones", "score": 0, "replies": [{"body": "[deleted]", "score": -3, "replies": [{"body": "Fuck you too", "score": -2, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "Every tech company is hipster", "score": 4, "replies": [{"body": "Hipsters makin fucking bank tho", "score": 2, "replies": []}]}, {"body": "😂 😂", "score": -6, "replies": []}]}]}]}, {"body": "You do realize the world's largest company by market cap (Apple) has a gay hipster CEO, right?", "score": -3, "replies": [{"body": "He's only gay", "score": 0, "replies": []}]}]}, {"body": "Tech is being seen as a safe haven for a potential new downturn in the market", "score": 1, "replies": []}, {"body": "as it turns out, you actually make a lot of money by making software that people actually would pay money to use rather than relying on selling ads to sponsor your free software / services.", "score": 1, "replies": []}, {"body": "All software companies are up this year and the good ones are up over 100% YTD.", "score": 0, "replies": []}]}
{"title": "Any CANADIAN Stocks to look at?", "selftext": "I’m a 20 year old with about 15K to invest. I already have about 25K invested already but I’m wondering if there’s anything promising to look at? Or should I wait for crash 2.0 if it happens?", "id": "he1tij", "created_utc": 1592863257.0, "score": 0, "upvote_ratio": 0.5, "num_comments": 24, "comments": [{"body": "APHA", "score": 2, "replies": []}, {"body": "Check out AQN, BAM and SVI. Relatively stable and safe.", "score": 2, "replies": [{"body": "Thanks! Will definitely check out!", "score": 2, "replies": [{"body": "You're welcome.", "score": 1, "replies": []}]}, {"body": "Came here to say AQN.", "score": 2, "replies": [{"body": "because there utlitly ?", "score": 1, "replies": []}]}]}, {"body": "WFT, PLC and CSH are solid staples", "score": 1, "replies": []}, {"body": "TOY is climbing back up!", "score": 1, "replies": []}, {"body": "I have some shares of BNS, decent dividend imo", "score": 1, "replies": [{"body": "I’ve been wondering if rn is a good time for getting BNS. I’ve been wanting to get it for a while now but still not sure.", "score": 1, "replies": [{"body": "BNS’ exposure in South America is going to be problematic. I picked RY over BNS", "score": 1, "replies": []}]}]}, {"body": "TCL MFC ENB", "score": 1, "replies": []}, {"body": "r/CanadianInvestor\n\nOf my 32 stock portfolio, the only 3 Canadian plays are Blackberry, Imperial Oil and Royal Bank of Canada.\n\nThe first two are more speculative and RBC is huge, though I'm worried about their exposure to the Toronto housing bubble.\n\nI think American stocks have more upside since Canada's two biggest golden eggs (Immigration - to fuel their housing bubble - and Oil) are being decimated by COVID-19", "score": 1, "replies": [{"body": "If RBC pulls back to 85 it would be a steal.", "score": 1, "replies": []}]}, {"body": "Brookfield Asset Management $BAM", "score": 1, "replies": []}, {"body": "CNR or CP it basically a duopoly!  Or TD  is the best banks in Canada with exposure to the us market.", "score": 1, "replies": []}, {"body": "BAM, TD, BMO, BNS", "score": 1, "replies": []}, {"body": "$BB might be something to look into", "score": 1, "replies": [{"body": "Blackberry interesting! Never thought of looking into it", "score": 1, "replies": [{"body": "Take a shot and do some DD. It’s very slept on!", "score": 1, "replies": []}]}, {"body": "whats so great about bb ? is it because the covid tracking software ?", "score": 1, "replies": []}]}, {"body": "Air canada. if you can buy on a good dip.", "score": 1, "replies": []}, {"body": "I like SHOP and KXS. They are doing well for me. I held BAM for a year and it just sat there. Not a fan.", "score": 0, "replies": []}]}
{"title": "Is there gonna be a crash in your opinion?", "selftext": "[deleted]", "id": "he1xhx", "created_utc": 1592863614.0, "score": 0, "upvote_ratio": 0.4, "num_comments": 21, "comments": [{"body": "We crashed when covid was a huge unknown. It may correct 10-15% if we get surprised by another massive shutdown but definitely not going to crash", "score": 7, "replies": [{"body": "That’s actually roughly what I was asking but worded it wrong. Still I think airlines and cruises will sink like stones as soon as earnings come out and people see how hard they really got hit.", "score": 1, "replies": [{"body": "Yeah there will be losers for sure\n\nI think overall it’s less scary for investors because they’ve seen what still makes money in a remote economy vs what doesn’t", "score": 2, "replies": []}]}]}, {"body": "Corrections yes. But crash, no. Were definitely safe for a few months, but it’s possible something big will happen after the election (or just before if the market truly is forward looking)", "score": 6, "replies": [{"body": "^^ this. I don’t see Trump allowing a “crash” any time before or during the election. Trumps biggest asset come October is the economy and he will do everything he can to keep it at all-time-highs during his campaign", "score": 9, "replies": []}]}, {"body": "It’ll happen only if the feds want it to happen", "score": 7, "replies": []}, {"body": "My money is that the day the first large pharma company says their vaccine does not work will be a very nasty day, even though there are many other vaccine candidates out there.", "score": 3, "replies": []}, {"body": "I saw an interesting video suggesting a crash on the 31st of July time frame, due to covid payments ending (unless they decide to extend them however as of now there is no such plan),mortgage repayments starting up and student loan payments beginning again. They suggested these on top of unemployment will create less money to be invested, noting the increase in trading during recent months", "score": 3, "replies": [{"body": "very interesting", "score": 1, "replies": []}]}, {"body": "When all the vaccines to tits up.", "score": 2, "replies": []}, {"body": "No", "score": 1, "replies": []}, {"body": "No yes", "score": 1, "replies": []}, {"body": "Yes, the will absolutely be another crash. When that will happen, no one knows. Hard to invest successfully by betting on a market wide crash.", "score": 1, "replies": []}, {"body": "No flash crash outside of an asteroid impact but I don't expect gains from here either.", "score": 1, "replies": []}, {"body": "Correction yes; crash maybe, if there is a crash, probably around election time imo", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Tvix is being delisted next week", "score": 2, "replies": []}]}, {"body": "My opinion will definitely not crash", "score": 1, "replies": []}, {"body": "A crash like 3/23??  NO.  A few dips here and there?  YES.", "score": 1, "replies": []}, {"body": "I expect many tech stocks to decline significantly over the next couple of years or so.", "score": 1, "replies": []}, {"body": "The stock market since 2010 has been completely devoid of fundamentals - even technicals - running exclusively on exuberant sentiment and speculative theory. Totally unable to function without some form of Fed intervention. A junkie who can't kick the methadone drip. Predict if the junkie will be clean \\[or dead\\] six months from now. Impossible.", "score": 1, "replies": []}, {"body": "Yes", "score": -1, "replies": []}]}
{"title": "30% profit of premium gained within 2 hours. Sold two contracts on AAL on friday at around 2pm. High IV with approx 45DTE is where its at!", "selftext": "", "id": "hdj4lc", "created_utc": 1592791096.0, "score": 0, "upvote_ratio": 0.3, "num_comments": 20, "comments": [{"body": "Respectfully, there are a couple of things to be kept in mind here that we should all remember.\n\nFirst, you have to know that “High IV with approx 45 DTE” has almost absolutely nothing to do with “30% profit of premium gained within 2 hours.” Even if we disregard the whole thing with the bid/ask spread being wide and all that good stuff and say that yes this position was in fact 30% in profit and you could’ve closed it as such before close on Friday if you wanted... it still was not those 2 hours passing on a Friday afternoon that pushed this position to 30% profit, and it also was not any sort of an IV crush which would reflect as such within that time frame (could have something to do with it, but very little at best... don’t think AAL’s IV went up or down much during the closing hours on Friday). At best, it would be the underlying moving away from your strike price strongly which could contribute to this if it happened. \n\nNext, even if that was the case, you did not actually close the position to realize the 30% profits before close on Friday. And in trading, especially in options, a weekend is a lifetime. You’re most likely about to find this out today with AAL.\n\nSo while I can understand the excitement of a position going into profit so quickly, but if you post immediately on here in celebration while obviously not having an understanding of what’s going on and simply attribute it to ‘high IV with 45 DTE’, then you’re bound to get replies like this one and some of the others you’ve gotten. I don’t think anyone means to belittle you or wish ill upon your position (at least I definitely do not), but rather we want to remind you and ourselves about what the reality actually is in this case, so you don’t continue to think that you can (supposedly) make 30% profits at a moment’s notice any day within 2 hours because of opening a position with ‘high IV and 45 DTE’.\n\nNow it was indeed a smarter play on your part to go with 45 DTE, because that now gives you time to let things work out and manage the trade at some point if needed. Had it been a weekly expiration and if AAL continues to struggle this week, you may have quickly been looking at assignment or some other management tactic. I presume you are ok with owning AAL at $15 since you entered the trade so I won’t comment on that part.\n\nAgain none of this is meant to be rude or anything like that, we’re all trying to learn from each other here. Good luck and I hope this and all your trades work out for you.", "score": 10, "replies": [{"body": "Thank you very much....", "score": 3, "replies": [{"body": "You’re welcome bro. Good luck.", "score": 1, "replies": []}]}, {"body": "We need more of this please. Great comment.", "score": 1, "replies": []}]}, {"body": "Will AAL go bankrupt? Who knows. But they did just massively increase their debt load. \n\nWould be cautious with airlines as they will go through a Chapter 11 and generally get approval. This seems like they are loading up their debt while the getting is good, only to dump it all during reorg and murdering shareholders in the process. It's not happening before the end of Jul so you're safe from that front, but wouldn't be surprised if this took a massive dump back down to 9-10 and sat.", "score": 4, "replies": []}, {"body": "Did you see the news today on aal? Good chance it tanks", "score": 4, "replies": []}, {"body": "So I don't mean to burst your bubble, but that's not an accurate price. Options don't trade after hours or on weekends. Theoretical value for that thing right now I think is $2.43  or something like that, last trade price I'm seeing as $2.19. you won't know what it's worth until after open on Monday. But looks like the last bid/ask on AAL is a lot lower than the close price, I'm seeing $15.80 asks. You could plug that into an option price calculator and see an estimate of the value if you want, but it isn't what you're seeing.\n\nReally can't rely on what your broker throws out there as \"mid price\" when the market is closed.", "score": 3, "replies": [{"body": "This was the price on friday at close. Options price dont update after close", "score": 1, "replies": [{"body": "What? Yeah that's what I'm saying. You sold these for $2.19 so I'm saying you haven't made the profit you're currently seeing", "score": 1, "replies": [{"body": "I bought at 2.19 at around 2pm friday and right before close it was 1.49. I dont what it will be Monday but as of now im judt basing it off close on Friday which is 30% of total premium.", "score": 1, "replies": [{"body": " Your order ticket above says you sold, not bought, two of them at 3:37PM on Friday for $2.19. The $1.49 isn't real, that's just the mid of whatever the bid/asks are that happen to be in there right now. Since AAL is down after hours the options are actually worth more like $2.43 so you're probably going to be slightly in the red at open on Monday.", "score": 5, "replies": [{"body": "lol, BIGLY in the red today at open", "score": 2, "replies": []}, {"body": "Will update post and comment here tomorrow morning and let you know. Ty bro", "score": 1, "replies": [{"body": "Yes?", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Outside of market hours, option bid/ask can be extremely inaccurate. Especially on low-volume contracts. This is a great example.\n\nThe price of this contract is not 1.49. That is the mid price. Based on totally out of whack bid/ask spread. The last real trade price was $2.19. As soon as the opening bell rings tomorrow morning, the bid/ask will narrow up and the contract price will be accurate again.\n\nAlso, expect AAL to get hit tomorrow due to share dilution.", "score": 3, "replies": []}, {"body": "Rip profits", "score": 2, "replies": []}, {"body": "Today was not good for you.", "score": 2, "replies": []}, {"body": "You sold $15P? A bit too close to the underlying ain't it?", "score": 1, "replies": [{"body": "It is close but i aim for a 30 - 50% gain in premiun. At around 45dte i gave time to get that amount. Hopefully...", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I will be messaging you in 2 days on [**2020-06-24 06:09:55 UTC**](http://www.wolframalpha.com/input/?i=2020-06-24%2006:09:55%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/thetagang/comments/hdj4lc/30_profit_of_premium_gained_within_2_hours_sold/fvm25y0/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fthetagang%2Fcomments%2Fhdj4lc%2F30_profit_of_premium_gained_within_2_hours_sold%2Ffvm25y0%2F%5D%0A%0ARemindMe%21%202020-06-24%2006%3A09%3A55%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20hdj4lc)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}]}
{"title": "AAPL Conference this week with major announcements", "selftext": "[deleted]", "id": "hdiu1a", "created_utc": 1592789857.0, "score": 28, "upvote_ratio": 0.77, "num_comments": 29, "comments": [{"body": "[deleted]", "score": 30, "replies": [{"body": "OP prob throwing up right now", "score": 32, "replies": []}]}, {"body": "The intel announcement was weeks ago.  Literally priced in.  \n\nApple has traditionally been a buy the rumor, sell the news company\n\nEdit...looks like no new hardware https://www.macrumors.com/2020/06/21/leaks-suggest-no-hardware-at-wwdc/", "score": 29, "replies": []}, {"body": "This makes my 7/10 325p feel realllllll good", "score": 16, "replies": [{"body": "7/24 330P", "score": 6, "replies": [{"body": "Welcome brother I got in Wednesday. If I wasn’t a poor I would’ve gotten ATM puts, but hoping there’s a dump tomorrow with an IV spike", "score": 2, "replies": [{"body": "Options on Apple are always expensive lol", "score": 1, "replies": [{"body": "Yeah no shit. Could buy a whole fucking new iPhone for how much a single call or put is for this cult stock", "score": 3, "replies": []}]}]}]}, {"body": "it'll get pumped to the moon minutes before the show starts and then get dumped \n\nit'll be so beautiful", "score": 1, "replies": [{"body": "This is exactly what I’m praying to the Wall Street gods for. IV slowly going up too today so if there is a dump I’m gonna cash in for sure on that", "score": 2, "replies": [{"body": "i am going to blow a day trade to sell my 355 6/26 puts later today if they print lmao", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": []}]}]}, {"body": "I bet the rug pull happens during the Apple conference right after AAPL moons and people start pre-ordering their Lambos then the entire market drops 7% and pulls APPL with it.\n\nDiamond hands bitch.", "score": 11, "replies": [{"body": "[George Clooney is AAPL](https://youtu.be/drvaZz3FWOI)", "score": 2, "replies": []}]}, {"body": "My leap just may print... $320c, 06/21 exp. bought Feb 10 pre ‘Rona", "score": 11, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "$4,108... 2019 was a spectacular year", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "AH tonight at $361-ish. Which if it was expiring soon would be break even ($320+$4,105/100), but yes with the time premium it’s up 8% today, 56% total, worth $6,420 total.", "score": 1, "replies": []}]}]}, {"body": "Yeah stock had dropped the week of for the last 3 years in a row...", "score": 3, "replies": []}, {"body": "Sell the news", "score": 3, "replies": []}, {"body": "Apple will\nBe 320 by friday", "score": 3, "replies": []}, {"body": "It’s gonna be underwhelming as fuck. Apple is long gone", "score": 2, "replies": []}, {"body": "Your arrows are literally drawn in on fucking December you retard. The dotted lines are June which is what you set your graph parameters from start to finish on.", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Bro you just gave us the stock history and you cannot read graphs lmao. If you set a graph to start on June 20, 2015 and literally half of the box of 2015 is showing, that means the graph starts on June 20, 2015 and the dotted vertical likes are January 1st of each year", "score": -3, "replies": []}]}]}, {"body": "Even after major product launches like the iPhone the stock drops. Very much but the rumor sell the news. Nothing stays a secret there anymore so everything is priced in.", "score": 1, "replies": []}, {"body": "Loaded 330p 340p 350p 7/17", "score": 1, "replies": []}, {"body": "I’ll look into them", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "I sold all but one of my calls already today (gotta keep one for the hell of it). This win feels good - for a single day we’re not retarded.", "score": 1, "replies": []}]}, {"body": "I’m in long dated QCOM calls. They will make chips for apple the next 6 years. Not going tits up", "score": 1, "replies": [{"body": "It's TSMC that makes ARM processors for Apples.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "apples getting accused of all kinds of shady shit, i dont see it going up much until new iphones are out tbh", "score": 3, "replies": []}]}]}
{"title": "APPLE - Tim Cook (KOVAR)", "selftext": "[removed]", "id": "hdj5gc", "created_utc": 1592791199.0, "score": 4, "upvote_ratio": 0.56, "num_comments": 21, "comments": [{"body": "Market follows AAPL.", "score": 12, "replies": []}, {"body": "Mysteriously on OpEx day.......", "score": 4, "replies": []}, {"body": "https://www.google.com/amp/s/www.macrumors.com/2020/06/21/leaks-suggest-no-hardware-at-wwdc/amp/\n\nUhh, they not gonna announce new hardwares", "score": 4, "replies": [{"body": "It's kinda expected since it's a developers Conference", "score": 5, "replies": []}]}, {"body": "Last year, WWDC had a decent positive bump for Apple so we’ll see. Praying for a tease of Apple Glass lol", "score": 5, "replies": [{"body": "Crystal is hell of a drug. Apple going into drug business is bullish", "score": 2, "replies": []}]}, {"body": "You mean Tim Apple?", "score": 4, "replies": []}, {"body": "I’m all about calling him KOVAR if my 7/10 325p prints tomorrow", "score": 6, "replies": []}, {"body": "Hoping for the ARM and other announcements tomorrow during WWDC to pull my 360 6/26 calls out of the shitter. Bought on Friday and kinda getting fucked.", "score": 2, "replies": [{"body": "Yes. Fingers crossed. I am hoping Tim does not bend you over his knee for a violent pounding. I am in essentially the same position....", "score": 5, "replies": []}, {"body": "That makes 3 of us retards", "score": 2, "replies": [{"body": "I’m glad I wasn’t alone. 💎✊", "score": 3, "replies": [{"body": "Im using this post as confirmation bias on my 365 6/26. Hoping they print 🤞", "score": 3, "replies": []}, {"body": "My avg was 2.40 on 17 contracts 💎", "score": 1, "replies": []}]}]}]}, {"body": "Rape? Is everyone on this subreddit a high school virgin?", "score": 2, "replies": []}, {"body": "Apple market cap is a massive bubble too\n\n\nMove\nOn to\nNew stocks imo its full of people about to lose easy gains", "score": 1, "replies": []}, {"body": "If AAPL takes a tumble the nasdaq is going with it.", "score": 1, "replies": []}, {"body": "How about we stop being edgy and go with AAPL?", "score": 1, "replies": []}, {"body": "KOVARen", "score": 1, "replies": []}, {"body": "It’s not Tim Cock it’s Tim Apple.", "score": 1, "replies": []}]}
{"title": "For the bears who say increasing number of Coronavirus cases will lead to tendies", "selftext": "The Best of Times, the Worst of Times: Understanding Pro-cyclical Mortality ([https://www.aeaweb.org/articles?id=10.1257/pol.20130057](https://www.aeaweb.org/articles?id=10.1257/pol.20130057))\n\nSince \" It is well-known that mortality rates are pro-cyclical\", I wish to bring to our collective attention that the increasing # of COVID-19 deaths is actually a bullish signal that the economy is going to be BOOMING after its fastest recession in history. Since the death rate goes up among the elderly when GDP goes up ([https://jech.bmj.com/content/68/1/44.abstract](https://jech.bmj.com/content/68/1/44.abstract)), all the deaths occurring now must be the sun disappearing omen that GDP will go up bigly now that the USA has said: \"Fuck Kung-Flu, we're open for business.\"\n\nI figure the elderly and those who pass on got those tendies, that they spent their entire lives to earn. Those tendies pass on to their degenerate offsprings who will invest with their local OPTIONS dealers and frequent their local Robinhood casino, thus driving the economy to new heights. Couple this with unlimited support from our Lord and Savior, Jerome Powell, my prophecy from the printing machine spirits is that SPY will reach 400 by the end of the year. Therefore in order to honor the human sacrifices being made each and every day, we MUST buy stonks, and calls in order to drive this market to heights never before seen.\n\nBecause, if the market and economy crashes, then we may as well have kept the economy closed and spent time with those that would still be with us today. Otherwise, what was the point of opening?", "id": "hdp4g7", "created_utc": 1592818230.0, "score": 39, "upvote_ratio": 0.77, "num_comments": 27, "comments": [{"body": "[deleted]", "score": 67, "replies": [{"body": "*And* there goes our most valuable secret.  \n\nCouldn’t keep your fucking mouth shut.", "score": 19, "replies": []}, {"body": "Sir, this is a casino. Mods, please ban.", "score": 9, "replies": []}, {"body": "To paraphrase what a number of smart people have said over the last few months: \"You can't fix the economy if you haven't fixed the virus.\"", "score": 6, "replies": [{"body": "Sure you can, just adapt,", "score": 2, "replies": [{"body": "If anything, over time the fittest shall survive and the weak will die off. Thus strengthening the country. So those smart people are not so smart. If the virus was killing the 18-55 demographics in huge numbers, then yea we have a problem, but because its the opposite, its actually bullish to be reopening.", "score": 5, "replies": [{"body": "#THANK YOU!!\n\nThe voice of reason finally, there are just so many  🌈🐻, who made a life changing amount of money, then lost it all in the last few months who are bitter as shit and want a drop again...🤣", "score": 5, "replies": []}]}]}]}, {"body": "Shouldn’t inheritance cause more expenditures?", "score": 3, "replies": []}, {"body": "Strangles and straddles ladies and gents", "score": 1, "replies": []}]}, {"body": "Coronavirus didn’t cause the market to tank. The response to the Coronavirus did. We aren’t shutting down again. As terrible as this might sound, old and poor people dying doesn’t have that bad of an effect on the economy.", "score": 12, "replies": [{"body": "Not if people are still socially distancing. There are enough people that still take the virus seriously enough to stay in, not travel, and not spend money going out. Which definitely doesn’t help the economy, if news of deaths roll in or seeing healthy people suffer from long term symptoms of the virus youll see the economy suffer.\n\nOne thing that concerns me most about the virus isn’t the deaths but the scaring and fucked up long term effects. There are a fuckload of reports of young and healthy non smokers not getting full lung capacity due to permanent scaring. If you look at the stats, there are young people who still haven’t recovered months after contracting.", "score": 6, "replies": []}, {"body": "It does when nobody bothers going to shops due to the risk", "score": 4, "replies": [{"body": "Almost no one takes it that seriously. Half of people don’t even wear masks. We already basically forgot about the virus with protests.", "score": 0, "replies": [{"body": "See this is where you're definitely wrong. \n\n1/2 of the country took it seriously and implemented strict measures.....\n\nthe other 1/2 followed the advice of a washed up reality star barely implementing any restrictions until FORCED to..... \n\nI'm sure it will end well though, 2020 seems to be going fuckin swell so far!", "score": 3, "replies": [{"body": "That’s because at the height of panic you had a bunch of geniuses and quacks thinking the mortality rate was way higher than reality. No reasonably healthy non senior person is legitimately worried about this enough to stop going out.", "score": -1, "replies": []}]}]}]}, {"body": "It’ll be as if we shut down again soon... watch", "score": 1, "replies": []}, {"body": "Several states will shut down again. More in the Fall.", "score": 1, "replies": []}, {"body": "but it will have a bad effect on the elections...", "score": 0, "replies": []}]}, {"body": "The effects of old people dying won't do shit for GDP numbers in the short term. After a couple years when less pensions and health care costs are payed out is when it will help. Right now the \"second\" wave will cause another shut down of some areas. And even if no place shuts down lots of people won't go out for fear of getting it. Plus people will be reluctant to make any purchases and instead will save there money for fear of losing there job. The only thing that will save your calls is jpow and his printer", "score": 8, "replies": [{"body": "And the whole \"hospitals are reaching capacity\" problem which will make the \"unkillable 18-55\" a lot more likely to die.", "score": 3, "replies": []}]}, {"body": "Sure", "score": 2, "replies": []}, {"body": "The death rate is actually decreasing and has been going down as a % the last 2 months.", "score": 3, "replies": [{"body": "Yeah, wtf is this dude talking about? Deaths keep dropping.", "score": 2, "replies": []}]}, {"body": "To answer your question, greed", "score": 1, "replies": []}, {"body": "I guess satire = DD", "score": 1, "replies": []}, {"body": "Kind of dark, but if anything old people dying will just reduce the burden of social security, won't hurt GDP", "score": 1, "replies": []}, {"body": "My man, this is just a Wendy’s.", "score": -2, "replies": [{"body": "😂", "score": 2, "replies": []}]}]}
{"title": "The FEDs program is a boon for finance, according to a very notable economist and public figure", "selftext": "《 So what’s the bottom line of the Fed’s rapid balance sheet expansion? The Fed is changing the composition of the assets that the private sector can hold, with implications for the prices of financial assets. But the rapid reserve growth won't lead to runaway inflation as long as the Fed is willing to raise interest rates as needed to keep credit demand in check. 》\n\nSource : https://www.bloomberg.com/amp/opinion/articles/2020-06-22/fed-s-balance-sheet-heads-to-10-trillion-to-support-u-s-economy?__twitter_impression=true\n\nIt will encourage corporations to invest and grow, when economic conditions seem precarious.\n\nVery good read, part 2 coming soon !", "id": "hduu2a", "created_utc": 1592841076.0, "score": 5, "upvote_ratio": 0.7, "num_comments": 27, "comments": [{"body": "“as long as the Fed is willing to raise interest rates”  \n\n\nlol", "score": 14, "replies": [{"body": "Came here to post this\n\nWhat a fucking laugh", "score": 4, "replies": [{"body": "I heard you liked printers 😛🤑", "score": 1, "replies": []}]}, {"body": "as long as the Fed is willing = NEVER or stock market goes bust", "score": 2, "replies": []}]}, {"body": "Except what happened during QE 1, 2, 3, 4....\n\nInvestment /capex never happened. Companies bought back shares. That's it.\n\nThere hasn't been an economic expansion of any durable nature over the last 10 years.", "score": 9, "replies": [{"body": "It can look like that. What about GDP growth ?", "score": -1, "replies": [{"body": "There is no GDP growth. Running a trillion dollar deficit puffs the numbers artificially.", "score": 3, "replies": [{"body": "At some point, if everything is \"artificial\", then nothing is artificial", "score": 3, "replies": [{"body": "Its basically like maxing out your credit cards and claiming your income doubled.", "score": 1, "replies": [{"body": "I disagree ! Debt is part of the economic cycle, always was, always will be. Now if you max out your credit cards to buy fries at McDonald's, that's a problem. But if you do so to, say, buy a better computer for chart analysis, then it's increases your productivity, while increasing the income of the computer company, which translates into higher wages, increased taxes, increased investments, etc.", "score": -1, "replies": [{"body": "That's possibly the worst example for \"productivity increase\" I've seen someone use.\n\nYou want to claim that giving rich people a trillion dollar tax break that they plow into asset bubbles increases productivity?", "score": 6, "replies": [{"body": "If heard of reading between the lines. But I've never heard of reading besides the lines ! Focus, bud !\n\nA new computer for work, which is required for work : buying that to be better at work, that's the definition of increased productivity", "score": -1, "replies": [{"body": "Stock buybacks don't count as making anything \"better at work\".", "score": 1, "replies": [{"body": "You are very right. But also, were not having the same conversation 😕", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Inflation has been predicted to be just around the corner for like 30 years now.  The shit never comes.   FED should go petal to the metal until actual inflation comes AND STAYS for several halfs.", "score": 8, "replies": [{"body": "Keeping inflation down seems to be the one thing the fed does well.", "score": 8, "replies": [{"body": "...Because they are not doing it, automation is.", "score": 10, "replies": []}]}, {"body": "Inflation is in full swing, just not for consumer prices. Asset prices are through the roof", "score": 6, "replies": [{"body": "housing, education, healthcare, etc", "score": 4, "replies": []}]}, {"body": "Capitalism is for losers. Who needs capitalism when you have a magical money printer that prints money but doesn’t cause inflation.\n\nJust have the Fed print us all our paychecks. Who needs a job when you got the Fed?", "score": 7, "replies": [{"body": "Can the Fed print beer?", "score": 1, "replies": []}]}]}, {"body": "Listen you retards, \n\nTechnological advancements and increased productivity (as a result of tech advances) have severely lowered the chance of rampant inflation.  Coupled with globalization and an older demographic (which causes deflation, google it), I don’t think we will see inflation be an issue in the USA. If anything we may suffer from deflation which some argue we are already.", "score": 3, "replies": [{"body": "How do you reconcile your reasoning (seems solid) with the notion that inflation is a function of monetary supply/interest rate levels ?", "score": 1, "replies": [{"body": "I could spent 30 min explaining this but people smarter than me have already done research on this topic. I’d recommend googling around about the historically low inflation rates and why they happen. \n\n[You can start here](https://www.stlouisfed.org/on-the-economy/2018/april/closer-look-reasons-low-inflation)\n\nEdit: \n\nI did read a good example to help explain it without doing reading: \n\nLet’s say expense of $1 produced qty 2 of item X in 1900 and was sold for $2. \n\nDue to tech advances and/or productivity increase,  that $1 expense can now produce qty 4 of item X in 2020 and be sold for $1 instead of $2 while still maintaining profit for business. This is a very layman’s understanding but should help explain why tech advances/productivity can lower inflation.", "score": 2, "replies": [{"body": "🤓\n\nSmarter ? Or have studied a topic for a longer period of time ?", "score": 1, "replies": [{"body": "I am starting an MS in Int’l Econ in August so hopefully I can eventually be smarter and have studied the topic for enough time to make accurate comments LOL", "score": 3, "replies": [{"body": "💣💥\n\nI had a feeling", "score": 1, "replies": []}]}]}]}]}]}]}
{"title": "Luxury retail beware", "selftext": "My coworker went to Macy's yesterday.  The stores are still not back to full staffing, and who they've called back was chosen by seniority.\n\n\nThe result: old, slow normies working very slowly, unhappy about virus risk, while the younger workers stay home and masturbate collecting $600 of dole each week.\n\n\nMight not hit earnings for a while but this will interfere with our V or J-shaped recovery.", "id": "hdw8y5", "created_utc": 1592845603.0, "score": 8, "upvote_ratio": 0.62, "num_comments": 22, "comments": [{"body": "Lollll since when is Macy's luxury retail bro?\n\nAll legacy retailers are dead.\n\nBut seriously who labels Macy's as luxury?", "score": 41, "replies": [{"body": "Macy's is and has been in the absolute toughest area of retail.\n\nPoor and almost-poor people think it's too fancy.\n\nRich people think it's for the poors.", "score": 27, "replies": [{"body": "It is a more expensive version of Kohls, and kohls has been in trouble for a long time.\n\nThey do carry a few luxury brands, but Macy's itself is not a luxury brand. I am a big shoe guy- and most of their dress shoes are garbage, but they do carry , ike Behar (at least the ties are nice, not sure about the shoes), Mezlan, Fyre, and Hugo Boss.  Those are all pretty high up there mens shoes brands... i double checked and at least 2 of those are also sold at neimann marcus (a real luxury big box)", "score": 8, "replies": [{"body": "around here NM is the same store; like, they're only found together.", "score": 4, "replies": []}]}]}, {"body": "It’s not Gucci luxury bust still fancy for middle high income people and highest name recognition among immigrants buying and sending stuff home.", "score": 2, "replies": [{"body": "So the exact opposite of luxury?", "score": 1, "replies": []}]}]}, {"body": "Macy's has been struggling for a long time already. The sheer amount of \"sales\" they are pushing through their web, email, and mobile platforms demonstrates a great deal of desperation on their part.", "score": 10, "replies": [{"body": "I wish someone would do some analysis on their next ER to determine the percentage of revenue due to riot-related insurance monies vs its pre-covid retail sales.", "score": 1, "replies": []}, {"body": "I bought based on a glance at a chart (and cuz I like their clothes) and *then* saw what a bad 4Q they had.  Ooof.\n\n\nGot out clean today.  Whew.", "score": 1, "replies": []}]}, {"body": "Plus that viral video of a white guy getting beat by a black guy in Macy’s over the weekend.", "score": 6, "replies": [{"body": "that'll work in their favor tho", "score": 8, "replies": []}]}, {"body": "Macy pennystock incoming?", "score": 4, "replies": [{"body": "I'd love to see them turn around and become a blue chip but it won't be this quarter", "score": 0, "replies": [{"body": "It wont ever happen.", "score": 8, "replies": [{"body": "Meanwhile Kohl's is on track, thanks to cringe normie American consoomers.", "score": -1, "replies": []}]}]}]}, {"body": "$LVMH is the #1 luxury retailer, basically every Becky has at least one product from them. Check their stores..", "score": 3, "replies": [{"body": "those places have 500 square feet for less than 20 products.  Not gonna have old normies working there.", "score": 1, "replies": [{"body": "500 sq feet where the hell you live?", "score": 1, "replies": [{"body": "https://www.reddit.com/r/taxaccountingmusic/comments/gkbeda/gangstarr_the_mall/", "score": 1, "replies": []}]}]}]}, {"body": "This post was flaired as DD so it's on the DD list. [Find more fresh WSB DD here.](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da)\n\nHey /u/JIVEprinting don't misuse DD flair. No shitposts, short and vague guesses, links as DD, etc. DD is for wall-of-text deep-dive Pepe Silvia shit. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "https://www.barrons.com./articles/why-amazon-should-buy-macys-now-51592913601?mod=hp_LEAD_1\n\nWhat if this makes sense for Amazon?\n\nHigh short interest, too. If a rumor gains steam, M could have a nice pop.", "score": 1, "replies": [{"body": "Hmmm, interesting.  I kind of wonder if kohl's has more (and normier) customers for cheaper, and the rent is probably higher than Amazon would want (not that they can't afford it) but it's an interesting idea.", "score": 1, "replies": []}]}]}
{"title": "Bank Stress Test Results 6/25", "selftext": "How stupid is it to buy BAC & WFC calls right now? I assume the Fed will pump stocks by saying banks are doing great. \n\nIs this DD? Please send help. Thanks.", "id": "hdxrix", "created_utc": 1592850337.0, "score": 15, "upvote_ratio": 0.86, "num_comments": 20, "comments": [{"body": "Just saw CNBC article that says option traders are betting on WFC.", "score": 18, "replies": [{"body": "This is how I know for sure I’m retarded. Thanks. :)", "score": 10, "replies": []}, {"body": "That means do the opposite. Never listed to them 😂", "score": 5, "replies": [{"body": "LOL they play both sides.", "score": 3, "replies": []}]}]}, {"body": "My WFC and BAC calls are eating my ass currently", "score": 11, "replies": [{"body": "I wish they were. My WFC calls are tanking", "score": 1, "replies": []}, {"body": "It’s not over. Banks are currently looking at a 20-25% default rate- across the board.  It should get worse before it gets better.", "score": -1, "replies": [{"body": "Nice 👍", "score": 5, "replies": []}]}]}, {"body": "DFAST and CCAR results next week. Banks stocks will rocket. Do not buy puts.", "score": 9, "replies": [{"body": "Gotta agree.  No matter the actual outcome... the news will be good and they will rocket up.  Even if it means JPOW rescuing them under the table.", "score": 3, "replies": []}]}, {"body": "I'm thinking about it as well. Calls are stupid cheap. \"Feds will support banks. Stonks only go up\" yada yada. \n\nWorst case I lose 5k, best case I make 40k.", "score": 6, "replies": [{"body": "How to get 5k?", "score": 1, "replies": [{"body": "Ask OP’s mom", "score": 2, "replies": []}]}]}, {"body": "7/17 $22.5 puts on both are damn cheap right now. Both charts also looking like the right shoulder of the head/shoulders pattern, for what that’s worth.", "score": 10, "replies": [{"body": "You suggest playing the charts over the news, eh? Not my style, but I would prefer to make money than be stylish. Something to think about. Thanks.", "score": 8, "replies": [{"body": "Oh I got a little pump in the Friday sell-off and they’re just bleeding back to even now. So probably calls.", "score": 2, "replies": []}]}]}, {"body": "Banks are not profitable at 0% interest.  \nBest way to make tendies off BAC & WFC is to short straddles", "score": 2, "replies": []}, {"body": "[deleted]", "score": -3, "replies": [{"body": "Thank you. Good to know.", "score": 1, "replies": [{"body": "what was the comment?", "score": 1, "replies": []}]}, {"body": "You son of a bitch, I'm in.", "score": 1, "replies": []}]}]}
{"title": "PYPL and SQ thoughts?", "selftext": "So I’ve recently just seen square and PayPal and made my first winning trade on calls for sq, does it seem like these guys will continue going up, or is there any way to tell when they have peaked?", "id": "he276d", "created_utc": 1592864525.0, "score": 9, "upvote_ratio": 0.76, "num_comments": 21, "comments": [{"body": "SQ offers more than just their payment processing services. I believe that they’re a chartered bank now, which small businesses have probably been using to access short term capital infusions to stay afloat. \n\nThe company has a pretty diverse set of product offerings.", "score": 18, "replies": [{"body": "Long term probably a solid play but current price is definitely a premium to what it’s probably worth.", "score": 7, "replies": []}, {"body": "Ya but giving loans to those small businesses is risky", "score": 3, "replies": [{"body": "Not really they have ALL the information and cash flows that a bank usually wouldn’t have leading to much higher approval and pay back ratings", "score": 7, "replies": []}, {"body": "I believe they receive a portion of the revenue that’s generated daily from the SQ processors, so in the short term they’re probably taking a hit, but they prolly also gave out some PPP loans which are free income for the bank since the default risk is transferred to the Fed. \n\nI really like the company and Jack Dorsey is a great entrepreneur so I wouldn’t bet against it myself.", "score": 2, "replies": []}, {"body": "bruh they giving your moms hot dog stand like 7 dollars. They aint dropping millies on these businesses", "score": 1, "replies": []}]}]}, {"body": "$sq has a PE of over 160, their small business customers are REKT, they have existing loans to small businesses that will default. They missed earnings badly a couple months ago, yet the stocks gone up more than 50% since. Massively overvalued thanks to the market pump. But good luck!\n\n“But but but cash app”- square cheerleaders", "score": 12, "replies": [{"body": "Cash app is becoming extremely profitable. Covid has sped up user acquisition that would have previously taken 10 years. Everyone believes in Jack Dorsey. This stock will go up If covid wraps up by EOY price should hit 140and small businesses open but If it continues then we will probably see it drop back to $90.\n\nI have been in and out of this stock since it went public.\nStarting at $11.\nWork in private equity. This is just my take.", "score": 5, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Done, dm me. I’m the most creative punner you know.", "score": 1, "replies": []}]}]}]}, {"body": "You’ll know they’ve peaked when they stop going up all the time. Thank me later", "score": 3, "replies": []}, {"body": "They will continue to go up. Companies like this are replacing brick and mortar banking, and they’re front runners of the future. Leaps and shares on both. For current times I’d say(just like for everything else) they’re inflated and will see much lower levels to get in at during another blood red day or if we get crash pt. 2", "score": 3, "replies": [{"body": "Lol. Apparently you didn’t look at squares last earnings report.", "score": 1, "replies": []}]}, {"body": "Been in on SQ shares since March. Have also been selling CSPs to buy more shares. I'm bullish on SQ and will continue to buy shares but that CSP cash went toward MRNA and PTON this week and I might keep doing that while we figure out this COVID second spike shit.", "score": 4, "replies": []}, {"body": "Made $100 last Friday on sq. Been tracking it ever since. Should’ve held though. Today would’ve been much higher. But I hope so man, it’s looking pretty good so far", "score": 2, "replies": [{"body": "Got in last Friday at about $101 after watching it from $98. Went to bed since I’m in Hawaii, woke up it was at $98 something with my call down 50%. I was hoping for a positive Monday and BOOM. $SQ for the win", "score": 1, "replies": []}]}, {"body": "Pretty sure with RH premium they send you notifications when a stock peaks", "score": 1, "replies": []}, {"body": "The amount of retail optimism in SQ would have me a little worried. We picked up PYPL near the bottom of this dip (somehow) and rode it up to here. Probably going to trim/sell soon", "score": 0, "replies": [{"body": "We? Are you Margaret Thatcher?", "score": 1, "replies": [{"body": "Portfolio I work for big hoss. Investment process isn’t usually my choice alone", "score": 1, "replies": []}]}, {"body": "Exactly. Cash app is overblown", "score": 0, "replies": []}]}, {"body": "Same bro, SQ helped me broke my trade virginity today. Finally some gains but I sold eod. It was stuck at 104 half the day and I feel it has hit ATH.", "score": -3, "replies": []}]}
{"title": "Unusual Option Activity Recap for June 22nd, 2020 - NVO, JNPR, FSLY, NCLH", "selftext": "[deleted]", "id": "he2u9c", "created_utc": 1592866722.0, "score": 62, "upvote_ratio": 0.9, "num_comments": 18, "comments": [{"body": "Anyone remember AAL 6/19 21c\n\nfuckin unusual options indeed", "score": 26, "replies": []}, {"body": "FSLY the new meme stock?", "score": 13, "replies": [{"body": "i think it's actually a good stock", "score": 17, "replies": [{"body": "I think cloudflare is better but what do I know.", "score": 11, "replies": [{"body": "We gonna see a pop in NET soon?", "score": 4, "replies": [{"body": "Like the one it just had?", "score": 2, "replies": []}, {"body": "Yes. Read my DD to understand why.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "It's better for video processing but not for security.", "score": 1, "replies": []}]}]}]}, {"body": "buying on open for laugh and giggles", "score": 3, "replies": []}]}, {"body": "It’s probably a lot to ask but would be cool if you could do this every week. Nice job.", "score": 6, "replies": [{"body": "[deleted]", "score": 14, "replies": [{"body": "open up a go fund me page and prey on people like the requestor above. the little ant is asking for a free duty of service.", "score": 1, "replies": []}]}]}, {"body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 3, "replies": []}, {"body": "RemindMe! 7 days", "score": 3, "replies": [{"body": "There is a 47.0 minute delay fetching comments.\n\nI will be messaging you in 7 days on [**2020-06-29 23:22:43 UTC**](http://www.wolframalpha.com/input/?i=2020-06-29%2023:22:43%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/he2u9c/unusual_option_activity_recap_for_june_22nd_2020/fvoshyy/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fhe2u9c%2Funusual_option_activity_recap_for_june_22nd_2020%2Ffvoshyy%2F%5D%0A%0ARemindMe%21%202020-06-29%2023%3A22%3A43%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20he2u9c)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "If Juniper has such a tremendous number of calls, doesn't that mean someone must be quite bullish on it? Is your suggestion for a bear spredit just to be contrarian?", "score": 2, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Ah, that's what that means - I didn't pick up on that. Thanks for sharing your insight!", "score": 2, "replies": []}]}]}, {"body": "Was just giving the man props. Watee_boat, go to bed", "score": 1, "replies": []}, {"body": "What do you think about SPCE 45c 11/20’s move\ntoday?", "score": 1, "replies": []}]}
{"title": "Fed balance sheet has dropped by $74 billion. Any thought?", "selftext": "Unemployment is still high. The economy is far from full recovery. And yet the FED balance sheet has dropped. This is quite interesting. Any thought about this?\n\n&#x200B;\n\nhttps://preview.redd.it/y45463l9rj651.png?width=1066&format=png&auto=webp&s=84db5023c13e48bf34cd9b9130a4720bcf97eaa2\n\n [https://www.federalreserve.gov/monetarypolicy/bst\\_recenttrends.htm](https://www.federalreserve.gov/monetarypolicy/bst_recenttrends.htm)", "id": "he3oga", "created_utc": 1592869773.0, "score": 13, "upvote_ratio": 0.78, "num_comments": 24, "comments": [{"body": "Balance sheet only dropped cos no bank took a new 28 day repo out. Look at H4.1, it explains there. Also, banks are not really using Fed's repo facility anymore, so as the old 28 days operations are expiring once every week fed balance sheet will keep on shrinking. Banks have more than 2 trillion in deposits, so I guess they don't need Fed's money. \n\nhttps://www.cnbc.com/2020/06/21/banks-have-grown-by-2-trillion-in-deposits-since-coronavirus-first-hit.html\n\nOr other reason maybe that fed is conducting bank stress tests, and banks don't wanna hold additional reserve during those tests.", "score": 26, "replies": [{"body": "Thank for pointing that out. I'm still trying to make sense of H4.1. How can you tell from the report that no bank has taken out any new 28 day repo?\n\nYour second point about the bank stress test is quite interesting. Won't the stress test risk causing further damage when the economy is still weak?", "score": 8, "replies": [{"body": "https://apps.newyorkfed.org/markets/autorates/tomo-results-display?SHOWMORE=TRUE&startDate=01/01/2000&enddate=01/01/2000\n\nThis is the page with repo operations detail. Scroll down to Tuesday June 16. \n\nFor the H4.1, you could search for \"Repurchase agreements\" or \"(7)\"\n\nI am not an expert in bank stress tests, but I guess if they think there might be a wave of bankruptcy coming, then it makes sense to see how banks will cope with it", "score": 7, "replies": [{"body": "I learned something new today. Thank", "score": 5, "replies": []}]}]}, {"body": "I read a Reuters article that said it was because of a lack of demand for foreign currency swaps", "score": 2, "replies": [{"body": "I guess they are sticking to their original story cos they reported in September that repo crisis were because of foreign currency swaps. But fed raised repo levels in December saying they expect end of year spike. We still don't know what happen, but it's quite likely that fed was supporting a bank to stay liquid. If you look at the earnings report of biggest banks from last quarter, they made a lot of money from derivatives business. I guess repo amount helped them with that, and now they have more reserves than before.", "score": 1, "replies": []}]}, {"body": "government deficits are what is really crushing interest rates, there are no real free market factors\n\nas long as the government runs a deficit nominal rates will be negative", "score": 1, "replies": []}]}, {"body": "Other central banks aren't coming at us for more.\n\nhttps://www.google.com/amp/s/mobile.reuters.com/article/amp/idUSKBN23T0HP", "score": 6, "replies": [{"body": "This makes sense.", "score": 3, "replies": []}, {"body": "Guess they've bought all the US equities they want.", "score": 1, "replies": []}]}, {"body": "It’s cause all then STONKS they bought have appreciated in value. Now the govt is wealthy again. Problem solved.", "score": 25, "replies": [{"body": "We’ve been jebaited and bamboozled.", "score": 4, "replies": []}]}, {"body": "That's good, no stock crash and the fed can back off, hope to see more if this.", "score": 3, "replies": []}, {"body": "Bubble will go boom", "score": 10, "replies": []}, {"body": "It just means that the Fed will ramp it up very soon. \n\nThe Fed can’t let interest rates run away. Keep an eye on 10 year treasury yields (TNX). They have to suppress them with way more QE very soon or the economy will blow up. \n\nThe Fed needs to do QE as long as people don’t borrow money and even longer. \nJPow probably made a mistake there by keeping QE at a steady and relatively low level. He needs to react soon.", "score": 6, "replies": [{"body": "QE steady and low? We just provided functionally infinite liquidity to the banking system and added 3 trillion to the balance sheet in 4 months.", "score": 9, "replies": [{"body": "Steady and relatively low in the last weeks.", "score": 3, "replies": []}]}, {"body": "The fuck is TNX that shit isn’t showing up on RH", "score": 5, "replies": [{"body": "https://de.finance.yahoo.com/quote/%5ETNX/\nThere are probably better sources to look at it though", "score": 3, "replies": []}]}]}, {"body": "Pop goes da bubble", "score": 5, "replies": []}, {"body": "There’s your sell off", "score": 3, "replies": []}, {"body": "They stopped printing money on June 10th", "score": 1, "replies": []}, {"body": "Now they can pump more money in and pay off more debt. JPOW the real wolf of wall street", "score": 1, "replies": []}, {"body": "First early rounds of fed debt payment", "score": 1, "replies": []}]}
