{"title": "recession conspiracy", "selftext": "banks announced a 30% chance of recession in the next 12 months. This number obviously is coming from their ass. Where do they get numbers like this? The yield curve *inversion* confirms a recession. Obviously by \"increasing\" the odds of recession to 30% they're trying to get us to continue to baghold our shitty SPY calls.", "id": "cpo0jz", "created_utc": 1565670256.0, "score": 39, "upvote_ratio": 0.78, "num_comments": 70, "comments": [{"body": "European banking crisis underway\n\n\nTrade and currency wars underway\n\n\nYield curve inversion in multiple markets\n\n\nEconomic data worldwide falling off a cliff\n\n\nArgentina's economy exploded yesterday\n\n\nCivil unrest booming worldwide\n\n\nWar tensions escalating in Kashmir, NK, HK, Middle East\n\n\nOP: MuSt bE COnSpiRaCy", "score": 124, "replies": [{"body": "Have you seen the German PMI? Just see from Jan 2018 to today. Steady decline from 60s to 40s now. It's worse than most people realize.", "score": 23, "replies": []}, {"body": "Hold your horses—Motley Fool issued a rare “double-down buy” call today. Stonks to the moon.", "score": 13, "replies": [{"body": "I don't know how much MF paid MSNBC, but that permaspot on their page can't be cheap.", "score": 5, "replies": [{"body": "Maybe $500k. Not much in a world where media people get paid millions to basically wordvomit on camera.", "score": 1, "replies": []}]}, {"body": "MF: somehow more autistic than WSB", "score": 1, "replies": []}, {"body": "So \"rare\" it only happens three times a day.", "score": 1, "replies": []}]}, {"body": "Encouraging rational thinking here? That's a bold move cotton.", "score": 23, "replies": [{"body": "I'm all-in highly leveraged  junior gold and silver miners, expecting to outperform GDXJ. Does that bring things down a level? I should really buy calls...", "score": 7, "replies": [{"body": "Do it on margin", "score": 6, "replies": [{"body": "I've literally been researching margin requirements of brokers all weekend, I'm planning on using it to diversify into large caps like Barrick.", "score": 5, "replies": []}]}, {"body": "Me too, it's crazy how these move. I doubled my account in less than 6 months", "score": 2, "replies": []}, {"body": "What tickers? SILJ and SGDJ?", "score": 1, "replies": []}]}]}, {"body": "> War tensions escalating in Kashmir, NK, HK, Middle East\n\nIn my neck of the woods we call that \"Tuesday\".", "score": 3, "replies": [{"body": "Honestly HK is probably the only unique one there", "score": 2, "replies": []}]}, {"body": "This list could be replaced with any such list during all rallies in the past. Events are often not good enough to call bull vs bear markets imo.", "score": 4, "replies": [{"body": "So many people don't understand this.   Even in the fiercest of bull markets, you can make a list of 100 concerning global economic and financial trends.", "score": 2, "replies": []}]}, {"body": "Shit happens all the time around the world for the last 10 years, it means nothing", "score": 1, "replies": []}]}, {"body": "Lmao any bum can tell you a depression is coming.", "score": 24, "replies": [{"body": "I’m already depressed", "score": 48, "replies": [{"body": "Imma dip my balls in some thousand island dressing", "score": 15, "replies": [{"body": "Lolol wtf hilarious", "score": 2, "replies": []}, {"body": "/r/grindr", "score": 1, "replies": []}]}]}]}, {"body": "MARKETS WILL RALLY UP UNTIL ELECTIONS", "score": 18, "replies": [{"body": "Lol. End of the month the carpet gets yanked", "score": 5, "replies": [{"body": "Nah too soon.  Dec", "score": 1, "replies": []}]}]}, {"body": "So our calls expire worthless", "score": 9, "replies": []}, {"body": "Smart money has been cashing out quietly as market makers have been propping the markets up and lulling the suckers into buy and hold the baggage until they yank the carpet out from underneath and let it free fall", "score": 36, "replies": [{"body": "Seriously man, Jerome powell?? KNOWN REPTILE.", "score": 16, "replies": []}, {"body": "I have been out since March and most of my meme stocks are down since then. Autistic luck I guess...", "score": 5, "replies": []}]}, {"body": "[deleted]", "score": 30, "replies": [{"body": "This lol.\n\nidk how many times i have seen Yahoo finance or CNN or some other crap \"news\" place report on how the recession is right around the corner. well i have been at the corner for the past 10 years almost, where that recession at?\n\nI dunno how they count this as winning, but these doomsday prophets always claim to have known all along the moment things look bad, never mind the past years of not being right, what matters is i was finally correct\n\neven a broken watch is right 2 times a day", "score": 13, "replies": []}]}, {"body": "Correct me if I'm wrong, but I thought the yield curve inversion doesn't confirm a recession at all.\n\nI am pretty sure every recession comes with yield curve inversion, but **not** every yield curve inversion comes with a recession.", "score": 17, "replies": [{"body": "Inverted yield curve has  been a reliable indicator of a coming recession but it is not the cause. It’s been a reliable pattern, that’s all.", "score": 19, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "10 year 2 year ya fucking nerd.\n\nhttps://fred.stlouisfed.org/series/T10Y2Y", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Your mom has over predicted.", "score": 1, "replies": []}]}]}, {"body": "I'm +212% since May.\n\nEdit: +350% all time since 2014.", "score": -1, "replies": []}]}]}, {"body": "There are other red flags as well.\nCorporate debt is of the charts. stock buybacks have exceeded cashflow and the trade war and Hong Kong situations have a destabilizing effect.", "score": 15, "replies": [{"body": "Globally, Brexit is causing trouble in the UK and Eurozone too. China's economy is slowing drastically.", "score": 5, "replies": []}, {"body": "> Corporate debt is of the charts. stock buybacks have exceeded cashflow \n\nDSCR... Debt Service Coverage Ratio.  Q4 2018 was a smart money pre-default crisis.  It came on after two years of rate hikes at a little over 1% per year.  3% was the number at which corporate debt roll-over became unsustainable.  Personally, I think they're trying to coordinate both the corporate and sovereign debt defaults.  In fairly short order, the interest on the debt will exceed the deficit.  Once that happens, the whole shebang only has a 18 to 36 months left before implosion.", "score": 2, "replies": [{"body": "If we play this right some of the people on this sub might actually become rich", "score": 1, "replies": []}]}]}, {"body": "This is true, its a case of correlation vs causation.  The correlation has been strong for the past 60 years but only in the US, this doesn't apply to longer dated history nor other countries.", "score": 5, "replies": []}, {"body": "Azntigerlion\n\n>Correct me if I'm wrong, but I thought the yield curve inversion doesn't confirm a recession at all.\n\n>I am pretty sure every recession comes with yield curve inversion, but not every yield curve inversion comes with a recession.\n\nAll 7 times, that have happened with 60 years, this happens: for 6 of those times, within 12 months of the yield curve inverting for a full quarter, there are at least 2 quarters of negative growth (aka a recession), for the 7th, it was within 23 months. You tell me.\n\nYou basically don't *get* that kind of certainty out of financial markets. \n\nSource: The Indicator from NPR: https://www.npr.org/2019/07/17/742779150/yield-curve-you-asked-we-answer\n\nThere's a transcript link and a play button on the left side.", "score": 1, "replies": [{"body": "Thanks!", "score": 1, "replies": [{"body": "He really didnt know...wow", "score": 0, "replies": []}]}]}, {"body": "\n> I am pretty sure every recession comes with yield curve inversion, but not every yield curve inversion comes with a recession.\n\nfalse.", "score": -3, "replies": []}]}, {"body": "that number’s to make weaklings get out of the market, let me tell you the real DD is that we have a 100% chance of another bull run within the next century and that’s all that matters", "score": 12, "replies": [{"body": "False. After the Area 51 raid aliens will take over, markets gone forever.", "score": 11, "replies": []}]}, {"body": "They are using probit models with several inputs that are known to lead into a recession, usually similar inputs that go into the LEI (housing permits, industrial production, jobless claims, etc)", "score": 7, "replies": []}, {"body": "If they say there will be a recession then there will be. It's a self fulfilling prophecy, just like when they say something like, \"tariffs increased so investors jumped out of risk assets and into safer things, oh and by the way there's now an inversion because everyone overreacted, oh and since there's an inversion we're headed to a recession.\" Chain reaction that really means nothing. All actual data we have gotten, and earnings, have been good.", "score": 9, "replies": [{"body": "Bro what data are you seeing that looks good to you?", "score": 6, "replies": [{"body": "Low unemployment", "score": 0, "replies": [{"body": ">Because they've said this same shit consistently for the past decade.\n\nlow unemployment is not an indicator of a healthy economy. its a lagging indicator. look at the previous recessions and unemployment numbers just before, they almost always looked good. not saying that a recession is right around the corner just that unemployment is a shitty indicator to look at for predicting a recession", "score": 15, "replies": [{"body": "Low unemployment rate by itself means almost nothing. If people have jobs but can't pay their bills, the economy ain't doing so hot.", "score": 1, "replies": [{"body": "yeah most of the jobs that have been added in the past few reports are trash minimum wage jobs. who cares if unemployment is low if you cant even buy tendies once a week", "score": 1, "replies": [{"body": ">yeah most of the jobs that have been added in the past few reports are trash minimum wage jobs\n\nCitation please. Everyone says this, it's very fashionable, but I've never seen data put forward.\n\n[This article,](https://www.cnbc.com/2019/04/05/march-jobs-report-more-jobs-added-in-high-paying-industries.html) by contrasts, suggests \"According to data from [Indeed](https://www.hiringlab.org/2019/04/03/march-jobs-report-preview/), middle and high-paying industries have seen faster job growth than low-paying industries since the end of 2017.\"", "score": 5, "replies": [{"body": "Not only that, the US consumer is the brightest picture in this whole thing.", "score": 3, "replies": [{"body": "But retail stocks blow", "score": 1, "replies": [{"body": "Take a look at consumer staples. Retail has increased business risk thanks to Amazon and the likes.", "score": 1, "replies": [{"body": "Like kraft?", "score": 2, "replies": [{"body": "Kraft has increased autist risk", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "So upward pressure on wages, which is bad for profits.", "score": 1, "replies": []}]}]}]}, {"body": "this is the same bs that happened in 2007, all the retards said everything was going tremendous, even though layoffs were hitting the news left and right etc...(just like now!) - then 2008 bush announced the recession etc...", "score": 10, "replies": [{"body": "This is nothing like 2007. Pretty much everyone has been predicting an imminent recession for the last 5 years, literally nobody will be surprised when it happens.", "score": 3, "replies": [{"body": "It wont happen like that.  It never does", "score": 1, "replies": []}]}]}, {"body": "The October crash was a test to see if they could do it", "score": 2, "replies": []}, {"body": ">The yield curve *inversion* confirms a recession.\n\nNo it doesn't. It possibly signals one.", "score": 2, "replies": []}, {"body": "My theory is we are gonna close this year at record highs, US will make a deal with china after the second rate cut (because we are dumb enough not to be realistic enough that we did not need rate cut in the first place) Trump will get what he wants. Smart money is making no moves just holding but the regular Joe's craving into panic selling. Argentina's current president will lose the elections, Iran and the US will keep distance because Trump can be many things but doubt he is dumb enough to get us into WW3 while he wants to get himself reelected. I see a theatrical play that's what I am seeing.  Bank are lending money to the professionals that hold the credentials to be able to pay for those loans only. Last but not less, once we hear Warren decides to dump those +$100b rest assured we are gonna have a full reloaded bull market. I still believe the next year is the year of the bear. Corporate stimulus will be running out of plays, automation, market makers and Brexit as the next theatrical play.", "score": 2, "replies": [{"body": "I agree with the timeline.", "score": 1, "replies": []}]}, {"body": ">30% chance of recession\n\nThis number is just spit out by a model...they probably train a logistic regression on a bunch of factors (probably bond market / yield curve shit, macro data, etc) and report whatever comes out.  The variance on this prediction is huge (i.e. why it's never right), but they can reasonably defend the methodology so I'm sure their dumb clients eat it up.", "score": 3, "replies": []}, {"body": "No recession fellas. We are in the digital world now.", "score": 1, "replies": []}]}
{"title": "Buy 11/15 SBUX calls, win $BECKY tendies. DD inside", "selftext": "Starbucks is releasing their pumpkin spice latte earlier than ever this year, much to the delight of Beckys everywhere. It comes out August 27, meaning their 10/30 earnings will have roughly two months of PSL nitro fuel propelling it further into the stratosphere. Buy long calls and reap the Becky tendies.  \n\nhttps://www.thrillist.com/news/nation/starbucks-psl-2019-pumpkin-spice-latte-release-date", "id": "cpz182", "created_utc": 1565728668.0, "score": 144, "upvote_ratio": 0.96, "num_comments": 71, "comments": [{"body": "[deleted]", "score": 142, "replies": [{"body": "I heard from a source that phi mus were on a big seasonal beverage kick last year. I have a colleague that digs through their trash its really no big deal. Anyways long SBUX strong quarter ahead", "score": 36, "replies": [{"body": "Starbucks barista here it's not even pumpkin spice but the reward program of points for drinks. People go out of their way to spend more to get points for later. It's 115 bucks for a drink ish and everyone uses the app.", "score": 11, "replies": [{"body": "Uhhh doesn't every rewards program encourage people to spend more to get points for later?", "score": 3, "replies": [{"body": "Facts however I haved worked there for 2 years and it's like crack to them. Also the percentage of people using it went from 40 percent to 85 percent ish.", "score": 8, "replies": [{"body": "I like your DD. Stick around coffee boi", "score": 7, "replies": [{"body": "Ty. I have been around since #420 funding secured watching this autistic sub. I got a BIDU option play coming up which I have done 20 hours of DD on so watch out for it after 8/19.", "score": 1, "replies": [{"body": "What's the play?", "score": 1, "replies": [{"body": "I got 21 Dec 20th 135 calls at 2.22 adverage down 2.1k rn but I truthfully believe they are undervalued and the earnings report will show it. They are trading at 98 rn with equity being 78 a share. I just don't see the this stock trading at a 6 to 10 year low with the investment they are doing in future growth. Set a reminder I'll post a pic.", "score": 1, "replies": []}]}]}]}, {"body": "Now you got me curious how the retention rates for other comparable loyalty programs are", "score": 1, "replies": [{"body": "Tbh I have no idea I don't look into that at all. It's also faster to pay that way its just a bar code we scan it takes max 3 seconds compared to 15 seconds for a credit card. Makes my job easier to do bc I can get people in and out faster than any other type of payment.", "score": 1, "replies": []}]}]}]}, {"body": "$115 for the free drink? Holy fuck that's especially retarded. My local third wave spot has 9 stamp system, basically ends up being $20-25 if you buy regular coffe and maybe $35 if you get only lattes. And you can cheap out, fill the card with small drips and then get like a quad shot breve for your free drink no questions asked.", "score": 1, "replies": []}]}]}, {"body": ">my gf and my daughter (both are freshman in college)\n\nThis guy fux", "score": 15, "replies": []}, {"body": "LMFAO", "score": 28, "replies": []}, {"body": "Roll Tide", "score": 20, "replies": []}, {"body": "Wait..WHAT?!", "score": 6, "replies": []}, {"body": "Winner winner chicken dinner", "score": 3, "replies": []}, {"body": "Lmao", "score": 3, "replies": []}, {"body": "your daughter and gf? LOL", "score": 3, "replies": []}, {"body": "Dude my wife(((who is my aunt) and my mother (both frosh/soph or whatever in their assisted living homes))we all do pornhub community together) \n\nFuck i forgot, incest tendies.", "score": 2, "replies": []}, {"body": "r/holup", "score": 1, "replies": []}]}, {"body": "Pumpkin spice in August?\nThat reeks of desperation.\n\nIt's like erecting a Christmas display in October. If it worked everyone would do it and rake in those holiday sales for months but it doesn't and only the desperate resort to it.\n\nPuts all the way.", "score": 51, "replies": [{"body": "Bear Gang Private, reporting for duty.", "score": 19, "replies": [{"body": "Do Bear gangs doody in the woods?", "score": 4, "replies": []}]}, {"body": "Starbucks is in a unique position in that they're everywhere, their e-order system is ubiquitous among their users, and their commodity pricing is more immune to coffee price flux than their competitors.", "score": 6, "replies": []}, {"body": "Competing with dunkin donuts who are doing a pumpkin donuts promo", "score": 2, "replies": []}]}, {"body": "This is probably not a bad play", "score": 34, "replies": [{"body": "SHMP", "score": 8, "replies": [{"body": "$SHMP", "score": 3, "replies": []}]}]}, {"body": "PSL Nitro Fuel needs to be your flair.", "score": 12, "replies": [{"body": "Lol I can only dream...", "score": 8, "replies": []}]}, {"body": "Can’t go tits up on this one", "score": 9, "replies": [{"body": "Not if you've been drinking psls for months. That center of mass will drag them downward.", "score": 3, "replies": []}]}, {"body": "I am always in SBUX calls.", "score": 10, "replies": []}, {"body": "Was this addressed in their guidance? Aka priced in?", "score": 7, "replies": []}, {"body": "I bought some pumpkin spice at Target and tried leaving some out so I could find a girlfriend, but the DNR told me it’s illegal to bait them.", "score": 4, "replies": [{"body": "They just say that to scare you. You're all good.", "score": 2, "replies": []}]}, {"body": "I’ve had 10/18 $100 and 11/15 $97.5 for a while now. Had some pre-ER positions but sold them in the recent uncertainties. Hoping SBUX can see $100 by EOW.\n\nEdit: Pre-ER not pre-IPO", "score": 4, "replies": [{"body": "Damn you must be a big shot.\n\nPre-IPO positions in SBUX\n\nYou run a VC fund or something? Early employee?", "score": 3, "replies": [{"body": "Damn I meant pre-ER lmao", "score": 2, "replies": []}]}, {"body": "Hi I'm new to options and I am wondering, what does this mean as 10/18 or 11/15 ?", "score": -4, "replies": [{"body": "Month/Day", "score": 4, "replies": [{"body": "I am a genuine autist, good sir!", "score": 2, "replies": []}]}, {"body": "I think /r/investing is more your speed if you don’t know something like that.", "score": 3, "replies": []}, {"body": "Dick size", "score": 2, "replies": []}]}]}, {"body": "[removed]", "score": 5, "replies": [{"body": "There's no way *any* pumpkins are harmed in the making of PSL flavoring.", "score": 5, "replies": []}]}, {"body": "Will positive LK earnings in the am have any effect on SBUX even though it only affects the market in the Far East?", "score": 3, "replies": []}, {"body": "Going for 11/15 calls for 110 at open, I think it should easily reach that, anyone else going higher?", "score": 3, "replies": [{"body": "I did $115 YOLO.", "score": 1, "replies": []}]}, {"body": "Alright just bought my first option 11/15 at 115 for $SBUX, lmk how I rank on the ASD", "score": 4, "replies": [{"body": "Bought a call after hours? You probably rank pretty high.", "score": 20, "replies": [{"body": "On the spectrum?", "score": 5, "replies": []}]}, {"body": "In current market that's REALLY far OTM. Next month's reaction to FOMC is going to be crucial to the health of this one.", "score": 4, "replies": [{"body": "So would you recommend buying this one ITM?", "score": 5, "replies": [{"body": "Think of itm calls like buying on margin with the fee up front. \n\nHonestly I don't even know who the F sells deep itm calls. \"I have shares I'd like to disappear randomly and I dislike receiving premium.\"", "score": 6, "replies": [{"body": "Heh. I like you.\n\n/u/grantwashere\n\nI recommend nothing during this chop. ATM to play with the market volatility...maybe? Come out ahead playing with strangles if you're a 0day player. But look at it this way. When SPY was just off of ATH, SBUX had an excellent ER and it raised $7. Within the week it crested at $2 more before ending in this 95-97 range. What catalysts can you see that would entail it raising significantly before an ER or randomly revised guidance? If you can't see any, you're just paying time premium. Could you do really well with a 94c? Sure. 100c? Absolutely. Is it real easy to lose your shirt messing with potential short terms? Yup. There is one ER before Wazzup's term of 11/15. Market has to have large general rise, they have to smash ER, and raise guidance to meet the delta of a 20% stock rise. This isn't $20 for raytheon or LMT, this is $65-$70 for them, comparatively.", "score": 4, "replies": [{"body": "Well you're no fun. You're not necessarily wrong, but still.", "score": 1, "replies": [{"body": "I'm not necessarily right, either. Scared money don't make money and shit. Think you'll close on delta faster than decay? Fuckin roll it and sell. You can find value with 115s, no problem. If you hold it for more than....a month(?) you'll probably start on the decay train. Do the damn thing. (If you can close the majority of 95-115 before 1 month is up, you'll make significant value)", "score": 1, "replies": []}]}]}]}]}]}, {"body": "Rank: Vaccinated", "score": 3, "replies": []}]}, {"body": "IM DOING THIS HAD THE IDEA FOR A WHILE", "score": 2, "replies": []}, {"body": "Calls are fairly cheap as well.", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Click Here to read fresh WSB DD.](https://new.reddit.com/r/wallstreetbets/search?sort=new&amp;amp;restrict_sr=on&amp;amp;q=flair%3ADD).\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs [HERE](https://www.reddit.com/r/wallstreetbets/wiki/linkflair).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "This is genius", "score": 1, "replies": []}, {"body": "Bookmarking this", "score": 1, "replies": []}, {"body": "I love sweating out a PSL while barreling to zero.", "score": 1, "replies": []}, {"body": "Been trading the 9/20 $100C off and on since FOMC meeting and the August two-day recession. Entry around .8 and sell around 1.2. Rinse and repeat for tendies. Long $SBUX, long $BECKY", "score": 1, "replies": []}, {"body": "110 calls here we go!", "score": 1, "replies": []}, {"body": "Can someone please give me a list of $BECKY Stocks?", "score": 1, "replies": []}, {"body": "DD: buy sbux calls, bitches love sbux", "score": 1, "replies": []}, {"body": "No white girl can resist \"PSL\". Hopefully, she also has \"DSL\"\n\nIm autistic ya fuck. what else you expect?", "score": 1, "replies": []}]}
