{"title": "What's your plan for the 2020 recession", "selftext": "Real shit, how do we profit from this?\n\nI'm gonna short $SPY", "id": "creafx", "created_utc": 1565998145.0, "score": 53, "upvote_ratio": 0.84, "num_comments": 74, "comments": [{"body": "Y'all joke, but I bought gold months ago. See you on the other side bitches.", "score": 54, "replies": [{"body": "Same.", "score": 4, "replies": []}, {"body": "Same. Sold in Oct, bought in jan. Moved to gold in April. All about timing lol", "score": 6, "replies": [{"body": "Tell me your secret, what indicators are you using, my timing is off majority if the time....", "score": 3, "replies": [{"body": "Honestly...it was pure luck but i’ll explain my thinking at each point where i made a change in case it’s helpful in any way. In general I always try my best to manage against downside risk and don’t mind actively trading and even holding cash when I think it makes sense. In Sept, I was feeling bearish based on exploding debt everywhere among other things I was hearing/reading so once I lost about 10% from where I was at in early Oct and the market seemed to be red way more than green. I decided to pull out and wait to see what happened. After Powell’s pivot in Jan, I thought it was a good time to jump back in. Bought again on Jan 3. Invested a lot in $AAPL among other individual stocks/etfs I liked and that I thought were undervalued. In April, I had gained about 35%+ and wanted a way to lock in those gains as more data points started pointing to an approaching decline and rate cut talks started coming. I knew gold had been suppressed since 2011 and was trading basically sideways. I figured now is the time to enter PMs and bought $GOLD, $GLD and $SLV. Figuring the worst that would happen is staying roughly even as I didn’t see a probable way that it would erase my gains. By mid may, I realized that my call was right and I started to buy call options and I’ve been buying calls about a month or two out since then.", "score": 7, "replies": [{"body": "JNUG bro.", "score": 2, "replies": []}, {"body": "I see, my mistake there was fear. Sold during December thinking markets would do down more  took my losses and never even cared to look back due to my bitterness. I did however jump into gold during that time thinking that people were going to do the same, so atleast that was a good decision. I jumped back into the markets recently thinking it was going up a little more but I bought it when fed rates were announced and here I am looking at loses, go figure my timing sucks.", "score": 1, "replies": [{"body": "I really like Real Vision on YouTube for market insights because they’ll look at data I would never think to look at and they bring on some big names. They are sometimes more on the bearish side tho. Just listen to a lot of expert opinions, look at different data points and make your decision on where things are going. And remember the market tends to be bullish way more than bearish. However, this might be the time where bears are right. Also, it’s incredibly difficult but try not to make emotional decisions. I find it helps to think of the scenarios that could happen with each trade I make and think about what I would do so when the time comes to decide on what to do I can reflect on those thoughts when emotions were not impacting my decision making.", "score": 1, "replies": []}]}]}, {"body": "Peter Schiff", "score": 3, "replies": [{"body": "He is...BUY GOLD ALWAYS. That's not timing...", "score": 2, "replies": []}]}, {"body": "Look at Daily or weekly chart. RSI and some kind oscillator stoch for example (not stoch rsi). \n\nRSI would help you find bear or bull exhaustion on larger timeframe after that you move to smaller timeframe 1W-1D-4H-1H and look for divergences there and confirm with oscillator current sentiment and look for entries. \n\nYou can also look for past performance and dips where were supported previously and if you wish examine volume profile.\n\nBut this works if you are investing not trading, otherwise you also need detect what kind context you trading - neutral range, bull/bear range, tendency or even bubble, they all have different set of rules.", "score": 1, "replies": [{"body": "Yeah I was using the stoch rsi and got not so good results so I stopped looking at rsi in general,    And using divergence wrong as well. Will need to up my game", "score": 1, "replies": [{"body": "divergence is important on late stages of bull or bear run, so its important part. And if you trade small timeframe it also helps a lot. Don't forget sometimes there will be div which caused by news not technical so you have to more or less ingnore it and looks somewhere else.\n\nfor example tendency usually trade with same structure, accumulation->breakout->div->pullback->final excess.\n\nusing rsi and stouch rsi is kinda pointless because they are same kind but you actually need at least 2 indicators with different set data.", "score": 1, "replies": []}]}]}]}]}, {"body": "This guy fucks", "score": 1, "replies": []}, {"body": "Same", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 75, "replies": [{"body": "Buy high, sell low", "score": 71, "replies": []}, {"body": "God that 2019 recession was a real bitch", "score": 26, "replies": []}, {"body": "The great inversion happened, shits going down now", "score": 4, "replies": [{"body": "[deleted]", "score": 44, "replies": [{"body": "The mod is strong with this one", "score": 6, "replies": []}, {"body": "Gay.\n\nHave a nice life wagecuck", "score": 32, "replies": []}]}]}]}, {"body": "Write calls.  Wait for them to get cheaper.   Buy my calls back.  Eat Lucky Charms marshmallows and throw the cereal out because I'm going to be rich.", "score": 16, "replies": []}, {"body": "Quit my job, throw all my money in, go full retard and lose it all, get evicted, become homeless, will have to resort to sucking dick for $5 on the corner, will die of a heroin overdose\n\nBasically a wallstreetbets dream death.", "score": 39, "replies": [{"body": "Say hi to Jeffrey Epstein for me", "score": 14, "replies": [{"body": "I don’t think I’ll see him. See, I consider myself worthy for the second to last level of hell. He is most certainly at the bottom.", "score": 7, "replies": [{"body": "Right.", "score": 1, "replies": []}]}]}]}, {"body": "Take no action and buy the fucking dip.", "score": 50, "replies": [{"body": "Buying the dip is a fucking action tard", "score": 37, "replies": [{"body": "Lol you're getting downvoted but you speak the truth", "score": 7, "replies": [{"body": "What u talkin bout willis", "score": 2, "replies": []}]}, {"body": "Why are you booing? He's right.", "score": 4, "replies": [{"body": "Like the market, true autists are irrational and easily offended", "score": 2, "replies": [{"body": "Triggered.", "score": 0, "replies": []}]}]}]}]}, {"body": "I'm gonna start only trading futures because they're always green", "score": 12, "replies": [{"body": "Lol try fucking buying them, example yesterday I got long 2849 a 2lot, was down 2,500 in about an hour, today worth 4k", "score": 4, "replies": [{"body": "Options are fun, but the only thing more manly than trading outright futures is opening bear traps with your dick.", "score": 3, "replies": [{"body": "I tell people equity options is like playing piano, futures is BASE jumping", "score": 4, "replies": []}, {"body": "How long until RH offers futures so we can lose our money even faster?", "score": 2, "replies": [{"body": "Shitposting aside, giving futures trading to people who fuck around on RH would be like giving a toddler a flamethrower. \n\nI used to be a broker. I saw a guy who was up 300k go negative 200k in 30 minutes during an early early morning correction on a bullish precious metals run. \n\nLet me repeat that. I saw a dude who \"knew what he was doing\" lose half a mil in the time it takes people to finish a medium sized lunch.", "score": 3, "replies": [{"body": "Fuck yeah that’s the type of shit I’m talking about, sign me up", "score": 7, "replies": []}]}]}]}]}]}, {"body": "Bold of you to assume I'll be alive", "score": 19, "replies": [{"body": "Edgy", "score": 0, "replies": []}]}, {"body": "[deleted]", "score": 9, "replies": [{"body": "and don't forget $CHAIR", "score": 4, "replies": [{"body": "Idk, I'd short chair.  I think it's about to hit the floor.", "score": 11, "replies": [{"body": "Underrated comment", "score": 1, "replies": []}]}]}]}, {"body": "Get really emotional over the political debates, revenge trade and lose all my money.", "score": 29, "replies": []}, {"body": "day trading on the downtrend. but it might reverse at any moment due to the current pricing in of a possible 50 point cut.. and i'm hearing a lot of talk that the economy is actually doing just fine. plus a face-saving soft deal trade deal that might go through to save trump's re-election. too many variables.\n\nproceed with caution.", "score": 6, "replies": []}, {"body": "Long ramen.", "score": 7, "replies": []}, {"body": "Proof or ban", "score": 6, "replies": []}, {"body": "Work for 30 years.", "score": 4, "replies": [{"body": ">tfw wagie", "score": 3, "replies": []}]}, {"body": "Ha \"what are we going to do today brain?\"\n\"Same thing we do every day Pinky... take over the world\"", "score": 4, "replies": []}, {"body": "You mean the 2022 recession? Idk I'll probably keep doing what I'm doing now, but wish I'd done something different back here before the recession.", "score": 3, "replies": []}, {"body": "Only the faithful will be rewarded", "score": 2, "replies": []}, {"body": "Buy some fucking annuities. Cocaine has nosebleed level fees too and that shit gets you going.", "score": 2, "replies": []}, {"body": "Wait it out in my moms basement - same as usual\n\nOnce it passes I’m planning on buying at the top", "score": 2, "replies": []}, {"body": "eat moar lettuce.............?", "score": 2, "replies": []}, {"body": "Put it all on gold", "score": 2, "replies": []}, {"body": "Keep a little cash to the side and wait till blood is running in the streets and then buy whatever is hardest hit. Banks with China exposure for instance. Remember when C went down to $1 and almost got delisted in 2009? https://www.reuters.com/article/us-citigroup-idusn0532847720090305", "score": 2, "replies": []}, {"body": "Sell options on futures", "score": 3, "replies": []}, {"body": "Let’s see.... if anyone but Biden or Trump get elected I will make a fortune buying SPY OTM puts and watching the socialists butt slam the market.\n\nAfter the initial crash, I’ll move to gold after the socialists begin devaluing the dollar through retarded economic ideas.", "score": 2, "replies": []}, {"body": "Puts on everything 🐻", "score": 1, "replies": []}, {"body": "Sell votes for 10$ a pop", "score": 1, "replies": []}, {"body": "Prolly just get rekt unless its one of those lucky weeks where i buy puts cuz i feel like things been going too well for too long.", "score": 1, "replies": []}, {"body": "Prostitución", "score": 1, "replies": []}, {"body": "Well I just bought AMD calls so. That's my plan", "score": 1, "replies": []}, {"body": "BTFDF", "score": 1, "replies": []}, {"body": "Buy High, Sell Low 😎", "score": 1, "replies": []}, {"body": "I see, my mistake there was fear. Sold during December thinking markets would do down more  took my losses and never even cared to look back due to my bitterness. I did however jump into gold during that time thinking that people were going to do the same, so atleast that was a good decision. I jumped back into the markets recently thinking it was going up a little more but I bought it when fed rates were announced and here I am looking at loses, go figure my timing sucks.", "score": 1, "replies": []}, {"body": "Laugh at corporate bootlickers.", "score": 0, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Get the fuck out of this sub", "score": 2, "replies": [{"body": "What the fuck did that guy say?", "score": 1, "replies": [{"body": "Too much gay shit with too much gay thought, reason, and logic", "score": 1, "replies": []}]}]}]}]}
