{"title": "PLTR is the way", "selftext": "All in $PLTR fellas. Yes it popped hugely today, but ask yourself the following:\n\n\"why is there so much activity\"? \n\nWell, most believe it's because the public has finally caught on. Institutions have been buying huge amounts for months. If it was going to drop, it would have as institutional investors sold their 20%+ profits, but so many new investors a floor has been set...This is the dip.\n\nFurther, President-Elect Biden has proposed a comprehensive contact tracing program - PLTR is the only company that could foreseeably handle the task. \n\n**Reasons to Buy**:\n\n1) This company took down Osama Bin Laden (USA BABY)\n\n2) Peter Theil\n\n3) Has great technology and does not have some insane valuation. Biggest no brainer in Saas investing right now.\n\n4) 80% buy rating. Next stop $25\n\n5) Technology Stock, Defense Stock, \n\n6) Tons of cost + contracts coming its way. Plus when Israel and UK announce their contracts BOOM!\n\n&#x200B;\n\n**Reasons NOT to Buy:**\n\n1) It went up 20% it can't keep going up (See TSLA, NIO)\n\n2) You hate America\n\n&#x200B;\n\n**Positions or Ban:** [$PLTR Calls](https://imgur.com/a/FnSF502)", "id": "jp9cgz", "created_utc": 1604683782.0, "score": 83, "upvote_ratio": 0.87, "num_comments": 49, "comments": [{"body": "This is NOT a penny stock. This is NOT a pump and dump show.\n\nThis is a very serious company run by very serious people.", "score": 24, "replies": []}, {"body": "A week ago everyone was shitting on this “ipo flop” and “everyone hates thiel” and “slow gov contracts” LOL. \n\nI bought 2000 shares below $10 and grabbed a bunch of feb calls at $12.5, now up over 200%. \n\nEnjoy the ride dude.", "score": 41, "replies": [{"body": "This guy fucks. \n\nNow WSB finally caught on and is pumping it non-stop. Suckers..", "score": 11, "replies": []}, {"body": "Are you me? I bought 2000 shares around the $9 mark. I live in Australia tho lol...\n\nSide note - Australia will be listing a similar company with government contracts called Nuix", "score": 3, "replies": []}, {"body": "Well done.  Save some coin for when the lockup expires though, especially if we get any new tax laws next year.", "score": 2, "replies": [{"body": "Do you know the date and the amount of shares being freed up? If the stock is hot I would expect a lot of them to keep holding.", "score": 2, "replies": [{"body": "Lockup ends sometime in March (180 days after listing).  80% of the shares remain in lockup.  Shareholders have been holding for a long time, and if there are any changes to the capital gains tax it may incentivize a sell off.  I'm super bullish on PLTR, but it could get bumpy in March or thereafter.", "score": 2, "replies": []}]}]}]}, {"body": "Alright you son of a bitch, I’m in.\n\n11/13 $20c @$.30", "score": 24, "replies": [{"body": "Damn that's next week. I'm 200 shares let's go", "score": 10, "replies": []}, {"body": "Bought this same call just after the pop", "score": 7, "replies": []}, {"body": "Ur fucking retarded just buy normal calls", "score": 6, "replies": []}]}, {"body": "[deleted]", "score": 18, "replies": [{"body": "Expiration days are too close. This is the company you want to buy and hold for a long time.", "score": 6, "replies": [{"body": "[deleted]", "score": 16, "replies": [{"body": "You must not understand that there is a reason why weekly options are called F4gg0t's Delights.", "score": 7, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "I've already maxed out my 401k. The money that I put in moonshots and options is only 20% of my portfolio :)   \nI haven't gone full retard yet.", "score": 7, "replies": []}]}, {"body": "Snitch", "score": 1, "replies": []}]}]}]}]}, {"body": "In with 1.3k shares, let's go", "score": 7, "replies": [{"body": "Good shit dude. I only have 650", "score": 5, "replies": []}]}, {"body": "You sold me. I’m in", "score": 6, "replies": []}, {"body": "I bought PLTR stocks shortly after the IPO. I know this is going to the moon at some point, but I don't know  when. This is the type of company that you want to buy and hold for a long time.", "score": 7, "replies": []}, {"body": "The activity is because they are in talks with the UK government to do their contact tracing. pltr is going. to $20 and should have done that on IPO day. it's getting traction now.", "score": 7, "replies": [{"body": "$20 by december/january", "score": 2, "replies": []}, {"body": "How does it contact trace covid? Canada might need something like this. We literally gave up on manual contact tracing. :/", "score": 1, "replies": [{"body": "Via smartphones GPS.", "score": 1, "replies": []}]}]}, {"body": "PLTR bois checking in. Bought in at $10.50..\n\nHoldings 2k shares and jacked to the tits in calls/leaps.", "score": 12, "replies": [{"body": "1000 @9.44 checking in.", "score": 4, "replies": []}, {"body": "$2.5 Jan2022 Calls here", "score": 2, "replies": []}]}, {"body": "This is the way.", "score": 6, "replies": []}, {"body": "If you always find yourself not getting in before everyone else....well this is yo chance. I know I bought 1000 shares", "score": 6, "replies": [{"body": "100 on monday", "score": 1, "replies": []}]}, {"body": "Gotta say, totally hate america, but love money...", "score": 7, "replies": [{"body": "America hates you bitch", "score": 4, "replies": [{"body": "Love you ;)", "score": 0, "replies": [{"body": "Don't worry America forgives you if you eat her out", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 4, "replies": []}, {"body": "Buy shares or leaps. This is a long term play.", "score": 4, "replies": []}, {"body": "Shhh my 401k loan hasn’t cleared yet", "score": 4, "replies": []}, {"body": "Bought a leap. Lets go!", "score": 3, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "That's like 7k in single position that will expire in two months. You are either rich and have money to burn, or you have gone full retard.\n\nWith the same money you can buy 15 calls for 11/2021 $15 strike. PLTR is going to the moon, but you don't know if it will happen in the next two months; they have not announced ER yet.", "score": 5, "replies": [{"body": "Oh I’m sorry I thought this was America", "score": 12, "replies": []}]}]}, {"body": "Activity isn’t retail investors - their volume is a pimple on an elephant’s ass. The institutions needed to wait for more research to be released so they could fulfill their fiduciary duties of due diligence before they invested. Those research reports were just released and now making their way into institutional positions.", "score": 5, "replies": []}, {"body": "I sold at 11.50, fuck me", "score": 2, "replies": []}, {"body": "$9.29 here; all you guys who bought my CC for the past couple weeks with no reward -- sorry (but thanks!)", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Wayyy too long of a strike price, why not $14s?", "score": 2, "replies": []}, {"body": "This is a terrible idea.", "score": 1, "replies": []}]}, {"body": "Bought my first Call after being in WSB for a minute.  PLTR jan 15,2022 17.5 C. \nOnly had enough for 4c at 4.2.  Hope it pulls through", "score": 1, "replies": []}, {"body": "I bought at like $9.50 and sold at $10.30. Yea me", "score": 1, "replies": []}, {"body": "In since the week of the IPO,  believe in this company's future", "score": 1, "replies": []}, {"body": "PLTR - imagine them helping with digital fed coin to combat the rise of digital yuan and ant financials!", "score": 1, "replies": []}]}
