{"title": "Which stock should I buy puts on to hedge against a crash?", "selftext": "I was thinking about buying some puts to hedge against a crash. Most of my money is in SPY but I don't have enough invested to justify buying a put (it would cost me more to buy a put than I would gain in the same time), so I'm looking for some other stocks to help me hedge against a crash.\n\nI think a good bet would be one of those stocks that grew a lot recently like PLTR, but I'm sure there are even better options out there.  \n\n\nI think the stock that increased by a lot within last year, but have a low IV now would be the best.", "id": "pnjhpk", "created_utc": 1631552233.0, "score": 27, "upvote_ratio": 0.66, "num_comments": 93, "comments": [{"body": "QQQ and SPXL come to my mind initially.", "score": 25, "replies": [{"body": "Yes SPXL is a really good idea. In the recent crash it fell by almost 75%. Anyone who had a put on that must have made a fortune. I think any leveraged ETFs would be a good bet", "score": 11, "replies": [{"body": "Options on leveraged ETFs usually work out to behaving about the same as their unleveraged counterpart since the implied volatility is proportionally higher.  SPY options will probably be better due to liquidity issues.\n\nIt's not like the people trading options on leveraged ETFs don't recognize that it's a leveraged ETF.", "score": 27, "replies": [{"body": "This is right, and it means you're probably better off just picking the underlying index/sector to use.", "score": 11, "replies": []}]}, {"body": "Dumb question, but when you buy puts on SPXL your max loss is still 100% right? You can’t lose even more because it’s shorting or something right? I’m unfamiliar with leveraged etfs but see a warning when purchasing on ameritrade and don’t really understand it.", "score": 5, "replies": [{"body": "Buying any option limits your risk to what you paid for the contract.  That’s it.  SPXL isn’t bad to buy puts on, but it isn’t very liquid.  Watch out for the bid ask spreads.", "score": 10, "replies": [{"body": "Awesome thanks.", "score": 2, "replies": []}]}, {"body": "Unless your broker charges some extra fees for buying levergaed ETFs options (which seems unlikely) your max lose is how much you paid for a put. So if I buy a put for 100$ then my max loss is 100$. Put options are a contract that gives you the right **but not obligation** to sell 100 of given stock at a given price. So if you don't want to you don't need to exercise it and just let it expire and all you lose is what you paid at the beginning. Usually people don't exercise them and just sell them to someone else before expiry.\n\nShorting is a different thing. When you short you borrow shares from someone and sell them. Then when the stock falls you buy them cheaper and give them back. However if the stock goes up you then need to buy them for more.\n\nI think the reason why you get a warning is because leveraged ETFs are very risky. So their price might change a lot and you might quickly lose all of the money you invested in your put, while stuff like SPY move slowly so you have time to sell your put before it loses most of it's value.", "score": 6, "replies": [{"body": "Awesome thanks. I play options every day, so I have no problem there. Just didn’t know what the deal with options on leveraged ETFs are. But that makes sense, thank you. Seems like a solid play for those expecting a broader market dip, which I am.", "score": 3, "replies": []}]}, {"body": "Only when you sell a call is your loss potential unlimited", "score": 0, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You have a max loss when selling a put. It’s the obligation to buy the shares. You have to put up collateral equal to the amount it would cost to buy the shares at the chosen strike price", "score": 1, "replies": []}]}]}]}, {"body": "Hopefully the next crash will repeat the same debacle, 75% would be awesome gains for premium. SPXL has been on a consistent bull run since last november though so I am concerned buying put options with DTE around 3 months; the extrinsic value may decrease as time decay factors in. Looking at leaps dated 2023, and 25 strike is currently $2 with .02 delta. If the market crashes 75%, you'll make around 2k per contract. I'll take that 1000% gain please.", "score": 2, "replies": []}, {"body": "the spread on SPXL is horrible", "score": 1, "replies": []}, {"body": "OP your question doesn't really make sense buying a put will offset your delta exposure. Why do you say you cannot justify buying a put based on your position size?  If you have 30 shares of spy then a 30 delta put will make you delta neutral. If you are hedging you don't need to be neutral just offset your delta exposure. the Idea is to limit your losses but that comes at a cost and is generally more expensive once the market hast started moving down. The other option would be to sell a call credit spread.", "score": 1, "replies": []}]}]}, {"body": "An idea would be to screen for the high beta stocks. Outsized drop as compared to overall market.", "score": 20, "replies": [{"body": "Yea this seems like a great idea. To be honest I'm not that advanced in options so I didn't even realize how useful beta is in this case.", "score": 2, "replies": [{"body": "Or you can buy a put using SPXL (leveraged SPY ETF), if it goes down it will go down big... your put can lose entire value big (fast) if it goes up... Works both ways...", "score": 2, "replies": [{"body": "Yea someone commented this below. This seems like the best idea (in my opinion) since even if my put loses value over time in an event of a crash, due to the leverage, the change might be so large (-75% during covid crash) that it will make all of that and more back. And if there is no crash then I just paid some \"insurance\".", "score": 3, "replies": []}]}]}]}, {"body": "[deleted]", "score": 19, "replies": [{"body": "Buy the dips——is the recipe for the poor house!   America is in deep trouble as never seen before", "score": -20, "replies": [{"body": "You people are insufferable", "score": 3, "replies": []}]}]}, {"body": "GME has enormous negative beta, calls on the VIX are also a great hedge. Not financial advice! My vix calls are up 10% today and shit hasn't even hit the fan yet!", "score": 14, "replies": [{"body": "Strikes?", "score": 2, "replies": [{"body": "I got 95$ for Dec 17th on VXX. I think if the market is gunna take a hit its going to be yuge", "score": 1, "replies": [{"body": "That is absolutely retarded. I’m getting some too.", "score": 8, "replies": []}, {"body": "95", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Market goes down hedgefunds lose liquidity, short positions start to unwind. I would like to think otherwise 😁", "score": 1, "replies": []}]}]}, {"body": "If you dont have enough to buy a SPY put, then you probably shouldn't be hedging yet. Save more, and think about that down the road. That said, I love selling covered calls as hedge on current positions. Or short futures. Buying puts  for anything other than short swings has been a net loss for me", "score": 10, "replies": []}, {"body": "Why not do a put debit spread on SPY?", "score": 7, "replies": [{"body": "I think the problem with put debit spread is that it caps your gains, so you need to be very precise with your prediction. If I assume 20% drop and it drops 40% it doesn't help me much with my loses in other investments.", "score": 0, "replies": [{"body": "It can be tweaked though.  Add an additional put that is the farthest OTM you can get, if you want.  Then it becomes max gains all the way down to SPY at $0.00.  Chances are an extreme OTM put isn't going to do anything other than expire worthless and be a waste of cash, but if you toggle it closer it will have the same net effect at the detriment to more max loss possible if SPY goes sideways or up.\n\nThis is for Jan 20/2023:  http://opcalc.com/AJ4", "score": 5, "replies": [{"body": "Smart.", "score": 2, "replies": []}]}, {"body": "You think the market will drop 40% at once or even 20%? You don't want to hold puts long term it's not a good idea. I stick to spx weekly put debit spreads and move in and out as needed.", "score": 1, "replies": []}]}]}, {"body": "arkk easily. all the illiquid growth stocks its got its grimy hands in will be the most affected by crash, for which the biggest potential reason would be the fed tapering earlier", "score": 8, "replies": [{"body": "Plus they are the major holder of a lot of those smaller speculative stocks. If people start pulling money out of ark funds, those stocks will be crashing extra hard on top of the fundamentals which you mentioned", "score": 2, "replies": []}]}, {"body": "Buy SPXS calls. 3X leverage. \n\nYou're welcome.", "score": 3, "replies": []}, {"body": "Honestly?  \nGiven my history over this last year, anything that I bought calls on.  \n100% payout rate.", "score": 3, "replies": []}, {"body": "maybe u can buy an inverted etf?  something like sqqq", "score": 6, "replies": []}, {"body": "Gme", "score": 10, "replies": [{"body": "Oh you saucy devil...", "score": 2, "replies": [{"body": "😉", "score": 1, "replies": []}]}]}, {"body": "Find stocks that have been hot and on a run. They’re likely the ones people have over leveraged on the buy side so the sell off will be bigger", "score": 2, "replies": []}, {"body": "I buy calls on SPXS and SQQQ as well as FAZ and UVXY for the volatility spike", "score": 2, "replies": []}, {"body": "Did anyone say, calls on SRTY, TZA, other 3x leveraged bear ETF's? A less expensive place to start for the same effect.", "score": 2, "replies": []}, {"body": "VXX is also good it’s a trade on volitility but if market goes down it can move fast. I have traded options on it many times", "score": 2, "replies": []}, {"body": "PLTR is likely the last stock you should bet against in the future. Ignoring market conditions, they offer one of the most advanced products available in their industry. In a market downturn, this advantage could be what allows them to survive when competitors falter. I would choose a dumb meme stock from wsb that doesn’t actually have any fundamentals", "score": 2, "replies": []}, {"body": "Calls on USD funds, UUP USDU, or puts on UDN", "score": 2, "replies": []}, {"body": "Spy puts work fine. You can make up for a 20% decline in your pertfolio with only .05-1% of your total portfolio in2-3 month out I think 20% otm spy puts. If half the time in the options runs out sell them and add a Lille more and repeat. Google how to set up a tail hedge.\nEdit- not advise", "score": 2, "replies": []}, {"body": "I’m not a scientist but maybe SPY", "score": 2, "replies": []}, {"body": "GME", "score": 3, "replies": []}, {"body": "ARKK", "score": 2, "replies": []}, {"body": "ARKK as it reflects the market sentiment", "score": 2, "replies": []}, {"body": "I would go with the opposite to what the media promote. Not financial advice though just me", "score": 2, "replies": []}, {"body": "100% a guess. But something like General Motors.", "score": 2, "replies": []}, {"body": "$LIQD", "score": 1, "replies": []}, {"body": "Food, fuel and booze.", "score": 1, "replies": [{"body": "it’s a shame i can’t trade options over here otherwise i would also grab a few vix options", "score": 2, "replies": []}]}, {"body": "Stocks only go up!", "score": 1, "replies": []}, {"body": "Wouldn't any stock with a high beta and higher likelihood to crash also have higher premiums on the puts to adjust for that?", "score": 1, "replies": [{"body": "Yeah, the OP is asking a question which will inevitably lead them to realize that there's no free lunch.", "score": 2, "replies": [{"body": "I think that is correct if we are talking about specific stocks. But the overall market crash does not seem to be fully priced in. If you assume the market might crash within next 2 year then by buying a SPY put at 80% of current SPY price for December 2023 you are only paying around 6% for the current SPY price. If we don't get a crash within 2 years you will most likely make more than 6%, if we do get a crash you will make your money back with that put. The only problem for me is that I have way less funds so 6% of SPY is a lot larger percentage of my portfolio.", "score": 1, "replies": []}]}]}, {"body": "One of the fang names. They are very correlated with SPY.", "score": 1, "replies": []}, {"body": "SOFI", "score": 1, "replies": []}, {"body": "Just go long as fuck on GameStop and you will be safe when the market crashes", "score": 1, "replies": []}, {"body": "Uvxy for sure. Or FAZ. Get those puts printing", "score": 1, "replies": []}, {"body": "GameStop shares. Hedge against the market, and won’t expire like options", "score": 1, "replies": []}, {"body": "GME and amc", "score": -1, "replies": []}, {"body": "Duhhhhh obviously  AMC & GME👍🙌🤙", "score": -1, "replies": []}, {"body": "Meme stocks", "score": 0, "replies": []}, {"body": "G", "score": 0, "replies": []}, {"body": "Higher the expected move of a stock more expensive the foot option is going to be. If you’re sure about the direction you can start by selling calls or call spread", "score": 1, "replies": []}, {"body": "Bad idea", "score": 1, "replies": []}, {"body": "I have puts on TSLA, mostly Jan expiry.", "score": 1, "replies": []}, {"body": "SPY puts seem to be the way...\n\nOops. Thought I was on WSB 😂", "score": 1, "replies": []}, {"body": "You could also buy a call on the junk bond etf (HYG is the ticker I think it might be HYC) but I haven’t tried this so I’m not sure.", "score": 1, "replies": []}, {"body": "I'd be careful on betting for a crash.  It will happen, but the market has a way of staying high much longer than it should.", "score": 1, "replies": []}, {"body": "Hands down SOXX - holds all the semis which are already expensive plus it has a low IV.", "score": 1, "replies": []}, {"body": "Could also do long calls on uvxy or vix", "score": 1, "replies": []}, {"body": "Apple", "score": 1, "replies": []}, {"body": "I would sell tight CC’s and close my CSP’s and stay on the sidelines. \n\nYou are fighting the Fed.", "score": 1, "replies": []}, {"body": "Shares of GME", "score": 1, "replies": []}, {"body": "Why dont you just buy sqqq?", "score": 1, "replies": []}, {"body": "Tech growth stocks, Roku and twilio have already dippeda bunch from theirhighs", "score": 1, "replies": []}, {"body": "Wmergency services, raw materials, foreign markets.", "score": 1, "replies": []}, {"body": "vix derivatives", "score": 1, "replies": []}, {"body": "DRV calls are hella cheap", "score": 1, "replies": []}, {"body": "You could get calls for vix", "score": 1, "replies": []}, {"body": "your fear index", "score": 1, "replies": []}, {"body": "Set stop losses and move a chunk to cash.\n\nIf you're not sure which options to use to hedge and the funds to cover are not huge, then this is probably the simplest way.  If trailing stop losses you'll benefit from continued upside, but as market turns down you'll be getting out nearish the top.  Having good cash reserves means you can weather the storm and have opportunities to build wealth by buying nearer the bottom.  You won't time the market properly, but you can at least be well positioned for your expectations.\n\nThere are two hard issues however - one is that working out when to buy back in is tricky - so often I've been stop losses out and decided to buy back in as I expect it to bounce right back (lesson - make SL lower).  The second is that you can lose out at market open if sticks gap down significantly but then go straight back up.  You can solve this by having your stop losses be manually activated, so that you keep an eye on the market first thing and exit if you believe in the bear thesis and your level is breached, but can hold off if you see indicators this is temporary.  Could then set them for the rest of the day if you wished.", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "This comment has been automatically removed. Discord and other chat links are not allowed as an anti-spam measure.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/options) if you have any questions or concerns.*", "score": 1, "replies": []}]}, {"body": "QQQ or if your more risk reward tolerate then TQQQ", "score": 1, "replies": []}, {"body": "Just buy and hold your spy. Dca in and then you’ll benefit from any dips.\n\nIf you want a fancy options play, then sell a credit call spread on vxx after the Vix spikes. Try to sell at like 30 delta, but always protect yourself with the higher long call. Know your max profit and loss before entering the trade.", "score": 1, "replies": []}, {"body": "Tsla", "score": 1, "replies": []}]}
