{"title": "[deleted by user]", "selftext": "[removed]", "id": "ppj8vl", "created_utc": 1631817549.0, "score": 211, "upvote_ratio": 0.91, "num_comments": 96, "comments": [{"body": "There might definitely be a future. I've been following Aker Carbon Capture for quite a while. They started out over 15 years ago: https://akercarboncapture.com/about-us/\n\nProblem that I see is mostly profitability, but as companies are forced to reduce emissions, that might change rapidly.", "score": 59, "replies": [{"body": "The catalyst I see is carbon tax. Once the cost of capture is less than the tax it'll be a no brainer. And that should happen relatively soon in some countries. \n\nThere's also going to be a market for carbon credits which will be interesting. For example airlines will probably offer carbon zero flights for an additional cost and where'll purchase carbon credits from these companies.", "score": 30, "replies": [{"body": "I agree. Once companies start getting regulated, demand could soar. I'm waiting for a bit of a downturn in the markets, and will be eyeing an entry in ACC as they'll be likely to capture lots of the EMEA markets, pun intended. \n\nInteresting sector, no doubt.", "score": 8, "replies": [{"body": "Check out the European Energy Exchange (EEX) if you’re not familiar", "score": 2, "replies": []}]}, {"body": "There is a market for carbon credits. I've been trying to learn more on this topic. Check out KRBN ETF. “\\[It's\\] benchmarked to IHS Markit’s Global Carbon Index, which offers broad coverage of cap-and-trade carbon allowances by tracking the most traded carbon credit futures contracts.”  \n\n[Here is a link to the IHS Markit](https://ihsmarkit.com/products/global-carbon-index.html)\n\n[Here is a link to details of the KRBN ETF](https://kraneshares.com/krbn/)", "score": 1, "replies": []}]}]}, {"body": "As someone who works in CCS, carbon capture and sequestration, most of our projects are quickly shutdown. For a small facility to capture CO2 from a flare cost around $177 million and this is a small facility. We have quotes for other large players in the $600 million range.", "score": 12, "replies": [{"body": "Why are they quickly shut down? Because of the price?", "score": 3, "replies": [{"body": "Yeah price is usually the limiting factor, especially for smaller players.", "score": 3, "replies": []}]}]}, {"body": "Let me first say that CO2 must be removed from the atmosphere.\n\nBut price is irrelevant. What matters is how much energy you need to remove the carbon. It's easy to see that if you need as much energy to capture CO2 as that you get from burning the oil, you have no reduction of CO2 emissions, you're just depleting resources faster.\n\nAs long as all governments keep subsidizing fossil fuels, we are not serious about the problem.\n\nhttps://www.imf.org/en/Publications/WP/Issues/2019/05/02/Global-Fossil-Fuel-Subsidies-Remain-Large-An-Update-Based-on-Country-Level-Estimates-46509", "score": 47, "replies": [{"body": "Any carbon capture would be powered by localised renewable energy (geothermal or hydro), or by waste heat from an industrial program\n\nPull from the grid would obviously be pointless", "score": 14, "replies": [{"body": "[deleted]", "score": 16, "replies": [{"body": "To be fair, renewable energy is already cheaper than coal generated power. On top of that, renewable energy has peak production periods where excess production (superpower) could be used for things like carbon capture. If we are still burning fossil fuels to generate electricity in, let's say 15 years or so, no amount of carbon capture is going to be enough.", "score": 8, "replies": []}]}, {"body": "Still, if the ratio is 1 to 1 (if it costs as much energy to remove CO2 as you got from burning the oil) then you need 65,000 powerplants worth in renewables to remove the CO2 of the 65,000 powerplants we have now. With the remark that not all 65,000 powerplants are fossil fuel plants, but on the other hand the CO2 problem is much greater than just electricity.\n\nThe scale does not make sense.", "score": 6, "replies": [{"body": "If you're worried about the energy balance here is the paper describing the technology Oxy is planning on using. It is a proven carbon negative process. There is definitely lower hanging fruit that needs to be addressed but the carbon capture industry needs to develop at the same time. https://www.researchgate.net/publication/325639480_A_Process_for_Capturing_CO2_from_the_Atmosphere", "score": 4, "replies": [{"body": "The machine requires 2447 kWh per ton of CO2.\n\nA barrel of oil produces 1700 kWh per 0.43 ton of CO2.\n\nYou don't need 65,000 powerplants but 3/4th of that. Still not feasible.", "score": 4, "replies": [{"body": "Where are you getting 2447? I'm seeing 5.25 GJ + 366kWh = 1820kWh. It's not the lowest hanging fruit but it is a viable tool to use", "score": 3, "replies": [{"body": "I've converted the 8.81 GJ number, which is the first number they mention. There are losses when converting gas into a higher grade electricity source, which is why your number is lower. In any case, still a lot of powerplants.\n\nWell anyway, I hope it's useful, but I'm not jizzing my pants. You can't do cheaper than some solution in which nature captures the carbon and even that would be needed on a scale the size of current agriculture.", "score": 3, "replies": [{"body": "Right. U.S. farm bill will probably include a credit trading program in the future. Producers would benefit, livestock has potential. Heard about a netting made to capture the stink from poultry fan setups. Gonna be all sorts of subsidies floating around.", "score": 0, "replies": []}]}]}]}]}]}]}, {"body": "Not true. As solar & wind energy capacity increases, there will be a lot more \"excess\" electrical power available to power CO2 capture. This is renewable energy that would otherwise be wasted. And it offsets the CO2 produced by other industries that are more difficult to switch to renewable energy (e.g. airlines).", "score": 2, "replies": [{"body": "There's a difference between relying on carbon capture to offset industries that can not be electrified, and carbon capture to limit warming to 2C. The IPCC requires negative emissions or we'll end up between 3C and 5C.\n\nFor the second case you are using renewables to capture carbon, instead of using the electricity directly, doing the same thing with twice the resources.\n\nThere's no excess power. Everyone is looking at this \"excess\" power, bitcorn, aluminium. The growth of energy demand exceeds the growth of renewables.\n\nEdit: resubmitted because comment was removed by bot after edit.", "score": 1, "replies": []}]}]}, {"body": "I don't think it will be huge if the people found out it is a scamm they never can get close to their goals to carbon capture (whit the current technology). \n\nPersonally I have my doubts in being huge I think people will invest on more efficients/cheaper ways to reduce the carbon instead of capturing it. \n\nAt this point I see this as a scam they can only survive whit the government grants that's enough to consider it a scam in my books.", "score": 25, "replies": [{"body": "As an Environmental Engineer, I can't stress how much of a scam \"carbon capture\" is.\n\nThe problem is there a ton of people with no concept of how big of a scam this is and will keep pimping it.", "score": 27, "replies": [{"body": "The larger problem is that in a lot of models, we're beyond the event horizon when it comes to carbon and climate change. In order to halt or reverse the effects of climate change, we **must** capture carbon from the atmosphere. As much as carbon capture currently is a scam, we've reached the point where it's necessary to avoid the worst outcomes of climate change.\n\nSo despite currently being a scam, we've got to invest in developing the tech to the point where it's usable alongside a fully green worldwide economy.", "score": 15, "replies": [{"body": "plant trees.", "score": 8, "replies": [{"body": "The best research today suggests that if we planted a trillion trees, it would absorb only 25% of current emissions.\n\nThat's no reason not to do it, 25% is amazing. But it's unfortunately still nowhere near enough.", "score": 5, "replies": []}]}, {"body": "There isn't a facepalm big enough to respond to this.", "score": -5, "replies": [{"body": "Alright let's talk about it. Carbon Capture and Storage (CCS) as it exists right now, requires too much energy to function well, namely in that in order to power CCS systems at scale, generating electricity for those systems produces nearly the same amount of CO2 as the systems take out of the air, if those CCS systems are powered by fossil fuels.\n\nHowever, CCS systems don't HAVE to be powered by carbon emitting energy sources, and they DO actually work - albeit not entirely well.\n\nThe main problem, beyond electricity supply, is that we pay fossil fuel emitters to build and manage their own CCS systems, which means companies like Shell and Exxon can take billions of taxpayer dollars for CCS programs, and not really worry about what sort of success they're having, because there are no fines or penalties for missing CCS targets. They can pocket the money and say \"Hey we tried\".\n\nSo in order for CCS to be viable, clean energy supply, efficacy, and corruption are barriers that need to be overcome. The good news is that those problems ARE solvable.\n\n1. Use high density, clean energy to power your CCS systems. Solar and hydro-electric will work. Nuclear is probably the best short term emergency candidate though.\n\n2. Efficacy? The good news is that CCS tech actually DOES work. The bad news is that it works at nowhere near the scale where it'd make a difference. Scaling up is a problem that, I'd say, scientists and engineers should be working on solving, rather than making snide remarks about on the internet.\n\n3. Corruption. As a start don't give billions of dollars to polluters with the expectation they won't pocket that money and pay lip service to the CCS goal. We know fossil fuel companies don't care about climate change, so don't put them in charge of fighting it. Establish independent, state owned or crown corporations responsible for implementing and monitoring free air carbon capture systems, and phase out fossil fuels entirely, as quickly as possible. Net zero isn't enough. We need to be a carbon negative society.\n\nThese are all difficult, but solvable problems. And that was my point -- as the CCS paradigm currently exists, it is a scam. But it doesn't have to be, and going forward, if we hope to stand any chance at all of curbing climate change, CCS must become viable. We don't have a choice.", "score": 4, "replies": []}, {"body": "That is a rather silly response.\n\nIf you have information why you disagree with the former post share it instead of delivering an insult.\n\nIt is not only good manners, but you claimed to be an expert in the field, which would even moreso create responsibility to share information on a topic that in this context interests us financially but aside from that is a matter of great concern for humanity in general.", "score": 5, "replies": []}]}, {"body": "Nah, what we need to do is quit relying on models. Models are not science, and are a poor substitute for science. They are used when (a) researchers are lazy, and (b) when something is not understood very well. And frankly, global atmospheric models have a very poor track record when it comes predicting just about anything accurately. Then, consider that NOAA literally invents data in their models, and that ice cores indicate that the effects of carbon dioxide are asymptotic when it comes to temperatures, and that a single volcanic eruption can spew more greenhouse gases into the atmosphere than all of mankind in all of history, and what you begin to perceive is that all this focus on CO2 is merely a mechanism to separate serfs from their money, because believe me, the bottom of the pyramid will foot the bill, not the top.", "score": -2, "replies": [{"body": "Models are literally science, made by scientists", "score": 4, "replies": [{"body": "Is that sarcasm or ignorance? I can't tell.", "score": 1, "replies": []}]}]}]}, {"body": "Sadly the majority of the people think this is the future \" we are helping the future generations\"  and that's the annoying part they manipulate the tax payer so much they don't even know what's real but they want to make the better decision for their kids.", "score": 4, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "It may not be known to the public, but everyone else is horrified that the IPCC relies on unproven carbon capture technologies on a scale you mentioned in your post. What energy and minerals are you going to use to build such infrastructure.\n\nNot to mention fraudulent corporations like Shell that greedily accept billions in subsidies for these and other technologies that don't make sense in any solution matrix.", "score": 12, "replies": [{"body": "Well can you blame Shell for accepting free money to do something pointless while also improving their PR?", "score": 3, "replies": []}, {"body": "So what would you have us do, let the carbon keep building? It seems like Carbon Engineering has proven the concept of DAC now", "score": 1, "replies": [{"body": "It's way more cost effective to implement technology that vastly reduce carbon emissions or go carbon neutral in its entirety. Carbon Capture is kind of a dead end like hydrogen as fuel for power plants. Best carbon capture are forest man", "score": 3, "replies": []}, {"body": "And what do they do with the captured carbon? Make fuel.", "score": 1, "replies": [{"body": "Inject it into the ground at a depth where it can't be released to the atmosphere again.", "score": 1, "replies": []}]}, {"body": "He’s saying instead of focusing on capture focus on reduction", "score": 1, "replies": [{"body": "The point is there already IS too much carbon in the atmosphere to the point we've warmed to what,  1.2C already? Can't keep track. Even if we magically switched to 100% sustainable everything today we should still focus on removing some of the excess carbon we historically emitted and become carbon negative. DAC seems like the best potentially scalable option at the moment but I also just heard of some plankton farming that may be able to offset some and sink to the bottom of the ocean in solid form. Yes, some companies will try greenwashing and try to delay their actual transition which is no good. I feel the green transition will happen faster than most think (currently working in the industry and it's super exciting), but not quick enough without considering carbon negative options.", "score": 1, "replies": []}]}]}]}, {"body": "I don't, but then the IPCC isn't using science.", "score": 0, "replies": []}, {"body": "I'm certain the IPCC doesn't know their asses from holes in the ground.", "score": -4, "replies": []}]}, {"body": "Sorry I’m definitely out of the loop on this one. Why is carbon capture a scam? I thought they just took carbon out the air and get paid for it by companies that want to use them or something along those lines. Thought this was a pretty good investment opportunity considering climate change is only getting worse.", "score": 2, "replies": [{"body": "It’s not profitable or efficient, insanely resource intensive to build run and maintain if you want to make any sort of impact. That money is better spent on green energy tech and r&d to reduce emissions or capture at the sources. Also planting the right  trees and mainting forests (rip Amazon) is infinitely more effective.", "score": 2, "replies": [{"body": "I see. I assume the costs surrounding carbon capture aren’t gonna go down enough despite the demand possibly increasing for them. Cheers for the explanation.", "score": 1, "replies": []}]}]}, {"body": "Colour me sceptical of anyone calling something a scam and saying they know what they're talking about, when they're not using arguments to prove their point.", "score": 1, "replies": [{"body": "One of us is a state licensed Professional Engineer with 25 years of experience.\n\nThe other is some know-nothing schlub spouting off on Reddit.", "score": 1, "replies": [{"body": "Insulting random strangers you know nothing about on the internet doesn't make you seem any more trustworthy.", "score": 0, "replies": [{"body": "Refusing delivery of the facts, does not make them not facts.", "score": 0, "replies": [{"body": "No, arguments and proof make things facts. So far you've delivered none.", "score": 1, "replies": []}]}]}, {"body": "Can you tell me more about why CCS is a scam? Do you mean, in its current state? Because I'm reading Shell's Sky Scenario and one of their models to reach net zero by 2070 worldwide is to build 10,000 large CCS facilities, as opposed to the 50 that are in operation now. I'm trying to self-study on climate change finance and economics so anyway input would help. I know this is an old thread sorry.", "score": 1, "replies": []}]}]}, {"body": "2nd law of thermodynamics, people will never understand this. We live in a closed system.", "score": -2, "replies": []}, {"body": "Please explain!", "score": 0, "replies": []}]}, {"body": "I think the point is of the 40 Gigatonnes per year, 20 can be achieved using alternatives with less/no emissions. The problem is the other 20 Gigatonnes which will need things like carbon capture", "score": 4, "replies": [{"body": "So nuclear energy? Instead of natural gas...\n\nI ill wait for a real solution to invest on it not on  some Wallstreet scam but I have to recognize if I didn't have morals I would invest heavily in this scam.\n\nI don't blame anyone to invest in this cause I know is hard to make money but just have in mind u are increasing the public debt of every country whit this. ( cause u can't make a profit without big daddy government)", "score": 0, "replies": []}]}]}, {"body": "Carbon management is gonna be huge imo (of which carbon capture is an industry).\n\nCarbon management involves the capture, refinement, trading, etc. of carbon as a commodity which may potentially evolve into a basis for ecological engineering.\n\nEven without speculation, it's highly likely carbon capture projects and financing from governments, climate credits/taxes/caps/bonds will provide necessary incentives, intensive industries will use synthetic fuel like airlines and trucks (a product of captured carbon), chemical advancement, etc.", "score": 3, "replies": []}, {"body": "There's a big flaw in your thesis, but it only makes it stronger.\n\n> The world produces about 40 Gigatonnes of CO2 per year (that’s 1 billion tonnes). In order to reach the global warming goal of 1.5°C proposed by the Paris Climate Agreement, the world needs to be essentially carbon net zero or negative by 2050.\n\nThis is incorrect. [A recent study](https://www.severe-weather.eu/global-weather/climate-change-tipping-point-global-temperature-increase-mk/) found that Earth could already hit 1.5°C in the next 5 years. Getting to carbon neutrality by 2050 would not even ensure 2°C global warming and would be too slow to prevent catastrophic climate change around the world.\n\nCarbon capture will have to be ramped up extremely fast, and the longer we postpone reducing carbon emissions due to lobby of legacy automakers and energy (read: oil) companies, the more aggressively we will have to invest in it sooner or later.", "score": 3, "replies": []}, {"body": "Carbon capture is PR bullshit. It doesn't make much sense economically or environmentally.", "score": 9, "replies": [{"body": "Yet.", "score": 1, "replies": []}]}, {"body": "You have my interest. Let us (or just me) know if you find value in DELT and if the other two seem like good options.", "score": 3, "replies": []}, {"body": "I think all you have to do is add iron to the ocean surface.  A large amount of the resulting algae and plankton growth winds up on the ocean floor.", "score": 3, "replies": [{"body": "Correct, lack of minerals, especially iron, is the limiting factor of algae growth. This is one of the very few even remotely realistic approaches to carbon capture.\n\nNobody cares though, because it’s not high-tech. Like, you know, trees.", "score": 6, "replies": []}]}, {"body": "Only carbon negative country in the world is Bhutan where 70% of country surface are forests...", "score": 3, "replies": []}, {"body": "Sure it will.", "score": 3, "replies": []}, {"body": "The only stock I can find for DELT is actually DLTA is that the same one? It’s worth  a tenth of a cent", "score": 2, "replies": [{"body": "That's not it. DELT is on the Canadian stock exchange. Maybe your platform doesn't have access to that?", "score": 2, "replies": []}]}, {"body": "ORGN Origin Materials, Inc. operates as a carbon negative materials company. Its platform converts the carbon found in biomass into useful materials. ", "score": 2, "replies": []}, {"body": "You know what will bigger? inland (soon to be coastal) and northern/arctic circle real estate, and under water construction companies.  With the nearly unlimited methane deposits in the arctic getting melted rapidly now a runaway greenhouse earth and complete melting of polar ice caps is all but inevitable now.", "score": 2, "replies": []}, {"body": "LODE", "score": 2, "replies": []}, {"body": "GRN and KRBN all day baby", "score": 2, "replies": []}, {"body": "Where does OXY get revenue? Are they selling carbon credits based on policy?", "score": 2, "replies": []}, {"body": "with the way that governments and businesses  are behaving not gonna happen.", "score": 2, "replies": []}, {"body": "I will never invest in carbon capture because the \"market\" for it is entirely artificial. No company or customer really needs this service. If a company spends money it should really be considered part of their marketing budget, and in when cash gets tight it will be the first thing axed. Either that or it will be totally dependent on govt subsidy.", "score": 2, "replies": []}, {"body": "I think planting trees and sea crops of algae is more efficient than anything we’ve invented if I’m not mistaken. And with taking reasonable money into consideration. But I was thinking why don’t scientists look to GMO kelp and Red wood trees", "score": 2, "replies": []}, {"body": "the pick catalyst for this will be when the US finds a different standard than oil. Dollar was strongest because of gold, then we shifted to oil, so oil will be king until US falls from glory or until they find something else that the whole world NEEDS and attaches the dollar to it. Maybe that moon helium", "score": 2, "replies": []}, {"body": "Check Advantage Energy. They have a unit that's 90% owned called Entropy. It's modular carbon capture and they already have a project and a pipeline of prospects. They say they can do it profitably at $50 tonne. The company is a natural gas producer that's trading in line with peers so no value is assigned to Entropy for the $1b company. I'd argue Entropy alone could easily be worth that much, or wait for the spinoff.", "score": 2, "replies": []}, {"body": "There is also the option of destroying CO2 in situ where it is created via electrolysis...", "score": 3, "replies": [{"body": "Very cool, has this been done on a large scale yet?", "score": 3, "replies": [{"body": "Not to my knowledge. It's too energy intensive... for now", "score": 2, "replies": []}]}]}, {"body": "What happens when there is a carbon deficit in the atmosphere and crops do not grow?", "score": 2, "replies": []}, {"body": "except it's a giant scam and doesn't work.\n\n[https://www.youtube.com/watch?v=MSZgoFyuHC8](https://www.youtube.com/watch?v=MSZgoFyuHC8)", "score": 2, "replies": []}, {"body": "The Carbon Capture Industry is already Huge.. a huge joke for anyone who knows shit about jack.\n\nShout out to the educated peeps over at /r/collapse\n\nOP if you believe in 1.5C or that we are going to suddenly become serious about CO2 I have a couple of bridges in Lebanon or Madagaskar or somewhere in South America to sell you.", "score": 1, "replies": [{"body": "I believe companies and governments are going to attempt to curb climate change which will create opportunity. You're probably right that we will fail to reach these goals but that doesn't mean a shift to some degree won't happen.", "score": 1, "replies": [{"body": "Oh yeah, they will definitely attempt something, but not to curb climate change as that train has already left the station many years ago. And now they start discussing [in private behind closed doors](https://www.france24.com/en/live-news/20210915-world-leaders-will-hold-closed-door-climate-meet-at-un) how to deal with the mess.\n\nChina, India, Russia, Australia, the list goes on - these countries don't even pretend to care about the climate change. As some of their heads state themselves: \"[they have the right to develop, they want to build skyscrapers and have a higher standard of living, **you can't stop it**](https://www.bbc.co.uk/news/science-environment-56596200)\"\n\nAnd if these countries are not going to spend their resources for the greater good of greener Earth, why would countries like USA or UK bother? Hint: they won't.", "score": 1, "replies": [{"body": "> China, India, Russia, Australia, the list goes on - these countries don't even pretend to care about the climate change. As some of their heads state themselves: \"they have the right to develop, they want to build skyscrapers and have a higher standard of living, you can't stop it\"\n\nWell that's certainly not true. China and India are on a trajectory to reach carbon neutrality well before the US and even some European countries. The only difference is that they don't care about it out of the goodness of their heart, but because it's in their best economic interest.", "score": 0, "replies": []}, {"body": "That's the larger problem. To have any chance at all going forward, the world economy has to go carbon-zero; or preferably, carbon negative. That's not going to happen in time, if at all.\n\nSo I think the safer investment is in technologies that will enable us to thrive in Earth's new, more aggressive, more volatile climate.", "score": 1, "replies": [{"body": "What technology is it that saves the oceans from dying? I am curious.", "score": 2, "replies": []}]}]}]}]}, {"body": "The only viable carbon capture tech is trees. This is noise.", "score": 1, "replies": []}, {"body": "Lowercarbon Capital (https://lowercarboncapital.com) By Chris Sacca and his wife is really inspiring.", "score": 0, "replies": []}, {"body": "For sure. The human race is so far behind in the climate change fight we are going to have to get super aggressive in the near future.", "score": 0, "replies": []}, {"body": "Climate change isn’t real buddy\n\nEdit: scam", "score": -7, "replies": []}, {"body": "$AMTX", "score": 1, "replies": []}]}
