{"title": "Is this (scalping style) sustainable in the long-term? Very short holding period of trades for reduces risk/exposure to market.", "selftext": "&#x200B;\n\nhttps://preview.redd.it/8qqoel8kval71.png?width=1101&format=png&auto=webp&s=817db204af45631d2c0cdebd55f54b36b1cdd46b\n\nhttps://preview.redd.it/ywpyzkauval71.png?width=1116&format=png&auto=webp&s=68ff61a6b71b6ec5aca80801a1b5ca981bb77f51\n\nThis is a small account challenge to share with the public.\n\nThrew $495 into the account (8/24/21) to illustrate scalping style of options (pure CALLS and PUTS). After trading for 2 days, I decide to throw in another 2k to make this a little quicker.\n\nSo far I've taken 16 trades and had 1 small losing trade on AMZN.\n\nMoving forward, and as I grow the account, I'd like to see if any other successful scalpers have some helpful tips/pointers to aid in potentially grow this to say $15,350 or $18,250 by year's end.\n\nGeneral idea of scalping style: No preparation of any sort. Treat this way of trading as another part-time job. Wake up in the morning right before market open, let bell ring for market open, jump into 1-3 very short-term trades potentially to grab some profits from the market and trade same way the next day.\n\nhttps://preview.redd.it/tf0nkfdtval71.png?width=1102&format=png&auto=webp&s=a6d0561af1b09ea408f665ffa038bc1070bca392\n\nhttps://preview.redd.it/yypdmxpsval71.png?width=1101&format=png&auto=webp&s=a9a497e4edf6d8e946bd6e46571e025bbdd6ab63\n\nhttps://preview.redd.it/r24x29suval71.png?width=1114&format=png&auto=webp&s=11a40eef83204bc516dac090a015285f29496871", "id": "ph6gjf", "created_utc": 1630679966.0, "score": 51, "upvote_ratio": 0.84, "num_comments": 66, "comments": [{"body": "It’s really not possible to tell you if it’s sustainable or not without knowing your strategy.\n\nGenerally speaking, if you’re doing something sophisticated and exploiting a market inefficiency, then yes. If you’re just rolling the dice, then no. Without knowing how or why you’re making trades, it’s really difficult to know whether or not it’s sustainable. Of course, it’s reasonable (and smart) that you don’t put these strategies out there. So you’ll have to stick with just more general comments on it rather than your specific strategy unfortunately.\n\nThere are people are firms that make money by doing very short term scalps. It’s definitely somewhere money can be made if you know what you’re doing.", "score": 24, "replies": [{"body": "Thank you. I really appreciate the insight. I simply stick to a handful of tickers and trade them. Whether the market is up or down that morning does not concern me in the slightest. If a trade opportunity presents itself, I'll jump in with the risk/trade. My trading style aims for high win rate and (smaller) profits. Every so often I get a \"homerun\" if you will.", "score": 14, "replies": [{"body": "The real crux of your strategy is how you determine what trade opportunities there are. Definitely don’t share this, but the rest of what you said is fairly meaningless without knowing that.\n\nI will say that if you’re looking at picking up pennies by buying options, it sounds like you’re doing some mean reversion stuff. Just be careful with that, if market conditions begin changing and you don’t recognize it, you can get really burned.", "score": 15, "replies": [{"body": "Scalping in itself is picking up \"pennies\" for a short duration. The main idea is to understand direction of an underlying's move. I do play CALLS and PUTS fairly equal. Sometimes I follow the trend if the stock itself shows a continued trend is happening, sometimes I play the opposite for a rebound. Important thing is that each potential trade is a winning trade on which I capitalize on. The rest does not matter to me after the fact that I am out of the trade. Every strategy or style of trading has its PROS and CONS. The good thing about scalping is risk management is already a part of the strategy in itself, that the premium you \"PAY\" upfront is your total risk of the trade, unlike with marginal trades (such as defined or undefined trades i.e.: spreads).\n\nI prefer making $50 - $400 in 3 minutes over holding trades for 2-10 days utilizing the same kind of \"profit\" potential with potentially more risk at hand.", "score": 14, "replies": [{"body": "I've never heard someone actually say this but it's 100000% what I've always felt. I couldn't give a fuck if we drop 50% tomorrow. I care about what happens between now (my entry time) and a couple minutes/hours from now (sale). Do you use stops? I use stops at about 9% down. I only trade SPY, SPX, and AAPL if I'm super bored, which is incredibly rare.", "score": 8, "replies": [{"body": "I have my exit price in mind when I enter the trade. I actively watch the bid and the ask once I'm in the trade. I don't aim for home runs. I believe that most traders should focus only on a few stocks vs looking/scanning for plays/opportunities. My style of trading allows for me not to spend ANY EXTRA time outside of the actual scalp that very morning, and that's it. I know it can be fun to go over charts, discuss, plan a trade, etc, but boy it's really just like any other \"job\". I'm eyeing the horizon when I can scalp 1-2k every morning for like 3 - 20 minutes of work tops, and enjoy the rest of the day doing other things. Time's more valuable than money. Bills do exist though, so as long as \"trading\" can pay those bills and for some extra/additional luxuries every so often, it's worth learning the skill.", "score": 11, "replies": [{"body": "Precisely my mindset also except I don't really have a cap on the amount I earn (potentially). Wish you luck. You've made it through the hardest part which is the start.", "score": 3, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Actively monitoring the bid and ask with the finger ready to get out of the position quite frankly. I don't know how else to explain it. What most (inexperienced) traders tend to forget more than advanced traders is that their main job is to cut losing trades. They tend to focus on the wrong part of trading, the winning side instead.", "score": 8, "replies": [{"body": "I've scalped for 30 years. \n\nIt's the only strategy I use, futures and stocks.\n\nIf you have any questions, let me know.\n\nMy post history might have some useful information for you.", "score": 11, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Though I don't scalp options, I stick to high liquidity tickers.\n\nI assume, given my limited knowledge, it's similar if you stick to high OI contracts. Maybe a higher timeframe of trading will offset that, but with scalping you want two things: volatility, and liquidity.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Are you doing Buy to Open calls or Sell to open calls", "score": 1, "replies": []}]}]}, {"body": "What tickers do you focus on ?", "score": 1, "replies": []}]}, {"body": "Can you name one of those firms?", "score": 1, "replies": []}]}, {"body": "How do you do this with such a small account and avoid PDT rules?\n\nI'm a futures trader and thought that options trading was also subject to PDT rules.", "score": 5, "replies": [{"body": "Cash account. No margin, no PDT rule.", "score": 17, "replies": [{"body": "I thought you had to be approved for margin to trade options at TDA. I'm approved for the highest level of options trading at TDA.\nI guess I'm asking: *\"how do you set your TDA account to Cash Trade Options?\"*\n\nScalping Optiona has me very interested but I didn't want to start by pulling $25+K from my futures broker.", "score": 5, "replies": [{"body": "You do have to be approved for the different levels of margin in terms of options trading on TDA.\n\nHowever, when you sign up/set up an account, you also have the option to create a cash account along with level 1 options which is simply for buying premium (calls+puts) and there might be some cash covered call option too but you'd have to check yourself).\n\nUtilize that type of account to simply \"trade\"/scalp options very short-term. I love this type of trading style personally as it gives me everything I need to make consistent daily gains. Levered. Check. Settles overnight. Check. Don't need much capital. Check. Risk defined. Check. It's just you and the markets. You and BUY and SELL to enter/exit a trade. If you're \"good\", you can make money on the side trading this way.", "score": 7, "replies": [{"body": "Much appreciated. I'm going to dig deeper on my account setup with TDA. This approach is very intriguing.", "score": 5, "replies": [{"body": "You can do it with TDA. I have a cash account and scalp options. Like they said above it’s a great way to day trade with a small account and not be subject to PDT.  Also, like they said the cash settles overnight so your buying power is fresh in the morning.", "score": 3, "replies": [{"body": "I know many traders that keep a small cash account for scalping options specifically while having multiple margin accounts through other brokerage firms to play spreads (so they can do more than 3 day-trades in a 5 rolling period) and long-term portfolios. Best of all worlds.", "score": 2, "replies": []}]}, {"body": "Very simple. First apply for TDA account. Apply for options level one or two whichever is just buying puts and calls do not apply for margin. Use settled cash until out for the day. Options settle overnight so you can use it all tomorrow too.", "score": 1, "replies": [{"body": "I already have a TDA account. Approved for Advanced Options. I'll talk to them next week about being able to trade options using cash. In the system, margin approval is required for options. (Or at least Advanced options.)", "score": 1, "replies": [{"body": "Advanced options sure, you don’t need advanced options you just need to be able to buy puts and calls. No selling. It’s just called standard cash, you don’t want standard margin.", "score": 1, "replies": []}]}]}]}, {"body": "After reading up on this. It seems like you are limited to buying the amount of cash you have in the account until your sell trades have settled. The settled duration is key I think. \n\nExample is I have $500 in my account, I buy $400 option then sell it for small profit, until that $400 is settled(overnight). I only have $100 to open another trade with for the remaining day. Is this accurate?", "score": 1, "replies": [{"body": "My option trades are BUY TO OPEN, SELL TO CLOSE.\n\nTo explain with your example: If I have $500 in my account, I BUY TO OPEN $400 worth of options contracts, then SELL TO CLOSE them within a few minutes. Then I would in theory have another $100 to trade with, until the buying power is reset overnight back to $500 give or take depending if that previous trade was a profitable or losing one.\n\nHope this gives a better explanation to you.", "score": 2, "replies": [{"body": "Yes, it does. Thanks", "score": 1, "replies": []}]}]}]}]}]}, {"body": "What’s the downside to PDT designation?", "score": 2, "replies": [{"body": "None if you plan to keep at least $25K in the account. I don't want to to tie up $25-30K in an account just to test some strategies. I'd rather leave it in my futures account. \n\nIt may be a moot point shortly if I can ramp up to a workable ROI. At that point it isn't really \"tying up capital.\"", "score": 1, "replies": []}]}]}, {"body": "I’ve been trying this the past month successfully. As stated it depends on your strategies and reasons for entering and exiting. But I’ve found it to be much more reliable than shorter term calls hoping for a daily trend and getting killed by theta. What your suggesting purely relies on timing the mean reversals and trying to enter a trend before it’s 50% done. I find TSLA weeklies on Friday specifically are 1) affordable for my account (ATM) and 2) way more lucrative since the stock tends to fluctuate 3-5 points, allowing larger gains or losses if you mistime the trend. I may play with the idea of going margin and just trading thrice on Friday so I don’t “loose” funds from T+1. They say you cant time the market but the reversals today were spot on with the theories I follow. So long story short I like it but it takes having theories to follow. My advice for ToS: Use the analyze tab. Add stimulated trade. Lock in your strike. Track it. See what would have happened. Rinse and repeat until you find what works for you. You can easily get burned quickly in tsla so stop losses help in case too. But it’s best to trust the theories.", "score": 7, "replies": [{"body": "Yes, short expiration (weeklies) options aren't your friend if you're holding them for too long. I strategically utilize weeklies for the gamma and with my holding times on my trades, theta is barely a factor. I like trading TSLA too, when it is awake, it does great moves. Easy quick scalps on it to be quite frank. When it doesn't get much attention though, it's best to sell spreads on them for the theta.\n\nFunny you mention the analyze tab. I've never played with it. I have been using thinkorswim for years, and the only thing I utilize are the monitor, trade (options chain) and chart tab, that's pretty much it. I think the analyze tab is better for spread trades, longer-term positions, etc, not necessarily scalps because the scalp trade in itself might be over before you could even start to analyze.", "score": 4, "replies": [{"body": "We literally think exactly alike. I love it. Confirmation bias for sure but still nice to see someone utilizing the same theories. 👍🏻\n\nYou’re 100% correct about Tesla when it’s awake. Noticed NFLX to be a nice alternative but not as predictable though. What other tickers are your go-tos? I think you mentioned in another comment, I’m just on mobile. \n\nYeah analyze does waste a bit of time. I just use it to plan which strike and how many when I notice a trend forming hopefully with confluence around a pivot line. And sometimes send the order from there. But active trader is my favorite personally. However I specifically brought analyze up for any other reader interested in your tactic who uses ToS.", "score": 3, "replies": []}, {"body": "Nvm, just actually looked at your screenshots. I love the same tickers. Forgot about FB. You hold a lot shorter then me, I tend to trail a profit stop loss but then again your success rate is better than mine lol", "score": 2, "replies": [{"body": "Yeah, I never worked with trailing stops of any sort. I prefer to just simply exit the trade completely with all contracts than try messing with setting up those more complex orders on thinkorswim. By the time I'm setting it up, I might have already got out of the trade really. Nothing wrong with entering, exiting for profit moments later. Replenish thoughts, try to spot another trading opportunity, rinse and repeat. No need to get caught up on how much can or is being made, as long as the trading aspect in itself was acceptable with the fact that the trading plan was followed from entering to exiting.\n\nFB is great. I love the narrow bid/ask spread same as with AAPL. Always can enter and exit FB quickly. Never an issue with liquidity of course.\n\nLike I tell my friends that trade alongside me, it's not a matter of who walks or runs faster. The important thing is that we all reach that top of the mountain TOGETHER eventually.", "score": 3, "replies": []}]}]}]}, {"body": "I scalp SPY regularly and I would highly recommend using Fibonacci retracement in order to find good support and resistance levels. It gives you a great idea on where good buying and selling points are. \n\nI also use the SSI (Speculative Sentiment Index) to gain a better understanding of where the stock's current price is when compared to the all time average price. The other main indicator that I use is the Fast Stochastic Oscillator (%K). This indicator is useful when trying to time momentum swings on the stock, and it can help identify when the stock is overbought/oversold. Hopefully this info was helpful for you, and thank you for sharing your insight.", "score": 6, "replies": [{"body": "I use MACD, 2 simple moving averages (60,120), and volume. I draw out Fibonacci's but I don't depend on them as much. All on the 1 and 3-5 minute charts.\n\nSimple is really best.", "score": 6, "replies": [{"body": "Yes. 100% on keeping it simple. \n\nTrading in itself should be simple. One needs to focus on the most complex part about it  which is one's psychology, mindset and determination to stick to the plan that hopefully is already laid out for your own style of trading.", "score": 7, "replies": []}]}, {"body": "Wow, thanks for the tips! I'll work on reading up on Fibonacci retracement and the SSI sometime this weekend. \n\nMy mantra is that a trade either works or doesn't. The most important thing is to play the tickers when there is momentum (institutions and retail crowds also are piling in for whatever reason). I actually like to keep my charts clean and free from any clutter. I do use the 9EMA though and like to trade off both the 1-min and 5-min chart when I scalp.", "score": 3, "replies": []}]}, {"body": "If you don't mind sharing, What broker do you use?", "score": 3, "replies": [{"body": "TD Ameritrade. I trade on thinkorswim", "score": 6, "replies": []}]}, {"body": "I made the exact same mistake when I was a scalper. The idea that by spending less time in the market your reducing your risk is completely inaccurate. The fact is your actually increasing your risk because your getting into more positions more times which means theires more opportunities for the stock to go against you", "score": 3, "replies": [{"body": "That would make sense, but in a way, proper trading requires a lot of patience and being able to identify trade opportunities. If none are presented, no trade is entered. Probably why I strive for high win rate from my scalping style. Appreciate the warning though! It is always good to be \"grounded\" every so often.", "score": 5, "replies": []}]}, {"body": "OP, I’m curious what tickers you’re tracking if you don’t mind sharing.", "score": 3, "replies": [{"body": "The usual suspects. AAPL, AMZN, FB, NFLX, NVDA, TSLA, BABA, SPY, QQQ. Occasionally I like to play some others too.", "score": 5, "replies": []}]}, {"body": "That’s helpful. I obviously saw the list you posted but wasn’t sure if there were others. I’ve been scalping only SPY and QQQ so could be interesting if I can find better setups with a bigger range of tickers. Thanks!", "score": 3, "replies": []}, {"body": "You seem to be pretty amazing at picking out low prices. Keep it up and take it to the fuckin moon!", "score": 3, "replies": [{"body": "Let's hope so! I hope I make it there before Bezos!\n\n/s", "score": 5, "replies": []}]}, {"body": "What DTE are you buying?", "score": 2, "replies": [{"body": "Weeklies. It's not everyone's cup of tea mind you. You've got to understand options (their greeks for instance), what created them in the first place (as insurance). Trading weeklies has CONS and PROs. I like the PROs for my short duration scalp trades, so I utilize them exclusively.", "score": 4, "replies": [{"body": "Noted, thanks for the response. I like the strategy, but like you said it takes your full attention. I am not able to give the proper attention due to my job. My job is task heavy and keeps me away from the market.", "score": 2, "replies": []}]}]}, {"body": "https://imgur.com/a/0VkZ0sE\nI trade on a small timeframe and exit quickly as well but I use stocks and not options. I think it is sustainable. Keep it up, you got this. The only issue I've come across for myself is adding to my losers. I've some what found a way to manage that problem so far this year. But it looks like you put on your trade and let it do its thing so that shouldn't be an issue for you. So as long as you have your confidence, I don't see why it wouldn't work out in the long term.", "score": 2, "replies": []}, {"body": "Did you use RSI, EMA, MACD or something like that? What strategy did you use?", "score": 1, "replies": []}, {"body": "Lucky fa@@ot", "score": 0, "replies": []}, {"body": "What is your profit target and stop loss on each trade?", "score": 1, "replies": [{"body": "I don't have a profit target. I watch the stock / trade very actively once I enter one. I only have 1 position on at any given time as I'd like to give it my full attention.\n\nI focus on exiting the trade when I'm losing though so I can immediately cut it when I have to. Profits really happen on their own imho. Of course one should not let an already winning trade turn into a losing trade either. \n\nYou need to keep everything in perspective. Making $20, $40, $80, 135 or $200 in 1-3 minutes is a nice \"paycheck\" if you ask me.", "score": 6, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Yes. It's the experience in trading a small group of tickers/stocks that give you an extra edge over trading tickers you've never heard of let alone entered/exited a trade with. I know how much AMZN can move in 3, 10, 15 minutes depending on price action presented right in front of my eyes. I know how quickly NVDA can drop at open only to squeeze the shorts out in the previous candle. All that is part of having an edge.", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "A lot of screen time. Learn price action. Stick to same tickers every day. Start small.", "score": 3, "replies": []}]}]}]}]}]}, {"body": "Do you use level 2 market data(deep book) to monitor ask bid trades? It is not cheap for some of the data, though definitely worthy for your trading performance.", "score": 1, "replies": [{"body": "No market data, let alone L2. I think too much distraction while in trade personally. Focus on outcome of trade once you enter. You should already know the risk when you entered and how much you entered with.", "score": 3, "replies": []}]}, {"body": "It’s inspiring to see you do well. What broker are you using?", "score": 1, "replies": [{"body": "TD Ameritrade. I trade on thinkorswim platform.", "score": 1, "replies": [{"body": "I do as well. Do you track these metrics from tos or another site? I’d be interested in doing this for my trades.", "score": 1, "replies": [{"body": "You export data from tos and import into another journaling site such as tradersync or tradervue. Take a look at those. Both are good imho.", "score": 2, "replies": [{"body": "Great ty!", "score": 1, "replies": []}]}]}]}]}]}
{"title": "Elon Musk: 'this is craziest month of deliveries Tesla (TSLA) will ever have'", "selftext": "", "id": "ph07wf", "created_utc": 1630653392.0, "score": 221, "upvote_ratio": 0.98, "num_comments": 64, "comments": [{"body": "[deleted]", "score": 28, "replies": [{"body": "Yeaaaaah !", "score": 6, "replies": []}]}, {"body": "**Record quarter incoming** - and by 'craziest' I'd assume it will be a substantial record in every major market: the US, Europe and China.", "score": 60, "replies": [{"body": "*This comment has been edited in protest to reddit's API policy changes, their treatment of developers of 3rd party apps, and their response to community backlash.*  \n  \n&nbsp;  \n[Details of the end of the Apollo app](https://old.reddit.com/r/apolloapp/comments/144f6xm/apollo_will_close_down_on_june_30th_reddits/)  \n\n---\n[Why this is important](https://i.imgur.com/E7jSWf1.jpg)  \n\n---\n[An open response to spez's AMA](https://old.reddit.com/r/ModCoord/comments/145l7wp/todays_ama_with_spez_did_nothing_to_alleviate/)  \n\n---\n[spez AMA and notable replies](https://old.reddit.com/r/SubredditDrama/comments/145beas/spez_ama_discussion_thread/)\n\n&nbsp;  \nFuck spez. I edited this comment before he could.  \nComment ID=hbffznl Ciphertext:  \n>!VXTE3f79KMaHxM4UJ2xPQ9hXaNoCBi2JgPxGS83azc7za/yPSOrRbaXGqkBVJi1EUXPsGnDg14uh+BgzNLVPDPuNnj5ObLpJ4dvspCzsQ0Amn12rGqpiS+oSwFPHV65B1sZfbRx0nVVlx6r7brG2+tEzPfF1NxC704dGLH4i5BVQSruXzBDQ94gEtO+LergyugqBg/RR7Dq4vBgWg4dCn61A/OH3+jSCd+f5OjayHqDD/3pdYBGQEg==!<", "score": 47, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "There’s a large number of inventory Model 3 available in Europe.", "score": -5, "replies": [{"body": "~1,400 3s is not a large number and it’s pretty well distributed.  It’s likely made up of mostly showroom cars, which may have been recently released for purchase.", "score": 7, "replies": []}]}]}, {"body": "Once they open Berlin, (production starting in October supposedly) they shouldn’t have to manage the movement of near as many ships, which means significantly shortened transit times and more producing for the local region. This means deliveries will take place within days or weeks of manufacture, instead of months, and there will be a steadier supply of cars rather than a large end of quarter push.\n\nThis quarter may have also had part shortages that left cars on lots in different places while they got supply chain caught up, so there’s a chance things do improve here and this is the craziest.\n\nHowever, Elon also talked about getting rid of the delivery wave back in like 2015 so maybe he’s just optimistic", "score": 4, "replies": []}, {"body": "I agree that it's strange wording... But to play devil's advocate... If someone were to make a world breaking long jump of 28 feet and say \"I just made the longest jump of my life\" They are excited because they just beat their own and everyone else that has ever existed'd jump record and would be more accurate if stated that way. But literally speaking they don't know what more will happen in their life and if they jump further 2 years from now they will make the current statement false... And while that's true... I don't think many people would take them stating \"I just made the longest jump of my life\" as litterally \"I will never jump further than this in my life\" In that instance, even though the initial statement talent literally means that... they are just using hyperbole to exclaim they are doing the best they ever have.", "score": 7, "replies": [{"body": "But he didn’t say “this is the craziest month of Tesla’s life” he said “this is the craziest month tesla will ever have” which is explicitly a forward looking statement.", "score": 7, "replies": []}, {"body": "It could also just be the highest percent increase that they will likely have", "score": 0, "replies": []}, {"body": "I once worked for a certain large software company and in fact their legal department nixed phrasing like \"our fastest (product) ever\" in marketing and documentation because it precludes coming out with a faster version in the future. the fear was that customers would make business decisions based on this promise (that there would be no future faster version) and the company might be forced to provide free upgrades to the inevitable future faster version. \"fastest (product) yet\" was the approved phrasing.\n\nnot much of a risk in this case (\"craziest\" is vague and subjective and anyone making investment decisions based on that is being stupid), but that doesn't mean someone couldn't file suit. you can file suit for anything. \n\nElon does often say things that I bet his lawyers wish they could rein in afterward", "score": 0, "replies": []}]}, {"body": "Agree", "score": 0, "replies": []}, {"body": "I miss his cryptic tweets", "score": 0, "replies": []}]}, {"body": "I am assuming that Elon is expressing good news….but, we will have to wait unless a more precise transcript is made available…", "score": 2, "replies": [{"body": "Cathy Woods has a target of $3,000 by 2025…I think may be off by a factor of x10…", "score": 1, "replies": []}]}, {"body": "I don’t think that’s what he meant by craziest.  And yes, record numbers are expected and priced in.", "score": 8, "replies": [{"body": ">  record numbers are expected and priced in.\n\nActually, only a small increase is expected and priced in: Wall Street (and Troy Teslike) is expecting ~223,000 deliveries in Q3, vs. 202,000 in Q2 - a meager ~10% increase over Q2.\n\n> I don’t think that’s what he meant by craziest.\n\nSo what does he mean by 'crazy' in your opinion? In the past when he characterized the end of quarter push in such terms, it always meant a substantial increase.", "score": 19, "replies": [{"body": "This, and when i looked at Troy's numbers previously, that 20K increase is completely or mostly attributed to Model S sales with little growth in Y and 3 deliveries. If the rumors are true about production increases and rates in Shanghai we should easily beat his and Wall Street's estimates.\n\nBy \"craziest\" maybe he means this is going to be the worst/most hectic quarter with regards to logistics and planning.", "score": 3, "replies": []}, {"body": "Supply chain issues delayed deliveries so there's extra backlog of work to do. Prepare to work long hours.\n\nHow much do you think Tesla will beat on deliveries versus expectations?", "score": 12, "replies": [{"body": ">Supply chain issues delayed deliveries so there's extra backlog of work to do.\n\nIs there any evidence for this?\n\nDelivery hickups are readily visible in Troy Teslike's data, and the last deliveries backlog he reported was resolved early June (in Q2), and I'm not aware of any new ones.", "score": 7, "replies": []}]}, {"body": "10% increase isn’t very meager. Especially if it has to be done with the same locations.", "score": 2, "replies": []}, {"body": "I think it comes from shipping MIC vehicles all over the world. And with the model Y SR coming from GS next Q, the demand in China will pick back up and they won't have to bend over backwards to distribute.", "score": 2, "replies": []}]}]}]}, {"body": "Once Texas and Berlin is up and running, focus on reduce the variability and focus on stable supply instead. These quarterly pushes are just about making the current quarter look better at the cost of the next quarter, the employees and quality. Its illogical. \nLogistics and workarounds for component shortages must indeed have been crazy though! \n\nWith the Y in Europe and price increases across the board we are looking at an increase not just in volume but improportionately in earnings as well.", "score": 22, "replies": [{"body": "You think they're not focusing on stable supply?", "score": 3, "replies": [{"body": "If the end of every quarter is working at an increased pace to reach some goal, then no, that is not aiming for a stable pace.\n\nThe variability in deliveries to Europe etc. makes sense due to retooling taking time, but arbitrary “end of quarter” deadlines are only to push the limits ahead of time to protect the stock short term. I don’t think that’s necessary soon.", "score": 5, "replies": [{"body": "This is the reality of a publicly traded company.  And the pandemic has screwed their supply chain.  I'm sure Tesla would LOVE to heads down focus on max delivery at all times.  But times are strange.", "score": 2, "replies": [{"body": "Why do they care though? They aren't trying to raise capital.", "score": 1, "replies": [{"body": "Because they feel an obligation to their investors?", "score": 1, "replies": [{"body": "Why would investors care is they sell 2 cars on Monday and 0 on Tuesday, or 1 car on Monday and 1 car on Tuesday?", "score": 1, "replies": [{"body": "Long term investors don't.  Short term investors and the media does.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Texas won’t really change end of quarter in the US though.", "score": 2, "replies": [{"body": "Yeah. Just the article talks about “The CEO believes that Tesla should get a better handle on its logistics, and he aims for the automaker to put a stop to those delivery waves by Q4 2021 or Q1 2022.”", "score": 3, "replies": []}, {"body": "Texas can deliver vehicles continuously across NA, there is nowhere in the US or Canada more than a 2 day drive from Austin. \n\nThis means 2 things: Delivery centers can deliver vehicles at a continuous, sustainable pace throughout the quarter, improving customer experience, and on the last day of the quarter there will be only the normal daily truckloads of vehicles to deliver, leaving only 2-3 thousand Austin produced vehicles in transit at the end of the quarter. \n\nAt the same time, Berlin can operate in a similar manner within Europe. The whole continent is within 2 days drive from Brandenburg. There will still be the model 3 production from Fremont to account for, but with fewer Fremont vehicles being shipped overseas, NA deliveries from Fremont will also have the ability to stabilize. \n\nMore vehicles will be delivered per day around the world, but the localization of factories means that delivery centers can grow / staff up to make this level \"normal\" instead of having to surge each quarter.", "score": 2, "replies": []}, {"body": "It would be less wave-ey East vs. West coast, at least.", "score": 1, "replies": []}]}]}, {"body": "👌🏻", "score": 5, "replies": []}, {"body": "[deleted]", "score": 5, "replies": [{"body": "“This town needs an enema!”", "score": 1, "replies": []}]}, {"body": "Probably referring to logistics owing to the fact that Berlin and Austin aren't ramped.", "score": 4, "replies": []}, {"body": "Competition is coming", "score": 5, "replies": [{"body": "Whoever is downvoting me, idk why but im being sarcastic lol", "score": 1, "replies": []}]}, {"body": "Bullish", "score": 4, "replies": [{"body": "Exactly.  What I am hearing is that one or more sources of additional supply are coming online to smooth out the delivery waves.  For someone who can think things through, this in incredibly bullish news.", "score": 2, "replies": []}, {"body": "What’s bullish in this article?\n\n> Production issues due to the chip shortage and logistical issues due to bottleneck at ports as well as more recently natural disasters in the US have delayed deliveries for Tesla.\n\n> Those issues will add to the usual strain of the end-of-quarter delivery wave and it will make the next few weeks extremely important and challenging in terms of deliveries for the quarter.\n\nI’m tired of the cheerleader attitude around here.", "score": -4, "replies": [{"body": "> Production issues due to the chip shortage\n\nTrue - but that's a **production** issue - not deliveries issue.\n\n> and logistical issues due to bottleneck at ports\n\nI'm not aware of ***any*** Tesla ship traffic bottlenecks in Q3 - all ships have either already arrived, or are chugging along nicely.\n\nCan you cite any? 🤔\n\n> as well as more recently natural disasters in the US\n\nHurricane Ida disrupted states that represent only a tiny fraction of the US Tesla market.\n\n> have delayed deliveries for Tesla.\n\n... as well as increasing demand, while legacy auto is shrinking.\n\n> I’m tired of the cheerleader attitude around here.\n\nIMO, while obviously Tesla is still constantly plagued by production & logistics bottlenecks for the ~10th year in a row, and that sentiment on an investment sub is obviously bullish-biased, conversely you should also be more skeptical towards Fred's frequent unsubstantiated negativism, lack of balance in reporting, and his general tendency to sensationalize for clicks.", "score": 28, "replies": []}, {"body": ">Elon Musk told Tesla (TSLA) employees that “this is the craziest month of deliveries Tesla will ever have”.\n\nCheer up bud!", "score": 7, "replies": []}, {"body": "Go buy a bolt then 🤷🏼‍♂️", "score": 3, "replies": []}, {"body": "Bullish¡", "score": 0, "replies": []}, {"body": "Bullish", "score": 0, "replies": []}, {"body": "[deleted]", "score": -2, "replies": [{"body": "In their defense, this is an investors sub, and if there is something that might negatively impact the company and stock we should post and discuss. I'm not agreeing that this specific news is negative but it is important that we understand the negatives as well.", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "No, none of these are investment advice. They are meant to discuss Tesla news as an investor. I don't give a shit what the other subs are but this sub should not become an echo chamber. That would be a disservice to all of us.", "score": 3, "replies": [{"body": "Exactly - I know a lot of the upside to Tesla. I also want analysis of the risks.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "Sure, but you can't stop that. Doesn't mean the entire sub is financial/investment advice. By presenting the good the bad and the ugly people will have the information they need to make the decision. But if we down vote every single comment that questions Tesla approach we can't explore the negative side of Tesla and won't be able to track of they are improving in those areas. Having said that you would be hard pressed to find someone that is more realistically bullish than i am.", "score": 5, "replies": []}]}]}]}]}]}]}]}, {"body": "SEC fuming", "score": 3, "replies": []}, {"body": "Lol, ok", "score": 0, "replies": []}, {"body": "It’s deja vu", "score": -2, "replies": []}, {"body": "I wonder if it's the \"craziest month of deliveries Tesla will ever have\" could be alluding to the idea that Tesla freight trucks might start being used by them next quarter...!", "score": 0, "replies": []}, {"body": "I wonder if it's the \"craziest month of deliveries Tesla will ever have\" could be alluding to the idea that Tesla Semi trucks might start being used by them next quarter...!!!", "score": 0, "replies": []}, {"body": "Then deliver my moms car smh", "score": -3, "replies": []}, {"body": "\"...will ever have\" lol wtf is that supposed to mean? 20m cars per year bros, I don't feel so good...", "score": -3, "replies": []}, {"body": "Wondering if this is because expanding production is helping them move towards a more continuous and consistent delivery process (i.e. logistical improvements) or the bottom line numbers are improving so fast that once past this quarter they can afford a ding  from having more cars in transit and not need to worry about the FUD about it.", "score": 0, "replies": []}, {"body": "What happened to the $40k Tesla Model Y? It's getting really pricy now and hovering over the premium price of suv's 🤦🏾‍♂️🤦🏾‍♂️🤦🏾‍♂️", "score": 0, "replies": [{"body": "Demand constrained would not make sense to sell at 40k if they sell out at 50k already", "score": 1, "replies": []}]}, {"body": "They are unloading/transporting lots of cars in Zeebrugge (Belgium) port.", "score": 0, "replies": []}, {"body": "They need to push all out this time around due to the chip shortage to make the numbers, if it's resolved for next month onwards then not so much pushing will be needed.", "score": 0, "replies": []}, {"body": "I thought he meant crazy in terms of bad, was worried for a second. \n\nRead about the Ida ruining a ton of cars in NY/NJ", "score": 0, "replies": []}]}
