{"title": "Tesla Q3 Production and Delivery Numbers and Growth Over Q2.", "selftext": "[deleted]", "id": "dch5hy", "created_utc": 1570052862.0, "score": 111, "upvote_ratio": 0.97, "num_comments": 60, "comments": [{"body": "[deleted]", "score": 33, "replies": [{"body": "I was hoping they’d get to 7000/week production which would have allowed unwinding a wave and smoother q4.", "score": 4, "replies": [{"body": "Omg we are still not at 7k per week for the 3?  Thanks for putting things into perspective.  Werent we originally supposed to be at 7k per week for the 3 and 3k per week for the S and X two years ago?", "score": 4, "replies": [{"body": "In Q3 they did 6653 /week", "score": 7, "replies": []}]}]}]}, {"body": "Do the delivery numbers include leases?", "score": 7, "replies": [{"body": "Yes.", "score": 3, "replies": [{"body": "Ouch.", "score": 2, "replies": [{"body": "Right?  Dont expect 3Q to be a profit...", "score": 3, "replies": [{"body": "It's going to be in the ballpark of Q2 in terms of net loss and a much worse FCF.", "score": 11, "replies": [{"body": "Non-GAAP profit.  FCF = $300M according to the wizards on the Tesla motors club investors forum.", "score": 1, "replies": []}]}]}]}]}, {"body": "Leasing started in Q2 tough", "score": 1, "replies": []}]}, {"body": "That’s 2 quarters where sales have been higher than production. Q1 really set them back.", "score": 7, "replies": [{"body": "And I think they still have room, though I doubt they will do it again. Wasn't the production surplus in Q1 roughly 14k, and the cumulative deficit of Q2 and Q3 only like 8k?", "score": 2, "replies": [{"body": "Visual \n\nhttps://twitter.com/Teslacharts/status/1179503281644679169?s=21", "score": 3, "replies": [{"body": "Ok so yea they could do it again, assuming most of that built up production is able to be sold", "score": 2, "replies": [{"body": "Sorry I messed up that link by putting a space in it. Fixed now", "score": 2, "replies": []}]}]}]}, {"body": "Well, set them back a quarter or two in cash flow. The just had to wait longer to get paid for the cars they made in 1Q.", "score": 1, "replies": []}]}, {"body": "Does anyone think it’s possible the rate of deliveries will be 125k per year quarter for the model 3 before the end of the year\n\nThat would confirm musk’s forecasted delivery rate for the model 3 (he projected 500k per year rate at the end of the year)", "score": 3, "replies": [{"body": "Difficult, but possible.", "score": 2, "replies": []}]}, {"body": "Anyone have a reason for why the delivery increase wasn't as substantial as the production? More production capacity without more delivery infrastructure?", "score": 4, "replies": [{"body": "Why would they continue to deliver more cars than they produce? At some point there are no more cars to deliver because they have delivered every car they have produced. I'd guess they don't have parking lots full of spare cars to deliver whenever they feel so. But that's just a guess.\n\nCould also be the logistics. The cargo ships take up to 5k cars and take multiple weeks to reach europe and asia. It's not very fast and flexible, unlike teleportation.", "score": 19, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": -5, "replies": [{"body": "Don't worry. We're been hearing Tesla is going bankrupt \"next year\" for a decade now. The snowball can't really be stopped anymore, they'll all have to cover eventually. That company can't be killed no matter how much shorts try, it's becoming comical.", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "There's a tsunami of TSLA short-sellers out there, either actively or indirectly with vested interests in competing industries. Don't worry, that's quite common. But the company keeps growing in every way.", "score": 2, "replies": []}]}]}]}]}, {"body": "Got it, I wasn't really considering the numbers themselves. So last quarter they had 8k+ deliveries that came from inventory from previous quarters production, and now they don't have as large of of an undelivered fleet anymore?", "score": 1, "replies": [{"body": "Correct. Deliveries were low in 1Q. They sold 1Q produced cars in 2Q. They made more in 3Q and sold them all plus a few that were still around in inventory. (Sort of...there are issues of cars still in transit etc., but that is a way to look at it.)\n\nThe shortest story is:\n\nS/X are made to order and they declined once the 3 was available.\n\nFor the 3, they are selling every one they make this year.", "score": 2, "replies": []}]}]}, {"body": "How do you deliver more than you can produce?", "score": 2, "replies": [{"body": "Inventory from previous quarters of production.", "score": 3, "replies": []}]}]}, {"body": "Anyone daring to prognosticate on q3 revenues? \n\nWhat do you guys make of the higher prices of exported cars and Tesla insurance impact?\n\nIn the UK, the same Standard Range Model 3 (priced $38,990 in the US) costs $48,621 after currency conversion. That's almost $10k difference in price. I don't believe that transporting cars overseas will cost that much, especially when it's done in bulk. Shouldn't there be any added revenue here? \n\nThe same $38,990 model 3 costs $54,847 in Denmark.  \n\nThe EU imposes 10% tax on the US imports, which would amount to $42,889 price on a $38,990 US produced model 3. This leaves us with about $5,800 mark-up on the UK price and $15,857 mark-up on the Danish price. Is there anything I miss here? \n\nEven a modest average price difference of $3k on a car (after all costs) would amount to $120mln in extra revenue assuming 40k cars exported... Please, comment and correct me if I am doing something wrong here. According to this website: [https://www.cfrrinkens.com/international-car-shipping/car-shipping-from-usa-to-uk/](https://www.youtube.com/redirect?q=https%3A%2F%2Fwww.cfrrinkens.com%2Finternational-car-shipping%2Fcar-shipping-from-usa-to-uk%2F&redir_token=pamBeeXK_c7qM2AUWvSwBNVhvJ58MTU3MDE5Mjk1M0AxNTcwMTA2NTUz&event=comments&stzid=UgxQhDETbPViS2nSAD14AaABAg.9-cRK8w7z2L9-cSvxw3_Qw) car shipping from the US to the UK starts at $650 and this looks like a quote for a single car, not for bulk delivery.", "score": 2, "replies": [{"body": "$6.3-6.6B revenue for Q3.", "score": 1, "replies": []}]}, {"body": "The difference between production and deliveries was smaller this quarter, this could hurt cash flow", "score": 2, "replies": [{"body": "You can’t have production be lower than deliveries on a sustained basis. Once the initial set of transit cars have been filled, from that point onwards production should largely equal delivery. Therefore, this quarter should be a pretty good indication of Tesla’s true FCF generation ability.", "score": 4, "replies": [{"body": "Well that's assuming they don't have some kind of gigafactory 3 going online changing their production levels soon.", "score": 9, "replies": [{"body": "Kind of. Realistically it probably won’t change numbers that much as China will change from boat delivery to “local” delivery reducing transit time for that region by several weeks.", "score": 1, "replies": [{"body": "Realistically actually it increases total market share, as lower-priced cars will be available in China.", "score": 2, "replies": []}]}, {"body": "And increasing their operating cost.  GF china likely wont be profitable below 5k per week production, assuming its targeted to be like GF NV.", "score": 1, "replies": [{"body": "Watch Sandy Munro‘s episode on auto line network. China giga factory will be far cheaper than Fremont +GF1.", "score": 1, "replies": [{"body": "Well that good because all the highest margin, 3 year backlog driven first quarter deliveries to a new region will be over.  Sales will normalize and you can expect ASP to drop as high margin vehicle volume is reduced in accordance with filling back orders.  \n\nLets not forget Tesla is still not profitable and ASP are at the highest they will be for the model 3.  In absence of much lower cost to build and new S and X tesla could stay unprofitable for a while.  I dont buy into the hype. Numbers exist for a reason.", "score": 1, "replies": [{"body": "You mean the order increase will normalize. The order increase is proceeding nicely.  All of the smart investors, realize profit/loss has a terrible metric to use for high growth companies. In Tesla. is an ultra high growth company. Operating cash flow is king.", "score": 1, "replies": [{"body": "Profit loss is not a good metric.  However, growth is a irrelevant metric for smart investors if the stock price continues to diverge from market cap growth.  A growth company is worthless if investors dont see any return due to continued dilution as a result of lack of profitability and lack of self sufficiency.  \n\nA company cant survive producing 2M cars a year without turning profits.  And Tesla could very well have the same share price as it currently does at 2M car a year.", "score": 1, "replies": [{"body": "Stock price for high growth companies often diverges, but it always ultimately reflects.  Tesla is on the way to 100’s of billions of revenue.  The stock price will reflect that, it’s just a question of when.", "score": 1, "replies": [{"body": "Well its worth less than it was 5 years ago before the model 3 so yeah.  Its already priced at 2M vehicles a year too.  Look at BMW valuation.  It absence of fsd robo taxis the stock is likely going no where.", "score": 1, "replies": [{"body": "Tesla is disrupting the entire auto industry, it is nowhere comparable to BMW. In addition, they are in trillion dollar energy generation markets, and a $1 trillion autonomous market.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "That’s fair, higher deliveries should be good for profitability though. Higher revenue and also better fixed cost leveraging. Plus Tesla should recognize more emission credits this quarter and recognize a higher percentage of self driving revenue because of smart summon.", "score": 1, "replies": [{"body": "FTI, they've currently recognized 0% of FSD revenue", "score": 1, "replies": [{"body": "Really? I thought I read somewhere that they were recognizing 50%", "score": 1, "replies": [{"body": "Pretty sure it's 0%. According to accounting principles/laws, you're not supposed to recognize any revenue until the service/product has been performed/delivered. Smart Summon is the only exclusively FSD (and EAP) feature that has been released so far, and they've amassed over a $billion in deferred revenue, so I am 95% certain 0% has been recognized. I think they've even said as much on earnings calls", "score": 2, "replies": [{"body": "I know they are offering navigate on autopilot and self parking and now smart summon only with the FSD package so I think there is justification to recognize some revenue, because you are getting features you wouldn’t otherwise get.", "score": 2, "replies": [{"body": "Yea, I think they probably will recognize some this quarter, I'm just saying there is a lot of pending revenue", "score": 1, "replies": []}]}]}]}]}]}, {"body": ">\tTherefore, this quarter should be a pretty good indication of Tesla’s true FCF generation ability.\n\nGood point, it’ll be very interesting for sure", "score": 0, "replies": []}]}]}, {"body": "This looks great IMO, esp considering what analysts estimated only last week. Guess there will be FUD relating to it somehow regardless of that.", "score": 1, "replies": []}, {"body": "[removed]", "score": -2, "replies": [{"body": "[removed]", "score": 0, "replies": [{"body": "Please find ways to share your disagreements politely and in a less personal manner. This goes for both of you. This forum is about the discussion of the stock and the company, not about demeaning people who you disagree with.\n\nI don't know if you've been warned before, so take this as your warning. Next time it'll be a significant timeout. I'd have given you 1 week for this one but if no one has pointed this out to you before then a warning will have to do.", "score": 1, "replies": []}, {"body": "[deleted]", "score": 0, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "[removed]", "score": -1, "replies": [{"body": "[deleted]", "score": 0, "replies": []}]}]}]}, {"body": "Lol 1-2m???? Let's talk about their cash on hand and repayments", "score": 1, "replies": []}]}]}]}, {"body": "10% deliveries growth is not bad.  Lower inventories going into GF china-Q ramp should improve operating efficiencies.  Especially as GF china should increase sales further without a proportional inventory increase.  S and X sales are still abysmal...  \n\nhopefully china GF will provide 10% QoQ growth going forward until S and X refresh and next GF goes into construction.  That gives us near 50% QoY growth.", "score": 0, "replies": [{"body": ">10% deliveries growth is not bad.\n\nProduction, not deliveries. Deliveries were less than 2% up.", "score": 7, "replies": [{"body": "Deliveries are actually basically flat if you take into account Q3 having 1% more days than Q2", "score": 3, "replies": [{"body": "Lol, didn't think of that one. So not even 2% growth when taking into account the longer quarter.", "score": 1, "replies": []}]}]}]}]}
