{"title": "NYU Professor admits he was wrong about Tesla", "selftext": "", "id": "dobewz", "created_utc": 1572281003.0, "score": 91, "upvote_ratio": 0.94, "num_comments": 61, "comments": [{"body": "I have very little interest in this guys opinions after this:\n\nhttps://twitter.com/cnbc/status/1168372979115409410?s=21\n\nIf he thinks he was wrong,  good for him. But I don’t see how he deserves even the slightest attention.", "score": 38, "replies": [{"body": "[deleted]", "score": 21, "replies": [{"body": "Advice he should heed:\n\nDon’t make yourself a caricature of the adage “Those who can’t, teach.”", "score": 8, "replies": []}]}, {"body": "I think he probably accurately represents how NY finance thinks.  So he is worth listening to not because he is correct, but because he represents the point of view of a lot of money.\n\nIf you hang around engineers all day you will forget people are like that.", "score": 11, "replies": [{"body": "When all you can understand is a mature company/industry balance sheet innovation looks like a death spiral?", "score": 3, "replies": [{"body": "Nah, he is looking at the broader VC industry where Uber/Lyft are dropping, the we company is cratering ,etc.\n\nHe basically just repeated the auto industry argument which is all you can really expect from a marketing professor at NYU.", "score": 2, "replies": []}]}]}, {"body": "wow... As a professor, he takes himself overly serious. I mean how is he qualified to make such grand judgements on these great entrepreneurs!?", "score": 6, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Its literal.  He is saying dress like a New Yorker rather than someone from Silicon Valley.", "score": 2, "replies": []}]}]}]}, {"body": "At least the comments below that tweet are entertaining. I like how a NYU professor is telling others to wear a tie, in a video, while not wearing a tie.", "score": 2, "replies": []}, {"body": "I'll listen to someone talk about what it takes to build a billion dollar company once they've built a billion dollar company. Before that, stfu", "score": 1, "replies": []}]}, {"body": "Good for him... I’m guessing quite a few of the more vocal shorts are, at this point, to stubborn to say they were wrong.  I wonder how many of them have silently covered while keeping up appearances.", "score": 17, "replies": [{"body": "To play devil's advocate. If a single profitable quarter is the definitive proof that bears are wrong, why isn't a single non-profitable quarter the definitive proof that bulls are wrong?", "score": 15, "replies": [{"body": "This Q has structural margin improvements. The previous Q did not have those, plus it had a few one-time restructuring costs. Feel free to question the margin improvements, but as more FSD revenue gets recognised in the future, those margins will only improve.  And you’d probably question them again in the next quarter. And then, the one after that. Until they become undoubtable.", "score": 12, "replies": [{"body": "> Feel free to question the margin improvements\n\nTheir automotive margin with down YoY, according to their quarterly report. Or did you mean something else?", "score": 1, "replies": [{"body": "YoY is irrelevant, gross automotive margins went from 18.9 to 22.8 percent QoQ.  Q318 had a time-limited unrealistic sales mix (US only, and about to face a huge tax credit drop off).  The only comparison that is actually relevant is Q219. \n\nI’d be happy to read your reasoning why Q318 is more important with regards to Q319 numbers than Q219.", "score": 9, "replies": [{"body": "> I’d be happy to read your reasoning why Q318 is more important with regards to Q319 numbers than Q219.\n\nAlso, Tesla disclosed robustly increasing Q4 orders, higher than at the same time in Q3, and higher order rates both for the Model 3 and the Model S/X.\n\nI.e. they are production limited, which also resulted in a recent price increase.\n\nRising deliveries and rising prices virtually guarantee even better margins in Q4.", "score": 4, "replies": [{"body": ">Rising deliveries and rising prices virtually guarantee even better margins in Q4.\n\nQ4 always have better margin, revenue and profit than Q3. Do you think Q4 this year will have better margin than Q4 of last year?", "score": 1, "replies": [{"body": "> Do you think Q4 this year will have better margin than Q4 of last year?\n\nLast year's Q4 was still special: U.S.-only sales of the Model 3 (i.e. much less logistics overhead), and a lot of demand pull-forward into Q4 due to the halving of the $7,500 federal tax credit.\n\nMargins were at a healthy 24.7% accordingly. This year in Q3 margins were at around 22.8%, so 24.7% in Q4 is not out of the question - but basically all margin percentages above 20% are healthy.\n\nBut what matters in reality is cash generation ability, and that was rather impressive in Q3: over $900m of cash generated by operations when adjusted for working capital fluctuations, almost as good as last year's Q3 and Q4:\n\n  Quarter   | cash from operations | changes to working capital | \"stable\" cash flow\n  ---       | ---                  |   ---                         | ---\n  Q3'2018   | +$1,391m             | -$351m                     | +$1,040m\n  Q4'2018   | +$1,235m             | -$199m                     | +$1,036m\n  Q1'2019   |   -$640m             | +$676m                     |    +$36m\n  Q2'2019   |   +$864m             | -$287m                     |   +$577m\n  **Q3'2019**   |   **+$756m**             | **+$191m**                     |   **+$947m**\n\nCash generation ability is what defines Tesla's ability to spend on capex and other growth projects and grow.\n\nBTW., this small table of cash generation is also a powerful falsification of the TSLAQ \"only a single profitable quarter\" thesis: GAAP expenses like elevated depreciation and amortization or stock compensation expenses are non-cash items that don't impact growth of the company. Cash is king.\n\n> Q4 always have better margin, revenue and profit than Q3. \n\nLOL, do you realize that by acknowledging that you are basically capitulating to the bull thesis of Tesla's ~exponential growth, where there's robust QoQ growth and where Q4 is beyond Q3, for the last ~10 years in a row, with the occasional Q1 hickup?\n\nNot a very good \"devil's advocate\". 🤠", "score": 4, "replies": [{"body": "Q4 having better results over Q3 has nothing to do with Tesla’s bull thesis, that’s just something intrinsically true for all consumer companies in the west due to holiday seasons.\n\nActually the correct response to argue against my original “devil’s advocate” comment is that margin growth by itself does not matter, especially since Tesla is pursuing large revenue growth and mass market. If they just wanted to raise margin an easy way to do so would be kill Model 3 and only sell S and X, but that obviously would be stupid.\n\nSo I’m bullish on TSLA, but my thesis has little to do with margin itself.\n\nAlso I don’t know why you kept bringing up TSLAQ arguments. Most of those guys are as bad as the “TSLA will be $2000 by 2020” crowd and offers very little value to anyone’s actual due diligence.", "score": 1, "replies": [{"body": "> Q4 having better results over Q3 has nothing to do with Tesla’s bull thesis,  that’s just something intrinsically true for all consumer companies in the west due to holiday seasons.\n\nLOL, that's not universally true of car companies:\n\n- BMW's Q4'2018 was the third lowest revenue quarter in the year\n- Toyota's Q4'2018 revenue was lower than Q3'2018\n- Fiat Chrysler's Q4'2018 revenue was the lowest revenue quarter in 2018\n\nBut then again, the fact that Tesla isn't primarily a car company is part of the bull thesis as well. 🤠\n\n> Also I don’t know why you kept bringing up TSLAQ arguments.\n\nLOL, not me, it's you who wrote this:\n\n> > If a single profitable quarter is the definitive proof that bears are wrong, \n\nAgain your \"devil's argument\" is ignoring that growth is defined by cash generation (cash flow), not GAAP profitability.", "score": 2, "replies": [{"body": "Ok, which part of my original argument mentioned TSLAQ? Do you even know what a bear is? For example, if TSLA is at $350 today, and I think its true value would be $325, that by default would make me a bear, but that has nothing to do with TSLAQ since those are the crazies that say Tesla will go bankrupt very soon.\n\nI also like how you tweak words to make your argument sound better, like “third lowest in the year”... I mean... there are only 4 quarters in the year so why didn’t you just say “2nd highest”? You are just as bad as TSLAQ at remaining objective.\n\n>growth is defined by cash generation\n\nHuh.... that’s objectively wrong. Growth for a growth company is defined by *revenue* growth, since you can easily generate FCF if you sacrifice revenue growth and cut down marketing/R&D/sales cost. FCF is a metric on *sustainable* growth, in conjunction with growing revenue.", "score": 0, "replies": [{"body": "> > growth is defined by cash generation\n>\n> Huh.... that’s objectively wrong. Growth for a growth company is defined by revenue growth,\n\nStop playing dumb: growth of the EV market, which is only at 1% of its current 100% capacity currently, is defined by the level of capital expenditures and R&D - and both depend on how much cash Tesla generates either via:\n\n- raising capital via selling equity or taking on debt (early Tesla)\n- or via organic, self-sustained, self-sufficient cash generation from operations (current Tesla)\n\n> since you can easily generate FCF if you sacrifice revenue growth and cut down marketing/R&D/sales cost. \n\nWhat a moronic argument: I wasn't even talking about FCF, as you can see my table didn't even ***include*** FCF: FCF already has growth capex subtracted. What matters primarily is cash generated by operations - from which growth capex and growth opex are financed.\n\nYou are *clearly* out of your element here...", "score": 1, "replies": [{"body": "Jesus Christ, can you actually not be an asshole just because I called out your red herring about TSLAQ?\n\nI’m not going to engage with you like this, have a good day.", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Part of the margin increase is because they took a write-down on inventory in Q1 and Q2. \n\nThese were sold at a lower cost and replaced on the balance sheet at current prices. Hence why inventory went up with $200m although they sold 1k more than they produced.", "score": 1, "replies": []}, {"body": ">I’d be happy to read your reasoning why Q318 is more important with regards to Q319 numbers than Q219.\n\nI never said that, I simply asked a question. \n\n>YoY is irrelevant\n\nWhy? Business metrics are measured more on a YoY basis, for revenue, profit, and gross margin. The reason to measure YoY instead of QoQ is to adjust for seasonality and ensure fair comparison. For example, in the automotive business higher profit margin AWD/SUVs sell even better in the fall/winter season than spring/summer seasons, and thus lead to an impact of margin when you compare later quarters to earlier ones. \n\nIn the retail business (and even car business), the Holiday quarter will most likely see a large growth in revenue/profit over the previous quarter, but that by itself is not a definitive sign that the business is growing healthy, and a comparison to the year prior paints you a much clearer picture.\n\n>Q318 had a time-limited unrealistic sales mix (US only, and about to face a huge tax credit drop off).\n\nI fully agree actually, but I swear to god when I mentioned that as the reason the margin won't be sustainable I was downvoted to hell last year lol.\n\nSo now the question for you is, do you think Q3 2020 can be compared to Q3 2019, or was this quarter's margin also caused by some one-time special circumstance that won't be repeated in the future?", "score": 0, "replies": [{"body": ">\tWhy?\n\nI literally told you in my previous comment. I give zero fucks about what ‘common business metrics’ are if people can’t recoginze the substantial differences between Q3’s in 2018 and 2019. In fact, the inability to comprehend the difference strengthens my personal opinion that any such person isn’t really worth listening to.\n\n>\tSo now the question for you is, do you think Q3 2020 can be compared to Q3 2019, or was this quarter’s margin also caused by some one-time special circumstance that won’t be repeated in the future?\n\n There will be Model Y revenue at that time, and I’m sure this will impact margins negatively at first. So my answer is: no. Again: judging Tesla YoY only makes sense if there are no changes in product mix or volume during that year.", "score": 8, "replies": [{"body": "Look. This is the investor sub. Both of us are bulls and there is a good chance that I hold more shares than vast majority of the people here. So is it too much to ask for a discussion without it turning emotional?\n\nFor the record, I don’t know how Model Y will impact margin, there is production ramp up cost but there will also be higher average selling cost due to pent up demand for higher margin models and the fact that crossovers always have higher margins than sedans.", "score": 0, "replies": [{"body": "> So is it too much to ask for a discussion without it turning emotional?\n\nNot at all... I know you’re long and I know you’re mostly looking for information to either validate your opinion, or to question it. The points you are bringing up are just rather weak, to be honest.\n\nAs for Model Y... i agree with what you’re saying, but I think it’ll take a few quarters before we’ll see it contribute to higher margins", "score": 3, "replies": [{"body": "I think given the experience and lessons learned from Model 3, Model Y ramp up should be much quicker and much less costly. \n\nOn the other hand there may be a bit more competition on the market at the time vs. when Model 3 came out, so it should be interesting to see.", "score": 1, "replies": []}]}, {"body": "You're one of the most confusing bulls ever. All I see is negativity from you, how could you possibly be long so many shares with the viewpoints you hold?", "score": 2, "replies": [{"body": "If all you see is negativity from me it’s probably due to a case of confirmation bias.\n\nIn fact, I probably have one of the *strongest* bull argument out of anyone here precisely because I’m a bull *despite* all the negative bear thesis I can argue, not because I only look at one side of the coin and just bury myself within the echo chamber.\n\nYou should never listen to a bull if they can’t present valid bear cases, and the reverse is also true.", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "Haha I’m honored. Well I’d love to learn what I’ve said is “complete nonsense”, but I have a feeling that’s just a list of things you disagree with but don’t know how to argue against.", "score": 1, "replies": [{"body": "The reason I settled on it was you claimed Porsche had more experience in EV motorsport than Tesla when it has exactly zero experience in it. The implication being that the Taycan would be better than a Tesla as a direct result, if I remember correctly", "score": 1, "replies": [{"body": "I do remember saying Porsche has more experiences with electrification in motorsport, and considering the *hybrid* 919 Evo is the absolute Nurburgring record holder I do stand by the statement of them having more experience with using EV tech (battery/motor) in  motorsports (Le Mans prototype class in this case).\n\nThey have also started a Formula E team and will be making debut this December. \n\n>\tthe Taycan would be better than a Tesla as a direct result\n\nWell when it comes to overall performance I was right wasn’t I? \n\nThe Taycan, being their first EV and a luxury sedan, still managed to have better track performance than any Tesla you can buy on the market today. Of course Tesla can and will respond with something that’s even faster, but the fact Tesla that had to respond by putting semi-race tires and significant modifications on a Model S running the not-yet-in-production Plaid powertrain just to overtake Porsche’s record speaks volumes about what Porsche has achieved.", "score": 1, "replies": [{"body": "Ah yes, now you're going to try the same nonsense argument but now framing it and wording it in a way that might better suit the nonsense you were trying to blabber with back then instead of what you actually said at the time...\n\nAnd you think I want a part in that?\n\nNo chance.", "score": 1, "replies": [{"body": "Like I said, if you disagree with any thing in particular, feel free argue against me, and I'm always open to learn new things if you can prove me wrong, it's not like I have never been wrong before. But in the end, however I *frame* something doesn't change reality, and whether you call it nonsense or not doesn't change reality either. \n\nThe reality here is 1. Porsche has motorsport experience with EV tech and Tesla has none, and 2. The Taycan is the fastest production EV around a racetrack *today*. We can discuss those facts being right or wrong, or you can try to attack me personally. \n\n>And you think I want a part in that?\n\nPart in what? Doing due diligence and find evidence to support your argument instead of attacking someone personally or worse, write off people just because you don't want to agree with them? It's your choice, it's the Internet after all :)", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}, {"body": "Galloway isn't saying all bears are wrong because of one profitable quarter, he's saying his specific predictions were wrong (Tesla would fail this year).", "score": 3, "replies": [{"body": "> Tesla would fail this year\n\nThat's a stupid prediction and even if I put on my biggest bear hat I still would not have made that prediction, especially after their positive FCF quarter *last quarter*.", "score": 1, "replies": [{"body": "I think his original prediction was before any Q2 results and the capital raise.", "score": 1, "replies": []}, {"body": "Many, many, MANY bears have predicted bankruptcy in 2018, 2019, and \"certainly before 2020\".", "score": 1, "replies": [{"body": "Well there are also people who predicted TSLA would hit $6000 in 2019, there are crazies on both sides. Ignore them.", "score": 1, "replies": [{"body": "I would say a very large amount of shorts have been expecting bankruptcy any day now. It doesn't seem viable to be short a stock for so long otherwise. I'm not sure I've seen any bulls saying they expected the stock to be $6000 any time soon.", "score": 1, "replies": [{"body": "I don’t think you understand how shorts work. For example if I think TSLA’s true value is $200, I would be shorting it when it’s above $200, and buy when it’s below $200. Just because someone shorts a stock doesn’t mean they believe it will go to 0 or the company will go bankrupt, in fact that’s far from the case. They just think the stock is *overvalued*.\n\nAAPL also has a large short position, but I bet you most shorts of AAPL don’t think a company that makes $150B in revenue per year with $200B of cash on hand will go bankrupt anytime soon.", "score": 0, "replies": [{"body": "My understanding of shorting is the shorter pays a fee to borrow shares. With the vitriol and assuredness in the spaces I've watched, it appears the vast majority of TSLA bears not only think they are overvalued, but actually worth nothing. Just a fraudulent company (constant references to Enron, Theranos, etc). So, taking these people at their word, they've been short TSLA for several years, stating they're always on the verge of bankruptcy. It seems unlikely for any of them to be in the black unless they've timed the drops perfectly, and certainly took a massive hit in the past week. Add on the fees for borrowing the stock, it doesn't paint a pretty picture.\n\nSo back to my original statement, it doesn't seem viable to short a stock for so long. It doesn't cost money to continue holding a long position.", "score": 1, "replies": [{"body": "> With the vitriol and assuredness in the spaces I've watched, it appears the vast majority of TSLA bears not only think they are overvalued, but actually worth nothing\n\nI think you just need to stop reading /r/RealTesla or follow TSLAQ on twitter lol. I guarantee you vast majority of TSLA bears do not think the company will be worth nothing. That's beyond stupid, even if another company buys Tesla it would still sell for billions.\n\n> It seems unlikely for any of them to be in the black unless they've timed the drops perfectly, and certainly took a massive hit in the past week.\n\nShorts have been doing very well this past year in fact, even after last week they would still be making a profit if they shorted Tesla at around this time last year. Remember with Elon's \"funding secured\" tweet it went as high as $380. \n\n>it doesn't seem viable to short a stock for so long.\n\nTrue, but most short positions don't exist for that long. Just because the total amount being shorted didn't change or even increased, it doesn't mean they are the same short position held by the same people.", "score": 1, "replies": [{"body": "Your statement: “... if they shorted Tesla at around this time last year”, is the crux of it.  Shorts need to short high and cover low, and if you look at the graph of short interest vs. stock price, they are doing the exact opposite.  So I would submit they are NOT doing well.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "It is not. It is simply that the bear thesis must change yet again.\n\nIt is actually hard to keep track of, say, bear arguments beaten like a drum just on CNBC. Tesla not capable of making a Sedan. Tesla will never make a single Model X or at least not a Model X at a profit. There will never be a need for the number of batteries made by the so-called gigafactory, so they are pointlessly burning cash they do not have. They will never make 5,000 Model 3 per week. Tesla Energy is a distraction they should dump and simply become a boutique high end car maker; or they will go bankrupt. EVs are a niche product and always will be, so the market is tiny, so demand will fall off a cliff once pre-orders for the 3 are gone...once overseas pre-orders are gone...once overseas markets are “saturated”...once....once....Ummm...ok, people like their products, but no one can make a profit from selling EVs. \n\nSo no proof from one quarter exists that will change most bear opinions. It is like arguing, “ok, you did not die yesterday, but what makes you think you will not be hit by a bus today?”\n\nOn the other hand, how many straight quarters has Tesla been TTM normalized free cash flow positive? And they could have stayed small with S/X and been there longer, but they wanted to explosively grow. If the Model 3 had completely failed, that would have been very bad. But Big Picture, the proof has not been in the past quarter.", "score": 3, "replies": [{"body": "To be blunt: the recommendations of a group of absolute nobody’s (and that includes us, to be fair, as well as all of TSLAQ) really doesn’t mean anything. If these people were so knowledgeable, they’d be in better positions. As to their average knowledge level... as this weekend has shown, as an extra to being experts in the car business, these people are suddenly also roofing experts.  Have you ever met anyone who is an expert in the car business as well as the roofing business? Just let that sink in for a minute... or an hour or two.", "score": 2, "replies": []}]}, {"body": "The trend is going upwards. TSLA was never profitable before but has now been in 3 of the last five quarters. Imo it will have it’s first overall profitable year in 2020 or 2021", "score": 2, "replies": []}, {"body": "Q3 was a lot more than just profit.  It showed a much more structurally sound operation that is poised to grow by 100% in the next 12-18 months.", "score": 2, "replies": [{"body": "Exactly [what I said](https://www.reddit.com/r/teslamotors/comments/dm5tvv/tesla_had_higher_free_cash_flow_in_q3_than_ford/f4y1bn7/) four days ago ;)", "score": 1, "replies": []}]}, {"body": " Because of growth lol.", "score": 1, "replies": []}, {"body": "Because bulls aren’t dumb enough to place an importance on profits when a company is growing so rapidly.  We know that Operating Cash Flow is king.  Profit/Loss is the red herring that the Tesla bears cant get through their heads, is only a good metric steady state companies.", "score": 1, "replies": []}]}, {"body": "Not a lot.  Short interest is only down by 10% or so, per Ihor.", "score": 1, "replies": []}]}, {"body": "It's nothing wrong with being wrong sometimes. People make shitty mistakes and that happens every day for every single person. If we all were acting and thinking perfectly and optimal then the world would be significantly different. \n\nIt is wrong to know that you're wrong and never admit but instead turn everything around so that you squeeze the world into your model instead of the other way around. It may be narcissism or stupidity in the deep roots of it, but some are simply shitty people. \n\nI respect the ones that can suck it up and admit when they are wrong. It isn't a sign of weakness, but a sign of deeper understanding, self awareness, and emotional intelligence in the end as well.\n\nEdit: I read more about what the guy said in the past. Funny thing, the internet. You can't forget stuff anymore and it always come back. Boy he is annoying. In general terms though, I still think what I said applies.", "score": 6, "replies": []}, {"body": "Guy says wear a tie and he doesn't even wear one in the video fucking douche", "score": 4, "replies": []}, {"body": "TL;DL on podcast comments?", "score": 3, "replies": []}, {"body": "They spent the whole podcast shitting on Mark Zuckerberg. Mark has some problems. But the guy had 2Billion people signup to FaceBook,whatsapp is an amazing free service that's currently widely used in third world countries. Now he's being made out to be the villain cause apparently Trump won the election because of FaceBook. Not to mention, he gave 0 credit to Musk for this result, calling out Tesla's governance issues with out any evidence, even tho the current executive Team at Tesla is out doing all the other car makers combined.I lost some respect for Kara for not pushing back on his dumb comments.I'm glad that he'll stop talking about Tesla. One less vocal clown critic, he's worst than the shorts. At least they have incentives to lie and spread misinformation about Tesla.", "score": 3, "replies": []}, {"body": "No shit Sherlock", "score": 1, "replies": []}, {"body": "Guy talks a lot and has probably never seen the inside of a manufacturing plant", "score": 1, "replies": []}, {"body": "This could be an onion headline", "score": 1, "replies": []}]}
