{"title": "Chevron - a bleak outlook", "selftext": "Chevron's earnings have been boosted by soaring energy prices in FY 2022, but as prices consolidate, the company's earnings prospects have deteriorated. CVX is now already deep into an earnings contraction and their Q2'23 free cash flow did not cover shareholder returns. With falling EPS estimates and valuation risks, investors should be cautious.\r  \nChevron profited in FY 2022 from rising prices for petrol and oil due to favourable market developments. Chevron was able to achieve record profits last year as a result of rising oil prices, but as those prices have begun to stabilise, the energy company's profitability prospects have gotten worse. Given the downward trend in the price of oil and natural gas and the sharp drops in earnings and free cash flow reported by Chevron in Q2'23, I think the company could experience significant losses in a world with lower prices.\r  \nChevron set forward a bold strategy to increase its free cash flow (estimated 10% FCF growth yearly, Source), but in my opinion, this objective will only be feasible if energy prices continue high. Long-term energy costs have never sustained 10-year highs and have instead consistently stabilised. Because of this, I think investors should prepare for more pressure on Chevron's earnings projections, which have already started to decline significantly. In the past 90 days, analysts have reduced their EPS forecasts for Chevron's fiscal year 2023 twenty times, compared to three upward EPS revisions.\r  \nThe largest threat to Chevron is the continuation of the production segment price realisations fall, which had a negative impact on the company's financial results in the second quarter. A severe recession could make this issue worse. Additionally, if Chevron does not comply with Australian unions' pay demands, the company's liquefied natural gas facilities could be shut down, which could put additional pressure on revenues in the near future.\r  \nHowever, it's possible that a recession won't actually happen, which would be good for Chevron and oil prices. Reuters reports that the likelihood of a recession has just decreased. Energy prices may rise if a recession is avoided, which would reverse Chevron's profitability and free cash flow trend.\n\n\r  \nhttps://www.reuters.com/business/energy/union-starts-further-24-hour-stoppage-chevrons-australian-lng-facilities-2023-09-17/\r  \n", "id": "16mkobi", "created_utc": 1695109359.0, "score": 35, "upvote_ratio": 0.66, "num_comments": 29, "comments": [{"body": "> Given the downward trend in the price of oil\n\nStopped reading here.", "score": 101, "replies": [{"body": "He is trying to pump the stock so his calls print", "score": 16, "replies": [{"body": "Yeah man, sounds like a totally feasible plan: using Reddit to artificially inflate the price of a IOC that’s market cap is +$300bn and 7-9mm ADTV……", "score": 10, "replies": []}, {"body": "It's still so mind boggling how some users here think they're going to move price based on cheerleading for something here, on a forum where most are looking for quick money trades or have hundreds of dollars available to invest. Especially when it's some unprofitable or pre-revenue company.", "score": 2, "replies": []}]}]}, {"body": "I think you don’t really understand how energy companies and oil major’s specifically work.", "score": 61, "replies": [{"body": "That’s a bingo!", "score": 15, "replies": [{"body": "It’s not really a big secret that oil majors have higher earnings during periods of high energy prices and lower earnings when prices are low.", "score": 6, "replies": [{"body": "I know....hence my original comment......\n\nOP also completely ignores CVX's massive refining business (acting as a physical hedge against low gas prices), LNG projects, and their clean energy businesses (REGI + organic RD / CCS / H2 businesses)", "score": 4, "replies": []}]}]}]}, {"body": "oil is touching 90+ a barrel right now... looks like their next earnings will be just fine because of this. looking further than that is just nuts nobody can predict where the oil price will be in 6 months.  CVX is a dividend king and will be around the next 25 years for sure", "score": 30, "replies": [{"body": "!Remindme 25 years", "score": 1, "replies": [{"body": "I will be messaging you in 25 years on [**2048-09-19 19:36:39 UTC**](http://www.wolframalpha.com/input/?i=2048-09-19%2019:36:39%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/stocks/comments/16mkobi/chevron_a_bleak_outlook/k1bfibr/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fstocks%2Fcomments%2F16mkobi%2Fchevron_a_bleak_outlook%2Fk1bfibr%2F%5D%0A%0ARemindMe%21%202048-09-19%2019%3A36%3A39%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%2016mkobi)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 2, "replies": []}]}]}, {"body": "Supply is tightening which implies that the price of oil will probably go up from here. Even if it stabilizes in the high $80's/low $90's, CVX and the other majors have nothing to worry about.\n\nI worked for a major oil company back in back in 2010-2014 when the price of oil was in the $120's. At the time, the average cost to produce a barrel was in the low $80's, which still meant roughly $40 of profit per barrel. \n\nToday, with changes in technology, the majors are producing a barrel for roughly $55, some are even lower than that. So, do the math... $90+ oil will mean some sweet profits.", "score": 10, "replies": []}, {"body": "Going into winter with supply tightening.", "score": 5, "replies": []}, {"body": "Chevron just purchased a majority stake in the US’s largest hydrogen storage facility in Utah.\n\n$NKLA has new hydrogen trucks hitting the market.\n\nWhile battery electric is getting most of the headlines, it feels like there’s a quiet hydrogen revolution forming in the background for industrial applications and larger vehicles.", "score": 9, "replies": [{"body": "Hydrogen may have its uses but NKLA is not the company you want to cite.", "score": 12, "replies": []}, {"body": "Another interesting bit about hydrogen - there’s proposed legislation for reduction of emissions from power plants that will basically require either carbon sequestration or hydrogen blending with fuels (for gas combustion turbines - the most common form of generation). If that holds true, on account of sequestration being untenable for the majority of locations, hydrogen fuel blending will be the only real option. This will take an incredible amount of hydrogen and hydrogen infrastructure to support.", "score": 2, "replies": [{"body": "We should also get a tax credit ruling from the IRS before year as well.", "score": 1, "replies": []}, {"body": "There is absolutely no way the legislation gets passed as it is now - an absolutely insane amount of h2 midstream infra would need to be developed across the country, not to mention the already current issues of transporting h2", "score": 1, "replies": []}]}, {"body": "They also paid $6bn for the largest publicly traded RNG company last year too", "score": 2, "replies": []}, {"body": "So your saying they threw money away?", "score": 2, "replies": []}, {"body": "Can these new NKLA trucks move forward without gravity assist?", "score": 1, "replies": [{"body": "No truck can move forward without gravity assist.", "score": 3, "replies": [{"body": "😑\n\nCan this truck do more than just roll downhill is what I mean.", "score": 0, "replies": []}]}]}]}, {"body": "Yahoo finance shows most earnings expectations going up, at least for this year and next. Personally, I think going beyond a year or two for an oil company is not that effective anyway. \n\nDo you have a source for your long term numbers?", "score": 4, "replies": []}, {"body": "The industry, including Chevron, have rigged it so they still make great money at $60 oil.  This quarter, oil has done nothing but rise.  \n\nIf they were making $15 on $65 oil, that means they're making $40 now.  It's windfall time.", "score": -1, "replies": []}, {"body": "A bleak outlook maybe in a year when oil prices fall. Better load up on some 2025 puts", "score": 0, "replies": []}]}
{"title": "Opportunity to load up NVDA", "selftext": "[removed]", "id": "16ms2ql", "created_utc": 1695132695.0, "score": 0, "upvote_ratio": 0.12, "num_comments": 26, "comments": [{"body": "Sorry -- we removed your post or comment because it's low effort.  Please put effort into what you post to r/stocks.  Any of the following are considered low effort and will result in your post or comment being removed:\n\n* Posts or comments that rely on memes to get your point across\n\n* Posts or comments which are basic one/two sentence questions\n\n* Posts or comments that are similar to ones made several times recently\n\n* Posts or comments where no actual research was done before asking the question or starting the discussion\n\nIf you need more information on a stock, try looking it up on finviz.com or a business news website.  After that, come back and back up your statements with a source or provide a more in-depth question.\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules", "score": 1, "replies": []}, {"body": "Zoom that chart out and look again.\n\nNot so sure the current decline is a buying opportunity when it’s still up 194% YTD.", "score": 28, "replies": [{"body": "Was gonna say this as well.", "score": 6, "replies": []}, {"body": "It was", "score": 1, "replies": []}, {"body": "[removed]", "score": -12, "replies": [{"body": "[removed]", "score": 8, "replies": [{"body": "[removed]", "score": -12, "replies": []}]}, {"body": "But is there a lower bound? The outlook can be wrong, what will happen then? If you want to follow buffetts ideas, then you should also focus on avoiding risks.", "score": 1, "replies": [{"body": "There is no bounds either way.\nThe point is any prediction can be right or wrong.", "score": 0, "replies": [{"body": "If a company has assets or reliable cash flows that actually exist or *highly* likely do, there is a lower bound. Nvidia also has one, just it is a fraction of the  current price, so you are taking on a lot of risk for a expected (and thus mostly priced in) upside.\n\nOf course growth can happen for longer than is currently expected and the stock outperform. Just be aware that there are also massive risks with your investment and at least statistically a low chance of success.", "score": 2, "replies": [{"body": "I agree with the underlying theory of what you are saying. It is a risk, yes. I am predicting it's worth taking this risk.\n\nThe problem with your approach is - even if in six months, I turn out to be spectacularly right, you will not update your view. You will simply point out that, this was an exception and hence nothing changes. I somehow think there is at least something wrong with approaches like this, where data seems to not change the learning.\n\nTake this analogy. A climber who is climbing say Half Dome - does she take any risk? Should most people take that risk? No. Should she stop because of it? No. Does it mean everyone is making a mistake by not taking that risk? Also No. Neither side is actually wrong! What makes her risk worth taking is her unique skill and experience.\n\nIn this case, I am sort of like her. I am not an average joe with no knowledge or experience in the field. The quality of my risk assessment can't be compared with the average person. This is not bragging but based on facts that I know about myself. Can I prove it? I sure can, but I don't need to. Because I am not giving any official financial suggestion. This is reddit - an open public forum. So take what you want.\n\nAt the end of the day, I know what I am doing. If you don't agree, that is totally fine and normal.", "score": 0, "replies": [{"body": "Thank you for the feedback. As i said, as long as you are aware of the risks, your more than welcome to go for it. Who knows, you might be right and strike it big in the progress, while I wont because i didn't take the risk.\n\nDo you mind sharing a little of your risk assessment? I'm genuinely curious.", "score": 1, "replies": [{"body": "Sure.\n\nNvidia's biggest moat is not its hardware, but the software ecosystem that has been incrementally and intricately built around the hardware. Even with all the new AI startups that are allegedly going to eat NVDA's lunch, the scenario is not changing a lot. The first reason is, most of these startups are for inferencing. While in training, where bulk of the expensive AI hardware market exists, NVDA is an undisputed king, with no competitors even in the same zipcode. Second, the software. The CUDA architecture is owned by NVDA and it's paramount in doing any performant training. Even with newer hardware can achieve better performance on paper, simply due to the momentum and scale, the industry won't be able to take a sharp turn away from CUDA. They are basically married to it. Even in the long term, this might not change. This pattern is not unique to deep learning hardware. There are many systems in our world, that simply will not change (or anytime soon) not because a better system can't be designed, but the resistance to change is way too big. Examples are - keyboard layout, car driving methods etc. CUDA is something like that. And to be honest, it's not like there is a better alternative today anyway. I am talking about potential future possibilities. \n\nIt's up to you to believe me or not, but I worked in DL research at NVDA. I will minimize personal information for understandable reasons. But this is just to let you know that I am technically as knowledgeable as one could be in this domain for the purpose of having a good understanding of where the technology is heading. Note, I am not saying I am the smartest guy. I am simply saying, my understanding of the tech is deep enough. From high level model development to all the way to hardware, thanks to my experience in Nvidia.\n\nFinally - as said before, of course I could be wrong. Since when is predictions supposed to be 100% correct and mathematically proved?", "score": 1, "replies": [{"body": "Well, thank you for the insight. I can see where you are coming from. Do you think it would be possible for other big competitors to come in and take a big slice of the cake? Not mecessarly taking over the whole market but a viable alternative?\n\nAnd as you said, the future is uncertain and you can never be sure. I can fully understand that you think NVDA as a company will do well and i might even think the same, my only \"problem\" is that i am not sure (enough) the current valuation is justified if one expects an above average return. They would have to grow massively (50%+) for years and years to come to make their owners good money.", "score": 1, "replies": [{"body": "It's less likely that the NVDA party will be killed by a big player. Because big companies move slow and each of them already has their own kingdom to protect. Companies like Intel and AMD still have to compete for the CPU market and neither of them is showing any sign of spark when it comes to AI. They are doing too many things and always running after the next shiny object. \n\nThe current valuation is not justified. That actually is true. But this is the part I think many people might not see or I disagree with. The price of stocks are almost entirely based on hope and future outlook and possibilities. Even if a company beats earnings by 25%, if there is a chance or news that they will go bankrupt in five years, the stock will instantly plummet. It will not wait until 4 more years to go down even though the business could be super profitable in the meantime. So stock is disproportionately future heavy. Secondly, think about this way - does it matter if the price \"appears\" to be too high than we want it to be? Market decided it for you. So a price is never over and never under. It always is what it should be. Since NVDA current price is shocking to many people, I would argue that it won't be too far fetched to predict those people can continue to be in shock when the price keep going up. Just couple of months ago 300 seemed like overpriced as hell. Now a 400 is a big drop. Think about it. I am telling you - in a year it will cross 500 and then 600. In five years we will be debating if it is going to cross 1000 or not.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "Stocks zooms 200%, pulls back a tiny fraction and already were getting Buffett quotes?", "score": 23, "replies": []}, {"body": "Buying the dip ≠ value investing", "score": 12, "replies": []}, {"body": "Imagine talking about NVDA and following it up with \"applying Warren buffetts strategy\"", "score": 7, "replies": [{"body": "Buy the dip guys, it's only up 202% YTD", "score": 7, "replies": []}]}, {"body": "Sir Bag Holding area is on lane 7", "score": 7, "replies": []}, {"body": " Applying buffet strategy on NVDA with this valuation 😂😂 you clearly don’t understand what buffet does then", "score": 5, "replies": [{"body": "Buffet is not a person. Lol.", "score": 1, "replies": []}]}, {"body": "Maybe if it declines back to 2022 levels lol", "score": 4, "replies": []}, {"body": "Warren Buffet literally says he doesn't buy or sell because of price action, he buys when he sees value in a company, and sells when he sees a better opportunity elsewhere, not because it dipped after a huge tear.", "score": 3, "replies": []}, {"body": "Up 230% in the past year. Down 5% in the past week.\n\nOP: MASSIVE BUYING OPPORTUNITY \n\nlol", "score": 3, "replies": []}]}
{"title": "Wtf is wrong with my stocks am I doing something wrong???", "selftext": "[removed]", "id": "16mujmf", "created_utc": 1695138460.0, "score": 0, "upvote_ratio": 0.37, "num_comments": 20, "comments": [{"body": "Sorry -- we removed your post or comment because it's low effort.  Please put effort into what you post to r/stocks.  Any of the following are considered low effort and will result in your post or comment being removed:\n\n* Posts or comments that rely on memes to get your point across\n\n* Posts or comments which are basic one/two sentence questions\n\n* Posts or comments that are similar to ones made several times recently\n\n* Posts or comments where no actual research was done before asking the question or starting the discussion\n\nIf you need more information on a stock, try looking it up on finviz.com or a business news website.  After that, come back and back up your statements with a source or provide a more in-depth question.\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules", "score": 1, "replies": []}, {"body": "How old are you, how much did you invest, when did you invest it, and what were you expecting? Sounds like you might have loaded up on hot companies at the peak.\n\nFrom the sounds of it, your expectations are *wildly* misinformed. I'm not sure why you would compare your returns as a retail investor to the compensation received by execs at the companies you invested in?\n\nBut without any further info, I would suggest you stop trying to pick stocks entirely. You don't have the knowledge or experience for that. Buy a total market ETF like VOO and make regular contributions to that through a pre-authorized contribution plan (PAC) while you spend some time learning about the world of stocks, bonds, and investing.", "score": 8, "replies": []}, {"body": "You bought a scam and two tech stocks during a time of high volatility.", "score": 5, "replies": []}, {"body": "Quit…", "score": 10, "replies": [{"body": "Quit what,??", "score": 1, "replies": []}]}, {"body": "Thanks for buying the top.", "score": 3, "replies": [{"body": "OP is what smart money refers to as 'exit liquidity'.", "score": 5, "replies": []}]}, {"body": "OP is into Witchcraft .....\n\nShould do an day-to-day \"beginner investor\" vlog-series.", "score": 2, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "He should be trying to contact the demon god of money Mammon and make a deal. Only way this guy would make any money.", "score": 2, "replies": [{"body": "The \"only\" way?", "score": 1, "replies": []}]}]}]}, {"body": "Always amazes me how people randomly buy companies they don't know anything about and then complain that they are losing money.\n\nYou bought Nikola? You're losing money in Nvidia and Apple? I guarantee you no long-term investor is losing money on Nvidia and Apple. Nikola is a scam company that will never be profitable and scale. The issue is you don't know what you're doing and should be buying ETF's instead to minimize any risk.", "score": 2, "replies": []}, {"body": "If Nikola is such a scam, why is it on an exchange and why is it allowed to be such a scam? \n\nI thought all these experts and analysts in the SEC , or others that do this for a living, would know this, and not allow any company that looks even slightly iffy to trade on an exchange. \n\nI feel the same sorrow the OP does, because if these scam companies get past the SEC and onto an exchange, why wouldn't people invest in them - at the time it sounded great to buy NIKOLA", "score": -1, "replies": [{"body": "This was the before and after moment for Nikola:\n\n[https://www.theverge.com/2021/7/29/22599726/nikola-founder-securities-fraud-charge-milton](https://www.theverge.com/2021/7/29/22599726/nikola-founder-securities-fraud-charge-milton)\n\nIt was on the exchange before this.\n\nThis is what is meant by doing your DD (due diligence) when researching a stock.  Most \"analysts\" you read are there to sell a story, any insight they may provide is secondary. At the end of the day, it is always buyer beware, and it is NOT the job of the SEC to stop a fool and his money from parting.", "score": 1, "replies": [{"body": ">It was on the exchange before this\n\nWhy? \nWhy, if the company was an obvious scam, or any company, would it be allowed to remain on the exchange?", "score": 0, "replies": [{"body": "OK cool - so we can belittle someone because they didn't see an article about the Nicola fraud?\n\nWhat a load of shit - people here mostly say pick a stock and forget about it , check in on it every 6 months. Yet, should be all over the stock and DD to.make sure you don't lose money.\nWhat a crock. Can't have it both ways", "score": 0, "replies": []}, {"body": "Because \n\n1. there's a difference between what the general public call a scam (business model with obvious flaws) and the formal definition of what the SEC takes down legally.\n\n2. Even if something comes to be taken down by the SEC the process can take years to fully delist (you can't just force a business out because something doesn't smell right).  In the meantime a tremendous amount of greater fools can buy in.\n\nAgain.... at all times, buyer beware.", "score": 1, "replies": []}]}]}]}, {"body": "How tf did you lose money on Nvidia and Apple", "score": 1, "replies": [{"body": "Most likely is that he bought recently, they've both been falling for the last 2 weeks.", "score": 1, "replies": []}]}, {"body": "When did you you buy apple and nvidia? Because there’s no chance you have been holding either position for more than a year and are down. \n\nI wouldn’t lump nkla in with the other two, it’s not even the same sport much less the same league", "score": 1, "replies": []}, {"body": "Well you invested money in a scam and 2 companies at their all time high. Apple will be fine long term. Nvidia will likely dip some more.\n\nYou should sell Nikola for sure, and any additional money you have to invest should go into index funds and not additional stocks. \n\nBuying individual stocks is gambling. Buying index funds is investing. If you want to gamble, your odds are better if you go to your local casino and play some baccarat", "score": 1, "replies": []}]}
{"title": "Wtf is wrong with my stocks am I doing something wrong???", "selftext": "[removed]", "id": "16munj7", "created_utc": 1695138716.0, "score": 0, "upvote_ratio": 0.15, "num_comments": 29, "comments": [{"body": "Sorry -- we removed your post or comment because it's low effort.  Please put effort into what you post to r/stocks.  Any of the following are considered low effort and will result in your post or comment being removed:\n\n* Posts or comments that rely on memes to get your point across\n\n* Posts or comments which are basic one/two sentence questions\n\n* Posts or comments that are similar to ones made several times recently\n\n* Posts or comments where no actual research was done before asking the question or starting the discussion\n\nIf you need more information on a stock, try looking it up on finviz.com or a business news website.  After that, come back and back up your statements with a source or provide a more in-depth question.\n\nA full explanation of all /r/stocks rules can be found here: https://www.reddit.com/r/stocks/wiki/rules", "score": 1, "replies": []}, {"body": "Stock market is a long term game , ignore all the fugazzi rn and chec it like once every 6 month", "score": 9, "replies": [{"body": "I did that and still am down money\n\nI’m an O bagholder", "score": -1, "replies": [{"body": "You buy O for the divy not the growth. What did you expect?", "score": 5, "replies": [{"body": "Didn’t expect it to go from 70-54 in a year…\n\nWhat is this a meme stock?", "score": 2, "replies": [{"body": "No, its a real estate company heavily in debt in a rising rates environment", "score": 0, "replies": [{"body": "Looks like and acts like a meme stock imo", "score": 0, "replies": [{"body": "Yeah I'd say buying real estate companies that are heavily in debt in a rising interest rate environment is a meme", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "sounds like you need to do some more reading up etc about investing etc.", "score": 6, "replies": []}, {"body": "Look every ten months. It'll shock you.", "score": 6, "replies": []}, {"body": "If you invested in NVDA and AAPL you had great returns unless you literally only started a month ago. What are you talking about?", "score": 5, "replies": []}, {"body": "First, I would not invest in a stock like Nikola. That company is founded by a scammer. Second, you need to be patient. Buy a handful of stocks that you know and follow. Don’t put all your money in it but just what you are willing to lose. Investing is a long term game and give it 10+ years. If you don’t have the stomach for it then sell all and just buy money market funds or CDs.", "score": 3, "replies": []}, {"body": "Ignore it for a couple years", "score": 2, "replies": []}, {"body": "You're not a billionaire over night on the sock market, must mean you're not day trading enough", "score": 2, "replies": []}, {"body": "Well, you’re referencing gurus, likely YouTube and instagram clowns whom are likely lying and have never made a dime in the stock market and rather derive all their income from social media and courses. Avoid these scumbags as they don’t give an accurate description of how investing actually works and how plausible certain returns are. \n\nSecondly, you’re investing in high beta tech stocks and NKLA, which is a money losing EV company thats former CEO is a convicted of securities fraud. Saying NKLA is risky is quite the understatement. \n\nIf you want to get into investing I suggest you research and understand investing and finance first before you actually invest, otherwise stick with low cost index funds and stop stock picking. Stock picking is a full time job which entails extensive hours of reading SEC filings and keeping up with the news of your portfolio.", "score": 2, "replies": []}, {"body": "  You bought two very mature comps note that are near their all-time highs. Keep Nvidia and Apple.   Get rid of that other thing.   Buy some O and SCHD and chill.  Set all of your dividends to reinvest on your brokerage platform. Don’t worry things will get better.", "score": 2, "replies": []}, {"body": "The \"check in 6 months\" strategy.\n\nI used this after the stress nearly killed me checking the stock every day lol\n\nSo I recently checked after maybe 7 months. Every stock is down by at least 40%.\nI have one stock MTTR that is down 90.9% .\nMy PLTR is down 40% \nSENS down 80%\nLUMEN  down 85% \nCENNTRO down  96%\n\nWhen I was checking the stock everyday, it at least gave me an idea of how a stock was going. MRIN was down 50% and I couldn't see how it could come back, so I sold for a 16k loss.\nThat sounds crazy, but that stock is a couple of dollars now, and I would have lost WAY more if I kept holding, or checked in 6 months.\n\nSick of the stock market.\nThere is no strategy that works, and it's like going to Vegas- some win big, but overall you lose big.\nSome might land on black and do amaaaazingly, like TSLA (remember the one....that this group said to stay away from up 1550% since 2019)\n\nSo, its a roll of the dice I reckon. \nAnalysts don't have a clue, and neither do we.", "score": 3, "replies": [{"body": "You're investing in shit stock so expect shit returns. Whats the asset to debt ratio, how much capital do they have for buybacks, how much is going into R&D and are their P.E.'s less than 30? By all metrics there are shitty stocks at these prices.", "score": 2, "replies": [{"body": "All of these metrics are utterly irrelevant when looking at tsla. \nSo what's your answer to that. \n\nAll the stars may align for a company when you buy it, then 2 quarters later it could be a dumpster fire. As most of my picks have been\n\nPeople don't want to admit when they're wrong about a stock, and always laugh at the guy that's losing, but only see tiny gains themselves. Show how great you're doing or shut up.", "score": 0, "replies": [{"body": "These metrics are relevant to the most stocks. That's why you need to buy broad ETFs, unless you want to sit and read through financial statements every day. This has been proven over and over again. \n\nNo need to get sassy when I'm giving you practical advice. If you try to beat the market you will lose. Period. It's been explained by Graham in The Intelligent Investor more than 50 years ago and it's still relevant today. \n\nShow me academic literature that proves it wrong and advises the intelligent investor to yolo into every hot topic stock to beat the market over a 40 year period. You'll find that it doesn't exist and then might start to understand why you're losing against the market in the long run.", "score": 1, "replies": [{"body": "Wasn't aimed at you personally, although I see how it reads - \nI just meant everyone. \nThe Royal  YOU - everyone is so quick to slam someone's trades or show them the reason why they're so shit at picking stocks. \nAs I said, it seems like a lottery to me. There are sweetheart darlings that the media always pump, and then there's everything else. \n\nPeople trying to make a few quid on the 'everything else' shouldn't be heckled or smuggly mocked. \n\nIf the Graham strategy is so fruitful,  why are there day traders, or people that do yolo etc etc.\n\nAnyways - I bring it back to the tsla point I made - only a few saw massive gains from tsla, while everyone else stood with their arms crossed saying ' look at those dummies, they will lose it all '\nWhile they're making a miserable 3% on the most up voted on this forum. \n\nPeople in here seem to be a bit stuck their own arse, (not aiming at anyone in particular) - sniggering at the people losing, while only playing is safe with an etf. \nOver the long run, that may indeed be the best solution, but maybe, just maybe, we (i) could pick a tsla that moons and makes me rich - that's the dream we're all in on.", "score": 0, "replies": [{"body": "Better to just go to the casino and put it all on black. If you have 100 stocks and 5 are going to beat the market then the casino can atleast give you better odds than trying to pick the 5 that win. \n\n\nEspecially where you need to put in a good portion of cash to make something worthwhile off of that gamble.\n\nYou get your multimillionaires that made cash off one single life changing stock. But they are far and few. Everyday stock market millionares are the boring guys that invest into ETFs or actually regularly read up on company financials to do proper risk assessments... because it works. People just don't understand that slow boring growth is what gives you your million.\n\nGame theory also supports ETFs as it's always a positive sum game. Individual stocks can be positive or negative as, like you said, they're unpredictable. Why take the extra risk of losing hard earned money? Especially if you can't afford to lose that money as you're not rich yet.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "You impatient bastards need to understand stocks create value over years and decades not fucking weeks and months, Christ where did all these noobs come from and why they always scared and whining so much. Go read a book about Warren buffet for Christ sakes", "score": -1, "replies": []}, {"body": "Maybe try finding a spell to make money if your \"spell to find a gay boyfriend\" worked", "score": -4, "replies": []}, {"body": "Did you invest last week? This sounds like a shitpost but it’s not. Also these gurus are scammers. If they were so good at trading they wouldn’t need to sell you a course. \n\nDo some research and come back.", "score": 1, "replies": []}, {"body": "This has to be a troll post. You bought a shit company and two overvalued companies.\n\nGo learn the actual fundamentals of investing not from some guru that’s probably photoshopping their results", "score": 1, "replies": []}, {"body": "Buy high sell never", "score": 1, "replies": []}, {"body": "Yes, yes you are", "score": 1, "replies": []}]}
{"title": "The Ten Largest US Airline Stocks are Down 24% Since July as Costs Surge", "selftext": "https://tokenist.com/the-ten-largest-us-airline-stocks-are-down-24-since-july-as-costs-surge/\n\nIn 2023, Brent crude oil prices surged to an all-time high of $95 per barrel, posing significant challenges to the airline industry's recovery. Fuel costs, accounting for 15-20% of airline expenses, have seen a remarkable 71.7% increase in cost per gallon since January 2019, as reported by the Bureau of Transportation Statistics (BTS). This volatile oil market has also made airline stocks highly unpredictable.\n\nAs a result, the S&P Supercomposite Airlines Industry Index plummeted by nearly 24% since its July peak at $250. Earnings expectations for 2024 have declined by 10%, and the outlook for 2023 anticipates an 8% drop in average airline profits, a stark departure from earlier projections. Airlines such as American and Spirit have had to revise their forecasts due to soaring fuel expenses.", "id": "16n0d2d", "created_utc": 1695152641.0, "score": 126, "upvote_ratio": 0.95, "num_comments": 37, "comments": [{"body": "The industry’s healthy despite the gloom and doom. (I work in it)", "score": 58, "replies": [{"body": "lol Jblue’s price is lower than what it was during GFC.", "score": 6, "replies": [{"body": "The stock prices are not correlating to reality", "score": 10, "replies": []}, {"body": "It’s cause of the save merger buyout", "score": 3, "replies": []}]}, {"body": "Thank you for your anecdote. I'll add it to the pile.", "score": 1, "replies": []}, {"body": "Government shutdown means airport security isn't getting paid. It won't be pleasant to fly until they do.", "score": 1, "replies": []}]}, {"body": "It's not just that, but sales/revenue are not as high as expected, I don't get how everyone is taking \"revenge\" travel yet airlines are not flooding with cash...\n\nAs for costs, DAL & AAL EPS growth are both around 200%, so even though their costs will go up with oil, they have been phenomenal with cutting costs.", "score": 26, "replies": [{"body": "every plane i take is absolutely full. Idk if there are fewer flights or what but airlines must be making boatloads.", "score": 21, "replies": [{"body": "[removed]", "score": 11, "replies": [{"body": "I think you mean profit.  Revenue aka sales is what you collect from customers and that number is not affected by your expenses.\n\nSo my point before was, if there's all this revenge travel & as u/salahelbat said \"every plane i take is absolutely full\" then revenue/sales should be growing, but it's not.  [See here](https://finviz.com/quote.ashx?t=DAL&p=d) and look at sales q/q & eps q/q.\n\nBased on the link above, if every plane is full, then sales q/q should not be a pitiful 12.70%, but the eps q/q is a whopping 148% which means that labor+fuel isn't stopping the company from bringing down costs.\n\nSo something else is going on.. like ticket prices being too cheap (just a guess).", "score": 0, "replies": []}]}, {"body": "Not really, your average Joe will penny pinch and the airlines makes *peanuts*. The real moneymaker used to be *business travel* where companies paid ridiculous amounts for a seat...\n\n\n\nBut nowadays we got Teams and digital meetings. Companies were forced to rethink giving the CEOs son a paid 4 week vacation to \"socialise\" abroad. Until money is cheap, and companies can splurge massive amounts on unnecessary travel, airline stocks will be in trouble.", "score": 1, "replies": []}]}, {"body": "Leisure travelers tend to pay much lower fares than business. Full planes of vacationers are not necessary as good as a few high revenue passengers. \n\nAlso, pilots just got a solid raise.", "score": 14, "replies": [{"body": "That's a great point, now I see it:  Remote work is killing airline profits.", "score": 2, "replies": []}]}, {"body": "Eh, those numbers are available and inferences can be made from them. Here they are directly from TSA:\n\nhttps://www.tsa.gov/travel/passenger-volumes\n\nLooks fine to me compared to 2022 and 2019. Prices will correlate strongly to oil though. I expect they've been raising prices for all future flights.", "score": 3, "replies": [{"body": "I wonder how much of that volume is business vs leisure. u/creemeeseason brought up a good point that business seats are probably down and that's where the airline would make the most money.", "score": 1, "replies": [{"body": "https://www.statista.com/statistics/207103/forecasted-number-of-domestic-trips-in-the-us/\n\nHere's some info, with projections.\n\nOddly helping the airlines....total flights are down from pre covid. \n\nhttps://www.bts.gov/newsroom/full-year-2022-us-airline-traffic-data\n\nSo they're flying fewer planes which helps control costs. They can use larger planes to compensate, which cost less per passenger. \n\nI don't have data in average fares, unfortunately. However, definitely higher percentage of leisure travelers than. Pre covid.", "score": 2, "replies": []}]}]}, {"body": "I don’t think revenge travel lasts for years or decades, tickets prices are already plummetting… because… of demand.", "score": 4, "replies": []}]}, {"body": "Brent crude’s all time high was $147.50 per barrel in 2008. It isn’t even at its one year high yet.", "score": 9, "replies": []}, {"body": "High energy prices are killing the airline's asses", "score": 16, "replies": [{"body": "Don’t they lock in fuel prices for years to come?", "score": 3, "replies": [{"body": "Ya they have futures contracts, it's what got them in trouble about a decade ago.", "score": 1, "replies": []}]}]}, {"body": "Maybe this industry is just terrible for shareholders except for the absolute best swing traders. Even if you bought these stock at the absolute bottoms during the Covid carnage, you'd have seen mediocre returns compared to the rest of the market. Airlines, legacy auto, cruise liners, etc. are tough businesses.", "score": 6, "replies": [{"body": "Agreed. Just a few months ago I was looking at the lifetime stock price history of some of the airline stocks, and by and large they were dreadful. \n\nHistorically any industry involved in making flying machines has tended to be a very bad industry for investors.", "score": 1, "replies": []}, {"body": "Agreed completely as an investor it might not be worth it except to trade in and out and it’s not a great long term hold. Lots of competition foreign and domestic  makes downward pressure on prices. business class model pricing isn’t working since covid and a weak mild push to do business travel means they would have to redo business model and pricing… also in usa these major airlines are “making” money thru alternative means like selling points for their system… basically banking without banks… I wouldn’t buy them long term… maybe a very small position for swing trading if I really ran out of ideas", "score": 1, "replies": []}]}, {"body": "Maybe this country should go with high speed rail and whittle the airlines down to a duopoly like most other industries.", "score": 2, "replies": [{"body": "No it shouldn’t, that would make too much sense", "score": 3, "replies": [{"body": "Exactly. We love making passenger trains wait on tracks while merchandise and cargo trains zip by", "score": 3, "replies": []}, {"body": "Wasting days on a train and paying more does not make sense.", "score": 1, "replies": [{"body": "You’re not going to waste “days” on high speed rail.", "score": 1, "replies": []}]}]}, {"body": "lets see that train go to Hawaii", "score": 1, "replies": [{"body": "It’s not meant to be a replacement.   Planes have their place.   The majority of short hop flights could be replaced by a rail system.   That would be far more efficient than the process to get on a plane.   The existing train network gives priority to freight which is the reason its slow and sucks.", "score": 3, "replies": []}]}]}, {"body": "Time for more bailouts", "score": -4, "replies": []}, {"body": "Patting myself on the shoulder…I haven’t touched airlines since I was burned with Southwest in 2001 911 - I ate it that day and lucky for me learned a lesson", "score": 1, "replies": []}, {"body": "Yeah makes no sense why a temporary oil increase will cost a company to lose 24% value. \n\nI’ve been buying airlines for the past couple of months", "score": 1, "replies": []}, {"body": "And Delta is in full FU mode with their two year plan for medallion holders - because the lounges are too full?\n\nLolz.\n\nMay hurt AMEX more, but Delta will also feel the pinch as those who book business travel through things like CWT won’t work to land a Delta flight.", "score": 1, "replies": []}]}
