{"title": "Fork in the road for Feds tomorrow. A prediction.", "selftext": "Here's what's going down tomorrow:\n\n1a) Feds refuse to drop rates - \"WTF? Its the Feds job to prop up the stock market, WTF do they think they're doing.\" All hell breaks loose; lemmings head for the cliff/exit. SPY turns red. A few autards whack off to a few tendies while the rest shits their pants.\n\n1b) Feds refuse to drop rates - Market cheers, \"Hey, the economy is doing great so feds didn't need to cut rates afterall. Looks like we bear commentator retards were wrong.\"  SPY turns green. A few autards whack off to a few tendies while the rest shits their pants.\n\n2a) Feds drop rates 1/4 to 1/2 point - Market cheers, \"J Pow in the house, ma nigga knows w'sup.\" SPY turns green. A few autards whack off to a few tendies while the rest shits their pants.\n\n2b) Feds drop rates 1/4 to 1/2 point - \"Shit, recession confirmed.\" Once feds drop rates as response to yield curve inversion, we know shits gonna hit the fan sooner or later. SPY turns red. A few autards...\n\nAll possibilities equally likely so you can be right on the direction of the cuts, but wrong on the direction of the market.  I might add this could be the catalyst for the big drop all the bears were hoping for. . . or a big BYND burger. I am sure of one thing: long WSB man-juice and poo.", "id": "cu70nl", "created_utc": 1566524092.0, "score": 47, "upvote_ratio": 0.85, "num_comments": 55, "comments": [{"body": "Plot twist - J Powell raises rate in order to fuck Agent Orange. \"Who's big dick daddy now, Orange Boy?\"", "score": 61, "replies": [{"body": "Raising rates = economy is strong, spy green!", "score": 12, "replies": []}, {"body": "„My 8 inch dick tells me we need to raise rates to 8%“", "score": 5, "replies": []}, {"body": ".... I am?", "score": 6, "replies": [{"body": "Nah, yours is inverted.", "score": 9, "replies": []}]}, {"body": "neocoff\n\n>Plot twist - J Powell raises rate in order to fuck Agent Orange. \"Who's big dick daddy now, Orange Boy?\"\n\nI would literally take a day off and spend half of it drunk.\n\nI don't drink.\n\nBut man, would that be a reason to drink.", "score": 2, "replies": []}]}, {"body": "3) Powell's speech is purely dry and academic. Nothing new is disclosed and markets end up moving up then down then back to flat as bots flail about trying to trade on every single syllable that leaves Powell's mouth. A few autards who bought iron condors whack off to a few tendies while the rest shit their pants. Bogleheads don't notice a thing.", "score": 48, "replies": [{"body": "Good one, didn't take into account iron condom plays.", "score": 18, "replies": []}, {"body": "Gotta hand it ta ya bub. Your prediction was right on the money so far.", "score": 3, "replies": [{"body": "Thanks! Though seems that I missed the Trump's wild response to Fed not lowering rates...", "score": 1, "replies": [{"body": "Haha i got that covered in one of my responses on here so suck it... j/k", "score": 2, "replies": []}]}]}, {"body": "market will probably dump right before his announcement like last time, or it'll moon cause they're 100% sure he announces QE and 50bp and then dumps when he says \"we'll keep monitoring economic data\"", "score": 2, "replies": []}, {"body": "It was even better with the Chinese doing a sneaky run in from the left. I wonder if this will actually change anything", "score": 1, "replies": []}]}, {"body": "Tldr- but we all know what the outcome is gonna\nbe - disappointment", "score": 28, "replies": [{"body": "Where were you when my English told me to write succinctly.", "score": 14, "replies": [{"body": "If you meant american literature: ignoring decades of mental illness conditions that affect almost all American famous literature authors\n\nIf you meant schooling from england: ignoring centuries of slavery, exploitation and drug trade\n\nif you meant the language of english itself: dunno, /r/scottishpeopletwitter is pretty funny", "score": 0, "replies": []}]}]}, {"body": "They aren't cutting rates. You know how much evidence and time they needed for the first cut? And after the FOMC minutes from last month, its apparent that they wait and sit on data before they make a move.", "score": 20, "replies": [{"body": "And the data since the last meeting has been shit.", "score": 4, "replies": [{"body": "But there hasn’t been ENOUGH data. It’s been 1 month.", "score": 5, "replies": [{"body": "Treasury yields dropping over 100bps in a few months is a pretty damn huge data point and we still got another month to go", "score": 5, "replies": []}]}]}]}, {"body": "All comes down to when Donny tweets", "score": 6, "replies": [{"body": "Oh Donny Boy the pipes are calling", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 5, "replies": []}, {"body": "A rate decision isn't even being made tomorrow. Ban these retards please.", "score": 17, "replies": [{"body": "You talk as if I'm suppose to know what I'm talking about. My iQ is under 70 buddy.", "score": 20, "replies": [{"body": "r/SuicideByWords", "score": 0, "replies": []}]}, {"body": "This is a thread for hypotheticals please get out of here with your facts", "score": 6, "replies": []}, {"body": "Had to scroll way too far for this comment", "score": 2, "replies": []}]}, {"body": "nobody gives a shit about the feds outlook on the economy. Only the rate cut.  Nobody cares about the reason. Consensus is that if rate cuts are enacted, the cycle will continue a couple more years.\n\nIf they dont drop rates, the feds are responsible for keeping the yield curve inversion which will CAUSE a recession when banks stop lending money", "score": 9, "replies": [{"body": "There is a loop hole. We can open the window to further rate inceases and continue the bull market. How? By throwing Iràn under the bus. We just need to declare another war. \n\n*WAR = MORE spending*\n\n*Government Contracts = More money in consumer pockets*\n\n*Demand for oil increases price, which enriches companies* (oil shortage?)\n\n\n*Flex our military muscles on China, Tariff man relected*", "score": 5, "replies": []}, {"body": "But I do think folks give 2 shits. I think the statement that comes out of that meeting will guide the direction of the markets for the next few weeks barring any holy tweets from the chosen one.", "score": 3, "replies": []}, {"body": "Cutting rates when its obvious the market is shit is simply a band aid masking the recession beneath it.  The recession is coming, whether it happens this year or next has yet to be seen.", "score": 3, "replies": [{"body": "The market isn't shit tho. \n\n\nThe bond market is", "score": 3, "replies": []}]}, {"body": "Yeah cause the last 2 times the fed started a cutting cycle it totally stopped the recession in it's tracks", "score": 2, "replies": [{"body": "Agree. They cut too slow and raise too fast.  They need to admit a full point rate hike last year was a mistake", "score": 0, "replies": []}]}]}, {"body": "Counting on a blood red day at close for the sake of my qqq puts expiring tomorrow and a few other stocks. Sic em bears", "score": 3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You never know. Futures turned red with China announcing retaliatory tariffs. Now need Fed to come out as hawkish and no cuts.", "score": 2, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Fuck yeah! This market was so overbought this week it’s crazy.", "score": 2, "replies": []}]}]}]}]}, {"body": "Wow imagine if someone hired you for attention to detail...\n\n3) Fed raises rates... GFG", "score": 3, "replies": []}, {"body": "Buy 8/30 strangles, best way to play. No matter the commentary the market is mooning or drilling to China for the next couple trading days. I expect if the market drills though that mid next week Trump will tweet something to turn the market.", "score": 3, "replies": []}, {"body": "Thoughts on the Yuan weakening to its current position, 7.09, showing a stronger USD and our current “green” futures? Fed claims it’s Morning success to strong economic growth and no rate cuts.. market panics puts and calls?", "score": 3, "replies": [{"body": "Is that as of today? Where is the direct source for this btw? I keep only finding the rate way after the fact through some reuters article but don't know where the original source is printed. Lately noticing less mention of this in the news as though it's purposefully being swept under the rug and no more \"not as bad as analyst predicted\" commentary.", "score": 3, "replies": []}]}, {"body": "So it is going to be alot of whacking and pooping? Good.", "score": 3, "replies": [{"body": "There's a reason why wsb calls itself \"if 4chan found a bloomberg terminal\".", "score": 1, "replies": []}]}, {"body": "I'm going to wait for the chosen one to tell me how I feel about it", "score": 2, "replies": []}, {"body": "When the recession hits North America I am afraid Feds got no interest rate drop to stimulate the economy.  Today, mortgage interest is 2.75-3% by then it will be close to zero or head negative.  Stock tumbled. No one wants to invest in low interest bonds. If you study stocks from 10 years ago P/E ratio was solid. Today like homes the stocks are over valued by a large margin. Do not know how to live with negative interest.   1% reduction to stimulate economy is excessive IMO.", "score": 2, "replies": []}, {"body": "Everything looks very solid here. There’s just one thing I just can’t quite put my finger on and. It’s the few autards who whack off to a few tendies...This is not an easy concept to grasp here amidst the controversial word of gains in any other way aside from a lifetime of tax deduction carryover losses.", "score": 2, "replies": []}, {"body": "I have lube and tissue ready for anybody who needs it", "score": 2, "replies": []}, {"body": "Trump said he didn't want to depreciate the dollar today. I don't think they'll be a rate cut, but who knows.\n\nWhat time will the announcement hit?", "score": 1, "replies": [{"body": "10 am pst i think so in a few minutes", "score": 1, "replies": []}]}, {"body": "Update: Statement sounds accommodative. SPY reverses big red as of writing but still red.", "score": 1, "replies": [{"body": "Shit nevermind, back to big red", "score": 1, "replies": []}]}, {"body": "The feds are not going to raise or lower rates tomorrow.... the only time they do that on a non-FOMC day is during rare emergencies.", "score": 1, "replies": [{"body": "How come there's so many economists that seems to know what they're talking about on this sub? I thought it was a bunch of retards like me.", "score": 4, "replies": []}]}]}
