{"title": "Perfect time to buy?", "selftext": "Like Warren Buffet said “buy when there is blood on the street”. It’s max panic right now in the market. Every news outlet will have a article on the upcoming recession, fund managers are also singing how much we will be fucked in the next few quarters . \n\nHow I see it we are already in a recession, we have passed the peak point of the recession, and coming to a recovery . The reason for it is the rising interest rate, which have to rise because of inflation. In the last 2 CPI reports, inflation has slowed significantly. Before inflation rose sharply due to the high gas price, now you can go to you local gas station and see that fuel is on a down trend. \n\nThe fed is also slowing their interest rate rise to 0.5%. I can see an end to this high inflation issue that we are having and returning back to normal. I’m buying heavy every chance i get.\n\nJust wondering what will you do?", "id": "zm6f5h", "created_utc": 1671062392.0, "score": 4, "upvote_ratio": 0.53, "num_comments": 91, "comments": [{"body": "Spy is like 15% off it's lows of 2 months ago. Where is the blood?", "score": 34, "replies": [{"body": "It’s coming down the river of denial.", "score": 13, "replies": []}]}, {"body": "S&P falls 0.6%, Nasdaq -0.7% = max panic?", "score": 58, "replies": [{"body": "It is if you're a Tesla bagholder.", "score": 29, "replies": [{"body": "If you’re a tech* bag holder. And it feels crazy bloody to me being over 40% down. But I started investing at the literal worst time. Harsh lesson to learn and now I still have no idea what to do. Stay and just take the pain and wait many years? Take out out and reinvest some of the losers? I feel most of my picks have a good chance of coming back better then before but when I thought of pulling some out before the worst of this crash knowing more was coming I was told \"when do you get back in?\" \"No one times the market.\", so it just lead to me holding and watching it go lower and lower. I am happy I am finally learning more and got into investing so I can hopefully learn some key lessons and make use of those lesson later on when I am more successful but its a rough start.", "score": 2, "replies": []}]}, {"body": "amazon, Googl, tesla, meta, nvda and many more -50-90%", "score": 10, "replies": [{"body": "[deleted]", "score": -4, "replies": [{"body": "Amazon down 50% YTD, Tesla down 60%, FB down 70%, NVDA down 45%. You didn't look.", "score": 7, "replies": []}, {"body": "For the year meta is down like 70+%", "score": 2, "replies": [{"body": "Meta is a special case because they are funneling money into a vision that many don't believe in. The others may be good buys, yes. But that's only if they weren't overvalued before the bubble burst, which isn't something everyone can agree on 🤷‍♂️", "score": 1, "replies": []}]}, {"body": "NVDA has made up a lot of its losses", "score": 1, "replies": []}]}]}]}, {"body": "[deleted]", "score": 12, "replies": [{"body": "Exactly", "score": 4, "replies": []}]}, {"body": "The VIX is at 21, hardly blood in the streets.", "score": 26, "replies": [{"body": "Watch out tho…Blood tends to dry and then to evaporate…vix is low but because previously blood has been dried…you might miss the train by waiting for vix=100…in other words you have to some how weigh vix and spy to see where do we are when playing the stupid market timing game", "score": 4, "replies": [{"body": "I’ve been buying from all those fleeing small caps the past 9 months. I’m always trading something. \n\nThe VIX is the most accurate indicator I know in the market. I’ll say it again. The most accurate indicator I know.\n\nI’m a speculative investor and a contrarian by nature. Bear markets always make me a bunch of money. Don’t get me wrong, this has been a crazy year but money never sleeps.", "score": 5, "replies": [{"body": "Good luck brother, but please don’t make money if it’s really a zero sum game 🐸", "score": 1, "replies": []}]}]}]}, {"body": "I’m concerned because fuel prices are being held to artificial lows. The government has been utilizing the Strategic Petroleum Reserve to inflate inventory. We are now at the lowest level in 38 years. What happens when it runs dry?", "score": 9, "replies": [{"body": "I think that reputable oil producers will see a good upswing when that happens. I'm betting on it.", "score": 4, "replies": [{"body": "You will not be disappointed. I figure by June at the very latest we’ll see it", "score": 2, "replies": []}]}]}, {"body": "What a dumb thread. S+P has gone from 3500 to 4100, and there’s blood in the streets? Sheesh", "score": 7, "replies": []}, {"body": "I think next earnings season will be awful.", "score": 7, "replies": []}, {"body": "Vix > 50 is blood on the streets and there wil be blood in 3 to 6 months.\n\nWhen earnings will decline even more.", "score": 8, "replies": []}, {"body": "The fear and greed index is still in greed.  Back during the June and October dips, there was much more 'blood in the streets', we were seeing some real fear.  If you intend to hold for 5+ years, now probably isn't a bad time to buy a S&P500 index, but don't be shocked if you drop back down to June or October lows again.  No one ever knows the perfect time to buy, just DCA.", "score": 5, "replies": []}, {"body": "Patience, Grasshopper.  He who gets too far out over the tips of his skiis crashes hard.", "score": 9, "replies": []}, {"body": "This isn’t even close to blood in the streets. How old are you??", "score": 9, "replies": [{"body": "you might want to check individual stocks.", "score": -1, "replies": [{"body": "Overvalued high growth technology stocks which are not profitable are the ones who are rightfully getting hammered. Do you remember when BofA was $5 a share in 2008/2009? Now that’s blood in the streets.", "score": 2, "replies": []}]}]}, {"body": "Keep DCA into the market. I’ve been doing that since the first of the year on a monthly basis and it turned out pretty well compared to the rest of the market averages.If you try to catch a falling knife you will get sliced", "score": 8, "replies": [{"body": "Time in market beats timing the market. Just buy instead of trying to time the market like you recommended.", "score": -4, "replies": []}]}, {"body": "I'm buying .Fearopium is so strong now", "score": 3, "replies": []}, {"body": "*It’s max panic right now in the market.*\n\nYou have never seen panic. This isn't panic.   \nMonday, Oct. 19, 1987 was panic", "score": 3, "replies": []}, {"body": "It is always good to look for the light at the end of the tunnel, but you are grasping at straws at the moment.  Based on your example, your argument is basically, rates increases are slowing, mission accomplished, moon soon.\n\nThis is delusional, because in a recession fueled bear market, rates actually get slashed, heavily, once things start breaking, only after that can you look forward to a light at the end of the tunnel.  There is still an avalanche of negative consequences that have not played out yet, so far we are starting to see the end of the stagflation stage, but don't confuse that with the end of the recession stage, which always follows after stagflation.\n\nSentiment isn't even bearish, it has been bullish for over a month now, which can easily be seen just looking at the indexes, VIX or the greed vs fear index: \n\nhttps://www.cnn.com/markets/fear-and-greed#:\\~:text=What%20is%20the%20CNN%20Business,to%20have%20the%20opposite%20effect.", "score": 8, "replies": []}, {"body": ">It’s max panic right now in the market.\n\nThe S&P 500 is down 16% from the peak. There is no panic whatsoever.", "score": 7, "replies": []}, {"body": "Dow Jones is only down 7% and S&P is down 16% from ATH and you call this max panic and blood in the street?\nMarket is currently very optimistic that inflation is dead and fed will cut rates in 2023.", "score": 4, "replies": []}, {"body": "The layoffs haven’t even started yet. We definitely aren’t passed “the peak point of the recession”.", "score": 15, "replies": [{"body": "[deleted]", "score": 8, "replies": [{"body": "Yea, like ~50,000 jobs? Wait for the service and manufacturing layoffs.", "score": 6, "replies": [{"body": "Those layoffs are not coming.  Manufacturing is growing", "score": 8, "replies": []}, {"body": "333w", "score": 1, "replies": []}]}]}, {"body": "I just started investing this year. Can someone fill me in on the bull run from 2020 to this year? I know we had a very long bull market from 2010 to 2020 when the pandemic hit. Then when the pandemic hit, was there a downturn in the market? Then when did the market turn around during covid and go on it’s bull run? When did the bull run end?", "score": 3, "replies": [{"body": "just look at a daily chart for the past 30 years and you'll get your answers", "score": 1, "replies": []}]}, {"body": "Can we chill with this exhausting hyperbole? 8k jobs were cut in my area(I live in Silicon Valley), the layoffs have definitely more than 'just started'.", "score": 2, "replies": [{"body": "There are currently 10.3 million job openings in the US.", "score": 3, "replies": []}, {"body": "We're adding 100k more jobs than needed every month. Yup layoffs barely started. Doesn't the US have like 5m of hires every month. That 8k is a drop in the bucket.", "score": 3, "replies": [{"body": "Who is \"we\"? Definitely not the companies freezing their hiring. Do you have a source for that 100k, and what % of it is tech?", "score": 1, "replies": [{"body": "We is the USA, not just any particular city. Do you read the monthly job reports by BLS? Almost 300k net jobs added every month in the last 3 months when we only need 100k to be consistent with maximum employment. I believe tech jobs added like 30k last month?\n\nhttps://www.bls.gov/news.release/empsit.t17.htm", "score": 4, "replies": [{"body": "Okay, since we speaking nationally.... they added 30, lost 50. That's a 20k deficit. Paired with the freezings and smaller tech companies doing layoffs now(as in startups.... companies that shouldnt ever be doing layoffs), lets just return to my original point, which I think we've supported pretty well now: layoff season for tech is well underway.\n\nI have no idea what other industries are gonna do, I don't have a crystal ball. But if I were to guess, tech will probably stand out as the most impacted, with the Nasdaq 1yr graph being a nice little allegory for that statement.", "score": 1, "replies": [{"body": "the guy you responded to was talking about the whole job market though, not just tech. If we're gonna use layoff as a barometer for recession, can't exactly just pick one sector. As far as initial unemployment claims and continuing jobless claims, we're probably almost at 2019 level, which was the strongest job market in history with unemployment at like 3.7%?  You can't exactly say we're at the tip of a recession when Powell's up there saying the job market is way too hot. We're talking about the present so you don't need no crystal ball. Just look at some data.", "score": 2, "replies": []}]}]}]}, {"body": "3 buddies in 6 figure tech jobs have been laid off in 3 weeks.  You haven’t seen a true recession yet. Wait until we are paying the prices with no jobs, dependent on government again", "score": 1, "replies": []}]}, {"body": "Anecdotal, sorry.", "score": -1, "replies": [{"body": "What do you mean 'anecdotal' this is headline news lol, tech workers are already facing their recession. Do you think 8k people looking for jobs(50k across the nation) are going to believe you when you say ' the worst is yet to come'?", "score": 3, "replies": [{"body": "Yes.", "score": 2, "replies": []}]}]}, {"body": "Well wait till the service and manufacturing sector’s start. Your high paid tech jobs laying off 50,000 basically has no impact.", "score": -1, "replies": [{"body": "Service? You mean the restaurants and food places that for all of 2022 were emphatically stating they were hiring, are going to start getting rid of people now?? That's gonna happen???", "score": 3, "replies": [{"body": "It certainly could. The layoffs are starting at the top in the tech sector. Those are the folks that have enough money to travel, pay for hotels, eat out, and buy useless shit. What happens when there is even more layoffs in the higher income sectors and they aren’t spending frivolous money?", "score": -2, "replies": []}]}, {"body": "Manufacturing jobs in sectors with strong price elasticity will be fine. We're actually at 110% of bonus this year. Feels good man", "score": 1, "replies": []}]}]}]}, {"body": "One slow down does not mean they will keep slowing down. The Fed has said that they want to observe the affects of their rate hikes, since it usually takes a while for the affects to be fully understood.\n\nI see the 0.5% as a test to see if things really have calmed down, not as a sign that things are getting any better. I'm going to wait and see what happens in January and February before I do anything drastic.", "score": 2, "replies": []}, {"body": "Not\n\nEven\n\nClose to done.\n\nIn fact.  We've only just begun.", "score": 6, "replies": [{"body": "Is\n\nExactly \n\nThe\n\nNews\n\nOP\n\nIs referring\n\nTo", "score": 5, "replies": []}, {"body": "I\n\nDon't\n\nKnow\n\nThe \n\nFuture", "score": 3, "replies": []}, {"body": "How dramatic. Peak bear sentiment from retail is always a buy signal.", "score": 2, "replies": []}]}, {"body": "Not there yet. You will know there is blood in the streets when nightly and local news are reporting on the recession. Otherwise like the comment to DCA into your portfolio. Don’t expect recovery level gains for a while.", "score": 2, "replies": [{"body": "So instead of corporate news why not look around and like talk to real ppl?\n\nI don’t care what any of them say, my financial decisions are based off of real, unpaid people I meet every day. Not generally what some entity is reporting.\n\nSorry kinda bullish rn. I think the damage that has been done will begin correcting itself within a few months.", "score": -5, "replies": [{"body": "I meant this was a signal that we were close to max pain (aka blood in the streets). The recession is risk is covered extensively in financial press. When you start to see recession penetrate and persist local news or nightly news that means that it is significant enough and salable to a general audience. \n\nI talk to real people and use anecdotal evidence all the time In order to collect data to better validate a given thesis. I saw a post about UPS volume being down 50% off last holiday season. Definitely going to ask my UPS driver about this (taking in account I live in an affluent ski town). \n\nEveryone has their own style. For my part, depending on a given theses I also tend to do things like deep dive into company financials, read white papers from the fed etc. etc. \n\nSimilar types of things that we have seen recently signaling we were close to the top (frothiness) - \n\n1) signing RE contracts waiving home inspection or earnest money going hard on acceptance for an above asking deal that the agent is double ending - people are suing their agents. Super frothy, not a healthy market\n\n2) when we started crypto ads during superbowl that was a similar signal. Mass penetration of a highly speculative unregulated asset was unfolding before our eyes\n\nIn respect to being bullish v bearish I am trading options right now, so I can be a bear one day and a bull the next. In the mid term I don't see a sustained market rally nor do I see the pain easing for either consumer or businesses. There are literally opportunities to make money every single day. The macro is terrible and the fed, for better or worse has set a course. They are mid-journey  so some of what unfolds in coming months is pre-determined at a high level. Is it possible we don't see a recession? It is but not probable. \n\nWhile painful, recessions are a somewhat healthy part of the broader economic cycles.", "score": 1, "replies": [{"body": "Eh ya. I agree. We seem kinda similar man I’m abt 90% options myself rn. I want to make a big move one way or the other but I just don’t see it. Like I said mostly bullish, all the way puts on the obvious ass overvalued companies but no all ins at this point.", "score": 2, "replies": [{"body": "Nobody can argue antecdotal has been the slay the last few months “META spent HOW MUCH on the new VR thingy which was slightly better but cost way more”?!? That was a freebie 🤪🤪", "score": 2, "replies": []}]}]}]}]}, {"body": "Outpredicting the market on short term macroeconomics is like building your own F35 jet with what you can find in your kitchen. \n\nEven if you somehow have the brain to outcompete the ridicilously fierce competition, your toolbox doesn't even remotely have any of the important tools you need.", "score": 1, "replies": []}, {"body": "I keep buying TSLA at these prices", "score": 0, "replies": []}, {"body": "I buy what I can afford once per month", "score": -1, "replies": []}, {"body": "You go first and signal to me if it's safe.", "score": 1, "replies": []}, {"body": "I mean, I guess I’m buying every chance I get too since I max my 401k and buy every 2 weeks… but I don’t think this is the bottom for the market or the economy. I buy more SCHD, VIG, SPHQ etc… buying less QQQ & individual stocks. Got a few QQQ puts & VIX calls just in case.", "score": 1, "replies": []}, {"body": "I'm not predicting a crash or anything, but the past couple of months have felt like the \"return to normal\" phase of the [market cycle](https://i0.wp.com/transportgeography.org/wp-content/uploads/stages_bubble.png?w=900&ssl=1) more than anything else.", "score": 1, "replies": []}, {"body": "Slow your roll a bit. If you have a 100 dollars in your wallet, spend them over the next year or so is my advice. Not all in a month. If you have a good inflow on top of the 100 (say 20 bucks a year) you can perhaps be a little more aggressive and then if greater buying opportunities present themselves use the inflows to be aggressive.", "score": 1, "replies": []}, {"body": "I'm using similar logic, but my timing might be slightly different. still, if something gets really clobbered and I can understand why I might nibble here and there since the turns on markets happen quite abruptly. I think winter is important as it will tell us all a bit more about the painfully uncontrollable food and energy components and times well with the post-holiday seasonal employment periods.", "score": 1, "replies": []}, {"body": "Definitely buy every chance you get, just don't panic sell when it drops. The bear will likely end with a max fear/panic event causing full capitulation. Your comments on inflation are just silly nonsense.", "score": 1, "replies": []}, {"body": "Whatever decision you make, stick to it.", "score": 1, "replies": []}, {"body": "We are nowhere close to capitulation :) AAPL is the straw that will break the camels back, when they miss earnings there will be blood on the streets.", "score": 1, "replies": []}, {"body": "Lol max panic. Nowhere near to it. Wait for next year. That will be something else...", "score": 1, "replies": []}, {"body": "It’s not max panic yet. We’re not even close to the lows of a couple months ago.", "score": 1, "replies": []}, {"body": "Idk I mean tsla is still pumping even tho a crash was eminent", "score": 1, "replies": []}, {"body": "Lol @ “max panic”\n\nFirst recession? (Covid doesn’t count)", "score": 1, "replies": []}, {"body": "Wake me up when it's 50% down. Still way overpriced!", "score": 1, "replies": []}, {"body": "I feel like people's brain reset every morning like 50 first dates. The price isn't some amazing low that you need to snap up, the price is what the price was in november. Just going up then down again doesn't make the down part a good buy if it wasn't something you wanted to buy when it was going up and was the same price", "score": 1, "replies": []}, {"body": "I'm looking for anything with an EV/EBITDA under 8 with strong growth and management. \n\nI bought WERN at $38 recently.", "score": 1, "replies": []}, {"body": "Blood!?   \nThe fighting ain't even started! We're just exchanging harsh language at this poiint... nobody's even gave their iPhone to a friend to hold for safety before the swinging starts!", "score": 1, "replies": []}, {"body": "What panic? That was legit orderly selling. Vix is still low. Literally zero panic.", "score": 1, "replies": []}, {"body": "do it 🫡", "score": 1, "replies": []}, {"body": "So gas is low and that's the only factor you think matters with inflation? Have you gone out to eat recently, or looked at the rental / housing market? If you read the cpi report you'll prove your own post wrong mate.", "score": 1, "replies": []}, {"body": "I will buy when VIX is close to 30, sell when its around 20\n\nIt has worked well in 2022. Besides VIX, I rather buy in January. FOMC was not a guidance the market preferred. I rather wait out some of the bleeding. \n\nI do have long investments and short-term trades on though - but to add more risk - I will wait for SPY/VIX to hit certain points of interest", "score": 1, "replies": []}, {"body": "Where were you when the S&P was around 3600?", "score": 1, "replies": []}]}
