{"title": "First Tesla Contract", "selftext": "Closed out my Amazon put at about an 80% gain to take advantage of Tesla puts for a similar premium at a lower delta.\n\nI compared both companies and Tesla's metrics and valuations are starting to look pretty attractive in comparison to Amazon. I sold Jan 27 $100 puts, and would be okay taking assignment at these levels. \n\nTesla's tanking off the news of Elon considering stepping down as CEO, which isn't necessarily a bad thing, but that doesn't mean he'll no longer be active in the company from a Chief Engineer perspective.\n\nWhat say you?", "id": "zqql1j", "created_utc": 1671548274.0, "score": 16, "upvote_ratio": 0.71, "num_comments": 93, "comments": [{"body": "Just don’t catch the falling knife is all. I’m staying far away from TSLA puts but $100 entry isn’t bad imo", "score": 19, "replies": [{"body": "My thoughts exactly. I know institutional investors like round numbers, and unless Elon does something simply foolish, I can see investors jumping in to prop up the price, especially at $100.", "score": 8, "replies": [{"body": "> and unless Elon does something simply foolish\n\nI think this is where the trade might go wrong", "score": 2, "replies": [{"body": "I don't doubt it", "score": 2, "replies": []}]}, {"body": "I agree with u there, anything’s possible but I don’t see TSLA dumping below $100 before Jan 27", "score": 3, "replies": [{"body": "The premiums are juicy, but I don't mind nibbling", "score": 3, "replies": []}]}]}, {"body": "$100 is still 6x what it was for most of 2019. It's pretty crazy to me. I'll just keep selling my far OTM TSLA calls and if it 4x's in a month I'll lose all of my profit from selling TSLA options, otherwise, I'll keep collecting.", "score": 5, "replies": [{"body": "How far OTM we talking?", "score": 2, "replies": [{"body": "I sold a 12/30 $172.50c yesterday and a 1/20 $225c last week for around $100 premium each. I've made about $10k/year the past 3 years on TSLA selling far OTM calls when sentiment is negative and far OTM puts when sentiment is positive.", "score": 2, "replies": [{"body": "You selling calls Naked?", "score": 2, "replies": [{"body": "Yeah, I sold spreads to start off, but now even if the stock jumped 50% in a week I could just bail and still be way up for the year. A couple of times in late 2021 I had uncovered TSLA calls that got deeply negative and bailed for decent losses, but still had a nice year overall on TSLA since VIX was pretty high and the internal volatility was even higher.", "score": 3, "replies": [{"body": "Based on your experience (haven’t been looking at Tesla too closely) over the last 3 years, does the stock jump far or fast enough to make rolling impossible for a call? And you sell 30-45 days? Or weeklies?", "score": 2, "replies": [{"body": "It certainly can. It went nuts in late 2021 and I rolled once, and then took my loss when it kept rising. In terms of DTE, I've been playing that by ear based on sentiment. Sometimes people are expecting news soon and a weekly pays insane premium even far OTM, sometimes (especially when Elon is going crazy on Twitter) it falls into a bouncy pattern and I go further out since the daily jumps can be intense. Right now I have one that was about 30 days out when I sold it, and another that was about 11 days out.", "score": 3, "replies": [{"body": "Cool, thanks for the insights! I think in this bearish environment, such jumps are unlikely. Tesla premiums are always rich I guess, reflecting the volatility in the stock!", "score": 4, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Elon's considering stepping down at twitter not tesla, i don't think his ego will allow it", "score": 8, "replies": [{"body": "It was mentioned that there was fear about him possibly doing so", "score": 2, "replies": []}]}, {"body": "[removed]", "score": 5, "replies": []}, {"body": "I sold a Jan 20 $100 put. Keep in mind for the 27th you might have to hold through their next earnings report.", "score": 5, "replies": [{"body": "I honestly haven't been as focused on company earnings lately when selling puts, mainly because I'm getting away from speculative junk and starting to focus more on blue chip companies.", "score": -7, "replies": []}, {"body": "Oh, nice. I got the same date and strike price. \n\nHow much did you get it for? I got in at 1.15.", "score": 1, "replies": []}]}, {"body": "Tesla is a great company but it has always been over valued and driven by pumping tweets even before Musk purchased Tesla. Before split it reached north $1200+ which is way too much and it never balance out with its balance sheet.\n\nI believe one golden tweet from Musk with some new model announcement or him getting  back to focus on Tesla is all market care about and it would just bounce back. I've strong opinion Musk is going to get back to Tesla to give it pump. Its no big deal there is another strategy to get stocks down low enough $100 level for Musk to start buying  and then do some vodoo magic announcement \"I am back...\"", "score": 5, "replies": [{"body": "😊", "score": 1, "replies": []}, {"body": "He's lost his shine. People are starting to realise he's just a narcissistic charlatan", "score": 1, "replies": [{"body": "He is a businessman first rest comes later.", "score": 1, "replies": [{"body": "He was a charlatan long before he was a businessman", "score": 2, "replies": [{"body": "Ok brother you win! :)", "score": 1, "replies": [{"body": "🥳", "score": 1, "replies": []}]}]}]}]}]}, {"body": "*Tesla's tanking off the news of Elon considering stepping down as CEO, which isn't necessarily a bad thing, but that doesn't mean he'll no longer be active in the company from a Chief Engineer perspective.*\n\nTesla is also tanking because the nasdaq keeps falling, too", "score": 7, "replies": [{"body": "Tesla's being hit much harder than the Nasdaq.", "score": 5, "replies": [{"body": "There’s a reason Tesla lowered prices recently on their cars- it’s a demand issue. Elon is great at over promising and under delivering.  The companies P/e is ridiculous.  \n\nHe claimed in his last conference call that demand is not an issue but that simply is not true.", "score": 6, "replies": [{"body": "Isn’t the price lowering temporary to tempt people to buy this year before the new EV tax breaks? I’d love to see Tesla genuinely lower prices but didn’t think that was the case.", "score": 1, "replies": [{"body": "They doubled down and now the discount is 7500.", "score": 1, "replies": [{"body": "Nice. That’s what, half of the price increase since 2020 or so?", "score": 1, "replies": [{"body": "Not sure as I don’t follow their price increases closely.  I don’t invest in them other than a car I own made by them.  \n\nI did read that they are halting production (model y) in Shanghai for all of next week.  This is something they have never done and offered no explanation.  I won’t be surprised if the stock tanks next week.  I’m really looking forward to the new year and see 4th quarter earnings.   They have competition now and it’s eating at market share.", "score": 1, "replies": []}]}]}, {"body": "They lowered prices yesterday, model 3 and y qualify for the fed tax credit of 7500.  \n\nModel 3 now 44k -7500. \n\nI suspect it might go lower towards end of year when they get really desperate to meet sales #s.", "score": 1, "replies": []}]}, {"body": "The PE is in the 30's and PEG ratio of .2, growing EPS 150% year over year. \n\nAny PEG ratio under 1 is considered good btw.  .2 is unheard of.\n\nThe demand issue is FUD. The facts are prices have gone up by $10,000 to $20,000 for almost every model because the backlogs were year+ long. Expecting them to never reduce prices again to manage demand is just silly.\n\nAt a time when all other car manufacturers are shrinking Tesla is actually gonna grow deliveries 40% in 2022 despite missing almost an entire quarter at their largest factory due to lockdowns.", "score": 1, "replies": [{"body": "Pe is 46.17x  as of today per td Ameritrade. \n\nFord is raising prices to slow down demand for their truck ev.  Do you think they will lower prices once demand slows for their trucks?", "score": 2, "replies": []}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Agreed", "score": 1, "replies": [{"body": "Discount now at 7500- they are really trying to make the numbers look good going into Q4.  I stopped tracking Tesla when fundamentals went wacky on it.  Carbon credits and accounting just was off for me.  \n\n\nThe china plant is saving them.  If he didn’t sell out to the Chinese- I don’t think Tesla would have been viable.   The Chinese are great at infiltrating all companies on Chinese soil and taking IP to RE.  \n\n\nIf it was up to Musk , he would run all the US factories like china.  Essentially like slaves.", "score": 2, "replies": []}]}]}]}]}, {"body": "good luck - I tried to do one expiring 12/30 at 140p, got scared and closed it at a slight loss and then fomoed in again on a 140p for 12/23 and just closed it break even\n\nI changed my mind and honestly think the risk reward profile isn't great for it right now. tesla sentiment is quite negative at the moment", "score": 7, "replies": [{"body": "This is actually the best time one could start a position, though I'm not really open to taking assignment of any company in this market, Tesla is still growing, and an $100 entry point doesn't seem bad at all.", "score": 3, "replies": [{"body": "$100 might not seem bad, but 42 PE ratio is a bit shit. GM @ 6 and Ford @ 5 ... and yes TSLA is a car manufacturer like those others - except TSLA has the lowest back order list in the last 5 years :/  \n  \nNot to mention Elon has involved into someone a bit 'hard to like'. A lot of world is truly beginning to tire of billionaire ass hats.", "score": 3, "replies": [{"body": "We know mature companies grow much slower, and this is why the the legacy automakers have much lower PEs.", "score": 3, "replies": [{"body": "LOL how much more 'growth' you think TSLA has? As other keep catching up TSLA will have less growth not more. We might've seen peak TSLA as far as price/ PE ratio", "score": 2, "replies": [{"body": "I've made this argument myself, but I don't plan on taking assignment. Just getting some income.", "score": 1, "replies": [{"body": "personally I avoid TSLA I find it as MEME as AMC, GME, BBBY - just can't trust the rationality of the moves.  \n  \nOn another point $14,000 software add on - for FSD that is really more nerve racking then driving yourself (See marquis brown FSD drive) on youtube for an honest look at its progress.", "score": 1, "replies": [{"body": "I wouldn't put it in the same categories as the ones you've mentioned. They're a mess. Tesla's growth during its early years wasn't tied to meme-esque motivation.", "score": 3, "replies": [{"body": "I think it was with Elon saying things like 'You'd be stupid to buy any other car, a Tesla model 3 will uber for you to the tune of 30k' or 'The ability to drive across the country soon' ... or the classic 'building a EV everyone can afford'\n  \nCybertruck won't be the hit some think it will be - the semi is mediocre at best ~ The yoke steering wheel is a bit goofy, model y is just a inflated model 3..  \n  \nBest thing Tesla has going for it are the stories of cars having driven 200k miles and still having 85-90% battery range. On the other side - panel gaps are horrible - and each car has at least some repairs done under warranty.", "score": 2, "replies": [{"body": "It's only a trade to me. I'll only take assignment if my back's against the wall.", "score": 3, "replies": [{"body": "Great thread here - good conversation - Best wishes with your trading in the future.", "score": 2, "replies": [{"body": "Thanks allot", "score": 2, "replies": []}]}]}]}]}]}]}]}]}]}, {"body": "I'd maybe agree at $100, but $145 seems like there is a very real possibility of further declines.\n\nEven NVDA fell from 330 to about 105. And they are far more an established company then Tesla is. The main risk of Tesla imho is that they don't have a long term growth trajectory established necessarily - it isn't going to be known when their growth stops or falters, and there is some evidence that it might already be happening. Which is probably part of why the stock has fallen so much.\n\nI do have some shares but I was just changed my opinion on shorting puts right now, I don't think in the short term the risk is worth it. When risk is back on, if/when the fed pivots, that will likely be good for tesla.", "score": 3, "replies": [{"body": "My opinion on this current market is in 2023, investors will start buying up the dogs of '22 that have positive and growing earnings. It never fails.", "score": 1, "replies": []}]}]}]}, {"body": "\"Tesla's tanking off the news of Elon considering stepping down as CEO\"\n\nTSLA should be going UP on news that the coke snorting idiot is planning on stepping down.", "score": 4, "replies": [{"body": "That's what I'm saying, in so many words", "score": 2, "replies": []}]}, {"body": "Since when did Tesla trade on valuation ?", "score": 2, "replies": [{"body": "They're starting to become more sensible", "score": 3, "replies": [{"body": "At even $100/share, Tesla's market cap will be $313B. In comparison, Toyota (largest auto maker) is $191B and CATL (largest market cap battery maker) is $143.\n\nThere is still plenty of room to fall.", "score": 2, "replies": [{"body": "Is Toyota growing earnings 150% per year?", "score": 2, "replies": []}, {"body": "I got you, but I'm seeing $100 as a psychological level. If it fails to hold, it'll be a mess though.", "score": 1, "replies": [{"body": "You make a fair point but then you're trading on expectations of others versus sensible valuations.\n\nWhat I think would be a more interesting analysis would be to figure out or guesstimate when additional interest payments will be due for Elon on Twitter he's going to need to dump more stock to cover these payments because he has other significant fungible assets.\n\n\nThose sell-offs are going to affect Twitter stock far more than any retail investor thinking they're seeing a good deal", "score": 1, "replies": [{"body": "Even if he does dump more, it won't be made public until my contract has expired. Valid point though.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "OP - I hope you realize TSLA earnings are due on Jan 25. Major reason why I did Jan/20/23 instead.", "score": 2, "replies": [{"body": "Naw. I rarely look at earnings anymore. I just focus on Bolinger Bands, VWAP, and RSI. Companies with positive, growing earnings don't tank much more once they're in oversold territory, but to be on the safer side, I chose a smaller than usual delta, just shy of .10", "score": 1, "replies": []}]}, {"body": "Well that didn't age well.", "score": 2, "replies": [{"body": "Told ya. 😘", "score": 2, "replies": [{"body": "🤣", "score": 1, "replies": []}]}, {"body": "Still “ok taking assignment at this level “??\nI’d cut your losses now personally. \n\nAnd this is coming from a guy who sells TSLA puts on a weekly basis.", "score": 1, "replies": [{"body": "I take chances every once in a while but this was ridiculous. I believe I rolled it a day later down to 95 when I saw the rate it was declining and then closed it this morning at opening. \n\nI limit my options to 10k per position or less. I spread the risk out among multiple companies. I loss $500 in the trade and sold an AMZN Jan 27 $75 with the freed up capital.", "score": 1, "replies": []}]}]}, {"body": "I have long put ratio spread open on Tesla right now, expiring on January 13th but I'll probably close it before then if it can make me a couple hundred. I have no idea where Tesla is going to go, but as long as it keeps going down I'll keep playing the downside.\n\nMusk sure is making a mess of things, and that's good for us!\n\nEdit: I closed today because $500 is $500.", "score": 1, "replies": [{"body": "And this is why I believe him getting out the spotlight may allow the company to get a little stability.", "score": 1, "replies": []}]}, {"body": "Bad call. TSLA is going to miss Q4 earnings and tank below $100. \nComing from a huge Tesla bull. Lost millions cause of Elon and 2022. \nAbort.", "score": 1, "replies": [{"body": "RemindMe! 1 month", "score": 2, "replies": [{"body": "I will be messaging you in 1 month on [**2023-01-22 06:22:31 UTC**](http://www.wolframalpha.com/input/?i=2023-01-22%2006:22:31%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/thetagang/comments/zqql1j/first_tesla_contract/j17kjmi/?context=3)\n\n[**1 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fthetagang%2Fcomments%2Fzqql1j%2Ffirst_tesla_contract%2Fj17kjmi%2F%5D%0A%0ARemindMe%21%202023-01-22%2006%3A22%3A31%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20zqql1j)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "😐", "score": 1, "replies": [{"body": "You asked. I told. Hope for both of us that I’m wrong. But they are missing P&D the question will be how are their margins. But with all the price cuts in China, the margins will be down which WS will say is bad and the stock will get at least a 10% haircut.", "score": 2, "replies": [{"body": "Your take on it is definitely appreciated", "score": 1, "replies": []}, {"body": "Do u see Tesla bouncing back next year at all? Or just a strong likelihood of further decline?", "score": 1, "replies": [{"body": "Q3&Q4 2023 is when I’ll go hard with the calls/leaps. With the US tax credit and assuming jpow doesn’t cause a full blown recession. I think things will be on the up and up again.", "score": 1, "replies": [{"body": "Thx", "score": 1, "replies": []}]}]}]}]}, {"body": "sheeeeeeeeeeeeit", "score": 1, "replies": []}]}, {"body": "I bought an OTM put earlier today. But then again I’m holding AMZN at 130, so maybe I’m stupid.", "score": 1, "replies": [{"body": "Tesla's so squirrelly, it could go either way", "score": 2, "replies": []}]}, {"body": "How much premium did you collect on that 27 jan 23 100 put?", "score": 1, "replies": [{"body": "$1.45. Had I waited til close, it would have been closer to $2.00, though I likely would have opted for a lower strike over the additional funds.\n\nEdit: $2.32, smh", "score": 2, "replies": []}]}, {"body": ">I sold Jan 27 $100 puts, and would be okay taking assignment at these levels.\n\nEasy to say this at $140. Time will tell if you still have the same view at $80.", "score": 1, "replies": [{"body": "I'll roll those strikes to the ground", "score": 1, "replies": []}]}, {"body": "Might be sub $100 by tomorrow at this rate :)", "score": 1, "replies": [{"body": "One would think, sheesh.", "score": 1, "replies": []}]}, {"body": "Hey, at least those Jan DTE premiums on $100 are worth 4%-5% per risk now, that’s a win right? 😰", "score": 1, "replies": [{"body": "Uhhhhhhh", "score": 1, "replies": []}]}]}
{"title": "Ready to capitulate", "selftext": "I bought TSLA at $175 and it seems there's not bottom in sight. Heavily considering capitulating and taking the loss. \n\n&#x200B;\n\nWhat do you think? These Twitter headlines just get worse and worse", "id": "zquop6", "created_utc": 1671558425.0, "score": 8, "upvote_ratio": 0.6, "num_comments": 99, "comments": [{"body": "Never ask for investment advice in a group full of hopeful investors in that same stock. No one in here is gonna say \"yea, this stock is never gonna go up again, that's why I'm so passionate about it\". Downvote me to hell, but have some damn self insight.", "score": 28, "replies": [{"body": "Done 🤣", "score": 3, "replies": []}]}, {"body": "[deleted]", "score": 15, "replies": [{"body": "Greedy and eat a falling knife", "score": 2, "replies": [{"body": "Tesla isn't a falling knife. The fundamentals are amazing", "score": 2, "replies": [{"body": "OK. Sell stonk", "score": 1, "replies": []}, {"body": "tesla is a falling knife", "score": 1, "replies": [{"body": "You commented this in about January. Since then tesla is up atleast 30% more if you bought closer to 100 like I did", "score": 1, "replies": []}]}]}, {"body": "You commented this in late December early Jan since then tesla is up atleast 30%. More if you bought closer to 100 like I did", "score": 1, "replies": []}]}]}, {"body": "What kind of mindset is \"it is down, so I should sell\"?  Unless you need the money, hold for the next 1-2 years at least.", "score": 33, "replies": [{"body": "This one ☝️ gets it!", "score": 3, "replies": []}, {"body": "the mindset is not risk further loss and cut the clear loser. Bought PYPL above 200 and sold at 100 earlier this year. dont want to go through that again", "score": -7, "replies": [{"body": "Then stop selling when it’s down.", "score": 14, "replies": []}, {"body": "Consider passive investing.  You don't have to outsmart the market.", "score": 4, "replies": [{"body": "Passive investing on ETF that contains TSLA is the way to go, especially in a bear market", "score": 1, "replies": []}]}, {"body": "See that your getting a lot of down votes but Risk mitigation is key.", "score": -1, "replies": []}]}, {"body": "the smart one - why no suggest they sell today and buy in a year - thing may go under", "score": -6, "replies": [{"body": "Selling now is accepting a loss.  Buying later is guesswork when the drop will end.  Smarter to do nothing.\n\nAnd no doubt Tesla is not going under.  Check Tesla's revenue reports and their vehicle production doubling every year.  Don't judge where a company is going upon community perception alone.", "score": 14, "replies": [{"body": "This is correct.  The fundamentals look better than they ever have.  Judging my the action in share price, one would never guess this.", "score": 3, "replies": [{"body": "Because the share price has priced in the fundamentals 100 times over already. The production of teslas can double every year for 5+ more years and the stock would still only be worth what it is right now if the companies sees market beating growth for ages after that.\n\nRemember that TSLA is a stock that is priced way way above its current output, it’s possible for the stock to go down while fundamentals continue to increase, it simply requires belief in the massive future of TSLA to decrease", "score": 0, "replies": [{"body": "People here just won't accept this no matter what you say. The price is based on best best case scenario over the next 5 years. There will be a recession for at least 5 of those and who the fck is going to buy a car with no dealer network and the reason for selling direct to the consumer is to circumvent consumer protection law. This is the Musktown massacre but they will still drink the kool-aid. Down vote away kind regards", "score": 1, "replies": [{"body": "Selling direct to customers is more efficient.  Why have a middle man.  And, how is the consumer being hurt by this?  The cars have a multi year warranty.", "score": 2, "replies": [{"body": "Ok I take back the direct to consumer point. It would be nice if they had a dealer network to service their cars.", "score": 1, "replies": []}]}]}]}]}, {"body": "also as u seem to like numbers - It was worth 30$ a share in 2020 with post split adjustment. Honda icurently 23$. For those who love to say Tesla is more than anautomaker, the same can be said for honda but at the end of the day ubought shares in a car manufacturer. If people don't buy his cars therewill be no more Tesla. Simple. Target price of 15 bucks more likely thanever and yes the equity value is 41 bill but the CEO just sold 40 billof options.madness. BTW honda s same value is 80 bill.", "score": -2, "replies": [{"body": "Tesla maintained years of doubling production:\n\n[https://insideevs.com/news/613845/tesla-production-deliveries-2022q3/](https://insideevs.com/news/613845/tesla-production-deliveries-2022q3/)\n\nWe will know with Q4 numbers", "score": 2, "replies": [{"body": "Doubling small numbers is (relatively) easy but to think this kind of projection will continue is madness. Most of the world doesn't live in the US and they don't buy electric cars and if they do it's a cheaper model from a different manufacture that doesn't treat it's customers like scum and have golum as its ceo", "score": 1, "replies": [{"body": "Disagree that Tesla can't continue doubling.  3,200,000 electric cars delivered isn't small in my view.  Increasing production higher involves producing new factories which Tesla is doing and solving supply chain issues which the industry sees Tesla in a leading position to continue doing.\n\nAgree, your point that the doubling of demand will stop at some point.  This involves eating the market share of other manufacturers.  This is likley in my opinion given Tesla's better than industry production cost efficiency.", "score": 1, "replies": []}]}]}, {"body": ">If people don't buy his cars therewill be no more Tesla\n\noh boy", "score": 1, "replies": []}]}, {"body": "holding now is denial", "score": -5, "replies": [{"body": "If you really need the money, then you gotta do what you gotta do.  if you don't need the money, don't buy when something is down -- unless you are convinced it is not coming back up.", "score": 2, "replies": []}, {"body": "wow reality really hurts", "score": 2, "replies": []}]}]}]}, {"body": "if you have too much money just donate them to wiki, going through a great bear market with holding growth stock, complete nonsense", "score": 1, "replies": []}, {"body": "The kind that you use to reposition yourself.\nIf he had better investments in sight that they believe would outperform Tesla in the next 1-2 years.", "score": 1, "replies": []}]}, {"body": "Just dont buy stocks for some time. It is a bear market. All stocks will go down further in next 3-6 months in my opinion. Tesla will recover to 250-400 within few years. So just hold and dont buy for now.", "score": 7, "replies": [{"body": "Or it will never recover. It will correct and adjust to a realistic value, which is way lower than today's price.", "score": -3, "replies": [{"body": "It will. Fsd, Teslabot, semis, cybertruck, new factories will make this company expensive as Aapl + Msft one day.", "score": 7, "replies": [{"body": ">Teslabot, semis, cybertruck, new factories\n\nNone of these things are happening.", "score": -1, "replies": [{"body": "They just announced a new gigafactory in Mexico...Semis were just delivered to Pepsi at a huge Tesla Delivery Event, you must've been asleep, PepsiCo has tesla semis on the road right now.", "score": 8, "replies": []}, {"body": "it’s okay to live under a rock", "score": 3, "replies": []}]}, {"body": "Very hopeful, maybe if elon leaves the company and its taken over by people who know what they are doing that could happen", "score": 1, "replies": []}]}]}]}, {"body": "Dude you are not the only one holding a bag. Do not sell. Hold it and forget it. I say give it a year. Its gonna go lower but has a high chance of coming back up like a rocket. People are on the fence because the market is bleeding. Unless you were in for the quick bucks then sucks to be you but if you are an investor who believes in what they hold then screw the market keep going.:D", "score": 11, "replies": [{"body": "Tesla is now an electrical utility in Texas. They keep expanding in other areas not just cars and semis they got insurance and tons of other stuff coming", "score": 9, "replies": []}, {"body": "The market is not bleeding today. It is TSLA.", "score": 0, "replies": []}, {"body": "They will lose everything if they listen to you haha. “Give it a year” like that will keep it from going to 5 bucks a share", "score": -6, "replies": [{"body": "I hold the bag too and how will it go to 5 bucks. Yes a year because it’s gonna be rough and if you believe in what Tesla has to offer minus Elon go for it. A lot of quick money makers on Reddit and few true investors to buy and hold. Not asking him to take my advise just option and to help him understand where he is at. Folks are selling to tax lost harvest and such. That could be his option to take a break from Tesla too. I know your 5 bucks comment is a joke. Go look at the back orders and what’s to come. I bet you have not really sat in any earning call of any company you have invested to understand what goes on. Best of luck buying a put option at 5 bucks lol.", "score": 3, "replies": []}]}]}, {"body": " Bro I bought at 269 and I'm holding to atleast I make 20%. Sell if you need but you don't lose anything until you sell.", "score": 5, "replies": []}, {"body": "Think about it from the other perspective, if you were looking for a place to buy in. Would you try and catch the proverbial falling knife? Cut your losses, and try to figure out when it hits the bottom, and average back in.", "score": 3, "replies": []}, {"body": "You bought at $175 and your “ready to capitulate”?  Sell now and buy an etf. This ain’t the game for you.", "score": 3, "replies": []}, {"body": "Do it. Sell it all. Don't buy it again. Just keep your money in pokemon cards or some other valuable item.", "score": 3, "replies": []}, {"body": "Buy the fear 😎", "score": 2, "replies": []}, {"body": "wait and buy more when it goes to $100 to bring down your average dollar cost.", "score": 2, "replies": [{"body": "This is the way", "score": 2, "replies": []}]}, {"body": "The people here are gonna tell you to hold obviously especially if they own the stock, not a good place to ask for advice", "score": 2, "replies": []}, {"body": "Elon Musk knows Tesla is his savior , cash cow. He won’t jeopardize it.  Twitter has messed him up bad, and side effects of that is on Tesla . It is a phase, will be over. Tesla is here to stay and rule EV industry. Hold on to your shares.  It may drop more - Buy what you can afford to lock up the $$ and forget for few years.", "score": 2, "replies": []}, {"body": "Sell and make your losses back by buying TSLQ.", "score": 2, "replies": [{"body": "The day you buy >  TSLQ. TSLA will go up and you start loosing on TSLQ.", "score": 2, "replies": []}]}, {"body": "Sell with your feelings at your own peril.", "score": 1, "replies": []}, {"body": "update: im holding on today. hoping for a santa rally caused by shorts covering allowing to take a smaller loss or even more hopefully to break even", "score": 1, "replies": [{"body": "Yeah wait until it bounces to 150s and then front run all the other bag holders like most stock holders have been doing.", "score": 2, "replies": []}]}, {"body": "It’s gonna free fall to well below 100$. Elon Musk is becoming more and more hated everyday. He is dragging Twitter down more and more everyday. And the TSLA shareholders aren’t taking any action. When they do finally take action there will be a short lived free fall again before the company is finally corrected and back on course.", "score": -2, "replies": [{"body": "Don't think his Saudi bosses gonna let it go below a $100. He already got a warning in Qatar to drop Twitter. They even brought Kushner to make things crystal clear during the match", "score": 1, "replies": [{"body": "Source?", "score": 1, "replies": []}, {"body": "On the contrary.   I think his Saudi bosses, Putin and kushner want him at twitter long term where he can drop “twitter files” and recruit the magas and attack the woke virus and democratic elected officials and fauci.  He is making twitter the biggest maga phone on the planet.  That’s worth more to them than tesla ever will be.", "score": 0, "replies": []}, {"body": "You think Elon dropping Twitter and going back to Tesla full time is going to help Tesla? The world sees how inept of a CEO he is. The emperor has no clothes,  and the public and investors learned (or will learn soon) that Tesla’s success was in spite of Elons terrible management and not a cause of that. At what point in any of this Twitter fiasco can any sane individual look at Elon Musk and go “that guy makes good company decisions”. Tesla’s only hope is to oust Elon as the maniac he is, and drop him as soon as they can.", "score": -3, "replies": []}]}, {"body": "What is wrong with people??? Why do they down vote this. The guy has no interest in those who buy his stock or cars.", "score": 0, "replies": []}]}, {"body": "You’ve only lost once you sell butttt\n\n\nIf you sell now you only lose a bit but if you wait Elons taking it to 0", "score": 0, "replies": []}, {"body": "The third largest shareholder is asking for a new CEO. Musk is not going to step down as CEO of tesla. Third largest shareholder is going to sell. Do you want to be the one left holding his bags?", "score": 0, "replies": [{"body": "Who is the third largest holder?", "score": 1, "replies": [{"body": "https://insideevs.com/news/627130/tesla-shareholder-leo-koguan-wants-elon-out/", "score": 1, "replies": [{"body": "Ty awesome person", "score": 1, "replies": []}]}, {"body": "Leo Koguan", "score": 1, "replies": []}]}, {"body": "Guess we won't know for sure until it happens but he also recently said he's committed to putting Billions more into Tesla over the coming years.  He bought 500M worth just about a week ago\n\nhttps://twitter.com/KoguanLeo/status/1603028053717721088?t=4pXCgTVFbAVir_o8TNa2tQ&s=19\n\nhttps://twitter.com/KoguanLeo/status/1603127619628584960?t=SkdzPFby-PPKVsys0PfrTQ&s=19\n\nI think he loves Tesla more than even Elon does, I'd be shocked if he sold", "score": 1, "replies": []}]}, {"body": "Might be the smart thing to do - luxury cars (or any cars really) not ideal during market implosion", "score": -1, "replies": []}, {"body": "But then it hurts everyone else who is holding the stock. So obviously you will hear a “no”", "score": 1, "replies": []}, {"body": "Why not just mimic Elon? He’s selling.", "score": 1, "replies": []}, {"body": "Start writing covered calls out of the money with a 10% to 20% chance of probability of be assigned. It’s the safest way to claw back your money.", "score": 1, "replies": []}, {"body": "I sold at $230. I do believe tsla will go to 100's. So I'm in 90% in cash. I had 2 model Y's and sold one so that I can can swoop in later. Waiting lower real estate and stock  prices. You could be holding the bag for a long time. I do not know your situation. But that's my strategy", "score": 1, "replies": []}, {"body": "Twitter and Tesla death spiral 🌀", "score": 1, "replies": []}, {"body": "If you are a short term investor and believe the stock will continue down and there is more upside in a different stock, then sell and invest in that.\n\nIf you are a short term investor and believe all stocks are continuing down and you need to stay liquid, then sell and hold cash. \n\nIf you are a long term investor, hold.", "score": 1, "replies": []}, {"body": "After being up as much as 200% at one point. I sold all my shares today and took a much, much smaller profit. I sold NFLX to buy more TSLA at one point, now I ate both those losses. I can't afford to take another L in this market. I may buy back in when it bottoms out at $99 or lower", "score": 1, "replies": []}, {"body": "I just bought some today for 142.75. im about to dump it and take the loss.", "score": 1, "replies": []}, {"body": "I (mostly) bailed yesterday at a small loss. Of all the overhyped stocks I’ve bagheld, this is by far one of them. I was yelling “fuck Elon” but really, fuck me. I guess I didn’t learn as much about the perils of meme stonk investing from the last two years of fuckery as I thought", "score": 1, "replies": []}, {"body": "If you sell this week, you can write some of the loss off for 2022 taxes.  Or offset any gains if you trade or collect dividends.  Earnings are on 01/25/23 next year, outside the 30 day wash sale rule.  If you think it's going to keep going down, sell, then wait till earnings to possibly buy back in.  Not investment advice 🤷‍♂️", "score": 1, "replies": []}, {"body": "What? You cannot hold another year? News is Twitter is a distraction. If thats the case. Its down on news. 🤣 I was just thing if averaging down. But already have 300 shares.  I will ho to 500 shares if it dips further. I am confident 350 in less than 12 months.", "score": 1, "replies": []}, {"body": "Are you an investor? Or are you a trader.", "score": 1, "replies": []}, {"body": "Personally I would sell it. Elon has had very bad luck since he moved away from California in November of last year. If something were to happen to him, what do you think will happen to the stock price? He’s made the company about him only. With him gone, the company will look just like Toyota", "score": 1, "replies": []}, {"body": "Why did you buy the stock in the first place?  If those reasons have changed, not a bad reason to sell. If you don’t need the money, hold maybe for next year. Sounds like you have enough of a loss this year that you don’t need to offset more gains.", "score": 1, "replies": []}, {"body": "As a TSLA fan boy, No. However, I took out a loan for 15k at only 10% APR and loaded up on TSLA. And now that it's at like $137 I'm like danm. As a long term investor I love to see the stock go lower so I can buy more, but I planned on dumping some shares around next May to meet some other goals and at the moment that is just not feasible.", "score": 1, "replies": []}, {"body": "Classic buy high / sell low  lmao", "score": 1, "replies": [{"body": "As if $175 is really that high. Sell low would be waiting till 100", "score": 1, "replies": []}]}, {"body": "It blew past the 225 period weekly moving average. \n\nThat is a very bad indicator for the value of the shares.\n\nI predict its fall accelerates tomorrow.", "score": 1, "replies": [{"body": "It's the ghost of christmas future and guess what, you were RIGHT.  Hahaha.", "score": 2, "replies": [{"body": "Wow, I guess I was. Cheers!", "score": 1, "replies": []}]}]}, {"body": "If u need the money, you should not take it into stocks market, esp tsla.\nIf u eant to invest in EV, then Tsla \nIt is not just a EV company.", "score": 1, "replies": []}, {"body": "Its going to hit $50! Sell this shit now and stop being a bag holder. Ignore the advice here. They dont want you to sell and buy lower because they are stuck and cant pull the trigger. Do you think hedge funds just hold money and hope? lol They get out and put their money in stocks that are moving up!!!", "score": 1, "replies": [{"body": "I sold painfully at 137. Now much lower", "score": 1, "replies": []}]}, {"body": "If Elon gets booted I could see the stock getting a boost. But while; Tesla = Elon and Elon = Tesla … it’s gonna go to zero.", "score": 1, "replies": []}, {"body": "[removed]", "score": 1, "replies": [{"body": "\"Hello. Your submission has been removed. Your account must be older than 15 days old and have greater than 0 comment karma to submit a message. -4\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TSLA) if you have any questions or concerns.*", "score": 1, "replies": []}]}]}
