{"title": "Is it wise to invest in a couple of big tech stocks to beat market?", "selftext": "I’m trying to think of portfolio ideas to beat the market long-term and good returns. Would a portfolio of these 4 stocks to buy and hold long-term be a good choice for long-term gains? Looking for good growth….\n\n25% APPLE\n25% MICROSOFT \n25% GOOGLE \n25% NVIDIA \n\nOr would this be too risky in your opinion? Being only 4 stocks and all in the technology sector.", "id": "zmk88p", "created_utc": 1671108319.0, "score": 14, "upvote_ratio": 0.62, "num_comments": 90, "comments": [{"body": "Welcome to r/stocks!\n\nFor stock recommendations please see our portfolio sticky, sort by hot, it's the first sticky, or see [past portfolio stickies here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3A%22Rate+My+Portfolio%22&restrict_sr=on&sort=new&t=all)\n\nFor beginner advice, brokerage info, book recommendations, even advanced topics and more, please read our [Wiki here.](https://www.reddit.com/r/stocks/wiki/index)\n\nIf you're wondering **why a stock moved** a certain way, check out [Finviz](https://finviz.com/quote.ashx?t=spy) which aggregates the most news for almost every stock, but also see [Reuters](https://www.reuters.com/), and even [Yahoo Finance](https://finance.yahoo.com/).\n\nAlso include *some* [due diligence](https://www.investopedia.com/terms/d/duediligence.asp) to this post or it may be removed if it's low effort.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Tech grew like crazy over the last few years because interest rates were low. They were able to borrow money for near free to put towards r&d and production. Now that interest rates are up, I don’t think these companies have as much room to grow in the near term. Not advice, I’m just a random internet dude.", "score": 68, "replies": [{"body": "While they did grow, they also engaged in massive buybacks there were debt financed. Look at [THIS THREAD](https://www.reddit.com/r/investing/comments/deik5b/more_than_half_of_all_stock_buybacks_are_now/) from 3 Years ago and the top few comments:\n\n>What's the worry? The Fed won't raise interest rates in a recession. The only time interest rates will go up is when the economy is booming, in which case the companies can make the interest rate payments anyway.\n\nWell, that comment aged like milk.\n\nSo, no only was debt used to help growth, it was also used to finance share buybacks which increased shareholder value. Both of these now become much expensive. I completely agree with you, but I'm also adding the extra factor that equity isn't going to increase nearly as much as the past 10 years because buybacks are going to decrease.", "score": 14, "replies": [{"body": "Solid addition. Thank you, I didn’t even consider that aspect tbh. I think anybody that started trading within the last few years is in for a rude awakening if they thought the pat few years were the norm. The market is about to get really boring.", "score": 5, "replies": []}]}]}, {"body": "Just buy QQQM if you want tech stocks", "score": 18, "replies": []}, {"body": "I agree, people say Tech wont grow as fast as before, might be true however I think Google PE19 will grow more than coca cola PE27, tech starting to look fairly valued.", "score": 15, "replies": []}, {"body": "I think GOOGL, AAPL and MSFT will do pretty good. The earnings may not do so well in the next year or two, but the price decline seems to be near a bottom of a U-shaped curve where the price probably will start increasing in a year or so. But try to diversify into a number of industries. The total tech shouldn't be more than 33 percent.", "score": 27, "replies": [{"body": "AAPL has alot of room to fall, hasn't had the same correction so far", "score": 9, "replies": [{"body": "This is what is going to break the camel’s back. Apple is basically floating the market.", "score": 2, "replies": []}]}, {"body": "*will doo pretty* ***well.***", "score": 0, "replies": []}]}, {"body": "If you can reliably beat the market over any length of time you are the smartest person on reddit.", "score": 9, "replies": []}, {"body": "Honestly, NO ONE knows. But, like the overall sentiment in this thread, AAPL, MSFT and GOOGLE are going to be fine over the next 5-10 years. Are they going to double every 2-3 years? No. But, they have loads of cash and they have created ecosystems resulting in continuous income. Folks comparing these to Cisco, IBM etc in 2000s don't understand.\n\nI think we are at a point where a meaningful portfolio would be one where there is a good tech presence and a whole lot of non-tech bluechips.", "score": 8, "replies": []}, {"body": "I like MSFT, GOOGL, VOO and SCHD all in 25% amounts. Get massive exposure to two companies that I think are the future and 50% of my portfolio is index or safer dividend investments.", "score": 7, "replies": []}, {"body": "Sure like my friend invested in ibm, Cisco,  gm,Intel  back in early 2000s...also kodak", "score": 20, "replies": []}, {"body": ">25% APPLE 25% MICROSOFT 25% GOOGLE 25% NVIDIA\n\nThese were the winners of the last decade and are unlikely to be the winners of the next. However Apple, Microsoft and Google would probably do fine. Chances are high however that growth relatively quickly stalls here. The pandemic pulled growth forward and we are already seeing a slowdown in that growth now. \n\nJust stay away from Nvidia at current prices. Operating Earnings down 77% last quarter, QoQ Growth in Datacenters is stalling and it trades at 3x historic multiple when they had good 15% growth.", "score": 10, "replies": [{"body": "I agree mostly, but I'd not lump Nvidia in with the other tech giants of the past decade. Nvidia's growth spurt started relatively recently compared to the other tech giants and imo has plenty of room for future growth, though I don't expect the next few quarters to be great ones. I personally am looking to add to my position but won't start averaging in until $130 at the highest.", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "NVDA growth was crazy when you have individuals buying 20-50x the typical customer and corps buying thousands at a time; without it, it’s going to mirror AMD’s trajectory.", "score": 3, "replies": []}]}, {"body": "The fact that the company did not tell you an estimate on how many are used für crypto is enough to be sceptical", "score": 2, "replies": []}]}]}, {"body": "Since it’s a hold term hold I would say yes. These companies aren’t going anywhere and are trading heavily discounted right now. Load up", "score": 4, "replies": []}, {"body": "No. There's a good chance that we are seeing a regime change - people continuing to rely on \"what worked over the last decade\" may be disappointed.\n\nPeople should have a reasonable % of their portolio in tech, not have a tech fund. It's not no tech, but maybe you have 20-25% of your portfolio in tech (S and P 500 is about 24% tech), not 100% or anything remotely near that. Additionally, I think even with technology there has to be a little bit of a move away from the giant \"household names\"; some tech exposure should be finding medium sized tech names that are working/can work in this environment. \n\nI don't own it but look at Aspen Technology, which is up this year because of what it focuses on - look at the industries on its website who are the customers and look what industries have done better this year. The stock has also done pretty well over the last couple decades. You can have some major household names as tech exposure, but branch out a bit. Doesn't have to be that, but there are some things in tech that are working. \n\nThe era of easy monetary policy that powered a lot of tech gains over the last decade isn't coming back for a while, which Powell restated yesterday. Not something I'm thrilled with but if that's the case people have to adapt. I'd love for this to be a period where we get through it, the pivot happens and the growth party starts again but the longer this goes on the more unrealistic that feels/I don't see the conditions coming together for that happening. Feels like best case is the eventual recovery looks more 2002 post dot com.\n\nWorth a read - \n\nhttps://citywire.com/pro-buyer/news/nothing-is-always-good-rajiv-jain-s-warning-for-growth-pms/a2391677 (\"‘Nothing is always good’: Rajiv Jain’s warning for growth PMs\")", "score": 12, "replies": [{"body": "Thx. I like to hear investment wisdom and seek good advise. I heard a range in the tech sector of that 20-25% you are talking about.\n\nIt’s just crazy. The past returns on some of those tech stocks are pretty good, like 20-28% yearly returns over a long period of time.", "score": 3, "replies": []}, {"body": "Thx for article and thoughtful reply.", "score": 3, "replies": []}]}, {"body": "Invest in a tech fund instead", "score": 4, "replies": [{"body": "If it was me I wouldn’t go with a tech only fund. Sector risk. What if tech underperforms for a long period of time….again. VUG is my growth fund of choice. Lots of tech but not ONLY tech.", "score": 2, "replies": [{"body": "You are right in that respect.", "score": 2, "replies": []}]}]}, {"body": "Have you ran a test to see how correlated they are? Since these are all high percentage holdings in a bunch of ETFs and similar categories, they are probably highly correlated with each other.", "score": 5, "replies": []}, {"body": "Rising interest rates are kryptonite for tech stocks. Powell is cranking up the rate’s every 6 weeks like clockwork. You’ll get better entries later", "score": 4, "replies": []}, {"body": "It’s always interesting to see how a long term steady performer like Texas Instruments TXN never enters the tech stocks discussion.", "score": 4, "replies": []}, {"body": "I don’t like that big tech is still trading at a ridiculous multiple of future growth. I’m thinking mega cap consumer staples is the safe place for a while. \nNames like: \nproctor and gamble- PG\nJohnson and Johnson -JNJ\nColgate Palmolive - CL\nkimberly clark - KMB", "score": 6, "replies": []}, {"body": "Dont buy nvda at these levels man…… rest: buy chunks over the next couple of months until you hit 25%", "score": 8, "replies": [{"body": "Thanks", "score": 1, "replies": []}]}, {"body": "Don’t go all in on this trade now, timing is everything. Review this trade and compare prices in 1-2 months vs now. Then reconsider.", "score": 3, "replies": []}, {"body": "Goggle is the only one undervalued at the moment. I honestly don’t mind this strategy, but you got to get in at a better price for the other 3.", "score": 3, "replies": []}, {"body": "MSFT and Amazon are my two picks personally. NVDA was my 2015 pick, but wouldn't hurt to pick up some today. Then some goog for funs.", "score": 4, "replies": []}, {"body": "Don't follow yesterday's return,  big tech had thier day in the sun.  They may have it again but not now.", "score": 7, "replies": [{"body": "Your iPhone isn't going anywhere, e-commerce isn't going anywhere. Big tech's boom may be over but to say \"their day in the sun\" is over discounts fact that they are all good long-term investments.", "score": 19, "replies": []}, {"body": "Thx. Some don’t see it as a long term investment strategy despite how well its done. I know tech is more volatile in downturns, but returns have looked good. But the future could prove otherwise like you touched on.", "score": 3, "replies": [{"body": "The thing is that as much as we try we can’t predict the future. If you bought the 4 biggest tech companies in 2000 the next 10 years would have been grim. If you bought in 1990 or 2010 then the 10 years after that would have been excellent. \n\nIf you go all in on big tech, yeah you are more likely to beat the market than a diversified fund. But you are also more likely to do much worse than the market. \n\nIf you are committed to going for big tech then I would still not go all in. You could for example put 50% into big tech and then the rest into VTI and VXUS. (Note, I still think this would be way too heavy in tech, but you would at least be somewhat diversified and protected).", "score": 5, "replies": [{"body": "Thx! I heard the advice of no more than 25% into one sector. That could be wise when applied to tech.", "score": 1, "replies": []}]}]}, {"body": "I'm sure google will survive with 250 billion in cash", "score": 2, "replies": [{"body": "surviving isn't the same as beating the market", "score": 2, "replies": [{"body": "Fair point. In a high interest environment it'll be tougher for startups to compete though with companies that have cash reserves", "score": 3, "replies": []}]}]}]}, {"body": "Those four stocks are highly correlated so there’s no diversification there. you’re adding risk without gaining much more upside than you would investing in qqq.", "score": 3, "replies": []}, {"body": "Don’t invest in anything at the moment unless your prepared to hold for 5+yes and fine with short term losses", "score": 2, "replies": []}, {"body": "In general, you want to diversify to eliminate as much firm specific, and industry specific risk, you are putting all your eggs in one basket with this strategy, sorry to say =/", "score": 2, "replies": []}, {"body": "Definitely, but buy now, and make sure you're always trading at the top of the channel. That'll beat the market.", "score": 2, "replies": []}, {"body": "Tech will be in free fall for a while.  This is not the ideal time to buy in.", "score": 2, "replies": []}, {"body": "I just did that today", "score": 2, "replies": []}, {"body": "Yes, but also invest into me and give me $5 please.", "score": 2, "replies": []}, {"body": "you can just buy qqq too.  I think qqq is around 24 pe right now.  make sure you dont buy it at too high pe.", "score": 2, "replies": []}, {"body": "I love the first three.  I do not the fourth, NVDA.    I would consider TSMC or maybe ASML.\n\nI would expect Apple and Google to significantly beat the market long term.   Also MSFT but it is still a bit expensive, IMO.", "score": 2, "replies": []}, {"body": "May be 2 will shine and others will not. Net result is zero gain.\n\nSuggest a more diversified portfolio. 2023 is not the year to puts $ into tech stocks esp recession is still being debated daily.", "score": 2, "replies": []}, {"body": "I bought Disney and BAC", "score": 4, "replies": []}, {"body": "nvda chinese money manipulation", "score": 2, "replies": []}, {"body": "If you have a long time horizon you definitely (most likely) make money at these levels. How long before they outperform? I think within 3 years. Maybe sooner. There is never a guarantee on any individual stock or any sector but those companies are strong and provide great products. I don't think their competitors are that close.", "score": 3, "replies": []}, {"body": "if you did that at the beginning of the year you'd be down like 60%. Next year will be massive layoffs, there's much more room to fall.", "score": 2, "replies": []}, {"body": "Tech stocks can flatline for long periods of time and I mean years.  Go back 20 years and look how long Microsoft was flat and even Amazon.   A lot of stock strategists believe Tech is not going to lead the market in returns for the next decade.   I tend to agree because realistically what are their growth rates for the next 10 years?   Will it be higher or lower than the last 10 years?  If you think lower than don't invest it these.  If you think higher then buy these and hold for the next decade. \n\n Myself, I am underweight technology because I don't see how they are going to replicate their past growth.", "score": 2, "replies": [{"body": "Yet growth in more and more industries is dependent on tech now", "score": 5, "replies": [{"body": "Exactly. I don't really understand their argument.", "score": 2, "replies": []}, {"body": "There is always growth but what will the rate going forward compared to past growth rates?   I think the mega tech stocks have seen their highest growth rates and I don't think those rates will be replicated in the future.   What is the next big thing to drive growth?", "score": 2, "replies": []}]}, {"body": "Definitely good points. Usual axiom in after a bear market, the leaders of the next Bull market will be different.  Trouble is right now, no sector emerging as a new leader", "score": 1, "replies": []}]}, {"body": "We’re in stagflation and the next leap in productivity is unironically AI robots, aggressive solar expansion. So if I wanted a risk portfolio I’d choose the leaders in those two.", "score": 1, "replies": [{"body": "Very wise words, indeed!", "score": 2, "replies": []}, {"body": "It's worth distinguishing between AI doing useful, but boring things and AI doing flashy things.", "score": 2, "replies": [{"body": "Pretty sure ai robots can already essentially replace fast food workers, it just needs to be done at scale", "score": 1, "replies": [{"body": "This is happening as we speak.\n\nWhite Castle recently bought robots for 100 of it's restaurant locations.\n\nMore and more restaurants are testing robots to handle everything from taking orders, to food preparation, and delivery of that food to customers. \n\nImho, AI expansion is still in its infancy. \n\nI believe that within a decade or so, many companies won't have the same labor shortage issues that we have today. Plus, with fewer employees to deal with, the companies will have lower overall wage pressures, a huge reduction in massive healthcare costs for employees, and reductions in various other employee related benefits and associated costs. \n\nWhether we like it or not, it just makes good business sense!", "score": 2, "replies": []}]}]}, {"body": "This is so dumb", "score": 0, "replies": []}]}, {"body": "You could buy a 2x leveraged QQQ safely... a 3x is a little more risky, but in a down market, you should do quite well 2-4 years", "score": 1, "replies": []}, {"body": "TQQQ beat market big in both direction", "score": 1, "replies": []}, {"body": "I would be careful assuming the future will resemble the past.  Big tech was over owned and could be on sale for years.  For example, look at the Swiss National Bank.  They still own hundreds of B worth of big US tech stocks.  Unwinding that position will be a slow and painful process.", "score": 1, "replies": []}, {"body": "Depends on your timeframe. Could these 4 stocks beat the market over a 1 month holding period? Sure.\n\nCan these 4 beat the market over the next 10 years? Almost certainly not", "score": 1, "replies": []}, {"body": "google is a fascist company. otherwise you might check FANG ticker which is 10 tech x 10%", "score": -2, "replies": [{"body": "> google is a fascist company.\n\nHow so?", "score": 2, "replies": [{"body": "you have to have your experiences to understand.\n\nthis year i published some book, i was promoting it via the google ad system, they offered me the keywords, then in 24 hours they said they stopped the campaing that this topic is not allowed in some country.\n\nthen they change the reason of the problem and marked me as some cheater or what, banned me without any warning for life from the ad service, banned me from google books as well.\n\nto understand the context, amazon books and apple and also some canadian store published my book without any problems.\n\nbut google gave me two lifetime bans from two services without any warning. (and even offered me the keywords in first place - so they offer you the keywords, you start the campaing and then they allege you that you are a cheater)\n\nso fuk them and i ended with them. started using the Bing since that day.\n\nof course all corporations are BS like Facebook, Microsoft, Google all same bastards, but Google controls 90% of the services = it is way more dangerous than Putin and China together.\n\nthey can clean you off the surface of the Earth without any problems.", "score": 1, "replies": [{"body": "Very heavy user of Google and never had a problem.    \n\nBut if you told me 25 years ago a single company was going to control 90% of the worlds information flow  I would have told you no way.   \n\nIt is insane the power that Google posses but I have not seen them abuse it at this point.    \n\nIt is also why their ownership is so critical.    Also why any kind of Google union is a very bad idea.\n\nBTW, IMO, nobody else is anywhere close to the power that Google posses.    I am not even sure who would be #2.  I guess Meta maybe?  But they are on the decline.", "score": 1, "replies": [{"body": "yes you had no problem because they decided you are not a problem.\n\nyes it is not healthy to have such big market share.", "score": 2, "replies": [{"body": "I personally trust Google.   But I agree it is a bit insane for a single company to be as powerful as Google.\n\nI do not believe there has ever been a more powerful company in history and I question if there will anyone nearly as powerful as Google in the next couple of decades.\n\nBut it could be a lot worse.   What if it was a bad company instead of Google?\n\nYou are always going to have concentration.  That was triggered by the Internet and you are not going to get rid of the Internet.\n\nSo I much prefer it being Google over any other company I can think of.\n\nTake Apple compared to Google.   Apple is extremely anticompetitive.   No alternative app store with iOS but Google allows it.  No sideloading but Google allows it.  The big one.  You can use whatever browser you want on Android but not with iOS. Only Safari and skins of Safari (WebKit).", "score": 1, "replies": [{"body": "You know the movie A Space Odyssey from Kubrick as there is the scene as the  laser eye (i think it is called Hal) denies to enter the cosmonaut who is out of the ship. This is Google. If he decides to clear you off, he will do it.\n\nOf course i was a regular \"content\" user of Google as you too. But as I say, one day you may become persona non grata and then you will learn what is it about.", "score": 1, "replies": [{"body": "We are heavy users of Google and NEVER had a problem.  Do not expect to as we do not do illegal stuff.", "score": 1, "replies": [{"body": "i told you that Amazon, Apple and Canadian publisher published my book without any problems. so what is illegal stuff then? Google didn't. But not only they didn't publish the book, they also gave me the lifetime ban without any warning. that says a lot about the company and how they treat  individuals.", "score": 1, "replies": []}]}]}, {"body": "also Google quite damaged the free speech on Youtube by installing various filters etc, deleting the videos which he doesn't like etc", "score": 1, "replies": [{"body": "I have ZERO issue with YouTube taking down hate speech garbage and the cr*p around Covid and things like Alex Jones.\n\nI am so glad to see Google on top of this.", "score": 1, "replies": [{"body": "so you believe in one official truth. but it fundamentally undermines the human liberty of speech and decision etc, shortly human rights. you let some private company to decide what to do or not.\n\ni want to see some alternative videos about covid or whatever and i will myself decide if these videos are BS or not. not mentioning that very often they took down some videos or channels just casually in name of one right covid truth etc.\n\npeople are spreading the vides anyway through another channels, but it shows how not trustworthy the google company is.", "score": 1, "replies": [{"body": "Free speech does not include hate speech.   Plus there are other limits.  You can't walk into a crowded movie theater and yell fire.\n\nI like how Google is doing things.\n\nIt is vitale to a democracy that private companies are free to manage their platforms.", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}
