{"title": "What are examples of recession proof industries?", "selftext": "I'm fairly new to stocks, and the title kinda explains it all. I've seen people commenting on other posts saying things like \"gold has been shooting up because it's recession proof\" and stuff like that, which I don't understand. From what I can tell recession proof would be an industry that fills a basic need of a group that will always have money, like defense or tech (Not something like food because of huge tariffs on that stuff). Am I correct, and if so how would gold fit into that? Thanks!", "id": "cr1giz", "created_utc": 1565930552.0, "score": 8, "upvote_ratio": 0.84, "num_comments": 23, "comments": [{"body": "Alcohol is a good one.", "score": 16, "replies": [{"body": "Sales still drop with disposable income, but not as much as other industries. Most consumers will look to downgrade to a lower tier product to get their fix - but people still need their vices.\n\nI wonder if tebaco is the same", "score": 4, "replies": [{"body": "There are only two industries with 100 years of annual nonstop global growth. Tobacco and alcohol", "score": 4, "replies": []}]}]}, {"body": "Industries that sell Necessities..", "score": 10, "replies": []}, {"body": "Funeral parlors are a recession proof industry.", "score": 7, "replies": []}, {"body": "COKE, MCD", "score": 3, "replies": []}, {"body": "Waste management , recycling , alcohol ,  canabis?", "score": 5, "replies": [{"body": "Def not weed", "score": 2, "replies": []}]}, {"body": "Repo men.", "score": 2, "replies": []}, {"body": "Old reliable dividend-earning consumer staples stocks. Companies that make the major brands of cheap mass produced American food. If you’re on a budget, you’re still going to buy food for your family, and maybe even grocery shop more so you don’t eat out as much.", "score": 2, "replies": [{"body": " do not buy Kraft-Heinz", "score": 3, "replies": []}]}, {"body": ">In economics, an **inferior good** is a good whose demand decreases when consumer income rises (or demand increases when consumer income decreases), unlike normal goods, for which the opposite is observed\n\n[https://en.wikipedia.org/wiki/Inferior\\_good](https://en.wikipedia.org/wiki/Inferior_good)", "score": 2, "replies": [{"body": "**Inferior good**\n\nIn economics, an inferior good is a good whose demand decreases when consumer income rises (or demand increases when consumer income decreases), unlike normal goods, for which the opposite is observed. Normal goods are those goods for which the demand rises as consumer income rises.\n\n \n\nThis would be the opposite of a superior good, one that is often associated with wealth and the wealthy, whereas an inferior good is associated with lower socio-economic groups.\n\nInferiority, in this sense, is an observable fact relating to affordability rather than a statement about the quality of the good.\n\n***\n\n^[ [^PM](https://www.reddit.com/message/compose?to=kittens_from_space) ^| [^Exclude ^me](https://reddit.com/message/compose?to=WikiTextBot&message=Excludeme&subject=Excludeme) ^| [^Exclude ^from ^subreddit](https://np.reddit.com/r/stocks/about/banned) ^| [^FAQ ^/ ^Information](https://np.reddit.com/r/WikiTextBot/wiki/index) ^| [^Source](https://github.com/kittenswolf/WikiTextBot)   ^]\n^Downvote ^to ^remove ^| ^v0.28", "score": 1, "replies": []}]}, {"body": "Maybe I'm remembering this wrong but entertainment (music, video games, movies) does pretty well under recession because it's an affordable luxury that people can do (instead of more expensive things like going on vacation, buying cars etc..)", "score": 2, "replies": []}, {"body": "Call centers", "score": 1, "replies": []}, {"body": "I like dividend paying Specialized REITs like healthcare or even ones routed on things like grocery stores. No matter what people need to eat and need medical attention. I have also significantly increased my position in gold over the past several months", "score": 1, "replies": []}, {"body": "You are looking at non-cyclical stock. Household good, health services, stuff that people will have to buy no matter what happen.   \nOtherwise, gold holds well against inflation more than recession. That is true for most precious metal commodities. People are stacking gold because it usually holds super well in big market volatility (doesn't mean you will do money). If you build a defensive portfolio, short term government bond might not be a bad idea. They don't give much BUT, if the market goes sour, you will have a lot of liquid asset to use and buy big cheap stock.", "score": 1, "replies": []}, {"body": "necessities as others have said.\n\ni personally wouldn't invest in gold. i'll let warren buffett explain why: \"The major asset in this category is gold, currently a huge favorite of investors who fear almost all other assets, especially paper money (of whose value, as noted, they are right to be fearful). Gold, however, has two significant shortcomings, being neither of much use nor procreative. True, gold has some industrial and decorative utility, but the demand for these purposes is both limited and incapable of soaking up new production. Meanwhile, if you own one ounce of gold for an eternity, you will still own one ounce at its end.\"\n\nhere's a relevant video:  [https://www.youtube.com/watch?v=Qm0jktMIYlk](https://www.youtube.com/watch?v=Qm0jktMIYlk)", "score": 1, "replies": []}, {"body": "Prostitution", "score": 1, "replies": [{"body": "I know you are probably joking, but that prostitution is definitely a luxury good. It doesn't fare well in recession.", "score": 7, "replies": [{"body": "Citation?\n\njust kidding ;).", "score": 3, "replies": []}, {"body": "username checks out.", "score": 1, "replies": []}]}]}]}
{"title": "Say you were walking down the street and found a $100 bill...", "selftext": "It's not much money, especially in the realm of stocks, but it's something. Do you buy a fraction of a behemoth like Google, Boeing, or Amazon? Gamble on Tesla's future? Go biotech with Crisper or some lesser-known start-up? Bet on the cannabis industry with Canopy or Aurora? Or, do you simply go get a really nice steak dinner, have a few drinks, and pocket the change?", "id": "cr8yex", "created_utc": 1565973707.0, "score": 2, "upvote_ratio": 0.57, "num_comments": 27, "comments": [{"body": "Free hundo? I do blow w a hooker", "score": 13, "replies": [{"body": "For that price, the hooker will have a penis.", "score": 1, "replies": []}, {"body": "You like cheap hookers?", "score": 1, "replies": [{"body": "Who doesnt?", "score": 3, "replies": [{"body": "Can we get a 2 for 1 deal?", "score": 2, "replies": []}]}]}]}, {"body": "Throw it in an emergency fund. Whenever you have spare change throw it in that account and put it in a high yield savings account. It will come in handy if you get a flat tire or incur any other misc expense.\n\nSorry to say but you're not getting far with $100 in the market, and you will almost certainly lose it speculating.", "score": 5, "replies": [{"body": "I agree. I was just bored, had a second, and wanted to throw in a hypothetical to the masses. However, even $100 in something like Amazon or Boeing has the likelihood to give a better return than most savings accounts if held over several years. It's like hiding $100 from yourself and then discovering you have $250 years later.", "score": 3, "replies": []}]}, {"body": "Steak or gamble on options. Not worth to invest with 100", "score": 5, "replies": []}, {"body": "Buy as many MU $90 calls as possible", "score": 3, "replies": []}, {"body": "The $100 must not be real if it's just laying on the ground (efficient markets hypothesis).", "score": 2, "replies": []}, {"body": "🤓", "score": 1, "replies": []}, {"body": "Why", "score": 1, "replies": [{"body": "Why not?", "score": 1, "replies": [{"body": "Why a so small amount that it won't make a difference", "score": 1, "replies": [{"body": "Right. It won't make any real retire money, but it's a possible store of wealth like (or better than) gold if you choose something like Google, Boeing or Amazon.\n\nAs I said to another Redditor, it's like hiding $100 from yourself today and discovering ten years later you have $200 or so.", "score": 5, "replies": [{"body": "Why are you talking about fractions of a stock instead of % gained by each.\n\nSaying \"oh I'd invest in 11/279ths a share of google, amazon, and Chipotle\" instead of: I would invest in these 3 stocks because I believe they will go up the most/most likely.\n\nOr even the question posted just a few hours ago \"what would you invest in if I gave you $1,000 right now.\" $100 is an arbitrarily low amount of money to invest. Even $1,000.\n\nYou can't diversify whatsoever and would be better off in a fund or etf.", "score": -2, "replies": [{"body": "You've missed the point of the OP entirely.", "score": -1, "replies": [{"body": "Your time is better spent not wasted on hypotheticals.", "score": -1, "replies": [{"body": "Same advice you'd give the Wright Brothers? C'mon, Redditor, all of this is hypotheticals.", "score": 4, "replies": []}]}]}]}]}]}]}]}, {"body": "Put in my emergency fund, or add it to my Round Investing account.", "score": 1, "replies": [{"body": "Round Investing account?", "score": 1, "replies": [{"body": "I actively mange my IRA and passively invest in a government retirement account (TSA) and have a taxable account with Round. Answer some questions, they come up with a blend, and the fees are low. My biggest beef with the financial industry in general, and one of the reasons I manage my own IRA, is that financial advisors and fund managers get paid whether they're making you money or not. One of the things I like about Round is that they don't charge a fee if you're down money.\n\nI opened my Round account right before the last fed announcement a couple weeks ago. Since then it's down <1%, so not bad at all.\n\nNot sure what else to say without making this sound like spam. [Here's a link](https://www.investround.com/); check it out for yourself.", "score": 2, "replies": []}]}]}, {"body": "Now I'm fairly new to the game myself, so I dont have an IRA or any fancy savings etc. I'm just rolling as much as I can at 22 y/o in to my Robinhood and TD account for stocks. \n\nMy personal buys with \"100\" bucks would probably be energy stocks, most likely with dividends, but not necessarily. \n\nI really like to rep ENPH, TERP, XEL, and EBR. SPWR is also an option, though I haven't bought them yet.\n\nVRAY might not be a terrible one since you aren't gambling that much money.\n\nI'd also consider cannabis stocks like ACB or APHA because you could buy a ton of them for $100.\n\n\nIf the hypothetical amount was much larger, say, in excess of 10k to 500k, I would actually consider throwing most if not all of it in to SPHD and leaving it probably dividend reinvesting for 30 years.", "score": 1, "replies": []}, {"body": "I leave it on the ground and keep walking.", "score": -7, "replies": [{"body": "Being an economist and assuming the street is an efficient market, if it was a real $100 bill it would have been picked up already.  So I would ignore it and invest in an index fund.", "score": 2, "replies": []}, {"body": "Baller.", "score": -1, "replies": []}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "crb42c", "created_utc": 1565983214.0, "score": 15, "upvote_ratio": 0.64, "num_comments": 19, "comments": [{"body": "Small correction/clarification:  nextmove said that Tesla (not nextmove) cancelled the order for 85 vehicles when nextmove would not take delivery in 24 hours.\n\nhttps://mobile.twitter.com/nextmove_de/status/1162526062301065218", "score": 12, "replies": []}, {"body": "Why is this getting downvoted?", "score": 8, "replies": [{"body": "Doesn't have the facts straight.", "score": 3, "replies": []}, {"body": "Because this sub can't stand anything negative about tesla", "score": 1, "replies": []}, {"body": "because its a trivial amount of cars and money? and it sounds like they just delivered the cars to other people so...not exactly a huge hit to anything.", "score": -2, "replies": []}]}, {"body": "Well 100 x 50K is 5 million, were they really buying at full retail?   If I was building an EV rental fleet Model 3 is difficult anyway, I mean it isn't something you can just toss someone in and they know how to work it like a Camry.    Not to mention the charging protocol.  \n\n>(Market Chatter news is derived from conversations with market professionals globally. This information is believed to be from reliable sources but may include rumor and speculation. Accuracy is not guaranteed.)\n\nOh, now it makes sense.", "score": 6, "replies": [{"body": "The renting company published a video statement. So the basic facts (100 cars, order cancelled by one side) is true as both parties confirmed that.", "score": 5, "replies": []}]}, {"body": "Lots of European newspapers picked up this story. If everything is true, it's very sad that Tesla (Germany) failed to deliver quality.", "score": 4, "replies": []}, {"body": "This feels so strange. What is the rental company going to do, since they want to offer only EVs. Have they said that? There are basically no other options. Maybe Kona or VW ID3 but those have very long waiting lists. It feels to me like their business was not working out and they wanted an excuse to cancel their big order.", "score": 3, "replies": []}, {"body": "Apologies for high-horse rant, but as a European guy, the quality of all USA cars is rather shit. I frequently travel to California for work, and always get a rental (d’uh, it’s America, you must have a car), and I always take American cars. And yes I know that some of them are built in Mexico or whatever, but I always take American. Usually some muscle since I cannot drive that in Europe. Challenger, Mustang, Camaro, etc. As a side note, of all of the American muscle I by faaaaaaar absolutely love Challenger, SRT if I can get, or RT at least. V8 HEMI, roaaaarr! I digress. I drove Tesla model S at one occasion. And yes, rental cars are a bit beat up and all that, I get it. \n\nBut but but. \n\nI also rent BMWs when I travel to Germany for work. \n\nAnd a beat up rental BMW has build quality and just the feel of it waaaaaay ahead of American cars. \n\nSo, in my opinion, this might be the case here. These guys are used that the cars are simply “built to European standards” so to say. And Teslas might not be in that category. \n\nOk. Rant over.", "score": 3, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Germans probably not as forgiving with workmanship defects.", "score": 4, "replies": [{"body": "[deleted]", "score": 18, "replies": [{"body": "Because the emission fraud was a byproduct of high quality german engineering", "score": 7, "replies": []}, {"body": "One is a customer and an other one is a global company, can’t lump them together", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "The general german population is not forgiving of dieselgate, VW and the politicians they buy obviously are", "score": 4, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Not the people that I know", "score": 1, "replies": [{"body": "But VAG is still selling a lot of cars in Germany, so a very large group of consumers didn't really care that much.  If there was true and widespread outrage, they would've had a lot of trouble selling their cars.", "score": 2, "replies": []}]}]}]}]}]}]}, {"body": "Dieselgate", "score": 1, "replies": []}]}]}, {"body": "Somebody paid to make that a press release?\n\n#AxisOfOil", "score": -4, "replies": [{"body": "Looks legit to me\n\n[https://www.youtube.com/watch?v=boWp5JqqenY&t=8s](https://www.youtube.com/watch?v=boWp5JqqenY&t=8s)", "score": 1, "replies": []}]}]}
{"title": "Banks are Rallying", "selftext": "Recession canceled! Let’s go everyone. Spy’s rising like my wife’s dick in the morning.", "id": "cr7ica", "created_utc": 1565967468.0, "score": 90, "upvote_ratio": 0.96, "num_comments": 24, "comments": [{"body": "Until September 18 when rates are cut\n\nThen banks won’t rally", "score": 49, "replies": [{"body": "Ya they will", "score": -10, "replies": [{"body": "Try again but use your brain this time", "score": 14, "replies": [{"body": "Ok....\nYa they will! Like how your mom goes up on my cock", "score": -11, "replies": [{"body": "In heterosexual encounters, the woman goes DOWN, lol", "score": 10, "replies": [{"body": "Try again, but use your brain this time", "score": -10, "replies": [{"body": "No u", "score": 5, "replies": [{"body": "No you both", "score": 8, "replies": [{"body": "Ur mom gay", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Stop it, you are single.", "score": 16, "replies": []}, {"body": "I may actually hit my 293 call today....", "score": 11, "replies": [{"body": "I have a 292 call that expires Monday. I don’t think me or you is going to hit our goals.", "score": 3, "replies": [{"body": "What about my 289 call and I need to hit 291.78 to break even?", "score": 0, "replies": [{"body": "You might break even", "score": 1, "replies": []}]}]}]}, {"body": "You gotta wife?", "score": 2, "replies": [{"body": "With a dick?", "score": 2, "replies": [{"body": "Her name isn't Bruce its fucking Caitlyn.", "score": 4, "replies": [{"body": "Woman of the year 2015 😂😂", "score": 2, "replies": [{"body": "That shit is CRAZY... what have people come to?", "score": 1, "replies": []}]}]}]}]}, {"body": "Banks always win.", "score": 1, "replies": []}, {"body": "The media wants a recession so bad but they don't know trader's mentalities. Spy to 300 by next week", "score": -11, "replies": [{"body": "tHe mEdiA", "score": 6, "replies": []}, {"body": "So true. It's like before every major recessions the markets were always trading poorly or sideways. never in history did recession follow record stock market rallies.", "score": 1, "replies": [{"body": "Dude, the fucking ELEVATOR is telling me how the economy is going to crash and that I need to panic.", "score": 2, "replies": []}]}]}]}
{"title": "Long Kohl’s, DD inside", "selftext": "Kohl’s Earnings report is coming up 8/20\n\nKohl’s has started returning amazon purchase beginning July 8th\n\nKohl’s brings in more customers because of this\n\nKohl’s marks off up to 50% of their clothing but \nstill equals MSRP and people buy it\n\nKohl’s knows how to make people feel good about “savings”\n\nThis is serious DD though\n\nKohl’s will pop up 10% minimum", "id": "cr7ljc", "created_utc": 1565967864.0, "score": 48, "upvote_ratio": 0.9, "num_comments": 28, "comments": [{"body": "[deleted]", "score": 19, "replies": [{"body": "What was it? I missed it", "score": 3, "replies": []}]}, {"body": "Taking Amazon returns screams desperation, IMAO.", "score": 11, "replies": [{"body": "at least they are screaming \n\nit means they wont roll over and die like kmart/sears/macys/JCP.", "score": 3, "replies": [{"body": "Screaming is not a form of resuscitation.", "score": 3, "replies": [{"body": "But screaming is a strategy", "score": 1, "replies": []}]}]}, {"body": "Yeah, they had poor reports in the last year. This should boost them up, which is why they took this on. I’m pretty sure it’ll be great.", "score": 1, "replies": [{"body": "Post your position then?", "score": 3, "replies": []}, {"body": "Position or ban", "score": 2, "replies": []}]}]}, {"body": "Wow inverse it is boysss", "score": 8, "replies": [{"body": "Multiple posts writing for calls lmao\n\nTime for puts indeed.", "score": 2, "replies": [{"body": "I’m such a pu$$y thou got burned on being to early for a Dropbox put it immediately went down after mine expired worthless. Help me senpai i bet on it going down for early next year!!!", "score": 1, "replies": []}]}]}, {"body": "Yeah no I’m buying puts.", "score": 9, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Click Here to read fresh WSB DD.](https://new.reddit.com/r/wallstreetbets/search?sort=new&amp;amp;restrict_sr=on&amp;amp;q=flair%3ADD).\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs [HERE](https://www.reddit.com/r/wallstreetbets/wiki/linkflair).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "KSS has been doing AMZN returns for a while. It may have just gone Nationwide recently, but I've definitely returned shit there last year.", "score": 2, "replies": []}, {"body": "I just finished an internship in Macy’s finance department. I know I know, they just dropped a shit ton after their garbage earnings release. However, in talks with their executives, they believe amazon is just using Kohl’s for their information which will later come back to bite the store. Take it with a grain of salt, as you should everything in this beautiful subreddit, however I don’t believe this benefits Kohl’s in the long run...", "score": 2, "replies": []}, {"body": "[deleted]", "score": 2, "replies": [{"body": "Eat my dongus you fuckin nerd.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 5, "replies": []}]}, {"body": "I return my Amazon stuff there all the time. They hand me my little one day discount. I think oh wow 25% off seems legit. I turn around and look around the store. Nope. I'm out. I've honestly never seen anyone in the return line actually go into the store they head straight to the exit.", "score": 2, "replies": [{"body": "crereal eating autist goes to store to return amazon crap because his mom will ask where he got the money to buy it in the first place.\n\nCereal eating autist gets 25% off coupon at khols, decides today is not the day he buys pants with a zipper.\n\nMom finds coupon under an oddly stiff towel in the basement.  Thinks her little ball of autismo is too shy to ask for adult clothes\n\nMom goes to kohls and buys her man child some some tan pants with a stretchy bit made for fatties.\n\nProfit.", "score": 12, "replies": [{"body": "LMAO", "score": 4, "replies": []}]}, {"body": "They actually have pretty nice stuff. Idk what you’re into but they have basically everything at dumb low prices. If you shop any cheaper you’re at the Salvation Army.", "score": 3, "replies": []}, {"body": "Somehow there are. https://www.businessinsider.com/amazon-returns-help-boost-kohls-stores-shopper-traffic-2019-8", "score": 1, "replies": [{"body": "Ehh that just says they had more traffic. The traffic that increased the most is \"micro\" traffic also. I would imagine the sentiment is that everyone is expecting to see a boost in Kohls sales equivalent to the boost in traffic and I just do not see that happening. I think the Amazon shopper and the Kohls shopper are different and trying to bridge the gap between the two is harder than they thought.", "score": 1, "replies": []}]}, {"body": "Seriously, the Whole Foods near me has pick up / drop off lockers for Amazon packages and I've never once bought anything there when I came for a package.  What does foot traffic matter in that sense?\n\nWhole Foods is still too expensive for me and Kohl's is still too shitty for most people", "score": 1, "replies": []}]}, {"body": "I have seen this here, that means invert", "score": 1, "replies": []}, {"body": "insider info:  amazon customers are coming in, returning shit, and leaving without shopping at all.  they aren't regular customers, so they don't have the 84 coupons it takes to get reasonable prices on the garbage kohl's sells.\n\nsource: my cashier at kohl's.   i bought a bottle of water and a candy bar after returning my amazon shit.", "score": 1, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. [Click Here to read fresh WSB DD.](https://new.reddit.com/r/wallstreetbets/search?sort=new&amp;amp;restrict_sr=on&amp;amp;q=flair%3ADD).\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs [HERE](https://www.reddit.com/r/wallstreetbets/wiki/linkflair).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "If AMZN sees KSS benefiting from that, won't they just dick them from behind Blue Origin style? \n\nRetail should trade at like a 6-7 times earnings at this point. I think $KSS could drop another 15-20% from here", "score": 1, "replies": []}, {"body": "Nice try, but everyone knows what happened to Kohl Drogo.", "score": 1, "replies": []}]}
