{"title": "Bought OTM Calls on $TSLA", "selftext": "Yolo'd my Stimulus & Tax return, wish me luck!\n\n\n[My Position](https://ibb.co/F5RDc70)\n\n[Profit](https://ibb.co/wYhmm6s)\n\nEdit: Sold for a $760 profit. I know these OTM calls are crazy and the theta was high but TSLA has treated me well. And yes I was burned once or twice with them.\n\nI only use money I am willing to lose and my risk appetite is high.", "id": "gfbexu", "created_utc": 1588873741.0, "score": 25, "upvote_ratio": 0.88, "num_comments": 40, "comments": [{"body": "God speed retard", "score": 21, "replies": []}, {"body": "This guy is in a whole different dimension. He is doing the opposite of what he should be doing. Have fun being a millionaire tomorrow.", "score": 21, "replies": []}, {"body": "Fuckin why?  Theta is -0.5056 on these, you’ll be down $505 tomorrow morning if TSLA closes at the price it was at when u bought these FDs.", "score": 22, "replies": [{"body": "Thankfully I'm not greedy and walked with profit this morning.", "score": 5, "replies": [{"body": "Goddamnit.  I hate this market.  Congrats OP", "score": 4, "replies": [{"body": "Thank you and you're right my play was dumb as fuck. But TSLA is just dumb as me and we offset each other.", "score": 5, "replies": []}]}, {"body": "A retarded tempered with wisdom then.", "score": 3, "replies": [{"body": "Lmao, mostly just retarded.", "score": 2, "replies": []}]}]}]}, {"body": "Uhhhh sell that shit now my dude. 1000+ on 5/15 never going to happen with Daddy Elon going all Amanda Bynes on us. Vanishingly likely to even pop higher than 800 in that time.\n\nDD: I have lost so much on FD's.", "score": 14, "replies": []}, {"body": "Might as well just light up your money on fire \n\nWhat makes you think it'll go up 30% to hit ATH's in 1 week? I'm not even saying it'll go down\n\nBoth Fremont and Shanghai and shut down right now, luxury car market isn't exactly looking great this quarter, etc.", "score": 15, "replies": [{"body": "I agree with you that it's a dumb play but to be fair, it doesn't have to hit $1000 for him to profit and this stock follows zero logic. All TSLA factories were shut down while they hit low and it's doubled in value since and everything is still closed.", "score": 16, "replies": [{"body": "It’s because Tesla isn’t a car company, they’re a data company.", "score": 1, "replies": [{"body": "They don't generate any useful data that can be sold. You maybe could call them a software company but their battery tech is their best asset. And they know it. That's why they also sell solar panels.", "score": 3, "replies": []}]}]}, {"body": "This is Tesla we’re talking about, what makes you think it won’t be at $2000 by then", "score": 7, "replies": []}, {"body": "I dont believe it will go ITM, I have profited on the inherent volatility of TSLA before. I just want it to go up enough to make some gains. And with TSlA ita possible...", "score": 3, "replies": [{"body": "Blew my account up doing this after winning with it a few times. Hope you have better luck.", "score": 2, "replies": []}, {"body": "There are safer trades and positions. Your wager is nothing more than a gamble.", "score": 2, "replies": []}]}, {"body": "If you don't understand how to trade options, you shouldn't be on this sub.  If TSLA goes up, his position increases in value and he can sell it for a profit.  Barely anyone on here is holding OTM options until they're ITM.", "score": -6, "replies": [{"body": "He's also buying it one week out\n\nI'm just saying, I don't see it moving up enough to breakeven with theta \n\nBut also I didn't imagine the run up from sub 300 the last month (arguably worse than the initial rise to $900 with coronavirus shut down)", "score": 7, "replies": [{"body": "Ok. Sorry about my response.  I just see a lot of comments implying that options have to be ITM to be profitable.  My bad.\n\nThe theta is mad high for these.  Gotta move about 5% tomorrow for these puppies to work out.  Buying on a Thursday doesn't give you any wiggle room.", "score": 1, "replies": []}]}]}]}, {"body": "Did you sell those mofos for a profit or what!", "score": 2, "replies": [{"body": "I did for $760 profit\n\n[proof](https://ibb.co/wYhmm6s)", "score": 2, "replies": [{"body": "Funny I dogged you and ended up buying on myself. Snag a 5/15 900c. We’re getting there next week got mine for 7.5 see if you can get one on a dip on house money!!!", "score": 2, "replies": [{"body": "Your at $8.5 now not bad!", "score": 1, "replies": [{"body": "It broke resistance we’re going sky high next week \n💎🙌 \nHad a 820c 5/8 sold at a loss learned that lesson this week", "score": 1, "replies": [{"body": "Good luck, I'm looking to get back in as well.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "shouldve gone with MSFT", "score": 1, "replies": []}, {"body": "https://pasteboard.co/J7mp2VH.png\nThat’s Bullish right ?", "score": 1, "replies": [{"body": "Yea kinda like how Uber posted $3.9 Billion loss and mooned", "score": 2, "replies": [{"body": "Also wish you luck tho hoping for your 10 bagger", "score": 2, "replies": [{"body": "I dont disagree, it is an insanely crazy move but I am prepared to lose this money.", "score": 1, "replies": [{"body": "If it breaks 900 this morning I would sell a few contracts for your break even and let the rest ride", "score": 2, "replies": []}]}]}, {"body": "Idk man with 1k I would just bought 1 slightly otm call for next week and been Gucci. Or spy calls free money", "score": 1, "replies": []}]}]}, {"body": "Your delusional", "score": 1, "replies": [{"body": "You’re", "score": 3, "replies": [{"body": "Spell check me when Tesla is at 650 end of the month.", "score": -2, "replies": [{"body": "It won’t be 😉", "score": 5, "replies": [{"body": "Bellow 700 I can bet on that", "score": -3, "replies": [{"body": "That means nothing. Show your puts. Put your tiny account to work. But you won’t.......", "score": 5, "replies": []}, {"body": "What are you betting? Win or ban, or show your positions.", "score": 0, "replies": []}]}]}]}]}]}]}
{"title": "So what happens when Index/ETFs become \"too expensive\" down the road?", "selftext": "So basically, I'm investing very long-term right now in QQQ/VOO. For easiness let's just say they're both about $250/share. \n\nWell, I'm able to buy a share of them every so often - they're pricey, but if I save up, that's fine. Though, obviously others would struggle to save up to buy one whole share. But let's take QQQ for example. It's up *exactly* 100% from 5 years ago today. So let's say in 2025, it'll be worth $500/share - even after inflation, that'll be a lot more expensive for most people to consider investing in. \n\nSo what happens? I know there are fractional shares, but don't know if they apply to ETFs/Indexes. Do they just keep getting more and more expensive? Or, I'm assuming, after X amount of time or a certain $ point, do they consider doing a reverse split - for example maybe you get double the shares you had in QQQ in 2025 but they're only $250 each then. \n\nI'm sure it's happened before on ETFs or indexes maybe, I was just curious.", "id": "gexyop", "created_utc": 1588817909.0, "score": 31, "upvote_ratio": 0.84, "num_comments": 31, "comments": [{"body": "Possibly a stock split.", "score": 39, "replies": []}, {"body": ">do they consider doing a reverse split - for example maybe you get double the shares you had in QQQ in 2025 but they're only $250 each then. \n\nOff topic, but that would be a split. A reverse split would leave you with fewer shares.", "score": 15, "replies": [{"body": "Makes sense, thanks lol. Still learning.", "score": 3, "replies": []}]}, {"body": "A split. So say a 1 for 2, then the number of shares doubles and the share price halves. This can be done in any ratio to achieve virtually any price (on that given day).", "score": 29, "replies": [{"body": "That's what I was thinking maybe happened. Is there like an \"unspoken amount\" for when this happens, a regulation/rule, or just whenever the group what manages the ETF/Index decides to do a split?", "score": 3, "replies": [{"body": "I’m not sure. It would be up to the ETF provider probably . For example, look at SPY vs any other S&P500 etf, and then look at the actual index. SPY is almost exactly 10 times less then the index, and that was probably a specific choice for them (compared to the other ETFs who in general chose arbitrary values). \n\nUsing common sense, I’d say they could base it off of volume going in per month. For example, data could be gathered from brokerages to see how many shares per month people buy per month (and assuming people invest a fixed dollar value per month), ETF providers could deduce the maximum price that people would buy 1 share. That would be close to the dollar value of how much people deposit (for example, the average person puts $100 per month into that particular). This way isn’t completely fool proof as there’s a range, but it provides some logic that might merit a split. If people cannot continue to buy at least 1 share per month, then the ETF provider would be wise to split.", "score": 3, "replies": [{"body": "That sounds like a good idea. They want people to keep buying shares, but if the number of people keeps declining then eventually they'll make the decision to split. \n\nThanks for the insight, I appreciate it! :)", "score": 1, "replies": []}]}]}]}, {"body": "They could split or further derivatives could be made pinned to the larger index (like GLDM or SPYV) to provide more affordable entry. I actually started with just buying up any GLDM I could each week.", "score": 3, "replies": []}, {"body": "I use fractional shares for VOO.", "score": 2, "replies": [{"body": "I use RH so I'm still in queue to get access to them. Can't wait though. Didn't know they were also for indexes. Thanks!", "score": 2, "replies": [{"body": "Get Fidelity. RObinhood is trash for anything that's not options", "score": 4, "replies": [{"body": "And WeBull is better for trading options. WeBull doesn't have spreads yet but for basic strategies, it gives much better information. Also, in my experience, the fills are much better", "score": 1, "replies": [{"body": "I can see it tbh. Robinhood I'll admit is incredibly easy to use and understand while Webull can look like an overload, but i wouldn't be surprised if it works better.", "score": 1, "replies": []}]}, {"body": "Eh, I know it's not the \"popular\" choice but I'm happy with Robinhood so far. It's simple, easy, and has a clean UI. \n\nIf I was a day trader/way more serious about it, then I'd probably use another one, but I'm mainly just buying very long shares on occasion.\n\nI've heard the others are good too, not saying that, just that I'm content with using Robinhood for now.", "score": 1, "replies": [{"body": "Get rid of that Robinhood bullshit and get a real broker.", "score": 3, "replies": [{"body": "I don't think you read my above comment.", "score": 1, "replies": [{"body": "Why use a start-up online broker that has an unstable application?  It makes no sense.  But hey, your money.", "score": 3, "replies": [{"body": "k", "score": 1, "replies": []}]}]}]}]}, {"body": "Have you used M1 finance... debating between them or Fidelity for fractional shares.", "score": 1, "replies": [{"body": "Fidelity is better because you can buy individual stocks too for no commission.", "score": 2, "replies": []}]}]}]}]}, {"body": "Just wait for the 2030 pandemic", "score": 2, "replies": []}, {"body": "Partial shares", "score": 1, "replies": []}, {"body": "Fractional shares will eventually become the norm", "score": 1, "replies": []}, {"body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/stonkfeed] [So what happens when Index\\/ETFs become \"too expensive\" down the road?](https://www.reddit.com/r/StonkFeed/comments/gf115s/so_what_happens_when_indexetfs_become_too/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*", "score": 1, "replies": []}, {"body": ">know there are fractional shares, but don't know if they apply to ETFs/\n\nThey should.", "score": 1, "replies": []}, {"body": "If you’re asking us for advice, Jerome, we’re in trouble.", "score": 1, "replies": [{"body": "I wouldn't say my question was an advice-asking one.", "score": 0, "replies": [{"body": "(whoosh)", "score": 0, "replies": [{"body": "A joke is supposed to be funny.", "score": 0, "replies": []}]}]}]}, {"body": "Index mutual funds let you go in with specific dollar amounts and get fractional shares easily.", "score": 1, "replies": []}]}
{"title": "Time To Buy Lockheed Martin(LMT)?", "selftext": "Obviously Boeing has enough problems in the commercial airline sector to deal with. Airbus stock has also been hit pretty hard as well. I was looking at Lockheed Martin who specializes more in the defense industry. They seem to be doing ok. Is this their chance to finally pull away from Boeing and get ahead of them in defense contracts? It seems to me that this might be a good opportunity to invest in Lockheed but I would like to here input from others.", "id": "gfdtu2", "created_utc": 1588881205.0, "score": 17, "upvote_ratio": 0.8, "num_comments": 28, "comments": [{"body": "I want to. It’s just too expensive an entry point for me.", "score": 24, "replies": [{"body": "+1 I’ve been keeping an eye on it as well, but am waiting for a better entry. LMT isn’t going anywhere, just got some good contracts and has good forecasts", "score": 5, "replies": []}]}, {"body": "LMT > BA\n\nI'd even put NOC above BA\n\nFuck BA", "score": 9, "replies": [{"body": "yea the main argument people make FOR BA is well its too big too fail and the government won't let it die. That may be true, but theres very little growth in the coming quarters...", "score": 3, "replies": [{"body": "most people on this subreddit only look at BA as a civilian aircraft arm. While true, its military defense business is still doing good. It's gonna take a few quarters but they've been in this position in the past. I'm pretty sure 2 planes crashed in the 90s as well, and they came back from that.", "score": 5, "replies": [{"body": "Completely different times. Today they are fucked. Boeing was in serious trouble before the virus and that was just grounded planes. Now they have had over half their new orders cancelled and are on government life support. At 60 its a risk worth taking. At 130 its a solid no.", "score": 2, "replies": [{"body": "> and are on government life support\n\nthey rejected the gov life support but even then it's good that the gov is ready to bail them out. I see potential again and it's a risk worth taking for me.", "score": 1, "replies": [{"body": "I wish you luck. I don't have a position either way.", "score": 1, "replies": []}]}]}]}, {"body": "Quarters? More like years.", "score": 2, "replies": [{"body": "Lmao yeah", "score": 1, "replies": []}]}, {"body": "Cold War with China coming.... last Cold War gave birth to the defense industry", "score": 1, "replies": [{"body": "There are better competitors with better financials than BA", "score": 1, "replies": [{"body": "I thought Airbuss and Boeing were the only 2 major airplane manufactures", "score": 1, "replies": []}]}]}, {"body": "NOC is also worth keeping an eye out for.", "score": 1, "replies": []}]}, {"body": "ITA in my IRA all the way.", "score": 3, "replies": [{"body": "Ooh I like that", "score": 1, "replies": []}]}]}, {"body": "Rtx lmt noc  in order of shares owned is my defense stocks.", "score": 4, "replies": []}, {"body": "I prefer RTX", "score": 11, "replies": [{"body": "It’s the poor mans Lockheed. I’m in with you", "score": 5, "replies": []}]}, {"body": "LMT CEO is retiring in June 2020 will this affect the stock price? Thoughts?", "score": 3, "replies": [{"body": "She won Forbes world's most powerful woman. Great CEO and has been at Lockheed her whole life. Don't know much about the new guy though.", "score": 5, "replies": []}]}, {"body": "Last I checked (could be wrong) they have had more revenue from government contracts than any other company, including Boeing, for years.  Maybe that statistic is pentagon/defense spending specific not sure.\n\nI started buying shares of LMT a couple years ago, and always consider them worth buying.", "score": 2, "replies": []}, {"body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/stonkfeed] [Time To Buy Lockheed Martin(LMT)?](https://www.reddit.com/r/StonkFeed/comments/gfio46/time_to_buy_lockheed_martinlmt/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*", "score": 1, "replies": []}, {"body": "If our next president is a Dem. Then they might reduce military spending. \n\nRemember a lot of the contract has option years, which does not have to be excised.", "score": 1, "replies": [{"body": "Dem or not, war and defense never goes away", "score": 1, "replies": [{"body": "Well yeah, agreed. But I’m saying the overall defense budget might be reduced or reallocated. \n\nEspecially with covid, the gov took on an addition 2.2T so far... it doesn’t seem like a bad idea to put some projects on hold", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "1) advocating doesn’t mean he’ll do it. \nSince 11’ the defense budget decreased till 15’ and now it has still not suppressed the 11’ budget. And as a percentage of GDP it has decreased since 10’ \n\n2) they are already in the phase to upgrade ever since NK started missile testing back in 17’-18’. That’s already priced in. \n\nThis is all pre covid, so we will see what happens.", "score": 1, "replies": []}]}]}, {"body": "But how do you sleep at night knowing that you are putting your savings in a company that profits from death and suffering?", "score": 1, "replies": []}]}
{"title": "Anyone thinks AAL double bottoms here?", "selftext": "In april we saw a bounce off 9.09 lows.. so far these past 2 days we've seen it hold so far. I bought a couple calls today just incase, and might double down if price action looks bullish. Company is definitely a shitshow but technicals look good. What are your thoughts?", "id": "gew7jl", "created_utc": 1588811419.0, "score": 2, "upvote_ratio": 0.58, "num_comments": 31, "comments": [{"body": "I think AAL will file for bankruptcy, again. Shareholders will get wiped out.", "score": 19, "replies": [{"body": "Donnie pump will save them", "score": 13, "replies": [{"body": "🤞🏼", "score": 4, "replies": []}, {"body": "Why? They may just save the healthy ones and let the other ones die.", "score": 2, "replies": [{"body": "My dad works at Goldman Sachs, AAL calls", "score": 8, "replies": [{"body": "Lol sure. Proof?", "score": 2, "replies": []}]}]}]}, {"body": "So puts?", "score": 2, "replies": [{"body": "So stay the fuck away from it.", "score": 7, "replies": [{"body": "What happens if I have say a 6/19 put on them and they declare bankruptcy tomorrow? Isn’t that the same as the stock going to $0 and I make bank?\n\nEdit: I googled the question but can’t find an actual answer", "score": 3, "replies": [{"body": "No one is going to buy shares of a company that’s filed for bankruptcy unless they’re an idiot.", "score": 4, "replies": [{"body": "PG&E went up like 250% after bankruptcy 😂", "score": 2, "replies": []}, {"body": "Can’t I exercise my put and force them to?", "score": 1, "replies": [{"body": "Huh? Maybe you need to time some time and find out what options are and how work. Then the answer to your question becomes obvious.", "score": 5, "replies": [{"body": "Oh no I have, I am just finding mixed answers on this as it happens so infrequently. I ran into this with LK, but my puts expired the day after they were halted and RH didn’t get back to me until after the contract expired - they issued me $15 credit for the cost of the put", "score": 1, "replies": [{"body": "I'm sorry to hear that. That LK shit is awful.\n\nWell if the underlying asset, the stock, becomes no longer tradable (as in a company filed for.chapter 7 bankruptcy) the contract, your option, is nullified because the stock is no longer tradable.", "score": 1, "replies": [{"body": "I don't think that's true.  The option is no longer tradeable, but you would receive full value, as the seller is still obligated to abide by the terms of the option.", "score": 2, "replies": [{"body": "But The terms of the option are to sell you a share for a certain price. You can't sell a share that's been halted via most trading platforms.", "score": 1, "replies": [{"body": ">But The terms of the option are to sell you a share for a certain price. You can't sell a share that's been halted via most trading platforms.\n\nIf a Company goes the Chapter 7 route, the holder of the Put would exercise his/her option and receive the full strike and not deliver anything because the Company is in liquidation.  Again, the seller is obligated to abide by the option contract.  They do not become null or void because the underlying isn't traded anymore.", "score": 2, "replies": [{"body": "Why wouldn't people just buy puts on a company that looks to be headed towards chapter 7 then hold until expiry if the company does? I've never heard of this tactic,  but I'd do it if it's possible. Looking at you, AMC\n\nNeiman Marcus is filing for bankruptcy! There you go! Buy puts and hold to expiry. Easy money!!!!", "score": 1, "replies": []}]}]}]}, {"body": "Okay, that is what I misunderstood. I didn’t realise that they were untradeable, I thought their value would just become $0 and you were still locked into contracts.\n\nThanks for the explanation!", "score": 1, "replies": [{"body": "That person is wrong.  Also, this information is readily available from google.  Use it.", "score": 2, "replies": []}]}, {"body": "Yeah no.  Options are contracts guaranteed.  Company goes bankrupt and you have puts?  That is potentially maximum payout.   Whoever sold you that right to sell shares of that company at that higher price is obliged to fulfill that obligation, so your profit is guaranteed.\n\nI should clarify getting delisted is not the same and the options just become worthless", "score": 0, "replies": []}]}]}]}]}]}, {"body": "Yup", "score": 1, "replies": []}]}, {"body": "This. Thank god I bought puts on Friday to offload my shares this Friday.", "score": 1, "replies": []}]}]}, {"body": "This is what should happen. The planes will fly under another name.", "score": 1, "replies": []}, {"body": "Yes, but when? Not for a couple of months at least. I’m selling 8p and 9p until they break through and then wheeling.", "score": 1, "replies": []}]}, {"body": "Did you see airplane ticket  price lately? It's so damn high cuz social distance 6 ft apart. Less customers and cost still the same. I'd not touch Airlines right now", "score": 2, "replies": []}, {"body": "AAL is most likely candidate for filing for bankruptcy imo. UAL is a close second. \n\nInterested in opinions on all 3. Exit strategies for straight stocks ? (Wouldn't be asking if I didn't believe we've turned the corner making it inevitable for at least 1 of my holdings).", "score": 2, "replies": []}, {"body": "AAL parked some of its jets until 2022\n\nhttps://www.dallasnews.com/business/airlines/2020/05/06/american-airlines-is-parking-another-line-of-jets-with-a-dismal-forecast-travel-demand/?outputType=amp", "score": 1, "replies": []}, {"body": "there are easier and more satisfying ways to throw away your money than on airline plays imo", "score": 1, "replies": [{"body": "Making money right now, friday or next week will tell if I'm balling!", "score": 1, "replies": []}]}]}
{"title": "Shopify 2.0 [WIX]", "selftext": "This market is dumb as shit and pumps everything to all time highs. I saw Shopify today and was just blown away by its price. It makes Tesla look cheap and that's not easy. Wix is a far less known company in the same space. They should have a blowout quarter, already released an update to investors that they've seen an uptick since March (i.e the full quarter).   \n\nShopify is now trading at 53x revenue ($1.6 billion) and 49x sales with a market cap of $85 billion.  \n\nWix is now trading at 11.5x revenue ($760mm) and 8x sales with a market cap of $7 billion.  \n\nNow Shopify has about 15% higher growth but that's skewed from their recent report. Wix doesn't report until later this month and [recently projected $1 billion](https://www.reuters.com/article/us-wix-com-results/israels-wix-com-sees-2020-revenue-reaching-almost-1-billion-idUSKBN20E1CI) for the year. Is it cheap? No, but what tech stock CV19 beneficiary is? It's pennies relative to Shopify and easily has room to triple if it goes parabolic.  \n\ntl;dr Short SHOP. Long WIX. You're welcome.", "id": "gf1alu", "created_utc": 1588832872.0, "score": 23, "upvote_ratio": 0.74, "num_comments": 33, "comments": [{"body": "They’re not same though dickhead", "score": 51, "replies": [{"body": "fuck this made me spill my cereal", "score": 17, "replies": []}, {"body": "WIX = WORDPRESS\nSHOPIFY = AMAZON\n\nYeah not quite the same 😂", "score": 8, "replies": [{"body": "Shopify offering a platform for people to open online stores is equal to Amazon who started out with a goal of becoming the biggest online store for everything you can think of, in what way exactly?", "score": 1, "replies": [{"body": "Shopify also has it's own fulfillment network for clients and even uses Amazon warehouses to streamline fulfillment. Now of course, it's not on the scale of Amazon but they do plan to boost it.\n\nThis post likened WIX to Shopify which simply is not the same thing. WIX is just a hosting platform similar to WordPress.", "score": 1, "replies": [{"body": "I agree with the second part but not the part where you equate Shopify to Amazon. <3", "score": 2, "replies": []}]}]}]}, {"body": "Lolol next up, compares SHOP to NIO.", "score": 2, "replies": []}]}, {"body": "WIX is shit and has a terrible user experience.", "score": 17, "replies": [{"body": "This guy is right wix is shit", "score": 2, "replies": []}]}, {"body": "Shopify is gaining so much because investors are assuming that due to the shutdowns, traditional retail shops are going to move their business Online and Shopify is the best online store builder.\n\nI know 2 businesses (1 florist and 1 car wash) who have opened a website built on shopify since the outbreak began.", "score": 6, "replies": []}, {"body": "Fuck it I'm in.  It's right up my alley actually, thanks for the heads up.", "score": 8, "replies": []}, {"body": "Good call OP.  Bought 12 contracts already up like 40%.  I'll be holding these for a while.", "score": 4, "replies": []}, {"body": "Literally free money", "score": 3, "replies": []}, {"body": "This was my DD for etsy and look where that ended up", "score": 3, "replies": []}, {"body": "Hey OP!  Aside from your short SHOP idea (which I didn't do), i'm up 543% and 386% on 12 WIX contracts.  !!!  FUCKING SHIT OP DELIVERED!   Just wait for a green day, this shit might hit 190!  \nEDIT: 900%%%%%%", "score": 3, "replies": []}, {"body": "* June 19 $160  \n* July 17 $200", "score": 7, "replies": []}, {"body": "SHOP has a crazy multiple, as we all know. But the main reason that WIX has a reduced multiple compared to its non-Shopify peers is that it’s headquartered and based in Israel. Israel is certainly not as bad as China in terms of fraud risk, but there’s still the foreign investment risk associated with them.\n\nWho gives a shit about fundamentals though, I’m sure your WIX play will print.", "score": 6, "replies": []}, {"body": "IM IN!!!", "score": 2, "replies": []}, {"body": "No you dumbfuck. Wix is geocities. Why they fuck are you comparing geocities to amazon?", "score": 2, "replies": []}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Strike  price for may 15 ?", "score": 1, "replies": [{"body": "C160", "score": 2, "replies": []}]}, {"body": "Why did it have such a massive runup yesterday? Might be worth buying some calls as a lotto if it drops back a bit next week but this runup is hella suspicious.", "score": 1, "replies": []}, {"body": "Shorting Shopify is the most dangerous thing you could do. It’s literally up 100%+ in a month. If that happens again, you’re fucked. If you can’t help yourself, do it with put spreads.", "score": 1, "replies": []}, {"body": "I want to save you, so please do not short shopify. I could care less if you go long WIX. \n\nShopify is not a website builder like WIX (layman terms not a drag and drop). If you are technically sound enough to understand shopify has the ability to stop bots, customize various features using code, API's, setup multi region/ multi lingual (global) stores, add integrate payment methods, discounted shipping rates etc...\n\nIt's like buying [jet.com](https://jet.com) if it were public and shorting amazon because both does the same thing.", "score": 1, "replies": []}, {"body": "These call options for next week have shot up over the last few days...\n\nYou think its too late to hop on a 175c or should i go for the cheaper 180?", "score": 1, "replies": []}, {"body": "Shorting $SHOP is the dumbest idea ever. Dude their $1000c for 2021 are at like $150+, that's 15k for a single contract. That shit is gonna keep going up and I'm too broke to get the calls toninverse your stupid ass play", "score": 1, "replies": [{"body": "Well if you get the money let me know and I'll sell you some of those calls.", "score": 1, "replies": []}]}, {"body": "thoughts on the fact that it beat last two earnings estimates and still gapped down on open? Last quarter estimate was (0.27) and actual was +.39, a .66 beat. Apparently revenue was 204.6M compared to actual of 205.6 and that's what caused the drop. It was at an at of 155 on close and opened at 140. Gapping down after beating earnings doesn't make sense to me but apparently it's the norm for wix. Who knows, maybe all the hype will be enough to counter this time, maybe not. Still not sure if I want to risk it", "score": 1, "replies": []}, {"body": "This was from months ago but I invested then and since then am up 126% on my position in WIX, thank you kind sir.", "score": 1, "replies": []}, {"body": "The shareholder letter released on April 13 doesn’t sound promising, considering the stock has risen by 25% since then.\n\nhttps://5414c2cd-af59-4a47-a3e3-ef0b620af461.filesusr.com/ugd/9a25f2_677ae7b43b894ed5b95158302dda63c0.pdf", "score": 0, "replies": []}]}
{"title": "Puts on any pharma working on RNA Vaccine for Covid", "selftext": "[deleted]", "id": "gf7lf5", "created_utc": 1588861821.0, "score": 8, "upvote_ratio": 0.72, "num_comments": 30, "comments": [{"body": "The way the market works means that the vaccine doesn't have to not work in order for you to lose money. It just has to be hyped long enough for your puts to expire worthless. One day after your puts expire worthless the company will reveal that they either don't work or that they killed a bunch of babies again.", "score": 10, "replies": [{"body": "This is a very good observation. I didnt think about it. I was banking on the constant stream of news eventually turning sour. Seems like its every other day someone, somewhere, is talking about whats working and what is not because I feel its keeping the public grounded.\n\nedit: IMHO, 12 to 18 months is too late anyway for a vaccine. We aren't going to be in lock down for that long. Hell, the whole thing could burn out as soon as herd immunity takes over rendering all this moot. We need the near term, and that's treatment.", "score": 3, "replies": [{"body": "Near term is already pretty well figured out; ventilators, masks, gloves and cleaning supplies. It's a bit late to be getting into those though.", "score": 2, "replies": [{"body": "PPE is good to reduce the risk of transmission, but not to treat or prevent. You'll still have people catching and possibly dieing. So a treatment is absolutely still needed. But my understanding is a vaccine will come to late and is less important now than treatment. The only way a vaccine becomes really important is if this becomes a seasonal thing.", "score": 3, "replies": [{"body": "Ventilators and pneumonia treatments are basically what everyone's decided are treatments, not really any developments there aside from how to make vents cheaper. I agree about the potential usefulness of a vaccine though, it'll likely be limited to geriatrics after a few years if it's ever developed.", "score": 2, "replies": [{"body": "Just so you know ventilators don't treat. It prolongs the inevitable. Once these people's longs are damaged they very rarely repair. Something like 75% of people die after getting put on the ventilator. The only way to maybe, possibly, treat someone at that point is to put them on bypass to let their lungs rest.", "score": 2, "replies": [{"body": "At the risk of a pedantic argument, ventilators keep people breathing. Which is something they wouldn't be able to do without them, so it definitely is a treatment, just not a very effective one. It's closer to 90%, at least according to my dad who went to New York to help out last month.", "score": 2, "replies": [{"body": "I'm with you.", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "Short MRNA today it’s primed.", "score": 5, "replies": [{"body": "Whoever is selling those 07/20 50P is going to get there ass raked over the coals when this thing bottoms.\nNVAX is another one, but those spreads are really high.", "score": 5, "replies": []}, {"body": "I took your advice. I think with the recent news that the vaccine wont be ready till end of 2021 is going to sow a ton of doubt. I picked up a single contract of 01/21 45P.", "score": 1, "replies": [{"body": "It’s your advice ! Lol", "score": 3, "replies": []}]}]}, {"body": "Interesting. Do you work in biotech? If so, how long will it take for some of these trials to fail and news to break that a vaccine is going to be difficult.", "score": 5, "replies": [{"body": "I do not. But I have been interested in medicine for a long time so I always read alot about it especially these days.\n\nHow long? Well, about as long as it takes for the first couple of trial participants to die.", "score": 1, "replies": [{"body": "People died in the Remdesivir trial.  Blame it on the virus.", "score": 2, "replies": [{"body": "They died in the Hydroxycloriquine trial too. But I dont know if that is because they were to sick before they were given the treatment or if it doesnt do anything. My GUESS is that its similar to Tamiflu, remdesivir or HydroxyC needs to be given at first signs of infection to be effective. Thats my GUESS. It seems they want to use these drugs for the severe cases, but I think at that point the chances of it helping are severely diminished. \n\nAgain, just my thoughts, I havent read (or seen) the studies or finding, but i'd like too.", "score": 2, "replies": [{"body": "You know as well as I do, but the problem is, I dont think we will ever know any better.  When/if we found out that the treatment was more harmful in some cases, our puts will have expired.  Also, if you wouldve inversed all of my plays for the past 2 weeks,  you would be rich, so I'll just go fuck myself.", "score": 2, "replies": []}]}]}]}]}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 2, "replies": []}, {"body": "MRNA is probably the big one", "score": 2, "replies": []}, {"body": "Arcturus is about as hyped as one can get.  The company's business model is hype.", "score": 1, "replies": []}, {"body": "Ayyyy NCAX had the RSV failure and I loaded up on shares like an idiot at $3.75 last October.....shoulda bought $10 long dated calls", "score": 1, "replies": []}, {"body": "I mean, I see vaccine as the only thing viable beside immunomodulatory agents since it seems like by the time you even think you have the virus your viral load is already really high.", "score": 1, "replies": [{"body": "I agree. But I don't think we have the science yet to create this vaccine and I doubt it will happen in the time being thrown out there. This had been something companies have been working on for like 40 years.", "score": 1, "replies": [{"body": "So I'm sure you agree that the basic research have kept advancing, I agree the chance isn't great but I think it's very much elevated than what it pre-covid because of the hype.", "score": 1, "replies": [{"body": "Sure basic research has been advancing but they couldnt figure it out on a good day. People yelling \"rah rah rah science\" isnt going to magically make a breakthrough happen. \n\nHow about the fact that this hype is allowing companies a free pass through phase 1 clinical trials? Or that a lot of the protocols put in place in the name of safety are being suspended?  What possible good can come of that? \n\nIMHO, this is a cash grab.", "score": 2, "replies": [{"body": ">How about the fact that this hype is allowing companies a free pass through phase 1 clinical trials? Or that a lot of the protocols put in place in the name of safety are being suspended? What possible good can come of that? \n\nData.", "score": 1, "replies": []}]}, {"body": "Read both:\n\n\nhttps://www.forbes.com/sites/leahrosenbaum/2020/05/08/fueled-by-500-million-in-federal-cash-moderna-races-to-make-1-billion-doses-of-an-unproven-cure/\n\nhttps://qz.com/1852835/fda-would-consider-releasing-an-unapproved-coronavirus-vaccine/", "score": 2, "replies": []}]}]}]}, {"body": "This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Sir, this is the bread line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "score": 1, "replies": []}, {"body": "Nice DD. Called it", "score": 1, "replies": []}]}
{"title": "WSB was a pump and dump, comments per discussion thread over time is a classic bubble pop.", "selftext": "", "id": "gfb5sx", "created_utc": 1588872982.0, "score": 394, "upvote_ratio": 0.98, "num_comments": 40, "comments": [{"body": "Looks like r/all is finally tapering off.", "score": 132, "replies": [{"body": "We got roped in by wsbgod appearing on all with his massive fake tendies. We are dropping off now cause we lost all our money", "score": 88, "replies": [{"body": "With DD like this you'll be green in no time!", "score": 18, "replies": []}]}, {"body": "Looks like r/all is broke.", "score": 9, "replies": []}, {"body": "thank fuckin' gawd", "score": 11, "replies": []}, {"body": "poki followers used up all the money on dad's account. Gonna have to go back to getting their adrenaline rushes from her leaning over on steam again", "score": 3, "replies": []}, {"body": "It’s more the shitpost shadow banning than anything", "score": 3, "replies": []}, {"body": "You either die at zero or you live long enough to admit you’re retarded and just join theta gang.", "score": 3, "replies": [{"body": "You have been stalking me I see...", "score": 2, "replies": [{"body": "Lol shit are you a theta gang bro too? I stuck my head out on bullshit tanker DD that was clearly a con, lost tendies now straight back to theta.", "score": 1, "replies": []}]}]}]}, {"body": "Overlay VIX and see what happens", "score": 86, "replies": [{"body": "Haha no shit. Literally the same chart.", "score": 39, "replies": []}, {"body": "Solid dd", "score": 10, "replies": [{"body": "The only DD I know is to double down.", "score": 1, "replies": []}]}]}, {"body": "Yeah, but what about the crazy QE???   This is underpriced.   40000c on  WSB it is.\n\nV-shaped recovery for the win!", "score": 23, "replies": []}, {"body": "[Bonus meme lines](https://i.imgur.com/2gb2mhJ.png)", "score": 17, "replies": [{"body": "PANIC", "score": 1, "replies": []}]}, {"body": "You can even tell where the mods imposed automod features thus evolving the limp dick into a complete dick to ass to mouth male to male formation.", "score": 12, "replies": []}, {"body": "This is some /r/MemeEconomy shit", "score": 8, "replies": []}, {"body": "They’re all on r/bitcoin now", "score": 10, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "It's a circle.\n\nWsb > Bitcoin > Altcoins > Wsb.", "score": 1, "replies": []}]}]}, {"body": "It was VIX all along!", "score": 5, "replies": []}, {"body": "I’m seeing a strong support at that 2000 lvl and expect a nice bounce off that support on the daily chart", "score": 3, "replies": []}, {"body": "Comments have been priced in.", "score": 2, "replies": []}, {"body": "Look at that. It tapered off when the \"push buttons for gains\" phase ended.", "score": 2, "replies": []}, {"body": "this guy analyzes", "score": 2, "replies": []}, {"body": "So what you’re saying is that WSB is inversely related to the Stonk Market?\n\nAll bears need to do is make more comments on each thread, and then the stonk will finally go down?", "score": 1, "replies": [{"body": "🐻👅", "score": 1, "replies": []}]}, {"body": "Buy puts on WSB? What strike and expiry or GTFO", "score": 1, "replies": []}, {"body": "What happened between April 4th and 14th? Did everyone else spend the day watching their neighbor plow their wife too?", "score": 1, "replies": []}, {"body": "Looks like we’re range bound", "score": 1, "replies": []}, {"body": "What if upvotes and downvotes equals buys and sells and people het drawn into volume?", "score": 1, "replies": []}, {"body": "damn you can really see msft 200c 3/20 on here", "score": 1, "replies": []}, {"body": "I came for wsbgod but I stayed because of quarantine. Still find this shit super interesting and honestly brings some excitement while I’m stuck at home. Just have to resist yoloing everything or else playtime is over...", "score": 1, "replies": []}, {"body": "You've made me 21 dollars so far sir.", "score": 1, "replies": []}, {"body": "It peaked in March because the market \\*was\\* crashing and futures were limit down every second day.. not because it was a pump and dump.", "score": 0, "replies": []}, {"body": "Trading was more interesting in early April and late March.  Nothing happens these days.  Been stuck in the same general area for weeks.  Nothing to discuss", "score": 0, "replies": []}, {"body": "Dude WSB’s was the perfect top indicator. Like literally perfect.", "score": -2, "replies": []}]}
{"title": "Breakout day tomorrow?", "selftext": "I think tomorrow's going to be the breakout day. No idea if it's up or down, but hear me out. \n\nVolume's at the lowest it's been in weeks. You can't maintain a rally past 2900 or a sell-off past 2800 without volume. We noticed that this week with the post-Amazon ER/tariff sell-off towards 2800 on Monday and today's low-volume surge to 2900 that got sold off into EOD. Both big movements being pulled back. \n\nWe've been range bound 2700-2900, and more lately, 2800-2900, with recent overnight rallies and un-explained sell-offs EOD. What this could mean is that there's some market manipulation to let some big investors cash out at a higher price. They all know 2850-2900 is a very important level, going back years. \n\nThis range has acted as a big resistance for years until we blew past it last year and it acted as support. Both bears and bulls know that they couldn't maintain a big move either way with the volume we have. Or else we would have continued to drop on Monday or continued to rally today. They've been testing the range limits all this week. \n\nIf we surpass it with increasing volume, 3100 is easily possible with 2900 acting as support, and if we fall below it, it's going to be a fall down to 2600-2700s. \n\nWhy tomorrow? Because tomorrow we have April's job reports. Good or bad doesn't matter, it depends on how the big bullish and bearish players can move the market tomorrow. \n\nBig move up? Major news sources will spin it off as the market is optimistic and that we're due for a faster recovery. Re-assuring investors and providing temptations to side-line cash holders to buy in, providing additional volume to rally past 2900. \n\nBig move down? Major news sources will spin it off as the economy is way worse than predicted, and panic investors into selling, providing additional selling volume to break down 2800. \n\nTomorrow could also just be a flat day, but it feels like the monthly job report tomorrow is \"big news-worthy\" enough to act like a catalyst for a big move one way or the other.", "id": "gfgsea", "created_utc": 1588890722.0, "score": 30, "upvote_ratio": 0.71, "num_comments": 39, "comments": [{"body": "Tomorrow will be up, down, or flat?  No way.\n\nI think we finally found the secret identity to Captain Obvious.", "score": 130, "replies": [{"body": "It was u/Suckmypoopoo this whole time!", "score": 14, "replies": [{"body": "Ha! Username checks out.", "score": 2, "replies": []}]}, {"body": "fuck that was funny holy shit", "score": 3, "replies": []}]}, {"body": "Market is just fucking annoying at this point. Once my shit is in the money, I'm out of this for good. It's just moronic af.", "score": 40, "replies": [{"body": "looks like you’re going to be here forever.", "score": 47, "replies": [{"body": "Chances are high, hopes even higher.", "score": 13, "replies": []}]}, {"body": "Time to join Theta gang", "score": 9, "replies": [{"body": "I keep saying that.  Doing it is actually harder.", "score": 5, "replies": []}]}, {"body": "I sold every share and option today. I’m out. I don’t want to play a rigged game.", "score": 3, "replies": []}, {"body": "Siri, google 'sunk cost fallancy'", "score": 1, "replies": []}]}, {"body": "It’s gonna be bloody red hell tomorrow", "score": 20, "replies": [{"body": "You’re so fucking hot", "score": 11, "replies": []}]}, {"body": "[deleted]", "score": 20, "replies": []}, {"body": "Rug pull. Bookmarket.", "score": 16, "replies": []}, {"body": "This guy knows what he's talking about right here. Someone call the Nobel selection committee.", "score": 12, "replies": []}, {"body": "TL;DR: calls, puts, strangles, and straddles", "score": 8, "replies": []}, {"body": "A whole Doctoral thesis for an IDK. Got it. Thanks 🤙", "score": 11, "replies": [{"body": "Nah. I wrote a dissertation. It wasn’t as difficult as what his smooth brain produced here.", "score": 1, "replies": []}]}, {"body": "I hear the unemployment number will be deceptively small (at lower range of estimates) because of the high percentage of respondents in the survey not equating \"unemployed\" with \"furloughed\".  It's really a flawed analysis when they rig the questioning like that.\n\nHope I'm wrong though.", "score": 4, "replies": [{"body": "Not to mention people leaving labor force altogether", "score": 1, "replies": []}]}, {"body": "Monday will be the crash", "score": 4, "replies": []}, {"body": "Big money’s been selling into strength the past two weeks. Most likely cycling out and taking profits or building shorts.", "score": 3, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "I use and indicator called CICO. But you can see it visibly. Price gaps up, they let it run for a minute, and then they slowly bleed it", "score": 2, "replies": []}]}]}, {"body": "Solid DD. Tomorrow could be up, down or flat. Gonna go gamble my wife on that", "score": 3, "replies": []}, {"body": "> No idea if it's up or down\n\nIt was at this point at which I stopped reading the rest.", "score": 2, "replies": []}, {"body": "I like this energy. Have an internet point.", "score": 2, "replies": []}, {"body": "I think it will depend on 1) the “breaking news” that Fed proxies are going to use as cover to pump at the same time the bad employment numbers come out and 2) the size of the pump.", "score": 2, "replies": []}, {"body": "Imagine a bubble filling up rapidly for a few months then it slows doen right before you think itll burst, and then it starts expanding even faster", "score": 2, "replies": []}, {"body": "Gecko so well fed dude [https://squeezemetrics.com/monitor/dix](https://squeezemetrics.com/monitor/dix) we going UP. Well I'm bull so everything looks BULLISH to me", "score": 1, "replies": []}, {"body": "I hope it goes uppies praying for my SPX 3000 call expiring Monday", "score": 1, "replies": []}, {"body": "Could go up, could go down, could stay the same. Either way, we're totally prepared.", "score": 1, "replies": []}, {"body": "It will open down like 300 and then close flat. Or not.", "score": 1, "replies": []}, {"body": "I hope you're right I'm strangled to the tits.", "score": 1, "replies": []}, {"body": "Look at what happened after the second week of may in 01 and 08. Make sure your chart is on Log scale.", "score": 1, "replies": []}, {"body": "I sold my calls today and am cash gang", "score": 1, "replies": []}, {"body": "This is some big brain shit. Tell me what u smoking bro.", "score": 1, "replies": []}, {"body": "Sir there isn't enough confirmation bias in this post to make me feel  good about my puts. Anyway , was watching s&p get rejected by 2900 today and made me feel pretty confident about 5/8 285 puts but when did that ever work", "score": 1, "replies": []}, {"body": "Futures pushing up past 2913.........been a pretty solid indicator for the next day regardless of the data. As Mr. M says....”it’s irrelevant”.", "score": 1, "replies": []}, {"body": "Get ready cause it ain’t funny bear about to swipe and take that money!", "score": 1, "replies": []}]}
