{"title": "First Trade Worked! 6% in 3 Days", "selftext": "First Trade: $TXN Call Bear Spread (sell @ 105) (buy @ 110) with 25 Jan Exp for .41 a contract. I bought on Monday DEC 31 and sold Jan 3 for .12 a contract or 6% profit. \n\nIt’s not much but if I can continue this and get 6% a month then I’ll double all the money I put towards credit spreads every year with VERY little risk.\n\nSee Previous Post for Rules and Strategy: https://www.reddit.com/r/options/comments/a8ljfj/my_googl_995_put_spread_expired_atm_and_now_i/?st=JQHED5JO&sh=c23515b3\n\nNext Trade: $BA Call Bear Spread (sell @ 365) (buy @ 370) 15 Feb Exp for .37 a contract and sell for .11\n\nNote: 15 Feb is over 30 days away which adds risk to the trade. I would like to hold out sit on my 6% earned for the month and see but I might just put a order for the trade Friday anyways.", "id": "acdehq", "created_utc": 1546568950.0, "score": 12, "upvote_ratio": 0.7, "num_comments": 19, "comments": [{"body": "[deleted]", "score": 19, "replies": [{"body": "New to options, can you explain how OP is risking $459? I  thought buying options had little risk. ", "score": -13, "replies": [{"body": "$5 wide spread of which OP collected $0.41 equals $4.59. ", "score": 6, "replies": []}, {"body": "Oh no", "score": 15, "replies": []}, {"body": "Oh, my sweet, summer child.......", "score": 10, "replies": [{"body": "We get it, you watch Game of Thrones.", "score": 3, "replies": []}]}]}]}, {"body": "Famous last words:\n\n> I’ll double all the money I put towards credit spreads every year with VERY little risk.\n\nDo you realize the amount of risk you are taking with your strategy? You are risking ~460 to make ~30. In other words, if you lose one single time, it will wipe out 15 (FIFTEEN!) winners. In yet other words, one loss will mean 1.25 years of wasted effort and money. If you lose once *before* winning 15 times (which is more likely than only losing after winning 15 times), then not only you'll have wasted time and money, your account could get in a pretty bad shape.\n\n\"Double the money\" and \"very little risk\" aren't supposed to go together. Ever. If you think they do, then you are probably ignoring risks.\n\n\n", "score": 14, "replies": []}, {"body": "This is a strategy that can easily go wrong. You say \"VERY little risk\" but yet in a trade, you are risking $459 to collect $41 in premium....  \n\n\nSure the odds are low on losing the $459 but all it takes is that one odd time to wipe out 11 trades and I know the odds in a volatile market of something happening like this are greater than you may hope. There could be an unexpected buyout/merger, flash crash, dividend announcement, major news event, earnings reports etc all that can easily make you lose maximum loss on the trade.  \n\n\n  \nFor the future, I'm not saying this strategy can't work but please do more research on the company itself that you are going to use these spreads on and make sure you are up-to-date on macroeconomics events and their impact on the company's stock price.. ", "score": 12, "replies": [{"body": "Thanks for the info! Seriously. I’m actually hoping a trade goes the other way so that I can try and develop some kind of system (better than what I have) at minimizing loss.", "score": 1, "replies": []}]}, {"body": "Don’t expect to get 6% each month.", "score": 8, "replies": [{"body": "6% monthly is a huge return. It's pure gambling in my opinion.\n\nI would be very happy if I would get 1.6% monthly in a sustainable fashion.", "score": 2, "replies": [{"body": "Weekly covered calls/the wheel can achieve that 1.6% monthly long term. Only do it with stock you’re interested in holding for the long term as well.", "score": 1, "replies": []}]}]}, {"body": "Keep it up! I started selling premium with spreads on Dec 3rd and made 21% profit by dec 24th. Oh yeah and then the market went up 1000 points and I started to bleed my profit until I was down 50% lol. \n\nFinally today I was able to breakeven again to where I was on dec 3rd but lemme tell you, this volatile market anything can happen and I made sure I was risking less then my potential gain and still took a pretty hefty loss each day my trades didn’t work out.\n\nBe careful risking more for less potential profit, the market is too unpredictable.", "score": 5, "replies": []}, {"body": "A low probability of ruin is not a low risk. Low risk is risking a small amount of capital.  Unless 400 dollars is about .5% of your portfolio this is not low risk. And if it is, then why even do the trade for such a small amount?\n\nNo.\n\n", "score": 5, "replies": [{"body": "Ending with “No.” is not necessary. I agree with everything else though ", "score": 2, "replies": []}]}, {"body": "Great kid! Don't get cocky.", "score": 2, "replies": []}, {"body": "!remindme 2 months when OP loses all of his/her money", "score": 2, "replies": [{"body": "I will be messaging you on [**2019-03-04 14:26:17 UTC**](http://www.wolframalpha.com/input/?i=2019-03-04 14:26:17 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/options/comments/acdehq/first_trade_worked_6_in_3_days/)\n\n[**CLICK THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/options/comments/acdehq/first_trade_worked_6_in_3_days/]%0A%0ARemindMe!  2 months when OP loses all of his/her money) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! ed84kg9)\n\n_____\n\n|[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/)\n|-|-|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "don't forget, earnings are at the end of January -- IV is likely going to increase.  have you thought of having it expire before then?  earnings can also be such a gamble sometimes.", "score": 1, "replies": []}, {"body": "Placing a longer DTE spread (over 30 days) will actually be less risky than the previous spread (25 DTE) because of gamma risk.\n\nCongrats with TXN, I like the spread you have picked out for BA as well hope it goes well.", "score": 1, "replies": []}]}
{"title": "NFLX - How did it survive today's massacre??", "selftext": "Almost everything was down, yet this seemingly weak and super volatile stock manages to go up 1.32% in a semi orderly fashion. The obvious is that there's no exposure to China, but if things are getting worse there, they may spread and inevitably hit netflix and IMO the stock is overvalued as is.\n\nI hold options against and bought more when it was close to $275. What am I missing?", "id": "accom0", "created_utc": 1546564233.0, "score": 12, "upvote_ratio": 0.88, "num_comments": 12, "comments": [{"body": "NFLX had bird box blindfolds on.", "score": 30, "replies": []}, {"body": "Because when you are unemployed the only thing you'll be able to afford to do is Netflix and chill. ", "score": 13, "replies": [{"body": "Well... maybe just the first part", "score": 2, "replies": []}]}, {"body": "It's just one day. You can't read anything into that.", "score": 6, "replies": []}, {"body": "Leading the pack again nearly up 6% today.  So absurd", "score": 2, "replies": [{"body": "Sickening day for me! This stock is unreal", "score": 1, "replies": []}]}, {"body": "China ruins everything", "score": 1, "replies": []}, {"body": "So, something was obviously awry when this stock was up during a nearly 700 point dow plunge and then up 10% on Friday. In hindsight, maybe the movement against the market was a clear sign to abandon short options. \n\nhttps://www.cnbc.com/2019/01/04/goldman-says-netflix-is-one-of-its-favorite-trades-for-2019.html", "score": 1, "replies": []}, {"body": "The reasons you already said are major.  They are at fairly low risk to macros and put up great numbers.\n\nWhy would the spread of anything bad hit Netflix?   They are as secular as it gets, other than some debt risk.", "score": 1, "replies": [{"body": "Yet GOOG was way down. In fact, almost everything was, From REITs to health care and pharmacy stocks. I noticed Netflix in the green too, and wondered about it.", "score": 4, "replies": [{"body": "If iphone sales stink in China, that's probably bad for GOOG.  Real estate numbers are bad, health care and pharma are going to be a battle in the new mixed legislature, etc etc.\n\nI think Netflix has already been beaten to death and is actually relatively low risk compared to this terrifying recession / political stuff.\n\nI'm not saying any of it is right, but it at least makes sense to me.", "score": 3, "replies": [{"body": "Nike just reported great numbers from China. Apple Iphone sales are a product of them costing too much, and possibly China deciding to pressure people into buying something else to get back at Trump. None of it impacts GOOG which does not do any business with China. Housing is bad because of the tariffs on softwood lumber and the interest rate increases. Again, no impact on GOOG. Nothing is going to come out of the new mixed legislature because they won't agree on anything.", "score": 1, "replies": []}]}]}]}]}
{"title": "Is now the best time to buy apple stock", "selftext": "Is apple a good buy now ?", "id": "acdxtm", "created_utc": 1546572580.0, "score": 5, "upvote_ratio": 0.6, "num_comments": 18, "comments": [{"body": "This is I believe fifth such post on this tread in last 2 days... \nIf you are confident it is not going to drop lower and will go up in forceable future - sure, go for it ", "score": 12, "replies": []}, {"body": "It can go lower. It can also go up....if you’re keeping long term, just buy and average afterwards.", "score": 7, "replies": [{"body": "They’ve released models like the SE before to cater to the Asian market and people who want an inexpensive iPhone. They’re not gonna turn a blind eye to a 38% drop, so I’m expecting either cheaper models in October or a serious price drop long before that. ", "score": 3, "replies": [{"body": "They also need to leap ahead somehow, they need a new killer product that is a much have for everyone. Apple still has billions in cash for R&D, hopefully they spend it wisely and come up with something great.", "score": 1, "replies": []}]}]}, {"body": "How is anyone supposed to know that? And if they did know that, they probably would not share that vital bit of prescience with a random person on Reddit.\n\nLook at the company. Do you think they rely too heavily on one product? Are they innovating? How is their cloud business? Their content efforts? Is a dividend important to you or growth? What do analysts say? What does your gut say? \n\nHow will the current trade policies affect the market in the coming year or so? Are we going into a recession? Will the Fed pause rate hikes?\nWill we have a recession because everyone is afraid we are going to have a recession and they stop spending?  What about the yield curve?", "score": 8, "replies": [{"body": "YEAH, STOP YELLING AT HIM!", "score": 6, "replies": []}, {"body": "hotel? trivago", "score": 4, "replies": []}, {"body": "Stop yelling at me", "score": 2, "replies": [{"body": "[Brick Tamland](https://youtu.be/7pdWAcK6Eh8)\n", "score": 1, "replies": []}]}, {"body": "Estimated earnings just fell 8% and the stock fell by that much after hours yesterday.\n\nBut with China out of the picture their growth story is broken even though they have big earnings so you are seeing some PE destruction. It's going to take actual earnings growth to normalize the PE, I think.", "score": 1, "replies": []}]}, {"body": "Depends on your time frame. If you are willing to take some more losses in the next couple years and think it will go up in the long run (which I would agree with) then go for it. Just don't go in expecting it to automatically turn around and start going up ", "score": 2, "replies": []}, {"body": "Yes", "score": 3, "replies": [{"body": "All in. ", "score": 1, "replies": [{"body": "Good.  Best place to be.", "score": 1, "replies": []}]}]}, {"body": "No. More downside is coming.", "score": 4, "replies": []}, {"body": "If you are looking for a quick profit, it may not be the best time. If you are looking to hold for the long term I would say absolutely. ", "score": 2, "replies": []}, {"body": "Isn't apple always a good buy?  (If you're holding long-term)", "score": 1, "replies": []}, {"body": "Yes. Duh", "score": 1, "replies": []}]}
{"title": "Did the FED create the bull market ?", "selftext": "Did the FED create the bull ?\n\nhttps://realmoney.thestreet.com/investing/this-is-not-the-time-to-be-initiating-new-positions-in-equities-14824180", "id": "acc7oc", "created_utc": 1546561234.0, "score": 5, "upvote_ratio": 0.69, "num_comments": 12, "comments": [{"body": "\"So, by avoiding pullbacks, you can create above average returns. How do you see a pullback coming? Follow the bond market.\"\n\nAnd yet no hedge fund manager consistently generates above average returns.  I guess no one knows about this big secret?", "score": 4, "replies": []}, {"body": "I stopped reading when he said you can time the markets. I mean seriously, decades of data show otherwise but this random guy found the ONLY way? Why isn’t he rich then?", "score": 4, "replies": [{"body": "He's a time traveler who doesn't want to affect the flow of time by becoming rich now...", "score": 4, "replies": []}, {"body": "you sound ridiculous . He’s not saying he knows what the end of day quotes will show. He’s arguing that virtually all of the bull markets and bears have been telegraphed by the actions of the bond market and the fed. If you look at the stats on yield curve and recessions he’s not exactly wrong either.\n\nTiming the market cycle by cycle is possible. But hey if it’s easier to stop reading whenever you see something you disagree with, best of luck with that lol.", "score": 2, "replies": [{"body": "Correlation doesn’t prove causation. If the guy is so smart why isn’t he retired on a beach somewhere counting his money?\n\nGiven a long enough time horizon we can all predict the next market lol, it’ll be bear, then bull, then bear. See, easy!\n\nThe data does not support his thesis that you can time the market. ", "score": 1, "replies": [{"body": "I mean the way you are acting its almost as if hes trying to use your money to time the market ", "score": 1, "replies": [{"body": "Or y’know, maybe I just have little patience for idiots 😒😒", "score": 1, "replies": []}]}]}]}, {"body": "It's certainly possible to time the market, it's just a lot harder than he is making it out to be and the vast majority of retail investors will fail at doing it. So on average, it makes sense not to time the market, but if you're a great trader with the backing of large investment bank collecting all the economic data you need before it reaches plebs like us, then it might make sense to time it.", "score": 1, "replies": [{"body": "You’re joking right? Lol\n\nWait, there is one way to manipulate the market, fraud. That’s the only way. ", "score": 1, "replies": []}]}]}, {"body": "Well... the fed created a BUBBLE within a bull market. So when the reverse takes place, it also causes a crash.", "score": 1, "replies": []}, {"body": "Any market is big stacks bullying small stacks CMV", "score": 0, "replies": []}]}
{"title": "$AAPL is still way overbought on the RSI", "selftext": "what do you guys think is it over bought or a good buy", "id": "acfgmz", "created_utc": 1546583791.0, "score": 1, "upvote_ratio": 0.55, "num_comments": 11, "comments": [{"body": "It scares me how people solely rely on RSI to justify buying. That RSI has been saying buy for the past 2 months as Apple keeps tumbling. ", "score": 3, "replies": [{"body": "2 months lol \n\nRemember when GE was oversold for 2 years straight?", "score": 1, "replies": []}, {"body": "I don’t rely on the RSI for trades. I just load up on puts when I think it’s reasonable too. ", "score": 1, "replies": []}]}, {"body": "If you think we’re in a bear market, the saying goes: you don’t buy the drops, you short the pops. ", "score": 3, "replies": []}, {"body": "Their RSI is in the 30s. How is that overbought? If anything it is oversold. ", "score": 2, "replies": [{"body": "maybe on the 5min.. on the daily its well above 80 still and im reading a stoch RSI ", "score": 0, "replies": [{"body": "I don't see that at all. Not really sure how the stoch compares to the normal RSI. \n\nI'm see a RSI of 34 for the daily, and 28 for the weekly. Even the hourly is only 43.\n\nHow in the world would their RSI be even close to 80 being down almost 40% in the past 3 months, and down 20% in the past month?\n\n\nFinviz list their RSI as 34.\n\nhttps://finviz.com/quote.ashx?t=aapl", "score": 3, "replies": [{"body": "I see, the RSI isnt as accurate as the stoch RSI. that is why i use the stoch.. it would be hard to trade off just the RSI alone", "score": 0, "replies": [{"body": "Please explain to me the difference between the stoch RSi and normal RSI", "score": 1, "replies": [{"body": "Both the relative strength index (RSI) and stochastic oscillator are price momentum oscillators that are used to forecast market trends. Despite their similar objectives, they have very different underlying theories and methods. The stochastic oscillator is predicated on the assumption that closing prices should close near the same direction as the current trend. The RSI tracks overbought and oversold levels by measuring the velocity of price movements. More analysts use the RSI over the stochastic oscillator, but both are well-known and reputable technical indicators", "score": 1, "replies": []}]}]}]}]}]}, {"body": "There’s no such thing as overbought or oversold. RSI is an oscillator that should be used for divergence or failure swings in the “overbought” and “oversold” conditions ", "score": 1, "replies": []}]}
{"title": "Why do all stocks fall when 1 stock falls?", "selftext": "Or do they not?\nLike, when apple fell, all stocks fell. Apple probably had bigger losses but other stocks also fell. I would expect it to be the other way around. If apple falls by a huge numbers, that means a lot of people sold it, and now they should have money to\nInvest in other companies. But instead, all companies start falling. What’s the reason? ", "id": "acmxqm", "created_utc": 1546637569.0, "score": 1, "upvote_ratio": 0.56, "num_comments": 13, "comments": [{"body": "Apple is a major holding of most etfs. If apple falls etfs are forced to sell, which drops the price further and affect all the other etf holdings, so all the stocks fall . This is not super detailed/correct. Hope somebody here explains it further.", "score": 6, "replies": [{"body": "Market Cap Weighted ETFs (ie. S&P 500 ETFs) don't need to rebalance after price changes. They just need to own x% of every company in the index.", "score": 1, "replies": [{"body": "Thanks for this. I just wanted to give him/her a quick answer since nobody was responding.", "score": 1, "replies": []}]}]}, {"body": "It’s a number of reasons but one big one is it shows a slowdown in China, which is a big deal. If it was a slowdown in a smaller country it wouldn’t matter too much. ", "score": 1, "replies": [{"body": "This is the reason why AAPL fell, right? \nI’m wondering why the others followed and went red too. Thanks though! ", "score": 0, "replies": [{"body": "Companies with exposure to China are affected, and there’s a worry because of the intermingling of the US and Chinese economies that it would mean a slowdown in the US as well because of changing policies.\n\nThink of it like the canary in the coal mine giving a warning. Then today it was refuted by new data showing a strong US economy so thus the rebound.\n\nI think also that one would look at Apple’s Chinese warning as being more telling than the numbers their govt provides. ", "score": 1, "replies": []}, {"body": "Well it is pretty simple. If AAPL is reporting a slow down due to China demand, traders make the assumption that will be the case for a lot of other companies, not to mention AAPL suppliers, which is pretty obvious why they would go down with AAPL.", "score": 1, "replies": []}, {"body": "From what I understand AAPL fell because of the letter they sent of their even lower than expected sales. I think there might be a correction. But, lets see what happens.", "score": 1, "replies": []}]}]}, {"body": "Apple dropped because they said China is slowing. \n\nChina is slowing makes everything else drop too. ", "score": 1, "replies": [{"body": "The Apple situation is NOT just because of China slowing.\n\nIt is a bigger issue.   iPhone replacements are slowing everywhere and NOT just in China.", "score": 1, "replies": []}]}, {"body": "Ever see a flock of birds flying? Same thing. ", "score": 1, "replies": []}, {"body": "Many reasons:\n\n- it is a bear indicator. \n\n- it is a company that works together with many other companies.\n\n- China market slowdown affects all markets.\n\n- it indicates a slowdown in the highend tech sector.", "score": 1, "replies": []}, {"body": "Well this is certainly not true. Even in the case of Apple yesterday, not ALL stocks were down.", "score": 1, "replies": []}]}
{"title": "Tesla is now opening online design studio", "selftext": "", "id": "aci9rs", "created_utc": 1546609393.0, "score": 21, "upvote_ratio": 0.89, "num_comments": 19, "comments": [{"body": "So are reservations not a thing anymore? \n\nWill this strategy affect the Model Y should Tesla try to raise money via reservations again?", "score": 5, "replies": [{"body": "Tesla need to make the gap between announcing Model Y and being able to order and take delivery of a Model Y as short as possible. They don't want to make people who might buy a Model 3 wait for a Model Y.", "score": 11, "replies": [{"body": "True. But they also need to raise cash, and continue the growth story.\n\n(Would also be bad to announce the Y before the SR is out, probably a lot of bad press)", "score": 1, "replies": [{"body": "Will be interesting to see how much cash they need to raise for Model Y. If it's sharing the same chassis, battery pack, motors, computer, software, etc. as the Model 3 then it might not be that much. ", "score": 8, "replies": [{"body": "Either way that need a new factory. So lots", "score": 4, "replies": [{"body": "> need a new factory.\n\nOr just finish GF1.", "score": 8, "replies": [{"body": "Yeah. Would make a lot of sense to make Y at GF1. The batteries and drivetrains are already there.", "score": 2, "replies": []}]}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Yes, but they have a lot of debt to service.\n\nNot enough FCF to do both in the short term.", "score": 1, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Well 920mm due 3/19 or convert.\n\nAnother 520mm due 11/19 or convert\n\nThose are just the big ones I remember. So lots of debt this year, and that doesn’t include the wear-house line of credit and everything else.", "score": 6, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "They can’t convert them unless the price is above a certain limit. Not sure of the specifics, but it’s not as easy as “they can just pay with stock”.", "score": 5, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "Thanks for following up with this.\n\nI guess that’s why they said it’d be half cash half stock for the March debt.", "score": 1, "replies": []}]}]}, {"body": "Don't waste your time, fluff is a bear, he might be the gentlest one, usually, but he's still got his agenda to push.\n\nThanks for the thorough answers though. FCF should have increased dramatically in Q4 and it should continue to do so as they ramp further. Add to that they have plenty of cash on hand to pay off the debt as is and they're now profitable, it's a nothing burger.\n\nAs far as I'm aware they can't use the reservation money for anything. I think it's parked aside to accrue interest but that's it. Need someone with accounting knowledge to pitch in to confirm.", "score": -1, "replies": [{"body": "The reservations are not held in escrow, they can spend it as they want. But they are carried as liabilities on the books.\n\nAnd so what if I’m bearish, that doesn’t mean I have an agenda. ", "score": 5, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "I see you haven't been around here long enough 😉\n\nJust look at the wording of the initial post:\n\n>Will this strategy affect the Model Y should Tesla **try to raise money via reservations again**?\n\nIt implies Tesla is using reservations as a way to raise money to fund its programs which isn't their purpose. They're just a way to gauge consumer interest.\n\nAgreed on your analysis. But fluff knows this all too well.", "score": -1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "You're right. I'm being a bit oversensitive from the opposite side.\n\nI just know fluff is smart enough to know better than that and I don't like seeing people waste their time explaining something to someone that already knows the answer/isn't interested in the answer. Or in this case insinuate stuff.\n\nStill, thanks for your contributions, you come across as a balanced person which we need more here. I can get a bit over optimistic at times 😊", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"body": "No doubt. A lot, if not a majority of reservations holders had little benefit from reserving the 3. Model Y customers will see this and many will not bother reserving even if they are certain they are going to buy. I suspect Tesla may need to offer an incentive for reserving early if they want hundreds of thousands on the list. What that is, I don't know?", "score": 9, "replies": []}, {"body": "i plan on putting money down for the model Y", "score": 3, "replies": [{"body": "Same here.   The wife's car will just about need to be replaced when the Y comes available.   Once that happens we will be ICE free.    ", "score": 2, "replies": []}]}, {"body": "I would think while there is a backlog to fill, they'd prioritise deliveries to reservation holders ahead of the non-reservers.", "score": 1, "replies": []}]}]}
{"title": "i don't think aapl's doing too hot", "selftext": "[removed]", "id": "acc72s", "created_utc": 1546561156.0, "score": 11, "upvote_ratio": 0.71, "num_comments": 13, "comments": [{"body": "what was all that ", "score": 11, "replies": [{"body": "just🤧🤧 tryna do 👌my dd🤒🚫and chase 🧐 a mf bag💰cuz tha grind🧰 dnt stop🛑im on tha comeup💈just ride ⛷my mf wave🌊🌊", "score": 2, "replies": []}]}, {"body": "Wow, Drudge report, you are truly a grand dragon autist.", "score": 4, "replies": []}, {"body": "Ashley Madison is still doing their thing after getting completely pwned by hackers? That's impressive.", "score": 4, "replies": [{"body": "That's the only thing that surprised me more than the lack of gay porn tbh..", "score": 3, "replies": []}]}, {"body": "Omfg this sub never fails to entertain lol ", "score": 7, "replies": []}, {"body": "No GF, no money, using safari, can't crop a screen record, using Google to check stocks, using 'adultfriendfinder', misspelled pornhub, too pussy to check porn on non private browser.\n\nJoseph (who I can only assume is your horrendously disappointed father) is gonna whoop your ass.", "score": 3, "replies": []}, {"body": "Son get off of Reddit", "score": 3, "replies": [{"body": "Agreed this place will ruin his libido. ", "score": 3, "replies": []}]}, {"body": "Nice post bud....... Cooked s'mores over chimney cleaning log 😂", "score": 1, "replies": [{"body": "deadass 🙇‍♂️🙇‍♂️", "score": 1, "replies": []}]}, {"body": "Your autisim spectrum is off charts", "score": 0, "replies": []}, {"body": "Username checks out", "score": -1, "replies": []}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "accagv", "created_utc": 1546561757.0, "score": 227, "upvote_ratio": 0.97, "num_comments": 16, "comments": [{"body": "PPT bois", "score": 20, "replies": []}, {"body": "Where's Nic Cage when you need him?", "score": 13, "replies": [{"body": "Stealing the declaration of independence ", "score": 14, "replies": []}, {"body": "Kidnapping the President of the United States", "score": 4, "replies": []}, {"body": "Turning down a role. No...wait, I meant ‘turning down a dinner roll.’", "score": 1, "replies": []}]}, {"body": "This is the content that I come to this sub to see.  ", "score": 10, "replies": [{"body": "Glad I could fulfill your r/wsb addiction", "score": 5, "replies": [{"body": "you are a gentleman and a scholar, sir.", "score": 3, "replies": []}]}]}, {"body": "Jews", "score": 16, "replies": [{"body": "not the reptiles?", "score": 3, "replies": [{"body": "Tomatoes - Toma'toes", "score": 2, "replies": []}, {"body": "Nah Rick Scott has his hands full as a Senator^^^God ^^^damnit", "score": 1, "replies": []}]}, {"body": "lol...", "score": 2, "replies": []}]}, {"body": "This revelation has completely changed the way that I trade.", "score": 4, "replies": []}, {"body": "Confirmed ", "score": 5, "replies": []}, {"body": "I'm 39 and that's deep", "score": 0, "replies": []}]}
{"title": "TSLA outsells BMW and LEXUS. Also, Grimes is a B-list celebrity", "selftext": "", "id": "acdm3z", "created_utc": 1546570364.0, "score": 23, "upvote_ratio": 0.9, "num_comments": 9, "comments": [{"body": "C list? Didn't even know she existed before she started dating Elon ", "score": 11, "replies": []}, {"body": "Def not B-list.", "score": 12, "replies": [{"body": "That’s what I said ", "score": 3, "replies": [{"body": "B list because of Elon otherwise C at best ", "score": 7, "replies": []}]}]}, {"body": "They’re also failing to deliver sales of their used models to customers. They’re just cranking out new cars to pump those sales up. \n\nhttps://youtu.be/H8ro6kpKlw0\n\nSo many complaints in the comments", "score": 2, "replies": []}, {"body": "So did tesla make any sort of profit in 2018??", "score": 1, "replies": []}, {"body": "the article is full of errors", "score": 1, "replies": []}, {"body": "The pansexual goblin?", "score": 1, "replies": []}, {"body": "My TSLA calls were -47% today . I hope this article makes it +200% tomorrow.", "score": -1, "replies": []}]}
{"title": "Why did the news outlets wait until the market generational bottomed to deliver the bad news about AAPL?", "selftext": "", "id": "acen5n", "created_utc": 1546577522.0, "score": 3, "upvote_ratio": 0.8, "num_comments": 12, "comments": [{"body": "You don’t know about the jfk files do u", "score": 6, "replies": [{"body": "I am still waiting for the rest to be released. You don't know JACK Ruby about what I know. ", "score": 3, "replies": [{"body": "I know that I jerked off to you jerking your mom off last night ", "score": 0, "replies": [{"body": "That makes no sense. You should reword", "score": 2, "replies": [{"body": "No u ", "score": 0, "replies": [{"body": "JF no WaY", "score": 2, "replies": [{"body": "Fag", "score": 0, "replies": [{"body": "How am I a fag if I am Bullish?\n\nhttps://en.m.wikipedia.org/wiki/Bear_(gay_culture)", "score": 1, "replies": [{"body": "Lol what the fuck ", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "Completely off topic, but I just went out and bought airpods and 2 apple watch serie 4s. So please go out and make a donation to Apple so we all don't end up on a bridge to commit end life. \n\nThanks. ", "score": 1, "replies": [{"body": "If Apple can plot planned obsolescence, why can't we?  LoL. \n\nIn reality, Apple nor the public has anything to worry about. The problem is the news exaggerating ever little thing into the end of the world. ", "score": 1, "replies": [{"body": "Like I always say: News gonna be news. ", "score": 1, "replies": []}]}]}]}
{"title": "Classic group of autists... It's basic algebra! $AAPL to the moon, parabola style 😎. Load up on calls bois.", "selftext": "", "id": "acezmh", "created_utc": 1546580073.0, "score": 55, "upvote_ratio": 0.9, "num_comments": 15, "comments": [{"body": "Y= x^2 +3\n\nIm so good at this. Goldman hire me", "score": 37, "replies": [{"body": "Nah it’d be y= (x-3)^2  since it’s a horizontal shift.  ", "score": 23, "replies": [{"body": "Oof", "score": 3, "replies": []}]}]}, {"body": "Fight me https://i.imgur.com/2BFNXnS.jpg ", "score": 10, "replies": [{"body": "Clearly it is swing like a pendulum though, so after going down it must go up", "score": 1, "replies": []}]}, {"body": "It's a gravity assisted slingshot to the moon", "score": 4, "replies": []}, {"body": "The problem is that AAPL won’t be earning $3.89 this quarter. The stock has fallen because growth is slowing ", "score": 2, "replies": [{"body": "That shit is going to crash and burn. There's no more Steve to save their mediocre asses. Apple is done. \n\nIf I had the money to spare I would be buying puts of that shit like there's no tomorrow", "score": -1, "replies": [{"body": "Little late on that", "score": 3, "replies": []}, {"body": "Like you don't already have them!", "score": 0, "replies": []}]}]}, {"body": "Rubber band theory of economics", "score": 1, "replies": []}, {"body": "Peyronie's disease right here", "score": 1, "replies": []}, {"body": "Pretty sure that's geometry but whatevs ", "score": 1, "replies": [{"body": "Thought it was algebra, but I am on this sub, so i'm autistic. ", "score": 1, "replies": []}]}, {"body": "This is basically TA.", "score": 0, "replies": []}]}
{"title": "Massive 312,000 Job Gain Casts Doubt On Gloom; Dow Jones Set To Rally", "selftext": "[removed]", "id": "acib2r", "created_utc": 1546609638.0, "score": 18, "upvote_ratio": 0.95, "num_comments": 9, "comments": [{"body": "More rate hikes", "score": 13, "replies": [{"body": "isnt Powell doing something today 🤔", "score": 2, "replies": []}]}, {"body": "Slave gains are profitable, minimum wage employees will hold this economy up like usual.", "score": -1, "replies": [{"body": "[deleted]", "score": 4, "replies": [{"body": "Yea thats true should of said low wage.", "score": 1, "replies": []}]}]}, {"body": "Seasonal jobs lmao", "score": -12, "replies": [{"body": "Every Fucking job is seasonal then", "score": 9, "replies": [{"body": "🐻 hunting season", "score": 2, "replies": []}]}, {"body": "[deleted]", "score": 15, "replies": [{"body": "its okay\n\nhes on the left side of the initial spike of the dunning kruger curve\n", "score": 1, "replies": []}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "ackbp1", "created_utc": 1546622591.0, "score": 4, "upvote_ratio": 0.7, "num_comments": 11, "comments": [{"body": "A gain is a gain is a gain. If you made a gain and sold, then who gives a shit what happens after? You'll drive yourself crazy with the \"what could have happened\" mindset. ", "score": 11, "replies": []}, {"body": "Hey I was there yesterday with my SPY puts.  I got alot of support from people.    /u/Insomniac7 told me \" Country Clubs are full of people who sold too early. But no one who sold too late. You are good\"  and that really resonated with me.  Sure it sucks to leave money on the table, but a win is a win.", "score": 5, "replies": []}, {"body": "i sold amd puts i bought wednesday thursday morning at 10 :(\n\n&#x200B;\n\ni  **feel**  you", "score": 3, "replies": []}, {"body": "I'm holding my calls for the 11th and the 18th for a little while longer. Hoping to peak 300%, Currently at +98%", "score": 1, "replies": [{"body": "Bought a call yesterday that expires today for that 300% gain. Wish I wasn't poor so I could have afforded to buy more ", "score": 1, "replies": [{"body": "I ended up selling half my shares in the dip to afford everything I bought. ", "score": 2, "replies": []}]}]}, {"body": "Hold til CES ", "score": 1, "replies": []}, {"body": "Sadn’t not", "score": 1, "replies": []}, {"body": "Did you vomit", "score": 1, "replies": []}, {"body": "I sold my 1/18 $19 C at .66 today, missed out majorly ", "score": 1, "replies": []}, {"body": "Same. Sold my 17.5 calls at 11 haha", "score": 1, "replies": []}]}
{"title": "u/potatorader let us see your portfolio (110k in tesla puts)", "selftext": "Loss porn pls ", "id": "aclqlp", "created_utc": 1546630624.0, "score": 23, "upvote_ratio": 0.82, "num_comments": 13, "comments": [{"body": "He’s in the long game for this", "score": 15, "replies": [{"body": "Exactly right, these macro trends don't phase me much.", "score": 18, "replies": [{"body": "Mind if I ask what your original starting acct balance was? ", "score": 1, "replies": [{"body": "0$", "score": 11, "replies": [{"body": "Hehe", "score": 2, "replies": []}]}]}]}, {"body": "Yee, I just wanna see what his 110k looks like today ", "score": 2, "replies": [{"body": "What $110k?", "score": 11, "replies": []}]}]}, {"body": "Just imagine you paid $50K for a red theme.", "score": 10, "replies": []}, {"body": "Prolly looks a lot like 55k", "score": 5, "replies": []}, {"body": "/u/potatorader [raider](https://youtu.be/_Ntxb6MnmJA)", "score": 2, "replies": [{"body": "he dead", "score": 2, "replies": []}]}, {"body": "110k is nothing.  I want to see the guy who bought 86M in baba puts before today.", "score": 2, "replies": []}, {"body": "You know his portfolio gains were realized, right? ", "score": 1, "replies": []}]}
{"title": "DD: Apple move to manufacture in India is to avoid HIGH India import tariffs on iPhone. Did you know the 64 GB XS iPhone costs $1,430? Yes, that's just the base 64 GB model. Once Apple starts producing in India, it can more easily capitalize on the HUGE India smartphone market.", "selftext": "[deleted]", "id": "acmf44", "created_utc": 1546634588.0, "score": 19, "upvote_ratio": 0.77, "num_comments": 16, "comments": [{"body": "A lot of people in India are lucky to even make $1,430/year. ", "score": 18, "replies": [{"body": "So what they can only afford one iPhone per year? That's still pretty good sales numbers ", "score": 2, "replies": [{"body": "I think you’re forgetting about food and rent and children. People in India don’t save up all of their income for a year to buy a phone once per year. Do you spend $50k/year on your iPhone?", "score": 1, "replies": [{"body": "It was a joke pal and no I don't because I'm not an iPhone fag", "score": 1, "replies": []}, {"body": "Woosh ", "score": 1, "replies": []}]}]}]}, {"body": "But indian love Chinese cheap phone tho. ", "score": 15, "replies": [{"body": "Exactly. We gotta make a cheap $250 LCD for India. ", "score": 6, "replies": [{"body": "Yeah , but Tim Tim is not making one tho.", "score": 6, "replies": [{"body": "He's getting rid of that big 20% tariff by moving factories into India though. \n\nSo it's not a cheaper phone per se, but it's $300 to $400 off iPhone prices. Not insignificant. ", "score": 4, "replies": []}]}]}]}, {"body": "Isn’t Xiaomi there and their phones are amazing?\n\nLike 400 bucks for a phone that is better than the iPhone X?\n\nTheir Pocophone F1 128 GB is $340 with I believe better specs.\n\nEdit - confirmed ", "score": 7, "replies": []}, {"body": "Indian import tariffs are a fucking joke.", "score": 3, "replies": []}, {"body": "If their fag CEO had any vision they’d make iToilets instead", "score": 3, "replies": []}, {"body": "In India, you are made fun of for using AAPL products. ", "score": 1, "replies": [{"body": "The point is producing them in another country.", "score": 2, "replies": []}]}, {"body": "64 GB XS costs $1,430 in India****** with the 20% import tariffs. But not anymore once we get production going in India. India people are not wealthy, so we need a cheap-ass iPhone to capitalize on that market. \n\nThis is not investment advice BUT....buy the fuck outta Apple XD", "score": -1, "replies": []}]}
{"title": "If this is a turnaround for the market (long or short term) BUY PM CALLS", "selftext": "PM has been beat to dogshit. They were dragged down by the market as a whole alongside everything else, but also got beat down big time by a rumor from November from the FDA about banning menthol in cigarettes. I bought calls on them midway through today and they ended at 45% profit, today is a good example of how they're going to perform if we have a few strong green days. Cigarettes arent going anywhere in international markets, the chinese and japanese smoke like chimneys.\n\ntl;dr: BUY PM UPPIES", "id": "acn1v1", "created_utc": 1546638243.0, "score": 7, "upvote_ratio": 0.74, "num_comments": 14, "comments": [{"body": "[deleted]", "score": 6, "replies": [{"body": "I'm just gonna buy calls on them instead of DIA or QQQ when we have green days/weeks.", "score": 2, "replies": []}]}, {"body": "If were green Monday AM - I'm loading up on the Feb 23 $71 Calls", "score": 2, "replies": [{"body": "Those should easily be ITM", "score": 1, "replies": []}, {"body": "I’m looking out further...very inexpensive calls into 2020", "score": 1, "replies": []}]}, {"body": "What is your opinion on MO. Or is PM the better buy in the market today?", "score": 2, "replies": [{"body": "PM", "score": 1, "replies": []}, {"body": "MO option volume is considerably better.  Idk how they are affected by the recent acquisitions though...", "score": 1, "replies": []}]}, {"body": "PM OR MO?", "score": 1, "replies": [{"body": "PM", "score": 1, "replies": []}]}, {"body": "What does China smoke?  All the factory workers are out of work puffing on something!!", "score": 1, "replies": []}, {"body": "Visa calls or gtfo", "score": 0, "replies": [{"body": "Sell covered calls", "score": 1, "replies": [{"body": "Ain't got the cash for more than 2 contracts, waste of time", "score": 0, "replies": []}]}]}, {"body": "It wasn’t a rumor, it’s going to happen. FDA going to drop the hammer on big tobacco. \n\n#Short Big Tobacco  ", "score": -1, "replies": []}]}
{"title": "OK rt what is the VIX really?", "selftext": "[removed]", "id": "acnfy1", "created_utc": 1546640575.0, "score": 1, "upvote_ratio": 1.0, "num_comments": 18, "comments": [{"body": "How is the VIX calculated? ", "score": 1, "replies": [{"body": "Prices of S&P options with real spreads are aggregated. But the weight comes from the markets perception of their probability of hitting strike. ", "score": 3, "replies": [{"body": "OP deleted so I can't continue stepping through this.  Anyway, he didn't know what the VIX is intended to be a measure of. ", "score": 1, "replies": [{"body": "My mistake. Thought it was honest question. ", "score": 1, "replies": [{"body": "All good.  All readers benefit from stepping through the process.  Doesn't matter who is in the convo ", "score": 1, "replies": []}]}]}]}]}, {"body": "It’s not so much a measure of straight volatility as it is like a ‘fear gauge’ that moves up when spreads across a lot of OTM options widen.\n\nAnd yes there’s a whole bunch of shit I’m leaving out and it is prone to manipulation as well but idk look it up if you really need to know more. Tl:dr it’s only somewhat related to actual volatility in a statistical sense", "score": 1, "replies": [{"body": "How does width of spreads affect the calculation? ", "score": 1, "replies": [{"body": "It uh...just does, which is part of why it’s easy to manipulate.\n\nSeriously there’s stuff out there that goes through the math but I have an MBA and my eyes went crossed after 30 seconds of looking at it. You don’t need to understand how it’s derived to understand how/why it moves and how it can affect your trades.", "score": 1, "replies": [{"body": "No, it really doesn't.  Mid point is used.  It's right there in the formula. How you gonna be best bid at 0.01 in something worth 0.40?  You gonna sell your way through crazy size in a short dated option?  May as well just wire people cash.  Manipulation of the VIX, particularly into futures settlement, is pretty well documented.  But it ain't about spread width.\n\nI started an MBA too, but dropped it to focus on stats.  Much more useful.\n\nPeople who trade vol products long term do understand how the VIX value is determined. Everyone else has redistributed their wealth. Often multiple times. ", "score": 1, "replies": [{"body": "It’s easy to manipulate the mid if you’re a market maker sitting on both sides. Look at what SPX option spreads do when they’re really close to expiry. Guarantee you few if any trading vol can write the derivation down from memory. You can drive a car without being able to build an engine. ", "score": 1, "replies": [{"body": "Which S&P 500 stock has a single market market and no HFT activity?\n\nBut let's play pretend.  Fair value for an option is 0.40 and you want it marked lower and are quoting it 0.05/0.50.  I bid 0.20 x 10,000.  You gonna give that bid? I come back 0.15 bid in 20k.  You gonna give that too?  Others see this activity and sizable bids are now layered up to 0.25.  If you already have infinite money, you don't need to be a market maker.  Market makers cannot take infinite risk. \n\nDon't need to be able to write down the formula from memory.  Do need to understand it.  Driving a car is a terrible analogy. ", "score": 1, "replies": [{"body": "Just talking about SPX options which are what go into VIX. If you have a contract like 20 points ITM very near expiry, it’s not uncommon to see a spread on it of like 15 /23. Strikes me as market maker fuckery.\n\nHaving been stupid enough to baghold some way OTM stuff, many times I’ve seen an option with bid/ask of say .15/.25 suddenly go to 0 / 5 during something like a Fed announcement and show a mid of 2.5. A few minutes later it’s back where it was. Also strikes me as some kinda fuckery as there’s no transactions happening but it would, if done widely enough, have an effect on VIX.\n\nAll I said or claimed to know was that spreads are wide when VIX is high, and that VIX doesn’t reflect pure volatility in a statistical sense. Is that wrong?", "score": 1, "replies": [{"body": "You stated explicitly that width of spreads affects the VIX.  It just doesn't. \n\nITM options are completely ignored for determining the VIX. \n\nRemember that if somehow someone can properly fuck around with the vol of SPX options, this creates a fantastic arbitrage opportunity.\n\nWorking limit orders is also selling optionality.  Whatever the instrument.  So going into the Fed or data event, you will charge more for that optionality by widening the market. This is extremely rational or has nothing to do with MM fuckery. ", "score": 1, "replies": [{"body": "To some degree, yes. But when it results in the mid price of an option spiking 10x that’s hard to see as rational, unless the intention is just to shut down any transactions during a certain interval by yanking the bid and making the ask ridiculous.\n\nSo wide spreads are a product, not a cause, of high VIX? Can you explain why? Genuinely interested. I know I could google stuff but I don’t feel like a white paper right now.", "score": 1, "replies": [{"body": "We are hitting the point where it gets complicated.  Defo on the quant side of the bridge. \n\nIf trying to reduce this to the single most important factor, I imagine it will be vol of vol (gamma of gamma, or 4th moment). If you want to avoid the hardcore, you can get away with browsing white papers analysing bid-ask spreads and just hit up the abstract and conclusion.  Then, if anything is super interesting, have a proper read later. This is deeply complex stuff which seems to keep away the dirty casuals. \n\nThis isn't 1976 where floor traders can use \"good enough\" heuristics to price assets and manage risk.  This is the time of mature quants where there are few secrets and a great deal has been explored. Eventually, the problem becomes one of model-dependency and parameterization.  To price things better than the next guy, you have to first understand how he is pricing it. ", "score": 1, "replies": [{"body": "I like you", "score": 1, "replies": []}]}]}]}]}]}]}]}]}]}]}, {"body": "Think of it more as a temperature gauge for fear. There's a slew of studies but for the gist of it? Basically put it on your watchlist (as well as SPY or whichever other you like) and look at the trend. Vix up Spy down (usually, the correlation varies) and vice versa. Vix up bear vix down bull.", "score": 1, "replies": []}]}
