{"title": "More info on $AMZN class action lawsuit re fake eclipse glasses", "selftext": "http://nypost.com/2017/08/31/amazon-hit-with-class-action-suit-over-fake-eclipse-glasses/\n\nAbbott Law Group is trying to start the class.  They had successful class action suits against leaky breast implant makers, against TurboTax for it's data breach, and against J&J for talcum powder cancer suits.  Some of the J&J lawsuit awards have been massive.", "id": "6xeira", "created_utc": 1504272594.0, "score": 113, "upvote_ratio": 0.89, "num_comments": 100, "comments": [{"body": "I work with with a company that wholesales to Amazon. To get a fidget spinner approved, you need to submit safety testing documents that need to be approved by them to list your product. Surprised they didn't require safety testing for these glasses. Pretty big fuck up on their part.  To call out the top poster on here\n\n>We can't have both cheap prices + fast delivery and expect everything to be 100% perfect. \n\nIs just bullshit, the third party sellers have the responsibility or they don't get listed. This statement is completely bullshit and false. There's thousands of sellers on Amazon and they've had years to update with safety information and have it tested. It's fault on both ends, but not consumer. Takes like weeks to get something fulfilled by Amazon. This guy is talking out his ass.   No dangerous precedent. The danger was the guys eyes.  ", "score": 9, "replies": []}, {"body": "Really don't like this. Even if Amazon did vet the sellers, they can't vet every single product that they put out. \n\nWe can't have both cheap prices + fast delivery and expect everything to be 100% perfect. \n\nIt's unfortunate it happened, but consumers need to understand that they need to check the products as well. \n\nThis sets a dangerous precedent where if everything needs to be verified it will drive up the cost of products and everyone will complain about that too. ", "score": 61, "replies": [{"body": "IMHO Amazon has a counterfeiting problem it doesn't like to address.  In this case, people have damaged eyes so it is a big deal.\n\nRemember, you are talking about soulless business people in China who counterfeit baby formula, causing infant deaths, to make a quick buck.\n\nhttps://en.wikipedia.org/wiki/2008_Chinese_milk_scandal\n\n", "score": 86, "replies": [{"body": "Hopefully this will cause Amazon to turn around and fuck the counterfeiters.", "score": 13, "replies": [{"body": "I just returned some counterfeit clothes the other day, it's hard to trust no name sellers.", "score": 6, "replies": []}]}, {"body": "Don't forget the time Bayer knowingly sold HIV tainted pills in europe and 3rd world countries. A few execs in france got in trouble but of course no big wigs in America got touched.", "score": 3, "replies": []}]}, {"body": ">  it will drive up the cost of products\n\nIt's a drop in the bucket. Amazon has 80 million prime subscribers in the US that are willing to pay $100 a year to shop. They spend on average $1300 a year on Amazon. They don't pay the premium just for the free shipping. It's incredibly costly, maybe deadly, if consumers lose trust in the quality of products on Amazon.", "score": 18, "replies": [{"body": "I actually only paid for the shipping. I didnt even realize I had access to all the movies and music and stuff haha. ", "score": 7, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "[removed]", "score": 3, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "[removed]", "score": 4, "replies": [{"body": "[removed]", "score": 9, "replies": []}]}]}]}]}]}]}]}]}, {"body": "This could potentially turn from a minor lawsuit that costs them a few million to one that has a severe impact on future retail revenue, if the courts recognize that Amazon is continuing to peddle unsafe and/or counterfeit items, like they have been caught doing in the past.\n\nJust last December Apple found that Amazon wasnt vetting their Apple accessory distributor, and like 80% of all Apple cables sold and shipped by Amazon were fakes", "score": 4, "replies": [{"body": "Were the cables being sold under the \"Amazon basics\" name? If so & the glasses weren't then it's kind of a different case. ", "score": -2, "replies": []}]}, {"body": "How am I supposed to know that my UV blocking eclipse viewers work? Am I supposed to buy a UV detector? How am I supposed to know that that detector works? Or how about instead of expecting millions of consumers to check every product they own for safety a central third party--like Amazon--does it instead. Your statement that \"if everything needs to be verified it will drive up the cost of products\" doesn't make sense because you're arguing for the course of action that will require the largest number of verifications. ", "score": 8, "replies": []}, {"body": "It's a safety issue and you can't reasonably expect all consumers to do the research.", "score": 6, "replies": [{"body": "Bull.\n\nI looked at Amazon for eclipse glasses and saw what seemed like literal tons of them. I didn't trust the sellers (another problem Amazon has, IMO) to be truthful so I bought my solar glasses from Explore Scientific on a recommendation from (I think) Space.com.\n\nThese are our eyes we're discussing; it's on the consumer (at least partially) to make sure they're not buying a harmful product.\n\nThe real people that need sued are the entities that sold the unsafe glasses but said they were safe.", "score": 6, "replies": [{"body": "The average Amazon customer just clicks and buys stuff, they know how to read but not how to identify scams very well. I looked at the eclipse glasses on Amazon, didn't trust the listings, and bought from a more reputable vendor after doing research on the correct glasses to buy. And as others have pointed out, good luck going after shady Chinese companies. But yes, both should be sued.", "score": 3, "replies": []}]}]}, {"body": "Too big to fail?\n\nEdit:  Okay, that was flippant, but serious question:  If this were a mom and pop shop selling something dangerous, we'd be banging on their counter right now.  Or even a chain with a finite supplier list -- we'd hold them responsible for what they are selling on the store grounds.  But the argument here is that Amazon can't possibly keep up with all of the suppliers, so they get a pass?", "score": 5, "replies": [{"body": "> If this were a mom and pop shop selling something dangerous, we'd be banging on their counter right now. \n\nNo, we'd go after the manufacturer of the dangerous product.  See:  \nJ&J Talc suits.  No stores were sued.  Still sold in thousands of stores.\nCar defects  - the manufacturers are sued and pay for recalls, not the dealers or mechanic shops.  \nTobacco - Sold everywhere, but the manufacturers paid the suits and settlements  \nLawn mowers - ditto  \nTable saws - ditto  \nAesbestos - ditto  \n\nNeed I go on?", "score": 9, "replies": []}]}, {"body": "\"We can't expect cheap products and fast delivery and everything to be perfect\"\n\nWhat the actual fuck?", "score": 4, "replies": [{"body": "I understand that we disagree here - but here's my sentiment - consumers can't just buy things without doing some research as well, there are reviews, there is google, etc. \n\n\nWhile companies SHOULD always provide legit products, the advent of a marketplace (which Amazon is) means that some shit products will make it through. \n\n\nConsumers should bitch and whine about every little thing. They need to do research and really understand what they are buying. I'm not excusing Amazon, but there's also due diligence that needs to be done from the buyer end. ", "score": 1, "replies": []}, {"body": "Seriously, these are people EYEBALLS they're playing with. Their vision....", "score": 0, "replies": []}]}, {"body": "They absolutely do verify each product for beauty categories and anything edible or for personal skin care, etc. \n\nThey were way too lax on not verifying all invoices of FBA shipments for the Eclipse and that's why they're being sued.\n\nLook up the process before you speak on it. ", "score": 1, "replies": []}, {"body": "Are you kidding? If they didn't have time to fully vet a product and vendor then Amazon has no business operating a retail marketplace.", "score": 1, "replies": []}]}, {"body": "https://www.usatoday.com/story/money/nation-now/2017/08/21/jury-awards-417-m-lawsuit-linking-talcum-powder-cancer/587731001/\n\n$417 Million award will be challenged by J&J of course.", "score": 3, "replies": [{"body": "Even more interesting is it doesn't seem to have really affected JNJ stock at all.    Guess that goes to show how strong of a company it is.  The 5 biggest payouts from that law suit totalled $724 million.  And there were 4800 law suits total.  Crazy\n\nThe sad part is.. a lot of these people claiming that JNJ's powder is THE reason they got cancer are probably wrong, lying or for some other reason just trying to milk money out of the company.  It's easy for anyone who has had ovarian cancer to say \"yeah sure I used talc down there, pay me\" and there's no way to disprove them.", "score": 2, "replies": [{"body": "Someone said that asbestos and talc are often found near each other in mines and speculated that contaminated talc could be the true source of these cancers.\n\nJNJ is a monster so it will be fine.", "score": 2, "replies": []}]}]}, {"body": "This needs to be dealt with once and for all. Massive law suit, huge fines...\nOnline retail and shipping is becoming bigger and bigger. If it's not taken care of now it will escalate. Buy a iPhone.. fake one. Pc....\nAmazon and eBay have this problem.\nWhen purchasing. If I see that the item is located in Asia, I look for a other seller.\nBanning and fines need to be given on a bigger scale.   \nMaybe 3 party verification. Specially for eBay. You want to sell iPhones? Prove where you get them. \nDown the road, you switch and the truth comes out! Banned and finned. Start asking higher fees, at the end of the year, if all is well you get a part back. \nI started using eBay years ago. 5 minutes I had my order. Now it takes longer because I have to sort through the crap", "score": 3, "replies": []}, {"body": "It is well known fact that Amazon is lenient to counterfeiters to make quick bucks. Hopefully they will learn the lesson now.", "score": 3, "replies": []}, {"body": "I have to say, if Amazon is responsible for selling faulty eclipse glasses, where do you draw the line. It would put them out of business. Unless they were noticed that the glasses were defective prior to sale and did not pull them from their Internet shelves, how can they be held accountable? \nEDIT: I would agree with other posters that if Amazon knew or should have know that the glasses were defective, there should be some accountability...especially dealing with eyes and knowing the consumer is going to buy. ", "score": 12, "replies": [{"body": "They DO HAVE serious vetting for certain categories, the issue is they do not have one here. ", "score": 2, "replies": [{"body": "It's interesting. When I first started to read about eclipse glasses being sold on-line, my first thought was, \"Well, are they going to be safe?\". The act of looking at the eclipse is very well know to present potential for eye damage. Suddenly all these glasses are popping up. Amazon, being the behemoth they are, must have know that they had some degree of responsibility to vet the eye eclipse glasses they were putting on line. I guess their lawyer's argument might be that they are just a conduit and can't be held responsible for every product they put on their Internet-shelves.  But like any brick-and-motar, you can't just be blindly putting dangerous products on your shelves for general consumption without some degree of due diligence and potential responsibility. ", "score": 1, "replies": []}]}, {"body": "You draw the line at permanent eye damage. Pretty easy line to draw.\n\nAnd it was obvious that many of these glasses were questionable. Many were being sold by shadow chinese companies.  Amazon should have know better to sell only glasses coming from reputable companies.", "score": 7, "replies": [{"body": "I would agree that if Amazon knew the glasses were defective, they should be held accountable....", "score": 3, "replies": [{"body": "If Amazon didn't know, they were negligent at the very least. Merits some kind of punishment weather it was intentional or not.", "score": 1, "replies": [{"body": "I hear you. THEY should have known, right...", "score": 1, "replies": []}]}]}, {"body": "Right, but if you have permanent eye damage, how are you supposed to see the line?", "score": -2, "replies": []}]}, {"body": "The line should be drawn at consumer safety.  Staring at the sun will damage your eyes.  Grabbing a hot tray from your oven will burn your hands.  So, imagine instead Amazon had sold a bunch of defective oven mitts.  The issue here is compounded, however, because sunlight damage to the eye is going to be permanent whereas a burn on your hand will heal.", "score": 3, "replies": [{"body": "The point is that Amazon is merely the retailer and not the manufacturer.  Shouldn't this responsibility lie on the manufacturer who falsely claimed certain safety standards were met, or is Amazon merely a pretty target because they have more money?", "score": 20, "replies": [{"body": "The thing is, Amazon is actively poaching Chinese manufacturers to put their items on Amazon instead of alibaba sites and ebay.\n\nI think the maximum liability insurance Amazon requires is $1 million per seller. So what happens in cases like this where you have way more than $1 million worth of damages? You cant sue the chinese manufacturers, because they will disappear. In B&M retail, the liability is shared depending on the issue.\n\nThis lawsuit isnt really about eclipse glasses, but that Amazon is essentially an importer, distributor, and retailer, all in one, and makes transactions with faceless Chinese manufacturers, so the liability falls on Amazon.", "score": 13, "replies": []}, {"body": "The manufacturers don't have as much money as AMZN so it may not give incentive for a law firm to go after the little, lesser paying fish.", "score": 2, "replies": [{"body": "Mostly the manufacturers are mystery companies in China where these laws basically don't apply.", "score": 4, "replies": [{"body": "That's never stopped lawyers from trying.", "score": -1, "replies": [{"body": "But it does stop them from succeeding.", "score": 4, "replies": []}]}]}, {"body": "Exactly, that doesn't mean they should be on the hook though.  ", "score": 1, "replies": []}]}, {"body": "Feels like we're 1Ls", "score": 1, "replies": []}, {"body": "IDK but with all the bashing Bezo's WaPo does on Trump, I'm shocked no one in his administration hasn't gotten the Consumer Protection bureaus to launch an investigation. ", "score": 1, "replies": [{"body": "He'd have to give them money first. ", "score": 5, "replies": []}]}, {"body": "1. The manufacturers are all in China and it would be impossible\n\n2. Amazon isnt so much the retailer as they are the middleman. Amazon didnt stock any faulty glasses which were their own brand. These were all sold by 3rd party sellers. Amazon had nothing to do with their sourcing or manufacture", "score": 1, "replies": [{"body": "Nope. Mine was shipped directly from Amazon's warehouse in 2 days.", "score": 0, "replies": [{"body": "I think you are misunderstanding how Amazon works. \n\nI sell on Amazon and all of my products ship from Amazon's warehouse in 2 days. I am of course not Amazon.\n\nYou have three types of sales on Amazon:\n\nAmazon-fulfilled: This is when Amazon actually buys the products or has them manufactured and sells them. It will say \"shipped and sold by Amazon.com\" when you purchase. This could mean Amazon buys from a wholesaler (Cards Against Humanity) or it could mean they make it themselves (AmazonBasics foam roller). Of course less control exists with option #1 and they cant vet every supplier they buy from\n  \nFBA: Sellers like myself send their inventory into Amazon warehouses and Amazon handles all the packing and shipping. Amazon does not buy these products, we just pay them fees to be sold. This is probably 90% of what you buy on Amazon. Everything FBA is 2-day prime just like Amazon-fulfilled items\n  \nMerchant-fulfilled: Sellers list products on Amazon, but when orders come in they pack and ship themselves. Amazon never touches the product. These products do not get the prime designation (they can, but thats complicated). This is what you're looking at when you see stuff with free non-prime shipping or paid shipping.", "score": 5, "replies": [{"body": "This sounds like typical brick and mortar retail.\n\nIf I went to Walmart and bought dangerous glasses I would want them to be sued also.  Even if those glasses were not 'owned by Walmart' but were on the shelves on co-signment.  Walmart is a physical storefront.  Amazon is a digital one.  \n\nEither way the store is partly responsible for the items it sells.  Especially items that are potentially dangerous.\n\nAnd where does end?\n\nLets say you buy an ice cream cone from McDonalds. Then the news finds out there was horse dung in the ice cream.  Would you not sue McDonlads?  But then you find out McDonalds never bought the ice cream but was simply 'fullfilling the order'.  See where I'm going?\n\n", "score": 1, "replies": [{"body": "No, that is not the same at all. So many differences on so many levels.\n\nSay you buy shady looking fireworks from some unknown chinese vendor on ebay, and the listing said it is safe to keep it in your hand when it explodes. You as a consumer think that yes, I want to try it, and then you lose some fingers. And now you're blaming it all on ebay? Sigh...", "score": 1, "replies": []}, {"body": "> If I went to Walmart and bought dangerous glasses I would want them to be sued also\n\nNo, you would sue the company that manufacturers and wholesales the glasses.", "score": 1, "replies": []}]}]}]}]}, {"body": "This whole argument that Amazon has no liability for the listings on their website is absurd. Amazon was negligent. If they had performed even a cursory review of listings they would have known to shut down numerous Sellers.", "score": 0, "replies": []}]}]}]}, {"body": "This is good news.\n\nI hate frivolous law suits, but this isn't one.\n\nPutting people's permanent vision at risk because a company is too lazy to research a product is wrong.\n\nPeople will say its not Amazon's fault.  But Amazon should have taken precautions because of the potential harm this product could cause.", "score": 12, "replies": [{"body": "[deleted]", "score": 23, "replies": [{"body": "That's why most modern and civilized countries came up with consumer protection laws where you can both sue the seller of an item and the manufacturer.\n\nThen the seller and manufacturer can sue each other later on.", "score": 15, "replies": []}, {"body": "If Abbott Law is smart they will bring up a fatal flaw in Amazon's vendor system.  People trust Amazon.com, but they don't understand that sometimes they are buying from Amazon but most of the time they are buying from vendors.\n\nThere are a ton of shady vendors everywhere.  Amazon will shut one down, but it will just pop up under another company name.  It's whack-a-mole.", "score": 5, "replies": [{"body": "if it makes you feel better its extremely difficult for a seller to be suspended and pop back up again on Amazon. Its usually easier to just go find a new job", "score": 2, "replies": []}, {"body": ">  People trust Amazon.com, but they don't understand that sometimes they are buying from Amazon but most of the time they are buying from vendors.\n\nI logged in just to double check and make sure I wasn't mis-remembering:\n\n* Above product name, it has the seller name.\n* Below the \"in stock\" notice, it says \"ships from and sold by ___\"\n* Above the add to cart button, it says \"sold by ____\"\n* When added to cart, it says \"By____ \" after the product name, and \"Shipped from ___\" under that. \n* In checkout, it again says \"Items shipped from____ \" at top, and separately, \"sold by ____\" on the bottom\n\nThat's over a half dozen separate occasions where it's noted, including every single screen you can view the product. \n\nYou can still argue that people don't understand, but it's a hard argument to make.\n", "score": 1, "replies": [{"body": "Never underestimate human stupidity ", "score": 3, "replies": []}, {"body": "What you say is true, but the majority of people are stupid. In my experience, the majority of people think that Amazon is a store like Walmart, not a market place. They think that they are buying from Amazon, not on Amazon.", "score": 1, "replies": [{"body": "Well, you cant fix stupid...", "score": 1, "replies": []}]}]}]}, {"body": "> This is like suing the variety store for selling you the pack of cigarettes, but not the cigarette manufacturer because, well, that variety store should have done it's research.\n\nUh, yeah they should have.  I get what you're saying.  And I've been a Prime member for as long as it's been an option, and am long $AMZN so believe me I don't like seeing the suit.\n\nBut there *is* a certain level of responsibility, no matter what level it may be, that you take on when you accept money from someone and provide a product in return.  Do you think people middle-manning drugs and weapons for the cartel just tell the feds, \"What am I in trouble for I'm just delivering them?\".  No.", "score": 4, "replies": []}, {"body": "It is Amazon's fault. If I sold a bunch of these saying it would protect your eyes and they didn't it is straight up fraud.\n\nJust because Amazon is a big marketplace doesn't mean they aren't responsible for what gets sold there.  \n\nIt's their website. Their writing. Their payment system.  They are receiving the money from the customer and adding it to their bank account.  It's their risk.\n", "score": 4, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "The company that made them is a shadow China company that is beyond the reach of US law.\n\nIts Amazon's fault to allow such shadow companies to even sell their goods on their platform.", "score": 6, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "I don't know. The listing totally disappeared", "score": 2, "replies": []}]}]}]}]}, {"body": "> This is like suing the variety store for selling you the pack of cigarettes, \n\nHows that the same?  One is supposed to prevent your eyes from getting damaged, and the other are sticks that cause cancer.  Amazon can sell anything they want and have no repercussions for safety?  That's silly.", "score": 4, "replies": [{"body": "AMZN isn't the FDA even though it should take them into account.", "score": 1, "replies": []}]}, {"body": "Of course its Amazon's fault.\n\nYour example of cigarettes is foolish, because the purchaser of cigarettes knows the risks associated with cigarettes.\n\nPeople buying these glasses had no idea they could cause permanent eye damage.\n\nHow would Amazon test a product like this?  By selling only certified glasses from reputable sources.  Many of these glasses were coming from bullshit china shadow companies.", "score": 8, "replies": []}, {"body": ">This is like suing the variety store for selling you the pack of cigarettes, but not the cigarette manufacturer because, well, that variety store should have done it's research\n\nuh...what exactly about what you wrote is wrong? Are you saying store owners shouldnt be expected to research the products they sell?\n\n\"I had no idea what I was selling in my own store, but its not my fault!\"", "score": 1, "replies": []}, {"body": "Have someone put the glasses on and stare at the sun for an hour. If they are permanently blind after then the glasses do not work.", "score": 1, "replies": []}]}, {"body": "If a pharmaceutical company recalled a drug for being defective, would you sue CVS for selling it to you?  Amazon shouldn't be responsible for a shitty vendor that wants to sell on Amazon.  Literally anyone can sell something on Amazon.  ", "score": 1, "replies": []}]}, {"body": "Amazon did make an effort to warn people about counterfeit products. \n\nhttp://www.cbc.ca/news/business/amazon-solar-eclipse-glasses-1.4247740\n\nhttps://www.theverge.com/2017/8/12/16138368/amazon-solar-eclipse-2017-glasses-refunds-safety\n\nI guess we'll see what a judge says.", "score": 4, "replies": [{"body": "Lol. An email. Oops we sent you something that will cause permanent eye damage. \n\nLike most people don't get dozens even hundreds of emails a day. ", "score": 2, "replies": []}, {"body": "I all got was an email. Which could have easily been missed.\n\nAnd what if people bought many of these and distributed it before the warning was sent?", "score": 2, "replies": [{"body": "All I'm saying is that they made an effort, and there must be precedent. When you buy a car and there is a recall but you move and didn't receive notice and you get into an accident I believe there is not much consumer protections IF the car producer met their minimum legal obligations. Then there is the issue that Amazon is just the distributor, which the consumer certainly knows. I think Amazon will not have a legal issue here, but it certainly hi-lights ( highlights? ) how little legal protections consumers really have. ", "score": 4, "replies": []}]}]}, {"body": "[deleted]", "score": 5, "replies": [{"body": "Easy.\n\nStiff Fines and permanent delisting for sellers selling fake and dangerous goods.\n\nAlso requiring more documentation from sellers so Amazon can take legal action against dirty sellers.\n\nYou may not like it as a seller but this is for the long term good for all.  My trust in buying things on Amazon has dwindled recently because these types of stories of fake goods.\n\nHow come we don't hear these types of stories for Walmart? Or Target? Or other big retailers?", "score": 4, "replies": []}, {"body": "Seller to seller, are you not aware they do require official manufacturer invoices to sell specific items in many categories? ", "score": 1, "replies": [{"body": "Yes, but my point was almost any product could be potentially harmful and policing every SKU would be impossible. It's also easy to skirt the rules by listing in the wrong category. You can still find a ton of eclipse glasses in odd categories", "score": 1, "replies": []}]}]}, {"body": "Is this much different than a company selling a product and then recalling it? ie Walmart sells products they don't manufacture and post on some obscure board, by customer service, if something gets recalled (if even that)", "score": 1, "replies": [{"body": "The recall is the safety net. They recall tons of things that aren't mandatory just in case. It protects their ass. ", "score": 1, "replies": []}]}, {"body": "This is nothing more than an attack on Amazon's share price. They have no chance of winning without a settlement. ", "score": 1, "replies": []}, {"body": "I buy from Amazon almost exclusively. \n\nI have bought items shipped and sold Amazon.com that turned out to be counterfeit. Also have bought from \"sold by others\" that ended up being counterfeit. \n\nI think this lawsuit is good for the consumer bad for the small everyday seller. But it is frustrating buying fake products and having to deal with the returns. \n\nFor a product this dangerous I hope Amazon forwards the suit to those counterfeit vendors. ", "score": 1, "replies": [{"body": "http://www.startribune.com/makin-bacon-inventor-says-business-is-threatened-by-online-impostors/416453323/\n\nThe situation is horrible to US inventors.  According to this article, Amazon has been more helpful than Baba and eBay with removing fakes.", "score": 3, "replies": []}, {"body": "> For a product this dangerous I hope Amazon forwards the suit to those counterfeit vendors. \n\nThats the thing, Amazon is being sued because they are essentially the middle man between consumers and faceless chinese manufacturers. If the consumers or Amazon went after the chinese manufacturers, they would simply disappear. ", "score": 2, "replies": []}, {"body": "Always open counterfeit claims when this happens. People as customers don't realize how much power they have to get these sellers actually investigated and banned. ", "score": 1, "replies": []}]}, {"body": "Buyer beware!", "score": 1, "replies": []}, {"body": "As someone that sells on Amazon, all this will do is make it harder for us little guys to sell.\n\nI used to be able to sell any book, CD, DVD, video game, etc.... that I wanted to sell.\n\nNow every category is getting restrictions or you have to jump through crazy hoops to sell on them.  And the changes they make hurt no one but little guys like me. Chinese sellers still ding a way past all those restrictions.  \n\nIt isn't working and they need to find a much better way.", "score": 0, "replies": [{"body": "What would one make of this if these harmful counterfeit glasses in question where an \"Amazon Choice\" item? An item labeled as ISO/CE certified. Amazon is a big name company and people typically put their trust in that. Amazon owes it to the consumer to protect us from harmful products. China wants to make cribs with lead based paint and toys with potential choking hazards and Amazon is giving them and others a platform to harm us and make a buck in the process. This has got to stop! I'd rather spend a little more money to have a safe product and keep the money in America to create jobs and boost our economy then buy a cheap, harmful, defective product! OvEr&OuT", "score": 2, "replies": []}, {"body": "what type of restrictions?  How are these fake shadow china companies able to dodge these restrictions?", "score": 1, "replies": [{"body": "Dvds have to be below a $20 msrp for me to sell.  Almost all are higher than that.  \n\nTo To get approved, you have to have receipts from distribution houses for a certain quantity.  These can be obtained quick by people that have not so good morals.  Like counterfeiters.", "score": 1, "replies": []}, {"body": "Amazon requires official invoices for media products. As well as health and beauty, and many others. \n\nSome sellers were grandfathered in and are finally being kicked out to eBay where they belong selling their used CDs and they literally never stop whining about it. It seems this one escaped the seller forums. ", "score": 1, "replies": []}]}]}, {"body": "The comments in here are disparaging, amazon should be sued to the ground for this.  How about when toys with lead paint were found back when I was a kid.  Wal mart is still here.  So most of you are.......fucking morons", "score": -2, "replies": []}]}
{"title": "Buy $AMD (DD inside)", "selftext": "", "id": "6yw26c", "created_utc": 1504890084.0, "score": 864, "upvote_ratio": 0.91, "num_comments": 110, "comments": [{"body": "[removed]", "score": 107, "replies": [{"body": "i'm down 15% in a month. ", "score": 64, "replies": [{"body": "[removed]", "score": 26, "replies": [{"body": "Meme stocks are meme stocks.", "score": 34, "replies": []}, {"body": "I have had the worst SQ luck. Buy high, get annoyed and sell low.", "score": 3, "replies": []}]}, {"body": "Until AMD can find a foothold in gaming over [insert any competitor], they're going to have a difficult time recovering. Gaming is seemingly the only niche where they have an opportunity to recapture a percentage of the market that will allow AMD to trend upwards.", "score": 14, "replies": [{"body": "Their 580 GPU was a great card for gaming before miners took them all up. Their r3 is better in gaming than the i3 in games that are more cpu intensive", "score": 13, "replies": [{"body": "Haha - I got a 580 4gb for sale, want it? Brand spanking new. ", "score": 3, "replies": [{"body": "I'll take it for free. ", "score": 2, "replies": [{"body": "I'll return it and pay the shipping cost ", "score": 7, "replies": []}]}]}]}, {"body": "> Gaming is seemingly the only niche where they have an opportunity to recapture a percentage of the market\n\nETH mining wants a word with you", "score": 5, "replies": []}, {"body": "That is going to be tough with Vega being shit and there being little competition to the 7700k and maybe whatever the i5 equivalent of that is. IDK about the latter i5. ", "score": -1, "replies": []}]}, {"body": "Just got on AMD train and I hate it. Got some calls, too.\n\n:/ ", "score": 2, "replies": []}, {"body": "did this make you feel better", "score": 1, "replies": []}, {"body": "Buy when it hits $12", "score": 1, "replies": []}, {"body": "Lol, you are like baby. Watch this.\n\nI'm still holding AOBC. I'm down over 15% today. ", "score": 1, "replies": []}]}, {"body": "Nothing else to do but drink alcohol in hopes of a brighter future. *Raises whiskey high.", "score": 2, "replies": []}, {"body": "The only reason AMD exist is because Intel wills it. That and the whole monopoly thing.", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 103, "replies": [{"body": "thats cuz the MM wanna buy that shit on discount", "score": 32, "replies": [{"body": "People keep saying this, but which institutions are loading up on AMD when it sinks? Have people actually looked at the books?\n\nNot being sarcastic, it's a genuine question because I can't be assed to look. ", "score": 38, "replies": [{"body": "[deleted]", "score": 30, "replies": [{"body": "[deleted]", "score": 19, "replies": [{"body": "Careful lil faggot, asking for sources gets you flaired", "score": 53, "replies": [{"body": " source? ", "score": 9, "replies": []}]}, {"body": "https://fintel.io/soh/us/amd/goldman-sachs-group\n\nWent in an additional 30% on 6/30, to 8 million.  If you go here, they're on the top page of institutional investors, with the 9th highest number of shares.\n\nI don't think they picked up the most though.  Vanguard picked up the most by far, due to the recent Mubadala action.", "score": 5, "replies": []}]}, {"body": "Source please big boy ", "score": 1, "replies": [{"body": "https://fintel.io/soh/us/amd/goldman-sachs-group\n\nWent in an additional 30% on 6/30, to 8 million.  If you go here, they're on the top page of institutional investors, with the 9th highest number of shares.\n\nI don't think they picked up the most though.  Vanguard picked up the most by far, due to the recent Mubadala action.", "score": 2, "replies": []}]}]}, {"body": "[removed]", "score": 4, "replies": [{"body": "Well people are still screaming at GS that one time they down graded AMD then purchased a large amount.\n\nExcept that large buy order was for some Saudi firm. But this sort of thing gets continuously perpetuated. \n\nTry and peek into /r/AMD_Stock and it's like some conspiracy theory sub where every hedge fund has it out to get AMD with these down grades followed by a supposed buy order", "score": 5, "replies": [{"body": "/r/AMD is an echo chamber if I've ever seen one \n\nI still haven't met a real life person who has an AMD CPU. ", "score": 9, "replies": [{"body": "I had one like 10 years ago.", "score": 2, "replies": []}, {"body": "I have one in a desktop I built. Works great, was cheap as fuck", "score": 1, "replies": []}]}, {"body": "Yeah Idk why that conspiracy still gets reiterated. GS didn't actually buy anything they just facilitated the order", "score": 1, "replies": []}]}, {"body": "Should see yearly profits soon, last quarter was profitable. ", "score": 1, "replies": []}]}]}]}, {"body": "What is pt?", "score": 1, "replies": [{"body": "Penis tickle. So if an analyst grades a company(girl) with a $20 penis tickle, that's fairly cheap where I'm from. Therefore $9 penis tickle leads me to the assumption that it's not a very attractive stock (girl)", "score": 3, "replies": []}]}, {"body": "Probably mostly due to the reputation of said anaylst.  One of them was one of the big 4 bailed out 10 years ago, and the other nobody gives a fuck about.", "score": 0, "replies": []}]}, {"body": "I picked up 300 shares today at 12.20. Might be a little premature but I'm confident by next earnings we'll see 14+ again.", "score": 55, "replies": [{"body": "ALLAHU AKBAR INSHALLAH", "score": 67, "replies": [{"body": "LMAO this got me good.", "score": 2, "replies": [{"body": "i was a bit excited seeing ur username, but then i realized ur just a normie faggot", "score": 1, "replies": [{"body": "Its true, I'm store-brand Shkreli :(", "score": 1, "replies": []}]}]}]}, {"body": "The mining craze is still happening and they keep releasing new CPUs. There is no reason earning won't be amazing.", "score": 22, "replies": []}, {"body": "150 shares in @ $12.17", "score": 10, "replies": []}, {"body": "In at 12.29 and averaged down at 12.15. Pretty confident I'll make something off it.", "score": 3, "replies": []}, {"body": "I picked up 700 at $12.15.  I feel good about the discount", "score": 3, "replies": []}, {"body": "At 12.20 you will make some money almost certainly. You good homie", "score": 4, "replies": []}, {"body": "It has hit 14-15 on news alone in the past, never mind good ERs. You're fine.", "score": 2, "replies": [{"body": "In at $4.25 and $8.14 :)", "score": 9, "replies": [{"body": "Can I have your babies? Also fuck the haters downvoting.", "score": 3, "replies": []}]}]}, {"body": "350 @$12.24 today and will be averaging down if necessary until earnings", "score": 1, "replies": []}]}, {"body": "Second stick figure is how I pictures most people on this sub.", "score": 28, "replies": [{"body": ">Duhh...Here's where I bought into MU because Meme Stocks are the future of the economy!", "score": 2, "replies": []}]}, {"body": "Just popping in from r/all, and maybe this is a frontpage-bias thing, but it seems like every time you guys show up there it's because of losses and bad investments. It's getting to where I'm thinking of checking you guys to know what *not* to invest in should I ever start slinging money at the market.", "score": 64, "replies": [{"body": "That is pretty much the point of the sub", "score": 143, "replies": []}, {"body": "Inverse WSB is literally the best possible strategy.", "score": 55, "replies": [{"body": "Unless people start making posts about inversing the wsb meta then you have to inverse the inverse. ", "score": 6, "replies": [{"body": "Layers and layers", "score": 1, "replies": []}]}]}, {"body": "thatsthejoke.jpg", "score": 67, "replies": []}, {"body": "I would burn this money, but the Feds won't let me. Fuckers.", "score": 19, "replies": []}, {"body": "It's called inverse WSB faggot delights.\n", "score": 33, "replies": []}, {"body": "Thatâ€™s what you all said to r/wallstreetbets when we said to jump on AMD in January last year when it was at $1.98. ", "score": 8, "replies": [{"body": "Well, WSB bought in to AMD when it was in the $3 range prior to it falling down to 1.98.  \n\nWSB has a habit of getting in to soon, and then leaving after a single big hit.\n\nTake ARRY for example, that was a research play a lot of WSB did and after that single play didn't work out they bailed...rather than realizing it's a solid company with multiple good products in the line.  It's already over the price most people got in to back then.\n\nMore recently RAD.  It hasn't returned to the $3-$4 range yet, but it was a solid buy in the low $2's, and this time next year it will probably be high $3's(likely more) barring some catastrophic event.", "score": 1, "replies": []}]}, {"body": "Let's keep in mind that everyone hates people that post profits and love riding the misery of people's losses. \n\nBut yeah mostly people losing money in the sub ", "score": 3, "replies": []}, {"body": "Normies get out!!!", "score": 3, "replies": []}]}, {"body": "the intel chart should really look more like a horizontal line. thing hardly moves. would be a good iron butterfly or condor play.", "score": 23, "replies": [{"body": "[removed]", "score": 11, "replies": [{"body": "i was gonna say that chart up there looks like the NVDA chart, not the INTC chart.\n\nface it guys. the stock is $12 for a reason. it's a meme stock. yeah it has potential, but don't forget (or maybe some of you are too young to remember) that AMD was always second rate in both processors and graphics cards. they're not going to the moon overnight. and they won't hit $15 next week.\n\nmore likely they'll hit $13 and then everyone will sell back to $11 and you'll all be bagholders until next earnings report which they will crush but face yet another selloff bringing their price to $9 and then you'll average down and then next quarter they will miss earnings and be a $6 stock again", "score": 10, "replies": [{"body": "They weren't always second rate... They pioneered the x64 architecture for processors back in the day and intel had to play catch up. Recently though you are definitely correct.", "score": 15, "replies": [{"body": "No intel, had microsoft make it so that intel ran better and kept amd as a second rate company.", "score": -5, "replies": [{"body": "Not quite, Intel had an inferior chip, but paid OEM builders and retailers to not sell AMD products so they could retain their market share.  As it turns out, locking competition out of the market is really effective in limiting their growth.  Maybe you should read up on the multitude of Intel anti-trust lawsuits out there.", "score": 5, "replies": []}]}]}, {"body": "AMD has always been the more affordable option. When I was 15/16, I didn't even consider Intel because of their prices. They can capitalize on that, and they have with the Ryzen line up. I use a Ryzen 7/RX480 and it's comparable to Intel systems far more expensive that what I paid for it. \n\nAMD has a loyal following, whereas most people buy Intel due to the sheer monopoly they held over the past decade. Yet, the moment AMD offered a comparable product, Intel lost market share upto the point that AMD overtook them for the first time in years.", "score": 9, "replies": [{"body": "Yeah every PC I've ever built has been AMD, b/c fuck spending $600 on a CPU. And the motherboards are generally more expensive. And I would be more nervous about overclocking. \n\nIDK where people think they really need the top of the line processor. I understand the conspicuous consumption aspect of it but the reality is most systems bottleneck at the PCI / USB / SATA / NIC before the actual processor hangs up computer performance. I mean get an Intel chip if you gotta do virtualization but spending that money on RAID 1 SSDs and actually checking the stats on a motherboard's PCI chipset is way more cost effective.\n\nAdmittedly my laptop is an Intel chipset.", "score": 6, "replies": [{"body": "When the hell were CPUs for home users $600, is this the Pentium II days? A perfectly fine i5 was in the $200-250 range and an i7 about $300-350 those prices have pretty much been constant through the years since the i5/i7 lineup launched. ", "score": 11, "replies": []}]}, {"body": ">most people buy Intel due to the sheer monopoly they held over the past decade\n\nPeople buy intel because they're objectively better. Case in point: HyperThreading. They have a hold on the market because they are *better*. Not because market capitalism is oppressing AMD.\n\nComputationally intensive applications, servers, enterprise, and engineering applications all benefit from what intel has to offer. If it were attributable to some phantom tradition, AMD would actually be competing. But it's not, and they can't. Intel is just wiping the floor with them.\n\nThe reality is the only people that buy AMD are budget users or gamerz, because AMD can't stand up outside of that section of the market.\n\n", "score": 6, "replies": []}, {"body": "That's the thing, it's the budget model. Most people buy AMD while wishing they had intel money. Like getting a tranny to suck you off. I mean, a dick sucking is a dick sucking but you'd rather have a 10/10 doing it.", "score": 17, "replies": [{"body": "But AMD is now cheaper AND better, specifically on higher end.", "score": 2, "replies": [{"body": "*She's not fat just a little chubby*", "score": 11, "replies": [{"body": "AMD went from chubby awkward teenager to a confident smoking hot  woman.\n\nBut the people in her town still see her as that one awkward chick ", "score": 14, "replies": []}]}, {"body": "Yeah? What non-existent AMD video card are you referencing? ", "score": 2, "replies": [{"body": "I'm fairly certain just about every one of AMD's GPUs are better than intel's.", "score": 1, "replies": [{"body": "Intel doesn't make GPUs. Thou shalt not speak of Intel integrated graphics. ", "score": 1, "replies": [{"body": "yea, thats the point.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Exactly! All my computers are AMD, and they are affordable and powerful.", "score": 3, "replies": []}, {"body": ">  They can capitalize on that, and they have with the Ryzen line up. \n\nYeah with who, the powerful wallet of every 16 year old? \n\nRyzen still is not as good as 7700k for gaming. Video editing, yeah, but the FPS charts out there are unimpressive. \n\nI had an RX480, sold it for a profit during mining craze for a GTX 1080 because it could barely even play PUBG. \n\nVega is just a fucking joke. \n\nFace it AMD is a meme company with extremely high production and R&D costs and still can't make products better than Intel or nVidia. \n\n", "score": 0, "replies": []}]}, {"body": "When I was in 8th grade (2004) I built myself a gaming computer and remember finding AMD to be the clearly superior brand. This was right around the time when 64bit was brand new and just released before any software actually ran on it. \n\nThe next year I discovered drugs in highschool so I'll admit I have no idea what happened during the next 10ish years but I do remember a time when AMD was the clear choice", "score": 3, "replies": []}, {"body": "Nope, neither of those things are true.", "score": 1, "replies": []}]}]}]}, {"body": "Anyone averaging down?", "score": 3, "replies": [{"body": "Been doing that since July, boy.", "score": 5, "replies": [{"body": "You are truly special", "score": 1, "replies": []}]}]}, {"body": "I wouldn't mind to buy it at $10. ", "score": 3, "replies": []}, {"body": "http://www.marketwatch.com/story/amd-is-gaining-ground-on-intel-faster-than-analysts-had-thought-2017-09-06\n\nhttps://www.theverge.com/circuitbreaker/2017/9/7/16267428/lenovo-a275-a475-thinkpad-amd-pro-processors\n\n\nWhy I really bought back into AMD. ", "score": 4, "replies": []}, {"body": "Img DD well worth more than other shitty DD's ive seen built on ASSumptions. ", "score": 2, "replies": []}, {"body": "I bought calls and sold puts. AMA", "score": 2, "replies": []}, {"body": "DUDE JUST ADD MORE BRIDGES LMAO - Intel", "score": 2, "replies": []}, {"body": "I'll be okay with an assignment at $12.", "score": 2, "replies": [{"body": "I sold a naked October 20 $12 put, then rolled it up to $13 on the way up to the recent peak. I don't mind assignment either, especially since I collected around $1.40 total credit so far. I rather buy it back cheap in the short term, but I'd ride it to expiration if that's how she goes.", "score": 2, "replies": [{"body": "Ya I sold the Oct 20th $12 put too, wish I waited an extra day!  .57 to .75 is a hell of a jump.", "score": 2, "replies": [{"body": "I'm short $12.50 and $13 for the same *edit* date, not worried at all. Bought ITM LEAPs on the dip too.", "score": 2, "replies": []}]}]}]}, {"body": "All I saw was buy INTEL", "score": 4, "replies": [{"body": "> All I saw was buy INTEL\n\nwhich is INTC not INTEL you autistic anal acceptee", "score": 28, "replies": [{"body": "INTEL is a company", "score": -1, "replies": [{"body": "Do you always caps your company names?\n\n> UBER is in trouble for SPYing on LYFT", "score": 1, "replies": []}]}]}]}, {"body": "Earnings mid October should bring a rally. Grabbed some Oct20 calls myself.", "score": 1, "replies": []}, {"body": "AMD's answer is always add more cores!", "score": 1, "replies": []}, {"body": "Fuck r/all", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": [{"body": "A retired mom with a retarded son. \n\nYou'll be ok. What's your average?", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Why? It's down -18% lol", "score": 1, "replies": []}]}]}]}, {"body": "AMD lags behind intel and NVIDIA every year. ", "score": 1, "replies": []}]}
{"title": "Apple stock went down when iPhone X price was revealed", "selftext": "Apple stock went down 1.90% when at the time they revealed the price tag for the new iPhone X ($999)", "id": "6zp3y0", "created_utc": 1505243145.0, "score": 185, "upvote_ratio": 0.9, "num_comments": 108, "comments": [{"body": "Which is funny because literally everyone knew the price before today's reveal.", "score": 231, "replies": [{"body": "I thought the drop was due to the unexpected delayed release date", "score": 68, "replies": [{"body": "This.\nDon't think it was the price, ", "score": 35, "replies": [{"body": "This has been debunked since the beginning of the week... it was literally debunked as soon as the news broke. The price drop is because of scalper sell-offs... Nothing more. *stock prices go up and go down, you can't explain that*\n", "score": 15, "replies": [{"body": "Aliens. ", "score": 14, "replies": [{"body": "Someone care to explain the reference please?", "score": 2, "replies": [{"body": "[Sure.](https://youtu.be/HABNe7_D22k?t=1m52s)", "score": 2, "replies": [{"body": "Haha thanks. Does he have any background or authority in investing?", "score": 1, "replies": [{"body": "Jesus christ man", "score": 1, "replies": [{"body": "Haha, I was trolling. ", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "Everyone expected a special phone. They did not reach the expectations. If you followed the stock chart during the conference, you've seen the stock go up during watch. After that it fell through ground", "score": 1, "replies": []}]}]}, {"body": "I was not aware of the price until just now, so not literally. ", "score": 5, "replies": []}, {"body": "I literally didn't.. Also didnt' care though. \n", "score": 1, "replies": []}, {"body": "Wasn't it even predicted to be higher? I can swear I read \"starting at $1099\" at least a few times last week. ", "score": -1, "replies": []}]}, {"body": "Apple stock has historical gone down after reveals like this...nothing new\n\nIt will pick up going into ER", "score": 75, "replies": [{"body": "Er=Earnings report? ", "score": 12, "replies": [{"body": "Hopefully that's what he means... I would fear apple in the emergency room xd", "score": 17, "replies": []}]}, {"body": "Happens every single fucking time yet people actually act like it means something.. ", "score": 13, "replies": []}, {"body": "When is apples ER", "score": 5, "replies": [{"body": "Did a quick google search,\n\nSeems to be October 24th, however the date is not set yet.\n\nSource: http://www.nasdaq.com/earnings/report/aapl", "score": 1, "replies": []}]}]}, {"body": "And they will ship the X models starting of Nov . This might be one reason the stock fell all of a sudden .", "score": 9, "replies": []}, {"body": "well i'm an idiot for buying the stock today. never time the market kids", "score": 37, "replies": [{"body": "Just wait a year when it's price is at 180 and it won't matter then", "score": 41, "replies": [{"body": "AMEN", "score": 11, "replies": []}, {"body": "Apple has so much cash that it could pivot into 20 different businesses before it'll be gone", "score": 5, "replies": [{"body": "The tons of cash reserves are actually what worries me most about Apple. Isn't that a sign that they simply don't know what to do, businesswise?", "score": 7, "replies": [{"body": "I tend to agree with your point, I would've expected more than Emojiphone from Apple", "score": 5, "replies": [{"body": "Some tech reviewer put it perfectly: they're innovating like a Chinese company not like Apple. It's a very vague description but it makes perfect sense if you think about it. The new features are sideways evolution.", "score": 3, "replies": []}]}]}]}, {"body": "I'm thinking it's going to be a lot sooner than a year before Apple sees 180\n\n184 by end of year. If this happens seek this comment out so I can talk shit and say I told you so...If it doesnt ....This comment never existed.", "score": 13, "replies": [{"body": "RemindMe! December 31, 2017 \"Can u/eleminopees say 'I told you so'? Or is he a moron?\"\n", "score": 9, "replies": [{"body": "I will be messaging you on [**2017-12-31 03:13:43 UTC**](http://www.wolframalpha.com/input/?i=2017-12-31 03:13:43 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/stocks/comments/6zp3y0/apple_stock_went_down_when_iphone_x_price_was/dmxlybt)\n\n[**5 OTHERS CLICKED THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/stocks/comments/6zp3y0/apple_stock_went_down_when_iphone_x_price_was/dmxlybt]%0A%0ARemindMe!  December 31, 2017 ) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! dmxlyo3)\n\n_____\n\n|[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/)\n|-|-|-|-|-|-|", "score": 4, "replies": []}]}, {"body": "It's been five hours this comment is already forgotten ", "score": 7, "replies": []}]}, {"body": "Assuming the average iPhone user isnt scared off by not having a home button.  Hell even I'm scared of it just with my history of these gimmicks not working 100%.", "score": 1, "replies": [{"body": "AAPL is one of the best preforming tech companies on the NASDAQ. I hate the company but love the stock", "score": 14, "replies": [{"body": "95% of their revenue is iPhone sales though, if people dont upgrade for whatever reason they will drop significantly.\n\nThey probably will, though there is still some heavy risk I'd say.", "score": -16, "replies": [{"body": ">95% of their revenue is iPhone sales though.  \n[Well, that's just not accurate at all.]\n(http://www.businessinsider.com/apple-iphone-sales-as-percentage-of-total-revenue-chart-2017-1)", "score": 9, "replies": []}, {"body": "Its like 65%", "score": 9, "replies": []}, {"body": "How circlejerk can you get", "score": 3, "replies": []}, {"body": "They all upgrade because their plans allow them to. They pay for these upgrades well before they get them ", "score": 0, "replies": []}]}]}, {"body": "No home button?! What are they using", "score": 1, "replies": [{"body": "One of their three phones they released today doesn't have a home button", "score": 7, "replies": []}, {"body": "The screen. It's 2017!", "score": 4, "replies": [{"body": "I just saw their reveal. Sexy phone. I think that's worth getting rid of the home button for.", "score": 6, "replies": [{"body": "It definitely gave me a little chub. ", "score": 4, "replies": []}, {"body": "That top rim is ugly as hell. I don't think it will be accepted by the market ", "score": 0, "replies": [{"body": "Its different. Something we are not used to, agreed. But you'll get used to it and so will everyone else and eventually the market' will accept it.", "score": 2, "replies": [{"body": "Like everyone accepted that flat tire design on smartwatches? They didn't really ", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "\nHow are you timing the market by going long on a profitable stable company?", "score": 12, "replies": []}, {"body": "You did next to no research. I would not say this represents an investor's best effort at buying at the right time. ", "score": 2, "replies": []}, {"body": "Just by looking at the 5 year chart, you could see that stocks usually go down 1-4 months after the release of an Apple product...", "score": 2, "replies": []}, {"body": "No, you're just bad. There were rumors that it will be delayed, so when it was announced officially, people jumped ship to pursue stocks with higher growth. \n\nI'm surprised it rises at all. Just keep holding until all the people who left comes back. It shouldn't take too long.", "score": 2, "replies": []}, {"body": "Youâ€™ll be fine. Just be happy you didnâ€™t pick up some options at the top that expire Friday", "score": 2, "replies": []}, {"body": "I averaged up at 163. Holding for 5+ years though so w/e.", "score": 1, "replies": []}]}, {"body": "Its just traders.  Watch it recover in a day or two.\n\nWhen the 8 Plus was announced at $799 it was pretty obvious the X would be at least $999", "score": 17, "replies": [{"body": "[removed]", "score": -12, "replies": [{"body": "goggle it son", "score": 16, "replies": [{"body": "https://images-na.ssl-images-amazon.com/images/I/81yw0sHEG3L._SX355_.jpg\n\nAlright now what?", "score": 22, "replies": [{"body": "I love it", "score": 2, "replies": [{"body": ":D", "score": 0, "replies": []}]}]}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "[removed]", "score": 2, "replies": [{"body": "I think there was facial recognition on the X. Wireless are for all? Idk, i don't follow it closely... I just remember hype about this being the biggest update but I just saw gimmicks when skimming the changes.", "score": 6, "replies": [{"body": "[removed]", "score": -1, "replies": [{"body": "Facial recognition sounds fun, until the cops use it to unlock your phone :/", "score": 6, "replies": []}, {"body": ">Yeah there's some minor changes. I don't think anyone will ever use the facial recognition though. Wireless charging has been a thing for a while now though. The past iPhones didn't have that? My Galaxy S6 supports it and the model is 2 years old by now.  \n\nYeah, Apple is finally catching up to Samsung circa 2015 with this release.", "score": 2, "replies": []}]}, {"body": "Congratulations! You've found Apple's business model. They're a company 100% run on gimmicks", "score": -1, "replies": [{"body": "800billion dollars worth of gimmicks! ", "score": 1, "replies": [{"body": "Well objectively they do not make better machines.", "score": 1, "replies": [{"body": "Better than what? Objectively speaking,  you dont know what objective means", "score": 1, "replies": []}]}]}]}]}]}]}]}]}, {"body": "I was reading some charts yesterday that showed the history of stock after each phone release. It was never good initially. Wish I would have saved the link, it was an interesting read. ", "score": 3, "replies": []}, {"body": "I panic sold right before I would break-even. Hindsight is 20/20 but damn it looked good when the watch was revealed. Thought it was gonna bust 164 with the volume during that time.", "score": 5, "replies": []}, {"body": "I thought it went down because they didn't back the headphone jack. Also the improvements they made kinda suck", "score": 2, "replies": []}, {"body": "Big Brother turns it up to 11 with FaceID!\n\nApple is creating it's own facial recognition database.... 30,000 individual IR points from all angles around your face? creepy as fuck no thanks", "score": 5, "replies": [{"body": "First thumb print next face id", "score": 4, "replies": []}, {"body": "Yeah this is the first time face recognition has even been conceived of for use with any technological device! \n\nAnd the only tech giant that doesnâ€™t sell your personal data to ad companies is going to use it for evil!\n\nYour face is unique and they definitely will steal it to assume your identity for some reason...SOME EVIL REASON THAT IS TOTALLY OBVIOUS AND EVIL!!", "score": 4, "replies": [{"body": "Facial recognition is actually a pretty big deal, no matter how biased you are. If you think they're not going to be using the data to perfect and sell their system, I've gotta say you're not very bright.\n\nNot that it matters. More money all around. ", "score": 1, "replies": [{"body": "According to them, that information in only stored locally on the individual phone.  They would have no way to retrieve it, same as the fingerprints.", "score": 3, "replies": [{"body": "and after Tim Cook refused to create a backdoor for the FBI after the SB shooting, I trust that Apple has our best interest - for the most part, at least. ", "score": 7, "replies": []}, {"body": "I can assure you that the NSA can access the data on your phone.\n\n", "score": 1, "replies": []}]}, {"body": "Looks like youâ€™re not very bright if you canâ€™t read the information on Face ID that clearly states that ALL FACE ID INFORMATION IS ONLY STORED LOCALLY ON THE DEVICE.\n\nLooks like youâ€™re also not very bright if you donâ€™t realize that APPLE IS TRYING TO STAND OUT AS AN ALTERNATIVE TO ANDROID BY TELLING YOU THEY THEY DONâ€™T SELL YOUR INFORMATION FOR ADVERTISING AND ARE OPPOSED TO THAT WHATSOEVER.\n\nWhile weâ€™re on the subject of your stupidity, letâ€™s talk about APPLE SPENDING MILLIONS OF DOLLARS IN LEGAL BATTLES AGAINST THE FBI FOR REFUSING TO CREATE A BACKDOOR TO THEIR PRODUCTS.\n\nI put the important information in all caps for you, since you seemed to have missed this news over the past few years.", "score": 1, "replies": [{"body": "Not only did you miss the point again. You went off in all caps... Again. They don't care about personal information. It's the system, not your face. I feel like I'm talking to a wall here.", "score": 1, "replies": [{"body": "You donâ€™t have a valid point and you have no idea what youâ€™re talking about.\n\nI went off in all caps in hopes that you would actually read something, since even basic reading and comprehension seems difficult for youâ€”but thatâ€™s clearly a lost cause.\n\nI think you talking to an actual wall instead of posting here (or talking to other humans) is better for society. Do us all a solid.\n", "score": -1, "replies": [{"body": "Yikes.", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "It usually does.  I don't think the market really gets Apple.\n", "score": 4, "replies": []}, {"body": "Seems like they typical buy the rumor sell the news mentality.", "score": 2, "replies": []}, {"body": "So basically BTFD.", "score": 2, "replies": []}, {"body": "Going down 1 or 2 percent doesn't mean anything.  Everyone already knew the price of the iPhone.  That fact was already built into the price.   ", "score": 1, "replies": []}, {"body": "SP drops literally every time a new iPhone is announced \n\nIt's called sell the news ", "score": 1, "replies": []}, {"body": "And everybody just forgot that Tim Cook announced that Apple Watch sales increased  by 50% this year and that the Apple Watch is now the most popular watch worldwide. The stock will soar when they release their Q3 earnings", "score": 1, "replies": [{"body": "Fitbit stock is doing a lot better than Apple today. It's high price target of $10 if hit has a lot more potential as investment. \nIn the fancy presentation yesterday Fitbit wasn't on the list as he was comparing it to watches not other wearables. Jesus he was even implying it cures cancer in the video. ", "score": 1, "replies": [{"body": "Good to know, I was not aware of that. But I still think that the stock will go up as soon as they announce their Q3 earnings. And as others pointed out, the stock almost always declined after the Keynote just to go up again in the weeks after it. ", "score": 1, "replies": []}]}]}, {"body": "I'm not worried.  Historically, it usually rises back up leading to ER", "score": 1, "replies": []}, {"body": "It was more of the release date than the price which confirmed earlier rumors of a supply constraint. Apple's stock usually goes south after the event as people buy the rumor and sell the news and then goes back up after preorder news.", "score": 1, "replies": []}, {"body": "It recovered really quickly from the dip.", "score": 1, "replies": []}, {"body": "Still don't get the appeal of a new over priced phone every year which is why I would never buy Apple. Is everyone going to keep falling for the same trick every year? I mean for real, how much is a new phone going to do for you, it's the same damn thing plus a slightly improved camera, you can buy a nice SLR for the price of upgrading your phone.\n\nSigned, dude with an old Android that texts and calls just fine", "score": -3, "replies": [{"body": "There is a large base of people that will continue to buy iphones for their designs and ease of use.", "score": 6, "replies": [{"body": "Iphone, Android, Windows... same shit sheeple! Not worth 1% of your yearly salary or more... I mean come on, is this real life", "score": -7, "replies": [{"body": "I use my iphone a ridiculous amount everyday. It's my email, calculator, alarm, calendar, camera, social media tool, gps, music player, bank, ticket holder, internet browser, and of course phone. It definitely deserves 1% of my salary.", "score": 5, "replies": [{"body": "My phone does all of that guy. ", "score": 0, "replies": []}]}, {"body": "The main selling point of iphones is ease of use. Unfortunately competition has not yet been able to make a money that is as easy to use as the Iphone. My mom loves her iphone, even though we got her a new Android phone a few months before that and she hated it.\n", "score": 1, "replies": []}]}]}, {"body": "\n>Signed, dude with an old Android that texts and calls just fine \n\nSome of us use our smartphones for more than texting and calling. For some, \"just fine\" isn't what we strive for. ", "score": 6, "replies": []}, {"body": "Why do I only see this criticism levied at Apple? Do people not realize that Samsung, Google, Microsoft, Amazon, etc also update their devices every year? What is Apple doing that deserves this especial criticism? ", "score": 5, "replies": [{"body": "I think it's funny that Google and Facebook have been doing facial recognition for years on photos and their entire business model is to collect and sell consumer data but Apple does facial recognition on the phone and everyone loses their damn minds over \"big brother\". \n\nBig Brother already knows your face and it wasn't Apple that gave it to them. ", "score": 3, "replies": []}, {"body": "My criticism expands to all brands. I equally think it's all a shit show of being cool with a new toy to flash", "score": 1, "replies": []}]}, {"body": "Agree.  Sadly we live in a materialistic world and people always need the \"latest\" tech.  But hey more profits for us :D \n", "score": 5, "replies": [{"body": "See here's the thing, just because they make a phone every year, doesn't mean that everyone buys a new one every year.\n\nsome people buy one every other year. some people buy one every third. me? I'm still rocking my 5s and plan on getting an 8, maybe an X.\n\nBut I sure as hell am glad they make one every year, continually refining it, making them better, so that when I am ready to upgrade, I don't have to wait 2-3 year, or whatever cycle you would have them on.\n\nShort iterations are how you make things better over time. You get to learn from your mistakes quicker. That's why agile programming took off so quickly, because people found that the quicker you iterate, the quicker you get to a better end result.", "score": 8, "replies": []}]}, {"body": "It's a status symbol nowadays, if you don't have the latest and greatest new phone, it means you are poor and people won't want to be friends with you.\n\nThe mobile industry is really smart, they have done what PC industry could not do, convincing people to spend nearly $1000 every year to buy their latest and greatest product. My current gaming PC is 5 years old and still plays just fine...", "score": 1, "replies": [{"body": "Agree with you. Don't care if my comments are downvoted. If people want to make dumb moves with their money, not my problem.", "score": 1, "replies": []}]}]}, {"body": "Its just traders.  Watch it recover in a day or two", "score": 0, "replies": []}, {"body": "It always goes down during presentations ", "score": 0, "replies": []}, {"body": "That isn't why it dropped, everyone and their mother knew it would be $1000. It's just people buying the rumor and selling the news aka traders. ", "score": 0, "replies": []}, {"body": "Because the company died when Steve Jobs did. They have nothing new up their sleeves. Basically a $1500 emoji machine. DUMB ", "score": 0, "replies": []}]}
{"title": "looking for a very long term stock", "selftext": "[deleted]", "id": "6zz8bi", "created_utc": 1505353676.0, "score": 57, "upvote_ratio": 0.91, "num_comments": 109, "comments": [{"body": "BRK.B. Set it and forget it.", "score": 59, "replies": [{"body": "Charles Munger and Warren Buffett are 93 and 87 years old respectively. To be completely honest, I would wait for a death dip and buy it.", "score": 0, "replies": [{"body": "Those guys are never going to die.", "score": 10, "replies": [{"body": "Heroes never die.", "score": 11, "replies": [{"body": "Heroes get remembered.  Legends never die.", "score": 2, "replies": [{"body": "I was quoting Overwatch. \n\nhttps://www.youtube.com/watch?v=zcj3XmD8YaM", "score": 2, "replies": []}]}]}]}, {"body": "im wondering how the company will run with the two gone so im not sure id buy in.", "score": 2, "replies": [{"body": "Its success relies on far more than just two people and the companies it already owns are valuable in their own right.", "score": 2, "replies": [{"body": "oh yeah i can see that however id be worried if the company decided to change up its strategy once they were gone", "score": 0, "replies": []}]}]}, {"body": "death dip lmao", "score": 1, "replies": []}]}, {"body": "And if you don't have a quarter million dollars to throw away?", "score": -22, "replies": [{"body": "BRK.B is trading at like $179. You're thinking of BRK.A, which is at $268,000.", "score": 34, "replies": [{"body": "Don't I look like a fool", "score": 66, "replies": [{"body": "Eh, it happens. Wasn't like you were way off base.", "score": 5, "replies": []}]}]}]}]}, {"body": "Visa. Shits never going away.", "score": 37, "replies": [{"body": "Bought right before earnings and am up 11%. Only regret is only purchasing 11 shares lol", "score": 5, "replies": []}, {"body": "What are your thoughts on Mastercard", "score": 3, "replies": [{"body": "It is not necessarily a bad option, but if you are investing in the credit card realm VISA wins out and you might as well go VISA. Steady, steady, growth. 323M cardholders vs Mastercards 191M. \n\nI guess if you wanted to avoid the all eggs in one basket you could split it, but heck if the sector fails or gets hit VISA will probably be the one standing strongest. ", "score": 2, "replies": []}]}, {"body": "What about the blockchain? Why can't it provide the same infrastructure Visa has?", "score": -8, "replies": [{"body": "They have Visa cards where you can use crypto currency.", "score": 1, "replies": [{"body": "Crypto is set for a big fall.", "score": 6, "replies": [{"body": "Why's that?", "score": 1, "replies": [{"body": "http://kdal610.com/news/articles/2017/sep/14/bitcoin-exchange-btcchina-says-to-stop-trading-sparking-further-slide/ \n\nthis for starters", "score": 2, "replies": [{"body": "ðŸ™„", "score": 1, "replies": []}]}]}]}]}]}]}, {"body": "$VOO", "score": 36, "replies": [{"body": "Serious question, and one that I have whenever I look at ETFs in this price range: What's the point in investing $1000 in an ETF that costs nearly $250? That's only four shares. The average quarterly dividend looks to be a little less than a dollar. Say $16/year in dividends reinvested is 0.07 shares per year. That's... not a lot.\n\nIs that really worth it, especially since this bull market will eventually stop at some point in the next twenty years? I assume he won't be actively managing it. Why not buy a savings bond or some other type of fixed income and guarantee the investment has appreciated some when the kid is age 18?\n\nAnd if you're going to take the risk, why not just buy an index fund that's cheaper per share?", "score": 2, "replies": [{"body": "The cost of the ETF doesn't matter. Also, you should look at dividends as being % based, sure 1.6% isn't great, but it's about in the middle of value vs growth.\n\nAlso, VOO has an expense ratio of .04, index funds won't be cheaper (and if they are, they probably have an initial investment of well over $1000)\n\nI think for a set it and forget it situation, VOO is about as good as it gets. You're not gonna have 20k in 20 years, but you should get some decent returns and at least double your investment. ", "score": 1, "replies": []}]}, {"body": "Only correct answer", "score": -15, "replies": [{"body": "thats not a stock. incorrect. ", "score": 16, "replies": [{"body": "Etf. Close enough", "score": 4, "replies": []}, {"body": "What is it if its not a stock ", "score": -4, "replies": [{"body": "An exchange traded fund. ", "score": 2, "replies": []}, {"body": "ETF, there are fees that go along with ETFs, something to consider.", "score": -1, "replies": []}]}]}]}]}, {"body": "BAC - Bank of America is around $25 a share and just got a $5 Billion buy from Buffett.  Expect good things in the future.  We all already know a large bank like BAC isn't going anywhere.", "score": 9, "replies": [{"body": "While it's unlikely, [never say never.](https://en.wikipedia.org/wiki/List_of_largest_U.S._bank_failures)", "score": 1, "replies": [{"body": "BAC has what I'll call \"plot armor\" because there is a 0.0000000% chance Trump will allow BANK OF AMERICA to fail", "score": 1, "replies": []}]}]}, {"body": "SPY, UPRO, QQQ, VOO, or VTI. ", "score": 9, "replies": []}, {"body": "[deleted]", "score": 14, "replies": [{"body": "With TD Ameritrade I don't think there is a drip fee.", "score": 0, "replies": [{"body": "I've never heard of a fee to reinvest divs", "score": 4, "replies": []}]}]}, {"body": "BRK.B or some solid ETF. I'm in EEM and feel comfortable with it", "score": 8, "replies": []}, {"body": "Visa", "score": 5, "replies": [{"body": "I dunno. The blockchain could easy disrupt Visa.", "score": -5, "replies": [{"body": "\"Easy\" is a massive overstatement.", "score": 8, "replies": []}]}]}, {"body": "Nep with drip", "score": 3, "replies": []}, {"body": "Quantum computers without any hesitation. ATOS & IBM.", "score": 3, "replies": [{"body": "Just looked up ATOS. Very good financials with room to move. Thank you I will buy some this morning.", "score": 2, "replies": [{"body": "I don't know much about pharma, but ATOS looks like a dumpster fire to me. Am I missing something appealing about it?", "score": 1, "replies": [{"body": "ATOS SE", "score": 1, "replies": [{"body": "Ah ha, that makes much more sense. Cheers", "score": 1, "replies": []}]}]}]}]}, {"body": "How about GE?\n\nIt's the only stock continuously part of the Dow 30 from when the Dow index was expanded to 30 stocks in 1928.\n\nThat's a pretty decent indicator of the relevance of the company to the US economy over the years.", "score": 3, "replies": [{"body": "GE is in a major downtrend.  This whole year, anytime I thought the downtrend was going to break, it just kept going down.  I'll still be waiting for that breakout before buying.", "score": 1, "replies": [{"body": "I think the stock sucks from a current return standpoint. And as a former GE employee I own more of it than I'd like to. But the original post was about a long term hold so that is why I replied as I did. ", "score": 2, "replies": []}]}]}, {"body": "Surprised nobody has stated the obvious yet - I would throw it into a Vanguard Total Market or S&P 500 Index Fund. ", "score": 3, "replies": []}, {"body": "Apple or baba", "score": 9, "replies": []}, {"body": "I'd stay away from green energy, vertical farms, GMO. These are not long-term stocks because many of them are not viable. A long-term stock is something that is viable right now, otherwise you're just guessing.\n\nLook at what Warren Buffet is investing. He embraces old businesses that have been around and are not going anywhere. These are the type of agricultural businesses, for example, that buy vertical farm companies and GMO companies. Or old energy companies that buy green energy companies -- the type who are stable and not all bluster.\n\nThink about transportation and construction: someone needs to make the parts. Someone needs to make the parts that make the parts.\n\nAfter 2008, I invested in rail stock because I noticed it was actually stable. It then skyrocketed and remains very high today. This was partly because of energy prices but also a resurgence on the convenience and cheapness of rail to move goods. No one was telling anyone to invest in rail in 2008 -- and still not much today. I still think it's the best type of stock. After all, we're not importing the wagons. We make them here. High speed rail doesn't count.", "score": 5, "replies": [{"body": "No indication the subsidies are about to get pulled out, but most of these companies couldn't survive without them. Not what I would call a safe bet at all.", "score": 1, "replies": [{"body": "Yeah, the green industries are very risky.", "score": 1, "replies": []}]}]}, {"body": "AGRO\n\nThey own farmland in South America and a number of ethanol plants. With the world population growing to 9 billion by 2050 and the quantity of arable land necessarily limited, ownership of the lowest cost, highest productivity agricultural land is a great long-term investment. Plus their ethanol assets should benefit from a long-term trend of moving towards renewable fuels (biofuels included).", "score": 2, "replies": []}, {"body": "Are you wanting a gamble or a long term stock? I am currently gambling on $EDIT and $CRSP these are biotechs working on gene editing. However they very easily could be worth zero in a few years. ", "score": 2, "replies": [{"body": "I've been thinking a lot about these lately, just haven't been able to pull the trigger... The whole gene editing scene is still so uncertain especially on the regulatory side.\n\nI applaud you for the risk taking, hope you reap great rewards from the great risks. ðŸ‘ðŸ¼", "score": 2, "replies": []}]}, {"body": "JNJ - had it for decades always solid performance.", "score": 2, "replies": []}, {"body": "ADBE", "score": 2, "replies": [{"body": "Seems too good to be true its recent growth. Any reasons its not going to slow or fall? It can't keep up that level of growth ", "score": 1, "replies": []}]}, {"body": "CWEB. Its a 2x leveraged ETF and its growth potential is magnificent.\n\nTop 4 holdings: \nBABA\nBaidu\nTencent\nJD\n\nVery great growth potential for a long while. It has almost tripled in value since a year ago.\nIts riskier for sure but for high growth that is to be expected. I see those top four holdings being strong contenders even a decade later too.", "score": 2, "replies": []}, {"body": "BA is perfect for \"long term\" purposes.", "score": 2, "replies": []}, {"body": "Google!", "score": 2, "replies": []}, {"body": "Once the tech is available, go for the space mining company.", "score": 2, "replies": [{"body": "SpaceX?", "score": 1, "replies": []}]}, {"body": "AMZN or DIS because they will own everything in the future. ", "score": 3, "replies": [{"body": "How in any sense will Disney own everything?", "score": 11, "replies": [{"body": "Disney owns media, a large chunk of media. They are also the owners of every girls heart. I would say they have at least a good start to owning everything. ", "score": 4, "replies": [{"body": "Tell that to the stock.  -Bagholder since 2015.", "score": 2, "replies": []}]}]}, {"body": "Disney Planet is just a TV channel right now. In the future, it will be an actual planet, and Disney will own it. ", "score": 8, "replies": [{"body": "They will have their news there and all of the sports will be played. \n \nEdit: Can't spell ", "score": 1, "replies": []}]}, {"body": "Scary but I tend to agree. Regulators seem fine with multi-billion dollar companies buying others as long as it's all in different sectors.", "score": 2, "replies": []}]}, {"body": "I will never sell my DIS.", "score": 3, "replies": []}, {"body": "BLDP - they are a sleeper and just starting to rumble. Will be a major player in fuel cell tech", "score": 4, "replies": [{"body": "I just read an article that they are now able to manufacture fuel cells with almost no platinum. I usually don't buy penny stocks but, they look like they actually have a future. Have to look into them more. ", "score": 1, "replies": []}]}, {"body": "DLR. they own data centers.", "score": 2, "replies": [{"body": "Not that I'm Warren Buffet or anything, but my fear with DLR is that massive data centers will not be necessary in the future. Chips are being made that are much smaller and use less silicon, which may lead to DLR being irrelevant 10 years down the road. ", "score": 3, "replies": [{"body": "That's a good point but data centers are not just cold storage. They are active and there's a ratio of storage to cooling/space required. That ratio changes but so does the amount of data/bandwidth needed. ", "score": 1, "replies": []}]}]}, {"body": "BZUN ", "score": 2, "replies": [{"body": "China to da moon.\n\n>I'm okay with taking a big gamble\n\n$BZUN\n\n$BABA\n\n$CQQQ or\n\n\n$KWEB ($CWEB - double leverage)\n", "score": 2, "replies": []}]}, {"body": "$ATVI ", "score": 2, "replies": []}, {"body": "Being a Canadian Investor, I would personally buy some shares of $BAM.A or even $TD if I was looking at individual companies. Like others have said, however, the best answer is probably just grabbing some low cost index tracking etfs ($VOO or what have you).", "score": 1, "replies": []}, {"body": "$HTM with current 30 year PPAs in place, they will be afloat for some time now. If they can ever execute on new PPA's, liftoff.\n\nWhy not just 3 shares of $TSLA though? Price per share makes no difference. A 10% change is a 10% change regardless of whether you have 3 shares of Tesla or 30 shares of Intel.\n\n$NOK with DRIP otherwise. They are one of a handful of telecomm equipment vendors, and once 5G adoption picks up, they will be sitting pretty.\n\n", "score": 1, "replies": []}, {"body": "SQ on the next dip", "score": 1, "replies": [{"body": "SQ to the moon!", "score": 1, "replies": []}]}, {"body": "I would do a smallcap value etf.", "score": 1, "replies": []}, {"body": "Disney. Perfect for a kid, reliable company and is at a decent entry point right now. ", "score": 1, "replies": []}, {"body": "Go for a drone company ", "score": 1, "replies": []}, {"body": "For *true* set-and-forget, I'd say it really only makes sense to go with some total-market ETF.\n\nI mean, Tesla might seem interesting, but 18 years from now who the fuck knows where they'll be?\n\nHeck, even Visa, which I'd agree is a great company that's not going away any time soon, who knows what disruption fintech will sow?\n\nSame even with Berkshire. If Buffet eventually passes away, is there a guarantee BRK will continue as well as it did in the past?\n\nGreen energy... too much uncertainty about who'll be the big player.\n\nThese are all not bad considerations for long term stocks of someone who will still keep an active eye on things just in case entire market realities change.\n\nFor set and forget, the problem is that *any* company, no matter how large, might eventually fall on hard times.\n\nI'd say a US total stock market ETF would be much safer while still having potential for amazing gains. Why? Because the US economy will keep growing. You guys (I'm not from the US) just capitalism and consumerism too much for it not to. The only way US stocks fail is if somehow US consumers go on strike and say: \"You know what, our phones, computers, cars, homes, all that? They're good enough now. Nobody is gonna invent better ones now. And nobody is gonna invent new products that we might want to buy. This is it, the best we can do and ever will\".", "score": 1, "replies": []}, {"body": "Why not use a mutual fund? Would be the easiest way to protect an investment you're not watching.", "score": 1, "replies": []}, {"body": "Lol tan. Solar is a dumpsterfire and can't compete with china since the Chinese r pumping huge amounts into their companies. Just look at that 5 year and that's in a bull market. U better off buying jnj or high growth like shop", "score": 1, "replies": []}, {"body": "TSLA.  \n\nThe Model 3 is going to make it the iPhone of automobiles.  The waiting list already north of 500,000 and growing at last count by 1800 a day.\n\nBuy the stock now, get on the waiting list, and by the time they can deliver the car it will be free.  Possibly by then, you might want a Model S instead - it will be free too.", "score": 1, "replies": []}, {"body": "United Parcel Service $UPS", "score": 1, "replies": []}, {"body": "V, GXF, CWEB, PYPL, CIBR, EDIT, LRCX", "score": 1, "replies": []}, {"body": "Buy him a few shares of Apple.... Literally not going anywhere. Won't stop growing, will be a trillion dollar company soon. ", "score": 1, "replies": []}, {"body": "TSLA", "score": 2, "replies": []}, {"body": "baba, you can choose to hold baba until Jack Ma retires.", "score": 1, "replies": []}, {"body": "I second TAN, with the addition of FAN.", "score": 1, "replies": []}, {"body": "$TSLA", "score": 1, "replies": []}, {"body": "I think your goals are a little bit at odds with each other.\n\nImagine this kid turns 18 or graduates college or whatever, and you say to him or her \"Sorry, I tried investing in your name and blew it on a green energy stock that shit the bed in the Great Recession of 2025.\" What is s/he supposed to do with that information? What does that accomplish?\n\nIf the goal is to provide your nephew or niece with something they can actually use, either to help pay for college or make a down payment on their first house or whatever it is they might do, then you should just park some money in something that's safe, like a total market ETF. Gamble with your own portfolio, not with someone else's.", "score": 1, "replies": []}, {"body": "We are at the start of a Republican presidency, military contractors will be solid bets $BA, $RTN ect. ", "score": 0, "replies": [{"body": "Already priced in", "score": 3, "replies": []}]}, {"body": "solar stocks", "score": 0, "replies": []}, {"body": "Secure bonds. Forget the stocks for baby shamis", "score": -1, "replies": []}]}
{"title": "$AAPL stock falling after admitting Apple Watch connectivity issues. Anyone catching the falling knife?", "selftext": "", "id": "71besv", "created_utc": 1505917558.0, "score": 159, "upvote_ratio": 0.96, "num_comments": 106, "comments": [{"body": "[deleted]", "score": 87, "replies": [{"body": "Should have put it all on MU", "score": 1, "replies": []}, {"body": "> As for reasoning, I have a gut feeling aapl is going to surprise us on the 12th with a bunch of magic. It won't be surprising to me if we see aapl hit $191 that week.  \n  \nBingo!\n", "score": 1, "replies": [{"body": "191? Such arbitrary.", "score": 1, "replies": []}]}]}, {"body": "aren't the Chinese going to buy these 8's up like crazy because 8 is lucky. that's my DD.", "score": 65, "replies": [{"body": "Ayeee", "score": 13, "replies": [{"body": "tttt", "score": 4, "replies": []}, {"body": "Ayee Ma Dd", "score": 2, "replies": []}]}, {"body": "I don't think we saw this trend for Iphone 6. So, no I don't think this is happening. ", "score": 3, "replies": [{"body": "shit. there's always 9 i guess.", "score": 3, "replies": []}]}, {"body": "Damn this is some good DD", "score": 3, "replies": []}, {"body": "I posted this and got down voted. Buy anyways, I'm catching this knife", "score": 2, "replies": [{"body": "I think they should have called the vanilla iPhone the iPhone X and the expensive one the iPhone 8 for this exact reason", "score": 2, "replies": []}]}]}, {"body": "Bought in at $160.47\n\nFeeling pretty stupid rn", "score": 27, "replies": [{"body": "it ok, it'll be back in the fall", "score": 14, "replies": [{"body": "sell calls", "score": 6, "replies": [{"body": "Lol assuming he has 100 shares.", "score": 1, "replies": [{"body": "True he's probably got like 4", "score": 3, "replies": []}]}]}]}, {"body": "That's where the short leg of my bull put spread is. 10/20 let's gooo.", "score": 2, "replies": [{"body": "I don't speak options, bich.", "score": 4, "replies": [{"body": "Means we're in the same boat frendo. I sold puts [to open, i.e. short] at 160 and bought puts [to open, i.e. long] at 155 to limit my risk, receiving the difference in value as cash in my account since the short put is worth more than the long put. If these expire with AAPL above 160, I keep that difference.\n\nedit: clarification that it's a spread", "score": 5, "replies": [{"body": "Thank you for explaining what buying options at one price and selling them at another price does. Now we all know you're a little nublet who's gonna get greedy and lose it all on one naked call", "score": 2, "replies": [{"body": "That goes for every trade ever, nublet.\n\nHe didn't know what a credit spread was, I told him. Sorry you lost money today, or whatever.", "score": 2, "replies": []}]}]}]}]}, {"body": "Have you checked that you're not just pretty stupid in general? ", "score": 1, "replies": [{"body": "what does the military have to do wit it?", "score": 1, "replies": []}]}]}, {"body": "Bought calls lol. Some yolo 160/162.5/165 Oct 27th after earnings date, hopefully this shit runs up and I can dump it before earnings. ", "score": 23, "replies": [{"body": "The iPhone X will be a hit. iPads are the best tablet out there. Every college kid has a MacBook. It's a good dip to buy in because it's going to rise this fall.", "score": 26, "replies": [{"body": "Yeah. People will willingly spend a thousand on the X. I'm long on Apple. iPhones have always been expensive. And the iPhone X will again be a status symbol, it looks different and new.", "score": 2, "replies": []}]}, {"body": "Tempted to join you in this bull fuckery. but I don't think I know options enough.", "score": 9, "replies": []}, {"body": "Bought 157.5 calls for oct 6th. Yolooooo", "score": 1, "replies": []}, {"body": "I doubled down soon after it started popping back.   \nI figured 2% fall (18 billion of market cap) doesnt make sense. ", "score": 1, "replies": []}, {"body": "I bought calls too. But yesterday. So, I'm pretty much feeling like a massive faggot at this point. ", "score": 1, "replies": []}]}, {"body": "This seems overblown - they'll fix it via software update like they always do. Already had a buncha calls that are red as fuck but whatever I'm buying more.", "score": 23, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Oh yeah and that totally destroyed the company. Never recovered. ", "score": 11, "replies": [{"body": "[deleted]", "score": -3, "replies": [{"body": "Geez the salt. It's grabbing onto unknown wifi networks instead of staying on cell data. Does that sound like hardware failure? Settle down Beavis", "score": 8, "replies": []}]}]}]}]}, {"body": "If you think this has anything to do with \"Apple Watch connectivity\" then you're a fucking idiot.", "score": 35, "replies": [{"body": "then what is it?", "score": 3, "replies": [{"body": "iphone X production won't be able to match the demand and analysts saying fewer people are going to be upgrading to 8/X. \n\nBasically if you are holding a long position fuck analysts because it tends to work out in the long run. ", "score": 27, "replies": [{"body": "[deleted]", "score": 6, "replies": [{"body": "I'm just conveying what the talking heads are on about. I'm sure Q3 earnings will be good. I held through the pullback from a couple of years ago and I'll continue through this one. ", "score": 2, "replies": []}]}, {"body": "> and analysts saying fewer people are going to be upgrading to 8/X.\n\nthey've said the exact same thing ever since the second iphone came out lmao", "score": 5, "replies": []}, {"body": ">won't be able to match demand\n\n>fewer people will be upgrading\n\nwut ", "score": 4, "replies": [{"body": "FFS, does this really need to be explained? \n\nLet me explain this as if you're a toddler. Apple can make 10 phones. People want 15. There is a shortage of 5. Random analyst thinks people should want more, ie they think there *should* be a higher demand, say 30. Expectation on stock lowered. \n\nAlso nice work selectively picking apart my statement since I made no mention of a shortage of the model 8, which I have no idea if it actually exists or not, just that the current rumor is that X demand won't be able to be met. \n\nAnd once again these are not my opinions or views. ", "score": 2, "replies": [{"body": "Ayyyye salty ", "score": 3, "replies": []}]}]}]}]}]}, {"body": "It's not a falling knife.... it's fucking aapl and one day downtrend is not a falling knife lmao. ", "score": 15, "replies": [{"body": "in wsb .5% down is a major dip :D\n", "score": 4, "replies": []}, {"body": "It is when you've got 3k in just OTM FDs like a retard", "score": 1, "replies": []}]}, {"body": "Spent  3k on weekly calls  yesterday. So much red ðŸ˜­", "score": 13, "replies": [{"body": "Just added another 20 weekly contracts at .10 to reduce my total cost basis by half for $200.  C'moooon Aahh puuulllll", "score": 3, "replies": []}, {"body": "#BB WHAT IS YOU DOIN#", "score": 7, "replies": []}]}, {"body": "Just loaded up in my retirement account at 154.30.\n\nLet's run up to earnings boys", "score": 10, "replies": []}, {"body": "No. It's because the iPhone 8 pre-sales came in way less than expected.\n\nThis kind of move doesn't happen on a device that's only 5% of their sales.\n\nedit: now the iPhone X is delayed.", "score": 14, "replies": [{"body": "\n>No. It's because the iPhone 8 pre-sales came in way less than expected.\n\n\nSOURCE? Or are you talking shit out of your ass? ", "score": 3, "replies": [{"body": "My DD is rock solid. However, past performance is not an indicator of your eventual losses.", "score": 1, "replies": [{"body": "\n>My DD is rock solid. However, past performance is not an indicator of your eventual losses.\n\nTalking out of your ass confirmed.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "You just keep getting dumber.\n\n\"It believes the iPhone X is a prime reason why the iPhone 8 is so readily available.\"\n\n\nStock is cooling due to apple Watch glitches more than this, ya dumb fuck. ", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 6, "replies": [{"body": "Samsies except spreads ", "score": 2, "replies": []}]}, {"body": "Fuck yeah just bought in at 155$ :)", "score": 5, "replies": []}, {"body": "Thats it apples done heading to $0 no sales wothless company ", "score": 4, "replies": []}, {"body": "Got out Monday. Maybe get back in later this week. ", "score": 3, "replies": []}, {"body": "Not yet.  Have a feeling it's going to 155, maybe lower.  But hey, what do i know.", "score": 3, "replies": [{"body": "Dropped below, but it's hovering near this point. Either The Fed changes this or it closes near here.\n\nHoping my FD's can get some nice value tomorrow!", "score": 3, "replies": []}]}, {"body": "Did anyone exaggerate hyperbole?", "score": 3, "replies": []}, {"body": "Tim Cook has taken a dump over Apple's design mojo.", "score": 3, "replies": []}, {"body": "Easy dip to buy into with earnings right around the corner. iPhone 8 may not be that great of a hit because everyone is waiting for iPhone X. I loaded up calls for 157.5 on October 6", "score": 3, "replies": []}, {"body": "Bought fd's (Sept. 22) for the $157.50 strike at $0.35.\n\nLets see how this goes.", "score": 2, "replies": [{"body": "Yeah boi ", "score": 1, "replies": [{"body": "Took profit at +33%.\n\nFelt good.", "score": 2, "replies": []}]}]}, {"body": "I just bought in at $154 with spread expiring 9/29", "score": 2, "replies": [{"body": "Was close to 3% at one point, then people realized it was a good time 2 tendie up. ", "score": 2, "replies": []}]}, {"body": "It's down 1.8%.  What the fuck are you talking about falling?  Jesus christ you kids have poop for brains.", "score": 2, "replies": []}, {"body": "it's also lower preorder volume that's making the stock fall", "score": 2, "replies": []}, {"body": "Apple Watch with data is dumb. Batt life already meh on watch and add data and boom u can't even go an entire day on a full charge", "score": 6, "replies": [{"body": "[deleted]", "score": 19, "replies": [{"body": "I only have my Fitbit because my work says they will give me back 50 bucks a month if I go outside and can prove I am \"walking\". I jerk off twice a day with it instead. I get about 5,000 steps with each session, 3,000 if it is a good Asian or Amateur session like some of the women of /r gwcumsluts. I would want to know what Fitbit would be like without all these fucking dumb work based incentive programs to encourage people to be healthy to reduce insurance costs.", "score": 16, "replies": [{"body": "Whats your heartrate get to?", "score": 1, "replies": [{"body": "120 usually unless I take a xanax or something before I jerk it. I am married so I have that constant anxiety that my wife is gonna walk in at any moment you know?", "score": 3, "replies": [{"body": "Let me think... 5,000 steps at 2 strokes a second....2,500 seconds/60=41.6 repeating.... dear god. Not too anxious. Maybe a little faster so half hour. About regular", "score": 1, "replies": [{"body": "A Fitbit isn't that scientific. Sometimes I got 4 to 10 steps on a stroke. ", "score": 2, "replies": []}]}]}, {"body": "90 resting to 180+ \n\nMust be a fat sack of shit to jack off to fool company Fitbit instead of actually exercising a little ", "score": 2, "replies": [{"body": "\"The gps says you didnt move for half an hour Johnson, how do you explain yourself?\"\n\n\"I pulled a muscle so i ran in place\"", "score": 2, "replies": []}]}]}, {"body": "any other subreddit links?", "score": 1, "replies": [{"body": "can't believe you got downvoted my man, what kind of savages do we have here.", "score": 1, "replies": []}]}]}, {"body": "Well yeah for people who never go outside", "score": 22, "replies": [{"body": "the marginal benefit to using a smart watch over just pulling your phone out of your pocket is basically zero.\n\neven if you're just trying to look cool in front of your friends with a cool new tech device, you still look like an out of touch retard.\n\nsmart watches will go the way of google glass within five years.", "score": -4, "replies": [{"body": "Lmao. 5 years is an INSANE length of time in technology.", "score": 6, "replies": []}, {"body": "Again you clearly dont go outside. Theyre good for when youre actually active like running or biking.", "score": 2, "replies": [{"body": "Seriously. Cellular connectivity for the Apple Watch is a huge gamechanger for active people.", "score": 1, "replies": []}, {"body": "There are already products that have been around for literally decades that do the same thing re: sports data logging that cost a fraction of an Apple Watch.", "score": 0, "replies": [{"body": "Yes, and analog phones have been around for decades, so why buy an iPhone.  You're missing the point entirely here:  the watch is not for you, but that doesn't mean it doesn't have valid use cases.", "score": 2, "replies": [{"body": "Lol bud, we both know that iPhone comparison isn't remotely applicable given smart watches have been marketed to death and the public hasn't really adopted them. Your fantasy consumer that actually has a use (sports) is a minute proportion of the people who buy these things. Becky is only buying it to impress her friends at the state college she goes to.\n\nIt sounds like you really like your shiny accessory, but the reality is it's a tech fad with barely any utility gain", "score": -1, "replies": []}]}]}]}]}]}, {"body": "Smart watches aren't smart?", "score": 4, "replies": []}, {"body": "And they're super duper gei. ", "score": 0, "replies": []}]}]}, {"body": "Playing a little FD with puts... Let's see what we can do", "score": 2, "replies": [{"body": "I inversed you.", "score": 4, "replies": [{"body": "In around 10:45am, out at ~noon, ~23% gains... Really just offset by $Veri losses so nothing crazy", "score": 2, "replies": [{"body": "I took profit at 33%.\n\nWell played.", "score": 2, "replies": [{"body": "Cheers. Just curious: did you buy 9/22 155 calls when it dipped to low ~$154 today?", "score": 2, "replies": [{"body": "$157.50 and $160's. 160's were 100% profit in minutes. Didn't look back.\n\n\n....I lied, I kept checking to see if I got the best price.", "score": 2, "replies": [{"body": "Wow, I didn't realize options that far OTM could profit so quickly, awesome!", "score": 2, "replies": [{"body": "They're the riskiest by nature. ", "score": 1, "replies": []}]}]}]}]}]}]}]}, {"body": "Yeah within a week perhaps\n", "score": 1, "replies": []}, {"body": "bought $157.50 calls with a Sep 29 expiration @1.19\nbetting it goes up tomorrow or Monday.  it's apple so it doesn't make sense, and people will read any sign as good news.  even low iPhone 8 demand will be seen as high iPhone X demand.  if you can believe it, I bought AAPL puts yesterday and sold them this morning.", "score": 1, "replies": []}, {"body": "Looks like it's useless to expect from AAPL moving over $160 in the nearest time. ", "score": 1, "replies": []}, {"body": "It is Apple. People will buy it anyways.", "score": 1, "replies": []}, {"body": "Caught it at $155. Let's roll!", "score": 1, "replies": [{"body": "Fuck.", "score": 1, "replies": []}]}, {"body": "Tried, but seems like it's still falling", "score": 1, "replies": []}]}
