{"title": "r/StockMarket Weekly Stock Picking Contest for the Week of (10/3-10/7) is now open for picks! *Rationale Required!*", "selftext": "# r/StockMarket Stock Picking Challenge for the Week of (10/3 - 10/7)\n\n**PLEASE READ THESE RULES THOROUGHLY BEFORE POSTING UP YOUR PICKS!**\n\n# SEE RECENT NEW RULE CHANGE #7 AT THE BOTTOM -- RATIONALE NOW A REQUIREMENT!!!\n\n**If you want to be eligible to participate in this week's contest here is what you need to do (REQUIRED!):**\n> * 1.) Post 2 tickers (ex. AAPL = Apple) but **YOU MUST** pick 2 not just 1 or else I will not add you to our list of contestants!\n> * 2.) Choose either Long or Short for each ticker (Obviously LONG - if you think it will go up ... or SHORT - if you think it will go down this week...)\n> * 3.) Both of your picks **MUST** each be at least $2 at the very minimum!\n\n**Contest Rules (READ THESE AND FOLLOW THEM!)**:\n> * 1.) No OTC or Foreign companies.\n> * 2.) No Options, Futures, Forex, stuff like that... Equities ONLY that trade on the U.S. Stock Exchange!\n> * 3.) If you don't post both the ticker AND the direction (LONG/SHORT) you won't be added to the list of contestants for this week's stock picking challenge!\n> * 4.) You cannot duplicate someone's exact play! For example- If someone picks AAPL - Long and BAC - Long first then you can only pick AAPL - Short and BAC - Long or AAPL - Long and BAC - Short *<-- you may only duplicate 1 pick but not BOTH!* This is a first come, first serve basis here.\n> * 5.) Picks absolutely **MUST** be posted in here before the 9:30AM eastern cash market open on Monday morning!\n> * 6.) You are only allowed 1 leveraged ETF. If you choose two, the second of the two does not count and is still up for grabs. If incorrect picks go un-noticed, you risk your position being forfeited! (These are the 2x/3x ETF's)\n> * 7.) RATIONALE - You **MUST** post up a rationale (either technical or fundamental) for both of your picks or you will **NOT** be entered into this week's contest!\n> * 8.) Please **DO NOT EDIT** your picks!! If you absolutely must choose another pick, please use a separate post and state that you are changing your original pick to something else!\n\nI will post up the live contest spreadsheet a little after the market closes on Monday with everyone's picks posted, this will include your opening prices, current prices, P&L, & Total ROI for each of your picks, as well as an overall total ROI and an overall average ROI between 2 of your picks, and that will be what we will use to total up both of your 2 picks!\n\nIn addition, since we're doing this contest on Reddit, no one will be able to close out their picks during the trading week... Everyone's picks will close at Friday's close! And also everyone's picks will start at Monday's opening prices.\n\nGood luck to everyone in here! Let's see who can deliver the 2 best picks for this week and take bragging rights as the best stock picker of the week here at r/StockMarket! :)\n\nIf you have any questions about anything feel free to fire away on this thread...\n\nAlso, for anyone looking around for our past weekly contest threads & results here they are!:\n\n* **[r/StockMarket Stock Picking Challenge for the week of (8/29 - 9/2)](https://www.reddit.com/r/StockMarket/comments/500y92/rstockmarket_stock_picking_challenge_for_the_week/)**\n\n* **[Congratulations to this week's r/StockMarket Stock Picking Contest WINNER -- bigbear0083! (:-p)](https://www.reddit.com/r/StockMarket/comments/50vufj/congratulations_to_this_weeks_rstockmarket_stock/)**\n\nHere was our 2nd weekly contest thread & results on r/StockMarket:\n\n* **[r/StockMarket Stock Picking Challenge for the week of (9/12 - 9/16)](https://www.reddit.com/r/StockMarket/comments/52avw0/rstockmarket_stock_picking_challenge_for_the_week/)**\n\n* **[Congratulations to this week's r/StockMarket Stock Picking Contest WINNER -- ghostofgbt!!](https://www.reddit.com/r/StockMarket/comments/534e73/congratulations_to_this_weeks_rstockmarket_stock/)**\n\nHere was our 3rd weekly contest thread & results on r/StockMarket:\n\n* **[r/StockMarket Weekly Stock Picking Challenge for the Week of (9/19 - 9/23) is now OPEN for PICKS! :)](https://www.reddit.com/r/StockMarket/comments/537xfp/rstockmarket_weekly_stock_picking_challenge_for/)**\n\n* **[Congratulations to this week's r/StockMarket Stock Picking Contest WINNER -- ajcunningham55!](https://www.reddit.com/r/StockMarket/comments/5476el/congratulations_to_this_weeks_rstockmarket_stock/)**\n\nAnd here was our 4th weekly contest thread & results on r/StockMarket:\n\n* **[Weekly Stock Picking Contest for the Week of (9/26 - 9/30) is now OPEN for PICKS!](https://www.reddit.com/r/StockMarket/comments/54894f/weekly_stock_picking_contest_for_the_week_of_926/)**\n\n* **[Congratulations to this week's r/StockMarket Stock Picking Contest WINNER -- Shadowbannedjustcuz!!](https://www.reddit.com/r/StockMarket/comments/55agcy/congratulations_to_this_weeks_rstockmarket_stock/)**\n\nHope to see another great show of participation in here once again this week from everyone here at r/StockMarket!:)\n\nAgain please try to get those 2 picks in before the 9:30am EST market open on Monday! Ready, set, GO!!!\n\nI'm getting another super early start to next week's contest so let's try to ramp it up on the participation this week!! :D\n\nHave fun all and GLTA! :)", "id": "55d2du", "created_utc": 1475326232.0, "score": 7, "upvote_ratio": 0.77, "num_comments": 28, "comments": [{"body": "Amd - long. Thing is on a tear, gonna bust right through 7 like a bbc\n\nDb - long. Markets rigged by illuminati, man. ", "score": 2, "replies": []}, {"body": "DB - Long, Good news coming out from the Bank with the Chairman's letter. ECB announced would step in to bail out bank to stop another \"Global Financial Crisis\" Strong buying predicted this week.\nRGSE - Short Insider selling, converting shares into common shares on the 1st, they will be selling for an instant 20% profit lots of selling predicted this week. ", "score": 2, "replies": []}, {"body": "**NTNX** - Short, the IPO hype-train will settle down this upcoming week\n\n**YUM** - Long, earnings will beat and the stock will pop", "score": 1, "replies": [{"body": "NTNX isn't shortable at this time.", "score": 1, "replies": []}, {"body": "Short amzn n twlo while you're at it.", "score": 1, "replies": []}]}, {"body": "AYI - Long, graphic looks amazing with a support at 261 and earnings next week \n\n\nWFC - Short, politics ", "score": 1, "replies": []}, {"body": "Long DB, they'll work out a revised settlement\nLong MU, semis have been doing great. No reason to think they aren't either. ", "score": 1, "replies": []}, {"body": "HQY - Long, it will breakout past it's resistance this week.\n\nCFI - Short, playing a technical for fun; bearish indicators last week.", "score": 1, "replies": []}, {"body": "Dwti - long OPEC did nothing, hype will end this week.\n\nAppl - short just lost retrial on FaceTime patent 350m$", "score": 1, "replies": []}, {"body": "TLYS long - i like the technicals, serious momentum\n\nXIV long - i dont see the catalysts next week, ill short volatility", "score": 1, "replies": []}, {"body": "Long TWTR Bidding war could keep pushing this up, would put a stop loss every step of the way though, very volatile to news \nLong ZYNE Lots of attention from Biotech firms after and great management changes, recently hired Morgan Stanley to handle potential offers", "score": 1, "replies": []}, {"body": "Short CC - this company has rallied with not very much to sustain it. Weak balance sheet and lawsuits. \n\nLong NOV - this stock tends to lag oil, so I believe it will appreciate with the oil production agreements. ", "score": 1, "replies": []}, {"body": "AMD Long : I've held this for a while and will continue to do so. This stock will keep grinding up. I'm expecting  7.50 within 2 weeks. \n\nBAC Long : purely a play off strong technicals. Let's see what that gets me. I'm considering a real position here but don't currently own it. ", "score": 1, "replies": []}, {"body": "NLY - LONG went down after dividend, recovery this week, stock is at support point.\n\n\nFIT - LONG - Went down with analysts downgrade, but recovery this week as fundamentals are strong.", "score": 1, "replies": []}, {"body": "TTWO - long - Mafia 3 coming out.\n\nNVDA - long - new tegra chip info", "score": 1, "replies": []}, {"body": "AMBA long -- broke out of 73 and i see it going higher \nACIA long - will test its first 50 day moving avg and shoot up! ", "score": 1, "replies": []}, {"body": "CHMA - Long. Increasing volume on Friday and this stock has $4.85 cash per share. It just broke above the 50ema last week.\n\nKOPN - Long. Bullish engulfing candle and bounced off 200sma support on Friday.", "score": 1, "replies": []}, {"body": "**NVFY** - Short: 8.5 million dollar deal spiked market cap almost 100% Um, no.\n \n**JMEI** - Long: About to come over the 200dma on a nice beaten pattern. China stock w/ heavy short interest and low float. ", "score": 1, "replies": []}, {"body": "KDMN - LONG.  over sold.  bullish divergence.  expecting MM to pump before more dump.\n\nCTMX - SHORT.  over bought.  bearish weekly candle.   momentum indicators all accelerate downwards on daily.", "score": 1, "replies": []}, {"body": "Twlo - long\n\nTTD - long\n\nBoth stocks took massive dips last week and didn't recover much. I expect some recovery this week. ", "score": 1, "replies": []}, {"body": "**DB** - Long - The idea that they will go under is BS, as well as the fine drop, can see this coming back to $13\n\n**YHOO** - Long - This still has movement in it, also I am still long on this with real money.", "score": 1, "replies": []}, {"body": "CORN - long ( bad CORN inventory report Friday)\n\nCXRX - long ( technicals only and 27% short float) \n\n\nHope I made it in time. Just remembered. \nEdit: rationale added. Sorry on the road this am. ", "score": 1, "replies": [{"body": "yes sir! you're good ... only you forgot to give a rationale for your picks lol :P\n\nhope you can post up some quick rationale so i can have you added to the list of contestants for this week!\n\n/u/bigslimvdub", "score": 1, "replies": []}, {"body": "/u/bigslimvdub - if you can post up some rationale even after the open i'll still add you to the spreadsheet ... but try to get it posted soon lol", "score": 1, "replies": [{"body": "Replied with edit. Sorry was on the road this am unable to edit til now ", "score": 1, "replies": [{"body": "okay, you're good now! thx /u/bigslimvdub!", "score": 1, "replies": []}]}]}, {"body": "i've got you up on my spreadsheet now but don't let me down /u/bigslimvdub lol!\n\nyou've got until tomorrow to post your rationale in here or i'll have to take you off my spreadsheet :P", "score": 1, "replies": []}]}, {"body": "**SPY** - **Long** :US index futures turn high, oil price hits high\n\n**INTC** - **Long** : solid dividends payout\n\n", "score": 1, "replies": []}]}
{"title": "What's a good sell target for AMD? I'm in at $6.40.", "selftext": "I've been holding 1093 shares of AMD at $6.40. Can any give suggestions of a sell target price?", "id": "55d242", "created_utc": 1475326084.0, "score": 24, "upvote_ratio": 0.74, "num_comments": 27, "comments": [{"body": "$5.80", "score": 85, "replies": [{"body": "You are now a moderator of /r/wallstreetbets.", "score": 88, "replies": []}]}, {"body": "This is a silly question with lots of variables. Are you looking for a quick buck on a swing trade, or are you willing to hold as long as there is overall upward trend in the share price? Stocks and the market will have up and down days, and as long as the trend is upward, and AMDs pipeline shows promise for continued growth, I will continue to hold.\n\n\nThink Zen will be competitive and AMD will reclaim market share? Hold through 1H 2017 and then re-evaluate with the release of ZEN and their roadmap for future releases.\n\nThink ZEN is gonna flop? Set a limit sell for 5-10% over what you paid for it then sit and wait. As we near the ER it will almost surely hit that price, your sell will execute, and you'll be sitting there with 5-10% gains on a short hold. ", "score": 14, "replies": []}, {"body": "Ride it out. Around October 20 is earnings, which is looking like it'll be good. You could set a stop limit to try and lock in your earnings. Depends on your risk and if you need the money. ", "score": 7, "replies": [{"body": "Do you really think earnings will be a big catalyst for AMD? It seems like most of the pricing on the stock is speculative towards future growth with the launch of Zen. I'd be surprised if they suddenly smashed it out of the park on earnings. ", "score": 2, "replies": [{"body": "I doubt they'll smash it out of the park but will beat the consensus. \n\nAMD is taking back market share from NVIDIA. Good price/performance on their GPU cards. Battlefield 1 releasing soon which may affect the demand for newer cards a little bit. Overall i think it'll be more positive than negative. If you look back to their last earnings report on Thursday, July 21, 2016, Consensus $-0.08 --> Actual $-0.05 close $5.22 on 7/22 they closed at $5.84, then 7/25 $6.70\n\n\n\nDisclaimer: I am new to investing but am doing my studying. I'm really itching to buy more.", "score": 1, "replies": []}]}]}, {"body": "Tree fiddy", "score": 12, "replies": []}, {"body": "never", "score": 3, "replies": []}, {"body": "buy high sell low ", "score": 6, "replies": [{"body": "The mantra of champions.", "score": 1, "replies": []}]}, {"body": "Don't sell it any time soon. Talk to me in 2018 and then see when you want to sell. ", "score": 2, "replies": []}, {"body": "I just bought a few at $6.34. Just enjoying the ride ", "score": 2, "replies": []}, {"body": "[deleted]", "score": 3, "replies": [{"body": "what? are you recommending going long or short on Sony? You just said both...", "score": 2, "replies": []}, {"body": "RemindMe! 5 months", "score": 1, "replies": [{"body": "I will be messaging you on [**2017-03-02 01:27:56 UTC**](http://www.wolframalpha.com/input/?i=2017-03-02 01:27:56 UTC To Local Time) to remind you of [**this link.**](https://www.reddit.com/r/stocks/comments/55d242/whats_a_good_sell_target_for_amd_im_in_at_640/d8a9biv)\n\n[**CLICK THIS LINK**](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/stocks/comments/55d242/whats_a_good_sell_target_for_amd_im_in_at_640/d8a9biv]%0A%0ARemindMe!  5 months) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete Comment&message=Delete! d8a9ce7)\n\n_____\n\n|[^(FAQs)](http://np.reddit.com/r/RemindMeBot/comments/24duzp/remindmebot_info/)|[^(Custom)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[LINK INSIDE SQUARE BRACKETS else default to FAQs]%0A%0ANOTE: Don't forget to add the time options after the command.%0A%0ARemindMe!)|[^(Your Reminders)](http://np.reddit.com/message/compose/?to=RemindMeBot&subject=List Of Reminders&message=MyReminders!)|[^(Feedback)](http://np.reddit.com/message/compose/?to=RemindMeBotWrangler&subject=Feedback)|[^(Code)](https://github.com/SIlver--/remindmebot-reddit)|[^(Browser Extensions)](https://np.reddit.com/r/RemindMeBot/comments/4kldad/remindmebot_extensions/)\n|-|-|-|-|-|-|", "score": 1, "replies": []}]}, {"body": "Why Sony?", "score": 1, "replies": []}]}, {"body": "I bought in at $1.89 around the time Polaris was revealed (February/March?) and more Zen details were released... I sold it all at around $3... God. Damnit.", "score": 4, "replies": []}, {"body": "I mean, they went from ~$5.90 back to $7.00 in less-than two weeks after that second PO. That's a good 16% in that time. I imagine it will keep climbing if Zen and Vega prevail.", "score": 3, "replies": []}, {"body": "I don't want to sound like a prick although I probably will. IF you have this kind of question, you should not be in it. Period.\n\nYou need to know your exits and targets BEFORE you enter the trade. You don't have system, method, trading plan? Then don't trade or you are going to be sorry, sooner or later. \n\nYou first need to know what time frame you are trading, short term, long term... you need to now WHY you enter the trade and you need to follow your trading plan (knowing when you will exit)\n\nUntil you don't have all spelled above, stop trading for real, find some trading system that fits you well, then paper trade it and develop the trading plan. Tweak it until you like it. Once you like it, test it. Paper test it for a long time! ", "score": 2, "replies": []}, {"body": "7 ish", "score": 1, "replies": []}, {"body": "7.50\nIf you can get it", "score": 1, "replies": []}, {"body": "You should not invest in anything if you cannot make such decisions on your own... ", "score": 2, "replies": [{"body": "because seeking outside input is dumb. ", "score": 9, "replies": [{"body": "Never said anything about dumb. ", "score": -2, "replies": []}]}]}, {"body": "3.50", "score": 1, "replies": []}, {"body": "It's gonna be pretty stale from here. It'll probably hit 7 and then play around a lil in there but sell there. make a lil profit. Also with the the Zen coming out sell there. It won't go much higher. Sell when there is good news buy when there is bad.", "score": 0, "replies": []}, {"body": "$AMD yes earning date is on Oct 20, they need a lot of sales to make an impact. Financial still look very bad and no dividend for investors", "score": 0, "replies": []}]}
