{"title": "What the heck is going on with Amazon after hours right now? 6 percent drop. The whole market today has stunk", "selftext": "[deleted]", "id": "59q6po", "created_utc": 1477598809.0, "score": 25, "upvote_ratio": 0.78, "num_comments": 21, "comments": [{"body": "Earnings.  It's a bit odd though b/c the numbers seemed really good except for EPS which they missed.  ", "score": 15, "replies": [{"body": "It's the first quarter they have missed a huge profit increase in their earnings for the past, I think, three quarters. There's also a lot of context. You have most really strong tech companies beating their estimates, but at the same time holding record amounts of cash. \nThe market is also fearful of a surprise rate hike in December. \nElections are November 2, and there is actually some uncertainty about the outcome. \nWhen you see a very large company holding cash, you wonder, well, does tthat mean that they don't see any acquisitive behavior in their future? Why aren't they buying companies? Where is the innovation? \nApple, Amazon, Google are not growing in a \"growth\" trend right now, so, as they make up the bulk of the NASDAQ, people wonder where the real growth is going to come from. \nBoil this down to uncertainty, missing on forward guidance, fear about the future, and you get really laggard pops and big declines. \nI'm out of this market. All of the increases in profit for trading were the weeks before ER, not after the earnings report. ", "score": 6, "replies": [{"body": "Election Day is November 8th.", "score": 4, "replies": [{"body": "We're really good at remembering this date", "score": 4, "replies": []}, {"body": "I wish you well.", "score": 1, "replies": []}]}, {"body": "What do you mean surprise hike - wirp has been above 70% for a while based on fed fund futures market ", "score": 2, "replies": [{"body": "I mean the frequency and level at which said hike, or hikes may proceed. ", "score": 1, "replies": []}]}]}]}, {"body": "Huge revenue growth in the recent quarter, but the spent a ton of that money reinvesting into the company. I lost a bit on this, but I'm definitely buying more shares tomorrow when it's down. It's a bargain especially considering the next holiday sales quarter. ", "score": 4, "replies": [{"body": "Yeah, I'm not a \"it's dropping! Buy!\" type of person.  But I'm buying tomorrow if it stays low.", "score": 3, "replies": [{"body": "I don't understand. That makes you that person, doesn't it?", "score": 3, "replies": [{"body": "The exception proves the rule!", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 2, "replies": [{"body": "So it's like I'm time traveling to June?  Sweet!", "score": 0, "replies": []}]}]}, {"body": "[deleted]", "score": 0, "replies": [{"body": "You understand that Black Friday and cyber Monday sales are priced into the current value of the stock for the next 20 years right?? ", "score": 4, "replies": []}]}]}, {"body": "maybe because its earnings?... cmon dude", "score": 5, "replies": []}, {"body": "[deleted]", "score": 7, "replies": [{"body": "OP forgot today was AMZN earnings lol", "score": 6, "replies": []}]}, {"body": "Hopefully the stock will go up because I'm 100 shares long. Lol looking forward to Christmas ", "score": 1, "replies": []}, {"body": "[deleted]", "score": -3, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "[deleted]", "score": -1, "replies": []}]}]}]}, {"body": "are you aware of google and twitter? good way to look up info", "score": -5, "replies": [{"body": "not sure why i got down voted. just trying to help people become self sufficient ", "score": -5, "replies": [{"body": "Username checks out. ", "score": 0, "replies": []}]}]}, {"body": "straddle that bitch ", "score": 0, "replies": []}, {"body": "You can see my comment here in this thread if you want to know the reasons why you are not going to see much good growth activity in the market in the next few weeks https://www.reddit.com/r/stocks/comments/59q6po/what_the_heck_is_going_on_with_amazon_after_hours/d9ajv6g/", "score": 0, "replies": []}, {"body": "[deleted]", "score": -3, "replies": []}]}
{"title": "Anyone playing $AMZN and/or $GOOG earnings?", "selftext": "[deleted]", "id": "59obi8", "created_utc": 1477579244.0, "score": 10, "upvote_ratio": 1.0, "num_comments": 21, "comments": [{"body": "[deleted]", "score": 4, "replies": [{"body": "u da man!!", "score": 1, "replies": []}, {"body": "Nice. Strike?", "score": 1, "replies": []}, {"body": "[deleted]", "score": 1, "replies": []}]}, {"body": "Calls on both. With far otm spy puts as hedge. If both of them blow earnings spy will get shredded.", "score": 4, "replies": []}, {"body": "2 contracts - Jan  17 900", "score": 2, "replies": []}, {"body": "Im in with 24/17 shares so lets fucking hope they beat", "score": 1, "replies": []}, {"body": "[deleted]", "score": -4, "replies": [{"body": "duh, it's called options", "score": 9, "replies": [{"body": "The options are even more expensive, like 2k a contract", "score": -1, "replies": [{"body": "You fucktards ever heard about options spread strategy?", "score": 7, "replies": []}, {"body": "Do you people not know how to play option strategies? Verticals? Spreads? ", "score": 7, "replies": [{"body": "I just read through the Investopedia page on Vertical Spreads but it's still a bit confusing to me tbh. \n\nI guess my biggest concern is what if company just hits it out of the park, and the dude you wrote the contract to decides to exercise it and you sold it uncovered? Then what?\n\nI understand that the best profit would be if your underlying stock traded between your strike price and the one you sold? And if the stock goes down its okay because the one you wrote covered that loss. \n\nBut again, what if it goes up far enough that both options (The short and the long) are in the money and the other guy exercises it?", "score": 4, "replies": [{"body": "People don't just exercise options. Go to Dough.com and do some educating ", "score": 1, "replies": [{"body": "Actually they do sometimes, without rhyme or reason. \n\nRare, but it happens. ", "score": 2, "replies": []}]}, {"body": "Well if they exercise it when you're in the money, then you still profit, pending commission fees.  If it blows past your long option in the vertical, you lose the difference in strikes between the long and short contracts.  \n\nDon't sell uncovered options if you don't understand them.", "score": 1, "replies": [{"body": "Thanks, i haven't done anything uncovered yet, I'm relatively new to this so.", "score": 1, "replies": []}]}]}]}]}]}, {"body": "[deleted]", "score": 1, "replies": [{"body": "Lol to 56 shares. My point exactly.", "score": -10, "replies": [{"body": "[deleted]", "score": 12, "replies": [{"body": "So they pop $20 and you make $1k. Woopdeefuckindoo. You'd be better off in higher volumes of a cheaper stock.", "score": -9, "replies": [{"body": "That's a stupid statement.", "score": 16, "replies": []}, {"body": "You're fucking retarded, stocks move in percentages and not flat values. The stock price is literally irrelevant.", "score": 8, "replies": [{"body": "Not irrelevant for options- more expensive underlying means fewer contracts= fewer commissions, and the strikes may be closer together as a percentage.", "score": 1, "replies": []}]}, {"body": "math is hard for some", "score": 3, "replies": []}]}]}, {"body": "I have 60, str8 to the bank faggot", "score": 1, "replies": []}]}]}]}]}
{"title": "AMZN, GOOGL, BIDU, LNKD, AMGN, EXPE just to name a few reporting ER after the close today!", "selftext": "", "id": "59piz0", "created_utc": 1477591949.0, "score": 20, "upvote_ratio": 0.85, "num_comments": 19, "comments": [{"body": "Lots of heavy hitters coming to bat after market close today! Are any of you playing earnings? AMZN has had a helluva run this year! Can it keep going from here? What are your thoughts on the other big tech earnings coming out? Should be an interesting afternoon here!\n\nAnd here are tomorrow's notable ER before the market open:\n> **[CLICK HERE!](http://i.imgur.com/vsE5m72.jpg)**", "score": 4, "replies": [{"body": "[deleted]", "score": 7, "replies": [{"body": "Go all in on AMZN options", "score": 3, "replies": [{"body": "if everyone is expecting amazon to crush earnings, what if they crush but not as hard as everyone thinks they should?", "score": 1, "replies": [{"body": "Then its going to drop by 2% and AH and then regain that in the next 3 days.", "score": 2, "replies": [{"body": "I'm balls deep in like 200 shares. Purchased yesterday. ", "score": 0, "replies": [{"body": "you should have bough calls with the 160k, you are not YOLOing had enough.", "score": 3, "replies": [{"body": "Shares are less risky... don't want to lose my life savings man. Plus premium's expensive as fuck.", "score": 1, "replies": [{"body": "Come here my friend, let me guide you to this magical place where you will fit right in https://www.reddit.com/r/investing/\n\n\nJust kidding, but one strategy you can use is the poor man's covered calls. Where you buy a call 100+ days out DeepITM, and sell one =< 30days OTM. Just make sure the one you sell extrinsic value is greater than the one you bought. \n\nmore details: https://www.dough.com/blog/poor-mans-covered-call", "score": 3, "replies": []}]}]}, {"body": "Rip you", "score": 2, "replies": []}, {"body": "If this is true then good for you my man! Lets hope they beat", "score": 1, "replies": []}]}]}]}]}, {"body": "AMZN baby. This thing is easily going 1000 by years end!", "score": 1, "replies": [{"body": "Nah", "score": 1, "replies": [{"body": "Ok im selling", "score": 7, "replies": []}]}, {"body": "22% in 2 months? I think that's a stretch but I do hope you're right!", "score": 1, "replies": [{"body": "Maybe by the end of 2017 if the entire market doesn't crash by then.", "score": 2, "replies": []}]}]}]}]}, {"body": "If only I can afford AMZN calls. ", "score": 2, "replies": [{"body": "Sell puts then", "score": 1, "replies": []}]}, {"body": "I'm so bullish on Amazon's earnings. ", "score": 1, "replies": []}]}
