{"title": "This week's plays", "selftext": "Bought some JAN30 AAPL 110 Call on Monday, trying to resist ringing the register.\n\nJust now I bought the FEB20 F 15 Puts expecting earnings to disappoint as Aluminum body trucks aren't in demand due to drop in gas pricing.  I think compared to GM they will disappoint.  The Mustang could be the one that bites me.  \n\nSold MCD stock today and I may even short it if it gets back to 91.\n\nEDIT:  Sold IBM Short at 154.88.  ", "id": "2tbdvj", "created_utc": 1421953287.0, "score": 5, "upvote_ratio": 1.0, "num_comments": 10, "comments": [{"body": "NFLX was the play of the week. Too bad I missed that one, I did play LUV today and got a great return on some 41 calls. Actually all airlines did well this week. ", "score": 2, "replies": [{"body": "Yeah. NFLX was definitely the explosive event.  I'm hoping AAPL will get similar bump, but because everyone in the world thinks so too, well...I doubt it.  ", "score": 1, "replies": [{"body": "Well maybe that will work in your favor. High volume and AAPL going bonkers after what seems like a great holiday earnings report might be the big play for next week. You see anything else interesting in this list for next week? http://www.nasdaq.com/earnings/earnings-calendar.aspx?date=2015-Jan-27", "score": 1, "replies": [{"body": "Looking at that list, and I had none of these names except AAPL on my list....\n\nI would think AAL is the play because they don't hedge against oil.  So they took the greatest benefit from low oil and the lower it stays the better.\n\nI don't trade AAL though so I don't know it well enough to give you anything concrete.  (I do know I should have pulled the trigger on that 1000 order I almost placed in October at $27 per share!).  Its just my gut feeling as the possible surprise.  The Street is expecting the same EPS as last year, but oil fucking killed it for them the last two month.  So...I dunno, maybe we see a giant move.  \n\nI'm gonna look into the AAL options tomorrow.  \n\n\nAlso, YHOO may be a candidate for a serious move.  I don't know how much of the BABA money they are party to, so they could either kill it or tank on earnings.  I would think a big move either way so that's a possible straddle play.\n\nI'll update if I make any plays.  ", "score": 1, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "See, the fuel thing is what I think.  The other airlines are already hedged with higher costs.  If oil stays low AAL will blow them out on profit margins. \n\nSo the guidance for them should have a stronger effect than it did on the other airlines who don't benefit like AAL from oil costs.  \n\nThat's how I am looking at this, anyway.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "anyone else making gold plays?", "score": 1, "replies": [{"body": "SLV", "score": 1, "replies": []}]}, {"body": "-10 FEB15 HLSS 10 PUT\n\nHLSS has so many bull signs but the last two weeks has caused its iv to shoot through the roof.", "score": 1, "replies": [{"body": "You sold 10 puts on it, no spread?  BaF?  ", "score": 1, "replies": [{"body": "ROC is roughly the same between the two (maybe a few % difference in favor of the spread), but the P/L is always better when naked.", "score": 1, "replies": []}]}]}]}
{"title": "What are some stocks to consider long term?", "selftext": "I love this subreddit. Long time lurker, first time poster here. I'm just an amateur investor trying to make some money on the side and at the same time learn more about the market,so I figured I'd ask for some advice/opinions. I do long trades (6-12 months) for right now. I have $10,000 to invest and will likely add another $5000 by July. Right now, I'm considering allocating 35% to $BRK.B and 25% to $ALL.\n\nI'm also considering $MSFT. It seems they're finally catching up to the rest of the competition with Windows 10 coming out. With the recent announcement about HoloLens set to come out this year alongside Windows 10, I think they're going to make a big splash in the virtual reality market. What are some of your thoughts about $MSFT?\n\nWhat other stock in the Biomedical/Healthcare/Tech sector should I be looking at? I did really good with $ILMN this past year. I'm always looking for good ETFs and mutual funds as well. No stock options though (I don't know enough to feel comfortable with them yet).", "id": "2t9pom", "created_utc": 1421913118.0, "score": 2, "upvote_ratio": 0.67, "num_comments": 12, "comments": [{"body": "AMZN, LUV, MNST, YUM are some of my personal favorites", "score": 2, "replies": []}, {"body": "GOOG/GOOGL is number 1 bet long term, IMO.\n\nMSFT is a tough one.   I am not convinced they are going to be able to come back.   I just can't see where they are going to grow the business.  They are giving Windows 10 away for free.   They are getting pressure with their Office franchise.   Does not seem to be growing things that have margins to replace.   Cloud is going to take huge investment and is extremely price competitive.   MS built the business on large margin, proprietary solutions.   That is not the world today and I don't see it coming back.\n\nThe interface to customers today is not limited to desktop.   Today it happens on Phones, Tablets, TVs, Wearables, and Cars.   Today, MS does not have traction in any of these areas.   They are all dominated by Apple and Google.   Every day that goes by it will be more difficult to edge one of the two out.   ", "score": 2, "replies": [{"body": "check out the smart band by MSFT tho, looks solid. ", "score": 1, "replies": []}, {"body": "MSFT has their strategy down. They know what they're doing. Apple is the one who will eventually fail. Their tech has lagged behind for years now. It's only a matter of Time before their brand becomes 'uncool' and the lose their edge. MSFT band Will be available on Android and WPhone. Enterprisewise they are still No. 1 and Office 365 is simply great. Deloitte itself was considering WPhone for a while because of this, but AAPL has more money for now. .NET is going all-platform which means developers will be Using that more and more (It's simply great to work with). Don't compare AAPL To MSFT. Apple relies on silly people caring about silly stuff. Designwise I must say that MSFT is doing much much better Than before. The trend that we are seeing pop up everywhere around the world is: free, open source, shared platform, usability and versatility. AAPL is nothing of those things and if they keep their market closed they will fail eventually.\r\rtl;dr: Within Ten years Apple Falls, Microsoft and Google do Battle (if Google cares enough)\r\rSent from WPhone", "score": 0, "replies": [{"body": "Thanks for the prospective.   It looks to me that there is MSFT and AAPL on ends and Goog/Googl in the middle.   So MSFT competing with AAPL is really through GOOGL.   \n\nBasically, I really don't see AAPL as the primary competitor of MSFT.   Also, I don't see AAPL going anywhere.   They have a crazy strong brand.   \n\n", "score": 1, "replies": [{"body": "Agree with this, Apple is a strong brand, but is ultimately the same products being recycled over and over again with slightly newer technology.\n\nNewest product is going to be the watch, which is arriving relatively late to the smartwatch arena. \n\nAlthough, Apple fans will likely go crazy for them... for a while. Personally, I don't see what the hype is. I've owned several iOS devices, now I own a Nexus 6 and I am NEVER going back. \n\nGoogle is continually coming out with new products/services, as does Microsoft. The Windows Phone was kind of a flop, just like Windows 8 was... Windows 10 better be huge for MSFT.", "score": 1, "replies": []}]}]}]}, {"body": "Perhaps Disney? ", "score": 1, "replies": [{"body": "When I was a kid, my Grandma bought me stocks instead of giving me birthday/Christmas money. As an 8 year old kid, I picked the only company I knew anything about, Disney. I held on to Disney for probably 10 years, and it just sat between $25-$30/share. Cashed out completely in 2009 to put cash toward college, and probably broke even or made a really marginal profit. Since 2009 it's gone up to $95/share. It still hurts. ", "score": 3, "replies": [{"body": "Same story for me except my dad cashed it out, I still haven't fully forgiven him. ", "score": 2, "replies": [{"body": "You should forgive him, the recession was soul crushing for the average family. My families construction company made it out operational at the expense of my dad's retirement account, and my college fund. Sometimes if you don't make it through the short term there will be no long term. \n\nEdit: I managed to make enough money coming out the back side of the recession to go to college, and my dads retirement kind of got rebuilt. ", "score": 2, "replies": []}]}, {"body": "That sucks! Just sold my 5 Disney shares a week ago along with 10 shares of Starbucks from 2005.  *Thank you* grandma and grandpa.", "score": 1, "replies": []}]}]}, {"body": "HoloLens does seem to better explain why MS purchased Minecraft, IMO.", "score": 1, "replies": []}]}
{"title": "You are given 100k today and are told to make the most you can by the end of March. What do you invest in?", "selftext": "Originally asked this due to a group school project although now I am doing it for myself. No day trading, sadly. All stocks have to be over $2. Curious to know what you guys think. Maybe my thought process is wrong? Never played with stocks before.\n\nOpinions on the following:\n\n* In Microsoft. Windows 10 has potential and is a free release for the first year! Plus Holographic technology.\n\n* GOOG and/or GOOGL. Partnership with Sprint and T-Mobile for telecom service is inbound! Also, SpaceX was given $1 billion for internet-giving satellites.\n\nOther thoughts:\n\n* VISA teamed up with Samsung for Samsung Pay. Probably Going to be a flop though.\n\n* BRK.L? Seen it mentioned here.\n\n* Lots of HTC M9 (Flagship phone) leaks! Could a new killer phone be released within 2 months? Would I profit by investing? New smartwatch in March! Unless its a flop it seems like it would climb.\n\n* Apple?\n\n* FXCM explosion still good investment for a few days or is it temporary?\n\nI see it as my golden opportunity to get into stocks. Always been into investing. Thanks all!", "id": "2t9u42", "created_utc": 1421917186.0, "score": 5, "upvote_ratio": 0.78, "num_comments": 18, "comments": [{"body": "FXCM would be your best bet--if youre looking to win the contest.  Given that you don't have to worry about losing real money, and youre going up against a number of opponents in hopes of winning the game (second place/preservation of capital doesn't really matter), you always choose the most concentrated and potentially volatile strategy available.  Almost the antithesis of real investing--you shoot for the moon when no one else does and your chances of winning from a strategic prospective are much higher.  Also, your chances to end in last are greater, but who cares.  I always play the strategy element in short-term games like these.  Real investing never works.", "score": 4, "replies": [{"body": "Should I use this strategy if ranking (we are playing against other groups) matter for a grade? \n\nHow long would you recommend playing with FXCM? Any other stock you would recommend? \n\nThanks!", "score": 3, "replies": [{"body": "To answer a few of the questions below, FXCM is actually the perfect example of a high beta stock.  In fact, given that you have to work with stocks that are above $2, its probably one of the best that you will find.  Beta is essentially just a measure of volatility. No point in buying multiple stocks--just buy one.  Just hold it for the entire time.  If you have to supply reasoning, just read up about how their idiot CEO let the company take gap risk on leveraged currency trades then got rocked by the unpegging of the Swiss franc and had to receive an overly onerous capital injection from Leucadia.  Take the position that you thought the stock was oversold and was much more valuable than the $100 million market cap suggested. ", "score": 1, "replies": []}]}]}, {"body": "If I had to make as much as I could by March I sure as hell wouldn't be buying blue chips - I'd be looking for volatile stocks with a lot of growth potential.", "score": 3, "replies": [{"body": "Ooh, how would I find volatile stocks? ", "score": 1, "replies": [{"body": "Use a stock screener and search using volatility indicators like beta, ATR, etc.  Make sure you read up on the indicators first so you understand what you're looking for.", "score": 3, "replies": []}]}]}, {"body": "[deleted]", "score": 3, "replies": [{"body": "Any examples or recommendations? \n\nI don't know all this terminology. Any books to start me off?", "score": 1, "replies": []}]}, {"body": "If buy RUSS\n\nYOLO", "score": 2, "replies": [{"body": "How much a share for YOLO?", "score": 2, "replies": []}, {"body": "I profited heavily off RUSS during the initial Ukraine debacle when it was confirmed Russian troops were there. I wouldn't recommend it as I was sweating and pulling my hair out the whole time. ", "score": 1, "replies": [{"body": "Russ buy now today\nYESSSSS\njust need a half a boost to oil tomorrow baby \nIn at 18.60", "score": 1, "replies": []}]}]}, {"body": "Microsoft - no. Holograms aren't out and a free release is bad to investors hence why the stock didn't go up today. \n\nI would play with XENE or be super risky and just put it all in FXCM. ", "score": 2, "replies": []}, {"body": "AYA.", "score": 1, "replies": []}, {"body": "Depends on risk apetite.. if loosing it all is of no care because of potential upside i would go buy as many of these as i could get..\nBABA150320C00135000 ", "score": 1, "replies": [{"body": "What are all those numbers after BABA?", "score": 1, "replies": [{"body": "option chains", "score": 1, "replies": []}]}]}, {"body": "FANG", "score": 1, "replies": []}, {"body": "NLST", "score": 1, "replies": []}]}
{"title": "Is there a particular reason why AMZN would be up 7-8% in the last 2 days?", "selftext": "I don't see anything that jumps out, but my knowledge and experience are pretty limited.\n\nThanks.", "id": "2tbamj", "created_utc": 1421951821.0, "score": 13, "upvote_ratio": 0.9, "num_comments": 13, "comments": [{"body": "They're about to post quarterly's and are expected to do well after the amount of holiday sales volume they had. In addition their direct competitor, Ebay, didn't perform high on their earnings report today", "score": 14, "replies": [{"body": "second this one, Im waiting for the last day to get some calls", "score": 2, "replies": []}, {"body": "oil is also re-rising so most investors are no longer trying to resell to compensate for their losses. ", "score": 1, "replies": []}]}, {"body": "to screw with me personally. I sold my shares last Friday. F*k", "score": 6, "replies": [{"body": "Thanks!", "score": 1, "replies": []}]}, {"body": "It might be trading on technicals.  It looks like its in a descending triangle pattern with a bounce off the bottom of the triangle. ", "score": 5, "replies": [{"body": "AMZN has found support around 285, not surprised to see a bounce. ", "score": 3, "replies": []}]}, {"body": "They released a free authoring app for creating textbooks.", "score": 1, "replies": []}, {"body": "+ possible new acquisition in Israel", "score": 1, "replies": []}, {"body": "Because it was oversold in the first few days of the new year.  See also, GOOG.", "score": 1, "replies": []}, {"body": "\"Amazon, though, was celebrated this week in Hollywood. When “Transparent,” a streaming television series Amazon created to knee-cap Netflix, won a Golden Globe, its creator thanked Jeff Bezos by name.\"", "score": 1, "replies": []}, {"body": "Nflx  earnings ", "score": 1, "replies": []}, {"body": "Quantitative easing in Europe. It gives the blue bloods new opportunity to pump it up.", "score": 0, "replies": []}]}
{"title": "Short IBM", "selftext": "[removed]", "id": "2tb8dk", "created_utc": 1421950815.0, "score": 2, "upvote_ratio": 0.67, "num_comments": 12, "comments": [{"body": "I have yet to short a company but Ive been wanting to do it to IBM for a while. I guess its that fear that since Ive never done it before I will mess it up :S", "score": 1, "replies": [{"body": "You sell the shares as if you own them, the money goes into a fenced area in your account, and you buy them back to cover at a price.  You expect to pocket the difference.  If you lose money you pay it when you buy back.\n\nRarely will you get called away and be forced to cover all of a sudden, I mean, shit happens, but it's usually moving against you anyway if that happens.  So whatever. ", "score": 1, "replies": [{"body": "So you can, in theory, stay short the stock forever? If for some reason it stays in a channel from $159-$161 for ten years, I could just hold my short the entire time? ", "score": 2, "replies": [{"body": "Bill Ackman even made a career out of that.", "score": 2, "replies": []}]}, {"body": "Ya I know how it works in theory, its the practicality im not ready for.", "score": 1, "replies": [{"body": "When IBM rips to 170 because they fire Ginny?  That kinda thing?\n\n", "score": 1, "replies": []}]}]}]}, {"body": "Fuck it, let's kick ass.  Sold it.\n\nNot quite the same size though, wow.", "score": 1, "replies": [{"body": "[removed]", "score": 1, "replies": [{"body": "Unless they fire the CEO they are going down under 150.  Had I waited until this closing rally I'd be up a bit more.  \n\nTomorrow I think we see some disappointing earnings hurt the open on the whole market.  Take some faith out of IBM sails!  :)", "score": 1, "replies": []}]}]}, {"body": "Came back in a bit today, seeing it at 157 I almost sold it again.  haha\n\n", "score": 1, "replies": []}, {"body": "From the perspective of fundamentals, you are 1000% correct to short them...but they are particularly adept at bullshit financial engineering. I feel like buying a boatload of puts would be the safer trade to make (with comparable returns). ", "score": 1, "replies": []}]}
