{"title": "30% growth for both BRK.A and BRK.B in 2014? Why am I even trying to pick stocks...", "selftext": "I had a pretty good 2014 and probably netted about 20% increase in my portfolio in my first year of investing in the market. Some of my key winners were Under Armour, Carmax, and Facebook. But digging through some new potential investments I noticed that Berkshire's stocks increased 30% over the past year. Both BRK.A and BRK.B.\n\nIs that info correct or am I missing something? Part of me thinks I should just pour most of my money into BRK and call it a day... I mean WTH... 30% is darn hard to beat... especially compared to the market: DOW +10%, NASDAQ +15%, S&P 14%", "id": "2u4d0o", "created_utc": 1422564441.0, "score": 8, "upvote_ratio": 0.73, "num_comments": 14, "comments": [{"body": "BRK has been an amazing performer for sure, but these have been some extremely generous market conditions for the past few years.\n\nThe investors who went long at the 2007 peak had to  wait until 2013 to break even on BRK, so its not always that easy in the short term.\n\n\n\n\n", "score": 10, "replies": []}, {"body": "\"Past performance is not indicative of future returns.\"\n\nThere is a reason this disclaimer is mandatory on performance reports.", "score": 5, "replies": []}, {"body": "Remember that 99% of the company decisions are made by WB alone. The rest of the decisions made there are either for the sub companies or are to assist WB get information. \n\nYou're basically investing in one man, and yeah; he's brilliant. ", "score": 1, "replies": []}, {"body": "I actually see 26.64% BRK.B for 2014 under \"Performance\" in morningstar.  BRK.A was 27.0%.  \n\nBRK.A 2009 performance was far below SP500 with 2.69% vs. 26.46% for SP500.\n\nIt has beaten SP500 for YTD, 1-Year, 10-Year, and 15-Year.  It trails in the 5-Year measure.\n\nAnnual declines for BRK.A in 2001 and 2008 are the only ones in its long term record.\n\nReasons why to consider diversifying beyond just this one investment is that its insurance operations face highly cyclical markets, longevity of WB who may be key.  \n\nJeremy Siegel advocated allocating part of portfolio to BRK.A/B in his writings, as well as sector strategy allocations to Cons Staples, Energy, and Branded Pharma.  This along with a diversified World Stock fund.\n\nTL;DR, long track record, but why not diversify?\n\n", "score": 1, "replies": [{"body": "I've found that I personally have tended to sell investments if my blended portfolio significantly trails the SP500 over 1 Calendar Year.  As a result, holding 100% of my portfolio in something would put me at risk of deteriorating returns from selling it.\n\nExample: I would have sold BRK.A in 2009 then trailed SP500 returns for 10-Year measure.\n\nYou really have to believe in this long term and be willing to hold through underperformance to make a 100% allocation work.", "score": 1, "replies": []}]}, {"body": "A is convertible into B which is why their performance is the same.\n\nNot sure how you have been investing for a year and not heard of Berkshire hathaway though.", "score": -13, "replies": [{"body": "Not sure when you learned to read English, but your comment makes no sense and has nothing to do with my original post.", "score": 12, "replies": [{"body": "It makes a hell a lot more sense than your post. If you knew the difference between class A and B shares, you wouldn't have mentioned them both.\n\nAlso, shame on this sub for trying to censor /u/lawack.", "score": 0, "replies": [{"body": "In most cases, class A and B shares are nearly identical. However, BRK.B is only about $150 and BRK.A is $200,000+ ... the people who own them are very different and trade based on different principles, strategies, scenarios, and market conditions. \n\nBRK.A grew 27.35% in the past year. \nBRK.B grew 28.95% in the past year.\n\nThat's a 1.6% difference - larger delta than most stocks with different class shares. For example: GOOG down 9.39% and GOOGL down 9.06%\n\nI mentioned both because I was looking at both charts and considering each.", "score": 1, "replies": [{"body": "That difference is noise because BRK.A trades so thinly. Any class A share can split into class B's, so BRK.B will never trade at a premium to BRK.A.", "score": 1, "replies": []}]}]}, {"body": "Rekt", "score": 0, "replies": [{"body": "rektum?? damn near killedem", "score": -2, "replies": []}]}, {"body": "You need some time to cool down there?", "score": -2, "replies": []}]}]}, {"body": "My biggest problem with BRK is the lack of both dividends and share buybacks. This company **NEVER** has returned capital to shareholders and probably never will as long Warren Buffet's alive.\n\nP/E is cheap, but I honestly think WB is getting too old to be effective. If you want financial and transport exposure, it could work, but I think there's too many \"bad\" plays. I would buy DPS before KO and AAPL, MSFT, ORCL, anything really, before IBM. I think Buffet's beginning to lose touch with the 21st century.", "score": -2, "replies": []}]}
{"title": "Took a risk with American Airlines AAL", "selftext": "Ouch. Bought in on Monday and am hurting. Down more than 7 percent that's like a whole year of gains. What does one do in this situation? I'm still pro AAL but I guess no one else is", "id": "2u1vfk", "created_utc": 1422508657.0, "score": 3, "upvote_ratio": 0.8, "num_comments": 11, "comments": [{"body": "Below 48.10 I'd be very worried. Until that point, it's still making higher highs and higher lows. Breaks the low on the 14th(48.10) and that won't be true anymore.\n\nAnyways, if you don't have a stop at this point you should really be re-evaluating your strategy. You should never get to the point where you don't know what to do. Stocks do two things, they rise and they fall. Pretty simple. You need to have a PLAN for both of those scenarios. \"If stock XWY falls below X, I sell\" Likewise, \"If stock XWY increases to X, I'll increase my stop to X\". \n\nAnyways, be weary of advice you get off reddit, because as always, you get what you pay for. Good luck buddy.", "score": 2, "replies": []}, {"body": "you're fine.  it will probably go down to $50 and bounce back.  Although if it ends up getting to the point where it closes too far below $50 then you're probably in trouble . ", "score": 1, "replies": [{"body": "You called it perfectly", "score": 1, "replies": [{"body": "so far yes, but it hasn't closed yet", "score": 1, "replies": []}]}]}, {"body": "Buy a put option?", "score": 1, "replies": []}, {"body": "Chart looks fine.  It should find some support at the 50 day moving average range ($50).  If it drops below $43 I'd sell, that's a pretty crucial level.", "score": 1, "replies": []}, {"body": "American Airlines is on track to save $5 Billion fuel costs in 2015, and shareholders are expected to get cash back as the company spent $1 billion buying back shares in the second half of 2014, which makes remaining shares more valuable   \n\nhttp://www.smarteranalyst.com/2015/01/29/american-airlines-track-save-5-billion-fuel-costs-2015/", "score": 1, "replies": []}, {"body": "I'm calling them bankrupt by year's end. ", "score": 1, "replies": [{"body": "Really? They are trading at 9 or 10x eps this year", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "No no look at 2015 estimates. ", "score": 1, "replies": []}]}]}]}, {"body": "Buy higher and sell lower?  Smart thinking!", "score": -1, "replies": []}]}
{"title": "Buying GOOG before earnings release... Opinions?", "selftext": "[deleted]", "id": "2u3i34", "created_utc": 1422550925.0, "score": 7, "upvote_ratio": 0.82, "num_comments": 17, "comments": [{"body": "I bought Microsoft right before the last earnings. Worked out great. Go for it. ", "score": 17, "replies": [{"body": "But seriously, don't.", "score": 12, "replies": [{"body": "I'm going to watch it until close but my current standpoint is that it doesn't meet my trade criteria.  Your comment made me LOL by the way.", "score": 3, "replies": [{"body": "Wish I was joking. ", "score": 3, "replies": [{"body": "I feel you brother..", "score": 2, "replies": [{"body": "I feel like a complete dick laughing at these comments, but damn that was funny ", "score": 2, "replies": []}]}]}]}]}]}, {"body": "In **my personal opinion** playing earnings on blue-chip stocks is pretty much a gamble.  And as far as GOOG is concerned, I don't try to catch falling knives.", "score": 9, "replies": [{"body": "You're right, also in my experience consistent positive earnings are key and last Q goog missed expectations.  I don't know what it is about google that attracts me but I guess it doesn't meet my conditions.  ", "score": 2, "replies": [{"body": "I can tell you what attracts you to Google: popularity and a product you use on a regular basis.  Just remember everyone else has the exact same sentiment.", "score": 4, "replies": [{"body": "exactly, I'm a big Google fan and it always brings me looking into the company.  There are always bulls in the group but the consensus seems to be that the company is showing bearish trends all around.", "score": 1, "replies": []}]}]}]}, {"body": "Hey! I did too! Bought PUTS.", "score": 1, "replies": [{"body": "You're saying you shorted apple? or goog? lol", "score": 1, "replies": [{"body": "sorry, I have GOOGL PUT position for Feb 6 10 dollar strike.\n\nEdit: http://imgur.com/bJQvV9F\n\nUp 80% on her. Small position since it is earnings after all. But I sold one earlier to take a little profit and letting this guy ride.", "score": 3, "replies": [{"body": "What do you mean by 10 dollar strike? You bought a put with a $10 strike price? Clearly not, cuz google is at like 5hundred something right now. What am I missing here? Please explain", "score": 2, "replies": [{"body": "SORRY. 510$. And lets this be a lesson to all about earnings. You can call it right and still lose!", "score": 2, "replies": [{"body": "How did you make money on the put if the strike price is 510 and google closed at 513 and shot up afterhours ", "score": 2, "replies": [{"body": "I purchased the puts when it was in the upper $520s.. They don't expire until FEB 6th. I sold one of them today when the stock was trading around $507. The strike price only matters if you are holding the options until expiry and exercising them.. I simply sold to a different investor who wanted to buy a GOOGL put earlier today.  \n\nEdit: The afterhours is odd. If GOOGL continues upwards tomorrow, then, my remaing PUT will lose value in relation to how much the stock goes up. I can then sell it at a loss or hold into next week it hope it comes back down. ", "score": 2, "replies": []}]}]}]}]}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "2u13j4", "created_utc": 1422494059.0, "score": 3, "upvote_ratio": 0.72, "num_comments": 14, "comments": [{"body": "I like the thesis, I think it's a no brainer.\nThe only downside to the trade I see is the timeline - no telling how long this takes to play out - which could get expensive in premiums.\nAlso, small chance the Fed doesn't raise interest rates to combat the surging dollar..\nJust my 2 cents.", "score": 7, "replies": []}, {"body": "Alright OP, opening up a 0.1 lot at 1000:1 leverage just for you.\n\nhttp://i.imgur.com/GjlsvNQ.jpg", "score": 3, "replies": [{"body": "Questrade? you trade CFDs?\n", "score": 2, "replies": [{"body": "*shudder* At least when CHF blew up, only FXCM, not their traders, got hurt. If you \"won\" on that move, you could cash out. If you had a CFD, good luck. Now you're hoping the guy on the other side of your trade can cover it.", "score": 1, "replies": []}]}, {"body": "https://www.youtube.com/watch?v=-DT7bX-B1Mg&t=27", "score": 1, "replies": [{"body": "I closed both those trades out for profit earlier yesterday.", "score": 3, "replies": [{"body": "Congrats", "score": 2, "replies": []}]}]}]}, {"body": "I got in on the bounce as well, there is the risk the fed may not raise rates as soon as expected though. But the Eu is in such shit I don't think it'll make the euro bounce much more at all. \n\nEdit: Short at 1.13671 from yesterday (see my divvie momentum page) and now at 1.2899.\n\nThis is now kinda hedged with a long DAX @ 10600, A$1 mini contract, which I'll try to hold long term, as I think the German economy is going to the moon soon. But I'm not YOLO enough bet big. I might buy more down on the gap close @10450", "score": 3, "replies": [{"body": "I bought another DAX mini at 10588 and fuck is it now so tempting to close it out. \n\nAlso shorted another eur/usd mini lot at 1.13100, euro shorts are now slightly under. \n\nHedge is working as planned, dunno how disciplined I'll be to keep this open especially if say Greece fucks it and defaults. ", "score": 2, "replies": []}]}, {"body": "I think you might be a few months late.", "score": 1, "replies": [{"body": "The trend is not my friend?", "score": 1, "replies": [{"body": "It's basically been in a downtrend for over 9 months; realistically what are your expectations in terms of % change?\n\nThey say buy low sell high right? You're selling pretty low...", "score": 1, "replies": [{"body": "I think it will be below parity by 2016. So about 20% change in EUO ending around 30. ", "score": 1, "replies": [{"body": "It could be, my point is that after being in decline for 3 years and fallen off a cliff in the last few months that it's not overdue for a dead cat bounce?\n\nI guess what I'm really getting at, is your timing sucks. You're planning on going short at the exact moment the ECB is finally talking stimulus. Who knows what the implications are for the currency, who knows how other countries will react? If it's anything like the dollar those same actions established a bottom.", "score": 1, "replies": []}]}]}]}]}]}
{"title": "[Question] So how much did /u/fscomeau made on his AAPL trade?", "selftext": "[removed]", "id": "2u2jk0", "created_utc": 1422529283.0, "score": 6, "upvote_ratio": 0.88, "num_comments": 13, "comments": [{"body": "He hasn't written anything about selling the options so he may still be holding them.  However, if you want to know what he's at currently\n\nJust take the current feb 20 110 call price(6.50) subtract his average cost 3.48 and multiply by 12,000. Which means he's up, roughly $36,240.\n\n", "score": 1, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Well that's his current profit(ignoring commision). His current position is valued at 6.50 * 12,000 = $78,000", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "Is it? He doubled his money, how much would he have to make for it to be a successful trade to you?", "score": 1, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "Dude give fscomeau a break he is just starting out and you want to compare him to people who work in Switzerland?  In 2 years he will be running circles around those guys.", "score": 2, "replies": [{"body": "[deleted]", "score": 1, "replies": [{"body": "No, not seriously.", "score": 2, "replies": []}]}]}]}]}]}]}]}]}, {"body": "*she", "score": 1, "replies": [{"body": "[deleted]", "score": 3, "replies": [{"body": "nah it was more in reply to all the comments in here but i didnt feel like commenting everywhere", "score": 1, "replies": []}]}, {"body": "Just because /u/fscomeau is a little bitch doesn't mean he's female.", "score": 3, "replies": [{"body": "I believe the theory is that FS was found by a female in the bathroom so it would make sense that FS is also female.\n\n", "score": 3, "replies": [{"body": "Oh right--that makes total sense. Still, his posts, the trade itself, and the silly libertarian bullshit on his blog make me think he's a neckbeard.", "score": 1, "replies": []}]}, {"body": "i didn't deduce it from that..", "score": 1, "replies": []}]}]}, {"body": "I don't know, but we did find out that he is rather emotionally vulnerable, which is VERY funny to me.", "score": 1, "replies": [{"body": "*He* won money, why would he so emotional about it?", "score": 1, "replies": []}]}]}
{"title": "AMZN beats EPS. Up after hours.", "selftext": "Bought this contact before market close today. Can't wait till morning! This should help some of the damage I took buying BABA calls like a dummy.     \n  \nhttp://imgur.com/47PKFnt\n\n\nEdit:    \nBought on 1/29 @ 13.34 for $1,322    \nSold on 1/30 @ 44.86 for $4,475    ", "id": "2u4tkd", "created_utc": 1422571962.0, "score": 3, "upvote_ratio": 0.72, "num_comments": 16, "comments": [{"body": "i was somewhat bearish with a position of 2 295/285/275 ($1.35) put flies and 1 325/335/345 call ($1).  right now it's sitting high at $353 - incredible. ", "score": 1, "replies": [{"body": "what do you mean when you say 295/285/275, sorry im new\n\ncan you explain what the strategy was (iron condor/straddle/etc.)", "score": 1, "replies": [{"body": "hey, no prob - i was using a butterfly spread.  the 295/285/275 combination was made of:\n\n+1 295 put\n\n-2 285 puts\n\n+1 275 put", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "huh? the butterfly call was the 5%/8%/11%", "score": 3, "replies": []}]}]}]}]}, {"body": "Well, judging by what its doing after market now, you won't be too upset about BABA.", "score": 1, "replies": []}, {"body": "SAME u/slightly_dehydrated I had BABA Jan 30 104 calls that are worth a penny right now, and bought AMZN calls right before closing. I went a bit conservative though because of the baba loss and bought Mar 20 370 calls", "score": 1, "replies": [{"body": "Wow 370! Way OTM. How cheap were those and how many contracts did you get? ", "score": 1, "replies": [{"body": "They were just above $2.20 and I only bought that 1 contract since I lost quite a bit on baba and wasn't feeling too confident, but I really wish I bought 10 contracts at least ... ahhhh hindsight", "score": 1, "replies": []}]}]}, {"body": "When are you guys planning to get out? Market open, sometime in the day or planning to hold it for a bit?", "score": 1, "replies": [{"body": "Sold. Edited to update title. ", "score": 1, "replies": []}]}, {"body": "Nice Johnny one-lot, fucking Cha-ching!", "score": 1, "replies": [{"body": "Hah. I was too scared to buy more after the sting from BABA. ", "score": 2, "replies": [{"body": "Soothes the burn a bit, yeah?", "score": 1, "replies": [{"body": "Only thing is that I doubt the peak AH's gains will hold going into tomorrow. It would be nice if I could ride it out through the potential gains next week but that gap jump to 350 has me a little skeptical of seeing additional gains (assuming 350 holds.)     \n\n    Hopefully I am wrong :D", "score": 1, "replies": [{"body": "Both NFLX and AAPL held and rode up, but I dont know what Im going to do yet", "score": 1, "replies": []}]}]}]}]}, {"body": "1 Million AWS customers was the most bullish information released, IMO", "score": 1, "replies": []}]}
