{"title": "TSLA valuation reality check - comparison to other car manufacturers - thinking out loud", "selftext": "[deleted]", "id": "2r8v5y", "created_utc": 1420326371.0, "score": 0, "upvote_ratio": 0.3, "num_comments": 12, "comments": [{"body": "Stock price != market cap", "score": 11, "replies": [{"body": "Scary he did all this research without knowing this...", "score": 9, "replies": []}, {"body": "[deleted]", "score": -1, "replies": [{"body": "Yes, but are you sure you understand what that means?\n\nGM is twice as valuable as Tesla with double the market cap at 52b.  Toyota is 8 times as valuable as Tesla with a market cap of ~200b.  Tesla stock price is higher just because there are less shares outstanding and each share of Tesla represents a higher percentage of the company than a share of Toyota does for Toyota.\n\nThe share price tells you almost nothing about the financial health of a company (Or even its size) so it's pointless to use for analysis.", "score": 8, "replies": [{"body": "Exactly! Was going to post exactly this.\n\nGM market cap 55b\nToyota market cap 216b\nTesla market cap 27b\n\nThat said though 2013 revenue for GM was 155b, Toyota was 249b while Tesla only had 615m, Hinting that Tesla might be overvalued... But then again current Tesla's valuation is more looking forward than anything,  so it'll be more prone to stock price volatility...", "score": 2, "replies": [{"body": "Yeah, agreed, but lots of commentators have been saying that it's would be unfair to compare Tesla with other car manufacturers since they're really in the tech business.  I tend to agree.  Their tech just happens to go into cars.", "score": 1, "replies": []}]}]}, {"body": "\"Based on share price alone, TSLA is being valued as if it were Volkswagen. I'm just pointing this out, not really making a judgment. TSLA is priced at 6x GM, and less than 2x Toyota. Pricewise, the list is TSLA, VW, TM, GM (in order, highest to lowest).\"\n\nShare price alone cannot determine value.  It's like say this slice of pie costs 5$ while this one costs 100$.  Well the 100$ just happens to be twice as big.  \n", "score": 2, "replies": [{"body": "[deleted]", "score": -2, "replies": [{"body": "ill let you keep trolling", "score": 1, "replies": []}]}]}]}]}, {"body": "Is this a joke that sailed right over my head or is this an early contender for the most retarded post of 2015?", "score": 3, "replies": []}, {"body": "Dude you have multiply shares outstanding by price, then go from there. ", "score": 2, "replies": []}, {"body": "Could someone redo this analysis with market cap in mind?", "score": 2, "replies": []}, {"body": "Lol. \n\nBut seriously, OP would probably appreciate understanding PEG ratio. ", "score": 1, "replies": []}, {"body": "Best analysis ever! ", "score": 0, "replies": []}]}
