{"title": "NFLX after hours!", "selftext": "[deleted]", "id": "12r8fr8", "created_utc": 1681860045.0, "score": 35, "upvote_ratio": 0.83, "num_comments": 23, "comments": [{"body": "Great move buying the shares. However exercising the puts was objectively a poor idea. You’re covered dollar for dollar to the downside thanks to those puts and now you actually get some upside thanks to the shares. \n\nBy exercising early you just forfeited a decent bit of extrinsic value on those options. In the future, just wait until the next day, sell the puts, and then sell the shares.", "score": 37, "replies": [{"body": ">Great move buying the shares. However exercising the puts was objectively a poor idea.\n\nAgreed.\n\nYou should have waited and sold both the shares and the put at market open and you would have profited quite more. Also you wouldn't had to bother your broker with a call.\n\nOn some professional brokers (IKBR) you can even sell the shares and the put in the same order so you don't take any risk related to stock moves between one operation and the other.", "score": 18, "replies": []}, {"body": "Absolutely correct.  Had he not exercised he would have been synthetically long the 335 call for free.", "score": 7, "replies": []}, {"body": "not true. the price has already recovered and had he waited, he would have lost all the value. exercising after hours was a really smart move.", "score": -6, "replies": [{"body": "No, that’s not correct. He lost all the value on the put when he exercised it. \n\nHigh level he purchased shares for $300 and sold them for $335 after exercising. That’s a $35 gain, but he paid $15 for the puts so it’s a $20 gain. \n\nIf you wait until tomorrow morning and assume NFLX is $330, you’ll bag a $30 gain on the shares and those 335p will be worth AT MINIMUM $5. Your gain on the trade would then be $20 + every dollar above $5 you dump the 335p for. You’re basically forfeiting every dollar of extrinsic value which would have been direct profit.\n\n$20 is the LEAST this person could have made after picking shares up at 300. Exercising just locked that in.", "score": 29, "replies": [{"body": "Complicated but correct", "score": 12, "replies": [{"body": "Simple and correctly complicated", "score": -6, "replies": []}]}, {"body": "[deleted]", "score": -3, "replies": [{"body": "Doesn’t matter if there is IV crush, because no matter how hard the crush is, there must be some extrinsic value to be had in the form of theta. \n\nUnless you’re saying the extrinsic value is literally less than extra commission paid + spreads, there is no way OP make less than what he did.", "score": 2, "replies": [{"body": "[deleted]", "score": 0, "replies": [{"body": "No you don’t understand, if not you would not have said this totally irrelevant point in the first place. \n\nThe price of option doesn’t matter unless you’re saying that somehow the price of option is BELOW intrinsic value. That’s the only scenario OP would have made less money compared to exercise early. \n\nStay away from options if you don’t even understand such a simple concept. This is not r/wsb.", "score": 0, "replies": []}]}]}]}, {"body": "Tell me how NFLX trades tomorrow?? I'll take and earnings trade lotto +120% gain in less than day. T o each their own. :)", "score": -4, "replies": [{"body": "The price of NFLX tomorrow is irrelevant. The math works for any price. It was impossible to make any less than you did.", "score": 10, "replies": []}, {"body": "Do you understand you have nothing to lose by not exercising, you can only make money?  By not exercising after you bought the stock, you have a free call. You have the potential to make a lot more money but will never lose what you made by exercising early.\n\nYou say to each his own, but who wouldn't want the potential to make more money with no risk?\n\nI'm happy for you that you had a great trade, but it could have potentially been much more.", "score": 4, "replies": []}]}]}]}]}, {"body": "Do you mean exercise?", "score": 9, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "Great trade.", "score": 3, "replies": []}]}]}, {"body": "Great trade! But you missed out on a little extra cash by exercising the puts. There’s some extrinsic value left between now and Friday that you instantly give up by exercising. Next time wait until the morning and sell the shares and put at the same time.", "score": 7, "replies": [{"body": "Agreed! I'm bearish, I'm just happy to exit this trade!", "score": -4, "replies": []}]}, {"body": "nice flash crash", "score": 4, "replies": [{"body": "-0.33%. what am I missing?", "score": 3, "replies": [{"body": "Was down nearly 12% just after close.", "score": 6, "replies": []}]}]}, {"body": "Awesome move. I didn't know it was possible to exercise an option after hours. Do all trading houses have that option?", "score": 0, "replies": [{"body": "Yes", "score": 1, "replies": []}]}, {"body": "Go woke go broke as they say. And nflx is full on.", "score": 0, "replies": []}, {"body": "Smart move, welcome to the big league", "score": -2, "replies": []}]}
{"title": "low iv? i think not!", "selftext": "i see a lot of comments on how a low Vix is making the market boring. so i thought id share my thoughts on this. Its important to rememver that Vix represents the IV on SPX options, a sort of market average, kind of, nothing more. While IV on SPX might be low, that doesnt mean IV on all shares is low. infact. heres a short list of stocks that currently have a raised IV.\n\n&#x200B;\n\n[Raised IV stocks \\(30d implied volatility \\/ 180d historical volatility\\)](https://preview.redd.it/6jpou0odplua1.png?width=567&format=png&auto=webp&s=b775defaeef9ec2924eef2f0f25295f12d86c646)\n\nits important to note that many of these will have earnings coming, but some do not. or atleast not for another few weeks/months. some do have big events pending, for example the activision acquisition by microsoft. so dont just blindly sell options on all of these. but there are plenty of opportunities out there right now. regardless of a low vix.  \n\n\nhappy selling to you guys!", "id": "12qfqqk", "created_utc": 1681805704.0, "score": 13, "upvote_ratio": 0.79, "num_comments": 27, "comments": [{"body": "ATVI has an important court decision regarding the pending take over in the next weeks. That would not show up if you only look for earnings.", "score": 11, "replies": [{"body": "Yes, i mentioned it didn't i?", "score": 6, "replies": [{"body": "You mentioned the acquisition, which btw is pending for months, but not that there is an important decision right around the corner.", "score": 3, "replies": [{"body": "Ah Right, atvi's iv has been raised for months. I havent specifically been following it. Thjx to adding to my point. \n\nDon't just blindly sell options on this list. Figure out why iv is raised first.", "score": 4, "replies": [{"body": "Yes, cautionary tale - I chased IV and juicy premiums on $BBIG and $MMAT now both are in the toilet (threatening Rev Sp because they are deficient), and there is no premium in site.  Down \\~90% on both.", "score": 1, "replies": []}]}]}]}]}, {"body": "Don't handicap yourself to just selling, theta pays the bills but gamma makes you rich.", "score": 7, "replies": [{"body": "i like rich, please elaborate...\n\nps. this strategy is selling Theta and Vega they really are best buddies.", "score": 2, "replies": [{"body": "Try forming a thesis about where the stock will be at a given expiration and use theta gains to finance a cheap lotto play on that expiration. Butterflies are the cheapest and least capital intensive way to long gamma so probably start there, get the average 0dte expected move at open of your underlying and buy a butterfly with the shorts centered on wherever you think price may land at some point during the day and width of wings equal to the expected move. Don't pay too much for the fly though, realistic TP is 1/3 of the width so structure the trade so that you get 2x+ returns should that realistic TP hit, e.g. pay $0.25-1 for a 10 wide butterfly on SPX with a TP of $3.", "score": 3, "replies": [{"body": "ah, i dont dable in 0dte.", "score": 1, "replies": [{"body": "ya missing out fam :)\n\nFair though, not everyone's cup of tea.", "score": 1, "replies": [{"body": "i did, years ago.", "score": 1, "replies": [{"body": "Selling boring insurance is the real way to get rich. The turtle beat the hare for a reason. This is like Bogleheads for gamblers.", "score": 2, "replies": [{"body": "Yup", "score": 2, "replies": []}]}]}]}]}]}]}]}, {"body": "This is good stuff. I sold some LNC’s 20.00 CSP expiring in May a couple weeks back.", "score": 2, "replies": [{"body": "thnx, i sold some LNC to0, weeks ago, they expire this friday.\n\nive been using this system to identify good stocks to write on sinceonly twice, my strike was broken and i closed with a loss. Damn AMC (which would have been okay if i had held) and Catalent (glad i closed that one)", "score": 2, "replies": [{"body": "Always better to close at a small loss than let it turn into a disaster so don’t stress the AMC trade.", "score": 1, "replies": []}]}]}, {"body": "I have STLA for CSP, where do you get this?", "score": 1, "replies": [{"body": "I make it myself with scraped data and lots of complicated math.", "score": 1, "replies": []}]}, {"body": "Shouldn't you be comparing apples to apples?  Like IV30 vs HV30?", "score": 1, "replies": [{"body": "well no, not really, i found the strongest correlation is actually when you take a short term iv and a long term hv. this means the iv has spiked siginificantly above the average volatility. a good scenario for iv crush.   \n\n\nyou can see more here, an older post of mine:  \nhttps://www.reddit.com/r/thetagang/comments/10nonyo/q3\\_and\\_q4\\_of\\_2022\\_a\\_summary\\_of\\_all\\_options\\_yes\\_all/", "score": 4, "replies": [{"body": "That’s some neat programming. I write code ala my own algos in PineScript on TradingView, to tell me when is the best time to sell calls or puts (alerting me on my Apple Watch), though I never thought of visualizing it this way. \n\nWhat I realized by looking at your old post, and through my own anecdotal experience, is that high or low IV for your profit and probability of profit doesn’t matter as much as the other Greeks, namely, mostly from delta, then theta. I’ve found that **timing**, when you sell to open those trades, matter immensely.\n\nIn your post, there’s a lot of green zone for the calls when IV is low, is not because IV is low, is because of the timing. 2022 Q3 & Q4 had massive down trends, and IV was falling because the trend was consistently one direction (down). Selling calls was the right move (though selling shares or buying puts would have made you more money). Selling puts, on the other hand, ended up going ITM more likely than not, and had you holding bags. \n\nBasically, pay attention more to the macro and timing, rather than high or low IV. And when IV is low, sell longer expiries. I usually sell 60-90 DTE, and lately, I’ve been selling 90-120 DTE.", "score": 2, "replies": []}, {"body": "Oh thanks. I'll give it a read.\n\nAlways looking to educate myself further.", "score": 1, "replies": []}, {"body": "link is scuffed\n\n/r/thetagang/comments/10nonyo/q3_and_q4_of_2022_a_summary_of_all_options_yes_all/", "score": 1, "replies": []}]}]}, {"body": "This is true. But it means across the board that vol is going to be lower. \n\nI think liquidity is also important, not everything mentioned here have liquid options so you’re going to be giving up a bit on the open/close", "score": 1, "replies": [{"body": "A bigger spread is also an opportunity, sometimes you just need patience.", "score": 1, "replies": [{"body": "Yeah it’s harder to get in and out at your price.\n\nJust look at my filters for a list of stocks with decent options volume, decent IV Rank (>25), and above $20 stock. The list is 20 stocks, very small universe to play in right now for premium sellers. While you can go outside of that and give up some of your ideals, you’re also giving up some edge over time.", "score": 1, "replies": [{"body": "I just showed the top 20, The list is 40 stocks, daily, and i analyse all 8000 stocks on nasdaq and NYSE and Euronext. I don't write on all of them, i check for earnings and news, and look at a graph of iv vs hv before I write.", "score": 1, "replies": []}]}]}]}]}
{"title": "[deleted by user]", "selftext": "[removed]", "id": "12qqwji", "created_utc": 1681830846.0, "score": 6, "upvote_ratio": 0.88, "num_comments": 24, "comments": [{"body": "I would do credit spreads with low capital, and F, AMD, KO, TSLA, etc for selling puts without fear of assignment", "score": 6, "replies": [{"body": "[deleted]", "score": 5, "replies": [{"body": "No. \n\nThe credit spread was the low capital suggestion. You can do it on SPX if you wanted bc you can control the width. \n\nThe F, AMD, etc we’re stocks that i wheel without fear of assignment.", "score": 1, "replies": []}]}, {"body": "I appreciate your insight. TSLA is a bit too expensive for me. KO and F may balance out to \\~7000.00 together so I will keep an eye out on those.", "score": 2, "replies": [{"body": "I personally like F more, IV on KO is really low so premiums are horrendous, F has great premiums and a better dividend yield, for a lot less cap requirements.", "score": 1, "replies": [{"body": "I’m getting a bonus. Around 7 to 8k. I’m looking at the dividend and premiums for F. I think this would be a good wheel for me. Im interested", "score": 1, "replies": []}]}, {"body": "TSLL is an option if you can stomach it. 1.5x bull TSLA, trading around $10/share atm", "score": 1, "replies": []}]}]}, {"body": "I started with similar capital. For me it was SPLG (which is basically SPY but you don’t need 40k$ to wheel it) and on top some more volatile stocks that yield higher premiums like eg. PLTR and HPQ", "score": 4, "replies": [{"body": "I was looking at SPLG prior but will keep a closer eye on it. I appreciate it!", "score": 1, "replies": [{"body": "Price of SPLG looks good but the volume doesn’t", "score": 1, "replies": []}]}, {"body": "What were your strategies when you had smaller capital? Selling csp or spreads?", "score": 1, "replies": [{"body": "In order for spread to be a good theta strategy a spread itself should be relatively wide, I had a bad experience with this in general, I was right 5 times in a row just to see 6th trade to take all of my gains. In over 100 of vertical spread trades that I took I think I barely broke even. CSP is better as when you pick a stock you are okay to own there is really no risk. The only time when Im selling vertical spread is when the stock I want to wheel is overbought what I do in such condition is Jade Lizard strategy, so I sell the put and call spread at the same time Im getting extra credit that compensates me a theoretically bigger risk of assignment on my short put, if stocks rallies and my call spread ends in the money I don’t lose that much.", "score": 1, "replies": []}]}]}, {"body": "It depends on your tolerance to risk. You made some great options on stock that topically are not volatile which means low premium.", "score": 3, "replies": [{"body": "Risk tolerance is fairly high. I am in my mid 20s. I will be wheeling in a non-tax advantage account which will suck but hey if I have to pay taxes that means I've made at least a penny. Granted I am being dumb as the 7k is part of my 9k not so \"emergency\" fund so now I am down to 2k hard cash +7k to wheel with just incase an oh shit moment happens to me.", "score": 3, "replies": [{"body": "If this 7k is part of your emergency fund, it should stay in something like savings account or money market account.  Why would you take on risk to make 5% APY when my vanguard money market is something like 4.7% for just sitting there?  And if you're deploying almost 80% of your emergency fund, it's possible that you'll need it, not have it available, and either take a loss to get it back or need to take on debt to get by.  If you really want to get started, try a paper trading account for a little bit while your 9k earns 4+% risk free somewhere.", "score": 3, "replies": [{"body": "While in fidelity it will earn the 4% or what not via SPAXX while I use it for CSP; that's why I was looking at a semi OTM KO option for near term expiry. But indeed it should stay in my emergency fund.", "score": 2, "replies": []}]}]}]}, {"body": "I'm doing weekly iron condors on KO rn. But the trades fees get expensive.", "score": 3, "replies": []}, {"body": "Avoid the credit spread offer. It does contain more risk that tends to get realized more often in more volatile stocks. aka TSLA. If you decide to do some do 1 lot at an amount your comfortable losing. 1 bad credit spread can wipe out 10 good CSP trades.\n\nMy sons trading account is all CSP's we try not to own. He started at 2k and is up to 6k after 3 years of trading and saving.\n\nSOFI, RIOT, F, AAL,PLTR, UNG are all in the mix. UNG has been a nice play with it getting below 7.", "score": 2, "replies": []}, {"body": "I’d recommend using only 1/3 of your emergency fund. You can learn to wheel with 3K. \n\nSomeone suggested Ford (F).  Premium is low but it is steady. While you are doing that, make you a stock list of other stocks to wheel. The more risk of movement, the higher them premium. So if you want more premium, start watching riskier stocks, and learn their habits/trends. PLTR,MARA, AFRM, these are all in your price range, but have a higher risk/reward. Check the news, research ER, basically do all your DD. \n\nHope that helps…by the way….Not Financial Advice…DO YOUR OWN RESEARCH. my CYA is complete.", "score": 2, "replies": [{"body": "I appreciate your reply. What do you look for in stocks that you want to wheel? I know you had mentioned more risk = more premium but is there anything you look for or try to avoid?", "score": 1, "replies": []}, {"body": "Unless you are actually a financial advisor you don’t need to specify you aren’t giving financial advice.\n\nI’m not sure what started the trend of adding the stupid “NFA” tag to comments but it’s just a way of letting everyone else know you’re a dumbass.", "score": 1, "replies": []}]}, {"body": "No, you should have more capital to wheel if you desire long term success.", "score": 1, "replies": []}, {"body": "I've been selling puts on 3x etfs lately. I expect a range bound market for the foreseeable future, so I am aware and content with the risk (small part of the portfolio). Mostly SOXL and SOXS, usually one or the other, but sometimes simultaneously, depending on the charts.\n\nSelling short dated (1-2 week) SOXS against long dated and lower strike puts on SOXS. Long dated puts are a safety net in case the market gets bullish. Usually will roll the puts to avoid assignment. Don't really want to own SOXS, but ok to play in a range bound market.\n\nSelling short dated puts on SOXL, mostly without a safety net. Would not mind owning SOXL.\n\nAlso TQQQ and TNA from time to time. \n\n3x etfs can be wild, but it's been working well for the past several months.", "score": 1, "replies": []}, {"body": "KO, it’s been doing OK, should be a good CC", "score": 1, "replies": []}]}
{"title": "Time to buy Tesla ($TSLA) stock before Q1 earnings?", "selftext": "[removed]", "id": "12qqt64", "created_utc": 1681830747.0, "score": 11, "upvote_ratio": 0.74, "num_comments": 21, "comments": [{"body": "Did you really just copy and paste an article?", "score": 1, "replies": []}, {"body": "Ah yes, Tesla is up 83%, WSB \"its time to buy\"", "score": 13, "replies": [{"body": "Puts it is.", "score": 4, "replies": [{"body": "Lol damn wall street", "score": 1, "replies": []}]}, {"body": "Classic WSB", "score": 1, "replies": []}]}, {"body": ">I think Tesla is a great company and their stock is undervalued. I'm not sure if now is the best time to invest, but I would keep an eye on it.", "score": 9, "replies": [{"body": "Nice try Mr Elon", "score": 7, "replies": [{"body": "Mr Elon Musk is a good businessman", "score": 0, "replies": []}]}]}, {"body": "Buy stock?  Exactly what do you think we do here in WSB?", "score": 12, "replies": [{"body": "FDs is all I heard", "score": 1, "replies": []}]}, {"body": "Just the post I needed in making me feel good about exploring puts", "score": 5, "replies": [{"body": "put option?", "score": 2, "replies": []}]}, {"body": "You wanna know my DD?  \nStock only either go up or down\n\nur better off betting on a 50% 50% \n\nAfterall its tesla", "score": 6, "replies": []}, {"body": "He’s hosting it on twitter. Probably won’t be shit if it’s premiering there", "score": 3, "replies": [{"body": "Link to original tweet I’m intrigued", "score": 1, "replies": []}]}, {"body": "TSLA only had $2.7B in FCF in Q4 after a 1.8B CapEx spend.  If you halve your margin (\\~7.5%) and maintain or increase your CapEx, you just killed your FCF.\n\n&#x200B;\n\nTSLA is going to have a hard time as a company making ends meet if they trend towards normal industry margins and their PE premium will be destroyed.", "score": 2, "replies": [{"body": "I don't know what this means, but you used lots of acronyms and one of these things ~ so you must be smart. Should I buy puts?", "score": 1, "replies": [{"body": "Not smart, but thanks.\n\n&#x200B;\n\nWon't touch TSLA until I see their margin decreasing as a trend (consecutive declines).\n\n&#x200B;\n\nTSLA could make that 0.85 consensus EPS if they just invested $3B in bitcoin after 12/31.  That would have been a +$1.8B rip along with interest on the other $10B in cash.  As long as the rest of his operations didn't lose money, just broke even, you have the 0.85 EPS.\n\n&#x200B;\n\nAnd I don't think Elon wanted to sell bitcoin last year when he did, so I wouldn't put is past him to have jumped back in at a better entry for the company and under better rules (FASB changed rules in 2022).", "score": 2, "replies": []}]}]}, {"body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions**|10|**First Seen In WSB**|1 month ago\n**Total Comments**|123|**Previous Best DD**|\n**Account Age**|1 year|[^scan ^comment ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_comment&message=Replace%20this%20text%20with%20a%20comment%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20comment%20and%20correct%20your%20first%20seen%20date.)|[^scan ^submission ](https://www.reddit.com/message/compose/?to=VisualMod&subject=scan_submission&message=Replace%20this%20text%20with%20a%20submission%20ID%20(which%20looks%20like%20h26cq3k\\)%20to%20have%20the%20bot%20scan%20your%20submission%20and%20correct%20your%20first%20seen%20date.)\n>TL;DR: Tesla stock is a hold going into its Q1 report and looks like a great long-term growth play despite recent price cuts.", "score": 1, "replies": []}, {"body": "He means “buy calls” btw", "score": 1, "replies": []}, {"body": "![img](emote|t5_2th52|4259)", "score": 1, "replies": []}]}
