{"title": "85% of insured Amazon (AMZN) Prime memebers open to buying drugs on the website,", "selftext": "cites Deutsche Bank", "id": "9f02hg", "created_utc": 1536690355.0, "score": 246, "upvote_ratio": 0.96, "num_comments": 86, "comments": [{"body": "I'd buy my meds from Amazon if they can undercut the current market which they most likely will. Only problem is the rate of crack heads and heroin fiends stealing packages off front porches is gonna skyrocket after they find out about this.", "score": 168, "replies": [{"body": "Amazon can deliver inside your house now with ring ", "score": 52, "replies": [{"body": "Now you have some jackass wondering around your house or walking in on you beating it to tranny porn. ", "score": 72, "replies": [{"body": "Alex jones delivers for Amazon? Tbh that’d be wonderful. ", "score": 6, "replies": []}, {"body": "Well move out of your mom's basement or grow a pair and lock the door.", "score": -24, "replies": [{"body": "Do you realize that you’re telling me to lock the door on a string about amazon being able to unlock your door to deliver packages in your home.?\n\nAlso I just make eye contact while jerking it ferociously when they deliver my packages, that’s my real kink.  The tranny porn on the flat screen is just for their own comfort. ", "score": 52, "replies": [{"body": "Did you just refer to a thread as a string", "score": 28, "replies": [{"body": "Fuck you got me.  ", "score": 20, "replies": [{"body": "Lmao", "score": 2, "replies": []}]}, {"body": "Why hello fellow yolodudes!\n", "score": 4, "replies": []}]}, {"body": "Go on...", "score": -3, "replies": []}]}, {"body": ">grow a pair and lock your door\n\nWhat the fuck? How does it take balls to lock yourself inside your fuckin house?", "score": 18, "replies": [{"body": "My will get angry and take away fortnite.", "score": -5, "replies": [{"body": "I found the true autist among us", "score": 1, "replies": []}]}]}]}]}, {"body": "I don't want some asshole in my house. what if he finds the good drugs. ", "score": 11, "replies": []}, {"body": "I think they're still rolling it out to regions bc I live in a pretty major city and it still isn't available around me ", "score": 7, "replies": []}, {"body": "In the UK I just get amazon to deliver to my workplace where we have a delivery desk staffed 10 hours a day, why don't more people in the US do this?", "score": 1, "replies": []}]}, {"body": "\"Signature Required\" is always an option for expensive/dangerous/higher-margin goods. ", "score": 18, "replies": [{"body": "Scribbles non-sense on the broken screen and broken stylus. ", "score": 15, "replies": []}, {"body": "This is true", "score": 3, "replies": []}]}, {"body": "Y'all dumbasses realize that there's already tons of companies that deliver prescriptions to homes and the insurance industry has a fucking lock on them, right? \n\nYou ain't getting shit that you can't already get from Amazon or OTC unless the insurance company approves it.", "score": 7, "replies": []}, {"body": "Those Amazon Lockers have popped up all over my city. Just have it delivered there and go pick it up.", "score": 14, "replies": [{"body": "Kinda like a pharmacy.... Lol ", "score": 12, "replies": []}]}, {"body": "Holy shit dude I didn't even think of this.  **I'm** gonna steal fuckin Percocets off your porch!", "score": 4, "replies": [{"body": "i'm gonna swap out the percs with fent, seal the box back up, and leave it in plain sight for you. gonna keep doing this until i singlehandedly reduce the homeless population in my city to 0.", "score": 10, "replies": [{"body": "Free fent broooo!!!!", "score": 3, "replies": [{"body": "I'll know that but you won't.", "score": 2, "replies": []}]}]}]}, {"body": "honestly with the instant market share they'd have, Amazon would have no problem creating their own pharmacy benefit manager. I think they want more than that, though.", "score": 3, "replies": [{"body": "They want the world Chico. And everything in it", "score": 5, "replies": []}]}, {"body": "No, they will not undercut the market.  Pricing is not determined by the pharmacy for the most part.  It is determined by your insurer.  ", "score": 3, "replies": []}, {"body": "But what will happen to all the small mom & pop pharma companies?", "score": 1, "replies": []}, {"body": "If they're narcotics you have to sign for them. If you miss the delivery for a few days you have to pick them up from the sorting facility.  ", "score": 1, "replies": []}]}, {"body": "[deleted]", "score": 87, "replies": [{"body": "I don't see how they are going to get around that.  Last two times I got hydrocodoneI had to get a script written and taken to pharmacy.  They could not call it in, had to be face to face.\n\n&#x200B;\n\nThen they only gave me like 6 last time.", "score": 8, "replies": [{"body": "Surely Amazon will have checks and balances in place to prevent users from getting narcotics. ", "score": 2, "replies": [{"body": "That’s just poor customer service then. ", "score": 9, "replies": [{"body": "Maybe we can start our own business?", "score": 5, "replies": []}]}]}]}]}, {"body": "\"So, what do you do?\" \n\n> Oh, I'm a pharmacist. \n\n\"Oh cool, like at CVS?\" \n\n> No, at Amazon.", "score": 54, "replies": [{"body": "Amazon: what is a pharmacist?", "score": 29, "replies": [{"body": "Bezos: We pulled four machine learning engineers off the Alexa NLP team and asked them to create a pharmacist AI that could pass the NAPLEX, it was surprisingly easy. The best part is, the AI doesn't even have to go to the bathroom!", "score": 59, "replies": [{"body": "Nether do amazon ware house workers. They use bottles", "score": 26, "replies": [{"body": "Amazon's efficiency is truly amazing", "score": 16, "replies": [{"body": "I’m not gonna be impressed until their AI is pissing in bottles. ", "score": 7, "replies": []}]}, {"body": "Soon their cages will have built in toilets, how neat is that!", "score": 6, "replies": [{"body": "Waste provided will be turned into biofuel or mars like potato crops.", "score": 4, "replies": []}]}, {"body": "looool. Funny but sad at the same time. As much as I love tendies, I do believe that amazon needs to treat their staff better.", "score": 1, "replies": []}]}, {"body": "The sad part is that most retail pharmacists are replaceable. Most of their job duties are repetitive and they're so busy that they end up doing a poor job at the duties that aren't repetitive. ", "score": 1, "replies": []}]}]}]}, {"body": "Amazon taking $TLRY private at $420", "score": 21, "replies": []}, {"body": "AMZN be my weed dealer too?", "score": 32, "replies": [{"body": "AMZN Blaze.", "score": 24, "replies": [{"body": "Give it a decade and Amazon will have drone-based weed delivery straight to your basement. ", "score": 9, "replies": [{"body": "I'm not interested until I can have a sparked blunt delivered right to my mouth.", "score": 2, "replies": []}]}, {"body": "AMZN TO 4200. DADDY FUNDING SECURED", "score": 6, "replies": []}]}, {"body": "SHOP's already Canada's weed dealer. I don't see why AMZN couldn't own US distribution. ", "score": 3, "replies": []}]}, {"body": "Surprised it's as low as 85%.  The experience of buying drugs at a pharmacy sucks dick.\n\nHopefully they fully integrate with insurers so that pricing is completely transparent.", "score": 36, "replies": [{"body": "Yeah, I have a Rite Aid one block away and it still sucks. With electronic prescriptions so widespread I think that a shift to shipping prescriptions could happen quickly.", "score": 12, "replies": [{"body": "I walk past a right aid and get my drugs at the grocery store because drug stores are sad and terrible", "score": 1, "replies": [{"body": "And I walk past the grocery store and go around the corner to the alley where I meet Juan, his prices usually aren't bad. ", "score": 8, "replies": [{"body": "I goto my basement and grind up a planet I grew in 78 days. I am a modern medicine man. AMA", "score": 5, "replies": [{"body": "Did any sentient species evolve before you destroyed it?", "score": 2, "replies": []}]}, {"body": "I just get tacos from Juan", "score": 1, "replies": []}]}]}]}, {"body": "This is bad for ~~MU~~ CVS and WBA ", "score": 3, "replies": [{"body": "Soon: CVS and/or WBA to strike deal with WMT....and still no one will use WMT's website. Lol.", "score": -2, "replies": []}]}]}, {"body": "Shit yeah! Cant wait do download a hoagie and an 8th of some sticky icky.", "score": 9, "replies": []}, {"body": "I work for a large telehealth company. Online prescriptions are very tightly regulated and I'd be shocked if this included Scheduled substances. It would be an incredible liability for Amazon to be responsible for shipments of Adderall, Vicodin, Xanax, etc. ", "score": 9, "replies": [{"body": "They'd just acquire some company that is licensed to do so and use their license (however I thought they already did that?).", "score": 4, "replies": []}, {"body": "Xanax is sittin pretty at Schedule IV though, regulations might be looser....like my inhibitions when I eat a fistful of Xanax.  How has this shit not been rescheduled to at least 3 by now, fucking crazy.", "score": 4, "replies": [{"body": "What loser keeps downvoting all of these drug jokes? Are one of you in recovery and butthurt that you can’t pop pills anymore?", "score": 3, "replies": [{"body": "Dude that wasn't even a joke, how the fuck are benzos still schedule IV!?  They're crazy addictive, I'm actually a year removed from a benzos problem lol.", "score": 3, "replies": [{"body": "[deleted]", "score": 2, "replies": [{"body": "Yeah, definitely try and keep the use sporadic.  They're nasty little fuckers.", "score": 2, "replies": []}]}]}]}]}]}, {"body": "Now you can get your Benzos from Bezos \n\nyour weed from the Amazon\n\nand your opioids from the bookstore", "score": 7, "replies": []}, {"body": "Ross Ulbricht died for this ", "score": 6, "replies": []}, {"body": "This is good for AMZN.", "score": 10, "replies": []}, {"body": "This guy cut the price of pharmaceuticals by 87%! Insurance companies hate him!", "score": 5, "replies": []}, {"body": "There's enough fakes on amazon, that could be risky business.", "score": 6, "replies": []}, {"body": "silk road 3.0", "score": 7, "replies": []}, {"body": "Will switch over as soon as they offer it if they can undercut or even match ExpressScripts. Fuckers take too long, gimme dat 2 day delivery", "score": 3, "replies": [{"body": "ExpressScripts was so shitty when I used them. Never process my subscriptions. Send me my mother's med to my apt. ", "score": 1, "replies": []}, {"body": "I'd pay Amazon more if they made it easy and fully automated. My last visit I had to print a sheet of paper out and have my doctor FAX a prescription form to express scripts. FAX! They wanted to make sure it was actually my doctor sending it in or something.\n\nIt's insane how inefficient IT systems are in healthcare.", "score": 1, "replies": []}]}, {"body": "I order and get mailed my drugs from the VA through their website. Its easy and efficient. Should work well in private sector too.", "score": 1, "replies": []}, {"body": "I send an email to my doctor and they two day ship my meds through ups. Haven't been to a pharmacy in 3 years.", "score": 1, "replies": []}, {"body": "Imagine the potential ? Weed gets legalized everywhere , Amazon buy/grows/ process the largest amount in the nation, distributes to customers in every state, throws in free ounce with your order over $99 lol ", "score": 1, "replies": []}, {"body": "Funding secured", "score": 1, "replies": []}, {"body": "can't wait for the stock split so I can actually afford to buy AMZN shares.\n\nCOme on BEZOS do the split so us plebs can get in on it. ", "score": 1, "replies": []}, {"body": "2100 FDs here we goooooo", "score": 0, "replies": []}]}
